Функция МаршрутизироватьЗапрос(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка,
	               |	Маршрутизация.Организация КАК Организация,
	               |	Маршрутизация.Резидент КАК Резидент,
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	Маршрутизация.Контрагент КАК Контрагент,
				   //|	Маршрутизация.Договор КАК Договор,
				   //|	Маршрутизация.ВидПеревозки КАК ВидПеревозки,
				   //Стало:
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор,
				   |	ЕСТЬNULL(МаршрутизацияВидыПеревозок.ВидПеревозки, ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ПустаяСсылка)) КАК ВидПеревозки,
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	Маршрутизация.ИсточникЗапроса КАК ИсточникЗапроса
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.КонтрагентыИДоговоры КАК МаршрутизацияКонтрагентыИДоговоры
				   |		ПО (МаршрутизацияКонтрагентыИДоговоры.Ссылка = Маршрутизация.Ссылка)
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.ВидыПеревозок КАК МаршрутизацияВидыПеревозок
				   |		ПО (Маршрутизация.Ссылка = МаршрутизацияВидыПеревозок.Ссылка)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.ЗапросКлиента)
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ОрганизацияПустая
	               |				ТОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.Организация = &Организация
	               |					ИЛИ Маршрутизация.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &Резидент
	               |				ТОГДА Маршрутизация.Резидент
	               |			ИНАЧЕ Маршрутизация.Нерезидент
	               |		КОНЕЦ 
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было: 
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.КонтрагентПустой
				   //|				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Контрагент = &Контрагент
				   //|					ИЛИ Маршрутизация.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|		КОНЕЦ
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.ДоговорПустой
				   //|				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Договор = &Договор
				   //|					ИЛИ Маршрутизация.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|		КОНЕЦ
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ПустаяСсылка)
				   //|				ТОГДА ИСТИНА
				   //|			ИНАЧЕ Маршрутизация.ВидПеревозки = &ВидПеревозки
				   //|		КОНЕЦ
				   //Стало:
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.КонтрагентПустой
				   |				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = &Контрагент
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
			       |	КОНЕЦ
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.ДоговорПустой
				   |				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = &Договор
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |	КОНЕЦ
			       |	И ВЫБОР
				   |			КОГДА ЕСТЬNULL(МаршрутизацияВидыПеревозок.ВидПеревозки, ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ПустаяСсылка)
				   |				ТОГДА ИСТИНА
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияВидыПеревозок.ВидПеревозки, ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ПустаяСсылка)) = &ВидПеревозки
				   |	КОНЕЦ
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
				   |	И ВЫБОР
	               |			КОГДА Маршрутизация.ИсточникЗапроса = ЗНАЧЕНИЕ(Перечисление.ИсточникиЗапросов.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ Маршрутизация.ИсточникЗапроса = &ИсточникЗапроса
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("Контрагент", ПараметрыЗапроса["Контрагент"]);
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса["Организация"]);
	Запрос.УстановитьПараметр("Договор", ПараметрыЗапроса["Договор"]);
	Запрос.УстановитьПараметр("ВидПеревозки", ПараметрыЗапроса["ВидПеревозки"]);
	Запрос.УстановитьПараметр("ВидПеревозкиПустой", НЕ ЗначениеЗаполнено(ПараметрыЗапроса["ВидПеревозки"]));
	Запрос.УстановитьПараметр("ИсточникЗапроса", ПараметрыЗапроса["ИсточникЗапроса"]);
	Запрос.УстановитьПараметр("ИсточникЗапросаПустой", НЕ ЗначениеЗаполнено(ПараметрыЗапроса["ИсточникЗапроса"]));
	Запрос.УстановитьПараметр("Резидент", ПараметрыЗапроса["Резидент"]);
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		Если ЗначениеЗаполнено(Ответ["Контрагент"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Организация"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Договор"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["ВидПеревозки"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["ИсточникЗапроса"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Резидент"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения,ИсполнительКакРуководительПоНаправлению,НаблюдательКакРуководительПоНаправлению, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения,Стр.ИсполнительКакРуководительПоНаправлению,Стр.НаблюдательКакРуководительПоНаправлению, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.ЗапросКлиента, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.ЗапросКлиента, ДатаДокумента, ПараметрыЗапроса["ВидПеревозки"]);
	Возврат РезультатЗапроса;
	
КонецФункции

Функция МаршрутизироватьЗакрытиеПериода(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка,
	               |	Маршрутизация.Организация КАК Организация
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.ЗакрытиеПериода)
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ОрганизацияПустая
	               |				ТОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.Организация = &Организация
	               |					ИЛИ Маршрутизация.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса["Организация"]);
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		Если ЗначениеЗаполнено(Ответ["Организация"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.ЗакрытиеПериода, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	Возврат РезультатЗапроса;
	
КонецФункции

//Евросиб Каблов 09.04.2025 #105407
Функция МаршрутизироватьЗакрытиеПериодаДоходов(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка,
	               |	Маршрутизация.Организация КАК Организация
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.ЗакрытиеПериодаДоходов)
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ОрганизацияПустая
	               |				ТОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.Организация = &Организация
	               |					ИЛИ Маршрутизация.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса["Организация"]);
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		Если ЗначениеЗаполнено(Ответ["Организация"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.ЗакрытиеПериодаДоходов, ДатаДокумента);
	Возврат РезультатЗапроса;
	
КонецФункции

//Евросиб Каблов 09.04.2025 #105407
Функция МаршрутизироватьЗакрытиеПериодаРасходов(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка,
	               |	Маршрутизация.Организация КАК Организация
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.ЗакрытиеПериодаРасходов)
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ОрганизацияПустая
	               |				ТОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.Организация = &Организация
	               |					ИЛИ Маршрутизация.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса["Организация"]);
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		Если ЗначениеЗаполнено(Ответ["Организация"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.ЗакрытиеПериодаРасходов, ДатаДокумента);
	Возврат РезультатЗапроса;
	
КонецФункции

Функция МаршрутизироватьКредитнуюЗаявку(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка,
	               |	Маршрутизация.Организация КАК Организация,
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	Маршрутизация.Договор КАК Договор,
				   //|	Маршрутизация.Контрагент КАК Контрагент, 
				   //Стало:
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор,
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	Маршрутизация.ЦФО КАК ЦФО
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.КонтрагентыИДоговоры КАК МаршрутизацияКонтрагентыИДоговоры
				   |		ПО (МаршрутизацияКонтрагентыИДоговоры.Ссылка = Маршрутизация.Ссылка)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.КредитнаяЗаявка)
	               |	И (Маршрутизация.Организация = &Организация
	               |			ИЛИ Маршрутизация.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) 
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	И (Маршрутизация.Контрагент = &Контрагент
				   //|			ИЛИ Маршрутизация.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
				   //|	И (Маршрутизация.Договор = &Договор
				   //|			ИЛИ Маршрутизация.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) 
				   //Стало:
				   |	И (ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = &Контрагент
				   |			ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
				   |	И (ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = &Договор
				   |			ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка))		
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	И (Маршрутизация.ЦФО = &ЦФО
	               |			ИЛИ Маршрутизация.ЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка))
	               |	И &ЛимитПДЗ МЕЖДУ Маршрутизация.ЛимитДЗОт И Маршрутизация.ЛимитДЗДо
	               |	И (Маршрутизация.КатегорияДоговора = &КатегорияДоговора
	               |			ИЛИ Маршрутизация.КатегорияДоговора = ЗНАЧЕНИЕ(Справочник.КатегорииДоговоров.ПустаяСсылка))";
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса["Организация"]);
	Запрос.УстановитьПараметр("Контрагент", ПараметрыЗапроса["Контрагент"]);
	Запрос.УстановитьПараметр("Договор", ПараметрыЗапроса["ДоговорКонтрагента"]);
	Запрос.УстановитьПараметр("КатегорияДоговора", ПараметрыЗапроса["ДоговорКонтрагента"].КатегорияДоговора);
	Запрос.УстановитьПараметр("ЦФО", ПараметрыЗапроса["ЦФО"]);
	Запрос.УстановитьПараметр("ЛимитПДЗ", ПараметрыЗапроса["ЛимитДЗ_Факт"]);
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		Если ЗначениеЗаполнено(Ответ["Организация"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Контрагент"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Договор"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["ЦФО"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.ЗакрытиеПериода, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	Возврат РезультатЗапроса;
	
КонецФункции

Функция МаршрутизироватьЗаявку(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка,  
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	Маршрутизация.Контрагент КАК Контрагент,
				   //|	Маршрутизация.Договор КАК Договор,  
				   //|	Маршрутизация.ВидПеревозки КАК ВидПеревозки,
				   //Стало:
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор,
				   |	ЕСТЬNULL(МаршрутизацияВидыПеревозок.ВидПеревозки, ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ПустаяСсылка)) КАК ВидПеревозки,
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	Маршрутизация.Организация КАК Организация,
	               |	Маршрутизация.ПротоколНеУказан КАК ПротоколНеУказан,
				   //Евросиб - АСуслов 24.12.2021 11:14:39 #44642
				   //(
				   //|	Маршрутизация.УказанРейс КАК УказанРейс,
				   //)
				   //Евросиб - АСуслов 24.12.2021 11:14:43 #44642
	               |	Маршрутизация.ИсточникЗаявки КАК ИсточникЗаявки,
				   // Евросиб Фролов (16.11.2021 TASK №41969
				   |	Маршрутизация.ЗапросНаКТК КАК ЗапросНаКТК,
				   // Евросиб Фролов)
				   // Евросиб US 126930 TA 126932 Рыбьяков К.А. 25.01.2026 ((
				   |	Маршрутизация.ЛокацияВыдачи
				   // Евросиб Рыбьяков К.А. 25.01.2026 ))
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.ВидыПеревозок КАК МаршрутизацияВидыПеревозок
				   |		ПО (Маршрутизация.Ссылка = МаршрутизацияВидыПеревозок.Ссылка)
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.КонтрагентыИДоговоры КАК МаршрутизацияКонтрагентыИДоговоры
				   |		ПО (Маршрутизация.Ссылка = МаршрутизацияКонтрагентыИДоговоры.Ссылка)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
				   // Евросиб US 126930 TA 126932 Рыбьяков К.А. 25.01.2026 ((
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации КАК Мультилокации
				   |		ПО Маршрутизация.ЛокацияВыдачи = Мультилокации.Ссылка
				   // Евросиб Рыбьяков К.А. 25.01.2026 ))
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.ЗаявкаКлиента)
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ОрганизацияПустая
	               |				ТОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.Организация = &Организация
	               |					ИЛИ Маршрутизация.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ИсточникЗаявки = ЗНАЧЕНИЕ(Перечисление.ИсточникЗаявок.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ Маршрутизация.ИсточникЗаявки = &ИсточникЗаявки
	               |		КОНЕЦ  
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:   
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.КонтрагентПустой
				   //|				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Контрагент = &Контрагент
				   //|					ИЛИ Маршрутизация.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|		КОНЕЦ
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.ДоговорПустой
				   //|				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Договор = &Договор
				   //|					ИЛИ Маршрутизация.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|		КОНЕЦ
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ПустаяСсылка)
				   //|				ТОГДА ИСТИНА
				   //|			ИНАЧЕ Маршрутизация.ВидПеревозки = &ВидПеревозки
				   //|		КОНЕЦ 
				   //Стало:
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.КонтрагентПустой
				   |				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = &Контрагент
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |		КОНЕЦ
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.ДоговорПустой
				   |				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = &Договор
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |		КОНЕЦ
				   |	И ВЫБОР
				   |			КОГДА ЕСТЬNULL(МаршрутизацияВидыПеревозок.ВидПеревозки, ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ПустаяСсылка)
				   |				ТОГДА ИСТИНА
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияВидыПеревозок.ВидПеревозки, ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ПустаяСсылка)) = &ВидПеревозки
				   |		КОНЕЦ
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	И Маршрутизация.НаМоментЗаписиБылаЗадолженность = &НаМоментЗаписиБылаЗадолженность
				   //Евросиб - АСуслов 24.12.2021 11:14:56 #44642
				   //(
				   //|	И Маршрутизация.УказанРейс = &УказанРейс
				   //)
				   //Евросиб - АСуслов 24.12.2021 11:15:02 #44642
				   // Евросиб Фролов (16.11.2021 TASK №41969
				   |	И Маршрутизация.ЗапросНаКТК = &ЗапросНаКТК
				   // Евросиб Фролов)
				   //|	И ВЫБОР
				   //|			КОГДА НЕ Маршрутизация.ПротоколНеУказан
				   //|				ТОГДА ИСТИНА
				   //|			ИНАЧЕ Маршрутизация.ПротоколНеУказан = &ПротоколНеУказан
				   //|		КОНЕЦ
 				   //|	И Маршрутизация.УсловияОплаты = &УсловияОплаты";  
	               //|	И  Маршрутизация.ПротоколНеУказан = &ПротоколНеУказан  // ДИТ US 76975 ТА 76977 Сержантова А.С. Начало: 15.11.2023
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.УсловияОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыУсловийОплаты.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ Маршрутизация.УсловияОплаты = &УсловияОплаты
	               |		КОНЕЦ";

  // Евросиб Гудкова)
	Запрос.УстановитьПараметр("НаМоментЗаписиБылаЗадолженность", ПараметрыЗапроса["НаМоментЗаписиБылаЗадолженность"]);
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса["Организация"]);
	Запрос.УстановитьПараметр("Контрагент", ПараметрыЗапроса["Контрагент"]);
	//Евросиб - АСуслов 24.12.2021 11:15:17 #44642
	//(
	//Запрос.УстановитьПараметр("УказанРейс", ПараметрыЗапроса["УказанРейс"]);
	//)
	//Евросиб - АСуслов 24.12.2021 11:15:20 #44642
	Запрос.УстановитьПараметр("Договор", ПараметрыЗапроса["Договор"]);
	Запрос.УстановитьПараметр("ВидПеревозки", ПараметрыЗапроса["ВидПеревозки"]);
	Запрос.УстановитьПараметр("ВидПеревозкиПустой", НЕ ЗначениеЗаполнено(ПараметрыЗапроса["ВидПеревозки"]));
	Запрос.УстановитьПараметр("ИсточникЗаявки", ПараметрыЗапроса["ИсточникЗаявки"]);  
	// ДИТ US 76975 ТА 76977 Сержантова А.С. Начало: 15.11.2023
	//Запрос.УстановитьПараметр("ПротоколНеУказан", ПараметрыЗапроса["ПротоколНеУказан"]);
	// ДИТ US 76975 ТА 76977 Сержантова А.С. Конец: 15.11.2023
	
	//Евросиб - АСуслов 20.08.2020 18:29:46 #0200719 
	//(
	Запрос.УстановитьПараметр("УсловияОплаты", ПараметрыЗапроса["Договор"].УсловиеОплаты);
	//)
	//Евросиб - АСуслов 20.08.2020 18:29:47 #0200719
	// Евросиб Фролов (16.11.2021 TASK №41969
	Запрос.УстановитьПараметр("ЗапросНаКТК", ПараметрыЗапроса["ЗапросНаКТК"]);
	// Евросиб Фролов)
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		Если ЗначениеЗаполнено(Ответ["Контрагент"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Организация"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["ВидПеревозки"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли; 
		// ДИТ US 76975 ТА 76977 Сержантова А.С. Начало: 15.11.2023
		//Если Ответ["ПротоколНеУказан"] = ПараметрыЗапроса["ПротоколНеУказан"] Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		// ДИТ US 76975 ТА 76977 Сержантова А.С. Конец: 15.11.2023
		//Евросиб - АСуслов 24.12.2021 11:15:34 #44642
		//(
		//Если Ответ["УказанРейс"] = ПараметрыЗапроса["УказанРейс"] Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		//)
		//Евросиб - АСуслов 24.12.2021 11:15:37 #44642
		Если ЗначениеЗаполнено(Ответ["Договор"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["ИсточникЗаявки"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		// Евросиб Фролов (16.11.2021 TASK №41969
		Если Ответ["ЗапросНаКТК"] = ПараметрыЗапроса["ЗапросНаКТК"] Тогда
			КоличествоСовпадений = КоличествоСовпадений + 1;
		КонецЕсли;
		// Евросиб Фролов)
		
		// Евросиб US 126930 TA 126932 Рыбьяков К.А. 25.01.2026 ((
		Если Ответ["ЗапросНаКТК"] И Ответ["ВидПеревозки"] = Справочники.ВидыПеревозок.Внутрироссийская Тогда
			РезультатЗапросаЛокаций = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ответ.ЛокацияВыдачи, "Локации");
			Если ЗначениеЗаполнено(РезультатЗапросаЛокаций) Тогда
				ТаблицаЛокаций = РезультатЗапросаЛокаций.Выгрузить();
				ЕстьСовпаденияПоЛокации = Ложь;
				Для Каждого Строка Из ТаблицаЛокаций Цикл
					ЛокацияНайдена = ПараметрыЗапроса["ЛокацииВыдачи"].Найти(Строка.Локация);
					Если ЛокацияНайдена <> Неопределено Тогда
						ЕстьСовпаденияПоЛокации = Истина;
					КонецЕсли;
				КонецЦикла;
				Если ЕстьСовпаденияПоЛокации Тогда
					ПодходящаяМаршрутизация = Ответ.Ссылка;
					Прервать;
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		// Евросиб Рыбьяков К.А. 25.01.2026 ))
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения,ИсполнительКакРуководительПоНаправлению,НаблюдательКакРуководительПоНаправлению, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения,Стр.ИсполнительКакРуководительПоНаправлению,Стр.НаблюдательКакРуководительПоНаправлению, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.ЗаявкаКлиента, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.ЗаявкаКлиента, ДатаДокумента, ПараметрыЗапроса["ВидПеревозки"]);
	// Евросиб US 114823 TA 116919 Рыбьяков К.А. 17.08.2025 ((
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.ЗаявкаКлиента, ДатаДокумента, ПараметрыЗапроса["ВнутреннийСтатусЗапроса"], ПараметрыЗапроса);
	// Евросиб Рыбьяков К.А. 17.08.2025 ))
	Возврат РезультатЗапроса;
	
КонецФункции

Функция МаршрутизироватьБукинг(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка,
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	Маршрутизация.Контрагент КАК Контрагент,
				   //|	Маршрутизация.Договор КАК Договор,
				   //|	Маршрутизация.ВидПеревозки КАК ВидПеревозки,
				   //Стало:
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор,
				   |	ЕСТЬNULL(МаршрутизацияВидыПеревозок.ВидПеревозки, ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ПустаяСсылка)) КАК ВидПеревозки,
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	Маршрутизация.Организация КАК Организация,
	               |	Маршрутизация.ПротоколНеУказан КАК ПротоколНеУказан,
	               |	Маршрутизация.УказанРейс КАК УказанРейс,
	               |	Маршрутизация.ИсточникЗаявки КАК ИсточникЗаявки
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация 
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.ВидыПеревозок КАК МаршрутизацияВидыПеревозок
				   |		ПО (Маршрутизация.Ссылка = МаршрутизацияВидыПеревозок.Ссылка)
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.КонтрагентыИДоговоры КАК МаршрутизацияКонтрагентыИДоговоры
				   |		ПО (Маршрутизация.Ссылка = МаршрутизацияКонтрагентыИДоговоры.Ссылка)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.Букинг)   
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.КонтрагентПустой
				   //|				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Контрагент = &Контрагент
				   //|					ИЛИ Маршрутизация.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|		КОНЕЦ
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.ДоговорПустой
				   //|				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Договор = &Договор
				   //|					ИЛИ Маршрутизация.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|		КОНЕЦ
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ПустаяСсылка)
				   //|				ТОГДА ИСТИНА
				   //|			ИНАЧЕ Маршрутизация.ВидПеревозки = &ВидПеревозки
				   //|		КОНЕЦ
				   //Стало:
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.КонтрагентПустой
				   |				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = &Контрагент
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |		КОНЕЦ
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.ДоговорПустой
				   |				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = &Договор
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |		КОНЕЦ
				   |	И ВЫБОР
				   |			КОГДА ЕСТЬNULL(МаршрутизацияВидыПеревозок.ВидПеревозки, ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ПустаяСсылка)
				   |				ТОГДА ИСТИНА
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияВидыПеревозок.ВидПеревозки, ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ПустаяСсылка)) = &ВидПеревозки
				   |		КОНЕЦ
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ОрганизацияПустая
	               |				ТОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.Организация = &Организация
	               |					ИЛИ Маршрутизация.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ИсточникЗаявки = ЗНАЧЕНИЕ(Перечисление.ИсточникЗаявок.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ Маршрутизация.ИсточникЗаявки = &ИсточникЗаявки
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА НЕ Маршрутизация.ПротоколНеУказан
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ Маршрутизация.ПротоколНеУказан = &ПротоколНеУказан
	               |		КОНЕЦ
	               |	И Маршрутизация.НаМоментЗаписиБылаЗадолженность = &НаМоментЗаписиБылаЗадолженность
	               |	И Маршрутизация.УказанРейс = &УказанРейс
	               |	И Маршрутизация.УсловияОплаты = &УсловияОплаты";
	Запрос.УстановитьПараметр("НаМоментЗаписиБылаЗадолженность", ПараметрыЗапроса["НаМоментЗаписиБылаЗадолженность"]);
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса["Организация"]);
	Запрос.УстановитьПараметр("Контрагент", ПараметрыЗапроса["Контрагент"]);
	Запрос.УстановитьПараметр("УказанРейс", ПараметрыЗапроса["УказанРейс"]);
	Запрос.УстановитьПараметр("Договор", ПараметрыЗапроса["Договор"]);
	Запрос.УстановитьПараметр("ВидПеревозки", ПараметрыЗапроса["ВидПеревозки"]);
	Запрос.УстановитьПараметр("ВидПеревозкиПустой", НЕ ЗначениеЗаполнено(ПараметрыЗапроса["ВидПеревозки"]));
	Запрос.УстановитьПараметр("ИсточникЗаявки", ПараметрыЗапроса["ИсточникЗаявки"]);
	Запрос.УстановитьПараметр("ПротоколНеУказан", ПараметрыЗапроса["ПротоколНеУказан"]);
	//Евросиб Каблов 23.01.2022 ( 62514
	Договор = ПараметрыЗапроса["Договор"];
	Если ЗначениеЗаполнено(Договор) Тогда
		УсловиеОплаты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "УсловияОплаты");
	Иначе
		УсловиеОплаты = Неопределено;
	КонецЕсли;
	Запрос.УстановитьПараметр("УсловияОплаты", УсловиеОплаты);
	//Евросиб Каблов 23.01.2022 )
	 
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		Если ЗначениеЗаполнено(Ответ["Контрагент"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Организация"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["ВидПеревозки"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если Ответ["ПротоколНеУказан"] = ПараметрыЗапроса["ПротоколНеУказан"] Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если Ответ["УказанРейс"] = ПараметрыЗапроса["УказанРейс"] Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Договор"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["ИсточникЗаявки"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения,ИсполнительКакРуководительПоНаправлению,НаблюдательКакРуководительПоНаправлению, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения,Стр.ИсполнительКакРуководительПоНаправлению,Стр.НаблюдательКакРуководительПоНаправлению, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.ЗаявкаКлиента, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.ЗаявкаКлиента, ДатаДокумента, ПараметрыЗапроса["ВидПеревозки"]);
	Возврат РезультатЗапроса;
	
КонецФункции

Функция МаршрутизироватьКалькуляцию(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка,  
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	Маршрутизация.Контрагент КАК Контрагент,
				   //|	Маршрутизация.Договор КАК Договор,
				   //|	Маршрутизация.ВидПеревозки КАК ВидПеревозки,
				   //Стало:
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор,
				   |	ЕСТЬNULL(МаршрутизацияВидыПеревозок.ВидПеревозки, ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ПустаяСсылка)) КАК ВидПеревозки,
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	Маршрутизация.Организация КАК Организация,
	               |	Маршрутизация.ТипКалькуляции КАК ТипКалькуляции,
	               |	Маршрутизация.КалькуляцияДействующегоКлиента КАК КалькуляцияДействующегоКлиента,
	               |	Маршрутизация.КалькуляцияНовогоКлиента КАК КалькуляцияНовогоКлиента
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация 
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.ВидыПеревозок КАК МаршрутизацияВидыПеревозок
				   |		ПО (Маршрутизация.Ссылка = МаршрутизацияВидыПеревозок.Ссылка)
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.КонтрагентыИДоговоры КАК МаршрутизацияКонтрагентыИДоговоры
				   |		ПО (Маршрутизация.Ссылка = МаршрутизацияКонтрагентыИДоговоры.Ссылка)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.Калькуляция) 
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.КонтрагентПустой
				   //|				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Контрагент = &Контрагент
				   //|					ИЛИ Маршрутизация.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|		КОНЕЦ
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.ДоговорПустой
				   //|				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Договор = &Договор
				   //|					ИЛИ Маршрутизация.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|		КОНЕЦ
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ПустаяСсылка)
				   //|				ТОГДА ИСТИНА
				   //|			ИНАЧЕ Маршрутизация.ВидПеревозки = &ВидПеревозки
				   //|		КОНЕЦ
				   //Стало:
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.КонтрагентПустой
				   |				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = &Контрагент
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |		КОНЕЦ
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.ДоговорПустой
				   |				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = &Договор
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |		КОНЕЦ
				   |	И ВЫБОР
				   |			КОГДА ЕСТЬNULL(МаршрутизацияВидыПеревозок.ВидПеревозки, ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ПустаяСсылка)
				   |				ТОГДА ИСТИНА
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияВидыПеревозок.ВидПеревозки, ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ПустаяСсылка)) = &ВидПеревозки
				   |		КОНЕЦ
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ОрганизацияПустая
	               |				ТОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.Организация = &Организация
	               |					ИЛИ Маршрутизация.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ Маршрутизация.ТипКалькуляции = &ТипКалькуляции
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &ДействующийКлиент
	               |				ТОГДА Маршрутизация.КалькуляцияДействующегоКлиента
	               |			ИНАЧЕ Маршрутизация.КалькуляцияНовогоКлиента
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("Контрагент", ПараметрыЗапроса["Контрагент"]);
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса["Организация"]);
	Запрос.УстановитьПараметр("Договор", ПараметрыЗапроса["Договор"]);
	Запрос.УстановитьПараметр("ВидПеревозки", ПараметрыЗапроса["ВидПеревозки"]);
	Запрос.УстановитьПараметр("ВидПеревозкиПустой", НЕ ЗначениеЗаполнено(ПараметрыЗапроса["ВидПеревозки"]));
	Запрос.УстановитьПараметр("ТипКалькуляции", ПараметрыЗапроса["ТипКалькуляции"]);
	Запрос.УстановитьПараметр("ДействующийКлиент", ПараметрыЗапроса["ДействующийКлиент"]);
	
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		Если ЗначениеЗаполнено(Ответ["Контрагент"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Организация"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["ВидПеревозки"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Договор"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["ТипКалькуляции"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если (Ответ["КалькуляцияДействующегоКлиента"] = ПараметрыЗапроса["ДействующийКлиент"]
				ИЛИ Ответ["КалькуляцияНовогоКлиента"] = (ПараметрыЗапроса["ДействующийКлиент"] = ЛОЖЬ)) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		
		Если Стр.НаправлятьНаСогласованиеПриДоходностиМенееПроцентов <> 0 И Стр.НаправлятьНаСогласованиеПриДоходностиМенееПроцентов > ПараметрыЗапроса["МинимальныйПроцентДоходности"] Тогда
			Статус = Перечисления.СтатусыЭтапов.Выполнен;
		КонецЕсли;
		
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения,ИсполнительКакРуководительПоНаправлению,НаблюдательКакРуководительПоНаправлению, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения,Стр.ИсполнительКакРуководительПоНаправлению,Стр.НаблюдательКакРуководительПоНаправлению, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.Калькуляция, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.Калькуляция, ДатаДокумента, ПараметрыЗапроса["ВидПеревозки"]);
	Возврат РезультатЗапроса;
	
КонецФункции

Функция МаршрутизироватьКорректировкуПоступления(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	ЗагруженИзДиадок = Ложь;
	ЗагруженИзРИТМ = Ложь;
	СсылкаОбъектМаршрутизации = ПараметрыЗапроса["ОбъектМаршрутизации"].Ссылка;
	// проверяем наличие загрузки этого ПТУ из РИТМа
	Если ЗначениеЗаполнено(СсылкаОбъектМаршрутизации) Тогда //Евросиб Гудкова( 26.10.2020 Ticket№ 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПротоколОбменов.ДействиеПриОбмене КАК ДействиеПриОбмене,
		               |	ПротоколОбменов.УзелОбмена КАК УзелОбмена,
		               |	ПротоколОбменов.Объект КАК Объект,
		               |	ПротоколОбменов.УИДИсточника КАК УИДИсточника,
		               |	ПротоколОбменов.ПроведенВБУ КАК ПроведенВБУ,
		               |	ПротоколОбменов.Ответственный КАК Ответственный,
		               |	ПротоколОбменов.ДатаОбмена КАК ДатаОбмена,
		               |	ПротоколОбменов.НомерДатаВБУ КАК НомерДатаВБУ
		               |ИЗ
		               |	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		               |ГДЕ
		               |	ПротоколОбменов.Объект = &Объект
			           |	И ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.РИТМ)
		               |	И ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных)";
		Запрос.УстановитьПараметр("Объект", СсылкаОбъектМаршрутизации);
		Ответ = Запрос.Выполнить().Выбрать();
		Если Ответ.Следующий() Тогда
			ЗагруженИзРИТМ = Истина; //Гудкова Ticket#0203030 ЗагруженИзРИТМ ИЛИ Ответ.УзелОбмена = Перечисления.УзлыОбмена.РИТМ;
		КонецЕсли;
	
		// проверяем наличие загрузки этого ПТУ из Диадока //Гудкова Ticket#0203030
		Запрос.Текст =  "ВЫБРАТЬ
		                |	Диадок_Документы.Документ КАК Документ,
		                |	Диадок_Документы.Статус КАК Статус
		                |ИЗ
		                |	Справочник.Диадок_Документы КАК Диадок_Документы
		                |ГДЕ
		                |	Диадок_Документы.Документ = &Объект";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗагруженИзДиадок = Истина;
		КонецЕсли; 	
	КонецЕсли; // Евросиб Гудкова) 	
	
	ЗагруженИзРИТМ = ЗагруженИзРИТМ 
		ИЛИ (Не Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ПараметрыЗапроса["ОбъектМаршрутизации"])) 
			И ПараметрыЗапроса["ОбъектМаршрутизации"].ДополнительныеСвойства.Свойство("ЗагруженИзРИТМ"));
	 ЗагруженИзДиадок = ЗагруженИзДиадок 
	 	ИЛИ (Не Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ПараметрыЗапроса["ОбъектМаршрутизации"])) 
			И ПараметрыЗапроса["ОбъектМаршрутизации"].ДополнительныеСвойства.Свойство("ЗагруженИзДиадок"));
			
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка, 
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	Маршрутизация.Договор КАК Договор,
				   //|	Маршрутизация.Контрагент КАК Контрагент,
				   //Стало:
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор,
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	Маршрутизация.Организация КАК Организация,
	               |	Маршрутизация.ПТУРИТМ КАК ПТУРИТМ,
	               |	Маршрутизация.ЭДО КАК ПТУДиадок,
	               |	Маршрутизация.ЦФО КАК ЦФО,
	               |	Маршрутизация.ПТУШтраф КАК ПТУШтраф,
	               |	Маршрутизация.Копия КАК Копия,
	               |	Маршрутизация.Резидент КАК Резидент,
	               |	Маршрутизация.Нерезидент КАК Нерезидент,
	               |	ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия) КАК КонтрагентРезидент,
				   //Евросиб Каблов 12.08.2022 ( Task 55578
				   |	Маршрутизация.ПТУВидУслуг КАК ПТУВидУслуг,
				   //Евросиб Каблов 12.08.2022 )				   
				   //Евросиб Каблов 16.08.2021 ( Ticket#0240249
	               |	Маршрутизация.ПТУСуммаОт КАК ПТУСуммаОт,
	               |	Маршрутизация.ПТУСуммаДо КАК ПТУСуммаДо
				   //Евросиб Каблов 16.08.2021 )
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.КонтрагентыИДоговоры КАК МаршрутизацияКонтрагентыИДоговоры
				   |		ПО (Маршрутизация.Ссылка = МаршрутизацияКонтрагентыИДоговоры.Ссылка)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.КорректировкаПоступления)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.КонтрагентПустой
				   //|				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Контрагент = &Контрагент
				   //|					ИЛИ Маршрутизация.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|		КОНЕЦ
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.ДоговорПустой
				   //|				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Договор = &Договор
				   //|					ИЛИ Маршрутизация.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|		КОНЕЦ
				   //Стало:
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.КонтрагентПустой
				   |				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = &Контрагент
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |		КОНЕЦ
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.ДоговорПустой
				   |				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = &Договор
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |		КОНЕЦ
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ОрганизацияПустая
	               |				ТОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.Организация = &Организация
	               |					ИЛИ Маршрутизация.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.Резидент <> Маршрутизация.Нерезидент
	               |				ТОГДА Маршрутизация.Резидент = ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	               |						ИЛИ Маршрутизация.Нерезидент = ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).СтранаРегистрации <> ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И Маршрутизация.ПТУШтраф = &Штраф
	               |	И (Маршрутизация.ЦФО = &ЦФО
	               |			ИЛИ Маршрутизация.ЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка))
	               |	И Маршрутизация.Копия = &Копия
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.Резидент <> Маршрутизация.Нерезидент
	               |				ТОГДА Маршрутизация.Резидент = (ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия))
	               |						И Маршрутизация.Нерезидент = (ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).СтранаРегистрации <> ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия))
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И Маршрутизация.ПТУРИТМ = &ПТУРИТМ
	               |	И Маршрутизация.ЭДО = &ЭДО
				   //Евросиб Каблов 12.08.2022 ( Task 55578
				   |	И (Маршрутизация.ПТУВидУслуг = &ВидУслуг ИЛИ Маршрутизация.ПТУВидУслуг = ЗНАЧЕНИЕ(Перечисление.ВидыУслугПодрядчиков.ПустаяСсылка))
				   //Евросиб Каблов 12.08.2022 )
				   //Евросиб Каблов 16.08.2021 ( Ticket#0240249
	               |	И (&СуммаДокумента МЕЖДУ Маршрутизация.ПТУСуммаОт И Маршрутизация.ПТУСуммаДо
	               |			ИЛИ Маршрутизация.ПТУСуммаОт = 0
	               |				И Маршрутизация.ПТУСуммаДо = 0)";
				   //Евросиб Каблов 16.08.2021 )
	Запрос.УстановитьПараметр("Контрагент", ПараметрыЗапроса["Контрагент"]);
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса["Организация"]);
	Запрос.УстановитьПараметр("Договор", ПараметрыЗапроса["Договор"]);
	Запрос.УстановитьПараметр("Штраф", ПараметрыЗапроса["Штраф"]);
	Запрос.УстановитьПараметр("ПТУРИТМ", ЗагруженИзРИТМ);
//Евросиб Максимова 01.04.2021 #0225967
	Запрос.УстановитьПараметр("ЭДО", (ЗагруженИзДиадок И НЕ ЗагруженИзРИТМ));
	//Запрос.УстановитьПараметр("ЭДО", ЗагруженИзДиадок);
//Евросиб Максимова 01.04.2021 #0225967

//Евросиб Гудкова( 29.09.2020 Ticket№ 0208324
	Запрос.УстановитьПараметр("ЦФО", ПараметрыЗапроса["ЦФО"]);
	Запрос.УстановитьПараметр("Копия", ПараметрыЗапроса["Копия"]);
// Евросиб Гудкова)

	//Евросиб Каблов 16.08.2021 ( Ticket#0240249
	СуммаДокументаМодуль = ?(ПараметрыЗапроса["СуммаДокумента"] >= 0, ПараметрыЗапроса["СуммаДокумента"], -ПараметрыЗапроса["СуммаДокумента"]);
	Запрос.УстановитьПараметр("СуммаДокумента", СуммаДокументаМодуль);
	//Евросиб Каблов 16.08.2021 )
	
	//Евросиб Каблов 12.08.2022 ( Task 55578
	Запрос.УстановитьПараметр("ВидУслуг", ПараметрыЗапроса["ВидУслуг"]);
	//Евросиб Каблов 12.08.2022 )
	
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		Если ЗначениеЗаполнено(Ответ["Контрагент"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Организация"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Договор"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если Ответ["ПТУДиадок"] = ЗагруженИзДиадок Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если Ответ["ПТУРИТМ"] = ЗагруженИзРИТМ Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если Ответ["ПТУШтраф"] = ПараметрыЗапроса["Штраф"] Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
//Евросиб Гудкова( 29.09.2020 Ticket№ 0208324
		Если Ответ["ЦФО"] = ПараметрыЗапроса["ЦФО"] Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если Ответ["Копия"] = ПараметрыЗапроса["Копия"] Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если Ответ["КонтрагентРезидент"] Тогда
			Если Ответ["КонтрагентРезидент"] <> Ответ["НеРезидент"] Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Иначе
			Если (не Ответ["КонтрагентРезидент"]) <> Ответ["Резидент"] Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		КонецЕсли;	
// Евросиб Гудкова)
		//Евросиб Каблов 16.08.2021 ( Ticket#0240249
		Если Ответ.ПТУСуммаОт <= СуммаДокументаМодуль И Ответ.ПТУСуммаДо >= СуммаДокументаМодуль Тогда
			КоличествоСовпадений = КоличествоСовпадений + 1;
		КонецЕсли;
		//Евросиб Каблов 16.08.2021 )
		
		//Евросиб Каблов 12.08.2022 ( Task 	55578
		Если ЗначениеЗаполнено(Ответ["ПТУВидУслуг"]) Тогда
			КоличествоСовпадений = КоличествоСовпадений + 1;
		КонецЕсли;
		//Евросиб Каблов 12.08.2022 )
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника, ВыполнятьАвтоматическиЕслиПредыдущаяЗадачаСТемЖеИсполнителем", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника, Стр.ВыполнятьАвтоматическиЕслиПредыдущаяЗадачаСТемЖеИсполнителем));
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.КорректировкаПоступления, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	//ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.КорректировкаПоступления, ДатаДокумента, ПараметрыЗапроса["ВидПеревозки"]);
	Возврат РезультатЗапроса;
	
КонецФункции

Функция МаршрутизироватьКорректировкуРеализации(ПараметрыЗапроса, ДатаДокумента) Экспорт
//Гудкова. вместо неё вызывается маршрут РТУ. они одинаковые	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка,
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	Маршрутизация.Контрагент КАК Контрагент,
				   //|	Маршрутизация.Договор КАК Договор, 
				   //Стало:
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор,
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	Маршрутизация.Организация КАК Организация
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация  
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.КонтрагентыИДоговоры КАК МаршрутизацияКонтрагентыИДоговоры
				   |		ПО (Маршрутизация.Ссылка = МаршрутизацияКонтрагентыИДоговоры.Ссылка)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.КорректировкаРеализации)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.КонтрагентПустой
				   //|				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Контрагент = &Контрагент
				   //|					ИЛИ Маршрутизация.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|		КОНЕЦ
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.ДоговорПустой
				   //|				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Договор = &Договор
				   //|					ИЛИ Маршрутизация.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|		КОНЕЦ
				   //Стало:
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.КонтрагентПустой
				   |				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = &Контрагент
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |		КОНЕЦ
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.ДоговорПустой
				   |				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = &Договор
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |		КОНЕЦ
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ОрганизацияПустая
	               |				ТОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.Организация = &Организация
	               |					ИЛИ Маршрутизация.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("Контрагент", ПараметрыЗапроса["Контрагент"]);
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса["Организация"]);
	Запрос.УстановитьПараметр("Договор", ПараметрыЗапроса["Договор"]);
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		Если ЗначениеЗаполнено(Ответ["Контрагент"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Организация"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Договор"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.КорректировкаРеализации, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	Возврат РезультатЗапроса;
	
КонецФункции

Функция МаршрутизироватьЛичныеЦели(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка,
	               |	Маршрутизация.Организация КАК Организация
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.ЛичныеЦели)
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ОрганизацияПустая
	               |				ТОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.Организация = &Организация
	               |					ИЛИ Маршрутизация.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса["Организация"]);
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		Если ЗначениеЗаполнено(Ответ["Организация"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		
		ИсполнительЪ = ?(Стр.ИсполнительКакСубъектЛичнойЦели, ПараметрыЗапроса["СубъектЛичнойЦели"], Стр.Исполнитель);
		
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения,ИсполнительКакРуководительПоНаправлению,НаблюдательКакРуководительПоНаправлению, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, ИсполнительЪ, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения,Стр.ИсполнительКакРуководительПоНаправлению,Стр.НаблюдательКакРуководительПоНаправлению, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
		
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.ЛичныеЦели, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	Возврат РезультатЗапроса;
	
КонецФункции

Функция МаршрутизироватьОперацию(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка, 
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	Маршрутизация.Контрагент КАК Контрагент,
				   //|	Маршрутизация.Договор КАК Договор,  
				   //|	Маршрутизация.ВидПеревозки КАК ВидПеревозки,
				   //Стало:
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор,
				   |	ЕСТЬNULL(МаршрутизацияВидыПеревозок.ВидПеревозки, ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ПустаяСсылка)) КАК ВидПеревозки,
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	Маршрутизация.Организация КАК Организация,
	               |	Маршрутизация.ВидОперации КАК ВидОперации
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.ВидыПеревозок КАК МаршрутизацияВидыПеревозок
				   |		ПО (Маршрутизация.Ссылка = МаршрутизацияВидыПеревозок.Ссылка)
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.КонтрагентыИДоговоры КАК МаршрутизацияКонтрагентыИДоговоры
				   |		ПО (Маршрутизация.Ссылка = МаршрутизацияКонтрагентыИДоговоры.Ссылка)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.Операция) 
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.КонтрагентПустой
				   //|				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Контрагент = &Контрагент
				   //|					ИЛИ Маршрутизация.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|		КОНЕЦ
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.ДоговорПустой
				   //|				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Договор = &Договор
				   //|					ИЛИ Маршрутизация.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|		КОНЕЦ
				   //Стало:
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.КонтрагентПустой
				   |				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = &Контрагент
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |		КОНЕЦ
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.ДоговорПустой
				   |				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = &Договор
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |		КОНЕЦ
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ОрганизацияПустая
	               |				ТОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.Организация = &Организация
	               |					ИЛИ Маршрутизация.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ВидОперации <> ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ПустаяСсылка)
	               |				ТОГДА &ВидОперации = Маршрутизация.ВидОперации
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("Контрагент", ПараметрыЗапроса["Контрагент"]);
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса["Организация"]);
	Запрос.УстановитьПараметр("Договор", ПараметрыЗапроса["Договор"]);
	Запрос.УстановитьПараметр("ВидПеревозки", ПараметрыЗапроса["ВидПеревозки"]);
	Запрос.УстановитьПараметр("ВидОперации", ПараметрыЗапроса["ВидОперации"]);
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		Если ЗначениеЗаполнено(Ответ["Контрагент"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Организация"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["ВидПеревозки"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Договор"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["ВидОперации"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения,ИсполнительКакРуководительПоНаправлению,НаблюдательКакРуководительПоНаправлению, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения,Стр.ИсполнительКакРуководительПоНаправлению,Стр.НаблюдательКакРуководительПоНаправлению, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.Операция, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.Операция, ДатаДокумента, ПараметрыЗапроса["ВидПеревозки"]);
	Возврат РезультатЗапроса;
	
КонецФункции

Функция МаршрутизироватьПоступлениеНаРС(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка, 
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	Маршрутизация.Контрагент КАК Контрагент,
				   //|	Маршрутизация.Договор КАК Договор,
				   //Стало:
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор,
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	Маршрутизация.Организация КАК Организация,
	               |	Маршрутизация.ПоступлениеДСПолностьюРазнесено КАК ПоступлениеДСПолностьюРазнесено,
	               |	Маршрутизация.ЦФО КАК ЦФО
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация  
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.КонтрагентыИДоговоры КАК МаршрутизацияКонтрагентыИДоговоры
				   |		ПО (Маршрутизация.Ссылка = МаршрутизацияКонтрагентыИДоговоры.Ссылка)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.ПоступлениеНаРС)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.КонтрагентПустой
				   //|				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Контрагент = &Контрагент
				   //|					ИЛИ Маршрутизация.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|		КОНЕЦ
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.ДоговорПустой
				   //|				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Договор = &Договор
				   //|					ИЛИ Маршрутизация.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|		КОНЕЦ
				   //Стало:
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.КонтрагентПустой
				   |				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = &Контрагент
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |		КОНЕЦ
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.ДоговорПустой
				   |				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = &Договор
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |		КОНЕЦ
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ОрганизацияПустая
	               |				ТОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.Организация = &Организация
	               |					ИЛИ Маршрутизация.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &УспешноРазнесенаВсяСумма
	               |				ТОГДА Маршрутизация.ПоступлениеДСПолностьюРазнесено
	               |			ИНАЧЕ Маршрутизация.ПоступлениеДСНЕПолностьюРазнесено
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ЦФОПустой
	               |				ТОГДА &ЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.ЦФО = &ЦФО
	               |					ИЛИ Маршрутизация.ЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка)
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("Контрагент", ПараметрыЗапроса["Контрагент"]);
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса["Организация"]);
	Запрос.УстановитьПараметр("Договор", ПараметрыЗапроса["Договор"]);
	Запрос.УстановитьПараметр("ЦФО", ПараметрыЗапроса["ЦФО"]);
	Запрос.УстановитьПараметр("УспешноРазнесенаВсяСумма", ПараметрыЗапроса["УспешноРазнесенаВсяСумма"]);
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		Если ЗначениеЗаполнено(Ответ["Контрагент"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Организация"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Договор"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["ЦФО"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если Ответ["ПоступлениеДСПолностьюРазнесено"] = ПараметрыЗапроса["УспешноРазнесенаВсяСумма"] Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.ПоступлениеНаРС, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	//ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.ПоступлениеНаРС, ДатаДокумента, ПараметрыЗапроса["ВидПеревозки"]);
	Возврат РезультатЗапроса;
	
КонецФункции

Функция МаршрутизироватьСделку(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	ОтветственныйПоСделке = ПараметрыЗапроса["ОтветственныйПоСделке"];
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка,
	               |	Маршрутизация.Организация КАК Организация,
	               |	Маршрутизация.ОплатаПоОригиналу КАК ОплатаПоОригиналу
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.Сделка)
	               |	И Маршрутизация.ОплатаПоОригиналу = &ОплатаПоОригиналу
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ОрганизацияПустая
	               |				ТОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.Организация = &Организация
	               |					ИЛИ Маршрутизация.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |		КОНЕЦ
	               |	И Маршрутизация.ПовагонныеОтправки = &ПовагонныеОтправки
	               |	И ВЫБОР
	               |			КОГДА &ПодсылПорожних
	               |				ТОГДА Маршрутизация.Сделка_ДляПорожнегоПлеча
	               |			ИНАЧЕ Маршрутизация.Сделка_ДляГруженогоПлеча
	               |		КОНЕЦ
				   // Евросиб Фролов (12.04.2022 Task №46871
				   |	И Маршрутизация.СлужебнаяСделка = &СлужебнаяСделка";
				   // Евросиб Фролов)
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса["Организация"]);
	Запрос.УстановитьПараметр("ПодсылПорожних", ПараметрыЗапроса["ПодсылПорожних"]);
	Запрос.УстановитьПараметр("ОплатаПоОригиналу", ПараметрыЗапроса["ОплатаПоОригиналу"]);
	Запрос.УстановитьПараметр("ПовагонныеОтправки", ПараметрыЗапроса["ПовагонныеОтправки"]);
	// Евросиб Фролов (12.04.2022 Task №46871
	Запрос.УстановитьПараметр("СлужебнаяСделка", ПараметрыЗапроса["СлужебнаяСделка"]);
	// Евросиб Фролов)
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		Если ЗначениеЗаполнено(Ответ["Организация"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если Ответ["ОплатаПоОригиналу"] = ПараметрыЗапроса["ОплатаПоОригиналу"] Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		// Если в сделке один клиент ИЛИ по всем договорам один ответственный, 
		// то ставить не руководителя ОРК, а ответственного за сопровождение в 
		// качестве исполнителя (только при создании сделки из фона)
		Если ОтветственныйПоСделке = "НЕТ" Тогда
			Исполн = Стр.Исполнитель;
		Иначе
			Исполн = ОтветственныйПоСделке;
		КонецЕсли;
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения, ИсполнительКакОтветственныйЗаУчет, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Исполн, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения, Стр.ИсполнительКакОтветственныйЗаУчет, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.Сделка, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	Возврат РезультатЗапроса;
	
КонецФункции

Функция МаршрутизироватьСписаниеСРС(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка,
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	Маршрутизация.Контрагент КАК Контрагент,
				   //|	Маршрутизация.Договор КАК Договор, 
				   //Стало:
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор,
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	Маршрутизация.Организация КАК Организация,
	               |	Маршрутизация.ПлатежкаРазобралась КАК ПлатежкаРазобралась
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация  
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.КонтрагентыИДоговоры КАК МаршрутизацияКонтрагентыИДоговоры
				   |		ПО (Маршрутизация.Ссылка = МаршрутизацияКонтрагентыИДоговоры.Ссылка)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.СписаниеСРС)  
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.КонтрагентПустой
				   //|				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Контрагент = &Контрагент
				   //|					ИЛИ Маршрутизация.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|		КОНЕЦ
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.ДоговорПустой
				   //|				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Договор = &Договор
				   //|					ИЛИ Маршрутизация.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|		КОНЕЦ
				   //Стало:
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.КонтрагентПустой
				   |				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = &Контрагент
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |		КОНЕЦ
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.ДоговорПустой
				   |				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = &Договор
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |		КОНЕЦ
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ОрганизацияПустая
	               |				ТОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.Организация = &Организация
	               |					ИЛИ Маршрутизация.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |		КОНЕЦ
	               |	И Маршрутизация.ПлатежкаРазобралась = &ПлатежкаРазобралась";
	Запрос.УстановитьПараметр("Контрагент", ПараметрыЗапроса["Контрагент"]);
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса["Организация"]);
	Запрос.УстановитьПараметр("Договор", ПараметрыЗапроса["Договор"]);
	Запрос.УстановитьПараметр("ПлатежкаРазобралась", Число(ПараметрыЗапроса["ПлатежкаРазобралась"]));
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		Если ЗначениеЗаполнено(Ответ["Контрагент"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Организация"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Договор"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если Ответ["ПлатежкаРазобралась"] = Число(ПараметрыЗапроса["ПлатежкаРазобралась"])
			Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.Операция, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	Возврат РезультатЗапроса;
	
КонецФункции

Функция МаршрутизироватьСФВ(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка,
	               |	Маршрутизация.Организация КАК Организация
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.СчетФактураВыданный)
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ОрганизацияПустая
	               |				ТОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.Организация = &Организация
	               |					ИЛИ Маршрутизация.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса["Организация"]);
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		Если ЗначениеЗаполнено(Ответ["Организация"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.СчетФактураВыданный, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	Возврат РезультатЗапроса;
	
КонецФункции

Функция МаршрутизироватьСФП(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка,
	               |	Маршрутизация.Организация КАК Организация
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.СчетФактураПолученный)
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ОрганизацияПустая
	               |				ТОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.Организация = &Организация
	               |					ИЛИ Маршрутизация.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса["Организация"]);
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		Если ЗначениеЗаполнено(Ответ["Организация"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.СчетФактураПолученный, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	Возврат РезультатЗапроса;
	
КонецФункции

Функция МаршрутизироватьСчетПокупателю(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка, 
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	Маршрутизация.Договор КАК Договор,
				   //|	Маршрутизация.Контрагент КАК Контрагент, 
				   //Стало:
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор,
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	Маршрутизация.Организация КАК Организация
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.КонтрагентыИДоговоры КАК МаршрутизацияКонтрагентыИДоговоры
				   |		ПО (Маршрутизация.Ссылка = МаршрутизацияКонтрагентыИДоговоры.Ссылка)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.СчетПокупателю)  
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.КонтрагентПустой
				   //|				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Контрагент = &Контрагент
				   //|					ИЛИ Маршрутизация.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|		КОНЕЦ
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.ДоговорПустой
				   //|				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Договор = &Договор
				   //|					ИЛИ Маршрутизация.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|		КОНЕЦ 
				   //Стало:
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.КонтрагентПустой
				   |				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = &Контрагент
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |		КОНЕЦ
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.ДоговорПустой
				   |				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = &Договор
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |		КОНЕЦ
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ОрганизацияПустая
	               |				ТОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.Организация = &Организация
	               |					ИЛИ Маршрутизация.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("Контрагент", ПараметрыЗапроса["Контрагент"]);
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса["Организация"]);
	Запрос.УстановитьПараметр("Договор", ПараметрыЗапроса["Договор"]);
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		Если ЗначениеЗаполнено(Ответ["Контрагент"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Организация"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Договор"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.СчетПокупателю, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	Возврат РезультатЗапроса;
	
КонецФункции

Функция МаршрутизироватьСчетПоставщика(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	ЗагруженИзДиадок = Ложь;
	// проверяем наличие загрузки этого счета из Диадок
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПротоколОбменов.ДействиеПриОбмене КАК ДействиеПриОбмене,
	               |	ПротоколОбменов.УзелОбмена КАК УзелОбмена,
	               |	ПротоколОбменов.Объект КАК Объект,
	               |	ПротоколОбменов.УИДИсточника КАК УИДИсточника,
	               |	ПротоколОбменов.ПроведенВБУ КАК ПроведенВБУ,
	               |	ПротоколОбменов.Ответственный КАК Ответственный,
	               |	ПротоколОбменов.ДатаОбмена КАК ДатаОбмена,
	               |	ПротоколОбменов.НомерДатаВБУ КАК НомерДатаВБУ
	               |ИЗ
	               |	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	               |ГДЕ
	               |	ПротоколОбменов.Объект = &Объект
	               |	И ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных)";
	Запрос.УстановитьПараметр("Объект",ПараметрыЗапроса["ОбъектМаршрутизации"]);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		ЗагруженИзДиадок = ЗагруженИзДиадок ИЛИ Ответ.УзелОбмена = Перечисления.УзлыОбмена.Диадок;
	КонецЕсли;
		
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка, 
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	Маршрутизация.Контрагент КАК Контрагент,
				   //|	Маршрутизация.Договор КАК Договор, 
				   //Стало:
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор,
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	Маршрутизация.Организация КАК Организация,
	               |	Маршрутизация.СчетПоставщикаДиадок КАК СчетПоставщикаДиадок,
	               |	Маршрутизация.СчетПоставщикаБезКомплекта КАК СчетПоставщикаБезКомплекта
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация   
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.КонтрагентыИДоговоры КАК МаршрутизацияКонтрагентыИДоговоры
				   |		ПО (Маршрутизация.Ссылка = МаршрутизацияКонтрагентыИДоговоры.Ссылка)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.СчетПоставщика)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
                   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.КонтрагентПустой
				   //|				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Контрагент = &Контрагент
				   //|					ИЛИ Маршрутизация.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|		КОНЕЦ
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.ДоговорПустой
				   //|				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Договор = &Договор
				   //|					ИЛИ Маршрутизация.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|		КОНЕЦ
				   //Стало:
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.КонтрагентПустой
				   |				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = &Контрагент
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |		КОНЕЦ
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.ДоговорПустой
				   |				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = &Договор
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |		КОНЕЦ
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ОрганизацияПустая
	               |				ТОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.Организация = &Организация
	               |					ИЛИ Маршрутизация.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА НЕ Маршрутизация.СчетПоставщикаДиадок
	               |				ТОГДА Истина
	               |			ИНАЧЕ Маршрутизация.СчетПоставщикаДиадок = &СчетПоставщикаДиадок
	               |		КОНЕЦ
	               |	И Маршрутизация.СчетПоставщикаБезКомплекта = &СчетПоставщикаБезКомплекта";
	Запрос.УстановитьПараметр("Контрагент", ПараметрыЗапроса["Контрагент"]);
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса["Организация"]);
	Запрос.УстановитьПараметр("Договор", ПараметрыЗапроса["Договор"]);
	Запрос.УстановитьПараметр("СчетПоставщикаДиадок", ЗагруженИзДиадок);
	Запрос.УстановитьПараметр("СчетПоставщикаБезКомплекта", ПараметрыЗапроса["СчетПоставщикаБезКомплекта"]);
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		Если ЗначениеЗаполнено(Ответ["Контрагент"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Организация"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Договор"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если Ответ["СчетПоставщикаДиадок"] = ЗагруженИзДиадок Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если Ответ["СчетПоставщикаБезКомплекта"] = ПараметрыЗапроса["СчетПоставщикаБезКомплекта"] Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.СчетПоставщика, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	Возврат РезультатЗапроса;
	
КонецФункции

Функция МаршрутизироватьОтчетКомиссионера(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка,  
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	Маршрутизация.Контрагент КАК Контрагент,
				   //|	Маршрутизация.Договор КАК Договор, 
				   //Стало:
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор,
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	Маршрутизация.Организация КАК Организация
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация 
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.КонтрагентыИДоговоры КАК МаршрутизацияКонтрагентыИДоговоры
				   |		ПО (Маршрутизация.Ссылка = МаршрутизацияКонтрагентыИДоговоры.Ссылка)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.ОтчетКомиссионера)   
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.КонтрагентПустой
				   //|				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Контрагент = &Контрагент
				   //|					ИЛИ Маршрутизация.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|		КОНЕЦ
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.ДоговорПустой
				   //|				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Договор = &Договор
				   //|					ИЛИ Маршрутизация.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|		КОНЕЦ
				   //Стало:
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.КонтрагентПустой
				   |				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = &Контрагент
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |		КОНЕЦ
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.ДоговорПустой
				   |				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = &Договор
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |		КОНЕЦ
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ОрганизацияПустая
	               |				ТОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.Организация = &Организация
	               |					ИЛИ Маршрутизация.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("Контрагент", ПараметрыЗапроса["Контрагент"]);
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса["Организация"]);
	Запрос.УстановитьПараметр("Договор", ПараметрыЗапроса["Договор"]);
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		Если ЗначениеЗаполнено(Ответ["Контрагент"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Организация"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Договор"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.ОтчетКомиссионера, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	Возврат РезультатЗапроса;
	
КонецФункции

Функция МаршрутизироватьОтчетКомитенту(ПараметрыЗапроса, ДатаДокумента) Экспорт
//Гудкова. вместо неё вызывается маршрут РТУ. они одинаковые	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка, 
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	Маршрутизация.Контрагент КАК Контрагент,
				   //|	Маршрутизация.Договор КАК Договор, 
				   //Стало:
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор,
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	Маршрутизация.Организация КАК Организация
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация
	               // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.КонтрагентыИДоговоры КАК МаршрутизацияКонтрагентыИДоговоры
				   |		ПО (Маршрутизация.Ссылка = МаршрутизацияКонтрагентыИДоговоры.Ссылка)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.ОтчетКомитенту)    
				   // Евросиб(ДИТ) US 86962 ТА 87365  Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.КонтрагентПустой
				   //|				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Контрагент = &Контрагент
				   //|					ИЛИ Маршрутизация.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|		КОНЕЦ
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.ДоговорПустой
				   //|				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Договор = &Договор
				   //|					ИЛИ Маршрутизация.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|		КОНЕЦ
				   //Стало:
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.КонтрагентПустой
				   |				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = &Контрагент
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |		КОНЕЦ
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.ДоговорПустой
				   |				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = &Договор
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |		КОНЕЦ
				   // Евросиб(ДИТ) US 86962 ТА 87365  Сержантова А.С. Конец: 05.09.2024
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ОрганизацияПустая
	               |				ТОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.Организация = &Организация
	               |					ИЛИ Маршрутизация.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("Контрагент", ПараметрыЗапроса["Контрагент"]);
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса["Организация"]);
	Запрос.УстановитьПараметр("Договор", ПараметрыЗапроса["Договор"]);
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		Если ЗначениеЗаполнено(Ответ["Контрагент"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Организация"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Договор"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.ОтчетКомитенту, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	Возврат РезультатЗапроса;
	
КонецФункции

Функция МаршрутизироватьПТУ(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	// это всё не сработает, т.к. перед записью ссылки нет
	ЗагруженИзДиадок = Ложь;
	ЗагруженИзРИТМ = Ложь;
	СсылкаОбъектМаршрутизации = ПараметрыЗапроса["ОбъектМаршрутизации"].Ссылка;
	// проверяем наличие загрузки этого ПТУ из РИТМа
	Если ЗначениеЗаполнено(СсылкаОбъектМаршрутизации) Тогда //Евросиб Гудкова( 26.10.2020 Ticket№ 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПротоколОбменов.ДействиеПриОбмене КАК ДействиеПриОбмене,
		               |	ПротоколОбменов.УзелОбмена КАК УзелОбмена,
		               |	ПротоколОбменов.Объект КАК Объект,
		               |	ПротоколОбменов.УИДИсточника КАК УИДИсточника,
		               |	ПротоколОбменов.ПроведенВБУ КАК ПроведенВБУ,
		               |	ПротоколОбменов.Ответственный КАК Ответственный,
		               |	ПротоколОбменов.ДатаОбмена КАК ДатаОбмена,
		               |	ПротоколОбменов.НомерДатаВБУ КАК НомерДатаВБУ
		               |ИЗ
		               |	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		               |ГДЕ
		               |	ПротоколОбменов.Объект = &Объект
		               |	И ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных)
		               |	И ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.РИТМ)";
		Запрос.УстановитьПараметр("Объект", СсылкаОбъектМаршрутизации);
		Ответ = Запрос.Выполнить().Выбрать();
		Если Ответ.Следующий() Тогда
	//		ЗагруженИзДиадок = ЗагруженИзДиадок ИЛИ Ответ.УзелОбмена = Перечисления.УзлыОбмена.Диадок;
			ЗагруженИзРИТМ = Истина; //Гудкова Ticket#0203030 ЗагруженИзРИТМ ИЛИ Ответ.УзелОбмена = Перечисления.УзлыОбмена.РИТМ;
		КонецЕсли;
	
		// проверяем наличие загрузки этого ПТУ из Диадока //Гудкова Ticket#0203030
		Запрос.Текст =  "ВЫБРАТЬ
		                |	Диадок_Документы.Документ КАК Документ,
		                |	Диадок_Документы.Статус КАК Статус
		                |ИЗ
		                |	Справочник.Диадок_Документы КАК Диадок_Документы
		                |ГДЕ
		                |	Диадок_Документы.Документ = &Объект";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗагруженИзДиадок = Истина;
		КонецЕсли; 	
	КонецЕсли; // Евросиб Гудкова) 	
	//Если объект маршрутизации - это заполненная ссылка, то дополнительные свойства не проверяем.
	ЗагруженИзРИТМ = ЗагруженИзРИТМ 
		ИЛИ (Не Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ПараметрыЗапроса["ОбъектМаршрутизации"])) 
			И ПараметрыЗапроса["ОбъектМаршрутизации"].ДополнительныеСвойства.Свойство("ЗагруженИзРИТМ"));
	 ЗагруженИзДиадок = ЗагруженИзДиадок 
	 	ИЛИ (Не Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ПараметрыЗапроса["ОбъектМаршрутизации"])) 
			И ПараметрыЗапроса["ОбъектМаршрутизации"].ДополнительныеСвойства.Свойство("ЗагруженИзДиадок"));
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка, 
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	Маршрутизация.Договор КАК Договор,
				   //|	Маршрутизация.Контрагент КАК Контрагент,
				   //Стало:
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор,
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	Маршрутизация.Организация КАК Организация,
	               |	Маршрутизация.ПТУРИТМ КАК ПТУРИТМ,
	               |	Маршрутизация.ЭДО КАК ПТУДиадок,
	               |	Маршрутизация.ЦФО КАК ЦФО,
	               |	Маршрутизация.ПТУШтраф КАК ПТУШтраф,
				   //Евросиб Максимова 17062021 #0216135
				   |	Маршрутизация.ПТУПретензия КАК ПТУПретензия,
				   //Евросиб Максимова 17062021 #0216135				   				   
				   |	Маршрутизация.Копия КАК Копия,
	               |	Маршрутизация.Резидент КАК Резидент,
	               |	Маршрутизация.Нерезидент КАК Нерезидент,
	               |	ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия) КАК КонтрагентРезидент,
				   //Евросиб Каблов 12.08.2022 ( Task 55578
				   |	Маршрутизация.ПТУВидУслуг КАК ПТУВидУслуг,
				   //Евросиб Каблов 12.08.2022 )
				   //Евросиб Каблов 16.08.2021 ( Ticket#0240249
	               |	Маршрутизация.ПТУСуммаОт КАК ПТУСуммаОт,
	               |	Маршрутизация.ПТУСуммаДо КАК ПТУСуммаДо
				   //Евросиб Каблов 16.08.2021 )
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.КонтрагентыИДоговоры КАК МаршрутизацияКонтрагентыИДоговоры
				   |		ПО (Маршрутизация.Ссылка = МаршрутизацияКонтрагентыИДоговоры.Ссылка)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.ПоступлениеТоваровУслуг)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.КонтрагентПустой
				   //|				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Контрагент = &Контрагент
				   //|					ИЛИ Маршрутизация.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|		КОНЕЦ 
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.ДоговорПустой
				   //|				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Договор = &Договор
				   //|					ИЛИ Маршрутизация.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|		КОНЕЦ
				   //Стало:
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.КонтрагентПустой
				   |				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = &Контрагент
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |		КОНЕЦ
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.ДоговорПустой
				   |				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = &Договор
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |		КОНЕЦ
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ОрганизацияПустая
	               |				ТОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.Организация = &Организация
	               |					ИЛИ Маршрутизация.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.Резидент <> Маршрутизация.Нерезидент
	               |				ТОГДА (Маршрутизация.Резидент = ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия))
	               |						ИЛИ (Маршрутизация.Нерезидент = ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).СтранаРегистрации <> ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия))
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И Маршрутизация.ПТУШтраф = &Штраф
				   //Евросиб Максимова 17062021 #0216135
	               |	И Маршрутизация.ПТУПретензия= &Претензия
				   //Евросиб Максимова 17062021 #0216135				   				   
				   |	И (Маршрутизация.ЦФО = &ЦФО ИЛИ Маршрутизация.ЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка))
	               |	И Маршрутизация.Копия = &Копия
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.Резидент <> Маршрутизация.Нерезидент
	               |				ТОГДА Маршрутизация.Резидент = (ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия))
	               |						И Маршрутизация.Нерезидент = (ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).СтранаРегистрации <> ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия))
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И Маршрутизация.ПТУРИТМ = &ПТУРИТМ
	               |	И Маршрутизация.ЭДО = &ЭДО
				   //Евросиб Каблов 12.08.2022 ( Task 55578
				   |	И (Маршрутизация.ПТУВидУслуг = &ВидУслуг ИЛИ Маршрутизация.ПТУВидУслуг = ЗНАЧЕНИЕ(Перечисление.ВидыУслугПодрядчиков.ПустаяСсылка))
				   //Евросиб Каблов 12.08.2022 )
				   //Евросиб Каблов 16.08.2021 ( Ticket#0240249
	               |	И (&ПолнаяСуммаВСФ МЕЖДУ Маршрутизация.ПТУСуммаОт И Маршрутизация.ПТУСуммаДо
	               |			ИЛИ Маршрутизация.ПТУСуммаОт = 0
	               |				И Маршрутизация.ПТУСуммаДо = 0)";
				   //Евросиб Каблов 16.08.2021 )
	Запрос.УстановитьПараметр("Контрагент", ПараметрыЗапроса["Контрагент"]);
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса["Организация"]);
	Запрос.УстановитьПараметр("Договор", ПараметрыЗапроса["Договор"]);
	Запрос.УстановитьПараметр("Штраф", ПараметрыЗапроса["Штраф"]);
	//Евросиб Максимова 17062021 #0216135
	Запрос.УстановитьПараметр("Претензия", ПараметрыЗапроса["Претензия"]);	
	//Евросиб Максимова 17062021 #0216135
	
//Евросиб Гудкова( 10.08.2020
//Евросиб Гудкова( 29.09.2020 Ticket№ 0208324
	Запрос.УстановитьПараметр("ЦФО", ПараметрыЗапроса["ЦФО"]);
// Евросиб Гудкова) 
	Запрос.УстановитьПараметр("Копия", ПараметрыЗапроса["Копия"]);
// Евросиб Гудкова) 	
	//Запрос.УстановитьПараметр("РазнесеноПолностью", ПараметрыЗапроса["РазнесеноПолностью"]);
	Запрос.УстановитьПараметр("ПТУРИТМ", ЗагруженИзРИТМ);
	Запрос.УстановитьПараметр("ЭДО", (ЗагруженИзДиадок И НЕ ЗагруженИзРИТМ));
	//Евросиб Каблов 16.08.2021 ( Ticket#0240249
	Запрос.УстановитьПараметр("ПолнаяСуммаВСФ", ПараметрыЗапроса["ПолнаяСуммаВСФ"]);
	//Евросиб Каблов 16.08.2021 )
	
	//Евросиб Каблов 12.08.2022 ( Task 55578
	Запрос.УстановитьПараметр("ВидУслуг", ПараметрыЗапроса["ВидУслуг"]);
	//Евросиб Каблов 12.08.2022 )

	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		Если ЗначениеЗаполнено(Ответ["Контрагент"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Организация"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Договор"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если Ответ["ПТУДиадок"] = ЗагруженИзДиадок Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если Ответ["ПТУРИТМ"] = ЗагруженИзРИТМ Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если Ответ["ПТУШтраф"] = ПараметрыЗапроса["Штраф"] Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
//Евросиб Максимова 17062021 #0216135
		Если Ответ["ПТУПретензия"] = ПараметрыЗапроса["Претензия"] Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
//Евросиб Максимова 17062021 #0216135
//Евросиб Гудкова( 29.09.2020 Ticket№ 0208324
		Если Ответ["ЦФО"] = ПараметрыЗапроса["ЦФО"] Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если Ответ["Копия"] = ПараметрыЗапроса["Копия"] Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
//Евросиб Гудкова( 19.10.2020 Ticket№ 0210623 пришли пользователи, сняли с базового маршрута обе галки, и всё сломалось.
		//Если Ответ["КонтрагентРезидент"] Тогда
		//	Если Ответ["КонтрагентРезидент"] <> Ответ["НеРезидент"] Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		//Иначе
		//	Если (не Ответ["КонтрагентРезидент"]) <> Ответ["Резидент"] Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		//КонецЕсли;
		Если Ответ["КонтрагентРезидент"] = Ответ["Резидент"] Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если (не Ответ["КонтрагентРезидент"]) = Ответ["НеРезидент"] Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
// Евросиб Гудкова)
		//Евросиб Каблов 16.08.2021 ( Ticket#0240249
		Если Ответ.ПТУСуммаОт <= ПараметрыЗапроса["ПолнаяСуммаВСФ"] И Ответ.ПТУСуммаДо >= ПараметрыЗапроса["ПолнаяСуммаВСФ"] Тогда
			КоличествоСовпадений = КоличествоСовпадений + 1;
		КонецЕсли;
		//Евросиб Каблов 16.08.2021 )
		
		//Евросиб Каблов 12.08.2022 ( Task 55578
		Если ЗначениеЗаполнено(Ответ["ПТУВидУслуг"]) Тогда
			КоличествоСовпадений = КоличествоСовпадений + 1;
		КонецЕсли;
		//Евросиб Каблов 12.08.2022 )
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		//Евросиб Каблов 12.08.2022 ( Task 55578
		//РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения));
		//ДИТ Шевченко А.В. US 92974 TA 99395 03.03.2025
		//РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника, ВыполнятьАвтоматическиЕслиПредыдущаяЗадачаСТемЖеИсполнителем", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника, Стр.ВыполнятьАвтоматическиЕслиПредыдущаяЗадачаСТемЖеИсполнителем));
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника, ВыполнятьАвтоматическиЕслиПредыдущаяЗадачаСТемЖеИсполнителем, УсловиеАвтоматическогоВыполнения", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника, Стр.ВыполнятьАвтоматическиЕслиПредыдущаяЗадачаСТемЖеИсполнителем, Стр.УсловиеАвтоматическогоВыполнения));
		//ДИТ Шевченко А.В. US 92974 TA 99395 03.03.2025
		//Евросиб Каблов 12.08.2022 )
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.ПоступлениеТоваровУслуг, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	Возврат РезультатЗапроса;
	
КонецФункции

Функция МаршрутизироватьРТУ(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка,
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	Маршрутизация.Контрагент КАК Контрагент,
				   //|	Маршрутизация.Договор КАК Договор, 
				   //Стало:
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор,
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	Маршрутизация.Организация КАК Организация,
	               |	Маршрутизация.ЭДО КАК ЭДО,
	               |	Маршрутизация.ЦФО КАК ЦФО
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация 
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.КонтрагентыИДоговоры КАК МаршрутизацияКонтрагентыИДоговоры
				   |		ПО (Маршрутизация.Ссылка = МаршрутизацияКонтрагентыИДоговоры.Ссылка)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И (Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.РеализацияТоваровУслуг)
	               |			ИЛИ Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.КорректировкаРеализации)
	               |			ИЛИ Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.ОтчетКомитенту))
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.КонтрагентПустой
				   //|				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Контрагент = &Контрагент
				   //|					ИЛИ Маршрутизация.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|		КОНЕЦ
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.ДоговорПустой
				   //|				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Договор = &Договор
				   //|					ИЛИ Маршрутизация.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|		КОНЕЦ
				   //Стало:
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.КонтрагентПустой
				   |				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = &Контрагент
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |		КОНЕЦ
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.ДоговорПустой
				   |				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = &Договор
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |		КОНЕЦ
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ОрганизацияПустая
	               |				ТОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.Организация = &Организация
	               |					ИЛИ Маршрутизация.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |		КОНЕЦ
	               |	И (Маршрутизация.ЦФО = &ЦФО
	               |			ИЛИ Маршрутизация.ЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка))
	               |	И Маршрутизация.ЭДО = &ЭДО
	               |	И Маршрутизация.ОплатаОригинал = &ОплатаОригинал
	               |	И Маршрутизация.ДокументМодифицирован = &ДатаДокументаИзменена
				   // Евросиб US 89967 TA 91565 Рыбьяков К.А. 08.11.2024 ((
				   |	И Маршрутизация.ДокументМодифицированСЗапретомНаПечать = &ДатаДокументаИзмененаСЗапретомНаПечать";
				   // Евросиб Рыбьяков К.А. 08.11.2024 ))
	Запрос.УстановитьПараметр("Контрагент", ПараметрыЗапроса["Контрагент"]);
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса["Организация"]);
	Запрос.УстановитьПараметр("Договор", ПараметрыЗапроса["Договор"]);
	//Евросиб Гудкова( 12.09.2020 Ticket№ 0206196
	Запрос.УстановитьПараметр("ЭДО", ПараметрыЗапроса["ЭДО"]);
	Запрос.УстановитьПараметр("ЦФО", ПараметрыЗапроса["ЦФО"]);
	// Евросиб Гудкова) 
	// Евросиб US 89967 TA 91565 Рыбьяков К.А. 08.11.2024 ((
	Если ПараметрыЗапроса.Получить("ДатаДокументаИзмененаСЗапретомНаПечать") = Неопределено Тогда
		Запрос.УстановитьПараметр("ДатаДокументаИзмененаСЗапретомНаПечать", Ложь);
	Иначе
		Запрос.УстановитьПараметр("ДатаДокументаИзмененаСЗапретомНаПечать", ПараметрыЗапроса["ДатаДокументаИзмененаСЗапретомНаПечать"]);
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 08.11.2024 ))
	//Евросиб Максимова 16.02.21
	Запрос.УстановитьПараметр("ОплатаОригинал", ПараметрыЗапроса["ОплатаОригинал"]);
	//++ Зубов 36879 12.08.2021
	Если ПараметрыЗапроса.Получить("ДатаДокументаИзменена")=Неопределено Тогда
		Запрос.УстановитьПараметр("ДатаДокументаИзменена", Ложь);
	Иначе
		Запрос.УстановитьПараметр("ДатаДокументаИзменена", ПараметрыЗапроса["ДатаДокументаИзменена"]);
	КонецЕсли;
	//-- Зубов 36879 12.08.2021
	//Евросиб

    Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		Если ЗначениеЗаполнено(Ответ["Контрагент"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Организация"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Договор"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
//Евросиб Гудкова( 12.09.2020 Ticket№ 0206196
		Если ЗначениеЗаполнено(Ответ["ЦФО"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
// Евросиб Гудкова) 
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.РеализацияТоваровУслуг, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	Возврат РезультатЗапроса;
	
КонецФункции

Функция МаршрутизироватьПСЦ(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка,    
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	Маршрутизация.Контрагент КАК Контрагент,
				   //|	Маршрутизация.Договор КАК Договор,
				   //|	Маршрутизация.ВидПеревозки КАК ВидПеревозки,
				   //Стало:
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор,
				   |	ЕСТЬNULL(МаршрутизацияВидыПеревозок.ВидПеревозки, ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ПустаяСсылка)) КАК ВидПеревозки,
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	Маршрутизация.Организация КАК Организация,
	               |	Маршрутизация.Валюта КАК Валюта,
	               |	Маршрутизация.КатегорияДоговора КАК КатегорияДоговора,
	               |	Маршрутизация.Нетиповой КАК Нетиповой,
	               |	Маршрутизация.Нерезидент КАК Нерезидент,
	               |	Маршрутизация.Типовой КАК Типовой,
	               |	Маршрутизация.ВидДоговора КАК ВидДоговора,
	               |	Маршрутизация.ЦФО КАК ЦФО,
	               |	Маршрутизация.Фрахт КАК Фрахт,
	               |	Маршрутизация.ВидПСЦ КАК ВидПСЦ,
	               |	Маршрутизация.КатегорияУслуг КАК КатегорияУслуг,
	               |	Маршрутизация.МестоОказанияУслуг КАК МестоОказанияУслуг,
	               |	Маршрутизация.ТипКалькуляции КАК ТипКалькуляции
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация 
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.ВидыПеревозок КАК МаршрутизацияВидыПеревозок
				   |		ПО (Маршрутизация.Ссылка = МаршрутизацияВидыПеревозок.Ссылка)
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.КонтрагентыИДоговоры КАК МаршрутизацияКонтрагентыИДоговоры
				   |		ПО (Маршрутизация.Ссылка = МаршрутизацияКонтрагентыИДоговоры.Ссылка)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.ПротоколСогласованияЦены)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.КонтрагентПустой
				   //|				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Контрагент = &Контрагент
				   //|					ИЛИ Маршрутизация.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|		КОНЕЦ
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.ДоговорПустой
				   //|				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Договор = &Договор
				   //|					ИЛИ Маршрутизация.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|		КОНЕЦ   
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ПустаяСсылка)
				   //|				ТОГДА ИСТИНА
				   //|			ИНАЧЕ Маршрутизация.ВидПеревозки = &ВидПеревозки
				   //|		КОНЕЦ
				   //Стало:
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.КонтрагентПустой
				   |				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = &Контрагент
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |		КОНЕЦ
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.ДоговорПустой
				   |				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = &Договор
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |		КОНЕЦ
				   |	И ВЫБОР
				   |			КОГДА ЕСТЬNULL(МаршрутизацияВидыПеревозок.ВидПеревозки, ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ПустаяСсылка)
				   |				ТОГДА ИСТИНА
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияВидыПеревозок.ВидПеревозки, ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ПустаяСсылка)) = &ВидПеревозки
				   |		КОНЕЦ
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ОрганизацияПустая
	               |				ТОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.Организация = &Организация
	               |					ИЛИ Маршрутизация.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ЦФОПустой
	               |				ТОГДА &ЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.ЦФО = &ЦФО
	               |					ИЛИ Маршрутизация.ЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка)
	               |		КОНЕЦ
	               |	И Маршрутизация.Фрахт = &Фрахт
	               |	И ВЫБОР
	               |			КОГДА &Нерезидент
	               |				ТОГДА Маршрутизация.Нерезидент
	               |			ИНАЧЕ Маршрутизация.Резидент
	               |		КОНЕЦ
	               |	И (Маршрутизация.КатегорияДоговора = &КатегорияДоговора
	               |			ИЛИ Маршрутизация.КатегорияДоговора = ЗНАЧЕНИЕ(Справочник.КатегорииДоговоров.ПустаяСсылка))
	               |	И ВЫБОР
	               |			КОГДА &Нетиповой
	               |				ТОГДА Маршрутизация.Нетиповой
	               |			ИНАЧЕ Маршрутизация.Типовой
	               |		КОНЕЦ
	               |	И (Маршрутизация.ВидДоговора = &ВидДоговора
	               |			ИЛИ Маршрутизация.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ПустаяСсылка))
	               |	И (Маршрутизация.Валюта = &Валюта
	               |			ИЛИ Маршрутизация.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
//Евросиб - АСуслов 15.12.2021 16:05:12 #42234
//(
	               |	И (Маршрутизация.ТипКалькуляции = &ТипКалькуляции
	               |			ИЛИ Маршрутизация.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПустаяСсылка))
//)
//Евросиб - АСуслов 15.12.2021 16:05:13 #42234
				   |	И ВЫБОР
	               |			КОГДА &СодержитВР
	               |				ТОГДА Маршрутизация.СодержитВР
	               |			ИНАЧЕ Маршрутизация.НеСодержитВР
	               |		КОНЕЦ
	               |	И Маршрутизация.ВидПСЦ = &ВидПСЦ
	               |	И ВЫБОР
	               |			КОГДА &СогласованоВDV
	               |				ТОГДА Маршрутизация.СогласованоВDV = 0
	               |						ИЛИ Маршрутизация.СогласованоВDV = 1
	               |			ИНАЧЕ Маршрутизация.СогласованоВDV = 0
	               |					ИЛИ Маршрутизация.СогласованоВDV = 2
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &ПротоколНаДоплатные
	               |				ТОГДА Маршрутизация.ПСЦ_ПротоколНаДоплатныеКТК = 0
	               |						ИЛИ Маршрутизация.ПСЦ_ПротоколНаДоплатныеКТК = 1
	               |			ИНАЧЕ Маршрутизация.ПСЦ_ПротоколНаДоплатныеКТК = 0
	               |					ИЛИ Маршрутизация.ПСЦ_ПротоколНаДоплатныеКТК = 2
	               |		КОНЕЦ
	               |	И (Маршрутизация.КатегорияУслуг = &КатегорияУслуг
	               |			ИЛИ Маршрутизация.КатегорияУслуг = ЗНАЧЕНИЕ(Справочник.КатегорииУслуг.ПустаяСсылка))
	               |	И (Маршрутизация.МестоОказанияУслуг = &МестоОказанияУслуг
	               |			ИЛИ Маршрутизация.МестоОказанияУслуг = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка))
				   //Евросиб Коханенко Н.А. 11.12.2024 (( #88818 
				   |	И (Маршрутизация.Нотис = &Нотис)
				   //Евросиб Коханенко Н.А. 11.12.2024 )) #88818 
				   //ДИТ, Беляев СЮ, US 80865/TA 80877, 12-02-2024, начало
				   |	И (Маршрутизация.Поручение = &Поручение)";
				   //ДИТ, Беляев СЮ, US 80865/TA 80877, 12-02-2024, конец
	Запрос.УстановитьПараметр("Контрагент", ПараметрыЗапроса["Контрагент"]);
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса["Организация"]);
	Запрос.УстановитьПараметр("Договор", ПараметрыЗапроса["Договор"]);
	Запрос.УстановитьПараметр("ВидПеревозки", ПараметрыЗапроса["ВидПеревозки"]);
	Запрос.УстановитьПараметр("ВидПеревозкиПустой", НЕ ЗначениеЗаполнено(ПараметрыЗапроса["ВидПеревозки"]));
	Запрос.УстановитьПараметр("Валюта", ПараметрыЗапроса["Валюта"]);
	Запрос.УстановитьПараметр("ВидПСЦ", ПараметрыЗапроса["ВидПСЦ"]);
	
	Запрос.УстановитьПараметр("Нерезидент", ПараметрыЗапроса["Нерезидент"]);
	Запрос.УстановитьПараметр("СогласованоВDV", ПараметрыЗапроса["СогласованоВDV"]);
	Запрос.УстановитьПараметр("СодержитВР", ПараметрыЗапроса["СодержитВР"]);
	Запрос.УстановитьПараметр("КатегорияДоговора", ПараметрыЗапроса["КатегорияДоговора"]);
	Запрос.УстановитьПараметр("ПротоколНаДоплатные", ПараметрыЗапроса["ПротоколНаДоплатныеКТК"]);
	Запрос.УстановитьПараметр("Нетиповой", ПараметрыЗапроса["Нетиповой"]);
	Запрос.УстановитьПараметр("ВидДоговора", ПараметрыЗапроса["ВидДоговора"]);
//Евросиб Гудкова( 14.07.2020 Ticket№ 0193776
	Запрос.УстановитьПараметр("ЦФО", ПараметрыЗапроса["ЦФО"]);
//Евросиб Гудкова( 28.07.2020 Ticket№ 0201278
	Запрос.УстановитьПараметр("Фрахт", ПараметрыЗапроса["Фрахт"]);
// Евросиб Гудкова) 				   
	//++ Зубов 27.07.2021
	Запрос.УстановитьПараметр("КатегорияУслуг", ПараметрыЗапроса["КатегорияУслуг"]);
	Запрос.УстановитьПараметр("МестоОказанияУслуг", ПараметрыЗапроса["МестоОказанияУслуг"]);
	//-- Зубов 27.07.2021  
	//Евросиб - АСуслов 15.12.2021 15:54:33 #42234
	//(
	Запрос.УстановитьПараметр("ТипКалькуляции", ПараметрыЗапроса["ТипКалькуляции"]);
	//)
	//Евросиб - АСуслов 15.12.2021 15:54:34 #42234
	//ДИТ, Беляев СЮ, US 80865/TA 80877, 12-02-2024, начало
	Запрос.УстановитьПараметр("Поручение", ПараметрыЗапроса["Поручение"]);
	//ДИТ, Беляев СЮ, US 80865/TA 80877, 12-02-2024, конец
	//Евросиб Коханенко Н.А. 11.12.2024 (( #88818 
	Запрос.УстановитьПараметр("Нотис", ПараметрыЗапроса["Нотис"]);
	//Евросиб Коханенко Н.А. 11.12.2024 )) #88818 
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		Если ЗначениеЗаполнено(Ответ["Контрагент"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Организация"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["ВидПеревозки"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Договор"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		
		Если ЗначениеЗаполнено(Ответ["КатегорияДоговора"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если Ответ["Нерезидент"] = ПараметрыЗапроса["Нерезидент"] Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		//Если Ответ["Нетиповой"] = ПараметрыЗапроса["Нетиповой"] Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		//Евросиб - АСуслов 04.01.2022 14:07:49 #
		//(
		Если ПараметрыЗапроса["Нетиповой"] = Ложь Тогда
			Если Ответ["Типовой"] = ПараметрыЗапроса["Нетиповой"] = Ложь Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;	
		Иначе
			Если Ответ["Нетиповой"] = ПараметрыЗапроса["Нетиповой"] Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		КонецЕсли;
		//)
		//Евросиб - АСуслов 04.01.2022 14:07:50 #
		Если ЗначениеЗаполнено(Ответ["ВидДоговора"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Валюта"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		
//Евросиб Гудкова( 14.07.2020 Ticket№ 0193776
		Если ЗначениеЗаполнено(Ответ["ЦФО"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
// Евросиб Гудкова) 				   
//Евросиб Гудкова( 14.07.2020 Ticket№ 0193776
		Если ЗначениеЗаполнено(Ответ["ВидПСЦ"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
//++ Зубов 27.07.2021
		Если ЗначениеЗаполнено(Ответ["КатегорияУслуг"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["МестоОказанияУслуг"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
//++ Зубов 27.07.2021 
		//Евросиб - АСуслов 15.12.2021 16:06:18 #42234
		//(
		Если ЗначениеЗаполнено(Ответ["ТипКалькуляции"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		//)
		//Евросиб - АСуслов 15.12.2021 16:06:21 #42234
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения,ИсполнительКакРуководительПоНаправлению,НаблюдательКакРуководительПоНаправлению, ОтветственныйМенеджерПСЦ, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения,Стр.ИсполнительКакРуководительПоНаправлению,Стр.НаблюдательКакРуководительПоНаправлению, Стр.ОтветственныйМенеджерПСЦ, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.ПротоколСогласованияЦены, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.ПротоколСогласованияЦены, ДатаДокумента, ПараметрыЗапроса["ВидПеревозки"]);
	Возврат РезультатЗапроса;
	
КонецФункции

//Евросиб Каблов 20.05.2024 #67092
Функция МаршрутизироватьПСЦПоставщика(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка,  
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	Маршрутизация.Контрагент КАК Контрагент,
				   //|	Маршрутизация.Договор КАК Договор, 
				   //Стало:
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор,
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	Маршрутизация.Организация КАК Организация,
	               |	Маршрутизация.Валюта КАК Валюта,
	               |	Маршрутизация.КатегорияДоговора КАК КатегорияДоговора,
	               |	Маршрутизация.Нетиповой КАК Нетиповой,
	               |	Маршрутизация.Нерезидент КАК Нерезидент,
	               |	Маршрутизация.Типовой КАК Типовой,
	               |	Маршрутизация.ВидДоговора КАК ВидДоговора,
	               |	Маршрутизация.ЦФО КАК ЦФО,
	               |	Маршрутизация.ВидУслугПоставщика КАК ВидУслугПоставщика,
	               |	Маршрутизация.КатегорияУслуг КАК КатегорияУслуг,
				   |	Маршрутизация.МестоОказанияУслуг КАК МестоОказанияУслуг
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация 
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.КонтрагентыИДоговоры КАК МаршрутизацияКонтрагентыИДоговоры
				   |		ПО (Маршрутизация.Ссылка = МаршрутизацияКонтрагентыИДоговоры.Ссылка)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.ПСЦПоставщика)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.КонтрагентПустой
				   //|				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Контрагент = &Контрагент
				   //|					ИЛИ Маршрутизация.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|		КОНЕЦ 
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.ДоговорПустой
				   //|				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Договор = &Договор
				   //|					ИЛИ Маршрутизация.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|		КОНЕЦ
				   //Стало:
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.КонтрагентПустой
				   |				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = &Контрагент
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |		КОНЕЦ
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.ДоговорПустой
				   |				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = &Договор
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |		КОНЕЦ
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ОрганизацияПустая
	               |				ТОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.Организация = &Организация
	               |					ИЛИ Маршрутизация.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ЦФОПустой
	               |				ТОГДА &ЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.ЦФО = &ЦФО
	               |					ИЛИ Маршрутизация.ЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка)
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &Нерезидент
	               |				ТОГДА Маршрутизация.Нерезидент
	               |			ИНАЧЕ Маршрутизация.Резидент
	               |		КОНЕЦ
	               |	И (Маршрутизация.КатегорияДоговора = &КатегорияДоговора
	               |			ИЛИ Маршрутизация.КатегорияДоговора = ЗНАЧЕНИЕ(Справочник.КатегорииДоговоров.ПустаяСсылка))
	               |	И ВЫБОР
	               |			КОГДА &Типовой
	               |				ТОГДА Маршрутизация.Типовой
	               |			ИНАЧЕ Маршрутизация.Нетиповой
	               |		КОНЕЦ
	               |	И (Маршрутизация.ВидДоговора = &ВидДоговора
	               |			ИЛИ Маршрутизация.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ПустаяСсылка))
	               |	И (Маршрутизация.Валюта = &Валюта
	               |			ИЛИ Маршрутизация.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	               |	И ВЫБОР
	               |			КОГДА &СогласованоВDV
	               |				ТОГДА Маршрутизация.СогласованоВDV = 0
	               |						ИЛИ Маршрутизация.СогласованоВDV = 1
	               |			ИНАЧЕ Маршрутизация.СогласованоВDV = 0
	               |					ИЛИ Маршрутизация.СогласованоВDV = 2
	               |		КОНЕЦ
	               |	И (Маршрутизация.ВидУслугПоставщика = &ВидУслугПоставщика
	               |			ИЛИ Маршрутизация.ВидУслугПоставщика = ЗНАЧЕНИЕ(Справочник.ВидыУслугПоставщиков.ПустаяСсылка))
				   |	И (Маршрутизация.КатегорияУслуг = &КатегорияУслуг
	               |			ИЛИ Маршрутизация.КатегорияУслуг = ЗНАЧЕНИЕ(Справочник.КатегорииУслуг.ПустаяСсылка))
	               |	И (Маршрутизация.МестоОказанияУслуг = &МестоОказанияУслуг
	               |			ИЛИ Маршрутизация.МестоОказанияУслуг = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка))";
	Запрос.УстановитьПараметр("Контрагент", ПараметрыЗапроса["Контрагент"]);
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса["Организация"]);
	Запрос.УстановитьПараметр("Договор", ПараметрыЗапроса["Договор"]);
	Запрос.УстановитьПараметр("ВидПеревозкиПустой", НЕ ЗначениеЗаполнено(ПараметрыЗапроса["ВидПеревозки"]));
	Запрос.УстановитьПараметр("Валюта", ПараметрыЗапроса["Валюта"]);	
	Запрос.УстановитьПараметр("Нерезидент", ПараметрыЗапроса["Нерезидент"]);
	Запрос.УстановитьПараметр("СогласованоВDV", ПараметрыЗапроса["СогласованоВDV"]);
	Запрос.УстановитьПараметр("КатегорияДоговора", ПараметрыЗапроса["КатегорияДоговора"]);
	Запрос.УстановитьПараметр("Типовой", ПараметрыЗапроса["Типовой"]);
	Запрос.УстановитьПараметр("ВидДоговора", ПараметрыЗапроса["ВидДоговора"]);
	Запрос.УстановитьПараметр("ЦФО", ПараметрыЗапроса["ЦФО"]);
	Запрос.УстановитьПараметр("ВидУслугПоставщика", ПараметрыЗапроса["ВидУслугПоставщика"]);
	Запрос.УстановитьПараметр("КатегорияУслуг", ПараметрыЗапроса["КатегорияУслуг"]);
	Запрос.УстановитьПараметр("МестоОказанияУслуг", ПараметрыЗапроса["МестоОказанияУслуг"]);
	
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		Если ЗначениеЗаполнено(Ответ["Контрагент"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Организация"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Договор"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		
		Если ЗначениеЗаполнено(Ответ["КатегорияДоговора"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если Ответ["Нерезидент"] = ПараметрыЗапроса["Нерезидент"] Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ПараметрыЗапроса["Нетиповой"] = Ложь Тогда
			Если Ответ["Типовой"] = ПараметрыЗапроса["Нетиповой"] = Ложь Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;	
		Иначе
			Если Ответ["Нетиповой"] = ПараметрыЗапроса["Нетиповой"] Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["ВидДоговора"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Валюта"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;		
		Если ЗначениеЗаполнено(Ответ["ЦФО"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["ВидУслугПоставщика"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["КатегорияУслуг"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["МестоОказанияУслуг"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения,ИсполнительКакРуководительПоНаправлению,НаблюдательКакРуководительПоНаправлению, ОтветственныйМенеджерПСЦ, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника, УсловиеАвтоматическогоВыполнения", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения,Стр.ИсполнительКакРуководительПоНаправлению,Стр.НаблюдательКакРуководительПоНаправлению, Стр.ОтветственныйМенеджерПСЦ, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника, Стр.УсловиеАвтоматическогоВыполнения));
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.ПротоколСогласованияЦены, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.ПротоколСогласованияЦены, ДатаДокумента, ПараметрыЗапроса["ВидПеревозки"]);
	Возврат РезультатЗапроса;
	
КонецФункции

//Евросиб Каблов 20.05.2024 #89872
Функция МаршрутизироватьПротоколСНормативнымиСтавкамиНаУслугиПоставщиков(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Маршрутизация.Ссылка КАК Ссылка,				   
	|	Маршрутизация.Организация КАК Организация,
	|	Маршрутизация.ЦФО КАК ЦФО,
	|	Маршрутизация.ВидУслугПоставщика КАК ВидУслугПоставщика,
	|	Маршрутизация.КатегорияУслуг КАК КатегорияУслуг
	|ИЗ
	|	Справочник.Маршрутизация КАК Маршрутизация 
	|ГДЕ
	|	НЕ Маршрутизация.ПометкаУдаления
	|	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков)
	|	И ВЫБОР
	|			КОГДА Маршрутизация.ОрганизацияПустая
	|				ТОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ИНАЧЕ Маршрутизация.Организация = &Организация
	|					ИЛИ Маршрутизация.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА Маршрутизация.ЦФОПустой
	|				ТОГДА &ЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка)
	|			ИНАЧЕ Маршрутизация.ЦФО = &ЦФО
	|					ИЛИ Маршрутизация.ЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка)
	|		КОНЕЦ
	|	И (Маршрутизация.ВидУслугПоставщика = &ВидУслугПоставщика
	|			ИЛИ Маршрутизация.ВидУслугПоставщика = ЗНАЧЕНИЕ(Справочник.ВидыУслугПоставщиков.ПустаяСсылка))
	|	И (Маршрутизация.КатегорияУслуг = &КатегорияУслуг
	|			ИЛИ Маршрутизация.КатегорияУслуг = ЗНАЧЕНИЕ(Справочник.КатегорииУслуг.ПустаяСсылка))";
	
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса["Организация"]);
	Запрос.УстановитьПараметр("ЦФО", ПараметрыЗапроса["ЦФО"]);
	Запрос.УстановитьПараметр("ВидУслугПоставщика", ПараметрыЗапроса["ВидУслугПоставщика"]);
	Запрос.УстановитьПараметр("КатегорияУслуг", ПараметрыЗапроса["КатегорияУслуг"]);
	
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		Если ЗначениеЗаполнено(Ответ["Организация"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["ЦФО"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["ВидУслугПоставщика"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["КатегорияУслуг"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения,ИсполнительКакРуководительПоНаправлению,НаблюдательКакРуководительПоНаправлению, ОтветственныйМенеджерПСЦ, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения,Стр.ИсполнительКакРуководительПоНаправлению,Стр.НаблюдательКакРуководительПоНаправлению, Стр.ОтветственныйМенеджерПСЦ, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция МаршрутизироватьДоговор(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка,
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	Маршрутизация.Контрагент КАК Контрагент, 
				   //Стало:
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	Маршрутизация.Организация КАК Организация,
	               |	Маршрутизация.КатегорияДоговора КАК КатегорияДоговора,
	               |	Маршрутизация.ТипДоговорнойЗаписи КАК ТипДоговорнойЗаписи,
	               |	Маршрутизация.ВидДоговора КАК ВидДоговора,
	               |	Маршрутизация.Валюта КАК Валюта,
	               |	Маршрутизация.Нетиповой КАК Нетиповой,
	               |	Маршрутизация.Нерезидент КАК Нерезидент,
	               |	Маршрутизация.ЦФО КАК ЦФО,
	               |	Маршрутизация.РегионДоговора КАК РегионДоговора,
	               |	Маршрутизация.УсловиеОплаты КАК УсловиеОплаты,
	               |	Маршрутизация.Подписан КАК Подписан
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация 
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.КонтрагентыИДоговоры КАК МаршрутизацияКонтрагентыИДоговоры
				   |		ПО (Маршрутизация.Ссылка = МаршрутизацияКонтрагентыИДоговоры.Ссылка)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.Договор)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.КонтрагентПустой
				   //|				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Контрагент = &Контрагент
				   //|					ИЛИ Маршрутизация.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|		КОНЕЦ 
				   //Стало:
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.КонтрагентПустой
				   |				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = &Контрагент
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |		КОНЕЦ
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ОрганизацияПустая
	               |				ТОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.Организация = &Организация
	               |					ИЛИ Маршрутизация.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ЦФОПустой
	               |				ТОГДА &Организация = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.ЦФО = &ЦФО
	               |					ИЛИ Маршрутизация.ЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка)
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &Нерезидент
	               |				ТОГДА Маршрутизация.Нерезидент
	               |			ИНАЧЕ Маршрутизация.Резидент
	               |		КОНЕЦ
	               |	И (Маршрутизация.КатегорияДоговора = &КатегорияДоговора
	               |			ИЛИ Маршрутизация.КатегорияДоговора = ЗНАЧЕНИЕ(Справочник.КатегорииДоговоров.ПустаяСсылка))
	               |	И ВЫБОР
	               |			КОГДА &Нетиповой
	               |				ТОГДА Маршрутизация.Нетиповой
	               |			ИНАЧЕ Маршрутизация.Типовой
	               |		КОНЕЦ
	               |	И (Маршрутизация.ВидДоговора = &ВидДоговора
	               |			ИЛИ Маршрутизация.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ПустаяСсылка))
	               |	И (Маршрутизация.ТипДоговорнойЗаписи = &ТипДоговорнойЗаписи
	               |			ИЛИ Маршрутизация.ТипДоговорнойЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипДоговорнойЗаписи.ПустаяСсылка))
	               |	И (Маршрутизация.РегионДоговора = &РегионДоговора
	               |			ИЛИ Маршрутизация.РегионДоговора = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка))
	               |	И (Маршрутизация.Валюта = &Валюта
	               |			ИЛИ Маршрутизация.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))";
	Запрос.УстановитьПараметр("Контрагент", ПараметрыЗапроса["Контрагент"]);
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса["Организация"]);
	Запрос.УстановитьПараметр("Нерезидент", ПараметрыЗапроса["Нерезидент"]);
	Запрос.УстановитьПараметр("КатегорияДоговора", ПараметрыЗапроса["КатегорияДоговора"]);
	Запрос.УстановитьПараметр("Нетиповой", ПараметрыЗапроса["Нетиповой"]);
	Запрос.УстановитьПараметр("ЦФО", ПараметрыЗапроса["ЦФО"]);
	Запрос.УстановитьПараметр("ВидДоговора", ПараметрыЗапроса["ВидДоговора"]);
	Запрос.УстановитьПараметр("ТипДоговорнойЗаписи", ПараметрыЗапроса["ТипДоговорнойЗаписи"]);
	Запрос.УстановитьПараметр("РегионДоговора", ПараметрыЗапроса["РегионДоговора"]);
	Запрос.УстановитьПараметр("Валюта", ПараметрыЗапроса["Валюта"]);
	Запрос.УстановитьПараметр("УсловиеОплаты", ПараметрыЗапроса["УсловиеОплаты"]);
	Запрос.УстановитьПараметр("Подписан", ПараметрыЗапроса["Подписан"]);
	
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		Если ЗначениеЗаполнено(Ответ["Контрагент"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Организация"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		
		Если ЗначениеЗаполнено(Ответ["КатегорияДоговора"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["ВидДоговора"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["ТипДоговорнойЗаписи"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["РегионДоговора"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Валюта"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если Ответ["Нетиповой"] = ПараметрыЗапроса["Нетиповой"] Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если Ответ["Нерезидент"] = ПараметрыЗапроса["Нерезидент"] Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения, НаблюдательКакРуководительИсполнителя, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения, Стр.НаблюдательКакРуководительИсполнителя, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.Договор, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	Возврат РезультатЗапроса;
	
КонецФункции

Функция МаршрутизироватьПроект(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.Проект)";
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		КоличествоСовпадений = КоличествоСовпадений + 1;
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения, НаблюдательКакРуководительИсполнителя, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения, Стр.НаблюдательКакРуководительИсполнителя, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.Сделка, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	Возврат РезультатЗапроса;
	
КонецФункции

// ++ ДИТ_Агафонов_task 50388 05.07.2022
Функция МаршрутизироватьРелизСобственника(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка,  
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	Маршрутизация.Контрагент КАК Контрагент,
				   //|	Маршрутизация.Договор КАК Договор, 
				   //Стало:
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор,
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	Маршрутизация.Организация КАК Организация,
	               |	Маршрутизация.ЦФО КАК ЦФО
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.КонтрагентыИДоговоры КАК МаршрутизацияКонтрагентыИДоговоры
				   |		ПО (Маршрутизация.Ссылка = МаршрутизацияКонтрагентыИДоговоры.Ссылка)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.РелизСобственника)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.КонтрагентПустой
				   //|				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Контрагент = &Контрагент
				   //|					ИЛИ Маршрутизация.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|		КОНЕЦ
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.ДоговорПустой
				   //|				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Договор = &Договор
				   //|					ИЛИ Маршрутизация.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|		КОНЕЦ
				   //Стало:
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.КонтрагентПустой
				   |				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = &Контрагент
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |		КОНЕЦ
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.ДоговорПустой
				   |				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = &Договор
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |		КОНЕЦ
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ОрганизацияПустая
	               |				ТОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.Организация = &Организация
	               |					ИЛИ Маршрутизация.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ЦФОПустой
	               |				ТОГДА &ЦФО = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.ЦФО = &ЦФО
	               |					ИЛИ Маршрутизация.ЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка)
	               |		КОНЕЦ
	               |";

	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса["Организация"]);
	Запрос.УстановитьПараметр("Контрагент", ПараметрыЗапроса["Контрагент"]);
	Запрос.УстановитьПараметр("Договор", ПараметрыЗапроса["Договор"]);
	Запрос.УстановитьПараметр("ЦФО", ПараметрыЗапроса["ЦФО"]);
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		Если ЗначениеЗаполнено(Ответ["Контрагент"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Организация"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Договор"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["ЦФО"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		//Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		Статус = ПодходящаяМаршрутизация.НачальныйСтатус;
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения,ИсполнительКакРуководительПоНаправлению,НаблюдательКакРуководительПоНаправлению, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения,Стр.ИсполнительКакРуководительПоНаправлению,Стр.НаблюдательКакРуководительПоНаправлению, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.РелизСобственника, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	Возврат РезультатЗапроса;
	
КонецФункции
// ++ Евросиб Дудоров С.В. US 57543 30.01.2023 

// -- ДИТ_Агафонов_task 50388 05.07.2022  

// ДИТ US 80736 ТА 81088 Сержантова А.С. 26.02.2024 
Функция МаршрутизироватьЗапросНаАвто(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.ЗапросНаАвтоперевозку)";
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		КоличествоСовпадений = КоличествоСовпадений + 1;
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения, НаблюдательКакРуководительИсполнителя, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения, Стр.НаблюдательКакРуководительИсполнителя, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.Сделка, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	Возврат РезультатЗапроса;
	
КонецФункции

//Евросиб Каблов 30.10.2023 #75269
Функция МаршрутизироватьКонтрагента(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Маршрутизация.Ссылка КАК Ссылка,
	|	Маршрутизация.Нерезидент КАК Нерезидент,
	|	Маршрутизация.ТипКонтрагента_Клиент КАК ТипКонтрагента_Клиент,
	|	Маршрутизация.ТипКонтрагента_Подрядчик КАК ТипКонтрагента_Подрядчик
	|ИЗ
	|	Справочник.Маршрутизация КАК Маршрутизация
	|ГДЕ
	|	НЕ Маршрутизация.ПометкаУдаления
	|	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.Контрагент)
	|	И ВЫБОР
	|			КОГДА &Нерезидент
	|				ТОГДА Маршрутизация.Нерезидент
	|			ИНАЧЕ Маршрутизация.Резидент
	|		КОНЕЦ
	|	И (ВЫБОР
	|				КОГДА &ТипКонтрагента_Клиент
	|					ТОГДА Маршрутизация.ТипКонтрагента_Клиент
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|			ИЛИ ВЫБОР
	|				КОГДА &ТипКонтрагента_Подрядчик
	|					ТОГДА Маршрутизация.ТипКонтрагента_Подрядчик
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)";
	Запрос.УстановитьПараметр("Нерезидент", ПараметрыЗапроса["Нерезидент"]);
	Запрос.УстановитьПараметр("ТипКонтрагента_Клиент", ПараметрыЗапроса["ТипКонтрагента_Клиент"]);
	Запрос.УстановитьПараметр("ТипКонтрагента_Подрядчик", ПараметрыЗапроса["ТипКонтрагента_Подрядчик"]);
	
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		Если Ответ["ТипКонтрагента_Клиент"] = ПараметрыЗапроса["ТипКонтрагента_Клиент"] Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если Ответ["ТипКонтрагента_Подрядчик"] = ПараметрыЗапроса["ТипКонтрагента_Подрядчик"] Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если Ответ["Нерезидент"] = ПараметрыЗапроса["Нерезидент"] Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения, НаблюдательКакРуководительИсполнителя, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения, Стр.НаблюдательКакРуководительИсполнителя, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.Договор, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	Возврат РезультатЗапроса;
	
КонецФункции

//Евросиб СубботинВ #89527 30.10.2024 Начало
Функция МаршрутизироватьЗаявкуНаОплату(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.ЗаявкаНаОплату)
	               |	И Маршрутизация.ВидОперацииЗаявкиНаОплату = &ВидОперацииЗаявкиНаОплату
	               |	И Маршрутизация.ПодразделениеДКП = &ПодразделениеДКП";
	
	Запрос.УстановитьПараметр("ПодразделениеДКП", ПараметрыЗапроса.получить("ПодразделениеДКП"));
	Запрос.УстановитьПараметр("ВидОперацииЗаявкиНаОплату", ПараметрыЗапроса.получить("ВидОперации"));
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		КоличествоСовпадений = КоличествоСовпадений + 1;
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения, НаблюдательКакРуководительИсполнителя, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения, Стр.НаблюдательКакРуководительИсполнителя, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	//Евросиб СубботинВ #117172 18.08.2025 Начало
	//ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.Сделка, ДатаДокумента, ПараметрыЗапроса["Договор"]);
    ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.ЗаявкаНаОплату, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	//Евросиб СубботинВ #117172 18.08.2025 Конец	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция МаршрутизироватьРеестрПлатежей(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.РеестрПлатежей)
	               |	И Маршрутизация.МаршрутСогласованияРеестраНаОплату = &МаршрутСогласования";
	
	Запрос.УстановитьПараметр("МаршрутСогласования", ПараметрыЗапроса.получить("МаршрутСогласования"));

	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		КоличествоСовпадений = КоличествоСовпадений + 1;
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения, НаблюдательКакРуководительИсполнителя, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения, Стр.НаблюдательКакРуководительИсполнителя, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	//Евросиб СубботинВ #117172 18.08.2025 Начало 
	//ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.Сделка, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.РеестрПлатежей, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	//Евросиб СубботинВ #117172 18.08.2025 Конец
	Возврат РезультатЗапроса;
	
КонецФункции

// Евросиб US 90342 Рыбьяков К.А. 14.12.2025 ((
Функция МаршрутизироватьРеестрСпециальныхСтавок(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.РеестрСпециальныхСтавок)";
	               //|	И Маршрутизация.МаршрутСогласованияРеестраНаОплату = &МаршрутСогласования";
	
	//Запрос.УстановитьПараметр("МаршрутСогласования", ПараметрыЗапроса.Получить("МаршрутСогласования"));

	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		КоличествоСовпадений = КоличествоСовпадений + 1;
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		РезультатЗапроса.Добавить(Новый Структура("Состояние, 
												|Исполнитель, 
												|Наблюдатель, 
												|Статус, 
												|Ссылка, 
												|ПредыдущиеЭтапы, 
												|ОРКПоДоговору, 
												|ОтветственныйЗаУчет, 
												|ОтветственныйЗаДоговор, 
												|НормативИсполненияСМоментаСоздания, 
												|ТребуетсяУказатьНаблюдателя, 
												|ТребуетсяУказатьИсполнителя, 
												|ВидНормативаИсполнения, 
												|НаблюдательКакРуководительИсполнителя, 
												|РуководительСотрудника, 
												|ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", 
												Стр.Состояние, 
												Стр.Исполнитель, 
												Стр.Наблюдатель, 
												Статус, 
												ПодходящаяМаршрутизация, 
												Стр.ПредыдущиеЭтапы, 
												Стр.СопровождениеПоДоговору, 
												Стр.ОтветственныйЗаУчет, 
												Стр.ОтветственныйЗаДоговор, 
												Стр.НормативИсполненияСМоментаСоздания, 
												Стр.ТребуетсяУказатьНаблюдателя, 
												Стр.ТребуетсяУказатьИсполнителя, 
												Стр.ВидНормативаИсполнения, 
												Стр.НаблюдательКакРуководительИсполнителя, 
												Стр.РуководительСотрудника, 
												Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.РеестрПлатежей, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	Возврат РезультатЗапроса;
	
КонецФункции // Евросиб Рыбьяков К.А. 14.12.2025 ))

Функция ОтработатьЗамещениеДелегирование(МассивСостояний, ВидДокумента, ТекДата, Договор = неопределено, Параметры = Неопределено) Экспорт

	//Евросиб Каблов 12.08.2022 ( Task 55578
	Для Каждого Стр Из МассивСостояний Цикл
		Стр.Вставить("ИсполнительИзМаршрута", Стр.Исполнитель);
		Стр.Исполнитель = Неопределено;
	КонецЦикла;
	//Евросиб Каблов 12.08.2022 )
	
	Если ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") ИЛИ ТипЗнч(Договор) = Тип("СправочникОбъект.ДоговорыКонтрагентов") Тогда
		
		Для каждого Стр из МассивСостояний Цикл
			// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 30.11.2022
			// Было:
			//Если Стр.ОРКПоДоговору И ЗначениеЗаполнено(Договор.ОтветственныйЗаСопровождение) И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор.ОтветственныйЗаСопровождение, "Недействителен") = Ложь Тогда Стр.Исполнитель = Договор.ОтветственныйЗаСопровождение; КонецЕсли;
			//Если Стр.ОтветственныйЗаДоговор И ЗначениеЗаполнено(Договор.ОтветственныйЗаДоговор) И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор.ОтветственныйЗаДоговор, "Недействителен") = Ложь Тогда Стр.Исполнитель = Договор.ОтветственныйЗаДоговор; КонецЕсли;
			//Если Стр.ОтветственныйЗаУчет И ЗначениеЗаполнено(Договор.ОтветственныйЗаУчет) И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор.ОтветственныйЗаУчет, "Недействителен") = Ложь Тогда Стр.Исполнитель = Договор.ОтветственныйЗаУчет; КонецЕсли;
			//Стало:
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("Договор",				Договор);
			СтруктураПараметров.Вставить("ЦФО",					Справочники.ЦентрыФинансовойОтветственности.ОсновнойЦФО);
			СтруктураПараметров.Вставить("ТипОтветственного",	Перечисления.ТипыОтветственных.ОтветственныйЗаУчет);  
			мОтветственныйЗаУчет = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственного(СтруктураПараметров);
			
			СтруктураПараметров.Вставить("ТипОтветственного",	Перечисления.ТипыОтветственных.ОтветственныйЗаСопровождение);  
			мОтветственныйЗаСопровождение = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственного(СтруктураПараметров);
			//*
			Если Стр.ОРКПоДоговору 
				И ЗначениеЗаполнено(мОтветственныйЗаСопровождение) 
				И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(мОтветственныйЗаСопровождение, "Недействителен") = Ложь Тогда 
				Стр.Исполнитель = мОтветственныйЗаСопровождение; 
			КонецЕсли;
			Если Стр.ОтветственныйЗаДоговор 
				И ЗначениеЗаполнено(Договор.ОтветственныйЗаДоговор) 
				И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор.ОтветственныйЗаДоговор, "Недействителен") = Ложь Тогда 
				Стр.Исполнитель = Договор.ОтветственныйЗаДоговор; 
			КонецЕсли;
			Если Стр.ОтветственныйЗаУчет 
				И ЗначениеЗаполнено(мОтветственныйЗаУчет) 
				И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(мОтветственныйЗаУчет, "Недействителен") = Ложь Тогда 
				Стр.Исполнитель = мОтветственныйЗаУчет; 
			КонецЕсли;
			// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 30.11.2022
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Договор) = Тип("СправочникСсылка.ВидыПеревозок") Тогда
		
		Для каждого Стр из МассивСостояний Цикл
			
			// Евросиб Фролов (22.02.2022 Task №47363
			Если Стр.ИсполнительКакРуководительПоНаправлению И ВидДокумента = Перечисления.МаршрутизируемыеОбъекты.ЗаявкаКлиента Тогда
				Если ЗначениеЗаполнено(Договор) Тогда
					ОтветственныйОтОРП = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ОтветственныйОтОРП");
					Если ЗначениеЗаполнено(ОтветственныйОтОРП) Тогда
						Стр.Исполнитель = ОтветственныйОтОРП;
					КонецЕсли;	
				КонецЕсли;		
			// Евросиб Фролов)			
			ИначеЕсли Стр.ИсполнительКакРуководительПоНаправлению И ЗначениеЗаполнено(Договор.ОтветственныйПоНаправлению) Тогда 
				Стр.Исполнитель = Договор.ОтветственныйПоНаправлению; 
			КонецЕсли;
			Если Стр.НаблюдательКакРуководительПоНаправлению И ЗначениеЗаполнено(Договор.ОтветственныйПоНаправлению) Тогда 
				Стр.Наблюдатель = Договор.ОтветственныйПоНаправлению; 
			КонецЕсли;
		КонецЦикла;
		
	// Евросиб US 114823 TA 116919 Рыбьяков К.А. 17.08.2025 ((
	ИначеЕсли ТипЗнч(Договор) = Тип("ПеречислениеСсылка.ВнутренниеСтатусыЗапросовНаКТК") Тогда
				
		Для Каждого Стр Из МассивСостояний Цикл
			
			Если Стр.Состояние = ПредопределенноеЗначение("Справочник.Состояния.БронированиеКТК") 
				И Договор = Перечисления.ВнутренниеСтатусыЗапросовНаКТК.НеВзятВРаботу Тогда
				Стр.Исполнитель = Справочники.ГруппыПользователей.ГруппаВыдачиКонтейнеровПоЗапросуВРП;
			ИначеЕсли (Стр.Состояние = ПредопределенноеЗначение("Справочник.Состояния.БронированиеКТК")) 
				И (Стр.Статус = Перечисления.СтатусыЭтапов.НаВыполнение Или Стр.Статус = Перечисления.СтатусыЭтапов.ВРаботе)
				И (Договор = Перечисления.ВнутренниеСтатусыЗапросовНаКТК.Отработан Или Договор = Перечисления.ВнутренниеСтатусыЗапросовНаКТК.ВзятВРаботу) Тогда
				Стр.Исполнитель = Параметры["Редактор"];
			КонецЕсли;
			
			Если Стр.Состояние = ПредопределенноеЗначение("Справочник.Состояния.РелизНаВыдачуКТККлиенту") 
				И Договор = Перечисления.ВнутренниеСтатусыЗапросовНаКТК.НеВзятВРаботу Тогда
				Стр.Исполнитель = Справочники.ГруппыПользователей.ГруппаОформленияРелиза;
			ИначеЕсли (Стр.Состояние = ПредопределенноеЗначение("Справочник.Состояния.РелизНаВыдачуКТККлиенту")) 
				И (Стр.Статус = Перечисления.СтатусыЭтапов.НаВыполнение Или Стр.Статус = Перечисления.СтатусыЭтапов.ВРаботе)
				И (Договор = Перечисления.ВнутренниеСтатусыЗапросовНаКТК.Отработан Или Договор = Перечисления.ВнутренниеСтатусыЗапросовНаКТК.ВзятВРаботу) Тогда
				Стр.Исполнитель = Параметры["Редактор"];
			КонецЕсли;
				
		КонецЦикла;
	// Евросиб Рыбьяков К.А. 17.08.2025 ))
	КонецЕсли;
	
	//Евросиб Каблов 12.08.2022 ( Task 55578
	Для каждого Стр из МассивСостояний Цикл
		
		Если (Стр.РуководительСотрудника Или Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника)
				И ТипЗнч(Стр.Исполнитель) = Тип("СправочникСсылка.Пользователи") И ЗначениеЗаполнено(Стр.Исполнитель) Тогда
				
			НепосредственныйРуководитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Исполнитель, "НепосредственныйРуководитель");
			
			Если ЗначениеЗаполнено(НепосредственныйРуководитель) Тогда
				Если Стр.РуководительСотрудника Тогда
					Стр.Исполнитель = НепосредственныйРуководитель;
				КонецЕсли;
			ИначеЕсли Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника И ЗначениеЗаполнено(Стр.ИсполнительИзМаршрута) Тогда
				Стр.Исполнитель = Стр.ИсполнительИзМаршрута;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Стр.Исполнитель) И ЗначениеЗаполнено(Стр.ИсполнительИзМаршрута) Тогда
			Стр.Исполнитель = Стр.ИсполнительИзМаршрута;
		КонецЕсли;
		
	КонецЦикла;
	//Евросиб Каблов 12.08.2022 )
	
	Возврат неопределено;
	//------------------------
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗамещениеДляДокументов.Ссылка.ИсходныйПользователь КАК ИсходныйПользователь,
	               |	ЗамещениеДляДокументов.Ссылка.Замещение КАК Замещение,
	               |	ЗамещениеДляДокументов.Ссылка.РежимДокумента КАК РежимДокумента
	               |ИЗ
	               |	Документ.Замещение.ДляДокументов КАК ЗамещениеДляДокументов
	               |ГДЕ
	               |	ЗамещениеДляДокументов.ОбъектЪ = &ОбъектЪ
	               |	И &ТекДата МЕЖДУ ЗамещениеДляДокументов.Ссылка.НачалоПериодаЗамещения И ЗамещениеДляДокументов.Ссылка.КонецПериодаЗамещения
	               |	И ЗамещениеДляДокументов.Ссылка.Проведен";
	Запрос.УстановитьПараметр("ОбъектЪ", ВидДокумента);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		Если Ответ.РежимДокумента = 0 Тогда
			
			Для каждого Стр из МассивСостояний Цикл
				Если Стр.Исполнитель = Ответ.ИсходныйПользователь Тогда Стр.Исполнитель = Ответ.Замещение; КонецЕсли;
				Если Стр.Наблюдатель = Ответ.Замещение Тогда Стр.Наблюдатель = Ответ.Замещение; КонецЕсли;
			КонецЦикла;
			
		Иначе
			
			Для Сч = 0 По МассивСостояний.Количество() Цикл
				Если Пользователи_sd_сервер.ГруппаВключаетПользователя(МассивСостояний[Сч].Исполнитель, Ответ.ИсходныйПользователь) Тогда
					МассивСостояний.Вставить(Сч, Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка", Справочники.Состояния.ДелегированноеСогласование, Ответ.Замещение, неопределено, МассивСостояний[сч].Статус, МассивСостояний[сч].Ссылка));
					МассивСостояний[Сч+1].Статус = Перечисления.СтатусыЭтапов.Новый;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Функция ПолучитьТабдокЛистаСогласования(РецензОбъект, ТекущийЦикл = 1) Экспорт
	
	//Евросиб Каблов 22.01.2025 ( #97984
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(РецензОбъект);
	Попытка
		ТабДок = МенеджерОбъекта.ПолучитьТабдокЛистаСогласования(РецензОбъект, ТекущийЦикл);
		Возврат ТабДок;
	Исключение
	КонецПопытки;
	//Евросиб Каблов 22.01.2025 )
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет = ПолучитьОбщийМакет("ЛистСогласованияРеестрРазногласий");
	
	ШифрСеанса = Строка(Новый УникальныйИдентификатор);
	ИмяДокумента = Строка(РецензОбъект);
	//Евросиб Коханенко Н.А. 23.01.2024 (( #79633
	ИмяДокументаЛС = ИмяДокумента;
	ИмяДокументаЛР = ИмяДокумента;
	Если ТипЗнч(РецензОбъект) = Тип("ДокументСсылка.ПСЦ") Тогда
		ДанныеПСЦ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РецензОбъект, "ВидПСЦ, НомерПСЦ, КлиентскийНомер, Контрагент, Номер, ДатаПСЦ");
		Префикс = ?(ЗначениеЗаполнено(ДанныеПСЦ.ВидПСЦ), Строка(ДанныеПСЦ.ВидПСЦ) + ": ", "ПК: ");
		НомерПСЦСтрока = ?(ЗначениеЗаполнено(ДанныеПСЦ.НомерПСЦ), Символы.ПС+Строка(ДанныеПСЦ.НомерПСЦ), "");
		КлиентскийНомерСтрока = ?(ЗначениеЗаполнено(ДанныеПСЦ.КлиентскийНомер), Символы.ПС+Строка(ДанныеПСЦ.КлиентскийНомер), "");
		Если НомерПСЦСтрока = КлиентскийНомерСтрока Тогда
			КлиентскийНомерСтрока = "";
		КонецЕсли;
		ИмяДокументаЛС = Префикс + ДанныеПСЦ.Контрагент + " №" + ДанныеПСЦ.Номер
						+ " от " + Формат(ДанныеПСЦ.ДатаПСЦ, "ДФ=dd.MM.yy") + НомерПСЦСтрока + КлиентскийНомерСтрока;
	КонецЕсли;
	//Евросиб Коханенко Н.А. 23.01.2024 )) #79633 
	ДатаПечати = ТекущаяДата();
	
	ШапкаЛС = Макет.ПолучитьОбласть("ШапкаЛС");
	//Евросиб Коханенко Н.А. 23.01.2024 (( #79633
	//ШапкаЛС.Параметры.ИмяДокумента = ИмяДокумента;
	ШапкаЛС.Параметры.ИмяДокумента = ИмяДокументаЛС;
	//Евросиб Коханенко Н.А. 23.01.2024 (( #79633
	ШапкаЛС.Параметры.ДатаПечати = Формат(ДатаПечати, "ДФ='ЧЧ:мм дд.ММ.гг'");
	ШапкаЛС.Параметры.шифр = ШифрСеанса;
	ТабДок.Вывести(ШапкаЛС);
	
	СчЭлементов = 0;
	
	ИмяМетаданных = РецензОбъект.Метаданные().Имя;
	ИмяКорняМД = ?(ИмяМетаданных = "ДоговорыКонтрагентов", "Справочник", "Документ");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", РецензОбъект);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентовСостояния.Состояние КАК Состояние,
	               |	ДоговорыКонтрагентовСостояния.Исполнитель КАК Исполнитель,
	               |	ДоговорыКонтрагентовСостояния.СтатусСогласования КАК СтатусСогласования,
	               |	ДоговорыКонтрагентовСостояния.НачалоРаботы КАК НачалоРаботы,
	               |	ДоговорыКонтрагентовСостояния.ЗавершениеРаботы КАК ЗавершениеРаботы,
	               |	ДоговорыКонтрагентовСостояния.ПричинаОтказа КАК ПричинаОтказа
	               |ИЗ
	               |	"+ИмяКорняМД+"."+ИмяМетаданных+".Состояния КАК ДоговорыКонтрагентовСостояния
	               |ГДЕ
	               |	ДоговорыКонтрагентовСостояния.Ссылка = &Ссылка
	               |	И ДоговорыКонтрагентовСостояния.Состояние.Согласование";
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		СчЭлементов = СчЭлементов + 1;
		НСтр = Макет.ПолучитьОбласть("СтрокаЛС");
		НСтр.Параметры.Дата = Формат(Ответ.ЗавершениеРаботы, "ДФ='ЧЧ:мм дд.ММ.гг'");
		НСтр.Параметры.Этап = Ответ.Состояние;
		НСтр.Параметры.Согласующий = Ответ.Исполнитель;
		НСтр.Параметры.Результат = Ответ.СтатусСогласования;
		НСтр.Параметры.ПричинаОтказа = Ответ.ПричинаОтказа;
		ТабДок.Вывести(НСтр);
	КонецЦикла;
	
	ПодвалЛС = Макет.ПолучитьОбласть("ПодвалЛС");
	ПодвалЛС.Параметры.КоличествоСтрок = СчЭлементов;
	ТабДок.Вывести(ПодвалЛС);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Рецензирование.РецензОбъект КАК РецензОбъект,
	               |	Рецензирование.Рецензент КАК Рецензент,
	               |	Рецензирование.ТаймШтамп КАК ТаймШтамп,
	               |	Рецензирование.ИсходныйТекст КАК ИсходныйТекст,
	               |	Рецензирование.НоваяРедакция КАК НоваяРедакция,
	               |	Рецензирование.Комментарии КАК Комментарии,
	               |	Рецензирование.ОтветИнициатора КАК ОтветИнициатора
	               |ИЗ
	               |	РегистрСведений.Рецензирование КАК Рецензирование
	               |ГДЕ
	               |	(Рецензирование.РецензОбъект В
	               |				(ВЫБРАТЬ
	               |					СведенияОФайлах.Файл КАК Файл
	               |				ИЗ
	               |					РегистрСведений.СведенияОФайлах КАК СведенияОФайлах
	               |				ГДЕ
	               |					СведенияОФайлах.ВладелецФайла = &ВладелецФайла
	               |					И НЕ СведенияОФайлах.ПометкаУдаления
	               |					И НЕ СведенияОФайлах.Служебный)
	               |			ИЛИ Рецензирование.РецензОбъект = &ВладелецФайла)
	               |	И Рецензирование.ЦиклСогласования = &ЦиклСогласования
	               |ИТОГИ ПО
	               |	РецензОбъект";
	Запрос.УстановитьПараметр("ВладелецФайла", РецензОбъект);
	Запрос.УстановитьПараметр("ЦиклСогласования", ТекущийЦикл);
	Ответ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Ответ.Следующий() Цикл
		// уровень группировки
		
		ШапкаЛР = Макет.ПолучитьОбласть("ШапкаЛР");
		//Евросиб Коханенко Н.А. 23.01.2024 (( #79633
		//ШапкаЛР.Параметры.ИмяДокумента = ИмяДокумента;
		ШапкаЛР.Параметры.ИмяДокумента = ИмяДокументаЛР;
		//Евросиб Коханенко Н.А. 23.01.2024 (( #79633
		ШапкаЛР.Параметры.ИмяФайла = Ответ.РецензОбъект;
		ШапкаЛР.Параметры.шифр = ШифрСеанса;
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		Табдок.Вывести(ШапкаЛР);
		СчЭлементов = 0;
		
		ПодОтвет = Ответ.Выбрать();
		Пока ПодОтвет.Следующий() Цикл
			
			СчЭлементов = СчЭлементов + 1;
			НСтр = Макет.ПолучитьОбласть("СтрокаЛР");
			НСтр.Параметры.Дата = Формат(ПодОтвет.ТаймШтамп, "ДФ='ЧЧ:мм дд.ММ.гг'");
			НСтр.Параметры.Согласующий = ПодОтвет.Рецензент;
			НСтр.Параметры.Исх = ПодОтвет.ИсходныйТекст;
			НСтр.Параметры.Нов = ПодОтвет.НоваяРедакция;
			НСтр.Параметры.Комментарий = ПодОтвет.Комментарии;
			НСтр.Параметры.ОтветИнииатора = ПодОтвет.ОтветИнициатора;
			ТабДок.Вывести(НСтр);
			
		КонецЦикла;
		
		ПодвалЛР = Макет.ПолучитьОбласть("ПодвалЛР");
		ПодвалЛР.Параметры.КоличествоСтрок = СчЭлементов;
		ТабДок.Вывести(ПодвалЛР);
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

Процедура МаршрутизацияВРегистрБезРегистратораПриЗаписи(Источник, Отказ) Экспорт
	
	НЗ = РегистрыСведений.ЗадачиСотрудника.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить(Источник.Ссылка);
//Евросиб Гудкова( 19.11.2019
	НЗ.Прочитать();
	НачальноеКоличество = НЗ.Количество();
	НЗ.Очистить();
//Евросиб Гудкова)	

ИсточникПроведен = Истина;
ТипСтрокой = Строка(ТипЗнч(Источник));
Если Найти(ТипСтрокой, "Справочник") = 0 Тогда
	ИсточникПроведен = Источник.Проведен;
КонецЕсли;

	ТипИсточника = ТипЗнч(Источник);

	Для каждого Стр из Источник.Состояния Цикл
		
		Если НЕ Источник.ПометкаУдаления И ИсточникПроведен И ЗначениеЗаполнено(Стр.Исполнитель) Тогда
			
			Попытка
				ДатаНачалаРаботы = ?(ТипИсточника = Тип("СправочникОбъект.ДоговорыКонтрагентов"), ТекущаяДата(), Источник.Дата);//Евросиб Гудкова 19.11.2019 было Источник.Дата
			Исключение
				ДатаНачалаРаботы = ТекущаяДата();
			КонецПопытки;
			
			НСтр = НЗ.Добавить();
			НСтр.Документ = Источник.Ссылка;
			НСтр.Наблюдатель = Стр.Наблюдатель;
			НСтр.Статус = Стр.Статус;
			Если ЗначениеЗаполнено(Стр.Состояние) Тогда
				НСтр.Состояние = Стр.Состояние;
			Иначе
				НСтр.Состояние = Справочники.Состояния.Выполнение;
			КонецЕсли;
			НСТр.НачалоРаботыПлан = ДатаНачалаРаботы;
			//ДИТ Авдеева В.С. 37052 12.05.2022 Начало  
			Если ТипИсточника = Тип("ДокументОбъект.Сделка") 
				И НСтр.Состояние.Родитель = Справочники.Состояния.ЗадачиДелегирования
				//Евросиб Каблов 25.07.2022 ( Ticket#0239076
				Или НСтр.Состояние = Справочники.Состояния.ИзмененСчетПроверитьСоответствиеИнформацииВСделке
				Или НСтр.Состояние.Родитель = Справочники.Состояния.ЗадачиОтработатьИзменениеСчетаОтменитьРТУ
				Или НСтр.Состояние.Родитель = Справочники.Состояния.ЗадачиОтработатьИзменениеСчетаСоздатьСЗнаИзменениеДокументов
				//Евросиб Каблов 25.07.2022 )
				Тогда
				НСТр.НачалоРаботыПлан = Стр.НачалоРаботы;
			КонецЕсли;
			//ДИТ Авдеева В.С. 37052 12.05.2022 Конец
			НСтр.НачалоРаботыФакт = Стр.НачалоРаботы;
			НСтр.ОкончаниеРаботыФакт = Стр.ЗавершениеРаботы;
			НСтр.Ответственный = Стр.Исполнитель;
			НСтр.Период = ДатаНачалаРаботы;
			НСтр.ТипЗадачи = Перечисления.ТипыЗадачСотрудников.ОбработкаДокумента;  
			
			//ДИТ Авдеева В.С. 37052 12.05.2022 Начало
			Попытка
				Комментарий = Стр.Комментарий;
			Исключение
				Комментарий = "";
			КонецПопытки;

			НСтр.Комментарий = Комментарий;
			//ДИТ Авдеева В.С. 37052 12.05.2022 Конец
			
		КонецЕсли;
	КонецЦикла;
	
 	Если НЗ.Количество() > 0 Или НачальноеКоличество > 0 Тогда
		НЗ.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура РегистрацияСостоянийДокументаПриЗаписи(Источник, Отказ, СпециальныйРежимОднойОперации = Ложь) Экспорт
	
	ТребуетсяВозврат = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	Если Источник.Метаданные().ТабличныеЧасти.Найти("Состояния") = неопределено Тогда ТребуетсяВозврат = Истина; КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	Если ТребуетсяВозврат Тогда Возврат; КонецЕсли;
	
	ИсточникПроведен = Истина;
	ТипСтрокой = Строка(ТипЗнч(Источник));
	Если Найти(ТипСтрокой, "Справочник") = 0 Тогда
		ИсточникПроведен = Источник.Проведен;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	*
	//               |ИЗ
	//               |	РегистрСведений.УведомленияПользователейОЗадачах КАК УведомленияПользователейОЗадачах
	//               |ГДЕ
	//               |	УведомленияПользователейОЗадачах.Документ = &Документ
	//               |	И УведомленияПользователейОЗадачах.Пользователь = &Пользователь
	//               |	И УведомленияПользователейОЗадачах.Состояние = &Состояние
	//               |	И НЕ УведомленияПользователейОЗадачах.УведомлениеОЗадаче";
	Запрос.Текст = "ВЫБРАТЬ
	               |	УведомленияПользователейОЗадачах.Состояние КАК Состояние,
	               |	УведомленияПользователейОЗадачах.Документ КАК Документ,
	               |	УведомленияПользователейОЗадачах.Пользователь КАК Пользователь,
	               |	УведомленияПользователейОЗадачах.УведомлениеОЗадаче КАК УведомлениеОЗадаче
	               |ИЗ
	               |	РегистрСведений.УведомленияПользователейОЗадачах КАК УведомленияПользователейОЗадачах
	               |ГДЕ
	               |	УведомленияПользователейОЗадачах.Документ = &Документ";
	Запрос.УстановитьПараметр("Документ", Источник.Ссылка);
	
	СтруктураСохраняемыхСостояний = Новый Массив;
	
	Ответ = запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		Если Ответ.УведомлениеОЗадаче = Ложь Тогда
			МЗ = РегистрыСведений.УведомленияПользователейОЗадачах.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ, Ответ);
			МЗ.Удалить();
		Иначе
			СтруктураСохраняемыхСостояний.Добавить(Новый Структура("Состояние, Пользователь", Ответ.Состояние, Ответ.Пользователь));
		КонецЕсли;
	КонецЦикла;
	
	Если Источник.ПометкаУдаления ИЛИ НЕ ИсточникПроведен Тогда
		
		МЗ = РегистрыСведений.УведомленияПользователейОЗадачах.СоздатьНаборЗаписей();
		МЗ.Отбор.Документ.Установить(Источник.Ссылка);
		МЗ.Записать(Истина);
		
	Иначе
		
		Для каждого Стр из Источник.Состояния Цикл
			
			Если Не ЗначениеЗаполнено(Стр.Исполнитель) 
					Или Строка(Стр.Исполнитель) = "<Не указан>" 
					ИЛИ НЕ (Стр.Статус = Перечисления.СтатусыЭтапов.ВРаботе ИЛИ Стр.Статус = Перечисления.СтатусыЭтапов.НаВыполнение) 
				Тогда 
					Продолжить;
			КонецЕсли;
			
			НайдСтрока = Ложь;
			Для каждого Стр88 из СтруктураСохраняемыхСостояний цикл
				Если стр88.Состояние = Стр.Состояние И Стр88.Пользователь = Стр.Исполнитель Тогда НайдСтрока = истина; КонецЕсли;
			КонецЦикла;
			Если НайдСтрока = Истина Тогда Продолжить; КонецЕсли;
			
			МЗ = РегистрыСведений.УведомленияПользователейОЗадачах.СоздатьМенеджерЗаписи();
			МЗ.Документ = Источник.Ссылка;
			МЗ.Пользователь = Стр.Исполнитель;
			МЗ.Состояние = Стр.Состояние;
			МЗ.Период = ТекущаяДата();
			МЗ.Записать(Истина);
			
		КонецЦикла;
	КонецЕсли;
	Если СпециальныйРежимОднойОперации = Истина Тогда Возврат; КонецЕсли;
	
	// - Иван
	
	
	НЗ = РегистрыСведений.СостоянияДокументов.СоздатьНаборЗаписей();
	НЗ.Отбор.ДокументРегистратор.Установить(Источник.ссылка);
	
	Для каждого Стр из Источник.Состояния Цикл
		
		Если Источник.ПометкаУдаления ИЛИ НЕ ИсточникПроведен ИЛИ Строка(Стр.Исполнитель) = "<Не указан>" Тогда Продолжить; КонецЕсли;
		
		НСтр = НЗ.Добавить();
		НСтр.ДокументРегистратор = Источник.ссылка;
		НСтр.ЗавершениеРаботы = Стр.ЗавершениеРаботы;
		НСтр.Исполнитель = Стр.Исполнитель;
		НСтр.Наблюдатель = Стр.Наблюдатель;
		НСтр.НачалоРаботы = Стр.НачалоРаботы;
		НСтр.Период = Текущаядата();
		НСтр.Регистратор = Источник.ссылка;
		НСтр.Состояние = Стр.Состояние;
		НСтр.Статус = Стр.Статус;
		
		Если ТипЗнч(Источник) = Тип("ДокументОбъект.Операция") Тогда
			
			ДатаНачалаВ = ?(ЗначениеЗаполнено(Источник.ДатаОтправленияФакт), Источник.ДатаОтправленияФакт, Источник.ДатаОтправления);
			ДатаОкончанияВ = ?(ЗначениеЗаполнено(Источник.ДатаНазначенияФакт), Источник.ДатаНазначенияФакт, Источник.ДатаНазначения);
			
			Если ЗначениеЗаполнено(ДатаНачалаВ) Тогда НСтр.НачалоРаботы = ДатаНачалаВ; КонецЕсли;
			Если ЗначениеЗаполнено(ДатаОкончанияВ) Тогда НСтр.ЗавершениеРаботы = ДатаОкончанияВ; КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	НЗ.Записать(Истина);

КонецПроцедуры

//Процедура ОбновитьПанельТекущегоПользователя(Объект, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель) Экспорт
//ДИТ, Беляев СЮ, US 37052, 23-08-2022, добавлен параметр ТекущийИсполнитель_Примечание
Процедура ОбновитьПанельТекущегоПользователя(Объект, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель, ТекущийИсполнитель_Примечание = "") Экспорт
	
	ТекП = Пользователи.ТекущийПользователь();
	ТекЗамещающий = Пользователи_sd_сервер.ПодобратьЗамещениеОбратное(ТекП, ТекущаяДата());
	МоиГруппы = Пользователи_sd_сервер.ПолучитьСписокМоихГрупп(ТекП, ТекЗамещающий);
	// ДИТ Поморцева Т.П. Задача 238786 16.08.21. начало
	//МоиГруппы.Добавить(ТекП);
	//МоиГруппы.Добавить(ТекЗамещающий);
	Для Каждого Элемент ИЗ ТекЗамещающий Цикл
		МоиГруппы.Добавить(Элемент);
	КонецЦикла;	
	// ДИТ Поморцева Т.П. Задача 238786 16.08.21. конец
	
	МассивСтатусовДляОтработки = Новый Массив;
	МассивСтатусовДляОтработки.Добавить(Перечисления.СтатусыЭтапов.НаВыполнение);
	МассивСтатусовДляОтработки.Добавить(Перечисления.СтатусыЭтапов.ВРаботе);	
	Для каждого Стр из Объект.Состояния Цикл
		Если МоиГруппы.Найти(Стр.Исполнитель) <> неопределено И МассивСтатусовДляОтработки.Найти(Стр.Статус) <> неопределено Тогда
			ТекущийИсполнитель_Статус = Стр.Статус;
			ТекущийИсполнитель_Состояние = Стр.Состояние;
			ТекущийИсполнитель_Исполнитель = Стр.Исполнитель;
			ТекущийИсполнитель_Наблюдатель = Стр.Наблюдатель;
			//ДИТ, Беляев СЮ, US 37052, 23-08-2022, начало
			// ДИТ 64186 Давудов М.А. Начало: 07.03.2023
			РодительскийСтатус =  Справочники.Состояния.ЗадачиГотовностьКомплектаПодтверждающихДокументов;
			Если Стр.ПредыдущиеЭтапы = "999"
			   И ЗначениеЗаполнено(Стр.Состояние)
			   И Стр.Состояние.ПринадлежитЭлементу(РодительскийСтатус) Тогда
				ТекущийИсполнитель_Примечание = "";
			Иначе
			// ДИТ 64186 Давудов М.А. Конец: 07.03.2023
			ТекущийИсполнитель_Примечание = СокрЛП(Стр.Комментарий);
			// ДИТ 64186 Давудов М.А. Начало: 07.03.2023
			КонецЕсли;
			// ДИТ 64186 Давудов М.А. Конец: 07.03.2023
			//ДИТ, Беляев СЮ, US 37052, 23-08-2022, конец
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//Евросиб Гудкова( 19.11.2019 
Процедура ОбновитьПанельСостояний(УФ) Экспорт
	
	ШаблонНадписи = Константы.ШаблонОтображенияИсполнителейНаПанелиСостояний.Получить();
	// [Состояние]
	// [Исполнитель]
	// [Enter]
	// [Список_фамилий]
	ШаблонНадписи = СтрЗаменить(ШаблонНадписи, "[Enter]", Символы.ПС);
	
	Элементы = УФ.Элементы;
	
	МассивУдаляемых = Новый Массив;
	Для каждого Стр из Элементы.ГруппаПрогрессСостояний.ПодчиненныеЭлементы Цикл
		МассивУдаляемых.Добавить(Стр);
	КонецЦикла;
	Для каждого Стр из МассивУдаляемых Цикл
		Элементы.Удалить(Стр);
	КонецЦикла;
	
	РамкаЪ = Новый Рамка(ТипРамкиЭлементаУправления.Скругленная, 2);
	РамкаПроцессная = Новый Рамка(ТипРамкиЭлементаУправления.Одинарная, 2);
	
	МассивКрасныхСостояний = Новый Массив;
	МассивКрасныхСостояний.Добавить(Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний);
	МассивКрасныхСостояний.Добавить(Перечисления.СтатусыСогласования.ОтклоненоСЗамечаниями);
	МассивКрасныхСостояний.Добавить(Перечисления.СтатусыСогласования.СогласованоСЗамечаниями);
	МассивСинихСостояний = Новый Массив;
	МассивСинихСостояний.Добавить(Перечисления.СтатусыСогласования.СогласованСКомментариями);
	
	Для каждого Стр из УФ.Объект.Состояния Цикл
		НЭ = Элементы.Добавить("Н"+СтрЗаменить(Новый УникальныйИдентификатор(), "-", ""), Тип("ДекорацияФормы"), Элементы.ГруппаПрогрессСостояний);
		НЭ.Гиперссылка = Истина;		
		
		НЭ.УстановитьДействие("Нажатие", "ОбработчикНажатияПлитокСостояния");
		НЭ.ЦветТекста = WebЦвета.Черный;
		
		// ДИТ 64186 Давудов М.А. Начало: 07.03.2023
		РодительскийСтатус =  Справочники.Состояния.ЗадачиГотовностьКомплектаПодтверждающихДокументов;
		Если Стр.ПредыдущиеЭтапы = "999"
		   И ЗначениеЗаполнено(Стр.Состояние)
		   И Стр.Состояние.ПринадлежитЭлементу(РодительскийСтатус) Тогда
			СтрТекШаблон = ШаблонНадписи;
			ТекстСостояния = Строка(Стр.Состояние) + " для КА """ + Строка(Стр.Клиент) + """";
			СтрТекШаблон = СтрЗаменить(СтрТекШаблон, "[Состояние]", ТекстСостояния);
			СтрТекШаблон = СтрЗаменить(СтрТекШаблон, "[Исполнитель]", Стр.Исполнитель);
		//Евросиб Шевченко А.В. US 95275 TA 106445 04.09.2025 
		ИначеЕсли Стр.Состояние = Справочники.Состояния.СозданиеСЗНаКорректировкуРТУПоСНП Тогда 
			СтрТекШаблон = ШаблонНадписи;
			СтрТекШаблон =	СтрЗаменить(СтрТекШаблон, "[Состояние]", Строка(Стр.Состояние) + " ("+УФ.Объект.НомерКТК+", расчет № " + УФ.Объект.Номер + " - корректировочный)");	
		//Евросиб Шевченко А.В. US 95275 TA 106445 04.09.2025
		Иначе
		// ДИТ 64186 Давудов М.А. Конец: 07.03.2023
		СтрТекШаблон = ШаблонНадписи;
		СтрТекШаблон = СтрЗаменить(СтрТекШаблон, "[Состояние]", Стр.Состояние);
		СтрТекШаблон = СтрЗаменить(СтрТекШаблон, "[Исполнитель]", Стр.Исполнитель);
		// ДИТ 64186 Давудов М.А. Начало: 07.03.2023
		КонецЕсли;
		// ДИТ 64186 Давудов М.А. Конец: 07.03.2023
		//ДИТ Шевченко А.В. 52889 10.03.2023 -начало
		МассивСтатусовДляОтработки = Новый Массив;
		МассивСтатусовДляОтработки.Добавить(Перечисления.СтатусыЭтапов.НаВыполнение);
		МассивСтатусовДляОтработки.Добавить(Перечисления.СтатусыЭтапов.ВРаботе);
		//ДИТ Шевченко А.В. 52889 10.03.2023 -конец
		РезСтрокаИсп = "";
		Если ТипЗнч(Стр.Исполнитель) = Тип("СправочникСсылка.Пользователи") Тогда
			//РезСтрокаИсп = Пользователи_sd_сервер.ПодобратьЗамещение(Стр.Исполнитель, Стр.НачалоРаботы);
			//ДИТ, Беляев СЮ, Ticket#0262619, 04-03-2022, ++
			//ДИТ Шевченко А.В. 52889 10.03.2023 -начало
			Если МассивСтатусовДляОтработки.Найти(Стр.Статус) <> неопределено Тогда
				РезСтрокаИсп = Пользователи_sd_сервер.ПодобратьЗамещение(Стр.Исполнитель, ТекущаяДата());
			Иначе
				РезСтрокаИсп = Стр.Исполнитель;
			КонецЕсли;
			//ДИТ Шевченко А.В. 52889 10.03.2023 -конец
			//ДИТ, Беляев СЮ, Ticket#0262619, 04-03-2022, --
		Иначе
			//МассивИсп = Пользователи_sd_сервер.ПолучитьПользователейГруппы(Стр.Исполнитель, Стр.НачалоРаботы, Истина);
			//ДИТ, Беляев СЮ, Ticket#0262619, 04-03-2022, ++
			МассивИсп = Пользователи_sd_сервер.ПолучитьПользователейГруппы(Стр.Исполнитель, ТекущаяДата(), Истина);  
			//ДИТ, Беляев СЮ, Ticket#0262619, 04-03-2022, --
			РезСтрокаИсп = СтрСоединить(МассивИсп, ", ");
		КонецЕсли;
		
		СтрТекШаблон = СтрЗаменить(СтрТекШаблон, "[Список_фамилий]", РезСтрокаИсп);
		НЭ.Заголовок = СтрТекШаблон;
		
		//НЭ.Заголовок = "" + Стр.Состояние + Символы.ПС + "("+Стр.Исполнитель+")";
		
		НЭ.РастягиватьПоГоризонтали = Истина;
		Если Стр.Состояние.Процессное Тогда
			НЭ.ЦветРамки = ЦветаСтиля.ЦветПроцесснойРамки;
			НЭ.Рамка = РамкаПроцессная;
		Иначе
			НЭ.ЦветРамки = ЦветаСтиля.ЦветНепроцесснойРамки;
			НЭ.Рамка = РамкаЪ;
		КонецЕсли;
		НЭ.Высота = 2;
		НЭ.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
		
		Если Стр.Статус = Перечисления.СтатусыЭтапов.ВРаботе Или Стр.Статус = Перечисления.СтатусыЭтапов.НаВыполнение Тогда
			НЭ.ЦветФона = ЦветаСтиля.ФонТекущегоСостояния;
		ИначеЕсли Стр.Статус = Перечисления.СтатусыЭтапов.Выполнен Тогда
			НЭ.ЦветФона = ЦветаСтиля.ФонВыполненногоСостояния;
//Евросиб Гудкова( 21.11.2019 
		ИначеЕсли Стр.Статус = Перечисления.СтатусыЭтапов.Отклонен Тогда
			НЭ.ЦветФона = ЦветаСтиля.СобытиеОтказ;
// Евросиб Гудкова) 			
		Иначе
			НЭ.ЦветФона = ЦветаСтиля.ФонБудущегоСостояния;
		КонецЕсли;
		
		Если МассивКрасныхСостояний.Найти(Стр.СтатусСогласования) <> неопределено Тогда
			НЭ.ЦветФона = ЦветаСтиля.ФонСостоянияСЗамечаниями;
		ИначеЕсли МассивСинихСостояний.Найти(Стр.СтатусСогласования) <> неопределено Тогда
			НЭ.ЦветФона = ЦветаСтиля.ФонСостоянияСКомментариями;
		КонецЕсли;
		
		// отработка по статусу В работе
		Если Стр.Статус = Перечисления.СтатусыЭтапов.ВРаботе И НЕ ЗначениеЗаполнено(Стр.НачалоРаботы) Тогда
			Стр.НачалоРаботы = ТекущаяДата();
		КонецЕсли;
		Если (Стр.Статус = Перечисления.СтатусыЭтапов.Выполнен ИЛИ Стр.Статус = Перечисления.СтатусыЭтапов.Отклонен) Тогда
			Если НЕ ЗначениеЗаполнено(Стр.НачалоРаботы) Тогда
				Стр.НачалоРаботы = ТекущаяДата();
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Стр.ЗавершениеРаботы) Тогда
				Стр.ЗавершениеРаботы = ТекущаяДата();
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры
// Евросиб Гудкова) 

Процедура ОтметитьВыполнениеРодительскогоДокументаАвтоматически(МассивРодителей, МассивСостояний, Отказ) Экспорт
	
//Евросиб Гудкова( 10.03.2020 Ticket№ 0188794
	Если МассивСостояний.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
// Евросиб Гудкова)
//Евросиб Каблов 08.01.2020 ( Ticket#0218942
	УстановитьПривилегированныйРежим(Истина);
//Евросиб Каблов 08.01.2020 )
	Для каждого Док из МассивРодителей Цикл
//Евросиб Гудкова( 10.03.2020 Ticket№ 0188794
	НужнаЗапись = Ложь;
// Евросиб Гудкова) 	

// (Евросиб Максимова #0210942
МассивСостоянийНЕВыполнен=Новый Массив;
// Евросиб Максимова #0210942)

		// чтобы не получать объект для всех родительских документов каждый раз, когда перезаписывается дочерний докумет
		Для каждого СтрСостояние из Док.Состояния Цикл
			// (Евросиб Максимова #0210942
			Если СтрСостояние.Статус<>Перечисления.СтатусыЭтапов.Выполнен
				и НЕ СтрСостояние.Состояние.Согласование Тогда
				МассивСостоянийНеВыполнен.Добавить(СтрСостояние);
			КонецЕсли;
			// Евросиб Максимова #0210942)
			Для каждого ПередСостояние из МассивСостояний Цикл
				Если СтрСостояние.Состояние = ПередСостояние.Состояние И
					НЕ СтрСостояние.Статус = ПередСостояние.Статус 
					И Не СтрСостояние.Статус = Перечисления.СтатусыЭтапов.Выполнен Тогда ////Евросиб Гудкова( 11.09.2020 Ticket№ 0206577
					// получаем объект, ищем в нем состояние (т.к. они уникальны)
					
					ДокОбъект = Док.ПолучитьОбъект();
					ПараметрыОтбора = Новый Структура;
					// (Евросиб Максимова #0210942
					Если ТипЗнч(ДокОбъект)=Тип("ДокументОбъект.Калькуляция") Тогда
						Для каждого Стр из МассивСостоянийНЕВыполнен Цикл
							ПараметрыОтбора.Вставить("Состояние",Стр.Состояние);
							НайденноеСост = ДокОбъект.Состояния.НайтиСтроки(ПараметрыОтбора);					
							НайденноеСост[0].Статус=ПередСостояние.Статус;
						КонецЦикла;
					Иначе	
					//Евросиб Максимова #0210942)
					ПараметрыОтбора.Вставить("Состояние",СтрСостояние.Состояние);
					НайденноеСост = ДокОбъект.Состояния.НайтиСтроки(ПараметрыОтбора);
					// (Евросиб Максимова #0210942					
				    КонецЕсли;
					//Евросиб Максимова #0210942)
					
					Если НайденноеСост.Количество()>0 Тогда
						НайденноеСост[0].Статус = ПередСостояние.Статус;
						Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.Калькуляция") Тогда
							ДокОбъект.ИгнорироватьПроверкуНаПрава = Истина;
						КонецЕсли;
						Попытка
							ДокОбъект.Записать(?(ДокОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
						Исключение
							ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки(),,,, Отказ);
						КонецПопытки;
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;


		//ДокОбъект = Док.ПолучитьОбъект();
		//Для каждого СтрСостояние из ДокОбъект.Состояния Цикл
		//	Для каждого ПередСостояние из МассивСостояний Цикл
		//		Если СтрСостояние.Состояние = ПередСостояние.Состояние Тогда
		//			СтрСостояние.Статус = ПередСостояние.Статус;
		//			НужнаЗапись = Истина; //Гудкова
		//			Прервать;
		//		КонецЕсли;
		//	КонецЦикла;
		//КонецЦикла;
////Евросиб Гудкова( 10.03.2020 Ticket№ 0188794
//		Если НужнаЗапись Тогда
////		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
//// Евросиб Гудкова) 	
//			Попытка
//				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
//			Исключение
//				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки(),,,, Отказ);
//			КонецПопытки;
//		КонецЕсли; // Евросиб Гудкова) 	
		
	КонецЦикла;
//Евросиб Каблов 08.01.2020 ( Ticket#0218942
	УстановитьПривилегированныйРежим(Ложь);
//Евросиб Каблов 08.01.2020 )
	
КонецПроцедуры

Функция НайтиПолучитьМассивСостоянийДляОтметки(ТабСостояния) Экспорт
	
	МассивСостояний = Новый Массив;
	
	Для каждого Стр из ТабСостояния Цикл
		Если Стр.Состояние.ОтмечатьВыполнениеВРодительскомДокументеАвтоматически Тогда
			МассивСостояний.Добавить(Новый Структура("Состояние, Статус", Стр.Состояние, Стр.Статус));
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивСостояний;
	
КонецФункции

//Евросиб Гудкова( 08.01.2020 
Функция МаршрутизироватьТД(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка, 
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	Маршрутизация.Договор КАК Договор, 
				   //|	Маршрутизация.Контрагент КАК Контрагент,
				   //Стало:
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор,
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	Маршрутизация.Организация КАК Организация
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация 
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.КонтрагентыИДоговоры КАК МаршрутизацияКонтрагентыИДоговоры
				   |		ПО (Маршрутизация.Ссылка = МаршрутизацияКонтрагентыИДоговоры.Ссылка)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.ТранспортныйДокумент)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.КонтрагентПустой
				   //|				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Контрагент = &Контрагент
				   //|					ИЛИ Маршрутизация.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|		КОНЕЦ
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.ДоговорПустой
				   //|				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Договор = &Договор
				   //|					ИЛИ Маршрутизация.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|		КОНЕЦ
				   //Стало:
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.КонтрагентПустой
				   |				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = &Контрагент
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |		КОНЕЦ
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.ДоговорПустой
				   |				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = &Договор
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |		КОНЕЦ
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ОрганизацияПустая
	               |				ТОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.Организация = &Организация
	               |					ИЛИ Маршрутизация.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("Контрагент", ПараметрыЗапроса["Контрагент"]);
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса["Организация"]);
	Запрос.УстановитьПараметр("Договор", ПараметрыЗапроса["Договор"]);
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		Если ЗначениеЗаполнено(Ответ["Контрагент"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Организация"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Договор"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.ПоступлениеТоваровУслуг, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	Возврат РезультатЗапроса;
	
КонецФункции

// Евросиб Гудкова)

Функция РасчетНормативаИсполнения(ВидНорматива, ОбъектРасчета, ДатаНачала, Источник) ЭКСПОРТ
	
	//СтруктураОтвета = Новый СТруктура;
	//ВременноеИзмерение = "ЧАС";
	//ДатаОкончания = ТекущаяДата();
	Длительность = 0;
	
	Если ВидНорматива = Перечисления.ВидыНормативовИспользования.ПервыйРДмесяцаПослеОкончанияПеревозки Тогда
		// данное правило для сделки. анализируем ЖД рейсы. Если их несколько, берем самую
		// позднюю дату по прибытию
		
		// получить данные по производственному календарю
		ПрКалендарь = ПостроительТСх_сервер.ПодобратьПроизводственныйКалендарь(Справочники.Контрагенты.ПустаяСсылка(), Справочники.Номенклатура.ПустаяСсылка());
		
		//КолвоПервых = "ПЕРВЫЕ " + КолвоДней;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь,
		               |	ВЫБОР
		               |		КОГДА ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
		               |				ИЛИ ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный)
		               |			ТОГДА 1
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК РабочийДень,
		               |	ДанныеПроизводственногоКалендаря.Дата КАК Дата
		               |ПОМЕСТИТЬ Вт1
		               |ИЗ
		               |	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
		               |ГДЕ
		               |	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
		               |	И ДанныеПроизводственногоКалендаря.Дата > &ДатаНач
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Вт1.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь,
		               |	Вт1.РабочийДень КАК РабочийДень,
		               |	Вт1.Дата КАК Дата
		               |ИЗ
		               |	Вт1 КАК Вт1
		               |ГДЕ
		               |	Вт1.РабочийДень <> 0
					   |УПОРЯДОЧИТЬ ПО
					   |	Дата";
		Запрос.УстановитьПараметр("ПроизводственныйКалендарь",ПрКалендарь);
		Запрос.УстановитьПараметр("ДатаНач",КонецМесяца(ДатаНачала));

		ТЗ = Запрос.Выполнить().Выгрузить();
		Если ТЗ.Количество()>0 Тогда
			ДатаОкончания = ТЗ[0].Дата;
			// в длительность записываем кол-во дней от окончания перевозки до момента "ПервыйРДмесяцаПослеОкончанияПеревозки"
			Длительность = (ДатаОкончания - ДатаНачала)/3600;
		КонецЕсли;
		
	КонецЕсли;
	
	//СтруктураОтвета.Вставить("ВременноеИзмерение",ВременноеИзмерение);
	//СтруктураОтвета.Вставить("Длительность",Длительность);
	//СтруктураОтвета.Вставить("ДатаНачала",ДатаНачала);
	//СтруктураОтвета.Вставить("ДатаОкончания",ДатаОкончания);
	
	Возврат Длительность;
	
КонецФункции

Процедура ПрименитьМаршрут(ЭтотОбъектЪ, НайденныйМаршрутМассив, КемЗаполнятьПустыхЮзеров, УказанныеВручнуюИсполнителиНаблюдатели) Экспорт
	
	ЭтотОбъектЪ.ПримененныйМаршрут = НайденныйМаршрутМассив[0].Ссылка;
	
	ЭтотОбъектЪ.Состояния.Очистить();
	Для каждого Стр из НайденныйМаршрутМассив Цикл
		НСтр = ЭтотОбъектЪ.Состояния.Добавить();
		ЗаполнитьЗначенияСвойств(НСтр, Стр);
		
		МассивСтрОбработки = УказанныеВручнуюИсполнителиНаблюдатели.ВыгрузитьЗначения();
		Для каждого Стр7 из МассивСтрОбработки Цикл
			
			Если НСтр.Состояние = Стр7.Состояние Тогда ЗаполнитьЗначенияСвойств(НСтр, Стр7); КонецЕсли;
			
		КонецЦикла;
		
		Если ТипЗнч(ЭтотОбъектЪ) = Тип("ДокументОбъект.ПСЦ") И Стр.ОтветственныйМенеджерПСЦ = Истина И ЗначениеЗаполнено(ЭтотОбъектЪ.ОтветственныйМенеджер) Тогда
			НСтр.Исполнитель = ЭтотОбъектЪ.ОтветственныйМенеджер;
		КонецЕсли;
		//Евросиб Максимова #0223008
		Если ТипЗнч(ЭтотОбъектЪ) = Тип("ДокументОбъект.ПоступлениеНаРасчетныйСчет")  Тогда
			Если ЭтотОбъектЪ.ЦФО<>Справочники.ЦентрыФинансовойОтветственности.ОсновнойЦФО Тогда
				// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 14.12.2022
				// Было:
				//ИсполнительНСК=ЭтотОбъектЪ.ДоговорКонтрагента.ОтветственныйЗаСопровождениеНСК; 
				//Стало:
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("Договор",				ЭтотОбъектЪ.ДоговорКонтрагента);
				СтруктураПараметров.Вставить("ЦФО",					Справочники.ЦентрыФинансовойОтветственности.ТерминалНовосибирск);
				СтруктураПараметров.Вставить("ТипОтветственного",	Перечисления.ТипыОтветственных.ОтветственныйЗаСопровождение);  
				ИсполнительНСК = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственного(СтруктураПараметров);
				// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 14.12.2022
				
			//Иначе
			//    КемЗаполнятьПустыхЮзеровДоговор=ЭтотОбъектЪ.ДоговорКонтрагента.ОтветственныйЗаСопровождение;
			Если ЗначениеЗаполнено(ИсполнительНСК) Тогда
				НСтр.Исполнитель=ИсполнительНСК;
				НСтр.Наблюдатель=ИсполнительНСК;
			Иначе
				Сообщить("Не заполнен ответственный за сопровождение НСК в договоре!");
			КонецЕсли;
			КонецЕсли;

		КонецЕсли;
		//Евросиб Максимова #0223008
		
		Если НЕ ЗначениеЗаполнено(НСтр.Исполнитель) И НЕ Стр.ТребуетсяУказатьИсполнителя Тогда НСтр.Исполнитель = КемЗаполнятьПустыхЮзеров; КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НСтр.Наблюдатель) И НЕ Стр.ТребуетсяУказатьНаблюдателя Тогда НСтр.Наблюдатель = КемЗаполнятьПустыхЮзеров; КонецЕсли;
		
	КонецЦикла;
	
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	Если ТипЗнч(ЭтотОбъектЪ) = Тип("ДокументОбъект.Заявка") Тогда
		Если ЭтотОбъектЪ.ЗапросНаКТК Тогда
			ЭтотОбъектЪ.ВнутреннийСтатусЗапроса = Перечисления.ВнутренниеСтатусыЗапросовНаКТК.Черновик;
		КонецЕсли;	
	КонецЕсли;	
	// Евросиб Фролов)
	
КонецПроцедуры

//Евросиб Каблов 16.06.2021 ( Ticket#0234671
//Процедура ПостобработкаТЧСостояний(ЭтотОбъектЪ, КемЗаполнятьПустыхЮзеров) Экспорт
Процедура ПостобработкаТЧСостояний(ЭтотОбъектЪ, КемЗаполнятьПустыхЮзеров, Отказ = Ложь, РежимЗаписи = Неопределено) Экспорт
//Евросиб Каблов 16.06.2021 )

	//ДИТ, Беляев СЮ, Ticket#0287047, 26-10-2022, начало
	МаршрутизацияСервер.УстановитьВыполнениеЗафиксировано(ЭтотОбъектЪ);
	МаршрутизацияСервер.ПостобработкаВыполненныхЗадач(ЭтотОбъектЪ);
	//ДИТ, Беляев СЮ, Ticket#0287047, 26-10-2022, конец
				
	МассивРазрешенныхТиповКМаршрутизации = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Константы.МаршрутизироватьДоговор КАК МаршрутизироватьДоговор,
	               |	Константы.МаршрутизироватьЗакрытиеПериода КАК МаршрутизироватьЗакрытиеПериода,
	               |	Константы.МаршрутизироватьЗапрос КАК МаршрутизироватьЗапрос,
	               |	Константы.МаршрутизироватьЗаявку КАК МаршрутизироватьЗаявку,
	               |	Константы.МаршрутизироватьКалькуляцию КАК МаршрутизироватьКалькуляцию,
	               |	Константы.МаршрутизироватьКорректировкуПоступления КАК МаршрутизироватьКорректировкуПоступления,
	               |	Константы.МаршрутизироватьКорректировкуРеализации КАК МаршрутизироватьКорректировкуРеализации,
	               |	Константы.МаршрутизироватьЛичныеЦелиИЗадачи КАК МаршрутизироватьЛичныеЦелиИЗадачи,
	               |	Константы.МаршрутизироватьОперации КАК МаршрутизироватьОперации,
	               |	Константы.МаршрутизироватьОтчетКомиссионера КАК МаршрутизироватьОтчетКомиссионера,
	               |	Константы.МаршрутизироватьОтчетКомитенту КАК МаршрутизироватьОтчетКомитенту,
	               |	Константы.МаршрутизироватьПоступлениеНаРС КАК МаршрутизироватьПоступлениеНаРС,
	               |	Константы.МаршрутизироватьПСЦ КАК МаршрутизироватьПСЦ,
	               |	Константы.МаршрутизироватьПТУ КАК МаршрутизироватьПТУ,
	               |	Константы.МаршрутизироватьРТУ КАК МаршрутизироватьРТУ,
	               |	Константы.МаршрутизироватьСделку КАК МаршрутизироватьСделку,
	               |	Константы.МаршрутизироватьСписаниеСРС КАК МаршрутизироватьСписаниеСРС,
	               |	Константы.МаршрутизироватьСФВ КАК МаршрутизироватьСФВ,
	               |	Константы.МаршрутизироватьСФП КАК МаршрутизироватьСФП,
	               |	Константы.МаршрутизироватьСчетПокупателю КАК МаршрутизироватьСчетПокупателю,
	               |	Константы.МаршрутизироватьСчетПоставщика КАК МаршрутизироватьСчетПоставщика,
	               |	Константы.МаршрутизироватьПроект КАК МаршрутизироватьПроект,
	               |	Константы.МаршрутизироватьКредитнуюЗаявку КАК МаршрутизироватьКредитнуюЗаявку
	               |ИЗ
	               |	Константы КАК Константы";
	Ответ = Запрос.Выполнить().Выбрать();                  
	Если Ответ.Следующий() Тогда
		
		Если Ответ.МаршрутизироватьДоговор Тогда МассивРазрешенныхТиповКМаршрутизации.Добавить(Тип("СправочникОбъект.ДоговорыКонтрагентов")); КонецЕсли;
		Если Ответ.МаршрутизироватьЗакрытиеПериода Тогда МассивРазрешенныхТиповКМаршрутизации.Добавить(Тип("ДокументОбъект.ЗакрытиеПериода")); КонецЕсли;
		Если Ответ.МаршрутизироватьЗапрос Тогда МассивРазрешенныхТиповКМаршрутизации.Добавить(Тип("ДокументОбъект.Запрос")); КонецЕсли;
		Если Ответ.МаршрутизироватьЗаявку Тогда МассивРазрешенныхТиповКМаршрутизации.Добавить(Тип("ДокументОбъект.Заявка")); КонецЕсли;
		Если Ответ.МаршрутизироватьКалькуляцию Тогда МассивРазрешенныхТиповКМаршрутизации.Добавить(Тип("ДокументОбъект.Калькуляция")); КонецЕсли;
		Если Ответ.МаршрутизироватьКорректировкуПоступления Тогда МассивРазрешенныхТиповКМаршрутизации.Добавить(Тип("ДокументОбъект.КорректировкаПоступления")); КонецЕсли;
		Если Ответ.МаршрутизироватьКорректировкуРеализации Тогда МассивРазрешенныхТиповКМаршрутизации.Добавить(Тип("ДокументОбъект.КорректировкаРеализации")); КонецЕсли;
		Если Ответ.МаршрутизироватьЛичныеЦелиИЗадачи Тогда МассивРазрешенныхТиповКМаршрутизации.Добавить(Тип("ДокументОбъект.ЛичныеЦели")); КонецЕсли;
		Если Ответ.МаршрутизироватьОперации Тогда МассивРазрешенныхТиповКМаршрутизации.Добавить(Тип("ДокументОбъект.Операция")); КонецЕсли;
		Если Ответ.МаршрутизироватьОтчетКомиссионера Тогда МассивРазрешенныхТиповКМаршрутизации.Добавить(Тип("ДокументОбъект.ОтчетКомиссионераОПродажах")); КонецЕсли;
		Если Ответ.МаршрутизироватьОтчетКомитенту Тогда МассивРазрешенныхТиповКМаршрутизации.Добавить(Тип("ДокументОбъект.ОтчетКомитентуОПродажах")); КонецЕсли;
		Если Ответ.МаршрутизироватьПоступлениеНаРС Тогда МассивРазрешенныхТиповКМаршрутизации.Добавить(Тип("ДокументОбъект.ПоступлениеНаРасчетныйСчет")); КонецЕсли;
		Если Ответ.МаршрутизироватьПСЦ Тогда МассивРазрешенныхТиповКМаршрутизации.Добавить(Тип("ДокументОбъект.ПСЦ")); КонецЕсли;
		Если Ответ.МаршрутизироватьПТУ Тогда МассивРазрешенныхТиповКМаршрутизации.Добавить(Тип("ДокументОбъект.ПоступлениеТоваровУслуг")); КонецЕсли;
		Если Ответ.МаршрутизироватьРТУ Тогда МассивРазрешенныхТиповКМаршрутизации.Добавить(Тип("ДокументОбъект.РеализацияТоваровУслуг")); КонецЕсли;
		Если Ответ.МаршрутизироватьСделку Тогда МассивРазрешенныхТиповКМаршрутизации.Добавить(Тип("ДокументОбъект.Сделка")); КонецЕсли;
		Если Ответ.МаршрутизироватьСписаниеСРС Тогда МассивРазрешенныхТиповКМаршрутизации.Добавить(Тип("ДокументСсылка.СписаниеСРасчетногоСчета")); КонецЕсли;
		Если Ответ.МаршрутизироватьСФВ Тогда МассивРазрешенныхТиповКМаршрутизации.Добавить(Тип("ДокументСсылка.СчетФактураВыданный")); КонецЕсли;
		Если Ответ.МаршрутизироватьСФП Тогда МассивРазрешенныхТиповКМаршрутизации.Добавить(Тип("ДокументСсылка.СчетФактураПолученный")); КонецЕсли;
		Если Ответ.МаршрутизироватьСчетПокупателю Тогда МассивРазрешенныхТиповКМаршрутизации.Добавить(Тип("ДокументСсылка.СчетНаОплатуПокупателю")); КонецЕсли;
		Если Ответ.МаршрутизироватьСчетПоставщика Тогда МассивРазрешенныхТиповКМаршрутизации.Добавить(Тип("ДокументСсылка.СчетНаОплатуПоставщика")); КонецЕсли;
		Если Ответ.МаршрутизироватьПроект Тогда МассивРазрешенныхТиповКМаршрутизации.Добавить(Тип("СправочникОбъект.Проекты")); КонецЕсли;
		Если Ответ.МаршрутизироватьКредитнуюЗаявку Тогда МассивРазрешенныхТиповКМаршрутизации.Добавить(Тип("ДокументСсылка.КредитнаяЗаявка")); КонецЕсли;
	КонецЕсли;
	
	Если ЭтотОбъектЪ.Состояния.Количество() = 0 И МассивРазрешенныхТиповКМаршрутизации.Найти(ТипЗнч(ЭтотОбъектЪ)) <> неопределено Тогда
		НСтр = ЭтотОбъектЪ.Состояния.Добавить();
		НСтр.Исполнитель = КемЗаполнятьПустыхЮзеров;
		НСтр.Наблюдатель = КемЗаполнятьПустыхЮзеров;
		НСтр.Состояние = Справочники.Состояния.Выполнение;
		НСтр.Статус = Перечисления.СтатусыЭтапов.Новый;
		
		//Если ТипЗнч(ЭтотОбъектЪ) = Тип("СправочникОбъект.РейсыЖД") Тогда
		//	НСтр.Статус = Перечисления.СтатусыЭтапов.Выполнен;
		//КонецЕсли;
		
	КонецЕсли;
	
	//Евросиб Каблов 11.04.2022 ( Task 45430
	ЗадачиДляОтметкиВыполнения = Неопределено;
	Если ЭтотОбъектЪ.ДополнительныеСвойства.Свойство("ЗадачиДляОтметкиВыполнения", ЗадачиДляОтметкиВыполнения) Тогда
		ОтметитьВыполнениеЗадач(ЭтотОбъектЪ, ЗадачиДляОтметкиВыполнения);
	КонецЕсли;
	//Евросиб Каблов 11.04.2022 )
	
	// определяем текущее состояние. для нас это первое состояние не в "выполнено"
	МТД = Метаданные.НайтиПоТипу(ТипЗнч(ЭтотОбъектЪ));
	Если МТД.Реквизиты.Найти("ТекущееСостояние") <> неопределено Тогда
		
		////Евросиб Каблов 16.06.2021 ( Ticket#0234671
		//Если РежимЗаписи = РежимЗаписиДокумента.Запись И Не ЭтотОбъектЪ.Проведен Тогда
		//	Для каждого Состояние из ЭтотОбъектЪ.Состояния Цикл
		//		Если ЭтотОбъектЪ.ТекущееСостояние = Состояние.Состояние И Состояние.Статус = Перечисления.СтатусыЭтапов.Выполнен Тогда
		//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ не проведен! Запрещено выполнение задач непроведенных документов.",,,, Отказ);
		//		КонецЕсли;
		//	КонецЦикла;
		//КонецЕсли;
		////Евросиб Каблов 16.06.2021 ) 
		
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0363342, 20-08-2024, начало (при записи непроведенного документа очистим ТекущееСостояние и проверку на закрытие задачи в таких документах закомменторовал выше)
		ЗаписьНепроведенногоДокумента = РежимЗаписи = РежимЗаписиДокумента.Запись И Не ЭтотОбъектЪ.Проведен;
		Если ЗаписьНепроведенногоДокумента Тогда
			ЭтотОбъектЪ.ТекущееСостояние = Справочники.Состояния.ПустаяСсылка();
		Иначе
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0363342, 20-08-2024, конец
			Для каждого Состояние из ЭтотОбъектЪ.Состояния Цикл
				Если Состояние.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
					ЭтотОбъектЪ.ТекущееСостояние = Состояние.Состояние;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ЭтотОбъектЪ.Состояния.Количество() > 0 И ЭтотОбъектЪ.Состояния.Количество() = ЭтотОбъектЪ.Состояния.НайтиСтроки(Новый Структура("Статус", Перечисления.СтатусыЭтапов.Выполнен)).Количество() Тогда // > 0 И ЭтотОбъектЪ.Состояния[ЭтотОбъектЪ.Состояния.Количество()-1].Статус = Перечисления.СтатусыЭтапов.Выполнен Тогда
				ЭтотОбъектЪ.ТекущееСостояние = ЭтотОбъектЪ.Состояния[ЭтотОбъектЪ.Состояния.Количество()-1].Состояние;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	
	// SIV 14-10-2020 FIX если произошла отмена какого-либо состояния, то мы должны отменить выполнение и последующих
	
	ЧтоТоПоменялось = Истина;
	СчетчикЗащиты = 1;
	
 // (Евросиб Максимова #0210942
 Если Не ТипЗнч(ЭтотОбъектЪ)=Тип("ДокументОбъект.Калькуляция") Тогда
	 Если ЭтотОбъектЪ.Состояния.Количество()>1 Тогда  
	 
	Пока ЧтоТоПоменялось = Истина И СчетчикЗащиты < 10 Цикл
		ЧтоТоПоменялось = Ложь;
		Для Сч = 1 По ЭтотОбъектЪ.Состояния.Количество() Цикл
			
			ТекПроверСтрока = ЭтотОбъектЪ.Состояния.Количество()-Сч;
			
			//Евросиб Каблов 13.01.2022 ( 62514
			//СписокПредЭтапов = ЭтотОбъектЪ.Состояния[ТекПроверСтрока].ПредыдущиеЭтапы;
			//СписокПредЭтапов = СтрЗаменить(СписокПредЭтапов, ";", ","); СписокПредЭтапов = СтрЗаменить(СписокПредЭтапов, " ", "");
			//МасЭтапов = СтрРазделить(СписокПредЭтапов, ",", Ложь);
			//
			//НужноОткатить = Ложь;
			//Для каждого МЭ из МасЭтапов Цикл
			//	
			//	Курсор = Число(МЭ)-1;
			//	Если Курсор > ЭтотОбъектЪ.Состояния.Количество()-1 Тогда Продолжить; КонецЕсли;
			//	
			//	НужноОткатить = НужноОткатить ИЛИ (ЭтотОбъектЪ.Состояния[Курсор].Статус <> Перечисления.СтатусыЭтапов.Выполнен И ЭтотОбъектЪ.Состояния[ТекПроверСтрока].Статус <> Перечисления.СтатусыЭтапов.Новый);
			//	
			//КонецЦикла;
			//
			//Если НужноОткатить тогда
			//	ЭтотОбъектЪ.Состояния[ТекПроверСтрока].Статус = Перечисления.СтатусыЭтапов.Новый;
			//	ЧтоТоПоменялось = Истина;
			//	СчетчикЗащиты = СчетчикЗащиты + 1;
			//КонецЕсли;
			
			ПроверяемаяСтрока = ЭтотОбъектЪ.Состояния[ТекПроверСтрока];
			Если ПроверяемаяСтрока.ВыполнениеЗафиксировано И ПроверяемаяСтрока.Статус = Перечисления.СтатусыЭтапов.Выполнен Тогда
				Продолжить;
			КонецЕсли;
			
			//Евросиб СубботинВ #107396 18.04.2025 Начало 
			Если ТипЗнч(ЭтотОбъектЪ) = Тип("ДокументОбъект.ЗаявкаНаОплату") Тогда
				Продолжить;
			КонецЕсли;
			//Евросиб СубботинВ #107396 18.04.2025 Конец 
			
			// ДИТ US 76975 ТА 76977 Сержантова А.С. Начало: 20.11.2023 - для Заявки при заполнении ПСЦ задачу по вводу ПСЦ оставляем выполненной
			//Евросиб Коханенко Н.А. 26.02.2025 (( #101467 
			//Если ТипЗнч(ЭтотОбъектЪ)=Тип("ДокументОбъект.Заявка") и ЗначениеЗаполнено(ЭтотОбъектЪ.ПСЦ)
			//проверяем все строки ТЧ СоставаУслуг на заполненность ПСЦ 
			Если ТипЗнч(ЭтотОбъектЪ) = Тип("ДокументОбъект.Заявка") Тогда
				ПСЦЗаполнен = (ЭтотОбъектЪ.СоставУслуги.Количество() > 0);
				Для Каждого Стр Из ЭтотОбъектЪ.СоставУслуги Цикл 
					ПСЦЗаполнен = ПСЦЗаполнен И ЗначениеЗаполнено(Стр.ПСЦ);
				КонецЦикла;
			КонецЕсли;
			Если ТипЗнч(ЭтотОбъектЪ)=Тип("ДокументОбъект.Заявка") и ПСЦЗаполнен
			//Евросиб Коханенко Н.А. 26.02.2025 )) #101467 
				и ПроверяемаяСтрока.Состояние = Справочники.Состояния.ВводПСЦ Тогда
			    Продолжить;
			КонецЕсли;
			// ДИТ US 76975 ТА 76977 Сержантова А.С. Конец: 20.11.2023
			
			Если ПроверяемаяСтрока.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
				Продолжить;
			КонецЕсли;
			
			НужноОткатить = Ложь;
			
			СписокПредЭтапов = ПроверяемаяСтрока.ПредыдущиеЭтапы;
			СписокПредЭтапов = СтрЗаменить(СписокПредЭтапов, ";", ","); СписокПредЭтапов = СтрЗаменить(СписокПредЭтапов, " ", "");
			МасЭтапов = СтрРазделить(СписокПредЭтапов, ",", Ложь);
			
			Если ЗначениеЗаполнено(МасЭтапов) Тогда
				Для каждого МЭ из МасЭтапов Цикл
					
					Курсор = Число(МЭ)-1;
					Если Курсор > ЭтотОбъектЪ.Состояния.Количество()-1 Тогда Продолжить; КонецЕсли;
					
					Если ЭтотОбъектЪ.Состояния[Курсор].Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
						НужноОткатить = Истина;
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
			Иначе
				Для Каждого Стр Из ЭтотОбъектЪ.Состояния Цикл
					
					Если Стр.НомерСтроки < ПроверяемаяСтрока.НомерСтроки Тогда
						Если Стр.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
							НужноОткатить = Истина;
						КонецЕсли;
					Иначе
						Прервать;
					КонецЕсли;
					
					Если НужноОткатить Тогда
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
			
			Если НужноОткатить тогда
				ПроверяемаяСтрока.Статус = Перечисления.СтатусыЭтапов.Новый;
				ЧтоТоПоменялось = Истина;
				СчетчикЗащиты = СчетчикЗащиты + 1;
			КонецЕсли;
			//Евросиб Каблов 13.01.2022 )
			
		КонецЦикла;
	КонецЦикла;
КонецЕсли;
КонецЕсли;
 // Евросиб Максимова #0210942) 
 
КонецПроцедуры

Процедура ЗакрытьТекущиеЗадачиПользователя(СписокДокументов) Экспорт
	
	ТекПользователь = Пользователи.ТекущийПользователь();
	ЯЗамещаю = Пользователи_sd_сервер.ПодобратьЗамещениеОбратное(ТекПользователь, ТекущаяДата());
	МоиГруппы = Пользователи_sd_сервер.ПолучитьСписокМоихГрупп(ТекПользователь, ЯЗамещаю);
	// ДИТ Поморцева Т.П. Задача 238786 16.08.21. начало
	//МоиГруппы.Добавить(ТекПользователь);
	//МоиГруппы.Добавить(ЯЗамещаю);
	Для Каждого Элемент ИЗ ЯЗамещаю Цикл
		МоиГруппы.Добавить(Элемент);
	КонецЦикла;	
	// ДИТ Поморцева Т.П. Задача 238786 16.08.21. конец
	
	ЗакрывающиеСтатусы = Новый Массив;
	ЗакрывающиеСтатусы.Добавить(Перечисления.СтатусыЭтапов.ВРаботе);
	ЗакрывающиеСтатусы.Добавить(Перечисления.СтатусыЭтапов.НаВыполнение);
	
	Для каждого Док из СписокДокументов Цикл
		
		ДокО = Док.ПолучитьОбъект();
		ЧтоТоИзменилось = Ложь;
		
		Для каждого Стр из ДокО.Состояния Цикл
			
			Если ЗакрывающиеСтатусы.Найти(Стр.Статус) <> неопределено И МоиГруппы.Найти(Стр.Исполнитель) <> неопределено Тогда
				//Евросиб Каблов 06.02.2021 ( Ticket#0220877
				Отказ = Ложь;
				ПроверитьВозможностьВыполненияЗадачи(Док, ДокО, Стр, Отказ);
				Если Отказ Тогда
				    Продолжить;					
				КонецЕсли; 
				//Евросиб Каблов 06.02.2021 )
				Стр.Статус = Перечисления.СтатусыЭтапов.Выполнен;
				ЧтоТоИзменилось = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЧтоТоИзменилось Тогда
			//Евросиб Каблов 27.01.2021 ( Ticket#0218715
			ИзмененияЗапрещены = Ложь;
			РежимЗаписи = ?(ДокО.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись);
			КонтрольДоступностиДокументов_сервер.ПроверитьДоступностьПолейДляИзменения(ДокО, ИзмененияЗапрещены, РежимЗаписи, Неопределено);
			//Евросиб Каблов 27.01.2021 )
			//Евросиб Каблов 12.08.2021 ( Ticket#0236986
			УстановитьПривилегированныйРежим(Истина);
			//Евросиб Каблов 12.08.2021 )
			Попытка
				ДокО.Записать(?(ДокО.Проведен,РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
			Исключение
				//Евросиб Каблов 12.08.2021 ( Ticket#0236986
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По документу " + Док + " не удалось закрыть задачу!");
				//Евросиб Каблов 12.08.2021 )
			КонецПопытки;
			//Евросиб Каблов 12.08.2021 ( Ticket#0236986
			УстановитьПривилегированныйРежим(Ложь);
			//Евросиб Каблов 12.08.2021 )
		Иначе
			//Евросиб Каблов 06.02.2021 ( Ticket#0220877
			//Сообщить("По документу " + Док + " не удалось закрыть задачу, т.к. не найдены задачи текущего пользователя!");
			Сообщить("По документу " + Док + " не удалось закрыть задачу!");
			//Евросиб Каблов 06.02.2021 ( Ticket#0220877
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьВозможностьВыполненияЗадачи(ДокументСсылка, ДокументОбъект, СтрокаЗадачи, Отказ)

	Если СтрокаЗадачи.Состояние.ПроверитьВыгрузкуПривязанныхСчетовВУПП Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СчетНаОплатуПоставщика.Ссылка КАК Ссылка,
		|	СчетНаОплатуПоставщика.Представление КАК Представление
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.СвязанныеСчетаПоставщиков КАК ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПоставщика КАК СчетНаОплатуПоставщика
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		|			ПО СчетНаОплатуПоставщика.Ссылка = ПротоколОбменов.Объект
		|				И (ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
		|				И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УППЗаказ))
		|		ПО ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.СчетПоставщика = СчетНаОплатуПоставщика.Ссылка
		|ГДЕ
		|	ПротоколОбменов.УИДИсточника ЕСТЬ NULL
		|	И ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.Ссылка = &Ссылка
		|	И НЕ ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.Ссылка.ДоговорКонтрагента.РасчетыПоДоговоруВЦелом";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл			
			ТекстСообщения = СтрШаблон("Документ %1 не выгружен в УПП!", Выборка.Представление);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);		
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры
 

Процедура ПриУстановкеПризнакаВыставленПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Если Источник.Выставлен Тогда
		Для каждого СтрокаСостояние Из Источник.Состояния Цикл
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаСостояние.Состояние, "ОтмечатьВыполнениеАвтоматическиПоВыставлению") Тогда
				СтрокаСостояние.Статус = Перечисления.СтатусыЭтапов.Выполнен;
				СтрокаСостояние.НачалоРаботы = ТекущаяДата();
				СтрокаСостояние.ЗавершениеРаботы = ТекущаяДата();
				СтрокаСостояние.Исполнитель = Пользователи.ТекущийПользователь();
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
КонецПроцедуры

Функция ПолучитьИсполнителяЭтапа(Ссылка, НаименованиеСостояния) Экспорт

	Результат = Новый Структура("Ссылка, Наименование", Справочники.Пользователи.ПустаяСсылка(), "");
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаСостояний.Исполнитель КАК Ссылка,
	|	ТаблицаСостояний.Исполнитель.Наименование КАК Наименование
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Состояния КАК ТаблицаСостояний
	|ГДЕ
	|	ТаблицаСостояний.Ссылка = &Ссылка
	|	И ТаблицаСостояний.Состояние.Наименование ПОДОБНО &Состояние";
	
	ПолноеИмяОбъекта = Ссылка.Метаданные().ПолноеИмя();
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "Документ.ПоступлениеТоваровУслуг", ПолноеИмяОбъекта);
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Состояние", НаименованиеСостояния);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции // ПолучитьИсполнителяЭтапа()

//++ Зубов 35844 04.08.2021
Процедура ПараллельноеСогласование(Состояния) Экспорт
	
	//Евросиб Каблов 31.08.2022 ( Task56814
	ТекДата = ТекущаяДата();
	СтатусВыполнен = Перечисления.СтатусыЭтапов.Выполнен;
	СтатусОтклонен = Перечисления.СтатусыЭтапов.Отклонен;
	
	ДопПоля = Новый Структура;
	ДопПоля.Вставить("ВыполнятьАвтоматическиЕслиПредыдущаяЗадачаСТемЖеИсполнителем");
	
	Для Каждого Стр Из Состояния Цикл
		
		ДопПоля.ВыполнятьАвтоматическиЕслиПредыдущаяЗадачаСТемЖеИсполнителем = Ложь;
		ЗаполнитьЗначенияСвойств(ДопПоля, Стр);
		
		Если Стр.Статус <> СтатусВыполнен И Стр.Статус <> СтатусОтклонен И ДопПоля.ВыполнятьАвтоматическиЕслиПредыдущаяЗадачаСТемЖеИсполнителем Тогда
			
			Если ЗначениеЗаполнено(Стр.ПредыдущиеЭтапы) Тогда
				
				Попытка
					МассивЭтапов = СтрРазделить(Стр.ПредыдущиеЭтапы,",",Ложь);
				Исключение
					Продолжить;
				КонецПопытки;
				ВозможноВыполнение = Истина;
				
				Для каждого Эл из МассивЭтапов Цикл
					
					Попытка
						НомСтр = Число(Эл);
					Исключение
					КонецПопытки;
					
					ПредыдущийЭтап = Состояния.Найти(НомСтр,"НомерСтроки");
					Если ПредыдущийЭтап <> Неопределено Тогда
						Если ПредыдущийЭтап.Статус = СтатусВыполнен И ПредыдущийЭтап.Исполнитель = Стр.Исполнитель Тогда
							
							Стр.Статус = СтатусВыполнен;				
							Стр.НачалоРаботы = ТекДата;							
							Стр.ЗавершениеРаботы = ТекДата;
				
							Прервать;
							
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;				
			
		КонецЕсли;
		
	КонецЦикла;
	//Евросиб Каблов 31.08.2022 )
	
	//Стаценко Параллельное согласование
	Для каждого СтрТЧ из Состояния Цикл
		Если Не ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
			СтрТЧ.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
			//++ Зубов 35844 05.08.2021
			СтрТЧ.НачалоРаботы = ТекущаяДата();
			//-- Зубов 35844 05.08.2021
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
            ПредыдущиеЭтапы = СтрТЧ.ПредыдущиеЭтапы;
			Попытка
				МассивЭтапов = СтрРазделить(ПредыдущиеЭтапы,",",Ложь);
			Исключение
				Сообщить("Некорректная строка предыдущих этапов");
			КонецПопытки;
			ВозможноВыполнение = Истина;
						
			Если МассивЭтапов.Количество() > 0 Тогда
				Для каждого Эл из МассивЭтапов Цикл
					Попытка
						НомСтр = Число(Эл);
						СтрЭтапа = Состояния.Найти(НомСтр,"НомерСтроки");
						Если СтрЭтапа <> Неопределено Тогда
							Если СтрЭтапа.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
								ВозможноВыполнение = Ложь;
							КонецЕсли;
						КонецЕсли;
					Исключение
						Сообщить("Некорректное указание этапа состояние. Возможен только ввод цифр.");
					КонецПопытки
				КонецЦикла;
			КонецЕсли;
			Если ВозможноВыполнение Тогда
				СтрТЧ.Статус =  Перечисления.СтатусыЭтапов.НаВыполнение;
				//++ Зубов 35844 05.08.2021
				СтрТЧ.НачалоРаботы = ТекущаяДата();
				//-- Зубов 35844 05.08.2021
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
//-- Зубов 35844 04.08.2021

//Евросиб - АСуслов 15.12.2021 15:12:17 #42234
//(
Функция ТребуетсяПеремаршрутизацияДляОбъекта(Объект, СписокРеквизитовДляСравнения="") Экспорт
	Если СписокРеквизитовДляСравнения = "" Тогда
		СписокРеквизитовДляСравнения = ПолучитьСписокРеквизитовДляСравнения(Объект);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗначенияРеквизитовКалькуляцииСсылка = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Ссылка, СписокРеквизитовДляСравнения);
		ЗначенияРеквизитовКалькуляцииОбъект = Новый Структура(СписокРеквизитовДляСравнения);
		ЗаполнитьЗначенияСвойств(ЗначенияРеквизитовКалькуляцииОбъект, Объект)
	КонецЕсли;
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = Не ЗначениеЗаполнено(Объект.Ссылка) 
									ИЛИ Не ОбщегоНазначения.КоллекцииИдентичны(ЗначенияРеквизитовКалькуляцииОбъект, ЗначенияРеквизитовКалькуляцииСсылка)
									ИЛИ Объект.Состояния.Количество() = 0;
	Возврат ДляДанногоОбъектаТребуетсяПеремаршрутизация;									
КонецФункции

Функция ПолучитьСписокРеквизитовДляСравнения(Объект)
	СписокРеквизитовДляСравнения = "";
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.Заявка") Тогда
		
		СписокРеквизитовДляСравнения = "Организация, Контрагент, ВидПеревозки, Договор, ИсточникЗаявки,
										|НаМоментЗаписиБылаЗадолженность, ЗапросНаКТК, Отправка, ВидПеревозки";

		// Евросиб Фролов (22.02.2022 Task №47608
		// Исключить из перечня ключевых поле "Отправка" из шапки Заявки (только для запроса на КТК).
		Если Объект.ЗапросНаКТК Тогда
			СписокРеквизитовДляСравнения = СтрЗаменить(СписокРеквизитовДляСравнения, ", Отправка" ,"");
		КонецЕсли;	
		// Евросиб Фролов)
		
	ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ПСЦ") Тогда
		
		СписокРеквизитовДляСравнения = "Организация, Контрагент, ВидПеревозки, Валюта, СогласованоВDV,
							   |ВидПСЦ, СодержитВР, ПротоколНаДоплатныеКТК, НетиповойПротокол,
							   |ЦФО, КатегорияУслуг, МестоОказанияУслуг, Договор, ТипКалькуляции";
		
	//Евросиб Каблов 20.05.2024 ( #67092
	ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ПСЦПоставщика") Тогда
		
		СписокРеквизитовДляСравнения = "Организация, Контрагент, ВидПеревозки, Валюта, СогласованоВDV,
							   |ВидПСЦ, СодержитВР, ПротоколНаДоплатныеКТК, НетиповойПротокол,
							   |ЦФО, КатегорияУслуг, МестоОказанияУслуг, Договор, ТипКалькуляции";
	//Евросиб Каблов 20.05.2024 )
		
	ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.Калькуляция") Тогда
		
		СписокРеквизитовДляСравнения = "Организация, Контрагент, Договор, ПС_ВидПеревозки,
											|ММ_ИтогоРентабельность, ММ_ИтогоРентабельность20,
											|ЖД_ПринадлежностьПС, ТипКалькуляции";
		
	ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		
		//Евросиб Каблов 12.08.2022 ( Task 55578
		//СписокРеквизитовДляСравнения = "Организация, Штраф, Претензия, ЦФО, Контрагент, ДоговорКонтрагента";
		СписокРеквизитовДляСравнения = "Организация, Штраф, Претензия, ЦФО, Контрагент, ДоговорКонтрагента, ВидУслуг";
		//Евросиб Каблов 12.08.2022 )
		
	//Евросиб Каблов 12.08.2022 ( Task 55578
	ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
		
		СписокРеквизитовДляСравнения = "Организация, Контрагент, ДоговорКонтрагента, Штраф, ВидУслуг";
	//Евросиб Каблов 12.08.2022 )
		
	// ++ ДИТ_Агафонов_task 50388 06.07.2022
	ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.РелизСобственника") Тогда
		
		СписокРеквизитовДляСравнения = "Организация, ЦФО, Контрагент, Договор";
	// -- ДИТ_Агафонов_task 50388 06.07.2022
	КонецЕсли;
	Возврат СписокРеквизитовДляСравнения;
КонецФункции

//)
//Евросиб - АСуслов 15.12.2021 15:12:29 #42234

// ++ ДИТ Сгонник, US 35090; TA 45802 2022-01-18
Процедура ВыполнитьОтправкуСостоянияВДОПриЗаписи(Источник, Отказ) Экспорт

	// проверим пришел ли документ из 1С:ДО
	ГУИДДокумента = "";

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПротоколОбменов.УИДИсточника КАК УИДИсточника
		|ИЗ
		|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		|ГДЕ
		|	ПротоколОбменов.Объект = &Объект
		|	И ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных)
		|	И ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.ДО)
		|	И ПротоколОбменов.Объект ССЫЛКА Документ.ПоступлениеТоваровУслуг";
	
	Запрос.УстановитьПараметр("Объект", Источник.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		ГУИДДокумента = ВыборкаДетальныеЗаписи.УИДИсточника;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ГУИДДокумента) Тогда 
		Возврат;
	КонецЕсли;
	
	// получим актуальное состояние
	АктуальноеСостояние = Неопределено;
	ЭтоВозвратСостояния = Ложь; 
	ТЗИзмененныеСтатусы = Новый ТаблицаЗначений;
	ТЗИзмененныеСтатусы.Колонки.Добавить("Состояние");
	ТЗИзмененныеСтатусы.Колонки.Добавить("НачалоРаботы");
	ТЗИзмененныеСтатусы.Колонки.Добавить("ДатаВозвратаИсполнителю"); 
	ТЗИзмененныеСтатусы.Колонки.Добавить("Понижение"); 
	ТЗИзмененныеСтатусы.Колонки.Добавить("СтатусНовый"); 
	ТЗИзмененныеСтатусы.Колонки.Добавить("РавнозначныеСтатусы"); 
	ТЗИзмененныеСтатусы.Колонки.Добавить("ПодлежитОтправке");
	
	// ДИТ US 60108 TA 65708 Евсенкин М.А. Начало: 17.02.2023
	СтатусыДоЗаписи = Неопределено;
	Источник.ДополнительныеСвойства.Свойство("СтатусыДоЗаписи",СтатусыДоЗаписи);
	Приоритеты = Новый Соответствие;
	Приоритеты.Вставить(Перечисления.СтатусыЭтапов.Новый, 			1);
	Приоритеты.Вставить(Перечисления.СтатусыЭтапов.НаВыполнение, 	2); // одинаковый приоритет 
	Приоритеты.Вставить(Перечисления.СтатусыЭтапов.ВРаботе, 		2); // одинаковый приоритет
	Приоритеты.Вставить(Перечисления.СтатусыЭтапов.Выполнен, 		3);
	Приоритеты.Вставить(Перечисления.СтатусыЭтапов.Отклонен, 		4);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПротоколОбменов.Объект КАК Состояние
		|ИЗ
		|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		|ГДЕ
		|	ПротоколОбменов.Объект ССЫЛКА Справочник.Состояния";
	
	ТЗСостоянияКВыгрузке = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр Из Источник.Состояния Цикл 
		Если Не СтатусыДоЗаписи = Неопределено Тогда 
			Найдено = СтатусыДоЗаписи.Найти(Стр.Состояние,"Состояние"); 
			Если Не Найдено = Неопределено Тогда 
				Если Найдено.Статус <> Стр.Статус Тогда 
					НоваяСтрока = ТЗИзмененныеСтатусы.Добавить();
					НоваяСтрока.Состояние = Найдено.Состояние;
					НоваяСтрока.НачалоРаботы = Стр.НачалоРаботы;
					НоваяСтрока.ДатаВозвратаИсполнителю = Стр.ДатаВозвратаИсполнителю; 
					НоваяСтрока.Понижение = Приоритеты.Получить(Найдено.Статус)>Приоритеты.Получить(Стр.Статус); 
					НоваяСтрока.СтатусНовый = Стр.Статус;
					НоваяСтрока.РавнозначныеСтатусы = Приоритеты.Получить(Найдено.Статус)=Приоритеты.Получить(Стр.Статус);
					НоваяСтрока.ПодлежитОтправке = ЗначениеЗаполнено(ТЗСостоянияКВыгрузке.Найти(Найдено.Состояние,"Состояние"));
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	
	НайденыСтрокиКОтправке = ТЗИзмененныеСтатусы.НайтиСтроки(Новый Структура("РавнозначныеСтатусы,ПодлежитОтправке",Ложь,Истина));
	
	Если НайденыСтрокиКОтправке.Количество() Тогда 
		мСостояние = НайденыСтрокиКОтправке[0];
		Если Не мСостояние.Понижение И Приоритеты.Получить(мСостояние.СтатусНовый) <> 2 Тогда 
			Возврат;	
		КонецЕсли;	
		АктуальноеСостояние = мСостояние.Состояние;
		ЭтоВозвратСостояния = мСостояние.Понижение;
		ДатаСостояния = ?(мСостояние.Понижение,мСостояние.ДатаВозвратаИсполнителю,мСостояние.НачалоРаботы);
	Иначе 
		Возврат;	
	КонецЕсли;
	// ДИТ US 60108 TA 65708 Евсенкин М.А. Конец: 17.02.2023
	
	//Если Не ЭтоВозвратСостояния Тогда  // ДИТ US 60108 TA 65708 Евсенкин М.А. Начало: 17.02.2023
	//	// пробуем найти состояние На выполнение
	//	НайденныеСтроки = Источник.Состояния.НайтиСтроки(Новый Структура("Статус", Перечисления.СтатусыЭтапов.НаВыполнение));
	//	Если НайденныеСтроки.Количество() = 1 Тогда 
	//		АктуальноеСостояние = НайденныеСтроки[0].Состояние;
	//		// ДИТ US 60108 TA 65708 Евсенкин М.А. Начало: 17.02.2023
	//		// Было:
	//		//ЭтоВозвратСостояния = ЗначениеЗаполнено(НайденныеСтроки[0].ДатаВозвратаИсполнителю); 
	//		//ДатаСостояния = ?(ЭтоВозвратСостояния, НайденныеСтроки[0].ДатаВозвратаИсполнителю, НайденныеСтроки[0].НачалоРаботы);
	//		//Стало:
	//		ДатаСостояния = НайденныеСтроки[0].НачалоРаботы;
	//		// ДИТ US 60108 TA 65708 Евсенкин М.А. Конец: 17.02.2023
	//	Иначе 
	//		// пробуем найти состояние В работе
	//		НайденныеСтроки = Источник.Состояния.НайтиСтроки(Новый Структура("Статус", Перечисления.СтатусыЭтапов.ВРаботе));
	//		Если НайденныеСтроки.Количество() = 1 Тогда 
	//			АктуальноеСостояние = НайденныеСтроки[0].Состояние;
	//			// ДИТ US 60108 TA 65708 Евсенкин М.А. Начало: 17.02.2023
	//			// Было:
	//			//ЭтоВозвратСостояния = ЗначениеЗаполнено(НайденныеСтроки[0].ДатаВозвратаИсполнителю); 
	//			//ДатаСостояния = ?(ЭтоВозвратСостояния, НайденныеСтроки[0].ДатаВозвратаИсполнителю, НайденныеСтроки[0].НачалоРаботы);
	//			//Стало:
	//			ДатаСостояния = НайденныеСтроки[0].НачалоРаботы;
	//			// ДИТ US 60108 TA 65708 Евсенкин М.А. Конец: 17.02.2023
	//		Иначе 
	//			// не удалось определить актуальное состояние, либо документ не маршрутизирован
	//		КонецЕсли;
	//	КонецЕсли; 
	//КонецЕсли; // ДИТ US 60108 TA 65708 Евсенкин М.А. Конец: 17.02.2023
	
	Если НЕ ЗначениеЗаполнено(АктуальноеСостояние) Тогда 
		Возврат;
	КонецЕсли;
	
	// проверим нужно ли отправлять состояние в 1С:ДО
	КодСостояния = "";
    //ДИТ Шевченко А.В., US 35090 17.11.2022 -начало
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПротоколОбменов.УИДИсточника КАК УИДИсточника
		|ИЗ
		|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		|ГДЕ
		|	ПротоколОбменов.Объект = &Объект
		|	И ПротоколОбменов.ДействиеПриОбмене = &ДействиеПриОбмене
		|	И ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.ДО)";
	
	Запрос.УстановитьПараметр("ДействиеПриОбмене", Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
	Если ЭтоВозвратСостояния Тогда
		Запрос.УстановитьПараметр("ДействиеПриОбмене", Перечисления.ДействияПриОбмене.ЗагрузкаДанных);		
	КонецЕсли;
	//ДИТ Шевченко А.В., US 35090 17.11.2022 -конец
	Запрос.УстановитьПараметр("Объект", АктуальноеСостояние);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		КодСостояния = ВыборкаДетальныеЗаписи.УИДИсточника;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КодСостояния) Тогда 
		Возврат;
	КонецЕсли;
		
	Прокси = ВебСервисы_сервер.ПолучитьПрокси("ВебСервисОбменаСДО");
	
	//// получим список состояний из 1С:ДО
	//ОтветВебСервисаСостояния = "out";
	//Попытка
	//	//Вызываем метод веб-сервиса
	//	ОбъектXDTO = Прокси.GetEvents(
	//		"Data Core",
	//		ОтветВебСервисаСостояния);
	//Исключение
	//	ЗаписьЖурналаРегистрации(НСтр("ru = 'Подключение к вебсервису 1С:ДО'"),
	//	   УровеньЖурналаРегистрации.Ошибка,,,
	//	   ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	//КонецПопытки;
	
	// отправляем состояние в веб-сервис 1С:ДО
	ИмяМетода = "XMLStatusMonitoring";
	ИмяОперации = "Event";
			
	//Получаем параметры метода
	ТипWSПараметра = Прокси.ФабрикаXDTO.Пакеты.Получить(ИмяМетода).Получить(ИмяОперации);
	
	//Создаем параметр на основе типа и заполняем значение параметров
	WSПараметр = Прокси.ФабрикаXDTO.Создать(ТипWSПараметра);
	WSПараметр.Set_GUID 		= ГУИДДокумента;
	WSПараметр.EventCode 		= КодСостояния;
	WSПараметр.EventDate 		= ДатаСостояния;
	WSПараметр.ExternalSystemID = "Data Core";
	WSПараметр.Comment 			= "";
	
	Запись = Новый ЗаписьXML;
		
	Запись.УстановитьСтроку("windows-1251"); 
	Запись.ЗаписатьОбъявлениеXML();
	
	Запись.ЗаписатьНачалоЭлемента("Events");
	
	Запись.ЗаписатьНачалоАтрибута("xmlns");		
	Запись.ЗаписатьТекст(XMLСтрока("XMLStatusMonitoring"));		
	Запись.ЗаписатьКонецАтрибута(); //xmlns
	
	Запись.ЗаписатьНачалоАтрибута("xmlns:xs");		
	Запись.ЗаписатьТекст(XMLСтрока("http://www.w3.org/2001/XMLSchema"));		
	Запись.ЗаписатьКонецАтрибута(); //xmlns:xs
	
	Запись.ЗаписатьНачалоЭлемента("Event");
	
	Запись.ЗаписатьНачалоЭлемента("Set_GUID");
	Запись.ЗаписатьТекст(XMLСтрока(WSПараметр.Set_GUID));		
	Запись.ЗаписатьКонецЭлемента(); //Set_GUID
	
	Запись.ЗаписатьНачалоЭлемента("EventCode");
	Запись.ЗаписатьТекст(XMLСтрока(WSПараметр.EventCode));		
	Запись.ЗаписатьКонецЭлемента(); //EventCode
	
	Запись.ЗаписатьНачалоЭлемента("EventDate");
	Запись.ЗаписатьТекст(XMLСтрока(WSПараметр.EventDate));		
	Запись.ЗаписатьКонецЭлемента(); //EventDate
	
	Запись.ЗаписатьНачалоЭлемента("ExternalSystemID");
	Запись.ЗаписатьТекст(XMLСтрока(WSПараметр.ExternalSystemID));		
	Запись.ЗаписатьКонецЭлемента(); //ExternalSystemID
	
	Запись.ЗаписатьКонецЭлемента(); //Event
	Запись.ЗаписатьКонецЭлемента(); //Events
	
	ЗапросXML = Запись.Закрыть();
	
	ОтветВебСервиса = "out";
	
	Попытка
		//Вызываем метод веб-сервиса
		ОтветXML = Прокси.ProcessEvents(
			ЗапросXML,
			ОтветВебСервиса);
	Исключение
		//Сообщить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Подключение к вебсервису 1С:ДО'"),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Если НЕ ОтветXML = Истина Тогда 
		// ответ не успешен
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Подключение к вебсервису 1С:ДО'"),
			УровеньЖурналаРегистрации.Ошибка,,,
			"При запросе:
			|"+ЗапросXML+"
			|не удалось получить успешный ответ.
			|"+ОтветВебСервиса);
	//Иначе
	//	ТаблицаДанных = ВебСервисы_сервер.УниверсальныйПарсерXML(ОтветВебСервиса, "Event");
	КонецЕсли;
	
КонецПроцедуры
// -- ДИТ Сгонник, US 35090; TA 45802 2022-01-18

//ДИТ Авдеева В.С. 47090 11.04.2022 Начало
Процедура УстановитьВыполнениеЗафиксировано(Источник) Экспорт  
	//ДИТ, Беляев СЮ, Ticket#0290209, 27-10-2022, начало
	МетаданныеИсточника = Источник.Метаданные();
	Если МетаданныеИсточника.Реквизиты.Найти("ПримененныйМаршрут") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//ДИТ, Беляев СЮ, Ticket#0290209, 27-10-2022, конец
	
	СсылкаНаОбъект = Источник.Ссылка;
	
	//Евросиб Каблов 13.01.2022 ( 62514
	//Если Источник.ПримененныйМаршрут <> СсылкаНаОбъект.ПримененныйМаршрут Тогда
	//	Возврат;
	//КонецЕсли;
	ПрименениеМаршрута = Источник.ДополнительныеСвойства.Свойство("ПрименениеМаршрута");
	Если ПрименениеМаршрута Тогда
		Источник.ДополнительныеСвойства.Удалить("ПрименениеМаршрута");
		Возврат;
	КонецЕсли;
	
	Если Источник.ПримененныйМаршрут <> СсылкаНаОбъект.ПримененныйМаршрут И Не Источник.ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	//Евросиб Каблов 13.01.2022 )
		 
	
	Запрос = Новый Запрос;
	//Евросиб Каблов 13.01.2022 ( 62514
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ТаблицаСостояний.Состояние КАК Состояние,
	//|	ТаблицаСостояний.Статус КАК Статус,
	//|	Состояния.ВариантПерезапуска КАК ВариантПерезапуска,
	//|	Состояния.ПроверяемыеПараметры КАК ПроверяемыеПараметры
	//|ИЗ
	//|	Справочник.ДоговорыКонтрагентов.Состояния КАК ТаблицаСостояний
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Состояния КАК Состояния
	//|		ПО ТаблицаСостояний.Состояние = Состояния.Ссылка
	//|ГДЕ
	//|	ТаблицаСостояний.Ссылка = &Ссылка";         
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостоянияВОбъекте.Состояние КАК Состояние,
	|	СостоянияВОбъекте.Статус КАК Статус
	|ПОМЕСТИТЬ ВТСостоянияВОбъекте
	|ИЗ
	|	&ТЗСостоянияВОбъекте КАК СостоянияВОбъекте
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСостояний.Состояние КАК Состояние,
	|	ТаблицаСостояний.Статус КАК Статус,
	|	Состояния.ВариантПерезапуска КАК ВариантПерезапуска,
	|	Состояния.ПроверяемыеПараметры КАК ПроверяемыеПараметры
	|ПОМЕСТИТЬ ЗаписанныеСостояния
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов.Состояния КАК ТаблицаСостояний
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Состояния КАК Состояния
	|		ПО ТаблицаСостояний.Состояние = Состояния.Ссылка
	|ГДЕ
	|	ТаблицаСостояний.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Состояния.Ссылка КАК Состояние,
	|	ВТСостоянияВОбъекте.Статус КАК Статус,
	|	Состояния.ВариантПерезапуска КАК ВариантПерезапуска,
	|	Состояния.ПроверяемыеПараметры КАК ПроверяемыеПараметры
	|ПОМЕСТИТЬ СостоянияВОбъекте
	|ИЗ
	|	ВТСостоянияВОбъекте КАК ВТСостоянияВОбъекте
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Состояния КАК Состояния
	|		ПО ВТСостоянияВОбъекте.Состояние = Состояния.Ссылка
	|ГДЕ
	|	Состояния.ВариантПерезапуска = &НикогдаНеПерезапускать
	|	И ВТСостоянияВОбъекте.Статус = &Выполнено
	|	И НЕ ВТСостоянияВОбъекте.Состояние В
	|				(ВЫБРАТЬ
	|					ЗаписанныеСостояния.Состояние КАК Состояние
	|				ИЗ
	|					ЗаписанныеСостояния КАК ЗаписанныеСостояния
	|				ГДЕ
	|					ЗаписанныеСостояния.Статус <> &Выполнено
	|					И ЗаписанныеСостояния.Состояние.ВариантПерезапуска = &НикогдаНеПерезапускать)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаписанныеСостояния.Состояние КАК Состояние,
	|	ЗаписанныеСостояния.Статус КАК Статус,
	|	ЗаписанныеСостояния.ВариантПерезапуска КАК ВариантПерезапуска,
	|	ЗаписанныеСостояния.ПроверяемыеПараметры КАК ПроверяемыеПараметры
	|ИЗ
	|	ЗаписанныеСостояния КАК ЗаписанныеСостояния
	|ГДЕ
	|	НЕ ЗаписанныеСостояния.Состояние В
	|				(ВЫБРАТЬ
	|					СостоянияВОбъекте.Состояние КАК Состояние
	|				ИЗ
	|					СостоянияВОбъекте КАК СостоянияВОбъекте)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СостоянияВОбъекте.Состояние,
	|	СостоянияВОбъекте.Статус,
	|	СостоянияВОбъекте.ВариантПерезапуска,
	|	СостоянияВОбъекте.ПроверяемыеПараметры
	|ИЗ
	|	СостоянияВОбъекте КАК СостоянияВОбъекте";
	
	Запрос.УстановитьПараметр("ТЗСостоянияВОбъекте", Источник.Состояния.Выгрузить());
	Запрос.УстановитьПараметр("НикогдаНеПерезапускать", Перечисления.ВариантыПерезапускаЗадачи.НикогдаНеПерезапускать);
	Запрос.УстановитьПараметр("Выполнено", Перечисления.СтатусыЭтапов.Выполнен);
	
	ВозвращаемыеЗадачи = Неопределено;
	Если Не Источник.ДополнительныеСвойства.Свойство("ВозвращаемыеЗадачи", ВозвращаемыеЗадачи) Тогда
		ВозвращаемыеЗадачи = Новый Массив;
	КонецЕсли;
	//Евросиб Каблов 13.01.2022 )
	
	ПолноеИмяОбъекта = СсылкаНаОбъект.Метаданные().ПолноеИмя();

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.ДоговорыКонтрагентов", ПолноеИмяОбъекта);
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);

	СтатусВыполнен = Перечисления.СтатусыЭтапов.Выполнен;
	
	ТЗСостоянийВБазе = Запрос.Выполнить().Выгрузить(); 
	
	Для Каждого Стр Из Источник.Состояния Цикл
		
		//Евросиб Каблов 13.01.2022 ( 62514
		Если ВозвращаемыеЗадачи.Найти(Стр.Состояние) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		//Евросиб Каблов 13.01.2022 )
		
		Отбор = Новый Структура("Состояние", Стр.Состояние);  
		
		НайденныеСтроки = ТЗСостоянийВБазе.НайтиСтроки(Отбор);
		
		Если Не ЗначениеЗаполнено(НайденныеСтроки) Тогда
			Продолжить;
		КонецЕсли;    
		
		СтрокаСостоянияВБазе = НайденныеСтроки[0];  
		
		Если Не (СтрокаСостоянияВБазе.Статус = СтатусВыполнен 
			Или Стр.Статус = СтатусВыполнен) Тогда
			Продолжить;
		КонецЕсли;
		
		ВариантПерезапуска = СтрокаСостоянияВБазе.ВариантПерезапуска;  
		
		ВыполнениеЗафиксировано = Ложь; 
		ТекстШаблона = "";   
		ДобавитьНе = Ложь;
		
		Если ВариантПерезапуска = Перечисления.ВариантыПерезапускаЗадачи.НикогдаНеПерезапускать Тогда
			ВыполнениеЗафиксировано = Истина;
		ИначеЕсли ВариантПерезапуска = Перечисления.ВариантыПерезапускаЗадачи.ПерезапускатьПриИзмененииПараметров Тогда 
			ТекстШаблона = "Источник.%1 <> СсылкаНаОбъект.%1";	  
			ДобавитьНе = Истина;
		ИначеЕсли ВариантПерезапуска = Перечисления.ВариантыПерезапускаЗадачи.ПерезапускатьПриНезаполненныхПараметрах Тогда 
			ТекстШаблона = "ЗначениеЗаполнено(Источник.%1)";	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекстШаблона) Тогда
			
			РазделительИ = ";";
			РазделительИли = "/";
			Операция = "";
			ИтоговоеУсловие = "";
			
			ПроверяемыеПараметры = СокрЛП(СтрокаСостоянияВБазе.ПроверяемыеПараметры);
			ПозицияИ = СтрНайти(ПроверяемыеПараметры, РазделительИ);
			ПозицияИли = СтрНайти(ПроверяемыеПараметры, РазделительИли); 
			
			Если ЗначениеЗаполнено(ПозицияИ) И ЗначениеЗаполнено(ПозицияИли) Тогда 
				Позиция = Мин(ПозицияИ, ПозицияИли);
			Иначе
				Позиция = Макс(ПозицияИ, ПозицияИли);
			КонецЕсли; 
			
			Пока Позиция > 0 Цикл
				Подстрока = СокрЛП(Лев(ПроверяемыеПараметры, Позиция - 1));        
				
				Если ЗначениеЗаполнено(Подстрока) Тогда 
					Условие = СтрШаблон(ТекстШаблона, Подстрока);
					ИтоговоеУсловие = ИтоговоеУсловие + Операция + Условие;     
				КонецЕсли;
				Операция = ?(ПозицияИ = Позиция, " И ", " ИЛИ "); 

				ПроверяемыеПараметры = Сред(ПроверяемыеПараметры, Позиция + 1);
				ПозицияИ = СтрНайти(ПроверяемыеПараметры, РазделительИ);
				ПозицияИли = СтрНайти(ПроверяемыеПараметры, РазделительИли); 
				Если ЗначениеЗаполнено(ПозицияИ) И ЗначениеЗаполнено(ПозицияИли) Тогда 
					Позиция = Мин(ПозицияИ, ПозицияИли);
				Иначе
					Позиция = Макс(ПозицияИ, ПозицияИли);
				КонецЕсли;

			КонецЦикла;    
			
			Если Позиция = 0 Тогда
				ИтоговоеУсловие = ИтоговоеУсловие + Операция + СтрШаблон(ТекстШаблона, ПроверяемыеПараметры);
			КонецЕсли;
			
			// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 15.12.2022
		    // !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
			// Решение временное, согласовано с Яной Гудковой 15.12.2022г.
			// т.к. механизм изначально не предусматривает проверку табличных частей.
			// На текущий момент нет необходимости проверять табличные части других 
			// объектов, кроме как в договорах ТЧ "Ответственные".
			// Возможно в дальнейшем будет развитие механизма.
			// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
			Если ТипЗнч(Источник) = Тип("СправочникОбъект.ДоговорыКонтрагентов")  
				Или ТипЗнч(Источник) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда // при необходимости, для совместимости будет изменена переменная "ИтоговоеУсловие"
				МассивВозможныхПолей = Новый Массив;
				МассивВозможныхПолей.Добавить("ОтветственныйЗаСопровождениеНСК");
				МассивВозможныхПолей.Добавить("ОтветственныйЗаУчетНСК");
				МассивВозможныхПолей.Добавить("ОтветственныйЗаСопровождение");
				МассивВозможныхПолей.Добавить("ОтветственныйЗаУчет");
				
				ОсновнойЦФО 					= Справочники.ЦентрыФинансовойОтветственности.ОсновнойЦФО;
				ТерминалНовосибирск 			= Справочники.ЦентрыФинансовойОтветственности.ТерминалНовосибирск;	
				ОтветственныйЗаУчет 			= Перечисления.ТипыОтветственных.ОтветственныйЗаУчет;
				ОтветственныйЗаСопровождение 	= Перечисления.ТипыОтветственных.ОтветственныйЗаСопровождение;
				
				Для Каждого СтрМассивВозможныхПолей Из МассивВозможныхПолей Цикл  
					Если СтрНайти(ИтоговоеУсловие,СтрМассивВозможныхПолей) <> 0 Тогда
						Если СтрМассивВозможныхПолей = "ОтветственныйЗаУчет" Тогда 
							ЦФО = ОсновнойЦФО;
							ТипОтветственного = ОтветственныйЗаУчет;
						ИначеЕсли СтрМассивВозможныхПолей = "ОтветственныйЗаУчетНСК" Тогда 
							ЦФО = ТерминалНовосибирск;
							ТипОтветственного = ОтветственныйЗаУчет; 
						ИначеЕсли СтрМассивВозможныхПолей = "ОтветственныйЗаСопровождение" Тогда
							ЦФО = ОсновнойЦФО;
                            ТипОтветственного = ОтветственныйЗаСопровождение; 
						ИначеЕсли СтрМассивВозможныхПолей = "ОтветственныйЗаСопровождениеНСК" Тогда
							ЦФО = ТерминалНовосибирск;
							ТипОтветственного = ОтветственныйЗаСопровождение; 
						КонецЕсли;	 
						Отбор = Новый Структура("Договор,ЦФО,ТипОтветственного",Источник,ЦФО,ТипОтветственного);
						СтрокаДляЗамены = ЗначениеЗаполнено(Справочники.ДоговорыКонтрагентов.ПолучитьОтветственного(Отбор));
						ИтоговоеУсловие = СтрЗаменить(ИтоговоеУсловие,СтрШаблон("ЗначениеЗаполнено(Источник.%1)",СтрМассивВозможныхПолей),Формат(СтрокаДляЗамены,"БЛ=Ложь; БИ=Истина"));
					КонецЕсли;
				КонецЦикла;	
			КонецЕсли;	
			// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 15.12.2022
			
			Если ЗначениеЗаполнено(ИтоговоеУсловие) Тогда      
				ВыполнениеЗафиксировано = Вычислить(ИтоговоеУсловие);
				Если ДобавитьНе Тогда 
					ВыполнениеЗафиксировано = Не ВыполнениеЗафиксировано;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
		
		Стр.ВыполнениеЗафиксировано = ВыполнениеЗафиксировано;
		
	КонецЦикла;	

КонецПроцедуры //ДИТ Авдеева В.С. 47090 11.04.2022 Конец  

//ДИТ Авдеева В.С. 47090 11.04.2022 Начало
Процедура ПостобработкаВыполненныхЗадач(Источник) Экспорт  
	//ДИТ, Беляев СЮ, Ticket#0290209, 27-10-2022, начало
	МетаданныеИсточника = Источник.Метаданные();
	Если МетаданныеИсточника.Реквизиты.Найти("ПримененныйМаршрут") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//ДИТ, Беляев СЮ, Ticket#0290209, 27-10-2022, конец
	
	СсылкаНаОбъект = Источник.Ссылка;

	Если Источник.ПримененныйМаршрут <> СсылкаНаОбъект.ПримененныйМаршрут Тогда       
		Возврат;
	КонецЕсли; 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаСостояний.Состояние КАК Состояние,
	|	ТаблицаСостояний.Статус КАК Статус,
	|	ТаблицаСостояний.ВыполнениеЗафиксировано КАК ВыполнениеЗафиксировано
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов.Состояния КАК ТаблицаСостояний
	|ГДЕ
	|	ТаблицаСостояний.Ссылка = &Ссылка
	|	И ТаблицаСостояний.Статус = &Статус";         
	
	ПолноеИмяОбъекта = СсылкаНаОбъект.Метаданные().ПолноеИмя();

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.ДоговорыКонтрагентов", ПолноеИмяОбъекта);
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЭтапов.Выполнен);
	
	ТЗСостоянийВБазе = Запрос.Выполнить().Выгрузить();  
	
	ПерваяСтрока = Истина;           
	
	УстановитьСледСтрокеСтатус = Перечисления.СтатусыЭтапов.ПустаяСсылка();
	
	Для Каждого Стр Из Источник.Состояния Цикл  
		
		Отбор = Новый Структура("Состояние", Стр.Состояние);  
		
		НайденныеСтроки = ТЗСостоянийВБазе.НайтиСтроки(Отбор);
		
		Если ЗначениеЗаполнено(НайденныеСтроки) 
			И Стр.ВыполнениеЗафиксировано Тогда
			СтрокаСостоянияВБазе = НайденныеСтроки[0]; 
			
			Если Стр.Статус <> СтрокаСостоянияВБазе.Статус И ПерваяСтрока Тогда 
				УстановитьСледСтрокеСтатус = Стр.Статус; 
			КонецЕсли;
			ПерваяСтрока = Ложь;  
			
			Стр.Статус = СтрокаСостоянияВБазе.Статус;
			Стр.ВыполнениеЗафиксировано = Истина;
			
		Иначе
			Если ЗначениеЗаполнено(УстановитьСледСтрокеСтатус)  Тогда  
				Стр.Статус = УстановитьСледСтрокеСтатус;     
				УстановитьСледСтрокеСтатус = Перечисления.СтатусыЭтапов.ПустаяСсылка(); 
			КонецЕсли;
		КонецЕсли;    
		
		
	КонецЦикла;	

	
КонецПроцедуры //ДИТ Авдеева В.С. 47090 11.04.2022 Конец

//Евросиб Каблов 11.04.2022 Task 45430 
Процедура ОтметитьВыполнениеЗадач(Объект, ЗадачиДляОтметкиВыполнения = Неопределено) Экспорт
	
	СтатусВыполнен = Перечисления.СтатусыЭтапов.Выполнен;
	СтатусОтклонен = Перечисления.СтатусыЭтапов.Отклонен;
	
	ДатаВыполнения = ТекущаяДата();
	
	Если ЗадачиДляОтметкиВыполнения = Неопределено Тогда
		Для Каждого СтрокаТЧ Из Объект.Состояния Цикл
			Если СтрокаТЧ.Статус <> СтатусВыполнен И СтрокаТЧ.Статус <> СтатусОтклонен Тогда
				СтрокаТЧ.Статус = СтатусВыполнен;
				СтрокаТЧ.ЗавершениеРаботы = ДатаВыполнения;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого СтрокаТЧ Из Объект.Состояния Цикл
			Если ЗадачиДляОтметкиВыполнения.Найти(СтрокаТЧ.Состояние) <> Неопределено И СтрокаТЧ.Статус <> СтатусВыполнен И СтрокаТЧ.Статус <> СтатусОтклонен Тогда
				СтрокаТЧ.Статус = СтатусВыполнен;
				СтрокаТЧ.ЗавершениеРаботы = ДатаВыполнения;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
//)
//Евросиб - АСуслов 20.03.2023 14:19:45 #67067

//Евросиб Каблов 29.08.2022 56025
Процедура ОтметитьВыполнениеЗадачПоСсылке(Ссылка, ЗадачиДляОтметкиВыполнения = Неопределено) Экспорт
	
	Объект = Ссылка.ПолучитьОбъект();
	ОтметитьВыполнениеЗадач(Объект, ЗадачиДляОтметкиВыполнения);
	
	Если Объект.Модифицированность() Тогда
		//ДИТ Шевченко А.В. BUG 75898 TA 75908 10.10.2023
		Объект.ДополнительныеСвойства.Вставить("ЭтоЗакрытиеЗадач");
		//ДИТ Шевченко А.В. BUG 75898 TA 75908 10.10.2023
		Объект.Записать();
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Каблов 26.12.2022 62514
Процедура УстановитьСтатусыЗадачПоОснованию(Объект, Основание) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостоянияОбъекта.Состояние КАК Состояние,
	|	СостоянияОбъекта.Статус КАК Статус
	|ИЗ
	|	Документ.Заявка.Состояния КАК СостоянияОбъекта
	|ГДЕ
	|	СостоянияОбъекта.Ссылка = &Ссылка
	|	И СостоянияОбъекта.Состояние.ОтмечатьВыполнениеВРодительскомДокументеАвтоматически
	|	И СостоянияОбъекта.Состояние <> &СостояниеВводЗаявкиВыборРейса";
	
	ПолноеИмяОбъекта = Объект.Метаданные().ПолноеИмя();
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Заявка", ПолноеИмяОбъекта);
	
	Запрос.УстановитьПараметр("Ссылка", Основание);
	Запрос.УстановитьПараметр("СостояниеВводЗаявкиВыборРейса", Справочники.Состояния.ВводЗаявкиВыборРейса);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаСостояния = Объект.Состояния.Найти(Выборка.Состояние, "Состояние");
		Если СтрокаСостояния <> Неопределено Тогда
			СтрокаСостояния.Статус = Выборка.Статус;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

//Евросиб Коханенко Н.А. #61823 28.12.2022 ( 
Процедура ТребуетсяЗаполнитьРейс() Экспорт 
	
	// ДИТ BUG 83426 ТА 83584 Сержантова А.С. Начало: 12.04.2024
	ТекущееРегЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ТребуетсяЗаполнитьРейс);
	ДатаНачалаОбработки = ТекущееРегЗадание.Расписание.ДатаНачала;
	Если Не ЗначениеЗаполнено(ДатаНачалаОбработки) Тогда
		ДатаНачалаОбработки = НачалоДня(ТекущаяДата());
	КонецЕсли;
	// ДИТ BUG 83426 ТА 83584 Сержантова А.С. Конец: 12.04.2024

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	заявки.Ссылка КАК Заявка,  
		|	заявкасостояния.Исполнитель КАК Исполнитель,
		// ДИТ BUG 83426 ТА 83584 Сержантова А.С. Начало: 10.04.2024 - Исполнитель может быть группой пользователей
		// Было:
		//|	Пользователи.Недействителен КАК Недействителен, 
		//|	Пользователи.ЦФО КАК ЦФО,
		//Стало:
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(заявкаСостояния.Исполнитель) = ЗНАЧЕНИЕ(Справочник.ГруппыПользователей)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ЕСТЬNULL(Пользователи.Недействителен, ИСТИНА)
		|	КОНЕЦ КАК Недействителен,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(заявкаСостояния.Исполнитель) = ЗНАЧЕНИЕ(Справочник.ГруппыПользователей)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка)
		|		ИНАЧЕ ЕСТЬNULL(Пользователи.ЦФО, ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка))
		|	КОНЕЦ КАК ЦФО,
		// ДИТ BUG 83426 ТА 83584 Сержантова А.С. Конец: 10.04.2024
		|	заявки.Договор КАК Договор
		|ИЗ
		|	Документ.Сделка.Заявки КАК СделкаЗаявки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК заявки
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.Состояния КАК заявкасостояния
		|			ПО заявки.Ссылка = заявкасостояния.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.ПереченьРейсов КАК заявкаПереченьрейсов
		|			ПО заявки.Ссылка = заявкаПереченьрейсов.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|			ПО (заявкасостояния.Исполнитель = Пользователи.Ссылка)
		|		ПО СделкаЗаявки.Заявка = заявки.Ссылка
		|ГДЕ
		|	заявкасостояния.НомерСтроки = 1 
		// ДИТ BUG 83426 ТА 83584 Сержантова А.С. Начало: 12.04.2024
		|	И заявки.Создано >= &ДатаНачалаОбработки
		// ДИТ BUG 83426 ТА 83584 Сержантова А.С. Конец: 12.04.2024
		|	И СделкаЗаявки.Ссылка.Проведен
		|	И (заявкаПереченьрейсов.Рейс ЕСТЬ NULL
		|			ИЛИ ВЫРАЗИТЬ(заявкаПереченьрейсов.Рейс КАК Справочник.РейсыЖД).РейсОтменен)";
	// ДИТ BUG 83426 ТА 83584 Сержантова А.С. Начало: 12.04.2024
	Запрос.УстановитьПараметр("ДатаНачалаОбработки", ДатаНачалаОбработки);
	// ДИТ BUG 83426 ТА 83584 Сержантова А.С. Конец: 12.04.2024
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗадачи = РезультатЗапроса.Выбрать(); 
	
	Пока ВыборкаЗадачи.Следующий() Цикл
		
		Заявка = ВыборкаЗадачи.Заявка;
		Состояние = Справочники.Состояния.ТребуетсяЗаполнитьРейс; 
		
		// разберемся, не уволен ли исполнитель
		Если ВыборкаЗадачи.Исполнитель = Неопределено ИЛИ ВыборкаЗадачи.Недействителен Тогда
			// с исполнителем непорядок, вместо него задачу поручим Ответственному за сопровождение
			Параметры = Новый Структура;
			Параметры.Вставить("Договор", ВыборкаЗадачи.Договор);
			Параметры.Вставить("ЦФО", ВыборкаЗадачи.ЦФО);
			Параметры.Вставить("ТипОтветственного", Перечисления.ТипыОтветственных.ОтветственныйЗаСопровождение);
			Исполнитель = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственного(Параметры);
		Иначе
			//все нормально, исполнитель есть и он работает
			Исполнитель = ВыборкаЗадачи.Исполнитель;
		КонецЕсли; 
		
        // поищем подобную задачу для этой заявки
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаявкаСостояния.Ссылка КАК Ссылка,
			|	ЗаявкаСостояния.Состояние КАК Состояние,
			|	ЗаявкаСостояния.Статус КАК Статус
			|ИЗ
			|	Документ.Заявка.Состояния КАК ЗаявкаСостояния
			|ГДЕ
			|	ЗаявкаСостояния.Ссылка = &Ссылка
			|	И ЗаявкаСостояния.Состояние = &Состояние";
		
		Запрос.УстановитьПараметр("Ссылка", Заявка);
		Запрос.УстановитьПараметр("Состояние", Состояние);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		// если такой задачи нет, то создать
		Если РезультатЗапроса.Пустой() Тогда
			Попытка
				ЗаявкаОбъект = Заявка.ПолучитьОбъект();
				НоваяСтрокаСостояния = ЗаявкаОбъект.Состояния.Добавить();
				НоваяСтрокаСостояния.Состояние = Состояние;
				НоваяСтрокаСостояния.Исполнитель = Исполнитель;
				НоваяСтрокаСостояния.Наблюдатель = Исполнитель;
				НоваяСтрокаСостояния.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
				НоваяСтрокаСостояния.НачалоРаботы = ТекущаяДата(); 
				ЗаявкаОбъект.Записать();
			Исключение
				//ОбщегоНазначения.СообщитьПользователю("Не удалось cоздать или изменить статус задания ""Требуется заполнить рейс"" задание для заявки: " + ВыборкаЗадачи.Номер);
			КонецПопытки;
			// переходим на следующую задачу
			Продолжить;
		КонецЕсли;
		
		// если такая задача есть, то
		ВыборкаСостояния = РезультатЗапроса.Выбрать();
		Пока ВыборкаСостояния.Следующий() Цикл
			Если ВыборкаСостояния.Статус = Перечисления.СтатусыЭтапов.Выполнен Тогда
				ЗаявкаОбъект = Заявка.ПолучитьОбъект();
				// найдем нужную строку в ТЧ и изменим статус
				Для каждого СтрокаСостояния Из ЗаявкаОбъект.Состояния Цикл
					Если СтрокаСостояния.Состояние = Состояние Тогда                     
						СтрокаСостояния.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
						СтрокаСостояния.Исполнитель = Исполнитель;
						СтрокаСостояния.Наблюдатель = Исполнитель;
						Попытка
							ЗаявкаОбъект.Записать(); 
						Исключение
							//ОбщегоНазначения.СообщитьПользователю("Не удалось cоздать или изменить статус задания ""Требуется заполнить рейс"" задание для заявки: " + ВыборкаЗадачи.Номер);
						КонецПопытки;
						// дальше просматривать смысла нет, строка должна быть только одна
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры
//Евросиб Коханенко Н.А. #61823 28.12.2022 )

//Евросиб Каблов 20.01.2022 62514
Функция ВыполнитьПовторнуюМаршрутизациюОбъектаПоСсылке(Ссылка, ДополнительныеПараметры) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Выполнено", Ложь);
	
	Объект = Ссылка.ПолучитьОбъект();
	ПолноеИмяОбъекта = Объект.Метаданные().ПолноеИмя();
	
	ПараметрыЗапроса = ПолучитьПараметрыМаршрутизации(Объект);
	
	Если ПолноеИмяОбъекта = "Справочник.ДоговорыКонтрагентов" Тогда		
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьДоговор(ПараметрыЗапроса, Объект.Дата);
	ИначеЕсли ПолноеИмяОбъекта = "Документ.Букинг" Тогда
		РезультатЗапроса = МаршрутизироватьБукинг(ПараметрыЗапроса, Объект.Дата);
	ИначеЕсли ПолноеИмяОбъекта = "Документ.ЗакрытиеПериода" Тогда
		РезультатЗапроса = МаршрутизироватьЗакрытиеПериода(ПараметрыЗапроса, Объект.Дата);
	ИначеЕсли ПолноеИмяОбъекта = "Документ.Запрос" Тогда
		РезультатЗапроса = МаршрутизироватьЗапрос(ПараметрыЗапроса, Объект.Дата);
	ИначеЕсли ПолноеИмяОбъекта = "Документ.Заявка" Тогда		
		РезультатЗапроса = МаршрутизироватьЗаявку(ПараметрыЗапроса, Объект.Дата);
	ИначеЕсли ПолноеИмяОбъекта = "Документ.Калькуляция" Тогда
		РезультатЗапроса = МаршрутизироватьКалькуляцию(ПараметрыЗапроса, Объект.Дата);
	ИначеЕсли ПолноеИмяОбъекта = "Документ.КорректировкаПоступления" Тогда
		РезультатЗапроса = МаршрутизироватьКорректировкуПоступления(ПараметрыЗапроса, Объект.Дата);
	ИначеЕсли ПолноеИмяОбъекта = "Документ.КорректировкаРеализации" Тогда
		РезультатЗапроса = МаршрутизироватьРТУ(ПараметрыЗапроса, Объект.Дата);
	ИначеЕсли ПолноеИмяОбъекта = "Документ.КредитнаяЗаявка" Тогда
		РезультатЗапроса = МаршрутизироватьКредитнуюЗаявку(ПараметрыЗапроса, Объект.Дата);
	ИначеЕсли ПолноеИмяОбъекта = "Документ.ЛичныеЦели" Тогда
		РезультатЗапроса = МаршрутизироватьЛичныеЦели(ПараметрыЗапроса, Объект.Дата);
	ИначеЕсли ПолноеИмяОбъекта = "Документ.Операция" Тогда
		РезультатЗапроса = МаршрутизироватьОперацию(ПараметрыЗапроса, Объект.Дата);
	ИначеЕсли ПолноеИмяОбъекта = "Документ.ОтчетКомиссионераОПродажах" Тогда
		РезультатЗапроса = МаршрутизироватьОтчетКомиссионера(ПараметрыЗапроса, Объект.Дата);
	ИначеЕсли ПолноеИмяОбъекта = "Документ.ОтчетКомитентуОПродажах" Тогда
		РезультатЗапроса = МаршрутизироватьРТУ(ПараметрыЗапроса, Объект.Дата);
	ИначеЕсли ПолноеИмяОбъекта = "Документ.ПоступлениеНаРасчетныйСчет" Тогда
		РезультатЗапроса = МаршрутизироватьПоступлениеНаРС(ПараметрыЗапроса, Объект.Дата);
	ИначеЕсли ПолноеИмяОбъекта = "Документ.ПоступлениеТоваровУслуг" Тогда
		РезультатЗапроса = МаршрутизироватьПТУ(ПараметрыЗапроса, Объект.Дата);
	ИначеЕсли ПолноеИмяОбъекта = "Документ.ПСЦ" Тогда
		РезультатЗапроса = МаршрутизироватьПСЦ(ПараметрыЗапроса, Объект.Дата);
	//Евросиб Каблов 20.05.2024 ( #67092
	ИначеЕсли ПолноеИмяОбъекта = "Документ.ПСЦПоставщика" Тогда
		РезультатЗапроса = МаршрутизироватьПСЦПоставщика(ПараметрыЗапроса, Объект.Дата);
	//Евросиб Каблов 20.05.2024 )
	// Евросиб US 90342 Рыбьяков К.А. 14.12.2025 ((
	ИначеЕсли ПолноеИмяОбъекта = "Документ.РеестрСпециальныхСтавок" Тогда
		РезультатЗапроса = МаршрутизироватьРеестрСпециальныхСтавок(ПараметрыЗапроса, Объект.Дата);
	// Евросиб Рыбьяков К.А. 14.12.2025 ))
	ИначеЕсли ПолноеИмяОбъекта = "Документ.РеализацияТоваровУслуг" Тогда
		РезультатЗапроса = МаршрутизироватьРТУ(ПараметрыЗапроса, Объект.Дата);
	ИначеЕсли ПолноеИмяОбъекта = "Документ.РелизСобственника" Тогда
		РезультатЗапроса = МаршрутизироватьРелизСобственника(ПараметрыЗапроса, Объект.Дата);
	ИначеЕсли ПолноеИмяОбъекта = "Документ.Сделка" Тогда
		РезультатЗапроса = МаршрутизироватьСделку(ПараметрыЗапроса, Объект.Дата);
	ИначеЕсли ПолноеИмяОбъекта = "Документ.СписаниеСРасчетногоСчета" Тогда
		РезультатЗапроса = МаршрутизироватьСписаниеСРС(ПараметрыЗапроса, Объект.Дата);
	ИначеЕсли ПолноеИмяОбъекта = "Документ.СчетНаОплатуПокупателю" Тогда
		РезультатЗапроса = МаршрутизироватьСчетПокупателю(ПараметрыЗапроса, Объект.Дата);
	ИначеЕсли ПолноеИмяОбъекта = "Документ.СчетНаОплатуПоставщика" Тогда
		РезультатЗапроса = МаршрутизироватьСчетПоставщика(ПараметрыЗапроса, Объект.Дата);
	ИначеЕсли ПолноеИмяОбъекта = "Документ.СчетФактураВыданный" Тогда
		РезультатЗапроса = МаршрутизироватьСФВ(ПараметрыЗапроса, Объект.Дата);
	ИначеЕсли ПолноеИмяОбъекта = "Документ.СчетФактураПолученный" Тогда
		РезультатЗапроса = МаршрутизироватьСФП(ПараметрыЗапроса, Объект.Дата);
	ИначеЕсли ПолноеИмяОбъекта = "Документ.ТранспортныйДокумент" Тогда
		РезультатЗапроса = МаршрутизироватьТД(ПараметрыЗапроса, Объект.Дата);
	Иначе
		РезультатЗапроса = Новый Массив;
	КонецЕсли;
	
	Результат.Вставить("РезультатЗапроса", РезультатЗапроса);
	
	СостоянияДляУказанияИсполнителей = Новый Массив;
	Для каждого Стр из  РезультатЗапроса Цикл
		Исполнитель = Стр.Исполнитель;
		Если НЕ Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Исполнитель) Тогда Исполнитель = Объект.Автор; КонецЕсли;
		Наблюдатель = Стр.Наблюдатель;
		Если НЕ Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Наблюдатель) Тогда Наблюдатель = Объект.Автор; КонецЕсли;
		
		Если Стр.ТребуетсяУказатьИсполнителя ИЛИ Стр.ТребуетсяУказатьНаблюдателя Тогда 
			СостоянияДляУказанияИсполнителей.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель", Стр.Состояние, Исполнитель, Наблюдатель)); 
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СостоянияДляУказанияИсполнителей) Тогда
		Результат.Вставить("СостоянияДляУказанияИсполнителей", СостоянияДляУказанияИсполнителей);
	Иначе
		ПрименитьМаршрутИЗаписатьОбъект(Ссылка, РезультатЗапроса, Новый СписокЗначений, ДополнительныеПараметры);
		Результат.Вставить("Выполнено", Истина);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//Евросиб Каблов 20.01.2022 62514
Процедура ПрименитьМаршрутИЗаписатьОбъект(Ссылка, РезультатЗапроса, УказанныеИсполнители, ДополнительныеПараметры) Экспорт
	
	Объект = Ссылка.ПолучитьОбъект();
	Если РезультатЗапроса.Количество() > 0 Тогда
		
		НачатьТранзакцию();
		
		Автор = Объект.Автор;		
		МаршрутизацияСервер.ПрименитьМаршрут(Объект, РезультатЗапроса, Автор, УказанныеИсполнители);
		Для каждого Стр из  Объект.Состояния Цикл
			Если НЕ ЗначениеЗаполнено(Стр.Исполнитель) Тогда Стр.Исполнитель = Автор; КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Стр.Наблюдатель) Тогда Стр.Наблюдатель = Автор; КонецЕсли;
		КонецЦикла;
		Объект.ДополнительныеСвойства.Вставить("ПрименениеМаршрута", Истина);
		Объект.Записать();
		
		Если ДополнительныеПараметры <> Неопределено Тогда
			Если ДополнительныеПараметры.Свойство("АдресТаблицыСделокПоПСЦДляОбработки") Тогда
				ОбработатьСделкиПоПСЦ(ДополнительныеПараметры.АдресТаблицыСделокПоПСЦДляОбработки);
			КонецЕсли;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Для документа: " + Ссылка + " не найден подходящий маршрут. Изменения не внесены!");
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Каблов 20.01.2022 62514
Функция ПолучитьПараметрыМаршрутизации(Объект) Экспорт
	
	ПолноеИмяОбъекта = Объект.Метаданные().ПолноеИмя();
	
	ПараметрыЗапроса = Новый Соответствие;
	
	Если ПолноеИмяОбъекта = "Справочник.ДоговорыКонтрагентов" Тогда
		
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Владелец);
		ПараметрыЗапроса.Вставить("Договор", Объект.Ссылка);
		
		ПараметрыЗапроса.Вставить("КатегорияДоговора", Объект.КатегорияДоговора);
		ПараметрыЗапроса.Вставить("ТипДоговорнойЗаписи", Объект.ТипДоговорнойЗаписи);
		ПараметрыЗапроса.Вставить("Нетиповой", Не Объект.Типовой);
		ПараметрыЗапроса.Вставить("РегионДоговора", Объект.РегионДоговора);
		ПараметрыЗапроса.Вставить("ВидДоговора", Объект.ВидДоговора);
		ПараметрыЗапроса.Вставить("Валюта", Объект.ВалютаВзаиморасчетов);
		ПараметрыЗапроса.Вставить("ЦФО", Объект.ЦФО);
		ПараметрыЗапроса.Вставить("Нерезидент", (Объект.Владелец.СтранаРегистрации <> Справочники.СтраныМира.Россия));
		ПараметрыЗапроса.Вставить("УсловиеОплаты", Объект.УсловиеОплаты);
		ПараметрыЗапроса.Вставить("Подписан", Объект.Подписан);
		
	ИначеЕсли ПолноеИмяОбъекта = "Документ.Букинг" Тогда
		
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Грузоотправитель);
		ПараметрыЗапроса.Вставить("Договор", Неопределено);
		ПараметрыЗапроса.Вставить("ИсточникЗаявки", Неопределено);
		ПараметрыЗапроса.Вставить("НаМоментЗаписиБылаЗадолженность", Ложь);
		ПараметрыЗапроса.Вставить("ВидПеревозки", Неопределено);
		ПараметрыЗапроса.Вставить("ПротоколНеУказан", Истина);
		
	ИначеЕсли ПолноеИмяОбъекта = "Документ.ЗакрытиеПериода" Тогда
		
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		
	ИначеЕсли ПолноеИмяОбъекта = "Документ.Запрос" Тогда
		
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыЗапроса.Вставить("Договор", Объект.Договор);
		ПараметрыЗапроса.Вставить("Резидент", Объект.Резидент);
		ПараметрыЗапроса.Вставить("ИсточникЗапроса", Объект.ИсточникЗапроса);
		ПараметрыЗапроса.Вставить("ВидПеревозки", Объект.ВидПеревозки);
		
	ИначеЕсли ПолноеИмяОбъекта = "Документ.Заявка" Тогда
		
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыЗапроса.Вставить("Договор", Объект.Договор);
		ПараметрыЗапроса.Вставить("ИсточникЗаявки", Объект.ИсточникЗаявки);
		ПараметрыЗапроса.Вставить("НаМоментЗаписиБылаЗадолженность", Объект.НаМоментЗаписиБылаЗадолженность);
		ПараметрыЗапроса.Вставить("ВидПеревозки", Объект.ВидПеревозки);
		ПараметрыЗапроса.Вставить("ПротоколНеУказан",НЕ ЗначениеЗаполнено(Объект.ПСЦ));
		ПараметрыЗапроса.Вставить("ЗапросНаКТК", Объект.ЗапросНаКТК);
		// Евросиб US 114823 TA 116919 Рыбьяков К.А. 17.08.2025 ((
		ПараметрыЗапроса.Вставить("ВнутреннийСтатусЗапроса", Объект.ВнутреннийСтатусЗапроса);
		ПараметрыЗапроса.Вставить("Редактор", Объект.Редактор);
		// Евросиб Рыбьяков К.А. 17.08.2025 ))
		// Евросиб US 126930 TA 126932 Рыбьяков К.А. 19.01.2026 ((
		ПараметрыЗапроса.Вставить("ЛокацииВыдачи", Объект.СписокЗапросНаКТК.ВыгрузитьКолонку("ЛокацияВыдачи"));
		// Евросиб Рыбьяков К.А. 19.01.2026 ))
		
	ИначеЕсли ПолноеИмяОбъекта = "Документ.Калькуляция" Тогда
		
		ПроцДоходности = 0;
		Если Объект.ММ_ИтогоРентабельность <> 0 Тогда
			ПроцДоходности = Объект.ММ_ИтогоРентабельность;
		КонецЕсли;
		Если Объект.ММ_ИтогоРентабельность20 <> 0 И Объект.ММ_ИтогоРентабельность20 < Объект.ММ_ИтогоРентабельность Тогда
			ПроцДоходности = Объект.ММ_ИтогоРентабельность20;
		КонецЕсли;		
		
		МаршрутизацияДействующегоКлиента = Ложь;
		Если ЗначениеЗаполнено(Объект.КалькуляцияСозданаНаОсновании) Тогда
			МаршрутизацияДействующегоКлиента = Документы.Калькуляция.ЭтоМаршрутизацияДействующегоКлиента(Объект);
		КонецЕсли;
		
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("МинимальныйПроцентДоходности", ПроцДоходности);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыЗапроса.Вставить("Договор", Объект.Договор);
		ПараметрыЗапроса.Вставить("ВидПеревозки", Объект.ПС_ВидПеревозки);
		ПараметрыЗапроса.Вставить("ТипКалькуляции", Объект.ТипКалькуляции);
		ПараметрыЗапроса.Вставить("ДействующийКлиент", МаршрутизацияДействующегоКлиента);
		
	ИначеЕсли ПолноеИмяОбъекта = "Документ.КорректировкаПоступления" Тогда
		
		Услуги = Объект.Услуги.Выгрузить();
	
		ВсегоДоКорректировки 	= ?(Услуги.Итог("ВсегоДоКорректировки") = 0, Услуги.Итог("ВсегоДоИзменения"), Услуги.Итог("ВсегоДоКорректировки"));
		ВсегоПослеКорректировки = Услуги.Итог("Всего");	
		СуммаКорректировки 		= ВсегоПослеКорректировки - ВсегоДоКорректировки;
		
		ПараметрыЗапроса.Вставить("Организация", 			Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", 			Объект.Контрагент);
		ПараметрыЗапроса.Вставить("Договор", 				Объект.ДоговорКонтрагента);
		ПараметрыЗапроса.Вставить("ОбъектМаршрутизации",	Объект.Ссылка);
		ПараметрыЗапроса.Вставить("Штраф", 					Объект.Штраф);
		ПараметрыЗапроса.Вставить("Копия", 					Объект.Копия);
		ПараметрыЗапроса.Вставить("ЦФО", 					Объект.ЦФО);
		ПараметрыЗапроса.Вставить("СуммаДокумента", 		СуммаКорректировки / Объект.КратностьВзаиморасчетов * Объект.КурсВзаиморасчетов);
		ПараметрыЗапроса.Вставить("ВидУслуг", Объект.ВидУслуг);
	
	ИначеЕсли ПолноеИмяОбъекта = "Документ.КорректировкаРеализации" Тогда
		
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыЗапроса.Вставить("Договор", Объект.ДоговорКонтрагента);
		ПараметрыЗапроса.Вставить("ЭДО", Обработки.ДД_подключаемыйМодуль.ЕстьЭДОСКонтрагентом(Объект.Контрагент));
		ПараметрыЗапроса.Вставить("ЦФО", Объект.ЦФО);
		ПараметрыЗапроса.Вставить("ОплатаОригинал", Объект.ДоговорКонтрагента.ОплатаПоОригиналу);
		
	ИначеЕсли ПолноеИмяОбъекта = "Документ.КредитнаяЗаявка" Тогда
		
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыЗапроса.Вставить("ДоговорКонтрагента", Объект.ДоговорКонтрагента);
		ПараметрыЗапроса.Вставить("ЦФО", Объект.ЦФО);
		ПараметрыЗапроса.Вставить("ЛимитДЗ_Факт", Объект.ЛимитДЗ_Факт);
		
	ИначеЕсли ПолноеИмяОбъекта = "Документ.ЛичныеЦели" Тогда
		
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("СубъектЛичнойЦели", Объект.Сотрудник);
		
	ИначеЕсли ПолноеИмяОбъекта = "Документ.Операция" Тогда
		
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Поставщик);
		ПараметрыЗапроса.Вставить("Договор", Объект.Договор);
		ПараметрыЗапроса.Вставить("ВидОперации", Объект.Услуга);
		ПараметрыЗапроса.Вставить("ВидПеревозки", Объект.ВидПеревозки);
		
	ИначеЕсли ПолноеИмяОбъекта = "Документ.ОтчетКомиссионераОПродажах" Тогда
		
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыЗапроса.Вставить("Договор", Объект.ДоговорКонтрагента);
		
	ИначеЕсли ПолноеИмяОбъекта = "Документ.ОтчетКомитентуОПродажах" Тогда
		
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыЗапроса.Вставить("Договор", Объект.ДоговорКонтрагента);
		ПараметрыЗапроса.Вставить("ЭДО", Обработки.ДД_подключаемыйМодуль.ЕстьЭДОСКонтрагентом(Объект.Контрагент));
		ПараметрыЗапроса.Вставить("ЦФО", Объект.ЦФО);
		ПараметрыЗапроса.Вставить("ОплатаОригинал", Объект.ДоговорКонтрагента.ОплатаПоОригиналу);
		
	ИначеЕсли ПолноеИмяОбъекта = "Документ.ПоступлениеНаРасчетныйСчет" Тогда
		
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыЗапроса.Вставить("Договор", Объект.ДоговорКонтрагента);
		ПараметрыЗапроса.Вставить("ЦФО", Объект.ЦФО);
		ПараметрыЗапроса.Вставить("УспешноРазнесенаВсяСумма", Объект.УспешноРазнесенаВсяСумма);
		
	ИначеЕсли ПолноеИмяОбъекта = "Документ.ПоступлениеТоваровУслуг" Тогда
		
		ПараметрыЗапроса.Вставить("ОбъектМаршрутизации", Объект.Ссылка);
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыЗапроса.Вставить("Договор", Объект.ДоговорКонтрагента);
		ПараметрыЗапроса.Вставить("Штраф", Объект.Штраф);
		ПараметрыЗапроса.Вставить("Копия", Объект.Копия);
		ПараметрыЗапроса.Вставить("ЦФО", Объект.ЦФО); 
		ПараметрыЗапроса.Вставить("Автор", Объект.Автор);
		ПараметрыЗапроса.Вставить("Дата", Объект.Дата);
		ПараметрыЗапроса.Вставить("Претензия", Объект.Претензия);
		ПараметрыЗапроса.Вставить("ПолнаяСуммаВСФ", Объект.ПолнаяСуммаВСФ);
		ПараметрыЗапроса.Вставить("ВидУслуг", Объект.ВидУслуг);
		
	ИначеЕсли ПолноеИмяОбъекта = "Документ.ПСЦ" Тогда
		
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыЗапроса.Вставить("Договор", Объект.Договор);
		ПараметрыЗапроса.Вставить("Валюта", Объект.Валюта);
		ПараметрыЗапроса.Вставить("СодержитВР", Объект.СодержитВР);
		ПараметрыЗапроса.Вставить("ПротоколНаДоплатныеКТК", Объект.ПротоколНаДоплатныеКТК);
		ПараметрыЗапроса.Вставить("ВидПеревозки", Объект.ВидПеревозки);
		ПараметрыЗапроса.Вставить("ВидПСЦ", Объект.ВидПСЦ);
		ПараметрыЗапроса.Вставить("СогласованоВDV", Объект.СогласованоВDV);
		ПараметрыЗапроса.Вставить("Нетиповой", Объект.НетиповойПротокол);
		ПараметрыЗапроса.Вставить("Нерезидент", Справочники.Контрагенты.КонтрагентНерезидент(Объект.Контрагент));
		ПараметрыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Договор, "ВидДоговора, КатегорияДоговора");
		ПараметрыЗапроса.Вставить("ВидДоговора", ПараметрыДоговора.ВидДоговора);
		ПараметрыЗапроса.Вставить("КатегорияДоговора", ПараметрыДоговора.КатегорияДоговора);
		ПараметрыЗапроса.Вставить("ЦФО", Объект.ЦФО);
		ПараметрыЗапроса.Вставить("Фрахт", Объект.ПСЦПоставщикаФрахт);
		ПараметрыЗапроса.Вставить("КатегорияУслуг", Объект.КатегорияУслуг);
		ПараметрыЗапроса.Вставить("МестоОказанияУслуг", Объект.МестоОказанияУслуг);
		ПараметрыЗапроса.Вставить("ТипКалькуляции", Объект.ТипКалькуляции);
		//ДИТ, Беляев СЮ, US 80865/TA 80877, 12-02-2024, начало
		ПараметрыЗапроса.Вставить("Поручение", Объект.Поручение);
		//ДИТ, Беляев СЮ, US 80865/TA 80877, 12-02-2024, конец
		//Евросиб Коханенко Н.А. 11.12.2024 (( #88818 
		ПараметрыЗапроса.Вставить("Нотис", Объект.Нотис);
		//Евросиб Коханенко Н.А. 11.12.2024 )) #88818 
		
	ИначеЕсли ПолноеИмяОбъекта = "Документ.РеализацияТоваровУслуг" Тогда
		
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыЗапроса.Вставить("Договор", Объект.ДоговорКонтрагента);
		ПараметрыЗапроса.Вставить("ЭДО", Обработки.ДД_подключаемыйМодуль.ЕстьЭДОСКонтрагентом(Объект.Контрагент));
		ПараметрыЗапроса.Вставить("ЦФО", Объект.ЦФО);
		ПараметрыЗапроса.Вставить("ОплатаОригинал", Объект.ДоговорКонтрагента.ОплатаПоОригиналу);
		ПараметрыЗапроса.Вставить("ДатаДокументаИзменена", Ложь);		
		
	ИначеЕсли ПолноеИмяОбъекта = "Документ.РелизСобственника" Тогда
		
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыЗапроса.Вставить("Договор", Объект.Договор);
		ПараметрыЗапроса.Вставить("ЦФО", Объект.ЦФО);
		ПараметрыЗапроса.Вставить("КолвоРелизКлиентаНеСовпадаетТипоразмерКТК", Объект.КолвоРелизКлиентаНеСовпадаетТипоразмерКТК);
		ПараметрыЗапроса.Вставить("КолвоРелизКлиентаНоваяЗаписьКТК", Объект.КолвоРелизКлиентаНоваяЗаписьКТК);
	
	ИначеЕсли ПолноеИмяОбъекта = "Документ.Сделка" Тогда
		
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("МаршрутизируемыйОбъект", Объект.Ссылка);
		
		ОплатаПоОригиналу = Документы.Сделка.ПолучитьПризнакОплатаПоОригиналу(Объект);
		ПараметрыЗапроса.Вставить("ОплатаПоОригиналу", ОплатаПоОригиналу);
		ПараметрыЗапроса.Вставить("ПодсылПорожних", Объект.ПодсылПорожних);
		ПараметрыЗапроса.Вставить("ПовагонныеОтправки", Объект.ПовагонныеОтправки);
		ПараметрыЗапроса.Вставить("ОтветственныйПоСделке", "НЕТ");
		ПараметрыЗапроса.Вставить("СлужебнаяСделка", Объект.Служебная);
		
	ИначеЕсли ПолноеИмяОбъекта = "Документ.СписаниеСРасчетногоСчета" Тогда
		
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыЗапроса.Вставить("Договор", Объект.ДоговорКонтрагента);
		ПараметрыЗапроса.Вставить("ПлатежкаРазобралась", Объект.ПлатежкаРазобралась);
		
	ИначеЕсли ПолноеИмяОбъекта = "Документ.СчетНаОплатуПокупателю" Тогда
		
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыЗапроса.Вставить("Договор", Объект.ДоговорКонтрагента);
		
	ИначеЕсли ПолноеИмяОбъекта = "Документ.СчетНаОплатуПоставщика" Тогда
		
		ПараметрыЗапроса.Вставить("ОбъектМаршрутизации", Объект.Ссылка);
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыЗапроса.Вставить("Договор", Объект.ДоговорКонтрагента);
		ПараметрыЗапроса.Вставить("СчетПоставщикаБезКомплекта", НЕ Объект.ВСоставеКомплекта);
		
	ИначеЕсли ПолноеИмяОбъекта = "Документ.СчетФактураВыданный" Тогда
		
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		
	ИначеЕсли ПолноеИмяОбъекта = "Документ.СчетФактураПолученный" Тогда
		
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		
	ИначеЕсли ПолноеИмяОбъекта = "Документ.ТранспортныйДокумент" Тогда
		
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыЗапроса.Вставить("Договор", Объект.ДоговорКонтрагента);
		ПараметрыЗапроса.Вставить("ИсточникЗаявки", Неопределено);
		ПараметрыЗапроса.Вставить("УказанРейс", Ложь);
		ПараметрыЗапроса.Вставить("НаМоментЗаписиБылаЗадолженность", Ложь);
		ПараметрыЗапроса.Вставить("ВидПеревозки", Неопределено);
		ПараметрыЗапроса.Вставить("ПротоколНеУказан", Истина);
		
	//Евросиб Каблов 20.05.2024 ( #67092
	Иначе
	
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяОбъекта);
		Попытка
			ПараметрыЗапроса = МенеджерОбъекта.ПолучитьПараметрыМаршрутизации(Объект);
		Исключение
		КонецПопытки;
	//Евросиб Каблов 20.05.2024 )
		
	КонецЕсли;
	
	Возврат ПараметрыЗапроса;

КонецФункции

//Евросиб Каблов 20.01.2022 62514
Функция НайтиГотовыеКВыставлениюСтрокиВСделкахПоПСЦ(Протокол) Экспорт
	Если Не ЗначениеЗаполнено(Протокол) Тогда
		СтруктураРезультата = Новый Структура;
		СтруктураРезультата.Вставить("МассивСделокГотовоКВыставлению", Новый Массив);
		СтруктураРезультата.Вставить("МассивСделокВыставленныеДокументы", Новый Массив);
		СтруктураРезультата.Вставить("АдресТаблицыСделокДляОбработки", ПоместитьВоВременноеХранилище(Неопределено ,Новый УникальныйИдентификатор)); 
		Возврат СтруктураРезультата;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Ссылка,
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	|	СделкаСвязьУчетныхЕдиниц.ГотовоКВыставлению КАК ГотовоКВыставлению,
	|	СделкаСвязьУчетныхЕдиниц.ДокументыСформированы КАК ДокументыСформированы
	|ПОМЕСТИТЬ ВТ_СделкиПоПротоколу
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|ГДЕ
	|	СделкаСвязьУчетныхЕдиниц.Ссылка.Проведен
	|	И СделкаСвязьУчетныхЕдиниц.Протокол = &Протокол
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_СделкиПоПротоколу.Ссылка.Представление КАК Сделка
	|ИЗ
	|	ВТ_СделкиПоПротоколу КАК ВТ_СделкиПоПротоколу
	|ГДЕ
	|	ВТ_СделкиПоПротоколу.ГотовоКВыставлению
	|	И НЕ ВТ_СделкиПоПротоколу.ДокументыСформированы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СделкиПоПротоколу.Ссылка.Представление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_СделкиПоПротоколу.Ссылка.Представление КАК Сделка
	|ИЗ
	|	ВТ_СделкиПоПротоколу КАК ВТ_СделкиПоПротоколу
	|ГДЕ
	|	ВТ_СделкиПоПротоколу.ДокументыСформированы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СделкиПоПротоколу.Ссылка КАК Сделка,
	|	ВТ_СделкиПоПротоколу.ГУИД КАК ГУИД
	|ИЗ
	|	ВТ_СделкиПоПротоколу КАК ВТ_СделкиПоПротоколу
	|ГДЕ
	|	ВТ_СделкиПоПротоколу.ГотовоКВыставлению
	|	И НЕ ВТ_СделкиПоПротоколу.ДокументыСформированы";
	Запрос.УстановитьПараметр("Протокол", Протокол);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	МассивСделокГотовоКВыставлению = РезультатЗапроса[1].Выгрузить().ВыгрузитьКолонку("Сделка");
	МассивСделокВыставленныеДокументы = РезультатЗапроса[2].Выгрузить().ВыгрузитьКолонку("Сделка");
	ТаблицаСделокДляОбработки = РезультатЗапроса[3].Выгрузить();
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("МассивСделокГотовоКВыставлению", МассивСделокГотовоКВыставлению);
	СтруктураРезультата.Вставить("МассивСделокВыставленныеДокументы", МассивСделокВыставленныеДокументы);
	СтруктураРезультата.Вставить("АдресТаблицыСделокДляОбработки", ПоместитьВоВременноеХранилище(ТаблицаСделокДляОбработки,Новый УникальныйИдентификатор));
	Возврат СтруктураРезультата;
	
КонецФункции

//Евросиб Каблов 20.01.2022 62514
Процедура ОбработатьСделкиПоПСЦ(АдресТаблицыСделокДляОбработки) Экспорт
	
	Если АдресТаблицыСделокДляОбработки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСделокДляОбработки = ПолучитьИзВременногоХранилища(АдресТаблицыСделокДляОбработки);
	СоответствиеОбъектовСделок = Новый Соответствие;
	Для каждого СтрокаДляОбработки Из ТаблицаСделокДляОбработки Цикл
		обСделка = СоответствиеОбъектовСделок.Получить(СтрокаДляОбработки.Сделка);
		Если ОбСделка = Неопределено Тогда
			обСделка = СтрокаДляОбработки.Сделка.ПолучитьОбъект();
			СоответствиеОбъектовСделок.Вставить(СтрокаДляОбработки.Сделка, обСделка);
		КонецЕсли;                                                                   
		СтрокаСУЕ = обСделка.СвязьУчетныхЕдиниц.Найти(СтрокаДляОбработки.ГУИД, "ГУИД");
		СтрокаСУЕ.ГотовоКВыставлению = Ложь;
	КонецЦикла;
	
	Для каждого КлючЗначение Из СоответствиеОбъектовСделок Цикл
		КлючЗначение.Значение.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
	АдресТаблицыСделокДляОбработки = Неопределено;               
	
КонецПроцедуры
// -- ДИТ_Агафонов_task 50388 05.07.2022

// ++ Евросиб Дудоров С.В. US 57543 30.01.2023  
Функция МаршрутизироватьРефСцеп(ПараметрыЗапроса, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Маршрутизация.Ссылка КАК Ссылка,  
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	Маршрутизация.Контрагент КАК Контрагент,
				   //|	Маршрутизация.Договор КАК Договор, 
				   //Стало:
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
				   |	ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор,
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	Маршрутизация.Организация КАК Организация,
	               |	Маршрутизация.ЦФО КАК ЦФО
	               |ИЗ
	               |	Справочник.Маршрутизация КАК Маршрутизация   
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Маршрутизация.КонтрагентыИДоговоры КАК МаршрутизацияКонтрагентыИДоговоры
				   |		ПО (Маршрутизация.Ссылка = МаршрутизацияКонтрагентыИДоговоры.Ссылка)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |ГДЕ
	               |	НЕ Маршрутизация.ПометкаУдаления
	               |	И Маршрутизация.МаршрутизируемыйОбъект = ЗНАЧЕНИЕ(Перечисление.МаршрутизируемыеОбъекты.РефСцеп)
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Начало: 05.09.2024
				   // Было:
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.КонтрагентПустой
				   //|				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Контрагент = &Контрагент
				   //|					ИЛИ Маршрутизация.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|		КОНЕЦ  
				   //|	И ВЫБОР
				   //|			КОГДА Маршрутизация.ДоговорПустой
				   //|				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|			ИНАЧЕ Маршрутизация.Договор = &Договор
				   //|					ИЛИ Маршрутизация.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   //|		КОНЕЦ
				   //Стало:
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.КонтрагентПустой
				   |				ТОГДА &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = &Контрагент
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   |		КОНЕЦ
				   |	И ВЫБОР
				   |			КОГДА Маршрутизация.ДоговорПустой
				   |				ТОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |			ИНАЧЕ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = &Договор
				   |					ИЛИ ЕСТЬNULL(МаршрутизацияКонтрагентыИДоговоры.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
				   |		КОНЕЦ
				   // Евросиб(ДИТ) US 86962 ТА 87365 Сержантова А.С. Конец: 05.09.2024
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ОрганизацияПустая
	               |				ТОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.Организация = &Организация
	               |					ИЛИ Маршрутизация.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА Маршрутизация.ЦФОПустой
	               |				ТОГДА &ЦФО = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	               |			ИНАЧЕ Маршрутизация.ЦФО = &ЦФО
	               |					ИЛИ Маршрутизация.ЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка)
	               |		КОНЕЦ
	               |";

	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса["Организация"]);
	Запрос.УстановитьПараметр("Контрагент", ПараметрыЗапроса["Контрагент"]);
	Запрос.УстановитьПараметр("Договор", ПараметрыЗапроса["Договор"]);
	Запрос.УстановитьПараметр("ЦФО", ПараметрыЗапроса["ЦФО"]);
	Ответ = Запрос.Выполнить().Выбрать();
	КоличествоСовпаденийМакс = -1;
	ПодходящаяМаршрутизация = Справочники.Маршрутизация.ПустаяСсылка();
	Пока Ответ.Следующий() Цикл
		КоличествоСовпадений = 0;
		
		Если ЗначениеЗаполнено(Ответ["Контрагент"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Организация"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["Договор"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		Если ЗначениеЗаполнено(Ответ["ЦФО"]) Тогда КоличествоСовпадений = КоличествоСовпадений + 1; КонецЕсли;
		
		Если КоличествоСовпадений > КоличествоСовпаденийМакс Тогда
			ПодходящаяМаршрутизация = Ответ.Ссылка;
			КоличествоСовпаденийМакс = КоличествоСовпадений;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса = Новый Массив;
	Для каждого Стр из ПодходящаяМаршрутизация.Состояния Цикл
		//Статус = ?(РезультатЗапроса.Количество() = 0, ПодходящаяМаршрутизация.НачальныйСтатус, Перечисления.СтатусыЭтапов.Новый);
		Статус = ПодходящаяМаршрутизация.НачальныйСтатус;
		РезультатЗапроса.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель, Статус, Ссылка, ПредыдущиеЭтапы, ОРКПоДоговору, ОтветственныйЗаУчет, ОтветственныйЗаДоговор, НормативИсполненияСМоментаСоздания, ТребуетсяУказатьНаблюдателя, ТребуетсяУказатьИсполнителя, ВидНормативаИсполнения,ИсполнительКакРуководительПоНаправлению,НаблюдательКакРуководительПоНаправлению, РуководительСотрудника, ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника", Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, Статус, ПодходящаяМаршрутизация, Стр.ПредыдущиеЭтапы, Стр.СопровождениеПоДоговору, Стр.ОтветственныйЗаУчет, Стр.ОтветственныйЗаДоговор, Стр.НормативИсполненияСМоментаСоздания, Стр.ТребуетсяУказатьНаблюдателя, Стр.ТребуетсяУказатьИсполнителя, Стр.ВидНормативаИсполнения,Стр.ИсполнительКакРуководительПоНаправлению,Стр.НаблюдательКакРуководительПоНаправлению, Стр.РуководительСотрудника, Стр.ВыбиратьИсполнителяЕслиНеЗаполненРуководительСотрудника));
	КонецЦикла;
	ОтработатьЗамещениеДелегирование(РезультатЗапроса, Перечисления.МаршрутизируемыеОбъекты.РелизСобственника, ДатаДокумента, ПараметрыЗапроса["Договор"]);
	Возврат РезультатЗапроса;
	
КонецФункции

//Евросиб - АСуслов 20.03.2023 14:19:39 #67067
//(
Процедура ОтменитьВыполнениеЗадач(Объект, ЗадачиДляОтметкиВыполнения) Экспорт
	
	ДатаВыполнения = ТекущаяДата();
	
	Для Каждого СтрокаТЧ Из Объект.Состояния Цикл
		Если ЗадачиДляОтметкиВыполнения.Найти(СтрокаТЧ.Состояние) <> Неопределено Тогда
			СтрокаТЧ.Статус = Перечисления.СтатусыЭтапов.Новый;
			СтрокаТЧ.ЗавершениеРаботы = Дата(1,1,1);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗакрытьЗадачиСогласованияВСвязанныхКалькуляциях(Ссылка,ОбменДаннымиЗагрузка = Ложь) Экспорт //ДИТ Шевченко А.В. US 72111 ТА 72113 17.07.2023
	
	// ДИТ US 72111 Сержантова А.С. Начало: 30.01.2024
	//УстановитьПривилегированныйРежим(Истина); // ДИТ US 72111 ТА 73815 Сержантова А.С. 06.10.2023
	//
	//МассивПользователейГруппыОтделаПродаж = Справочники.ГруппыПользователей.РуководительОтделаПродаж.Состав.ВыгрузитьКолонку("Пользователь");
	//МассивПользователейГруппыДепартаментПродажКП = Справочники.ГруппыПользователей.РуководительДепартаментаПродажКП.Состав.ВыгрузитьКолонку("Пользователь");
	//МассивПользователейГруппыОтделаПродажНСК = Справочники.ГруппыПользователей.РуководительОтделаПродажНСК.Состав.ВыгрузитьКолонку("Пользователь"); // ДИТ US 72111 ТА 73815 Сержантова А.С. 28.09.2023
	//
	//МассивПользователейГрупп = Новый Массив();
	//Для Каждого Элм Из МассивПользователейГруппыОтделаПродаж Цикл
	//	МассивПользователейГрупп.Добавить(Элм);
	//КонецЦикла;
	//Для Каждого Элм Из МассивПользователейГруппыДепартаментПродажКП Цикл
	//	МассивПользователейГрупп.Добавить(Элм);
	//КонецЦикла;    
	//// ДИТ US 72111 ТА 73815 Сержантова А.С. Начало: 28.09.2023
	//Для Каждого Элм Из МассивПользователейГруппыОтделаПродажНСК Цикл
	//	МассивПользователейГрупп.Добавить(Элм);
	//КонецЦикла; 
	//
	//МассивЗамещаемыхПользователей = Новый Массив;
	//Запрос = Новый Запрос;   
	//Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ЗамещениеДокумент.ИсходныйПользователь КАК ИсходныйПользователь,
	//               |	ЗамещениеДокумент.НачалоПериодаЗамещения КАК НачалоПериодаЗамещения,
	//               |	ЗамещениеДокумент.КонецПериодаЗамещения КАК КонецПериодаЗамещения,
	//               |	ЗамещениеДокумент.Замещение КАК Замещение
	//               |ПОМЕСТИТЬ ВТ_ЗамещаемыеПользователи
	//               |ИЗ
	//               |	Документ.Замещение КАК ЗамещениеДокумент
	//               |ГДЕ
	//               |	ЗамещениеДокумент.Замещение В(&СписокЗамещающих)
	//               |	И ЗамещениеДокумент.Проведен
	//               |	И ЗамещениеДокумент.РежимДокумента = 0
	//               |	И ЗамещениеДокумент.ИсходныйПользователь.Недействителен
	//// ДИТ BUG 76603 Сержантова А.С. Начало: 13.11.2023   
	////Было:
	////Запрос.УстановитьПараметр("СписокЗамещающих", МассивПользователейГрупп);
	////Результат = Запрос.Выполнить();
	////Стало:
	//               |;
	//			   |/////////////////////////////////////////////////
	//			   |Выбрать различные
	//			   |	ЗамещениеДокумент.ИсходныйПользователь 
	//			   |ИЗ
	//               |	ВТ_ЗамещаемыеПользователи как ЗамещениеДокумент";
	//
	//Запрос.УстановитьПараметр("СписокЗамещающих", МассивПользователейГруппыДепартаментПродажКП);
	//Результат = Запрос.Выполнить(); 
	//Если не Результат.Пустой() Тогда
	//	Выборка = Результат.Выбрать();  
	//	Пока Выборка.Следующий() Цикл
	//		МассивПользователейГрупп.Добавить(Выборка.ИсходныйПользователь);
	//	КонецЦикла;
	//КонецЕсли;
	//// ДИТ BUG 76603 Сержантова А.С. Конец: 13.11.2023 
	//
	//// ДИТ ДИТ US 72111 ТА 73815 Сержантова А.С. Конец: 28.09.2023
	//МассивГрупп = Новый Массив();
	//МассивГрупп.Добавить(Справочники.ГруппыПользователей.РуководительОтделаПродаж);
	//МассивГрупп.Добавить(Справочники.ГруппыПользователей.РуководительДепартаментаПродажКП);   
	//// ДИТ US 72111 ТА 73815 Сержантова А.С. Начало: 28.09.2023
	//// Было:
	////Запрос = Новый Запрос;  
	//// Стало:
	//МассивГрупп.Добавить(Справочники.ГруппыПользователей.РуководительОтделаПродажНСК);
	//// ДИТ ДИТ US 72111 ТА 73815 Сержантова А.С. Конец: 28.09.2023
	//Запрос.Текст =
	//	"ВЫБРАТЬ
	//	|	Состояния.Исполнитель КАК Исполнитель,  
	//	// ДИТ US 72111 ТА 73815 Сержантова А.С. Начало: 09.10.2023
	//	|	Ложь КАК ЭтоЗамещение,
	//	|	Значение(Справочник.Пользователи.ПустаяСсылка) КАК ДействующийИсполнитель,
	//	// ДИТ US 72111 ТА 73815 Сержантова А.С. Конец: 09.10.2023
	//	|	Состояния.Статус КАК Статус,
	//	|	Состояния.СтатусСогласования КАК СтатусСогласования,
	//	|	ТИПЗНАЧЕНИЯ(Состояния.Исполнитель) КАК ТипОбъекта
	//	|ИЗ
	//	|	Документ.ПСЦ.Состояния КАК Состояния
	//	|ГДЕ
	//	|	Состояния.Ссылка = &СсылкаДок
	//	|	И (Состояния.Исполнитель В (&СсылкаГруппаПользоватлей)
	//	|			ИЛИ Состояния.Исполнитель В (&СоставГруппаПользоватлей))
	//	|	И Состояния.Состояние.Согласование    
	//	// ДИТ ДИТ US 72111 ТА 73815 Сержантова А.С. Начало: 28.09.2023 - если в ПСЦ присутствует замещающий или замещаемый, то в калькуляции согласуем за обоих
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	| 
	//	// здесь выбираем замещаемого пользователя
	//	|ВЫБРАТЬ
	//	|	ВТ_ЗамещаемыеПользователи.ИсходныйПользователь,  
	//	|	Истина,
	//	|	ВТ_ЗамещаемыеПользователи.Замещение,
	//	|	Состояния.Статус,
	//	|	Состояния.СтатусСогласования,
	//	|	ТИПЗНАЧЕНИЯ(Состояния.Исполнитель)
	//	|
	//	|ИЗ
	//	|	Документ.ПСЦ.Состояния КАК Состояния
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗамещаемыеПользователи КАК ВТ_ЗамещаемыеПользователи
	//	|		ПО (Состояния.Исполнитель = ВТ_ЗамещаемыеПользователи.ИсходныйПользователь или Состояния.Исполнитель = ВТ_ЗамещаемыеПользователи.Замещение)
	//	|			И Состояния.Ссылка = &СсылкаДок
	//	|			И Состояния.Состояние.Согласование 
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	| 
	//	// здесь выбираем замещающего пользователя
	//	|ВЫБРАТЬ
	//	|	ВТ_ЗамещаемыеПользователи.Замещение,  
	//	|	Ложь,
	//	|	Значение(Справочник.Пользователи.ПустаяСсылка),
	//	|	Состояния.Статус,
	//	|	Состояния.СтатусСогласования,
	//	|	ТИПЗНАЧЕНИЯ(Состояния.Исполнитель)
	//	|
	//	|ИЗ
	//	|	Документ.ПСЦ.Состояния КАК Состояния
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗамещаемыеПользователи КАК ВТ_ЗамещаемыеПользователи
	//	|		ПО (Состояния.Исполнитель = ВТ_ЗамещаемыеПользователи.ИсходныйПользователь или Состояния.Исполнитель = ВТ_ЗамещаемыеПользователи.Замещение)
	//	|			И Состояния.Ссылка = &СсылкаДок
	//	|			И Состояния.Состояние.Согласование";   
	//	// ДИТ ДИТ US 72111 ТА 73815 Сержантова А.С. Конец: 28.09.2023
	//
	//Запрос.УстановитьПараметр("СсылкаГруппаПользоватлей", МассивГрупп);
	//Запрос.УстановитьПараметр("СоставГруппаПользоватлей", МассивПользователейГрупп);
	//Запрос.УстановитьПараметр("СсылкаДок", Ссылка);
	//
	//// ДИТ US 72111 ТА 73815 Сержантова А.С. Начало: 03.11.2023 - если есть хотя бы один пользователь из списка, должны все остальные согласовать калькуляцию
	//// Было:
	////ТаблицаСогласованийПСЦ = Запрос.Выполнить().Выгрузить(); 
	//// Стало:
	//Результат = Запрос.Выполнить();
	//
	//Если не Результат.Пустой() Тогда 
	//	ТаблицаСогласованийПСЦ = Результат.Выгрузить();	
	//	ТаблицаСогласованийПСЦ_Дубль = ТаблицаСогласованийПСЦ.Скопировать();
	//	Для каждого Стр Из МассивПользователейГрупп Цикл
	//		СтрокаСогласованияВПСЦ = ТаблицаСогласованийПСЦ.Найти(Стр, "Исполнитель");
	//		Если СтрокаСогласованияВПСЦ = Неопределено Тогда
	//			НС = ТаблицаСогласованийПСЦ_Дубль.Добавить();	
	//			НС.Исполнитель 			  = Стр;   
	//			НС.ДействующийИсполнитель = ТаблицаСогласованийПСЦ[0].Исполнитель;
	//			НС.Статус				  = Перечисления.СтатусыЭтапов.Выполнен;
	//			НС.СтатусСогласования     = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний;
	//			НС.ТипОбъекта 			  = Тип("СправочникСсылка.Пользователи"); 
	//			НС.ЭтоЗамещение			  = Истина;			
	//		КонецЕсли;
	//	КонецЦикла;	
	//	Для каждого Стр Из МассивГрупп Цикл  
	//		СтрокаСогласованияВПСЦ = ТаблицаСогласованийПСЦ.Найти(Стр, "Исполнитель");
	//		Если СтрокаСогласованияВПСЦ = Неопределено Тогда
	//			НС = ТаблицаСогласованийПСЦ_Дубль.Добавить();	
	//			НС.Исполнитель 			  = Стр; 
	//			НС.ДействующийИсполнитель = ТаблицаСогласованийПСЦ[0].Исполнитель;
	//			НС.Статус				  = Перечисления.СтатусыЭтапов.Выполнен;
	//			НС.СтатусСогласования     = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний;
	//			НС.ТипОбъекта 			  = Тип("СправочникСсылка.ГруппыПользователей");  
	//			НС.ЭтоЗамещение			  = Истина;
	//		КонецЕсли;
	//	КонецЦикла; 
	//Иначе
	//	Возврат;
	//КонецЕсли;
	//// ДИТ US 72111 ТА 73815 Сержантова А.С. Конец: 03.11.2023
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Калькуляции.Калькуляция КАК КалСсылка
	//	|ПОМЕСТИТЬ ВТ_Калькуляции
	//	|ИЗ
	//	|	Документ.ПСЦ.Калькуляции КАК Калькуляции
	//	|ГДЕ
	//	|	Калькуляции.Ссылка = &СсылкаДок
	//	|	И НЕ Калькуляции.Калькуляция.ПометкаУдаления
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_Калькуляции.КалСсылка КАК КалькСсылка
	//	|ИЗ
	//	|	ВТ_Калькуляции КАК ВТ_Калькуляции
	//	|ГДЕ
	//	|	ВТ_Калькуляции.КалСсылка.СтатусДокумента В(&СтатусДокумента)";
	//
	//МассивСогласований = Новый Массив;
	//МассивСогласований.Добавить(Перечисления.СтатусыСогласования.Планируется);
	//МассивСогласований.Добавить(Перечисления.СтатусыСогласования.НаРассмотрении);
	//Запрос.УстановитьПараметр("СсылкаДок", Ссылка);
	//Запрос.УстановитьПараметр("СтатусДокумента", МассивСогласований);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	МассивОбработанныхИсполнителейПользователей = Новый Массив;
	//	ОбКалькуляция = ВыборкаДетальныеЗаписи.КалькСсылка.ПолучитьОбъект();
	//	ЕстьИзменения = Ложь;    
	//	
	//	//// ДИТ US 72111 ТА 73815 Сержантова А.С. Начало: 28.09.2023 -  // 03.11.2023 Сержантова А.С. закомментировала
	//	////Если ПСЦ согласовал Пестерев (или руководитель отдела продаж НСК), то остальные из списка согласовывают автоматически 
	//	//ТаблицаСогласованийПСЦ_Дубль = ТаблицаСогласованийПСЦ.Скопировать();
	//	//ДобавитьОстальныхСогласующих = Ложь;
	//	//Для каждого РукОтделаПродажНСК Из МассивПользователейГруппыОтделаПродажНСК Цикл    
	//	//	СтрРуководителяПСЦ = ТаблицаСогласованийПСЦ.Найти(РукОтделаПродажНСК, "Исполнитель");  
	//	//	Если СтрРуководителяПСЦ <> Неопределено Тогда
	//	//		ДобавитьОстальныхСогласующих = Истина;
	//	//	КонецЕсли;	
	//	//КонецЦикла;  
	//	//Если ТаблицаСогласованийПСЦ.Найти(Справочники.ГруппыПользователей.РуководительОтделаПродажНСК, "Исполнитель") <> Неопределено Тогда
	//	//	ДобавитьОстальныхСогласующих = Истина;
	//	//КонецЕсли;
	//	//Если ДобавитьОстальныхСогласующих Тогда
	//	//	Для каждого Стр Из МассивПользователейГрупп Цикл
	//	//		НС = ТаблицаСогласованийПСЦ_Дубль.Добавить();	
	//	//		НС.Исполнитель 			= Стр; 
	//	//	    НС.Статус				= Перечисления.СтатусыЭтапов.Выполнен;
	//	//		НС.СтатусСогласования   = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний;
	//	//		НС.ТипОбъекта 			= Тип("СправочникСсылка.Пользователи"); 
	//	//		НС.ЭтоЗамещение			= Ложь;
	//	//	КонецЦикла;	
	//	//	Для каждого Стр Из МассивГрупп Цикл
	//	//		НС = ТаблицаСогласованийПСЦ_Дубль.Добавить();	
	//	//		НС.Исполнитель 			= Стр; 
	//	//	    НС.Статус				= Перечисления.СтатусыЭтапов.Выполнен;
	//	//		НС.СтатусСогласования   = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний;
	//	//		НС.ТипОбъекта 			= Тип("СправочникСсылка.ГруппыПользователей");  
	//	//		НС.ЭтоЗамещение			= Ложь;
	//	//	КонецЦикла;
	//	//КонецЕсли;
	//	//// ДИТ US 72111 ТА 73815 Сержантова А.С. Конец: 28.09.2023
	//	
	//	СтруктураОтбра = Новый Структура("ТипОбъекта",Тип("СправочникСсылка.Пользователи"));
	//	СостояниеИспПользователь = ТаблицаСогласованийПСЦ_Дубль.НайтиСтроки(СтруктураОтбра);  //ДИТ US 72111 ТА 73815 Сержантова А.С. заменила таблицу ТаблицаСогласованийПСЦ
	//	
	//	Для Каждого СостояниеПСЦ Из СостояниеИспПользователь Цикл 
	//		
	//		// ДИТ US 72111 ТА 73815 Сержантова А.С. Начало: 28.09.2023 - Пестерев лично согласовывает ПСЦ и калькуляцию
	//		Если МассивПользователейГруппыОтделаПродажНСК.Найти(СостояниеПСЦ.Исполнитель) <> Неопределено  Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		// ДИТ US 72111 ТА 73815 Сержантова А.С. Конец: 28.09.2023
	//			
	//		СтруктураОтбра = Новый Структура("Исполнитель",СостояниеПСЦ.Исполнитель);
	//		СтрокиСостоянийКал = ОбКалькуляция.Состояния.НайтиСтроки(СтруктураОтбра);
	//		Для Каждого СостояниеКал Из СтрокиСостоянийКал Цикл   
	//			Если СостояниеКал.Состояние.Согласование Тогда
	//				ЗаполнитьЗначенияСвойств(СостояниеКал,СостояниеПСЦ,"Статус,СтатусСогласования,Исполнитель"); 
	//				// ДИТ US 72111 ТА 73815 Сержантова А.С. Начало: 09.10.2023 
	//				Если СостояниеПСЦ.ЭтоЗамещение Тогда
	//					СостояниеКал.Исполнитель = СостояниеПСЦ.ДействующийИсполнитель; 
	//				КонецЕсли;
	//				// ДИТ US 72111 ТА 73815 Сержантова А.С. Конец: 09.10.2023
	//				СостояниеКал.ЗавершениеРаботы = ТекущаяДата();
	//				ЕстьИзменения = Истина;
	//				МассивОбработанныхИсполнителейПользователей.Добавить(СостояниеПСЦ.Исполнитель);
	//			КонецЕсли;
	//		КонецЦикла;
	//		Для Каждого ЭлмГруппа Из МассивГрупп Цикл 
	//			// ДИТ US 72111 ТА 73815 Сержантова А.С. Начало: 28.09.2023 - Пестерев лично согласовывает ПСЦ и калькуляцию
	//			Если ЭлмГруппа = Справочники.ГруппыПользователей.РуководительОтделаПродажНСК Тогда
	//				Продолжить;
	//			КонецЕсли;
	//			// ДИТ US 72111 ТА 73815 Сержантова А.С. Конец: 28.09.2023
	//			СтруктураОтбра = Новый Структура("Исполнитель",ЭлмГруппа);
	//			СтрокиСостоянийКал = ОбКалькуляция.Состояния.НайтиСтроки(СтруктураОтбра);
	//			Для Каждого СостояниеКал Из СтрокиСостоянийКал Цикл
	//				Если СостояниеКал.Состояние.Согласование Тогда
	//					ЗаполнитьЗначенияСвойств(СостояниеКал,СостояниеПСЦ,"Статус,СтатусСогласования,Исполнитель");
	//					СостояниеКал.ЗавершениеРаботы = ТекущаяДата();
	//					ЕстьИзменения = Истина;
	//				КонецЕсли;
	//			КонецЦикла;
	//		КонецЦикла;
	//	КонецЦикла;
	//	
	//	СтруктураОтбра = Новый Структура("ТипОбъекта",Тип("СправочникСсылка.ГруппыПользователей"));
	//	СостояниеИспПользователь = ТаблицаСогласованийПСЦ_Дубль.НайтиСтроки(СтруктураОтбра);  //ДИТ US 72111 ТА 73815 Сержантова А.С. заменила таблицу ТаблицаСогласованийПСЦ
	//	
	//	Для Каждого СостояниеПСЦ Из СостояниеИспПользователь Цикл               
	//		// ДИТ US 72111 ТА 73815 Сержантова А.С. Начало: 28.09.2023
	//		Если СостояниеПСЦ.Исполнитель = Справочники.ГруппыПользователей.РуководительОтделаПродажНСК Тогда
	//			Продолжить;
	//		КонецЕсли; 
	//		// ДИТ US 72111 ТА 73815 Сержантова А.С. Конец: 28.09.2023
	//		СтруктураОтбра = Новый Структура("Исполнитель",СостояниеПСЦ.Исполнитель);
	//		СтрокиСостоянийКал = ОбКалькуляция.Состояния.НайтиСтроки(СтруктураОтбра);
	//		Для Каждого СостояниеКал Из СтрокиСостоянийКал Цикл  
	//			Если СостояниеКал.Состояние.Согласование Тогда
	//				ЗаполнитьЗначенияСвойств(СостояниеКал,СостояниеПСЦ,"Статус,СтатусСогласования,Исполнитель");
	//				СостояниеКал.ЗавершениеРаботы = ТекущаяДата();
	//				ЕстьИзменения = Истина;
	//			КонецЕсли;
	//		КонецЦикла;
	//		Для Каждого ЭлмГруппы Из МассивПользователейГрупп Цикл
	//			Если МассивОбработанныхИсполнителейПользователей.Найти(ЭлмГруппы) <> Неопределено Тогда
	//				Продолжить;
	//			КонецЕсли;	   
	//			// ДИТ US 72111 ТА 73815 Сержантова А.С. Начало: 28.09.2023 - Пестерев лично согласовывает ПСЦ и калькуляцию
	//			Если МассивПользователейГруппыОтделаПродажНСК.Найти(ЭлмГруппы) <> Неопределено Тогда
	//				Продолжить;
	//			КонецЕсли;
	//			// ДИТ US 72111 ТА 73815 Сержантова А.С. Конец: 28.09.2023
	//			СтруктураОтбра = Новый Структура("Исполнитель",ЭлмГруппы);
	//			СтрокиСостоянийКал = ОбКалькуляция.Состояния.НайтиСтроки(СтруктураОтбра);
	//			Для Каждого СостояниеКал Из СтрокиСостоянийКал Цикл
	//				Если СостояниеКал.Состояние.Согласование Тогда
	//					ЗаполнитьЗначенияСвойств(СостояниеКал,СостояниеПСЦ,"Статус,СтатусСогласования,Исполнитель");   
	//					СостояниеКал.ЗавершениеРаботы = ТекущаяДата();
	//					ЕстьИзменения = Истина;
	//				КонецЕсли;
	//			КонецЦикла;
	//		КонецЦикла;
	//	КонецЦикла;
	//	
	//	Если ЕстьИзменения Тогда 
	//		Попытка  // ДИТ US 72111 ТА 73815 Сержантова А.С. 26.10.2023 - Добавила попытку
	//			ОбКалькуляция.ДополнительныеСвойства.Вставить("ВызванИзЗаписиПС");
	//			ОбКалькуляция.ОбменДанными.Загрузка = ОбменДаннымиЗагрузка;
	//			ОбКалькуляция.Записать();  
	//		Исключение
	//			ЗаписьЖурналаРегистрации("Данные.Изменение",УровеньЖурналаРегистрации.Ошибка,,ОбКалькуляция.Ссылка,
	//			"Ошибка записи калькуляции при согласовании связанных с ПСЦ калькуляций - " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	//		КонецПопытки;   
	//	КонецЕсли;
	//КонецЦикла;  
	//
	//УстановитьПривилегированныйРежим(Ложь);  // ДИТ US 72111 ТА 73815 Сержантова А.С. 06.10.2023     
	// ДИТ US 72111 Сержантова А.С. Конец: 30.01.2024

КонецПроцедуры	   

// ДИТ US 76975 ТА 76977 Сержантова А.С. 15.11.2023
Процедура ИсполнениеЗадачПриИзмеренииПСЦвЗаявке(ЗаявкаОбъект) Экспорт
	
	ЗадачаНаВводПСЦ = ЗаявкаОбъект.Состояния.Найти(Справочники.Состояния.ВводПСЦ);   
	Если ЗадачаНаВводПСЦ = Неопределено Тогда
		Возврат; // нет задачи на ввод ПСЦ
	КонецЕсли;
	
	//Евросиб Коханенко Н.А. 26.02.2025 (( #101467 
	// если указали протокол, то автоматически выполняем задачу по вводу псц
	//Если ЗначениеЗаполнено(ЗаявкаОбъект.ПСЦ) Тогда
	//проверяем все строки ТЧ СоставаУслуг на заполненность ПСЦ 
	ПСЦЗаполнен = (ЗаявкаОбъект.СоставУслуги.Количество() > 0);
	Для Каждого Стр Из ЗаявкаОбъект.СоставУслуги Цикл 
		ПСЦЗаполнен = ПСЦЗаполнен И ЗначениеЗаполнено(Стр.ПСЦ);
	КонецЦикла;
	Если ПСЦЗаполнен Тогда
	//Евросиб Коханенко Н.А. 26.02.2025 )) #101467 
		ЗадачаНаВводПСЦ.Статус = Перечисления.СтатусыЭтапов.Выполнен; 
		ЗадачаНаВводПСЦ.НачалоРаботы = ТекущаяДата();
		ЗадачаНаВводПСЦ.ЗавершениеРаботы = ТекущаяДата();
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Состояние",Справочники.Состояния.ТребуетсяСозданиеПСЦ);
		НайденныеСтроки = ЗаявкаОбъект.Состояния.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество()>0 Тогда
			ИндексУдаляемойСтроки = ЗаявкаОбъект.Состояния.Индекс(НайденныеСтроки[0]);
			ЗаявкаОбъект.Состояния.Удалить(ИндексУдаляемойСтроки);
        КонецЕсли;

	// если убрали протокол, смотрим на предыдущий этап 
	Иначе   
		МассивПредЭтапов = Новый Массив;
		СписокПредЭтапов = ЗадачаНаВводПСЦ.ПредыдущиеЭтапы;
		СписокПредЭтапов = СтрЗаменить(СписокПредЭтапов, ";", ","); СписокПредЭтапов = СтрЗаменить(СписокПредЭтапов, " ", "");
		МассивПредЭтапов = СтрРазделить(СписокПредЭтапов, ",", Ложь);
		
		ЕстьНеВыполненный = Ложь;
		Для каждого ПредЭтап Из МассивПредЭтапов Цикл
			Если ЗаявкаОбъект.Состояния[ПредЭтап-1].Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
				ЕстьНеВыполненный = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если ЕстьНеВыполненный Тогда
			ЗадачаНаВводПСЦ.Статус = Перечисления.СтатусыЭтапов.Новый;		
		Иначе
			ЗадачаНаВводПСЦ.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
		КонецЕсли;	
	КонецЕсли;		

КонецПроцедуры

// ДИТ US 57674 ТА 79279 Сержантова А.С. 25.03.2024
Процедура СформироватьЗадачуУдаленияСчета(ДокументРеализации) Экспорт

    //Поиск счетов на удаление
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсторияКорректировокРеализаций.ПервичныйДокумент КАК РТУ
		|ПОМЕСТИТЬ ВТ_ПервичныйРТУ
		|ИЗ
		|	РегистрСведений.ИсторияКорректировокРеализаций КАК ИсторияКорректировокРеализаций
		|ГДЕ
		|	ИсторияКорректировокРеализаций.Регистратор = &Ссылка
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИсторияКорректировокРеализаций.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВТ_ОснованияСчетов
		|ИЗ
		|	РегистрСведений.ИсторияКорректировокРеализаций КАК ИсторияКорректировокРеализаций
		|ГДЕ
		|	ИсторияКорректировокРеализаций.ПервичныйДокумент В
		|			(ВЫБРАТЬ
		|				Т.РТУ
		|			ИЗ
		|				ВТ_ПервичныйРТУ КАК Т)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_ПервичныйРТУ.РТУ
		|ИЗ
		|	ВТ_ПервичныйРТУ КАК ВТ_ПервичныйРТУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СчетНаОплатуПокупателюДокументыОснования.Ссылка КАК СчетПокупателю,
		|	СчетНаОплатуПокупателюДокументыОснования.Ссылка.Автор КАК Автор
		|ИЗ
		|	ВТ_ОснованияСчетов КАК ВТ_ОснованияСчетов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
		|		ПО ВТ_ОснованияСчетов.Регистратор = СчетНаОплатуПокупателюДокументыОснования.Документ
		|ГДЕ
		|	СчетНаОплатуПокупателюДокументыОснования.Ссылка.Проведен
		|
		//Евросиб СубботинВ #84453 02.07.2024 Начало //Поменял запрос на работу только с ТЧ СчетаНаОплатуПокупателям 
		//|ОБЪЕДИНИТЬ
		//|
		//|ВЫБРАТЬ
		//|	РеализацияТоваровУслуг.СчетНаОплатуПокупателю,
		//|	РеализацияТоваровУслуг.СчетНаОплатуПокупателю.Автор
		//|ИЗ
		//|	ВТ_ОснованияСчетов КАК ВТ_ОснованияСчетов
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		//|		ПО ВТ_ОснованияСчетов.Регистратор = РеализацияТоваровУслуг.Ссылка
		//|ГДЕ
		//|	РеализацияТоваровУслуг.СчетНаОплатуПокупателю.Проведен
		//|
		//Евросиб СубботинВ #84453 02.07.2024 Конец
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.СчетПокупателю,
		|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.СчетПокупателю.Автор
		|ИЗ
		|	ВТ_ОснованияСчетов КАК ВТ_ОснованияСчетов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.СчетаНаОплатуПокупателям КАК РеализацияТоваровУслугСчетаНаОплатуПокупателям
		|		ПО ВТ_ОснованияСчетов.Регистратор = РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка
		|ГДЕ
		|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.СчетПокупателю.Проведен";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументРеализации);  
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если не РезультатЗапроса.Пустой() Тогда 
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СчетОбъект = Выборка.СчетПокупателю.ПолучитьОбъект();  
			СтрокаСостояния = СчетОбъект.Состояния.НайтиСтроки(Новый Структура("Состояние", Справочники.Состояния.УдалениеСчета));
			Если СтрокаСостояния.Количество() <> 0 Тогда
				НС = СтрокаСостояния[0];
			Иначе
				НС = СчетОбъект.Состояния.Добавить();	
			КонецЕсли;
			   
			НС.Исполнитель = Выборка.Автор;
			Если СчетОбъект.Состояния.Количество() Тогда
				НС.Наблюдатель = СчетОбъект.Состояния[0].Наблюдатель;
			КонецЕсли;
			НС.Статус = Перечисления.СтатусыЭтапов.ВРаботе;
			НС.Состояние = Справочники.Состояния.УдалениеСчета;
			НС.Комментарий = "РТУ аннулировано " + ДокументРеализации + ", проверить и при необходимости удалить счет";  
			НС.НачалоРаботы = ТекущаяДата(); 
			
			Попытка
				СчетОбъект.Записать();  
			Исключение
				ОбщегоНазначения.СообщитьПользователю("Не удалось добавить задачу аннулирования по счету " + Выборка.СчетПокупателю);
			КонецПопытки;
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

//Евросиб Шевченко А.В. US 115011 TA 117858 18.09.2025
Процедура СформироватьЗадачуПометкаНаУдалениеСчета(СчетОбъект,ГруппаДКП = Неопределено) Экспорт  
	СтрокаСостояния = СчетОбъект.Состояния.НайтиСтроки(Новый Структура("Состояние", Справочники.Состояния.ТребуетсяПометкаНаУдалениеСчета));
	Если СтрокаСостояния.Количество() <> 0 Тогда
		НС = СтрокаСостояния[0];
	Иначе
		НС = СчетОбъект.Состояния.Добавить();	
	КонецЕсли;
	
	НС.Исполнитель = ПолучитьИсполнителяДляЗадачиПометкаНаУдалениеСчета(СчетОбъект.Ссылка,ГруппаДКП);
	Если СчетОбъект.Состояния.Количество() Тогда
		НС.Наблюдатель = СчетОбъект.Состояния[0].Наблюдатель;
	КонецЕсли;
	НС.Статус = Перечисления.СтатусыЭтапов.ВРаботе;
	НС.Состояние = Справочники.Состояния.ТребуетсяПометкаНаУдалениеСчета;
	НС.Комментарий = "";  
	НС.НачалоРаботы = ТекущаяДата(); 
	//Евросиб Шевченко А.В. US 121985 TA 122270 19.11.2025
	ОставитьИсполнителя = Ложь;
	СтрокаСостояния = СчетОбъект.Состояния.НайтиСтроки(Новый Структура("Состояние", Справочники.Состояния.УдалениеСчета));
	Если СтрокаСостояния.Количество() <> 0 Тогда
		НС = СтрокаСостояния[0];
		ОставитьИсполнителя = Истина;
	Иначе
		НС = СчетОбъект.Состояния.Добавить();	
	КонецЕсли;
	Если НЕ ОставитьИсполнителя Тогда
		НС.Исполнитель = Пользователи.ТекущийПользователь();
	КонецЕсли;
	Если СчетОбъект.Состояния.Количество() Тогда
		НС.Наблюдатель = СчетОбъект.Состояния[0].Наблюдатель;
	КонецЕсли;
	НС.Статус = Перечисления.СтатусыЭтапов.ВРаботе;
	НС.Состояние = Справочники.Состояния.УдалениеСчета;
	НС.Комментарий = "";  
	НС.НачалоРаботы = ТекущаяДата();
	//Евросиб Шевченко А.В. US 121985 TA 122270 19.11.2025
КонецПроцедуры	

Функция ПолучитьИсполнителяДляЗадачиПометкаНаУдалениеСчета(СчетОбъект,ГруппаДКП) Экспорт
	
	Если ГруппаДКП = Неопределено Тогда
		ГруппаДКС = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьГруппуДКСпоДокументу(СчетОбъект);
	Иначе
		ГруппаДКС = ГруппаДКП;
	КонецЕсли;
	Если ГруппаДКС = Справочники.ГруппыДКС.ДМС Тогда
		Возврат Справочники.ГруппыПользователей.ДКПДМС;
	ИначеЕсли ГруппаДКС = Справочники.ГруппыДКС.ДПРК Тогда	
		Возврат Справочники.ГруппыПользователей.ДКПДПРК;
	Иначе
		Возврат Справочники.ГруппыПользователей.ДКПДКС;
	КонецЕсли;
	
КонецФункции
//Евросиб Шевченко А.В. US 115011 TA 117858 18.09.2025

// Евросиб(ДИТ) US 84968 ТА 85632 Сержантова А.С. 12.09.2024   
//ДокументСсылка - Ссылка на Заявку или Сделку, куда добавляется задача
//УдаленныеРейсы - Массив с морскими рейсами, помеченными на удаление (планируемая дата отправления больше текущей даты)
Процедура СформироватьЗадачуОбработкиУдаленияМорскогоРейса(ДокументСсылка, Состояния, Автор, УдаленныеРейсы) Экспорт
	
	СтрокаСостояния = Состояния.НайтиСтроки(Новый Структура("Состояние", Справочники.Состояния.УдаленМорскойРейс));
	Если СтрокаСостояния.Количество() <> 0 Тогда
		НС = СтрокаСостояния[0];
	Иначе
		НС = Состояния.Добавить();	
	КонецЕсли;
	
	НС.Исполнитель = Автор;
	Если Состояния.Количество() Тогда
		НС.Наблюдатель = Автор;
	КонецЕсли;
	НС.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	НС.Состояние = Справочники.Состояния.УдаленМорскойРейс;     
	Если УдаленныеРейсы.Количество() = 1 Тогда
		ТекстКомментария = СтрШаблон("Выбранный в документе %1 морской рейс %2 помечен на удаление. Выберите другой актуальный рейс.",
						ДокументСсылка, УдаленныеРейсы[0]);
	Иначе
		ТекстКомментария = СтрШаблон("Выбранные в документе %1 морские рейсы (%2) помечены на удаление. Выберите другие актуальные рейсы.",
						ДокументСсылка, СтрСоединить(УдаленныеРейсы));
	КонецЕсли;
	НС.Комментарий = ТекстКомментария;  
	НС.НачалоРаботы = ТекущаяДата(); 
	
КонецПроцедуры

//Евросиб СубботинВ #117888 10.09.2025 Начало 
Процедура ОчиститьТаблицуСостоянийОбъекта(Объект) Экспорт
	Объект.Состояния.Очистить();                            
КонецПроцедуры
//Евросиб СубботинВ #117888 10.09.2025 Конец 

//Евросиб СубботинВ #125528 04.12.2025 Начало
Функция ПолучитьИнформациюПоСостояниюОбъекта(Состояние, Объект) Экспорт
	
	ЕстьТчСостояний = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "Состояния");
	
	Результат = Неопределено;
	Если ЕстьТчСостояний Тогда		
		Состояния = Объект.Состояния.Выгрузить();
		СтруктураПоиска = Новый Структура("Состояние", Состояние);
		РезультатПоиска = Состояния.НайтиСтроки(СтруктураПоиска);
		Если РезультатПоиска.Количество() > 0 Тогда
			Результат = РезультатПоиска[0];
		КонецЕсли
	КонецЕсли;
	Возврат Результат
	
КонецФункции	
//Евросиб СубботинВ #125528 04.12.2025 Начало

