
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ДокументВыгруженВУПП = ПроверитьДокументВыгруженВУППНаСервере(ПараметрКоманды);
	Если Не ДокументВыгруженВУПП Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("По данному документу не создан Заказ в УПП. Создание заявки на оплату отменено.");
		Возврат;
	КонецЕсли;
	Результат = ПолучитьСуществующуюЗаявкуПоДокументуНаСервере(ПараметрКоманды);	
	Если Результат.ДокументЗаявка <> Неопределено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьПослеВыбораСуществующейЗаявки", ЭтотОбъект, Результат);
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить("Редактировать", "Редактировать существующую заявку");
		Кнопки.Добавить("Создать", "Создать новую заявку");
		Кнопки.Добавить("Отмена", "Отмена");
		ПоказатьВопрос(ОписаниеОповещения, "По документу найдена созданная заявка. Открыть существующую на редактирование или создать новую заявку?",Кнопки, 60);
	Иначе
		
		//Евросиб СубботинВ #102528 09.04.2025 Начало 
		СтрокиКРазнесению = ПолучитьСоответствиеСтавокНДС(Результат.ДокументОснование);
		Если СтрокиКРазнесению.Количество() = 1 Тогда 
		//Евросиб СубботинВ #102528 09.04.2025 Конец
		//
			ЗаполнитьЗаявку(Результат.ДокументЗаявка, Результат.ДокументОснование, ПараметрыВыполненияКоманды);
			
		//Евросиб СубботинВ #102528 09.04.2025 Начало
		Иначе
		//	//СписокКнопок.Добавить(КодВозвратаДиалога.Да, "Создать отдельные заявки");
		//	//СписокКнопок.Добавить(КодВозвратаДиалога.Нет, "Создать одну заявку");
		//	//СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
			СписокКнопок = Новый СписокЗначений;
		//	Для Каждого СтавкаНДС из СтрокиКРазнесению Цикл				
		//		СписокКнопок.Добавить(СтавкаНДС.Ключ, "Создать заявку со ставкой " + СтавкаНДС.Ключ);
		//    КонецЦикла;
		    СписокКнопок.Добавить(КодВозвратаДиалога.Да, "Создать одну заявку");
		    СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
			
			ОпОп = Новый ОписаниеОповещения("ОбработкаОтветаПользователя", ЭтотОбъект,
			Новый Структура("СтрокиКРазнесению, ДокументЗаявка, ДокументОснование, ПараметрыВыполненияКоманды", СтрокиКРазнесению, Результат.ДокументЗаявка, Результат.ДокументОснование, ПараметрыВыполненияКоманды));
			ПоказатьВопрос(ОпОп,"В Табличной части товаров/услуг разные Ставки НДС.
			|Выберите дальнейшее действие:",СписокКнопок, 60 ,КодВозвратаДиалога.Да);
			
		КонецЕсли; 
		//Евросиб СубботинВ #102528 09.04.2025 Конец
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьЗаявку(ЗаявкаНаОплатуСсылка, ДокументОснование = Неопределено, ПараметрыВыполненияКоманды = Неопределено)
	
	Если ЗначениеЗаполнено(ЗаявкаНаОплатуСсылка) Тогда
		ПараметрыФормы = Новый Структура("Ключ", ЗаявкаНаОплатуСсылка);
	Иначе
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Основание", ДокументОснование);	
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	КонецЕсли;
	ОткрытьФорму("Документ.ЗаявкаНаОплату.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецФункции

&НаСервере
Функция ПолучитьСуществующуюЗаявкуПоДокументуНаСервере(ДокументОснование)
	ДокументЗаявка = Документы.ЗаявкаНаОплату.ПолучитьСуществующуюЗаявкуПоДокументу(ДокументОснование);	
	Возврат Новый Структура("ДокументЗаявка, ДокументОснование", ДокументЗаявка, ДокументОснование);
КонецФункции

&НаКлиенте
Процедура ПродолжитьПослеВыбораСуществующейЗаявки(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = "Отмена" Тогда
		Возврат;
	ИначеЕсли РезультатВопроса = "Создать" Тогда
		Результат = ЗаполнитьЗаявку(Неопределено, ДополнительныеПараметры.ДокументОснование);
	Иначе
		Результат = ЗаполнитьЗаявку(ДополнительныеПараметры.ДокументЗаявка, ДополнительныеПараметры.ДокументОснование);
	КонецЕсли;      
	
КонецПроцедуры

&НаСервере
Функция ПроверитьДокументВыгруженВУППНаСервере(Документ)
	//Евросиб СубботинВ #118799 09.10.2025 Начало
	//РезультатПроверки = РегистрыСведений.ПротоколОбменов.ПроверитьВыгрузку(Документ, Перечисления.УзлыОбмена.УППЗаказ, Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
	//Возврат ЗначениеЗаполнено(РезультатПроверки.ДатаОбмена); 
	РезультатПроверки = ЗаявкиНаОплатуСервер.ПроверитьДокументВыгруженВУППНаСервере(Документ); 
	Возврат РезультатПроверки;
	//Евросиб СубботинВ #118799 09.10.2025 Конец

КонецФункции

// //Евросиб СубботинВ #102528 09.04.2025 Начало
&НаКлиенте	
Процедура ОбработкаОтветаПользователя(ОтветПользователя = Неопределено, ДопПараметры = Неопределено)Экспорт

	Если ОтветПользователя = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	СоответствиеМассивовДокументовДляОтвязки = ДопПараметры.СтрокиКРазнесению;
	
	Если ОтветПользователя = КодВозвратаДиалога.Да Тогда
		ЗаполнитьЗаявку(ДопПараметры.ДокументЗаявка, ДопПараметры.ДокументОснование, ДопПараметры.ПараметрыВыполненияКоманды);
	ИначеЕсли ОтветПользователя = КодВозвратаДиалога.Отмена Тогда
      	Возврат 
	//Иначе 
	//	СтрокиПоСтавке = ДопПараметры.СтрокиКРазнесению.Получить(ОтветПользователя);
	//	СтрокиКРазнесению = Новый Соответствие;
	//	СтрокиКРазнесению.Вставить(ОтветПользователя, СтрокиПоСтавке);
	// 	НоваяЗаявка = СоздатьЗаявкиПоРазнымНДС(СтрокиКРазнесению);
	//	Если НЕ НоваяЗаявка = Неопределено Тогда
	//		ПоказатьЗначение(,НоваяЗаявка);
	//	КонецЕсли;
	КонецЕсли;


КонецПроцедуры 

&НаСервере
Функция ПолучитьСоответствиеСтавокНДС(ДокументОснование) Экспорт
    	
	Возврат ЗаявкиНаОплатуСервер.ПолучитьСоответствиеСтавокНДС(ДокументОснование);

КонецФункции

//&НаСервере	
//Функция СоздатьЗаявкиПоРазнымНДС(СтрокиКРазнесению)
//	
// 	Возврат Документы.ЗаявкаНаОплату.СоздатьЗаявкиПоРазнымНДС(СтрокиКРазнесению);
//   
//КонецФункции 

////Евросиб СубботинВ #102528 09.04.2025 Конец
