//ДИТ, Беляев СЮ, ТА47544, 09-03-2022, начало
&НаСервере
Функция ПодготовитьТабличныйДокумент()  
	ТабДокумент.Очистить();
	
	Ячейка = ТабДокумент.ПолучитьОбласть(1, 1, 1, 1); 
	Ячейка.ТекущаяОбласть.Текст = "Протокол";     
	Линиия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
	Ячейка.ТекущаяОбласть.Обвести(Линиия, Линиия, Линиия, Линиия);
	Ячейка.ТекущаяОбласть.ЦветФона = WebЦвета.СветлоНебесноГолубой;								
	Ячейка.ТекущаяОбласть.ШиринаКолонки = 35;
	
	ШрифтШапки = Новый Шрифт(,,Истина,Ложь,Ложь,Ложь);
	ШрифтСтроки = Новый Шрифт(,,Ложь,Ложь,Ложь,Ложь);
	
	Ячейка.ТекущаяОбласть.Шрифт = ШрифтШапки;
	ТабДокумент.Вывести(Ячейка);
	Ячейка.ТекущаяОбласть.Текст = "Пункт ПСЦ";   
	ТабДокумент.Присоединить(Ячейка);
	Ячейка.ТекущаяОбласть.Текст = "Расшифровка пункта";   
	ТабДокумент.Присоединить(Ячейка);
	Ячейка.ТекущаяОбласть.Текст = "Статус обработки";   
	ТабДокумент.Присоединить(Ячейка);  
	
	Ячейка.ТекущаяОбласть.Шрифт = ШрифтСтроки;
	Ячейка.ТекущаяОбласть.ЦветФона = WebЦвета.Белый;
	
	Возврат Ячейка;
КонецФункции
//ДИТ, Беляев СЮ, ТА47544, 09-03-2022, конец	
	
//ДИТ, Беляев СЮ, ТА47544, 09-03-2022, начало
&НаСервере
Процедура ВыполнитьНаСервере() 
	Ячейка = ПодготовитьТабличныйДокумент();
	
	ВалютыСоответствие = Новый Соответствие();	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Валюты.Ссылка КАК Ссылка,
		|	Валюты.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Валюты КАК Валюты";	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВалютыСоответствие.Вставить(нрег(ВыборкаДетальныеЗаписи.Наименование), ВыборкаДетальныеЗаписи.Ссылка);	
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаявкаСоставУслуги.ПСЦ КАК ПСЦ
		|ПОМЕСТИТЬ Протоколы
		|ИЗ
		|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|ГДЕ
		|	ЗаявкаСоставУслуги.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ЗаявкаСоставУслуги.ПСЦ.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Протоколы.ПСЦ КАК ПСЦ,
		|	МАКСИМУМ(ПСЦСверхнормативноеПользование.Услуга) КАК Услуга
		|ПОМЕСТИТЬ ПротоколыУжеЗаполненные
		|ИЗ
		|	Протоколы КАК Протоколы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПСЦ.СверхнормативноеПользование КАК ПСЦСверхнормативноеПользование
		|		ПО Протоколы.ПСЦ.Ссылка = ПСЦСверхнормативноеПользование.Ссылка
		|			И (ПСЦСверхнормативноеПользование.Услуга = ЗНАЧЕНИЕ(Справочник.Номенклатура.СНПконтейнеров))
		|
		|СГРУППИРОВАТЬ ПО
		|	Протоколы.ПСЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПСЦКалькуляции.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ПротоколыУжеЗаполненные.Услуга ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК УжеЗаполненаУслуга
		|ПОМЕСТИТЬ ПротоколыПроверенные
		|ИЗ
		|	Документ.ПСЦ.Калькуляции КАК ПСЦКалькуляции
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Протоколы КАК Протоколы
		|		ПО ПСЦКалькуляции.Ссылка = Протоколы.ПСЦ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПротоколыУжеЗаполненные КАК ПротоколыУжеЗаполненные
		|		ПО ПСЦКалькуляции.Ссылка = ПротоколыУжеЗаполненные.ПСЦ
		|ГДЕ
		|	ПСЦКалькуляции.Калькуляция.веб_ДляКТКЕвросиб
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПротоколыПроверенные.Ссылка КАК Ссылка,
		|	ПротоколыПроверенные.УжеЗаполненаУслуга КАК УжеЗаполненаУслуга
		|ИЗ
		|	ПротоколыПроверенные КАК ПротоколыПроверенные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПСЦПунктыПСЦ.Ссылка КАК Ссылка,
		|	ПСЦПунктыПСЦ.НомерСтроки КАК НомерСтроки,
		|	ПСЦПунктыПСЦ.НомерПункта КАК НомерПункта,
		|	ПСЦПунктыПСЦ.ТекстПунктаРус КАК ТекстПунктаРус
		|ИЗ
		|	Документ.ПСЦ.ПунктыПСЦ КАК ПСЦПунктыПСЦ
		|ГДЕ
		|	ПСЦПунктыПСЦ.Ссылка В
		|			(ВЫБРАТЬ
		|				ПротоколыПроверенные.Ссылка
		|			ИЗ
		|				ПротоколыПроверенные КАК ПротоколыПроверенные)
		|	И ПСЦПунктыПСЦ.ТекстПунктаРус ПОДОБНО &ТекстПунктаРус";
	
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ТекстПунктаРус","Пользование КТК:%");
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаДетальныеЗаписи = МассивРезультатов[3].Выбрать();
	ТЗПунктовПСЦ = МассивРезультатов[4].Выгрузить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		ПунктПСЦ = "";   
		СтатусОбработки = "";   
		РасшифровкаПункта = "";
		Если ВыборкаДетальныеЗаписи.УжеЗаполненаУслуга Тогда
			СтатусОбработки = "Уже заполнена услуга";
		Иначе
			НайденныеСтроки = ТЗПунктовПСЦ.НайтиСтроки(Новый Структура("Ссылка",ВыборкаДетальныеЗаписи.Ссылка));
			Если НайденныеСтроки.Количество()>0 Тогда
				ПунктПСЦ = НайденныеСтроки[0].ТекстПунктаРус;
				СтруктураДанных = ПолучитьДанныеИзШаблона(ПунктПСЦ, ВалютыСоответствие); 
				РасшифровкаПункта = ПолучитьСтрокуИзСтруктуры(СтруктураДанных);
				СтатусОбработки =  ЗаполнитьУслугуВДокумент(ВыборкаДетальныеЗаписи.Ссылка, СтруктураДанных);
			Иначе
				СтатусОбработки = "НЕТ данных";
			КонецЕсли;  
		КонецЕсли;   
		
		Ячейка.ТекущаяОбласть.Текст = ВыборкаДетальныеЗаписи.Ссылка;
		Ячейка.ТекущаяОбласть.Расшифровка = ВыборкаДетальныеЗаписи.Ссылка;
		ТабДокумент.Вывести(Ячейка);
		Ячейка.ТекущаяОбласть.Текст = ПунктПСЦ;
		ТабДокумент.Присоединить(Ячейка);
		Ячейка.ТекущаяОбласть.Текст = РасшифровкаПункта;
		ТабДокумент.Присоединить(Ячейка);
		Ячейка.ТекущаяОбласть.Текст = СтатусОбработки;
		ТабДокумент.Присоединить(Ячейка);
	КонецЦикла;
	ТабДокумент.ФиксацияСверху = 1;	
КонецПроцедуры   
//ДИТ, Беляев СЮ, ТА47544, 09-03-2022, конец

//ДИТ, Беляев СЮ, ТА47544, 09-03-2022, начало
&НаСервере
Функция ЗаполнитьУслугуВДокумент(вхСсылка, вхСтруктураДанных) 
	Для каждого Элемент Из вхСтруктураДанных Цикл 
		Если Элемент.Значение = Неопределено Тогда
			Возврат "Не все параметры определены";
		КонецЕсли;
	КонецЦикла;	
	
	ТипыКТК = вхСтруктураДанных.ТипыКТК;
	НормативныйСрок = вхСтруктураДанных.НормативныйСрок;
	Ставка = вхСтруктураДанных.Ставка;
	Валюта = вхСтруктураДанных.Валюта;
	СтавкаВключаетНДС = вхСтруктураДанных.СтавкаВключаетНДС;
	СтавкаНДС = вхСтруктураДанных.СтавкаНДС;

	ДокументОбъект = вхСсылка.ПолучитьОбъект();
	
	МассивТиповКТК = Новый Массив;
	МассивНаименованийКТК = СтрРазделить(ТипыКТК,",");
	Для Каждого Элемент ИЗ МассивНаименованийКТК Цикл 
		ТипКТК = Справочники.РазмерыКТК.НайтиПоНаименованию(СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Элемент));
		Если ТипКТК = Неопределено Тогда
			Возврат "Не удалось найти тип КТК - "+Элемент;
		КонецЕсли;
	    МассивТиповКТК.Добавить(ТипКТК);
	КонецЦикла;
		
	Для Каждого ТипКТК ИЗ МассивТиповКТК Цикл  
		НоваяСтрокаДокумента = ДокументОбъект.СверхнормативноеПользование.Добавить();
		НоваяСтрокаДокумента.Услуга = Справочники.Номенклатура.СНПКонтейнеров; 
		НоваяСтрокаДокумента.НормативныйСрок = НормативныйСрок;
		НоваяСтрокаДокумента.ТипКТК = ТипКТК;
		НоваяСтрокаДокумента.Валюта = Валюта;
		НоваяСтрокаДокумента.СтавкаНДС = СтавкаНДС;
		НоваяСтрокаДокумента.СтавкаВключаетНДС = СтавкаВключаетНДС;
		НоваяСтрокаДокумента.Ставка = Ставка;
		НоваяСтрокаДокумента.ГУИДСтроки = Новый УникальныйИдентификатор;
		
		НСтр = ДокументОбъект.ПрогрессивнаяШкалаСНП.Добавить();
		НСтр.ГУИДСтроки = НоваяСтрокаДокумента.ГУИДСтроки;
		НСтр.От = 0;
		НСтр.До = 0;
		НСтр.Стоимость = Ставка;
	КонецЦикла;
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	Возврат "Услуга добавлена успешно";
КонецФункции 
//ДИТ, Беляев СЮ, ТА47544, 09-03-2022, конец


//ДИТ, Беляев СЮ, ТА47544, 09-03-2022, начало
&НаСервере
Функция ПолучитьСтавкуНДС(вхСтавкаЧисло)
	Результат = Неопределено;
	Если вхСтавкаЧисло = 10 Тогда
		Результат = Перечисления.СтавкиНДС.НДС10;
	ИначеЕсли вхСтавкаЧисло = 20 Тогда
		Результат = Перечисления.СтавкиНДС.НДС20;
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Начало: 25.12.2024
	ИначеЕсли вхСтавкаЧисло = 5 Тогда
		Результат = Перечисления.СтавкиНДС.НДС5;
	ИначеЕсли вхСтавкаЧисло = 7 Тогда
		Результат = Перечисления.СтавкиНДС.НДС7;
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Конец: 25.12.2024
	//Евросиб СубботинВ #125845 09.12.2025 Начало
	ИначеЕсли НДС = "22" Тогда
		Результат = Перечисления.СтавкиНДС.НДС22;
	//Евросиб СубботинВ #125845 09.12.2025 Конец
	КонецЕсли;
	Возврат Результат;
КонецФункции	 
//ДИТ, Беляев СЮ, ТА47544, 09-03-2022, конец

//ДИТ, Беляев СЮ, ТА47544, 09-03-2022, начало
&НаСервере
Функция ПолучитьСтрокуИзСтруктуры(СтруктураДанных) 
	Результат = "";
	Для каждого Элемент Из СтруктураДанных Цикл 
		Результат = Результат + СокрЛП(Элемент.Ключ) + " = " + СокрЛП(Элемент.Значение) + Символы.ПС;	
	КонецЦикла; 
	Возврат Результат;
КонецФункции     
//ДИТ, Беляев СЮ, ТА47544, 09-03-2022, конец

//ДИТ, Беляев СЮ, ТА47544, 09-03-2022, начало
&НаСервере
Функция ПолучитьДанныеИзШаблона(вхСтрока, вхВалютыСоответствие)
	//1 - #ТипКТК
	//2 - #НормативныйСрок
	//3 - #Ставка
	//4 - #Валюта
	//5 - #СтавкаВключаетНДС
	//6 - #СтавкаНДС 
	РезультатСтруктура = Новый Структура(); 
	РезультатСтруктура.Вставить("ТипыКТК",Неопределено);
	РезультатСтруктура.Вставить("НормативныйСрок",Неопределено);
	РезультатСтруктура.Вставить("Ставка",Неопределено);
	РезультатСтруктура.Вставить("Валюта",Неопределено);
	РезультатСтруктура.Вставить("СтавкаВключаетНДС",Неопределено);
	РезультатСтруктура.Вставить("СтавкаНДС",Неопределено);
	
	ПрефиксСрокаНормативногоПользования = НРег("Срок нормативного пользования");
	ПрефиксСверхнормативноеПользование = НРег("Сверхнормативное пользование:"); 
	ФлагНачалаСНП = Ложь;
	//ПрефиксСрокаНормативногоПользования_передСроком = нрег(") –");
	Для счСтрок = 1 По СтрЧислоСтрок(вхСтрока) Цикл
		текСтрока = нрег(СтрПолучитьСтроку(вхСтрока,счСтрок));
		Если СтрНайти(текСтрока,ПрефиксСрокаНормативногоПользования)>0 Тогда     
			МассивЧисел = НайтиЧисловыеЗначения(текСтрока);  
			//срок нормативного пользования 40ф (с момента выдачи порожнего до момента сдачи порожнего КТК) - 18 сут
			//срок нормативного пользования 20ф/40ф (с момента выдачи порожнего до момента сдачи порожнего КТК) - 18 сут
			Если МассивЧисел.Количество()=2 Тогда
				РезультатСтруктура.Вставить("ТипыКТК",Строка(МассивЧисел[0]));//Справочники.РазмерыКТК.НайтиПоНаименованию(СтроковыеФункцииКлиентСервер.СтрокаВЧисло(МассивЧисел[0])));	
				РезультатСтруктура.Вставить("НормативныйСрок",СтроковыеФункцииКлиентСервер.СтрокаВЧисло(МассивЧисел[1]));  
			ИначеЕсли  СтрНайти(текСтрока,"/")>0 И МассивЧисел.Количество()=3 Тогда
				РезультатСтруктура.Вставить("ТипыКТК",Строка(МассивЧисел[0]+","+Строка(МассивЧисел[1])));
				РезультатСтруктура.Вставить("НормативныйСрок",СтроковыеФункцииКлиентСервер.СтрокаВЧисло(МассивЧисел[2])); 				
			КонецЕсли;  				
		КонецЕсли;                 
		Если ФлагНачалаСНП Тогда
			//40 - 520 EUR/сут в т.ч. НДС 20%
			//40 - От 0 до 20 - 520 EUR/сут в т.ч. НДС 20%
			//40 - С 21 и далее - 610 EUR/сут в т.ч. НДС 20%
			//40ф и 20ф - 2000 руб/сут в т.ч. НДС 20%
			текСтрока = СтрЗаменить(текСтрока,"в т.ч.","");
			ПозицияБуквыИ = СтрНайти(текСтрока," и ");
			Если ПозицияБуквыИ>0 Тогда
				текСтрока = Сред(текСтрока,ПозицияБуквыИ);
			КонецЕсли;
			МассивЧисел = НайтиЧисловыеЗначения(текСтрока);	
			Если МассивЧисел.Количество()>=2 Тогда     
				РезультатСтруктура.Вставить("Ставка",СтроковыеФункцииКлиентСервер.СтрокаВЧисло(МассивЧисел[1]));
				РезультатСтруктура.Вставить("Валюта",НайтиВалюту(текСтрока,вхВалютыСоответствие));
			КонецЕсли;
			Если МассивЧисел.Количество()>=3 Тогда     
				РезультатСтруктура.Вставить("СтавкаНДС",ПолучитьСтавкуНДС(СтроковыеФункцииКлиентСервер.СтрокаВЧисло(МассивЧисел[2])));
				РезультатСтруктура.Вставить("СтавкаВключаетНДС",Истина);	
			КонецЕсли;					
		КонецЕсли;
		Если СтрНайти(текСтрока,ПрефиксСверхнормативноеПользование)>0 Тогда
			ФлагНачалаСНП = Истина;			
		КонецЕсли;			
	КонецЦикла;	
	Возврат РезультатСтруктура;
КонецФункции 
//ДИТ, Беляев СЮ, ТА47544, 09-03-2022, конец

//ДИТ, Беляев СЮ, ТА47544, 09-03-2022, начало
&НаСервере
Функция НайтиВалюту(Знач вхСтрока, вхВалютыСоответствие)
	стрДляОбработки = НРег(вхСтрока);
	Если СтрНайти(нрег(стрДляОбработки),"руб")>0 Тогда
		Возврат Справочники.Валюты.Рубль;
	КонецЕсли;
	Для Каждого Элемент ИЗ вхВалютыСоответствие Цикл
		Если СтрНайти(стрДляОбработки,Элемент.Значение)>0 Тогда
			Возврат Элемент.Значение;
		КонецЕсли;
	КонецЦикла;
	Возврат  Справочники.Валюты.ПустаяСсылка();
КонецФункции  
//ДИТ, Беляев СЮ, ТА47544, 09-03-2022, конец

//ДИТ, Беляев СЮ, ТА47544, 09-03-2022, начало
&НаСервере
Функция НайтиЧисловыеЗначения(Знач вхСтрока)
	МассивЧисел	= Новый Массив;
	стрДопустимыхЗнаков = "0123456789.";
	стрЧисло = "";
	Пока СтрДлина(вхСтрока)>0 цикл
		ТекСимвол = Лев(вхСтрока,1);
		Если СтрНайти(стрДопустимыхЗнаков,ТекСимвол)>0 Тогда
			стрЧисло = стрЧисло + ТекСимвол;			
		Иначе
			Если СтрДлина(стрЧисло)>0 Тогда
				МассивЧисел.Добавить(стрЧисло);
				стрЧисло = "";
			КонецЕсли;
		КонецЕсли;				
		вхСтрока = Сред(вхСтрока,2);	
	КонецЦикла;     
	Если СтрДлина(стрЧисло)>0 Тогда
		МассивЧисел.Добавить(стрЧисло);
		стрЧисло = "";
	КонецЕсли;
	Возврат МассивЧисел;
КонецФункции     
//ДИТ, Беляев СЮ, ТА47544, 09-03-2022, конец

//ДИТ, Беляев СЮ, ТА47544, 09-03-2022, начало
&НаКлиенте
Процедура ВыполнитьОбработку(Команда) 
	Если НЕ ЗначениеЗаполнено(Период.ДатаНачала) ИЛИ НЕ ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		ПоказатьПредупреждение(,"Не выбран период!",,);
		Возврат;
	КонецЕсли;    
	ВыполнитьНаСервере(); 
КонецПроцедуры    
//ДИТ, Беляев СЮ, ТА47544, 09-03-2022, конец

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )
