&НаКлиенте
Перем мСтрокаДоИзменения;


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект) 	

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды   
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	


	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	//ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	
КонецПроцедуры

#КонецОбласти



#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Разделить(Команда)
	
		
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды



&НаКлиенте
Процедура Заполнить(Команда)
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтотОбъект), "Введенные вручную данные будут утеряны. Продолжить?", РежимДиалогаВопрос.ДаНет);	
КонецПроцедуры


#КонецОбласти



#Область Прочее

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗавершение(Ответ, ДополнительныеПараметры) Экспорт

КонецПроцедуры


&НаКлиенте
Процедура ГрузоотправительПриИзменении(Элемент)
	
	Если Объект.ГрузоотправительАдрес = "" и Тип("СправочникСсылка.э_ПаспортаОрганизаций") = ТипЗнч(Объект.Грузоотправитель) Тогда
		//Объект.ГрузоотправительАдрес = ПолучитьАдресИЗПаспортаОрганизации(Объект.Грузоотправитель);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ГрузополучательПриИзменении(Элемент)
	
	Если Объект.ГрузополучательАдрес = "" и Тип("СправочникСсылка.э_ПаспортаОрганизаций") = ТипЗнч(Объект.Грузополучатель) Тогда
		//Объект.ГрузополучательАдрес = ПолучитьАдресИЗПаспортаОрганизации(Объект.Грузополучатель);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
КонецПроцедуры

&НаКлиенте
Процедура СтанцияНазначенияНаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьФорму("Справочник.БизнесРегионы.ФормаВыбора",,Элемент,Новый УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура СтранаОтправленияНаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьФорму("Справочник.БизнесРегионы.ФормаВыбора",,Элемент,Новый УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура СтранаОтправленияНаименованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Объект.СтанцияОтправления = ВыбранноеЗначение;
	УстановитьПредставлениеСтанции(СтанцияОтправленияПолноеНаименованиеДорогаКод, ВыбранноеЗначение);
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СтанцияНазначенияНаименованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Объект.СтанцияНазначения = ВыбранноеЗначение;
	УстановитьПредставлениеСтанции(СтанцияНазначенияПолноеНаименованиеДорогаКод, ВыбранноеЗначение, Истина);
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура УстановитьПредставлениеСтанции(ЭлементФормы, Значение, ПроверитьНаЗаполненость = Ложь)
КонецПроцедуры

&НаКлиенте
Процедура СтранаОтправленияНаименованиеОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.БизнесРегионы.ФормаОбъекта", Новый Структура("Ключ", Объект.СтанцияОтправления));
КонецПроцедуры

&НаКлиенте
Процедура СтанцияНазначенияНаименованиеОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.БизнесРегионы.ФормаОбъекта", Новый Структура("Ключ", Объект.СтанцияНазначения));
КонецПроцедуры

&НаКлиенте
Процедура ПогрузкаСредствамиЖДПриИзменении(Элемент)
	Если ПогрузкаСредствамиЖД Тогда 
		Объект.ПогрузкаСредствамиИД = 1;
	Иначе
		Объект.ПогрузкаСредствамиИД = 0;
	КонецЕсли;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ГрузоотправительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьФорму("Справочник.э_ПаспортаОрганизаций.ФормаВыбора",,Элемент,Новый УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ГрузополучательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьФорму("Справочник.э_ПаспортаОрганизаций.ФормаВыбора",,Элемент,Новый УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ГрузоотправительОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Объект.Грузоотправитель = ВыбранноеЗначение;
	УстановитьПредставлениеПаспортаОрганизации(ГрузоотправительПолноеНаименование, ВыбранноеЗначение);
	Модифицированность = Истина;	
КонецПроцедуры

&НаКлиенте
Процедура ГрузополучательОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Объект.Грузополучатель = ВыбранноеЗначение;
	УстановитьПредставлениеПаспортаОрганизации(ГрузополучательПолноеНаименование, ВыбранноеЗначение);
	Модифицированность = Истина;	
КонецПроцедуры

&НаКлиенте
Процедура ГрузоотправительОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.э_ПаспортаОрганизаций.ФормаОбъекта", Новый Структура("Ключ", Объект.Грузоотправитель));
КонецПроцедуры

&НаКлиенте
Процедура ГрузополучательОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.э_ПаспортаОрганизаций.ФормаОбъекта", Новый Структура("Ключ", Объект.Грузополучатель));
КонецПроцедуры

&НаСервере
Процедура УстановитьПредставлениеПаспортаОрганизации(ЭлементФормы, Значение)
	Если ЗначениеЗаполнено(Значение) Тогда
		Если ТипЗнч(Значение) = Тип("Строка") Тогда 
			ЭлементФормы = Значение;
		Иначе
			ЭлементФормы = Значение.Наименование;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры



#КонецОбласти



