
//Евросиб Коханенко Н.А. #61705 12.12.2022 (

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	// проверим содержимое полей "Адреса инструкций" в таблице
	Для Каждого стрАдреса из Объект.Адреса Цикл
		Если НРег(Лев(стрАдреса.АдресИнструкции, 8)) <> "https://" Тогда
			Сообщение = Новый СообщениеПользователю;
			ИндексСтроки = стрАдреса.НомерСтроки - 1;
			Сообщение.Поле = "Объект.Адреса["+ИндексСтроки+"].АдресИнструкции";
			Сообщение.Текст = "Некорректный адрес. Содержимое колонки ""Адрес инструкции"" в строке " 
									+ (ИндексСтроки+1) + " списка ""Адреса"" должно начинаться с ""https://""";
			Сообщение.Сообщить();
			Отказ = Истина;
			Возврат
		Иначе
			Если Лев(стрАдреса.АдресИнструкции, 8) <> "https://"  Тогда
			    стрАдреса.АдресИнструкции = "https://" + Прав(стрАдреса.АдресИнструкции, СтрДлина(стрАдреса.АдресИнструкции)-8); 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры 

&НаСервере
Функция ПроверкаНаДублиНеПройдена(ТабЧасть)

	ТЗДок = ТабЧасть.Выгрузить();
	ТЗДок.Колонки.Добавить("КоличествоДублей");
	ТЗДок.ЗаполнитьЗначения(1,"КоличествоДублей");

	ТЗДок.Свернуть("ИмяФормы,НазваниеИнструкции","КоличествоДублей");
	Для каждого Стр Из ТЗДок Цикл
	   	Если Стр.КоличествоДублей > 1 тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Обнаружены недопустимые совпадения в таблице для Имени формы: ""%1"" и Названия инструкции: ""%2""", 
				Стр.ИмяФормы, Стр.НазваниеИнструкции));
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	ТЗДок = ТабЧасть.Выгрузить();
	ТЗДок.Колонки.Добавить("КоличествоДублей");
	ТЗДок.ЗаполнитьЗначения(1,"КоличествоДублей");

	ТЗДок.Свернуть("ИмяФормы,АдресИнструкции","КоличествоДублей");
	Для каждого Стр Из ТЗДок Цикл
	   	Если Стр.КоличествоДублей > 1 тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Обнаружены недопустимые совпадения в таблице для Имени формы: ""%1"" и Адреса инструкции: ""%2""", 
				Стр.ИмяФормы, Стр.АдресИнструкции));
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ЗаполнитьСписокВыбораНаименованиеОбъектаНаСервере();
	ЗаполнитьСписокВыбораАдресаИмяФормыНаСервере();
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

&НаСервере
Процедура ЗаполнитьСписокВыбораНаименованиеОбъектаНаСервере()
	Элементы.НаименованиеОбъекта.СписокВыбора.Очистить();
	// добавляем Справочники
	Для каждого Спр Из Метаданные.Справочники Цикл   
		Если Спр.Формы.Количество() > 0 Тогда
	        //Евросиб Коханенко Н.А. #65974 20.02.2023 (( 
	        //Элементы.НаименованиеОбъекта.СписокВыбора.Добавить(Спр.Имя, Спр.Синоним);  
	        Элементы.НаименованиеОбъекта.СписокВыбора.Добавить(Спр.Имя, Спр.Имя);  
			//Евросиб Коханенко Н.А. #65974 20.02.2023 )) 
		КонецЕсли;
	КонецЦикла;    
    // добавляем Документы    
    Для каждого Док Из Метаданные.Документы Цикл
		Если Док.Формы.Количество() > 0 Тогда
	        //Евросиб Коханенко Н.А. #65974 20.02.2023 (( 
	        //Элементы.НаименованиеОбъекта.СписокВыбора.Добавить(Док.Имя, Док.Синоним);  
	        Элементы.НаименованиеОбъекта.СписокВыбора.Добавить(Док.Имя, Док.Имя);  
			//Евросиб Коханенко Н.А. #65974 20.02.2023 )) 
		КонецЕсли;	
	КонецЦикла; 
    // добавляем Обработки
	Для каждого Обр Из Метаданные.Обработки Цикл
        //Евросиб Коханенко Н.А. #65974 20.02.2023 (( 
        //Элементы.НаименованиеОбъекта.СписокВыбора.Добавить(Обр.Имя, Обр.Синоним);  
        Элементы.НаименованиеОбъекта.СписокВыбора.Добавить(Обр.Имя, Обр.Имя);  
		//Евросиб Коханенко Н.А. #65974 20.02.2023 )) 
	КонецЦикла; 
    // добавляем Отчеты
	Для каждого Отч Из Метаданные.Отчеты Цикл
        //Евросиб Коханенко Н.А. #65974 20.02.2023 (( 
        //Элементы.НаименованиеОбъекта.СписокВыбора.Добавить(Отч.Имя, Отч.Синоним);  
        Элементы.НаименованиеОбъекта.СписокВыбора.Добавить(Отч.Имя, Отч.Имя);  
		//Евросиб Коханенко Н.А. #65974 20.02.2023 )) 
    КонецЦикла; 
	//Евросиб Коханенко Н.А. #64811 27.01.2023 (( 
	// добавляем Общие формы
	Для каждого Фор Из Метаданные.ОбщиеФормы Цикл
        //Евросиб Коханенко Н.А. #65974 20.02.2023 (( 
		//Элементы.НаименованиеОбъекта.СписокВыбора.Добавить(Фор.Имя, Фор.Синоним);
		Элементы.НаименованиеОбъекта.СписокВыбора.Добавить(Фор.Имя, Фор.Имя);
		//Евросиб Коханенко Н.А. #65974 20.02.2023 )) 
	КонецЦикла; 
    //Евросиб Коханенко Н.А. #64811 27.01.2023 )) 
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеОбъектаПриИзменении(Элемент)
	ЗаполнитьСписокВыбораАдресаИмяФормыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораАдресаИмяФормыНаСервере()
	
	Элементы.АдресаИмяФормы.СписокВыбора.Очистить();
	
	//Евросиб Коханенко Н.А. #64811 27.01.2023 (( 
	Если Объект.Наименование = "" Тогда
		Возврат;
	КонецЕсли;
	//Евросиб Коханенко Н.А. #64811 27.01.2023 )) 
	
	ПредопределенныеФормыОбнаружены = Ложь;
	
	// если Справочник
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Справочник."+Объект.Наименование);
	Если ОбъектМетаданных <> Неопределено Тогда
		// если объект нашелся
		Для каждого Форма Из ОбъектМетаданных.Формы Цикл
        	Элементы.АдресаИмяФормы.СписокВыбора.Добавить(Форма.Имя, Форма.Имя); 
        	ПредопределенныеФормыОбнаружены = Истина;
		КонецЦикла;
		Если НЕ ПредопределенныеФормыОбнаружены Тогда
			Элементы.АдресаИмяФормы.СписокВыбора.Добавить("ФормаСписка", "ФормаСписка");  
			Элементы.АдресаИмяФормы.СписокВыбора.Добавить("ФормаОбъекта", "ФормаОбъекта");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// если Документ
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Документ."+Объект.Наименование);
	Если ОбъектМетаданных <> Неопределено Тогда
		// если объект нашелся
		Для каждого Форма Из ОбъектМетаданных.Формы Цикл
        	Элементы.АдресаИмяФормы.СписокВыбора.Добавить(Форма.Имя, Форма.Имя); 
        	ПредопределенныеФормыОбнаружены = Истина;
		КонецЦикла;
		Если НЕ ПредопределенныеФормыОбнаружены Тогда
		    Элементы.АдресаИмяФормы.СписокВыбора.Добавить("ФормаДокумента", "ФормаДокумента");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// если Отчет
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Отчет."+Объект.Наименование);
	Если ОбъектМетаданных <> Неопределено Тогда
		// если объект нашелся
		Для каждого Форма Из ОбъектМетаданных.Формы Цикл
        	Элементы.АдресаИмяФормы.СписокВыбора.Добавить(Форма.Имя, Форма.Имя); 
			Если Форма.Имя = "ФормаОтчета" Тогда
				ПредопределенныеФормыОбнаружены = Истина;
			КонецЕсли;
		КонецЦикла;
		Если НЕ ПредопределенныеФормыОбнаружены Тогда
			//Евросиб Коханенко Н.А. #65974 20.02.2023 (( 
			//Элементы.АдресаИмяФормы.СписокВыбора.Добавить("ОбщаяФорма", "ОбщаяФорма");
			Элементы.АдресаИмяФормы.СписокВыбора.Добавить("ФормаОтчета", "ФормаОтчета");
			//Евросиб Коханенко Н.А. #65974 20.02.2023 )) 
		КонецЕсли;
		Возврат;
		//КонецЕсли;
	КонецЕсли;
	
	// если Обработка
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Обработка."+Объект.Наименование);
	Если ОбъектМетаданных <> Неопределено Тогда
		// если объект нашелся
		Для каждого Форма Из ОбъектМетаданных.Формы Цикл
        	Элементы.АдресаИмяФормы.СписокВыбора.Добавить(Форма.Имя, Форма.Имя); 
        	ПредопределенныеФормыОбнаружены = Истина;
		КонецЦикла;
		Если НЕ ПредопределенныеФормыОбнаружены Тогда
		    Элементы.АдресаИмяФормы.СписокВыбора.Добавить("ФормаОбработки", "ФормаОбработки");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	//Евросиб Коханенко Н.А. #64811 27.01.2023 (( 
	// если Общая форма
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("ОбщаяФорма."+Объект.Наименование); 
	Если ОбъектМетаданных <> Неопределено Тогда
		// если объект нашелся
		// то у него нет подчиненных форм, поэтому берем имя самой общей формы
		Элементы.АдресаИмяФормы.СписокВыбора.Добавить(ОбъектМетаданных.Имя, ОбъектМетаданных.Имя);
	КонецЕсли;
	//Евросиб Коханенко Н.А. #64811 27.01.2023 )) 

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиИнструкций.Наименование КАК Наименование,
		|	НастройкиИнструкций.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НастройкиИнструкций КАК НастройкиИнструкций
		|ГДЕ
		|	НастройкиИнструкций.Наименование = &Наименование
		|	И 
		|	НастройкиИнструкций.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Наименование", ТекущийОбъект.Наименование);
	Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("В справочнике уже существует запись для объекта " + ТекущийОбъект.Наименование);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
    
	// проверим на дубли комбинаций ИмяФормы + НазваниеИнструкции и ИмяФормы + АдресИнструкции
	Если ПроверкаНаДублиНеПройдена(ТекущийОбъект.Адреса) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 12.12.2022 )
 
