Функция ПолучитьСтруктуруСоответствияРеквизитаВагонРеквизитуЖДН() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыЖДН.ИмяРеквизитаЖДНВСоставеПоезда КАК ИмяРеквизитаЖДНВСоставеПоезда,
	|	ВидыЖДН.ИмяРеквизитаВагонВСоставеПоезда КАК ИмяРеквизитаВагонВСоставеПоезда
	|ИЗ
	|	Справочник.ВидыЖДН КАК ВидыЖДН
	|ГДЕ
	|	НЕ ВидыЖДН.ПометкаУдаления";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	СтруктураСоответствияРеквизитаВагонРеквизитуЖДН = Новый Структура();
	Пока Выборка.Следующий() Цикл
		СтруктураСоответствияРеквизитаВагонРеквизитуЖДН.Вставить(Выборка.ИмяРеквизитаЖДНВСоставеПоезда, Выборка.ИмяРеквизитаВагонВСоставеПоезда);
	КонецЦикла;
	Возврат СтруктураСоответствияРеквизитаВагонРеквизитуЖДН;
	
КонецФункции
