Функция ГруппаВключаетПользователя(Группа, Пользователь) Экспорт
	
	Если Группа = Пользователь Тогда Возврат Истина; КонецЕсли;
	Если ТипЗнч(Группа) = Тип("СправочникСсылка.Пользователи") Тогда Возврат Ложь; КонецЕсли;
	
	Запрос = Новый Запрос;
//Евросиб Гудкова( 01.06.2020 Ticket№ 0196045
//было
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ГруппыПользователейСостав.Ссылка КАК Ссылка
	//               |ИЗ
	//               |	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	//               |ГДЕ
	//               |	ГруппыПользователейСостав.Ссылка = &Группа
	//               |	И ГруппыПользователейСостав.Пользователь = &Пользователь";
//стало
	Запрос.Текст = "ВЫБРАТЬ
	               |	СоставыГруппПользователей.ГруппаПользователей КАК ГруппаПользователей
	               |ИЗ
	               |	РегистрСведений.СоставыГруппПользователей КАК СоставыГруппПользователей
	               |ГДЕ
	               |	СоставыГруппПользователей.Пользователь = &Пользователь
	               |	И СоставыГруппПользователей.ГруппаПользователей = &Группа
	               |	И СоставыГруппПользователей.Используется";
// Евросиб Гудкова) 				   
	Запрос.УстановитьПараметр("Группа", Группа);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ПолучитьСписокМоихГрупп(Пользователь, Замещающий = Ложь) Экспорт
	
	ПользовательЪ = Новый Массив;
	ПользовательЪ.Добавить(Пользователь);
	Если Замещающий <> Ложь Тогда
		//ДИТ Поморцева Т.П. Задача 238786 04.08.2021 начало
		//ПользовательЪ.Добавить(Замещающий);
		Для Каждого Элемент ИЗ Замещающий Цикл
			ПользовательЪ.Добавить(Элемент);
		КонецЦикла
		//ДИТ Поморцева Т.П. Задача 238786 04.08.2021 конец
	КонецЕсли;
	
	Запрос = Новый Запрос;
//Евросиб Гудкова( 01.06.2020 Ticket№ 0196045
//было
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ГруппыПользователейСостав.Ссылка КАК Ссылка
	//               |ИЗ
	//               |	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	//               |ГДЕ
	//               |	ГруппыПользователейСостав.Пользователь В (&Пользователь)";
//стало
	Запрос.Текст = "ВЫБРАТЬ
	               |	СоставыГруппПользователей.ГруппаПользователей КАК Ссылка
	               |ИЗ
	               |	РегистрСведений.СоставыГруппПользователей КАК СоставыГруппПользователей
	               |ГДЕ
	               |	СоставыГруппПользователей.Пользователь В (&Пользователь)
	               |	И СоставыГруппПользователей.Используется";
// Евросиб Гудкова) 				   
	Запрос.УстановитьПараметр("Пользователь", ПользовательЪ);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ПолучитьПользователейГруппы(Группа, Знач ПериодЗамещения = неопределено, ВСлучаеЗамещенияДобавлятьТолькоЗамещающего = Ложь) Экспорт
//Субботин 74702 14.09.2023 начало // перенесено в общий модуль	
//	Результат = Новый Массив;
//	Если НЕ ЗначениеЗаполнено(ПериодЗамещения) тогда ПериодЗамещения = ТекущаяДата(); КонецЕсли;
//	
//	Запрос = Новый Запрос;
////Евросиб Гудкова( 16.07.2020 Ticket№ 0200249
////было
//////Евросиб Гудкова( 01.06.2020 Ticket№ 0196045
//////было
////	//Запрос.Текст = "ВЫБРАТЬ
////	//               |	ГруппыПользователейСостав.Пользователь КАК Пользователь,
////	//               |	ЗамещениеЪ.Замещение КАК Замещение
////	//               |ИЗ
////	//               |	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
////	//               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Замещение КАК ЗамещениеЪ
////	//               |		ПО (ГруппыПользователейСостав.Пользователь = ЗамещениеЪ.ИсходныйПользователь
////	//               |				И ЗамещениеЪ.Проведен
////	//               |				И ЗамещениеЪ.РежимДокумента = 0
////	//               |				И (&ТекущаяДата МЕЖДУ ЗамещениеЪ.НачалоПериодаЗамещения И ЗамещениеЪ.КонецПериодаЗамещения))
////	//               |ГДЕ
////	//               |	ГруппыПользователейСостав.Ссылка = &Группа";
////стало
//Запрос.Текст = "ВЫБРАТЬ
//               |	СоставыГруппПользователей.Пользователь КАК Пользователь
//               |ПОМЕСТИТЬ ПользователиГруппы
//               |ИЗ
//               |	РегистрСведений.СоставыГруппПользователей КАК СоставыГруппПользователей
////Евросиб Гудкова( 15.07.2020 Ticket№ 0200110
//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
//               |		ПО СоставыГруппПользователей.Пользователь = ГруппыПользователейСостав.Пользователь
//               |			И СоставыГруппПользователей.ГруппаПользователей = ГруппыПользователейСостав.Ссылка
//// Евросиб Гудкова) 				   
//               |ГДЕ
//               |	СоставыГруппПользователей.ГруппаПользователей = &Группа
//               |	И СоставыГруппПользователей.Используется
//               |;
//               |
//               |////////////////////////////////////////////////////////////////////////////////
//               |ВЫБРАТЬ
//               |	ПоследнееЗамещение.Пользователь КАК Пользователь,
//               |	ЗамещениеСсылка.Замещение КАК Замещение
//               |ИЗ
//               |	(ВЫБРАТЬ
//               |		ПользователиГруппы.Пользователь КАК Пользователь,
//               |		МАКСИМУМ(ЕСТЬNULL(ЗамещениеСсылка.НачалоПериодаЗамещения, ДАТАВРЕМЯ(1, 1, 1))) КАК НачалоПериодаЗамещения
//               |	ИЗ
//               |		ПользователиГруппы КАК ПользователиГруппы
//               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Замещение КАК ЗамещениеСсылка
//               |			ПО ПользователиГруппы.Пользователь = ЗамещениеСсылка.ИсходныйПользователь
//               |				И (ЗамещениеСсылка.Проведен)
//               |				И (ЗамещениеСсылка.РежимДокумента = 0)
//               |				И (&ТекущаяДата МЕЖДУ ЗамещениеСсылка.НачалоПериодаЗамещения И ЗамещениеСсылка.КонецПериодаЗамещения)
//               |				И (НЕ ЗамещениеСсылка.Замещение.Недействителен)
//               |	
//               |	СГРУППИРОВАТЬ ПО
//               |		ПользователиГруппы.Пользователь) КАК ПоследнееЗамещение
//               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Замещение КАК ЗамещениеСсылка
//               |		ПО ПоследнееЗамещение.Пользователь = ЗамещениеСсылка.ИсходныйПользователь
//               |			И ПоследнееЗамещение.НачалоПериодаЗамещения = ЗамещениеСсылка.НачалоПериодаЗамещения";
//// Евросиб Гудкова) 				   
//	Запрос.УстановитьПараметр("Группа", Группа);
//	Запрос.УстановитьПараметр("ТекущаяДата", ПериодЗамещения);
//	Ответ = Запрос.Выполнить().Выбрать();
//	Пока Ответ.Следующий() Цикл
//		
//		Если НЕ ВСлучаеЗамещенияДобавлятьТолькоЗамещающего ИЛИ Ответ.Замещение = NULL Тогда
//			Результат.Добавить(Ответ.Пользователь);
//		КонецЕсли;
//		
//		Если Ответ.Замещение <> NULL Тогда
//			Результат.Добавить(Ответ.Замещение);
//		КонецЕсли;
//		
//	КонецЦикла;
//Субботин 74702 14.09.2023 конец // перенесено в общий модуль
	
	Возврат ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьПользователейГруппы(Группа,ПериодЗамещения,ВСлучаеЗамещенияДобавлятьТолькоЗамещающего);
	
КонецФункции

//Евросиб Каблов 21.07.2020 (
//Процедура УведомитьПользователяОЕгоЗадачах() Экспорт
Процедура УведомитьПользователяОЕгоЗадачах(ОтборУведомлений = Неопределено) Экспорт
//Евросиб Каблов 21.07.2020 )	
	// первичная проверка на то, что мы вообще можем что-то отправить
	УчетнаяЗаписьПоУмолчанию = РаботаСПочтовымиСообщениями.ПроверитьСистемнаяУчетнаяЗаписьДоступна();
	
	Если не УчетнаяЗаписьПоУмолчанию Тогда возврат; КонецЕсли;
	СистемнаяУчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	АдресДублированияУведомлений = Константы.АдресДублированияОповещенийОЗадачах.Получить();
	ЗапретитьРассылкуЗадачСтаршеДней = Константы.ЗапретитьРассылкуЗадачСтаршеДней.Получить();
	Если ЗапретитьРассылкуЗадачСтаршеДней = 0 Тогда
		ЗапретитьРассылкуЗадачСтаршеДней = 999999;
	КонецЕсли;
	ДатаНачалаРазрешеннойРассылки = ТекущаяДата() - ЗапретитьРассылкуЗадачСтаршеДней * 24 * 3600;
	
	ПрефиксНС = Константы["АдресПубликацииИнформационнойБазыВЛокальнойСети"+?(ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована, "Тестовый", "")].Получить() + "#";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УведомленияПользователейОЗадачах.Документ КАК Документ,
	               |	УведомленияПользователейОЗадачах.Пользователь КАК Пользователь,
	               |	УведомленияПользователейОЗадачах.Состояние КАК Состояние
	               |ИЗ
	               |	РегистрСведений.УведомленияПользователейОЗадачах КАК УведомленияПользователейОЗадачах
	               |ГДЕ
	               |	УведомленияПользователейОЗадачах.УведомлениеОЗадаче = ЛОЖЬ
////Евросиб Гудкова( 01.06.2020 Ticket№0196045 
//	               |	И (НЕ УведомленияПользователейОЗадачах.Пользователь.Недействителен)
//// Евросиб Гудкова) 				   
                   //ДИТ, Беляев СЮ, Ticket#0249084, 21-12-2021, ++
				   |	И (УведомленияПользователейОЗадачах.Пользователь Ссылка Справочник.ГруппыПользователей ИЛИ
				   |		(УведомленияПользователейОЗадачах.Пользователь ССЫЛКА Справочник.Пользователи И 
				   |		 НЕ ВЫРАЗИТЬ(УведомленияПользователейОЗадачах.Пользователь КАК Справочник.Пользователи).Недействителен))
				   //ДИТ, Беляев СЮ, Ticket#0249084, 21-12-2021, --
				   |	И УведомленияПользователейОЗадачах.Документ.Дата > &РазрешенноеНачало";
	Запрос.УстановитьПараметр("РазрешенноеНачало", ДатаНачалаРазрешеннойРассылки);
	//Евросиб Каблов 21.07.2020 (
	//Ответ = Запрос.Выполнить().Выбрать();	
	Если ТипЗнч(ОтборУведомлений) = Тип("Структура") Тогда
		
		ТекстыОтборов = Новый Массив;
		ЗначениеОтбора = Неопределено;
		
		Если ОтборУведомлений.Свойство("Документ", ЗначениеОтбора) Тогда
			ТекстыОтборов.Добавить(" И УведомленияПользователейОЗадачах.Документ = &Документ");
			Запрос.УстановитьПараметр("Документ", ЗначениеОтбора);
		КонецЕсли;
		
		Если ОтборУведомлений.Свойство("Состояние", ЗначениеОтбора) Тогда
			ТекстыОтборов.Добавить(" И УведомленияПользователейОЗадачах.Состояние = &Состояние");
			Запрос.УстановитьПараметр("Состояние", ЗначениеОтбора);
		КонецЕсли;
		
		Если ОтборУведомлений.Свойство("Пользователь", ЗначениеОтбора) Тогда
			ТекстыОтборов.Добавить(" И УведомленияПользователейОЗадачах.Пользователь = &Пользователь");
			Запрос.УстановитьПараметр("Пользователь", ЗначениеОтбора);
		КонецЕсли;
		
		РазделительСтрок = Символы.ПС + Символы.Таб;
		ТекстОтборов = СтрСоединить(ТекстыОтборов, РазделительСтрок);
		Запрос.Текст = Запрос.Текст + РазделительСтрок + ТекстОтборов;
		
	КонецЕсли;
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаУведомлений = РезультатЗапроса.Выгрузить();
	
	//Получение данных из табличных частей "Состояния" объектов
	ТекстыЗапросов = Новый Массив;	
	ИменаОбъектовМетаданных = Новый Массив;
	ШаблонТекстаЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаСостояний.Ссылка,
	|	ТаблицаСостояний.Состояние,
	|	ТаблицаСостояний.Комментарий
	|ИЗ
	|	%1.Состояния КАК ТаблицаСостояний
	|ГДЕ
	|	(ТаблицаСостояний.Ссылка, ТаблицаСостояний.Состояние) В
	|			(ВЫБРАТЬ
	|				ТаблицаУведомлений.Документ,
	|				ТаблицаУведомлений.Состояние
	|			ИЗ
	|				ТаблицаУведомлений КАК ТаблицаУведомлений)";
	
	ТекстЗапросаСПустымРезультатом =
	"ВЫБРАТЬ
	|	NULL КАК Документ,
	|	NULL КАК Состояние,
	|	NULL КАК Комментарий
	|ГДЕ
	|	ЛОЖЬ";
	ТекстыЗапросов.Добавить(ТекстЗапросаСПустымРезультатом);
	
	//Для Каждого СтрТаблицы Из ТаблицаУведомлений Цикл
	//	МетаданныеОбъекта = СтрТаблицы.Документ.Метаданные();
	//	ТЧСостояния = МетаданныеОбъекта.ТабличныеЧасти.Найти("Состояния");
	//	Если ТЧСостояния <> Неопределено Тогда
	//		ИмяОбъекта = МетаданныеОбъекта.ПолноеИмя();
	//		Если ИменаОбъектовМетаданных.Найти(ИмяОбъекта) = Неопределено Тогда
	//			ТекстЗапроса = СтрШаблон(ШаблонТекстаЗапроса, ИмяОбъекта);
	//			ТекстыЗапросов.Добавить(ТекстЗапроса);
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	
	//ДИТ, Беляев СЮ, Ticket#0249084, ++
	//Заполним массив объектами метаданных
	МассивОбъектовМетаданных = Новый Массив; 
	Для Каждого СтрТаблицы Из ТаблицаУведомлений Цикл
		МетаданныеОбъекта = СтрТаблицы.Документ.Метаданные();
		Если МассивОбъектовМетаданных.Найти(МетаданныеОбъекта) = Неопределено Тогда
			МассивОбъектовМетаданных.Добавить(МетаданныеОбъекта);
		КонецЕсли;
	КонецЦикла;                                                  
	
	//Сформируем один запрос для всех объектов метаданных
	Для каждого ЭлементМассива Из МассивОбъектовМетаданных Цикл
		ТЧСостояния = ЭлементМассива.ТабличныеЧасти.Найти("Состояния");
		Если ТЧСостояния <> Неопределено Тогда
			ИмяОбъекта = ЭлементМассива.ПолноеИмя();
			Если ИменаОбъектовМетаданных.Найти(ИмяОбъекта) = Неопределено Тогда
				ТекстЗапроса = СтрШаблон(ШаблонТекстаЗапроса, ИмяОбъекта);
				ТекстыЗапросов.Добавить(ТекстЗапроса);
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	//ДИТ, Беляев СЮ, Ticket#0249084, --
	
	ЗапросСозданияВТ = 
	"ВЫБРАТЬ
	|	ТаблицаУведомлений.Документ КАК Документ,
	|	ТаблицаУведомлений.Состояние КАК Состояние
	|ПОМЕСТИТЬ ТаблицаУведомлений
	|ИЗ
	|	&ТаблицаУведомлений КАК ТаблицаУведомлений
	|;
	|";
	
	ЗапросТаблицСостояний = СтрСоединить(ТекстыЗапросов, Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС);		
	Запрос.Текст = ЗапросСозданияВТ + ЗапросТаблицСостояний;
	Запрос.УстановитьПараметр("ТаблицаУведомлений", ТаблицаУведомлений);
	ТаблицаСостояний = Запрос.Выполнить().Выгрузить();		
	
	Ответ = РезультатЗапроса.Выбрать();
	//Евросиб Каблов 21.07.2020 )	
	Пока Ответ.Следующий() Цикл
		
		Если Строка(Ответ.Пользователь) = "<Не указан>" Тогда 
			Продолжить; 
		КонецЕсли;
		
		Тема = Лев("[DC задачи] Документ: " + Строка(Ответ.Документ)+ " задача: " + Строка(Ответ.Состояние), 200);
		
		ТекстПисьма = "<b>В системе появился документ, требующий Вашего внимания:</b><br/><br/>";
		ТекстПисьма = ТекстПисьма + "<b>Документ: </b>" + Ответ.Документ + "<br/>";
		ТекстПисьма = ТекстПисьма + "<b>Для пользователя: </b>" + Ответ.Пользователь + "<br/>";
		ТекстПисьма = ТекстПисьма + "<b>Задача: </b>" + Ответ.Состояние + "<br/>";
		
		//Евросиб Каблов 21.07.2020 (
		НайденныеСтроки = ТаблицаСостояний.НайтиСтроки(Новый Структура("Документ, Состояние", Ответ.Документ, Ответ.Состояние));
		Если НайденныеСтроки.Количество() > 0 Тогда
			Комментарий = НайденныеСтроки[0].Комментарий;
			Если ЗначениеЗаполнено(Комментарий) Тогда
				ТекстПисьма = ТекстПисьма + СтрШаблон("<b>Комментарий: </b>%1<br/>", Комментарий);
			КонецЕсли;
		КонецЕсли;
		//Евросиб Каблов 21.07.2020 )		
		
		ТекстНС = "<a target=""_blank"" href="""+ПрефиксНС+ПолучитьНавигационнуюСсылку(Ответ.Документ)+""">"+ПолучитьНавигационнуюСсылку(Ответ.Документ)+"</a>";
		
		ТекстПисьма = ТекстПисьма + "<b>Навигационная ссылка: </b>" + ТекстНС + "<br/>";
		ТекстПисьма = ТекстПисьма + "<b>Дата формирования письма: </b>" + ТекущаяДата() + "<br/><br/>";
		ТекстПисьма = ТекстПисьма + "Спасибо за внимание! --DC";
		
		Если ТипЗнч(Ответ.Документ) = Тип("ДокументСсылка.Операция") Тогда
			Тема = "[DC задачи] " + Ответ.Документ.Услуга;

			ТекстПисьма = "<b>В системе появился документ, требующий Вашего внимания:</b><br/><br/>";
			ТекстПисьма = ТекстПисьма + "<b>Операция: </b>" + Ответ.Документ.Услуга + "<br/>";
			ТекстПисьма = ТекстПисьма + "<b>Документ: </b>" + Ответ.Документ + "<br/>";
			ТекстПисьма = ТекстПисьма + "<b>Для пользователя: </b>" + Ответ.Пользователь + "<br/>";
			ТекстПисьма = ТекстПисьма + "<b>Задача: </b>" + Ответ.Состояние + "<br/>";
			
			ТекстНС = "<a target=""_blank"" href="""+ПрефиксНС+ПолучитьНавигационнуюСсылку(Ответ.Документ)+""">"+ПолучитьНавигационнуюСсылку(Ответ.Документ)+"</a>";
			
			ТекстПисьма = ТекстПисьма + "<b>Навигационная ссылка: </b>" + ТекстНС + "<br/>";
			ТекстПисьма = ТекстПисьма + "<b>Дата формирования письма: </b>" + ТекущаяДата() + "<br/><br/>";
			ТекстПисьма = ТекстПисьма + "Спасибо за внимание! --DC";
			
		КонецЕсли;
		
		ПолучателиПисьма = Новый Массив;
		
		Если ЗначениеЗаполнено(АдресДублированияУведомлений) Тогда
			Для каждого Адрес из СтрРазделить(АдресДублированияУведомлений, ";", Ложь) Цикл
				ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", "Адрес отслеживания", Адрес));
			КонецЦикла;
		КонецЕсли;
		
		ПараметрыОтправкиПисьма = новый Структура;
		ПараметрыОтправкиПисьма.Вставить("Тема", Тема);
		ПараметрыОтправкиПисьма.Вставить("Тело", ТекстПисьма);
		ПараметрыОтправкиПисьма.Вставить("ТипТекста", "HTML");
		Если ТипЗнч(Ответ.Пользователь) = Тип("СправочникСсылка.Пользователи") Тогда
			EMAIL = ПолучитьEMAILПользователя(ПодобратьЗамещение(Ответ.Пользователь, ТекущаяДата()));
			Если ЗначениеЗаполнено(EMAIL) Тогда
				ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", Строка(Ответ.Пользователь), EMAIL));
			КонецЕсли;
		Иначе
			ПользователиГруппы = Пользователи_sd_сервер.ПолучитьПользователейГруппы(Ответ.Пользователь);
			Для каждого ПользовательЪ из ПользователиГруппы Цикл
				EMAIL = ПолучитьEMAILПользователя(ПодобратьЗамещение(ПользовательЪ, ТекущаяДата()));
				Если ЗначениеЗаполнено(EMAIL) Тогда
					ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", Строка(ПользовательЪ), EMAIL));
					Сообщить("Планируется к отправке " + EMAIL);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		ПараметрыОтправкиПисьма.Вставить("Кому", ПолучателиПисьма);
		
		//ДИТ, Беляев СЮ, Ticket#0261337, 21-02-2022, начало
		//пропускаем отправку и регистрацию, если массив адресов пустой
		Если ПолучателиПисьма.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		//ДИТ, Беляев СЮ, Ticket#0261337, 21-02-2022, конец
		
		РЕЗУЛЬТАТ = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(СистемнаяУчетнаяЗапись, ПараметрыОтправкиПисьма);
		//РЕЗУЛЬТАТ = неопределено;
		Если ЗначениеЗаполнено(РЕЗУЛЬТАТ) Тогда
			МЗ = РегистрыСведений.УведомленияПользователейОЗадачах.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ, Ответ);
			МЗ.УведомлениеОЗадаче = Истина;
			МЗ.Период = ТекущаяДата();
			МЗ.Записать(Истина);
		КонецЕсли;
		
	КонецЦикла;
	                                                
	//ДИТ, Беляев СЮ, Ticket#0249084, ++
	УдалитьЗаписиВРегистреУведомленийДоДатыНаСервере(ДатаНачалаРазрешеннойРассылки);
	//ДИТ, Беляев СЮ, Ticket#0249084, --
	
КонецПроцедуры     

//ДИТ, Беляев СЮ, Ticket#0249084, ++
&НаСервере
Процедура УдалитьЗаписиВРегистреУведомленийДоДатыНаСервере(вхДата)
	Если ТипЗнч(вхДата)<>Тип("Дата") Тогда 
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(вхДата) Тогда
		Возврат;
	КонецЕсли;	                             
	ТекущаяДатаМинус7Дней = ТекущаяДата()-7*24*3600;
	ДатаУдалитьДО = Мин(вхДата, ТекущаяДатаМинус7Дней); //подстраховка на случай указания в константе "ЗапретитьРассылкуЗадачСтаршеДней" небольщого количества дней
	//удаляем по 100 записей, чтобы не нагружать систему в случае если накопились данные, т.к. запускается задание раз в 10 минут
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 100
	               |	УведомленияПользователейОЗадачах.Документ КАК Документ
	               |ИЗ
	               |	РегистрСведений.УведомленияПользователейОЗадачах КАК УведомленияПользователейОЗадачах
	               |ГДЕ
	               |	УведомленияПользователейОЗадачах.Документ.Дата < &ДатаУдаленияДО";
	Запрос.УстановитьПараметр("ДатаУдаленияДО", ДатаУдалитьДО);
	МассивДокументов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Документ");
	
	Если МассивДокументов.Количество()>0 Тогда
		Для каждого ЭлМассива Из МассивДокументов Цикл
			Набор = РегистрыСведений.УведомленияПользователейОЗадачах.СоздатьНаборЗаписей();
			Набор.Отбор.Документ.Установить(ЭлМассива);
			Набор.Записать();
		КонецЦикла;			
	КонецЕсли;
КонецПроцедуры
//ДИТ, Беляев СЮ, Ticket#0249084, --

Процедура УведомитьПользователяОЕгоПросрочках() Экспорт
	
	// первичная проверка на то, что мы вообще можем что-то отправить
	УчетнаяЗаписьПоУмолчанию = РаботаСПочтовымиСообщениями.ПроверитьСистемнаяУчетнаяЗаписьДоступна();
	
	Если не УчетнаяЗаписьПоУмолчанию Тогда возврат; КонецЕсли;
	СистемнаяУчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	АдресДублированияУведомлений = Константы.АдресДублированияОповещенийОЗадачах.Получить();
	ПрефиксНС = Константы["АдресПубликацииИнформационнойБазыВЛокальнойСети"+?(ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована, "Тестовый", "")].Получить() + "#";
	
	ЗапретитьРассылкуЗадачСтаршеДней = Константы.ЗапретитьРассылкуЗадачСтаршеДней.Получить();
	Если ЗапретитьРассылкуЗадачСтаршеДней = 0 Тогда
		ЗапретитьРассылкуЗадачСтаршеДней = 999999;
	КонецЕсли;
	ДатаНачалаРазрешеннойРассылки = ТекущаяДата() - ЗапретитьРассылкуЗадачСтаршеДней * 24 * 3600;
	
	
	ТЗ_6_СписокПроблем = Новый ТаблицаЗначений;
	ТЗ_6_СписокПроблем.Колонки.Добавить("Исполнитель");
	ТЗ_6_СписокПроблем.Колонки.Добавить("Наблюдатель");
	ТЗ_6_СписокПроблем.Колонки.Добавить("Операция");
	ТЗ_6_СписокПроблем.Колонки.Добавить("Состояние");
	ТЗ_6_СписокПроблем.Колонки.Добавить("МераОтклонения");
	ТЗ_6_СписокПроблем.Колонки.Добавить("Регион");
	ТЗ_6_СписокПроблем.Колонки.Добавить("КлассНарушения");
	ТЗ_6_СписокПроблем.Колонки.Добавить("ДатаОтправления");
	ТЗ_6_СписокПроблем.Колонки.Добавить("ДатаНазначения");
	
	ТЗОбъектовСостояния = Новый ТаблицаЗначений;
	ТЗОбъектовСостояния.Колонки.Добавить("ОбъектСостояние");
	ТЗОбъектовСостояния.Колонки.Добавить("ТипМетаданных");
	
	СписокРазрешенныхСтатусов = Новый Массив;
	СписокРазрешенныхСтатусов.Добавить(Перечисления.СтатусыЭтапов.НаВыполнение);
	СписокРазрешенныхСтатусов.Добавить(Перечисления.СтатусыЭтапов.ВРаботе);
	
	// + скопированный кусок из АРМ Руководителя
	
	// Только операции
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОперацииВСделках.Операция КАК Операция,
	               |	ОперацииВСделках.Исполнитель КАК Исполнитель,
	               |	ОперацииВСделках.Наблюдатель КАК Наблюдатель,
	               |	ОперацииВСделках.Состояние КАК Состояние,
	               |	ВЫБОР
	               |		КОГДА ОперацииВСделках.ДатаОтправленияФакт > ОперацииВСделках.ДатаОтправления
	               |				ИЛИ ОперацииВСделках.ДатаНазначенияФакт > ОперацииВСделках.ДатаНазначения
	               |				ИЛИ ОперацииВСделках.ДатаОтправленияФакт = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |					И ОперацииВСделках.ДатаНазначения < &ТекущаяДата
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.КлассНарушенияАРМРуководителя.НарушениеСрока)
	               |	КОНЕЦ КАК КлассНарушения,
	               |	ВЫБОР
	               |		КОГДА ОперацииВСделках.ДатаОтправленияФакт > ОперацииВСделках.ДатаОтправления
	               |			ТОГДА РАЗНОСТЬДАТ(ОперацииВСделках.ДатаОтправления, ОперацииВСделках.ДатаОтправленияФакт, ДЕНЬ)
	               |		КОГДА ОперацииВСделках.ДатаНазначенияФакт > ОперацииВСделках.ДатаНазначения
	               |			ТОГДА РАЗНОСТЬДАТ(ОперацииВСделках.ДатаНазначения, ОперацииВСделках.ДатаНазначенияФакт, ДЕНЬ)
	               |		КОГДА ОперацииВСделках.ДатаОтправленияФакт = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |				И ОперацииВСделках.ДатаНазначения < &ТекущаяДата
	               |			ТОГДА РАЗНОСТЬДАТ(ОперацииВСделках.ДатаОтправления, &ТекущаяДата, ДЕНЬ)
	               |	КОНЕЦ КАК МераОтклонения,
	               |	ОперацииВСделках.Статус КАК Статус
	               |ПОМЕСТИТЬ Операции
	               |ИЗ
	               |	РегистрСведений.ОперацииВСделках КАК ОперацииВСделках
	               |ГДЕ
	               |	(НАЧАЛОПЕРИОДА(ОперацииВСделках.ДатаОтправленияФакт, ДЕНЬ) > НАЧАЛОПЕРИОДА(ОперацииВСделках.ДатаОтправления, ДЕНЬ)
	               |			ИЛИ НАЧАЛОПЕРИОДА(ОперацииВСделках.ДатаНазначенияФакт, ДЕНЬ) > НАЧАЛОПЕРИОДА(ОперацииВСделках.ДатаНазначения, ДЕНЬ)
	               |			ИЛИ ОперацииВСделках.ДатаОтправленияФакт = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |				И ОперацииВСделках.ДатаНазначения < &ТекущаяДата)
	               |	И ОперацииВСделках.Операция.Дата >= &Дата
	               |	И НЕ ОперацииВСделках.Операция.ПометкаУдаления
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ОперацииВСделках.Операция,
	               |	ОперацииВСделках.Исполнитель,
	               |	ОперацииВСделках.Наблюдатель,
	               |	ОперацииВСделках.Состояние,
	               |	ВЫБОР
	               |		КОГДА ОперацииВСделках.СебестоимостьФакт > ОперацииВСделках.Себестоимость
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.КлассНарушенияАРМРуководителя.ОтклонениеЦены)
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ОперацииВСделках.СебестоимостьФакт > ОперацииВСделках.Себестоимость
	               |			ТОГДА ОперацииВСделках.Себестоимость - ОперацииВСделках.СебестоимостьФакт
	               |	КОНЕЦ,
	               |	ОперацииВСделках.Статус
	               |ИЗ
	               |	РегистрСведений.ОперацииВСделках КАК ОперацииВСделках
	               |ГДЕ
	               |	ОперацииВСделках.СебестоимостьФакт > ОперацииВСделках.Себестоимость
	               |	И ОперацииВСделках.Операция.Дата > &Дата
	               |	И НЕ ОперацииВСделках.Операция.ПометкаУдаления
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ОперацииВСделках.Операция,
	               |	ОперацииВСделках.Исполнитель,
	               |	ОперацииВСделках.Наблюдатель,
	               |	ОперацииВСделках.Состояние,
	               |	ВЫБОР
	               |		КОГДА ОперацииВСделках.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтапов.Отклонен)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.КлассНарушенияАРМРуководителя.ОтказИсполнения)
	               |	КОНЕЦ,
	               |	NULL,
	               |	ОперацииВСделках.Статус
	               |ИЗ
	               |	РегистрСведений.ОперацииВСделках КАК ОперацииВСделках
	               |ГДЕ
	               |	ОперацииВСделках.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтапов.Отклонен)
	               |	И ОперацииВСделках.Операция.Дата > &Дата
	               |	И НЕ ОперацииВСделках.Операция.ПометкаУдаления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ОперацияГрузы.ТС) КАК ТС,
	               |	ОперацияГрузы.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ТСОперации
	               |ИЗ
	               |	Операции КАК Операции
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Операция.Грузы КАК ОперацияГрузы
	               |		ПО Операции.Операция = ОперацияГрузы.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОперацияГрузы.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДислокацияВагоновСрезПоследних.СтанцияОперации КАК СтанцияОперации,
	               |	ДислокацияВагоновСрезПоследних.Вагон КАК Вагон
	               |ПОМЕСТИТЬ ДислокацияВагона
	               |ИЗ
	               |	РегистрСведений.ДислокацияВагонов.СрезПоследних(
	               |			,
	               |			Вагон В
	               |				(ВЫБРАТЬ
	               |					ТСОперации.ТС
	               |				ИЗ
	               |					ТСОперации КАК ТСОперации)) КАК ДислокацияВагоновСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Операции.Исполнитель КАК Исполнитель,
	               |	Операции.Наблюдатель КАК Наблюдатель,
	               |	Операции.Операция КАК Операция,
	               |	Операции.Состояние КАК Состояние,
	               |	ДислокацияВагона.СтанцияОперации КАК Регион,
	               |	Операции.КлассНарушения КАК КлассНарушения,
	               |	Операции.МераОтклонения КАК МераОтклонения,
	               |	Операции.Операция.ДатаОтправления КАК ДатаОтправления,
	               |	Операции.Операция.ДатаНазначения КАК ДатаНазначения,
	               |	Операции.Статус КАК Статус
	               |ИЗ
	               |	Операции КАК Операции
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТСОперации КАК ТСОперации
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ДислокацияВагона КАК ДислокацияВагона
	               |			ПО ТСОперации.ТС = ДислокацияВагона.Вагон
	               |		ПО Операции.Операция = ТСОперации.Ссылка
	               |ГДЕ
	               |	НЕ Операции.Операция.ПометкаУдаления
	               |	И Операции.Статус В(&СписокРазрешенныхСтатусов)
	               |	И Операции.Операция.Дата > &РазрешеннаяДата";
	Запрос.УстановитьПараметр("Дата",НачалоДня(ТекущаяДата()-10*24*3600));
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	Запрос.УстановитьПараметр("СписокРазрешенныхСтатусов",СписокРазрешенныхСтатусов);
	
	Запрос.УстановитьПараметр("РазрешеннаяДата", ДатаНачалаРазрешеннойРассылки);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТЗ = РезультатЗапроса.Выгрузить();
	
	ТЗ_6_СписокПроблем.Очистить();
	
	Для Каждого Стр Из ТЗ Цикл
		Если Строка(Стр.Исполнитель) = "<Не указан>" ИЛИ НЕ ЗначениеЗаполнено(Стр.Операция) Тогда Продолжить; КонецЕсли;
		НоваяСтр = ТЗ_6_СписокПроблем.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтр,Стр);
	КонецЦикла;
	
	// Добавить все документы, кроме операций, у которых есть ТЧ Состояния
	ЗаполнениеТаблицыОбъектов(ТЗОбъектовСостояния);

	Для Каждого Стр Из ТЗОбъектовСостояния Цикл
		
		Запрос = Новый Запрос;
		
		Если Стр.ОбъектСостояние = "Операция" Тогда
			
			Продолжить;

		КонецЕсли;
		
		// расчет норматива исполнения. если расчет для объектов НЕ Проект, то стандартный расчет, т.к. в 
		// тч Состояния есть НормативИсполненияСМоментаСоздания
		Если Стр.ОбъектСостояние = "РейсыЖД" Тогда
			ДтОтпр = "ТЧСостояния.НачалоРаботы";
			ДтНазн = "ДОБАВИТЬКДАТЕ(ТЧСостояния.НачалоРаботы, ЧАС, ТЧСостояния.НормативИсполненияСМоментаСоздания)";
			МераОтклДата1 = "ДОБАВИТЬКДАТЕ(ТЧСостояния.НачалоРаботы, ЧАС, ТЧСостояния.НормативИсполненияСМоментаСоздания)";
		ИначеЕсли Стр.ОбъектСостояние = "Проекты" Тогда
			ДтОтпр = "ТЧСостояния.Ссылка.Дата";
			ДтНазн = "(ВЫБОР КОГДА ТЧСостояния.ВидНормативаИсполнения = ЗНАЧЕНИЕ(Перечисление.ВидыНормативовИспользования.За2ЧасаДоДедлайнаПроекта) ТОГДА ДОБАВИТЬКДАТЕ(ТЧСостояния.Ссылка.КонтрольныйСрок, ЧАС,-2) КОГДА ТЧСостояния.ВидНормативаИсполнения = ЗНАЧЕНИЕ(Перечисление.ВидыНормативовИспользования.ЧасовСМоментаСозданияДокумента) ТОГДА ДОБАВИТЬКДАТЕ(ТЧСостояния.Ссылка.Дата, ЧАС, ТЧСостояния.НормативИсполненияСМоментаСоздания) КОГДА ТЧСостояния.ВидНормативаИсполнения = ЗНАЧЕНИЕ(Перечисление.ВидыНормативовИспользования.Через2ЧасаПослеДедлайна) ТОГДА ДОБАВИТЬКДАТЕ(ТЧСостояния.Ссылка.КонтрольныйСрок, ЧАС,2) КОГДА ТЧСостояния.ВидНормативаИсполнения = ЗНАЧЕНИЕ(Перечисление.ВидыНормативовИспользования.ДедлайнПроекта) ТОГДА ТЧСостояния.Ссылка.КонтрольныйСрок КОНЕЦ)";
			МераОтклДата1 = "(ВЫБОР КОГДА ТЧСостояния.ВидНормативаИсполнения = ЗНАЧЕНИЕ(Перечисление.ВидыНормативовИспользования.За2ЧасаДоДедлайнаПроекта) ТОГДА ДОБАВИТЬКДАТЕ(ТЧСостояния.Ссылка.КонтрольныйСрок, ЧАС,-2)  КОГДА ТЧСостояния.ВидНормативаИсполнения = ЗНАЧЕНИЕ(Перечисление.ВидыНормативовИспользования.Через2ЧасаПослеДедлайна) ТОГДА ДОБАВИТЬКДАТЕ(ТЧСостояния.Ссылка.КонтрольныйСрок, ЧАС,2) КОГДА ТЧСостояния.ВидНормативаИсполнения = ЗНАЧЕНИЕ(Перечисление.ВидыНормативовИспользования.ЧасовСМоментаСозданияДокумента) ТОГДА ДОБАВИТЬКДАТЕ(ТЧСостояния.Ссылка.Дата, ЧАС, ТЧСостояния.НормативИсполненияСМоментаСоздания) КОГДА ТЧСостояния.ВидНормативаИсполнения = ЗНАЧЕНИЕ(Перечисление.ВидыНормативовИспользования.ДедлайнПроекта) ТОГДА ТЧСостояния.Ссылка.КонтрольныйСрок КОНЕЦ)";
		ИначеЕсли Стр.ОбъектСостояние = "Сделка" Тогда
			ДтОтпр = "ТЧСостояния.Ссылка.Дата";
			ДтНазн = "(ВЫБОР КОГДА ТЧСостояния.ВидНормативаИсполнения = ЗНАЧЕНИЕ(Перечисление.ВидыНормативовИспользования.ПервыйРДмесяцаПослеОкончанияПеревозки) ТОГДА ДОБАВИТЬКДАТЕ(ТЧСостояния.Ссылка.ДатаПрибытияРейса, ЧАС,ТЧСостояния.НормативИсполненияСМоментаСоздания) КОГДА ТЧСостояния.ВидНормативаИсполнения = ЗНАЧЕНИЕ(Перечисление.ВидыНормативовИспользования.ДатаОкончанияТСх) ТОГДА ТЧСостояния.Ссылка.ДатаПрибытияОтправки КОГДА ТЧСостояния.ВидНормативаИсполнения = ЗНАЧЕНИЕ(Перечисление.ВидыНормативовИспользования.ДатаОкончанияТСх72) ТОГДА ДОБАВИТЬКДАТЕ(ТЧСостояния.Ссылка.ДатаПрибытияОтправки,ЧАС,72) ИНАЧЕ ДОБАВИТЬКДАТЕ(ТЧСостояния.Ссылка.Дата, ЧАС, ТЧСостояния.НормативИсполненияСМоментаСоздания) КОНЕЦ)";
			МераОтклДата1 = "(ВЫБОР КОГДА ТЧСостояния.ВидНормативаИсполнения = ЗНАЧЕНИЕ(Перечисление.ВидыНормативовИспользования.ПервыйРДмесяцаПослеОкончанияПеревозки) ТОГДА ДОБАВИТЬКДАТЕ(ТЧСостояния.Ссылка.ДатаПрибытияРейса, ЧАС,ТЧСостояния.НормативИсполненияСМоментаСоздания) КОГДА ТЧСостояния.ВидНормативаИсполнения = ЗНАЧЕНИЕ(Перечисление.ВидыНормативовИспользования.ДатаОкончанияТСх) ТОГДА ТЧСостояния.Ссылка.ДатаПрибытияОтправки КОГДА ТЧСостояния.ВидНормативаИсполнения = ЗНАЧЕНИЕ(Перечисление.ВидыНормативовИспользования.ДатаОкончанияТСх72) ТОГДА ДОБАВИТЬКДАТЕ(ТЧСостояния.Ссылка.ДатаПрибытияОтправки,ЧАС,72) ИНАЧЕ ДОБАВИТЬКДАТЕ(ТЧСостояния.Ссылка.Дата, ЧАС, ТЧСостояния.НормативИсполненияСМоментаСоздания) КОНЕЦ)";
		Иначе
			ДтОтпр = "ТЧСостояния.Ссылка.Дата";
			ДтНазн = "ДОБАВИТЬКДАТЕ(ТЧСостояния.Ссылка.Дата, ЧАС, ТЧСостояния.НормативИсполненияСМоментаСоздания)";
			МераОтклДата1 = "ДОБАВИТЬКДАТЕ(ТЧСостояния.Ссылка.Дата, ЧАС, ТЧСостояния.НормативИсполненияСМоментаСоздания)";
		КонецЕсли;
		
		//Субботин 74702 14.09.2023 Начало
		СтрокаУсловий = ""; 
		Если Стр.ТипМетаданных = "Документ." тогда 
			СтрокаУсловий = " и ТЧСостояния.Ссылка.Проведен" ;
		ИначеЕсли 
			Стр.ТипМетаданных = "Справочник." И Стр.ОбъектСостояние = "ПроцессСогласования" Тогда
			Продолжить;
		КонецЕсли;
		
		//Субботин 74702 14.09.2023 Конец
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТЧСостояния.Ссылка КАК Операция,
					   |	" + ДтОтпр + " КАК ДатаОтправления,
					   |	" + ДтНазн + " КАК ДатаНазначения,
					   |	ТЧСостояния.Исполнитель КАК Исполнитель,
					   |	ТЧСостояния.Состояние КАК Состояние,
					   |	ТЧСостояния.Наблюдатель КАК Наблюдатель,
					   |	ЗНАЧЕНИЕ(Перечисление.КлассНарушенияАРМРуководителя.НарушениеСрока) КАК КлассНарушения,
					   |	РАЗНОСТЬДАТ(" + МераОтклДата1 + ", &ТекущаяДата, ЧАС)  КАК МераОтклонения
		               |ИЗ
		               |	 " + Строка(Стр.ТипМетаданных) + Строка(Стр.ОбъектСостояние) + ".Состояния КАК ТЧСостояния
		               |ГДЕ
		               |	ТЧСостояния.Статус В (&СписокРазрешенныхСтатусов) И ТЧСостояния.Ссылка.ПометкаУдаления <> ИСТИНА
					   |	И РАЗНОСТЬДАТ(" + ДтНазн + ", &ТекущаяДата, ЧАС)>0 И " + ДтОтпр + " > &РазрешеннаяДата"+СтрокаУсловий ;

		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
		Запрос.УстановитьПараметр("СписокРазрешенныхСтатусов", СписокРазрешенныхСтатусов);
		Запрос.УстановитьПараметр("РазрешеннаяДата", ДатаНачалаРазрешеннойРассылки);
		Попытка
			Результат = Запрос.Выполнить().Выгрузить();
			Для каждого Рез Из Результат Цикл
				
				Если Строка(Рез.Исполнитель) = "<Не указан>" Тогда Продолжить; КонецЕсли;
				//Субботин 74702 14.09.2023 начало
			////	Если Стр.ТипМетаданных = "Документ." И Рез.Операция.Проведен = ЛОЖЬ Тогда Продолжить; КонецЕсли;
			//	Если Стр.ТипМетаданных = "Документ." И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Рез.Операция,"Проведен") = ЛОЖЬ Тогда Продолжить; КонецЕсли;
			//	Если Стр.ТипМетаданных = "Справочник." И Стр.ОбъектСостояние = "ПроцессСогласования" Тогда Продолжить; КонецЕсли;
			//	//Субботин 74702 14.09.2023 Конец
	
				НоваяСтр = ТЗ_6_СписокПроблем.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтр,Рез);
				
			КонецЦикла;
		Исключение
			ОО = ОписаниеОшибки();
			НетДатыУДокументов = Строка(Стр.ТипМетаданных) + Строка(Стр.ОбъектСостояние);
		КонецПопытки;
		                                                        
	КонецЦикла;

	// - скопированный кусок из АРМ Руководителя
	
	// Выбираем уникальных пользователей по просрочкам
	
	ИтоговыйМассивСпециалистов = Новый Массив;
	
	Для каждого Стр из ТЗ_6_СписокПроблем Цикл
		
		Если ЗначениеЗаполнено(Стр.Исполнитель) И Строка(Стр.Исполнитель) <> "<Не указан>" Тогда
			
			Если ТипЗнч(Стр.Исполнитель) = Тип("СправочникСсылка.Пользователи") Тогда
				Если ИтоговыйМассивСпециалистов.Найти(Стр.Исполнитель) = неопределено 
//Евросиб Гудкова( 01.06.2020 Ticket№0196045 
	              	И НЕ Стр.Исполнитель.Недействителен
// Евросиб Гудкова) 				   
					Тогда 
					ИтоговыйМассивСпециалистов.Добавить(стр.Исполнитель);
				КонецЕсли;
			Иначе
				ПлзГруппы = Пользователи_sd_сервер.ПолучитьПользователейГруппы(Стр.Исполнитель);
				Для каждого Стр3 из ПлзГруппы Цикл
					Если ИтоговыйМассивСпециалистов.Найти(Стр3) = неопределено Тогда ИтоговыйМассивСпециалистов.Добавить(Стр3); КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.Наблюдатель) И Строка(Стр.Наблюдатель) <> "<Не указан>" Тогда
			Продолжить; //Евросиб Гудкова( 27.07.2020 Ticket№ 0201529 отключение рассылки наблюдателям
			Если ТипЗнч(Стр.Наблюдатель) = Тип("СправочникСсылка.Пользователи") Тогда
				Если ИтоговыйМассивСпециалистов.Найти(Стр.Наблюдатель) = неопределено 
//Евросиб Гудкова( 01.06.2020 Ticket№0196045 
	              	И НЕ Стр.Наблюдатель.Недействителен
// Евросиб Гудкова) 				   
					Тогда 
					ИтоговыйМассивСпециалистов.Добавить(стр.Наблюдатель);
				КонецЕсли;
			Иначе
				ПлзГруппы = Пользователи_sd_сервер.ПолучитьПользователейГруппы(Стр.Наблюдатель);
				Для каждого Стр3 из ПлзГруппы Цикл
					Если ИтоговыйМассивСпециалистов.Найти(Стр3) = неопределено Тогда ИтоговыйМассивСпециалистов.Добавить(Стр3); КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// а теперь для каждого уникального пользователя просто формируем письмо с указанием всех его просрочек или всех задач, где он ответственный
	
	Тема = "[DC проблемы] Реестр текущих проблем на " + ТекущаяДата();
	
	МассивПисем = новый Массив;
	
	Для каждого Плз из ИтоговыйМассивСпециалистов Цикл
		
		//ДокументУжеУпомянут = Новый Массив; 
		ДокументУжеУпомянут = Новый Соответствие;
				
		ТекстПисьма = "<b>В системе имеются следующие проблемы и отклонения, связанные с Вашей учетной записью:</b><br/><br/>";
		ТекстПисьма = ТекстПисьма + "<table border=1><tr><td>Операция</td><td>Задача</td><td>Исполнитель</td><td>Наблюдатель</td><td>Ссылка</td><td>Класс отклонения</td><td>Плановый срок</td></tr>";
		
		//Субботин 74702 15.09.2023  начало
		СтрокиДляПисьма = Новый массив;
		//Субботин 74702  15.09.2023 Конец 
		
		СписокГрупп = Пользователи_sd_сервер.ПолучитьСписокМоихГрупп(Плз);
		СписокГрупп.Добавить(Плз);
		
		//Субботин 74702 15.09.2023  начало
		Для каждого Группа из СписокГрупп цикл			
            СтрОтбора = Новый Структура("Исполнитель",Группа.ссылка);
			ДокументыПользователя = ТЗ_6_СписокПроблем.Скопировать(СтрОтбора);
			
			//было:
			//Для каждого Стр из ТЗ_6_СписокПроблем Цикл
			//Если ДокументУжеУпомянут.Найти(Стр.Операция) = неопределено И (СписокГрупп.Найти(Стр.Исполнитель) <> неопределено) Тогда //Евросиб Гудкова( 27.07.2020 Ticket№ 0201529 отключение рассылки наблюдателям //ИЛИ СписокГрупп.Найти(Стр.Наблюдатель) <> неопределено) Тогда
			
			//стало:
			Для каждого Стр из ДокументыПользователя Цикл
				Если ДокументУжеУпомянут.Получить(Стр.Операция) = неопределено Тогда //Евросиб Гудкова( 27.07.2020 Ticket№ 0201529 отключение рассылки наблюдателям //ИЛИ СписокГрупп.Найти(Стр.Наблюдатель) <> неопределено) Тогда
			//Субботин 74702 15.09.2023 Конец
			
					//Субботин 74702 15.09.2023 Начало
					НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(Стр.Операция); 
					//ТекстНС = "<a target=""_blank"" href="""+ПрефиксНС+ПолучитьНавигационнуюСсылку(Стр.Операция)+""">"+ПолучитьНавигационнуюСсылку(Стр.Операция)+"</a>";
					ТекстНС = "<a target=""_blank"" href="""+ПрефиксНС+НавигационнаяСсылка+""">"+НавигационнаяСсылка+"</a>"; 
					//Субботин 74702 15.09.2023 Конец 
					
					 //Субботин 74702 15.09.2023 Начало
					 //Было:
					 //ТекстПисьма = ТекстПисьма + "<tr><td>"+Стр.Операция+"</td><td>"+Стр.Состояние+"</td><td>"+Стр.Исполнитель+"</td><td>"+Стр.Наблюдатель+"</td><td>"+ТекстНС+"</td><td>"+Стр.КлассНарушения+"</td><td>"+Стр.ДатаОтправления+"</td></tr>";
					 //Стало:
				//	СтрокаПисьмаПоДокументу = "<tr><td>"+Стр.Операция+"</td><td>"+Стр.Состояние+"</td><td>"+Стр.Исполнитель+"</td><td>"+Стр.Наблюдатель+"</td><td>"+ТекстНС+"</td><td>"+Стр.КлассНарушения+"</td><td>"+Стр.ДатаОтправления+"</td></tr>";
					СтрокаПисьмаПоДокументу = СтрШаблон("<tr><td>%1</td><td>%2</td><td>%3</td><td>%4</td><td>%5</td><td>%6</td><td>%7</td></tr>",Стр.Операция, Стр.Состояние, Стр.Исполнитель, Стр.Наблюдатель, ТекстНС, Стр.КлассНарушения, Стр.ДатаОтправления);

					СтрокиДляПисьма.Добавить(СтрокаПисьмаПоДокументу);
					//Субботин 74702 15.09.2023 Конец
                   			
					ДокументУжеУпомянут.Вставить(Стр.Операция,Стр.Операция);
					
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		//Субботин 74702 15.09.2023 Конец
		
		//Субботин 74702 15.09.2023 Начало
		ТекстПисьма = ТекстПисьма + СтрСоединить(СтрокиДляПисьма);		
		//Субботин 74702 15.09.2023 Конец
		
		ТекстПисьма = ТекстПисьма + "</table><br/><br/>Просим Вас как можно скорее разобраться с этим списком замечаний и отметить выполнение всех завершенных задач!";	
		
		ПолучателиПисьма = Новый Массив;
		
		Если ЗначениеЗаполнено(АдресДублированияУведомлений) Тогда
			Для каждого Адрес из СтрРазделить(АдресДублированияУведомлений, ";", Ложь) Цикл
				ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", "Адрес отслеживания", Адрес));
			КонецЦикла;
		КонецЕсли;
		
		ПараметрыОтправкиПисьма = новый Структура;
		ПараметрыОтправкиПисьма.Вставить("Тема", Тема);
		ПараметрыОтправкиПисьма.Вставить("Тело", ТекстПисьма);
		ПараметрыОтправкиПисьма.Вставить("ТипТекста", "HTML");
		EMAIL = ПолучитьEMAILПользователя(ПодобратьЗамещение(Плз, ТекущаяДата()));
		Если ЗначениеЗаполнено(EMAIL) Тогда
			ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", Строка(Плз), EMAIL));
		Иначе
			Сообщить("Невозможно отправить пользователю: " + Плз);
			Продолжить;
		КонецЕсли;
		ПараметрыОтправкиПисьма.Вставить("Кому", ПолучателиПисьма);
		
		МассивПисем.Добавить(ПараметрыОтправкиПисьма);
		
		РЕЗУЛЬТАТ = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(СистемнаяУчетнаяЗапись, ПараметрыОтправкиПисьма);
		Сообщить(Результат);
		
	КонецЦикла;
		
КонецПроцедуры

Процедура ЗаполнениеТаблицыОбъектов(ТЗОбъектовСостояния)
	
	ТЗОбъектовСостояния.Очистить();
	
	Для Каждого ЭлемСпр Из Метаданные.Справочники Цикл
		Попытка
			СостоянияЭлементов = ЭлемСпр.ТабличныеЧасти.Состояния;
			ЕстьСтатус = СостоянияЭлементов.Реквизиты.Статус;
			ТекСтр = ТЗОбъектовСостояния.Добавить();
			ТекСтр.ОбъектСостояние = ЭлемСпр.Имя;
			ТекСтр.ТипМетаданных = "Справочник.";
		Исключение
			СостоянияЭлементов = "";
		КонецПопытки;
	КонецЦикла;
			
	Для Каждого ЭлемДок Из Метаданные.Документы Цикл
		Попытка
			СостоянияЭлементов = ЭлемДок.ТабличныеЧасти.Состояния;
			ЕстьСтатус = СостоянияЭлементов.Реквизиты.Статус;
			ТекСтр = ТЗОбъектовСостояния.Добавить();
			ТекСтр.ОбъектСостояние = ЭлемДок.Имя;
			ТекСтр.ТипМетаданных = "Документ.";
		Исключение
			СостоянияЭлементов = "";
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьEMAILПользователя(Пользователь) Экспорт 
	
	Результат = "";
	Для каждого Стр из Пользователь.КонтактнаяИнформация Цикл
		Если ЗначениеЗаполнено(Стр.АдресЭП) тогда
			Результат = Стр.АдресЭП;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

Процедура ОповещениеОТекущихЗадачахИПросрочках() Экспорт
	
	УведомитьПользователяОЕгоЗадачах();
	//УведомитьПользователяОЕгоПросрочках();
	
КонецПроцедуры

Процедура РассылкаСгораниеПользователейОПЭ() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	ПериодПоискаНачало = Дата(2019,09,16);
	ПериодПоискаОкончание = ТекущаяДата();
	
	ТД = новый ТаблицаЗначений;
	ТД.Колонки.Добавить("Специалист", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	ТД.Колонки.Добавить("Документ", Новый ОписаниеТипов(Документы.ТипВсеСсылки()));
	ТД.Колонки.Добавить("Справочник", Новый ОписаниеТипов(Справочники.ТипВсеСсылки()));
	ТД.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ТД.Колонки.Добавить("ТипЗаписи", Новый ОписаниеТипов("Строка"));
	ТД.Колонки.Добавить("ДатаСобытия", Новый ОписаниеТипов("Дата"));
	
	СпПользователей = Справочники.ГруппыПользователей.НайтиПоНаименованию("Участники ОПЭ");
	СпПользователей2 = Пользователи_sd_сервер.ПолучитьПользователейГруппы(СпПользователей);
	Для каждого Стр из СпПользователей2 Цикл
		
		НСтр = ТД.Добавить();
		НСтр.Специалист = Стр;
		НСтр.ТипЗаписи = "Участник группы";
		нстр.Датасобытия = Дата(3999,1,1);
		
	КонецЦикла;
	ВсегоПользователей = ТД.Количество();
	

	//////// +++ Берем из журнала активность пользователей
	
	ЗЖ = Новый ТаблицаЗначений;
	
	ОтборыЗаписейЖурнала = Новый Структура();
	ОтборыЗаписейЖурнала.Вставить("ДатаНачала", ПериодПоискаНачало);
	ОтборыЗаписейЖурнала.Вставить("ДатаОкончания", ПериодПоискаОкончание);
	ОтборыЗаписейЖурнала.Вставить("Событие", "_$Data$_.New");
	
	ВыгрузитьЖурналРегистрации(ЗЖ, ОтборыЗаписейЖурнала, "Дата,Пользователь,ИмяПользователя,Данные,Метаданные");
	
	Для каждого Стр из ЗЖ Цикл
		
		Если 
			Лев(Стр.Метаданные, 8) <> "Документ" И 
			Стр.Метаданные <> "Справочник.ТарифыПоставщиков" И
			Стр.Метаданные <> "Справочник.Контрагенты" И
			Стр.Метаданные <> "Справочник.ДоговорыКонтрагентов" И
			Стр.Метаданные <> "Справочник.РейсыЖД"
			
			Тогда Продолжить; КонецЕсли;
			
		//ПользовательЪ = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ", ПользователиИнформационнойБазы.НайтиПоИмени(Стр.ИмяПользователя).УникальныйИдентификатор);
		ПользовательЪ = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ", Стр.Пользователь);
		Если СпПользователей2.найти(ПользовательЪ) = неопределено ТОгда Продолжить; КонецЕсли;
		
		НСтр = ТД.Добавить();
		НСтр.Специалист = ПользовательЪ;
		НСтр.Документ = Стр.Данные;
		НСтр.Справочник = Стр.Данные;
		НСтр.Количество = 1;
		НСтр.ТипЗаписи = "Создание документа или справочника";
		НСтр.ДатаСобытия = Стр.Дата;
		
	КонецЦикла;
	
	//////// --- Берем из журнала активность пользователей
	
	//////// +++ Дополнительный запрос уже по самим докам, если журнал регистраций очистили
	
	Если Истина Тогда
		СписокМетаданныхПоиска = Новый Массив;
		СписокМетаданныхПоиска.Добавить("Документ.Запрос");
		СписокМетаданныхПоиска.Добавить("Документ.ЗакрытиеПериода");
		СписокМетаданныхПоиска.Добавить("Документ.Замещение");
		СписокМетаданныхПоиска.Добавить("Документ.Заявка");
		СписокМетаданныхПоиска.Добавить("Документ.Калькуляция");
		СписокМетаданныхПоиска.Добавить("Документ.КорректировкаПоступления");
		СписокМетаданныхПоиска.Добавить("Документ.КорректировкаРеализации");
		СписокМетаданныхПоиска.Добавить("Документ.КорректировкаДолга");
		СписокМетаданныхПоиска.Добавить("Документ.ЛичныеЦели");
		СписокМетаданныхПоиска.Добавить("Документ.Операция");
		СписокМетаданныхПоиска.Добавить("Документ.ОтчетКомиссионераОПродажах");
		СписокМетаданныхПоиска.Добавить("Документ.ОтчетКомитентуОПродажах");
		СписокМетаданныхПоиска.Добавить("Документ.Перетарка");
		СписокМетаданныхПоиска.Добавить("Документ.ПланПоступленийСписаний");
		СписокМетаданныхПоиска.Добавить("Документ.ПланПродаж");
		СписокМетаданныхПоиска.Добавить("Документ.ПоступлениеНаРасчетныйСчет");
		СписокМетаданныхПоиска.Добавить("Документ.ПоступлениеТоваровУслуг");
		СписокМетаданныхПоиска.Добавить("Документ.ПСЦ");
		СписокМетаданныхПоиска.Добавить("Документ.РеализацияТоваровУслуг");
		СписокМетаданныхПоиска.Добавить("Документ.РегламентПродуктов");
		СписокМетаданныхПоиска.Добавить("Документ.Сделка");
		СписокМетаданныхПоиска.Добавить("Документ.СписаниеСРасчетногоСчета");
		СписокМетаданныхПоиска.Добавить("Документ.СчетНаОплатуПокупателю");
		СписокМетаданныхПоиска.Добавить("Документ.СчетНаОплатуПоставщика");
		СписокМетаданныхПоиска.Добавить("Документ.СчетФактураВыданный");
		СписокМетаданныхПоиска.Добавить("Документ.СчетФактураПолученный");
		СписокМетаданныхПоиска.Добавить("Документ.ТранспортныйДокумент");
		СписокМетаданныхПоиска.Добавить("Документ.УпаковкаОборотнойТары");
		СписокМетаданныхПоиска.Добавить("Документ.УстановкаНормативовДоходности");
		СписокМетаданныхПоиска.Добавить("Документ.АктПостановкиСнятияСУчета");
		СписокМетаданныхПоиска.Добавить("Документ.АктПостановкиСнятияСоСлежения");
		
		Запрос8 = Новый запрос;
		Запрос8.УстановитьПараметр("СписокДоков", ТД.ВыгрузитьКолонку("Документ"));
		Запрос8.УстановитьПараметр("Дата1", ПериодПоискаНачало);
		Запрос8.УстановитьПараметр("Дата2", ПериодПоискаОкончание);
		
		Для каждого ЭлемМетаданных из СписокМетаданныхПоиска Цикл
			
			Запрос8.Текст = "ВЫБРАТЬ
			|	Запрос.Ссылка КАК Ссылка,
			|	Запрос.Автор КАК Автор,
			|	Запрос.Создано КАК Создано
			|ИЗ
			|	"+ЭлемМетаданных+" КАК Запрос
			|ГДЕ
			|	НЕ Запрос.ПометкаУдаления
			|	И Запрос.Создано МЕЖДУ &Дата1 И &Дата2
			|	И НЕ Запрос.Ссылка В (&СписокДоков)";
			Ответ8 = Запрос8.Выполнить().Выбрать();
			
			Пока Ответ8.Следующий() Цикл
				
				НСтр = ТД.Добавить();
				НСтр.Специалист = Ответ8.Автор;
				НСтр.Документ = Ответ8.Ссылка;
				НСтр.Количество = 1;
				НСтр.ТипЗаписи = "Создание документа или справочника";
				НСтр.ДатаСобытия = Ответ8.Создано;
				
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;
	
	//////// --- Дополнительный запрос уже по самим докам, если журнал регистраций очистили
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТД.Специалист КАК Специалист,
	               |	ТД.Документ КАК Документ,
	               |	ТД.Справочник КАК Справочник,
	               |	ТД.Количество КАК Количество,
	               |	НачалоПериода(ТД.ДатаСобытия,ДЕНЬ) КАК ДатаСобытия,
	               |	ТД.ТипЗаписи КАК ТипЗаписи
	               |ПОМЕСТИТЬ ТЗ1
	               |ИЗ
	               |	&ТД КАК ТД
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗ1.Специалист КАК Специалист,
	               |	МИНИМУМ(ТЗ1.ДатаСобытия) КАК ДатаСобытия
	               |ИЗ
	               |	ТЗ1 КАК ТЗ1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТЗ1.Специалист";
	
	Запрос.УстановитьПараметр("ТД", ТД);
	РезультатЗапроса = Запрос.Выполнить();
	
	ТекДата = ТекущаяДата();
	Диаграмма = Новый Диаграмма;
	Диаграмма.ТипДиаграммы = ТипДиаграммы.График;
	Диаграмма.Очистить();
	Диаграмма.КоличествоСерий = 0;
	Диаграмма.КоличествоТочек = 0;
	Диаграмма.Обновление = Ложь;
	Диаграмма.ОбластьЗаголовка.Текст = "Сгорание";
	Диаграмма.ОбластьПостроения.ШкалаТочек.ОтображениеЛинийСетки = ОтображениеЛинийСеткиДиаграммы.Отображать;
	Диаграмма.ОбластьПостроения.ШкалаЗначений.ОтображениеЗаголовка = ОтображениеЗаголовкаШкалыДиаграммы.Отображать;
	Диаграмма.ОбластьПостроения.ШкалаЗначений.ТекстЗаголовка = "Кол-во людей с нулевой активностью";
	ТЗСгорания = РезультатЗапроса.Выгрузить();
	
	текПериодПоиска = ПериодПоискаНачало;
	Диаграмма.Серии.Добавить("Сгорание");
	Точка = Диаграмма.Точки.Добавить(Формат(ТекПериодПоиска,"ДФ=dd.MM"));
	Диаграмма.УстановитьЗначение(Точка,0,ВсегоПользователей);
	Пока ТекПериодПоиска < ТекДата Цикл
		
		СтрокиСгорания = ТЗСгорания.НайтиСтроки(Новый Структура("ДатаСобытия", ТекПериодПоиска));
		Для каждого СтрокаСгорания Из СтрокиСгорания Цикл
			ТЗСгорания.Удалить(СтрокаСгорания);
		КонецЦикла; 
		ТекСгорание = ТЗСгорания.Количество();
		
		ДатаОстатка = ТекПериодПоиска;
		Сгорание    = ТекСгорание;
		
		ТекПериодПоиска = ТекПериодПоиска + 3600 * 24;
		Точка = Диаграмма.Точки.Добавить(Формат(ТекПериодПоиска,"ДФ=dd.MM"));
		Диаграмма.УстановитьЗначение(Точка,0,Сгорание);
		
	КонецЦикла;
	Диаграмма.ОсьЗначений.СпособОпределенияМаксимальногоЗначения = СпособОпределенияОграничивающегоЗначенияДиаграммы.ИспользоватьЗначение;
	Диаграмма.ОсьЗначений.МаксимальноеЗначение = ВсегоПользователей;
	Диаграмма.Обновление = Истина;
	КартинкаДиаграммы = Диаграмма.ПолучитьКартинку(800, 600, ФорматКартинки.PNG);
	ИмяФайлаКартинки = ПолучитьИмяВременногоФайла("png");
	КартинкаДиаграммы.Записать(ИмяФайлаКартинки);
	
	// и сам отчет
	ДЗ = Обработки.АнализВыполненныхРабот.ПолучитьДанныеАнализВыполненныхРабот(Новый Структура("ДатаНачала, ДатаОкончания", ПериодПоискаНачало, ПериодПоискаОкончание),СпПользователей);
	ТабДок = СформироватьТабличныйДокументНаСервере(ДЗ);
	ИмяВременногоФайлаXLSX = ПолучитьИмяВременногоФайла("XLSX");
	ТабДок.Записать(ИмяВременногоФайлаXLSX, ТипФайлаТабличногоДокумента.XLSX);
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ИмяВременногоФайлаXLSX);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Тема = "Сгорание пользователей по ОПЭ Датакор";
	ТекстПисьма = Новый ФорматированныйДокумент;
	ТекстПисьма.Добавить(КартинкаДиаграммы, Тип("КартинкаФорматированногоДокумента"));
	Получатели = "syskovys@eurosib.biz; gusevav@eurosib.biz; bulanyyas@eurosib.biz; smorchkovals@eurosib.biz";
	СкрытыеКопии = "suslovav@eurosib.biz;";
	Вложения = Новый Массив;
	Вложения.Добавить(Новый Структура("АдресВоВременномХранилище, Представление", АдресВоВременномХранилище, "Отчет")); 
	
	Если РаботаСПочтовымиСообщениями.УчетнаяЗаписьНастроена(Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты, Истина, Ложь) Тогда
		ПараметрыСообщения = новый Структура("Кому, ПолучателиСообщения, СкрытыеКопии, Тема, Тело, Вложения", Получатели, Получатели, СкрытыеКопии, Тема, ТекстПисьма, Вложения);
		Попытка
			ИДПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты, ПараметрыСообщения);
		Исключение
			ОО = ОписаниеОшибки();
			//ЗаписьЖурналаРегистрации("Письмо не отправлено по причине: " + ОО,УровеньЖурналаРегистрации.Ошибка,,,"Рассылка сгорания пользователей ОПЭ");
			//ДИТ, Беляев СЮ, Ticket#0272756, 25-07-2022, начало
			ЗаписьЖурналаРегистрации(РаботаСПочтовымиСообщениями.СобытиеЖурналаРегистрацииОшибка(), УровеньЖурналаРегистрации.Ошибка,,, "Рассылка сгорание пользователей ОПЭ. Письмо не отправлено по причине: "+ОО);
            //ДИТ, Беляев СЮ, Ticket#0272756, 25-07-2022, конец			
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьТабличныйДокументНаСервере(ДанныеДерева)
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ДанныеДерева.Колонки.Добавить("ИД");
	ДанныеДерева.Колонки.Добавить("РодительИД");
	Ид = 1;
	Родительид = 0;
	Для каждого СтрокаДерева Из ДанныеДерева.Строки Цикл
		СтрокаДерева.Ид = ИД;
		СтрокаДерева.РодительИД = РодительИД;
		ПронумероватьСтрокиДерева(СтрокаДерева,ИД,ИД);
		ИД = ИД + 1;
	КонецЦикла; 
	
	ИсточникиДанных = Новый Структура("ДанныеДерева", ДанныеДерева);
	СхемаКомпоновки = ПолучитьСхемуКомпоновкиПоДереву(ДанныеДерева);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки, СхемаКомпоновки.НастройкиПоУмолчанию);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных; 
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ИсточникиДанных);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабДокумент);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	Возврат ТабДокумент;
	
КонецФункции

Функция ПолучитьСхемуКомпоновкиПоДереву(ДанныеДерева, ВыбранныеПоляДерева = Неопределено, ПолеИД = "ИД", ПолеРодительИД = "РодительИД")
	
	Если ВыбранныеПоляДерева = Неопределено Тогда
		ВыбранныеПоляДерева = Новый Массив;
	КонецЕсли;
	ЗаполнитьВыбранныеПоляДерева = НЕ ВыбранныеПоляДерева.Количество();
	
	СхемаКомпоновки = Новый СхемаКомпоновкиДанных;
	НастройкиКомпоновки = СхемаКомпоновки.НастройкиПоУмолчанию;
	
	ИсточникДанных = СхемаКомпоновки.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ИсточникДанных";
	ИсточникДанных.ТипИсточникаДанных = "Local";  
	
	НаборДанных = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	НаборДанных.ИмяОбъекта = "ДанныеДерева";
	НаборДанных.Имя = "НаборДанных";
	НаборДанных.ИсточникДанных = "ИсточникДанных"; 
	
	Для Каждого КолонкаДерева Из ДанныеДерева.Колонки Цикл
		
		ИмяПоля = КолонкаДерева.Имя;
		ЗаголовокПоля = КолонкаДерева.Заголовок;
		
		ПолеНабора = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		ПолеНабора.Заголовок = ЗаголовокПоля;
		ПолеНабора.Поле = ИмяПоля;
		
		Если ЗаполнитьВыбранныеПоляДерева И НЕ (ИмяПоля = ПолеИД ИЛИ ИмяПоля = ПолеРодительИД)Тогда
			ВыбранныеПоляДерева.Добавить(Новый Структура("Имя, Заголовок", ИмяПоля, ЗаголовокПоля));
		КонецЕсли;
		
	КонецЦикла;
	
	СвязьНабора = СхемаКомпоновки.СвязиНаборовДанных.Добавить();
	СвязьНабора.НаборДанныхИсточник = "НаборДанных";
	СвязьНабора.НаборДанныхПриемник = "НаборДанных";
	СвязьНабора.ВыражениеИсточник = ПолеИД;
	СвязьНабора.ВыражениеПриемник = ПолеРодительИД;
	СвязьНабора.НачальноеВыражение = "0";
	
	ВыбранныеПоля = НастройкиКомпоновки.Выбор.Элементы;
	Для Каждого ПолеДерева Из ВыбранныеПоляДерева Цикл
		ПолеОтчет = ВыбранныеПоля.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеОтчет.Поле = Новый ПолеКомпоновкиДанных(ПолеДерева.Имя);
		ПолеОтчет.Заголовок = ПолеДерева.Заголовок;
	КонецЦикла;
	
	СтруктураГруппировки = НастройкиКомпоновки.Структура; 
	ЭлементГруппировки = СтруктураГруппировки.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ЭлементГруппировки.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	
	Возврат СхемаКомпоновки; 
	
КонецФункции// ПолучитьСхемуКомпоновкиПоДереву()

Процедура ПронумероватьСтрокиДерева(СтрокаДерева,ИД,Знач РодительИД)
	ПодчиненныйЭлемент=СтрокаДерева.Строки;
	Для каждого СтрокаДерева из ПодчиненныйЭлемент Цикл
		ИД = ИД + 1;
		СтрокаДерева.ИД = ИД;
		СтрокаДерева.РодительИД = РодительИД;
		ПронумероватьСтрокиДерева(СтрокаДерева,ИД,ИД);
	КонецЦикла;
КонецПроцедуры

Процедура ОповещениеОТекущихПросрочках() Экспорт
	
	//УведомитьПользователяОЕгоЗадачах();
	УведомитьПользователяОЕгоПросрочках();
	
КонецПроцедуры
 
Функция ПодобратьЗамещение(Пользователь, Знач ДатаЗамещения) Экспорт
	
	Результат = Пользователь;
	Если НЕ ЗначениеЗаполнено(ДатаЗамещения) Тогда ДатаЗамещения = ТекущаяДата(); КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗамещениеЪ.Замещение КАК Замещение
	               |ИЗ
	               |	Документ.Замещение КАК ЗамещениеЪ
//Евросиб Гудкова( 21.10.2020 Ticket№ 0210949
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	               |		ПО ЗамещениеЪ.ИсходныйПользователь = ГруппыПользователейСостав.Пользователь
// Евросиб Гудкова)
	               |ГДЕ
	               |	ЗамещениеЪ.Проведен
	               |	И ЗамещениеЪ.РежимДокумента = 0
//Евросиб Гудкова( 01.06.2020 Ticket№0196045 
	               |	И (НЕ ЗамещениеЪ.Замещение.Недействителен)
// Евросиб Гудкова) 				   
//Евросиб Гудкова( 21.10.2020 Ticket№ 0210949
//				|	И ЗамещениеЪ.ИсходныйПользователь = &ИсходныйПользователь
				|	И (ЗамещениеЪ.ИсходныйПользователь = &ИсходныйПользователь 
				|			ИЛИ ГруппыПользователейСостав.Ссылка = &ИсходныйПользователь)
// Евросиб Гудкова) 
	               |	И &ДатаДокумента МЕЖДУ ЗамещениеЪ.НачалоПериодаЗамещения И ЗамещениеЪ.КонецПериодаЗамещения";
	Запрос.УстановитьПараметр("ИсходныйПользователь", Пользователь);
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаЗамещения);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Замещение;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПодобратьЗамещениеОбратное(Пользователь, ДатаЗамещения) Экспорт
	
	// ДИТ Поморцева Т.П. Задача 238786 04.08.2021 начало
	//Результат = Пользователь;
	Результат = Новый Массив;
	Результат.Добавить(Пользователь);
	// ДИТ Поморцева Т.П. Задача 238786 04.08.2021 конец
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗамещениеЪ.ИсходныйПользователь КАК ИсходныйПользователь
	               |ИЗ
	               |	Документ.Замещение КАК ЗамещениеЪ
	               |ГДЕ
	               |	ЗамещениеЪ.Проведен
	               |	И ЗамещениеЪ.РежимДокумента = 0
////Евросиб Гудкова( 01.06.2020 Ticket№0196045 
//	               |	И (НЕ ЗамещениеЪ.ИсходныйПользователь.Недействителен)
//// Евросиб Гудкова) 				   
	               |	И ЗамещениеЪ.Замещение = &Замещение
	               |	И &ДатаДокумента МЕЖДУ ЗамещениеЪ.НачалоПериодаЗамещения И ЗамещениеЪ.КонецПериодаЗамещения";
	Запрос.УстановитьПараметр("Замещение", Пользователь);
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаЗамещения);
	Ответ = Запрос.Выполнить().Выбрать();
	
	// ДИТ Поморцева Т.П. 238786 04.08.2021 начало
	//Если Ответ.Следующий() Тогда
	//	Результат = Ответ.ИсходныйПользователь;
	//КонецЕсли;
	Пока Ответ.Следующий() Цикл
		Результат.Добавить(Ответ.ИсходныйПользователь);
	КонецЦикла;
	// ДИТ Поморцева Т.П. 238786 04.08.2021 конец
	
	Возврат Результат;
	
КонецФункции
 
//Евросиб Гудкова( 08.01.2020 
Процедура УведомитьПользователяПоНДС0(ТаблицаОповещения, СостояниеМаршрута, МаршрутизируемыйОбъект, Тема, Тело) Экспорт

	// первичная проверка на то, что мы вообще можем что-то отправить
	УчетнаяЗаписьПоУмолчанию = РаботаСПочтовымиСообщениями.ПроверитьСистемнаяУчетнаяЗаписьДоступна();
	
	Если не УчетнаяЗаписьПоУмолчанию Тогда возврат; КонецЕсли;
	СистемнаяУчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	АдресДублированияУведомлений = Константы.АдресДублированияОповещенийОЗадачах.Получить();
//	ПрефиксНС = Константы["АдресПубликацииИнформационнойБазыВЛокальнойСети"+?(ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована, "Тестовый", "")].Получить() + "#";

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Состояние", СостояниеМаршрута);
	Запрос.УстановитьПараметр("МаршрутизируемыйОбъект", МаршрутизируемыйОбъект);
#Область Запрос
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	МаршрутизацияСостояния.Исполнитель КАК Исполнитель,
	               |	МаршрутизацияСостояния.Наблюдатель КАК Наблюдатель
	               |ИЗ
	               |	Справочник.Маршрутизация.Состояния КАК МаршрутизацияСостояния
	               |ГДЕ
	               |	МаршрутизацияСостояния.Состояние = &Состояние
	               |	И МаршрутизацияСостояния.Ссылка.МаршрутизируемыйОбъект = &МаршрутизируемыйОбъект
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	МаршрутизацияСостояния.Ссылка";
#КонецОбласти 
	Выборка = Запрос.Выполнить().Выбрать();
	ПолучателиПисьма = Новый Массив;
	Если ЗначениеЗаполнено(АдресДублированияУведомлений) Тогда
		Для каждого Адрес из СтрРазделить(АдресДублированияУведомлений, ";", Ложь) Цикл
			ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", "Адрес отслеживания", Адрес));
		КонецЦикла;
	КонецЕсли;
	ИтоговыйМассивСпециалистов = Новый Массив;
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.Исполнитель) И Строка(Выборка.Исполнитель) <> "<Не указан>" Тогда
			
			Если ТипЗнч(Выборка.Исполнитель) = Тип("СправочникСсылка.Пользователи") Тогда
				Если ИтоговыйМассивСпециалистов.Найти(Выборка.Исполнитель) = неопределено Тогда 
					ИтоговыйМассивСпециалистов.Добавить(Выборка.Исполнитель); 
				КонецЕсли;
			Иначе
				ПлзГруппы = Пользователи_sd_сервер.ПолучитьПользователейГруппы(Выборка.Исполнитель);
				Для каждого Стр3 из ПлзГруппы Цикл
					Если ИтоговыйМассивСпециалистов.Найти(Стр3) = неопределено Тогда ИтоговыйМассивСпециалистов.Добавить(Стр3); КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.Наблюдатель) И Строка(Выборка.Наблюдатель) <> "<Не указан>" Тогда
			Если ТипЗнч(Выборка.Наблюдатель) = Тип("СправочникСсылка.Пользователи") Тогда
				Если ИтоговыйМассивСпециалистов.Найти(Выборка.Наблюдатель) = неопределено Тогда ИтоговыйМассивСпециалистов.Добавить(Выборка.Наблюдатель); КонецЕсли;
			Иначе
				ПлзГруппы = Пользователи_sd_сервер.ПолучитьПользователейГруппы(Выборка.Наблюдатель);
				Для каждого Стр3 из ПлзГруппы Цикл
					Если ИтоговыйМассивСпециалистов.Найти(Стр3) = неопределено Тогда ИтоговыйМассивСпециалистов.Добавить(Стр3); КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Для каждого Специалист Из ИтоговыйМассивСпециалистов Цикл
		EMAIL = ПолучитьEMAILПользователя(ПодобратьЗамещение(Специалист, ТекущаяДата()));
			Если ЗначениеЗаполнено(EMAIL) Тогда
				ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", Строка(Специалист), EMAIL));
			Иначе
				Сообщить("Невозможно отправить пользователю: " + Специалист);
				Продолжить;
			КонецЕсли;
	КонецЦикла; 
//таблица
	Тело = "<b>" + Тело + "</b><br/><br/><table border=1><tr>";
	Для каждого Колонка Из ТаблицаОповещения.Колонки Цикл
		Тело = Тело + "<td>" + Колонка.Заголовок + "</td>";
	КонецЦикла; 
	Тело = Тело + "</tr>";
	
	Для каждого Строка из ТаблицаОповещения Цикл
//			ТекстНС = "<a target=""_blank"" href="""+ПрефиксНС+ПолучитьНавигационнуюСсылку(Стр.Операция)+""">"+ПолучитьНавигационнуюСсылку(Стр.Операция)+"</a>";
		//Тело = Тело + "<tr><td>"+Стр.Операция+"</td><td>"+Стр.Исполнитель+"</td><td>"+Стр.Наблюдатель+"</td><td>"+ТекстНС+"</td><td>"+Стр.КлассНарушения+"</td><td>"+Стр.ДатаОтправления+"</td></tr>";
		Тело = Тело + "<tr>";
		Для каждого Колонка Из ТаблицаОповещения.Колонки Цикл
			Тело = Тело + "<td>" + Строка[Колонка.Имя] + "</td>";
		КонецЦикла; 
		Тело = Тело + "</tr>";
	КонецЦикла;
//конецТаблицы
	
	ПараметрыОтправкиПисьма = новый Структура;
	ПараметрыОтправкиПисьма.Вставить("Тема", Тема);
	ПараметрыОтправкиПисьма.Вставить("Тело", Тело);
	ПараметрыОтправкиПисьма.Вставить("ТипТекста", "HTML");
	ПараметрыОтправкиПисьма.Вставить("Кому", ПолучателиПисьма);
		
	РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(СистемнаяУчетнаяЗапись, ПараметрыОтправкиПисьма);

КонецПроцедуры
 
// Евросиб Гудкова) 