Процедура НачалоВыбораАдреса(Форма, Элемент, ДанныеВыбора, СтандартнаяОбработка, ДанныеОбъекта = Неопределено) Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("Адрес", Элемент.ТекстРедактирования); 
	//Параметры.Вставить("НаселенныйПункт", НаселенныйПункт);
	//Параметры.Вставить("НаселенныйПунктРодитель", РодительНаименование);
	
	Оповещение = Новый ОписаниеОповещения("ПредставлениеНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура);
	Оповещение.ДополнительныеПараметры.Вставить("Форма", Форма);
	Оповещение.ДополнительныеПараметры.Вставить("Элемент", Элемент);
	Оповещение.ДополнительныеПараметры.Вставить("ДанныеОбъекта", ДанныеОбъекта);
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораАдресаПоГеокодеруЯндекс", Параметры, Форма, ,,,Оповещение);
		
КонецПроцедуры  

Процедура ПредставлениеНачалоВыбораЗавершение(Результат, Параметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.ДанныеОбъекта <> Неопределено Тогда
		ИзменяемыйОбъект = Параметры.Форма.Объект;
		ИзменяемыеДанные = Параметры.ДанныеОбъекта;
	Иначе
		ИзменяемыйОбъект = Параметры.Форма;
		ИзменяемыйРеквизит = Параметры.Элемент.Имя;
		ИзменяемыеДанные = ИзменяемыйОбъект[ИзменяемыйРеквизит];
	КонецЕсли;
	Если ИзменяемыеДанные <> Результат.Представление Тогда
		ИзменяемыеДанные = Результат.Представление;
		Параметры.Форма.Модифицированность = Истина;
	КонецЕсли;
	//Если ЗначениеЗаполнено(Результат.НаселенныйПунктСсылка) Тогда
	//	ЗаполнитьЗначенияСвойств(ИзменяемыйОбъект, Результат, "НаселенныйПунктСсылка");		
	//КонецЕсли;

КонецПроцедуры


