&НаКлиенте 
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтаФорма,Команда,Объект);	
КонецПроцедуры  

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
          ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
          ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	Элементы.ГруппаДокументыДляПереноса.ТолькоПросмотр = Объект.Проведен; 
	Элементы.ГруппаДокументыДляПодбора.Видимость = НЕ Объект.Проведен;
	
	//Евросиб Каблов 09.04.2025 ( #105407
	//ПериодВОДляОтбора = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Объект.Организация);
	ПериодВОДляОтбора = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(Объект.Организация);
	//Евросиб Каблов 09.04.2025 )
	ОтборДокументовРТУ.Параметры.УстановитьЗначениеПараметра("ПериодВО", ПериодВОДляОтбора);
	ОтборДокументовОК.Параметры.УстановитьЗначениеПараметра("ПериодВО", ПериодВОДляОтбора);
	ОтборДокументовКРТУ.Параметры.УстановитьЗначениеПараметра("ПериодВО", ПериодВОДляОтбора);
	УстановитьОтборДокументовНаСервере(); 

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаСервере
Процедура ЗаполнитьАкцептыДляОбработкиНаСервере()
	
	////пока не заполняем
	//Возврат;
	//
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФактическиеДоходыВО.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ФактическиеДоходыВО.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_СУЕИСФ
	|ИЗ
	|	РегистрНакопления.ФактическиеДоходыВО КАК ФактическиеДоходыВО
	|ГДЕ
	|	ФактическиеДоходыВО.Регистратор В(&ДокументыИСФ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ФактическиеРасходыВО.Регистратор КАК Регистратор,
	|	ФактическиеРасходыВО.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ВТ_СУЕИСФ.Регистратор КАК ДокументИСФ
	|ПОМЕСТИТЬ ВТ_АкцептыПоСУЕ
	|ИЗ
	|	РегистрНакопления.ФактическиеРасходыВО КАК ФактическиеРасходыВО
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СУЕИСФ КАК ВТ_СУЕИСФ
	|		ПО ФактическиеРасходыВО.ИдентификаторСУЕ = ВТ_СУЕИСФ.ИдентификаторСУЕ
	|ГДЕ
	|	ФактическиеРасходыВО.ИдентификаторСУЕ В
	|			(ВЫБРАТЬ
	|				т.ИдентификаторСУЕ
	|			ИЗ
	|				ВТ_СУЕИСФ КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Акцепт.Ссылка КАК Акцепт,
	|	ВТ_АкцептыПоСУЕ.ДокументИСФ КАК ДокументИСФ
	|ИЗ
	|	ВТ_АкцептыПоСУЕ КАК ВТ_АкцептыПоСУЕ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Акцепт КАК Акцепт
	|		ПО ВТ_АкцептыПоСУЕ.Регистратор = Акцепт.Ссылка
	|ГДЕ
	|	Акцепт.Проведен
	|	И Акцепт.СторнируемыйАкцепт = ЗНАЧЕНИЕ(Документ.Акцепт.ПустаяСсылка)
	|	И НЕ Акцепт.Ссылка В
	|				(ВЫБРАТЬ
	|					Акцепт.СторнируемыйАкцепт КАК СторнируемыйАкцепт
	|				ИЗ
	|					Документ.Акцепт КАК Акцепт
	|				ГДЕ
	|					Акцепт.Проведен)
	|	И Акцепт.Ссылка В
	|			(ВЫБРАТЬ
	|				т.Регистратор
	|			ИЗ
	|				ВТ_АкцептыПоСУЕ КАК т)";
	Запрос.УстановитьПараметр("ДокументыИСФ", Объект.ДокументыДляПереноса.Выгрузить().ВыгрузитьКолонку("ДокументДляПереноса"));
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Объект.АкцептыДляОбработки.Очистить();
		Возврат;
	КонецЕсли;                                
	Объект.АкцептыДляОбработки.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры


&НаКлиенте
Процедура ДокументыДляПереносаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ЗаполнитьАкцептыДляОбработкиНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Элементы.ГруппаДокументыДляПереноса.ТолькоПросмотр = Объект.Проведен; 
	Элементы.ГруппаДокументыДляПодбора.Видимость = НЕ Объект.Проведен;
КонецПроцедуры


&НаКлиенте
Процедура АкцептыДляОбработкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущаяСтрока = Объект.АкцептыДляОбработки.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если ТекущаяСтрока <> Неопределено И Поле.Имя = "АкцептыДляОбработкиАкцепт" И ЗначениеЗаполнено(ТекущаяСтрока.Акцепт) Тогда
		ПоказатьЗначение(, ТекущаяСтрока.Акцепт);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОтборДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	нСтрокаДокумент = Объект.ДокументыДляПереноса.Добавить();
	нСтрокаДокумент.ДокументДляПереноса = ВыбраннаяСтрока;
	ЗаполнитьАкцептыДляОбработкиНаСервере();
	УстановитьОтборДокументовНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДокументовНаСервере()                         
	МассивДобавленныхДокументов = Объект.ДокументыДляПереноса.Выгрузить().ВыгрузитьКолонку("ДокументДляПереноса");
	ОтборДокументовРТУ.Параметры.УстановитьЗначениеПараметра("Ссылка", МассивДобавленныхДокументов);	
	ОтборДокументовОК.Параметры.УстановитьЗначениеПараметра("Ссылка", МассивДобавленныхДокументов);	
	ОтборДокументовКРТУ.Параметры.УстановитьЗначениеПараметра("Ссылка", МассивДобавленныхДокументов);	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыДляПереносаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Объект.Проведен Тогда
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;        
	ТекущаяСтрока = Объект.ДокументыДляПереноса.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Объект.ДокументыДляПереноса.Удалить(ТекущаяСтрока);
	УстановитьОтборДокументовНаСервере();
	ЗаполнитьАкцептыДляОбработкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВыбранныеСтрокиРТУ(Команда)     
	Для каждого ВыделеннаяСтрока Из Элементы.ОтборДокументовРТУ.ВыделенныеСтроки Цикл
		нСтрокаДокумент = Объект.ДокументыДляПереноса.Добавить();
		нСтрокаДокумент.ДокументДляПереноса = ВыделеннаяСтрока;
	КонецЦикла;
	ЗаполнитьАкцептыДляОбработкиНаСервере();
	УстановитьОтборДокументовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВыбранныеСтрокиОК(Команда)
	Для каждого ВыделеннаяСтрока Из Элементы.ОтборДокументовОК.ВыделенныеСтроки Цикл
		нСтрокаДокумент = Объект.ДокументыДляПереноса.Добавить();
		нСтрокаДокумент.ДокументДляПереноса = ВыделеннаяСтрока;
	КонецЦикла;
	ЗаполнитьАкцептыДляОбработкиНаСервере();
	УстановитьОтборДокументовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВыбранныеСтрокиКРТУ(Команда)
	Для каждого ВыделеннаяСтрока Из Элементы.ОтборДокументовКРТУ.ВыделенныеСтроки Цикл
		нСтрокаДокумент = Объект.ДокументыДляПереноса.Добавить();
		нСтрокаДокумент.ДокументДляПереноса = ВыделеннаяСтрока;
	КонецЦикла;
	ЗаполнитьАкцептыДляОбработкиНаСервере();
	УстановитьОтборДокументовНаСервере();
КонецПроцедуры
