///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОписаниеПеременных

// СтандартныеПодсистемы

// Хранилище глобальных переменных.
//
// ПараметрыПриложения - Соответствие - хранилище переменных, где:
//   * Ключ - Строка - имя переменной в формате "ИмяБиблиотеки.ИмяПеременной";
//   * Значение - Произвольный - значение переменной.
//
// Инициализация (на примере СообщенияДляЖурналаРегистрации):
//   ИмяПараметра = "СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации";
//   Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
//     ПараметрыПриложения.Вставить(ИмяПараметра, Новый СписокЗначений);
//   КонецЕсли;
//  
// Использование (на примере СообщенияДляЖурналаРегистрации):
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"].Добавить(...);
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"] = ...;
Перем ПараметрыПриложения Экспорт;

// Конец СтандартныеПодсистемы

// Признак возможности освобождения лицензии при завершении
// работы (только на платформе или в режиме совместимости 8.3.7 и ниже)
Перем ОсвобождатьЛицензиюПриЗавершенииРаботы;

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередНачаломРаботыСистемы()
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПередНачаломРаботыСистемы();
	// Конец СтандартныеПодсистемы
	
	
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПриНачалеРаботыСистемы();
	// Конец СтандартныеПодсистемы
	
	ОсвобождатьЛицензиюПриЗавершенииРаботы = СЛК.ОсвобождатьЛицензиюПриЗавершенииРаботы();
	
	Попытка
		// Запуск
		СЛК.Старт();
		
	Исключение
		
		Инфо = ИнформацияОбОшибке();
		ТекстОшибки = "Ошибка запуска СЛК: " + Инфо.Описание;
		//Сообщить(ТекстОшибки);
		ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации("Доступ.Отказ в доступе",, ТекстОшибки,, Истина);
		////КлассИсключения = СЛКОбщие.ПолучитьКлассИсключения(Инфо.Описание);
		////Если КлассИсключения = "EExecuteError" Или КлассИсключения = "ELocalServerNotFound" Тогда
		////	ОткрытьФорму("Обработка.СЛК.Форма.ПараметрыСвязи");
		////КонецЕсли;
		
		//ЗавершитьРаботуСистемы(Ложь, Ложь);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения);
	// Конец СтандартныеПодсистемы
	
КонецПроцедуры

Процедура ПриЗавершенииРаботыСистемы()
	
	Если ОсвобождатьЛицензиюПриЗавершенииРаботы Тогда
		СЛК.Стоп();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти