///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыСервер.УстановкаПараметровСеанса(ИменаПараметровСеанса);
	// Конец СтандартныеПодсистемы
	
	ПараметрыСеанса.ПапкаГеосервиса = "";
	Попытка
		ПараметрыСеанса.ТекущийКонтрагент = ПараметрыСеанса.ТекущийПользователь.АссоциированныйКонтрагент;
	Исключение
		// запуск системы в служебном режиме не инициализирует пользователя
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли