
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля = Новый Массив;
	Поля.Добавить("НомерДокумента");
	Поля.Добавить("Номер");
	Поля.Добавить("Сток");
	Поля.Добавить("Дата");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	//++ Зубов US 33131 TA 38910 26.10.2021
	//Представление = "" + Данные.НомерДокумента + " от " + Формат(Данные.Дата, "ДФ=dd.MM.yy")+ " по " + Данные.Сток + " (Релиз № " + Данные.Номер + ")";
	Представление = "" + Данные.НомерДокумента + " от " + Формат(Данные.Дата, "ДФ=dd.MM.yy")+ " по " + Данные.Сток + " (Релиз собственника № " + Данные.Номер + ")";
	//-- Зубов US 33131 TA 38910 26.10.2021
КонецПроцедуры

Функция КонтейнерыРелизаСобственника(РелизСобственника) Экспорт
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	
	// Получим таблицу контейнеров релиза собственника с указанием релиза клиента
	// по каждому КТК.
		
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Номинации.Контейнер КАК Контейнер,
	|	Номинации.ТипКТК КАК ТипоразмерКТК,
	|	Номинации.тек_СобственностьКТК КАК тек_СобственностьКТК,
	|	Номинации.ДатаВзятия КАК ДатаВзятия,
	|	Номинации.Ссылка КАК РелизСобственника
	|ПОМЕСТИТЬ втНоминации
	|ИЗ
	|	Документ.РелизСобственника.Номинации КАК Номинации
	|ГДЕ
	|	Номинации.Ссылка = &РелизСобственника
	// Евросиб Фролов (14.03.2022 Ticket №0264362
	|	И Номинации.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	|	И Номинации.ДатаВзятия <> ДАТАВРЕМЯ(1, 1, 1)
	// Евросиб Фролов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втНоминации.Контейнер КАК Контейнер,
	|	втНоминации.ТипоразмерКТК КАК ТипоразмерКТК,
	|	втНоминации.ДатаВзятия КАК ДатаВывоза,
	|	втНоминации.тек_СобственностьКТК КАК ВидСобственности,
	|	ЕСТЬNULL(РелизКлиентаКонтейнеры.Ссылка, ЗНАЧЕНИЕ(Документ.РелизКлиента.ПустаяСсылка)) КАК РелизКлиента
	|ИЗ
	|	втНоминации КАК втНоминации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизКлиента.Контейнеры КАК РелизКлиентаКонтейнеры
	|		ПО втНоминации.РелизСобственника = РелизКлиентаКонтейнеры.Ссылка.РелизСобственника
	//ДИТ Шевченко А.В. US 62421 26.05.2023 -Начало
	|			И втНоминации.Контейнер = РелизКлиентаКонтейнеры.КлючАналитикиПеревозки.Контейнер";
	//ДИТ Шевченко А.В. US 62421 26.05.2023 -Конец
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("РелизСобственника", РелизСобственника);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
	// Евросиб Фролов)
КонецФункции

// ++ ДИТ_Агафонов_task 50388 07.07.2022
Функция ПолучитьПараметрыМаршрутизации(Объект) Экспорт
	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
	ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
	ПараметрыЗапроса.Вставить("Договор", Объект.Договор);
	ПараметрыЗапроса.Вставить("ЦФО", Объект.ЦФО);
	ПараметрыЗапроса.Вставить("КолвоРелизКлиентаНеСовпадаетТипоразмерКТК", Объект.КолвоРелизКлиентаНеСовпадаетТипоразмерКТК);
	ПараметрыЗапроса.Вставить("КолвоРелизКлиентаНоваяЗаписьКТК", Объект.КолвоРелизКлиентаНоваяЗаписьКТК);
	Возврат ПараметрыЗапроса;
КонецФункции
// -- ДИТ_Агафонов_task 50388 07.07.2022

// Евросиб US 88643 TA 88646 Рыбьяков К.А. 04.09.2024 ((
Функция СоздатьКлючАналитикиСтрокиНоминаций(СсылкаРелиз,Контейнер) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НовыйЭлемент = Справочники.КлючиАналитикиНоминацийРелиза.СоздатьЭлемент();
	НовыйЭлемент.Заполнить(Неопределено);
	//Евросиб СубботинВ #102687 24.02.2025 Начало// добавил 2 новых поля для рассылки выведенных из оперирования
	НовыйЭлемент.РелизСобственника = СсылкаРелиз;
	НовыйЭлемент.Контейнер = Контейнер; 
	//Евросиб СубботинВ #102687 24.02.2025 Конец
	НовыйЭлемент.Наименование = Новый УникальныйИдентификатор;
	НовыйЭлемент.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	КлючАналитики = НовыйЭлемент.Ссылка;
	
	Возврат КлючАналитики;
	
КонецФункции

Процедура ОбновитьРеквизитКлючаАналитики(КлючАналитикиСтроки, СтруктураРеквизитовЗначений, РазмерКТК = "") Экспорт //ДИТ Шевченко А.В. US 88683 TA 88689 19.02.2025
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если РазмерКТК = "20" Тогда
		СтруктураРеквизитовЗначений.Вставить("Ставка", СтруктураРеквизитовЗначений.Ставка20);
	ИначеЕсли РазмерКТК = "40" Тогда
		СтруктураРеквизитовЗначений.Вставить("Ставка", СтруктураРеквизитовЗначений.Ставка40);
	КонецЕсли;
	
	РеквизитыКлючаИзменились = Ложь;
	
	Для Каждого ЭлементСтруктуры Из СтруктураРеквизитовЗначений Цикл
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта(ЭлементСтруктуры.Ключ, КлючАналитикиСтроки.Метаданные()) Тогда
			Если ЭлементСтруктуры.Ключ = "Сделка" Тогда
				Продолжить;
			КонецЕсли;
			Если КлючАналитикиСтроки[ЭлементСтруктуры.Ключ] <> ЭлементСтруктуры.Значение Тогда
				РеквизитыКлючаИзменились = Истина;
			КонецЕсли;
			КлючАналитикиСтроки[ЭлементСтруктуры.Ключ] = ЭлементСтруктуры.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Если СтруктураРеквизитовЗначений.Свойство("Сделка") Тогда
		Если РеквизитыКлючаИзменились ИЛИ КлючАналитикиСтроки.Сделка <> СтруктураРеквизитовЗначений.Сделка Тогда
			Если ЗначениеЗаполнено(СтруктураРеквизитовЗначений.Сделка) Тогда
				ОтложенноеИзменениеСервер.ПоставитьОбъектВОчередьИзменения(СтруктураРеквизитовЗначений.Сделка, КлючАналитикиСтроки.Ссылка);
			КонецЕсли;
			Если ЗначениеЗаполнено(КлючАналитикиСтроки.Сделка) И КлючАналитикиСтроки.Сделка <> СтруктураРеквизитовЗначений.Сделка Тогда
				ОтложенноеИзменениеСервер.ПоставитьОбъектВОчередьИзменения(КлючАналитикиСтроки.Сделка, КлючАналитикиСтроки.Ссылка);
			КонецЕсли;
		КонецЕсли;
		КлючАналитикиСтроки.Сделка = СтруктураРеквизитовЗначений.Сделка;
	КонецЕсли;
	
	КлючАналитикиСтроки.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ДанныеЗаполненияСчетаНаОплату(КлючАналитики, РелизСсылка) Экспорт
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РелизСсылка, "
		|Дата,
		|Организация, 
		|ЦФО, 
		|Подразделение, 
		|Контрагент, 
		|Договор, 
		|ПСЦ");
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Основание", РелизСсылка);
	ДанныеЗаполнения.Вставить("Дата", Реквизиты.Дата);
	ДанныеЗаполнения.Вставить("Организация", Реквизиты.Организация);
	ДанныеЗаполнения.Вставить("ЦФО", Реквизиты.ЦФО);
	ДанныеЗаполнения.Вставить("Подразделение", Реквизиты.Подразделение);
	ДанныеЗаполнения.Вставить("Контрагент", Реквизиты.Контрагент);
	ДанныеЗаполнения.Вставить("Договор", Реквизиты.Договор);
	ДанныеЗаполнения.Вставить("Протокол", Реквизиты.ПСЦ);
	РеквизитыПротокола = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Реквизиты.ПСЦ, "Валюта, ВидПеревозки");
	ДанныеЗаполнения.Вставить("Валюта", РеквизитыПротокола.Валюта);
	ДанныеЗаполнения.Вставить("ВидПеревозки", РеквизитыПротокола.ВидПеревозки);

	МинимальнаяДата = Дата("00010101");
	МаксимальнаяДата = Дата("00010101");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РелизСобственникаНоминации.ДатаВзятия КАК ДатаВзятия,
	|	РелизСобственникаНоминации.НормативВозврата КАК НормативВозврата
	|ИЗ
	|	Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
	|ГДЕ
	|	РелизСобственникаНоминации.КлючАналитики В(&КлючАналитики)
	|	И РелизСобственникаНоминации.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("КлючАналитики", КлючАналитики);
	Запрос.УстановитьПараметр("Ссылка", РелизСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПромежуточнаяДата = Выборка.ДатаВзятия + Выборка.НормативВозврата * 86400;
		Если ПромежуточнаяДата > МаксимальнаяДата И ЗначениеЗаполнено(Выборка.ДатаВзятия) Тогда
			МаксимальнаяДата = ПромежуточнаяДата;
			МинимальнаяДата = Выборка.ДатаВзятия;
		КонецЕсли;
	КонецЦикла;
	
	ДанныеЗаполнения.Вставить("Отправка", МинимальнаяДата);
	ДанныеЗаполнения.Вставить("Прибытие", МаксимальнаяДата);
	ДанныеЗаполнения.Вставить("КлючиАналитики", КлючАналитики);

	Возврат ДанныеЗаполнения;
	
КонецФункции
// Евросиб Рыбьяков К.А. 04.09.2024 ))

// Евросиб US 89887 TA 93716 Рыбьяков К.А. 18.11.2024 ((
Процедура ЗаполнитьРелизСобственникаНаОснованииПСЦПоставщика(ДокументОснование, ЕстьИзменения = Ложь, Отказ = Ложь) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПСЦПоставщика.ВидУслугПоставщика КАК ВидУслугПоставщика,
	|	ПСЦПоставщика.СтатусДокумента КАК СтатусДокумента,
	|	ПСЦПоставщика.Проведен КАК Проведен,
	|	ПСЦПоставщика.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ПСЦПоставщика.Типовой КАК Типовой,
	|	ПСЦПоставщика.Договор.ВалютаВзаиморасчетов КАК ВалютаСНП
	|ИЗ
	|	Документ.ПСЦПоставщика КАК ПСЦПоставщика
	|ГДЕ
	|	ПСЦПоставщика.Ссылка = &Документ";
	
	Запрос.УстановитьПараметр("Документ", ДокументОснование);
	
	РеквизитыШапкиПСЦ = Запрос.Выполнить().Выбрать();
	
	СуммаВключаетНДС = Ложь;
	
	Пока РеквизитыШапкиПСЦ.Следующий() Цикл
		
		Если ЕстьИзменения И Не ЕстьСозданныеРелизы(ДокументОснование) Тогда
			Если Не РеквизитыШапкиПСЦ.Типовой Тогда
				Текст = НСтр("ru = 'Тип протокола должен быть ""Типовой"".'");
				ОбщегоНазначения.СообщитьПользователю(Текст,,,, Отказ);
			КонецЕсли;
			Если Не РеквизитыШапкиПСЦ.Проведен Тогда
				Текст = НСтр("ru = 'Протокол не проведен.'");
				ОбщегоНазначения.СообщитьПользователю(Текст,,,, Отказ);
			КонецЕсли;
			Если (РеквизитыШапкиПСЦ.СтатусДокумента <> Перечисления.СтатусыСогласования.СогласованоБезЗамечаний 
				И РеквизитыШапкиПСЦ.СтатусДокумента <> Перечисления.СтатусыСогласования.СогласованСКомментариями
				И РеквизитыШапкиПСЦ.СтатусДокумента <> Перечисления.СтатусыСогласования.Подписано) Тогда
				Текст = НСтр("ru = 'Протокол должен быть согласован или подписан.'");
				ОбщегоНазначения.СообщитьПользователю(Текст,,,, Отказ);
			КонецЕсли;
			Если РеквизитыШапкиПСЦ.ВидУслугПоставщика <> Справочники.ВидыУслугПоставщиков.Контейнеры Тогда
				Текст = НСтр("ru = '""Вид услуг поставщика"" должен быть ""Контейнеры""'");
				ОбщегоНазначения.СообщитьПользователю(Текст,,,, Отказ);
			КонецЕсли;
		КонецЕсли;
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		СуммаВключаетНДС = РеквизитыШапкиПСЦ.СуммаВключаетНДС;
		// Евросиб US 112646 TA 112819 Рыбьяков К.А. 06.07.2025 ((
		ВалютаСНП = РеквизитыШапкиПСЦ.ВалютаСНП;
		// Евросиб Рыбьяков К.А. 06.07.2025 ))
	КонецЦикла;
	
	Если ЕстьИзменения Тогда
		
		ЗапросТекущиеДанныеПСЦ = Новый Запрос;
		ЗапросТекущиеДанныеПСЦ.Текст = "ВЫБРАТЬ
		|	ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПСЦПоставщикаУчетныеЕдиницы.УчетнаяЕдиница) КАК Количество
		|ПОМЕСТИТЬ ВТ_КоличествоКТКВСтроке
		|ИЗ
		|	Документ.ПСЦПоставщика.Услуги КАК ПСЦПоставщикаУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПСЦПоставщика.УчетныеЕдиницы КАК ПСЦПоставщикаУчетныеЕдиницы
		|		ПО ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг = ПСЦПоставщикаУчетныеЕдиницы.ИдентификаторСтрокиУслуг
		|ГДЕ
		|	ПСЦПоставщикаУслуги.Ссылка = &Документ
		|	И ПСЦПоставщикаУслуги.Номенклатура В(&Номенклатура)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(ПСЦПоставщикаКритерииУслуг.ТипоразмерКТК, ЗНАЧЕНИЕ(Справочник.ТипоразмерыТЕ.ПустаяСсылка))) КАК Количество
		|ПОМЕСТИТЬ ВТ_КоличествоТипов
		|ИЗ
		|	Документ.ПСЦПоставщика.Услуги КАК ПСЦПоставщикаУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПСЦПоставщика.КритерииУслуг КАК ПСЦПоставщикаКритерииУслуг
		|		ПО ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг = ПСЦПоставщикаКритерииУслуг.ИдентификаторСтрокиУслуг
		|ГДЕ
		|	ПСЦПоставщикаУслуги.Ссылка = &Документ
		|	И ПСЦПоставщикаУслуги.Номенклатура В(&Номенклатура)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПСЦПоставщикаУслуги.НомерСтроки КАК НомерСтроки,
		|	ПСЦПоставщикаУслуги.Количество / ВТ_КоличествоТипов.Количество КАК КоличествоКТК,
		|	ВЫБОР
		|		КОГДА ПСЦПоставщикаУслуги.ВидСобственности = Значение(Перечисление.ВариантыСобственности.Собственный)
		|			ТОГДА Значение(Справочник.Локации.ПустаяСсылка)   
		|		ИНАЧЕ
		|			ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(ПСЦПоставщикаУслуги.ПунктОтправленияСтрана) = ТИП(Справочник.Мультилокации)
		|					ТОГДА Мультилокации.Локация
		|				ИНАЧЕ ПСЦПоставщикаУслуги.ПунктОтправленияСтрана 
		|			КОНЕЦ
		|	КОНЕЦ КАК ЛокацияСтрана,
		|	ВЫБОР
		|		КОГДА ПСЦПоставщикаУслуги.ВидСобственности = Значение(Перечисление.ВариантыСобственности.Собственный)
		|			ТОГДА Значение(Справочник.Локации.ПустаяСсылка)   
		|		ИНАЧЕ
		|			ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(ПСЦПоставщикаУслуги.ПунктОтправленияГород) = ТИП(Справочник.Мультилокации)
		|					ТОГДА Мультилокации.Локация
		|				ИНАЧЕ ПСЦПоставщикаУслуги.ПунктОтправленияГород
		|			КОНЕЦ
		|	КОНЕЦ КАК ЛокацияГород,  
		|	ВЫБОР
		|		КОГДА ПСЦПоставщикаУслуги.ВидСобственности = Значение(Перечисление.ВариантыСобственности.Собственный)
		|			ТОГДА Неопределено   
		|		ИНАЧЕ
		|			ПСЦПоставщикаУслуги.ПунктНазначенияСтрана
		|	КОНЕЦ КАК ЛокацияСдачи,
		|	ВЫБОР
		|		КОГДА ПСЦПоставщикаУслуги.ВидСобственности = Значение(Перечисление.ВариантыСобственности.Собственный)
		|			ТОГДА Неопределено   
		|		ИНАЧЕ
		|			ПСЦПоставщикаУслуги.ПунктНазначенияГород
		|	КОНЕЦ КАК ВозможныеСтокиСдачи,
		|	ВЫБОР
		|		КОГДА ПСЦПоставщикаУслуги.ВидСобственности = Значение(Перечисление.ВариантыСобственности.Собственный)
		|			ТОГДА Значение(Справочник.Локации.ПустаяСсылка)   
		|		ИНАЧЕ
		|		ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ПСЦПоставщикаУслуги.ПунктОтправления) = ТИП(Справочник.Мультилокации)
		|				ТОГДА Мультилокации.Локация
		|			ИНАЧЕ ПСЦПоставщикаУслуги.ПунктОтправления
		|		КОНЕЦ
		|	КОНЕЦ КАК Сток,
		|	ЕСТЬNULL(ПСЦПоставщикаКритерииУслуг.ТипоразмерКТК, ЗНАЧЕНИЕ(Справочник.ТипоразмерыТЕ.ПустаяСсылка)) КАК ТипКТК,
		|	ПСЦПоставщикаУслуги.ВидСобственности КАК тек_СобственностьКТК,
		|	ВТ_КоличествоКТКВСтроке.Количество КАК КоличествоКТКВДетализации,
		|	ПСЦПоставщикаУслуги.Валюта КАК Валюта,
		|	ПСЦПоставщикаУслуги.НормаПользования КАК НормативВозврата,
		|	ВЫБОР
		|		КОГДА ПСЦПоставщикаУслуги.СтавкаПрогрессивная
		|			ТОГДА 0
		|		ИНАЧЕ
		|			ПСЦПоставщикаУслуги.СтоимостьБезНДС
		|	КОНЕЦ КАК Ставка,
		//|	ПСЦПоставщикаУслуги.СтоимостьБезНДС КАК Ставка,
		|	ПСЦПоставщикаУслуги.СтавкаНДС КАК СтавкаНДС,
		|	ПСЦПоставщикаУслуги.Комментарий КАК тек_Примечание,
		|	ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
		|	ДокументПСЦПоставщика.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	ДокументПСЦПоставщика.Организация КАК Организация,
		|	ДокументПСЦПоставщика.ЦФО КАК ЦФО,
		|	ДокументПСЦПоставщика.Подразделение КАК Подразделение,
		|	ДокументПСЦПоставщика.Контрагент КАК Контрагент,
		|	ДокументПСЦПоставщика.Договор КАК Договор,
		|	ДокументПСЦПоставщика.НачалоДействия КАК НачалоДействия,
		|	ДокументПСЦПоставщика.ОкончаниеДействия КАК ОкончаниеДействия,
		|	ПСЦПоставщикаУслуги.ИнструкцииПоСдаче КАК ИнструкцииПоСдаче
		|ИЗ
		|	Документ.ПСЦПоставщика.Услуги КАК ПСЦПоставщикаУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК Мультилокации
		|		ПО (ПСЦПоставщикаУслуги.ПунктОтправления = Мультилокации.Ссылка
		|				ИЛИ ПСЦПоставщикаУслуги.ПунктОтправленияГород = Мультилокации.Ссылка
		|				ИЛИ ПСЦПоставщикаУслуги.ПунктОтправленияСтрана = Мультилокации.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПСЦПоставщика.УчетныеЕдиницы КАК ПСЦПоставщикаУчетныеЕдиницы
		|		ПО ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг = ПСЦПоставщикаУчетныеЕдиницы.ИдентификаторСтрокиУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПСЦПоставщика.КритерииУслуг КАК ПСЦПоставщикаКритерииУслуг
		|		ПО ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг = ПСЦПоставщикаКритерииУслуг.ИдентификаторСтрокиУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоТипов КАК ВТ_КоличествоТипов
		|		ПО ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг = ВТ_КоличествоТипов.ИдентификаторСтрокиУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоКТКВСтроке КАК ВТ_КоличествоКТКВСтроке
		|		ПО ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг = ВТ_КоличествоКТКВСтроке.ИдентификаторСтрокиУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПСЦПоставщика КАК ДокументПСЦПоставщика
		|		ПО (&Документ = ДокументПСЦПоставщика.Ссылка)
		|ГДЕ
		|	ПСЦПоставщикаУслуги.Ссылка = &Документ
		|	И ПСЦПоставщикаУслуги.Номенклатура В(&Номенклатура)";
		
		ЗапросДетализацияКТКПСЦ = Новый Запрос;
		ЗапросДетализацияКТКПСЦ.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПСЦПоставщикаУслуги.НомерСтроки КАК НомерСтроки,
		|	ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
		|	УчетныеЕдиницы.УчетнаяЕдиница КАК Контейнер,
		|	УчетныеЕдиницы.УчетнаяЕдиница.ТипТЕ КАК ТипКТК
		|ИЗ
		|	Документ.ПСЦПоставщика.Услуги КАК ПСЦПоставщикаУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПСЦПоставщика.УчетныеЕдиницы КАК УчетныеЕдиницы 
		|		ПО (УчетныеЕдиницы.ИдентификаторСтрокиУслуг = ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПСЦПоставщика.КритерииУслуг КАК КритерииУслуг 
		|		ПО (КритерииУслуг.ИдентификаторСтрокиУслуг = ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг)
		|ГДЕ
		|	ПСЦПоставщикаУслуги.Ссылка = &Документ
		|	И ПСЦПоставщикаУслуги.Номенклатура В (&Номенклатура)
		|	И УчетныеЕдиницы.УчетнаяЕдиница <> Значение(Справочник.ТЕ.ПустаяСсылка)";
		
		МассивНоменклатур = Новый Массив;
		МассивНоменклатур.Добавить(Справочники.Номенклатура.АрендаКонтейнеров);
		МассивНоменклатур.Добавить(Справочники.Номенклатура.ПредоставлениеКТК);
		
		ЗапросТекущиеДанныеПСЦ.УстановитьПараметр("Номенклатура", МассивНоменклатур);
		ЗапросТекущиеДанныеПСЦ.УстановитьПараметр("Документ", ДокументОснование);
		
		ЗапросДетализацияКТКПСЦ.УстановитьПараметр("Номенклатура", МассивНоменклатур);
		ЗапросДетализацияКТКПСЦ.УстановитьПараметр("Документ", ДокументОснование);
		
		ЗапросДанныеВРелизах = Новый Запрос;
		ЗапросДанныеВРелизах.Текст = "ВЫБРАТЬ
		|	СУММА(1) КАК КоличествоКТК,
		|	РелизСобственника.Локация КАК ЛокацияГород,
		|	РелизСобственника.Локация КАК ЛокацияСтрана,
		|	РелизСобственника.ВозможныеСтокиСдачи КАК ВозможныеСтокиСдачи,
		|	РелизСобственника.Сток КАК Сток,
		|	РелизСобственника.ЛокацияСдачи КАК ЛокацияСдачи,
		|	РелизСобственникаНоминации.ТипКТК КАК ТипКТК,
		|	РелизСобственникаНоминации.Валюта КАК Валюта,
		|	РелизСобственникаНоминации.НормативВозврата КАК НормативВозврата,
		|	РелизСобственникаНоминации.Ставка КАК Ставка,
		|	РелизСобственникаНоминации.СтавкаНДС КАК СтавкаНДС,
		|	РелизСобственникаНоминации.тек_СобственностьКТК КАК тек_СобственностьКТК,
		|	РелизСобственникаНоминации.тек_Примечание КАК тек_Примечание,
		|	РелизСобственникаНоминации.ИдентификаторСтрокиПСЦПоставщика КАК ИдентификаторСтрокиУслуг,
		|	РелизСобственникаНоминации.НДСВключая КАК НДСВключая,
		|	РелизСобственникаНоминации.СтавкаПрогрессивная КАК СтавкаПрогрессивная,
		|	РелизСобственника.Организация КАК Организация,
		|	РелизСобственника.ЦФО КАК ЦФО,
		|	РелизСобственника.Подразделение КАК Подразделение,
		|	РелизСобственника.Контрагент КАК Контрагент,
		|	РелизСобственника.Договор КАК Договор,
		|	НАЧАЛОПЕРИОДА(РелизСобственника.НачалоДействия, ДЕНЬ) КАК НачалоДействия,
		|	НАЧАЛОПЕРИОДА(РелизСобственника.ОкончаниеДействия, ДЕНЬ) КАК ОкончаниеДействия,
		|	РелизСобственникаНоминации.ИнструкцииПоСдаче КАК ИнструкцииПоСдаче,
		|	РелизСобственника.ДоплатныеКТК КАК ДоплатныеКТК,
		|	РелизСобственника.СобственныеКТК КАК СобственныеКТК
		|ИЗ
		|	Документ.РелизСобственника КАК РелизСобственника
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
		|		ПО РелизСобственника.Ссылка = РелизСобственникаНоминации.Ссылка
		|ГДЕ
		|	РелизСобственника.ПСЦ = &Документ
		|	И НЕ РелизСобственника.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	РелизСобственника.Локация,
		|	РелизСобственникаНоминации.ТипКТК,
		|	РелизСобственника.ЛокацияСдачи,
		|	РелизСобственникаНоминации.Валюта,
		|	РелизСобственникаНоминации.НормативВозврата,
		|	РелизСобственникаНоминации.Ставка,
		|	РелизСобственникаНоминации.СтавкаНДС,
		|	РелизСобственникаНоминации.тек_СобственностьКТК,
		|	РелизСобственникаНоминации.тек_Примечание,
		|	РелизСобственникаНоминации.ИдентификаторСтрокиПСЦПоставщика,
		|	РелизСобственникаНоминации.НДСВключая,
		|	РелизСобственника.Организация,
		|	РелизСобственника.ЦФО,
		|	РелизСобственника.Подразделение,
		|	РелизСобственника.Контрагент,
		|	РелизСобственника.Договор,
		|	НАЧАЛОПЕРИОДА(РелизСобственника.НачалоДействия, ДЕНЬ),
		|	НАЧАЛОПЕРИОДА(РелизСобственника.ОкончаниеДействия, ДЕНЬ),
		|	РелизСобственникаНоминации.СтавкаПрогрессивная,
		|	РелизСобственника.ВозможныеСтокиСдачи,
		|	РелизСобственника.Сток,
		|	РелизСобственникаНоминации.ИнструкцииПоСдаче,
		|	РелизСобственника.ДоплатныеКТК,
		|	РелизСобственника.СобственныеКТК";
		
		ЗапросДетализацияКТКРелиза = Новый Запрос;
		ЗапросДетализацияКТКРелиза.Текст = "ВЫБРАТЬ
		|	РелизСобственникаНоминации.Контейнер КАК Контейнер,
		|	РелизСобственникаНоминации.Контейнер.ТипТЕ КАК ТипКТК,
		|	РелизСобственникаНоминации.ИдентификаторСтрокиПСЦПоставщика КАК ИдентификаторСтрокиУслуг
		|ИЗ
		|	Документ.РелизСобственника КАК РелизСобственника
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
		|		ПО РелизСобственника.Ссылка = РелизСобственникаНоминации.Ссылка
		|ГДЕ
		|	РелизСобственника.ПСЦ = &Документ
		|	И НЕ РелизСобственника.ПометкаУдаления
		|	И РелизСобственникаНоминации.Контейнер <> Значение(Справочник.ТЕ.ПустаяСсылка)";
		
		ЗапросСНПРелиза = Новый Запрос;
		ЗапросСНПРелиза.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РелизСобственникаНоминации.ТипКТК КАК ТипоразмерКТК,
		|	РелизСобственникаСНП.От КАК От,
		|	РелизСобственникаСНП.До КАК До,
		|	РелизСобственникаСНП.Стоимость КАК Стоимость,
		|	РелизСобственникаНоминации.ИдентификаторСтрокиПСЦПоставщика КАК ИдентификаторСтрокиУслуг,
		|	РелизСобственникаНоминации.СтавкаПрогрессивная КАК СтавкаПрогрессивная,
		|	РелизСобственника.ВозможныеСтокиСдачи КАК ВозможныеСтокиСдачи,
		|	РелизСобственника.Сток КАК Сток,
		|	РелизСобственника.ЛокацияСдачи КАК ЛокацияСдачи,
		|	РелизСобственника.Локация КАК ЛокацияГород,
		|	РелизСобственника.Локация КАК ЛокацияСтрана
		|ИЗ
		|	Документ.РелизСобственника КАК РелизСобственника
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизСобственника.СНП КАК РелизСобственникаСНП
		|			ПО (РелизСобственникаСНП.ГУИДСтроки = РелизСобственникаНоминации.ГУИДСтроки)
		|		ПО РелизСобственника.Ссылка = РелизСобственникаНоминации.Ссылка
		|ГДЕ
		|	РелизСобственника.ПСЦ = &Документ
		|	И НЕ РелизСобственника.ПометкаУдаления
		|	И НЕ РелизСобственникаНоминации.ТипКТК ЕСТЬ NULL
		|	И НЕ РелизСобственникаСНП.ГУИДСтроки ЕСТЬ NULL";
		
		ЗапросСНПРелиза.УстановитьПараметр("Документ", ДокументОснование);
		
		ЗапросДанныеВРелизах.УстановитьПараметр("Документ", ДокументОснование);
		ЗапросДетализацияКТКРелиза.УстановитьПараметр("Документ", ДокументОснование);
		
		ВыгрузкаДанныеВРелизах = ЗапросДанныеВРелизах.Выполнить().Выгрузить();
		//ВыгрузкаДетализацияКТКВРелизах = ЗапросДетализацияКТКРелиза.Выполнить().Выгрузить();
		ВыгрузкаСтрокиПСЦТекущие = ЗапросТекущиеДанныеПСЦ.Выполнить().Выгрузить();
		ВыгрузкаДетализацияКТКПСЦ = ЗапросДетализацияКТКПСЦ.Выполнить().Выгрузить();
		
		ПроверитьСтрокиПСЦНаОшибки(ВыгрузкаДетализацияКТКПСЦ, ВыгрузкаСтрокиПСЦТекущие, Отказ);
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		ТаблицаСтавокСНП = СтавкиСНП(ДокументОснование);
		
		СтрокиКИзменению = Новый Массив;
		КонтенерыКУдалению = Новый Массив;
		КонтенерыКДобавлению = Новый Структура;
		КонтенерыКДобавлению.Вставить("МассивКонтейнеров", Новый Массив);
		КонтенерыКДобавлению.Вставить("ИдентификаторыСтрокУслуг", Новый Массив);
		
		СоответствиеСтрокРелизов = Новый Соответствие;
		Для Каждого СтрокаВРелизе Из ВыгрузкаДанныеВРелизах Цикл
			СоответствиеСтрокРелизов.Вставить(СтрокаВРелизе.ИдентификаторСтрокиУслуг, СтрокаВРелизе);
		КонецЦикла;
		
		МассивЗаписываемыхОбъектов = Новый Соответствие;
		
		Если ВыгрузкаСтрокиПСЦТекущие.Количество() > 0 И ВыгрузкаДанныеВРелизах.Количество() > 0 Тогда
			ЕстьИзменениеВШапке = Ложь;
			ЕстьИзменениеВШапке = ЕстьИзменениеВШапке Или (ВыгрузкаСтрокиПСЦТекущие[0].СуммаВключаетНДС <> ВыгрузкаДанныеВРелизах[0].НДСВключая);
			ЕстьИзменениеВШапке = ЕстьИзменениеВШапке Или (ВыгрузкаСтрокиПСЦТекущие[0].Организация <> ВыгрузкаДанныеВРелизах[0].Организация);
			ЕстьИзменениеВШапке = ЕстьИзменениеВШапке Или (ВыгрузкаСтрокиПСЦТекущие[0].ЦФО <> ВыгрузкаДанныеВРелизах[0].ЦФО);
			ЕстьИзменениеВШапке = ЕстьИзменениеВШапке Или (ВыгрузкаСтрокиПСЦТекущие[0].Подразделение <> ВыгрузкаДанныеВРелизах[0].Подразделение);
			ЕстьИзменениеВШапке = ЕстьИзменениеВШапке Или (ВыгрузкаСтрокиПСЦТекущие[0].Контрагент <> ВыгрузкаДанныеВРелизах[0].Контрагент);
			ЕстьИзменениеВШапке = ЕстьИзменениеВШапке Или (ВыгрузкаСтрокиПСЦТекущие[0].Договор <> ВыгрузкаДанныеВРелизах[0].Договор);
			ЕстьИзменениеВШапке = ЕстьИзменениеВШапке Или (ВыгрузкаСтрокиПСЦТекущие[0].НачалоДействия <> ВыгрузкаДанныеВРелизах[0].НачалоДействия);
			ЕстьИзменениеВШапке = ЕстьИзменениеВШапке Или (ВыгрузкаСтрокиПСЦТекущие[0].ОкончаниеДействия <> ВыгрузкаДанныеВРелизах[0].ОкончаниеДействия);
			Если ЕстьИзменениеВШапке Тогда
				ИзменитьОбщиеРеквизитыРелиза(ВыгрузкаСтрокиПСЦТекущие, ДокументОснование, МассивЗаписываемыхОбъектов);
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого СтрокаПСЦ Из ВыгрузкаСтрокиПСЦТекущие Цикл
			ПроверитьЛокацииВСтроке(СтрокаПСЦ);
			Отбор = Новый Структура;
			Отбор.Вставить("ИдентификаторСтрокиУслуг", СтрокаПСЦ.ИдентификаторСтрокиУслуг);
			Отбор.Вставить("ТипКТК", СтрокаПСЦ.ТипКТК);
			Если ЗначениеЗаполнено(СтрокаПСЦ.ЛокацияГород) Тогда
				Отбор.Вставить("ЛокацияГород", СтрокаПСЦ.ЛокацияГород);
			Иначе
				Отбор.Вставить("ЛокацияГород", СтрокаПСЦ.ЛокацияСтрана);
			КонецЕсли;
			Отбор.Вставить("ЛокацияСдачи", СтрокаПСЦ.ЛокацияСдачи);
			Отбор.Вставить("ВозможныеСтокиСдачи", СтрокаПСЦ.ВозможныеСтокиСдачи);
			Отбор.Вставить("Сток", СтрокаПСЦ.Сток);
			Отбор.Вставить("тек_СобственностьКТК", СтрокаПСЦ.тек_СобственностьКТК);
			НайденныеСтроки = ВыгрузкаДанныеВРелизах.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() = 0 Тогда
				СоздатьСтроки(СтрокаПСЦ, ДокументОснование, ТаблицаСтавокСНП, ВалютаСНП);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаРелиза Из ВыгрузкаДанныеВРелизах Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("ИдентификаторСтрокиУслуг", СтрокаРелиза.ИдентификаторСтрокиУслуг);
			Отбор.Вставить("ТипКТК", СтрокаРелиза.ТипКТК);
			ТипЛокации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаРелиза.ЛокацияГород, "Тип");
			Если ТипЗнч(ТипЛокации) = Справочники.ТипыЛокаций.Страна Тогда
				Отбор.Вставить("ЛокацияСтрана", СтрокаРелиза.ЛокацияГород);
			Иначе
				Отбор.Вставить("ЛокацияГород", СтрокаРелиза.ЛокацияГород);
			КонецЕсли;
			Отбор.Вставить("ЛокацияСдачи", СтрокаРелиза.ЛокацияСдачи);
			Отбор.Вставить("ВозможныеСтокиСдачи", СтрокаРелиза.ВозможныеСтокиСдачи);
			Отбор.Вставить("Сток", СтрокаРелиза.Сток);
			Отбор.Вставить("тек_СобственностьКТК", СтрокаРелиза.тек_СобственностьКТК);
			НайденныеСтроки = ВыгрузкаСтрокиПСЦТекущие.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() = 0 Тогда
				УдалитьСтроки(СтрокаРелиза, ДокументОснование, МассивЗаписываемыхОбъектов);
			КонецЕсли;
		КонецЦикла;
		
		ВыгрузкаДетализацияКТКВРелизах = ЗапросДетализацияКТКРелиза.Выполнить().Выгрузить();
		
		Для Каждого СтрокаРелиза Из ВыгрузкаДетализацияКТКВРелизах Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("ИдентификаторСтрокиУслуг", СтрокаРелиза.ИдентификаторСтрокиУслуг);
			Отбор.Вставить("ТипКТК", СтрокаРелиза.ТипКТК);
			Отбор.Вставить("Контейнер", СтрокаРелиза.Контейнер);
			НайденныеСтроки = ВыгрузкаДетализацияКТКПСЦ.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() = 0 Тогда
				КонтенерыКУдалению.Добавить(СтрокаРелиза.Контейнер);
			КонецЕсли;
		КонецЦикла;
		
		Если КонтенерыКУдалению.Количество() > 0 Тогда
			УдалитьКонтейнеры(КонтенерыКУдалению, ДокументОснование, МассивЗаписываемыхОбъектов);
		КонецЕсли;
		
		Для Каждого СтрокаПСЦСКТК Из ВыгрузкаДетализацияКТКПСЦ Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("ИдентификаторСтрокиУслуг", СтрокаПСЦСКТК.ИдентификаторСтрокиУслуг);
			Отбор.Вставить("ТипКТК", СтрокаПСЦСКТК.ТипКТК);
			Отбор.Вставить("Контейнер", СтрокаПСЦСКТК.Контейнер);
			НайденныеСтроки = ВыгрузкаДетализацияКТКВРелизах.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() = 0 Тогда
				Контейнер = Новый Структура;
				Контейнер.Вставить("ИдентификаторСтрокиУслуг", СтрокаПСЦСКТК.ИдентификаторСтрокиУслуг);
				Контейнер.Вставить("Контейнер", СтрокаПСЦСКТК.Контейнер);
				Контейнер.Вставить("ТипКТК", СтрокаПСЦСКТК.ТипКТК);
				КонтенерыКДобавлению.МассивКонтейнеров.Добавить(Контейнер);
				КонтенерыКДобавлению.ИдентификаторыСтрокУслуг.Добавить(СтрокаПСЦСКТК.ИдентификаторСтрокиУслуг);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаПСЦСКоличеством Из ВыгрузкаСтрокиПСЦТекущие Цикл
			СтрокаРелиза = СоответствиеСтрокРелизов.Получить(СтрокаПСЦСКоличеством.ИдентификаторСтрокиУслуг);	
			Если СтрокаРелиза = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ЕстьИзменениеВКоличествеКТК = Ложь;
			ЕстьИзменениеВКоличествеКТК = (СтрокаПСЦСКоличеством.КоличествоКТК <> СтрокаРелиза.КоличествоКТК);
			Если ЕстьИзменениеВКоличествеКТК Тогда
				ДобавитьУдалитьСтроки(СтрокаПСЦСКоличеством, ДокументОснование, СтрокаРелиза.КоличествоКТК, МассивЗаписываемыхОбъектов);
			КонецЕсли;
		КонецЦикла;
		
		Если КонтенерыКДобавлению.МассивКонтейнеров.Количество() > 0 Тогда
			Добавитьконтейнеры(КонтенерыКДобавлению, ДокументОснование, МассивЗаписываемыхОбъектов);
		КонецЕсли;
		
		Для Каждого ЗаписываемыйОбъект Из МассивЗаписываемыхОбъектов Цикл
			ЗаписываемыйОбъект.Значение.Записать();
		КонецЦикла;
		
		Для Каждого СтрокаПСЦ Из ВыгрузкаСтрокиПСЦТекущие Цикл
			СтрокаРелиза = СоответствиеСтрокРелизов.Получить(СтрокаПСЦ.ИдентификаторСтрокиУслуг);
			Если СтрокаРелиза = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ЕстьИзменение = Ложь;
			ЕстьИзменение = ЕстьИзменение Или (СтрокаПСЦ.Валюта <> СтрокаРелиза.Валюта);
			ЕстьИзменение = ЕстьИзменение Или (СтрокаПСЦ.НормативВозврата <> СтрокаРелиза.НормативВозврата);
			ЕстьИзменение = ЕстьИзменение Или (СтрокаПСЦ.Ставка <> СтрокаРелиза.Ставка);
			ЕстьИзменение = ЕстьИзменение Или (СтрокаПСЦ.СтавкаНДС <> СтрокаРелиза.СтавкаНДС);
			ЕстьИзменение = ЕстьИзменение Или (СтрокаПСЦ.тек_СобственностьКТК <> СтрокаРелиза.тек_СобственностьКТК);
			ЕстьИзменение = ЕстьИзменение Или (СтрокаПСЦ.тек_Примечание <> СтрокаРелиза.тек_Примечание);
			ЕстьИзменение = ЕстьИзменение Или (СтрокаПСЦ.ИнструкцииПоСдаче <> СтрокаРелиза.ИнструкцииПоСдаче);
			Если ЕстьИзменение Тогда
				СтрокиКИзменению.Добавить(СтрокаПСЦ);
			КонецЕсли;
		КонецЦикла;
		
		ВыгрузкаДанныеВРелизах = ЗапросДанныеВРелизах.Выполнить().Выгрузить();
		ВыгрузкаДанныеСНПРелизах = ЗапросСНПРелиза.Выполнить().Выгрузить();
		
		Для Каждого СтрокаСтавкаПСЦ Из ТаблицаСтавокСНП Цикл
			ОтборПоискаСтавки = Новый Структура;
			ОтборПоискаСтавки.Вставить("От", СтрокаСтавкаПСЦ.От);
			ОтборПоискаСтавки.Вставить("До", СтрокаСтавкаПСЦ.До);
			ОтборПоискаСтавки.Вставить("ЛокацияСдачи", СтрокаСтавкаПСЦ.ЛокацияСдачи);
			ОтборПоискаСтавки.Вставить("Сток", СтрокаСтавкаПСЦ.Сток);
			ОтборПоискаСтавки.Вставить("ВозможныеСтокиСдачи", СтрокаСтавкаПСЦ.ВозможныеСтокиСдачи);
			Если ЗначениеЗаполнено(СтрокаСтавкаПСЦ.ЛокацияГород) Тогда
				ОтборПоискаСтавки.Вставить("ЛокацияГород", СтрокаСтавкаПСЦ.ЛокацияГород);
			ИначеЕсли ЗначениеЗаполнено(СтрокаСтавкаПСЦ.ЛокацияСтрана) Тогда
				ОтборПоискаСтавки.Вставить("ЛокацияСтрана", СтрокаСтавкаПСЦ.ЛокацияСтрана);
			КонецЕсли;
			Если СтрокаСтавкаПСЦ.СтавкаПрогрессивная Тогда
				ОтборПоискаСтавки.Вставить("Стоимость", СтрокаСтавкаПСЦ.СтоимостьБезНДСИзШкалы);
			Иначе
				ОтборПоискаСтавки.Вставить("Стоимость", СтрокаСтавкаПСЦ.СтоимостьБезНДСИзУслуг);
			КонецЕсли;
			ОтборПоискаСтавки.Вставить("ТипоразмерКТК", СтрокаСтавкаПСЦ.ТипоразмерКТК);
			ОтборПоискаСтавки.Вставить("СтавкаПрогрессивная", СтрокаСтавкаПСЦ.СтавкаПрогрессивная);
			ЕстьСтавка = ВыгрузкаДанныеСНПРелизах.НайтиСтроки(ОтборПоискаСтавки);
			//Если такая ставка уже есть то ничего не делаем
			Если ЕстьСтавка.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			ОтборСтавки = Новый Структура;
			ОтборСтавки.Вставить("ТипКТК", СтрокаСтавкаПСЦ.ТипоразмерКТК);
			ОтборСтавки.Вставить("ЛокацияСдачи", СтрокаСтавкаПСЦ.ЛокацияСдачи);
			ОтборСтавки.Вставить("Сток", СтрокаСтавкаПСЦ.Сток);
			ОтборСтавки.Вставить("ВозможныеСтокиСдачи", СтрокаСтавкаПСЦ.ВозможныеСтокиСдачи);
			Если ЗначениеЗаполнено(СтрокаСтавкаПСЦ.ЛокацияГород) Тогда
				ОтборСтавки.Вставить("ЛокацияГород", СтрокаСтавкаПСЦ.ЛокацияГород);
			ИначеЕсли ЗначениеЗаполнено(СтрокаСтавкаПСЦ.ЛокацияСтрана) Тогда
				ОтборСтавки.Вставить("ЛокацияСтрана", СтрокаСтавкаПСЦ.ЛокацияСтрана);
			КонецЕсли;
			СтрокиСИзмененнойСтавкой = ВыгрузкаДанныеВРелизах.НайтиСтроки(ОтборСтавки);
			Для Каждого СтрокаКИзменению Из СтрокиСИзмененнойСтавкой Цикл
				СтрокиКИзменению.Добавить(СтрокаКИзменению);
			КонецЦикла;
			Если ТипЗнч(СтрокаСтавкаПСЦ.ВозможныеСтокиСдачиМультилокация) = Тип("СправочникСсылка.Мультилокации") Тогда
				ОтборСтавки.Удалить("ВозможныеСтокиСдачи");
				ОтборСтавки.Вставить("ВозможныеСтокиСдачи", СтрокаСтавкаПСЦ.ВозможныеСтокиСдачиМультилокация);
			КонецЕсли;
			СтрокиСИзмененнойСтавкой = ВыгрузкаДанныеВРелизах.НайтиСтроки(ОтборСтавки);
			Для Каждого СтрокаКИзменению Из СтрокиСИзмененнойСтавкой Цикл
				СтрокиКИзменению.Добавить(СтрокаКИзменению);
			КонецЦикла;
		КонецЦикла;
		
		Для Каждого СтрокаРелиза Из ВыгрузкаДанныеСНПРелизах Цикл
			ОтборПоискаСтавки = Новый Структура;
			ОтборПоискаСтавки.Вставить("От", СтрокаРелиза.От);
			ОтборПоискаСтавки.Вставить("До", СтрокаРелиза.До);
			ОтборПоискаСтавки.Вставить("ЛокацияСдачи", СтрокаРелиза.ЛокацияСдачи);
			ОтборПоискаСтавки.Вставить("Сток", СтрокаРелиза.Сток);
			ОтборПоискаСтавки.Вставить("ВозможныеСтокиСдачи", СтрокаРелиза.ВозможныеСтокиСдачи);
			Если ЗначениеЗаполнено(СтрокаРелиза.ЛокацияГород) Тогда
				ОтборПоискаСтавки.Вставить("ЛокацияГород", СтрокаРелиза.ЛокацияГород);
			ИначеЕсли ЗначениеЗаполнено(СтрокаРелиза.ЛокацияСтрана) Тогда
				ОтборПоискаСтавки.Вставить("ЛокацияСтрана", СтрокаРелиза.ЛокацияСтрана);
			КонецЕсли;
			Если СтрокаРелиза.СтавкаПрогрессивная Тогда
				ОтборПоискаСтавки.Вставить("СтоимостьБезНДСИзШкалы", СтрокаРелиза.Стоимость);
			Иначе
				ОтборПоискаСтавки.Вставить("СтоимостьБезНДСИзУслуг", СтрокаРелиза.Стоимость);
			КонецЕсли;
			ОтборПоискаСтавки.Вставить("ТипоразмерКТК", СтрокаРелиза.ТипоразмерКТК);
			ОтборПоискаСтавки.Вставить("СтавкаПрогрессивная", СтрокаРелиза.СтавкаПрогрессивная);
			// Если не нашли ставку по параметрам то добавляем строку к изменению
			НайденныеСтроки = ТаблицаСтавокСНП.НайтиСтроки(ОтборПоискаСтавки);
			Если НайденныеСтроки.Количество() = 0 Тогда
				ОтборСтрок = Новый Структура;
				ОтборСтрок.Вставить("ИдентификаторСтрокиУслуг", СтрокаРелиза.ИдентификаторСтрокиУслуг);
				СтрокиСИзмененнойСтавкой = ВыгрузкаДанныеВРелизах.НайтиСтроки(ОтборСтрок);
				Для Каждого СтрокаКИзменению Из СтрокиСИзмененнойСтавкой Цикл
					Если СтрокиКИзменению.Найти(СтрокаКИзменению) = Неопределено Тогда
						СтрокиКИзменению.Добавить(СтрокаКИзменению);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Строка Из СтрокиКИзменению Цикл
			ИзменитьСтроки(Строка, ДокументОснование, ТаблицаСтавокСНП, ВалютаСНП);
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Процедура СоздатьСтроки(Строка, ДокументОснование, СтавкиСНП, ВалютаСНП)
	
	ВывестиСообщениеОбОшибке = Ложь;
	КоличествоКТК = Строка.КоличествоКТК;
	ПривязаныеКТККСтрокеПСЦ = НайтиПривязаныеКТККСтроке(Строка);
	
	Релиз = НайтиРелизПоПараметрам(Строка, ДокументОснование);
	РелизОбъект = Неопределено;
	ОшибкаСтавки = Ложь;
	
	Если Релиз <> Неопределено Тогда
		РелизОбъект = Релиз.ПолучитьОбъект();
	Иначе
		РелизОбъект = Документы.РелизСобственника.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(РелизОбъект, Строка);
		РелизОбъект.ПСЦ = ДокументОснование;
		РелизОбъект.НаОсновании = Истина;
		РелизОбъект.Дата = ТекущаяДатаСеанса();
		РелизОбъект.Создано = ТекущаяДатаСеанса();
		РелизОбъект.Изменено = ТекущаяДатаСеанса();
		РелизОбъект.Автор = Пользователи.ТекущийПользователь();
		РелизОбъект.Редактор = Пользователи.ТекущийПользователь();
		РелизОбъект.ПСЦ = ДокументОснование;
		Если ЗначениеЗаполнено(Строка.ЛокацияГород) Тогда
			РелизОбъект.Локация = Строка.ЛокацияГород;
		Иначе
			РелизОбъект.Локация = Строка.ЛокацияСтрана;
		КонецЕсли;
		Если Строка.тек_СобственностьКТК = Перечисления.ВариантыСобственности.Собственный Тогда
			РелизОбъект.СобственныеКТК = Истина;
			РелизОбъект.Локация = Неопределено;
			РелизОбъект.ЛокацияСдачи = Неопределено;
			РелизОбъект.ВозможныеСтокиСдачи = Неопределено;
			РелизОбъект.Сток = Неопределено;
		ИначеЕсли Строка.тек_СобственностьКТК = Перечисления.ВариантыСобственности.СпотДоплатный Тогда
			РелизОбъект.ДоплатныеКТК = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Для Счетчик = 1 По КоличествоКТК Цикл
		
		НоваяСтрока = РелизОбъект.Номинации.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.ГУИДСтроки = Новый УникальныйИдентификатор;
		НоваяСтрока.НДСВключая = Строка.СуммаВключаетНДС;
		НоваяСтрока.ДатаАктуальностиЗаписи = ТекущаяДатаСеанса();
		НоваяСтрока.ИдентификаторСтрокиПСЦПоставщика = Строка.ИдентификаторСтрокиУслуг;
		
		Если ПривязаныеКТККСтрокеПСЦ.Количество() > 0 Тогда
			КонтейнерЕсть = ПроверитьКонтейнерНаНаличиеВРелизе(ПривязаныеКТККСтрокеПСЦ[0].Контейнер, Строка.ИдентификаторСтрокиУслуг, РелизОбъект.Ссылка);
			Если НЕ КонтейнерЕсть Тогда
				НоваяСтрока.Контейнер = ПривязаныеКТККСтрокеПСЦ[0].Контейнер;
				НоваяСтрока.ТипКТК = ПривязаныеКТККСтрокеПСЦ[0].ТипКТК;
				ПривязаныеКТККСтрокеПСЦ.Удалить(0);
			КонецЕсли;
		КонецЕсли;
		
		ОшибкаСтавки = ДобавитьСтавкуСНПКСтроке(РелизОбъект, НоваяСтрока, СтавкиСНП, ВалютаСНП);
		
	КонецЦикла;
	
	РелизОбъект.Записать();
	
	Если Релиз = Неопределено Тогда
		Если ОшибкаСтавки Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Создан релиз %1. Проверьте ставки СНП в релизе.'"), РелизОбъект.Ссылка);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, РелизОбъект.Ссылка);
		Иначе
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Создан релиз %1'"), РелизОбъект.Ссылка);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, РелизОбъект.Ссылка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЛокацииВСтроке(Строка)
	
	Если ЗначениеЗаполнено(Строка.Сток) Тогда
		НаселенныйПункт = Неопределено;
		Страна = Неопределено;
		ЛокацияВышестоящегоУровня = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Сток, "ЛокацияВышестоящегоУровня");
		ТипЛокацииВышестоящегоУровня = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЛокацияВышестоящегоУровня, "Тип");
		Пока ЗначениеЗаполнено(ЛокацияВышестоящегоУровня) Цикл
			Если ТипЛокацииВышестоящегоУровня = Справочники.ТипыЛокаций.НаселенныйПункт И НаселенныйПункт = Неопределено Тогда
				НаселенныйПункт = ЛокацияВышестоящегоУровня;
			ИначеЕсли ТипЛокацииВышестоящегоУровня = Справочники.ТипыЛокаций.Страна И Страна = Неопределено Тогда
				Страна = ЛокацияВышестоящегоУровня;
			КонецЕсли;
			ЛокацияВышестоящегоУровня = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЛокацияВышестоящегоУровня, "ЛокацияВышестоящегоУровня");
			ТипЛокацииВышестоящегоУровня = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЛокацияВышестоящегоУровня, "Тип");
		КонецЦикла;
		Строка.ЛокацияГород = НаселенныйПункт;
		Строка.ЛокацияСтрана = Страна;
	ИначеЕсли ЗначениеЗаполнено(Строка.ЛокацияГород) И Не ЗначениеЗаполнено(Строка.ЛокацияСтрана) Тогда
		Страна = Неопределено;
		ЛокацияВышестоящегоУровня = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.ЛокацияГород, "ЛокацияВышестоящегоУровня");
		ТипЛокацииВышестоящегоУровня = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЛокацияВышестоящегоУровня, "Тип");
		Пока ЗначениеЗаполнено(ЛокацияВышестоящегоУровня) Цикл
			Если ТипЛокацииВышестоящегоУровня = Справочники.ТипыЛокаций.Страна И Страна = Неопределено Тогда
				Страна = ЛокацияВышестоящегоУровня;
			КонецЕсли;
			ЛокацияВышестоящегоУровня = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЛокацияВышестоящегоУровня, "ЛокацияВышестоящегоУровня");
			ТипЛокацииВышестоящегоУровня = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЛокацияВышестоящегоУровня, "Тип");
		КонецЦикла;
		Строка.ЛокацияСтрана = Страна;
	КонецЕсли;
	
КонецПроцедуры

Процедура ИзменитьСтроки(Строка, ДокументОснование, СтавкиСНП, ВалютаСНП)
	
	ВывестиСообщениеОбОшибке = Ложь;
	КоличествоКТК = Строка.КоличествоКТК;
	ПривязаныеКТККСтрокеПСЦ = НайтиПривязаныеКТККСтроке(Строка);
	
	Релиз = НайтиРелизПоПараметрам(Строка, ДокументОснование);
	
	Если Релиз <> Неопределено Тогда
		РелизОбъект = Релиз.ПолучитьОбъект();
		Если Строка.тек_СобственностьКТК = Перечисления.ВариантыСобственности.Собственный Тогда
			РелизОбъект.СобственныеКТК = Истина;
			РелизОбъект.Локация = Справочники.Локации.ПустаяСсылка();
			РелизОбъект.ВозможныеСтокиСдачи = Неопределено;
			РелизОбъект.ЛокацияСдачи = Неопределено;
			РелизОбъект.Сток = Справочники.Локации.ПустаяСсылка();
		Иначе
			РелизОбъект.СобственныеКТК = Ложь;
			Если ЗначениеЗаполнено(Строка.ЛокацияГород) Тогда
				РелизОбъект.Локация = Строка.ЛокацияГород;
			Иначе
				РелизОбъект.Локация = Строка.ЛокацияСтрана;
			КонецЕсли;
			РелизОбъект.ВозможныеСтокиСдачи = Строка.ВозможныеСтокиСдачи;
			РелизОбъект.ЛокацияСдачи = Строка.ЛокацияСдачи;
			РелизОбъект.Сток = Строка.Сток;
		КонецЕсли;
		Отбор = Новый Структура;
		Отбор.Вставить("ИдентификаторСтрокиПСЦПоставщика", Строка.ИдентификаторСтрокиУслуг);
		Отбор.Вставить("ТипКТК", Строка.ТипКТК);
		НайденныеСтроки = РелизОбъект.Номинации.НайтиСтроки(Отбор);
		Для Каждого СтрокаНоминаций Из НайденныеСтроки Цикл
			ЗаполнитьЗначенияСвойств(СтрокаНоминаций, Строка);
			Если ПривязаныеКТККСтрокеПСЦ.Количество() > 0 Тогда
				КонтейнерЕсть = ПроверитьКонтейнерНаНаличиеВРелизе(ПривязаныеКТККСтрокеПСЦ[0].Контейнер, Строка.ИдентификаторСтрокиУслуг, РелизОбъект.Ссылка);
				Если КонтейнерЕсть Тогда
					СтрокаНоминаций.Контейнер = ПривязаныеКТККСтрокеПСЦ[0].Контейнер;
					СтрокаНоминаций.ТипКТК = ПривязаныеКТККСтрокеПСЦ[0].ТипКТК;
					ПривязаныеКТККСтрокеПСЦ.Удалить(0);
				КонецЕсли;
			КонецЕсли;
			ОшибкаСтавки = ДобавитьСтавкуСНПКСтроке(РелизОбъект, СтрокаНоминаций, СтавкиСНП, ВалютаСНП);
		КонецЦикла;
		
		Если КоличествоКТК <> НайденныеСтроки.Количество() Тогда
			Разница = КоличествоКТК - НайденныеСтроки.Количество();
			Если Разница > 0 Тогда
				Для Счетчик = 1 По Разница Цикл
					НоваяСтрока = РелизОбъект.Номинации.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
					НоваяСтрока.ГУИДСтроки = Новый УникальныйИдентификатор;
					НоваяСтрока.ДатаАктуальностиЗаписи = ТекущаяДатаСеанса();
					НоваяСтрока.ИдентификаторСтрокиПСЦПоставщика = Строка.ИдентификаторСтрокиУслуг;
					
					Если ПривязаныеКТККСтрокеПСЦ.Количество() > 0 Тогда
						КонтейнерЕсть = ПроверитьКонтейнерНаНаличиеВРелизе(ПривязаныеКТККСтрокеПСЦ[0].Контейнер, Строка.ИдентификаторСтрокиУслуг, РелизОбъект.Ссылка);
						Если НЕ КонтейнерЕсть Тогда
							НоваяСтрока.Контейнер = ПривязаныеКТККСтрокеПСЦ[0].Контейнер;
							НоваяСтрока.ТипКТК = ПривязаныеКТККСтрокеПСЦ[0].ТипКТК;
							ПривязаныеКТККСтрокеПСЦ.Удалить(0);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			ИначеЕсли Разница < 0 Тогда
				РазницаУдаления = -Разница;
				СтрокиДляУдаления = Новый Массив;
				
				Для Счетчик = 0 По РазницаУдаления - 1 Цикл
					Индекс = НайденныеСтроки.Количество() - 1 - Счетчик;
					Если Индекс >= 0 Тогда
						СтрокиДляУдаления.Добавить(НайденныеСтроки[Индекс]);
					КонецЕсли;
				КонецЦикла;
				
				Для Каждого СтрокаИзМассива Из СтрокиДляУдаления Цикл
					Если ЗначениеЗаполнено(СтрокаИзМассива.Контейнер) Тогда
						ПривязаныеКТККСтрокеПСЦ.Добавить(СтрокаИзМассива.Контейнер);
					КонецЕсли;
					РелизОбъект.Номинации.Удалить(СтрокаИзМассива);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		РелизОбъект.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьСтрокиПСЦНаОшибки(ВыгрузкаДетализацияКТКПСЦ, ВыгрузкаСтрокиПСЦТекущие, Отказ)
	
	СтрокиСОшибками = Новый Массив;
	Для Каждого СтрокаДетализацииКТК Из ВыгрузкаДетализацияКТКПСЦ Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("ИдентификаторСтрокиУслуг", СтрокаДетализацииКТК.ИдентификаторСтрокиУслуг);
		Отбор.Вставить("ТипКТК", СтрокаДетализацииКТК.ТипКТК);
		НайденныеСтроки = ВыгрузкаСтрокиПСЦТекущие.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокиСОшибками.Добавить(СтрокаДетализацииКТК.НомерСтроки);
		КонецЕсли;
	КонецЦикла;
	
	СтрокиСОшибками = ОбщегоНазначенияКлиентСервер.СвернутьМассив(СтрокиСОшибками);
	СортироватьМассив(СтрокиСОшибками);
	
	Если СтрокиСОшибками.Количество() > 0 Тогда
		НомераСтрок = "";
		Для Каждого Номер Из СтрокиСОшибками Цикл
			НомераСтрок = НомераСтрок + "№" + Номер + ", ";
		КонецЦикла;
		НомераСтрок = Лев(НомераСтрок, СтрДлина(НомераСтрок) - 2);
		Текст = СтрШаблон(НСтр("ru = 'Невозможно создать релиз собственника, т.к. отличаются типоразмеры КТК по строке %1 с данными КТК в детализации'"), 
			НомераСтрок);
		ОбщегоНазначения.СообщитьПользователю(Текст,,,, Отказ);
	КонецЕсли;
	
	СтрокиСОшибкамиВКоличестве = Новый Массив;
	Для Каждого СтрокаПСЦ Из ВыгрузкаСтрокиПСЦТекущие Цикл
		Если СтрокаПСЦ.КоличествоКТК % 1 <> 0 Тогда
			СтрокиСОшибкамиВКоличестве.Добавить(СтрокаПСЦ.НомерСтроки);
		КонецЕсли;
	КонецЦикла;
	
	СтрокиСОшибкамиВКоличестве = ОбщегоНазначенияКлиентСервер.СвернутьМассив(СтрокиСОшибкамиВКоличестве);
	СортироватьМассив(СтрокиСОшибкамиВКоличестве);
	
	Если СтрокиСОшибкамиВКоличестве.Количество() > 0 Тогда
		НомераСтрок = "";
		Для Каждого Номер Из СтрокиСОшибкамиВКоличестве Цикл
			НомераСтрок = НомераСтрок + "№" + Номер + ", ";
		КонецЦикла;
		НомераСтрок = Лев(НомераСтрок, СтрДлина(НомераСтрок) - 2);
		Текст = СтрШаблон(НСтр("ru = 'Невозможно создать релиз собственника, указаны разные типоразмеры по строке %1'"), 
			НомераСтрок);
		ОбщегоНазначения.СообщитьПользователю(Текст,,,, Отказ);
	КонецЕсли;
	
	СтрокиСОшибкамиВДетализации = Новый Массив;
	Для Каждого СтрокаПСЦ Из ВыгрузкаСтрокиПСЦТекущие Цикл
		Если СтрокаПСЦ.КоличествоКТК < СтрокаПСЦ.КоличествоКТКВДетализации Тогда
			СтрокиСОшибкамиВДетализации.Добавить(СтрокаПСЦ.НомерСтроки);
		КонецЕсли;
	КонецЦикла;
	
	СтрокиСОшибкамиВДетализации = ОбщегоНазначенияКлиентСервер.СвернутьМассив(СтрокиСОшибкамиВДетализации);
	СортироватьМассив(СтрокиСОшибкамиВДетализации);
	
	Если СтрокиСОшибкамиВДетализации.Количество() > 0 Тогда
		НомераСтрок = "";
		Для Каждого Номер Из СтрокиСОшибкамиВДетализации Цикл
			НомераСтрок = НомераСтрок + "№" + Номер + ", ";
		КонецЦикла;
		НомераСтрок = Лев(НомераСтрок, СтрДлина(НомераСтрок) - 2);
		Текст = СтрШаблон(НСтр("ru = 'Невозможно создать релиз собственника, количество учетных единиц в детализации по строке %1 больше чем указано в строке'"), 
			НомераСтрок);
		ОбщегоНазначения.СообщитьПользователю(Текст,,,, Отказ);
	КонецЕсли;
	
	СтрокиСОшибкамиКоличествоКТК0 = Новый Массив;
	Для Каждого СтрокаПСЦ Из ВыгрузкаСтрокиПСЦТекущие Цикл
		Если СтрокаПСЦ.КоличествоКТК = 0 Тогда
			СтрокиСОшибкамиКоличествоКТК0.Добавить(СтрокаПСЦ.НомерСтроки);
		КонецЕсли;
	КонецЦикла;
	
	СтрокиСОшибкамиКоличествоКТК0 = ОбщегоНазначенияКлиентСервер.СвернутьМассив(СтрокиСОшибкамиКоличествоКТК0);
	СортироватьМассив(СтрокиСОшибкамиКоличествоКТК0);
	
	Если СтрокиСОшибкамиКоличествоКТК0.Количество() > 0 Тогда
		НомераСтрок = "";
		Для Каждого Номер Из СтрокиСОшибкамиКоличествоКТК0 Цикл
			НомераСтрок = НомераСтрок + "№" + Номер + ", ";
		КонецЦикла;
		НомераСтрок = Лев(НомераСтрок, СтрДлина(НомераСтрок) - 2);
		Текст = СтрШаблон(НСтр("ru = 'Невозможно создать релиз собственника, т.к. количество КТК по строке %1 = 0'"), 
			НомераСтрок);
		ОбщегоНазначения.СообщитьПользователю(Текст,,,, Отказ);
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

Процедура СортироватьМассив(Массив) Экспорт
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.ЗагрузитьЗначения(Массив);
	СписокЗначений.СортироватьПоЗначению();
	Массив = СписокЗначений.ВыгрузитьЗначения();
	
КонецПроцедуры

Функция НайтиПривязаныеКТККСтроке(Строка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПСЦПоставщикаУчетныеЕдиницы.УчетнаяЕдиница КАК Контейнер,
	               |	ПСЦПоставщикаУчетныеЕдиницы.УчетнаяЕдиница.ТипТЕ КАК ТипКТК
	               |ИЗ
	               |	Документ.ПСЦПоставщика.УчетныеЕдиницы КАК ПСЦПоставщикаУчетныеЕдиницы
	               |ГДЕ
	               |	ПСЦПоставщикаУчетныеЕдиницы.ИдентификаторСтрокиУслуг = &ИдентификаторСтрокиУслуг
	               |	И ПСЦПоставщикаУчетныеЕдиницы.УчетнаяЕдиница.ТипТЕ = &ТипТЕ";
	
	Запрос.УстановитьПараметр("ИдентификаторСтрокиУслуг", Строка.ИдентификаторСтрокиУслуг);
	Запрос.УстановитьПараметр("ТипТЕ", Строка.ТипКТК);

	Выгузка = Запрос.Выполнить().Выгрузить();
	
	Возврат Выгузка;
	
КонецФункции

Функция НайтиРелизПоПараметрам(Строка, ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РелизСобственника.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РелизСобственника КАК РелизСобственника
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
	|		ПО РелизСобственника.Ссылка = РелизСобственникаНоминации.Ссылка
	|ГДЕ
	|	РелизСобственника.ПСЦ = &Документ
	|	И РелизСобственника.Локация = &Локация
	|	И РелизСобственника.ЛокацияСдачи = &ЛокацияСдачи
	|	И РелизСобственника.Контрагент = &Контрагент
	|	И РелизСобственника.Договор = &Договор
	|	И РелизСобственника.Организация = &Организация
	|	И РелизСобственника.ЦФО = &ЦФО
	|	И НЕ РелизСобственника.ПометкаУдаления
	|	И РелизСобственника.ВозможныеСтокиСдачи = &ВозможныеСтокиСдачи
	|	И РелизСобственника.Сток = &Сток
	|	И РелизСобственникаНоминации.ТипКТК = &ТипКТК
	|	И РелизСобственникаНоминации.тек_СобственностьКТК = &тек_СобственностьКТК";
	
	Запрос.УстановитьПараметр("Документ", ДокументСсылка);
	Запрос.УстановитьПараметр("Контрагент", Строка.Контрагент);
	Запрос.УстановитьПараметр("Договор", Строка.Договор);
	Запрос.УстановитьПараметр("Организация", Строка.Организация);
	Запрос.УстановитьПараметр("ЦФО", Строка.ЦФО);
	Запрос.УстановитьПараметр("ТипКТК", Строка.ТипКТК);
	Если ЗначениеЗаполнено(Строка.ЛокацияГород) Тогда
		Запрос.УстановитьПараметр("Локация", Строка.ЛокацияГород);
	ИначеЕсли Строка.ЛокацияСтрана <> Неопределено Тогда
		Запрос.УстановитьПараметр("Локация", Строка.ЛокацияСтрана);
	КонецЕсли;
	Запрос.УстановитьПараметр("ЛокацияСдачи", Строка.ЛокацияСдачи);
	Запрос.УстановитьПараметр("ВозможныеСтокиСдачи", Строка.ВозможныеСтокиСдачи);
	Запрос.УстановитьПараметр("Сток", Строка.Сток);
	Запрос.УстановитьПараметр("тек_СобственностьКТК", Строка.тек_СобственностьКТК);
		
	Выборка = Запрос.Выполнить().Выбрать();

	Ответ = Неопределено;
	
	Пока Выборка.Следующий() Цикл
		Ответ = Выборка.Ссылка;
	КонецЦикла;
	
	Возврат Ответ;
	
КонецФункции

Процедура ИзменитьОбщиеРеквизитыРелиза(ДанныеПСЦ, ДокументСсылка, ЗаписываемыеОбъекты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РелизСобственника.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РелизСобственника КАК РелизСобственника
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
	|		ПО РелизСобственника.Ссылка = РелизСобственникаНоминации.Ссылка
	|ГДЕ
	|	РелизСобственника.ПСЦ = &Документ
	|	И НЕ РелизСобственника.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Документ", ДокументСсылка);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		РелизОбъект = Выборка.Ссылка.ПолучитьОбъект();
		РелизОбъект.Организация = ДанныеПСЦ[0].Организация;
		РелизОбъект.ЦФО = ДанныеПСЦ[0].ЦФО;
		РелизОбъект.Подразделение = ДанныеПСЦ[0].Подразделение;
		РелизОбъект.Контрагент = ДанныеПСЦ[0].Контрагент;
		РелизОбъект.Договор = ДанныеПСЦ[0].Договор;
		РелизОбъект.НачалоДействия = ДанныеПСЦ[0].НачалоДействия;
		РелизОбъект.ОкончаниеДействия = ДанныеПСЦ[0].ОкончаниеДействия;
		Для Каждого СтрокаНоминации Из РелизОбъект.Номинации Цикл
			СтрокаНоминации.НДСВключая = ДанныеПСЦ[0].СуммаВключаетНДС;
		КонецЦикла;
		ЗаписываемыеОбъекты.Вставить(РелизОбъект.Ссылка, РелизОбъект);
	КонецЦикла;
	
КонецПроцедуры

Процедура ИзменитьЛокацииРелиза(ДанныеПСЦ, ДокументСсылка, ЗаписываемыеОбъекты, УдаляемыеСтроки, СоздаваемыеСтроки)
	
	ИдентификаторыУдаляемых = Новый Массив;
	ИдентификаторыДобавляемых = Новый Массив;
	
	Для Каждого СтрокаУдаляемая Из УдаляемыеСтроки Цикл
		ИдентификаторыУдаляемых.Добавить(СтрокаУдаляемая.ИдентификаторСтрокиУслуг);
	КонецЦикла;
	
	Для Каждого СтрокаДобавляемая Из СоздаваемыеСтроки Цикл
		ИдентификаторыДобавляемых.Добавить(СтрокаДобавляемая.ИдентификаторСтрокиУслуг);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РелизСобственника.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РелизСобственника КАК РелизСобственника
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
	|		ПО РелизСобственника.Ссылка = РелизСобственникаНоминации.Ссылка
	|ГДЕ
	|	РелизСобственника.ПСЦ = &Документ
	|	И НЕ РелизСобственника.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Документ", ДокументСсылка);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		РелизОбъект = Выборка.Ссылка.ПолучитьОбъект();
		РелизОбъект.Организация = ДанныеПСЦ[0].Организация;
		РелизОбъект.ЦФО = ДанныеПСЦ[0].ЦФО;
		РелизОбъект.Подразделение = ДанныеПСЦ[0].Подразделение;
		РелизОбъект.Контрагент = ДанныеПСЦ[0].Контрагент;
		РелизОбъект.Договор = ДанныеПСЦ[0].Договор;
		РелизОбъект.НачалоДействия = ДанныеПСЦ[0].НачалоДействия;
		РелизОбъект.ОкончаниеДействия = ДанныеПСЦ[0].ОкончаниеДействия;
		Для Каждого СтрокаНоминации Из РелизОбъект.Номинации Цикл
			СтрокаНоминации.НДСВключая = ДанныеПСЦ[0].СуммаВключаетНДС;
		КонецЦикла;
		ЗаписываемыеОбъекты.Вставить(РелизОбъект.Ссылка, РелизОбъект);
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьКонтейнеры(Контейнеры, ДокументСсылка, ЗаписываемыеОбъекты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РелизСобственника.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РелизСобственника КАК РелизСобственника
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
	|		ПО РелизСобственника.Ссылка = РелизСобственникаНоминации.Ссылка
	|ГДЕ
	|	РелизСобственника.ПСЦ = &Документ
	|	И НЕ РелизСобственника.ПометкаУдаления
	|	И РелизСобственникаНоминации.Контейнер В (&Контейнеры)";
	
	Запрос.УстановитьПараметр("Документ", ДокументСсылка);
	Запрос.УстановитьПараметр("Контейнеры", Контейнеры);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		РелизОбъект = ЗаписываемыеОбъекты.Получить(Выборка.Ссылка);
		Если РелизОбъект = Неопределено Тогда
			РелизОбъект = Выборка.Ссылка.ПолучитьОбъект();
		КонецЕсли;
		Для Каждого СтрокаНоминации Из РелизОбъект.Номинации Цикл
			Если Контейнеры.Найти(СтрокаНоминации.Контейнер) <> Неопределено Тогда
				СтрокаНоминации.Контейнер = Неопределено;
			КонецЕсли;
		КонецЦикла;
		ЗаписываемыеОбъекты.Вставить(РелизОбъект.Ссылка, РелизОбъект);
	КонецЦикла;

КонецПроцедуры

Процедура ДобавитьКонтейнеры(Данные, ДокументСсылка, ЗаписываемыеОбъекты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РелизСобственника.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РелизСобственника КАК РелизСобственника
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
	|		ПО РелизСобственника.Ссылка = РелизСобственникаНоминации.Ссылка
	|ГДЕ
	|	РелизСобственника.ПСЦ = &Документ
	|	И НЕ РелизСобственника.ПометкаУдаления
	|	И РелизСобственникаНоминации.ИдентификаторСтрокиПСЦПоставщика В(&ИдентификаторыСтрокУслуг)";
	
	Запрос.УстановитьПараметр("Документ", ДокументСсылка);
	Запрос.УстановитьПараметр("ИдентификаторыСтрокУслуг", Данные.ИдентификаторыСтрокУслуг);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		РелизОбъект = ЗаписываемыеОбъекты.Получить(Выборка.Ссылка);
		Если РелизОбъект = Неопределено Тогда
			РелизОбъект = Выборка.Ссылка.ПолучитьОбъект();
		КонецЕсли;
		Для Каждого СтрокаНоминации Из РелизОбъект.Номинации Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаНоминации.Контейнер) Тогда
				Для Каждого СтруктураКТК Из Данные.МассивКонтейнеров Цикл
					Если СтруктураКТК.ТипКТК = СтрокаНоминации.ТипКТК 
						И СтруктураКТК.ИдентификаторСтрокиУслуг = СтрокаНоминации.ИдентификаторСтрокиПСЦПоставщика Тогда
						СтрокаНоминации.Контейнер = СтруктураКТК.Контейнер;
						ИндексЗначенияМассива = Данные.МассивКонтейнеров.Найти(СтруктураКТК);
						Данные.МассивКонтейнеров.Удалить(ИндексЗначенияМассива);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		ЗаписываемыеОбъекты.Вставить(РелизОбъект.Ссылка, РелизОбъект);
	КонецЦикла;

КонецПроцедуры

Процедура ИзменитьЛокации(ДанныеПСЦ, ДокументСсылка, ЗаписываемыеОбъекты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РелизСобственника.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РелизСобственника КАК РелизСобственника
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
	|		ПО РелизСобственника.Ссылка = РелизСобственникаНоминации.Ссылка
	|ГДЕ
	|	РелизСобственника.ПСЦ = &Документ
	|	И НЕ РелизСобственника.ПометкаУдаления
	|	И РелизСобственникаНоминации.ИдентификаторСтрокиПСЦПоставщика = &Идентификатор";
	
	Запрос.УстановитьПараметр("Документ", ДокументСсылка);
	Запрос.УстановитьПараметр("Идентификатор", ДанныеПСЦ.ИдентификаторСтрокиУслуг);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		РелизОбъект = ЗаписываемыеОбъекты.Получить(Выборка.Ссылка);
		Если РелизОбъект = Неопределено Тогда
			РелизОбъект = Выборка.Ссылка.ПолучитьОбъект();
		КонецЕсли;
		РелизОбъект.Локация = ДанныеПСЦ.Локация;
		РелизОбъект.ЛокацияСдачи = ДанныеПСЦ.ЛокацияСдачи;
		РелизОбъект.ВозможныеСтокиСдачи = ДанныеПСЦ.ВозможныеСтокиСдачи;
		РелизОбъект.Сток = ДанныеПСЦ.Сток;
		ЗаписываемыеОбъекты.Вставить(РелизОбъект.Ссылка, РелизОбъект);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьУдалитьСтроки(СтрокаПСЦ, ДокументСсылка, КоличествоСтрокВРелизе, ЗаписываемыеОбъекты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РелизСобственника.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РелизСобственника КАК РелизСобственника
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
	|		ПО РелизСобственника.Ссылка = РелизСобственникаНоминации.Ссылка
	|ГДЕ
	|	РелизСобственника.ПСЦ = &Документ
	|	И НЕ РелизСобственника.ПометкаУдаления
	|	И РелизСобственникаНоминации.ИдентификаторСтрокиПСЦПоставщика = &Идентификатор";
	
	Запрос.УстановитьПараметр("Документ", ДокументСсылка);
	Запрос.УстановитьПараметр("Идентификатор", СтрокаПСЦ.ИдентификаторСтрокиУслуг);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		РелизОбъект = ЗаписываемыеОбъекты.Получить(Выборка.Ссылка);
		Если РелизОбъект = Неопределено Тогда
			РелизОбъект = Выборка.Ссылка.ПолучитьОбъект();
		КонецЕсли;
		Разница = СтрокаПСЦ.КоличествоКТК - КоличествоСтрокВРелизе;
		Если Разница > 0 Тогда
			// Добавляем недостающие строки
			Для Счетчик = 1 По Разница Цикл
				НоваяСтрока = РелизОбъект.Номинации.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПСЦ);
				НоваяСтрока.НДСВключая = СтрокаПСЦ.СуммаВключаетНДС;
				НоваяСтрока.ГУИДСтроки = Новый УникальныйИдентификатор;
				НоваяСтрока.ДатаАктуальностиЗаписи = ТекущаяДатаСеанса();
				НоваяСтрока.ИдентификаторСтрокиПСЦПоставщика = СтрокаПСЦ.ИдентификаторСтрокиУслуг;
			КонецЦикла;
		ИначеЕсли Разница < 0 Тогда
			// Удаляем лишние строки (начиная с последних)
			РазницаУдаления = -Разница;
			СтрокиДляУдаления = Новый Массив;
			
			Отбор = Новый Структура;
			Отбор.Вставить("ИдентификаторСтрокиПСЦПоставщика", СтрокаПСЦ.ИдентификаторСтрокиУслуг);
			Отбор.Вставить("ТипКТК", СтрокаПСЦ.ТипКТК);
			Отбор.Вставить("Контейнер", Справочники.ТЕ.ПустаяСсылка());
			НайденныеСтроки = РелизОбъект.Номинации.НайтиСтроки(Отбор);
			
			Для Счетчик = 0 По РазницаУдаления - 1 Цикл
				Индекс = НайденныеСтроки.Количество() - 1 - Счетчик;
				Если Индекс >= 0 Тогда
					СтрокиДляУдаления.Добавить(НайденныеСтроки[Индекс]);
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого СтрокаИзМассива Из СтрокиДляУдаления Цикл
				РелизОбъект.Номинации.Удалить(СтрокаИзМассива);
			КонецЦикла;
		КонецЕсли;
		ЗаписываемыеОбъекты.Вставить(РелизОбъект.Ссылка, РелизОбъект);
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьСтроки(Строка, ДокументОснование, ЗаписываемыеОбъекты)
	
	Релиз = НайтиРелизПоПараметрам(Строка, ДокументОснование);
	
	Если Релиз = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РелизОбъект = ЗаписываемыеОбъекты.Получить(Релиз);
	
	Если РелизОбъект = Неопределено Тогда
		РелизОбъект = Релиз.ПолучитьОбъект();
	КонецЕсли;
	
	МассивДляУдаленияНоминаций = Новый Массив;
	МассивДляУдаленияСНП = Новый Массив;
	
	Для Каждого СтрокаНоминаций Из РелизОбъект.Номинации Цикл
		Если СтрокаНоминаций.ИдентификаторСтрокиПСЦПоставщика = Строка.ИдентификаторСтрокиУслуг
			И СтрокаНоминаций.ТипКТК = Строка.ТипКТК Тогда
			МассивДляУдаленияНоминаций.Добавить(СтрокаНоминаций);
			СтрокиСНП = РелизОбъект.СНП.НайтиСтроки(Новый Структура("ГУИДСтроки", СтрокаНоминаций.ГУИДСтроки));
			Для Каждого СтрокаСНП Из СтрокиСНП Цикл
				МассивДляУдаленияСНП.Добавить(СтрокаСНП);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаСНП Из МассивДляУдаленияСНП Цикл
		РелизОбъект.СНП.Удалить(СтрокаСНП);
	КонецЦикла;
	
	Для Каждого СтрокаНоминаций Из МассивДляУдаленияНоминаций Цикл
		РелизОбъект.Номинации.Удалить(СтрокаНоминаций);
	КонецЦикла;
	
	Если РелизОбъект.Номинации.Количество() = 0 Тогда
		РелизОбъект.ПометкаУдаления = Истина;
		Если РелизОбъект.Проведен Тогда
			РелизОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Иначе;
			РелизОбъект.Записать();
		КонецЕсли;
		РеквизитыРелиза = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РелизОбъект.Ссылка, "ПСЦ, Ссылка");
		СвязанныеДокументыСервер.УдалитьСвязи(РеквизитыРелиза.ПСЦ, РеквизитыРелиза.Ссылка);
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Релиз %1 был помечен на удаление.'"), РелизОбъект.Ссылка);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, РелизОбъект.Ссылка);
	Иначе
		РелизОбъект.Записать();
	КонецЕсли;
	
	ЗаписываемыеОбъекты.Вставить(РелизОбъект.Ссылка, РелизОбъект);
	
КонецПроцедуры

Функция ЕстьСозданныеРелизы(ПротоколСсылка)
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РелизСобственника.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РелизСобственника КАК РелизСобственника
		|ГДЕ
		|	РелизСобственника.ПСЦ = &ПСЦ
		|	И НЕ РелизСобственника.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ПСЦ", ПротоколСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтавкиСНП(ПротоколСсылка)
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПСЦПоставщикаУслуги.ПунктНазначенияГород) = ТИП(Справочник.Мультилокации)
	|			ТОГДА Мультилокации.Локация
	|		ИНАЧЕ ПСЦПоставщикаУслуги.ПунктНазначенияГород
	|	КОНЕЦ ВозможныеСтокиСдачи
	|ПОМЕСТИТЬ ВТ_ВозможныеСтокиСдачи
	|ИЗ
	|	Документ.ПСЦПоставщика.Услуги КАК ПСЦПоставщикаУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК Мультилокации
	|		ПО ПСЦПоставщикаУслуги.ПунктНазначенияГород = Мультилокации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПСЦПоставщика.КритерииУслуг КАК ПСЦПоставщикаКритерииУслуг
	|		ПО ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг = ПСЦПоставщикаКритерииУслуг.ИдентификаторСтрокиУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПСЦПоставщика.ШкалаСтавок КАК ПСЦПоставщикаШкалаСтавок
	|		ПО ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг = ПСЦПоставщикаШкалаСтавок.ИдентификаторСтрокиУслуг
	|ГДЕ
	|	ПСЦПоставщикаУслуги.Ссылка = &Документ
	|	И ПСЦПоставщикаУслуги.Номенклатура В(&Номенклатура)
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПСЦПоставщикаКритерииУслуг.ТипоразмерКТК КАК ТипоразмерКТК,
	|	ЕСТЬNULL(ПСЦПоставщикаШкалаСтавок.От, 0) КАК От,
	|	ЕСТЬNULL(ПСЦПоставщикаШкалаСтавок.До, 0) КАК До,
	|	ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ПСЦПоставщикаУслуги.СтавкаПрогрессивная КАК СтавкаПрогрессивная,
	|	ЕСТЬNULL(ПСЦПоставщикаШкалаСтавок.СтоимостьБезНДС, 0) КАК СтоимостьБезНДСИзШкалы,
	|	ЕСТЬNULL(ПСЦПоставщикаУслуги.СтоимостьБезНДС, 0) КАК СтоимостьБезНДСИзУслуг,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПСЦПоставщикаУслуги.ПунктОтправленияСтрана) = ТИП(Справочник.Мультилокации)
	|			ТОГДА Мультилокации.Локация
	|		ИНАЧЕ ПСЦПоставщикаУслуги.ПунктОтправленияСтрана
	|	КОНЕЦ КАК ЛокацияСтрана,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПСЦПоставщикаУслуги.ПунктОтправленияГород) = ТИП(Справочник.Мультилокации)
	|			ТОГДА Мультилокации.Локация
	|		ИНАЧЕ ПСЦПоставщикаУслуги.ПунктОтправленияГород
	|	КОНЕЦ КАК ЛокацияГород,
	|	ПСЦПоставщикаУслуги.ПунктНазначенияСтрана КАК ЛокацияСдачи,
	|	ПСЦПоставщикаУслуги.ПунктНазначенияГород КАК ВозможныеСтокиСдачиМультилокация,
	|	ВТ_ВозможныеСтокиСдачи.ВозможныеСтокиСдачи КАК ВозможныеСтокиСдачи,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПСЦПоставщикаУслуги.ПунктОтправления) = ТИП(Справочник.Мультилокации)
	|			ТОГДА Мультилокации.Локация
	|		ИНАЧЕ ПСЦПоставщикаУслуги.ПунктОтправления
	|	КОНЕЦ КАК Сток
	|ИЗ
	|	Документ.ПСЦПоставщика.Услуги КАК ПСЦПоставщикаУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК Мультилокации
	|		ПО (ПСЦПоставщикаУслуги.ПунктОтправления = Мультилокации.Ссылка
	|				ИЛИ ПСЦПоставщикаУслуги.ПунктОтправленияГород = Мультилокации.Ссылка
	|				ИЛИ ПСЦПоставщикаУслуги.ПунктОтправленияСтрана = Мультилокации.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПСЦПоставщика.КритерииУслуг КАК ПСЦПоставщикаКритерииУслуг
	|		ПО ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг = ПСЦПоставщикаКритерииУслуг.ИдентификаторСтрокиУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПСЦПоставщика.ШкалаСтавок КАК ПСЦПоставщикаШкалаСтавок
	|		ПО ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг = ПСЦПоставщикаШкалаСтавок.ИдентификаторСтрокиУслуг 
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВозможныеСтокиСдачи КАК ВТ_ВозможныеСтокиСдачи
	|		ПО ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг = ВТ_ВозможныеСтокиСдачи.ИдентификаторСтрокиУслуг
	|
	|ГДЕ
	|	ПСЦПоставщикаУслуги.Ссылка = &Документ
	|	И ПСЦПоставщикаУслуги.Номенклатура В(&Номенклатура)
	|
	|УПОРЯДОЧИТЬ ПО
	|	От";
	
	МассивНоменклатур = Новый Массив;
	МассивНоменклатур.Добавить(Константы.УслугаСНППоКТК.Получить());
	
	Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатур);
	Запрос.УстановитьПараметр("Документ", ПротоколСсылка);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Возврат Выгрузка;
	
КонецФункции

Функция ДобавитьСтавкуСНПКСтроке(ДокументОбъект, Строка, Ставки, ВалютаСНП)
	
	ОтборСтавки = Новый Структура;
	ОтборСтавки.Вставить("ТипоразмерКТК", Строка.ТипКТК);
	ОтборСтавки.Вставить("ЛокацияСдачи", ДокументОбъект.ЛокацияСдачи);
	ОтборСтавки.Вставить("Сток", ДокументОбъект.Сток);
	ТипЛокацииВыдачи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОбъект.Локация, "Тип");
	Если ТипЛокацииВыдачи = Справочники.ТипыЛокаций.НаселенныйПункт Тогда
		ОтборСтавки.Вставить("ЛокацияГород", ДокументОбъект.Локация);
	ИначеЕсли ТипЛокацииВыдачи = Справочники.ТипыЛокаций.Страна Тогда
		ОтборСтавки.Вставить("ЛокацияСтрана", ДокументОбъект.Локация);
	КонецЕсли;
	Если ТипЗнч(ДокументОбъект.ВозможныеСтокиСдачи) = Тип("СправочникСсылка.Мультилокации") Тогда
		ОтборСтавки.Вставить("ВозможныеСтокиСдачиМультилокация", ДокументОбъект.ВозможныеСтокиСдачи);
	Иначе
		ОтборСтавки.Вставить("ВозможныеСтокиСдачи", ДокументОбъект.ВозможныеСтокиСдачи);
	КонецЕсли;
	
	НайденныеСтроки = Ставки.НайтиСтроки(ОтборСтавки);
	
	ОшибкаСтавки = Истина;
	
	ЭталонныйИдентификатор = Неопределено;
	Если НайденныеСтроки.Количество() <> 0 Тогда
		ЭталонныйИдентификатор = НайденныеСтроки[0].ИдентификаторСтрокиУслуг;
	КонецЕсли;
	
	Для Каждого СтрокаСтавки Из НайденныеСтроки Цикл
		Если СтрокаСтавки.ИдентификаторСтрокиУслуг <> ЭталонныйИдентификатор Тогда
			Возврат ОшибкаСтавки;
		КонецЕсли;
	КонецЦикла;
	
	// Удаляем старые строки по гуиду
	СтарыеСтрокиСНП = ДокументОбъект.СНП.НайтиСтроки(Новый Структура("ГУИДСтроки", Строка.ГУИДСтроки));
	Для Каждого СтрокаСНП Из СтарыеСтрокиСНП Цикл
		ДокументОбъект.СНП.Удалить(СтрокаСНП);
	КонецЦикла;
	
	Для Каждого СтрокаСтавки Из НайденныеСтроки Цикл
		Если СтрокаСтавки.СтавкаПрогрессивная Тогда
			НоваяСтрокаСНП = ДокументОбъект.СНП.Добавить();
			НоваяСтрокаСНП.ГУИДСтроки = Строка.ГУИДСтроки;
			НоваяСтрокаСНП.Стоимость = СтрокаСтавки.СтоимостьБезНДСИзШкалы;
			Строка.ВалютаСНП = ВалютаСНП;
			Строка.СтавкаПрогрессивная = Истина;
			НоваяСтрокаСНП.От = СтрокаСтавки.От;
			НоваяСтрокаСНП.До = СтрокаСтавки.До;
		Иначе
			УжеСуществуетТакаяСтрока = ДокументОбъект.СНП.НайтиСтроки(Новый Структура("ГУИДСтроки, Стоимость", Строка.ГУИДСтроки, СтрокаСтавки.СтоимостьБезНДСИзУслуг));
			Если УжеСуществуетТакаяСтрока.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрокаСНП = ДокументОбъект.СНП.Добавить();
			НоваяСтрокаСНП.ГУИДСтроки = Строка.ГУИДСтроки;
			НоваяСтрокаСНП.Стоимость = СтрокаСтавки.СтоимостьБезНДСИзУслуг;
			Строка.ВалютаСНП = ВалютаСНП;
		КонецЕсли;
		ОшибкаСтавки = Ложь;
	КонецЦикла;
	
	Возврат ОшибкаСтавки;
	
КонецФункции

Функция ПроверитьКонтейнерНаНаличиеВРелизе(Контейнер, Идентификатор, Релиз)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РелизСобственникаНоминации.Ссылка КАК Ссылка,
	|	РелизСобственникаНоминации.Контейнер КАК Контейнер
	|ИЗ
	|	Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
	|ГДЕ
	|	РелизСобственникаНоминации.ИдентификаторСтрокиПСЦПоставщика = &ИдентификаторСтрокиПСЦПоставщика
	|	И РелизСобственникаНоминации.Контейнер = &Контейнер
	|	И НЕ РелизСобственникаНоминации.Ссылка.ПометкаУдаления
	|	И РелизСобственникаНоминации.Ссылка = &Релиз";
	
	Запрос.УстановитьПараметр("ИдентификаторСтрокиПСЦПоставщика", Идентификатор);
	Запрос.УстановитьПараметр("Контейнер", Контейнер);
	Запрос.УстановитьПараметр("Релиз", Релиз);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Ответ = Ложь;
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Ответ = Истина;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Процедура ИзмененияВКТК(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПСЦПоставщикаУчетныеЕдиницы.УчетнаяЕдиница КАК Контейнер,
	|	ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг
	|ПОМЕСТИТЬ ВТ_ДанныеПСЦ
	|ИЗ   
	|	Документ.ПСЦПоставщика.УчетныеЕдиницы КАК ПСЦПоставщикаУчетныеЕдиницы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПСЦПоставщика.Услуги КАК ПСЦПоставщикаУслуги 
	|		ПО ПСЦПоставщикаУчетныеЕдиницы.ИдентификаторСтрокиУслуг = ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг
	|ГДЕ
	|	ПСЦПоставщикаУчетныеЕдиницы.Ссылка = &Документ
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	1 КАК Индикатор,
	|	ВТ_ДанныеПСЦ.Контейнер КАК Контейнер,
	|	ВТ_ДанныеПСЦ.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиПСЦПоставщика
	|ПОМЕСТИТЬ ВТ_СтрокиКИзменению
	|ИЗ
	|	ВТ_ДанныеПСЦ КАК ВТ_ДанныеПСЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	-1,
	|	РелизСобственникаНоминации.Контейнер,
	|	РелизСобственникаНоминации.ИдентификаторСтрокиПСЦПоставщика
	|ИЗ
	|	Документ.РелизСобственника КАК РелизСобственника
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
	|		ПО РелизСобственника.Ссылка = РелизСобственникаНоминации.Ссылка
	|ГДЕ
	|	РелизСобственника.ПСЦ = &Документ
	|	И РелизСобственникаНоминации.Контейнер <> Значение(Справочник.ТЕ.ПустаяСсылка)
	|
	|;	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СУММА(ВТ_СтрокиКИзменению.Индикатор) КАК Индикатор,
	|	ВТ_СтрокиКИзменению.Контейнер КАК Контейнер, 
	|	ВТ_СтрокиКИзменению.ИдентификаторСтрокиПСЦПоставщика,
	|	РелизСобственникаНоминации.Ссылка КАК РелизСобственника
	|ИЗ
	|	ВТ_СтрокиКИзменению КАК ВТ_СтрокиКИзменению
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
	|		ПО ВТ_СтрокиКИзменению.ИдентификаторСтрокиПСЦПоставщика = РелизСобственникаНоминации.ИдентификаторСтрокиПСЦПоставщика
	|	
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СтрокиКИзменению.Контейнер,
	|	ВТ_СтрокиКИзменению.ИдентификаторСтрокиПСЦПоставщика,
	|	РелизСобственникаНоминации.Ссылка
	|ИМЕЮЩИЕ
	|	СУММА(ВТ_СтрокиКИзменению.Индикатор) <> 0";

	Запрос.УстановитьПараметр("Документ", ДокументСсылка);
		
	Ответ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка Из Ответ Цикл
		РелизОбъект = Строка.РелизСобственника.ПолучитьОбъект();
		Если Строка.Индикатор < 0 Тогда
			НайденнаяСтрока = РелизОбъект.Номинации.Найти(Строка.Контейнер, "Контейнер");
			Если НайденнаяСтрока <> Неопределено Тогда
				РелизОбъект.Номинации.Удалить(НайденнаяСтрока);
			КонецЕсли;
		Иначе
			НайденнаяСтрока = РелизОбъект.Номинации.Найти(Строка.ИдентификаторСтрокиПСЦПоставщика, "ИдентификаторСтрокиПСЦПоставщика");
			Если НайденнаяСтрока <> Неопределено Тогда
				НайденнаяСтрока.Контейнер = Строка.Контейнер;
			КонецЕсли;
		КонецЕсли;
		РелизОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция ЕстьИзмененияВКонтейнерах(ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	1 КАК Идентификатор,
	|	ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ПСЦПоставщикаУчетныеЕдиницы.УчетнаяЕдиница КАК УчетнаяЕдиница
	|ПОМЕСТИТЬ ВТ_ВременнаяТаблица
	|ИЗ
	|	Документ.ПСЦПоставщика.Услуги КАК ПСЦПоставщикаУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПСЦПоставщика.УчетныеЕдиницы КАК ПСЦПоставщикаУчетныеЕдиницы
	|		ПО ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг = ПСЦПоставщикаУчетныеЕдиницы.ИдентификаторСтрокиУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПСЦПоставщика.КритерииУслуг КАК ПСЦПоставщикаКритерииУслуг
	|		ПО ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг = ПСЦПоставщикаКритерииУслуг.ИдентификаторСтрокиУслуг
	|ГДЕ
	|	ПСЦПоставщикаУслуги.Ссылка = &Документ
	|	И ПСЦПоставщикаУслуги.Номенклатура В(&Номенклатура)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	| 
	|ВЫБРАТЬ
	|	-1 КАК Идентификатор,
	|	РелизСобственникаНоминации.ИдентификаторСтрокиПСЦПоставщика КАК ИдентификаторСтрокиПСЦПоставщика,
	|	РелизСобственникаНоминации.Контейнер КАК Контейнер
	|ИЗ
	|	Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
	|ГДЕ
	|	РелизСобственникаНоминации.Ссылка.ПСЦ = &Документ
	|	И НЕ РелизСобственникаНоминации.Ссылка.ПометкаУдаления 
	|	И РелизСобственникаНоминации.Контейнер <> Значение(Справочник.ТЕ.ПустаяСсылка)
	|;
	| 
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	СУММА(ВТ_ВременнаяТаблица.Идентификатор) КАК Идентификатор,
	|	ВТ_ВременнаяТаблица.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ВТ_ВременнаяТаблица.УчетнаяЕдиница КАК УчетнаяЕдиница	
	|ИЗ
	|	ВТ_ВременнаяТаблица КАК ВТ_ВременнаяТаблица
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВременнаяТаблица.ИдентификаторСтрокиУслуг,
	|	ВТ_ВременнаяТаблица.УчетнаяЕдиница
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВТ_ВременнаяТаблица.Идентификатор) <> 0";
	
	МассивНоменклатур = Новый Массив;
	МассивНоменклатур.Добавить(Справочники.Номенклатура.АрендаКонтейнеров);
	МассивНоменклатур.Добавить(Справочники.Номенклатура.ПредоставлениеКТК);
	
	Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатур);
	Запрос.УстановитьПараметр("Документ", ДокументСсылка);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Ответ = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Элемент = Ответ.Найти(Выборка.ИдентификаторСтрокиУслуг);
		Если Элемент = Неопределено Тогда
			Ответ.Добавить(Выборка.ИдентификаторСтрокиУслуг);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Строка Из Ответ Цикл
		РелизОбъект = Строка.РелизСобственника.ПолучитьОбъект();
		Если Строка.Индикатор < 0 Тогда
			НайденнаяСтрока = РелизОбъект.Номинации.Найти(Строка.Контейнер, "Контейнер");
			Если НайденнаяСтрока <> Неопределено Тогда
				РелизОбъект.Номинации.Удалить(НайденнаяСтрока);
			КонецЕсли;
		Иначе
			НайденнаяСтрока = РелизОбъект.Номинации.Найти(Строка.ИдентификаторСтрокиПСЦПоставщика, "ИдентификаторСтрокиПСЦПоставщика");
			Если НайденнаяСтрока <> Неопределено Тогда
				НайденнаяСтрока.Контейнер = Строка.Контейнер;
			КонецЕсли;
		КонецЕсли;
		РелизОбъект.Записать();
	КонецЦикла;
	
	Возврат Ответ;
	
КонецФункции

//Евросиб(ДИТ), Беляев СЮ, BUG 94917 / TA 96390, 27-11-2024, начало
Функция СостояниеЦикловКонтейнеровРелиза(РелизСсылка, Контейнеры, ВидРезультата = "ТаблицаЗначений") Экспорт
	
	РезультатФункции = Неопределено;
	
	ТЗКонтейнеры = Новый ТаблицаЗначений;
	ТЗКонтейнеры.Колонки.Добавить("Контейнер", Новый ОписаниеТипов("СправочникСсылка.ТЕ"));
	ТЗКонтейнеры.Колонки.Добавить("ДатаВзятия", Новый ОписаниеТипов("Дата"));
	
	Если ТипЗнч(Контейнеры) = Тип("ТаблицаЗначений") Тогда
		ТЗКонтейнеры = Контейнеры;
	ИначеЕсли ТипЗнч(Контейнеры) = Тип("Массив") Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(ТЗКонтейнеры, Контейнеры, "Контейнер");
	ИначеЕсли ТипЗнч(Контейнеры) = Тип("СправочникСсылка.ТЕ") Тогда
		ТЗКонтейнеры.Добавить().Контейнер = Контейнеры;
	КонецЕсли;
	
	Если ТЗКонтейнеры.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗКонтейнеры.Контейнер КАК Контейнер,
		|	ТЗКонтейнеры.ДатаВзятия КАК ДатаВзятия,
		|	&Релиз КАК Релиз
		|ПОМЕСТИТЬ ВТКонтейнеры
		|ИЗ
		|	&ТЗКонтейнеры КАК ТЗКонтейнеры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	стоки_ТекущиеДанные.КТК КАК Контейнер,
		|	МАКСИМУМ(стоки_ТекущиеДанные.ПорядковыйНомерЦиклаАрендыКТК) КАК ПорядковыйНомерЦиклаАрендыКТК
		|ПОМЕСТИТЬ ВТНомераЦикловТекущегоРелиза
		|ИЗ
		|	РегистрСведений.стоки_ТекущиеДанные КАК стоки_ТекущиеДанные
		|ГДЕ
		|	стоки_ТекущиеДанные.КТК В
		|			(ВЫБРАТЬ
		|				ВТКонтейнеры.Контейнер
		|			ИЗ
		|				ВТКонтейнеры КАК ВТКонтейнеры)
		|	И стоки_ТекущиеДанные.тек_Релиз = &Релиз
		|
		|СГРУППИРОВАТЬ ПО
		|	стоки_ТекущиеДанные.КТК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	стоки_ТекущиеДанныеСрезПоследних.КТК КАК КТК,
		|	стоки_ТекущиеДанныеСрезПоследних.ПорядковыйНомерЦиклаАрендыКТК КАК ПорядковыйНомерЦиклаАрендыКТК,
		|	стоки_ТекущиеДанныеСрезПоследних.тек_ВЭксплуатации КАК тек_ВЭксплуатации
		|ПОМЕСТИТЬ ВТНомераАктуальныхЦиклов
		|ИЗ
		|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(
		|			,
		|			КТК В
		|				(ВЫБРАТЬ
		|					ВТКонтейнеры.Контейнер
		|				ИЗ
		|					ВТКонтейнеры КАК ВТКонтейнеры)) КАК стоки_ТекущиеДанныеСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТКонтейнеры.Контейнер КАК Контейнер,
		|	ВТКонтейнеры.ДатаВзятия КАК ДатаВзятия,
		|	ЕСТЬNULL(ВТНомераАктуальныхЦиклов.ПорядковыйНомерЦиклаАрендыКТК, 0) КАК ПорядковыйНомерЦиклаАрендыКТК_Актуальный,
		|	ЕСТЬNULL(ВТНомераЦикловТекущегоРелиза.ПорядковыйНомерЦиклаАрендыКТК, 0) КАК ПорядковыйНомерЦиклаАрендыКТК_ТекущегоРелиза,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТНомераЦикловТекущегоРелиза.ПорядковыйНомерЦиклаАрендыКТК, 0) = 0
		|				И ЕСТЬNULL(ВТНомераАктуальныхЦиклов.ПорядковыйНомерЦиклаАрендыКТК, 0) = 0
		|			ТОГДА ИСТИНА
		|		КОГДА ЕСТЬNULL(ВТНомераЦикловТекущегоРелиза.ПорядковыйНомерЦиклаАрендыКТК, 0) = 0
		|				И НЕ ЕСТЬNULL(ВТНомераАктуальныхЦиклов.тек_ВЭксплуатации, ЛОЖЬ)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЕСТЬNULL(ВТНомераАктуальныхЦиклов.ПорядковыйНомерЦиклаАрендыКТК, 0) = ЕСТЬNULL(ВТНомераЦикловТекущегоРелиза.ПорядковыйНомерЦиклаАрендыКТК, 0)
		|	КОНЕЦ КАК РелизАктуален
		|ПОМЕСТИТЬ ВТРезультат
		|ИЗ
		|	ВТКонтейнеры КАК ВТКонтейнеры
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНомераЦикловТекущегоРелиза КАК ВТНомераЦикловТекущегоРелиза
		|		ПО ВТКонтейнеры.Контейнер = ВТНомераЦикловТекущегоРелиза.Контейнер
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНомераАктуальныхЦиклов КАК ВТНомераАктуальныхЦиклов
		|		ПО ВТКонтейнеры.Контейнер = ВТНомераАктуальныхЦиклов.КТК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТРезультат.Контейнер КАК Контейнер,
		|	ВТРезультат.ДатаВзятия КАК ДатаВзятия,
		|	ВТРезультат.ПорядковыйНомерЦиклаАрендыКТК_Актуальный КАК ПорядковыйНомерЦиклаАрендыКТК_Актуальный,
		|	ВТРезультат.ПорядковыйНомерЦиклаАрендыКТК_ТекущегоРелиза КАК ПорядковыйНомерЦиклаАрендыКТК_ТекущегоРелиза,
		|	ВТРезультат.РелизАктуален КАК РелизАктуален
		|ИЗ
		|	ВТРезультат КАК ВТРезультат
		|ГДЕ
		|	ВТРезультат.РелизАктуален = &РелизАктуален";
	
	Если ВидРезультата = "МассивКонтейнеровПоКоторымРелизАктуален" Тогда
		Запрос.УстановитьПараметр("РелизАктуален", Истина);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТРезультат.РелизАктуален = &РелизАктуален", "Истина");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТЗКонтейнеры", ТЗКонтейнеры);
	Запрос.УстановитьПараметр("Релиз", РелизСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если ВидРезультата = "ТаблицаЗначений" Тогда
		РезультатФункции = РезультатЗапроса.Выгрузить();
	ИначеЕсли ВидРезультата = "СостояниеЦиклаКонтейнера" Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		РезультатФункции = Выборка.РелизАктуален;
	ИначеЕсли ВидРезультата = "МассивКонтейнеровПоКоторымРелизАктуален" Тогда
		РезультатФункции = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Контейнер");
	ИначеЕсли ВидРезультата = "МассивИзТаблицыЗначений" Тогда
		РезультатФункции = ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатЗапроса.Выгрузить());
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, BUG 94917 / TA 96390, 27-11-2024, конец

// Евросиб US 104907 TA 105520 Рыбьяков К.А. 01.04.2025 (( перенес из модуля формы
Процедура УдалитьЗаписиРегистров(ОтменаПроведения, Объект) Экспорт
	Если ОтменаПроведения Тогда
		Отказ = Ложь;
		МассивКТК = Новый Массив;
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	стоки_ТекущиеДанныеСрезПоследних.ПорядковыйНомерЦиклаАрендыКТК КАК ПорядковыйНомерЦиклаАрендыКТК,
			|	стоки_ТекущиеДанныеСрезПоследних.КТК КАК КТК
			|ПОМЕСТИТЬ НомерЦикла
			|ИЗ
			|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(&Дата, тек_Релиз = &Релиз) КАК стоки_ТекущиеДанныеСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	стоки_ТекущиеДанные.ГУИДЗаписи КАК ГУИДЗаписи,
			|	НомерЦикла.КТК КАК КТК,
			|	стоки_ТекущиеДанные.ИсточникЗаписи КАК ИсточникЗаписи
			|ИЗ
			|	НомерЦикла КАК НомерЦикла
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные КАК стоки_ТекущиеДанные
			|		ПО НомерЦикла.КТК = стоки_ТекущиеДанные.КТК
			|			И НомерЦикла.ПорядковыйНомерЦиклаАрендыКТК = стоки_ТекущиеДанные.ПорядковыйНомерЦиклаАрендыКТК
			|ГДЕ
			//ДИТ Авдеева В.С. 53975 16.08.2022 Начало 
			|	стоки_ТекущиеДанные.Период >= &ДатаНачалаДействияРелиза И
			//ДИТ Авдеева В.С. 53975 16.08.2022 Конец 
			//|	стоки_ТекущиеДанные.ИсточникЗаписи ПОДОБНО ""%Заявка%""";
			//ДИТ, Беляев СЮ, Ticket#0323876, 11-09-2023, начало
			|	стоки_ТекущиеДанные.ИсточникЗаписи ПОДОБНО ""Заявка %""";
			//ДИТ, Беляев СЮ, Ticket#0323876, 11-09-2023, конец
		
		Запрос.УстановитьПараметр("Дата", ТекущаяДата());
		Запрос.УстановитьПараметр("Релиз", Объект.Ссылка);
		//ДИТ Авдеева В.С. 53975 16.08.2022 Начало 
		Запрос.УстановитьПараметр("ДатаНачалаДействияРелиза", Объект.НачалоДействия);//ПериодДействия.ДатаНачала);
		//ДИТ Авдеева В.С. 53975 16.08.2022 Конец 
		
		РезультатЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса[1].Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Сообщить("КТК "+ВыборкаДетальныеЗаписи.КТК+" выдан клиенту по "+ВыборкаДетальныеЗаписи.ИсточникЗаписи+". Отмена проведения невозможна.");
				Отказ = Истина;
		КонецЦикла;
		
		Если НЕ Отказ Тогда
			ВыборкаКТК = РезультатЗапроса[0].Выбрать();
			Пока ВыборкаКТК.Следующий() Цикл
				МассивКТК.Добавить(ВыборкаКТК.КТК);
			КонецЦикла;
			МассивПериодов = Новый Массив;
			Для каждого ЭлементМассива из МассивКТК Цикл
				СтокиТекущиеДанные = РегистрыСведений.стоки_ТекущиеДанные.СоздатьНаборЗаписей();
				СтокиТекущиеДанные.Отбор.КТК.Установить(ЭлементМассива);
				СтокиТекущиеДанные.Прочитать();			
				МассивСтрокКУдалению = Новый Массив;
				Для каждого ЗаписьСтокиТекущиеДанные из СтокиТекущиеДанные Цикл
					Если ЗаписьСтокиТекущиеДанные.тек_Релиз = Объект.Ссылка Тогда
						МассивПериодов.Добавить(ЗаписьСтокиТекущиеДанные.Период);
						МассивСтрокКУдалению.Добавить(ЗаписьСтокиТекущиеДанные);
					КонецЕсли;
				КонецЦикла;
				Для каждого СтрокаКУдалению из МассивСтрокКУдалению Цикл
					СтокиТекущиеДанные.Удалить(СтрокаКУдалению);
				КонецЦикла;
				СтокиТекущиеДанные.Записать();
			КонецЦикла;
			МассивГУИД = Новый Массив;	
			Для каждого ЭлементПериодов из МассивПериодов Цикл
				КлиентскоеОперирование = РегистрыСведений.стоки_КлиентскоеОперирование.СоздатьНаборЗаписей();
				КлиентскоеОперирование.Отбор.Период.Установить(ЭлементПериодов);
				КлиентскоеОперирование.Прочитать();
				Для каждого ЗаписьКлиентскоеОперирование из КлиентскоеОперирование Цикл
					МассивГУИД.Добавить(ЗаписьКлиентскоеОперирование.ГУИДЗаписи);
				КонецЦикла;
				КлиентскоеОперирование.Очистить();
				КлиентскоеОперирование.Записать();
			КонецЦикла;
			Для каждого ГУИД из МассивГУИД Цикл
				СтокиТекущиеДанныеСНП = РегистрыСведений.стоки_ТекущиеДанные_СНП.СоздатьНаборЗаписей();
				СтокиТекущиеДанныеСНП.Отбор.ГУИДЗаписи.Установить(ГУИД);
				СтокиТекущиеДанныеСНП.Очистить();
				СтокиТекущиеДанныеСНП.Записать();
			КонецЦикла;
		Иначе
			ДокОбъект = Объект.Ссылка.ПолучитьОбъект();
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	Иначе
		ДокОбъект = Объект.Ссылка.ПолучитьОбъект();
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
КонецПроцедуры
