
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Дата 			= ТекущаяДата();
	Автор 			= Пользователи.ТекущийПользователь();
	Создано 		= ТекущаяДата();
	Организация 	= Константы.ОсновнаяОрганизация.Получить();
	Активность 		= Перечисления.СтатусАктивностиРелиза.Активен;
	
	//++ Зубов US 33131 TA 38910 27.10.2021
	//Заполненность 	= Перечисления.СтатусыЗаполненностиРелиза.Открыт;
	Реализованность 	= Перечисления.СтатусыЗаполненностиРелиза.Открыт;
	//-- Зубов US 33131 TA 38910 27.10.2021
	
	// ++ ДИТ_Агафонов_task 50388 06.07.2022
	ЦФО = Автор.ЦФО;
	// -- ДИТ_Агафонов_task 50388 06.07.2022
	
	// Евросиб US 89887 TA 89889 Рыбьяков К.А. 28.10.2024 ((
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПСЦПоставщика") Тогда
		Документы.РелизСобственника.ЗаполнитьРелизСобственникаНаОснованииПСЦПоставщика(ДанныеЗаполнения, ЭтотОбъект);
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 28.10.2024 ))
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//ДИТ, Беляев СЮ, US 83045 / TA 85275, 16-05-2024, начало
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	//ДИТ, Беляев СЮ, US 83045 / TA 85275, 16-05-2024, конец    
	
	//Евросиб(ДИТ) Сержантова А.С. US 97699 ТА 97731 Начало 29.01.2025  
	ПометкаДоЗаписи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ПометкаУдаления, ПСЦ"); // Евросиб US 115383 TA 115384 Рыбьяков К.А. 27.07.2025 (( добавил ПСЦ
	Если ПометкаУдаления и не ПометкаДоЗаписи.ПометкаУдаления и ПроверкаПередУстановкойПометкиУдаления() Тогда
		Отказ = Истина;
	КонецЕсли;
	//Евросиб(ДИТ) Сержантова А.С. US 97699 ТА 97731 Конец 29.01.2025
	
	// Евросиб US 115383 TA 115384 Рыбьяков К.А. 27.07.2025 ((
	Если ПСЦ <> ПометкаДоЗаписи.ПСЦ Тогда
		СвязанныеДокументыСервер.УдалитьСвязи(ПометкаДоЗаписи.ПСЦ, Ссылка);
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 27.07.2025 ))
	
	//Евросиб(ДИТ), Беляев СЮ, US 93174 / TA 96664, 16-12-2024, начало
	ДоступнаРаботаСАрендованнымПарком = РольДоступна("dc_РаботаСАрендованнымПарком") ИЛИ РольДоступна("ПолныеПрава");
	Если НЕ ДоступнаРаботаСАрендованнымПарком Тогда
		СтрокаАрендаДлительная = Номинации.Найти(Перечисления.ВариантыСобственности.АрендаДлительная, "тек_СобственностьКТК");
		Если СтрокаАрендаДлительная <> Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю("Документ содержит Вид собственности <АрендаДлительная>, недостаточно прав доступа для работы с арендованным парком.",,
													ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Номинации",СтрокаАрендаДлительная.НомерСтроки,"тек_СобственностьКТК"),,Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 93174 / TA 96664, 16-12-2024, конец
	
	КоличествоНомерных = 0;
	КоличествоБезномерных = 0; 
	//ДИТ Авдеева В.С. 53518 19.08.2022 Начало
	ОсталосьКВыдаче = 0;
	//ДИТ Авдеева В.С. 53518 19.08.2022 Конец 
	//++ Дудоров С.В. TASK 66585 17.03.2023
	
	//Евросиб СубботинВ #102567 18.02.2025 Начало// перенес в проверку заполнения
	//// ДИТ_Алексеев А.А. 2024-07-26 #0360281 Начало	
	//Если СобственныеКТК Тогда
	//	ДанныеНоминацииПоНезаполненнымКонтейнерам = ПолучитьДанныеНоминацииПоНезаполненнымКонтейнерам();  
	//	Если не ДанныеНоминацииПоНезаполненнымКонтейнерам.ВсеКонтейнерыЗаполнены Тогда
	//		ОшибкиНезаполненныхКонтейнеров = ДанныеНоминацииПоНезаполненнымКонтейнерам.ОшибкиНезаполненныхКонтейнеров;
	//		Пока ОшибкиНезаполненныхКонтейнеров.Следующий() Цикл
	//		//Евросиб СубботинВ #102567 18.02.2025 Начало	
	//			//Сообщить("Ошибка: Не заполнен контейнер в строке №" + ОшибкиНезаполненныхКонтейнеров.НомерСтроки + ".");
	//			ОбщегоНазначения.СообщитьПользователю("Ошибка: Не заполнен контейнер в строке №" + ОшибкиНезаполненныхКонтейнеров.НомерСтроки + ".",,
	//			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Номинации", ОшибкиНезаполненныхКонтейнеров.НомерСтроки,"Контейнер"),"Объект")
	//		//Евросиб СубботинВ #102567 18.02.2025 Конец
	//		КонецЦикла;	
	//		Отказ = Истина;
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	//// ДИТ_Алексеев А.А. 2024-07-26 #0360281 Конец
	//Евросиб СубботинВ #102567 18.02.2025 Конец

	//-- Дудоров С.В. TASK 66585 17.03.2023	
	Для каждого Стр из Номинации Цикл
		Если ЗначениеЗаполнено(Стр.Контейнер) Тогда
			КоличествоНомерных = КоличествоНомерных + 1;
		Иначе
			КоличествоБезномерных = КоличествоБезномерных + 1;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Стр.ДатаАктуальностиЗаписи) Тогда
			Стр.ДатаАктуальностиЗаписи = ТекущаяДата();
		КонецЕсли;
		//ДИТ Авдеева В.С. 53518 19.08.2022 Начало
		Если Не ЗначениеЗаполнено(Стр.ДатаВзятия) Тогда
			ОсталосьКВыдаче = ОсталосьКВыдаче + 1;
		КонецЕсли;
		////ДИТ Авдеева В.С. 53518 19.08.2022 Конец 
		////Евросиб СубботинВ #102687 24.02.2025 Начало перенес в конец после всех проверок 
		//// Евросиб US 88643 TA 88646 Рыбьяков К.А. 04.09.2024 ((
		//Если Не ЗначениеЗаполнено(Стр.КлючАналитики) Тогда
		//	КлючАналитики = Документы.РелизСобственника.СоздатьКлючАналитикиСтрокиНоминаций();
		//	Стр.КлючАналитики = КлючАналитики;
		//КонецЕсли;
		//// Евросиб Рыбьяков К.А. 04.09.2024 ))
		////Евросиб СубботинВ #102687 24.02.2025 Конец 
	КонецЦикла;       
	
	//ДИТ Авдеева В.С. 53518 19.08.2022 Начало
	ОбщееКоличествоВРелизе = Номинации.Количество();
	//ДИТ Авдеева В.С. 53518 19.08.2022 Конец

	ЕстьХотьОдинСлот = Ложь;
	Для каждого Стр из Номинации Цикл
		ЕстьХотьОдинСлот = ЕстьХотьОдинСлот ИЛИ НЕ ЗначениеЗаполнено(Стр.Контейнер);
	КонецЦикла;

	//++ Зубов US 45162 TA 45703 21.01.2022
	//++ Зубов US 33131 TA 38910 27.10.2021
	//Заполненность = ?(ЕстьХотьОдинСлот, ПредопределенноеЗначение("Перечисление.СтатусыЗаполненностиРелиза.Открыт"), ПредопределенноеЗначение("Перечисление.СтатусыЗаполненностиРелиза.Исчерпан"));
	//Реализованность = ?(ЕстьХотьОдинСлот, ПредопределенноеЗначение("Перечисление.СтатусыЗаполненностиРелиза.Открыт"), ПредопределенноеЗначение("Перечисление.СтатусыЗаполненностиРелиза.Исчерпан"));
    Реализованность = ?(ЕстьХотьОдинСлот ИЛИ Номинации.Количество()=0, ПредопределенноеЗначение("Перечисление.СтатусыЗаполненностиРелиза.Открыт"), ПредопределенноеЗначение("Перечисление.СтатусыЗаполненностиРелиза.Исчерпан"));
	//-- Зубов US 33131 TA 38910 27.10.2021
    //-- Зубов US 45162 TA 45703 21.01.2022
	
	//Если ОбменДанными.Загрузка Тогда //ДИТ, Беляев СЮ, US 83045 / TA 85275, 16-05-2024, перенес выше
	//	Возврат;
	//КонецЕсли;
	
	Редактор 		= Пользователи.ТекущийПользователь();
	Изменено 		= ТекущаяДата();
	//++ Зубов US 45162 TA 45703 21.01.2022
	//Если Активность = Перечисления.СтатусАктивностиРелиза.Просрочен И ОкончаниеДействия > ТекущаяДата() Тогда
	//	Активность = Перечисления.СтатусАктивностиРелиза.Активен;
	//ИначеЕсли Активность = Перечисления.СтатусАктивностиРелиза.Активен И ОкончаниеДействия < ТекущаяДата() Тогда
	//	Активность = Перечисления.СтатусАктивностиРелиза.Просрочен;
	//КонецЕсли;
	Если ОкончаниеДействия <= ТекущаяДата() И ЗначениеЗаполнено(ОкончаниеДействия) Тогда
		Если Реализованность = ПредопределенноеЗначение("Перечисление.СтатусыЗаполненностиРелиза.Открыт") Тогда
			Активность = ПредопределенноеЗначение("Перечисление.СтатусАктивностиРелиза.Просрочен");
		Иначе
			Активность = ПредопределенноеЗначение("Перечисление.СтатусАктивностиРелиза.Закрыт");
		КонецЕсли;
	Иначе
		Активность = ПредопределенноеЗначение("Перечисление.СтатусАктивностиРелиза.Активен");
	КонецЕсли;
	//-- Зубов US 45162 TA 45703 21.01.2022
	Для каждого Стр из Номинации Цикл
		
		Если ЗначениеЗаполнено(Стр.Контейнер) И ЗначениеЗаполнено(Стр.ТипКТК) И НЕ ЗначениеЗаполнено(Стр.Контейнер.ТипТЕ) Тогда
			КОб = Стр.Контейнер.ПолучитьОбъект();
			КОб.ТипТЕ = Стр.ТипКТК;
			КОб.Записать();
		КонецЕсли;
		
		//++ Зубов US 33131 TA 38910 26.10.2021
		//Если ЗначениеЗаполнено(Стр.Контейнер) Тогда
		//	ДанныеАРМКТК = УправлениеКТКВСтокахСервер.ПолучитьДанныеКТКизАРМКТК(Стр.Контейнер);
		//	Если ЗначениеЗаполнено(ДанныеАРМКТК.тек_Собственник) Тогда
		//		Стр.тек_Собственник = ДанныеАРМКТК.тек_Собственник;
		//	КонецЕсли;
		//КонецЕсли;
		//-- Зубов US 33131 TA 38910 26.10.2021
	КонецЦикла;
	
	// ++ ДИТ_Агафонов_task 50388 07.07.2022
	// + Состояния
	КолвоРелизКлиентаНеСовпадаетТипоразмерКТК=0;	
	КолвоРелизКлиентаНоваяЗаписьКТК=0;
	Для каждого СтрокаНоминации Из Номинации Цикл
		Если СтрокаНоминации.РелизКлиентаНеСовпадаетТипоразмерКТК Тогда
			КолвоРелизКлиентаНеСовпадаетТипоразмерКТК = КолвоРелизКлиентаНеСовпадаетТипоразмерКТК + 1;
		КонецЕсли;
		Если СтрокаНоминации.РелизКлиентаНоваяЗаписьКТК Тогда
			КолвоРелизКлиентаНоваяЗаписьКТК = КолвоРелизКлиентаНоваяЗаписьКТК + 1;
		КонецЕсли;
	КонецЦикла; 
	
	// ДИТ US 76956 ТА 76963 Сержантова А.С. Начало: 03.11.2023
	СтрокиСПустойДатойВзятия = Новый Массив;  
	СтрокиДоПроведения = Новый Массив;
	Для каждого Стр Из Ссылка.Номинации Цикл 
		Если не ЗначениеЗаполнено(стр.ДатаВзятия) Тогда
			СтрокиСПустойДатойВзятия.Добавить(стр.ГУИДСтроки);	
		КонецЕсли; 
		СтрокиДоПроведения.Добавить(стр.ГУИДСтроки);
	КонецЦикла;
	ДополнительныеСвойства.Вставить("ПустыеДатыВзятия", СтрокиСПустойДатойВзятия); 
	ДополнительныеСвойства.Вставить("СтрокиДоПроведения", СтрокиДоПроведения); 
	// ДИТ US 76956 ТА 76963 Сержантова А.С. Конец: 03.11.2023
	
	Маршрутизировать = КолвоРелизКлиентаНеСовпадаетТипоразмерКТК > 0 или КолвоРелизКлиентаНоваяЗаписьКТК > 0;
	МаршрутизироватьЗаново = Ложь;
	Если не Маршрутизировать Тогда
		ПроверитьСостояния(МаршрутизироватьЗаново);
	Иначе	
	// проверяем корректность перечня состояний в ТЧ Состояния
	Для Сч = 0 По Состояния.Количество() - 2 Цикл
		ТекСостояние = Состояния[Сч].Состояние;
		Для ТекСч = Сч + 1 По Состояния.Количество() - 1 Цикл
			Если Состояния[ТекСч].Состояние = ТекСостояние Тогда
				Сообщить("Ошибка: одно состояние может встречаться в документе только один раз!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
		
	//МаршрутизацияСервер.ПараллельноеСогласование(Состояния); //ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, закомментировал (перенёс ниже)
		
	// Маршрутизация заказа
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = МаршрутизацияСервер.ТребуетсяПеремаршрутизацияДляОбъекта(ЭтотОбъект); 
	
	Если Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		
		ПараметрыЗапроса = Документы.РелизСобственника.ПолучитьПараметрыМаршрутизации(ЭтотОбъект);
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьРелизСобственника(ПараметрыЗапроса, Дата);
		Если РезультатЗапроса.Количество() > 0 и ПримененныйМаршрут<>РезультатЗапроса[0].Ссылка Тогда
			УказанныеВручнуюИспНаблюдатель = Новый СписокЗначений;
			Если ДополнительныеСвойства.Свойство("ДопСвойстваОбъекта") тогда
				УказанныеВручнуюИспНаблюдатель = ДополнительныеСвойства.ДопСвойстваОбъекта;
			КонецЕсли;
			МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъект, РезультатЗапроса, Автор, УказанныеВручнуюИспНаблюдатель);			
			МаршрутизироватьЗаново = Истина;
		КонецЕсли;
	КонецЕсли;
	
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, начало
	МаршрутизацияСервер.ПараллельноеСогласование(Состояния);
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, конец
	
	ПроверитьСостояния(МаршрутизироватьЗаново);
	
	МаршрутизацияСервер.ПостобработкаТЧСостояний(ЭтотОбъект, Автор);
	
	// если исполнитель пустой, то проставляем тек пользователя
	Для каждого Стр из Состояния Цикл
		Если Стр.ПримечаниеЗадачаИсполнителю Тогда
			// если текст примечания изменился, то создать новое сообщение. если остался прежним, то не менять
			// т.к. состояние уникально, ищем по нему
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Состояние",Стр.Состояние);
			НайденнаяСтр = Ссылка.Состояния.НайтиСтроки(ПараметрыОтбора);
			Если НайденнаяСтр.Количество()>0 Тогда
				Если НЕ НайденнаяСтр[0].Комментарий = Стр.Комментарий Тогда
					
					// +Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					ДатаСообщения = ТекущаяДата();
					АвторСообщения = Пользователи.ТекущийПользователь();
					ТекстСообщения = Стр.Комментарий;
					ГУИДСообщения = Новый УникальныйИдентификатор();
					
					ГУИДТемы = Новый УникальныйИдентификатор;
					
					РассылкаПоЛичнымЦелям.СформироватьЛичноеСообщение(ГУИДТемы, , Ссылка, ДатаСообщения, АвторСообщения, ТекстСообщения, , ГУИДСообщения, Стр.Исполнитель);
					// -Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	КонецЕсли;	
	// - Состояния	
	// -- ДИТ_Агафонов_task 50388 07.07.2022
	
	
	//Евросиб СубботинВ #102687 24.02.2025 Начало перенес в конец после всех проверок
	Если не ЗначениеЗаполнено(Ссылка) тогда
		НовыйГуид = Документы.РелизСобственника.ПолучитьСсылку(Новый УникальныйИдентификатор());
		ЭтотОбъект.УстановитьСсылкуНового(НовыйГуид);
		СсылкаРелиз = ПолучитьСсылкуНового();
	Иначе
		СсылкаРелиз = Ссылка;
	КонецЕсли;
	Для каждого СтрокаНоминации Из Номинации Цикл		
		Если Не ЗначениеЗаполнено(СтрокаНоминации.КлючАналитики) Тогда
			КлючАналитики = Документы.РелизСобственника.СоздатьКлючАналитикиСтрокиНоминаций(СсылкаРелиз,СтрокаНоминации.Контейнер);
			СтрокаНоминации.КлючАналитики = КлючАналитики;
		КонецЕсли;
		// Евросиб US 112646 TA 112819 Рыбьяков К.А. 06.07.2025 ((
		Если Не ЗначениеЗаполнено(СтрокаНоминации.ВалютаСНП) И Не НаОсновании Тогда
			СтрокаНоминации.ВалютаСНП = СтрокаНоминации.Валюта;
		КонецЕсли;
		// Евросиб Рыбьяков К.А. 06.07.2025 ))
	КонецЦикла;
	//Евросиб СубботинВ #102687 24.02.2025 Конец
	
	// Евросиб US 88683 TA 108959 Рыбьяков К.А. 13.05.2025 ((
	ПодобратьКалькуляцииИСделки(Ссылка);
	// Евросиб Рыбьяков К.А. 13.05.2025 ))
	
	//Евросиб СубботинВ #131884 02.03.2026 Конец
	ДополнительныеСвойства.Вставить("РежимЗаписи",РежимЗаписи);
	//Евросиб СубботинВ #131884 02.03.2026 Конец 
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Евросиб СубботинВ # 18.02.2025 Начало // переделываю полностью на обработку првоерки заполнения
	//++ Зубов US 33131 TA 38910 27.10.2021
	//Отказ = ПроверитьЗаполненностьРеквизитов();
	//Если Отказ Тогда
	//	Возврат;
	//КонецЕсли;
	//Евросиб СубботинВ #102567 18.02.2025 Конец
	
	//ДИТ Авдеева В.С. 0281647 07.09.2022 Начало  
	//перенесен в форму документа
	//Отказ = ПроверитьНезакрытыеЦиклыКонтейнеров();
	//Если Отказ Тогда
	//	Возврат;
	//КонецЕсли;
	//ДИТ Авдеева В.С. 0281647 07.09.2022 Конец                

	//-- Зубов US 33131 TA 38910 27.10.2021
	
	//++ Зубов US 45162 TA 45703 21.01.2022
	
	////Евросиб СубботинВ #102567 18.02.2025 Начало // перенес в проверку заполнения
	////Евросиб Коханенко Н.А. 22.05.2023 (( #70111
	////Отказ = ПроверитьНулевуюСтавку();
	//Отказ = ?(НЕ СобственныеКТК, ПроверитьНулевуюСтавку(), Отказ);
	////Евросиб Коханенко Н.А. 22.05.2023 )) #70111 

	// убрал тоже т.к отказ ранее не получаем
	//Если Отказ Тогда
	//	Возврат;
	//КонецЕсли;
	////Евросиб СубботинВ #102567 18.02.2025 Конец

	//-- Зубов US 45162 TA 45703 21.01.2022
	
	// АРМ КТК
	
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	АктуализироватьРелизКлиента(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	// Евросиб Фролов)
	
	//Евросиб(ДИТ), Беляев СЮ, BUG 95529 / TA 95530, 18-11-2024, начало (очередь заполняет реквизиты в документ из регистра, запись этих же данных в регистр будет излишней)
	Если ДополнительныеСвойства.Свойство("ЗаписьОчередьюОтложенногоИзменения") Тогда
		Возврат;
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, BUG 95529 / TA 95530, 18-11-2024, конец
	
	//ДИТ, Беляев СЮ, BUG 79840/TASK 79870, 24-01-2024, начало
	ТекущиеПериодыПоКонтейнерам = РегистрыСведений.стоки_ТекущиеДанные.ПолучитьТекущиеПериодыПоКонтейнерам(Номинации.ВыгрузитьКолонку("Контейнер"), "тек_ДатаСдачиВСток");
	//ДИТ, Беляев СЮ, BUG 79840/TASK 79870, 24-01-2024, конец 
	
	// Евросиб(ДИТ) US 85642 ТА 86102 Сержантова А.С. Начало: 14.06.2024
	ПериодыПоследнихЗаписейПоРелизу = РегистрыСведений.стоки_ТекущиеДанные.ПолучитьТекущиеПериодыПоКонтейнерам(Номинации.ВыгрузитьКолонку("Контейнер"), "Период", ,Ссылка);
	// Евросиб(ДИТ) US 85642 ТА 86102 Сержантова А.С. Конец: 14.06.2024
	
	Для каждого Стр из Номинации Цикл
		
		Если НЕ ЗначениеЗаполнено(Стр.Контейнер) Тогда Продолжить; КонецЕсли;
		
		//Евросиб(ДИТ), Беляев СЮ, BUG 93291 / TA 93965, 30-10-2024, начало
		Если НЕ ЗначениеЗаполнено(Стр.ДатаВзятия) Тогда 
			Продолжить;
		КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, BUG 93291 / TA 93965, 30-10-2024, конец
		
		//Евросиб(ДИТ), Беляев СЮ, BUG 94917 / TA 96390, 27-11-2024, начало (закомментировал актуализацию даты ДатаАктуальностиЗаписи, непонятна логика обновления даты и записи в регистр на эту дату при каждом проведении)
		////++ Зубов US 33131 TA 38910 01.11.2021
		//Если Проведен Тогда
		//	Если НЕ ЦиклЗакрыт(Стр.Контейнер,Стр.ДатаАктуальностиЗаписи) Тогда
		//		СТр.ДатаАктуальностиЗаписи = ТекущаяДата();
		//	КонецЕсли;
		//КонецЕсли;
		////-- Зубов US 33131 TA 38910 01.11.2021
		//Евросиб(ДИТ), Беляев СЮ, BUG 94917 / TA 96390, 27-11-2024, конец
		
		СоотвЗаполнения = Новый Соответствие;
		
		Если ЗначениеЗаполнено(Стр.НормативВозврата) Тогда
			СоотвЗаполнения.Вставить("тек_СрокВозврата", Стр.НормативВозврата);
		КонецЕсли;
		Если ЗначениеЗаполнено(Стр.Ставка) Тогда
			СоотвЗаполнения.Вставить("комм_Ставка", Стр.Ставка);
		КонецЕсли;
		Если ЗначениеЗаполнено(Стр.Валюта) Тогда
			СоотвЗаполнения.Вставить("комм_Валюта", Стр.Валюта);
		КонецЕсли; 
		// ДИТ US 76956 ТА 76963 Сержантова А.С. Начало: 03.11.2023
		//Если ЗначениеЗаполнено(Стр.ДатаВзятия) Тогда
		//	СоотвЗаполнения.Вставить("тек_ДатаВзятияИзСтока", Стр.ДатаВзятия);
		//КонецЕсли;  
		// ДИТ US 76956 ТА 76963 Сержантова А.С. Конец: 03.11.2023
		Если ЗначениеЗаполнено(Стр.тек_Примечание) Тогда
			СоотвЗаполнения.Вставить("тек_Примечание", Стр.тек_Примечание);
		КонецЕсли;
		Если ЗначениеЗаполнено(Стр.тек_СобственностьКТК) Тогда
			СоотвЗаполнения.Вставить("тек_ВидСобственности", Стр.тек_СобственностьКТК);
		КонецЕсли;
		//Если ЗначениеЗаполнено(Стр.тек_Собственник) Тогда
		//	СоотвЗаполнения.Вставить("тек_Собственник", Стр.тек_Собственник);
		//КонецЕсли;
		
		СоотвЗаполнения.Вставить("тек_Релиз", Ссылка);
		//++ Зубов US 33131 TA 38910 27.10.2021	 
		// ДИТ US 76956 ТА 76963 Сержантова А.С. Начало: 03.11.2023
		//СоотвЗаполнения.Вставить("тек_ГородВзятия", Локация);  
		//СоотвЗаполнения.Вставить("тек_СтокВзятия", Сток);
		// ДИТ US 76956 ТА 76963 Сержантова А.С. Конец: 03.11.2023
		СоотвЗаполнения.Вставить("тек_ЛокацияСдачи", ЛокацияСдачи); 
		СоотвЗаполнения.Вставить("тек_ПунктыОкончСдачи", ВозможныеСтокиСдачи);
		СоотвЗаполнения.Вставить("тек_Собственник", Контрагент);
		СоотвЗаполнения.Вставить("тек_Договор", Договор);
		СоотвЗаполнения.Вставить("тек_ВидСобственности", Стр.тек_СобственностьКТК);
		СоотвЗаполнения.Вставить("тек_ДатаПриемаВПользование", Стр.ДатаВзятия); 
		СоотвЗаполнения.Вставить("тек_СрокВозврата", Стр.НормативВозврата);
		СоотвЗаполнения.Вставить("комм_Ставка", Стр.Ставка);
		СоотвЗаполнения.Вставить("комм_Валюта", Стр.Валюта); 
		// ДИТ US 76956 ТА 76963 Сержантова А.С. Начало: 03.11.2023
		// Данные будем обновлять только при первом заполнении поля ДатаВзятия или если добавили новую строку и сразу заполнили дату взятия  
		Если ЗначениеЗаполнено(Стр.ДатаВзятия) и ((ДополнительныеСвойства.Свойство("ПустыеДатыВзятия")
			и ДополнительныеСвойства.ПустыеДатыВзятия.Найти(Стр.ГУИДСтроки) <> Неопределено)
			или (ДополнительныеСвойства.Свойство("СтрокиДоПроведения") 
			и ДополнительныеСвойства.СтрокиДоПроведения.Найти(Стр.ГУИДСтроки) = Неопределено)) Тогда 
		    СоотвЗаполнения.Вставить("тек_ГородВзятия", Локация);
			СоотвЗаполнения.Вставить("тек_СтокВзятия", Сток);   
			СоотвЗаполнения.Вставить("тек_ДатаВзятияИзСтока", Стр.ДатаВзятия);
		КонецЕсли;
		// ДИТ US 76956 ТА 76963 Сержантова А.С. Конец: 03.11.2023
		//++ Зубов US 33131 TA 38910 01.11.2021
		Если ПолучитьСтатусКТК(Стр.Контейнер,Стр.ДатаАктуальностиЗаписи) Тогда
			СоотвЗаполнения.Вставить("тек_Статус", ПредопределенноеЗначение("Перечисление.СтатусыКТК.Свободен"));
		КонецЕсли;
		//-- Зубов US 33131 TA 38910 01.11.2021
		//-- Зубов US 33131 TA 38910 27.10.2021
		СоотвЗаполнения.Вставить("ИсточникЗаписи", "Добавлено из релиза " + Ссылка + " польз: " + Пользователи.ТекущийПользователь());
		//++ Зубов US 33131 TA 43877 15.12.2021
		СоотвЗаполнения.Вставить("комм_СтавкаНДС", Стр.СтавкаНДС);
		СоотвЗаполнения.Вставить("комм_НДСВключая", Стр.НДСВключая);
		Если МорскиеКТК Тогда
			СоотвЗаполнения.Вставить("комм_ФрахтВкл", Стр.Ставка<=0);
		КонецЕсли;
		//-- Зубов US 33131 TA 43877 15.12.2021
		//++ Зубов US 45162 TA 45703 21.01.2022
		СоотвЗаполнения.Вставить("комм_НулеваяСтавка", Стр.НулеваяСтавка);
		//-- Зубов US 45162 TA 45703 21.01.2022
		
		//ДИТ, Беляев СЮ, BUG 79840/TASK 79870, 24-01-2024, начало
		ДатаСдачиВСтокТекущаяВРегистре = ТекущиеПериодыПоКонтейнерам.Получить(Стр.Контейнер);
		Если ДатаСдачиВСтокТекущаяВРегистре <> Неопределено Тогда
			Если ЗначениеЗаполнено(ДатаСдачиВСтокТекущаяВРегистре) И ДатаСдачиВСтокТекущаяВРегистре <  Стр.ДатаВзятия Тогда
				строкаСообщения = СтрШаблон("Для ктк %1 дата возврата %2 меньше даты приема %3 в пользование. Дата возврата будет очищена.", 
																									Стр.Контейнер, 
																									ДатаСдачиВСтокТекущаяВРегистре,
																									Стр.ДатаВзятия);
				ОбщегоНазначения.СообщитьПользователю(строкаСообщения);
				СоотвЗаполнения.Вставить("тек_ДатаСдачиВСток", Дата(1, 1, 1));
			КонецЕсли;
		КонецЕсли;
		//ДИТ, Беляев СЮ, BUG 79840/TASK 79870, 24-01-2024, конец  
		
		// Евросиб(ДИТ) US 85642 ТА 86102 Сержантова А.С. Начало: 17.06.2024
        ПериодПоследнейЗаписи = ПериодыПоследнихЗаписейПоРелизу.Получить(Стр.Контейнер);
		Если не ЗначениеЗаполнено(Ссылка) или ПериодПоследнейЗаписи = Неопределено Тогда
			ДатаПоследнейЗаписи = Неопределено;
		Иначе
            ДатаПоследнейЗаписи = ПериодПоследнейЗаписи;
		КонецЕсли;                              
		ЗаписьИнструкцииСделана = Ложь;
		Если ДатаПоследнейЗаписи <> Неопределено и ДатаПоследнейЗаписи < Стр.ДатаАктуальностиЗаписи Тогда
		    СоотвЗаполнения.Вставить("тек_ИнструкцияПоСдаче", Стр.ИнструкцииПоСдаче); 
			ЗаписьИнструкцииСделана = Истина;
		КонецЕсли;
		// Евросиб(ДИТ) US 85642 ТА 86102 Сержантова А.С. Конец: 17.06.2024 

		//ДИТ Шевченко А.В. 65473 07.03.2023 -начало //добавил параметр "ВыводитьСообщение = ложь"  
		//Евросиб Коханенко Н.А. 12.08.2024 (( #88014
		//РегистрыСведений.стоки_ТекущиеДанные.ДобавитьЗапись(Стр.Контейнер, СоотвЗаполнения, Стр.ДатаАктуальностиЗаписи,,Ложь);
		РегистрыСведений.стоки_ТекущиеДанные.ДобавитьЗапись(Стр.Контейнер, СоотвЗаполнения, Стр.ДатаАктуальностиЗаписи,,Ложь, ТипЗнч(Ссылка));
		//Евросиб Коханенко Н.А. 12.08.2024 )) #88014
		//ДИТ Шевченко А.В. 65473 07.03.2023 -конец 
		
		// Евросиб(ДИТ) US 85642 ТА 86102 Сержантова А.С. Начало: 11.06.2024
		//Инструкцию добавим в последнюю запись регистра сведений 
		Если НЕ ЗаписьИнструкцииСделана 
			// Евросиб(ДИТ) BUG 99736 ТА 99737 Сержантова А.С. Начало: 21.01.2025
			и ЗначениеЗаполнено(Стр.ИнструкцииПоСдаче)
			// Евросиб(ДИТ) BUG 99736 ТА 99737 Сержантова А.С. Конец: 21.01.2025
			Тогда
			СоотвЗаполнения = Новый Соответствие;
			СоотвЗаполнения.Вставить("тек_ИнструкцияПоСдаче", Стр.ИнструкцииПоСдаче);  
			//Евросиб Коханенко Н.А. 12.08.2024 (( #88014 
			//РегистрыСведений.стоки_ТекущиеДанные.ДобавитьЗапись(Стр.Контейнер, СоотвЗаполнения, ДатаПоследнейЗаписи,,Ложь);
			РегистрыСведений.стоки_ТекущиеДанные.ДобавитьЗапись(Стр.Контейнер, СоотвЗаполнения, ДатаПоследнейЗаписи,,Ложь, ТипЗнч(Ссылка));
			//Евросиб Коханенко Н.А. 12.08.2024 )) #88014
		КонецЕсли;
		// Евросиб(ДИТ) US 85642 ТА 86102 Сержантова А.С. Конец: 11.06.2024
		
		//++ Зубов US 33131 TA 43877 15.12.2021
		Если ДоплатныеКТК Тогда
			СоотвЗаполнения = Новый Соответствие;
			
			//Если ЗначениеЗаполнено(Стр.допл_Клиент) Тогда
			//	СоотвЗаполнения.Вставить("допл_Клиент", Стр.допл_Клиент);
			//КонецЕсли;
			//Если ЗначениеЗаполнено(Стр.допл_Договор) Тогда
			//	СоотвЗаполнения.Вставить("допл_Договор", Стр.допл_Договор);
			//КонецЕсли;
			//Если ЗначениеЗаполнено(Стр.допл_Калькуляция) Тогда
			//	СоотвЗаполнения.Вставить("допл_Калькуляция", Стр.допл_Калькуляция);
			//КонецЕсли;
			//Если ЗначениеЗаполнено(Стр.допл_ПСЦ) Тогда
			//	СоотвЗаполнения.Вставить("допл_ПСЦ", Стр.допл_ПСЦ);
			//КонецЕсли;
			Если ЗначениеЗаполнено(Контрагент) Тогда
				СоотвЗаполнения.Вставить("допл_Клиент", Контрагент);
			КонецЕсли;
			Если ЗначениеЗаполнено(Договор) Тогда
				СоотвЗаполнения.Вставить("допл_Договор", Договор);
			КонецЕсли;
			Если ЗначениеЗаполнено(Стр.допл_Калькуляция) Тогда
				СоотвЗаполнения.Вставить("допл_Калькуляция", Стр.допл_Калькуляция);
			КонецЕсли;
			Если ЗначениеЗаполнено(ПСЦ) Тогда
				СоотвЗаполнения.Вставить("допл_ПСЦ", ПСЦ);
			КонецЕсли;

			РегистрыСведений.стоки_КлиентскоеОперирование.ДобавитьЗапись(Стр.Контейнер, СоотвЗаполнения, Стр.ДатаАктуальностиЗаписи);
		КонецЕсли;	
		//-- Зубов US 33131 TA 43877 15.12.2021
		
		//++ Зубов US 33131 TA 38910 27.10.2021
		ПОтбора = Новый Структура("ГУИДСтроки",Стр.ГУИДСтроки);
		НайденныеСНП = СНП.НайтиСтроки(ПОтбора);
		Для каждого СтрокаСНП из НайденныеСНП Цикл
			МассивПараметров = Новый Массив;
			МассивПараметров.Добавить(Новый Структура("От, До, Стоимость", СтрокаСНП.От, СтрокаСНП.До, СтрокаСНП.Стоимость));
			АРМ_Сервер.ЗаписатьСНППоКТК(Стр.Контейнер, МассивПараметров);
		КонецЦикла;
		//-- Зубов US 33131 TA 38910 27.10.2021
	КонецЦикла;    
	
	//++ Зубов US 33131 TA 43877 16.12.2021
	ОчиститьЗаписиУдаленныхСтрок();
	//-- Зубов US 33131 TA 43877 16.12.2021
	//Евросиб - АСуслов 13.08.2024 15:05:31 #89911
	//(
	РегистрыСведений.стоки_ТекущиеДанные.ЗаписатьОстатокКТККСдаче(Ссылка);
	//)
	//Евросиб - АСуслов 13.08.2024 15:05:33 #89911  
	
	//Евросиб(ДИТ) Антонова А.С. US 77172 ТА 102290 Начало 12.03.2025
	СтатусыКТКСервер.ПроверитьИзменениеИЗаписатьСтатусыКТК(Ссылка, ЭтотОбъект.ДополнительныеСвойства);
	//Евросиб(ДИТ) Антонова А.С. US 77172 ТА 102290 Конец 12.03.2025
	
КонецПроцедуры

Функция ВписатьКТКВРелиз(МассивКТК) Экспорт
	
	Результат = Новый Соответствие;
	
	Для каждого Стр из МассивКТК Цикл
		
		НайдСтроки = Номинации.НайтиСтроки(Новый Структура("Контейнер", Стр.Ключ));
		Если НайдСтроки.Количество() = 0 Тогда
			
			Строки1Приоритета_МенеджерПлюсКлиент = Новый Массив;
			Строки2Приоритета_ТолькоКлиент = Новый Массив;
			Строки3Приоритета_МенеджерПустойКлиент = Новый Массив;
			Строки4Приоритета_ПустыеСтроки = Новый Массив;
			
			ТекМенеджер = Пользователи.ТекущийПользователь();
			
			Для каждого СтрНом из Номинации Цикл
				
				Если ЗначениеЗаполнено(СтрНом.Контейнер) Тогда Продолжить; КонецЕсли;
				
				Если СтрНом.НоминированныйМенеджер = ТекМенеджер И СтрНом.НоминированныйКлиент = Стр.Значение.Клиент Тогда
					Строки1Приоритета_МенеджерПлюсКлиент.Добавить(СтрНом);
				ИначеЕсли СтрНом.НоминированныйКлиент = Стр.Значение.Клиент Тогда
					Строки2Приоритета_ТолькоКлиент.Добавить(СтрНом);
				ИначеЕсли НЕ ЗначениеЗаполнено(СтрНом.НоминированныйКлиент) И СтрНом.НоминированныйМенеджер = ТекМенеджер Тогда
					Строки3Приоритета_МенеджерПустойКлиент.Добавить(СтрНом);
				ИначеЕсли НЕ ЗначениеЗаполнено(СтрНом.НоминированныйКлиент) И НЕ ЗначениеЗаполнено(СтрНом.НоминированныйМенеджер) Тогда
					Строки4Приоритета_ПустыеСтроки.Добавить(СтрНом);
				КонецЕсли;
				
			КонецЦикла;
			
			Если Строки1Приоритета_МенеджерПлюсКлиент.Количество() > 0 Тогда
				Строки1Приоритета_МенеджерПлюсКлиент[0].Контейнер = Стр.Ключ;
				Строки1Приоритета_МенеджерПлюсКлиент[0].ДатаАктуальностиЗаписи = ТекущаяДата();
				Результат.Вставить(Стр.Ключ, Ссылка);
			ИначеЕсли Строки2Приоритета_ТолькоКлиент.Количество() > 0 Тогда
				Строки2Приоритета_ТолькоКлиент[0].Контейнер = Стр.Ключ;
				Строки2Приоритета_ТолькоКлиент[0].ДатаАктуальностиЗаписи = ТекущаяДата();
				Результат.Вставить(Стр.Ключ, Ссылка);
			ИначеЕсли Строки3Приоритета_МенеджерПустойКлиент.Количество() > 0 Тогда
				Строки3Приоритета_МенеджерПустойКлиент[0].Контейнер = Стр.Ключ;
				Строки3Приоритета_МенеджерПустойКлиент[0].ДатаАктуальностиЗаписи = ТекущаяДата();
				Результат.Вставить(Стр.Ключ, Ссылка);
			ИначеЕсли Строки4Приоритета_ПустыеСтроки.Количество() > 0 Тогда
				Строки4Приоритета_ПустыеСтроки[0].Контейнер = Стр.Ключ;
				Строки4Приоритета_ПустыеСтроки[0].ДатаАктуальностиЗаписи = ТекущаяДата();
				Результат.Вставить(Стр.Ключ, Ссылка);
			Иначе
				Сообщить("По КТК " + Стр.Ключ + " нет слота в релизе! Релиз присвоен не будет!", СтатусСообщения.ОченьВажное);
			КонецЕсли;
			
		Иначе
			//++ Зубов Ticket#0249431 09.11.2021
			//НайдСтроки[0].ДатаАктуальностиЗаписи = ТекущаяДата();
			//Результат.Вставить(НайдСтроки[0].Контейнер, Ссылка);
			//-- Зубов Ticket#0249431 09.11.2021	
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//++ Зубов US 33131 TA 38910 27.10.2021
Функция ПроверитьЗаполненностьРеквизитов()
	ТекстНезаполненныеРеквизиты = "";
	ТекстНезаполненныеРеквизитыТЧ = "";
	ЕстьНезаполненныеРеквизиты = Ложь;
	
	//Евросиб Коханенко Н.А. 19.05.2023 (( #70111
	Если НЕ СобственныеКТК Тогда
	//Евросиб Коханенко Н.А. 19.05.2023 (( #70111
	
		Если НЕ ЗначениеЗаполнено(Локация) Тогда
			Если ЕстьНезаполненныеРеквизиты Тогда
				ТекстНезаполненныеРеквизиты = ТекстНезаполненныеРеквизиты+", ";
			КонецЕсли;
			ТекстНезаполненныеРеквизиты = ТекстНезаполненныеРеквизиты+"Локация взятия";
			ЕстьНезаполненныеРеквизиты = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ЛокацияСдачи) Тогда
			Если ЕстьНезаполненныеРеквизиты Тогда
				ТекстНезаполненныеРеквизиты = ТекстНезаполненныеРеквизиты+", ";
			КонецЕсли;
			//ДИТ Шевченко А.В. US 98893 ТА 100521 03.02.2025
			//ТекстНезаполненныеРеквизиты = ТекстНезаполненныеРеквизиты+"Локация сдачи";
			ТекстНезаполненныеРеквизиты = ТекстНезаполненныеРеквизиты+"Страна сдачи";
			//ДИТ Шевченко А.В. US 98893 ТА 100521 03.02.2025
			ЕстьНезаполненныеРеквизиты = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НачалоДействия) ИЛИ НЕ ЗначениеЗаполнено(ОкончаниеДействия) Тогда
			Если ЕстьНезаполненныеРеквизиты Тогда
				ТекстНезаполненныеРеквизиты = ТекстНезаполненныеРеквизиты+", ";
			КонецЕсли;
			ТекстНезаполненныеРеквизиты = ТекстНезаполненныеРеквизиты+"Период действия";
			ЕстьНезаполненныеРеквизиты = Истина;
		КонецЕсли;
		//Если НЕ ЗначениеЗаполнено(ОкончаниеДействия) Тогда
		//	Если ЕстьНезаполненныеРеквизиты Тогда
		//		ТекстНезаполненныеРеквизиты = ТекстНезаполненныеРеквизиты+", ";
		//	КонецЕсли;
		//	ТекстНезаполненныеРеквизиты = ТекстНезаполненныеРеквизиты+"Период действия";
		//	ЕстьНезаполненныеРеквизиты = Истина;
		//КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Договор) Тогда
			Если ЕстьНезаполненныеРеквизиты Тогда
				ТекстНезаполненныеРеквизиты = ТекстНезаполненныеРеквизиты+", ";
			КонецЕсли;
			ТекстНезаполненныеРеквизиты = ТекстНезаполненныеРеквизиты+"Договор";
			ЕстьНезаполненныеРеквизиты = Истина;
		КонецЕсли;
		
	//Евросиб Коханенко Н.А. 19.05.2023 (( #70111
	КонецЕсли;
	//Евросиб Коханенко Н.А. 19.05.2023 )) #70111
	
	Если НЕ ЗначениеЗаполнено(НомерДокумента) Тогда
		//ДИТ Шевченко А.В. US 98893 ТА 100521 03.02.2025
		Если ЕстьНезаполненныеРеквизиты Тогда
			ТекстНезаполненныеРеквизиты = ТекстНезаполненныеРеквизиты+", ";
		КонецЕсли;
		//ДИТ Шевченко А.В. US 98893 ТА 100521 03.02.2025
		ТекстНезаполненныеРеквизиты = ТекстНезаполненныеРеквизиты+"Номер релиза";
		ЕстьНезаполненныеРеквизиты = Истина;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Если ЕстьНезаполненныеРеквизиты Тогда
			ТекстНезаполненныеРеквизиты = ТекстНезаполненныеРеквизиты+", ";
		КонецЕсли;
		ТекстНезаполненныеРеквизиты = ТекстНезаполненныеРеквизиты+"Релиз от";
		ЕстьНезаполненныеРеквизиты = Истина;
	КонецЕсли;
	
	// Евросиб Фролов (23.11.2021 Ticket№ 0251291, закомментировал проверку
	// Беккер: Необходимо в документе «Релиз собственника» отключить обязательность заполнения (для проведения документа) поля «Протокол».
	//Если НЕ ЗначениеЗаполнено(ПСЦ) Тогда
	//	Если ЕстьНезаполненныеРеквизиты Тогда
	//		ТекстНезаполненныеРеквизиты = ТекстНезаполненныеРеквизиты+", ";
	//	КонецЕсли;
	//	ТекстНезаполненныеРеквизиты = ТекстНезаполненныеРеквизиты+"Протокол";
	//	ЕстьНезаполненныеРеквизиты = Истина;
	//КонецЕсли;
	// Евросиб Фролов)   
	
	// ДИТ US 76956 ТА 76966 Сержантова А.С. Начало: 02.11.2023
	Если Номинации.Количество() = 0 Тогда  
		Если ЕстьНезаполненныеРеквизиты Тогда
			ТекстНезаполненныеРеквизиты = ТекстНезаполненныеРеквизиты+", ";
		КонецЕсли;
		ТекстНезаполненныеРеквизиты = ТекстНезаполненныеРеквизиты+"таблица Номинации";
		ЕстьНезаполненныеРеквизиты = Истина;
	КонецЕсли;
	// ДИТ US 76956 ТА 76966 Сержантова А.С. Конец: 02.11.2023

	Для каждого СтрокаНоминации из Номинации Цикл
		ТекстНезаполненныеРеквизитыТЧСтрока = "";
		
		//Евросиб Коханенко Н.А. 22.05.2023 (( #70111
		Если НЕ СобственныеКТК Тогда
		//Евросиб Коханенко Н.А. 22.05.2023 )) #70111 
			
			//проверка незаполненности сроков возврата
			Если НЕ ЗначениеЗаполнено(СтрокаНоминации.НормативВозврата) Тогда
				Если ЕстьНезаполненныеРеквизиты Тогда
					ТекстНезаполненныеРеквизитыТЧСтрока = ТекстНезаполненныеРеквизитыТЧСтрока+", ";
				КонецЕсли;
				ТекстНезаполненныеРеквизитыТЧСтрока = ТекстНезаполненныеРеквизитыТЧСтрока+"Срок возврата (сут.)";
				ЕстьНезаполненныеРеквизиты = Истина;
			КонецЕсли;
			//проверка незаполненности валюты
			Если НЕ ЗначениеЗаполнено(СтрокаНоминации.Валюта) Тогда
				Если ЕстьНезаполненныеРеквизиты Тогда
					ТекстНезаполненныеРеквизитыТЧСтрока = ТекстНезаполненныеРеквизитыТЧСтрока+", ";
				КонецЕсли;
				ТекстНезаполненныеРеквизитыТЧСтрока = ТекстНезаполненныеРеквизитыТЧСтрока+"Валюта";
				ЕстьНезаполненныеРеквизиты = Истина;
			КонецЕсли; 
			//проверка незаполненности ставки СНП
			ПОтбора = Новый Структура("ГУИДСтроки",СтрокаНоминации.ГУИДСтроки);
			СтрокиСНП = СНП.НайтиСтроки(ПОтбора);
			Если СтрокиСНП.Количество()=0 Тогда
				Если ЕстьНезаполненныеРеквизиты Тогда
					ТекстНезаполненныеРеквизитыТЧСтрока = ТекстНезаполненныеРеквизитыТЧСтрока+", ";
				КонецЕсли;
				ТекстНезаполненныеРеквизитыТЧСтрока = ТекстНезаполненныеРеквизитыТЧСтрока+"Ставка СНП";
				ЕстьНезаполненныеРеквизиты = Истина;	
			КонецЕсли; 
			
		//Евросиб Коханенко Н.А. 22.05.2023 (( #70111 
		КонецЕсли;
		//Евросиб Коханенко Н.А. 22.05.2023 )) #70111 
	
		Если НЕ ЗначениеЗаполнено(СтрокаНоминации.ТипКТК) Тогда
			Если ЕстьНезаполненныеРеквизиты Тогда
				ТекстНезаполненныеРеквизитыТЧСтрока = ТекстНезаполненныеРеквизитыТЧСтрока+", ";
			КонецЕсли;
			ТекстНезаполненныеРеквизитыТЧСтрока = ТекстНезаполненныеРеквизитыТЧСтрока+"Типоразмер КТК";
			ЕстьНезаполненныеРеквизиты = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаНоминации.тек_СобственностьКТК) Тогда
			Если ЕстьНезаполненныеРеквизиты Тогда
				ТекстНезаполненныеРеквизитыТЧСтрока = ТекстНезаполненныеРеквизитыТЧСтрока+", ";
			КонецЕсли;
			ТекстНезаполненныеРеквизитыТЧСтрока = ТекстНезаполненныеРеквизитыТЧСтрока+"Вид собственности";
			ЕстьНезаполненныеРеквизиты = Истина;
		КонецЕсли;
		//++ Зубов US 45162 TA 45703 21.01.2022
		////++ Зубов US 33131 TA 43877 15.12.2021
		////Если НЕ ЗначениеЗаполнено(СтрокаНоминации.Ставка) Тогда
		//Если НЕ ЗначениеЗаполнено(СтрокаНоминации.Ставка) И НЕ МорскиеКТК Тогда
		////++ Зубов US 33131 TA 43877 15.12.2021
		//	Если ЕстьНезаполненныеРеквизиты Тогда
		//		ТекстНезаполненныеРеквизитыТЧСтрока = ТекстНезаполненныеРеквизитыТЧСтрока+", ";
		//	КонецЕсли;
		//	ТекстНезаполненныеРеквизитыТЧСтрока = ТекстНезаполненныеРеквизитыТЧСтрока+"Ставка";
		//	ЕстьНезаполненныеРеквизиты = Истина;
		//КонецЕсли;
		//-- Зубов US 45162 TA 45703 21.01.2022
		Если НЕ ТекстНезаполненныеРеквизитыТЧСтрока = "" Тогда
			ТекстНезаполненныеРеквизитыТЧ = ТекстНезаполненныеРеквизитыТЧ+"По строке "+СтрокаНоминации.НомерСтроки+": "+ТекстНезаполненныеРеквизитыТЧСтрока+Символы.ПС;
		КонецЕсли;
	КонецЦикла; 
	
	Если НЕ ТекстНезаполненныеРеквизиты = "" Тогда
		Сообщить("В документе есть незаполненные реквизиты: "+ТекстНезаполненныеРеквизиты+". Проведение невозможно!");
	КонецЕсли;
	Если НЕ ТекстНезаполненныеРеквизитыТЧ = "" Тогда
		Сообщить("В табличной части документа есть незаполненные реквизиты. Проведение невозможно!");
		Сообщить(ТекстНезаполненныеРеквизитыТЧ);
	КонецЕсли;
	Возврат ЕстьНезаполненныеРеквизиты;
КонецФункции

//ДИТ Авдеева В.С. 0281647 07.09.2022 Начало  
//перенесен в форму документа
//Функция ПроверитьНезакрытыеЦиклыКонтейнеров() 
//	ЕстьНезакрытыеЦиклы = Ложь;
//	Для каждого СтрокаНоминации из Номинации Цикл
//		Если ЗначениеЗаполнено(СтрокаНоминации.Контейнер) Тогда
//	
//			Запрос = Новый Запрос;
//			Запрос.Текст = 
//				"ВЫБРАТЬ
//				|	стоки_ТекущиеДанныеСрезПоследних.тек_ДатаПриемаВПользование КАК тек_ДатаПриемаВПользование,
//				|	стоки_ТекущиеДанныеСрезПоследних.тек_ДатаСдачиВСток КАК тек_ДатаСдачиВСток
//				|ИЗ
//				|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(
//				|			&ДатаДокумента,
//				|			КТК = &Контейнер
//				|				И НЕ тек_Релиз = &Релиз) КАК стоки_ТекущиеДанныеСрезПоследних";
//			
//			Запрос.УстановитьПараметр("ДатаДокумента", ТекущаяДата());
//			Запрос.УстановитьПараметр("Контейнер", СтрокаНоминации.Контейнер);
//			Запрос.УстановитьПараметр("Релиз", Ссылка);
//			
//			РезультатЗапроса = Запрос.Выполнить();
//			
//			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//			
//			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.тек_ДатаПриемаВПользование) И НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.тек_ДатаСдачиВСток) Тогда
//					ЕстьНезакрытыеЦиклы = Истина;
//					Сообщить("Необходимо закрыть предыдущий цикл пользования контейнером "+СтрокаНоминации.Контейнер+" перед внесением его номера в карточку релиза");
//				КонецЕсли;
//			КонецЦикла;

//		КонецЕсли;
//	КонецЦикла;
//	
//	Возврат ЕстьНезакрытыеЦиклы;
//КонецФункции      
//ДИТ Авдеева В.С. 0281647 07.09.2022 Конец  

//-- Зубов US 33131 TA 38910 27.10.2021

//++ Зубов US 33131 TA 38910 01.11.2021
Процедура ОбработкаУдаленияПроведения(Отказ)
	//++ Зубов US 33131 TA 43877 16.12.2021
	//ЕстьСтрокаСКТК = Ложь;
	//Для каждого СТрокаНоминации из Номинации Цикл
	//	Если ЗначениеЗаполнено(СТрокаНоминации.Контейнер) Тогда
	//		ЕстьСтрокаСКТК = Истина;
	//	КонецЕсли;
	//КонецЦикла;
	//Если НЕ РольДоступна("ПолныеПрава") И ЕстьСтрокаСКТК Тогда
	//	Отказ = Истина;
	//	Сообщить("Запрещена отмена проведения документа с номерными КТК!");
	//КонецЕсли;
	// Евросиб US 104907 TA 105520 Рыбьяков К.А. 01.04.2025 ((
	ЗапретУдаленияПриНаличииКТКВЭксплуатации(Отказ);
	Документы.РелизСобственника.УдалитьЗаписиРегистров(Истина, ЭтотОбъект);
	// Евросиб Рыбьяков К.А. 01.04.2025 ))
	
	//-- Зубов US 33131 TA 43877 16.12.2021
КонецПроцедуры

Функция ПолучитьСтатусКТК(Контейнер,ДатаАктуальности)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	стоки_ТекущиеДанныеСрезПоследних.тек_Статус КАК тек_Статус
		|ИЗ
		|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(&ДатаАктуальности, КТК = &Контейнер) КАК стоки_ТекущиеДанныеСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.УстановитьПараметр("Контейнер", Контейнер);
	
	РезультатЗапроса = Запрос.Выполнить();  
	
	// Евросиб(ДИТ) BUG 99736 ТА 99737 Сержантова А.С. Начало: 21.01.2025
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	КонецЕсли;
	// Евросиб(ДИТ) BUG 99736 ТА 99737 Сержантова А.С. Конец: 21.01.2025
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.тек_Статус = Перечисления.СтатусыКТК.Возвращен ИЛИ НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.тек_Статус);
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции 

//Евросиб(ДИТ), Беляев СЮ, BUG 94917 / TA 96390, 27-11-2024, начало (закомментировал, не используется)
//Функция ЦиклЗакрыт(Контейнер,ДатаАктуальности)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	стоки_ТекущиеДанные.ПорядковыйНомерЦиклаАрендыКТК КАК ПорядковыйНомерЦиклаАрендыКТК
//		|ИЗ
//		|	РегистрСведений.стоки_ТекущиеДанные КАК стоки_ТекущиеДанные
//		|ГДЕ
//		|	стоки_ТекущиеДанные.тек_Релиз = &тек_Релиз
//		|	И стоки_ТекущиеДанные.КТК = &Контейнер";
//	
//	Запрос.УстановитьПараметр("Контейнер", Контейнер);
//	Запрос.УстановитьПараметр("тек_Релиз", Ссылка);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
//		ПорядковыйНомерЦикла = ВыборкаДетальныеЗаписи.ПорядковыйНомерЦиклаАрендыКТК;
//	КонецЕсли;
//	
//	Если ПорядковыйНомерЦикла = Неопределено Тогда
//		Возврат Ложь;
//	Иначе
//		Запрос = Новый Запрос;
//		Запрос.Текст = 
//			"ВЫБРАТЬ
//			|	стоки_ТекущиеДанные.ГУИДЗаписи КАК ГУИДЗаписи
//			|ИЗ
//			|	РегистрСведений.стоки_ТекущиеДанные КАК стоки_ТекущиеДанные
//			|ГДЕ
//			|	стоки_ТекущиеДанные.Период >= &ДатаАктуальности
//			|	И стоки_ТекущиеДанные.ПорядковыйНомерЦиклаАрендыКТК > &ПорядковыйНомерЦикла
//			|	И стоки_ТекущиеДанные.КТК = &Контейнер";
//		
//		Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
//		Запрос.УстановитьПараметр("Контейнер", Контейнер);
//		Запрос.УстановитьПараметр("ПорядковыйНомерЦикла", ПорядковыйНомерЦикла);
//		
//		РезультатЗапроса = Запрос.Выполнить();
//		
//		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//		
//		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
//			Возврат Истина;
//		Иначе
//			Возврат Ложь;
//		КонецЕсли;
//	КонецЕсли;
//	
//КонецФункции
//-- Зубов US 33131 TA 38910 01.11.2021
//Евросиб(ДИТ), Беляев СЮ, BUG 94917 / TA 96390, 27-11-2024, конец

//++ Зубов Ticket#0250132 15.11.2021
Процедура ПриЗаписи(Отказ)
	Если Не Отказ Тогда
		МассивКонтейнеров = Номинации.ВыгрузитьКолонку("Контейнер");
		РаботаСКонтейнерамиСервер.ДобавитьИнформациюОбИсточникеСозднияКонтейнеров(МассивКонтейнеров, Ссылка); 
		//Евросиб Коханенко Н.А. 02.04.2024 (( #80513 
		//ЗаполнитьРегистрСвязанныеОбъектыПоРелизуСобственника(); // Рыбьяков К.А. Перенес в общий модуль СвязанныеДокументыСервер
		//Евросиб Коханенко Н.А. 02.04.2024 )) #80513 
		//Евросиб СубботинВ #131884 02.03.2026 Начало
		Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ 
			|	РелизСобственникаИзменения.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.РелизСобственника.Изменения КАК РелизСобственникаИзменения
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
			|		ПО РелизСобственникаИзменения.Ссылка = ПротоколОбменов.Объект
			|			И (ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
			|			И (ПротоколОбменов.УзелОбмена = &УзелОбмена)
			|			И (ПротоколОбменов.ЗагрузкаПодтверждена)
			|ГДЕ 
			|	РелизСобственникаИзменения.Ссылка = &Ссылка
			|		И ВЫБОР
			|			КОГДА ЕСТЬNULL(ПротоколОбменов.ЗагрузкаПодтверждена, ЛОЖЬ) = Истина
			|				ТОГДА РелизСобственникаИзменения.Ссылка.Проведен
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ";
			
			Запрос.УстановитьПараметр("УзелОбмена", Перечисления.УзлыОбмена.DX);
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			РезультатЗапроса = Запрос.Выполнить();			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда				
				ПланыОбмена.ВыгрузкаДанных.УдалитьРегистрациюИзменений(Ссылка, Перечисления.УзлыОбмена.DX); 
			КонецЕсли;
		ИначеЕсли ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда			
			// Евросиб(ДИТ) US 86002 ТА 87080 Сержантова А.С. Начало: 29.07.2024  
			ПланыОбмена.ВыгрузкаДанных.ЗарегистрироватьИзмененияПоДокументу(Ссылка, Перечисления.УзлыОбмена.DX);
			// Евросиб(ДИТ) US 86002 ТА 87080 Сержантова А.С. Конец: 29.07.2024
			//Евросиб СубботинВ #131884 02.03.2026 Начало
		КонецЕсли;
		//Евросиб СубботинВ #131884 02.03.2026 Конец

		// Евросиб US 114211 TA 114223 Рыбьяков К.А. 14.07.2025 ((
		Для Каждого СтрокаНоминации Из Номинации Цикл
			РеквизитыКлюча = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаНоминации.КлючАналитики, "Контейнер, РелизСобственника");
			Если СтрокаНоминации.Контейнер <> РеквизитыКлюча.Контейнер 
				Или Ссылка <> РеквизитыКлюча.РелизСобственника Тогда
				Параметры = Новый Структура;
				Параметры.Вставить("РелизСобственника", Ссылка);
				Параметры.Вставить("Контейнер", СтрокаНоминации.Контейнер);
				КлючАналитикиОбъект = СтрокаНоминации.КлючАналитики.ПолучитьОбъект();
				Документы.РелизСобственника.ОбновитьРеквизитКлючаАналитики(КлючАналитикиОбъект, Параметры);
			КонецЕсли;
		КонецЦикла;
		// Евросиб Рыбьяков К.А. 14.07.2025 ))
	КонецЕсли;
	
	// Евросиб US 95138 TA 89887 Рыбьяков К.А. 14.11.2024 ((
	РеквизитыРелиза = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ПСЦ, ПометкаУдаления");
	Если ТипЗнч(РеквизитыРелиза.ПСЦ) = Тип("ДокументСсылка.ПСЦПоставщика")
		И РеквизитыРелиза.ПометкаУдаления Тогда
		СвязанныеДокументыСервер.УдалитьСвязи(РеквизитыРелиза.ПСЦ, Ссылка);
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 14.11.2024 ))
	
	//Евросиб(ДИТ), Беляев СЮ, BUG 97038 / TA 97047, 06-12-2024, начало
	ЗаписатьДатыИзготовленияКТКвКонтейнеры();
	//Евросиб(ДИТ), Беляев СЮ, BUG 97038 / TA 97047, 06-12-2024, конец
	
КонецПроцедуры
//-- Зубов Ticket#0250132 15.11.2021

//Евросиб(ДИТ), Беляев СЮ, BUG 97038 / TA 97047, 06-12-2024, начало
Процедура ЗаписатьДатыИзготовленияКТКвКонтейнеры()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номинации.Контейнер КАК Контейнер,
		|	Номинации.ДатаИзготовленияКТК КАК ДатаИзготовленияКТК
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&Номинации КАК Номинации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Контейнер КАК Контейнер,
		|	ВТ.ДатаИзготовленияКТК КАК ДатаИзготовленияКТК
		|ИЗ
		|	ВТ КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
		|		ПО ВТ.Контейнер = ТЕ.Ссылка
		|			И ВТ.ДатаИзготовленияКТК <> ТЕ.ДатаИзготовленияКТК
		|ГДЕ
		|	ВТ.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|	И ВТ.ДатаИзготовленияКТК <> ДАТАВРЕМЯ(1, 1, 1)";
	
	Запрос.УстановитьПараметр("Номинации", Номинации.Выгрузить(,"Контейнер,ДатаИзготовленияКТК"));
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СправочникКонтейнер = ВыборкаДетальныеЗаписи.Контейнер.ПолучитьОбъект();
		СправочникКонтейнер.ДатаИзготовленияКТК = ВыборкаДетальныеЗаписи.ДатаИзготовленияКТК;
		СправочникКонтейнер.УстановитьКомментарийВерсииИсторииДанных("Запись из Релиза собственника "+Номер + " от "+Дата);
		СправочникКонтейнер.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, BUG 97038 / TA 97047, 06-12-2024, конец

Процедура АктуализироватьРелизКлиента(Отказ)
	
	// Евросиб Фролов (30.05.2022 Task №49741
	// Если запись инициирована из релиза клиента, то релиз клиента не обновляем.
	Если ДополнительныеСвойства.Свойство("ЗаписьИзРелизаКлиента") Тогда
		Возврат;
	КонецЕсли;	
	// Евросиб Фролов)
	
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	
	// Перезаполняем и проводим релизы клиента (только если они не помечены на удаление).

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РелизКлиента.Ссылка КАК РелизКлиента,
	|	РелизКлиента.ЛокацияВыдачи КАК ЛокацияВыдачи,
	|	РелизКлиента.СтокВыдачи КАК СтокВыдачи,
	|	РелизКлиента.СобственникКТК КАК СобственникКТК,
	|	РелизКлиента.Заявка КАК Заявка,
	|	РелизКлиента.Контейнеры.(
	//|		Контейнер КАК Контейнер,
	|       КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
	|		ВидСобственности КАК ВидСобственности,
	//|		ДатаВывоза КАК ДатаВывоза,
	|		ИдентификаторСтроки КАК ИдентификаторСтроки,
	|		ТипоразмерКТК КАК ТипоразмерКТК
	|	) КАК Контейнеры
	|ИЗ
	|	Документ.РелизКлиента КАК РелизКлиента
	|ГДЕ
	|	РелизКлиента.РелизСобственника = &РелизСобственника
	|	И РелизКлиента.ПометкаУдаления = ЛОЖЬ";
		
	Запрос.УстановитьПараметр("РелизСобственника", Ссылка);
		
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ТаблицаНоминаций = Документы.РелизСобственника.КонтейнерыРелизаСобственника(Ссылка);
	
	Пока Выборка.Следующий() Цикл
		
	//ТаблицаКТКРелизаКлиента = Выборка.Контейнеры.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	ТЗ.ВидСобственности КАК ВидСобственности,
		|	ТЗ.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ТЗ.ТипоразмерКТК КАК ТипоразмерКТК
		|ПОМЕСТИТЬ ВТ_ТЗ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТЗ.ВидСобственности КАК ВидСобственности,
		|	ВТ_ТЗ.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ВТ_ТЗ.ТипоразмерКТК КАК ТипоразмерКТК,
		|	КлючиАналитикиПеревозкиМили.Ссылка.Контейнер КАК Контейнер,
		|	КлючиАналитикиПеревозкиМили.ДатаВыдачиКТКСТерминала КАК ДатаВывоза
		|ИЗ
		|	ВТ_ТЗ КАК ВТ_ТЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
		|		ПО ВТ_ТЗ.КлючАналитикиПеревозки = КлючиАналитикиПеревозкиМили.Ссылка";
	Запрос.УстановитьПараметр("ТЗ",Выборка.Контейнеры.Выгрузить());
	ТаблицаКТКРелизаКлиента = Запрос.Выполнить().Выгрузить();
		
		ТаблицаКТКРелизаСобственника = ТаблицаКТКРелизаКлиента.СкопироватьКолонки();
		Для Каждого СтрокаКТК Из ТаблицаНоминаций Цикл
			Если СтрокаКТК.РелизКлиента = Выборка.РелизКлиента
				ИЛИ СтрокаКТК.РелизКлиента = Документы.РелизКлиента.ПустаяСсылка() Тогда
				ЗаполнитьЗначенияСвойств(ТаблицаКТКРелизаСобственника.Добавить(), СтрокаКТК);
			КонецЕсли;
		КонецЦикла;
		
		// ++ ДИТ_Агафонов_task 50388 24.06.2022
		//Убираем в коммент
		//ТаблицыИдентичны = ОбщегоНазначения.КоллекцииИдентичны(ТаблицаКТКРелизаКлиента, ТаблицаКТКРелизаСобственника, "Контейнер, ВидСобственности, ДатаВывоза");
		//Меняем на поиск только не соответсвий ВидСобственности 	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТаблицаКТКРелизаСобственника.Контейнер КАК Контейнер,
		               |	ТаблицаКТКРелизаСобственника.ВидСобственности КАК ВидСобственности
		               |ПОМЕСТИТЬ ТаблицаКТКРелизаСобственника
		               |ИЗ
		               |	&ТаблицаКТКРелизаСобственника КАК ТаблицаКТКРелизаСобственника
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаКТКРелизаКлиента.Контейнер КАК Контейнер,
		               |	ТаблицаКТКРелизаКлиента.ВидСобственности КАК ВидСобственности
		               |ПОМЕСТИТЬ ТаблицаКТКРелизаКлиента
		               |ИЗ
		               |	&ТаблицаКТКРелизаКлиента КАК ТаблицаКТКРелизаКлиента
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаКТКРелизаКлиента.Контейнер КАК Контейнер,
		               |	ТаблицаКТКРелизаКлиента.ВидСобственности КАК ВидСобственности,
		               |	ТаблицаКТКРелизаСобственника.Контейнер КАК Контейнер1,
		               |	ТаблицаКТКРелизаСобственника.ВидСобственности КАК ВидСобственности1
		               |ИЗ
		               |	ТаблицаКТКРелизаКлиента КАК ТаблицаКТКРелизаКлиента
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаКТКРелизаСобственника КАК ТаблицаКТКРелизаСобственника
		               |		ПО ТаблицаКТКРелизаКлиента.Контейнер = ТаблицаКТКРелизаСобственника.Контейнер
		               |ГДЕ
		               |	ТаблицаКТКРелизаКлиента.ВидСобственности <> ТаблицаКТКРелизаСобственника.ВидСобственности";
		
		Запрос.УстановитьПараметр("ТаблицаКТКРелизаКлиента", ТаблицаКТКРелизаКлиента);
		Запрос.УстановитьПараметр("ТаблицаКТКРелизаСобственника", ТаблицаКТКРелизаСобственника);
		
		Результат = Запрос.Выполнить();
		ТаблицыИдентичны = Результат.Пустой();
		//Дальше уже есть изменения в процедуре ЗаполнитьРелизКлиентаПоРелизуСобственника
		// -- ДИТ_Агафонов_task 50388 24.06.2022
		
		Если Контрагент <> Выборка.СобственникКТК
			// ++ ДИТ_Агафонов_task 50388 24.06.2022
			//Убираем в коммент, эти поля уже не обновляются в ЗаполнитьРелизКлиентаПоРелизуСобственника 
			//ИЛИ Сток <> Выборка.СтокВыдачи
			//ИЛИ Локация <> Выборка.ЛокацияВыдачи
			// -- ДИТ_Агафонов_task 50388 24.06.2022
			ИЛИ НЕ ТаблицыИдентичны Тогда
			
			// Евросиб Фролов (30.05.2022 Task №49741
			// Убрана проверка
			// Если в релизе клиента есть контейнеры, которые добавлены в заявку, но их нет в релизе собственника,
			// то такие контейнеры должны быть удалены в релизе клиента вручную.
			//ПроверитьКонтейнеры(ТаблицаКТКРелизаКлиента, ТаблицаКТКРелизаСобственника, Выборка.Заявка, Выборка.РелизКлиента, Отказ);
			// Евросиб Фролов)	
			Если Отказ Тогда
				Продолжить;
			КонецЕсли;	
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Документ.РелизКлиента");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.РелизКлиента);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			ДокументОбъект = Выборка.РелизКлиента.ПолучитьОбъект();
			Документы.РелизКлиента.ЗаполнитьРелизКлиентаПоРелизуСобственника(ДокументОбъект, ТаблицаКТКРелизаСобственника);			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			// В таблице значений "ТаблицаНоминаций" могут быть КТК без релиза клиента.
			// Такие строки будут привязаны к релизу клиента при первом проходе цикла.
			// Поэтому в строках, в которых не проставлен релиз клиента, заполним релиз клиента значением "Выборка.РелизКлиента"
			// (при втором и последующих проходах цикла строк с пустым релизом клиента не будет).
			СтрокиБезРелизаКлиента = ТаблицаНоминаций.НайтиСтроки(Новый Структура("РелизКлиента", Документы.РелизКлиента.ПустаяСсылка()));
			Для Каждого СтрокаБезРелизаКлиента Из СтрокиБезРелизаКлиента Цикл
				СтрокаБезРелизаКлиента.РелизКлиента = Выборка.РелизКлиента; 
			КонецЦикла;	
			
		КонецЕсли;	
	
	КонецЦикла;
	
	// Евросиб Фролов)
КонецПроцедуры

// Евросиб Фролов (30.05.2022 Task №49741
// Проверка в данной процедуре удалена
#Область ПроверитьКонтейнеры
//Процедура ПроверитьКонтейнеры(ТаблицаКТКРелизаКлиента, ТаблицаКТКРелизаСобственника, ЗаявкаКлиента, РелизКлиента, Отказ)
//	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
//	Если Не ЗначениеЗаполнено(ЗаявкаКлиента) Тогда
//		Возврат;
//	КонецЕсли;	
//	
//	ТекстЗапроса =
//	"ВЫБРАТЬ
//	|	Контейнеры.Контейнер КАК Контейнер,
//	|	Контейнеры.ВидСобственности КАК ВидСобственности,
//	|	Контейнеры.ДатаВывоза КАК ДатаВывоза,
//	|	Контейнеры.ИдентификаторСтроки КАК ИдентификаторСтроки
//	|ПОМЕСТИТЬ втКонтейнерыРелизаКлиента
//	|ИЗ
//	|	&КонтейнерыРелизаКлиента КАК Контейнеры
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	Контейнеры.Контейнер КАК Контейнер,
//	|	Контейнеры.ВидСобственности КАК ВидСобственности,
//	|	Контейнеры.ДатаВывоза КАК ДатаВывоза
//	|ПОМЕСТИТЬ втКонтейнерыРелизаСобственника
//	|ИЗ
//	|	&КонтейнерыРелизаСобственника КАК Контейнеры
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	втКонтейнерыРелизаКлиента.Контейнер КАК Контейнер,
//	|	втКонтейнерыРелизаКлиента.ВидСобственности КАК ВидСобственности,
//	|	втКонтейнерыРелизаКлиента.ДатаВывоза КАК ДатаВывоза,
//	|	втКонтейнерыРелизаКлиента.ИдентификаторСтроки КАК ИдентификаторСтроки
//	|ПОМЕСТИТЬ втОтсутствующиеКТК
//	|ИЗ
//	|	втКонтейнерыРелизаКлиента КАК втКонтейнерыРелизаКлиента
//	|		ПОЛНОЕ СОЕДИНЕНИЕ втКонтейнерыРелизаСобственника КАК втКонтейнерыРелизаСобственника
//	|		ПО втКонтейнерыРелизаКлиента.Контейнер = втКонтейнерыРелизаСобственника.Контейнер
//	|ГДЕ
//	|	втКонтейнерыРелизаСобственника.Контейнер ЕСТЬ NULL
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	втОтсутствующиеКТК.Контейнер КАК Контейнер,
//	|	втОтсутствующиеКТК.ВидСобственности КАК ВидСобственности,
//	|	втОтсутствующиеКТК.ДатаВывоза КАК ДатаВывоза,
//	|	втОтсутствующиеКТК.ИдентификаторСтроки КАК ИдентификаторСтроки
//	|ИЗ
//	|	втОтсутствующиеКТК КАК втОтсутствующиеКТК
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
//	|		ПО втОтсутствующиеКТК.ИдентификаторСтроки = ЗаявкаСоставУслуги.ИдентификаторСтрокиРелизаКлиента
//	|			И (ЗаявкаСоставУслуги.Ссылка = &ЗаявкаКлиента)";
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = ТекстЗапроса;
//	
//	Запрос.УстановитьПараметр("КонтейнерыРелизаКлиента", 		ТаблицаКТКРелизаКлиента);
//	Запрос.УстановитьПараметр("КонтейнерыРелизаСобственника", 	ТаблицаКТКРелизаСобственника);
//	Запрос.УстановитьПараметр("ЗаявкаКлиента", 					ЗаявкаКлиента);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Если Не РезультатЗапроса.Пустой() Тогда
//		
//		Выборка = РезультатЗапроса.Выбрать();
//		
//		Пока Выборка.Следующий() Цикл
//			ШаблонСообщения = "Контейнер %1 отсутствует в релизе собственника, но добавлен из релиза клиента %2 в заявку %3.
//								|Необходимо удалить контейнер из заявки перед проведением документа.";
//			ТекстСообщения = СтрШаблон(ШаблонСообщения, Выборка.Контейнер, РелизКлиента, ЗаявкаКлиента);
//			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
//		КонецЦикла;	
//		
//	КонецЕсли;	
//	// Евросиб Фролов)
//КонецПроцедуры		
#КонецОбласти 

//++ Зубов US 33131 TA 43877 16.12.2021
Процедура ОчиститьЗаписиУдаленныхСтрок()
	Отказ = Ложь;
	МассивКТК = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	стоки_ТекущиеДанныеСрезПоследних.ПорядковыйНомерЦиклаАрендыКТК КАК ПорядковыйНомерЦиклаАрендыКТК,
		|	стоки_ТекущиеДанныеСрезПоследних.КТК КАК КТК
		|ПОМЕСТИТЬ НомерЦикла
		|ИЗ
		|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(
		|			&Дата,
		|			тек_Релиз = &Релиз
		|				И НЕ КТК В (&СписокКТК)) КАК стоки_ТекущиеДанныеСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	стоки_ТекущиеДанные.ГУИДЗаписи КАК ГУИДЗаписи,
		|	НомерЦикла.КТК КАК КТК,
		|	стоки_ТекущиеДанные.ИсточникЗаписи КАК ИсточникЗаписи
		|ИЗ
		|	НомерЦикла КАК НомерЦикла
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные КАК стоки_ТекущиеДанные
		|		ПО НомерЦикла.КТК = стоки_ТекущиеДанные.КТК
		|			И НомерЦикла.ПорядковыйНомерЦиклаАрендыКТК = стоки_ТекущиеДанные.ПорядковыйНомерЦиклаАрендыКТК
		|ГДЕ
		//ДИТ Авдеева В.С. 53975 16.08.2022 Начало 
		|	стоки_ТекущиеДанные.Период >= &ДатаНачалаДействияРелиза И
		//ДИТ Авдеева В.С. 53975 16.08.2022 Конец 
		//|	стоки_ТекущиеДанные.ИсточникЗаписи ПОДОБНО ""%Заявка%""";
		//ДИТ, Беляев СЮ, Ticket#0323876, 11-09-2023, начало
		|	стоки_ТекущиеДанные.ИсточникЗаписи ПОДОБНО ""Заявка %""";
		//ДИТ, Беляев СЮ, Ticket#0323876, 11-09-2023, конец
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("Релиз", Ссылка);
	Запрос.УстановитьПараметр("СписокКТК", Номинации.ВыгрузитьКолонку("Контейнер"));
	//ДИТ Авдеева В.С. 53975 16.08.2022 Начало 
	Запрос.УстановитьПараметр("ДатаНачалаДействияРелиза", НачалоДействия);
	//ДИТ Авдеева В.С. 53975 16.08.2022 Конец 
	
	РезультатЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса[1].Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Сообщить("КТК "+ВыборкаДетальныеЗаписи.КТК+" выдан клиенту по "+ВыборкаДетальныеЗаписи.ИсточникЗаписи+". Отмена проведения невозможна.");
			Отказ = Истина;
	КонецЦикла;
	
	Если НЕ Отказ Тогда
		ВыборкаКТК = РезультатЗапроса[0].Выбрать();
		Пока ВыборкаКТК.Следующий() Цикл
			МассивКТК.Добавить(ВыборкаКТК.КТК);
		КонецЦикла;  
		//Евросиб(ДИТ) Антонова А.С. US 77172 ТА 103142 Начало 12.03.2025
		ЭтотОбъект.ДополнительныеСвойства.Вставить("УдаленныеКТК", МассивКТК); 
		//Евросиб(ДИТ) Антонова А.С. US 77172 ТА 103142 Конец 12.03.2025
		МассивПериодов = Новый Массив;
		Для каждого ЭлементМассива из МассивКТК Цикл
			СтокиТекущиеДанные = РегистрыСведений.стоки_ТекущиеДанные.СоздатьНаборЗаписей();
			СтокиТекущиеДанные.Отбор.КТК.Установить(ЭлементМассива);
			СтокиТекущиеДанные.Прочитать();			
			МассивСтрокКУдалению = Новый Массив;
			Для каждого ЗаписьСтокиТекущиеДанные из СтокиТекущиеДанные Цикл
				Если ЗаписьСтокиТекущиеДанные.тек_Релиз = Ссылка Тогда
					МассивПериодов.Добавить(ЗаписьСтокиТекущиеДанные.Период);
					МассивСтрокКУдалению.Добавить(ЗаписьСтокиТекущиеДанные);
				КонецЕсли;
			КонецЦикла;
			Для каждого СтрокаКУдалению из МассивСтрокКУдалению Цикл
				СтокиТекущиеДанные.Удалить(СтрокаКУдалению);
			КонецЦикла;
			СтокиТекущиеДанные.Записать();
		КонецЦикла;
		МассивГУИД = Новый Массив;	
		Для каждого ЭлементПериодов из МассивПериодов Цикл
			КлиентскоеОперирование = РегистрыСведений.стоки_КлиентскоеОперирование.СоздатьНаборЗаписей();
			КлиентскоеОперирование.Отбор.Период.Установить(ЭлементПериодов);
			КлиентскоеОперирование.Прочитать();
			Для каждого ЗаписьКлиентскоеОперирование из КлиентскоеОперирование Цикл
				МассивГУИД.Добавить(ЗаписьКлиентскоеОперирование.ГУИДЗаписи);
			КонецЦикла;
			КлиентскоеОперирование.Очистить();
			КлиентскоеОперирование.Записать();
		КонецЦикла;
		Для каждого ГУИД из МассивГУИД Цикл
			СтокиТекущиеДанныеСНП = РегистрыСведений.стоки_ТекущиеДанные_СНП.СоздатьНаборЗаписей();
			СтокиТекущиеДанныеСНП.Отбор.ГУИДЗаписи.Установить(ГУИД);
			СтокиТекущиеДанныеСНП.Очистить();
			СтокиТекущиеДанныеСНП.Записать();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
//-- Зубов US 33131 TA 43877 16.12.2021

//++ Зубов US 45162 TA 45703 21.01.2022
Функция ПроверитьНулевуюСтавку()
	ЕстьОшибки = Ложь;
	
		Для каждого Стр из Номинации Цикл
			Если Стр.тек_СобственностьКТК = Перечисления.ВариантыСобственности.Спот Тогда
				Если Стр.Ставка = 0 И НЕ Стр.НулеваяСтавка Тогда
					ЕстьОшибки = Истина;
					//Евросиб СубботинВ #102567 18.02.2025 Начало
					//Сообщить("По строке "+Стр.НомерСтроки+" заполните значение Ставки или проставьте признак Ставка = 0");
					ОбщегоНазначения.СообщитьПользователю("По строке "+Стр.НомерСтроки+" заполните значение Ставки или проставьте признак Ставка = 0",,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Номинации", Стр.НомерСтроки,"Ставка"),"Объект");
					//Евросиб СубботинВ #102567 18.02.2025 Конец
				КонецЕсли;
			Иначе
				Если Стр.Ставка = 0 Тогда
					ЕстьОшибки = Истина;
					//Евросиб СубботинВ #102567 18.02.2025 Начало
					//Сообщить("По строке "+Стр.НомерСтроки+" заполните значение Ставки");
					ОбщегоНазначения.СообщитьПользователю("По строке "+Стр.НомерСтроки+" заполните значение Ставки",,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Номинации", Стр.НомерСтроки,"Ставка"),"Объект");
					//Евросиб СубботинВ #102567 18.02.2025 Конец
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

	Возврат ЕстьОшибки;
КонецФункции
//-- Зубов US 45162 TA 45703 21.01.2022   

// ++ ДИТ_Агафонов_task 50388 08.07.2022
Процедура ПроверитьСостояния(МаршрутизацияЗаново = Ложь) Экспорт
	
	Если МаршрутизацияЗаново Тогда
		Для каждого СтрокаНоминация Из Номинации Цикл
			Если СтрокаНоминация.РелизКлиентаНеСовпадаетТипоразмерКТК Тогда
				РелизКлиентаНеСовпадаетТипоразмерКТК_Выполнено = Ложь;
			КонецЕсли;
			Если СтрокаНоминация.РелизКлиентаНоваяЗаписьКТК Тогда
				РелизКлиентаНоваяЗаписьКТК_Выполнено = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//Нам нужно не стандарт для маршрутов - возвращать или отменять задачи
	СтрокаКорректировка = Состояния.Найти(Справочники.Состояния.КорректировкаТипоразмераКТК,"Состояние");	
	Если СтрокаКорректировка <> Неопределено Тогда
	СтрокаКорректировка.Комментарий = "Обнаружено несоответствие типоразмера КТК при сравнении данных из сообщений CODECO c данными DC";	
	Если КолвоРелизКлиентаНеСовпадаетТипоразмерКТК=0 Тогда
		//Значит задача не нужна
		Если не СтрокаКорректировка.Статус=Перечисления.СтатусыЭтапов.Выполнен 
			и не СтрокаКорректировка.Статус=Перечисления.СтатусыЭтапов.Отклонен 
			Тогда
			СтрокаКорректировка.Статус = Перечисления.СтатусыЭтапов.Отклонен;
			СтрокаКорректировка.ПричинаОтказа = "Нет новых записей на проверку типоразмера КТК";
			СтрокаКорректировка.ЗавершениеРаботы = ТекущаяДата();
		КонецЕсли;
	ИначеЕсли КолвоРелизКлиентаНеСовпадаетТипоразмерКТК>Ссылка.КолвоРелизКлиентаНеСовпадаетТипоразмерКТК 
		и (СтрокаКорректировка.Статус=Перечисления.СтатусыЭтапов.Выполнен
		или СтрокаКорректировка.Статус=Перечисления.СтатусыЭтапов.Отклонен)
		Тогда
		СтрокаКорректировка.Статус = ПримененныйМаршрут.НачальныйСтатус;
		СтрокаКорректировка.НачалоРаботы = ТекущаяДата();
		СтрокаКорректировка.ЗавершениеРаботы = Дата(1,1,1);
	ИначеЕсли (СтрокаКорректировка.Статус=Перечисления.СтатусыЭтапов.Выполнен
		или СтрокаКорректировка.Статус=Перечисления.СтатусыЭтапов.Отклонен) Тогда
		Для каждого СтрокаНоминация Из Номинации Цикл
			Если СтрокаНоминация.РелизКлиентаНеСовпадаетТипоразмерКТК Тогда
				СтрокаНоминация.РелизКлиентаНеСовпадаетТипоразмерКТК_Выполнено = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	КонецЕсли;
	СтрокаКорректировка = Состояния.Найти(Справочники.Состояния.КорректировкаКоличестваКТК,"Состояние");	
	Если СтрокаКорректировка <>Неопределено Тогда
	СтрокаКорректировка.Комментарий = "В релиз собственника добавлены доп. строки с КТК из связанного релиза клиента. Необходимо уменьшить общее количество строк в релизе собственника либо принять текущее значение, а также проверить необходимость согласования изменения условий аренды КТК и корректировки связанных документов";	
	Если КолвоРелизКлиентаНоваяЗаписьКТК=0 Тогда
		//Значит задача не нужна
		Если не СтрокаКорректировка.Статус=Перечисления.СтатусыЭтапов.Выполнен 
			и не СтрокаКорректировка.Статус=Перечисления.СтатусыЭтапов.Отклонен 
			Тогда
			СтрокаКорректировка.Статус = Перечисления.СтатусыЭтапов.Отклонен;
			СтрокаКорректировка.ПричинаОтказа = "Нет новых записей КТК на проверку";
			СтрокаКорректировка.ЗавершениеРаботы = ТекущаяДата();
		КонецЕсли;
	ИначеЕсли КолвоРелизКлиентаНоваяЗаписьКТК>Ссылка.КолвоРелизКлиентаНоваяЗаписьКТК 
		и (СтрокаКорректировка.Статус=Перечисления.СтатусыЭтапов.Выполнен
		или СтрокаКорректировка.Статус=Перечисления.СтатусыЭтапов.Отклонен)
		//Значит задачу нужно вернуть
		Тогда
		СтрокаКорректировка.Статус = ПримененныйМаршрут.НачальныйСтатус;
		СтрокаКорректировка.НачалоРаботы = ТекущаяДата();
		СтрокаКорректировка.ЗавершениеРаботы = Дата(1,1,1);
	ИначеЕсли (СтрокаКорректировка.Статус=Перечисления.СтатусыЭтапов.Выполнен
		или СтрокаКорректировка.Статус=Перечисления.СтатусыЭтапов.Отклонен) Тогда
		Для каждого СтрокаНоминация Из Номинации Цикл
			Если СтрокаНоминация.РелизКлиентаНоваяЗаписьКТК Тогда
				СтрокаНоминация.РелизКлиентаНоваяЗаписьКТК_Выполнено = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	КонецЕсли;
	//Нам нужно не стандартн для маршрутов возвращать или отменять задачи
КонецПроцедуры
//-- Зубов US 33131 TA 43877 16.12.2021   

Функция ПолучитьСтрокиБезКТКИДатыВзятия(ТипКТК) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РелизСобственникаНоминации.ГУИДСтроки КАК ГУИДСтроки
	|ПОМЕСТИТЬ ВТ_РелизСобственникаНоминации
	|ИЗ
	|	&РелизСобственникаНоминации КАК РелизСобственникаНоминации
	|ГДЕ
	|	РелизСобственникаНоминации.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	|	И РелизСобственникаНоминации.ТипКТК = &ТипКТК
	|	И РелизСобственникаНоминации.ДатаВзятия = ДАТАВРЕМЯ(1, 1, 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РелизСобственникаНоминации.ГуидСтроки КАК ГуидСтроки
	|ИЗ
	|	ВТ_РелизСобственникаНоминации КАК ВТ_РелизСобственникаНоминации";
	Запрос.УстановитьПараметр("ТипКТК", ТипКТК);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	МассивСтрокНоминаций = Новый Массив;
	Пока Выборка.Следующий() Цикл
		СтрокаНоминации = Номинации.Найти(Выборка.ГУИДСтроки);
		МассивСтрокНоминаций.Добавить(СтрокаНоминации);
	КонецЦикла;                                        
	Возврат МассивСтрокНоминаций;
	
КонецФункции
// -- ДИТ_Агафонов_task 50388 08.07.2022

//++ Дудоров С.В. TASK 66585 17.03.2023	
Функция ПолучитьДанныеНоминацииПоНезаполненнымКонтейнерам()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РелизСобственникаНоминации.НомерСтроки КАК НомерСтроки,
		|	РелизСобственникаНоминации.Контейнер КАК Контейнер
		|ПОМЕСТИТЬ вт_НезаполненныеКонтейнеры
		|ИЗ
		|	&тзНоминации КАК РелизСобственникаНоминации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_НезаполненныеКонтейнеры.НомерСтроки КАК НомерСтроки,
		|	вт_НезаполненныеКонтейнеры.Контейнер КАК Контейнер
		|ИЗ
		|	вт_НезаполненныеКонтейнеры КАК вт_НезаполненныеКонтейнеры
		|ГДЕ
		|	вт_НезаполненныеКонтейнеры.Контейнер = ЗНАЧЕНИЕ(СПравочник.ТЕ.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("тзНоминации", НОминации.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Новый Структура ("ВсеКонтейнерыЗаполнены, ОшибкиНезаполненныхКонтейнеров"
		,РезультатЗапроса.Пустой(), РезультатЗапроса.Выбрать());
	
КонецФункции	
// -- ДИТ_Агафонов_task 50388 08.07.2022

// Евросиб US 88643 TA 88646 Рыбьяков К.А. 11.09.2024 ((
Процедура ПриКопировании(ОбъектКопирования)
	
	// Евросиб US 95846 TA 93176 Рыбьяков К.А. 08.12.2024 ((
	НомерДокумента = "";
	ДатаДокумента = Дата('00010101');
	НачалоДействия = Дата('00010101');
	ОкончаниеДействия = Дата('00010101');
	Комментарий = "";
	ПСЦ = Неопределено;
	Номинации.Очистить();
	ДоплатныеКТК = Ложь;
	Автор = Пользователи.ТекущийПользователь();
	ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВидДоговора");
	Если ВидДоговора <> Неопределено Тогда
		Если ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
			Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 08.12.2024 ))
	
КонецПроцедуры
// Евросиб Рыбьяков К.А. 11.09.2024 ))

//Евросиб(ДИТ) Сержантова А.С. US 97699 ТА 97731 29.01.2025  
Функция ПроверкаПередУстановкойПометкиУдаления()
	
	ПометкаУдаленияЗапрещена = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвязанныеОбъекты.Ссылка КАК Ссылка,
		|	ТИПЗНАЧЕНИЯ(СвязанныеОбъекты.Ссылка) КАК ТипСвязанногоДокумента,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(СвязанныеОбъекты.Ссылка) = ЗНАЧЕНИЕ(Документ.Акцепт)
		|			ТОГДА ВЫРАЗИТЬ(СвязанныеОбъекты.Ссылка КАК Документ.Акцепт).Дата
		|		КОГДА ТИПЗНАЧЕНИЯ(СвязанныеОбъекты.Ссылка) = ЗНАЧЕНИЕ(Документ.Заявка)
		|			ТОГДА ВЫРАЗИТЬ(СвязанныеОбъекты.Ссылка КАК Документ.Заявка).Дата
		|		КОГДА ТИПЗНАЧЕНИЯ(СвязанныеОбъекты.Ссылка) = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг)
		|			ТОГДА ВЫРАЗИТЬ(СвязанныеОбъекты.Ссылка КАК Документ.ПоступлениеТоваровУслуг).Дата
		|		КОГДА ТИПЗНАЧЕНИЯ(СвязанныеОбъекты.Ссылка) = ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг)
		|			ТОГДА ВЫРАЗИТЬ(СвязанныеОбъекты.Ссылка КАК Документ.РеализацияТоваровУслуг).Дата
		|		КОГДА ТИПЗНАЧЕНИЯ(СвязанныеОбъекты.Ссылка) = ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю)
		|			ТОГДА ВЫРАЗИТЬ(СвязанныеОбъекты.Ссылка КАК Документ.СчетНаОплатуПокупателю).Дата
		|	КОНЕЦ КАК Дата,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(СвязанныеОбъекты.Ссылка) = ЗНАЧЕНИЕ(Документ.Акцепт)
		|			ТОГДА ВЫРАЗИТЬ(СвязанныеОбъекты.Ссылка КАК Документ.Акцепт).Номер
		|		КОГДА ТИПЗНАЧЕНИЯ(СвязанныеОбъекты.Ссылка) = ЗНАЧЕНИЕ(Документ.Заявка)
		|			ТОГДА ВЫРАЗИТЬ(СвязанныеОбъекты.Ссылка КАК Документ.Заявка).Номер
		|		КОГДА ТИПЗНАЧЕНИЯ(СвязанныеОбъекты.Ссылка) = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг)
		|			ТОГДА ВЫРАЗИТЬ(СвязанныеОбъекты.Ссылка КАК Документ.ПоступлениеТоваровУслуг).Номер
		|		КОГДА ТИПЗНАЧЕНИЯ(СвязанныеОбъекты.Ссылка) = ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг)
		|			ТОГДА ВЫРАЗИТЬ(СвязанныеОбъекты.Ссылка КАК Документ.РеализацияТоваровУслуг).Номер
		|		КОГДА ТИПЗНАЧЕНИЯ(СвязанныеОбъекты.Ссылка) = ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю)
		|			ТОГДА ВЫРАЗИТЬ(СвязанныеОбъекты.Ссылка КАК Документ.СчетНаОплатуПокупателю).Номер
		|	КОНЕЦ КАК Номер
		|ИЗ
		|	РегистрСведений.СвязанныеОбъекты КАК СвязанныеОбъекты
		|ГДЕ
		|	СвязанныеОбъекты.Основание = &РелизСобственника
		|	И ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(СвязанныеОбъекты.Ссылка) = ЗНАЧЕНИЕ(Документ.Акцепт)
		|				ТОГДА ВЫРАЗИТЬ(СвязанныеОбъекты.Ссылка КАК Документ.Акцепт).Проведен
		//Евросиб Коханенко Н.А. 26.05.2025 (( #110274 
		//Акцепт должен быть не только проведен, но и связанные с ним ПТУ/КоррПТУ не должны иметь пометки на удаление. 
		//Тогда запрет удаления релиза активен.
		|					И НЕ Выразить(СвязанныеОбъекты.Ссылка КАК Документ.Акцепт).Поступление.ПометкаУдаления
		//Евросиб Коханенко Н.А. 26.05.2025 )) #110274
		|			КОГДА ТИПЗНАЧЕНИЯ(СвязанныеОбъекты.Ссылка) = ЗНАЧЕНИЕ(Документ.Заявка)
		|				ТОГДА ВЫРАЗИТЬ(СвязанныеОбъекты.Ссылка КАК Документ.Заявка).Проведен
		|			КОГДА ТИПЗНАЧЕНИЯ(СвязанныеОбъекты.Ссылка) = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг)
		|				ТОГДА ВЫРАЗИТЬ(СвязанныеОбъекты.Ссылка КАК Документ.ПоступлениеТоваровУслуг).Проведен
		|			КОГДА ТИПЗНАЧЕНИЯ(СвязанныеОбъекты.Ссылка) = ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг)
		|				ТОГДА ВЫРАЗИТЬ(СвязанныеОбъекты.Ссылка КАК Документ.РеализацияТоваровУслуг).Проведен
		|			КОГДА ТИПЗНАЧЕНИЯ(СвязанныеОбъекты.Ссылка) = ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю)
		|				ТОГДА ВЫРАЗИТЬ(СвязанныеОбъекты.Ссылка КАК Документ.СчетНаОплатуПокупателю).Проведен
		|		КОНЕЦ
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Ссылка)
		|ПО
		|	ТипСвязанногоДокумента";
	
	Запрос.УстановитьПараметр("РелизСобственника", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если не РезультатЗапроса.Пустой() Тогда 
		ШаблонТекстаОшибки = "Нельзя удалить релиз собственника, если он связан с заявкой, РТУ, счетом на оплату покупателю, ПТУ или акцептом." +
		                      Символы.ПС + "Список документов: ";
		Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выборка.Следующий() Цикл
			КоличествоДокументов = Выборка.Ссылка;
			ТипДокументов = Выборка.ТипСвязанногоДокумента; 
			
			МассивСвязанныхДокументов = Новый Массив;
			ВыборкаДетали = Выборка.Выбрать();
			Пока ВыборкаДетали.Следующий() Цикл
				МассивСвязанныхДокументов.Добавить("" + ВыборкаДетали.Номер + " от " + Формат(ВыборкаДетали.Дата, "ДФ=dd.MM.yyyy"));	
			КонецЦикла; 
			Если МассивСвязанныхДокументов.Количество() Тогда
				ШаблонТекстаОшибки = ШаблонТекстаОшибки + ТипДокументов + ?(КоличествоДокументов>1," (" + КоличествоДокументов + ")", "") + " - ";
				ШаблонТекстаОшибки = ШаблонТекстаОшибки + СтрСоединить(МассивСвязанныхДокументов, ", ") + Символы.ПС;
			КонецЕсли;
		КонецЦикла; 
		ПометкаУдаленияЗапрещена = Истина; 
		ОбщегоНазначения.СообщитьПользователю(ШаблонТекстаОшибки);
	КонецЕсли;     
	
	// Евросиб US 104907 TA 105520 Рыбьяков К.А. 24.03.2025 ((
	Если Проведен Тогда
		ЗапретУдаленияПриНаличииКТКВЭксплуатации(ПометкаУдаленияЗапрещена);
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 24.03.2025 ))
	
	Возврат ПометкаУдаленияЗапрещена;

КонецФункции 

//Евросиб СубботинВ #102567 18.02.2025 Начало
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// исходный код в ПроверитьЗаполненностьРеквизитов со всеми комментариями
	
	// эти реквизиты проверяются признаком реквизита
	//ПроверяемыеРеквизиты.Добавить("НомерДокумента");
	//ПроверяемыеРеквизиты.Добавить("Контрагент");	
	//ПроверяемыеРеквизиты.Добавить("Номинации");
	//ПроверяемыеРеквизиты.Добавить("Номинации.ТипКТК");
	//ПроверяемыеРеквизиты.Добавить("Номинации.тек_СобственностьКТК");
	
	Если НЕ СобственныеКТК Тогда
		
		Если НЕ ЗначениеЗаполнено(НачалоДействия) ИЛИ НЕ ЗначениеЗаполнено(ОкончаниеДействия) Тогда 
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Не заполнено значение Период действия",,"ПериодДействия");
			Возврат;
		КонецЕсли;
		ПроверяемыеРеквизиты.Добавить("Локация");
		ПроверяемыеРеквизиты.Добавить("ЛокацияСдачи");
		ПроверяемыеРеквизиты.Добавить("Договор");
		
		ПроверяемыеРеквизиты.Добавить("Номинации.НормативВозврата");
		ПроверяемыеРеквизиты.Добавить("Номинации.Валюта");
		
		//проверка незаполненности ставки СНП
		Для Каждого СтрокаНоминации из Номинации Цикл
			ПОтбора = Новый Структура("ГУИДСтроки",СтрокаНоминации.ГУИДСтроки);
			СтрокиСНП = СНП.НайтиСтроки(ПОтбора);
			Если СтрокиСНП.Количество()= 0 Тогда
				ОбщегоНазначения.СообщитьПользователю("В строке " + СтрокаНоминации.НомерСтроки + " незаполнена ставка СНП",,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Номинации", СтрокаНоминации.НомерСтроки,"СНП"),"Объект",Отказ);
			КонецЕсли;
		КонецЦикла;
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	Иначе
	//Евросиб Ситников К.А. Task 113980 29.07.2025
	    ВалютаСНП = ПроверяемыеРеквизиты.Найти("Номинации.ВалютаСНП");
		ПроверяемыеРеквизиты.Удалить(ВалютаСНП);
	//Евросиб Ситников К.А. Task 113980 29.07.2025
    	ПроверяемыеРеквизиты.Добавить("Номинации.Контейнер");
	КонецЕсли;
	
	Отказ = ?(НЕ СобственныеКТК, ПроверитьНулевуюСтавку(), Отказ);
	

КонецПроцедуры 
//Евросиб СубботинВ #102567 18.02.2025 Конец

// Евросиб US 104907 TA 105520 Рыбьяков К.А. 24.03.2025 ((
Функция ЗапретУдаленияПриНаличииКТКВЭксплуатации(ПометкаУдаленияЗапрещена)
	
	ЕстьКТКСНезакрытымЦикломЭкплуатации = Ложь;
	ЕстьКТКСПолнымЦиклом = Ложь;
	Контейнеры = Новый Массив;
	
	Для Каждого СтрокаНоминации Из Номинации Цикл
		Если ЗначениеЗаполнено(СтрокаНоминации.Контейнер) И ЗначениеЗаполнено(СтрокаНоминации.ДатаВзятия) И Не ЗначениеЗаполнено(СтрокаНоминации.ДатаВозвратаСобственнику) Тогда
			ЕстьКТКСНезакрытымЦикломЭкплуатации = Истина;
			Контейнеры.Добавить(СтрокаНоминации.Контейнер);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаНоминации.Контейнер) И ЗначениеЗаполнено(СтрокаНоминации.ДатаВзятия) И ЗначениеЗаполнено(СтрокаНоминации.ДатаВозвратаСобственнику)
			ИЛИ ЗначениеЗаполнено(СтрокаНоминации.Контейнер) И Не ЗначениеЗаполнено(СтрокаНоминации.ДатаВзятия) И ЗначениеЗаполнено(СтрокаНоминации.ДатаВозвратаСобственнику) Тогда
			ЕстьКТКСПолнымЦиклом = Истина;
			Контейнеры.Добавить(СтрокаНоминации.Контейнер);
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьКТКСНезакрытымЦикломЭкплуатации И ЕстьКТКСПолнымЦиклом Тогда
		ТекстСообщения = НСтр("ru = 'Данный Релиз собственника содержит информацию о фактической выдаче и сдаче контейнеров в рамках этого релиза. Необходимо отменить ввод неиспользованных КТК в оперирование'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, ПометкаУдаленияЗапрещена);
	ИначеЕсли ЕстьКТКСНезакрытымЦикломЭкплуатации Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо вывести КТК из оперирования'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, ПометкаУдаленияЗапрещена);
	ИначеЕсли ЕстьКТКСПолнымЦиклом Тогда
		ТекстСообщения = НСтр("ru = 'Данный Релиз собственника содержит информацию о фактической выдаче и сдаче контейнеров в рамках этого релиза'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, ПометкаУдаленияЗапрещена);
	КонецЕсли;
	
	Если ПометкаУдаленияЗапрещена Тогда
		Контейнеры = СтрСоединить(Контейнеры, ", ");
		ТекстСообщения = СтрШаблон(НСтр("ru = 'КТК, взятые в эксплуатацию: %1'"), Контейнеры);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, ПометкаУдаленияЗапрещена);
	КонецЕсли;
	
	Возврат ПометкаУдаленияЗапрещена;

КонецФункции 
// Евросиб Рыбьяков К.А. 24.03.2025 ))

// Евросиб US 88683 TA 108959 Рыбьяков К.А. 13.05.2025 ((
Процедура ПодобратьКалькуляцииИСделки(Ссылка)
	
	Если Не ЗначениеЗаполнено(ПСЦ) 
		И Не ДоплатныеКТК 
		И ТипЗнч(ПСЦ) = Тип("ДокументСсылка.ПСЦ") Тогда
		Возврат;
	КонецЕсли;
	
	МассивКонтейнеров = Новый Массив;
	ТарифицируемыйРазмерКТК = Новый Массив;
	МассивПараметровКТК = Новый Массив;
	
	Для Каждого СтрокаНоминации Из Номинации Цикл
		Если (ЗначениеЗаполнено(СтрокаНоминации.Контейнер) 
				И ЗначениеЗаполнено(СтрокаНоминации.ДатаВзятия)
				И ЗначениеЗаполнено(СтрокаНоминации.ДатаВозвратаСобственнику)) Тогда
			СтарыеДанные = Ссылка.Номинации.НайтиСтроки(Новый Структура("ГуидСтроки", СтрокаНоминации.ГУИДСтроки));
			Если СтарыеДанные.Количество() > 0 Тогда
				ПрошлаяКалькуляция = СтарыеДанные[0].допл_Калькуляция;
			Иначе
				ПрошлаяКалькуляция = СтрокаНоминации.допл_Калькуляция;
			КонецЕсли;
			РазмерКТК = Строка(СтрокаНоминации.Контейнер.ТипТЕ.РазмерКТК);
			Если СтрокаНоминации.допл_Калькуляция <> ПрошлаяКалькуляция Тогда
				КлючАналитики = СтрокаНоминации.КлючАналитики.ПолучитьОбъект();
				ПараметрыКалькуляции = ПолучитьПараметрыКалькуляции(СтрокаНоминации.допл_Калькуляция);
				Если ЗначениеЗаполнено(СтрокаНоминации.допл_Сделка) Тогда
					ПараметрыКалькуляции.Вставить("Сделка", СтрокаНоминации.допл_Сделка);
				КонецЕсли;
				Документы.РелизСобственника.ОбновитьРеквизитКлючаАналитики(КлючАналитики, ПараметрыКалькуляции, РазмерКТК);
			КонецЕсли;
			Если Не ЗначениеЗаполнено(СтрокаНоминации.допл_Калькуляция) Тогда
				МассивКонтейнеров.Добавить(СтрокаНоминации.Контейнер);
				Если ТарифицируемыйРазмерКТК.Найти(РазмерКТК) = Неопределено Тогда
					ТарифицируемыйРазмерКТК.Добавить(РазмерКТК);
				КонецЕсли;
				МассивПараметровКТК.Добавить(Новый Структура("Контейнер, РазмерКТК, СтрокаНоминации", СтрокаНоминации.Контейнер, РазмерКТК, СтрокаНоминации));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если МассивКонтейнеров.Количество() <> 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	стоки_ТекущиеДанныеСрезПоследних.КТК КАК Контейнер,
		|	стоки_ТекущиеДанныеСрезПоследних.тек_СтокСдачи КАК СтокСдачи
		|ИЗ
		|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(
		|			&Дата,
		|			тек_Релиз = &Релиз
		|				И КТК В (&Контейнеры)
		|				И тек_СтокСдачи <> Значение(Справочник.Локации.ПустаяСсылка)) КАК стоки_ТекущиеДанныеСрезПоследних";
		
		Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
		Запрос.УстановитьПараметр("Контейнеры", МассивКонтейнеров);
		Запрос.УстановитьПараметр("Релиз", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		МассивПунктовНазначения = Новый Массив;
		
		ДанныеКонтейнеров = Новый Соответствие;
		
		Пока Выборка.Следующий() Цикл
			ДанныеКонтейнеров.Вставить(Выборка.Контейнер, Выборка.СтокСдачи);
			МассивПунктовНазначения.Добавить(Выборка.СтокСдачи);
		КонецЦикла;
		
		ДанныеКалькуляцийИзПСЦ = КалькуляцииИзПСЦ(ПСЦ, МассивПунктовНазначения, ТарифицируемыйРазмерКТК);
		
		Для Каждого ПараметрыСтроки Из МассивПараметровКТК Цикл
			СтокСдачи = ДанныеКонтейнеров.Получить(ПараметрыСтроки.Контейнер);
			Если СтокСдачи = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ПодходящиеКалькуляции = Новый Массив;
			НайденныеКалькуляции = ДанныеКалькуляцийИзПСЦ.НайтиСтроки(Новый Структура("Станция", СтокСдачи));
			Для Каждого Данные Из НайденныеКалькуляции Цикл
				Если Данные.ТарифицируемыйРазмерКТК = ПараметрыСтроки.РазмерКТК Или Данные.ТарифицируемыйРазмерКТК = "2040" Тогда
					ПодходящиеКалькуляции.Добавить(Данные);
				КонецЕсли;
			КонецЦикла;
			Если ПодходящиеКалькуляции.Количество() = 1 Тогда
				Параметры = ПолучитьПараметрыКалькуляции(ПодходящиеКалькуляции[0].Калькуляция);
				Если ЗначениеЗаполнено(ПараметрыСтроки.СтрокаНоминации) Тогда
					Параметры.Вставить("Сделка", СтрокаНоминации.допл_Сделка);
				КонецЕсли;
				КлючАналитики = ПараметрыСтроки.СтрокаНоминации.КлючАналитики.ПолучитьОбъект();
				Документы.РелизСобственника.ОбновитьРеквизитКлючаАналитики(КлючАналитики, Параметры, ПараметрыСтроки.РазмерКТК);
				ПараметрыСтроки.СтрокаНоминации.допл_Калькуляция = Параметры.Калькуляция;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	ПодобратьСделки(Ссылка);
	
КонецПроцедуры // Евросиб Рыбьяков К.А. 13.05.2025 ))

Функция КалькуляцииИзПСЦ(Протокол, ПунктыНазначения, ТарифицируемыйРазмерКТК)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПСЦКалькуляции.Калькуляция КАК Калькуляция
	|ПОМЕСТИТЬ ВТ_КалькуляцииИзПСЦ
	|ИЗ
	|	Документ.ПСЦ.Калькуляции КАК ПСЦКалькуляции
	|ГДЕ
	|	ПСЦКалькуляции.Ссылка = &ПСЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КалькуляцияСписокСтанцийНазначения.Ссылка КАК Калькуляция,
	|	КалькуляцияСписокСтанцийНазначения.Ссылка.СтавкаНДС КАК СтавкаНДС,
	|	КалькуляцияСписокСтанцийНазначения.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	КалькуляцияСписокСтанцийНазначения.Ссылка.Валюта КАК Валюта,
	|	КалькуляцияСписокСтанцийНазначения.Ссылка.ТарифицируемыйРазмерКТК КАК ТарифицируемыйРазмерКТК,
	|	КалькуляцияСписокСтанцийНазначения.Станция КАК Станция,
	|	КалькуляцияСписокСтанцийНазначения.Ссылка.ММ_ИтогоВознаграждение КАК Ставка40,
	|	КалькуляцияСписокСтанцийНазначения.Ссылка.ММ_ИтогоВознаграждение20 КАК Ставка20
	|ИЗ
	|	Документ.Калькуляция.СписокСтанцийНазначения КАК КалькуляцияСписокСтанцийНазначения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	|		ПО КалькуляцияСписокСтанцийНазначения.Ссылка = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка
	|ГДЕ
	|	КалькуляцияСписокСтанцийНазначения.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_КалькуляцииИзПСЦ.Калькуляция
	|			ИЗ
	|				ВТ_КалькуляцииИзПСЦ КАК ВТ_КалькуляцииИзПСЦ)
	|	И КалькуляцияСписокСтанцийНазначения.Станция В(&ПунктыНазначения)
	|	И (КалькуляцияСписокСтанцийНазначения.Ссылка.ТарифицируемыйРазмерКТК В (&ТарифицируемыйРазмерКТК)
	|			ИЛИ КалькуляцияСписокСтанцийНазначения.Ссылка.ТарифицируемыйРазмерКТК = ""2040"")
	|	И (КалькуляцияСписокСтанцийНазначения.Ссылка.ММ_ИтогоВознаграждение <> 0
	|			ИЛИ КалькуляцияСписокСтанцийНазначения.Ссылка.ММ_ИтогоВознаграждение20 <> 0)";
	
	Запрос.УстановитьПараметр("ПСЦ", Протокол);
	Запрос.УстановитьПараметр("ПунктыНазначения", ПунктыНазначения);
	Запрос.УстановитьПараметр("ТарифицируемыйРазмерКТК", ТарифицируемыйРазмерКТК);
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции // Евросиб Рыбьяков К.А. 13.05.2025 ))

Процедура ПодобратьСделки(Ссылка)
	
	МассивКонтейнеров = Новый Массив;
	
	Для Каждого СтрокаНоминации Из Номинации Цикл
		Если (ЗначениеЗаполнено(СтрокаНоминации.Контейнер) 
			И ЗначениеЗаполнено(СтрокаНоминации.ДатаВзятия)
			И ЗначениеЗаполнено(СтрокаНоминации.ДатаВозвратаСобственнику)
			И ЗначениеЗаполнено(СтрокаНоминации.допл_Калькуляция)) Тогда
			СтарыеДанные = Ссылка.Номинации.НайтиСтроки(Новый Структура("ГуидСтроки", СтрокаНоминации.ГУИДСтроки));
			Если СтарыеДанные.Количество() > 0 Тогда
				ПрошлаяСделка = СтарыеДанные[0].допл_Сделка;
			Иначе
				ПрошлаяСделка = СтрокаНоминации.допл_Сделка;
			КонецЕсли;
			Если СтрокаНоминации.допл_Сделка <> ПрошлаяСделка Тогда
				КлючАналитики = СтрокаНоминации.КлючАналитики.ПолучитьОбъект();
				КлючАналитики.Редактор = Пользователи.ТекущийПользователь();
				КлючАналитикиСоставаПоезда = ПолучитьКлючАналитикиСоставаПоезда(СтрокаНоминации.допл_Сделка, СтрокаНоминации.Контейнер);
				Документы.РелизСобственника.ОбновитьРеквизитКлючаАналитики(КлючАналитики, 
							Новый Структура("Сделка, КлючАналитикиСоставаПоезда", СтрокаНоминации.допл_Сделка, КлючАналитикиСоставаПоезда));
 			КонецЕсли;
			Если Не ЗначениеЗаполнено(СтрокаНоминации.допл_Сделка) Тогда
				МассивКонтейнеров.Добавить(СтрокаНоминации.Контейнер);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЗаявкаСоставУслуги.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
	               |	КлючиАналитикиСоставаПоезда.Сделка КАК Сделка,
				   |	КлючиАналитикиСоставаПоезда.Ссылка КАК КлючАналитикиСоставаПоезда,
	               |	ЗаявкаСоставУслуги.НомерКТК КАК Контейнер,
	               |	КлючиАналитикиСоставаПоезда.ДатаОтправления КАК ДатаОтправления,
	               |	КлючиАналитикиСоставаПоезда.ДатаПрибытия КАК ДатаПрибытия,
	               |	НАЧАЛОПЕРИОДА(ЗаявкаСоставУслуги.ДатаВозвратаКлиентом, ДЕНЬ) КАК ДатаВозвратаКлиентом
	               |ИЗ
	               |	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки КАК КлючАналитикиПеревозкиВЗаявке
	               |		ПО ЗаявкаСоставУслуги.КлючАналитикиПеревозки = КлючАналитикиПеревозкиВЗаявке.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиСоставаПоезда КАК КлючиАналитикиСоставаПоезда
	               |		ПО (КлючАналитикиПеревозкиВЗаявке.КлючАналитикиСоставаПоезда = КлючиАналитикиСоставаПоезда.Ссылка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |		ПО (КлючиАналитикиСоставаПоезда.Сделка = СделкаСвязьУчетныхЕдиниц.Ссылка)
	               |ГДЕ
	               |	ЗаявкаСоставУслуги.НомерКТК В(&НомерКТК)
	               |	И КлючАналитикиПеревозкиВЗаявке.КлючАналитикиСоставаПоезда <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиСоставаПоезда.ПустаяСсылка)
	               |	И КлючиАналитикиСоставаПоезда.Активность
	               |	И КлючиАналитикиСоставаПоезда.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ЖД)
	               |	И КлючиАналитикиСоставаПоезда.Клиент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	И СделкаСвязьУчетныхЕдиниц.Ссылка.Проведен
	               |	И СделкаСвязьУчетныхЕдиниц.ПринадлежностьТЕ = ЗНАЧЕНИЕ(Перечисление.ПринадлежностьТЕ.КТЕвросиба)
	               |	И НЕ СделкаСвязьУчетныхЕдиниц.Ссылка.Служебная
	               |	И НЕ СделкаСвязьУчетныхЕдиниц.Ссылка.ПодсылПорожних";
	
	Запрос.УстановитьПараметр("НомерКТК", МассивКонтейнеров);
		
	ТаблицаСделок = Запрос.Выполнить().Выгрузить();
	
	ТаблицаСделок.Сортировать("ДатаПрибытия");
	
	Для Каждого Строка Из ТаблицаСделок Цикл
		НайденныеСтроки = Номинации.НайтиСтроки(Новый Структура("Контейнер", Строка.Контейнер));
		Для Каждого СтрокаНоминации Из НайденныеСтроки Цикл
			Если НачалоДня(СтрокаНоминации.ДатаВозвратаСобственнику) = Строка.ДатаВозвратаКлиентом Тогда
				КлючАналитики = СтрокаНоминации.КлючАналитики.ПолучитьОбъект();
				СтрокаНоминации.допл_Сделка = Строка.Сделка;
				Документы.РелизСобственника.ОбновитьРеквизитКлючаАналитики(КлючАналитики, 
							Новый Структура("Сделка, КлючАналитикиСоставаПоезда", Строка.Сделка, Строка.КлючАналитикиСоставаПоезда));
				Индекс = МассивКонтейнеров.Найти(Строка.Контейнер);
				Если Индекс <> Неопределено Тогда
					МассивКонтейнеров.Удалить(Индекс);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого СтрокаВыгрузки Из ТаблицаСделок Цикл
		Если МассивКонтейнеров.Найти(СтрокаВыгрузки.Контейнер) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НайденныеСтроки = Номинации.НайтиСтроки(Новый Структура("Контейнер", СтрокаВыгрузки.Контейнер));
		Сделка = Неопределено;
		Для Каждого СтрокаНоминации Из НайденныеСтроки Цикл
			Сделка = ПодобратьСделку(СтрокаНоминации, ТаблицаСделок);
		КонецЦикла;
		Если Сделка <> Неопределено Тогда
			КлючАналитики = СтрокаНоминации.КлючАналитики.ПолучитьОбъект();
			СтатусПротокола = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПСЦ, "СтатусДокумента");
			Если ЗначениеЗаполнено(КлючАналитики.Калькуляция) 
				И СтатусПротокола = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний
					Или СтатусПротокола = Перечисления.СтатусыСогласования.Подписано
					Или СтатусПротокола = Перечисления.СтатусыСогласования.СогласованСКомментариями Тогда
				СтрокаНоминации.допл_Сделка = Сделка.Сделка;
				Документы.РелизСобственника.ОбновитьРеквизитКлючаАналитики(КлючАналитики, 
							Новый Структура("Сделка, КлючАналитикиСоставаПоезда", Сделка.Сделка, Сделка.КлючАналитикиСоставаПоезда));
				ОтложенноеИзменениеСервер.ПоставитьСвязанныеОбъектыВОчередьИзменения(КлючАналитики);
			КонецЕсли;
		КонецЕсли;
		Индекс = МассивКонтейнеров.Найти(СтрокаВыгрузки.Контейнер);
		Если Индекс <> Неопределено Тогда
			МассивКонтейнеров.Удалить(Индекс);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // Евросиб Рыбьяков К.А. 13.05.2025 ))

Функция ПодобратьСделку(СтрокаНоминации, ТаблицаСделок) Экспорт
	
	ПодобраннаяСделка = Неопределено;
	
	ПодходящиеСделки = Новый Массив;
	
	// Шаг 1: Фильтрация сделок по КТК номинации
	ОтфильтрованныеСделки = Новый Массив;
	Для Каждого СтрокаСделки Из ТаблицаСделок Цикл
		Если СтрокаСделки.Контейнер = СтрокаНоминации.Контейнер Тогда
			ОтфильтрованныеСделки.Добавить(СтрокаСделки);
		КонецЕсли;
	КонецЦикла;
	
	// Шаг 2: Проверка пересечения периодов
	ПересекающиесяСделки = Новый Массив;
	Для Каждого Сделка Из ОтфильтрованныеСделки Цикл
		Если Сделка.ДатаОтправления <= СтрокаНоминации.ДатаВозвратаСобственнику 
			И Сделка.ДатаПрибытия >= СтрокаНоминации.ДатаВзятия Тогда
			ПересекающиесяСделки.Добавить(Сделка);
		КонецЕсли;
	КонецЦикла;
	
	// Шаг 3: Нет пересечений
	Если ПересекающиесяСделки.Количество() = 0 Тогда
		Возврат ПодобраннаяСделка; 
	КонецЕсли;
	
	// Шаг 4: Подбор подходящей сдлеки
	Для Каждого Сделка Из ПересекающиесяСделки Цикл
		СледующаяСделка = НайтиСледующуюСделку(Сделка, ОтфильтрованныеСделки);
		Если СледующаяСделка = Неопределено Тогда
			//ПодобраннаяСделка = Сделка;
			//Прервать;
			//Возврат Сделка;
			ПодходящиеСделки.Добавить(Сделка);
		ИначеЕсли СтрокаНоминации.ДатаВозвратаСобственнику <= СледующаяСделка.ДатаПрибытия 
				Или Не ЗначениеЗаполнено(СледующаяСделка.ДатаПрибытия) Тогда
			//ПодобраннаяСделка = Сделка;
			//Прервать;
			//Возврат Сделка;
			ПодходящиеСделки.Добавить(Сделка);
		//ИначеЕсли СтрокаНоминации.ДатаВозвратаСобственнику > СледующаяСделка.ДатаПрибытия 
		//	И СтрокаНоминации.ДатаВзятия <= СледующаяСделка.ДатаОтправления Тогда
		//	Прервать;
			//Возврат Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	// Шаг 5: Определение единственной подходящей сделки
	Если ПодходящиеСделки.Количество() = 1 Тогда
		ПодобраннаяСделка = ПодходящиеСделки[0];
		//Возврат ПодходящиеСделки[0];
	ИначеЕсли ПодходящиеСделки.Количество() > 1 Тогда
		// Проверяем, что все подходящая сделка не совпадает с 
		ПодобраннаяСделка = ПодходящиеСделки[0];
		Для i = 1 По ПодходящиеСделки.Количество() - 1 Цикл
			Если ПодобраннаяСделка.ДатаПрибытия = ПодходящиеСделки[i].ДатаПрибытия Тогда
				ПодобраннаяСделка = Неопределено;
				Прервать;
			КонецЕсли;
			//Если Не (ПерваяСделка.ДатаОтправления = ПодходящиеСделки[i].ДатаОтправления 
			//	И ПерваяСделка.ДатаПрибытия = ПодходящиеСделки[i].ДатаПрибытия) Тогда
			//	// Периоды разные - неоднозначность
			//	Возврат Неопределено;
			//КонецЕсли;
		КонецЦикла;
		//ПодобраннаяСделка = ПерваяСделка;
	КонецЕсли;
	
	Возврат ПодобраннаяСделка; 
	
КонецФункции

Функция НайтиСледующуюСделку(ТекущаяСделка, Сделки)
	
	МинимальнаяДата = Макс(ТекущаяСделка.ДатаОтправления, Дата(3999, 12, 31));
	СледующаяСделка = Неопределено;
	
	Для Каждого Сделка Из Сделки Цикл
		Если Сделка.ДатаПрибытия > ТекущаяСделка.ДатаПрибытия 
			И Сделка.ДатаОтправления < МинимальнаяДата Тогда
			МинимальнаяДата = Сделка.ДатаОтправления;
			СледующаяСделка = Сделка;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СледующаяСделка;
	
КонецФункции

Функция ПолучитьПараметрыКалькуляции(Калькуляция)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КалькуляцияСписокСтанцийНазначения.Ссылка КАК Калькуляция,
	|	КалькуляцияСписокСтанцийНазначения.Ссылка.СтавкаНДС КАК СтавкаНДС,
	|	КалькуляцияСписокСтанцийНазначения.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	КалькуляцияСписокСтанцийНазначения.Ссылка.Валюта КАК Валюта,
	//|	СУММА(КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Цена20) + КалькуляцияСписокСтанцийНазначения.Ссылка.ММ_Вознаграждение КАК Ставка20,
	//|	СУММА(КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Цена40) + КалькуляцияСписокСтанцийНазначения.Ссылка.ММ_Вознаграждение40 КАК Ставка40,
	|	КалькуляцияСписокСтанцийНазначения.Ссылка.ТарифицируемыйРазмерКТК КАК ТарифицируемыйРазмерКТК,
	|	КалькуляцияСписокСтанцийНазначения.Ссылка.ММ_ИтогоВознаграждение КАК Ставка40,
	|	КалькуляцияСписокСтанцийНазначения.Ссылка.ММ_ИтогоВознаграждение20 КАК Ставка20
	|ИЗ
	|	Документ.Калькуляция.СписокСтанцийНазначения КАК КалькуляцияСписокСтанцийНазначения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	|		ПО КалькуляцияСписокСтанцийНазначения.Ссылка = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка
	|ГДЕ
	|	КалькуляцияСписокСтанцийНазначения.Ссылка В (&Калькуляция)
	|
	|СГРУППИРОВАТЬ ПО
	|	КалькуляцияСписокСтанцийНазначения.Ссылка,
	|	КалькуляцияСписокСтанцийНазначения.Ссылка.СтавкаНДС,
	|	КалькуляцияСписокСтанцийНазначения.Ссылка.СуммаВключаетНДС,
	|	КалькуляцияСписокСтанцийНазначения.Ссылка.Валюта,
	|	КалькуляцияСписокСтанцийНазначения.Станция,
	|	КалькуляцияСписокСтанцийНазначения.Ссылка.ТарифицируемыйРазмерКТК,
	|	КалькуляцияСписокСтанцийНазначения.Ссылка.ММ_ИтогоВознаграждение,
	|	КалькуляцияСписокСтанцийНазначения.Ссылка.ММ_ИтогоВознаграждение20";
	
	Запрос.УстановитьПараметр("Калькуляция", Калькуляция);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	ДанныеКалькуляции = Новый Структура;
	ДанныеКалькуляции.Вставить("Калькуляция", Документы.Калькуляция.ПустаяСсылка());
	ДанныеКалькуляции.Вставить("СтавкаНДС", Перечисления.СтавкиНДС.ПустаяСсылка());
	ДанныеКалькуляции.Вставить("СуммаВключаетНДС", Ложь);
	ДанныеКалькуляции.Вставить("Валюта", Справочники.Валюты.ПустаяСсылка());
	ДанныеКалькуляции.Вставить("Ставка20", 0);
	ДанныеКалькуляции.Вставить("Ставка40", 0);
	
	Для Каждого Строка Из Выгрузка Цикл
		ДанныеКалькуляции = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Строка);
	КонецЦикла;
	
	Возврат ДанныеКалькуляции;
	
КонецФункции

Функция ПолучитьКлючАналитикиСоставаПоезда(Сделка, Контейнер)
	
	КлючАналитикиСоставаПоезда = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.КлючАналитикиСоставаПоезда КАК КлючАналитикиСоставаПоезда
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|ГДЕ
	|	СделкаСвязьУчетныхЕдиниц.Контейнер = &Контейнер
	|	И СделкаСвязьУчетныхЕдиниц.Ссылка = &Сделка";
	
	Запрос.УстановитьПараметр("Контейнер", Контейнер);
	Запрос.УстановитьПараметр("Сделка", Сделка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КлючАналитикиСоставаПоезда = ВыборкаДетальныеЗаписи.КлючАналитикиСоставаПоезда;
	КонецЦикла;
	
	Возврат КлючАналитикиСоставаПоезда;
	
КонецФункции


