#Область ПрограммныйИнтерфейс
//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, начало
Функция СоздатьЗапросНаПолучениеНомера(XMLParams) Экспорт
	
	ОтветГУИД = "";
	ОтветМассивСтрокИнформирование = Новый Массив;
	ОтветФлагОшибки = Ложь;
	
	//от внешней системы приходит запрос на получение номера в файле гуид КА из БФ, имя системы запрашивающей данные
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ГУИД_Контрагента", "");
	СтруктураПараметров.Вставить("ИсточникЗапроса", "");
	//Евросиб Шевченко А.В. US 117988 TA 118023 27.08.2025
	СтруктураПараметров.Вставить("ИдентификаторЗаявки", "");
	//Евросиб Шевченко А.В. US 117988 TA 118023 27.08.2025
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(XMLParams);
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(Чтение);
	
	Если ОбъектXDTO.Свойства().Получить("ГУИД_Контрагента") <> Неопределено Тогда
		СтруктураПараметров.Вставить("ГУИД_Контрагента", ОбъектXDTO.ГУИД_Контрагента);
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("ИсточникЗапроса") <> Неопределено Тогда
		СтруктураПараметров.Вставить("ИсточникЗапроса", ОбъектXDTO.ИсточникЗапроса);
	КонецЕсли;
	//Евросиб Шевченко А.В. US 117988 TA 118023 27.08.2025
	Если ОбъектXDTO.Свойства().Получить("ИдентификаторЗаявки") <> Неопределено Тогда
		СтруктураПараметров.Вставить("ИдентификаторЗаявки", ОбъектXDTO.ИдентификаторЗаявки);
	КонецЕсли;
	//Евросиб Шевченко А.В. US 117988 TA 118023 27.08.2025
	Для Каждого Параметр Из СтруктураПараметров Цикл
		//Евросиб Шевченко А.В. US 117988 TA 118023 27.08.2025
		Если Параметр.Ключ = "ИдентификаторЗаявки" Тогда
			Продолжить;
		КонецЕсли;	
		//Евросиб Шевченко А.В. US 117988 TA 118023 27.08.2025
		Если НЕ ЗначениеЗаполнено(Параметр.Значение) Тогда
			ОтветФлагОшибки = Истина;
			ОтветМассивСтрокИнформирование.Добавить("не указан параметр " + Параметр.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	КонтрагентСсылка = Неопределено;
	ИсточникЗапросаСсылка = Неопределено;
	Если НЕ ОтветФлагОшибки Тогда
		
		КонтрагентСсылка = РегистрыСведений.ПротоколОбменов.СсылкаПоУИД(СтруктураПараметров.ГУИД_Контрагента, 
																			Перечисления.ДействияПриОбмене.ЗагрузкаДанных, 
																			Перечисления.УзлыОбмена.БитФинанс, 
																			Тип("СправочникСсылка.Контрагенты"));
		
		Если КонтрагентСсылка = Неопределено 
			Или ТипЗнч(КонтрагентСсылка) <> Тип("СправочникСсылка.Контрагенты")
			Или КонтрагентСсылка = Справочники.Контрагенты.ПустаяСсылка() Тогда
				ОтветФлагОшибки = Истина;
				ОтветМассивСтрокИнформирование.Добавить("не найден контрагент по ГУИД = " + СтруктураПараметров.ГУИД_Контрагента);
		КонецЕсли;
		
		ИсточникЗапросаСсылка = ПолучитьПеречислениеУзелОбменаПоИмени(СтруктураПараметров.ИсточникЗапроса);
		Если ИсточникЗапросаСсылка = Неопределено Тогда
			ОтветФлагОшибки = Истина;
			ОтветМассивСтрокИнформирование.Добавить("не найден Источник запроса по имени " + СтруктураПараметров.ИсточникЗапроса);
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ОтветФлагОшибки Тогда
		
		//Евросиб Шевченко А.В. US 117988 TA 118023 27.08.2025
		
		//РезультатЗапроса = РегистрыСведений.ВнешниеНомераЗаявок.ПолучитьНомерЗаявкиПоИдентификаторуЗаявкиИКонтрагенту(СтруктураПараметров.ИдентификаторЗаявки,КонтрагентСсылка,ИсточникЗапросаСсылка);
	
		//Если НЕ РезультатЗапроса.Успешно Тогда			
		СтруктураПараметров.Вставить("Контрагент", КонтрагентСсылка);
		СтруктураПараметров.Вставить("ИсточникЗапросаСсылка", ИсточникЗапросаСсылка);
		РезультатЗапроса = РегистрыСведений.ВнешниеНомераЗаявок.ЗафиксироватьЗапросНомераЗаявки(СтруктураПараметров); 	
		//КонецЕсли;
		//Евросиб Шевченко А.В. US 117988 TA 118023 27.08.2025
		Если НЕ РезультатЗапроса.Успешно Тогда
			ОтветМассивСтрокИнформирование.Добавить(РезультатЗапроса.ТекстИнформирования);
			ОтветФлагОшибки = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ТекстОшибки = СтрСоединить(ОтветМассивСтрокИнформирование, "; ");
	
	Если НЕ ОтветФлагОшибки Тогда
		//отдаем зарезервированный гуид документа, номер заявки (итоговый номер  из РС) 
		СтрокаXML = ОтветноеСообщениеНаПолучениеНомера(РезультатЗапроса.ГУИД_Заявки, РезультатЗапроса.НомерЗаявки, ОтветФлагОшибки, ТекстОшибки);
	Иначе
		//возвращать ошибку если в запросе не заполнены данные, или если не найдены КА или имя ИС 
		СтрокаXML = ОтветноеСообщениеНаПолучениеНомера("", "", ОтветФлагОшибки, ТекстОшибки);
	КонецЕсли;

	Возврат СтрокаXML;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, начало
Функция ОбразецЗапросаИОтветаНомераЗаявки() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЗапросНомераЗаявки","");
	Результат.Вставить("ОтветНаЗапрос","");
	
	//ЗапросНомераЗаявки
	ЗаписьXML = Новый ЗаписьXML; 
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьОбъявлениеXML();	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ЗапросНомераЗаявки");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ГУИД_Контрагента");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(Новый УникальныйИдентификатор));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИсточникЗапроса");
	ЗаписьXML.ЗаписатьТекст("ЛК");
	ЗаписьXML.ЗаписатьКонецЭлемента();

	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Результат.ЗапросНомераЗаявки = ЗаписьXML.Закрыть();
	
	//ОтветНаЗапрос
	ГУИД_Документа = Новый УникальныйИдентификатор;
	Результат.ОтветНаЗапрос = ОтветноеСообщениеНаПолучениеНомера(ГУИД_Документа, "ABBREVEAT_999999", Ложь, "...");
	
	Возврат Результат;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, начало
Функция ВыгрузитьЗаявки(XMLParams) Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ГУИД", "");
	СтруктураПараметров.Вставить("ИсточникЗапроса", "");
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(XMLParams);
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(Чтение);
	
	Если ОбъектXDTO.Свойства().Получить("ИсточникЗапроса") <> Неопределено Тогда
		СтруктураПараметров.Вставить("ИсточникЗапроса", ОбъектXDTO.ИсточникЗапроса);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ИсточникЗапроса) Тогда
		Возврат СформироватьСообщениеОшибкиЗапросаНаВыгрузку("Не указан источник запроса");
	КонецЕсли;
	
	УзелОбмена = Неопределено;
	Для каждого ЗначПеречисления Из Метаданные.Перечисления.УзлыОбмена.ЗначенияПеречисления Цикл
		Если ЗначПеречисления.Имя = СтруктураПараметров.ИсточникЗапроса Тогда
			УзелОбмена = Перечисления.УзлыОбмена[ЗначПеречисления.Имя];
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	Если УзелОбмена = Неопределено Тогда
		Возврат СформироватьСообщениеОшибкиЗапросаНаВыгрузку("Не найден узел обмена для источника запроса "+СтруктураПараметров.ИсточникЗапроса);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Если ЗначениеЗаполнено(СтруктураПараметров.ГУИД) Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПротоколОбменов.Объект КАК Заявка
		//|ПОМЕСТИТЬ ВТ_Заявки
		|ИЗ
		|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		|ГДЕ
		|	ПротоколОбменов.УИДИсточника = &ГУИД
		|	И ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных)
		|	И ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.ЛК)";
		Запрос.УстановитьПараметр("ГУИД", СтруктураПараметров.ГУИД);
		
	Иначе
		
		УзлыПланаОбмена = ПланыОбмена.ОбменЗаявками.ПолучитьУзелОбмена(УзелОбмена);
		Если Не ЗначениеЗаполнено(УзлыПланаОбмена) Тогда
			Возврат СформироватьСообщениеОшибкиЗапросаНаВыгрузку("Не настроен узел плана обмена для "+СтруктураПараметров.ИсточникЗапроса);
		КонецЕсли;
		
		УзелПланаОбмена = УзлыПланаОбмена[0];
				
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаИзменения.Ссылка КАК Ссылка
		//|ПОМЕСТИТЬ ВТ_Заявки
		|ИЗ
		|	Документ.Заявка.Изменения КАК ЗаявкаИзменения
		|ГДЕ
		|	ЗаявкаИзменения.Узел = &УзелПланаОбмена
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВидыПеревозокИзменения.Ссылка
		|ИЗ
		|	Справочник.ВидыПеревозок.Изменения КАК ВидыПеревозокИзменения
		|ГДЕ
		|	ВидыПеревозокИзменения.Узел = &УзелПланаОбмена
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ГрузыИзменения.Ссылка
		|ИЗ
		|	Справочник.Грузы.Изменения КАК ГрузыИзменения
		|ГДЕ
		|	ГрузыИзменения.Узел = &УзелПланаОбмена
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛокацииИзменения.Ссылка
		|ИЗ
		|	Справочник.Локации.Изменения КАК ЛокацииИзменения
		|ГДЕ
		|	ЛокацииИзменения.Узел = &УзелПланаОбмена
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СервисыУчетноеНаправлениеИзменения.Ссылка
		|ИЗ
		|	Справочник.СервисыУчетноеНаправление.Изменения КАК СервисыУчетноеНаправлениеИзменения
		|ГДЕ
		|	СервисыУчетноеНаправлениеИзменения.Узел = &УзелПланаОбмена
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТипоразмерыТЕИзменения.Ссылка
		|ИЗ
		|	Справочник.ТипоразмерыТЕ.Изменения КАК ТипоразмерыТЕИзменения
		|ГДЕ
		|	ТипоразмерыТЕИзменения.Узел = &УзелПланаОбмена";
		Запрос.УстановитьПараметр("УзелПланаОбмена", УзелПланаОбмена);
		
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Запись = Новый ЗаписьXML; 
	Запись.УстановитьСтроку();
	Запись.ЗаписатьОбъявлениеXML();
	Запись.ЗаписатьНачалоЭлемента("Данные");
	
	Пока Выборка.Следующий() Цикл
		
		//ТипСсылкиОпределен = Истина;
		//Евросиб(ДИТ), Беляев СЮ, US 101347 / TA 115452, 30-07-2025, начало
		РегистрироватьВПротоколОбменов = Ложь;
		//Евросиб(ДИТ), Беляев СЮ, US 101347 / TA 115452, 30-07-2025, конец
		Если ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.Заявка") Тогда
			ДобавитьДанныеЗаявки(Запись, Выборка.Ссылка, УзелОбмена);
			//Евросиб(ДИТ), Беляев СЮ, US 101347 / TA 115452, 30-07-2025, начало
			РегистрироватьВПротоколОбменов = Истина;
			//Евросиб(ДИТ), Беляев СЮ, US 101347 / TA 115452, 30-07-2025, конец
		ИначеЕсли ТипЗнч(Выборка.Ссылка) = Тип("СправочникСсылка.Локации") Тогда
			ДобавитьСправочникЛокации(Запись, Выборка.Ссылка);
		ИначеЕсли ТипЗнч(Выборка.Ссылка) = Тип("СправочникСсылка.Грузы") Тогда
			ДобавитьСправочникГрузы(Запись, Выборка.Ссылка);
		ИначеЕсли ТипЗнч(Выборка.Ссылка) = Тип("СправочникСсылка.ВидыПеревозок") Тогда
			ДобавитьСправочникВидыПеревозок(Запись, Выборка.Ссылка);
		ИначеЕсли ТипЗнч(Выборка.Ссылка) = Тип("СправочникСсылка.СервисыУчетноеНаправление") Тогда
			ДобавитьСправочникСервисыУчетноеНаправление(Запись, Выборка.Ссылка);
		ИначеЕсли ТипЗнч(Выборка.Ссылка) = Тип("СправочникСсылка.ТипоразмерыТЕ") Тогда
			ДобавитьСправочникТипоразмерыТЕ(Запись, Выборка.Ссылка);
		Иначе
			//ТипСсылкиОпределен = Ложь;
		КонецЕсли;	
		
		//Если ТипСсылкиОпределен Тогда
		//Евросиб(ДИТ), Беляев СЮ, US 101347 / TA 115452, 30-07-2025, начало
		Если РегистрироватьВПротоколОбменов Тогда
		//Евросиб(ДИТ), Беляев СЮ, US 101347 / TA 115452, 30-07-2025, конец
			ГУИД = XMLСтрока(Выборка.Ссылка);
			СтруктураПоиска = Новый Структура("ДействиеПриОбмене, УзелОбмена, Объект", Перечисления.ДействияПриОбмене.ВыгрузкаДанных, УзелОбмена, Выборка.Ссылка);
			СтруктураДанных = Новый Структура("УИДИсточника, ЗагрузкаПодтверждена, ДатаОбмена", ГУИД, Ложь, ТекущаяДата());
			РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных);
		Иначе
			//Евросиб(ДИТ), Беляев СЮ, US 101347 / TA 115452, 30-07-2025, начало
			//убираем сразу регистрацию из плана, загрузку таких данных не подтверждают внешние системы
			ПланыОбмена.УдалитьРегистрациюИзменений(УзелПланаОбмена, Выборка.Ссылка);
			//Евросиб(ДИТ), Беляев СЮ, US 101347 / TA 115452, 30-07-2025, конец
		КонецЕсли;
	
	КонецЦикла;
	
	Запись.ЗаписатьКонецЭлемента(); //Данные
	
	СообщениеXML = Запись.Закрыть();
	
	Возврат СообщениеXML;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, начало
Функция ОбновитьДанныеЗаявки(XMLParams) Экспорт
	
	СтруктураПараметров = Новый Структура;
	//СтруктураПараметров.Вставить("ГУИД", "");
	СтруктураПараметров.Вставить("ИсточникЗапроса", "");
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(XMLParams);
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(Чтение);
	
	Если ОбъектXDTO.Свойства().Получить("ИсточникЗапроса") <> Неопределено Тогда
		СтруктураПараметров.Вставить("ИсточникЗапроса", ОбъектXDTO.ИсточникЗапроса);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ИсточникЗапроса) Тогда
		Возврат СформироватьСообщениеОшибкиЗапросаНаВыгрузку("Не указан источник запроса");
	КонецЕсли;
	
	УзелОбмена = Неопределено;
	Для каждого ЗначПеречисления Из Метаданные.Перечисления.УзлыОбмена.ЗначенияПеречисления Цикл
		Если ЗначПеречисления.Имя = СтруктураПараметров.ИсточникЗапроса Тогда
			УзелОбмена = Перечисления.УзлыОбмена[ЗначПеречисления.Имя];
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если УзелОбмена = Неопределено Тогда
		Возврат СформироватьСообщениеОшибкиЗапросаНаВыгрузку("Не найден узел обмена для источника запроса "+СтруктураПараметров.ИсточникЗапроса);
	КонецЕсли;
	
	МассивРезультатовЗагрузки = Новый Массив;
	
	Если ОбъектXDTO.Свойства().Получить("Заявка") <> Неопределено Тогда
		
		Если ТипЗнч(ОбъектXDTO.Заявка) = Тип("ОбъектXDTO") Тогда
			
			РезультатЗагрузки = ЗагрузитьОбновитьДанныеЗаявки(ОбъектXDTO.Заявка, УзелОбмена);
			МассивРезультатовЗагрузки.Добавить(РезультатЗагрузки);
			
		ИначеЕсли ТипЗнч(ОбъектXDTO.Заявка) = Тип("СписокXDTO") Тогда
			
			Для Каждого ТекЗаявка Из ОбъектXDTO.Заявка Цикл
				
				РезультатЗагрузки = ЗагрузитьОбновитьДанныеЗаявки(ТекЗаявка, УзелОбмена);
				МассивРезультатовЗагрузки.Добавить(РезультатЗагрузки);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаписьXML = Новый ЗаписьXML; 
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("РезультатОбработки");
	
	Для Каждого ТекРезультат Из МассивРезультатовЗагрузки Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Документ");
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("УспешноЗагружен");
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(ТекРезультат.УспешноЗагружен));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ГУИД_Документа");
		ЗаписьXML.ЗаписатьТекст(ТекРезультат.ГУИД);
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Информация");
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(ТекРезультат.Информация));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		//Евросиб(ДИТ), Беляев СЮ, US 104177 / TA 104443, 21-03-2025, начало
		ЗаписьXML.ЗаписатьНачалоЭлемента("КлючиАналитикиПеревозки");
		Если ТекРезультат.КлючиАналитикиПеревозки <> Неопределено Тогда
			Для Каждого СтруктураКлюч Из ТекРезультат.КлючиАналитикиПеревозки Цикл
				ЗаписьXML.ЗаписатьНачалоЭлемента("КлючАналитикиПеревозки");
				ЗаписьXML.ЗаписатьАтрибут("id", XMLСтрока(СтруктураКлюч.id));
				ЗаписьXML.ЗаписатьАтрибут("КлючАналитикиПеревозки", XMLСтрока(СтруктураКлюч.КлючАналитикиПеревозки));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЦикла;
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента();
		//Евросиб(ДИТ), Беляев СЮ, US 104177 / TA 104443, 21-03-2025, конец
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, начало
Функция ПодтвердитьЗагрузкуДокументовВУзелОбмена(XMLParams) Экспорт

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СписокГУИД", "");
	СтруктураПараметров.Вставить("ИсточникЗапроса", "");
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(XMLParams);
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(Чтение);
	
	МассивОшибок = Новый Массив;
	МассивУспешноОбработанных = Новый Массив;
	
	Если ОбъектXDTO.Свойства().Получить("ИсточникЗапроса") <> Неопределено Тогда
		СтруктураПараметров.Вставить("ИсточникЗапроса", ОбъектXDTO.ИсточникЗапроса);
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("СписокГУИД") <> Неопределено Тогда
		СтруктураПараметров.Вставить("СписокГУИД", ОбъектXDTO.СписокГУИД);
	Иначе
		МассивОшибок.Добавить("Не указан список ГУИД");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.ИсточникЗапроса) Тогда
		МассивОшибок.Добавить("Не указан источник запроса");
	КонецЕсли;
	
	Если МассивОшибок.Количество()>0 Тогда
		Возврат СформироватьСообщениеОПодтверждении(МассивОшибок, МассивУспешноОбработанных);
	КонецЕсли;
	
	УзелОбмена = Неопределено;
	Для каждого ЗначПеречисления Из Метаданные.Перечисления.УзлыОбмена.ЗначенияПеречисления Цикл
		Если ЗначПеречисления.Имя = СтруктураПараметров.ИсточникЗапроса Тогда
			УзелОбмена = Перечисления.УзлыОбмена[ЗначПеречисления.Имя];
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	Если УзелОбмена = Неопределено Тогда
		МассивОшибок.Добавить("Не найден узел обмена для источника запроса "+СтруктураПараметров.ИсточникЗапроса);
		Возврат СформироватьСообщениеОПодтверждении(МассивОшибок, МассивУспешноОбработанных);
	КонецЕсли;
	
	УзелПланаОбмена = ПланыОбмена.ОбменЗаявками.ПолучитьУзелОбмена(УзелОбмена);
	Если Не ЗначениеЗаполнено(УзелПланаОбмена) Тогда	
		МассивОшибок.Добавить("Не настроен узел плана обмена для "+СтруктураПараметров.ИсточникЗапроса);
		Возврат СформироватьСообщениеОПодтверждении(МассивОшибок, МассивУспешноОбработанных);
	КонецЕсли;
	
	Если ТипЗнч(ОбъектXDTO.СписокГУИД.ГУИД) = Тип("Строка") Тогда
		
		ПодтвердитьЗагрузкуПоГУИД(ОбъектXDTO.СписокГУИД.ГУИД, УзелОбмена, УзелПланаОбмена, МассивОшибок, МассивУспешноОбработанных);
		
	ИначеЕсли ТипЗнч(ОбъектXDTO.СписокГУИД.ГУИД) = Тип("СписокXDTO") Тогда
		
		Для Каждого ТекГуид Из ОбъектXDTO.СписокГУИД.ГУИД Цикл

			ПодтвердитьЗагрузкуПоГУИД(ТекГуид, УзелОбмена, УзелПланаОбмена, МассивОшибок, МассивУспешноОбработанных);
			
		КонецЦикла;
		
	КонецЕсли;
		
	Возврат СформироватьСообщениеОПодтверждении(МассивОшибок, МассивУспешноОбработанных);
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, конец
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, начало
Функция СформироватьСообщениеОшибкиЗапросаНаВыгрузку(ТекстОшибки)
	Запись = Новый ЗаписьXML; 
	Запись.УстановитьСтроку();
	Запись.ЗаписатьОбъявлениеXML();
	Запись.ЗаписатьНачалоЭлемента("Ошибка");
	Запись.ЗаписатьТекст(ТекстОшибки);
	Запись.ЗаписатьКонецЭлемента();
	Возврат Запись.Закрыть();	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, начало
Функция СформироватьСообщениеОПодтверждении(МассивОшибок, МассивУспешноОбработанных)
	
	ФлагОшибки = МассивОшибок.Количество() > 0;
	
	Запись = Новый ЗаписьXML; 
	Запись.УстановитьСтроку();
	Запись.ЗаписатьОбъявлениеXML();
	Запись.ЗаписатьНачалоЭлемента("РезультатОбработки");
	
	Запись.ЗаписатьНачалоЭлемента("ФлагОшибки");
	Запись.ЗаписатьТекст(XMLСтрока(ФлагОшибки));
	Запись.ЗаписатьКонецЭлемента();
	
	Запись.ЗаписатьНачалоЭлемента("Ошибки");
	Для Каждого ТекОшибка Из МассивОшибок Цикл
		Запись.ЗаписатьНачалоЭлемента("Ошибка");
		Запись.ЗаписатьТекст(ТекОшибка);
		Запись.ЗаписатьКонецЭлемента();
	КонецЦикла;
	Запись.ЗаписатьКонецЭлемента();
	
	Запись.ЗаписатьНачалоЭлемента("Подтвержденные");
	Для Каждого ТекГУИД Из МассивУспешноОбработанных Цикл
		Запись.ЗаписатьНачалоЭлемента("Подтвержден");
		Запись.ЗаписатьТекст(ТекГУИД);
		Запись.ЗаписатьКонецЭлемента();
	КонецЦикла;
	Запись.ЗаписатьКонецЭлемента();
	
	Запись.ЗаписатьКонецЭлемента();
	
	Возврат Запись.Закрыть();
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, начало
Процедура ПодтвердитьЗагрузкуПоГУИД(ТекГуид, УзелОбмена, УзелПланаОбмена, МассивОшибок, МассивУспешноОбработанных)
	
	СсылкаНаОбъект = РегистрыСведений.ПротоколОбменов.СсылкаПоУИД(ТекГуид, Перечисления.ДействияПриОбмене.ВыгрузкаДанных, УзелОбмена);
	Если СсылкаНаОбъект = Неопределено Тогда
		МассивОшибок.Добавить("Не найден объект по ГУИД "+ ТекГуид );
		Возврат;
	Иначе
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(СсылкаНаОбъект);
	КонецЕсли;
	
	ТекстОшибки = "";
	ПодвержденаЗагрузка = ПодтвердитьЗагрузкуДокумента(СсылкаНаОбъект, ТекГуид, МенеджерОбъекта, УзелОбмена, УзелПланаОбмена, ТекстОшибки);
	
	Если НЕ ПодвержденаЗагрузка Тогда
		МассивОшибок.Добавить(ТекстОшибки);
	Иначе
		МассивУспешноОбработанных.Добавить(ТекГуид);
	КонецЕсли;
	
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, начало
Функция ПодтвердитьЗагрузкуДокумента(СсылкаНаОбъект, ГУИД, МенеджерОбъекта, УзелОбмена, УзелПланаОбмена, ТекстРезультат)
	
	ВыгрузкаДанных = Перечисления.ДействияПриОбмене.ВыгрузкаДанных;
	
	ПланыОбмена.УдалитьРегистрациюИзменений(УзелПланаОбмена, СсылкаНаОбъект);
	ПодтвердитьЗагрузкуОбъектаПоГУИДБезПроведения(ГУИД, ВыгрузкаДанных, УзелОбмена, СсылкаНаОбъект);
	
	Возврат Истина;
			
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, начало
Процедура ПодтвердитьЗагрузкуОбъектаПоГУИДБезПроведения(ГУИД, Действие, УзелОбмена, СсылкаНаОбъект = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		СсылкаНаОбъект = РегистрыСведений.ПротоколОбменов.СсылкаПоУИД(ГУИД, Действие, УзелОбмена);
	КонецЕсли;
	
	Если СсылкаНаОбъект <> Неопределено Тогда
		
		Объект = СсылкаНаОбъект.Получитьобъект();
		
		НаборЗаписей = РегистрыСведений.ПротоколОбменов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДействиеПриОбмене.Установить(Действие);
		НаборЗаписей.Отбор.УзелОбмена.Установить(УзелОбмена);
		НаборЗаписей.Отбор.Объект.Установить(Объект.ссылка);
		
		НаборЗаписей.Прочитать();
		Для Каждого Запись Из НаборЗаписей Цикл
			Запись.ЗагрузкаПодтверждена = Истина; 
		КонецЦикла;
		НаборЗаписей.Записать();
		
	КонецЕсли;

КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, коне

//Евросиб(ДИТ), Беляев СЮ, US 90032 / TA 108264, 29-04-2025, начало
Функция ПолучитьСвязанныйСтатусДляУзлаОбмена(УзелОбмена, Статус)
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СтатусыДокументовСоспоставлениеСтатусов.СтатусДокумента КАК СтатусДокумента
		|ИЗ
		|	Справочник.СтатусыДокументов.СоспоставлениеСтатусов КАК СтатусыДокументовСоспоставлениеСтатусов
		|ГДЕ
		|	СтатусыДокументовСоспоставлениеСтатусов.УзелОбмена = &УзелОбмена
		|	И СтатусыДокументовСоспоставлениеСтатусов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Статус);
	Запрос.УстановитьПараметр("УзелОбмена", УзелОбмена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.СтатусДокумента;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 90032 / TA 108264, 29-04-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, начало
Функция ЗагрузитьОбновитьДанныеЗаявки(ОбъектXDTOЗаявки, УзелОбмена)
	
	РезультатФункции = Новый Структура("УспешноЗагружен, Информация, ГУИД, КлючиАналитикиПеревозки", Ложь, "", "", Неопределено);
	
	//	ОбъектXDTOЗаявки	ОбъектXDTO	ОбъектXDTO
	//+ВидПеревозки	ОбъектXDTO	ОбъектXDTO
	//+ГУИД	"16a60e79-7fbb-11ef-b852-00155dfba800"	Строка
	//+ГрузоотправительПоВнешнеторговомуКонтракту	"Грузоотправитель по внешнему - тест"	Строка
	//+ГрузополучательПоВнешнеторговомуКонтракту	"Грузополучатель по внешнему - тест"	Строка
	//+ДатаОформленияЗаявки	"2025-02-05T00:00:00"	Строка
	//+Договор	ОбъектXDTO	ОбъектXDTO
	//Контейнеры	ОбъектXDTO	ОбъектXDTO
	//+Контрагент	ОбъектXDTO	ОбъектXDTO
	//+НаправлениеПеревозки	"Импорт"	Строка
	//+НомерЗаявки	"KANTASIS_1"	Строка
	//Нотис	ОбъектXDTO	ОбъектXDTO
	//+СогласованнаяCтавка	"жд 250 + море 320"	Строка
	//+СтатусЗаявки	"В работе"	Строка
	//+ТипПеревозки	ОбъектXDTO	ОбъектXDTO
		
	ГУИД = ОбъектXDTOЗаявки.ГУИД;
	РезультатФункции.ГУИД = ГУИД;
	
	НомерЗаявки = РегистрыСведений.ВнешниеНомераЗаявок.ПолучитьНомерЗаявкиПоГУИД(ГУИД);
	Если НЕ ЗначениеЗаполнено(НомерЗаявки) Тогда
		РезультатФункции.УспешноЗагружен = Ложь;
		РезультатФункции.Информация = "Не найден запрос номера заявки по ГУИД "+ГУИД;
		Возврат РезультатФункции;
	КонецЕсли;
	
	МассивОшибокПоискаСправочныхДанных = Новый Массив;
	
	ЗаявкаСсылка = Документы.Заявка.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД));
	
	Если ОбщегоНазначения.СсылкаСуществует(ЗаявкаСсылка) Тогда
		ЗаявкаОбъект = ЗаявкаСсылка.ПолучитьОбъект();
	Иначе
		ЗаявкаОбъект = Документы.Заявка.СоздатьДокумент();
		ЗаявкаОбъект.Дата = ТекущаяДата();
		ЗаявкаОбъект.УстановитьНовыйНомер();
		ЗаявкаОбъект.УстановитьСсылкуНового(ЗаявкаСсылка);
		НовоеСостяние = ЗаявкаОбъект.Состояния.Добавить(); //иначе в списке документов не отображается
		НовоеСостяние.Состояние = Справочники.Состояния.Выполнение;
		ЗаявкаОбъект.ТекущееСостояние = Справочники.Состояния.Выполнение;
		Если УзелОбмена = Перечисления.УзлыОбмена.ЛК Тогда
			ЗаявкаОбъект.ЗаявкаЛККДКП = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ЗаявкаОбъект.ВнешнийНомер = НомерЗаявки;
	ЗаявкаОбъект.ГрузоотправительПоВнешнеторговомуКонтракту = ОбъектXDTOЗаявки.ГрузоотправительПоВнешнеторговомуКонтракту;
	ЗаявкаОбъект.ГрузополучательПоВнешнеторговомуКонтракту = ОбъектXDTOЗаявки.ГрузополучательПоВнешнеторговомуКонтракту;
	//ЗаявкаОбъект.ДатаОформленияЗаявки = XMLЗначение(Тип("Дата"), ОбъектXDTOЗаявки.ДатаОформленияЗаявки);
	//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 106847, 07-04-2025, начало
	ЗаявкаОбъект.ДатаОформленияЗаявки = ПреобразоватьДатуИзXML(ОбъектXDTOЗаявки.ДатаОформленияЗаявки);
	//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 106847, 07-04-2025, конец
	//ЗаявкаОбъект.ВидПеревозки = Справочники.ВидыПеревозок.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTOЗаявки.ВидПеревозки.ВидПеревозкиГУИД));
	ЗаявкаОбъект.ВидПеревозки = ПолучитьЭлементСправочникаПоГУИД("ВидыПеревозок", ОбъектXDTOЗаявки.ВидПеревозки.ВидПеревозкиГУИД, МассивОшибокПоискаСправочныхДанных, "ВидПеревозкиГУИД");
	//ЗаявкаОбъект.ТипПеревозки = Справочники.СервисыУчетноеНаправление.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTOЗаявки.ТипПеревозки.ТипПеревозкиГУИД));
	ЗаявкаОбъект.ТипПеревозки = ПолучитьЭлементСправочникаПоГУИД("СервисыУчетноеНаправление", ОбъектXDTOЗаявки.ТипПеревозки.ТипПеревозкиГУИД, МассивОшибокПоискаСправочныхДанных, "ТипПеревозкиГУИД");
	ЗаявкаОбъект.СогласованнаяCтавка = ОбъектXDTOЗаявки.СогласованнаяCтавка;
	ЗаявкаОбъект.НаправлениеПеревозки = ОбъектXDTOЗаявки.НаправлениеПеревозки;
	ЗаявкаОбъект.Контрагент = РегистрыСведений.ПротоколОбменов.СсылкаПоУИД(ОбъектXDTOЗаявки.Контрагент.КонтрагентГУИД, 
								Перечисления.ДействияПриОбмене.ЗагрузкаДанных, Перечисления.УзлыОбмена.БитФинанс, Тип("СправочникСсылка.Контрагенты"));
	ЗаявкаОбъект.Договор = РегистрыСведений.ПротоколОбменов.СсылкаПоУИД(ОбъектXDTOЗаявки.Договор.ДоговорГУИД, 
								Перечисления.ДействияПриОбмене.ЗагрузкаДанных, Перечисления.УзлыОбмена.БитФинанс, Тип("СправочникСсылка.ДоговорыКонтрагентов"));
	//Если ОбъектXDTOЗаявки.Свойства().Получить("Менеджер") <> Неопределено Тогда
		ЗаявкаОбъект.ОтветственныйМенеджер = НайтиСоздатьМенеджера(ОбъектXDTOЗаявки.Менеджер);
	//КонецЕсли;
	//Если ОбъектXDTOЗаявки.Свойства().Получить("КомментарийМенеджераЛК") <> Неопределено Тогда
		ЗаявкаОбъект.КомментарийМенеджераЛК = ОбъектXDTOЗаявки.КомментарийМенеджераЛК;
	//КонецЕсли;
	//Если ОбъектXDTOЗаявки.Свойства().Получить("СтатусЛК") <> Неопределено Тогда
		//ЗаявкаОбъект.СтатусЛК = Справочники.СтатусыДокументов.НайтиСтатусДокументаПоКодуСтатуса(ОбъектXDTOЗаявки.СтатусЛК);
	//КонецЕсли;
	
	//Евросиб(ДИТ), Беляев СЮ, US 90032 / TA 108264, 29-04-2025, начало
	Если УзелОбмена = Перечисления.УзлыОбмена.ЛК И ОбъектXDTOЗаявки.Свойства().Получить("КодСтатусаЛК") <> Неопределено Тогда
		ЗаявкаОбъект.СтатусЛК = Справочники.СтатусыДокументов.НайтиСтатусДокументаПоКодуСтатуса(ОбъектXDTOЗаявки.КодСтатусаЛК);
		НовыйСтатусЗаявки = ПолучитьСвязанныйСтатусДляУзлаОбмена(Перечисления.УзлыОбмена.DX, ЗаявкаОбъект.СтатусЛК);
		Если НовыйСтатусЗаявки <> Неопределено Тогда
			ЗаявкаОбъект.СтатусЗаявки = НовыйСтатусЗаявки;
		КонецЕсли;
	ИначеЕсли УзелОбмена = Перечисления.УзлыОбмена.DX И ОбъектXDTOЗаявки.Свойства().Получить("КодСтатусаЗаявки") <> Неопределено Тогда
		ЗаявкаОбъект.СтатусЗаявки = Справочники.СтатусыДокументов.НайтиСтатусДокументаПоКодуСтатуса(ОбъектXDTOЗаявки.КодСтатусаЗаявки);
		НовыйСтатусЛК = ПолучитьСвязанныйСтатусДляУзлаОбмена(Перечисления.УзлыОбмена.ЛК, ЗаявкаОбъект.СтатусЗаявки);
		Если НовыйСтатусЛК <> Неопределено Тогда
			ЗаявкаОбъект.СтатусЛК = НовыйСтатусЛК;
		КонецЕсли;
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 90032 / TA 108264, 29-04-2025, конец
	
	//КэшИменаУсловийПеревозкиКТК = Новый Соответствие;
	//Для Каждого ТекПеречисление Из Перечисления.УсловияПеревозкиКТК Цикл
	//	КэшИменаУсловийПеревозкиКТК.Вставить(ОбщегоНазначения.ИмяЗначенияПеречисления(ТекПеречисление), ТекПеречисление);
	//КонецЦикла;
	//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 106847, 18-04-2025, начало
	КэшПеречислений = КэшПеречислений("ПоискПеречисленияПоИмени");
	//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 106847, 18-04-2025, конец
	
	////Евросиб(ДИТ), Беляев СЮ, US 101434 / TA 103701, 04-06-2025, начало
	////<Файл ФайлГУИД="d9f5c578-4b33-402d-a592-9074b1843ff8" ИмяФайла="другой файл.txt" ТипФайла = "documentsLKDKP"/>
	//Если ОбъектXDTOЗаявки.Свойства().Получить("Файл") <> Неопределено Тогда
	//	ЗаявкаОбъект.ФайлВХранилищеГУИД = ОбъектXDTOЗаявки.Файл.ФайлГУИД;
	//	ЗаявкаОбъект.ФайлВХранилищеИмяФайла = ОбъектXDTOЗаявки.Файл.ИмяФайла;
	//	ЗаявкаОбъект.ФайлВХранилищеТипФайла = ОбъектXDTOЗаявки.Файл.ТипФайла;
	//КонецЕсли;
	////Евросиб(ДИТ), Беляев СЮ, US 101434 / TA 103701, 04-06-2025, конец
								
	Если ОбъектXDTOЗаявки.Свойства().Получить("Контейнеры") <> Неопределено Тогда
		Если ОбъектXDTOЗаявки.Контейнеры.Свойства().Получить("Строка") <> Неопределено Тогда
			Если ТипЗнч(ОбъектXDTOЗаявки.Контейнеры.Строка) = Тип("СписокXDTO") Тогда
				Для Каждого ТекСтрока Из ОбъектXDTOЗаявки.Контейнеры.Строка Цикл
					ЗагрузитьСтрокуЗаявки(ЗаявкаОбъект, ТекСтрока, КэшПеречислений, МассивОшибокПоискаСправочныхДанных, УзелОбмена);
				КонецЦикла;
			ИначеЕсли ТипЗнч(ОбъектXDTOЗаявки.Контейнеры.Строка) = Тип("ОбъектXDTO") Тогда
				ЗагрузитьСтрокуЗаявки(ЗаявкаОбъект, ОбъектXDTOЗаявки.Контейнеры.Строка, КэшПеречислений, МассивОшибокПоискаСправочныхДанных, УзелОбмена);
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
	
	//Евросиб(ДИТ), Беляев СЮ, US 113722 / TA 113989, 10-07-2025, начало
	Если ОбъектXDTOЗаявки.Свойства().Получить("Файлы") <> Неопределено Тогда
		Если ОбъектXDTOЗаявки.Файлы.Свойства().Получить("Файл") <> Неопределено Тогда
			ТаблицаФайлов = Новый ТаблицаЗначений;
			ТаблицаФайлов.Колонки.Добавить("ФайлГУИД", Новый ОписаниеТипов("Строка"));
			ТаблицаФайлов.Колонки.Добавить("ИмяФайла", Новый ОписаниеТипов("Строка"));
			ТаблицаФайлов.Колонки.Добавить("ТипФайла", Новый ОписаниеТипов("Строка"));
			ТаблицаФайлов.Колонки.Добавить("НомерВерсииФайла", Новый ОписаниеТипов("Строка"));
			//Евросиб Шевченко А.В US 116005 TA 116413 02.09.2025
			ТаблицаФайлов.Колонки.Добавить("СтатусДокумента", Новый ОписаниеТипов("Строка"));
			ТаблицаФайлов.Колонки.Добавить("Автор", Новый ОписаниеТипов("Строка"));
			ТаблицаФайлов.Колонки.Добавить("ДатаВремяСоздания", Новый ОписаниеТипов("Строка"));
			ТаблицаФайлов.Колонки.Добавить("Источник", Новый ОписаниеТипов("Строка"));
			ТаблицаФайлов.Колонки.Добавить("Комментарий", Новый ОписаниеТипов("Строка"));
			ТаблицаФайлов.Колонки.Добавить("НомерКТК", Новый ОписаниеТипов("Строка"));
			//Евросиб Шевченко А.В US 116005 TA 119060 09.09.2025
			ТаблицаФайлов.Колонки.Добавить("ПризнакУдаленияФайла", Новый ОписаниеТипов("Строка"));
			//Евросиб Шевченко А.В US 116005 TA 119060 09.09.2025
			//Евросиб Шевченко А.В US 116005 TA 116413 02.09.2025
			Если ТипЗнч(ОбъектXDTOЗаявки.Файлы.Файл) = Тип("СписокXDTO") Тогда
				Для Каждого ТекСтрока Из ОбъектXDTOЗаявки.Файлы.Файл Цикл
					НоваяСтрокаФайла = ТаблицаФайлов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаФайла, ТекСтрока);
				КонецЦикла;
			ИначеЕсли ТипЗнч(ОбъектXDTOЗаявки.Файлы.Файл) = Тип("ОбъектXDTO") Тогда
				НоваяСтрокаФайла = ТаблицаФайлов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаФайла, ОбъектXDTOЗаявки.Файлы.Файл);
			КонецЕсли;
			ЗагрузитьФайлыХранилища(ЗаявкаОбъект, ТаблицаФайлов);
		КонецЕсли;
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 113722 / TA 113989, 10-07-2025, конец
	
	Если МассивОшибокПоискаСправочныхДанных.Количество() > 0 Тогда
		РезультатФункции.УспешноЗагружен = Ложь;
		РезультатФункции.Информация = СтрСоединить(МассивОшибокПоискаСправочныхДанных, Символы.ПС);
		Возврат РезультатФункции;
	КонецЕсли;
	
	Попытка
		НачатьТранзакцию();
		
		СоздатьКлючиАналитикиПервозкиЗаявки(ЗаявкаОбъект);
		
		ЗаявкаОбъект.ОбменДанными.Загрузка = Истина;
		ЗаявкаОбъект.УстановитьКомментарийВерсииИсторииДанных("Загрузка данных из "+Строка(УзелОбмена));
		ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Запись);
		//Евросиб(ДИТ), Беляев СЮ, US 101347 / TA 114970, 21-07-2025, начало
		Если УзелОбмена = Перечисления.УзлыОбмена.ЛК Тогда
			ПланыОбмена.ОбменЗаявками.ЗарегистрироватьИзмененияПоДокументу(ЗаявкаОбъект.Ссылка, Перечисления.УзлыОбмена.DX);
		КонецЕсли;
		Если УзелОбмена = Перечисления.УзлыОбмена.DX Тогда
			ПланыОбмена.ОбменЗаявками.ЗарегистрироватьИзмененияПоДокументу(ЗаявкаОбъект.Ссылка, Перечисления.УзлыОбмена.ЛК);
		КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, US 101347 / TA 114970, 21-07-2025, конец
		
		МассивКлючейАналитикиПеревозки = Новый Массив;
		ЗаполнитьСсылкуНаЗаявкуКлючамАналитики(ЗаявкаОбъект, МассивКлючейАналитикиПеревозки);
		РезультатФункции.КлючиАналитикиПеревозки = МассивКлючейАналитикиПеревозки;
		
		ВремяЗагрузки = ТекущаяДата();
		СтруктураПоиска = Новый Структура("ДействиеПриОбмене, УзелОбмена, Объект", Перечисления.ДействияПриОбмене.ЗагрузкаДанных, УзелОбмена, ЗаявкаСсылка);
		СтруктураДанных = Новый Структура("УИДИсточника, ЗагрузкаПодтверждена, ДатаОбмена", ГУИД, Ложь, ВремяЗагрузки);
		РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных);
		РезультатФункции.УспешноЗагружен = Истина;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		РезультатФункции.УспешноЗагружен = Ложь;
		РезультатФункции.Информация = ОписаниеОшибки();
		Возврат РезультатФункции;
		
	КонецПопытки;
								
	Возврат РезультатФункции;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 113722 / TA 113989, 10-07-2025, начало
Процедура ЗагрузитьФайлыХранилища(ЗаявкаОбъект, ТаблицаФайлов)
	
	//ДОБАВЛЕНИЕ И ОБНОВЛЕНИЕ ФАЙЛОВ
	Для Каждого ТекФайл Из ТаблицаФайлов Цикл
		НайденнаяСтрока = ЗаявкаОбъект.ФайлыВХранилище.Найти(ТекФайл.ФайлГУИД, "ФайлВХранилищеГУИД");
		Если НайденнаяСтрока = Неопределено Тогда
			СтрокаФайлаТЧ = ЗаявкаОбъект.ФайлыВХранилище.Добавить();
			СтрокаФайлаТЧ.ФайлВХранилищеГУИД = ТекФайл.ФайлГУИД;
		Иначе
			СтрокаФайлаТЧ = НайденнаяСтрока;
		КонецЕсли;
		
		СтрокаФайлаТЧ.ФайлВХранилищеИмяФайла = ТекФайл.ИмяФайла;
		СтрокаФайлаТЧ.ФайлВХранилищеТипФайла = ТекФайл.ТипФайла;
		СтрокаФайлаТЧ.НомерВерсииФайла = ТекФайл.НомерВерсииФайла;
		//Евросиб Шевченко А.В US 116005 TA 116413 02.09.2025
		СтрокаФайлаТЧ.СтатусДокумента = ТекФайл.СтатусДокумента;
		СтрокаФайлаТЧ.Автор = ТекФайл.Автор;
		СтрокаФайлаТЧ.ДатаВремяСоздания = ТекФайл.ДатаВремяСоздания;
		СтрокаФайлаТЧ.Источник = ТекФайл.Источник;
		СтрокаФайлаТЧ.Комментарий = ТекФайл.Комментарий;
		СтрокаФайлаТЧ.НомерКТК = ТекФайл.НомерКТК;
		//Евросиб Шевченко А.В US 116005 TA 119060 09.09.2025
		СтрокаФайлаТЧ.ПризнакУдаленияФайла = ТекФайл.ПризнакУдаленияФайла;
		//Евросиб Шевченко А.В US 116005 TA 119060 09.09.2025
		//Евросиб Шевченко А.В US 116005 TA 116413 02.09.2025
	КонецЦикла;
	
	//УДАЛЕНИЕ ЛИШНИХ ФАЙЛОВ
	СтрокиНаУдаление = Новый Массив;
	Для Каждого ТекСтрока Из ЗаявкаОбъект.ФайлыВХранилище Цикл
		Если ТаблицаФайлов.Найти(ТекСтрока.ФайлВХранилищеГУИД, "ФайлГУИД") = Неопределено Тогда
			СтрокиНаУдаление.Добавить(ТекСтрока);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ТекСтрока Из СтрокиНаУдаление Цикл
		ЗаявкаОбъект.ФайлыВХранилище.Удалить(ТекСтрока);
	КонецЦикла;
	
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 113722 / TA 113989, 10-07-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 104177 / TA 104443, 21-03-2025, начало
Процедура СоздатьКлючиАналитикиПервозкиЗаявки(ЗаявкаОбъект)
	Для Каждого Стр Из ЗаявкаОбъект.СоставУслуги Цикл 
		СтруктураКлючаАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
		СтруктураКлючаАналитикиПеревозки.Контейнер = Стр.НомерКТК;
		СтруктураКлючаАналитикиПеревозки.КлючАналитики = Стр.КлючАналитикиПеревозки;
		СтруктураКлючаАналитикиПеревозки.Груз_ЕТСНГ = Стр.КодГруза;
		СтруктураКлючаАналитикиПеревозки.Груз_ГНГ = Стр.ГрузПоГНГ;
		//Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025
		//СтруктураКлючаАналитикиПеревозки.Груз_ТНВЭД = Стр.ГрузПоТНВЭД;
		СтруктураКлючаАналитикиПеревозки.Груз_ТНВЭД = Стр.КодГрузПоТНВЭД;
		//Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025
		//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 103849, 28-04-2025, начало
		СтруктураКлючаАналитикиПеревозки.КоличествоМест = Стр.КоличествоМест; 
		СтруктураКлючаАналитикиПеревозки.ВесГруза = Стр.ВесГрузаНетто;
		//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 103849, 28-04-2025, конец
		
		ОбновленныйКлюч = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлючаАналитикиПеревозки);
		Стр.КлючАналитикиПеревозки = ОбновленныйКлюч.КлючАналитикиПеревозки;
	КонецЦикла;
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 104177 / TA 104443, 21-03-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 104177 / TA 104443, 21-03-2025, начало
Процедура ЗаполнитьСсылкуНаЗаявкуКлючамАналитики(ЗаявкаОбъект, МассивКлючейАналитикиПеревозки)
	
	Для Каждого Стр Из ЗаявкаОбъект.СоставУслуги Цикл 
		СтруктураКлючаАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
		СтруктураКлючаАналитикиПеревозки.Заявка = ЗаявкаОбъект.Ссылка;
		СтруктураКлючаАналитикиПеревозки.КлючАналитики = Стр.КлючАналитикиПеревозки;
		ОбновленныйКлюч = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлючаАналитикиПеревозки);
		МассивКлючейАналитикиПеревозки.Добавить(Новый Структура("КлючАналитикиПеревозки, id", ОбновленныйКлюч.КлючАналитикиПеревозки, Стр.idисточника));
	КонецЦикла;
	
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 104177 / TA 104443, 21-03-2025, конец

Функция НайтиСоздатьМенеджера(МенеджерXDTO)
	
	НайденныйМенеджер = Справочники.Пользователи.ПустаяСсылка();
	
	//ПОИСК ПО ГУИД
	Если ЗначениеЗаполнено(МенеджерXDTO.МенеджерГУИД) Тогда
		НайденныйМенеджер = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(МенеджерXDTO.МенеджерГУИД));
	КонецЕсли;
	
	//ПОИСК ПО E-MAIL
	Если НайденныйМенеджер = Справочники.Пользователи.ПустаяСсылка() И ЗначениеЗаполнено(МенеджерXDTO.АдресЭлектроннойПочты) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПользователиКонтактнаяИнформация.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
			|ГДЕ
			|	ПользователиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
			|	И ПользователиКонтактнаяИнформация.Представление = &Представление";
		
		Запрос.УстановитьПараметр("Представление", МенеджерXDTO.АдресЭлектроннойПочты);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			НайденныйМенеджер = Выборка.Ссылка;
		КонецЕсли;
	
	КонецЕсли;
	
	//СОЗДАНИЕ МЕНЕДЖЕРА
	Если НайденныйМенеджер = Справочники.Пользователи.ПустаяСсылка() И ЗначениеЗаполнено(МенеджерXDTO.АдресЭлектроннойПочты) И ЗначениеЗаполнено(МенеджерXDTO.МенеджерФИО) Тогда
		
		НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
		НовыйПользователь.Наименование = МенеджерXDTO.МенеджерФИО;
		НовыйПользователь.Недействителен = Истина;
		СтрокаАдреса = НовыйПользователь.КонтактнаяИнформация.Добавить();
		СтрокаАдреса.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		СтрокаАдреса.Вид = Справочники.ВидыКонтактнойИнформации.EmailПользователя;
		СтрокаАдреса.Представление = МенеджерXDTO.АдресЭлектроннойПочты;
		НовыйПользователь.ОбменДанными.Загрузка = Истина;
		НовыйПользователь.Записать();
		
		НайденныйМенеджер = НовыйПользователь.Ссылка;
	КонецЕсли;
	
	Возврат НайденныйМенеджер;
	
КонецФункции

//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 106847, 07-04-2025, начало
Функция ПреобразоватьДатуИзXML( СтрокаДата )
	
	Результат = Дата(1,1,1);
	
	Попытка
		Результат = XMLЗначение(Тип("Дата"), СтрокаДата);
	Исключение
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 106847, 07-04-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, начало
Процедура ЗагрузитьСтрокуЗаявки(ЗаявкаОбъект, Строка , КэшПеречислений, МассивОшибокПоискаСправочныхДанных, УзелОбмена)
	
	//КэшИменаУсловийПеревозкиКТК = Новый Соответствие;
	//Для Каждого ТекПеречисление Из Перечисления.УсловияПеревозкиКТК Цикл
	//	КэшИменаУсловийПеревозкиКТК.Вставить(ОбщегоНазначения.ИмяЗначенияПеречисления(ТекПеречисление), ТекПеречисление);
	//КонецЦикла;
	
	КонтейнерСсылка = РаботаСКонтейнерамиСервер.НайтиКТК(Строка.ПараметрыКонтейнера.НомерКТК);
	
	//НайденнаяСтрока = ЗаявкаОбъект.СоставУслуги.Найти(КонтейнерСсылка,"НомерКТК");
	//Евросиб(ДИТ), Беляев СЮ, US 104177 / TA 104443, 21-03-2025, начало
	НайденнаяСтрока = ЗаявкаОбъект.СоставУслуги.Найти(Строка.id, "idисточника");
	//Евросиб(ДИТ), Беляев СЮ, US 104177 / TA 104443, 21-03-2025, конец
	
	Если НайденнаяСтрока = Неопределено Тогда
		НайденнаяСтрока = ЗаявкаОбъект.СоставУслуги.Добавить();
		НайденнаяСтрока.ГУИДСтроки = Новый УникальныйИдентификатор;
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 104177 / TA 104443, 21-03-2025, начало
	НайденнаяСтрока.idисточника = Строка.id;
	//Евросиб(ДИТ), Беляев СЮ, US 104177 / TA 104443, 21-03-2025, конец
	//ДатаГотовностиГрузаКПеревозке="2025-02-05T00:00:00" ДатаСтатуса="0001-01-01T00:00:00" 
	//СтатусКТК="" ТаможенныйРежим="" СтранаПроисхожденияГруза="00000000-0000-0000-0000-000000000000" ПеревозчикПоМорскомуПлечу=""
	//ИнструкцииПоСдачеПорожнего="" АдресЗабораГрузаСоСклада="" АдресДоставкиГруза=""
	//НайденнаяСтрока.ДатаГотовностиГрузаКПеревозке = XMLЗначение(Тип("Дата"), Строка.ДатаГотовностиГрузаКПеревозке);
	//НайденнаяСтрока.ДатаСтатуса = XMLЗначение(Тип("Дата"), Строка.ДатаСтатуса);
	//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 106847, 07-04-2025, начало
	НайденнаяСтрока.ДатаГотовностиГрузаКПеревозке = ПреобразоватьДатуИзXML(Строка.ДатаГотовностиГрузаКПеревозке);
	НайденнаяСтрока.ДатаСтатуса = ПреобразоватьДатуИзXML(Строка.ДатаСтатуса);
	//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 106847, 07-04-2025, конец
	//НайденнаяСтрока.СтатусКТК = Строка.СтатусКТК;
	//Евросиб(ДИТ), Беляев СЮ, US 112611 / TA 113905, 10-07-2025, начало
	//Если Строка.Свойства().Получить("СтатусКТККод") <> Неопределено Тогда
	//	Если ЗначениеЗаполнено(НайденнаяСтрока.СтатусКТК) И УзелОбмена = Перечисления.УзлыОбмена.ЛК Тогда
	//		//не меняем статус при загрузке из ЛК, только заполняем пустой
	//	Иначе
	//		//заполняем статус из ЛК если он пустой
	//		//из DX заполняем всегда, в том числе очищаем если DX не прислал ничего - очищщаем
	//		НайденнаяСтрока.СтатусКТК = ПолучитьСоздатьСтатусКТК(Строка.СтатусКТККод, Строка.СтатусКТК, УзелОбмена);
	//	КонецЕсли;
	//КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 112611 / TA 113905, 10-07-2025, конец
	//Евросиб(ДИТ), Беляев СЮ, US 101347 / TA 115452, 30-07-2025, начало
	Если ЗначениеЗаполнено(НайденнаяСтрока.СтатусКТК) И УзелОбмена = Перечисления.УзлыОбмена.ЛК Тогда
		//не меняем статус при загрузке из ЛК, только заполняем пустой
	Иначе
		//заполняем статус из ЛК если он пустой
		//из DX заполняем всегда, в том числе очищаем если DX не прислал ничего - очищщаем
		Если Строка.Свойства().Получить("СтатусКТККод") <> Неопределено И ЗначениеЗаполнено(Строка.СтатусКТККод) Тогда
			НайденнаяСтрока.СтатусКТК = ПолучитьСоздатьСтатусКТК(Строка.СтатусКТККод, Строка.СтатусКТК, УзелОбмена);
		Иначе
			НайденнаяСтрока.СтатусКТК = Справочники.СтатусыКТК.НайтиПоНаименованию(Строка.СтатусКТК, Истина, Справочники.СтатусыКТК.СтатусыЛичногоКабинета);
		КонецЕсли;
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 101347 / TA 115452, 30-07-2025, конец
	
	НайденнаяСтрока.ТаможенныйРежим = Строка.ТаможенныйРежим;
	НайденнаяСтрока.СтранаПроисхожденияГруза = ПолучитьЭлементСправочникаПоГУИД("Локации", Строка.СтранаПроисхожденияГруза, МассивОшибокПоискаСправочныхДанных, "СтранаПроисхожденияГруза"); //ПолучитьЛокациюПоГУИД(Строка.СтранаПроисхожденияГруза);
	НайденнаяСтрока.ПеревозчикПоМорскомуПлечу = Строка.ПеревозчикПоМорскомуПлечу;
	НайденнаяСтрока.ИнструкцииПоСдачеПорожнего = Строка.ИнструкцииПоСдачеПорожнего;
	НайденнаяСтрока.АдресПогрузки = ПолучитьЭлементСправочникаПоГУИД("Локации", Строка.АдресЗабораГрузаСоСклада, МассивОшибокПоискаСправочныхДанных, "АдресЗабораГрузаСоСклада"); //ПолучитьЛокациюПоГУИД(Строка.АдресЗабораГрузаСоСклада);
	НайденнаяСтрока.АдресВыгрузки = ПолучитьЭлементСправочникаПоГУИД("Локации", Строка.АдресДоставкиГруза, МассивОшибокПоискаСправочныхДанных, "АдресДоставкиГруза"); //ПолучитьЛокациюПоГУИД(Строка.АдресДоставкиГруза);
	
	//Евросиб(ДИТ), Беляев СЮ, US 104177 / TA 105665, 26-03-2025, начало
	НайденнаяСтрока.СтавкаМореUSD = Строка.СтавкаМореUSD;
	НайденнаяСтрока.СтавкаЖДРуб = Строка.СтавкаЖДРуб;
	НайденнаяСтрока.СтавкаАвтоРуб = Строка.СтавкаАвтоРуб;
	//Евросиб(ДИТ), Беляев СЮ, US 104177 / TA 105665, 26-03-2025, конец
			
	//Груз_ЕТСНГ = Строка.ГрузПоЕТСНГ;
	//Груз_ГНГ = Строка.ГрузПоГНГ;
	//Груз_ТНВЭД = Строка.ГрузПоТНВЭД;
	НайденнаяСтрока.КодГруза = Строка.ГрузПоЕТСНГ;
	НайденнаяСтрока.ГрузПоГНГ = Строка.ГрузПоГНГ;
	//Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025
	//НайденнаяСтрока.ГрузПоТНВЭД = Строка.ГрузПоТНВЭД;
	НайденнаяСтрока.КодГрузПоТНВЭД = Строка.ГрузПоТНВЭД;
	НайденнаяСтрока.ГрузПоТНВЭД = Справочники.ГрузыПоТНВЭД.ПолучитьСсылкуПоКодуИУровню(Строка.ГрузПоТНВЭД,Строка.ГрузПоТНВЭДУровень);
	//Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025
	
	//ПараметрыКонтейнера НомерКТК="TCNU5777149" РазмерКТК="40" КодISO="45G1" ТипоРазмерКТК="3f4c229e-cee1-11e9-b810-00155d152369" 
	//КлючАналитикиПеревозки="16a60e76-7fbb-11ef-b852-00155dfba800"
	НайденнаяСтрока.НомерКТК = КонтейнерСсылка;
	//НайденнаяСтрока.РазмерКТК = Справочники.РазмерыКТК.НайтиПоРеквизиту("Размер", XMLЗначение(Тип("Число"),Строка.ПараметрыКонтейнера.РазмерКТК));
	//НайденнаяСтрока.ТипКТК = ПолучитьТипоразмерТЕПоГУИД(Строка.ПараметрыКонтейнера.ТипоРазмерКТК);
	//НайденнаяСтрока.ТипКТК = ПолучитьЭлементСправочникаПоГУИД("ТипоразмерыТЕ", Строка.ПараметрыКонтейнера.ТипоРазмерКТК, МассивОшибокПоискаСправочныхДанных, "ПараметрыКонтейнера - ТипоРазмерКТК");
	//Евросиб(ДИТ), Беляев СЮ, US 104177 / TA 105665, 27-03-2025, начало
	//Если ЗначениеЗаполнено(Строка.ПараметрыКонтейнера.КодISO) Тогда
	//	ТипКТК = Справочники.ТипоразмерыТЕ.НайтиПоРеквизиту("КодISO", Строка.ПараметрыКонтейнера.КодISO);
	//	РазмерКТК = Неопределено;
	//	Если ЗначениеЗаполнено(ТипКТК) Тогда
	//		РазмерКТК = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТипКТК, "РазмерКТК");
	//	Иначе
	//		МассивОшибокПоискаСправочныхДанных.Добавить("Не найден типоразмер контейнера по КодISO = "+Строка.ПараметрыКонтейнера.КодISO);
	//	КонецЕсли;
	//	НайденнаяСтрока.ТипКТК = ТипКТК;
	//	НайденнаяСтрока.РазмерКТК = РазмерКТК;
	//КонецЕсли;
	НаименованиеКТК = Строка.ПараметрыКонтейнера.РазмерКТК + Строка.ПараметрыКонтейнера.ТипКТК;
	ТипоразмерТЕ = Справочники.ТипоразмерыТЕ.НайтиПоНаименованию(НаименованиеКТК, Истина);
	Если ТипоразмерТЕ <> Справочники.ТипоразмерыТЕ.ПустаяСсылка() Тогда
		РазмерКТК = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТипоразмерТЕ, "РазмерКТК");
		НайденнаяСтрока.ТипКТК = ТипоразмерТЕ;
		НайденнаяСтрока.РазмерКТК = РазмерКТК;
	Иначе
		МассивОшибокПоискаСправочныхДанных.Добавить("Не найден типоразмер контейнера размером "+ Строка.ПараметрыКонтейнера.РазмерКТК+" и типом "+Строка.ПараметрыКонтейнера.ТипКТК);
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 104177 / TA 105665, 27-03-2025, конец
	
	//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 106847, 18-04-2025, начало
	НайденнаяСтрока.ПринадлежностьТЕ = КэшПеречислений.КэшИменаПринадлежностьТЕ.Получить(Строка.ПараметрыКонтейнера.ПринадлежностьКТК);
	НайденнаяСтрока.Груженый = ?(Строка.ПараметрыКонтейнера.СостояниеКТК = "1", Истина, Ложь);
	//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 106847, 18-04-2025, конец
	
	//<Груз ГУИД="6ad486da-a20e-11ea-b819-00155dfba800" Наименование="1,1,1,2-тетрафторэтан" ГрузПоЕТСНГ="488" ГрузПоГНГ="29033926" ГрузПоТНВЭД="00" 
	//КоличествоМестГруза="1" ВесКонтейнераНетто="230"/>
	НайденнаяСтрока.Груз = ПолучитьЭлементСправочникаПоГУИД("Грузы", Строка.Груз.ГУИД, МассивОшибокПоискаСправочныхДанных, "Груз - ГУИД"); //ПолучитьГрузПоГУИД(Строка.Груз.ГУИД);
	НайденнаяСтрока.КоличествоМест = Строка.Груз.КоличествоМестГруза;
	НайденнаяСтрока.ВесГрузаНетто = Строка.Груз.ВесКонтейнераНетто;
	
	//<ПунктыИСтанции ПортОтправления="00000000-0000-0000-0000-000000000000" ПортНазначения="00000000-0000-0000-0000-000000000000"
	//ПунктОтправленияПоВнешнеторговомуКонтракту="00000000-0000-0000-0000-000000000000" ПунктНазначенияПоВнешнеторговомуКонтракту="00000000-0000-0000-0000-000000000000" 
	//СтанцияОтправления="2bff7ff1-716f-11e9-a9bc-90b11c00c9ff" СтанцияНазначения="4a2c0a07-cf44-11e9-b810-00155d152369"/>
	НайденнаяСтрока.ПортОтправления = ПолучитьЭлементСправочникаПоГУИД("Локации", Строка.ПунктыИСтанции.ПортОтправления, МассивОшибокПоискаСправочныхДанных, "ПунктыИСтанции - ПортОтправления"); //ПолучитьЛокациюПоГУИД(Строка.ПунктыИСтанции.ПортОтправления);
	НайденнаяСтрока.ПортНазначения = ПолучитьЭлементСправочникаПоГУИД("Локации", Строка.ПунктыИСтанции.ПортНазначения, МассивОшибокПоискаСправочныхДанных, "ПунктыИСтанции - ПортНазначения"); //ПолучитьЛокациюПоГУИД(Строка.ПунктыИСтанции.ПортНазначения);
	НайденнаяСтрока.ПунктОтправленияПоВнешнеторговомуКонтракту = ПолучитьЭлементСправочникаПоГУИД("Локации", Строка.ПунктыИСтанции.ПунктОтправленияПоВнешнеторговомуКонтракту, МассивОшибокПоискаСправочныхДанных, "ПунктыИСтанции - ПунктОтправленияПоВнешнеторговомуКонтракту"); //ПолучитьЛокациюПоГУИД(Строка.ПунктыИСтанции.ПунктОтправленияПоВнешнеторговомуКонтракту);
	НайденнаяСтрока.ПунктНазначенияПоВнешнеторговомуКонтракту = ПолучитьЭлементСправочникаПоГУИД("Локации", Строка.ПунктыИСтанции.ПунктНазначенияПоВнешнеторговомуКонтракту, МассивОшибокПоискаСправочныхДанных, "ПунктыИСтанции - ПунктНазначенияПоВнешнеторговомуКонтракту"); //ПолучитьЛокациюПоГУИД(Строка.ПунктыИСтанции.ПунктНазначенияПоВнешнеторговомуКонтракту);
	НайденнаяСтрока.СтанцияОтправления = ПолучитьЭлементСправочникаПоГУИД("Локации", Строка.ПунктыИСтанции.СтанцияОтправления, МассивОшибокПоискаСправочныхДанных, "ПунктыИСтанции - СтанцияОтправления"); //ПолучитьЛокациюПоГУИД(Строка.ПунктыИСтанции.СтанцияОтправления);
	НайденнаяСтрока.СтанцияНазначения = ПолучитьЭлементСправочникаПоГУИД("Локации", Строка.ПунктыИСтанции.СтанцияНазначения, МассивОшибокПоискаСправочныхДанных, "ПунктыИСтанции - СтанцияНазначения"); //ПолучитьЛокациюПоГУИД(Строка.ПунктыИСтанции.СтанцияНазначения);
	
	//<УсловияПеревозки УсловияПеревозки="CY" УсловияПеревозкиНазначение="FOR" УсловияПеревозкиМоре="DOOR" УсловияПеревозкиНазначениеМоре="CY"/>
	//НайденнаяСтрока.УсловияПеревозки = КэшИменаУсловийПеревозкиКТК.Получить(Строка.УсловияПеревозки.УсловияПеревозки);
	//НайденнаяСтрока.УсловияПеревозкиНазначение = КэшИменаУсловийПеревозкиКТК.Получить(Строка.УсловияПеревозки.УсловияПеревозкиНазначение);
	//НайденнаяСтрока.УсловияПеревозкиМоре = КэшИменаУсловийПеревозкиКТК.Получить(Строка.УсловияПеревозки.УсловияПеревозкиМоре);
	//НайденнаяСтрока.УсловияПеревозкиНазначениеМоре = КэшИменаУсловийПеревозкиКТК.Получить(Строка.УсловияПеревозки.УсловияПеревозкиНазначениеМоре);
	//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 106847, 18-04-2025, начало
	НайденнаяСтрока.УсловияПеревозки = КэшПеречислений.КэшИменаУсловийПеревозкиКТК.Получить(Строка.УсловияПеревозки.УсловияПеревозкиЖДПоОтправлению);
	НайденнаяСтрока.УсловияПеревозкиНазначение = КэшПеречислений.КэшИменаУсловийПеревозкиКТК.Получить(Строка.УсловияПеревозки.УсловияПеревозкиЖДПоПрибытию);
	Если Строка.УсловияПеревозки.Свойства().Получить("УсловияПеревозкиМоре") <> Неопределено Тогда
		НайденнаяСтрока.УсловияПеревозкиМоре = КэшПеречислений.КэшИменаУсловийПеревозкиПоПортам.Получить(Строка.УсловияПеревозки.УсловияПеревозкиМоре);
	КонецЕсли;
	Если Строка.УсловияПеревозки.Свойства().Получить("УсловияПеревозкиНазначениеМоре") <> Неопределено Тогда
		НайденнаяСтрока.УсловияПеревозкиНазначениеМоре = КэшПеречислений.КэшИменаУсловийПеревозкиПоПортам.Получить(Строка.УсловияПеревозки.УсловияПеревозкиНазначениеМоре);
	КонецЕсли;
	НайденнаяСтрока.УсловияПеревозкиПоИнкотермс = КэшПеречислений.КэшИменаУсловийIncoterms.Получить(Строка.УсловияПеревозки.УсловияПеревозкиМореПоОтправлениюПрибытию);
	//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 106847, 18-04-2025, конец
	
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 112611 / TA 113905, 10-07-2025, начало
Функция ПолучитьСоздатьСтатусКТК(СтатусКТККод, СтатусКТК, УзелОбмена)
	
	Результат = Справочники.СтатусыКТК.ПустаяСсылка();
	Если НЕ ЗначениеЗаполнено(СтатусКТККод) Тогда
		Возврат Результат;
	КонецЕсли;
	
	НайденныйЭлементСсылка = РегистрыСведений.ПротоколОбменов.СсылкаПоУИД(СтатусКТККод,Перечисления.ДействияПриОбмене.ЗагрузкаДанных,УзелОбмена,Тип("СправочникСсылка.СтатусыКТК"));
	Если НайденныйЭлементСсылка = Неопределено Тогда
		НовыйЭлемент = Справочники.СтатусыКТК.СоздатьЭлемент();
		НовыйЭлемент.Родитель = Справочники.СтатусыКТК.СтатусыЛичногоКабинета;
		НовыйЭлемент.Наименование = СтатусКТК;
		НовыйЭлемент.Записать();
		РегистрыСведений.ПротоколОбменов.ЗаписатьУИДИсточника(СтатусКТККод,Перечисления.ДействияПриОбмене.ЗагрузкаДанных,УзелОбмена,НовыйЭлемент.Ссылка);
		Результат = НовыйЭлемент.Ссылка;
	Иначе
		Если СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НайденныйЭлементСсылка, "Наименование")) <> СокрЛП(СтатусКТК) Тогда
			НайденныйЭлементОбъект = НайденныйЭлементСсылка.ПолучитьОбъект();
			НайденныйЭлементОбъект.Наименование = СокрЛП(СтатусКТК);
			НайденныйЭлементОбъект.Записать();
		КонецЕсли;
		Результат = НайденныйЭлементСсылка;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 112611 / TA 113905, 10-07-2025, конец

Функция ПолучитьЭлементСправочникаПоГУИД(ИмяСправочника, ГУИД, МассивОшибокПоискаСправочныхДанных, ИмяПоля)
	Результат = Неопределено;
	Если ЗначениеЗаполнено(ГУИД) Тогда
		ЭтоУникальныйИдентификатор = СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ГУИД);
		Если ЭтоУникальныйИдентификатор Тогда
			МенеджерСправочника = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Справочник."+ИмяСправочника);
			Результат = МенеджерСправочника.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД));
			Если Результат = МенеджерСправочника.ПустаяСсылка() Тогда
				//МассивОшибокПоискаСправочныхДанных.Добавить("Ошибка поиска по ГУИД ["+ГУИД+"] в поле "+ИмяПоля);
			КонецЕсли;
		Иначе
			//МассивОшибокПоискаСправочныхДанных.Добавить("Ошибка формата ГУИД ["+ГУИД+"] в поле "+ИмяПоля);
		КонецЕсли;
	Иначе
		//МассивОшибокПоискаСправочныхДанных.Добавить("Не указан ГУИД в поле "+ИмяПоля);
	КонецЕсли;
	Возврат Результат;
КонецФункции

////Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, начало
//Функция ПолучитьТипоразмерТЕПоГУИД(ГУИД)
//	Результат = Неопределено;
//	Если ЗначениеЗаполнено(ГУИД) Тогда
//		Результат = Справочники.ТипоразмерыТЕ.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД));
//	КонецЕсли;
//	Возврат Результат;
//КонецФункции
////Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, конец

////Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, начало
//Функция ПолучитьГрузПоГУИД(ГУИД)
//	Результат = Неопределено;
//	Если ЗначениеЗаполнено(ГУИД) Тогда
//		Результат = Справочники.Грузы.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД));
//	КонецЕсли;
//	Возврат Результат;
//КонецФункции
////Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, конец

////Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, начало
//Функция ПолучитьЛокациюПоГУИД(ГУИД)
//	Результат = Неопределено;
//	Если ЗначениеЗаполнено(ГУИД) Тогда
//		Результат = Справочники.Локации.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД));
//	КонецЕсли;
//	Возврат Результат;
//КонецФункции
////Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 106847, 18-04-2025, начало
Функция КэшПеречислений(ВидПоиска = "ПоискИмениПоПеречислению")
	
	Результат = Новый Структура;
	
	КэшИменаУсловийПеревозкиКТК = Новый Соответствие;
	Для Каждого ТекПеречисление Из Перечисления.УсловияПеревозкиКТК Цикл
		Если ВидПоиска = "ПоискПеречисленияПоИмени" Тогда
			КэшИменаУсловийПеревозкиКТК.Вставить(ОбщегоНазначения.ИмяЗначенияПеречисления(ТекПеречисление), ТекПеречисление);
		Иначе
			КэшИменаУсловийПеревозкиКТК.Вставить(ТекПеречисление, ОбщегоНазначения.ИмяЗначенияПеречисления(ТекПеречисление));
		КонецЕсли;
	КонецЦикла;
	Результат.Вставить("КэшИменаУсловийПеревозкиКТК", КэшИменаУсловийПеревозкиКТК);
	
	КэшИменаУсловийПеревозкиПоПортам = Новый Соответствие;
	Для Каждого ТекПеречисление Из Перечисления.УсловияПеревозкиПоПортам Цикл
		Если ВидПоиска = "ПоискПеречисленияПоИмени" Тогда
			КэшИменаУсловийПеревозкиПоПортам.Вставить(ОбщегоНазначения.ИмяЗначенияПеречисления(ТекПеречисление), ТекПеречисление);
		Иначе
			КэшИменаУсловийПеревозкиПоПортам.Вставить(ТекПеречисление, ОбщегоНазначения.ИмяЗначенияПеречисления(ТекПеречисление));
		КонецЕсли;
	КонецЦикла;
	Результат.Вставить("КэшИменаУсловийПеревозкиПоПортам", КэшИменаУсловийПеревозкиПоПортам);
	
	КэшИменаУсловийIncoterms = Новый Соответствие;
	Для Каждого ТекПеречисление Из Перечисления.УсловияIncoterms Цикл
		Если ВидПоиска = "ПоискПеречисленияПоИмени" Тогда
			КэшИменаУсловийIncoterms.Вставить(ОбщегоНазначения.ИмяЗначенияПеречисления(ТекПеречисление), ТекПеречисление);
		Иначе
			КэшИменаУсловийIncoterms.Вставить(ТекПеречисление, ОбщегоНазначения.ИмяЗначенияПеречисления(ТекПеречисление));
		КонецЕсли;
	КонецЦикла;
	Результат.Вставить("КэшИменаУсловийIncoterms", КэшИменаУсловийIncoterms);
	
	КэшИменаПринадлежностьТЕ = Новый Соответствие;
	Если ВидПоиска = "ПоискПеречисленияПоИмени" Тогда
		КэшИменаПринадлежностьТЕ.Вставить("SOC", Перечисления.ПринадлежностьТЕ.КТКлиента);
		КэшИменаПринадлежностьТЕ.Вставить("COC", Перечисления.ПринадлежностьТЕ.КТЕвросиба);
	Иначе
		КэшИменаПринадлежностьТЕ.Вставить(Перечисления.ПринадлежностьТЕ.КТКлиента, "SOC");
		КэшИменаПринадлежностьТЕ.Вставить(Перечисления.ПринадлежностьТЕ.КТЕвросиба, "COC");
	КонецЕсли;
	Результат.Вставить("КэшИменаПринадлежностьТЕ", КэшИменаПринадлежностьТЕ);
	
	Возврат Результат;
	
КонецФункции

//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 106847, 18-04-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, начало
Процедура ДобавитьДанныеЗаявки(Запись, Ссылка, УзелОбмена) Экспорт //для отладки экспорт
	
	//КэшИменаУсловийПеревозкиКТК = Новый Соответствие;
	//Для Каждого ТекПеречисление Из Перечисления.УсловияПеревозкиКТК Цикл
	//	КэшИменаУсловийПеревозкиКТК.Вставить(ТекПеречисление,ОбщегоНазначения.ИмяЗначенияПеречисления(ТекПеречисление));
	//КонецЦикла;
	
	//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 106847, 18-04-2025, начало
	КэшПеречислений = КэшПеречислений();
	КэшИменаУсловийПеревозкиКТК = КэшПеречислений.КэшИменаУсловийПеревозкиКТК;
	КэшИменаУсловийПеревозкиПоПортам = КэшПеречислений.КэшИменаУсловийПеревозкиПоПортам;
	КэшИменаУсловийIncoterms = КэшПеречислений.КэшИменаУсловийIncoterms;
	//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 106847, 18-04-2025, конец
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Заявка.ВнешнийНомер КАК ВнешнийНомер,
		|	Заявка.ДатаОформленияЗаявки КАК ДатаОформленияЗаявки,
		|	Заявка.НаправлениеПеревозки КАК НаправлениеПеревозки,
		|	Заявка.ВидПеревозки КАК ВидПеревозки,
		|	Заявка.ВидПеревозки.ИмяПредопределенныхДанных КАК ВидПеревозкиИмя,
		|	Заявка.ГрузоотправительПоВнешнеторговомуКонтракту КАК ГрузоотправительПоВнешнеторговомуКонтракту,
		|	Заявка.ГрузополучательПоВнешнеторговомуКонтракту КАК ГрузополучательПоВнешнеторговомуКонтракту,
		|	Заявка.СогласованнаяCтавка КАК СогласованнаяCтавка,
		|	Заявка.НотисCпецПредложение КАК НотисCпецПредложение,
		|	Заявка.Ссылка КАК Ссылка,
		|	ДоговорыКонтрагентов.УИДИсточника КАК ДоговорУИД,
		|	Контрагенты.УИДИсточника КАК КонтрагентУИД,
		|	Заявка.Контрагент.Наименование КАК КонтрагентНаименование,
		|	Заявка.Договор.Наименование КАК ДоговорНаименование,
		|	Заявка.СтатусЗаявки.КодСтатуса КАК СтатусЗаявкиКод,
		|	Заявка.СтатусЗаявки.Наименование КАК СтатусЗаявкиНаименование,
		|	Заявка.ТипПеревозки КАК ТипПеревозкиСсылка,
		|	Заявка.ТипПеревозки.Код КАК ТипПеревозкиКод,
		|	Заявка.ОтветственныйМенеджер КАК ОтветственныйМенеджер,
		|	Заявка.ОтветственныйМенеджер.Наименование КАК ОтветственныйМенеджерНаименование,
		|	Заявка.КомментарийМенеджераЛК КАК КомментарийМенеджераЛК,
		|	Заявка.СтатусЛК.КодСтатуса КАК СтатусЛККод,
		|	Заявка.СтатусЛК.Наименование КАК СтатусЛКНаименование
		//|	Заявка.ФайлВХранилищеГУИД КАК ФайлВХранилищеГУИД,
		//|	Заявка.ФайлВХранилищеИмяФайла КАК ФайлВХранилищеИмяФайла,
		//|	Заявка.ФайлВХранилищеТипФайла КАК ФайлВХранилищеТипФайла
		|ПОМЕСТИТЬ ВТ_Заявка
		|ИЗ
		|	Документ.Заявка КАК Заявка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Контрагенты
		|		ПО (Контрагенты.Объект = Заявка.Контрагент)
		|			И (Контрагенты.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
		|			И (Контрагенты.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ДоговорыКонтрагентов
		|		ПО (ДоговорыКонтрагентов.Объект = Заявка.Договор)
		|			И (ДоговорыКонтрагентов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
		|			И (ДоговорыКонтрагентов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
		|ГДЕ
		|	Заявка.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		//Евросиб(ДИТ), Беляев СЮ, US 113722 / TA 113989, 10-07-2025, начало
		|ВЫБРАТЬ
		|	ЗаявкаФайлыВХранилище.ФайлВХранилищеГУИД КАК ФайлВХранилищеГУИД,
		|	ЗаявкаФайлыВХранилище.ФайлВХранилищеИмяФайла КАК ФайлВХранилищеИмяФайла,
		|	ЗаявкаФайлыВХранилище.ФайлВХранилищеТипФайла КАК ФайлВХранилищеТипФайла,
		|	ЗаявкаФайлыВХранилище.НомерВерсииФайла КАК НомерВерсииФайла,
		//Евросиб Шевченко А.В US 116005 TA 116413 02.09.2025
		|	ЗаявкаФайлыВХранилище.СтатусДокумента КАК СтатусДокумента,
		|	ЗаявкаФайлыВХранилище.Автор КАК Автор,
		|	ЗаявкаФайлыВХранилище.ДатаВремяСоздания КАК ДатаВремяСоздания,
		|	ЗаявкаФайлыВХранилище.Источник КАК Источник,
		|	ЗаявкаФайлыВХранилище.Комментарий КАК Комментарий,
		|	ЗаявкаФайлыВХранилище.НомерКТК КАК НомерКТК,
		//Евросиб Шевченко А.В US 116005 TA 119060 09.09.2025
		|	ЗаявкаФайлыВХранилище.ПризнакУдаленияФайла КАК ПризнакУдаленияФайла
		//Евросиб Шевченко А.В US 116005 TA 119060 09.09.2025
		//Евросиб Шевченко А.В US 116005 TA 116413 02.09.2025
		|ИЗ
		|	Документ.Заявка.ФайлыВХранилище КАК ЗаявкаФайлыВХранилище
		|ГДЕ
		|	ЗаявкаФайлыВХранилище.Ссылка = &Ссылка
		//Евросиб(ДИТ), Беляев СЮ, US 113722 / TA 113989, 10-07-2025, конец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Заявка.ВнешнийНомер КАК ВнешнийНомер,
		|	ВТ_Заявка.ДатаОформленияЗаявки КАК ДатаОформленияЗаявки,
		|	ВТ_Заявка.НаправлениеПеревозки КАК НаправлениеПеревозки,
		|	ВТ_Заявка.ВидПеревозки КАК ВидПеревозки,
		|	ВТ_Заявка.ВидПеревозкиИмя КАК ВидПеревозкиИмя,
		|	ВТ_Заявка.ГрузоотправительПоВнешнеторговомуКонтракту КАК ГрузоотправительПоВнешнеторговомуКонтракту,
		|	ВТ_Заявка.ГрузополучательПоВнешнеторговомуКонтракту КАК ГрузополучательПоВнешнеторговомуКонтракту,
		|	ВТ_Заявка.СогласованнаяCтавка КАК СогласованнаяCтавка,
		|	ВТ_Заявка.НотисCпецПредложение КАК НотисCпецПредложение,
		|	ВТ_Заявка.Ссылка КАК Ссылка,
		|	ВТ_Заявка.ДоговорУИД КАК ДоговорУИД,
		|	ВТ_Заявка.КонтрагентУИД КАК КонтрагентУИД,
		|	ВТ_Заявка.КонтрагентНаименование КАК КонтрагентНаименование,
		|	ВТ_Заявка.ДоговорНаименование КАК ДоговорНаименование,
		|	ВТ_Заявка.СтатусЗаявкиКод КАК СтатусЗаявкиКод,
		|	ВТ_Заявка.СтатусЗаявкиНаименование КАК СтатусЗаявкиНаименование,
		|	ВТ_Заявка.ТипПеревозкиСсылка КАК ТипПеревозкиСсылка,
		|	ВТ_Заявка.ТипПеревозкиКод КАК ТипПеревозкиКод,
		|	ВТ_Заявка.ОтветственныйМенеджер КАК ОтветственныйМенеджер,
		|	ВТ_Заявка.ОтветственныйМенеджерНаименование КАК ОтветственныйМенеджерНаименование,
		|	ВТ_Заявка.КомментарийМенеджераЛК КАК КомментарийМенеджераЛК,
		|	ВТ_Заявка.СтатусЛККод КАК СтатусЛККод,
		|	ВТ_Заявка.СтатусЛКНаименование КАК СтатусЛКНаименование
		//|	ВТ_Заявка.ФайлВХранилищеГУИД КАК ФайлВХранилищеГУИД,
		//|	ВТ_Заявка.ФайлВХранилищеИмяФайла КАК ФайлВХранилищеИмяФайла,
		//|	ВТ_Заявка.ФайлВХранилищеТипФайла КАК ФайлВХранилищеТипФайла
		|ИЗ
		|	ВТ_Заявка КАК ВТ_Заявка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаявкаСоставУслуги.Ссылка КАК Ссылка,
		|	ЗаявкаСоставУслуги.ДатаГотовностиГрузаКПеревозке КАК ДатаГотовностиГрузаКПеревозке,
		|	ЗаявкаСоставУслуги.ДатаСтатуса КАК ДатаСтатуса,
		//|	ЗаявкаСоставУслуги.СтатусКТК КАК СтатусКТК,
		//Евросиб(ДИТ), Беляев СЮ, US 112611 / TA 113905, 10-07-2025, начало
		|	ЗаявкаСоставУслуги.СтатусКТК.Наименование КАК СтатусКТК,
		//Евросиб(ДИТ), Беляев СЮ, US 112611 / TA 113905, 10-07-2025, конец
		|	ЗаявкаСоставУслуги.ПортОтправления КАК ПортОтправления,
		|	ЗаявкаСоставУслуги.ПортНазначения КАК ПортНазначения,
		|	ЗаявкаСоставУслуги.ПунктОтправленияПоВнешнеторговомуКонтракту КАК ПунктОтправленияПоВнешнеторговомуКонтракту,
		|	ЗаявкаСоставУслуги.ПунктНазначенияПоВнешнеторговомуКонтракту КАК ПунктНазначенияПоВнешнеторговомуКонтракту,
		|	ЗаявкаСоставУслуги.СтанцияОтправления КАК СтанцияОтправления,
		|	ЗаявкаСоставУслуги.СтанцияНазначения КАК СтанцияНазначения,
		|	ЗаявкаСоставУслуги.СтранаПроисхожденияГруза КАК СтранаПроисхожденияГруза,
		|	ЗаявкаСоставУслуги.ТаможенныйРежим КАК ТаможенныйРежим,
		|	ЗаявкаСоставУслуги.УсловияПеревозки КАК УсловияПеревозки,
		|	ЗаявкаСоставУслуги.УсловияПеревозкиНазначение КАК УсловияПеревозкиНазначение,
		|	ЗаявкаСоставУслуги.УсловияПеревозкиМоре КАК УсловияПеревозкиМоре,
		|	ЗаявкаСоставУслуги.УсловияПеревозкиНазначениеМоре КАК УсловияПеревозкиНазначениеМоре,
		|	ЗаявкаСоставУслуги.КлючАналитикиПеревозки.Груз_ЕТСНГ КАК Груз_ЕТСНГ,
		|	ЗаявкаСоставУслуги.КлючАналитикиПеревозки.Груз_ГНГ КАК Груз_ГНГ,
		//Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025
		//|	ЗаявкаСоставУслуги.КлючАналитикиПеревозки.Груз_ТНВЭД КАК Груз_ТНВЭД,
		|	ЕстьNULL(ПротоколОбменовГруз_ТНВЭД.УИДИсточника,"""") КАК Груз_ТНВЭД,
		|	ЕстьNULL(ПротоколОбменовГруз_ТНВЭД.Объект.УровеньВГруппе,0) КАК ГрузПоТНВЭДУровень,
		//Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025
		|	ЗаявкаСоставУслуги.Груз.Наименование КАК ГрузНаименование,
		|	ЗаявкаСоставУслуги.НомерКТК.Наименование КАК НомерКТКНаименование,
		|	ЗаявкаСоставУслуги.РазмерКТК.Размер КАК РазмерКТКРазмер,
		|	ЗаявкаСоставУслуги.ТипКТК.КодISO КАК ТипКТККодISO,
		|	ЗаявкаСоставУслуги.ПеревозчикПоМорскомуПлечу КАК ПеревозчикПоМорскомуПлечу,
		|	ЗаявкаСоставУслуги.ИнструкцииПоСдачеПорожнего КАК ИнструкцииПоСдачеПорожнего,
		|	ВЫРАЗИТЬ(ЗаявкаСоставУслуги.АдресПогрузки КАК Справочник.Локации) КАК АдресПогрузки,
		|	ВЫРАЗИТЬ(ЗаявкаСоставУслуги.АдресВыгрузки КАК Справочник.Локации) КАК АдресВыгрузки,
		|	ЗаявкаСоставУслуги.ВесГрузаНетто КАК ВесГрузаНетто,
		|	ЗаявкаСоставУслуги.КоличествоМест КАК КоличествоМест,
		|	ЗаявкаСоставУслуги.Груз КАК Груз,
		|	ЗаявкаСоставУслуги.ТипКТК КАК ТипКТК,
		|	ЗаявкаСоставУслуги.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	ЗаявкаСоставУслуги.idисточника КАК idисточника,
		|	ЗаявкаСоставУслуги.СтавкаМореUSD КАК СтавкаМореUSD,
		|	ЗаявкаСоставУслуги.СтавкаЖДРуб КАК СтавкаЖДРуб,
		|	ЗаявкаСоставУслуги.СтавкаАвтоРуб КАК СтавкаАвтоРуб,
		|	ЗаявкаСоставУслуги.ТипКТК.Наименование КАК ТипКТКНаименование,
		|	ЗаявкаСоставУслуги.УсловияПеревозкиПоИнкотермс КАК УсловияПеревозкиПоИнкотермс,
		|	ВЫБОР
		|		КОГДА ЗаявкаСоставУслуги.ПринадлежностьТЕ = ЗНАЧЕНИЕ(Перечисление.ПринадлежностьТЕ.КТКлиента)
		|			ТОГДА ""SOC""
		|		КОГДА ЗаявкаСоставУслуги.ПринадлежностьТЕ = ЗНАЧЕНИЕ(Перечисление.ПринадлежностьТЕ.КТЕвросиба)
		|			ТОГДА ""COC""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ПринадлежностьКТК,
		|	ВЫБОР
		|		КОГДА ЗаявкаСоставУслуги.Груженый
		|			ТОГДА ""1""
		|		ИНАЧЕ ""0""
		|	КОНЕЦ КАК СостояниеКТК,
		//Евросиб(ДИТ), Беляев СЮ, US 112611 / TA 113905, 10-07-2025, начало
		|	ЕстьNULL(ПротоколОбменовСтатусыКТК.УИДИсточника, """") КАК СтатусКТККод
		//Евросиб(ДИТ), Беляев СЮ, US 112611 / TA 113905, 10-07-2025, конец
		|ИЗ
		|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		//Евросиб(ДИТ), Беляев СЮ, US 112611 / TA 113905, 10-07-2025, начало
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменовСтатусыКТК
		|		ПО (ПротоколОбменовСтатусыКТК.Объект = ЗаявкаСоставУслуги.СтатусКТК)
		|			И (ПротоколОбменовСтатусыКТК.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
		|			И (ПротоколОбменовСтатусыКТК.УзелОбмена = &УзелОбмена)
		//Евросиб(ДИТ), Беляев СЮ, US 112611 / TA 113905, 10-07-2025, конец
		//Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменовГруз_ТНВЭД
		|		ПО (ПротоколОбменовГруз_ТНВЭД.Объект = ЗаявкаСоставУслуги.ГрузПоТНВЭД)
		|			И (ПротоколОбменовГруз_ТНВЭД.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
		|			И (ПротоколОбменовГруз_ТНВЭД.УзелОбмена = Значение(Перечисление.УзлыОбмена.NSI))
		//Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025
		|ГДЕ
		|	ЗаявкаСоставУслуги.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Заявка.ОтветственныйМенеджер КАК ОтветственныйМенеджер,
		|	ПользователиКонтактнаяИнформация.Представление КАК АдресЭлектроннойПочты
		|ИЗ
		|	ВТ_Заявка КАК ВТ_Заявка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
		|		ПО ВТ_Заявка.ОтветственныйМенеджер = ПользователиКонтактнаяИнформация.Ссылка
		|			И (ПользователиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//Евросиб(ДИТ), Беляев СЮ, US 112611 / TA 113905, 10-07-2025, начало
	Запрос.УстановитьПараметр("УзелОбмена", УзелОбмена);
	//Евросиб(ДИТ), Беляев СЮ, US 112611 / TA 113905, 10-07-2025, конец
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	КоличествоПакетов = РезультатЗапроса.Количество();
	//Евросиб(ДИТ), Беляев СЮ, US 113722 / TA 113989, 10-07-2025, начало
	ВыборкаФайлыВХранилище = РезультатЗапроса[КоличествоПакетов-4].Выбрать();
	//Евросиб(ДИТ), Беляев СЮ, US 113722 / TA 113989, 10-07-2025, конец
	ВыборкаСсылка= РезультатЗапроса[КоличествоПакетов-3].Выбрать();
	ТаблицаКТК = РезультатЗапроса[КоличествоПакетов-2].Выгрузить();
	ТаблицаЭлАдресовМенеджеров = РезультатЗапроса[КоличествоПакетов-1].Выгрузить();
	
	Пока ВыборкаСсылка.Следующий() Цикл
		
		Запись.ЗаписатьНачалоЭлемента("Заявка");
		Запись.ЗаписатьАтрибут("ГУИД", XMLСтрока(ВыборкаСсылка.Ссылка));
		Запись.ЗаписатьАтрибут("НомерЗаявки", Строка(ВыборкаСсылка.ВнешнийНомер));
		
		Запись.ЗаписатьАтрибут("СтатусЗаявки", Строка(ВыборкаСсылка.СтатусЗаявкиНаименование));
		Запись.ЗаписатьАтрибут("КодСтатусаЗаявки", Строка(ВыборкаСсылка.СтатусЗаявкиКод));
		
		//Запись.ЗаписатьАтрибут("ДатаОформленияЗаявки", XMLСтрока(ВыборкаСсылка.ДатаОформленияЗаявки));
		//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, начало
		Запись.ЗаписатьАтрибут("ДатаОформленияЗаявки", ФорматПустойДаты(ВыборкаСсылка.ДатаОформленияЗаявки));
		//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, конец
		Запись.ЗаписатьАтрибут("НаправлениеПеревозки", XMLСтрока(ВыборкаСсылка.НаправлениеПеревозки));
		
		Запись.ЗаписатьАтрибут("ГрузоотправительПоВнешнеторговомуКонтракту", XMLСтрока(ВыборкаСсылка.ГрузоотправительПоВнешнеторговомуКонтракту));
		Запись.ЗаписатьАтрибут("ГрузополучательПоВнешнеторговомуКонтракту", XMLСтрока(ВыборкаСсылка.ГрузополучательПоВнешнеторговомуКонтракту));
		Запись.ЗаписатьАтрибут("СогласованнаяCтавка", XMLСтрока(ВыборкаСсылка.СогласованнаяCтавка));
		Запись.ЗаписатьАтрибут("КомментарийМенеджераЛК", XMLСтрока(ВыборкаСсылка.КомментарийМенеджераЛК));
		Запись.ЗаписатьАтрибут("СтатусЛК", XMLСтрока(ВыборкаСсылка.СтатусЛКНаименование));
		Запись.ЗаписатьАтрибут("КодСтатусаЛК", XMLСтрока(ВыборкаСсылка.СтатусЛККод));
		
		Запись.ЗаписатьНачалоЭлемента("Контрагент");
		//Запись.ЗаписатьАтрибут("КонтрагентГУИД", XMLСтрока(ВыборкаСсылка.КонтрагентУИД));
		//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, начало
		Запись.ЗаписатьАтрибут("КонтрагентГУИД", ФорматПустогоГУИД(ВыборкаСсылка.КонтрагентУИД));
		//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, конец
		Запись.ЗаписатьАтрибут("КонтрагентНаименование", XMLСтрока(ВыборкаСсылка.КонтрагентНаименование));
		Запись.ЗаписатьКонецЭлемента();//Контрагент
		
		Запись.ЗаписатьНачалоЭлемента("Договор");
		//Запись.ЗаписатьАтрибут("ДоговорГУИД", XMLСтрока(ВыборкаСсылка.ДоговорУИД));
		//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, начало
		Запись.ЗаписатьАтрибут("ДоговорГУИД", ФорматПустогоГУИД(ВыборкаСсылка.ДоговорУИД));
		//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, конец
		Запись.ЗаписатьАтрибут("ДоговорНаименование", XMLСтрока(ВыборкаСсылка.ДоговорНаименование));
		Запись.ЗаписатьКонецЭлемента();//Договор
		
		Запись.ЗаписатьНачалоЭлемента("ТипПеревозки");
		//Запись.ЗаписатьАтрибут("ТипПеревозкиГУИД", XMLСтрока(ВыборкаСсылка.ТипПеревозкиСсылка));
		//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, начало
		Запись.ЗаписатьАтрибут("ТипПеревозкиГУИД", ФорматПустогоГУИД(ВыборкаСсылка.ТипПеревозкиСсылка));
		//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, конец
		Запись.ЗаписатьАтрибут("ТипПеревозкиКод", XMLСтрока(ВыборкаСсылка.ТипПеревозкиКод));
		Запись.ЗаписатьКонецЭлемента();//ТипПеревозки
		
		Запись.ЗаписатьНачалоЭлемента("ВидПеревозки");
		//Запись.ЗаписатьАтрибут("ВидПеревозкиГУИД", XMLСтрока(ВыборкаСсылка.ВидПеревозки));
		//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, начало
		Запись.ЗаписатьАтрибут("ВидПеревозкиГУИД", ФорматПустогоГУИД(ВыборкаСсылка.ВидПеревозки));
		//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, конец
		Запись.ЗаписатьАтрибут("ВидПеревозкиИмя", XMLСтрока(ВыборкаСсылка.ВидПеревозкиИмя));
		Запись.ЗаписатьКонецЭлемента();//ВидПеревозки
		
		Запись.ЗаписатьНачалоЭлемента("Нотис");
		Запись.ЗаписатьКонецЭлемента();//Нотис
		
		Запись.ЗаписатьНачалоЭлемента("Менеджер");
		//Запись.ЗаписатьАтрибут("МенеджерГУИД", XMLСтрока(ВыборкаСсылка.ОтветственныйМенеджер));
		//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, начало
		Запись.ЗаписатьАтрибут("МенеджерГУИД", ФорматПустогоГУИД(ВыборкаСсылка.ОтветственныйМенеджер));
		//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, конец
		Запись.ЗаписатьАтрибут("МенеджерФИО", XMLСтрока(ВыборкаСсылка.ОтветственныйМенеджерНаименование));
		АдресЭлектроннойПочты = "";
		НайденныйАдрес = ТаблицаЭлАдресовМенеджеров.Найти(ВыборкаСсылка.ОтветственныйМенеджер,"ОтветственныйМенеджер");
		Если НайденныйАдрес <> Неопределено Тогда
			АдресЭлектроннойПочты = СокрЛП(НайденныйАдрес.АдресЭлектроннойПочты);
		КонецЕсли;
		Запись.ЗаписатьАтрибут("АдресЭлектроннойПочты", XMLСтрока(АдресЭлектроннойПочты));
		Запись.ЗаписатьКонецЭлемента();//Менеджер
		
		////Евросиб(ДИТ), Беляев СЮ, US 101434 / TA 103701, 04-06-2025, начало
		//Запись.ЗаписатьНачалоЭлемента("Файл");
		////Запись.ЗаписатьАтрибут("ФайлГУИД", XMLСтрока(ВыборкаСсылка.ФайлВХранилищеГУИД));
		////Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, начало
		//Запись.ЗаписатьАтрибут("ФайлГУИД", ФорматПустогоГУИД(ВыборкаСсылка.ФайлВХранилищеГУИД));
		////Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, конец
		//Запись.ЗаписатьАтрибут("ИмяФайла", XMLСтрока(ВыборкаСсылка.ФайлВХранилищеИмяФайла));
		//Запись.ЗаписатьАтрибут("ТипФайла", XMLСтрока(ВыборкаСсылка.ФайлВХранилищеТипФайла));
		//Запись.ЗаписатьКонецЭлемента(); //Файл
		////Евросиб(ДИТ), Беляев СЮ, US 101434 / TA 103701, 04-06-2025, конец
		
		Запись.ЗаписатьНачалоЭлемента("Контейнеры");
		СтрокиПоКТК = ТаблицаКТК.НайтиСтроки(Новый Структура("Ссылка", ВыборкаСсылка.Ссылка));
		Для Каждого СтрокаКТК Из СтрокиПоКТК Цикл
			Запись.ЗаписатьНачалоЭлемента("Строка");
			
			//Запись.ЗаписатьАтрибут("ДатаГотовностиГрузаКПеревозке", XMLСтрока(СтрокаКТК.ДатаГотовностиГрузаКПеревозке));
			//Запись.ЗаписатьАтрибут("ДатаСтатуса", XMLСтрока(СтрокаКТК.ДатаСтатуса));
			//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, начало
			Запись.ЗаписатьАтрибут("ДатаГотовностиГрузаКПеревозке", ФорматПустойДаты(СтрокаКТК.ДатаГотовностиГрузаКПеревозке));
			Запись.ЗаписатьАтрибут("ДатаСтатуса", ФорматПустойДаты(СтрокаКТК.ДатаСтатуса));
			//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, конец
			Запись.ЗаписатьАтрибут("СтатусКТК", Строка(СтрокаКТК.СтатусКТК));
			//Евросиб(ДИТ), Беляев СЮ, US 112611 / TA 113905, 10-07-2025, начало
			Запись.ЗаписатьАтрибут("СтатусКТККод", Строка(СтрокаКТК.СтатусКТККод));
			//Евросиб(ДИТ), Беляев СЮ, US 112611 / TA 113905, 10-07-2025, конец
			Запись.ЗаписатьАтрибут("ТаможенныйРежим", Строка(СтрокаКТК.ТаможенныйРежим));
			//Запись.ЗаписатьАтрибут("СтранаПроисхожденияГруза", XMLСтрока(СтрокаКТК.СтранаПроисхожденияГруза));
			//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, начало
			Запись.ЗаписатьАтрибут("СтранаПроисхожденияГруза", ФорматПустогоГУИД(СтрокаКТК.СтранаПроисхожденияГруза));
			//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, конец
			Запись.ЗаписатьАтрибут("ПеревозчикПоМорскомуПлечу", XMLСтрока(СтрокаКТК.ПеревозчикПоМорскомуПлечу));
			Запись.ЗаписатьАтрибут("ИнструкцииПоСдачеПорожнего", XMLСтрока(СтрокаКТК.ИнструкцииПоСдачеПорожнего));
			//Запись.ЗаписатьАтрибут("АдресЗабораГрузаСоСклада", XMLСтрока(СтрокаКТК.АдресПогрузки));
			//Запись.ЗаписатьАтрибут("АдресДоставкиГруза", XMLСтрока(СтрокаКТК.АдресВыгрузки));
			//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, начало
			Запись.ЗаписатьАтрибут("АдресЗабораГрузаСоСклада", ФорматПустогоГУИД(СтрокаКТК.АдресПогрузки));
			Запись.ЗаписатьАтрибут("АдресДоставкиГруза", ФорматПустогоГУИД(СтрокаКТК.АдресВыгрузки));
			//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, конец
			Запись.ЗаписатьАтрибут("ГрузПоЕТСНГ", XMLСтрока(СтрокаКТК.Груз_ЕТСНГ));
			Запись.ЗаписатьАтрибут("ГрузПоГНГ", XMLСтрока(СтрокаКТК.Груз_ГНГ));	
			//Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025
			//Запись.ЗаписатьАтрибут("ГрузПоТНВЭД", XMLСтрока(СтрокаКТК.Груз_ТНВЭД));
			Запись.ЗаписатьАтрибут("ГрузПоТНВЭД", XMLСтрока(СтрокаКТК.Груз_ТНВЭД));
			Запись.ЗаписатьАтрибут("ГрузПоТНВЭДУровень", XMLСтрока(СтрокаКТК.ГрузПоТНВЭДУровень));
			//Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025
			//Евросиб(ДИТ), Беляев СЮ, US 104177 / TA 104443, 21-03-2025, начало
			Запись.ЗаписатьАтрибут("id", XMLСтрока(СтрокаКТК.idисточника));
			//Евросиб(ДИТ), Беляев СЮ, US 104177 / TA 104443, 21-03-2025, конец
			//Евросиб(ДИТ), Беляев СЮ, US 104177 / TA 105665, 26-03-2025, начало
			Запись.ЗаписатьАтрибут("СтавкаМореUSD", XMLСтрока(ПустаяСтрокаДляНуля(СтрокаКТК.СтавкаМореUSD)));
			Запись.ЗаписатьАтрибут("СтавкаЖДРуб", XMLСтрока(ПустаяСтрокаДляНуля(СтрокаКТК.СтавкаЖДРуб)));
			Запись.ЗаписатьАтрибут("СтавкаАвтоРуб", XMLСтрока(ПустаяСтрокаДляНуля(СтрокаКТК.СтавкаАвтоРуб)));
			//Евросиб(ДИТ), Беляев СЮ, US 104177 / TA 105665, 26-03-2025, конец
			
			Запись.ЗаписатьНачалоЭлемента("ПараметрыКонтейнера");
			Запись.ЗаписатьАтрибут("НомерКТК", XMLСтрока(СтрокаКТК.НомерКТКНаименование));
			Запись.ЗаписатьАтрибут("РазмерКТК", Строка(СтрокаКТК.РазмерКТКРазмер));
			Запись.ЗаписатьАтрибут("КодISO", Строка(СтрокаКТК.ТипКТККодISO));
			//Запись.ЗаписатьАтрибут("ТипоРазмерКТК", XMLСтрока(СтрокаКТК.ТипКТК));
			//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, начало
			Запись.ЗаписатьАтрибут("ТипоРазмерКТК", ФорматПустогоГУИД(СтрокаКТК.ТипКТК));
			//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, конец
			//Евросиб(ДИТ), Беляев СЮ, US 104177 / TA 105665, 27-03-2025, начало
			ТипКТКбезРазмера = Сред(СтрокаКТК.ТипКТКНаименование, 3);
			Запись.ЗаписатьАтрибут("ТипКТК", XMLСтрока(ТипКТКбезРазмера));
			//Евросиб(ДИТ), Беляев СЮ, US 104177 / TA 105665, 27-03-2025, конец
			//Запись.ЗаписатьАтрибут("КлючАналитикиПеревозки", XMLСтрока(СтрокаКТК.КлючАналитикиПеревозки));
			//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 106847, 18-04-2025, начало
			//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, начало
			Запись.ЗаписатьАтрибут("КлючАналитикиПеревозки", ФорматПустогоГУИД(СтрокаКТК.КлючАналитикиПеревозки));
			//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, конец
			Запись.ЗаписатьАтрибут("ПринадлежностьКТК", Строка(СтрокаКТК.ПринадлежностьКТК));
			Запись.ЗаписатьАтрибут("СостояниеКТК", Строка(СтрокаКТК.СостояниеКТК));
			//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 106847, 18-04-2025, конец
			Запись.ЗаписатьКонецЭлемента();//ПараметрыКонтейнера
			
			Запись.ЗаписатьНачалоЭлемента("Груз");
			//Запись.ЗаписатьАтрибут("ГУИД", XMLСтрока(СтрокаКТК.Груз));
			//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, начало
			Запись.ЗаписатьАтрибут("ГУИД", ФорматПустогоГУИД(СтрокаКТК.Груз));
			//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, конец
			Запись.ЗаписатьАтрибут("Наименование", XMLСтрока(СтрокаКТК.ГрузНаименование));
			Запись.ЗаписатьАтрибут("КоличествоМестГруза", XMLСтрока(СтрокаКТК.КоличествоМест));
			Запись.ЗаписатьАтрибут("ВесКонтейнераНетто", XMLСтрока(СтрокаКТК.ВесГрузаНетто));
			Запись.ЗаписатьКонецЭлемента();//Груз
			
			Запись.ЗаписатьНачалоЭлемента("ПунктыИСтанции");
			//Запись.ЗаписатьАтрибут("ПортОтправления", XMLСтрока(СтрокаКТК.ПортОтправления));
			//Запись.ЗаписатьАтрибут("ПортНазначения", XMLСтрока(СтрокаКТК.ПортНазначения));
			//Запись.ЗаписатьАтрибут("ПунктОтправленияПоВнешнеторговомуКонтракту", XMLСтрока(СтрокаКТК.ПунктОтправленияПоВнешнеторговомуКонтракту));
			//Запись.ЗаписатьАтрибут("ПунктНазначенияПоВнешнеторговомуКонтракту", XMLСтрока(СтрокаКТК.ПунктНазначенияПоВнешнеторговомуКонтракту));
			//Запись.ЗаписатьАтрибут("СтанцияОтправления", XMLСтрока(СтрокаКТК.СтанцияОтправления));
			//Запись.ЗаписатьАтрибут("СтанцияНазначения", XMLСтрока(СтрокаКТК.СтанцияНазначения));
			//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, начало
			Запись.ЗаписатьАтрибут("ПортОтправления", ФорматПустогоГУИД(СтрокаКТК.ПортОтправления));
			Запись.ЗаписатьАтрибут("ПортНазначения", ФорматПустогоГУИД(СтрокаКТК.ПортНазначения));
			Запись.ЗаписатьАтрибут("ПунктОтправленияПоВнешнеторговомуКонтракту", ФорматПустогоГУИД(СтрокаКТК.ПунктОтправленияПоВнешнеторговомуКонтракту));
			Запись.ЗаписатьАтрибут("ПунктНазначенияПоВнешнеторговомуКонтракту", ФорматПустогоГУИД(СтрокаКТК.ПунктНазначенияПоВнешнеторговомуКонтракту));
			Запись.ЗаписатьАтрибут("СтанцияОтправления", ФорматПустогоГУИД(СтрокаКТК.СтанцияОтправления));
			Запись.ЗаписатьАтрибут("СтанцияНазначения", ФорматПустогоГУИД(СтрокаКТК.СтанцияНазначения));
			//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, конец
			Запись.ЗаписатьКонецЭлемента();//ПунктыИСтанции
			
			Запись.ЗаписатьНачалоЭлемента("УсловияПеревозки");
			//Запись.ЗаписатьАтрибут("УсловияПеревозки", Строка(КэшИменаУсловийПеревозкиКТК.Получить(СтрокаКТК.УсловияПеревозки)));
			//Запись.ЗаписатьАтрибут("УсловияПеревозкиНазначение", Строка(КэшИменаУсловийПеревозкиКТК.Получить(СтрокаКТК.УсловияПеревозкиНазначение)));
			//Запись.ЗаписатьАтрибут("УсловияПеревозкиМоре", Строка(КэшИменаУсловийПеревозкиКТК.Получить(СтрокаКТК.УсловияПеревозкиМоре)));
			//Запись.ЗаписатьАтрибут("УсловияПеревозкиНазначениеМоре", Строка(КэшИменаУсловийПеревозкиКТК.Получить(СтрокаКТК.УсловияПеревозкиНазначениеМоре)));
			//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 106847, 18-04-2025, начало
			Запись.ЗаписатьАтрибут("УсловияПеревозкиЖДПоОтправлению", Строка(КэшИменаУсловийПеревозкиКТК.Получить(СтрокаКТК.УсловияПеревозки)));
			Запись.ЗаписатьАтрибут("УсловияПеревозкиЖДПоПрибытию", Строка(КэшИменаУсловийПеревозкиКТК.Получить(СтрокаКТК.УсловияПеревозкиНазначение)));
			Запись.ЗаписатьАтрибут("УсловияПеревозкиМоре", Строка(КэшИменаУсловийПеревозкиПоПортам.Получить(СтрокаКТК.УсловияПеревозкиМоре)));
			Запись.ЗаписатьАтрибут("УсловияПеревозкиНазначениеМоре", Строка(КэшИменаУсловийПеревозкиПоПортам.Получить(СтрокаКТК.УсловияПеревозкиНазначениеМоре)));
			Запись.ЗаписатьАтрибут("УсловияПеревозкиМореПоОтправлениюПрибытию", Строка(КэшИменаУсловийIncoterms.Получить(СтрокаКТК.УсловияПеревозкиПоИнкотермс)));
			//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 106847, 18-04-2025, конец
			
			Запись.ЗаписатьКонецЭлемента();//УсловияПеревозки
			
			Запись.ЗаписатьКонецЭлемента();//Строка
		КонецЦикла;
		Запись.ЗаписатьКонецЭлемента();//Контейнеры
		
		//Евросиб(ДИТ), Беляев СЮ, US 113722 / TA 113989, 10-07-2025, начало
		Запись.ЗаписатьНачалоЭлемента("Файлы");
		Пока ВыборкаФайлыВХранилище.Следующий() Цикл
			Запись.ЗаписатьНачалоЭлемента("Файл");
			Запись.ЗаписатьАтрибут("ФайлГУИД", XMLСтрока(ВыборкаФайлыВХранилище.ФайлВХранилищеГУИД));
			Запись.ЗаписатьАтрибут("ИмяФайла", XMLСтрока(ВыборкаФайлыВХранилище.ФайлВХранилищеИмяФайла));
			Запись.ЗаписатьАтрибут("ТипФайла", XMLСтрока(ВыборкаФайлыВХранилище.ФайлВХранилищеТипФайла));
			Запись.ЗаписатьАтрибут("НомерВерсииФайла", XMLСтрока(ВыборкаФайлыВХранилище.НомерВерсииФайла));
			//Евросиб Шевченко А.В US 116005 TA 116413 02.09.2025
			Запись.ЗаписатьАтрибут("СтатусДокумента", XMLСтрока(ВыборкаФайлыВХранилище.СтатусДокумента));
			Запись.ЗаписатьАтрибут("Автор", XMLСтрока(ВыборкаФайлыВХранилище.Автор));
			Запись.ЗаписатьАтрибут("ДатаВремяСоздания", XMLСтрока(ВыборкаФайлыВХранилище.ДатаВремяСоздания));
			Запись.ЗаписатьАтрибут("Источник", XMLСтрока(ВыборкаФайлыВХранилище.Источник));
			Запись.ЗаписатьАтрибут("Комментарий", XMLСтрока(ВыборкаФайлыВХранилище.Комментарий));
			Запись.ЗаписатьАтрибут("НомерКТК", XMLСтрока(ВыборкаФайлыВХранилище.НомерКТК));
			//Евросиб Шевченко А.В US 116005 TA 119060 09.09.2025
			Запись.ЗаписатьАтрибут("ПризнакУдаленияФайла", XMLСтрока(ВыборкаФайлыВХранилище.ПризнакУдаленияФайла));
			//Евросиб Шевченко А.В US 116005 TA 119060 09.09.2025
			//Евросиб Шевченко А.В US 116005 TA 116413 02.09.2025
			Запись.ЗаписатьКонецЭлемента();
		КонецЦикла;
		Запись.ЗаписатьКонецЭлемента();//ФайлыВХранилище
		//Евросиб(ДИТ), Беляев СЮ, US 113722 / TA 113989, 10-07-2025, конец
		
		Запись.ЗаписатьКонецЭлемента();//Заявка
	КонецЦикла;
	
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, начало
Функция ФорматПустойДаты( Значение )
	
	Результат = "";
	Если Значение <> Дата(1,1,1) Тогда
		Результат = XMLСтрока(Значение);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, начало
Функция ФорматПустогоГУИД( Значение )
	
	Результат = XMLСтрока(Значение);
	Если Результат = "00000000-0000-0000-0000-000000000000" Тогда
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, начало
Функция ПустаяСтрокаДляНуля( Значение )
	
	Возврат ?(Значение = 0, "", Значение);
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 113078 / TA 113852, 07-07-2025, конец

Процедура ДобавитьСправочникЛокации(Запись, ТекСсылка)
	
	Запись.ЗаписатьНачалоЭлемента("Локация");
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекСсылка, "Код,Наименование,Тип,Тип.ИмяПредопределенныхДанных");
	
	Запись.ЗаписатьАтрибут("ГУИД", XMLСтрока(ТекСсылка));
	Запись.ЗаписатьАтрибут("Код", XMLСтрока(ЗначенияРеквизитов.Код));
	Запись.ЗаписатьАтрибут("Наименование", XMLСтрока(ЗначенияРеквизитов.Наименование));
	Запись.ЗаписатьАтрибут("Тип", Строка(ЗначенияРеквизитов.ТипИмяПредопределенныхДанных));
	
	Запись.ЗаписатьКонецЭлемента(); //Локация
	
КонецПроцедуры

Процедура ДобавитьСправочникГрузы(Запись, ТекСсылка)
	
	Запись.ЗаписатьНачалоЭлемента("Груз");
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекСсылка, "Код,Наименование,ЕТСНГ,ГНГ,ТНВЭД");
	
	Запись.ЗаписатьАтрибут("ГУИД", XMLСтрока(ТекСсылка));
	Запись.ЗаписатьАтрибут("Код", XMLСтрока(ЗначенияРеквизитов.Код));
	Запись.ЗаписатьАтрибут("Наименование", XMLСтрока(ЗначенияРеквизитов.Наименование));
	Запись.ЗаписатьАтрибут("ЕТСНГ", XMLСтрока(ЗначенияРеквизитов.ЕТСНГ));
	Запись.ЗаписатьАтрибут("ГНГ", XMLСтрока(ЗначенияРеквизитов.ГНГ));
	Запись.ЗаписатьАтрибут("ТНВЭД", XMLСтрока(ЗначенияРеквизитов.ТНВЭД));
	
	Запись.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура ДобавитьСправочникВидыПеревозок(Запись, ТекСсылка)
	
	Запись.ЗаписатьНачалоЭлемента("ВидПеревозки");
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекСсылка, "Наименование,ИмяПредопределенныхДанных");
	
	Запись.ЗаписатьАтрибут("ГУИД", XMLСтрока(ТекСсылка));
	Запись.ЗаписатьАтрибут("Наименование", XMLСтрока(ЗначенияРеквизитов.Наименование));
	Запись.ЗаписатьАтрибут("ИмяПредопределенныхДанных", XMLСтрока(ЗначенияРеквизитов.ИмяПредопределенныхДанных));
	
	Запись.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура ДобавитьСправочникСервисыУчетноеНаправление(Запись, ТекСсылка)
	
	Запись.ЗаписатьНачалоЭлемента("Продукт");
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекСсылка, "Код,Наименование");
	
	Запись.ЗаписатьАтрибут("ГУИД", XMLСтрока(ТекСсылка));
	Запись.ЗаписатьАтрибут("Код", XMLСтрока(ЗначенияРеквизитов.Код));
	Запись.ЗаписатьАтрибут("Наименование", XMLСтрока(ЗначенияРеквизитов.Наименование));
	
	Запись.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура ДобавитьСправочникТипоразмерыТЕ(Запись, ТекСсылка)
	
	Запись.ЗаписатьНачалоЭлемента("ТипоразмерКТК");
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекСсылка, "Код,Наименование,РазмерКТК,Длина,Ширина,Высота,Объем,КодISO,ТЕУ,Рефрижераторный");
	
	Запись.ЗаписатьАтрибут("ГУИД", XMLСтрока(ТекСсылка));
	Запись.ЗаписатьАтрибут("Код", XMLСтрока(ЗначенияРеквизитов.Код));
	Запись.ЗаписатьАтрибут("Наименование", XMLСтрока(ЗначенияРеквизитов.Наименование));
	Запись.ЗаписатьАтрибут("Длина", XMLСтрока(ЗначенияРеквизитов.Длина));
	Запись.ЗаписатьАтрибут("Ширина", XMLСтрока(ЗначенияРеквизитов.Ширина));
	Запись.ЗаписатьАтрибут("Высота", XMLСтрока(ЗначенияРеквизитов.Высота));
	Запись.ЗаписатьАтрибут("Объем", XMLСтрока(ЗначенияРеквизитов.Объем));
	Запись.ЗаписатьАтрибут("КодISO", XMLСтрока(ЗначенияРеквизитов.КодISO));
	Запись.ЗаписатьАтрибут("ТЕУ", XMLСтрока(ЗначенияРеквизитов.ТЕУ));
	Запись.ЗаписатьАтрибут("Рефрижераторный", XMLСтрока(ЗначенияРеквизитов.Рефрижераторный));
	
	Запись.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

// Функция - Ответное сообщение
//
// Параметры:
//  ГУИД_Документа	 - 	 - 
//  НомерЗаявки		 - 	 - 
//  ФлагОшибки		 - можно передавать 0/1 или Истина/Ложь	 - 
//  ТекстОшибки		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, начало
Функция ОтветноеСообщениеНаПолучениеНомера(ГУИД_Документа, НомерЗаявки, ФлагОшибки, ТекстОшибки)
	
	ЗаписьXML = Новый ЗаписьXML; 
	ЗаписьXML.УстановитьСтроку();
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("ОтветНаЗапрос");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ГУИД_Документа");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(ГУИД_Документа));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("НомерЗаявки");
	ЗаписьXML.ЗаписатьТекст(НомерЗаявки);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ФлагОшибки");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(ФлагОшибки));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ТекстОшибки");
	ЗаписьXML.ЗаписатьТекст(ТекстОшибки);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, начало
Функция ПолучитьПеречислениеУзелОбменаПоИмени(ИмяУзлаОбмена)
	
	Результат = Неопределено;
	Если Метаданные.Перечисления.УзлыОбмена.ЗначенияПеречисления.Найти(ИмяУзлаОбмена) <> Неопределено Тогда
		Результат = Перечисления.УзлыОбмена[ИмяУзлаОбмена];
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, начало

#КонецОбласти





