
&НаКлиенте
Процедура ПунктыПСЦТекстПунктаРусНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекД = Элементы.ПунктыПСЦ.ТекущиеДанные;
	ОпОп = Новый ОписаниеОповещения("ОбработкаВводаРус", ЭтаФорма);
	ПоказатьВводСтроки(ОпОп, ТекД.ТекстПунктаРус, "Введите условия на русском",, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВводаРус(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	ТекД = Элементы.ПунктыПСЦ.ТекущиеДанные;
	ТекД.ТекстПунктаРус = Параметр1;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВводаАнгл(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	ТекД = Элементы.ПунктыПСЦ.ТекущиеДанные;
	ТекД.ТекстПунктаАнгл = Параметр1;
	
КонецПроцедуры

&НаКлиенте
Процедура ПунктыПСЦТекстПунктаАнглНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекД = Элементы.ПунктыПСЦ.ТекущиеДанные;
	ОпОп = Новый ОписаниеОповещения("ОбработкаВводаАнгл", ЭтаФорма);
	ПоказатьВводСтроки(ОпОп, ТекД.ТекстПунктаАнгл, "Введите условия на английском",, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Евросиб Каблов 23.08.2020 (
	//УстановитьПривилегированныйРежим(Истина);
	//Для каждого Стр из Метаданные.Документы.ПСЦ.Реквизиты Цикл
	//	НСтр = РеквизитыШаблоны.Добавить();
	//	НСтр.Шаблон = "##"+Стр.Имя;
	//	НСтр.Реквизит = Стр.Синоним;
	//	//НСтр.ПримерЗначения = Объект[Стр.Имя];
	//КонецЦикла;
	//
	//НСтр = РеквизитыШаблоны.Добавить();
	//НСтр.Шаблон = "##НомерДоговора";
	//НСтр.Реквизит = "Номер договора";
	//
	//НСтр = РеквизитыШаблоны.Добавить();
	//НСтр.Шаблон = "##ДатаДоговора";
	//НСтр.Реквизит = "Дата договора";
	//
	//УстановитьПривилегированныйРежим(Ложь);
	РеквизитыШаблоны.Загрузить(Документы.ПСЦ.ПолучитьТаблицуШаблоновРеквизитов());
	//Евросиб Каблов 23.08.2020 )
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры  

//Евросиб Коханенко Н.А. 08.12.2022 (( #61705
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры //Евросиб Коханенко Н.А. 08.12.2022 )) #61705 



