
//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ДИТ Шевченко А.В. US 88683 TA 88689 19.02.2025
	Если Параметры.Свойство("Отбор") Тогда    
		Если Параметры.Отбор.Свойство("СписокСделок") Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Ссылка",Параметры.Отбор.СписокСделок,ВидСравненияКомпоновкиДанных.ВСписке,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
			Элементы.Список.Отображение = ОтображениеТаблицы.Список;
		КонецЕсли;
	КонецЕсли;
	//ДИТ Шевченко А.В. US 88683 TA 88689 19.02.2025
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )
