&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Действие 		  = Параметры.Действие;
	ИмяТабличнойЧасти = Параметры.ИмяТабличнойЧасти;
	АвтоЗаголовок 	  = Ложь;
	Заголовок		  = Действие + " строки табличной части " + """" + ИмяТабличнойЧасти + """";
	
	//Для Каждого Реквизит Из Параметры.МассивРеквизитов Цикл
	//	МассивСоздаваемыхРеквизитов = Новый Массив;
	//	СоздаваемыйРеквизит = Новый РеквизитФормы(Реквизит.Имя, Реквизит.Тип, , Реквизит.Синоним, Истина);
	//	МассивСоздаваемыхРеквизитов.Добавить(СоздаваемыйРеквизит);
	//	ИзменитьРеквизиты(МассивСоздаваемыхРеквизитов);
	//КонецЦикла;
	//
	//Для Каждого Реквизит Из Параметры.МассивРеквизитов Цикл
	//	Элемент = Элементы.Добавить(Реквизит.Имя, Тип("ПолеФормы"), ЭтаФорма);
	//	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	//	Элемент.ПутьКДанным = Реквизит.Имя;
	//	ЭтотОбъект[Реквизит.Имя] = Реквизит.Значение;
	//КонецЦикла;
	//
	Для Каждого Реквизит Из Параметры.МассивРеквизитов Цикл
		Попытка
			ЭтотОбъект[Реквизит.Имя] = Реквизит.Значение;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(РодВагоновПодКонтейнера) Тогда
	Иначе
		РодВагоновПодКонтейнера = "67";	
	КонецЕсли;
	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаСервере
Функция ЗавершитьРедактированиеНаСервере()
	Модифицированность    = Ложь;
	ВозвращаемаяСтруктура = Новый Структура;
	ВозвращаемаяСтруктура.Вставить("Действие", Действие);
	ВозвращаемаяСтруктура.Вставить("ИмяТабличнойЧасти", ИмяТабличнойЧасти);
	Для Каждого Элемент из Элементы Цикл
		Если Найти(Элемент.Имя, "ОтправкиСборныйГруз") > 0 Тогда 
			Продолжить;
		КонецЕсли;
		Если ТипЗнч(Элемент) = Тип("ПолеФормы") Тогда   
			ВозвращаемаяСтруктура.Вставить(Элемент.Имя, ЭтотОбъект[Элемент.Имя]);
		КонецЕсли;
	КонецЦикла;
	Возврат ВозвращаемаяСтруктура;
КонецФункции

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	Если СборныйГруз Тогда
		ГрузПоЕТСНГ = Неопределено;	
		ГрузПоГНГ = Неопределено;
	КонецЕсли;
	Закрыть(ЗавершитьРедактированиеНаСервере());
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Модифицированность Тогда 
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), "Уверены что хотите закрыть форму? Введенные данные будут утеряны", РежимДиалогаВопрос.ДаНет);
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Модифицированность= Ложь;
		Закрыть();	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция  ГрузополучательПриИзмененииНаСервере(Грузополучатель)
	
Возврат Новый Структура("АдресГрузополучателя,ГрузополучательИд",Грузополучатель.Адрес,Грузополучатель.Код);	
	
КонецФункции

&НаКлиенте
Процедура ГрузополучательПриИзменении(Элемент)
	
	Если ТипЗнч(Грузополучатель) = Тип("СправочникСсылка.э_ПаспортаОрганизаций") и ЗначениеЗаполнено(Грузополучатель) Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтаФорма,ГрузополучательПриИзмененииНаСервере(Грузополучатель)); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СборныйГрузПриИзменении(Элемент = "")
	Если СборныйГруз Тогда 
		Элементы.ГруппаСборныйГрузСписок.Видимость = Истина;
		Элементы.ГрузПоЕТСНГ.Видимость = Ложь;
		Элементы.ГрузПоГНГ.Видимость = Ложь;
	Иначе
		Элементы.ГруппаСборныйГрузСписок.Видимость = Ложь;
		Элементы.ГрузПоЕТСНГ.Видимость = Истина;
		Элементы.ГрузПоГНГ.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СборныйГрузПриИзменении();
КонецПроцедуры


//&НаСервере
//Функция ПлательщикПриИзмененииНаСервере(Плательщик)
//	
//	Возврат Новый Структура("ПлательщикАдрес,ПлательщикОКПО,ПлательщикКод",Плательщик.Адрес,Плательщик.ОКПО,Плательщик.ЕЛС);
//	
//КонецФункции

//&НаКлиенте
//Процедура ПлательщикПриИзменении(Элемент)
//	
//	
//	Если ТипЗнч(Плательщик) = Тип("СправочникСсылка.э_ПаспортаОрганизаций") и ЗначениеЗаполнено(Плательщик) Тогда
//		
//		ЗаполнитьЗначенияСвойств(этаформа,ПлательщикПриИзмененииНаСервере(Плательщик)); 
//		 		
//	КонецЕсли;

//	
//КонецПроцедуры
