
&НаКлиенте
Процедура ПерезаполнитьПоОтправке(Команда)
	
	Объект.СписокКТК.Очистить();
	
	Если ЗначениеЗаполнено(Объект.Отправка) Тогда
		ПерезаполнитьПоОтправке_сервер();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьПоОтправке_сервер()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтейнерыВОтправке.Контейнер КАК Контейнер,
	               |	ПризнакСобственностиКонтейнераСрезПоследних.ВладелецКТК КАК ВладелецТЕ,
	               |	СрокиИспользованияКонтейнеровСрезПоследних.СтокВыдачи.Наименование КАК СтокВыдачи
	               |ИЗ
	               |	РегистрСведений.КонтейнерыВОтправке КАК КонтейнерыВОтправке
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПризнакСобственностиКонтейнера.СрезПоследних КАК ПризнакСобственностиКонтейнераСрезПоследних
	               |		ПО КонтейнерыВОтправке.Контейнер = ПризнакСобственностиКонтейнераСрезПоследних.Контейнер
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиИспользованияКонтейнеров.СрезПоследних КАК СрокиИспользованияКонтейнеровСрезПоследних
	               |		ПО КонтейнерыВОтправке.Контейнер = СрокиИспользованияКонтейнеровСрезПоследних.Контейнер
	               |ГДЕ
	               |	КонтейнерыВОтправке.Отправка = &Отправка";
	Запрос.УстановитьПараметр("Отправка", Объект.Отправка);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		НСтр = Объект.СписокКТК.Добавить();
		НСтр.Контейнер = Ответ.Контейнер;
		НСтр.Собственник = Ответ.ВладелецТЕ;
		НСтр.Выдача = Ответ.СтокВыдачи;
	КонецЦикла;
	
	/////////////////////////////////
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВагоныВОтправке.Вагон КАК Вагон,
	               |	ВагоныВОтправке.Отправка КАК Отправка,
	               |	ВагоныВОтправке.Вагон.ВладелецТС КАК ВладелецТС,
	               |	ВагоныВОтправке.Вагон.ТипТС.Длина КАК Длина,
	               |	ПризнакСобственностиВагонаСрезПоследних.ПризнакСобственности КАК ПризнакСобственности
	               |ИЗ
	               |	РегистрСведений.ВагоныВОтправке КАК ВагоныВОтправке
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПризнакСобственностиВагона.СрезПоследних КАК ПризнакСобственностиВагонаСрезПоследних
	               |		ПО ВагоныВОтправке.Вагон = ПризнакСобственностиВагонаСрезПоследних.Вагон
	               |ГДЕ
	               |	ВагоныВОтправке.Отправка = &Отправка";
	Запрос.УстановитьПараметр("Отправка", Объект.Отправка);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		НайдСтрока = неопределено;
		Для каждого Стр из Объект.СписокКТК Цикл
			Если НЕ ЗначениеЗаполнено(Стр.Платформа) Тогда НайдСтрока = Стр; Прервать; КонецЕсли;
		КонецЦикла;
		Если НайдСтрока = неопределено Тогда
			НайдСтрока = Объект.СписокКТК.Добавить();
		КонецЕсли;
		
		НайдСтрока.Платформа = Ответ.Вагон;
		НайдСтрока.ВладелецТС = Ответ.ВладелецТС;
		НайдСтрока.РазмерПлатформы = Цел(Ответ.Длина * 3.281/10000)*10;
		
	КонецЦикла;
	
	/////////////////////////////////
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	СделкаЗаявки.Заявка.Грузоотправитель КАК Грузоотправитель
	               |ИЗ
	               |	Документ.Сделка.Рейсы КАК СделкаРейсы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Заявки КАК СделкаЗаявки
	               |		ПО СделкаРейсы.Ссылка = СделкаЗаявки.Ссылка
	               |ГДЕ
	               |	СделкаРейсы.Рейс = &Рейс";
	Запрос.УстановитьПараметр("Рейс", Объект.Отправка);
	ТГрузоотправитель = СтрСоединить(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Грузоотправитель"), "; ");
	Если ЗначениеЗаполнено(ТГрузоотправитель) Тогда
		Объект.Грузоотправитель = ТГрузоотправитель;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОтправленияПриИзменении(Элемент)
	
	Объект.НомерНедели = ОбщегоНазначенияКлиент.НеделяГода_ГОСТ(Объект.ДатаОтправления);
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )
