
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.СоставУслугиУслуга.СписокВыбора.ЗагрузитьЗначения(СписокУслугЗапроса());
	
	// + Состояния
	//ФонТекущегоСостояния = ЦветаСтиля.ФонТекущегоСостояния;
	//ФонВыполненногоСостояния = ЦветаСтиля.ФонВыполненногоСостояния;
	//ФонБудущегоСостояния = ЦветаСтиля.ФонБудущегоСостояния;
	// Обновляем панель текущего пользователя и панель состояний
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	// - Состояния
	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура ПериодОтправкиНачалоПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ПериодОтправкиОкончание) Тогда
		Объект.ПериодОтправкиОкончание = КонецДня(Объект.ПериодОтправкиНачало);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПрибытияНачалоПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ПериодПрибытияОкончание) Тогда
		Объект.ПериодПрибытияОкончание = КонецДня(Объект.ПериодПрибытияНачало);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокУслугЗапроса()
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.УслугаДоступнаВЗапросеКлиента
	               |	И НЕ Номенклатура.ПометкаУдаления
	               |	И НЕ Номенклатура.ЭтоГруппа";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервере
Процедура КонтактноеЛицоПриИзмененииНаСервере()
	
	Для каждого Стр из Объект.КонтактноеЛицо.КонтактнаяИнформация Цикл
		Если Стр.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			Объект.КонтактныйТелефон = Стр.НомерТелефона;
		ИначеЕсли Стр.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
			Объект.ЭлектроннаяПочта = Стр.АдресЭП;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактноеЛицоПриИзменении(Элемент)
	КонтактноеЛицоПриИзмененииНаСервере();
КонецПроцедуры

// + ОБЛАСТЬ СОСТОЯНИЯ

// Процедура обновляет панель текущего пользователя
&НаСервере
Процедура ОбновитьПанельТекущегоПользователя()
	
	МаршрутизацияСервер.ОбновитьПанельТекущегоПользователя(Объект, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
КонецПроцедуры

// Функция обновляет панель состояний документа для графического отражения его движения по состояниям
&НаСервере
Процедура ОбновитьПанельСостояний()
	
	МаршрутизацияСервер.ОбновитьПанельСостояний(ЭтотОбъект);
	
КонецПроцедуры

// Этот обработчик вызывается при нажатии на состояния на панели состояний
// Ссылка на него устанавливается кодом, поэтому при проверке конфигурации 1с может сказать, что эта функция не испольузется
// Не верьте 1с!
&НаКлиенте
Процедура ОбработчикНажатияПлитокСостояния(П1 = неопределено, П2 = неопределено) Экспорт
	МаршрутизацияКлиент.ОбработчикНажатияНаПлиткуОбщий(П1, П2);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ДопСвойстваОбъекта.Очистить();
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийИсполнитель_СтатусПриИзменении(Элемент)
	
	// обновляем информацию по состоянию 
	МаршрутизацияКлиент.ТекущийИсполнитель_СтатусПриИзменении(Объект, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
	ОбновитьПанельСостояний();
	
	//РАбота с почтой Стаценко
	Если ТекущийИсполнитель_Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Отклонен") Тогда
	ПараметрыОтправкиПисьма = ЗаполнитьПараметрыПисьма();
	 	
	РаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо(ПараметрыОтправкиПисьма);
	
	КонецЕсли;
	//Стаценко
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПараметрыПисьма()
	ПараметрыОтправкиПисьма	= Новый Структура;
	ПараметрыОтправкиПисьма.Вставить("Тема",Константы.ТемаПисьмаОтклоненияЗаявки.Получить());
	ПараметрыОтправкиПисьма.Вставить("Текст",Константы.ШаблонПисьмаОтклоненияЗаявки.Получить());
	КонтИнф = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект.Контрагент,Справочники.ВидыКонтактнойИнформации.EmailКонтрагента,Объект.Дата,Истина);
	ПараметрыОтправкиПисьма.Вставить("Получатель",КонтИнф);
	Возврат ПараметрыОтправкиПисьма;
КонецФункции

&НаКлиенте
Процедура ПовторнаяМаршрутизация(Команда)
	
	Если Объект.Маршрутизировать Тогда
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыЗапроса.Вставить("Договор", Объект.Договор);
		ПараметрыЗапроса.Вставить("Резидент", Объект.Резидент);
		ПараметрыЗапроса.Вставить("ИсточникЗапроса", Объект.ИсточникЗапроса);
		ПараметрыЗапроса.Вставить("ВидПеревозки", Объект.ВидПеревозки);
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьЗапрос(ПараметрыЗапроса, Объект.Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			Отказ = ПроверитьУказатьОтветственных(РезультатЗапроса, Ложь);
		Иначе
			Сообщить("Для документа не найден подходящий маршрут. Изменения не внесены!");
		КонецЕсли;
		
		ОбновитьПанельСостояний();
	КонецЕсли;
	
	//Если Объект.Маршрутизировать Тогда
	//	ПараметрыЗапроса = Новый Соответствие;
	//	ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
	//	ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
	//	ПараметрыЗапроса.Вставить("Договор", Объект.Договор);
	//	ПараметрыЗапроса.Вставить("Резидент", Объект.Резидент);
	//	ПараметрыЗапроса.Вставить("ИсточникЗапроса", Объект.ИсточникЗапроса);
	//	ПараметрыЗапроса.Вставить("ВидПеревозки", Объект.ВидПеревозки);
	//	РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьЗапрос(ПараметрыЗапроса, Объект.Дата);
	//	Если РезультатЗапроса.Количество() > 0 Тогда
	//		ПримененныйМаршрут = РезультатЗапроса[0].Ссылка;
	//		
	//		ТребуетсяДонастройка = Ложь;
	//		Для каждого Стр из РезультатЗапроса Цикл
	//			Если (Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Стр.Исполнитель)) ИЛИ
	//				(Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Стр.Наблюдатель)) Тогда
	//				ТребуетсяДонастройка = Истина;
	//				Прервать;
	//			КонецЕсли;
	//		КонецЦикла;
	//		Если ТребуетсяДонастройка Тогда
	//			
	//			Отказ = Истина;
	//			
	//			// очищаем таблицу состояний
	//			Объект.Состояния.Очистить();
	//			// открываем форму для заполнения таблицы состояний
	//			ПараметрыОтбора = Новый СТруктура;
	//			ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация",ПримененныйМаршрут);
	//			ОпОп = Новый ОписаниеОповещения("УстановкаОтветственных", ЭтаФорма);
	//			ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//		КонецЕсли;
	//	Иначе
	//		Сообщить("Для документа не найден подходящий маршрут. Изменения не внесены!");
	//	КонецЕсли;
	//	
	//	ОбновитьПанельСостояний();
	//КонецЕсли;
	
КонецПроцедуры

// - ОБЛАСТЬ СОСТОЯНИЯ        

// +++ БЛОК НОВОЙ МАРШРУТИЗАЦИИ

&НаКлиенте
Функция ПроверитьУказатьОтветственных(РезультатЗапроса, СобытиеПередЗаписью)
	
	ДопСвойстваОбъекта.Очистить();
	ЧтоНужноУказатьВручную = Новый Массив;
	Для каждого Стр из  РезультатЗапроса Цикл
		Исполнитель = Стр.Исполнитель;
		Если НЕ Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Исполнитель) Тогда Исполнитель = Объект.Автор; КонецЕсли;
		Наблюдатель = Стр.Наблюдатель;
		Если НЕ Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Наблюдатель) Тогда Наблюдатель = Объект.Автор; КонецЕсли;
		
		Если Стр.ТребуетсяУказатьИсполнителя ИЛИ Стр.ТребуетсяУказатьНаблюдателя Тогда 
			ЧтоНужноУказатьВручную.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель", Стр.Состояние, Исполнитель, Наблюдатель)); 
		КонецЕсли;
	КонецЦикла;
	Если ЧтоНужноУказатьВручную.Количество() > 0 Тогда
		ОпОп = Новый ОписаниеОповещения("ОбработкаУказанияОтветственных", ЭтаФорма, Новый Структура("РезультатЗапроса, СобытиеПередЗаписью", РезультатЗапроса, СобытиеПередЗаписью));
		ПараметрыОтбора = Новый СТруктура;
		ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация", ЧтоНужноУказатьВручную);
		ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Если НЕ СобытиеПередЗаписью Тогда ПовторнаяМаршрутизация_сервер(РезультатЗапроса); КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаУказанияОтветственных(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	ДопСвойстваОбъекта.ЗагрузитьЗначения(П1);
	Если П2.СобытиеПередЗаписью Тогда
		Записать();
	Иначе
		ПовторнаяМаршрутизация_сервер(П2.РезультатЗапроса);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПовторнаяМаршрутизация_сервер(РезультатЗапроса)
	
	ЭтотОбъектЪ = РеквизитФормыВЗначение("Объект");
	МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъектЪ, РезультатЗапроса, Объект.Автор, ДопСвойстваОбъекта);
	ЗначениеВРеквизитФормы(ЭтотОбъектЪ, "Объект");
	
КонецПроцедуры

// --- БЛОК НОВОЙ МАРШРУТИЗАЦИИ

&НаКлиенте
Процедура Делегировать(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ВыборДелегирования", ЭтаФорма);
	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаВыбора",,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборДелегирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	Для Сч = 0 По Объект.Состояния.Количество()-1 Цикл
		Если Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение") ИЛИ Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.ВРаботе") Тогда
			Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Новый");
			НСтр = Объект.Состояния.Вставить(Сч);
			НСтр.Состояние = ПредопределенноеЗначение("Справочник.Состояния.ДелегированноеСогласование");
			НСтр.Исполнитель = Параметр1;
			НСтр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение");
			ОбновитьПанельСостояний();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Рецензирование(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаРецензирования", ЭтаФорма);
	ПараметрыФормы = Новый Структура("РецензОбъект", Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.РецензированиеПриСогласовании", ПараметрыФормы,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРецензирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СостоянияСтатусСогласованияПриИзменении(Элемент)
	
	ТекД = Элементы.Состояния.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ТекД.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛистСогласования(Команда)
	
	ТабДок = МаршрутизацияСервер.ПолучитьТабдокЛистаСогласования(Объект.Ссылка);
	ТабДок.Показать();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ВсеДействующиеДоговоры = КонтрагентыДоговоры_сервер.ПолучитьДействующиеДоговорыКонтрагента(Объект.Контрагент, Объект.Дата, Истина);
	Если ВсеДействующиеДоговоры.Количество() = 1 Тогда
		Объект.Договор = ВсеДействующиеДоговоры[0];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	//Для Каждого Стр Из Объект.Состояния Цикл
	//	// если исполнитель пустой, то проставляем тек пользователя
	//	Если НЕ ЗначениеЗаполнено(Стр.Исполнитель) И Стр.ТребуетсяУказатьИсполнителя Тогда 
	//		Сообщить("Требуется указать исполнителя");
	//		Отказ = Истина;
	//	КонецЕсли;
	//	Если НЕ ЗначениеЗаполнено(Стр.Наблюдатель) И Стр.ТребуетсяУказатьНаблюдателя Тогда 
	//		Сообщить("Требуется указать наблюдателя");
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = ПроверитьНеобходимостьМаршрутизации();
	Если Объект.Маршрутизировать И ДопСвойстваОбъекта.Количество() = 0 И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыЗапроса.Вставить("Договор", Объект.Договор);
		ПараметрыЗапроса.Вставить("ВидПеревозки", Объект.ВидПеревозки);
		ПараметрыЗапроса.Вставить("ИсточникЗапроса", Объект.ИсточникЗапроса);
		ПараметрыЗапроса.Вставить("Резидент", Объект.Резидент);
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьЗапрос(ПараметрыЗапроса, Объект.Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			Отказ = ПроверитьУказатьОтветственных(РезультатЗапроса, Истина);
		КонецЕсли;
		
	КонецЕсли;
	
	//Если НЕ ПараметрыЗаписи.Свойство("СостоянияИзменены") Тогда
	//	
	//	ДляДанногоОбъектаТребуетсяПеремаршрутизация = ПроверитьНеобходимостьМаршрутизации();
	//	
	//	Если Объект.Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
	//		
	//		ПараметрыЗапроса = Новый Соответствие;
	//		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
	//		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
	//		ПараметрыЗапроса.Вставить("Договор", Объект.Договор);
	//		ПараметрыЗапроса.Вставить("ВидПеревозки", Объект.ВидПеревозки);
	//		ПараметрыЗапроса.Вставить("ИсточникЗапроса", Объект.ИсточникЗапроса);
	//		ПараметрыЗапроса.Вставить("Резидент", Объект.Резидент);
	//		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьЗапрос(ПараметрыЗапроса, Объект.Дата);
	//		Если РезультатЗапроса.Количество() > 0 Тогда
	//			ПримененныйМаршрут = РезультатЗапроса[0].Ссылка;
	//			
	//			ТребуетсяДонастройка = Ложь;
	//			Для каждого Стр из РезультатЗапроса Цикл
	//				Если (Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Стр.Исполнитель)) ИЛИ
	//					(Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Стр.Наблюдатель)) Тогда
	//					ТребуетсяДонастройка = Истина;
	//					Прервать;
	//				КонецЕсли;
	//			КонецЦикла;
	//			Если ТребуетсяДонастройка Тогда
	//				
	//				Отказ = Истина;
	//				
	//				// очищаем таблицу состояний
	//				Объект.Состояния.Очистить();
	//				// открываем форму для заполнения таблицы состояний
	//				ПараметрыОтбора = Новый СТруктура;
	//				ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация",ПримененныйМаршрут);
	//				ОпОп = Новый ОписаниеОповещения("УстановкаОтветственных", ЭтаФорма);
	//				ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановкаОтветственных(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда 
		Возврат; 
	КонецЕсли;
	
	Для Каждого Стр Из Параметр1 Цикл
		НовСтр = Объект.Состояния.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Стр);		
	КонецЦикла;
	Параметры.СохранитьДанныеСостояний = Истина;
	
	СтруктураЗаписиДанных = Новый СТруктура;
	СтруктураЗаписиДанных.Вставить("СостоянияИзменены",Истина);
	
	Записать(СтруктураЗаписиДанных);

КонецПроцедуры

&НаСервере
Функция ПроверитьНеобходимостьМаршрутизации()

	ДляДанногоОбъектаТребуетсяПеремаршрутизация = 
	НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ 
	Объект.Ссылка.Организация <> Объект.Организация ИЛИ 
	Объект.Ссылка.Контрагент <> Объект.Контрагент ИЛИ
	Объект.Ссылка.Договор <> Объект.Договор ИЛИ
	Объект.Ссылка.ВидПеревозки <> Объект.ВидПеревозки ИЛИ
	Объект.Ссылка.ИсточникЗапроса <> Объект.ИсточникЗапроса ИЛИ
	Объект.Ссылка.Резидент <> Объект.Резидент ИЛИ Объект.Состояния.Количество() = 0;
	
	Возврат ДляДанногоОбъектаТребуетсяПеремаршрутизация;
	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ДопСвойстваОбъекта", ДопСвойстваОбъекта);
	//Если Параметры.СохранитьДанныеСостояний Тогда
	//	ТЗ = Объект.Состояния.Выгрузить();
	//	ТекущийОбъект.ДополнительныеСвойства.Вставить("Состояния", ТЗ);
	//	Параметры.СохранитьДанныеСостояний = Ложь;
	//КонецЕсли;
	
КонецПроцедуры
