
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	// SIV 02.02.21 Коллеги, помещать не рабочий код в хранилище - это плохая практика. Пожалуйста, проводите тестирование.
	// Код вполне себе рабочий. Конфликтовал код с хитрыми настройками, при которых запрос динамического списка был изменел из кода.
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	СделкаСвязьУчетныхЕдиниц.Заявка КАК Заявка,
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Ссылка,
	               |	СделкаДоходы.УчДокумент КАК УчДокумент
	               |ПОМЕСТИТЬ ВТ3_ДохЗаяв
	               |ИЗ
	               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
	               |		ПО СделкаСвязьУчетныхЕдиниц.Ссылка = СделкаДоходы.Ссылка
	               |ГДЕ
	               |	СделкаСвязьУчетныхЕдиниц.Заявка <> ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка)
	               |	И СделкаДоходы.УчДокумент <> ЗНАЧЕНИЕ(Документ.ОтчетКомитентуОПродажах.ПустаяСсылка)
	               |	И СделкаДоходы.УчДокумент <> ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
				   
				   |	И СделкаСвязьУчетныхЕдиниц.Ссылка В (&Ссылки)
				   |ИНДЕКСИРОВАТЬ ПО  УчДокумент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДохЗаяв.Ссылка КАК Ссылка,
	               |	МИНИМУМ(НЕ СчетПокупателю.Ссылка ЕСТЬ NULL) КАК ЕстьАванс
	               |ПОМЕСТИТЬ ВТ_ОтчКомАв
	               |ИЗ
	               |	ВТ3_ДохЗаяв КАК ВТ_ДохЗаяв
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетПокупателю
	               |		ПО (СчетПокупателю.Документ = ВТ_ДохЗаяв.УчДокумент)
	               |ГДЕ
	               |	НЕ СчетПокупателю.Ссылка ЕСТЬ NULL
	               |	И СчетПокупателю.Ссылка.АвансовыйСчет
	               |	И СчетПокупателю.Ссылка.Проведен
				   |	И ВТ_ДохЗаяв.УчДокумент <> НЕОПРЕДЕЛЕНО
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ДохЗаяв.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДохЗаяв.Ссылка КАК Ссылка,
	               |	МИНИМУМ(НЕ СчетПокупателю.Ссылка ЕСТЬ NULL) КАК ЕстьАванс
	               |ПОМЕСТИТЬ ВТ_ЗаявАв
	               |ИЗ
	               |	ВТ3_ДохЗаяв КАК ВТ_ДохЗаяв
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетПокупателю
	               |		ПО (СчетПокупателю.Ссылка.АвансовыйСчет = ИСТИНА)
	               |			И (СчетПокупателю.Ссылка.Проведен)
	               |			И (СчетПокупателю.Сделка = ВТ_ДохЗаяв.Ссылка)
				   |СГРУППИРОВАТЬ ПО
	               |	ВТ_ДохЗаяв.Ссылка
				   |
	               |ОБЪЕДИНИТЬ ВСЕ
				   |
				   |ВЫБРАТЬ
	               |	ВТ_ДохЗаяв.Ссылка КАК Ссылка,
	               |	МИНИМУМ(НЕ СчетПокупателю.Ссылка ЕСТЬ NULL) КАК ЕстьАванс
	               |ИЗ
	               |	ВТ3_ДохЗаяв КАК ВТ_ДохЗаяв
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетПокупателю
	               |		ПО (СчетПокупателю.Ссылка.АвансовыйСчет = ИСТИНА)
	               |			И (СчетПокупателю.Ссылка.Проведен)
	               |			И ВТ_ДохЗаяв.Заявка = СчетПокупателю.Документ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ДохЗаяв.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВлЗп.Ссылка КАК Ссылка,
	               |	МИНИМУМ(ВлЗп.ЕстьАванс) КАК ЕстьАванс
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВТ_ОтчКомАв.Ссылка КАК Ссылка,
	               |		ВТ_ОтчКомАв.ЕстьАванс КАК ЕстьАванс
	               |	ИЗ
	               |		ВТ_ОтчКомАв КАК ВТ_ОтчКомАв
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВТ_ЗаявАв.Ссылка,
	               |		ВТ_ЗаявАв.ЕстьАванс
	               |	ИЗ
	               |		ВТ_ЗаявАв КАК ВТ_ЗаявАв) КАК ВлЗп
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВлЗп.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Ссылка,
	               |	МИНИМУМ(НЕ ТрДокПрибыл.ДатаПрибыл = ДАТАВРЕМЯ(1, 1, 1)) КАК Прибыл
	               |ИЗ
	               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТрДокПрибыл КАК ТрДокПрибыл
	               |		ПО СделкаСвязьУчетныхЕдиниц.ЖДН = ТрДокПрибыл.ТрДок
				   |ГДЕ  СделкаСвязьУчетныхЕдиниц.Ссылка В (&Ссылки)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылки", Строки.ПолучитьКлючи());
	Результат = Запрос.ВыполнитьПакет();
	
	ВыборкаЕстьАванс 	= Результат[3].Выбрать();
	ВыборкаПрибыл 	= Результат[4].Выбрать();
	
	Пока ВыборкаЕстьАванс.Следующий() Цикл
		СтрокаСписка = Строки[ВыборкаЕстьАванс.Ссылка];
		СтрокаСписка.Данные["ЕстьАванс"] = ВыборкаЕстьАванс.ЕстьАванс;
	КонецЦикла;
	
	
	Пока ВыборкаПрибыл.Следующий() Цикл
		СтрокаСписка = Строки[ВыборкаПрибыл.Ссылка];
		СтрокаСписка.Данные["Прибыл"] = ВыборкаПрибыл.Прибыл;
	КонецЦикла;
	
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

