//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, начало
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ПараметрыОтчетаКонтрольДлиныПериода.СписокВыбора.Добавить(Справочники.НастройкиОтчетовПоЗапросу.ПараметрДатыНачалаКонтролируемогоПериода());
	Элементы.ПараметрыОтчетаКонтрольДлиныПериода.СписокВыбора.Добавить(Справочники.НастройкиОтчетовПоЗапросу.ПараметрДатыОкончанияКонтролируемогоПериода());
	
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, начало
&НаСервереБезКонтекста
Функция ПолучитьСписокПараметровОтчета(ВариантОтчета)
	
	ПараметрыПодключения = Новый Структура;
	ПараметрыПодключения.Вставить("СсылкаВарианта",              ВариантОтчета);
	ПараметрыПодключения.Вставить("ПользовательскиеНастройкиКД", ВариантОтчета.Настройки);
	Если ТипЗнч(ПараметрыПодключения.ПользовательскиеНастройкиКД) <> Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
		ПараметрыПодключения.ПользовательскиеНастройкиКД = Новый ПользовательскиеНастройкиКомпоновкиДанных;
	КонецЕсли;
	Попытка
		Подключение = ВариантыОтчетов.ПодключитьОтчетИЗагрузитьНастройки(ПараметрыПодключения);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(""+ОписаниеОшибки());
	КонецПопытки;
	
	Настройки = Подключение.НастройкиКД; 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновкиТабДокумент = КомпоновщикМакета.Выполнить(Подключение.Объект.СхемаКомпоновкиДанных, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанных"));
	
	МассивПараметров = Новый Массив;
	
	Для Каждого ТекПараметр Из Подключение.Объект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ТекПараметр) <> Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		ИмяПараметра = Строка(ТекПараметр.Параметр);
		Если ТипЗнч(ТекПараметр.Значение) = Тип("СтандартныйПериод") Тогда
			МассивПараметров.Добавить(Строка(ТекПараметр.Параметр)+".ДатаНачала");
			МассивПараметров.Добавить(Строка(ТекПараметр.Параметр)+".ДатаОкончания");
		Иначе
			МассивПараметров.Добавить(Строка(ТекПараметр.Параметр));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивПараметров;
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, начало
&НаКлиенте
Процедура ПараметрыОтчетаНаименованиеПараметраНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	Если Элементы.ПараметрыОтчетаНаименованиеПараметра.СписокВыбора.Количество() = 0 Тогда
		Элементы.ПараметрыОтчетаНаименованиеПараметра.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокПараметровОтчета(Объект.ВариантОтчета));
	КонецЕсли;
	
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, начало
&НаСервереБезКонтекста
Функция ОбразецВходящегоЗапросаНаСервере(Ссылка)
	
	Возврат ФормированиеОтчетовПоЗапросу.ОбразецВходящегоЗапросаНаСервере(Ссылка); 
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, начало
&НаКлиенте
Процедура ОбразецВходящегоЗапроса(Команда)
	Если Модифицированность Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Сначала необходимо записать настройку");
		Возврат;
	КонецЕсли;
	
	Образцы = ОбразецВходящегоЗапросаНаСервере(Объект.Ссылка);
	
	Текст = Новый ТекстовыйДокумент;
	Текст.ДобавитьСтроку("Пример запроса на формирование отчета");
	Текст.ДобавитьСтроку(Образцы.ЗапросФормированияОтчета);
	Текст.ДобавитьСтроку("");
	Текст.ДобавитьСтроку("Пример запроса на получение отчета");
	Текст.ДобавитьСтроку(Образцы.ЗапросОтчетаПоТокену);
	Текст.Показать("Образцы входящих запросов");
	
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 86299 / TA 103050, 20-02-2025, начало
&НаКлиенте
Процедура ОтключитьКонтрольМаксимальногоПериодаПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 86299 / TA 103050, 20-02-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 86299 / TA 103050, 20-02-2025, начало
&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	Элементы.МасимальныйЗапрашиваемыйПериодОтчетаВДнях.Доступность = НЕ Объект.ОтключитьКонтрольМаксимальногоПериода;
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 86299 / TA 103050, 20-02-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 86299 / TA 103050, 20-02-2025, начало
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьДоступность();
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 86299 / TA 103050, 20-02-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 86299 / TA 103050, 20-02-2025, начало
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если НЕ Объект.ОтключитьКонтрольМаксимальногоПериода И НЕ ЗначениеЗаполнено(Объект.МасимальныйЗапрашиваемыйПериодОтчетаВДнях) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не заполнен реквизит Масимальный запрашиваемый период отчета в днях", , "МасимальныйЗапрашиваемыйПериодОтчетаВДнях", ,Отказ);
	КонецЕсли;
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 86299 / TA 103050, 20-02-2025, конец
