
&НаКлиенте
Процедура Перенести(Команда)
	
	Результат = Новый Массив;
	Для каждого Стр из Таб Цикл
		ДанныеСтроки = Новый Структура;
		ДанныеСтроки.Вставить("Вагон", 					Стр.Вагон);
		ДанныеСтроки.Вставить("Контейнер", 				Стр.КТК);
		ДанныеСтроки.Вставить("СтанцияОтправления", 	Стр.СтанцияОтправления);
		ДанныеСтроки.Вставить("СтанцияНазначения", 		Стр.СтанцияНазначения);
		ДанныеСтроки.Вставить("ЖДН", 					Стр.ТранспортныйДокумент);
		ДанныеСтроки.Вставить("Количество", 			Стр.Количество);
		ДанныеСтроки.Вставить("Цена", 					Стр.Цена);
		ДанныеСтроки.Вставить("СтавкаНДС", 				Стр.СтавкаНДС);
		ДанныеСтроки.Вставить("СуммаНДС", 				Стр.СуммаНДС);
		ДанныеСтроки.Вставить("Сумма", 					Стр.Сумма);
		ДанныеСтроки.Вставить("Номенклатура", 			Номенклатура);
		ДанныеСтроки.Вставить("Содержание", 			СодержаниеУслуги);
		Результат.Добавить(ДанныеСтроки);
	КонецЦикла;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьЪ(Команда)
	
	Сч = 2;
	Таб.Очистить();
	
	КЧ = Новый КвалификаторыЧисла(10, 2);
	ОпТЧисло = Новый ОписаниеТипов("Число",,,КЧ);
	
	СоответствиеСтавкиНДС = Новый Соответствие;
	СоответствиеСтавкиНДС.Вставить("20", ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20"));
	СоответствиеСтавкиНДС.Вставить("0", ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0"));
	СоответствиеСтавкиНДС.Вставить("БЕЗНДС", ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС"));
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Начало: 25.12.2024
	СоответствиеСтавкиНДС.Вставить("5", ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС5")); 
	СоответствиеСтавкиНДС.Вставить("7", ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7")); 
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Конец: 25.12.2024
	//Евросиб СубботинВ #125845 09.12.2025 Начало
	СоответствиеСтавкиНДС.Вставить("22", ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22"));
	//Евросиб СубботинВ #125845 09.12.2025 Конец	
	ПрочСтрока = ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C1").Текст;
	ПрочСтрока2 = ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C2").Текст;
	Пока ПрочСтрока <> "" ИЛИ ПрочСтрока2 <> "" Цикл
		НСтр = Таб.Добавить();
		
		Если ЗначениеЗаполнено(ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C1").Текст) Тогда
			НСтр.Вагон = НайтиВагон(ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C1").Текст);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C2").Текст) Тогда
			НСтр.КТК = РаботаСКонтейнерамиСервер.СоздатьКТК(ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C2").Текст, неопределено);
		КонецЕсли;
		
		НСтр.ТранспортныйДокумент 		= НайтиЖДНПоНомеру(ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C5").Текст);
		
		СтанцияОтправленияСтрокой = ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C3").Текст;
		СтанцияНазначенияСтрокой  = ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C4").Текст;
		Если ЗначениеЗаполнено(СтанцияОтправленияСтрокой) Тогда
			НСтр.СтанцияОтправления 		= Локации_сервер.НайтиСтанциюПоНеполномуКоду(СтанцияОтправленияСтрокой);
			Если НЕ ЗначениеЗаполнено(НСтр.СтанцияОтправления) Тогда
				НСтр.СтанцияОтправления = Справочники_Локации_НайтиПоНаименованию(СтанцияОтправленияСтрокой);
			КонецЕсли;
		КонецЕсли; 
		Если ЗначениеЗаполнено(СтанцияНазначенияСтрокой) Тогда
			НСтр.СтанцияНазначения = Локации_сервер.НайтиСтанциюПоНеполномуКоду(СтанцияНазначенияСтрокой);
			Если НЕ ЗначениеЗаполнено(НСтр.СтанцияНазначения) Тогда
				НСтр.СтанцияНазначения = Справочники_Локации_НайтиПоНаименованию(СтанцияНазначенияСтрокой);
			КонецЕсли;
		КонецЕсли;
		
		НСтр.Цена = ОпТЧисло.ПривестиЗначение(ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C7").Текст);
		НСтр.Количество = ОпТЧисло.ПривестиЗначение(ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C6").Текст);
		
		НДССтрокой = ВРег(ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C8").Текст);
		НДССтрокой = СтрЗаменить(НДССтрокой, " ", "");
		НДССтрокой = СтрЗаменить(НДССтрокой, "%", "");
		НДССтрокой = СтрЗаменить(НДССтрокой, Символы.НПП, "");
		
		НСтр.СтавкаНДС = СоответствиеСтавкиНДС.Получить(НДССтрокой);
		
		БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(НСтр);
		БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(НСтр, Истина, СуммаВключаетНДС);
		//БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(НСтр, СуммаВключаетНДС);
		
		Сч = Сч + 1;
		ПрочСтрока = ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C1").Текст;
		ПрочСтрока2 = ТЧ.Область("R"+Формат(Сч, "ЧГ=0")+"C2").Текст;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция Справочники_Локации_НайтиПоНаименованию(ПолноеНаименование)
	Возврат справочники.Локации.НайтиПоНаименованию(ПолноеНаименование, Истина);
КонецФункции

&НаСервереБезКонтекста
Функция НайтиВагон(НомерВагона) 
	
	Возврат Справочники.ТС.НайтиПоНаименованию(СокрЛП(НомерВагона));
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиЖДНПоНомеру(НомерЖДН) 
	
	Результат = неопределено;
	Если НЕ ЗначениеЗаполнено(НомерЖДН) Тогда Возврат Результат; КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ТранспортныйДокумент.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	               |ГДЕ
	               |	НЕ ТранспортныйДокумент.ПометкаУдаления
	               |	И ТранспортныйДокумент.НомерТранспортногоДокумента = &НомерТранспортногоДокумента
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТранспортныйДокумент.Дата УБЫВ";
	Запрос.УстановитьПараметр("НомерТранспортногоДокумента", НомерЖДН);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция РаспознатьДату(ИсхДата)
	
	Результат = неопределено;
	
	Если СтрДлина(ИсхДата) = 10 Тогда
		
		Результат = Дата(Прав(ИсхДата, 4) + Сред(ИсхДата, 4, 2) + Лев(ИсхДата, 2));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция СоздатьЧерезАктПостановки(НомерКТК, СсылкаАктаПостановки)
	
	Результат = Новый Структура("КТК, АктПостановки");
	
	//Евросиб СубботинВ #82679 18.06.2024 Начало подправил алгоритм получения объекта и ссылки
	
	//АктПостановки = Документы.АктПостановкиСнятияСУчета.СоздатьДокумент();
	//
	//Если ЗначениеЗаполнено(СсылкаАктаПостановки) Тогда
	//	АктПостановки = СсылкаАктаПостановки.ПолучитьОбъект();
	//Иначе
	//	АктПостановки.Дата = ТекущаяДата();
	//	АктПостановки.Записать(РежимЗаписиДокумента.Запись);
	//	СсылкаАктаПостановки = АктПостановки.Ссылка;
	//КонецЕсли;
		
	Если ЗначениеЗаполнено(СсылкаАктаПостановки) Тогда
    	АктПостановки = СсылкаАктаПостановки.ПолучитьОбъект();
	Иначе
		АктПостановки = Документы.АктПостановкиСнятияСУчета.СоздатьДокумент();
		АктПостановки.Дата = ТекущаяДата();
		СсылкаАктаПостановки = АктПостановки.ПолучитьСсылкуНового();
		АктПостановки.УстановитьСсылкуНового(СсылкаАктаПостановки);
	КонецЕсли;
    
	Результат.АктПостановки = АктПостановки.Ссылка;
	//Евросиб СубботинВ #82679 18.06.2024 Конец
	
	КТКНайден = Ложь;
	Для каждого Стр из АктПостановки.РегистрацияНовыхКонтейнеров Цикл
		Если Стр.НомерКонтейнера = НомерКТК Тогда 
			КТКНайден = Истина; 
			Результат.КТК = Стр.КонтейнерСсылка; 
			Прервать; 
		КонецЕсли;
	КонецЦикла;
	Если НЕ КТКНайден Тогда
		НСтр = АктПостановки.РегистрацияНовыхКонтейнеров.Добавить();
		НСтр.НомерКонтейнера = НомерКТК;
		НСтр.ДатаВводаВЭксплуатацию = ТекущаяДата();
		АктПостановки.записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
	Для каждого Стр из АктПостановки.РегистрацияНовыхКонтейнеров Цикл
		Если Стр.НомерКонтейнера = НомерКТК Тогда 
			Результат.КТК = Стр.КонтейнерСсылка; 
			Прервать; 
		КонецЕсли;
	КонецЦикла;
	
	Попытка
		АктПостановки.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ОО = ОписаниеОшибки();
		Сообщить("Ошибка: " + ОО);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресТаблицыНоменклатуры = Неопределено;
	Если Параметры.Свойство("АдресТаблицыНоменклатуры", АдресТаблицыНоменклатуры) Тогда
		ТаблицаНоменклатуры = ПолучитьИзВременногоХранилища(АдресТаблицыНоменклатуры);
		Элементы.ЗаполняемаяУслуга.СписокВыбора.ЗагрузитьЗначения(ТаблицаНоменклатуры.ВыгрузитьКолонку("Номенклатура"));
		Элементы.ЗаполняемаяУслуга.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
		Элементы.ЗаполняемаяУслуга.КнопкаСоздания = Ложь;
	КонецЕсли;
	
	Параметры.Свойство("Поступление", Поступление);
	Если Параметры.Свойство("СуммаВключаетНДС") Тогда
		СуммаВключаетНДС = Параметры.СуммаВключаетНДС;
	КонецЕсли;
		

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура ЗаполняемаяУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Поступление) Тогда
		СтандартнаяОбработка = Ложь;
		Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораСтрокиПоступления", ЭтаФорма);
		ОткрытьФорму("Документ.Акцепт.Форма.ФормаВыбораСтрокиУслугиПоступления", Новый Структура("Поступление", Поступление), ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли Элемент.СписокВыбора.Количество() > 0 Тогда		
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Элемент.СписокВыбора;		
	КонецЕсли;
	
КонецПроцедуры

