
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем КоллекцияПечатныхФорм;
	
	//ДИТ Пак И.Т. Task34787 (Ticket#0206504) 03.06.2021 Начало
	Если Параметры.Свойство("ОтправкаТолькоДляФО") Тогда
		ЭтаФорма.ОтправкаТолькоДляФО = Параметры.ОтправкаТолькоДляФО;
		ЭтаФорма.ОбязательнаяОтправка = Истина;
	КонецЕсли;
	Параметры.Свойство("Действие", ЭтаФорма.ВыполняемоеДействие);
	Параметры.Свойство("НаименованиеДействия", ЭтаФорма.ВыполняемоеДействиеНаименование);
	
	Если Параметры.Свойство("ВызовБезОткрытияФормы", ЭтаФорма.ВызовБезОткрытияФормы) Тогда
		Если Параметры.ВызовБезОткрытияФормы = Истина Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	//ДИТ Пак И.Т. Task34787 (Ticket#0206504) 03.06.2021 Конец
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ПользовательскиеМакетыПечати) Тогда
		Элементы.КнопкаПерейтиКУправлениюМакетами.Видимость = Ложь;
	КонецЕсли;
	
	// Проверка входных параметров.
	Если Не ЗначениеЗаполнено(Параметры.ИсточникДанных) Тогда 
		ОбщегоНазначенияКлиентСервер.Проверить(ТипЗнч(Параметры.ПараметрКоманды) = Тип("Массив") Или ОбщегоНазначения.ЗначениеСсылочногоТипа(Параметры.ПараметрКоманды),
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Недопустимое значение параметра ПараметрКоманды при вызове метода УправлениеПечатьюКлиент.ВыполнитьКомандуПечати.
				|Ожидалось: Массив, ЛюбаяСсылка.
				|Передано: %1'"), ТипЗнч(Параметры.ПараметрКоманды)));
	КонецЕсли;

	//ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
	//ПараметрыОткрытия.ПараметрКоманды = Новый Массив;
	//ПараметрыОткрытия.ПараметрыПечати = Новый Структура;
	//ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм", КоллекцияПечатныхФорм);
	//ПараметрыОткрытия.Вставить("ОбъектыПечати", ОбъектыПечати);
	
	
	
	// Поддержка обратной совместимости с 2.1.3.
	ПараметрыПечати = Параметры.ПараметрыПечати;
	Если Параметры.ПараметрыПечати = Неопределено Тогда
		ПараметрыПечати = Новый Структура;
	КонецЕсли;
	Если Не ПараметрыПечати.Свойство("ДополнительныеПараметры") Тогда
		Параметры.ПараметрыПечати = Новый Структура("ДополнительныеПараметры", ПараметрыПечати);
		Для Каждого ПараметрПечати Из ПараметрыПечати Цикл
			Параметры.ПараметрыПечати.Вставить(ПараметрПечати.Ключ, ПараметрПечати.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Если Параметры.КоллекцияПечатныхФорм = Неопределено Тогда
		КоллекцияПечатныхФорм = СформироватьПечатныеФормы(Параметры.ИменаМакетов, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	Иначе
		КоллекцияПечатныхФорм = Параметры.КоллекцияПечатныхФорм;
		ОбъектыПечати = Параметры.ОбъектыПечати;
		ПараметрыВывода = УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода();
	КонецЕсли;
	
	СоздатьРеквизитыИЭлементыФормыДляПечатныхФорм(КоллекцияПечатныхФорм);
	УбратьПодписьИПечать();
	СохранитьНастройкиКомплектаПоУмолчанию();
	ЗагрузитьНастройкиКоличестваКопий();
	ЕстьРазрешенныйВывод = ЕстьРазрешенныйВывод();
	НастроитьВидимостьЭлементовФормы(ЕстьРазрешенныйВывод);
	УстановитьПризнакДоступностиВыводаВПредставленияхПечатныхФорм(ЕстьРазрешенныйВывод);
	УстановитьИмяПринтераВПодсказкеКнопкиПечать();
	УстановитьЗаголовокФормы();
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() И ЭтоПечатьКомплекта() Тогда
		Элементы.Копий.Заголовок = НСтр("ru = 'Копий комплекта'");
	КонецЕсли;
	
	ДополнительнаяИнформация = Новый Структура("Картинка, Текст", Новый Картинка, "");
	МассивСсылок = Параметры.ПараметрКоманды;
	Если ОбщегоНазначения.ЗначениеСсылочногоТипа(МассивСсылок) Тогда
		МассивСсылок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(МассивСсылок);
	КонецЕсли;
	Если ТипЗнч(МассивСсылок) = Тип("Массив")
		И МассивСсылок.Количество() > 0
		И ОбщегоНазначения.ЗначениеСсылочногоТипа(МассивСсылок[0]) Тогда
			Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие") Тогда 
				МодульЭлектронноеВзаимодействие = ОбщегоНазначения.ОбщийМодуль("ЭлектронноеВзаимодействие");
				МодульЭлектронноеВзаимодействие.ПриВыводеНавигационнойСсылкиВФормеОбъектаИБ(ДополнительнаяИнформация, МассивСсылок);
			КонецЕсли;
	КонецЕсли;
	Элементы.ДополнительнаяИнформация.Заголовок = СтроковыеФункцииКлиентСервер.ФорматированнаяСтрока(ДополнительнаяИнформация.Текст);
	Элементы.КартинкаИнформации.Картинка = ДополнительнаяИнформация.Картинка;
	Элементы.ГруппаДополнительнаяИнформация.Видимость = Не ПустаяСтрока(Элементы.ДополнительнаяИнформация.Заголовок);
	Элементы.КартинкаИнформации.Видимость = Элементы.КартинкаИнформации.Картинка.Вид <> ВидКартинки.Пустая;
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Элементы.КоманднаяПанельЛеваяЧасть.Видимость = Ложь;
		Элементы.КоманднаяПанельПраваяЧасть.Видимость = Ложь;
		Элементы.НастройкиПечатныхФорм.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
		Элементы.КнопкаОтправитьВсеДействия.КнопкаПоУмолчанию = Истина;
		Элементы.Справка.ТолькоВоВсехДействиях= Истина;
		Элементы.КнопкаИзменитьМакет.Видимость = Ложь;
	КонецЕсли;
	
	УправлениеПечатьюПереопределяемый.ПечатьДокументовПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	// печать по отборам
	НовСтр = ТЗТипыДокументов.Добавить();
	НовСтр.ВидДокумента = "Корректировка реализации";
	НовСтр.ВидДокументаВСистеме = "КорректировкаРеализации";
	НовСтр = ТЗТипыДокументов.Добавить();
	НовСтр.ВидДокумента = "Отчет комитенту";
	НовСтр.ВидДокументаВСистеме = "ОтчетКомитентуОПродажах";
	НовСтр = ТЗТипыДокументов.Добавить();
	НовСтр.ВидДокумента = "Реализация товаров и услуг";
	НовСтр.ВидДокументаВСистеме = "РеализацияТоваровУслуг";
	НовСтр = ТЗТипыДокументов.Добавить();
	НовСтр.ВидДокумента = "Счет на оплату покупателю";
	НовСтр.ВидДокументаВСистеме = "СчетНаОплатуПокупателю";
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	УправлениеПечатьюПереопределяемый.ПечатьДокументовПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	УправлениеПечатьюПереопределяемый.ПечатьДокументовПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ВладелецФормы = Неопределено Тогда
		УникальныйИдентификаторХранилища = Новый УникальныйИдентификатор;
	Иначе
		УникальныйИдентификаторХранилища = ВладелецФормы.УникальныйИдентификатор;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкиФорматаСохранения) Тогда
		Отказ = Истина; // отказ от открытия формы
		СохранитьПечатнуюФормуВФайл();
		Возврат;
	КонецЕсли;
	
	//Евросиб Каблов 23.06.2021 ( Ticket#0225310
	//ФайлыВоВременномХранилище = ПоместитьОфисныеДокументыВоВременноеХранилище();
	//КаталогВременныхФайлов = КаталогВременныхФайлов();
	//КаталогВременныхФайлов = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(КаталогВременныхФайлов);
	//Для Каждого ФайлДляЗаписи Из ФайлыВоВременномХранилище Цикл
	//	ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФайлДляЗаписи.АдресВоВременномХранилище);
	//	ДвоичныеДанные.Записать(УникальноеИмяФайла(КаталогВременныхФайлов + ФайлДляЗаписи.Представление));
	//КонецЦикла;
	//Евросиб Каблов 23.06.2021 ) 
	
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	Если ВладелецФормы <> Неопределено Тогда
		Если ТипЗнч(ВладелецФормы.Объект.Ссылка) = Тип("ДокументСсылка.РелизКлиента") Тогда
			Элементы.Группа2.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		КонецЕсли;
	КонецЕсли;
	// Евросиб Фролов)
	
	//Евросиб Коханенко Н.А. 26.03.2025 (( #102319 
	Если ЭтотОбъект.КлючНастроек = "Документ.ПСЦПоставщика-ПСЦПоставщикаАвтоперевозки" 
		ИЛИ ЭтотОбъект.КлючНастроек = "Документ.ПСЦПоставщика-ПСЦПоставщикаАвтоперевозкиТерминалы" Тогда
		Элементы.СохранитьВПрисоединенныхФайлах.Видимость = Истина;
		Если Параметры.Свойство("ПараметрКоманды")
			И Параметры.ПараметрКоманды.Количество() > 0
			И ЗначениеЗаполнено(Параметры.ПараметрКоманды[0]) Тогда
			ТекущийСтатус = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Параметры.ПараметрКоманды[0], "СтатусДокумента");
			Если ТекущийСтатус = ПредопределенноеЗначение("Перечисление.СтатусыСогласования.Планируется") Тогда
				Элементы.СохранитьВПрисоединенныхФайлах.Доступность = Ложь;
			Иначе
				Элементы.СохранитьВПрисоединенныхФайлах.Доступность = Истина;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Элементы.СохранитьВПрисоединенныхФайлах.Видимость = Ложь;
	КонецЕсли;
	//Евросиб Коханенко Н.А. 26.03.2025 )) #102319 

	ПодключитьОбработчикОжидания("ПослеОткрытия", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОткрытия()
	
	Если Элементы.ФлажокПодписьИПечать.Видимость Тогда
		ДобавитьУдалитьПодписьПечать();
	КонецЕсли;
	УстановитьТекущуюСтраницу();
	РассчитатьПоказатели();
	
	УправлениеПечатьюКлиентПереопределяемый.ПечатьДокументовПослеОткрытия(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ВРег(ИсточникВыбора.ИмяФормы) = ВРег("ОбщаяФорма.СохранениеПечатнойФормы") Тогда
		
		Если ВыбранноеЗначение <> Неопределено И ВыбранноеЗначение <> КодВозвратаДиалога.Отмена Тогда
			ФайлыВоВременномХранилище = ПоместитьТабличныеДокументыВоВременноеХранилище(ВыбранноеЗначение);
			Если ВыбранноеЗначение.ВариантСохранения = "СохранитьВПапку" Тогда
				СохранитьПечатныеФормыВПапку(ФайлыВоВременномХранилище, ВыбранноеЗначение.ПапкаДляСохранения);
			Иначе
				ЗаписанныеОбъекты = ПрисоединитьПечатныеФормыКОбъекту(ФайлыВоВременномХранилище, ВыбранноеЗначение.ОбъектДляПрикрепления);
				Если ЗаписанныеОбъекты.Количество() > 0 Тогда
					ОповеститьОбИзменении(ТипЗнч(ЗаписанныеОбъекты[0]));
				КонецЕсли;
				Для Каждого ЗаписанныйОбъект Из ЗаписанныеОбъекты Цикл
					Оповестить("Запись_Файл", Новый Структура, ЗаписанныйОбъект);
				КонецЦикла;
				ПоказатьОповещениеПользователя(, , НСтр("ru = 'Сохранение завершено'"), БиблиотекаКартинок.Информация32);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ВРег(ИсточникВыбора.ИмяФормы) = ВРег("ОбщаяФорма.ВыборФорматаВложений")
		Или ВРег(ИсточникВыбора.ИмяФормы) = ВРег("ОбщаяФорма.ПодготовкаНовогоПисьма") Тогда
		
		Если ВыбранноеЗначение <> Неопределено И ВыбранноеЗначение <> КодВозвратаДиалога.Отмена Тогда
			ПараметрыОтправки = ПараметрыОтправкиПисьма(ВыбранноеЗначение);
			
			МодульРаботаСПочтовымиСообщениямиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСПочтовымиСообщениямиКлиент");
			//МодульРаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо(ПараметрыОтправки);
			//ДИТ, Беляев СЮ, Ticket#0297503 / BUG 64926, 07-02-2023, начало
			Для Каждого ПараметрыДляОтправкиПисьма Из ПараметрыОтправки Цикл
				МодульРаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо(ПараметрыДляОтправкиПисьма);	
			КонецЦикла;
			//ДИТ, Беляев СЮ, Ticket#0297503 / BUG 64926, 07-02-2023, конец
		КонецЕсли;
		
	ИначеЕсли ВРег(ИсточникВыбора.ИмяФормы) = ВРег("ОбщаяФорма.ВыборПодписантов") Тогда
		
		УдалитьСтарыеЭлементы();
		НастройкиПечатныхФорм.Очистить();
		Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
			СозданиеТаблицыДокументов(ВыбранноеЗначение);
		Иначе
			СозданиеТаблицыДокументов(Неопределено);
		КонецЕсли;
		
		Элементы.Группа2.ТекущаяСтраница = Элементы.Группа2.ПодчиненныеЭлементы.ГруппаПечать;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	НастройкаПечатнойФормы = НастройкаТекущейПечатнойФормы();
	
	Если ИмяСобытия = "Запись_ПользовательскиеМакетыПечати" 
		И Источник.ВладелецФормы = ЭтотОбъект
		И Параметр.ИмяОбъектаМетаданныхМакета = НастройкаПечатнойФормы.ПутьКМакету Тогда
			ПодключитьОбработчикОжидания("ОбновитьТекущуюПечатнуюФорму",0.1,Истина);
	ИначеЕсли (ИмяСобытия = "ОтказОтИзмененияМакета"
		Или ИмяСобытия = "ОтменаРедактированияТабличногоДокумента"
		И Параметр.ИмяОбъектаМетаданныхМакета = НастройкаПечатнойФормы.ПутьКМакету)
		И Источник.ВладелецФормы = ЭтотОбъект Тогда
			ОтобразитьСостояниеТекущейПечатнойФормы();
	ИначеЕсли ИмяСобытия = "Запись_ТабличныйДокумент" 
		И Параметр.ИмяОбъектаМетаданныхМакета = НастройкаПечатнойФормы.ПутьКМакету 
		И Источник.ВладелецФормы = ЭтотОбъект Тогда
			Макет = Параметр.ТабличныйДокумент;
			АдресМакетаВоВременномХранилище = ПоместитьВоВременноеХранилище(Макет);
			ЗаписатьМакет(Параметр.ИмяОбъектаМетаданныхМакета, АдресМакетаВоВременномХранилище);
			ПодключитьОбработчикОжидания("ОбновитьТекущуюПечатнуюФорму",0.1,Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	//ДИТ Пак И.Т. Task34787 (Ticket#0206504) 03.06.2021 Начало
	Если ЭтаФорма.ОбязательнаяОтправка Тогда
		Отказ = Истина;
		ПередЗакрытиемВопросОбОбязательнойОтправке();
	КонецЕсли;
	//ДИТ Пак И.Т. Task34787 (Ticket#0206504) 03.06.2021 Конец
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КопийПриИзменении(Элемент)
	Если НастройкиПечатныхФорм.Количество() = 1 Тогда
		НастройкиПечатныхФорм[0].Количество = Копий;
		НачатьСохранениеНастроек();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДополнительнаяИнформацияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	МассивСсылок = Параметры.ПараметрКоманды;
	Если ТипЗнч(МассивСсылок) <> Тип("Массив") Тогда
		МассивСсылок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(МассивСсылок);
	КонецЕсли;
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЭлектронноеВзаимодействие") Тогда 
		МодульЭлектронноеВзаимодействиеКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ЭлектронноеВзаимодействиеКлиент");
		МодульЭлектронноеВзаимодействиеКлиент.ОбработкаНавигационнойСсылкиВФормеПечатиБСП(НавигационнаяСсылкаФорматированнойСтроки, МассивСсылок);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяПечатнаяФормаПриАктивизацииОбласти(Элемент)
	ПодключитьОбработчикОжидания("РассчитатьПоказателиДинамически", 0.2, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ФлажокПодписьИПечатьПриИзменении(Элемент)
	ДобавитьУдалитьПодписьПечать();
	УстановитьТекущуюСтраницу();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	УправлениеПечатьюКлиентПереопределяемый.ПечатьДокументовОбработкаНавигационнойСсылки(ЭтотОбъект, Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиПечатныхФорм

&НаКлиенте
Процедура НастройкиПечатныхФормПриИзменении(Элемент)
	МожноПечатать = Ложь;
	МожноСохранять = Ложь;
	
	Для Каждого НастройкаПечатнойФормы Из НастройкиПечатныхФорм Цикл
		ПечатнаяФорма = ЭтотОбъект[НастройкаПечатнойФормы.ИмяРеквизита];
		ПолеТабличногоДокумента = Элементы[НастройкаПечатнойФормы.ИмяРеквизита];
		
		МожноПечатать = МожноПечатать Или НастройкаПечатнойФормы.Печатать И ПечатнаяФорма.ВысотаТаблицы > 0
			И ПолеТабличногоДокумента.Вывод = ИспользованиеВывода.Разрешить;
		
		МожноСохранять = МожноСохранять Или НастройкаПечатнойФормы.Печатать И ПечатнаяФорма.ВысотаТаблицы > 0
			И ПолеТабличногоДокумента.Вывод = ИспользованиеВывода.Разрешить;
			// Евросиб Фролов (10.02.2022 Ticket№ 0259435
			// Закомментировано, т.к. у табличного документа теперь всегда защита, а сохранение должно работать.
			//И Не ПолеТабличногоДокумента.Защита;		
			// Евросиб Фролов)
			
		//Евросиб Каблов 23.06.2021 ( Ticket#0225310
		Если ЗначениеЗаполнено(НастройкаПечатнойФормы.ОфисныеДокументы) Тогда
			МожноПечатать = Истина;
			МожноСохранять = Истина;
		КонецЕсли;
		//Евросиб Каблов 23.06.2021 ) 
	КонецЦикла;
	
	Элементы.КнопкаПечатьКоманднаяПанель.Доступность = МожноПечатать;
	Элементы.КнопкаПечатьВсеДействия.Доступность = МожноПечатать;
	
	Элементы.КнопкаСохранить.Доступность = МожноСохранять;
	Элементы.КнопкаСохранитьВсеДействия.Доступность = МожноСохранять;
	
	Элементы.КнопкаОтправить.Доступность = МожноСохранять;
	Элементы.КнопкаОтправитьВсеДействия.Доступность = МожноСохранять;
	
	НачатьСохранениеНастроек();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПечатныхФормПриАктивизацииСтроки(Элемент)
	ОтключитьОбработчикОжидания("УстановитьТекущуюСтраницу");
	ПодключитьОбработчикОжидания("УстановитьТекущуюСтраницу", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПечатныхФормКоличествоРегулирование(Элемент, Направление, СтандартнаяОбработка)
	НастройкаПечатнойФормы = НастройкаТекущейПечатнойФормы();
	НастройкаПечатнойФормы.Печатать = НастройкаПечатнойФормы.Количество + Направление > 0;
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПечатныхФормПечататьПриИзменении(Элемент)
	НастройкаПечатнойФормы = НастройкаТекущейПечатнойФормы();
	Если НастройкаПечатнойФормы.Печатать И НастройкаПечатнойФормы.Количество = 0 Тогда
		НастройкаПечатнойФормы.Количество = 1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПечатныхФормПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбъектыПечати", ОбъектыПечати);
	ОткрытьФорму("ОбщаяФорма.СохранениеПечатнойФормы", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьПечатныеФормыПоПочте();
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКДокументу(Команда)
	
	СписокВыбора = Новый СписокЗначений;
	Для Каждого ОбъектПечати Из ОбъектыПечати Цикл
		СписокВыбора.Добавить(ОбъектПечати.Представление, Строка(ОбъектПечати.Значение));
	КонецЦикла;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПерейтиКДокументуЗавершение", ЭтотОбъект);
	СписокВыбора.ПоказатьВыборЭлемента(ОписаниеОповещения, НСтр("ru = 'Перейти к печатной форме'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКУправлениюМакетами(Команда)
	ОткрытьФорму("РегистрСведений.ПользовательскиеМакетыПечати.Форма.МакетыПечатныхФорм");
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ТабличныеДокументы = ТабличныеДокументыДляПечати();
	УправлениеПечатьюКлиент.РаспечататьТабличныеДокументы(ТабличныеДокументы, ОбъектыПечати,
		ТабличныеДокументы.Количество() > 1, ?(НастройкиПечатныхФорм.Количество() > 1, Копий, 1));
		
	//Евросиб Каблов 23.06.2021 ( Ticket#0225310
	СписокФайловВоВременномХранилище = ПоместитьОфисныеДокументыВоВременноеХранилище();
	Если СписокФайловВоВременномХранилище.Количество() > 0 Тогда
		
		//Shell = Новый COMОбъект("Shell.Application");
		
		Папка = КаталогВременныхФайлов();
		Папка = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(Папка);		
		Для Каждого ФайлДляЗаписи Из СписокФайловВоВременномХранилище Цикл
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФайлДляЗаписи.АдресВоВременномХранилище);
			ИмяФайла = УникальноеИмяФайла(Папка + ФайлДляЗаписи.Представление);
			ДвоичныеДанные.Записать(ИмяФайла);
			
//Евросиб Литвинов 29.06.2021 ( Ticket#0218510 #35933
			НапечататьPDFДокумент(ИмяФайла);
//Евросиб Литвинов 29.06.2021 ) Ticket#0218510 #35933
		КонецЦикла;
		
	КонецЕсли;
	//Евросиб Каблов 23.06.2021 )
	
	//Евросиб Каблов (
	ПечатаемыеДокументы = Новый Массив;
	Для Каждого ПечатаемыйДокумент Из Параметры.ПараметрКоманды Цикл
		ПечатаемыеДокументы.Добавить(ПечатаемыйДокумент);
	КонецЦикла;
	ПечатьБухгалтерскихДокументов.УстановитьУДокументовПризнакВыставлен(ПечатаемыеДокументы, Истина);
	//Евросиб Каблов )
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьНастройкуКоличестваКопий(Команда)
	УстановитьВидимостьНастройкиКоличестваКопий();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	УстановитьСнятьФлажки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	УстановитьСнятьФлажки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СброситьНастройки(Команда)
	ВосстановитьНастройкиПечатныхФорм();
	НачатьСохранениеНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьМакет(Команда)
	ОткрытьМакетДляРедактирования();
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьРедактирование(Команда)
	ПереключитьРедактированиеТекущейПечатнойФормы();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСумму(Команда)
	РассчитатьПоказатели(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьКоличество(Команда)
	РассчитатьПоказатели(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСреднее(Команда)
	РассчитатьПоказатели(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьМинимум(Команда)
	РассчитатьПоказатели(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьМаксимум(Команда)
	РассчитатьПоказатели(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьВсеПоказатели(Команда)
	УстановитьВидимостьПоказателей(Не Элементы.РассчитатьВсеПоказатели.Пометка);
КонецПроцедуры

&НаКлиенте
Процедура СвернутьПоказатели(Команда)
	УстановитьВидимостьПоказателей(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	ПродолжитьВыполнениеНаСервере = Ложь;
	ДополнительныеПараметры = Неопределено;
	
	УправлениеПечатьюКлиентПереопределяемый.ПечатьДокументовВыполнитьКоманду(
		ЭтотОбъект, Команда, ПродолжитьВыполнениеНаСервере, ДополнительныеПараметры);
	
	Если ПродолжитьВыполнениеНаСервере Тогда
		ПриВыполненииКомандыНаСервере(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

// ++ ДИТ_Агафонов_task 25372 17.10.2022
&НаКлиенте
Процедура СоздатьПакет(Команда)
	МассивДокументов = ПолучитьМассивДокументовНаСервере();
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("МассивДокументов",МассивДокументов);
	ОткрытьФорму("Обработка.АРМ_ЖурналУчетаОригиналовИСФ.Форма.Форма",ПараметрыОткрытия);
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивДокументовНаСервере()
	ТЗДокументов = НастройкиПечатныхФорм.Выгрузить(,"СсылкаДокПервоначальная");
	ТЗДокументов.Свернуть("СсылкаДокПервоначальная");
	Возврат ТЗДокументов.ВыгрузитьКолонку("СсылкаДокПервоначальная");
КонецФункции // ()
// -- ДИТ_Агафонов_task 25372 17.10.2022

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НастройкиПечатныхФорм.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НастройкиПечатныхФорм.Печатать");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);

КонецПроцедуры

&НаСервере
Функция СформироватьПечатныеФормы(ИменаМакетов, Отказ)
	
	Результат = Неопределено;
	// Формирование табличных документов.
	Если ЗначениеЗаполнено(Параметры.ИсточникДанных) Тогда
		УправлениеПечатью.ПечатьПоВнешнемуИсточнику(
			Параметры.ИсточникДанных,
			Параметры.ПараметрыИсточника,
			Результат,
			ОбъектыПечати,
			ПараметрыВывода);
	Иначе
		ТипыОбъектовПечати = Новый Массив;
		Параметры.ПараметрыПечати.Свойство("ТипыОбъектовПечати", ТипыОбъектовПечати);
		ПечатныеФормы = УправлениеПечатью.СформироватьПечатныеФормы(Параметры.ИмяМенеджераПечати, ИменаМакетов,
			Параметры.ПараметрКоманды, Параметры.ПараметрыПечати.ДополнительныеПараметры, ТипыОбъектовПечати);
		ОбъектыПечати = ПечатныеФормы.ОбъектыПечати;
		ПараметрыВывода = ПечатныеФормы.ПараметрыВывода;
		Результат = ПечатныеФормы.КоллекцияПечатныхФорм;
	КонецЕсли;
	
	// Установка признака сохранения печатной формы в файл (не открывать форму, сразу сохранять в файл).
	Если ТипЗнч(Параметры.ПараметрыПечати) = Тип("Структура") И Параметры.ПараметрыПечати.Свойство("ФорматСохранения")
		И ЗначениеЗаполнено(Параметры.ПараметрыПечати.ФорматСохранения) Тогда
		НайденныйФормат = УправлениеПечатью.НастройкиФорматовСохраненияТабличногоДокумента().Найти(ТипФайлаТабличногоДокумента[Параметры.ПараметрыПечати.ФорматСохранения], "ТипФайлаТабличногоДокумента");
		Если НайденныйФормат <> Неопределено Тогда
			НастройкиФорматаСохранения = Новый Структура("ТипФайлаТабличногоДокумента,Представление,Расширение,Фильтр");
			ЗаполнитьЗначенияСвойств(НастройкиФорматаСохранения, НайденныйФормат);
			НастройкиФорматаСохранения.Фильтр = НастройкиФорматаСохранения.Представление + "|*." + НастройкиФорматаСохранения.Расширение;
			НастройкиФорматаСохранения.ТипФайлаТабличногоДокумента = Параметры.ПараметрыПечати.ФорматСохранения;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьНастройкиКоличестваКопий()
	
	СохраненныеНастройкиПечатныхФорм = Новый Массив;
	
	ИспользоватьСохраненныеНастройки = Истина;
	Если ТипЗнч(Параметры.ПараметрыПечати) = Тип("Структура") И Параметры.ПараметрыПечати.Свойство("ПереопределитьПользовательскиеНастройкиКоличества") Тогда
		ИспользоватьСохраненныеНастройки = Не Параметры.ПараметрыПечати.ПереопределитьПользовательскиеНастройкиКоличества;
	КонецЕсли;
	
	Если ИспользоватьСохраненныеНастройки Тогда
		Если ЗначениеЗаполнено(Параметры.ИсточникДанных) Тогда
			КлючНастроек = Строка(Параметры.ИсточникДанных.УникальныйИдентификатор()) + "-" + Параметры.ПараметрыИсточника.ИдентификаторКоманды;
		Иначе
			ИменаМакетов = Параметры.ИменаМакетов;
			Если ТипЗнч(ИменаМакетов) = Тип("Массив") Тогда
				ИменаМакетов = СтрСоединить(ИменаМакетов, ",");
			КонецЕсли;
			
			КлючНастроек = Параметры.ИмяМенеджераПечати + "-" + ИменаМакетов;
		КонецЕсли;
		СохраненныеНастройкиПечатныхФорм = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПечатныхФорм", КлючНастроек, Новый Массив);
	КонецЕсли;

	
	ВосстановитьНастройкиПечатныхФорм(СохраненныеНастройкиПечатныхФорм);
	
	// ++ ДИТ_Агафонов_task 25372 06.10.2022
	НастройкиПечатныхФорм.Сортировать("Представление");
	// -- ДИТ_Агафонов_task 25372 06.10.2022
	
	Если ЭтоПечатьКомплекта() Тогда
		Копий = 1;
	Иначе
		Если НастройкиПечатныхФорм.Количество() > 0 Тогда
			Копий = НастройкиПечатныхФорм[0].Количество;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьРеквизитыИЭлементыФормыДляПечатныхФорм(КоллекцияПечатныхФорм)
	
	// данные по старым реквизитам
	ТекРеквизиты = ЭтаФорма.ПолучитьРеквизиты();
	МассивУдаляемыхРеквизитов = Новый Массив;
	Для Каждого Рек Из ТекРеквизиты Цикл
		ПутьКДан = ?(ЗначениеЗаполнено(Рек.Путь),Строка(Рек.Путь)+".","");
		Если СтрНачинаетсяС(Рек.Имя,"ПечатнаяФорма") И НЕ Рек.Имя = "ПечатнаяФормаОбразец" Тогда
			МассивУдаляемыхРеквизитов.Добавить(Строка(ПутьКДан) + Рек.Имя);
		КонецЕсли;
	КонецЦикла;
		
	// Создание реквизитов для табличных документов.
	НовыеРеквизитыФормы = Новый Массив;
	Для НомерПечатнойФормы = 1 По КоллекцияПечатныхФорм.Количество() Цикл
		ИмяРеквизита = "ПечатнаяФорма" + Формат(НомерПечатнойФормы,"ЧГ=0");
		РеквизитФормы = Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов("ТабличныйДокумент"),,КоллекцияПечатныхФорм[НомерПечатнойФормы - 1].СинонимМакета);
		НовыеРеквизитыФормы.Добавить(РеквизитФормы);
	КонецЦикла;
	ИзменитьРеквизиты(НовыеРеквизитыФормы,МассивУдаляемыхРеквизитов);
	МассивУдаляемыхРеквизитов.Очистить();
	
	// Создание страниц с табличными документами на форме.
	НомерПечатнойФормы = 0;
	ПечатьОфисныхДокументов = Ложь;
	ДобавленныеНастройкиПечатныхФорм = Новый Соответствие;
	Для Каждого РеквизитФормы Из НовыеРеквизитыФормы Цикл
		ОписаниеПечатнойФормы = КоллекцияПечатныхФорм[НомерПечатнойФормы];
		
		// Таблица настроек печатных форм (начало).
		НоваяНастройкаПечатнойФормы = НастройкиПечатныхФорм.Добавить();
		НоваяНастройкаПечатнойФормы.Представление = ОписаниеПечатнойФормы.СинонимМакета;
		НоваяНастройкаПечатнойФормы.Печатать = ОписаниеПечатнойФормы.Экземпляров > 0;
		НоваяНастройкаПечатнойФормы.Количество = ОписаниеПечатнойФормы.Экземпляров;
		НоваяНастройкаПечатнойФормы.ИмяМакета = ОписаниеПечатнойФормы.ИмяМакета;
		НоваяНастройкаПечатнойФормы.ПозицияПоУмолчанию = НомерПечатнойФормы;
		НоваяНастройкаПечатнойФормы.Название = ОписаниеПечатнойФормы.СинонимМакета;
		НоваяНастройкаПечатнойФормы.ПутьКМакету = ОписаниеПечатнойФормы.ПолныйПутьКМакету;
		НоваяНастройкаПечатнойФормы.ИмяФайлаПечатнойФормы = ОбщегоНазначения.ЗначениеВСтрокуXML(ОписаниеПечатнойФормы.ИмяФайлаПечатнойФормы);
		НоваяНастройкаПечатнойФормы.ОфисныеДокументы = ?(ПустаяСтрока(ОписаниеПечатнойФормы.ОфисныеДокументы), "", ОбщегоНазначения.ЗначениеВСтрокуXML(ОписаниеПечатнойФормы.ОфисныеДокументы));
		НоваяНастройкаПечатнойФормы.ПодписьИПечать = ЕстьПодписьИПечать(ОписаниеПечатнойФормы.ТабличныйДокумент);
		НоваяНастройкаПечатнойФормы.СсылкаДок = ОписаниеПечатнойФормы.СсылкаДок;
		// ++ ДИТ_Агафонов_task 25372 06.10.2022
		//Не забыть добавить на форме реквизит таблицы
		//Также добавлены кнопки сортировки (НастройкиПечатныхФормСортироватьСписокПоВозрастанию) и команда
		Если ТипЗнч(ОписаниеПечатнойФормы) = Тип("Структура") Тогда
			ОписаниеПечатнойФормы.Свойство("СсылкаДокПервоначальная",НоваяНастройкаПечатнойФормы.СсылкаДокПервоначальная);
			ОписаниеПечатнойФормы.Свойство("ЭкземпляровПредустановленное",НоваяНастройкаПечатнойФормы.КоличествоПредустановленное);
		КонецЕсли;
		// -- ДИТ_Агафонов_task 25372 06.10.2022  
		// ДИТ US 72708 ТА 72713 Сержантова А.С. Начало: 20.09.2023
		Если ТипЗнч(ОписаниеПечатнойФормы) = Тип("СтрокаТаблицыЗначений") 
			и КоллекцияПечатныхФорм.Колонки.Найти("СсылкаДокПервоначальная") <> Неопределено Тогда
			НоваяНастройкаПечатнойФормы.СсылкаДокПервоначальная = ОписаниеПечатнойФормы.СсылкаДокПервоначальная; 
		КонецЕсли;
		// ДИТ US 72708 ТА 72713 Сержантова А.С. Конец: 20.09.2023
		
//Евросиб Литвинов 20.09.21 ( #35933 #36212 #36052
		НоваяНастройкаПечатнойФормы.ИмяВременногоФайлаПечатнойФормы = ?(ПустаяСтрока(ОписаниеПечатнойФормы.ОфисныеДокументы), "", СтрЗаменить(ПолучитьИмяВременногоФайла("pdf"), КаталогВременныхФайлов(), ""));
//Евросиб Литвинов 20.09.21 ) #35933 #36212 #36052
        //ДИТ, Беляев СЮ, Ticket#0297503 / BUG 64926, 07-02-2023, начало
		НоваяНастройкаПечатнойФормы.ИмяВРЕГ = ОписаниеПечатнойФормы.ИмяВРЕГ;
        //ДИТ, Беляев СЮ, Ticket#0297503 / BUG 64926, 07-02-2023, конец
		ПечатьОфисныхДокументов = ПечатьОфисныхДокументов ИЛИ НЕ ПустаяСтрока(НоваяНастройкаПечатнойФормы.ОфисныеДокументы);
		
		РанееДобавленнаяНастройкаПечатнойФормы = ДобавленныеНастройкиПечатныхФорм[ОписаниеПечатнойФормы.ИмяМакета];
		Если РанееДобавленнаяНастройкаПечатнойФормы = Неопределено Тогда
			// Копирование табличного документа в реквизит формы.
			ИмяРеквизита = РеквизитФормы.Имя;
			ЭтотОбъект[ИмяРеквизита] = ОписаниеПечатнойФормы.ТабличныйДокумент;
			
			// Создание страниц для табличных документов.
			ИмяСтраницы = "Страница" + ИмяРеквизита;
			Страница = Элементы.Добавить(ИмяСтраницы, Тип("ГруппаФормы"), Элементы.Страницы);
			Страница.Вид = ВидГруппыФормы.Страница;
			Страница.Картинка = БиблиотекаКартинок.ТабличныйДокументВставитьРазрывСтраницы;
			Страница.Заголовок = ОписаниеПечатнойФормы.СинонимМакета;
			Страница.Подсказка = ОписаниеПечатнойФормы.СинонимМакета;
			Страница.Видимость = ЭтотОбъект[ИмяРеквизита].ВысотаТаблицы > 0;
			
			НовСтрЭФ = СписокЭФ.Добавить();
			НовСтрЭФ.ТекЭлемент = ИмяСтраницы;
			
			// Создание элементов под табличные документы.
			НовыйЭлемент = Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), Страница);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеТабличногоДокумента;
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			НовыйЭлемент.ПутьКДанным = ИмяРеквизита;
			НовыйЭлемент.Вывод = ВычислитьИспользованиеВывода(ОписаниеПечатнойФормы.ТабличныйДокумент);
			НовыйЭлемент.Редактирование = НовыйЭлемент.Вывод = ИспользованиеВывода.Разрешить И Не ОписаниеПечатнойФормы.ТабличныйДокумент.ТолькоПросмотр;
			// ШЕЙКО О.Е. (04.02.2021) В определенных ситуациях он без этого падал
			//НовыйЭлемент.Защита = ОписаниеПечатнойФормы.ТабличныйДокумент.Защита Или Не Пользователи.РолиДоступны("РедактированиеПечатныхФорм"); OLD
			// Евросиб Фролов (18.01.2022 Task №45434
			// Вообще никто не должен редактировать печатную форму
            //НовыйЭлемент.Защита = ПолучитьЗащитуТабДок(ОписаниеПечатнойФормы.ТабличныйДокумент); закомментировал
            НовыйЭлемент.Защита = Истина;
			// Евросиб Фролов)
			
			НовСтрЭФ = СписокЭФ.Добавить();
			НовСтрЭФ.ТекЭлемент = ИмяРеквизита;
			
			// Таблица настроек печатных форм (продолжение).
			НоваяНастройкаПечатнойФормы.ИмяСтраницы = ИмяСтраницы;
			НоваяНастройкаПечатнойФормы.ИмяРеквизита = ИмяРеквизита;
			
			ДобавленныеНастройкиПечатныхФорм.Вставить(НоваяНастройкаПечатнойФормы.ИмяМакета, НоваяНастройкаПечатнойФормы);
		Иначе
			НоваяНастройкаПечатнойФормы.ИмяСтраницы = РанееДобавленнаяНастройкаПечатнойФормы.ИмяСтраницы;
			НоваяНастройкаПечатнойФормы.ИмяРеквизита = РанееДобавленнаяНастройкаПечатнойФормы.ИмяРеквизита;
		КонецЕсли;
		
		НомерПечатнойФормы = НомерПечатнойФормы + 1;
	КонецЦикла;
	
	//Евросиб Каблов 23.06.2021 ( Ticket#0225310
	//Если ПечатьОфисныхДокументов И НЕ ЗначениеЗаполнено(НастройкиФорматаСохранения) Тогда
	//	НастройкиФорматаСохранения = Новый Структура("ТипФайлаТабличногоДокумента,Представление,Расширение,Фильтр")
	//КонецЕсли;
	//Евросиб Каблов 24.06.2021 )
	
КонецПроцедуры

// ШЕЙКО О.Е. (04.02.2021) В определенных ситуациях он без этого падал
&НаСервере
Функция ПолучитьЗащитуТабДок(ТабДок)
	
	Если ТипЗнч(ТабДок) = Тип("Неопределено") Тогда
	
		Защита = Истина;
	
	Иначе
	
		Защита = ТабДок.Защита Или Не Пользователи.РолиДоступны("РедактированиеПечатныхФорм");
	
	КонецЕсли; 
	
	Возврат Защита

КонецФункции // ()

&НаСервере
Процедура УдалитьСтарыеЭлементы()
	
	Для каждого ЭлементФ Из СписокЭФ Цикл
		Попытка
			Элементы.Удалить(Элементы.Найти(ЭлементФ.ТекЭлемент));
		Исключение
		КонецПопытки;
	КонецЦикла;
	СписокЭФ.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиКомплектаПоУмолчанию()
	//(Евросиб Максимова 29.03.2021 #0223231	
	Для Каждого НастройкаПечатнойФормы Из НастройкиПечатныхФорм Цикл
		Если ТипЗнч(НастройкаПечатнойФормы.СсылкаДок)=Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			НастройкаПечатнойФормы.ПозицияПоУмолчанию=2;
			НастройкаПечатнойФормы.Количество=2;
		ИначеЕсли ТипЗнч(НастройкаПечатнойФормы.СсылкаДок)=Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
			НастройкаПечатнойФормы.ПозицияПоУмолчанию=0;
		ИначеЕсли ТипЗнч(НастройкаПечатнойФормы.СсылкаДок)=Тип("ДокументСсылка.СчетФактураВыданный") Тогда
			НастройкаПечатнойФормы.ПозицияПоУмолчанию=1;
			НастройкаПечатнойФормы.Количество=2;			
		КонецЕсли;
	КонецЦикла;
	НастройкиПечатныхФорм.Сортировать("ПозицияПоУмолчанию");
	//)Евросиб Максимова 29.03.2021 #0223231	
	
	Для Каждого НастройкаПечатнойФормы Из НастройкиПечатныхФорм Цикл	
	ЗаполнитьЗначенияСвойств(НастройкиКомплектаПоУмолчанию.Добавить(), НастройкаПечатнойФормы);
    КонецЦикла;
КонецПроцедуры

//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, начало
&НаСервере
Функция ЗаблокированаОтправкаПоПочтеВПараметрахПечати()
	Результат = Ложь;
	Если ТипЗнч(Параметры.ПараметрыПечати)<>Тип("Структура") Тогда
		Возврат Результат;		             	
	КонецЕсли;
	Если Параметры.ПараметрыПечати.Свойство("БлокироватьОтправкуПоПочте") Тогда
		Результат = Истина;
	КонецЕсли;
	Возврат Результат;
КонецФункции 
//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, конец

&НаСервере
Процедура НастроитьВидимостьЭлементовФормы(Знач ЕстьРазрешенныйВывод)
	
	ЕстьРазрешенноеРедактирование = ЕстьРазрешенноеРедактирование();
	
	ДоступнаОтправкаПисем = Ложь;
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСПочтовымиСообщениями") Тогда
		МодульРаботаСПочтовымиСообщениями = ОбщегоНазначения.ОбщийМодуль("РаботаСПочтовымиСообщениями");
		ДоступнаОтправкаПисем = МодульРаботаСПочтовымиСообщениями.ДоступнаОтправкаПисем();
	КонецЕсли;
	ВозможнаОтправкаПоПочте = ЕстьРазрешенныйВывод И ДоступнаОтправкаПисем;
	
	ЕстьДанныеДляПечати = ЕстьДанныеДляПечати();
	
	Элементы.КнопкаПерейтиКДокументу.Видимость = ОбъектыПечати.Количество() > 1;
	
	Элементы.КнопкаСохранить.Видимость = ЕстьДанныеДляПечати И ЕстьРазрешенныйВывод И ЕстьРазрешенноеРедактирование;
	Элементы.КнопкаСохранитьВсеДействия.Видимость = Элементы.КнопкаСохранить.Видимость;
	
	Элементы.КнопкаОтправить.Видимость = ВозможнаОтправкаПоПочте И ЕстьДанныеДляПечати И ЕстьРазрешенноеРедактирование;
	//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, начало
	Если ЗаблокированаОтправкаПоПочтеВПараметрахПечати() Тогда
		Элементы.КнопкаОтправить.Видимость = Ложь;	  
	КонецЕсли;
	//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, конец
	Элементы.КнопкаОтправитьВсеДействия.Видимость = Элементы.КнопкаОтправить.Видимость;     
	
	Элементы.КнопкаПечатьКоманднаяПанель.Видимость = ЕстьРазрешенныйВывод И ЕстьДанныеДляПечати;
	Элементы.КнопкаПечатьВсеДействия.Видимость = Элементы.КнопкаПечатьКоманднаяПанель.Видимость;
	
	Элементы.Копий.Видимость = ЕстьРазрешенныйВывод И ЕстьДанныеДляПечати;
	Элементы.КнопкаРедактирование.Видимость = ЕстьРазрешенныйВывод И ЕстьДанныеДляПечати И ЕстьРазрешенноеРедактирование;
	
	Если Элементы.Найти("КнопкаПредварительныйПросмотр") <> Неопределено Тогда
		Элементы.КнопкаПредварительныйПросмотр.Видимость = ЕстьРазрешенныйВывод;
	КонецЕсли;
	Если Элементы.Найти("КнопкаПредварительныйПросмотрВсеДействия") <> Неопределено Тогда
		Элементы.КнопкаПредварительныйПросмотрВсеДействия.Видимость = ЕстьРазрешенныйВывод;
	КонецЕсли;
	Если Элементы.Найти("КнопкаПараметрыСтраницыВсеДействия") <> Неопределено Тогда
		Элементы.КнопкаПараметрыСтраницыВсеДействия.Видимость = ЕстьРазрешенныйВывод;
	КонецЕсли;
	
	Если Не ЕстьДанныеДляПечати Тогда
		Элементы.ТекущаяПечатнаяФорма.УстановитьДействие("ПриАктивизацииОбласти", "");
	КонецЕсли;
	
	Элементы.КнопкаПоказатьСкрытьНастройкуКомплекта.Видимость = ЭтоПечатьКомплекта();
	Элементы.НастройкиПечатныхФорм.Видимость = ЭтоПечатьКомплекта();
	
	ДоступнаНастройкаКомплекта = Истина;
	Если ТипЗнч(Параметры.ПараметрыПечати) = Тип("Структура") И Параметры.ПараметрыПечати.Свойство("ФиксированныйКомплект") Тогда
		ДоступнаНастройкаКомплекта = Не Параметры.ПараметрыПечати.ФиксированныйКомплект;
	КонецЕсли;
	
	Элементы.ГруппаНастройкаКомплектаКонтекстноеМеню.Видимость = ДоступнаНастройкаКомплекта;
	Элементы.ГруппаНастройкаКомплектаКоманднаяПанель.Видимость = ЭтоПечатьКомплекта() И ДоступнаНастройкаКомплекта;
	Элементы.НастройкиПечатныхФормПечатать.Видимость = ДоступнаНастройкаКомплекта;
	Элементы.НастройкиПечатныхФормКоличество.Видимость = ДоступнаНастройкаКомплекта;
	Элементы.НастройкиПечатныхФорм.Шапка = ДоступнаНастройкаКомплекта;
	Элементы.НастройкиПечатныхФорм.ГоризонтальныеЛинии = ДоступнаНастройкаКомплекта;
	
	Если Не ДоступнаНастройкаКомплекта Тогда
		ДобавитьКоличествоЭкземпляровВПредставленияхПечатныхФорм();
	КонецЕсли;
	
	ДоступноИзменениеМакетов = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ПользовательскиеМакетыПечати) И ЕстьРедактируемыеМакеты();
	Элементы.КнопкаИзменитьМакет.Видимость = ДоступноИзменениеМакетов И ЕстьДанныеДляПечати;
	
	Элементы.ФлажокПодписьИПечать.Видимость = ЕстьПечатныеФормыСПодписьюИПечатью() И ЕстьПодписиИПечатиДляОбъектовПечати();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКоличествоЭкземпляровВПредставленияхПечатныхФорм()
	Для Каждого НастройкаПечатнойФормы Из НастройкиПечатныхФорм Цикл
		Если НастройкаПечатнойФормы.Количество <> 1 Тогда
			НастройкаПечатнойФормы.Представление = НастройкаПечатнойФормы.Представление 
				+ " (" + НастройкаПечатнойФормы.Количество + " " + НСтр("ru = 'экз.'") + ")";
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьПризнакДоступностиВыводаВПредставленияхПечатныхФорм(ЕстьРазрешенныйВывод)
	Если ЕстьРазрешенныйВывод Тогда
		Для Каждого НастройкаПечатнойФормы Из НастройкиПечатныхФорм Цикл
			ПолеТабличногоДокумента = Элементы[НастройкаПечатнойФормы.ИмяРеквизита];
			Если ПолеТабличногоДокумента.Вывод = ИспользованиеВывода.Запретить Тогда
				НастройкаПечатнойФормы.Представление = НастройкаПечатнойФормы.Представление + " (" + НСтр("ru = 'вывод не доступен'") + ")";
			ИначеЕсли ПолеТабличногоДокумента.Защита Тогда
				НастройкаПечатнойФормы.Представление = НастройкаПечатнойФормы.Представление + " (" + НСтр("ru = 'только печать'") + ")";
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьНастройкиКоличестваКопий(Знач Видимость = Неопределено)
	Если Видимость = Неопределено Тогда
		Видимость = Не Элементы.НастройкиПечатныхФорм.Видимость;
	КонецЕсли;
	
	Элементы.НастройкиПечатныхФорм.Видимость = Видимость;
	Элементы.ГруппаНастройкаКомплектаКоманднаяПанель.Видимость = Видимость И ДоступнаНастройкаКомплекта;
КонецПроцедуры

&НаСервере
Процедура УстановитьИмяПринтераВПодсказкеКнопкиПечать()
	Если НастройкиПечатныхФорм.Количество() > 0 Тогда
		ИмяПринтера = ЭтотОбъект[НастройкиПечатныхФорм[0].ИмяРеквизита].ИмяПринтера;
		Если Не ПустаяСтрока(ИмяПринтера) Тогда
			ЭтотОбъект.Команды["Печать"].Подсказка = НСтр("ru = 'Напечатать на принтере'") + " (" + ИмяПринтера + ")";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокФормы()
	Перем ЗаголовокФормы;
	
	Если ТипЗнч(Параметры.ПараметрыПечати) = Тип("Структура") Тогда
		Параметры.ПараметрыПечати.Свойство("ЗаголовокФормы", ЗаголовокФормы);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаголовокФормы) Тогда
		Заголовок = ЗаголовокФормы;
	Иначе
		Если ЭтоПечатьКомплекта() Тогда
			Заголовок = НСтр("ru = 'Печать комплекта'");
		ИначеЕсли ТипЗнч(Параметры.ПараметрКоманды) <> Тип("Массив") Или Параметры.ПараметрКоманды.Количество() > 1 Тогда
			Заголовок = НСтр("ru = 'Печать документов'");
		Иначе
			Заголовок = НСтр("ru = 'Печать документа'");
		КонецЕсли;
		
		//ДИТ Пак И.Т. Task34787 (Ticket#0206504) 03.06.2021 Начало
		Если ЭтаФорма.ОтправкаТолькоДляФО Тогда
			Заголовок = Заголовок + " и отправка уведомления в ФО";
			Если ЗначениеЗаполнено(ЭтаФорма.ВыполняемоеДействиеНаименование) Тогда
				Заголовок = Заголовок + ": """ + ЭтаФорма.ВыполняемоеДействиеНаименование + """";
			КонецЕсли;
			
		КонецЕсли;
		//ДИТ Пак И.Т. Task34787 (Ticket#0206504) 03.06.2021 Конец
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущуюСтраницу()
	
	НастройкаПечатнойФормы = НастройкаТекущейПечатнойФормы();
	
	ТекущаяСтраница = Элементы.СтраницаПечатнаяФормаНедоступна;
	ПечатнаяФормаДоступна = НастройкаПечатнойФормы <> Неопределено И ЭтотОбъект[НастройкаПечатнойФормы.ИмяРеквизита].ВысотаТаблицы > 0;
	Если ПечатнаяФормаДоступна Тогда
		УстановитьТекущийТабличныйДокумент(НастройкаПечатнойФормы.ИмяРеквизита);
		ЗаполнитьЗначенияСвойств(Элементы.ТекущаяПечатнаяФорма, Элементы[НастройкаПечатнойФормы.ИмяРеквизита], 
			"Вывод, Защита, Редактирование");
			
		ТекущаяСтраница = Элементы.СтраницаТекущаяПечатнаяФорма;
	//Евросиб Каблов 23.06.2021 ( Ticket#0225310
	ИначеЕсли НастройкаПечатнойФормы <> Неопределено И ЗначениеЗаполнено(НастройкаПечатнойФормы.ОфисныеДокументы) Тогда
		ТекущаяСтраница = Элементы.СтраницаОфисныйДокумент;
	
		//ПолноеИмяФайла = КаталогВременныхФайлов + НастройкаПечатнойФормы.ИмяФайлаПечатнойФормы;
		//URLФайла = "file:\\" + ПолноеИмяФайла;
		//Элементы.ПолеФормыОфисногоДокумента.Документ.URL = URLФайла;
		//ПолеФормыОфисногоДокумента = ПолноеИмяФайла;
		//ИнициализироватьПолеТабличнойФормыОфисногоДокумента(НастройкаПечатнойФормы);
	//Евросиб Каблов 23.06.2021 )
	
//Евросиб Литвинов 29.06.2021 ( Ticket#0218510 #35933
		ИнициализироватьПолеТабличнойФормыОфисногоДокумента(НастройкаПечатнойФормы);
//Евросиб Литвинов 29.06.2021 ) Ticket#0218510 #35933
	
	КонецЕсли;
	Элементы.Страницы.ТекущаяСтраница = ТекущаяСтраница;
	
	ПереключитьПометкуКнопкиРедактирование();
	УстановитьДоступностьИзмененияМакета();
	УстановитьДоступностьКомандВывода();
	
//Евросиб Литвинов 10.08.21 ( #0238291 #37147
	Элементы.ГруппаКоманднаяПанель.ПодчиненныеЭлементы.ДекорацияНадписьДиадок.Видимость = ТекущаяСтраница = Элементы.СтраницаОфисныйДокумент;
//Евросиб Литвинов 10.08.21 ) #0238291 #37147
//Евросиб Литвинов 15.09.21 ( #35933 #36212 #36052
	Элементы.ГруппаКоманднаяПанель.ПодчиненныеЭлементы.КоманднаяПанельЛеваяЧасть.ПодчиненныеЭлементы.КнопкаПредварительныйПросмотр.Видимость = НЕ ТекущаяСтраница = Элементы.СтраницаОфисныйДокумент;
	Элементы.ГруппаКоманднаяПанель.ПодчиненныеЭлементы.КоманднаяПанельПраваяЧасть.ПодчиненныеЭлементы.ГруппаСохранитьОтправить.ПодчиненныеЭлементы.КнопкаОтправить.Видимость = 
		МАКС(Элементы.ГруппаКоманднаяПанель.ПодчиненныеЭлементы.КоманднаяПанельПраваяЧасть.ПодчиненныеЭлементы.ГруппаСохранитьОтправить.ПодчиненныеЭлементы.КнопкаОтправить.Видимость, ТекущаяСтраница = Элементы.СтраницаОфисныйДокумент);
	Элементы.ГруппаКоманднаяПанель.ПодчиненныеЭлементы.КоманднаяПанельПраваяЧасть.ПодчиненныеЭлементы.ГруппаСохранитьОтправить.ПодчиненныеЭлементы.КнопкаСохранить.Видимость = 
		МАКС(Элементы.ГруппаКоманднаяПанель.ПодчиненныеЭлементы.КоманднаяПанельПраваяЧасть.ПодчиненныеЭлементы.ГруппаСохранитьОтправить.ПодчиненныеЭлементы.КнопкаСохранить.Видимость, ТекущаяСтраница = Элементы.СтраницаОфисныйДокумент);
	Элементы.СтраницаОфисныйДокумент.ПодчиненныеЭлементы.ПолеФормыОфисногоДокумента.Доступность =
		МАКС(Элементы.СтраницаОфисныйДокумент.ПодчиненныеЭлементы.ПолеФормыОфисногоДокумента.Доступность, ТекущаяСтраница = Элементы.СтраницаОфисныйДокумент);
//Евросиб Литвинов 15.09.21 ) #35933 #36212 #36052
КонецПроцедуры

&НаСервере
Процедура УстановитьТекущийТабличныйДокумент(ИмяРеквизита)
	ТекущаяПечатнаяФорма = ЭтотОбъект[ИмяРеквизита];
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСнятьФлажки(Пометка)
	Для Каждого НастройкаПечатнойФормы Из НастройкиПечатныхФорм Цикл
		НастройкаПечатнойФормы.Печатать = Пометка;
		Если Пометка И НастройкаПечатнойФормы.Количество = 0 Тогда
			НастройкаПечатнойФормы.Количество = 1;
		КонецЕсли;
	КонецЦикла;
	НачатьСохранениеНастроек();
КонецПроцедуры

&НаСервере
Функция ВычислитьИспользованиеВывода(ТабличныйДокумент)
	
	// ШЕЙКО О.Е. (04.02.2021) В определенных ситуациях он без этого падал
	Если ТипЗнч(ТабличныйДокумент) = Тип("Неопределено") Тогда
	
		Возврат ИспользованиеВывода.Авто;
	
	КонецЕсли; 
	
	Если ТабличныйДокумент.Вывод = ИспользованиеВывода.Авто Тогда
		Возврат ?(ПравоДоступа("Вывод", Метаданные), ИспользованиеВывода.Разрешить, ИспользованиеВывода.Запретить);
	Иначе
		Возврат ТабличныйДокумент.Вывод;
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Процедура СохранитьНастройкиПечатныхФорм(КлючНастроек, СохраняемыеНастройкиПечатныхФорм)
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("НастройкиПечатныхФорм", КлючНастроек, СохраняемыеНастройкиПечатныхФорм);
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиПечатныхФорм(СохраненныеНастройкиПечатныхФорм = Неопределено)
	
	// ++ ДИТ_Агафонов_task 25372 10.10.2022
	Для Каждого НастройкаПечатнойФормы Из НастройкиПечатныхФорм Цикл
		Если НастройкаПечатнойФормы.КоличествоПредустановленное > 0 Тогда
			НастройкаПечатнойФормы.Количество =	НастройкаПечатнойФормы.КоличествоПредустановленное;	
		КонецЕсли;
	КонецЦикла;
	// -- ДИТ_Агафонов_task 25372 10.10.2022
	
	Если СохраненныеНастройкиПечатныхФорм = Неопределено Тогда
		СохраненныеНастройкиПечатныхФорм = НастройкиКомплектаПоУмолчанию;
	КонецЕсли;
	
	Если СохраненныеНастройкиПечатныхФорм = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СохраненнаяНастройка Из СохраненныеНастройкиПечатныхФорм Цикл
		НайденныеНастройки = НастройкиПечатныхФорм.НайтиСтроки(Новый Структура("ПозицияПоУмолчанию", СохраненнаяНастройка.ПозицияПоУмолчанию));
		Для Каждого НастройкаПечатнойФормы Из НайденныеНастройки Цикл
			ИндексСтроки = НастройкиПечатныхФорм.Индекс(НастройкаПечатнойФормы);
			НастройкиПечатныхФорм.Сдвинуть(ИндексСтроки, НастройкиПечатныхФорм.Количество()-1 - ИндексСтроки); // сдвиг в конец
			НастройкаПечатнойФормы.Количество = СохраненнаяНастройка.Количество;
			// ++ ДИТ_Агафонов_task 25372 09.10.2022
			Если НастройкаПечатнойФормы.КоличествоПредустановленное > 0 Тогда
				НастройкаПечатнойФормы.Количество =	НастройкаПечатнойФормы.КоличествоПредустановленное;	
			КонецЕсли;
			// -- ДИТ_Агафонов_task 25372 09.10.2022
			НастройкаПечатнойФормы.Печатать = НастройкаПечатнойФормы.Количество > 0;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПоместитьТабличныеДокументыВоВременноеХранилище(ПереданныеНастройки)
	Перем ЗаписьZipФайла, ИмяАрхива;
	
	НастройкиСохранения = НастройкиСохранения();
	ЗаполнитьЗначенияСвойств(НастройкиСохранения, ПереданныеНастройки);
	
	Результат = Новый Массив;
	
	// подготовка архива
	Если НастройкиСохранения.УпаковатьВАрхив Тогда
		ИмяАрхива = ПолучитьИмяВременногоФайла("zip");
		ЗаписьZipФайла = Новый ЗаписьZipФайла(ИмяАрхива);
	КонецЕсли;
	
	// подготовка временной папки
	ИмяВременнойПапки = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(ИмяВременнойПапки);
	
	ВыбранныеФорматыСохранения = НастройкиСохранения.ФорматыСохранения;
	ПереводитьИменаФайловВТранслит = НастройкиСохранения.ПереводитьИменаФайловВТранслит;
	ТаблицаФорматов = УправлениеПечатью.НастройкиФорматовСохраненияТабличногоДокумента();
	
	// ДИТ US 72708 ТА 72713 Сержантова А.С. Начало: 07.09.2023
	ВладельцыПФ = Новый Массив;
	// ДИТ US 72708 ТА 72713 Сержантова А.С. Конец: 07.09.2023
	// сохранение печатных форм
	ОбработанныеПечатныеФормы = Новый Массив;
	Для Каждого НастройкаПечатнойФормы Из НастройкиПечатныхФорм Цикл 
		
		// ДИТ US 72708 ТА 72713 Сержантова А.С. Начало: 12.09.2023
		Если ЗначениеЗаполнено(НастройкаПечатнойФормы.СсылкаДокПервоначальная) 
			и ВладельцыПФ.Найти(НастройкаПечатнойФормы.СсылкаДокПервоначальная) = Неопределено Тогда
			ВладельцыПФ.Добавить(НастройкаПечатнойФормы.СсылкаДокПервоначальная);
		КонецЕсли;
		// ДИТ US 72708 ТА 72713 Сержантова А.С. Конец: 12.09.2023
			
		//ДИТ, Беляев СЮ, Ticket#0297503 / BUG 64926, 07-02-2023, начало
		НастройкаПечатнойФормы.СписокВложений.Очистить();
		//ДИТ, Беляев СЮ, Ticket#0297503 / BUG 64926, 07-02-2023, конец
		
		Если НЕ ПустаяСтрока(НастройкаПечатнойФормы.ОфисныеДокументы) Тогда
			
			ФайлыОфисныхДокументов = ОбщегоНазначения.ЗначениеИзСтрокиXML(НастройкаПечатнойФормы.ОфисныеДокументы);
			
			Для Каждого ФайлОфисногоДокумента Из ФайлыОфисныхДокументов Цикл
				ИмяФайла = УправлениеПечатью.ИмяФайлаОфисногоДокумента(ФайлОфисногоДокумента.Значение);
				Если ЗаписьZipФайла <> Неопределено Тогда 
					ПолноеИмяФайла = УникальноеИмяФайла(ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяВременнойПапки) 
						+ ИмяФайла);
					ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФайлОфисногоДокумента.Ключ);
					ДвоичныеДанные.Записать(ПолноеИмяФайла);
					ЗаписьZipФайла.Добавить(ПолноеИмяФайла);
				Иначе
					ОписаниеФайла = Новый Структура;
					ОписаниеФайла.Вставить("Представление", ИмяФайла);
					ОписаниеФайла.Вставить("АдресВоВременномХранилище", ФайлОфисногоДокумента.Ключ);
					ОписаниеФайла.Вставить("ЭтоОфисныйДокумент", Истина); 
					// ДИТ US 72708 ТА 72713 Сержантова А.С. Начало: 07.09.2023
					ОписаниеФайла.Вставить("ВладелецПФ", НастройкаПечатнойФормы.СсылкаДокПервоначальная);	
					// ДИТ US 72708 ТА 72713 Сержантова А.С. Конец: 07.09.2023
					Результат.Добавить(ОписаниеФайла);
					//ДИТ, Беляев СЮ, Ticket#0303956, 10-03-2023, начало
					НастройкаПечатнойФормы.СписокВложений.Добавить(ОписаниеФайла);
					//ДИТ, Беляев СЮ, Ticket#0303956, 10-03-2023, конец
				КонецЕсли;
				
			КонецЦикла;
			
			Продолжить;
			
		КонецЕсли;
		
		Если Не НастройкаПечатнойФормы.Печатать Тогда
			Продолжить;
		КонецЕсли;
		
		ПечатнаяФорма = ЭтотОбъект[НастройкаПечатнойФормы.ИмяРеквизита];
		Если ОбработанныеПечатныеФормы.Найти(ПечатнаяФорма) = Неопределено Тогда
			ОбработанныеПечатныеФормы.Добавить(ПечатнаяФорма);
		Иначе
			Продолжить;
		КонецЕсли;
		
		Если ВычислитьИспользованиеВывода(ПечатнаяФорма) = ИспользованиеВывода.Запретить Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПечатнаяФорма.Защита Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПечатнаяФорма.ВысотаТаблицы = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПечатныеФормыПоОбъектам = УправлениеПечатью.ПечатныеФормыПоОбъектам(ПечатнаяФорма, ОбъектыПечати);
		Для Каждого СоответствиеОбъектаПечатнойФорме Из ПечатныеФормыПоОбъектам Цикл
			ОбъектПечати = СоответствиеОбъектаПечатнойФорме.Ключ;
			ПечатнаяФорма = СоответствиеОбъектаПечатнойФорме.Значение;
			
			Для Каждого ВыбранныйФормат Из ВыбранныеФорматыСохранения Цикл
				ТипФайла = ТипФайлаТабличногоДокумента[ВыбранныйФормат];
				НастройкиФормата = ТаблицаФорматов.НайтиСтроки(Новый Структура("ТипФайлаТабличногоДокумента", ТипФайла))[0];
				ЗаданныеИменаПечатныхФорм = ОбщегоНазначения.ЗначениеИзСтрокиXML(НастройкаПечатнойФормы.ИмяФайлаПечатнойФормы);
				
				ИмяФайла = УправлениеПечатью.ИмяФайлаПечатнойФормыОбъекта(ОбъектПечати, ЗаданныеИменаПечатныхФорм, НастройкаПечатнойФормы.Название);
				ИмяФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяФайла);
				
				Если ПереводитьИменаФайловВТранслит Тогда
					ИмяФайла = СтроковыеФункцииКлиентСервер.СтрокаЛатиницей(ИмяФайла);
				КонецЕсли;
				
				ИмяФайла = ИмяФайла + "." + НастройкиФормата.Расширение;
				
				ПолноеИмяФайла = УникальноеИмяФайла(ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяВременнойПапки) + ИмяФайла);
				ПечатнаяФорма.Записать(ПолноеИмяФайла, ТипФайла);
				
				Если ТипФайла = ТипФайлаТабличногоДокумента.HTML Тогда
					УправлениеПечатью.ВставитьКартинкиВHTML(ПолноеИмяФайла);
				КонецЕсли;
				
				Если ЗаписьZipФайла <> Неопределено Тогда 
					ЗаписьZipФайла.Добавить(ПолноеИмяФайла);
				Иначе
					ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
					ПутьВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификаторХранилища);
					ОписаниеФайла = Новый Структура;
					ОписаниеФайла.Вставить("Представление", ИмяФайла);
					ОписаниеФайла.Вставить("АдресВоВременномХранилище", ПутьВоВременномХранилище);
					ОписаниеФайла.Вставить("СсылкаДок", НастройкаПечатнойФормы.СсылкаДок);  
					// ДИТ US 72708 ТА 72713 Сержантова А.С. Начало: 07.09.2023
					ОписаниеФайла.Вставить("ВладелецПФ", НастройкаПечатнойФормы.СсылкаДокПервоначальная);	
					// ДИТ US 72708 ТА 72713 Сержантова А.С. Конец: 07.09.2023
					Если ТипФайла = ТипФайлаТабличногоДокумента.ANSITXT Тогда
						ОписаниеФайла.Вставить("Кодировка", "windows-1251");
					КонецЕсли;
					Результат.Добавить(ОписаниеФайла);
					//ДИТ, Беляев СЮ, Ticket#0297503 / BUG 64926, 07-02-2023, начало
					НастройкаПечатнойФормы.СписокВложений.Добавить(ОписаниеФайла);
					//ДИТ, Беляев СЮ, Ticket#0297503 / BUG 64926, 07-02-2023, конец-
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	// Если архив подготовлен, записываем и помещаем его во временное хранилище.
	Если ЗаписьZipФайла <> Неопределено Тогда 
		ЗаписьZipФайла.Записать();
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяАрхива);
		ПутьВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификаторХранилища);
		ОписаниеФайла = Новый Структура;
		ОписаниеФайла.Вставить("Представление", ПолучитьИмяФайлаДляАрхива(ПереводитьИменаФайловВТранслит));
		ОписаниеФайла.Вставить("АдресВоВременномХранилище", ПутьВоВременномХранилище);  
		// ДИТ US 72708 ТА 72713 Сержантова А.С. Начало: 07.09.2023
		ОписаниеФайла.Вставить("ВладелецПФ", ВладельцыПФ);
		// ДИТ US 72708 ТА 72713 Сержантова А.С. Конец: 07.09.2023
		Результат.Добавить(ОписаниеФайла);
	КонецЕсли;
	
	УдалитьФайлы(ИмяВременнойПапки);
	Если ЗначениеЗаполнено(ИмяАрхива) Тогда
		УдалитьФайлы(ИмяАрхива);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//Евросиб Каблов 23.06.2021 Ticket#0225310
&НаСервере
Функция ПоместитьОфисныеДокументыВоВременноеХранилище()
	
	Результат = Новый Массив;
	
	// сохранение печатных форм
	ОбработанныеПечатныеФормы = Новый Массив;
	Для Каждого НастройкаПечатнойФормы Из НастройкиПечатныхФорм Цикл
		
		Если НЕ ПустаяСтрока(НастройкаПечатнойФормы.ОфисныеДокументы) Тогда
			
			ФайлыОфисныхДокументов = ОбщегоНазначения.ЗначениеИзСтрокиXML(НастройкаПечатнойФормы.ОфисныеДокументы);
			
			Для Каждого ФайлОфисногоДокумента Из ФайлыОфисныхДокументов Цикл
				ИмяФайла = УправлениеПечатью.ИмяФайлаОфисногоДокумента(ФайлОфисногоДокумента.Значение);
				
				ОписаниеФайла = Новый Структура;
				ОписаниеФайла.Вставить("Представление", ИмяФайла);
				ОписаниеФайла.Вставить("АдресВоВременномХранилище", ФайлОфисногоДокумента.Ключ);
				ОписаниеФайла.Вставить("ЭтоОфисныйДокумент", Истина);
				Результат.Добавить(ОписаниеФайла);
				
				НастройкаПечатнойФормы.ИмяФайлаПечатнойФормы = ИмяФайла;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьИмяФайлаДляАрхива(ПереводитьИменаФайловВТранслит)
	
	Результат = "";
	
	Для Каждого НастройкаПечатнойФормы Из НастройкиПечатныхФорм Цикл
		
		Если Не НастройкаПечатнойФормы.Печатать Тогда
			Продолжить;
		КонецЕсли;
		
		ПечатнаяФорма = ЭтотОбъект[НастройкаПечатнойФормы.ИмяРеквизита];
		
		Если ВычислитьИспользованиеВывода(ПечатнаяФорма) = ИспользованиеВывода.Запретить Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПустаяСтрока(Результат) Тогда
			Результат = НастройкаПечатнойФормы.Название;
		Иначе
			Результат = НСтр("ru = 'Документы'");
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ПереводитьИменаФайловВТранслит Тогда
		Результат = СтроковыеФункцииКлиентСервер.СтрокаЛатиницей(Результат);
	КонецЕсли;
	
	Возврат Результат + ".zip";
	
КонецФункции

&НаКлиенте
Процедура СохранитьПечатнуюФормуВФайл()
	
	НастройкиСохранения = Новый Структура("ФорматыСохранения", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		НастройкиФорматаСохранения.ТипФайлаТабличногоДокумента));
	
	ФайлыВоВременномХранилище = ПоместитьТабличныеДокументыВоВременноеХранилище(НастройкиСохранения);
	
	Для Каждого ФайлДляЗаписи Из ФайлыВоВременномХранилище Цикл
		ФайловаяСистемаКлиент.ОткрытьФайл(ФайлДляЗаписи.АдресВоВременномХранилище, , ФайлДляЗаписи.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПечатныеФормыВПапку(СписокФайловВоВременномХранилище, Знач Папка = "")
	
	#Если ВебКлиент Тогда
		Для Каждого ФайлДляЗаписи Из СписокФайловВоВременномХранилище Цикл
			ПолучитьФайл(ФайлДляЗаписи.АдресВоВременномХранилище, ФайлДляЗаписи.Представление);
		КонецЦикла;
		Возврат;
	#КонецЕсли
	
	Папка = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(Папка);
	Для Каждого ФайлДляЗаписи Из СписокФайловВоВременномХранилище Цикл
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФайлДляЗаписи.АдресВоВременномХранилище);
		ДвоичныеДанные.Записать(УникальноеИмяФайла(Папка + ФайлДляЗаписи.Представление));
	КонецЦикла;
	
	ПоказатьОповещениеПользователя(НСтр("ru = 'Сохранение успешно завершено'"), "file:///" + Папка, НСтр("ru = 'в папку:'") + " " + Папка, БиблиотекаКартинок.Информация32);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция УникальноеИмяФайла(ИмяФайла)
	
	Файл = Новый Файл(ИмяФайла);
	ИмяБезРасширения = Файл.ИмяБезРасширения;
	Расширение = Файл.Расширение;
	Папка = Файл.Путь;
	
	Счетчик = 1;
	Пока Файл.Существует() Цикл
		Счетчик = Счетчик + 1;
		Файл = Новый Файл(Папка + ИмяБезРасширения + " (" + Счетчик + ")" + Расширение);
	КонецЦикла;
	
	Возврат Файл.ПолноеИмя;

КонецФункции

&НаСервере
Функция ПрисоединитьПечатныеФормыКОбъекту(ФайлыВоВременномХранилище, ОбъектДляПрисоединения)
	Результат = Новый Массив;
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайлами = ОбщегоНазначения.ОбщийМодуль("РаботаСФайлами");
		Для Каждого Файл Из ФайлыВоВременномХранилище Цикл
			ПараметрыФайла = Новый Структура;
			ПараметрыФайла.Вставить("ВладелецФайлов", ОбъектДляПрисоединения);
			ПараметрыФайла.Вставить("Автор", Неопределено);
			ПараметрыФайла.Вставить("ИмяБезРасширения", Файл.Представление);
			ПараметрыФайла.Вставить("РасширениеБезТочки", Неопределено);
			ПараметрыФайла.Вставить("ВремяИзменения", Неопределено);
			ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", Неопределено);
			Результат.Добавить(МодульРаботаСФайлами.ДобавитьФайл(
				ПараметрыФайла, Файл.АдресВоВременномХранилище, , НСтр("ru = 'Печатная форма'")));
		КонецЦикла;
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаСервере
Функция ЭтоПечатьКомплекта()
	Возврат НастройкиПечатныхФорм.Количество() > 1;
КонецФункции

&НаСервере
Функция ЕстьРазрешенныйВывод()
	
	Для Каждого НастройкаПечатнойФормы Из НастройкиПечатныхФорм Цикл
		Если Элементы[НастройкаПечатнойФормы.ИмяРеквизита].Вывод = ИспользованиеВывода.Разрешить Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ЕстьРазрешенноеРедактирование()
	
	// Евросиб Фролов (18.01.2022 Task №45434
	// Т.к. теперь вообще никто не должен редактировать печатную форму,
	// то всегда взвращаем "Истина", чтобы была доступна кнопка отправки по почте.
	Возврат Истина;
	// Евросиб Фролов)
	
	Для Каждого НастройкаПечатнойФормы Из НастройкиПечатныхФорм Цикл
		Если Элементы[НастройкаПечатнойФормы.ИмяРеквизита].Защита = Ложь Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция ПолучателейБольшеОдного(Получатель)
	Если ТипЗнч(Получатель) = Тип("Массив") Или ТипЗнч(Получатель) = Тип("СписокЗначений") Тогда
		Возврат Получатель.Количество() > 1;
	Иначе
		Возврат ОбщегоНазначенияКлиентСервер.АдресаЭлектроннойПочтыИзСтроки(Получатель).Количество() > 1;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ЕстьДанныеДляПечати()
	Результат = Ложь;
	Для Каждого НастройкаПечатнойФормы Из НастройкиПечатныхФорм Цикл
		Результат = Результат Или ЭтотОбъект[НастройкаПечатнойФормы.ИмяРеквизита].ВысотаТаблицы > 0;
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаСервере
Функция ЕстьРедактируемыеМакеты()
	Результат = Ложь;
	Для Каждого НастройкаПечатнойФормы Из НастройкиПечатныхФорм Цикл
		Результат = Результат Или Не ПустаяСтрока(НастройкаПечатнойФормы.ПутьКМакету);
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаСервере
Функция ЕстьПечатныеФормыСПодписьюИПечатью()
	Результат = Ложь;
	Для Каждого НастройкаПечатнойФормы Из НастройкиПечатныхФорм Цикл
		Результат = Результат Или НастройкаПечатнойФормы.ПодписьИПечать;
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаСервере
Функция ЕстьПодписиИПечатиДляОбъектовПечати()
	
	Результат = Ложь;
	
	ПодписиИПечатиОбъектов = УправлениеПечатью.ПодписиИПечатиОбъектов(ОбъектыПечати);
	Для Каждого ПодписиИПечатиОбъекта Из ПодписиИПечатиОбъектов Цикл
		КоллекцияПодписейИПечатей = ПодписиИПечатиОбъекта.Значение;
		Для Каждого ПодписьПечать Из КоллекцияПодписейИПечатей Цикл
			Картинка = ПодписьПечать.Значение;
			Если Картинка.Вид <> ВидКартинки.Пустая Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьМакетДляРедактирования()
	
	НастройкаПечатнойФормы = НастройкаТекущейПечатнойФормы();
	
	ОтобразитьСостояниеТекущейПечатнойФормы(НСтр("ru = 'Макет редактируется'"));
	
	ИмяОбъектаМетаданныхМакета = НастройкаПечатнойФормы.ПутьКМакету;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ИмяОбъектаМетаданныхМакета", ИмяОбъектаМетаданныхМакета);
	ПараметрыОткрытия.Вставить("РежимОткрытияОкна", РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ПараметрыОткрытия.Вставить("ИмяДокумента", НастройкаПечатнойФормы.Представление);
	ПараметрыОткрытия.Вставить("ТипМакета", "MXL");
	ПараметрыОткрытия.Вставить("Редактирование", Истина);
	
	ОткрытьФорму("ОбщаяФорма.РедактированиеТабличногоДокумента", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьСостояниеТекущейПечатнойФормы(ТекстСостояния = "")
	
	ОтображатьСостояние = Не ПустаяСтрока(ТекстСостояния);
	
	ПолеТабличногоДокумента = Элементы.ТекущаяПечатнаяФорма;
	
	ОтображениеСостояния = ПолеТабличногоДокумента.ОтображениеСостояния;
	ОтображениеСостояния.Текст = ТекстСостояния;
	ОтображениеСостояния.Видимость = ОтображатьСостояние;
	ОтображениеСостояния.ДополнительныйРежимОтображения = 
		?(ОтображатьСостояние, ДополнительныйРежимОтображения.Неактуальность, ДополнительныйРежимОтображения.НеИспользовать);
		
	ПолеТабличногоДокумента.ТолькоПросмотр = ОтображатьСостояние Или ПолеТабличногоДокумента.Вывод = ИспользованиеВывода.Запретить;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьРедактированиеТекущейПечатнойФормы()
	НастройкаПечатнойФормы = НастройкаТекущейПечатнойФормы();
	Если НастройкаПечатнойФормы <> Неопределено Тогда
		ПолеТабличногоДокумента = Элементы[НастройкаПечатнойФормы.ИмяРеквизита];
		ПолеТабличногоДокумента.Редактирование = Не ПолеТабличногоДокумента.Редактирование;
		Элементы.ТекущаяПечатнаяФорма.Редактирование = ПолеТабличногоДокумента.Редактирование;
		ПереключитьПометкуКнопкиРедактирование();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьПометкуКнопкиРедактирование()
	
	ПечатнаяФормаДоступна = Элементы.Страницы.ТекущаяСтраница <> Элементы.СтраницаПечатнаяФормаНедоступна;
	
	РедактированиеВозможно = Ложь;
	Пометка = Ложь;
	
	НастройкаПечатнойФормы = НастройкаТекущейПечатнойФормы();
	Если НастройкаПечатнойФормы <> Неопределено Тогда
		ПолеТабличногоДокумента = Элементы[НастройкаПечатнойФормы.ИмяРеквизита];
		РедактированиеВозможно = ПечатнаяФормаДоступна И Не ПолеТабличногоДокумента.Защита;
		Пометка = ПолеТабличногоДокумента.Редактирование И РедактированиеВозможно;
	КонецЕсли;
	
	Элементы.КнопкаРедактирование.Пометка = Пометка;
	Элементы.КнопкаРедактирование.Доступность = РедактированиеВозможно;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьИзмененияМакета()
	ПечатнаяФормаДоступна = Элементы.Страницы.ТекущаяСтраница <> Элементы.СтраницаПечатнаяФормаНедоступна;
	НастройкаПечатнойФормы = НастройкаТекущейПечатнойФормы();
	Элементы.КнопкаИзменитьМакет.Доступность = ПечатнаяФормаДоступна И Не ПустаяСтрока(НастройкаПечатнойФормы.ПутьКМакету);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКомандВывода()
	
	НастройкаПечатнойФормы = НастройкаТекущейПечатнойФормы();
	ПолеТабличногоДокумента = Элементы[НастройкаПечатнойФормы.ИмяРеквизита];
	ПечатнаяФормаДоступна = Элементы.Страницы.ТекущаяСтраница <> Элементы.СтраницаПечатнаяФормаНедоступна;
	
	МожноПечатать = ПечатнаяФормаДоступна И ПолеТабличногоДокумента.Вывод = ИспользованиеВывода.Разрешить;
	
	Если Элементы.Найти("КнопкаПредварительныйПросмотр") <> Неопределено Тогда
		Элементы.ПолеФормыОфисногоДокумента.Доступность = МожноПечатать;
	КонецЕсли;
	Если Элементы.Найти("КнопкаПредварительныйПросмотрВсеДействия") <> Неопределено Тогда
		Элементы.КнопкаПредварительныйПросмотрВсеДействия.Доступность = МожноПечатать;
	КонецЕсли;
	Если Элементы.Найти("КнопкаПараметрыСтраницыВсеДействия") <> Неопределено Тогда
		Элементы.КнопкаПараметрыСтраницыВсеДействия.Доступность = МожноПечатать;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекущуюПечатнуюФорму()
	
	НастройкаПечатнойФормы = НастройкаТекущейПечатнойФормы();
	Если НастройкаПечатнойФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПереформироватьПечатнуюФорму(НастройкаПечатнойФормы.ИмяМакета, НастройкаПечатнойФормы.ИмяРеквизита);
	ОтобразитьСостояниеТекущейПечатнойФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПереформироватьПечатнуюФорму(ИмяМакета, ИмяРеквизита)
	
	Отказ = Ложь;
	КоллекцияПечатныхФорм = СформироватьПечатныеФормы(ИмяМакета, Отказ);
	Если Отказ Тогда
		ВызватьИсключение НСтр("ru = 'Печатная форма не была переформирована.'");
	КонецЕсли;
	
	Для Каждого ПечатнаяФорма Из КоллекцияПечатныхФорм Цикл
		Если ПечатнаяФорма.ИмяМакета = ИмяМакета Тогда
			ЭтотОбъект[ИмяРеквизита] = ПечатнаяФорма.ТабличныйДокумент;
		КонецЕсли;
	КонецЦикла;
	
	УстановитьТекущийТабличныйДокумент(ИмяРеквизита);
	
КонецПроцедуры

&НаКлиенте
Функция НастройкаТекущейПечатнойФормы()
	Возврат УправлениеПечатьюКлиент.НастройкаТекущейПечатнойФормы(ЭтотОбъект);
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьМакет(ИмяОбъектаМетаданныхМакета, АдресМакетаВоВременномХранилище)
	УправлениеПечатью.ЗаписатьМакет(ИмяОбъектаМетаданныхМакета, АдресМакетаВоВременномХранилище);
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКДокументуЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолеТабличногоДокумента = Элементы.ТекущаяПечатнаяФорма;
	ТабличныйДокумент = ТекущаяПечатнаяФорма;
	ОбластьВыбранногоДокумента = ТабличныйДокумент.Области.Найти(ВыбранныйЭлемент.Значение);
	
	ПолеТабличногоДокумента.ТекущаяОбласть = ТабличныйДокумент.Область("R1C1"); // переход к началу
	
	Если ОбластьВыбранногоДокумента <> Неопределено Тогда
		ПолеТабличногоДокумента.ТекущаяОбласть = ТабличныйДокумент.Область(ОбластьВыбранногоДокумента.Верх,,ОбластьВыбранногоДокумента.Низ,);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПечатныеФормыПоПочте()
	
	//ДИТ Пак И.Т. Task34787 (Ticket#0206504) 03.06.2021 Начало
	ЭтаФорма.ОбязательнаяОтправка = Ложь;
	//ДИТ Пак И.Т. Task34787 (Ticket#0206504) 03.06.2021 Конец
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьПечатныеФормыПоПочтеНастройкаУчетнойЗаписиПредложена", ЭтотОбъект);
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСПочтовымиСообщениями") Тогда
		МодульРаботаСПочтовымиСообщениямиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСПочтовымиСообщениямиКлиент");
		МодульРаботаСПочтовымиСообщениямиКлиент.ПроверитьНаличиеУчетнойЗаписиДляОтправкиПочты(ОписаниеОповещения);
	КонецЕсли;
КонецПроцедуры

////ДИТ, Беляев СЮ, Ticket#0297503 / BUG 64926, 07-02-2023, начало
//&НаСервере
//Процедура УстановитьКолонкуНастройкиТекущегоМакета(НовСтрТЗ, СтрМенеджераКлиента, ИмяМакетаВРЕГ, ТаблицаСоответствияМакетаРеквизиту, текПечатаяФорма)
//
//	НайденнаяСтрокаТаблицы = ТаблицаСоответствияМакетаРеквизиту.Найти(ИмяМакетаВРЕГ, "ИмяМакета");
//	Если НайденнаяСтрокаТаблицы <> Неопределено Тогда
//		НовСтрТЗ[НайденнаяСтрокаТаблицы.ИмяКолонкиВТаблицеРасчетаВариантов] = СтрМенеджераКлиента[НайденнаяСтрокаТаблицы.ИмяРеквизита];
//		текПечатаяФорма.ИмяВРЕГ = НайденнаяСтрокаТаблицы.ИмяКолонкиВТаблицеРасчетаВариантов;
//	КонецЕсли;
//	
//КонецПроцедуры
////ДИТ, Беляев СЮ, Ticket#0297503 / BUG 64926, 07-02-2023, конец	

//ДИТ, Беляев СЮ, Ticket#0303956, 10-03-2023, начало
&НаСервере
Процедура УстановитьКолонкуНастройкиТекущегоМакета(НовСтрТЗ, СтрМенеджераКлиента, ИмяМакетаВРЕГ, ЗапросСТаблицейСоответствияМакетаРеквизиту, текПечатаяФорма)
	
	ЗапросСТаблицейСоответствияМакетаРеквизиту.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТ_ТаблицаСоответствияМакетаРеквизиту.ИмяМакета КАК ИмяМакета,
		|	ВТ_ТаблицаСоответствияМакетаРеквизиту.ИмяКолонкиВТаблицеРасчетаВариантов КАК ИмяКолонкиВТаблицеРасчетаВариантов,
		|	ВТ_ТаблицаСоответствияМакетаРеквизиту.ИмяРеквизита КАК ИмяРеквизита
		|ИЗ
		|	ВТ_ТаблицаСоответствияМакетаРеквизиту КАК ВТ_ТаблицаСоответствияМакетаРеквизиту
		|ГДЕ
		|	&ИмяМакетаВРЕГ ПОДОБНО ВТ_ТаблицаСоответствияМакетаРеквизиту.ИмяМакета";
	ЗапросСТаблицейСоответствияМакетаРеквизиту.УстановитьПараметр("ИмяМакетаВРЕГ", Лев(СокрЛП(ИмяМакетаВРЕГ),100));
	РезультатЗапроса = ЗапросСТаблицейСоответствияМакетаРеквизиту.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		НовСтрТЗ[Выборка.ИмяКолонкиВТаблицеРасчетаВариантов] = СтрМенеджераКлиента[Выборка.ИмяРеквизита];
		текПечатаяФорма.ИмяВРЕГ = Выборка.ИмяКолонкиВТаблицеРасчетаВариантов;
	КонецЕсли;
	
КонецПроцедуры
//ДИТ, Беляев СЮ, Ticket#0303956, 10-03-2023, начало

//ДИТ, Беляев СЮ, Ticket#0297503 / BUG 64926, 07-02-2023, начало (алгоритм перенесен из функции ПараметрыОтправкиПисьма() )
&НаСервере
Процедура ПерезаполнитьПредставлениеВложений(СписокВложений)
	// Контроль уникальности имен.
	ШаблонИмениФайла = "%1%2.%3";
	ИспользованныеИменаФайлов = Новый Соответствие;
	Для Каждого Вложение Из СписокВложений Цикл
		Если СтрНайти(Вложение.Представление, "Реестр") > 0  Тогда
			СписокВложений.Удалить(СписокВложений.Найти(Вложение));
		КонецЕсли; 
		ИмяФайла = Вложение.Представление;
		НомерИспользования = ?(ИспользованныеИменаФайлов[ИмяФайла] <> Неопределено,
			ИспользованныеИменаФайлов[ИмяФайла] + 1, 1);
		ИспользованныеИменаФайлов.Вставить(ИмяФайла, НомерИспользования);
		Если НомерИспользования > 1 Тогда
			Файл = Новый Файл(ИмяФайла);
			ИмяФайла = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонИмениФайла,
				Файл.ИмяБезРасширения, " (" + НомерИспользования + ")", Файл.Расширение);
		КонецЕсли;
		Вложение.Представление = ИмяФайла;
	КонецЦикла;
КонецПроцедуры // ПерезаполнитьПредставлениеВложений()
//ДИТ, Беляев СЮ, Ticket#0297503 / BUG 64926, 07-02-2023, конец

&НаСервере
Функция ПараметрыОтправкиПисьма(ВыбранныеПараметры)
	
	//СписокВложений = ПоместитьТабличныеДокументыВоВременноеХранилище(ВыбранныеПараметры);
	
	//// Контроль уникальности имен.
	//ШаблонИмениФайла = "%1%2.%3";
	//ИспользованныеИменаФайлов = Новый Соответствие;
	//Для Каждого Вложение Из СписокВложений Цикл
	//	Если СтрНайти(Вложение.Представление, "Реестр") > 0  Тогда
	//		СписокВложений.Удалить(СписокВложений.Найти(Вложение));
	//	КонецЕсли; 
	//	ИмяФайла = Вложение.Представление;
	//	НомерИспользования = ?(ИспользованныеИменаФайлов[ИмяФайла] <> Неопределено,
	//		ИспользованныеИменаФайлов[ИмяФайла] + 1, 1);
	//	ИспользованныеИменаФайлов.Вставить(ИмяФайла, НомерИспользования);
	//	Если НомерИспользования > 1 Тогда
	//		Файл = Новый Файл(ИмяФайла);
	//		ИмяФайла = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонИмениФайла,
	//			Файл.ИмяБезРасширения, " (" + НомерИспользования + ")", Файл.Расширение);
	//	КонецЕсли;
	//	Вложение.Представление = ИмяФайла;
	//КонецЦикла;
	//Получатели = ПараметрыВывода.ПараметрыОтправки.Получатель;
	//Если ВыбранныеПараметры.Свойство("Получатели") Тогда
	//	Получатели = ВыбранныеПараметры.Получатели;
	//КонецЕсли;
	
	//ДИТ, Беляев СЮ, Ticket#0297503 / BUG 64926, 07-02-2023, начало
	СписокВсехВложений = ПоместитьТабличныеДокументыВоВременноеХранилище(ВыбранныеПараметры);
	ПерезаполнитьПредставлениеВложений(СписокВсехВложений);

	МассивПисем = Новый Массив;
	ТаблицаПисем = Новый ТаблицаЗначений;
	ТаблицаПисем.Колонки.Добавить("Получатели");
	ТаблицаПисем.Колонки.Добавить("МассивВложений");
	//ДИТ, Беляев СЮ, Ticket#0297503 / BUG 64926, 07-02-2023, конец
	
	////////////////////////////// 10.04.20
	//  заполнение получателей письма по контактам контрагента
	Если НЕ Параметры.ПараметрКоманды = Неопределено И
		ТипЗнч(Параметры.ПараметрКоманды) = Тип("Массив") И
		НЕ Параметры.ПараметрКоманды.Количество() = 0
		// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
		И ТипЗнч(Параметры.ПараметрКоманды[0]) <> Тип("ДокументСсылка.РелизКлиента") Тогда
		// Евросиб Фролов)
		
		ПолучателиПисьмаКонтрагент = Новый СписокЗначений;
		// получаем первое значение массива, т.к. письма отправляются одному контрагенту.
		// берем из него данные по менеджерам и наличию у них флагов для отправки писем
		// Евросиб US 90342 Рыбьяков К.А. 10.03.2026 ((
		Если ТипЗнч(Параметры.ПараметрКоманды[0]) = Тип("ДокументСсылка.РеестрСпециальныхСтавок") Тогда
			КонтрагентыПолучатели = Параметры.ПараметрыПечати.ДополнительныеПараметры.ВыбранныеКонтрагенты.ВыгрузитьЗначения();
			СкопироватьТабличнуюЧасть = Истина;
			Для Каждого КонтрагентПолучатель Из КонтрагентыПолучатели Цикл
				Если СкопироватьТабличнуюЧасть Тогда
					КонтрагентКЛ = КонтрагентПолучатель.ТабМенеджеры.ВыгрузитьКолонки();
					СкопироватьТабличнуюЧасть = Ложь;
				КонецЕсли;
				Для Каждого ДанныеМенеджера Из КонтрагентПолучатель.ТабМенеджеры Цикл
					ЗаполнитьЗначенияСвойств(КонтрагентКЛ.Добавить(), ДанныеМенеджера);
				КонецЦикла;
			КонецЦикла;
		Иначе
			КонтрагентПолучатель = Параметры.ПараметрКоманды[0].Контрагент;
			КонтрагентКЛ = КонтрагентПолучатель.ТабМенеджеры;
		КонецЕсли;
		//КонтрагентПолучатель = Параметры.ПараметрКоманды[0].Контрагент;
		//КонтрагентКЛ = КонтрагентПолучатель.ТабМенеджеры;
		// Евросиб Рыбьяков К.А. 10.03.2026 ))
		
		СписокПолучателейКонтрагента = Новый СписокЗначений;
		
        #Область СтарыйАлгоритмОпределенияСпискаПолучателей		
		//// если идет отправка однотипных документов, то проверяем возможность отправки всех вложений одному контакту
		//ОднотипныеДокументы = Истина;
		//ПараметрыОтбора = новый Структура;
		//ПараметрыОтбора.Вставить("Печатать",Истина);
		//НайденныеСтр = НастройкиПечатныхФорм.НайтиСтроки(ПараметрыОтбора);
		//// коммерческое предложение здесь не проверяем, т.к. оно не печатается из групповой печати
		//Если НайденныеСтр.Количество()>1 Тогда
		//	ПервыйДок = НайденныеСтр[0].ИмяМакета;
		//	Если НЕ СтрНайти(Врег(ПервыйДок), "СЧЕТЗАКАЗ") = 0 Тогда
		//		ПервыйДок = "СЧЕТЗАКАЗ";
		//	ИначеЕсли НЕ СтрНайти(Врег(ПервыйДок), "СЧЕТНАОПЛАТУАНГЛ") = 0 Тогда
		//		ПервыйДок = "СЧЕТНАОПЛАТУАНГЛ";
		//	ИначеЕсли НЕ СтрНайти(Врег(ПервыйДок), "АКТСДАЧИПРИЕМКИ") = 0 Тогда
		//		ПервыйДок = "АКТСДАЧИПРИЕМКИ";
		//	ИначеЕсли НЕ СтрНайти(Врег(ПервыйДок), "ОТЧЕТАГЕНТА") = 0 Тогда
		//		ПервыйДок = "ОТЧЕТАГЕНТА";
		//	ИначеЕсли НЕ СтрНайти(Врег(ПервыйДок), "КОРРАКТСДАЧИПРИЕМКИ") = 0 Тогда
		//		ПервыйДок = "КОРРАКТСДАЧИПРИЕМКИ";
		//	ИначеЕсли НЕ СтрНайти(Врег(ПервыйДок), "СЧЕТФАКТУРА981") = 0 Тогда
		//		ПервыйДок = "СЧЕТФАКТУРА981";
		//	ИначеЕсли СтрНайти(Врег(ПервыйДок), "ПСЦ_ОДНОЯЗЫЧНЫЙ2") <> 0 ИЛИ СтрНайти(Врег(ПервыйДок), "ПСЦ_ОДНОЯЗЫЧНЫЙУНИВЕРСАЛЬНЫЙФАКСИМИЛЕ") <> 0 Тогда
		//		ПервыйДок = "ПСЦ_ОДНОЯЗЫЧНЫЙ2";
		//	КонецЕсли;
		//КонецЕсли;
		//// если нашли хотя бы один макет с другим наименованием - это не однотипный список
		//Для Каждого Стр Из НайденныеСтр Цикл
		//	Если СтрНайти(Врег(Стр.ИмяМакета), ПервыйДок) = 0 Тогда
		//		ОднотипныеДокументы = Ложь;
		//		Прервать;
		//	КонецЕсли;
		//КонецЦикла;
		//
		//Для Каждого Стр Из КонтрагентКЛ Цикл
		//	Если НЕ ЗначениеЗаполнено(Стр.EMail) Тогда
		//		Продолжить;
		//	КонецЕсли;
		//	
		//	ПроверкаВыполненена = Ложь;
		//	
		//	// если отправляем комплект документов, то должен быть установлен хотя бы 1 флаг
		//	Если СписокВложений.Количество()>1 И ОднотипныеДокументы = Ложь Тогда
		//		Если Стр.КонтактДляПСЦ ИЛИ
		//			Стр.КонтактДляСчетаКлиенту ИЛИ
		//			Стр.КонтактДляРеализации ИЛИ
		//			Стр.КонтактДляСФВ ИЛИ
		//			Стр.КонтактДляКоррРеализации ИЛИ
		//			Стр.КонтактДляКоммерчПредложения ИЛИ
		//			Стр.КонтактДляОтчетаКомитенту ТОгда
		//			
		//			ПроверкаВыполненена = Истина;
		//			
		//		КонецЕсли;
		//	ИначеЕсли СписокВложений.Количество() = 1 ИЛИ 
		//		(СписокВложений.Количество() > 1 И ОднотипныеДокументы = Истина) Тогда
		//		
		//		ПараметрыОтбора = новый Структура;
		//		ПараметрыОтбора.Вставить("Печатать",Истина);
		//		НайденныеСтр = НастройкиПечатныхФорм.НайтиСтроки(ПараметрыОтбора);
		//		Если НайденныеСтр.Количество()>0 Тогда
		//			ДокДляОтправки = НайденныеСтр[0].ИмяМакета;
		//			Если НЕ СтрНайти(Врег(ДокДляОтправки), "СЧЕТЗАКАЗ") = 0 ИЛИ НЕ СтрНайти(Врег(ДокДляОтправки), "СЧЕТНАОПЛАТУАНГЛ") = 0 Тогда
		//				ПроверкаВыполненена = Стр.КонтактДляСчетаКлиенту;
		//			ИначеЕсли НЕ СтрНайти(Врег(ДокДляОтправки), "АКТСДАЧИПРИЕМКИ") = 0 Тогда
		//				ПроверкаВыполненена = Стр.КонтактДляРеализации;
		//			ИначеЕсли НЕ СтрНайти(Врег(ДокДляОтправки), "ОТЧЕТАГЕНТА") = 0 Тогда
		//				ПроверкаВыполненена = Стр.КонтактДляОтчетаКомитенту;
		//			ИначеЕсли НЕ СтрНайти(Врег(ДокДляОтправки), "КОРРАКТСДАЧИПРИЕМКИ") = 0 Тогда
		//				ПроверкаВыполненена = Стр.КонтактДляКоррРеализации;
		//			ИначеЕсли НЕ СтрНайти(Врег(ДокДляОтправки), "СЧЕТФАКТУРА981") = 0 Тогда
		//				ПроверкаВыполненена = Стр.КонтактДляСФВ;
		//			ИначеЕсли СтрНайти(Врег(ДокДляОтправки), "ПСЦ_ОДНОЯЗЫЧНЫЙ2") <> 0 ИЛИ СтрНайти(Врег(ДокДляОтправки), "ПСЦ_ОДНОЯЗЫЧНЫЙУНИВЕРСАЛЬНЫЙФАКСИМИЛЕ") <> 0 Тогда
		//				ПроверкаВыполненена = Стр.КонтактДляПСЦ;
		//			ИначеЕсли НЕ СтрНайти(Врег(ДокДляОтправки), "КП") = 0 Тогда
		//				ПроверкаВыполненена = Стр.КонтактДляКоммерчПредложения;
		//			КонецЕсли;
		//		КонецЕсли;
		//	КонецЕсли;
		//	
		//	//++ Зубов 0240539 20.08.2021
		//	Если  ИмяФайла = "Документы.zip" Тогда
		//		ПроверкаВыполненена = Истина;
		//	КонецЕсли;
		//	//++ Зубов 0240539 20.08.2021
		//	
		//	// если нашли контакт у контрагента, которому нужно отправлять данный вид документа, отправляем ему.
		//	// если не нашли, отправляем контрагенту в целом (почта, указанная в шапке)
		//	Если ПроверкаВыполненена Тогда
		//		
		//		ТекПолучатель = СТрока(Стр.Фамилия) + " " + СТрока(Стр.Имя) + " " + СТрока(Стр.Отчество) + " <"  + СокрЛП(Стр.EMail) + ">";
		//		// проверяем уникальность
		//		Если СписокПолучателейКонтрагента.НайтиПоЗначению(ТекПолучатель) = Неопределено Тогда
		//			СписокПолучателейКонтрагента.Добавить(ТекПолучатель);
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЦикла;
		
		//Если СписокПолучателейКонтрагента.Количество() = 0 Тогда
		//	// заполняем список по умолчанию данными из контрагента 
		//	// (на тот случай, если таблица контактных лиц пуста или если никто из них не подошел)
		//	ТЧКонтакты = КонтрагентПолучатель.КонтактнаяИнформация;
		//	Параметрыотбора = НОвый Структура;
		//	Параметрыотбора.Вставить("Тип",Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		//	НайденнаяПочта = ТЧКонтакты.НайтиСтроки(Параметрыотбора);
		//	Для Каждого Адр Из НайденнаяПочта Цикл
		//		ТекПолучатель = СТрока(Адр.Представление);
		//		// проверяем уникальность
		//		Если СписокПолучателейКонтрагента.НайтиПоЗначению(ТекПолучатель) = Неопределено Тогда
		//			СписокПолучателейКонтрагента.Добавить(ТекПолучатель);
		//		КонецЕсли;
		//		
		//	КонецЦикла;
		//КонецЕсли;
		//
		//Получатели = СписокПолучателейКонтрагента;
#КонецОбласти		
		
		//ДИТ, Беляев СЮ, Ticket#0297503 / BUG 64926, 07-02-2023, начало
		ТаблицаРасчетаВариантовПисем = Новый ТаблицаЗначений;
		ТаблицаРасчетаВариантовПисем.Колонки.Добавить("EMail", Новый ОписаниеТипов("Строка"));
		ТаблицаРасчетаВариантовПисем.Колонки.Добавить("ФИО", Новый ОписаниеТипов("Строка"));
		ТаблицаРасчетаВариантовПисем.Колонки.Добавить("КлючКомбинацииДокументов", Новый ОписаниеТипов("Строка"));
		ТаблицаРасчетаВариантовПисем.Колонки.Добавить("СЧЕТЗАКАЗ", Новый ОписаниеТипов("Число"));
		ТаблицаРасчетаВариантовПисем.Колонки.Добавить("АКТСДАЧИПРИЕМКИ", Новый ОписаниеТипов("Число"));
		ТаблицаРасчетаВариантовПисем.Колонки.Добавить("ОТЧЕТАГЕНТА", Новый ОписаниеТипов("Число"));
		ТаблицаРасчетаВариантовПисем.Колонки.Добавить("КОРРАКТСДАЧИПРИЕМКИ", Новый ОписаниеТипов("Число"));
		ТаблицаРасчетаВариантовПисем.Колонки.Добавить("СЧЕТФАКТУРА981", Новый ОписаниеТипов("Число"));
		ТаблицаРасчетаВариантовПисем.Колонки.Добавить("ПСЦ_ОДНОЯЗЫЧНЫЙ2", Новый ОписаниеТипов("Число"));
		ТаблицаРасчетаВариантовПисем.Колонки.Добавить("КП", Новый ОписаниеТипов("Число"));
		// Евросиб US 90342 Рыбьяков К.А. 10.03.2026 ((
		ТаблицаРасчетаВариантовПисем.Колонки.Добавить("СПЕЦИАЛЬНОЕПРЕДЛОЖЕНИЕ", Новый ОписаниеТипов("Число"));
		// Евросиб Рыбьяков К.А. 10.03.2026 ))
		
		СоответствиеEMailИФИО = Новый Соответствие; //на случай дублей адресов с разными ФИО
		//ТаблицаСоответствияМакетаРеквизиту = ПолучитьТаблицуСоответствияМакетаРеквизиту();
		//ДИТ, Беляев СЮ, Ticket#0303956, 10-03-2023, начало
		ЗапросСТаблицейСоответствияМакетаРеквизиту = ПолучитьЗапросСТаблицейСоответствияМакетаРеквизиту();
		//ДИТ, Беляев СЮ, Ticket#0303956, 10-03-2023, конец
				
		ПараметрыОтбора = новый Структура;
		ПараметрыОтбора.Вставить("Печатать",Истина);
		НайденныеСтр = НастройкиПечатныхФорм.НайтиСтроки(ПараметрыОтбора);
		
		//ЗАПОЛНЕНИЕ ТАБЛИЦЫ РАСЧЕТА С УЧЕТОМ НАСТРОЕК В ТЧ "ТабМенеджеры" И ПЕЧАТНЫХ ФОРМ ДЛЯ ОТПРАВКИ
		Для Каждого Стр Из КонтрагентКЛ Цикл
			Если НЕ ЗначениеЗаполнено(Стр.EMail) Тогда
				Продолжить;
			КонецЕсли;
			
			СоответствиеEMailИФИО.Вставить(Стр.EMail, стрШаблон("%1 %2 %3" ,СокрЛП(Стр.Фамилия),СокрЛП(Стр.Имя),СокрЛП(Стр.Отчество)));
			Для Каждого текПечатаяФорма Из НайденныеСтр Цикл	
				ИмяМакетаВРЕГ = Врег(текПечатаяФорма.ИмяВРЕГ);
				НовСтрТЗ = ТаблицаРасчетаВариантовПисем.Добавить();
				НовСтрТЗ.EMail = Стр.EMail;
				//УстановитьКолонкуНастройкиТекущегоМакета(НовСтрТЗ, Стр, ИмяМакетаВРЕГ, ТаблицаСоответствияМакетаРеквизиту, текПечатаяФорма);
				//ДИТ, Беляев СЮ, Ticket#0303956, 10-03-2023, начало
				УстановитьКолонкуНастройкиТекущегоМакета(НовСтрТЗ, Стр, ИмяМакетаВРЕГ, ЗапросСТаблицейСоответствияМакетаРеквизиту, текПечатаяФорма);
				//ДИТ, Беляев СЮ, Ticket#0303956, 10-03-2023, конец
			КонецЦикла;
		КонецЦикла;
		
		// Евросиб US 90342 Рыбьяков К.А. 10.03.2026 ((
		ТаблицаРасчетаВариантовПисем.Свернуть("EMail,ФИО,КлючКомбинацииДокументов","СЧЕТЗАКАЗ,АКТСДАЧИПРИЕМКИ,ОТЧЕТАГЕНТА,КОРРАКТСДАЧИПРИЕМКИ,СЧЕТФАКТУРА981,ПСЦ_ОДНОЯЗЫЧНЫЙ2,КП,СПЕЦИАЛЬНОЕПРЕДЛОЖЕНИЕ");
		//ТаблицаРасчетаВариантовПисем.Свернуть("EMail,ФИО,КлючКомбинацииДокументов","СЧЕТЗАКАЗ,АКТСДАЧИПРИЕМКИ,ОТЧЕТАГЕНТА,КОРРАКТСДАЧИПРИЕМКИ,СЧЕТФАКТУРА981,ПСЦ_ОДНОЯЗЫЧНЫЙ2,КП");
		// Евросиб Рыбьяков К.А. 10.03.2026 ))
		КоличествоКолонок = ТаблицаРасчетаВариантовПисем.Колонки.Количество();
		Для Каждого СтрТЗ Из ТаблицаРасчетаВариантовПисем Цикл
			МассивКомбинаций = Новый Массив;
			Для индексКолонки = 3 По КоличествоКолонок-1 Цикл
				Если СтрТЗ.Получить(индексКолонки) > 0 Тогда
					ТекКолонка = ТаблицаРасчетаВариантовПисем.Колонки.Получить(индексКолонки);
					МассивКомбинаций.Добавить(СокрЛП(ТекКолонка.Имя));	
				КонецЕсли;
			КонецЦикла;
			СтрТЗ.КлючКомбинацииДокументов = СтрСоединить(МассивКомбинаций,"#");
			СтрТЗ.ФИО = СоответствиеEMailИФИО.Получить(СтрТЗ.EMail);
		КонецЦикла;
		
		//ЗАПОЛНЕНИЕ ТАБЛИЦЫ ПИСЕМ, КАЖДАЯ СТРОКА ТАБЛИЦЫ ЭТО КОМБИНАЦИЯ ПОЛУЧАТЕЛЕЙ И ПЕЧАТНЫХ ФОРМ
		МассивКлючейКомбинацийДокументов = ТаблицаРасчетаВариантовПисем.ВыгрузитьКолонку("КлючКомбинацииДокументов");
		Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(МассивКлючейКомбинацийДокументов);
	
		Для Каждого КлючКомбинацииДокументов Из МассивКлючейКомбинацийДокументов Цикл
			Если НЕ ЗначениеЗаполнено(КлючКомбинацииДокументов) Тогда
				Продолжить;
			КонецЕсли;
			
			СписокПолучателейКонтрагента = Новый СписокЗначений;
			МассивВложений = Новый Массив;
			ОтборПоКлючу = Новый Структура("КлючКомбинацииДокументов", КлючКомбинацииДокументов);
			НайденныеСтрокиТаблицыРасчета = ТаблицаРасчетаВариантовПисем.НайтиСтроки(ОтборПоКлючу);
			Для Каждого СтрокаТаблицыРасчета Из НайденныеСтрокиТаблицыРасчета Цикл
				ТекПолучатель = СтрокаТаблицыРасчета.ФИО +" <"  + СокрЛП(СтрокаТаблицыРасчета.EMail) + ">";
				СписокПолучателейКонтрагента.Добавить(ТекПолучатель);
			КонецЦикла;
			
			Если ВыбранныеПараметры.УпаковатьВАрхив Тогда
				МассивВложений = СписокВсехВложений;
			Иначе 
				МассивИменМакетов = СтрРазделить(КлючКомбинацииДокументов,"#");
				Для Каждого ИмяМакета Из МассивИменМакетов Цикл
					Для Каждого СтрНастройкаПечатныхФорм Из НастройкиПечатныхФорм.НайтиСтроки(Новый Структура("ИмяВРЕГ",ИмяМакета)) Цикл
						ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивВложений,СтрНастройкаПечатныхФорм.СписокВложений.ВыгрузитьЗначения()); ;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
			
			НовСтрТЗ = ТаблицаПисем.Добавить();
			НовСтрТЗ.Получатели = СписокПолучателейКонтрагента;
			НовСтрТЗ.МассивВложений = МассивВложений;
		КонецЦикла;		
		
		Если ТаблицаПисем.Количество() = 0 Тогда
			// заполняем список по умолчанию данными из контрагента 
			// (на тот случай, если таблица контактных лиц пуста или если никто из них не подошел)
			ТЧКонтакты = КонтрагентПолучатель.КонтактнаяИнформация;
			Параметрыотбора = НОвый Структура;
			Параметрыотбора.Вставить("Тип",Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
			НайденнаяПочта = ТЧКонтакты.НайтиСтроки(Параметрыотбора);
			Для Каждого Адр Из НайденнаяПочта Цикл
				ТекПолучатель = СТрока(Адр.Представление);
				// проверяем уникальность
				Если СписокПолучателейКонтрагента.НайтиПоЗначению(ТекПолучатель) = Неопределено Тогда
					СписокПолучателейКонтрагента.Добавить(ТекПолучатель);
				КонецЕсли;
			КонецЦикла;
			НовСтрТЗ = ТаблицаПисем.Добавить();
			НовСтрТЗ.Получатели = СписокПолучателейКонтрагента;
			НовСтрТЗ.МассивВложений = СписокВсехВложений;
		КонецЕсли;
		//ДИТ, Беляев СЮ, Ticket#0297503 / BUG 64926, 07-02-2023, конец
		
	Иначе
		// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
		// Печать из релиза клиента. Т.к. печать предсмотрена из одного документа, а не из
		// массива, то контакты терминала вылачи берем из первого документа.
		КонтактыТерминалаВыдачи = Параметры.ПараметрКоманды[0].КонтактТерминала;
		МассивКонтактов = СтрРазделить(КонтактыТерминалаВыдачи, ";", Ложь); 
		Получатели = Новый СписокЗначений;
		Получатели.ЗагрузитьЗначения(МассивКонтактов);
		// Евросиб Фролов)
		
		//ДИТ, Беляев СЮ, Ticket#0297503 / BUG 64926, 07-02-2023, начало
		НовСтрТЗ = ТаблицаПисем.Добавить();
		НовСтрТЗ.Получатели = Получатели;
		НовСтрТЗ.МассивВложений = СписокВсехВложений;
		//ДИТ, Беляев СЮ, Ticket#0297503 / BUG 64926, 07-02-2023, конец
		
	КонецЕсли;
	
	//ДИТ, Беляев СЮ, Ticket#0297503 / BUG 64926, 07-02-2023, начало
	Для Каждого СтрТаблицыПисем Из ТаблицаПисем Цикл
		Получатели = СтрТаблицыПисем.Получатели;
		СписокВложений = СтрТаблицыПисем.МассивВложений;
	//ДИТ, Беляев СЮ, Ticket#0297503 / BUG 64926, 07-02-2023, конец	
		
		///////////////////
		//Евросиб - АСуслов 14.07.2020 11:46:58 #
		//(
		ТекстДляПротокола = "";
		Если Параметры.ПараметрКоманды.Количество() > 0 И ТипЗнч(Параметры.ПараметрКоманды[0]) = Тип("ДокументСсылка.ПСЦ")
			// Евросиб US 90342 Рыбьяков К.А. 10.03.2026 ((
			Или ТипЗнч(Параметры.ПараметрКоманды[0]) = Тип("ДокументСсылка.РеестрСпециальныхСтавок") Тогда
			// Евросиб Рыбьяков К.А. 10.03.2026 ))
			//Евросиб Гудкова( 28.05.2021 Ticket№ 0231682
			//ТекстДляПротокола = СтрШаблон("Уважаемые партнеры, в  приложении  протокол, просьба подписать со своей стороны и выслать скан к %1: %2",
			//								Пользователи.ТекущийПользователь(),
			//								УправлениеКонтактнойИнформацией.
			//									КонтактнаяИнформацияОбъекта(
			//										Пользователи.ТекущийПользователь(),
			//										Справочники.ВидыКонтактнойИнформации.EmailПользователя));
			ТекстДляПротокола = "Уважаемые партнеры,
			|<p>Во вложении протокол на подпись.</p>
			//ДИТ, Беляев СЮ, Ticket#0311458, 31-05-2023, начало
			|<p>Просим прислать скан подписанного протокола, без него не сможем оформить закрывающие документы.</p>
			//ДИТ, Беляев СЮ, Ticket#0311458, 31-05-2023, конец
			|<p></p>";
			// Евросиб Гудкова) 		
		КонецЕсли; 
		//ПараметрыВывода.ПараметрыОтправки.Вставить("ТекстТаблицаВложений", СформироватьТекстПисьма(Параметры, СписокВложений));	
		//ДИТ, Беляев СЮ, Ticket#0297503 / BUG 64926, 07-02-2023, начало
		ПараметрыВывода.ПараметрыОтправки.Вставить("ТекстТаблицаВложений", СформироватьТекстПисьма(Параметры, СтрТаблицыПисем.МассивВложений));
		//ДИТ, Беляев СЮ, Ticket#0297503 / BUG 64926, 07-02-2023, конец
		Если ТипЗнч(Параметры.ПараметрКоманды[0]) <> Тип("ДокументСсылка.РелизКлиента") // Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
			// Евросиб US 90342 Рыбьяков К.А. 10.03.2026 ((
			И ТипЗнч(Параметры.ПараметрКоманды[0]) <> Тип("ДокументСсылка.РеестрСпециальныхСтавок") Тогда
			// Евросиб Рыбьяков К.А. 10.03.2026 ))
			ПараметрыВывода.ПараметрыОтправки.Текст = "<!DOCTYPE html><BODY>
			|<p>"+ТекстДляПротокола+"</p> 
			|<p>Перечень документов:</p>
			|  %ПереченьДокументов% 
			|<p>ВНИМАНИЕ!</p>
			|<p>Данное письмо сформировано автоматически. Не отвечайте на данное письмо!</p>"
			+ПечатьКомплектаДокументов.ПолучитьТекстПодвалаПисьма(Параметры.ПараметрКоманды[0].Ссылка)+"
			|</BODY></html>";
		КонецЕсли;			
		//Евросиб ( Литвинов 21.01.2021 #30025
		//ПараметрыВывода.ПараметрыОтправки.Тема = "Автоматическая отправка документов от ЗАО «Евросиб СПб-ТС»";
		Если Параметры.Свойство("ПараметрКоманды") Тогда
			Если ТипЗнч(Параметры.ПараметрКоманды) = Тип("Массив") Тогда
				Попытка
					МаксДата    = Дата(1, 1, 1, 0, 0, 0);
					лОрганизация = Справочники.Организации.ПустаяСсылка();
					Для Каждого СтрМас Из Параметры.ПараметрКоманды Цикл
						лДатаДок = ?(ОбщегоНазначения.ЕстьРеквизитОбъекта("ДатаДокумента", СтрМас.Метаданные()),СтрМас.ДатаДокумента , СтрМас.Дата);
						МаксДата 	= МАКС(лДатаДок, МаксДата);
						лОрганизация = ?(ЗначениеЗаполнено(СтрМас.Организация), СтрМас.Организация, лОрганизация);
					КонецЦикла;	
				Исключение
					МаксДата = ТекущаяДата();
					лОрганизация = Справочники.Организации.НайтиПоКоду("Y0000361 ");
				КонецПопытки;
			КонецЕсли;	
		КонецЕсли;
		ПараметрыВывода.ПараметрыОтправки.Тема = "Автоматическая отправка документов от "+Справочники.Организации.НаименованияНаДату(?(ЗначениеЗаполнено(лОрганизация.ГоловнаяОрганизация), лОрганизация.ГоловнаяОрганизация, лОрганизация), МаксДата).НаименованиеПолное;
		//Евросиб ) Литвинов 21.01.2021 #30025
		// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
		ДатаПечати = ТекущаяДата();
		Если ТипЗнч(Параметры.ПараметрКоманды[0]) = Тип("ДокументСсылка.РелизКлиента") Тогда
			Если Параметры.ПараметрыПечати.ДополнительныеПараметры.Свойство("ДатаПечати") Тогда
				ДатаПечати = Параметры.ПараметрыПечати.ДополнительныеПараметры.ДатаПечати;
			КонецЕсли;	
			РеквизитыРелиза = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.ПараметрКоманды[0], "НомерРелиза, ИзмененыКлючевыеПоля"); 
			НомерРелиза = РеквизитыРелиза.НомерРелиза;
			ИзмененыКлючевыеПоля = РеквизитыРелиза.ИзмененыКлючевыеПоля;
			ШаблонТемы = "Запрос от %1 на выдачу контейнеров по релизу Евросиб: %2";   	
			//Если ИзмененыКлючевыеПоля Тогда
			//	ШаблонТемы = "Корректировка: " + ШаблонТемы;   
			//КонецЕсли;
			//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, начало
			Если РегистрыСведений.ОтправленныеПоПочтеДокументы.УжеЕстьЗаписиПоДокументу(Параметры.ПараметрКоманды[0]) Тогда
				ШаблонТемы = "Корректировка запроса от %1 на выдачу контейнеров по релизу Евросиб: %2";
			КонецЕсли;   
			//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, конец
			
			ТемаПисьма = СтрШаблон(ШаблонТемы, ДатаПечати, НомерРелиза);
			ПараметрыВывода.ПараметрыОтправки.Тема = ТемаПисьма;
		КонецЕсли;	
		// Евросиб Фролов)
		Получатели.Добавить(УправлениеКонтактнойИнформацией.
		КонтактнаяИнформацияОбъекта(
		Пользователи.ТекущийПользователь(),
		Справочники.ВидыКонтактнойИнформации.EmailПользователя));
		//)
		//Евросиб - АСуслов 14.07.2020 11:46:59 #
		
		
		//ДИТ Пак И.Т. Task34787 (Ticket#0206504) 03.06.2021 Начало
		СведенияДляФО = ПолучитьСведенияДляФО();
		Если ЗначениеЗаполнено(СведенияДляФО.ПереченьКлиентов) Тогда
			ПараметрыВывода.ПараметрыОтправки.Тема = ПараметрыВывода.ПараметрыОтправки.Тема + " - " + СведенияДляФО.ПереченьКлиентов;
		КонецЕсли;
		Если ЗначениеЗаполнено(ЭтаФорма.ВыполняемоеДействиеНаименование) Тогда
			ПараметрыВывода.ПараметрыОтправки.Тема = ПараметрыВывода.ПараметрыОтправки.Тема + ". " + ЭтаФорма.ВыполняемоеДействиеНаименование;
		КонецЕсли;
		Если ЭтаФорма.ОтправкаТолькоДляФО Тогда
			Получатели.Очистить();
		КонецЕсли;
		Если СведенияДляФО.ОтправлятьВФО Тогда
			Получатели.Добавить(СведенияДляФО.ЭлАдресФО);
		КонецЕсли;
		//ДИТ Пак И.Т. Task34787 (Ticket#0206504) 03.06.2021 Конец
		
		// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
		МассивКонтактныхЛиц = Новый Массив;
		// Евросиб US 90342 Рыбьяков К.А. 10.03.2026 ((
		Если ТипЗнч(Параметры.ПараметрКоманды[0]) = Тип("ДокументСсылка.РеестрСпециальныхСтавок") Тогда
			МассивКонтактныхЛиц = ОбщегоНазначения.ТаблицаЗначенийВМассив(КонтрагентКЛ);
		ИначеЕсли ТипЗнч(Параметры.ПараметрКоманды[0]) <> Тип("ДокументСсылка.РелизКлиента") Тогда
			МассивКонтактныхЛиц = ОбщегоНазначения.ТаблицаЗначенийВМассив(КонтрагентКЛ.Выгрузить());
		КонецЕсли;
		//Если ТипЗнч(Параметры.ПараметрКоманды[0]) <> Тип("ДокументСсылка.РелизКлиента") Тогда
		//	МассивКонтактныхЛиц = ОбщегоНазначения.ТаблицаЗначенийВМассив(КонтрагентКЛ.Выгрузить())
		//КонецЕсли;
		// Евросиб Фролов)	
		// Евросиб Рыбьяков К.А. 10.03.2026 ))

		
		Результат = Новый Структура;
		Результат.Вставить("Получатель", Получатели);
		// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
		//Результат.Вставить("МассивКонтактныхЛиц",ОбщегоНазначения.ТаблицаЗначенийВМассив(КонтрагентКЛ.Выгрузить()));
		Результат.Вставить("МассивКонтактныхЛиц", МассивКонтактныхЛиц);
		Результат.Вставить("Предмет", Параметры.ПараметрКоманды[0]);
		Результат.Вставить("ДатаОтправкиРелизаКлиента", ДатаПечати);
		// Евросиб Фролов)
		Результат.Вставить("Тема", ПараметрыВывода.ПараметрыОтправки.Тема);
		Результат.Вставить("Текст", ПараметрыВывода.ПараметрыОтправки.Текст);
		Результат.Вставить("Вложения", СписокВложений);
		Результат.Вставить("УдалятьФайлыПослеОтправки", Истина);
		//Евросиб - АСуслов 07.08.2020 11:21:16 #
		//(
		Результат.Вставить("ТекстТаблицаВложений", ПараметрыВывода.ПараметрыОтправки.ТекстТаблицаВложений);
		//)
		//Евросиб - АСуслов 07.08.2020 11:21:17 # 
		
		// ДИТ US 72708 ТА 72713 Сержантова А.С. Начало: 11.09.2023
		ВладельцыПФ = Новый Массив;
		Если СтрНайти(СписокВложений[0].Представление, ".zip") <> 0 Тогда
			ВладельцыПФ = СписокВложений[0].ВладелецПФ;	
		Иначе
			Для каждого Стр Из СписокВложений Цикл
				Если ВладельцыПФ.Найти(Стр.ВладелецПФ) = Неопределено Тогда
					ВладельцыПФ.Добавить(Стр.ВладелецПФ);	
				КонецЕсли;		
			КонецЦикла; 
		КонецЕсли;

		Результат.Вставить("ВладельцыПФ", ВладельцыПФ);
		// ДИТ US 72708 ТА 72713 Сержантова А.С. Конец: 11.09.2023
		
		ПечатныеФормы = Новый ТаблицаЗначений;
		ПечатныеФормы.Колонки.Добавить("Название");
		ПечатныеФормы.Колонки.Добавить("ТабличныйДокумент");
		
		Для Каждого НастройкаПечатнойФормы Из НастройкиПечатныхФорм Цикл
			Если Не НастройкаПечатнойФормы.Печатать Тогда
				Продолжить;
			КонецЕсли;
			
			ТабличныйДокумент = ЭтотОбъект[НастройкаПечатнойФормы.ИмяРеквизита];
			Если ПечатныеФормы.НайтиСтроки(Новый Структура("ТабличныйДокумент", ТабличныйДокумент)).Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если ВычислитьИспользованиеВывода(ТабличныйДокумент) = ИспользованиеВывода.Запретить Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТабличныйДокумент.Защита Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТабличныйДокумент.ВысотаТаблицы = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ОписаниеПечатнойФормы = ПечатныеФормы.Добавить();
			ОписаниеПечатнойФормы.Название = НастройкаПечатнойФормы.Название;
			ОписаниеПечатнойФормы.ТабличныйДокумент = ТабличныйДокумент;
		КонецЦикла;
		
		СписокОбъектов = Параметры.ПараметрКоманды;
		Если ОбщегоНазначения.ЗначениеСсылочногоТипа(Параметры.ПараметрКоманды) Тогда
			СписокОбъектов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Параметры.ПараметрКоманды);
		КонецЕсли;
		
		УправлениеПечатьюПереопределяемый.ПередОтправкойПоПочте(Результат, ПараметрыВывода, СписокОбъектов, ПечатныеФормы);
		
	//Возврат Результат;	
	//ДИТ, Беляев СЮ, Ticket#0297503 / BUG 64926, 07-02-2023, начало
		МассивПисем.Добавить(Результат);
	КонецЦикла;

	Возврат МассивПисем;
	//ДИТ, Беляев СЮ, Ticket#0297503 / BUG 64926, 07-02-2023, конец
	
КонецФункции

//ДИТ, Беляев СЮ, Ticket#0297503 / BUG 64926, 07-02-2023, начало
&НаСервере
//Функция ПолучитьТаблицуСоответствияМакетаРеквизиту() //ДИТ, Беляев СЮ, Ticket#0303956, 10-03-2023, закомментировано
Функция ПолучитьЗапросСТаблицейСоответствияМакетаРеквизиту()
	
	Перем НовСтрТаблицыСоответствий, ТаблицаСоответствияМакетаРеквизиту;
	
	ТаблицаСоответствияМакетаРеквизиту = Новый ТаблицаЗначений; //Соответствие или Структура не подходят, т.к. к одной колонке м/б несколько макетов
	ТаблицаСоответствияМакетаРеквизиту.Колонки.Добавить("ИмяМакета", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100)));
	ТаблицаСоответствияМакетаРеквизиту.Колонки.Добавить("ИмяКолонкиВТаблицеРасчетаВариантов", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100)));
	ТаблицаСоответствияМакетаРеквизиту.Колонки.Добавить("ИмяРеквизита", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100)));
	
	НовСтрТаблицыСоответствий = ТаблицаСоответствияМакетаРеквизиту.Добавить();
	НовСтрТаблицыСоответствий.ИмяМакета = "СЧЕТЗАКАЗ%";
	НовСтрТаблицыСоответствий.ИмяКолонкиВТаблицеРасчетаВариантов = "СЧЕТЗАКАЗ";
	НовСтрТаблицыСоответствий.ИмяРеквизита = "КонтактДляСчетаКлиенту";
	
	НовСтрТаблицыСоответствий = ТаблицаСоответствияМакетаРеквизиту.Добавить();
	НовСтрТаблицыСоответствий.ИмяМакета = "СЧЕТНАОПЛАТУАНГЛ%";
	НовСтрТаблицыСоответствий.ИмяКолонкиВТаблицеРасчетаВариантов = "СЧЕТЗАКАЗ";
	НовСтрТаблицыСоответствий.ИмяРеквизита = "КонтактДляСчетаКлиенту";
	
	НовСтрТаблицыСоответствий = ТаблицаСоответствияМакетаРеквизиту.Добавить();
	НовСтрТаблицыСоответствий.ИмяМакета = "АКТСДАЧИПРИЕМКИ%";
	НовСтрТаблицыСоответствий.ИмяКолонкиВТаблицеРасчетаВариантов = "АКТСДАЧИПРИЕМКИ";
	НовСтрТаблицыСоответствий.ИмяРеквизита = "КонтактДляРеализации";
	
	//ДИТ, Беляев СЮ, Ticket#0318680, 01-08-2023, начало
	НовСтрТаблицыСоответствий = ТаблицаСоответствияМакетаРеквизиту.Добавить();
	НовСтрТаблицыСоответствий.ИмяМакета = "УНИВЕРСАЛЬНЫЙПЕРЕДАТОЧНЫЙДОКУМЕНТ981%";
	НовСтрТаблицыСоответствий.ИмяКолонкиВТаблицеРасчетаВариантов = "АКТСДАЧИПРИЕМКИ";
	НовСтрТаблицыСоответствий.ИмяРеквизита = "КонтактДляРеализации";
	//ДИТ, Беляев СЮ, Ticket#0318680, 01-08-2023, конец
	
	НовСтрТаблицыСоответствий = ТаблицаСоответствияМакетаРеквизиту.Добавить();
	НовСтрТаблицыСоответствий.ИмяМакета = "ОТЧЕТАГЕНТА%";
	НовСтрТаблицыСоответствий.ИмяКолонкиВТаблицеРасчетаВариантов = "ОТЧЕТАГЕНТА";
	НовСтрТаблицыСоответствий.ИмяРеквизита = "КонтактДляОтчетаКомитенту";
	
	//Евросиб(ДИТ), Беляев СЮ, US 89714 / TA 89717, 09-12-2024, начало
	НовСтрТаблицыСоответствий = ТаблицаСоответствияМакетаРеквизиту.Добавить();
	НовСтрТаблицыСоответствий.ИмяМакета = "ДОКУМЕНТКОНТРАГЕНТА%";
	НовСтрТаблицыСоответствий.ИмяКолонкиВТаблицеРасчетаВариантов = "ОТЧЕТАГЕНТА";
	НовСтрТаблицыСоответствий.ИмяРеквизита = "КонтактДляОтчетаКомитенту";
	//Евросиб(ДИТ), Беляев СЮ, US 89714 / TA 89717, 09-12-2024, конец
	
	НовСтрТаблицыСоответствий = ТаблицаСоответствияМакетаРеквизиту.Добавить();
	НовСтрТаблицыСоответствий.ИмяМакета = "КОРРАКТСДАЧИПРИЕМКИ%";
	НовСтрТаблицыСоответствий.ИмяКолонкиВТаблицеРасчетаВариантов = "КОРРАКТСДАЧИПРИЕМКИ";
	НовСтрТаблицыСоответствий.ИмяРеквизита = "КонтактДляКоррРеализации";
	
	НовСтрТаблицыСоответствий = ТаблицаСоответствияМакетаРеквизиту.Добавить();
	НовСтрТаблицыСоответствий.ИмяМакета = "КОРР%";
	НовСтрТаблицыСоответствий.ИмяКолонкиВТаблицеРасчетаВариантов = "КОРРАКТСДАЧИПРИЕМКИ";
	НовСтрТаблицыСоответствий.ИмяРеквизита = "КонтактДляКоррРеализации";
	
	НовСтрТаблицыСоответствий = ТаблицаСоответствияМакетаРеквизиту.Добавить();
	НовСтрТаблицыСоответствий.ИмяМакета = "СЧЕТФАКТУРА981%";
	НовСтрТаблицыСоответствий.ИмяКолонкиВТаблицеРасчетаВариантов = "СЧЕТФАКТУРА981";
	НовСтрТаблицыСоответствий.ИмяРеквизита = "КонтактДляСФВ";
	
	НовСтрТаблицыСоответствий = ТаблицаСоответствияМакетаРеквизиту.Добавить();
	НовСтрТаблицыСоответствий.ИмяМакета = "ПСЦ_ОДНОЯЗЫЧНЫЙ2%";
	НовСтрТаблицыСоответствий.ИмяКолонкиВТаблицеРасчетаВариантов = "ПСЦ_ОДНОЯЗЫЧНЫЙ2";
	НовСтрТаблицыСоответствий.ИмяРеквизита = "КонтактДляПСЦ";
	
	НовСтрТаблицыСоответствий = ТаблицаСоответствияМакетаРеквизиту.Добавить();
	НовСтрТаблицыСоответствий.ИмяМакета = "ПСЦ_ОДНОЯЗЫЧНЫЙУНИВЕРСАЛЬНЫЙФАКСИМИЛЕ%";
	НовСтрТаблицыСоответствий.ИмяКолонкиВТаблицеРасчетаВариантов = "ПСЦ_ОДНОЯЗЫЧНЫЙ2";
	НовСтрТаблицыСоответствий.ИмяРеквизита = "КонтактДляПСЦ";
	
	НовСтрТаблицыСоответствий = ТаблицаСоответствияМакетаРеквизиту.Добавить();
	НовСтрТаблицыСоответствий.ИмяМакета = "КП%";
	НовСтрТаблицыСоответствий.ИмяКолонкиВТаблицеРасчетаВариантов = "КП";
	НовСтрТаблицыСоответствий.ИмяРеквизита = "КонтактДляКоммерчПредложения";
	
	// Евросиб US 90342 Рыбьяков К.А. 10.03.2026 ((
	НовСтрТаблицыСоответствий = ТаблицаСоответствияМакетаРеквизиту.Добавить();
	НовСтрТаблицыСоответствий.ИмяМакета = "СПЕЦИАЛЬНОЕПРЕДЛОЖЕНИЕ%";
	НовСтрТаблицыСоответствий.ИмяКолонкиВТаблицеРасчетаВариантов = "СПЕЦИАЛЬНОЕПРЕДЛОЖЕНИЕ";
	НовСтрТаблицыСоответствий.ИмяРеквизита = "КонтактДляСпециальныхСтавок";
	// Евросиб Рыбьяков К.А. 10.03.2026 ))
	
	//Возврат ТаблицаСоответствияМакетаРеквизиту;
	//ДИТ, Беляев СЮ, Ticket#0303956, 10-03-2023, начало
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаСоответствияМакетаРеквизиту.ИмяМакета КАК ИмяМакета,
		|	ТаблицаСоответствияМакетаРеквизиту.ИмяКолонкиВТаблицеРасчетаВариантов КАК ИмяКолонкиВТаблицеРасчетаВариантов,
		|	ТаблицаСоответствияМакетаРеквизиту.ИмяРеквизита КАК ИмяРеквизита
		|ПОМЕСТИТЬ ВТ_ТаблицаСоответствияМакетаРеквизиту
		|ИЗ
		|	&ТаблицаСоответствияМакетаРеквизиту КАК ТаблицаСоответствияМакетаРеквизиту";
	Запрос.УстановитьПараметр("ТаблицаСоответствияМакетаРеквизиту", ТаблицаСоответствияМакетаРеквизиту);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Запрос;
	//ДИТ, Беляев СЮ, Ticket#0303956, 10-03-2023, конец
	
КонецФункции
//ДИТ, Беляев СЮ, Ticket#0297503 / BUG 64926, 07-02-2023, конец

&НаКлиенте
Процедура ОтправитьПечатныеФормыПоПочтеНастройкаУчетнойЗаписиПредложена(УчетнаяЗаписьНастроена, ДополнительныеПараметры) Экспорт
	
	Если УчетнаяЗаписьНастроена <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ИмяОткрываемойФормы = "ОбщаяФорма.ВыборФорматаВложений";
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Взаимодействия") 
		И СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиента().ИспользоватьПочтовыйКлиент Тогда
			Если ПолучателейБольшеОдного(ПараметрыВывода.ПараметрыОтправки.Получатель) Тогда
				ПараметрыФормы.Вставить("Получатели", ПараметрыВывода.ПараметрыОтправки.Получатель);
				ИмяОткрываемойФормы = "ОбщаяФорма.ПодготовкаНовогоПисьма";
			КонецЕсли;
	КонецЕсли;
	
	ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция ТабличныеДокументыДляПечати()
	ТабличныеДокументы = Новый СписокЗначений;
	
	//Для Каждого НастройкаПечатнойФормы Из НастройкиПечатныхФорм Цикл
	//ДИТ, Беляев СЮ, Ticket#0330981, 15-11-2023, начало
	ТаблицаНастроек = НастройкиПечатныхФорм.Выгрузить();
	ТаблицаНастроек.Сортировать("СсылкаДокПервоначальная Убыв, ПозицияПоУмолчанию Возр");
	
	Для Каждого НастройкаПечатнойФормы Из ТаблицаНастроек Цикл
	//ДИТ, Беляев СЮ, Ticket#0330981, 15-11-2023, конец
		Если Элементы[НастройкаПечатнойФормы.ИмяРеквизита].Вывод = ИспользованиеВывода.Разрешить И НастройкаПечатнойФормы.Печатать Тогда
			ПечатнаяФорма = ЭтотОбъект[НастройкаПечатнойФормы.ИмяРеквизита];
			ТабличныйДокумент = Новый ТабличныйДокумент;
			ТабличныйДокумент.Вывести(ПечатнаяФорма);
			ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ПечатнаяФорма, УправлениеПечатью.КопируемыеСвойстваТабличногоДокумента());
			ТабличныйДокумент.КоличествоЭкземпляров = НастройкаПечатнойФормы.Количество;
			ТабличныеДокументы.Добавить(ТабличныйДокумент, НастройкаПечатнойФормы.Представление);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТабличныеДокументы;
КонецФункции

&НаКлиенте
Процедура СохранитьНастройки()
	СохраняемыеНастройкиПечатныхФорм = Новый Массив;
	Для Каждого НастройкаПечатнойФормы Из НастройкиПечатныхФорм Цикл
		СохраняемаяНастройка = Новый Структура;
		СохраняемаяНастройка.Вставить("ИмяМакета", НастройкаПечатнойФормы.ИмяМакета);
		СохраняемаяНастройка.Вставить("Количество", ?(НастройкаПечатнойФормы.Печатать,НастройкаПечатнойФормы.Количество, 0));
		СохраняемаяНастройка.Вставить("ПозицияПоУмолчанию", НастройкаПечатнойФормы.ПозицияПоУмолчанию);
		СохраняемыеНастройкиПечатныхФорм.Добавить(СохраняемаяНастройка);
	КонецЦикла;
	СохранитьНастройкиПечатныхФорм(КлючНастроек, СохраняемыеНастройкиПечатныхФорм);
КонецПроцедуры

&НаКлиенте
Процедура НачатьСохранениеНастроек()
	ОтключитьОбработчикОжидания("СохранитьНастройки");
	Если ПустаяСтрока(КлючНастроек) Тогда
		Возврат;
	КонецЕсли;
	ПодключитьОбработчикОжидания("СохранитьНастройки", 2, Истина);
КонецПроцедуры

&НаСервереБезКонтекста
Функция НастройкиСохранения()
	НастройкиСохранения = Новый Структура;
	НастройкиСохранения.Вставить("ФорматыСохранения", Новый Массив);
	НастройкиСохранения.Вставить("УпаковатьВАрхив", Ложь);
	НастройкиСохранения.Вставить("ПереводитьИменаФайловВТранслит", Ложь);
	Возврат НастройкиСохранения;
КонецФункции

&НаСервереБезКонтекста
Функция ЕстьПодписьИПечать(ТабличныйДокумент)
	
	// ШЕЙКО О.Е. (04.02.2021) В определенных ситуациях он без этого падал
	Если ТипЗнч(ТабличныйДокумент) = Тип("Неопределено") Тогда
	
		Возврат Ложь;
	
	КонецЕсли; 
	
	Для Каждого Рисунок Из ТабличныйДокумент.Рисунки Цикл
		Если СтрНачинаетсяС(Рисунок.Имя, "Печать")
			Или СтрНачинаетсяС(Рисунок.Имя, "Подпись")
			Или СтрНачинаетсяС(Рисунок.Имя, "Факсимиле") Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ДобавитьПодписьИПечать()
	
	ПодписиИПечатиОбластей = УправлениеПечатью.ПодписиИПечатиОбластей(ОбъектыПечати);
	
	Для Каждого НастройкаПечатнойФормы Из НастройкиПечатныхФорм Цикл
		Если Не НастройкаПечатнойФормы.ПодписьИПечать Тогда
			Продолжить;
		КонецЕсли;
		ТабличныйДокумент = ЭтотОбъект[НастройкаПечатнойФормы.ИмяРеквизита];
		УправлениеПечатью.ДобавитьПодписьИПечать(ТабличныйДокумент, ПодписиИПечатиОбластей);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УбратьПодписьИПечать()
	
	Для Каждого НастройкаПечатнойФормы Из НастройкиПечатныхФорм Цикл
		Если Не НастройкаПечатнойФормы.ПодписьИПечать Тогда
			Продолжить;
		КонецЕсли;
		
		ТабличныйДокумент = ЭтотОбъект[НастройкаПечатнойФормы.ИмяРеквизита];
		//УправлениеПечатью.УбратьПодписьИПечать(ТабличныйДокумент);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьУдалитьПодписьПечать()
	
	Если ПодписьИПечать Тогда
		ДобавитьПодписьИПечать();
	Иначе
		УбратьПодписьИПечать();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриВыполненииКомандыНаСервере(ДополнительныеПараметры)
	УправлениеПечатьюПереопределяемый.ПечатьДокументовПриВыполненииКоманды(ЭтотОбъект, ДополнительныеПараметры);
КонецПроцедуры

#Область РасчетПоказателейВыделенныхЯчеек

// Выполняет расчет и вывод показателей выделенной области ячеек.
// См. обработчик события ОтчетТабличныйДокументПриАктивизацииОбласти.
//
&НаКлиенте
Процедура РассчитатьПоказателиДинамически()
	Перем ТекущаяКоманда;
	
	КомандыПоказателей = КомандыПоказателей();
	Для Каждого Команда Из КомандыПоказателей Цикл 
		Если Элементы[Команда.Ключ].Пометка Тогда 
			ТекущаяКоманда = Команда.Ключ;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	РассчитатьПоказатели(ТекущаяКоманда);
КонецПроцедуры

// Выполняет расчет и вывод показателей выделенных областей ячеек табличного документа.
//
// Параметры:
//  ТекущаяКоманда - Строка - имя команды расчета показателя, например, "РассчитатьСумму".
//                      Определяет, какой показатель является основным.
//
&НаКлиенте
Процедура РассчитатьПоказатели(ТекущаяКоманда = "РассчитатьСумму")
	// Расчет показателей.
	ПараметрыРасчета = ОбщегоНазначенияСлужебныйКлиент.ПараметрыРасчетаПоказателейЯчеек(ТекущаяПечатнаяФорма);
	Если ПараметрыРасчета.РассчитатьНаСервере Тогда 
		РасчетныеПоказатели = РасчетныеПоказателиСервер(ПараметрыРасчета);
	Иначе
		РасчетныеПоказатели = ОбщегоНазначенияСлужебныйКлиентСервер.РасчетныеПоказателиЯчеек(
			ТекущаяПечатнаяФорма, ПараметрыРасчета.ВыделенныеОбласти);
	КонецЕсли;
	
	// Установка значений показателей.
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РасчетныеПоказатели);
	
	// Переключение и форматирование показателей.
	КомандыПоказателей = КомандыПоказателей();
	Для Каждого Команда Из КомандыПоказателей Цикл 
		Элементы[Команда.Ключ].Пометка = Ложь;
		
		ЗначениеПоказателя = РасчетныеПоказатели[Команда.Значение];
		РазрядностьПоказателя = Мин(СтрДлина(Макс(ЗначениеПоказателя, -ЗначениеПоказателя) % 1) - 2, 4);
		
		Элементы[Команда.Значение].ФорматРедактирования = "ЧДЦ=" + РазрядностьПоказателя + "; ЧРГ=' '; ЧН=0";
	КонецЦикла;
	Элементы[ТекущаяКоманда].Пометка = Истина;
	
	// Вывод основного показателя.
	ТекущийПоказатель = КомандыПоказателей[ТекущаяКоманда];
	Показатель = ЭтотОбъект[ТекущийПоказатель];
	Элементы.Показатель.ФорматРедактирования = Элементы[ТекущийПоказатель].ФорматРедактирования;
	Элементы.КомандыВидовПоказателей.Картинка = БиблиотекаКартинок[ТекущийПоказатель];
КонецПроцедуры

// Рассчитывает показатели числовых ячеек в табличном документе.
//  см. ОтчетыКлиентСервер.РасчетныеПоказателиЯчеек.
//
&НаСервере
Функция РасчетныеПоказателиСервер(ПараметрыРасчета)
	Возврат ОбщегоНазначенияСлужебныйКлиентСервер.РасчетныеПоказателиЯчеек(ТекущаяПечатнаяФорма, ПараметрыРасчета.ВыделенныеОбласти);
КонецФункции

// Определяет соответствие между командами расчета показателей и показателями.
//
// Возвращаемое значение:
//   Соответствие - Ключ - имя команды, Значение - имя показателя.
//
&НаКлиенте
Функция КомандыПоказателей()
	КомандыПоказателей = Новый Соответствие();
	КомандыПоказателей.Вставить("РассчитатьСумму", "Сумма");
	КомандыПоказателей.Вставить("РассчитатьКоличество", "Количество");
	КомандыПоказателей.Вставить("РассчитатьСреднее", "Среднее");
	КомандыПоказателей.Вставить("РассчитатьМинимум", "Минимум");
	КомандыПоказателей.Вставить("РассчитатьМаксимум", "Максимум");
	
	Возврат КомандыПоказателей;
КонецФункции

// Управляет признаком видимости панели расчетных показателей.
//
// Параметры:
//  Видимость - Булево - Признак включения / выключения видимости панели показателей.
//              См. также Синтакс-помощник: ГруппаФормы.Видимость.
//
&НаКлиенте
Процедура УстановитьВидимостьПоказателей(Видимость)
	Элементы.ОбластьПоказателей.Видимость = Видимость;
	Элементы.РассчитатьВсеПоказатели.Пометка = Видимость;
КонецПроцедуры


#КонецОбласти


//ДИТ Пак И.Т. Task34787 (Ticket#0206504) 03.06.2021 Начало

&НаСервере
Функция ПолучитьСведенияДляФО()
	
	ТЗВыбраные = ЭтаФорма.НастройкиПечатныхФорм.Выгрузить(Новый Структура("Печатать", Истина));
	
	СоответствиеКонтрагенты = Новый Соответствие;
	
	ОрганизацияИзСсылки = Неопределено;
	
	ПереченьКлиентов = "";
	
	ОтправлятьВФО = Ложь;
	
	Для каждого СтрокаТЗ Из ТЗВыбраные Цикл
		СсылкаДок = СтрокаТЗ.СсылкаДок;
		
		Если Не ЗначениеЗаполнено(СсылкаДок) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ОтправлятьВФО И РегистрыСведений.ИсторияФакторинга.ДокументПроходитПоФакторингу(СсылкаДок) Тогда
			ОтправлятьВФО = Истина;
		КонецЕсли;
		
		ДанныеСсылки = Новый Структура("Контрагент, Организация");
		ЗаполнитьЗначенияСвойств(ДанныеСсылки, СсылкаДок);
		
		Если Не ЗначениеЗаполнено(ОрганизацияИзСсылки) И ЗначениеЗаполнено(ДанныеСсылки.Организация) Тогда
			ОрганизацияИзСсылки = ДанныеСсылки.Организация;
		КонецЕсли;
		
		КонтрагентИзСсылки = ДанныеСсылки.Контрагент;
		
		Если ЗначениеЗаполнено(КонтрагентИзСсылки) И СоответствиеКонтрагенты[КонтрагентИзСсылки] = Неопределено Тогда
			СоответствиеКонтрагенты.Вставить(КонтрагентИзСсылки, Истина);
			ПереченьКлиентов = ПереченьКлиентов + ?(ПереченьКлиентов = "", "", ", ") + Строка(КонтрагентИзСсылки);
		КонецЕсли;
	КонецЦикла;
	
	ЭлАдресФО = "";
	Если ЗначениеЗаполнено(ОрганизацияИзСсылки) Тогда
		Если ЗначениеЗаполнено(ОрганизацияИзСсылки.ГоловнаяОрганизация) Тогда
			ОрганизацияИзСсылки = ОрганизацияИзСсылки.ГоловнаяОрганизация;
		КонецЕсли;                                                                                                                                            
		//Евросиб - АСуслов 19.09.2023 9:55:55 #74724
		//(
		//ЭлАдресФО = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ОрганизацияИзСсылки, Справочники.ВидыКонтактнойИнформации.EmailФО,, Истина);
		ЭлАдресФО = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ОрганизацияИзСсылки, Справочники.ВидыКонтактнойИнформации.EmailФО, ТекущаяДата(), Истина);
		//)
		//Евросиб - АСуслов 19.09.2023 9:59:11 #74724
	Иначе
		ОтправлятьВФО = Ложь;
	КонецЕсли;
	
	
	Сведения = Новый Структура("ОтправлятьВФО, ЭлАдресФО, ПереченьКлиентов", ОтправлятьВФО, ЭлАдресФО, ПереченьКлиентов);
	
	Возврат Сведения;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытиемВопросОбОбязательнойОтправке()
	
	ТочкаПродолжения = Новый ОписаниеОповещения("ПередЗакрытиемВопросОбОбязательнойОтправке_Продолжение", ЭтаФорма);
	Если ЭтаФорма.ОтправкаТолькоДляФО Тогда
		ТекстВопроса = "Необходимо выполнить отправку уведомления в ФО." + Символы.ПС + "Отправить?";
	Иначе
		ТекстВопроса = "Необходимо выполнить отправку письма." + Символы.ПС + "Отправить?";
	КонецЕсли;
	
	Ответы = Новый СписокЗначений;
	Ответы.Добавить(КодВозвратаДиалога.Да);
	Ответы.Добавить(КодВозвратаДиалога.Нет);
	Ответы.Добавить("НетДляВсех", " Нет для всех ");
	
	ПоказатьВопрос(ТочкаПродолжения, ТекстВопроса, Ответы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемВопросОбОбязательнойОтправке_Продолжение(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Отправить(Неопределено);
		
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		
		ЭтаФорма.ОбязательнаяОтправка = Ложь;
		ЭтаФорма.Закрыть();
		
	ИначеЕсли Ответ = "НетДляВсех" Тогда
		
		ЭтаФорма.ОбязательнаяОтправка = Ложь;
		ЭтаФорма.Закрыть(Новый Структура("НеОтправлятьДляВсех", Истина));
		
	КонецЕсли;
	
КонецПроцедуры

//ДИТ Пак И.Т. Task34787 (Ticket#0206504) 03.06.2021 Конец


#КонецОбласти

#Область ПечатьДокументовПоОтборам

&НаКлиенте
Процедура ТЗТипыДокументовПриАктивизацииСтроки(Элемент)
	
	ТекД = Элементы.ТЗТипыДокументов.ТекущиеДанные;
    Если ТекД = Неопределено Тогда
        // ТЗ ТЗТипыДокументов пустая
        Элементы.ТЗСписокДокументов.ОтборСтрок = Неопределено;
    Иначе
        // Для ТЧ Договоры устанавливаем отбор по текущему контрагенту
        ТекВидДокумента = ТекД.ВидДокументаВСистеме;
        Элементы.ТЗСписокДокументов.ОтборСтрок = Новый ФиксированнаяСтруктура("ВидДокументаВСистеме", ТекВидДокумента);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискДокументовПоОтборам(Команда)
	
	Если НЕ ЗначениеЗаполнено(ПериодДокумента)
		И НЕ ЗначениеЗаполнено(Клиент)
		И НЕ ЗначениеЗаполнено(Договор) Тогда
		Сообщить("Установите отбор для ускорения обработки и уменьшения количества документов");
		Возврат;
	Иначе
		ПоискДокументовПоОтборамНаСервере();
		
		Для Каждого Стр Из ТЗТипыДокументов Цикл
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("ВидДокументаВСистеме",Стр.ВидДокументаВСистеме);
			НайденныеСтроки = ТЗСписокДокументов.НайтиСтроки(ПараметрыОтбора);
			КолвоВыбранных = НайденныеСтроки.Количество();
			Стр.НайденоДокументов = КолвоВыбранных;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПоискДокументовПоОтборамНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КорректировкаРеализации.Ссылка КАК Ссылка,
	               |	КорректировкаРеализации.Дата КАК ДатаДокумента,
	               |	КорректировкаРеализации.Контрагент КАК Контрагент,
	               |	КорректировкаРеализации.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	КорректировкаРеализации.СуммаДокумента КАК СуммаДокумента,
	               |	""КорректировкаРеализации"" КАК ВидДокументаВСистеме
	               |ИЗ
	               |	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА ТИПЗНАЧЕНИЯ(&Контрагент) = ТИП(СТРОКА)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ КорректировкаРеализации.Контрагент В (&Контрагент)
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА ТИПЗНАЧЕНИЯ(&Договор) = ТИП(СТРОКА)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ КорректировкаРеализации.ДоговорКонтрагента = &Договор
	               |		КОНЕЦ
	               |	И КорректировкаРеализации.Дата МЕЖДУ &ДатаНач И &ДатаКон
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ОтчетКомитентуОПродажах.Ссылка,
	               |	ОтчетКомитентуОПродажах.Дата,
	               |	ОтчетКомитентуОПродажах.Контрагент,
	               |	ОтчетКомитентуОПродажах.ДоговорКонтрагента,
	               |	ОтчетКомитентуОПродажах.СуммаДокумента,
	               |	""ОтчетКомитентуОПродажах""
	               |ИЗ
	               |	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА ТИПЗНАЧЕНИЯ(&Контрагент) = ТИП(СТРОКА)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ОтчетКомитентуОПродажах.Контрагент В (&Контрагент)
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА ТИПЗНАЧЕНИЯ(&Договор) = ТИП(СТРОКА)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ОтчетКомитентуОПродажах.ДоговорКонтрагента = &Договор
	               |		КОНЕЦ
	               |	И ОтчетКомитентуОПродажах.Дата МЕЖДУ &ДатаНач И &ДатаКон
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслуг.Ссылка,
	               |	РеализацияТоваровУслуг.Дата,
	               |	РеализацияТоваровУслуг.Контрагент,
	               |	РеализацияТоваровУслуг.ДоговорКонтрагента,
	               |	РеализацияТоваровУслуг.СуммаДокумента,
	               |	""РеализацияТоваровУслуг""
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА ТИПЗНАЧЕНИЯ(&Контрагент) = ТИП(СТРОКА)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ РеализацияТоваровУслуг.Контрагент В (&Контрагент)
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА ТИПЗНАЧЕНИЯ(&Договор) = ТИП(СТРОКА)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ РеализацияТоваровУслуг.ДоговорКонтрагента = &Договор
	               |		КОНЕЦ
	               |	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНач И &ДатаКон
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СчетНаОплатуПокупателю.Ссылка,
	               |	СчетНаОплатуПокупателю.Дата,
	               |	СчетНаОплатуПокупателю.Контрагент,
	               |	СчетНаОплатуПокупателю.ДоговорКонтрагента,
	               |	СчетНаОплатуПокупателю.СуммаДокумента,
	               |	""СчетНаОплатуПокупателю""
	               |ИЗ
	               |	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА ТИПЗНАЧЕНИЯ(&Контрагент) = ТИП(СТРОКА)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ СчетНаОплатуПокупателю.Контрагент В (&Контрагент)
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА ТИПЗНАЧЕНИЯ(&Договор) = ТИП(СТРОКА)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ СчетНаОплатуПокупателю.ДоговорКонтрагента = &Договор
	               |		КОНЕЦ
	               |	И СчетНаОплатуПокупателю.Дата МЕЖДУ &ДатаНач И &ДатаКон";
	
	Запрос.УстановитьПараметр("Контрагент",?(ЗначениеЗаполнено(Клиент),Клиент,"НЕТ"));
	Запрос.УстановитьПараметр("Договор",?(ЗначениеЗаполнено(Договор),Договор,"НЕТ"));
	Запрос.УстановитьПараметр("ДатаНач",ПериодДокумента.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон",?(ЗначениеЗаполнено(ПериодДокумента.ДатаОкончания),ПериодДокумента.ДатаОкончания,ТекущаяДата()));

	ТЗСписокДокументов.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ТЗСписокДокументов.Индекс("Отметка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	Для Каждого Стр Из ТЗСписокДокументов Цикл
		стр.Отметка = Истина;
	КонецЦикла;
	ПересчетКолваОтмеченныхДокументов();
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметку(Команда)
	Для Каждого Стр Из ТЗСписокДокументов Цикл
		стр.Отметка = Ложь;
	КонецЦикла;
	ПересчетКолваОтмеченныхДокументов();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьВыбранных(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ВыборПодписантов",, ЭтотОбъект);

КонецПроцедуры

 &НаСервере
Процедура СозданиеТаблицыДокументов(СтруктураПодписантов)
	 
	ПараметрыОтбора = Новый Структура;
	ПараметрыОТбора.Вставить("Отметка",Истина);
	НайденныеСтроки = ТЗСписокДокументов.Выгрузить().Скопировать(ПараметрыОтбора);
	
	МассивПараметровКоманды = НОвый Массив;
	
	Параметры.ПараметрКоманды.Очистить();
	Для Каждого Стр Из НайденныеСтроки Цикл
		Параметры.ПараметрКоманды.Добавить(Стр.Ссылка);
	КонецЦикла;
	
	МассивДокументов = ПечатьКомплектаДокументов.СозданиеТаблицыДокументов(НайденныеСтроки,СтруктураПодписантов);
	
	КоллекцияПечатныхФорм = Новый Массив;
	
	ДЛя каждого Комплект из МассивДокументов Цикл
		Поля = УправлениеПечатьюКлиентСервер.ИменаПолейКоллекцииПечатныхФорм();
		ДобавленныеПечатныеФормы = Новый Соответствие;
		Для каждого Док из Комплект Цикл
			ДобавленныеПечатныеФормы = Новый Соответствие;
			ПечатнаяФорма = Новый Структура(СтрСоединить(Поля, ","));
			ПечатнаяФорма.ИмяМакета = Док.ИмяПФ;
			ПечатнаяФорма.ИмяВРЕГ = ВРег(Док.ИмяПФ);
			ПечатнаяФорма.СинонимМакета = Док.ИмяПФ;
			ПечатнаяФорма.ТабличныйДокумент = Док.ТабДок;
			ПечатнаяФорма.ИмяФайлаПечатнойФормы = Док.ИмяПФ;
			ПечатнаяФорма.Экземпляров = 1;
			ДобавленныеПечатныеФормы.Вставить(Док.ИмяПФ, ПечатнаяФорма);
			КоллекцияПечатныхФорм.Добавить(ПечатнаяФорма);
		КОнецЦикла;
		
		ОбластиОбъектов = Новый СписокЗначений;

	КонецЦикла;
	
	Если ОбъектыПечати = Неопределено Тогда
		ОбъектыПечати = Новый СписокЗначений;
	КонецЕсли;
	ПараметрыВывода = УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода();
	 
	СоздатьРеквизитыИЭлементыФормыДляПечатныхФорм(КоллекцияПечатныхФорм);
	
	УбратьПодписьИПечать();
	СохранитьНастройкиКомплектаПоУмолчанию();
	ЗагрузитьНастройкиКоличестваКопий();
	ЕстьРазрешенныйВывод = ЕстьРазрешенныйВывод();
	НастроитьВидимостьЭлементовФормы(ЕстьРазрешенныйВывод);
	УстановитьПризнакДоступностиВыводаВПредставленияхПечатныхФорм(ЕстьРазрешенныйВывод);
	УстановитьИмяПринтераВПодсказкеКнопкиПечать();
	УстановитьЗаголовокФормы();
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() И ЭтоПечатьКомплекта() Тогда
		Элементы.Копий.Заголовок = НСтр("ru = 'Копий комплекта'");
	КонецЕсли;
	
	ДополнительнаяИнформация = Новый Структура("Картинка, Текст", Новый Картинка, "");
	МассивСсылок = Новый Массив;
	Если ОбщегоНазначения.ЗначениеСсылочногоТипа(МассивСсылок) Тогда
		МассивСсылок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(МассивСсылок);
	КонецЕсли;
	Если ТипЗнч(МассивСсылок) = Тип("Массив")
		И МассивСсылок.Количество() > 0
		И ОбщегоНазначения.ЗначениеСсылочногоТипа(МассивСсылок[0]) Тогда
			Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие") Тогда 
				МодульЭлектронноеВзаимодействие = ОбщегоНазначения.ОбщийМодуль("ЭлектронноеВзаимодействие");
				МодульЭлектронноеВзаимодействие.ПриВыводеНавигационнойСсылкиВФормеОбъектаИБ(ДополнительнаяИнформация, МассивСсылок);
			КонецЕсли;
	КонецЕсли;
	Элементы.ДополнительнаяИнформация.Заголовок = СтроковыеФункцииКлиентСервер.ФорматированнаяСтрока(ДополнительнаяИнформация.Текст);
	Элементы.КартинкаИнформации.Картинка = ДополнительнаяИнформация.Картинка;
	Элементы.ГруппаДополнительнаяИнформация.Видимость = Не ПустаяСтрока(Элементы.ДополнительнаяИнформация.Заголовок);
	Элементы.КартинкаИнформации.Видимость = Элементы.КартинкаИнформации.Картинка.Вид <> ВидКартинки.Пустая;
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Элементы.КоманднаяПанельЛеваяЧасть.Видимость = Ложь;
		Элементы.КоманднаяПанельПраваяЧасть.Видимость = Ложь;
		Элементы.НастройкиПечатныхФорм.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
		Элементы.КнопкаОтправитьВсеДействия.КнопкаПоУмолчанию = Истина;
		Элементы.Справка.ТолькоВоВсехДействиях= Истина;
		Элементы.КнопкаИзменитьМакет.Видимость = Ложь;
	КонецЕсли;
	
	УправлениеПечатьюПереопределяемый.ПечатьДокументовПриСозданииНаСервере(ЭтотОбъект, Ложь, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)

	КолвоКлиентов = Клиент.Количество();
	Если КолвоКлиентов <2 Тогда
		Элементы.Договор.Видимость = Истина;
	Иначе
		Элементы.Договор.Видимость = Ложь;
		Договор = ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТЗСписокДокументовОтметкаПриИзменении(Элемент)
	
	ПересчетКолваОтмеченныхДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчетКолваОтмеченныхДокументов()
	
	ТекД = Элементы.ТЗТипыДокументов.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Отметка",Истина);
	ПараметрыОтбора.Вставить("ВидДокументаВСистеме",ТекД.ВидДокументаВСистеме);
	НайденныеСтроки = ТЗСписокДокументов.НайтиСтроки(ПараметрыОтбора);
	КолвоВыбранных = НайденныеСтроки.Количество();
	
	ТекД.ВыбраноДокументов = КолвоВыбранных;
	
КонецПроцедуры

&НаСервере
Функция СформироватьТекстПисьма(Параметры, СписокВложений)
	
	ТаблицаДокументов = Новый ТаблицаЗначений;
	ТаблицаДокументов.Колонки.Добавить("НаименованиеДокумента",,"Наименование документа");
	ТаблицаДокументов.Колонки.Добавить("Номер",,"Номер");
	ТаблицаДокументов.Колонки.Добавить("Дата",,"Дата");
	//получим и
	//Для каждого Команда Из Параметры.ПараметрКоманды Цикл
	Для каждого Команда Из СписокВложений Цикл
		нСтрока = ТаблицаДокументов.Добавить();
//Евросиб (Гонтаренко 10.05.21 #31614
		//Евросиб - АСуслов 19.08.2021 16:04:37 #0240702
		//(
		//Если НЕ Команда.Свойство("СсылкаДок") Тогда // ссылок нет при архивации содержимого, подробности пропускаем
		Если НЕ (Команда.Свойство("СсылкаДок") И ЗначениеЗаполнено(Команда.СсылкаДок)) Тогда // ссылок нет при архивации содержимого, подробности пропускаем
		//)
		//Евросиб - АСуслов 19.08.2021 16:04:40 #0240702
			нСтрока.НаименованиеДокумента = Команда.Представление;
			Продолжить;
		КонецЕсли;
//Евросиб )Гонтаренко 10.05.21 #31614
		//Евросиб - АСуслов 11.10.2021 15:06:33 #0244774 
		//(
		Если ТипЗнч(Команда.СсылкаДок) = Тип("ДокументСсылка.СчетФактураВыданный") 
			И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Команда.СсылкаДок, "Контрагент.ОсновнойПервичныйДокументПоУмолчанию") = Перечисления.ВидыПервичныхДокументов.УПД Тогда
			нСтрока.НаименованиеДокумента = "УПД";
		Иначе
			нСтрока.НаименованиеДокумента = Команда.СсылкаДок.Метаданные().Синоним;
		КонецЕсли; 
		//)
		//Евросиб - АСуслов 11.10.2021 15:06:45 #0244774 
//Евросиб Гудкова( 03.10.2020 Ticket№ 0208798 
		Если ТипЗнч(Команда.СсылкаДок) = Тип("ДокументСсылка.ПСЦ") Тогда
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Команда.СсылкаДок, "КлиентскийНомер, ДатаПСЦ");
			ЗначенияРеквизитов.ДатаПСЦ = Формат(ЗначенияРеквизитов.ДатаПСЦ, "ДФ=dd.MM.yyyy");
			нСтрока.Номер = ЗначенияРеквизитов.КлиентскийНомер;
			нСтрока.Дата = ЗначенияРеквизитов.ДатаПСЦ;
		ИначеЕсли ТипЗнч(Команда.СсылкаДок) = Тип("ДокументСсылка.АктСверкиВзаиморасчетов") Тогда 
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Команда.СсылкаДок, "Номер, Дата");
			ЗначенияРеквизитов.Дата = Формат(ЗначенияРеквизитов.Дата, "ДФ=dd.MM.yyyy");
			нСтрока.Номер = ЗначенияРеквизитов.Номер;
			нСтрока.Дата = ЗначенияРеквизитов.Дата;
		Иначе
// Евросиб Гудкова) 	
			Если ТипЗнч(Команда.СсылкаДок) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") И СтрНайти(Команда.Представление, "Акт") > 0 Тогда
				ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Команда.СсылкаДок, "НомерДляПечатиВознаграждение, НомерДляПечати, ДатаДокумента");
				ЗначенияРеквизитов.НомерДляПечати = ЗначенияРеквизитов.НомерДляПечатиВознаграждение;				
			// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
			ИначеЕсли ТипЗнч(Команда.СсылкаДок) = Тип("ДокументСсылка.РелизКлиента") Тогда
				РеквизитыРелиза = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Команда.СсылкаДок, "НомерРелиза, Дата");
				ЗначенияРеквизитов = Новый Структура;
				ЗначенияРеквизитов.Вставить("НомерДляПечати", РеквизитыРелиза.НомерРелиза);
				ЗначенияРеквизитов.Вставить("ДатаДокумента", РеквизитыРелиза.Дата);
			// Евросиб Фролов)	
			// Евросиб Фролов (28.04.2022 Task №50233
			ИначеЕсли ТипЗнч(Команда.СсылкаДок) = Тип("ДокументСсылка.Заявка") Тогда
				РеквизитыРелиза = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Команда.СсылкаДок, "Номер, Дата");
				ЗначенияРеквизитов = Новый Структура;
				ЗначенияРеквизитов.Вставить("НомерДляПечати", РеквизитыРелиза.Номер);
				ЗначенияРеквизитов.Вставить("ДатаДокумента", РеквизитыРелиза.Дата);	
			// Евросиб Фролов)
			Иначе
				ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Команда.СсылкаДок, "НомерДляПечати, ДатаДокумента");
			КонецЕсли; 
			//ЗначенияРеквизитов.НомерДляПечати = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ЗначенияРеквизитов.НомерДляПечати);
			ЗначенияРеквизитов.ДатаДокумента = Формат(ЗначенияРеквизитов.ДатаДокумента, "ДФ=dd.MM.yyyy");
			//ЗаполнитьЗначенияСвойств(нСтрока, ЗначенияРеквизитов);
			нСтрока.Номер = ЗначенияРеквизитов.НомерДляПечати;
			нСтрока.Дата = ЗначенияРеквизитов.ДатаДокумента;
		КонецЕсли; 
	КонецЦикла; 
	КодСтраницыХТМЛ = "<!DOCTYPE html><BODY>" + Символы.ПС + ПолучитьТаблицуХТМЛ(ТаблицаДокументов) + Символы.ПС + "</BODY></html>";
	Возврат КодСтраницыХТМЛ;
	
КонецФункции

Функция ПолучитьТаблицуХТМЛ(ТабЗначений,СтруктураПараметрыТаблицыХТМЛ = Неопределено) Экспорт
	
	//СтруктураПараметрыТаблицыХТМЛ
	//
	//Общие параметры:
	//СтруктураПараметрыТаблицыХТМЛ.ШиринаТаблицы - общая ширина таблица
	//СтруктураПараметрыТаблицыХТМЛ.ЦветШапки - цвет шапки таблицы пример "eadbaf"
	//СтруктураПараметрыТаблицыХТМЛ.ПунктПорядкуИспользуется - по умолчанию ЛОЖЬ
	//
	//Индивиуальные для каждой колонки:
	//СтруктураПараметрыТаблицыХТМЛ.Заголовок1 - заголовок для первой колонки, цифра на конце обознает номер колонки (не с нуля)
	//СтруктураПараметрыТаблицыХТМЛ.Ширина1 - ширина для первой колонки, цифра на конце обознает номер колонки (не с нуля)
	//СтруктураПараметрыТаблицыХТМЛ.Положение1 - отвечает за положение текста в колонке (по умол. лево), передовать "center" или "right"
	
	//ТабЗначений = Новый ТаблицаЗначений;
	МассивИменКолонок = Новый Массив;
	
	Если ТипЗнч(СтруктураПараметрыТаблицыХТМЛ) <> Тип("Структура") Тогда
		СтруктураПараметрыТаблицыХТМЛ = Новый Структура;
	КонецЕсли;
				
	КоличествоКолонок = ТабЗначений.Колонки.Количество();
	ПунктПорядкуИспользуется = ?(СтруктураПараметрыТаблицыХТМЛ.Свойство("ПунктПорядкуИспользуется"),СтруктураПараметрыТаблицыХТМЛ.ПунктПорядкуИспользуется,ЛОЖЬ);	
	
	Если КоличествоКолонок < 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
			
	ЦветШапки = ?(СтруктураПараметрыТаблицыХТМЛ.Свойство("ЦветШапки")," bgcolor=""#" + СтруктураПараметрыТаблицыХТМЛ.ЦветШапки + """","");
	ШиринаТаблицы = ?(СтруктураПараметрыТаблицыХТМЛ.Свойство("ШиринаТаблицы")," style=""width:" + СтруктураПараметрыТаблицыХТМЛ.ШиринаТаблицы + "px""",""); 
	ТаблицаХТМЛ = "<table border=""1"" cellpadding=""1"" cellspacing=""0"" " + ШиринаТаблицы + ">
				|<tbody>
				|<tr>";
	
	//Первым выводим столбик П/П если он задан в шапку
	Если ПунктПорядкуИспользуется Тогда
		ТаблицаХТМЛ = ТаблицаХТМЛ + "
				|<td" + ЦветШапки + " style=""width:30px"" align=""center"">п/п</td>";	
	КонецЕсли;
	
	//Формируем шапку
	Для Счетчик = 1 по КоличествоКолонок Цикл
		ИмяСвойстваШирина = "Ширина" + Счетчик;
		ШиринаСтолбца = ?(СтруктураПараметрыТаблицыХТМЛ.Свойство(ИмяСвойстваШирина)," style=""width:" + СтруктураПараметрыТаблицыХТМЛ[ИмяСвойстваШирина] + "px""","");
		ИмяКолонки = ТабЗначений.Колонки[Счетчик-1].Имя;
		ИмяСвойстваЗаголовок = "Заголовок" + Счетчик;
		ЗаголовокКолонки = ?(СтруктураПараметрыТаблицыХТМЛ.Свойство(ИмяСвойстваЗаголовок),СтруктураПараметрыТаблицыХТМЛ[ИмяСвойстваЗаголовок],ИмяКолонки);
		ТаблицаХТМЛ = ТаблицаХТМЛ + " 
				|<td" + ЦветШапки + ШиринаСтолбца + " align=""center"">" + ЗаголовокКолонки + "</td>";	
		МассивИменКолонок.Добавить(ИмяКолонки);
	КонецЦикла;
	ТаблицаХТМЛ = ТаблицаХТМЛ + "
				|</tr>";
	
	//Заполняем таблицу	
	ПунктПорядку = 0;
	Для каждого СтрокаТаблицы Из ТабЗначений Цикл
		ПунктПорядку = ПунктПорядку + 1;
		ТаблицаХТМЛ = ТаблицаХТМЛ + "
				|<tr>" + ?(ПунктПорядкуИспользуется, Символы.ПС + "<td align=""center"">" + ПунктПорядку + "</td>","") + "";
		Для Счетчик = 0 по КоличествоКолонок - 1 Цикл
			ИмяСвойстваПоложение = "Положение" + Строка(Счетчик + 1);
			Положение = " align=""" + ?(СтруктураПараметрыТаблицыХТМЛ.Свойство(ИмяСвойстваПоложение),СтруктураПараметрыТаблицыХТМЛ[ИмяСвойстваПоложение],"left") + """";
			ТаблицаХТМЛ = ТаблицаХТМЛ + "
				|<td " + Положение + ">" + СтрокаТаблицы[МассивИменКолонок[Счетчик]] + "</td>";			
		КонецЦикла;				
		ТаблицаХТМЛ = ТаблицаХТМЛ + "
				|</tr>";
	КонецЦикла;	
	
	ТаблицаХТМЛ = ТаблицаХТМЛ + " 
				|</tbody>
				|</table>";
	
	Возврат ТаблицаХТМЛ;

КонецФункции

//Евросиб Каблов 23.06.2021 ( Ticket#0225310
&НаКлиенте
Процедура ИнициализироватьПолеТабличнойФормыОфисногоДокумента(НастройкаПечатнойФормы)
	
	//Евросиб Каблов 17.01.2022 ( Ticket#0257283 На web-клиенте нет объекта СериализаторXDTO
	//ЧтениеXML = Новый ЧтениеXML;
	//ЧтениеXML.УстановитьСтроку(НастройкаПечатнойФормы.ОфисныеДокументы);
	//ФайлыОфисныхДокументов = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	#Если ВебКлиент Тогда
		ФайлыОфисныхДокументов = ЗначениеИзСтрокиXMLСервер(НастройкаПечатнойФормы.ОфисныеДокументы);
	#Иначе
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(НастройкаПечатнойФормы.ОфисныеДокументы);
		ФайлыОфисныхДокументов = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	#КонецЕсли	
	//Евросиб Каблов 17.01.2022 )
	
	Для Каждого ФайлДляЗаписи Из ФайлыОфисныхДокументов Цикл	
		//ИмяФайла = КаталогВременныхФайлов() + ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ФайлДляЗаписи.Значение);
		АдресВоВременномХранилище = ФайлДляЗаписи.Ключ;
		Прервать;
	КонецЦикла;
	
//Евросиб Литвинов 29.06.2021 ( Ticket#0218510 #35933 #36212
	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	Если ДанныеФайла <> Неопределено Тогда 
		ИмяФайла = КаталогВременныхФайлов() + НастройкаПечатнойФормы.ИмяВременногоФайлаПечатнойФормы;
		ДанныеФайла.Записать(ИмяФайла);
	  	ПолеФормыОфисногоДокумента = ПолучитьТекстПоляPDF(ИмяФайла);
	КонецЕсли;
//Евросиб Литвинов 29.06.2021 ) Ticket#0218510 #35933 #36212
	
КонецПроцедуры

//Евросиб Каблов 17.01.2022 Ticket#0257283 На web-клиенте нет объекта СериализаторXDTO
&НаСервереБезКонтекста
Функция ЗначениеИзСтрокиXMLСервер(СтрокаXML)
	
	Возврат ОбщегоНазначения.ЗначениеИзСтрокиXML(СтрокаXML);
	
КонецФункции

//Евросиб Литвинов 29.06.2021 ( Ticket#0218510 #35933 #36212
&НаСервере
Функция ПолучитьТекстПоляPDF(ПутьКВременномуФайлу)
	О = Обработки.ОткрытиеИПечатьPDF.Создать();
	Возврат О.ОткрытиеPDF(ПутьКВременномуФайлу);
КонецФункции

&НаСервере
Функция ПодготовитьПечатьPDFДокументСервер()
	О = Обработки.ОткрытиеИПечатьPDF.Создать();
	Возврат О.ИнициализироватьПечатьPDF();
КонецФункции

&НаКлиенте
Процедура НапечататьPDFДокумент(ИмяФайлаПечати)
	АдресВХУтилиты = ПодготовитьПечатьPDFДокументСервер(); 
	
	
	// Евросиб Фролов (07.10.2021 Ticket№ 40270
	//ИмяФайлаУтилиты = КаталогВременныхФайлов() + "PDFtoPrinter.exe"; закомментировал
	Шелл = Новый COMОбъект("WScript.Shell");
	ПеременнаяСреды = Шелл.ExpandEnvironmentStrings("%APPDATA%");
	ИмяФайлаУтилиты = ПеременнаяСреды + "\PDFtoPrinter\PDFtoPrinter.exe";
	// Евросиб Фролов)
	
	лФайл = Новый Файл(ИмяФайлаУтилиты);
	Если Не лФайл.Существует() Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХУтилиты);
		ДвоичныеДанные.Записать(ИмяФайлаУтилиты);
	КонецЕсли;
	
	// Евросиб Фролов (07.10.2021 Ticket№ 40270
	//"PDFtoPrinter.exe" filename.pdf "Name of Printer"
	//ЗапуститьПриложение(""""+ИмяФайлаУтилиты + """ """ + ИмяФайлаПечати +  """", , Истина);
	ФайловаяСистемаКлиент.ЗапуститьПрограмму(""""+ИмяФайлаУтилиты + """ """ + ИмяФайлаПечати +  """");
	// Евросиб Фролов)
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьPDFДокумент(Команда)
	ИмяФайлаПечати  = КаталогВременныхФайлов() + НастройкаТекущейПечатнойФормы().ИмяВременногоФайлаПечатнойФормы;
	лФайл = Новый Файл(ИмяФайлаПечати);
	Если лФайл.Существует() Тогда
		НапечататьPDFДокумент(ИмяФайлаПечати);
	Иначе
		Сообщить("Ошибка обработки файла данных печати, печать невозможна.");
	КонецЕсли;
		
КонецПроцедуры
//Евросиб Литвинов 29.06.2021 ) Ticket#0218510 #35933 #36212

//Евросиб Коханенко Н.А. 26.03.2025 (( #102319 
&НаКлиенте
Процедура СохранитьВПрисоединенныхФайлах(Команда) 
	
	Если Параметры.Свойство("ПараметрКоманды")
		И Параметры.ПараметрКоманды.Количество() > 0
		И ЗначениеЗаполнено(Параметры.ПараметрКоманды[0]) Тогда
		ВладелецФайлов = Параметры.ПараметрКоманды[0];
		НаличиеФайлаПФПСЦПоставщикаАвтоперевозки = КонтрольДоступностиДокументов_сервер.ПроверитьНаличиеФайлаПФПСЦПоставщикаАвтоперевозки(ВладелецФайлов);
		
		Если НаличиеФайлаПФПСЦПоставщикаАвтоперевозки Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Печатная форма Протокола (автоперевозки) уже сохранена в Присоединенных файлах. Удалите предыдущую версию файла перед сохранением новой.");
			Возврат;	
		КонецЕсли;
	КонецЕсли;
	
	ФорматыСохранения = Новый Массив;
	ФорматыСохранения.Добавить("PDF");
	
	ВыбранныйОбъект = Неопределено;
	
	РезультатВыбора = Новый Структура;
	РезультатВыбора.Вставить("УпаковатьВАрхив", Ложь);
	РезультатВыбора.Вставить("ФорматыСохранения", ФорматыСохранения);
	РезультатВыбора.Вставить("ВариантСохранения", "Присоединить");
	РезультатВыбора.Вставить("ПапкаДляСохранения", Неопределено);
	РезультатВыбора.Вставить("ОбъектДляПрикрепления", ВыбранныйОбъект);
	РезультатВыбора.Вставить("ПереводитьИменаФайловВТранслит", Ложь);
	
	ВыбранноеЗначение = Неопределено;
	
	ФайлыВоВременномХранилище = ПоместитьТабличныеДокументыВоВременноеХранилище(РезультатВыбора);
	ЗаписанныеОбъекты = ПрисоединитьПечатныеФормыКОбъекту(ФайлыВоВременномХранилище, ФайлыВоВременномХранилище[0].СсылкаДок);
	//Евросиб Шевченко А.В. US 110215 TA 124098 24.11.2025
	Если ТипЗнч(ВладелецФайлов) = Тип("ДокументСсылка.ПСЦПоставщика") Тогда
		Если Параметры.ИменаМакетов = "ПСЦПоставщикаАвтоперевозки" Тогда
			ВыполнитьЗаписьДопПараметра(ВладелецФайлов,ПредопределенноеЗначение("Перечисление.ВидПечатнойФормыПротоколаПСЦПоставщика.БезАдресовТерминалов"));
		ИначеЕсли Параметры.ИменаМакетов = "ПСЦПоставщикаАвтоперевозкиТерминалы" Тогда
			ВыполнитьЗаписьДопПараметра(ВладелецФайлов,ПредопределенноеЗначение("Перечисление.ВидПечатнойФормыПротоколаПСЦПоставщика.САдресамиТерминалов"));
		КонецЕсли;
	КонецЕсли;
	//Евросиб Шевченко А.В. US 110215 TA 124098 24.11.2025
	Если ЗаписанныеОбъекты.Количество() > 0 Тогда
		ОповеститьОбИзменении(ТипЗнч(ЗаписанныеОбъекты[0]));
	КонецЕсли;
	Для Каждого ЗаписанныйОбъект Из ЗаписанныеОбъекты Цикл
		Оповестить("Запись_Файл", Новый Структура, ЗаписанныйОбъект);
	КонецЦикла;
	ПоказатьОповещениеПользователя(, , НСтр("ru = 'Сохранение завершено'"), БиблиотекаКартинок.Информация32);
	
	Если ЗначениеЗаполнено(ВладелецФайлов) Тогда
		Оповестить("СписокПрисоединенныхФайловПСЦПоставщикаИзменен", Новый Структура("ВладелецФайлов", ВладелецФайлов), ЗаписанныйОбъект);
	КонецЕсли;
	
КонецПроцедуры //Евросиб Коханенко Н.А. 26.03.2025 )) #102319

&НаСервере
Процедура ВыполнитьЗаписьДопПараметра(ПСЦСсылка,ВидПечатнойФормыПротоколаПСЦПоставщика) //Евросиб Шевченко А.В. US 110215 TA 124098 24.11.2025
	
	РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьВидПечатнойФормыПротоколаПСЦПоставщика(ПСЦСсылка,ВидПечатнойФормыПротоколаПСЦПоставщика);
	
КонецПроцедуры	

//Евросиб Литвинов 29.06.2021 ) Ticket#0218510 #35933 #36212

#КонецОбласти
