
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДокОснование = ПолучитьДокОснование(ПараметрКоманды);
	
	ОткрытьФорму("ОбщаяФорма.СтруктураПодчиненности",Новый Структура("ОбъектОтбора", ДокОснование),
			ПараметрыВыполненияКоманды.Источник,
			ПараметрыВыполненияКоманды.Источник.КлючУникальности,
			ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры

&НаСервере
Функция ПолучитьДокОснование(ТекДок)
	
	Док = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПроцессСогласования.ДокументСогласования КАК ДокументСогласования
	               |ИЗ
	               |	Справочник.ПроцессСогласования КАК ПроцессСогласования
	               |ГДЕ
	               |	ПроцессСогласования.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",ТекДок);
	Док = Запрос.Выполнить().Выгрузить()[0].ДокументСогласования;
	
	Возврат Док;
	
КонецФункции