
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Справочник.Локации.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	Для каждого ЛокацияСсылка Из ПараметрКоманды Цикл         
		ПолучитьКоординатыНаСервере(ЛокацияСсылка);
	КонецЦикла;
КонецПроцедуры                                   

&НаСервере
Процедура ПолучитьКоординатыНаСервере(ЛокацияСсылка)
	РеквизитыЛокации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЛокацияСсылка, "Тип, НеЗаполнятьПоДаннымГеокодера, ПометкаУдаления");
	Если РеквизитыЛокации.Тип = Справочники.ТипыЛокаций.Терминал Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("%1: Операция недоступна для типа локации «Терминал»", ЛокацияСсылка));
		Возврат;
	КонецЕсли;
	Если РеквизитыЛокации.НеЗаполнятьПоДаннымГеокодера Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("%1: Для выполнения операции необходимо снять признак «Не заполнять по данным геокодера»", ЛокацияСсылка));
		Возврат;
	КонецЕсли;
	Если РеквизитыЛокации.ПометкаУдаления Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("%1: Для выполнения операции необходимо снять пометку на удаление", ЛокацияСсылка));
		Возврат;
	КонецЕсли;
	//КоординатыЛокацииГеокодер = ГеокодированиеСервер.ПолучитьКоординатыЛокацииЧерезГеокодер(ЛокацияСсылка);
	СтруктураРезультатаКоординаты = ГеокодированиеСервер.ПолучитьКоординатыЛокацииЧерезГеокодер(ЛокацияСсылка);
	КоординатыЛокацииГеокодер = СтруктураРезультатаКоординаты.СтруктураКоординатыЛокации;
	//РегионЛокацииГеокодер = ГеокодированиеСервер.ПолучитьСтруктуруЗаполненияРегионаУЗарубежнойЛокации(ЛокацияСсылка);
	СтруктураРезультатаРегиона = ГеокодированиеСервер.ПолучитьСтруктуруЗаполненияРегионаУЗарубежнойЛокации(ЛокацияСсылка);
	Если СтруктураРезультатаРегиона <> Неопределено Тогда
		РегионЛокацииГеокодер = СтруктураРезультатаРегиона.СтруктураРегиона;
	Иначе
		РегионЛокацииГеокодер = Неопределено;
	КонецЕсли;
	
	СтруктураКоординатыТекущие = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЛокацияСсылка, "Долгота, Широта, Наименование, ЛокацияВышестоящегоУровня");
	НеобходимаЗаписьОбъекта = Ложь;                                                                    
	ЛокацияОбъект = Неопределено;
	Если НЕ ОбщегоНазначения.КоллекцииИдентичны(КоординатыЛокацииГеокодер, СтруктураКоординатыТекущие) Тогда
		ЛокацияОбъект = ЛокацияСсылка.ПолучитьОбъект();
		ЗаполняемыеРеквизиты = Новый Массив;
		Если ЗначениеЗаполнено(КоординатыЛокацииГеокодер.Долгота) Тогда
			ЗаполняемыеРеквизиты.Добавить("Долгота");	
		КонецЕсли;
		Если ЗначениеЗаполнено(КоординатыЛокацииГеокодер.Широта) Тогда
			ЗаполняемыеРеквизиты.Добавить("Широта");	
		КонецЕсли;
		Если ЗначениеЗаполнено(КоординатыЛокацииГеокодер.Наименование) Тогда
			ЗаполняемыеРеквизиты.Добавить("Наименование");	
		КонецЕсли;
		Если ЗначениеЗаполнено(КоординатыЛокацииГеокодер.ЛокацияВышестоящегоУровня) Тогда 
			ЗаполняемыеРеквизиты.Добавить("ЛокацияВышестоящегоУровня");	
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ЛокацияОбъект, КоординатыЛокацииГеокодер,СтрСоединить(ЗаполняемыеРеквизиты,","));
		НеобходимаЗаписьОбъекта = Не ЗаполняемыеРеквизиты.Количество() = 0;
	КонецЕсли;                           
	Если РегионЛокацииГеокодер <> Неопределено Тогда
		Если (ЗначениеЗаполнено(РегионЛокацииГеокодер.РегионСсылка)
			И РегионЛокацииГеокодер.РегионСсылка <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЛокацияСсылка, "ЛокацияВышестоящегоУровня"))
			Тогда
			Если ЛокацияОбъект = Неопределено  Тогда
				ЛокацияОбъект = ЛокацияСсылка.ПолучитьОбъект();
			КонецЕсли;
			ЛокацияОбъект.ЛокацияВышестоящегоУровня = РегионЛокацииГеокодер.РегионСсылка;
			НеобходимаЗаписьОбъекта = Истина;
		ИначеЕсли РегионЛокацииГеокодер.СтруктураЛокацииРегион <> Неопределено Тогда
			//создаем регион
			ЛокацияРегионОбъект = Справочники.Локации.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(ЛокацияРегионОбъект, РегионЛокацииГеокодер.СтруктураЛокацииРегион);
			//ЛокацияРегионОбъект = Справочники.ТипыЛокаций.Регион;
			ЛокацияРегионОбъект.Записать();
			Если ЛокацияОбъект = Неопределено Тогда
				ЛокацияОбъект = ЛокацияСсылка.ПолучитьОбъект();
			КонецЕсли;
			ЛокацияОбъект.ЛокацияВышестоящегоУровня = ЛокацияРегионОбъект.Ссылка;
			НеобходимаЗаписьОбъекта = Истина;
		КонецЕсли;
	КонецЕсли;
	Если НеобходимаЗаписьОбъекта Тогда
		ГеокодированиеСервер.ДозаполнитьЛогГеокодераСтатусами(СтруктураРезультатаКоординаты.ИдентификаторЗапроса, Перечисления.СтатусыОбработкиЗапросаГеокодера.ОтветПолученЗаписан, ЛокацияСсылка);
		ЛокацияОбъект.Записать();
	КонецЕсли;
КонецПроцедуры
