
&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для Каждого стр Из ТаблицаРейсов Цикл
		Стр.Отметка = Истина;
	КонецЦикла;
	
	ТекД = Элементы.ТаблицаЗаявок.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекД.Переназначена = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	Для Каждого стр Из ТаблицаРейсов Цикл
		Стр.Отметка = Ложь;
	КонецЦикла;
	ТекД = Элементы.ТаблицаЗаявок.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекД.Переназначена = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗаявокПриАктивизацииСтроки(Элемент)
	ТекД = Элементы.ТаблицаЗаявок.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Элементы.ТаблицаРейсов.ОтборСтрок = Новый ФиксированнаяСтруктура("Заявка",ТекД.Заявка);
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	// привязать к другому рейсу заявку. Делаем цикл сначала по верхней таблице, 
	// чтобы не перезаписывать заявку несколько раз, если ее переназначили на несколько рейсов
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Переназначена",Истина);
	НайденныеСтроки = ТаблицаЗаявок.НайтиСтроки(ПараметрыОтбора);
	Для каждого Стр из НайденныеСтроки Цикл
		ПараметрыОтбора2 = Новый Структура;
		ПараметрыОтбора2.Вставить("Заявка",Стр.Заявка);
		ПараметрыОтбора2.Вставить("Отметка",Истина);
		НайденныеСтроки2 = ТаблицаРейсов.НайтиСтроки(ПараметрыОтбора2);
		МассивРейсов = Новый Массив;
		Для Каждого Элем Из НайденныеСтроки2 Цикл
			МассивРейсов.Добавить(Элем.РейсЖД);
		КонецЦикла;
		
		ИзменитьЗаявку(Стр.Заявка,МассивРейсов);
		
		ЗаписатьКТКВСвязанныеОтправки_сервер(Стр.Заявка,МассивРейсов);
		
	КонецЦикла;
	
	ОповеститьОВыборе(НайденныеСтроки);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаписатьКТКВСвязанныеОтправки_сервер(Заявка,Отправки)
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ЗаявкаСоставУслуги.НомерКТК КАК НомерКТК
	              |ИЗ
	              |	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	              |ГДЕ
	              |	ЗаявкаСоставУслуги.Ссылка = &Ссылка
	              |	И НЕ ЗаявкаСоставУслуги.НомерКТК = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяССылка)";
	Запрос.УстановитьПараметр("Ссылка", Заявка);
	Ответ = Запрос.Выполнить().Выбрать();
	
	СписокКТК = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерКТК");

	Для каждого Стр из Отправки Цикл
		
		Отправки_сервер.ПривязатьКТККОтправке(Стр, СписокКТК);
		
	КонецЦикла;
	
КонецФункции
&НаСервереБезКонтекста
Процедура ОтменитьЗаявкуИСоздатьЗадачуНаПереназначениеРейса(Заявка)
	
	МассивУдаляемыхСостояний = Новый Массив;
	СтатусПродажника = ПредопределенноеЗначение("Справочник.Состояния.ОтменаРейсаПереносЗаявокКлиентов");
	
	ЗаявкаОбъект = Заявка.ПолучитьОбъект();
	Для каждого Стр из ЗаявкаОбъект.Состояния Цикл
		Если Стр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Новый") ИЛИ Стр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение") Тогда
			Стр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Отклонен");
		КонецЕсли;
		Если Стр.Состояние = СтатусПродажника Тогда МассивУдаляемыхСостояний.Добавить(Стр); КонецЕсли;
	КонецЦикла;
	
	Для каждого УдСост из МассивУдаляемыхСостояний Цикл
		ЗаявкаОбъект.Состояния.Удалить(УдСост);
	КонецЦикла;
	
	НСтр = ЗаявкаОбъект.Состояния.Добавить();
	НСтр.Состояние = СтатусПродажника;
	ГруппаПродажника = ЗаявкаОбъект.Состояния[0].Исполнитель;
	НСтр.Исполнитель = ГруппаПродажника;
	НСтр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение");
	НСтр.НормативИсполненияСМоментаСоздания = 2;
	ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьЗаявку(ТекущаяЗаявка,СписокРейсов)
	
	ПолучОб = ТекущаяЗаявка.ПолучитьОбъект();
	ПолучОб.ПереченьРейсов.Очистить();
	Для Каждого Элем Из СписокРейсов Цикл
		НовСтр = ПолучОб.ПереченьРейсов.Добавить();
		НовСтр.Рейс = Элем;
		НовСтр.Продукт = Элем.Продукт;
	КонецЦикла;
	
	ПолучОб.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("СписокСвязанныхЗаявок") И 
		Параметры.Свойство("ТекущаяОтправка") Тогда
		ТекСписок = Параметры.СписокСвязанныхЗаявок;
		ТекущаяОтправка = Параметры.ТекущаяОтправка;
		Для Каждого Элем Из ТекСписок Цикл
			НовСтр = ТаблицаЗаявок.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр,Элем);
			НовСтр.Заявка = Элем.Ссылка;
			
			// добавить возможные рейсы (для каждой заявки!)
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	РейсыЖД.Ссылка КАК РейсЖД,
			               |	РейсыЖД.ПунктОтправления КАК ПунктОтправления,
			               |	РейсыЖД.ПунктНазначения КАК ПунктНазначения,
			               |	РейсыЖД.ДатаОтправления КАК ДатаОтправления,
			               |	РейсыЖД.ДатаПрибытия КАК ДатаПрибытия,
			               |	&Заявка КАК Заявка,
			               |	РейсыЖД.Продукт КАК Продукт
			               |ИЗ
			               |	Справочник.РейсыЖД КАК РейсыЖД
			               |ГДЕ
			               |	НЕ РейсыЖД.ПометкаУдаления
			               |	И НЕ РейсыЖД.ПредыдущаяОтправка = &ТекущаяОтправка
			               |	И НЕ РейсыЖД.Ссылка = &ТекущаяОтправка
			               |	И НЕ РейсыЖД.ДатаОтправления = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			               |	И РейсыЖД.ДатаОтправления >= &ТекДата
			               |	И НЕ РейсыЖД.ТехРейс
			               |	И НЕ РейсыЖД.РейсОтменен
			               |	И РейсыЖД.ПунктОтправления = &ПунктОтправления
			               |	И РейсыЖД.ПунктНазначения = &ПунктНазначения";
			Запрос.УстановитьПараметр("ТекущаяОтправка", ТекущаяОтправка);
			Запрос.УстановитьПараметр("ПунктОтправления", ТекущаяОтправка.ПунктОтправления);
			Запрос.УстановитьПараметр("ПунктНазначения", ТекущаяОтправка.ПунктНазначения);
			Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
			Запрос.УстановитьПараметр("Заявка", Элем.Ссылка);
			ТЗ = Запрос.Выполнить().Выгрузить();
			
			Для Каждого Стр ИЗ ТЗ Цикл
				НовРейс = ТаблицаРейсов.Добавить();
				ЗаполнитьЗначенияСвойств(НовРейс,Стр);
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )



&НаКлиенте
Процедура ТаблицаРейсовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекД = Элементы.ТаблицаЗаявок.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекД2 = Элементы.ТаблицаРейсов.ТекущиеДанные;
	Если ТекД2 = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Заявка",ТекД.Заявка);
	ПараметрыОтбора.Вставить("Отметка",Истина);
	НайденныеСтроки = ТаблицаРейсов.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество()>0 тогда
		ТекД.Переназначена = Истина;
	Иначе
		ТекД.Переназначена = Ложь;
	КонецЕсли;
	// отмечен может быть только один рейс для распределения одной заявки
	Для Каждого Стр Из НайденныеСтроки Цикл
		Если НЕ Стр.РейсЖД = ТекД2.РейсЖД Тогда
			Стр.Отметка = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
