Функция НайтиСоздатьНоменклатуруПоставщика(СтрокаНаименования, Артикул = "", Идентификатор = "") Экспорт
	
	Результат = Справочники.НоменклатураПоставщиков.НайтиПоНаименованию(СтрокаНаименования);
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		НЭлемент = Справочники.НоменклатураПоставщиков.СоздатьЭлемент();
		НЭлемент.Наименование = СтрокаНаименования;
		НЭлемент.Артикул = Артикул;
		НЭлемент.Идентификатор = Идентификатор;
		НЭлемент.Записать();
		Результат = НЭлемент.Ссылка;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции
