
Функция getProductSchedule(org_inn, org_kpp, date_from, date_to)
	
	таблицаСоотвПродуктов = ВебСервисы_сервер.ПолучитьРасписаниеПродуктов(org_inn, org_kpp, date_from, date_to);
	
	Результат = "<response>";
	Результат = результат + Символы.ПС + "<responseType>productList</responseType>";
	Результат = результат + Символы.ПС + "<productList>";
	
	Для каждого Стр из таблицаСоотвПродуктов Цикл
		Результат = результат + Символы.ПС + Символы.Таб + "<productItem КП="""+Стр.КП+""" ДатаОтправления="""+Стр.ДатаОтправления+""" ДатаПрибытия="""+Стр.ДатаПрибытия+""" Наименование="""+Стр.Наименование+""" ОтправлениеКодРЖД="""+Стр.ОтправлениеКодРЖД+""" ОтправлениеКодСист="""+Стр.ОтправлениеКодСист+""" ОтправлениеНаименование="""+Стр.ОтправлениеНаименование+""" ПрибытиеКодРЖД="""+Стр.ПрибытиеКодРЖД+""" ПрибытиеКодСист="""+Стр.ПрибытиеКодСист+""" ПрибытиеНаименование="""+Стр.ПрибытиеНаименование+""" СлотовВсего="""+Стр.СлотовВсего+""" СлотовЗанято="""+Стр.СлотовЗанято+""" />";
	КонецЦикла;
	
	Результат = результат + Символы.ПС + "</productList>";
	Результат = результат + Символы.ПС + "</response>";
	
	Возврат Результат;
	
КонецФункции

Функция getLocationList(searchString)
	
	таблицаСоответствующихЛокаций = ВебСервисы_сервер.ПолучитьМассивСтруктурЛокацийПоСтрокеПоиска(searchString);
	
//Евросиб Гудкова( 05.10.2020
	возврат ОбщегоНазначения.ЗначениеВСтрокуXML(таблицаСоответствующихЛокаций);
	//Результат = "<response>";
	//Результат = результат + Символы.ПС + "<responseType>locationList</responseType>";
	//Результат = результат + Символы.ПС + "<locationList>";
	//
	//Для каждого Стр из таблицаСоответствующихЛокаций Цикл
	//	Результат = результат + Символы.ПС + Символы.Таб + "<locationItem code="""+Стр.code+""" name="""+Стр.name+""" zdCode="""+Стр.zdCode+""" />";
	//КонецЦикла;
	//
	//Результат = результат + Символы.ПС + "</locationList>";
	//Результат = результат + Символы.ПС + "</response>";
	//
	//Возврат Результат;
// Евросиб Гудкова) 	
	
КонецФункции

Функция getISOList(searchString)
	
	таблицаСоответствующихISO = ВебСервисы_сервер.ПолучитьМассивСтруктурisoПоСтрокеПоиска(searchString);
	
	Результат = "<response>";
	Результат = результат + Символы.ПС + "<responseType>isoList</responseType>";
	Результат = результат + Символы.ПС + "<isoList>";
	
	Для каждого Стр из таблицаСоответствующихISO Цикл
		Результат = результат + Символы.ПС + Символы.Таб + "<isoItem code="""+Стр.code+""" name="""+Стр.name+""" />";
	КонецЦикла;
	
	Результат = результат + Символы.ПС + "</isoList>";
	Результат = результат + Символы.ПС + "</response>";
	
	Возврат Результат;
	
КонецФункции

Функция getTaraList(searchString)
	
	таблицаСоответствующихТара = ВебСервисы_сервер.ПолучитьМассивСтруктурtaraПоСтрокеПоиска(searchString);
	
	Результат = "<response>";
	Результат = результат + Символы.ПС + "<responseType>taraList</responseType>";
	Результат = результат + Символы.ПС + "<taraList>";
	
	Для каждого Стр из таблицаСоответствующихТара Цикл
		Результат = результат + Символы.ПС + Символы.Таб + "<taraItem code="""+Стр.code+""" name="""+Стр.name+""" />";
	КонецЦикла;
	
	Результат = результат + Символы.ПС + "</taraList>";
	Результат = результат + Символы.ПС + "</response>";
	
	Возврат Результат;
	
КонецФункции

Функция postRequest(other_fio, other_rez, other_title, other_inn, other_tel, other_email, from_datetime, to_datetime, from_location, to_location, gruzlist, uslugilist, usloviaperevozki, cnt_eurosibowner, cnt_isotype, other_longdescription, makeOrder)
	
	ФИО = other_fio;
	Резидент = ?(Строка(other_rez) = "1", Истина, Ложь);
	НазваниеКонтрагента = other_title;
	ИННКонтрагента = "";
	Попытка
		ИННКонтрагента = Число(other_inn);
	Исключение
	КонецПопытки;
	КонтактныйТелефон = other_tel;
	КонтактнаяПочта = other_email;
	Отправка_дата = from_datetime; //ЗагрузкаВнешнихИсточников_сервер.ПреобразоватьДатуВ1С(from_datetime, 2);
	Прибытие_дата = to_datetime; //ЗагрузкаВнешнихИсточников_сервер.ПреобразоватьДатуВ1С(to_datetime, 2);
	Отправка_локация = Справочники.Локации.НайтиПоКоду(from_location);
	Прибытие_локация = Справочники.Локации.НайтиПоКоду(to_location);
	Груз = Грузы_сервер.НайтиСоздатьГруз(gruzlist);
	КонтейнерЕвросиба = ?(Строка(cnt_eurosibowner) = "1", Истина, Ложь);
	
	таблицаКонтейнерТипов = Новый Массив;
	Для каждого Стр1 из СтрРазделить(cnt_isotype, ";", Ложь) Цикл
		ПодМассив = СтрРазделить(Стр1, "=", Ложь);
		Если ПодМассив.Количество() = 2 Тогда
			ТипКТ = Справочники.ТипоразмерыТЕ.НайтиПоРеквизиту("КодISO", ПодМассив[0]);
			КоличествоКТ = 0;
			Попытка
				КоличествоКТ = Число(ПодМассив[1]);
			Исключение
			КонецПопытки;
			таблицаКонтейнерТипов.Добавить(Новый Структура("ТипКТ, КоличествоКТ", ТипКТ, КоличествоКТ));
		КонецЕсли;
	КонецЦикла;
	
	ОписаниеЗаявки = other_longdescription;
	
	ЗапросСсылка = ВебСервисы_сервер.СоздатьЗапросКлиента(ФИО, Резидент, НазваниеКонтрагента, ИННКонтрагента, КонтактныйТелефон, КонтактнаяПочта, Отправка_дата, Прибытие_дата, Отправка_локация, Прибытие_локация, Груз, КонтейнерЕвросиба, таблицаКонтейнерТипов, ОписаниеЗаявки);
	РезультатMakeOrder = "";
	
	Если ЗначениеЗаполнено(makeOrder) Тогда
		Рез = СтрРазделить(makeOrder, ";", Ложь);
		НомерКалькуляции = Рез[0];
		КоличествоКонтейнеров = 1;
		Попытка
			КоличествоКонтейнеров = Число(Рез[1]);
		Исключение
		КонецПопытки;
		МассивДопУслуг = Новый Массив;
		Для Сч = 2 По Рез.Количество()-1 Цикл
			МассивДопУслуг.Добавить(Рез[Сч]);
		КонецЦикла;
		
		РезультатMakeOrder = ВебСервисы_сервер.СоздатьДоговорЗаявку(ЗапросСсылка, НомерКалькуляции, КоличествоКонтейнеров, МассивДопУслуг);
		
	КонецЕсли;
	
	Результат = "<response>";
	Результат = результат + Символы.ПС + "<responseType>makeRequest</responseType>";
	Результат = результат + Символы.ПС + "<createdDocumentId number="""+ЗапросСсылка.Номер+""" />";
	Если ЗначениеЗаполнено(makeOrder) Тогда
		Результат = результат + Символы.ПС + "<createOrderStatus status="""+РезультатMakeOrder+""" />";
	КонецЕсли;
	
	
	Результат = результат + Символы.ПС + "</response>";
	
	Возврат Результат;
	
КонецФункции

Функция calculateDelivery(from_location, to_location, from_dateTime, cargo, weight, cont_size, cont_owner)
	
	ТекстЗапроса = "из " + from_location + " для " + to_location + " от даты " + from_dateTime + " груз " + cargo + " вес " + weight + " размер " + cont_size + " владелец " + cont_owner;
	ЗаписьЖурналаРегистрации("Запрос с веб сайта",,,, ТекстЗапроса);
	
	//Отправка_локация = Локации_сервер.НайтиСтанциюПоНеполномуКоду(from_location);
	//Прибытие_локация = Локации_сервер.НайтиСтанциюПоНеполномуКоду(to_location);
	
	Отправка_локация = Справочники.Локации.НайтиПоКоду(from_location);
	Прибытие_локация = Справочники.Локации.НайтиПоКоду(to_location);
	
	Отправка_дата = from_datetime;
	Груз = Грузы_сервер.НайтиСоздатьГруз(cargo);
	ВесГруза = 0;
	Попытка
		ВесГруза = Число(weight);
	Исключение
	КонецПопытки;
	РазмерКТК = Число(cont_size);
	КонтейнерЕвросиба = ?(Строка(cont_owner) = "1", Истина, Ложь);
	
	КалькуляцияСсылка = ВебСервисы_сервер.НайтиПосчитатьКалькуляцию(Отправка_локация, Прибытие_локация, Отправка_дата, груз, ВесГруза, РазмерКТК, КонтейнерЕвросиба);
	
	Результат = "<response>";
	Результат = результат + Символы.ПС + "<responseType>calculation</responseType>";
	
	Если ЗначениеЗаполнено(КалькуляцияСсылка) Тогда
		Результат = результат + Символы.ПС + "<found>1</found>";
		Результат = результат + Символы.ПС + "<documentId>"+КалькуляцияСсылка.Номер+"</documentId>";
		Результат = результат + Символы.ПС + "<totalCost>"+Формат(?(cont_size = 20, КалькуляцияСсылка.ММ_ИтогоСтавка20, КалькуляцияСсылка.ММ_ИтогоСтавка), "ЧГ=")+"</totalCost>";
		Результат = результат + Символы.ПС + "<serviceList>";
		Для каждого Стр из КалькуляцияСсылка.ЖД_УслугиВнеСтавки Цикл
			Результат = результат + Символы.ПС + "<service code="""+Стр.Услуга.Код+""" title="""+Стр.Услуга+""" cost="""+Формат(?(cont_size = 20, Стр.Ставка20, стр.Ставка40), "ЧГ=")+""" />";
		КонецЦикла;
		Результат = результат + Символы.ПС + "</serviceList>";
	Иначе
		Результат = результат + Символы.ПС + "<found>0</found>";
	КонецЕсли;
	
	Результат = результат + Символы.ПС + "</response>";
	
	Возврат Результат;
	
КонецФункции

