///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Пересчитывает сумму из текущей валюты в новую валюту по параметрам их курсов. 
// Параметры курсов валют можно получить функцией РаботаСКурсамиВалют.ПолучитьКурсВалюты.
//
// Параметры:
//   Сумма                  - Число     - сумма, которую следует пересчитать.
//
//   ПараметрыТекущегоКурса - Структура - параметры курса валюты, из которой надо пересчитать.
//    * Валюта    - СправочникСсылка.Валюты - ссылка пересчитываемой валюты.
//    * Курс      - Число - курс пересчитываемой валюты.
//    * Кратность - Число - кратность пересчитываемой валюты.
//
//   ПараметрыНовогоКурса   - Структура - параметры курса валюты, в  которую надо пересчитать.
//    * Валюта    - СправочникСсылка.Валюты - ссылка валюты, в которую идет пересчет.
//    * Курс      - Число - курс валюты, в которую идет пересчет.
//    * Кратность - Число - кратность валюты, в которую идет пересчет.
//
// Возвращаемое значение: 
//   Число - Сумма, пересчитанная по новому курсу.
//
//Функция ПересчитатьПоКурсу(Сумма, ПараметрыТекущегоКурса, ПараметрыНовогоКурса, НеОкруглятьРезультат = Ложь) Экспорт
//ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, добавлен параметр "ОкруглениеКурса"
Функция ПересчитатьПоКурсу(Сумма, ПараметрыТекущегоКурса, ПараметрыНовогоКурса, НеОкруглятьРезультат = Ложь, ОкруглениеКурса = Неопределено) Экспорт
	Если ПараметрыТекущегоКурса.Валюта = ПараметрыНовогоКурса.Валюта
		Или (ПараметрыТекущегоКурса.Курс = ПараметрыНовогоКурса.Курс 
			И ПараметрыТекущегоКурса.Кратность = ПараметрыНовогоКурса.Кратность) Тогда
		
		Возврат Сумма;
	КонецЕсли;
	
	Если ПараметрыТекущегоКурса.Курс = 0
		Или ПараметрыТекущегоКурса.Кратность = 0
		Или ПараметрыНовогоКурса.Курс = 0
		Или ПараметрыНовогоКурса.Кратность = 0 Тогда
		
		Возврат 0;
	КонецЕсли;
	
	//Окр((Сумма * ПараметрыТекущегоКурса.Курс * ПараметрыНовогоКурса.Кратность) 
	//	/ (ПараметрыНовогоКурса.Курс * ПараметрыТекущегоКурса.Кратность), 2);
	Результат = (Сумма * ПараметрыТекущегоКурса.Курс * ПараметрыНовогоКурса.Кратность) 
				/ (ПараметрыНовогоКурса.Курс * ПараметрыТекущегоКурса.Кратность);
				
	//ДИТ, Беляев СЮ, BUG 76518 / TA 76520, 25-10-2023, начало
	//Если ОкруглениеКурса <> Неопределено И ТипЗнч(ОкруглениеКурса) = Тип("Число") Тогда
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0371961, 29-10-2024, начало
	ОднаИзВалютРубль = ПараметрыТекущегоКурса.Курс = 1 ИЛИ ПараметрыНовогоКурса.Курс = 1;
	Если ОкруглениеКурса <> Неопределено И ТипЗнч(ОкруглениеКурса) = Тип("Число") И НЕ ОднаИзВалютРубль Тогда
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0371961, 29-10-2024, конец
		ЗначениеКурса = ОКР((ПараметрыТекущегоКурса.Курс * ПараметрыНовогоКурса.Кратность) 
							/ (ПараметрыНовогоКурса.Курс * ПараметрыТекущегоКурса.Кратность), ОкруглениеКурса );
		Результат = Сумма * ЗначениеКурса;
	КонецЕсли;
	//ДИТ, Беляев СЮ, BUG 76518 / TA 76520, 25-10-2023, конец
	
	Если НеОкруглятьРезультат = Ложь Тогда
		Результат = Окр(Результат, 2);
	КонецЕсли; 
	Возврат Результат;
КонецФункции

#Область УстаревшиеПроцедурыИФункции

// Устарела. Следует использовать функцию ПересчитатьПоКурсу.
//
// Пересчитывает сумму из валюты ВалютаНач по курсу ПоКурсуНач 
// в валюту ВалютаКон по курсу ПоКурсуКон.
//
// Параметры:
//   Сумма          - Число - Сумма, которую следует пересчитать.
//   ВалютаНач      - СправочникСсылка.Валюты - Валюта, из которой надо пересчитать.
//   ВалютаКон      - СправочникСсылка.Валюты - Валюта, в  которую надо пересчитать.
//   ПоКурсуНач     - Число - Курс, из которого надо пересчитать.
//   ПоКурсуКон     - Число - Курс, в  который  надо пересчитать.
//   ПоКратностьНач - Число - Кратность, из которой надо пересчитать (по умолчанию = 1).
//   ПоКратностьКон - Число - Кратность, в  которую надо пересчитать (по умолчанию = 1).
//
// Возвращаемое значение: 
//   Число - Сумма, пересчитанная в другую валюту.
//
Функция ПересчитатьИзВалютыВВалюту(Сумма, ВалютаНач, ВалютаКон, ПоКурсуНач, ПоКурсуКон, 
	ПоКратностьНач = 1, ПоКратностьКон = 1) Экспорт
	
	Возврат ПересчитатьПоКурсу(
		Сумма, 
		Новый Структура("Валюта, Курс, Кратность", ВалютаНач, ПоКурсуНач, ПоКратностьНач),
		Новый Структура("Валюта, Курс, Кратность", ВалютаКон, ПоКурсуКон, ПоКратностьКон));
	
КонецФункции

#КонецОбласти

#КонецОбласти
