//Евросиб ( Литвинов 21.01.2021 #30025
Процедура УстановитьАктуальноеЗначениеИсторииНаименований(Наименования, ИсторияНаименований) Экспорт
	
	КоличествоЗаписей = ИсторияНаименований.Количество();
	
	Если КоличествоЗаписей > 0 Тогда
		
		ИсторияНаименований.Сортировать("Период");
		АктуальнаяЗаписьИстории = ИсторияНаименований[КоличествоЗаписей - 1];
		АктуальнаяЗаписьИстории.НаименованиеСокращенное 	= Наименования.НаименованиеСокращенное;
		АктуальнаяЗаписьИстории.НаименованиеПолное 			= Наименования.НаименованиеПолное;
		АктуальнаяЗаписьИстории.НаименованиеСокращенноеАнгл = Наименования.НаименованиеСокращенноеАнгл;
		АктуальнаяЗаписьИстории.НаименованиеПолноеАнгл 		= Наименования.НаименованиеПолноеАнгл;
		АктуальнаяЗаписьИстории.НаименованиеДляНакладной 	= Наименования.НаименованиеДляНакладной;
		//Евросиб - АСуслов 06.09.2023 12:51:15 #74705
		//(
		АктуальнаяЗаписьИстории.КПП							= Наименования.КПП;
		//)
		//Евросиб - АСуслов 06.09.2023 12:51:18 #74705
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает наименование организации на указанную дату.
//
// Параметры:
//     Организация - СправочникСсылка.Организация - Организация.
//     ДатаСведений - Дата - Дата, на которую нужно получить наименование организации.
//
// Возвращаемое значение:
//     Структура - СокращенноеНаименование, ПолноеНаименование, НаименованиеДляПечатныхФорм, ФИО.
//
Функция НаименованияНаДату(Организация, ДатаСведений, НаименованиеПоУмолчанию = Неопределено) Экспорт
		
	НаименованияОрганизации = Новый Структура();
	НаименованияОрганизации.Вставить("НаименованиеСокращенное", "");
	НаименованияОрганизации.Вставить("НаименованиеСокращенноеАнгл", "");
	НаименованияОрганизации.Вставить("НаименованиеПолное", "");
	НаименованияОрганизации.Вставить("НаименованиеПолноеАнгл", "");
	НаименованияОрганизации.Вставить("НаименованиеДляНакладной", "");
	//Евросиб - АСуслов 06.09.2023 14:47:31 #74705
	//(
	НаименованияОрганизации.Вставить("КПП", "");
	//)
	//Евросиб - АСуслов 06.09.2023 14:47:33 #74705
	
	Если НЕ ЗначениеЗаполнено(Организация)
		ИЛИ ТипЗнч(Организация) <> Тип("СправочникСсылка.Организации") Тогда
		Возврат ?(ЗначениеЗаполнено(НаименованиеПоУмолчанию), НаименованиеПоУмолчанию, НаименованияОрганизации);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаСведений) Тогда
		Запрос = Новый Запрос();
		Запрос.Параметры.Вставить("Организация", Организация);
		Запрос.Параметры.Вставить("ДатаСведений", ДатаСведений);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(ИсторияНаименованийОрганизаций.Период) КАК Период,
		|	ИсторияНаименованийОрганизаций.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ЗначенияНаименований
		|ИЗ
		|	Справочник.Организации.ИсторияНаименований КАК ИсторияНаименованийОрганизаций
		|ГДЕ
		|	ИсторияНаименованийОрганизаций.Ссылка = &Организация
		|	И ИсторияНаименованийОрганизаций.Период <= &ДатаСведений
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсторияНаименованийОрганизаций.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсторияНаименованийОрганизаций.НаименованиеСокращенное КАК НаименованиеСокращенное,
		|	ИсторияНаименованийОрганизаций.НаименованиеПолное КАК НаименованиеПолное,
		|	ИсторияНаименованийОрганизаций.НаименованиеСокращенноеАнгл КАК НаименованиеСокращенноеАнгл,
		|	ИсторияНаименованийОрганизаций.НаименованиеПолноеАнгл КАК НаименованиеПолноеАнгл,
		|	ИсторияНаименованийОрганизаций.НаименованиеДляНакладной КАК НаименованиеДляНакладной,
		//Евросиб - АСуслов 06.09.2023 12:52:01 #74705
		//(
		|	ИсторияНаименованийОрганизаций.КПП КАК КПП
		//)
		//Евросиб - АСуслов 06.09.2023 12:52:04 #74705
		|ИЗ
		|	ЗначенияНаименований КАК ЗначенияНаименований
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации.ИсторияНаименований КАК ИсторияНаименованийОрганизаций
		|		ПО ЗначенияНаименований.Ссылка = ИсторияНаименованийОрганизаций.Ссылка
		|			И ЗначенияНаименований.Период = ИсторияНаименованийОрганизаций.Период";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			НаименованияОрганизации.НаименованиеСокращенное     = Выборка.НаименованиеСокращенное;
			НаименованияОрганизации.НаименованиеСокращенноеАнгл = Выборка.НаименованиеСокращенноеАнгл;
			НаименованияОрганизации.НаименованиеПолное          = Выборка.НаименованиеПолное;
			НаименованияОрганизации.НаименованиеПолноеАнгл      = Выборка.НаименованиеПолноеАнгл;
			НаименованияОрганизации.НаименованиеДляНакладной    = Выборка.НаименованиеДляНакладной;
			//Евросиб - АСуслов 06.09.2023 12:52:18 #74705
			//(
			НаименованияОрганизации.КПП    						= Выборка.КПП;
			//)
			//Евросиб - АСуслов 06.09.2023 12:52:20 #74705
			Возврат НаименованияОрганизации;
		КонецЕсли;
	КонецЕсли;
	
	//Евросиб - АСуслов 06.09.2023 12:52:56 #74705
	//(
	//ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "НаименованиеСокращенное, НаименованиеПолное, НаименованиеСокращенноеАнгл, НаименованиеПолноеАнгл, НаименованиеДляНакладной");
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "НаименованиеСокращенное, НаименованиеПолное, НаименованиеСокращенноеАнгл, НаименованиеПолноеАнгл, НаименованиеДляНакладной, КПП");
	//)
	//Евросиб - АСуслов 06.09.2023 12:52:57 #74705
	НаименованияОрганизации.НаименованиеСокращенное     = ЗначенияРеквизитов.НаименованиеСокращенное;
	НаименованияОрганизации.НаименованиеСокращенноеАнгл = ЗначенияРеквизитов.НаименованиеСокращенноеАнгл;
	НаименованияОрганизации.НаименованиеПолное          = ЗначенияРеквизитов.НаименованиеПолное;
	НаименованияОрганизации.НаименованиеПолноеАнгл      = ЗначенияРеквизитов.НаименованиеПолноеАнгл;
	НаименованияОрганизации.НаименованиеДляНакладной	= ЗначенияРеквизитов.НаименованиеДляНакладной;
	//Евросиб - АСуслов 06.09.2023 12:53:14 #74705
	//(
	НаименованияОрганизации.КПП							= ЗначенияРеквизитов.КПП;
	//)
	//Евросиб - АСуслов 06.09.2023 12:53:16 #74705
	
	Возврат НаименованияОрганизации;
	
КонецФункции
//Евросиб ) Литвинов 21.01.2021 #30025

//Евросиб Гудкова( 08.11.2022 Ticket№ 59543
Функция ОрганизацияПоУмолчанию() Экспорт

	Возврат Константы.ОсновнаяОрганизация.Получить();	

КонецФункции // ОрганизацияПоУмолчанию()

// Евросиб Гудкова)

//Евросиб Каблов 07.06.2024 #67092
// Возвращает головную организацию для заданной организации
// Если для организации реквизит ГоловнаяОрганизация не заполнен 
// это значит, что сама организация является головной
//
// Параметры
//  Организация – СправочникСсылка.Организации
//
// Возвращаемое значение:
//   СправочникСсылка.Организации
//
Функция ПолучитьГоловнуюОрганизацию(Организация) Экспорт
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ГоловнаяОрганизация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ГоловнаяОрганизация");
	Иначе
		ГоловнаяОрганизация = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГоловнаяОрганизация) Тогда
		Возврат ГоловнаяОрганизация;
	Иначе
		Возврат Организация; 
	КонецЕсли;

КонецФункции