
&НаКлиенте
Процедура РедактироватьМакет(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ИмяОбъектаМетаданныхМакета", ТекущиеДанные.Объект+"."+ТекущиеДанные.ИмяМакета);
	ПараметрыОткрытия.Вставить("ТипМакета", "MXL");
	ПараметрыОткрытия.Вставить("ИмяДокумента", ТекущиеДанные.ИмяМакета);
	ПараметрыОткрытия.Вставить("Редактирование", Истина);
	ПараметрыОткрытия.Вставить("Контрагент", ТекущиеДанные.Контрагент);
	ПараметрыОткрытия.Вставить("Договор", ТекущиеДанные.Договор);
	ОткрытьФорму("ОбщаяФорма.РедактированиеТабличногоДокумента", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если НЕ ИмяСобытия = "Запись_ТабличныйДокумент" Тогда Возврат; КонецЕсли;
	
	СтрТочка = СтрНайти(Параметр.ИмяОбъектаМетаданныхМакета, ".", НаправлениеПоиска.СКонца);
	ОснЧасть = Лев(Параметр.ИмяОбъектаМетаданныхМакета, СтрТочка-1);
	ПравЧасть = Сред(Параметр.ИмяОбъектаМетаданныхМакета, СтрТочка+1);
	
	ЗаписатьМакетСервер(ОснЧасть, ПравЧасть, Источник.Контрагент, Источник.Договор, Источник.ТабличныйДокумент);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьМакетСервер(ОснЧасть, ПравЧасть, Контрагент, Договор, ИзмененныйМакет)
	
	Запись = РегистрыСведений.ПользовательскиеМакетыПечати.СоздатьМенеджерЗаписи();
	Запись.Объект = ОснЧасть;
	Запись.ИмяМакета = ПравЧасть;
	Запись.Контрагент = Контрагент;
	Запись.Договор = Договор;
	Запись.Использование = Истина;
	Запись.Макет = Новый ХранилищеЗначения(ИзмененныйМакет, Новый СжатиеДанных(9));
	Запись.Записать();
	
КонецПроцедуры
