
//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

//&НаКлиенте
//Процедура ВидДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	СтандартнаяОбработка = Ложь;
//	ОткрытьФорму("Справочник.э_ОбщиеПоказатели.ФормаСписка", Новый Структура("Отбор", Новый Структура("ИдентификаторПараметра", 213)));
//КонецПроцедуры

//&НаКлиенте
//Процедура ОрганизацияРЖДПриИзменении(Элемент)
//	Если (НЕ Объект.ОрганизацияРЖД.Пустая()) Тогда
//		ДанныеССервера = ОрганизацияРЖДПриИзмененииНаСервере(Объект.ОрганизацияРЖД);
//		Объект.ОрганизацияРЖДКод	= ДанныеССервера.КодСт;
//		Объект.ОрганизацияРЖДДорога	= ДанныеССервера.Дорога;
//	Иначе
//		Объект.ОрганизацияРЖДКод	= "";
//		Объект.ОрганизацияРЖДДорога	= ПредопределенноеЗначение("Справочник.Дороги.ПустаяСсылка");
//	КонецЕсли;	
//КонецПроцедуры

//&НаСервереБезКонтекста
//Функция ОрганизацияРЖДПриИзмененииНаСервере(ОрганизацияРЖД)
//	Возврат Новый Структура("КодСт, Дорога", ОрганизацияРЖД.КодСт, ОрганизацияРЖД.Дорога);
//КонецФункции

//&НаКлиенте
//Процедура ПлательщикПриИзменении(Элемент)
//Если (НЕ Объект.Плательщик.Пустая()) Тогда
//		ДанныеССервера = ПлательщикПриИзмененииНаСервере(Объект.Плательщик);
//		Объект.ПлательщикКод	= ДанныеССервера.э_КодПлательщика;
//		Объект.ПлательщикОКПО	= ДанныеССервера.ОКПО;
//	Иначе
//		Объект.ПлательщикКод	= "";
//		Объект.ПлательщикОКПО	= "";
//	КонецЕсли;	
//КонецПроцедуры

//&НаСервереБезКонтекста
//Функция ПлательщикПриИзмененииНаСервере(Плательщик)
//	Возврат Новый Структура("э_КодПлательщика, ОКПО", Плательщик.э_КодПлательщика, Плательщик.ОКПО);
//КонецФункции

//&НаКлиенте
//Процедура СборыПризнакОбложенияНалогомНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	СтандартнаяОбработка = Ложь;
//	ОткрытьФорму("Справочник.э_ОбщиеПоказатели.ФормаСписка", Новый Структура("Отбор", Новый Структура("ИдентификаторПараметра", 185)));
//КонецПроцедуры