

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТЗ = НОвый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("НаименованиеОтбора",Новый ОписаниеТипов("ПеречислениеСсылка.ВариантыОтборовВагонов"));
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ПеречислениеСсылка.ВариантыСобственности"));
	МассивТипов.Добавить(Тип("Строка"));
	МассивТипов.Добавить(Тип("Булево"));
	ПараметрыСтроки = Новый КвалификаторыСтроки(20);
	ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов, , ПараметрыСтроки);
	
	ТЗ.Колонки.Добавить("ВариантЗначенияОтбора",ДопустимыеТипы);
	
	Для Каждого Элем Из Перечисления.ВариантыОтборовВагонов Цикл
		Если Элем = Перечисления.ВариантыОтборовВагонов.РазмерыВагонов Тогда
			НовСтрД = ТЗ.Добавить();
			НовСтрД.НаименованиеОтбора = Элем;
			НовСтрД.ВариантЗначенияОтбора = "40";
			НовСтрД = ТЗ.Добавить();
			НовСтрД.НаименованиеОтбора = Элем;
			НовСтрД.ВариантЗначенияОтбора = "60";
			НовСтрД = ТЗ.Добавить();
			НовСтрД.НаименованиеОтбора = Элем;
			НовСтрД.ВариантЗначенияОтбора = "80";
		ИначеЕсли Элем = Перечисления.ВариантыОтборовВагонов.ВидыСобственности Тогда
			Для Каждого Элем2 Из Перечисления.ВариантыСобственности Цикл
				НовСтрД = ТЗ.Добавить();
				НовСтрД.НаименованиеОтбора = Элем;
				НовСтрД.ВариантЗначенияОтбора = Элем2;
			КонецЦикла;
		ИначеЕсли Элем = Перечисления.ВариантыОтборовВагонов.ВЭксплуатации ИЛИ
			Элем = Перечисления.ВариантыОтборовВагонов.Резервный ИЛИ
			Элем = Перечисления.ВариантыОтборовВагонов.Прибывшие ИЛИ
			Элем = Перечисления.ВариантыОтборовВагонов.Назначенные Тогда
			НовСтрД = ТЗ.Добавить();
			НовСтрД.НаименованиеОтбора = Элем;
			НовСтрД.ВариантЗначенияОтбора = Истина;
			НовСтрД = ТЗ.Добавить();
			НовСтрД.НаименованиеОтбора = Элем;
			НовСтрД.ВариантЗначенияОтбора = Ложь;
		ИначеЕсли Элем = Перечисления.ВариантыОтборовВагонов.ТребуетсяПередислокация Тогда
			НовСтрД = ТЗ.Добавить();
			НовСтрД.НаименованиеОтбора = Элем;
			НовСтрД.ВариантЗначенияОтбора = Истина;
			НовСтрД = ТЗ.Добавить();
			НовСтрД.НаименованиеОтбора = Элем;
			НовСтрД.ВариантЗначенияОтбора = Ложь;
		ИначеЕсли Элем = Перечисления.ВариантыОтборовВагонов.СогласованоМенеджером Тогда
			НовСтрД = ТЗ.Добавить();
			НовСтрД.НаименованиеОтбора = Элем;
			НовСтрД.ВариантЗначенияОтбора = Истина;
			НовСтрД = ТЗ.Добавить();
			НовСтрД.НаименованиеОтбора = Элем;
			НовСтрД.ВариантЗначенияОтбора = Ложь;
		ИначеЕсли Элем = Перечисления.ВариантыОтборовВагонов.СогласованоПланером Тогда
			НовСтрД = ТЗ.Добавить();
			НовСтрД.НаименованиеОтбора = Элем;
			НовСтрД.ВариантЗначенияОтбора = Истина;
			НовСтрД = ТЗ.Добавить();
			НовСтрД.НаименованиеОтбора = Элем;
			НовСтрД.ВариантЗначенияОтбора = Ложь;
		ИначеЕсли Элем = Перечисления.ВариантыОтборовВагонов.ТребуетсяВыводВПовагонку Тогда
			НовСтрД = ТЗ.Добавить();
			НовСтрД.НаименованиеОтбора = Элем;
			НовСтрД.ВариантЗначенияОтбора = Истина;
			НовСтрД = ТЗ.Добавить();
			НовСтрД.НаименованиеОтбора = Элем;
			НовСтрД.ВариантЗначенияОтбора = Ложь;
		КонецЕсли;
			
	КонецЦикла;
	
 	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВремТЧ.НаименованиеОтбора КАК НаименованиеОтбора,
	               |	ВремТЧ.ВариантЗначенияОтбора КАК ВариантЗначенияОтбора
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	&ВремТЧ КАК ВремТЧ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.НаименованиеОтбора КАК НаименованиеОтбора,
	               |	ВТ.ВариантЗначенияОтбора КАК ВариантЗначенияОтбора,
	               |	ВЫБОР
	               |		КОГДА НЕ ЕСТЬNULL(ПресетыОтборовАРМСписокОтборовВагонов.ВариантЗначенияОтбора, 0) = 0
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Использование
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПресетыОтборовАРМ.СписокОтборовВагонов КАК ПресетыОтборовАРМСписокОтборовВагонов
	               |		ПО ВТ.НаименованиеОтбора = ПресетыОтборовАРМСписокОтборовВагонов.НаименованиеОтбора
	               |			И ВТ.ВариантЗначенияОтбора = ПресетыОтборовАРМСписокОтборовВагонов.ВариантЗначенияОтбора
	               |			И (ПресетыОтборовАРМСписокОтборовВагонов.Ссылка = &Ссылка)
	               |ИТОГИ ПО
	               |	НаименованиеОтбора";
	Запрос.УстановитьПараметр("ВремТЧ",ТЗ);
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	ДеревоЗн = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);

	ЗначениеВРеквизитФормы(ДеревоЗн, "ДеревоОтборов");
	
	// для типов ТС отдельный запрос и отдельное дерево
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТипоразмерыТС.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТипоразмерыТС КАК ТипоразмерыТС
		|ИТОГИ ПО
		|	Ссылка ТОЛЬКО ИЕРАРХИЯ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСсылка.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаСсылка.Ссылка) Тогда
			СписокГруппТиповТС.Добавить(ВыборкаСсылка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
 	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Перечисление.ВариантыОтборовВагонов.ТипТС) КАК НаименованиеОтбора,
	               |	ТипоразмерыТС.Ссылка КАК ВариантЗначенияОтбора,
	               |	ТипоразмерыТС.Родитель КАК Родитель,
	               |	ВЫБОР
	               |		КОГДА ТипоразмерыТС.Ссылка В (&СписокГруппТиповТС)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ЭтоГруппаСпискаТС
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	Справочник.ТипоразмерыТС КАК ТипоразмерыТС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.НаименованиеОтбора КАК НаименованиеОтбора,
	               |	ВТ.ВариантЗначенияОтбора КАК ВариантЗначенияОтбора,
	               |	ВЫБОР
	               |		КОГДА НЕ ЕСТЬNULL(ПресетыОтборовАРМСписокОтборовВагонов.ВариантЗначенияОтбора, 0) = 0
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Использование,
	               |	ВТ.Родитель КАК Родитель,
	               |	ВТ.ЭтоГруппаСпискаТС КАК ЭтоГруппаСпискаТС
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПресетыОтборовАРМ.СписокОтборовВагонов КАК ПресетыОтборовАРМСписокОтборовВагонов
	               |		ПО ВТ.НаименованиеОтбора = ПресетыОтборовАРМСписокОтборовВагонов.НаименованиеОтбора
	               |			И ВТ.ВариантЗначенияОтбора = ПресетыОтборовАРМСписокОтборовВагонов.ВариантЗначенияОтбора
	               |			И (ПресетыОтборовАРМСписокОтборовВагонов.Ссылка = &Ссылка)
	               |ГДЕ
	               |	НЕ ВТ.ЭтоГруппаСпискаТС
	               |ИТОГИ ПО
	               |	Родитель";
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	Запрос.УстановитьПараметр("СписокГруппТиповТС",СписокГруппТиповТС);
	ДеревоЗнТипТС = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);

	ЗначениеВРеквизитФормы(ДеревоЗнТипТС, "ДеревоОтборовТипТС");
	
 
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )




&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.СписокОтборовВагонов.Очистить();
	
	ОбойтиРекурсивноСтрокиДереваНаКлиенте(ДеревоОтборов.ПолучитьЭлементы());
	ОбойтиРекурсивноСтрокиДереваНаКлиенте(ДеревоОтборовТипТС.ПолучитьЭлементы());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбойтиРекурсивноСтрокиДереваНаКлиенте(Строки)
	Для Каждого СтрокаДерева Из Строки Цикл
		// сохраняем данные только если стоит флаг использования фильтра
		Если СтрокаДерева.Использование Тогда
			Если (СтрокаДерева.НаименованиеОтбора = ПредопределенноеЗначение("Перечисление.ВариантыОтборовВагонов.ТипТС") И
				НЕ ЗначениеЗаполнено(СтрокаДерева.ВариантЗначенияОтбора)) ИЛИ
				НЕ ЗначениеЗаполнено(СтрокаДерева.НаименованиеОтбора) Тогда
				// ничего не делаем, нам не нужны родительские группы, т.к. при выделении 
				// родительской группы автоматически отмечаются флагами дочерние
			Иначе
				НовСтр = Объект.СписокОтборовВагонов.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр,СтрокаДерева);
				Если СтрокаДерева.НаименованиеОтбора = ПредопределенноеЗначение("Перечисление.ВариантыОтборовВагонов.ИсторияПоВагону") И
					СтрокаДерева.ВариантЗначенияОтбора = Истина Тогда
					НовСтр.Приоритет = 1;
					Объект.Исторический = Истина;
				Иначе
					НовСтр.Приоритет = 0;
					Объект.Исторический = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
         
        ПодчиненныеСтроки = СтрокаДерева.ПолучитьЭлементы();
         
        Если ПодчиненныеСтроки.Количество() > 0 Тогда
            ОбойтиРекурсивноСтрокиДереваНаКлиенте(ПодчиненныеСтроки);
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОтборовТипТСИспользованиеПриИзменении(Элемент)
	
	ТекД = Элементы.ДеревоОтборовТипТС.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтр = Элементы.ДеревоОтборовТипТС.ТекущаяСтрока;
	
	ОбходНаСервере(ТекСтр,ТекД.Использование);
КонецПроцедуры

&НаСервере
Процедура ОбходНаСервере(ТекСтр,Использование)

	тДерево = ДеревоОтборовТипТС.НайтиПоИдентификатору(ТекСтр);
	
	ОбходДерева(тДерево,Использование);
	
КонецПроцедуры
 
&НаСервере
Процедура ОбходДерева(Дерево,Использование)
	
	Для Каждого Строка Из Дерево.ПолучитьЭлементы() Цикл
		ИдентификаторСтроки = Строка.ПолучитьИдентификатор();

		тДерево = ДеревоОтборовТипТС.НайтиПоИдентификатору(ИдентификаторСтроки);
		тДерево.Использование = Использование;
		ОбходДерева(Строка,Использование);

	КонецЦикла;
	
КонецПроцедуры