
&НаКлиенте
Процедура СоздатьЗаявку(Команда)
	
	СоздатьЗаявкуВДокументе();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаявкуВДокументе() 
	
	ДокОбъект = ДанныеФормыВЗначение(объект,Тип("ДокументОбъект.э_ЗаявкаНаПеревозку"));
	
	КодЗапроса = Сред(ТекущаяДата(),4,2) + Лев(ТекущаяДата(),2)+ Час(ТекущаяДата()) + Минута(ТекущаяДата());
	
	МакетНастроек = Обработки.э_Макеты.ПолучитьМакет("э_ЗаявкаНаПеревозку");
	СоответствиеТаблиц = э_ОбщиеСервер.ПолучитьСоответствиеТаблицОбъекта(МакетНастроек);
	Перевод = э_ОбщиеСервер.ПолучитьСоответствиеПереводРеквизитовОбъекта(МакетНастроек,1);
	ТекстЗапроса = э_ОбщиеСервер.ЗаполнитьXMLИзОбъекта(ДокОбъект,СоответствиеТаблиц,Перевод,МакетНастроек);
	ТекстЗапроса =
	//<!-- ********************************** -->
	//<!-- ПОДАЧА ЗАЯВКИ НА ПЕРЕВОЗКУ: запрос -->
	//<!-- ********************************** -->
	"<claimAgreement version=""1.0"">" +
	
	//Если не ЗначениеЗаполнено(ДокОбъект.ИДЗаявки) Тогда
	//	
	//	ТекстЗапроса = ТекстЗапроса + "<frontEndId value=" + КодЗапроса +"/>";
	//	
	//КонецЕсли;
	
	ТекстЗапроса 
	////<!-- Формировать заявку только до отправок включительно - не использовать данные блоков маршрутов, графиков подач и плательщиков -->
	//+ "<notFullClaim/>"
	//<!-- Использование 6-значных кодов станций и грузов в ответе -->
	+ "<useMod11/>"
	//<!-- Расчет графика подач(если не указан график подач и способ подачи не по датам) -->
	+ "<useCalcGraphPod/>"
	//<!-- Выдавать данные подписи ЭЦП -->
	+ "<useECP/>"
	//<!-- Не переводить состояние заявки в согласовано -->
	+ "<notState/>"
	//<!-- Не возвращать данные о накладных по заявке. -->
	+ "<notGetInv/>"
	//<!-- Выдавать список некритических ошибок-->
	//<!-- * тип данных: строка -->
	+ "<useWarning/>"
	+ "</claimAgreement>";
	
	
	РезультатЗапроса = э_ОбщиеСервер.ПолучитьОтветНаЗапрос(ТекстЗапроса);
	
	//РезультатЗапроса = "Тест";
	//ДокОбъект.ИдЗаявки = 1;
	МенеджерЗаписи 				   = РегистрыСведений.э_ЛогиЭТРАН.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период		   = ТекущаяДата();
	МенеджерЗаписи.ТипЗапроса 	   = "Создание ГУ12";
	МенеджерЗаписи.НомерТранзакции = 1;
	МенеджерЗаписи.Запрос 		   = ТекстЗапроса;
//Евросиб Гудкова( 08.10.2019
//было 	МенеджерЗаписи.Ответ 		   = РезультатЗапроса;
	Сжатие = Новый СжатиеДанных(9);
	МенеджерЗаписи.ОтветСжатый = Новый ХранилищеЗначения(РезультатЗапроса, Сжатие);
// Евросиб Гудкова)
	
	Если Найти(РезультатЗапроса,"error") > 0 Тогда
		МенеджерЗаписи.Ошибка = Истина;
	КонецЕсли;
	
	МенеджерЗаписи.Записать();
		
	ПозицияИД = Найти(РезультатЗапроса,"claimID value");
	ПозицияОшибки = Найти(РезультатЗапроса,"errorMessage value=");   
	
	Если ПозицияИД > 0 или ПозицияОшибки > 0 Тогда
		
		Если ПозицияИД > 0  Тогда  
			ИДНакладной = Сред(РезультатЗапроса,ПозицияИД+14,9);
			ДокОбъект.ИДЗаявки = ИДНакладной; 
			
			э_ОбщиеСервер.ЗаполнитьДокументЗаявкаНаПеревозкуПриВыгрузке(РезультатЗапроса	,Ложь,"",ТекущаяДата(),ТекущаяДата(),ТекущаяДата(),ДокОбъект);
			
			
		ИначеЕсли ПозицияОшибки > 0  Тогда 				
			КонецОшибки  = Найти(РезультатЗапроса,"errorStatusCode value=");
			
			Если КонецОшибки > 0  Тогда 
				ДокОбъект.Ошибки = Сред(РезультатЗапроса,ПозицияОшибки+19,КонецОшибки - ПозицияОшибки - 24);
			КонецЕсли; 			
			
		КонецЕсли;
		
	КонецЕсли;

	ДокОбъект.Записать();
	
	ЗначениеВДанныеФормы(ДокОбъект,Объект);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьГУ12(Команда)
	
	Объект.СтатусСогласования = ПредопределенноеЗначение("Перечисление.СтатусСогласованияГУ12.ПодтвержденоВручную");
	
	Записать();
	Объект.dc_ОшибкаЭтран = э_ОбщиеСервер.ПередатьРезультатГУ12(Объект.Ссылка, Истина);
	Объект.СогласованиеРезультатПередан = ТекущаяДата();
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьГУ12(Команда)
	
	Объект.СтатусСогласования = ПредопределенноеЗначение("Перечисление.СтатусСогласованияГУ12.ОтклоненоВручную");
	Записать();
	Объект.dc_ОшибкаЭтран = э_ОбщиеСервер.ПередатьРезультатГУ12(Объект.Ссылка, Ложь);
	Объект.СогласованиеРезультатПередан = ТекущаяДата();
	Записать();
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )
