
// Функция - Выполнить поиск запроса на автоперевозку по гуиду строки
//
// Параметры:
//  ГУИД - Массив - Для поиска по "ИдентификаторСтрокиТЧ"
// 
// Возвращаемое значение:
//  Дерево значенией в разрезе Ссылка на документ, гуид строки - ДеревоЗначений
//
Функция ВыполнитьПоискЗапросаНаАвтоперевозкуПоГуидуСтроки(МассивГУИДы) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗапросНаАвтоперевозкуКонтейнеры.Ссылка КАК Ссылка,
		|	ЗапросНаАвтоперевозкуКонтейнеры.ИдентификаторСтрокиТЧ КАК ГУИД
		|ИЗ
		|	Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
		//Евросиб Коханенко Н.А. 07.06.2024 (( #83866
		//ищем либо среди неперенесенных КТК,
		//либо среди перенесенных, но уже в движении (заполнена Дата вывоза)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|		ПО ЗапросНаАвтоперевозкуКонтейнеры.ИдентификаторСтрокиУслуги = ЗаявкаСоставУслуги.ГУИДСтроки
		|			И (ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка)
		|				ИЛИ ЗапросНаАвтоперевозкуКонтейнеры.ДатаИВремяВывоза <> ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ ЗапросНаАвтоперевозкуКонтейнеры.ДатаЗавершенияОперацииНаСкладеКлиента <> ДАТАВРЕМЯ(1, 1, 1))
		//Евросиб Коханенко Н.А. 07.06.2024 )) #83866 
		|ГДЕ
		|	ЗапросНаАвтоперевозкуКонтейнеры.ИдентификаторСтрокиТЧ В(&ИдентификаторСтрокиТЧ)
		//Евросиб Коханенко Н.А. 24.12.2024 (( #98503
		//связь со строкой СоставаУслуги Заявки через КлючАналитикиПеревозки вместо ГУИДа строки, если строка услуги существует
		|ОБЪЕДИНИТЬ
		|ВЫБРАТЬ
		|	ЗапросНаАвтоперевозкуКонтейнеры.Ссылка КАК Ссылка,
		|	ЗапросНаАвтоперевозкуКонтейнеры.ИдентификаторСтрокиТЧ КАК ГУИД
		|ИЗ
		|	Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|		ПО ЗапросНаАвтоперевозкуКонтейнеры.КлючАналитикиПеревозки = ЗаявкаСоставУслуги.КлючАналитикиПеревозки
		|ГДЕ
		|	ЗапросНаАвтоперевозкуКонтейнеры.ИдентификаторСтрокиТЧ В(&ИдентификаторСтрокиТЧ)
		|	И (НЕ ЗаявкаСоставУслуги.Ссылка ЕСТЬ NULL
		|		И (ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка)
		|			ИЛИ ЗапросНаАвтоперевозкуКонтейнеры.ДатаИВремяВывоза <> ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ЗапросНаАвтоперевозкуКонтейнеры.ДатаЗавершенияОперацииНаСкладеКлиента <> ДАТАВРЕМЯ(1, 1, 1))
		|		ИЛИ ЗаявкаСоставУслуги.Ссылка ЕСТЬ NULL)
		//Евросиб Коханенко Н.А. 24.12.2024 )) #98503 
		|ИТОГИ ПО
		|	Ссылка";
		
	Запрос.УстановитьПараметр("ИдентификаторСтрокиТЧ", МассивГУИДы);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);	
	
	Возврат РезультатЗапроса;
	
КонецФункции

//ДИТ Шевченко А.В. US 62492 ТА 68150 25.04.2023 - начало
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЗапросНаАвтоКТККлиента";
	КомандаПечати.Представление = НСтр("ru = 'Запрос на автоперевозку (КТК клиента)'");
	КомандаПечати.Обработчик    = "ДополнительныйМодульКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;	
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЗапросНаАвтоКТКЕвросиб";
	КомандаПечати.Представление = НСтр("ru = 'Запрос на автоперевозку (КТК Евросиб)'");
	КомандаПечати.Обработчик    = "ДополнительныйМодульКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;	
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЗапросНаАвтоКТККлиентаЕвросиб";
	КомандаПечати.Представление = НСтр("ru = 'Запрос на автоперевозку (КТК Евросиб и КТК клиента)'");
	КомандаПечати.Обработчик    = "ДополнительныйМодульКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗапросНаАвтоКТККлиента") Тогда
		СформироватьПечатнуюФорму(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, "ЗапросНаАвтоКТККлиента", "Запрос на автоперевозку (КТК клиента)",
		ОбъектыПечати, ПараметрыВывода);
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗапросНаАвтоКТКЕвросиб") Тогда
		СформироватьПечатнуюФорму(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, "ЗапросНаАвтоКТКЕвросиб", "Запрос на автоперевозку (КТК Евросиб)",
		ОбъектыПечати, ПараметрыВывода);
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗапросНаАвтоКТККлиентаЕвросиб") Тогда
		СформироватьПечатнуюФорму(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, "ЗапросНаАвтоКТККлиентаЕвросиб", "Запрос на автоперевозку (КТК Евросиб и КТК клиента)",
		ОбъектыПечати, ПараметрыВывода);
	КонецЕсли;

КонецПроцедуры 

Процедура СформироватьПечатнуюФорму(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ИмяМакета, СинонимМакета, ОбъектыПечати, ПараметрыВывода)
	
	Для каждого ЭлМассива из МассивОбъектов Цикл
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета, СинонимМакета, 
		ПечатьЗапросаНаАвтоперевозку(МассивОбъектов, ОбъектыПечати, ИмяМакета),,"Документ.ЗапросНаАвтоперевозку.ПФ_MXL_ЗапросНаАвтоперевозку");
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПечатьЗапросаНаАвтоперевозку(МассивОбъектов, ОбъектыПечати, ИмяМакета) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
    ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ЗапросНаАвтоперевозку";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗапросНаАвтоперевозку.ПФ_MXL_ЗапросНаАвтоперевозку");
	
	 Запрос = Новый Запрос();
    Запрос.Текст =
    "ВЫБРАТЬ
    |	ЗапросНаАвтоперевозку.Ссылка КАК Ссылка,
    |	ЗапросНаАвтоперевозку.Контрагент КАК Контрагент,
    |	ЗапросНаАвтоперевозку.Договор КАК Договор,
    |	ЗапросНаАвтоперевозку.Заявка КАК Заявка,
    |	ЗапросНаАвтоперевозку.ОриентировочнаяДатаЖДРейса КАК ОриентировочнаяДатаЖДРейса,
    |	ЗапросНаАвтоперевозку.ОриентировочнаяДатаМорскогоРейса КАК ОриентировочнаяДатаМорскогоРейса,
    |	ЗапросНаАвтоперевозку.ЭтапПеревозки КАК ЭтапПеревозки,
    |	ЗапросНаАвтоперевозку.Автор КАК Автор,
    |	ВЫБОР
    |		КОГДА ЗапросНаАвтоперевозку.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.ПерваяМиля)
    |			ТОГДА ""Грузоотправитель""
    |		ИНАЧЕ ""Грузополучатель""
    |	КОНЕЦ КАК Отправитель
    |ИЗ
    |	Документ.ЗапросНаАвтоперевозку КАК ЗапросНаАвтоперевозку
    |ГДЕ
    |	ЗапросНаАвтоперевозку.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;
	
	Пока Шапка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
            ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
        НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
        
		/////////////////////////////////////////////////////////////
		ТаблицаЗапросовП = ПолучитьТаблицуСтрокЗапросаНаАвто(Шапка.Ссылка);
		ЗакрытьЗадачуПередатьКлинту = Ложь;
		Если ИмяМакета = "ЗапросНаАвтоКТККлиента" Тогда
			ТаблицаЗапросов = ТаблицаЗапросовП.Скопировать(Новый Структура("ПринадлежностьТЕ",Перечисления.ПринадлежностьТЕ.КТКлиента));
			ЗакрытьЗадачуПередатьКлинту = Истина;
		ИначеЕсли ИмяМакета = "ЗапросНаАвтоКТКЕвросиб" Тогда
			ТаблицаЗапросов = ТаблицаЗапросовП.Скопировать(Новый Структура("ПринадлежностьТЕ",Перечисления.ПринадлежностьТЕ.КТЕвросиба));
		Иначе
			ТаблицаЗапросов = ТаблицаЗапросовП.Скопировать();
			ЗакрытьЗадачуПередатьКлинту = Истина;
		КонецЕсли;	
		
		
		ДанныеПечати = Новый Структура;
        ДанныеПечати.Вставить("Контрагент"						, Шапка.Контрагент);
		ДанныеПечати.Вставить("Договор"							, Шапка.Договор);
		ДанныеПечати.Вставить("Заявка"							, Шапка.Заявка);
		ДанныеПечати.Вставить("ОриентировочнаяДатаЖДРейса"		, Шапка.ОриентировочнаяДатаЖДРейса);
		ДанныеПечати.Вставить("ОриентировочнаяДатаМорскогоРейса", Шапка.ОриентировочнаяДатаМорскогоРейса);
		ДанныеПечати.Вставить("ЭтапПеревозки"					, НРег(Шапка.ЭтапПеревозки));
		ДанныеПечати.Вставить("Автор"							, Шапка.Автор);
		ДанныеПечати.Вставить("Отправитель"						, Шапка.Отправитель);
		
														
		МассивОбластейМакета = Новый Массив;
		
		МассивОбластейМакета.Добавить("Шапка");
		МассивОбластейМакета.Добавить("Строка");
								
		Для Каждого ИмяОбласти Из МассивОбластейМакета Цикл
			
			ОбластьМакета = Макет.ПолучитьОбласть(ИмяОбласти);
			
			Если ИмяОбласти <> "Строка" Тогда
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Иначе
				Для Каждого СтрокаТаблицы Из ТаблицаЗапросов Цикл
					ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
					ТабличныйДокумент.Вывести(ОбластьМакета);
				КонецЦикла;	
			КонецЕсли;
			
		КонецЦикла;
			
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
    КонецЦикла;	
	
	
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Если ЗакрытьЗадачуПередатьКлинту Тогда
		Для Каждого ОбъектМ Из МассивОбъектов Цикл
			ЗадачиМ = Новый Массив;
			ЗадачиМ.Добавить(Справочники.Состояния.ПередатьКлиентуДанныеПоАвтоперевозке);
			МаршрутизацияСервер.ОтметитьВыполнениеЗадачПоСсылке(ОбъектМ,ЗадачиМ);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция ПолучитьТаблицуСтрокЗапросаНаАвто(СсылкаДок) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлючиАналитикиПеревозки.Контейнер КАК Контейнер,
		|	КлючиАналитикиПеревозки.Груз КАК Груз,
		|	КлючиАналитикиПеревозки.Контейнер.ТипТЕ КАК КонтейнерТипТЕ,
		|	КлючиАналитикиПеревозкиМили.ФИОВодителя КАК ФИОВодителя,
		|	КлючиАналитикиПеревозкиМили.ПаспортныеДанные КАК ПаспортныеДанные,
		|	КлючиАналитикиПеревозкиМили.РегНомерТС КАК РегНомерТС,
		|	КлючиАналитикиПеревозкиМили.Автоперевозчик КАК Автоперевозчик,
		|	КлючиАналитикиПеревозкиМили.ДатаВыдачиКТКСТерминала КАК ДатаВыдачиКТКСТерминала,
		|	КлючиАналитикиПеревозкиМили.ДатаСдачиКТКНаТерминал КАК ДатаСдачиКТКНаТерминал,
		|	КлючиАналитикиПеревозкиМили.ДатаВыездаКТКСоСклада КАК ДатаВыездаКТКСоСклада,
		|	ЗапросНаАвтоперевозкуКонтейнеры.ТерминалВыдачи КАК ТерминалВыдачи,
		|	ЗапросНаАвтоперевозкуКонтейнеры.ТипОперацииНаТерминалеВыдачи КАК ТипОперацииНаТерминалеВыдачи,
		|	ЗапросНаАвтоперевозкуКонтейнеры.ТипОперацииНаСкладеКлиента КАК ТипОперацииНаСкладеКлиента,
		|	ЗапросНаАвтоперевозкуКонтейнеры.ТерминалСдачи КАК ТерминалСдачи,
		|	ЗапросНаАвтоперевозкуКонтейнеры.ТипОперацииНаТерминалеСдачи КАК ТипОперацииНаТерминалеСдачи,
		|	ЗапросНаАвтоперевозкуКонтейнеры.ВесГрузаНетто КАК ВесГрузаНетто,
		|	ЗапросНаАвтоперевозкуКонтейнеры.КоличествоМест КАК КоличествоМест,
		|	ЗапросНаАвтоперевозкуКонтейнеры.ТемпературныйРежим КАК ТемпературныйРежим,
		|	ЗапросНаАвтоперевозкуКонтейнеры.Экспедирование КАК Экспедирование,
		|	ЗапросНаАвтоперевозкуКонтейнеры.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
		|	ЗапросНаАвтоперевозкуКонтейнеры.Релиз КАК Релиз,
		|	ЗапросНаАвтоперевозкуКонтейнеры.НомерРелизаОтКлиентаТерминала КАК НомерРелизаОтКлиентаТерминала,
		|	ЗапросНаАвтоперевозкуКонтейнеры.ОбновленыИсходныеДанные КАК ОбновленыИсходныеДанные,
		|	ЗапросНаАвтоперевозкуКонтейнеры.СтавкаНДС КАК СтавкаНДС,
		|	ЗапросНаАвтоперевозкуКонтейнеры.ДатаВремяПодачиКТК КАК ДатаВремяПодачиКТК,
		|	ЗапросНаАвтоперевозкуКонтейнеры.СтатусЗапросаНаАвтоперевозку КАК СтатусЗапросаНаАвтоперевозку,
		|	ЗапросНаАвтоперевозкуКонтейнеры.КонтейнерФакт КАК КонтейнерФакт,
		|	ЗапросНаАвтоперевозкуКонтейнеры.ДатаИВремяВывоза КАК ДатаИВремяВывоза,
		|	ЗапросНаАвтоперевозкуКонтейнеры.СтатусЗаказаНаТС КАК СтатусЗаказаНаТС,
		|	ПротоколОбменов.ДатаОбмена КАК ДатаСозданияЗаказаНаТС,
		|	ПротоколОбменов.НомерДатаВБУ КАК НомерЗаказаНаТС,
		|	ЗапросНаАвтоперевозкуКонтейнеры.НомерПрицепа КАК НомерПрицепа,
		|	стоки_ТекущиеДанныеСрезПоследних.тек_ВидСобственности КАК тек_ВидСобственности,
		|	ЗНАЧЕНИЕ(Перечисление.ПринадлежностьТЕ.ПустаяСсылка) КАК ПринадлежностьТЕ,
		|	ЗапросНаАвтоперевозкуКонтейнеры.ГрузоотправительГрузопоолучательКонтакты КАК ГрузоотправительГрузопоолучательКонтакты
		|ИЗ
		|	Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
		|				ПО КлючиАналитикиПеревозки.Ссылка = КлючиАналитикиПеревозкиМили.Ссылка
		|					И КлючиАналитикиПеревозкиМили.ЭтапПеревозки = &ЭтапПеревозки
		|		ПО ЗапросНаАвтоперевозкуКонтейнеры.КлючАналитикиПеревозки = КлючиАналитикиПеревозки.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		|		ПО ((ВЫРАЗИТЬ(ПротоколОбменов.Объект КАК Документ.ЗапросНаАвтоперевозку)) = ЗапросНаАвтоперевозкуКонтейнеры.Ссылка)
		|			И (ПротоколОбменов.УИДИсточника = ЗапросНаАвтоперевозкуКонтейнеры.ИдентификаторСтрокиТЧ)
		|			И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.ТЛ))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные.СрезПоследних КАК стоки_ТекущиеДанныеСрезПоследних
		|		ПО (КлючиАналитикиПеревозки.Контейнер = стоки_ТекущиеДанныеСрезПоследних.КТК)
		|ГДЕ
		|	ЗапросНаАвтоперевозкуКонтейнеры.Ссылка = &Ссылка
		|	И КлючиАналитикиПеревозки.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Ссылка",СсылкаДок);
	Запрос.УстановитьПараметр("ЭтапПеревозки",СсылкаДок.ЭтапПеревозки);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		СтрокаТЗ.ПринадлежностьТЕ = АРМ_Сервер.ОпределитьПринадлежностьПоВидуСобственности(СтрокаТЗ.тек_ВидСобственности);
	КонецЦикла;	
	
	Возврат ТЗ;
КонецФункции	

//ДИТ Шевченко А.В. US 62492 ТА 68150 25.04.2023 -конец    

Процедура ОбновитьРелизВЗапросеНаАвто(РелизКлиента,ИдентификаторСтрокиЗаявки) Экспорт //ДИТ Шевченко А.В. US 62488 ТА 68011 02.05.2023
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗапросНаАвтоперевозкуКонтейнеры.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
		|ГДЕ
		|	ЗапросНаАвтоперевозкуКонтейнеры.ИдентификаторСтрокиЗапроса = &ИдентификаторСтрокиЗапроса
		|	И ЗапросНаАвтоперевозкуКонтейнеры.Ссылка.Проведен
		|	И НЕ ЗапросНаАвтоперевозкуКонтейнеры.Ссылка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ИдентификаторСтрокиЗапроса", ИдентификаторСтрокиЗаявки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	СтрокиКвыгрузке = Новый ТаблицаЗначений;
	СтрокиКвыгрузке.Колонки.Добавить("ИдентификаторСтрокиТабличнойЧасти");
	СтрокиКвыгрузке.Колонки.Добавить("ИдентификаторСтрокиТЧ");
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокиКвыгрузке.Очистить();
		ДокОб = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Для Каждого СтрокаКонтейнеры Из ДокОб.Контейнеры Цикл
			Если СтрокаКонтейнеры.ИдентификаторСтрокиЗапроса = ИдентификаторСтрокиЗаявки
				И СтрокаКонтейнеры.СтатусЗапросаНаАвтоперевозку <> Перечисления.СтатусЗапросаНаПеревозку.Отменен
				И СтрокаКонтейнеры.СтатусЗаказаНаТС <> Перечисления.СтатусЗаказаНаТс.ВыданВРейс
				И СтрокаКонтейнеры.СтатусЗаказаНаТС <> Перечисления.СтатусЗаказаНаТс.Закрыт
				И НЕ ЗначениеЗаполнено(СтрокаКонтейнеры.ИдентификаторСтрокиУслуги)Тогда
				
				СтрокаКонтейнеры.Релиз = РелизКлиента;
				
				Если СтрокаКонтейнеры.СтатусЗапросаНаАвтоперевозку = Перечисления.СтатусЗапросаНаПеревозку.Отправлен Тогда
					ЗаполнитьЗначенияСвойств(СтрокиКвыгрузке.Добавить(),СтрокаКонтейнеры);
				КонецЕсли;	  
				
			КонецЕсли;			
		КонецЦикла;
		Попытка
			ДокОб.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ЗаписьЖурналаРегистрации("ОшибкаЗаписиЗапросаНаАвто"
				, УровеньЖурналаРегистрации.Ошибка, ДокОб.Метаданные(), ДокОб.Ссылка, ОписаниеОшибки());
			ОтправитьПисьмоОбОшибкахЗаписиЗапросаНаАвто("Ошибка записи запроса на авто при попытки добавления релиза клиента ("+РелизКлиента+") в строку запроса.",ДокОб.Ссылка);
			Возврат;
		КонецПопытки;
		
		Если СтрокиКвыгрузке.Количество() Тогда
			ПараметрыВыгрузки = Новый Структура("СсылкаЗапросНаАвтоперевозку, СтрокиКВыгрузке", ДокОб.Ссылка, СтрокиКвыгрузке);
			ЕСОбменСервер.ПередатьЗапросыНаАвтоВТЛ(ПараметрыВыгрузки);
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры	

//ДИТ Шевченко А.В. 55131 01.08.2022 -начало
Процедура ОтправитьПисьмоОбОшибкахЗаписиЗапросаНаАвто(ТекстОшибки,СсылкаЗапросНаАвтоперевозку) Экспорт //ДИТ Шевченко А.В. US 62488 ТА 68011 02.05.2023
	
	ПолучателиУведомлений = Константы.ПолучателиУведомленийОРегЗаданиях.Получить();
	Если Не ЗначениеЗаполнено(ПолучателиУведомлений) Тогда
		Возврат;
	КонецЕсли;	
	УчетнаяЗаписьПоУмолчаниюДоступна = РаботаСПочтовымиСообщениями.ПроверитьСистемнаяУчетнаяЗаписьДоступна();	
	Если УчетнаяЗаписьПоУмолчаниюДоступна = Ложь Тогда
		Возврат;
	КонецЕсли;	
	СистемнаяУчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	ПолучателиПисьма = Новый Массив;
	Если ТипЗнч(ПолучателиУведомлений) = Тип("СправочникСсылка.Пользователи") Тогда
		ЭлАдресПользователя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПолучателиУведомлений, Справочники.ВидыКонтактнойИнформации.EmailПользователя, , Истина);
		ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", ПолучателиУведомлений, ЭлАдресПользователя));
	Иначе	
		Для Каждого ТекущийПользователь Из ПолучателиУведомлений.Состав Цикл								
			ЭлАдресПользователя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ТекущийПользователь.Пользователь, Справочники.ВидыКонтактнойИнформации.EmailПользователя, , Истина);
			ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", ТекущийПользователь.Пользователь, ЭлАдресПользователя));
		КонецЦикла;
	КонецЕсли;
	
	ТекстПисма = "ДОКУМЕНТ " + СсылкаЗапросНаАвтоперевозку;
	ТекстПисма = ТекстПисма + "ТЕКСТ ОШИБКИ:" + Символы.ПС + ТекстОшибки + Символы.ПС + Символы.ПС;
	
	ПараметрыОтправкиПисьма = Новый Структура;
	ПараметрыОтправкиПисьма.Вставить("ТипТекста", 	Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст);
	ПараметрыОтправкиПисьма.Вставить("Тема", 		"Ошибка записи запроса на авто при изменение статуса отправки/получения статуса от терминала.");
	ПараметрыОтправкиПисьма.Вставить("Тело", 		ТекстПисма);		
	ПараметрыОтправкиПисьма.Вставить("Кому", 		ПолучателиПисьма);
	
	Попытка
		РезультатОтправки = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(СистемнаяУчетнаяЗапись, ПараметрыОтправкиПисьма);
	Исключение
		ЗаписьЖурналаРегистрации("ОтправкаПисьмаОбОшибкахЗаписиЗапросаНаАвто",
							УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	ЗаписьЖурналаРегистрации("ОтправкаПисьмаОбОшибкахЗаписиЗапросаНаАвто",
							УровеньЖурналаРегистрации.Ошибка,,,ТекстПисма);
	
КонецПроцедуры	
//ДИТ Шевченко А.В. 55131 01.08.2022 -Конец

&НаСервере
Процедура ЗаполнитьСтатусОтправкиЗапросаНаТерминалВыдачиПоРелизу(СтрокаСОбновлениями,Релиз) Экспорт //ДИТ Шевченко А.В. US 62487 ТА 68012 04.05.2023
			
	МассивСтатусовОтправлен = Новый Массив;
	МассивСтатусовОтправлен.Добавить(Справочники.СибурСтатусыЗаявок.Отправлен);
	МассивСтатусовОтправлен.Добавить(Справочники.СибурСтатусыЗаявок.ЧастичноОтправлен);
	МассивСтатусовОтправлен.Добавить(Справочники.СибурСтатусыЗаявок.Принят);
	МассивСтатусовОтправлен.Добавить(Справочники.СибурСтатусыЗаявок.ЧастичноПринят);
	МассивСтатусовОтправлен.Добавить(Справочники.СибурСтатусыЗаявок.НеПринят);
	МассивСтатусовОтправлен.Добавить(Справочники.СибурСтатусыЗаявок.ЧастичноОтправленБезОтвета);
	МассивСтатусовОтправлен.Добавить(Справочники.СибурСтатусыЗаявок.ОтправленБезОтвета);
	МассивСтатусовОтправлен.Добавить(Справочники.СибурСтатусыЗаявок.Удалено);
	
	СтрокаСОбновлениями.СтатусОтправкиЗапросаНаТерминалВыдачи = Перечисления.СтатусОтправкиЗапросаНаТерминалВыдачи.НеОтправлен;
	Если МассивСтатусовОтправлен.Найти(Релиз.СтатусОтправкиПолученияОтветаТерминала) <> Неопределено Тогда
		СтрокаСОбновлениями.СтатусОтправкиЗапросаНаТерминалВыдачи = Перечисления.СтатусОтправкиЗапросаНаТерминалВыдачи.Отправлен;
	КонецЕсли;	
	
КонецПроцедуры

//Евросиб Коханенко Н.А. 22.02.2024 (( #80981 
&НаСервере
Функция ОбновитьСтоимостьВЗапросеНаАвто(ЗапросНаАвтоперевозкуСсылка, ЗаписыватьИзменения = Ложь) Экспорт

	Если ЗапросНаАвтоперевозкуСсылка = Неопределено
			ИЛИ ЗапросНаАвтоперевозкуСсылка = Документы.ЗапросНаАвтоперевозку.ПустаяСсылка() Тогда
		НеобходимаЗаписьОбъекта = Ложь;
    Иначе
		ДокументОбъект = ЗапросНаАвтоперевозкуСсылка.ПолучитьОбъект();
		НеобходимаЗаписьОбъекта = ДокументОбъект.ОбновитьСтоимостьВЗапросеНаАвто(ЗаписыватьИзменения);
	КонецЕсли;
	
	Возврат НеобходимаЗаписьОбъекта; 
		
КонецФункции //Евросиб Коханенко Н.А. 22.02.2024 )) #80981	
