	
#Область ОписаниеПеременных

Перем МассивКлючейСИзменениемДатаИВремаВывоза;
Перем МассивКлючейСИзменениемДатаИВремаСдачи;
Перем МассивКлючейСИзменениемДатаЗавершенияОперацииНСкладеКлиента;

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ЭтоНовый() Тогда
		Автор  = Пользователи.ТекущийПользователь();
		Создано = ТекущаяДата();
		ЦФО = Автор.ЦФО;
		Организация = Константы.ОсновнаяОрганизация.Получить();
		Подразделение = Автор.Подразделение;
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Автор = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	МассивКлючейСИзменениемДатаИВремаВывоза = Новый Массив;
	МассивКлючейСИзменениемДатаИВремаСдачи = Новый Массив;
	МассивКлючейСИзменениемДатаЗавершенияОперацииНСкладеКлиента = Новый Массив;
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения ИЛИ ПометкаУдаления Тогда
		ПроверитьВозможностьОтменыДокумента(Отказ);
	КонецЕсли;   
	
	// ДИТ BUG 76919 ТА 77021 Сержантова А.С. Начало: 07.11.2023  
	// При пометке на удаление запроса на автоперевозку все связанные в ТЛ заказы на ТС  должны принимать статус "отменено"
	Если ПометкаУдаления и не Отказ Тогда  
		Для каждого СтрКонтейнера Из Контейнеры Цикл
			СтрКонтейнера.СтатусЗапросаНаАвтоперевозку = Перечисления.СтатусЗапросаНаПеревозку.Отменен;
		КонецЦикла; 
	КонецЕсли;       
	// ДИТ BUG 76919 ТА 77021 Сержантова А.С. Конец: 07.11.2023 
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	
	Для Каждого СтрокаТЧ Из Контейнеры Цикл
		Если СтрокаТЧ.НеТребуетсяТерминалВыдачи Тогда
			СтрокаТЧ.ТерминалВыдачи 			  = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
			СтрокаТЧ.ТипОперацииНаТерминалеВыдачи = ПредопределенноеЗначение("Перечисление.ТипОперацииНаТерминале.ПустаяСсылка");
		КонецЕсли;
		Если СтрокаТЧ.НеТребуетсяТерминалСдачи Тогда
			СтрокаТЧ.ТерминалСдачи 			  	  = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
			СтрокаТЧ.ТипОперацииНаТерминалеСдачи  = ПредопределенноеЗначение("Перечисление.ТипОперацииНаТерминале.ПустаяСсылка");
		КонецЕсли;
		Если СтрокаТЧ.НеТребуетсяАдрес Тогда
			СтруктураПоиска = Новый Структура("ИдентификаторСтрокиТабличнойЧасти",СтрокаТЧ.ИдентификаторСтрокиТабличнойЧасти);
			НайденныеСтрки = КонтактнаяИнформация.НайтиСтроки(СтруктураПоиска);
			Для Каждого НайденнаяСтрока Из НайденныеСтрки Цикл
				КонтактнаяИнформация.Удалить(НайденнаяСтрока);
			КонецЦикла;
			СтрокаТЧ.ТипОперацииНаСкладеКлиента   = ПредопределенноеЗначение("Перечисление.ТипОперацииНаТерминале.ПустаяСсылка");
		КонецЕсли;
	КонецЦикла;		
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда  
		// ДИТ US 76935 ТА 78648 Сержантова А.С. Начало: 20.12.2023
		// Было:
		//УстановитьГотовКОтправкеДляНовыхСтрок(); 
		//Стало:
		УстановитьГотовКОтправкеДляНовыхСтрок(ДополнительныеСвойства);
		// ДИТ US 76935 ТА 78648 Сержантова А.С. Конец: 20.12.2023
	КонецЕсли;	
	
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Начало: 11.12.2023    
	//Убрали из формы интерактивную запись ключей аналитики при изменении реквизитов ТЧ. 
	//Теперь все изменения в форме фиксируются в доп свойствах "ДанныеДляОбновленияКлючейАналитики"
	//Здесь записываем данные в ключи аналитики
	#Область ПроверкаИЗаписьДанныхКлючейАналитикиПеревозки
	Если ДополнительныеСвойства.Свойство("ДанныеДляОбновленияКлючейАналитики") Тогда 
		ДанныеДляОбновленияКлючейАналитики = ДополнительныеСвойства.ДанныеДляОбновленияКлючейАналитики;  
		
		// ДИТ US 78233 TA 79764 Сержантова А.С. Начало: 29.01.2024 
		Если Контрагент <> Константы.КонтрагентДирекцияКонтейнерныхПеревозок.Получить() и РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
			Для каждого ТекущаяСтрока Из Контейнеры Цикл
				СтрокаДляОбновления = ДанныеДляОбновленияКлючейАналитики.Найти(ТекущаяСтрока.НомерСтроки, "НомерСтроки");  
				Если (ТекущаяСтрока.СтатусЗапросаНаАвтоперевозку = Перечисления.СтатусЗапросаНаПеревозку.Отправлен 
					или ТекущаяСтрока.СтатусЗапросаНаАвтоперевозку = Перечисления.СтатусЗапросаНаПеревозку.ГотовКОтправке)
					//Евросиб Коханенко Н.А. 19.02.2025 (( #102955 
					И НЕ ЭтапПеревозки = ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.СредняяМиля")
					//Евросиб Коханенко Н.А. 19.02.2025 )) #102955 
					и НЕ ЗначениеЗаполнено(СтрокаДляОбновления.ДанныеКлюча.Груз) Тогда
					Отказ = Истина; 
					ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не заполнена колонка ""Груз"" в строке %1 списка ""Контейнеры""", ТекущаяСтрока.НомерСтроки));
				КонецЕсли;
			КонецЦикла;  
		КонецЕсли;
		// ДИТ US 78233 TA 79764 Сержантова А.С. Конец: 29.01.2024

		//Евросиб Коханенко Н.А. 23.07.2024 (( #88706
		Если Не ЗначениеЗаполнено(Ссылка) Тогда
			СсылкаНаЗапросНаАвто = Документы.ЗапросНаАвтоперевозку.ПолучитьСсылку();
			ЭтотОбъект.УстановитьСсылкуНового(СсылкаНаЗапросНаАвто);
		Иначе
			СсылкаНаЗапросНаАвто = Ссылка;
		КонецЕсли;
		//Евросиб Коханенко Н.А. 23.07.2024 )) #88706 

		Если не Отказ и (РежимЗаписи = РежимЗаписиДокумента.Запись
			или РежимЗаписи = РежимЗаписиДокумента.Проведение) Тогда 
			 
			Для каждого ТекущаяСтрока Из Контейнеры Цикл 
				СтрокаДляОбновления = ДанныеДляОбновленияКлючейАналитики.Найти(ТекущаяСтрока.НомерСтроки, "НомерСтроки");   
				ВерсияКлючаДоОбновления = СтрокаДляОбновления.КлючАналитикиПеревозки.ВерсияДанных; 
				//Евросиб Коханенко Н.А. 23.07.2024 (( #88706
				//запишем ссылку на запрос на авто в ключ аналитики 
				Если ТекущаяСтрока.СтатусЗапросаНаАвтоперевозку <> Перечисления.СтатусЗапросаНаПеревозку.Отменен Тогда
					Если ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля Тогда
						СтрокаДляОбновления.ДанныеКлюча.СтруктураТЧМилиПерваяМиляКлючаАналитики.ЗапросНаАвто = СсылкаНаЗапросНаАвто;
						//Евросиб Коханенко Н.А. 18.09.2025 (( #119413 
						СтрокаДляОбновления.ДанныеКлюча.СтруктураТЧМилиПерваяМиляКлючаАналитики.ИдентификаторСтрокиЗапросаНаАвтоперевозку = ТекущаяСтрока.ИдентификаторСтрокиТЧ;
						//Евросиб Коханенко Н.А. 18.09.2025 )) #119413 
					//Евросиб Коханенко Н.А. 13.08.2024 (( #87840 
					//Иначе
					//	СтрокаДляОбновления.ДанныеКлюча.СтруктураТЧМилиПоследняяМиляКлючаАналитики.ЗапросНаАвто = СсылкаНаЗапросНаАвто;	
					ИначеЕсли ЭтапПеревозки = Перечисления.ЭтапыПеревозки.СредняяМиля Тогда
						СтрокаДляОбновления.ДанныеКлюча.СтруктураТЧМилиСредняяМиляКлючаАналитики.ЗапросНаАвто = СсылкаНаЗапросНаАвто;		
						//Евросиб Коханенко Н.А. 18.09.2025 (( #119413 
						СтрокаДляОбновления.ДанныеКлюча.СтруктураТЧМилиСредняяМиляКлючаАналитики.ИдентификаторСтрокиЗапросаНаАвтоперевозку = ТекущаяСтрока.ИдентификаторСтрокиТЧ;
						//Евросиб Коханенко Н.А. 18.09.2025 )) #119413 
					ИначеЕсли ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПоследняяМиля Тогда
						СтрокаДляОбновления.ДанныеКлюча.СтруктураТЧМилиПоследняяМиляКлючаАналитики.ЗапросНаАвто = СсылкаНаЗапросНаАвто;		
						//Евросиб Коханенко Н.А. 18.09.2025 (( #119413 
						СтрокаДляОбновления.ДанныеКлюча.СтруктураТЧМилиПоследняяМиляКлючаАналитики.ИдентификаторСтрокиЗапросаНаАвтоперевозку = ТекущаяСтрока.ИдентификаторСтрокиТЧ;
						//Евросиб Коханенко Н.А. 18.09.2025 )) #119413 
					//Евросиб Коханенко Н.А. 13.08.2024 )) #87840 
					КонецЕсли;
				КонецЕсли;
				//Евросиб Коханенко Н.А. 23.07.2024 )) #88706 
				ОбновленныйКлюч = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтрокаДляОбновления.ДанныеКлюча); 
				ТекущаяСтрока.КлючАналитикиПеревозки = ОбновленныйКлюч.КлючАналитикиПеревозки; 
				// ДИТ US 83871 ТА 84799 Сержантова А.С. Начало: 13.05.2024
				Справочники.РейсыАвто.ОбновитьДанныеВАвтоРейсеСтрокиЗапросаНаАвто(ТекущаяСтрока, Заявка, ЭтапПеревозки);
				// ДИТ US 83871 ТА 84799 Сержантова А.С. Конец: 13.05.2024
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	#КонецОбласти   
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Конец: 11.12.2023
	
	//ДИТ Шевченко А.В. US 69272 ТА 69274 04.05.2023 -Начало
	Если ЗначениеЗаполнено(Ссылка) Тогда
		КонтейнерыДоИзменения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,"Контейнеры").Выгрузить();
		Для Каждого СтрокаКонтейнеры Из Контейнеры Цикл
			СтруктураПоискаПоКлючу = Новый Структура("КлючАналитикиПеревозки",СтрокаКонтейнеры.КлючАналитикиПеревозки);
			НайденнаяСтрокаДоИзменения = КонтейнерыДоИзменения.НайтиСтроки(СтруктураПоискаПоКлючу);
			КлючКонтейнер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаКонтейнеры.КлючАналитикиПеревозки,"Контейнер");
			Если НайденнаяСтрокаДоИзменения.Количество() Тогда
				ТЧ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаКонтейнеры.КлючАналитикиПеревозки,"Мили");
				Если ТЧ <> Неопределено Тогда
					Выборка = ТЧ.Выбрать();
					Пока Выборка.Следующий() Цикл
						Если Выборка.ЭтапПеревозки = ЭтапПеревозки Тогда
							Если НайденнаяСтрокаДоИзменения[0].ДатаИВремяВывоза <> Выборка.ДатаВыдачиКТКСТерминала И ЗначениеЗаполнено(Выборка.ДатаВыдачиКТКСТерминала) Тогда
								Если ЗначениеЗаполнено(КлючКонтейнер) И КлючКонтейнер.Наименование = СтрокаКонтейнеры.КонтейнерФакт Тогда
									МассивКлючейСИзменениемДатаИВремаВывоза.Добавить(СтрокаКонтейнеры.КлючАналитикиПеревозки);
								КонецЕсли;
							КонецЕсли;
							Если НайденнаяСтрокаДоИзменения[0].ДатаИВремяСдачи <> Выборка.ДатаСдачиКТКНаТерминал И ЗначениеЗаполнено(Выборка.ДатаСдачиКТКНаТерминал) Тогда
								Если ЗначениеЗаполнено(КлючКонтейнер)Тогда
									МассивКлючейСИзменениемДатаИВремаСдачи.Добавить(СтрокаКонтейнеры.КлючАналитикиПеревозки);
								КонецЕсли;
							КонецЕсли;
							Если НайденнаяСтрокаДоИзменения[0].ДатаЗавершенияОперацииНаСкладеКлиента <> Выборка.ДатаВыездаКТКСоСклада И ЗначениеЗаполнено(Выборка.ДатаВыездаКТКСоСклада) Тогда
								Если ЗначениеЗаполнено(КлючКонтейнер)Тогда
									МассивКлючейСИзменениемДатаЗавершенияОперацииНСкладеКлиента.Добавить(СтрокаКонтейнеры.КлючАналитикиПеревозки);
								КонецЕсли;	
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли			
		КонецЦикла;		
	КонецЕсли;	
	//ДИТ Шевченко А.В. US 69272 ТА 69274 04.05.2023 -Начало 
	
	// ДИТ US 81881 ТА 84217 Сержантова А.С. Начало: 25.04.2024
	Если ДополнительныеСвойства.Свойство("ВыполнитьЗадачуОбновления") и ДополнительныеСвойства.ВыполнитьЗадачуОбновления Тогда
		СтрокиПоОбновлению = Состояния.НайтиСтроки(Новый Структура("Состояние",Справочники.Состояния.НеобходимоОбновитьДанные));
		Если СтрокиПоОбновлению.Количество() Тогда
			СтрокиПоОбновлению[0].ЗавершениеРаботы = ТекущаяДата();
			СтрокиПоОбновлению[0].Статус = Перечисления.СтатусыЭтапов.Выполнен;
		КонецЕсли;
	КонецЕсли;    
	СтрокаЗадачиОтменаРейса = Состояния.НайтиСтроки(Новый Структура("Состояние, Статус",
								Справочники.Состояния.ОтменаРейсаАктуализироватьТерминал, Перечисления.СтатусыЭтапов.Выполнен)); 
	Если СтрокаЗадачиОтменаРейса.Количество() = 1 Тогда
		СтрокаЗадачиОтменаРейса[0].ВыполнениеЗафиксировано = Истина;
		МассивВозвращаемыхЗадач = Новый Массив;
		МассивВозвращаемыхЗадач.Добавить(Справочники.Состояния.ОтменаРейсаАктуализироватьТерминал);
		ДополнительныеСвойства.Вставить("ВозвращаемыеЗадачи", МассивВозвращаемыхЗадач);	
	КонецЕсли;
	МаршрутизацияСервер.ПараллельноеСогласование(Состояния);
	МаршрутизацияСервер.ПостобработкаТЧСостояний(ЭтотОбъект, Автор);
	// ДИТ US 81881 ТА 84217 Сержантова А.С. Конец: 25.04.2024
	
КонецПроцедуры 

// ДИТ BUG 76919 ТА 77021 Сержантова А.С. 07.11.2023  
Процедура ПриЗаписи(Отказ) 
	
	Если ПометкаУдаления и не Отказ Тогда
		СтрокиКвыгрузке = Новый ТаблицаЗначений;
		СтрокиКвыгрузке.Колонки.Добавить("ИдентификаторСтрокиТабличнойЧасти");
		СтрокиКвыгрузке.Колонки.Добавить("ИдентификаторСтрокиТЧ");    
		
		// В ТЛ отменяем только те строки, которые были ранее отправлены
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		//Евросиб Коханенко Н.А. 06.06.2024 (( #83866 
		//|	ПротоколОбменов.ДатаОбмена КАК ДатаСозданияЗаказаНаТС,
		|	ПротоколОбменов.ДатаОбмена КАК ДатаОбновленияЗаказаНаТС,
		//Евросиб Коханенко Н.А. 06.06.2024 )) #83866 
		|	ПротоколОбменов.НомерДатаВБУ КАК НомерЗаказаНаТС,
		|	ПротоколОбменов.УИДИсточника КАК ИдентификаторСтрокиТЧ
		|ИЗ
		|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		|ГДЕ
		|	(ВЫРАЗИТЬ(ПротоколОбменов.Объект КАК Документ.ЗапросНаАвтоперевозку)) = &Объект
		|	И ПротоколОбменов.УзелОбмена = &УзелОбмена";
		
		Запрос.УстановитьПараметр("Объект", Ссылка);
		Запрос.УстановитьПараметр("УзелОбмена", Перечисления.УзлыОбмена.ТЛ);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если не РезультатЗапроса.Пустой() Тогда
			ВыборкаЗаказовВтл = РезультатЗапроса.Выбрать(); 
			Пока ВыборкаЗаказовВтл.Следующий() Цикл
				СтруктураПоиска = Новый Структура("ИдентификаторСтрокиТЧ",ВыборкаЗаказовВтл.ИдентификаторСтрокиТЧ);
				НайденыеСтроки = Контейнеры.НайтиСтроки(СтруктураПоиска);
				Если НайденыеСтроки.Количество() > 0 Тогда
					Стр = СтрокиКВыгрузке.Добавить();
					ЗаполнитьЗначенияСвойств(Стр, ВыборкаЗаказовВтл);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

		ПараметрыВыгрузки = Новый Структура("СсылкаЗапросНаАвтоперевозку, СтрокиКВыгрузке", Ссылка, СтрокиКВыгрузке);
		ЕСОбменСервер.ПередатьЗапросыНаАвтоВТЛ(ПараметрыВыгрузки);
		
		//Евросиб Коханенко Н.А. 24.07.2024 (( #88706
		//При пометке на удаление запроса во всех ключах аналитики перевозки очищаем "Запрос на авто" и "Номер заказа на ТС"
		Для Каждого СтрКонтейнера из Контейнеры Цикл
			СтруктураКлючаАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
			СтруктураКлючаАналитикиПеревозки.КлючАналитики = СтрКонтейнера.КлючАналитикиПеревозки;
			Если ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля Тогда
				СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПерваяМиляКлючаАналитики.ЗапросНаАвто = Документы.ЗапросНаАвтоперевозку.ПустаяСсылка();
				СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПерваяМиляКлючаАналитики.НомерЗаказаНаТС = "";
				//Евросиб Коханенко Н.А. 18.09.2025 (( #119413 
				СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПерваяМиляКлючаАналитики.ИдентификаторСтрокиЗапросаНаАвтоперевозку = "";
				//Евросиб Коханенко Н.А. 18.09.2025 )) #119413 
			ИначеЕсли ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПоследняяМиля Тогда
				СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПоследняяМиляКлючаАналитики.ЗапросНаАвто = Документы.ЗапросНаАвтоперевозку.ПустаяСсылка();
				СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПоследняяМиляКлючаАналитики.НомерЗаказаНаТС = "";
				//Евросиб Коханенко Н.А. 18.09.2025 (( #119413 
				СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПоследняяМиляКлючаАналитики.ИдентификаторСтрокиЗапросаНаАвтоперевозку = "";
				//Евросиб Коханенко Н.А. 18.09.2025 )) #119413 
			//Евросиб Коханенко Н.А. 13.08.2024 (( #87840 
			ИначеЕсли ЭтапПеревозки = Перечисления.ЭтапыПеревозки.СредняяМиля Тогда
				СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиСредняяМиляКлючаАналитики.ЗапросНаАвто = Документы.ЗапросНаАвтоперевозку.ПустаяСсылка();
				СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиСредняяМиляКлючаАналитики.НомерЗаказаНаТС = "";
				//Евросиб Коханенко Н.А. 18.09.2025 (( #119413 
				СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиСредняяМиляКлючаАналитики.ИдентификаторСтрокиЗапросаНаАвтоперевозку = "";
				//Евросиб Коханенко Н.А. 18.09.2025 )) #119413 
			//Евросиб Коханенко Н.А. 13.08.2024 )) #87840 
			КонецЕсли;
			ОбновленныйКлюч = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлючаАналитикиПеревозки);
		КонецЦикла;	
		//Евросиб Коханенко Н.А. 24.07.2024 )) #88706 

	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьЗадачуНесовпадениеПланФактНомераКТК() Экспорт
	НайденноеСостояние = Состояния.НайтиСтроки(Новый Структура("Состояние",Справочники.Состояния.НесовпадениеПланФактНомераКТК));
	Если НайденноеСостояние.Количество() = 0 Тогда
		Исполнитель = Автор;
		
		СтрокаСостояния = Состояния.Добавить();
		СтрокаСостояния.Исполнитель = Исполнитель;
		СтрокаСостояния.Наблюдатель = СтрокаСостояния.Исполнитель;
		СтрокаСостояния.Комментарий = "";																										  
		СтрокаСостояния.Состояние = Справочники.Состояния.НесовпадениеПланФактНомераКТК;
		СтрокаСостояния.ВидНормативаИсполнения = Перечисления.ВидыНормативовИспользования.ЧасовСМоментаСозданияДокумента;
		СтрокаСостояния.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
		
	КонецЕсли;
КонецПроцедуры

Процедура СоздатьЗадачуПередатьКлиентуДанныеПоАвтоперевозке() Экспорт //ДИТ Шевченко А.В. 59965 25.11.2022
	
	НайденноеСостояние = Состояния.НайтиСтроки(Новый Структура("Состояние",Справочники.Состояния.ПередатьКлиентуДанныеПоАвтоперевозке));
	Если НайденноеСостояние.Количество() = 0 Тогда
		Исполнитель = Автор;
		
		СтрокаСостояния = Состояния.Добавить();
		СтрокаСостояния.Исполнитель = Исполнитель;
		СтрокаСостояния.Наблюдатель = СтрокаСостояния.Исполнитель;
		СтрокаСостояния.Комментарий = "";																										  
		СтрокаСостояния.Состояние = Справочники.Состояния.ПередатьКлиентуДанныеПоАвтоперевозке;
		СтрокаСостояния.ВидНормативаИсполнения = Перечисления.ВидыНормативовИспользования.ЧасовСМоментаСозданияДокумента;
		СтрокаСостояния.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	Иначе
		
		Если НайденноеСостояние[0].Статус = Перечисления.СтатусыЭтапов.Выполнен Тогда
			 НайденноеСостояние[0].Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитАктивнуюЗадачуПередатьКлиентуДанныеПоАвтоперевозке() Экспорт //ДИТ Шевченко А.В. 59965 25.11.2022
	
	МассивНаУдаление = Новый Массив;
	НайденноеСостояние = Состояния.НайтиСтроки(Новый Структура("Состояние",Справочники.Состояния.ПередатьКлиентуДанныеПоАвтоперевозке));
	Если НайденноеСостояние.Количество() > 0 Тогда
		Если НЕ НайденноеСостояние[0].Статус = Перечисления.СтатусыЭтапов.Выполнен Тогда
			МассивНаУдаление.Добавить(НайденноеСостояние[0]);	
		КонецЕсли;
		Если МассивНаУдаление.Количество() > 0 Тогда 
			Состояния.Удалить(МассивНаУдаление[0]);        
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры	

Функция ПолучитьПринадлежностьТЕКТКПоЗаявке(Заявка,КТК,ИдентификаторСтрокиУслуги) Экспорт //ДИТ Шевченко А.В. 59965 25.11.2022
	Если НЕ ЗначениеЗаполнено(ИдентификаторСтрокиУслуги) Тогда
		Возврат Перечисления.ПринадлежностьТЕ.КТЕвросиба
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(КТК) И ЗначениеЗаполнено(ИдентификаторСтрокиУслуги) Тогда	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаСоставУслуги.ПринадлежностьТЕ КАК ПринадлежностьТЕ
		|ИЗ
		|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|ГДЕ
		|	ЗаявкаСоставУслуги.Ссылка = &Ссылка
		|	И ЗаявкаСоставУслуги.ГУИДСтроки = &ГУИДСтроки
		|	И ЗаявкаСоставУслуги.НомерКТК = &НомерКТК";
		
		Запрос.УстановитьПараметр("ГУИДСтроки", ИдентификаторСтрокиУслуги);
		Запрос.УстановитьПараметр("Ссылка", Заявка);
		Запрос.УстановитьПараметр("НомерКТК", КТК);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Возврат ВыборкаДетальныеЗаписи.ПринадлежностьТЕ;
		КонецЦикла;
	КонецЕсли;	

	Возврат Неопределено;
	
КонецФункции	

Процедура ОбновитьТаблицуОформленияДокумента(ТаблицаОформленияКолонок,ПолеОформления,ЗначениеСравнения) Экспорт
	СтруктураПоиска = Новый Структура("ИдентификаторСтрокиТЧ",ЗначениеСравнения);
	НайденныеСтроки = ТаблицаОформленияКолонок.НайтиСтроки(СтруктураПоиска);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		НовСтрока = ТаблицаОформленияКолонок.Добавить();
		НовСтрока.ИдентификаторСтрокиТЧ = ЗначениеСравнения;		
		НовСтрока.ИменаКолонок = ПолеОформления;		
	КонецЕсли;
	
	Для Каждого СтрокаОформления Из НайденныеСтроки Цикл
		МассивПолейТаблицы = СтрРазделить(СтрокаОформления.ИменаКолонок,";");
		ПолеНайдено = МассивПолейТаблицы.Найти(ПолеОформления);
		Если ПолеНайдено = Неопределено Тогда
			МассивПолейТаблицы.Добавить(ПолеОформления);
		КонецЕсли;	
		СтрокаОформления.ИменаКолонок = СтрСоединить(МассивПолейТаблицы,";");
	КонецЦикла;
КонецПроцедуры	

Процедура УстановитьГотовКОтправкеДляНовыхСтрок(ДополнительныеСвойства)     
	
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Начало: 20.12.2023  
	ДанныеДляОбновленияКлючейАналитики = Неопределено;
	Если ДополнительныеСвойства.Свойство("ДанныеДляОбновленияКлючейАналитики") Тогда 
		ДанныеДляОбновленияКлючейАналитики = ДополнительныеСвойства.ДанныеДляОбновленияКлючейАналитики;   
	КонецЕсли;
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Конец: 20.12.2023
	
	СтруктураПоиска = Новый Структура("СтатусЗапросаНаАвтоперевозку",Перечисления.СтатусЗапросаНаПеревозку.Черновик);
	НайденныеСтроки = Контейнеры.НайтиСтроки(СтруктураПоиска);
	//ДИТ Шевченко А.В. 60147 03.11.22 -Начало	
	Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл    
		// ДИТ US 76935 ТА 78648 Сержантова А.С. Начало: 20.12.2023 
		// Было:
		//ТаблицаОшибок = ПолучитьТаблицуОшибокПоСтроке(СтрокаТЧ);
		// Стало:
		Если ДанныеДляОбновленияКлючейАналитики <> Неопределено Тогда
			СтрокаДляОбновленияКлюча = ДанныеДляОбновленияКлючейАналитики.Найти(СтрокаТЧ.НомерСтроки, "НомерСтроки");
			СтрокаДляОбновленияКлюча = СтрокаДляОбновленияКлюча.ДанныеКлюча;
		Иначе
			СтрокаДляОбновленияКлюча = Неопределено;
		КонецЕсли;    
		ТаблицаОшибок = ПолучитьТаблицуОшибокПоСтроке(СтрокаТЧ, СтрокаДляОбновленияКлюча);
		// ДИТ US 76935 ТА 78648 Сержантова А.С. Конец: 20.12.2023
		
		Если ТаблицаОшибок.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;	
		
		СтрокаТч.СтатусЗапросаНаАвтоперевозку = Перечисления.СтатусЗапросаНаПеревозку.ГотовКОтправке;
	КонецЦикла;
	//ДИТ Шевченко А.В. 60147 03.11.22 -Конец
КонецПроцедуры	

Функция ПолучитьТаблицыОформленияИзХранилища() Экспорт
	
	СтруктураОтвет = Новый Структура("ТаблицаОформленияТЧ,СписокОформленияШапки",Неопределено,Неопределено);
	
	// ДИТ US 81881 ТА 84217 Сержантова А.С. Начало: 25.04.2024
	// Было:
	//СтруктураОтвет.ТаблицаОформленияТЧ   = ХранилищеОформленияТЧ.Получить();
	//СтруктураОтвет.СписокОформленияШапки = ХранилищеОформленияШапки.Получить(); 
	//Стало:
	ТаблицаОформленияТЧ   = ХранилищеОформленияТЧ.Получить();
	
	//Евросиб Коханенко Н.А. 27.12.2024 (( #91409
	//ТаблицаОформленияТЧ.Свернуть("ИдентификаторСтрокиТЧ, ИменаКолонок"); 
	Если ТаблицаОформленияТЧ <> Неопределено Тогда
		ТаблицаОформленияТЧ.Свернуть("ИдентификаторСтрокиТЧ, ИменаКолонок");
	Иначе
		ТаблицаОформленияТЧ = Новый ТаблицаЗначений;
		ТаблицаОформленияТЧ.Колонки.Добавить("ИдентификаторСтрокиТЧ", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
		ТаблицаОформленияТЧ.Колонки.Добавить("ИменаКолонок", Новый ОписаниеТипов("Строка"));
	КонецЕсли;  
	
	СписокРекОформленияШапки = ХранилищеОформленияШапки.Получить();
	Если СписокРекОформленияШапки = Неопределено Тогда
		СписокРекОформленияШапки = Новый СписокЗначений;
	КонецЕсли;  
	СтруктураОтвет.СписокОформленияШапки = СписокРекОформленияШапки;
	//Евросиб Коханенко Н.А. 27.12.2024 )) #91409 
	
	СтруктураОтвет.ТаблицаОформленияТЧ = ТаблицаОформленияТЧ;
	// ДИТ US 81881 ТА 84217 Сержантова А.С. Конец: 25.04.2024
	
	Возврат СтруктураОтвет;
	
КонецФункции	

Процедура ПоместитьТаблицыОформленияВХранилище(ТаблицаОформленияТЧ,СписокОформленияШапки) Экспорт     
	
	// ДИТ US 81881 ТА 84217 Сержантова А.С. Начало: 25.04.2024
	ТаблицаОформленияТЧ.Свернуть("ИдентификаторСтрокиТЧ, ИменаКолонок");
	// ДИТ US 81881 ТА 84217 Сержантова А.С. Конец: 25.04.2024
	ХранилищеЗнч   = Новый ХранилищеЗначения(ТаблицаОформленияТЧ,Новый СжатиеДанных(9));
	ХранилищеОформленияТЧ    = ХранилищеЗнч;
	ХранилищеШапки = Новый ХранилищеЗначения(СписокОформленияШапки,Новый СжатиеДанных(9));
	ХранилищеОформленияШапки = ХранилищеШапки;
КонецПроцедуры	

// ДИТ US 78233 TA 79764 Сержантова А.С. Начало: 23.01.2024
Функция ПолучитьОтправленныеДанныеВТЛИзХранилища() Экспорт
	
	СтруктураОтвет = Новый Структура("ДанныеКлюча,ДетализацияГруза",Неопределено,Неопределено);
	
	СтруктураСохранения = ХранилищеДанныеКлючаОтправленныеВТЛ.Получить();
	Если СтруктураСохранения <> Неопределено Тогда
		СтруктураОтвет.ДанныеКлюча   	= СтруктураСохранения.ДанныеКлюча;
		СтруктураОтвет.ДетализацияГруза = СтруктураСохранения.ДетализацияГруза;	
	КонецЕсли;

	Возврат СтруктураОтвет;
	
КонецФункции	

Процедура ПоместитьОтправленныеДанныеВТЛВХранилище(ТаблицаДанныхКлюча,ТаблицаДетализацииГруза) Экспорт 
	
	СтруктураСохранения = Новый Структура("ДанныеКлюча, ДетализацияГруза", ТаблицаДанныхКлюча, ТаблицаДетализацииГруза);
	ХранилищеДанных = Новый ХранилищеЗначения(СтруктураСохранения, Новый СжатиеДанных(9));
	ХранилищеДанныеКлючаОтправленныеВТЛ = ХранилищеДанных; 
	
КонецПроцедуры
// ДИТ US 78233 TA 79764 Сержантова А.С. Конец: 23.01.2024

Процедура ПроверитьВозможностьОтменыДокумента(Отказ)
	
	МассивОтбор = Новый Массив;
	МассивОтбор.Добавить(Перечисления.СтатусЗаказаНаТс.ВыданВРейс);
	МассивОтбор.Добавить(Перечисления.СтатусЗаказаНаТс.Закрыт);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗапросНаАвтоперевозкуКонтейнеры.НомерСтроки КАК НомерСтроки,
		|	ЗапросНаАвтоперевозкуКонтейнеры.СтатусЗаказаНаТС КАК СтатусЗаказаНаТС
		|ИЗ
		|	Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
		|ГДЕ
		|	ЗапросНаАвтоперевозкуКонтейнеры.Ссылка = &Ссылка
		|	И ЗапросНаАвтоперевозкуКонтейнеры.СтатусЗаказаНаТС В(&СтатусЗаказаНаТС)
		|ИТОГИ ПО
		|	СтатусЗаказаНаТС";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("СтатусЗаказаНаТС", МассивОтбор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСтатусЗаказаНаТС = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСтатусЗаказаНаТС.Следующий() Цикл
	
		ВыборкаДетальныеЗаписи = ВыборкаСтатусЗаказаНаТС.Выбрать();
		
		МассивНомеровСтрок = Новый Массив;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			МассивНомеровСтрок.Добавить(ВыборкаДетальныеЗаписи.НомерСтроки);
		КонецЦикла;
		
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Документ нельзя отменить! Строки %1 находятся в статусе: %2",СтрСоединить(МассивНомеровСтрок,","),ВыборкаСтатусЗаказаНаТС.СтатусЗаказаНаТС),,,,Отказ);
		
	КонецЦикла;
	
КонецПроцедуры	

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив();
	
	НепроверяемыеРеквизиты.Добавить("Контейнеры.ТерминалВыдачи");
	НепроверяемыеРеквизиты.Добавить("Контейнеры.ТерминалСдачи");
	НепроверяемыеРеквизиты.Добавить("Контейнеры.ТипОперацииНаТерминалеВыдачи");
	НепроверяемыеРеквизиты.Добавить("Контейнеры.ТипОперацииНаСкладеКлиента");
	НепроверяемыеРеквизиты.Добавить("Контейнеры.ТипОперацииНаТерминалеСдачи");
	//ДИТ Шевченко А.В. 60147 03.11.22 -Начало
	НепроверяемыеРеквизиты.Добавить("Контейнеры.ДатаВремяПодачиКТК");
	НепроверяемыеРеквизиты.Добавить("Контейнеры.ТипКТК");
	НепроверяемыеРеквизиты.Добавить("Контейнеры.ГрузУдалить");
	НепроверяемыеРеквизиты.Добавить("Контейнеры.ВесГрузаНетто");
	НепроверяемыеРеквизиты.Добавить("Контейнеры.Экспедирование");	
	НепроверяемыеРеквизиты.Добавить("Контейнеры.СтатусЗапросаНаАвтоперевозку");
	//ДИТ Шевченко А.В. 60147 03.11.22 -Конец

	СтатусыНепроверяемыхСтрок = Новый Массив;
	СтатусыНепроверяемыхСтрок.Добавить(Перечисления.СтатусЗапросаНаПеревозку.Отменен);
	СтатусыНепроверяемыхСтрок.Добавить(Перечисления.СтатусЗапросаНаПеревозку.Черновик);
	
	ТекстОшибки = "Не заполнена колонка %1 в строке %2 списка ""Контейнеры""";

	//Евросиб Коханенко Н.А. 12.03.2024 (( #82185 
	ЭтоИмпортМоре = (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Заявка, "ВидПеревозки") = ПредопределенноеЗначение("Справочник.ВидыПеревозок.ИмпортМоре"));
	//Евросиб Коханенко Н.А. 12.03.2024 )) #82185 
	
	Для Каждого СтрокаТЧ Из Контейнеры Цикл
		//ДИТ Шевченко А.В. 60147 03.11.22 -Начало
		Если СтатусыНепроверяемыхСтрок.Найти(СтрокаТЧ.СтатусЗапросаНаАвтоперевозку) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
			//Евросиб Коханенко Н.А. 12.03.2024 (( #82185 
			//ТаблицаОшибок = ПолучитьТаблицуОшибокПоСтроке(СтрокаТЧ);
			ТаблицаОшибок = ПолучитьТаблицуОшибокПоСтроке(СтрокаТЧ,, ЭтоИмпортМоре);
		    //Евросиб Коханенко Н.А. 12.03.2024 )) #82185 

		Для Каждого СтрокаОшибки Из ТаблицаОшибок Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(ТекстОшибки,СтрокаОшибки.ИмяКолонки,СтрокаТЧ.НомерСтроки),ЭтотОбъект,"Контейнеры["+ Контейнеры.Индекс(СтрокаТЧ) +"]."+СтрокаОшибки.ИмяКолонкиМетаданных+"",,Отказ);
		КонецЦикла;
		//ДИТ Шевченко А.В. 60147 03.11.22 -Конец
	КонецЦикла;	
  ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
КонецПроцедуры

//Евросиб Коханенко Н.А. 12.03.2024 (( #82185 
//Функция ПолучитьТаблицуОшибокПоСтроке(СтрокаТЧ, СтрокаДляОбновленияКлюча = Неопределено) //ДИТ Шевченко А.В. 60147 03.11.22
Функция ПолучитьТаблицуОшибокПоСтроке(СтрокаТЧ, СтрокаДляОбновленияКлюча = Неопределено, ЭтоИмпортМоре = Истина)
//Евросиб Коханенко Н.А. 12.03.2024 )) #82185 

	//БИТ Белинский Д.А. 01.07.2023 -начало
	КонтрагентДирекцияКонтейнерныхПеревозок = Ложь;
	Если Контрагент = Константы.КонтрагентДирекцияКонтейнерныхПеревозок.Получить() Тогда 
		КонтрагентДирекцияКонтейнерныхПеревозок = Истина;	
	КонецЕсли;             
	//БИТ Белинский Д.А. 01.07.2023 -конец
	
	ТаблицаОтвет = Новый ТаблицаЗначений;
	ТаблицаОтвет.Колонки.Добавить("ИмяКолонки");
	ТаблицаОтвет.Колонки.Добавить("ИмяКолонкиМетаданных");
	
	Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ДатаВремяПодачиКТК) Тогда	
		НовСтрока = ТаблицаОтвет.Добавить();
		НовСтрока.ИмяКолонки = """Дата время подачи КТК""";
		НовСтрока.ИмяКолонкиМетаданных = "ДатаВремяПодачиКТК";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ТипКТК) Тогда
		НовСтрока = ТаблицаОтвет.Добавить();
		НовСтрока.ИмяКолонки = """Тип КТК""";
		НовСтрока.ИмяКолонкиМетаданных = "ТипКТК";
	КонецЕсли;
	
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Начало: 18.12.2023
	// Было:
	//Если НЕ КонтрагентДирекцияКонтейнерныхПеревозок И НЕ ЗначениеЗаполнено(СтрокаТЧ.КлючАналитикиПеревозки.Груз) Тогда //ДИТ Шевченко А.В. US 62421 TA 64345 06.02.2023
	//	НовСтрока = ТаблицаОтвет.Добавить();
	//	НовСтрока.ИмяКолонки = """Груз""";
	//	НовСтрока.ИмяКолонкиМетаданных = "Груз";
	//КонецЕсли;    
	// Стало:
	Если НЕ КонтрагентДирекцияКонтейнерныхПеревозок 
		И СтрокаДляОбновленияКлюча <> Неопределено 
		//Евросиб Коханенко Н.А. 19.02.2025 (( #102955 
		И НЕ ЭтапПеревозки = ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.СредняяМиля")
		//Евросиб Коханенко Н.А. 19.02.2025 )) #102955 
		и НЕ ЗначениеЗаполнено(СтрокаДляОбновленияКлюча.Груз)  Тогда
		НовСтрока = ТаблицаОтвет.Добавить();
		НовСтрока.ИмяКолонки = """Груз""";
		НовСтрока.ИмяКолонкиМетаданных = "Груз";
	КонецЕсли;
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Конец: 18.12.2023
	
	Если  НЕ КонтрагентДирекцияКонтейнерныхПеревозок И НЕ ЗначениеЗаполнено(СтрокаТЧ.ВесГрузаНетто) Тогда
		НовСтрока = ТаблицаОтвет.Добавить();
		НовСтрока.ИмяКолонки = """Вес груза нетто, кг""";
		НовСтрока.ИмяКолонкиМетаданных = "ВесГрузаНетто";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Экспедирование) Тогда
		НовСтрока = ТаблицаОтвет.Добавить();
		НовСтрока.ИмяКолонки = """Экспедирование""";
		НовСтрока.ИмяКолонкиМетаданных = "Экспедирование";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СтатусЗапросаНаАвтоперевозку) Тогда
		НовСтрока = ТаблицаОтвет.Добавить();
		НовСтрока.ИмяКолонки = """Статус запроса на автоперевозку""";
		НовСтрока.ИмяКолонкиМетаданных = "СтатусЗапросаНаАвтоперевозку";
	КонецЕсли;
	
	Если НЕ СтрокаТЧ.НеТребуетсяТерминалВыдачи И НЕ ЗначениеЗаполнено(СтрокаТЧ.ТерминалВыдачи) Тогда
		НовСтрока = ТаблицаОтвет.Добавить();
		НовСтрока.ИмяКолонки = """Терминал выдачи""";
		НовСтрока.ИмяКолонкиМетаданных = "ТерминалВыдачи";	
	КонецЕсли;
	
	Если НЕ СтрокаТЧ.НеТребуетсяТерминалВыдачи И НЕ ЗначениеЗаполнено(СтрокаТЧ.ТипОперацииНаТерминалеВыдачи) Тогда
		НовСтрока = ТаблицаОтвет.Добавить();
		НовСтрока.ИмяКолонки = """Тип операции на терминале выдачи""";
		НовСтрока.ИмяКолонкиМетаданных = "ТипОперацииНаТерминалеВыдачи";	
	КонецЕсли;
	
	//Евросиб Коханенко Н.А. 12.03.2024 (( #82185 
	//Если НЕ СтрокаТЧ.НеТребуетсяТерминалСдачи И НЕ ЗначениеЗаполнено(СтрокаТЧ.ТерминалСдачи) Тогда
	Если НЕ СтрокаТЧ.НеТребуетсяТерминалСдачи 
		И НЕ ЗначениеЗаполнено(СтрокаТЧ.ТерминалСдачи)
		И НЕ ЭтоИмпортМоре Тогда
	//Евросиб Коханенко Н.А. 12.03.2024 )) #82185 
		НовСтрока = ТаблицаОтвет.Добавить();
		НовСтрока.ИмяКолонки = """Терминал сдачи""";
		НовСтрока.ИмяКолонкиМетаданных = "ТерминалСдачи";
	КонецЕсли;
	
	//Евросиб Коханенко Н.А. 12.03.2024 (( #82185 
	//Если НЕ СтрокаТЧ.НеТребуетсяТерминалСдачи И НЕ ЗначениеЗаполнено(СтрокаТЧ.ТипОперацииНаТерминалеСдачи) Тогда
	Если НЕ СтрокаТЧ.НеТребуетсяТерминалСдачи 
		И НЕ ЗначениеЗаполнено(СтрокаТЧ.ТипОперацииНаТерминалеСдачи) 
		И НЕ ЭтоИмпортМоре Тогда
	//Евросиб Коханенко Н.А. 12.03.2024 )) #82185 
		НовСтрока = ТаблицаОтвет.Добавить();
		НовСтрока.ИмяКолонки = """Тип операции на терминале сдачи""";
		НовСтрока.ИмяКолонкиМетаданных = "ТипОперацииНаТерминалеСдачи";
	КонецЕсли;
	
	//Евросиб Коханенко Н.А. 12.03.2024 (( #82185 
	//Если НЕ СтрокаТЧ.НеТребуетсяАдрес И НЕ ЗначениеЗаполнено(СтрокаТЧ.ТипОперацииНаСкладеКлиента) Тогда
	Если НЕ СтрокаТЧ.НеТребуетсяАдрес 
		И НЕ ЗначениеЗаполнено(СтрокаТЧ.ТипОперацииНаСкладеКлиента)
		И НЕ ЭтоИмпортМоре Тогда
	//Евросиб Коханенко Н.А. 12.03.2024 )) #82185 
		НовСтрока = ТаблицаОтвет.Добавить();
		НовСтрока.ИмяКолонки = """Тип операции на складе клиента""";
		НовСтрока.ИмяКолонкиМетаданных = "ТипОперацииНаСкладеКлиента";
	КонецЕсли;
	
	Возврат ТаблицаОтвет;
	
КонецФункции	

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//ДИТ Шевченко А.В. US 69272 ТА 69274 04.05.2023 -Начало
	ТзМилиПоКлючамСИзмДатыВывоза = Справочники.КлючиАналитикиПеревозки.КлючиАналитикиЗначенияПолейПоЭтапуПеревозки(МассивКлючейСИзменениемДатаИВремаВывоза,ЭтапПеревозки);
	ТзМилиПоКлючамСИзмДатыСдачи = Справочники.КлючиАналитикиПеревозки.КлючиАналитикиЗначенияПолейПоЭтапуПеревозки(МассивКлючейСИзменениемДатаИВремаСдачи,ЭтапПеревозки);
	ТзМилиПоКлючамСИзмДатыЗавНаСкладе = Справочники.КлючиАналитикиПеревозки.КлючиАналитикиЗначенияПолейПоЭтапуПеревозки(МассивКлючейСИзменениемДатаЗавершенияОперацииНСкладеКлиента,ЭтапПеревозки);
	//СлужебнаяТаблицаКлючейДат = Новый ТаблицаЗначений;
	//СлужебнаяТаблицаКлючейДат.Колонки.Добавить("КлючАналитикиПеревозки");
	//СлужебнаяТаблицаКлючейДат.Колонки.Добавить("ДатаВыдачиКТКСТерминала");
	//СлужебнаяТаблицаКлючейДат.Колонки.Добавить("ДатаСдачиКТКНаТерминал");
	//СлужебнаяТаблицаКлючейДат.Колонки.Добавить("ДатаВыездаКТКСоСклада");
	
	Для Каждого ЗнчМассива Из МассивКлючейСИзменениемДатаИВремаВывоза Цикл	
		СтруктураПоискаСтроки = Новый Структура("КлючАналитикиПеревозки",ЗнчМассива);
		НайденнаяСтрока = Контейнеры.НайтиСтроки(СтруктураПоискаСтроки);
		СтрокаМили      = ТзМилиПоКлючамСИзмДатыВывоза.НайтиСтроки(СтруктураПоискаСтроки);
		
		НаборЗаписей = РегистрыСведений.ИнформацияОтАвтоподрядчиков.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Период.Установить(СтрокаМили[0].ДатаВыдачиКТКСТерминала);
		НаборЗаписей.Отбор.КлючАналитикиПеревозки.Установить(ЗнчМассива);
		НаборЗаписей.Отбор.Статус.Установить(Справочники.ОперацииСВагонами.ВывозКонтейнераСКонтПункта);
		
		Движение = НаборЗаписей.Добавить();
		Движение.КлючАналитикиПеревозки = ЗнчМассива;
		Движение.Период 				= СтрокаМили[0].ДатаВыдачиКТКСТерминала;
		Движение.ДатаВнесенияДанных 	= ТекущаяДата();
		Движение.Статус 				= Справочники.ОперацииСВагонами.ВывозКонтейнераСКонтПункта;  
		// ДИТ US 78243 ТА 84426 Сержантова А.С. Начало: 22.04.2024
		// Было:      
		//Движение.АдресМестаОперацииСКТК = НайденнаяСтрока[0].ТерминалВыдачи.Адрес;
		//Движение.Терминал 				= НайденнаяСтрока[0].ТерминалВыдачи; 
		//Стало:   
		Движение.АдресМестаОперацииСКТК = НайденнаяСтрока[0].ТерминалВыдачиФакт.Адрес;
		Движение.Терминал 				= НайденнаяСтрока[0].ТерминалВыдачиФакт; 
		// ДИТ US 78243 ТА 84426 Сержантова А.С. Конец: 22.04.2024
		Движение.Состояние 				= НайденнаяСтрока[0].ТипОперацииНаТерминалеВыдачи = Перечисления.ТипОперацииНаТерминале.ПриемГруженогоКТК;
		Движение.Нетто 					= НайденнаяСтрока[0].ВесГрузаНетто;
		Движение.НомерРелиза 			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НайденнаяСтрока[0].Релиз,"НомерРелиза");
		// ДИТ US 79379 ТА 80813 Сержантова А.С. Начало: 29.02.2024
		Движение.ФИОВодителя			= СтрокаМили[0].ФИОВодителя;
		Движение.НомерТранспорта		= СтрокаМили[0].РегНомерТС;
		// ДИТ US 79379 ТА 80813 Сержантова А.С. Конец: 29.02.2024
		НаборЗаписей.Записать(Истина);
		//НовСтрока = СлужебнаяТаблицаКлючейДат.Добавить();
		//НовСтрока.КлючАналитикиПеревозки = ЗнчМассива;
		//НовСтрока.ДатаВыдачиКТКСТерминала = СтрокаМили[0].ДатаВыдачиКТКСТерминала;
	КонецЦикла;
	Для Каждого ЗнчМассива Из МассивКлючейСИзменениемДатаИВремаСдачи Цикл
		СтруктураПоискаСтроки = Новый Структура("КлючАналитикиПеревозки",ЗнчМассива);
		НайденнаяСтрока = Контейнеры.НайтиСтроки(СтруктураПоискаСтроки);
		СтрокаМили      = ТзМилиПоКлючамСИзмДатыСдачи.НайтиСтроки(СтруктураПоискаСтроки);
		
		НаборЗаписей = РегистрыСведений.ИнформацияОтАвтоподрядчиков.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Период.Установить(СтрокаМили[0].ДатаСдачиКТКНаТерминал);
		НаборЗаписей.Отбор.КлючАналитикиПеревозки.Установить(ЗнчМассива);
		НаборЗаписей.Отбор.Статус.Установить(Справочники.ОперацииСВагонами.ЗавозНаКонтейнерныйПункт);
		
		Движение 						= НаборЗаписей.Добавить();
		Движение.КлючАналитикиПеревозки = ЗнчМассива;
		Движение.Период 				= СтрокаМили[0].ДатаСдачиКТКНаТерминал;
		Движение.ДатаВнесенияДанных 	= ТекущаяДата();
		Движение.Статус 				= Справочники.ОперацииСВагонами.ЗавозНаКонтейнерныйПункт;
		// ДИТ US 78243 ТА 84426 Сержантова А.С. Начало: 22.04.2024
		// Было:    
		//Движение.АдресМестаОперацииСКТК = НайденнаяСтрока[0].ТерминалСдачи.Адрес;
		//Движение.Терминал 				= НайденнаяСтрока[0].ТерминалСдачи; 
		//Стало:           
		Движение.АдресМестаОперацииСКТК = НайденнаяСтрока[0].ТерминалСдачиФакт.Адрес;
		Движение.Терминал 				= НайденнаяСтрока[0].ТерминалСдачиФакт;
		// ДИТ US 78243 ТА 84426 Сержантова А.С. Конец: 22.04.2024
		Движение.Состояние 				= НайденнаяСтрока[0].ТипОперацииНаТерминалеСдачи = Перечисления.ТипОперацииНаТерминале.СдачаГруженогоКТК;
		Движение.Нетто 					= НайденнаяСтрока[0].ВесГрузаНетто;
		// ДИТ US 79379 ТА 80813 Сержантова А.С. Начало: 29.02.2024
		Движение.ФИОВодителя			= СтрокаМили[0].ФИОВодителя;
		Движение.НомерТранспорта		= СтрокаМили[0].РегНомерТС;
		// ДИТ US 79379 ТА 80813 Сержантова А.С. Конец: 29.02.2024
		НаборЗаписей.Записать(Истина);
		//СлужебныеСтроки = СлужебнаяТаблицаКлючейДат.НайтиСтроки(СтруктураПоискаСтроки);
		//Для Каждого СтрСлж Из СлужебныеСтроки Цикл
		//	Если СтрСлж.ДатаВыдачиКТКСТерминала = Движение.Период Тогда
		//		Движение.Период 				= Движение.Период+1;
		//		СтрСлж.ДатаСдачиКТКНаТерминал   = Движение.Период;
		//	КонецЕсли;	
		//КонецЦикла;
		//Если НЕ СлужебныеСтроки.Количество() Тогда
		//	НовСтрока = СлужебнаяТаблицаКлючейДат.Добавить();
		//	НовСтрока.КлючАналитикиПеревозки = ЗнчМассива;
		//	НовСтрока.ДатаСдачиКТКНаТерминал = СтрокаМили[0].ДатаСдачиКТКНаТерминал;
		//КонецЕсли;	
	КонецЦикла;
	Для Каждого ЗнчМассива Из МассивКлючейСИзменениемДатаЗавершенияОперацииНСкладеКлиента Цикл
		СтруктураПоискаСтроки = Новый Структура("КлючАналитикиПеревозки",ЗнчМассива);
		НайденнаяСтрока = Контейнеры.НайтиСтроки(СтруктураПоискаСтроки);
		СтрокаМили      = ТзМилиПоКлючамСИзмДатыЗавНаСкладе.НайтиСтроки(СтруктураПоискаСтроки);
		
		НаборЗаписей = РегистрыСведений.ИнформацияОтАвтоподрядчиков.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Период.Установить(СтрокаМили[0].ДатаВыездаКТКСоСклада);
		НаборЗаписей.Отбор.КлючАналитикиПеревозки.Установить(ЗнчМассива);
		Если НайденнаяСтрока[0].ТипОперацииНаСкладеКлиента = Перечисления.ТипОперацииНаТерминале.ЗагрузкаПорожнегоКТК Тогда
			НаборЗаписей.Отбор.Статус.Установить(Справочники.ОперацииСВагонами.ОкончаниеОперацииПогрузки);
		КонецЕсли;
		Если НайденнаяСтрока[0].ТипОперацииНаСкладеКлиента = Перечисления.ТипОперацииНаТерминале.РазгрузкаГруженогоКТК Тогда
			НаборЗаписей.Отбор.Статус.Установить(Справочники.ОперацииСВагонами.ОкончаниеОперацииВыгрузки);
		КонецЕсли;
		
		
		Движение 						= НаборЗаписей.Добавить();
		Движение.КлючАналитикиПеревозки = ЗнчМассива;
		Движение.Период 				= СтрокаМили[0].ДатаВыездаКТКСоСклада;
		Движение.ДатаВнесенияДанных 	= ТекущаяДата();
		Если НайденнаяСтрока[0].ТипОперацииНаСкладеКлиента = Перечисления.ТипОперацииНаТерминале.ЗагрузкаПорожнегоКТК Тогда
			Движение.Статус 				= Справочники.ОперацииСВагонами.ОкончаниеОперацииПогрузки;
		КонецЕсли;
		Если НайденнаяСтрока[0].ТипОперацииНаСкладеКлиента = Перечисления.ТипОперацииНаТерминале.РазгрузкаГруженогоКТК Тогда
			Движение.Статус 				= Справочники.ОперацииСВагонами.ОкончаниеОперацииВыгрузки;
		КонецЕсли;  
		// ДИТ US 78243 ТА 84426 Сержантова А.С. Начало: 22.04.2024
		// Было:
		//Движение.АдресМестаОперацииСКТК = СтрокаМили[0].АдресКлиента; 
		//Стало:
		Движение.АдресМестаОперацииСКТК = НайденнаяСтрока[0].АдресСкладаФакт;
		// ДИТ US 78243 ТА 84426 Сержантова А.С. Конец: 22.04.2024
		Движение.Терминал 				= Справочники.Локации.СкладКлиента;
		Движение.Состояние 				= НайденнаяСтрока[0].ТипОперацииНаСкладеКлиента = Перечисления.ТипОперацииНаТерминале.ЗагрузкаПорожнегоКТК;
		Движение.Нетто 					= НайденнаяСтрока[0].ВесГрузаНетто;         
		// ДИТ US 79379 ТА 80813 Сержантова А.С. Начало: 29.02.2024
		Движение.ФИОВодителя			= СтрокаМили[0].ФИОВодителя;
		Движение.НомерТранспорта		= СтрокаМили[0].РегНомерТС;
		// ДИТ US 79379 ТА 80813 Сержантова А.С. Конец: 29.02.2024
		НаборЗаписей.Записать(Истина);
		//СлужебныеСтроки = СлужебнаяТаблицаКлючейДат.НайтиСтроки(СтруктураПоискаСтроки);
		//Для Каждого СтрСлж Из СлужебныеСтроки Цикл
		//	Если СтрСлж.ДатаВыдачиКТКСТерминала = Движение.Период Тогда
		//		Движение.Период 				= Движение.Период+1;
		//	КонецЕсли;
		//	Если СтрСлж.ДатаСдачиКТКНаТерминал = Движение.Период Тогда
		//		Движение.Период 				= Движение.Период+1;
		//	КонецЕсли;
		//КонецЦикла;
	КонецЦикла; 
	
	//ДИТ Шевченко А.В. US 69272 ТА 69274 04.05.2023 -Конец
КонецПроцедуры

//Евросиб Коханенко Н.А. 01.03.2024 (( #80981 
Функция ОбновитьСтоимостьВЗапросеНаАвто(ЗаписыватьИзменения = Ложь) Экспорт
		
	НеобходимаЗаписьОбъекта = Ложь;
	
    ТаблицаДанныхИзКалькуляций = ПолучитьТаблицуСтоимостиУслугАвтоперевозкиИзКалькуляций(Ссылка);

	Для Каждого СтрокаКонтейнеры Из Контейнеры Цикл
		СтруктураПоиска = Новый Структура("ИдентификаторСтрокиУслуги", СтрокаКонтейнеры.ИдентификаторСтрокиУслуги);
		НайденныеСтроки = ТаблицаДанныхИзКалькуляций.НайтиСтроки(СтруктураПоиска);
		ЗапросСвязанСКалькуляцией = НайденныеСтроки.Количество() > 0;
		//Если ЗапросСвязанСКалькуляцией Тогда
		//	Если СтрокаКонтейнеры.СтавкаНДС <> НайденныеСтроки[0].СтавкаНДС Тогда
		//		СтрокаКонтейнеры.СтавкаНДС = НайденныеСтроки[0].СтавкаНДС;
		//		НеобходимаЗаписьОбъекта = Истина;
		//	КонецЕсли;
		//	Если СтрокаКонтейнеры.СтоимостьАвтоперевозкиЗаложеннаяПриРасчете <> НайденныеСтроки[0].СтоимостьАвтоперевозкиЗаложеннаяПриРасчете Тогда
		//		СтрокаКонтейнеры.СтоимостьАвтоперевозкиЗаложеннаяПриРасчете = НайденныеСтроки[0].СтоимостьАвтоперевозкиЗаложеннаяПриРасчете;
		//		НеобходимаЗаписьОбъекта = Истина;
		//	КонецЕсли;
		//Иначе
		//	Если СтрокаКонтейнеры.СтавкаНДС <> Перечисления.СтавкиНДС.ПустаяСсылка() Тогда
		//		СтрокаКонтейнеры.СтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка();
		//		НеобходимаЗаписьОбъекта = Истина;
		//	КонецЕсли;
		//	Если СтрокаКонтейнеры.СтоимостьАвтоперевозкиЗаложеннаяПриРасчете <> 0 Тогда
		//		СтрокаКонтейнеры.СтоимостьАвтоперевозкиЗаложеннаяПриРасчете = 0;
		//		НеобходимаЗаписьОбъекта = Истина;
		//	КонецЕсли;
		//КонецЕсли;
		НовоеЗначениеСтавкиНДС = ?(ЗапросСвязанСКалькуляцией, НайденныеСтроки[0].СтавкаНДС, Перечисления.СтавкиНДС.ПустаяСсылка());
		НовоеЗначениеСтоимости = ?(ЗапросСвязанСКалькуляцией, НайденныеСтроки[0].СтоимостьАвтоперевозкиЗаложеннаяПриРасчете, 0);
		Если СтрокаКонтейнеры.СтавкаНДС <> НовоеЗначениеСтавкиНДС Тогда
			СтрокаКонтейнеры.СтавкаНДС = НовоеЗначениеСтавкиНДС;
			СтрокаКонтейнеры.ОбновленыИсходныеДанные = Истина;
			НеобходимаЗаписьОбъекта = Истина;
		КонецЕсли;
		Если СтрокаКонтейнеры.СтоимостьАвтоперевозкиЗаложеннаяПриРасчете <> НовоеЗначениеСтоимости Тогда
			СтрокаКонтейнеры.СтоимостьАвтоперевозкиЗаложеннаяПриРасчете = НовоеЗначениеСтоимости;
			СтрокаКонтейнеры.ОбновленыИсходныеДанные = Истина;
			НеобходимаЗаписьОбъекта = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗаписыватьИзменения 
			И НеобходимаЗаписьОбъекта Тогда
		Попытка
			Записать();
		Исключение
			ЗаписьЖурналаРегистрации("ОшибкаЗаписиЗапросаНаАвтоперевозку", УровеньЖурналаРегистрации.Ошибка, 
										Метаданные(), Ссылка, ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли; 
	
	Возврат НеобходимаЗаписьОбъекта; 
		
КонецФункции //Евросиб Коханенко Н.А. 01.03.2024 )) #80981

//Евросиб Коханенко Н.А. 22.02.2024 (( #80981
Функция ПолучитьТаблицуСтоимостиУслугАвтоперевозкиИзКалькуляций(ЗапросНаАвтоперевозкуСсылка) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗапросНаАвтоперевозкуКонтейнеры.Ссылка.ЭтапПеревозки КАК ЭтапПеревозки,
		|	ЗапросНаАвтоперевозкуКонтейнеры.ТипКТК.РазмерКТК КАК РазмерКТК,
		|	ЗапросНаАвтоперевозкуКонтейнеры.ИдентификаторСтрокиУслуги КАК ИдентификаторСтрокиУслуги,
		|	ЗапросНаАвтоперевозкуКонтейнеры.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	ЗапросНаАвтоперевозкуКонтейнеры.НеТребуетсяТерминалВыдачи КАК НеТребуетсяТерминалВыдачи,
		|	ЗапросНаАвтоперевозкуКонтейнеры.НеТребуетсяТерминалСдачи КАК НеТребуетсяТерминалСдачи,
		|	ЗапросНаАвтоперевозкуКонтейнеры.НеТребуетсяАдрес КАК НеТребуетсяАдрес,
		|	ЕСТЬNULL(ИерархияЛокацийТерминалВыдачи.ЛокацияВышестоящегоУровня, NULL) КАК ТерминалВыдачиЛВУ,
		|	ЕСТЬNULL(ИерархияЛокацийТерминалСдачи.ЛокацияВышестоящегоУровня, NULL) КАК ТерминалСдачиЛВУ,
		|	ЕСТЬNULL(ИерархияЛокацийАдресКлиента.ЛокацияВышестоящегоУровня, NULL) КАК АдресКлиентаЛВУ
		|ПОМЕСТИТЬ вт_Запрос
		|ИЗ
		|	Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокацийТерминалВыдачи
		|		ПО (НЕ ЗапросНаАвтоперевозкуКонтейнеры.НеТребуетсяТерминалВыдачи)
		|			И ЗапросНаАвтоперевозкуКонтейнеры.ТерминалВыдачи.ЛокацияВышестоящегоУровня = ИерархияЛокацийТерминалВыдачи.Локация
		|			И (ИерархияЛокацийТерминалВыдачи.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.Регион))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокацийТерминалСдачи
		|		ПО (НЕ ЗапросНаАвтоперевозкуКонтейнеры.НеТребуетсяТерминалСдачи)
		|			И (ИерархияЛокацийТерминалСдачи.Локация = ЗапросНаАвтоперевозкуКонтейнеры.ТерминалСдачи.ЛокацияВышестоящегоУровня)
		|			И (ИерархияЛокацийТерминалСдачи.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.Регион))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
		|		ПО ЗапросНаАвтоперевозкуКонтейнеры.КлючАналитикиПеревозки = КлючиАналитикиПеревозкиМили.Ссылка
		|			И ЗапросНаАвтоперевозкуКонтейнеры.Ссылка.ЭтапПеревозки = КлючиАналитикиПеревозкиМили.ЭтапПеревозки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокацийАдресКлиента
		|		ПО (НЕ ЗапросНаАвтоперевозкуКонтейнеры.НеТребуетсяАдрес)
		|			И (ИерархияЛокацийАдресКлиента.Локация = КлючиАналитикиПеревозкиМили.АдресКлиента.ЛокацияВышестоящегоУровня)
		|			И (ИерархияЛокацийАдресКлиента.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.Регион))
		|ГДЕ
		|	ЗапросНаАвтоперевозкуКонтейнеры.Ссылка = &ЗапросНаАвтоперевозкуСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Запрос.ЭтапПеревозки КАК ЭтапПеревозки,
		|	вт_Запрос.РазмерКТК КАК РазмерКТК,
		|	вт_Запрос.ТерминалВыдачиЛВУ КАК ТерминалВыдачиЛВУ,
		|	вт_Запрос.ТерминалСдачиЛВУ КАК ТерминалСдачиЛВУ,
		|	вт_Запрос.АдресКлиентаЛВУ КАК АдресКлиентаЛВУ,
		|	вт_Запрос.НеТребуетсяТерминалВыдачи КАК НеТребуетсяТерминалВыдачи,
		|	вт_Запрос.НеТребуетсяТерминалСдачи КАК НеТребуетсяТерминалСдачи,
		|	вт_Запрос.НеТребуетсяАдрес КАК НеТребуетсяАдрес,
		|	ЕСТЬNULL(ИерархияЛокацийПунктОтправления.ЛокацияВышестоящегоУровня, NULL) КАК ПунктОтправленияЛВУ,
		|	ЕСТЬNULL(ИерархияЛокацийПунктНазначения.ЛокацияВышестоящегоУровня, NULL) КАК ПунктНазначенияЛВУ,
		|	ВЫБОР
		|		КОГДА вт_Запрос.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К40)
		|			ТОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Итого40
		|		КОГДА вт_Запрос.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
		|			ТОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Итого20
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СтоимостьАвтоперевозкиЗаложеннаяПриРасчете,
		|	ВЫБОР
		|		КОГДА вт_Запрос.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К40)
		|				ИЛИ вт_Запрос.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
		|			ТОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СтавкаНДС
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.РазмерыКТК.ПустаяСсылка)
		|	КОНЕЦ КАК СтавкаНДС,
		|	вт_Запрос.ИдентификаторСтрокиУслуги КАК ИдентификаторСтрокиУслуги
		|ПОМЕСТИТЬ вт_Калькуляция
		|ИЗ
		|	вт_Запрос КАК вт_Запрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокацийПунктОтправления
		|				ПО (ИерархияЛокацийПунктОтправления.Локация = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПунктОтправления.ЛокацияВышестоящегоУровня)
		|					И (ИерархияЛокацийПунктОтправления.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.Регион))
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокацийПунктНазначения
		|				ПО (ИерархияЛокацийПунктНазначения.Локация = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПунктНазначения.ЛокацияВышестоящегоУровня)
		|					И (ИерархияЛокацийПунктНазначения.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.Регион))
		|			ПО ЗаявкаСоставУслуги.Калькуляция = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка
		|				И (КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга.УчитыватьСтавкуВЗапросеНаАвтоперевозку)
		|		ПО вт_Запрос.КлючАналитикиПеревозки = ЗаявкаСоставУслуги.КлючАналитикиПеревозки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Калькуляция.СтоимостьАвтоперевозкиЗаложеннаяПриРасчете КАК СтоимостьАвтоперевозкиЗаложеннаяПриРасчете,
		|	вт_Калькуляция.СтавкаНДС КАК СтавкаНДС,
		|	вт_Калькуляция.ИдентификаторСтрокиУслуги КАК ИдентификаторСтрокиУслуги
		|ИЗ
		|	вт_Калькуляция КАК вт_Калькуляция
		|ГДЕ
		|	вт_Калькуляция.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.ПерваяМиля)
		|	И ((НЕ вт_Калькуляция.НеТребуетсяТерминалВыдачи
		|				И вт_Калькуляция.ПунктОтправленияЛВУ = вт_Калькуляция.ТерминалВыдачиЛВУ)
		|			ИЛИ (НЕ вт_Калькуляция.НеТребуетсяАдрес
		|				И вт_Калькуляция.ПунктОтправленияЛВУ = вт_Калькуляция.АдресКлиентаЛВУ))
		|	И НЕ вт_Калькуляция.НеТребуетсяТерминалСдачи
		|	И вт_Калькуляция.ПунктНазначенияЛВУ = вт_Калькуляция.ТерминалСдачиЛВУ
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	вт_Калькуляция.СтоимостьАвтоперевозкиЗаложеннаяПриРасчете,
		|	вт_Калькуляция.СтавкаНДС,
		|	вт_Калькуляция.ИдентификаторСтрокиУслуги
		|ИЗ
		|	вт_Калькуляция КАК вт_Калькуляция
		|ГДЕ
		|	вт_Калькуляция.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.ПоследняяМиля)
		|	И НЕ вт_Калькуляция.НеТребуетсяТерминалВыдачи
		|	И вт_Калькуляция.ПунктОтправленияЛВУ = вт_Калькуляция.ТерминалВыдачиЛВУ
		|	И ((НЕ вт_Калькуляция.НеТребуетсяТерминалСдачи
		|				И вт_Калькуляция.ПунктНазначенияЛВУ = вт_Калькуляция.ТерминалСдачиЛВУ)
		|			ИЛИ (НЕ вт_Калькуляция.НеТребуетсяАдрес
		|				И вт_Калькуляция.ПунктНазначенияЛВУ = вт_Калькуляция.АдресКлиентаЛВУ))";
	
	Запрос.УстановитьПараметр("ЗапросНаАвтоперевозкуСсылка", ЗапросНаАвтоперевозкуСсылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции //Евросиб Коханенко Н.А. 22.02.2024 )) #80981  

//Евросиб Коханенко Н.А. 24.04.2024 (( #84617 
Процедура ОбновитьУчетныеНаправленияИзЗаявки() Экспорт
	
	НеобходимаЗаписьОбъекта = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗапросНаАвтоперевозкуКонтейнеры.ИдентификаторСтрокиУслуги КАК ИдентификаторСтрокиУслуги,
		//Евросиб Коханенко Н.А. 19.03.2025 (( #104519 
		|	ЗаявкаСоставУслуги.СухойТерминалОтправления КАК СухойТерминалОтправления,
		|	ЗаявкаСоставУслуги.ДатаГотовностиКТККВывозуИзПорта КАК ДатаГотовностиКТККВывозуИзПорта,
		|	ЗаявкаСоставУслуги.РелизТерминалаPODДействуетДо КАК РелизТерминалаPODДействуетДо,
		//Евросиб Коханенко Н.А. 19.03.2025 )) #104519 
		|	ЗаявкаСоставУслуги.УчетноеНаправление КАК УчетноеНаправление
		|ИЗ
		|	Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|		ПО (ЗаявкаСоставУслуги.Ссылка = ЗапросНаАвтоперевозкуКонтейнеры.Ссылка.Заявка)
		|			И (ЗаявкаСоставУслуги.ГУИДСтроки = ЗапросНаАвтоперевозкуКонтейнеры.ИдентификаторСтрокиУслуги)
		//Евросиб Коханенко Н.А. 19.03.2025 (( #104519
		//|			И (ЗаявкаСоставУслуги.УчетноеНаправление <> ЗапросНаАвтоперевозкуКонтейнеры.УчетноеНаправление)
		|			И ВЫБОР 
		|				КОГДА ЗапросНаАвтоперевозкуКонтейнеры.Ссылка.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.СредняяМиля)
		|				ТОГДА (ЗаявкаСоставУслуги.СухойТерминалОтправления <> ЗапросНаАвтоперевозкуКонтейнеры.ТерминалСдачи
		|						ИЛИ ЗаявкаСоставУслуги.ДатаГотовностиКТККВывозуИзПорта <> ЗапросНаАвтоперевозкуКонтейнеры.ДатаГотовностиКТККВывозуИзПорта		
		|						ИЛИ ЗаявкаСоставУслуги.РелизТерминалаPODДействуетДо <> ЗапросНаАвтоперевозкуКонтейнеры.РелизТерминалаPODДействуетДо)
		|				ИНАЧЕ (ЗаявкаСоставУслуги.УчетноеНаправление <> ЗапросНаАвтоперевозкуКонтейнеры.УчетноеНаправление)
		|			  КОНЕЦ
		//Евросиб Коханенко Н.А. 19.03.2025 )) #104519 
		|			И (ЗапросНаАвтоперевозкуКонтейнеры.Ссылка = &ЗапросНаАвтоперевозкуСсылка)";
	
	Запрос.УстановитьПараметр("ЗапросНаАвтоперевозкуСсылка", Ссылка);
	
	ТаблицаУчНаправленийИзЗаявки = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаУчНаправленийИзЗаявки.Количество() > 0 Тогда
	
		Для Каждого СтрокаКонтейнеры Из Контейнеры Цикл
			СтруктураПоиска = Новый Структура("ИдентификаторСтрокиУслуги", СтрокаКонтейнеры.ИдентификаторСтрокиУслуги);
			НайденныеСтроки = ТаблицаУчНаправленийИзЗаявки.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() > 0 Тогда 
				//Евросиб Коханенко Н.А. 19.03.2025 (( #104519
				//СтрокаКонтейнеры.УчетноеНаправление = НайденныеСтроки[0].УчетноеНаправление;
			//КонецЕсли;
				Если ЭтапПеревозки = Перечисления.ЭтапыПеревозки.СредняяМиля Тогда
					Если СтрокаКонтейнеры.ТерминалСдачи <> НайденныеСтроки[0].СухойТерминалОтправления Тогда
						СтрокаКонтейнеры.ТерминалСдачи = НайденныеСтроки[0].СухойТерминалОтправления;
					КонецЕсли;
					Если СтрокаКонтейнеры.ДатаГотовностиКТККВывозуИзПорта <> НайденныеСтроки[0].ДатаГотовностиКТККВывозуИзПорта Тогда
						СтрокаКонтейнеры.ДатаГотовностиКТККВывозуИзПорта = НайденныеСтроки[0].ДатаГотовностиКТККВывозуИзПорта;
					КонецЕсли;
					Если СтрокаКонтейнеры.РелизТерминалаPODДействуетДо <> НайденныеСтроки[0].РелизТерминалаPODДействуетДо Тогда
						СтрокаКонтейнеры.РелизТерминалаPODДействуетДо = НайденныеСтроки[0].РелизТерминалаPODДействуетДо;
					КонецЕсли;
				Иначе
					СтрокаКонтейнеры.УчетноеНаправление = НайденныеСтроки[0].УчетноеНаправление;
				КонецЕсли;
				//Евросиб Коханенко Н.А. 19.03.2025 )) #104519 
				СтрокаКонтейнеры.ОбновленыИсходныеДанные = Истина;
				НеобходимаЗаписьОбъекта = Истина;				
			КонецЕсли;
		КонецЦикла;
		
		Если НеобходимаЗаписьОбъекта Тогда
			Попытка
				Записать();
				//Евросиб Коханенко Н.А. 19.03.2025 (( #104519 
				Если ЭтапПеревозки = Перечисления.ЭтапыПеревозки.СредняяМиля Тогда
					ПланыОбмена.ВыгрузкаДанных.ЗарегистрироватьИзмененияПоДокументу(Ссылка, Перечисления.УзлыОбмена.ТЛ);
				КонецЕсли;                               
				//Евросиб Коханенко Н.А. 19.03.2025 )) #104519 
			Исключение
				ЗаписьЖурналаРегистрации("ОшибкаЗаписиЗапросаНаАвтоперевозку", УровеньЖурналаРегистрации.Ошибка, 
											Метаданные(), Ссылка, ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры //Евросиб Коханенко Н.А. 24.04.2024 )) #84617

#КонецОбласти

#Область Инициализация

#КонецОбласти