
&НаКлиенте
Процедура ЗарегистрироватьСчетФактуруНаВознаграждение(Команда)
	СоздатьСчетФактуруНаВОзнаграждение(НомерСчетаФактурыПолученного,ДатаСчетаФактурыПолученного);
	Элементы.ГруппаСозданиеСФНаВознаграждение.Доступность = ложь;
КонецПроцедуры

&НаСервере
Процедура СоздатьСчетФактуруНаВОзнаграждение(НомерСчетаФактурыПолученного,ДатаСчетаФактурыПолученного)
	СчФ = Документы.СчетФактураПолученный.СоздатьДокумент();
	БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьРеквизитыСчФПоОснованию(Объект.Ссылка,СчФ);
	СчФ.НомерВходящегоДокумента = НомерСчетаФактурыПолученного;
	СчФ.ДатаВходящегоДокумента = ДатаСчетаФактурыПолученного;
	СчФ.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТоварыИзРеализации(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТоварыПоРеализации(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВозвраты(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура СпособРасчетаКомиссионногоВознагражденияПриИзменении(Элемент)
	
	ВознаграждениеРасчитывается = (Объект.СпособРасчетаКомиссионногоВознаграждения <> ПредопределенноеЗначение("Перечисление.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается"));
	
	Элементы.ГруппаШапкаВознаграждениеПравая.Видимость = ВознаграждениеРасчитывается;
	Элементы.ГруппаСчетФактураНаВознаграждение.Видимость = ВознаграждениеРасчитывается;
	Элементы.ГруппаСуммыВознаграждения.Видимость = ВознаграждениеРасчитывается;
	Элементы.ГруппаШапкаВознаграждениеПравая.Доступность = ВознаграждениеРасчитывается;
	Элементы.ГруппаСчетФактураНаВознаграждение.Доступность = ВознаграждениеРасчитывается;
	Элементы.ГруппаСуммыВознаграждения.Доступность = ВознаграждениеРасчитывается;
	Элементы.ТоварыСуммаВознаграждения.Видимость = ВознаграждениеРасчитывается;
	Элементы.ТоварыСуммаНДСВознаграждения.Видимость = ВознаграждениеРасчитывается;
	Элементы.УслугиСуммаВознаграждения.Видимость = ВознаграждениеРасчитывается; 
	Элементы.УслугиСуммаНДСВознаграждения.Видимость = ВознаграждениеРасчитывается;
	Элементы.ТоварыСуммаВознаграждения.Доступность = ВознаграждениеРасчитывается;
	Элементы.ТоварыСуммаНДСВознаграждения.Доступность = ВознаграждениеРасчитывается;
	Элементы.УслугиСуммаВознаграждения.Доступность = ВознаграждениеРасчитывается; 
	Элементы.УслугиСуммаНДСВознаграждения.Доступность = ВознаграждениеРасчитывается;
	
	Если НЕ ВознаграждениеРасчитывается Тогда
		Если Объект.ПроцентКомиссионногоВознаграждения > 0 Тогда
			Если Объект.УчитыватьНДС Тогда
				Если ЗначениеЗаполнено(Объект.СтавкаНДСВознаграждения) Тогда
					РасчитатьВознаграждение();
				КонецЕсли;
			Иначе
				РасчитатьВознаграждение();
			КонецЕсли;
		КонецЕСли;	
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция РассчитыватьВознаграждение(СпособРасчета)
	Если СпособРасчета = Перечисления.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается Тогда
		Возврат Ложь;
	Иначе Возврат Истина;
	КонецЕсли;
КонецФункции

&НаСервере
Функция РассчитыватьПроцентом(СпособРасчета)
	Если СпособРасчета = Перечисления.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается Тогда
		Возврат Ложь;
	Иначе Возврат Истина;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура РасчитатьВознаграждение();
	Для каждого СТр из Объект.Товары Цикл
		Стр.СуммаВознаграждения = Стр.Сумма*Объект.ПроцентКомиссионногоВознаграждения/100;
		Стр.СуммаНДСВознаграждения = БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСуммуНДС(СТр.СуммаВознаграждения,БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Объект.СтавкаНДСВознаграждения),Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);
	КонецЦикла;
	Для каждого СТр из Объект.Услуги Цикл
		Стр.СуммаВознаграждения = Стр.Сумма*Объект.ПроцентКомиссионногоВознаграждения/100;
		Стр.СуммаНДСВознаграждения = БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСуммуНДС(СТр.СуммаВознаграждения,БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Объект.СтавкаНДСВознаграждения),Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);
	КонецЦикла;

	ИтогВсегоВознаграждение = Объект.Товары.Итог("СуммаВознаграждения") + ?(Объект.СуммаВключаетНДС,0, Объект.Товары.Итог("СуммаНДСВознаграждения"))
	+ Объект.Услуги.Итог("СуммаВознаграждения") + ?(Объект.СуммаВключаетНДС,0, Объект.Услуги.Итог("СуммаНДСВознаграждения"));
	ИтогВсегоНДСВознаграждения = Объект.Товары.Итог("СуммаНДСВознаграждения")+Объект.Услуги.Итог("СуммаНДСВознаграждения");
	Объект.СуммаВознаграждения = Объект.Товары.Итог("СуммаВознаграждения");
КонецПроцедуры

&НаКлиенте
Процедура ПроцентКомиссионногоВознагражденияПриИзменении(Элемент)
	
	Если Объект.УчитыватьНДС Тогда
		Если (ЗначениеЗаполнено(Объект.СтавкаНДСВознаграждения)) и Объект.ПроцентКомиссионногоВознаграждения > 0 Тогда
			РасчитатьВознаграждение();
		КонецЕсли;
	Иначе
		РасчитатьВознаграждение();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСВознагражденияПриИзменении(Элемент)
	Если Объект.ПроцентКомиссионногоВознаграждения > 0 Тогда
		РасчитатьВознаграждение();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	СтрТЧ = Элементы.Услуги.ТекущиеДанные;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТЧ);
	БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(СтрТЧ,Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);
	РассчитатьСуммыВсегоПоДокументу();
	РасчитатьВознаграждение();
	РассчитатьСуммуПоСФ(СтрТЧ.Сумма,СтрТЧ.СуммаНДС,СтрТЧ.КлючСтроки);
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммуПоСФ(Сумма,СуммаНДС,Ключ)
	ПараметрыОтбора = Новый Структура("КлючСтроки", Ключ);
	МассивСтрок = Объект.Покупатели.НайтиСтроки(ПараметрыОтбора);
	Если МассивСтрок.Количество() > 0 Тогда
		МассивСтрок[0].ВсегоПоСФ = Объект.Услуги.Итог("Сумма")+Объект.Товары.Итог("Сумма");//МассивСтрок[0].ВсегоПоСФ + Сумма;
		МассивСтрок[0].НДСПоСФ = Объект.Услуги.Итог("СуммаНДС")+Объект.Товары.Итог("СуммаНДС");//МассивСтрок[0].НДСПоСФ + СуммаНДС;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммыВсегоПоДокументу()
	ИтогНДСОтгрузки = ?(Объект.Товары.Количество()>0, Объект.Товары.Итог("СуммаНДС"),0)+?(Объект.Услуги.Количество()>0,Объект.Услуги.Итог("СуммаНДС"),0);
	ИтогСуммаОтгрузки = ?(Объект.Товары.Количество()>0, Объект.Товары.Итог("Сумма"),0)+ ?(Объект.Услуги.Количество()>0,Объект.Услуги.Итог("Сумма"),0)+?(Объект.СуммаВключаетНДС,0,ИтогНДСОтгрузки);
	Объект.СуммаДокумента = ИтогСуммаОтгрузки;
	Элементы.ВалютаДокументаРеализация.Заголовок = Объект.ВалютаДокумента;
	РасчитатьВознаграждение();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	СтрТЧ = Элементы.Товары.ТекущиеДанные;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТЧ);
	БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(СтрТЧ,Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);
	РассчитатьСуммыВсегоПоДокументу();
РасчитатьВознаграждение();
РассчитатьСуммуПоСФ(СтрТЧ.Сумма,СтрТЧ.СуммаНДС,СтрТЧ.КлючСтроки);


КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	СтрТабЧасти = Элементы.Товары.ТекущиеДанные;
	
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТабЧасти);
	БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(СтрТабЧасти,Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);
	РассчитатьСуммыВсегоПоДокументу();
РасчитатьВознаграждение();
РассчитатьСуммуПоСФ(СтрТабЧасти.Сумма,СтрТабЧасти.СуммаНДС,СтрТабЧасти.КлючСтроки);

КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	СтрТабЧасти = Элементы.Услуги.ТекущиеДанные;
	
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТабЧасти);
	БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(СтрТабЧасти,Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);
	РассчитатьСуммыВсегоПоДокументу();
РасчитатьВознаграждение();
РассчитатьСуммуПоСФ(СтрТабЧасти.Сумма,СтрТабЧасти.СуммаНДС,СтрТабЧасти.КлючСтроки);

КонецПроцедуры

// +++ БЛОК НОВОЙ МАРШРУТИЗАЦИИ

&НаКлиенте
Функция ПроверитьУказатьОтветственных(РезультатЗапроса, СобытиеПередЗаписью)
	
	ДопСвойстваОбъекта.Очистить();
	ЧтоНужноУказатьВручную = Новый Массив;
	Для каждого Стр из  РезультатЗапроса Цикл
		Исполнитель = Стр.Исполнитель;
		Если НЕ Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Исполнитель) Тогда Исполнитель = Объект.Автор; КонецЕсли;
		Наблюдатель = Стр.Наблюдатель;
		Если НЕ Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Наблюдатель) Тогда Наблюдатель = Объект.Автор; КонецЕсли;
		
		Если Стр.ТребуетсяУказатьИсполнителя ИЛИ Стр.ТребуетсяУказатьНаблюдателя Тогда 
			ЧтоНужноУказатьВручную.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель", Стр.Состояние, Исполнитель, Наблюдатель)); 
		КонецЕсли;
	КонецЦикла;
	Если ЧтоНужноУказатьВручную.Количество() > 0 Тогда
		ОпОп = Новый ОписаниеОповещения("ОбработкаУказанияОтветственных", ЭтаФорма, Новый Структура("РезультатЗапроса, СобытиеПередЗаписью", РезультатЗапроса, СобытиеПередЗаписью));
		ПараметрыОтбора = Новый СТруктура;
		ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация", ЧтоНужноУказатьВручную);
		ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Если НЕ СобытиеПередЗаписью Тогда ПовторнаяМаршрутизация_сервер(РезультатЗапроса); КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаУказанияОтветственных(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	ДопСвойстваОбъекта.ЗагрузитьЗначения(П1);
	Если П2.СобытиеПередЗаписью Тогда
		Записать();
	Иначе
		ПовторнаяМаршрутизация_сервер(П2.РезультатЗапроса);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПовторнаяМаршрутизация_сервер(РезультатЗапроса)
	
	ЭтотОбъектЪ = РеквизитФормыВЗначение("Объект");
	МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъектЪ, РезультатЗапроса, Объект.Автор, ДопСвойстваОбъекта);
	ЗначениеВРеквизитФормы(ЭтотОбъектЪ, "Объект");
	
КонецПроцедуры

// --- БЛОК НОВОЙ МАРШРУТИЗАЦИИ

&НаКлиенте
Процедура УслугиСтавкаНДСПриИзменении(Элемент)
	СтрТЧ = Элементы.Услуги.ТекущиеДанные;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТЧ);
	СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСуммуНДС(СтрТЧ.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СТрТЧ.СтавкаНДС), Объект.УчитыватьНДС, Объект.СуммаВключаетНДС);
	СтрТч.СуммаНДС = СуммаНДС;

РасчитатьВознаграждение();
	РассчитатьСуммыВсегоПоДокументу();
	РассчитатьСуммуПоСФ(СтрТЧ.Сумма,СтрТЧ.СуммаНДС,СтрТЧ.КлючСтроки);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	СтрТЧ = Элементы.Товары.ТекущиеДанные;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТЧ);
	СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСуммуНДС(СтрТЧ.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СТрТЧ.СтавкаНДС), Объект.УчитыватьНДС, Объект.СуммаВключаетНДС);
	СтрТч.СуммаНДС = СуммаНДС;
	РассчитатьСуммыВсегоПоДокументу();
	РасчитатьВознаграждение();
	РассчитатьСуммуПоСФ(СтрТЧ.Сумма,СтрТЧ.СуммаНДС,СтрТЧ.КлючСтроки);

КонецПроцедуры

&НаКлиенте
Процедура УчитыватьНДСНажатие(Элемент)
	ОбъектА = ЭтотОбъект.Объект;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("УчитыватьНДС", ОбъектА.УчитыватьНДС);
	ПараметрыФормы.Вставить("СуммаВключаетНДС", ОбъектА.СуммаВключаетНДС);
	ОткрытьФорму("ОбщаяФорма.УчетНДСВДокументах",ПараметрыФормы,ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура КурсВалютыНажатие(Элемент)
	ОбъектА = ЭтотОбъект.Объект;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВалютаДокумента", ОбъектА.ВалютаДокумента);
	ПараметрыФормы.Вставить("КурсВзаиморасчетов", ОбъектА.КурсВзаиморасчетов);
	ПараметрыФормы.Вставить("КратностьВзаиморасчетов", ОбъектА.КратностьВзаиморасчетов);
	ПараметрыФормы.Вставить("ДатаДокумента", ОбъектА.Дата);
	ОткрытьФорму("ОбщаяФорма.КурсВалютыВДокументах",ПараметрыФормы,ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.УчетНДСВДокументах" Тогда
		ОбработкаВыбораУчетНДС(ЭтаФорма,ВыбранноеЗначение,ИсточникВыбора);
	ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.КурсВалютыВДокументах" Тогда
		ОбработкаВыбораКурсыВалют(ЭтаФорма,ВыбранноеЗначение,ИсточникВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораУчетНДС(Форма, ВыбранноеЗначение, ИсточникВыбора)
	ЗаполнитьЗначенияСвойств(Объект, ВыбранноеЗначение);
	Для каждого Стр из Объект.Товары Цикл
		БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(Стр,Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);
		//БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(Стр,Объект.СуммаВключаетНДС);
		
	КонецЦикла;
	
	Для каждого Стр из Объект.Услуги Цикл
		БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(Стр,Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);
	//	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(Стр,Объект.СуммаВключаетНДС);

	КонецЦикла;
	РассчитатьСуммыВсегоПоДокументу();
	УстановитьВидимостьКолонокНДС();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораКурсыВалют(Форма, ВыбранноеЗначение, ИсточникВыбора)
	Объект.ВалютаДокумента = ВыбранноеЗначение.ВалютаДокумента;
	Объект.КратностьВзаиморасчетов = ВыбранноеЗначение.КратностьВзаиморасчетов;
	Объект.КурсВзаиморасчетов = ВыбранноеЗначение.КурсВзаиморасчетов;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКолонокНДС()
	Если Не Объект.УчитыватьНДС Тогда
		Элементы.СтавкаНДСВознаграждения.Видимость = Ложь;
		Элементы.ТоварыСуммаНДСВознаграждения.Видимость = Ложь;
		Элементы.УслугиСтавкаНДС.Видимость = Ложь;
		Элементы.УслугиСуммаНДСВознаграждения.Видимость = Ложь;
		Элементы.ИтогВсегоНДСВознаграждения.Видимость = Ложь;
	Иначе
		Элементы.СтавкаНДСВознаграждения.Видимость = Истина;
		Элементы.ТоварыСуммаНДСВознаграждения.Видимость = Истина;
		Элементы.УслугиСтавкаНДС.Видимость = Истина;
		Элементы.УслугиСуммаНДСВознаграждения.Видимость = Истина;
		Элементы.ИтогВсегоНДСВознаграждения.Видимость = Истина;

	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция НайтиСтаршийКлючСтроки()
	Ключ = 0;
	Для Каждого СТр из Объект.Покупатели Цикл
		Если Стр.КлючСтроки > Ключ Тогда
			Ключ = Стр.КлючСтроки;
		КонецЕсли;
	КонецЦИкла;
	Ключ = Ключ+1;
	Возврат Ключ;
КонецФункции

&НаКлиенте
Процедура ПокупателиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТД = Элементы.Покупатели.ТекущиеДанные;
	Если ТД.КлючСтроки = 0 Тогда	
		Ключ = НайтиСтаршийКлючСтроки();
		ТД.КлючСтроки = Ключ;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТДТовары = Элементы.Товары.ТекущиеДанные;
	Если ТДТовары.КлючСтроки = 0 Тогда
		ТД = Элементы.Покупатели.ТекущиеДанные;
		ТДТовары.КлючСтроки = ТД.КлючСтроки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТДУслуги = Элементы.Услуги.ТекущиеДанные;
	Если ТДУслуги.КлючСтроки = 0 Тогда
		ТД = Элементы.Покупатели.ТекущиеДанные;
		ТДУслуги.КлючСтроки = ТД.КлючСтроки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПокупателиПриАктивизацииСтроки(Элемент)
	
	ТД = Элементы.Покупатели.ТекущиеДанные;
	Если ТД = Неопределено ИЛИ ТД.КлючСтроки = 0 Тогда Возврат; КонецЕсли;

	ТЧТовары = Элементы.Товары;
	ТЧУслуги = Элементы.Услуги;
	ТЧТовары.ОтборСтрок = Новый ФиксированнаяСтруктура("КлючСтроки",ТД.КлючСтроки);
	ТЧУслуги.ОтборСтрок = Новый ФиксированнаяСтруктура("КлючСтроки",ТД.КлючСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Евросиб Каблов 02.12.2020 ( Ticket#0215459
	КонтрольДоступностиДокументов_сервер.ОбработатьБлокировкуЭлементовФормы(Объект.Ссылка, Элементы);
	//Евросиб Каблов 02.12.2020 )
	
	Элементы.ПредупреждениеРедактирования.Видимость = КонтрольДоступностиДокументов_сервер.ДокументЗаблокирован(Объект.Ссылка);
	Элементы.ПредупреждениеРедактирования.Заголовок = КонтрольДоступностиДокументов_сервер.ПолучитьОписаниеБлокировки();
	
	// Обновляем панель текущего пользователя и панель состояний
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	// - Состояния
	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		СтрПараметров = КонтрагентыДоговоры_сервер.ПолучитьВалютуДоговора(Объект.ДоговорКонтрагента, Объект.Дата);
		Объект.ВалютаДокумента = СтрПараметров.Валюта;
		Объект.КурсВзаиморасчетов = СтрПараметров.Курс;
		Объект.КратностьВзаиморасчетов = СтрПараметров.Кратность;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	ДанныеПоУмолчанию = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСчетДоговорПоУмолчанию(Объект.Контрагент);
	Если ЗначениеЗаполнено(ДанныеПоУмолчанию.Договор) Тогда 
		Объект.ДоговорКонтрагента = ДанныеПоУмолчанию.Договор;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

// + ОБЛАСТЬ СОСТОЯНИЯ

// Процедура обновляет панель текущего пользователя
&НаСервере
Процедура ОбновитьПанельТекущегоПользователя()
	
	МаршрутизацияСервер.ОбновитьПанельТекущегоПользователя(Объект, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
КонецПроцедуры

// Функция обновляет панель состояний документа для графического отражения его движения по состояниям
&НаСервере
Процедура ОбновитьПанельСостояний()
	
	МаршрутизацияСервер.ОбновитьПанельСостояний(ЭтотОбъект);
	
КонецПроцедуры

// Этот обработчик вызывается при нажатии на состояния на панели состояний
// Ссылка на него устанавливается кодом, поэтому при проверке конфигурации 1с может сказать, что эта функция не испольузется
// Не верьте 1с!
&НаКлиенте
Процедура ОбработчикНажатияПлитокСостояния(П1 = неопределено, П2 = неопределено) Экспорт
	МаршрутизацияКлиент.ОбработчикНажатияНаПлиткуОбщий(П1, П2);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ДопСвойстваОбъекта.Очистить();
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийИсполнитель_СтатусПриИзменении(Элемент)
	
	// обновляем информацию по состоянию 
	МаршрутизацияКлиент.ТекущийИсполнитель_СтатусПриИзменении(Объект, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
	ОбновитьПанельСостояний();
	
КонецПроцедуры

&НаКлиенте
Процедура ПовторнаяМаршрутизация(Команда)
	
	Если Объект.Маршрутизировать Тогда
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыЗапроса.Вставить("Договор", Объект.ДоговорКонтрагента);
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьОтчетКомиссионера(ПараметрыЗапроса, Объект.Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			Отказ = ПроверитьУказатьОтветственных(РезультатЗапроса, Ложь);
		Иначе
			Сообщить("Для документа не найден подходящий маршрут. Изменения не внесены!");
		КонецЕсли;
		
		ОбновитьПанельСостояний();
	КонецЕсли;

	
	//Если Объект.Маршрутизировать Тогда
	//	ПараметрыЗапроса = Новый Соответствие;
	//	ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
	//	ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
	//	ПараметрыЗапроса.Вставить("Договор", Объект.ДоговорКонтрагента);
	//	РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьОтчетКомиссионера(ПараметрыЗапроса, Объект.Дата);
	//	Если РезультатЗапроса.Количество() > 0 Тогда
	//		ПримененныйМаршрут = РезультатЗапроса[0].Ссылка;
	//		
	//		ТребуетсяДонастройка = Ложь;
	//		Для каждого Стр из РезультатЗапроса Цикл
	//			Если (Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Стр.Исполнитель)) ИЛИ
	//				(Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Стр.Наблюдатель)) Тогда
	//				ТребуетсяДонастройка = Истина;
	//				Прервать;
	//			КонецЕсли;
	//		КонецЦикла;
	//		Если ТребуетсяДонастройка Тогда
	//			
	//			Отказ = Истина;
	//			
	//			// очищаем таблицу состояний
	//			Объект.Состояния.Очистить();
	//			// открываем форму для заполнения таблицы состояний
	//			ПараметрыОтбора = Новый СТруктура;
	//			ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация",ПримененныйМаршрут);
	//			ОпОп = Новый ОписаниеОповещения("УстановкаОтветственных", ЭтаФорма);
	//			ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//		КонецЕсли;
	//	Иначе
	//		Сообщить("Для документа не найден подходящий маршрут. Изменения не внесены!");
	//	КонецЕсли;
	//	
	//	ОбновитьПанельСостояний();
	//КонецЕсли;
	
КонецПроцедуры

// - ОБЛАСТЬ СОСТОЯНИЯ

&НаКлиенте
Процедура Делегировать(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ВыборДелегирования", ЭтаФорма);
	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаВыбора",,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборДелегирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	Для Сч = 0 По Объект.Состояния.Количество()-1 Цикл
		Если Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение") ИЛИ Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.ВРаботе") Тогда
			Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Новый");
			НСтр = Объект.Состояния.Вставить(Сч);
			НСтр.Состояние = ПредопределенноеЗначение("Справочник.Состояния.ДелегированноеСогласование");
			НСтр.Исполнитель = Параметр1;
			НСтр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение");
			ОбновитьПанельСостояний();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Рецензирование(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаРецензирования", ЭтаФорма);
	ПараметрыФормы = Новый Структура("РецензОбъект", Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.РецензированиеПриСогласовании", ПараметрыФормы,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРецензирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СостоянияСтатусСогласованияПриИзменении(Элемент)
	
	ТекД = Элементы.Состояния.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ТекД.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛистСогласования(Команда)
	
	ТабДок = МаршрутизацияСервер.ПолучитьТабдокЛистаСогласования(Объект.Ссылка);
	ТабДок.Показать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОткрытыйПериод(Команда)
	
	//Евросиб Каблов 09.04.2025 ( #105407
	//Объект.ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Объект.Организация);
	Объект.ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(Объект.Организация);
	//Евросиб Каблов 09.04.2025 )
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.ТолькоПросмотр = ПроверкаДоступнотиПоПериоду();
	Элементы.ОбновитьОткрытыйПериод.Доступность = НЕ ПроверкаДоступнотиПоПериоду();
КонецПроцедуры

&НаСервере
Функция ПроверкаДоступнотиПоПериоду()
	Возврат КонтрольДоступностиДокументов_сервер.ДатаПопадаетВЗакрытыйПериодВыполненныхОбъемов(Объект.ПериодВО,Объект.Организация);
КонецФункции


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	//Для Каждого Стр Из Объект.Состояния Цикл
	//	// если исполнитель пустой, то проставляем тек пользователя
	//	Если НЕ ЗначениеЗаполнено(Стр.Исполнитель) И Стр.ТребуетсяУказатьИсполнителя Тогда 
	//		Сообщить("Требуется указать исполнителя");
	//		Отказ = Истина;
	//	КонецЕсли;
	//	Если НЕ ЗначениеЗаполнено(Стр.Наблюдатель) И Стр.ТребуетсяУказатьНаблюдателя Тогда 
	//		Сообщить("Требуется указать наблюдателя");
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = ПроверитьНеобходимостьМаршрутизации();
	Если Объект.Маршрутизировать И ДопСвойстваОбъекта.Количество() = 0 И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Поставщик);
		ПараметрыЗапроса.Вставить("Договор", Объект.ДоговорКонтрагента);
		
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьОтчетКомиссионера(ПараметрыЗапроса, Объект.Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			Отказ = ПроверитьУказатьОтветственных(РезультатЗапроса, Истина);
		КонецЕсли;
		
	КонецЕсли;

	
	//Если НЕ ПараметрыЗаписи.Свойство("СостоянияИзменены") Тогда
	//	
	//	ДляДанногоОбъектаТребуетсяПеремаршрутизация = ПроверитьНеобходимостьМаршрутизации();
	//	
	//	Если Объект.Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
	//		
	//		ПараметрыЗапроса = Новый Соответствие;
	//		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
	//		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
	//		ПараметрыЗапроса.Вставить("Договор", Объект.ДоговорКонтрагента);
	//		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьОтчетКомиссионера(ПараметрыЗапроса, Объект.Дата);
	//		Если РезультатЗапроса.Количество() > 0 Тогда
	//			ПримененныйМаршрут = РезультатЗапроса[0].Ссылка;
	//			
	//			ТребуетсяДонастройка = Ложь;
	//			Для каждого Стр из РезультатЗапроса Цикл
	//				Если (Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Стр.Исполнитель)) ИЛИ
	//					(Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Стр.Наблюдатель)) Тогда
	//					ТребуетсяДонастройка = Истина;
	//					Прервать;
	//				КонецЕсли;
	//			КонецЦикла;
	//			Если ТребуетсяДонастройка Тогда
	//				
	//				Отказ = Истина;
	//				
	//				// очищаем таблицу состояний
	//				Объект.Состояния.Очистить();
	//				// открываем форму для заполнения таблицы состояний
	//				ПараметрыОтбора = Новый СТруктура;
	//				ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация",ПримененныйМаршрут);
	//				ОпОп = Новый ОписаниеОповещения("УстановкаОтветственных", ЭтаФорма);
	//				ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаОтветственных(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда 
		Возврат; 
	КонецЕсли;
	
	Для Каждого Стр Из Параметр1 Цикл
		НовСтр = Объект.Состояния.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Стр);		
	КонецЦикла;
	Параметры.СохранитьДанныеСостояний = Истина;
	
	СтруктураЗаписиДанных = Новый СТруктура;
	СтруктураЗаписиДанных.Вставить("СостоянияИзменены",Истина);
	
	Записать(СтруктураЗаписиДанных);

КонецПроцедуры

&НаСервере
Функция ПроверитьНеобходимостьМаршрутизации()

	ДляДанногоОбъектаТребуетсяПеремаршрутизация = 
	НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ 
	Объект.Ссылка.Организация <> Объект.Организация ИЛИ 
	Объект.Ссылка.Контрагент <> Объект.Контрагент ИЛИ
	Объект.Ссылка.ДоговорКонтрагента <> Объект.ДоговорКонтрагента ИЛИ Объект.Состояния.Количество() = 0;
	
	Возврат ДляДанногоОбъектаТребуетсяПеремаршрутизация;
	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ДопСвойстваОбъекта", ДопСвойстваОбъекта);
	//Если Параметры.СохранитьДанныеСостояний Тогда
	//	ТЗ = Объект.Состояния.Выгрузить();
	//	ТекущийОбъект.ДополнительныеСвойства.Вставить("Состояния", ТЗ);
	//	Параметры.СохранитьДанныеСостояний = Ложь;
	//КонецЕсли;
	
	//Евросиб Каблов 02.12.2020 ( Ticket#0215459
	ИзмененияЗапрещены = Отказ;
	ТекРежимЗаписи = Неопределено;
	ТекРежимПроведения = Неопределено;
	ПараметрыЗаписи.Свойство("РежимЗаписи", ТекРежимЗаписи);
	ПараметрыЗаписи.Свойство("РежимПроведения", ТекРежимПроведения);
	КонтрольДоступностиДокументов_сервер.ПроверитьДоступностьПолейДляИзменения(ТекущийОбъект, ИзмененияЗапрещены, ТекРежимЗаписи, ТекРежимПроведения);
	//Евросиб Каблов 02.12.2020 )
	
КонецПроцедуры
