///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов

// Возвращает реквизиты объекта, которые не рекомендуется редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив - список имен реквизитов объекта.
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	НеРедактируемыеРеквизиты = Новый Массив;
	НеРедактируемыеРеквизиты.Добавить("Служебный");
	НеРедактируемыеРеквизиты.Добавить("ИдентификаторПользователяИБ");
	НеРедактируемыеРеквизиты.Добавить("ИдентификаторПользователяСервиса");
	НеРедактируемыеРеквизиты.Добавить("СвойстваПользователяИБ");
	
	Возврат НеРедактируемыеРеквизиты;
	
КонецФункции

// Конец СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтение
	|ГДЕ
	|	ИСТИНА
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	|	ЭтоАвторизованныйПользователь(Ссылка)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если НЕ Параметры.Отбор.Свойство("Недействителен") Тогда
		Параметры.Отбор.Вставить("Недействителен", Ложь);
	КонецЕсли;
	
	Если НЕ Параметры.Отбор.Свойство("Служебный") Тогда
		Параметры.Отбор.Вставить("Служебный", Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли 

 //Субботин 75158 17.10.2023 Начало 
Функция ПолучитьПользователяПоЛогинуAD(ЛогинAD) Экспорт
	
	Результат = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Пользователи.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |ГДЕ
	               |	Пользователи.ЛогинAD = &ЛогинAD
	               |	И НЕ Пользователи.ПометкаУдаления";
	Запрос.УстановитьПараметр("ЛогинAD", ЛогинAD);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда		
		Результат = Ответ.Ссылка;		
	КонецЕсли;
 	
	Возврат Результат; 
	
КонецФункции
//Субботин 75158 17.10.2023 Конец 

//Евросиб СубботинВ #89533 10.09.2024 Начало 
&НаСервере
Функция ПолучитьГруппуДКППользователя(Пользователь) Экспорт
	
	ДКП = Справочники.ГруппыПользователей.ПустаяСсылка();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыПользователейСостав.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
		|ГДЕ
		|	ГруппыПользователейСостав.Пользователь = &Пользователь
		|	И НЕ ГруппыПользователейСостав.Пользователь.Недействителен
		|	И НЕ ГруппыПользователейСостав.Пользователь.ПометкаУдаления
		|	И ГруппыПользователейСостав.Ссылка В ИЕРАРХИИ(&ДКП)
		//Евросиб СубботинВ #89527 30.10.2024 Начало // исключая корневую группу, работа идет только в подгруппах
		|	И НЕ ГруппыПользователейСостав.Ссылка = &ДКП
		//Евросиб СубботинВ #89527 30.10.2024 Конец
		|	И НЕ ГруппыПользователейСостав.Ссылка.ПометкаУдаления";
	
			
	Запрос.УстановитьПараметр("ДКП", Справочники.ГруппыПользователей.ДирекцияКонтейнерныхПеревозок);		
	Запрос.УстановитьПараметр("Пользователь",Пользователь);
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ДКП = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат ДКП

КонецФункции 
//Евросиб СубботинВ #89533 10.09.2024 Конец 
