#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Евросиб Фролов (27.04.2022 Task №50676
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)	
	СтандартнаяОбработка = Ложь;
	Поля = Новый Массив;
	Поля.Добавить("Наименование");
	Поля.Добавить("Код");
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)	
	СтандартнаяОбработка = Ложь;
	Представление = СтрШаблон("%1 (Код %2)", Данные.Наименование, Данные.Код);
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	РаботаСМенеджерамиОбъектов.ОбработкаПолученияДанныхВыбораПолучитьДанныеВыбораБезПомеченныхНаУдаление("РейсыЖД", ДанныеВыбора, Параметры, СтандартнаяОбработка);
КонецПроцедуры
// Евросиб Фролов)

#КонецОбласти

#КонецЕсли