
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
 	Автор = пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Дата = ТекущаяДата();
	Статус = Перечисления.СтатусыПроектов.Черновик;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	// Евросиб Фролов (27.04.2022 Task №50676
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 	
	// Евросиб Фролов)
	
	Изменено = ТекущаяДата();
	Редактор = пользователи.ТекущийПользователь();
	
	Создано = ?(ЗначениеЗаполнено(Создано),Создано,ТекущаяДата());
	Дата = ?(ЗначениеЗаполнено(Дата),Дата,ТекущаяДата());
	
	Если НЕ (ТехРейс и ЗначениеЗаполнено(Наименование)) Тогда
		// Евросиб Фролов (27.04.2022 Task №50676. Формат даты отправления до изменения быд "ДФ=дд.ММ", стал "ДФ=dd.MM.yyyy")     
		// Евросиб(ДИТ) US 85377 ТА 88112 Сержантова А.С. Начало: 17.07.2024
		// Было:
		//Наименование = ?(КП, "КП ", "Повагонка ") + Формат(ДатаОтправления, "ДФ=dd.MM.yyyy") + " " + ПунктОтправления + " - " + ПунктНазначения; 
		//Стало:  
		Если ЗначениеЗаполнено(ДатаОтправленияФакт) Тогда
			ДатаВНаименование = ДатаОтправленияФакт;
		Иначе	
		    ДатаВНаименование = ДатаОтправления; 
		КонецЕсли;
		Наименование = ?(КП, "КП ", "Повагонка ") + Формат(ДатаВНаименование, "ДФ=dd.MM.yyyy") + " " + ПунктОтправления + " - " + ПунктНазначения;
		// Евросиб(ДИТ) US 85377 ТА 88112 Сержантова А.С. Конец: 17.07.2024
	КонецЕсли;
	
	//Евросиб Каблов 04.10.2021 (
	НаименованиеПунктаОтправления = ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ПунктОтправления, "Наименование");
	НаименованиеПунктаНазначения = ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ПунктНазначения, "Наименование");
	НаименованиеМаршрутаКП = СтрШаблон("%1 - %2", НаименованиеПунктаОтправления, НаименованиеПунктаНазначения);  
	//Евросиб Каблов 04.10.2021 ) 
	
	Если ПланФактПродаж.Количество() = 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТипоразмерыТЕ.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ТипоразмерыТЕ КАК ТипоразмерыТЕ
		               |ГДЕ
		               |	НЕ ТипоразмерыТЕ.ПометкаУдаления
		               |	И ТипоразмерыТЕ.ИспользоватьПоУмолчаниюДляКТКУказанногоРазмера
		               |	И ТипоразмерыТЕ.ТЕУ = 2";
		Ответ = Запрос.Выполнить().Выбрать();
		Если Ответ.Следующий() Тогда
			
			НСтр = ПланФактПродаж.Добавить();
			НСтр.ТипКТК = Ответ.Ссылка;
			НСтр.КоличествоПлан = КоличествоТЕУ / 2;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// + Состояния
	
	// проверяем корректность перечня состояний в ТЧ Состояния
	Для Сч = 0 По Состояния.Количество() - 2 Цикл
		ТекСостояние = Состояния[Сч].Состояние;
		Для ТекСч = Сч + 1 По Состояния.Количество() - 1 Цикл
			Если Состояния[ТекСч].Состояние = ТекСостояние Тогда
				Сообщить("Ошибка: одно состояние может встречаться в документе только один раз!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ОпТипЧисло = НОвый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3));
	
	//++ Зубов 35844 04.08.2021
	////Стаценко Параллельное согласование
	//Для каждого СтрТЧ из Состояния Цикл
	//	Если Не ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//		СтрТЧ.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//        ПредыдущиеЭтапы = СтрТЧ.ПредыдущиеЭтапы;
	//		//Попытка
	//		//	
	//		//Исключение
	//		//	Сообщить("Некорректная строка предыдущих этапов");
	//		//КонецПопытки;
	//		МассивЭтапов = СтрРазделить(ПредыдущиеЭтапы,",",Ложь);
	//		
	//		ВозможноВыполнение = Истина;
	//		Если МассивЭтапов.Количество() > 0 Тогда
	//			Для каждого Эл из МассивЭтапов Цикл
	//				
	//				РезПреобр = ОпТипЧисло.ПривестиЗначение(Эл);
	//				
	//				Если РезПреобр = Неопределено ИЛИ РезПреобр = NULL ИЛИ ТипЗнч(РезПреобр) = ТипЗнч(Эл) ИЛИ РезПреобр = 0 Тогда
	//				
	//					Сообщить("Некорректное указание этапа состояние. Возможен только ввод цифр.");
	//				
	//				Иначе
	//				
	//					НомСтр = РезПреобр;
	//					СтрЭтапа = Состояния.Найти(НомСтр,"НомерСтроки");
	//					Если СтрЭтапа <> Неопределено Тогда
	//						Если СтрЭтапа.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//							ВозможноВыполнение = Ложь;
	//						КонецЕсли;
	//					КонецЕсли;
	//				
	//				КонецЕсли; 
	//				
	//				//Попытка
	//				//	
	//				//Исключение
	//				//	Сообщить("Некорректное указание этапа состояние. Возможен только ввод цифр.");
	//				//КонецПопытки
	//			КонецЦикла;
	//		КонецЕсли;
	//		Если ВозможноВыполнение Тогда
	//			СтрТЧ.Статус =  Перечисления.СтатусыЭтапов.НаВыполнение;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	////Стаценко
	МаршрутизацияСервер.ПараллельноеСогласование(Состояния);
	//-- Зубов 35844 04.08.2021
	
	МаршрутизацияСервер.ПостобработкаТЧСостояний(ЭтотОбъект, Автор);
	
	// если исполнитель пустой, то проставляем тек пользователя
	Для каждого Стр из Состояния Цикл
		Если НЕ ЗначениеЗаполнено(Стр.Исполнитель) Тогда Стр.Исполнитель = Пользователи.ТекущийПользователь(); КонецЕсли;
		// 02.06.20
		Если НЕ ЗначениеЗаполнено(Стр.Наблюдатель) И НЕ Стр.ПримечаниеЗадачаИсполнителю Тогда 
			Стр.Наблюдатель = Пользователи.ТекущийПользователь(); 
		КонецЕсли;// 02.06.20
	КонецЦикла;
	
	
	// определяем текущее состояние. для нас это первое состояние не в "выполнено"
	//Для каждого Состояние из Состояния Цикл
	//	Если Состояние.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//		ТекущееСостояние = Состояние.Состояние;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
		
	// - Состояния
	
	////////////////////////////////////////////////////////////////////
	
	Автосвязывание = Константы.АвтоматическиСвязыватьРейсыПоНаборуКритериев.Получить();
	
	Если НЕ ЗначениеЗаполнено(ПредыдущаяОтправка) И Автосвязывание = Истина Тогда
		
		ПределПоВремени = Константы.ПланированиеПоездовПределСтыковкиПоВремениЧас.Получить();
		ПределПоРасстояниюКМ = Константы.ПланированиеПоездовПределСтыковкиПоСтанциямКм.Получить();
		
		МассивДопустимыхСтанций = Новый Массив;
		МассивДопустимыхСтанций.Добавить(ПунктОтправления);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	РасстоянияМеждуЛокациями.Локация1 КАК Локация1,
		               |	РасстоянияМеждуЛокациями.Локация2 КАК Локация2,
		               |	РасстоянияМеждуЛокациями.РасстояниеКМ КАК РасстояниеКМ
		               |ИЗ
		               |	РегистрСведений.РасстоянияМеждуЛокациями КАК РасстоянияМеждуЛокациями
		               |ГДЕ
		               |	РасстоянияМеждуЛокациями.РасстояниеКМ <= &РасстояниеКМ
		               |	И (РасстоянияМеждуЛокациями.Локация1 = &Станция
		               |			ИЛИ РасстоянияМеждуЛокациями.Локация2 = &Станция)";
		Запрос.УстановитьПараметр("Станция", ПунктОтправления);
		Запрос.УстановитьПараметр("РасстояниеКМ", ПределПоРасстояниюКМ);
		Ответ = Запрос.Выполнить().Выбрать();
		Пока Ответ.Следующий() Цикл
			// сначала хотел сделать проверку наличия в массиве, но какая разница, если оно будет использоваться в конструкции "В" в запросе
			МассивДопустимыхСтанций.Добавить(Ответ.Локация1);
			МассивДопустимыхСтанций.Добавить(Ответ.Локация2);
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	РейсыЖД.Ссылка КАК Ссылка,
		               |	ЕСТЬNULL(ВложенныйЗапрос.Вагон, 0) КАК Вагон,
		               |	РейсыЖД.ПунктНазначения = &ПунктОтправленияСлед КАК Поле1
		               |ИЗ
		               |	Справочник.РейсыЖД КАК РейсыЖД
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			ВагоныВОтправке.Отправка КАК Отправка,
		               |			КОЛИЧЕСТВО(ВагоныВОтправке.Вагон) КАК Вагон
		               |		ИЗ
		               |			РегистрСведений.ВагоныВОтправке КАК ВагоныВОтправке
		               |		
		               |		СГРУППИРОВАТЬ ПО
		               |			ВагоныВОтправке.Отправка) КАК ВложенныйЗапрос
		               |		ПО РейсыЖД.Ссылка = ВложенныйЗапрос.Отправка
		               |ГДЕ
		               |	РейсыЖД.ПунктНазначения В(&ПунктНазначения)
		               |	И РейсыЖД.ДатаПрибытия >= &ДатаСледОтправленияМинусПределОжидания
		               |	И РейсыЖД.ДатаПрибытия <= &ДатаОтправления
		               |	И НЕ РейсыЖД.ПометкаУдаления
		               |	И НЕ РейсыЖД.РейсОтменен
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Поле1 УБЫВ,
		               |	РейсыЖД.ДатаПрибытия,
		               |	Вагон УБЫВ";
		Запрос.УстановитьПараметр("ПунктОтправленияСлед", ПунктОтправления);
		Запрос.УстановитьПараметр("ПунктНазначения", МассивДопустимыхСтанций);
		Запрос.УстановитьПараметр("ДатаСледОтправленияМинусПределОжидания", ДатаОтправления - ПределПоВремени * 3600);
		Запрос.УстановитьПараметр("ДатаОтправления", ДатаОтправления);
		Ответ = Запрос.Выполнить().Выбрать();
		Если Ответ.Следующий() Тогда
			ПредыдущаяОтправка = Ответ.Ссылка;
			ПредыдущаяОтправкаВыбранаАвтоматически = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	// если изменилась дата прибытия, проверить, учтен ли данный рейс в сделке.
	Если Ссылка.ДатаПрибытия<>ДатаПрибытия Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
//Евросиб Гудкова( 03.11.2020 Ticket№ 0212830
		               |	СделкаРейсы.Ссылка.ДатаПрибытияРейса КАК ДатаПрибытияРейса,
// Евросиб Гудкова) 		
		               |	СделкаРейсы.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.Сделка.Рейсы КАК СделкаРейсы
		               |ГДЕ
		               |	СделкаРейсы.Рейс.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		Для КАждого Стр Из ТЗ Цикл
			
//Евросиб Гудкова( 03.11.2020 Ticket№ 0212830
//было
			//ЕстьИзменения = Ложь;
			//
			//ПолучОб = Стр.Ссылка.ПолучитьОбъект();
			//
			//// надо найти рейс, у котрого самая поздняя дата прибытия в данной сделке
			//Запрос2 = Новый Запрос;
			//Запрос2.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			//               |	РейсыЖД.ДатаПрибытия КАК ДатаПрибытия,
			//               |	СделкаРейсы.Ссылка КАК Ссылка
			//               |ИЗ
			//               |	Документ.Сделка.Рейсы КАК СделкаРейсы
			//               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РейсыЖД КАК РейсыЖД
			//               |		ПО СделкаРейсы.Рейс = РейсыЖД.Ссылка
			//               |ГДЕ
			//               |	СделкаРейсы.Ссылка = &Ссылка
			//               |	И НЕ СделкаРейсы.Рейс = &ТекРейс
			//               |
			//               |УПОРЯДОЧИТЬ ПО
			//               |	ДатаПрибытия УБЫВ";
			//Запрос2.УстановитьПараметр("Ссылка",Стр.Ссылка);
			//Запрос2.УстановитьПараметр("ТекРейс",Ссылка);
			//Ответ = Запрос2.Выполнить().Выбрать();
			//// если дата текущего рейса больше всех других дат прибытия в сделке, то нужно обновить эту дату в сделке
			//Если Ответ.Следующий() Тогда
			//	Если Ответ.ДатаПрибытия<ДатаПрибытия Тогда
			//		ЕстьИзменения = Истина;
			//	КонецЕсли;
			//// если не нашли других рейсов, то нужно обновить данные согласно текущему рейсу
			//Иначе
			//	ЕстьИзменения = Истина;
			//КонецЕсли;
			//Если ЕстьИзменения Тогда
			//	ПолучОб.ДатаПрибытияРейса = ДатаПрибытия;
			Если Стр.ДатаПрибытияРейса < ДатаПрибытия Тогда
			ПолучОб = Стр.Ссылка.ПолучитьОбъект();
			ПолучОб.ДатаПрибытияРейса = ДатаПрибытия;
			//полная обработка сделки не требуется
			ПолучОб.ОбменДанными.Загрузка = Истина; 
// Евросиб Гудкова) 			
				ТЧ_Сост = ПолучОб.Состояния;
				// находим нормативное использование ПервыйРДмесяцаПослеОкончанияПеревозки. Для него необходимо выполнить пересчет
				Для Каждого Стр_Ст Из ТЧ_Сост Цикл
					Если Стр_Ст.ВидНормативаИсполнения = Перечисления.ВидыНормативовИспользования.ПервыйРДмесяцаПослеОкончанияПеревозки Тогда
						Стр_Ст.НормативИсполненияСМоментаСоздания = МаршрутизацияСервер.РасчетНормативаИсполнения(Стр_Ст.ВидНормативаИсполнения,Стр.Ссылка,ДатаПрибытия,Ссылка);
						// состояния не могут повторяться, поэтому, если нашли нужное, то прерываем цикл
						Прервать;
					КонецЕсли;
				КонецЦикла;
				ПолучОб.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ЛичныеЦелиСервер.ОчиститьЗаписиЛичныхЦелей(Ссылка);
	
	// отразить историю изменений реквизитов в ТЧ  ИсторияИзменений
	Если ИсторияИзменений.Количество() = 0 ИЛИ ДатаОтправления <> ИсторияИзменений[0].ДатаОтправления Тогда
		
		НСтр = ИсторияИзменений.Добавить();
		НСтр.ДатаВерсии = ТекущаяДата();
		НСтр.ДатаОтправления = ДатаОтправления;
		ИсторияИзменений.Сортировать("ДатаВерсии УБЫВ");
		
	КонецЕсли;   
	
	// ДИТ US 81881 ТА 83581 Сержантова А.С. Начало: 08.04.2024
	Если не Отказ и (ДатаПрибытия <> Ссылка.ДатаПрибытия или ПунктНазначения <> Ссылка.ПунктНазначения
		или ПометкаУдаления <> Ссылка.ПометкаУдаления или РейсОтменен <> Ссылка.РейсОтменен) Тогда
		ПроверитьЗапросНаАвтоСоздатьЗадачуНаОбновление(); 
	КонецЕсли;
	// ДИТ US 81881 ТА 83581 Сержантова А.С. Конец: 08.04.2024
	
	//Евросиб Каблов 10.06.2025 ( #111512
	Если Не Отказ Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РейсыЖД.ПометкаУдаления КАК ПометкаУдаления,
		|	РейсыЖД.РейсОтменен КАК РейсОтменен,
		|	ВЫБОР
		|		КОГДА РейсыЖД.ДатаОтправленияНаМоментНормирования_DX = &ПустаяДата
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЗаполненаДатаОтправленияНаМоментНормирования_DX
		|ИЗ
		|	Справочник.РейсыЖД КАК РейсыЖД
		|ГДЕ
		|	РейсыЖД.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РейсыЖДФактическийСоставПоезда.НомерКонтейнера КАК НомерКонтейнера,
		|	РейсыЖДФактическийСоставПоезда.НомерНакладной КАК НомерНакладной
		|ИЗ
		|	Справочник.РейсыЖД.ФактическийСоставПоезда КАК РейсыЖДФактическийСоставПоезда
		|ГДЕ
		|	РейсыЖДФактическийСоставПоезда.Ссылка = &Ссылка";
		
		ПустаяДата = '00010101';
		Запрос.УстановитьПараметр("ПустаяДата", ПустаяДата);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		ПрежниеЗначенияРеквизитов = РезультатыЗапроса[0].Выбрать();
		
		ПоставитьВОчередь = Ложь;
		Если Не ПрежниеЗначенияРеквизитов.Следующий() Тогда
			ПоставитьВОчередь = Истина;			
		ИначеЕсли (ПрежниеЗначенияРеквизитов.ПометкаУдаления <> ПометкаУдаления
				Или ПрежниеЗначенияРеквизитов.РейсОтменен <> РейсОтменен) Тогда			
			ПоставитьВОчередь = Истина;
		КонецЕсли;
		
		Если Не ПоставитьВОчередь Тогда
			ПрежнийФактическийСоставПоезда = РезультатыЗапроса[1].Выгрузить();
			ПоставитьВОчередь = Не ОбщегоНазначения.КоллекцииИдентичны(ПрежнийФактическийСоставПоезда, ФактическийСоставПоезда, "НомерКонтейнера, НомерНакладной",, Ложь);
		КонецЕсли;
		
		Если ПоставитьВОчередь Тогда
			ОтложенноеИзменениеСервер.ПоставитьСвязанныеОбъектыВОчередьИзменения(ЭтотОбъект);
		КонецЕсли;
		
	КонецЕсли;
	//Евросиб Каблов 10.06.2025 )
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	МаршрутизацияСервер.РегистрацияСостоянийДокументаПриЗаписи(ЭтотОбъект, Отказ, Истина);
	
	Отправки_сервер.УдалитьДвиженияРегистраПродажиРейсов(Ссылка);
	
	МЗ = РегистрыСведений.ПродажиРейсов.СоздатьМенеджерЗаписи();
	МЗ.Рейс = Ссылка;
	МЗ.ОбъектРегистратор = Ссылка;
	МЗ.ДоступноТЕУ = КоличествоТЕУ;
	МЗ.Записать(Истина);
	
	ЛичныеЦелиСервер.ДобавитьЗаписиЛичныхЦелей(Ссылка);
	
КонецПроцедуры   

// ДИТ US 81881 ТА 83581 Сержантова А.С. 08.04.2024
Процедура ПроверитьЗапросНаАвтоСоздатьЗадачуНаОбновление()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаПереченьРейсов.Ссылка КАК Заявка,
	|	ЗаявкаСоставУслуги.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки
	|ПОМЕСТИТЬ ВТ_ЗаявкиСРейсом
	|ИЗ
	|	Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РейсыЖД.ФактическийСоставПоезда КАК РейсыЖДФактическийСоставПоезда
	|			ПО ЗаявкаСоставУслуги.НомерКТК.Наименование = РейсыЖДФактическийСоставПоезда.НомерКонтейнера
	|		ПО ЗаявкаПереченьРейсов.Ссылка = ЗаявкаСоставУслуги.Ссылка
	|ГДЕ
	|	ЗаявкаПереченьРейсов.Рейс = &Рейс
	|	И ЗаявкаПереченьРейсов.Ссылка.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗапросНаАвтоперевозкуКонтейнеры.Ссылка КАК ЗапросНаАвто
	|ИЗ
	|	ВТ_ЗаявкиСРейсом КАК ВТ_ЗаявкиСРейсом
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
	|		ПО ВТ_ЗаявкиСРейсом.Заявка = ЗапросНаАвтоперевозкуКонтейнеры.Ссылка.Заявка
	|ГДЕ
	|	НЕ ЗапросНаАвтоперевозкуКонтейнеры.Ссылка.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗапросНаАвтоперевозкуКонтейнеры.Ссылка КАК ЗапросНаАвто
	|ИЗ
	|	ВТ_ЗаявкиСРейсом КАК ВТ_ЗаявкиСРейсом
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
	|		ПО ВТ_ЗаявкиСРейсом.Заявка = ЗапросНаАвтоперевозкуКонтейнеры.Ссылка.Заявка
	|ГДЕ
	|	НЕ ЗапросНаАвтоперевозкуКонтейнеры.Ссылка.ПометкаУдаления
	|	И ЗапросНаАвтоперевозкуКонтейнеры.ТерминалВыдачи <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Рейс", Ссылка);
	
	Результаты = Запрос.ВыполнитьПакет();
	РезультатПриИзменении = Результаты[1];
	РезультатПриУдалении = Результаты[2];   
	// при изменении открываем в запросе на авто задачу по обновлению данных
	Если не РезультатПриИзменении.Пустой() и не (ПометкаУдаления или РейсОтменен) Тогда
		Выборка = РезультатПриИзменении.Выбрать();  
		СостояниеДляЗадачиОбновления = Справочники.Состояния.НеобходимоОбновитьДанные;
		Пока Выборка.Следующий() Цикл
			ОбъектЗапросаНаАвто = Выборка.ЗапросНаАвто.ПолучитьОбъект();
			ЗадачаОбновленияДобавлена = Ложь;
			Для каждого СтрСостояния Из ОбъектЗапросаНаАвто.Состояния Цикл
				Если СтрСостояния.Состояние = СостояниеДляЗадачиОбновления Тогда
					СтрСостояния.Статус = Перечисления.СтатусыЭтапов.ВРаботе;
					СтрСостояния.НачалоРаботы = ТекущаяДата(); 
					ЗадачаОбновленияДобавлена = Истина;
				КонецЕсли;
			КонецЦикла;  
			Если не ЗадачаОбновленияДобавлена Тогда
				//Применить к запросу на авто маршрут
				ПараметрыЗапроса = Новый Соответствие;
				РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьЗапросНаАвто(ПараметрыЗапроса, ОбъектЗапросаНаАвто.Дата);
				Если РезультатЗапроса.Количество() > 0 Тогда
					Если РезультатЗапроса.Количество() > 0 Тогда
						МаршрутизацияСервер.ПрименитьМаршрут(ОбъектЗапросаНаАвто, РезультатЗапроса, ОбъектЗапросаНаАвто.Автор, Новый СписокЗначений); 
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;
			ОбъектЗапросаНаАвто.Записать();
		КонецЦикла;  
	// при удалении или отмене рейса открываем задачу по актуализации терминала выдачи 
	ИначеЕсли не РезультатПриУдалении.Пустой() и 
		(Ссылка.ПометкаУдаления <> ПометкаУдаления или Ссылка.РейсОтменен <> РейсОтменен)Тогда    
		Выборка = РезультатПриУдалении.Выбрать();   
		СостояниеДляЗадачиОбновления = Справочники.Состояния.НеобходимоОбновитьДанные;
		СостояниеДляЗадачиПриУдалении = Справочники.Состояния.ОтменаРейсаАктуализироватьТерминал;
		Пока Выборка.Следующий() Цикл
			ОбъектЗапросаНаАвто = Выборка.ЗапросНаАвто.ПолучитьОбъект();
			ЗадачаОбновленияДобавлена = Ложь;  
			ЗадачаОбновленияПриУдаленииДобавлена = Ложь; 
			Для каждого СтрСостояния Из ОбъектЗапросаНаАвто.Состояния Цикл
				Если СтрСостояния.Состояние = СостояниеДляЗадачиОбновления Тогда
					СтрСостояния.Статус = Перечисления.СтатусыЭтапов.ВРаботе;
					СтрСостояния.НачалоРаботы = ТекущаяДата(); 
					ЗадачаОбновленияДобавлена = Истина;
				КонецЕсли; 
				Если СтрСостояния.Состояние = СостояниеДляЗадачиПриУдалении Тогда
					СтрСостояния.Статус = Перечисления.СтатусыЭтапов.ВРаботе;
					СтрСостояния.НачалоРаботы = ТекущаяДата(); 
					СтрСостояния.ПредыдущиеЭтапы = "1";   
					ЗадачаОбновленияПриУдаленииДобавлена = Истина;
				КонецЕсли;
			КонецЦикла; 
			Если не ЗадачаОбновленияДобавлена Тогда
				ПараметрыЗапроса = Новый Соответствие;
				РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьЗапросНаАвто(ПараметрыЗапроса, ОбъектЗапросаНаАвто.Дата);
				Если РезультатЗапроса.Количество() > 0 Тогда
					Если РезультатЗапроса.Количество() > 0 Тогда
						МаршрутизацияСервер.ПрименитьМаршрут(ОбъектЗапросаНаАвто, РезультатЗапроса, ОбъектЗапросаНаАвто.Автор, Новый СписокЗначений); 
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Если не ЗадачаОбновленияПриУдаленииДобавлена Тогда
				НС = ОбъектЗапросаНаАвто.Состояния.Добавить();	
				НС.Состояние = СостояниеДляЗадачиПриУдалении;
				НС.Статус = Перечисления.СтатусыЭтапов.ВРаботе; 
				НС.Исполнитель = ОбъектЗапросаНаАвто.Автор;  
				НС.Наблюдатель = ОбъектЗапросаНаАвто.Автор;
				НС.ПредыдущиеЭтапы = "1"; 
				НС.НачалоРаботы = ТекущаяДата();
			КонецЕсли; 
			ОбъектЗапросаНаАвто.Записать();
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
