
Функция ПолучитьEMAILПользователя(Контрагент) 
	
	Результат = "";
	Для каждого Стр из Контрагент.КонтактнаяИнформация Цикл
		Если ЗначениеЗаполнено(Стр.АдресЭП) тогда
			Результат = Стр.Представление;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

Процедура РассылкаПоЛичнымЦелямПользователям() Экспорт
	
	// первичная проверка на то, что мы вообще можем что-то отправить
	УчетнаяЗаписьПоУмолчанию = РаботаСПочтовымиСообщениями.ПроверитьСистемнаяУчетнаяЗаписьДоступна();
	
	Если не УчетнаяЗаписьПоУмолчанию Тогда 
		возврат; 
	КонецЕсли;
	
	СистемнаяУчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	ПрефиксНС = Константы["АдресПубликацииИнформационнойБазыВЛокальнойСети"+?(ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована, "Тестовый", "")].Получить() + "#";
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛичныеЦелиЪ.Ссылка КАК ДокументЛичныеЦели,
		|	ЛичныеЦелиЪ.СрокДостижения КАК СрокДостижения,
		|	ЛичныеЦелиЪ.КонтактДляУведомлений КАК КонтактДляУведомлений,
		|	ИСТИНА КАК СрокДостигнут,
		|	NULL КАК ИнформироватьДоОкончанияЗаДней
		|ПОМЕСТИТЬ СписокУведомляемых
		|ИЗ
		|	Документ.ЛичныеЦели КАК ЛичныеЦелиЪ
		|ГДЕ
		|	(ЛичныеЦелиЪ.СрокДостижения = &ТекДата
		|				И ЛичныеЦелиЪ.УведомитьОРезультатах
		|			ИЛИ ДОБАВИТЬКДАТЕ(ЛичныеЦелиЪ.СрокДостижения, ДЕНЬ, ЛичныеЦелиЪ.ИнформироватьДоОкончанияЗаДней) = &ТекДата
		|				И ЛичныеЦелиЪ.ИнформироватьДоОкончанияЗаДней = 0)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛичныеЦелиЪ.Ссылка,
		|	ЛичныеЦелиЪ.СрокДостижения,
		|	ЛичныеЦелиЪ.Сотрудник,
		|	ЛОЖЬ,
		|	ЛичныеЦелиЪ.ИнформироватьДоОкончанияЗаДней
		|ИЗ
		|	Документ.ЛичныеЦели КАК ЛичныеЦелиЪ
		|ГДЕ
		|	ДОБАВИТЬКДАТЕ(ЛичныеЦелиЪ.СрокДостижения, ДЕНЬ, -ЛичныеЦелиЪ.ИнформироватьДоОкончанияЗаДней) = &ТекДата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокУведомляемых.ДокументЛичныеЦели КАК ДокументЛичныеЦели,
		|	СписокУведомляемых.СрокДостижения КАК СрокДостижения,
		|	СписокУведомляемых.КонтактДляУведомлений КАК КонтактДляУведомлений,
		|	СписокУведомляемых.ИнформироватьДоОкончанияЗаДней КАК ИнформироватьДоОкончанияЗаДней,
		|	СписокУведомляемых.СрокДостигнут КАК СрокДостигнут
		|ИЗ
		|	СписокУведомляемых КАК СписокУведомляемых
		|ИТОГИ ПО
		|	КонтактДляУведомлений,
		|	СрокДостигнут";
	
	Запрос.УстановитьПараметр("ТекДата", НачалоДня(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКонтактДляУведомлений = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаКонтактДляУведомлений.Следующий() Цикл
		
		// получаем пользователей. рассылка для каждого отдельная
		ПользователиДляРассылки = ВыборкаКонтактДляУведомлений.КонтактДляУведомлений;
		
		Тема = "DATACore: информация по личным целям и задачам";
		ТекстПисьма = "Уважаемые коллеги,<br/>";
		ПолучателиПисьма = Новый Массив;
		
		ПараметрыОтправкиПисьма = новый Структура;
		ПараметрыОтправкиПисьма.Вставить("ТипТекста", "HTML");
		
		Если ТипЗнч(ПользователиДляРассылки) = Тип("СправочникСсылка.Пользователи") Тогда
			EMAIL = ПолучитьEMAILПользователя(ПодобратьЗамещение(ПользователиДляРассылки, ТекущаяДата()));
			Если ЗначениеЗаполнено(EMAIL) Тогда
				ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", Строка(ПользователиДляРассылки), EMAIL));
			КонецЕсли;
		Иначе
			ПользователиГруппы = Пользователи_sd_сервер.ПолучитьПользователейГруппы(ПользователиДляРассылки);
			Для каждого ПользовательЪ из ПользователиГруппы Цикл
				EMAIL = ПолучитьEMAILПользователя(ПодобратьЗамещение(ПользовательЪ, ТекущаяДата()));
				Если ЗначениеЗаполнено(EMAIL) Тогда
					ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", Строка(ПользовательЪ), EMAIL));
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

		ВыборкаСрокДостигнут = ВыборкаКонтактДляУведомлений.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСрокДостигнут.Следующий() Цикл
	
			ВыборкаДетальныеЗаписи = ВыборкаСрокДостигнут.Выбрать();
			
			Если ВыборкаСрокДостигнут.СрокДостигнут Тогда
				ТекстПисьма = ТекстПисьма + "<br/><b>По следующим задачам завершен плановый срок исполнения:</b><br/><br/>";
			Иначе
				ТекстПисьма = ТекстПисьма + "<br/><b>По следующим задачам наступил срок напоминания:</b><br/><br/>";
			КонецЕсли;
			
			ТекстПисьма = ТекстПисьма + "<table border=1><tr><td>Карточка личной цели</td><td>Ссылка</td></tr>";
		
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				ТекстНС = "<a target=""_blank"" href="""+ПрефиксНС+ПолучитьНавигационнуюСсылку(ВыборкаДетальныеЗаписи.ДокументЛичныеЦели)+""">"+ПолучитьНавигационнуюСсылку(ВыборкаДетальныеЗаписи.ДокументЛичныеЦели)+"</a>";
				ТекстПисьма = ТекстПисьма + "<tr><td>"+ВыборкаДетальныеЗаписи.ДокументЛичныеЦели+"</td><td>"+ТекстНС+"</td></tr>";
				
			КонецЦикла;
		
			ТекстПисьма = ТекстПисьма + "</table>";	
		КонецЦикла;
		
		ПараметрыОтправкиПисьма.Вставить("Тема", Тема);
		ПараметрыОтправкиПисьма.Вставить("Тело", ТекстПисьма);
		
		ПараметрыОтправкиПисьма.Вставить("Кому", ПолучателиПисьма);
		
		
		РЕЗУЛЬТАТ = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(СистемнаяУчетнаяЗапись, ПараметрыОтправкиПисьма);

		
	КонецЦикла;
	
КонецПроцедуры


Функция ПодобратьЗамещение(Пользователь, ДатаЗамещения) Экспорт
	
	Результат = Пользователь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗамещениеЪ.Замещение КАК Замещение
	               |ИЗ
	               |	Документ.Замещение КАК ЗамещениеЪ
	               |ГДЕ
	               |	ЗамещениеЪ.Проведен
	               |	И ЗамещениеЪ.РежимДокумента = 0
	               |	И ЗамещениеЪ.ИсходныйПользователь = &ИсходныйПользователь
	               |	И &ДатаДокумента МЕЖДУ ЗамещениеЪ.НачалоПериодаЗамещения И ЗамещениеЪ.КонецПериодаЗамещения";
	Запрос.УстановитьПараметр("ИсходныйПользователь", Пользователь);
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаЗамещения);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Замещение;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
Процедура СформироватьЛичноеСообщение(ГУИДТемы, ОписаниеТемы="", Контекст, ДатаСообщения, АвторСообщения, ТекстСообщения, Файл=Неопределено, ГУИДСообщения, Получатель) Экспорт
	
	Если ОписаниеТемы = "" ИЛИ ОписаниеТемы = Неопределено Тогда
	
		ОписаниеТемы = "ЛС:"+АвторСообщения+":"+Лев(ТекстСообщения, 100);
	
	КонецЕсли; 
	
	Строка_ГУИДТемы = Строка(ГУИДТемы);
	Диалоги_сервер.СоздатьТему(Строка_ГУИДТемы, ОписаниеТемы, Контекст);
	
	ГУИДСообщения = Строка(Новый УникальныйИдентификатор());
	
	Диалоги_сервер.ДобавитьСообщение(Строка_ГУИДТемы, ГУИДСообщения, АвторСообщения, ДатаСообщения, ТекстСообщения, Файл, Получатель);

КонецПроцедуры

//Евросиб Каблов 20.03.2024 68187
Процедура РассылкаНаступленияСНП() Экспорт
	
	Если НЕ РаботаСПочтовымиСообщениями.ПроверитьСистемнаяУчетнаяЗаписьДоступна() Тогда 
		ЗаписьЖурналаРегистрации("Ошибка отправки списка непрочитанных", УровеньЖурналаРегистрации.Ошибка,,, "Недоступна системная учетная запись");
		Возврат; 
	КонецЕсли;
	
	ТекДата = ТекущаяДата();
	НачалоТекущегоДня = НачалоДня(ТекДата);
	СекундВСутках = 86400;
	ПустаяДата = '00010101';
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетСНП.КлючАналитикиПеревозки.Заявка КАК Заявка,
	|	РасчетСНП.КлючАналитикиПеревозки.Контейнер КАК Контейнер,
	|	0 КАК ДнейДоНаступленияСНП
	|ПОМЕСТИТЬ НаступающиеСНП
	|ИЗ
	|	Документ.РасчетСНП КАК РасчетСНП
	|ГДЕ
	|	РасчетСНП.Проведен
	|	И РасчетСНП.ПредполагаемаяДатаНачалаСНП = &ТекущаяДата
	|	И РасчетСНП.ФактическаяДатаОкончания = &ПустаяДата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетСНП.КлючАналитикиПеревозки.Заявка,
	|	РасчетСНП.КлючАналитикиПеревозки.Контейнер,
	|	5
	|ИЗ
	|	Документ.РасчетСНП КАК РасчетСНП
	|ГДЕ
	|	РасчетСНП.Проведен
	|	И РасчетСНП.ПредполагаемаяДатаНачалаСНП = &ДатаЧерез5Дней
	|	И РасчетСНП.ФактическаяДатаОкончания = &ПустаяДата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НаступающиеСНП.Заявка КАК Заявка,
	|	НаступающиеСНП.Заявка.Автор КАК Получатель,
	|	ПользователиКонтактнаяИнформация.АдресЭП КАК АдресЭП,
	|	НаступающиеСНП.Заявка.Номер КАК НомерЗаявки,
	|	НаступающиеСНП.Заявка.Дата КАК ДатаЗаявки,
	|	НаступающиеСНП.Заявка.Автор.Представление КАК ПредставлениеПолучателя,
	|	НаступающиеСНП.Заявка.Представление КАК ПредставлениеЗаявки,
	|	НаступающиеСНП.Контейнер КАК Контейнер,
	|	НаступающиеСНП.Контейнер.Наименование КАК НомерКонтейнера,
	|	НаступающиеСНП.ДнейДоНаступленияСНП КАК ДнейДоНаступленияСНП,
	|	НаступающиеСНП.Заявка.Контрагент.Наименование КАК НаименованиеКонтрагента
	|ИЗ
	|	НаступающиеСНП КАК НаступающиеСНП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|		ПО НаступающиеСНП.Заявка.Автор = ПользователиКонтактнаяИнформация.Ссылка
	|			И (ПользователиКонтактнаяИнформация.Тип = &ТипАдресЭлектроннойПочты)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Получатель,
	|	ДнейДоНаступленияСНП,
	|	Заявка,
	|	Контейнер";
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетСНП.КлючАналитикиПеревозки.Заявка КАК Заявка,
	|	РасчетСНП.КлючАналитикиПеревозки.Контейнер КАК Контейнер,
	|	0 КАК ДнейДоНаступленияСНП,
	|	РасчетСНП.КлючАналитикиПеревозки.Заявка.Автор КАК АвторЗаявки,
	|	РасчетСНП.Автор КАК Автор
	|ПОМЕСТИТЬ НаступающиеСНП
	|ИЗ
	|	Документ.РасчетСНП КАК РасчетСНП
	|ГДЕ
	|	РасчетСНП.Проведен
	|	И РасчетСНП.ПредполагаемаяДатаНачалаСНП = &ТекущаяДата
	|	И РасчетСНП.ФактическаяДатаОкончания = &ПустаяДата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетСНП.КлючАналитикиПеревозки.Заявка,
	|	РасчетСНП.КлючАналитикиПеревозки.Контейнер,
	|	5,
	|	РасчетСНП.КлючАналитикиПеревозки.Заявка.Автор,
	|	РасчетСНП.Автор
	|ИЗ
	|	Документ.РасчетСНП КАК РасчетСНП
	|ГДЕ
	|	РасчетСНП.Проведен
	|	И РасчетСНП.ПредполагаемаяДатаНачалаСНП = &ДатаЧерез5Дней
	|	И РасчетСНП.ФактическаяДатаОкончания = &ПустаяДата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НаступающиеСНП.Заявка КАК Заявка,
	|	НаступающиеСНП.Контейнер КАК Контейнер,
	|	НаступающиеСНП.АвторЗаявки КАК Получатель,
	|	НаступающиеСНП.ДнейДоНаступленияСНП КАК ДнейДоНаступленияСНП
	|ПОМЕСТИТЬ НаступающиеСНПпоПолучателям
	|ИЗ
	|	НаступающиеСНП КАК НаступающиеСНП
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НаступающиеСНП.Заявка,
	|	НаступающиеСНП.Контейнер,
	|	НаступающиеСНП.Автор,
	|	НаступающиеСНП.ДнейДоНаступленияСНП
	|ИЗ
	|	НаступающиеСНП КАК НаступающиеСНП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НаступающиеСНП.Заявка КАК Заявка,
	|	НаступающиеСНП.Получатель КАК Получатель,
	|	ПользователиКонтактнаяИнформация.АдресЭП КАК АдресЭП,
	|	НаступающиеСНП.Заявка.Номер КАК НомерЗаявки,
	|	НаступающиеСНП.Заявка.Дата КАК ДатаЗаявки,
	|	НаступающиеСНП.Получатель.Представление КАК ПредставлениеПолучателя,
	|	НаступающиеСНП.Заявка.Представление КАК ПредставлениеЗаявки,
	|	НаступающиеСНП.Контейнер КАК Контейнер,
	|	НаступающиеСНП.Контейнер.Наименование КАК НомерКонтейнера,
	|	НаступающиеСНП.ДнейДоНаступленияСНП КАК ДнейДоНаступленияСНП,
	|	НаступающиеСНП.Заявка.Контрагент.Наименование КАК НаименованиеКонтрагента
	|ИЗ
	|	НаступающиеСНПпоПолучателям КАК НаступающиеСНП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|		ПО НаступающиеСНП.Получатель = ПользователиКонтактнаяИнформация.Ссылка
	|			И (ПользователиКонтактнаяИнформация.Тип = &ТипАдресЭлектроннойПочты)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Получатель,
	|	ДнейДоНаступленияСНП,
	|	Заявка,
	|	Контейнер";
	
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоТекущегоДня);
	ДатаЧерез5Дней = НачалоТекущегоДня + 5 * СекундВСутках; 
	Запрос.УстановитьПараметр("ДатаЧерез5Дней", ДатаЧерез5Дней);
	Запрос.УстановитьПараметр("ТипАдресЭлектроннойПочты", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("ПустаяДата", ПустаяДата);
	Выборка = Запрос.Выполнить().Выбрать();
	
	СистемнаяУчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	ШаблонЗаголовкаЗадачи = "Начало СНП КТК №%1 по заявке %2";
	
	//ШаблонТекстаПисьмаНаступилСНП = "По вашей заявке %1 появились КТК  с наступившим сроком <b>СНП</b>.<br/>";
	
	ШаблонТемыПисьмаСНП = "Уведомление о начале СНП";
	ШаблонТекстаПисьмаНаступилСНП = 
	"Появились контейнеры с наступившим сроком <b>СНП</b> по вашим заявкам:<br/>
	|%1";
	
	ШаблонТемыПисьмаСНП5 = "Уведомление о начале СНП через 5 суток";
	ШаблонТекстаПисьмаНаступитСНП5 = 
	"Появились контейнеры, у которых через 5 суток наступит <b>СНП</b>, по вашим заявкам:<br/>
	|%1";
	
	Пока Выборка.СледующийПоЗначениюПоля("Получатель") Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.АдресЭП) Тогда
			ЗаписьЖурналаРегистрации("Ошибка отправки списка непрочитанных", УровеньЖурналаРегистрации.Ошибка,,, "Не задан электронный адрес получателя " + Выборка.ПредставлениеПользователя);
			Продолжить;
		КонецЕсли;
		
		АдресЭП = Выборка.АдресЭП;
		ПредставлениеПолучателя = Выборка.ПредставлениеПолучателя;
		
		Пока Выборка.СледующийПоЗначениюПоля("ДнейДоНаступленияСНП") Цикл
			
			
			Заявки = Новый Массив;
			Пока Выборка.СледующийПоЗначениюПоля("Заявка") Цикл
				
				НомерЗаявки = Выборка.НомерЗаявки;
				ДатаЗаявки = Выборка.ДатаЗаявки;				
				ПредставлениеЗаявки = СтрШаблон("Заявка %1 от %2. Контрагент - %3", НомерЗаявки, Формат(ДатаЗаявки, "ДФ=dd.MM.yyyy"), Выборка.НаименованиеКонтрагента);
				
				Заявки.Добавить(ПредставлениеЗаявки);
				
				//НомераКонтейнеров = Новый Массив;
				//Пока Выборка.СледующийПоЗначениюПоля("Контейнер") Цикл
				//	НомераКонтейнеров.Добавить(Выборка.НомерКонтейнера);
				//КонецЦикла;
				//НомераКонтейнеров = СтрСоединить(НомераКонтейнеров, ", ");
				
			КонецЦикла;
			
			Заявки = СтрСоединить(Заявки, "<br/>" + Символы.ПС);
			
			Если Выборка.ДнейДоНаступленияСНП = 0 Тогда
				Тема = ШаблонТемыПисьмаСНП;
				ТекстПисьма = СтрШаблон(ШаблонТекстаПисьмаНаступилСНП, Заявки);				
			ИначеЕсли Выборка.ДнейДоНаступленияСНП = 5 Тогда
				Тема = ШаблонТемыПисьмаСНП5;
				ТекстПисьма = СтрШаблон(ШаблонТекстаПисьмаНаступитСНП5, Заявки);
			КонецЕсли;
			
			//Отправка сообщения по эл. почте
			ПолучателиПисьма = Новый Массив;
			ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", Строка(ПредставлениеПолучателя), АдресЭП));
			
			ПараметрыОтправкиПисьма = новый Структура;
			ПараметрыОтправкиПисьма.Вставить("Тема", Тема);
			ПараметрыОтправкиПисьма.Вставить("Тело", ТекстПисьма);
			ПараметрыОтправкиПисьма.Вставить("ТипТекста", "HTML");
			ПараметрыОтправкиПисьма.Вставить("Кому", ПолучателиПисьма);
			
			Если ПолучателиПисьма.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Результат = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(СистемнаяУчетнаяЗапись, ПараметрыОтправкиПисьма);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры
