&НаКлиенте
Процедура ЗагрузитьИзЭТРАН(Команда)
	
	ЗагрузитьИзЭТРАНаСервере("э_ОбщиеПоказатели");	 
	  
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзЭТРАНаСервере(Макет)
	
	э_ОбщиеСервер.ЗагрузитьВсеЗаписи(Макет);	
		
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

