
&НаКлиенте
Процедура ПрочитатьЗаполненныйДокумент(Команда)
	
	Сч = 2;
	КодОперации = ТД.Область("R"+Формат(Сч, "ЧГ=")+"C1").Текст;
	НазваниеОперации = ТД.Область("R"+Формат(Сч, "ЧГ=")+"C2").Текст;
	
	Таб = Новый Массив;
	
	Пока КодОперации <> "" И НазваниеОперации <> "" Цикл
		
		Таб.Добавить(Новый Структура("Код, Название", КодОперации, НазваниеОперации));			
		
		Сч = Сч + 1;
		КодОперации = ТД.Область("R"+Формат(Сч, "ЧГ=")+"C1").Текст;
		НазваниеОперации = ТД.Область("R"+Формат(Сч, "ЧГ=")+"C2").Текст;
		
	КонецЦикла;
	
	Если Таб.Количество() = 0 Тогда
		Сообщить("Ничего не прочитано. возможно, в таблицу не введены данные!");
	Иначе
		ОтработатьОперацииВагонов(Таб);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтработатьОперацииВагонов(Таб)
	
	Для каждого стр из Таб Цикл
		
//Евросиб Гудкова( 10.10.2019 
//было		НовСсылка = Справочники.ОперацииСВагонами.НайтиПоКоду(стр.Код);
		НовСсылка = Неопределено;
		ОперацииСВагономВыборка = Справочники.ОперацииСВагонами.Выбрать(,, Новый Структура("Код", стр.Код));
		Пока ОперацииСВагономВыборка.Следующий() Цикл
			Если ОперацииСВагономВыборка.ОперацияСКТК = ОперацииСКТК Тогда
				НовСсылка = ОперацииСВагономВыборка.Ссылка;
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
// Евросиб Гудкова) 		
		Если ЗначениеЗаполнено(НовСсылка) тогда 
			НовО = НовСсылка.ПолучитьОбъект();
		Иначе	
			НовО = Справочники.ОперацииСВагонами.СоздатьЭлемент();
		КонецЕсли;
		
		НовО.Код = стр.Код;
		НовО.Наименование = стр.Название;
		НовО.ОперацияСКТК = ОперацииСКТК;
		НовО.Записать();
		
		Сообщить("Создан / обновлен элемент " + НовО.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

