Функция ПредоставитьДанныеНеакцептовПоПериодуИлиНомеруДокумента(НомерДокумента = неопределено, НачалоПериодаПоиска = неопределено, КонецПериодаПоиска = неопределено, ТолькоДляПередачиВРИТМ = Ложь, СсылкаАкцепта = Неопределено) Экспорт
	
	Результат = Новый Массив;
	
	СоответствиеВСФиpmRfCode = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АкцептУслуги.Номенклатура КАК Номенклатура,
	               |	АкцептУслуги.Ссылка КАК Акцепт,
	               //ДИТ Давудов М.А. US 71643 29.01.2024 Начало
	               //Было:
	               //|	АкцептУслуги.Ссылка.Поступление КАК Поступление,
	               //Стало:
	               |	ВЫБОР
	               |		КОГДА АкцептУслуги.Ссылка.Поступление ССЫЛКА Документ.КорректировкаПоступления
	               |				И ВЫРАЗИТЬ(АкцептУслуги.Ссылка.Поступление КАК Документ.КорректировкаПоступления).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки)
	               |			ТОГДА ВЫРАЗИТЬ(АкцептУслуги.Ссылка.Поступление КАК Документ.КорректировкаПоступления).ДокументПоступления
	               |		ИНАЧЕ АкцептУслуги.Ссылка.Поступление
	               |	КОНЕЦ КАК Поступление,
	               //ДИТ Давудов М.А. US 71643 29.01.2024 Конец
	               |	АкцептУслуги.ПоступлениеКоличество КАК Количество,
	               |	АкцептУслуги.ПоступлениеЦена КАК Цена,
	               |	АкцептУслуги.ПоступлениеСумма КАК Сумма,
	               |	АкцептУслуги.ПоступлениеСтавкаНДС КАК СтавкаНДС,
	               |	АкцептУслуги.ПоступлениеСуммаНДС КАК СуммаНДС,
	               |	АкцептУслуги.ПричинаНеакцепта КАК ПричинаНеакцепта,
	               |	АкцептУслуги.СтатусПричины КАК СтатусПричины,
	               |	АкцептУслуги.Контейнер КАК Контейнер,
	               |	АкцептУслуги.Вагон КАК Вагон,
	               |	АкцептУслуги.ТранспортныйДокумент КАК ТранспортныйДокумент,
	               //ДИТ Давудов М.А. US 71643 29.01.2024 Начало
	               //Было:
	               //|	АкцептУслуги.ИдентификаторСтрокиПоступления КАК pmtRFC,
	               //Стало:
	               |	ЕСТЬNULL(КорректировкаСогласованноеИзменение.ГУИДстроки, АкцептУслуги.ИдентификаторСтрокиПоступления) КАК pmtRFC,
	               //ДИТ Давудов М.А. US 71643 29.01.2024 Конец
	               |	АкцептУслуги.ДатаПретензии КАК ДатаПретензии,
	               |	АкцептУслуги.Ссылка.ВалютаПретензий КАК ВалютаПретензий,
	               |	АкцептУслуги.ПричинаНеакцепта.Код КАК pmtErrCodes,
	               |	АкцептУслуги.ПримечаниеНеакцепта КАК ПримечаниеНеакцепта,
	               |	АкцептУслуги.ПодтвержденнаяСумма КАК ПодтвержденнаяСумма,
	               |	АкцептУслуги.СуммаПретензии КАК СуммаПретензии,
	               |	АкцептУслуги.СтанцияОтправления КАК СтанцияОтправления,
	               |	АкцептУслуги.СтанцияНазначения КАК СтанцияНазначения,
	               |	АкцептУслуги.НачалоОказанияУслуги КАК НачалоОказанияУслуги,
	               |	АкцептУслуги.ОкончаниеОказанияУслуги КАК ОкончаниеОказанияУслуги
	               |ИЗ
	               |	Документ.Акцепт.Услуги КАК АкцептУслуги
	               //ДИТ Давудов М.А. US 71643 29.01.2024 Начало
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления.Услуги КАК КорректировкаСогласованноеИзменение
	               |		ПО АкцептУслуги.Ссылка.Поступление = КорректировкаСогласованноеИзменение.Ссылка
	               |			И АкцептУслуги.ИдентификаторСтрокиПоступления = КорректировкаСогласованноеИзменение.ГУИДПТУ
	               |			И КорректировкаСогласованноеИзменение.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)
	               |			И КорректировкаСогласованноеИзменение.Всего <> 0
	               //ДИТ Давудов М.А. US 71643 29.01.2024 Конец
	               |ГДЕ
	               |	АкцептУслуги.Ссылка.Проведен
	               |	И НЕ АкцептУслуги.Ссылка В
	               |				(ВЫБРАТЬ
	               |					Акцепт.СторнируемыйАкцепт КАК СторнируемыйАкцепт
	               |				ИЗ
	               |					Документ.Акцепт КАК Акцепт)
	               |	И (&НомерНеЗаполнен
//Евросиб Гудкова( 29.10.2020 Ticket№ 0212208
				   |			ИЛИ АкцептУслуги.Ссылка = &СсылкаАкцепта
// Евросиб Гудкова) 				   
				   |			ИЛИ АкцептУслуги.Ссылка.Поступление.НомерВходящегоДокумента = &Номер)
	               |	И (&ДатаНеЗаполнена
	               |			ИЛИ АкцептУслуги.Ссылка.Поступление.Дата МЕЖДУ &Дата1 И &Дата2)
	               |	И АкцептУслуги.ПричинаНеакцепта <> ЗНАЧЕНИЕ(Справочник.Претензии.ПустаяСсылка)
	               |	И ВЫБОР
	               |			КОГДА &ТолькоДляПередачиВРИТМ
	               |				ТОГДА АкцептУслуги.ПричинаНеакцепта.ВыгружатьВРИТМ
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("Номер", НомерДокумента);
	Запрос.УстановитьПараметр("ТолькоДляПередачиВРИТМ", ТолькоДляПередачиВРИТМ);
	Запрос.УстановитьПараметр("НомерНеЗаполнен", НЕ ЗначениеЗаполнено(НомерДокумента));
	Запрос.УстановитьПараметр("ДатаНеЗаполнена", НЕ ЗначениеЗаполнено(НачалоПериодаПоиска));
	Запрос.УстановитьПараметр("Дата1", НачалоПериодаПоиска);
	Запрос.УстановитьПараметр("Дата2", КонецПериодаПоиска);
//Евросиб Гудкова( 29.10.2020 Ticket№ 0212208
	Запрос.УстановитьПараметр("СсылкаАкцепта", СсылкаАкцепта);
// Евросиб Гудкова) 				   
	Ответ = Запрос.Выполнить().Выбрать();
	
	Пока Ответ.Следующий() Цикл
		
		pmRfCode = СоответствиеВСФиpmRfCode.Получить(Ответ.Поступление);
		Если НЕ ЗначениеЗаполнено(pmRfCode) Тогда
			pmRfCode = ПолучитьpmRfCodeпоВСФ(Ответ.Поступление);
			Если ЗначениеЗаполнено(pmRfCode) Тогда
				СоответствиеВСФиpmRfCode.Вставить(Ответ.Поступление, pmRfCode);
			КонецЕсли;
		КонецЕсли;
		
		//Трундуков 111162(02.06.2025)
		//Было
		//ИндексЗначенияПеречисления = Перечисления.СтатусыПричинНеакцепта.Индекс(Ответ.СтатусПричины);
		//ИмяЗначенияПеречисленияСтатусаПричиныНеакцепта = Метаданные.Перечисления.СтатусыПричинНеакцепта.ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;
		Если ЗначениеЗаполнено(Ответ.СтатусПричины) Тогда
			ИндексЗначенияПеречисления = Перечисления.СтатусыПричинНеакцепта.Индекс(Ответ.СтатусПричины);
			ИмяЗначенияПеречисленияСтатусаПричиныНеакцепта = Метаданные.Перечисления.СтатусыПричинНеакцепта.ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;
		Иначе
			ИмяЗначенияПеречисленияСтатусаПричиныНеакцепта = "";
		КонецЕсли;
		//Трундуков Конец
		Результат.Добавить(Новый Структура("СтанцияОтправления, СтанцияНазначения, ДатаНачалаУслуги, ДатаОкончанияУслуги, pmRfCode, pmtRFC, pmtObjDate, pmtObjSum, vSymCode, pmtErrCodes, pmtErrText, pmtObjFulfilment, pmtNotes, pmtIsActual, Поступление, Акцепт, Номенклатура, ПричинаНеакцепта, СтатусПричины, Вагон, Контейнер, ТранспортныйДокумент, Количество, Цена, Сумма, СтавкаНДС, СуммаНДС, СуммаПретензии, ПодтвержденнаяСумма",
					Ответ.СтанцияОтправления, Ответ.СтанцияНазначения, Ответ.НачалоОказанияУслуги, Ответ.ОкончаниеОказанияУслуги, pmRfCode, Ответ.pmtRFC, Ответ.ДатаПретензии, Ответ.СуммаПретензии, Ответ.ВалютаПретензий, Ответ.pmtErrCodes, Ответ.ПричинаНеакцепта, ИмяЗначенияПеречисленияСтатусаПричиныНеакцепта, Ответ.ПримечаниеНеакцепта, неопределено, Ответ.Поступление, Ответ.Акцепт, Ответ.Номенклатура, Ответ.ПричинаНеакцепта, Ответ.СтатусПричины, Ответ.Вагон, Ответ.Контейнер, Ответ.ТранспортныйДокумент, Ответ.Количество, Ответ.Цена, Ответ.Сумма, Ответ.СтавкаНДС, Ответ.СуммаНДС, Ответ.СуммаПретензии, Ответ.ПодтвержденнаяСумма));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьpmRfCodeпоВСФ(ПТУ)
	
	Результат = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПротоколОбменов.УИДИсточника КАК УИДИсточника,
	               |	ПротоколОбменов.Объект КАК Объект,
	               |	ПротоколОбменов.ДатаОбмена КАК ДатаОбмена
	               |ИЗ
	               |	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	               |ГДЕ
	               |	ПротоколОбменов.Объект = &Объект
	               |	И ПротоколОбменов.УзелОбмена = &РИТМ
	               |	И ПротоколОбменов.ДействиеПриОбмене = &ЗагрузкаДанных
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПротоколОбменов.ДатаОбмена УБЫВ";
	Запрос.УстановитьПараметр("РИТМ", Перечисления.УзлыОбмена.РИТМ);
	Запрос.УстановитьПараметр("ЗагрузкаДанных", Перечисления.ДействияПриОбмене.ЗагрузкаДанных);
	Запрос.УстановитьПараметр("Объект", ПТУ);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.УИДИсточника;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПроставитьПТУОтметкуВОчереди(СписокПТУ, ЗначениеОтметки) Экспорт
	
	Для каждого Стр из СписокПТУ Цикл
		
		Если Стр.ПометкаУдаления Тогда Продолжить; КонецЕсли;
		
		//Евросиб - АСуслов 21.11.2022 9:45:45 #58550
		//(
		//ПТУ = Стр.ПолучитьОбъект();
		//ПТУ.ВОчередиАвторазнесения = ЗначениеОтметки;
		//Попытка
		//	ПТУ.Записать(РежимЗаписиДокумента.Запись);
		//	ПТУ.Записать(РежимЗаписиДокумента.Проведение);
		//Исключение
		//	ОО = ОписаниеОшибки();
		//КонецПопытки;    
		Если ЗначениеОтметки = Истина Тогда
			СтатусРазнесения = Документы.Акцепт.ПолучитьДанныеПоследнегоПроведенногоАкцепта(Стр).СтатусРазнесения;
        	ЗаписьДанныхОчередиАвторазнесения(Стр, Ложь, СтатусРазнесения);
		Иначе	
			ИсключитьИзОчередиАвторазнесения(Стр);	
		КонецЕсли;
		//)
		//Евросиб - АСуслов 21.11.2022 9:45:47 #58550
		
	КонецЦикла;
	
КонецПроцедуры

Функция РазнестиПТУ(ПТУ, РазнестиТолькоЗаполненныеКТКилиВагон = Ложь, СтрокиДляОтключения = Неопределено, НовыйАлгоритм = Ложь) Экспорт
	
	//Строки для отключения это таблица значений из колонок "гуид расходов", "сделка"
	//если она заполнена, то по этому списку происходит перепривязка расходов в рамках этой же сделки
	
//Евросиб Гудкова( 06.12.2021 Ticket№ 42922
	ОписаниеЗамера = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("АвторазнесениеСервер");
// Евросиб Гудкова)   
	СтруктураРезультата = Новый Структура("РезультатРазнесения, ТаблицаЛогирования");
	НЗ = 0;
	ДЗ(ПТУ,,НЗ, "=== Начало авторазнесения для ПТУ");
	//Евросиб - АСуслов 17.11.2022 14:24:58 #58550
	//(              
	СтатусРазнесения = Документы.Акцепт.ПолучитьДанныеПоследнегоПроведенногоАкцепта(ПТУ).СтатусРазнесения;
	ЗаписьДанныхОчередиАвторазнесения(ПТУ, Истина, СтатусРазнесения, ТекущаяДата());
	Если ТипЗнч(ПТУ) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
		Если СтатусРазнесения = Перечисления.СостоянияАвторазнесения.АкцептНеСоздан Тогда
			СтруктураРезультата.РезультатРазнесения = СтрШаблон("%1: по документу нет проведенного акцепта. Авторазнесение отменено.", ПТУ);
			Возврат СтруктураРезультата;
		КонецЕсли;
		Если ПТУ.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение")
			И Не ПТУ.КорректироватьСуммыВПервичномВСФ Тогда
			СтруктураРезультата.РезультатРазнесения = СтрШаблон("%1: Корректировочный ВСФ необходимо разносить вручную. Постановка на авторазнесение запрещена. Авторазнесение отменено.", ПТУ);
			Возврат СтруктураРезультата;
		КонецЕсли;
		//Евросиб Каблов 17.01.2024 ( #79488
		РеквизитыПТУ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПТУ, "Штраф");
		Если РеквизитыПТУ.Штраф Тогда
			СтруктураРезультата.РезультатРазнесения = СтрШаблон("%1: к авторазнесению не принимаются документы с признаком «Штраф». Авторазнесение отменено.", ПТУ);		
			Возврат СтруктураРезультата;
		КонецЕсли;
	Иначе
		РеквизитыПТУ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПТУ, "Штраф, Претензия");
		Если РеквизитыПТУ.Штраф Тогда
			СтруктураРезультата.РезультатРазнесения = СтрШаблон("%1: к авторазнесению не принимаются документы с признаком «Штраф». Авторазнесение отменено.", ПТУ);		
			Возврат СтруктураРезультата;
		ИначеЕсли РеквизитыПТУ.Претензия Тогда
			СтруктураРезультата.РезультатРазнесения = СтрШаблон("%1: к авторазнесению не принимаются документы с признаком «Претензия». Авторазнесение отменено.", ПТУ);		
			Возврат СтруктураРезультата;
		КонецЕсли;
		//Евросиб Каблов 17.01.2024 )
	КонецЕсли;
	Если СтатусРазнесения = Перечисления.СостоянияАвторазнесения.НетАктуальногоАкцепта
				ИЛИ СтатусРазнесения = Перечисления.СостоянияАвторазнесения.ПолностьюРазнесено Тогда
		СтруктураРезультата.РезультатРазнесения = СтрШаблон("%1: к авторазнесению не принимаются документы в состоянии «Полностью разнесено» или «Нет актуального акцепта». Текущее состояние документа: «%2». Авторазнесение отменено.", ПТУ, СтатусРазнесения);		
		Возврат СтруктураРезультата;
	КонецЕсли;
	
	//ЗаписьДанныхОчередиАвторазнесения(ПТУ, Истина, СтатусРазнесения, ТекущаяДата());
	//)
	//Евросиб - АСуслов 17.11.2022 14:25:08 #58550
	ДатаНачалаРазнесенияПТУ = ТекущаяДата();
	
	// Шейко О.Е. 12.05.2021 Не запускаем, если это ПТУ по Аренде КТК
	ЭтоУслугаАрендыКТК = Ложь;
	Для каждого Стр Из ПТУ.Услуги Цикл
		ЭтоУслугаАрендыКТК = Стр.Номенклатура.ЭтоУслугаАрендыКТК;
	    Прервать;
	КонецЦикла; 
	// Если это аренда КТК, то автоматическим разнесением занимается обработка "СборДанныхПоПредоставлениюКТК"
	Если ЭтоУслугаАрендыКТК Тогда
		//Возврат Неопределено;
		СтруктураРезультата.РезультатРазнесения = СтрШаблон("%1: разнесением услуг аренды КТК занимается обработка «СборДанныхПоПредоставлениюКТК». Авторазнесение отменено.", ПТУ);
		Возврат СтруктураРезультата;
	КонецЕсли;
	Если ТипЗнч(ПТУ) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
		РеквизитыКоррПТУ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПТУ, "ВидОперации, КорректироватьСуммыВПервичномВСФ");
	КонецЕсли;
	//Евросиб Каблов 22.08.2022 ( US55531
	Если ТипЗнч(ПТУ) = Тип("ДокументСсылка.КорректировкаПоступления")
		//Евросиб - АСуслов 02.12.2022 15:08:59 #Суслов+Гудкова корПТУ		//(61013
		И РеквизитыКоррПТУ.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
		//)
		//Евросиб - АСуслов 02.12.2022 15:09:10 #Суслов+Гудкова корПТУ 61013
		
		//Евросиб - АСуслов 02.12.2022 15:09:20 #Суслов + Гудкова КорПту 61013
		//(
		Если Не РеквизитыКоррПТУ.КорректироватьСуммыВПервичномВСФ Тогда
			//Возврат Неопределено;
			СтруктураРезультата.РезультатРазнесения = СтрШаблон("%1: попытка разнесения корректировки с видом операции «Согласованное изменение» и не установленным признаком «Корректировать суммы в первичном ВСФ». Авторазнесение отменено.", ПТУ);
			Возврат СтруктураРезультата;
		КонецЕсли;
		//)
		//Евросиб - АСуслов 02.12.2022 15:09:28 #Суслов + Гудкова КорПту
		
		НАкцепт = Документы.Акцепт.НайтиСоздатьАктуальныйАкцепт(ПТУ, Ложь);
		НАкцепт.Заполнить(ПТУ);
		
		ПредыдущийАкцепт = Документы.Акцепт.ПолучитьДанныеПоследнегоПроведенногоАкцепта(ПТУ).АкцептСсылка;
		Если ЗначениеЗаполнено(ПредыдущийАкцепт) Тогда
			АкцептИзменен = Не ОбщегоНазначения.КоллекцииИдентичны(ПредыдущийАкцепт.Услуги.выгрузить(), НАкцепт.Услуги.выгрузить(),, "НомерСтроки, ГУИД", Ложь);
		Иначе
			АкцептИзменен = Истина;
		КонецЕсли;
		
		Если АкцептИзменен Тогда
			
			Ошибка = Ложь;
			Попытка
				//Евросиб - АСуслов 15.08.2023 13:15:08 #59410
				//(
				НАкцепт.УстановитьКомментарийВерсииИсторииДанных("Авторазнесение по данным кор.пту");
				//)
				//Евросиб - АСуслов 15.08.2023 13:22:16 #59410
				Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НАкцепт.Поступление, "Проведен") Тогда
					НАкцепт.Записать(РежимЗаписиДокумента.Проведение);
				Иначе
					НАкцепт.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли; 
				ДЗ(ПТУ, НАкцепт.Ссылка,НЗ, "Акцепт отработан");
			Исключение
				Ошибка = Истина;
				ОО = ОписаниеОшибки();
				ДЗ(ПТУ, НАкцепт.Ссылка,НЗ, "Ошибка отработки акцепта: " + ОО);
			КонецПопытки;
			ЗаписатьПротоколАвторазнесенияПТУ(ПТУ, ПредыдущийАкцепт, ДатаНачалаРазнесенияПТУ, НовыйАлгоритм);
			
			ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, 1, ?(Ошибка, "ОшибкаЗаписиАкцепта", "АкцептЗаписан"));
			СтруктураРезультата.РезультатРазнесения = СтрШаблон("%1: Авторазнесение завершено. %2", ПТУ, ?(Ошибка, "Ошибка записи акцепта.", ""));
			
		Иначе
			
			ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, 1, "АкцептНеИзменён");
			СтруктураРезультата.РезультатРазнесения = СтрШаблон("%1: Авторазнесение завершено. Акцепт не изменён.", ПТУ);
	
		КонецЕсли;
		
		//Возврат Неопределено;
		Возврат СтруктураРезультата;
		
	КонецЕсли;
	//Евросиб Каблов 22.08.2022 )	
	
//Евросиб Гудкова( 05.02.2021 Ticket№ 0220495
	//НАкцепт = Документы.Акцепт.НайтиСоздатьАктуальныйАкцепт(ПТУ);
	//Если ЗначениеЗаполнено(НАкцепт) тогда
	//	НАкцепт = НАкцепт.ПолучитьОбъект();
	//Иначе
	//	Сообщить("Ошибка получения акцепта. Обратитесь к администратору.");
	//КонецЕсли;
	НАкцепт = Документы.Акцепт.НайтиСоздатьАктуальныйАкцепт(ПТУ, Ложь); 
	//Евросиб - АСуслов 08.11.2022 13:11:43 #60543
	//(
	ЗафиксироватьОтсутствиеПеревозки(НАкцепт);
	//)
	//Евросиб - АСуслов 08.11.2022 13:11:49 #60543
	//Евросиб - АСуслов 23.05.2022 12:12:12 #
	//(
	ВыполнитьАвторазнесениеАкцепта(НАкцепт);
	//)
	//Евросиб - АСуслов 23.05.2022 12:12:13 #
	//Евросиб - АСуслов 15.08.2023 13:55:25 #59410
	//(
//Евросиб Гудкова( 05.02.2021 Ticket№ 0220495
	РеквизитыПТУ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НАкцепт.Поступление, "ВалютаДокумента, ДатаВходящегоДокумента");
	ВалютаПТУ = РеквизитыПТУ.ВалютаДокумента;
	ДатаПТУ = РеквизитыПТУ.ДатаВходящегоДокумента;
	ПредыдущийАкцепт = Документы.Акцепт.ПолучитьДанныеПоследнегоПроведенногоАкцепта(ПТУ).АкцептСсылка;
//Евросиб Гудкова( 17.02.2022 Ticket№ 

// Евросиб Гудкова)
	//Евросиб - АСуслов 20.12.2022 21:27:46 #63258
	//(
	СписокПолейСравненияАкцепта = Константы.СписокПолейСравненияАкцепта.Получить();
	//ИзмененийНет = ОбщегоНазначения.КоллекцииИдентичны(ПредыдущийАкцепт.Услуги.выгрузить(), НАкцепт.Услуги.выгрузить(),,?(ДатаПТУ <Дата("20210101"),"ВидЗатрат",""), Истина);
	ИзмененийНет = ОбщегоНазначения.КоллекцииИдентичны(ПредыдущийАкцепт.Услуги.выгрузить(, СписокПолейСравненияАкцепта), НАкцепт.Услуги.выгрузить(, СписокПолейСравненияАкцепта), СписокПолейСравненияАкцепта,?(ДатаПТУ <Дата("20210101"),"ВидЗатрат",""), Истина);
	КомментарииВерсии = Новый Массив;
	Если ИзмененийНет = Ложь Тогда
		КомментарииВерсии.Добавить("новый алгоритм");
	КонецЕсли;
	//)
	//Евросиб - АСуслов 15.08.2023 13:55:33 #59410
// Евросиб Гудкова) 
	СписокУжеПривязанныхРасходов = Новый Массив;
	
	СписокКТКАкцепта = Новый Массив;
	СписокВагоновАкцепта = Новый Массив;
	ВсеКТКЗаполнены = Истина;
	ВсеВагоныЗаполнены = Истина;
	//Евросиб - АСуслов 12.05.2022 14:11:16 #51399
	//(                     
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&СписокНоменклатурыАкцепта)
	|	И НЕ Номенклатура.ИспользоватьВНовомАлгоритмеАвторазнесения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ИспользоватьВНовомАлгоритмеАвторазнесения";
	Запрос.УстановитьПараметр("СписокНоменклатурыАкцепта", НАкцепт.Услуги.ВыгрузитьКолонку("Номенклатура"));
	Пакеты = Запрос.ВыполнитьПакет();
	ТаблицаЛогирования = НАкцепт.Услуги.Выгрузить();
	ТаблицаЛогирования.Очистить();
	ТаблицаЛогирования.Колонки.Добавить("Отключена", Новый ОписаниеТипов("Булево"));
	ТаблицаЛогирования.Колонки.Добавить("Акцепт", Новый ОписаниеТипов("Строка"));
	УслугиДляНовогоАлгоритма = Неопределено;	
	Если Не Пакеты[0].Пустой() Тогда
	//)
	//Евросиб - АСуслов 23.05.2022 12:21:35 #
		УслугиДляНовогоАлгоритма = Пакеты[1].Выгрузить().ВыгрузитьКолонку("Номенклатура");
		//)
		//Евросиб - АСуслов 12.05.2022 14:11:24 #51399
		//Евросиб - АСуслов 19.08.2022 10:45:54 #55129
		//(
		ЕстьСтрокиДляРазнесения = Ложь;
		//)
		//Евросиб - АСуслов 19.08.2022 10:46:00 #55129
		Для каждого Стр из НАкцепт.Услуги Цикл     
			//Евросиб - АСуслов 12.05.2022 14:14:06 #51399
			//(
			Если НЕ УслугиДляНовогоАлгоритма.Найти(Стр.Номенклатура) = Неопределено Тогда
				Продолжить;	
			КонецЕсли;
			//)
			//Евросиб - АСуслов 12.05.2022 14:14:10 #51399
			
			// SIV 26-02-21
			Если СтрокиДляОтключения <> Неопределено Тогда 
				Если СтрокиДляОтключения.Найти(Стр.ИдентификаторСтрокиРасходовВСделке, "ИдентификаторСтрокиРасходовВСделке") = Неопределено Тогда
					Продолжить;
					//Иначе
					//	Документы.Акцепт.ОтвязатьСтрокуАкцептаОтСделки(Стр);
				КонецЕсли;
			КонецЕсли;
			Если ЗначениеЗаполнено(Стр.Сделка) 
				ИЛИ Стр.Неурег = Справочники.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ
				//Евросиб - АСуслов 08.11.2022 13:53:56 #60543
				//(
				ИЛИ Стр.Неурег = Справочники.ПричиныНеурегулированныхРасходов.НетСделки
				//)
				//Евросиб - АСуслов 08.11.2022 13:54:00 #60543
				//Евросиб - АСуслов 08.11.2022 13:53:56 #63097
				//(
				ИЛИ Стр.Неурег = Справочники.ПричиныНеурегулированныхРасходов.КоносаментНеПодобран
				//)
				//Евросиб - АСуслов 08.11.2022 13:54:00 #63097
				//Евросиб Каблов 02.12.2024 ( #94191
				Или Стр.Неурег = Справочники.ПричиныНеурегулированныхРасходов.НеЗаполненыОбязательныеПоляВАкцепте
				//Евросиб Каблов 02.12.2024 )
				ИЛИ (ЗначениеЗаполнено(Стр.ПричинаНеакцепта) И Стр.СтатусПричины <> Перечисления.СтатусыПричинНеакцепта.Откз) Тогда
				Продолжить; 
			КонецЕсли;
			Если РазнестиТолькоЗаполненныеКТКилиВагон = Истина 
				И НЕ ЗначениеЗаполнено(Стр.Контейнер)
				И НЕ ЗначениеЗаполнено(Стр.Вагон) Тогда
				Продолжить; 
			КонецЕсли;                       
			//Евросиб - АСуслов 19.08.2022 10:47:08 #55129
			//(
 			ЕстьСтрокиДляРазнесения = Истина;
			//)
			//Евросиб - АСуслов 19.08.2022 10:47:10 #55129
			
			Если ЗначениеЗаполнено(Стр.Контейнер) Тогда 
				СписокКТКАкцепта.Добавить(Стр.Контейнер);
			Иначе
				ВсеКТКЗаполнены = Ложь;
			КонецЕсли;
			Если ЗначениеЗаполнено(Стр.Вагон) Тогда 
				СписокВагоновАкцепта.Добавить(Стр.Вагон); 
				
			Иначе
				ВсеВагоныЗаполнены = Ложь;
			КонецЕсли;
		КонецЦикла;
	//Евросиб Каблов 02.08.2023 ( #64831
	//	Если НЕ ЕстьСтрокиДляРазнесения Тогда 
	////		ПредыдущийАкцепт = Документы.Акцепт.ПолучитьДанныеПоследнегоПроведенногоАкцепта(ПТУ).АкцептСсылка;
	////		ДЗ(ПТУ, ПредыдущийАкцепт, НЗ, "Нет строчек для разнесения");
	////		ЗаписатьПротоколАвторазнесенияПТУ(ПТУ, ПредыдущийАкцепт, ДатаНачалаРазнесенияПТУ, НовыйАлгоритм);
	//////Евросиб Гудкова( 07.12.2021 Ticket№ 42922
	////		ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, 1, "АкцептНеИзменён");
	////// Евросиб Гудкова)  
	//		СтруктураРезультата = ЗаписатьАвторазнесениеАкцепта(ПТУ, НАкцепт, НЗ, ДатаНачалаРазнесенияПТУ, ОписаниеЗамера, ТаблицаЛогирования);
	//		Для каждого СтрокаЛог Из ТаблицаЛогирования Цикл
	//			СтрокаЛог.Акцепт = Строка(Неопределено);
	//		КонецЦикла;
	//		//Возврат ТаблицаЛогирования;
	//		СтруктураРезультата.ТаблицаЛогирования = ТаблицаЛогирования;
	//		Возврат СтруктураРезультата;
	//	КонецЕсли;
	Если ЕстьСтрокиДляРазнесения Тогда
#Область СтарыйАлгоритмРазнесения
		//Евросиб Каблов 02.08.2023 ( #64831
		// Евросиб Гонтаренко 28.04.2021 #33906	
		// Чтобы без ИЛИ в условии запроса, в добавок к "В"
		Если ВсеКТКЗаполнены И СписокКТКАкцепта.Количество() > 0 Тогда
			СписокКТКАкцепта.Добавить(Справочники.ТЕ.ПустаяСсылка());
		КонецЕсли;
		Если ВсеВагоныЗаполнены И СписокВагоновАкцепта.Количество() > 0 Тогда
			СписокВагоновАкцепта.Добавить(Справочники.ТС.ПустаяСсылка()); 
		КонецЕсли;
		// Евросиб )Гонтаренко 28.04.2021 #33906	
		#Область Запрос
		Запрос = Новый Запрос;
		//Евросиб - АСуслов 18.08.2022 16:16:44 #55129
		//(
		
		Запрос.Текст = ПолучитьТекстЗапросаРазнесенияПТУ(Новый Структура("ОтборПоКТК, ОтборПоВагонам", ВсеКТКЗаполнены И СписокКТКАкцепта.Количество() > 0, ВсеВагоныЗаполнены И СписокВагоновАкцепта.Количество() > 0));
		//)
		//Евросиб - АСуслов 18.08.2022 16:16:46 #55129
		
		Запрос.УстановитьПараметр("КТКСписок", СписокКТКАкцепта);
		Запрос.УстановитьПараметр("ВагоныСписок", СписокВагоновАкцепта);
		Запрос.УстановитьПараметр("УслугаТерминальнаяОбработкаКУ", Справочники.Номенклатура.НайтиПоНаименованию("ТерминальнаяОбработкаКУ"));
		Запрос.УстановитьПараметр("ОграничитьСпискомСделок", ЗначениеЗаполнено(СтрокиДляОтключения));
		Запрос.УстановитьПараметр("СписокСделокДляОграничения", ?(ЗначениеЗаполнено(СтрокиДляОтключения), СтрокиДляОтключения.ВыгрузитьКолонку("Сделка"),Неопределено));
		#КонецОбласти 	
		
		МассивКомментариевКоторыеМожноЗаменять = Новый Массив;  
		МассивКомментариевКоторыеМожноЗаменять.Добавить("Не найдено плановых расходов с этой номенклатурой и КТК/Вагон/ЖДН");
		МассивКомментариевКоторыеМожноЗаменять.Добавить("Система не смогла подобрать плановые расходы. Требуется разнесение руками.");
		МассивКомментариевКоторыеМожноЗаменять.Добавить("Найдено несколько подходящих строк, требуется разнести руками");
		МассивКомментариевКоторыеМожноЗаменять.Добавить("Нельзя регистрировать охрану на не ценный груз");
		МассивКомментариевКоторыеМожноЗаменять.Добавить("Факт не может превышать план более чем на 100%");
		МассивКомментариевКоторыеМожноЗаменять.Добавить("В плановых расходах нет сочетания КТК + вагон или КТК + ЖДН.");
		МассивКомментариевКоторыеМожноЗаменять.Добавить("Невозможно сопоставить, вагон не в эксплуатации");
		МассивКомментариевКоторыеМожноЗаменять.Добавить("Невозможно сопоставить, собственность контейнера не заполнена");
		МассивКомментариевКоторыеМожноЗаменять.Добавить("Контейнер не найден в сделках!");
		МассивКомментариевКоторыеМожноЗаменять.Добавить("Невозможно сопоставить, если нет вагона, ктк и ждн");
		
		РеквизитыПТУ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НАкцепт.Поступление, "ВалютаДокумента, ДатаВходящегоДокумента");
		ВалютаПТУ = РеквизитыПТУ.ВалютаДокумента;
		ДатаПТУ = РеквизитыПТУ.ДатаВходящегоДокумента;
		
		Резы = Запрос.ВыполнитьПакет();
		// Евросиб (Гонтаренко 28.04.2021 #33906	
		УчЕдСделок = Резы[Резы.Количество()-2].Выгрузить();
		ОбрТЧ = Резы[Резы.Количество()-1].Выгрузить(); 
		Если УчЕдСделок.Количество() > 1000 Тогда
			УчЕдСделок.Индексы.Добавить("Сделка, Контейнер");
		КонецЕсли;
		// Евросиб )Гонтаренко 28.04.2021 #33906	
		
		ОбрТЧ_фильтр = ОбрТЧ.Скопировать();
		//ОбрТЧ.Скопировать(Новый Структура("Сделка", Документы.Сделка.НайтиПоНомеру("") ) )
		ТаблицаЛогирования = НАкцепт.Услуги.Выгрузить();
		ТаблицаЛогирования.Очистить();
		ТаблицаЛогирования.Колонки.Добавить("Отключена", Новый ОписаниеТипов("Булево"));
		ТаблицаЛогирования.Колонки.Добавить("Акцепт", Новый ОписаниеТипов("Строка"));
		
		//Субботин 75883 06.10.2023 начало
        ТаблицаДанныхДляОтвязкиАкцепта = Документы.Акцепт.СоставитьТЗДанныхДляОтвязкиАкцепта(НАкцепт.услуги);
		//Субботин 75883 06.10.2023 Конец 
		
		Для каждого Стр из НАкцепт.Услуги Цикл
			
			//Евросиб - АСуслов 12.05.2022 14:14:06 #51399
			//(
			Если НЕ УслугиДляНовогоАлгоритма.Найти(Стр.Номенклатура) = Неопределено Тогда
				Продолжить;	
			КонецЕсли;
			//)
			//Евросиб - АСуслов 12.05.2022 14:14:10 #51399
			Если РазнестиТолькоЗаполненныеКТКилиВагон = Истина И НЕ ЗначениеЗаполнено(Стр.Контейнер) И НЕ ЗначениеЗаполнено(Стр.Вагон) Тогда 
				//Евросиб Гудкова( 07.12.2021 Ticket№ 42922
				ОценкаПроизводительности.ЗафиксироватьЗамерДлительнойОперации(ОписаниеЗамера, 1, "СтрокаПропущена");
				// Евросиб Гудкова)
				Продолжить; 
			КонецЕсли;
			
			текИскКТ 	= Строка(Стр.Контейнер);
			текИскВаг 	= Строка(Стр.Вагон);
			текИскТрДок = ?(ЗначениеЗаполнено(Стр.ТранспортныйДокумент), Стр.ТранспортныйДокумент.НомерТранспортногоДокумента, "");
			ТолькоДляЦенногоГруза = Стр.Номенклатура.ТолькоДляЦенногоГруза;
			
			ОбрТЧ_фильтр.Очистить(); 
			Если ЗначениеЗаполнено(СтрокиДляОтключения) Тогда
				Если ЗначениеЗаполнено(Стр.ИдентификаторСтрокиРасходовВСделке) И СтрокиДляОтключения.Найти(Стр.ИдентификаторСтрокиРасходовВСделке, "ИдентификаторСтрокиРасходовВСделке") <> Неопределено Тогда
					СтрокаЛог = ТаблицаЛогирования.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаЛог, Стр); 
					СтрокаЛог.Акцепт = Строка(НАкцепт);
					СтрокаЛог.Отключена = Истина;
					СделкаДоПерепривязки = Стр.Сделка;
					Построитель = Новый ПостроительЗапроса;
					Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(обрТЧ);
					
					тОтбор = Построитель.Отбор.Добавить("Сделка");
					тОтбор.ВидСравнения = ВидСравнения.Равно;
					тОтбор.Значение = СделкаДоПерепривязки;
					тОтбор.Использование = Истина;
					Построитель.Выполнить();
					обрТЧ = Построитель.Результат.Выгрузить();
					
					Построитель = Новый ПостроительЗапроса;
					Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(УчЕдСделок);
					
					тОтбор = Построитель.Отбор.Добавить("Сделка");
					тОтбор.ВидСравнения = ВидСравнения.Равно;
					тОтбор.Значение = СделкаДоПерепривязки;
					тОтбор.Использование = Истина;
					Построитель.Выполнить();
					УчЕдСделок = Построитель.Результат.Выгрузить();
					Если УчЕдСделок.Количество() > 1000 Тогда
						УчЕдСделок.Индексы.Добавить("Сделка, Контейнер");
					КонецЕсли;
					//Стр.Сделка = Неопределено; 
					
					//Субботин 75883 06.10.2023 начало 					
					СтрокаТаблицыДанныхДляОтвязки = ТаблицаДанныхДляОтвязкиАкцепта.НайтиСтроки(Новый Структура("ГУИД", Стр.Гуид));
					//Было
					//	Документы.Акцепт.ОтвязатьСтрокуАкцептаОтСделки(Стр, НАкцепт, Неопределено);
					//Стало
					Документы.Акцепт.ОтвязатьСтрокуАкцептаОтСделки(СтрокаТаблицыДанныхДляОтвязки[0], НАкцепт, Неопределено);
					ЗаполнитьЗначенияСвойств(Стр, СтрокаТаблицыДанныхДляОтвязки[0]);
					//Субботин 75883 06.10.2023 Конец 
				Иначе 
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			Если ЗначениеЗаполнено(Стр.Сделка) 
				ИЛИ Стр.Неурег = Справочники.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ
				//Евросиб - АСуслов 08.11.2022 13:57:10 #60543
				//(
				ИЛИ Стр.Неурег = Справочники.ПричиныНеурегулированныхРасходов.НетСделки 
				//)
				//Евросиб - АСуслов 08.11.2022 13:57:10 #
				//Евросиб - АСуслов 08.11.2022 13:57:10 #63097
				//(
				ИЛИ Стр.Неурег = Справочники.ПричиныНеурегулированныхРасходов.КоносаментНеПодобран 
				//)
				//Евросиб - АСуслов 08.11.2022 13:57:10 #
				ИЛИ (ЗначениеЗаполнено(Стр.ПричинаНеакцепта) И Стр.СтатусПричины <> Перечисления.СтатусыПричинНеакцепта.Откз) Тогда 
				//Евросиб Гудкова( 07.12.2021 Ticket№ 42922
				ОценкаПроизводительности.ЗафиксироватьЗамерДлительнойОперации(ОписаниеЗамера, 1, "СтрокаПропущена");
				// Евросиб Гудкова)
				Продолжить; 
			КонецЕсли;
			
			РазрНоменклатура = НоменклатуруРазрешеноСопоставлятьС(Стр.Номенклатура, Стр.ВесПоНакладной);
			РазрНоменклатура.Добавить(Стр.Номенклатура);
			
			ИспользуетсяКТК = ЗначениеЗаполнено(Стр.Контейнер);
			ИспользуетсяВагон = ЗначениеЗаполнено(Стр.Вагон);
			ИспользуетсяТД = ЗначениеЗаполнено(Стр.ТранспортныйДокумент);
			
			////////////////////////////////////////////////////////////////////////////////////
			
			// 0 нулевая проверка - если ничего нет, то такую строчку невозможно акцептовать автоматически
			Если НЕ ИспользуетсяКТК И НЕ ИспользуетсяВагон И НЕ ИспользуетсяТД Тогда
				
				Если НЕ ЗначениеЗаполнено(Стр.НеурегКомментарий) ИЛИ МассивКомментариевКоторыеМожноЗаменять.Найти(Стр.НеурегКомментарий) <> неопределено Тогда Стр.НеурегКомментарий = "Невозможно сопоставить, если нет вагона, ктк и ждн"; КонецЕсли;
				Если НЕ Стр.Неурег.ЗапрещенаЗаменаПричиныНеакцептаПоСтроке Тогда
					Стр.Неурег = Справочники.ПричиныНеурегулированныхРасходов.Прочее;
					//Евросиб Гудкова( 07.12.2021 Ticket№ 42922
					ОценкаПроизводительности.ЗафиксироватьЗамерДлительнойОперации(ОписаниеЗамера, 1, "СтрокаНеакцептована");
					// Евросиб Гудкова)
					Продолжить;
				КонецЕсли;
				
			КонецЕсли;
			
			// 0 еще одна нулевая проверка на то, что контейнера нет в сделках вообще
			Если ИспользуетсяКТК и УчЕдСделок.НайтиСтроки(Новый Структура("Контейнер", Стр.Контейнер)).Количество() = 0  Тогда
				
				Если НЕ ЗначениеЗаполнено(Стр.НеурегКомментарий) ИЛИ МассивКомментариевКоторыеМожноЗаменять.Найти(Стр.НеурегКомментарий) <> неопределено Тогда Стр.НеурегКомментарий = "Контейнер не найден в сделках!"; КонецЕсли;
				Если НЕ Стр.Неурег.ЗапрещенаЗаменаПричиныНеакцептаПоСтроке Тогда
					Стр.Неурег = Справочники.ПричиныНеурегулированныхРасходов.КонтейнерНеНайденВСделках;
					//Евросиб Гудкова( 07.12.2021 Ticket№ 42922
					ОценкаПроизводительности.ЗафиксироватьЗамерДлительнойОперации(ОписаниеЗамера, 1, "СтрокаНеакцептована");
					// Евросиб Гудкова)
					Продолжить;
				КонецЕсли;
				
			КонецЕсли;
			
			// 1 неизвестный контейнер или вагон
			Если ИспользуетсяКТК И КТКНеизвестен(Стр.Контейнер) Тогда
				Если НЕ ЗначениеЗаполнено(Стр.НеурегКомментарий) ИЛИ МассивКомментариевКоторыеМожноЗаменять.Найти(Стр.НеурегКомментарий) <> неопределено Тогда Стр.НеурегКомментарий = "Невозможно сопоставить, собственность контейнера не заполнена"; КонецЕсли;
				Если НЕ Стр.Неурег.ЗапрещенаЗаменаПричиныНеакцептаПоСтроке Тогда
					Стр.Неурег = Справочники.ПричиныНеурегулированныхРасходов.КонтейнерНеизвестен;
					//Евросиб Гудкова( 07.12.2021 Ticket№ 42922
					ОценкаПроизводительности.ЗафиксироватьЗамерДлительнойОперации(ОписаниеЗамера, 1, "СтрокаНеакцептована");
					// Евросиб Гудкова)
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			Если ИспользуетсяВагон И ВагонНеизвестен(Стр.Вагон) Тогда
				Если НЕ ЗначениеЗаполнено(Стр.НеурегКомментарий) ИЛИ МассивКомментариевКоторыеМожноЗаменять.Найти(Стр.НеурегКомментарий) <> неопределено Тогда Стр.НеурегКомментарий = "Невозможно сопоставить, вагон не в эксплуатации"; КонецЕсли;
				Если НЕ Стр.Неурег.ЗапрещенаЗаменаПричиныНеакцептаПоСтроке Тогда
					Стр.Неурег = Справочники.ПричиныНеурегулированныхРасходов.ВагонНеизвестен;
					//Евросиб Гудкова( 07.12.2021 Ticket№ 42922
					ОценкаПроизводительности.ЗафиксироватьЗамерДлительнойОперации(ОписаниеЗамера, 1, "СтрокаНеакцептована");
					// Евросиб Гудкова)
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			
			//Евросиб - АСуслов 28.11.2021 15:17:35 #42886
			//( 
			// 2 заполнена ЖДН и ее нет в сделках
			
			// SIV 04-12-20 вообще, если бы подсыльные накладные были в расходах, то эта проверка бы сработала. Но поскольку не сложилось, то я ее пока пропущу. Потом можно раскомментировать, когда расходы будут формироваться нормально.
			//раскоментировал
			Если ИспользуетсяТД И НЕ ТДНайденВРасходах(Стр.ТранспортныйДокумент, ОбрТЧ) Тогда
				Если НЕ ЗначениеЗаполнено(Стр.НеурегКомментарий) Тогда Стр.НеурегКомментарий = "Невозможно сопоставить, ЖДН не фигурирует в плановых расходах"; КонецЕсли;
				Если НЕ Стр.Неурег.ЗапрещенаЗаменаПричиныНеакцептаПоСтроке Тогда
					Стр.Неурег = Справочники.ПричиныНеурегулированныхРасходов.ЖДННеизвестна;
					//Евросиб Гудкова( 07.12.2021 Ticket№ 42922
					ОценкаПроизводительности.ЗафиксироватьЗамерДлительнойОперации(ОписаниеЗамера, 1, "СтрокаНеакцептована");
					// Евросиб Гудкова)
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			//)
			//Евросиб - АСуслов 28.11.2021 15:17:37 #42886
			
			////////////////////////////////////////////////////////////////////////////////////
			
			Проверка_КТК_И_ВАГОН_Найдена = Ложь;
			Проверка_КТК_И_ЖДН_Найдена = Ложь;
			
			Проверка_НайденаПодходящаяСтрочкаКТКВАГОНЖДН = Ложь;
			//Проверка_ВПОДХОДЯЩЕЙСТРОКЕ_НУЖНАЯ_НОМЕНКЛАТУРА = Ложь;
			
			Проверка_ПОПОДХОДЯЩЕЙНОМЕНКЛАТУРЕ_БОЛЬШАЯРАЗНИЦАВСУММЕ = Ложь;
			
			Проверка_ОхранаНаНеценныйГруз = Ложь;
			
			ФАКТ_НЕ_МОЖЕТ_ПРЕВЫШАТЬ_ПЛАН_НА_ПРОЦЕНТОВ = 100;
			
			Для каждого СтрТЧ из ОбрТЧ Цикл
				
				//Если ЗначениеЗаполнено(текИскКТ) И Найти(СтрТЧ.СписокКТК, текИскКТ) = 0 Тогда Продолжить; КонецЕсли; // SIV 04-12-20
				//Если ЗначениеЗаполнено(текИскВаг) И Найти(СтрТЧ.СписокВагонов, текИскВаг) = 0 Тогда Продолжить; КонецЕсли; // SIV 07-12-20
				Если ЗначениеЗаполнено(текИскКТ) И текИскКТ <> Строка(СтрТЧ.Контейнер) Тогда Продолжить; КонецЕсли; // SIV 04-12-20
				Если ЗначениеЗаполнено(текИскВаг) И текИскВаг <> Строка(СтрТЧ.Вагон) Тогда Продолжить; КонецЕсли; // SIV 07-12-20
				Если ЗначениеЗаполнено(Стр.УказаннаяПользователемСделка) И СтрТЧ.Сделка <> Стр.УказаннаяПользователемСделка Тогда Продолжить; КонецЕсли; // SIV 01-03-21
				СуммаРасходаВВалютеПТУ = 0;
				Если СтрТЧ.СуммаИтого > 0 Тогда
					СуммаРасходаВВалютеПТУ = РаботаСКурсамиВалют.ПересчитатьВВалюту(СтрТЧ.СуммаИтого, СтрТЧ.Валюта, ВалютаПТУ, ДатаПТУ);
				КонецЕсли;
				// Шейко О.Е. 30.10.2020. Добавил условия для ускорения поиска:
				Если ЗначениеЗаполнено(текИскКТ) Тогда
					//Если СтрТЧ.СписокКТК = "" Тогда
					Если НЕ ЗначениеЗаполнено(СтрТЧ.Контейнер) Тогда
						ЗдесьКТКНайден = Ложь;
					Иначе
						//ЗдесьКТКНайден = Найти(СтрТЧ.СписокКТК, текИскКТ) <> 0;  // изн поиск
						ЗдесьКТКНайден = текИскКТ = Строка(СтрТЧ.Контейнер);  // изн поиск
					КонецЕсли;
				Иначе
					ЗдесьКТКНайден = Истина;
				КонецЕсли; 
				Если ЗначениеЗаполнено(текИскВаг) Тогда
					//Если СтрТЧ.СписокВагонов = "" Тогда
					Если НЕ ЗначениеЗаполнено(СтрТЧ.Контейнер) Тогда
						ЗдесьВагонНайден = Ложь;
					Иначе
						//ЗдесьВагонНайден = Найти(СтрТЧ.СписокВагонов, текИскВаг) <> 0;  // изн поиск
						ЗдесьВагонНайден = текИскВаг = Строка(СтрТЧ.Вагон);  // изн поиск
					КонецЕсли;
				Иначе
					ЗдесьВагонНайден = Истина;
				КонецЕсли;
				
				НакладнаяВстречается = НакладнаяВстречаетсяВСделке(текИскТрДок, СтрТЧ.Сделка, неопределено, Стр.Контейнер); // Шейко О.Е. 30.10.2020. Оптимизация
				
				Если ИспользуетсяКТК И ИспользуетсяВагон И ЗдесьКТКНайден И ЗдесьВагонНайден Тогда
					Проверка_КТК_И_ВАГОН_Найдена = Истина;
				КонецЕсли;
				
				Если ИспользуетсяКТК И ИспользуетсяТД И ЗдесьКТКНайден И НакладнаяВстречается Тогда
					Проверка_КТК_И_ЖДН_Найдена = Истина;
				КонецЕсли;
				
				Если (ИспользуетсяКТК И ЗдесьКТКНайден ИЛИ НЕ ИспользуетсяКТК) И 
					(ИспользуетсяВагон И ЗдесьВагонНайден ИЛИ НЕ ИспользуетсяВагон) И
					(ИспользуетсяТД И НакладнаяВстречается ИЛИ НЕ ИспользуетсяТД) Тогда
					
					Проверка_НайденаПодходящаяСтрочкаКТКВАГОНЖДН = Истина;
					
					//Евросиб - АСуслов 03.11.2022 14:02:46 #60133
					//(
					//Если РазрНоменклатура.Найти(СтрТЧ.Услуга) <> неопределено И (СуммаРасходаВВалютеПТУ > 0 И СтрТЧ.Количество > 0 И Стр.ПоступлениеЦена > 0) И (Стр.ПоступлениеЦена/СуммаРасходаВВалютеПТУ/СтрТЧ.Количество*100 > 200 ИЛИ Стр.ПоступлениеЦена/СуммаРасходаВВалютеПТУ/СтрТЧ.Количество*100 < 50)  Тогда
					//	Проверка_ПОПОДХОДЯЩЕЙНОМЕНКЛАТУРЕ_БОЛЬШАЯРАЗНИЦАВСУММЕ = Истина;
					//КонецЕсли;
					//)
					//Евросиб - АСуслов 03.11.2022 14:02:48 #60133
					
					Если НЕ СтрТЧ.Груз.ЦенныйГруз И Стр.Номенклатура.ТолькоДляЦенногоГруза Тогда
						Проверка_ОхранаНаНеценныйГруз = Истина;
					КонецЕсли;
					
				КонецЕсли;
				
				// далее формируем таблицу подходящих плановых услуг
				
				ВсеПроверкиПройдены = Истина;
				Если (ИспользуетсяКТК И НЕ ЗдесьКТКНайден) 
					Или (ИспользуетсяВагон И НЕ ЗдесьВагонНайден) 
					Или (ИспользуетсяТД И НЕ НакладнаяВстречается) 
					Или РазрНоменклатура.Найти(СтрТЧ.Услуга) = Неопределено 
					Или (ЗначениеЗаполнено(СтрТЧ.Поставщик) И ПТУ.Контрагент <> СтрТЧ.Поставщик)
					Или (НЕ СтрТЧ.Груз_Ценный И ТолькоДляЦенногоГруза) 
					//Евросиб - АСуслов 03.11.2022 14:43:32 #60133
					//Или ((СуммаРасходаВВалютеПТУ > 0 И СтрТЧ.Количество > 0 И Стр.ПоступлениеЦена > 0)
					//(
					//И (Стр.ПоступлениеЦена / СуммаРасходаВВалютеПТУ / СтрТЧ.Количество * 100 > 200 
					//ИЛИ Стр.ПоступлениеЦена / СуммаРасходаВВалютеПТУ / СтрТЧ.Количество * 100 < 50))  
					//)
					//Евросиб - АСуслов 03.11.2022 14:43:43 #60133
					Тогда
					// Евросиб )Гонтаренко 28.04.2021 #33906	
					ВсеПроверкиПройдены = Ложь;
				КонецЕсли;
				
				Если ВсеПроверкиПройдены И ЗначениеЗаполнено(Стр.СтанцияОтправления) Тогда
					// Евросиб )Гонтаренко 28.04.2021 #33906	
					
					АналогиСтОтпр = Локации_сервер.ПолучитьАналогиИСтанцииБлижеЧемУказано(Стр.СтанцияОтправления, -1);
					АналогиСтОтпр.Добавить(Стр.СтанцияОтправления);
					
					МасПод = Локации_сервер.ПолучитьМассивПодчиненных(Стр.СтанцияОтправления, Ложь);
					Для каждого СтрМП из МасПод Цикл
						АналогиСтОтпр.Добавить(СтрМП);
					КонецЦикла;
					
					Если АналогиСтОтпр.Найти(СтрТЧ.Сделка.СтанцияОтправления) = Неопределено
						И АналогиСтОтпр.Найти(СтрТЧ.Сделка.ПогранпереходИзСтраныОтправления) = Неопределено
						И АналогиСтОтпр.Найти(СтрТЧ.ПунктОтправления) = Неопределено Тогда
						ВсеПроверкиПройдены = Ложь;
					КонецЕсли;
					
				КонецЕсли;
				
				Если ВсеПроверкиПройдены И ЗначениеЗаполнено(Стр.СтанцияНазначения) Тогда
					// Евросиб )Гонтаренко 28.04.2021 #33906	
					
					АналогиСтОтпр = Локации_сервер.ПолучитьАналогиИСтанцииБлижеЧемУказано(Стр.СтанцияНазначения, -1);
					АналогиСтОтпр.Добавить(Стр.СтанцияНазначения);
					
					МасПод = Локации_сервер.ПолучитьМассивПодчиненных(Стр.СтанцияНазначения, Ложь);
					Для каждого СтрМП из МасПод Цикл
						АналогиСтОтпр.Добавить(СтрМП);
					КонецЦикла;
					
					Если АналогиСтОтпр.Найти(СтрТЧ.Сделка.СтанцияНазначения) = Неопределено
						И АналогиСтОтпр.Найти(СтрТЧ.Сделка.ПогранпереходВСтрануНазначения) = Неопределено
						И АналогиСтОтпр.Найти(СтрТЧ.ПунктНазначения) = неопределено Тогда
						ВсеПроверкиПройдены = Ложь;
					КонецЕсли;
					
				КонецЕсли;
				
				Если ВсеПроверкиПройдены Тогда
					ЗаполнитьЗначенияСвойств(ОбрТЧ_фильтр.Добавить(), СтрТЧ);
				КонецЕсли;
				
			КонецЦикла;
			
			// 3 Нет соответствия Контейнер + вагон или Контейнер + Накладная
			Если ОбрТЧ_фильтр.Количество() = 0 И ИспользуетсяКТК И (ИспользуетсяВагон ИЛИ ИспользуетсяТД) И НЕ Проверка_КТК_И_ВАГОН_Найдена И НЕ Проверка_КТК_И_ЖДН_Найдена Тогда
				Если НЕ ЗначениеЗаполнено(Стр.НеурегКомментарий) ИЛИ МассивКомментариевКоторыеМожноЗаменять.Найти(Стр.НеурегКомментарий) <> неопределено Тогда Стр.НеурегКомментарий = "В плановых расходах нет сочетания КТК + вагон или КТК + ЖДН."; КонецЕсли;
				Если НЕ Стр.Неурег.ЗапрещенаЗаменаПричиныНеакцептаПоСтроке Тогда
					Стр.Неурег = Справочники.ПричиныНеурегулированныхРасходов.НеНайденоСочетаниеПолей;
					//Евросиб Гудкова( 07.12.2021 Ticket№ 42922
					ОценкаПроизводительности.ЗафиксироватьЗамерДлительнойОперации(ОписаниеЗамера, 1, "СтрокаНеакцептована");
					// Евросиб Гудкова)
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			// 4 Несовпадение по номенклатуре 
			//Если ОбрТЧ_фильтр.Количество() = 0 И Проверка_НайденаПодходящаяСтрочкаКТКВАГОНЖДН И НЕ Проверка_ВПОДХОДЯЩЕЙСТРОКЕ_НУЖНАЯ_НОМЕНКЛАТУРА Тогда
			//	Если НЕ ЗначениеЗаполнено(Стр.НеурегКомментарий) Тогда Стр.НеурегКомментарий = "Не найдено плановых расходов с этой номенклатурой и КТК/Вагон/ЖДН"; КонецЕсли;
			//	Если НЕ Стр.Неурег.ЗапрещенаЗаменаПричиныНеакцептаПоСтроке Тогда
			//		Стр.Неурег = Справочники.ПричиныНеурегулированныхРасходов.ДругаяНоменклатура;
			//		Продолжить;
			//	КонецЕсли;
			//КонецЕсли;
			
			//Евросиб - АСуслов 01.11.2022 12:23:50 #60133
			//(    
			//отключаем проверку
			// 5 Факт превышает план в несколько раз
			//Если ОбрТЧ_фильтр.Количество() = 0 И Проверка_ПОПОДХОДЯЩЕЙНОМЕНКЛАТУРЕ_БОЛЬШАЯРАЗНИЦАВСУММЕ Тогда
			//	Если НЕ ЗначениеЗаполнено(Стр.НеурегКомментарий) ИЛИ МассивКомментариевКоторыеМожноЗаменять.Найти(Стр.НеурегКомментарий) <> неопределено Тогда Стр.НеурегКомментарий = "Факт не может превышать план более чем на 100%"; КонецЕсли;
			//	Если НЕ Стр.Неурег.ЗапрещенаЗаменаПричиныНеакцептаПоСтроке Тогда
			//		Стр.Неурег = Справочники.ПричиныНеурегулированныхРасходов.ФактПревышаетПланВНесколькоРаз;
			//		//Евросиб Гудкова( 07.12.2021 Ticket№ 42922
			//		ОценкаПроизводительности.ЗафиксироватьЗамерДлительнойОперации(ОписаниеЗамера, 1, "СтрокаНеакцептована");
			//		// Евросиб Гудкова)
			//		Продолжить;
			//	КонецЕсли;
			//КонецЕсли;
			//)
			//Евросиб - АСуслов 01.11.2022 12:23:53 #60133
			
			// 6 попытка выставить охрану на неценный груз
			Если ОбрТЧ_фильтр.Количество() = 0 И Проверка_ОхранаНаНеценныйГруз Тогда
				Если НЕ ЗначениеЗаполнено(Стр.НеурегКомментарий) ИЛИ МассивКомментариевКоторыеМожноЗаменять.Найти(Стр.НеурегКомментарий) <> неопределено Тогда Стр.НеурегКомментарий = "Нельзя регистрировать охрану на не ценный груз"; КонецЕсли;
				Если НЕ Стр.Неурег.ЗапрещенаЗаменаПричиныНеакцептаПоСтроке Тогда
					Стр.Неурег = Справочники.ПричиныНеурегулированныхРасходов.ОхранаДляНеЦенногоГруза;
					//Евросиб Гудкова( 07.12.2021 Ticket№ 42922
					ОценкаПроизводительности.ЗафиксироватьЗамерДлительнойОперации(ОписаниеЗамера, 1, "СтрокаНеакцептована");
					// Евросиб Гудкова)
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			// --> SIV 15-04-21 Доработка, позволяющая из Охраны и УсиленнойОхраны выбрать ту строчку номенклатуры, которая ближе к искомой строке о сумме
			
			Если Стр.Номенклатура.РазрешитьАвтоакцептНаАналоги Тогда
				ОбрТЧ2 = ОбрТЧ_фильтр.Скопировать(, "Услуга, Валюта, СуммаИтого");
				ОбрТЧ2.Колонки.Добавить("КолВо", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10, 2)));
				Для каждого Стррр из ОбрТЧ2 Цикл
					Стррр.КолВо = 1;
				КонецЦикла;
				ОбрТЧ2.Свернуть("Услуга, Валюта", "КолВо, СуммаИтого");
				ВсяТаблицаВПорядке = Истина;
				Для каждого Стррр из ОбрТЧ2 Цикл
					ВсяТаблицаВПорядке = ВсяТаблицаВПорядке И Стррр.КолВо = 1;
				КонецЦикла;
				Если ВсяТаблицаВПорядке Тогда
					
					ОбрТЧ2.Колонки.Добавить("МераОтклонения", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10, 2)));
					
					Для каждого СтрТЧ3 из ОбрТЧ2 Цикл
						
						СуммаРасходаВВалютеПТУ = РаботаСКурсамиВалют.ПересчитатьВВалюту(СтрТЧ3.СуммаИтого, СтрТЧ3.Валюта, ВалютаПТУ, ДатаПТУ);
						
						СтрТЧ3.МераОтклонения = СуммаРасходаВВалютеПТУ - Стр.ПоступлениеСумма;
						Если СтрТЧ3.МераОтклонения < 0 Тогда СтрТЧ3.МераОтклонения = -СтрТЧ3.МераОтклонения; КонецЕсли;
						
					КонецЦикла;
					
					ОбрТЧ2.Сортировать("МераОтклонения Возр");
					
					МассУдСтрок = Новый Массив;
					Для каждого Стр7878 из ОбрТЧ_фильтр Цикл
						Если Стр7878.Услуга <> ОбрТЧ2[0].Услуга Тогда
							МассУдСтрок.Добавить(Стр7878);
						КонецЕсли;
					КонецЦикла;
					Для каждого Стр998 из МассУдСтрок Цикл
						ОбрТЧ_фильтр.Удалить(Стр998);
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
			
			// <--
			
			// 6 найдено более 1 подходящей строки
			Если ОбрТЧ_фильтр.Количество() > 1 Тогда
				Если НЕ ЗначениеЗаполнено(Стр.НеурегКомментарий) ИЛИ МассивКомментариевКоторыеМожноЗаменять.Найти(Стр.НеурегКомментарий) <> неопределено Тогда Стр.НеурегКомментарий = "Найдено несколько подходящих строк, требуется разнести руками"; КонецЕсли;
				Если НЕ Стр.Неурег.ЗапрещенаЗаменаПричиныНеакцептаПоСтроке Тогда
					Стр.Неурег = Справочники.ПричиныНеурегулированныхРасходов.НесколькоСтатейРасходов;
					//Евросиб Гудкова( 07.12.2021 Ticket№ 42922
					ОценкаПроизводительности.ЗафиксироватьЗамерДлительнойОперации(ОписаниеЗамера, 1, "СтрокаНеакцептована");
					// Евросиб Гудкова)
					Продолжить;
				КонецЕсли;
				
			ИначеЕсли ОбрТЧ_фильтр.Количество() = 1 Тогда
				
				СписокУжеПривязанныхРасходов.Добавить(ОбрТЧ_фильтр[0].ГУИДРасходов);
				
				Стр.ИдентификаторСтрокиРасходовВСделке = ОбрТЧ_фильтр[0].ГУИДРасходов;
				Стр.Сделка = ОбрТЧ_фильтр[0].Сделка;
				Стр.ПолностьюРазнесено = Истина;
				//Евросиб - АСуслов 29.08.2022 14:20:47 #56528
				//(
				Стр.ПричинаОтключенияСтрокиВСделке = Неопределено;
				//)
				//Евросиб - АСуслов 29.08.2022 14:20:51 #56528
				Если НЕ Стр.Неурег.ЗапрещенаЗаменаПричиныНеакцептаПоСтроке Тогда
					Стр.Неурег = неопределено;
				КонецЕсли;
				СтрокаЛог = ТаблицаЛогирования.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаЛог, Стр); 
				СтрокаЛог.Акцепт = Строка(НАкцепт);
				
				
				//Евросиб Гудкова( 07.12.2021 Ticket№ 42922
				ОценкаПроизводительности.ЗафиксироватьЗамерДлительнойОперации(ОписаниеЗамера, 1, "СтрокаАкцептована");
				// Евросиб Гудкова)
			Иначе
				
				// 7 ничего не получилось, "прочая" причина
				Если НЕ ЗначениеЗаполнено(Стр.НеурегКомментарий) ИЛИ МассивКомментариевКоторыеМожноЗаменять.Найти(Стр.НеурегКомментарий) <> неопределено Тогда Стр.НеурегКомментарий = "Система не смогла подобрать плановые расходы. Требуется разнесение руками."; КонецЕсли;
				Если НЕ Стр.Неурег.ЗапрещенаЗаменаПричиныНеакцептаПоСтроке Тогда
					Стр.Неурег = Справочники.ПричиныНеурегулированныхРасходов.Прочее;
					//Евросиб Гудкова( 07.12.2021 Ticket№ 42922
					ОценкаПроизводительности.ЗафиксироватьЗамерДлительнойОперации(ОписаниеЗамера, 1, "СтрокаНеакцептована");
					// Евросиб Гудкова)
					Продолжить;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ОбработатьСтрокиПодчиненныхУслуг(НАкцепт, СтрокиДляОтключения, ОписаниеЗамера);
		
	//Евросиб Каблов 02.08.2023 ( #64831
#КонецОбласти
	КонецЕсли;
	//Евросиб Каблов 02.08.2023
		
	КонецЕсли;
	//)
	//Евросиб - АСуслов 23.05.2022 12:21:07 #
	// - SIV 22-12-2020
	Для Каждого ТекСтрокаУслуги Из НАкцепт.Услуги Цикл
		Если ЗначениеЗаполнено(ТекСтрокаУслуги.Сделка) Тогда
			ТекСтрокаУслуги.Сумма = ТекСтрокаУслуги.ПоступлениеСумма;
			ТекСтрокаУслуги.СуммаНДС = ТекСтрокаУслуги.ПоступлениеСуммаНДС;
		КонецЕсли;
	КонецЦикла;
	НАкцепт.СуммаАкцепта = НАкцепт.Услуги.Итог("Сумма");
	
	//Евросиб Каблов 02.08.2023 ( #64831
	ИзмененныеСделки = Новый Массив;
	ВыполнитьАвторазнесениеАкцептаНаПрямые(НАкцепт, ИзмененныеСделки);
	
	НачатьТранзакцию();
	
	Для Каждого СделкаОбъект Из ИзмененныеСделки Цикл
		СделкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	//Евросиб Каблов 02.08.2023 )
	
	ПериодВОАкцепта = Мин(НАкцепт.ПериодВО, НАкцепт.ПериодБУ);
	ДополнитьСтрокиАкцептовДаннымиСделки(НАкцепт,Истина,ПериодВОАкцепта);
	
//Евросиб Гудкова( 05.02.2021 Ticket№ 0220495
	//ПредыдущийАкцепт = Документы.Акцепт.ПолучитьДанныеПоследнегоПроведенногоАкцепта(ПТУ).АкцептСсылка;
//Евросиб Гудкова( 17.02.2022 Ticket№ 

// Евросиб Гудкова)
	//Евросиб - АСуслов 20.12.2022 21:27:46 #63258
	//(
	//СписокПолейСравненияАкцепта = Константы.СписокПолейСравненияАкцепта.Получить();
	//ИзмененийНет = ОбщегоНазначения.КоллекцииИдентичны(ПредыдущийАкцепт.Услуги.выгрузить(), НАкцепт.Услуги.выгрузить(),,?(ДатаПТУ <Дата("20210101"),"ВидЗатрат",""), Истина);
	Если НЕ УслугиДляНовогоАлгоритма = Неопределено Тогда
		МассивСтрокПредыдущегоАкцепта = Новый Массив;
		МассивСтрокТекущегоАкцепта = Новый Массив;
		Для каждого СтрокаУслуга Из ПредыдущийАкцепт.Услуги Цикл
			Если НЕ УслугиДляНовогоАлгоритма.Найти(СтрокаУслуга.Номенклатура) = Неопределено Тогда
				Продолжить;	
			КонецЕсли;
			МассивСтрокПредыдущегоАкцепта.Добавить(СтрокаУслуга);
		КонецЦикла;
		Для каждого СтрокаУслуга Из НАкцепт.Услуги Цикл
			Если НЕ УслугиДляНовогоАлгоритма.Найти(СтрокаУслуга.Номенклатура) = Неопределено Тогда
				Продолжить;	
			КонецЕсли;
			МассивСтрокТекущегоАкцепта.Добавить(СтрокаУслуга);
		КонецЦикла;
		ИзмененийНет = ОбщегоНазначения.КоллекцииИдентичны(ПредыдущийАкцепт.Услуги.выгрузить(МассивСтрокПредыдущегоАкцепта, СписокПолейСравненияАкцепта), НАкцепт.Услуги.выгрузить(МассивСтрокТекущегоАкцепта, СписокПолейСравненияАкцепта), СписокПолейСравненияАкцепта,?(ДатаПТУ <Дата("20210101"),"ВидЗатрат",""), Истина);
		Если ИзмененийНет = Ложь Тогда
			КомментарииВерсии.Добавить("старый алгоритм");
		КонецЕсли;
	КонецЕсли;
	ИзмененийНет = ОбщегоНазначения.КоллекцииИдентичны(ПредыдущийАкцепт.Услуги.выгрузить(, СписокПолейСравненияАкцепта), НАкцепт.Услуги.выгрузить(, СписокПолейСравненияАкцепта), СписокПолейСравненияАкцепта,?(ДатаПТУ <Дата("20210101"),"ВидЗатрат",""), Истина);
	//)
	//Евросиб - АСуслов 20.12.2022 21:27:48 #63258
	Если ИзмененийНет Тогда
		
		//Евросиб Каблов 02.08.2023 ( #64831
		ОтменитьТранзакцию();
		//Евросиб Каблов 02.08.2023 )
		
		ДЗ(ПТУ, ПредыдущийАкцепт, НЗ, "Акцепт отработан");
		ЗаписатьПротоколАвторазнесенияПТУ(ПТУ, ПредыдущийАкцепт, ДатаНачалаРазнесенияПТУ, НовыйАлгоритм);
//Евросиб Гудкова( 07.12.2021 Ticket№ 42922
		ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, 1, "АкцептНеИзменён"); 
		СтруктураРезультата.РезультатРазнесения = СтрШаблон("%1: Авторазнесение завершено. Акцепт не изменён.", ПТУ);
// Евросиб Гудкова)       
		Для каждого СтрокаЛог Из ТаблицаЛогирования Цикл
			СтрокаЛог.Акцепт = Строка(ПредыдущийАкцепт);
		КонецЦикла;
		//Возврат ТаблицаЛогирования;
		СтруктураРезультата.ТаблицаЛогирования = ТаблицаЛогирования;
		Возврат СтруктураРезультата;
	КонецЕсли;
	Ошибка = Ложь;
//Евросиб Гудкова)

	Попытка
		
		//НАкцепт.УстановитьКомментарийВерсииИсторииДанных(СтрШаблон("Авторазнесение %1", ?(НовыйАлгоритм, "(новый алгоритм)", "старый алгоритм")));
		НАкцепт.УстановитьКомментарийВерсииИсторииДанных(СтрШаблон("Авторазнесение %1", СтрСоединить(КомментарииВерсии, " и ")));
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НАкцепт.Поступление, "Проведен") Тогда
			НАкцепт.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			НАкцепт.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли; 
		ДЗ(ПТУ, НАкцепт.Ссылка,НЗ, "Акцепт отработан");
		СтруктураРезультата.РезультатРазнесения = СтрШаблон("%1: Авторазнесение завершено.", ПТУ);
		
		//Евросиб Каблов 02.08.2023 ( #64831
		ЗафиксироватьТранзакцию();
		//Евросиб Каблов 02.08.2023 )
	
	Исключение
		Ошибка = Истина;
		ОО = ОписаниеОшибки();
		
		//Евросиб Каблов 02.08.2023 ( #64831
		ОтменитьТранзакцию();
		//Евросиб Каблов 02.08.2023 )
		
		ДЗ(ПТУ, НАкцепт.Ссылка,НЗ, "Ошибка отработки акцепта: " + ОО);
		СтруктураРезультата.РезультатРазнесения = СтрШаблон("%1: Авторазнесение завершено. Ошибка отработки акцепта: %2.", ПТУ, ОО);
	КонецПопытки;
	ЗаписатьПротоколАвторазнесенияПТУ(ПТУ, ПредыдущийАкцепт, ДатаНачалаРазнесенияПТУ, НовыйАлгоритм);
//Евросиб Гудкова( 07.12.2021 Ticket№ 42922
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, 1, ?(Ошибка, "ОшибкаЗаписиАкцепта", "АкцептЗаписан"));
// Евросиб Гудкова) 
	Для каждого СтрокаЛог Из ТаблицаЛогирования Цикл
		СтрокаЛог.Акцепт = Строка(НАкцепт);
	КонецЦикла;
	//Возврат ТаблицаЛогирования;
	СтруктураРезультата.ТаблицаЛогирования = ТаблицаЛогирования;
	Возврат СтруктураРезультата;
	
КонецФункции

Процедура ОбработатьСтрокиПодчиненныхУслуг(НАкцепт, СтрокиДляОтключения, ОписаниеЗамера)
		// + SIV 22-12-2020 доп. обработчик пустых строк данного акцепта, чтобы привязать возможные подчиненные строки к родительским
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	*
		|ИЗ
		|	РегистрСведений.ПодчиненныеУслугиНоменклатуры КАК ПодчиненныеУслугиНоменклатуры";
		ПодчУслуги = Запрос.Выполнить().Выгрузить();
		ПодчУслуги.Индексы.Добавить("ПодчиненнаяУслуга");
		
		//Евросиб Каблов 12.11.2021 ( Ticket#0250063
		//ПромежуточнаяОднократнаяЗапись = Ложь;
		//Евросиб Каблов 12.11.2021 )
		
		Для каждого Стр из НАкцепт.Услуги Цикл
			//Евросиб - АСуслов 12.05.2022 14:14:06 #51399
			//(
			//Если НЕ УслугиДляНовогоАлгоритма.Найти(Стр.Номенклатура) = Неопределено Тогда
			//	Продолжить;	
			//КонецЕсли;
			//)
			//Евросиб - АСуслов 12.05.2022 14:14:10 #51399
			Если ЗначениеЗаполнено(СтрокиДляОтключения) Тогда
				Прервать;
			КонецЕсли;
			Если 
				// Евросиб (Гонтаренко 28.04.2021 #33906	
				//	ЗначениеЗаполнено(Стр.Сделка) 
				//	ИЛИ 
				Стр.Неурег = Справочники.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ 
				//Евросиб - АСуслов 28.09.2022 11:15:31 #
				//(
				ИЛИ Стр.ИдентификаторСтрокиРасходовВСделке <> ""
				//)
				//Евросиб - АСуслов 28.09.2022 11:15:31 # 
				//Евросиб - АСуслов 08.11.2022 13:53:02 #60543
				//(
				ИЛИ Стр.Неурег = Справочники.ПричиныНеурегулированныхРасходов.НетСделки 
				//)
				//Евросиб - АСуслов 08.11.2022 13:53:02 #
				//Евросиб - АСуслов 08.11.2022 13:53:02 #63097
				//(
				ИЛИ Стр.Неурег = Справочники.ПричиныНеурегулированныхРасходов.КоносаментНеПодобран 
				//)
				//Евросиб - АСуслов 08.11.2022 13:53:02 #63097
				//ИЛИ (ЗначениеЗаполнено(Стр.ПричинаНеакцепта) 
				//И (Стр.СтатусПричины <> Перечисления.СтатусыПричинНеакцепта.Откз) 
				Тогда 
				Продолжить;
			КонецЕсли;
			// Евросиб )Гонтаренко 28.04.2021 #33906	
			НайдСтроки = ПодчУслуги.НайтиСтроки(Новый Структура("ПодчиненнаяУслуга", Стр.Номенклатура));
			
			Для каждого СтрПравило из НайдСтроки Цикл
				
				//Евросиб Каблов 12.11.2021 ( Ticket#0250063
				//Если ПромежуточнаяОднократнаяЗапись = Ложь Тогда 
				//	НАкцепт.Записать();
				//	ПромежуточнаяОднократнаяЗапись = Истина;
				//КонецЕсли;
				//Евросиб Каблов 12.11.2021 )
				
				НайдСтрока = НайтиУникальнуюСтрокуПоСовпадениюПараметров(Стр, НАкцепт, СтрПравило.ОсновнаяУслуга, СтрПравило.СовпадениеПоставщика, СтрПравило.СовпадениеПТУ, СтрПравило.СовпадениеКТК, СтрПравило.СовпадениеВагона, СтрПравило.СовпадениеТД, СтрПравило.СовпадениеДатыДнейОт, СтрПравило.СовпадениеДатыДнейДо);
				Если НайдСтрока <> неопределено Тогда
					
					Стр.ИдентификаторСтрокиРасходовВСделке = НайдСтрока.ГУИДРасходов;
					Стр.Сделка = НайдСтрока.Сделка;
					
					Стр.ПодчиненнаяУслуга_АкцептОсновнойУслуги = НайдСтрока.Акцепт;
					Стр.ПодчиненнаяУслуга_ГУИДСтрокиОснУслуги = НайдСтрока.ИдентификаторСтрокиАкцепта;
					Если НЕ Стр.Неурег.ЗапрещенаЗаменаПричиныНеакцептаПоСтроке Тогда
						Стр.Неурег = неопределено;
						Стр.НеурегКомментарий = "";
					КонецЕсли;
					//Евросиб Гудкова( 07.12.2021 Ticket№ 42922
					ОценкаПроизводительности.ЗафиксироватьЗамерДлительнойОперации(ОписаниеЗамера, 1, "ПодчиненнаяСтрокаАкцептована");
					// Евросиб Гудкова)
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		//Евросиб - АСуслов 23.05.2022 12:21:06 #
		//(
		
КонецПроцедуры


//Евросиб - АСуслов 18.08.2022 16:18:59 #55129
//(
Функция ПолучитьТекстЗапросаРазнесенияПТУ(Параметры)
	ИспользоватьРегистрРазнесениеРасходовДляРазнесенияАкцептов = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьРегистрРазнесениеРасходовДляРазнесенияАкцептов");
	Если ИспользоватьРегистрРазнесениеРасходовДляРазнесенияАкцептов Тогда
		Возврат ПолучитьТекстЗапросаРазнесенияПТУ_РегистрРазнесениеРасходов(Параметры);
	Иначе
		Возврат ПолучитьТекстЗапросаРазнесенияПТУ_РегистрРазнесениеЗатратПТУ(Параметры);
	КонецЕсли;
КонецФункции

Функция ПолучитьТекстЗапросаРазнесенияПТУ_РегистрРазнесениеЗатратПТУ(Параметры)
	Возврат 
		?(Параметры.ОтборПоВагонам, "
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		СделкаСвязьУчетныхЕдиниц.Ссылка КАК Ссылка
		| 	ПОМЕСТИТЬ ВТ_СделкиВагоны
		|	ИЗ
		|		Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		|	ГДЕ
		|	СделкаСвязьУчетныхЕдиниц.Вагон В (&ВагоныСписок)
		|;", "") + 
		
		"ВЫБРАТЬ
		|	РазнесениеЗатратПТУОстатки.Сделка КАК Сделка,
		|	РазнесениеЗатратПТУОстатки.ГУИДРасходов КАК ГУИДРасходов,
		|	РазнесениеЗатратПТУОстатки.ПодлежащаяРазнесениюОстаток КАК НеРазнесено,
		|	СделкаРасходы.Поставщик КАК Поставщик,
		|	СделкаРасходы.Договор КАК Договор,
		|	СделкаРасходы.Услуга КАК Услуга,
		|	СделкаРасходы.Количество КАК Количество,
		|	СделкаРасходы.СуммаИтого КАК СуммаИтого,
		|	СделкаРасходы.СуммаНДС КАК СуммаНДС,
		|	СделкаРасходы.Груз КАК Груз,
		|	СделкаРасходы.Операция КАК Операция,
		|	СделкаРасходы.Контейнер КАК Контейнер,
		|	СделкаРасходы.Вагон КАК Вагон,
		|	СделкаРасходы.ТранспортныйДокумент КАК ТранспортныйДокумент,
		|	СделкаРасходы.Валюта КАК Валюта,
		|	СделкаРасходы.ПунктОтправления КАК ПунктОтправления,
		|	СделкаРасходы.ПунктНазначения КАК ПунктНазначения
		|ПОМЕСТИТЬ ВыхДан1
		|ИЗ
		|   РегистрНакопления.РазнесениеЗатратПТУ.Остатки "  
		+ ?(Параметры.ОтборПоВагонам, "
		|		(, Сделка В (ВЫБРАТЬ Ссылка ИЗ ВТ_СделкиВагоны)) ", "") + " КАК РазнесениеЗатратПТУОстатки	               
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы
		|		ПО РазнесениеЗатратПТУОстатки.Сделка = СделкаРасходы.Ссылка
		|			И РазнесениеЗатратПТУОстатки.ГУИДРасходов = СделкаРасходы.ГУИД
		|			И НЕ СделкаРасходы.ВнутренняяСебестоимость 
		|   			И НЕ СделкаРасходы.УслугаОтключена
		|ГДЕ
		|	РазнесениеЗатратПТУОстатки.ПолностьюРазнесеноОстаток <> 0
		//Евросиб Каблов 28.03.2022 ( Ticket#0257875
		|	И СделкаРасходы.ИсточникПоявленияСтрокиЭкономики <> ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта)
		//Евросиб Каблов 28.03.2022 )
		|    И ВЫБОР КОГДА &ОграничитьСпискомСделок  ТОГДА РазнесениеЗатратПТУОстатки.Сделка В (&СписокСделокДляОграничения) ИНАЧЕ ИСТИНА КОНЕЦ " 
		+ ?(Параметры.ОтборПоКТК , "И РазнесениеЗатратПТУОстатки.КТК В (&КТКСписок)
		|	", "") 
		+ "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыхДан1.Сделка КАК Сделка
		|ПОМЕСТИТЬ СписокСделок
		|ИЗ
		|	ВыхДан1 КАК ВыхДан1
		|ГДЕ ВЫБОР КОГДА &ОграничитьСпискомСделок  ТОГДА ВыхДан1.Сделка В (&СписокСделокДляОграничения) ИНАЧЕ ИСТИНА КОНЕЦ 
		|СГРУППИРОВАТЬ ПО
		|	ВыхДан1.Сделка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		| ВЫБРАТЬ
		|	МИНИМУМ(СделкаРейсы.Рейс.ДатаОтправления) КАК РейсДатаОтправления,
		|	МАКСИМУМ(СделкаРейсы.Рейс.ДатаПрибытия) КАК РейсДатаПрибытия,
		|	СделкаРейсы.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ СрокиРейсыЖД
		|ИЗ
		|	Документ.Сделка.Рейсы КАК СделкаРейсы
		|ГДЕ
		|	СделкаРейсы.Ссылка В (ВЫБРАТЬ 
		|						СписокСделок.Сделка 
		|						ИЗ СписокСделок КАК СписокСделок)
		|	И ТИПЗНАЧЕНИЯ(СделкаРейсы.Рейс) = ТИП(Справочник.РейсыЖД)
		|
		|СГРУППИРОВАТЬ ПО
		|	СделкаРейсы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СделкаРасходы.Ссылка КАК Сделка,                                      
		|    СделкаРасходы.ТранспортныйДокумент КАК НомерЖДН,
		|    СделкаРасходы.Контейнер КАК Контейнер
		|ИЗ 
		|	Документ.Сделка.Расходы КАК СделкаРасходы
		|ГДЕ
		|	СделкаРасходы.Ссылка В (ВЫБРАТЬ т.Сделка ИЗ СписокСделок как Т)
		| 	И СделкаРасходы.УслугаОтключена = Ложь
		|    И ВЫБОР КОГДА &ОграничитьСпискомСделок ТОГДА  СделкаРасходы.Ссылка В (&СписокСделокДляОграничения) ИНАЧЕ ИСТИНА КОНЕЦ
		// ++ ДИТ Поморцева Т.П. Задача 34197 19.04.22.
		|Сгруппировать По
		|СделкаРасходы.Ссылка,                                      
		|СделкаРасходы.ТранспортныйДокумент,
		|СделкаРасходы.Контейнер
		// -- ДИТ Поморцева Т.П. Задача 34197 19.04.22.
		|;
		//Евросиб - АСуслов 28.11.2021 14:50:40 #42886
		//(
		//|	СделкаСвязьУчетныхЕдиниц.НомерЖДН КАК НомерЖДН,
		//|	СделкаСвязьУчетныхЕдиниц.НомерВагоннойЖДН КАК НомерВагоннойЖДН,
		//|	СделкаСвязьУчетныхЕдиниц.НомерПорожнейЖДНКТК КАК НомерПорожнейЖДНКТК,
		//|	СделкаСвязьУчетныхЕдиниц.НомерПорожнейВагоннойЖДН КАК НомерПорожнейВагоннойЖДН,
		//|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер
		//|ИЗ
		//|	СписокСделок КАК СписокСделок
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		//|		ПО СписокСделок.Сделка = СделкаСвязьУчетныхЕдиниц.Ссылка
		//|;
		//)
		//Евросиб - АСуслов 28.11.2021 14:50:44 #42886
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыхДан1.Сделка КАК Сделка,
		|	ВыхДан1.ГУИДРасходов КАК ГУИДРасходов,
		|	ВыхДан1.НеРазнесено КАК НеРазнесено,
		|	ВыхДан1.Поставщик КАК Поставщик,
		|	ВыхДан1.Договор КАК Договор,
		|	ВыхДан1.Услуга КАК Услуга,
		|	ВыхДан1.Количество КАК Количество,
		|	ВыхДан1.СуммаИтого КАК СуммаИтого,
		|	ВыхДан1.СуммаНДС КАК СуммаНДС,
		|	ВыхДан1.Груз КАК Груз,
		|	ВЫБОР
		|		КОГДА ВыхДан1.Груз ЕСТЬ NULL
		|				ИЛИ ВыхДан1.Груз = ЗНАЧЕНИЕ(Справочник.Грузы.ПустаяСсылка)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ВыхДан1.Груз.ЦенныйГруз
		|	КОНЕЦ КАК Груз_Ценный,
		|	ВыхДан1.Операция КАК Операция,
		//|	ВыхДан1.СписокКТК КАК СписокКТК,
		//|	ВыхДан1.СписокТД КАК СписокТД,
		//|	ВыхДан1.СписокВагонов КАК СписокВагонов,
		//|	ВыхДан1.ДоходыСделкиУчДокумент КАК ДоходыСделкиУчДокумент,
		|	СрокиРейсыЖД.РейсДатаОтправления КАК ОтправлениеРейса,
		|	СрокиРейсыЖД.РейсДатаПрибытия КАК ПрибытиеРейса,
		|	ВыхДан1.Валюта КАК Валюта,
		|	ВыхДан1.Контейнер КАК Контейнер,
		|	ВыхДан1.Вагон КАК Вагон,
		|	ВыхДан1.ТранспортныйДокумент КАК ТранспортныйДокумент,
		|	ВыхДан1.ПунктОтправления КАК ПунктОтправления,
		|	ВыхДан1.ПунктНазначения КАК ПунктНазначения
		|ИЗ
		|	ВыхДан1 КАК ВыхДан1
		|		ЛЕВОЕ СОЕДИНЕНИЕ СрокиРейсыЖД как СрокиРейсыЖД
		|		ПО ВыхДан1.Сделка = СрокиРейсыЖД.Ссылка";

КонецФункции

Функция ПолучитьТекстЗапросаРазнесенияПТУ_РегистрРазнесениеРасходов(Параметры)
	ТекстЗапроса =  
	"ВЫБРАТЬ
	|	РазнесениеРасходовОстатки.Сделка КАК Сделка,
	|	РазнесениеРасходовОстатки.ГУИДРасходов КАК ГУИДРасходов,
	|	СделкаРасходы.Поставщик КАК Поставщик,
	|	СделкаРасходы.Договор КАК Договор,
	|	СделкаРасходы.Услуга КАК Услуга,
	|	СделкаРасходы.Количество КАК Количество,
	|	СделкаРасходы.СуммаИтого КАК СуммаИтого,
	|	СделкаРасходы.СуммаНДС КАК СуммаНДС,
	|	СделкаРасходы.Груз КАК Груз,
	|	СделкаРасходы.Операция КАК Операция,
	|	СделкаРасходы.Контейнер КАК Контейнер,
	|	СделкаРасходы.Вагон КАК Вагон,
	|	СделкаРасходы.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	СделкаРасходы.Валюта КАК Валюта,
	|	СделкаРасходы.ПунктОтправления КАК ПунктОтправления,
	|	СделкаРасходы.ПунктНазначения КАК ПунктНазначения
	|ПОМЕСТИТЬ ВыхДан1
	|ИЗ
	|	РегистрНакопления.РазнесениеРасходов.Остатки КАК РазнесениеРасходовОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы
	|		ПО РазнесениеРасходовОстатки.Сделка = СделкаРасходы.Ссылка
	|			И РазнесениеРасходовОстатки.ГУИДРасходов = СделкаРасходы.ГУИД
	|ГДЕ
	|	ИСТИНА
	|	И &ОтборПоКТК
	|	И &ОтборПоВагонам
	|	И РазнесениеРасходовОстатки.НеРазнесеноОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыхДан1.Сделка КАК Сделка
	|ПОМЕСТИТЬ СписокСделок
	|ИЗ
	|	ВыхДан1 КАК ВыхДан1
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОграничитьСпискомСделок
	|				ТОГДА ВыхДан1.Сделка В (&СписокСделокДляОграничения)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыхДан1.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(СделкаРейсы.Рейс.ДатаОтправления) КАК РейсДатаОтправления,
	|	МАКСИМУМ(СделкаРейсы.Рейс.ДатаПрибытия) КАК РейсДатаПрибытия,
	|	СделкаРейсы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СрокиРейсыЖД
	|ИЗ
	|	Документ.Сделка.Рейсы КАК СделкаРейсы
	|ГДЕ
	|	СделкаРейсы.Ссылка В
	|			(ВЫБРАТЬ
	|				СписокСделок.Сделка
	|			ИЗ
	|				СписокСделок КАК СписокСделок)
	|	И ТИПЗНАЧЕНИЯ(СделкаРейсы.Рейс) = ТИП(Справочник.РейсыЖД)
	|
	|СГРУППИРОВАТЬ ПО
	|	СделкаРейсы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаРасходы.Ссылка КАК Сделка,
	|	СделкаРасходы.ТранспортныйДокумент КАК НомерЖДН,
	|	СделкаРасходы.Контейнер КАК Контейнер
	|ИЗ
	|	Документ.Сделка.Расходы КАК СделкаРасходы
	|ГДЕ
	|	СделкаРасходы.Ссылка В
	|			(ВЫБРАТЬ
	|				Т.Сделка
	|			ИЗ
	|				СписокСделок КАК Т)
	|	И СделкаРасходы.УслугаОтключена = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА &ОграничитьСпискомСделок
	|				ТОГДА СделкаРасходы.Ссылка В (&СписокСделокДляОграничения)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	СделкаРасходы.Ссылка,
	|	СделкаРасходы.ТранспортныйДокумент,
	|	СделкаРасходы.Контейнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыхДан1.Сделка КАК Сделка,
	|	ВыхДан1.ГУИДРасходов КАК ГУИДРасходов,
	|	ВыхДан1.Поставщик КАК Поставщик,
	|	ВыхДан1.Договор КАК Договор,
	|	ВыхДан1.Услуга КАК Услуга,
	|	ВыхДан1.Количество КАК Количество,
	|	ВыхДан1.СуммаИтого КАК СуммаИтого,
	|	ВыхДан1.СуммаНДС КАК СуммаНДС,
	|	ВыхДан1.Груз КАК Груз,
	|	ВЫБОР
	|		КОГДА ВыхДан1.Груз ЕСТЬ NULL
	|				ИЛИ ВыхДан1.Груз = ЗНАЧЕНИЕ(Справочник.Грузы.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ВыхДан1.Груз.ЦенныйГруз
	|	КОНЕЦ КАК Груз_Ценный,
	|	ВыхДан1.Операция КАК Операция,
	|	СрокиРейсыЖД.РейсДатаОтправления КАК ОтправлениеРейса,
	|	СрокиРейсыЖД.РейсДатаПрибытия КАК ПрибытиеРейса,
	|	ВыхДан1.Валюта КАК Валюта,
	|	ВыхДан1.Контейнер КАК Контейнер,
	|	ВыхДан1.Вагон КАК Вагон,
	|	ВыхДан1.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	ВыхДан1.ПунктОтправления КАК ПунктОтправления,
	|	ВыхДан1.ПунктНазначения КАК ПунктНазначения
	|ИЗ
	|	ВыхДан1 КАК ВыхДан1
	|		ЛЕВОЕ СОЕДИНЕНИЕ СрокиРейсыЖД КАК СрокиРейсыЖД
	|		ПО ВыхДан1.Сделка = СрокиРейсыЖД.Ссылка";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &ОтборПоКТК", 		?(Параметры.ОтборПоКТК,		"И СделкаРасходы.Контейнер В (&КТКСписок)", ""));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &ОтборПоВагонам", 	?(Параметры.ОтборПоВагонам,	"И СделкаРасходы.Вагон В (&ВагоныСписок)", 	""));
	Возврат ТекстЗапроса;
	
КонецФункции
//)
//Евросиб - АСуслов 18.08.2022 16:19:01 #55129

Функция РазнестиПТУНовыйАлгоритм(ПТУ, РазнестиТолькоЗаполненныеКТКилиВагон = Ложь, СтрокиДляОтключения = Неопределено, РежимБитыеСсылки = Ложь) Экспорт
	
	СтруктураРезультата = Новый Структура("РезультатРазнесения, ТаблицаЛогирования");
	//Строки для отключения это таблица значений из колонок "гуид расходов", "сделка"
	//если она заполнена, то по этому списку происходит перепривязка расходов в рамках этой же сделки
//Евросиб Гудкова( 06.12.2021 Ticket№ 42922
	ОписаниеЗамера = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("АвторазнесениеСервер");
// Евросиб Гудкова)
	НЗ = 0;
	ДЗ(ПТУ,,НЗ, "=== Начало авторазнесения для ПТУ");
	СтатусРазнесения = Документы.Акцепт.ПолучитьДанныеПоследнегоПроведенногоАкцепта(ПТУ).СтатусРазнесения;
	ЗаписьДанныхОчередиАвторазнесения(ПТУ, Истина, СтатусРазнесения, ТекущаяДата());
	Если ТипЗнч(ПТУ) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
		Если СтатусРазнесения = Перечисления.СостоянияАвторазнесения.АкцептНеСоздан Тогда
			СтруктураРезультата.РезультатРазнесения = СтрШаблон("%1: по документу нет проведенного акцепта. Авторазнесение отменено.", ПТУ);
			Возврат СтруктураРезультата;
		КонецЕсли;
		Если ПТУ.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение")
			И Не ПТУ.КорректироватьСуммыВПервичномВСФ Тогда
			СтруктураРезультата.РезультатРазнесения = СтрШаблон("%1: Корректировочный ВСФ необходимо разносить вручную. Авторазнесение отменено.", ПТУ);
			Возврат СтруктураРезультата;
		КонецЕсли;
		//Евросиб Каблов 17.01.2024 ( #79488
		РеквизитыПТУ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПТУ, "Штраф");
		Если РеквизитыПТУ.Штраф Тогда
			СтруктураРезультата.РезультатРазнесения = СтрШаблон("%1: к авторазнесению не принимаются документы с признаком «Штраф». Авторазнесение отменено.", ПТУ);		
			Возврат СтруктураРезультата;
		КонецЕсли;
	Иначе
		РеквизитыПТУ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПТУ, "Штраф, Претензия");
		Если РеквизитыПТУ.Штраф Тогда
			СтруктураРезультата.РезультатРазнесения = СтрШаблон("%1: к авторазнесению не принимаются документы с признаком «Штраф». Авторазнесение отменено.", ПТУ);		
			Возврат СтруктураРезультата;
		ИначеЕсли РеквизитыПТУ.Претензия Тогда
			СтруктураРезультата.РезультатРазнесения = СтрШаблон("%1: к авторазнесению не принимаются документы с признаком «Претензия». Авторазнесение отменено.", ПТУ);		
			Возврат СтруктураРезультата;
		КонецЕсли;
		//Евросиб Каблов 17.01.2024 )
	КонецЕсли;
	Если СтатусРазнесения = Перечисления.СостоянияАвторазнесения.НетАктуальногоАкцепта
				ИЛИ СтатусРазнесения = Перечисления.СостоянияАвторазнесения.ПолностьюРазнесено Тогда
		СтруктураРезультата.РезультатРазнесения = СтрШаблон("%1: к авторазнесению не принимаются документы в состоянии «Полностью разнесено» или «Нет актуального акцепта». Текущее состояние документа: «%2». Авторазнесение отменено.", ПТУ, СтатусРазнесения);		
		Возврат СтруктураРезультата;
	КонецЕсли;
	ДатаНачалаРазнесенияПТУ = ТекущаяДата();
	//ЗаписьДанныхОчередиАвторазнесения(ПТУ, Истина, СтатусРазнесения, ТекущаяДата());
	
	НАкцепт = Документы.Акцепт.НайтиСоздатьАктуальныйАкцепт(ПТУ, Ложь);
	ТаблицаЛогирования = НАкцепт.Услуги.Выгрузить();
	ТаблицаЛогирования.Очистить();
	ТаблицаЛогирования.Колонки.Добавить("Отключена", Новый ОписаниеТипов("Булево"));
	ТаблицаЛогирования.Колонки.Добавить("Акцепт", Новый ОписаниеТипов("Строка"));
	ЗафиксироватьОтсутствиеПеревозки(НАкцепт);
	ВыполнитьАвторазнесениеАкцепта(НАкцепт, РежимБитыеСсылки);
	ОбработатьСтрокиПодчиненныхУслуг(НАкцепт, СтрокиДляОтключения, ОписаниеЗамера);
	
	//Евросиб Каблов 02.08.2023 ( #64831
	ИзмененныеСделки = Новый Массив;
	ВыполнитьАвторазнесениеАкцептаНаПрямые(НАкцепт, ИзмененныеСделки);
	
	НачатьТранзакцию();
	
	Для Каждого СделкаОбъект Из ИзмененныеСделки Цикл
		СделкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	//Евросиб Каблов 02.08.2023 )
	
	СтруктураРезультата = ЗаписатьАвторазнесениеАкцепта(ПТУ, НАкцепт, НЗ, ДатаНачалаРазнесенияПТУ, ОписаниеЗамера, ТаблицаЛогирования);
	Для каждого СтрокаЛог Из ТаблицаЛогирования Цикл
		СтрокаЛог.Акцепт = Строка(НАкцепт);
	КонецЦикла;
	
	Возврат СтруктураРезультата;
	
КонецФункции

Функция НайтиУникальнуюСтрокуПоСовпадениюПараметров(ТекСтрока, ТекущийАкцепт, ОсновнаяУслуга, СовпадениеПоставщика, СовпадениеПТУ, СовпадениеКТК, СовпадениеВагона, СовпадениеТД, СовпадениеДатыДнейОт, СовпадениеДатыДнейДо)
	
	Результат = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АктуальныеАкцепты.Поступление КАК Поступление,
	|	АктуальныеАкцепты.Акцепт КАК Акцепт
	|ПОМЕСТИТЬ ВТАктуальныеАкцепты
	|ИЗ
	//|	Документ.Акцепт КАК Акцепт
	|	РегистрСведений.АктуальныеАкцепты КАК АктуальныеАкцепты
	|ГДЕ
	//|	Акцепт.Проведен
	//|	И Акцепт.СторнируемыйАкцепт = ЗНАЧЕНИЕ(Документ.Акцепт.ПустаяСсылка)
	//|	И НЕ Акцепт.Ссылка В
	//|				(ВЫБРАТЬ
	//|					Акцепт.СторнируемыйАкцепт КАК СторнируемыйАкцепт
	//|				ИЗ
	//|					Документ.Акцепт КАК Акцепт
	//|				ГДЕ
	//|					Акцепт.Проведен) 
	|   НЕ АктуальныеАкцепты.Акцепт = &ТекущийАкцепт
	|	И АктуальныеАкцепты.Поступление.ДатаВходящегоДокумента МЕЖДУ &ДатаОт И &ДатаДо
	|	И &ОтборПоПТУ
	|	И &ОтборПоПоставщику
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АкцептУслуги.Номенклатура КАК Номенклатура,
	|	АкцептУслуги.Сделка КАК Сделка,
	|	АкцептУслуги.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке,
	|	&ТекущийАкцепт КАК Акцепт,
	|	АкцептУслуги.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
	|	АкцептУслуги.ГУИД КАК ИдентификаторСтрокиАкцепта
	|ПОМЕСТИТЬ ВТ_ТекущийАкцепт
	|ИЗ
	|	&ДокументАкцептУслуги КАК АкцептУслуги
	|ГДЕ
	|	АкцептУслуги.Номенклатура = &Номенклатура
	|	И &ОтборПоКТК
	|	И &ОтборПоВагону
	|	И &ОтборПоТД
	|	И АкцептУслуги.ПоступлениеЦена > 0
	|	И НЕ АкцептУслуги.ИдентификаторСтрокиРасходовВСделке = """"
	|	И АкцептУслуги.ИдентификаторСтрокиПоступления <> &ИдентификаторСтрокиПоступления
	//Евросиб - АСуслов 11.10.2022 12:25:40 #
	//(
	|   И АкцептУслуги.ПодчиненнаяУслуга_ГУИДСтрокиОснУслуги = """"
	//)
	//Евросиб - АСуслов 11.10.2022 12:25:42 #
	|	И АкцептУслуги.Неурег <> ЗНАЧЕНИЕ(Справочник.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ)
	//Евросиб - АСуслов 08.11.2022 13:53:56 #60543
	//(
	|	И АкцептУслуги.Неурег <> ЗНАЧЕНИЕ(Справочник.ПричиныНеурегулированныхРасходов.НетСделки)
	//)
	//Евросиб - АСуслов 08.11.2022 13:54:00 #60543
	//Евросиб - АСуслов 18.01.2023 17:38:37 #63097
	//(
	|	И АкцептУслуги.Неурег <> ЗНАЧЕНИЕ(Справочник.ПричиныНеурегулированныхРасходов.КоносаментНеПодобран)
	//)
	//Евросиб - АСуслов 18.01.2023 17:38:37 #63097
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АкцептУслуги.Номенклатура КАК Номенклатура,
	|	АкцептУслуги.Сделка КАК Сделка,
	|	АкцептУслуги.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке,
	|	АкцептУслуги.Ссылка КАК Акцепт,
	|	АкцептУслуги.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
	|	АкцептУслуги.ГУИД КАК ИдентификаторСтрокиАкцепта
	|ИЗ
	|	Документ.Акцепт.Услуги КАК АкцептУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Акцепт КАК АкцептСторно
	|		ПО АкцептУслуги.Ссылка = АкцептСторно.СторнируемыйАкцепт
	|			И (АкцептСторно.Проведен)
	|ГДЕ
	|	АкцептУслуги.Номенклатура = &Номенклатура
	|	И &ОтборПоКТК
	|	И &ОтборПоВагону
	|	И &ОтборПоТД
	|	И АкцептУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				т.Акцепт
	|			ИЗ
	|				ВТАктуальныеАкцепты КАК т)
	|	И АкцептУслуги.ПоступлениеЦена > 0
	|	И НЕ АкцептУслуги.ИдентификаторСтрокиРасходовВСделке = """"
	|	И АкцептУслуги.ИдентификаторСтрокиПоступления <> &ИдентификаторСтрокиПоступления
	//Евросиб - АСуслов 11.10.2022 12:25:40 #
	//(
	|   И АкцептУслуги.ПодчиненнаяУслуга_ГУИДСтрокиОснУслуги = """"
	//)
	//Евросиб - АСуслов 11.10.2022 12:25:42 #
	|	И АкцептУслуги.Неурег <> ЗНАЧЕНИЕ(Справочник.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ)
	//Евросиб - АСуслов 08.11.2022 13:53:56 #60543
	//(
	|	И АкцептУслуги.Неурег <> ЗНАЧЕНИЕ(Справочник.ПричиныНеурегулированныхРасходов.НетСделки)
	//)
	//Евросиб - АСуслов 08.11.2022 13:54:00 #60543
	//Евросиб - АСуслов 18.01.2023 17:38:37 #63097
	//(
	|	И АкцептУслуги.Неурег <> ЗНАЧЕНИЕ(Справочник.ПричиныНеурегулированныхРасходов.КоносаментНеПодобран)
	//)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТекущийАкцепт.Номенклатура,
	|	ВТ_ТекущийАкцепт.Сделка,
	|	ВТ_ТекущийАкцепт.ИдентификаторСтрокиРасходовВСделке,
	|	ВТ_ТекущийАкцепт.Акцепт,
	|	ВТ_ТекущийАкцепт.ИдентификаторСтрокиПоступления,
	|	ВТ_ТекущийАкцепт.ИдентификаторСтрокиАкцепта
	|ИЗ
	|	ВТ_ТекущийАкцепт КАК ВТ_ТекущийАкцепт";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ОтборПоПТУ", 			?(СовпадениеПТУ, 		"И АктуальныеАкцепты.Поступление = &ПТУ", 					""));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ОтборПоПоставщику", 	?(СовпадениеПоставщика, "И АктуальныеАкцепты.Поступление.Контрагент = &Поставщик",	""));
 	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ОтборПоКТК", 			?(СовпадениеКТК, 		"И АкцептУслуги.Контейнер = &КТК", 				""));
 	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ОтборПоВагону", 		?(СовпадениеВагона, 	"И АкцептУслуги.Вагон = &Вагон", 				""));
 	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ОтборПоТД", 			?(СовпадениеТД, 		"И АкцептУслуги.ТранспортныйДокумент = &ТД", 	""));

	Запрос.УстановитьПараметр("ИдентификаторСтрокиПоступления", ТекСтрока.ИдентификаторСтрокиПоступления);
	Запрос.УстановитьПараметр("Номенклатура", ОсновнаяУслуга);
	Запрос.УстановитьПараметр("КТК", ТекСтрока.Контейнер);
	Запрос.УстановитьПараметр("Вагон", ТекСтрока.Вагон);
	Запрос.УстановитьПараметр("ТД", ТекСтрока.ТранспортныйДокумент);
	Запрос.УстановитьПараметр("ТекущийАкцепт", ТекущийАкцепт.Ссылка); 
	Запрос.УстановитьПараметр("ДокументАкцептУслуги", ТекущийАкцепт.Услуги.Выгрузить());
	РеквизитыПТУ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущийАкцепт.Поступление, "ДатаВходящегоДокумента, Контрагент");
	Запрос.УстановитьПараметр("ПТУ", ТекущийАкцепт.Поступление); 
	Запрос.УстановитьПараметр("Поставщик", РеквизитыПТУ.Контрагент);
	ДеньВСекундах =  24 * 60 * 60;
	Запрос.УстановитьПараметр("ДатаОт", РеквизитыПТУ.ДатаВходящегоДокумента - СовпадениеДатыДнейОт * ДеньВСекундах);
	Запрос.УстановитьПараметр("ДатаДо", РеквизитыПТУ.ДатаВходящегоДокумента + СовпадениеДатыДнейДо * ДеньВСекундах);
	
	РезПоиска = Запрос.Выполнить().Выгрузить();
	Если РезПоиска.Количество() = 1 Тогда
		Результат = Новый Структура("ГУИДРасходов, Сделка, Акцепт, ГУИДПТУ, ИдентификаторСтрокиАкцепта", РезПоиска[0].ИдентификаторСтрокиРасходовВСделке, РезПоиска[0].Сделка, РезПоиска[0].Акцепт, РезПоиска[0].ИдентификаторСтрокиПоступления, РезПоиска[0].ИдентификаторСтрокиАкцепта);
	Иначе
		//Сообщить("При попытке доп.разнесения по КТК " + ТекСтрока.Контейнер + " возникла ошибка: найдено " + РезПоиска.Количество() + " подходящих строк в акцептах: " + СтрСоединить(РезПоиска.ВыгрузитьКолонку("Акцепт"), ", "));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТДНайденВРасходах(ТранспортныйДокумент, ОбрТЧ)
	
	Результат = Ложь;
	
	//Евросиб - АСуслов 28.11.2021 15:19:25 #42886
	//(
	//НомерЖДН = ТранспортныйДокумент.НомерТранспортногоДокумента;
	НомерЖДН = ТранспортныйДокумент;
	
	//Для каждого Стр из ОбрТЧ Цикл
	//	
	//	//Если СтрНайти(Стр.СписокТД, НомерЖДН) > 0 Тогда Результат = Истина; Прервать; КонецЕсли;
	//	Если (Стр.СписокТД, ТранспортныйДокумент) > 0 Тогда Результат = Истина; Прервать; КонецЕсли;
	//		
	//КонецЦикла;
	Если ОбрТЧ.Найти(НомерЖДН, "ТранспортныйДокумент") <> Неопределено Тогда
		Результат = Истина;
	КонецЕсли;
	//)
	//Евросиб - АСуслов 28.11.2021 15:19:32 #42886
	
	Возврат Результат;
	
КонецФункции

Функция НоменклатуруРазрешеноСопоставлятьС(ИсхНоменклатура, ВесПоНакладной) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПравилаСопоставленияНоменклатуры.РазрешитьСопоставлятьС КАК РазрешитьСопоставлятьС
	               |ИЗ
	               |	РегистрСведений.ПравилаСопоставленияНоменклатуры КАК ПравилаСопоставленияНоменклатуры
	               |ГДЕ
	               |	ПравилаСопоставленияНоменклатуры.ИсходнаяНоменклатура = &ИсхНоменклатура
	               |	И ПравилаСопоставленияНоменклатуры.СопоставлятьПриВесеПоНакладнойОт <= &ВесПоНакладной
	               |	И ПравилаСопоставленияНоменклатуры.СопоставлятьПриВесеПоНакладнойДо >= &ВесПоНакладной";
	Запрос.УстановитьПараметр("ИсхНоменклатура", ИсхНоменклатура);
	Запрос.УстановитьПараметр("ВесПоНакладной", ВесПоНакладной);
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("РазрешитьСопоставлятьС");
	//Результат.Добавить(ИсхНоменклатура);
	Возврат Результат;
	
КонецФункции

Функция НакладнаяВстречаетсяВСделке(НомерТранспортногоДокумента, Сделка, УчЕдСделок=Неопределено, Контейнер=Неопределено)
	
	ЧтоТоНайдено = Ложь;
	
	Если УчЕдСделок=Неопределено Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	СделкаСвязьУчетныхЕдиниц.НомерЖДН КАК НомерЖДН,
		               |	СделкаСвязьУчетныхЕдиниц.НомерВагоннойЖДН КАК НомерВагоннойЖДН,
		               |	СделкаСвязьУчетныхЕдиниц.НомерПорожнейЖДНКТК КАК НомерПорожнейЖДНКТК,
		               |	СделкаСвязьУчетныхЕдиниц.НомерПорожнейВагоннойЖДН КАК НомерПорожнейВагоннойЖДН
		               |ИЗ
		               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		               |ГДЕ
		               |	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
		               |	И (СделкаСвязьУчетныхЕдиниц.НомерЖДН ПОДОБНО &НомерЖДН
		               |			ИЛИ СделкаСвязьУчетныхЕдиниц.НомерВагоннойЖДН ПОДОБНО &НомерЖДН
		               |			ИЛИ СделкаСвязьУчетныхЕдиниц.НомерПорожнейЖДНКТК ПОДОБНО &НомерЖДН
		               |			ИЛИ СделкаСвязьУчетныхЕдиниц.НомерПорожнейВагоннойЖДН ПОДОБНО &НомерЖДН 
					   //Евросиб - АСуслов 28.11.2021 15:06:42 #42886
					   //(
		               |			ИЛИ СделкаСвязьУчетныхЕдиниц.ЖДНПерестановкиДоГружКТК.НомерТранспортногоДокумента ПОДОБНО &НомерЖДН 
		               |			ИЛИ СделкаСвязьУчетныхЕдиниц.ЖДНПерестановкиДоГружКТК.НомерТранспортногоДокумента ПОДОБНО &НомерЖДН 
					   //)
					   //Евросиб - АСуслов 28.11.2021 15:06:42 #42886
		               |			ИЛИ СделкаСвязьУчетныхЕдиниц.НакладнаяПослеГруженогоПлеча.НомерТранспортногоДокумента ПОДОБНО &НомерЖДН)";
		Запрос.УстановитьПараметр("Ссылка", Сделка);
		Запрос.УстановитьПараметр("НомерЖДН", НомерТранспортногоДокумента);
		//Ответ = Запрос.Выполнить().Выбрать();
		
		ЧтоТоНайдено = НЕ Запрос.Выполнить().Пустой();
		
		//Если Ответ.Следующий() Тогда
		//
		//	ЧтоТоНайдено = ЧтоТоНайдено ИЛИ 
		//	Найти(Ответ.НомерЖДН, НомерТранспортногоДокумента) > 0 ИЛИ 
		//	Найти(Ответ.НомерВагоннойЖДН, НомерТранспортногоДокумента) > 0 ИЛИ 
		//	Найти(Ответ.НомерПорожнейЖДНКТК, НомерТранспортногоДокумента) > 0 ИЛИ 
		//	Найти(Ответ.НомерПорожнейВагоннойЖДН, НомерТранспортногоДокумента) > 0;
		//
		//КонецЦикла; 
		
	Иначе
	
		ТЗОтвет = УчЕдСделок.НайтиСтроки(Новый Структура("Сделка,Контейнер", Сделка, Контейнер) );
		
		Для каждого Ответ Из ТЗОтвет Цикл
			
			ЧтоТоНайдено = ЧтоТоНайдено ИЛИ Найти(Ответ.НомерЖДН, НомерТранспортногоДокумента) > 0;
			Если ЧтоТоНайдено Тогда
				Прервать;
			КонецЕсли;
			//Евросиб - АСуслов 28.11.2021 15:15:27 #42886
			//(
			//ИЛИ 
			//Найти(Ответ.НомерВагоннойЖДН, НомерТранспортногоДокумента) > 0 ИЛИ 
			//Найти(Ответ.НомерПорожнейЖДНКТК, НомерТранспортногоДокумента) > 0 ИЛИ 
			//Найти(Ответ.НомерПорожнейВагоннойЖДН, НомерТранспортногоДокумента) > 0;
			//)
			//Евросиб - АСуслов 28.11.2021 15:15:31 #42886
			
		КонецЦикла;
	
	КонецЕсли; 
	
	Возврат ЧтоТоНайдено;
	
КонецФункции

Функция КТКНеизвестен(КТК)
	
	Возврат Ложь; /// НЕ ЗначениеЗаполнено(КТК.ТипТЕ);
	
	//
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ПризнакСобственностиКонтейнера.Контейнер КАК Контейнер,
	//               |	ПризнакСобственностиКонтейнера.ПризнакСобственности КАК ПризнакСобственности,
	//               |	ПризнакСобственностиКонтейнера.ВЭксплуатации КАК ВЭксплуатации,
	//               |	ПризнакСобственностиКонтейнера.ВладелецКТК КАК ВладелецКТК,
	//               |	ПризнакСобственностиКонтейнера.ДокументРегистратор КАК ДокументРегистратор
	//               |ИЗ
	//               |	РегистрСведений.ПризнакСобственностиКонтейнера КАК ПризнакСобственностиКонтейнера
	//               |ГДЕ
	//               |	ПризнакСобственностиКонтейнера.Контейнер = &Контейнер";
	//Запрос.УстановитьПараметр("Контейнер", КТК);
	//Ответ = Запрос.Выполнить().Выбрать();
	//Если Ответ.Следующий() Тогда
	//	Возврат Ложь;
	//КонецЕсли;
	//
	//Возврат Истина;
	
КонецФункции

Функция ВагонНеизвестен(Вагон)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПризнакСобственностиВагона.ПризнакСобственности КАК ПризнакСобственности,
	               |	ПризнакСобственностиВагона.ВЭксплуатации КАК ВЭксплуатации,
	               |	ПризнакСобственностиВагона.ДокументРегистратор КАК ДокументРегистратор
	               |ИЗ
	               |	РегистрСведений.ПризнакСобственностиВагона КАК ПризнакСобственностиВагона
	               |ГДЕ
	               |	ПризнакСобственностиВагона.ВЭксплуатации
	               |	И ПризнакСобственностиВагона.Вагон = &Вагон";
	Запрос.УстановитьПараметр("Вагон", Вагон);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура РазнестиСписокПТУ(СписокПТУ, АдресРезультата = "") Экспорт  // Евросиб Гонтаренко 28.04.2021 #33906	
	
	МассивРезультатов = Новый Массив;
	Для каждого Стр из СписокПТУ Цикл 
		СтруктураРезультата = РазнестиПТУ(Стр);
		МассивРезультатов.Добавить(СтруктураРезультата.РезультатРазнесения);
	КонецЦикла;
	ПоместитьВоВременноеХранилище(МассивРезультатов, АдресРезультата);
	
КонецПроцедуры

Процедура РазнестиСписокПТУНовыйАлгоритм(СписокПТУ, АдресРезультата = "") Экспорт  // Евросиб Гонтаренко 28.04.2021 #33906	
	
	Для каждого Стр из СписокПТУ Цикл 
		РазнестиПТУНовыйАлгоритм(Стр); 
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьРасписаниеФоновогоЗаданияАвтоакцептов() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	РЕЗ = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ОчередьРазнесенияПТУ).Расписание;
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РЕЗ; 
	
КонецФункции

Процедура ОкончаниеРедактированияРасписание(НовоеЗадание, Параметр2 = неопределено) Экспорт
	
	Если НовоеЗадание = неопределено Тогда Возврат; КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Задание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ОчередьРазнесенияПТУ);
	Задание.Расписание = НовоеЗадание;
	Задание.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ДЗ(ПТУ, Акцепт, НЗ, ТекстЪ)
	
	НЗ = НЗ + 1;
	
	МЗ = Регистрысведений.ПротоколАвторазнесения.СоздатьМенеджерЗаписи();
	МЗ.Акцепт = Акцепт;
	МЗ.НомерЗаписи = НЗ;
	МЗ.Операция = ТекстЪ;
	МЗ.Период = ТекущаяДата();
	МЗ.ПериодЪ = ТекущаяДата();
	МЗ.ПТУ = ПТУ;
	МЗ.Записать(Истина);
	
КонецПроцедуры

Функция ПолучитьВесНеттоПоНакладной(НомерЖДН, НомерКТК) Экспорт
	
	Результат = 0;
	
	Если НЕ ЗначениеЗаполнено(НомерЖДН) ИЛИ НЕ ЗначениеЗаполнено(НомерКТК) Тогда Возврат Результат; КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	э_НакладнаяКонтейнеры.МассыВКгНетто КАК МассыВКгНетто
	               |ИЗ
	               |	Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
	               |ГДЕ
	               |	э_НакладнаяКонтейнеры.НомерКонтейнера = &НомерКонтейнера
	               |	И НЕ э_НакладнаяКонтейнеры.Ссылка.ПометкаУдаления
	               |	И э_НакладнаяКонтейнеры.Ссылка.НакладнаяНомер = &НакладнаяНомер
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	э_НакладнаяКонтейнеры.Ссылка.Дата УБЫВ";
	Запрос.УстановитьПараметр("НомерКонтейнера", НомерКТК);
	Запрос.УстановитьПараметр("НакладнаяНомер", НомерЖДН);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.МассыВКгНетто;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДополнитьСтрокиАкцептовДаннымиСделки(Акцепт, ИзменятьДанные = Истина, ПериодВОАкцепта = Неопределено, ОтвязыватьПриДополненииДаннымиСделки = Истина) Экспорт
	
	
	ДокументНеИзменился = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АкцептУслуги.ГУИД КАК ГУИД,
	|	АкцептУслуги.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке,
	|	АкцептУслуги.Сделка КАК Сделка
	|ПОМЕСТИТЬ ВТ_АкцептУслуги
	|ИЗ
	|	Документ.Акцепт.Услуги КАК АкцептУслуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаРасходы.Услуга КАК НоменклатураСделки,
	|	1 КАК Количество,
	|	СделкаРасходы.Себестоимость КАК СделкаСумма,
	|	ВЫБОР
	|		КОГДА СделкаРасходы.Количество > 1
	|			ТОГДА СделкаРасходы.СуммаНДС / СделкаРасходы.Количество
	|		ИНАЧЕ СделкаРасходы.СуммаНДС
	|	КОНЕЦ КАК СделкаСуммаНДС,
	|	СделкаРасходы.Себестоимость КАК Цена,
	|	СделкаРасходы.Вагон.Наименование КАК СделкаВагоны,
	|	СделкаРасходы.Контейнер.Наименование КАК СделкаКТК,
	|	СделкаРасходы.ТранспортныйДокумент.НомерТранспортногоДокумента КАК СделкаТД,
	|	СделкаРасходы.Регламентный КАК Регламентный,
	|	СделкаРасходы.СтавкаНДС КАК СделкаСтавкаНДС,
	|	СделкаРасходы.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ВЫБОР
	|		КОГДА СделкаРасходы.Перевыставляемая
	|			ТОГДА СделкаДоходы.УчДокумент
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ОтчетКомитенту,
	|	СделкаРасходы.Перевыставляемая КАК Перевыставляемая,
	|	СделкаРасходы.ВнутренняяСебестоимость КАК ВнутренняяСебестоимость,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СделкаДоходы.УчДокумент.Проведен, ЛОЖЬ)
	|				И Аннулирование.Ссылка ЕСТЬ NULL
	|			ТОГДА СделкаДоходы.УчДокумент
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
	|		КОГДА СделкаДоходы.Перевыставляемая	
	|				И ЕСТЬNULL(СделкаДоходы.КорректировкаДокумента.Проведен, ЛОЖЬ)
	|				И НЕ ЕСТЬNULL(СделкаДоходы.КорректировкаДокумента.ВидОперации, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование)
	|			ТОГДА СделкаДоходы.КорректировкаДокумента
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
	|		КОГДА ЕСТЬNULL(СделкаДоходы.КорректировкаДокумента.Проведен, ЛОЖЬ)
	|				И НЕ ЕСТЬNULL(СделкаДоходы.КорректировкаДокумента.ВидОперации, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование)
	|			ТОГДА СделкаДоходы.КорректировкаДокумента.ИсходныйДокументРеализации
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ДоходыСделкиУчДокумент,
	|	СделкаДоходы.ПериодВО КАК ПериодВО,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СделкаДоходы.УчДокумент.Проведен, ЛОЖЬ)
	|				И Аннулирование.Ссылка ЕСТЬ NULL
	|			ТОГДА СделкаДоходы.УчДокумент.ПериодВО
	|		КОГДА ЕСТЬNULL(СделкаДоходы.КорректировкаДокумента.Проведен, ЛОЖЬ)
	|				И НЕ ЕСТЬNULL(СделкаДоходы.КорректировкаДокумента.ВидОперации, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование)
	|			ТОГДА ВЫБОР
	|					КОГДА СделкаДоходы.КорректировкаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)
	|						ТОГДА СделкаДоходы.КорректировкаДокумента.ПериодВО
	|					ИНАЧЕ СделкаДоходы.КорректировкаДокумента.ИсходныйДокументРеализации.ПериодВО
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК УчДокументПериодВО,
	|	СделкаДоходы.ДатаОказанияУслуги КАК ДатаОказанияУслуги,
	|	НАЧАЛОПЕРИОДА(СделкаДоходы.ДатаОказанияУслуги, МЕСЯЦ) КАК МесяцОказанияУслуги,
	|	СделкаРасходы.ОтнестиНаЗатраты КАК ОтнестиНаЗатраты,
	|	ВЫБОР
	|		КОГДА СделкаДоходы.НомерСтроки ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НетДоходнойСтроки,
	|	СделкаРасходы.ГУИД КАК ГУИДРасходСделка,
	|	СделкаДоходы.ПСЦ КАК Протокол,
	|	СделкаРасходы.Ссылка.Служебная КАК СделкаСлужебная
	|ИЗ
	|	Документ.Сделка.Расходы КАК СделкаРасходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СвязьДоходовИрасходов
	//Евросиб Каблов 27.06.2023 ( 71806
	//|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
	//Евросиб Каблов 27.06.2023 )
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК Аннулирование
	|				ПО СделкаДоходы.УчДокумент = Аннулирование.ДокументРеализации
	|					И (Аннулирование.Проведен)
	|					И (Аннулирование.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование))
	|			ПО СвязьДоходовИрасходов.Ссылка = СделкаДоходы.Ссылка
	|				И СвязьДоходовИрасходов.Доходы = СделкаДоходы.ГУИД
	|		ПО СделкаРасходы.Ссылка = СвязьДоходовИрасходов.Ссылка
	|			И СделкаРасходы.ГУИД = СвязьДоходовИрасходов.Расходы
	|ГДЕ
	|	СделкаРасходы.Ссылка В(&Ссылка)
	|	И СделкаРасходы.ГУИД В(&СтрокиРасходов)
	|	И СделкаРасходы.ГУИД <> """"
	|
	|УПОРЯДОЧИТЬ ПО
	|	СделкаДоходы.НеВыставлятьКлиенту УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	АкцептУслуги.ГУИД КАК ГУИД,
	//|	ЕСТЬNULL(СделкаРасходы.ПричинаОтключенияСтроки, НЕОПРЕДЕЛЕНО) КАК ПричинаОтключенияСтроки,
	//|	ЕСТЬNULL(СделкаРасходы1.ГУИД, НЕОПРЕДЕЛЕНО) КАК РасходыГУИДПриемник,
	//|	ЕСТЬNULL(СделкаРасходы1.Ссылка, НЕОПРЕДЕЛЕНО) КАК СделкаПриемник
	//|ИЗ
	//|	ВТ_АкцептУслуги КАК АкцептУслуги
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы
	//|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы1
	//|			ПО СделкаРасходы.СтрокаРасходовВСделкеПриемник = СделкаРасходы1.ГУИД
	//|               И НЕ СделкаРасходы.СтрокаРасходовВСделкеПриемник = """"
	//|   			И СделкаРасходы.ПеренесеннаяСделкаПриемник = СделкаРасходы1.Ссылка
	//|				И (СделкаРасходы1.УслугаОтключена = ЛОЖЬ)
	//|		ПО АкцептУслуги.Сделка = СделкаРасходы.Ссылка
	//|			И АкцептУслуги.ИдентификаторСтрокиРасходовВСделке = СделкаРасходы.ГУИД
	//|ГДЕ
	//|	СделкаРасходы.УслугаОтключена     
	////Евросиб - АСуслов 07.03.2023 16:29:40 #66486
	////(
	//|   И НЕ (СделкаРасходы.ИсточникПоявленияСтрокиЭкономики = Значение(Перечисление.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта)
	//|        	И СделкаРасходы.ПеренесеннаяСделкаПриемник = Значение(Документ.Сделка.ПустаяСсылка))
	////)
	////Евросиб - АСуслов 07.03.2023 16:29:45 #66486
	////Евросиб - АСуслов 22.12.2022 13:08:17 #63299
	////( 
	//|
	//|           И НЕ АкцептУслуги.ИдентификаторСтрокиРасходовВСделке = """"
	////)
	////Евросиб - АСуслов 21.01.2022 15:19:22 #51968; 
	//объединил 1й и 3й запросы в один
	//отвязываем акцепт только от отключенных в расхода строчек
	//кроме:
	//источник: произвольная услуга - см.2 запрос
	//причина отключения: ОтвязываниеСтрокиАкцептаОтСделки, такие строчки отвязываются только пользователем в акцепте.
	|ВЫБРАТЬ
	|	АкцептУслуги.ГУИД КАК ГУИД,
	|	ЕСТЬNULL(СделкаРасходы.ПричинаОтключенияСтроки, НЕОПРЕДЕЛЕНО) КАК ПричинаОтключенияСтроки,
	|	ЕСТЬNULL(СделкаРасходы1.ГУИД, НЕОПРЕДЕЛЕНО) КАК РасходыГУИДПриемник,
	|	ЕСТЬNULL(СделкаРасходы1.Ссылка, НЕОПРЕДЕЛЕНО) КАК СделкаПриемник
	|ИЗ
	|	ВТ_АкцептУслуги КАК АкцептУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы1
	|			ПО СделкаРасходы.СтрокаРасходовВСделкеПриемник = СделкаРасходы1.ГУИД
	|               И НЕ СделкаРасходы.СтрокаРасходовВСделкеПриемник = """"
	|   			И СделкаРасходы.ПеренесеннаяСделкаПриемник = СделкаРасходы1.Ссылка
	|				И (СделкаРасходы1.УслугаОтключена = ЛОЖЬ)
	|		ПО АкцептУслуги.Сделка = СделкаРасходы.Ссылка
	|			И АкцептУслуги.ИдентификаторСтрокиРасходовВСделке = СделкаРасходы.ГУИД
	|  			И СделкаРасходы.УслугаОтключена     
	|   		И НЕ СделкаРасходы.ПричинаОтключенияСтроки = ЗНАЧЕНИЕ(Перечисление.ПричиныОтключенияСтрокиРасходовСделки.ОтвязываниеСтрокиАкцептаОтСделки)
	|			И НЕ СделкаРасходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ПроизвольнаяУслугаВручную)
	|  			И НЕ АкцептУслуги.ИдентификаторСтрокиРасходовВСделке = """"
	//)
	//Евросиб - АСуслов 21.01.2022 15:19:22 #51968;
	|ОБЪЕДИНИТЬ ВСЕ 
	//запрос получает все расходные строчки с источником "произвольная услуга вручную", связанные с доходными с признаком "не выставлять клиенту", 
	//такие строчки не отключаются в расходах при простановке пользователем галочки "не выстввлять клиенту", но их всё равно нужно отвязать от акцепта
	|
	|ВЫБРАТЬ
	|	АкцептУслуги.ГУИД,
	//|	ЗНАЧЕНИЕ(Перечисление.ПричиныОтключенияСтрокиРасходовСделки.НеВыставлятьДоходКлиенту),
	//ДИТ, Беляев СЮ, US 84896/ TA 85068, 13-05-2024, начало (теперь установка "Не выставлять клиенту" не отвязывает строки, отвязывает удаление доходоной строки Сделки)
	|	ЗНАЧЕНИЕ(Перечисление.ПричиныОтключенияСтрокиРасходовСделки.УдалениеДоходнойСтроки),
	//ДИТ, Беляев СЮ, US 84896/ TA 85068, 13-05-2024, конец
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	ВТ_АкцептУслуги КАК АкцептУслуги 
	//Евросиб - АСуслов 21.03.2024 17:23:33 #82669
	//(
	|  		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДоходыРасходы КАК ДоходыРасходы
	|			ПО АкцептУслуги.ИдентификаторСтрокиРасходовВСделке = ДоходыРасходы.ИдентификаторСтрокиРасхода
	|				И ДоходыРасходы.НеобходимоОтвязатьАкцептыОтСделки
	//Евросиб - АСуслов 28.08.2024 15:47:22 #90743
	//(   
	//если услуга отключена в расходах, источник "произвольная услуга" и к ней нет парной доходной, то такую строчку надо отвязать.
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	АкцептУслуги.ГУИД КАК ГУИД,
	|	ЗНАЧЕНИЕ(Перечисление.ПричиныОтключенияСтрокиРасходовСделки.УдалениеДоходнойСтроки),
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	ВТ_АкцептУслуги КАК АкцептУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АктуальныеПривязкиАкцептовВСделки КАК АктуальныеПривязкиАкцептовВСделки
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы
	|			ПО (АктуальныеПривязкиАкцептовВСделки.ИдентификаторСтрокиРасходовВСделке = СделкаРасходы.ГУИД
	|					И СделкаРасходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ПроизвольнаяУслугаВручную))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДоходыРасходы КАК ДоходыРасходы
	|			ПО (АктуальныеПривязкиАкцептовВСделки.ИдентификаторСтрокиРасходовВСделке = ДоходыРасходы.ИдентификаторСтрокиРасхода)
	|		ПО (АкцептУслуги.ИдентификаторСтрокиРасходовВСделке = АктуальныеПривязкиАкцептовВСделки.ИдентификаторСтрокиРасходовВСделке)
	|ГДЕ
	|	ДоходыРасходы.ИдентификаторСтрокиДохода ЕСТЬ NULL";
	//)
	//Евросиб - АСуслов 28.08.2024 15:47:24 #90743
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	//|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
	//|				ПО СделкаСвязьДоходовИРасходов.Доходы = СделкаДоходы.ГУИД
	//|					И (СделкаДоходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ПроизвольнаяУслугаВручную))
	//|					И (СделкаДоходы.НеВыставлятьКлиенту)
	//|					И СделкаСвязьДоходовИРасходов.Ссылка = СделкаДоходы.Ссылка
	//|			ПО СделкаРасходы.ГУИД = СделкаСвязьДоходовИРасходов.Расходы
	//|				И СделкаРасходы.Ссылка = СделкаСвязьДоходовИРасходов.Ссылка
	//|		ПО АкцептУслуги.Сделка = СделкаРасходы.Ссылка
	//|			И АкцептУслуги.ИдентификаторСтрокиРасходовВСделке = СделкаРасходы.ГУИД";
	//)
	//Евросиб - АСуслов 21.03.2024 17:23:35 #82669
	//ДИТ, Беляев СЮ, US 66796 / TA 73519, 09-08-2023, начало (добавлено для очистки привязки в Акцепте по отключенным строкам Расходов)
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	АкцептУслуги.ГУИД КАК ГУИД,
	//|	ЕСТЬNULL(СделкаРасходы.ПричинаОтключенияСтроки, НЕОПРЕДЕЛЕНО) КАК ПричинаОтключенияСтроки,
	//|	НЕОПРЕДЕЛЕНО,
	//|	НЕОПРЕДЕЛЕНО	
	//|ИЗ
	//|	ВТ_АкцептУслуги КАК АкцептУслуги
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы
	//|		ПО АкцептУслуги.Сделка = СделкаРасходы.Ссылка
	//|			И АкцептУслуги.ИдентификаторСтрокиРасходовВСделке = СделкаРасходы.ГУИД
	//|ГДЕ
	//|	СделкаРасходы.УслугаОтключена
	//|	И СделкаРасходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта)
	//|	И НЕ АкцептУслуги.ИдентификаторСтрокиРасходовВСделке = """"
	////Евросиб Каблов 06.10.2023 ( Ticket#0327386
	//|	И СделкаРасходы.ПричинаОтключенияСтроки <> ЗНАЧЕНИЕ(Перечисление.ПричиныОтключенияСтрокиРасходовСделки.ОтвязываниеСтрокиАкцептаОтСделки)
	////Евросиб Каблов 06.10.2023 )
	//|";
	////ДИТ, Беляев СЮ, US 66796 / TA 73519, 09-08-2023, конец
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Акцепт.Услуги", "&АкцептУслуги");
	Запрос.УстановитьПараметр("АкцептУслуги", Акцепт.Услуги.Выгрузить());
	Запрос.УстановитьПараметр("Ссылка", Акцепт.Услуги.Выгрузить().ВыгрузитьКолонку("Сделка"));
	Запрос.УстановитьПараметр("СтрокиРасходов", Акцепт.Услуги.Выгрузить().ВыгрузитьКолонку("ИдентификаторСтрокиРасходовВСделке"));
	//Евросиб - АСуслов 05.12.2022 13:32:21 #51968
	//(                                                                                                                            
	//Ответ = запрос.Выполнить().Выбрать(); 
	МассивРезультатов = Запрос.ВыполнитьПакет();
	КоличествоРезультатов = МассивРезультатов.Количество();
	Ответ = МассивРезультатов[КоличествоРезультатов - 2].Выбрать(); 
	//)
	//Евросиб - АСуслов 05.12.2022 13:32:24 #51968
	
//Евросиб Гудкова( 20.07.2022 Ticket№ 54859
	Поступление = Акцепт.Поступление;
	Если ТипЗнч(Поступление) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
		Поступление = БухгалтерскийУчетПереопределяемый.ПолучитьИсправляемыйДокументПоступления(Поступление, Истина);
	КонецЕсли;
// Евросиб Гудкова)

	//Евросиб(ДИТ), Беляев СЮ, BUG 102612 / TA 114549, 17-07-2025, начало
	ДатаВходящегоДокумента = НачалоМесяца(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Поступление, "ДатаВходящегоДокумента"));
	//Евросиб(ДИТ), Беляев СЮ, BUG 102612 / TA 114549, 17-07-2025, конец

	Пока Ответ.Следующий() Цикл
		НайденныеСтроки = Акцепт.Услуги.НайтиСтроки(Новый Структура("ИдентификаторСтрокиРасходовВСделке", Ответ.ГУИДРасходСделка));
		Если ИзменятьДанные Тогда
			Для каждого СтрокаАкцепта Из НайденныеСтроки Цикл
				ЗаполнитьЗначенияСвойств(СтрокаАкцепта, Ответ);
				Если Ответ.ВнутренняяСебестоимость Тогда
					СтрокаАкцепта.ВидРасходов = Перечисления.ВидыРасходов.ВнутренняяСебестоимость;
					СтрокаАкцепта.УчДокумент = Неопределено;
				ИначеЕсли Ответ.Перевыставляемая Тогда
					СтрокаАкцепта.ВидРасходов = Перечисления.ВидыРасходов.Возмещаемые;
					СтрокаАкцепта.УчДокумент = Ответ.ДоходыСделкиУчДокумент;
				Иначе
					СтрокаАкцепта.ВидРасходов = Перечисления.ВидыРасходов.Себестоимость;
				КонецЕсли;
				Если Не СтрокаАкцепта.Номенклатура.ЭтоШтрафПретензия Тогда
					Если Ответ.ОтнестиНаЗатраты 
						Тогда
						Если Ответ.СделкаСлужебная Тогда
							СтрокаАкцептПериодВО = Дата(1,1,1);
							СтрокаАкцептПериодУУ = Дата(1,1,1);
						Иначе
//Евросиб Гудкова( 20.07.2022 Ticket№ 54859
//							СтрокаАкцептПериодУУ = НачалоМесяца(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Акцепт.Поступление, "ДатаВходящегоДокумента"));
							//СтрокаАкцептПериодУУ = НачалоМесяца(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Поступление, "ДатаВходящегоДокумента"));
							//Евросиб(ДИТ), Беляев СЮ, BUG 102612 / TA 114549, 17-07-2025, начало
							СтрокаАкцептПериодУУ = ДатаВходящегоДокумента;
							//Евросиб(ДИТ), Беляев СЮ, BUG 102612 / TA 114549, 17-07-2025, конец
// Евросиб Гудкова)
						КонецЕсли; 
						СтрокаАкцепта.ВидЗатрат = Перечисления.ВидыЗатрат.КосвенныеЗатраты;
						СтрокаАкцепта.ПериодУУ = СтрокаАкцептПериодУУ;
					ИначеЕсли ЗначениеЗаполнено(Ответ.ДоходыСделкиУчДокумент) Тогда
						ПериодВОУчДокумент = Ответ.УчДокументПериодВО;
						Если ПериодВОУчДокумент > ПериодВОАкцепта Тогда
							СтрокаАкцепта.ВидЗатрат = Перечисления.ВидыЗатрат.НезавершенноеПроизводство;
							СтрокаАкцепта.УчДокумент = Неопределено;
							СтрокаАкцепта.ПериодУУ = Дата(1,1,1);
						Иначе
							СтрокаАкцепта.ВидЗатрат = Перечисления.ВидыЗатрат.ПрямыеЗатраты;
							СтрокаАкцепта.УчДокумент = Ответ.ДоходыСделкиУчДокумент;
							СтрокаАкцепта.ПериодУУ = Ответ.МесяцОказанияУслуги;
						КонецЕсли;
					Иначе
						СтрокаАкцепта.ВидЗатрат = Перечисления.ВидыЗатрат.НезавершенноеПроизводство;
						СтрокаАкцепта.УчДокумент = Неопределено;
						СтрокаАкцепта.ПериодУУ = Дата(1,1,1);
					КонецЕсли;
				Иначе
					СтрокаАкцепта.ВидЗатрат = Неопределено;
				КонецЕсли; 
			КонецЦикла;
		Иначе
			Для каждого СтрокаАкцепта Из НайденныеСтроки Цикл
				ЗаполнитьЗначенияСвойств(СтрокаАкцепта, Ответ, "СделкаВагоны, СделкаКТК, СделкаТД, Протокол");
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	//Евросиб - АСуслов 05.12.2022 13:33:31 #51968
	//(       
	//Евросиб - АСуслов 13.03.2023 13:45:08 #65786
	//(
	ПовторитьДополнитьДаннымиСделки = Ложь;
	//)
	//Евросиб - АСуслов 13.03.2023 13:45:10 #65786
	Если ОтвязыватьПриДополненииДаннымиСделки Тогда
		ВыборкаОтвязки = МассивРезультатов[КоличествоРезультатов - 1].Выбрать();
		Пока ВыборкаОтвязки.Следующий() Цикл               
			СтрокиАкцепта = Акцепт.Услуги.НайтиСтроки(Новый Структура("ГУИД", ВыборкаОтвязки.ГУИД));
			Если ЗначениеЗаполнено(ВыборкаОтвязки.РасходыГУИДПриемник) Тогда
				СтрокиАкцепта[0].ИдентификаторСтрокиРасходовВСделке = ВыборкаОтвязки.РасходыГУИДПриемник;
				СтрокиАкцепта[0].Сделка = ВыборкаОтвязки.СделкаПриемник;
				//повторить дополнить данными сделки
				ПовторитьДополнитьДаннымиСделки = Истина;
			Иначе
				СтрокаАкцепта = СтрокиАкцепта[0];
				Документы.Акцепт.ОчиститьДанныеПривязки(СтрокаАкцепта, ВыборкаОтвязки.ПричинаОтключенияСтроки);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;                                           
	Если ПовторитьДополнитьДаннымиСделки Тогда
		ДополнитьСтрокиАкцептовДаннымиСделки(Акцепт, ИзменятьДанные, ПериодВОАкцепта, Ложь);
	КонецЕсли;
	//)
	//Евросиб - АСуслов 05.12.2022 13:33:33 #51968
КонецПроцедуры           
	
//Евросиб - АСуслов 26.05.2022 12:18:02 #52227
//(
Процедура ЗапуститьРазнесениеПТУ() Экспорт
	ОчередьРазнесенияПТУ();		
КонецПроцедуры                            

Процедура ЗапуститьРазнесениеПТУ_НовыйАлгоритм() Экспорт
	ОчередьРазнесенияПТУ(Истина);
КонецПроцедуры                            

// данное фоновое задание будет заниматься только ВАГОННЫМ разнесением
Процедура ОчередьРазнесенияПТУ(НовыйАлгоритм = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаОчередиАвторазнесения(НовыйАлгоритм);
	//Евросиб - АСуслов 21.11.2022 10:07:45 #58550
	//(                                          
	МассивСтатусыРазнесения = Новый Массив;
	МассивСтатусыРазнесения.Добавить(Перечисления.СостоянияАвторазнесения.ЧастичноРазнесено);
	МассивСтатусыРазнесения.Добавить(Перечисления.СостоянияАвторазнесения.НеРазнесено);
	Запрос.УстановитьПараметр("СтатусыРазнесения", МассивСтатусыРазнесения);
	//)
	//Евросиб - АСуслов 21.11.2022 10:07:47 #58550
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		ПТУОбъект = Ответ.Ссылка.ПолучитьОбъект();
		Если НЕ ПТУОбъект.Заблокирован() Тогда
			Попытка
				ПТУОбъект.Заблокировать();
				ЗаписатьПротоколАвторазнесенияПТУ(Ответ.Ссылка, Документы.Акцепт.ПолучитьАктуальныйАкцепт(Ответ.Ссылка) ,ТекущаяДата(), НовыйАлгоритм);
			Исключение
				Продолжить;
			КонецПопытки;  
			Если НовыйАлгоритм Тогда
				РазнестиПТУНовыйАлгоритм(Ответ.Ссылка);
			Иначе
				РазнестиПТУ(Ответ.Ссылка,,,НовыйАлгоритм);
			КонецЕсли;
			ПТУОбъект.Разблокировать();
		КонецЕсли;
		Возврат;
		
	КонецЦикла;
	
КонецПроцедуры
//)
//Евросиб - АСуслов 26.05.2022 12:18:04 #52227	

//Евросиб - АСуслов 21.11.2022 9:49:54 #58550
//(
//Функция УдалитьТекстЗапросаОчередиАвторазнесения(НовыйАлгоритм)
//	
//	ТекстЗапроса = 
//	"ВЫБРАТЬ
//	|	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка,
//	|	ЕСТЬNULL(ВложенныйЗапрос.Изменено, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПоследнегоАкцепта
//	|ПОМЕСТИТЬ ТЧ_ПТУ
//	|ИЗ
//	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
//	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	|			Акцепт.Поступление КАК Поступление,
//	|			МАКСИМУМ(Акцепт.Изменено) КАК Изменено
//	|		ИЗ
//	|			Документ.Акцепт КАК Акцепт
//	|		ГДЕ
//	|			Акцепт.ПометкаУдаления = ЛОЖЬ
//	|		
//	|		СГРУППИРОВАТЬ ПО
//	|			Акцепт.Поступление) КАК ВложенныйЗапрос
//	|		ПО ПоступлениеТоваровУслуг.Ссылка = ВложенныйЗапрос.Поступление
//	|ГДЕ
//	|	ПоступлениеТоваровУслуг.Проведен
//	|	И ПоступлениеТоваровУслуг.ВОчередиАвторазнесения
//	|   И &УсловиеОтбораНовыйАлгоритмПТУ
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	коррПоступлениеТоваровУслуг.Ссылка КАК Ссылка,
//	|	ЕСТЬNULL(ВложенныйЗапрос.Изменено, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПоследнегоАкцепта
//	|ПОМЕСТИТЬ ТЧ_коррПТУ
//	|ИЗ
//	|	Документ.КорректировкаПоступления КАК коррПоступлениеТоваровУслуг
//	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	|			Акцепт.Поступление КАК Поступление,
//	|			МАКСИМУМ(Акцепт.Изменено) КАК Изменено
//	|		ИЗ
//	|			Документ.Акцепт КАК Акцепт
//	|		ГДЕ
//	|			Акцепт.ПометкаУдаления = ЛОЖЬ
//	|		
//	|		СГРУППИРОВАТЬ ПО
//	|			Акцепт.Поступление) КАК ВложенныйЗапрос
//	|		ПО коррПоступлениеТоваровУслуг.Ссылка = ВложенныйЗапрос.Поступление
//	|ГДЕ
//	|	коррПоступлениеТоваровУслуг.Проведен
//	|	И коррПоступлениеТоваровУслуг.ВОчередиАвторазнесения
//	|   И &УсловиеОтбораНовыйАлгоритмКоррПТУ
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ТЧ_ПТУ.Ссылка КАК Ссылка,
//	|	ТЧ_ПТУ.ДатаПоследнегоАкцепта КАК ДатаПоследнегоАкцепта
//	|ПОМЕСТИТЬ ВТ
//	|ИЗ
//	|	ТЧ_ПТУ КАК ТЧ_ПТУ
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ТЧ_коррПТУ.Ссылка,
//	|	ТЧ_коррПТУ.ДатаПоследнегоАкцепта
//	|ИЗ
//	|	ТЧ_коррПТУ КАК ТЧ_коррПТУ
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВТ.Ссылка КАК Ссылка,
//	|	ЕСТЬNULL(ПротоколАвторазнесенияПТУСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОкончания
//	|ИЗ
//	|	ВТ КАК ВТ
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколАвторазнесенияПТУ.СрезПоследних КАК ПротоколАвторазнесенияПТУСрезПоследних
//	|		ПО ВТ.Ссылка = ПротоколАвторазнесенияПТУСрезПоследних.Поступление
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	ДатаОкончания,
//	|	ПротоколАвторазнесенияПТУСрезПоследних.Поступление.Дата";
//	//Евросиб - АСуслов 26.05.2022 12:17:29 #52227
//	//(
//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОтбораНовыйАлгоритмПТУ", ?(НовыйАлгоритм = Истина, "ПоступлениеТоваровУслуг.Услуги.Номенклатура.ИспользоватьВНовомАлгоритмеАвторазнесения", "ИСТИНА"));
//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОтбораНовыйАлгоритмКоррПТУ", ?(НовыйАлгоритм = Истина, "коррПоступлениеТоваровУслуг.Услуги.Номенклатура.ИспользоватьВНовомАлгоритмеАвторазнесения", "ИСТИНА"));
//	Возврат ТекстЗапроса;
//	//)
//	//Евросиб - АСуслов 26.05.2022 12:17:33 #52227 
//	
//		
//КонецФункции

Функция ТекстЗапросаОчередиАвторазнесения(НовыйАлгоритм)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка,
	|	ОчередьАвторазнесения.ДатаРазнесения КАК ДатаРазнесения
	|ПОМЕСТИТЬ ТЧ_ПТУ
	|ИЗ
	|	РегистрСведений.ОчередьАвторазнесения КАК ОчередьАвторазнесения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ПО ОчередьАвторазнесения.Поступление = ПоступлениеТоваровУслуг.Ссылка
	|       	И ОчередьАвторазнесения.СостояниеАвторазнесения В (&СтатусыРазнесения)
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Проведен
	|	И &УсловиеОтбораНовыйАлгоритмПТУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	коррПоступлениеТоваровУслуг.Ссылка КАК Ссылка,
	|	ОчередьАвторазнесения.ДатаРазнесения КАК ДатаРазнесения
	|ПОМЕСТИТЬ ТЧ_коррПТУ
	|ИЗ
	|	РегистрСведений.ОчередьАвторазнесения КАК ОчередьАвторазнесения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления КАК коррПоступлениеТоваровУслуг
	|		ПО ОчередьАвторазнесения.Поступление = коррПоступлениеТоваровУслуг.Ссылка
	|       	И ОчередьАвторазнесения.СостояниеАвторазнесения В (&СтатусыРазнесения)
	|ГДЕ
	|	коррПоступлениеТоваровУслуг.Проведен
	|	И &УсловиеОтбораНовыйАлгоритмКоррПТУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧ_ПТУ.Ссылка КАК Ссылка,
	|	ТЧ_ПТУ.ДатаРазнесения КАК ДатаРазнесения
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ТЧ_ПТУ КАК ТЧ_ПТУ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧ_коррПТУ.Ссылка,
	|	ТЧ_коррПТУ.ДатаРазнесения
	|ИЗ
	|	ТЧ_коррПТУ КАК ТЧ_коррПТУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Ссылка КАК Ссылка,
	|	ВТ.ДатаРазнесения КАК ДатаРазнесения
	|ИЗ
	|	ВТ КАК ВТ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаРазнесения";
	//Евросиб - АСуслов 26.05.2022 12:17:29 #52227
	//(
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОтбораНовыйАлгоритмПТУ", ?(НовыйАлгоритм = Истина, "ПоступлениеТоваровУслуг.Услуги.Номенклатура.ИспользоватьВНовомАлгоритмеАвторазнесения", "ИСТИНА"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОтбораНовыйАлгоритмКоррПТУ", ?(НовыйАлгоритм = Истина, "коррПоступлениеТоваровУслуг.Услуги.Номенклатура.ИспользоватьВНовомАлгоритмеАвторазнесения", "ИСТИНА"));
	Возврат ТекстЗапроса;
	//)
	//Евросиб - АСуслов 26.05.2022 12:17:33 #52227 
	
		
КонецФункции
//)
//Евросиб - АСуслов 21.11.2022 9:49:57 #58550

Процедура ЗаписатьПротоколАвторазнесенияПТУ(Поступление, Акцепт, ДатаНачалаРазнесения, НовыйАлгоритм = Ложь)
	
	мз = РегистрыСведений.ПротоколАвторазнесенияПТУ.СоздатьМенеджерЗаписи();
	мз.Период = ТекущаяДата();
	мз.Поступление = Поступление;
	мз.Акцепт = Акцепт;
	мз.ДатаНачала = ДатаНачалаРазнесения;
	//Евросиб - АСуслов 26.05.2022 15:09:12 #
	//(
	мз.НовыйАлгоритм = НовыйАлгоритм;
	//)
	//Евросиб - АСуслов 26.05.2022 15:09:13 #
	мз.Записать();
	
КонецПроцедуры

//Евросиб - АСуслов 12.05.2022 14:19:21 #51399
//(
Процедура ВыполнитьАвторазнесениеАкцепта(Акцепт, РежимБитыеСсылки = Ложь)
	//получим услуги, которые мы можем попытаться разнести
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураПоляДляАвтоакцепта.Ссылка КАК НоменклатураСсылка,
	|	НоменклатураПоляДляАвтоакцепта.Контейнер КАК Контейнер,
	|	НоменклатураПоляДляАвтоакцепта.Вагон КАК Вагон,
	|	НоменклатураПоляДляАвтоакцепта.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	НоменклатураПоляДляАвтоакцепта.ЛокацияОтправления КАК ЛокацияОтправления,
	|	НоменклатураПоляДляАвтоакцепта.ЛокацияНазначения КАК ЛокацияНазначения,
	//|	НоменклатураПоляДляАвтоакцепта.СтанцияОтправления КАК СтанцияОтправления,
	//|	НоменклатураПоляДляАвтоакцепта.РодительСтанцииОтправления КАК РодительСтанцииОтправления,
	//|	НоменклатураПоляДляАвтоакцепта.СинонимыСтанцииОтправления КАК СинонимыСтанцииОтправления,
	//|	НоменклатураПоляДляАвтоакцепта.СтанцияНазначения КАК СтанцияНазначения,
	//|	НоменклатураПоляДляАвтоакцепта.РодительСтанцииНазначения КАК РодительСтанцииНазначения,
	//|	НоменклатураПоляДляАвтоакцепта.СинонимыСтанцииНазначения КАК СинонимыСтанцииНазначения,
	//|	НоменклатураПоляДляАвтоакцепта.ПунктыОтправленияНазначения КАК ПунктыОтправленияНазначения,
	//|	НоменклатураПоляДляАвтоакцепта.РодителиПунктовОтправленияНазначения КАК РодителиПунктовОтправленияНазначения,
	|	НоменклатураПоляДляАвтоакцепта.ВозможноПовторноеРазнесение КАК ВозможноПовторноеРазнесение,
	|	НоменклатураПоляДляАвтоакцепта.НомерСтроки КАК НомерСтроки,
	|	НоменклатураПоляДляАвтоакцепта.Номенклатура КАК Номенклатура,
	|	НоменклатураПоляДляАвтоакцепта.ПериодОказанияУслуги КАК ПериодОказанияУслуги,
	|	НоменклатураПоляДляАвтоакцепта.ПревышениеСуммы КАК ПревышениеСуммы,
	|	НоменклатураПоляДляАвтоакцепта.ИспользоватьРезультатДляПричиныНеурега КАК ИспользоватьРезультатДляПричиныНеурега,
	|	НоменклатураПоляДляАвтоакцепта.Клиент КАК Клиент,
	|	НоменклатураПоляДляАвтоакцепта.Поставщик КАК Поставщик,
	//Евросиб - АСуслов 12.10.2023 15:24:00 #69742
	//(
	|	НоменклатураПоляДляАвтоакцепта.ВыбиратьПоРазницеСумм КАК ВыбиратьПоРазницеСумм,
	//)
	//Евросиб - АСуслов 12.10.2023 15:24:03 #69742
	|	НоменклатураПоляДляАвтоакцепта.Ссылка.АлгоритмПодбораСделокПоПериоду КАК АлгоритмПодбораСделокПоПериоду
	|ИЗ
	|	Справочник.Номенклатура.ПоляДляАвтоакцепта КАК НоменклатураПоляДляАвтоакцепта
	|ГДЕ
	|	НоменклатураПоляДляАвтоакцепта.Ссылка.ИспользоватьВНовомАлгоритмеАвторазнесения
	|	И НоменклатураПоляДляАвтоакцепта.Ссылка В(&СписокНоменклатуры)";
	Запрос.УстановитьПараметр("СписокНоменклатуры", Акцепт.Услуги.ВыгрузитьКолонку("Номенклатура"));
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	ВыборкаУслуг = РезультатЗапроса.Выбрать();
	//Сформируем запрос по правильно заполненным строкам для автоакцепта
	Запрос = Новый Запрос;        
	ТекстЗапросаОбщий = "";                                  
	ВсегоЗапросов = 0;
	Пока ВыборкаУслуг.Следующий() Цикл
		ВсегоЗапросов = ВсегоЗапросов + 1;
		ШаблонЗапроса = ПолучитьШаблонЗапроса(РежимБитыеСсылки);
		//ДополнитьШаблонЗапросаСинонимамиЛокаций(ШаблонЗапроса, ВыборкаУслуг);
		ТекстЗапроса = СтрЗаменить(ШаблонЗапроса, "И &УсловияОбязательныхПолейАвтоакцепта", ПолучитьТекстУсловияПоПолямДляАвтоакцепта(ВыборкаУслуг));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляАкцептаДляОтбора", ПолучитьТекстПолейДляАвтоакцепта(ВыборкаУслуг));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &ОтборПоНоменклатуре", " И АкцептУслуги.Номенклатура = &Номенклатура"+ВсегоЗапросов);
		Запрос.УстановитьПараметр("Номенклатура"+ВсегоЗапросов, ВыборкаУслуг.Номенклатура);
		Если ВсегоЗапросов > 1 Тогда
			ТекстЗапросаОбщий = ТекстЗапросаОбщий + "
			|ОБЪЕДИНИТЬ
			|";
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ВТ_СтрокиДляАвтоакцепта", "");
		КонецЕсли;
		ТекстЗапросаОбщий = ТекстЗапросаОбщий + ТекстЗапроса;
	КонецЦикла;
	ТекстЗапросаОбщий = ТекстЗапросаОбщий + "
	|;";
	//сформируем запрос по незаполненным строкам для описания причин неурегов
	ШаблонЗапроса = ПолучитьШаблонЗапросаОписанияПричинНеурегов(РежимБитыеСсылки);
	Запрос = Новый Запрос;        
	//ТекстЗапросаОбщий = "";                                  
	ВсегоЗапросов = 0; 
	ВыборкаУслуг.Сбросить();
	Пока ВыборкаУслуг.Следующий() Цикл
		ВсегоЗапросов = ВсегоЗапросов + 1;        
		ТекстЗапроса = СтрЗаменить(ШаблонЗапроса, "&УсловияОбязательныхПолейДляНеурегов", ПолучитьТекстУсловияПоПолямДляНеурегов(ВыборкаУслуг));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляАкцептаДляОтбора", ПолучитьТекстПолейДляАвтоакцепта(ВыборкаУслуг, Истина));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоНоменклатуре", "АкцептУслуги.Номенклатура = &Номенклатура"+ВсегоЗапросов);
		Запрос.УстановитьПараметр("Номенклатура"+ВсегоЗапросов, ВыборкаУслуг.НоменклатураСсылка);
		Если ВсегоЗапросов > 1 Тогда
			ТекстЗапросаОбщий = ТекстЗапросаОбщий + "
			|ОБЪЕДИНИТЬ
			|";
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ВТ_СтрокиДляПричинНеурегов", "");
		КонецЕсли;
		ТекстЗапросаОбщий = ТекстЗапросаОбщий + ТекстЗапроса;
	КонецЦикла;
	ТекстЗапросаОбщий = ТекстЗапросаОбщий + "
	|;";         
    ТекстЗапросаВТ = "";
	Если Не РежимБитыеСсылки Тогда
		ТекстЗапросаВТ = ТекстЗапросаВТ + 
		"ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_АкцептУслуги ИЗ &АкцептУслуги КАК АкцептУслуги ГДЕ АкцептУслуги.Сделка = Значение(Документ.Сделка.ПустаяСсылка)
	//Евросиб - АСуслов 08.11.2022 13:50:42 #60543
	//(
	|   И НЕ АкцептУслуги.Неурег = Значение(Справочник.ПричиныНеурегулированныхРасходов.НетСделки)
	//)
	//Евросиб - АСуслов 08.11.2022 13:50:50 #60543
	//Евросиб - АСуслов 18.01.2023 17:38:37 #63097
	//(
	|	И НЕ АкцептУслуги.Неурег = ЗНАЧЕНИЕ(Справочник.ПричиныНеурегулированныхРасходов.КоносаментНеПодобран)
	//)
	//Евросиб - АСуслов 08.11.2022 13:50:50 #63097
//Евросиб Гудкова( 21.07.2022 Ticket№ 54975 
	|	И НЕ АкцептУслуги.Неурег = Значение(Справочник.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ)
	//Евросиб Каблов 02.12.2024 ( #94191
	|   И АкцептУслуги.Неурег <> Значение(Справочник.ПричиныНеурегулированныхРасходов.НеЗаполненыОбязательныеПоляВАкцепте)
	//Евросиб Каблов 02.12.2024 )
	//Евросиб Каблов 17.01.2024 ( #79488
	|	И НЕ (АкцептУслуги.ПричинаНеакцепта <> ЗНАЧЕНИЕ(Справочник.Претензии.ПустаяСсылка) И АкцептУслуги.СтатусПричины <> ЗНАЧЕНИЕ(Перечисление.СтатусыПричинНеакцепта.Откз))
	//Евросиб Каблов 17.01.2024 )
	|;
	|ВЫБРАТЬ АкцептУслуги.СтанцияОтправления КАК Локация ПОМЕСТИТЬ ВТ_ЛокацииАкцепта ИЗ ВТ_АкцептУслуги КАК АкцептУслуги ГДЕ НЕ АкцептУслуги.СтанцияОтправления.Ссылка ЕСТЬ NULL
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ АкцептУслуги.СтанцияНазначения КАК Локация ИЗ ВТ_АкцептУслуги КАК АкцептУслуги ГДЕ НЕ АкцептУслуги.СтанцияНазначения.Ссылка ЕСТЬ NULL
	|;
	|";
// Евросиб Гудкова)
	Иначе
		ТекстЗапросаВТ = ТекстЗапросаВТ +
		"ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_АкцептУслуги ИЗ &АкцептУслуги КАК АкцептУслуги ГДЕ НЕ АкцептУслуги.Сделка = Значение(Документ.Сделка.ПустаяСсылка)
	//(
	|   И НЕ АкцептУслуги.Неурег = Значение(Справочник.ПричиныНеурегулированныхРасходов.НетСделки)
	//)
	//Евросиб - АСуслов 18.01.2023 17:38:37 #63097
	//(
	|	И НЕ АкцептУслуги.Неурег = ЗНАЧЕНИЕ(Справочник.ПричиныНеурегулированныхРасходов.КоносаментНеПодобран)
	//)
	//Евросиб Каблов 02.12.2024 ( #94191
	|   И АкцептУслуги.Неурег <> Значение(Справочник.ПричиныНеурегулированныхРасходов.НеЗаполненыОбязательныеПоляВАкцепте)
	//Евросиб Каблов 02.12.2024 )
	//Евросиб Каблов 17.01.2024 ( #79488
	|	И НЕ (АкцептУслуги.ПричинаНеакцепта <> ЗНАЧЕНИЕ(Справочник.Претензии.ПустаяСсылка) И АкцептУслуги.СтатусПричины <> ЗНАЧЕНИЕ(Перечисление.СтатусыПричинНеакцепта.Откз))
	//Евросиб Каблов 17.01.2024 )
//Евросиб Гудкова( 21.07.2022 Ticket№ 54975
	|	И НЕ АкцептУслуги.Неурег = Значение(Справочник.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ);";
// Евросиб Гудкова)
	КонецЕсли;
	ТекстЗапросаВТ = ТекстЗапросаВТ + 
	ПолучитьТекстЗапросаАналогиЛокаций();
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос.МенеджерВременныхТаблиц = МВТ;

	Запрос.Текст = ТекстЗапросаВТ+"
	|"+ТекстЗапросаОбщий;

	Запрос.УстановитьПараметр("АкцептУслуги", Акцепт.Услуги.Выгрузить());
	//Евросиб - АСуслов 02.12.2022 16:05:10 #61013
	//(
	ПоступлениеАкцепта = Акцепт.Поступление;
	Если ТипЗнч(ПоступлениеАкцепта) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫРАЗИТЬ(&Поступление КАК Документ.ПоступлениеТоваровУслуг)", "ВЫРАЗИТЬ(&Поступление КАК Документ.КорректировкаПоступления)");
	КонецЕсли;
	//)
	//Евросиб - АСуслов 02.12.2022 16:05:35 #61013
	Запрос.УстановитьПараметр("Поступление", Акцепт.Поступление);
	Запрос.Выполнить();
	ТекстЗапросаДляОтладки = Запрос.Текст +"
	|";
	
	//получим список уникальных отборов
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_СтрокиДляАвтоакцепта.Сделка КАК Сделка,
	|	ВТ_СтрокиДляАвтоакцепта.Номенклатура КАК Номенклатура,
	//Евросиб - АСуслов 19.01.2023 12:26:48 #63097
	//(
	|	ВТ_СтрокиДляАвтоакцепта.АлгоритмПодбораСделокПоПериоду КАК АлгоритмПодбораСделокПоПериоду,
	|	ВТ_СтрокиДляАвтоакцепта.ИнтервалПериодаОпределенияСделокДоДатыНачалаПеревозки КАК ИнтервалПериодаОпределенияСделокДоДатыНачалаПеревозки,
	|	ВТ_СтрокиДляАвтоакцепта.ИнтервалПериодаОпределенияСделокПослеДатыОкончанияПеревозки КАК ИнтервалПериодаОпределенияСделокПослеДатыОкончанияПеревозки,
	//)
	//Евросиб - АСуслов 19.01.2023 12:27:00 #63097
	|	ПравилаСопоставленияНоменклатуры.РазрешитьСопоставлятьС КАК НоменклатураСопоставления,
	|	ВТ_СтрокиДляАвтоакцепта.Контейнер КАК Контейнер,
	|	ВТ_СтрокиДляАвтоакцепта.Вагон КАК Вагон,
	|	ВТ_СтрокиДляАвтоакцепта.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	ВТ_СтрокиДляАвтоакцепта.СтанцияОтправления КАК СтанцияОтправления,
	|	ВТ_СтрокиДляАвтоакцепта.СтанцияНазначения КАК СтанцияНазначения,
	|	ВТ_СтрокиДляАвтоакцепта.КонтейнерДляОтбора КАК КонтейнерДляОтбора,
	|	ВТ_СтрокиДляАвтоакцепта.ЗаполненКонтейнерДляОтбора КАК ЗаполненКонтейнерДляОтбора,
	|	ВТ_СтрокиДляАвтоакцепта.ВагонДляОтбора КАК ВагонДляОтбора,
	|	ВТ_СтрокиДляАвтоакцепта.ЗаполненВагонДляОтбора КАК ЗаполненВагонДляОтбора,
	|	ВТ_СтрокиДляАвтоакцепта.ТранспортныйДокументДляОтбора КАК ТранспортныйДокументДляОтбора,
	|	ВТ_СтрокиДляАвтоакцепта.ЗаполненТранспортныйДокументДляОтбора КАК ЗаполненТранспортныйДокументДляОтбора,
	//|	ВТ_СтрокиДляАвтоакцепта.СтанцияОтправленияДляОтбора КАК СтанцияОтправленияДляОтбора,
	//|	ВТ_СтрокиДляАвтоакцепта.СтанцияНазначенияДляОтбора КАК СтанцияНазначенияДляОтбора,
	//|	ВТ_СтрокиДляАвтоакцепта.СтанцияОтправленияРодительДляОтбора КАК СтанцияОтправленияРодительДляОтбора,
	//|	ВТ_СтрокиДляАвтоакцепта.СтанцияНазначенияРодительДляОтбора КАК СтанцияНазначенияРодительДляОтбора,
	//|	ВТ_СтрокиДляАвтоакцепта.СтанцияОтправленияСинонимыДляОтбора КАК СтанцияОтправленияСинонимыДляОтбора,
	//|	ВТ_СтрокиДляАвтоакцепта.СтанцияНазначенияСинонимыДляОтбора КАК СтанцияНазначенияСинонимыДляОтбора,
	|	ЕСТЬNULL(АналогиЛокацийДляСтанцийОтправления.Аналог, НЕОПРЕДЕЛЕНО) КАК ЛокацияОтправленияДляОтбора,
	|	ЕСТЬNULL(АналогиЛокацийДляСтанцийНазначения.Аналог, НЕОПРЕДЕЛЕНО) КАК ЛокацияНазначенияДляОтбора,
	|	ВТ_СтрокиДляАвтоакцепта.ЗаполненЛокацияОтправленияДляОтбора КАК ЗаполненЛокацияОтправленияДляОтбора,
	|	ВТ_СтрокиДляАвтоакцепта.ЗаполненЛокацияНазначенияДляОтбора КАК ЗаполненЛокацияНазначенияДляОтбора,
	|	ВТ_СтрокиДляАвтоакцепта.КлиентДляОтбора КАК КлиентДляОтбора,
	|	ВТ_СтрокиДляАвтоакцепта.ЗаполненКлиентДляОтбора КАК ЗаполненКлиентДляОтбора,
	|	ВТ_СтрокиДляАвтоакцепта.ПоставщикДляОтбора КАК ПоставщикДляОтбора,
	|	ВТ_СтрокиДляАвтоакцепта.ЗаполненПоставщикДляОтбора КАК ЗаполненПоставщикДляОтбора,
	|	ВТ_СтрокиДляАвтоакцепта.СуммаДляОтбора КАК СуммаДляОтбора,
	|	ВТ_СтрокиДляАвтоакцепта.ЗаполненСуммаДляОтбора КАК ЗаполненСуммаДляОтбора,
	|	ВТ_СтрокиДляАвтоакцепта.НачалоОказанияУслугиДляОтбора КАК НачалоОказанияУслугиДляОтбора,
	|	ВТ_СтрокиДляАвтоакцепта.ОкончаниеОказанияУслугиДляОтбора КАК ОкончаниеОказанияУслугиДляОтбора,
	|	ВТ_СтрокиДляАвтоакцепта.ЗаполненПериодОказанияУслугиДляОтбора КАК ЗаполненПериодОказанияУслугиДляОтбора,
	|	ВТ_СтрокиДляАвтоакцепта.ВозможноПовторноеРазнесение КАК ВозможноПовторноеРазнесение,
	|	ВТ_СтрокиДляАвтоакцепта.ИспользоватьРезультатДляПричиныНеурега КАК ИспользоватьРезультатДляПричиныНеурега,
	//Евросиб - АСуслов 12.10.2023 16:08:18 #69742
	//(
	|	ВТ_СтрокиДляАвтоакцепта.ВыбиратьПоРазницеСумм КАК ВыбиратьПоРазницеСумм,
	|	ВТ_СтрокиДляАвтоакцепта.ПоступлениеСумма КАК ПоступлениеСумма,
	//)
	//Евросиб - АСуслов 12.10.2023 16:08:21 #69742
	|	ВТ_СтрокиДляАвтоакцепта.Приоритет КАК Приоритет,
	|   ЕСТЬNULL(АналогиЛокацийДляСтанцийОтправления.Приоритет, 0) + ЕСТЬNULL(АналогиЛокацийДляСтанцийНазначения.Приоритет, 0) КАК ПриоритетЛокаций	
	|ПОМЕСТИТЬ ВТ_УслугиДляОтбора
	|ИЗ
	|	ВТ_СтрокиДляАвтоакцепта КАК ВТ_СтрокиДляАвтоакцепта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаСопоставленияНоменклатуры КАК ПравилаСопоставленияНоменклатуры
	|		ПО ВТ_СтрокиДляАвтоакцепта.Номенклатура = ПравилаСопоставленияНоменклатуры.ИсходнаяНоменклатура
	|			И ВТ_СтрокиДляАвтоакцепта.ВесПоНакладной >= ПравилаСопоставленияНоменклатуры.СопоставлятьПриВесеПоНакладнойОт
	|			И ВТ_СтрокиДляАвтоакцепта.ВесПоНакладной <= ПравилаСопоставленияНоменклатуры.СопоставлятьПриВесеПоНакладнойДо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АналогиЛокаций КАК АналогиЛокацийДляСтанцийОтправления
	|		ПО (ВТ_СтрокиДляАвтоакцепта.ЛокацияОтправленияДляОтбора = АналогиЛокацийДляСтанцийОтправления.Локация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АналогиЛокаций КАК АналогиЛокацийДляСтанцийНазначения
	|		ПО (ВТ_СтрокиДляАвтоакцепта.ЛокацияНазначенияДляОтбора = АналогиЛокацийДляСтанцийНазначения.Локация)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//Евросиб - АСуслов 19.01.2023 12:26:48 #63097
	//(
	|	ВТ_СтрокиДляАвтоакцепта.АлгоритмПодбораСделокПоПериоду КАК АлгоритмПодбораСделокПоПериоду,
	|	ВТ_СтрокиДляАвтоакцепта.ИнтервалПериодаОпределенияСделокДоДатыНачалаПеревозки КАК ИнтервалПериодаОпределенияСделокДоДатыНачалаПеревозки,
	|	ВТ_СтрокиДляАвтоакцепта.ИнтервалПериодаОпределенияСделокПослеДатыОкончанияПеревозки КАК ИнтервалПериодаОпределенияСделокПослеДатыОкончанияПеревозки,
	//)
	//Евросиб - АСуслов 19.01.2023 12:27:00 #63097
	|	ВТ_СтрокиДляАвтоакцепта.ЗаполненКонтейнерДляОтбора КАК ЗаполненКонтейнерДляОтбора,
	|	ВТ_СтрокиДляАвтоакцепта.ЗаполненВагонДляОтбора КАК ЗаполненВагонДляОтбора,
	|	ВТ_СтрокиДляАвтоакцепта.ЗаполненТранспортныйДокументДляОтбора КАК ЗаполненТранспортныйДокументДляОтбора,
	//|	ВТ_СтрокиДляАвтоакцепта.ЗаполненСтанцияОтправленияДляОтбора КАК ЗаполненСтанцияОтправленияДляОтбора,
	//|	ВТ_СтрокиДляАвтоакцепта.ЗаполненСтанцияНазначенияДляОтбора КАК ЗаполненСтанцияНазначенияДляОтбора,
	//|	ВТ_СтрокиДляАвтоакцепта.ЗаполненПунктыОтправленияНазначенияДляОтбора КАК ЗаполненПунктыОтправленияНазначенияДляОтбора,
	//|	ВТ_СтрокиДляАвтоакцепта.ЗаполненСтанцияОтправленияСинонимыДляОтбора КАК ЗаполненСтанцияОтправленияСинонимыДляОтбора,
	//|	ВТ_СтрокиДляАвтоакцепта.ЗаполненСтанцияНазначенияСинонимыДляОтбора КАК ЗаполненСтанцияНазначенияСинонимыДляОтбора,
	//|	ВТ_СтрокиДляАвтоакцепта.ЗаполненСтанцияОтправленияРодительДляОтбора КАК ЗаполненСтанцияОтправленияРодительДляОтбора,
	//|	ВТ_СтрокиДляАвтоакцепта.ЗаполненСтанцияНазначенияРодительДляОтбора КАК ЗаполненСтанцияНазначенияРодительДляОтбора,
	|	ВТ_СтрокиДляАвтоакцепта.ЗаполненЛокацияОтправленияДляОтбора КАК ЗаполненЛокацияОтправленияДляОтбора,
	|	ВТ_СтрокиДляАвтоакцепта.ЗаполненЛокацияНазначенияДляОтбора КАК ЗаполненЛокацияНазначенияДляОтбора,
	|	ВТ_СтрокиДляАвтоакцепта.ЗаполненПериодОказанияУслугиДляОтбора КАК ЗаполненПериодОказанияУслугиДляОтбора,
	|	ВТ_СтрокиДляАвтоакцепта.ЗаполненКлиентДляОтбора КАК ЗаполненКлиентДляОтбора,
	|	ВТ_СтрокиДляАвтоакцепта.ЗаполненПоставщикДляОтбора КАК ЗаполненПоставщикДляОтбора,
	|	ВТ_СтрокиДляАвтоакцепта.ЗаполненСуммаДляОтбора КАК ЗаполненСуммаДляОтбора,
	|	ВТ_СтрокиДляАвтоакцепта.ИспользоватьРезультатДляПричиныНеурега КАК ИспользоватьРезультатДляПричиныНеурега,
	//Евросиб - АСуслов 12.10.2023 16:08:49 #69742
	//(
	|	ВТ_СтрокиДляАвтоакцепта.ВыбиратьПоРазницеСумм КАК ВыбиратьПоРазницеСумм
	//)
	//Евросиб - АСуслов 12.10.2023 16:08:50 #69742
	|ИЗ
	|	ВТ_СтрокиДляАвтоакцепта КАК ВТ_СтрокиДляАвтоакцепта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	//Евросиб - АСуслов 19.01.2023 19:40:31 #63097
	//(
	//|ВЫБРАТЬ
	//|	СделкаСвязьУчетныхЕдиниц.ЖДН КАК ЖДН,
	//|	СделкаСвязьУчетныхЕдиниц.Коносамент КАК Коносамент,
	//|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	//|	ЕСТЬNULL(ДатыПодачАвтоПодВыгрузку.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПодачиАвтоПодВыгрузку
	//|ПОМЕСТИТЬ ВТ_СвязьУчетныхЕдиниц
	//|ИЗ
	//|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПодачАвтоПодВыгрузку КАК ДатыПодачАвтоПодВыгрузку
	//|		ПО СделкаСвязьУчетныхЕдиниц.ГУИД = ДатыПодачАвтоПодВыгрузку.ИдентификаторСвязьУчетныхЕдиниц
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	ГУИД";
	//|ВЫБРАТЬ
	//|	КлючАналитикиСоставаПоезда.ИдентификаторКлюча КАК ИдентификаторКлюча,
	//|	КлючАналитикиСоставаПоезда.ДатаОтправления КАК ДатаОтправления,
	//|	КлючАналитикиСоставаПоезда.ДатаПрибытия КАК ДатаПрибытия
	//|ПОМЕСТИТЬ ВТ_КлючиАналитикиСоставаПоезда
	//|ИЗ
	//|	Справочник.КлючиАналитикиСоставаПоезда КАК КлючАналитикиСоставаПоезда
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	ИдентификаторКлюча";
	//)
	//Евросиб - АСуслов 19.01.2023 19:40:38 #63097
	Если РежимБитыеСсылки Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПравилаСопоставленияНоменклатуры.РазрешитьСопоставлятьС КАК НоменклатураСопоставления", 
		"ВЫБОР КОГДА ВТ_СтрокиДляАвтоакцепта.Номенклатура.Наименование = ""ЭкспедиторскиеУслуги"" ТОГДА ВТ_СтрокиДляАвтоакцепта.НоменклатураСделки ИНАЧЕ ПравилаСопоставленияНоменклатуры.РазрешитьСопоставлятьС КОНЕЦ КАК НоменклатураСопоставления");
	КонецЕсли;
	РезультатЗапроса = Запрос.Выполнить(); 
	ТекстЗапросаДляОтладки = ТекстЗапросаДляОтладки + Запрос.Текст + ";";
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаУникальныхОтборов = РезультатЗапроса.Выбрать();
		//Евросиб - АСуслов 17.08.2022 17:08:12 #55129
		//(
		ИспользоватьРегистрРазнесениеРасходовДляРазнесенияАкцептов = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьРегистрРазнесениеРасходовДляРазнесенияАкцептов");
		Если ИспользоватьРегистрРазнесениеРасходовДляРазнесенияАкцептов Тогда
			ШаблонЗапросаОтборов = ПолучитьТекстЗапросаОтборовПоРегиструРазнесениеРасходов();
		Иначе
			ШаблонЗапросаОтборов = ПолучитьТекстЗапросаОтборовПоРегиструРазнесениеЗатратПТУ()
		КонецЕсли;
		//)
		//Евросиб - АСуслов 17.08.2022 17:08:13 #55129
		ТекстЗапросаОбщий = "";                                  
		ВсегоЗапросов = 0;
		Пока ВыборкаУникальныхОтборов.Следующий() Цикл
			ВсегоЗапросов = ВсегоЗапросов + 1;
			ТекстЗапроса = ШаблонЗапросаОтборов;
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеСоединенияУслугДляОтбораРасходы", ПолучитьТекстУсловийСоединенияУслугДляОтбораРасходы(ВыборкаУникальныхОтборов, РежимБитыеСсылки));
			//Евросиб - АСуслов 19.01.2023 19:45:27 #63097
			//(
			//ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеСоединенияУслугДляОтбораСУЕ", ПолучитьТекстУсловийСоединенияУслугДляОтбораСвязьУчетныхЕдиниц(ВыборкаУникальныхОтборов, РежимБитыеСсылки));
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеСоединенияУслугДляОтбораКлючейАналитикиСоставаПоезда", ПолучитьТекстУсловийСоединенияУслугДляОтбораСвязьУчетныхЕдиниц(ВыборкаУникальныхОтборов, РежимБитыеСсылки));
			//)
			//Евросиб - АСуслов 19.01.2023 19:45:33 #63097
			Если РежимБитыеСсылки Тогда
				//Евросиб - АСуслов 17.08.2022 17:13:54 #55129
				//(
				//ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РегистрНакопления.РазнесениеЗатратПТУ.Остатки", "Документ.Сделка.Расходы");	
				//ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РазнесениеЗатратПТУОстатки.Сделка", "РазнесениеЗатратПТУОстатки.Ссылка");	
				//ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РазнесениеЗатратПТУОстатки.ГУИДРасходов", "РазнесениеЗатратПТУОстатки.ГУИД");	
				//ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РазнесениеЗатратПТУОстатки.ДокументПТУ", "РазнесениеЗатратПТУОстатки.УчДокумент");	
				//ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РазнесениеЗатратПТУОстатки.ПолностьюРазнесеноОстаток <> 0", 
				//"РазнесениеЗатратПТУОстатки.УслугаОтключена = Ложь
				//|И (РазнесениеЗатратПТУОстатки.УчДокумент = &Поступление 
				//|	ИЛИ ВЫБОР КОГДА ВТ_УслугиДляОтбора.ВозможноПовторноеРазнесение ТОГДА ИСТИНА
				//|		ИНАЧЕ РазнесениеЗатратПТУОстатки.УчДокумент = Значение(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
				//|		КОНЕЦ)");
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РегистрНакопления.РазнесениеРасходов.Остатки", "Документ.Сделка.Расходы");	
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РазнесениеРасходовОстатки.Сделка", "РазнесениеЗатратПТУОстатки.Ссылка");	
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РазнесениеРасходовОстатки.ГУИДРасходов", "РазнесениеЗатратПТУОстатки.ГУИД");	
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РазнесениеРасходовОстатки.ДокументПТУ", "РазнесениеЗатратПТУОстатки.УчДокумент");	
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Неопределено КАК УчДокумент", "РазнесениеЗатратПТУОстатки.УчДокумент КАК УчДокумент");	
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РазнесениеРасходовОстатки.ПолностьюРазнесеноОстаток <> 0", ПолучитьТекстЗаменыПолностьюРазнесеноОстатокДляРежимаБитыхСсылок());
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РазнесениеРасходовОстатки.НеРазнесеноОстаток > 0", ПолучитьТекстЗаменыПолностьюРазнесеноОстатокДляРежимаБитыхСсылок());
				//)
				//Евросиб - АСуслов 17.08.2022 17:13:55 #55129
			КонецЕсли;
			Если ВсегоЗапросов > 1 Тогда
				ТекстЗапросаОбщий = ТекстЗапросаОбщий + "
				|ОБЪЕДИНИТЬ
				|";
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ВТ_ТаблицаРезультатаБезЛокаций", "");
			КонецЕсли;
			ТекстЗапросаОбщий = ТекстЗапросаОбщий + ТекстЗапроса;
		КонецЦикла;
		Запрос.Текст = ТекстЗапросаОбщий;
		Запрос.Выполнить();
		ТекстЗапросаДляОтладки = ТекстЗапросаДляОтладки + Запрос.Текст + ";";
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ВТ_ТаблицаРезультата.Сделка КАК Сделка,
		|	ВТ_ТаблицаРезультата.ГУИДРасходов КАК ГУИДРасходов,
		|	ВТ_ТаблицаРезультата.УчДокумент КАК УчДокумент,
		|	ВТ_ТаблицаРезультата.Номенклатура КАК Номенклатура,
		|	ВТ_ТаблицаРезультата.Контейнер КАК Контейнер,
		|	ВТ_ТаблицаРезультата.Вагон КАК Вагон,
		|	ВТ_ТаблицаРезультата.ТранспортныйДокумент КАК ТранспортныйДокумент,
		|	ВТ_ТаблицаРезультата.СтанцияОтправления КАК СтанцияОтправления,
		|	ВТ_ТаблицаРезультата.СтанцияНазначения КАК СтанцияНазначения,
		|	ВТ_ТаблицаРезультата.КонтейнерДляОтбора КАК КонтейнерДляОтбора,
		|	ВТ_ТаблицаРезультата.ВагонДляОтбора КАК ВагонДляОтбора,
		|	ВТ_ТаблицаРезультата.ТранспортныйДокументДляОтбора КАК ТранспортныйДокументДляОтбора,
		|	ВТ_ТаблицаРезультата.ЛокацияОтправленияДляОтбора КАК ЛокацияОтправленияДляОтбора,
		|	ВТ_ТаблицаРезультата.ЛокацияНазначенияДляОтбора КАК ЛокацияНазначенияДляОтбора,
		|	ВТ_ТаблицаРезультата.НачалоОказанияУслугиДляОтбора КАК НачалоОказанияУслугиДляОтбора,
		|	ВТ_ТаблицаРезультата.ОкончаниеОказанияУслугиДляОтбора КАК ОкончаниеОказанияУслугиДляОтбора,
		|	ВТ_ТаблицаРезультата.КлиентДляОтбора КАК КлиентДляОтбора,
		|	ВТ_ТаблицаРезультата.ПоставщикДляОтбора КАК ПоставщикДляОтбора,
		|	ВТ_ТаблицаРезультата.ВозможноПовторноеРазнесение КАК ВозможноПовторноеРазнесение,
		|	ВТ_ТаблицаРезультата.ИспользоватьРезультатДляПричиныНеурега КАК ИспользоватьРезультатДляПричиныНеурега,
		//Евросиб - АСуслов 12.10.2023 16:09:45 #69742
		//(
		|	ВТ_ТаблицаРезультата.ВыбиратьПоРазницеСумм КАК ВыбиратьПоРазницеСумм,
		//)
		//Евросиб - АСуслов 12.10.2023 16:09:48 #69742
		|	ВТ_ТаблицаРезультата.Приоритет КАК Приоритет,
		|	ВТ_ТаблицаРезультата.СуммаРасходПлан КАК СуммаРасходПлан,
		//|	ВТ_ТаблицаРезультата.ПунктНазначения КАК ПунктНазначения,
		//|	ВТ_ТаблицаРезультата.ПунктОтправления КАК ПунктОтправления,
		|	ВТ_ТаблицаРезультата.ЗаполненЛокацияОтправленияДляОтбора КАК ЗаполненЛокацияОтправленияДляОтбора,
		|	ВТ_ТаблицаРезультата.ЗаполненЛокацияНазначенияДляОтбора КАК ЗаполненЛокацияНазначенияДляОтбора,
		|	ЕСТЬNULL(ИерархияЛокацийОтправления.ЛокацияВышестоящегоУровня, НЕОПРЕДЕЛЕНО) КАК ИерархияЛокацийОтправления,
		|	ЕСТЬNULL(ИерархияЛокацийНазначения.ЛокацияВышестоящегоУровня, НЕОПРЕДЕЛЕНО) КАК ИерархияЛокацийНазначения,
		//|	ВТ_ТаблицаРезультата.ПриоритетЛокаций КАК ПриоритетЛокаций,
		|  	ВТ_ТаблицаРезультата.ПриоритетЛокаций + ПриоритетТипаИерархииЛокацииВАвторазнесенииПоступленийНазначения.Приоритет + ПриоритетТипаИерархииЛокацииВАвторазнесенииПоступленийОтправления.Приоритет КАК ПриоритетЛокаций,
		|	ВТ_ТаблицаРезультата.СделкаПунктОтправления КАК СделкаПунктОтправления,
		|	ВТ_ТаблицаРезультата.СделкаПунктНазначения КАК СделкаПунктНазначения,
		// Евросиб US 94184 TA 98095 Рыбьяков К.А. 13.03.2025 ((
		|	ВТ_ТаблицаРезультата.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
		// Евросиб Рыбьяков К.А. 13.03.2025 ))
		//Евросиб - АСуслов 12.10.2023 15:50:09 #69742
		//(
		|	ВТ_ТаблицаРезультата.РасхождениеСумм КАК РасхождениеСумм
		//)
		//Евросиб - АСуслов 12.10.2023 15:50:11 #69742
		|ПОМЕСТИТЬ ВТ_ТаблицаРезультатаРасшСтанции
		|ИЗ
		//|	ВТ_ТаблицаРезультатаБезЛокаций КАК ВТ_ТаблицаРезультата
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокацийОтправления
		//|		ПО ВТ_ТаблицаРезультата.СделкаПунктОтправления = ИерархияЛокацийОтправления.Локация
		//|			И (НЕ ИерархияЛокацийОтправления.ЛокацияВышестоящегоУровня = ЗНАЧЕНИЕ(Справочник.Локации.Россия))
		//|			И (ВТ_ТаблицаРезультата.ЗаполненЛокацияОтправленияДляОтбора)
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокацийНазначения
		//|		ПО ВТ_ТаблицаРезультата.СделкаПунктНазначения = ИерархияЛокацийНазначения.Локация
		//|			И (НЕ ИерархияЛокацийНазначения.ЛокацияВышестоящегоУровня = ЗНАЧЕНИЕ(Справочник.Локации.Россия))
		//|			И (ВТ_ТаблицаРезультата.ЗаполненЛокацияНазначенияДляОтбора)
		|ВТ_ТаблицаРезультатаБезЛокаций КАК ВТ_ТаблицаРезультата
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокацийОтправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПриоритетТипаИерархииЛокацииВАвторазнесенииПоступлений КАК ПриоритетТипаИерархииЛокацииВАвторазнесенииПоступленийОтправления
		|		ПО (ИерархияЛокацийОтправления.ТипИерархии = ПриоритетТипаИерархииЛокацииВАвторазнесенииПоступленийОтправления.ТипИерархии)
		|	ПО (ВТ_ТаблицаРезультата.СделкаПунктОтправления = ИерархияЛокацийОтправления.Локация)
		|		И (НЕ ИерархияЛокацийОтправления.ЛокацияВышестоящегоУровня = ЗНАЧЕНИЕ(Справочник.Локации.Россия))
		|		И (ВТ_ТаблицаРезультата.ЗаполненЛокацияОтправленияДляОтбора)
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокацийНазначения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПриоритетТипаИерархииЛокацииВАвторазнесенииПоступлений КАК ПриоритетТипаИерархииЛокацииВАвторазнесенииПоступленийНазначения
		|		ПО (ИерархияЛокацийНазначения.ТипИерархии = ПриоритетТипаИерархииЛокацииВАвторазнесенииПоступленийНазначения.ТипИерархии)
		|	ПО (ВТ_ТаблицаРезультата.СделкаПунктНазначения = ИерархияЛокацийНазначения.Локация)
		|		И (НЕ ИерархияЛокацийНазначения.ЛокацияВышестоящегоУровня = ЗНАЧЕНИЕ(Справочник.Локации.Россия))
		|		И (ВТ_ТаблицаРезультата.ЗаполненЛокацияНазначенияДляОтбора)
		|;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ТаблицаРезультата.Сделка КАК Сделка,
		|	ВТ_ТаблицаРезультата.ГУИДРасходов КАК ГУИДРасходов,
		|	ВТ_ТаблицаРезультата.УчДокумент КАК УчДокумент,
		|	ВТ_ТаблицаРезультата.Номенклатура КАК Номенклатура,
		|	ВТ_ТаблицаРезультата.Контейнер КАК Контейнер,
		|	ВТ_ТаблицаРезультата.Вагон КАК Вагон,
		|	ВТ_ТаблицаРезультата.ТранспортныйДокумент КАК ТранспортныйДокумент,
		|	ВТ_ТаблицаРезультата.СтанцияОтправления КАК СтанцияОтправления,
		|	ВТ_ТаблицаРезультата.СтанцияНазначения КАК СтанцияНазначения,
		|	ВТ_ТаблицаРезультата.КонтейнерДляОтбора КАК КонтейнерДляОтбора,
		|	ВТ_ТаблицаРезультата.ВагонДляОтбора КАК ВагонДляОтбора,
		|	ВТ_ТаблицаРезультата.ТранспортныйДокументДляОтбора КАК ТранспортныйДокументДляОтбора,
		//|	ВТ_ТаблицаРезультата.ЛокацияОтправленияДляОтбора КАК ЛокацияОтправленияДляОтбора,
		//|	ВТ_ТаблицаРезультата.ЛокацияНазначенияДляОтбора КАК ЛокацияНазначенияДляОтбора,
		|ВЫБОР
		|	КОГДА НЕ ВТ_ТаблицаРезультата.ЛокацияОтправленияДляОтбора.Ссылка ЕСТЬ NULL
		|		ТОГДА ВТ_ТаблицаРезультата.СтанцияОтправления
		|	ИНАЧЕ ВТ_ТаблицаРезультата.ЛокацияОтправленияДляОтбора
		|КОНЕЦ КАК ЛокацияОтправленияДляОтбора,
		|ВЫБОР
		|	КОГДА НЕ ВТ_ТаблицаРезультата.ЛокацияНазначенияДляОтбора.Ссылка ЕСТЬ NULL
		|		ТОГДА ВТ_ТаблицаРезультата.СтанцияНазначения
		|	ИНАЧЕ ВТ_ТаблицаРезультата.ЛокацияНазначенияДляОтбора
		|КОНЕЦ КАК ЛокацияНазначенияДляОтбора,
		|	ВТ_ТаблицаРезультата.НачалоОказанияУслугиДляОтбора КАК НачалоОказанияУслугиДляОтбора,
		|	ВТ_ТаблицаРезультата.ОкончаниеОказанияУслугиДляОтбора КАК ОкончаниеОказанияУслугиДляОтбора,
		|	ВТ_ТаблицаРезультата.КлиентДляОтбора КАК КлиентДляОтбора,
		|	ВТ_ТаблицаРезультата.ПоставщикДляОтбора КАК ПоставщикДляОтбора,
		|	ВТ_ТаблицаРезультата.ВозможноПовторноеРазнесение КАК ВозможноПовторноеРазнесение,
		|	ВТ_ТаблицаРезультата.ИспользоватьРезультатДляПричиныНеурега КАК ИспользоватьРезультатДляПричиныНеурега,
		//Евросиб - АСуслов 12.10.2023 16:10:06 #69742
		//(
		|	ВТ_ТаблицаРезультата.ВыбиратьПоРазницеСумм КАК ВыбиратьПоРазницеСумм,
		//)
		//Евросиб - АСуслов 12.10.2023 16:10:08 #69742
		|	ВТ_ТаблицаРезультата.Приоритет КАК Приоритет,
		|	ВТ_ТаблицаРезультата.СуммаРасходПлан КАК СуммаРасходПлан,
		|	ВТ_ТаблицаРезультатаРасшСтанции.ИерархияЛокацийНазначения КАК ПунктНазначения,
		|	ВТ_ТаблицаРезультатаРасшСтанции.ИерархияЛокацийОтправления КАК ПунктОтправления,
		|	ВТ_ТаблицаРезультата.ЗаполненЛокацияОтправленияДляОтбора КАК ЗаполненЛокацияОтправленияДляОтбора,
		|	ВТ_ТаблицаРезультата.ЗаполненЛокацияНазначенияДляОтбора КАК ЗаполненЛокацияНазначенияДляОтбора,
		|	ВТ_ТаблицаРезультатаРасшСтанции.ПриоритетЛокаций КАК ПриоритетЛокаций,
		|	ВТ_ТаблицаРезультата.СделкаПунктОтправления КАК СделкаПунктОтправления,
		|	ВТ_ТаблицаРезультата.СделкаПунктНазначения КАК СделкаПунктНазначения,
		// Евросиб US 94184 TA 98095 Рыбьяков К.А. 13.03.2025 ((
		|	ВТ_ТаблицаРезультата.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
		// Евросиб Рыбьяков К.А. 13.03.2025 ))
		//Евросиб - АСуслов 12.10.2023 15:50:09 #69742
		//(
		|	ВТ_ТаблицаРезультата.РасхождениеСумм КАК РасхождениеСумм
		//)
		//Евросиб - АСуслов 12.10.2023 15:50:11 #69742
		
		|ПОМЕСТИТЬ ВТ_ТаблицаРезультата
		|ИЗ
		|	ВТ_ТаблицаРезультатаБезЛокаций КАК ВТ_ТаблицаРезультата
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаРезультатаРасшСтанции КАК ВТ_ТаблицаРезультатаРасшСтанции
		|		ПО ВТ_ТаблицаРезультата.ГУИДРасходов = ВТ_ТаблицаРезультатаРасшСтанции.ГУИДРасходов
		|			И ВТ_ТаблицаРезультата.Приоритет = ВТ_ТаблицаРезультатаРасшСтанции.Приоритет
		|			И ВТ_ТаблицаРезультата.ЛокацияОтправленияДляОтбора = ВТ_ТаблицаРезультатаРасшСтанции.ИерархияЛокацийОтправления
		|			И ВТ_ТаблицаРезультата.ЛокацияНазначенияДляОтбора = ВТ_ТаблицаРезультатаРасшСтанции.ИерархияЛокацийНазначения
		|;
		|ВЫБРАТЬ
		|	АкцептУслуги.ГУИД КАК ГУИД,
		|	АкцептУслуги.РежимИсправления КАК РежимИсправления,
		|	АкцептУслуги.Номенклатура КАК Номенклатура,
		|	АкцептУслуги.Контейнер КАК Контейнер,
		|	АкцептУслуги.Вагон КАК Вагон,
		|	АкцептУслуги.ТранспортныйДокумент КАК ТранспортныйДокумент,
		//|	АкцептУслуги.СтанцияОтправления КАК СтанцияОтправления,
		//|	АкцептУслуги.СтанцияНазначения КАК СтанцияНазначения,
		|	АкцептУслуги.СтанцияОтправления КАК ЛокацияОтправления,
		|	АкцептУслуги.СтанцияНазначения КАК ЛокацияНазначения,
		|	АкцептУслуги.КонтейнерДляОтбора КАК КонтейнерДляОтбора,
		|	АкцептУслуги.ВагонДляОтбора КАК ВагонДляОтбора,
		|	АкцептУслуги.ТранспортныйДокументДляОтбора КАК ТранспортныйДокументДляОтбора,
		//|	АкцептУслуги.СтанцияОтправленияДляОтбора КАК СтанцияОтправленияДляОтбора,
		//|	АкцептУслуги.СтанцияНазначенияДляОтбора КАК СтанцияНазначенияДляОтбора,
		|	АкцептУслуги.ЛокацияОтправленияДляОтбора КАК ЛокацияОтправленияДляОтбора,
		|	АкцептУслуги.ЛокацияНазначенияДляОтбора КАК ЛокацияНазначенияДляОтбора,
		|	АкцептУслуги.НачалоОказанияУслугиДляОтбора КАК НачалоОказанияУслугиДляОтбора,
		|	АкцептУслуги.ОкончаниеОказанияУслугиДляОтбора КАК ОкончаниеОказанияУслугиДляОтбора,
		|	АкцептУслуги.КлиентДляОтбора КАК КлиентДляОтбора,
		|	АкцептУслуги.ПоставщикДляОтбора КАК ПоставщикДляОтбора,
		|	АкцептУслуги.СуммаДляОтбора КАК СуммаДляОтбора,
		|	АкцептУслуги.ЗаполненКонтейнерДляОтбора КАК ЗаполненКонтейнерДляОтбора,
		|	АкцептУслуги.ЗаполненВагонДляОтбора КАК ЗаполненВагонДляОтбора,
		|	АкцептУслуги.ЗаполненТранспортныйДокументДляОтбора КАК ЗаполненТранспортныйДокументДляОтбора,
		//|	АкцептУслуги.ЗаполненСтанцияОтправленияДляОтбора КАК ЗаполненСтанцияОтправленияДляОтбора,
		//|	АкцептУслуги.ЗаполненСтанцияНазначенияДляОтбора КАК ЗаполненСтанцияНазначенияДляОтбора,
		//|	АкцептУслуги.ЗаполненПунктыОтправленияНазначенияДляОтбора КАК ЗаполненПунктыОтправленияНазначенияДляОтбора,
		//|	АкцептУслуги.ЗаполненСтанцияОтправленияРодительДляОтбора КАК ЗаполненСтанцияОтправленияРодительДляОтбора,
		//|	АкцептУслуги.ЗаполненСтанцияНазначенияРодительДляОтбора КАК ЗаполненСтанцияНазначенияРодительДляОтбора,
		//|	АкцептУслуги.ЗаполненСтанцияОтправленияСинонимыДляОтбора КАК ЗаполненСтанцияОтправленияСинонимыДляОтбора,
		//|	АкцептУслуги.ЗаполненСтанцияНазначенияСинонимыДляОтбора КАК ЗаполненСтанцияНазначенияСинонимыДляОтбора,
		|	АкцептУслуги.ЗаполненЛокацияОтправленияДляОтбора КАК ЗаполненЛокацияОтправленияДляОтбора,
		|	АкцептУслуги.ЗаполненЛокацияНазначенияДляОтбора КАК ЗаполненЛокацияНазначенияДляОтбора,
		|	АкцептУслуги.ЗаполненКлиентДляОтбора КАК ЗаполненКлиентДляОтбора,
		|	АкцептУслуги.ЗаполненПериодОказанияУслугиДляОтбора КАК ЗаполненПериодОказанияУслугиДляОтбора,
		|	АкцептУслуги.ЗаполненПоставщикДляОтбора КАК ЗаполненПоставщикДляОтбора,
		|	АкцептУслуги.ЗаполненСуммаДляОтбора КАК ЗаполненСуммаДляОтбора,
		|	АкцептУслуги.ВозможноПовторноеРазнесение КАК ВозможноПовторноеРазнесение,
		|	АкцептУслуги.ИспользоватьРезультатДляПричиныНеурега КАК ИспользоватьРезультатДляПричиныНеурега,
		//Евросиб - АСуслов 12.10.2023 16:03:48 #69742
		//(
		|	АкцептУслуги.ВыбиратьПоРазницеСумм КАК ВыбиратьПоРазницеСумм,
		//)
		//Евросиб - АСуслов 12.10.2023 16:03:50 #69742
		|	ТаблицаРезультата.Сделка КАК Сделка,
		|	ВЫРАЗИТЬ(ТаблицаРезультата.Сделка КАК Документ.Сделка).Номер КАК СделкаНомер,
		|	ТаблицаРезультата.ГУИДРасходов КАК ГУИДРасходов,
		|	ТаблицаРезультата.УчДокумент КАК УчДокумент,
		|	ТаблицаРезультата.СуммаРасходПлан КАК СуммаРасходПлан,
		// Евросиб US 94184 TA 98095 Рыбьяков К.А. 13.03.2025 ((
		|	ТаблицаРезультата.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
		// Евросиб Рыбьяков К.А. 13.03.2025 ))
		//Евросиб - АСуслов 12.10.2023 15:52:50 #69742
		//(
		|   ТаблицаРезультата.РасхождениеСумм КАК РасхождениеСумм,
		//)
		//Евросиб - АСуслов 12.10.2023 15:52:53 #69742
		|	АкцептУслуги.Приоритет КАК Приоритет,
		|	ТаблицаРезультата.ПриоритетЛокаций КАК ПриоритетЛокаций
		|ПОМЕСТИТЬ ВТ_ТаблицаАвтоакцепта
		|ИЗ
		|	ВТ_СтрокиДляАвтоакцепта КАК АкцептУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаРезультата КАК ТаблицаРезультата
		|		ПО АкцептУслуги.Номенклатура = ТаблицаРезультата.Номенклатура
		|			И АкцептУслуги.КонтейнерДляОтбора = ТаблицаРезультата.КонтейнерДляОтбора
		|			И АкцептУслуги.ВагонДляОтбора = ТаблицаРезультата.ВагонДляОтбора
		|			И АкцептУслуги.ТранспортныйДокументДляОтбора = ТаблицаРезультата.ТранспортныйДокументДляОтбора
		//|			И АкцептУслуги.СтанцияОтправленияДляОтбора = ТаблицаРезультата.СтанцияОтправленияДляОтбора
		//|			И АкцептУслуги.СтанцияНазначенияДляОтбора = ТаблицаРезультата.СтанцияНазначенияДляОтбора
		//Евросиб - АСуслов 02.10.2023 16:53:17 #
		//(
		|			И АкцептУслуги.ЛокацияОтправленияДляОтбора = ТаблицаРезультата.ЛокацияОтправленияДляОтбора
		|			И АкцептУслуги.ЛокацияНазначенияДляОтбора = ТаблицаРезультата.ЛокацияНазначенияДляОтбора
		//|			И АкцептУслуги.ЛокацияОтправленияДляОтбора = ТаблицаРезультата.СтанцияОтправления
		//|			И АкцептУслуги.ЛокацияНазначенияДляОтбора = ТаблицаРезультата.СтанцияНазначения
		//)
		//Евросиб - АСуслов 02.10.2023 16:53:19 #
		|			И АкцептУслуги.НачалоОказанияУслугиДляОтбора = ТаблицаРезультата.НачалоОказанияУслугиДляОтбора
		|			И АкцептУслуги.ОкончаниеОказанияУслугиДляОтбора = ТаблицаРезультата.ОкончаниеОказанияУслугиДляОтбора
		|			И АкцептУслуги.КлиентДляОтбора = ТаблицаРезультата.КлиентДляОтбора
		|			И АкцептУслуги.ПоставщикДляОтбора = ТаблицаРезультата.ПоставщикДляОтбора
		|			И АкцептУслуги.ИспользоватьРезультатДляПричиныНеурега = ТаблицаРезультата.ИспользоватьРезультатДляПричиныНеурега
		//Евросиб - АСуслов 12.10.2023 16:11:06 #69742
		//(
		|			И АкцептУслуги.ВыбиратьПоРазницеСумм = ТаблицаРезультата.ВыбиратьПоРазницеСумм
		//)
		//Евросиб - АСуслов 12.10.2023 16:11:06 #69742
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаАвтоакцепта.ГУИД КАК ГУИД,
		|	ВТ_ТаблицаАвтоакцепта.Приоритет КАК Приоритет,
		|	ВТ_ТаблицаАвтоакцепта.ПриоритетЛокаций КАК ПриоритетЛокаций,
		|	ВЫБОР
		|		КОГДА ВТ_ТаблицаАвтоакцепта.ИспользоватьРезультатДляПричиныНеурега
		|			ТОГДА 0
		|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ТаблицаАвтоакцепта.ГУИДРасходов) = 1
		|			ТОГДА 1
		|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ТаблицаАвтоакцепта.ГУИДРасходов) > 1
		|			ТОГДА 2
		|		ИНАЧЕ 3
		|	КОНЕЦ КАК ДопСортировка,
		|	ВТ_ТаблицаАвтоакцепта.ВозможноПовторноеРазнесение КАК ВозможноПовторноеРазнесение,
		|	ВТ_ТаблицаАвтоакцепта.ИспользоватьРезультатДляПричиныНеурега КАК ИспользоватьРезультатДляПричиныНеурега,
		//Евросиб - АСуслов 12.10.2023 16:11:39 #
		//(
		|	ВТ_ТаблицаАвтоакцепта.ВыбиратьПоРазницеСумм КАК ВыбиратьПоРазницеСумм,
		//)
		//Евросиб - АСуслов 12.10.2023 16:11:40 #
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ТаблицаАвтоакцепта.ГУИДРасходов) КАК КоличествоПодобранныхСтрок,
		//Евросиб - АСуслов 12.10.2023 16:18:57 #69742
		//(
		|   МИНИМУМ(ВТ_ТаблицаАвтоакцепта.РасхождениеСумм) КАК РасхождениеСумм
		//)
		//Евросиб - АСуслов 12.10.2023 16:18:59 #69742
		|ИЗ
		|	ВТ_ТаблицаАвтоакцепта КАК ВТ_ТаблицаАвтоакцепта
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТаблицаАвтоакцепта.ГУИД,
		|	ВТ_ТаблицаАвтоакцепта.ВозможноПовторноеРазнесение,
		|	ВТ_ТаблицаАвтоакцепта.Приоритет,
		|	ВТ_ТаблицаАвтоакцепта.ПриоритетЛокаций,
		|	ВТ_ТаблицаАвтоакцепта.ИспользоватьРезультатДляПричиныНеурега,
		//Евросиб - АСуслов 12.10.2023 16:11:39 #
		//(
		|	ВТ_ТаблицаАвтоакцепта.ВыбиратьПоРазницеСумм
		//)
		//Евросиб - АСуслов 12.10.2023 16:11:40 #
		|
		|УПОРЯДОЧИТЬ ПО
		|	ГУИД,
		|	ДопСортировка,
		|	Приоритет,
		|	ПриоритетЛокаций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ТаблицаАвтоакцепта.ГУИД КАК ГУИД,
		|	ВТ_ТаблицаАвтоакцепта.РежимИсправления КАК РежимИсправления,
		|	ВТ_ТаблицаАвтоакцепта.Номенклатура КАК Номенклатура,
		|	ВТ_ТаблицаАвтоакцепта.Контейнер КАК Контейнер,
		|	ВТ_ТаблицаАвтоакцепта.Вагон КАК Вагон,
		|	ВТ_ТаблицаАвтоакцепта.ТранспортныйДокумент КАК ТранспортныйДокумент,
		//|	ВТ_ТаблицаАвтоакцепта.СтанцияОтправления КАК СтанцияОтправления,
		//|	ВТ_ТаблицаАвтоакцепта.СтанцияНазначения КАК СтанцияНазначения,
		|	ВТ_ТаблицаАвтоакцепта.ЛокацияОтправления КАК ЛокацияОтправления,
		|	ВТ_ТаблицаАвтоакцепта.ЛокацияНазначения КАК ЛокацияНазначения,
		|	ВТ_ТаблицаАвтоакцепта.КонтейнерДляОтбора КАК КонтейнерДляОтбора,
		|	ВТ_ТаблицаАвтоакцепта.ВагонДляОтбора КАК ВагонДляОтбора,
		|	ВТ_ТаблицаАвтоакцепта.ТранспортныйДокументДляОтбора КАК ТранспортныйДокументДляОтбора,
		//|	ВТ_ТаблицаАвтоакцепта.СтанцияОтправленияДляОтбора КАК СтанцияОтправленияДляОтбора,
		//|	ВТ_ТаблицаАвтоакцепта.СтанцияНазначенияДляОтбора КАК СтанцияНазначенияДляОтбора,
		|	ВТ_ТаблицаАвтоакцепта.ЛокацияОтправленияДляОтбора КАК ЛокацияОтправленияДляОтбора,
		|	ВТ_ТаблицаАвтоакцепта.ЛокацияНазначенияДляОтбора КАК ЛокацияНазначенияДляОтбора,
		|	ВТ_ТаблицаАвтоакцепта.НачалоОказанияУслугиДляОтбора КАК НачалоОказанияУслугиДляОтбора,
		|	ВТ_ТаблицаАвтоакцепта.ОкончаниеОказанияУслугиДляОтбора КАК ОкончаниеОказанияУслугиДляОтбора,
		|	ВТ_ТаблицаАвтоакцепта.КлиентДляОтбора КАК КлиентДляОтбора,
		|	ВТ_ТаблицаАвтоакцепта.ПоставщикДляОтбора КАК ПоставщикДляОтбора,
		|	ВТ_ТаблицаАвтоакцепта.СуммаДляОтбора КАК СуммаДляОтбора,
		|	ВТ_ТаблицаАвтоакцепта.ЗаполненКонтейнерДляОтбора КАК ЗаполненКонтейнерДляОтбора,
		|	ВТ_ТаблицаАвтоакцепта.ЗаполненВагонДляОтбора КАК ЗаполненВагонДляОтбора,
		|	ВТ_ТаблицаАвтоакцепта.ЗаполненТранспортныйДокументДляОтбора КАК ЗаполненТранспортныйДокументДляОтбора,
		//|	ВТ_ТаблицаАвтоакцепта.ЗаполненСтанцияОтправленияДляОтбора КАК ЗаполненСтанцияОтправленияДляОтбора,
		//|	ВТ_ТаблицаАвтоакцепта.ЗаполненСтанцияНазначенияДляОтбора КАК ЗаполненСтанцияНазначенияДляОтбора,
		//|	ВТ_ТаблицаАвтоакцепта.ЗаполненПунктыОтправленияНазначенияДляОтбора КАК ЗаполненПунктыОтправленияНазначенияДляОтбора,
		//|	ВТ_ТаблицаАвтоакцепта.ЗаполненСтанцияОтправленияРодительДляОтбора КАК ЗаполненСтанцияОтправленияРодительДляОтбора,
		//|	ВТ_ТаблицаАвтоакцепта.ЗаполненСтанцияНазначенияРодительДляОтбора КАК ЗаполненСтанцияНазначенияРодительДляОтбора,
		//|	ВТ_ТаблицаАвтоакцепта.ЗаполненСтанцияОтправленияСинонимыДляОтбора КАК ЗаполненСтанцияОтправленияСинонимыДляОтбора,
		//|	ВТ_ТаблицаАвтоакцепта.ЗаполненСтанцияНазначенияСинонимыДляОтбора КАК ЗаполненСтанцияНазначенияСинонимыДляОтбора,
		|	ВТ_ТаблицаАвтоакцепта.ЗаполненЛокацияОтправленияДляОтбора КАК ЗаполненЛокацияОтправленияДляОтбора,
		|	ВТ_ТаблицаАвтоакцепта.ЗаполненЛокацияНазначенияДляОтбора КАК ЗаполненЛокацияНазначенияДляОтбора,
		|	ВТ_ТаблицаАвтоакцепта.ЗаполненКлиентДляОтбора КАК ЗаполненКлиентДляОтбора,
		|	ВТ_ТаблицаАвтоакцепта.ЗаполненПоставщикДляОтбора КАК ЗаполненПоставщикДляОтбора,
		|	ВТ_ТаблицаАвтоакцепта.ЗаполненПериодОказанияУслугиДляОтбора КАК ЗаполненПериодОказанияУслугиДляОтбора,
		|	ВТ_ТаблицаАвтоакцепта.ЗаполненСуммаДляОтбора КАК ЗаполненСуммаДляОтбора,
		|	ВТ_ТаблицаАвтоакцепта.ВозможноПовторноеРазнесение КАК ВозможноПовторноеРазнесение,
		|	ВТ_ТаблицаАвтоакцепта.Сделка КАК Сделка,
		|	ВТ_ТаблицаАвтоакцепта.ГУИДРасходов КАК ГУИДРасходов,
		|	ВТ_ТаблицаАвтоакцепта.Приоритет КАК Приоритет,
		|	ВТ_ТаблицаАвтоакцепта.УчДокумент КАК УчДокумент,
		|	ВТ_ТаблицаАвтоакцепта.СуммаРасходПлан КАК СуммаРасходПлан,
		// Евросиб US 94184 TA 98095 Рыбьяков К.А. 13.03.2025 ((
		|	ВТ_ТаблицаАвтоакцепта.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
		// Евросиб Рыбьяков К.А. 13.03.2025 ))
		//Евросиб - АСуслов 12.10.2023 16:20:30 #69742
		//(
		|	ВТ_ТаблицаАвтоакцепта.РасхождениеСумм КАК РасхождениеСумм,
		//)
		//Евросиб - АСуслов 12.10.2023 16:20:32 #69742
		|	ВЫБОР
		|		КОГДА ВТ_ТаблицаАвтоакцепта.УчДокумент <> ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
		|				И ВТ_ТаблицаАвтоакцепта.УчДокумент <> &Поступление
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НеПустойИНеРазносимыйПТУ,
		|	НоменклатураПоляДляАвтоакцепта.Номенклатура КАК ПоискНоменклатура,
		|	НоменклатураПоляДляАвтоакцепта.Контейнер КАК ПоискКонтейнер,
		|	НоменклатураПоляДляАвтоакцепта.Вагон КАК ПоискВагон,
		|	НоменклатураПоляДляАвтоакцепта.ТранспортныйДокумент КАК ПоискТранспортныйДокумент,
		|	НоменклатураПоляДляАвтоакцепта.ЛокацияОтправления КАК ПоискЛокацияОтправления,
		|	НоменклатураПоляДляАвтоакцепта.ЛокацияНазначения КАК ПоискЛокацияНазначения,
		//|	НоменклатураПоляДляАвтоакцепта.РодительСтанцииОтправления КАК ПоискРодительСтанцииОтправления,
		//|	НоменклатураПоляДляАвтоакцепта.РодительСтанцииНазначения КАК ПоискРодительСтанцииНазначения,
		//|	НоменклатураПоляДляАвтоакцепта.СинонимыСтанцииОтправления КАК ПоискСинонимыСтанцииОтправления,
		|	НоменклатураПоляДляАвтоакцепта.ПериодОказанияУслуги КАК ПоискПериодОказанияУслуги,
		|	НоменклатураПоляДляАвтоакцепта.ПревышениеСуммы КАК ПоискПревышениеСуммы,
		|	НоменклатураПоляДляАвтоакцепта.ПричинаНеурега КАК ПоискПричинаНеурега,
		|	НоменклатураПоляДляАвтоакцепта.Ссылка.РазрешитьМногократноеРазнесение КАК РазрешитьМногократноеРазнесение
		|ИЗ
		|	ВТ_ТаблицаАвтоакцепта КАК ВТ_ТаблицаАвтоакцепта
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ПоляДляАвтоакцепта КАК НоменклатураПоляДляАвтоакцепта
		|		ПО ВТ_ТаблицаАвтоакцепта.Номенклатура = НоменклатураПоляДляАвтоакцепта.Ссылка
		|			И ВТ_ТаблицаАвтоакцепта.Приоритет = НоменклатураПоляДляАвтоакцепта.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ТаблицаАвтоакцепта.ГУИД КАК ГУИД,
		|	ВТ_ТаблицаАвтоакцепта.Приоритет КАК Приоритет,
		// Евросиб US 94184 TA 98095 Рыбьяков К.А. 13.03.2025 ((
		|	ВТ_ТаблицаАвтоакцепта.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
		// Евросиб Рыбьяков К.А. 13.03.2025 ))
		//Евросиб - АСуслов 12.10.2023 16:42:23 #69742
		//(
		|	ВТ_ТаблицаАвтоакцепта.РасхождениеСумм КАК РасхождениеСумм,
		//)
		//Евросиб - АСуслов 12.10.2023 16:42:26 #69742
		|	ВТ_ТаблицаАвтоакцепта.Сделка КАК Сделка,
		|	ВТ_ТаблицаАвтоакцепта.СделкаНомер КАК НомерСделки
		|ИЗ
		|	ВТ_ТаблицаАвтоакцепта КАК ВТ_ТаблицаАвтоакцепта";
		//|ГДЕ
		//|	ВТ_ТаблицаАвтоакцепта.Сделка ССЫЛКА Документ.Сделка";
		
		//Если РежимБитыеСсылки Тогда
		//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &СвязьПоУчетнымДокументамВРежимеИсправленияБитыхСсылок", "И АкцептУслуги.Поступление = ТаблицаРезультата.УчДокумент");
		//Иначе
		//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &СвязьПоУчетнымДокументамВРежимеИсправленияБитыхСсылок", "");
		//КонецЕсли;
		//Обработка результатов автоакцепта
		ПакетыРезультата = Запрос.ВыполнитьПакет();
		ТекстЗапросаДляОтладки = ТекстЗапросаДляОтладки + Запрос.Текст;
		КоличествоПакетов = ПакетыРезультата.Количество();
		ВыборкаАвтоакцепта = ПакетыРезультата[КоличествоПакетов-3].Выбрать();
		ТаблицаАвтоакцепта = ПакетыРезультата[КоличествоПакетов-2].Выгрузить();
		ТаблицаНайденныхСделок = ПакетыРезультата[КоличествоПакетов-1].Выгрузить();
		// Евросиб US 94184 TA 98095 Рыбьяков К.А. 14.03.2025 ((
		СоответствиеПриоритетов = ПриоритетныйИсточникАвторазнесения();
		// Евросиб Рыбьяков К.А. 14.03.2025 ))
		Пока ВыборкаАвтоакцепта.СледующийПоЗначениюПоля("ГУИД") Цикл
			СтрокаАкцепта = Акцепт.Услуги.Найти(ВыборкаАвтоакцепта.ГУИД, "ГУИД");
			Пока ВыборкаАвтоакцепта.СледующийПоЗначениюПоля("Приоритет") Цикл
				Если ВыборкаАвтоакцепта.КоличествоПодобранныхСтрок = 1
					И НЕ ВыборкаАвтоакцепта.ИспользоватьРезультатДляПричиныНеурега Тогда  
					//доп. проверка
					СтрокаТаблицыАвтоакцепта = ТаблицаАвтоакцепта.НайтиСтроки(Новый Структура("ГУИД, Приоритет", ВыборкаАвтоакцепта.ГУИД, ВыборкаАвтоакцепта.Приоритет))[0];
					Если СтрокаТаблицыАвтоакцепта.ПоискПревышениеСуммы = Перечисления.ВидыПоискаАвтоакцепт.ДополнительныйПоиск 
						И СтрокаТаблицыАвтоакцепта.СуммаРасходПлан < СтрокаТаблицыАвтоакцепта.СуммаДляОтбора Тогда
						ЗаполнитьПричиныИКомментарииНеурега(СтрокаАкцепта, СтрокаТаблицыАвтоакцепта, Справочники.ПричиныНеурегулированныхРасходов.ФактПревышаетПланВНесколькоРаз);	
						Прервать;
					КонецЕсли;
					СтрокаАкцепта.Сделка = СтрокаТаблицыАвтоакцепта.Сделка;
					СтрокаАкцепта.ИдентификаторСтрокиРасходовВСделке = СтрокаТаблицыАвтоакцепта.ГУИДРасходов;
					СтрокаАкцепта.ПолностьюРазнесено = НЕ СтрокаТаблицыАвтоакцепта.РазрешитьМногократноеРазнесение;
					СтрокаАкцепта.Неурег = Неопределено;
					СтрокаАкцепта.НеурегКомментарий = ?(РежимБитыеСсылки, СтрокаТаблицыАвтоакцепта.РежимИсправления, "");
				ИначеЕсли ВыборкаАвтоакцепта.КоличествоПодобранныхСтрок = 0 Тогда
					СтрокаТаблицыАвтоакцепта = ТаблицаАвтоакцепта.НайтиСтроки(Новый Структура("ГУИД, Приоритет", ВыборкаАвтоакцепта.ГУИД, ВыборкаАвтоакцепта.Приоритет))[0];
					ЗаполнитьПричиныИКомментарииНеурега(СтрокаАкцепта, СтрокаТаблицыАвтоакцепта);
				ИначеЕсли ВыборкаАвтоакцепта.КоличествоПодобранныхСтрок > 1 
					И НЕ ВыборкаАвтоакцепта.ИспользоватьРезультатДляПричиныНеурега Тогда
					//Евросиб - АСуслов 12.10.2023 16:20:59 #69742
					//(   
					Если ВыборкаАвтоакцепта.ВыбиратьпоРазницеСумм Тогда           
						СтруктураПоискаНайденныхСделок = Новый Структура("ГУИД, Приоритет, РасхождениеСумм",
															ВыборкаАвтоакцепта.ГУИД, ВыборкаАвтоакцепта.Приоритет, ВыборкаАвтоакцепта.РасхождениеСумм);
						СтрокиТаблицыАвтоакцепта = ТаблицаАвтоакцепта.НайтиСтроки(СтруктураПоискаНайденныхСделок);
						Если СтрокиТаблицыАвтоакцепта.Количество() = 1 Тогда
							СтрокаТаблицыАвтоакцепта = СтрокиТаблицыАвтоакцепта[0];
							СтрокаАкцепта.Сделка = СтрокаТаблицыАвтоакцепта.Сделка;
							СтрокаАкцепта.ИдентификаторСтрокиРасходовВСделке = СтрокаТаблицыАвтоакцепта.ГУИДРасходов;
							СтрокаАкцепта.ПолностьюРазнесено = НЕ СтрокаТаблицыАвтоакцепта.РазрешитьМногократноеРазнесение;
							СтрокаАкцепта.Неурег = Неопределено;
							СтрокаАкцепта.НеурегКомментарий = "";
							Прервать;
						Иначе
							СтрокиНайденныхСделок = ТаблицаНайденныхСделок.НайтиСтроки(СтруктураПоискаНайденныхСделок);
							МассивОбязательныхПолей = ПолучитьМассивОбязательныхПолей(СтрокиТаблицыАвтоакцепта[0]);
							СтрокиНайденныхСделок = ТаблицаНайденныхСделок.НайтиСтроки(СтруктураПоискаНайденныхСделок);
							МассивСделок = Новый Массив;
							Для каждого СтрокаНайденнаяСделка Из СтрокиНайденныхСделок Цикл
								МассивСделок.Добавить(СтрокаНайденнаяСделка.Сделка);
							КонецЦикла; 
							РеквизитыСделок = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивСделок, "Номер, Дата");
							МассивПредставленийСделок = Новый Массив;
							Для каждого РеквизитыСделки Из РеквизитыСделок Цикл
								МассивПредставленийСделок.Добавить(СтрШаблон("%1/%2", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(РеквизитыСделки.Значение.Номер), Формат(РеквизитыСделки.Значение.Дата,"ДФ=yyyy")));
							КонецЦикла;
							СтрокаАкцепта.Неурег = Справочники.ПричиныНеурегулированныхРасходов.НайденоНесколькоСтрокРасходовВСделкахСУчетомРазностиСумм;
							ТекстПричиныНеурега = СтрШаблон("Поля для поиска: %1.
							|Найденные сделки: %2. Авторазнесение невозможно", СтрСоединить(МассивОбязательныхПолей, "/"),СтрСоединить(МассивПредставленийСделок, ";"));
							СтрокаАкцепта.НеурегКомментарий = ТекстПричиныНеурега;
							Продолжить;
						КонецЕсли;
					КонецЕсли;
					//)
					//Евросиб - АСуслов 12.10.2023 16:21:01 #69742 
					
					#Область РежимБитыеСсылки
					Если РежимБитыеСсылки Тогда
						//ищем гуид + пту = пту из акцепта
						СтруктураПоиска = Новый Структура("ГУИД, УчДокумент", ВыборкаАвтоакцепта.ГУИД, Акцепт.Поступление);
						СтрокиАвтоакцепта = ТаблицаАвтоакцепта.НайтиСтроки(СтруктураПоиска);
						Если ЗначениеЗаполнено(СтрокиАвтоакцепта) Тогда
							СтрокаАвтоакцепта = СтрокиАвтоакцепта[0];
						Иначе
							//ищем гуид + пту = пустой пту
							СтруктураПоиска = Новый Структура("ГУИД, УчДокумент", ВыборкаАвтоакцепта.ГУИД, Документы.ПоступлениеТоваровУслуг.ПустаяСсылка());
							СтрокиАвтоакцепта = ТаблицаАвтоакцепта.НайтиСтроки(СтруктураПоиска);
							Если ЗначениеЗаполнено(СтрокиАвтоакцепта) Тогда
								СтрокаАвтоакцепта = СтрокиАвтоакцепта[0];
							Иначе
								Если ВыборкаАвтоакцепта.ВозможноПовторноеРазнесение Тогда
									//ищем гуид + пту = пустой пту
									СтруктураПоиска = Новый Структура("ГУИД, НеПустойИНеРазносимыйПТУ", Истина);
									СтрокиАвтоакцепта = ТаблицаАвтоакцепта.НайтиСтроки(СтруктураПоиска);
									Если ЗначениеЗаполнено(СтрокиАвтоакцепта) Тогда
										СтрокаАвтоакцепта = СтрокиАвтоакцепта[0];
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
						Если ЗначениеЗаполнено(СтрокаАвтоакцепта) Тогда
							СтрокаАкцепта.Сделка = СтрокаАвтоакцепта.Сделка;
							СтрокаАкцепта.ИдентификаторСтрокиРасходовВСделке = СтрокаАвтоакцепта.ГУИДРасходов;
							СтрокаАкцепта.ПолностьюРазнесено = Истина;
							СтрокаАкцепта.Неурег = Неопределено;
							СтрокаАкцепта.НеурегКомментарий = СтрокаАвтоакцепта.РежимИсправления;
							//Евросиб - АСуслов 29.08.2022 14:15:27 #56528
							//(
							СтрокаАкцепта.ПричинаОтключенияСтрокиВСделке = Неопределено;
							//)
							//Евросиб - АСуслов 29.08.2022 14:15:29 #56528
							Продолжить;
						КонецЕсли;
					КонецЕсли;
					#КонецОбласти
					// Евросиб US 94184 TA 98095 Рыбьяков К.А. 14.03.2025 ((
					СтруктураПоискаНайденныхСделок = Новый Структура("ГУИД, Приоритет", ВыборкаАвтоакцепта.ГУИД, ВыборкаАвтоакцепта.Приоритет);
					СтрокиТаблицыАвтоакцепта = ТаблицаАвтоакцепта.НайтиСтроки(СтруктураПоискаНайденныхСделок);
					СтрокаРезультат = Неопределено;
					МинимальныйПриоритет = 100;
					Для Каждого СтрокаАвтоакцепта Из СтрокиТаблицыАвтоакцепта Цикл
						Источник = СтрокаАвтоакцепта.ИсточникПоявленияСтрокиЭкономики;
						ТекущийПриоритет = СоответствиеПриоритетов.Получить(Источник);
						Если ТекущийПриоритет <> Неопределено Тогда
							Если ТекущийПриоритет <= МинимальныйПриоритет Тогда
								МинимальныйПриоритет = ТекущийПриоритет;
								СтрокаРезультат = СтрокаАвтоакцепта;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					Если СтрокаРезультат <> Неопределено Тогда
						СтрокаАкцепта.Сделка = СтрокаРезультат.Сделка;
						СтрокаАкцепта.ИдентификаторСтрокиРасходовВСделке = СтрокаРезультат.ГУИДРасходов;
						СтрокаАкцепта.ПолностьюРазнесено = НЕ СтрокаРезультат.РазрешитьМногократноеРазнесение;
						СтрокаАкцепта.Неурег = Неопределено;
						СтрокаАкцепта.НеурегКомментарий = ?(РежимБитыеСсылки, СтрокаРезультат.РежимИсправления, "");
					Иначе
						СтрокиТаблицыАвтоакцепта = ТаблицаАвтоакцепта.НайтиСтроки(СтруктураПоискаНайденныхСделок)[0];
						МассивОбязательныхПолей = ПолучитьМассивОбязательныхПолей(СтрокаТаблицыАвтоакцепта);
						СтрокиНайденныхСделок = ТаблицаНайденныхСделок.НайтиСтроки(СтруктураПоискаНайденныхСделок);
						МассивСделок = Новый Массив;
						Для каждого СтрокаНайденнаяСделка Из СтрокиНайденныхСделок Цикл
							МассивСделок.Добавить(СтрокаНайденнаяСделка.Сделка);
						КонецЦикла; 
						РеквизитыСделок = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивСделок, "Номер, Дата");
						МассивПредставленийСделок = Новый Массив;
						Для каждого РеквизитыСделки Из РеквизитыСделок Цикл
							МассивПредставленийСделок.Добавить(СтрШаблон("%1/%2", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(РеквизитыСделки.Значение.Номер), Формат(РеквизитыСделки.Значение.Дата,"ДФ=yyyy")));
						КонецЦикла;
						СтрокаАкцепта.Неурег = Справочники.ПричиныНеурегулированныхРасходов.НайденоНесколькоСтрокРасходовВСделках;
						ТекстПричиныНеурега = СтрШаблон("Поля для поиска: %1.
							|Найденные сделки: %2. Авторазнесение невозможно", СтрСоединить(МассивОбязательныхПолей, "/"),СтрСоединить(МассивПредставленийСделок, ";"));
						СтрокаАкцепта.НеурегКомментарий = ТекстПричиныНеурега;
					КонецЕсли;
					// Евросиб Рыбьяков К.А. 14.03.2025 ))
					// Евросиб US 94184 TA 98095 Рыбьяков К.А. 14.03.2025 (( Закомментировал
					//СтруктураПоискаНайденныхСделок = Новый Структура("ГУИД, Приоритет", ВыборкаАвтоакцепта.ГУИД, ВыборкаАвтоакцепта.Приоритет);
					//СтрокиТаблицыАвтоакцепта = ТаблицаАвтоакцепта.НайтиСтроки(СтруктураПоискаНайденныхСделок);[0];
					//МассивОбязательныхПолей = ПолучитьМассивОбязательныхПолей(СтрокаТаблицыАвтоакцепта);
					//СтрокиНайденныхСделок = ТаблицаНайденныхСделок.НайтиСтроки(СтруктураПоискаНайденныхСделок);
					//МассивСделок = Новый Массив;
					//Для каждого СтрокаНайденнаяСделка Из СтрокиНайденныхСделок Цикл
					//	МассивСделок.Добавить(СтрокаНайденнаяСделка.Сделка);
					//КонецЦикла; 
					//РеквизитыСделок = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивСделок, "Номер, Дата");
					//МассивПредставленийСделок = Новый Массив;
					//Для каждого РеквизитыСделки Из РеквизитыСделок Цикл
					//	МассивПредставленийСделок.Добавить(СтрШаблон("%1/%2", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(РеквизитыСделки.Значение.Номер), Формат(РеквизитыСделки.Значение.Дата,"ДФ=yyyy")));
					//КонецЦикла;
					//СтрокаАкцепта.Неурег = Справочники.ПричиныНеурегулированныхРасходов.НайденоНесколькоСтрокРасходовВСделках;
					//ТекстПричиныНеурега = СтрШаблон("Поля для поиска: %1.
					//|Найденные сделки: %2. Авторазнесение невозможно", СтрСоединить(МассивОбязательныхПолей, "/"),СтрСоединить(МассивПредставленийСделок, ";"));
					//СтрокаАкцепта.НеурегКомментарий = ТекстПричиныНеурега;
					// Евросиб Рыбьяков К.А. 13.03.2025 ))
				ИначеЕсли ВыборкаАвтоакцепта.ИспользоватьРезультатДляПричиныНеурега Тогда
					Продолжить;
				КонецЕсли;
				Прервать;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли; 
	//Вывод ошибок по строкам, которые не попали в автоакцепт
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	ВТ_ТаблицаПричинНеурегов.ГУИД КАК ГУИД,
	|	ВТ_ТаблицаПричинНеурегов.Приоритет КАК Приоритет,
	|	ВТ_ТаблицаПричинНеурегов.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаПричинНеурегов.Контейнер КАК Контейнер,
	|	ВТ_ТаблицаПричинНеурегов.Вагон КАК Вагон,
	|	ВТ_ТаблицаПричинНеурегов.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	ВТ_ТаблицаПричинНеурегов.СтанцияОтправления КАК СтанцияОтправления,
	|	ВТ_ТаблицаПричинНеурегов.СтанцияНазначения КАК СтанцияНазначения,
	|	ВТ_ТаблицаПричинНеурегов.КлиентРасхода КАК КлиентРасхода,
	|	ВТ_ТаблицаПричинНеурегов.НачалоОказанияУслуги КАК НачалоОказанияУслуги,
	|	ВТ_ТаблицаПричинНеурегов.ОкончаниеОказанияУслуги КАК ОкончаниеОказанияУслуги,
	|	ВТ_ТаблицаПричинНеурегов.КонтейнерДляОтбора КАК КонтейнерДляОтбора,
	|	ВТ_ТаблицаПричинНеурегов.ВагонДляОтбора КАК ВагонДляОтбора,
	|	ВТ_ТаблицаПричинНеурегов.ТранспортныйДокументДляОтбора КАК ТранспортныйДокументДляОтбора,
	//|	ВТ_ТаблицаПричинНеурегов.СтанцияОтправленияДляОтбора КАК СтанцияОтправленияДляОтбора,
	//|	ВТ_ТаблицаПричинНеурегов.СтанцияНазначенияДляОтбора КАК СтанцияНазначенияДляОтбора,
	|	ВТ_ТаблицаПричинНеурегов.ЛокацияОтправленияДляОтбора КАК ЛокацияОтправленияДляОтбора,
	|	ВТ_ТаблицаПричинНеурегов.ЛокацияНазначенияДляОтбора КАК ЛокацияНазначенияДляОтбора,
	|	ВТ_ТаблицаПричинНеурегов.НачалоОказанияУслугиДляОтбора КАК НачалоОказанияУслугиДляОтбора,
	|	ВТ_ТаблицаПричинНеурегов.ОкончаниеОказанияУслугиДляОтбора КАК ОкончаниеОказанияУслугиДляОтбора,
	|	ВТ_ТаблицаПричинНеурегов.ЗаполненКонтейнерДляОтбора КАК ЗаполненКонтейнерДляОтбора,
	|	ВТ_ТаблицаПричинНеурегов.ЗаполненВагонДляОтбора КАК ЗаполненВагонДляОтбора,
	|	ВТ_ТаблицаПричинНеурегов.ЗаполненТранспортныйДокументДляОтбора КАК ЗаполненТранспортныйДокументДляОтбора,
	//|	ВТ_ТаблицаПричинНеурегов.ЗаполненСтанцияОтправленияДляОтбора КАК ЗаполненСтанцияОтправленияДляОтбора,
	//|	ВТ_ТаблицаПричинНеурегов.ЗаполненСтанцияНазначенияДляОтбора КАК ЗаполненСтанцияНазначенияДляОтбора,
	|	ВТ_ТаблицаПричинНеурегов.ЗаполненЛокацияОтправленияДляОтбора КАК ЗаполненЛокацияОтправленияДляОтбора,
	|	ВТ_ТаблицаПричинНеурегов.ЗаполненЛокацияНазначенияДляОтбора КАК ЗаполненЛокацияНазначенияДляОтбора,
	|	ВТ_ТаблицаПричинНеурегов.ЗаполненПериодОказанияУслугиДляОтбора КАК ЗаполненПериодОказанияУслугиДляОтбора,
	//|	ВТ_ТаблицаПричинНеурегов.ЗаполненПунктыОтправленияНазначенияДляОтбора КАК ЗаполненПунктыОтправленияНазначенияДляОтбора,
	|	ВТ_ТаблицаПричинНеурегов.ЗаполненКлиентДляОтбора КАК ЗаполненКлиентДляОтбора,
	|	ВТ_ТаблицаПричинНеурегов.ЗаполненСуммаДляОтбора КАК ЗаполненСуммаДляОтбора,
	|	ВТ_ТаблицаПричинНеурегов.ЗаполненПоставщикДляОтбора КАК ЗаполненПоставщикДляОтбора
	|ИЗ
	|	ВТ_СтрокиДляПричинНеурегов КАК ВТ_ТаблицаПричинНеурегов
	|ГДЕ
	|	ВТ_ТаблицаПричинНеурегов.ИспользоватьРезультатДляПричиныНеурега = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГУИД,
	|	Приоритет";
	ВыборкаПричинНеурегов = Запрос.Выполнить().Выбрать();
	Пока ВыборкаПричинНеурегов.СледующийПоЗначениюПоля("ГУИД") Цикл
		СтрокаАкцепта = Акцепт.Услуги.Найти(ВыборкаПричинНеурегов.ГУИД, "ГУИД"); 
		Пока ВыборкаПричинНеурегов.СледующийПоЗначениюПоля("Приоритет") Цикл
			МассивОбязательныхПолей = ПолучитьМассивОбязательныхПолей(ВыборкаПричинНеурегов, Истина, Истина);
			ТекстПричиныНеурега = СтрШаблон("Не заполнены поля: %1. Авторазнесение невозможно", СтрСоединить(МассивОбязательныхПолей, "/"));
			СтрокаАкцепта.Неурег = Справочники.ПричиныНеурегулированныхРасходов.НеЗаполненыОбязательныеПоляВАкцепте;
			СтрокаАкцепта.НеурегКомментарий = ТекстПричиныНеурега;
			Прервать
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры  


//Евросиб Каблов 02.08.2023 #64831
Процедура ВыполнитьАвторазнесениеАкцептаНаПрямые(Акцепт, Сделки) Экспорт
	
	ПустаяДата = '00010101';
	
	//Разделение строк
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АкцептУслуги.НомерСтроки КАК НомерСтроки,
	|	АкцептУслуги.ГУИД КАК ГУИД,
	|	АкцептУслуги.Номенклатура КАК Номенклатура,
	|	АкцептУслуги.Неурег КАК Неурег,
	|	АкцептУслуги.ПричинаНеакцепта КАК ПричинаНеакцепта,
	|	АкцептУслуги.СтатусПричины КАК СтатусПричины,
	|	АкцептУслуги.Контейнер КАК Контейнер,
	|	АкцептУслуги.Вагон КАК Вагон,
	|	АкцептУслуги.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	АкцептУслуги.ДатаОтправленияКП КАК ДатаОтправленияКП,
	|	АкцептУслуги.ПоступлениеСуммаНДС КАК ПоступлениеСуммаНДС,
	|	АкцептУслуги.ПоступлениеСумма КАК ПоступлениеСумма,
	|	АкцептУслуги.СтанцияОтправления КАК СтанцияОтправления,
	|	АкцептУслуги.СтанцияНазначения КАК СтанцияНазначения,
	|	АкцептУслуги.Рейс КАК Рейс
	|ПОМЕСТИТЬ ВТ_АкцептУслуги
	|ИЗ
	|	Документ.Акцепт.Услуги КАК АкцептУслуги
	|ГДЕ
	|	АкцептУслуги.Сделка = ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
	|	И АкцептУслуги.Ссылка = &Акцепт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АкцептУслуги.НомерСтроки КАК НомерСтроки,
	|	ВТ_АкцептУслуги.ГУИД КАК ГУИД,
	|	ВТ_АкцептУслуги.Номенклатура КАК Номенклатура,
	|	ВТ_АкцептУслуги.Контейнер КАК Контейнер,
	|	ВТ_АкцептУслуги.Вагон КАК Вагон,
	|	ВТ_АкцептУслуги.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	ВТ_АкцептУслуги.ДатаОтправленияКП КАК ДатаОтправленияКП,
	|	ВТ_АкцептУслуги.ПоступлениеСуммаНДС КАК ПоступлениеСуммаНДС,
	|	ВТ_АкцептУслуги.ПоступлениеСумма КАК ПоступлениеСумма,
	|	ВТ_АкцептУслуги.СтанцияОтправления КАК СтанцияОтправления,
	|	ВТ_АкцептУслуги.СтанцияНазначения КАК СтанцияНазначения,
	|	ВТ_АкцептУслуги.Рейс КАК Рейс
	|ПОМЕСТИТЬ УслугиДляРазнесения
	|ИЗ
	|	ВТ_АкцептУслуги КАК ВТ_АкцептУслуги
	|ГДЕ
	|	ВТ_АкцептУслуги.Номенклатура.РазноситьНаПрямые
	|	И ВТ_АкцептУслуги.Неурег <> ЗНАЧЕНИЕ(Справочник.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ)
	|	И ВТ_АкцептУслуги.Рейс <> ЗНАЧЕНИЕ(Справочник.РейсыЖД.ПустаяСсылка)
	//Евросиб Каблов 02.12.2024 ( #94191
	|   И ВТ_АкцептУслуги.Неурег <> Значение(Справочник.ПричиныНеурегулированныхРасходов.НеЗаполненыОбязательныеПоляВАкцепте)
	//Евросиб Каблов 02.12.2024 )
	//Евросиб Каблов 17.01.2024 ( #79488
	|	И НЕ (ВТ_АкцептУслуги.ПричинаНеакцепта <> ЗНАЧЕНИЕ(Справочник.Претензии.ПустаяСсылка) И ВТ_АкцептУслуги.СтатусПричины <> ЗНАЧЕНИЕ(Перечисление.СтатусыПричинНеакцепта.Откз))
	//Евросиб Каблов 17.01.2024 )
	|	И ВТ_АкцептУслуги.Номенклатура.СпособРазнесения = &СпособРазнесенияРаспределитьРасходыМеждуКлиентами
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиДляРазнесения.НомерСтроки КАК НомерСтроки,
	|	УслугиДляРазнесения.ГУИД КАК ГУИД,
	|	УслугиДляРазнесения.Номенклатура КАК Номенклатура,
	|	УслугиДляРазнесения.Контейнер КАК Контейнер,
	|	УслугиДляРазнесения.Вагон КАК Вагон,
	|	УслугиДляРазнесения.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	УслугиДляРазнесения.ДатаОтправленияКП КАК ДатаОтправленияКП,
	|	УслугиДляРазнесения.ПоступлениеСуммаНДС КАК ПоступлениеСуммаНДС,
	|	УслугиДляРазнесения.ПоступлениеСумма КАК ПоступлениеСумма,
	|	УслугиДляРазнесения.СтанцияОтправления КАК СтанцияОтправления,
	|	УслугиДляРазнесения.СтанцияНазначения КАК СтанцияНазначения,
	|	УслугиДляРазнесения.Рейс КАК Рейс,
	|	УслугиДляРазнесения.Рейс.Наименование КАК НаименованиеРейса
	|ИЗ
	|	УслугиДляРазнесения КАК УслугиДляРазнесения
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиДляРазнесения.НомерСтроки КАК НомерСтрокиАкцепта,
	|	РейсыЖДФактическийСоставПоезда.НомерСтроки КАК НомерСтрокиРейса,
	|	УслугиДляРазнесения.ГУИД КАК ГУИД,
	|	РейсыЖДФактическийСоставПоезда.НомерНакладной КАК НомерНакладной,
	|	ТЕ.Ссылка КАК Контейнер,
	|	ТС.Ссылка КАК Вагон,
	|	РейсыЖД.ПунктОтправления КАК СтанцияОтправления,
	|	РейсыЖД.ПунктНазначения КАК СтанцияНазначения,
	|	РейсыЖД.ДатаОтправления КАК НачалоОказанияУслуги,
	|	РейсыЖД.ДатаПрибытия КАК ОкончаниеОказанияУслуги
	|ИЗ
	|	УслугиДляРазнесения КАК УслугиДляРазнесения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РейсыЖД.ФактическийСоставПоезда КАК РейсыЖДФактическийСоставПоезда
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТС КАК ТС
	|			ПО РейсыЖДФактическийСоставПоезда.НомерВагона = ТС.Наименование
	|				И (РейсыЖДФактическийСоставПоезда.НомерВагона <> """")
	|		ПО УслугиДляРазнесения.Рейс = РейсыЖДФактическийСоставПоезда.Ссылка
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
	//|		ПО (ПОДСТРОКА(РейсыЖДФактическийСоставПоезда.НомерКонтейнера, 1, 4) = ТЕ.Префикс)
	//|			И (ПОДСТРОКА(РейсыЖДФактическийСоставПоезда.НомерКонтейнера, 5, 6) = ТЕ.Номер)
	//ДИТ, Беляев СЮ, BUG 79423/ TASK 79490, 17-01-2024, начало
	|			И РейсыЖДФактическийСоставПоезда.НомерКонтейнера <> """"
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
	|		ПО (ПОДСТРОКА(РейсыЖДФактическийСоставПоезда.НомерКонтейнера, 1, 4) = ТЕ.Префикс)
	|			И (ПОДСТРОКА(РейсыЖДФактическийСоставПоезда.НомерКонтейнера, 5, 6) = ТЕ.Номер)
	|			И НЕ ТЕ.ПометкаУдаления
	//ДИТ, Беляев СЮ, BUG 79423/ TASK 79490, 17-01-2024, конец
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РейсыЖД КАК РейсыЖД
	|		ПО УслугиДляРазнесения.Рейс = РейсыЖД.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтрокиАкцепта,
	|	НомерСтрокиРейса";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Акцепт.Услуги КАК АкцептУслуги", "&АкцептУслуги КАК АкцептУслуги");	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "АкцептУслуги.Ссылка = &Акцепт", "ИСТИНА");
	
	Запрос.УстановитьПараметр("Поступление", Акцепт.Поступление);
	
	//Евросиб Каблов 10.01.2024 ( #99682
	//ТаблицаУслуг = Акцепт.Услуги.Выгрузить(Новый Структура("Сделка", Документы.Сделка.ПустаяСсылка()));
	ТаблицаУслуг = Акцепт.Услуги.ВыгрузитьКолонки();
	СписокНоменклатуры = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Акцепт.Услуги.ВыгрузитьКолонку("Номенклатура"));
	СоответствиеМассивовСписокОбязательныхПолейВАкцепте = Документы.Акцепт.ПолучитьСоответствиеМассивовСписокОбязательныхПолейВАкцептеПоСпискуНоменклатуры(СписокНоменклатуры);
	Для каждого СтрокаАкцепта Из Акцепт.Услуги Цикл
		
		Если СтрокаАкцепта.Неурег = Справочники.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ
			ИЛИ ЗначениеЗаполнено(СтрокаАкцепта.Сделка) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаУслуга = ТаблицаУслуг.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаУслуга, СтрокаАкцепта);
		
		МассивСписокОбязательныхПолейВАкцепте = СоответствиеМассивовСписокОбязательныхПолейВАкцепте.Получить(СтрокаУслуга.Номенклатура);
		НезаполненныеОбязательныеПоля = Новый Массив;
		Для каждого ИмяОбязательногоПоляВАкцепте Из МассивСписокОбязательныхПолейВАкцепте Цикл
			Если Не ЗначениеЗаполнено(СтрокаУслуга[ИмяОбязательногоПоляВАкцепте]) Тогда
				НезаполненныеОбязательныеПоля.Добавить(ИмяОбязательногоПоляВАкцепте);
			КонецЕсли;
		КонецЦикла;
		Если ЗначениеЗаполнено(НезаполненныеОбязательныеПоля) Тогда
			СтрокаУслуга.Неурег = Справочники.ПричиныНеурегулированныхРасходов.НеЗаполненыОбязательныеПоляВАкцепте;
			ТекстПричиныНеурега = СтрШаблон("Не заполнены поля: %1. Авторазнесение невозможно", СтрСоединить(НезаполненныеОбязательныеПоля, ", "));
			СтрокаУслуга.НеурегКомментарий = ТекстПричиныНеурега;
			Продолжить;
		ИначеЕсли СтрокаУслуга.Неурег = Справочники.ПричиныНеурегулированныхРасходов.НеЗаполненыОбязательныеПоляВАкцепте Тогда
			СтрокаУслуга.Неурег = Справочники.ПричиныНеурегулированныхРасходов.ПустаяСсылка();
			СтрокаУслуга.НеурегКомментарий = "";
		КонецЕсли;
	КонецЦикла;
	//Евросиб Каблов 10.01.2024 )
	
	Запрос.УстановитьПараметр("АкцептУслуги", ТаблицаУслуг);	
	Запрос.УстановитьПараметр("СпособРазнесенияРаспределитьРасходыМеждуКлиентами", Перечисления.СпособыРазнесенияРасходов.РаспределитьРасходыМеждуКлиентами);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();	
	КоличествоЗапросов = РезультатыЗапроса.Количество();
	ТаблицаАкцепта = РезультатыЗапроса[КоличествоЗапросов - 2].Выгрузить();
	
	Если ЗначениеЗаполнено(ТаблицаАкцепта) Тогда
		
		ТаблицаКТК = РезультатыЗапроса[КоличествоЗапросов - 1].Выгрузить();
		
		ТаблицаДляПоискаТД = Новый ТаблицаЗначений;
		ТаблицаДляПоискаТД.Колонки.Добавить("НомерТранспортногоДокумента", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
		ТаблицаДляПоискаТД.Колонки.Добавить("Поступление", Новый ОписаниеТипов("ДокументСсылка.ПоступлениеТоваровУслуг"));
		ТаблицаДляПоискаТД.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТаблицаДляПоискаТД.Колонки.Добавить("ТранспортныйДокумент", Новый ОписаниеТипов("ДокументСсылка.ТранспортныйДокумент"));
		ТаблицаДляПоискаТД.Колонки.Добавить("ИдентификаторСтроки", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(36)));
		
		Для Каждого СтрокаТаблицыАкцепта Из ТаблицаАкцепта Цикл
			
			ИсходнаяСтрокаАкцепта = Акцепт.Услуги.Найти(СтрокаТаблицыАкцепта.ГУИД, "ГУИД");
			ИндексНовойСтроки = Акцепт.Услуги.Индекс(ИсходнаяСтрокаАкцепта);
			
			СтрокиТаблицыКТК = ТаблицаКТК.НайтиСтроки(Новый Структура("ГУИД", СтрокаТаблицыАкцепта.ГУИД));
			Если ЗначениеЗаполнено(СтрокиТаблицыКТК) Тогда
				
				КоличествоСтрокКТК = СтрокиТаблицыКТК.Количество();
				СуммаОстаток = СтрокаТаблицыАкцепта.ПоступлениеСумма;
				СуммаНДСОстаток = СтрокаТаблицыАкцепта.ПоступлениеСуммаНДС;
				Сумма = Окр(СтрокаТаблицыАкцепта.ПоступлениеСумма / КоличествоСтрокКТК, 2);
				СуммаНДС = Окр(СтрокаТаблицыАкцепта.ПоступлениеСуммаНДС / КоличествоСтрокКТК, 2);
				
				Для Каждого СтрокаТаблицыКТК Из СтрокиТаблицыКТК Цикл
					
					НоваяСтрока = Акцепт.Услуги.Вставить(ИндексНовойСтроки);
					
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ИсходнаяСтрокаАкцепта,, "ГУИД, Рейс");
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицыКТК,, "ГУИД");
					НоваяСтрока.ГУИД = Новый УникальныйИдентификатор;
					
					//СуммаПоСтроке = Мин(Сумма, СуммаОстаток);
					//СуммаНДСПоСтроке = Мин(СуммаНДС, СуммаНДСОстаток);
					
					НоваяСтрока.ПоступлениеКоличество = 1;				
					НоваяСтрока.ПоступлениеСумма = Сумма;
					НоваяСтрока.ПоступлениеЦена = Сумма;				
					НоваяСтрока.ПоступлениеСуммаНДС = СуммаНДС;
					
					СуммаОстаток = СуммаОстаток - Сумма;
					СуммаНДСОстаток = СуммаНДСОстаток - СуммаНДС;
					
					ИндексНовойСтроки = ИндексНовойСтроки + 1;
					
					Если ЗначениеЗаполнено(СтрокаТаблицыКТК.НомерНакладной) Тогда
						СтрокаТД = ТаблицаДляПоискаТД.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаТД, НоваяСтрока);
						СтрокаТД.ИдентификаторСтроки = НоваяСтрока.ГУИД;
						СтрокаТД.Поступление = Акцепт.Поступление;
						СтрокаТД.НомерТранспортногоДокумента = СтрокаТаблицыКТК.НомерНакладной;
					КонецЕсли;
					
				КонецЦикла;
				
				Если СуммаОстаток <> 0 Тогда
					НоваяСтрока.ПоступлениеСумма = НоваяСтрока.ПоступлениеСумма + СуммаОстаток;
					НоваяСтрока.ПоступлениеЦена = НоваяСтрока.ПоступлениеСумма;
				КонецЕсли;
				
				Если СуммаНДСОстаток <> 0 Тогда
					НоваяСтрока.ПоступлениеСуммаНДС = НоваяСтрока.ПоступлениеСуммаНДС + СуммаНДСОстаток;
				КонецЕсли;
				
				ИндексИсходнойСтроки = Акцепт.Услуги.Индекс(ИсходнаяСтрокаАкцепта);
				Акцепт.Услуги.Удалить(ИндексИсходнойСтроки);
				
			Иначе
				
				ИсходнаяСтрокаАкцепта.Неурег = Справочники.ПричиныНеурегулированныхРасходов.НетКТКвРейсе;
				ИсходнаяСтрокаАкцепта.НеурегКомментарий = СтрШаблон("В ""%1"" отсутствуют КТК. Разнесение на прямые невозможно.", СтрокаТаблицыАкцепта.НаименованиеРейса);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ТаблицаДляПоискаТД) Тогда
			ТранспортныеДокументы_сервер.ЗаполнитьТранспортныеДокументы(Новый Структура("Режим, ТаблицаДанных, Поступление", "ПроизвольнаяТаблица", ТаблицаДляПоискаТД, Акцепт.Поступление));
			Для Каждого СтрТаблицыТД Из ТаблицаДляПоискаТД Цикл
				СтрокаАкцепта = Акцепт.Услуги.Найти(СтрТаблицыТД.ИдентификаторСтроки, "ГУИД");
				СтрокаАкцепта.ТранспортныйДокумент = СтрТаблицыТД.ТранспортныйДокумент;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	//Разнесение
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АкцептУслуги.НомерСтроки КАК НомерСтроки,
	|	АкцептУслуги.Номенклатура КАК Номенклатура,
	|	АкцептУслуги.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	АкцептУслуги.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
	|	АкцептУслуги.Количество КАК Количество,
	|	АкцептУслуги.Цена КАК Цена,
	|	АкцептУслуги.СделкаСумма КАК СделкаСумма,
	|	АкцептУслуги.СделкаСтавкаНДС КАК СделкаСтавкаНДС,
	|	АкцептУслуги.СделкаСуммаНДС КАК СделкаСуммаНДС,
	|	АкцептУслуги.Контейнер КАК Контейнер,
	|	АкцептУслуги.Вагон КАК Вагон,
	|	АкцептУслуги.Сделка КАК Сделка,
	|	АкцептУслуги.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке,
	|	АкцептУслуги.НоменклатураСделки КАК НоменклатураСделки,
	|	АкцептУслуги.ВидРасходов КАК ВидРасходов,
	|	АкцептУслуги.НачалоРасчета КАК НачалоРасчета,
	|	АкцептУслуги.ОкончаниеРасчета КАК ОкончаниеРасчета,
	|	АкцептУслуги.НачалоОказанияУслуги КАК НачалоОказанияУслуги,
	|	АкцептУслуги.ОкончаниеОказанияУслуги КАК ОкончаниеОказанияУслуги,
	|	АкцептУслуги.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	АкцептУслуги.ПолностьюРазнесено КАК ПолностьюРазнесено,
	|	АкцептУслуги.ПоступлениеКоличество КАК ПоступлениеКоличество,
	|	АкцептУслуги.ПоступлениеЦена КАК ПоступлениеЦена,
	|	АкцептУслуги.ПоступлениеСумма КАК ПоступлениеСумма,
	|	АкцептУслуги.ПоступлениеСтавкаНДС КАК ПоступлениеСтавкаНДС,
	|	АкцептУслуги.ПоступлениеСуммаНДС КАК ПоступлениеСуммаНДС,
	|	АкцептУслуги.Сумма КАК Сумма,
	|	АкцептУслуги.СуммаНДС КАК СуммаНДС,
	|	АкцептУслуги.ПричинаНеакцепта КАК ПричинаНеакцепта,
	|	АкцептУслуги.СтатусПричины КАК СтатусПричины,
	|	АкцептУслуги.ПоЭтойСтрокеСформированаЧастичнаяПретензия КАК ПоЭтойСтрокеСформированаЧастичнаяПретензия,
	|	АкцептУслуги.ДатаПретензии КАК ДатаПретензии,
	|	АкцептУслуги.ПримечаниеНеакцепта КАК ПримечаниеНеакцепта,
	|	АкцептУслуги.ПодтвержденнаяСумма КАК ПодтвержденнаяСумма,
	|	АкцептУслуги.СуммаПретензии КАК СуммаПретензии,
	|	АкцептУслуги.СтанцияОтправления КАК СтанцияОтправления,
	|	АкцептУслуги.СтанцияНазначения КАК СтанцияНазначения,
	|	АкцептУслуги.Неурег КАК Неурег,
	|	АкцептУслуги.НеурегКомментарий КАК НеурегКомментарий,
	|	АкцептУслуги.Содержание КАК Содержание,
	|	АкцептУслуги.ВесПоНакладной КАК ВесПоНакладной,
	|	АкцептУслуги.ВыгруженаВРИТМ КАК ВыгруженаВРИТМ,
	|	АкцептУслуги.ПодчиненнаяУслуга_АкцептОсновнойУслуги КАК ПодчиненнаяУслуга_АкцептОсновнойУслуги,
	|	АкцептУслуги.УчДокумент КАК УчДокумент,
	|	АкцептУслуги.ПривязалПользователь КАК ПривязалПользователь,
	|	АкцептУслуги.ВидЗатрат КАК ВидЗатрат,
	|	АкцептУслуги.ГУИД КАК ГУИД,
	|	АкцептУслуги.УказаннаяПользователемСделка КАК УказаннаяПользователемСделка,
	|	АкцептУслуги.УдалитьПериодВО КАК УдалитьПериодВО,
	|	АкцептУслуги.ПериодУУ КАК ПериодУУ,
	|	АкцептУслуги.ПричинаОтключенияСтрокиВСделке КАК ПричинаОтключенияСтрокиВСделке,
	|	АкцептУслуги.КлиентРасхода КАК КлиентРасхода,
	|	АкцептУслуги.ПодчиненнаяУслуга_ГУИДСтрокиОснУслуги КАК ПодчиненнаяУслуга_ГУИДСтрокиОснУслуги,
	|	АкцептУслуги.НеурегПричинаУказаннаяПользователем КАК НеурегПричинаУказаннаяПользователем,
	|	АкцептУслуги.Рейс КАК Рейс,
	|	АкцептУслуги.ДатаОтправленияКП КАК ДатаОтправленияКП,
	|	АкцептУслуги.РасходыЗаСчетЧП КАК РасходыЗаСчетЧП
	|ПОМЕСТИТЬ ВТ_АкцептУслуги
	|ИЗ
	|	Документ.Акцепт.Услуги КАК АкцептУслуги
	|ГДЕ
	|	АкцептУслуги.Ссылка = &Акцепт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка,
	|	ПоступлениеТоваровУслуг.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	|	ПоступлениеТоваровУслуг.Контрагент КАК Контрагент,
	|	ПоступлениеТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ПоступлениеТоваровУслуг.ВалютаДокумента КАК ВалютаДокумента
	|ПОМЕСТИТЬ ВТПоступление
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Ссылка = &Поступление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АкцептУслуги.ГУИД КАК ГУИД,
	|	ВТ_АкцептУслуги.Номенклатура КАК Номенклатура,
	|	ВТ_АкцептУслуги.Контейнер КАК Контейнер,
	|	ВТ_АкцептУслуги.Вагон КАК Вагон,
	|	ВТ_АкцептУслуги.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	ВТ_АкцептУслуги.ДатаОтправленияКП КАК ДатаОтправленияКП,
	|	ВТ_АкцептУслуги.Номенклатура.АлгоритмПодбораСделокПоПериоду КАК НоменклатураАлгоритмПодбораСделокПоПериоду,
	|	ВТ_АкцептУслуги.Номенклатура.ИнтервалПериодаОпределенияСделокДоДатыНачалаПеревозки КАК ИнтервалДоДатыНачалаПеревозки,
	|	ВТ_АкцептУслуги.Номенклатура.ИнтервалПериодаОпределенияСделокПослеДатыОкончанияПеревозки КАК ИнтервалПослеДатыОкончанияПеревозки,
	|	ВТ_АкцептУслуги.Номенклатура.РазноситьНаВидТранспортногоСообщения КАК РазноситьНаВидТранспортногоСообщения,
	|	ВТ_АкцептУслуги.Номенклатура.РазрешитьМногократноеРазнесение КАК РазрешитьМногократноеРазнесение,
	|	ВТ_АкцептУслуги.НачалоОказанияУслуги КАК НачалоОказанияУслуги,
	|	ВТ_АкцептУслуги.ОкончаниеОказанияУслуги КАК ОкончаниеОказанияУслуги,
	|	ВТ_АкцептУслуги.ПоступлениеЦена КАК Цена,
	|	ВТ_АкцептУслуги.ПоступлениеКоличество КАК Количество,
	|	ВТ_АкцептУслуги.ПоступлениеСумма КАК Сумма,
	|	ВТ_АкцептУслуги.ПоступлениеСуммаНДС КАК СуммаНДС,
	|	ВТ_АкцептУслуги.СтанцияОтправления КАК СтанцияОтправления,
	|	ВТ_АкцептУслуги.СтанцияНазначения КАК СтанцияНазначения,
	|	ВТПоступление.Ссылка КАК Поступление,
	|	ВТПоступление.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	|	ВТ_АкцептУслуги.ПоступлениеСтавкаНДС КАК СтавкаНДС,
	|	ВТПоступление.Контрагент КАК Поставщик,
	|	ВТПоступление.ДоговорКонтрагента КАК Договор,
	|	ВТПоступление.ВалютаДокумента КАК Валюта
	|ПОМЕСТИТЬ УслугиДляРазнесения
	|ИЗ
	|	ВТ_АкцептУслуги КАК ВТ_АкцептУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоступление КАК ВТПоступление
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ВТ_АкцептУслуги.Номенклатура.РазноситьНаПрямые
	|	И ВТ_АкцептУслуги.Неурег <> ЗНАЧЕНИЕ(Справочник.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ)
	|	И ВТ_АкцептУслуги.Сделка = ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
	|	И ВТ_АкцептУслуги.Рейс = ЗНАЧЕНИЕ(Справочник.РейсыЖД.ПустаяСсылка)
	//Евросиб Каблов 02.12.2024 ( #94191
	|   И ВТ_АкцептУслуги.Неурег <> Значение(Справочник.ПричиныНеурегулированныхРасходов.НеЗаполненыОбязательныеПоляВАкцепте)
	//Евросиб Каблов 02.12.2024 )
	//Евросиб Каблов 17.01.2024 ( #79488
	|	И НЕ (ВТ_АкцептУслуги.ПричинаНеакцепта <> ЗНАЧЕНИЕ(Справочник.Претензии.ПустаяСсылка) И ВТ_АкцептУслуги.СтатусПричины <> ЗНАЧЕНИЕ(Перечисление.СтатусыПричинНеакцепта.Откз))
	//Евросиб Каблов 17.01.2024 )
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиДляРазнесения.ГУИД КАК ГУИД,
	|	УслугиДляРазнесения.Номенклатура КАК Номенклатура,
	|	УслугиДляРазнесения.Контейнер КАК Контейнер,
	|	УслугиДляРазнесения.Вагон КАК Вагон,
	|	УслугиДляРазнесения.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	УслугиДляРазнесения.ДатаОтправленияКП КАК ДатаОтправленияКП,
	|	УслугиДляРазнесения.НоменклатураАлгоритмПодбораСделокПоПериоду КАК НоменклатураАлгоритмПодбораСделокПоПериоду,
	|	УслугиДляРазнесения.ИнтервалДоДатыНачалаПеревозки КАК ИнтервалДоДатыНачалаПеревозки,
	|	УслугиДляРазнесения.ИнтервалПослеДатыОкончанияПеревозки КАК ИнтервалПослеДатыОкончанияПеревозки,
	|	УслугиДляРазнесения.РазноситьНаВидТранспортногоСообщения КАК РазноситьНаВидТранспортногоСообщения,
	|	УслугиДляРазнесения.НачалоОказанияУслуги КАК НачалоОказанияУслуги,
	|	УслугиДляРазнесения.ОкончаниеОказанияУслуги КАК ОкончаниеОказанияУслуги,
	|	КлючиАналитикиСоставаПоезда.Ссылка КАК КлючАналитикиСоставаПоезда,
	|	КлючиАналитикиСоставаПоезда.Сделка КАК Сделка
	|ПОМЕСТИТЬ НайденныеСделки
	|ИЗ
	|	УслугиДляРазнесения КАК УслугиДляРазнесения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиСоставаПоезда КАК КлючиАналитикиСоставаПоезда
	|		ПО (ВЫБОР
	|				КОГДА УслугиДляРазнесения.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	|					ТОГДА УслугиДляРазнесения.Контейнер = КлючиАналитикиСоставаПоезда.Контейнер
	|				КОГДА УслугиДляРазнесения.Вагон <> ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)
	|					ТОГДА УслугиДляРазнесения.Вагон = КлючиАналитикиСоставаПоезда.Вагон
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|			И УслугиДляРазнесения.РазноситьНаВидТранспортногоСообщения = КлючиАналитикиСоставаПоезда.ВидТранспортногоСообщения
	//Евросиб Каблов 28.09.2023 ( #75489
	//|			И (КлючиАналитикиСоставаПоезда.ДатаПрибытия >= УслугиДляРазнесения.ОкончаниеОказанияУслуги
	//|				ИЛИ КлючиАналитикиСоставаПоезда.ДатаПрибытия = ДАТАВРЕМЯ(1, 1, 1))
	//|			И (КлючиАналитикиСоставаПоезда.ДатаОтправления <= КОНЕЦПЕРИОДА(УслугиДляРазнесения.НачалоОказанияУслуги, ДЕНЬ)
	//|				ИЛИ УслугиДляРазнесения.НачалоОказанияУслуги = ДАТАВРЕМЯ(1, 1, 1))
	|			И КлючиАналитикиСоставаПоезда.ДатаПрибытия >= УслугиДляРазнесения.ОкончаниеОказанияУслуги
	|			И КлючиАналитикиСоставаПоезда.ДатаПрибытия <> &ПустаяДата
	|			И (КлючиАналитикиСоставаПоезда.ДатаОтправления <= КОНЕЦПЕРИОДА(УслугиДляРазнесения.НачалоОказанияУслуги, ДЕНЬ)
	|				ИЛИ УслугиДляРазнесения.НачалоОказанияУслуги = &ПустаяДата)
	|			И КлючиАналитикиСоставаПоезда.ДатаОтправления <> &ПустаяДата
	//Евросиб Каблов 28.09.2023 )
	|ГДЕ
	|	УслугиДляРазнесения.НоменклатураАлгоритмПодбораСделокПоПериоду < 2
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УслугиДляРазнесения.ГУИД,
	|	УслугиДляРазнесения.Номенклатура,
	|	УслугиДляРазнесения.Контейнер,
	|	УслугиДляРазнесения.Вагон,
	|	УслугиДляРазнесения.ТранспортныйДокумент,
	|	УслугиДляРазнесения.ДатаОтправленияКП,
	|	УслугиДляРазнесения.НоменклатураАлгоритмПодбораСделокПоПериоду,
	|	УслугиДляРазнесения.ИнтервалДоДатыНачалаПеревозки,
	|	УслугиДляРазнесения.ИнтервалПослеДатыОкончанияПеревозки,
	|	УслугиДляРазнесения.РазноситьНаВидТранспортногоСообщения,
	|	УслугиДляРазнесения.НачалоОказанияУслуги,
	|	УслугиДляРазнесения.ОкончаниеОказанияУслуги,
	|	КлючиАналитикиСоставаПоезда.Ссылка,
	|	КлючиАналитикиСоставаПоезда.Сделка
	|ИЗ
	|	УслугиДляРазнесения КАК УслугиДляРазнесения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиСоставаПоезда КАК КлючиАналитикиСоставаПоезда
	|		ПО (ВЫБОР
	|				КОГДА УслугиДляРазнесения.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	|					ТОГДА УслугиДляРазнесения.Контейнер = КлючиАналитикиСоставаПоезда.Контейнер
	|				КОГДА УслугиДляРазнесения.Вагон <> ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)
	|					ТОГДА УслугиДляРазнесения.Вагон = КлючиАналитикиСоставаПоезда.Вагон
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|			И УслугиДляРазнесения.РазноситьНаВидТранспортногоСообщения = КлючиАналитикиСоставаПоезда.ВидТранспортногоСообщения
	//Евросиб Каблов 28.09.2023 ( #75489
	//|			И (ДОБАВИТЬКДАТЕ(КлючиАналитикиСоставаПоезда.ДатаОтправления, ДЕНЬ, -УслугиДляРазнесения.ИнтервалДоДатыНачалаПеревозки) <= УслугиДляРазнесения.ОкончаниеОказанияУслуги
	//|				ИЛИ УслугиДляРазнесения.ОкончаниеОказанияУслуги = ДАТАВРЕМЯ(1, 1, 1))
	//|			И (ДОБАВИТЬКДАТЕ(КлючиАналитикиСоставаПоезда.ДатаПрибытия, ДЕНЬ, УслугиДляРазнесения.ИнтервалПослеДатыОкончанияПеревозки) >= УслугиДляРазнесения.НачалоОказанияУслуги)
	|			И КлючиАналитикиСоставаПоезда.ДатаОтправления <> &ПустаяДата
	|			И КлючиАналитикиСоставаПоезда.ДатаПрибытия <> &ПустаяДата
	|			И (ДОБАВИТЬКДАТЕ(КлючиАналитикиСоставаПоезда.ДатаОтправления, ДЕНЬ, -УслугиДляРазнесения.ИнтервалДоДатыНачалаПеревозки) <= УслугиДляРазнесения.ОкончаниеОказанияУслуги
	|				ИЛИ УслугиДляРазнесения.ОкончаниеОказанияУслуги = &ПустаяДата)
	|			И (ДОБАВИТЬКДАТЕ(КлючиАналитикиСоставаПоезда.ДатаПрибытия, ДЕНЬ, УслугиДляРазнесения.ИнтервалПослеДатыОкончанияПеревозки) >= УслугиДляРазнесения.НачалоОказанияУслуги)
	//Евросиб Каблов 28.09.2023 ( #75489
	|ГДЕ
	|	УслугиДляРазнесения.НоменклатураАлгоритмПодбораСделокПоПериоду = 2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиДляРазнесения.ГУИД КАК ГУИД,
	|	УслугиДляРазнесения.Номенклатура КАК Услуга,
	|	УслугиДляРазнесения.Контейнер КАК Контейнер,
	|	УслугиДляРазнесения.Вагон КАК Вагон,
	|	УслугиДляРазнесения.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	УслугиДляРазнесения.ДатаОтправленияКП КАК ДатаОтправленияКП,
	|	УслугиДляРазнесения.НоменклатураАлгоритмПодбораСделокПоПериоду КАК НоменклатураАлгоритмПодбораСделокПоПериоду,
	|	УслугиДляРазнесения.ИнтервалДоДатыНачалаПеревозки КАК ИнтервалДоДатыНачалаПеревозки,
	|	УслугиДляРазнесения.ИнтервалПослеДатыОкончанияПеревозки КАК ИнтервалПослеДатыОкончанияПеревозки,
	|	УслугиДляРазнесения.РазноситьНаВидТранспортногоСообщения КАК РазноситьНаВидТранспортногоСообщения,
	|	УслугиДляРазнесения.РазрешитьМногократноеРазнесение КАК РазрешитьМногократноеРазнесение,
	|	УслугиДляРазнесения.НачалоОказанияУслуги КАК НачалоОказанияУслуги,
	|	УслугиДляРазнесения.ОкончаниеОказанияУслуги КАК ОкончаниеОказанияУслуги,
	|	УслугиДляРазнесения.Цена КАК Себестоимость,
	|	УслугиДляРазнесения.Количество КАК Количество,
	|	УслугиДляРазнесения.Сумма КАК СебестоимостьИтого,
	|	УслугиДляРазнесения.СтанцияОтправления КАК ПунктОтправления,
	|	УслугиДляРазнесения.СтанцияНазначения КАК ПунктНазначения,
	|	УслугиДляРазнесения.Поступление КАК ПТУ,
	|	УслугиДляРазнесения.НДСВключенВСтоимость КАК Расходы_НДСВключенВСтоимость,
	|	УслугиДляРазнесения.СтавкаНДС КАК Расходы_СтавкаНДС,
	|	УслугиДляРазнесения.Поставщик КАК Расходы_Поставщик,
	|	УслугиДляРазнесения.Договор КАК Расходы_Договор,
	|	УслугиДляРазнесения.Валюта КАК Валюта,
	|	УслугиДляРазнесения.ТранспортныйДокумент.НомерТранспортногоДокумента КАК НомерТранспортногоДокумента
	|ИЗ
	|	УслугиДляРазнесения КАК УслугиДляРазнесения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НайденныеСделки.ГУИД КАК ГУИД,
	|	НайденныеСделки.Номенклатура КАК Номенклатура,
	|	НайденныеСделки.Контейнер КАК Контейнер,
	|	НайденныеСделки.Вагон КАК Вагон,
	|	НайденныеСделки.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	НайденныеСделки.ДатаОтправленияКП КАК ДатаОтправленияКП,
	|	НайденныеСделки.НоменклатураАлгоритмПодбораСделокПоПериоду КАК НоменклатураАлгоритмПодбораСделокПоПериоду,
	|	НайденныеСделки.ИнтервалДоДатыНачалаПеревозки КАК ИнтервалДоДатыНачалаПеревозки,
	|	НайденныеСделки.ИнтервалПослеДатыОкончанияПеревозки КАК ИнтервалПослеДатыОкончанияПеревозки,
	|	НайденныеСделки.НачалоОказанияУслуги КАК НачалоОказанияУслуги,
	|	НайденныеСделки.ОкончаниеОказанияУслуги КАК ОкончаниеОказанияУслуги,
	|	КлючиАналитикиСоставаПоезда.Ссылка КАК КлючАналитикиСоставаПоезда,
	|	НайденныеСделки.Сделка КАК Сделка,
	|	НайденныеСделки.Сделка.Номер КАК НомерСделки,
	|	НайденныеСделки.Сделка.Дата КАК ДатаСделки,
	|	СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция,
	|	КлючиАналитикиСоставаПоезда.ИдентификаторКлюча КАК ГУИДСП,
	|	СделкаСвязьУчетныхЕдиниц.Груз КАК Груз
	|ИЗ
	|	НайденныеСделки КАК НайденныеСделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиСоставаПоезда КАК КлючиАналитикиСоставаПоезда
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СобственныеКонтрагенты КАК СобственныеКонтрагенты
	|				ПО СделкаСвязьУчетныхЕдиниц.Клиент = СобственныеКонтрагенты.Контрагент
	|			ПО КлючиАналитикиСоставаПоезда.Ссылка = СделкаСвязьУчетныхЕдиниц.КлючАналитикиСоставаПоезда
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ПО КлючиАналитикиСоставаПоезда.Клиент = Контрагенты.Ссылка
	|		ПО НайденныеСделки.КлючАналитикиСоставаПоезда = КлючиАналитикиСоставаПоезда.Ссылка
	|			И (ВЫБОР
	|				КОГДА НайденныеСделки.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	|					ТОГДА НайденныеСделки.Контейнер = КлючиАналитикиСоставаПоезда.Контейнер
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА НайденныеСделки.Вагон <> ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)
	|					ТОГДА НайденныеСделки.Вагон = КлючиАналитикиСоставаПоезда.Вагон
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА НайденныеСделки.ТранспортныйДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийТранспортныхДокументов.Коносамент)
	|					ТОГДА НайденныеСделки.ТранспортныйДокумент = КлючиАналитикиСоставаПоезда.Коносамент
	|				КОГДА НайденныеСделки.ТранспортныйДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийТранспортныхДокументов.ЖДНакладная)
	|					ТОГДА НайденныеСделки.ТранспортныйДокумент = КлючиАналитикиСоставаПоезда.ЖДН
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|ГДЕ
	|	НЕ СделкаСвязьУчетныхЕдиниц.ОтключитьРасходы
	|	И НЕ СделкаСвязьУчетныхЕдиниц.Удалена
	|	И НЕ СделкаСвязьУчетныхЕдиниц.НеАктивна
	|	И НЕ Контрагенты.Ссылка ЕСТЬ NULL
	|	И СобственныеКонтрагенты.Контрагент ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГУИД,
	|	КлючАналитикиСоставаПоезда";
	
	Запрос.УстановитьПараметр("Поступление", Акцепт.Поступление);
	
	//Евросиб Каблов 10.01.2024 ( #99682
	//Запрос.УстановитьПараметр("АкцептУслуги", Акцепт.Услуги.Выгрузить());
	ТаблицаУслуг = Акцепт.Услуги.ВыгрузитьКолонки();
	СписокНоменклатуры = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Акцепт.Услуги.ВыгрузитьКолонку("Номенклатура"));
	СоответствиеМассивовСписокОбязательныхПолейВАкцепте = Документы.Акцепт.ПолучитьСоответствиеМассивовСписокОбязательныхПолейВАкцептеПоСпискуНоменклатуры(СписокНоменклатуры);
	Для каждого СтрокаАкцепта Из Акцепт.Услуги Цикл
		
		Если СтрокаАкцепта.Неурег = Справочники.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ
			ИЛИ ЗначениеЗаполнено(СтрокаАкцепта.Сделка) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаУслуга = ТаблицаУслуг.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаУслуга, СтрокаАкцепта);
		
		МассивСписокОбязательныхПолейВАкцепте = СоответствиеМассивовСписокОбязательныхПолейВАкцепте.Получить(СтрокаУслуга.Номенклатура);
		НезаполненныеОбязательныеПоля = Новый Массив;
		Для каждого ИмяОбязательногоПоляВАкцепте Из МассивСписокОбязательныхПолейВАкцепте Цикл
			Если Не ЗначениеЗаполнено(СтрокаУслуга[ИмяОбязательногоПоляВАкцепте]) Тогда
				НезаполненныеОбязательныеПоля.Добавить(ИмяОбязательногоПоляВАкцепте);
			КонецЕсли;
		КонецЦикла;
		Если ЗначениеЗаполнено(НезаполненныеОбязательныеПоля) Тогда
			СтрокаУслуга.Неурег = Справочники.ПричиныНеурегулированныхРасходов.НеЗаполненыОбязательныеПоляВАкцепте;
			ТекстПричиныНеурега = СтрШаблон("Не заполнены поля: %1. Авторазнесение невозможно", СтрСоединить(НезаполненныеОбязательныеПоля, ", "));
			СтрокаУслуга.НеурегКомментарий = ТекстПричиныНеурега;
			Продолжить;
		ИначеЕсли СтрокаУслуга.Неурег = Справочники.ПричиныНеурегулированныхРасходов.НеЗаполненыОбязательныеПоляВАкцепте Тогда
			СтрокаУслуга.Неурег = Справочники.ПричиныНеурегулированныхРасходов.ПустаяСсылка();
			СтрокаУслуга.НеурегКомментарий = "";
		КонецЕсли;
	КонецЦикла;
	Запрос.УстановитьПараметр("АкцептУслуги", ТаблицаУслуг);
	//Евросиб Каблов 10.01.2024 )
	
	Запрос.УстановитьПараметр("ПустаяДата", ПустаяДата);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Акцепт.Услуги КАК АкцептУслуги", "&АкцептУслуги КАК АкцептУслуги");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "АкцептУслуги.Ссылка = &Акцепт", "ИСТИНА");
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ТаблицаУслуг = РезультатыЗапроса[4].Выгрузить();
	ТаблицаСделок = РезультатыЗапроса[5].Выгрузить();
	
	Сделки = Новый Массив;
	СделкиОбъекты = Новый Соответствие;
	
	Для Каждого СтрУслуг Из ТаблицаУслуг Цикл		
		
		СтрокиСделок = ТаблицаСделок.НайтиСтроки(Новый Структура("ГУИД", СтрУслуг.ГУИД));
		СтрокиСП = Новый Массив;
		Для Каждого СтрСделки Из СтрокиСделок Цикл
			Если ЗначениеЗаполнено(СтрСделки.КлючАналитикиСоставаПоезда) Тогда
				СтрокиСП.Добавить(СтрСделки);
			КонецЕсли;
		КонецЦикла;
		
		КоличествоСтрокСделок = СтрокиСделок.Количество();
		КоличествоСтрокСП = СтрокиСП.Количество();		
		Если КоличествоСтрокСП = 1 Тогда
			
			ДанныеСтроки = Новый Структура(
			"Доходы,
			|Расходы,
			|ГУИДСП,
			|Контейнер,
			|Вагон,
			|ТранспортныйДокумент,
			|ГУИДРасходов,
			|УслугаРасхода,
			|ПТУ,
			|Расходы_Поставщик,
			|Расходы_Договор,
			|Расходы_СтавкаНДС,
			|Расходы_НДСВключенВСтоимость,
			|Услуга, 
			|Калькуляция, 
			|Себестоимость, 
			|Количество, 
			|СебестоимостьИтого, 
			|Груз, 
			|ВознаграждениеИтого, 
			|ВнутренняяСебестоимость, 
			|Валюта, 
			|Перевыставляемая, 
			|НоменклатурнаяГруппа, 
			|Подсыл, 
			|Комментарий, 
			|НеВключатьВПлановыеРасходы, 
			|ПунктОтправления, 
			|ПунктНазначения, 
			|ИсточникПоявленияСтрокиЭкономики, 
			|ЕдиницаИзмерения, 
			|ОтнестиНаЗатраты, 
			|АвтоматическиПривязыватьРасходКДоходу,
			|ГУИДСтрокиДоходов,
			|ВидТранспортногоСообщения,
			|АвтоматическиПривязыватьРасходКДоходу");
			
			СтрокаСП = СтрокиСП[0];
			Сделка = СтрокаСП.Сделка;
			СделкаОбъект = СделкиОбъекты.Получить(Сделка);
			Если СделкаОбъект = Неопределено Тогда
				СделкаОбъект = Сделка.ПолучитьОбъект();
				СделкиОбъекты.Вставить(Сделка, СделкаОбъект);
				СделкаОбъект.ДополнительныеСвойства.Вставить("ЗаписьИзАкцепта");
				Сделки.Добавить(СделкаОбъект);
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ДанныеСтроки, СтрокаСП);
			ЗаполнитьЗначенияСвойств(ДанныеСтроки, СтрУслуг);
			
			ДанныеСтроки.Доходы = Ложь;
			ДанныеСтроки.Расходы = Истина;
			ДанныеСтроки.УслугаРасхода = ДанныеСтроки.Услуга;
			ДанныеСтроки.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта;
			ДанныеСтроки.ВидТранспортногоСообщения = СтрУслуг.РазноситьНаВидТранспортногоСообщения;
			ДанныеСтроки.АвтоматическиПривязыватьРасходКДоходу = Истина;
			
			ГУИДРасходов = Строка(Новый УникальныйИдентификатор);
			ДанныеСтроки.ГУИДРасходов = ГУИДРасходов;
			ДанныеСтроки.ГУИДСтрокиДоходов = "";
			
			СписокКТК = Новый СписокЗначений;
			СписокКТК.Добавить(ДанныеСтроки.Контейнер);
			ДанныеСтроки.Вставить("СписокКТК", СписокКТК);
			
			СписокВагонов = Новый СписокЗначений;
			СписокВагонов.Добавить(ДанныеСтроки.Вагон);
			ДанныеСтроки.Вставить("СписокВагонов", СписокВагонов);
			
			СписокТД = Новый СписокЗначений;
			СписокТД.Добавить(СтрУслуг.НомерТранспортногоДокумента);
			ДанныеСтроки.Вставить("СписокТД", СписокТД);
			
			ДанныеСтроки.НоменклатурнаяГруппа = РазнесениеЗатратСервер.ПодобратьНоменклатурнуюГруппуПоНаборуПараметров(СделкаОбъект.ТипЗаказа, СтрСоединить(ДанныеСтроки.СписокВагонов.ВыгрузитьЗначения(), ";"));
						
			Расходы = Новый Массив;
			Расходы.Добавить(ДанныеСтроки);
			
			РаботаСоСделкамиСервер.ДобавитьСтрокиРасходовВСделку(СделкаОбъект, Расходы, Истина);
			
			НайдСтроки = Акцепт.Услуги.НайтиСтроки(Новый Структура("ГУИД", СтрУслуг.ГУИД));
			Для каждого СтрокаАкцепта из НайдСтроки Цикл
				
				СтрокаАкцепта.ИдентификаторСтрокиРасходовВСделке = ГУИДРасходов;
				СтрокаАкцепта.Сделка = Сделка;
				СтрокаАкцепта.ПолностьюРазнесено = Не СтрУслуг.РазрешитьМногократноеРазнесение;		
				СтрокаАкцепта.ПривязалПользователь = Неопределено;
				СтрокаАкцепта.Сумма = СтрокаАкцепта.ПоступлениеСумма;
				СтрокаАкцепта.СуммаНДС = СтрокаАкцепта.ПоступлениеСуммаНДС;
				// Евросиб US 94195 TA 104912 Рыбьяков К.А. 16.03.2025 (( закомментпровал
				//Евросиб Каблов 29.05.2024 ( #85354 Пока не внедрять
				//СтрокаАкцепта.Неурег = Справочники.ПричиныНеурегулированныхРасходов.ПустаяСсылка();
				//СтрокаАкцепта.НеурегКомментарий = "";
				// Евросиб Рыбьяков К.А. 16.03.2025 ))
				//СтрокаАкцепта.ВариантРазнесения = Перечисления.ВариантыРазнесенияЗатрат.РазнесениеНаПрямые;
				//Евросиб Каблов 29.05.2024 )
				
			КонецЦикла;
			
		ИначеЕсли КоличествоСтрокСделок = 0 Тогда
			
			НайденныеСтроки = Акцепт.Услуги.НайтиСтроки(Новый Структура("ГУИД", СтрУслуг.ГУИД));
			Для Каждого СтрокаАкцепта Из НайденныеСтроки Цикл
				СтрокаАкцепта.Неурег = Справочники.ПричиныНеурегулированныхРасходов.НеНайденыСтрокиРасходовВСделкахПоПериоду;
				СтрокаАкцепта.НеурегКомментарий = "";
			КонецЦикла;
			
		Иначе
			
			ПоляПоиска = Новый Массив;
			Если ЗначениеЗаполнено(СтрУслуг.Контейнер) Тогда
				ПоляПоиска.Добавить("Контейнер");
			КонецЕсли;				
			Если ЗначениеЗаполнено(СтрУслуг.Вагон) Тогда
				ПоляПоиска.Добавить("Вагон");
			КонецЕсли;				
			Если ЗначениеЗаполнено(СтрУслуг.ТранспортныйДокумент) Тогда
				ПоляПоиска.Добавить("Накладная");
			КонецЕсли;
			СтрокаПоляПоиска = СтрСоединить(ПоляПоиска, "/");
			
			НайденныеСтроки = Акцепт.Услуги.НайтиСтроки(Новый Структура("ГУИД", СтрУслуг.ГУИД));
			Для Каждого СтрокаАкцепта Из НайденныеСтроки Цикл
				
				Если КоличествоСтрокСП > 1 Тогда			
					СтрокаАкцепта.Неурег = Справочники.ПричиныНеурегулированныхРасходов.НайденоНесколькоСтрокВСоставеПоезда;					
					ТаблицаНомераСделок = ТаблицаСделок.Скопировать(СтрокиСП, "НомерСделки, ДатаСделки");					
				Иначе					
					СтрокаАкцепта.Неурег = Справочники.ПричиныНеурегулированныхРасходов.НеНайденыСтрокиВСоставеПоезда;
					ТаблицаНомераСделок = ТаблицаСделок.Скопировать(СтрокиСделок, "НомерСделки, ДатаСделки");					
				КонецЕсли;
				
				НомераСделок = Новый Массив;
				ТаблицаНомераСделок.Свернуть("НомерСделки, ДатаСделки");
				Для Каждого Стр Из ТаблицаНомераСделок Цикл
					НомераСделок.Добавить(СтрШаблон("%1/%2", Стр.НомерСделки, Формат(Стр.ДатаСделки, "ДФ=yyyy")));
				КонецЦикла;
				СтрокаНомераСделок = СтрСоединить(НомераСделок, ", ");
				
				Шаблон = "Найденные сделки: %1. Вид ТС: %2. Поля для поиска: %3. Разнесение на прямые невозможно.";
				Комментарий = СтрШаблон(Шаблон, СтрокаНомераСделок, СтрУслуг.РазноситьНаВидТранспортногоСообщения, СтрокаПоляПоиска);
				СтрокаАкцепта.НеурегКомментарий = Комментарий;
			
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьШаблонЗапроса(РежимБитыеСсылки)
	Если Не РежимБитыеСсылки Тогда
		ШаблонЗапроса = 
		"ВЫБРАТЬ
		|	АкцептУслуги.ГУИД КАК ГУИД,
		|   """" КАК РежимИсправления,
		|	ВЫРАЗИТЬ(&Поступление КАК Документ.ПоступлениеТоваровУслуг) КАК Поступление,
		|   ВЫРАЗИТЬ(&Поступление КАК Документ.ПоступлениеТоваровУслуг).Контрагент КАК Поставщик,
		|	АкцептУслуги.Сделка КАК Сделка,
		|	АкцептУслуги.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке,
		|	АкцептУслуги.Номенклатура КАК Номенклатура,
		//Евросиб - АСуслов 19.01.2023 12:26:48 #63097
		//(
		|	АкцептУслуги.Номенклатура.АлгоритмПодбораСделокПоПериоду КАК АлгоритмПодбораСделокПоПериоду,
		|	АкцептУслуги.Номенклатура.ИнтервалПериодаОпределенияСделокДоДатыНачалаПеревозки КАК ИнтервалПериодаОпределенияСделокДоДатыНачалаПеревозки,
		|	АкцептУслуги.Номенклатура.ИнтервалПериодаОпределенияСделокПослеДатыОкончанияПеревозки КАК ИнтервалПериодаОпределенияСделокПослеДатыОкончанияПеревозки,
		//)
		//Евросиб - АСуслов 19.01.2023 12:27:00 #63097
		|	АкцептУслуги.Контейнер КАК Контейнер,
		|	АкцептУслуги.Вагон КАК Вагон,
		|	АкцептУслуги.ТранспортныйДокумент КАК ТранспортныйДокумент,
		|	АкцептУслуги.СтанцияОтправления КАК СтанцияОтправления,
		|	АкцептУслуги.СтанцияНазначения КАК СтанцияНазначения,
		|	АкцептУслуги.ВесПоНакладной КАК ВесПоНакладной,
		|	АкцептУслуги.ПоступлениеСумма КАК ПоступлениеСумма,
		|   &ПоляАкцептаДляОтбора 
		|ПОМЕСТИТЬ ВТ_СтрокиДляАвтоакцепта  
		|ИЗ
		|	ВТ_АкцептУслуги КАК АкцептУслуги
		|ГДЕ    
		|   АкцептУслуги.Сделка = Значение(Документ.Сделка.ПустаяСсылка)
		|   И НЕ АкцептУслуги.Неурег = Значение(Справочник.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ)
		//Евросиб - АСуслов 08.11.2022 13:53:56 #60543
		//(
		|	И НЕ АкцептУслуги.Неурег = ЗНАЧЕНИЕ(Справочник.ПричиныНеурегулированныхРасходов.НетСделки)
		//)
		//Евросиб - АСуслов 18.01.2023 17:38:37 #63097
		//(
		|	И НЕ АкцептУслуги.Неурег = ЗНАЧЕНИЕ(Справочник.ПричиныНеурегулированныхРасходов.КоносаментНеПодобран)
		//)
		//Евросиб - АСуслов 08.11.2022 13:54:00 #60543
		|   И &ОтборПоНоменклатуре
		|	И &УсловияОбязательныхПолейАвтоакцепта";
	Иначе 
		//новые фишки не поддерживаются в этом режиме с 19.01.2
		ШаблонЗапроса = 
		"ВЫБРАТЬ
		|	АкцептУслуги.ГУИД КАК ГУИД,
		|   ""Режим исправления битых ссылок"" КАК РежимИсправления,
		|	ВЫРАЗИТЬ(&Поступление КАК Документ.ПоступлениеТоваровУслуг) КАК Поступление,
		|   ВЫРАЗИТЬ(&Поступление КАК Документ.ПоступлениеТоваровУслуг).Контрагент КАК Поставщик,
		|	АкцептУслуги.Сделка КАК Сделка,
		|	АкцептУслуги.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке,
		|	АкцептУслуги.НоменклатураСделки КАК НоменклатураСделки,
		|	АкцептУслуги.Номенклатура КАК Номенклатура,
		|	АкцептУслуги.Контейнер КАК Контейнер,
		|	АкцептУслуги.Вагон КАК Вагон,
		|	АкцептУслуги.ТранспортныйДокумент КАК ТранспортныйДокумент,
		|	АкцептУслуги.СтанцияОтправления КАК СтанцияОтправления,
		|	АкцептУслуги.СтанцияНазначения КАК СтанцияНазначения,
		|	АкцептУслуги.ВесПоНакладной КАК ВесПоНакладной,
		|	&ПоляАкцептаДляОтбора
		|ПОМЕСТИТЬ ВТ_СтрокиДляАвтоакцепта
		|ИЗ
		|	ВТ_АкцептУслуги КАК АкцептУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы
		|		ПО АкцептУслуги.Сделка = СделкаРасходы.Ссылка
		|			И АкцептУслуги.ИдентификаторСтрокиРасходовВСделке = СделкаРасходы.ГУИД
		|ГДЕ
		|	НЕ АкцептУслуги.Сделка = ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
		|   И НЕ АкцептУслуги.Неурег = Значение(Справочник.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ)
		//Евросиб - АСуслов 08.11.2022 13:53:56 #60543
		//(
		|	И НЕ АкцептУслуги.Неурег = ЗНАЧЕНИЕ(Справочник.ПричиныНеурегулированныхРасходов.НетСделки)
		//)
		//Евросиб - АСуслов 08.11.2022 13:54:00 #60543
		//Евросиб - АСуслов 18.01.2023 17:38:37 #63097
		//(
		|	И НЕ АкцептУслуги.Неурег = ЗНАЧЕНИЕ(Справочник.ПричиныНеурегулированныхРасходов.КоносаментНеПодобран)
		//)
		|	И СделкаРасходы.ГУИД ЕСТЬ NULL
		|	И &ОтборПоНоменклатуре
		|	И &УсловияОбязательныхПолейАвтоакцепта
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АкцептУслуги.ГУИД,
		|   ""Режим исправления привязки к удаленным строкам"",
		|	ВЫРАЗИТЬ(&Поступление КАК Документ.ПоступлениеТоваровУслуг) КАК Поступление,
		|   ВЫРАЗИТЬ(&Поступление КАК Документ.ПоступлениеТоваровУслуг).Контрагент КАК Поставщик,
		|	АкцептУслуги.Сделка,
		|	АкцептУслуги.ИдентификаторСтрокиРасходовВСделке,
		|	АкцептУслуги.НоменклатураСделки,
		|	АкцептУслуги.Номенклатура,
		|	АкцептУслуги.Контейнер,
		|	АкцептУслуги.Вагон,
		|	АкцептУслуги.ТранспортныйДокумент,
		|	АкцептУслуги.СтанцияОтправления,
		|	АкцептУслуги.СтанцияНазначения,
		|	АкцептУслуги.ВесПоНакладной,
		|	&ПоляАкцептаДляОтбора
		|ИЗ
		|	ВТ_АкцептУслуги КАК АкцептУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы
		|		ПО АкцептУслуги.Сделка = СделкаРасходы.Ссылка
		|			И АкцептУслуги.ИдентификаторСтрокиРасходовВСделке = СделкаРасходы.ГУИД
		|ГДЕ
		|	НЕ АкцептУслуги.Сделка = ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
		|   И НЕ АкцептУслуги.Неурег = Значение(Справочник.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ)
		//Евросиб - АСуслов 08.11.2022 13:53:56 #60543
		//(
		|	И НЕ АкцептУслуги.Неурег = ЗНАЧЕНИЕ(Справочник.ПричиныНеурегулированныхРасходов.НетСделки)
		//Евросиб - АСуслов 18.01.2023 17:38:37 #63097
		//(
		|	И НЕ АкцептУслуги.Неурег = ЗНАЧЕНИЕ(Справочник.ПричиныНеурегулированныхРасходов.КоносаментНеПодобран)
		//)
		//Евросиб - АСуслов 18.01.2023 17:38:38 #63097
		//)
		//Евросиб - АСуслов 08.11.2022 13:54:00 #60543
		|	И СделкаРасходы.УслугаОтключена
		|	И &ОтборПоНоменклатуре
		|	И &УсловияОбязательныхПолейАвтоакцепта";
	КонецЕсли; 
	Возврат ШаблонЗапроса;
КонецФункции

Функция ПолучитьШаблонЗапросаОписанияПричинНеурегов(РежимБитыеСсылки)
	Если Не РежимБитыеСсылки Тогда
		ШаблонЗапроса = 
		"ВЫБРАТЬ
		|	АкцептУслуги.ГУИД КАК ГУИД,
		|	АкцептУслуги.Сделка КАК Сделка,
		|	АкцептУслуги.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке,
		|	АкцептУслуги.Номенклатура КАК Номенклатура,
		|   АкцептУслуги.Контейнер,
		|   АкцептУслуги.Вагон,
		|   АкцептУслуги.ТранспортныйДокумент,
		|   АкцептУслуги.СтанцияОтправления,
		|   АкцептУслуги.СтанцияНазначения,
		|   АкцептУслуги.КлиентРасхода,
		|   АкцептУслуги.ВесПоНакладной,
		|   АкцептУслуги.ПоступлениеСумма,
		|   АкцептУслуги.НачалоОказанияУслуги,
		|   АкцептУслуги.ОкончаниеОказанияУслуги,
		|   &ПоляАкцептаДляОтбора 
		|ПОМЕСТИТЬ ВТ_СтрокиДляПричинНеурегов  
		|ИЗ
		|	ВТ_АкцептУслуги КАК АкцептУслуги
		|ГДЕ    
		|   АкцептУслуги.Сделка = Значение(Документ.Сделка.ПустаяСсылка)
		|   И НЕ АкцептУслуги.ГУИД В (ВЫБРАТЬ т.ГУИД ИЗ ВТ_СтрокиДляАвтоакцепта КАК т ГДЕ НЕ т.ИспользоватьРезультатДляПричиныНеурега)
		|   И &ОтборПоНоменклатуре
		|	И (&УсловияОбязательныхПолейДляНеурегов)";  
	Иначе
		ШаблонЗапроса = 
		"ВЫБРАТЬ
		|	АкцептУслуги.ГУИД КАК ГУИД,
		|	АкцептУслуги.Сделка КАК Сделка,
		|	АкцептУслуги.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке,
		|	АкцептУслуги.Номенклатура КАК Номенклатура,
		|   АкцептУслуги.Контейнер,
		|   АкцептУслуги.Вагон,
		|   АкцептУслуги.ТранспортныйДокумент,
		|   АкцептУслуги.СтанцияОтправления,
		|   АкцептУслуги.СтанцияНазначения,
		|   АкцептУслуги.КлиентРасхода,
		|   АкцептУслуги.ВесПоНакладной,
		|   АкцептУслуги.ПоступлениеСумма,
		|   АкцептУслуги.НачалоОказанияУслуги,
		|   АкцептУслуги.ОкончаниеОказанияУслуги,
		|   &ПоляАкцептаДляОтбора 
		|ПОМЕСТИТЬ ВТ_СтрокиДляПричинНеурегов  
		|ИЗ
		|	ВТ_АкцептУслуги КАК АкцептУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы
		|		ПО АкцептУслуги.Сделка = СделкаРасходы.Ссылка
		|			И АкцептУслуги.ИдентификаторСтрокиРасходовВСделке = СделкаРасходы.ГУИД
		|ГДЕ    
		|	НЕ АкцептУслуги.Сделка = ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
		|   И СделкаРасходы.ГУИД ЕСТЬ NULL
		|   И НЕ АкцептУслуги.ГУИД В (ВЫБРАТЬ т.ГУИД ИЗ ВТ_СтрокиДляАвтоакцепта КАК т ГДЕ НЕ т.ИспользоватьРезультатДляПричиныНеурега)
		|   И &ОтборПоНоменклатуре
		|	И (&УсловияОбязательныхПолейДляНеурегов)";  
	КонецЕсли; 
	Возврат ШаблонЗапроса;
КонецФункции

Функция ПолучитьТекстУсловияПоПолямДляАвтоакцепта(ВыборкаУслуг)
	
	//здесь нужно добавить условия, при котором строчка попадает в таблицу автоакцепта в зависимости от правила
	//вид поиска:
	//основной поиск - условие обязательно
	//мягкий - либо пусто, либо значение
	
	ТекстУсловия = "";
	Если ВыборкаУслуг.Контейнер = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		ТекстУсловия = ТекстУсловия + "И НЕ АкцептУслуги.Контейнер = Значение(Справочник.ТЕ.ПустаяСсылка)
		|";
	КонецЕсли;                                                               
	Если ВыборкаУслуг.Вагон = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		ТекстУсловия = ТекстУсловия + "И НЕ АкцептУслуги.Вагон = Значение(Справочник.ТС.ПустаяСсылка)
		|";
	КонецЕсли;                                                               
	Если ВыборкаУслуг.ТранспортныйДокумент = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		ТекстУсловия = ТекстУсловия + "И НЕ АкцептУслуги.ТранспортныйДокумент = Значение(Документ.ТранспортныйДокумент.ПустаяСсылка)
		|";
	ИначеЕсли ВыборкаУслуг.ТранспортныйДокумент = Перечисления.ВидыПоискаАвтоакцепт.МягкийПоиск Тогда
		ТекстУсловия = ТекстУсловия + "И ВЫБОР КОГДА АкцептУслуги.ТранспортныйДокумент = Значение(Документ.ТранспортныйДокумент.ПустаяСсылка) ТОГДА ИСТИНА ИНАЧЕ НЕ АкцептУслуги.ТранспортныйДокумент = Значение(Документ.ТранспортныйДокумент.ПустаяСсылка) КОНЕЦ
		|";
	КонецЕсли;                                                               
	//Если ВыборкаУслуг.СтанцияОтправления = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск
	//	ИЛИ ВыборкаУслуг.СинонимыСтанцииОтправления = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск 
	//	ИЛИ ВыборкаУслуг.РодительСтанцииОтправления = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
	//	ТекстУсловия = ТекстУсловия + "И НЕ АкцептУслуги.СтанцияОтправления = Значение(Справочник.Локации.ПустаяСсылка)
	//	|";
	//КонецЕсли;                                                               
	//Если ВыборкаУслуг.СтанцияНазначения = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск 
	//	ИЛИ ВыборкаУслуг.СинонимыСтанцииНазначения = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск
	//	ИЛИ ВыборкаУслуг.РодительСтанцииНазначения = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
	//	ТекстУсловия = ТекстУсловия + "И НЕ АкцептУслуги.СтанцияНазначения = Значение(Справочник.Локации.ПустаяСсылка)
	//	|";
	//КонецЕсли;  
	Если ВыборкаУслуг.ПериодОказанияУслуги = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		ТекстУсловия = ТекстУсловия + "И НЕ (АкцептУслуги.НачалоОказанияУслуги = ДатаВремя(1,1,1) И АкцептУслуги.ОкончаниеОказанияУслуги = ДатаВремя(1,1,1))
		|";
	КонецЕсли;
	//Если ВыборкаУслуг.ПунктыОтправленияНазначения = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск
	//	ИЛИ ВыборкаУслуг.РодителиПунктовОтправленияНазначения = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
	//	ТекстУсловия = ТекстУсловия + "И НЕ (АкцептУслуги.СтанцияОтправления = Значение(Справочник.Локации.ПустаяСсылка) И АкцептУслуги.СтанцияНазначения = Значение(Справочник.Локации.ПустаяСсылка))
	//	|";
	//КонецЕсли;
	Если ВыборкаУслуг.ЛокацияОтправления = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		ТекстУсловия = ТекстУсловия + "И НЕ (АкцептУслуги.СтанцияОтправления.Ссылка ЕСТЬ NULL)";
	КонецЕсли;
	Если ВыборкаУслуг.ЛокацияНазначения = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		ТекстУсловия = ТекстУсловия + "И НЕ (АкцептУслуги.СтанцияНазначения.Ссылка ЕСТЬ NULL)";
	КонецЕсли;
	Если ВыборкаУслуг.Клиент = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		ТекстУсловия = ТекстУсловия + "И НЕ АкцептУслуги.КлиентРасхода = Значение(Справочник.Контрагенты.ПустаяСсылка)
		|";
	ИначеЕсли ВыборкаУслуг.Клиент = Перечисления.ВидыПоискаАвтоакцепт.МягкийПоиск Тогда
		ТекстУсловия = ТекстУсловия + "И ВЫБОР КОГДА АкцептУслуги.КлиентРасхода = Значение(Справочник.Контрагенты.ПустаяСсылка) ТОГДА ИСТИНА ИНАЧЕ НЕ АкцептУслуги.КлиентРасхода = Значение(Справочник.Контрагенты.ПустаяСсылка) КОНЕЦ
		|";
	КонецЕсли;  
	Возврат ТекстУсловия;
	
КонецФункции

Функция ПолучитьТекстУсловияПоПолямДляНеурегов(ВыборкаУслуг)
	
	ТекстУсловия = "ИСТИНА ";
	Если ВыборкаУслуг.Контейнер = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		ТекстУсловия = ТекстУсловия + "ИЛИ АкцептУслуги.Контейнер = Значение(Справочник.ТЕ.ПустаяСсылка)
		|";
	КонецЕсли;                                                               
	Если ВыборкаУслуг.Вагон = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		ТекстУсловия = ТекстУсловия + "ИЛИ АкцептУслуги.Вагон = Значение(Справочник.ТС.ПустаяСсылка)
		|";
	КонецЕсли;                                                               
	Если ВыборкаУслуг.ТранспортныйДокумент = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		ТекстУсловия = ТекстУсловия + "ИЛИ АкцептУслуги.ТранспортныйДокумент = Значение(Документ.ТранспортныйДокумент.ПустаяСсылка)
		|";
	КонецЕсли;                                                               
	//Если ВыборкаУслуг.СтанцияОтправления = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
	//	ТекстУсловия = ТекстУсловия + "ИЛИ АкцептУслуги.СтанцияОтправления = Значение(Справочник.Локации.ПустаяСсылка)
	//	|";
	//КонецЕсли;                                                               
	//Если ВыборкаУслуг.СтанцияНазначения = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
	//	ТекстУсловия = ТекстУсловия + "ИЛИ АкцептУслуги.СтанцияНазначения = Значение(Справочник.Локации.ПустаяСсылка)
	//	|";
	//КонецЕсли;  
	Если ВыборкаУслуг.ЛокацияОтправления = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		ТекстУсловия = ТекстУсловия + "ИЛИ АкцептУслуги.СтанцияОтправления.Ссылка Есть NULL
		|";
	КонецЕсли;                                                               
	Если ВыборкаУслуг.ЛокацияНазначения = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		ТекстУсловия = ТекстУсловия + "ИЛИ АкцептУслуги.СтанцияНазначения.Ссылка ЕСТЬ NULL
		|";
	КонецЕсли;  
	Если ВыборкаУслуг.ПериодОказанияУслуги = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		ТекстУсловия = ТекстУсловия + "ИЛИ (АкцептУслуги.НачалоОказанияУслуги = ДатаВремя(1,1,1) И АкцептУслуги.ОкончаниеОказанияУслуги = ДатаВремя(1,1,1))
		|";
	КонецЕсли;  
	Если ВыборкаУслуг.Клиент = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		ТекстУсловия = ТекстУсловия + "ИЛИ (АкцептУслуги.КлиентРасхода = Значение(Справочник.Контрагенты.ПустаяСсылка))
		|";
	КонецЕсли;  
	//Если ВыборкаУслуг.ПунктыОтправленияНазначения = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск
	//	ИЛИ ВыборкаУслуг.РодителиПунктовОтправленияНазначения = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
	//	ТекстУсловия = ТекстУсловия + "ИЛИ (АкцептУслуги.СтанцияНазначения = Значение(Справочник.Локации.ПустаяСсылка) И АкцептУслуги.СтанцияОтправления = Значение(Справочник.Локации.ПустаяСсылка))
	//	|";
	//КонецЕсли;  
	Возврат ТекстУсловия;
	
КонецФункции

Функция ПолучитьТекстПолейДляАвтоакцепта(ВыборкаУслуг, ДляОписанияПричиныНеурегов = Ложь)
	
	//здесь настраивается вид таблицы, которая будет обрабатываться автоакцептом 
	//в зависимости от вида поиска:
	//основной поиск: значение как заполнено в акцепте
	//мягкий поиск: если заполнено, то как в акцепте, иначе в поиске не участвует
	
	ТекстПолей = "";
	ТекстПолей = ТекстПолей + СтрШаблон("%1 КАК Приоритет,
	|", ВыборкаУслуг.НомерСтроки);
	
	//Контейнер
	Если ВыборкаУслуг.Контейнер = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		ТекстПолей = ТекстПолей + "АкцептУслуги.Контейнер КАК КонтейнерДляОтбора,
		|ИСТИНА КАК ЗаполненКонтейнерДляОтбора,
		|";
	Иначе
		//ТекстПолей = "Значение(Справочник.ТЕ.ПустаяСсылка) КАК Контейнер,
		ТекстПолей = ТекстПолей + "Неопределено КАК КонтейнерДляОтбора,
		|ЛОЖЬ КАК ЗаполненКонтейнерДляОтбора,
		|";
	КонецЕсли; 
	//Вагон
	Если ВыборкаУслуг.Вагон = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		ТекстПолей = ТекстПолей + "АкцептУслуги.Вагон КАК ВагонДляОтбора,
		|ИСТИНА КАК ЗаполненВагонДляОтбора,
		|";
	Иначе
		//ТекстПолей = "Значение(Справочник.ТЕ.ПустаяСсылка) КАК Вагон,
		ТекстПолей = ТекстПолей + "Неопределено КАК ВагонДляОтбора,
		|ЛОЖЬ КАК ЗаполненВагонДляОтбора,
		|";
	КонецЕсли; 
	//Транспортный документ
	Если ВыборкаУслуг.ТранспортныйДокумент = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		ТекстПолей = ТекстПолей + "АкцептУслуги.ТранспортныйДокумент КАК ТранспортныйДокументДляОтбора,
		|ИСТИНА КАК ЗаполненТранспортныйДокументДляОтбора,
		|";
	ИначеЕсли ВыборкаУслуг.ТранспортныйДокумент = Перечисления.ВидыПоискаАвтоакцепт.МягкийПоиск Тогда
		ТекстПолей = ТекстПолей + "ВЫБОР КОГДА НЕ АкцептУслуги.ТранспортныйДокумент = Значение(Документ.ТранспортныйДокумент.ПустаяСсылка) ТОГДА АкцептУслуги.ТранспортныйДокумент ИНАЧЕ Неопределено КОНЕЦ КАК ТранспортныйДокументДляОтбора,
		|ВЫБОР КОГДА НЕ АкцептУслуги.ТранспортныйДокумент = Значение(Документ.ТранспортныйДокумент.ПустаяСсылка) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ  КАК ЗаполненТранспортныйДокументДляОтбора,
		|";
	Иначе
		//ТекстПолей = "Значение(Документ.ТранспортныйДокумент.ПустаяСсылка) КАК ТранспортныйДокумент,
		ТекстПолей = ТекстПолей + "Неопределено КАК ТранспортныйДокументДляОтбора,
		|ЛОЖЬ КАК ЗаполненТранспортныйДокументДляОтбора,
		|";
	КонецЕсли; 
	////Станция отправления
	//Если ВыборкаУслуг.СтанцияОтправления = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
	//	ТекстПолей = ТекстПолей + "АкцептУслуги.СтанцияОтправления КАК СтанцияОтправленияДляОтбора,
	//	|ИСТИНА КАК ЗаполненСтанцияОтправленияДляОтбора,
	//	|";
	//ИначеЕсли ВыборкаУслуг.СтанцияОтправления = Перечисления.ВидыПоискаАвтоакцепт.МягкийПоиск 
	//	ИЛИ ВыборкаУслуг.ПунктыОтправленияНазначения = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда 
	//	ТекстПолей = ТекстПолей + "ВЫБОР КОГДА НЕ АкцептУслуги.СтанцияОтправления = Значение(Справочник.Локации.ПустаяСсылка) ТОГДА АкцептУслуги.СтанцияОтправления ИНАЧЕ Неопределено КОНЕЦ КАК СтанцияОтправленияДляОтбора,
	//	|ВЫБОР КОГДА НЕ АкцептУслуги.СтанцияОтправления = Значение(Справочник.Локации.ПустаяСсылка) ТОГДА Истина ИНАЧЕ Ложь КОНЕЦ КАК ЗаполненСтанцияОтправленияДляОтбора,
	//	|";
	//Иначе
	//	//ТекстПолей = "Значение(Справочник.Локации.ПустаяСсылка) КАК СтанцияОтправления,
	//	ТекстПолей = ТекстПолей + "Неопределено КАК СтанцияОтправленияДляОтбора,
	//	|ЛОЖЬ КАК ЗаполненСтанцияОтправленияДляОтбора,
	//	|";
	//КонецЕсли;  
	//Локация отправления
	Если ВыборкаУслуг.ЛокацияОтправления = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		ТекстПолей = ТекстПолей + "АкцептУслуги.СтанцияОтправления КАК ЛокацияОтправленияДляОтбора,
		|ИСТИНА КАК ЗаполненЛокацияОтправленияДляОтбора,
		|";
	ИначеЕсли ВыборкаУслуг.ЛокацияОтправления = Перечисления.ВидыПоискаАвтоакцепт.МягкийПоиск 
		//ИЛИ ВыборкаУслуг.ПунктыОтправленияНазначения = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск 
		Тогда 
		ТекстПолей = ТекстПолей + "ВЫБОР КОГДА НЕ АкцептУслуги.СтанцияОтправления.Ссылка Есть NULL ТОГДА АкцептУслуги.СтанцияОтправления ИНАЧЕ Неопределено КОНЕЦ КАК ЛокацияОтправленияДляОтбора,
		|ВЫБОР КОГДА НЕ АкцептУслуги.СтанцияОтправления.Ссылка ЕСТЬ NULL ТОГДА Истина ИНАЧЕ Ложь КОНЕЦ КАК ЗаполненЛокацияОтправленияДляОтбора,
		|";
	Иначе
		//ТекстПолей = "Значение(Справочник.Локации.ПустаяСсылка) КАК СтанцияОтправления,
		ТекстПолей = ТекстПолей + "Неопределено КАК ЛокацияОтправленияДляОтбора,
		|ЛОЖЬ КАК ЗаполненЛокацияОтправленияДляОтбора,
		|";
	КонецЕсли;  
	////Станция назначения
	//Если ВыборкаУслуг.СтанцияНазначения = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
	//	ТекстПолей = ТекстПолей + "АкцептУслуги.СтанцияНазначения КАК СтанцияНазначенияДляОтбора,
	//	|ИСТИНА КАК ЗаполненСтанцияНазначенияДляОтбора,
	//	|";
	//ИначеЕсли ВыборкаУслуг.СтанцияОтправления = Перечисления.ВидыПоискаАвтоакцепт.МягкийПоиск  
	//	ИЛИ ВыборкаУслуг.ПунктыОтправленияНазначения = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
	//	ТекстПолей = ТекстПолей + "ВЫБОР КОГДА НЕ АкцептУслуги.СтанцияНазначения = Значение(Справочник.Локации.ПустаяСсылка) ТОГДА АкцептУслуги.СтанцияНазначения ИНАЧЕ Неопределено КОНЕЦ КАК СтанцияНазначенияДляОтбора,
	//	|ВЫБОР КОГДА НЕ АкцептУслуги.СтанцияНазначения = Значение(Справочник.Локации.ПустаяСсылка) ТОГДА Истина ИНАЧЕ Ложь КОНЕЦ КАК ЗаполненСтанцияНазначенияДляОтбора,
	//	|";
	//Иначе
	//	//ТекстПолей = "Значение(Справочник.Локации.ПустаяСсылка) КАК СтанцияОтправления,
	//	ТекстПолей = ТекстПолей + "Неопределено КАК СтанцияНазначенияДляОтбора,
	//	|ЛОЖЬ КАК ЗаполненСтанцияНазначенияДляОтбора,
	//	|";
	//КонецЕсли;   
	//Локация назначения
	Если ВыборкаУслуг.ЛокацияНазначения = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		ТекстПолей = ТекстПолей + "АкцептУслуги.СтанцияНазначения КАК ЛокацияНазначенияДляОтбора,
		|ИСТИНА КАК ЗаполненЛокацияНазначенияДляОтбора,
		|";
	ИначеЕсли ВыборкаУслуг.ЛокацияНазначения = Перечисления.ВидыПоискаАвтоакцепт.МягкийПоиск  
		//ИЛИ ВыборкаУслуг.ПунктыОтправленияНазначения = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск 
		Тогда
		ТекстПолей = ТекстПолей + "ВЫБОР КОГДА НЕ АкцептУслуги.СтанцияНазначения.Ссылка ЕСТЬ NULL ТОГДА АкцептУслуги.СтанцияНазначения ИНАЧЕ Неопределено КОНЕЦ КАК ЛокацияНазначенияДляОтбора,
		|ВЫБОР КОГДА НЕ АкцептУслуги.СтанцияНазначения.Ссылка ЕСТЬ NULL ТОГДА Истина ИНАЧЕ Ложь КОНЕЦ КАК ЗаполненЛокацияНазначенияДляОтбора,
		|";
	Иначе
		//ТекстПолей = "Значение(Справочник.Локации.ПустаяСсылка) КАК СтанцияОтправления,
		ТекстПолей = ТекстПолей + "Неопределено КАК ЛокацияНазначенияДляОтбора,
		|ЛОЖЬ КАК ЗаполненЛокацияНазначенияДляОтбора,
		|";
	КонецЕсли;   
	////Пункты отправления назначения
	//Если ВыборкаУслуг.ПунктыОтправленияНазначения = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск 
	//	ИЛИ ВыборкаУслуг.РодителиПунктовОтправленияНазначения = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
	//	ТекстПолей = ТекстПолей + "ИСТИНА КАК ЗаполненПунктыОтправленияНазначенияДляОтбора,
	//	|";
	//Иначе
	//	ТекстПолей = ТекстПолей + "ЛОЖЬ КАК ЗаполненПунктыОтправленияНазначенияДляОтбора,
	//	|";
	//КонецЕсли;     
	//Клиент
	Если ВыборкаУслуг.Клиент = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		ТекстПолей = ТекстПолей + "АкцептУслуги.КлиентРасхода КАК КлиентДляОтбора,
		|ИСТИНА КАК ЗаполненКлиентДляОтбора,
		|";
	ИначеЕсли ВыборкаУслуг.Клиент = Перечисления.ВидыПоискаАвтоакцепт.МягкийПоиск Тогда
		ТекстПолей = ТекстПолей + "ВЫБОР КОГДА НЕ АкцептУслуги.КлиентРасхода = Значение(Справочник.Контрагенты.ПустаяСсылка) ТОГДА АкцептУслуги.КлиентРасхода ИНАЧЕ Неопределено КОНЕЦ КАК КлиентДляОтбора,
		|ВЫБОР КОГДА НЕ АкцептУслуги.КлиентРасхода = Значение(Справочник.Контрагенты.ПустаяСсылка) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ  КАК ЗаполненКлиентДляОтбора,
		|";
	Иначе
		ТекстПолей = ТекстПолей + "Неопределено КАК КлиентДляОтбора,
		|ЛОЖЬ КАК ЗаполненКлиентДляОтбора,
		|";
	КонецЕсли;
	//Поставщик
	Если ВыборкаУслуг.Поставщик = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		ТекстПолей = ТекстПолей + "ВЫРАЗИТЬ(&Поступление КАК Документ.ПоступлениеТоваровУслуг).Контрагент КАК ПоставщикДляОтбора,
		|ИСТИНА КАК ЗаполненПостащикДляОтбора,
		|";
	Иначе
		ТекстПолей = ТекстПолей + "Неопределено КАК ПоставщикДляОтбора,
		|ЛОЖЬ КАК ЗаполненПоставщикДляОтбора,
		|";
	КонецЕсли;  
	//Период оказания услуг
	Если ВыборкаУслуг.ПериодОказанияУслуги = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		ТекстПолей = ТекстПолей + "
		|АкцептУслуги.НачалоОказанияУслуги КАК НачалоОказанияУслугиДляОтбора,
		|АкцептУслуги.ОкончаниеОказанияУслуги КАК ОкончаниеОказанияУслугиДляОтбора,
		|ИСТИНА КАК ЗаполненПериодОказанияУслугиДляОтбора,
		|";
	Иначе                  
		//Евросиб - АСуслов 20.01.2023 11:22:15 #63097
		//(
		//Евросиб - АСуслов 20.01.2023 11:22:17 #63097
		//ТекстПолей = ТекстПолей + "ДАТАВРЕМЯ(3999,1,1) КАК НачалоОказанияУслугиДляОтбора,
		//|ДАТАВРЕМЯ(1,1,1) КАК ОкончаниеОказанияУслугиДляОтбора,
		//|ЛОЖЬ КАК ЗаполненПериодОказанияУслугиДляОтбора,
		//|";
		//Евросиб - АСуслов 20.01.2023 11:22:17 #63097
		ТекстПолей = ТекстПолей + "ДАТАВРЕМЯ(1,1,1) КАК НачалоОказанияУслугиДляОтбора,
		|ДАТАВРЕМЯ(1,1,1) КАК ОкончаниеОказанияУслугиДляОтбора,
		|ЛОЖЬ КАК ЗаполненПериодОказанияУслугиДляОтбора,
		|";
		//)
	КонецЕсли;  
	Если ВыборкаУслуг.ИспользоватьРезультатДляПричиныНеурега Тогда
		ТекстПолей = ТекстПолей + "ИСТИНА КАК ИспользоватьРезультатДляПричиныНеурега,
		|";
	Иначе
		ТекстПолей = ТекстПолей + "ЛОЖЬ КАК ИспользоватьРезультатДляПричиныНеурега,
		|";
	КонецЕсли;  
	//Евросиб - АСуслов 12.10.2023 17:19:19 #69742
	//(
	Если ВыборкаУслуг.ВыбиратьПоРазницеСумм Тогда
		ТекстПолей = ТекстПолей + "ИСТИНА КАК ВыбиратьПоРазницеСумм,
		|";
	Иначе
		ТекстПолей = ТекстПолей + "ЛОЖЬ КАК ВыбиратьПоРазницеСумм,
		|";
	КонецЕсли;  
	//)
	//Евросиб - АСуслов 12.10.2023 17:19:21 #69742
	Если ВыборкаУслуг.ПревышениеСуммы = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		ТекстПолей = ТекстПолей + "АкцептУслуги.ПоступлениеСумма / 2 КАК СуммаДляОтбора,
		|ИСТИНА КАК ЗаполненСуммаДляОтбора,
		|";
	ИначеЕсли ВыборкаУслуг.ПревышениеСуммы = Перечисления.ВидыПоискаАвтоакцепт.ДополнительныйПоиск Тогда
		ТекстПолей = ТекстПолей + "АкцептУслуги.ПоступлениеСумма / 2 КАК СуммаДляОтбора,
		|ЛОЖЬ КАК ЗаполненСуммаДляОтбора,
		|";
	Иначе
		//ТекстПолей = "Значение(Документ.ТранспортныйДокумент.ПустаяСсылка) КАК ТранспортныйДокумент,
		ТекстПолей = ТекстПолей + "0 КАК СуммаДляОтбора,
		|ЛОЖЬ КАК ЗаполненСуммаДляОтбора,
		|";
	КонецЕсли;                                                               
	Если Не ДляОписанияПричиныНеурегов Тогда
		//Если ВыборкаУслуг.РодительСтанцииОтправления = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		//	ТекстПолей = ТекстПолей + "АкцептУслуги.СтанцияОтправления.Родитель КАК СтанцияОтправленияРодительДляОтбора,
		//	|ИСТИНА КАК ЗаполненСтанцияОтправленияРодительДляОтбора,
		//	|";
		//ИначеЕсли ВыборкаУслуг.РодительСтанцииОтправления = Перечисления.ВидыПоискаАвтоакцепт.МягкийПоиск
		//	ИЛИ ВыборкаУслуг.РодителиПунктовОтправленияНазначения = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		//	ТекстПолей = ТекстПолей + "ВЫБОР КОГДА НЕ ЕСТЬNULL(АкцептУслуги.СтанцияОтправления.Родитель,Значение(Справочник.Локации.ПустаяСсылка)) = Значение(Справочник.Локации.ПустаяСсылка) ТОГДА АкцептУслуги.СтанцияОтправления.Родитель ИНАЧЕ Неопределено КОНЕЦ КАК СтанцияОтправленияРодительДляОтбора,
		//	|ВЫБОР КОГДА НЕ ЕСТЬNULL(АкцептУслуги.СтанцияОтправления.Родитель,Значение(Справочник.Локации.ПустаяСсылка)) = Значение(Справочник.Локации.ПустаяСсылка) ТОГДА Истина ИНАЧЕ Ложь КОНЕЦ КАК ЗаполненСтанцияОтправленияРодительДляОтбора,
		//	|";
		//Иначе
		//	//ТекстПолей = "Значение(Справочник.Локации.ПустаяСсылка) КАК СтанцияНазначения
		//	ТекстПолей = ТекстПолей + "Неопределено КАК СтанцияОтправленияРодительДляОтбора,
		//	|ЛОЖЬ КАК ЗаполненСтанцияОтправленияРодительДляОтбора,
		//	|";
		//КонецЕсли;
		//Если ВыборкаУслуг.СинонимыСтанцииОтправления = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		//	ТекстПолей = ТекстПолей + "АналогиЛокацийДляСтанцийОтправления.Аналог КАК СтанцияОтправленияСинонимыДляОтбора,
		//	|ИСТИНА КАК ЗаполненСтанцияОтправленияСинонимыДляОтбора,
		//	|";
		//Иначе
		//	//ТекстПолей = "Значение(Справочник.Локации.ПустаяСсылка) КАК СтанцияНазначения
		//	ТекстПолей = ТекстПолей + "Неопределено КАК СтанцияОтправленияСинонимыДляОтбора,
		//	|ЛОЖЬ КАК ЗаполненСтанцияОтправленияСинонимыДляОтбора,
		//	|";
		//КонецЕсли;
		//Если ВыборкаУслуг.СинонимыСтанцииНазначения = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		//	ТекстПолей = ТекстПолей + "АналогиЛокацийДляСтанцийНазначения.Аналог КАК СтанцияНазначенияСинонимыДляОтбора,
		//	|ИСТИНА КАК ЗаполненСтанцияНазначенияСинонимыДляОтбора,
		//	|";
		//Иначе
		//	//ТекстПолей = "Значение(Справочник.Локации.ПустаяСсылка) КАК СтанцияНазначения
		//	ТекстПолей = ТекстПолей + "Неопределено КАК СтанцияНазначенияСинонимыДляОтбора,
		//	|ЛОЖЬ КАК ЗаполненСтанцияНазначенияСинонимыДляОтбора,
		//	|";
		//КонецЕсли;
		//Если ВыборкаУслуг.РодительСтанцииНазначения = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		//	ТекстПолей = ТекстПолей + "АкцептУслуги.СтанцияНазначения.Родитель КАК СтанцияНазначенияРодительДляОтбора,
		//	|ИСТИНА КАК ЗаполненСтанцияНазначенияРодительДляОтбора,
		//	|";
		//ИначеЕсли ВыборкаУслуг.РодительСтанцииОтправления = Перечисления.ВидыПоискаАвтоакцепт.МягкийПоиск 
		//	ИЛИ ВыборкаУслуг.РодителиПунктовОтправленияНазначения = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		//	ТекстПолей = ТекстПолей + "ВЫБОР КОГДА НЕ ЕСТЬNULL(АкцептУслуги.СтанцияНазначения.Родитель,Значение(Справочник.Локации.ПустаяСсылка)) = Значение(Справочник.Локации.ПустаяСсылка) ТОГДА АкцептУслуги.СтанцияНазначения.Родитель ИНАЧЕ Неопределено КОНЕЦ КАК СтанцияНазначенияРодительДляОтбора,
		//	|ВЫБОР КОГДА НЕ ЕСТЬNULL(АкцептУслуги.СтанцияНазначения.Родитель,Значение(Справочник.Локации.ПустаяСсылка)) = Значение(Справочник.Локации.ПустаяСсылка) ТОГДА Истина ИНАЧЕ Ложь КОНЕЦ КАК ЗаполненСтанцияНазначенияРодительДляОтбора,
		//	|";
		//Иначе
		//	//ТекстПолей = "Значение(Справочник.Локации.ПустаяСсылка) КАК СтанцияНазначения
		//	ТекстПолей = ТекстПолей + "Неопределено КАК СтанцияНазначенияРодительДляОтбора,
		//	|ЛОЖЬ КАК ЗаполненСтанцияНазначенияРодительДляОтбора,
		//	|";
		//КонецЕсли;
		//Если ВыборкаУслуг.СинонимыСтанцииОтправления = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		//	ТекстПолей = ТекстПолей + "АкцептУслуги.СтанцияОтправления КАК СтанцияОтправленияСинонимДляОтбора,
		//	|ИСТИНА КАК ЗаполненСтанцияОтправленияСинонимДляОтбора,
		//	|";
		//ИначеЕсли ВыборкаУслуг.СинонимыСтанцииОтправления = Перечисления.ВидыПоискаАвтоакцепт.МягкийПоиск Тогда
		//	ТекстПолей = ТекстПолей + "ВЫБОР КОГДА НЕ ЕСТЬNULL(АкцептУслуги.СтанцияОтправления,Значение(Справочник.Локации.ПустаяСсылка)) = Значение(Справочник.Локации.ПустаяСсылка) ТОГДА АкцептУслуги.СтанцияОтправления ИНАЧЕ Неопределено КОНЕЦ КАК СтанцияОтправленияСинонимДляОтбора,
		//	|ВЫБОР КОГДА НЕ ЕСТЬNULL(АкцептУслуги.СтанцияНазначения.Родитель,Значение(Справочник.Локации.ПустаяСсылка)) = Значение(Справочник.Локации.ПустаяСсылка) ТОГДА Истина ИНАЧЕ Ложь КОНЕЦ КАК ЗаполненСтанцияОтправленияСинонимДляОтбора,
		//	|";
		//Иначе
		//	//ТекстПолей = "Значение(Справочник.Локации.ПустаяСсылка) КАК СтанцияНазначения
		//	ТекстПолей = ТекстПолей + "Неопределено КАК СтанцияОтправленияСинонимДляОтбора,
		//	|ЛОЖЬ КАК ЗаполненСтанцияОтправленияСинонимДляОтбора,
		//	|";
		//КонецЕсли;
		//Если ВыборкаУслуг.СинонимыСтанцииНазначения = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		//	ТекстПолей = ТекстПолей + "АкцептУслуги.СтанцияНазначения КАК СтанцияНазначенияСинонимДляОтбора,
		//	|ИСТИНА КАК ЗаполненСтанцияНазначенияСинонимДляОтбора,
		//	|";
		//ИначеЕсли ВыборкаУслуг.СинонимыСтанцииНазначения = Перечисления.ВидыПоискаАвтоакцепт.МягкийПоиск Тогда
		//	ТекстПолей = ТекстПолей + "ВЫБОР КОГДА НЕ ЕСТЬNULL(АкцептУслуги.СтанцияНазначения,Значение(Справочник.Локации.ПустаяСсылка)) = Значение(Справочник.Локации.ПустаяСсылка) ТОГДА АкцептУслуги.СтанцияНазначения ИНАЧЕ Неопределено КОНЕЦ КАК СтанцияНазначенияСинонимДляОтбора,
		//	|ВЫБОР КОГДА НЕ ЕСТЬNULL(АкцептУслуги.СтанцияНазначения.Родитель,Значение(Справочник.Локации.ПустаяСсылка)) = Значение(Справочник.Локации.ПустаяСсылка) ТОГДА Истина ИНАЧЕ Ложь КОНЕЦ КАК ЗаполненСтанцияНазначенияСинонимДляОтбора,
		//	|";
		//Иначе
		//	//ТекстПолей = "Значение(Справочник.Локации.ПустаяСсылка) КАК СтанцияНазначения
		//	ТекстПолей = ТекстПолей + "Неопределено КАК СтанцияНазначенияСинонимДляОтбора,
		//	|ЛОЖЬ КАК ЗаполненСтанцияНазначенияСинонимДляОтбора,
		//	|";
		//КонецЕсли;
	КонецЕсли;
	ТекстПолей = ТекстПолей + СтрШаблон("%1 КАК ВозможноПовторноеРазнесение", Формат(ВыборкаУслуг.ВозможноПовторноеРазнесение,"БЛ=Ложь; БИ=Истина"));
	Возврат ТекстПолей;
	
КонецФункции 

Функция ПолучитьТекстУсловийСоединенияУслугДляОтбораРасходы(ВыборкаУникальныхОтборов, РежимБитыеСсылки)
	
	//здесь настраиваются условия соединения с расходами сделки
	//в зависимости от вида поиска:
	//основной - обязательное условие
	//мягкий - условие только при заполненном значении (ВыборкаУникальныхОтборов.ЗаполненРеквизитДляОтбора
	//может быть как ложь, так и истина, в зависимости от заполненности значения в акцепте см. ПолучитьТекстПолейДляАвтоакцепта
	
	ТекстУсловийСоединений = "СделкаРасходы.Услуга = ВТ_УслугиДляОтбора.НоменклатураСопоставления
	|";
	Если ВыборкаУникальныхОтборов.ЗаполненКонтейнерДляОтбора Тогда
		ТекстУсловийСоединений = ТекстУсловийСоединений + " И СделкаРасходы.Контейнер = ВТ_УслугиДляОтбора.КонтейнерДляОтбора
		|";
	Иначе
		ТекстУсловийСоединений = ТекстУсловийСоединений + " И ВТ_УслугиДляОтбора.ЗаполненКонтейнерДляОтбора = ЛОЖЬ
		|";
	КонецЕсли;
	Если ВыборкаУникальныхОтборов.ЗаполненВагонДляОтбора Тогда
		ТекстУсловийСоединений = ТекстУсловийСоединений + " И СделкаРасходы.Вагон = ВТ_УслугиДляОтбора.ВагонДляОтбора
		|";
	Иначе
		ТекстУсловийСоединений = ТекстУсловийСоединений + " И ВТ_УслугиДляОтбора.ЗаполненВагонДляОтбора = ЛОЖЬ
		|";
	КонецЕсли;                                                               
	Если ВыборкаУникальныхОтборов.ЗаполненТранспортныйДокументДляОтбора Тогда
		ТекстУсловийСоединений = ТекстУсловийСоединений + " И СделкаРасходы.ТранспортныйДокумент = ВТ_УслугиДляОтбора.ТранспортныйДокументДляОтбора
		|";                                                                  
	Иначе
		ТекстУсловийСоединений = ТекстУсловийСоединений + " И ВТ_УслугиДляОтбора.ЗаполненТранспортныйДокументДляОтбора = ЛОЖЬ
		|";
	КонецЕсли;                                                               
	//Если ВыборкаУникальныхОтборов.ЗаполненСтанцияОтправленияДляОтбора Тогда
	//	ТекстУсловийСоединений = ТекстУсловийСоединений + " И СделкаРасходы.ПунктОтправления = ВТ_УслугиДляОтбора.СтанцияОтправленияДляОтбора
	//	|";                                                   
	//КонецЕсли;                                                               
	
	// по локациям отдельный запрос
	//Если ВыборкаУникальныхОтборов.ЗаполненЛокацияОтправленияДляОтбора Тогда
	//	ТекстУсловийСоединений = ТекстУсловийСоединений + " И СделкаРасходы.ПунктОтправления = ВТ_УслугиДляОтбора.ЛокацияОтправленияДляОтбора
	//	|";                                                   
	//КонецЕсли;                                                               
	//Если ВыборкаУникальныхОтборов.ЗаполненСтанцияОтправленияРодительДляОтбора Тогда
	//	//Евросиб - АСуслов 09.11.2022 13:54:26 #60352
	//	//(
	//	//ТекстУсловийСоединений = ТекстУсловийСоединений + " И (СделкаРасходы.ПунктОтправления = ВТ_УслугиДляОтбора.СтанцияОтправленияРодительДляОтбора
	//	//|  														ИЛИ СделкаРасходы.ПунктОтправления.Родитель = ВТ_УслугиДляОтбора.СтанцияОтправленияРодительДляОтбора	
	//	//|";                                                   
	//	ТекстУсловийСоединений = ТекстУсловийСоединений + " И СделкаРасходы.ПунктОтправления.Родитель = ВТ_УслугиДляОтбора.СтанцияОтправленияРодительДляОтбора
	//	|";                                                   
	//	//)
	//	//Евросиб - АСуслов 09.11.2022 13:54:27 #60352
	//КонецЕсли;                                                               
	//Если ВыборкаУникальныхОтборов.ЗаполненСтанцияНазначенияДляОтбора Тогда
	//	ТекстУсловийСоединений = ТекстУсловийСоединений + " И СделкаРасходы.ПунктНазначения = ВТ_УслугиДляОтбора.СтанцияНазначенияДляОтбора
	//	|";
	//КонецЕсли;
	
	// по локациям отдельный запрос
	//Если ВыборкаУникальныхОтборов.ЗаполненЛокацияНазначенияДляОтбора Тогда
	//	ТекстУсловийСоединений = ТекстУсловийСоединений + " И СделкаРасходы.ПунктНазначения = ВТ_УслугиДляОтбора.ЛокацияНазначенияДляОтбора
	//	|";
	//КонецЕсли;
	//Если ВыборкаУникальныхОтборов.ЗаполненСтанцияНазначенияРодительДляОтбора Тогда
	//	//Евросиб - АСуслов 09.11.2022 13:55:19 #60352
	//	//(
	//	//ТекстУсловийСоединений = ТекстУсловийСоединений + " И (СделкаРасходы.ПунктНазначения = ВТ_УслугиДляОтбора.СтанцияНазначенияРодительДляОтбора
	//	//|  														ИЛИ СделкаРасходы.ПунктНазначения.Родитель = ВТ_УслугиДляОтбора.СтанцияНазначенияРодительДляОтбора
	//	//|";
	//	ТекстУсловийСоединений = ТекстУсловийСоединений + " И СделкаРасходы.ПунктНазначения.Родитель = ВТ_УслугиДляОтбора.СтанцияНазначенияРодительДляОтбора
	//	|";
	//	//)
	//	//Евросиб - АСуслов 09.11.2022 13:55:20 #60352
	//КонецЕсли;
	//Если ВыборкаУникальныхОтборов.ЗаполненСтанцияОтправленияСинонимыДляОтбора Тогда
	//	ТекстУсловийСоединений = ТекстУсловийСоединений + " И СделкаРасходы.ПунктОтправления = ВТ_УслугиДляОтбора.СтанцияОтправленияСинонимыДляОтбора
	//	|";
	//КонецЕсли;
	//Если ВыборкаУникальныхОтборов.ЗаполненСтанцияНазначенияСинонимыДляОтбора Тогда
	//	ТекстУсловийСоединений = ТекстУсловийСоединений + " И СделкаРасходы.ПунктНазначения = ВТ_УслугиДляОтбора.СтанцияНазначенияСинонимыДляОтбора
	//	|";
	//КонецЕсли;
	Если ВыборкаУникальныхОтборов.ЗаполненСуммаДляОтбора Тогда
		ТекстУсловийСоединений = ТекстУсловийСоединений + " И СделкаРасходы.СуммаИтого >= ВТ_УслугиДляОтбора.СуммаДляОтбора
		|";
	Иначе
		ТекстУсловийСоединений = ТекстУсловийСоединений + " И ВТ_УслугиДляОтбора.ЗаполненСуммаДляОтбора = ЛОЖЬ
		|";
	КонецЕсли;
	Если ВыборкаУникальныхОтборов.ЗаполненПоставщикДляОтбора Тогда
		ТекстУсловийСоединений = ТекстУсловийСоединений + " И СделкаРасходы.Поставщик = ВТ_УслугиДляОтбора.ПоставщикДляОтбора
		|"; 
	Иначе
		ТекстУсловийСоединений = ТекстУсловийСоединений + "И ВТ_УслугиДляОтбора.ЗаполненПоставщикДляОтбора = ЛОЖЬ
		|"; 
	КонецЕсли;
	Если ВыборкаУникальныхОтборов.ИспользоватьРезультатДляПричиныНеурега Тогда
		ТекстУсловийСоединений = ТекстУсловийСоединений + " И ВТ_УслугиДляОтбора.ИспользоватьРезультатДляПричиныНеурега
		|";
	КонецЕсли;
//Евросиб - АСуслов 12.10.2023 17:22:31 #69742
//(
	Если ВыборкаУникальныхОтборов.ВыбиратьПоРазницеСумм Тогда
		ТекстУсловийСоединений = ТекстУсловийСоединений + " И ВТ_УслугиДляОтбора.ВыбиратьПоРазницеСумм
		|";
	КонецЕсли;
//)
//Евросиб - АСуслов 12.10.2023 17:22:33 #69742
	Если РежимБитыеСсылки Тогда
		ТекстУсловийСоединений = ТекстУсловийСоединений + " И СделкаРасходы.Ссылка = ВТ_УслугиДляОтбора.Сделка
		|";
	КонецЕсли;
	Возврат ТекстУсловийСоединений;
		
КонецФункции

Функция ПолучитьТекстУсловийСоединенияУслугДляОтбораСвязьУчетныхЕдиниц(ВыборкаУникальныхОтборов, РежимБитыеСсылки)
	
	//здесь настраиваются условия соединения с составом поезда сделки
	//в зависимости от вида поиска:
	//основной - обязательное условие
	//мягкий - условие только при заполненном значении (ВыборкаУникальныхОтборов.ЗаполненРеквизитДляОтбора
	//может быть как ложь, так и истина, в зависимости от заполненности значения в акцепте см. ПолучитьТекстПолейДляАвтоакцепта
	//Евросиб - АСуслов 19.01.2023 12:31:24 #63097
	//(                                     
	
	Если ВыборкаУникальныхОтборов.АлгоритмПодбораСделокПоПериоду = 1
		ИЛИ ВыборкаУникальныхОтборов.АлгоритмПодбораСделокПоПериоду = 0 Тогда
		//отбор чтобы период оказания услуги в акцепте был полностью внутри периода перевозки сделки (если даты заполнены)
		ТекстУсловийСоединений = 		
		//"СделкаРасходы.СтрокаСвязьУчетныхЕдиниц = СделкаСвязьУчетныхЕдиниц.ГУИД 
		//|				И ВЫБОР
		//|					КОГДА ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.ЖДН.ДатаРаскредитации, ДАТАВРЕМЯ(1,1,1)) > ДАТАВРЕМЯ(1,1,1) 
		//|  							ИЛИ ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.Коносамент.ДатаПрибытия, ДАТАВРЕМЯ(1, 1, 1)) > ДАТАВРЕМЯ(1, 1, 1)  
		//|  							ИЛИ ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.ДатаПодачиАвтоПодВыгрузку, ДАТАВРЕМЯ(1, 1, 1)) > ДАТАВРЕМЯ(1, 1, 1) ТОГДА
		//|                   		ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.ЖДН.ДатаРаскредитации, ДАТАВРЕМЯ(1,1,1)) >= ВТ_УслугиДляОтбора.ОкончаниеОказанияУслугиДляОтбора 
		//|  								ИЛИ ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.Коносамент.ДатаПрибытия, ДАТАВРЕМЯ(1, 1, 1)) >= ВТ_УслугиДляОтбора.ОкончаниеОказанияУслугиДляОтбора
		//|  								ИЛИ ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.ДатаПодачиАвтоПодВыгрузку, ДАТАВРЕМЯ(1, 1, 1)) >= КОНЕЦПЕРИОДА(ВТ_УслугиДляОтбора.ОкончаниеОказанияУслугиДляОтбора, ДЕНЬ) 
		//|  	                    ИНАЧЕ ИСТИНА КОНЕЦ
		//|  	                    И
		//|					ВЫБОР КОГДА ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.ЖДН.ДатаОтправления, ДАТАВРЕМЯ(1,1,1)) > ДАТАВРЕМЯ(1,1,1) 
		//|  							ИЛИ ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.Коносамент.ДатаОтправления, ДАТАВРЕМЯ(1, 1, 1)) > ДАТАВРЕМЯ(1, 1, 1) ТОГДА
		//|                   		ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.ЖДН.ДатаОтправления, ДАТАВРЕМЯ(1,1,1)) <= КОНЕЦПЕРИОДА(ВТ_УслугиДляОтбора.НачалоОказанияУслугиДляОтбора, ДЕНЬ) 
		//|  								ИЛИ ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.Коносамент.ДатаОтправления, ДАТАВРЕМЯ(1, 1, 1)) <= КОНЕЦПЕРИОДА(ВТ_УслугиДляОтбора.НачалоОказанияУслугиДляОтбора, ДЕНЬ)
		//|  	                    ИНАЧЕ ИСТИНА КОНЕЦ
		//|"; 
		//"СделкаРасходы.СтрокаСвязьУчетныхЕдиниц = КлючиАналитикиСоставаПоезда.ИдентификаторКлюча 
		//|               И (КлючиАналитикиСоставаПоезда.ДатаПрибытия    >= ВТ_УслугиДляОтбора.ОкончаниеОказанияУслугиДляОтбора ИЛИ КлючиАналитикиСоставаПоезда.ДатаПрибытия = ДатаВремя(1,1,1))
		//|  				И  (КлючиАналитикиСоставаПоезда.ДатаОтправления <= КОНЕЦПЕРИОДА(ВТ_УслугиДляОтбора.НачалоОказанияУслугиДляОтбора, ДЕНЬ) ИЛИ ВТ_УслугиДляОтбора.НачалоОказанияУслугиДляОтбора = ДатаВремя(1,1,1)) 
		//|"; 
		"СделкаРасходы.СтрокаСвязьУчетныхЕдиниц = КлючиАналитикиСоставаПоезда.ИдентификаторКлюча 
		|	И КлючиАналитикиСоставаПоезда.ДатаПрибытия >= ВТ_УслугиДляОтбора.ОкончаниеОказанияУслугиДляОтбора	
		|	И (КлючиАналитикиСоставаПоезда.ДатаОтправления <= КОНЕЦПЕРИОДА(ВТ_УслугиДляОтбора.НачалоОказанияУслугиДляОтбора, ДЕНЬ) 
		|  		И КлючиАналитикиСоставаПоезда.ДатаОтправления <> ДатаВремя(1,1,1)
		|		ИЛИ ВТ_УслугиДляОтбора.НачалоОказанияУслугиДляОтбора = ДатаВремя(1,1,1))";
	ИначеЕсли ВыборкаУникальныхОтборов.АлгоритмПодбораСделокПоПериоду = 2 Тогда
		//отбор чтобы период перевозки и период оказания услуги пересекались
		ТекстУсловийСоединений = 		
		"СделкаРасходы.СтрокаСвязьУчетныхЕдиниц = КлючиАналитикиСоставаПоезда.ИдентификаторКлюча 
		|		И (ДОБАВИТЬКДАТЕ(КлючиАналитикиСоставаПоезда.ДатаОтправления, ДЕНЬ, -ВТ_УслугиДляОтбора.ИнтервалПериодаОпределенияСделокДоДатыНачалаПеревозки) <= ВТ_УслугиДляОтбора.ОкончаниеОказанияУслугиДляОтбора ИЛИ ВТ_УслугиДляОтбора.ОкончаниеОказанияУслугиДляОтбора = ДатаВремя(1,1,1))
		|		И ДОБАВИТЬКДАТЕ(КлючиАналитикиСоставаПоезда.ДатаПрибытия, ДЕНЬ, ВТ_УслугиДляОтбора.ИнтервалПериодаОпределенияСделокПослеДатыОкончанияПеревозки) >= ВТ_УслугиДляОтбора.НачалоОказанияУслугиДляОтбора
		|"; 
	КонецЕсли;
	//)
	//Евросиб - АСуслов 19.01.2023 12:31:26 #63097
	Если ВыборкаУникальныхОтборов.ЗаполненКлиентДляОтбора Тогда                      
		//Евросиб - АСуслов 20.01.2023 12:42:20 #63097
		//(
		//ТекстУсловийСоединений = ТекстУсловийСоединений + "И СделкаСвязьУчетныхЕдиниц.Клиент = ВТ_УслугиДляОтбора.КлиентДляОтбора
		ТекстУсловийСоединений = ТекстУсловийСоединений + "
		|	И КлючиАналитикиСоставаПоезда.Клиент = ВТ_УслугиДляОтбора.КлиентДляОтбора
		//)
		//Евросиб - АСуслов 20.01.2023 12:42:28 #63097                                                                              
		|";
	Иначе
		ТекстУсловийСоединений = ТекстУсловийСоединений + "
		|	И ВТ_УслугиДляОтбора.ЗаполненКлиентДляОтбора = ЛОЖЬ
		|";
	КонецЕсли;
	Возврат ТекстУсловийСоединений;
		
КонецФункции

Процедура ДополнитьШаблонЗапросаСинонимамиЛокаций(ШаблонЗапроса, ВыборкаУслуг)

	СоединениеАналогиСтанции = "";
	//Если ВыборкаУслуг.СинонимыСтанцииОтправления Тогда
	//	СоединениеАналогиСтанции = СоединениеАналогиСтанции + "
	//	|ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АналогиЛокаций КАК АналогиЛокацийДляСтанцийОтправления
	//	|ПО АкцептУслуги.СтанцияОтправления = АналогиЛокацийДляСтанцийОтправления.Локация";
	//КонецЕсли;
	//Если ВыборкаУслуг.СинонимыСтанцииНазначения Тогда
	//	СоединениеАналогиСтанции = СоединениеАналогиСтанции + "
	//	|ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АналогиЛокаций КАК АналогиЛокацийДляСтанцийНазначения
	//	|ПО АкцептУслуги.СтанцияНазначения = АналогиЛокацийДляСтанцийНазначения.Локация";
	//КонецЕсли;
	//Если ЗначениеЗаполнено(СоединениеАналогиСтанции) Тогда
	//	ШаблонЗапросаСинонимы = ШаблонЗапроса;         
	//	ШаблонЗапросаСинонимы = СтрЗаменить(ШаблонЗапросаСинонимы, "ВТ_АкцептУслуги КАК АкцептУслуги", "ВТ_АкцептУслуги КАК АкцептУслуги
	//																									|"+СоединениеАналогиСтанции);
	//	Если ВыборкаУслуг.СинонимыСтанцииОтправления = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
	//		ШаблонЗапросаСинонимы = СтрЗаменить(ШаблонЗапросаСинонимы, "АкцептУслуги.СтанцияОтправления КАК СтанцияОтправления", "АналогиЛокацийДляСтанцийОтправления.Аналог КАК СтанцияОтправления");
	//	КонецЕсли;
	//	Если ВыборкаУслуг.СинонимыСтанцииНазначения = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
	//		ШаблонЗапросаСинонимы = СтрЗаменить(ШаблонЗапросаСинонимы, "АкцептУслуги.СтанцияНазначения КАК СтанцияНазначения", "АналогиЛокацийДляСтанцийНазначения.Аналог КАК СтанцияНазначения");
	//	КонецЕсли;
	//	ШаблонЗапроса = ШаблонЗапросаСинонимы;
	//КонецЕсли;
	//убираем условие, по синонимам ищем всегда
	//Если ВыборкаУслуг.СинонимыСтанцииОтправления = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		СоединениеАналогиСтанции = СоединениеАналогиСтанции + "
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АналогиЛокаций КАК АналогиЛокацийДляСтанцийОтправления
		|ПО АкцептУслуги.СтанцияОтправления = АналогиЛокацийДляСтанцийОтправления.Локация";
	//КонецЕсли;
	//Если ВыборкаУслуг.СинонимыСтанцииНазначения = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
		СоединениеАналогиСтанции = СоединениеАналогиСтанции + "
		|ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АналогиЛокаций КАК АналогиЛокацийДляСтанцийНазначения
		|ПО АкцептУслуги.СтанцияНазначения = АналогиЛокацийДляСтанцийНазначения.Локация";
	//КонецЕсли;
	//Если ЗначениеЗаполнено(СоединениеАналогиСтанции) Тогда
		ШаблонЗапросаСинонимы = ШаблонЗапроса;         
		ШаблонЗапросаСинонимы = СтрЗаменить(ШаблонЗапросаСинонимы, "ВТ_АкцептУслуги КАК АкцептУслуги", "ВТ_АкцептУслуги КАК АкцептУслуги
																										|"+СоединениеАналогиСтанции);
		//Если ВыборкаУслуг.СинонимыСтанцииОтправления = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
			ШаблонЗапросаСинонимы = СтрЗаменить(ШаблонЗапросаСинонимы, "АкцептУслуги.СтанцияОтправления КАК СтанцияОтправления", "АналогиЛокацийДляСтанцийОтправления.Аналог КАК СтанцияОтправления");
		//КонецЕсли;
		//Если ВыборкаУслуг.СинонимыСтанцииНазначения = Перечисления.ВидыПоискаАвтоакцепт.ОсновнойПоиск Тогда
			ШаблонЗапросаСинонимы = СтрЗаменить(ШаблонЗапросаСинонимы, "АкцептУслуги.СтанцияНазначения КАК СтанцияНазначения", "АналогиЛокацийДляСтанцийНазначения.Аналог КАК СтанцияНазначения");
		//КонецЕсли;
		ШаблонЗапроса = ШаблонЗапросаСинонимы;
	//КонецЕсли;
	
КонецПроцедуры
//)
//Евросиб - АСуслов 12.05.2022 14:19:23 #51399
//Евросиб - АСуслов 17.08.2022 17:06:49 #55129
//(
Функция ПолучитьТекстЗапросаОтборовПоРегиструРазнесениеЗатратПТУ()
	Возврат "ВЫБРАТЬ
	|	РазнесениеРасходовОстатки.Сделка КАК Сделка,
	|	РазнесениеРасходовОстатки.ГУИДРасходов КАК ГУИДРасходов,
	|	РазнесениеРасходовОстатки.ДокументПТУ КАК УчДокумент,
	|	ВТ_УслугиДляОтбора.Номенклатура КАК Номенклатура,
	|	ВТ_УслугиДляОтбора.Контейнер КАК Контейнер,
	|	ВТ_УслугиДляОтбора.Вагон КАК Вагон,
	|	ВТ_УслугиДляОтбора.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	ВТ_УслугиДляОтбора.СтанцияОтправления КАК СтанцияОтправления,
	|	ВТ_УслугиДляОтбора.СтанцияНазначения КАК СтанцияНазначения,
	|	ВТ_УслугиДляОтбора.КонтейнерДляОтбора КАК КонтейнерДляОтбора,
	|	ВТ_УслугиДляОтбора.ВагонДляОтбора КАК ВагонДляОтбора,
	|	ВТ_УслугиДляОтбора.ТранспортныйДокументДляОтбора КАК ТранспортныйДокументДляОтбора,
	|	ВТ_УслугиДляОтбора.СтанцияОтправленияДляОтбора КАК СтанцияОтправленияДляОтбора,
	|	ВТ_УслугиДляОтбора.СтанцияНазначенияДляОтбора КАК СтанцияНазначенияДляОтбора,
	|	ВТ_УслугиДляОтбора.ВозможноПовторноеРазнесение КАК ВозможноПовторноеРазнесение,
	|	ВТ_УслугиДляОтбора.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ТаблицаРезультата
	|ИЗ
	|	РегистрНакопления.РазнесениеЗатратПТУ.Остатки КАК РазнесениеРасходовОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_УслугиДляОтбора КАК ВТ_УслугиДляОтбора
	|			ПО (&УсловиеСоединенияУслугДляОтбора)
	|		ПО РазнесениеРасходовОстатки.Сделка = СделкаРасходы.Ссылка
	|			И РазнесениеРасходовОстатки.ГУИДРасходов = СделкаРасходы.ГУИД
	|ГДЕ
	|	РазнесениеРасходовОстатки.ПолностьюРазнесеноОстаток <> 0";
КонецФункции

Функция ПолучитьТекстЗапросаОтборовПоРегиструРазнесениеРасходов()
	Возврат 
	"ВЫБРАТЬ
	|	РазнесениеРасходовОстатки.Сделка КАК Сделка,
	|	РазнесениеРасходовОстатки.ГУИДРасходов КАК ГУИДРасходов,
	|	НЕОПРЕДЕЛЕНО КАК УчДокумент,
	|	ВТ_УслугиДляОтбора.Номенклатура КАК Номенклатура,
	|	ВТ_УслугиДляОтбора.Контейнер КАК Контейнер,
	|	ВТ_УслугиДляОтбора.Вагон КАК Вагон,
	|	ВТ_УслугиДляОтбора.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	ВТ_УслугиДляОтбора.СтанцияОтправления КАК СтанцияОтправления,
	|	ВТ_УслугиДляОтбора.СтанцияНазначения КАК СтанцияНазначения,
	|	ВТ_УслугиДляОтбора.КонтейнерДляОтбора КАК КонтейнерДляОтбора,
	|	ВТ_УслугиДляОтбора.ВагонДляОтбора КАК ВагонДляОтбора,
	|	ВТ_УслугиДляОтбора.ТранспортныйДокументДляОтбора КАК ТранспортныйДокументДляОтбора,
	//|	ВТ_УслугиДляОтбора.СтанцияОтправленияДляОтбора КАК СтанцияОтправленияДляОтбора,
	//|	ВТ_УслугиДляОтбора.СтанцияНазначенияДляОтбора КАК СтанцияНазначенияДляОтбора,
	|	ВТ_УслугиДляОтбора.ЛокацияОтправленияДляОтбора КАК ЛокацияОтправленияДляОтбора,
	|	ВТ_УслугиДляОтбора.ЛокацияНазначенияДляОтбора КАК ЛокацияНазначенияДляОтбора,
	|	ВТ_УслугиДляОтбора.НачалоОказанияУслугиДляОтбора КАК НачалоОказанияУслугиДляОтбора,
	|	ВТ_УслугиДляОтбора.ОкончаниеОказанияУслугиДляОтбора КАК ОкончаниеОказанияУслугиДляОтбора,
	|	ВТ_УслугиДляОтбора.КлиентДляОтбора КАК КлиентДляОтбора,
	|	ВТ_УслугиДляОтбора.ПоставщикДляОтбора КАК ПоставщикДляОтбора,
	|	ВТ_УслугиДляОтбора.ВозможноПовторноеРазнесение КАК ВозможноПовторноеРазнесение,
	|	ВТ_УслугиДляОтбора.ИспользоватьРезультатДляПричиныНеурега КАК ИспользоватьРезультатДляПричиныНеурега,
	|	ВТ_УслугиДляОтбора.Приоритет КАК Приоритет,
	//Евросиб - АСуслов 12.10.2023 15:40:13 #69742
	//(
	|	ВТ_УслугиДляОтбора.ВыбиратьПоРазницеСумм КАК ВыбиратьПоРазницеСумм,
	|	ВТ_УслугиДляОтбора.ПоступлениеСумма КАК ПоступлениеСумма,
	|	ВЫБОР КОГДА ВТ_УслугиДляОтбора.ПоступлениеСумма > СделкаРасходы.СуммаИтого ТОГДА ВТ_УслугиДляОтбора.ПоступлениеСумма - СделкаРасходы.СуммаИтого ИНАЧЕ СделкаРасходы.СуммаИтого - ВТ_УслугиДляОтбора.ПоступлениеСумма КОНЕЦ КАК РасхождениеСумм,
	//)
	//Евросиб - АСуслов 12.10.2023 15:40:22 #69742
	|	СделкаРасходы.СуммаИтого КАК СуммаРасходПлан,
	|   СделкаРасходы.ПунктОтправления КАК СделкаПунктОтправления,
	|   СделкаРасходы.ПунктНазначения КАК СделкаПунктНазначения,
	// Евросиб US 94184 TA 98095 Рыбьяков К.А. 13.03.2025 ((
	|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	// Евросиб Рыбьяков К.А. 13.03.2025 ))
	|   ВТ_УслугиДляОтбора.ЗаполненЛокацияОтправленияДляОтбора,
	|   ВТ_УслугиДляОтбора.ЗаполненЛокацияНазначенияДляОтбора,
	|   ВТ_УслугиДляОтбора.ПриоритетЛокаций КАК ПриоритетЛокаций
	|ПОМЕСТИТЬ ВТ_ТаблицаРезультатаБезЛокаций
	|ИЗ
	|	РегистрНакопления.РазнесениеРасходов.Остатки КАК РазнесениеРасходовОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_УслугиДляОтбора КАК ВТ_УслугиДляОтбора
	|			ПО (&УсловиеСоединенияУслугДляОтбораРасходы)
	//Евросиб - АСуслов 19.01.2023 19:39:01 #63097
	//(
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	//|			ПО (&УсловиеСоединенияУслугДляОтбораСУЕ)
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КлючиАналитикиСоставаПоезда КАК КлючиАналитикиСоставаПоезда
	//|			ПО (&УсловиеСоединенияУслугДляОтбораКлючейАналитикиСоставаПоезда)
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиСоставаПоезда КАК КлючиАналитикиСоставаПоезда
	|			ПО (&УсловиеСоединенияУслугДляОтбораКлючейАналитикиСоставаПоезда)
	//)
	//Евросиб - АСуслов 19.01.2023 19:39:10 #63097
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПодачАвтоПодВыгрузку КАК ДатыПодачАвтоПодВыгрузку
	//|			ПО СделкаРасходы.СтрокаСвязьУчетныхЕдиниц = ДатыПодачАвтоПодВыгрузку.ИдентификаторСвязьУчетныхЕдиниц
	|		ПО РазнесениеРасходовОстатки.Сделка = СделкаРасходы.Ссылка
	|			И РазнесениеРасходовОстатки.ГУИДРасходов = СделкаРасходы.ГУИД
	|ГДЕ
	|	РазнесениеРасходовОстатки.НеРазнесеноОстаток > 0";
	//|	И ЕСТЬNULL(ДатыПодачАвтоПодВыгрузку.Дата, ДАТАВРЕМЯ(1, 1, 1)) <= ВТ_УслугиДляОтбора.НачалоОказанияУслугиДляОтбора
	//|	И ЕСТЬNULL(ДатыПодачАвтоПодВыгрузку.Дата, ДАТАВРЕМЯ(3999, 1, 1)) >= ВТ_УслугиДляОтбора.ОкончаниеОказанияУслугиДляОтбора";
КонецФункции                                  

Процедура ЗаполнитьПричиныИКомментарииНеурега(СтрокаАкцепта, СтрокаТаблицыАвтоакцепта, ПричинаНеурега = Неопределено)
	МассивОбязательныхПолей = ПолучитьМассивОбязательныхПолей(СтрокаТаблицыАвтоакцепта);
	ТекстНеурегКомментарий = ""; 
	Если ЗначениеЗаполнено(ПричинаНеурега) Тогда
		СтрокаАкцепта.Неурег = ПричинаНеурега;
	ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицыАвтоакцепта.ПоискПричинаНеурега) Тогда
		СтрокаАкцепта.Неурег = СтрокаТаблицыАвтоакцепта.ПоискПричинаНеурега;
	Иначе	
		СтрокаАкцепта.Неурег = Справочники.ПричиныНеурегулированныхРасходов.НеНайденыСтрокиРасходовВСделках;
		ТекстНеурегКомментарий = СтрШаблон("Поля для поиска: %1. Авторазнесение невозможно", СтрСоединить(МассивОбязательныхПолей, "/"));
	КонецЕсли;               
	Если СтрокаАкцепта.Неурег = Справочники.ПричиныНеурегулированныхРасходов.НеНайденыСтрокиРасходовВСделкахПоПериоду Тогда
		//ШаблонНеурегКомментарий = "Период поиска с %1 по %2";	
		//ТекстНеурегКомментарий = СтрШаблон(ШаблонНеурегКомментарий, СтрокаТаблицыАвтоакцепта.НачалоОказанияУслугиДляОтбора, СтрокаТаблицыАвтоакцепта.ОкончаниеОказанияУслугиДляОтбора);
		ШаблонКомментарияНеурега = "Период поиска: %1";
		ТекстПериодаПоискаС = ""; 
		ТекстПериодаПоискаПо = "";
		Если ЗначениеЗаполнено(СтрокаТаблицыАвтоакцепта.НачалоОказанияУслугиДляОтбора) Тогда
			ТекстПериодаПоискаС = СтрШаблон("с %1", Формат(СтрокаТаблицыАвтоакцепта.НачалоОказанияУслугиДляОтбора, "ДФ=dd.MM.yyyy"));
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТаблицыАвтоакцепта.ОкончаниеОказанияУслугиДляОтбора) Тогда
			ТекстПериодаПоискаПо = СтрШаблон(" по %1", Формат(СтрокаТаблицыАвтоакцепта.ОкончаниеОказанияУслугиДляОтбора, "ДФ=dd.MM.yyyy"));
		КонецЕсли;                                                              
		ТекстПериодаПоиска = СокрЛП(СтрШаблон("%1%2", ТекстПериодаПоискаС, ТекстПериодаПоискаПо));
		ТекстНеурегКомментарий = СтрШаблон(ШаблонКомментарияНеурега, ТекстПериодаПоиска); 
	ИначеЕсли СтрокаАкцепта.Неурег = Справочники.ПричиныНеурегулированныхРасходов.ФактПревышаетПланВНесколькоРаз Тогда            
		Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТаблицыАвтоакцепта.Сделка, "Номер, Дата");
		СделкаПредставление = СтрШаблон("%1/%2", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Данные.Номер), Формат(Данные.Дата,"ДФ=yyyy"));
		ТекстНеурегКомментарий = СтрШаблон("Поля для поиска: %1. Найденные сделки: %2", СтрСоединить(МассивОбязательныхПолей, "/"), СделкаПредставление);
	КонецЕсли;
	СтрокаАкцепта.НеурегКомментарий = ТекстНеурегКомментарий;
КонецПроцедуры

Функция ПолучитьМассивОбязательныхПолей(СтрокаТаблицыАвтоакцепта, ДляОписанияПричинНеурега = Ложь, ПроверятьЗаполненныеЗначения = Ложь)
	МассивОбязательныхПолей = Новый Массив;
	Если СтрокаТаблицыАвтоакцепта.ЗаполненКонтейнерДляОтбора 
		И (НЕ ПроверятьЗаполненныеЗначения 
			ИЛИ НЕ ЗначениеЗаполнено(СтрокаТаблицыАвтоакцепта.Контейнер)) Тогда
		МассивОбязательныхПолей.Добавить("Контейнер");
	КонецЕсли;
	Если СтрокаТаблицыАвтоакцепта.ЗаполненВагонДляОтбора 
		И (НЕ ПроверятьЗаполненныеЗначения 
			ИЛИ НЕ ЗначениеЗаполнено(СтрокаТаблицыАвтоакцепта.Вагон)) Тогда
		МассивОбязательныхПолей.Добавить("Вагон");
	КонецЕсли;
	Если СтрокаТаблицыАвтоакцепта.ЗаполненТранспортныйДокументДляОтбора 
		И (НЕ ПроверятьЗаполненныеЗначения ИЛИ НЕ ЗначениеЗаполнено(СтрокаТаблицыАвтоакцепта.ТранспортныйДокумент)) Тогда 
		МассивОбязательныхПолей.Добавить("Накладная");
	КонецЕсли;
	Если СтрокаТаблицыАвтоакцепта.ЗаполненКлиентДляОтбора 
		И (НЕ ПроверятьЗаполненныеЗначения ИЛИ НЕ ЗначениеЗаполнено(СтрокаТаблицыАвтоакцепта.КлиентРасхода)) Тогда 
		МассивОбязательныхПолей.Добавить("Под клиента");
	КонецЕсли;   
	//убрал, такого не может быть
	//Если СтрокаТаблицыАвтоакцепта.ЗаполненПоставщикДляОтбора Тогда
	//	МассивОбязательныхПолей.Добавить("Поставщик");
	//КонецЕсли;
	//Если СтрокаТаблицыАвтоакцепта.ЗаполненСтанцияОтправленияДляОтбора 
	//	И (НЕ ПроверятьЗаполненныеЗначения ИЛИ НЕ ЗначениеЗаполнено(СтрокаТаблицыАвтоакцепта.СтанцияОтправления)) Тогда 
	//	МассивОбязательныхПолей.Добавить("Станция отправления");
	//КонецЕсли;
	Если СтрокаТаблицыАвтоакцепта.ЗаполненПериодОказанияУслугиДляОтбора 
		И (НЕ ПроверятьЗаполненныеЗначения 
			ИЛИ (НЕ ЗначениеЗаполнено(СтрокаТаблицыАвтоакцепта.НачалоОказанияУслуги)
					И НЕ ЗначениеЗаполнено(СтрокаТаблицыАвтоакцепта.ОкончаниеОказанияУслуги))) Тогда
		МассивОбязательныхПолей.Добавить("Начало оказания услуги ИЛИ Окончание оказания услуги");
	КонецЕсли;
	//Если СтрокаТаблицыАвтоакцепта.ЗаполненСтанцияНазначенияДляОтбора 
	//	И (НЕ ПроверятьЗаполненныеЗначения ИЛИ НЕ ЗначениеЗаполнено(СтрокаТаблицыАвтоакцепта.СтанцияНазначения)) Тогда 
	//	МассивОбязательныхПолей.Добавить("Станция назначения");
	//КонецЕсли;
	Если СтрокаТаблицыАвтоакцепта.ЗаполненЛокацияОтправленияДляОтбора 
		И (НЕ ПроверятьЗаполненныеЗначения ИЛИ НЕ ЗначениеЗаполнено(СтрокаТаблицыАвтоакцепта.СтанцияОтправления)) Тогда 
		МассивОбязательныхПолей.Добавить("Станция отправления");
	КонецЕсли;
	Если СтрокаТаблицыАвтоакцепта.ЗаполненЛокацияНазначенияДляОтбора 
		И (НЕ ПроверятьЗаполненныеЗначения ИЛИ НЕ ЗначениеЗаполнено(СтрокаТаблицыАвтоакцепта.СтанцияНазначения)) Тогда 
		МассивОбязательныхПолей.Добавить("Станция назначения");
	КонецЕсли;
	Если СтрокаТаблицыАвтоакцепта.ЗаполненСуммаДляОтбора Тогда
		МассивОбязательныхПолей.Добавить(СтрШаблон("Сумма больше %1", СтрокаТаблицыАвтоакцепта.СуммаДляОтбора));
	КонецЕсли;    
	Если НЕ ДляОписанияПричинНеурега Тогда
		//Если СтрокаТаблицыАвтоакцепта.ЗаполненСтанцияОтправленияРодительДляОтбора Тогда
		//	МассивОбязательныхПолей.Добавить("Станция отправления (родитель)");
		//КонецЕсли;
		//Если СтрокаТаблицыАвтоакцепта.ЗаполненСтанцияОтправленияСинонимыДляОтбора Тогда
		//	МассивОбязательныхПолей.Добавить("Станция отправления (+синонимы)");
		//КонецЕсли;
		//Если СтрокаТаблицыАвтоакцепта.ЗаполненСтанцияНазначенияРодительДляОтбора Тогда
		//	МассивОбязательныхПолей.Добавить("Станция назначения (родитель)");
		//КонецЕсли;
		//Если СтрокаТаблицыАвтоакцепта.ЗаполненСтанцияНазначенияСинонимыДляОтбора Тогда
		//	МассивОбязательныхПолей.Добавить("Станция назначения (+синонимы)");
		//КонецЕсли;
	КонецЕсли;
	Возврат МассивОбязательныхПолей;
КонецФункции

Функция ПолучитьТекстЗаменыПолностьюРазнесеноОстатокДляРежимаБитыхСсылок()
	Возврат "РазнесениеЗатратПТУОстатки.УслугаОтключена = Ложь
	|	И (РазнесениеЗатратПТУОстатки.УчДокумент = &Поступление 
	|	ИЛИ ВЫБОР КОГДА ВТ_УслугиДляОтбора.ВозможноПовторноеРазнесение ТОГДА ИСТИНА
	|		ИНАЧЕ РазнесениеЗатратПТУОстатки.УчДокумент = Значение(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
	|		КОНЕЦ)";
КонецФункции

Процедура ЗафиксироватьОтсутствиеПеревозки(АкцептОбъект)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	//|	НАЧАЛОПЕРИОДА(СделкаСвязьУчетныхЕдиниц.ЖДН.ДатаОтправления, ДЕНЬ) КАК ДатаОтправления,
	//|	ВЫБОР
	//|		КОГДА СделкаСвязьУчетныхЕдиниц.ЖДН.ДатаРаскредитации = ДАТАВРЕМЯ(1, 1, 1)
	//|			ТОГДА ДАТАВРЕМЯ(3999, 1, 1)
	//|		ИНАЧЕ СделкаСвязьУчетныхЕдиниц.ЖДН.ДатаРаскредитации
	//|	КОНЕЦ КАК ДатаПрибытия,
	//|	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Ссылка
	//|ПОМЕСТИТЬ ВТ_КонтейнерыВСделках
	//|ИЗ
	//|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	//|ГДЕ
	//|	СделкаСвязьУчетныхЕдиниц.Контейнер В(&КонтейнерыСписок)
	//|	И НЕ СделкаСвязьУчетныхЕдиниц.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	//|	И НЕ СделкаСвязьУчетныхЕдиниц.ОтключитьРасходы
	//|	И НЕ СделкаСвязьУчетныхЕдиниц.Удалена
	//|	И НЕ СделкаСвязьУчетныхЕдиниц.Ссылка.Служебная
	//|	И СделкаСвязьУчетныхЕдиниц.Ссылка.Проведен
	//|	И НЕ СделкаСвязьУчетныхЕдиниц.ЖДН = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	СделкаСвязьУчетныхЕдиниц.Контейнер,
	//|	СделкаСвязьУчетныхЕдиниц.Коносамент.ДатаОтправления,
	//|	ВЫБОР
	//|		КОГДА СделкаСвязьУчетныхЕдиниц.Коносамент.ДатаПрибытия = ДАТАВРЕМЯ(1, 1, 1)
	//|			ТОГДА ДАТАВРЕМЯ(3999, 1, 1)
	//|		ИНАЧЕ СделкаСвязьУчетныхЕдиниц.Коносамент.ДатаПрибытия
	//|	КОНЕЦ,
	//|	СделкаСвязьУчетныхЕдиниц.Ссылка
	//|ИЗ
	//|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	//|ГДЕ
	//|	СделкаСвязьУчетныхЕдиниц.Контейнер В(&КонтейнерыСписок)
	//|	И НЕ СделкаСвязьУчетныхЕдиниц.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	//|	И НЕ СделкаСвязьУчетныхЕдиниц.ОтключитьРасходы
	//|	И НЕ СделкаСвязьУчетныхЕдиниц.Удалена
	//|	И НЕ СделкаСвязьУчетныхЕдиниц.Ссылка.Служебная
	//|	И СделкаСвязьУчетныхЕдиниц.Ссылка.Проведен
	//|	И НЕ СделкаСвязьУчетныхЕдиниц.Коносамент = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	СделкаСвязьУчетныхЕдиниц.Контейнер,
	//|	ДАТАВРЕМЯ(3999, 1, 1),
	//|	ДатыПодачАвтоПодВыгрузку.Дата,
	//|	СделкаСвязьУчетныхЕдиниц.Ссылка
	//|ИЗ
	//|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПодачАвтоПодВыгрузку КАК ДатыПодачАвтоПодВыгрузку
	//|		ПО СделкаСвязьУчетныхЕдиниц.ГУИД = ДатыПодачАвтоПодВыгрузку.ИдентификаторСвязьУчетныхЕдиниц
	//|ГДЕ
	//|	СделкаСвязьУчетныхЕдиниц.Контейнер В(&КонтейнерыСписок)
	//|	И НЕ СделкаСвязьУчетныхЕдиниц.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	//|	И НЕ СделкаСвязьУчетныхЕдиниц.ОтключитьРасходы
	//|	И НЕ СделкаСвязьУчетныхЕдиниц.Удалена
	//|	И НЕ СделкаСвязьУчетныхЕдиниц.Ссылка.Служебная
	//|	И СделкаСвязьУчетныхЕдиниц.Ссылка.Проведен
	//|;
	"ВЫБРАТЬ
	|	КлючиАналитикиСоставаПоезда.Контейнер КАК Контейнер,
	|	КлючиАналитикиСоставаПоезда.ДатаОтправления КАК ДатаОтправления,
	|	КлючиАналитикиСоставаПоезда.ДатаПрибытия КАК ДатаПрибытия,
	|	КлючиАналитикиСоставаПоезда.Сделка КАК Сделка
	|ПОМЕСТИТЬ ВТ_КонтейнерыВСделках
	|ИЗ
	|	Справочник.КлючиАналитикиСоставаПоезда КАК КлючиАналитикиСоставаПоезда
	|ГДЕ
	|	КлючиАналитикиСоставаПоезда.Контейнер В(&КонтейнерыСписок)
	|	И КлючиАналитикиСоставаПоезда.Активность
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КонтейнерыВСделках.Контейнер КАК Контейнер,
	|	МИНИМУМ(ВТ_КонтейнерыВСделках.ДатаОтправления) КАК ДатаОтправления,
	|	МАКСИМУМ(ВТ_КонтейнерыВСделках.ДатаПрибытия) КАК ДатаПрибытия,
	|	ВТ_КонтейнерыВСделках.Сделка КАК Сделка
	|ПОМЕСТИТЬ ВТ_КонтейнерыСДатамиПеревозки
	|ИЗ
	|	ВТ_КонтейнерыВСделках КАК ВТ_КонтейнерыВСделках
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_КонтейнерыВСделках.Контейнер,
	|	ВТ_КонтейнерыВСделках.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КонтейнерыСДатамиПеревозки.Контейнер КАК Контейнер,
	|	ВТ_КонтейнерыСДатамиПеревозки.Сделка КАК Сделка,
	|	ВТ_КонтейнерыСДатамиПеревозки.ДатаОтправления КАК ДатаОтправления,
	|	ВТ_КонтейнерыСДатамиПеревозки.ДатаПрибытия КАК ДатаПрибытия
	|ПОМЕСТИТЬ ВТ_НайденныеСделки
	|ИЗ
	|	ВТ_КонтейнерыСДатамиПеревозки КАК ВТ_КонтейнерыСДатамиПеревозки
	|ГДЕ
	|(&НачалоПериодаАкцепта МЕЖДУ ВТ_КонтейнерыСДатамиПеревозки.ДатаОтправления И ВТ_КонтейнерыСДатамиПеревозки.ДатаПрибытия
	|		ИЛИ &ОкончаниеПериодаАкцепта МЕЖДУ ВТ_КонтейнерыСДатамиПеревозки.ДатаОтправления И ВТ_КонтейнерыСДатамиПеревозки.ДатаПрибытия
	|		ИЛИ (&НачалоПериодаАкцепта < ВТ_КонтейнерыСДатамиПеревозки.ДатаОтправления И КОНЕЦПЕРИОДА(&ОкончаниеПериодаАкцепта, ДЕНЬ) > ВТ_КонтейнерыСДатамиПеревозки.ДатаПрибытия))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НайденныеСделки.Контейнер КАК Контейнер,
	|	ВТ_НайденныеСделки.Сделка КАК Сделка,
	|	ВТ_НайденныеСделки.ДатаОтправления КАК ДатаОтправления,
	|	ВТ_НайденныеСделки.ДатаПрибытия КАК ДатаПрибытия
	|ИЗ
	|	ВТ_НайденныеСделки КАК ВТ_НайденныеСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|ГДЕ
	|   СделкаСвязьУчетныхЕдиниц.Ссылка В (ВЫБРАТЬ т.Сделка ИЗ ВТ_НайденныеСделки КАК т) 
	|	И НЕ СделкаСвязьУчетныхЕдиниц.Коносамент = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|   И СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения = Значение(Перечисление.ВидыТранспортныхСообщений.Море)";
	ДатаВходящегоДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АкцептОбъект.Поступление, "ДатаВходящегоДокумента");
	ИнтервалПериодаОпределенияСделокДоДатыВходящегоДокумента = Константы.ИнтервалПериодаОпределенияСделокДоДатыВходящегоДокумента.Получить();
	ИнтервалПериодаОпределенияСделокПослеДатыВходящегоДокумента = Константы.ИнтервалПериодаОпределенияСделокПослеДатыВходящегоДокумента.Получить();
	СекундВДне = 60 * 60 * 24;
	ПериодНачалаОпределенияСделки = ДатаВходящегоДокумента - ИнтервалПериодаОпределенияСделокДоДатыВходящегоДокумента * СекундВДне;
	ПериодОкончанияОпределенияСделки = ДатаВходящегоДокумента + ИнтервалПериодаОпределенияСделокПослеДатыВходящегоДокумента * СекундВДне;
	Запрос.УстановитьПараметр("КонтейнерыСписок", АкцептОбъект.Услуги.ВыгрузитьКолонку("Контейнер")); 
	Запрос.УстановитьПараметр("НачалоПериодаАкцепта", ПериодНачалаОпределенияСделки);
	Запрос.УстановитьПараметр("ОкончаниеПериодаАкцепта", ПериодОкончанияОпределенияСделки);
	//Евросиб - АСуслов 18.01.2023 16:15:08 #63097
	//(
	//РезультатЗапроса = Запрос.Выполнить();
	//ТаблицаКонтейнеровСоСделками = РезультатЗапроса.Выгрузить();
	//ТаблицаКонтейнеровСоСделками.Индексы.Добавить("Контейнер");
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	КоличествоРезультатов = РезультатыЗапроса.Количество();
	ТаблицаКонтейнеровСоСделками = РезультатыЗапроса[КоличествоРезультатов-2].Выгрузить();
	ТаблицаКонтейнеровСоСделками.Индексы.Добавить("Контейнер");
	
	ТаблицаКонтейнеровСКоносаментами = РезультатыЗапроса[КоличествоРезультатов-1].Выгрузить();
	ТаблицаКонтейнеровСКоносаментами.Индексы.Добавить("Контейнер");
	//)
	//Евросиб - АСуслов 18.01.2023 16:15:23 #63097
	//Евросиб Каблов 02.12.2024 ( #94191
	СписокНоменклатуры = ОбщегоНазначенияКлиентСервер.СвернутьМассив(АкцептОбъект.Услуги.ВыгрузитьКолонку("Номенклатура"));
	СоответствиеМассивовСписокОбязательныхПолейВАкцепте = Документы.Акцепт.ПолучитьСоответствиеМассивовСписокОбязательныхПолейВАкцептеПоСпискуНоменклатуры(СписокНоменклатуры);
	//Евросиб Каблов 02.12.2024 )
	Для каждого СтрокаУслуга Из АкцептОбъект.Услуги Цикл
		Если СтрокаУслуга.Неурег = Справочники.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ
			ИЛИ ЗначениеЗаполнено(СтрокаУслуга.Сделка) Тогда
			Продолжить;
		КонецЕсли; 
		//Евросиб Каблов 02.12.2024 ( #94191
		МассивСписокОбязательныхПолейВАкцепте = СоответствиеМассивовСписокОбязательныхПолейВАкцепте.Получить(СтрокаУслуга.Номенклатура);
		НезаполненныеОбязательныеПоля = Новый Массив;
		Для каждого ИмяОбязательногоПоляВАкцепте Из МассивСписокОбязательныхПолейВАкцепте Цикл
			Если Не ЗначениеЗаполнено(СтрокаУслуга[ИмяОбязательногоПоляВАкцепте]) Тогда
				НезаполненныеОбязательныеПоля.Добавить(ИмяОбязательногоПоляВАкцепте);
			КонецЕсли;
		КонецЦикла;
		Если ЗначениеЗаполнено(НезаполненныеОбязательныеПоля) Тогда
			СтрокаУслуга.Неурег = Справочники.ПричиныНеурегулированныхРасходов.НеЗаполненыОбязательныеПоляВАкцепте;
			ТекстПричиныНеурега = СтрШаблон("Не заполнены поля: %1. Авторазнесение невозможно", СтрСоединить(НезаполненныеОбязательныеПоля, ", "));
			СтрокаУслуга.НеурегКомментарий = ТекстПричиныНеурега;
			Продолжить;
		ИначеЕсли СтрокаУслуга.Неурег = Справочники.ПричиныНеурегулированныхРасходов.НеЗаполненыОбязательныеПоляВАкцепте Тогда
			СтрокаУслуга.Неурег = Справочники.ПричиныНеурегулированныхРасходов.ПустаяСсылка();
			СтрокаУслуга.НеурегКомментарий = "";
		КонецЕсли;
		//Евросиб Каблов 02.12.2024 )
		Если ЗначениеЗаполнено(СтрокаУслуга.Контейнер)  //если контейнер заполнен и его нет в списке сделок, то ставим причину "нет сделки"
			И ТаблицаКонтейнеровСоСделками.Найти(СтрокаУслуга.Контейнер, "Контейнер") = Неопределено Тогда
			СтрокаУслуга.Неурег = Справочники.ПричиныНеурегулированныхРасходов.НетСделки;
			ШаблонКомментарияНеурега = "Поля для поиска: Контейнер; Период поиска: %1";
			ТекстПериодаПоискаС = "";
			ТекстПериодаПоискаПо = "";
			Если ЗначениеЗаполнено(ПериодНачалаОпределенияСделки) Тогда
				ТекстПериодаПоискаС = СтрШаблон("с %1", Формат(ПериодНачалаОпределенияСделки, "ДФ=dd.MM.yyyy"));
			КонецЕсли;
			Если ЗначениеЗаполнено(ПериодОкончанияОпределенияСделки) Тогда
				ТекстПериодаПоискаПо = СтрШаблон(" по %1", Формат(ПериодОкончанияОпределенияСделки, "ДФ=dd.MM.yyyy"));
			КонецЕсли;                                                              
			ТекстПериодаПоиска = СокрЛП(СтрШаблон("%1%2", ТекстПериодаПоискаС, ТекстПериодаПоискаПо));
			СтрокаУслуга.НеурегКомментарий = СтрШаблон(ШаблонКомментарияНеурега, ТекстПериодаПоиска); 
			//Евросиб - АСуслов 18.01.2023 16:26:41 #63097
			//(
		ИначеЕсли ЗначениеЗаполнено(СтрокаУслуга.Контейнер)
			И СтрокаУслуга.Номенклатура = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("УслугаФрахтаДляКалькуляции")
			И ТаблицаКонтейнеровСКоносаментами.Найти(СтрокаУслуга.Контейнер, "Контейнер") = Неопределено Тогда
			СтрокаУслуга.Неурег = Справочники.ПричиныНеурегулированныхРасходов.КоносаментНеПодобран;
			МассивСделок = ТаблицаКонтейнеровСоСделками.Скопировать(Новый Структура("Контейнер", СтрокаУслуга.Контейнер), "Сделка").ВыгрузитьКолонку("Сделка");
			РеквизитыСделок = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивСделок, "Номер, Дата");
			МассивПредставленийСделок = Новый Массив;
			Для каждого РеквизитыСделки Из РеквизитыСделок Цикл
				МассивПредставленийСделок.Добавить(СтрШаблон("%1/%2", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(РеквизитыСделки.Значение.Номер), Формат(РеквизитыСделки.Значение.Дата,"ДФ=yyyy")));
			КонецЦикла;
			ШаблонКомментарияНеурега = "Найденные сделки: %1. Авторазнесение невозможно";
			СтрокаУслуга.НеурегКомментарий = СтрШаблон(ШаблонКомментарияНеурега, СтрСоединить(МассивПредставленийСделок, ";")); 
			//)
			//Евросиб - АСуслов 18.01.2023 16:26:43 #63097	
		ИначеЕсли СтрокаУслуга.Неурег = Справочники.ПричиныНеурегулированныхРасходов.НетСделки
			//в любом случае, если контейнер не заполнен 
			//или он есть в сделках и причина уже заполнена как "нет сделки", то очищаем
			//Евросиб - АСуслов 18.01.2023 16:50:48 #63097
			//(
			ИЛИ СтрокаУслуга.Неурег = Справочники.ПричиныНеурегулированныхРасходов.КоносаментНеПодобран
			//или он есть в сделках и есть коносаменты, а причина "не подобран коносамент"
			//)
			//Евросиб - АСуслов 18.01.2023 16:50:52 #63097
			Тогда 
			СтрокаУслуга.Неурег = Неопределено;
			СтрокаУслуга.НеурегКомментарий = "";
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ЗаписатьАвторазнесениеАкцепта(ПТУ, НАкцепт, НЗ, ДатаНачалаРазнесенияПТУ, ОписаниеЗамера, ТаблицаЛогирования)
	СтруктураРезультата = Новый Структура("РезультатРазнесения, ТаблицаЛогирования");
	// - SIV 22-12-2020
	РеквизитыПТУ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НАкцепт.Поступление, "ВалютаДокумента, ДатаВходящегоДокумента");
	ВалютаПТУ = РеквизитыПТУ.ВалютаДокумента;
	ДатаПТУ = РеквизитыПТУ.ДатаВходящегоДокумента;

	Для Каждого ТекСтрокаУслуги Из НАкцепт.Услуги Цикл
		Если ЗначениеЗаполнено(ТекСтрокаУслуги.Сделка) Тогда
			ТекСтрокаУслуги.Сумма = ТекСтрокаУслуги.ПоступлениеСумма;
			ТекСтрокаУслуги.СуммаНДС = ТекСтрокаУслуги.ПоступлениеСуммаНДС;
		КонецЕсли;
	КонецЦикла;
	НАкцепт.СуммаАкцепта = НАкцепт.Услуги.Итог("Сумма");
	
	ПериодВОАкцепта = Мин(НАкцепт.ПериодВО, НАкцепт.ПериодБУ);
	ДополнитьСтрокиАкцептовДаннымиСделки(НАкцепт,Истина,ПериодВОАкцепта);
	
//Евросиб Гудкова( 05.02.2021 Ticket№ 0220495
	ПредыдущийАкцепт = Документы.Акцепт.ПолучитьДанныеПоследнегоПроведенногоАкцепта(ПТУ).АкцептСсылка;
//Евросиб Гудкова( 17.02.2022 Ticket№ 

// Евросиб Гудкова)  
	//Евросиб - АСуслов 20.12.2022 21:27:46 #63258
	//(
	СписокПолейСравненияАкцепта = Константы.СписокПолейСравненияАкцепта.Получить();
	//ИзмененийНет = ОбщегоНазначения.КоллекцииИдентичны(ПредыдущийАкцепт.Услуги.выгрузить(), НАкцепт.Услуги.выгрузить(),,?(ДатаПТУ <Дата("20210101"),"ВидЗатрат",""), Истина);
	ИзмененийНет = ОбщегоНазначения.КоллекцииИдентичны(ПредыдущийАкцепт.Услуги.выгрузить(, СписокПолейСравненияАкцепта), НАкцепт.Услуги.выгрузить(, СписокПолейСравненияАкцепта), СписокПолейСравненияАкцепта,?(ДатаПТУ <Дата("20210101"),"ВидЗатрат",""), Истина);
	//)
	//Евросиб - АСуслов 20.12.2022 21:27:48 #63258
	Если ИзмененийНет Тогда
		
		//Евросиб Каблов 02.08.2023 ( #64831
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		//Евросиб Каблов 02.08.2023 )
		
		ДЗ(ПТУ, ПредыдущийАкцепт, НЗ, "Акцепт отработан");
		ЗаписатьПротоколАвторазнесенияПТУ(ПТУ, ПредыдущийАкцепт, ДатаНачалаРазнесенияПТУ, Истина);
//Евросиб Гудкова( 07.12.2021 Ticket№ 42922
		ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, 1, "АкцептНеИзменён");
// Евросиб Гудкова)       
		Для каждого СтрокаЛог Из ТаблицаЛогирования Цикл
			СтрокаЛог.Акцепт = Строка(ПредыдущийАкцепт);
		КонецЦикла;
		СтруктураРезультата.ТаблицаЛогирования = ТаблицаЛогирования;
		СтруктураРезультата.РезультатРазнесения = СтрШаблон("%1: Авторазнесение завершено. Акцепт не изменён.", ПТУ);
		Возврат СтруктураРезультата;
		//Возврат ТаблицаЛогирования;
		
	КонецЕсли;
	Ошибка = Ложь;
//Евросиб Гудкова)
	Попытка
		нАкцепт.УстановитьКомментарийВерсииИсторииДанных("Авторазнесение новый алгоритм");
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НАкцепт.Поступление, "Проведен") Тогда
			НАкцепт.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			НАкцепт.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли; 
		ДЗ(ПТУ, НАкцепт.Ссылка,НЗ, "Акцепт отработан");
		
		//Евросиб Каблов 02.08.2023 ( #64831
		Если ТранзакцияАктивна() Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		//Евросиб Каблов 02.08.2023 )
		
	Исключение
		Ошибка = Истина;
		ОО = ОписаниеОшибки();
		
		//Евросиб Каблов 02.08.2023 ( #64831
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		//Евросиб Каблов 02.08.2023 )
		
		ДЗ(ПТУ, НАкцепт.Ссылка,НЗ, "Ошибка отработки акцепта: " + ОО);
	КонецПопытки;
	ЗаписатьПротоколАвторазнесенияПТУ(ПТУ, ПредыдущийАкцепт, ДатаНачалаРазнесенияПТУ, Истина);
//Евросиб Гудкова( 07.12.2021 Ticket№ 42922
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, 1, ?(Ошибка, "ОшибкаЗаписиАкцепта", "АкцептЗаписан"));
// Евросиб Гудкова)
	СтруктураРезультата.РезультатРазнесения = СтрШаблон("%1: Авторазнесение завершено. %2", ПТУ, ?(Ошибка, "Ошибка записи акцепта.", ""));
    Возврат СтруктураРезультата;
		
КонецФункции

Процедура ЗаписьДанныхОчередиАвторазнесения(Поступление, ТолькоИзменятьЗапись = Истина, СостояниеАвторазнесения = Неопределено, ДатаРазнесения = Неопределено) Экспорт
	мз = РегистрыСведений.ОчередьАвторазнесения.СоздатьМенеджерЗаписи();
	мз.Поступление = Поступление;
	Если СостояниеАвторазнесения = Неопределено
		ИЛИ ДатаРазнесения = Неопределено 
		ИЛИ ТолькоИзменятьЗапись Тогда
		мз.Прочитать();
		Если мз.Выбран() Тогда
			Если СостояниеАвторазнесения = Неопределено Тогда
				СостояниеАвторазнесения = мз.СостояниеАвторазнесения;
			КонецЕсли;
			Если ДатаРазнесения = Неопределено Тогда
				ДатаРазнесения = мз.ДатаРазнесения;
			КонецЕсли;        
		ИначеЕсли ТолькоИзменятьЗапись Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	мз.Поступление = Поступление;
	мз.СостояниеАвторазнесения = СостояниеАвторазнесения;
	мз.ДатаРазнесения = ДатаРазнесения;
	мз.Записать();
КонецПроцедуры

Процедура ИсключитьИзОчередиАвторазнесения(Поступление) Экспорт
	мз = РегистрыСведений.ОчередьАвторазнесения.СоздатьМенеджерЗаписи();
	мз.Поступление = Поступление;
	мз.Прочитать();
	Если мз.Выбран() Тогда
		мз.Удалить();
	КонецЕсли;
КонецПроцедуры


Функция ДокументНаходитсяВОчередиАвторазнесения(Поступление) Экспорт  
	Отбор = Новый Структура("Поступление", Поступление);
	ВыборкаОчереди = РегистрыСведений.ОчередьАвторазнесения.Выбрать(Отбор); 
	Возврат ВыборкаОчереди.Следующий();
КонецФункции

Функция ПолучитьТекстЗапросаАналогиЛокаций()
	Возврат 
	"ВЫБРАТЬ
	|	АналогиЛокаций.Локация КАК Локация,
	|	АналогиЛокаций.Локация КАК Аналог,
	|	1 КАК Приоритет
	|ПОМЕСТИТЬ ВТ_АналогиЛокацийБезГруппировки
	|ИЗ
	|	РегистрСведений.АналогиЛокаций КАК АналогиЛокаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЛокацииАкцепта КАК ВТ_ЛокацииАкцепта
	|		ПО АналогиЛокаций.Локация = ВТ_ЛокацииАкцепта.Локация
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	АналогиЛокаций.Локация,
	|	АналогиЛокаций.Аналог,
	|	1
	|ИЗ
	|	РегистрСведений.АналогиЛокаций КАК АналогиЛокаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЛокацииАкцепта КАК ВТ_ЛокацииАкцепта
	|		ПО АналогиЛокаций.Локация = ВТ_ЛокацииАкцепта.Локация
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ГоризонтальныеСвязиЛокаций.ЖДСтанция,
	|	ГоризонтальныеСвязиЛокаций.Порт,
	|	2
	|ИЗ
	|	РегистрСведений.ГоризонтальныеСвязиЛокаций КАК ГоризонтальныеСвязиЛокаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЛокацииАкцепта КАК ВТ_ЛокацииАкцепта
	|		ПО ГоризонтальныеСвязиЛокаций.ЖДСтанция = ВТ_ЛокацииАкцепта.Локация
	|ГДЕ
	|	ГоризонтальныеСвязиЛокаций.ЖДСтанция <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|	И ГоризонтальныеСвязиЛокаций.Порт <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ГоризонтальныеСвязиЛокаций.Порт,
	|	ГоризонтальныеСвязиЛокаций.ЖДСтанция,
	|	2
	|ИЗ
	|	РегистрСведений.ГоризонтальныеСвязиЛокаций КАК ГоризонтальныеСвязиЛокаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЛокацииАкцепта КАК ВТ_ЛокацииАкцепта
	|		ПО ГоризонтальныеСвязиЛокаций.Порт = ВТ_ЛокацииАкцепта.Локация
	|ГДЕ
	|	ГоризонтальныеСвязиЛокаций.ЖДСтанция <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|	И ГоризонтальныеСвязиЛокаций.Порт <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ГоризонтальныеСвязиЛокаций.ЖДСтанция,
	|	ГоризонтальныеСвязиЛокаций.Терминал,
	|	2
	|ИЗ
	|	РегистрСведений.ГоризонтальныеСвязиЛокаций КАК ГоризонтальныеСвязиЛокаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЛокацииАкцепта КАК ВТ_ЛокацииАкцепта
	|		ПО ГоризонтальныеСвязиЛокаций.ЖДСтанция = ВТ_ЛокацииАкцепта.Локация
	|ГДЕ
	|	ГоризонтальныеСвязиЛокаций.ЖДСтанция <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|	И ГоризонтальныеСвязиЛокаций.Терминал <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ГоризонтальныеСвязиЛокаций.Терминал,
	|	ГоризонтальныеСвязиЛокаций.ЖДСтанция,
	|	2
	|ИЗ
	|	РегистрСведений.ГоризонтальныеСвязиЛокаций КАК ГоризонтальныеСвязиЛокаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЛокацииАкцепта КАК ВТ_ЛокацииАкцепта
	|		ПО ГоризонтальныеСвязиЛокаций.Терминал = ВТ_ЛокацииАкцепта.Локация
	|ГДЕ
	|	ГоризонтальныеСвязиЛокаций.ЖДСтанция <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|	И ГоризонтальныеСвязиЛокаций.Терминал <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ГоризонтальныеСвязиЛокаций.Порт,
	|	ГоризонтальныеСвязиЛокаций.Терминал,
	|	2
	|ИЗ
	|	РегистрСведений.ГоризонтальныеСвязиЛокаций КАК ГоризонтальныеСвязиЛокаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЛокацииАкцепта КАК ВТ_ЛокацииАкцепта
	|		ПО ГоризонтальныеСвязиЛокаций.Порт = ВТ_ЛокацииАкцепта.Локация
	|ГДЕ
	|	ГоризонтальныеСвязиЛокаций.Порт <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|	И ГоризонтальныеСвязиЛокаций.Терминал <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ГоризонтальныеСвязиЛокаций.Терминал,
	|	ГоризонтальныеСвязиЛокаций.Порт,
	|	2
	|ИЗ
	|	РегистрСведений.ГоризонтальныеСвязиЛокаций КАК ГоризонтальныеСвязиЛокаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЛокацииАкцепта КАК ВТ_ЛокацииАкцепта
	|		ПО ГоризонтальныеСвязиЛокаций.Терминал = ВТ_ЛокацииАкцепта.Локация
	|ГДЕ
	|	ГоризонтальныеСвязиЛокаций.Порт <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|	И ГоризонтальныеСвязиЛокаций.Терминал <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ИерархияЛокаций.Локация,
	|	ИерархияЛокаций.ЛокацияВышестоящегоУровня,
	|	ПриоритетТипаИерархииЛокацииВАвторазнесенииПоступлений.Приоритет
	|ИЗ
	|	РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЛокацииАкцепта КАК ВТ_ЛокацииАкцепта
	|		ПО ИерархияЛокаций.Локация = ВТ_ЛокацииАкцепта.Локация
	|			И (НЕ ИерархияЛокаций.ЛокацияВышестоящегоУровня = ЗНАЧЕНИЕ(Справочник.Локации.Россия))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПриоритетТипаИерархииЛокацииВАвторазнесенииПоступлений КАК ПриоритетТипаИерархииЛокацииВАвторазнесенииПоступлений
	|		ПО ИерархияЛокаций.ТипИерархии = ПриоритетТипаИерархииЛокацииВАвторазнесенииПоступлений.ТипИерархии
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АналогиЛокаций.Локация КАК Локация,
	|	ВТ_АналогиЛокаций.Аналог КАК Аналог,
	|	МИНИМУМ(ВТ_АналогиЛокаций.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТ_АналогиЛокаций
	|ИЗ
	|	ВТ_АналогиЛокацийБезГруппировки КАК ВТ_АналогиЛокаций
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_АналогиЛокаций.Локация,
	|	ВТ_АналогиЛокаций.Аналог
	|;
	|";
КонецФункции
//)
//Евросиб - АСуслов 17.08.2022 17:06:54 #55129
Функция ПриоритетныйИсточникАвторазнесения()
	
	// Евросиб US 94184 TA 98095 Рыбьяков К.А. 14.03.2025 ((
	// Загружаем приоритеты из регистра в соответствие
	СоответствиеПриоритетов = Новый Соответствие();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиИсточниковДляАвторазнесенияАкцептов.ИсточникПоявленияСтрокиЭкономики КАК Источник,
	|	НастройкиИсточниковДляАвторазнесенияАкцептов.ПриоритетДляНеуникальныхСтрокПоиска КАК Приоритет
	|ИЗ
	|	РегистрСведений.НастройкиИсточниковДляАвторазнесенияАкцептов КАК НастройкиИсточниковДляАвторазнесенияАкцептов";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СоответствиеПриоритетов.Вставить(Выборка.Источник, Выборка.Приоритет);
	КонецЦикла;
	
	Возврат СоответствиеПриоритетов;
	// Евросиб Рыбьяков К.А. 14.03.2025 ))
КонецФункции