
&НаКлиенте
Процедура Рассчитать(Команда)
	Для каждого СтрокаКалькуляции Из ТаблицаКалькуляции Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаКалькуляции.СтанцияОтправления) Тогда
			Продолжить;
		КонецЕсли;
		ПараметрыКалькуляции = РейлТариф_клиент.ПолучитьСтруктуруПараметровКалькуляции();
		//Ком = Новый COMОбъект("TariffX.Application"); 
		//Ком.Initialize("");
		//Если ЗначениеЗаполнено(СтрокаКалькуляции.Груз) Тогда
		//	ПараметрыКалькуляции.Порожний = Ложь;
		//Иначе
		//	ПараметрыКалькуляции.Порожний = Истина;
		//КонецЕсли; 
		Если ПолучитьРеквизитСсылкиНаСервере(СтрокаКалькуляции.Операция,"ДлительностьСчитаетсяПоНормативуПерегонаПорожнего").ДлительностьСчитаетсяПоНормативуПерегонаПорожнего Тогда
			ПараметрыКалькуляции.Порожний = Истина;
		ИначеЕсли ПолучитьРеквизитСсылкиНаСервере(СтрокаКалькуляции.Операция,"ДлительностьСчитаетсяПоНормативуПерегонаГруженого").ДлительностьСчитаетсяПоНормативуПерегонаГруженого Тогда
			ПараметрыКалькуляции.Порожний = Ложь;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В услуге '"+СтрокаКалькуляции.Операция+"' не задано по какому нормативу считать длительность");
			Возврат;
		КонецЕсли; 
		Если ПараметрыКалькуляции.Порожний Тогда
			ПараметрыКалькуляции.ПараметрыОтправки.КодКатегории = 3000;
			ПараметрыКалькуляции.ПараметрыОтправки.КодДетализации = 102;//Порожние вагоны под погрузку/из-под выгрузки
			//ПараметрыКалькуляции.ПараметрыГруза.КодЕТСНГ = ПолучитьРеквизитСсылкиНаСервере(СтрокаКалькуляции.Груз,"ЕТСНГ").ЕТСНГ;
			//ПараметрыКалькуляции.ПараметрыГруза.Вес = 10;
			ПараметрыКалькуляции.ПараметрыПорожнегоВагона.КодВагона = 64;
			ПараметрыКалькуляции.ПараметрыПорожнегоВагона.ПринадлежностьВагона = ПолучитьПринадлежностьRTСервер(СтрокаКалькуляции.ПринадлежностьВагона);
			ПараметрыКалькуляции.ПараметрыПорожнегоВагона.КодГруза = ПолучитьРеквизитСсылкиНаСервере(СтрокаКалькуляции.Груз,"ЕТСНГ").ЕТСНГ;
			ПараметрыКалькуляции.ПараметрыПорожнегоВагона.КоличествоВагонов = 1;
		Иначе
			ПараметрыКалькуляции.ПараметрыОтправки.КодКатегории = 3000;
			ПараметрыКалькуляции.ПараметрыОтправки.КодДетализации = 6;//Одиночные контейнеры (а также спец. контейнеры мелкой отправкой
			//Параметры груза
			ПараметрыКалькуляции.ПараметрыГруза.КодЕТСНГ = ПолучитьРеквизитСсылкиНаСервере(СтрокаКалькуляции.Груз,"ЕТСНГ").ЕТСНГ;
			ПараметрыКалькуляции.ПараметрыГруза.Вес = 10;
			//Выбор груза
		КонецЕсли; 
		ПараметрыКалькуляции.КодСтанцииОтправления = ПолучитьРеквизитСсылкиНаСервере(СтрокаКалькуляции.СтанцияОтправления,"КодЖДСтанции").КодЖДСтанции;
		ПараметрыКалькуляции.КодСтанцииНазначения = ПолучитьРеквизитСсылкиНаСервере(СтрокаКалькуляции.СтанцияНазначения,"КодЖДСтанции").КодЖДСтанции;
		ПараметрыКалькуляции.ПараметрыОтправки.ПризнакМаршрутнойОтправки = 0;
		ПараметрыКалькуляции.ПараметрыОтправки.КодСкорости = 2;
		//Параметры контейнера
		ПараметрыКалькуляции.ПараметрыКонтейнера.КодВагона = 64;
		ПараметрыКалькуляции.ПараметрыКонтейнера.ПринадлежностьВагона = ПолучитьПринадлежностьRTСервер(СтрокаКалькуляции.ПринадлежностьВагона);
		ПараметрыКалькуляции.ПараметрыКонтейнера.КоличествоВагонов = 1;
		//параметры платформы
		ПараметрыКалькуляции.ПараметрыТранспортДляКонтейнера.КодВагона = 2;
		ПараметрыКалькуляции.ПараметрыТранспортДляКонтейнера.ПринадлежностьВагона = 2;
		ПараметрыКалькуляции.ПараметрыТранспортДляКонтейнера.КоличествоВагонов = 1;
		
		//Установка параметров
		//Док = Ком.CreateDocument();
		//Док.FromStation(КодЖДСтанцииОтправления, 0);
		//Док.ToStation(КодЖДСтанцииНазначения, 0);
		////Выбор типа отправки
		//Док.Send(КодКатегорииОтправки, КодДетализацииОтправки, ПризнакМаршрутнойОтправки, КодСкоростиПеревозки);
		//Если Порожний Тогда
		//	//Выбор груза
		//	Док.Freight("421034", 10);
		//	//Установка параметров вагона
		//	Док.EmptyWagon(КодПлатформы, ПринадлежностьПлатформы, КоличествоПлатформ, "421034", 0, 0);
		//Иначе
		//	Док.Freight(КодГрузаЕТСНГ, ВесГруза);
		//	Док.Container(КодВагона, ПринадлежностьВагона, КоличествоВагонов);
		//	Док.ContainerTransport(КодПлатформы, ПринадлежностьПлатформы, КоличествоПлатформ);
		//КонецЕсли; 
		////Установка параметров вагона
		//Док.DoCalcDistance();
		//Док.DoCalcTariff();
		//Док.Result.AsTable.First();
		ДанныеКалькуляции = РейлТариф_клиент.ПолучитьКалькуляцию(ПараметрыКалькуляции);
		Если ДанныеКалькуляции.Ошибка Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ДанныеКалькуляции.ОписаниеОшибки);
			Возврат;
		КонецЕсли; 
		Стоимость = 0;
		НДС = 0;
		Пробег = 0;
		ДлительностьДней = 0;
		Для каждого СтрокаДанныхКалькуляции Из ДанныеКалькуляции.РезультатТаблица Цикл
			Стоимость = Стоимость + СтрокаДанныхКалькуляции.Стоимость;
			НДС = НДС + СтрокаДанныхКалькуляции.НДС;
			Пробег = Пробег + СтрокаДанныхКалькуляции.Расстояние;
			ДлительностьДней = ДлительностьДней + СтрокаДанныхКалькуляции.ДлительностьДней;
		КонецЦикла; 
		СтрокаКалькуляции.Стоимость = Стоимость;
		СтрокаКалькуляции.НДС = НДС;
		СтрокаКалькуляции.СтоимостьИтого = Стоимость + НДС;
		СтрокаКалькуляции.Пробег = Пробег;
		СтрокаКалькуляции.ДлительностьДней = ДлительностьДней;
		
	КонецЦикла; 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРеквизитСсылкиНаСервере(СсылкаНаОбъект,Реквизит)
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаОбъект, Реквизит);
КонецФункции

&НаСервере
Функция ПолучитьПринадлежностьRTСервер(ПринадлежностьТС)
	Возврат Документы.Калькуляция.ПолучитьПринадлежностьRT(ПринадлежностьТС);
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	АдресХранилища = Неопределено;
	Параметры.Свойство("АдресТаблицыУслуг",АдресХранилища);
	ТЗУслуг = ПолучитьИзВременногоХранилища(АдресХранилища);
	Для каждого СтрокаУслуга Из ТЗУслуг Цикл
		нСтрока = ТаблицаКалькуляции.Добавить();
		ЗаполнитьЗначенияСвойств(нСтрока, СтрокаУслуга);
		нСтрока.НомерСтрокиУслуги = СтрокаУслуга.НомерСтроки;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	АдресХранилища = ПолучитьТаблицуКалькуляцииНаСервере();
	Закрыть(Новый Структура("АдресТаблицыУслуг", АдресХранилища));
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуКалькуляцииНаСервере()
	АдресХранилища = ПоместитьВоВременноеХранилище(ТаблицаКалькуляции.Выгрузить());
	Возврат АдресХранилища;
КонецФункции
	