
&НаСервере
Процедура ИсправленоНаСервере(ВыделенныеСтроки)
	Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
		ПометитьСтрокуИсправленной(ИдентификаторСтроки);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПометитьСтрокуИсправленной(ИдентификаторСтроки)
	СтрокаТЧ = Объект.ОшибкиПриЗагрузке.НайтиПоИдентификатору(ИдентификаторСтроки);
	СтрокаТЧ.Исправлено = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Исправлено(Команда)
	ВыделенныеСтроки = Элементы.ОшибкиПриЗагрузке.ВыделенныеСтроки;
	Если Не ВыделенныеСтроки.Количество() Тогда
		Возврат;
	КонецЕсли;
	ИсправленоНаСервере(ВыделенныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ОшибкиПриЗагрузкеИсправленноеЗначениеПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ОшибкиПриЗагрузке.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекущиеДанные) Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ИсправленноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	ИдентификаторСтроки = ТекущиеДанные.ПолучитьИдентификатор();
	ПометитьСтрокуИсправленной(ИдентификаторСтроки);
КонецПроцедуры
