
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПричиныПользователя = Неопределено;
	Если Параметры.Свойство("ТолькоПричиныПользователя", ТолькоПричиныПользователя) И ТолькоПричиныПользователя Тогда
		ГруппаПричиныПользователя = Справочники.ПричиныНеурегулированныхРасходов.ПричиныПользователя;
		КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(Список.Отбор, "Ссылка", ГруппаПричиныПользователя, ВидСравненияКомпоновкиДанных.ВИерархии);
	КонецЕсли;
	//Евросиб Каблов 28.06.2023 )
	//(
	РаботаСФормамиСервер.УстановитьОграничениеНаВыборПомеченныхНаУдалениеЭлементов(Список);
	//)
	//Евросиб - АСуслов 04.07.2023 17:55:09 #67501 локации
	
КонецПроцедуры
