
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Евросиб(ДИТ) Антонова А.С. US 87497 ТА 104722 Начало 15.05.2025
	Параметры.Свойство("Клиент", ЭтаФорма.Клиент);
	//Евросиб(ДИТ) Антонова А.С. US 87497 ТА 104722 Конец 15.05.2025
	
	// Евросиб Фролов (01.12.2021 Task №43170
	Элементы.ФормаЗаписатьИзменения.Доступность = Пользователи.РолиДоступны("dc_РаботаСНДС0");
	// Евросиб Фролов)	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 ) 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КопироватьДанныеФормы(ВладелецФормы.Объект, Объект);
	Если Объект.Фрахт Тогда
		ЗаполнитьТаблицуФрахтаНаСервере();
	КонецЕсли;
	ОбновитьОтображениеКолонок();
	
	// ДИТ Поморцева Т.П. Задача 0242763 15.09.2021 начало
	ТаблицаФрахтИзменена = Ложь;
	
	// ДИТ Поморцева Т.П. Задача 0252360 07.12.21. начало
	// ДИТ Поморцева Т.П. Задача 37207 27.09.21. начало
	//Если НЕ Объект.Фрахт И (Объект.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.Транзит")
	//	ИЛИ Объект.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.Импорт")
	//	ИЛИ Объект.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.Экспорт")) Тогда
	//	Элементы.ЗаполнитьПоПервойСтроке.Видимость = Истина;
	//Иначе
	//	Элементы.ЗаполнитьПоПервойСтроке.Видимость = Ложь;
	//КонецЕсли;
	
	Элементы.ЗаполнитьПоПервойСтроке.Видимость = Истина;	
	// ДИТ Поморцева Т.П. Задача 0252360 07.12.21. конец
	
	ИзменитьДоступностьТЧПодтверждающиеДокументы();
	// ДИТ Поморцева Т.П. Задача 37207 27.09.21. конец
	
	// Евросиб US 90779 TA 90785 Рыбьяков К.А. 03.12.2024 ((
	СчетФарктураСсылка = ВладелецФормы.Объект.Ссылка;
	//ЗаполнитьСуммыПоКТК(); - заполнение суммы при создании пакета документов
	// Евросиб Рыбьяков К.А. 03.12.2024 ))
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	//Закрыть(Объект);
  
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	СтрокиБезДокументов = Объект.ПодтверждающиеДокументы.НайтиСтроки(Новый Структура("ДокументыЕсть", Ложь));
	Если Объект.ПодтверждающиеДокументы.Количество() > 0 И СтрокиБезДокументов.Количество() = 0 И Не ЗначениеЗаполнено(Объект.УдалитьДатаПолногоПодтвержденияНДС0) Тогда
		Объект.ПодтверждающиеДокументы.Сортировать("ДатаГТД Убыв");
		Объект.УдалитьДатаПолногоПодтвержденияНДС0 = Объект.ПодтверждающиеДокументы[0].ДатаГТД;
	ИначеЕсли ЗначениеЗаполнено(Объект.УдалитьДатаПолногоПодтвержденияНДС0) Тогда 
		Объект.УдалитьДатаПолногоПодтвержденияНДС0 = Неопределено;
	КонецЕсли;
	
	//ЭтаФорма.Закрыть(ЭтотОбъект);
	
КонецПроцедуры


&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	//Евросиб Каблов 30.06.2021 ( Ticket#0203749
	//Для каждого Строка Из Объект.ПодтверждающиеДокументы Цикл
	//	Строка.ДокументыЕсть = Истина;	
	//КонецЦикла;
	
	// ДИТ Поморцева Т.П. Задача 37207 27.09.21. начало
	Если ЗаполнитьПоПервойСтроке Тогда
		 Для Каждого Строка Из Объект.ПодтверждающиеДокументы Цикл
			Строка.ВыбратьСтрокуДляЗаполнения = Истина;
		КонецЦикла;
	Иначе
	// ДИТ Поморцева Т.П. Задача 37207 27.09.21. конец
	
		Если Объект.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.ИмпортМоре") Или Объект.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.ЭкспортМоре") Тогда
			Для каждого Строка Из Объект.ПодтверждающиеДокументы Цикл
				ЕстьДокПоМорскомуТранспорту = ПроверитьНаличиеДокументовПоМорскомуТранспорту(Строка);
				Если ЕстьДокПоМорскомуТранспорту Тогда
					Строка.ДокументыЕсть = Истина;
				Иначе
					Строка.ДокументыЕсть = Ложь;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для каждого Строка Из Объект.ПодтверждающиеДокументы Цикл
				Строка.ДокументыЕсть = Истина;	
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	//Евросиб Каблов 30.06.2021 ) 
	
КонецПроцедуры


&НаКлиенте
Процедура СнятьВсе(Команда)

	Для каждого Строка Из Объект.ПодтверждающиеДокументы Цикл
		// ДИТ Поморцева Т.П. Задача 37207 27.09.21. начало
		Если ЗаполнитьПоПервойСтроке Тогда
			Строка.ВыбратьСтрокуДляЗаполнения = Ложь;			
		Иначе
		// ДИТ Поморцева Т.П. Задача 37207 27.09.21. конец

			Строка.ДокументыЕсть = Ложь;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры


&НаКлиенте
Процедура ВидПеревозкиПриИзменении(Элемент)
	
	ОбновитьОтображениеКолонок();
	
	// ДИТ Поморцева Т.П. Задача 0252360 07.12.21. начало
	//// ДИТ Поморцева Т.П. Задача 37207 27.09.21. начало
	//Если НЕ Объект.Фрахт И (Объект.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.Транзит")
	//	ИЛИ Объект.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.Импорт")
	//	ИЛИ Объект.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.Экспорт")) Тогда
	//	Элементы.ЗаполнитьПоПервойСтроке.Видимость = Истина;
	//Иначе
	//	Элементы.ЗаполнитьПоПервойСтроке.Видимость = Ложь;
	//	ЗаполнитьПоПервойСтроке = Ложь;
	//КонецЕсли;
	//// ДИТ Поморцева Т.П. Задача 37207 27.09.21. конец
	// ДИТ Поморцева Т.П. Задача 0252360 07.12.21. начало
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеКолонок()
	
	Если Объект.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.Транзит") 
//Евросиб Гудкова( 22.04.2021 Ticket№ 0230315
			Или Объект.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.ТранзитМоре")
// Евросиб Гудкова) 			
		Тогда
		//Элементы.ПодтверждающиеДокументыСтранаНазначения.Видимость = Ложь;	
		//Элементы.ПодтверждающиеДокументыСтранаОтправления.Видимость = Ложь;
		Элементы.ПодтверждающиеДокументыВходнаяСтанция.Видимость = Истина;	
		Элементы.ПодтверждающиеДокументыВыходнаяСтанция.Видимость = Истина;
	Иначе	
		//Элементы.ПодтверждающиеДокументыСтранаНазначения.Видимость = Истина;	
		//Элементы.ПодтверждающиеДокументыСтранаОтправления.Видимость = Истина;
		Элементы.ПодтверждающиеДокументыВходнаяСтанция.Видимость = Ложь;	
		Элементы.ПодтверждающиеДокументыВыходнаяСтанция.Видимость = Ложь;
	КонецЕсли;                         
	//Евросиб(ДИТ) Антонова А.С. US 87497 ТА 104722 Начало 13.05.2025
	//Было:
	//Элементы.ПодтверждающиеДокументы.Видимость = НЕ Объект.Фрахт;
	//Элементы.МорскойТранспорт.Видимость = НЕ Объект.Фрахт;
	//Элементы.ТаблицаФрахт.Видимость = Объект.Фрахт;
	//Стало:
	Элементы.ПодтверждающиеДокументы.Видимость = НЕ Объект.Фрахт и НЕ Объект.Авто;
	Элементы.МорскойТранспорт.Видимость = НЕ Объект.Фрахт и НЕ Объект.Авто;
	Элементы.ТаблицаФрахт.Видимость = Объект.Фрахт;
	Элементы.АвтоТранпорт.Видимость = Объект.Авто;
	//Евросиб(ДИТ) Антонова А.С. US 87497 ТА 104722 Конец 13.05.2025
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждающиеДокументыПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ПодтверждающиеДокументы.ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли; 
	
	УстановитьОтборПоЖДН(Элементы.ПодтверждающиеДокументы.ТекущиеДанные.КлючСтроки);  
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоЖДН(КлючСтроки)
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("КлючСтроки", Элементы.ПодтверждающиеДокументы.ТекущиеДанные.КлючСтроки);
	Элементы.МорскойТранспорт.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПоиска); 	
	
	// Евросиб(ДИТ) US 97291 ТА 97321 Сержантова А.С. Начало: 10.12.2024
	Коносаменты_СнятьВсе(Неопределено);
	// Евросиб(ДИТ) US 97291 ТА 97321 Сержантова А.С. Конец: 10.12.2024
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОтбор(Команда)
	
	Элементы.МорскойТранспорт.ОтборСтрок = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура МорскойТранспортПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Элементы.ПодтверждающиеДокументы.ТекущиеДанные = Неопределено Тогда
		Элементы.МорскойТранспорт.ТекущиеДанные.КлючСтроки = Элементы.ПодтверждающиеДокументы.ТекущиеДанные.КлючСтроки;
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзменения(Команда) 
	
	//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 112113 Начало 18.06.2025    
	//СуммаСФ = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(СчетФарктураСсылка, "СуммаДокумента"); 
	//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 112113 Конец 18.06.2025     
	
	//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 114194 Начало 22.07.2025  
	СуммаСФ = ПолучитьРаспределяемуюСуммуНаСервере(СчетФарктураСсылка);
	//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 114194 Конец 22.07.2025
	
	//Евросиб Каблов 30.06.2021 ( Ticket#0203749
	Если Объект.Фрахт Тогда
		
		// Евросиб Фролов (01.12.2021 Task №43170
		Если НЕ ЕстьПравоРаботыСНДС0() Тогда
			ВидПеревозкиСсылки = ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "ВидПеревозки");
			МорскойФрахтСсылка = ВидПеревозкиСсылки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.ИмпортМоре")
						ИЛИ ВидПеревозкиСсылки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.ЭкспортМоре");
			МорскойФрахтОбъект = Объект.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.ИмпортМоре")
						ИЛИ Объект.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.ЭкспортМоре");			
			Если МорскойФрахтОбъект
					И НЕ МорскойФрахтСсылка	Тогда
				ПоказатьПредупреждение(, "Устанавливать вид перевозки ""Морской импорт""
										|или ""Морской экспорт"" при включенном признаке
										|""Фрахт"" запрещено.");
				Возврат;
			КонецЕсли;
		КонецЕсли;
		// Евросиб Фролов)
		
		// ДИТ Поморцева Т.П. Задача 0242763 15.09.2021 начало
		Если ТаблицаФрахтИзменена Тогда
		//Для каждого СтрокаФрахт Из ТаблицаФрахт Цикл
		//	Для каждого СтрокаМорскойТранспорт Из Объект.МорскойТранспорт Цикл				
		//		Если СтрокаМорскойТранспорт.Коносамент = СтрокаФрахт.Коносамент_ДоИзменения
		//			И СтрокаМорскойТранспорт.ТипДокумента = СтрокаФрахт.ТипДокумента_ДоИзменения
		//			И СтрокаМорскойТранспорт.НомерДокумента = СтрокаФрахт.НомерДокумента_ДоИзменения Тогда
		//			ЗаполнитьЗначенияСвойств(СтрокаМорскойТранспорт, СтрокаФрахт);
		//		КонецЕсли;
		//	КонецЦикла; 
		//КонецЦикла; 
			ОбновитьТЧМорскойТранспорт();
		КонецЕсли;
		// ДИТ Поморцева Т.П. Задача 0242763 15.09.2021 конец       
		
		//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 112113 Начало 18.06.2025 
		ИтоговаяСуммаФрахт = ТаблицаФрахт.Итог("СуммаПоКТК"); 
		ТекстУведомления = СтрШаблон("Сумма в перечне равна %1, сумма счет-фактуры равна %2. Необходимо внести изменения по суммам",
									ИтоговаяСуммаФрахт, СуммаСФ);
									
		Если ИтоговаяСуммаФрахт <> СуммаСФ Тогда
			ПоказатьПредупреждение(,ТекстУведомления); 
			Возврат;
		КонецЕсли;    
		
	ИначеЕсли Объект.Авто Тогда  
		ИтоговаяСуммаАвто = Объект.АвтоТранпорт.Итог("Сумма"); 
		ТекстУведомления = СтрШаблон("Сумма в перечне равна %1, сумма счет-фактуры равна %2. Необходимо внести изменения по суммам",
									ИтоговаяСуммаАвто, СуммаСФ);
		Если ИтоговаяСуммаАвто <> СуммаСФ Тогда
			ПоказатьПредупреждение(,ТекстУведомления); 
			Возврат;
		КонецЕсли; 
		
	Иначе          
		
		ИтоговаяСуммаЖД = Объект.ПодтверждающиеДокументы.Итог("СуммаПоКТК"); 
		ТекстУведомления = СтрШаблон("Сумма в перечне равна %1, сумма счет-фактуры равна %2. Необходимо внести изменения по суммам",
									ИтоговаяСуммаЖД, СуммаСФ);
		Если ИтоговаяСуммаЖД <> СуммаСФ Тогда
			ПоказатьПредупреждение(,ТекстУведомления);  
			Возврат;
		КонецЕсли;
	//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 112113 Конец 18.06.2025  
	
	КонецЕсли; 
	ОчиститьСообщения();
	Отказ = Ложь;
	Для Каждого СтрокаПоДокументу Из Объект.ПодтверждающиеДокументы Цикл
		ДлинаНомера = СтрДлина(СтрокаПоДокументу.НомерГТД);
		Если ДлинаНомера > 0 И ДлинаНомера <> 23 Тогда
			Поле = СтрШаблон("Объект.ПодтверждающиеДокументы[%1].НомерГТД", СтрокаПоДокументу.НомерСтроки - 1);
			ТекстСообщения = СтрШаблон("Номер ГТД должен состоять из 23 знаков! Введено %1.", Строка(ДлинаНомера));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, Поле,, Отказ);
		КонецЕсли;
	КонецЦикла; 
	
	////Евросиб(ДИТ) Антонова А.С. US 90779 ТА 107501 Начало 23.04.2025    //US 110385 ТА 110386 23.05.2025
	//МассивПроверяемыхВидовПеревозки = Новый Массив;
	//МассивПроверяемыхВидовПеревозки.Добавить(ПредопределенноеЗначение("Справочник.ВидыПеревозок.Импорт"));   
	//МассивПроверяемыхВидовПеревозки.Добавить(ПредопределенноеЗначение("Справочник.ВидыПеревозок.ИмпортМоре"));
	//МассивПроверяемыхВидовПеревозки.Добавить(ПредопределенноеЗначение("Справочник.ВидыПеревозок.Экспорт"));
	//МассивПроверяемыхВидовПеревозки.Добавить(ПредопределенноеЗначение("Справочник.ВидыПеревозок.ЭкспортМоре"));
	//
	//Если (Объект.Создано >= Дата("20250430") или не ЗначениеЗаполнено(Объект.Создано)) 
	//	и МассивПроверяемыхВидовПеревозки.Найти(Объект.ВидПеревозки) <> Неопределено Тогда
	//	Если Объект.Фрахт и не Объект.Авто Тогда
	//		
	//		Для каждого СтрокаТаб Из ЭтаФорма.ТаблицаФрахт Цикл
	//			Если не ЗначениеЗаполнено(СтрокаТаб.РегНомерТранзитнойДекларации) Тогда
	//				Поле = СтрШаблон("ТаблицаФрахт[%1].РегНомерТранзитнойДекларации", ТаблицаФрахт.Индекс(СтрокаТаб));
	//				ТекстСообщения = СтрШаблон("В строке №%1 не введен регистрационный номер транзитной декларации!", ТаблицаФрахт.Индекс(СтрокаТаб) + 1); 
	//			    ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, Поле,, Отказ);
	//			КонецЕсли;
	//		КонецЦикла;
	//		
	//	ИначеЕсли не Объект.Фрахт и не Объект.Авто Тогда
	//		Для Каждого СтрокаТаб Из Объект.ПодтверждающиеДокументы Цикл
	//			Если не ЗначениеЗаполнено(СтрокаТаб.РегНомерТранзитнойДекларации) Тогда
	//				Поле = СтрШаблон("Объект.ПодтверждающиеДокументы[%1].РегНомерТранзитнойДекларации", СтрокаТаб.НомерСтроки - 1);
	//				ТекстСообщения = СтрШаблон("В строке №%1 не введен регистрационный номер транзитной декларации!", СтрокаТаб.НомерСтроки); 
	//			    ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, Поле,, Отказ);
	//			КонецЕсли; 
	//		КонецЦикла; 
	//	КонецЕсли; 
	//КонецЕсли;	
	////Евросиб(ДИТ) Антонова А.С. US 90779 ТА 107501 Конец 23.04.2025
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	//Евросиб Каблов 30.06.2021 )
	
	// Евросиб US 90779 TA 90785 Рыбьяков К.А. 02.12.2024 ((
	НеПодвержденныеДокументы = ПроверитьПодтверждениеЖДНИлиКоносамента();
	// Евросиб Рыбьяков К.А. 02.12.2024 ))
	
	// ДИТ Поморцева Задача 34586 23.06.2021 начало
	ЗаписьВРегистрКонтрольПолученияДокументовНДС0();
	// ДИТ Поморцева Задача 34586 23.06.2021 конец
	
	// Евросиб US 90779 TA 90785 Рыбьяков К.А. 07.12.2024 ((
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("НеПодвержденныеДокументы", НеПодвержденныеДокументы);
	ПараметрыЗакрытия.Вставить("Объект", Объект);
	Закрыть(ПараметрыЗакрытия);
	//Закрыть(Объект);
	// Евросиб Рыбьяков К.А. 07.12.2024 ))
	
КонецПроцедуры   

//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 114194 22.07.2025 
&НаСервереБезКонтекста
Функция ПолучитьРаспределяемуюСуммуНаСервере(СчетФарктураСсылка)       
	
	СуммаСФ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетФарктураСсылка, "СуммаДокумента");
	
	ДокОснования = СчетФарктураСсылка.ДокументыОснования;
	Если ДокОснования.Количество() > 0 и ТипЗнч(ДокОснования[0].ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") и
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокОснования[0].ДокументОснование, "ВидОперации") = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение") Тогда
	    СуммаСФ = ДокОснования[0].СуммаУвеличение - ДокОснования[0].СуммаУменьшение;
	КонецЕсли;

	Возврат СуммаСФ;

КонецФункции 

// ДИТ Поморцева Т.П. Задача 0242763 15.09.2021 начало
Процедура ОбновитьТЧМорскойТранспорт()
	Объект.МорскойТранспорт.Очистить();
	Для Каждого СтрокаФрахт Из ТаблицаФрахт Цикл
		СтрокаМорскойТранспорт = Объект.МорскойТранспорт.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаМорскойТранспорт, СтрокаФрахт);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФрахтПослеУдаления(Элемент)
	ТаблицаФрахтИзменена = Истина;
КонецПроцедуры
// ДИТ Поморцева Т.П. Задача 0242763 15.09.2021 конец

&НаКлиенте
Процедура МорскойТранспортПортРазгрузкиПриИзменении(Элемент)
	
	ТекДанные = Элементы.МорскойТранспорт.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные.ПортРазгрузки) Тогда
		СтранаРазгрузки = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ТекДанные.ПортРазгрузки, "Страна");
		Если ЗначениеЗаполнено(СтранаРазгрузки) Тогда
			ТекДанные.СтранаРазгрузки = СтранаРазгрузки;
		Иначе ТекДанные.СтранаРазгрузки = Неопределено;
		КонецЕсли;
	Иначе ТекДанные.СтранаРазгрузки = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МорскойТранспортКоносаментПриИзменении(Элемент)
	
	ТекДанные = Элементы.МорскойТранспорт.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные.Коносамент) Тогда
		ДанныеКоносамента = ОбщегоНазначенияКлиент.ЗначенияРеквизитовОбъекта(ТекДанные.Коносамент, "НомерТранспортногоДокумента, ДатаТранспортногоДокумента, Судно");
		Если ЗначениеЗаполнено(ДанныеКоносамента.НомерТранспортногоДокумента) Тогда
			ТекДанные.НомерДокумента = ДанныеКоносамента.НомерТранспортногоДокумента;
		Иначе ТекДанные.НомерДокумента = "";
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеКоносамента.ДатаТранспортногоДокумента) Тогда
			ТекДанные.ДатаДокумента = ДанныеКоносамента.ДатаТранспортногоДокумента;
		Иначе ТекДанные.ДатаДокумента = Неопределено;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеКоносамента.Судно) Тогда
			ТекДанные.Судно = ДанныеКоносамента.Судно;
		Иначе ТекДанные.Судно = Неопределено;
		КонецЕсли;
	Иначе 
		ТекДанные.НомерДокумента = "";
		ТекДанные.ДатаДокумента = Неопределено;
		ТекДанные.Судно = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

// ДИТ Поморцева Задача 34586 23.06.2021
Процедура ЗаписьВРегистрКонтрольПолученияДокументовНДС0()
	
	Для Каждого Строка Из Объект.ПодтверждающиеДокументы Цикл
		Если Строка.ЖДН <> Документы.ТранспортныйДокумент.ПустаяСсылка() И Строка.ДокументыЕсть Тогда
			Набор = РегистрыСведений.КонтрольПолученияДокументовНДС0.СоздатьНаборЗаписей();
			Набор.Отбор.ЖДН.Установить(Строка.ЖДН, Истина);
			Набор.Прочитать();
			Для Каждого ЗаписьРегистра Из Набор Цикл
				Если НЕ ЗначениеЗаполнено(ЗаписьРегистра.ДатаПроверки) ИЛИ ЗаписьРегистра.ДатаПроверки = Дата("00010101") Тогда
					ЗаписьРегистра.ДатаПроверки = ТекущаяДата();
					ЗаписьРегистра.КтоПроверил = Пользователи.АвторизованныйПользователь();								
				КонецЕсли;
			КонецЦикла;
			Набор.Записать();
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждающиеДокументыНомерГТДОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	//Евросиб Каблов 30.06.2021 ( Ticket#0203749
	ДлинаНомера = СтрДлина(Текст);
	Если ДлинаНомера > 0 И ДлинаНомера <> 23 Тогда
		ТекСтрока = Элементы.ПодтверждающиеДокументы.ТекущиеДанные;
		Поле = СтрШаблон("Объект.ПодтверждающиеДокументы[%1].НомерГТД", ТекСтрока.НомерСтроки - 1);
		ТекстСообщения = СтрШаблон("Номер ГТД должен состоять из 23 знаков! Введено %1.", Строка(ДлинаНомера));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, Поле);
	КонецЕсли;
	//Евросиб Каблов 30.06.2021 )
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждающиеДокументыДокументыЕстьПриИзменении(Элемент)
	
	//Евросиб Каблов 30.06.2021 ( Ticket#0203749
	ТекДанные = Элементы.ПодтверждающиеДокументы.ТекущиеДанные;
	Если ТекДанные.ДокументыЕсть И (Объект.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.ИмпортМоре") Или Объект.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.ЭкспортМоре")) Тогда
		ЕстьДокПоМорскомуТранспорту = ПроверитьНаличиеДокументовПоМорскомуТранспорту(ТекДанные);
		Если Не ЕстьДокПоМорскомуТранспорту Тогда
			ТекДанные.ДокументыЕсть = Ложь;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указаны документы по морскому транспорту!");
		КонецЕсли;
	КонецЕсли;
	//Евросиб Каблов 30.06.2021 )
	
КонецПроцедуры

//Евросиб Каблов 30.06.2021 ( Ticket#0203749
&НаКлиенте
Функция ПроверитьНаличиеДокументовПоМорскомуТранспорту(СтрокаПоПодтверждающемуДокументу)
	
	Результат = Ложь;
	
	СтрокиМорскойТранспорт = Объект.МорскойТранспорт.НайтиСтроки(Новый Структура("КлючСтроки", СтрокаПоПодтверждающемуДокументу.КлючСтроки));
	Если СтрокиМорскойТранспорт.Количество() > 0 Тогда
		Результат = ЗначениеЗаполнено(СтрокиМорскойТранспорт[0].Коносамент);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура МорскойТранспортПортПогрузкиПриИзменении(Элемент)
	ТекДанные = Элементы.МорскойТранспорт.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные.ПортПогрузки) Тогда
		СтранаПогрузки = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ТекДанные.ПортПогрузки, "Страна");
		Если ЗначениеЗаполнено(СтранаПогрузки) Тогда
			ТекДанные.СтранаПогрузки = СтранаПогрузки;
		Иначе ТекДанные.СтранаПогрузки = Неопределено;
		КонецЕсли;
	Иначе ТекДанные.СтранаПогрузки = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()    

	Объект.МорскойТранспорт.Очистить();
	Объект.ПодтверждающиеДокументы.Очистить();
	
	ДокСФ = РеквизитФормыВЗначение("Объект"); 
	БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьТЧНДС0ПоОснованию(ДокСФ, ДокСФ.ДокументОснование.РасшифровкаУслугПоТС);
	
	//Евросиб - АСуслов 11.01.2023 14:22:35 #61303
	//(
	//процедура убирает дубли в ТЧ "Морской транспорт", исправлено в процедуре БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьТЧНДС0ПоОснованию
	//просили её убрать, но в процессе разбора выяснилось, что она скрывает дубли, оставили для совместимости со старыми данными
	ЗначениеВРеквизитФормы(ДокСФ, "Объект");
	Если Объект.Фрахт Тогда
		ЗаполнитьТаблицуФрахтаНаСервере();
	КонецЕсли; 
	//)
	//Евросиб - АСуслов 11.01.2023 14:22:44 #61303
КонецПроцедуры      


&НаКлиенте
Процедура Заполнить(Команда) 
	
	//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 114194 Начало 24.07.2025
	//по сф с галкой Авто заполнение ручное
	Если Объект.Авто = Истина Тогда  
		ОбщегоНазначенияКлиент.СообщитьПользователю("Для счет-фактур с галкой Авто не предусмотрено автоматическое заполнение таблиц ГТД");
		Возврат;	
	КонецЕсли;
	//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 114194 Конец 24.07.2025
	
	ЗаполнитьНаСервере();
	ОбновитьОтображениеКолонок();
	
КонецПроцедуры

&НаКлиенте
Процедура МорскойТранспортПриИзменении(Элемент)
	текДанные = Элементы.МорскойТранспорт.ТекущиеДанные;
	// ДИТ Поморцева Т.П. Задача 248181 27.10.2021. начало
	Если ТекДанные <> Неопределено Тогда
	// ДИТ Поморцева Т.П. Задача 248181 27.10.2021. конец
		Для каждого СтрокаДанные Из Объект.МорскойТранспорт Цикл
			Если СтрокаДанные.Коносамент = текДанные.Коносамент
				И СтрокаДанные.ТипДокумента = текДанные.ТипДокумента
				И СтрокаДанные.НомерДокумента = текДанные.НомерДокумента Тогда
				ЗаполнитьЗначенияСвойств(СтрокаДанные, текДанные,,"КлючСтроки");
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуФрахтаНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетФактураВыданныйМорскойТранспорт.НомерСтроки КАК НомерСтроки,
	|	СчетФактураВыданныйМорскойТранспорт.КлючСтроки КАК КлючСтроки,
	|	СчетФактураВыданныйМорскойТранспорт.ТипДокумента КАК ТипДокумента,
	|	СчетФактураВыданныйМорскойТранспорт.НомерДокумента КАК НомерДокумента,
	|	СчетФактураВыданныйМорскойТранспорт.ДатаДокумента КАК ДатаДокумента,
	|	СчетФактураВыданныйМорскойТранспорт.Судно КАК Судно,
	|	СчетФактураВыданныйМорскойТранспорт.ДатаРазрешенияПогрузки КАК ДатаРазрешенияПогрузки,
	|	СчетФактураВыданныйМорскойТранспорт.ПортРазгрузки КАК ПортРазгрузки,
	|	СчетФактураВыданныйМорскойТранспорт.СтранаРазгрузки КАК СтранаРазгрузки,
	|	СчетФактураВыданныйМорскойТранспорт.Коносамент КАК Коносамент,
	|	СчетФактураВыданныйМорскойТранспорт.ПортПогрузки КАК ПортПогрузки,
	|	СчетФактураВыданныйМорскойТранспорт.СтранаПогрузки КАК СтранаПогрузки,
	|	СчетФактураВыданныйМорскойТранспорт.НомерГТД КАК НомерГТД, 
	//Евросиб(ДИТ) Антонова А.С. US 107157 ТА 107159 Начало 29.04.2025
	|	СчетФактураВыданныйМорскойТранспорт.РегНомерТранзитнойДекларации КАК РегНомерТранзитнойДекларации,
	//Евросиб(ДИТ) Антонова А.С. US 107157 ТА 107159 Конец 29.04.2025
	// Евросиб US 90779 TA 90785 Рыбьяков К.А. 02.12.2024 ((
	|	СчетФактураВыданныйМорскойТранспорт.ДатаПодтвержденияНДС0 КАК ДатаПодтвержденияНДС0,
	|	СчетФактураВыданныйМорскойТранспорт.ВключатьВОтчетДляФНС КАК ВключатьВОтчетДляФНС,
	|	СчетФактураВыданныйМорскойТранспорт.СуммаПоКТК КАК СуммаПоКТК,
	|	СчетФактураВыданныйМорскойТранспорт.ДатаОтчетаДляФНС КАК ДатаОтчетаДляФНС,
	|	СчетФактураВыданныйМорскойТранспорт.Контейнер КАК Контейнер,
	|	СчетФактураВыданныйМорскойТранспорт.ДокументыЕсть КАК ДокументыЕсть
	// Евросиб Рыбьяков К.А. 02.12.2024 ))
	|ПОМЕСТИТЬ ВТ_МорскойТранспорт
	|ИЗ
	|	&ТЧМорскойТранспорт КАК СчетФактураВыданныйМорскойТранспорт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_МорскойТранспорт.ТипДокумента КАК ТипДокумента,
	|	ВТ_МорскойТранспорт.НомерДокумента КАК НомерДокумента,
	|	ВТ_МорскойТранспорт.ДатаДокумента КАК ДатаДокумента,
	|	ВТ_МорскойТранспорт.Судно КАК Судно,
	|	ВТ_МорскойТранспорт.ДатаРазрешенияПогрузки КАК ДатаРазрешенияПогрузки,
	|	ВТ_МорскойТранспорт.ПортРазгрузки КАК ПортРазгрузки,
	|	ВТ_МорскойТранспорт.СтранаРазгрузки КАК СтранаРазгрузки,
	|	ВТ_МорскойТранспорт.Коносамент КАК Коносамент,
	|	ВТ_МорскойТранспорт.ПортПогрузки КАК ПортПогрузки,
	|	ВТ_МорскойТранспорт.СтранаПогрузки КАК СтранаПогрузки,
	|	ВТ_МорскойТранспорт.ТипДокумента КАК ТипДокумента_ДоИзменения,
	|	ВТ_МорскойТранспорт.НомерДокумента КАК НомерДокумента_ДоИзменения,
	|	ВТ_МорскойТранспорт.Коносамент КАК Коносамент_ДоИзменения,
	|	ВТ_МорскойТранспорт.НомерГТД КАК НомерГТД,  
	//Евросиб(ДИТ) Антонова А.С. US 107157 ТА 107159 Начало 29.04.2025
	|	ВТ_МорскойТранспорт.РегНомерТранзитнойДекларации КАК РегНомерТранзитнойДекларации,
	//Евросиб(ДИТ) Антонова А.С. US 107157 ТА 107159 Конец 29.04.2025
	// ДИТ Поморцева Т.П. Задача 0242763 15.09.21.
	|	ВТ_МорскойТранспорт.КлючСтроки КАК КлючСтроки,
	// Евросиб US 90779 TA 90785 Рыбьяков К.А. 02.12.2024 ((
	|	ВТ_МорскойТранспорт.ДатаПодтвержденияНДС0 КАК ДатаПодтвержденияНДС0,
	|	ВТ_МорскойТранспорт.ВключатьВОтчетДляФНС КАК ВключатьВОтчетДляФНС,
	|	ВТ_МорскойТранспорт.СуммаПоКТК КАК СуммаПоКТК,
	|	ВТ_МорскойТранспорт.ДатаОтчетаДляФНС КАК ДатаОтчетаДляФНС,
	|	ВТ_МорскойТранспорт.Контейнер КАК Контейнер,
	|	ВТ_МорскойТранспорт.ДокументыЕсть КАК ДокументыЕсть
	// Евросиб Рыбьяков К.А. 02.12.2024 ))
	|ИЗ
	|	ВТ_МорскойТранспорт КАК ВТ_МорскойТранспорт";
	Запрос.УстановитьПараметр("ТЧМорскойТранспорт", Объект.МорскойТранспорт.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаФрахт.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаФрахтПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// ДИТ Поморцева Т.П. Задача 37207 27.09.21. этот функционал убрали
	
	//СписокЖДН = Новый СписокЗначений;
	//СписокЖДН.Очистить();
	//Для каждого СтрокаЖДН Из Объект.ПодтверждающиеДокументы Цикл
	//	Если ТекущийСписокЖДН.НайтиПоЗначению(СтрокаЖДН.ЖДН) = Неопределено Тогда
	//		СписокЖДН.Добавить(СтрокаЖДН.ЖДН);
	//	КонецЕсли; 
	//КонецЦикла; 
	//ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораЖДНИзСписка", ЭтаФорма);
	//// ДИТ Поморцева Т.П. Задача 0240735 19.08.21. начало
	////СписокЖДН.ПоказатьОтметкуЭлементов(ОпОп, "Выберите список ЖДН для добавления морских документов");
	//ОткрытьФорму("ОбщаяФорма.э_ФормаВыбораИзСписка",Новый Структура("Список,Заголовок",СписокЖДН,"Выберите список ЖДН для добавления морских документов"),Объект.Ссылка,,,,ОпОп);
	//// ДИТ Поморцева Т.П. Задача 0240735 19.08.21. конец
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораЖДНИзСписка(Параметр1, Параметр2) Экспорт
	
	// ДИТ Поморцева Т.П. Задача 37207 27.09.21. этот функционал убрали
	
	//Если Параметр1 = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//ТекущийСписокЖДН.Очистить();
	//Для каждого Элемент Из Параметр1 Цикл
	//	Если Элемент.Пометка Тогда
	//		ТекущийСписокЖДН.Добавить(Элемент.Значение);
	//	КонецЕсли; 
	//КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФрахтПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если Не ОтменаРедактирования 
		И (Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.ТипДокумента)
		ИЛИ Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.НомерДокумента)) Тогда
		ПоказатьПредупреждение(,"Необходимо заполнить поля «ТипДокумента», «НомерДокумента»",20);
		Отказ = Истина;
	КонецЕсли; // Вставить содержимое обработчика.
	
	// ДИТ Поморцева Т.П. Задача 0242763 15.09.21. начало
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.КлючСтроки = Новый УникальныйИдентификатор;
	КонецЕсли;
	Если Не ОтменаРедактирования Тогда
		ТаблицаФрахтИзменена = Истина;
	КонецЕсли;
	// ДИТ Поморцева Т.П. Задача 0242763 15.09.21. конец
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФрахтПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если ТекущийСписокЖДН.Количество() > 0 И НоваяСтрока Тогда
		Для к = 0 По ТекущийСписокЖДН.Количество()-1 Цикл
			нСтрока = Объект.МорскойТранспорт.Добавить();
			ЗаполнитьЗначенияСвойств(нСтрока, Элемент.ТекущиеДанные);
			нСтрока.КлючСтроки = Объект.ПодтверждающиеДокументы.НайтиСтроки(Новый Структура("ЖДН",ТекущийСписокЖДН[к].Значение))[0].КлючСтроки;
		КонецЦикла; 
	КонецЕсли; 
КонецПроцедуры

// ДИТ Поморцева Т.П. Задача 37207 27.09.21. начало
&НаКлиенте
Процедура ЗаполнитьПоПервойСтрокеПриИзменении(Элемент)
	ИзменитьДоступностьТЧПодтверждающиеДокументы();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДоступностьТЧПодтверждающиеДокументы()
	Элементы.ПодтверждающиеДокументыВагон.ТолькоПросмотр = ЗаполнитьПоПервойСтроке;
	Элементы.ПодтверждающиеДокументыДатаГТД.ТолькоПросмотр = ЗаполнитьПоПервойСтроке;
	Элементы.ПодтверждающиеДокументыДокументыЕсть.ТолькоПросмотр = ЗаполнитьПоПервойСтроке;
	Элементы.ПодтверждающиеДокументыКонтейнер.ТолькоПросмотр = ЗаполнитьПоПервойСтроке;
	Элементы.ПодтверждающиеДокументыТранспорт.ТолькоПросмотр = ЗаполнитьПоПервойСтроке;
	
	// Евросиб Фролов (17.01.2022 Ticket№ 0255202, закомментировал
	// необходимо разблокировать для изменения реквизиты ТЧ "Входная станция" и "Выходная станция"
	//Элементы.ПодтверждающиеДокументыВходнаяСтанция.ТолькоПросмотр = ЗаполнитьПоПервойСтроке;
	//Элементы.ПодтверждающиеДокументыВыходнаяСтанция.ТолькоПросмотр = ЗаполнитьПоПервойСтроке;
	// Евросиб Фролов)
	Элементы.ПодтверждающиеДокументыКлючСтроки.ТолькоПросмотр = ЗаполнитьПоПервойСтроке;    
	
	// Евросиб(ДИТ) US 90779 ТА 99010 Сержантова А.С. Начало: 09.01.2025
	Элементы.ТаблицаФрахтДокументыЕсть.ТолькоПросмотр = ЗаполнитьПоПервойСтроке;
	Элементы.ТаблицаФрахтКонтейнер.ТолькоПросмотр = ЗаполнитьПоПервойСтроке;
    Элементы.ТаблицаФрахтКлючСтроки.ТолькоПросмотр = ЗаполнитьПоПервойСтроке;
	// Евросиб(ДИТ) US 90779 ТА 99010 Сержантова А.С. Конец: 09.01.2025

КонецПроцедуры

&НаКлиенте
Процедура ПодтверждающиеДокументыПриИзменении(Элемент)
	Если ЗаполнитьПоПервойСтроке И Элемент.ТекущийЭлемент.Имя <> "ПодтверждающиеДокументыВыбратьСтрокуДляЗаполнения"
		// ДИТ Поморцева Т.П. Задача 0252360 07.12.2021. начало 
		И Элемент.ТекущиеДанные.ВыбратьСтрокуДляЗаполнения Тогда
		// ДИТ Поморцева Т.П. Задача 0252360 07.12.2021. конец
		ИмяТЧ = Элемент.Имя;
		ИмяПоля = Сред(Элемент.ТекущийЭлемент.Имя, СтрДлина(ИмяТЧ)+1);
		
		НовоеЗначение = Элементы.ПодтверждающиеДокументы.ТекущиеДанные[ИмяПоля];
	    ЗаполнитьПодтверждающиеДокументыПоПервойСтроке(ИмяПоля,НовоеЗначение);
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПодтверждающиеДокументыПоПервойСтроке(ИмяПоля,НовоеЗначение)
	
	Для Сч = 0 По Объект.ПодтверждающиеДокументы.Количество() - 1 Цикл
		РезПроверки = Элементы.ПодтверждающиеДокументы.ПроверитьСтроку(Объект.ПодтверждающиеДокументы[Сч].ПолучитьИдентификатор());
		текСтрока = Элементы.ПодтверждающиеДокументы.ДанныеСтроки(Объект.ПодтверждающиеДокументы[Сч].ПолучитьИдентификатор());
		Если РезПроверки = Истина И текСтрока.ВыбратьСтрокуДляЗаполнения Тогда
			
			Объект.ПодтверждающиеДокументы[Сч][ИмяПоля] = НовоеЗначение;
			
			// ДИТ Поморцева Т.П. 0252360 07.12.21. начало
			Если ИмяПоля = "СтранаНазначения" Тогда
				Объект.ПодтверждающиеДокументы[Сч]["СтанцияНазначения"]	= ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
			ИначеЕсли ИмяПоля = "СтранаОтправления" Тогда
				Объект.ПодтверждающиеДокументы[Сч]["СтанцияОтправления"]	= ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
			КонецЕсли; 
			// ДИТ Поморцева Т.П. 0252360 07.12.21. конец	
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКДокументу(Команда)
	
	// Евросиб(ДИТ) US 97291 ТА 97321 Сержантова А.С. Начало: 10.12.2024
	// Было: 
	//Если Элементы.МорскойТранспорт.ТекущиеДанные = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//   
	//СтрутураКоносамента = Новый Структура;
	//СтрутураКоносамента.Вставить("СтрокаКоносамента",Элементы.МорскойТранспорт.ТекущиеДанные); 
	//Стало:
	СтрокиМорскогоТранспорта = Новый Массив;
	СтруктураОтбора = Новый Структура("Флаг", Истина); 
	СтрокиКДобавлению = Объект.МорскойТранспорт.НайтиСтроки(СтруктураОтбора);  
	Если СтрокиКДобавлению.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	СтрутураКоносамента = Новый Структура;
	СтрутураКоносамента.Вставить("СтрокиКоносаментов",СтрокиКДобавлению); 
	
	Коносаменты_СнятьВсе(Неопределено);
	// Евросиб(ДИТ) US 97291 ТА 97321 Сержантова А.С. Конец: 10.12.2024
	
	СписокЖДН = Новый СписокЗначений;
	СписокЖДН.Добавить("Ссылка");
	СписокЖДН.Очистить();
	
	Для каждого СтрокаЖДН Из Объект.ПодтверждающиеДокументы Цикл
		Если ТекущийСписокЖДН.НайтиПоЗначению(СтрокаЖДН.ЖДН) = Неопределено Тогда
			//Евросиб Коханенко Н.А. 09.04.2024 (( #83236 
			//СписокЖДН.Добавить(СтрокаЖДН.ЖДН,Строка(СтрокаЖДН.КлючСтроки)); 
			СписокЖДН.Добавить(Новый Структура("Ссылка, Контейнер", СтрокаЖДН.ЖДН, Строка(СтрокаЖДН.Контейнер)), Строка(СтрокаЖДН.КлючСтроки)); 
			//Евросиб Коханенко Н.А. 09.04.2024 )) #83236 
		КонецЕсли; 
	КонецЦикла;
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораМорскихЖДНИзСписка", ЭтаФорма, СтрутураКоносамента);
	ОткрытьФорму("ОбщаяФорма.э_ФормаВыбораИзСписка",Новый Структура("Список,Заголовок,ОбъектВладелец",СписокЖДН,"Выберите список ЖДН для добавления морских документов",Объект.Ссылка),Объект.Ссылка,,,,ОпОп);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораМорскихЖДНИзСписка(Параметр1, Параметр2) Экспорт
	
	Если Параметр1 = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущийСписокЖДН.Очистить();
	Для каждого Элемент Из Параметр1 Цикл
		Если Элемент.Пометка Тогда 
			// Евросиб(ДИТ) US 97291 ТА 97321 Сержантова А.С. Начало: 10.12.2024
			// Было:
			//СтрокиМорскойТранспорт = Объект.МорскойТранспорт.НайтиСтроки(Новый Структура("Коносамент,КлючСтроки", Параметр2.СтрокаКоносамента.Коносамент,Элемент.Представление));
			//Если СтрокиМорскойТранспорт.Количество() > 0 Тогда
			//	Продолжить;
			//КонецЕсли;
			//
			//НоваяСтрока = Объект.МорскойТранспорт.Добавить();
			//ЗаполнитьЗначенияСвойств(НоваяСтрока,Параметр2.СтрокаКоносамента,,"КлючСтроки");
			//НоваяСтрока.КлючСтроки = Элемент.Представление; 
			//Стало:  
			Для каждого СтрКоносамента Из Параметр2.СтрокиКоносаментов Цикл
				СтрокиМорскойТранспорт = Объект.МорскойТранспорт.НайтиСтроки(Новый Структура("Коносамент,КлючСтроки", СтрКоносамента.Коносамент,Элемент.Представление));
				Если СтрокиМорскойТранспорт.Количество() > 0 Тогда
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока = Объект.МорскойТранспорт.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрКоносамента,,"КлючСтроки");
				НоваяСтрока.КлючСтроки = Элемент.Представление;
			КонецЦикла;
			// Евросиб(ДИТ) US 97291 ТА 97321 Сержантова А.С. Конец: 10.12.2024
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры
// ДИТ Поморцева Т.П. Задача 37207 27.09.21. конец

&НаСервереБезКонтекста
Функция ЕстьПравоРаботыСНДС0()
	// Евросиб Фролов (01.12.2021 Task №43170
	Возврат Пользователи.РолиДоступны("dc_РаботаСНДС0");
	// Евросиб Фролов)
КонецФункции

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


// ДИТ Поморцева Т.П. Задача 0252360 07.12.2021. начало
&НаКлиенте
Процедура ОтметитьВсеТабФрахт(Команда)
	
	// ДИТ ТА 115485 Дедуник Д.О. Начало: 31.07.2025
	ТаблицаФрахтИзменена = Истина;
	// ДИТ ТА 115485 Дедуник Д.О. Конец: 31.07.2025
	
	Если ЗаполнитьПоПервойСтроке Тогда
		 Для Каждого Строка Из ТаблицаФрахт Цикл
			Строка.ВыбратьСтрокуДляЗаполнения = Истина;
		КонецЦикла;
	// ДИТ ТА 115485 Дедуник Д.О. Начало: 31.07.2025
	Иначе
		Для Каждого Строка Из ТаблицаФрахт Цикл
			Строка.ДокументыЕсть = Истина;	
		КонецЦикла;
	// ДИТ ТА 115485 Дедуник Д.О. Конец: 31.07.2025
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура СнятьВсеТабФрахт(Команда)
	
	// ДИТ ТА 115485 Дедуник Д.О. Начало: 31.07.2025
	ТаблицаФрахтИзменена = Истина;
	//Для каждого Строка Из ТаблицаФрахт Цикл
	//	Строка.ВыбратьСтрокуДляЗаполнения = Ложь;			
	//КонецЦикла; 
	Если ЗаполнитьПоПервойСтроке Тогда
		 Для Каждого Строка Из ТаблицаФрахт Цикл
			Строка.ВыбратьСтрокуДляЗаполнения = Ложь;
		КонецЦикла;
	Иначе
		Для Каждого Строка Из ТаблицаФрахт Цикл
			Строка.ДокументыЕсть = Ложь;	
		КонецЦикла;
	КонецЕсли;	
	// ДИТ ТА 115485 Дедуник Д.О. Конец: 31.07.2025
КонецПроцедуры 

&НаКлиенте
Процедура ТаблицаФрахтПриИзменении(Элемент)
	Если ЗаполнитьПоПервойСтроке И Элемент.ТекущийЭлемент.Имя <> "ТаблицаФрахтВыбратьСтрокуДляЗаполнения"
		И Элемент.ТекущиеДанные.ВыбратьСтрокуДляЗаполнения Тогда
		ИмяТЧ = Элемент.Имя;
		ИмяПоля = Сред(Элемент.ТекущийЭлемент.Имя, СтрДлина(ИмяТЧ)+1);
		
		НовоеЗначение = Элементы.ТаблицаФрахт.ТекущиеДанные[ИмяПоля];
	    ЗаполнитьТаблицуФрахтПоПервойСтроке(ИмяПоля,НовоеЗначение);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуФрахтПоПервойСтроке(ИмяПоля,НовоеЗначение)
	
	Для Сч = 0 По ТаблицаФрахт.Количество() - 1 Цикл
		РезПроверки = Элементы.ТаблицаФрахт.ПроверитьСтроку(ТаблицаФрахт[Сч].ПолучитьИдентификатор());
		текСтрока = Элементы.ТаблицаФрахт.ДанныеСтроки(ТаблицаФрахт[Сч].ПолучитьИдентификатор());
		Если РезПроверки = Истина И текСтрока.ВыбратьСтрокуДляЗаполнения Тогда
			
			ТаблицаФрахт[Сч][ИмяПоля] = НовоеЗначение;			
			// ДИТ Поморцева Т.П. 0252360 07.12.21. начало
			Если ИмяПоля = "СтранаПогрузки" Тогда
				ТаблицаФрахт[Сч]["ПортПогрузки"]	= ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
			ИначеЕсли ИмяПоля = "СтранаРазгрузки" Тогда
				ТаблицаФрахт[Сч]["ПортРазгрузки"]	= ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
			КонецЕсли; 
			// ДИТ Поморцева Т.П. 0252360 07.12.21. конец
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры
// ДИТ Поморцева Т.П. Задача 0252360 07.12.2021. конец

// Евросиб(ДИТ) US 90779 ТА 99010 Сержантова А.С. 09.01.2025
&НаСервере
Функция ПроверитьПодтверждениеЖДНИлиКоносамента()
	
	ЧастичноПодтвержденныеДокументы = Новый Массив;
	
	Если Объект.Фрахт Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПодтверждающиеДокументы.Коносамент,
		|	ПодтверждающиеДокументы.ДатаПодтвержденияНДС0,
		|	ПодтверждающиеДокументы.Контейнер
		|ПОМЕСТИТЬ ВТ_ПодтверждающиеДокументы
		|ИЗ 
		|	Документ.СчетФактураВыданный.МорскойТранспорт КАК ПодтверждающиеДокументы  
		|ГДЕ
		|	ПодтверждающиеДокументы.Ссылка = &Ссылка
		|;
		|
		|ВЫБРАТЬ
		|	СчетФактураВыданныйМорскойТранспорт.Коносамент КАК Коносамент,
		|	ТранспортныйДокументКоносаменты.НомерКТК КАК НомерКТК
		|ПОМЕСТИТЬ ВТ_ВременнаяТаблица
		|ИЗ
		|	ВТ_ПодтверждающиеДокументы КАК СчетФактураВыданныйМорскойТранспорт
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент.Коносаменты КАК ТранспортныйДокументКоносаменты
		|		ПО (СчетФактураВыданныйМорскойТранспорт.Коносамент = ТранспортныйДокументКоносаменты.Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ВременнаяТаблица.Коносамент КАК ТранспортныйДокумент,
		|	ВТ_ВременнаяТаблица.НомерКТК КАК Контейнер,
		|	ЕСТЬNULL(СчетФактураВыданныйМорскойТранспорт.ДатаПодтвержденияНДС0, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаПодтвержденияНДС0
		|ИЗ
		|	ВТ_ВременнаяТаблица КАК ВТ_ВременнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодтверждающиеДокументы КАК СчетФактураВыданныйМорскойТранспорт
		|		ПО (ВТ_ВременнаяТаблица.НомерКТК = СчетФактураВыданныйМорскойТранспорт.Контейнер)
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НомерКТК)
		|ПО
		|	ТранспортныйДокумент";  
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.СчетФактураВыданный.МорскойТранспорт КАК ПодтверждающиеДокументы", 
												 "&ПодтверждающиеДокументы КАК ПодтверждающиеДокументы");  
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ
		|	ПодтверждающиеДокументы.Ссылка = &Ссылка", ""); 
		
		Запрос.УстановитьПараметр("ПодтверждающиеДокументы", Объект.МорскойТранспорт.Выгрузить(,"Коносамент, Контейнер, ДатаПодтвержденияНДС0")); 
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПодтверждающиеДокументы.ЖДН,
		|	ПодтверждающиеДокументы.ДатаПодтвержденияНДС0,
		|	ПодтверждающиеДокументы.Контейнер
		|ПОМЕСТИТЬ ВТ_ПодтверждающиеДокументы
		|ИЗ 
		|	Документ.СчетФактураВыданный.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы  
		|ГДЕ
		|	ПодтверждающиеДокументы.Ссылка = &Ссылка
		|;
		|		
		|ВЫБРАТЬ
		|	СчетФактураВыданныйПодтверждающиеДокументы.ЖДН КАК ЖДН,
		|	ТранспортныйДокументУчетныеЕдиницы.Контейнер КАК Контейнер
		|ПОМЕСТИТЬ ВТ_ВременнаяТаблица
		|ИЗ
		|	ВТ_ПодтверждающиеДокументы КАК СчетФактураВыданныйПодтверждающиеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент.УчетныеЕдиницы КАК ТранспортныйДокументУчетныеЕдиницы
		|		ПО (СчетФактураВыданныйПодтверждающиеДокументы.ЖДН = ТранспортныйДокументУчетныеЕдиницы.Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ВременнаяТаблица.ЖДН КАК ТранспортныйДокумент,
		|	ВТ_ВременнаяТаблица.Контейнер КАК Контейнер,
		|	ЕСТЬNULL(СчетФактураВыданныйПодтверждающиеДокументы.ДатаПодтвержденияНДС0, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаПодтвержденияНДС0
		|ИЗ
		|	ВТ_ВременнаяТаблица КАК ВТ_ВременнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодтверждающиеДокументы КАК СчетФактураВыданныйПодтверждающиеДокументы
		|		ПО (ВТ_ВременнаяТаблица.Контейнер = СчетФактураВыданныйПодтверждающиеДокументы.Контейнер)
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Контейнер)
		|ПО
		|	ТранспортныйДокумент";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.СчетФактураВыданный.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы", 
												 "&ПодтверждающиеДокументы КАК ПодтверждающиеДокументы");  
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ
		|	ПодтверждающиеДокументы.Ссылка = &Ссылка", ""); 
		
		Запрос.УстановитьПараметр("ПодтверждающиеДокументы", Объект.ПодтверждающиеДокументы.Выгрузить(,"ЖДН, Контейнер, ДатаПодтвержденияНДС0"));
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТранспортныйДокумент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаТранспортныйДокумент.Следующий() Цикл
		КоличествоКонтейнеров = ВыборкаТранспортныйДокумент.Контейнер;
		Если ВыборкаТранспортныйДокумент.Контейнер = 1 Тогда
			Продолжить;
		КонецЕсли;
		ВыборкаКТК = ВыборкаТранспортныйДокумент.Выбрать();
		ПодтвержденныеКонтейнеры = Новый Массив;
		Пока ВыборкаКТК.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаКТК.ДатаПодтвержденияНДС0) Тогда
				Если ПодтвержденныеКонтейнеры.Найти(ВыборкаКТК.Контейнер) = Неопределено Тогда
					ПодтвержденныеКонтейнеры.Добавить(ВыборкаКТК.Контейнер);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если ПодтвержденныеКонтейнеры.Количество() <> 0 Тогда
			Если КоличествоКонтейнеров <> ПодтвержденныеКонтейнеры.Количество() Тогда
				ЧастичноПодтвержденныеДокументы.Добавить(ВыборкаТранспортныйДокумент.ТранспортныйДокумент);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЧастичноПодтвержденныеДокументы;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСуммыПоКТК()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка ЕСТЬ NULL
	|			ТОГДА КорректировкаРеализацииРасшифровкаУслугПоТС.Цена
	|		ИНАЧЕ РеализацияТоваровУслугРасшифровкаУслугПоТС.Сумма
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка ЕСТЬ NULL
	|			ТОГДА КорректировкаРеализацииРасшифровкаУслугПоТС.Контейнер
	|		ИНАЧЕ РеализацияТоваровУслугРасшифровкаУслугПоТС.Контейнер
	|	КОНЕЦ КАК Контейнер
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО СчетФактураВыданный.Ссылка = СчетФактураВыданныйДокументыОснования.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.РасшифровкаУслугПоТС КАК РеализацияТоваровУслугРасшифровкаУслугПоТС
	|		ПО (РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка = СчетФактураВыданныйДокументыОснования.ДокументОснование)
	|			И (РеализацияТоваровУслугРасшифровкаУслугПоТС.СтавкаНДС = &СтавкаНДС)
	|			И (РеализацияТоваровУслугРасшифровкаУслугПоТС.Услуга = &Услуга)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.РасшифровкаУслугПоТС КАК КорректировкаРеализацииРасшифровкаУслугПоТС
	|		ПО (КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка = СчетФактураВыданныйДокументыОснования.ДокументОснование)
	|			И (КорректировкаРеализацииРасшифровкаУслугПоТС.СтавкаНДСДоИзменения = &СтавкаНДС)
	|			И (КорректировкаРеализацииРасшифровкаУслугПоТС.Услуга = &Услуга)
	|ГДЕ
	|	СчетФактураВыданный.Ссылка = &Ссылка
	|	И (НЕ РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка ЕСТЬ NULL
	|		ИЛИ НЕ КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка ЕСТЬ NULL)";
	
	Запрос.УстановитьПараметр("СтавкаНДС", Перечисления.СтавкиНДС.НДС0);
	Запрос.УстановитьПараметр("Услуга", Константы.УслугаФрахтаДляКалькуляции.Получить());
	Запрос.УстановитьПараметр("Ссылка", СчетФарктураСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Контейнер", Выборка.Контейнер);
		Если Объект.Фрахт Тогда
			НайденныеСтроки = ТаблицаФрахт.НайтиСтроки(Отбор);
			//НайденныеСтроки = Объект.МорскойТранспорт.НайтиСтроки(Отбор);
		Иначе
			НайденныеСтроки = Объект.ПодтверждающиеДокументы.НайтиСтроки(Отбор);
		КонецЕсли;
		Для Каждого Строка Из НайденныеСтроки Цикл
			Строка.СуммаПоКТК = Выборка.Сумма;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

// Евросиб(ДИТ) US 97291 ТА 97321 Сержантова А.С. 10.12.2024
&НаКлиенте
Процедура Коносаменты_ОтметитьВсе(Команда)
	Если Элементы.МорскойТранспорт.ОтборСтрок <> Неопределено Тогда     
		КлючСтроки = Элементы.МорскойТранспорт.ОтборСтрок["КлючСтроки"];
		СтрокиТаб = Объект.МорскойТранспорт.НайтиСтроки(Новый Структура("КлючСтроки", КлючСтроки)); 
		Для каждого СтрокаМорскогоТранспорта Из СтрокиТаб Цикл
			СтрокаМорскогоТранспорта.Флаг = Истина;	
		КонецЦикла;
	Иначе	
	    Для каждого СтрокаМорскогоТранспорта Из Объект.МорскойТранспорт Цикл
			СтрокаМорскогоТранспорта.Флаг = Истина;	
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Евросиб(ДИТ) US 97291 ТА 97321 Сержантова А.С. 10.12.2024
&НаКлиенте
Процедура Коносаменты_СнятьВсе(Команда)
	Если Элементы.МорскойТранспорт.ОтборСтрок <> Неопределено Тогда
		КлючСтроки = Элементы.МорскойТранспорт.ОтборСтрок["КлючСтроки"];
		СтрокиТаб = Объект.МорскойТранспорт.НайтиСтроки(Новый Структура("КлючСтроки", КлючСтроки)); 
		Для каждого СтрокаМорскогоТранспорта Из СтрокиТаб Цикл
			СтрокаМорскогоТранспорта.Флаг = Ложь;	
		КонецЦикла;
	Иначе	
	    Для каждого СтрокаМорскогоТранспорта Из Объект.МорскойТранспорт Цикл
			СтрокаМорскогоТранспорта.Флаг = Ложь;	
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Евросиб(ДИТ) US 90779 ТА 99010 Сержантова А.С. 09.01.2025
&НаКлиенте
Процедура ТаблицаФрахтПриАктивизацииСтроки(Элемент)
	Если Элементы.ТаблицаФрахт.ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 107705 23.04.2025
&НаКлиенте
Процедура ДобавитьИзИСФ(Команда)
	
	ПараметрыВыбора = Новый Структура("СчетФактура, Фрахт, Авто, ВидПеревозки", 
				СчетФарктураСсылка, Объект.Фрахт, Объект.Авто, Объект.ВидПеревозки);
	ОповещениеОЗакрытииФормыПодбора = Новый ОписаниеОповещения("ПослеДобавленияДанныхИзИСФ", ЭтаФорма); 
    ОткрытьФорму("Документ.СчетФактураВыданный.Форма.ФормаДобавленияГДТизИСФ",
				ПараметрыВыбора, ЭтаФорма,,,,ОповещениеОЗакрытииФормыПодбора,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры  

//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 107705 23.04.2025   
&НаКлиенте
Процедура ПослеДобавленияДанныхИзИСФ(АдресДобавленныеСтроки, ПараметрыВыбора) Экспорт

	Если ЗначениеЗаполнено(АдресДобавленныеСтроки) Тогда
		
		ПослеПолученияДанныхЗаполнения = Новый ОписаниеОповещения("ПослеВопросаПерезаполнитьДополнить", ЭтаФорма, АдресДобавленныеСтроки);
		ТекстВопроса = "Очистить таблицы ГТД и вставить строки подтверждения из выбранных ИСФ (ЗАМЕНИТЬ) или добавить строки к имеющимся (ДОПОЛНИТЬ)?";
		КнопкиОтветов = Новый СписокЗначений;
		КнопкиОтветов.Добавить(КодВозвратаДиалога.Да, "Заменить");
		КнопкиОтветов.Добавить(КодВозвратаДиалога.Нет, "Дополнить");
		КнопкиОтветов.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
		ПоказатьВопрос(ПослеПолученияДанныхЗаполнения, ТекстВопроса, КнопкиОтветов,,,"Вставка ГТД из ИСФ");
	
	КонецЕсли;	

КонецПроцедуры

//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 107705 23.04.2025
&НаКлиенте
Процедура ПослеВопросаПерезаполнитьДополнить(Ответ, АдресДобавленныеСтроки) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда 
		ЗаполнитьТаблицыГТДизИСФ(АдресДобавленныеСтроки);	
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		ЗаполнитьТаблицыГТДизИСФ(АдресДобавленныеСтроки, Истина);
	КонецЕсли;
	
КонецПроцедуры

//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 107705 23.04.2025
&НаСервере
Процедура ЗаполнитьТаблицыГТДизИСФ(АдресДобавленныеСтроки, Дополнить = Ложь)
	
	ДобавленныеДанныеГТД = ЗначениеИзСтрокиВнутр(АдресДобавленныеСтроки);
	
	Если Дополнить = Истина Тогда
		Для каждого СтрокаМорскогоТранспорта Из ДобавленныеДанныеГТД.МорскойТранспорт Цикл
			НС = Объект.МорскойТранспорт.Добавить();
			ЗаполнитьЗначенияСвойств(НС, СтрокаМорскогоТранспорта,,"НомерСтроки");
		КонецЦикла; 
		Для каждого СтрокаСуша Из ДобавленныеДанныеГТД.ПодтверждающиеДокументы Цикл
			НС = Объект.ПодтверждающиеДокументы.Добавить();
			ЗаполнитьЗначенияСвойств(НС, СтрокаСуша,,"НомерСтроки");
		КонецЦикла;

	Иначе
		Объект.ПодтверждающиеДокументы.Очистить();
		Объект.МорскойТранспорт.Очистить();
		ТаблицаФрахт.Очистить();
		
		Объект.МорскойТранспорт.Загрузить(ДобавленныеДанныеГТД.МорскойТранспорт);
		Объект.ПодтверждающиеДокументы.Загрузить(ДобавленныеДанныеГТД.ПодтверждающиеДокументы);   
	КонецЕсли;  
	
	ЗаполнитьТаблицуФрахтаНаСервере();

КонецПроцедуры

//Евросиб(ДИТ) Антонова А.С. US 87497 ТА 104722 13.05.2025
&НаКлиенте
Процедура АвтоТранпортОтправительПриИзменении(Элемент)
	
	ТекСтрока = Элементы.АвтоТранпорт.ТекущиеДанные;
	Если ТекСтрока <> Неопределено и ЗначениеЗаполнено(ТекСтрока.Отправитель) Тогда
		РеквизитыКонтрагента = ПолучитьДанныеКонтрагента(ТекСтрока.Отправитель);
		ТекСтрока.Отправитель_ИНН 			= РеквизитыКонтрагента.ИНН;
		ТекСтрока.Отправитель_Наименование 	= РеквизитыКонтрагента.Наименование;
	    ТекСтрока.Отправитель_Адрес 		= РеквизитыКонтрагента.Адрес;
	КонецЕсли;
	
КонецПроцедуры

//Евросиб(ДИТ) Антонова А.С. US 87497 ТА 104722 13.05.2025
Функция ПолучитьДанныеКонтрагента(КонтрагентСсылка)

	РеквизитыКонтрагента = Новый Структура("ИНН, Наименование, Адрес");
	
	ВсеСведения = ПечатьБухгалтерскихДокументов.СведенияОЮрФизЛице(КонтрагентСсылка, ТекущаяДата());
	РеквизитыКонтрагента.ИНН 			= ВсеСведения.ИНН;  
	РеквизитыКонтрагента.Наименование 	= ВсеСведения.ПолноеНаименование;
	РеквизитыКонтрагента.Адрес 			= ВсеСведения.ЮридическийАдрес;
	
	Возврат РеквизитыКонтрагента;
	
КонецФункции 

//Евросиб(ДИТ) Антонова А.С. US 87497 ТА 104722 13.05.2025
&НаКлиенте
Процедура АвтоТранпортПолучательПриИзменении(Элемент)
	
	ТекСтрока = Элементы.АвтоТранпорт.ТекущиеДанные;
	Если ТекСтрока <> Неопределено и ЗначениеЗаполнено(ТекСтрока.Получатель) Тогда
		РеквизитыКонтрагента = ПолучитьДанныеКонтрагента(ТекСтрока.Получатель);
		ТекСтрока.Получатель_ИНН 			= РеквизитыКонтрагента.ИНН;
		ТекСтрока.Получатель_Наименование 	= РеквизитыКонтрагента.Наименование;
	    ТекСтрока.Получатель_Адрес 			= РеквизитыКонтрагента.Адрес;
	КонецЕсли;
	
КонецПроцедуры

//Евросиб(ДИТ) Антонова А.С. US 87497 ТА 104722 13.05.2025
&НаКлиенте
Процедура АвтоТранпортПеревозчикПриИзменении(Элемент)
	
	ТекСтрока = Элементы.АвтоТранпорт.ТекущиеДанные;
	Если ТекСтрока <> Неопределено и ЗначениеЗаполнено(ТекСтрока.Перевозчик) Тогда
		РеквизитыКонтрагента = ПолучитьДанныеКонтрагента(ТекСтрока.Перевозчик);
		ТекСтрока.Перевозчик_ИНН 			= РеквизитыКонтрагента.ИНН;
		ТекСтрока.Перевозчик_Наименование 	= РеквизитыКонтрагента.Наименование;
	    ТекСтрока.Перевозчик_Адрес 			= РеквизитыКонтрагента.Адрес;
	КонецЕсли;
	
КонецПроцедуры

//Евросиб(ДИТ) Антонова А.С. US 87497 ТА 104722 13.05.2025
&НаКлиенте
Процедура АвтоТранпортПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока и ЗначениеЗаполнено(ЭтаФорма.Клиент) Тогда
		ТекСтрока = Элементы.АвтоТранпорт.ТекущиеДанные;	 
		Если ТекСтрока <> Неопределено Тогда
			РеквизитыКонтрагента = ПолучитьДанныеКонтрагента(ЭтаФорма.Клиент);
			ТекСтрока.Получатель				= ЭтаФорма.Клиент;
			ТекСтрока.Получатель_ИНН 			= РеквизитыКонтрагента.ИНН;
			ТекСтрока.Получатель_Наименование 	= РеквизитыКонтрагента.Наименование;
			ТекСтрока.Получатель_Адрес 			= РеквизитыКонтрагента.Адрес;
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры

