
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КТКВХранилище = Параметры.КТКВХранилище;
	ПроверкаНаРанееВыгруженные();
	КТКНаАвтоматическоеЗаполнение();
	Для Каждого Стр Из ТЗХранилище Цикл
		Стр.КоличествоОстаток = ПолучитьДоступныеКонтейнеры(Стр.ТипКТК,Стр.Контрагент,Стр.Назначение,Стр.Сток);
	КонецЦикла;

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаСервере
Процедура ПроверкаНаРанееВыгруженные()
	// отобразить на форме выбора только те контейнеры, которые отсутствуют в заявке и в РН
	ДанныеИзЗаявки = ПолучитьИзВременногоХранилища(КТКВХранилище);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВыбранныеСтроки.НомерКТК КАК Контейнер,
	               |	ВыбранныеСтроки.ПунктОтправления КАК Сток,
	               |	ВыбранныеСтроки.ПунктНазначения КАК Назначение,
	               |	ВыбранныеСтроки.ВладелецКТК КАК Контрагент,
	               |	ВыбранныеСтроки.ТипКТК КАК ТипКТК,
	               |	ВыбранныеСтроки.КонтейнерНаЗамену КАК КонтейнерНаЗамену,
	               |	ВыбранныеСтроки.ДатаВыдачи КАК ДатаВыдачи,
	               |	ВыбранныеСтроки.НормативноеИспользованиеИзСтока КАК НормативноеИспользованиеИзСтока
	               |ПОМЕСТИТЬ ВыбранныеСтроки
	               |ИЗ
	               |	&ВыбранныеСтроки КАК ВыбранныеСтроки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВыбранныеСтроки.Контейнер КАК Контейнер,
	               |	ВыбранныеСтроки.Сток КАК Сток,
	               |	ВыбранныеСтроки.Назначение КАК Назначение,
	               |	ВыбранныеСтроки.Контрагент КАК Контрагент,
	               |	ВыбранныеСтроки.ТипКТК КАК ТипКТК,
	               |	ВыбранныеСтроки.КонтейнерНаЗамену КАК КонтейнерНаЗамену,
	               |	ВыбранныеСтроки.ДатаВыдачи КАК ДатаВыдачи,
	               |	ВыбранныеСтроки.НормативноеИспользованиеИзСтока КАК НормативноеИспользованиеИзСтока
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	ВыбранныеСтроки КАК ВыбранныеСтроки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КонтейнерыВСтокахОстаткиИОбороты.Сток КАК Сток,
	               |	КонтейнерыВСтокахОстаткиИОбороты.Назначение КАК Назначение,
	               |	КонтейнерыВСтокахОстаткиИОбороты.Контрагент КАК Контрагент,
	               |	КонтейнерыВСтокахОстаткиИОбороты.Контейнер.ТипТЕ КАК ТипКТК,
	               |	СУММА(КонтейнерыВСтокахОстаткиИОбороты.КоличествоКонечныйОстаток) КАК КоличествоОстаток
	               |ПОМЕСТИТЬ КолвоНаЗамену
	               |ИЗ
	               |	РегистрНакопления.КонтейнерыВСтоках.ОстаткиИОбороты(
	               |			,
	               |			,
	               |			Регистратор,
	               |			,
	               |			(Контейнер.ТипТЕ, Контрагент, Назначение, Сток) В
	               |					(ВЫБРАТЬ
	               |						ВТ.ТипКТК,
	               |						ВТ.Контрагент,
	               |						ВТ.Назначение,
	               |						ВТ.Сток
	               |					ИЗ
	               |						ВТ КАК ВТ)
	               |				И НЕ Контейнер В
	               |						(ВЫБРАТЬ
	               |							ВТ.Контейнер
	               |						ИЗ
	               |							ВТ КАК ВТ)) КАК КонтейнерыВСтокахОстаткиИОбороты
	               |ГДЕ
	               |	КонтейнерыВСтокахОстаткиИОбороты.Контейнер ССЫЛКА Справочник.ТЕ
	               |	И НЕ КонтейнерыВСтокахОстаткиИОбороты.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	               |	И НЕ КонтейнерыВСтокахОстаткиИОбороты.Регистратор = &Регистратор
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КонтейнерыВСтокахОстаткиИОбороты.Сток,
	               |	КонтейнерыВСтокахОстаткиИОбороты.Назначение,
	               |	КонтейнерыВСтокахОстаткиИОбороты.Контрагент,
	               |	КонтейнерыВСтокахОстаткиИОбороты.Контейнер.ТипТЕ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.Контейнер КАК Контейнер,
	               |	ВТ.Контейнер КАК УдаленныйКонтейнер,
	               |	ВТ.Сток КАК Сток,
	               |	ВТ.Назначение КАК Назначение,
	               |	ВТ.Контрагент КАК Контрагент,
	               |	ВТ.ТипКТК КАК ТипКТК,
	               |	ВТ.КонтейнерНаЗамену КАК КонтейнерНаЗамену,
	               |	ВТ.ДатаВыдачи КАК ДатаВзятияИзСтока,
	               |	ВТ.НормативноеИспользованиеИзСтока КАК СрокВозврата,
	               |	КолвоНаЗамену.КоличествоОстаток КАК КоличествоОстаток
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КолвоНаЗамену КАК КолвоНаЗамену
	               |		ПО ВТ.Сток = КолвоНаЗамену.Сток
	               |			И ВТ.Назначение = КолвоНаЗамену.Назначение
	               |			И ВТ.Контрагент = КолвоНаЗамену.Контрагент
	               |			И ВТ.ТипКТК = КолвоНаЗамену.ТипКТК";
	Запрос.УстановитьПараметр("ВыбранныеСтроки",ДанныеИзЗаявки);
	Запрос.УстановитьПараметр("Регистратор",Параметры.Заявка);
	РезультатТЗ = Запрос.Выполнить().Выгрузить();
	ТЗХранилище.Загрузить(РезультатТЗ);
	
КонецПроцедуры	
	
&НаСервере
Процедура КТКНаАвтоматическоеЗаполнение()
	// отобразить на форме выбора только те контейнеры, которые отсутствуют в заявке и в РН
	//ДанныеИзЗаявки = ПолучитьИзВременногоХранилища(КТКВХранилище);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВыбранныеСтроки.Контейнер КАК Контейнер,
	               |	ВыбранныеСтроки.Сток КАК Сток,
	               |	ВыбранныеСтроки.Назначение КАК Назначение,
	               |	ВыбранныеСтроки.Контрагент КАК Контрагент,
	               |	ВыбранныеСтроки.ТипКТК КАК ТипКТК,
	               |	ВыбранныеСтроки.КонтейнерНаЗамену КАК КонтейнерНаЗамену
	               |ПОМЕСТИТЬ ВыбранныеСтроки
	               |ИЗ
	               |	&ВыбранныеСтроки КАК ВыбранныеСтроки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВыбранныеСтроки.Контейнер КАК Контейнер,
	               |	ВыбранныеСтроки.Сток КАК Сток,
	               |	ВыбранныеСтроки.Назначение КАК Назначение,
	               |	ВыбранныеСтроки.Контрагент КАК Контрагент,
	               |	ВыбранныеСтроки.ТипКТК КАК ТипКТК,
	               |	ВыбранныеСтроки.КонтейнерНаЗамену КАК КонтейнерНаЗамену
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	ВыбранныеСтроки КАК ВыбранныеСтроки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КонтейнерыВСтокахОстаткиИОбороты.Сток КАК Сток,
	               |	КонтейнерыВСтокахОстаткиИОбороты.Назначение КАК Назначение,
	               |	КонтейнерыВСтокахОстаткиИОбороты.Контрагент КАК Контрагент,
	               |	КонтейнерыВСтокахОстаткиИОбороты.Контейнер.ТипТЕ КАК ТипКТК,
	               |	КонтейнерыВСтокахОстаткиИОбороты.Контейнер КАК Контейнер,
	               |	КонтейнерыВСтокахОстаткиИОбороты.ДатаВзятияИзСтока КАК ДатаВзятияИзСтока,
	               |	КонтейнерыВСтокахОстаткиИОбороты.СрокВозврата КАК СрокВозврата,
	               |	СУММА(КонтейнерыВСтокахОстаткиИОбороты.КоличествоОборот) КАК КоличествоОборот
	               |ИЗ
	               |	РегистрНакопления.КонтейнерыВСтоках.ОстаткиИОбороты(
	               |			,
	               |			,
	               |			Регистратор,
	               |			,
	               |			(Контейнер.ТипТЕ, Контрагент, Назначение, Сток) В
	               |					(ВЫБРАТЬ
	               |						ВТ.ТипКТК,
	               |						ВТ.Контрагент,
	               |						ВТ.Назначение,
	               |						ВТ.Сток
	               |					ИЗ
	               |						ВТ КАК ВТ)
	               |				И НЕ Контейнер В
	               |						(ВЫБРАТЬ
	               |							ВТ.Контейнер
	               |						ИЗ
	               |							ВТ КАК ВТ)) КАК КонтейнерыВСтокахОстаткиИОбороты
	               |ГДЕ
	               |	КонтейнерыВСтокахОстаткиИОбороты.Контейнер ССЫЛКА Справочник.ТЕ
	               |	И НЕ КонтейнерыВСтокахОстаткиИОбороты.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	               |	И НЕ КонтейнерыВСтокахОстаткиИОбороты.Регистратор = &Регистратор
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КонтейнерыВСтокахОстаткиИОбороты.Сток,
	               |	КонтейнерыВСтокахОстаткиИОбороты.Назначение,
	               |	КонтейнерыВСтокахОстаткиИОбороты.Контрагент,
	               |	КонтейнерыВСтокахОстаткиИОбороты.Контейнер.ТипТЕ,
	               |	КонтейнерыВСтокахОстаткиИОбороты.Контейнер,
	               |	КонтейнерыВСтокахОстаткиИОбороты.ДатаВзятияИзСтока,
	               |	КонтейнерыВСтокахОстаткиИОбороты.СрокВозврата
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(КонтейнерыВСтокахОстаткиИОбороты.КоличествоОборот) > 0";
	Запрос.УстановитьПараметр("ВыбранныеСтроки",ТЗХранилище.Выгрузить());
	Запрос.УстановитьПараметр("Регистратор",Параметры.Заявка);
	РезультатТЗ = Запрос.Выполнить().Выгрузить();
	Для Каждого Стр Из РезультатТЗ Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Сток",Стр.Сток);
		ПараметрыОтбора.Вставить("Назначение",Стр.Назначение);
		ПараметрыОтбора.Вставить("Контрагент",Стр.Контрагент);
		ПараметрыОтбора.Вставить("ТипКТК",Стр.ТипКТК);
		ПараметрыОтбора.Вставить("КонтейнерНаЗамену",Справочники.ТЕ.ПустаяСсылка());
		ПараметрыОтбора.Вставить("Контейнер",Справочники.ТЕ.ПустаяСсылка());
		НайденныеСтроки = ТЗХранилище.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество()>0 Тогда
			НайденныеСтроки[0].КонтейнерНаЗамену = Стр.Контейнер;
			НайденныеСтроки[0].ДатаВзятияИзСтока = Стр.ДатаВзятияИзСтока;
			НайденныеСтроки[0].СрокВозврата = Стр.СрокВозврата;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры	
	
&НаКлиенте
Процедура ОК(Команда)
	
	// если контейнер был удален (очищено поле), то необходимо именно этот контейнер удалить в заявке.
	// для этого записать в поля НомерКТК и КонтейнерНаЗамену одинаковые значения. Это будет признаком в
	// заявке для того, чтобы очистить конкретное поле НомерКТК
	Для Каждого Стр Из ТЗХранилище Цикл
		Если ЗначениеЗаполнено(Стр.УдаленныйКонтейнер) И 
			НЕ ЗначениеЗаполнено(Стр.Контейнер) И 
			НЕ ЗначениеЗаполнено(Стр.КонтейнерНаЗамену) Тогда
			Стр.Контейнер = Стр.УдаленныйКонтейнер;
			Стр.КонтейнерНаЗамену = Стр.УдаленныйКонтейнер;
		КонецЕсли;
	КонецЦикла;
	ЗаписатьПодборВХранилище();
	ВладелецФормы.ОбработатьЗамену();
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПодборВХранилище()
	
	ТЗДляЗаявки = ПолучитьИзВременногоХранилища(КТКВХранилище);
	ТЗДляЗаявки.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВыбранныеСтроки.Контейнер КАК Контейнер,
	               |	ВыбранныеСтроки.Контейнер КАК УдаленныйКонтейнер,
	               |	ВыбранныеСтроки.Сток КАК Сток,
	               |	ВыбранныеСтроки.ТипКТК КАК ТипКТК,
	               |	ВыбранныеСтроки.Назначение КАК Назначение,
	               |	ВыбранныеСтроки.Контрагент КАК Контрагент,
	               |	ВыбранныеСтроки.КонтейнерНаЗамену КАК КонтейнерНаЗамену,
	               |	ВыбранныеСтроки.ДатаВзятияИзСтока КАК ДатаВзятияИзСтока,
	               |	ВыбранныеСтроки.СрокВозврата КАК СрокВозврата,
	               |	ВыбранныеСтроки.ИнструкцииПоСдачеПорожнего КАК ИнструкцииПоСдачеПорожнего
	               |ПОМЕСТИТЬ ВыбранныеСтроки
	               |ИЗ
	               |	&ВыбранныеСтроки КАК ВыбранныеСтроки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВыбранныеСтроки.Контейнер КАК НомерКТК,
	               |	ВыбранныеСтроки.Сток КАК ПунктОтправления,
	               |	ВыбранныеСтроки.Сток КАК СтанцияОтправления,
	               |	ВыбранныеСтроки.Назначение КАК ПунктНазначения,
	               |	ВыбранныеСтроки.Назначение КАК СтанцияНазначения,
	               |	ВыбранныеСтроки.ТипКТК КАК ТипКТК,
	               |	ВыбранныеСтроки.Контрагент КАК ВладелецКТК,
	               |	ВыбранныеСтроки.КонтейнерНаЗамену КАК КонтейнерНаЗамену,
	               |	ВыбранныеСтроки.ДатаВзятияИзСтока КАК ДатаВзятияИзСтока,
	               |	ВыбранныеСтроки.СрокВозврата КАК СрокВозврата,
	               |	ВыбранныеСтроки.ИнструкцииПоСдачеПорожнего КАК ИнструкцииПоСдачеПорожнего
	               |ИЗ
	               |	ВыбранныеСтроки КАК ВыбранныеСтроки";
	Запрос.УстановитьПараметр("ВыбранныеСтроки",ТЗХранилище.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	ТЗ = РезультатЗапроса.Выгрузить();
	
	ПоместитьВоВременноеХранилище(ТЗ,КТКВХранилище);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура ТЗХранилищеКонтейнерНаЗаменуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекД = Элементы.ТЗХранилище.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивКонтейнеров = ПолучитьДоступныеКонтейнеры(ТекД.ТипКТК,ТекД.Контрагент,ТекД.Назначение,ТекД.Сток);
	СтандартнаяОбработка = Ложь;
	ЗначениеОтбора = Новый Структура("Ссылка", МассивКонтейнеров);
	ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораКТК", ЭтотОбъект, ТекД);
	ОткрытьФорму("Справочник.ТЕ.ФормаВыбора", ПараметрыВыбора,,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораКТК(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда 
		Возврат; 
	КонецЕсли;
	
	ДатаИСрокИсп = ПолучитьДатуИСрокИсп(Результат,ДопПараметры.Сток,ДопПараметры.Назначение,ДопПараметры.Контрагент,ДопПараметры.ТипКТК); 
	
	ДопПараметры.КонтейнерНаЗамену = Результат;

	Если НЕ ДатаИСрокИсп = 0 Тогда
		ДопПараметры.ДатаВзятияИзСтока = ДатаИСрокИсп.ДатаИсп;
		ДопПараметры.СрокВозврата = ДатаИСрокИсп.СрокИсп;
	КонецЕсли;
	
	ОбновитьСведенияПоКолвуКонтейнеров();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДатуИСрокИсп(НомерКТК,Сток,Назначение,Контрагент,ТипКТК)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтейнерыВСтокахОстатки.ДатаВзятияИзСтока КАК ДатаВзятияИзСтока,
	               |	КонтейнерыВСтокахОстатки.СрокВозврата КАК СрокВозврата
	               |ИЗ
	               |	РегистрНакопления.КонтейнерыВСтоках.Остатки(
	               |			,
	               |			Контейнер = &Контейнер
	               |				И Сток = &Сток
	               |				И Контрагент = &Контрагент
	               |				И Назначение = &Назначение) КАК КонтейнерыВСтокахОстатки";
	Запрос.УстановитьПараметр("Контейнер",НомерКТК);
	Запрос.УстановитьПараметр("ТипКТК",ТипКТК);
	Запрос.УстановитьПараметр("Сток",Сток);
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("Назначение",Назначение);
	
	РЗ = Запрос.Выполнить();
	ТЗ = РЗ.Выгрузить();
	СтруктураРезультата = Новый Структура;
	Если ТЗ.Количество()>0 Тогда
		СтруктураРезультата.Вставить("ДатаИсп",ТЗ[0].ДатаВзятияИзСтока);
		СтруктураРезультата.Вставить("СрокИсп",ТЗ[0].СрокВозврата);
		Возврат СтруктураРезультата;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСведенияПоКолвуКонтейнеров()
	
	// после изменения данных в таблице нужно обновить сведения по доступным контейнерам с учетом сделанного выбора (или сброшенного)
	ТекД = Элементы.ТЗХранилище.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивКонтейнеров = ПолучитьДоступныеКонтейнеры(ТекД.ТипКТК,ТекД.Контрагент,ТекД.Назначение,ТекД.Сток);
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ТипКТК",ТекД.ТипКТК);
	ПараметрыОтбора.Вставить("Контрагент",ТекД.Контрагент);
	ПараметрыОтбора.Вставить("Назначение",ТекД.Назначение);
	ПараметрыОтбора.Вставить("Сток",ТекД.Сток);
	НайденныеСтроки = ТЗХранилище.НайтиСтроки(ПараметрыОтбора);
	Для Каждого Стр Из НайденныеСтроки Цикл
		Стр.КоличествоОстаток = МассивКонтейнеров.Количество();
	КонецЦикла;
	
КонецПроцедуры
	
&НаСервере
Функция ПолучитьДоступныеКонтейнеры(ТипКТК,Контрагент,Назначение,Сток)
	
	// необходимо получить доступные для выбора контейнеры, которые отсутствуют в заявке, 
	// а так же среди контейнеров, которые уже выбраны в столбце "КонтейнерНаЗамену"
	МассивКонт = Новый Массив;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ТипКТК",ТипКТК);
	ПараметрыОтбора.Вставить("Контрагент",Контрагент);
	ПараметрыОтбора.Вставить("Назначение",Назначение);
	ПараметрыОтбора.Вставить("Сток",Сток);
	НайденныеСтроки = ТЗХранилище.НайтиСтроки(ПараметрыОтбора);	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВыбранныеСтроки.Контейнер КАК Контейнер,
	               |	ВыбранныеСтроки.Сток КАК Сток,
	               |	ВыбранныеСтроки.Назначение КАК Назначение,
	               |	ВыбранныеСтроки.Контрагент КАК Контрагент,
	               |	ВыбранныеСтроки.ТипКТК КАК ТипКТК,
	               |	ВыбранныеСтроки.КонтейнерНаЗамену КАК КонтейнерНаЗамену,
	               |	ВыбранныеСтроки.КоличествоОстаток КАК КоличествоОстаток
	               |ПОМЕСТИТЬ ВыбранныеСтроки
	               |ИЗ
	               |	&ВыбранныеСтроки КАК ВыбранныеСтроки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВыбранныеСтроки.Контейнер КАК Контейнер,
	               |	ВыбранныеСтроки.Сток КАК Сток,
	               |	ВыбранныеСтроки.Назначение КАК Назначение,
	               |	ВыбранныеСтроки.Контрагент КАК Контрагент,
	               |	ВыбранныеСтроки.ТипКТК КАК ТипКТК,
	               |	ВыбранныеСтроки.КонтейнерНаЗамену КАК КонтейнерНаЗамену,
	               |	ВыбранныеСтроки.КоличествоОстаток КАК КоличествоОстаток
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	ВыбранныеСтроки КАК ВыбранныеСтроки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КонтейнерыВСтокахОстаткиИОбороты.Сток КАК Сток,
	               |	КонтейнерыВСтокахОстаткиИОбороты.Назначение КАК Назначение,
	               |	КонтейнерыВСтокахОстаткиИОбороты.Контрагент КАК Контрагент,
	               |	КонтейнерыВСтокахОстаткиИОбороты.Контейнер.ТипТЕ КАК ТипКТК,
	               |	КонтейнерыВСтокахОстаткиИОбороты.Контейнер КАК Контейнер,
	               |	СУММА(КонтейнерыВСтокахОстаткиИОбороты.КоличествоКонечныйОстаток) КАК КоличествоОстаток
	               |ИЗ
	               |	РегистрНакопления.КонтейнерыВСтоках.ОстаткиИОбороты(
	               |			,
	               |			,
	               |			Регистратор,
	               |			,
	               |			(Контейнер.ТипТЕ, Контрагент, Назначение, Сток) В
	               |					(ВЫБРАТЬ
	               |						ВТ.ТипКТК,
	               |						ВТ.Контрагент,
	               |						ВТ.Назначение,
	               |						ВТ.Сток
	               |					ИЗ
	               |						ВТ КАК ВТ)
	               |				И НЕ Контейнер В
	               |						(ВЫБРАТЬ
	               |							ВТ.КонтейнерНаЗамену
	               |						ИЗ
	               |							ВТ КАК ВТ)
	               |				И НЕ Контейнер В
	               |						(ВЫБРАТЬ
	               |							ВТ.Контейнер
	               |						ИЗ
	               |							ВТ КАК ВТ)) КАК КонтейнерыВСтокахОстаткиИОбороты
	               |ГДЕ
	               |	КонтейнерыВСтокахОстаткиИОбороты.Контейнер ССЫЛКА Справочник.ТЕ
	               |	И НЕ КонтейнерыВСтокахОстаткиИОбороты.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	               |	И НЕ КонтейнерыВСтокахОстаткиИОбороты.Регистратор = &Регистратор
	               |	И КонтейнерыВСтокахОстаткиИОбороты.КоличествоКонечныйОстаток > 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КонтейнерыВСтокахОстаткиИОбороты.Контрагент,
	               |	КонтейнерыВСтокахОстаткиИОбороты.Сток,
	               |	КонтейнерыВСтокахОстаткиИОбороты.Назначение,
	               |	КонтейнерыВСтокахОстаткиИОбороты.Контейнер,
	               |	КонтейнерыВСтокахОстаткиИОбороты.Контейнер.ТипТЕ";
	Запрос.УстановитьПараметр("ВыбранныеСтроки",ТЗХранилище.Выгрузить(НайденныеСтроки));
	Запрос.УстановитьПараметр("Регистратор",Параметры.Заявка);
	
	МассивКонт = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Контейнер");

	Возврат МассивКонт;
	
КонецФункции


&НаКлиенте
Процедура ТЗХранилищеПриИзменении(Элемент)
	
	ОбновитьСведенияПоКолвуКонтейнеров();
	
КонецПроцедуры
	
&НаКлиенте
Процедура ЗагрузитьExcel(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ВставитьИзEXCELОбработка", ЭтаФорма, Новый Структура("КТК", Истина));
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("КТК", Истина), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьИзEXCELОбработка(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если ТипЗнч(Параметр1) <> Тип("Массив") тогда 
		Возврат; 
	КонецЕсли;
	
	Для Каждого Стр Из ТЗХранилище Цикл
		Стр.Контейнер = ПредопределенноеЗначение("Справочник.ТЕ.ПустаяСсылка");
		Стр.КонтейнерНаЗамену = ПредопределенноеЗначение("Справочник.ТЕ.ПустаяСсылка");
	КонецЦикла;
	
	ВставитьКТКСток(Параметр1);
	
	КолвоНеВСтоке = КонтейнерыНеВСтоке.Количество();
	Если КолвоНеВСтоке>0 Тогда
		Элементы.Группа3.Видимость = Истина;
		Элементы.Группа3.ЗаголовокСвернутогоОтображения = "Контейнеры не в стоке (" + КонтейнерыНеВСтоке.Количество() + ")";
	Иначе
		Элементы.Группа3.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВставитьКТКСток(СписокКТКФайл)
	
	КонтейнерыНеВСтоке.Очистить();
	// вставить из документа только те контейнеры, которые отсутствуют в заявке и есть в стоке
	ДанныеИзЗаявки = ПолучитьИзВременногоХранилища(КТКВХранилище);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВыбранныеСтроки.Контейнер КАК Контейнер,
	               |	ВыбранныеСтроки.Сток КАК Сток,
	               |	ВыбранныеСтроки.Назначение КАК Назначение,
	               |	ВыбранныеСтроки.Контрагент КАК Контрагент,
	               |	ВыбранныеСтроки.ТипКТК КАК ТипКТК,
	               |	ВыбранныеСтроки.КонтейнерНаЗамену КАК КонтейнерНаЗамену
	               |ПОМЕСТИТЬ ВыбранныеСтроки
	               |ИЗ
	               |	&ВыбранныеСтроки КАК ВыбранныеСтроки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВыбранныеСтроки.Контейнер КАК Контейнер,
	               |	ВыбранныеСтроки.Сток КАК Сток,
	               |	ВыбранныеСтроки.Назначение КАК Назначение,
	               |	ВыбранныеСтроки.Контрагент КАК Контрагент,
	               |	ВыбранныеСтроки.ТипКТК КАК ТипКТК,
	               |	ВыбранныеСтроки.КонтейнерНаЗамену КАК КонтейнерНаЗамену
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	ВыбранныеСтроки КАК ВыбранныеСтроки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КонтейнерыВСтокахОстаткиИОбороты.Сток КАК Сток,
	               |	КонтейнерыВСтокахОстаткиИОбороты.Назначение КАК Назначение,
	               |	КонтейнерыВСтокахОстаткиИОбороты.Контрагент КАК Контрагент,
	               |	КонтейнерыВСтокахОстаткиИОбороты.Контейнер.ТипТЕ КАК ТипКТК,
	               |	КонтейнерыВСтокахОстаткиИОбороты.Контейнер КАК Контейнер
	               |ИЗ
	               |	РегистрНакопления.КонтейнерыВСтоках.ОстаткиИОбороты(
	               |			,
	               |			,
	               |			Регистратор,
	               |			,
	               |			(Контейнер.ТипТЕ, Контрагент, Назначение, Сток) В
	               |				(ВЫБРАТЬ
	               |					ВТ.ТипКТК,
	               |					ВТ.Контрагент,
	               |					ВТ.Назначение,
	               |					ВТ.Сток
	               |				ИЗ
	               |					ВТ КАК ВТ)) КАК КонтейнерыВСтокахОстаткиИОбороты
	               |ГДЕ
	               |	КонтейнерыВСтокахОстаткиИОбороты.Контейнер ССЫЛКА Справочник.ТЕ
	               |	И НЕ КонтейнерыВСтокахОстаткиИОбороты.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	               |	И НЕ КонтейнерыВСтокахОстаткиИОбороты.Регистратор = &Регистратор
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КонтейнерыВСтокахОстаткиИОбороты.Сток,
	               |	КонтейнерыВСтокахОстаткиИОбороты.Назначение,
	               |	КонтейнерыВСтокахОстаткиИОбороты.Контрагент,
	               |	КонтейнерыВСтокахОстаткиИОбороты.Контейнер.ТипТЕ,
	               |	КонтейнерыВСтокахОстаткиИОбороты.Контейнер";
	Запрос.УстановитьПараметр("ВыбранныеСтроки",ТЗХранилище.Выгрузить());
	Запрос.УстановитьПараметр("Регистратор",Параметры.Заявка);
	РезультатТЗ = Запрос.Выполнить().Выгрузить();
	Для Каждого Стр Из РезультатТЗ Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Сток",Стр.Сток);
		ПараметрыОтбора.Вставить("Назначение",Стр.Назначение);
		ПараметрыОтбора.Вставить("Контрагент",Стр.Контрагент);
		ПараметрыОтбора.Вставить("ТипКТК",Стр.ТипКТК);
		// обязательно ставим отбор по пустой строке, иначе при каждом новом обходе будем затирать ранее введенный КТК
		ПараметрыОтбора.Вставить("Контейнер",Справочники.ТЕ.ПустаяСсылка());
		НайденныеСтроки = ТЗХранилище.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество()>0 Тогда
			// если этот номер контейнера есть в списке из файла, то записать его в таблицу и удалить и массива,
			// чтобы в массиве остались только те КТК, которых нет в стоке
			ИндексКТК = СписокКТКФайл.Найти(Стр.Контейнер);
			Если НЕ ИндексКТК = Неопределено Тогда
				НайденныеСтроки[0].Контейнер = Стр.Контейнер;
				СписокКТКФайл.Удалить(ИндексКТК);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	// пересчет остатка доступных КТК
	Для Каждого Стр Из ТЗХранилище Цикл
		Стр.КоличествоОстаток = ПолучитьДоступныеКонтейнеры(Стр.ТипКТК,Стр.Контрагент,Стр.Назначение,Стр.Сток);
	КонецЦикла;
	// заполнение таблицы КонтейнерыНеВСтоке теми КТК, кототорых нет в стоке, но есть в файле
	Для Каждого Элем Из СписокКТКФайл Цикл
		НовСтр = КонтейнерыНеВСтоке.Добавить();
		НовСтр.Контейнер = Элем;
	КонецЦикла;
	
КонецПроцедуры

