Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Автор 	= Пользователи.ТекущийПользователь();
	ЦФО 	= Автор.ЦФО;
	Создано = ТекущаяДата();
	
	Организация 	= Константы.ОсновнаяОрганизация.Получить();
	ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
	Маршрутизировать= Константы.МаршрутизироватьКорректировкуРеализации.Получить();
	//Евросиб Каблов 09.04.2025 ( #105407
	//ПериодВО 		= КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Организация);
	ПериодВО 		= КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(Организация);
	//Евросиб Каблов 09.04.2025 )
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		// Заполнение шапки
		Организация 			= ДанныеЗаполнения.Организация;
		ПодразделениеОрганизации= ДанныеЗаполнения.ПодразделениеОрганизации;
		ВалютаДокумента 		= ДанныеЗаполнения.ВалютаДокумента;
		КратностьВзаиморасчетов = ДанныеЗаполнения.КратностьВзаиморасчетов;
		КурсВзаиморасчетов 		= ДанныеЗаполнения.КурсВзаиморасчетов;
		Контрагент 				= ДанныеЗаполнения.Контрагент;
		ДоговорКонтрагента 		= ДанныеЗаполнения.ДоговорКонтрагента;
		Грузоотправитель 		= ДанныеЗаполнения.Грузоотправитель;
		Грузополучатель 		= ДанныеЗаполнения.Грузополучатель;
		АдресДоставки 			= ДанныеЗаполнения.АдресДоставки;
		БанковскийСчетОрганизации = ДанныеЗаполнения.БанковскийСчетОрганизации;
		//ДИТ, Беляев СЮ, BUG 57827, 26-04-2023, начало
		ДатаКурса				= ДанныеЗаполнения.ДатаКурса;
		//ДИТ, Беляев СЮ, BUG 57827, 26-04-2023, коенц
		
		ВидОперации 					= Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки;
		ИсправляемыйДокументРеализации 	= ДанныеЗаполнения.Ссылка;
		ИсходныйДокументРеализации 		= ДанныеЗаполнения.Ссылка;
		ДокументРеализации 				= ДанныеЗаполнения.Ссылка;
		
		Руководитель 					= ДанныеЗаполнения.Руководитель;
		ГлавныйБухгалтер 				= ДанныеЗаполнения.ГлавныйБухгалтер;
		ЗаРуководителяНаОсновании 		= ДанныеЗаполнения.ЗаРуководителяНаОсновании;
		ЗаГлавногоБухгалтераНаОсновании = ДанныеЗаполнения.ЗаГлавногоБухгалтераНаОсновании;
		
		УчитыватьНДС 			= ДанныеЗаполнения.УчитыватьНДС;
		СуммаВключаетНДС 		= ДанныеЗаполнения.СуммаВключаетНДС;
		СуммаДокумента 			= ДанныеЗаполнения.СуммаДокумента;
		СуммаНДСДокумента 		= ДанныеЗаполнения.Товары.Итог("СуммаНДС") + ДанныеЗаполнения.Услуги.Итог("СуммаНДС");
		
		Ответственный 			= ДанныеЗаполнения.Ответственный;
		Комментарий 			= ДанныеЗаполнения.Комментарий;
		
		Сделка 		= ДанныеЗаполнения.Услуги[0].Сделка;
		
		ПоставщикВУ = ДанныеЗаполнения.ПоставщикВУ;
		ПокупательВУ= ДанныеЗаполнения.ПокупательВУ;
		//ДоверенностьЗаРуководителя = ДанныеЗаполнения.ДоверенностьЗаРуководителя;
		//ДоверенностьЗаГлБухгалтера = ДанныеЗаполнения.ДоверенностьЗаГлБухгалтера;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.КоличествоДоИзменения = ТекСтрокаТовары.Количество;
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.СуммаДоИзменения = ТекСтрокаТовары.Сумма;
			НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
			НоваяСтрока.СуммаНДСДоИзменения = ТекСтрокаТовары.СуммаНДС;
			НоваяСтрока.СуммаНДС = ТекСтрокаТовары.СуммаНДС;
			НоваяСтрока.ЦенаДоИзменения = ТекСтрокаТовары.Цена;
			НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
			НоваяСтрока.СтавкаНДСДоИзменения = ТекСтрокаТовары.СтавкаНДС;
			НоваяСтрока.СтавкаНДС = ТекСтрокаТовары.СтавкаНДС;
		КонецЦикла;
		Для Каждого ТекСтрокаУслуги Из ДанныеЗаполнения.Услуги Цикл
			НоваяСтрока = Услуги.Добавить(); 
			//Субботин исправление бага 130097 26.02.2026 Начало
            ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаУслуги);
			//ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаУслуги,, "СуммаБезНалога, СуммаНДСРуб, ВсегоСНДС");
			//Субботин исправление бага 130097 26.02.2026
			
			НоваяСтрока.КоличествоДоИзменения = ТекСтрокаУслуги.Количество;
			//НоваяСтрока.Количество = ТекСтрокаУслуги.Количество;
			//НоваяСтрока.Номенклатура = ТекСтрокаУслуги.Номенклатура;
			НоваяСтрока.СодержаниеДоИзменения = ТекСтрокаУслуги.Содержание;
			//НоваяСтрока.Содержание = ТекСтрокаУслуги.Содержание;
			НоваяСтрока.СуммаДоИзменения = ТекСтрокаУслуги.Сумма;
			//НоваяСтрока.Сумма = ТекСтрокаУслуги.Сумма;
			НоваяСтрока.СуммаНДСДоИзменения = ТекСтрокаУслуги.СуммаНДС;
			//НоваяСтрока.СуммаНДС = ТекСтрокаУслуги.СуммаНДС;
			НоваяСтрока.ЦенаДоИзменения = ТекСтрокаУслуги.Цена;
			//НоваяСтрока.Цена = ТекСтрокаУслуги.Цена;
			НоваяСтрока.СтавкаНДСДоИзменения = ТекСтрокаУслуги.СтавкаНДС;			
			//НоваяСтрока.СтавкаНДС = ТекСтрокаУслуги.СтавкаНДС;
			//НоваяСтрока.СтрокаДоходовСделки = ТекСтрокаУслуги.СтрокаДоходовСделки;
			НоваяСтрока.ЕстьВДокументеРеализации = Истина;
			//Евросиб Каблов 07.11.2022 ( 54532
			НоваяСтрока.ВидЗадолженности = ТекСтрокаУслуги.ВидЗадолженности;
			//Евросиб Каблов 07.11.2022 )
			//Евросиб Каблов 14.05.2021 ( Ticket#0230505
			НоваяСтрока.Всего = ?(СуммаВключаетНДС, НоваяСтрока.Сумма, НоваяСтрока.Сумма + НоваяСтрока.СуммаНДС);
			НоваяСтрока.ВсегоДоИзменения = ?(СуммаВключаетНДС, НоваяСтрока.СуммаДоИзменения, НоваяСтрока.СуммаДоИзменения + НоваяСтрока.СуммаНДСДоИзменения);			
			//Евросиб Каблов 14.05.2021 ) 
			// Субботин TASK 72390 24.07.2023 Начало 
			НоваяСтрока.СуммаБезНалогаДоКорректировки 	= ТекСтрокаУслуги.СуммаБезНалога;
			НоваяСтрока.СтавкаНДСРубДоКорректировки 	= ТекСтрокаУслуги.СтавкаНДСРуб;
			НоваяСтрока.СуммаНДСРубДоКорректировки 		= ТекСтрокаУслуги.СуммаНДСРуб;
			НоваяСтрока.ВсегоСНДСДоКорректировки 		= ТекСтрокаУслуги.ВсегоСНДС;
			// Субботин TASK 72390 24.07.2023  Конец
			////Субботин исправление бага 130097 26.02.2026 Начало
			//НоваяСтрока.СуммаБезНалога = Валюта_сервер.ПересчитатьПоКурсу(НоваяСтрока.Сумма, ВалютаДокумента, РегВалюта, ДатаКурса);
			//НоваяСтрока.СуммаНДСРуб =  Валюта_сервер.ПересчитатьПоКурсу(НоваяСтрока.СуммаНДС, ВалютаДокумента, РегВалюта, ДатаКурса);
			//НоваяСтрока.ВсегоСНДС =    Валюта_сервер.ПересчитатьПоКурсу(НоваяСтрока.Всего, ВалютаДокумента, РегВалюта, ДатаКурса);
			////Субботин исправление бага 130097 26.02.2026

		КонецЦикла;
		Для Каждого ТекСтрокаУслуги Из ДанныеЗаполнения.АгентскиеУслуги Цикл
			НоваяСтрока = АгентскиеУслуги.Добавить();
			НоваяСтрока.КоличествоДоИзменения = ТекСтрокаУслуги.Количество;
			НоваяСтрока.Количество = ТекСтрокаУслуги.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаУслуги.Номенклатура;
			НоваяСтрока.СодержаниеДоИзменения = ТекСтрокаУслуги.Содержание;
			НоваяСтрока.Содержание = ТекСтрокаУслуги.Содержание;
			НоваяСтрока.СуммаДоИзменения = ТекСтрокаУслуги.Сумма;
			НоваяСтрока.Сумма = ТекСтрокаУслуги.Сумма;
			НоваяСтрока.СуммаНДСДоИзменения = ТекСтрокаУслуги.СуммаНДС;
			НоваяСтрока.СуммаНДС = ТекСтрокаУслуги.СуммаНДС;
			НоваяСтрока.ЦенаДоИзменения = ТекСтрокаУслуги.Цена;
			НоваяСтрока.Цена = ТекСтрокаУслуги.Цена;
			НоваяСтрока.СтавкаНДСДоИзменения = ТекСтрокаУслуги.СтавкаНДС;
			НоваяСтрока.СтавкаНДС = ТекСтрокаУслуги.СтавкаНДС;
			НоваяСтрока.Контрагент = ТекСтрокаУслуги.КОнтрагент;
			НоваяСтрока.ДоговорКонтрагента = ТекСтрокаУслуги.ДоговорКонтрагента;
			НоваяСтрока.ЕстьВДокументеРеализации = Истина;
		КонецЦикла;

		Для каждого ТекСтрокаУслуги Из ДанныеЗаполнения.РасшифровкаУслугПоТС Цикл
		
			НовСтр = РасшифровкаУслугПоТС.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, ТекСтрокаУслуги);
			НовСтр.ЦенаДоИзменения 					= ТекСтрокаУслуги.Цена;
			НовСтр.СуммаДоИзменения 				= ТекСтрокаУслуги.Сумма;
			НовСтр.СтавкаНДСДоИзменения 			= ТекСтрокаУслуги.СтавкаНДС;
			НовСтр.СуммаНДСДоИзменения 				= ТекСтрокаУслуги.СуммаНДС;
			НовСтр.СтрокаДоходовСделкиДоИзменения	= ТекСтрокаУслуги.СтрокаДоходовСделки;
		
		КонецЦикла; 
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		Организация 			= ДанныеЗаполнения.Организация;
		ПодразделениеОрганизации= ДанныеЗаполнения.ПодразделениеОрганизации;
		ВалютаДокумента 		= ДанныеЗаполнения.ВалютаДокумента;
		КратностьВзаиморасчетов = ДанныеЗаполнения.КратностьВзаиморасчетов;
		КурсВзаиморасчетов 		= ДанныеЗаполнения.КурсВзаиморасчетов;
		Контрагент 				= ДанныеЗаполнения.Контрагент;
		ДоговорКонтрагента 		= ДанныеЗаполнения.ДоговорКонтрагента;
		Грузоотправитель 		= ДанныеЗаполнения.Грузоотправитель;
		Грузополучатель 		= ДанныеЗаполнения.Грузополучатель;
		АдресДоставки 			= ДанныеЗаполнения.АдресДоставки;
		БанковскийСчетОрганизации = ДанныеЗаполнения.БанковскийСчетОрганизации;
		//ДИТ, Беляев СЮ, BUG 57827, 26-04-2023, начало
		ДатаКурса				= ДанныеЗаполнения.ДатаКурса;
		//ДИТ, Беляев СЮ, BUG 57827, 26-04-2023, коенц
		
		ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение;
		ИсправляемыйДокументРеализации = ДанныеЗаполнения.Ссылка;
		ИсходныйДокументРеализации = ДанныеЗаполнения.ИсходныйДокументРеализации;
		ДокументРеализации = ДанныеЗаполнения.Ссылка;
		
		Руководитель = ДанныеЗаполнения.Руководитель;
		ГлавныйБухгалтер = ДанныеЗаполнения.ГлавныйБухгалтер;
		ЗаРуководителяНаОсновании = ДанныеЗаполнения.ЗаРуководителяНаОсновании;
		ЗаГлавногоБухгалтераНаОсновании = ДанныеЗаполнения.ЗаГлавногоБухгалтераНаОсновании;
		
		УчитыватьНДС 		= ДанныеЗаполнения.УчитыватьНДС;
		СуммаВключаетНДС 	= ДанныеЗаполнения.СуммаВключаетНДС;
		СуммаДокумента 		= ДанныеЗаполнения.СуммаДокумента;
		СуммаНДСДокумента 	= ДанныеЗаполнения.Товары.Итог("СуммаНДС") + ДанныеЗаполнения.Услуги.Итог("СуммаНДС");
		
		Ответственный = ДанныеЗаполнения.Ответственный;
		
		Комментарий = ДанныеЗаполнения.Комментарий;
		
		ПоставщикВУ = ДанныеЗаполнения.ПоставщикВУ;
		ПокупательВУ = ДанныеЗаполнения.ПокупательВУ;		
		Сделка 		= ДанныеЗаполнения.Сделка; //ДИТ Шевченко А.В. 58535 22.10.2022
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.КоличествоДоИзменения = ТекСтрокаТовары.Количество;
			НоваяСтрока.КоличествоДоКорректировки = ТекСтрокаТовары.КоличествоДоИзменения;
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.СуммаДоИзменения = ТекСтрокаТовары.Сумма;
			НоваяСтрока.СуммаДоКорректировки = ТекСтрокаТовары.СуммаДоИзменения;
			НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
			НоваяСтрока.СуммаНДСДоИзменения = ТекСтрокаТовары.СуммаНДС;
			НоваяСтрока.СуммаНДСДоКорректировки = ТекСтрокаТовары.СуммаНДСДоИзменения;
			НоваяСтрока.СуммаНДС = ТекСтрокаТовары.СуммаНДС;
			НоваяСтрока.ЦенаДоИзменения = ТекСтрокаТовары.Цена;
			НоваяСтрока.ЦенаДоКорректировки = ТекСтрокаТовары.ЦенаДоИзменения;
			НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
			НоваяСтрока.СтавкаНДСДоИзменения = ТекСтрокаТовары.СтавкаНДС;
			НоваяСтрока.СтавкаНДС = ТекСтрокаТовары.СтавкаНДС;
		КонецЦикла;
		Для Каждого ТекСтрокаУслуги Из ДанныеЗаполнения.Услуги Цикл
			НоваяСтрока = Услуги.Добавить();
			НоваяСтрока.КоличествоДоИзменения = ТекСтрокаУслуги.Количество;
			НоваяСтрока.КоличествоДоКорректировки = ТекСтрокаУслуги.КоличествоДоИзменения;
			НоваяСтрока.Количество = ТекСтрокаУслуги.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаУслуги.Номенклатура;
			НоваяСтрока.СодержаниеДоИзменения = ТекСтрокаУслуги.Содержание;
			НоваяСтрока.Содержание = ТекСтрокаУслуги.Содержание;
			НоваяСтрока.СуммаДоИзменения = ТекСтрокаУслуги.Сумма;
			//Евросиб Каблов 27.08.2025 ( #114890
			//НоваяСтрока.СуммаДоКорректировки = ТекСтрокаУслуги.СуммаДоИзменения;
			НоваяСтрока.СуммаДоКорректировки = ТекСтрокаУслуги.Сумма;
			//Евросиб Каблов 27.08.2025 ) #114890
			НоваяСтрока.Сумма = ТекСтрокаУслуги.Сумма;
			НоваяСтрока.СуммаНДСДоИзменения = ТекСтрокаУслуги.СуммаНДС;
			//Евросиб Каблов 27.08.2025 ( #114890
			//НоваяСтрока.СуммаНДСДоКорректировки = ТекСтрокаУслуги.СуммаНДСДоИзменения;
			НоваяСтрока.СуммаНДСДоКорректировки = ТекСтрокаУслуги.СуммаНДС;
			//Евросиб Каблов 27.08.2025 ) #114890
			НоваяСтрока.СуммаНДС = ТекСтрокаУслуги.СуммаНДС;
			НоваяСтрока.ЦенаДоИзменения = ТекСтрокаУслуги.Цена;
			//Евросиб Каблов 27.08.2025 ( #114890
			//НоваяСтрока.ЦенаДоКорректировки = ТекСтрокаУслуги.ЦенаДоИзменения;
			НоваяСтрока.ЦенаДоКорректировки = ТекСтрокаУслуги.Цена;
			//Евросиб Каблов 27.08.2025 ) #114890
			НоваяСтрока.Цена = ТекСтрокаУслуги.Цена;
			НоваяСтрока.СтавкаНДСДоИзменения = ТекСтрокаУслуги.СтавкаНДС;
			НоваяСтрока.СтавкаНДС = ТекСтрокаУслуги.СтавкаНДС;
			НоваяСтрока.СтрокаДоходовСделки = ТекСтрокаУслуги.СтрокаДоходовСделки;
			//Евросиб Каблов 27.08.2025 ( #114890
			//НоваяСтрока.СтрокаДоходовСделкиДоИзменения = ТекСтрокаУслуги.СтрокаДоходовСделкиДоИзменения;
			НоваяСтрока.СтрокаДоходовСделкиДоИзменения = ТекСтрокаУслуги.СтрокаДоходовСделки;
			//Евросиб Каблов 27.08.2025 ) #114890
			НоваяСтрока.ЕстьВДокументеРеализации = Истина;
			//Евросиб Каблов 07.11.2022 ( 54532
			НоваяСтрока.ВидЗадолженности = ТекСтрокаУслуги.ВидЗадолженности;
			//Евросиб Каблов 07.11.2022 )
			//Евросиб Дубская 17.01.2022 ( Ticket#0256935
			НоваяСтрока.Всего = ?(СуммаВключаетНДС, НоваяСтрока.Сумма, НоваяСтрока.Сумма + НоваяСтрока.СуммаНДС);
			НоваяСтрока.ВсегоДоИзменения = ?(СуммаВключаетНДС, НоваяСтрока.СуммаДоИзменения, НоваяСтрока.СуммаДоИзменения + НоваяСтрока.СуммаНДСДоИзменения);			
			НоваяСтрока.ВсегоДоКорректировки = ?(СуммаВключаетНДС, НоваяСтрока.СуммаДоКорректировки, НоваяСтрока.СуммаДоКорректировки + НоваяСтрока.СуммаНДСДоКорректировки);			
			//Евросиб Дубская 17.01.2022 )
			// Субботин TASK 72390 24.07.2023 Начало
			НоваяСтрока.СуммаБезНалогаДоКорректировки 	= ТекСтрокаУслуги.СуммаБезНалогаДоКорректировки;
			НоваяСтрока.СтавкаНДСРубДоКорректировки 	= ТекСтрокаУслуги.СтавкаНДСРубДоКорректировки;
			НоваяСтрока.СуммаНДСРубДоКорректировки 		= ТекСтрокаУслуги.СуммаНДСРубДоКорректировки;
			НоваяСтрока.ВсегоСНДСДоКорректировки 		= ТекСтрокаУслуги.ВсегоСНДСДоКорректировки;
			НоваяСтрока.СуммаБезНалога 	= ТекСтрокаУслуги.СуммаБезНалога;
			НоваяСтрока.СтавкаНДСРуб 	= ТекСтрокаУслуги.СтавкаНДСРуб;
			НоваяСтрока.СуммаНДСРуб 	= ТекСтрокаУслуги.СуммаНДСРуб;
			НоваяСтрока.ВсегоСНДС 		= ТекСтрокаУслуги.ВсегоСНДС;
			
			// Субботин TASK 72390 24.07.2023  Конец

		КонецЦикла;
		Для Каждого ТекСтрокаУслуги Из ДанныеЗаполнения.АгентскиеУслуги Цикл
			НоваяСтрока = АгентскиеУслуги.Добавить();
			НоваяСтрока.КоличествоДоИзменения = ТекСтрокаУслуги.Количество;
			НоваяСтрока.КоличествоДоКорректировки = ТекСтрокаУслуги.КоличествоДоИзменения;
			НоваяСтрока.Количество = ТекСтрокаУслуги.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаУслуги.Номенклатура;
			НоваяСтрока.СодержаниеДоИзменения = ТекСтрокаУслуги.Содержание;
			НоваяСтрока.Содержание = ТекСтрокаУслуги.Содержание;
			НоваяСтрока.СуммаДоИзменения = ТекСтрокаУслуги.Сумма;
			НоваяСтрока.СуммаДоКорректировки = ТекСтрокаУслуги.СуммаДоИзменения;
			НоваяСтрока.Сумма = ТекСтрокаУслуги.Сумма;
			НоваяСтрока.СуммаНДСДоИзменения = ТекСтрокаУслуги.СуммаНДС;
			НоваяСтрока.СуммаНДСДоКорректировки = ТекСтрокаУслуги.СуммаНДСДоИзменения;
			НоваяСтрока.СуммаНДС = ТекСтрокаУслуги.СуммаНДС;
			НоваяСтрока.ЦенаДоИзменения = ТекСтрокаУслуги.Цена;
			НоваяСтрока.ЦенаДоКорректировки = ТекСтрокаУслуги.ЦенаДоИзменения;
			НоваяСтрока.Цена = ТекСтрокаУслуги.Цена;
			НоваяСтрока.СтавкаНДСДоИзменения = ТекСтрокаУслуги.СтавкаНДС;
			НоваяСтрока.СтавкаНДС = ТекСтрокаУслуги.СтавкаНДС;
			НоваяСтрока.Контрагент = ТекСтрокаУслуги.Контрагент;
			НоваяСтрока.ДоговорКонтрагента = ТекСтрокаУслуги.ДоговорКонтрагента;
			НоваяСтрока.ЕстьВДокументеРеализации = Истина;
		КонецЦикла;
		
		Для каждого ТекСтрокаУслуги Из ДанныеЗаполнения.РасшифровкаУслугПоТС Цикл
		
			НовСтр = РасшифровкаУслугПоТС.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, ТекСтрокаУслуги);
			//Евросиб Каблов 27.08.2025 ( #114890
			НовСтр.ЦенаДоИзменения 					= ТекСтрокаУслуги.Цена;
			НовСтр.СуммаДоИзменения 				= ТекСтрокаУслуги.Сумма;
			НовСтр.СуммаНДСДоИзменения 				= ТекСтрокаУслуги.СуммаНДС;
			НовСтр.СтрокаДоходовСделкиДоИзменения	= ТекСтрокаУслуги.СтрокаДоходовСделки;
			//Евросиб Каблов 27.08.2025 ) #114890
		
		КонецЦикла; 
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		
		ДокументОснованиеПервичногоСФ = ДанныеЗаполнения.ДокументОснование;
		
		Если ТипЗнч(ДокументОснованиеПервичногоСФ) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
			//Корректировка перевыставленного СФ комитента
			Если ЗначениеЗаполнено(ДанныеЗаполнения.Продавец) Тогда
				
				КорректировкаПервичногоПоступления = НайтиКорректировкуОтПоставщика(ДанныеЗаполнения.Ссылка,ДокументОснованиеПервичногоСФ);
				Если КорректировкаПервичногоПоступления = Неопределено Тогда 
					Сообщить("Не найдена корректировка первичного документа от поставщика!");
					Комментарий = "Отказ";
					Возврат;
				Иначе
					ЗаполнитьДокументКорректировкаРеализацииНаОснованииКорректировкиПоступления(ДокументОснованиеПервичногоСФ, ДанныеЗаполнения, КорректировкаПервичногоПоступления);
					ИсходныйДокументРеализации = ДанныеЗаполнения.Ссылка;
				КонецЕсли;	
				
			КонецЕсли;	
			
		КонецЕсли;	
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда //и ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОЗакупках Тогда
		
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0373648, 31-10-2024, начало (закомментировал проверку на наличие СчФНаВознаграждение
		//СчФНаВознаграждение = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(ДанныеЗаполнения,"СчетФактураВыданный");
		//
		//Если СчФНаВознаграждение = Неопределено Тогда
		//	Комментарий = "Отказ";
		//	Сообщить("Не введена счет-фактура на комиссионное вознаграждение! Отсутствует первичный документ для корректировки!");
		//	Возврат;
		//Иначе
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0373648, 31-10-2024, конец
			//Корректировка комиссионного вознаграждения
			Организация 			= Константы.ОсновнаяОрганизация.Получить();
			Организация 			= ДанныеЗаполнения.Организация;
			ПодразделениеОрганизации= ДанныеЗаполнения.ПодразделениеОрганизации;
			ВалютаДокумента 		= Константы.ВалютаРегламентированногоУчета.Получить();
			ВалютаДокумента 		= ДанныеЗаполнения.ВалютаДокумента;
			КратностьВзаиморасчетов = ДанныеЗаполнения.КратностьВзаиморасчетов;
			КурсВзаиморасчетов 		= ДанныеЗаполнения.КурсВзаиморасчетов;
			Контрагент 				= ДанныеЗаполнения.Контрагент;
			ДоговорКонтрагента 		= ДанныеЗаполнения.ДоговорКонтрагента;
			//ДИТ, Беляев СЮ, BUG 57827, 26-04-2023, начало
			ДатаКурса				= ДанныеЗаполнения.ДатаКурса;
			//ДИТ, Беляев СЮ, BUG 57827, 26-04-2023, коенц
			
			КорректировкаОтчетаКомитенту = Истина;
			ВидОперации 			= Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение;
			ИсправляемыйДокументРеализации 	= ДанныеЗаполнения.Ссылка;
			ИсходныйДокументРеализации 		= ДанныеЗаполнения.Ссылка;
			ДокументРеализации 				= ДанныеЗаполнения.Ссылка;
			
			УчитыватьНДС 		= ДанныеЗаполнения.УчитыватьНДС;
			СуммаВключаетНДС 	= ДанныеЗаполнения.СуммаВключаетНДС;
			Ответственный 		= ДанныеЗаполнения.Ответственный;
			
			Автор = Пользователи.ТекущийПользователь();
			Создано = ТекущаяДата();
			
			СвязаннаяКорректировкаПТУ = НайтиКорректировкуНаПТУ(ДанныеЗаполнения);
			
			НовСтр = Услуги.Добавить();
			НовСтр.Номенклатура 		= ДанныеЗаполнения.УслугаПоВознаграждению;
			НовСтр.СодержаниеДоИзменения= "Комиссионное вознаграждение";
			НовСтр.Содержание 			= "Комиссионное вознаграждение";
			НовСтр.КоличествоДоИзменения= 1;
			НовСтр.Количество 			= 1;
			НовСтр.ЕстьВДокументеРеализации = Истина;
			
			Если ДанныеЗаполнения.УчитыватьНДС Тогда
				
				Если ДанныеЗаполнения.СуммаВключаетНДС Тогда
					НовСтр.СуммаДоИзменения 	= ДанныеЗаполнения.СуммаВознаграждения;
					НовСтр.Сумма 				= ДанныеЗаполнения.СуммаВознаграждения;
					НовСтр.СуммаНДСДоИзменения 	= ДанныеЗаполнения.СуммаВознаграждения*БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ДанныеЗаполнения.СтавкаНДСВознаграждения)/(100+БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ДанныеЗаполнения.СтавкаНДСВознаграждения));
					НовСтр.СуммаНДС 			= ДанныеЗаполнения.СуммаВознаграждения*БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ДанныеЗаполнения.СтавкаНДСВознаграждения)/(100+БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ДанныеЗаполнения.СтавкаНДСВознаграждения));
					НовСтр.Цена 				= ДанныеЗаполнения.СуммаВознаграждения;
					НовСтр.ЦенаДоИзменения 		= ДанныеЗаполнения.СуммаВознаграждения;
					НовСтр.СтавкаНДСДоИзменения = ДанныеЗаполнения.СтавкаНДСВознаграждения;
					НовСтр.СтавкаНДС 			= ДанныеЗаполнения.СтавкаНДСВознаграждения;
				Иначе
					СуммаБезНДС = ДанныеЗаполнения.СуммаВознаграждения - ДанныеЗаполнения.СуммаВознаграждения*БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ДанныеЗаполнения.СтавкаНДСВознаграждения)/(100+БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ДанныеЗаполнения.СтавкаНДСВознаграждения));
					НовСтр.ЦенаДоИзменения = СуммаБезНДС;
					НовСтр.Цена = СуммаБезНДС;
					НовСтр.Сумма = СуммаБезНДС;
					НовСтр.СуммаДоИзменения = СуммаБезНДС;
					НовСтр.СуммаНДС = ДанныеЗаполнения.СуммаВознаграждения*БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ДанныеЗаполнения.СтавкаНДСВознаграждения)/(100+БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ДанныеЗаполнения.СтавкаНДСВознаграждения));
					НовСтр.СуммаНДСДоИзменения = ДанныеЗаполнения.СуммаВознаграждения*БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ДанныеЗаполнения.СтавкаНДСВознаграждения)/(100+БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ДанныеЗаполнения.СтавкаНДСВознаграждения));
					НовСтр.СтавкаНДСДоИзменения =  ДанныеЗаполнения.СтавкаНДСВознаграждения;
					НовСтр.СтавкаНДС = ДанныеЗаполнения.СтавкаНДСВознаграждения;
				КонецЕсли;
				
			Иначе
				НовСтр.Цена = ДанныеЗаполнения.СуммаВознаграждения;
				НовСтр.ЦенаДоИзменения = ДанныеЗаполнения.СуммаВознаграждения;
				НовСтр.СуммаДоИзменения = ДанныеЗаполнения.СуммаВознаграждения;
				НовСтр.Сумма = ДанныеЗаполнения.СуммаВознаграждения;
			КонецЕсли;
			ВалютаРегУчета = Константы.ВалютаРегламентированногоУчета.Получить();
			// Субботин TASK 72390 24.07.2023 Начало
           	НовСтр.СуммаБезНалогаДоКорректировки 	= Валюта_сервер.ПересчитатьПоКурсу(НовСтр.СуммаДоИзменения, ВалютаДокумента, ВалютаРегУчета, ДатаКурса);
			НовСтр.СтавкаНДСРубДоКорректировки 		= ДанныеЗаполнения.СтавкаНДСВознаграждения; 
			НовСтр.СуммаНДСРубДоКорректировки 		= Валюта_сервер.ПересчитатьПоКурсу(НовСтр.СуммаНДСДоИзменения, ВалютаДокумента, ВалютаРегУчета, ДатаКурса);
			НовСтр.ВсегоСНДСДоКорректировки 		= Валюта_сервер.ПересчитатьПоКурсу(НовСтр.СуммаДоИзменения + НовСтр.СуммаНДСДоИзменения, ВалютаДокумента, ВалютаРегУчета, ДатаКурса);
			
			НовСтр.СуммаБезНалога 	= Валюта_сервер.ПересчитатьПоКурсу(НовСтр.Сумма, ВалютаДокумента, ВалютаРегУчета, ДатаКурса);
			НовСтр.СтавкаНДСРуб 	= ДанныеЗаполнения.СтавкаНДСВознаграждения;
			НовСтр.СуммаНДСРуб 		= Валюта_сервер.ПересчитатьПоКурсу(НовСтр.СуммаНДС, ВалютаДокумента, ВалютаРегУчета, ДатаКурса);
			НовСтр.ВсегоСНДС 		= Валюта_сервер.ПересчитатьПоКурсу(НовСтр.Сумма + НовСтр.СуммаНДС, ВалютаДокумента, ВалютаРегУчета, ДатаКурса);
            // Субботин TASK 72390 24.07.2023 Конец
           		
			Для каждого ТекСтрокаУслуги Из ДанныеЗаполнения.РасшифровкаУслугПоТС Цикл
				
				НовСтр = РасшифровкаУслугПоТС.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, ТекСтрокаУслуги);
				НовСтр.ЦенаДоИзменения 					= ТекСтрокаУслуги.Цена;
				НовСтр.СуммаДоИзменения 				= ТекСтрокаУслуги.Сумма;
				НовСтр.СтавкаНДСДоИзменения 			= ТекСтрокаУслуги.СтавкаНДС;
				НовСтр.СуммаНДСДоИзменения 				= ТекСтрокаУслуги.СуммаНДС;
				НовСтр.СтрокаДоходовСделкиДоИзменения	= ТекСтрокаУслуги.СтрокаДоходовСделки;
				
			КонецЦикла; 
			
		//КонецЕсли;
		
	КонецЕсли;
	
	//Евросиб Каблов 02.04.2021 (
	Если Контрагент.СтранаРегистрации <> Справочники.СтраныМира.Россия Тогда
		ДатаДокумента = КонецМесяца(ПериодВО);
	КонецЕсли;
	//Евросиб Каблов 02.04.2021 ) 
	
	//РезультатВалюта = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента,ТекущаяДата());
	//ДИТ, Беляев СЮ, BUG 57827, 26-04-2023, начало
	ДатаКурса = ?(ЗначениеЗаполнено(ДатаКурса), ДатаКурса, ТекущаяДата());
	РезультатВалюта = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, ДатаКурса);
	//ДИТ, Беляев СЮ, BUG 57827, 26-04-2023, конец
	КратностьВзаиморасчетов = РезультатВалюта.Кратность;
	КурсВзаиморасчетов = РезультатВалюта.Курс;
//	УчитыватьНДС = Организация.УчитыватьНДСВДокументах;

КонецПроцедуры

Функция НайтиКорректировкуНаПТУ(ОтчетКомитенту)

	Док = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОтчетКомитентуОПродажахПоставщики.Ссылка КАК Ссылка,
	               |	ОтчетКомитентуОПродажахПоставщики.Партия КАК Партия
	               |ПОМЕСТИТЬ ВсеПартии
	               |ИЗ
	               |	Документ.ОтчетКомитентуОПродажах.Поставщики КАК ОтчетКомитентуОПродажахПоставщики
	               |ГДЕ
	               |	ОтчетКомитентуОПродажахПоставщики.Ссылка = &ОтчетКомитенту
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОтчетКомитентуОПродажахПоставщики.Ссылка,
	               |	ОтчетКомитентуОПродажахПоставщики.Партия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВсеПартии.Ссылка КАК Ссылка,
	               |	ВсеПартии.Партия КАК ПТУ,
	               |	КорректировкаПоступления.Ссылка КАК ДокКоррПТУ,
	               |	КорректировкаПоступления.ДатаИсправленияИсходногоДокумента КАК ДатаИсправленияИсходногоДокумента,
	               |	КорректировкаПоступления.Дата КАК Дата
	               |ИЗ
	               |	ВсеПартии КАК ВсеПартии
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления КАК КорректировкаПоступления
	               |		ПО ВсеПартии.Партия = КорректировкаПоступления.ДокументПоступления
	               |			И (НЕ КорректировкаПоступления.ПометкаУдаления)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаИсправленияИсходногоДокумента УБЫВ";
	
	Запрос.УстановитьПараметр("ОтчетКомитенту", ОтчетКомитенту);
	//Запрос.Выполнить().Выгрузить(); // Запрос.ВыполнитьПакетСПромежуточнымиДанными()[0].Выгрузить();
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		Док = Выборка.ДокКоррПТУ; 
	
	КонецЕсли;  
	
	Возврат Док;

КонецФункции // НайтиКорректировкуНаПТУ()

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	//	НомерСчФ = НайтиСтаршийНомерСчетФактуры();
	//
	//Если НомерСчФ = "" Тогда
	//	Возврат;
	//Иначе
	//	СтандартнаяОбработка = Ложь;
	//	Попытка
	//		ЧислоНомера = Число(НомерСчФ);
	//		СледНомер  = ЧислоНомера + 1;
	//		Номер = ПреобразоватьНомерВСтроку(Формат(СледНомер,"ЧГ="));
	//	//СформироватьНомерДляПечати
	////	НомерДляПечати = Номер+"/"+?(СчетНаОплатуПокупателю.Номер<>"",СчетНаОплатуПокупателю.Номер+"/","")+?(Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия,"Р","Н");

	//	Исключение
	//		Ош = ОписаниеОшибки();
	//		Сообщить("Произошла ошибка при установке нового номера, так как некорректный номер счета-фактуры выданного. Проверьте номера счетов-фактур за текущий год, системный номер счет-фактуры должен состоять только из цифр!");
	//	КонецПопытки;
	//КонецЕсли;	

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Маршрутизировать = Константы.МаршрутизироватьКорректировкуРеализации.Получить();
	Редактор = неопределено;
	Изменено = неопределено;
	Состояния.Очистить();
	ПериодВО = '00010101';
	
	//Евросиб Каблов 22.07.2020 ( TASK 23506
	Выставлен = Ложь;
	ДатаВыставления = '00010101';
	//Евросиб Каблов 11.07.2020 ) TASK 23506
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда	
		Возврат;	
	КонецЕсли;
	//Евросиб Шевченко А.В. US 112687 TA 126873 26.12.2025
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения ИЛИ (ПометкаУдаления И (ПометкаУдаления <> Ссылка.ПометкаУдаления)) Тогда
		Если СчетаНаОплатуПокупателям.Количество() <> 0 Тогда 
			ОбщегоНазначения.СообщитьПользователю("Для отмены проведения/пометки на удаление удалите счет на вкладке ""Счета покупателям"" отчета комитенту",,,,Отказ);
		КонецЕсли;	
	КонецЕсли;
	//Евросиб Шевченко А.В. US 112687 TA 126873 26.12.2025
	//Евросиб Каблов 14.05.2021 ( Ticket#0230505
	////Евросиб Каблов 09.04.2021 ( Ticket#0228336
	//РеализацияСуммаВключаетНДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументРеализации, "СуммаВключаетНДС");
	////Евросиб Каблов 09.04.2021 )
	//Евросиб Каблов 14.05.2021 ( Ticket#0230505
	
	// SIV 13-04-21 Подсчет суммы документа для Аннулирования должен вестись не как "После изменения" (там всегда ноль), а как "до изменения"
	// в соответствии с комментариями Юлии Болотиной.
	
	Если ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование Тогда
		СуммаДокумента = Услуги.Итог("СуммаДоИзменения");
		СуммаНДСДокумента = Услуги.Итог("СуммаНДСДоИзменения");
	Иначе
		СуммаДокумента = Услуги.Итог("Сумма");
		СуммаНДСДокумента = Услуги.Итог("СуммаНДС");
	КонецЕсли;
	
	СуммаДокумента = СуммаДокумента + ?(СуммаВключаетНДС, 0, СуммаНДСДокумента);

	//ИтогоНДС = ?(Объект.Товары.Количество()>0, Объект.Товары.Итог("СуммаНДС"),0)+?(Объект.Услуги.Количество()>0,Объект.Услуги.Итог("СуммаНДС"),0)+?(Объект.АгентскиеУслуги.Количество()>0,Объект.АгентскиеУслуги.Итог("СуммаНДС"),0);
	//ИтогоВсего = ?(Объект.Товары.Количество()>0, Объект.Товары.Итог("Сумма"),0)+ ?(Объект.Услуги.Количество()>0,Объект.Услуги.Итог("Сумма"),0)+ ?(Объект.АгентскиеУслуги.Количество()>0,Объект.АгентскиеУслуги.Итог("Сумма"),0)+?(Объект.СуммаВключаетНДС,0,ИтогоНДС);
	
	//Евросиб Каблов 14.05.2021 ( Ticket#0230505
	////Евросиб Каблов 20.02.2021 ( Ticket#0224071
	//Для Каждого СтрТЧ из Услуги Цикл
	//	//Евросиб Каблов 09.04.2021 ( Ticket#0228336
	//	//СтрТЧ.ВсегоДоКорректировки = СтрТЧ.СуммаДоКорректировки + ?(СуммаВключаетНДС,0,СтрТЧ.СуммаНДСДоКорректировки);
	//	//СтрТЧ.ВсегоДоИзменения = СтрТЧ.СуммаДоИзменения + ?(СуммаВключаетНДС,0,СтрТЧ.СуммаНДСДоИзменения);
	//	СтрТЧ.ВсегоДоКорректировки = СтрТЧ.СуммаДоКорректировки + ?(РеализацияСуммаВключаетНДС,0,СтрТЧ.СуммаНДСДоКорректировки);
	//	СтрТЧ.ВсегоДоИзменения = СтрТЧ.СуммаДоИзменения + ?(РеализацияСуммаВключаетНДС,0,СтрТЧ.СуммаНДСДоИзменения);
	//	//Евросиб Каблов 09.04.2021 )
	//КонецЦикла;
	////Евросиб Каблов 20.02.2021 )
	//Евросиб Каблов 14.05.2021 )
	
	
	
	// SIV 09-03-21 + Довычисляем суммы после изменения
	
	Для каждого Стр из РасшифровкаУслугПоТС Цикл
		
		Если ЗначениеЗаполнено(Стр.Цена) Тогда Продолжить; КонецЕсли;
		
		Для каждого Стр2 из Услуги Цикл
			
			Если Стр.СтрокаДоходовСделкиДоИзменения = Стр2.СтрокаДоходовСделкиДоИзменения Тогда
				Стр.Цена = Стр2.Цена;
				Стр.СуммаНДС = Стр2.СуммаНДС;
				Стр.Сумма = Стр2.Цена;
				Стр.СтрокаДоходовСделки = Стр2.СтрокаДоходовСделки;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// SIV 09-03-21 - Довычисляем суммы после изменения
	
	Если Не БезДоверенностей Тогда
//Евросиб Гудкова( 15.02.2021 Ticket№ 0223421
//		СтруктураПодписантовПоДоверенности = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиДействующиеДоверенностиНаПодпись(Дата, "КорректировкаРеализации", ЦФО);
		СтруктураПодписантовПоДоверенности = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиДействующиеДоверенностиНаПодпись(ДатаДокумента, "Корректировка Реализации", ЦФО);
// Евросиб Гудкова) 		
		ДоверенностьЗаРуководителя = СтруктураПодписантовПоДоверенности.ДоверенностьЗаРуководителя;
		ДоверенностьЗаГлБухгалтера = СтруктураПодписантовПоДоверенности.ДоверенностьЗаГБ;
	КонецЕсли;
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	Если Не ЗначениеЗаполнено(Номер)  Тогда
		УстановитьНовыйНомер();
	КонецЕсли;
	//Если НЕ ЗапрещаюОбновлятьНомерДляПечати Тогда
	//	НомерДляПечати = Номер + ?(Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия,"/Р","/Н");
	//КонецЕсли
	//Евросиб Шевченко А.В. US 112687 TA 126873 26.12.2025
	Для Каждого СтрокаСчета Из СчетаНаОплатуПокупателям Цикл
		СтрокаСчета.НомерДляПечати = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаСчета.СчетПокупателю,"НомерДляПечати");	
	КонецЦикла;	
	//Евросиб Шевченко А.В. US 112687 TA 126873 26.12.2025
	// + Состояния
	
	// проверяем корректность перечня состояний в ТЧ Состояния
	Для Сч = 0 По Состояния.Количество() - 2 Цикл
		ТекСостояние = Состояния[Сч].Состояние;
		Для ТекСч = Сч + 1 По Состояния.Количество() - 1 Цикл
			Если Состояния[ТекСч].Состояние = ТекСостояние Тогда
				Сообщить("Ошибка: одно состояние может встречаться в документе только один раз!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
		
	// для состояний отражаем логику движения статусов
	//Для Сч = 0 По Состояния.Количество() - 2 Цикл
	//	Если Состояния[Сч].Статус = Перечисления.СтатусыЭтапов.Выполнен И Состояния[Сч+1].Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//		Состояния[Сч+1].Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//		Если НЕ ЗначениеЗаполнено(Состояния[Сч+1].Исполнитель) Тогда
	//			Состояния[Сч+1].Исполнитель = Пользователи.ТекущийПользователь();
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	
	//++ Зубов 35844 05.08.2021
	////Стаценко Параллельное согласование
	//Для каждого СтрТЧ из Состояния Цикл
	//	Если Не ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//		СтрТЧ.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//        ПредыдущиеЭтапы = СтрТЧ.ПредыдущиеЭтапы;
	//		Попытка
	//			МассивЭтапов = СтрРазделить(ПредыдущиеЭтапы,",",Ложь);
	//		Исключение
	//			Сообщить("Некорректная строка предыдущих этапов");
	//		КонецПопытки;
	//		ВозможноВыполнение = Истина;
	//		Если МассивЭтапов.Количество() > 0 Тогда
	//			Для каждого Эл из МассивЭтапов Цикл
	//				Попытка
	//					НомСтр = Число(Эл);
	//					СтрЭтапа = Состояния.Найти(НомСтр,"НомерСтроки");
	//					Если СтрЭтапа <> Неопределено Тогда
	//						Если СтрЭтапа.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//							ВозможноВыполнение = Ложь;
	//						КонецЕсли;
	//					КонецЕсли;
	//				Исключение
	//					Сообщить("Некорректное указание этапа состояние. Возможен только ввод цифр.");
	//				КонецПопытки
	//			КонецЦикла;
	//		КонецЕсли;
	//		Если ВозможноВыполнение Тогда
	//			СтрТЧ.Статус =  Перечисления.СтатусыЭтапов.НаВыполнение;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	////Стаценко
	//МаршрутизацияСервер.ПараллельноеСогласование(Состояния); //ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, закомментировал (перенёс ниже)
	//-- Зубов 35844 05.08.2021
	
	// Маршрутизация заказа
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = 
	НЕ ЗначениеЗаполнено(Ссылка) ИЛИ 
	Ссылка.Организация <> Организация ИЛИ 
	Ссылка.Контрагент <> Контрагент ИЛИ
	Ссылка.ДоговорКонтрагента <> ДоговорКонтрагента ИЛИ состояния.Количество() = 0;
	
	//++ Зубов 36879 12.08.2021
	Если ЗначениеЗаполнено(Ссылка) И ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,"ДатаДокумента").ДатаДокумента<>ДатаДокумента Тогда
		ДатаДокументаИзменена = Истина;
		ДляДанногоОбъектаТребуетсяПеремаршрутизация = Истина;
	Иначе
		ДатаДокументаИзменена = Ложь;
	КонецЕсли;
	//-- Зубов 36879 12.08.2021
	Если Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Контрагент);
		ПараметрыЗапроса.Вставить("Договор", ДоговорКонтрагента);
//Евросиб Гудкова( 12.09.2020 Ticket№ 0206196
		ПараметрыЗапроса.Вставить("ЭДО", Обработки.ДД_подключаемыйМодуль.ЕстьЭДОСКонтрагентом(Контрагент));
		ПараметрыЗапроса.Вставить("ЦФО", ЦФО);
// Евросиб Гудкова)
//Евросиб Максимова
        ПараметрыЗапроса.Вставить("ОплатаОригинал",ДоговорКонтрагента.ОплатаПоОригиналу);
//Евросиб Максимова
		//++ Зубов 36879 12.08.2021
		ПараметрыЗапроса.Вставить("ДатаДокументаИзменена",ДатаДокументаИзменена);
		//-- Зубов 36879 12.08.2021
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьРТУ(ПараметрыЗапроса, Дата);//Гудкова 0206196 МаршрутизироватьКорректировкуРеализации(ПараметрыЗапроса, Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			УказанныеВручнуюИспНаблюдатель = Новый СписокЗначений;
			Если ДополнительныеСвойства.Свойство("ДопСвойстваОбъекта") тогда
				УказанныеВручнуюИспНаблюдатель = ДополнительныеСвойства.ДопСвойстваОбъекта;
			КонецЕсли;
			МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъект, РезультатЗапроса, Автор, УказанныеВручнуюИспНаблюдатель);			
		КонецЕсли;
	КонецЕсли;
	
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, начало
	МаршрутизацияСервер.ПараллельноеСогласование(Состояния);
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, конец
	
	МаршрутизацияСервер.ПостобработкаТЧСостояний(ЭтотОбъект, Автор);
	
	// если исполнитель пустой, то проставляем тек пользователя
	Для каждого Стр из Состояния Цикл
		Если Стр.ПримечаниеЗадачаИсполнителю Тогда
			// если текст примечания изменился, то создать новое сообщение. если остался прежним, то не менять
			// т.к. состояние уникально, ищем по нему
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Состояние",Стр.Состояние);
			НайденнаяСтр = Ссылка.Состояния.НайтиСтроки(ПараметрыОтбора);
			Если НайденнаяСтр.Количество()>0 Тогда
				Если НЕ НайденнаяСтр[0].Комментарий = Стр.Комментарий Тогда
										
					// +Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					ДатаСообщения = ТекущаяДата();
					АвторСообщения = Пользователи.ТекущийПользователь();
					ТекстСообщения = Стр.Комментарий;
					ГУИДСообщения = Новый УникальныйИдентификатор();
					
					ГУИДТемы = Новый УникальныйИдентификатор;
					
					РассылкаПоЛичнымЦелям.СформироватьЛичноеСообщение(ГУИДТемы, , Ссылка, ДатаСообщения, АвторСообщения, ТекстСообщения, , ГУИДСообщения, Стр.Исполнитель);
					// -Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// определяем текущее состояние. для нас это первое состояние не в "выполнено"
	//Для каждого Состояние из Состояния Цикл
	//	Если Состояние.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//		ТекущееСостояние = Состояние.Состояние;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
		
	// - Состояния
	
	// SIV + 15-03-21 Информирование об аннулировании документов
	
	Если ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование И НЕ ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована И НЕ АвторИсходногоДокументаПроинформирован Тогда
		
		// первичная проверка на то, что мы вообще можем что-то отправить
		УчетнаяЗаписьПоУмолчанию = РаботаСПочтовымиСообщениями.ПроверитьСистемнаяУчетнаяЗаписьДоступна();
		
		Если УчетнаяЗаписьПоУмолчанию Тогда 
			
			АдресДублированияУведомлений = Константы.АдресДублированияОповещенийОЗадачах.Получить();
			СистемнаяУчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
			
			Тема = "DATACore: Аннулирован документ " + ИсходныйДокументРеализации;
			//++ Зубов, Ticket#0235758, 29.06.2021
			//ТекстСообщения = "Информируем об аннулировании документа " + ИсходныйДокументРеализации + " пользователем " + Пользователи.ТекущийПользователь() + " в " + Создано;
			ТекстСообщения = "Информируем об аннулировании документа " + ИсходныйДокументРеализации + ", для контрагента "+Контрагент+" по договору №"+ДоговорКонтрагента.Номер + " пользователем " + Пользователи.ТекущийПользователь() + " в " + Создано;
			//-- Зубов, Ticket#0235758, 29.06.2021
			ПолучателиПисьма = Новый Массив;
			
			ПараметрыОтправкиПисьма = новый Структура;
			ПараметрыОтправкиПисьма.Вставить("ТипТекста", "HTML");
			
			Если ЗначениеЗаполнено(АдресДублированияУведомлений) Тогда
				Для каждого Адрес из СтрРазделить(АдресДублированияУведомлений, ";", Ложь) Цикл
					ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", "Адрес отслеживания", Адрес));
				КонецЦикла;
			КонецЕсли;
			
			//ДИТ Шевченко А.В. Bug 102505 TA 102509 11.02.2025
			АвторДляПолученияАдреса = ИсходныйДокументРеализации.Автор;
			
			Если ЗначениеЗаполнено(ИсходныйДокументРеализации.Автор) Тогда
				Если ИсходныйДокументРеализации.Автор.Недействителен Тогда
					АвторДляПолученияАдреса = ПолучитьНепосредственногоРуководителя(ИсходныйДокументРеализации.Автор);
				КонецЕсли;	
			КонецЕсли;	
			//ДИТ Шевченко А.В. Bug 102505 TA 102509 11.02.2025
			
			//EMAIL = Пользователи_sd_сервер.ПолучитьEMAILПользователя(Пользователи_sd_сервер.ПодобратьЗамещение(ИсходныйДокументРеализации.Автор, ТекущаяДата())); //ДИТ Шевченко А.В. Bug 102505 TA 102509 11.02.2025
			EMAIL = Пользователи_sd_сервер.ПолучитьEMAILПользователя(Пользователи_sd_сервер.ПодобратьЗамещение(АвторДляПолученияАдреса, ТекущаяДата()));
			Если ЗначениеЗаполнено(EMAIL) Тогда
				ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", Строка(ИсходныйДокументРеализации.Автор), EMAIL));
			КонецЕсли;
			
			ПараметрыОтправкиПисьма.Вставить("Тема", Тема);
			ПараметрыОтправкиПисьма.Вставить("Тело", ТекстСообщения);
			
			ПараметрыОтправкиПисьма.Вставить("Кому", ПолучателиПисьма);
			
			РЕЗУЛЬТАТ = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(СистемнаяУчетнаяЗапись, ПараметрыОтправкиПисьма);
			
			Если РЕЗУЛЬТАТ <> неопределено Тогда
				АвторИсходногоДокументаПроинформирован = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// SIV - 15-03-21 Информирование об аннулировании документов
	
	// Евросиб Фролов (15.03.2022 Task №40571
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		РаботаСТабличнымиЧастями.ПроверитьКоличествоВТабличнойЧасти(Услуги, "Услуги", Отказ,, ЭтотОбъект);
	КонецЕсли;	
	// Евросиб Фролов)
КонецПроцедуры

Функция ПолучитьНепосредственногоРуководителя(Автор) //ДИТ Шевченко А.В. Bug 102505 TA 102509 11.02.2025
	
	Результат = Автор.НепосредственныйРуководитель;
	
	Если ЗначениеЗаполнено(Автор.НепосредственныйРуководитель) Тогда
		Если Автор.НепосредственныйРуководитель.Недействителен Тогда
			Результат = ПолучитьНепосредственногоРуководителя(Автор.НепосредственныйРуководитель); 
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда	
		Возврат;	
	КонецЕсли;
	
	//Евросиб Каблов 28.07.2020 ( При установке признака Выставлен, не нужно записывать Счет-фактуру
	ЗапретитьЗаписыватьСчетФактуру = Неопределено;
	Если Не ДополнительныеСвойства.Свойство("ЗапретитьЗаписыватьСчетФактуру", ЗапретитьЗаписыватьСчетФактуру) Тогда
		ЗапретитьЗаписыватьСчетФактуру = Ложь;
	КонецЕсли;
	
	Если Не ЗапретитьЗаписыватьСчетФактуру Тогда
	//Евросиб Каблов 28.07.2020 )
		Счетфактура = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(ЭтотОбъект.Ссылка,"СчетФактураВыданный");
		Если СчетФактура<>Неопределено Тогда
			ОбСчФ = СчетФактура.ПолучитьОбъект();
			//Евросиб Каблов 28.07.2020 ( 
			Если ОбСчф.Выставлен Тогда
				СнятьПризнакВыставленУСчетаФактуры = Неопределено;
				Если ДополнительныеСвойства.Свойство("СнятьПризнакВыставленУСчетаФактуры", СнятьПризнакВыставленУСчетаФактуры) И СнятьПризнакВыставленУСчетаФактуры Тогда
					ОбСчф.Выставлен = Ложь;
					ОбСчф.ДатаВыставления = '00010101';
				КонецЕсли;
			КонецЕсли;
			//Евросиб Каблов 28.07.2020 )
			БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьРеквизитыСчФПоОснованию(ЭтотОбъект.Ссылка,ОбСчФ);
			ОбСчФ.Записать();
		КонецЕсли;
	//Евросиб Каблов 28.07.2020 (
	КонецЕсли;
	//Евросиб Каблов 28.07.2020 )
	
	КорректировкиРТУСервер.УстановитьРазрешениеВводаКорректировок(ИсходныйДокументРеализации, Ложь, Ложь, Ложь);   
	
	// ДИТ US 57674 ТА 79279 Сержантова А.С. Начало: 27.03.2024
	Если не Отказ и Проведен и ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование Тогда
		МаршрутизацияСервер.СформироватьЗадачуУдаленияСчета(ДокументРеализации);
	КонецЕсли;
	// ДИТ US 57674 ТА 79279 Сержантова А.С. Конец: 27.03.2024
	
	
	//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, начало
	ВидЗадолженностиРеализации = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьВидЗадолженностиПоДокументу(ИсходныйДокументРеализации);
	РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьВидЗадолженностиПоДокументу(ЭтотОбъект.Ссылка, ВидЗадолженностиРеализации);
	//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, конец
	
	//ДИТ Шевченко А.В. 17.01.2024 US 91366 TA 93137 -начало
	Если ДополнительныеСвойства.Свойство("ТранзитДляКлиента") Тогда
		РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьТранзитДляКлиентапоДокументу(Ссылка, ДополнительныеСвойства.ТранзитДляКлиента);
	КонецЕсли;
	//ДИТ Шевченко А.В. 17.01.2024 US 91366 TA 93137 -конец
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Евросиб Каблов 18.11.2021 ( Task 41795
	Если ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование Тогда
		Документы.Акцепт.ПерезаполнитьВАкцептеДанныеПоУчДокументу(ДокументРеализации);
	КонецЕсли;
	//Евросиб Каблов 18.11.2021 )

	//Евросиб Каблов 18.03.2021 (
	////Евросиб Каблов М.Б. 19.11.2019 (
	//ПараметрыКурсаРегл = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Константы.ВалютаРегламентированногоУчета.Получить(), ТекущаяДата());
	//ПараметрыКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
	////Евросиб Каблов М.Б. 19.11.2019 )
	
	//Евросиб - АСуслов 22.10.2022 11:27:11 #
	//(
	// регистр ВзаиморасчетыСПокупателями Расход
	ВзаиморасчетыСервер.КорректировкаРеализации_СформироватьДвиженияВзаиморасчетыСПокупателями(ЭтотОбъект);
	
	//ВзаиморасчетыСПокупателями = Движения.ВзаиморасчетыСПокупателями;
	//ВзаиморасчетыСПокупателями.Записать();
	//ВзаиморасчетыСПокупателями.Записывать = Истина;

	//// регистр ВзаиморасчетыСПокупателями Расход
	//
	//ДатаКурсаВалют = ДатаДокумента;
	//ПараметрыКурсаРегл = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Константы.ВалютаРегламентированногоУчета.Получить(), ДатаКурсаВалют);
	//ПараметрыКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, ДатаКурсаВалют);
	////Евросиб Каблов 18.03.2021 )
	////Евросиб Каблов 09.04.2021 ( Ticket#0228336
	//РеализацияСуммаВключаетНДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументРеализации, "СуммаВключаетНДС");
	////Евросиб Каблов 09.04.2021 )

	////Евросиб Каблов 24.03.2021 ( Ticket#0225744
	//ПериодВзаиморасчетов = Макс(ДатаДокумента, ПериодВО);
	////Евросиб Каблов 24.03.2021 )

	//Движение = ВзаиморасчетыСПокупателями.Добавить();
	//Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
	//Движение.Период = ПериодВзаиморасчетов;
	//Движение.Организация 	= Организация;
	//Движение.Контрагент 	= Контрагент;
	//Движение.Договор 		= ДоговорКонтрагента;
	//Движение.ВалютаРасчетов = ВалютаДокумента;
	//Движение.ДатаРасчетов 	= ДатаДокумента; // Шейко О.Е. Должно действовать с даты документа
	//Движение.ДокументВзаиморасчетов = ИсходныйДокументРеализации;
	//
	//// Евросиб Фролов (12.01.2022 Task№ 45208
	//ЭтоВР = Ложь;
	//Если ТипЗнч(ИсходныйДокументРеализации) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
	//	// Для отчета комитенту измерение ЭтоВР в регистре заполняем по первой строке.
	//	// Если в ней номенклатура указана не "Вознаграждение", то это ВР.
	//	Если Услуги.Количество() > 0 Тогда
	//		Номенклатура = Услуги[0].Номенклатура;
	//		ЭтоВР = Номенклатура <> Справочники.Номенклатура.Вознаграждение;			
	//	КонецЕсли;
	//КонецЕсли;	
	//Движение.ЭтоВР = ЭтоВР;
	//// Евросиб Фролов)
	//
	////ДИТ Шевченко А.В. 58535 20.10.2022 -начало 
	////Товары = Товары;
	//ДокументРеализации = ДокументРеализации;
	//ВидОперации = ВидОперации;
	//Если ТипЗнч(ДокументРеализации) = Тип("ДокументСсылка.КорректировкаРеализации")
	//	И ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРеализации, "ВидОперации").ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение
	//	И ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование Тогда
	//	Движение.СуммаНДС 		= ((Товары.Итог("СуммаНДСДоИзменения")+Услуги.Итог("СуммаНДСДоИзменения")) - (Товары.Итог("СуммаНДСДоКорректировки")+Услуги.Итог("СуммаНДСДоКорректировки")));
	//	//Движение.СуммаБезНДС 	= (((Товары.Итог("СуммаДоИзменения")-Товары.Итог("СуммаНДСДоИзменения"))+Услуги.Итог("ВсегоДоИзменения")-(Услуги.Итог("СуммаНДСДоИзменения"))) - ((Товары.Итог("СуммаДоКорректировки")-Товары.Итог("СуммаНДСДоКорректировки"))+(Услуги.Итог("ВсегоДоКорректировки")-Услуги.Итог("СуммаНДСДоКорректировки"))));
	//	Движение.СуммаБезНДС 	= (Товары.Итог("СуммаДоИзменения")-Товары.Итог("Сумма") + ((Услуги.Итог("ВсегоДоИзменения")- Услуги.Итог("ВсегоДоКорректировки")) + (Услуги.Итог("СуммаНДСДоКорректировки")-Услуги.Итог("СуммаНДСДоИзменения"))));
	//	Движение.СуммаСНДС 		= ((Товары.Итог("СуммаДоИзменения")+Услуги.Итог("ВсегоДоИзменения")) - (Товары.Итог("СуммаДоКорректировки")+Услуги.Итог("ВсегоДоКорректировки")));
	//ИначеЕсли ТипЗнч(ДокументРеализации) = Тип("ДокументСсылка.КорректировкаРеализации")
	//	И ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРеализации, "ВидОперации").ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки
	//	И ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование Тогда
	//	Движение.СуммаНДС 		= -(Товары.Итог("СуммаНДСДоКорректировки")+Услуги.Итог("СуммаНДСДоКорректировки"));
	//	Движение.СуммаБезНДС 	= -((Товары.Итог("СуммаДоКорректировки")-Товары.Итог("СуммаНДСДоКорректировки"))+(Услуги.Итог("ВсегоДоКорректировки")-Услуги.Итог("СуммаНДСДоКорректировки")));
	//	Движение.СуммаСНДС 		= -(Товары.Итог("СуммаДоКорректировки")+Услуги.Итог("ВсегоДоКорректировки"));	
	//ИначеЕсли ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Тогда		
	//	Движение.СуммаНДС 		= -(Товары.Итог("СуммаНДСДоИзменения")+Услуги.Итог("СуммаНДСДоИзменения"));
	//	Движение.СуммаБезНДС 	= -(Товары.Итог("СуммаДоИзменения")-Товары.Итог("СуммаНДСДоИзменения") + Услуги.Итог("ВсегоДоИзменения")-Услуги.Итог("СуммаНДСДоИзменения"));
	//	Движение.СуммаСНДС 		= -(Товары.Итог("СуммаДоИзменения") + Услуги.Итог("ВсегоДоИзменения"));
	//ИначеЕсли ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
	//	Движение.СуммаНДС 		= -(Товары.Итог("СуммаНДСДоИзменения")-Товары.Итог("СуммаНДС")+Услуги.Итог("СуммаНДСДоИзменения")-Услуги.Итог("СуммаНДС"));
	//	Движение.СуммаБезНДС 	= - (Товары.Итог("СуммаДоИзменения")-Товары.Итог("Сумма") + ((Услуги.Итог("ВсегоДоИзменения")- Услуги.Итог("Всего")) + (Услуги.Итог("СуммаНДС")-Услуги.Итог("СуммаНДСДоИзменения"))));
	//	Движение.СуммаСНДС 		= -(Товары.Итог("СуммаДоИзменения")-Товары.Итог("Сумма") + Услуги.Итог("ВсегоДоИзменения")- Услуги.Итог("Всего"));
	//Иначе
	//	Движение.СуммаНДС 		= -(Товары.Итог("СуммаНДСДоИзменения")+Услуги.Итог("СуммаНДСДоИзменения"));
	//	Если СуммаВключаетНДС Тогда
	//		Движение.СуммаБезНДС 	= -((Товары.Итог("СуммаДоИзменения")-Товары.Итог("СуммаНДСДоИзменения")) + (Услуги.Итог("СуммаДоИзменения")-Услуги.Итог("СуммаНДСДоИзменения")));
	//	Иначе
	//		Движение.СуммаБезНДС 	= -(Товары.Итог("СуммаДоИзменения") + Услуги.Итог("СуммаДоИзменения"));
	//	КонецЕсли;
	//	Движение.СуммаСНДС 		= -(Товары.Итог("СуммаДоИзменения") + Услуги.Итог("ВсегоДоИзменения"));
	//КонецЕсли;
	//	
	//Если Не ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование И НЕ ВидОперации=Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
	//	Движение = ВзаиморасчетыСПокупателями.Добавить();
	//	Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
	//	Движение.Период = ПериодВзаиморасчетов;
	//	Движение.Организация	= Организация;
	//	Движение.Контрагент 	= Контрагент;
	//	Движение.Договор 		= ДоговорКонтрагента;
	//	Движение.ВалютаРасчетов = ВалютаДокумента;
	//	Движение.ДатаРасчетов 	= ДатаДокумента;
	//	Движение.ДокументВзаиморасчетов = ИсходныйДокументРеализации;
	//	Движение.СуммаНДС 		= Товары.Итог("СуммаНДС")+Услуги.Итог("СуммаНДС");
	//	Движение.СуммаБезНДС 	= ?(СуммаВключаетНДС,Товары.Итог("Сумма")-Товары.Итог("СуммаНДС")+Услуги.Итог("Сумма")-Услуги.Итог("СуммаНДС"),Товары.Итог("Сумма")+Услуги.Итог("Сумма"));
	//	Движение.СуммаСНДС 		= ?(СуммаВключаетНДС,Товары.Итог("Сумма")+Услуги.Итог("Сумма"),Товары.Итог("Сумма")+Услуги.Итог("Сумма") + Товары.Итог("СуммаНДС")+Услуги.Итог("СуммаНДС"));
	//КонецЕсли; 
	////ДИТ Шевченко А.В. 58535 20.10.2022 -конец
	
	//)
	//Евросиб - АСуслов 22.10.2022 11:27:12 #
	
	РегистрыНакопления.Продажи.КорректировкаРеализации_СформироватьДвиженияПродажи(ЭтотОбъект); //ДИТ Шевченко А.В. 58535 20.10.2022
	
	//Евросиб Каблов 22.07.2025 ( #114890 перенес ниже
	//УчетДоходовРасходовСервер.КРТУ_СформироватьДвиженияДоходыРасходы(ЭтотОбъект);
	//Евросиб Каблов 22.07.2025 )
	
	Если ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование ИЛИ
		ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Тогда
		ПровестиПоИсторииКорректировокРеализации();
	КонецЕсли;
	
	//Евросиб Каблов 22.07.2025 ( #114890
	УчетДоходовРасходовСервер.КРТУ_СформироватьДвиженияДоходыРасходы(ЭтотОбъект);
	//Евросиб Каблов 22.07.2025 )

	Если НЕ ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование Тогда
   		РегистрыСведений.ОтгрузочнаяИнформация.СоздатьДвиженияДокументаКорректировкиРеализации(ЭтотОбъект.Ссылка,Движения.ОтгрузочнаяИнформация);
	КонецЕсли;

	//++ДИТ_Коробов_Task 46790_24.02.22
	Если ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование Тогда
		БухгалтерскийУчетОбщиеПроцедурыСервер.ИСФАктуализацияВыгрузкиДляФНС(ЭтотОбъект.Ссылка,"ВыключитьОтчетФНСДляВсехИСФ");
	КонецЕсли;
	//--ДИТ_Коробов_Task 46790_24.02.22
	
	//Евросиб Шевченко А.В. US 112687 TA 120184 22.10.2025
	РегистрыНакопления.СчетаПокупателей.ВыполнитьДвиженияПоРегиструСчетаПокупателей(ЭтотОбъект);
	
	//Евросиб - АСуслов 17.03.2022 13:33:08 #
	//(
	//Если ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование Тогда
	//	Движения.СчетаПокупателей.Записывать = Истина;
	//	Движения.СчетаПокупателей.Загрузить(ПолучитьТаблицуДвиженийСчетаПокупателей());  
	//	
	//	// ДИТ US 57674 ТА 79279 Сержантова А.С. Начало: 25.03.2024
	//	Движения.СчетаПокупателейПоУчетнымЕдиницам.Записывать = Истина;
	//	Движения.СчетаПокупателейПоУчетнымЕдиницам.Загрузить(ПолучитьТаблицуДвиженийСчетаПокупателейПоУчетнымЕдиницам());   
	//	// ДИТ US 57674 ТА 79279 Сержантова А.С. Конец: 25.03.2024
	//КонецЕсли;
	//Евросиб Шевченко А.В. US 112687 TA 120184 22.10.2025
	//)
	//Евросиб - АСуслов 17.03.2022 13:33:08 #
	
	// Евросиб US 114211 TA 118161 Рыбьяков К.А. 31.08.2025 ((
	РегистрыСведений.ЗакрывающиеДокументыПоКлючамСоставаПоезда.ОтразитьДвиженияПоЗакрывающимДокументам(ЭтотОбъект, Движения.ЗакрывающиеДокументыПоКлючамСоставаПоезда);
	// Евросиб Рыбьяков К.А. 31.08.2025 ))
	
КонецПроцедуры

Процедура ЗаполнитьДокументКорректировкаРеализацииНаОснованииКорректировкиПоступления(ОтчетКомитенту,СчетФактураОснование, Корректировка)
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Организация = Константы.ОсновнаяОрганизация.Получить();
	ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
	ДокументРеализации = СчетФактураОснование.Ссылка;
	Организация = СчетФактураОснование.Организация;
	Контрагент = СчетФактураОснование.Контрагент;
	ДоговорКонтрагента = СчетФактураОснование.ДоговорКонтрагента;
	ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение;
	ИсправляемыйДокументРеализации = СчетФактураОснование.Ссылка;
	СуммаВключаетНДС = Корректировка.СуммаВключаетНДС;
	УчитыватьНДС = Корректировка.УчитыватьНДС;
	Руководитель = СчетФактураОснование.Руководитель;
	ГлавныйБухгалтер =  СчетФактураОснование.ГлавныйБухгалтер;
	ВалютаДокумента =  Корректировка.ВалютаДокумента;
	КурсВзаиморасчетов = Корректировка.КурсВзаиморасчетов;
	КратностьВзаиморасчетов = Корректировка.КратностьВзаиморасчетов;
	СуммаДокумента = Корректировка.СуммаДокумента;
	СуммаНДСДокумента = Корректировка.СуммаНДСДокумента;
	Ответственный = СчетФактураОснование.Ответственный;
	ТабЧастьТовары = Корректировка.Товары.Выгрузить();
	ТабЧастьУслуги = Корректировка.Услуги.Выгрузить();
	КорректировкаОтчетаКомитенту = Истина;
	//Продавец = СчетФактураОснование.Продавец;
	
	Если ТабЧастьТовары.Количество() > 0 Тогда
		Для каждого Стр из ТабЧастьТовары Цикл
			Если Стр.Перевыставление = Истина Тогда
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.КоличествоДоИзменения = Стр.КоличествоДоИзменения;
				НоваяСтрока.КоличествоДоКорректировки = Стр.КоличествоДоКорректировки;
				НоваяСтрока.Количество = Стр.Количество;
				НоваяСтрока.Номенклатура = Стр.Номенклатура;
				НоваяСтрока.СуммаДоИзменения = Стр.СуммаДоИзменения;
				НоваяСтрока.СуммаДоКорректировки = Стр.СуммаДоКорректировки;
				НоваяСтрока.Сумма = Стр.Сумма;
				НоваяСтрока.СуммаНДСДоИзменения = Стр.СуммаНДСДоИзменения;
				НоваяСтрока.СуммаНДСДоКорректировки = Стр.СуммаНДСДоКорректировки;
				НоваяСтрока.СуммаНДС = Стр.СуммаНДС;
				НоваяСтрока.ЦенаДоИзменения = Стр.ЦенаДоИзменения;
				НоваяСтрока.ЦенаДоКорректировки = Стр.ЦенаДоКорректировки;
				НоваяСтрока.Цена = Стр.Цена;
				НоваяСтрока.СтавкаНДСДоИзменения = Стр.СтавкаНДСДоИзменения;
				НоваяСтрока.СтавкаНДС = Стр.СтавкаНДС;
			КонецЕСли;
		КонецЦикла;
	КонецЕсли;
	Если ТабЧастьУслуги.Количество() > 0 Тогда
		Для каждого Стр из ТабЧастьУслуги Цикл
			Если Стр.Перевыставление = Истина Тогда
				НоваяСтрока = АгентскиеУслуги.Добавить();
				НоваяСтрока.КоличествоДоИзменения = Стр.КоличествоДоИзменения;
				НоваяСтрока.КоличествоДоКорректировки = Стр.КоличествоДоКорректировки;
				НоваяСтрока.Количество = Стр.Количество;
				НоваяСтрока.Номенклатура = Стр.Номенклатура;
				НоваяСтрока.СодержаниеДоИзменения = Стр.СодержаниеДоИзменения;
				НоваяСтрока.Содержание = Стр.Содержание;
				НоваяСтрока.СуммаДоИзменения = Стр.СуммаДоИзменения;
				НоваяСтрока.СуммаДоКорректировки = Стр.СуммаДоКорректировки;
				НоваяСтрока.Сумма = Стр.Сумма;
				НоваяСтрока.СуммаНДСДоИзменения = Стр.СуммаНДСДоИзменения;
				НоваяСтрока.СуммаНДСДоКорректировки = Стр.СуммаНДСДоКорректировки;
				НоваяСтрока.СуммаНДС = Стр.СуммаНДС;
				НоваяСтрока.ЦенаДоИзменения = Стр.ЦенаДоИзменения;
				НоваяСтрока.ЦенаДоКорректировки = Стр.ЦенаДоКорректировки;
				НоваяСтрока.Цена = Стр.Цена;
				НоваяСтрока.СтавкаНДСДоИзменения = Стр.СтавкаНДСДоИзменения;
				НоваяСтрока.СтавкаНДС = Стр.СтавкаНДС;
				НоваяСтрока.ЕстьВДокументеРеализации = Истина;
				НоваяСтрока.Контрагент = Корректировка.Контрагент;
				НоваяСтрока.ДоговорКонтрагента = Корректировка.ДоговорКонтрагента;
			//Иначе
			//	
			//	НоваяСтрока = Услуги.Добавить();
			//	НоваяСтрока.КоличествоДоИзменения = Стр.КоличествоДоИзменения;
			//	НоваяСтрока.КоличествоДоКорректировки = Стр.КоличествоДоКорректировки;
			//	НоваяСтрока.Количество = Стр.Количество;
			//	НоваяСтрока.Номенклатура = Стр.Номенклатура;
			//	НоваяСтрока.СодержаниеДоИзменения = Стр.СодержаниеДоИзменения;
			//	НоваяСтрока.Содержание = Стр.Содержание;
			//	НоваяСтрока.СуммаДоИзменения = Стр.СуммаДоИзменения;
			//	НоваяСтрока.СуммаДоКорректировки = Стр.СуммаДоКорректировки;
			//	НоваяСтрока.Сумма = Стр.Сумма;
			//	НоваяСтрока.СуммаНДСДоИзменения = Стр.СуммаНДСДоИзменения;
			//	НоваяСтрока.СуммаНДСДоКорректировки = Стр.СуммаНДСДоКорректировки;
			//	НоваяСтрока.СуммаНДС = Стр.СуммаНДС;
			//	НоваяСтрока.ЦенаДоИзменения = Стр.ЦенаДоИзменения;
			//	НоваяСтрока.ЦенаДоКорректировки = Стр.ЦенаДоКорректировки;
			//	НоваяСтрока.Цена = Стр.Цена;
			//	НоваяСтрока.СтавкаНДСДоИзменения = Стр.СтавкаНДСДоИзменения;
			//	НоваяСтрока.СтавкаНДС = Стр.СтавкаНДС;
			//	НоваяСтрока.ЕстьВДокументеРеализации = Истина;  
			КонецЕСли;
		КонецЦикла;
	КонецЕсли;
	
	РезультатВалюта = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента,ТекущаяДата());
	КратностьВзаиморасчетов = РезультатВалюта.Кратность;
	КурсВзаиморасчетов = РезультатВалюта.Курс;
//	УчитыватьНДС = Организация.УчитыватьНДСВДокументах;
	
	
		
КонецПроцедуры

Функция НайтиКорректировкуОтПоставщика(СчетФактура,ОтчетКомитенту)
	СтрОтчета = ОтчетКомитенту.Поставщики.НАйти(СчетФактура,"СчетФактура");
	Если СтрОтчета <> Неопределено тогда
		Партия = СтрОтчета.Партия;
		
	Иначе
		Сообщить("Не найден документ от поставщика к указанной счет-фактуре в отчете комитенту!");
		Возврат Неопределено;
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КорректировкаПоступления.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.КорректировкаПоступления КАК КорректировкаПоступления
	                      |ГДЕ
	                      |	КорректировкаПоступления.ДокументПоступления = &ДокументПоступления");	
	Запрос.УстановитьПараметр("ДокументПоступления", Партия);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокКорр = Выборка.Ссылка;
	Иначе
		ДокКорр = Неопределено;
	КонецЕсли;
	
	Возврат ДокКорр;
КонецФункции


Функция НайтиСтаршийНомерСчетФактуры()
	НомерСФ = "";
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	МАКСИМУМ(СчетФактураВыданный.Номер) КАК Номер
	                      |ПОМЕСТИТЬ МаксНомерСФАкта
	                      |ИЗ
	                      |	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	                      |ГДЕ
	                      |	ГОД(СчетФактураВыданный.Дата) = &ТекущийГод
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	МАКСИМУМ(КорректировкаРеализации.Номер)
	                      |ИЗ
	                      |	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	                      |ГДЕ
	                      |	ГОД(КорректировкаРеализации.Дата) = &ТекущийГод
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МАКСИМУМ(МаксНомерСФАкта.Номер) КАК Номер
	                      |ИЗ
	                      |	МаксНомерСФАкта КАК МаксНомерСФАкта");
	Запрос.УстановитьПараметр("ТекущийГод",Год(Дата));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НомерСФ = Выборка.Номер;
	КонецЦикла;
	Возврат НомерСФ;
	
	
КонецФункции

Функция ПреобразоватьНомерВСтроку(СлНомер)
	СтрокаНомера = Строка(СлНомер);
	Пока СтрДлина(СтрокаНомера)< 9 Цикл
		СтрокаНомера = "0"+СтрокаНомера;
	КонецЦикла;
	
	Возврат СтрокаНомера;
КонецФункции

//++ Зубов US 40893 TA 43608 07.12.2021
Процедура ПровестиПоИсторииКорректировокРеализации()
	ИсторияКоррРеализации = Движения.ИсторияКорректировокРеализаций;
	Движения.ИсторияКорректировокРеализаций.Очистить();
	//Евросиб Каблов 22.07.2025 ( #114890 Записываем сразу. Нужно для формирования движений Фактические доходы
	//ИсторияКоррРеализации.Записывать = Истина;
	//Евросиб Каблов 22.07.2025 )
	
	ПервичныйДокумент = ИсправляемыйДокументРеализации;
	Продолжать = Истина;
	Пока Продолжать Цикл
		Если ТипЗнч(ПервичныйДокумент)=Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ ТипЗнч(ПервичныйДокумент)=Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
			Продолжать = Ложь;
		ИначеЕсли ПервичныйДокумент.ВидОперации=Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
			Продолжать = Ложь;
		Иначе
			ПервичныйДокумент = ПервичныйДокумент.ИсправляемыйДокументРеализации;
		КонецЕсли;
	КонецЦикла;
	ИспрДокумент = ИсправляемыйДокументРеализации;
	Продолжать = Истина;
	МассивДокументовДвижений = Новый Массив;
	Пока Продолжать Цикл		
		МассивДокументовДвижений.Добавить(ИспрДокумент);
		//Евросиб Каблов 15.12.2022 ( 62714
		//Если ТипЗнч(ИспрДокумент)=Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ ТипЗнч(ПервичныйДокумент)=Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		Если ТипЗнч(ИспрДокумент)=Тип("ДокументСсылка.РеализацияТоваровУслуг") Или ТипЗнч(ИспрДокумент)=Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		//Евросиб Каблов 15.12.2022 )
			Продолжать = Ложь;
		ИначеЕсли ИспрДокумент.ВидОперации=Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
			Продолжать = Ложь;
		Иначе
			ИспрДокумент = ИспрДокумент.ИсправляемыйДокументРеализации;
		КонецЕсли;
	КонецЦикла;
	ДокументовВОчереди = МассивДокументовДвижений.Количество();
	Пока НЕ ДокументовВОчереди = 0 Цикл
		Движение = ИсторияКоррРеализации.Добавить();
		Движение.Период = Дата;
		
		Движение.Активность = Истина;
		Движение.ВидОперации = ВидОперации;
		Движение.ПервичныйДокумент = ПервичныйДокумент;
		Движение.КорректируемыйДокумент = МассивДокументовДвижений[ДокументовВОчереди-1];
		
		ДокументовВОчереди = ДокументовВОчереди-1;
	КонецЦикла;
	
	//Евросиб Каблов 22.07.2025 ( #114890 Записываем сразу. Нужно для формирования движений Фактические доходы
	ИсторияКоррРеализации.Записать();
	//Евросиб Каблов 22.07.2025 )
	
КонецПроцедуры
//-- Зубов US 40893 TA 43608 07.12.2021

