
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Этаформа.ВладелецФормы = Неопределено Тогда
		Элементы.Список.Отображение = ОтображениеТаблицы.ИерархическийСписок;
		Возврат;
	КонецЕсли;
	
	//Если Тип(Этаформа.ВладелецФормы) = Тип("ТаблицаФормы") Тогда
	//ДИТ Беляев СЮ, TA 41046, 18-11-2021 ++
	//Если Тип(Этаформа.ВладелецФормы) = Тип("ТаблицаФормы") Или Тип(Этаформа.ВладелецФормы) = Тип("ФормаКлиентскогоПриложения") Тогда
	//	Возврат;
	//КонецЕсли;   
	//ДИТ Беляев СЮ, TA 41046, 18-11-2021 --                  
	
	//ДИТ Беляев СЮ, TA 41046, 10-12-2021 ++
	Если Тип(Этаформа.ВладелецФормы) = Тип("ТаблицаФормы") Тогда
		Возврат;
	КонецЕсли;
	Если Тип(Этаформа.ВладелецФормы) = Тип("ФормаКлиентскогоПриложения") Тогда
		Если Этаформа.ВладелецФормы.ИмяФормы <> "ОбщаяФорма.Мультилокации" Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	//ДИТ Беляев СЮ, TA 41046, 10-12-2021 --
	
	ФиксМассив = Этаформа.ВладелецФормы.ПараметрыВыбора;
	Если ФиксМассив.Количество()>0 Тогда
		// Евросиб Bug 93272 TA 93294 Рыбьяков К.А. 22.10.2024 ((
		ЕстьЗначение = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ФиксМассив[0], "Значение");
		Если ЕстьЗначение Тогда
			Если ФиксМассив[0].Значение = ПредопределенноеЗначение("Справочник.ТипыЛокаций.Сток") Тогда
				Элементы.Список.Отображение = ОтображениеТаблицы.Список;
			КонецЕсли;
		КонецЕсли;
		//Если ФиксМассив[0].Значение = ПредопределенноеЗначение("Справочник.ТипыЛокаций.Сток") Тогда
		//	Элементы.Список.Отображение = ОтображениеТаблицы.Список;
		//КонецЕсли;
		// Евросиб Рыбьяков К.А. 22.10.2024 ))
	Иначе
		Элементы.Список.Отображение = ОтображениеТаблицы.ИерархическийСписок;
	КонецЕсли;
	
	ОтборПоПортам();
	
	//++ Зубов 39480 29.09.2021
	Если ЗначениеЗаполнено(ТипЛокации) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Тип",ТипЛокации,ВидСравненияКомпоновкиДанных.ВСписке);
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;	
	КонецЕсли;
	Если ЗначениеЗаполнено(РодительЛокации) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Родитель",РодительЛокации,ВидСравненияКомпоновкиДанных.ВСписке);
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;	
	КонецЕсли;
	//-- Зубов 39480 29.09.2021
	//Евросиб - АСуслов 04.07.2023 15:55:44 #локации
	//(
	//РаботаСФормамиКлиент.ОтключитьПользовательскийОтборПоПолю(Список, "ПометкаУдаления");
	//)
	//Евросиб - АСуслов 04.07.2023 15:55:47 #локации
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоПортам()
	Если ПодходящиеПорты Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Ссылка", СписокПодходящихПортов,ВидСравненияКомпоновкиДанных.ВСписке);
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	//Иначе
	//	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список,"Ссылка")
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	          
	Если Параметры.Свойство("ПодходящиеПорты") Тогда
		СписокПодходящихПортов = Параметры.ПодходящиеПорты;
		ПодходящиеПорты = Истина;
	Иначе
		ПодходящиеПорты = Ложь;
	КонецЕсли;                                
		
	//++ Зубов 39480 29.09.2021
	//Евросиб Трундуков С.А. 133954 19.03.2026 начало
	//Было:
	//	Если Параметры.Свойство("ТипЛокации") Тогда
	//		ТипЛокации = Параметры.ТипЛокации;
	//	КонецЕсли;
	Если Параметры.Свойство("ТипЛокации") Тогда
		Если ТипЗнч(Параметры.ТипЛокации) = Тип("СправочникСсылка.ТипыЛокаций") Тогда
			ТипЛокации.Добавить(Параметры.ТипЛокации);
		Иначе
			ТипЛокации = Параметры.ТипЛокации;
		КонецЕсли;
	КонецЕсли;
	//Евросиб Трундуков С.А. 133954 19.03.2026 Конец
	Если Параметры.Свойство("РодительЛокации") Тогда
		РодительЛокации = Параметры.РодительЛокации;
	КонецЕсли;
	//-- Зубов 39480 29.09.2021   
	
	//ДИТ Беляев СЮ, TA 41046, 18-11-2021 ++
	Если Параметры.Свойство("Отбор") Тогда    
		Если Параметры.Отбор.Свойство("СписокЛокаций") Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Ссылка",Параметры.Отбор.СписокЛокаций,ВидСравненияКомпоновкиДанных.ВСписке,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
			Элементы.Список.Отображение = ОтображениеТаблицы.Список;
		Иначе
			Если Параметры.Отбор.Свойство("ТипЛокации") Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Тип",Параметры.Отбор.ТипЛокации,ВидСравненияКомпоновкиДанных.Равно);
				Элементы.Список.Отображение = ОтображениеТаблицы.Список;
			КонецЕсли;
			Если Параметры.Отбор.Свойство("РодительЛокации") Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Родитель",Параметры.Отбор.РодительЛокации,ВидСравненияКомпоновкиДанных.ВИерархии);
				Элементы.Список.Отображение = ОтображениеТаблицы.Список;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//ДИТ Беляев СЮ, TA 41046, 18-11-2021 --
	//Евросиб Коханенко Н.А. #61705 01.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 01.12.2022 ) 
	
	//Евросиб - АСуслов 17.04.2023 16:00:03 #67444
	//(
	Если Параметры.Свойство("СкрытьКнопкуГеокодера") Тогда
		Элементы.ФормаПодобратьАдресПоГеокодеру.Видимость = Ложь;
	КонецЕсли;
	//)
	//Евросиб - АСуслов 17.04.2023 16:00:06 #67444
	//Евросиб - АСуслов 27.06.2023 14:56:52 #локации
	//(
	// Если в ТипЛокации один элемент и это адрес, то отключим видимость списка 
	Если Параметры.Свойство("Отбор")
		И Параметры.Отбор.Свойство("Тип") Тогда
		Если ТипЗнч(Параметры.Отбор.Тип) = Тип("Массив") Тогда
			Если Параметры.Отбор.Тип.Количество() = 1
				И Параметры.Отбор.Тип[0] = Справочники.ТипыЛокаций.АдресВНаселенномПункте Тогда
				Элементы.Список.Видимость = Ложь;
				Элементы.Группа1.Видимость = Ложь;
				Элементы.Группа4.Видимость = Ложь; 
				Элементы.ФормаКоманднаяПанель.Видимость = Ложь;
			ИначеЕсли Параметры.Отбор.Тип.Найти(Справочники.ТипыЛокаций.АдресВНаселенномПункте) = Неопределено Тогда 
				Элементы.ГруппаАдресВЛокации.Видимость = Ложь
			КонецЕсли;
		ИначеЕсли ТипЗнч(Параметры.Отбор.Тип) = Тип("СписокЗначений") 
			И Параметры.Отбор.Тип.НайтиПоЗначению(Справочники.ТипыЛокаций.АдресВНаселенномПункте) = Неопределено Тогда 
			Элементы.ГруппаАдресВЛокации.Видимость = Ложь
		ИначеЕсли Параметры.Отбор.Тип = Справочники.ТипыЛокаций.АдресВНаселенномПункте Тогда	
			Элементы.Список.Видимость = Ложь;
			Элементы.Группа1.Видимость = Ложь;
			Элементы.Группа4.Видимость = Ложь; 
			Элементы.ФормаКоманднаяПанель.Видимость = Ложь;
		КонецЕсли;
	ИначеЕсли Параметры.Свойство("ПоказыватьВыборАдреса") Тогда
        Элементы.ГруппаАдресВЛокации.Видимость = Параметры.ПоказыватьВыборАдреса;
	КонецЕсли;
	//)
	//Евросиб - АСуслов 27.06.2023 14:56:55 #локации
КонецПроцедуры 

//Евросиб Коханенко Н.А. #61705 01.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 01.12.2022 )

//++ Зубов 39480 29.09.2021
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) 
	//ДИТ Беляев СЮ, TA 41046, 18-11-2021 ++
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;                              
	//ДИТ Беляев СЮ, TA 41046, 18-11-2021 --  
	
	//Если НЕ ТипЗнч(ЭтаФорма.ВладелецФормы) = Тип("ПолеФормы") Тогда
	//ДИТ Беляев СЮ, TA 41046, 18-11-2021 ++
	Если НЕ ТипЗнч(ЭтаФорма.ВладелецФормы) = Тип("ПолеФормы") И НЕ ТипЗнч(ЭтаФорма.ВладелецФормы) = Тип("ТаблицаФормы") Тогда 
	//ДИТ Беляев СЮ, TA 41046, 18-11-2021 --
		Если ЭтаФорма.ВладелецФормы.ИмяФормы = "ОбщаяФорма.Мультилокации" Тогда
			Оповестить("ЗакрытиеФормыВыбораЛокацииДляМультилокации",Элементы.Список.ТекущаяСтрока,ЭтаФорма.ВладелецФормы.УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПодобратьАдресПоГеокодеру(Команда) 
	АдресВНаселенномПункте = НайтиАдресВНаселенномПункте(АдресВЛокации);
	Если ЗначениеЗаполнено(АдресВНаселенномПункте) Тогда
		ЗавершениеУточненияАдреса(АдресВНаселенномПункте, Неопределено);
	КонецЕсли;
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Режим", "СозданиеСВыборомНаселенногоПункта");
	//ПараметрыОткрытияФормы.Вставить("Локация", Элементы.Список.ТекущаяСтрока);
	ПараметрыОткрытияФормы.Вставить("Локация", Неопределено);
	ПараметрыОткрытияФормы.Вставить("АдресВЛокации", АдресВЛокации);
    СтатусПоследнегоЗапроса = ГеокодированиеВызовСервера.ПроверитьГеокодПоИсторииЗапросов(АдресВЛокации);
	Если СтатусПоследнегоЗапроса = ПредопределенноеЗначение("Перечисление.СтатусыОбработкиЗапросаГеокодера.ОтветПолученНеЗаписан") Тогда
		ОписаниеОповещенияВопросаГеокодера = Новый ОписаниеОповещения("ПродолжитьОткрытиеФормыПодбораАдреса", ЭтотОбъект, ПараметрыОткрытияФормы);
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
		СписокКнопок.Добавить(КодВозвратаДиалога.Ок, "Отправить запрос в текущем виде");
		ПоказатьВопрос(ОписаниеОповещенияВопросаГеокодера, "При предыдущей отправке аналогичного значения системе не удалось найти подходящий условиям поиска адрес в адресном классификаторе.
		|Попробуйте изменить введенное значение перед его отправкой. Отправить запрос в текущем виде?", СписокКнопок);
	Иначе
		ПродолжитьОткрытиеФормыПодбораАдреса(Неопределено, ПараметрыОткрытияФормы);
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура ПродолжитьОткрытиеФормыПодбораАдреса(Параметр1, Параметр2) Экспорт
	Если Параметр1 = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;  
 	Оповещение = Новый ОписаниеОповещения("ЗавершениеУточненияАдреса", ЭтотОбъект, Новый Структура);
	//ГеокодированиеКлиент.НачалоВыбораАдреса(ЭтаФорма, Элементы.Адрес, Неопределено, Ложь, Неопределено, НаименованиеЛокации, ЛокацияВышестоящегоУровня);
	//ГеокодированиеКлиент.НачалоВыбораАдреса(ЭтаФорма, Элементы.АдресВЛокации, Неопределено, Ложь, Неопределено);
	//ОткрытьФорму("Справочник.АдресаВНаселенныхПунктах.Форма.ФормаПодбораАдреса", Параметр2, ЭтаФорма, ,,,Оповещение);
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораАдресаПоГеокодеруЯндекс", Параметр2, ЭтаФорма,,,,Оповещение);
КонецПроцедуры


&НаСервереБезКонтекста
Функция НайтиАдресВНаселенномПункте(Адрес)
	//1 ищем адрес в справочнике
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АдресаВНаселенныхПунктах.Ссылка КАК СсылкаАдрес,
	|	АдресаВНаселенныхПунктах.Владелец КАК НаселенныйПункт
	|ИЗ
	|	Справочник.АдресаВНаселенныхПунктах КАК АдресаВНаселенныхПунктах
	|ГДЕ
	|	АдресаВНаселенныхПунктах.Адрес = &Адрес
	|	И НЕ АдресаВНаселенныхПунктах.ПометкаУдаления";
	Запрос.УстановитьПараметр("Адрес", Адрес);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Возврат Результат.Выгрузить()[0].СсылкаАдрес;   
	КонецЕсли;
КонецФункции


&НаКлиенте
Процедура ЗавершениеУточненияАдреса(Результат, Параметры) Экспорт
	ОповеститьОВыборе(Результат);
	Если Открыта() Тогда
		Закрыть(Результат);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АдресВЛокацииОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	АдресВЛокации = Текст;
	ПодобратьАдресПоГеокодеру(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Закрыть(ВыбранноеЗначение);
КонецПроцедуры

//-- Зубов 39480 29.09.2021
