Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода, Знач СтруктураПодписантов = Неопределено) Экспорт
	
	//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетФактура981") Тогда
	//	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"СчетФактура981", "Счет-фактура",
	//		ПечатьБухгалтерскихДокументов.ПечатьСчетовФактур981(МассивОбъектов, ОбъектыПечати, ТекстЗапросаПечатьСчетовФактур(,,Истина), ПараметрыПечати),,
	//		"ОбщийМакет.ПФ_MXL_СчетФактура981");
	//КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетФактура981") Тогда
		СформироватьПечатнуюФормуСчетФактуры(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, "СчетФактура981", "Счет-фактура",
		ОбъектыПечати, ПараметрыВывода,СтруктураПодписантов);
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КорректировочныйСчетФактура981") Тогда
		//СформироватьПечатнуюФормуКорректировочногоСчетФактуры(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм,"КорректировочныйСчетФактура981", "Корректировочный счет-фактура",
		//ОбъектыПечати, ПараметрыВывода);
		//ДИТ, Беляев СЮ, Ticket#0284851, 15-09-2022, начало
		СформироватьПечатнуюФормуКорректировочногоСчетФактуры(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм,"КорректировочныйСчетФактура981", "Корректировочный счет-фактура",
		ОбъектыПечати, ПараметрыВывода, СтруктураПодписантов);
		//ДИТ, Беляев СЮ, Ticket#0284851, 15-09-2022, конец
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УниверсальныйПередаточныйДокумент981") Тогда
		// ДИТ Поморцева Т.П. Задача 0234229 07.06.2021. Начало
		//СформироватьПечатнуюФормуУПД(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм,"УниверсальныйПередаточныйДокумент981", "Универсальный передаточный документ",
		//ОбъектыПечати, ПараметрыВывода);
		СформироватьПечатнуюФормуУПД(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм,"УниверсальныйПередаточныйДокумент981", "Универсальный передаточный документ",
		ОбъектыПечати, ПараметрыВывода,СтруктураПодписантов);
		// ДИТ Поморцева Т.П. Задача 0234229 07.06.2021. Конец
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УниверсальныйКорректировочныйДокумент981") Тогда
		СформироватьПечатнуюФормуУКД(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм,"УниверсальныйКорректировочныйДокумент981", "Универсальный корректировочный документ",
		ОбъектыПечати, ПараметрыВывода);
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьПечатнуюФормуСчетФактуры(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ИмяМакета, СинонимМакета, ОбъектыПечати, ПараметрыВывод,СтруктураПодписантов)
	Для каждого ЭлМассива из МассивОбъектов Цикл
//Евросиб Литвинов 19.08.2021 ( #35933 #36212

//		//Евросиб Каблов 23.06.2021 ( Ticket#0225310
//		Запрос = Новый Запрос;
//		Запрос.Текст =
//		"ВЫБРАТЬ
//		|	Диадок_Документы.Ссылка КАК Ссылка
//		|ИЗ
//		|	Справочник.Диадок_Документы КАК Диадок_Документы
//		|ГДЕ
//		|	Диадок_Документы.Документ = &Документ
////Евросиб Литвинов 16.07.2021 ( #36872
//		|	И Диадок_Документы.Метка = ""Отправлен""
////Евросиб Литвинов 16.07.2021 )
//		|	И НЕ Диадок_Документы.ПометкаУдаления";		
//		Запрос.УстановитьПараметр("Документ", ЭлМассива);
//		
//		Выборка = Запрос.Выполнить().Выбрать();

//		Если Выборка.Следующий() Тогда
//			
//			ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "СчетФактура981");
//			
////Евросиб Литвинов 29.06.2021 ( #35933
//			ПФ = Диадок_ФоновыеЗадания.ПолучитьПечатнуюФормуДокументаПоСсылке(Выборка.Ссылка);
//			Если зНАЧЕНИЕзАПОЛНЕНО(ПФ) Тогда
//				АдресХранилища = ПоместитьВоВременноеХранилище(ПФ, Новый УникальныйИдентификатор);
//				
//				ПечатнаяФорма.СинонимМакета    = НСтр("ru = 'Счет фактура'");
//				Если ПечатнаяФорма.ОфисныеДокументы = Неопределено Тогда
//					ПечатнаяФорма.ОфисныеДокументы = Новый Соответствие;
//				КонецЕсли;
//				ПечатнаяФорма.ОфисныеДокументы.Вставить(АдресХранилища, Строка(ЭлМассива) + ".pdf");
//				Продолжить;
//			КонецЕсли;
//		//Евросиб Каблов 23.06.2021 ) 
//		КонецЕсли;	
//		//ИначеЕсли ЭлМассива.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию Тогда

		Если ПечатьКомплектаДокументов.ПолучитьПечатнуюФормуИзДиадок(КоллекцияПечатныхФорм, ЭлМассива, ИмяМакета, СинонимМакета) Тогда
			Продолжить;
		КонецЕсли;
//Евросиб Литвинов 19.08.2021 ) #35933 #36212 
		Если ЭлМассива.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию Тогда
//Евросиб Литвинов 29.06.2021 ) 
			ТаблицаСведенийСчетФактуры = ПолучитьТаблицуСведенийСчетФактуры(ЭлМассива);
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета, СинонимМакета, 
				ПечатьБухгалтерскихДокументов.ПечатьСчетовФактур981(ТаблицаСведенийСчетФактуры, ОбъектыПечати, ПараметрыПечати,СтруктураПодписантов),,"ОбщийМакет.ПФ_MXL_СчетФактура981");
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

//Процедура СформироватьПечатнуюФормуКорректировочногоСчетФактуры(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ИмяМакета, СинонимМакета, ОбъектыПечати, ПараметрыВывод)
//ДИТ, Беляев СЮ, Ticket#0284851, 15-09-2022, добавлен параметр <СтруктураПодписантов>
Процедура СформироватьПечатнуюФормуКорректировочногоСчетФактуры(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ИмяМакета, СинонимМакета, ОбъектыПечати, ПараметрыВывод, СтруктураПодписантов)
	Для каждого ЭлМассива из МассивОбъектов Цикл
		ТаблицаСведенийСчетФактуры = ПолучитьТаблицуСведенийКорректировочногоСчетФактуры(ЭлМассива);
		//УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета, СинонимМакета,
		//	ПечатьБухгалтерскихДокументов.ПечатьКорректировочныхСчетовФактур981(ТаблицаСведенийСчетФактуры, ОбъектыПечати,ПараметрыПечати),,"ОбщийМакет.ПФ_MXL_КорректировочныйСчетФактура981");
		//ДИТ, Беляев СЮ, Ticket#0284851, 15-09-2022, начало
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета, СинонимМакета,
			ПечатьБухгалтерскихДокументов.ПечатьКорректировочныхСчетовФактур981(ТаблицаСведенийСчетФактуры, ОбъектыПечати,ПараметрыПечати,СтруктураПодписантов),,"ОбщийМакет.ПФ_MXL_КорректировочныйСчетФактура981");
		//ДИТ, Беляев СЮ, Ticket#0284851, 15-09-2022, конец
	КонецЦикла;	
КонецПроцедуры

// ДИТ Поморцева Т.П. Задача 0234229 07.06.2021.//Процедура СформироватьПечатнуюФормуУПД (МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ИмяМакета, СинонимМакета, ОбъектыПечати, ПараметрыВывод)
Процедура СформироватьПечатнуюФормуУПД (МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ИмяМакета, СинонимМакета, ОбъектыПечати, ПараметрыВывод, СтруктураПодписантов = Неопределено)
	
	Для каждого ЭлМассива из МассивОбъектов Цикл
		ТаблицаСведенийСчетФактуры = ПолучитьТаблицуСведенийСчетФактуры(ЭлМассива);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета, СинонимМакета,
		// ДИТ Поморцева Т.П. Задача 0234229 07.06.2021. Начало
			//ПечатьБухгалтерскихДокументов.ПечатьУПД981(ТаблицаСведенийСчетФактуры, ОбъектыПечати, ПараметрыПечати),,"ОбщийМакет.ПФ_MXL_УниверсальныйПередаточныйДокумент981");
			ПечатьБухгалтерскихДокументов.ПечатьУПД981(ТаблицаСведенийСчетФактуры, ОбъектыПечати, ПараметрыПечати,СтруктураПодписантов),,"ОбщийМакет.ПФ_MXL_УниверсальныйПередаточныйДокумент981");
		// ДИТ Поморцева Т.П. Задача 0234229 07.06.2021. Конец
	КонецЦикла;	
	
КонецПроцедуры


Процедура СформироватьПечатнуюФормуУКД (МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ИмяМакета, СинонимМакета, ОбъектыПечати, ПараметрыВывод)
	Для каждого ЭлМассива из МассивОбъектов Цикл
		ТаблицаСведенийСчетФактуры = ПолучитьТаблицуСведенийКорректировочногоСчетФактуры(ЭлМассива);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета, СинонимМакета,
			ПечатьБухгалтерскихДокументов.ПечатьУКД981(ТаблицаСведенийСчетФактуры, ОбъектыПечати,ПараметрыПечати),,"ОбщийМакет.ПФ_MXL_УниверсальныйПередаточныйДокумент981");
	КонецЦикла;	
	
КонецПроцедуры

Функция ПолучитьТаблицуСведенийСчетФактуры(Документ) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаСведений = ПечатьБухгалтерскихДокументов.ПолучитьОписаниеСчетФактуры();
	ТаблицаДокумента = ПечатьБухгалтерскихДокументов.ПолучитьОписаниеТаблицыСчетФактуры();
	
	//Евросиб Каблов 20.01.2021 ( Ticket#0218605
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Авансы.СчетФактура КАК СчетФактура,
	|	Авансы.ДокументОплаты КАК ДокументОплаты,
	|	Авансы.ДокументОплаты.НомерВходящегоДокумента КАК НомерПП,
	|	Авансы.ДокументОплаты.ДатаВходящегоДокумента КАК ДатаПП
	|ИЗ
	|	(ВЫБРАТЬ
	|		СчетФактураВыданныйДокументыОснования.Ссылка КАК СчетФактура,
	|		СчетФактураВыданныйДокументыОснования.ДокументОснование КАК Реализация,
	|		ПоступлениеНаРасчетныйСчетДокументыОплаты.Ссылка КАК ДокументОплаты
	|	ИЗ
	|		Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаРасчетныйСчет.ДокументыОплаты КАК ПоступлениеНаРасчетныйСчетДокументыОплаты
	|			ПО СчетФактураВыданныйДокументыОснования.ДокументОснование = ПоступлениеНаРасчетныйСчетДокументыОплаты.ДокументРеализации
	|	ГДЕ
	|		СчетФактураВыданныйДокументыОснования.Ссылка = &Документ
	|		И ПоступлениеНаРасчетныйСчетДокументыОплаты.ДокументРеализации.ДатаДокумента > ПоступлениеНаРасчетныйСчетДокументыОплаты.Ссылка.ДатаВходящегоДокумента
	|		И ПоступлениеНаРасчетныйСчетДокументыОплаты.Ссылка.Проведен
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СчетФактураВыданныйДокументыОснования.Ссылка,
	|		СчетФактураВыданныйДокументыОснования.ДокументОснование,
	|		ПоступлениеНаРасчетныйСчетДокументыОплаты.Ссылка
	|	
	|	ИМЕЮЩИЕ
	|		СУММА(ПоступлениеНаРасчетныйСчетДокументыОплаты.СуммаОплаты) > 0) КАК Авансы";
	Запрос.УстановитьПараметр("Документ", Документ);
	ТаблицаАвансов = Запрос.Выполнить().Выгрузить();
	//Евросиб Каблов 20.01.2021 )
	
	ТекстЗапроса = ПолучитьТекстЗапросаДляПечатиСчетаФактуры();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СведенияОДокументе = ТаблицаСведений.Добавить();
		ЗаполнитьЗначенияСвойств(СведенияОДокументе,Выборка);
		//Евросиб - АСуслов 14.09.2022 11:50:32 #
		//(
		ФакторингСервер.ЗаполнитьПараметрыФакторинга(СведенияОДокументе);
		//)
		//Евросиб - АСуслов 14.09.2022 11:50:32 #
		//Если Выборка.Продавец <>  Выборка.Организация Тогда
		//	СтрокаАгента = "(Через " + Выборка.Организация.НаименованиеПолное+ ", ИНН/КПП "+Выборка.Организация.ИНН+"/"+Выборка.Организация.КПП+")";
		//Иначе
			СТрокаАгента = "";
		//КонецЕсли;
		Если ТипЗнч(Выборка.Продавец) = Тип("СправочникСсылка.Организации") Тогда
			Если ЗначениеЗаполнено(Выборка.Продавец.ГоловнаяОрганизация) Тогда
//Евросиб ( Литвинов 21.01.2021 #30025                                                                                                          
				//Евросиб - АСуслов 06.09.2023 14:00:07 #74705
				//(
				//СведенияОДокументе.ПредставлениеПоставщика = Выборка.Продавец.ГоловнаяОрганизация.НаименованиеПолное+Символы.ПС+СтрокаАгента;
				НаименованиеНаДатуГоловнаяОрганизация = Справочники.Организации.НаименованияНаДату(Выборка.Продавец.ГоловнаяОрганизация, Выборка.ДатаДокумента);
				НаименованиеНаДатуОрганизация = Справочники.Организации.НаименованияНаДату(Выборка.Продавец, Выборка.ДатаДокумента);
				СведенияОДокументе.ПредставлениеПоставщика = НаименованиеНаДатуГоловнаяОрганизация.НаименованиеПолное+Символы.ПС+СтрокаАгента;
				//)
				//Евросиб - АСуслов 06.09.2023 14:00:10 #74705
//Евросиб ) Литвинов 21.01.2021 #30025
				СведенияОДокументе.АдресПоставщика = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Продавец.ГоловнаяОрганизация,
						?(ТипЗнч(Выборка.Продавец)=Тип("СправочникСсылка.Контрагенты"),Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации),Выборка.ДатаДокумента,Истина);
				//Евросиб - АСуслов 06.09.2023 14:02:08 #74705
				//(
				//СведенияОДокументе.ИННПоставщика = Выборка.Продавец.ГоловнаяОрганизация.ИНН+"/"+Выборка.КПППродавца;
				СведенияОДокументе.ИННПоставщика = Выборка.Продавец.ГоловнаяОрганизация.ИНН+"/"+НаименованиеНаДатуОрганизация.КПП;
				//)
				//Евросиб - АСуслов 06.09.2023 14:02:10 #74705		
//Евросиб ( Литвинов 21.01.2021 #30025
				//СведенияОДокументе.ПредставлениеГрузоотправителя = Выборка.Продавец.НаименованиеПолное;
				СведенияОДокументе.ПредставлениеГрузоотправителя = Справочники.Организации.НаименованияНаДату(Выборка.Продавец, Выборка.ДатаДокумента, Выборка.Продавец.НаименованиеПолное).НаименованиеПолное;
//Евросиб ) Литвинов 21.01.2021 #30025
				СведенияОДокументе.Грузоотправитель = Выборка.Продавец;
			Иначе
						
//Евросиб ( Литвинов 21.01.2021 #30025
				//СведенияОДокументе.ПредставлениеПоставщика = Выборка.Продавец.НаименованиеПолное+Символы.ПС+СтрокаАгента;
				//Евросиб - АСуслов 06.09.2023 14:03:33 #74705
				//(
				//СведенияОДокументе.ПредставлениеПоставщика = Справочники.Организации.НаименованияНаДату(Выборка.Продавец, Выборка.ДатаДокумента).НаименованиеПолное+Символы.ПС+СтрокаАгента;
				НаименованияНаДату = Справочники.Организации.НаименованияНаДату(Выборка.Продавец, Выборка.ДатаДокумента);
				СведенияОДокументе.ПредставлениеПоставщика = НаименованияНаДату.НаименованиеПолное+Символы.ПС+СтрокаАгента;
				//)
				//Евросиб - АСуслов 06.09.2023 14:03:35 #74705
//Евросиб ) Литвинов 21.01.2021 #30025
				СведенияОДокументе.АдресПоставщика = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Продавец,
				?(ТипЗнч(Выборка.Продавец)=Тип("СправочникСсылка.Контрагенты"),Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации),Выборка.ДатаДокумента,Истина);
				//Евросиб - АСуслов 06.09.2023 14:04:33 #74705
				//(
				СведенияОДокументе.ИННПоставщика = Выборка.ИННПоставщика+"/"+НаименованияНаДату.КПП;
				//)
				//Евросиб - АСуслов 06.09.2023 14:04:35 #74705
				КонецЕсли;
		ИначеЕсли ТипЗнч(Выборка.Продавец) = Тип("СправочникСсылка.Контрагенты") Тогда
			Если Выборка.ДоговорТранспортнойЭкспедиции Тогда
				Если ЗначениеЗаполнено(Выборка.Организация.ГоловнаяОрганизация) Тогда
					//СведенияОДокументе.ПредставлениеПоставщика = Справочники.Организации.НаименованияНаДату(Выборка.Организация.ГоловнаяОрганизация, Выборка.ДатаДокумента).НаименованиеПолное+Символы.ПС+СтрокаАгента;
					//Евросиб - АСуслов 06.09.2023 14:05:21 #74705
					//(
					//СведенияОДокументе.ПредставлениеПоставщика = Справочники.Организации.НаименованияНаДату(Выборка.Организация.ГоловнаяОрганизация, Выборка.ДатаДокумента).НаименованиеПолное;
					НаименованияНаДатуГоловнаяОрганизация = Справочники.Организации.НаименованияНаДату(Выборка.Организация.ГоловнаяОрганизация, Выборка.ДатаДокумента);
					СведенияОДокументе.ПредставлениеПоставщика = НаименованияНаДатуГоловнаяОрганизация.НаименованиеПолное;
					//)
					//Евросиб - АСуслов 06.09.2023 14:05:23 #74705
					СведенияОДокументе.АдресПоставщика = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Организация.ГоловнаяОрганизация,
					Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,Выборка.ДатаДокумента,Истина);
					//Евросиб - АСуслов 06.09.2023 14:06:27 #74705
					//(
					//СведенияОДокументе.ИННПоставщика = Выборка.Организация.ГоловнаяОрганизация.ИНН+"/"+Выборка.Организация.КПП;
					НаименованияНаДатуОрганизация = Справочники.Организации.НаименованияНаДату(Выборка.Организация, Выборка.ДатаДокумента, Выборка.Организация.НаименованиеПолное);
					СведенияОДокументе.ИННПоставщика = Выборка.Организация.ГоловнаяОрганизация.ИНН+"/"+НаименованияНаДатуОрганизация.КПП;
					//)
					//Евросиб - АСуслов 06.09.2023 14:06:30 #74705
					СведенияОДокументе.ПредставлениеГрузоотправителя = НаименованияНаДатуОрганизация.НаименованиеПолное;
					СведенияОДокументе.Грузоотправитель = Выборка.Продавец;
				Иначе                                            
					//Евросиб - АСуслов 06.09.2023 14:07:34 #74705
					//(
					//СведенияОДокументе.ПредставлениеПоставщика = Справочники.Организации.НаименованияНаДату(Выборка.Организация, Выборка.ДатаДокумента).НаименованиеПолное+Символы.ПС+СтрокаАгента;
					НаименованияНаДату = Справочники.Организации.НаименованияНаДату(Выборка.Организация, Выборка.ДатаДокумента);
					СведенияОДокументе.ПредставлениеПоставщика = НаименованияНаДату.НаименованиеПолное+Символы.ПС+СтрокаАгента;
					//)
					//Евросиб - АСуслов 06.09.2023 14:07:35 #74705
					СведенияОДокументе.АдресПоставщика = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Организация,
					Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,Выборка.ДатаДокумента,Истина);
					СведенияОДокументе.ИННПоставщика = Выборка.Организация.ИНН+"/"+НаименованияНаДату.КПП;
				КонецЕсли;
				СведенияОДокументе.ПредставлениеПоставщика = СведенияОДокументе.ПредставлениеПоставщика 
															+ "(Составлен экспедитором: "+ СведенияОДокументе.ПредставлениеПоставщика + " ИНН/КПП " + СведенияОДокументе.ИННПоставщика;
				//Евросиб - АСуслов 06.09.2023 14:16:12 #74705
				//(
				НаименованияНаДатуОрганизация = Справочники.Организации.НаименованияНаДату(Выборка.Организация, Выборка.ДатаДокумента, Выборка.Организация.НаименованиеПолное);
				//)
				//Евросиб - АСуслов 06.09.2023 14:16:14 #74705															
				Если ЗначениеЗаполнено(Выборка.Продавец.ГоловнойКонтрагент) Тогда
					СведенияОДокументе.ПредставлениеПоставщика = СведенияОДокументе.ПредставлениеПоставщика
																+ Символы.ПС
																+ Выборка.Продавец.ГоловнойКонтрагент.НаименованиеПолное 
																//+ "ИНН/КПП "+ Выборка.Продавец.ГоловнойКонтрагент.ИНН+"/"+Выборка.КПППродавца + ")";
																+ "ИНН/КПП "+ Выборка.Продавец.ГоловнойКонтрагент.ИНН+"/"+НаименованияНаДатуОрганизация.КПП + ")";
				Иначе
					СведенияОДокументе.ПредставлениеПоставщика = СведенияОДокументе.ПредставлениеПоставщика 
																+Символы.ПС
																//+"Продавец: " + Выборка.Продавец.НаименованиеПолное + " ИНН/КПП " + Выборка.ИННПоставщика+"/"+Выборка.КПППродавца + ")";
																+"Продавец: " + Выборка.Продавец.НаименованиеПолное + " ИНН/КПП " + Выборка.ИННПоставщика+"/"+НаименованияНаДатуОрганизация.КПП + ")";
				КонецЕсли; 
			ИначеЕсли ЗначениеЗаполнено(Выборка.Продавец.ГоловнойКонтрагент) Тогда
				//Евросиб - АСуслов 06.09.2023 14:16:12 #74705
				//(
				НаименованияНаДатуОрганизация = Справочники.Организации.НаименованияНаДату(Выборка.Организация, Выборка.ДатаДокумента, Выборка.Организация.НаименованиеПолное);
				//)
				//Евросиб - АСуслов 06.09.2023 14:16:14 #74705															
				СведенияОДокументе.ПредставлениеПоставщика = Выборка.Продавец.ГоловнойКонтрагент.НаименованиеПолное+Символы.ПС+СтрокаАгента;
				СведенияОДокументе.АдресПоставщика = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Продавец.ГоловнойКонтрагент,
						?(ТипЗнч(Выборка.Продавец)=Тип("СправочникСсылка.Контрагенты"),Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации),Выборка.ДатаДокумента,Истина);
				//СведенияОДокументе.ИННПоставщика = Выборка.Продавец.ГоловнойКонтрагент.ИНН+"/"+Выборка.КПППродавца;
				СведенияОДокументе.ИННПоставщика = Выборка.Продавец.ГоловнойКонтрагент.ИНН+"/"+НаименованияНаДатуОрганизация.КПП;
				СведенияОДокументе.ПредставлениеГрузоотправителя = Выборка.Продавец.НаименованиеПолное;
				СведенияОДокументе.Грузоотправитель = Выборка.Продавец;
			Иначе
				//Евросиб - АСуслов 06.09.2023 14:16:12 #74705
				//(
				НаименованияНаДатуОрганизация = Справочники.Организации.НаименованияНаДату(Выборка.Организация, Выборка.ДатаДокумента, Выборка.Организация.НаименованиеПолное);
				//)
				//Евросиб - АСуслов 06.09.2023 14:16:14 #74705															
				СведенияОДокументе.ПредставлениеПоставщика = Выборка.Продавец.НаименованиеПолное+Символы.ПС+СтрокаАгента;
				СведенияОДокументе.АдресПоставщика = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Продавец,
				?(ТипЗнч(Выборка.Продавец)=Тип("СправочникСсылка.Контрагенты"),Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации),Выборка.ДатаДокумента,Истина);
				//Евросиб Коханенко Н.А. 05.12.2023 (( #78352 
				//СведенияОДокументе.ИННПоставщика = Выборка.ИННПоставщика+"/"+Выборка.КПППродавца;
				//СведенияОДокументе.ИННПоставщика = Выборка.ИННПоставщика+"/"+НаименованияНаДату.КПП;
				СведенияОДокументе.ИННПоставщика = Выборка.ИННПоставщика+"/"+ 
					?(ТипЗнч(Выборка.Продавец)=Тип("СправочникСсылка.Контрагенты"), Выборка.КПППродавца, НаименованияНаДату.КПП);  
				//Евросиб Коханенко Н.А. 05.12.2023 )) #78352 
			КонецЕсли;
		КонецЕсли;	
		
		//СведенияОДокументе.ПредставлениеГрузоотправителя = "-";
		//СведенияОДокументе.ПредставлениеГрузополучателя  = "-";
		СведенияОДокументе.ПредставлениеПокупателя = Выборка.Контрагент.НаименованиеПолное;
		СведенияОДокументе.ПоДокументу = "К платежно-расчетному документу №"+?(ЗначениеЗаполнено(СведенияОДокументе.НомерПлатежноРасчетногоДокумента),СведенияОДокументе.НомерПлатежноРасчетногоДокумента,"_______")
		+"от"+?(СведенияОДокументе.ДатаПлатежноРасчетногоДокумента<>Дата('00010101'),СведенияОДокументе.ДатаПлатежноРасчетногоДокумента,"_______");
		//Евросиб Каблов 20.01.2021 ( Ticket#0218605
		АвансыПоСФ = ТаблицаАвансов.НайтиСтроки(Новый Структура("СчетФактура", Выборка.Документ));
		Если АвансыПоСФ.Количество() > 0 Тогда
		    ПредставленияПП = Новый Массив;
			Для Каждого СтрокаТаблицыАвансов Из АвансыПоСФ Цикл
				ПредставленияПП.Добавить(СтрШаблон("№%1 от %2", СтрокаТаблицыАвансов.НомерПП, Формат(СтрокаТаблицыАвансов.ДатаПП, "ДФ=dd.MM.yyyy")));			
			КонецЦикла;
			ПредставленияППСтрокой = СтрСоединить(ПредставленияПП, ", ");
			СведенияОДокументе.ПоДокументу = "К платежно-расчетному документу " + ПредставленияППСтрокой;
		КонецЕсли; 
		//Евросиб Каблов 20.01.2021 )
		СведенияОДокументе.АдресПокупателя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Контрагент,Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,Выборка.ДатаДокумента,Истина);
        СведенияОДокументе.ИННПокупателя =Выборка.ИННПокупателя+"/"+Выборка.КПППокупателя;
		
		// Субботин TASK 72390 18.07.2023  Начало
		Если ТипЗнч(Выборка.ДокументОснование)= Тип("ДокументСсылка.РеализацияТоваровУслуг") тогда
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.ДокументОснование.ДоговорКонтрагента,"РасчетыВУсловныхЕдиницах") тогда
				ВалютаРегУчета = Константы.ВалютаРегламентированногоУчета.Получить();
				СведенияОДокументе.ВалютаНаименование = ВалютаРегУчета.НаименованиеПолное;
				СведенияОДокументе.ВалютаКод = ВалютаРегУчета.Код;
			КонецЕсли;
		КонецЕсли;
		// Субботин TASK 72390 18.07.2023  Начало	
		
		
		
		ТекстЗапроса = ПолучитьТекстЗапросаДляПечатиТаблицыСчетаФактуры(Выборка.ДокументОснование, Выборка.Документ);
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Документ",Выборка.ДокументОснование);
		Если ТипЗнч(Выборка.ДокументОснование) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
			Запрос.УстановитьПараметр("Покупатель",Выборка.Контрагент);
		КонецЕсли;
		
		//Евросиб(ДИТ), Беляев СЮ, US 103867 / TA 103872, 28-02-2025, начало (закомментировал блок кода)
		//Если ТипЗнч(Выборка.ДокументОснование) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") 
		//	И НЕ ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Документ, "Продавец")) Тогда
		//	ПолноеНаименованиеУслугиПеревозки = "";
		//	Для каждого Стр из Выборка.ДокументОснование.РасшифровкаУслугПоТС Цикл
		//		//НаименованиеУслугиПеревозки = ""+Стр.ПунктОтправления+" - "+Стр.ПунктНазначения + Символы.ПС + " " + Стр.Услуга.НаименованиеПолное;
		//		НаименованиеУслугиПеревозки = ""+Стр.ПунктОтправления+" - "+Стр.ПунктНазначения;
		//		Если СтрНайти(ПолноеНаименованиеУслугиПеревозки, НаименованиеУслугиПеревозки) = 0 Тогда
		//			ПолноеНаименованиеУслугиПеревозки = ПолноеНаименованиеУслугиПеревозки + ?(ПолноеНаименованиеУслугиПеревозки = "","",Символы.ПС) + НаименованиеУслугиПеревозки;
		//		КонецЕсли; 
		//	КонецЦикла;	
		//КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, US 103867 / TA 103872, 28-02-2025, конец
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл
			Строка = ТаблицаДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(Строка,РезультатЗапроса);
			//Строка.ТоварНаименование = СокрЛП(РезультатЗапроса.ТоварНаименование)+Символы.ПС+ПолноеНаименованиеУслугиПеревозки;
			//Евросиб(ДИТ), Беляев СЮ, US 103867 / TA 103872, 28-02-2025, начало
			Строка.ТоварНаименование = СокрЛП(РезультатЗапроса.ТоварНаименование);
			//Евросиб(ДИТ), Беляев СЮ, US 103867 / TA 103872, 28-02-2025, конец
			//Строка.Всего =?(РезультатЗапроса.СуммаВключаетНДС,РезультатЗапроса.Сумма, РезультатЗапроса.Сумма + РезультатЗапроса.СуммаНДС);
			//++ Зубов Ticket#0248450 01.11.2021 Вернем на родину расчет "Всего" с учетом СуммаВключаетНДС
			Строка.Всего =?(РезультатЗапроса.СуммаВключаетНДС,РезультатЗапроса.Сумма, РезультатЗапроса.Сумма + РезультатЗапроса.СуммаНДС);
			//Строка.Всего = РезультатЗапроса.Сумма;
			//-- Зубов Ticket#0248450 01.11.2021
		КонецЦикла;
		
		//как в акте
		// //если это особый клиент и у него выставлена галочка "СуммироватьСтроки", 
		// //то нужно просуммировать его строки (сворачиваем таблицу СтрокиДокументов)
		//Запрос1 = Новый Запрос;
		//Запрос1.Текст = "ВЫБРАТЬ
		//                |	ФормированиеФинДокументов.Ссылка КАК Ссылка
		//                |ИЗ
		//                |	Справочник.ФормированиеФинДокументов КАК ФормированиеФинДокументов
		//                |ГДЕ
		//                |	ФормированиеФинДокументов.Контрагент = &Контрагент
		//                |	И ФормированиеФинДокументов.СуммироватьСтроки";
		//Запрос1.УстановитьПараметр("Контрагент",Документ.Контрагент);
		//Если НЕ Запрос1.Выполнить().Пустой() Тогда
		//	ТаблицаДокумента.Свернуть("Номенклатура,ТоварНаименование,СтавкаНДС,Акциз,ЕдиницаИзмерения,ЕдиницаИзмеренияКод,ЕдиницаИзмеренияНаименование,ПредставлениеГТД,ПредставлениеСтраны,СтранаПроисхождения,СтранаПроисхожденияКод,ТоварКодТНВЭД","Количество,Цена,Всего,СуммаНДС,Стоимость,ЕдиницаИзмеренияОКЕИ");
		//КонецЕсли;
		
		СведенияОДокументе.ТаблицаДокумента = ТаблицаДокумента;
	КонецЦикла;	
	
	Возврат ТаблицаСведений;
КонецФункции

Функция ПолучитьТаблицуСведенийКорректировочногоСчетФактуры(Документ) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаСведений = ПечатьБухгалтерскихДокументов.ПолучитьОписаниеСчетФактуры();
	ТаблицаДокумента = ПечатьБухгалтерскихДокументов.ПолучитьОписаниеТаблицыКорректировочногоСчетФактуры();
	
	ТекстЗапроса = ПолучитьТекстЗапросаДляПечатиСчетаФактуры();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СведенияОДокументе = ТаблицаСведений.Добавить();
		ЗаполнитьЗначенияСвойств(СведенияОДокументе,Выборка);            
		//Евросиб - АСуслов 14.09.2022 11:49:32 #
		//(
		ФакторингСервер.ЗаполнитьПараметрыФакторинга(СведенияОДокументе);
		//)
		//Евросиб - АСуслов 14.09.2022 11:49:33 #
		//(Евросиб Максимова 13052021 #0232053 //согласно доработок по СФ по #30025		
		//Если Выборка.Продавец <>  Выборка.Организация Тогда
		//Евросиб ( Литвинов 21.01.2021 #30025
		//СтрокаАгента = "(Через " + Выборка.Организация.НаименованиеПолное+ ", ИНН/КПП "+Выборка.Организация.ИНН+"/"+Выборка.Организация.КПП+")";
		//СтрокаАгента = "(Через " + Справочники.Организации.НаименованияНаДату(Выборка.Организация, Выборка.ДатаДокумента).НаименованиеПолное+ ", ИНН/КПП "+Выборка.Организация.ИНН+"/"+Выборка.Организация.КПП+")";
		//)Евросиб Максимова 13052021 #0232053 //согласно доработок по СФ по #30025
		//Евросиб ) Литвинов 21.01.2021 #30025
		//		Иначе
		СТрокаАгента = "";
		//		КонецЕсли;
		//)Евросиб Максимова 13052021 #0232053 
		//(Евросиб Максимова 13052021 #0232053 //согласно доработок по СФ по #30025
		Если ЗначениеЗаполнено(Выборка.Продавец.ГоловнаяОрганизация) Тогда
			СведенияОДокументе.ПредставлениеПоставщика = Справочники.Организации.НаименованияНаДату(Выборка.Продавец.ГоловнаяОрганизация, Выборка.ДатаДокумента).НаименованиеПолное+Символы.ПС+СтрокаАгента;
			СведенияОДокументе.АдресПоставщика = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Продавец.ГоловнаяОрганизация,
			?(ТипЗнч(Выборка.Продавец)=Тип("СправочникСсылка.Контрагенты"),Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации),Выборка.ДатаДокумента,Истина);
			СведенияОДокументе.ИННПоставщика = Выборка.Продавец.ГоловнаяОрганизация.ИНН;
			//СведенияОДокументе.ПредставлениеГрузоотправителя = Справочники.Организации.НаименованияНаДату(Выборка.Продавец, Выборка.ДатаДокумента, Выборка.Продавец.НаименованиеПолное).НаименованиеПолное;
			СведенияОДокументе.ПредставлениеГрузоотправителя = Справочники.Организации.НаименованияНаДату(Выборка.Продавец, Выборка.ДатаДокумента, Выборка.Продавец.НаименованиеПолное).НаименованиеПолное;
			
			СведенияОДокументе.Грузоотправитель = Выборка.Продавец;
			
		Иначе
			//Евросиб ( Литвинов 21.01.2021 #30025
			//СведенияОДокументе.ПредставлениеПоставщика = Выборка.Продавец.НаименованиеПолное+Символы.ПС+СтрокаАгента;
			//Евросиб - АСуслов 06.09.2023 14:21:22 #74705
			//(
			//СведенияОДокументе.ПредставлениеПоставщика = Справочники.Организации.НаименованияНаДату(Выборка.Продавец, Выборка.ДатаДокумента).НаименованиеПолное+Символы.ПС+СтрокаАгента;
			НаименованияНаДату = Справочники.Организации.НаименованияНаДату(Выборка.Продавец, Выборка.ДатаДокумента);
			СведенияОДокументе.ПредставлениеПоставщика = НаименованияНаДату.НаименованиеПолное+Символы.ПС+СтрокаАгента;
			//)
			//Евросиб - АСуслов 06.09.2023 14:21:25 #74705
			//Евросиб ) Литвинов 21.01.2021 #30025
			СведенияОДокументе.АдресПоставщика = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Продавец,
			?(ТипЗнч(Выборка.Продавец)=Тип("СправочникСсылка.Контрагенты"),Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации),Выборка.ДатаДокумента,Истина);
			СведенияОДокументе.ПредставлениеГрузоотправителя = "-";      
			//Евросиб - АСуслов 06.09.2023 14:22:09 #74705
			//(
			//СведенияОДокументе.ИННПоставщика = Выборка.ИННПоставщика+"/"+Выборка.КПППродавца;		
			СведенияОДокументе.ИННПоставщика = Выборка.ИННПоставщика+"/"+НаименованияНаДату.КПП;		
			//)
			//Евросиб - АСуслов 06.09.2023 14:22:11 #74705
		КонецЕсли;	
		
		СведенияОДокументе.ПредставлениеГрузоотправителя = "Грузоотправитель и его адрес:";
		СведенияОДокументе.ПредставлениеГрузополучателя = "Грузополучатель и его адрес:" +"-";
		//		СведенияОДокументе.ПредставлениеГрузополучателя  = "-";
		//)Евросиб Максимова 13052021 #0232053 //
		СведенияОДокументе.ПредставлениеПокупателя = Выборка.Контрагент.НаименованиеПолное;
		//(Евросиб Максимова 13052021 #0232053 //согласно доработок по СФ по #30025		
		//СведенияОДокументе.ИННПоставщика = Выборка.ИННПоставщика+"/"+Выборка.КПППродавца;
		//)Евросиб Максимова 13052021 #0232053 //согласно доработок по СФ по #30025
		СведенияОДокументе.ПоДокументу = "К платежно-расчетному документу №"+?(ЗначениеЗаполнено(СведенияОДокументе.НомерПлатежноРасчетногоДокумента),СведенияОДокументе.НомерПлатежноРасчетногоДокумента,"_______")
		+"от"+?(СведенияОДокументе.ДатаПлатежноРасчетногоДокумента<>Дата('00010101'),СведенияОДокументе.ДатаПлатежноРасчетногоДокумента,"_______");
		СведенияОДокументе.АдресПокупателя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Контрагент,Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,Выборка.ДатаДокумента,Истина);
		//(Евросиб Максимова 13052021 #0232053 //согласно доработок по СФ по #30025				
		СведенияОДокументе.ИННПокупателя =Выборка.ИННПокупателя;		
		СведенияОДокументе.ДатаДоговора = Формат(СведенияОДокументе.ДатаДоговора, "ДФ=dd.MM.yyyy");
		//)Евросиб Максимова 13052021 #0232053 //согласно доработок по СФ по #30025		
		
		ТекстЗапроса = ПолучитьТекстЗапросаДляПечатиТаблицыКорректировочногоСчетаФактуры();
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Документ",Выборка.ДокументОснование);
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл
			Строка = ТаблицаДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(Строка,РезультатЗапроса);
			Строка.СтоимостьБезНДСДоИзменения = ?(РезультатЗапроса.СуммаВключаетНДС,РезультатЗапроса.СуммаДоИзменения-РезультатЗапроса.СуммаНДСДоИзменения,РезультатЗапроса.СуммаДоИзменения ) ;
			Строка.СтоимостьБезНДСПослеИзменения = ?(РезультатЗапроса.СуммаВключаетНДС,РезультатЗапроса.Сумма-РезультатЗапроса.СуммаНДСПослеИзменения,РезультатЗапроса.Сумма ) ;
			Строка.РазницаБезНДСУвеличение = ?(Строка.СтоимостьБезНДСПослеИзменения - Строка.СтоимостьБезНДСДоИзменения >0,Строка.СтоимостьБезНДСПослеИзменения - Строка.СтоимостьБезНДСДоИзменения,0);
			Строка.РазницаБезНДСУменьшение = ?(Строка.СтоимостьБезНДСДоИзменения - Строка.СтоимостьБезНДСПослеИзменения >0,Строка.СтоимостьБезНДСДоИзменения - Строка.СтоимостьБезНДСПослеИзменения,0);
			Строка.РазницаНДСУвеличение = ?(РезультатЗапроса.СуммаНДСПослеИзменения - РезультатЗапроса.СуммаНДСДоИзменения > 0,РезультатЗапроса.СуммаНДСПослеИзменения - РезультатЗапроса.СуммаНДСДоИзменения,0);
			Строка.РазницаНДСУменьшение = ?(РезультатЗапроса.СуммаНДСДоИзменения - РезультатЗапроса.СуммаНДСПослеИзменения > 0,РезультатЗапроса.СуммаНДСДоИзменения -РезультатЗапроса.СуммаНДСПослеИзменения,0);
			Строка.СтоимостьСНДСДоИзменения = ?(РезультатЗапроса.СуммаВключаетНДС,РезультатЗапроса.СуммаДоИзменения, РезультатЗапроса.СуммаДоИзменения + РезультатЗапроса.СуммаНДСДоИзменения);
			Строка.СтоимостьСНДСПослеИзменения = ?(РезультатЗапроса.СуммаВключаетНДС,РезультатЗапроса.Сумма, РезультатЗапроса.Сумма + РезультатЗапроса.СуммаНДСПослеИзменения);			
			Строка.РазницаСНДСУвеличение = ?(Строка.СтоимостьСНДСПослеИзменения - Строка.СтоимостьСНДСДоИзменения > 0, Строка.СтоимостьСНДСПослеИзменения - Строка.СтоимостьСНДСДоИзменения,0);
			Строка.РазницаСНДСУменьшение = ?(Строка.СтоимостьСНДСДоИзменения - Строка.СтоимостьСНДСПослеИзменения > 0, Строка.СтоимостьСНДСДоИзменения - Строка.СтоимостьСНДСПослеИзменения,0);
		КонецЦикла;
		
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0390492 , 18-03-2025, начало
		ПараметрыФФД = Справочники.ФормированиеФинДокументов.ПолучитьПараметрыФормированияФинансовыхДокументов(Неопределено,
		Неопределено,
		Неопределено,
		СведенияОДокументе.ПравилоФормирования);
		
		Если ПараметрыФФД <> Неопределено И ПараметрыФФД.СворачиватьСтрокиВПечатнойФормеАктаВключаяСтавку Тогда
			ТаблицаДокумента.Свернуть("Номенклатура, ТоварНаименование, ЕдиницаИзмерения, ЕдиницаИзмеренияКод, ЕдиницаИзмеренияНаименование, КоличествоДоИзменения, КоличествоПослеИзменения, СтавкаНДС, СтавкаНДСПослеИзменения,"
										+"ТоварКодТНВЭД, ТоварКодТНВЭДДоИзменения",
										"РазницаБезНДСУвеличение, РазницаБезНДСУменьшение, РазницаНДСУвеличение, РазницаНДСУменьшение, РазницаСНДСУвеличение, РазницаСНДСУменьшение, СтоимостьБезНДСДоИзменения,"
										+" СтоимостьБезНДСПослеИзменения, СтоимостьСНДСДоИзменения, СтоимостьСНДСПослеИзменения, СуммаНДСДоИзменения, СуммаНДСПослеИзменения, ЦенаДоИзменения, ЦенаПослеИзменения");
			
		КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0390492 , 18-03-2025, конец
		
		СведенияОДокументе.ТаблицаДокумента = ТаблицаДокумента;
	КонецЦикла;	
	
	Возврат ТаблицаСведений;
КонецФункции

Функция ПолучитьТекстЗапросаДляПечатиСчетаФактуры()
	ТекстЗапроса = 
	//Евросиб - АСуслов 15.09.2023 12:38:49 #74724
	//(
	"ВЫБРАТЬ
	|	МАКСИМУМ(ПодразделенияИсторияРеквизитов.Период) КАК Период,
	|	СчетФактураВыданный.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ПериодыРеквизитов
	|ИЗ
	|	Справочник.Подразделения.ИсторияРеквизитов КАК ПодразделенияИсторияРеквизитов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО ПодразделенияИсторияРеквизитов.Период <= СчетФактураВыданный.ДатаДокумента
	|			И ПодразделенияИсторияРеквизитов.Ссылка = СчетФактураВыданный.ДокументОснование.ПодразделениеОрганизации
	|			И (СчетФактураВыданный.Ссылка В (&Документ))
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетФактураВыданный.Ссылка
	|;
	//)
	//Евросиб - АСуслов 15.09.2023 12:38:51 #74724
	|
	|  ВЫБРАТЬ
	|	СчетФактураВыданный.Ссылка КАК Документ,
	|	СчетФактураВыданный.НомерДляПечати КАК Номер,
	|	СчетФактураВыданный.ДатаДокумента КАК ДатаДокумента,
	|	СчетФактураВыданный.Исправление КАК Исправление,
	|	СчетФактураВыданный.Контрагент КАК Контрагент,
	|	СчетФактураВыданный.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СчетФактураВыданный.ДоговорКонтрагента.ДоговорТранспортнойЭкспедиции КАК ДоговорТранспортнойЭкспедиции,
	|	СчетФактураВыданный.ВидСчетаФактуры КАК ВидСчетаФактуры,
	|	СчетФактураВыданный.ВалютнаяСумма КАК ВалютнаяСумма,
	|	СчетФактураВыданный.ДокументОснование КАК ДокументОснование,
//Евросиб Гудкова( 12.09.2020 Ticket№ 0204857
	//|	СчетФактураВыданный.ДокументОснование.Номер КАК НомерДокументаОснования,
	//|	СчетФактураВыданный.ДокументОснование.Дата КАК ДатаДокументаОснования,
	|	СчетФактураВыданный.ДокументОснование.НомерДляПечати КАК НомерДокументаОснования,
	|	СчетФактураВыданный.ДокументОснование.ДатаДокумента КАК ДатаДокументаОснования,
// Евросиб Гудкова) 	
	//	               |	СчетФактураВыданный.СтавкаНДС КАК СтавкаНДС,
	//Евросиб Каблов 14.07.2020 (
	|	СчетФактураВыданный.ДокументОснование.ПодразделениеОрганизации КАК Подразделение,
	|	СчетФактураВыданный.ДокументОснование.ПодразделениеОрганизации.ЦифровойИндексОбособленногоПодразделения КАК ПодразделениеЦифровойИндекс,
	|	СчетФактураВыданный.ДокументОснование.ПодразделениеОрганизации.КПП КАК ПодразделениеКПП,
	//Евросиб Каблов 14.07.2020 )
	|	СчетФактураВыданный.СуммаДокумента КАК Сумма,
	|	СчетФактураВыданный.СуммаНДСДокумента КАК СуммаНДС,
	|	СчетФактураВыданный.ДатаПлатежноРасчетногоДокумента КАК ДатаПлатежноРасчетногоДокумента,
	|	СчетФактураВыданный.НомерПлатежноРасчетногоДокумента КАК НомерПлатежноРасчетногоДокумента,
	|	СчетФактураВыданный.ВалютаДокумента КАК ВалютаДокумента,
	|	СчетФактураВыданный.НомерИсправления КАК НомерИсправления,
	//|	СчетФактураВыданный.Организация КАК Организация,
	|	ВЫБОР КОГДА СчетФактураВыданный.Организация.ГоловнаяОрганизация = Значение(Справочник.Организации.ПустаяСсылка) ТОГДА СчетФактураВыданный.Организация ИНАЧЕ СчетФактураВыданный.Организация.ГоловнаяОрганизация КОНЕЦ КАК Организация,
	|	СчетФактураВыданный.Автор КАК Ответственный,
	|	СчетФактураВыданный.НомерИсходногоДокумента КАК НомерИсходногоДокумента,
	|	СчетФактураВыданный.ДатаИсходногоДокумента КАК ДатаИсходногоДокумента,
	|	СчетФактураВыданный.НомерИсправляемогоКорректировочногоДокумента КАК НомерИсправляемогоКорректировочногоДокумента,
	|	СчетФактураВыданный.ДатаИсправляемогоКорректировочногоДокумента КАК ДатаИсправляемогоКорректировочногоДокумента,
	|	СчетФактураВыданный.СчетФактураБезНДС КАК СчетФактураБезНДС,
	|	СчетФактураВыданный.ИсправляемыйСчетФактура КАК ИсправляемыйСчетФактура,
	|	СчетФактураВыданный.ИсправляемыйСчетФактура.Номер КАК ИсправляемыйСчетФактураНомер,
	|	СчетФактураВыданный.ИсправляемыйСчетФактура.Дата КАК ИсправляемыйСчетФактураДата,
	|	СчетФактураВыданный.Комитент КАК Комитент,
	|	СчетФактураВыданный.СводныйКорректировочный КАК СводныйКорректировочный,
	|	СчетФактураВыданный.Руководитель КАК Руководитель,
	|	СчетФактураВыданный.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
	|	СчетФактураВыданный.ИдентификаторГосКонтракта КАК ИдентификаторГосКонтракта,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.ДокументОснование.ПоставщикВУ <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА СчетФактураВыданный.ДокументОснование.ПоставщикВУ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СчетФактураВыданный.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|					ТОГДА СчетФактураВыданный.Продавец
	|				ИНАЧЕ СчетФактураВыданный.Организация
	|			КОНЕЦ
	|	КОНЕЦ КАК Продавец,
	|	СчетФактураВыданный.СводныйКомиссионный КАК СводныйКомиссионный,
	|	СчетФактураВыданный.ДоговорКомитента КАК ДоговорКомитента,
	|	СчетФактураВыданный.ДоверенностьЗаРуководителя КАК ДоверенностьЗаРуководителя,
	|	СчетФактураВыданный.ДоверенностьЗаГлБухгалтера КАК ДоверенностьЗаГлБухгалтера,
	|	СчетФактураВыданный.СуммаДокумента КАК СуммаДокумента,
	|	СчетФактураВыданный.СуммаНДСДокумента КАК СуммаНДСДокумента,
	|	СчетФактураВыданный.Контрагент.КПП КАК КПППокупателя,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА СчетФактураВыданный.Продавец.КПП
	//Евросиб Каблов 14.07.2020 (
	//|		КОГДА ЕСТЬNULL(СчетФактураВыданный.ДокументОснование.ПодразделениеОрганизации.КПП, """") <> """"
	//|			ТОГДА СчетФактураВыданный.ДокументОснование.ПодразделениеОрганизации.КПП
	|		КОГДА ЕСТЬNULL(ПодразделенияИсторияРеквизитов.КПП, """") <> """"
	|			ТОГДА ПодразделенияИсторияРеквизитов.КПП
				   //)
				   //Евросиб - АСуслов 13.09.2023 15:00:28 #74705
	//Евросиб Каблов 14.07.2020 )
	|		ИНАЧЕ СчетФактураВыданный.Организация.КПП
	|	КОНЕЦ КАК КПППродавца,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА СчетФактураВыданный.Продавец.ИНН
	|		ИНАЧЕ СчетФактураВыданный.Организация.ИНН
	|	КОНЕЦ КАК ИННПоставщика,
	|	СчетФактураВыданный.Контрагент.ИНН КАК ИННПокупателя,
	|	СчетФактураВыданный.ВалютаДокумента.Код КАК ВалютаКод,
	|	СчетФактураВыданный.ВалютаДокумента.НаименованиеПолное КАК ВалютаНаименование,
	|	СчетФактураВыданный.ДоговорКонтрагента.Дата КАК ДатаДоговора,
	|	СчетФактураВыданный.ДоговорКонтрагента.Номер КАК НомерДоговора,
	|	СчетФактураВыданный.ДокументОснование.Грузоотправитель.НаименованиеПолное КАК ПредставлениеГрузоотправителя,
	|	СчетФактураВыданный.ДокументОснование.Грузополучатель.НаименованиеПолное КАК ПредставлениеГрузополучателя,
	|	СчетФактураВыданный.ДокументОснование.Грузополучатель КАК Грузополучатель,
	|	СчетФактураВыданный.ДокументОснование.Грузоотправитель КАК Грузоотправитель,
	|	ЕСТЬNULL(ИсторияФакторинга.ДоговорКомпанииФактор.ДополнительнаяИнформацияФакторинг, """") КАК ДополнительнаяИнформацияФакторинг,
	|	ВЫБОР
	|		КОГДА ИсторияФакторинга.ДоговорКомпанииФактор ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ  КАК Факторинг
	//Евросиб Каблов 02.06.2021 )
	//ДИТ, Беляев СЮ, Ticket#0297323/BUG65039, 01-02-2023, начало
	|	,ВЫБОР
	|		КОГДА СчетФактураВыданный.ДокументОснование ССЫЛКА Документ.КорректировкаРеализации
	|			ТОГДА СчетФактураВыданный.ДокументОснование.ИсходныйДокументРеализации.ПравилоФормирования
	|		ИНАЧЕ СчетФактураВыданный.ДокументОснование.ПравилоФормирования
	|	КОНЕЦ КАК ПравилоФормирования
	//ДИТ, Беляев СЮ, Ticket#0297323/BUG65039, 01-02-2023, конец
	// Евросиб(ДИТ) BUG 86430 ТА 86431 Сержантова А.С. Начало: 06.06.2024
	|	,СчетФактураВыданный.ДоговорКонтрагента КАК Основание
	// Евросиб(ДИТ) BUG 86430 ТА 86431 Сержантова А.С. Конец: 06.06.2024
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	//Евросиб Каблов 02.06.2021 ( Ticket#0230677
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПериодыРеквизитов КАК ВТ_ПериодыРеквизитов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Подразделения.ИсторияРеквизитов КАК ПодразделенияИсторияРеквизитов
	|			ПО ВТ_ПериодыРеквизитов.Период = ПодразделенияИсторияРеквизитов.Период
	|				И ВТ_ПериодыРеквизитов.Ссылка.ДокументОснование.ПодразделениеОрганизации = ПодразделенияИсторияРеквизитов.Ссылка
	|		ПО СчетФактураВыданный.Ссылка = ВТ_ПериодыРеквизитов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияФакторинга КАК ИсторияФакторинга
	|		ПО СчетФактураВыданный.ДоговорКонтрагента = ИсторияФакторинга.Договор
	|			И СчетФактураВыданный.ДатаДокумента >= ИсторияФакторинга.НачалоФакторинга
	|			И ИсторияФакторинга.НачалоФакторинга <> ДАТАВРЕМЯ(1, 1, 1)
	|			И (ИсторияФакторинга.ОкончаниеФакторинга = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ СчетФактураВыданный.ДатаДокумента <= ИсторияФакторинга.ОкончаниеФакторинга)
	//Евросиб Каблов 02.06.2021 )
	|ГДЕ
	|	СчетФактураВыданный.Ссылка = &Документ";	
	Возврат ТекстЗапроса;
КонецФункции

Функция ПолучитьТекстЗапросаДляПечатиТаблицыСчетаФактуры(ДокументОснование, СчФ)
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		               |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
		               |	РеализацияТоваровУслугТовары.Номенклатура.КодТНВЭД КАК НоменклатураКодТНВЭД,
		               |	РеализацияТоваровУслугТовары.Номенклатура.НаименованиеПолное КАК ТоварНаименование,
		               |	РеализацияТоваровУслугТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		               |	РеализацияТоваровУслугТовары.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
		               |	РеализацияТоваровУслугТовары.ЕдиницаИзмерения.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
		               |	РеализацияТоваровУслугТовары.Количество КАК Количество,
		               |	ВЫБОР
		               |		КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС
		               |			ТОГДА (РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС) / РеализацияТоваровУслугТовары.Количество
		               |		ИНАЧЕ РеализацияТоваровУслугТовары.Цена
		               |	КОНЕЦ КАК Цена,
		               |	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
		               |	РеализацияТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
		               |	РеализацияТоваровУслугТовары.СуммаНДС КАК СуммаНДС,
		               |	ВЫБОР
		               |		КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС
		               |			ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
		               |		ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
		               |	КОНЕЦ КАК Стоимость,
		               |	РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
		               |	РеализацияТоваровУслугТовары.ЕдиницаИзмерения.КодИзОКЕИ КАК ЕдиницаИзмеренияОКЕИ,
		               |	NULL КАК Вагоны,
		               |	NULL КАК Контейнеры
		               |ИЗ
		               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		               |ГДЕ
		               |	РеализацияТоваровУслугТовары.Ссылка = &Документ
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	РеализацияТоваровУслугУслуги.Номенклатура,
		               |	NULL,
		               |	РеализацияТоваровУслугУслуги.Содержание,
		               |	РеализацияТоваровУслугУслуги.ЕдиницаИзмерения,
		               |	РеализацияТоваровУслугУслуги.ЕдиницаИзмерения.Код,
		               |	РеализацияТоваровУслугУслуги.ЕдиницаИзмерения.НаименованиеПолное,
		               |	РеализацияТоваровУслугУслуги.Количество,
		               |	ВЫБОР
		               |		КОГДА ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах
		               |			ТОГДА ВЫБОР
		               |					КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
		               |						ТОГДА РеализацияТоваровУслугУслуги.СуммаБезНалога / РеализацияТоваровУслугУслуги.Количество
		               |					ИНАЧЕ РеализацияТоваровУслугУслуги.СуммаБезНалога / РеализацияТоваровУслугУслуги.Количество
		               |				КОНЕЦ
		               |		ИНАЧЕ ВЫБОР
		               |				КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
		               |					ТОГДА (РеализацияТоваровУслугУслуги.Сумма - РеализацияТоваровУслугУслуги.СуммаНДС) / РеализацияТоваровУслугУслуги.Количество
		               |				ИНАЧЕ РеализацияТоваровУслугУслуги.Цена
		               |			КОНЕЦ
		               |	КОНЕЦ,
		               |	ВЫБОР
		               |		КОГДА ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах
		               |			ТОГДА ВЫБОР
		               |					КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
		               |						ТОГДА РеализацияТоваровУслугУслуги.ВсегоСНДС
		               |					ИНАЧЕ РеализацияТоваровУслугУслуги.СуммаБезНалога
		               |				КОНЕЦ
		               |		ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
		               |	КОНЕЦ,
		               |	РеализацияТоваровУслугУслуги.СтавкаНДС,
		               |	ВЫБОР
		               |		КОГДА ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах
		               |			ТОГДА ВЫБОР
		               |					КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
		               |						ТОГДА РеализацияТоваровУслугУслуги.СуммаНДСРуб
		               |					ИНАЧЕ РеализацияТоваровУслугУслуги.СуммаНДСРуб
		               |				КОНЕЦ
		               |		ИНАЧЕ РеализацияТоваровУслугУслуги.СуммаНДС
		               |	КОНЕЦ,
		               |	ВЫБОР
		               |		КОГДА ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах
		               |			ТОГДА ВЫБОР
		               |					КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
		               |						ТОГДА РеализацияТоваровУслугУслуги.СуммаБезНалога
		               |					ИНАЧЕ РеализацияТоваровУслугУслуги.СуммаБезНалога
		               |				КОНЕЦ
		               |		ИНАЧЕ ВЫБОР
		               |				КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
		               |					ТОГДА РеализацияТоваровУслугУслуги.Сумма - РеализацияТоваровУслугУслуги.СуммаНДС
		               |				ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
		               |			КОНЕЦ
		               |	КОНЕЦ,
		               |	РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС,
		               |	РеализацияТоваровУслугУслуги.ЕдиницаИзмерения.КодИзОКЕИ,
		               |	РеализацияТоваровУслугУслуги.СписокТС,
		               |	РеализацияТоваровУслугУслуги.СписокТЕ
		               |ИЗ
		               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		               |		ПО РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
		               |ГДЕ
		               |	РеализацияТоваровУслугУслуги.Ссылка = &Документ
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	РеализацияТоваровУслугАгентскиеУслуги.Номенклатура,
		               |	NULL,
		               |	РеализацияТоваровУслугАгентскиеУслуги.Содержание,
		               |	NULL,
		               |	NULL,
		               |	NULL,
		               |	РеализацияТоваровУслугАгентскиеУслуги.Количество,
		               |	РеализацияТоваровУслугАгентскиеУслуги.Цена,
		               |	РеализацияТоваровУслугАгентскиеУслуги.Сумма,
		               |	РеализацияТоваровУслугАгентскиеУслуги.СтавкаНДС,
		               |	РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС,
		               |	ВЫБОР
		               |		КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС
		               |			ТОГДА РеализацияТоваровУслугАгентскиеУслуги.Сумма - РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС
		               |		ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма
		               |	КОНЕЦ,
		               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС,
		               |	NULL,
		               |	NULL,
		               |	NULL
		               |ИЗ
		               |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
		               |ГДЕ
		               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка = &Документ";
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	КорректировкаРеализацииТовары.Номенклатура КАК Номенклатура,
		               |	КорректировкаРеализацииТовары.Номенклатура.НаименованиеПолное КАК ТоварНаименование,
		               |	КорректировкаРеализацииТовары.Номенклатура.КодТНВЭД КАК ТоварКодТНВЭД,
		               |	КорректировкаРеализацииТовары.Количество КАК Количество,
		               |	ВЫБОР
		               |		КОГДА КорректировкаРеализацииТовары.Количество = 0
		               |			ТОГДА 0
		               |		КОГДА КорректировкаРеализацииТовары.Ссылка.СуммаВключаетНДС
		               |			ТОГДА (КорректировкаРеализацииТовары.Сумма - КорректировкаРеализацииТовары.СуммаНДС) / КорректировкаРеализацииТовары.Количество
		               |		ИНАЧЕ КорректировкаРеализацииТовары.Цена
		               |	КОНЕЦ КАК Цена,
		               |	КорректировкаРеализацииТовары.Сумма КАК Сумма,
		               |	КорректировкаРеализацииТовары.СтавкаНДС КАК СтавкаНДС,
		               |	КорректировкаРеализацииТовары.СуммаНДС КАК СуммаНДС,
		               |	ВЫБОР
		               |		КОГДА КорректировкаРеализацииТовары.Ссылка.СуммаВключаетНДС
		               |			ТОГДА КорректировкаРеализацииТовары.Сумма - КорректировкаРеализацииТовары.СуммаНДС
		               |		ИНАЧЕ КорректировкаРеализацииТовары.Сумма
		               |	КОНЕЦ КАК Стоимость,
		               |	КорректировкаРеализацииТовары.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС
		               |ИЗ
		               |	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
		               |ГДЕ
		               |	КорректировкаРеализацииТовары.Ссылка = &Документ
		               //Евросиб(ДИТ), Беляев СЮ, BUG 104438 / TA 104468, 07-03-2025, начало
		               |	И НЕ (КорректировкаРеализацииТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки) И КорректировкаРеализацииТовары.Сумма = 0)
		               //Евросиб(ДИТ), Беляев СЮ, BUG 104438 / TA 104468, 07-03-2025, конец
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	КорректировкаРеализацииУслуги.Номенклатура,
		               |	КорректировкаРеализацииУслуги.Содержание,
		               |	NULL,
		               |	КорректировкаРеализацииУслуги.Количество,
		               |	ВЫБОР
		               |		КОГДА КорректировкаРеализацииУслуги.Количество = 0
		               |			ТОГДА 0
		               |		КОГДА КорректировкаРеализацииУслуги.Ссылка.СуммаВключаетНДС
		               |			ТОГДА (КорректировкаРеализацииУслуги.Сумма - КорректировкаРеализацииУслуги.СуммаНДС) / КорректировкаРеализацииУслуги.Количество
		               |		ИНАЧЕ КорректировкаРеализацииУслуги.Цена
		               |	КОНЕЦ,
		               |	КорректировкаРеализацииУслуги.Сумма,
		               |	КорректировкаРеализацииУслуги.СтавкаНДС,
		               |	КорректировкаРеализацииУслуги.СуммаНДС,
		               |	ВЫБОР
		               |		КОГДА КорректировкаРеализацииУслуги.Ссылка.СуммаВключаетНДС
		               |			ТОГДА КорректировкаРеализацииУслуги.Сумма - КорректировкаРеализацииУслуги.СуммаНДС
		               |		ИНАЧЕ КорректировкаРеализацииУслуги.Сумма
		               |	КОНЕЦ,
		               |	КорректировкаРеализацииУслуги.Ссылка.СуммаВключаетНДС
		               |ИЗ
		               |	Документ.КорректировкаРеализации.Услуги КАК КорректировкаРеализацииУслуги
		               |ГДЕ
		               |	КорректировкаРеализацииУслуги.Ссылка = &Документ
		               //Евросиб(ДИТ), Беляев СЮ, BUG 104438 / TA 104468, 07-03-2025, начало
		               |	И НЕ (КорректировкаРеализацииУслуги.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки) И КорректировкаРеализацииУслуги.Сумма = 0)
		               //Евросиб(ДИТ), Беляев СЮ, BUG 104438 / TA 104468, 07-03-2025, конец
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	КорректировкаРеализацииАгентскиеУслуги.Номенклатура,
		               |	КорректировкаРеализацииАгентскиеУслуги.Содержание,
		               |	NULL,
		               |	КорректировкаРеализацииАгентскиеУслуги.Количество,
		               |	ВЫБОР
		               |		КОГДА КорректировкаРеализацииАгентскиеУслуги.Количество = 0
		               |			ТОГДА 0
		               |		КОГДА КорректировкаРеализацииАгентскиеУслуги.Ссылка.СуммаВключаетНДС
		               |			ТОГДА (КорректировкаРеализацииАгентскиеУслуги.Сумма - КорректировкаРеализацииАгентскиеУслуги.СуммаНДС) / КорректировкаРеализацииАгентскиеУслуги.Количество
		               |		ИНАЧЕ КорректировкаРеализацииАгентскиеУслуги.Цена
		               |	КОНЕЦ,
		               |	КорректировкаРеализацииАгентскиеУслуги.Сумма,
		               |	КорректировкаРеализацииАгентскиеУслуги.СтавкаНДС,
		               |	КорректировкаРеализацииАгентскиеУслуги.СуммаНДС,
		               |	ВЫБОР
		               |		КОГДА КорректировкаРеализацииАгентскиеУслуги.Ссылка.СуммаВключаетНДС
		               |			ТОГДА КорректировкаРеализацииАгентскиеУслуги.Сумма - КорректировкаРеализацииАгентскиеУслуги.СуммаНДС
		               |		ИНАЧЕ КорректировкаРеализацииАгентскиеУслуги.Сумма
		               |	КОНЕЦ,
		               |	КорректировкаРеализацииАгентскиеУслуги.Ссылка.СуммаВключаетНДС
		               |ИЗ
		               |	Документ.КорректировкаРеализации.АгентскиеУслуги КАК КорректировкаРеализацииАгентскиеУслуги
		               |ГДЕ
		               |	КорректировкаРеализацииАгентскиеУслуги.Ссылка = &Документ
		               //Евросиб(ДИТ), Беляев СЮ, BUG 104438 / TA 104468, 07-03-2025, начало
		               |	И НЕ (КорректировкаРеализацииАгентскиеУслуги.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки) И КорректировкаРеализацииАгентскиеУслуги.Сумма = 0)";
		               //Евросиб(ДИТ), Беляев СЮ, BUG 104438 / TA 104468, 07-03-2025, конец
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") и ДокументОснование.ВидОперации = Перечисления.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОЗакупках и ЗначениеЗаполнено(СчФ.Продавец) Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ОтчетКомитентуОПродажахПоставщики.Партия КАК Партия,
		|	ОтчетКомитентуОПродажахПоставщики.КлючСтроки КАК КлючСтроки,
		|	ОтчетКомитентуОПродажахПоставщики.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ПервичныйДокументПокупателю
		|ИЗ
		|	Документ.ОтчетКомитентуОПродажах.Поставщики КАК ОтчетКомитентуОПродажахПоставщики
		|ГДЕ
		|	ОтчетКомитентуОПродажахПоставщики.Ссылка = &Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ПоступлениеТоваровУслугТовары.Ссылка КАК Ссылка,
		//|	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
		//|	ПоступлениеТоваровУслугТовары.Номенклатура.НаименованиеПолное КАК НоменклатураНаименованиеПолное,
		//|	"""" КАК ГУИДПТУ
		//|ПОМЕСТИТЬ НоменклатураССодержанием
		//|ИЗ
		//|	ПервичныйДокументПокупателю КАК ПервичныйДокументПокупателю
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		//|		ПО ПервичныйДокументПокупателю.Партия = ПоступлениеТоваровУслугТовары.Ссылка
		//|
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		//|ВЫБРАТЬ
		//|	ПоступлениеТоваровУслугУслуги.Ссылка,
		//|	ПоступлениеТоваровУслугУслуги.Номенклатура,
		//|	ПоступлениеТоваровУслугУслуги.Содержание,
		//|	ПоступлениеТоваровУслугУслуги.ГУИДПТУ
		//|ИЗ
		//|	ПервичныйДокументПокупателю КАК ПервичныйДокументПокупателю
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
		//|		ПО ПервичныйДокументПокупателю.Партия = ПоступлениеТоваровУслугУслуги.Ссылка
		//|
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0385643, 11-02-2025, начало
		|ВЫБРАТЬ
		|	КорректировкаПоступления.Номенклатура,
		|	КорректировкаПоступления.Содержание,
		|	КорректировкаПоступления.ГУИДПТУ
		|ПОМЕСТИТЬ ВТ_КоррПТУ
		|ИЗ
		|	ПервичныйДокументПокупателю КАК ПервичныйДокументПокупателю
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления.Услуги КАК КорректировкаПоступления
		|		ПО ПервичныйДокументПокупателю.Партия = КорректировкаПоступления.Ссылка.ИсходныйДокументПоступления	
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	ПоступлениеТоваровУслугТовары.Номенклатура.НаименованиеПолное КАК НоменклатураНаименованиеПолное,
		|	"""" КАК ГУИДПТУ
		|ПОМЕСТИТЬ НоменклатураССодержанием
		|ИЗ
		|	ПервичныйДокументПокупателю КАК ПервичныйДокументПокупателю
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|		ПО ПервичныйДокументПокупателю.Партия = ПоступлениеТоваровУслугТовары.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПоступлениеТоваровУслугУслуги.Номенклатура,
		|	ПоступлениеТоваровУслугУслуги.Содержание,
		|	ПоступлениеТоваровУслугУслуги.ГУИДПТУ
		|ИЗ
		|	ПервичныйДокументПокупателю КАК ПервичныйДокументПокупателю
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
		|		ПО ПервичныйДокументПокупателю.Партия = ПоступлениеТоваровУслугУслуги.Ссылка
		|ГДЕ	
		|	НЕ ПоступлениеТоваровУслугУслуги.ГУИДПТУ В (ВЫБРАТЬ ВТ_КоррПТУ.ГУИДПТУ ИЗ ВТ_КоррПТУ КАК ВТ_КоррПТУ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_КоррПТУ.Номенклатура,
		|	ВТ_КоррПТУ.Содержание,
		|	ВТ_КоррПТУ.ГУИДПТУ
		|ИЗ
		|	ВТ_КоррПТУ КАК ВТ_КоррПТУ
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0385643, 11-02-2025, конец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтчетКомитентуОПродажахТовары.Номенклатура КАК Номенклатура,
		|	ОтчетКомитентуОПродажахТовары.Номенклатура.КодТНВЭД КАК ТоварКодТНВЭД,
		//|	ВЫБОР
		//|		КОГДА ОтчетКомитентуОПродажахТовары.Номенклатура.Услуга
		//|			ТОГДА ОтчетКомитентуОПродажахТовары.Содержание
		//|		ИНАЧЕ ОтчетКомитентуОПродажахТовары.Номенклатура.НаименованиеПолное
		//|	КОНЕЦ КАК ТоварНаименование,
		|	НоменклатураССодержанием.НоменклатураНаименованиеПолное КАК ТоварНаименование,
		|	ОтчетКомитентуОПродажахТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ОтчетКомитентуОПродажахТовары.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
		|	ОтчетКомитентуОПродажахТовары.ЕдиницаИзмерения.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
		|	ОтчетКомитентуОПродажахТовары.Количество КАК Количество,
		|	ОтчетКомитентуОПродажахТовары.Цена КАК Цена,
		|	ОтчетКомитентуОПродажахТовары.Сумма КАК Сумма,
		|	ОтчетКомитентуОПродажахТовары.СтавкаНДС КАК СтавкаНДС,
		|	ОтчетКомитентуОПродажахТовары.СуммаНДС КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС
		|			ТОГДА ОтчетКомитентуОПродажахТовары.Сумма - ОтчетКомитентуОПродажахТовары.СуммаНДС
		|		ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма
		|	КОНЕЦ КАК Стоимость,
		|	ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС
		|ИЗ
		|	ПервичныйДокументПокупателю КАК ПервичныйДокументПокупателю
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ НоменклатураССодержанием КАК НоменклатураССодержанием
		|			ПО ОтчетКомитентуОПродажахТовары.Номенклатура = НоменклатураССодержанием.Номенклатура
		|				И ОтчетКомитентуОПродажахТовары.ГУИДПТУ = НоменклатураССодержанием.ГУИДПТУ
		|		ПО ПервичныйДокументПокупателю.Ссылка = ОтчетКомитентуОПродажахТовары.Ссылка
		|			И ПервичныйДокументПокупателю.КлючСтроки = ОтчетКомитентуОПродажахТовары.КлючСтроки
		|ГДЕ
		|	ОтчетКомитентуОПродажахТовары.Ссылка = &Документ";
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") и не ЗначениеЗаполнено(СчФ.Продавец) Тогда//ДокументОснование.ВидОперации = Перечисления.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОЗакупках и не ЗначениеЗаполнено(СчФ.Продавец) Тогда
		//ТекстЗапроса = 
		//"ВЫБРАТЬ
		//|	ОтчетКомитентуОПродажах.УслугаПоВознаграждению КАК Номенклатура,
		//|	ОтчетКомитентуОПродажах.УслугаПоВознаграждению.НаименованиеПолное КАК ТоварНаименование,
		//|	ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения КАК СтавкаНДС,
		//|	1 КАК Количество,
		//|   ОтчетКомитентуОПродажах.СуммаНДСВознаграждения КАК СуммаНДС,
		////|  ОтчетКомитентуОПродажах.СуммаВознаграждения - ВЫБОР КОГДА ОтчетКомитентуОПродажах.СуммаВознагражденияВключаетНДС ТОГДА 0 ИНАЧЕ ОтчетКомитентуОПродажах.СуммаНДСВознаграждения КОНЕЦ КАК Стоимость,
		////ДИТ, Беляев СЮ, Ticket#0324831, 13-09-2023, начало
		//|  ОтчетКомитентуОПродажах.СуммаВознаграждения - ОтчетКомитентуОПродажах.СуммаНДСВознаграждения КАК Стоимость,
		////ДИТ, Беляев СЮ, Ticket#0324831, 13-09-2023, конец
		//// ДИТ Евсенкин М.А. 0289939 14.11.2022г. Начало
		//|	ВЫБОР
		//|		КОГДА ОтчетКомитентуОПродажах.СуммаВознагражденияВключаетНДС
		//|			ТОГДА ОтчетКомитентуОПродажах.СуммаВознаграждения
		//|		ИНАЧЕ ОтчетКомитентуОПродажах.СуммаВознаграждения - ОтчетКомитентуОПродажах.СуммаНДСВознаграждения
		//|	КОНЕЦ КАК Сумма,
		////|   ОтчетКомитентуОПродажах.СуммаВознаграждения КАК Сумма,
		//|	ОтчетКомитентуОПродажах.СуммаВознагражденияВключаетНДС КАК СуммаВключаетНДС,
		////|	ОтчетКомитентуОПродажах.СуммаВключаетНДС КАК СуммаВключаетНДС, 
		//// ДИТ Евсенкин М.А. 0289939 14.11.2022г. Конец
		////|  ОтчетКомитентуОПродажах.СуммаВознаграждения - ВЫБОР КОГДА ОтчетКомитентуОПродажах.СуммаВознагражденияВключаетНДС ТОГДА 0 ИНАЧЕ ОтчетКомитентуОПродажах.СуммаНДСВознаграждения КОНЕЦ КАК Цена
		////ДИТ, Беляев СЮ, Ticket#0324831, 13-09-2023, начало
		//|  ОтчетКомитентуОПродажах.СуммаВознаграждения - ОтчетКомитентуОПродажах.СуммаНДСВознаграждения КАК Цена
		////ДИТ, Беляев СЮ, Ticket#0324831, 13-09-2023, конец
		//|ИЗ
		//|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
		//|ГДЕ
		//|	ОтчетКомитентуОПродажах.Ссылка = &Документ";
		
		//Евросиб(ДИТ), Беляев СЮ, US 103867 / TA 103872, 28-02-2025, начало
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ОтчетКомитентуОПродажах.УслугаПоВознаграждению КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА ОтчетКомитентуОПродажахТовары.СодержаниеУслугиВознаграждения = """"
		|			ТОГДА ВЫРАЗИТЬ(ОтчетКомитентуОПродажах.УслугаПоВознаграждению.НаименованиеПолное КАК СТРОКА(1000))
		|		ИНАЧЕ ОтчетКомитентуОПродажахТовары.СодержаниеУслугиВознаграждения
		|	КОНЕЦ КАК ТоварНаименование,
		|	ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения КАК СтавкаНДС,
		|	1 КАК Количество,
		|	СУММА(ОтчетКомитентуОПродажахТовары.СуммаНДСВознаграждения) КАК СуммаНДС,
		|	СУММА(ОтчетКомитентуОПродажахТовары.СуммаВознаграждения) КАК Стоимость,
		|	СУММА(ОтчетКомитентуОПродажахТовары.СуммаВознаграждения + ВЫБОР
		|			КОГДА ОтчетКомитентуОПродажах.СуммаВознагражденияВключаетНДС
		|				ТОГДА ОтчетКомитентуОПродажахТовары.СуммаНДСВознаграждения
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Сумма,
		|	ОтчетКомитентуОПродажах.СуммаВознагражденияВключаетНДС КАК СуммаВключаетНДС,
		|	СУММА(ОтчетКомитентуОПродажахТовары.СуммаВознаграждения) КАК Цена
		|ИЗ
		|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
		|		ПО ОтчетКомитентуОПродажах.Ссылка = ОтчетКомитентуОПродажахТовары.Ссылка
		|ГДЕ
		|	ОтчетКомитентуОПродажах.Ссылка = &Документ
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтчетКомитентуОПродажах.УслугаПоВознаграждению,
		|	ВЫБОР
		|		КОГДА ОтчетКомитентуОПродажахТовары.СодержаниеУслугиВознаграждения = """"
		|			ТОГДА ВЫРАЗИТЬ(ОтчетКомитентуОПродажах.УслугаПоВознаграждению.НаименованиеПолное КАК СТРОКА(1000))
		|		ИНАЧЕ ОтчетКомитентуОПродажахТовары.СодержаниеУслугиВознаграждения
		|	КОНЕЦ,
		|	ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения,
		|	ОтчетКомитентуОПродажах.СуммаВознагражденияВключаетНДС";
		//Евросиб(ДИТ), Беляев СЮ, US 103867 / TA 103872, 28-02-2025, конец
	
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда//ДокументОснование.ВидОперации = Перечисления.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОЗакупках и не ЗначениеЗаполнено(СчФ.Продавец) Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		|	ОтчетКомиссионераОПродажахПокупатели.КлючСтроки КАК КлючСтроки,
		|	ОтчетКомиссионераОПродажахПокупатели.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ТЗПокупатели
		|ИЗ
		|	Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ОтчетКомиссионераОПродажахПокупатели
		|ГДЕ
		|	ОтчетКомиссионераОПродажахПокупатели.Ссылка = &Документ
		|	И ОтчетКомиссионераОПродажахПокупатели.Покупатель = &Покупатель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтчетКомиссионераОПродажахТовары.Номенклатура КАК Номенклатура,
		|	ОтчетКомиссионераОПродажахТовары.Номенклатура.КодТНВЭД КАК НоменклатураКодТНВЭД,
		|	ОтчетКомиссионераОПродажахТовары.Номенклатура.НаименованиеПолное КАК ТоварНаименование,
		|	ОтчетКомиссионераОПродажахТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ОтчетКомиссионераОПродажахТовары.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
		|	ОтчетКомиссионераОПродажахТовары.Номенклатура.ЕдиницаИзмерения.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
		|	ОтчетКомиссионераОПродажахТовары.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА ОтчетКомиссионераОПродажахТовары.Ссылка.СуммаВключаетНДС
		|			ТОГДА (ОтчетКомиссионераОПродажахТовары.Сумма - ОтчетКомиссионераОПродажахТовары.СуммаНДС) / ОтчетКомиссионераОПродажахТовары.Количество
		|		ИНАЧЕ ОтчетКомиссионераОПродажахТовары.Цена
		|	КОНЕЦ КАК Цена,
		|	ОтчетКомиссионераОПродажахТовары.Сумма КАК Сумма,
		|	ОтчетКомиссионераОПродажахТовары.СтавкаНДС КАК СтавкаНДС,
		|	ОтчетКомиссионераОПродажахТовары.СуммаНДС КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА ОтчетКомиссионераОПродажахТовары.Ссылка.СуммаВключаетНДС
		|			ТОГДА ОтчетКомиссионераОПродажахТовары.Сумма - ОтчетКомиссионераОПродажахТовары.СуммаНДС
		|		ИНАЧЕ ОтчетКомиссионераОПродажахТовары.Сумма
		|	КОНЕЦ КАК Стоимость,
		|	ОтчетКомиссионераОПродажахТовары.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС
		|ИЗ
		|	ТЗПокупатели КАК ТЗПокупатели
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах.Товары КАК ОтчетКомиссионераОПродажахТовары
		|		ПО ТЗПокупатели.КлючСтроки = ОтчетКомиссионераОПродажахТовары.КлючСтроки
		|			И ТЗПокупатели.Ссылка = ОтчетКомиссионераОПродажахТовары.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОтчетКомиссионераОПродажахУслуги.Номенклатура,
		|	NULL,
		|	ОтчетКомиссионераОПродажахУслуги.Содержание,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ОтчетКомиссионераОПродажахУслуги.Количество,
		|	ВЫБОР
		|		КОГДА ОтчетКомиссионераОПродажахУслуги.Ссылка.СуммаВключаетНДС
		|			ТОГДА (ОтчетКомиссионераОПродажахУслуги.Сумма - ОтчетКомиссионераОПродажахУслуги.СуммаНДС) / ОтчетКомиссионераОПродажахУслуги.Количество
		|		ИНАЧЕ ОтчетКомиссионераОПродажахУслуги.Цена
		|	КОНЕЦ,
		|	ОтчетКомиссионераОПродажахУслуги.Сумма,
		|	ОтчетКомиссионераОПродажахУслуги.СтавкаНДС,
		|	ОтчетКомиссионераОПродажахУслуги.СуммаНДС,
		|	ВЫБОР
		|		КОГДА ОтчетКомиссионераОПродажахУслуги.Ссылка.СуммаВключаетНДС
		|			ТОГДА ОтчетКомиссионераОПродажахУслуги.Сумма - ОтчетКомиссионераОПродажахУслуги.СуммаНДС
		|		ИНАЧЕ ОтчетКомиссионераОПродажахУслуги.Сумма
		|	КОНЕЦ,
		|	ОтчетКомиссионераОПродажахУслуги.Ссылка.СуммаВключаетНДС
		|ИЗ
		|	Документ.ОтчетКомиссионераОПродажах.Услуги КАК ОтчетКомиссионераОПродажахУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЗПокупатели КАК ТЗПокупатели
		|		ПО ОтчетКомиссионераОПродажахУслуги.Ссылка = ТЗПокупатели.Ссылка
		|			И ОтчетКомиссионераОПродажахУслуги.КлючСтроки = ТЗПокупатели.КлючСтроки";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
КонецФункции

Функция ПолучитьТекстЗапросаДляПечатиТаблицыКорректировочногоСчетаФактуры()
	ТекстЗапроса = "ВЫБРАТЬ
	               |	КорректировкаРеализацииТовары.Ссылка КАК ДокументОснование,
	               |	КорректировкаРеализацииТовары.Номенклатура КАК Номенклатура,
	               |	КорректировкаРеализацииТовары.Номенклатура.НаименованиеПолное КАК ТоварНаименование,
	               |	КорректировкаРеализацииТовары.Номенклатура.КодТНВЭД КАК ТоварКодТНВЭД,
	               |	КорректировкаРеализацииТовары.Количество КАК КоличествоПослеИзменения,
	               |	КорректировкаРеализацииТовары.КоличествоДоИзменения КАК КоличествоДоИзменения,
	               |	КорректировкаРеализацииТовары.Цена КАК ЦенаПослеИзменения,
	               |	КорректировкаРеализацииТовары.ЦенаДоИзменения КАК ЦенаДоИзменения,
	               |	КорректировкаРеализацииТовары.Сумма КАК Сумма,
	               |	КорректировкаРеализацииТовары.СуммаДоИзменения КАК СуммаДоИзменения,
				   //|	КорректировкаРеализацииТовары.СтавкаНДС КАК СтавкаНДС,
				   //|	КорректировкаРеализацииТовары.СтавкаНДСДоИзменения КАК СтавкаНДСДоИзменения,
				   //ДИТ, Беляев СЮ, Ticket#0280831, 08-08-2022, начало
				   |	КорректировкаРеализацииТовары.СтавкаНДСДоИзменения КАК СтавкаНДС,
				   |	КорректировкаРеализацииТовары.СтавкаНДС КАК СтавкаНДСПослеИзменения,
				   //ДИТ, Беляев СЮ, Ticket#0280831, 08-08-2022, конец
	               |	КорректировкаРеализацииТовары.СуммаНДС КАК СуммаНДСПослеИзменения,
	               |	КорректировкаРеализацииТовары.СуммаНДСДоИзменения КАК СуммаНДСДоИзменения,
	               |	КорректировкаРеализацииТовары.Номенклатура.КодТНВЭД КАК ТоварКодТНВЭДДоИзменения,
	               |	КорректировкаРеализацииТовары.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС
	               |ИЗ
	               |	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	               |ГДЕ
	               |	КорректировкаРеализацииТовары.Ссылка = &Документ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КорректировкаРеализацииУслуги.Ссылка,
	               |	КорректировкаРеализацииУслуги.Номенклатура,
	               |	КорректировкаРеализацииУслуги.Содержание,
	               |	КорректировкаРеализацииУслуги.Номенклатура.КодТНВЭД,
	               |	КорректировкаРеализацииУслуги.Количество,
	               |	КорректировкаРеализацииУслуги.КоличествоДоИзменения,
	               |	КорректировкаРеализацииУслуги.Цена,
	               |	КорректировкаРеализацииУслуги.ЦенаДоИзменения,
	               |	КорректировкаРеализацииУслуги.Сумма,
	               |	КорректировкаРеализацииУслуги.СуммаДоИзменения,
				   //|	КорректировкаРеализацииУслуги.СтавкаНДС,
				   //|	КорректировкаРеализацииУслуги.СтавкаНДСДоИзменения,
				   //ДИТ, Беляев СЮ, Ticket#0280831, 08-08-2022, начало
				   |	КорректировкаРеализацииУслуги.СтавкаНДСДоИзменения,
				   |	КорректировкаРеализацииУслуги.СтавкаНДС,
				   //ДИТ, Беляев СЮ, Ticket#0280831, 08-08-2022, конец
	               |	КорректировкаРеализацииУслуги.СуммаНДС,
	               |	КорректировкаРеализацииУслуги.СуммаНДСДоИзменения,
	               |	КорректировкаРеализацииУслуги.Номенклатура.КодТНВЭД,
	               |	КорректировкаРеализацииУслуги.Ссылка.СуммаВключаетНДС
	               |ИЗ
	               |	Документ.КорректировкаРеализации.Услуги КАК КорректировкаРеализацииУслуги
	               |ГДЕ
	               |	КорректировкаРеализацииУслуги.Ссылка = &Документ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КорректировкаРеализацииАгентскиеУслуги.Ссылка,
	               |	КорректировкаРеализацииАгентскиеУслуги.Номенклатура,
	               |	КорректировкаРеализацииАгентскиеУслуги.Содержание,
	               |	КорректировкаРеализацииАгентскиеУслуги.Номенклатура.КодТНВЭД,
	               |	КорректировкаРеализацииАгентскиеУслуги.Количество,
	               |	КорректировкаРеализацииАгентскиеУслуги.КоличествоДоИзменения,
	               |	КорректировкаРеализацииАгентскиеУслуги.Цена,
	               |	КорректировкаРеализацииАгентскиеУслуги.ЦенаДоИзменения,
	               |	КорректировкаРеализацииАгентскиеУслуги.Сумма,
	               |	КорректировкаРеализацииАгентскиеУслуги.СуммаДоИзменения,
				   //|	КорректировкаРеализацииАгентскиеУслуги.СтавкаНДС,
				   //|	КорректировкаРеализацииАгентскиеУслуги.СтавкаНДСДоИзменения,
				   //ДИТ, Беляев СЮ, Ticket#0280831, 08-08-2022, начало
				   |	КорректировкаРеализацииАгентскиеУслуги.СтавкаНДСДоИзменения,
				   |	КорректировкаРеализацииАгентскиеУслуги.СтавкаНДС,
				   //ДИТ, Беляев СЮ, Ticket#0280831, 08-08-2022, конец
	               |	КорректировкаРеализацииАгентскиеУслуги.СуммаНДС,
	               |	КорректировкаРеализацииАгентскиеУслуги.СуммаНДСДоИзменения,
	               |	КорректировкаРеализацииАгентскиеУслуги.Номенклатура.КодТНВЭД,
	               |	КорректировкаРеализацииАгентскиеУслуги.Ссылка.СуммаВключаетНДС
	               |ИЗ
	               |	Документ.КорректировкаРеализации.АгентскиеУслуги КАК КорректировкаРеализацииАгентскиеУслуги
	               |ГДЕ
	               |	КорректировкаРеализацииАгентскиеУслуги.Ссылка = &Документ";	
	Возврат ТекстЗапроса;
КонецФункции

//Функция ТекстЗапросаПечатьСчетовФактур(ИспользуетсяПостановлениеНДС1137 = Истина, ДляУниверсальногоПередаточногоДокумента = Ложь, ИспользуетсяПостановлениеНДС981 = Неопределено) Экспорт

//	ТекстЗапроса = 
//	"ВЫБРАТЬ
//	|	СчетФактура.Ссылка КАК СчетФактура,
//	|	ВЫБОР
//	|		КОГДА СчетФактура.Исправление
//	|			ТОГДА СчетФактура.ДатаИсходногоДокумента
//	|		ИНАЧЕ СчетФактура.Дата
//	|	КОНЕЦ КАК Дата,
//	|	ВЫБОР
//	|		КОГДА СчетФактура.Исправление
//	|			ТОГДА СчетФактура.НомерИсходногоДокумента
//	|		ИНАЧЕ СчетФактура.Номер
//	|	КОНЕЦ КАК Номер,
//	|	СчетФактура.ВидСчетаФактуры КАК ВидСчетаФактуры,
//	|	СчетФактура.Руководитель КАК Руководитель,
//	|	СчетФактура.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
//	|	СчетФактура.СчетФактураБезНДС КАК СчетФактураБезНДС,
//	|	СчетФактура.Исправление КАК Исправление,
//	|	СчетФактура.НомерИсправления КАК НомерИсправления,
//	|	СчетФактура.Дата КАК ДатаИсправления,
//	|	СчетФактура.Дата КАК ДатаСведений,
//	|	НЕ СчетФактура.Исправление КАК УдалитьПрефиксыИзНомера,
//	|	ИСТИНА КАК ЭтоСчетФактураВыданный,
//	|	ИСТИНА КАК ВыводитьСуммуБезНДС,
//	|	СчетФактураДокументыОснования.ДокументОснование КАК ДокументОснование,
//	|	СчетФактура.Контрагент,
//	|	СчетФактура.ДоговорКонтрагента,
//	|	СчетФактура.Контрагент.КПП КАК КППСчетаФактуры,
//	|	Выбор когда СчетФактура.Продавец <> Значение(Справочник.Контрагенты.ПустаяСсылка) Тогда
//	|		СчетФактура.Продавец.КПП 
//	|	Иначе СчетФактура.Организация.КПП 
//	|	Конец КАК КПППродавца,
//	|	Выбор когда СчетФактура.Продавец <> Значение(Справочник.Контрагенты.ПустаяСсылка) Тогда
//	|		СчетФактура.Продавец 
//	|	Иначе СчетФактура.Организация 
//	|	Конец КАК Продацец,
//	|	СчетФактура.Организация КАК Организация,
//	|	ВЫБОР
//	|		КОГДА СчетФактура.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
//	|			ТОГДА СчетФактура.ДоговорКонтрагента.ВидДоговора
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
//	|	КОНЕЦ КАК ВидДоговора,
//	//|	СчетФактура.Организация.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
//	//|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения КАК ЦифровойИндексОбособленногоПодразделения,
//	//|	ЛОЖЬ КАК НеподтверждениеНулевойСтавки,
//	|	СчетФактура.СводныйКомиссионный КАК СводныйКомиссионный
////|	ЕСТЬNULL(СчетФактура.ДоговорКонтрагента.СчетаФактурыОтИмениОрганизации, ЛОЖЬ) КАК СчетаФактурыОтИмениОрганизации
//	|ИЗ
//	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураДокументыОснования
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактура
//	|		ПО СчетФактураДокументыОснования.Ссылка = СчетФактура.Ссылка
//	|ГДЕ
//	|	СчетФактураДокументыОснования.Ссылка В(&МассивОбъектов)
//	|	И ВЫБОР
//	|			КОГДА СчетФактура.Исправление
//	|				ТОГДА СчетФактура.ДатаИсходногоДокумента > &УсловиеПоДате
//	|			ИНАЧЕ СчетФактура.Дата > &УсловиеПоДате
//	|		КОНЕЦ
//	|	И СчетФактура.ДокументыОснования.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)";
//	
//	Если ДляУниверсальногоПередаточногоДокумента Тогда
//		ТекстЗапроса = ТекстЗапроса + "
//		|	И ВЫБОР
//		|			КОГДА СчетФактура.Исправление
//		|				ТОГДА СчетФактура.ДатаИсходногоДокумента >= ДАТАВРЕМЯ(2013, 1, 1)
//		|			ИНАЧЕ СчетФактура.Дата >= ДАТАВРЕМЯ(2013, 1, 1)
//		|		КОНЕЦ
//		|	И ТИПЗНАЧЕНИЯ(СчетФактураДокументыОснования.ДокументОснование) <> ТИП(Документ.ОтчетКомиссионераОПродажах)";
//	//	|	И ТИПЗНАЧЕНИЯ(СчетФактураДокументыОснования.ДокументОснование) <> ТИП(Документ.ОтражениеНачисленияНДС)
//	//	|	И ТИПЗНАЧЕНИЯ(СчетФактураДокументыОснования.ДокументОснование) <> ТИП(Документ.НачислениеНДСпоСМРхозспособом)";
//	КонецЕсли;
//	
//	//// СФ на аванс
//	//ТекстЗапроса = ТекстЗапроса + ?(ПустаяСтрока(ТекстЗапроса), "", " ОБЪЕДИНИТЬ ВСЕ ") +
//	//"ВЫБРАТЬ
//	//|	СчетФактура.Ссылка КАК СчетФактура,
//	//|	ВЫБОР
//	//|		КОГДА СчетФактура.Исправление
//	//|			ТОГДА СчетФактура.ДатаИсходногоДокумента
//	//|		ИНАЧЕ СчетФактура.Дата
//	//|	КОНЕЦ КАК Дата,
//	//|	ВЫБОР
//	//|		КОГДА СчетФактура.Исправление
//	//|			ТОГДА СчетФактура.НомерИсходногоДокумента
//	//|		ИНАЧЕ СчетФактура.Номер
//	//|	КОНЕЦ КАК Номер,
//	//|	СчетФактура.ВидСчетаФактуры,
//	//|	СчетФактура.Руководитель,
//	//|	СчетФактура.ГлавныйБухгалтер,
//	//|	ЛОЖЬ КАК СчетФактураБезНДС,
//	//|	СчетФактура.Исправление,
//	//|	СчетФактура.НомерИсправления,
//	//|	СчетФактура.Дата КАК ДатаИсправления,
//	//|	СчетФактура.Дата КАК ДатаСведений,
//	//|	НЕ СчетФактура.Исправление КАК УдалитьПрефиксыИзНомера,
//	//|	ИСТИНА КАК ЭтоСчетФактураВыданный,
//	//|	ЛОЖЬ КАК ВыводитьСуммуБезНДС,
//	//|	СчетФактура.Ссылка КАК ДокументОснование,
//	//|	1 КАК НомерСтроки,
//	//|	ВЫБОР
//	//|		КОГДА СчетФактура.Контрагент.ОбособленноеПодразделение
//	//|				И СчетФактура.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
//	//|			ТОГДА СчетФактура.Контрагент.ГоловнойКонтрагент
//	//|		ИНАЧЕ СчетФактура.Контрагент
//	//|	КОНЕЦ КАК Контрагент,
//	//|	СчетФактура.ДоговорКонтрагента,
//	//|	СчетФактура.ИдентификаторГосКонтракта,
//	//|	СчетФактура.КППКонтрагента КАК КППСчетаФактуры,
//	//|	СчетФактура.КПППродавца КАК КПППродавца,
//	//|	СчетФактура.Организация,
//	//|	ВЫБОР
//	//|		КОГДА СчетФактура.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
//	//|			ТОГДА СчетФактура.ДоговорКонтрагента.ВидДоговора
//	//|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
//	//|	КОНЕЦ КАК ВидДоговора,
//	//|	СчетФактура.Организация.ОбособленноеПодразделение,
//	//|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения,
//	//|	ЛОЖЬ КАК НеподтверждениеНулевойСтавки,
//	//|	СчетФактура.СводныйКомиссионный КАК СводныйКомиссионный,
//	//|	ЕСТЬNULL(СчетФактура.ДоговорКонтрагента.СчетаФактурыОтИмениОрганизации, ЛОЖЬ) КАК СчетаФактурыОтИмениОрганизации
//	//|ИЗ
//	//|	Документ.СчетФактураВыданный КАК СчетФактура
//	//|ГДЕ
//	//|	СчетФактура.Ссылка В(&МассивОбъектов)
//	//|	И ВЫБОР
//	//|			КОГДА СчетФактура.Исправление
//	//|				ТОГДА СчетФактура.ДатаИсходногоДокумента > &УсловиеПоДате
//	//|			ИНАЧЕ СчетФактура.Дата > &УсловиеПоДате
//	//|		КОНЕЦ
//	//|	И СчетФактура.ВидСчетаФактуры В (ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс), ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитента), ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку))";
//	//
//	Если НЕ ДляУниверсальногоПередаточногоДокумента Тогда
//		
//		//ТекстЗапроса = ТекстЗапроса + ?(ПустаяСтрока(ТекстЗапроса), "", " ОБЪЕДИНИТЬ ВСЕ ") +
//	//	"ВЫБРАТЬ
//	//	|	СчетФактура.Ссылка,
//	//	|	СчетФактура.Дата,
//	//	|	СчетФактура.Номер,
//	//	|	СчетФактура.ВидСчетаФактуры,
//	//	|	СчетФактура.Руководитель,
//	//	|	СчетФактура.ГлавныйБухгалтер,
//	//	|	ЛОЖЬ,
//	//	|	СчетФактура.Исправление,
//	//	|	СчетФактура.НомерИсправления,
//	//	|	СчетФактура.Дата,
//	//	|	СчетФактура.Дата,
//	//	|	ИСТИНА,
//	//	|	ИСТИНА,
//	//	|	ЛОЖЬ,
//	//	|	СчетФактура.Ссылка,
//	//	|	1,
//	//	|	ВЫБОР
//	//	|		КОГДА СчетФактура.Контрагент.ОбособленноеПодразделение
//	//	|				И СчетФактура.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
//	//	|			ТОГДА СчетФактура.Контрагент.ГоловнойКонтрагент
//	//	|		ИНАЧЕ СчетФактура.Контрагент
//	//	|	КОНЕЦ,
//	//	|	СчетФактура.ДоговорКонтрагента,
//	//	|	"""",
//	//	|	СчетФактура.КППКонтрагента,
//	//	|	СчетФактура.КПППродавца КАК КПППродавца,
//	//	|	СчетФактура.Организация,
//	//	|	ВЫБОР
//	//	|		КОГДА СчетФактура.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
//	//	|			ТОГДА СчетФактура.ДоговорКонтрагента.ВидДоговора
//	//	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
//	//	|	КОНЕЦ,
//	////	|	СчетФактура.Организация.ОбособленноеПодразделение,
//	////	|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения,
//	//	|	ЛОЖЬ,
//	//	|	СчетФактура.СводныйКомиссионный
//	////	|	ЕСТЬNULL(СчетФактура.ДоговорКонтрагента.СчетаФактурыОтИмениОрганизации, ЛОЖЬ)
//	//	|ИЗ
//	//	|	Документ.СчетФактураВыданный КАК СчетФактура
//	//	|ГДЕ
//	//	|	СчетФактура.Ссылка В(&МассивОбъектов)
//	//	|	И ВЫБОР
//	//	|			КОГДА СчетФактура.Исправление
//	//	|				ТОГДА СчетФактура.ДатаИсходногоДокумента > &УсловиеПоДате
//	//	|			ИНАЧЕ СчетФактура.Дата > &УсловиеПоДате
//	//	|		КОНЕЦ
//	//	|	И СчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаСуммовуюРазницу)
//	//	|
//	//	|ОБЪЕДИНИТЬ ВСЕ
//	//	|
//		//"ВЫБРАТЬ
//		//|	СчетФактура.Ссылка,
//		//|	ВЫБОР
//		//|		КОГДА СчетФактура.Исправление
//		//|			ТОГДА СчетФактура.ДатаИсходногоДокумента
//		//|		ИНАЧЕ СчетФактура.Дата
//		//|	КОНЕЦ,
//		//|	ВЫБОР
//		//|		КОГДА СчетФактура.Исправление
//		//|			ТОГДА СчетФактура.НомерИсходногоДокумента
//		//|		ИНАЧЕ СчетФактура.Номер
//		//|	КОНЕЦ,
//		//|	СчетФактура.ВидСчетаФактуры,
//		//|	СчетФактура.Руководитель,
//		//|	СчетФактура.ГлавныйБухгалтер,
//		//|	СчетФактура.СчетФактураБезНДС,
//		//|	СчетФактура.Исправление,
//		//|	СчетФактура.НомерИсправления,
//		//|	СчетФактура.Дата,
//		//|	СчетФактура.Дата,
//		//|	НЕ СчетФактура.Исправление,
//		//|	ИСТИНА,
//		//|	ИСТИНА,
//		//|	СчетФактура.Ссылка,
//		//|	1,
//		//|	ВЫБОР
//		//|		КОГДА СчетФактура.Контрагент.ОбособленноеПодразделение
//		//|				И СчетФактура.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
//		//|			ТОГДА СчетФактура.Контрагент.ГоловнойКонтрагент
//		//|		ИНАЧЕ СчетФактура.Контрагент
//		//|	КОНЕЦ,
//		//|	СчетФактура.ДоговорКонтрагента,
//		//|	"""",
//		//|	СчетФактура.КППКонтрагента,
//		//|	СчетФактура.КПППродавца КАК КПППродавца,
//		//|	СчетФактура.Организация,
//		//|	ВЫБОР
//		//|		КОГДА СчетФактура.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
//		//|			ТОГДА СчетФактура.ДоговорКонтрагента.ВидДоговора
//		//|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
//		//|	КОНЕЦ,
//		//|	СчетФактура.Организация.ОбособленноеПодразделение,
//		//|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения,
//		//|	ЛОЖЬ,
//		//|	СчетФактура.СводныйКомиссионный,
//		//|	ЕСТЬNULL(СчетФактура.ДоговорКонтрагента.СчетаФактурыОтИмениОрганизации, ЛОЖЬ)
//		//|ИЗ
//		//|	Документ.СчетФактураВыданный КАК СчетФактура
//		//|ГДЕ
//		//|	СчетФактура.Ссылка В(&МассивОбъектов)
//		//|	И ВЫБОР
//		//|			КОГДА СчетФактура.Исправление
//		//|				ТОГДА СчетФактура.ДатаИсходногоДокумента > &УсловиеПоДате
//		//|			ИНАЧЕ СчетФактура.Дата > &УсловиеПоДате
//		//|		КОНЕЦ
//		//|	И СчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НалоговыйАгент)
//		//|
//	//	"ОБЪЕДИНИТЬ ВСЕ
//	//	|
//	//	|ВЫБРАТЬ
//	//	|	СчетФактура.Ссылка,
//	//	|	ВЫБОР
//	//	|		КОГДА СчетФактура.Исправление
//	//	|			ТОГДА СчетФактура.ДатаИсходногоДокумента
//	//	|		ИНАЧЕ СчетФактура.Дата
//	//	|	КОНЕЦ,
//	//	|	ВЫБОР
//	//	|		КОГДА СчетФактура.Исправление
//	//	|			ТОГДА СчетФактура.НомерИсходногоДокумента
//	//	|		ИНАЧЕ СчетФактура.Номер
//	//	|	КОНЕЦ,
//	//	|	СчетФактура.ВидСчетаФактуры,
//	//	|	СчетФактура.Руководитель,
//	//	|	СчетФактура.ГлавныйБухгалтер,
//	//	|	СчетФактура.СчетФактураБезНДС,
//	//	|	СчетФактура.Исправление,
//	//	|	СчетФактура.НомерИсправления,
//	//	|	СчетФактура.Дата,
//	//	|	СчетФактура.Дата,
//	//	|	НЕ СчетФактура.Исправление,
//	//	|	ИСТИНА,
//	//	|	ИСТИНА,
//	//	|	ПодтверждениеНулевойСтавкиСостав.ДокументОтгрузки,
//	//	|	ПодтверждениеНулевойСтавкиСостав.НомерСтроки,
//	//	|	ВЫБОР
//	//	|		КОГДА СчетФактура.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	//	|			ТОГДА СчетФактура.Продавец
//	//	|		ИНАЧЕ СчетФактура.Контрагент
//	//	|	КОНЕЦ,
//	//	|	ВЫБОР
//	//	|		КОГДА СчетФактура.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	//	|			ТОГДА НЕОПРЕДЕЛЕНО
//	//	|		ИНАЧЕ СчетФактура.ДоговорКонтрагента
//	//	|	КОНЕЦ,
//	//	|	СчетФактура.ИдентификаторГосКонтракта,
//	//	|	СчетФактура.КППКонтрагента,
//	//	|	СчетФактура.КПППродавца КАК КПППродавца,
//	//	|	СчетФактура.Организация,
//	//	|	ВЫБОР
//	//	|		КОГДА СчетФактура.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
//	//	|			ТОГДА СчетФактура.ДоговорКонтрагента.ВидДоговора
//	//	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
//	//	|	КОНЕЦ,
//	//	|	СчетФактура.Организация.ОбособленноеПодразделение,
//	//	|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения,
//	//	|	ИСТИНА,
//	//	|	СчетФактура.СводныйКомиссионный
//	////	|	ЕСТЬNULL(СчетФактура.ДоговорКонтрагента.СчетаФактурыОтИмениОрганизации, ЛОЖЬ)
//	//	|ИЗ
//	//	|	Документ.СчетФактураВыданный КАК СчетФактура
//	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПодтверждениеНулевойСтавкиНДС.Состав КАК ПодтверждениеНулевойСтавкиСостав
//	//	|		ПО (ПодтверждениеНулевойСтавкиСостав.СчетФактураВыданный = СчетФактура.Ссылка)
//	//	|ГДЕ
//	//	|	СчетФактура.Ссылка В(&МассивОбъектов)
//	//	|	И ВЫБОР
//	//	|			КОГДА СчетФактура.Исправление
//	//	|				ТОГДА СчетФактура.ДатаИсходногоДокумента > &УсловиеПоДате
//	//	|			ИНАЧЕ СчетФактура.Дата > &УсловиеПоДате
//	//	|		КОНЕЦ
//	//	|	И СчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
//	//	|	И ТИПЗНАЧЕНИЯ(СчетФактура.ДокументОснование) = ТИП(Документ.ПодтверждениеНулевойСтавкиНДС)
//	//	|	И ТИПЗНАЧЕНИЯ(ПодтверждениеНулевойСтавкиСостав.ДокументОтгрузки) <> ТИП(Документ.СчетФактураВыданный)
//	//	|
//	//	|ОБЪЕДИНИТЬ ВСЕ
//	//	|
//	//	|ВЫБРАТЬ
//	//	|	СчетФактураПоСтавке0.Ссылка,
//	//	|	ВЫБОР
//	//	|		КОГДА СчетФактура.Исправление
//	//	|			ТОГДА СчетФактура.ДатаИсходногоДокумента
//	//	|		ИНАЧЕ СчетФактура.Дата
//	//	|	КОНЕЦ,
//	//	|	ВЫБОР
//	//	|		КОГДА СчетФактура.Исправление
//	//	|			ТОГДА СчетФактура.НомерИсходногоДокумента
//	//	|		ИНАЧЕ СчетФактура.Номер
//	//	|	КОНЕЦ,
//	//	|	СчетФактура.ВидСчетаФактуры,
//	//	|	СчетФактура.Руководитель,
//	//	|	СчетФактура.ГлавныйБухгалтер,
//	//	|	СчетФактура.СчетФактураБезНДС,
//	//	|	СчетФактура.Исправление,
//	//	|	СчетФактура.НомерИсправления,
//	//	|	СчетФактура.Дата,
//	//	|	СчетФактура.Дата,
//	//	|	НЕ СчетФактура.Исправление,
//	//	|	ИСТИНА,
//	//	|	ИСТИНА,
//	//	|	СчетФактураПоСтавке0.ДокументОснование,
//	//	|	ПодтверждениеНулевойСтавкиСостав.НомерСтроки,
//	//	|	ВЫБОР
//	//	|		КОГДА СчетФактураПоСтавке0.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	//	|			ТОГДА СчетФактураПоСтавке0.Продавец
//	//	|		ИНАЧЕ СчетФактураПоСтавке0.Контрагент
//	//	|	КОНЕЦ,
//	//	|	ВЫБОР
//	//	|		КОГДА СчетФактураПоСтавке0.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//	//	|			ТОГДА НЕОПРЕДЕЛЕНО
//	//	|		ИНАЧЕ СчетФактураПоСтавке0.ДоговорКонтрагента
//	//	|	КОНЕЦ,
//	//	|	СчетФактура.ИдентификаторГосКонтракта,
//	//	|	СчетФактура.КППКонтрагента,
//	//	|	СчетФактура.КПППродавца КАК КПППродавца,
//	//	|	СчетФактура.Организация,
//	//	|	ВЫБОР
//	//	|		КОГДА СчетФактураПоСтавке0.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
//	//	|			ТОГДА СчетФактураПоСтавке0.ДоговорКонтрагента.ВидДоговора
//	//	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
//	//	|	КОНЕЦ,
//	//	|	СчетФактура.Организация.ОбособленноеПодразделение,
//	//	|	СчетФактура.Организация.ЦифровойИндексОбособленногоПодразделения,
//	//	|	ИСТИНА,
//	//	|	СчетФактура.СводныйКомиссионный,
//	//	|	ЕСТЬNULL(СчетФактура.ДоговорКонтрагента.СчетаФактурыОтИмениОрганизации, ЛОЖЬ)
//	//	|ИЗ
//	//	|	Документ.СчетФактураВыданный КАК СчетФактура
//	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПодтверждениеНулевойСтавкиНДС.Состав КАК ПодтверждениеНулевойСтавкиСостав
//	//	|		ПО (ПодтверждениеНулевойСтавкиСостав.СчетФактураВыданный = СчетФактура.Ссылка)
//	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураПоСтавке0
//	//	|		ПО (ПодтверждениеНулевойСтавкиСостав.ДокументОтгрузки = СчетФактураПоСтавке0.Ссылка)
//	//	|ГДЕ
//	//	|	СчетФактура.Ссылка В(&МассивОбъектов)
//	//	|	И ВЫБОР
//	//	|			КОГДА СчетФактура.Исправление
//	//	|				ТОГДА СчетФактура.ДатаИсходногоДокумента > &УсловиеПоДате
//	//	|			ИНАЧЕ СчетФактура.Дата > &УсловиеПоДате
//	//	|		КОНЕЦ
//	//	|	И СчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
//	//	|	И ТИПЗНАЧЕНИЯ(СчетФактура.ДокументОснование) = ТИП(Документ.ПодтверждениеНулевойСтавкиНДС)
//	//	|	И ТИПЗНАЧЕНИЯ(ПодтверждениеНулевойСтавкиСостав.ДокументОтгрузки) = ТИП(Документ.СчетФактураВыданный)";
//	//	
//	КонецЕсли;
//	
//	ТекстЗапроса = ТекстЗапроса + "
//	|УПОРЯДОЧИТЬ ПО
//	|	Дата,
//	|	СчетФактура,
//	|	НомерСтроки
//	|ИТОГИ
//	|	МАКСИМУМ(Дата),
//	|	МАКСИМУМ(Номер),
//	|	МАКСИМУМ(ВидСчетаФактуры),
//	|	МАКСИМУМ(СчетФактураБезНДС),
//	|	МАКСИМУМ(Исправление),
//	|	МАКСИМУМ(НомерИсправления),
//	|	МАКСИМУМ(ДатаИсправления),
//	|	МАКСИМУМ(УдалитьПрефиксыИзНомера),
//	|	МАКСИМУМ(ЭтоСчетФактураВыданный),
//	|	МАКСИМУМ(ВыводитьСуммуБезНДС),
//	|	МАКСИМУМ(НеподтверждениеНулевойСтавки)
//	|ПО
//	|	СчетФактура" + ТекстРазделителяЗапросовПакета();
//	
//	//ТекстЗапроса = ТекстЗапроса + 
//	//"ВЫБРАТЬ
//	//|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка КАК СчетФактура,
//	//|	СчетФактураВыданныйПлатежноРасчетныеДокументы.НомерСтроки КАК НомерСтроки,
//	//|	СчетФактураВыданныйПлатежноРасчетныеДокументы.ДатаДокумента КАК ДатаДокумента,
//	//|	СчетФактураВыданныйПлатежноРасчетныеДокументы.НомерДокумента КАК НомерДокумента,
//	//|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент
//	//|ИЗ
//	//|	Документ.СчетФактураВыданный.ПлатежноРасчетныеДокументы КАК СчетФактураВыданныйПлатежноРасчетныеДокументы
//	//|ГДЕ
//	//|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка В(&МассивОбъектов)
//	//|	И НЕ(СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
//	//|				ИЛИ СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитента)
//	//|				ИЛИ СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку))
//	//|
//	//|ОБЪЕДИНИТЬ ВСЕ
//	//|
//	//|ВЫБРАТЬ
//	//|	СчетФактураВыданныйАвансы.Ссылка,
//	//|	СчетФактураВыданныйАвансы.НомерСтроки,
//	//|	СчетФактураВыданныйАвансы.ДатаПлатежноРасчетногоДокумента,
//	//|	СчетФактураВыданныйАвансы.НомерПлатежноРасчетногоДокумента,
//	//|	СчетФактураВыданныйАвансы.Контрагент
//	//|ИЗ
//	//|	Документ.СчетФактураВыданный.Авансы КАК СчетФактураВыданныйАвансы
//	//|ГДЕ
//	//|	СчетФактураВыданныйАвансы.Ссылка В(&МассивОбъектов)
//	//|	И СчетФактураВыданныйАвансы.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку)
//	//|	И СчетФактураВыданныйАвансы.Ссылка.СводныйКомиссионный";
//	
//	Если ДляУниверсальногоПередаточногоДокумента Тогда
//		
//		//ТекстЗапроса = ТекстЗапроса + "
//		//|	ОБЪЕДИНИТЬ ВСЕ
//		//|
//		//|ВЫБРАТЬ
//		//|	СчетФактураВыданный.Ссылка,
//		//|	1,
//		//|	СчетФактураВыданный.ДатаПлатежноРасчетногоДокумента,
//		//|	СчетФактураВыданный.НомерПлатежноРасчетногоДокумента,
//		//|	СчетФактураВыданный.Контрагент
//		//|ИЗ
//		//|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
//		//|ГДЕ
//		//|	СчетФактураВыданный.Ссылка В(&МассивОбъектов)
//		//|	И СчетФактураВыданный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)";
//		//
//	Иначе
//		
//		//ТекстЗапроса = ТекстЗапроса + "
//		//|
//		//|ОБЪЕДИНИТЬ ВСЕ
//		//|" + 
//		//"ВЫБРАТЬ
//		//|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка,
//		//|	1,
//		//|	СчетФактураВыданныйПлатежноРасчетныеДокументы.ДатаПлатежноРасчетногоДокумента,
//		//|	СчетФактураВыданныйПлатежноРасчетныеДокументы.НомерПлатежноРасчетногоДокумента,
//		//|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//		//|ИЗ
//		//|	Документ.СчетФактураВыданный КАК СчетФактураВыданныйПлатежноРасчетныеДокументы
//		//|ГДЕ
//		//|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка В(&МассивОбъектов)
//		//|	И (СчетФактураВыданныйПлатежноРасчетныеДокументы.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс)
//		//|			ИЛИ СчетФактураВыданныйПлатежноРасчетныеДокументы.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитента)
//		//|			ИЛИ СчетФактураВыданныйПлатежноРасчетныеДокументы.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку)
//		//|				И НЕ СчетФактураВыданныйПлатежноРасчетныеДокументы.СводныйКомиссионный)
//		//|
//		//|ОБЪЕДИНИТЬ ВСЕ
//		//|
//		//|ВЫБРАТЬ
//		//|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка,
//		//|	2,
//		//|	СчетФактураВыданныйПлатежноРасчетныеДокументы.ДатаДокументаАвансаКомитента,
//		//|	СчетФактураВыданныйПлатежноРасчетныеДокументы.НомерДокументаАвансаКомитента,
//		//|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
//		//|ИЗ
//		//|	Документ.СчетФактураВыданный КАК СчетФактураВыданныйПлатежноРасчетныеДокументы
//		//|ГДЕ
//		//|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка В(&МассивОбъектов)
//		//|	И СчетФактураВыданныйПлатежноРасчетныеДокументы.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку)";

//		
//	КонецЕсли;
//	
//	//ТекстЗапроса = ТекстЗапроса + "
//	//|
//	//|УПОРЯДОЧИТЬ ПО
//	//|	НомерСтроки";
//	//
//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "> &УсловиеПоДате",
//				">= ДАТАВРЕМЯ(2017,10,1)");
//	Возврат ТекстЗапроса;

//	
//КонецФункции

//Функция ТекстРазделителяЗапросовПакета() Экспорт

//	ТекстРазделителя =
//	"
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|";

//	Возврат ТекстРазделителя;

//КонецФункции

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Счет-фактура
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СчетФактура";
	КомандаПечати.Представление = НСтр("ru = 'Счет-фактура'");
	КомандаПечати.Обработчик    = "ДополнительныйМодульКлиент.ВыполнитьКомандуПечатиСчетовФактур";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	//Евросиб Каблов 28.07.2020 ( TASK 23506
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//Евросиб Каблов 28.07.2020 )
	
	//80515 Субботин 19.02.2024 начало
	КомандаПечати.ДополнительныеПараметры.Вставить("НеобходимаПроверкаРолиДляПечати", Истина);
	//80515 Субботин 19.02.2024 Конец
	// Евросиб US 107868 TA 107964 Рыбьяков К.А. 24.10.2024 ((
	КомандаПечати.ДополнительныеПараметры.Вставить("ПроверкаЗапретаПечатиДляСтавкиНДС20", Истина);
	// Евросиб Рыбьяков К.А. 24.10.2024 ))
	
	//УПД
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "УниверсальныйПередаточныйДокумент";
	КомандаПечати.Представление = НСтр("ru = 'Универсальный передаточный документ'");
	КомандаПечати.Обработчик    = "ДополнительныйМодульКлиент.ВыполнитьКомандуПечатиУПД";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	//Евросиб Каблов 28.07.2020 ( TASK 23506
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//Евросиб Каблов 28.07.2020 )
	
	//80515 Субботин 19.02.2024 начало
	КомандаПечати.ДополнительныеПараметры.Вставить("НеобходимаПроверкаРолиДляПечати", Истина);
	//80515 Субботин 19.02.2024 Конец
	// Евросиб US 107868 TA 107964 Рыбьяков К.А. 24.10.2024 ((
	КомандаПечати.ДополнительныеПараметры.Вставить("ПроверкаЗапретаПечатиДляСтавкиНДС20", Истина);
	// Евросиб Рыбьяков К.А. 24.10.2024 ))
	
	
КонецПроцедуры


Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля = Новый Массив;
	Поля.Добавить("НомерДляПечати");
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	Поля.Добавить("ДатаДокумента");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	НомерЪ = ?(ЗначениеЗаполнено(Данные.НомерДляПечати), Данные.НомерДляПечати, Данные.Номер);
	ДатаЪ = ?(ЗначениеЗаполнено(Данные.ДатаДокумента), Данные.ДатаДокумента, Данные.Дата);
	
	Представление = "Счет-фактура выданный " + НомерЪ + " от " + Формат(ДатаЪ, "ДФ='dd.MM.yy ЧЧ:мм'");
КонецПроцедуры

//80515 Субботин 01.03.2024 начало 
Функция ПроверитьВозможностьПечатиСФ(ДокументыОснования, ВызовИсключения = Ложь) Экспорт
	
	ВозможностьПечати = Истина;
	МассивШтрафныхДокументов = Новый Массив;
	Для Каждого ДокументОснования Из ДокументыОснования Цикл
			Если (ТипЗнч(ДокументОснования.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
			и ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснования.ДокументОснование, "Штраф")) Тогда
			Если ВызовИсключения Тогда
				ВызватьИсключение("В " + ДокументОснования.ДокументОснование + "  установлен признак Штраф. Недостаточно прав для выполнения операции.");
			КонецЕсли;	
			МассивШтрафныхДокументов.Добавить(ДокументОснования.ДокументОснование);
		КонецЕсли;
	КонецЦикла;	
	Если НЕ МассивШтрафныхДокументов.Количество()= 0 Тогда
		  ВозможностьПечати = Ложь;
	КонецЕсли;	
	Возврат ВозможностьПечати
	
КонецФункции
//80515 Субботин 01.03.2024 Конец 

#Область ИнициализацияДанныхДляПроведения   

//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 101301 17.04.2025   
Процедура ИнициализироватьДанныеДокумента(ДокументОбъект, ДополнительныеСвойства) Экспорт

	//"ТаблицаДляДвижений" - структура, которая будет содержать таблицы значений с данными для выполнения движений
	ДополнительныеСвойства.Вставить("ТаблицыДляДвижений", Новый  Структура); 
	
	//Запросы для получения данных для выполнения движений
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументОбъект, ДополнительныеСвойства);
	
	ТекстыЗапроса = Новый СписокЗначений;  
	ТекстЗапросаТаблицаПодтверждающиеДокументыНДС0_Море(ТекстыЗапроса);	
	ТекстЗапросаТаблицаПодтверждающиеДокументыНДС0_ЖД(ТекстыЗапроса);
	ТекстЗапросаТаблицаПодтверждающиеДокументыНДС0_Авто(ТекстыЗапроса);
	ТекстЗапросаТаблицаКонтрольПолученияДокументовНДС0(ТекстыЗапроса);
	
	//Выполняем запросы и помещаем в Таблицы для движений
	ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений,Истина,Истина,Ложь);

КонецПроцедуры 

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументОбъект, ДополнительныеСвойства)
	
	
	Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка); 
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОбъект.ДокументОснование);   
	
КонецПроцедуры        

Процедура ТекстЗапросаТаблицаПодтверждающиеДокументыНДС0_Море(ТекстыЗапроса)

	ИмяРегистра = "ПодтверждающиеДокументыНДС0_Море";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СчетФактураВыданный.Ссылка КАК СчетФактура,
	|	СчетФактураВыданный.Контрагент КАК Контрагент,
	|	СчетФактураВыданный.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданныйМорскойТранспорт.ТипДокумента = ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПодтверждающихМорскихДокументов.Поручение)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыПодтверждающихМорскихДокументов.Коносамент)
	|	КОНЕЦ КАК ТипДокумента,
	|	СчетФактураВыданныйМорскойТранспорт.Судно КАК Судно,
	|	СчетФактураВыданныйМорскойТранспорт.ПортРазгрузки КАК ПортРазгрузки,
	|	СчетФактураВыданныйМорскойТранспорт.ДатаРазрешенияПогрузки КАК ДатаРазрешенияПогрузки,
	|	СчетФактураВыданныйМорскойТранспорт.НомерДокумента КАК НомерДокумента,
	|	СчетФактураВыданныйМорскойТранспорт.ДатаДокумента КАК ДатаДокумента,
	|	СчетФактураВыданныйМорскойТранспорт.СтранаРазгрузки КАК СтранаРазгрузки,
	|	СчетФактураВыданныйМорскойТранспорт.НомерГТД КАК НомерГТД,
	|	СчетФактураВыданныйМорскойТранспорт.ПортПогрузки КАК ПортПогрузки,
	|	СчетФактураВыданныйМорскойТранспорт.СтранаПогрузки КАК СтранаПогрузки,
	|	СУММА(0) КАК НалоговаяБаза,
	|	СчетФактураВыданныйПодтверждающиеДокументы.ДатаОтчетаДляФНС КАК Период,
	|	СчетФактураВыданный.ВидПеревозки КАК ВидПеревозки,
	|	СчетФактураВыданныйПодтверждающиеДокументы.Контейнер КАК Контейнер,
	|	СчетФактураВыданныйМорскойТранспорт.РегНомерТранзитнойДекларации КАК РегНомерТранзитнойДекларации,
	|	СчетФактураВыданный.Фрахт КАК Фрахт,
	|	СчетФактураВыданныйПодтверждающиеДокументы.ДатаПодтвержденияНДС0 КАК ДатаПодтвержденияНДС0
	|ИЗ
	|	Документ.СчетФактураВыданный.МорскойТранспорт КАК СчетФактураВыданныйМорскойТранспорт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО СчетФактураВыданныйМорскойТранспорт.Ссылка = СчетФактураВыданный.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ПодтверждающиеДокументы КАК СчетФактураВыданныйПодтверждающиеДокументы
	|		ПО СчетФактураВыданныйМорскойТранспорт.Ссылка = СчетФактураВыданныйПодтверждающиеДокументы.Ссылка
	|			И СчетФактураВыданныйМорскойТранспорт.КлючСтроки = СчетФактураВыданныйПодтверждающиеДокументы.КлючСтроки
	|ГДЕ
	|	НЕ СчетФактураВыданный.Авто
	|	И СчетФактураВыданныйПодтверждающиеДокументы.ВключатьВОтчетДляФНС = ИСТИНА
	|	И СчетФактураВыданный.Ссылка = &Ссылка
	|	И СчетФактураВыданныйПодтверждающиеДокументы.ДатаОтчетаДляФНС <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И НЕ СчетФактураВыданный.Фрахт
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетФактураВыданныйМорскойТранспорт.ПортПогрузки,
	|	СчетФактураВыданныйМорскойТранспорт.СтранаПогрузки,
	|	СчетФактураВыданныйМорскойТранспорт.ПортРазгрузки,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданныйМорскойТранспорт.ТипДокумента = ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПодтверждающихМорскихДокументов.Поручение)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыПодтверждающихМорскихДокументов.Коносамент)
	|	КОНЕЦ,
	|	СчетФактураВыданныйМорскойТранспорт.РегНомерТранзитнойДекларации,
	|	СчетФактураВыданныйМорскойТранспорт.Судно,
	|	СчетФактураВыданныйМорскойТранспорт.НомерДокумента,
	|	СчетФактураВыданный.Ссылка,
	|	СчетФактураВыданныйМорскойТранспорт.СтранаРазгрузки,
	|	СчетФактураВыданныйПодтверждающиеДокументы.Контейнер,
	|	СчетФактураВыданныйМорскойТранспорт.ДатаДокумента,
	|	СчетФактураВыданныйПодтверждающиеДокументы.ДатаПодтвержденияНДС0,
	|	СчетФактураВыданныйПодтверждающиеДокументы.ДатаОтчетаДляФНС,
	|	СчетФактураВыданныйМорскойТранспорт.ДатаРазрешенияПогрузки,
	|	СчетФактураВыданныйМорскойТранспорт.НомерГТД,
	|	СчетФактураВыданный.Контрагент,
	|	СчетФактураВыданный.ДоговорКонтрагента,
	|	СчетФактураВыданный.ВидПеревозки,
	|	СчетФактураВыданный.Фрахт
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетФактураВыданный.Ссылка,
	|	СчетФактураВыданный.Контрагент,
	|	СчетФактураВыданный.ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданныйМорскойТранспорт.ТипДокумента = ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПодтверждающихМорскихДокументов.Поручение)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыПодтверждающихМорскихДокументов.Коносамент)
	|	КОНЕЦ,
	|	СчетФактураВыданныйМорскойТранспорт.Судно,
	|	СчетФактураВыданныйМорскойТранспорт.ПортРазгрузки,
	|	СчетФактураВыданныйМорскойТранспорт.ДатаРазрешенияПогрузки,
	|	СчетФактураВыданныйМорскойТранспорт.НомерДокумента,
	|	СчетФактураВыданныйМорскойТранспорт.ДатаДокумента,
	|	СчетФактураВыданныйМорскойТранспорт.СтранаРазгрузки,
	|	СчетФактураВыданныйМорскойТранспорт.НомерГТД,
	|	СчетФактураВыданныйМорскойТранспорт.ПортПогрузки,
	|	СчетФактураВыданныйМорскойТранспорт.СтранаПогрузки,
	|	СУММА(СчетФактураВыданныйМорскойТранспорт.СуммаПоКТК),
	|	СчетФактураВыданныйМорскойТранспорт.ДатаОтчетаДляФНС,
	|	СчетФактураВыданный.ВидПеревозки,
	|	СчетФактураВыданныйМорскойТранспорт.Контейнер,
	|	СчетФактураВыданныйМорскойТранспорт.РегНомерТранзитнойДекларации,
	|	СчетФактураВыданный.Фрахт,
	|	СчетФактураВыданныйМорскойТранспорт.ДатаПодтвержденияНДС0
	|ИЗ
	|	Документ.СчетФактураВыданный.МорскойТранспорт КАК СчетФактураВыданныйМорскойТранспорт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО СчетФактураВыданныйМорскойТранспорт.Ссылка = СчетФактураВыданный.Ссылка
	|ГДЕ
	|	НЕ СчетФактураВыданный.Авто
	|	И СчетФактураВыданный.Ссылка = &Ссылка
	|	И СчетФактураВыданный.Фрахт
	|	И СчетФактураВыданныйМорскойТранспорт.ВключатьВОтчетДляФНС = ИСТИНА
	|	И СчетФактураВыданныйМорскойТранспорт.ДатаОтчетаДляФНС <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетФактураВыданныйМорскойТранспорт.Судно,
	|	СчетФактураВыданныйМорскойТранспорт.ДатаДокумента,
	|	СчетФактураВыданный.Ссылка,
	|	СчетФактураВыданныйМорскойТранспорт.ДатаОтчетаДляФНС,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданныйМорскойТранспорт.ТипДокумента = ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПодтверждающихМорскихДокументов.Поручение)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыПодтверждающихМорскихДокументов.Коносамент)
	|	КОНЕЦ,
	|	СчетФактураВыданныйМорскойТранспорт.ПортРазгрузки,
	|	СчетФактураВыданныйМорскойТранспорт.НомерГТД,
	|	СчетФактураВыданныйМорскойТранспорт.НомерДокумента,
	|	СчетФактураВыданныйМорскойТранспорт.ПортПогрузки,
	|	СчетФактураВыданныйМорскойТранспорт.Контейнер,
	|	СчетФактураВыданныйМорскойТранспорт.ДатаПодтвержденияНДС0,
	|	СчетФактураВыданныйМорскойТранспорт.СтранаРазгрузки,
	|	СчетФактураВыданныйМорскойТранспорт.СтранаПогрузки,
	|	СчетФактураВыданныйМорскойТранспорт.РегНомерТранзитнойДекларации,
	|	СчетФактураВыданныйМорскойТранспорт.ДатаРазрешенияПогрузки,
	|	СчетФактураВыданный.Контрагент,
	|	СчетФактураВыданный.ДоговорКонтрагента,
	|	СчетФактураВыданный.ВидПеревозки,
	|	СчетФактураВыданный.Фрахт";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

КонецПроцедуры

Процедура ТекстЗапросаТаблицаПодтверждающиеДокументыНДС0_ЖД(ТекстыЗапроса)

	ИмяРегистра = "ПодтверждающиеДокументыНДС0_ЖД";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СчетФактураВыданный.Ссылка КАК СчетФактура,
	|	СчетФактураВыданный.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СчетФактураВыданный.Контрагент КАК Контрагент,
	|	СчетФактураВыданныйПодтверждающиеДокументы.СтранаОтправления КАК СтранаОтправления,
	|	СчетФактураВыданныйПодтверждающиеДокументы.СтанцияОтправления КАК СтанцияОтправления,
	|	СчетФактураВыданныйПодтверждающиеДокументы.ВходнаяСтанция КАК ВходнаяСтанция,
	|	СчетФактураВыданныйПодтверждающиеДокументы.НомерГТД КАК НомерГТД,
	|	СчетФактураВыданныйПодтверждающиеДокументы.СтранаНазначения КАК СтранаНазначения,
	|	СчетФактураВыданныйПодтверждающиеДокументы.СтанцияНазначения КАК СтанцияНазначения,
	|	СчетФактураВыданныйПодтверждающиеДокументы.ВыходнаяСтанция КАК ВыходнаяСтанция,
	|	СчетФактураВыданныйПодтверждающиеДокументы.ЖДН КАК ЖДН,
	|	СУММА(СчетФактураВыданныйПодтверждающиеДокументы.СуммаПоКТК) КАК НалоговаяБаза,
	|	СчетФактураВыданныйПодтверждающиеДокументы.ДатаОтчетаДляФНС КАК Период,
	|	СчетФактураВыданныйПодтверждающиеДокументы.Вагон КАК Вагон,
	|	СчетФактураВыданныйПодтверждающиеДокументы.Контейнер КАК Контейнер,
	|	СчетФактураВыданный.ВидПеревозки КАК ВидПеревозки,
	|	СчетФактураВыданныйПодтверждающиеДокументы.РегНомерТранзитнойДекларации КАК РегНомерТранзитнойДекларации,
	|	СчетФактураВыданныйПодтверждающиеДокументы.ДатаПодтвержденияНДС0 КАК ДатаПодтвержденияНДС0
	|ИЗ
	|	Документ.СчетФактураВыданный.ПодтверждающиеДокументы КАК СчетФактураВыданныйПодтверждающиеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО СчетФактураВыданныйПодтверждающиеДокументы.Ссылка = СчетФактураВыданный.Ссылка
	|ГДЕ
	|	НЕ СчетФактураВыданный.Авто
	|	И НЕ СчетФактураВыданный.Фрахт
	|	И СчетФактураВыданный.Ссылка = &Ссылка
	|	И СчетФактураВыданныйПодтверждающиеДокументы.ВключатьВОтчетДляФНС = ИСТИНА
	|	И СчетФактураВыданныйПодтверждающиеДокументы.ДатаОтчетаДляФНС <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетФактураВыданный.Ссылка,
	|	СчетФактураВыданный.ДоговорКонтрагента,
	|	СчетФактураВыданный.Контрагент,
	|	СчетФактураВыданныйПодтверждающиеДокументы.ЖДН,
	|	СчетФактураВыданныйПодтверждающиеДокументы.СтранаОтправления,
	|	СчетФактураВыданныйПодтверждающиеДокументы.СтанцияОтправления,
	|	СчетФактураВыданныйПодтверждающиеДокументы.ВходнаяСтанция,
	|	СчетФактураВыданныйПодтверждающиеДокументы.НомерГТД,
	|	СчетФактураВыданныйПодтверждающиеДокументы.СтранаНазначения,
	|	СчетФактураВыданныйПодтверждающиеДокументы.СтанцияНазначения,
	|	СчетФактураВыданныйПодтверждающиеДокументы.ВыходнаяСтанция,
	|	СчетФактураВыданныйПодтверждающиеДокументы.ДатаОтчетаДляФНС,
	|	СчетФактураВыданныйПодтверждающиеДокументы.Вагон,
	|	СчетФактураВыданныйПодтверждающиеДокументы.Контейнер,
	|	СчетФактураВыданный.ВидПеревозки,
	|	СчетФактураВыданныйПодтверждающиеДокументы.РегНомерТранзитнойДекларации,
	|	СчетФактураВыданныйПодтверждающиеДокументы.ДатаПодтвержденияНДС0";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

КонецПроцедуры

Процедура ТекстЗапросаТаблицаПодтверждающиеДокументыНДС0_Авто(ТекстыЗапроса)

	ИмяРегистра = "ПодтверждающиеДокументыНДС0_Авто";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СчетФактураВыданный.Ссылка КАК СчетФактура,
	|	СчетФактураВыданный.Контрагент КАК Контрагент,
	|	СчетФактураВыданный.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СчетФактураВыданныйАвтоТранпорт.НомерДокумента КАК НомерДокумента,
	|	СчетФактураВыданныйАвтоТранпорт.ДатаДокумента КАК ДатаДокумента,
	|	СчетФактураВыданныйАвтоТранпорт.КодНаправленияПрибытияУбытия КАК КодНаправления,
	|	СчетФактураВыданныйАвтоТранпорт.ТаможеннаяНакладнаяВвоз КАК НомерТаможеннойНакладной,
	|	СчетФактураВыданныйАвтоТранпорт.НомерГТД КАК НомерГТД,
	|	СчетФактураВыданныйАвтоТранпорт.Отправитель КАК Отправитель,
	|	СчетФактураВыданныйАвтоТранпорт.Отправитель_ИНН КАК Отправитель_ИНН,
	|	СчетФактураВыданныйАвтоТранпорт.Отправитель_Наименование КАК Отправитель_Наименование,
	|	СчетФактураВыданныйАвтоТранпорт.Отправитель_Адрес КАК Отправитель_Адрес,
	|	СчетФактураВыданныйАвтоТранпорт.Получатель КАК Получатель,
	|	СчетФактураВыданныйАвтоТранпорт.Получатель_ИНН КАК Получатель_ИНН,
	|	СчетФактураВыданныйАвтоТранпорт.Получатель_Наименование КАК Получатель_Наименование,
	|	СчетФактураВыданныйАвтоТранпорт.Получатель_Адрес КАК Получатель_Адрес,
	|	СчетФактураВыданныйАвтоТранпорт.Перевозчик КАК Перевозчик,
	|	СчетФактураВыданныйАвтоТранпорт.Перевозчик_ИНН КАК Перевозчик_ИНН,
	|	СчетФактураВыданныйАвтоТранпорт.Перевозчик_Наименование КАК Перевозчик_Наименование,
	|	СчетФактураВыданныйАвтоТранпорт.Перевозчик_Адрес КАК Перевозчик_Адрес,
	|	СчетФактураВыданныйАвтоТранпорт.РегНомерАвтомобиля КАК РегНомерАвтомобиля,
	|	СчетФактураВыданныйАвтоТранпорт.РегНомерПрицепа КАК РегНомерПрицепа,
	|	СчетФактураВыданныйАвтоТранпорт.Контейнер КАК Контейнер,
	|	СчетФактураВыданныйАвтоТранпорт.СтранаПогрузки КАК СтранаПогрузки,
	|	СчетФактураВыданныйАвтоТранпорт.СтранаРазгрузки КАК СтранаРазгрузки,
	|	СчетФактураВыданныйАвтоТранпорт.РегНомерТаможеннойДекларации КАК РегНомерТаможеннойДекларации,
	|	СчетФактураВыданныйАвтоТранпорт.ДатаОтчетаДляФНС КАК Период,
	|	СУММА(СчетФактураВыданныйАвтоТранпорт.Сумма) КАК НалоговаяБаза,
	|	СчетФактураВыданныйАвтоТранпорт.ДатаПодтвержденияНДС0 КАК ДатаПодтвержденияНДС0
	|ИЗ
	|	Документ.СчетФактураВыданный.АвтоТранпорт КАК СчетФактураВыданныйАвтоТранпорт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО СчетФактураВыданныйАвтоТранпорт.Ссылка = СчетФактураВыданный.Ссылка
	|ГДЕ
	|	СчетФактураВыданный.Авто
	|	И СчетФактураВыданный.Ссылка = &Ссылка
	|	И СчетФактураВыданныйАвтоТранпорт.ВключатьВОтчетДляФНС = ИСТИНА
	|	И СчетФактураВыданныйАвтоТранпорт.ДатаОтчетаДляФНС <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетФактураВыданный.Ссылка,
	|	СчетФактураВыданный.Контрагент,
	|	СчетФактураВыданный.ДоговорКонтрагента,
	|	СчетФактураВыданныйАвтоТранпорт.НомерДокумента,
	|	СчетФактураВыданныйАвтоТранпорт.ДатаДокумента,
	|	СчетФактураВыданныйАвтоТранпорт.КодНаправленияПрибытияУбытия,
	|	СчетФактураВыданныйАвтоТранпорт.ТаможеннаяНакладнаяВвоз,
	|	СчетФактураВыданныйАвтоТранпорт.НомерГТД,
	|	СчетФактураВыданныйАвтоТранпорт.Отправитель,
	|	СчетФактураВыданныйАвтоТранпорт.Отправитель_ИНН,
	|	СчетФактураВыданныйАвтоТранпорт.Отправитель_Наименование,
	|	СчетФактураВыданныйАвтоТранпорт.Отправитель_Адрес,
	|	СчетФактураВыданныйАвтоТранпорт.Получатель,
	|	СчетФактураВыданныйАвтоТранпорт.Получатель_ИНН,
	|	СчетФактураВыданныйАвтоТранпорт.Получатель_Наименование,
	|	СчетФактураВыданныйАвтоТранпорт.Получатель_Адрес,
	|	СчетФактураВыданныйАвтоТранпорт.Перевозчик,
	|	СчетФактураВыданныйАвтоТранпорт.Перевозчик_ИНН,
	|	СчетФактураВыданныйАвтоТранпорт.Перевозчик_Наименование,
	|	СчетФактураВыданныйАвтоТранпорт.Перевозчик_Адрес,
	|	СчетФактураВыданныйАвтоТранпорт.РегНомерАвтомобиля,
	|	СчетФактураВыданныйАвтоТранпорт.РегНомерПрицепа,
	|	СчетФактураВыданныйАвтоТранпорт.Контейнер,
	|	СчетФактураВыданныйАвтоТранпорт.СтранаПогрузки,
	|	СчетФактураВыданныйАвтоТранпорт.СтранаРазгрузки,
	|	СчетФактураВыданныйАвтоТранпорт.РегНомерТаможеннойДекларации,
	|	СчетФактураВыданныйАвтоТранпорт.ДатаОтчетаДляФНС,
	|	СчетФактураВыданныйАвтоТранпорт.ДатаПодтвержденияНДС0";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

КонецПроцедуры   

Процедура ТекстЗапросаТаблицаКонтрольПолученияДокументовНДС0(ТекстыЗапроса)

	ИмяРегистра = "КонтрольПолученияДокументовНДС0";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслугРасшифровкаУслугПоТС.ЖДН КАК ЖДН,
	|	СчетФактураВыданныйМорскойТранспорт.ДатаПодтвержденияНДС0 КАК ДатаРеестраФНС,
	|	СчетФактураВыданный.Фрахт КАК Фрахт,
	|	СчетФактураВыданныйМорскойТранспорт.ДатаПодтвержденияНДС0 КАК ДатаПодтвержденияНДС0
	|ИЗ
	|	Документ.СчетФактураВыданный.МорскойТранспорт КАК СчетФактураВыданныйМорскойТранспорт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО СчетФактураВыданныйМорскойТранспорт.Ссылка = СчетФактураВыданный.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.РасшифровкаУслугПоТС КАК РеализацияТоваровУслугРасшифровкаУслугПоТС
	|		ПО (РеализацияТоваровУслугРасшифровкаУслугПоТС.Коносамент = СчетФактураВыданныйМорскойТранспорт.Коносамент)
	|			И (РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка = СчетФактураВыданный.ДокументОснование)
	|			И (РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка = &ДокументОснование)
	|ГДЕ
	|	СчетФактураВыданный.Ссылка = &Ссылка
	|	И СчетФактураВыданный.Фрахт
	|	И СчетФактураВыданныйМорскойТранспорт.Коносамент <> ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|	И РеализацияТоваровУслугРасшифровкаУслугПоТС.ЖДН <> ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетФактураВыданныйПодтверждающиеДокументы.ЖДН,
	|	СчетФактураВыданныйПодтверждающиеДокументы.ДатаОтчетаДляФНС,
	|	СчетФактураВыданный.Фрахт,
	|	СчетФактураВыданныйПодтверждающиеДокументы.ДатаПодтвержденияНДС0
	|ИЗ
	|	Документ.СчетФактураВыданный.ПодтверждающиеДокументы КАК СчетФактураВыданныйПодтверждающиеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО СчетФактураВыданныйПодтверждающиеДокументы.Ссылка = СчетФактураВыданный.Ссылка
	|ГДЕ
	|	СчетФактураВыданный.Ссылка = &Ссылка
	|	И НЕ СчетФактураВыданный.Фрахт";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

КонецПроцедуры

// Процедура компонует текст запроса, выполняет запрос и выгружает результаты запроса в таблицы
// 
// Параметры:
//  Запрос - Запрос - запрос, параметры которого предварительно установлены.
//  ТекстыЗапроса - СписокЗначений из Строка - в списке перечислены тексты запросов и их имена.
//  Таблицы - Структура - структура в которую будут помещены полученные таблицы для движений.
//  ДобавитьРазделитель - Булево - Истина, если нужно добавить разделитель ";" между запросами.
//  ДобавлятьСловоТаблица - Булево - Истина, если к имени таблицы движений нужно в начало добавить слово "Таблица"
//  ТолькоОтмеченные - Булево - Только отмеченные регистры
Процедура ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, Таблицы, ДобавитьРазделитель = Ложь, ДобавлятьСловоТаблица = Истина, ТолькоОтмеченные=Ложь) Экспорт
	
	ТаблицыЗапроса = ВыгрузитьРезультатыЗапроса(Запрос, ТекстыЗапроса,, ДобавитьРазделитель);
	
	// Помещение результатов запроса в таблицы
	Для Каждого ТекстЗапроса из ТекстыЗапроса Цикл

		ИмяТаблицы = ТекстЗапроса.Представление;

		Если Не ПустаяСтрока(ИмяТаблицы) И (Не ТолькоОтмеченные Или ТекстЗапроса.Пометка) Тогда

			Если ДобавлятьСловоТаблица Тогда
				// Таблицы для проведения должны начинаться с "Таблица"
				Если НЕ СтрНачинаетсяС(ИмяТаблицы, "Таблица") Тогда
					ИмяТаблицы = "Таблица" + ИмяТаблицы;
				КонецЕсли;
			КонецЕсли;
			
			Таблицы.Вставить(ИмяТаблицы, ТаблицыЗапроса[ТекстЗапроса.Представление]);

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры     

// Формирует пакет запросов и возвращает результат каждого запроса
// 
// Параметры:
//  Запрос - Запрос - запрос, параметры которого предварительно установлены.
//  ТекстыЗапроса - СписокЗначений из Строка - в списке перечислены тексты запросов и их имена.
//  ОбходРезультата - ОбходРезультатаЗапроса - вариант обхода результата запроса.
//  ДобавитьРазделитель - Булево - Добавить разделитель
// 
// Возвращаемое значение:
//  Структура -- структура в которую помещены полученные таблицы
Функция ВыгрузитьРезультатыЗапроса(Запрос, ТекстыЗапроса, ОбходРезультата = Неопределено, ДобавитьРазделитель = Ложь)

	Таблицы = Новый Структура;
	
	Если ТекстыЗапроса.Количество() = 0 Тогда
		Возврат Таблицы;
	КонецЕсли;
	
	// Инициализация варианта обхода результата запроса.
	Если ОбходРезультата = Неопределено Тогда
		ОбходРезультата = ОбходРезультатаЗапроса.Прямой;
	КонецЕсли;
	
	МассивТекстаЗапроса = Новый Массив;
	
	// Формирование текст запроса.
	Для Каждого ТекстЗапроса из ТекстыЗапроса Цикл
		Если ЗначениеЗаполнено(ТекстЗапроса.Представление) Тогда
			МассивТекстаЗапроса.Добавить("// " + ТекстЗапроса.Представление);
		КонецЕсли; 
		МассивТекстаЗапроса.Добавить(ТекстЗапроса.Значение);
		Если ДобавитьРазделитель Тогда
			МассивТекстаЗапроса.Добавить("
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|");
		КонецЕсли;
	КонецЦикла;
	
	Запрос.Текст = СтрСоединить(МассивТекстаЗапроса, Символы.ПС);
	
	// Выполнение запроса.
	Результат = Запрос.ВыполнитьПакет();

	// Помещение результатов запроса в таблицы
	Для Каждого ТекстЗапроса из ТекстыЗапроса Цикл

		ИмяТаблицы = ТекстЗапроса.Представление;

		Если Не ПустаяСтрока(ИмяТаблицы) Тогда

			Индекс = ТекстыЗапроса.Индекс(ТекстЗапроса);
			Таблицы.Вставить(ИмяТаблицы, Результат[Индекс].Выгрузить(ОбходРезультата));

		КонецЕсли;

	КонецЦикла;

	Возврат Таблицы;
	
КонецФункции

//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 107705 23.04.2025 
//Автоподбор Счет фактуры по номеру для печати
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтрокаПоиска = СтрЗаменить(Параметры.СтрокаПоиска, """", ""); // нормализация
	
	Если СтрокаПоиска <> "" И Параметры.Свойство("ВводПоСтрокеРасширенный") Тогда
		
		МаксимумСтрокРезультата = 30;
		
		МассивСловПоиска = СтрРазделить(СтрокаПоиска, " ", Ложь);
		КоличествоСловПоиска = МассивСловПоиска.Количество();
		
		Если КоличествоСловПоиска > 0 Тогда
		
			СтандартнаяОбработка = Ложь;		
			СписокВыбора = Новый СписокЗначений;
			
			Запрос = Новый Запрос;
			
			УсловияПоиска = ""; 
			ПриоритетСортировки = "";
			Для НомерСловаПоиска = 1 По КоличествоСловПоиска Цикл
				
				СловоПоиска = МассивСловПоиска[НомерСловаПоиска - 1];
				ДлинаСловаПоиска = СтрДлина(СловоПоиска);
				
				Запрос.УстановитьПараметр("СловоПоиска" + НомерСловаПоиска, "%" + СловоПоиска + "%");
				УсловияПоиска = УсловияПоиска + "
				|	И СчетФактураВыданный.НомерДляПечати ПОДОБНО &СловоПоиска" + НомерСловаПоиска;
				
				ПриоритетСортировки = ПриоритетСортировки + СтрШаблон("
				|		КОГДА ПОДСТРОКА(СчетФактураВыданный.НомерДляПечати, 1, %1) = ""%2""
				|		  ТОГДА %3", Формат(ДлинаСловаПоиска, "ЧГ="), СловоПоиска, НомерСловаПоиска);
				
			КонецЦикла;
			
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ " + МаксимумСтрокРезультата + "
			|	СчетФактураВыданный.Ссылка КАК Ссылка,
			|	СчетФактураВыданный.НомерДляПечати КАК НомерДляПечати, 
			|	СчетФактураВыданный.ДатаДокумента КАК ДатаДокумента,
			|	СчетФактураВыданный.ПометкаУдаления КАК ПометкаУдаления,
			|	ВЫБОР" + ПриоритетСортировки + "
			|		ИНАЧЕ 9
			|	КОНЕЦ КАК ПриоритетСортировки
			|ИЗ
			|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
			|ГДЕ
			|	ИСТИНА" + УсловияПоиска + "
			|УПОРЯДОЧИТЬ ПО
			|	ПриоритетСортировки, НомерДляПечати";
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				СписокВыбора.Добавить(Новый Структура("Значение, ПометкаУдаления", Выборка.Ссылка, Выборка.ПометкаУдаления), 
							ПодсветитьСлова(Выборка.НомерДляПечати + " от " + Формат(Выборка.ДатаДокумента, "ДФ=dd.MM.yyyy"), МассивСловПоиска));
				
			КонецЦикла;
			
			ДанныеВыбора = СписокВыбора;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры     

//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 107705 23.04.2025
Функция ПодсветитьСлова(ИсходнаяСтрока, МассивСловПодсветки, Знач ШрифтПодсветки = Неопределено, Знач ЦветПодсветки = Неопределено)
	
	МассивРезультирующихСтрок = Новый Массив;
	
	Если ШрифтПодсветки = Неопределено Тогда
		ШрифтПодсветки = Новый Шрифт(,, Истина); // жирный
	КонецЕсли;
	
	Если ЦветПодсветки = Неопределено Тогда
		ЦветПодсветки = Новый Цвет(0, 153, 0); // светло-зеленый из стандартной подсветки ввода по строке
	КонецЕсли;
	
	ИсходнаяСтрокаНормализованная = НРег(ИсходнаяСтрока); // нормализация
	ДлинаИсходнойСтроки = СтрДлина(ИсходнаяСтрокаНормализованная);
	
	// получим список диапазонов символов для подсветки
	СписокДиапазонов = Новый СписокЗначений;
	Для НомерСлова = 1 По МассивСловПодсветки.Количество() Цикл
		СловоПодсветки = НРег(МассивСловПодсветки[НомерСлова - 1]); // нормализация
		ПозицияНачалаСлова = 1;
		ДлинаСлова = СтрДлина(СловоПодсветки);
		Пока ПозицияНачалаСлова <> 0 И ПозицияНачалаСлова <= ДлинаИсходнойСтроки Цикл
			ПозицияНачалаСлова = СтрНайти(ИсходнаяСтрокаНормализованная, СловоПодсветки, , ПозицияНачалаСлова);
			Если ПозицияНачалаСлова > 0 Тогда
				МассивДиапазона = Новый Массив;
				МассивДиапазона.Добавить(ПозицияНачалаСлова);
				МассивДиапазона.Добавить(ПозицияНачалаСлова + ДлинаСлова - 1);
				СписокДиапазонов.Добавить(МассивДиапазона, Формат(ПозицияНачалаСлова, "ЧЦ=3; ЧВН="));
				ПозицияНачалаСлова = ПозицияНачалаСлова + ДлинаСлова;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// отсортируем список диапазонов по возрастанию начал диапазонов
	СписокДиапазонов.СортироватьПоПредставлению();
	
	// сформируем массив результирующих строк с разным оформлением (подсветкой)
	СтартоваяПозиция = 1;
	Для Каждого ЭлементДиапазона Из СписокДиапазонов Цикл
		НачалоДиапазона = ЭлементДиапазона.Значение[0];
		КонецДиапазона = ЭлементДиапазона.Значение[1];
		Если НачалоДиапазона > СтартоваяПозиция Тогда // часть строки без подсветки
			ЧастьБезВыделения = Сред(ИсходнаяСтрока, СтартоваяПозиция, НачалоДиапазона - СтартоваяПозиция);
			МассивРезультирующихСтрок.Добавить(Новый ФорматированнаяСтрока(ЧастьБезВыделения));
			СтартоваяПозиция = НачалоДиапазона;
		КонецЕсли;
		Если КонецДиапазона >= СтартоваяПозиция Тогда // часть строки с подсветкой
			ЧастьВыделяемая = Сред(ИсходнаяСтрока, СтартоваяПозиция, КонецДиапазона - СтартоваяПозиция + 1);
			МассивРезультирующихСтрок.Добавить(Новый ФорматированнаяСтрока(ЧастьВыделяемая, ШрифтПодсветки, ЦветПодсветки));
			СтартоваяПозиция = КонецДиапазона + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если СтартоваяПозиция <= ДлинаИсходнойСтроки Тогда // "хвост" без выделения
		Хвост = Сред(ИсходнаяСтрока, СтартоваяПозиция, ДлинаИсходнойСтроки - СтартоваяПозиция + 1);
		МассивРезультирующихСтрок.Добавить(Новый ФорматированнаяСтрока(Хвост));
	КонецЕсли;
	
	Возврат Новый ФорматированнаяСтрока(МассивРезультирующихСтрок);
	
КонецФункции

#КонецОбласти
	
