
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Организация = Константы.ОсновнаяОрганизация.Получить();
	//Евросиб Каблов 09.04.2025 ( #105407
	//ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Организация);
	ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(Организация);
	//Евросиб Каблов 09.04.2025 )
	//	СтруктураПодписантовПоДоверенности = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиДействующиеДоверенностиНаПодпись(ТекущаяДата(),"Счет фактура выданный");
	//	ДоверенностьЗаРуководителя = СтруктураПодписантовПоДоверенности.ДоверенностьЗаРуководителя;
	//	ДоверенностьЗаГлБухгалтера = СтруктураПодписантовПоДоверенности.ДоверенностьЗаГБ;
	//
	Если ЗначениеЗаполнено(ДанныеЗаполнения) И ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		СчФ = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(ДанныеЗаполнения.Ссылка, "СчетФактураВыданный");
		Если СчФ = Неопределено Тогда
			БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьРеквизитыСчФПоОснованию(ДанныеЗаполнения, ЭтотОбъект);
		Иначе
			Комментарий = "ОТКАЗ";
			Сообщить("Уже существует счет-фактура, введенный на основании данного документа.")
		КонецЕсли;
	КонецЕсли;
	
	Маршрутизировать = Константы.МаршрутизироватьСФВ.Получить();

	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДоговорКонтрагента, "ПравилоФормированияДатыУслуги, ПериодичностьВыставленияДокументов, ДатаПаспортаСделки");
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("ДокументСсылка.КорректировкаРеализации") Тогда //Евросиб(ДИТ), Беляев СЮ, US 115224 / TA 115264, 25-07-2025, добавил условие
		ДатаДокумента = ФормированиеДатДокументов.УстановкаДатыДокумента(ЭтотОбъект, РеквизитыДоговора.ПравилоФормированияДатыУслуги,
																				 РеквизитыДоговора.ПериодичностьВыставленияДокументов,
																				 РеквизитыДоговора.ДатаПаспортаСделки);
	КонецЕсли;
	//ДатаДокумента = ФормированиеДатДокументов.УстановкаДатыДокумента(ЭтотОбъект,ДоговорКонтрагента.ПравилоФормированияДатыУслуги);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Евросиб Каблов 02.12.2020 ( Ticket#0215459 Проверка вызывается из обработчика ПередЗаписьюНаСервере формы документа
	////Евросиб Каблов 18.09.2020 (
	//КонтрольДоступностиДокументов_сервер.ПроверитьДоступностьПолейДляИзменения(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	//Если Отказ Тогда
	//	Возврат;
	//КонецЕсли;
	////Евросиб Каблов 18.09.2020 )
	//Евросиб Каблов 02.12.2020 )
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	
	УстановитьПредставлениеНомера();
//Гудкова	СуммаДокумента = Сумма;
	Если ЭтоНовый() Тогда
		Автор = Пользователи.ТекущийПользователь();
		Создано = ТекущаяДата();
	КонецЕсли; 
	
	// SIV 18-12-19 При перезаписи документа не должна меняться дата просто так
	//Если НЕ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
	//	ДатаДокумента = ФормированиеДатДокументов.УстановкаДатыДокумента(ЭтотОбъект,ДоговорКонтрагента.ПравилоФормированияДатыУслуги);
	//КонецЕсли;
	
	Если Не БезДоверенностей Тогда
		СтруктураПодписантовПоДоверенности = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиДействующиеДоверенностиНаПодпись(Дата,"Счет фактура выданный",ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование,"ЦФО"));
		ДоверенностьЗаРуководителя = СтруктураПодписантовПоДоверенности.ДоверенностьЗаРуководителя;
		ДоверенностьЗаГлБухгалтера = СтруктураПодписантовПоДоверенности.ДоверенностьЗаГБ;
	КонецЕсли;
	//Евросиб Каблов 15.07.2020 (
	//Если НомерДляПечати = "" Тогда
	ЦифровойИндексПодразделения = "";
	ДлинаИндекса = 0;
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		РеквизитВМетаданных = ДокументОснование.Метаданные().Реквизиты.Найти("ПодразделениеОрганизации");
		Если РеквизитВМетаданных <> Неопределено Тогда
			ПодразделениеОснования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "ПодразделениеОрганизации");
			Если ЗначениеЗаполнено(ПодразделениеОснования) Тогда
				ЦифровойИндексПодразделения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПодразделениеОснования, "ЦифровойИндексОбособленногоПодразделения");
				Если ЗначениеЗаполнено(ЦифровойИндексПодразделения) Тогда
					ЦифровойИндексПодразделения = "/" + Строка(ЦифровойИндексПодразделения);
					ДлинаИндекса = СтрДлина(ЦифровойИндексПодразделения);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Евросиб Фролов (26.01.2022 Ticket №0258238 
		НомерДокументаОснования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Номер");
		НомерСсылки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Номер");
		
		// Евросиб Фролов (31.01.2022 Ticket №0258238
		// Если это СФ на вознаграждение по отчету комитенту, то номер нужно взять из реквизита "РезервНомераВознаграждение" 
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
			Если НЕ ЗначениеЗаполнено(Продавец) Тогда
				НомерДокументаОснования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "РезервНомераВознаграждение.Номер"); 
			КонецЕсли;
		КонецЕсли;
		// Евросиб Фролов)
		
		Если НомерДокументаОснования <> Номер
			ИЛИ Номер <> НомерСсылки Тогда
			Номер = НомерДокументаОснования;
			НомерДляПечати = "";
		КонецЕсли;
		// Евросиб Фролов)
	КонецЕсли;
	ИндексВНомереДляПечати = Прав(НомерДляПечати, ДлинаИндекса);	
	Если НомерДляПечати = "" И ИндексВНомереДляПечати <> ЦифровойИндексПодразделения Тогда // SIV 12-03-21 было ИЛИ, но если номер для печати заполнен, то перезаполнять его не надо
	//Евросиб Каблов 15.07.2020 )
		Если Не ЗначениеЗаполнено(Номер)  Тогда
			УстановитьНовыйНомер();
		КонецЕсли;
		//Евросиб Каблов 15.07.2020 (
		//НомерДляПечати = Номер + ?(Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия,"/Р","/Н");
		НомерДляПечати = Номер + ?(Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия,"/Р","/Н") + ЦифровойИндексПодразделения;
		//Евросиб Каблов 15.07.2020 )
	КонецЕсли;
	//Евросиб - АСуслов 09.09.2022 11:12:50 #56897
	//(
	//ДИТ, Беляев СЮ, Ticket#0286013, 16-09-2022, начало  (реквизит ПравилоФормирования сейчас есть только в РТУ)
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
	//ДИТ, Беляев СЮ, Ticket#0286013, 16-09-2022, конец
		ПравилоФормированияДокументаОснования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "ПравилоФормирования");
		Если ЗначениеЗаполнено(ПравилоФормированияДокументаОснования) Тогда
			РазделительЭлементовНомераДляПечати = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПравилоФормированияДокументаОснования, "РазделительЭлементовНомераДляПечати");
			Если ЗначениеЗаполнено(РазделительЭлементовНомераДляПечати) Тогда
				НомерДляПечати = СтрЗаменить(НомерДляПечати, "/", РазделительЭлементовНомераДляПечати)
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//)
	//Евросиб - АСуслов 09.09.2022 11:13:57 #56897
	
	// + Состояния
	
	// проверяем корректность перечня состояний в ТЧ Состояния
	Для Сч = 0 По Состояния.Количество() - 2 Цикл
		ТекСостояние = Состояния[Сч].Состояние;
		Для ТекСч = Сч + 1 По Состояния.Количество() - 1 Цикл
			Если Состояния[ТекСч].Состояние = ТекСостояние Тогда
				Сообщить("Ошибка: одно состояние может встречаться в документе только один раз!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
		
	// для состояний отражаем логику движения статусов
	//Для Сч = 0 По Состояния.Количество() - 2 Цикл
	//	Если Состояния[Сч].Статус = Перечисления.СтатусыЭтапов.Выполнен И Состояния[Сч+1].Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//		Состояния[Сч+1].Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//		Если НЕ ЗначениеЗаполнено(Состояния[Сч+1].Исполнитель) Тогда
	//			Состояния[Сч+1].Исполнитель = Пользователи.ТекущийПользователь();
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	
	//++ Зубов 35844 05.08.2021
	////Стаценко Параллельное согласование
	//Для каждого СтрТЧ из Состояния Цикл
	//	Если Не ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//		СтрТЧ.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//        ПредыдущиеЭтапы = СтрТЧ.ПредыдущиеЭтапы;
	//		Попытка
	//			МассивЭтапов = СтрРазделить(ПредыдущиеЭтапы,",",Ложь);
	//		Исключение
	//			Сообщить("Некорректная строка предыдущих этапов");
	//		КонецПопытки;
	//		ВозможноВыполнение = Истина;
	//		Если МассивЭтапов.Количество() > 0 Тогда
	//			Для каждого Эл из МассивЭтапов Цикл
	//				Попытка
	//					НомСтр = Число(Эл);
	//					СтрЭтапа = Состояния.Найти(НомСтр,"НомерСтроки");
	//					Если СтрЭтапа <> Неопределено Тогда
	//						Если СтрЭтапа.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//							ВозможноВыполнение = Ложь;
	//						КонецЕсли;
	//					КонецЕсли;
	//				Исключение
	//					Сообщить("Некорректное указание этапа состояние. Возможен только ввод цифр.");
	//				КонецПопытки
	//			КонецЦикла;
	//		КонецЕсли;
	//		Если ВозможноВыполнение Тогда
	//			СтрТЧ.Статус =  Перечисления.СтатусыЭтапов.НаВыполнение;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	////Стаценко
	//МаршрутизацияСервер.ПараллельноеСогласование(Состояния); //ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, закомментировал (перенёс ниже)
	//-- Зубов 35844 05.08.2021
	
	// Маршрутизация заказа
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = 
	НЕ ЗначениеЗаполнено(Ссылка) ИЛИ 
	Ссылка.Организация <> Организация
	//Евросиб Каблов 11.02.2021 (
	//Или Ссылка.ДатаДокумента <> ДатаДокумента
	//Евросиб Каблов 11.02.2021 ) 
	ИЛИ Состояния.Количество() = 0;
	
	Если Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Организация);
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьСФВ(ПараметрыЗапроса, Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			УказанныеВручнуюИспНаблюдатель = Новый СписокЗначений;
			Если ДополнительныеСвойства.Свойство("ДопСвойстваОбъекта") тогда
				УказанныеВручнуюИспНаблюдатель = ДополнительныеСвойства.ДопСвойстваОбъекта;
			КонецЕсли;
			МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъект, РезультатЗапроса, Автор, УказанныеВручнуюИспНаблюдатель);			
		КонецЕсли;
	КонецЕсли;
	
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, начало
	МаршрутизацияСервер.ПараллельноеСогласование(Состояния);
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, конец
	
		// Заполняем этапы операции
	МаршрутизацияСервер.ПостобработкаТЧСостояний(ЭтотОбъект, Автор);

	
	// если исполнитель пустой, то проставляем тек пользователя
	Для каждого Стр из Состояния Цикл
		Если Стр.ПримечаниеЗадачаИсполнителю Тогда
			// если текст примечания изменился, то создать новое сообщение. если остался прежним, то не менять
			// т.к. состояние уникально, ищем по нему
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Состояние",Стр.Состояние);
			НайденнаяСтр = Ссылка.Состояния.НайтиСтроки(ПараметрыОтбора);
			Если НайденнаяСтр.Количество()>0 Тогда
				Если НЕ НайденнаяСтр[0].Комментарий = Стр.Комментарий Тогда
					
					// +Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					ДатаСообщения = ТекущаяДата();
					АвторСообщения = Пользователи.ТекущийПользователь();
					ТекстСообщения = Стр.Комментарий;
					ГУИДСообщения = Новый УникальныйИдентификатор();
					
					ГУИДТемы = Новый УникальныйИдентификатор;
					
					РассылкаПоЛичнымЦелям.СформироватьЛичноеСообщение(ГУИДТемы, , Ссылка, ДатаСообщения, АвторСообщения, ТекстСообщения, , ГУИДСообщения, Стр.Исполнитель);
					// -Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// определяем текущее состояние. для нас это первое состояние не в "выполнено"
	//Для каждого Состояние из Состояния Цикл
	//	Если Состояние.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//		ТекущееСостояние = Состояние.Состояние;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
		
	// - Состояния
	
	// Евросиб Фролов (01.12.2021 Task №43170 
	// Если установлена галочка "Фрахт" и не заполнена таблица "МорскойТранспорт", то заполним ее (аналогично кнопке "Заполнить" в перечне ГТД).
	Если Фрахт И МорскойТранспорт.Количество() = 0 
		//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 114194 Начало 24.07.2025
		или (Фрахт и не Ссылка.Фрахт) Тогда
		//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 114194 Конец 24.07.2025
		МорскойТранспорт.Очистить();
		ПодтверждающиеДокументы.Очистить();
		//БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьТЧНДС0ПоОснованию(ЭтотОбъект, ЭтотОбъект.ДокументОснование.РасшифровкаУслугПоТС);
		//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 114194 Начало 17.07.2025
		БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьТаблицыЧастичногоПодтвержденияНДС0(ЭтотОбъект, ЭтотОбъект.ДокументОснование, Ложь);

		//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 114194 Конец 17.07.2025
	КонецЕсли;	
	// Евросиб Фролов)
	
КонецПроцедуры

Процедура УстановитьПредставлениеНомера()
	
	Если НЕ ЗначениеЗаполнено(Номер) Тогда
		ЭтотОбъект.УстановитьНовыйНомер();	
	КонецЕсли;
	
	Если Исправление Тогда
		Если ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.Корректировочный Тогда
			ПредставлениеНомера = НомерИсправляемогоКорректировочногоДокумента + " (испр. "+ НомерИсправления+")";
		Иначе
			ПредставлениеНомера = НомерИсходногоДокумента + " (испр. "+ НомерИсправления+")";
		КонецЕсли;
	Иначе
		ПредставлениеНомера = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Номер, Истина, Ложь);		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Маршрутизировать = Константы.МаршрутизироватьСФВ.Получить();
	
	//Евросиб Каблов 22.07.2020 ( TASK 23506
	Выставлен = Ложь;
	ДатаВыставления = '00010101';
	//Евросиб Каблов 11.07.2020 ) TASK 23506
	Редактор = неопределено;
	Изменено = неопределено;
	Состояния.Очистить();
	ПериодВО = '00010101';
	НомерДляПечати = "";
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ДокументОснование.Проведен = Ложь Тогда
		Сообщить(СтрШаблон("Документ основание %1 не проведен, проведение счета-фактуры отменено", ДокументОснование));
		Отказ = Истина;
	КонецЕсли;
	
	//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 101301 Начало 17.04.2025
	//Было:
	//// ДИТ Поморцева Т.П. Задача 34586 23.06.2021 начало
	//
	//// ДИТ Поморцева Т.П. Задача 23.10.2021 начало
	////Если ЗначениеЗаполнено(ЭтотОбъект.ДатаОтчетаДляФНС) ИЛИ НЕ ЭтотОбъект.ДатаОтчетаДляФНС = Дата("00010101") Тогда
	//Если (НЕ Фрахт И ЗначениеЗаполнено(ЭтотОбъект.УдалитьДатаОтчетаДляФНС) И НЕ ЭтотОбъект.УдалитьДатаОтчетаДляФНС = Дата("00010101")) 
	//	ИЛИ (Фрахт И ЗначениеЗаполнено(ЭтотОбъект.УдалитьДатаПолногоПодтвержденияНДС0) И НЕ ЭтотОбъект.УдалитьДатаПолногоПодтвержденияНДС0 = Дата("00010101")) Тогда
	//	
	//	//ЗаписьРегистра = РегистрыСведений.КонтрольПолученияДокументовНДС0.СоздатьМенеджерЗаписи();
	//	//Евросиб - АСуслов 24.08.2021 18:10:29 #0241349
	//	//(
	//	//Если Фрахт Тогда
	//	//	Для Каждого Строка Из ЭтотОбъект.МорскойТранспорт Цикл
	//	//		// ДИТ Поморцева Т.П. Задача 0242763 08.09.21. начало
	//	//		Если ЗначениеЗаполнено(Строка.Коносамент) Тогда
	//	//		// ДИТ Поморцева Т.П. Задача 0242763 08.09.21. конец
	//	//			ЗаписьРегистра.ЖДН = Строка.Коносамент;
	//	//			ЗаписьРегистра.Прочитать();
	//	//			ЗаписьРегистра.ДатаРеестраФНС = ?(Фрахт,ЭтотОбъект.ДатаПолногоПодтвержденияНДС0,ЭтотОбъект.ДатаОтчетаДляФНС);
	//	//			ЗаписьРегистра.ЖДН = Строка.Коносамент;
	//	//			ЗаписьРегистра.Записать();
	//	//		КонецЕсли;
	//	//	КонецЦикла; 
	//	//Иначе	
	//	//	Для Каждого Строка Из ЭтотОбъект.ПодтверждающиеДокументы Цикл
	//	//		// ДИТ Поморцева Т.П. Задача 0242763 08.09.21. начало
	//	//		Если ЗначениеЗаполнено(Строка.ЖДН) Тогда
	//	//		// ДИТ Поморцева Т.П. Задача 0242763 08.09.21. конец
	//	//			ЗаписьРегистра.ЖДН = Строка.ЖДН;
	//	//			ЗаписьРегистра.Прочитать();
	//	//			ЗаписьРегистра.ДатаРеестраФНС = ?(Фрахт,ЭтотОбъект.ДатаПолногоПодтвержденияНДС0,ЭтотОбъект.ДатаОтчетаДляФНС);
	//	//			ЗаписьРегистра.ЖДН = Строка.ЖДН;
	//	//			ЗаписьРегистра.Записать();
	//	//		КонецЕсли;
	//	//	КонецЦикла; 
	//	//КонецЕсли; 
	//	//)
	//	//Евросиб - АСуслов 24.08.2021 18:10:32 #0241349 
	//		
	//	Если Фрахт Тогда
	//		
	//		Запрос = Новый Запрос;
	//		Запрос.Текст =
	//		"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//		|	СчетФактураВыданныйМорскойТранспорт.Коносамент КАК Коносамент,
	//		|	РеализацияТоваровУслугРасшифровкаУслугПоТС.ЖДН КАК ЖДН
	//		|ИЗ
	//		|	Документ.СчетФактураВыданный.МорскойТранспорт КАК СчетФактураВыданныйМорскойТранспорт
	//		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.РасшифровкаУслугПоТС КАК РеализацияТоваровУслугРасшифровкаУслугПоТС
	//		|		ПО СчетФактураВыданныйМорскойТранспорт.Ссылка.ДокументОснование = РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка
	//		|			И СчетФактураВыданныйМорскойТранспорт.Коносамент = РеализацияТоваровУслугРасшифровкаУслугПоТС.Коносамент
	//		|ГДЕ
	//		|	СчетФактураВыданныйМорскойТранспорт.Ссылка = &СсылкаСФВ
	//		|	И РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка = &СсылкаРТУ";
	//		
	//		Запрос.УстановитьПараметр("СсылкаСФВ",ЭтотОбъект.Ссылка);
	//		Запрос.УстановитьПараметр("СсылкаРТУ",ЭтотОбъект.ДокументОснование);
	//		
	//		ТаблицаЖДН = Запрос.Выполнить().Выгрузить();
	//		Для Каждого Строка Из ЭтотОбъект.МорскойТранспорт Цикл
	//			Если ЗначениеЗаполнено(Строка.Коносамент) Тогда					
	//				СтрокиЖДН = ТаблицаЖДН.НайтиСтроки(Новый Структура("Коносамент",Строка.Коносамент));
	//				Для Каждого СтрокаЖДН Из СтрокиЖДН Цикл
	//					Набор = РегистрыСведений.КонтрольПолученияДокументовНДС0.СоздатьНаборЗаписей();
	//					Набор.Отбор.ЖДН.Установить(СтрокаЖДН.ЖДН, Истина);
	//					Набор.Прочитать();	
	//					Для Каждого ЗаписьРегистра Из Набор Цикл
	//						ЗаписьРегистра.ДатаРеестраФНС = ?(Фрахт,ЭтотОбъект.УдалитьДатаПолногоПодтвержденияНДС0,ЭтотОбъект.УдалитьДатаОтчетаДляФНС);
	//					КонецЦикла;
	//					Набор.Записать();
	//				КонецЦикла;
	//			КонецЕсли;
	//		КонецЦикла; 
	//	Иначе	
	//		Для Каждого Строка Из ЭтотОбъект.ПодтверждающиеДокументы Цикл
	//			Если ЗначениеЗаполнено(Строка.ЖДН) Тогда
	//				Набор = РегистрыСведений.КонтрольПолученияДокументовНДС0.СоздатьНаборЗаписей();
	//				Набор.Отбор.ЖДН.Установить(Строка.ЖДН, Истина);
	//				Набор.Прочитать();	
	//				Для Каждого ЗаписьРегистра Из Набор Цикл
	//					ЗаписьРегистра.ДатаРеестраФНС = ?(Фрахт,ЭтотОбъект.УдалитьДатаПолногоПодтвержденияНДС0,ЭтотОбъект.УдалитьДатаОтчетаДляФНС);
	//				КонецЦикла;
	//				Набор.Записать();
	//			КонецЕсли;
	//		КонецЦикла; 
	//	КонецЕсли; 
	//		
	//	// ДИТ Поморцева Т.П. Задача 23.10.2021
	//КонецЕсли;
	//// ДИТ Поморцева Т.П. Задача 34586 23.06.2021 конец  
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;   
	
	Документы.СчетФактураВыданный.ИнициализироватьДанныеДокумента(ЭтотОбъект, ДополнительныеСвойства);
	ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект); 
	ЗагрузитьТаблицыДвижений(ДополнительныеСвойства, Движения);   
	
	ЗаписатьДвиженияРегистровСведений(ДополнительныеСвойства);
	//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 101301 Конец 17.04.2025
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	//Евросиб Каблов 28.07.2020 (
	СнятьПризнакВыставленУОснований = Неопределено;
	Если ДополнительныеСвойства.Свойство("СнятьПризнакВыставленУОснований", СнятьПризнакВыставленУОснований) И СнятьПризнакВыставленУОснований Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СчетФактураВыданныйДокументыОснования.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
		|ГДЕ
		|	СчетФактураВыданныйДокументыОснования.Ссылка = &Ссылка
		|	И СчетФактураВыданныйДокументыОснования.ДокументОснование.Выставлен";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДокОбъект = Выборка.ДокументОснование.ПолучитьОбъект();
			ДокОбъект.Выставлен = Ложь;
			ДокОбъект.ДатаВыставления = '00010101';
			ДокОбъект.ДополнительныеСвойства.Вставить("ЗапретитьЗаписыватьСчетФактуру", Истина);
			ДокОбъект.Записать();
			Диадок_Сервер.ОтвязатьДокумент1СОтДокументовПакетовДиадок(Выборка.ДокументОснование);
		КонецЦикла;
	КонецЕсли;
	//Евросиб Каблов 28.07.2020 )	
	
КонецПроцедуры

//Евросиб Каблов 08.07.2021 Ticket#0231661
Процедура СнятьПризнакВыставлен() Экспорт
	
	Если Выставлен Тогда
		НачатьТранзакцию();
		Выставлен = Ложь;
		ДатаВыставления = '00010101';
		ДополнительныеСвойства.Вставить("СнятьПризнакВыставленУОснований", Истина);
		Записать();
		Диадок_Сервер.ОтвязатьДокумент1СОтДокументовПакетовДиадок(Ссылка);
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

// ДИТ Поморцева Т.П. Задача 34586 13.07.21.
Процедура ОбработкаУдаленияПроведения(Отказ)

	Если Фрахт Тогда
		Для Каждого Строка Из ЭтотОбъект.МорскойТранспорт Цикл
			Если ЗначениеЗаполнено(Строка.Коносамент) Тогда
				Набор = РегистрыСведений.КонтрольПолученияДокументовНДС0.СоздатьНаборЗаписей();
				Набор.Отбор.ЖДН.Установить(Строка.Коносамент, Истина);
				Набор.Прочитать();
				Для Каждого ЗаписьРегистра Из Набор Цикл
					ЗаписьРегистра.ДатаРеестраФНС = Дата(1,1,1);
				КонецЦикла;
				Набор.Записать();
			КонецЕсли;
		КонецЦикла;
	Иначе
		//ЗаписьРегистра = РегистрыСведений.КонтрольПолученияДокументовНДС0.СоздатьМенеджерЗаписи();
		Для Каждого Строка Из ЭтотОбъект.ПодтверждающиеДокументы Цикл
			//ЗаписьРегистра.ЖДН = Строка.ЖДН;
			//ЗаписьРегистра.Прочитать();
			//Если ЗаписьРегистра.Выбран() Тогда
			//	ЗаписьРегистра.ДатаРеестраФНС = Дата(1,1,1);
			//	ЗаписьРегистра.Записать();
			//КонецЕсли;
			Если ЗначениеЗаполнено(Строка.ЖДН) Тогда				
				Набор = РегистрыСведений.КонтрольПолученияДокументовНДС0.СоздатьНаборЗаписей();
				Набор.Отбор.ЖДН.Установить(Строка.ЖДН, Истина);
				Набор.Прочитать();
				Для Каждого ЗаписьРегистра Из Набор Цикл
					ЗаписьРегистра.ДатаРеестраФНС = Дата(1,1,1);
				КонецЦикла;
				Набор.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 101301 18.04.2025
Процедура ПодготовитьНаборыЗаписейКРегистрацииДвижений(Документ)
	
	ИменаРегистровДляЗаписи = Новый Массив;
	
	РегистрыКОбработке = Документ.Метаданные().Движения;
	НаборыЗаписейКОбработке = Документ.Движения;
	
	Для Каждого НаборЗаписей Из НаборыЗаписейКОбработке Цикл
		
		// Очистим наборы записей от "старых записей" (ситуация возможна только в толстом клиенте)
		Если ЗначениеЗаполнено(НаборЗаписей) И Не НаборЗаписей.Записывать Тогда
			НаборЗаписей.Очистить();
		КонецЕсли;
		
	КонецЦикла;
	
	// Взведем флаг записи у наборов, по которым документ имеет движения
	Если Не Документ.ЭтоНовый() Тогда
		
		МассивИменРегистров = Новый Массив;
		МассивИменРегистров.Добавить("ПодтверждающиеДокументыНДС0_Море"); 
		МассивИменРегистров.Добавить("ПодтверждающиеДокументыНДС0_ЖД");
		МассивИменРегистров.Добавить("ПодтверждающиеДокументыНДС0_Авто");
		МассивИменРегистров.Добавить("ДокументыПодтвержденныеВОтчетеФНС");
		
		Для Каждого ИмяРегистра Из МассивИменРегистров Цикл
			Документ.Движения[ИмяРегистра].Записывать = Истина;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 101301 18.04.2025 
// Загружает ТаблицыДляДвижений в наборы записей регистров движений документа.
//
// Параметры:
//  ДополнительныеСвойства	 - Структура - Структура с дополнительными свойствами документа, используемыми при проведении.
//  										В структуре обязательно должен быть ключ "ТаблицыДляДвижений" содержащий массив таблиц значений.
//  Движения				 - КоллекцияДвижений - Коллекция движений документа.
//  НеЗагружатьТаблицы		 - Строка			 - Имена регистров, для которых не нужно загружать движения.
//
Процедура ЗагрузитьТаблицыДвижений(ДополнительныеСвойства, Движения, НеЗагружатьТаблицы = "") Экспорт
	
	Если НЕ ДополнительныеСвойства.Свойство("ТаблицыДляДвижений") Тогда
		Возврат;
	КонецЕсли;
	
	СписокИсключений = Новый Структура(НеЗагружатьТаблицы);
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	Для Каждого Таблица Из ТаблицыДляДвижений Цикл
		
		ИмяРегистра = Таблица.Ключ;
		Если ВРег(Лев(ИмяРегистра,7))= "ТАБЛИЦА" Тогда
			ИмяРегистра = Прав(ИмяРегистра, СтрДлина(ИмяРегистра)-7);
		КонецЕсли;
		
		Если СписокИсключений.Свойство(ИмяРегистра) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Таблица.Значение.Количество() > 0 И Движения.Найти(ИмяРегистра) <> Неопределено Тогда
			Движения[ИмяРегистра].Записывать = Истина;
			Движения[ИмяРегистра].Загрузить(Таблица.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 101301 18.04.2025
Процедура ЗаписатьДвиженияРегистровСведений(ДополнительныеСвойства)

	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	Для Каждого Таблица Из ТаблицыДляДвижений Цикл  
		
		ИмяРегистра = Таблица.Ключ;
		Если ВРег(Лев(ИмяРегистра,7))= "ТАБЛИЦА" Тогда
			ИмяРегистра = Прав(ИмяРегистра, СтрДлина(ИмяРегистра)-7);
		КонецЕсли;     
		
		Если Движения.Найти(ИмяРегистра) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Таблица.Значение.Количество() > 0 Тогда
			
			Если ИмяРегистра = "КонтрольПолученияДокументовНДС0" Тогда 
				
				Для каждого СтрокаЗаписи Из ТаблицыДляДвижений["ТАБЛИЦА" + ИмяРегистра] Цикл
					Набор = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
					Набор.Отбор.ЖДН.Установить(СтрокаЗаписи.ЖДН, Истина);
					Набор.Прочитать();	
					Для Каждого ЗаписьРегистра Из Набор Цикл
						ЗаписьРегистра.ДатаРеестраФНС = ?(Фрахт,СтрокаЗаписи.ДатаПодтвержденияНДС0,СтрокаЗаписи.ДатаРеестраФНС);
					КонецЦикла;
					Набор.Записать();
				КонецЦикла;
					
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

