Функция ПолучитьКонтакты(Ссылка) экспорт
	
	Результат = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗапросЪ.КонтактноеЛицо КАК ПользовательЗаявитель,
	               |	ЗапросЪ.ОтветственныйМенеджер КАК ОтветственныйМенеджер,
	               |	ЗапросЪ.Контрагент КАК КонтрагентЗаявитель
	               |ИЗ
	               |	Документ.Запрос КАК ЗапросЪ
	               |ГДЕ
	               |	ЗапросЪ.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат.Добавить(Ответ.ПользовательЗаявитель);
		Результат.Добавить(Ответ.ОтветственныйМенеджер);
		Результат.Добавить(Ответ.КонтрагентЗаявитель);
	КонецЕсли;

	Возврат результат;
	
КонецФункции

Функция ЗагрузитьEXCELЗаявка(ЭлементСправочникаФайлы) Экспорт
	
	Результат = Новый Структура("Успешно, ДокументСсылка", Истина, Новый Массив);
	
	ОписаниеФайла = РаботаСФайлами.ДанныеФайла(ЭлементСправочникаФайлы);
	ДДФайла = РаботаСФайлами.ДвоичныеДанныеФайла(ЭлементСправочникаФайлы);
	
	ИВФ = ПолучитьИмяВременногоФайла(ОписаниеФайла.Расширение);
	ДДФайла.Записать(ИВФ);
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Прочитать(ИВФ, СпособЧтенияЗначенийТабличногоДокумента.Текст);
	
	ИменаЛистов = Новый Массив;	
	Для каждого Стр из ТабДок.Области Цикл
		
		ИменаЛистов.Добавить(Стр.Имя);
		
	КонецЦикла;
	
	НачатьТранзакцию();
	
	Для каждого ЛистИмя из ИменаЛистов Цикл
		
		Лист = ТабДок.ПолучитьОбласть(ЛистИмя);
		
		КодФормы = Лист.Область("R2C2").Текст;
		
		Если КодФормы <> "FDC-002" Тогда Продолжить; КонецЕсли;
		
		Попытка
			
			ШапкаКонтрагент = Лист.Область("R5C3").Текст;
			ШапкаКонтрагентИНН = Лист.Область("R6C2").Текст;
			ШапкаКонтрагентКПП = Лист.Область("R6C4").Текст;
			ШапкаДоговорНомер = Лист.Область("R7C3").Текст;
			ШапкаДоговорДата = Лист.Область("R7C6").Текст;
			ШапкаПСЦНомер = Лист.Область("R8C3").Текст;
			ШапкаПСЦДата = Лист.Область("R8C6").Текст;
			
			ШапкаФИОМенеджера = Лист.Область("R5C11").Текст;
			ШапкаТелефон = Лист.Область("R6C11").Текст;
			ШапкаРезТелефон = Лист.Область("R7C11").Текст;
			ШапкаПочта = Лист.Область("R8C11").Текст;
			
			ШапкаОтправление = Лист.Область("R10C3").Текст;
			ШапкаПрибытие = Лист.Область("R10C6").Текст;
			
			ШапкаВнешнийНомер = Лист.Область("R9C3").Текст;;
			ШапкаВнешняяДата = Лист.Область("R9C6").Текст;;
			
			ШапкаКомментарий = Лист.Область("R73C3").Текст;
			
			СоставУслуг = Новый Массив;
			Для Сч = 14 По 71 Цикл
				НомерКТК = Лист.Область("R"+Сч+"C1").Текст;
				ТипКТК = Лист.Область("R"+Сч+"C2").Текст;
				
				Пломбы = Лист.Область("R"+Сч+"C3").Текст;
				ФИОВодителя = Лист.Область("R"+Сч+"C4").Текст;
				НомерАвто = Лист.Область("R"+Сч+"C5").Текст;
				ПунктОтправления = Лист.Область("R"+Сч+"C6").Текст;
				СтанцияОтправления = Лист.Область("R"+Сч+"C7").Текст;
				СтанцияНазначения = Лист.Область("R"+Сч+"C8").Текст;
				ПунктНазначения = Лист.Область("R"+Сч+"C9").Текст;
				
				Грузополучатель = Лист.Область("R"+Сч+"C10").Текст;
				НаименованиеГруза = Лист.Область("R"+Сч+"C11").Текст;
				КодГруза = Лист.Область("R"+Сч+"C12").Текст;
				ВесНетто = Лист.Область("R"+Сч+"C13").Текст;
				КолвоМест = Лист.Область("R"+Сч+"C14").Текст;
				Терминалка = Лист.Область("R"+Сч+"C15").Текст;
				ОсОтметки = Лист.Область("R"+Сч+"C16").Текст;
				ИнструкцияПоСдаче = Лист.Область("R"+Сч+"C17").Текст;
				
				Если ЗначениеЗаполнено(НомерКТК) ИЛИ ЗначениеЗаполнено(ТипКТК) Тогда
					
					СоставУслуг.Добавить(Новый Структура(
					"НомерКТК,ТипКТК,Пломбы,ФИОВодителя,НомерАвто,ПунктОтправления,СтанцияОтправления,СтанцияНазначения,ПунктНазначения,Грузополучатель,НаименованиеГруза,КодГруза,ВесНетто,КолвоМест,Терминалка,ОсОтметки,ИнструкцияПоСдаче",
					НомерКТК,ТипКТК,Пломбы,ФИОВодителя,НомерАвто,ПунктОтправления,СтанцияОтправления,СтанцияНазначения,ПунктНазначения,Грузополучатель,НаименованиеГруза,КодГруза,ВесНетто,КолвоМест,Терминалка,ОсОтметки,ИнструкцияПоСдаче
					));				
					
				КонецЕсли
				
			КонецЦикла;
			
		Исключение
			Результат.Успешно = Ложь;
			Прервать;
		КонецПопытки;
		
		////////////////////////////
		
		Контрагент = ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_ПолучитьКонтрагента(ШапкаКонтрагентИНН, ШапкаКонтрагентКПП, "", ШапкаКонтрагент);
		Договор = ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_ПолучитьДоговор(ШапкаДоговорНомер, ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_ОбработатьДату(ШапкаДоговорДата));
		ПСЦ = ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_ПолучитьПСЦ(ШапкаПСЦНомер, ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_ОбработатьДату(ШапкаПСЦДата), Договор);
		КонтакноеЛицо = ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_ПолучитьКонтакноеЛицо(ШапкаФИОМенеджера);
		Отправка = ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_ОбработатьДату(ШапкаОтправление);
		Прибытие = ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_ОбработатьДату(ШапкаПрибытие);
		Комментарий = ШапкаКомментарий;
		ВнешняяДата = ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_ОбработатьДату(ШапкаВнешняяДата);
		
		Если ЗначениеЗаполнено(Контрагент) Тогда
			
			НДок = Документы.Заявка.СоздатьДокумент();
			Ндок.Заполнить(неопределено);
			НДок.Дата = ТекущаяДата();
			НДок.Комментарий = Комментарий;
			Ндок.Контрагент = Контрагент;
			Ндок.Договор = Договор;
			НДок.ПСЦ = ПСЦ;
			Ндок.КонтактноеЛицо = КонтакноеЛицо;
			Ндок.Отправка = Отправка;
			Ндок.Прибытие = Прибытие;
			Ндок.ВнешнийНомер = ШапкаВнешнийНомер;
			Ндок.ВнешняяДата = ВнешняяДата;
			
			Для каждого Стр из СоставУслуг Цикл
				НСтр = НДок.СоставУслуги.Добавить();
				НСтр.ТипКТК = ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_ТипТЕ(Стр.ТипКТК);
				НСтр.НомерКТК = ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_ПолучитьКТК(Стр.НомерКТК, НСтр.ТипКТК);
				НСтр.Пломбы = Стр.Пломбы;
				НСтр.ФИОВодителя = Стр.ФИОВодителя;
				НСтр.НомерАвто = Стр.НомерАвто;
				НСтр.ПунктОтправления = ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_НайтиЛокацию_Слитно(Стр.ПунктОтправления);
				НСтр.СтанцияОтправления = ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_НайтиЛокацию_Слитно(Стр.СтанцияОтправления);
				НСтр.СтанцияНазначения = ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_НайтиЛокацию_Слитно(Стр.СтанцияНазначения);
				НСтр.ПунктНазначения = ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_НайтиЛокацию_Слитно(Стр.ПунктНазначения);
				НСтр.Груз = ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_НайтиГруз(""+Стр.КодГруза+"; "+Стр.НаименованиеГруза);
				
				НСТр.Грузополучатель =  ОбработкаВходящейКорреспонденции.ЗагрузкаДанных_НайтиГрузоотправителяПолучателя(Стр.Грузополучатель);
				
				НСтр.КодГруза = Стр.КодГруза;
				Попытка
					НСтр.ВесГрузаНетто = Число(СтрЗаменить(Стр.ВесНетто, ".", ","));
				Исключение
				КонецПопытки;
				Попытка
					НСтр.КоличествоМест = Число(Стр.КолвоМест);
				Исключение
				КонецПопытки;
				НСтр.ТерминальныеУслугиПоПрибытию = (Стр.Терминалка = "1");
				НСтр.ОсобыеОтметки = Стр.ОсОтметки;
				НСтр.ИнструкцииПоСдачеПорожнего = Стр.ИнструкцияПоСдаче;
			КонецЦикла;
			
			Попытка
				Ндок.Записать(РежимЗаписиДокумента.Запись);
				Ндок.Записать(РежимЗаписиДокумента.Проведение);
				Результат.ДокументСсылка.Добавить(НДок.Ссылка);
			Исключение
				Результат.Успешно = Ложь;
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Результат.Успешно Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		ОтменитьТранзакцию();
	КонецЕсли;
	
	УдалитьФайлы(ИВФ);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьГрузоотправителяПоПСЦ(ПСЦ) Экспорт
	
	Результат = неопределено;
	
	Если НЕ ЗначениеЗаполнено(ПСЦ) Тогда Возврат Результат; КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	МАКСИМУМ(ПОДСТРОКА(ПСЦКалькуляции.Калькуляция.ДокументОснование.Грузоотправитель.НаименованиеПолное, 1, 1000)) КАК Грузоотправитель
	               |ИЗ
	               |	Документ.ПСЦ.Калькуляции КАК ПСЦКалькуляции
	               |ГДЕ
	               |	ПСЦКалькуляции.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ПСЦ);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		
		Результат = Ответ.Грузоотправитель;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РасчетЗадолженностиПоЗаявке(Ссылка) Экспорт//Гудкова

	//тмп до утверждения алгоритма
	Возврат Ссылка.НаМоментЗаписиБылаЗадолженность;
	//	Если ДопСогласованиеУжеЕсть = Ложь И (ТекущийБалансКонтрагентаРУБ - ПлановаяСуммаУслуги < 0 ИЛИ СогласованоБезЗамечаний = Ложь) Тогда
		//	
		//	НаМоментЗаписиБылаЗадолженность = Истина;
		//	
		//КонецЕсли;


КонецФункции

Функция ИзменилсяСоставЗапроса(ЗаявкаОбъект) Экспорт
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗаявкаСписокЗапросНаКТК.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ЗаявкаСписокЗапросНаКТК.ТипКТК КАК ТипКТК,
	|	ЗаявкаСписокЗапросНаКТК.ДействиеРелизаНачало КАК ДействиеРелизаНачало,
	|	ЗаявкаСписокЗапросНаКТК.ДействиеРелизаОкончание КАК ДействиеРелизаОкончание,
	|	ЗаявкаСписокЗапросНаКТК.ЛокацияВыдачи КАК ЛокацияВыдачи,
	|	ЗаявкаСписокЗапросНаКТК.КомментарийКЛокацииВыдачи КАК КомментарийКЛокацииВыдачи,
	|	ЗаявкаСписокЗапросНаКТК.СрокИспользованияКТК КАК СрокИспользованияКТК,
	|	ЗаявкаСписокЗапросНаКТК.КомментарийКСрокуИспользованияКТК КАК КомментарийКСрокуИспользованияКТК,
	|	ЗаявкаСписокЗапросНаКТК.Ставка КАК Ставка,
	|	ЗаявкаСписокЗапросНаКТК.КомментарийКСтавке КАК КомментарийКСтавке,
	|	ЗаявкаСписокЗапросНаКТК.Автоперевозка КАК Автоперевозка,
	|	ЗаявкаСписокЗапросНаКТК.ФИОВодителяПерваяМиля КАК ФИОВодителяПерваяМиля,
	|	ЗаявкаСписокЗапросНаКТК.НомерТСПерваяМиля КАК НомерТСПерваяМиля,
	|	ЗаявкаСписокЗапросНаКТК.КоличествоКТК КАК КоличествоКТК,
	|	ЗаявкаСписокЗапросНаКТК.ВалютаПоДоговору КАК ВалютаПоДоговору,
	|	ЗаявкаСписокЗапросНаКТК.СНП КАК СНП,
	//ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 28.12.2022
	|ЗаявкаСписокЗапросНаКТК.СтанцияНазначенияПоЖД КАК СтанцияНазначенияПоЖД,
	|ЗаявкаСписокЗапросНаКТК.ДатаОтправленияПоЖДПлан КАК ДатаОтправленияПоЖДПлан
	//ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 28.12.2022
	// Евросиб Фролов (16.02.2022 Task №44768
	//|	ЗаявкаСписокЗапросНаКТК.КомпанияАвтоперевозчик КАК КомпанияАвтоперевозчик
	// Евросиб Фролов)
	|ПОМЕСТИТЬ втПоляСсылки
	|ИЗ
	|	Документ.Заявка.СписокЗапросНаКТК КАК ЗаявкаСписокЗапросНаКТК
	|ГДЕ
	|	ЗаявкаСписокЗапросНаКТК.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектСписокЗапросНаКТК.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ОбъектСписокЗапросНаКТК.ТипКТК КАК ТипКТК,
	|	ОбъектСписокЗапросНаКТК.ДействиеРелизаНачало КАК ДействиеРелизаНачало,
	|	ОбъектСписокЗапросНаКТК.ДействиеРелизаОкончание КАК ДействиеРелизаОкончание,
	|	ОбъектСписокЗапросНаКТК.ЛокацияВыдачи КАК ЛокацияВыдачи,
	|	ОбъектСписокЗапросНаКТК.КомментарийКЛокацииВыдачи КАК КомментарийКЛокацииВыдачи,
	|	ОбъектСписокЗапросНаКТК.СрокИспользованияКТК КАК СрокИспользованияКТК,
	|	ОбъектСписокЗапросНаКТК.КомментарийКСрокуИспользованияКТК КАК КомментарийКСрокуИспользованияКТК,
	|	ОбъектСписокЗапросНаКТК.Ставка КАК Ставка,
	|	ОбъектСписокЗапросНаКТК.КомментарийКСтавке КАК КомментарийКСтавке,
	|	ОбъектСписокЗапросНаКТК.Автоперевозка КАК Автоперевозка,
	|	ОбъектСписокЗапросНаКТК.ФИОВодителяПерваяМиля КАК ФИОВодителяПерваяМиля,
	|	ОбъектСписокЗапросНаКТК.НомерТСПерваяМиля КАК НомерТСПерваяМиля,
	|	ОбъектСписокЗапросНаКТК.КоличествоКТК КАК КоличествоКТК,
	|	ОбъектСписокЗапросНаКТК.ВалютаПоДоговору КАК ВалютаПоДоговору,
	|	ОбъектСписокЗапросНаКТК.СНП КАК СНП,
	//ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 28.12.2022
	|ОбъектСписокЗапросНаКТК.СтанцияНазначенияПоЖД КАК СтанцияНазначенияПоЖД,
	|ОбъектСписокЗапросНаКТК.ДатаОтправленияПоЖДПлан КАК ДатаОтправленияПоЖДПлан
	//ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 28.12.2022
	// Евросиб Фролов (16.02.2022 Task №44768
	//|	ОбъектСписокЗапросНаКТК.КомпанияАвтоперевозчик КАК КомпанияАвтоперевозчик
	// Евросиб Фролов)
	|ПОМЕСТИТЬ втПоляОбъекта
	|ИЗ
	|	&ОбъектСписокЗапросНаКТК КАК ОбъектСписокЗапросНаКТК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПоляОбъекта.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	втПоляСсылки КАК втПоляСсылки
	|		ПОЛНОЕ СОЕДИНЕНИЕ втПоляОбъекта КАК втПоляОбъекта
	|		ПО втПоляСсылки.ИдентификаторСтроки = втПоляОбъекта.ИдентификаторСтроки
	|ГДЕ
	|	(ЕСТЬNULL(втПоляОбъекта.ИдентификаторСтроки, """") <> ЕСТЬNULL(втПоляСсылки.ИдентификаторСтроки, """")
	|			ИЛИ ЕСТЬNULL(втПоляОбъекта.ТипКТК, """") <> ЕСТЬNULL(втПоляСсылки.ТипКТК, """")
	|			ИЛИ ЕСТЬNULL(втПоляОбъекта.ДействиеРелизаНачало, """") <> ЕСТЬNULL(втПоляСсылки.ДействиеРелизаНачало, """")
	|			ИЛИ ЕСТЬNULL(втПоляОбъекта.ДействиеРелизаОкончание, """") <> ЕСТЬNULL(втПоляСсылки.ДействиеРелизаОкончание, """")
	|			ИЛИ ЕСТЬNULL(втПоляОбъекта.ЛокацияВыдачи, """") <> ЕСТЬNULL(втПоляСсылки.ЛокацияВыдачи, """")
	|			ИЛИ ЕСТЬNULL(втПоляОбъекта.КомментарийКЛокацииВыдачи, """") <> ЕСТЬNULL(втПоляСсылки.КомментарийКЛокацииВыдачи, """")
	|			ИЛИ ЕСТЬNULL(втПоляОбъекта.СрокИспользованияКТК, """") <> ЕСТЬNULL(втПоляСсылки.СрокИспользованияКТК, """")
	|			ИЛИ ЕСТЬNULL(втПоляОбъекта.КомментарийКСрокуИспользованияКТК, """") <> ЕСТЬNULL(втПоляСсылки.КомментарийКСрокуИспользованияКТК, """")
	|			ИЛИ ЕСТЬNULL(втПоляОбъекта.Ставка, """") <> ЕСТЬNULL(втПоляСсылки.Ставка, """")
	|			ИЛИ ЕСТЬNULL(втПоляОбъекта.КомментарийКСтавке, """") <> ЕСТЬNULL(втПоляСсылки.КомментарийКСтавке, """")
	|			ИЛИ ЕСТЬNULL(втПоляОбъекта.Автоперевозка, """") <> ЕСТЬNULL(втПоляСсылки.Автоперевозка, """")
	|			ИЛИ ЕСТЬNULL(втПоляОбъекта.ФИОВодителяПерваяМиля, """") <> ЕСТЬNULL(втПоляСсылки.ФИОВодителяПерваяМиля, """")
	|			ИЛИ ЕСТЬNULL(втПоляОбъекта.НомерТСПерваяМиля, """") <> ЕСТЬNULL(втПоляСсылки.НомерТСПерваяМиля, """")
	|			ИЛИ ЕСТЬNULL(втПоляОбъекта.КоличествоКТК, """") <> ЕСТЬNULL(втПоляСсылки.КоличествоКТК, """")
	|			ИЛИ ЕСТЬNULL(втПоляОбъекта.ВалютаПоДоговору, """") <> ЕСТЬNULL(втПоляСсылки.ВалютаПоДоговору, """")
	|			ИЛИ ЕСТЬNULL(втПоляОбъекта.СНП, """") <> ЕСТЬNULL(втПоляСсылки.СНП, """"))
	//ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 28.12.2022
	|			ИЛИ ЕСТЬNULL(втПоляОбъекта.СтанцияНазначенияПоЖД, """") <> ЕСТЬNULL(втПоляСсылки.СтанцияНазначенияПоЖД, """")
	|			ИЛИ ЕСТЬNULL(втПоляОбъекта.ДатаОтправленияПоЖДПлан, """") <> ЕСТЬNULL(втПоляСсылки.ДатаОтправленияПоЖДПлан, """")";
	//ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 28.12.2022
	// Евросиб Фролов (16.02.2022 Task №44768
	//|			ИЛИ втПоляОбъекта.КомпанияАвтоперевозчик <> втПоляСсылки.КомпанияАвтоперевозчик)";
	// Евросиб Фролов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("Ссылка", ЗаявкаОбъект.Ссылка);
	Запрос.УстановитьПараметр("ОбъектСписокЗапросНаКТК", ЗаявкаОбъект.СписокЗапросНаКТК.Выгрузить());
	
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();
		
	// Евросиб Фролов)
КонецФункции

Функция ИзменилисьВодителиИПеревозчики(ЗаявкаОбъект,ЭтапПеревозки) Экспорт
	
	ТекстЗапроса =
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Начало
	//"ВЫБРАТЬ
	//|	ЗаявкаТранспортныеСредства.ИдентификаторСтрокиЗапроса КАК ИдентификаторСтрокиЗапроса,
	//|	ЗаявкаТранспортныеСредства.ИдентификаторСтроки КАК ИдентификаторСтроки,
	//|	ЗаявкаТранспортныеСредства.Автоперевозчик КАК Автоперевозчик,
	//|	ЗаявкаТранспортныеСредства.ИНН КАК ИНН,
	//|	ЗаявкаТранспортныеСредства.КПП КАК КПП
	//|ПОМЕСТИТЬ втПоляСсылки
	//|ИЗ
	//|	&ТранспортныеСредства КАК ЗаявкаТранспортныеСредства
	//|ГДЕ
	//|	ЗаявкаТранспортныеСредства.Ссылка = &Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ОбъектТранспортныеСредства.ИдентификаторСтрокиЗапроса КАК ИдентификаторСтрокиЗапроса,
	//|	ОбъектТранспортныеСредства.ИдентификаторСтроки КАК ИдентификаторСтроки,
	//|	ОбъектТранспортныеСредства.Автоперевозчик КАК Автоперевозчик,
	//|	ОбъектТранспортныеСредства.ИНН КАК ИНН,
	//|	ОбъектТранспортныеСредства.КПП КАК КПП
	//|ПОМЕСТИТЬ втПоляОбъекта
	//|ИЗ
	//|	&ОбъектСписокЗапросНаКТК КАК ОбъектТранспортныеСредства
	//|;
	"ВЫБРАТЬ
	|	ЗаявкаТранспортныеСредства.ИдентификаторСтрокиЗапроса КАК ИдентификаторСтрокиЗапроса,
	|	ЗаявкаТранспортныеСредства.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки
	|ПОМЕСТИТЬ втПоляСсылки1
	|ИЗ
	|	&ТранспортныеСредства КАК ЗаявкаТранспортныеСредства
	|ГДЕ
	|	ЗаявкаТранспортныеСредства.Ссылка = &Ссылка
	|;
	|ВЫБРАТЬ
	|	втПоляСсылки1.ИдентификаторСтрокиЗапроса КАК ИдентификаторСтрокиЗапроса,
	|	втПоляСсылки1.КлючАналитикиПеревозки КАК ИдентификаторСтроки,
	|	КлючиАналитикиПеревозкиМили.Автоперевозчик КАК Автоперевозчик,
	|	КлючиАналитикиПеревозкиМили.ИНН КАК ИНН,
	|	КлючиАналитикиПеревозкиМили.КПП КАК КПП
	|ПОМЕСТИТЬ втПоляСсылки
	|ИЗ
	|	втПоляСсылки1 КАК втПоляСсылки1
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
	|		ПО втПоляСсылки1.КлючАналитикиПеревозки = КлючиАналитикиПеревозкиМили.Ссылка
	|			И (КлючиАналитикиПеревозкиМили.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.ПерваяМиля))
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектТранспортныеСредства.ИдентификаторСтрокиЗапроса КАК ИдентификаторСтрокиЗапроса,
	|	ОбъектТранспортныеСредства.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки
	|ПОМЕСТИТЬ втПоляОбъекта1
	|ИЗ
	|	&ОбъектСписокЗапросНаКТК КАК ОбъектТранспортныеСредства
	|;
	|ВЫБРАТЬ
	|	втПоляОбъекта1.ИдентификаторСтрокиЗапроса КАК ИдентификаторСтрокиЗапроса,
	|	втПоляОбъекта1.КлючАналитикиПеревозки КАК ИдентификаторСтроки,
	|	КлючиАналитикиПеревозкиМили.Автоперевозчик КАК Автоперевозчик,
	|	КлючиАналитикиПеревозкиМили.ИНН КАК ИНН,
	|	КлючиАналитикиПеревозкиМили.КПП КАК КПП
	|ПОМЕСТИТЬ втПоляОбъекта
	|ИЗ
	|	втПоляОбъекта1 КАК втПоляОбъекта1
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
	|		ПО втПоляОбъекта1.КлючАналитикиПеревозки = КлючиАналитикиПеревозкиМили.Ссылка
	|			И (КлючиАналитикиПеревозкиМили.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.ПерваяМиля))
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПоляОбъекта.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	втПоляСсылки КАК втПоляСсылки
	|		ПОЛНОЕ СОЕДИНЕНИЕ втПоляОбъекта КАК втПоляОбъекта
	|		ПО втПоляСсылки.ИдентификаторСтроки = втПоляОбъекта.ИдентификаторСтроки
	|ГДЕ
	|	(ЕСТЬNULL(втПоляОбъекта.ИдентификаторСтроки, """") <> ЕСТЬNULL(втПоляСсылки.ИдентификаторСтроки, """")
	|			ИЛИ ЕСТЬNULL(втПоляОбъекта.ИдентификаторСтрокиЗапроса, """") <> ЕСТЬNULL(втПоляСсылки.ИдентификаторСтрокиЗапроса, """")
	|			ИЛИ ЕСТЬNULL(втПоляОбъекта.Автоперевозчик, """") <> ЕСТЬNULL(втПоляСсылки.Автоперевозчик, """")
	|			ИЛИ ЕСТЬNULL(втПоляОбъекта.ИНН, """") <> ЕСТЬNULL(втПоляСсылки.ИНН, """")
	|			ИЛИ ЕСТЬNULL(втПоляОбъекта.КПП, """") <> ЕСТЬNULL(втПоляСсылки.КПП, """"))";
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Конец
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("Ссылка", ЗаявкаОбъект.Ссылка);
	Если ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля Тогда
		Запрос.УстановитьПараметр("ОбъектСписокЗапросНаКТК", ЗаявкаОбъект.ТранспортныеСредства.Выгрузить());
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ТранспортныеСредства","Документ.Заявка.ТранспортныеСредства");
	Иначе
		Запрос.УстановитьПараметр("ОбъектСписокЗапросНаКТК", ЗаявкаОбъект.ТранспортныеСредстваПоследняяМиля.Выгрузить());
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ТранспортныеСредства","Документ.Заявка.ТранспортныеСредстваПоследняяМиля");
	КонецЕсли;

	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();
	
КонецФункции	

Функция ПолучитьПараметрыМаршрутизации(Объект) Экспорт
	
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыЗапроса.Вставить("Договор", Объект.Договор);
		ПараметрыЗапроса.Вставить("ИсточникЗаявки", Объект.ИсточникЗаявки);
		//Евросиб - АСуслов 24.12.2021 11:22:34 #44642
		//(
		//ПараметрыЗапроса.Вставить("УказанРейс", Объект.ПереченьРейсов.Количество() > 0);
		//)
		//Евросиб - АСуслов 24.12.2021 11:22:45 #44642
		ПараметрыЗапроса.Вставить("НаМоментЗаписиБылаЗадолженность", Объект.НаМоментЗаписиБылаЗадолженность);
		ПараметрыЗапроса.Вставить("ВидПеревозки", Объект.ВидПеревозки);  
		// ДИТ US 76975 ТА 76977 Сержантова А.С. Начало: 15.11.2023 - исключаем при определении маршрута в заявке
		//ПараметрыЗапроса.Вставить("ПротоколНеУказан",НЕ ЗначениеЗаполнено(Объект.ПСЦ));    
		// ДИТ US 76975 ТА 76977 Сержантова А.С. Конец: 15.11.2023
		// Евросиб Фролов (16.11.2021 TASK№ №41969
		ПараметрыЗапроса.Вставить("ЗапросНаКТК", Объект.ЗапросНаКТК);
		// Евросиб Фролов)
		// Евросиб US 126930 TA 126932 Рыбьяков К.А. 19.01.2026 ((
		ЛокацииВыдачи = ОбщегоНазначения.ВыгрузитьКолонку(Объект.СписокЗапросНаКТК, "ЛокацияВыдачи", Истина);
		ПараметрыЗапроса.Вставить("ЛокацииВыдачи", ЛокацииВыдачи);
		// Евросиб Рыбьяков К.А. 19.01.2026 ))
		Возврат ПараметрыЗапроса;
	
КонецФункции

Функция ТребуетсяМаршрутизацияДляОбъекта_ДополнительноДляЗаявки(Объект) Экспорт
	ТребуетсяМаршрутизацияДляОбъекта = 	// ДИТ US 76975 TA 76977 Сержантова А.С. Начало: 15.11.2023 
										//перемаршрутизируем, если ранее примененный маршрут был удален
										//(ЗначениеЗаполнено(Объект.Ссылка.ПСЦ) И НЕ ЗначениеЗаполнено(Объект.ПСЦ)) 
										//ИЛИ (НЕ ЗначениеЗаполнено(Объект.Ссылка.ПСЦ) И ЗначениеЗаполнено(Объект.ПСЦ)) 
										(ЗначениеЗаполнено(Объект.ПримененныйМаршрут) и ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ПримененныйМаршрут, "ПометкаУдаления"))
										// ДИТ US 76975 TA 76977 Сержантова А.С. Конец: 15.11.2023
										ИЛИ Документы.Заявка.ИзменилсяСоставЗапроса(Объект) // Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
										ИЛИ Документы.Заявка.ИзменилисьВодителиИПеревозчики(Объект,Перечисления.ЭтапыПеревозки.ПерваяМиля); //ДИТ Шевченко А.В. 53562 18.10.2022 
	Возврат ТребуетсяМаршрутизацияДляОбъекта;                                                        
КонецФункции

// Евросиб Фролов (2.03.2022 Task №44768
Процедура ОбновитьВнутреннийСтатусЗапроса(Документ, Проведен, ТекущееСостояние, ТекущийСтатус) Экспорт
	
	Если Проведен = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущееСостояние = Справочники.Состояния.ВводЗапросаНаКТК
		И ТекущийСтатус = Перечисления.СтатусыЭтапов.Выполнен Тогда
		Документ.ВнутреннийСтатусЗапроса = Перечисления.ВнутренниеСтатусыЗапросовНаКТК.НеВзятВРаботу;
	ИначеЕсли ТекущееСостояние = Справочники.Состояния.БронированиеКТК
		И ТекущийСтатус = Перечисления.СтатусыЭтапов.Выполнен Тогда
		Документ.ВнутреннийСтатусЗапроса = Перечисления.ВнутренниеСтатусыЗапросовНаКТК.ВзятВРаботу;
	ИначеЕсли ТекущееСостояние = Справочники.Состояния.БронированиеКТК
		И ТекущийСтатус = Перечисления.СтатусыЭтапов.Отклонен Тогда
		Документ.ВнутреннийСтатусЗапроса = Перечисления.ВнутренниеСтатусыЗапросовНаКТК.Отработан;
		ВернутьМаршрутКВводуЗапроса(Документ);
	ИначеЕсли ТекущееСостояние = Справочники.Состояния.РелизНаВыдачуКТККлиенту
		И (ТекущийСтатус = Перечисления.СтатусыЭтапов.Отклонен ИЛИ ТекущийСтатус = Перечисления.СтатусыЭтапов.Выполнен) Тогда
		Документ.ВнутреннийСтатусЗапроса = Перечисления.ВнутренниеСтатусыЗапросовНаКТК.Отработан;
		Если ТекущийСтатус = Перечисления.СтатусыЭтапов.Отклонен Тогда
			ВернутьМаршрутКВводуЗапроса(Документ);
		КонецЕсли;	
	КонецЕсли;
				
КонецПроцедуры

Процедура ВернутьМаршрутКВводуЗапроса(Документ)	
	СостояниеВводЗапросаНаКТК = Справочники.Состояния.ВводЗапросаНаКТК;
	
	СтрокиСостояния = Документ.Состояния.НайтиСтроки(Новый Структура("Состояние", СостояниеВводЗапросаНаКТК));
	
	Если СтрокиСостояния.Количество() > 0 Тогда
		НайденнаяСтрока = СтрокиСостояния[0];
		НайденнаяСтрока.Статус = Перечисления.СтатусыЭтапов.ВРаботе;
	КонецЕсли;
КонецПроцедуры
// Евросиб Фролов)

// Евросиб Фролов (28.04.2022 Task №50233

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт	
	// Запрос на КТК
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.Заявка";
    КомандаПечати.Идентификатор = "ЗапросНаКТК";
    КомандаПечати.Представление = "Запрос на КТК";
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
    УправлениеПечатью.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, 
	                                                  "ЗапросНаКТК", 
	                                                  Истина,
	                                                  ВидСравнения.Равно);
КонецПроцедуры
												  
// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	// Запрос на КТК
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗапросНаКТК");
	
	Если НужноПечататьМакет Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        										КоллекцияПечатныхФорм,
       											"ЗапросНаКТК",
        										"Запрос на КТК",
        										ПечатьЗапросаНаКТК(МассивОбъектов, ОбъектыПечати),
        										,
        										"Документ.Заявка.ПФ_MXL_ЗапросНаКТК");
																						
	КонецЕсли;										
	
КонецПроцедуры

// Функция возвращает табличный документ запроса на КТК
//
// Параметры:
//  МассивОбъектов - Массив - объекты, по которым требуется сформировать печатную форму;
//  ОбъектыПечати  - СписокЗначений - разметка табличных документов по печатаемым объектам:
//   * Значение      - ЛюбаяСсылка - печатаемый объект;
//   * Представление - Строка - имя области, соответствующее объекту.
// 
// Возвращаемое значение:
//  ТабличныйДокумент - печатная форма.
//
Функция ПечатьЗапросаНаКТК(МассивОбъектов, ОбъектыПечати) Экспорт
    
	// Создаем табличный документ и устанавливаем имя параметров печати.
    ТабличныйДокумент = Новый ТабличныйДокумент;
    ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ЗапросНаКТК";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Заявка.ПФ_MXL_ЗапросНаКТК");
	
	// Получаем запросом необходимые данные.
    Запрос = Новый Запрос();
    Запрос.Текст =
    "ВЫБРАТЬ
    |	Заявка.Ссылка КАК Ссылка,
    |	Заявка.Номер КАК Номер,
    |	Заявка.Дата КАК Дата,
    |	Заявка.Контрагент КАК Контрагент
    |ИЗ
    |	Документ.Заявка КАК Заявка
    |ГДЕ
    |	Заявка.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;
	
	Пока Шапка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
            // Все документы нужно выводить на разных страницах.
            ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
        НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
        
		/////////////////////////////////////////////////////////////
		ТаблицаЗапросов = ПолучитьТаблицуЗапросовНаКТК(Шапка.Ссылка);
		
		// Номера заявок для печати их в основании
		НомерЗаявки = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Шапка.Номер);
		
		ДанныеПечати = Новый Структура;
        ДанныеПечати.Вставить("НомерЗаявки", НомерЗаявки);
		ДанныеПечати.Вставить("ДатаЗаявки",  Шапка.Дата);
		ДанныеПечати.Вставить("Контрагент",  Шапка.Контрагент);
														
		МассивОбластейМакета = Новый Массив;
		
		МассивОбластейМакета.Добавить("Заголовок");
		МассивОбластейМакета.Добавить("Строка");
								
		Для Каждого ИмяОбласти Из МассивОбластейМакета Цикл
			
			ОбластьМакета = Макет.ПолучитьОбласть(ИмяОбласти);
			
			Если ИмяОбласти <> "Строка" Тогда
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Иначе
				//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Начало
				//ТабличныеЧастиЗапроса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Шапка.Ссылка, "ТранспортныеСредства");
				//ТабличныеЧастиЗапросаПоследняяМиля = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Шапка.Ссылка, "ТранспортныеСредстваПоследняяМиля");
				//ТранспортныеСредства = ТабличныеЧастиЗапроса.ТранспортныеСредства.Выгрузить();	
				//ТранспортныеСредстваПоследняяМиля = ТабличныеЧастиЗапросаПоследняяМиля.ТранспортныеСредстваПоследняяМиля.Выгрузить();		
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЗаявкаТранспортныеСредства.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
				|	ЗаявкаТранспортныеСредства.ИдентификаторСтрокиЗапроса КАК ИдентификаторСтрокиЗапроса,
				|	КлючиАналитикиПеревозкиМили.ФИОВодителя КАК ФИОВодителя,
				|	КлючиАналитикиПеревозкиМили.ПаспортныеДанные КАК ПаспортныеДанные,
				|	КлючиАналитикиПеревозкиМили.РегНомерТС КАК РегНомерТС,
				|	КлючиАналитикиПеревозкиМили.Автоперевозчик КАК Автоперевозчик,
				|	КлючиАналитикиПеревозкиМили.ИНН КАК ИНН,
				|	КлючиАналитикиПеревозкиМили.КПП КАК КПП,
				|	ЗаявкаТранспортныеСредства.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.Заявка.ТранспортныеСредства КАК ЗаявкаТранспортныеСредства
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
				|		ПО ЗаявкаТранспортныеСредства.КлючАналитикиПеревозки = КлючиАналитикиПеревозкиМили.Ссылка
				|			И (КлючиАналитикиПеревозкиМили.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.ПерваяМиля))
				|ГДЕ
				|	ЗаявкаТранспортныеСредства.Ссылка = &Ссылка
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ЗаявкаТранспортныеСредстваПоследняяМиля.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
				|	КлючиАналитикиПеревозкиМили.Ссылка.Контейнер КАК Контейнер,
				|	КлючиАналитикиПеревозкиМили.ФИОВодителя КАК ФИОВодителя,
				|	КлючиАналитикиПеревозкиМили.ПаспортныеДанные КАК ПаспортныеДанные,
				|	КлючиАналитикиПеревозкиМили.РегНомерТС КАК РегНомерТС,
				|	КлючиАналитикиПеревозкиМили.Автоперевозчик КАК Автоперевозчик,
				|	КлючиАналитикиПеревозкиМили.ИНН КАК ИНН,
				|	КлючиАналитикиПеревозкиМили.КПП КАК КПП,
				|	ЗаявкаТранспортныеСредстваПоследняяМиля.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.Заявка.ТранспортныеСредстваПоследняяМиля КАК ЗаявкаТранспортныеСредстваПоследняяМиля
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
				|		ПО ЗаявкаТранспортныеСредстваПоследняяМиля.КлючАналитикиПеревозки = КлючиАналитикиПеревозкиМили.Ссылка
				|			И (КлючиАналитикиПеревозкиМили.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.ПоследняяМиля))
				|ГДЕ
				|	ЗаявкаТранспортныеСредстваПоследняяМиля.Ссылка = &Ссылка";
				
				Запрос.УстановитьПараметр("Ссылка", Шапка.Ссылка);
				
				РезультатЗапроса = Запрос.ВыполнитьПакет();
				ТранспортныеСредства = РезультатЗапроса[0].Выгрузить();
				ТранспортныеСредстваПоследняяМиля = РезультатЗапроса[1].Выгрузить();
				//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -конец
				Для Каждого СтрокаТаблицы Из ТаблицаЗапросов Цикл
					// Шапка
					ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
					ОбластьШапка.Параметры.Заполнить(СтрокаТаблицы);
					ТабличныйДокумент.Вывести(ОбластьШапка);
					
					ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
					ТабличныйДокумент.Вывести(ОбластьМакета);
					
					//ДИТ Шевченко А.В. TASK 51973 01.06.2022 -Начало
					Если СтрокаТаблицы.Автоперевозка = Перечисления.ВариантыАвтоперевозки.СиламиКлиента
						ИЛИ СтрокаТаблицы.ПоследняяМиля = Перечисления.ВариантыАвтоперевозки.СиламиКлиента Тогда
						ОбластьЗаголовокАвтоперевозки = Макет.ПолучитьОбласть("ЗаголовокАвтоперевозки");
						ОбластьЗаголовокАвтоперевозки.Параметры.НомерСтроки = СтрокаТаблицы.НомерСтроки;
						ТабличныйДокумент.Вывести(ОбластьЗаголовокАвтоперевозки);
					КонецЕсли;
					//ДИТ Шевченко А.В. TASK 51973 01.06.2022 -Конец
					
					Если СтрокаТаблицы.Автоперевозка = Перечисления.ВариантыАвтоперевозки.СиламиКлиента Тогда
						ПараметрыОтбора = Новый Структура("ИдентификаторСтрокиЗапроса", СтрокаТаблицы.ИдентификаторСтроки);
						ТранспортныеСредстваЗапроса = ТранспортныеСредства.Скопировать(ПараметрыОтбора);
												
						ВывестиСведенияОбАвтоперевозке(ТабличныйДокумент, Макет, ТранспортныеСредстваЗапроса, СтрокаТаблицы.НомерСтроки,"Данные по автоперевозке на первой миле");
					Иначе
						// Данные по автоперевозке берем из релиза клиента.
						Если ЗначениеЗаполнено(СтрокаТаблицы.РелизКлиента) Тогда
							//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -начало
							//РеквизитыРелизаКлиента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТаблицы.РелизКлиента, "ТранспортныеСредства");
							//ТранспортныеСредстваЗапроса = РеквизитыРелизаКлиента.ТранспортныеСредства.Выгрузить();
							ТранспортныеСредстваЗапроса = ЗаполнитьТранспортныеСредстваСиламиЕвросиб(Шапка.Ссылка).Скопировать(Новый Структура("ЭтапПеревозки",Перечисления.ЭтапыПеревозки.ПерваяМиля));
							//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -конец
							ВывестиСведенияОбАвтоперевозке(ТабличныйДокумент, Макет, ТранспортныеСредстваЗапроса, СтрокаТаблицы.НомерСтроки,"Данные по автоперевозке на первой миле");
						КонецЕсли;
					КонецЕсли;
					//ДИТ Шевченко А.В. TASK 51973 01.06.2022 -Начало
					Если СтрокаТаблицы.ПоследняяМиля = Перечисления.ВариантыАвтоперевозки.СиламиКлиента Тогда
						ПараметрыОтбора = Новый Структура("ИдентификаторСтрокиЗапроса", СтрокаТаблицы.ИдентификаторСтроки);
						ТранспортныеСредстваЗапроса = ТранспортныеСредстваПоследняяМиля.Скопировать(ПараметрыОтбора);
												
						ВывестиСведенияОбАвтоперевозке(ТабличныйДокумент, Макет, ТранспортныеСредстваЗапроса, СтрокаТаблицы.НомерСтроки,"Данные по автоперевозке на последней миле");
					Иначе
						// Данные по автоперевозке берем из релиза клиента.
						Если ЗначениеЗаполнено(СтрокаТаблицы.РелизКлиента) Тогда
							//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -начало
							//РеквизитыРелизаКлиента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТаблицы.РелизКлиента, "ТранспортныеСредстваПоследняяМиля");
							//ТранспортныеСредстваЗапроса = РеквизитыРелизаКлиента.ТранспортныеСредстваПоследняяМиля.Выгрузить();	
							ТранспортныеСредстваЗапроса = ЗаполнитьТранспортныеСредстваСиламиЕвросиб(Шапка.Ссылка).Скопировать(Новый Структура("ЭтапПеревозки",Перечисления.ЭтапыПеревозки.ПоследняяМиля));
							//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -конец
							ВывестиСведенияОбАвтоперевозке(ТабличныйДокумент, Макет, ТранспортныеСредстваЗапроса, СтрокаТаблицы.НомерСтроки,"Данные по автоперевозке на последней миле");
						КонецЕсли;
					КонецЕсли;
					//ДИТ Шевченко А.В. TASK 51973 01.06.2022 -Конец
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
			
        // В табличном документе необходимо задать имя области, в которую был 
        // выведен объект. Нужно для возможности печати комплектов документов.
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
    КонецЦикла;
	
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура ВывестиСведенияОбАвтоперевозке(ТабличныйДокумент, Макет, ТранспортныеСредства, НомерСтроки,ТекстМиля)	
	
	//ДИТ Шевченко А.В. 59945 06.10.2022 -Начало
	КоличествоВодителей = ТранспортныеСредства.Количество();
	
	ЕстьСведенияОВодителях = КоличествоВодителей > 0;
	ЕстьКонтейнер = Ложь;
	Если ЕстьСведенияОВодителях Тогда
		Если ТипЗнч(ТранспортныеСредства[0].Ссылка) = Тип("ДокументСсылка.Заявка") Тогда
			ЕстьКонтейнер          = ТранспортныеСредства.Колонки.Найти("Контейнер") <> Неопределено;
		КонецЕсли;
	КонецЕсли;
	 
	Если ЕстьСведенияОВодителях = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ОбластьЗаголовокЗаголовокШапкиАвтоперевозки = Макет.ПолучитьОбласть("ЗаголовокШапкиАвтоперевозки");
	ОбластьЗаголовокЗаголовокШапкиАвтоперевозки.Параметры.ТекстМиля = ТекстМиля;
	ТабличныйДокумент.Вывести(ОбластьЗаголовокЗаголовокШапкиАвтоперевозки);
	
	ОбластьШапкаВодителейНомерСтроки = Макет.ПолучитьОбласть("ШапкаАвтоперевозки|ВодительНомерСтроки");
	ОбластьШапкаВодителейКонтейнер   = Макет.ПолучитьОбласть("ШапкаАвтоперевозки|ВодительКонтейнер");
	ОбластьШапкаВодителей 			 = Макет.ПолучитьОбласть("ШапкаАвтоперевозки|Водитель");
		
	ОбластьСтрокаВодителейНомерСтроки = Макет.ПолучитьОбласть("СтрокаАвтоперевозки|ВодительНомерСтроки");
	ОбластьСтрокаВодителейКонтейнер   = Макет.ПолучитьОбласть("СтрокаАвтоперевозки|ВодительКонтейнер");
	ОбластьСтрокаВодителей            = Макет.ПолучитьОбласть("СтрокаАвтоперевозки|Водитель");
	
	Если ЕстьСведенияОВодителях Тогда
		ТабличныйДокумент.Вывести(ОбластьШапкаВодителейНомерСтроки);
		Если ЕстьКонтейнер Тогда
			ТабличныйДокумент.Присоединить(ОбластьШапкаВодителейКонтейнер);
		КонецЕсли;	
		ТабличныйДокумент.Присоединить(ОбластьШапкаВодителей);
	КонецЕсли;
	 
	МаксимальныйИндекс = КоличествоВодителей - 1;
	
	Для Индекс = 0 По МаксимальныйИндекс Цикл
		
		Если ЕстьСведенияОВодителях Тогда
			Если Индекс < КоличествоВодителей Тогда 
				СтрокаВодителя = ТранспортныеСредства[Индекс];
				ОбластьСтрокаВодителей.Параметры.Заполнить(СтрокаВодителя);
				ОбластьСтрокаВодителейКонтейнер.Параметры.Заполнить(СтрокаВодителя);
				ОбластьСтрокаВодителейНомерСтроки.Параметры.НомПП = Индекс + 1;
			Иначе
				// Очистим область
				ОбластьСтрокаВодителейНомерСтроки = Макет.ПолучитьОбласть("СтрокаАвтоперевозкиПустая|ВодительНомерСтроки");
				ОбластьСтрокаВодителейКонтейнер   = Макет.ПолучитьОбласть("СтрокаАвтоперевозкиПустая|ВодительКонтейнер");
				ОбластьСтрокаВодителей 			  = Макет.ПолучитьОбласть("СтрокаАвтоперевозкиПустая|Водитель");
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьСтрокаВодителейНомерСтроки);
			Если ЕстьКонтейнер Тогда
				ТабличныйДокумент.Присоединить(ОбластьСтрокаВодителейКонтейнер);
			КонецЕсли;
			ТабличныйДокумент.Присоединить(ОбластьСтрокаВодителей);
		КонецЕсли;
				
	КонецЦикла;	
	//ДИТ Шевченко А.В. 59945 06.10.2022 -Конец
КонецПроцедуры	

Функция ПолучитьТаблицуЗапросовНаКТК(Заявка)

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗаявкаСписокЗапросНаКТК.НомерСтроки КАК НомерСтроки,
	|	ЗаявкаСписокЗапросНаКТК.КоличествоКТК КАК КоличествоКТК,
	|	ЗаявкаСписокЗапросНаКТК.ТипКТК КАК ТипКТК,
	|	ЗаявкаСписокЗапросНаКТК.ДействиеРелизаНачало КАК ДействиеРелизаДатаНачала,
	|	ЗаявкаСписокЗапросНаКТК.ДействиеРелизаОкончание КАК ДействиеРелизаДатаОкончания,
	|	ЗаявкаСписокЗапросНаКТК.ЛокацияВыдачи КАК ЛокацияВыдачи,
	|	ЗаявкаСписокЗапросНаКТК.ЛокацияСдачи КАК ЛокацияСдачи,
	|	ЗаявкаСписокЗапросНаКТК.СрокИспользованияКТК КАК СрокИспользованияКТК,
	|	ЗаявкаСписокЗапросНаКТК.Автоперевозка КАК Автоперевозка,
	|	ЗаявкаСписокЗапросНаКТК.ПоследняяМиля КАК ПоследняяМиля,
	|	РелизыКлиентовЗапросовНаКТК.РелизКлиента.НомерРелиза КАК НомерРелиза,
	|	ЗаявкаСписокЗапросНаКТК.КомментарийКРелизу КАК КомментарийКРелизу,
	|	РелизыКлиентовЗапросовНаКТК.РелизКлиента.ТерминалВыдачи КАК ТерминалВыдачи,
	|	РелизыКлиентовЗапросовНаКТК.РелизКлиента.СтокВыдачи КАК СтокВыдачи,
	|	РелизыКлиентовЗапросовНаКТК.РелизКлиента КАК РелизКлиента,
	|	ЗаявкаСписокЗапросНаКТК.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	Документ.Заявка.СписокЗапросНаКТК КАК ЗаявкаСписокЗапросНаКТК
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РелизыКлиентовЗапросовНаКТК КАК РелизыКлиентовЗапросовНаКТК
	|		ПО ЗаявкаСписокЗапросНаКТК.Ссылка = РелизыКлиентовЗапросовНаКТК.Заявка
	|			И ЗаявкаСписокЗапросНаКТК.ИдентификаторСтроки = РелизыКлиентовЗапросовНаКТК.ИдентификаторСтрокиЗаявки
	|ГДЕ
	|	ЗаявкаСписокЗапросНаКТК.Ссылка = &Заявка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Заявка", Заявка);
	
	ТаблицаЗапросов = Запрос.Выполнить().Выгрузить();
	
	// Добавим в таблицу запросов сведения по инструкциям по сдаче
	ТаблицаЗапросов.Колонки.Добавить("ИнструкцияПоСдаче");
	ТаблицаЗапросов.Колонки.Добавить("ДействиеРелизаНачало");
	ТаблицаЗапросов.Колонки.Добавить("ДействиеРелизаОкончание");
	
	МассивРелизов = ТаблицаЗапросов.ВыгрузитьКолонку("РелизКлиента");
	ИнструкцииРелизов = ТекстИнструкцииРелизаКлиента(МассивРелизов);
	
	Для Каждого ТекущаяСтрока Из ТаблицаЗапросов Цикл
		ТекущаяСтрока.ИнструкцияПоСдаче = ИнструкцииРелизов.Получить(ТекущаяСтрока.РелизКлиента);
		ТекущаяСтрока.ДействиеРелизаНачало = Формат(ТекущаяСтрока.ДействиеРелизаДатаНачала, "ДЛФ=D");
		ТекущаяСтрока.ДействиеРелизаОкончание = Формат(ТекущаяСтрока.ДействиеРелизаДатаОкончания, "ДЛФ=D");
	КонецЦикла;	
	
	Возврат ТаблицаЗапросов;
	
КонецФункции

Функция ТекстИнструкцииРелизаКлиента(МассивРелизовКлиентов) Экспорт
	
	// Нужно проверить, что по всем непустым строкам в контейнерах релиза клиента одинаковые значения в колонке "Инструкция по сдаче".
	// Если все одинаковые, то возвращаем текст инстркции. Если есть отличия, то возвращаем текст о том, что инструкции различны.	
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РелизКлиентаКонтейнеры.Ссылка КАК РелизКлиента,
	// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 02.02.2023
	// Было:
	//РелизКлиентаКонтейнеры.ИнструкцияПоСдаче КАК ИнструкцияПоСдаче
	//Стало:
	|	РелизКлиентаКонтейнеры.КлючАналитикиПеревозки.ИнструкцияПоСдаче КАК ИнструкцияПоСдаче
	// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 02.02.2023
	|ПОМЕСТИТЬ втИнструкцииРелизов
	|ИЗ
	|	Документ.РелизКлиента.Контейнеры КАК РелизКлиентаКонтейнеры
	|ГДЕ
	|	РелизКлиентаКонтейнеры.Ссылка В(&РелизыКлиентов)
	// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 02.02.2023
	// Было:
	//И РелизКлиентаКонтейнеры.ИнструкцияПоСдаче <> ""
	//Стало:
	|	И РелизКлиентаКонтейнеры.КлючАналитикиПеревозки.ИнструкцияПоСдаче <> """"
	// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 02.02.2023
	|;
	|
	////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИнструкцииРелизов.РелизКлиента КАК РелизКлиента,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ втИнструкцииРелизов.ИнструкцияПоСдаче) КАК КоличествоИнструкций
	|ПОМЕСТИТЬ втКоличествоИнструкций
	|ИЗ
	|	втИнструкцииРелизов КАК втИнструкцииРелизов
	|
	|СГРУППИРОВАТЬ ПО
	|	втИнструкцииРелизов.РелизКлиента
	|;
	|
	////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втИнструкцииРелизов.РелизКлиента КАК РелизКлиента,
	|	ВЫБОР
	|		КОГДА втКоличествоИнструкций.КоличествоИнструкций = 0
	|			ТОГДА """"
	|		КОГДА втКоличествоИнструкций.КоличествоИнструкций = 1
	|			ТОГДА втИнструкцииРелизов.ИнструкцияПоСдаче
	|		ИНАЧЕ &ТекстИнструкции
	|	КОНЕЦ КАК ИнструкцияПоСдаче
	|ИЗ
	|	втИнструкцииРелизов КАК втИнструкцииРелизов
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКоличествоИнструкций КАК втКоличествоИнструкций
	|		ПО втИнструкцииРелизов.РелизКлиента = втКоличествоИнструкций.РелизКлиента";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("РелизыКлиентов", МассивРелизовКлиентов);
	Запрос.УстановитьПараметр("ТекстИнструкции", "Инструкции различаются. Необходимо запросить уточнение у сотрудника отдела подряда");
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ИнструкцииРелизов = Новый Соответствие;
	Для Каждого ТекущийРелиз Из МассивРелизовКлиентов Цикл
		Инструкция = "";
		СтрокаИнструкции = Результат.Найти(ТекущийРелиз, "РелизКлиента");
		Если СтрокаИнструкции <> Неопределено Тогда
			Инструкция = СтрокаИнструкции.ИнструкцияПоСдаче;
		КонецЕсли;	
		ИнструкцииРелизов.Вставить(ТекущийРелиз, Инструкция);
	КонецЦикла;	
	
	Возврат ИнструкцииРелизов;
КонецФункции	
// Евросиб Фролов)  

//++ДИТ Гаузер А.В. BUG 51648 TA 56121 16.08.2022
Функция НеобходимоОчиститьЛокацию(Локация) Экспорт
	
	Результат = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Локация) Тогда
		Возврат Результат;
	КонецЕсли; 
	
	МассивТиповЛокацийПодлежащихОчистке = Новый Массив();
	МассивТиповЛокацийПодлежащихОчистке.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Сток"));
	МассивТиповЛокацийПодлежащихОчистке.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Терминал"));
	МассивТиповЛокацийПодлежащихОчистке.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Порт"));
	МассивТиповЛокацийПодлежащихОчистке.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.СтанцияЖД"));
	МассивТиповЛокацийПодлежащихОчистке.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Улица"));
	
	Если НЕ МассивТиповЛокацийПодлежащихОчистке.Найти(Локация.Тип) = Неопределено Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
//--ДИТ Гаузер А.В. BUG 51648 TA 56121 16.08.2022

// ++ Евросиб Дудоров С.В. US 57543 30.01.2023 
Функция ИзменитьЗаявкуПоРефСцепу(ЗаявкаОБъект, РефСцепИсходный) Экспорт   
	
	НеобходимаЗаписьОбъекта = Ложь;
	
	Если ЗаявкаОБъект.ДокументОснование <> РефСцепИсходный Тогда
		ЗаявкаОБъект.ДокументОснование = РефСцепИсходный;
		СинхронизироватьДанныеСРефСцепом(ЗаявкаОБъект);		
		НеобходимаЗаписьОбъекта = Истина;
	КонецЕсли;	
	
	ДобавитьКонтейнерыПодбора(ЗаявкаОБъект, РефСцепИсходный, НеобходимаЗаписьОбъекта);	

	Возврат НеобходимаЗаписьОбъекта;
	
КонецФункции
Процедура СинхронизироватьДанныеСРефСцепом(ЗаявкаОБъект)    
	
	ДанныеИзРефСцепа = РефСцепСервер.ПолучитьДанныеЗаполненияЗаявкиНаОснованииРефСцепаПоКлючам
		(ЗаявкаОБъект.ДокументОснование, ЗаявкаОБъект.СоставУслуги.Выгрузить().ВыгрузитьКолонку("КлючАналитикиПеревозки"));
		
	ДанныеПоКонтейнерам 	 = ДанныеИзРефСцепа.ДанныеПоКонтейнерам;
	Шапка               	 = ДанныеИзРефСцепа.Шапка;
	ДанныеКлиента			 = ДанныеИзРефСцепа.ДанныеКлиента;
	
	ЕстьИзменения = Ложь;

	Пока Шапка.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Шапка.ПланируемоеОтправление) Тогда
			Продолжить;
		КонецЕсли;	
		Для каждого СтрУслуг из ЗаявкаОБъект.СоставУслуги Цикл
			ЗаполнитьЗначенияСвойств(СтрУслуг, Шапка);
		КонецЦикла;	
		Если Шапка.ПланируемоеОтправление <> ЗаявкаОБъект.Отправка Тогда
			ЗаявкаОБъект.Отправка = Шапка.ПланируемоеОтправление;
			ЕстьИзменения   = истина;
		КонецЕсли;	
		Если Шапка.ПланируемоеПрибытие <> ЗаявкаОБъект.Прибытие Тогда
			ЗаявкаОБъект.Прибытие = Шапка.ПланируемоеПрибытие;
			ЕстьИзменения   = истина;
		КонецЕсли;	
		Если ЗаявкаОБъект.ПереченьРейсов.Количество()>0 ТОгда
			Если ЗаявкаОБъект.ПереченьРейсов[0].Рейс <> Шапка.Рейс Тогда
				ЗаявкаОБъект.ПереченьРейсов[0].Рейс 	 =  Шапка.Рейс;
				ЗаявкаОБъект.ПереченьРейсов[0].Продукт =  Шапка.Продукт;
				ЕстьИзменения = истина;
				Если не ЗначениеЗаполнено(ЗаявкаОБъект.ПереченьРейсов[0].Рейс) Тогда
					ЗаявкаОБъект.ПереченьРейсов.Очистить();
				КонецЕсли;	
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(Шапка.Рейс) Тогда
				НоваяСтрока = ЗаявкаОБъект.ПереченьРейсов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Шапка,"Рейс, Продукт");
				ЕстьИзменения = истина;
			КонецЕсли;	
		КонецЕсли;

		тзСоставУслуги = ЗаявкаОБъект.СоставУслуги.Выгрузить();
		Пока ДанныеПоКонтейнерам.Следующий() Цикл
			мСоставаУслуг = ЗаявкаОБъект.СоставУслуги.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки", ДанныеПоКонтейнерам.КлючАналитикиПеревозки));
			Для каждого СтрокаУслуги Из мСоставаУслуг Цикл
				ЗаполнитьЗначенияСвойств(СтрокаУслуги, ДанныеПоКонтейнерам);
				СтрокаУслуги.НомерКТК = ДанныеПоКонтейнерам.Контейнер;
				//ЗаполнитьСвязанныеПоляПринадлежностьТЕ(СтрокаУслуги);
			КонецЦикла;	
		КонецЦикла;
	КонецЦикла; 
			
КонецПроцедуры	
// Сначала заполняются заявки в строках ТЧ Контейнеры реф.сцепа при подборе. Потом все заявки становятся в очередь на отложенное
// изменение. Затем реф сцеп ставится на изменение по заявке и поля "заявки подбора" очищаются.
Процедура ДобавитьКонтейнерыПодбора(ЗаявкаОБъект, РефСцепИсходный, НеобходимаЗаписьОбъекта)

	ДанныеИзРефСцепа = РефСцепСервер.ПолучитьДанныеЗаполненияКонтейнеровЗаявкиПодбора
		(РефСцепИсходный, ЗаявкаОБъект.Ссылка);
		
	Пока ДанныеИзРефСцепа.Следующий() Цикл
		//НеобходимаЗаписьОбъекта = Истина;
		СтрокиПодобранныхКонтейнеровВЗаявке = ЗаявкаОБъект.СоставУслуги.НайтиСтроки(
			Новый Структура("НомерКТК", ДанныеИзРефСцепа.Контейнер));
		Если СтрокиПодобранныхКонтейнеровВЗаявке.Количество()>0 Тогда	
			Для каждого стр из СтрокиПодобранныхКонтейнеровВЗаявке Цикл
				Если стр.КлючАналитикиПеревозки <> ДанныеИзРефСцепа.КлючАналитикиПеревозки Тогда 
					НеобходимаЗаписьОбъекта = Истина;
					
					ЗаполнитьЗначенияСвойств(Стр, ДанныеИзРефСцепа);	
				
                КонецЕсли;
			КонецЦикла;
		Иначе	
			
			НеобходимаЗаписьОбъекта = Истина;
			
			НоваяСтрока = ЗаявкаОБъект.СоставУслуги.Добавить(); 

			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЗаявкаОБъект.СоставУслуги[0], "ПСЦ");
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеИзРефСцепа);
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.ПСЦ) Тогда 
				НоваяСтрока.ПСЦ = ЗаявкаОБъект.ПСЦ; 
			КонецЕсли;
			
		КонецЕсли;	
	КонецЦикла;
	
	Если НеобходимаЗаписьОбъекта Тогда
		ОтложенноеИзменениеСервер.ПоставитьРефСцепВОчередьИзменения(РефСцепИсходный, ЗаявкаОБъект.Ссылка);
	КонецЕсли;	
			
КонецПроцедуры

Функция МассивУдаляемыхКТКИзЗаявкиПоРефСцепу(ЗаявкаОБъект, РефСцепИсходный) Экспорт
	// 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РефСцепВагоныРефСцепа.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	РефСцепВагоныРефСцепа.Контейнер КАК Контейнер,
		|	РефСцепВагоныРефСцепа.ПеренесенВРефСцеп КАК ПеренесенВРефСцеп
		|ПОМЕСТИТЬ вт_ИсходныйРефСцеп
		|ИЗ
		|	Документ.РефСцеп.ВагоныРефСцепа КАК РефСцепВагоныРефСцепа
		|ГДЕ
		|	РефСцепВагоныРефСцепа.Ссылка = &РефСцепИсходный
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РефСцепКонтейнеры.КлючАналитикиПеревозки,
		|	РефСцепКонтейнеры.Контейнер,
		|	РефСцепКонтейнеры.ПеренесенВРефСцеп
		|ИЗ
		|	Документ.РефСцеп.Контейнеры КАК РефСцепКонтейнеры
		|ГДЕ
		|	РефСцепКонтейнеры.Ссылка = &РефСцепИсходный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаявкаСоставУслуги.НомерКТК КАК НомерКТК,
		|	ЗаявкаСоставУслуги.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки
		|ПОМЕСТИТЬ вт_Заявка0
		|ИЗ
		|	&ТаблицаУслугЗаявки КАК ЗаявкаСоставУслуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаявкаСоставУслуги.НомерКТК КАК НомерКТК,
		|	ЗаявкаСоставУслуги.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	ТЕ.Наименование КАК КонтейнерНаименование
		|ПОМЕСТИТЬ вт_Заявка
		|ИЗ
		|	вт_Заявка0 КАК ЗаявкаСоставУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
		|		ПО ЗаявкаСоставУслуги.НомерКТК = ТЕ.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РефСцепВагоныРефСцепа.Контейнер КАК Контейнер,
		|	РефСцепВагоныРефСцепа.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки
		|ПОМЕСТИТЬ вт_КонтейнерыВДругихРефСцепах
		|ИЗ
		|	Документ.РефСцеп.ВагоныРефСцепа КАК РефСцепВагоныРефСцепа
		|ГДЕ
		|	РефСцепВагоныРефСцепа.Ссылка.РейсЗавершен = ЛОЖЬ
		|	И РефСцепВагоныРефСцепа.Ссылка.Проведен = ИСТИНА
		|	И РефСцепВагоныРефСцепа.Ссылка <> &РефСцепИсходный
		|	И РефСцепВагоныРефСцепа.ПеренесенВРефСцеп = ЗНАЧЕНИЕ(Документ.РефСцеп.ПустаяСсылка)
		|	И РефСцепВагоныРефСцепа.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РефСцепКонтейнеры.Контейнер,
		|	РефСцепКонтейнеры.КлючАналитикиПеревозки
		|ИЗ
		|	Документ.РефСцеп.Контейнеры КАК РефСцепКонтейнеры
		|ГДЕ
		|	РефСцепКонтейнеры.Ссылка.РейсЗавершен = ЛОЖЬ
		|	И РефСцепКонтейнеры.Ссылка.Проведен = ИСТИНА
		|	И РефСцепКонтейнеры.Ссылка <> &РефСцепИсходный
		|	И РефСцепКонтейнеры.ПеренесенВРефСцеп = ЗНАЧЕНИЕ(Документ.РефСцеп.ПустаяСсылка)
		|	И РефСцепКонтейнеры.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		//|	И НЕ РефСцепКонтейнеры.Контейнер В (&МассивКонтейнеров)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вт_Заявка.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	вт_Заявка.КонтейнерНаименование КАК КонтейнерНаименование
		|ИЗ
		|	вт_Заявка КАК вт_Заявка
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ИсходныйРефСцеп КАК вт_ИсходныйРефСцеп
		|		ПО вт_Заявка.КлючАналитикиПеревозки = вт_ИсходныйРефСцеп.КлючАналитикиПеревозки
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_КонтейнерыВДругихРефСцепах КАК вт_КонтейнерыВДругихРефСцепах
		|		ПО вт_Заявка.КлючАналитикиПеревозки = вт_КонтейнерыВДругихРефСцепах.КлючАналитикиПеревозки
		|ГДЕ
		|	ЕСТЬNULL(вт_ИсходныйРефСцеп.КлючАналитикиПеревозки, ЗНАЧЕНИЕ(Справочник.КлючиАналитикиПеревозки.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиПеревозки.ПустаяСсылка)
		|	И ЕСТЬNULL(вт_КонтейнерыВДругихРефСцепах.КлючАналитикиПеревозки, ЗНАЧЕНИЕ(Справочник.КлючиАналитикиПеревозки.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиПеревозки.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вт_Заявка.КлючАналитикиПеревозки,
		|	вт_Заявка.КонтейнерНаименование
		|ИЗ
		|	вт_Заявка КАК вт_Заявка
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ИсходныйРефСцеп КАК вт_ИсходныйРефСцеп
		|		ПО вт_Заявка.КлючАналитикиПеревозки = вт_ИсходныйРефСцеп.КлючАналитикиПеревозки
		|ГДЕ
		|	ЕСТЬNULL(вт_ИсходныйРефСцеп.ПеренесенВРефСцеп, ЗНАЧЕНИЕ(Документ.РефСцеп.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Документ.РефСцеп.ПустаяСсылка)";
	Запрос.УстановитьПараметр("ТаблицаУслугЗаявки", ЗаявкаОБъект.СоставУслуги.Выгрузить());
	Запрос.УстановитьПараметр("РефСцепИсходный", РефСцепИсходный);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("КонтейнерНаименование");
	
КонецФункции	
// -- Евросиб Дудоров С.В. US 57543 30.01.2023 

Функция ЗаполнитьТранспортныеСредстваСиламиЕвросиб(Ссылка) Экспорт //ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗапросНаАвтоперевозкуКонтейнеры.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	ЗаявкаСписокЗапросНаКТК.ИдентификаторСтроки КАК ИдентификаторСтроки
		|ПОМЕСТИТЬ ВТ_Ключи
		|ИЗ
		|	Документ.Заявка.СписокЗапросНаКТК КАК ЗаявкаСписокЗапросНаКТК
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
		|		ПО ЗаявкаСписокЗапросНаКТК.Ссылка = ЗапросНаАвтоперевозкуКонтейнеры.Ссылка
		|ГДЕ
		|	ЗаявкаСписокЗапросНаКТК.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РелизКлиентаКонтейнеры.КлючАналитикиПеревозки,
		|	ЗаявкаСписокЗапросНаКТК.ИдентификаторСтроки
		|ИЗ
		|	Документ.Заявка.СписокЗапросНаКТК КАК ЗаявкаСписокЗапросНаКТК
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РелизыКлиентовЗапросовНаКТК КАК РелизыКлиентовЗапросовНаКТК
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РелизКлиента.Контейнеры КАК РелизКлиентаКонтейнеры
		|			ПО РелизыКлиентовЗапросовНаКТК.РелизКлиента = РелизКлиентаКонтейнеры.Ссылка
		|		ПО ЗаявкаСписокЗапросНаКТК.Ссылка = РелизыКлиентовЗапросовНаКТК.Заявка
		|			И ЗаявкаСписокЗапросНаКТК.ИдентификаторСтроки = РелизыКлиентовЗапросовНаКТК.ИдентификаторСтрокиЗаявки
		|ГДЕ
		|	ЗаявкаСписокЗапросНаКТК.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КлючиАналитикиПеревозкиМили.ФИОВодителя КАК ФИОВодителя,
		|	КлючиАналитикиПеревозкиМили.ПаспортныеДанные КАК ПаспортныеДанные,
		|	КлючиАналитикиПеревозкиМили.РегНомерТС КАК РегНомерТС,
		|	КлючиАналитикиПеревозкиМили.Автоперевозчик КАК Автоперевозчик,
		|	КлючиАналитикиПеревозкиМили.ИНН КАК ИНН,
		|	КлючиАналитикиПеревозкиМили.КПП КАК КПП,
		|	КлючиАналитикиПеревозкиМили.ЭтапПеревозки КАК ЭтапПеревозки, 
		// ДИТ US 78243 ТА 79083 Сержантова А.С. Начало: 11.01.2024
		|	ВТ_Ключи.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		// ДИТ US 78243 ТА 79083 Сержантова А.С. Конец: 11.01.2024
		|	ВТ_Ключи.ИдентификаторСтроки КАК ИдентификаторСтрокиЗапроса,
		|	&Ссылка КАК Ссылка	
		|ИЗ
		|	ВТ_Ключи КАК ВТ_Ключи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
		|		ПО ВТ_Ключи.КлючАналитикиПеревозки = КлючиАналитикиПеревозкиМили.Ссылка
		// ДИТ US 78243 ТА 79083 Сержантова А.С. Начало: 11.01.2024
		|ГДЕ 
		|  КлючиАналитикиПеревозкиМили.ФИОВодителя <> """" ИЛИ
		|  КлючиАналитикиПеревозкиМили.ПаспортныеДанные <> """" ИЛИ
		|  КлючиАналитикиПеревозкиМили.РегНомерТС <> """" ИЛИ
		|  КлючиАналитикиПеревозкиМили.Автоперевозчик <> Неопределено";
		// ДИТ US 78243 ТА 79083 Сержантова А.С. Конец: 11.01.2024
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

//Субботин 77659 24.11.2023 Начало
Функция ПолучитьКткДляРаспределенияВЗапросНаКТК (ТЧУслуги, СписокКТК = Неопределено, СписокИсключенийКТК = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Заявка_услуг.ТипКТК КАК ТипКТК,
		|	Заявка_услуг.ПерваяМиля КАК ПерваяМиля,
		|	Заявка_услуг.ПоследняяМиля КАК ПоследняяМиля,
		|	Заявка_услуг.НомерКТК КАК НомерКТК,
		|	Заявка_услуг.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
		|	Заявка_услуг.Релиз КАК Релиз,
		|	Заявка_услуг.ПеренесенВЗаявку КАК ПеренесенВЗаявку
		|ПОМЕСТИТЬ ВТ_ЗаявкаТЧ_услуги
		|ИЗ
		|	&Заявка_услуги КАК Заявка_услуг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗаявкаТЧ_услуги.ТипКТК КАК ТипКТК,
		|	ВТ_ЗаявкаТЧ_услуги.ПерваяМиля КАК ПерваяМиля,
		|	ВТ_ЗаявкаТЧ_услуги.ПоследняяМиля КАК ПоследняяМиля,
		|	ВТ_ЗаявкаТЧ_услуги.НомерКТК КАК НомерКТК
		|ИЗ
		|	ВТ_ЗаявкаТЧ_услуги КАК ВТ_ЗаявкаТЧ_услуги
		|ГДЕ
		|	ВТ_ЗаявкаТЧ_услуги.ПринадлежностьТЕ = &ПринадлежностьТЕ
		|	И (ВТ_ЗаявкаТЧ_услуги.Релиз = НЕОПРЕДЕЛЕНО ИЛИ ВТ_ЗаявкаТЧ_услуги.Релиз = ЗНАЧЕНИЕ(Документ.РелизКлиента.ПустаяСсылка))
		|	И ВТ_ЗаявкаТЧ_услуги.НомерКТК <> ЗНАЧЕНИЕ(Справочник.Те.ПустаяСсылка)
		|	И ВТ_ЗаявкаТЧ_услуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка)
		|ИТОГИ ПО
		|	ТипКТК,
		|	ПерваяМиля,
		|	ПоследняяМиля,
		|	НомерКТК";
	
	Запрос.УстановитьПараметр("Заявка_услуги", ТЧУслуги);
	Запрос.УстановитьПараметр("ПринадлежностьТЕ", Перечисления.ПринадлежностьТЕ.КТЕвросиба);
	
	Если СписокКТК <> Неопределено тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И (ВТ_ЗаявкаТЧ_услуги.Релиз = НЕОПРЕДЕЛЕНО ИЛИ ВТ_ЗаявкаТЧ_услуги.Релиз = ЗНАЧЕНИЕ(Документ.РелизКлиента.ПустаяСсылка))",
		"И (ВТ_ЗаявкаТЧ_услуги.Релиз = НЕОПРЕДЕЛЕНО ИЛИ ВТ_ЗаявкаТЧ_услуги.Релиз = ЗНАЧЕНИЕ(Документ.РелизКлиента.ПустаяСсылка)) И ВТ_ЗаявкаТЧ_услуги.НомерКТК В (&СписокКТК)");
		Запрос.УстановитьПараметр("СписокКТК", СписокКТК);	
	КонецЕсли;
	
	Возврат Запрос.Выполнить();
КонецФункции	
//Субботин 77659 28.11.2023 Конец 

//Евросиб Коханенко Н.А. 13.05.2024 (( #83866
Функция ПолучитьСсылкиНаЗапросыНаАвтоперевозку(ЗаявкаСсылка) Экспорт
	
	СтруктураОтвет = Новый Структура();
	СтруктураОтвет.Вставить("ПерваяМиля", Документы.ЗапросНаАвтоперевозку.ПустаяСсылка());
	//Евросиб Коханенко Н.А. 10.02.2025 (( #98505 
	СтруктураОтвет.Вставить("СредняяМиля", Документы.ЗапросНаАвтоперевозку.ПустаяСсылка());
	//Евросиб Коханенко Н.А. 10.02.2025 )) #98505 
	СтруктураОтвет.Вставить("ПоследняяМиля", Документы.ЗапросНаАвтоперевозку.ПустаяСсылка());
	
	Если Не ЗначениеЗаполнено(ЗаявкаСсылка) Тогда
		Возврат СтруктураОтвет;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗапросНаАвтоперевозку.ЭтапПеревозки КАК ЭтапПеревозки,
		|	ЗапросНаАвтоперевозку.Ссылка КАК ЗапросНаАвтоперевозку
		|ИЗ
		|	Документ.ЗапросНаАвтоперевозку КАК ЗапросНаАвтоперевозку
		|ГДЕ
		|	ЗапросНаАвтоперевозку.Заявка = &Заявка
		|	И НЕ ЗапросНаАвтоперевозку.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗапросНаАвтоперевозку.Дата";
	
	Запрос.УстановитьПараметр("Заявка", ЗаявкаСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля Тогда
			СтруктураОтвет.ПерваяМиля = ВыборкаДетальныеЗаписи.ЗапросНаАвтоперевозку;
		//Евросиб Коханенко Н.А. 13.02.2025 (( #98505 
		//Иначе
		ИначеЕсли ВыборкаДетальныеЗаписи.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.СредняяМиля Тогда
			СтруктураОтвет.СредняяМиля = ВыборкаДетальныеЗаписи.ЗапросНаАвтоперевозку;
		ИначеЕсли ВыборкаДетальныеЗаписи.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПоследняяМиля Тогда
		//Евросиб Коханенко Н.А. 13.02.2025 )) #98505 
			СтруктураОтвет.ПоследняяМиля = ВыборкаДетальныеЗаписи.ЗапросНаАвтоперевозку;
		КонецЕсли	
	КонецЦикла;	

	Возврат СтруктураОтвет;
	
КонецФункции //Евросиб Коханенко Н.А. 13.05.2024 )) #83866 

// Евросиб US 88665 TA 88668 Рыбьяков К.А. 01.12.2024 ((
Функция ПодобратьРелизСобственника(Локация, Контейнер, ОкончаниеПользования, ДатаСдачи, ЗаявкаСсылка) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ОшибкаНеСовпадаетТип", Ложь);
	Результат.Вставить("ОшибкаЛокацияНеНайденаВРелизе", Неопределено);
	Результат.Вставить("ОшибкаРелизНеНайден", Ложь);
	Результат.Вставить("ОшибкаЛокацияНеНайдена", Ложь);
	Результат.Вставить("Локация", Неопределено);
	Результат.Вставить("Данные", Новый Массив);
	Результат.Вставить("ДанныеДобавленияВРелизСобственника", Новый Массив);
	
	Если ЕстьРелизКлиента(Контейнер, ЗаявкаСсылка) Тогда
		ПоискЧерезРелизКлиента(Результат, Локация, Контейнер, ДатаСдачи, ЗаявкаСсылка);
	Иначе
		ПоискЧерезАРМКТКТекущиеДанные(Результат, Контейнер, Локация, ОкончаниеПользования, ДатаСдачи, ЗаявкаСсылка);
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция ЕстьРелизКлиента(Контейнер, Заявка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументРелизКлиента.Ссылка КАК РелизКлиента
	|ИЗ
	|	Документ.РелизКлиента КАК ДокументРелизКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизКлиента.Контейнеры КАК РелизКлиентаКонтейнеры
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
	|			ПО (РелизКлиентаКонтейнеры.КлючАналитикиПеревозки = КлючиАналитикиПеревозки.Ссылка)
	|		ПО (ДокументРелизКлиента.Ссылка = РелизКлиентаКонтейнеры.Ссылка)
	|ГДЕ
	|	ДокументРелизКлиента.Заявка = &Заявка
	|	И ДокументРелизКлиента.Проведен
	|	И ВЫБОР КОГДА КлючиАналитикиПеревозки.Контейнер = &Контейнер
	|		ТОГДА 
	|			ИСТИНА
	|		ИНАЧЕ 
	|			ЛОЖЬ
	|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Запрос.УстановитьПараметр("Контейнер", Контейнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

Процедура ПоискЧерезРелизКлиента(Результат, Локация, Контейнер, ДатаСдачи, Заявка)
	
#Область СтарыйКод	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ДокументРелизКлиента.РелизСобственника КАК РелизСобственника,
	//|	ДокументРелизСобственника.ЛокацияСдачи КАК ЛокацияСдачи,
	//|	ВЫБОР
	//|		КОГДА МультилокацииЛокации.Локация = &Локация
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ КАК ЛокацияЕстьВРелизеСобственника,
	//|	ДокументРелизСобственника.Автор КАК Автор,
	//|	РелизСобственникаНоминации.ГУИДСтроки КАК ГУИДСтроки,
	//|	РелизСобственникаНоминации.КлючАналитики КАК КлючАналитики,
	//|	&Контейнер КАК Контейнер
	//|ПОМЕСТИТЬ ВТ_Данные
	//|ИЗ
	//|	Документ.РелизКлиента КАК ДокументРелизКлиента
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизКлиента.Контейнеры КАК РелизКлиентаКонтейнеры
	//|		ПО (РелизКлиентаКонтейнеры.Ссылка = ДокументРелизКлиента.Ссылка)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
	//|		ПО (РелизКлиентаКонтейнеры.КлючАналитикиПеревозки = КлючиАналитикиПеревозки.Ссылка)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизСобственника КАК ДокументРелизСобственника
	//|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	//|			ПО (ДокументРелизСобственника.ВозможныеСтокиСдачи = МультилокацииЛокации.Ссылка)
	//|				И (&Локация = МультилокацииЛокации.Локация)
	//|		ПО (ДокументРелизКлиента.РелизСобственника = ДокументРелизСобственника.Ссылка)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
	//|		ПО (ДокументРелизСобственника.Ссылка = РелизСобственникаНоминации.Ссылка)
	//|ГДЕ
	//|	ДокументРелизКлиента.Заявка = &Заявка
	//|	И ДокументРелизКлиента.Проведен
	//|	И КлючиАналитикиПеревозки.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	//|	И ДокументРелизСобственника.ДоплатныеКТК
	//|	И ДокументРелизСобственника.Проведен
	//|	И РелизСобственникаНоминации.Контейнер = &Контейнер
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	стоки_ТекущиеДанныеСрезПоследних.тек_ДатаСдачиВСток КАК ДатаВозвратаСобственнику,
	//|	стоки_ТекущиеДанныеСрезПоследних.КТК КАК КТК
	//|ПОМЕСТИТЬ ВТ_ДатаСдачи
	//|ИЗ
	//|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(
	//|			,
	//|			КТК = &Контейнер
	//|				И тек_Релиз В
	//|					(ВЫБРАТЬ
	//|						ВТ_Данные.РелизСобственника
	//|					ИЗ
	//|						ВТ_Данные)) КАК стоки_ТекущиеДанныеСрезПоследних
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Данные.РелизСобственника КАК РелизСобственника,
	//|	ВТ_Данные.ЛокацияСдачи КАК ЛокацияСдачи,
	//|	ВТ_Данные.ЛокацияЕстьВРелизеСобственника КАК ЛокацияЕстьВРелизеСобственника,
	//|	ВТ_Данные.Автор КАК Автор,
	//|	ВТ_Данные.ГУИДСтроки КАК ГУИДСтроки,
	//|	ВТ_Данные.КлючАналитики КАК КлючАналитики,
	//|	ВТ_ДатаСдачи.ДатаВозвратаСобственнику КАК ДатаВозвратаСобственнику
	//|ИЗ
	//|	ВТ_Данные КАК ВТ_Данные
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатаСдачи КАК ВТ_ДатаСдачи
	//|		ПО (ВТ_Данные.Контейнер = ВТ_ДатаСдачи.КТК)";
	//
#КонецОбласти	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументРелизКлиента.РелизСобственника КАК РелизСобственника,
	|	ДокументРелизСобственника.ЛокацияСдачи КАК ЛокацияСдачи,
	|	ВЫБОР
	|		КОГДА МультилокацииЛокации.Локация = &Локация
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЛокацияЕстьВРелизеСобственника,
	|	ДокументРелизСобственника.Автор КАК Автор,
	|	РелизСобственникаНоминации.ГУИДСтроки КАК ГУИДСтроки,
	|	РелизСобственникаНоминации.КлючАналитики КАК КлючАналитики,
	|	ЗаявкаСоставУслуги.НомерКТК КАК Контейнер,
	|	ЗаявкаСоставУслуги.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	Документ.РелизКлиента КАК ДокументРелизКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизКлиента.Контейнеры КАК РелизКлиентаКонтейнеры
	|		ПО (РелизКлиентаКонтейнеры.Ссылка = ДокументРелизКлиента.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
	|		ПО (РелизКлиентаКонтейнеры.КлючАналитикиПеревозки = КлючиАналитикиПеревозки.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизСобственника КАК ДокументРелизСобственника
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|			ПО ДокументРелизСобственника.ВозможныеСтокиСдачи = МультилокацииЛокации.Ссылка
	|				И (&Локация = МультилокацииЛокации.Локация)
	|		ПО ДокументРелизКлиента.РелизСобственника = ДокументРелизСобственника.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
	|		ПО (ДокументРелизСобственника.Ссылка = РелизСобственникаНоминации.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|		ПО (ЗаявкаСоставУслуги.Ссылка = &Заявка)
	|ГДЕ
	|	ДокументРелизКлиента.Заявка = &Заявка
	|	И ЗаявкаСоставУслуги.НомерКТК = &Контейнер
	|	И ДокументРелизКлиента.Проведен
	|	И КлючиАналитикиПеревозки.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	|	И ДокументРелизСобственника.ДоплатныеКТК
	|	И ДокументРелизСобственника.Проведен
	|	И РелизСобственникаНоминации.Контейнер = &Контейнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	стоки_ТекущиеДанныеСрезПоследних.тек_ДатаСдачиВСток КАК ДатаВозвратаСобственнику,
	|	стоки_ТекущиеДанныеСрезПоследних.КТК КАК КТК
	|ПОМЕСТИТЬ ВТ_ДатаСдачи
	|ИЗ
	|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(
	|			,
	|			КТК = &Контейнер
	|				И тек_Релиз В
	|					(ВЫБРАТЬ
	|						ВТ_Данные.РелизСобственника
	|					ИЗ
	|						ВТ_Данные)) КАК стоки_ТекущиеДанныеСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.РелизСобственника КАК РелизСобственника,
	|	ВТ_Данные.ЛокацияСдачи КАК ЛокацияСдачи,
	|	ВТ_Данные.ЛокацияЕстьВРелизеСобственника КАК ЛокацияЕстьВРелизеСобственника,
	|	ВТ_Данные.Автор КАК Автор,
	|	ВТ_Данные.ГУИДСтроки КАК ГУИДСтроки,
	|	ВТ_Данные.КлючАналитики КАК КлючАналитики,
	|	ВТ_Данные.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
	|	ВТ_ДатаСдачи.ДатаВозвратаСобственнику КАК ДатаВозвратаСобственнику
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатаСдачи КАК ВТ_ДатаСдачи
	|		ПО ВТ_Данные.Контейнер = ВТ_ДатаСдачи.КТК";
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Запрос.УстановитьПараметр("Локация", Локация);
	Запрос.УстановитьПараметр("Контейнер", Контейнер);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Если Не Выборка.ЛокацияЕстьВРелизеСобственника Тогда
			ДанныеОбОшибке = Новый Структура;
			ДанныеОбОшибке.Вставить("Автор", Выборка.Автор);
			ДанныеОбОшибке.Вставить("Релиз", Выборка.РелизСобственника);
			Результат.ОшибкаЛокацияНеНайденаВРелизе = ДанныеОбОшибке;
		ИначеЕсли ЗначениеЗаполнено(Выборка.ДатаВозвратаСобственнику) Тогда
			Результат.Локация = Локация;
		Иначе
			Данные = Новый Структура;
			Данные.Вставить("Локация", Локация);
			Данные.Вставить("РелизСобственника", Выборка.РелизСобственника);
			Данные.Вставить("КлючАналитикиСтрокиРелиза", Выборка.КлючАналитики);
			Данные.Вставить("ДатаСдачи", ДатаСдачи);
			Данные.Вставить("ГУИДСтроки", Выборка.ГУИДСтроки);
			Данные.Вставить("КлючАналитикиПеревозки", Выборка.КлючАналитикиПеревозки);
			Результат.ДанныеДобавленияВРелизСобственника.Добавить(Данные);
			
			Результат.Локация = Локация;
		КонецЕсли;
	Иначе
		Результат.Локация = Локация;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПоискЧерезАРМКТКТекущиеДанные(Результат, Контейнер, Локация, КонецПользования, ДатаСдачи, Заявка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	стоки_ТекущиеДанные.тек_Релиз КАК РелизСобственника,
	|	стоки_ТекущиеДанные.тек_ДатаПриемаВПользование КАК ДатаПриемаВПользование,
	|	стоки_ТекущиеДанные.тек_СрокВозврата КАК СрокВозврата,
	|	стоки_ТекущиеДанные.тек_ДатаСдачиВСток КАК ДатаВозвратаСобственнику,
	|	ДОБАВИТЬКДАТЕ(стоки_ТекущиеДанные.тек_ДатаПриемаВПользование, ДЕНЬ, стоки_ТекущиеДанные.тек_СрокВозврата) КАК РасчетнаяДатаСдачи,
	|	ВЫБОР
	|		КОГДА &ДатаСдачи МЕЖДУ стоки_ТекущиеДанные.тек_ДатаПриемаВПользование И ДОБАВИТЬКДАТЕ(стоки_ТекущиеДанные.тек_ДатаПриемаВПользование, ДЕНЬ, стоки_ТекущиеДанные.тек_СрокВозврата)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДатаСдачиВходитВПериод,
	|	ДокументРелизСобственника.ДоплатныеКТК КАК Доплатный,
	|	РелизСобственникаНоминации.КлючАналитики КАК КлючАналитики,
	|	РелизСобственникаНоминации.ГУИДСтроки КАК ГУИДСтроки,
	|	ВЫБОР
	|		КОГДА стоки_ТекущиеДанные.тек_ДатаПриемаВПользование > &ДатаСдачи
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СвежийРелиз,
	|	ЗаявкаСоставУслуги.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки
	|ИЗ
	|	РегистрСведений.стоки_ТекущиеДанные КАК стоки_ТекущиеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизСобственника КАК ДокументРелизСобственника
	|		ПО (стоки_ТекущиеДанные.тек_Релиз = ДокументРелизСобственника.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
	|		ПО (ДокументРелизСобственника.Ссылка = РелизСобственникаНоминации.Ссылка)
	|		И РелизСобственникаНоминации.Контейнер = стоки_ТекущиеДанные.КТК
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ПО (ДокументРелизСобственника.ВозможныеСтокиСдачи = МультилокацииЛокации.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|		ПО ЗаявкаСоставУслуги.Ссылка = &Заявка
	|			И ЗаявкаСоставУслуги.НомерКТК = &Контейнер
	|
	|ГДЕ
	|	стоки_ТекущиеДанные.тек_Релиз.Проведен
	|	И стоки_ТекущиеДанные.тек_ДатаПриемаВПользование <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И стоки_ТекущиеДанные.тек_ДатаСдачиВСток = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И стоки_ТекущиеДанные.КТК = &Контейнер
	|	И ВЫБОР
	|		КОГДА МультилокацииЛокации.Локация = &Локация
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	СвежийРелиз УБЫВ";
	
	Запрос.УстановитьПараметр("Контейнер", Контейнер);
	Запрос.УстановитьПараметр("Локация", Локация);
	Запрос.УстановитьПараметр("ДатаСдачи", ДатаСдачи);
	Запрос.УстановитьПараметр("Заявка", Заявка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Результат.Локация = Локация;
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		
		Если Выборка.СвежийРелиз Тогда
			Результат.Локация = Локация;
			Возврат;
		КонецЕсли;
		
		Если Выборка.ДатаСдачиВходитВПериод Тогда
			Данные = Новый Структура;
			Данные.Вставить("Локация", Локация);
			Данные.Вставить("РелизСобственника", Выборка.РелизСобственника);
			Данные.Вставить("КлючАналитикиСтрокиРелиза", Выборка.КлючАналитики);
			Данные.Вставить("ДатаСдачи", ДатаСдачи);
			Данные.Вставить("ГУИДСтроки", Выборка.ГУИДСтроки);
			Данные.Вставить("КлючАналитикиПеревозки", Выборка.КлючАналитикиПеревозки);
			Результат.ДанныеДобавленияВРелизСобственника.Добавить(Данные);
			Результат.Локация = Локация;
		ИначеЕсли ДатаСдачи > Выборка.РасчетнаяДатаСдачи
			И Выборка.ДатаПриемаВПользование > ДатаСдачи Тогда 
			Данные = Новый Структура;
			Данные.Вставить("Локация", Локация);
			Данные.Вставить("РелизСобственника", Выборка.РелизСобственника);
			Данные.Вставить("КлючАналитикиСтрокиРелиза", Выборка.КлючАналитики);
			Данные.Вставить("ДатаСдачи", ДатаСдачи);
			Данные.Вставить("ГУИДСтроки", Выборка.ГУИДСтроки);
			Данные.Вставить("КлючАналитикиПеревозки", Выборка.КлючАналитикиПеревозки);
			Результат.ДанныеДобавленияВРелизСобственника.Добавить(Данные);
			Результат.Локация = Локация;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьДанныеВКлючАналитикиСтрокиРелизаСобственника(ДанныеДобавленияВРелизСобственника) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого Данные Из ДанныеДобавленияВРелизСобственника Цикл
		Если Не ЗначениеЗаполнено(Данные.КлючАналитикиСтрокиРелиза) Тогда
			НовыйКлюч = Справочники.КлючиАналитикиНоминацийРелиза.СоздатьЭлемент();
			НовыйКлюч.Наименование = Новый УникальныйИдентификатор;
			НовыйКлюч.ДатаВозвратаКлиентом = Данные.ДатаСдачи;
			НовыйКлюч.СтокВыдачи = Данные.Локация;
			НовыйКлюч.КлючАналитикиПеревозки = Данные.КлючАналитикиПеревозки;
			НовыйКлюч.Записать();
			
			РелизСобственникаСсылка = Данные.РелизСобственника;
			РелизСобственникаОбъект = РелизСобственникаСсылка.ПолучитьОбъект();
			Номинации = РелизСобственникаОбъект.Номинации;
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("ГУИДСтроки", Данные.ГУИДСтроки);
			НайденныеСтроки = Номинации.НайтиСтроки(ПараметрыОтбора);
			Для Каждого Строка Из НайденныеСтроки Цикл
				Строка.КлючАналитики = НовыйКлюч.Ссылка;
			КонецЦикла;
			РелизСобственникаОбъект.Записать();
		Иначе
			КлючСсылка = Данные.КлючАналитикиСтрокиРелиза;
			КлючОбъект = КлючСсылка.ПолучитьОбъект();
			КлючОбъект.ДатаВозвратаКлиентом = Данные.ДатаСдачи;
			КлючОбъект.СтокВыдачи = Данные.Локация;
			КлючОбъект.КлючАналитикиПеревозки = Данные.КлючАналитикиПеревозки;
			КлючОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
// Евросиб Рыбьяков К.А. 01.12.2024 ))
