Перем НеПроверятьВидСобственностиКТК Экспорт;
// ++ Евросиб Дудоров С.В. US 57543 30.01.2023  
Перем ИзменятьРефСцепПоЗаявке Экспорт; 
// -- Евросиб Дудоров С.В. US 57543 30.01.2023  

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Автор 			 = Пользователи.ТекущийПользователь();
	Контрагент  	 = Автор.АссоциированныйКонтрагент;
	ЦФО 			 = Автор.ЦФО;
	Создано 		 = ТекущаяДата();
	Организация 	 = Константы.ОсновнаяОрганизация.Получить();
	Маршрутизировать = Константы.МаршрутизироватьЗаявку.Получить();
	Подразделение    = Автор.Подразделение;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПСЦ") Тогда
		// Заполнение шапки
		Договор 			  = ДанныеЗаполнения.Договор;
		Контрагент 		      = ДанныеЗаполнения.Контрагент;
		Организация 		  = ДанныеЗаполнения.Организация;
		ОтветственныйМенеджер = ДанныеЗаполнения.ОтветственныйМенеджер;
		Подразделение 		  = ДанныеЗаполнения.Подразделение;
		ПСЦ 				  = ДанныеЗаполнения.Ссылка;
		ЦФО 				  = ДанныеЗаполнения.ЦФО;
		Грузоотправитель 	  = Документы.Заявка.ПолучитьГрузоотправителяПоПСЦ(ПСЦ);
		//Евросиб Коханенко Н.А. 06.07.2023 (( #72162
		Если КонтрагентыДоговоры_Сервер.КонтрагентЯвляетсяДирекциейКонтейнерныхПеревозок(Контрагент) 
			ИЛИ ДанныеЗаполнения.ТипКалькуляции = Перечисления.ТипыКалькуляций.Субсидии ИЛИ ДанныеЗаполнения.ТипКалькуляции = Перечисления.ТипыКалькуляций.Премии Тогда  // ДИТ US 59973 ТА 76151 Сержантова А.С. 16.10.2023 //ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
			ВидПеревозки 	  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПСЦ, "ВидПеревозки");	
		КонецЕсли;
		//Евросиб Коханенко Н.А. 06.07.2023 )) #72162 
// ++ Евросиб Дудоров С.В. US 57543 30.01.2023  
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РефСцеп") Тогда

        ОтветственныйМенеджер = ДанныеЗаполнения.Автор;
		ЦФО 				  = ДанныеЗаполнения.ЦФО;
		Организация 		  = ДанныеЗаполнения.Организация;
		Подразделение 		  = ДанныеЗаполнения.Подразделение;
		
		Отправка			  = ДанныеЗаполнения.ПланируемоеОтправление;	
		Прибытие			  = ДанныеЗаполнения.ПланируемоеПрибытие;	
		ДокументОснование     = ДанныеЗаполнения.Ссылка;
		ВидПеревозки		  = Справочники.ВидыПеревозок.Внутрироссийская;
		
	КонецЕсли;
// -- Евросиб Дудоров С.В. US 57543 30.01.2023  
	#Если ВебКлиент Тогда
		Если Значениезаполнено(Пользователи.ТекущийПользователь().АссоциированныйКонтрагент) Тогда
			ИсточникЗаявки = Перечисления.ИсточникЗаявок.ВебСайт;
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

//ДИТ Беляев СЮ, Ticket#0250118, 29-11-2021 ++
Функция ПолучитьРезультатПроверкиНаОшибкиЗаполненияКалькуляций()
	Результат = Ложь;
	ТабЧастьСоставУслуги = СоставУслуги.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТабЧастьСоставУслуги.НомерСтроки КАК НомерСтроки,
		|	ТабЧастьСоставУслуги.НомерКТК КАК НомерКТК,
		|	ТабЧастьСоставУслуги.ПСЦ КАК ПСЦ,
		|	ТабЧастьСоставУслуги.Калькуляция КАК Калькуляция
		|ПОМЕСТИТЬ ДанныеДляПроверки
		|ИЗ
		|	&ТабЧастьСоставУслуги КАК ТабЧастьСоставУслуги
		|ГДЕ
		|	ТабЧастьСоставУслуги.ПСЦ <> ЗНАЧЕНИЕ(Документ.ПСЦ.ПустаяСсылка)
		|	И ТабЧастьСоставУслуги.Калькуляция <> ЗНАЧЕНИЕ(Документ.Калькуляция.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеДляПроверки.НомерСтроки КАК НомерСтроки,
		|	ДанныеДляПроверки.НомерКТК КАК НомерКТК,
		|	ДанныеДляПроверки.ПСЦ КАК ПСЦ,
		|	ДанныеДляПроверки.Калькуляция КАК Калькуляция,
		|	ДокументПСЦ.Договор КАК Договор
		|ИЗ
		|	ДанныеДляПроверки КАК ДанныеДляПроверки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПСЦ КАК ДокументПСЦ
		|		ПО ДанныеДляПроверки.ПСЦ = ДокументПСЦ.Ссылка
		|ГДЕ
		|	ДокументПСЦ.Договор <> &Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеДляПроверки.НомерСтроки КАК НомерСтроки,
		|	ДанныеДляПроверки.НомерКТК КАК НомерКТК,
		|	ДанныеДляПроверки.ПСЦ КАК ПСЦ,
		|	ДанныеДляПроверки.Калькуляция КАК Калькуляция
		|ИЗ
		|	ДанныеДляПроверки КАК ДанныеДляПроверки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПСЦ.Калькуляции КАК ПСЦКалькуляции
		|		ПО ДанныеДляПроверки.Калькуляция = ПСЦКалькуляции.Калькуляция
		|			И ДанныеДляПроверки.ПСЦ = ПСЦКалькуляции.Ссылка
		|ГДЕ
		|	ПСЦКалькуляции.Калькуляция ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ТабЧастьСоставУслуги", ТабЧастьСоставУслуги);
	Запрос.УстановитьПараметр("Договор", Договор);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ВыборкаОшибкиПоДоговорам = МассивРезультатов[1].Выбрать();	
	Пока ВыборкаОшибкиПоДоговорам.Следующий() Цикл
		Результат = Истина;
		Сообщить(СтрШаблон("Ошибка указания ПСЦ в строке %1. Договор в Протоколе не совпадает с договором в заявке.",ВыборкаОшибкиПоДоговорам.НомерСтроки));
	КонецЦикла;
	ВыборкаОшибкиПоКалькуляциям = МассивРезультатов[2].Выбрать();	
	Пока ВыборкаОшибкиПоКалькуляциям.Следующий() Цикл
		Результат = Истина;
		Сообщить(СтрШаблон("Ошибка указания Калькуляции в строке %1. В протоколе <%2> нет калькуляции <%3>.",
							ВыборкаОшибкиПоКалькуляциям.НомерСтроки,
							ВыборкаОшибкиПоКалькуляциям.ПСЦ,
							ВыборкаОшибкиПоКалькуляциям.Калькуляция));	
	КонецЦикла;

	Возврат Результат;
КонецФункции 
//ДИТ Беляев СЮ, Ticket#0250118, 29-11-2021 --

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

//Евросиб Гудкова( 31.03.2021 Ticket№ 0227986 
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
// Евросиб Гудкова)   

	// ДИТ US 79847 ТА 80505 Сержантова А.С. Начало: 15.05.2024 - если заявка есть в проведенной сделке, то отказ 
	Если ПометкаУдаления и не Ссылка.ПометкаУдаления Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СделкаЗаявки.Ссылка КАК Сделка,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(СделкаЗаявки.Ссылка) КАК СделкаПредставление
		|ИЗ
		|	Документ.Сделка.Заявки КАК СделкаЗаявки
		|ГДЕ
		|	СделкаЗаявки.Ссылка.Проведен
		|	И СделкаЗаявки.Заявка.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СделкаСвязьУчетныхЕдиниц.Ссылка,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(СделкаСвязьУчетныхЕдиниц.Ссылка)
		|ИЗ
		|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		|ГДЕ
		|	СделкаСвязьУчетныхЕдиниц.Ссылка.Проведен
		|	И СделкаСвязьУчетныхЕдиниц.Заявка.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		Если не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать(); 
			МассивСделок = Новый Массив;
			Пока Выборка.Следующий() Цикл
				МассивСделок.Добавить(Выборка.СделкаПредставление);		
			КонецЦикла;     
			ТекстСообщения = "Удаление невозможно! Заявка используется в " + ?(МассивСделок.Количество()=1, "сделке ", "сделках ") 
						+ СтрСоединить(МассивСделок, ", ");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;	
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;
	// ДИТ US 79847 ТА 80505 Сержантова А.С. Конец: 15.05.2024

	// ++ Евросиб Дудоров С.В. US 57543 30.01.2023 
	// для основания реф.сцеп при смене контрагента меняем всех клиентов в  Реф.сцепе
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РефСцеп") 
		и Ссылка <> Документы.Заявка.ПустаяСсылка() Тогда
		ИзменятьРефСцепПоЗаявке = ИзменятьРефСцепПоЗаявке();
	Иначе
		ИзменятьРефСцепПоЗаявке = Ложь;
	КонецЕсли;			
	// -- Евросиб Дудоров С.В. US 57543 30.01.2023  

    //ДИТ Шевченко А.В. 59981 07.12.22 -начало
	Если ЗначениеЗаполнено(Договор) И НЕ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ДоговорДействует = Истина;
		Если ЗначениеЗаполнено(Отправка) и НЕ ЗначениеЗаполнено(Прибытие) Тогда
			ДоговорДействует = Справочники.ДоговорыКонтрагентов.ПроверитьПериодДействияДоговора(Договор,Отправка,Дата(1,1,1),Истина);
			//Евросиб Коханенко Н.А. #63997 18.01.2023 ((
			СообщениеТекст = "Дата отправки в заявке";
			//Евросиб Коханенко Н.А. #63997 18.01.2023 ))
		ИначеЕсли НЕ ЗначениеЗаполнено(Отправка) и ЗначениеЗаполнено(Прибытие) Тогда
			ДоговорДействует = Справочники.ДоговорыКонтрагентов.ПроверитьПериодДействияДоговора(Договор,Прибытие,Дата(1,1,1),Истина);
			//Евросиб Коханенко Н.А. #63997 18.01.2023 ((
			СообщениеТекст = "Дата прибытия в заявке";
			//Евросиб Коханенко Н.А. #63997 18.01.2023 ))
		ИначеЕсли ЗначениеЗаполнено(Отправка) и ЗначениеЗаполнено(Прибытие) Тогда
			ДоговорДействует = Справочники.ДоговорыКонтрагентов.ПроверитьПериодДействияДоговора(Договор,Отправка,Прибытие);	
			//Евросиб Коханенко Н.А. #63997 18.01.2023 ((
			СообщениеТекст = "Дата отправки или прибытия в заявке";
			//Евросиб Коханенко Н.А. #63997 18.01.2023 ))
		ИначеЕсли НЕ ЗначениеЗаполнено(Отправка) и НЕ ЗначениеЗаполнено(Прибытие) Тогда
			ДоговорДействует = Справочники.ДоговорыКонтрагентов.ПроверитьПериодДействияДоговора(Договор,Дата,Дата(1,1,1),Истина);
			//Евросиб Коханенко Н.А. #63997 18.01.2023 ((
			СообщениеТекст = "Дата заявки";
			//Евросиб Коханенко Н.А. #63997 18.01.2023 ))
		КонецЕсли;
		Если НЕ ДоговорДействует Тогда
			//ДИТ Шевченко А.В. 65173 09.02.2023 начало
			ДоговорОбъект = Договор.ПолучитьОбъект();
			СтруктураПоиска = Новый Структура();
			СтруктураПоиска.Вставить("Состояние",Справочники.Состояния.НеобходимаПролонгацияДоговора);
			МассивСтрок = ДоговорОбъект.Состояния.НайтиСтроки(СтруктураПоиска);
			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("Договор",				Договор);
			СтруктураПараметров.Вставить("ЦФО",					Справочники.ЦентрыФинансовойОтветственности.ОсновнойЦФО);
			СтруктураПараметров.Вставить("ТипОтветственного",	Перечисления.ТипыОтветственных.ОтветственныйЗаСопровождение);  
			мОтветственныйЗаСопровождение = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственного(СтруктураПараметров);
			Если ЗначениеЗаполнено(мОтветственныйЗаСопровождение) Тогда
				Если МассивСтрок.Количество() = 0 Тогда
					НСтр = ДоговорОбъект.Состояния.Добавить();
					НСтр.Состояние = Справочники.Состояния.НеобходимаПролонгацияДоговора;
					НСтр.Исполнитель = мОтветственныйЗаСопровождение;
					НСтр.Наблюдатель = мОтветственныйЗаСопровождение;
					НСтр.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
					НСтр.НормативИсполненияСМоментаСоздания = 2;
				Иначе
					Если МассивСтрок[0].Статус = Перечисления.СтатусыЭтапов.Выполнен Тогда
						МассивСтрок[0].Исполнитель = мОтветственныйЗаСопровождение;
						МассивСтрок[0].Наблюдатель = мОтветственныйЗаСопровождение;
						МассивСтрок[0].Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
						МассивСтрок[0].НормативИсполненияСМоментаСоздания = 2;
					КонецЕсли;
				КонецЕсли;
				
				Попытка
					УстановитьПривилегированныйРежим(Истина);
					ДоговорОбъект.Записать();
					УстановитьПривилегированныйРежим(Ложь);
				Исключение
					ЗаписьЖурналаРегистрации("Данные.Изменение",УровеньЖурналаРегистрации.Ошибка,,ДоговорОбъект.Ссылка,"Ошибка записи договора. Создание задачи на пролонгацию договора");
					ВызватьИсключение;
				КонецПопытки;
			КонецЕсли;
			//ДИТ Шевченко А.В. 65173 09.02.2023 конец
			//Евросиб Коханенко Н.А. #63997 18.01.2023 ((
			//было
			//Автопролонгация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор,"Автопролонгация");
			//Если НЕ ДополнительныеСвойства.Проведен Тогда
			//	Если Автопролонгация Тогда
			//		СообщениеТекст = "Проведение не выполнено, договор не продлен на текущий год, необходимо продлить договор через отдел делопроизводства";
			//	Иначе
			//		СообщениеТекст = "Проведение не выполнено, срок действия договора истек, необходимо оформить ДС на продления срока действия договора";
			//	КонецЕсли;
			//	ОбщегоНазначения.СообщитьПользователю(СообщениеТекст,,,,Отказ);
			//КонецЕсли;
			//Если ДополнительныеСвойства.Проведен Тогда
			//	Если Автопролонгация Тогда
			//		СообщениеТекст = "Договор не продлен на текущий год, необходимо продлить договор через отдел делопроизводства";
			//	Иначе
			//		СообщениеТекст = "Срок действия договора истек, необходимо оформить ДС на продления срока действия договора";
			//	КонецЕсли;
			//	ОбщегоНазначения.СообщитьПользователю(СообщениеТекст,,,,);
			//КонецЕсли;
			//стало
			//СообщениеТекст = ?(Ссылка.Проведен, "", "Проведение не выполнено. ") + СообщениеТекст + " не входит в период действия договора.";			
			
			//Евросиб Коханенко Н.А. 05.02.2025 (( #99638 
			//СообщениеТекст = "Запись отменена. " + СообщениеТекст + " не входит в период действия договора.";			
			//ОбщегоНазначения.СообщитьПользователю(СообщениеТекст,,,, Отказ);
			Если ЭтотОбъект.Договор <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Договор") Тогда 
				СообщениеТекст = "Запись отменена. " + СообщениеТекст + " не входит в период действия договора.";			
				ОбщегоНазначения.СообщитьПользователю(СообщениеТекст,,,, Отказ);
			КонецЕсли;
			//Евросиб Коханенко Н.А. 05.02.2025 )) #99638 
			
			//Евросиб Коханенко Н.А. #63997 19.01.2023 ))
		КонецЕсли;
	КонецЕсли;	
	//ДИТ Шевченко А.В. 59981 07.12.22 -конец

	//ДИТ Авдеева В.С. 51139 13.05.2022 Начало 
	ЗапросНаКТКИзБазы = ?(ЗначениеЗаполнено(Ссылка), Ссылка.ЗапросНаКТК, Ложь); 
	//ДИТ Авдеева В.С. 51139 13.05.2022 Конец 
		
    // Евросиб Фролов (16.11.2021 TASK№ №41969
	Если НЕ ЗапросНаКТК Тогда
		СписокЗапросНаКТК.Очистить();
		// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
		ТранспортныеСредства.Очистить();
		ВнутреннийСтатусЗапроса = Перечисления.ВнутренниеСтатусыЗапросовНаКТК.ПустаяСсылка();
		// Евросиб Фролов)                       
		//ДИТ Авдеева В.С. 51139 13.05.2022 Начало 
		Если ЗапросНаКТКИзБазы Тогда 
			ДатаСозданияЗапроса = Дата(1,1,1,0,0,0);  
		КонецЕсли;
		//ДИТ Авдеева В.С. 51139 13.05.2022 Конец
	Иначе
		Для Каждого ТекущаяСтрокаЗапроса Из СписокЗапросНаКТК Цикл
			// Евросиб Фролов (16.02.2022 Task №44768
			//Если ТекущаяСтрокаЗапроса.Автоперевозка = Перечисления.ВариантыАвтоперевозки.СиламиЕвросиб Тогда	
			//	ТекущаяСтрокаЗапроса.ТранспортноеСредствоКлиента = "";
			//Иначе
			// Евросиб Фролов)	
			Если ТекущаяСтрокаЗапроса.Автоперевозка = Перечисления.ВариантыАвтоперевозки.СиламиКлиента Тогда 
				ТекущаяСтрокаЗапроса.ФИОВодителяПерваяМиля = "";
				ТекущаяСтрокаЗапроса.НомерТСПерваяМиля = "";
				ТекущаяСтрокаЗапроса.АвтоперевозчикПерваяМиля = "";
				ТекущаяСтрокаЗапроса.КомментарийПерваяМиля = "";
				ТекущаяСтрокаЗапроса.ФИОВодителяПоследняяМиля = "";
				ТекущаяСтрокаЗапроса.НомерТСПоследняяМиля = "";
				ТекущаяСтрокаЗапроса.АвтоперевозчикПоследняяМиля = "";
				ТекущаяСтрокаЗапроса.КомментарийПоследняяМиля = "";
			Иначе
				// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
				// Евросиб Фролов (16.02.2022 Task №44768
				//ТекущаяСтрокаЗапроса.ВодительКлиента = "";
				//ТекущаяСтрокаЗапроса.ТранспортноеСредствоКлиента = "";
				// Евросиб Фролов)
				ТекущаяСтрокаЗапроса.ФИОВодителяПерваяМиля = "";
				ТекущаяСтрокаЗапроса.НомерТСПерваяМиля = "";
				ТекущаяСтрокаЗапроса.АвтоперевозчикПерваяМиля = "";
				ТекущаяСтрокаЗапроса.КомментарийПерваяМиля = "";
				ТекущаяСтрокаЗапроса.ФИОВодителяПоследняяМиля = "";
				ТекущаяСтрокаЗапроса.НомерТСПоследняяМиля = "";
				ТекущаяСтрокаЗапроса.АвтоперевозчикПоследняяМиля = "";
				ТекущаяСтрокаЗапроса.КомментарийПоследняяМиля = "";
				// Евросиб Фролов)
			КонецЕсли;	
		КонецЦикла;
		ОчиститьАвтоперевозку(); // Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
		
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение
			ИЛИ РежимЗаписи = РежимЗаписиДокумента.Запись И Проведен Тогда		
			ВыполнитьПроверкиПриЗапросеНаКТК(РежимЗаписи, Отказ, ДополнительныеСвойства);  // ДИТ Сержантова А.С. 16.01.2024 BUG 79844
		
			//Если Отказ Тогда
			//	Возврат;
			//КонецЕсли;	
		
		КонецЕсли;       
		
		//ДИТ Авдеева В.С. 51139 13.05.2022 Начало 
		Если Не ЗапросНаКТКИзБазы Тогда 
			ДатаСозданияЗапроса = ТекущаяДата();  
		КонецЕсли;
		//ДИТ Авдеева В.С. 51139 13.05.2022 Конец
		
	КонецЕсли;	
	// Евросиб Фролов)
	
	// Евросиб Фролов (15.12.2021 Ticket№ 0244435
	// Заполним идентификаторы в строках состава услуг, в которых он не заполнен.
	НайденныеСтроки = СоставУслуги.НайтиСтроки(Новый Структура("ГУИДСтроки", ""));
	Для Каждого СтрокаБезГУИД Из НайденныеСтроки Цикл
		СтрокаБезГУИД.ГУИДСтроки = Новый УникальныйИдентификатор;
	КонецЦикла;	
	// Евросиб Фролов)
	
	ТребоватьСтокСдачи = Константы.ТребоватьУказаниеСтокаСдачиВЗаявке.Получить();
	
	КоличествоКТК20 = 0;
	КоличествоКТК40 = 0;
	
	ДоходностьЗаявки = 0;
	КонтрибуцияЗаявки = 0;
	
	// SIV 10-10-20 в этом блоке происходит дозаполнение ТЧ всеми возможными параметрами
	Для каждого Стр из СоставУслуги Цикл
				
		// блок дополнения данных
		
		//Евросиб Коханенко Н.А. 26.02.2025 (( #101467 
		//Если НЕ ЗначениеЗаполнено(Стр.ПСЦ) Тогда 
		//	Стр.ПСЦ = ПСЦ; 
		//КонецЕсли;
		//Евросиб Коханенко Н.А. 26.02.2025 )) #101467 
		
		Если ЗначениеЗаполнено(Стр.Коносамент) И НЕ ЗначениеЗаполнено(Стр.РеестрКлиента) Тогда 
			Стр.РеестрКлиента = Стр.Коносамент.НомерТранспортногоДокумента; 
		КонецЕсли;
		
		//Если НЕ ЗначениеЗаполнено(Стр.ДатаПриемаВПользованиеПередПоставщиком) И ЗначениеЗаполнено(Стр.ДатаВыдачи) Тогда
		//	Стр.ДатаПриемаВПользованиеПередПоставщиком = Стр.ДатаВыдачи;
		//КонецЕсли;
		//Если НЕ ЗначениеЗаполнено(Стр.ДатаПриемаВПользованиеПередПоставщиком) И ЗначениеЗаполнено(Стр.ДатаВзятия) Тогда
		//	Стр.ДатаПриемаВПользованиеПередПоставщиком = Стр.ДатаВзятия;
		//КонецЕсли;
		
		Если Стр.ТипКТК.РазмерКТК = Справочники.РазмерыКТК.К20 Тогда
			КоличествоКТК20 = КоличествоКТК20 + 1;
		Иначе
			КоличествоКТК40 = КоличествоКТК40 + 1;
		КонецЕсли;
		//ДатаНачалаНовогоРасчетаВознаграждения = Константы.ДатаНачалаРасчетаВознагражденияПоНовойФормулеВКалькуляциях.Получить();
		Если ЗначениеЗаполнено(Стр.Калькуляция) Тогда
			Если Стр.РазмерКТК = Справочники.РазмерыКТК.К20 Тогда
				ДоходностьЗаявки = ДоходностьЗаявки + Стр.Калькуляция.ММ_ИтогоСтавка20;
				//Евросиб Шевченко А.В. US 99262 TA 121126 09.10.2025
				//КонтрибуцияЗаявки = КонтрибуцияЗаявки + Стр.Калькуляция.ММ_ИтогоВознаграждение20;
				//Если Стр.Калькуляция.Дата > ДатаНачалаНовогоРасчетаВознаграждения Тогда
					КонтрибуцияКалькуляции = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьРасчетнуюКонтрибуцию20ПоДокументу(Стр.Калькуляция);
				//Иначе
					//КонтрибуцияЗаявки = КонтрибуцияЗаявки + Стр.Калькуляция.ММ_ИтогоВознаграждение20;
				//Конецесли;
				КонтрибуцияЗаявки = КонтрибуцияЗаявки + ?(КонтрибуцияКалькуляции = неопределено,0,КонтрибуцияКалькуляции);
			Иначе
				ДоходностьЗаявки = ДоходностьЗаявки + Стр.Калькуляция.ММ_ИтогоСтавка;
				
				//КонтрибуцияЗаявки = КонтрибуцияЗаявки + Стр.Калькуляция.ММ_ИтогоВознаграждение;
				//Если Стр.Калькуляция.Дата > ДатаНачалаНовогоРасчетаВознаграждения Тогда
					КонтрибуцияКалькуляции = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьРасчетнуюКонтрибуцию40ПоДокументу(Стр.Калькуляция);
				//Иначе
				//	КонтрибуцияЗаявки = КонтрибуцияЗаявки + Стр.Калькуляция.ММ_ИтогоВознаграждение;
				//Конецесли;
				КонтрибуцияЗаявки = КонтрибуцияЗаявки + ?(КонтрибуцияКалькуляции = неопределено,0,КонтрибуцияКалькуляции);
				//Евросиб Шевченко А.В. US 99262 TA 121126 09.10.2025
			КонецЕсли;
		КонецЕсли;    
		
		// блок Отказов
		
		//Если ЗначениеЗаполнено(Стр.Калькуляция) И ЗначениеЗаполнено(Стр.ПСЦ) И (ПСЦ.Договор <> Договор ИЛИ Стр.ПСЦ.Калькуляции.НайтиСтроки(Новый Структура("Калькуляция", Стр.Калькуляция)).Количество() = 0) Тогда 
		//	Сообщить("Ошибка указания калькуляции в строке: " + Стр.НомерКТК);
		//	Отказ = Истина;
		//КонецЕсли;
		
		//Евросиб Коханенко Н.А. 24.02.2025 (( #101467
		//в связи с введением статусов строк "ВРаботе" и "Черновик"
		//Если НЕ ЗначениеЗаполнено(Стр.ПСЦ) И НЕ ЗначениеЗаполнено(Стр.Калькуляция) И ЗначениеЗаполнено(Стр.НомерКТК) Тогда 
		//	Отказ = Истина; 
		//	Сообщить("В составе услуг требуется указать протокол."); 
		//КонецЕсли;
		//Евросиб Коханенко Н.А. 24.02.2025 )) #101467 
		
		Если НеПроверятьВидСобственностиКТК = Ложь И ЗначениеЗаполнено(Стр.НомерКТК) И НЕ ЗначениеЗаполнено(Стр.ПринадлежностьТЕ) Тогда
			Отказ = Истина;
			Сообщить("Укажите принадлежность и вид собственности для всех внесенных контейнеров!");
		КонецЕсли; 
		
		//Евросиб Коханенко Н.А. 14.02.2025 (( #101467
		СтатусВРаботе = ПредопределенноеЗначение("Перечисление.СтатусыСтрокЗаявки.ВРаботе");
		Если ЗначениеЗаполнено(Стр.Калькуляция) 
				И Стр.Статус <> СтатусВРаботе Тогда
			Стр.Статус = СтатусВРаботе;
		ИначеЕсли НЕ ЗначениеЗаполнено(Стр.Статус) Тогда
			Стр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыСтрокЗаявки.Черновик");
		КонецЕсли;
		//Евросиб Коханенко Н.А. 14.02.2025 )) #101467 
		
	КонецЦикла;
	
	//Евросиб Коханенко Н.А. 11.06.2025 (( #93365 
	Если ПолучитьРезультатПроверкиНаОшибкиПринадлежностиКТКИЗаполненностиСтавокВКалькуляций() Тогда
		Отказ = Истина;
	КонецЕсли; 
	//Евросиб Коханенко Н.А. 11.06.2025 )) #93365 
	
	//ДИТ Беляев СЮ, Ticket#0250118, 29-11-2021 ++
	Если ПолучитьРезультатПроверкиНаОшибкиЗаполненияКалькуляций() Тогда
		Отказ = Истина;
	КонецЕсли; 
	//ДИТ Беляев СЮ, Ticket#0250118, 29-11-2021 --
	
	//Евросиб - АСуслов 09.11.2020 11:19:36 #
	//(
	//Если НЕ ОбменДанными.Загрузка И ЗначениеЗаполнено(Контрагент) И КонтрагентыДоговоры_сервер.КонтрагентВСтопЛисте(Контрагент, ТекущаяДата()).ВСтопЛисте = Истина Тогда
	Если НЕ ОбменДанными.Загрузка 
		И НЕ ПометкаУдаления
		И ЗначениеЗаполнено(Контрагент) 
		И КонтрагентыДоговоры_сервер.КонтрагентВСтопЛисте(Контрагент, Дата).ВСтопЛисте = Истина Тогда
	//)
	//Евросиб - АСуслов 09.11.2020 11:19:36 #
		Отказ = Истина;
		Сообщить("Клиент находится в стоп-листе. Запись заявки запрещена.");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПСЦ) И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		// проверяем наличие состояния "ТребуетсяСозданиеПСЦ" и его выполнения. 
		// если выполнено, то удаляем эту строку и вносим заново информацию по состоянию, т.к. ПСЦ не заполнен
		// если не выполнено, ничего не делаем
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Состояние",Справочники.Состояния.ТребуетсяСозданиеПСЦ);
		НайденныеСтроки = Состояния.НайтиСтроки(ПараметрыОтбора);
		// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 30.11.2022
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Договор",				Договор);
		СтруктураПараметров.Вставить("ЦФО",					Справочники.ЦентрыФинансовойОтветственности.ОсновнойЦФО);
		СтруктураПараметров.Вставить("ТипОтветственного",	Перечисления.ТипыОтветственных.ОтветственныйЗаСопровождение);  
		мОтветственныйЗаСопровождение = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственного(СтруктураПараметров);
		// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 30.11.2022
		Если (НайденныеСтроки.Количество()>0 И
			НайденныеСтроки[0].Статус = Перечисления.СтатусыЭтапов.Выполнен) Тогда
			ИндексУдаляемойСтроки = Состояния.Индекс(НайденныеСтроки[0]);
			Состояния.Удалить(ИндексУдаляемойСтроки);
			
			НовСтр = Состояния.Добавить();
			НовСтр.Состояние = Справочники.Состояния.ТребуетсяСозданиеПСЦ;
			// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 30.11.2022
			// Было:
			//НовСтр.Исполнитель = Договор.ОтветственныйЗаСопровождение;
			//НовСтр.Наблюдатель = Договор.ОтветственныйЗаСопровождение;
			//Стало:
			НовСтр.Исполнитель = мОтветственныйЗаСопровождение;
			НовСтр.Наблюдатель = мОтветственныйЗаСопровождение;
			// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 30.11.2022
			НовСтр.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
			НовСтр.НачалоРаботы = ТекущаяДата();
			НовСтр.НормативИсполненияСМоментаСоздания = 24;
		ИначеЕсли НайденныеСтроки.Количество() = 0 Тогда
			НовСтр = Состояния.Добавить();
			НовСтр.Состояние = Справочники.Состояния.ТребуетсяСозданиеПСЦ;
			// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 30.11.2022
			// Было:
			//НовСтр.Исполнитель = Договор.ОтветственныйЗаСопровождение;
			//НовСтр.Наблюдатель = Договор.ОтветственныйЗаСопровождение;
			//Стало:
			НовСтр.Исполнитель = мОтветственныйЗаСопровождение;
			НовСтр.Наблюдатель = мОтветственныйЗаСопровождение;
			// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 30.11.2022
			НовСтр.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
			НовСтр.НачалоРаботы = ТекущаяДата();
			НовСтр.НормативИсполненияСМоментаСоздания = 24;
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(ПСЦ) И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		// если ПСЦ заполнено, то удалить из таблицы состояний ТребуетсяСозданиеПСЦ, если оно там есть 
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Состояние",Справочники.Состояния.ТребуетсяСозданиеПСЦ);
		НайденныеСтроки = Состояния.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество()>0 Тогда
			ИндексУдаляемойСтроки = Состояния.Индекс(НайденныеСтроки[0]);
			Состояния.Удалить(ИндексУдаляемойСтроки);
        КонецЕсли;
	КонецЕсли;
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	
	Грузы = Новый Массив;
	Контейнеры = Новый Массив;
	Вагоны = Новый Массив;
	
	ДатаОтправленияРейса = неопределено;
	ДатаПрибытияРейса = неопределено;
	Для каждого Стр3 из ПереченьРейсов Цикл
		Если ТипЗнч(Стр3.Рейс) = Тип("СправочникСсылка.РейсыЖД") Тогда
			ДатаОтправленияРейса = Стр3.Рейс.ДатаОтправления;
			ДатаПрибытияРейса = Стр3.Рейс.ДатаПрибытия;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Стр из СоставУслуги Цикл
		
		// SIV планируемые к доступности определяются как те плановые ящики, которые ушли из стока и по рейсуЖД будут в следующем стоке через какое-то время
		Если Стр.ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТЕвросиба И ЗначениеЗаполнено(ДатаОтправленияРейса) И ЗначениеЗаполнено(ДатаПрибытияРейса) Тогда
					
			Если НЕ ЗначениеЗаполнено(Стр.СтокСдачиПорожнего) Тогда Стр.СтокСдачиПорожнего = Локации_сервер.ВычислитьСтокПодхода(Стр.ПунктНазначения); КонецЕсли;
			
			Если ТребоватьСтокСдачи И ЗначениеЗаполнено(Стр.НомерКТК) И НЕ ЗначениеЗаполнено(Стр.СтокСдачиПорожнего) Тогда
				Сообщить("Укажите стоки сдачи для КТК " + Стр.НомерКТК);
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		//Если Стр.План И ЗначениеЗаполнено(Стр.ДатаВзятия) и ЗначениеЗаполнено(Стр.ДатаВыдачи) Тогда
		//	Если Стр.ДатаВыдачи < Стр.ДатаВзятия Тогда
		//		Сообщить("Дата выдачи клиенту должна быть позже даты выдачи из стока");
		//		//Отказ = Истина;
		//		//Возврат;
		//	КонецЕсли;
		//	Если (Стр.ДатаВзятия + Стр.НормативноеИспользованиеИзСтока*3600*24) < (Стр.ДатаВыдачи + Стр.НормативноеИспользование*3600*24) Тогда
		//		Сообщить("Дата окончания пользования КТК клиентом не может быть больше даты возврата КТК поставщику");
		//		//Отказ = Истина;
		//		//Возврат;
		//	КонецЕсли;
		//КонецЕсли;
		
		// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 06.02.2023
		// Было:
		//Если Грузы.Найти(Стр.Груз) = неопределено Тогда Грузы.Добавить(Стр.Груз); КонецЕсли; 
		//Стало:   
		// ДИТ US 76935 ТА 78649 Сержантова А.С. Начало: 27.12.2023
		// Было:
		//Если ЗначениеЗаполнено(Стр.КлючАналитикиПеревозки) Тогда 
		//Стало:
		Если ЗначениеЗаполнено(Стр.КлючАналитикиПеревозки) и не ДополнительныеСвойства.Свойство("ДанныеДляОбновленияКлючейАналитики") Тогда
		// ДИТ US 76935 ТА 78649 Сержантова А.С. Конец: 27.12.2023
			мГруз = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.КлючАналитикиПеревозки,"Груз");
			Если Грузы.Найти(мГруз) = неопределено Тогда 
				Грузы.Добавить(мГруз); 
			КонецЕсли;
		КонецЕсли; 
		// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 06.02.2023
		
		КТКНайден = Ложь;
		Для каждого Стр2 из Контейнеры Цикл
			Если ЗначениеЗаполнено(Стр.ТипКТК) И Стр2.КТК = Стр.ТипКТК Тогда Стр2.Количество = Стр2.Количество+1; КТКНайден = Истина; КонецЕсли;
		КонецЦикла;
		Если НЕ КТКНайден И ЗначениеЗаполнено(Стр.ТипКТК) Тогда
			Контейнеры.Добавить(Новый Структура("КТК,Количество", Стр.ТипКТК, 1));
		КонецЕсли;
		
		ВагонНайден = Ложь;
		Для каждого Стр2 из Вагоны Цикл
			Если ЗначениеЗаполнено(Стр.ТипВагона) И Стр2.Вагон = Стр.ТипВагона Тогда Стр2.Количество = Стр2.Количество+1; ВагонНайден = Истина; КонецЕсли;
		КонецЦикла;
		Если НЕ ВагонНайден И ЗначениеЗаполнено(Стр.ТипВагона) Тогда
			Вагоны.Добавить(Новый Структура("Вагон,Количество", Стр.ТипВагона, 1));
		КонецЕсли;
		
		Если Стр.План И ЗначениеЗаполнено(Стр.ДатаВыдачи) И ЗначениеЗаполнено(Стр.НомерКТК) Тогда
			// обновляем информацию для рассылки по срокам возврата КТК
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	РассылкаПоСдачеКТК.Период КАК Период,
			               |	РассылкаПоСдачеКТК.Контейнер КАК Контейнер,
			               |	РассылкаПоСдачеКТК.ИнформироватьЗаКолвоДней КАК ИнформироватьЗаКолвоДней,
			               |	РассылкаПоСдачеКТК.ДатаСдачи КАК ДатаСдачи,
			               |	РассылкаПоСдачеКТК.ОтправленоПоКлиенту КАК ОтправленоПоКлиенту,
			               |	РассылкаПоСдачеКТК.ОтправленоПоВладельцу КАК ОтправленоПоВладельцу,
			               |	РассылкаПоСдачеКТК.Клиент КАК Клиент,
			               |	РассылкаПоСдачеКТК.ВладелецКТК КАК ВладелецКТК,
			               |	РассылкаПоСдачеКТК.ДоговорВладельца КАК ДоговорВладельца,
			               |	РассылкаПоСдачеКТК.ДоговорКлиента КАК ДоговорКлиента
			               |ИЗ
			               |	РегистрСведений.РассылкаПоСдачеКТК КАК РассылкаПоСдачеКТК
			               |ГДЕ
			               |	РассылкаПоСдачеКТК.Период = &ДатаВыдачи
			               |	И РассылкаПоСдачеКТК.Контейнер = &Контейнер";
			Запрос.УстановитьПараметр("ДатаВыдачи",Стр.ДатаВыдачи);
			Запрос.УстановитьПараметр("Контейнер",Стр.НомерКТК);
			РЗ = Запрос.Выполнить();
			// если изначально КТК был безномерным, а в заявке у него появился номер, то внести эту информацию в регистр
			Если РЗ.Пустой() Тогда
				
				МенеджерЗаписи = РегистрыСведений.РассылкаПоСдачеКТК.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Период = Стр.ДатаВыдачи;
				МенеджерЗаписи.Контейнер = Стр.НомерКТК;
				МенеджерЗаписи.Клиент = Контрагент;
				МенеджерЗаписи.ДоговорКлиента = Договор;
				МенеджерЗаписи.ВладелецКТК = Стр.ВладелецКТК;
				МенеджерЗаписи.ИнформироватьЗаКолвоДней = Стр.СрокОтправкиУведомления;
				//МенеджерЗаписи.ДатаСдачи = Стр.ДатаВыдачи + Стр.НормативноеИспользованиеИзСтока*3600;
				МенеджерЗаписи.Записать();
				
			// обновляем дату оповещения в регистре РассылкаПоСдачеКТК для 
			// текущего КТК, если у него стоит другая дата и он еще не был отправлен по почте.
			Иначе
				Тз_рег = РЗ.Выгрузить();
				Для Каждого СтрРег Из ТЗ_рег Цикл
					Если СтрРег.ОтправленоПоКлиенту И СтрРег.ОтправленоПоВладельцу Тогда
						Продолжить;
					КонецЕсли;
					МенеджерЗаписи = РегистрыСведений.РассылкаПоСдачеКТК.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(МенеджерЗаписи,СтрРег,,"ИнформироватьЗаКолвоДней,Клиент,ДоговорКлиента");
					МенеджерЗаписи.ИнформироватьЗаКолвоДней = Стр.СрокОтправкиУведомления;
					МенеджерЗаписи.Клиент = Контрагент;
					МенеджерЗаписи.ДоговорКлиента = Договор;
					МенеджерЗаписи.Записать();				
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
	// ДИТ US 76935 ТА 78649 Сержантова А.С. Начало: 27.12.2023
	Если ДополнительныеСвойства.Свойство("ДанныеДляОбновленияКлючейАналитики") Тогда 
		ДанныеДляОбновленияКлючейАналитики = ДополнительныеСвойства.ДанныеДляОбновленияКлючейАналитики;			
		МассивГрузовНаФорме = ДанныеДляОбновленияКлючейАналитики.ВыгрузитьКолонку("Груз");
		ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивГрузовНаФорме);
		ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(МассивГрузовНаФорме, Справочники.Грузы.ПустаяСсылка());
		Для каждого НаименованиеГруза Из МассивГрузовНаФорме Цикл
			Если Грузы.Найти(НаименованиеГруза) = неопределено Тогда 
				Грузы.Добавить(НаименованиеГруза); 
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	// ДИТ US 76935 ТА 78649 Сержантова А.С. Конец: 27.12.2023
	
	ОписаниеКТК = "";
	ОписаниеВагонов = "";
	Для каждого Стр из Контейнеры Цикл
		ОписаниеКТК = ОписаниеКТК + ?(ОписаниеКТК = "", "", ",") + Стр.КТК + "х" + Стр.Количество;
	КонецЦикла;
	Для каждого Стр из Вагоны Цикл
		ОписаниеВагонов = ОписаниеВагонов + ?(ОписаниеВагонов = "", "", ",") + Стр.Вагон + "х" + Стр.Количество;
	КонецЦикла;
	
	КраткоеОписаниеГруза = "" + СтрСоединить(Грузы, ",") + ?(ОписаниеКТК <> "", " ктк: " + ОписаниеКТК, "") + ?(ОписаниеВагонов <> "", " вагоны: " + ОписаниеВагонов, "");
	
	// + Состояния
	
	///////////////////////////////////
	// SIV: замечание к ТЗ: если по контрагенту баланс лицевого счета не достаточен ИЛИ протокол не согласован или согласован с замечаниями,
	// то такую заявку надо дополнительно ставить на согласование руководителю подразделения
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВзаиморасчетыСПокупателямиОстатки.ВалютаРасчетов КАК ВалютаРасчетов,
		               |	ВзаиморасчетыСПокупателямиОстатки.СуммаСНДСОстаток КАК СуммаСНДСОстаток
		               |ИЗ
		               |	РегистрНакопления.ВзаиморасчетыСПокупателями.Остатки(
		               |			,
		               |			Организация = &Организация
		               |				И Контрагент = &Контрагент) КАК ВзаиморасчетыСПокупателямиОстатки";
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Ответ = Запрос.Выполнить().Выбрать();
		
		ПлановаяСуммаУслуги = 0;
		ТекущийБалансКонтрагентаРУБ = 0;
		
		Если Ответ.Следующий() Тогда
			ТекущийБалансКонтрагентаРУБ = ТекущийБалансКонтрагентаРУБ + Валюта_сервер.ПересчитатьПоКурсу(Ответ.СуммаСНДСОстаток, Ответ.ВалютаРасчетов, Справочники.Валюты.Рубль, Дата);
		КонецЕсли;
		
		Если ПСЦ.Калькуляции.Количество() > 0 Тогда
			ПлановаяСуммаУслуги = КоличествоКТК20 * ПСЦ.Калькуляции[0].Калькуляция.ММ_ИтогоСтавка20 + КоличествоКТК40 * ПСЦ.Калькуляции[0].Калькуляция.ММ_ИтогоСтавка;
		КонецЕсли;
		
		СписокЗапрещенныхСогласовательныхСтатусов = Новый массив;
		СписокЗапрещенныхСогласовательныхСтатусов.Добавить(Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний);
		СписокЗапрещенныхСогласовательныхСтатусов.Добавить(Перечисления.СтатусыСогласования.ОтклоненоСЗамечаниями);
		СписокЗапрещенныхСогласовательныхСтатусов.Добавить(Перечисления.СтатусыСогласования.СогласованоСЗамечаниями);
		СписокЗапрещенныхСогласовательныхСтатусов.Добавить(Перечисления.СтатусыСогласования.ПустаяСсылка());
		
		СогласованоБезЗамечаний = Истина;
		ДопСогласованиеУжеЕсть = Ложь;
		Для каждого Стр из ПСЦ.Состояния Цикл
			ДопСогласованиеУжеЕсть = ДопСогласованиеУжеЕсть ИЛИ Стр.Состояние = Справочники.Состояния.ДопСогласованиеРуководителем;
			Если Стр.Состояние.Согласование И СписокЗапрещенныхСогласовательныхСтатусов.Найти(Стр.СтатусСогласования) <> неопределено Тогда
				СогласованоБезЗамечаний = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ДопСогласованиеУжеЕсть = Ложь И (ТекущийБалансКонтрагентаРУБ - ПлановаяСуммаУслуги < 0 ИЛИ СогласованоБезЗамечаний = Ложь) Тогда
			
			НаМоментЗаписиБылаЗадолженность = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	///////////////////////////////////
	
	
	// проверяем корректность перечня состояний в ТЧ Состояния
	Для Сч = 0 По Состояния.Количество() - 2 Цикл
		ТекСостояние = Состояния[Сч].Состояние;
		Для ТекСч = Сч + 1 По Состояния.Количество() - 1 Цикл
			Если Состояния[ТекСч].Состояние = ТекСостояние Тогда
				Сообщить("Ошибка: одно состояние может встречаться в документе только один раз!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	//++ Зубов 35844 05.08.2021
	////Стаценко Параллельное согласование
	//Для каждого СтрТЧ из Состояния Цикл
	//	Если Не ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//		СтрТЧ.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//        ПредыдущиеЭтапы = СтрТЧ.ПредыдущиеЭтапы;
	//		Попытка
	//			МассивЭтапов = СтрРазделить(ПредыдущиеЭтапы,",",Ложь);
	//		Исключение
	//			Сообщить("Некорректная строка предыдущих этапов");
	//		КонецПопытки;
	//		ВозможноВыполнение = Истина;
	//		Если МассивЭтапов.Количество() > 0 Тогда
	//			Для каждого Эл из МассивЭтапов Цикл
	//				Попытка
	//					НомСтр = Число(Эл);
	//					СтрЭтапа = Состояния.Найти(НомСтр,"НомерСтроки");
	//					Если СтрЭтапа <> Неопределено Тогда
	//						Если СтрЭтапа.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//							ВозможноВыполнение = Ложь;
	//						КонецЕсли;
	//					КонецЕсли;
	//				Исключение
	//					Сообщить("Некорректное указание этапа состояние. Возможен только ввод цифр.");
	//				КонецПопытки
	//			КонецЦикла;
	//		КонецЕсли;
	//		Если ВозможноВыполнение Тогда
	//			СтрТЧ.Статус =  Перечисления.СтатусыЭтапов.НаВыполнение;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	////Стаценко
	//МаршрутизацияСервер.ПараллельноеСогласование(Состояния); //ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, закомментировал (перенёс ниже)
	//-- Зубов 35844 05.08.2021
	
	//Евросиб Каблов 20.07.2020 (
	СибурИзменилЗаявку = Ложь;
	СибурИзмененияЗаявки = Неопределено;
	Если ДополнительныеСвойства.Свойство("СибурИзмененияЗаявки", СибурИзмененияЗаявки) Тогда
		СибурИзменилЗаявку = Истина;		
	КонецЕсли;
	//Евросиб Каблов 20.07.2020 )

	// Маршрутизация заявки
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = МаршрутизацияСервер.ТребуетсяПеремаршрутизацияДляОбъекта(ЭтотОбъект); 
	Если ДляДанногоОбъектаТребуетсяПеремаршрутизация = Ложь Тогда
		ДляДанногоОбъектаТребуетсяПеремаршрутизация = Документы.Заявка.ТребуетсяМаршрутизацияДляОбъекта_ДополнительноДляЗаявки(ЭтотОбъект);
		ДляДанногоОбъектаТребуетсяПеремаршрутизация = ДляДанногоОбъектаТребуетсяПеремаршрутизация ИЛИ СибурИзменилЗаявку;
	КонецЕсли;
	//НЕ ЗначениеЗаполнено(Ссылка) ИЛИ 
	//Ссылка.Организация <> Организация ИЛИ 
	//Ссылка.Контрагент <> Контрагент ИЛИ
	//Ссылка.ВидПеревозки <> ВидПеревозки ИЛИ
	//Ссылка.Договор <> Договор ИЛИ Состояния.Количество() = 0 ИЛИ
	//Ссылка.ИсточникЗаявки <> ИсточникЗаявки ИЛИ
	//Ссылка.НаМоментЗаписиБылаЗадолженность <> НаМоментЗаписиБылаЗадолженность ИЛИ
	//(ЗначениеЗаполнено(Ссылка.ПСЦ) И НЕ ЗначениеЗаполнено(ПСЦ)) ИЛИ
	//(НЕ ЗначениеЗаполнено(Ссылка.ПСЦ) И ЗначениеЗаполнено(ПСЦ)) ИЛИ
	//(Ссылка.ПереченьРейсов.Количество() = 0 И ПереченьРейсов.Количество() > 0) ИЛИ
	//(Ссылка.ПереченьРейсов.Количество() > 0 И ПереченьРейсов.Количество() = 0) ИЛИ
	////Евросиб Каблов 20.07.2020 (
	//Ссылка.СтатусЗаявкиСибур <> СтатусЗаявкиСибур И СибурИзменилЗаявку ИЛИ
	////Евросиб Каблов 20.07.2020 )
	//// Евросиб Фролов (16.11.2021 TASK№ №41969
	//Ссылка.ЗапросНаКТК <> ЗапросНаКТК ИЛИ
	//// Евросиб Фролов)
	
	Если Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		//Евросиб - АСуслов 24.12.2021 11:23:33 #
		//(
		//Параметры убрал в менеджер
		ПараметрыЗапроса = Документы.Заявка.ПолучитьПараметрыМаршрутизации(ЭтотОбъект);
		//)
		//Евросиб - АСуслов 24.12.2021 11:23:33 #
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьЗаявку(ПараметрыЗапроса, Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			УказанныеВручнуюИспНаблюдатель = Новый СписокЗначений;
			Если ДополнительныеСвойства.Свойство("ДопСвойстваОбъекта") тогда
				УказанныеВручнуюИспНаблюдатель = ДополнительныеСвойства.ДопСвойстваОбъекта;
			КонецЕсли;
			МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъект, РезультатЗапроса, Автор, УказанныеВручнуюИспНаблюдатель);			
		КонецЕсли;
		
		//Евросиб Каблов 26.12.2022 ( 62514
		Если ЭтоНовый() И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Заявка") И ЗначениеЗаполнено(ДокументОснование) Тогда			
			МаршрутизацияСервер.УстановитьСтатусыЗадачПоОснованию(ЭтотОбъект, ЭтотОбъект.ДокументОснование);			
		КонецЕсли;
		//Евросиб Каблов 26.12.2022 )
		
		// ДИТ US 76975 ТА 76977 Сержантова А.С. Начало: 21.11.2023 - 
		//при перемаршрутизации удаленного маршрута восстанавливаем выполненные задачи, внутренний статус запроса  
		Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка.ПримененныйМаршрут) 
			и ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Ссылка.ПримененныйМаршрут, "ПометкаУдаления") Тогда
			Для каждого СтрСостоянияНов Из ЭтотОбъект.Состояния Цикл
				СтрокиПоСостоянию = ЭтотОбъект.Ссылка.Состояния.НайтиСтроки(Новый Структура("Состояние", СтрСостоянияНов.Состояние));	
				Если СтрокиПоСостоянию.Количество() Тогда
					СтрСостоянияНов.Статус = СтрокиПоСостоянию[0].Статус;
					СтрСостоянияНов.НачалоРаботы = СтрокиПоСостоянию[0].НачалоРаботы;
					СтрСостоянияНов.ЗавершениеРаботы = СтрокиПоСостоянию[0].ЗавершениеРаботы; 
					СтрСостоянияНов.ПричинаОтказа = СтрокиПоСостоянию[0].ПричинаОтказа;
					СтрСостоянияНов.Комментарий = СтрокиПоСостоянию[0].Комментарий;
				КонецЕсли;
			КонецЦикла;
			
			Если ЭтотОбъект.ЗапросНаКТК Тогда
				ЭтотОбъект.ВнутреннийСтатусЗапроса = ЭтотОбъект.Ссылка.ВнутреннийСтатусЗапроса;
			КонецЕсли;  
			
			МаршрутизацияСервер.ИсполнениеЗадачПриИзмеренииПСЦвЗаявке(ЭтотОбъект);
		КонецЕсли;
		// ДИТ US 76975 ТА 76977 Сержантова А.С. Конец: 21.11.2023
	
	КонецЕсли;
	
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, начало
	МаршрутизацияСервер.ПараллельноеСогласование(Состояния);
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, конец
	
	//Евросиб Каблов 20.07.2020 (
	Если СибурИзменилЗаявку Тогда
		СтрокаСостояния = Состояния.Найти(Справочники.Состояния.ПроверкаИКонтрольИзмененийДокумента, "Состояние");
		Если СтрокаСостояния <> Неопределено Тогда
			СтрокаСостояния.Комментарий = СибурИзмененияЗаявки.Комментарий;
			СтрокаСостояния.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
		КонецЕсли;
	КонецЕсли;
	//Евросиб Каблов 20.07.2020 )
	
	
	Для каждого Стр из Состояния Цикл
		Если Стр.ПримечаниеЗадачаИсполнителю Тогда
			// если текст примечания изменился, то создать новое сообщение. если остался прежним, то не менять
			// т.к. состояние уникально, ищем по нему
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Состояние",Стр.Состояние);
			НайденнаяСтр = Ссылка.Состояния.НайтиСтроки(ПараметрыОтбора);
			Если НайденнаяСтр.Количество()>0 Тогда
				Если НЕ НайденнаяСтр[0].Комментарий = Стр.Комментарий Тогда
					
					// +Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					ДатаСообщения = ТекущаяДата();
					АвторСообщения = Пользователи.ТекущийПользователь();
					ТекстСообщения = Стр.Комментарий;
					ГУИДСообщения = Новый УникальныйИдентификатор();
					
					ГУИДТемы = Новый УникальныйИдентификатор;
					
					РассылкаПоЛичнымЦелям.СформироватьЛичноеСообщение(ГУИДТемы, , Ссылка, ДатаСообщения, АвторСообщения, ТекстСообщения, , ГУИДСообщения, Стр.Исполнитель);
					// -Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// ДИТ US 76975 ТА 76977 Сержантова А.С. Начало: 15.11.2023    
	МаршрутизацияСервер.ИсполнениеЗадачПриИзмеренииПСЦвЗаявке(ЭтотОбъект);
	// ДИТ US 76975 ТА 76977 Сержантова А.С. Конец: 15.11.2023

	МаршрутизацияСервер.ПостобработкаТЧСостояний(ЭтотОбъект, Автор); 
	
	// Евросиб Фролов (2.03.2022 Task №44768
	// После возврата одной из задач меняются статусы последующих задач.
	// Проверим внутренний статус запроса.
	Если ЗапросНаКТК И ДополнительныеСвойства.Свойство("ВозвращенаЗадача") Тогда
		ВнутреннийСтатусЗапроса = ПредопределенноеЗначение("Перечисление.ВнутренниеСтатусыЗапросовНаКТК.Черновик");
		Для Каждого СтрокаСостояни Из Состояния Цикл
			Документы.Заявка.ОбновитьВнутреннийСтатусЗапроса(ЭтотОбъект, Проведен, СтрокаСостояни.Состояние, СтрокаСостояни.Статус);
		КонецЦикла;	
	КонецЕсли;
	// Евросиб Фролов)
	
	// определяем текущее состояние. для нас это первое состояние не в "выполнено"
	//Для каждого Состояние из Состояния Цикл
	//	Если Состояние.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//		ТекущееСостояние = Состояние.Состояние;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
		
	// - Состояния
	
	// SIV 28-05-21 Задачи, связанные с работой кнопки "Исключить КТК из сделки":
	// 1. Если в заявку, по которой выставлен и оплачен счет, добавили КТК, нужно ставить задачу на отработку
	// 1. Если в заявке, по которой выставлен и оплачен счет, удалили КТК, нужно ставить задачу на отработку
	
	//Евросиб Коханенко Н.А. 20.05.2024 (( #83866 
	//УдалениеКТКИзСделки_Сервер.ПостановкаЗадачиПриИзмененииКоличестваВыставляемыхКТК_Заявка(ЭтотОбъект);
	ПереносКТКСервер.ПостановкаЗадачиПриИзмененииКоличестваВыставляемыхКТК_Заявка(ЭтотОбъект);
	//Евросиб Коханенко Н.А. 20.05.2024 )) #83866 
	
	ЛичныеЦелиСервер.ОчиститьЗаписиЛичныхЦелей(Ссылка);
	
	//Евросиб Каблов 27.07.2020 (
	ЗаписатьДанныеПоЗаявкеСибур();
	//Евросиб Каблов 27.07.2020 )
	
	// Евросиб Фролов (28.02.2022 Task №46354	
	ДополнительныеСвойства.Вставить("ОбъектДоЗаписи", ПодсвечиваниеПолейОбъектов.ПолучитьСтруктуруРеквизитовОбъекта(Ссылка));
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ОчищатьЗаписиРегистраПодсветки = ВнутреннийСтатусЗапроса = Перечисления.ВнутренниеСтатусыЗапросовНаКТК.Отработан
									И ВнутреннийСтатусЗапроса <> Ссылка.ВнутреннийСтатусЗапроса;
	ДополнительныеСвойства.Вставить("ОчищатьЗаписиРегистраПодсветки", ОчищатьЗаписиРегистраПодсветки);
	// Евросиб Фролов) 
	// ДИТ US 83041 ТА 83043 Сержантова А.С. Начало: 02.05.2024 - перенесено на форму с выдачей окна вопроса
	// Было:
	////+ДИТ_Коробов_task 40377 23.03.22
	//Если Модифицированность() Тогда
	//	ПроверитьПодчиненныеСчета();
	//КонецЕсли;
	////-ДИТ_Коробов_task 40377 23.03.22 
	// ДИТ US 83041 ТА 83043 Сержантова А.С. Конец: 02.05.2024
	
	// Евросиб Фролов (24.03.2022 US №40767
	// Task №48648
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ПроверитьВозможностьОтменыПроведенияДокумента(Отказ);
	КонецЕсли;	
	// Евросиб Фролов)
	
	//ДИТ Шевченко А.В. TASK 51973 14.06.2022 -Начало
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения ИЛИ ПометкаУдаления Тогда
		ПроверитьВозможностьОтменыПоЗаказамНаАвтоперевозку(Отказ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ПроверитьКлючевыеРеквизитыЗаказаНаАвтопревозку(Ссылка);
	КонецЕсли;
	//ДИТ Шевченко А.В. TASK 51973 14.06.2022 -Конец 
	
	// ДИТ US 76935 ТА 78649 Сержантова А.С. Начало: 11.12.2023    
	//Убрали из формы интерактивную запись ключей аналитики при изменении реквизитов ТЧ. 
	//Теперь все изменения в форме фиксируются в доп свойствах "ДанныеДляОбновленияКлючейАналитики"
	//Здесь записываем данные в ключи аналитики
	#Область ПроверкаИЗаписьДанныхКлючейАналитикиПеревозки
	Если ДополнительныеСвойства.Свойство("ДанныеДляОбновленияКлючейАналитики") Тогда 
		ДанныеДляОбновленияКлючейАналитики = ДополнительныеСвойства.ДанныеДляОбновленияКлючейАналитики;
		
		Если не Отказ и (РежимЗаписи = РежимЗаписиДокумента.Запись
			или РежимЗаписи = РежимЗаписиДокумента.Проведение) Тогда 
			
			Для каждого СтрДанныхКлюча Из ДанныеДляОбновленияКлючейАналитики Цикл
				Если СтрДанныхКлюча.ИсточникКлюча = "СоставУслуги" Тогда
					СтрокаТаблицы = СоставУслуги.Найти(СтрДанныхКлюча.НомерСтроки, "НомерСтроки");
				ИначеЕсли СтрДанныхКлюча.ИсточникКлюча = "ТранспортныеСредства" Тогда
					СтрокаТаблицы = ТранспортныеСредства.Найти(СтрДанныхКлюча.НомерСтроки, "НомерСтроки");	
				ИначеЕсли СтрДанныхКлюча.ИсточникКлюча = "ТранспортныеСредстваПоследняяМиля" Тогда	
					СтрокаТаблицы = ТранспортныеСредстваПоследняяМиля.Найти(СтрДанныхКлюча.НомерСтроки, "НомерСтроки");
				КонецЕсли;  
				// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Начало: 22.01.2024
				СтрДанныхКлюча.ДанныеКлюча.СтруктураТЧМилиПерваяМиляКлючаАналитики.Удалить("ВариантАвтоперевозки");
				СтрДанныхКлюча.ДанныеКлюча.СтруктураТЧМилиПерваяМиляКлючаАналитики.Удалить("НомерСтрокиЗапроса");  
				СтрДанныхКлюча.ДанныеКлюча.СтруктураТЧМилиПоследняяМиляКлючаАналитики.Удалить("ВариантАвтоперевозки");
				СтрДанныхКлюча.ДанныеКлюча.СтруктураТЧМилиПоследняяМиляКлючаАналитики.Удалить("НомерСтрокиЗапроса");
				// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Конец: 22.01.2024
				ОбновленныйКлюч = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтрДанныхКлюча.ДанныеКлюча); 
				СтрокаТаблицы.КлючАналитикиПеревозки = ОбновленныйКлюч.КлючАналитикиПеревозки;  
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	#КонецОбласти   
	// ДИТ US 76935 ТА 78649 Сержантова А.С. Конец: 11.12.2023 
	
	// ДИТ US 81881 ТА 83581 Сержантова А.С. Начало: 08.04.2024  
	СписокРейсовБыл = Ссылка.ПереченьРейсов.ВыгрузитьКолонку("Рейс");
	СписокРейсовСтал = ПереченьРейсов.ВыгрузитьКолонку("Рейс"); 
	УдалитьИзМассиваАвтомобильныеРейсы(СписокРейсовБыл);
	УдалитьИзМассиваАвтомобильныеРейсы(СписокРейсовСтал); 
	// Евросиб(ДИТ) BUG 87051 Сержантова А.С. 20.06.2024 исправлено условие
	Если не Отказ и (ЗначениеЗаполнено(Ссылка) 
		и не ОбщегоНазначенияКлиентСервер.СпискиЗначенийИдентичны(СписокРейсовБыл,СписокРейсовСтал)) Тогда
		ПроверитьЗапросНаАвтоСоздатьЗадачуНаОбновление();   
	КонецЕсли;
	// ДИТ US 81881 ТА 83581 Сержантова А.С. Конец: 08.04.2024
	
	// Евросиб(ДИТ) US 84968 ТА 85632 Сержантова А.С. Начало: 12.09.2024     
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПомеченныеНаУдалениеРейсы = Новый Массив;
		Для каждого СтрРейса Из ПереченьРейсов Цикл 
			Если ТипЗнч(СтрРейса.Рейс) = Тип("СправочникСсылка.РейсыМоре") Тогда 
				РеквизитыРейса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрРейса.Рейс, "ПометкаУдаления, ДатаОтправления");
				Если РеквизитыРейса.ПометкаУдаления и РеквизитыРейса.ДатаОтправления > ТекущаяДата() Тогда
					ПомеченныеНаУдалениеРейсы.Добавить(СтрРейса.Рейс);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если ПомеченныеНаУдалениеРейсы.Количество() > 0 Тогда
			МаршрутизацияСервер.СформироватьЗадачуОбработкиУдаленияМорскогоРейса(Ссылка, Состояния, Автор, ПомеченныеНаУдалениеРейсы); 
		КонецЕсли;
	КонецЕсли;
	// Евросиб(ДИТ) US 84968 ТА 85632 Сержантова А.С. Конец: 12.09.2024
	
	// Евросиб US 88665 TA 88668 Рыбьяков К.А. 01.12.2024 ((
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ПроверитьЗаписиВДоплатныхБлокахПоРелизамСобственника();
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 01.12.2024 ))
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Маршрутизировать = Константы.МаршрутизироватьЗаявку.Получить();
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Редактор = неопределено;
	Изменено = неопределено;
	Состояния.Очистить();
	//Евросиб Каблов 26.12.2022 ( 62514
	ДокументОснование = Неопределено;
	//Евросиб Каблов 26.12.2022 )
	
	// ДИТ BUG 79844 Сержантова А.С. Начало: 17.01.2024 - Зачем создавать ключи аналитики, а потом очищать таблицу услуг?
	// Было:
	//// Евросиб Фролов (20.01.2022, Яна 
	//// При копировании заявки ГУИДы в строках услуг необходимо
	//Для Каждого ТекущаяСтрокаУслуги Из СоставУслуги Цикл
	//	ТекущаяСтрокаУслуги.ГУИДСтроки = Строка(Новый УникальныйИдентификатор());
	//	// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 03.03.2023
	//	СтруктураКлючаАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
	//	СтруктураКлючаАналитикиПеревозки.Заявка = Ссылка;
	//	СтруктураКлючаАналитикиПеревозки.Контейнер = ТекущаяСтрокаУслуги.НомерКТК;
	//	//СтруктураКлючаАналитикиПеревозки.КлючАналитики = Стр.КлючАналитикиПеревозки;
	//	КлючАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлючаАналитикиПеревозки);
	//	ТекущаяСтрокаУслуги.КлючАналитикиПеревозки = КлючАналитикиПеревозки.КлючАналитикиПеревозки; 		
	//	// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 03.03.2023
	//КонецЦикла;	
	//// Евросиб Фролов)    
	//Стало:
	ТранспортныеСредства.Очистить();
	ТранспортныеСредстваПоследняяМиля.Очистить();
	// ДИТ BUG 79844 Сержантова А.С. Конец: 17.01.2024

	
	//ДИТ Авдеева В.С. 51139 13.05.2022 Начало 
	ДатаСозданияЗапроса = Дата(1,1,1,0,0,0); 
	//ДИТ Авдеева В.С. 51139 13.05.2022 Конец
	
	//++ДИТ Гаузер А.В. BUG 51648 TA 51649 15.07.2022
	//При копировании если в полях "Локация выдачи", "Локация сдачи" ТЧ "Запрос на КТК" указаны объекты справочника «Локации»
	//с одним из типов: "Сток", "Терминал", "Порт", "Станция ЖД", "Улица",
	//то необходимо очищать значения этих полей в скопированной заявке
	ЛокацияПустаяСсылка = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
	
	Для Каждого ТекущаяСтрокаСписокЗапросНаКТК Из СписокЗапросНаКТК Цикл 
		
		Сообщение = "В строке %1 табличной части ""Запрос на КТК"" очищен реквизит ""%2"". "
				  + "Запрещено копировать локации с типом: ""Сток"", ""Терминал"", ""Порт"", ""Станция ЖД"", ""Улица""!";
		
		Если Документы.Заявка.НеобходимоОчиститьЛокацию(ТекущаяСтрокаСписокЗапросНаКТК.ЛокацияВыдачи) Тогда //ДИТ Гаузер А.В. BUG 51648 TA 56121 16.08.2022
			
			ТекущаяСтрокаСписокЗапросНаКТК.ЛокацияВыдачи = ЛокацияПустаяСсылка;
			
			СообщениеПользователю = СтрШаблон(Сообщение, ТекущаяСтрокаСписокЗапросНаКТК.НомерСтроки, "Локация выдачи"); 
			ОбщегоНазначения.СообщитьПользователю(СообщениеПользователю, ЭтотОбъект, "Объект.СписокЗапросНаКТК["+(ТекущаяСтрокаСписокЗапросНаКТК.НомерСтроки-1)+"].ЛокацияВыдачи", ТекущаяСтрокаСписокЗапросНаКТК.ЛокацияВыдачи); 
			
		КонецЕсли;
		
		Если Документы.Заявка.НеобходимоОчиститьЛокацию(ТекущаяСтрокаСписокЗапросНаКТК.ЛокацияСдачи) Тогда //ДИТ Гаузер А.В. BUG 51648 TA 56121 16.08.2022

			ТекущаяСтрокаСписокЗапросНаКТК.ЛокацияСдачи = ЛокацияПустаяСсылка;

			СообщениеПользователю = СтрШаблон(Сообщение,ТекущаяСтрокаСписокЗапросНаКТК.НомерСтроки, "Локация сдачи"); 
			ОбщегоНазначения.СообщитьПользователю(СообщениеПользователю, ЭтотОбъект, "Объект.СписокЗапросНаКТК["+(ТекущаяСтрокаСписокЗапросНаКТК.НомерСтроки-1)+"].ЛокацияСдачи", ТекущаяСтрокаСписокЗапросНаКТК.ЛокацияСдачи); 

		КонецЕсли; 
		
		//Субботин 77659 12.01.2024 Начало
		ТекущаяСтрокаСписокЗапросНаКТК.СписокКТК = Неопределено;
		ТекущаяСтрокаСписокЗапросНаКТК.ИдентификаторСтроки = Новый УникальныйИдентификатор;   
		//Субботин 77659 12.01.2024 Конец  
	КонецЦикла;	
	//--ДИТ Гаузер А.В. BUG 51648 TA 51649 15.07.2022
	
	СоставУслуги.Очистить(); //ДИТ Шевченко А.В. US 62482 ТА 72785 21.07.2023 
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ИспользоватьАРМКТК = Константы.ИспользоватьАРМКТК.Получить();
	//ДИТ Шевченко А.В. US 62360 ТА 73535 09.08.2023
	//Движения.ПродажиПродуктов.Записывать = Истина;
	//Для каждого Стр из ПереченьРейсов Цикл
	//	Движение 				= Движения.ПродажиПродуктов.ДобавитьПриход();
	//	Движение.ЗанятоСлотов 	= КоличествоКТК20 + КоличествоКТК40*2;
	//	Движение.Отправка 		= Стр.Рейс.ДатаОтправления;
	//	Движение.Период  		= Дата;
	//	Движение.Продукт 		= Стр.Продукт;
	//	Движение.Регистратор 	= Ссылка;
	//	Движение.Организация 	= Организация;
	//КонецЦикла;
	//ДИТ Шевченко А.В. US 62360 ТА 73535 09.08.2023
	// если контейнер изменился, то надо старый контейнер убрать из документа АктПостановкиСнятияСУчета

	Если ИспользоватьАРМКТК = Ложь Тогда
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	АктПостановкиСнятияСУчета.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.АктПостановкиСнятияСУчета КАК АктПостановкиСнятияСУчета
	               |ГДЕ
	               |	АктПостановкиСнятияСУчета.ДокументОснование = &ДокументОснование
	               |	И НЕ АктПостановкиСнятияСУчета.ПометкаУдаления";

	Запрос.УстановитьПараметр("ДокументОснование",Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		// создать новый акт
		ТекАкт = Документы.АктПостановкиСнятияСУчета.СоздатьДокумент();
		ТекАкт.ДокументОснование = Ссылка;
		ТекАкт.Организация = ПСЦ.Организация;
		ТекАкт.ЦФО = ПСЦ.ЦФО;
		ТекАкт.Подразделение = ПСЦ.Подразделение;
		ТекАкт.Автор = Пользователи.ТекущийПользователь(); //Гудкова тикет 0208907  ПСЦ.Автор;
		ТекАкт.Дата = ТекущаяДата();
	Иначе
		// исправить существующий
		Выборка = РезультатЗапроса.Выбрать();
	
		Если Выборка.Следующий() Тогда
			ТекАкт = Выборка.Ссылка.ПолучитьОбъект();
			ТекАкт.РегистрацияНовыхКонтейнеров.Очистить();
		КонецЕсли;
	КонецЕсли;
	
	Для каждого Стр из СоставУслуги Цикл     // SIV 09-09-20 добавил для клиентских КТК также постановку на учет, иначе по таким ктк не создаются паспорта, что не очень хорошо
		Если Стр.ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТКлиента И ЗначениеЗаполнено(Стр.НомерКТК) Тогда
			НовСтр = ТекАкт.РегистрацияНовыхКонтейнеров.Добавить();
			НовСтр.НомерКонтейнера = Стр.НомерКТК.Наименование;
			НовСтр.ТипКонтейнера = Стр.ТипКТК;
			НовСтр.Владелец = Стр.ВладелецКТК;
			НовСтр.ДатаВводаВЭксплуатацию = Дата;
			//НовСтр.СрокПользованияДней = Стр.НормативноеИспользованиеИзСтока;
			НовСтр.ВидСобственности = Стр.ВидСобственности;
			// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
			//Было:
			//Если Стр.ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТКлиента Тогда НовСтр.ВидСобственности = Перечисления.ВариантыСобственности.Прочее; КонецЕсли;
			//Стало:
			Если Стр.ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТКлиента Тогда
				НовСтр.ВидСобственности = Перечисления.ВариантыСобственности.Клиентский;
			КонецЕсли;
			// ДИТ 65580 Давудов М.А. Конец: 23.02.2023
			НовСтр.ЛокацияВыдачи = Стр.ПунктОтправления;
			НовСтр.ЛокацияВозврата = Стр.ПунктНазначения;
			НовСтр.ПСЦ = ПСЦ;
			НовСтр.КонтейнерСсылка = Стр.НомерКТК;
		КонецЕсли;
	КонецЦикла;			
	
	Если 
		ЗначениеЗаполнено(ТекАкт.Ссылка) ИЛИ 
		ТекАкт.РегистрацияНовыхВагонов.Количество() > 0 ИЛИ 
		ТекАкт.СнятиеСУчетаВагона.Количество() > 0 ИЛИ 
		ТекАкт.РегистрацияНовыхКонтейнеров.Количество() > 0 ИЛИ 
		ТекАкт.СнятиеСУчетаКонтейнеров.Количество() > 0  
	Тогда
		ТекАкт.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
	КонецЕсли;
	
	// в РС СрокиИспользованияКонтейнеров добавить информацию для текущего контейнера по клиенту
	//Для каждого Стр из СоставУслуги Цикл
	//	Если ИспользоватьАРМКТК И ЗначениеЗаполнено(Стр.ДатаВыдачи) И ЗначениеЗаполнено(Стр.ДатаПриемаВПользованиеПередПоставщиком) И ЗначениеЗаполнено(Стр.НомерКТК) Тогда
	//		
	//		СоответствиеПараметры = Новый Соответствие;
	//		СоответствиеПараметры.Вставить("Клиент", Контрагент);
	//		СоответствиеПараметры.Вставить("Договор", Договор);
	//		СоответствиеПараметры.Вставить("ВыдачаКлиенту", Стр.ДатаВыдачи);
	//		СоответствиеПараметры.Вставить("ПолучениеКонтейнера", Стр.ДатаПриемаВПользованиеПередПоставщиком);
	//		СоответствиеПараметры.Вставить("НормативВозвратаОтКлиента", Стр.НормативноеИспользование);
	//		УправлениеКТКВСтокахСервер.ДобавитьЗаписьИспользованияКонтейнера(Дата, Стр.НомерКТК, СоответствиеПараметры, Ложь);
	//		
	//	КонецЕсли;
	//КонецЦикла;			
	
	// Контейнеры в отправках
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	*
	               |ИЗ
	               |	РегистрСведений.КонтейнерыВОтправке КАК КонтейнерыВОтправке
	               |ГДЕ
	               |	КонтейнерыВОтправке.ЗаявкаРегистратор = &ЗаявкаРегистратор";
	Запрос.УстановитьПараметр("ЗаявкаРегистратор", Ссылка);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		МЗ = РегистрыСведений.КонтейнерыВОтправке.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, Ответ);
		МЗ.Удалить();
	КонецЦикла;
	
	Для каждого Рейс из ПереченьРейсов Цикл
		Если ТипЗнч(Рейс.Рейс) <> Тип("СправочникСсылка.РейсыЖД") Тогда Продолжить; КонецЕсли;
		Для каждого КТК из СоставУслуги Цикл
			Если НЕ ЗначениеЗаполнено(КТК.НомерКТК) ИЛИ ЗначениеЗаполнено(КТК.ПеренесенВЗаявку) Тогда Продолжить; КонецЕсли;
			
			МЗ = РегистрыСведений.КонтейнерыВОтправке.СоздатьМенеджерЗаписи();
			МЗ.ЗаявкаРегистратор = Ссылка;
			МЗ.Отправка = Рейс.Рейс;
			МЗ.Контейнер = КТК.НомерКТК;
			МЗ.Период = Дата;
			МЗ.Регистратор = Ссылка;
			МЗ.Записать(Истина);
			
		КонецЦикла;
	КонецЦикла;
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////////
	////////////////////////////////*********************** *************************///////////////////////////
	////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// регистр КонтейнерыВСтоках Расход.
   // очистка старых движений регистра. это нужно для отмены расходных движений по б/н контейнерам, если они стали номерными.
   // если КТК стал номерным, то кол-во б/н увеличится на этот б/н КТК
    Движения.КонтейнерыВСтоках.Очистить();
    Движения.КонтейнерыВСтоках.Записывать = Истина;
    Движения.Записать();
	
	Движения.ПланируемыеКДоступностиКТК.Записывать = Истина;
	
	ДатаОтправленияРейса = неопределено;
	ДатаПрибытияРейса = неопределено;
	Для каждого Стр3 из ПереченьРейсов Цикл
		Если ТипЗнч(Стр3.Рейс) = Тип("СправочникСсылка.РейсыЖД") Тогда
			ДатаОтправленияРейса = Стр3.Рейс.ДатаОтправления;
			ДатаПрибытияРейса = Стр3.Рейс.ДатаПрибытия;
		КонецЕсли;
	КонецЦикла;
	
	НаборКолонокИзЗаявки = АРМ_Сервер.ПолучитьНаборКолонокКоторыеЗаполняютсяИзЗаявки();
	
	МассивУникальныхРелизов = Новый Массив;
	//ДИТ, Беляев СЮ, BUG 72360, 24-07-2023, начало
	МассивРелизовКлиента = Новый Массив;
	//ДИТ, Беляев СЮ, BUG 72360, 24-07-2023, конец
	//Евросиб(ДИТ), Беляев СЮ, BUG 93345 / TA 96388, 25-11-2024, начало
	МассивКонтейнеровБезЗаписиВТекущиеДанные = КонтейнерыСОткрытымЦиклом();
	//Евросиб(ДИТ), Беляев СЮ, BUG 93345 / TA 96388, 25-11-2024, конец
	Для Каждого Стр Из СоставУслуги Цикл
		
		Если Стр.ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТКлиента Тогда
			// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
			//Было:
			//Стр.ВидСобственности = Перечисления.ВариантыСобственности.Прочее;
			//Стало:
			Стр.ВидСобственности = Перечисления.ВариантыСобственности.Клиентский;
			// ДИТ 65580 Давудов М.А. Конец: 23.02.2023
		КонецЕсли;
		
		Если Стр.План И ЗначениеЗаполнено(Дата) Тогда
			
				СоотвЗаполнения = Новый Соответствие;
				
				Если НаборКолонокИзЗаявки.Найти("ВидСобственности") <> неопределено И ЗначениеЗаполнено(Стр.ВидСобственности) Тогда
					СоотвЗаполнения.Вставить("тек_ВидСобственности", Стр.ВидСобственности);
				КонецЕсли;
				
				//ДИТ Шевченко А.В. 60130 21.11.22 -начало
				//Евросиб Каблов 16.08.2022 ( US41519
				Если Стр.КлиентскийКТК Тогда
					СоотвЗаполнения.Вставить("КлиентскийКТКизЗаявки", Истина);
					СоотвЗаполнения.Вставить("тек_Договор", Договор);
				КонецЕсли;
				Если Стр.ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТКлиента Тогда
					СоотвЗаполнения.Вставить("КлиентскийКТКизЗаявки", Истина);
					СоотвЗаполнения.Вставить("тек_Собственник", Стр.ВладелецКТК);
				КонецЕсли;
				//Если ТекущаяДата() > (Отправка-86400) Тогда	
				Если ЗначениеЗаполнено(Отправка) Тогда	
					СоотвЗаполнения.Вставить("тек_НаСлежении", Истина);
					Если ЗначениеЗаполнено(Стр.НомерКТК) Тогда
						Запись = РегистрыСведений.КонтейнерыНаСлежении.СоздатьМенеджерЗаписи();
						Запись.Контейнер = Стр.НомерКТК;
						ЧасовВСутках = 86400;
						Запись.Период = НачалоДня(Отправка-ЧасовВСутках);
						Запись.НаСлежении = Истина;
						Запись.Записать();
					КонецЕсли;
				КонецЕсли;	
				//Евросиб Каблов 16.08.2022 )
				//ДИТ Шевченко А.В. 60130 21.11.22 -конец
				
				//Если НаборКолонокИзЗаявки.Найти("ВладелецКТК") <> неопределено И ЗначениеЗаполнено(Стр.ВладелецКТК) Тогда
				//	СоотвЗаполнения.Вставить("тек_Собственник", Стр.ВладелецКТК);
				//КонецЕсли;
				
				СоотвЗаполнения.Вставить("тек_Сток", Справочники.Локации.ПустаяСсылка());
				СоотвЗаполнения.Вставить("тек_Статус", Перечисления.СтатусыКТК.ВДвижении);
				СоотвЗаполнения.Вставить("ИсточникЗаписи", "Заявка " + Номер);
				
				Если НаборКолонокИзЗаявки.Найти("СтокСдачиПорожнего") <> неопределено И ЗначениеЗаполнено(Стр.СтокСдачиПорожнего) Тогда
					СоотвЗаполнения.Вставить("тек_СтокСдачи", Стр.СтокСдачиПорожнего);
				КонецЕсли;
				
				// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 03.02.2023
				// Было:
				//Если НаборКолонокИзЗаявки.Найти("ИнструкцииПоСдачеПорожнего") <> неопределено И ЗначениеЗаполнено(Стр.ИнструкцииПоСдачеПорожнего) Тогда
				//	СоотвЗаполнения.Вставить("тек_ИнструкцияПоСдаче", Стр.ИнструкцииПоСдачеПорожнего);
				//КонецЕсли; 
				//Стало:
				ИнструкцииПоСдачеПорожнего = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.КлючАналитикиПеревозки,"ИнструкцияПоСдаче");
				Если НаборКолонокИзЗаявки.Найти("ИнструкцииПоСдачеПорожнего") <> неопределено И ЗначениеЗаполнено(ИнструкцииПоСдачеПорожнего) Тогда	 
					СоотвЗаполнения.Вставить("тек_ИнструкцияПоСдаче", ИнструкцииПоСдачеПорожнего);
				КонецЕсли;
				// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 03.02.2023
				
				//Если ЗначениеЗаполнено(Стр.ДатаВзятия) Тогда
				//	СоотвЗаполнения.Вставить("тек_ДатаВзятияИзСтока", Стр.ДатаВзятия);
				//КонецЕсли;
				//Если ЗначениеЗаполнено(Стр.ДатаПриемаВПользованиеПередПоставщиком) Тогда
				//	СоотвЗаполнения.Вставить("тек_ДатаПриемаВПользование", Стр.ДатаПриемаВПользованиеПередПоставщиком);
				//КонецЕсли;
				//Если ЗначениеЗаполнено(Стр.НормативноеИспользованиеИзСтока) Тогда
				//	СоотвЗаполнения.Вставить("тек_СрокВозврата", Стр.НормативноеИспользованиеИзСтока);
				//КонецЕсли;
				
				//Евросиб Каблов 10.11.2022 ( 52045
				//РегистрыСведений.стоки_ТекущиеДанные.ДобавитьЗапись(Стр.НомерКТК, СоотвЗаполнения, Дата);

				//Евросиб Коханенко Н.А. #63323 02.02.2023 )) 
                //РегистрыСведений.стоки_ТекущиеДанные.ДобавитьЗапись(Стр.НомерКТК, СоотвЗаполнения, Дата,, Не ДополнительныеСвойства.Свойство("ОтключитьВыводСообщений"));
				//Евросиб(ДИТ), Беляев СЮ, BUG 93345 / TA 96388, 25-11-2024, начало
				Если МассивКонтейнеровБезЗаписиВТекущиеДанные.Найти(Стр.НомерКТК) = Неопределено Тогда
				//Евросиб(ДИТ), Беляев СЮ, BUG 93345 / TA 96388, 25-11-2024, конец
					УстановитьПривилегированныйРежим(Истина);
					РегистрыСведений.стоки_ТекущиеДанные.ДобавитьЗапись(Стр.НомерКТК, СоотвЗаполнения, Дата,, Не ДополнительныеСвойства.Свойство("ОтключитьВыводСообщений"), ТипЗнч(Ссылка));
					УстановитьПривилегированныйРежим(Ложь);
				КонецЕсли;
				//Евросиб Коханенко Н.А. #63323 02.02.2023 )) 

				//Евросиб Каблов 10.11.2022 )
				
					
				
				//ДИТ, Беляев СЮ, Ticket#0287139, 28-09-2022, заккоментирован блок ниже - заполнение "СоотвЗаполнения", запись в регистр стоки_КлиентскоеОперирование в рабочей базе давно закомментирована
				//СоотвЗаполнения = Новый Соответствие;
				//
				//Запрос = Новый Запрос;
				//Запрос.Текст = "ВЫБРАТЬ
				//               |	стоки_КлиентскоеОперированиеСрезПоследних.ПорядковыйНомерЦиклаАрендыКТК КАК ПорядковыйНомерЦиклаАрендыКТК
				//               |ИЗ
				//               |	РегистрСведений.стоки_КлиентскоеОперирование.СрезПоследних(&Период, КТК = &КТК) КАК стоки_КлиентскоеОперированиеСрезПоследних";
				//Запрос.УстановитьПараметр("Период", Дата-1);
				//Запрос.УстановитьПараметр("КТК", Стр.НомерКТК);
				//Ответ = Запрос.Выполнить().Выбрать();
				//Если Ответ.Следующий() Тогда
				//	
				//	СоотвЗаполнения.Вставить("ПорядковыйНомерЦиклаАрендыКТК", Ответ.ПорядковыйНомерЦиклаАрендыКТК+1);
				//	
				//КонецЕсли;
				//
				//Если НаборКолонокИзЗаявки.Найти("ДатаВыдачи") <> неопределено И ЗначениеЗаполнено(Стр.ДатаВыдачи) Тогда
				//	СоотвЗаполнения.Вставить("кл_ДатаВыдачи", Стр.ДатаВыдачи);
				//КонецЕсли;
				//
				//Если НаборКолонокИзЗаявки.Найти("НормативноеИспользование") <> неопределено И ЗначениеЗаполнено(Стр.НормативноеИспользование) Тогда
				//	СоотвЗаполнения.Вставить("кл_СрокПользования", Стр.НормативноеИспользование);
				//КонецЕсли;
				//Если ЗначениеЗаполнено(Контрагент) Тогда
				//	СоотвЗаполнения.Вставить("кл_Клиент", Контрагент);
				//КонецЕсли;
				//Если ЗначениеЗаполнено(Договор) Тогда
				//	СоотвЗаполнения.Вставить("кл_Договор", Договор);
				//КонецЕсли;
				//Если ЗначениеЗаполнено(Стр.ПСЦ) Тогда
				//	СоотвЗаполнения.Вставить("кл_ПСЦ", Стр.ПСЦ);
				//КонецЕсли;
				//Если НаборКолонокИзЗаявки.Найти("НомерАвто") <> неопределено И ЗначениеЗаполнено(Стр.НомерАвто) Тогда
				//	СоотвЗаполнения.Вставить("кл_НомерТСЗабор", Стр.НомерАвто);
				//КонецЕсли;
				//Если НаборКолонокИзЗаявки.Найти("ФИОВодителя") <> неопределено И ЗначениеЗаполнено(Стр.ФИОВодителя) Тогда
				//	СоотвЗаполнения.Вставить("кл_ВодительЗабор", Стр.ФИОВодителя);
				//КонецЕсли;
				//Если НаборКолонокИзЗаявки.Найти("НомерАвтоВыгрузка") <> неопределено И ЗначениеЗаполнено(Стр.НомерАвтоВыгрузка) Тогда
				//	СоотвЗаполнения.Вставить("кл_НомерТССдача", Стр.НомерАвтоВыгрузка);
				//КонецЕсли;
				//Если НаборКолонокИзЗаявки.Найти("ФИОВодителяВыгрузка") <> неопределено И ЗначениеЗаполнено(Стр.ФИОВодителяВыгрузка) Тогда
				//	СоотвЗаполнения.Вставить("кл_ВодительСдача", Стр.ФИОВодителяВыгрузка);
				//КонецЕсли;
				//// SIV 22-06-21 ЧТЗ "Циклы аренды КТК" -->
				////Если НаборКолонокИзЗаявки.Найти("ДатаВозвратаКлиентом") <> неопределено И ЗначениеЗаполнено(Стр.ДатаВозвратаКлиентом) Тогда
				////	СоотвЗаполнения.Вставить("кл_ДатаВозврата", Стр.ДатаВозвратаКлиентом);
				////КонецЕсли;
				//// SIV 22-06-21 ЧТЗ "Циклы аренды КТК" <--
				//
				//СрезКлДанныхПоКТК = РегистрыСведений.стоки_КлиентскоеОперирование.ПолучитьСрезПоследнихПоКТК(Стр.НомерКТК);
				//
				//Если ЗначениеЗаполнено(Стр.ДатаВозвратаКлиентом) И АРМ_Сервер.ПоКТКЕстьУказаннаяДатаВозвратаКлиентом(Стр.НомерКТК, Стр.ДатаВозвратаКлиентом)  = Ложь И ЗначениеЗаполнено(СрезКлДанныхПоКТК.кл_ДатаВозврата) Тогда
				//	Сообщить("По КТК " + Стр.НомерКТК + " дата возврата клиентом " + Формат(Стр.ДатаВозвратаКлиентом, "ДФ=dd.MM.yy") + " не совпадает с ранее указанной датой. Необходимо уточнить верную дату и заполнить в карточке контейнера.", СтатусСообщения.ОченьВажное);
				//ИначеЕсли ЗначениеЗаполнено(Стр.ДатаВозвратаКлиентом) И (НЕ ЗначениеЗаполнено(СрезКлДанныхПоКТК.кл_ДатаВозврата) ИЛИ Стр.ДатаВозвратаКлиентом = СрезКлДанныхПоКТК.кл_ДатаВозврата) Тогда 
				//	СоотвЗаполнения.Вставить("кл_ДатаВозврата", Стр.ДатаВозвратаКлиентом);
				//КонецЕсли;
				//
				//Если НаборКолонокИзЗаявки.Найти("ЗаявкаНаВыдачу") <> неопределено И ЗначениеЗаполнено(Стр.ЗаявкаНаВыдачу) Тогда
				//	СоотвЗаполнения.Вставить("кл_ЗаявкаНаВыдачу", Стр.ЗаявкаНаВыдачу);
				//КонецЕсли;
				
				//РегистрыСведений.стоки_КлиентскоеОперирование.ДобавитьЗапись(Стр.НомерКТК, СоотвЗаполнения, Дата);
				
				Если ЗначениеЗаполнено(Стр.Релиз) И МассивУникальныхРелизов.Найти(Стр.Релиз) = неопределено Тогда
					МассивУникальныхРелизов.Добавить(Стр.Релиз);
				КонецЕсли;
				
			// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
			//Было:
			//ИначеЕсли ЗначениеЗаполнено(Стр.ВидСобственности) И Стр.ВидСобственности = Перечисления.ВариантыСобственности.Прочее Тогда
			//Стало:
			ИначеЕсли ЗначениеЗаполнено(Стр.ВидСобственности)
			   И Стр.ВидСобственности = Перечисления.ВариантыСобственности.Клиентский Тогда
			// ДИТ 65580 Давудов М.А. Конец: 23.02.2023
				
				СоотвЗаполнения = Новый Соответствие;
				
				СоотвЗаполнения.Вставить("тек_ВидСобственности", Стр.ВидСобственности);
						
				//ДИТ Шевченко А.В. 60130 21.11.22 -начало
				//Евросиб Каблов 16.08.2022 ( US41519
				Если Стр.КлиентскийКТК Тогда
					СоотвЗаполнения.Вставить("КлиентскийКТКизЗаявки", Истина);
					СоотвЗаполнения.Вставить("тек_Договор", Договор);
				КонецЕсли;
				Если Стр.ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТКлиента Тогда
					СоотвЗаполнения.Вставить("КлиентскийКТКизЗаявки", Истина);
					СоотвЗаполнения.Вставить("тек_Собственник", Стр.ВладелецКТК);
				КонецЕсли;
				//Если ТекущаяДата() > (Отправка-86400) Тогда	
				Если ЗначениеЗаполнено(Отправка) Тогда	
					СоотвЗаполнения.Вставить("тек_НаСлежении", Истина);
					Если ЗначениеЗаполнено(Стр.НомерКТК) Тогда
						Запись = РегистрыСведений.КонтейнерыНаСлежении.СоздатьМенеджерЗаписи();
						Запись.Контейнер = Стр.НомерКТК;
						ЧасовВСутках = 86400;
						Запись.Период = НачалоДня(Отправка-ЧасовВСутках);
						Запись.НаСлежении = Истина;
						Запись.Записать();
					КонецЕсли;
				КонецЕсли;	
				//Евросиб Каблов 16.08.2022 )
				//ДИТ Шевченко А.В. 60130 21.11.22 -конец
				
				Если НаборКолонокИзЗаявки.Найти("ВладелецКТК") <> неопределено И ЗначениеЗаполнено(Стр.ВладелецКТК) Тогда
					СоотвЗаполнения.Вставить("тек_Собственник", Стр.ВладелецКТК);
				КонецЕсли;
				
				СоотвЗаполнения.Вставить("тек_Сток", Справочники.Локации.ПустаяСсылка());
				СоотвЗаполнения.Вставить("тек_Статус", Перечисления.СтатусыКТК.ВДвижении);
				СоотвЗаполнения.Вставить("ИсточникЗаписи", "Заявка " + Номер);
				
				Если НаборКолонокИзЗаявки.Найти("СтокСдачиПорожнего") <> неопределено И ЗначениеЗаполнено(Стр.СтокСдачиПорожнего) Тогда
					СоотвЗаполнения.Вставить("тек_СтокСдачи", Стр.СтокСдачиПорожнего);
				КонецЕсли;
				// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 03.02.2023
				// Было:
				//Если НаборКолонокИзЗаявки.Найти("ИнструкцииПоСдачеПорожнего") <> неопределено И ЗначениеЗаполнено(Стр.ИнструкцииПоСдачеПорожнего) Тогда
				//	СоотвЗаполнения.Вставить("тек_ИнструкцияПоСдаче", Стр.ИнструкцииПоСдачеПорожнего);
				//КонецЕсли; 
				//Стало:
				
				ИнструкцииПоСдачеПорожнего = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.КлючАналитикиПеревозки,"ИнструкцияПоСдаче");
				Если НаборКолонокИзЗаявки.Найти("ИнструкцииПоСдачеПорожнего") <> неопределено И ЗначениеЗаполнено(ИнструкцииПоСдачеПорожнего) Тогда
					СоотвЗаполнения.Вставить("тек_ИнструкцияПоСдаче", ИнструкцииПоСдачеПорожнего);
				КонецЕсли;
				// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 03.02.2023
					
				//Евросиб Каблов 10.11.2022 ( 52045
				//РегистрыСведений.стоки_ТекущиеДанные.ДобавитьЗапись(Стр.НомерКТК, СоотвЗаполнения, Дата);

				//Евросиб Коханенко Н.А. #63323 02.02.2023 (( 
				//РегистрыСведений.стоки_ТекущиеДанные.ДобавитьЗапись(Стр.НомерКТК, СоотвЗаполнения, Дата,, Не ДополнительныеСвойства.Свойство("ОтключитьВыводСообщений"));
				//Евросиб(ДИТ), Беляев СЮ, BUG 93345 / TA 96388, 25-11-2024, начало
				Если МассивКонтейнеровБезЗаписиВТекущиеДанные.Найти(Стр.НомерКТК) = Неопределено Тогда
				//Евросиб(ДИТ), Беляев СЮ, BUG 93345 / TA 96388, 25-11-2024, конец
					УстановитьПривилегированныйРежим(Истина);
					РегистрыСведений.стоки_ТекущиеДанные.ДобавитьЗапись(Стр.НомерКТК, СоотвЗаполнения, Дата,, Не ДополнительныеСвойства.Свойство("ОтключитьВыводСообщений"), ТипЗнч(Ссылка));
					УстановитьПривилегированныйРежим(Ложь);
				КонецЕсли;
				//Евросиб Коханенко Н.А. #63323 02.02.2023 )) 
				
				//Евросиб Каблов 10.11.2022 )
				
		КонецЕсли;
		//ДИТ, Беляев СЮ, BUG 72360, 24-07-2023, начало
		Если ТипЗнч(Стр.Релиз) = Тип("ДокументСсылка.РелизКлиента") Тогда
			МассивРелизовКлиента.Добавить(Стр.Релиз);
		КонецЕсли;
		//ДИТ, Беляев СЮ, BUG 72360, 24-07-2023, конец
	КонецЦикла;
	
	// SIV 28-12-2020 обновляем данные с релизами
	
	//ДИТ, Беляев СЮ, BUG 72360, 24-07-2023, начало
	ОбработатьРелизыКлиента( МассивРелизовКлиента );
	//ДИТ, Беляев СЮ, BUG 72360, 24-07-2023, конец
	
	// установка флага записи движений в конце транзакции. Если данный флаг не установить, то движения НЕ будут записаны.
	Движения.КонтейнерыВСтоках.Записывать = Истина;
	
	Движения.СтатусыКТК.Записывать = Истина;
	
	ДвиженияПоБН = Ложь;
	// нужно выбрать все б/н ктк по типам, стоку и направлению
	
	//Если НЕ ИспользоватьАРМКТК Тогда
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ТабКонтейнеров.НомерКТК КАК НомерКТК,
	//               |	ТабКонтейнеров.ДатаВзятия КАК ДатаВзятия,
	//               |	ТабКонтейнеров.ВладелецКТК КАК ВладелецКТК,
	//               |	1 КАК КоличествоКонтейнеров,
	//               |	ТабКонтейнеров.ТипКТК КАК ТипКТК,
	//               |	ТабКонтейнеров.ПунктНазначения КАК ПунктНазначения,
	//               |	ТабКонтейнеров.ПунктОтправления КАК ПунктОтправления,
	//               |	ТабКонтейнеров.ДатаПостановкиВРезерв КАК ДатаПостановкиВРезерв
	//               |ПОМЕСТИТЬ ТабКонтейнеров
	//               |ИЗ
	//               |	&ТабКонтейнеров КАК ТабКонтейнеров
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ТабКонтейнеров.НомерКТК КАК НомерКТК,
	//               |	ТабКонтейнеров.ВладелецКТК КАК ВладелецКТК,
	//               |	ТабКонтейнеров.ДатаВзятия КАК ДатаВзятия,
	//               |	СУММА(ТабКонтейнеров.КоличествоКонтейнеров) КАК КоличествоКонтейнеров,
	//               |	ТабКонтейнеров.ТипКТК КАК ТипКТК,
	//               |	ТабКонтейнеров.ПунктНазначения КАК ПунктНазначения,
	//               |	ТабКонтейнеров.ПунктОтправления КАК ПунктОтправления,
	//               |	ТабКонтейнеров.ДатаПостановкиВРезерв КАК ДатаПостановкиВРезерв
	//               |ИЗ
	//               |	ТабКонтейнеров КАК ТабКонтейнеров
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	ТабКонтейнеров.НомерКТК,
	//               |	ТабКонтейнеров.ДатаВзятия,
	//               |	ТабКонтейнеров.ТипКТК,
	//               |	ТабКонтейнеров.ПунктНазначения,
	//               |	ТабКонтейнеров.ПунктОтправления,
	//               |	ТабКонтейнеров.ВладелецКТК,
	//               |	ТабКонтейнеров.ДатаПостановкиВРезерв";
	//// выгрузить нужно только те строки, в которых не заполнен номер КТК и план = истина
	//ПараметрыОтбора = Новый Структура;
	//ПараметрыОтбора.Вставить("НомерКТК",Справочники.ТЕ.ПустаяСсылка());
	//ПараметрыОтбора.Вставить("План",Истина);
	//НайденныеСтроки = СоставУслуги.НайтиСтроки(ПараметрыОтбора);
	//Запрос.УстановитьПараметр("ТабКонтейнеров",СоставУслуги.Выгрузить(НайденныеСтроки));
	//ТЗ = Запрос.Выполнить().Выгрузить();

	//МасОшибокПериодов = Новый Массив;
	//
	////Для Каждого Стр Из СоставУслуги Цикл
	////	// делать движения только если сток номерной
	////	Если ЗначениеЗаполнено(Стр.НомерКТК) И Стр.План Тогда
	////		
	////		// если заполнена дата взятия, то добавить движение со статусом "В движении"
	////		Если ЗначениеЗаполнено(Стр.ДатаВзятия) Тогда
	////			Движение = Движения.СтатусыКТК.Добавить();
	////			Движение.Период 	= Стр.ДатаВзятия;
	////			Если ЗначениеЗаполнено(Стр.НомерКТК) Тогда
	////				Движение.Контейнер = Стр.НомерКТК;
	////			Иначе
	////				Движение.Контейнер = Стр.ТипКТК;
	////			КонецЕсли;
	////			Движение.Количество = 1;
	////			Движение.Сток 		= Стр.СтокВыдачи;
	////			Движение.Направление= Стр.ПунктНазначения;
	////			Движение.Контрагент = Стр.ВладелецКТК;
	////			Движение.Статус 	= Перечисления.СтатусыКТК.ВДвижении;
	////			
	////			Если Стр.ДатаВзятия = Дата(1,1,1) Тогда
	////				МасОшибокПериодов.Добавить("Ошибка в строке " + Стр.НомерСтроки + ". Не заполнена ""Дата взятия из стока"". Запись невозможна!");
	////			КонецЕсли; 
	////			
	////			// если заполнена дата взятия, то нужно отменить движения по РС СрокиИспользованияКонтейнеров для данного акта
	////			//Запрос = новый Запрос;
	////			//Запрос.Текст = "ВЫБРАТЬ
	////			//               |	СрокиИспользованияКонтейнеров.Период КАК Период,
	////			//               |	СрокиИспользованияКонтейнеров.Контейнер КАК Контейнер,
	////			//               |	СрокиИспользованияКонтейнеров.ПолучениеКонтейнера КАК ПолучениеКонтейнера,
	////			//               |	СрокиИспользованияКонтейнеров.НормативВозвратаВСток КАК НормативВозвратаВСток,
	////			//               |	СрокиИспользованияКонтейнеров.ВыдачаКлиенту КАК ВыдачаКлиенту,
	////			//               |	СрокиИспользованияКонтейнеров.НормативВозвратаОтКлиента КАК НормативВозвратаОтКлиента,
	////			//               |	СрокиИспользованияКонтейнеров.ВозвратОтКлиента КАК ВозвратОтКлиента,
	////			//               |	СрокиИспользованияКонтейнеров.ВозвратВСток КАК ВозвратВСток,
	////			//               |	СрокиИспользованияКонтейнеров.Клиент КАК Клиент,
	////			//               |	СрокиИспользованияКонтейнеров.Договор КАК Договор,
	////			//               |	СрокиИспользованияКонтейнеров.АктПолученияКТК КАК АктПолученияКТК
	////			//               |ИЗ
	////			//               |	РегистрСведений.СрокиИспользованияКонтейнеров КАК СрокиИспользованияКонтейнеров
	////			//               |ГДЕ
	////			//               |	СрокиИспользованияКонтейнеров.АктПолученияКТК = &Ссылка
	////			//               |	И СрокиИспользованияКонтейнеров.Контейнер = &Контейнер";
	////			//Запрос.УстановитьПараметр("Ссылка", ТекАкт.Ссылка);
	////			//Запрос.УстановитьПараметр("Контейнер", Стр.НомерКТК);
	////			//Ответ = Запрос.Выполнить().Выбрать();
	////			//Пока Ответ.Следующий() Цикл
	////			//	МЗ = РегистрыСведений.СрокиИспользованияКонтейнеров.СоздатьМенеджерЗаписи();
	////			//	ЗаполнитьЗначенияСвойств(МЗ, Ответ);
	////			//	МЗ.Удалить();
	////			//КонецЦикла;
	////			// записать данные в РС
	////			//СоответствиеПараметры = Новый Соответствие;
	////			//СоответствиеПараметры.Вставить("ВыдачаКлиенту", Стр.ДатаВыдачи);
	////			////СоответствиеПараметры.Вставить("ПолучениеКонтейнера", Стр.ДатаПриемаВПользованиеПередПоставщиком);
	////			//СоответствиеПараметры.Вставить("НормативВозвратаОтКлиента", Стр.НормативноеИспользование);
	////			//СоответствиеПараметры.Вставить("НормативВозвратаВСток", стр.НормативноеИспользованиеИзСтока);
	////			//СоответствиеПараметры.Вставить("ДокументВыдачи", Ссылка);
	////			//СоответствиеПараметры.Вставить("СтокВыдачи", Стр.ПунктОтправления);
	////			//СоответствиеПараметры.Вставить("НаправлениеСдачи", Стр.СтанцияНазначения);
	////			//СоответствиеПараметры.Вставить("ИнструкцииПоСдачеПорожнего", Стр.ИнструкцииПоСдачеПорожнего);
	////			//СоответствиеПараметры.Вставить("Клиент", Контрагент);    
	////			//СоответствиеПараметры.Вставить("Договор", Договор);
	////			//СоответствиеПараметры.Вставить("АктПолученияКТК", ТекАкт.Ссылка);
	////			//УправлениеКТКВСтокахСервер.ДобавитьЗаписьИспользованияКонтейнера(Дата, Стр.НомерКТК, СоответствиеПараметры, Ложь);
	////		КонецЕсли;
	////		// любая запись номерного КТК в заявке это перевод его в статус "Зарезервирован"
	////		Движение = Движения.СтатусыКТК.Добавить();
	////		Движение.Период 	= Стр.ДатаПостановкиВРезерв;
	////		Если ЗначениеЗаполнено(Стр.НомерКТК) Тогда
	////			Движение.Контейнер = Стр.НомерКТК;
	////		Иначе
	////			Движение.Контейнер = Стр.ТипКТК;
	////		КонецЕсли;
	////		Движение.Количество = 1;
	////		Движение.Сток		= Стр.СтокВыдачи;
	////		Движение.Направление= Стр.ПунктНазначения;
	////		Движение.Контрагент = Стр.ВладелецКТК;
	////		Движение.Статус 	= Перечисления.СтатусыКТК.Зарезервирован;
	////		
	////		Если Стр.ДатаПостановкиВРезерв = Дата(1,1,1) Тогда
	////			МасОшибокПериодов.Добавить("Ошибка в строке " + Стр.НомерСтроки + ". Не заполнена ""Дата постановки в резерв"". Запись невозможна!");
	////		КонецЕсли; 
	////		
	////	КонецЕсли;
	////КонецЦикла;
	//// если сток б/н, то сделать движения согласно результату запроса
	//БНОшибка = Ложь;
	//Для Каждого СтрТЗ Из ТЗ Цикл
	//	Движение = Движения.СтатусыКТК.Добавить();
	//	Движение.Период 	= СтрТЗ.ДатаПостановкиВРезерв;
	//	Движение.Контейнер 	= СтрТЗ.ТипКТК;
	//	Движение.Количество = СтрТЗ.КоличествоКонтейнеров;
	//	Движение.Сток 		= СтрТЗ.ПунктОтправления;
	//	Движение.Направление= СтрТЗ.ПунктНазначения;
	//	Движение.Контрагент = СтрТЗ.ВладелецКТК;
	//	Если ЗначениеЗаполнено(СтрТЗ.ДатаВзятия) Тогда
	//		Движение.Статус = Перечисления.СтатусыКТК.ВДвижении;
	//	Иначе
	//		Движение.Статус = Перечисления.СтатусыКТК.Зарезервирован;
	//	КонецЕсли;
	//	ДвиженияПоБН = Истина;
	//	
	//	Если Стр.ДатаПостановкиВРезерв = Дата(1,1,1) И БНОшибка = Ложь Тогда
	//		МасОшибокПериодов.Добавить("Ошибка при записи безномерных контейнеров. Не заполнена ""Дата постановки в резерв"". Запись невозможна!");
	//		БНОшибка = Истина;
	//	КонецЕсли; 
	//	
	//КонецЦикла;
	//
	//Если МасОшибокПериодов.Количество() > 0 Тогда
	//	
	//	ОбСообщ = "";
	//	
	//	Для каждого СтрОпОш Из МасОшибокПериодов Цикл
	//		ОбСообщ = ОбСообщ + ?(ОбСообщ="", "", Символы.ПС) + СтрОпОш; 
	//	КонецЦикла; 
	//	
	//	ВызватьИсключение ОбСообщ;
	//	
	//КонецЕсли; 
	//
	//КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////////
	////////////////////////////////*********************** *************************///////////////////////////
	////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	// установка задач пользователям
	// для каждой калькуляции проверяем наличие ТСх
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТехнологическаяСхема.ТСх КАК ТСх,
	               |	ЗаявкаСоставУслуги.Калькуляция КАК Калькуляция
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТехнологическаяСхема КАК ТехнологическаяСхема
	               |		ПО ЗаявкаСоставУслуги.Калькуляция = ТехнологическаяСхема.ПредметТСх.Ссылка
	               |ГДЕ
	               |	ЗаявкаСоставУслуги.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТехнологическаяСхемаТЧ.Операция КАК Операция,
	               |	ТехнологическаяСхемаТЧ.Ссылка КАК Ссылка,
	               |	ТехнологическаяСхемаТЧ.Операция.Услуга КАК ОперацияУслуга,
	               |	ВТ.Калькуляция КАК Калькуляция
	               |ПОМЕСТИТЬ ВТ2
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
	               |		ПО ВТ.ТСх = ТехнологическаяСхемаТЧ.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ2.Операция КАК Операция,
	               |	ВТ2.Ссылка КАК ТСх,
	               |	ВТ2.Калькуляция КАК Калькуляция
	               |ИЗ
	               |	ВТ2 КАК ВТ2
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыОпераций.ПостановкаЗадач КАК ВидыОперацийПостановкаЗадач
	               |		ПО ВТ2.ОперацияУслуга = ВидыОперацийПостановкаЗадач.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	// создадим массив калькуляций данной заявки для проверки их на условия
	ТЗ_калькуляций = ТЗ.Скопировать(,"Калькуляция");
	ТЗ_калькуляций.Свернуть("Калькуляция");
	МассивКалькуляций = ТЗ_калькуляций.ВыгрузитьКолонку("Калькуляция");
	
	// для каждой операции ТСх делаем запрос по задачам
	
	МассивМоментовВремени = Новый Массив;
	МассивМоментовВремени.Добавить(Перечисления.ТипМоментаВремени.ПриРегистрацииКлиентскойЗаявки);
	
	Для Каждого Стр Из ТЗ Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВидыОперацийПостановкаЗадач.ТипОбъектаСистемы КАК ТипОбъектаСистемы,
			|	ВидыОперацийПостановкаЗадач.ЖелтыйПорог КАК ЖелтыйПорог,
			|	ВидыОперацийПостановкаЗадач.КрасныйПорог КАК КрасныйПорог,
			|	ВидыОперацийПостановкаЗадач.МоментВремени КАК МоментВремени,
			|	ВидыОперацийПостановкаЗадач.НаименованиеЗадачиСпециалисту КАК НаименованиеЗадачиСпециалисту,
			|	ВидыОперацийДополнительныеУсловия.ДопУсловиеНаименование КАК ДопУсловиеНаименование,
			|	ВидыОперацийДополнительныеУсловия.ДопУсловиеНаименование.ТипДополнительногоУсловия КАК ТипДополнительногоУсловия,
			|	ВидыОперацийПостановкаЗадач.ГУИД КАК ГУИД,
			|	ВидыОперацийПостановкаЗадач.ВидОперации КАК ВидОперации,
			|	ВидыОперацийПостановкаЗадач.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ВидыОперацийПостановкаЗадач.УчитыватьДляВсейОперации КАК УчитыватьДляВсейОперации
			|ИЗ
			|	Справочник.ВидыОпераций.ПостановкаЗадач КАК ВидыОперацийПостановкаЗадач
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыОпераций.ДополнительныеУсловия КАК ВидыОперацийДополнительныеУсловия
			|		ПО ВидыОперацийПостановкаЗадач.ГУИД = ВидыОперацийДополнительныеУсловия.ГУИДТребуемыеДокументы
			|ГДЕ
			|	ВидыОперацийПостановкаЗадач.Ссылка = &Ссылка
			|	И ВидыОперацийПостановкаЗадач.МоментВремени В(&МоментВремени)
			|	И ВидыОперацийПостановкаЗадач.ТипОбъектаСистемы = ЗНАЧЕНИЕ(Перечисление.ОбъектСистемыДляЗадач.Заявка)
			|ИТОГИ ПО
			|	ТипДополнительногоУсловия,ГУИД";
		
		Запрос.УстановитьПараметр("МоментВремени", МассивМоментовВремени);
		Запрос.УстановитьПараметр("Ссылка", Стр.Операция.Услуга);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ВыборкаУчитыватьДляВсейОперации = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаУчитыватьДляВсейОперации.Следующий() Цикл
				ВыборкаГУИД = ВыборкаУчитыватьДляВсейОперации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
				РаботаСМаршрутизациейДокументов.РазборДополнительныхУсловий(ВыборкаГУИД,Стр.Операция,МассивМоментовВремени,"ПостановкаЗадач",Ссылка.Дата,Ссылка,МассивКалькуляций,Неопределено);
			КонецЦикла;		
		КонецЕсли;
		
	КонецЦикла;
	
	// Евросиб Фролов (28.02.2022 Task №46354
	ДвиженияПодсветкаФормДокументов(Отказ, РежимПроведения);
	// Евросиб Фролов)   
	
	//ДИТ Авдеева В.С. 53975 16.08.2022 Начало 
	ОчиститьЗаписиУдаленныхСтрок();
	//ДИТ Авдеева В.С. 53975 16.08.2022 Конец	
	
КонецПроцедуры 

Процедура СформироватьДвиженияДатыПодачАвтоПодВыгрузку() Экспорт
	
	Движения.ДатыПодачАвтоПодВыгрузку.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкаСоставУслуги.ДатаПодачиАвтоПодВыгрузку КАК Дата,
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ИдентификаторСвязьУчетныхЕдиниц,
	|	ЗаявкаСоставУслуги.ГУИДСтроки КАК ИдентификаторСтрокиЗаявки,
	//Евросиб - АСуслов 01.03.2023 17:04:51 #65754
	//(
	|	ЗаявкаСоставУслуги.СтанцияНазначения КАК СтанцияНазначения
	//)
	//Евросиб - АСуслов 01.03.2023 17:04:52 #65754
	|ИЗ
	|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|		ПО ЗаявкаСоставУслуги.ГУИДСтроки = СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки
	|			И ЗаявкаСоставУслуги.Ссылка = СделкаСвязьУчетныхЕдиниц.Заявка
	|ГДЕ
	|	ЗаявкаСоставУслуги.Ссылка = &Ссылка
	|	И ЗаявкаСоставУслуги.ДатаПодачиАвтоПодВыгрузку > ДАТАВРЕМЯ(1, 1, 1)
	|	И НЕ ЗаявкаСоставУслуги.ГУИДСтроки = """"";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;  
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		//Евросиб - АСуслов 19.01.2023 18:38:33 #63097
		//( 
		//Евросиб - АСуслов 01.03.2023 17:05:08 #65754
		//(
		КлючиАналитикиСоставаПоездаСервер.ЗаполнитьДатыОтправленияПрибытияВКлючахАналитики_ДатаПодачиАвтоПодВыгрузку(Выборка.ИдентификаторСвязьУчетныхЕдиниц, Выборка.Дата, Выборка.СтанцияНазначения);
		//)
		//Евросиб - АСуслов 01.03.2023 17:05:10 #65754
		//)
		//Евросиб - АСуслов 19.01.2023 18:38:46 #63097
		Движение = Движения.ДатыПодачАвтоПодВыгрузку.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
	КонецЦикла; 
	Попытка
		Движения.ДатыПодачАвтоПодВыгрузку.Записать();
	Исключение
	КонецПопытки;
		
КонецПроцедуры

Функция ПолучитьДанныеРелиза(СоответствиеПрисвоенныхРелизов, РелизСсылка)
	
	//ДИТ Шевченко А.В. 55131 16.08.2022 -начало
	Если ТипЗнч(РелизСсылка) = Тип("ДокументСсылка.РелизКлиента") Тогда
		Возврат Новый Соответствие;
	КонецЕсли;	
	//ДИТ Шевченко А.В. 55131 16.08.2022 -конец
	
	РелизОбъект = РелизСсылка.ПолучитьОбъект();
	
	РезПрисвоения = РелизОбъект.ВписатьКТКВРелиз(СоответствиеПрисвоенныхРелизов);
	Если РезПрисвоения.Количество() > 0 Тогда
		//++ Зубов Ticket#0249431 09.11.2021
		Если РелизОбъект.Дата >= Дата("20211107") Тогда
			РелизОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		//-- Зубов Ticket#0249431 09.11.2021
	КонецЕсли;
	
	Возврат РезПрисвоения;
	
КонецФункции

Процедура ПриЗаписи(Отказ)
	
//Евросиб Гудкова( 31.03.2021 Ticket№ 0227986 
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
// Евросиб Гудкова) 	
	// блок отработки родительского документа
	МассивСостояний = МаршрутизацияСервер.НайтиПолучитьМассивСостоянийДляОтметки(Состояния);
	МассивРодительскихДокументов = Новый Массив;
	Если ЗначениеЗаполнено(ПСЦ) Тогда
		МассивРодительскихДокументов.Добавить(ПСЦ);
	КонецЕсли;
	МаршрутизацияСервер.ОтметитьВыполнениеРодительскогоДокументаАвтоматически(МассивРодительскихДокументов, МассивСостояний, Отказ);
	
	Отправки_сервер.УдалитьДвиженияРегистраПродажиРейсов(Ссылка);
	
	Для каждого Стр из ПереченьРейсов Цикл
		Если ТипЗнч(Стр.Рейс) = Тип("СправочникСсылка.РейсыЖД") Тогда
			
			МЗ = РегистрыСведений.ПродажиРейсов.СоздатьМенеджерЗаписи();
			МЗ.ОбъектРегистратор = Ссылка;
			МЗ.Рейс = Стр.Рейс;
			МЗ.ПроданоТЕУ = КоличествоКТК20+КоличествоКТК40*2;
			МЗ.Записать(Истина);
			
		КонецЕсли;
	КонецЦикла;
	
	ЛичныеЦелиСервер.ДобавитьЗаписиЛичныхЦелей(Ссылка);
	
	// SIV 20-09-15 BUGFIX Пропишем типоразмер в КТК, если он не заполнен
	Для каждого Стр из СоставУслуги Цикл
		Если ЗначениеЗаполнено(Стр.НомерКТК) И ЗначениеЗаполнено(Стр.ТипКТК) И НЕ ЗначениеЗаполнено(Стр.НомерКТК.ТипТЕ) Тогда
			
			КОбъект = СТр.НомерКТК.ПолучитьОбъект();
			КОбъект.ТипТЕ = Стр.ТипКТК;
			КОбъект.Записать();
			
		КонецЕсли;
	КонецЦикла;
	
	// Евросиб Фролов (08.10.2021 Task №39041
	Если Не Отказ Тогда
		МассивКонтейнеров = СоставУслуги.ВыгрузитьКолонку("НомерКТК");
		РаботаСКонтейнерамиСервер.ДобавитьИнформациюОбИсточникеСозднияКонтейнеров(МассивКонтейнеров, Ссылка);
	КонецЕсли;	
	// Евросиб Фролов) 
	СформироватьДвиженияДатыПодачАвтоПодВыгрузку();

	// ++ Евросиб Дудоров С.В. US 57543 30.01.2023 
	// для основания реф.сцеп при изменении данных в заявке меняем Реф.сцепе
	Если ИзменятьРефСцепПоЗаявке Тогда
		РефСцепСервер.ИзменениеРефСцепаПоЗаявке(Ссылка 
				, ДокументОснование
				, Контрагент
				);
	КонецЕсли;			
	// -- Евросиб Дудоров С.В. US 57543 30.01.2023   
	
	// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Начало: 22.01.2024
	// Было:
	//// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 13.02.2023  //
	//Если НЕ ДополнительныеСвойства.Свойство("ЭтоЗакрытиеЗадач") Тогда//ДИТ Шевченко А.В. BUG 75898 TA 75908 10.10.2023   
	//	Для Каждого Стр Из СоставУслуги Цикл 
	//		Если Не ЗначениеЗаполнено(Стр.ПеренесенВЗаявку) Тогда 
	//			СтруктураКлючаАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
	//			СтруктураКлючаАналитикиПеревозки.Заявка = Ссылка;
	//			СтруктураКлючаАналитикиПеревозки.Контейнер = Стр.НомерКТК;
	//			СтруктураКлючаАналитикиПеревозки.КлючАналитики = Стр.КлючАналитикиПеревозки;  
	//			// ДИТ US 76935 ТА 76938 Сержантова А.С. Начало: 01.11.2023
	//			СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПерваяМиляКлючаАналитики.ДатаВыдачиКТКСТерминала = Стр.ДатаВыдачи;
	//			СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПоследняяМиляКлючаАналитики.ДатаСдачиКТКНаТерминал = Стр.ДатаВозвратаКлиентом;
	//			// ДИТ US 76935 ТА 76938 Сержантова А.С. Конец: 01.11.2023
	//			КлючАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлючаАналитикиПеревозки);
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	//// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 13.02.2023 
	// Стало:  
	//Здесь записываем ссылку заявки в ключи аналитики
	#Область ЗаписьДанныхКлючейАналитикиПеревозки
	Если ДополнительныеСвойства.Свойство("ДанныеДляОбновленияКлючейАналитики") Тогда  
		Для Каждого Стр Из СоставУслуги Цикл 
			СтруктураКлючаАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
			СтруктураКлючаАналитикиПеревозки.Заявка = Ссылка;
			СтруктураКлючаАналитикиПеревозки.КлючАналитики = Стр.КлючАналитикиПеревозки;  
			КлючАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлючаАналитикиПеревозки);
		КонецЦикла;
	ИначеЕсли не ДополнительныеСвойства.Свойство("ЭтоЗакрытиеЗадач") Тогда
		Для Каждого Стр Из СоставУслуги Цикл 
			Если Не ЗначениеЗаполнено(Стр.ПеренесенВЗаявку) Тогда 
				СтруктураКлючаАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
				СтруктураКлючаАналитикиПеревозки.Заявка = Ссылка;
				СтруктураКлючаАналитикиПеревозки.Контейнер = Стр.НомерКТК;
				СтруктураКлючаАналитикиПеревозки.КлючАналитики = Стр.КлючАналитикиПеревозки;  
				//Евросиб Коханенко Н.А. 16.07.2024 (( #83866
				//СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПерваяМиляКлючаАналитики.ДатаВыдачиКТКСТерминала = Стр.ДатаВыдачи;
				//СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПоследняяМиляКлючаАналитики.ДатаСдачиКТКНаТерминал = Стр.ДатаВозвратаКлиентом; 
				//обновляем даты в ключе значениями из Заявки только, если в ключе пусто и значения заполнены
				Если ЗначениеЗаполнено(Стр.ДатаВыдачи) Тогда 
					ПерваяМиляКлючаАналитики = Справочники.КлючиАналитикиПеревозки.КлючиАналитикиЗначенияПолейПоЭтапуПеревозки(Стр.КлючАналитикиПеревозки, Перечисления.ЭтапыПеревозки.ПерваяМиля);
					//Евросиб Коханенко Н.А. 26.08.2024 (( #90602 
					//Если Не ЗначениеЗаполнено(ПерваяМиляКлючаАналитики[0].ДатаВыдачиКТКСТерминала) Тогда
					Если ПерваяМиляКлючаАналитики.Количество() > 0 
						И НЕ ЗначениеЗаполнено(ПерваяМиляКлючаАналитики[0].ДатаВыдачиКТКСТерминала) Тогда
					//Евросиб Коханенко Н.А. 26.08.2024 )) #90602 
						СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПерваяМиляКлючаАналитики.ДатаВыдачиКТКСТерминала = Стр.ДатаВыдачи;
					КонецЕсли;
				КонецЕсли;
				Если ЗначениеЗаполнено(Стр.ДатаВозвратаКлиентом) Тогда
					ПоследняяМиляКлючаАналитики = Справочники.КлючиАналитикиПеревозки.КлючиАналитикиЗначенияПолейПоЭтапуПеревозки(Стр.КлючАналитикиПеревозки, Перечисления.ЭтапыПеревозки.ПоследняяМиля);
					//Евросиб Коханенко Н.А. 26.08.2024 (( #90602 
					//Если Не ЗначениеЗаполнено(ПоследняяМиляКлючаАналитики[0].ДатаСдачиКТКНаТерминал) Тогда
					Если ПоследняяМиляКлючаАналитики.Количество() > 0 
						И НЕ ЗначениеЗаполнено(ПоследняяМиляКлючаАналитики[0].ДатаСдачиКТКНаТерминал) Тогда
					//Евросиб Коханенко Н.А. 26.08.2024 )) #90602 
					СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПоследняяМиляКлючаАналитики.ДатаСдачиКТКНаТерминал = Стр.ДатаВозвратаКлиентом;
					КонецЕсли;
				КонецЕсли;
				СтруктураКлючаАналитикиПеревозки.ЗаявкаПриемник = Ссылка;
				СтруктураКлючаАналитикиПеревозки.РелизКлиента = Стр.Релиз;
				//Евросиб Коханенко Н.А. 16.07.2024 )) #83866
				КлючАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлючаАналитикиПеревозки);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	#КонецОбласти   
	// ДИТ BUG 79844 ТА 79845 Сержантова А.С. Начало: 22.01.2024
	
		//Субботин 72717 31.07.2023 начало
	
	Если ЭтотОбъект.ПереченьРейсов.Количество() > 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДокПСЦ.НачалоДействия КАК НачалоДействия,
		|	ДокПСЦ.Ссылка КАК СсылкаПСЦ,
		|	ЗаявкаСоставУслуги.Ссылка КАК СсылкаЗаявка
		|ПОМЕСТИТЬ ВТ_ПСЦ
		|ИЗ
		|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПСЦ КАК ДокПСЦ
		|		ПО ЗаявкаСоставУслуги.ПСЦ = ДокПСЦ.Ссылка
		|ГДЕ
		|	ЗаявкаСоставУслуги.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаявкаПереченьРейсов.Ссылка КАК СсылкаЗаявка,
		|	МИНИМУМ(ЗаявкаПереченьРейсов.Рейс.ДатаОтправления) КАК РейсДатаОтправления
		|ПОМЕСТИТЬ ВТ_рейсы
		|ИЗ
		|	ВТ_ПСЦ КАК ВТ_ПСЦ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
		|		ПО ВТ_ПСЦ.СсылкаЗаявка = ЗаявкаПереченьРейсов.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаявкаПереченьРейсов.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПСЦ.СсылкаПСЦ КАК СсылкаПСЦ,
		|	ВТ_ПСЦ.НачалоДействия КАК НачалоДействия,
		|	ВТ_рейсы.РейсДатаОтправления КАК РейсДатаОтправления
		|ИЗ
		|	ВТ_ПСЦ КАК ВТ_ПСЦ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_рейсы КАК ВТ_рейсы
		|		ПО ВТ_ПСЦ.СсылкаЗаявка = ВТ_рейсы.СсылкаЗаявка
		|			И ВТ_ПСЦ.НачалоДействия > ВТ_рейсы.РейсДатаОтправления";
		
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);

		РезультатЗапроса = Запрос.Выполнить();
		Если не РезультатЗапроса.Пустой() тогда
			ОбщегоНазначения.СообщитьПользователю("Дата отправления рейса не входит в период действия протокола");
		КонецЕсли;
	Иначе		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаСоставУслуги.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|		Внутреннее СОЕДИНЕНИЕ Документ.ПСЦ КАК ДокПСЦ
		|		ПО ЗаявкаСоставУслуги.ПСЦ = ДокПСЦ.Ссылка
		|			И ЗаявкаСоставУслуги.Ссылка.Отправка < ДокПСЦ.НачалоДействия
		|ГДЕ
		|	ЗаявкаСоставУслуги.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() тогда
			ОбщегоНазначения.СообщитьПользователю("Дата отправки в заявке не входит в период действия протокола");
		КонецЕсли;
	КонецЕсли;
	//Субботин 72717 31.07.2023 конец 
	
	//Евросиб Коханенко Н.А. 25.04.2024 (( #84617
	Если НЕ Отказ Тогда
		//обновим учетные направления в связанных запросах на автоперевозку
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗапросНаАвтоперевозку.Ссылка КАК ЗапросНаАвтоСсылка
		|ИЗ
		|	Документ.ЗапросНаАвтоперевозку КАК ЗапросНаАвтоперевозку
		|ГДЕ
		|	ЗапросНаАвтоперевозку.Заявка = &ЗаявкаСсылка
		|	И НЕ ЗапросНаАвтоперевозку.ПометкаУдаления";
		Запрос.УстановитьПараметр("ЗаявкаСсылка", ЭтотОбъект.ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ДокументОбъект = Выборка.ЗапросНаАвтоСсылка.ПолучитьОбъект();
			ДокументОбъект.ОбновитьУчетныеНаправленияИзЗаявки();
		КонецЦикла; 
		
		//Евросиб(ДИТ) Сержантова А.С. US 77172 ТА 102290 Начало 11.02.2025
		//СтатусыКТКСервер.ПроверитьИзменениеИЗаписатьСтатусыКТК(Ссылка);
		//Евросиб(ДИТ) Сержантова А.С. US 77172 ТА 102290 Конец 11.02.2025    
		
	КонецЕсли;
	//Евросиб Коханенко Н.А. 25.04.2024 )) #84617 
	
	//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, начало
	Если ДополнительныеСвойства.Свойство("ГруппаДКС") Тогда
		РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьГруппуДКСпоДокументу(Ссылка, ДополнительныеСвойства.ГруппаДКС);
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, конец
	
	//Евросиб Коханенко Н.А. 24.01.2025 (( #98939 
	Если ДополнительныеСвойства.Свойство("АвтозагрузкаРейсовИзДХ") Тогда
		РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьАналитикуДокумента(Ссылка,
			ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.АвтозагрузкаРейсовИзДХ, 
			ДополнительныеСвойства.АвтозагрузкаРейсовИзДХ);
	Иначе 
		РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьАналитикуДокумента(Ссылка,
			ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.АвтозагрузкаРейсовИзДХ, 
			Ложь); //в новой заявке автозагрузка активна
	КонецЕсли;
	//Евросиб Коханенко Н.А. 24.01.2025 )) #98939 

	//ДИТ Шевченко А.В. 17.01.2024 US 91366 TA 93137 -начало
	Если ДополнительныеСвойства.Свойство("ТранзитДляКлиента") Тогда
		РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьТранзитДляКлиентаПоДокументу(Ссылка, ДополнительныеСвойства.ТранзитДляКлиента);
	КонецЕсли;
	//ДИТ Шевченко А.В. 17.01.2024 US 91366 TA 93137 -конец
	
	//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, начало
	МассивКалькуляций = СоставУслуги.ВыгрузитьКолонку("Калькуляция");
	РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.УстановитьВидЗадолженностиПоКалькуляциям(Ссылка, МассивКалькуляций);
	//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, конец
	
	//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, начало
	ПараметрыЗагрузкиИзЛК = РегистрыСведений.ПротоколОбменов.ПроверитьВыгрузку(Ссылка, Перечисления.УзлыОбмена.ЛК, Перечисления.ДействияПриОбмене.ЗагрузкаДанных);
	Если ЗначениеЗаполнено(ПараметрыЗагрузкиИзЛК.Ссылка) Тогда 
		ПланыОбмена.ОбменЗаявками.ЗарегистрироватьИзмененияПоДокументу(Ссылка, Перечисления.УзлыОбмена.ЛК);
		ПланыОбмена.ОбменЗаявками.ЗарегистрироватьИзмененияПоДокументу(Ссылка, Перечисления.УзлыОбмена.DX);
	КонецЕсли;
	ПараметрыЗагрузкиИзDX = РегистрыСведений.ПротоколОбменов.ПроверитьВыгрузку(Ссылка, Перечисления.УзлыОбмена.DX, Перечисления.ДействияПриОбмене.ЗагрузкаДанных);
	Если ЗначениеЗаполнено(ПараметрыЗагрузкиИзDX.Ссылка) Тогда 
		ПланыОбмена.ОбменЗаявками.ЗарегистрироватьИзмененияПоДокументу(Ссылка, Перечисления.УзлыОбмена.DX);
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, конец
	
КонецПроцедуры

Процедура ЗаписатьДанныеПоЗаявкеСибур()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокЗаявка.СтатусЗаявкиСибур КАК СтатусЗаявкиСибур,
		|	ДокЗаявка.ПричинаОтклоненияЗаявки КАК ПричинаОтклоненияЗаявки,
		|	СибурРазмещенныеЗаявки.ЗаявкаНаОтправкуГруженых КАК ЗаявкаНаОтправкуГруженых
		|ИЗ
		|	Документ.Заявка КАК ДокЗаявка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СибурРазмещенныеЗаявки КАК СибурРазмещенныеЗаявки
		|		ПО ДокЗаявка.Ссылка = СибурРазмещенныеЗаявки.Заявка
		|ГДЕ
		|	ДокЗаявка.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();	
	
	Если Выборка.Следующий() Тогда
		Если СтатусЗаявкиСибур <> Выборка.СтатусЗаявкиСибур Или ПричинаОтклоненияЗаявки <> Выборка.ПричинаОтклоненияЗаявки Тогда
			
			ЗаписьСтатуса = РегистрыСведений.СибурСтатусыЗаявок.СоздатьМенеджерЗаписи();
			ЗаписьСтатуса.Период = ТекущаяДатаСеанса();
			ЗаписьСтатуса.Заявка = Ссылка;
			ЗаписьСтатуса.СтатусЗаявки = СтатусЗаявкиСибур;
			ЗаписьСтатуса.ПричинаОтклоненияЗаявки = ПричинаОтклоненияЗаявки;			
			ЗаписьСтатуса.Записать();
			
			Если ЗначениеЗаполнено(Выборка.ЗаявкаНаОтправкуГруженых) Тогда
				ДокОбъект = Выборка.ЗаявкаНаОтправкуГруженых.ПолучитьОбъект();
				ДокОбъект.СтатусЗаявкиСибур = СтатусЗаявкиСибур;
				ДокОбъект.ПричинаОтклоненияЗаявки = ПричинаОтклоненияЗаявки;
				ДокОбъект.Записать();
			КонецЕсли;
		
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

// Евросиб Фролов (08.10.2021 Task №39041
Процедура ПередУдалением(Отказ)
	РаботаСКонтейнерамиСервер.УдалитьИнформациюОбИсточникеСозднияКонтейнеров(Ссылка);	
КонецПроцедуры
// Евросиб Фролов)

//+ДИТ_Коробов_task 40377 23.03.22
Процедура ПроверитьПодчиненныеСчета()
	//ДИТ, Беляев СЮ, Ticket#0269304, 18-04-2022, начало
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат;
	КонецЕсли;
	//ДИТ, Беляев СЮ, Ticket#0269304, 18-04-2022, конец
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетНаОплатуПокупателюДокументыОснования.Ссылка КАК Ссылка,
		//Евросиб Каблов 10.11.2022 ( 52045
		|	СчетНаОплатуПокупателюДокументыОснования.Ссылка.Представление КАК ПредставлениеСчета
		//Евросиб Каблов 10.11.2022 )
		|ИЗ
		|	Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
		|ГДЕ
		|	СчетНаОплатуПокупателюДокументыОснования.Документ = &Документ
		|	И НЕ СчетНаОплатуПокупателюДокументыОснования.Ссылка.ПометкаУдаления
		|	И СчетНаОплатуПокупателюДокументыОснования.Ссылка.Проведен";
	
	Запрос.УстановитьПараметр("Документ", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//Евросиб Каблов 10.11.2022 ( 52045
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	
	//	Сообщить("Внимание, вы изменяете заявку, на которую имеются выставленные счета: "+ ВыборкаДетальныеЗаписи.Ссылка)
	//	
	//КонецЦикла;
	
	ТаблицаСчетов = РезультатЗапроса.Выгрузить();
	Если ТаблицаСчетов.Количество() > 0 Тогда
		Счета = ТаблицаСчетов.ВыгрузитьКолонку("ПредставлениеСчета");
		СчетаСтрока = СтрСоединить(Счета, ", ");
		ОбщегоНазначения.СообщитьПользователю("Внимание, вы изменяете заявку, на которую имеются выставленные счета: " + СчетаСтрока);
	КонецЕсли;
	//Евросиб Каблов 10.11.2022 )
	
КонецПроцедуры
//-ДИТ_Коробов_task 40377 23.03.22

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьКлючевыеРеквизитыЗаказаНаАвтопревозку(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		//Евросиб Коханенко Н.А. 20.03.2025 (( #104519 
		|	ЗапросНаАвтоперевозку.Ссылка КАК ЗапросСсылка,
		//Евросиб Коханенко Н.А. 20.03.2025 )) #104519 
		|	ЗапросНаАвтоперевозку.ЭтапПеревозки КАК ЭтапПеревозки
		|ИЗ
		|	Документ.ЗапросНаАвтоперевозку КАК ЗапросНаАвтоперевозку
		|ГДЕ
		|	ЗапросНаАвтоперевозку.Заявка = &Заявка
		|	И НЕ ЗапросНаАвтоперевозку.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		//Евросиб Коханенко Н.А. 20.03.2025 (( #104519 
		|	ЗапросНаАвтоперевозку.Ссылка,
		//Евросиб Коханенко Н.А. 20.03.2025 )) #104519 
		|	ЗапросНаАвтоперевозку.ЭтапПеревозки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭтапПеревозки УБЫВ";
	
	Запрос.УстановитьПараметр("Заявка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивДляШаблона = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЭтапПеревозкиП = ВыборкаДетальныеЗаписи.ЭтапПеревозки; 
		ЕстьИзменения = СравинитьКлючевыеПоляПоМиле(ЭтапПеревозкиП);
		Если ЕстьИзменения Тогда
			//Евросиб Коханенко Н.А. 20.03.2025 (( #104519 
			//МассивДляШаблона.Добавить(?(ЭтапПеревозкиП = Перечисления.ЭтапыПеревозки.ПерваяМиля,"первая миля","последняя миля"));
			Если ЭтапПеревозкиП = Перечисления.ЭтапыПеревозки.СредняяМиля Тогда
				ПланыОбмена.ВыгрузкаДанных.ЗарегистрироватьИзмененияПоДокументу(ВыборкаДетальныеЗаписи.ЗапросСсылка, Перечисления.УзлыОбмена.ТЛ);
			Иначе
				МассивДляШаблона.Добавить(?(ЭтапПеревозкиП = Перечисления.ЭтапыПеревозки.ПерваяМиля,"первая миля","последняя миля"));
			КонецЕсли;
			//Евросиб Коханенко Н.А. 20.03.2025 )) #104519 
			КонецЕсли;		
	КонецЦикла;	
    
	Если МассивДляШаблона.Количество() > 0 Тогда 
		// ДИТ US 78243 ТА 78267 Сержантова А.С. Начало: 19.12.2023
		// Было:
		//ОбщегоНазначения.СообщитьПользователю(СтрШаблон("В документ Заявка были внесены изменения после формирования запроса на автоперевозку. Необходимо обновить данные в запросе на автоперевозку (%1)",СтрСоединить(МассивДляШаблона," и ")));
		//Стало:         
		ТекстШаблона = "По данной заявке уже создан запрос на автоперевозку (%1) и необходимо обновить в нем информацию по кнопке ""Обновить из заявки"", после чего отправить обновленные данные в ТЛ";
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ТекстШаблона,СтрСоединить(МассивДляШаблона," и ")));
		// ДИТ US 78243 ТА 78267 Сержантова А.С. Конец: 19.12.2023
	КонецЕсли;	
	
КонецПроцедуры	

Функция СравинитьКлючевыеПоляПоМиле(ЭтапПеревозкиП)
	
	ЕстьИзменения = Ложь;
	
	МассивКолонокСверкиЗапросыКТК = Новый Массив;
	МассивКолонокСверкиУслуг      = Новый Массив;
	
	МассивКолонокСверкиЗапросыКТК.Добавить("ИдентификаторСтроки");
	МассивКолонокСверкиЗапросыКТК.Добавить("КоличествоКТК");
	МассивКолонокСверкиЗапросыКТК.Добавить("ТипКТК");
	МассивКолонокСверкиЗапросыКТК.Добавить("ЛокацияВыдачи");	
	
	МассивКолонокСверкиУслуг.Добавить("НомерКТК");
	МассивКолонокСверкиУслуг.Добавить("ТипКТК");
	// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 13.02.2023
	// Было:
	//МассивКолонокСверкиУслуг.Добавить("Груз"); 	
	// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 13.02.2023
	МассивКолонокСверкиУслуг.Добавить("ВесГрузаНетто");
	МассивКолонокСверкиУслуг.Добавить("КоличествоМест");
	МассивКолонокСверкиУслуг.Добавить("ГУИДСтроки");
	МассивКолонокСверкиУслуг.Добавить("Релиз");
	МассивКолонокСверкиУслуг.Добавить("ВидСобственности");
	МассивКолонокСверкиУслуг.Добавить("ПринадлежностьТЕ");
	МассивКолонокСверкиУслуг.Добавить("ГУИДСтроки");
	
	Если ЭтапПеревозкиП = Перечисления.ЭтапыПеревозки.ПерваяМиля Тогда
		ИмяКолонкиОтбораЗапросы = "Автоперевозка";
		ИмяКолонкиОтбораУслуги  = "ПерваяМиля";
		
		СтруктураОтбораЗапросы = Новый Структура;
		СтруктураОтбораЗапросы.Вставить(ИмяКолонкиОтбораЗапросы,Перечисления.ВариантыАвтоперевозки.СиламиЕвросиб);
		СтруктураОтбораУслуги  = Новый Структура;
		СтруктураОтбораУслуги.Вставить(ИмяКолонкиОтбораУслуги,Перечисления.ВариантыАвтоперевозки.СиламиЕвросиб);		
	Иначе
		ИмяКолонкиОтбораЗапросы = "ПоследняяМиля";
		ИмяКолонкиОтбораУслуги  = "ПоследняяМиля";
		
		СтруктураОтбораЗапросы = Новый Структура;
		СтруктураОтбораЗапросы.Вставить(ИмяКолонкиОтбораЗапросы,Перечисления.ВариантыАвтоперевозки.СиламиЕвросиб);
		СтруктураОтбораУслуги  = Новый Структура;
		СтруктураОтбораУслуги.Вставить(ИмяКолонкиОтбораУслуги,Перечисления.ВариантыАвтоперевозки.СиламиЕвросиб);
	КонецЕсли;	
	
	ТзЗапросовКТКТек   = СписокЗапросНаКТК.Выгрузить(СтруктураОтбораЗапросы,СтрСоединить(МассивКолонокСверкиЗапросыКТК,","));
	ТзУслугКТКТек      = СоставУслуги.Выгрузить(СтруктураОтбораУслуги,СтрСоединить(МассивКолонокСверкиУслуг,","));
	
	ОтветТаблицы       = ПолучитьЗапросыИУслуги(Ссылка,ЭтапПеревозкиП);
	
	ТзЗапросовКТКДоИзм = ОтветТаблицы.ТаблицаЗапросыКТК;
	ТзУслугКТКДоИзм    = ОтветТаблицы.ТаблциУслуги;
	
	Если ТзЗапросовКТКТек.Количество()  <> ТзЗапросовКТКДоИзм.Количество() Тогда
		ЕстьИзменения = Истина;
	КонецЕсли;
	Если ТзУслугКТКТек.Количество()  <> ТзУслугКТКДоИзм.Количество() Тогда
		ЕстьИзменения = Истина;
	КонецЕсли;
	
	Для Каждого СтрокаТзТек Из ТзЗапросовКТКТек Цикл
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ИдентификаторСтроки",СтрокаТзТек.ИдентификаторСтроки);	
		НайденныеСтроки = ТзЗапросовКТКДоИзм.НайтиСтроки(СтруктураОтбора);
		Если НайденныеСтроки = Неопределено Тогда
			ЕстьИзменения = Истина;	
		КонецЕсли;
		Для Каждого СтрокаДоИзм Из НайденныеСтроки Цикл
			Для Каждого КолонкаЗнч Из ТзЗапросовКТКТек.Колонки Цикл
				Если СтрокаТзТек[КолонкаЗнч.Имя] <> СтрокаДоИзм[КолонкаЗнч.Имя] Тогда
					ЕстьИзменения = Истина;	
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;	
	КонецЦикла;
	
	Для Каждого СтрокаТзТек Из ТзУслугКТКТек Цикл
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ГУИДСтроки",СтрокаТзТек.ГУИДСтроки);	
		НайденныеСтроки = ТзУслугКТКДоИзм.НайтиСтроки(СтруктураОтбора);
		Если НайденныеСтроки = Неопределено Тогда
			ЕстьИзменения = Истина;	
		КонецЕсли;
		Для Каждого СтрокаДоИзм Из НайденныеСтроки Цикл
			Для Каждого КолонкаЗнч Из ТзУслугКТКТек.Колонки Цикл
				Если СтрокаТзТек[КолонкаЗнч.Имя] <> СтрокаДоИзм[КолонкаЗнч.Имя] Тогда
					ЕстьИзменения = Истина;	
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;	
	КонецЦикла;
	
	Возврат ЕстьИзменения;
	
КонецФункции

Функция ПолучитьЗапросыИУслуги(Ссылка,ЭтапПервозкиП)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаСписокЗапросНаКТК.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ЗаявкаСписокЗапросНаКТК.КоличествоКТК КАК КоличествоКТК,
		|	ЗаявкаСписокЗапросНаКТК.ТипКТК КАК ТипКТК,
		|	ЗаявкаСписокЗапросНаКТК.ЛокацияВыдачи КАК ЛокацияВыдачи
		|ИЗ
		|	Документ.Заявка.СписокЗапросНаКТК КАК ЗаявкаСписокЗапросНаКТК
		|ГДЕ
		|	ЗаявкаСписокЗапросНаКТК.Ссылка = &Ссылка
		|	И &МиляЗапросыКТК = ЗНАЧЕНИЕ(Перечисление.ВариантыАвтоперевозки.СиламиЕвросиб)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаявкаСоставУслуги.НомерКТК КАК НомерКТК,
		|	ЗаявкаСоставУслуги.ТипКТК КАК ТипКТК,
		// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 06.02.2023
		// Было:
		//|	ЗаявкаСоставУслуги.Груз КАК Груз, 
		//Стало:
		|	ЗаявкаСоставУслуги.КлючАналитикиПеревозки.Груз КАК Груз,
		// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 06.02.2023
		|	ЗаявкаСоставУслуги.ВесГрузаНетто КАК ВесГрузаНетто,
		|	ЗаявкаСоставУслуги.КоличествоМест КАК КоличествоМест,
		|	ЗаявкаСоставУслуги.ГУИДСтроки КАК ГУИДСтроки,
		|	ЗаявкаСоставУслуги.Релиз КАК Релиз,
		|	ЗаявкаСоставУслуги.ВидСобственности КАК ВидСобственности,
		|	ЗаявкаСоставУслуги.ПринадлежностьТЕ КАК ПринадлежностьТЕ
		|ИЗ
		|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|ГДЕ
		|	ЗаявкаСоставУслуги.Ссылка = &Ссылка
		|	И &МиляУслуги = ЗНАЧЕНИЕ(Перечисление.ВариантыАвтоперевозки.СиламиЕвросиб)";
	
	Если ЭтапПервозкиП = Перечисления.ЭтапыПеревозки.ПерваяМиля Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&МиляЗапросыКТК","ЗаявкаСписокЗапросНаКТК.Автоперевозка");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&МиляУслуги","ЗаявкаСоставУслуги.ПерваяМиля");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&МиляЗапросыКТК","ЗаявкаСписокЗапросНаКТК.ПоследняяМиля");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&МиляУслуги","ЗаявкаСоставУслуги.ПоследняяМиля");
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	СтруктураОтвет = Новый Структура();
	
	СтруктураОтвет.Вставить("ТаблицаЗапросыКТК",РезультатЗапроса[0].Выгрузить());
	СтруктураОтвет.Вставить("ТаблциУслуги",РезультатЗапроса[1].Выгрузить());
	
	Возврат СтруктураОтвет;
	
КонецФункции	

Процедура ПроверитьВозможностьОтменыПоЗаказамНаАвтоперевозку(Отказ) 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗапросНаАвтоперевозку.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗапросНаАвтоперевозку КАК ЗапросНаАвтоперевозку
		|ГДЕ
		|	ЗапросНаАвтоперевозку.Заявка = &Заявка
		|	И ЗапросНаАвтоперевозку.Проведен";
	
	Запрос.УстановитьПараметр("Заявка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Удаление и отмена проведения заявки №%1 от %2 невозможны. На основе заявки сформированы ""Заказы на автоперевозку""",Номер,Дата),,,,Отказ);
		Прервать;
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ВыполнитьПроверкиПриЗапросеНаКТК(РежимЗаписи, Отказ, ДополнительныеСвойства) 
	// Евросиб Фролов (16.11.2021 TASK№ №41969		
	Для Каждого ТекущаяСтрока Из СписокЗапросНаКТК Цикл
		
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.ДействиеРелизаНачало) Тогда
			ОбщегоНазначения.СообщитьПользователю(
												"Не указано начало действия релиза",
												ЭтотОбъект,
												ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СписокЗапросНаКТК", ТекущаяСтрока.НомерСтроки, "ДействиеРелизаНачало"),
												,
												Отказ);
		КонецЕсли;
											
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.ДействиеРелизаОкончание) Тогда
			ОбщегоНазначения.СообщитьПользователю(
												"Не указано окончание действия релиза",
												ЭтотОбъект,
												ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СписокЗапросНаКТК", ТекущаяСтрока.НомерСтроки, "ДействиеРелизаОкончание"),
												,
												Отказ);
		КонецЕсли;
											
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.ЛокацияВыдачи) Тогда
			ОбщегоНазначения.СообщитьПользователю(
												"Не указана локация выдачи",
												ЭтотОбъект,
												ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СписокЗапросНаКТК", ТекущаяСтрока.НомерСтроки, "ЛокацияВыдачи"),
												,
												Отказ);
		КонецЕсли;
											
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.ЛокацияСдачи) Тогда
			ОбщегоНазначения.СообщитьПользователю(
												"Не указана локация сдачи",
												ЭтотОбъект,
												ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СписокЗапросНаКТК", ТекущаяСтрока.НомерСтроки, "ЛокацияСдачи"),
												,
												Отказ);
		КонецЕсли;
											
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.СрокИспользованияКТК) Тогда
			ОбщегоНазначения.СообщитьПользователю(
												"Не указан срок использования КТК",
												ЭтотОбъект,
												ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СписокЗапросНаКТК", ТекущаяСтрока.НомерСтроки, "СрокИспользованияКТК"),
												,
												Отказ);
		КонецЕсли;
				
	КонецЦикла;	
	// Евросиб Фролов)
	
	ПроверитьЗаполнениАвтоперевозки(РежимЗаписи, Отказ, ДополнительныеСвойства); // Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента // ДИТ Сержантова А.С. 16.01.2024 BUG 79844
КонецПроцедуры

Функция ИзменилсяСоставЗапроса()
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	Возврат Документы.Заявка.ИзменилсяСоставЗапроса(ЭтотОбъект);		
	// Евросиб Фролов)
КонецФункции

Процедура ОчиститьАвтоперевозку()
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗаявкаСписокЗапросНаКТК.Автоперевозка КАК Автоперевозка,
	|	ЗаявкаСписокЗапросНаКТК.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ втЗапросНаКТК
	|ИЗ
	|	&СписокЗапросНаКТК КАК ЗаявкаСписокЗапросНаКТК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втЗапросНаКТК.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	втЗапросНаКТК КАК втЗапросНаКТК
	|ГДЕ
	|	втЗапросНаКТК.Автоперевозка <> &Автоперевозка";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("СписокЗапросНаКТК", 		СписокЗапросНаКТК.Выгрузить());
	Запрос.УстановитьПараметр("Автоперевозка", 			Перечисления.ВариантыАвтоперевозки.СиламиКлиента);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		МассивУдаляемыхИдентификаторов = Результат.Выгрузить().ВыгрузитьКолонку("ИдентификаторСтроки");
		
		// Транспортные средства
		Индекс = ТранспортныеСредства.Количество() - 1;
		Пока Индекс >= 0 Цикл
			Если МассивУдаляемыхИдентификаторов.Найти(ТранспортныеСредства[Индекс].ИдентификаторСтрокиЗапроса) <> Неопределено Тогда
				ТранспортныеСредства.Удалить(Индекс);
			КонецЕсли;
			Индекс = Индекс - 1;
		КонецЦикла;
		
	КонецЕсли;	
	
	// Евросиб Фролов)
КонецПроцедуры	

Функция ПроверитьЗаполнениАвтоперевозки(РежимЗаписи, Отказ, ДополнительныеСвойства)        
	
	// ДИТ BUG 79844 Сержантова А.С. Начало: 16.01.2024
	Если ДополнительныеСвойства.Свойство("ДанныеДляОбновленияКлючейАналитики") Тогда
		ДанныеДляОбновленияКлючейАналитики = ДополнительныеСвойства.ДанныеДляОбновленияКлючейАналитики;  
		МассивСтрокТС = Новый Массив;
		МассивСтрокЗапроса = Новый Массив; 
		Для каждого СтрДанныхКлюча Из ДанныеДляОбновленияКлючейАналитики Цикл 
			ДанныеКлючаПоСтроке = СтрДанныхКлюча.ДанныеКлюча;
			Если (СтрДанныхКлюча.ИсточникКлюча = "ТранспортныеСредства" 
				и ДанныеКлючаПоСтроке.СтруктураТЧМилиПерваяМиляКлючаАналитики.ВариантАвтоперевозки = Перечисления.ВариантыАвтоперевозки.СиламиКлиента) 
				Тогда
				РеквизитыДляПроверки = ДанныеКлючаПоСтроке.СтруктураТЧМилиПерваяМиляКлючаАналитики; 
			ИначеЕсли (СтрДанныхКлюча.ИсточникКлюча = "ТранспортныеСредстваПоследняяМиля"
				и ДанныеКлючаПоСтроке.СтруктураТЧМилиПоследняяМиляКлючаАналитики.ВариантАвтоперевозки = Перечисления.ВариантыАвтоперевозки.СиламиКлиента)
				Тогда 
				РеквизитыДляПроверки = ДанныеКлючаПоСтроке.СтруктураТЧМилиПоследняяМиляКлючаАналитики;            	
			КонецЕсли;
			Если РеквизитыДляПроверки <> Неопределено и  
				(РеквизитыДляПроверки.ФИОВодителя = "" и РеквизитыДляПроверки.РегНомерТС <> ""
				ИЛИ РеквизитыДляПроверки.ФИОВодителя <> "" и РеквизитыДляПроверки.РегНомерТС = ""
				ИЛИ (РеквизитыДляПроверки.Автоперевозчик = "" ИЛИ РеквизитыДляПроверки.Автоперевозчик = Неопределено
					ИЛИ РеквизитыДляПроверки.Автоперевозчик = Справочники.Контрагенты.ПустаяСсылка()) 
					и РеквизитыДляПроверки.ФИОВодителя = "" и РеквизитыДляПроверки.РегНомерТС = "") Тогда   
                    МассивСтрокТС.Добавить(СтрДанныхКлюча.НомерСтроки);
					// ДИТ US 78243 ТА 80825 Сержантова А.С. Начало: 19.02.2024
					Если МассивСтрокЗапроса.Найти(РеквизитыДляПроверки.НомерСтрокиЗапроса) = Неопределено Тогда
						МассивСтрокЗапроса.Добавить(РеквизитыДляПроверки.НомерСтрокиЗапроса);
					КонецЕсли;
					// ДИТ US 78243 ТА 80825 Сержантова А.С. Конец: 19.02.2024
			КонецЕсли;
		КонецЦикла;  
		
		Если МассивСтрокЗапроса.Количество() Тогда
			ТекстОшибки = СтрШаблон("В строке %1 запроса на КТК содержатся неполные данные по автоперевозке в строке %2 вложенной таблицы",
									СтрСоединить(МассивСтрокЗапроса, ","),СтрСоединить(МассивСтрокТС,","));
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект,,,Отказ);
		КонецЕсли;   
	Иначе
	// ДИТ BUG 79844 Сержантова А.С. Конец: 16.01.2024
	
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("СписокЗапроса", 			СписокЗапросНаКТК.Выгрузить());
	Запрос.УстановитьПараметр("ТранспортныеСредства", 	ТранспортныеСредства.Выгрузить());
	Запрос.УстановитьПараметр("Автоперевозка", 			Перечисления.ВариантыАвтоперевозки.СиламиКлиента);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаСписокЗапросНаКТК.НомерСтроки КАК НомерСтроки,
	|	ЗаявкаСписокЗапросНаКТК.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ЗаявкаСписокЗапросНаКТК.Автоперевозка КАК Автоперевозка,
	|	ЗаявкаСписокЗапросНаКТК.КоличествоКТК КАК КоличествоКТК
	|ПОМЕСТИТЬ втЗапрос
	|ИЗ
	|	&СписокЗапроса КАК ЗаявкаСписокЗапросНаКТК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023
	//|ВЫБРАТЬ
	//|	ТранспортныеСредства.НомерСтроки КАК НомерСтроки,
	//|	ТранспортныеСредства.ФИОВодителя КАК ФИОВодителя,
	//|	ТранспортныеСредства.РегНомерТС КАК РегНомерТС,
	//|	ТранспортныеСредства.Автоперевозчик КАК Автоперевозчик,
	//|	ТранспортныеСредства.ИдентификаторСтрокиЗапроса КАК ИдентификаторСтрокиЗапроса,
	//|ПОМЕСТИТЬ втТранспортныеСредства
	//|ИЗ
	//|	&ТранспортныеСредства КАК ТранспортныеСредства";
	|ВЫБРАТЬ
	|	ТранспортныеСредства.ИдентификаторСтрокиЗапроса КАК ИдентификаторСтрокиЗапроса,
	|	ТранспортныеСредства.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
	|	ТранспортныеСредства.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ втТранспортныеСредства1
	|ИЗ
	|	&ТранспортныеСредства КАК ТранспортныеСредства
	|;
	|ВЫБРАТЬ
	|	втТранспортныеСредства1.НомерСтроки КАК НомерСтроки,
	|	КлючиАналитикиПеревозкиМили.ФИОВодителя КАК ФИОВодителя,
	|	КлючиАналитикиПеревозкиМили.РегНомерТС КАК РегНомерТС,
	|	КлючиАналитикиПеревозкиМили.Автоперевозчик КАК Автоперевозчик,
	|	втТранспортныеСредства1.ИдентификаторСтрокиЗапроса КАК ИдентификаторСтрокиЗапроса,
	|	втТранспортныеСредства1.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки
	|ПОМЕСТИТЬ втТранспортныеСредства
	|ИЗ
	|	втТранспортныеСредства1 КАК втТранспортныеСредства1
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
	|				ПО втТранспортныеСредства1.КлючАналитикиПеревозки = КлючиАналитикиПеревозкиМили.Ссылка
	|				И (КлючиАналитикиПеревозкиМили.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.ПерваяМиля))";
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023
	Запрос.Выполнить();
	
	// Проверяем, что заполнены поля "ФИО водителя" и "ТС"
	Запрос.Текст =
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -начало
	//"ВЫБРАТЬ
	//|	втЗапрос.НомерСтроки КАК КТКНомерСтроки,
	//|	втТранспортныеСредства.НомерСтроки КАК НомерСтроки,
	//|	втТранспортныеСредства.ФИОВодителя КАК ФИОВодителя,
	//|	втТранспортныеСредства.РегНомерТС КАК РегНомерТС
	//|ИЗ
	//|	втЗапрос КАК втЗапрос
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТранспортныеСредства КАК втТранспортныеСредства
	//|		ПО втЗапрос.ИдентификаторСтроки = втТранспортныеСредства.ИдентификаторСтрокиЗапроса
	//|ГДЕ
	//|	(втТранспортныеСредства.ФИОВодителя = """"
	//|				И втТранспортныеСредства.РегНомерТС <> """"
	//|			ИЛИ втТранспортныеСредства.ФИОВодителя <> """"
	//|				И втТранспортныеСредства.РегНомерТС = """"
	//|			ИЛИ ((втТранспортныеСредства.Автоперевозчик = НЕОПРЕДЕЛЕНО
	//|				ИЛИ втТранспортныеСредства.Автоперевозчик = """"
	//|				ИЛИ втТранспортныеСредства.Автоперевозчик = &ПустойКонтрагент)
	//|					И втТранспортныеСредства.ФИОВодителя = """"
	//|					И втТранспортныеСредства.РегНомерТС = """")
	//|				И втЗапрос.Автоперевозка = &Автоперевозка)
	//|ИТОГИ ПО
	//|	КТКНомерСтроки";
	
	"ВЫБРАТЬ
	|	втЗапрос.НомерСтроки КАК КТКНомерСтроки,
	|	втТранспортныеСредства.НомерСтроки КАК НомерСтроки,
	|	КлючиАналитикиПеревозкиМили.ФИОВодителя КАК ФИОВодителя,
	|	КлючиАналитикиПеревозкиМили.РегНомерТС КАК РегНомерТС
	|ИЗ
	|	втЗапрос КАК втЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТранспортныеСредства КАК втТранспортныеСредства
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
	|				ПО втТранспортныеСредства.КлючАналитикиПеревозки = КлючиАналитикиПеревозкиМили.Ссылка
	|				И (КлючиАналитикиПеревозкиМили.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.ПерваяМиля))
	|		ПО втЗапрос.ИдентификаторСтроки = втТранспортныеСредства.ИдентификаторСтрокиЗапроса
	|ГДЕ
	|	(КлючиАналитикиПеревозкиМили.ФИОВодителя = """"
	|				И КлючиАналитикиПеревозкиМили.РегНомерТС <> """"
	|			ИЛИ КлючиАналитикиПеревозкиМили.ФИОВодителя <> """"
	|				И КлючиАналитикиПеревозкиМили.РегНомерТС = """"
	|			ИЛИ ((КлючиАналитикиПеревозкиМили.Автоперевозчик = НЕОПРЕДЕЛЕНО
	|				ИЛИ КлючиАналитикиПеревозкиМили.Автоперевозчик = """"
	|				ИЛИ КлючиАналитикиПеревозкиМили.Автоперевозчик = &ПустойКонтрагент)
	|					И КлючиАналитикиПеревозкиМили.ФИОВодителя = """"
	|					И КлючиАналитикиПеревозкиМили.РегНомерТС = """")
	|				И втЗапрос.Автоперевозка = &Автоперевозка)
	|ИТОГИ ПО
	|	КТКНомерСтроки";
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -конец
	Запрос.УстановитьПараметр("ПустойКонтрагент", 			Справочники.Контрагенты.ПустаяСсылка());
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКТКНомерСтроки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	//ДИТ Шевченко А.В. 59945 05.10.22 -начало
	Пока ВыборкаКТКНомерСтроки.Следующий() Цикл
	
		ВыборкаДетальныеЗаписи = ВыборкаКТКНомерСтроки.Выбрать();
	    МассивСтрокТС = Новый Массив;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			МассивСтрокТС.Добавить(ВыборкаДетальныеЗаписи.НомерСтроки);	
		КонецЦикла;
		
		ОбщегоНазначения.СообщитьПользователю( СтрШаблон("В строке %1 запроса на КТК содержатся неполные данные по автоперевозке в строке %2 вложенной таблицы",ВыборкаКТКНомерСтроки.КТКНомерСтроки,СтрСоединить(МассивСтрокТС,","))
												,
												ЭтотОбъект,
												,
												,
												Отказ);
		
	КонецЦикла;	
	//ДИТ Шевченко А.В. 59945 05.10.22 -конец    
	
	// ДИТ BUG 79844 Сержантова А.С. Начало: 16.01.2024
	КонецЕсли;
	// ДИТ BUG 79844 Сержантова А.С. Конец: 16.01.2024
КонецФункции

// Евросиб Фролов (28.02.2022 Task №46354
Процедура ДвиженияПодсветкаФормДокументов(Отказ, РежимПроведения);
	
	ЭтоНовый = Ложь;
	ДополнительныеСвойства.Свойство("ЭтоНовый", ЭтоНовый);
	Если ЭтоНовый = Истина Тогда
		Возврат;
	КонецЕсли;	
	
	Если Не ЗапросНаКТК Тогда
		Возврат;
	КонецЕсли;	

	Если ДополнительныеСвойства.ОчищатьЗаписиРегистраПодсветки = Истина Тогда
		НаборЗаписей = РегистрыСведений.ПодсветкаФормДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		НаборЗаписей.Записать();	
		Возврат;
	КонецЕсли;	
	
	ПодсвечиваниеПолейОбъектов.ВыполнитьДвиженияПодсветкаФормДокументов(Ссылка, ЭтотОбъект, ДополнительныеСвойства, Движения, Отказ, РежимПроведения);
	
КонецПроцедуры
// Евросиб Фролов)

// Евросиб Фролов (24.03.2022 US №40767
// Task №48648

Процедура ПроверитьВозможностьОтменыПроведенияДокумента(Отказ)
	
	УстановитьПривилегированныйРежим(Истина);
	СписокРодительскихОбъектов = КонтрольДоступностиДокументов_сервер.ПолучитьСписокРодительскихОбъектов(ЭтотОбъект);
	
	ВыборкаПодчиненныхДокументов = КонтрольДоступностиДокументов_сервер.ПолучитьВыборкуПодчиненныхДокументов(ЭтотОбъект.Ссылка);
	Если ВыборкаПодчиненныхДокументов = Неопределено Тогда
		Возврат;
	КонецЕсли;	

	ВыводитьЗаголовок = Истина;
	Пока ВыборкаПодчиненныхДокументов.Следующий() Цикл
		
		Если СписокРодительскихОбъектов.НайтиПоЗначению(ВыборкаПодчиненныхДокументов.Ссылка) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		Если ВыводитьЗаголовок Тогда
			НомерЗаявки = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Номер);
			ДатаЗаявки = Формат(Дата, "ДЛФ=DD");
			ОбщегоНазначения.СообщитьПользователю(
												СтрШаблон("Удаление и отмена проведения заявки №%1 от %2 невозможны. На основе заявки сформированы следующие документы:", НомерЗаявки, ДатаЗаявки),
												ЭтотОбъект,
												,
												,
												Отказ);
			ВыводитьЗаголовок = Ложь;
		КонецЕсли;	
		
		Если ВыборкаПодчиненныхДокументов.СуммаДокумента <> Null Тогда
			ПредставлениеОбъекта = ВыборкаПодчиненныхДокументов.Представление + " " + НСтр("ru='на сумму'") + " " + Формат(ВыборкаПодчиненныхДокументов.СуммаДокумента, "ЧДЦ=2; ЧН=0") + " " + ВыборкаПодчиненныхДокументов.Валюта;
		Иначе
			ПредставлениеОбъекта = ВыборкаПодчиненныхДокументов.Представление;
		КонецЕсли;
		ОбщегоНазначения.СообщитьПользователю(
												ПредставлениеОбъекта,
												ВыборкаПодчиненныхДокументов.Ссылка,
												,
												,
												Отказ);		
													
	КонецЦикла;
		
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры
// Евросиб Фролов)

//ДИТ Авдеева В.С. 53975 16.08.2022 Начало 
Процедура ОчиститьЗаписиУдаленныхСтрок() 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	стоки_ТекущиеДанные.Период КАК Период,
	|	стоки_ТекущиеДанные.КТК КАК КТК,
	|	стоки_ТекущиеДанные.ГУИДЗаписи КАК ГУИДЗаписи,
	|	стоки_ТекущиеДанные.ПорядковыйНомерЦиклаАрендыКТК КАК ПорядковыйНомерЦиклаАрендыКТК,
	|	стоки_ТекущиеДанные.Недозаполнено КАК Недозаполнено,
	|	стоки_ТекущиеДанные.тек_ВЭксплуатации КАК тек_ВЭксплуатации,
	|	стоки_ТекущиеДанные.тек_Сток КАК тек_Сток,
	|	стоки_ТекущиеДанные.тек_Статус КАК тек_Статус,
	|	стоки_ТекущиеДанные.тек_ВидСобственности КАК тек_ВидСобственности,
	|	стоки_ТекущиеДанные.тек_Собственник КАК тек_Собственник,
	|	стоки_ТекущиеДанные.тек_Договор КАК тек_Договор,
	|	стоки_ТекущиеДанные.тек_ДатаПриемаВСток КАК тек_ДатаПриемаВСток,
	|	стоки_ТекущиеДанные.тек_ДатаВзятияИзСтока КАК тек_ДатаВзятияИзСтока,
	|	стоки_ТекущиеДанные.тек_ДатаПриемаВПользование КАК тек_ДатаПриемаВПользование,
	|	стоки_ТекущиеДанные.тек_СрокВозврата КАК тек_СрокВозврата,
	|	стоки_ТекущиеДанные.тек_ЗабратьДо КАК тек_ЗабратьДо,
	|	стоки_ТекущиеДанные.тек_ДатаСдачиВСток КАК тек_ДатаСдачиВСток,
	|	стоки_ТекущиеДанные.тек_Релиз КАК тек_Релиз,
	|	стоки_ТекущиеДанные.тек_НаСлежении КАК тек_НаСлежении,
	|	стоки_ТекущиеДанные.комм_НулеваяСтавка КАК комм_НулеваяСтавка,
	|	стоки_ТекущиеДанные.комм_Ставка КАК комм_Ставка,
	|	стоки_ТекущиеДанные.комм_Валюта КАК комм_Валюта,
	|	стоки_ТекущиеДанные.комм_ФрахтВкл КАК комм_ФрахтВкл,
	|	стоки_ТекущиеДанные.комм_СтавкаНДС КАК комм_СтавкаНДС,
	|	стоки_ТекущиеДанные.комм_НДСВключая КАК комм_НДСВключая,
	|	стоки_ТекущиеДанные.тек_СВВ КАК тек_СВВ,
	|	стоки_ТекущиеДанные.тек_НомерТДТ КАК тек_НомерТДТ,
	|	стоки_ТекущиеДанные.след_СледующаяЛокация КАК след_СледующаяЛокация,
	|	стоки_ТекущиеДанные.след_КритерийОкончанияПользования КАК след_КритерийОкончанияПользования,
	|	стоки_ТекущиеДанные.тек_СтокСдачи КАК тек_СтокСдачи,
	|	стоки_ТекущиеДанные.тек_ИнструкцияПоСдаче КАК тек_ИнструкцияПоСдаче,
	|	стоки_ТекущиеДанные.тек_СледНазначения КАК тек_СледНазначения,
	|	стоки_ТекущиеДанные.тек_ЛокацияСдачи КАК тек_ЛокацияСдачи,
	|	стоки_ТекущиеДанные.тек_ПунктыОкончСдачи КАК тек_ПунктыОкончСдачи,
	|	стоки_ТекущиеДанные.тек_Примечание КАК тек_Примечание,
	|	стоки_ТекущиеДанные.тек_НачалоРемонта КАК тек_НачалоРемонта,
	|	стоки_ТекущиеДанные.тек_ОкончаниеРемонта КАК тек_ОкончаниеРемонта,
	|	стоки_ТекущиеДанные.ИсточникЗаписи КАК ИсточникЗаписи,
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|	стоки_ТекущиеДанные.тек_СобственностьКТК КАК тек_СобственностьКТК,
	//ок)
	|	стоки_ТекущиеДанные.Удалитьтек_СобственностьКТК КАК Удалитьтек_СобственностьКТК,
	|	стоки_ТекущиеДанные.тек_ПринадлежностьТЕ КАК тек_ПринадлежностьТЕ,
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|	стоки_ТекущиеДанные.тек_ГородВзятия КАК тек_ГородВзятия,
	|	стоки_ТекущиеДанные.тек_СтокВзятия КАК тек_СтокВзятия,
	|	стоки_ТекущиеДанные.тек_СправкаЦФТО КАК тек_СправкаЦФТО,
	|	стоки_ТекущиеДанные.тек_РешениеТО КАК тек_РешениеТО,
	|	стоки_ТекущиеДанные.тек_КомментарийСВВ КАК тек_КомментарийСВВ,
	|	стоки_ТекущиеДанные.тек_НазначенныйРейс КАК тек_НазначенныйРейс,
	|	стоки_ТекущиеДанные.тек_СрокАктуальностиРейса КАК тек_СрокАктуальностиРейса,
	|	стоки_ТекущиеДанные.тек_DPP КАК тек_DPP,
	|	стоки_ТекущиеДанные.тек_СтоимостьПодлежащаяВозмещению КАК тек_СтоимостьПодлежащаяВозмещению,
	|	стоки_ТекущиеДанные.тек_ПослеИспользования КАК тек_ПослеИспользования,
	|	стоки_ТекущиеДанные.тек_ВалютаDPP КАК тек_ВалютаDPP,
	|	стоки_ТекущиеДанные.тек_ВалютаСтоимости КАК тек_ВалютаСтоимости,
	|	стоки_ТекущиеДанные.тек_ТребуетсяРемонт КАК тек_ТребуетсяРемонт,
	|	стоки_ТекущиеДанные.тек_СтоимостьРемонта КАК тек_СтоимостьРемонта,
	|	стоки_ТекущиеДанные.тек_ВалютаРемонта КАК тек_ВалютаРемонта,
	|	стоки_ТекущиеДанные.Инвентаризация КАК Инвентаризация,
	|	стоки_ТекущиеДанные.КомментарийКИнвентаризации КАК КомментарийКИнвентаризации
	|ИЗ
	|	РегистрСведений.стоки_ТекущиеДанные КАК стоки_ТекущиеДанные
	|ГДЕ
	|	НЕ стоки_ТекущиеДанные.КТК В (&МассивКТК)
	|	И стоки_ТекущиеДанные.ИсточникЗаписи = &Заявка"; 
	
	Запрос.УстановитьПараметр("МассивКТК", СоставУслуги.Выгрузить().ВыгрузитьКолонку("НомерКТК"));
	Запрос.УстановитьПараметр("Заявка", "Заявка " + Номер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			МЗ = РегистрыСведений.стоки_ТекущиеДанные.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ, Выборка);
			МЗ.Удалить();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры //ДИТ Авдеева В.С. 53975 16.08.2022 Конец 

// ++ Евросиб Дудоров С.В. US 57543 30.01.2023  
#КонецОбласти

Функция	ИзменятьРефСцепПоЗаявке()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаСоставУслуги.НомерКТК КАК Контейнер,
		|	ЗаявкаСоставУслуги.Ссылка.Отправка КАК Отправка,
		|	ЗаявкаСоставУслуги.Ссылка.Прибытие КАК Прибытие,
		|	ЗаявкаСоставУслуги.СтанцияОтправления КАК СтанцияОтправления,
		|	ЗаявкаСоставУслуги.СтанцияНазначения КАК СтанцияНазначения,
		|	ЗаявкаСоставУслуги.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
		|	ЗаявкаСоставУслуги.ВесГрузаНетто КАК ВесГрузаНетто,
		|	ЗаявкаСоставУслуги.КоличествоМест КАК КоличествоМест,
		|	ЗаявкаСоставУслуги.Ссылка.Контрагент КАК Контрагент,
		|	ЗаявкаСоставУслуги.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	ЗаявкаСоставУслуги.Груженый КАК Груженый
		|ИЗ
		|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|ГДЕ
		|	ЗаявкаСоставУслуги.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РеквизитыНаИзменениеВБазе = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаСоставУслуги.НомерКТК КАК Контейнер,
		|	&Отправка КАК Отправка,
		|	&Прибытие КАК Прибытие,
		|	ЗаявкаСоставУслуги.СтанцияОтправления КАК СтанцияОтправления,
		|	ЗаявкаСоставУслуги.СтанцияНазначения КАК СтанцияНазначения,
		|	ЗаявкаСоставУслуги.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
		|	ЗаявкаСоставУслуги.ВесГрузаНетто КАК ВесГрузаНетто,
		|	ЗаявкаСоставУслуги.КоличествоМест КАК КоличествоМест,
		|	&Контрагент КАК Контрагент,
		|	ЗаявкаСоставУслуги.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	ЗаявкаСоставУслуги.Груженый КАК Груженый
		|ПОМЕСТИТЬ вт_ДанныеЗаявки
		|ИЗ
		|	&тзУслуги КАК ЗаявкаСоставУслуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаявкаСоставУслуги.Контейнер КАК Контейнер,
		|	ЗаявкаСоставУслуги.Отправка КАК Отправка,
		|	ЗаявкаСоставУслуги.Прибытие КАК Прибытие,
		|	ЗаявкаСоставУслуги.СтанцияОтправления КАК СтанцияОтправления,
		|	ЗаявкаСоставУслуги.СтанцияНазначения КАК СтанцияНазначения,
		|	ЗаявкаСоставУслуги.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
		|	ЗаявкаСоставУслуги.ВесГрузаНетто КАК ВесГрузаНетто,
		|	ЗаявкаСоставУслуги.КоличествоМест КАК КоличествоМест,
		|	ЗаявкаСоставУслуги.Контрагент КАК Контрагент,
		|	ЗаявкаСоставУслуги.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	ЗаявкаСоставУслуги.Груженый КАК Груженый
		|ИЗ
		|	вт_ДанныеЗаявки КАК ЗаявкаСоставУслуги";
	
	Запрос.УстановитьПараметр("тзУслуги", СоставУслуги.Выгрузить());
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Отправка", Отправка);
	Запрос.УстановитьПараметр("Прибытие", Прибытие);
	
	РеквизитыНаИзменениеНаФорме = Запрос.Выполнить().Выгрузить();
	
	Возврат не ОбщегоНазначения.КоллекцииИдентичны(РеквизитыНаИзменениеВБазе, РеквизитыНаИзменениеНаФорме);
	
КонецФункции

//ДИТ, Беляев СЮ, BUG 72360, 24-07-2023, начало
Процедура ОбработатьРелизыКлиента( МассивРелизовКлиента )
	Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(МассивРелизовКлиента);
	Для Каждого ЭлМассива Из МассивРелизовКлиента Цикл
		//ДИТ, Беляев СЮ, BUG 72360, 29-12-2023, начало (потенциальная ошибка, если тип будет определён, а ссылка пустая)
		Если ЭлМассива = Документы.РелизКлиента.ПустаяСсылка() Тогда
			Продолжить;
		КонецЕсли;
		//ДИТ, Беляев СЮ, BUG 72360, 29-12-2023, начало
		РелизКлиентаОбъект = ЭлМассива.ПолучитьОбъект();
		Если НЕ РелизКлиентаОбъект.Проведен Тогда
			Продолжить;
		КонецЕсли;
		Попытка
			РелизКлиентаОбъект.ВыполнитьЗаписьВКлиентскоеОперированиеПоДокументу();
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Не удалось внести изменения в регистр АРМ КТК: Клиентское оперирование");
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры
//ДИТ, Беляев СЮ, BUG 72360, 24-07-2023, конец

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Евросиб Коханенко Н.А. 23.04.2025 (( #72788
	КонстантаАвтозаполнениеОфисаПродажСДаты = Константы.АвтозаполнениеОфисаПродажСДаты.Получить();
	Если Дата >= КонстантаАвтозаполнениеОфисаПродажСДаты Тогда
		ОбязательностьПоляОфисПродаж = Истина;
	Иначе
		ОбязательностьПоляОфисПродаж = Ложь;
	КонецЕсли;	
	//Евросиб Коханенко Н.А. 23.04.2025 )) #72788 
	
	//Евросиб Коханенко Н.А. 29.05.2024 (( #83866
	//не проверяем заполнение для "серых" строк с КТК, перенесенными в другую заявку
	Для Каждого СтрокаСУ из СоставУслуги Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаСУ.ПеренесенВЗаявку)
				//Евросиб Коханенко Н.А. 14.02.2025 (( #101467 
	            И СтрокаСУ.Статус = ПредопределенноеЗначение("Перечисление.СтатусыСтрокЗаявки.ВРаботе")
				//Евросиб Коханенко Н.А. 14.02.2025 )) #101467 
				И НЕ ЗначениеЗаполнено(СтрокаСУ.Калькуляция) Тогда
			ТекстСообщения = СтрШаблон("Не заполнено значение колонки 'Калькуляция' в строке %1 списка 'Состав услуги'", СтрокаСУ.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, 
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СоставУслуги", СтрокаСУ.НомерСтроки, "Калькуляция"),,Отказ);
		КонецЕсли; 
	КонецЦикла;
	//Евросиб Коханенко Н.А. 29.05.2024 )) #83866   
	
	// Евросиб(ДИТ) US 84968 ТА 85632 Сержантова А.С. Начало: 12.09.2024
	Для каждого СтрРейса Из ПереченьРейсов Цикл
		Если ТипЗнч(СтрРейса.Рейс) = Тип("СправочникСсылка.РейсыМоре") 
			и ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрРейса.Рейс, "ПометкаУдаления") Тогда
		    ТекстСообщения = СтрШаблон("Морской рейс помечен на удаление в строке %1 списка 'Перечень рейсов'. Выберите другой актуальный рейс. Документ не проведен", СтрРейса.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, 
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ПереченьРейсов", СтрРейса.НомерСтроки, "Рейс"),,Отказ); 
		КонецЕсли;
	КонецЦикла;
	// Евросиб(ДИТ) US 84968 ТА 85632 Сержантова А.С. Конец: 12.09.2024
	
	//Евросиб Коханенко Н.А. 12.02.2026 (( #93365
	Отказ = ПроверкаСоответствияЗначенийРеквизитовЗаявкиКалькуляцииПСЦ(Отказ);
	//Евросиб Коханенко Н.А. 12.02.2026 )) #93365 

	//Евросиб(ДИТ), Беляев СЮ, BUG 93345 / TA 96388, 25-11-2024, начало (закомментировал)
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ЗаявкаСоставУслуги.НомерСтроки КАК НомерСтроки,
	//|	ЗаявкаСоставУслуги.ВидСобственности КАК ВидСобственности,
	//|	ЗаявкаСоставУслуги.НомерКТК КАК НомерКТК
	//|ПОМЕСТИТЬ ВТ_СоставУслуги
	//|ИЗ
	//|	&СоставУслуги КАК ЗаявкаСоставУслуги
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	стоки_ТекущиеДанныеСрезПоследних.КТК КАК КТК,
	//|	стоки_ТекущиеДанныеСрезПоследних.тек_ВидСобственности КАК тек_ВидСобственности,
	//|	стоки_ТекущиеДанныеСрезПоследних.тек_ВЭксплуатации КАК тек_ВЭксплуатации
	//|ПОМЕСТИТЬ ВТ_СтокиТекущиеДанные
	//|ИЗ
	//|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(, КТК В (&СписокКТК)) КАК стоки_ТекущиеДанныеСрезПоследних
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ЗаявкаСоставУслуги.НомерКТК КАК НомерКТК,
	//|	ЗаявкаСоставУслуги.ВидСобственности КАК ВидСобственности,
	//|	ЗаявкаСоставУслуги.НомерСтроки КАК НомерСтроки
	//|ИЗ
	//|	ВТ_СоставУслуги КАК ЗаявкаСоставУслуги
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтокиТекущиеДанные КАК ВТ_СтокиТекущиеДанные
	//|		ПО ЗаявкаСоставУслуги.НомерКТК = ВТ_СтокиТекущиеДанные.КТК
	//|ГДЕ
	//|	ЗаявкаСоставУслуги.ВидСобственности = ЗНАЧЕНИЕ(Перечисление.ВариантыСобственности.Клиентский)
	//|	И ЕСТЬNULL(ВТ_СтокиТекущиеДанные.тек_ВЭксплуатации, ЛОЖЬ)
	//|	И НЕ ВТ_СтокиТекущиеДанные.тек_ВидСобственности = ЗНАЧЕНИЕ(Перечисление.ВариантыСобственности.Клиентский)
	//|	И НЕ ВТ_СтокиТекущиеДанные.тек_ВидСобственности = ЗНАЧЕНИЕ(Перечисление.ВариантыСобственности.ПустаяСсылка)";
	//Запрос.УстановитьПараметр("СоставУслуги", СоставУслуги.Выгрузить());
	//Запрос.УстановитьПараметр("СписокКТК", СоставУслуги.ВыгрузитьКолонку("НомерКТК"));
	//РезультатЗапроса = Запрос.Выполнить();
	//Если НЕ РезультатЗапроса.Пустой() Тогда
	//	Выборка = РезультатЗапроса.Выбрать();
	//	Пока Выборка.Следующий() Цикл 
	//		ТекстСообщенияОбОшибке = СтрШаблон("Контейнер в строке %1 имеется в АРМ КТК с открытым подрядческим циклом и отличным от указанного в заявке видом собственности.
	//		|Обратитесь к сотрудникам контейнерной группы ОРП для завершения предыдущего цикла пользования контейнера", Выборка.НомерСтроки);
	//		ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияОбОшибке, ЭтотОбъект, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СоставУслуги", Выборка.НомерСтроки, "ВидСобственности"),,Отказ);
	//	КонецЦикла;
	//КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, BUG 93345 / TA 96388, 25-11-2024, конец
КонецПроцедуры
// -- Евросиб Дудоров С.В. US 57543 30.01.2023

//Евросиб(ДИТ), Беляев СЮ, BUG 93345 / TA 96388, 25-11-2024, начало
Функция КонтейнерыСОткрытымЦиклом()
	
	МассивКонтейнеров = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаСоставУслуги.НомерСтроки КАК НомерСтроки,
	|	ЗаявкаСоставУслуги.НомерКТК КАК НомерКТК
	|ПОМЕСТИТЬ ВТ_СоставУслуги
	|ИЗ
	|	&СоставУслуги КАК ЗаявкаСоставУслуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	стоки_ТекущиеДанныеСрезПоследних.КТК КАК КТК,
	|	стоки_ТекущиеДанныеСрезПоследних.тек_ВЭксплуатации КАК тек_ВЭксплуатации
	|ПОМЕСТИТЬ ВТ_СтокиТекущиеДанные
	|ИЗ
	|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(, КТК В (&СписокКТК)) КАК стоки_ТекущиеДанныеСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкаСоставУслуги.НомерКТК КАК НомерКТК,
	|	ЗаявкаСоставУслуги.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ВТ_СоставУслуги КАК ЗаявкаСоставУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтокиТекущиеДанные КАК ВТ_СтокиТекущиеДанные
	|		ПО ЗаявкаСоставУслуги.НомерКТК = ВТ_СтокиТекущиеДанные.КТК
	|ГДЕ
	|	ЕСТЬNULL(ВТ_СтокиТекущиеДанные.тек_ВЭксплуатации, ЛОЖЬ)";
	
	Запрос.УстановитьПараметр("СоставУслуги", СоставУслуги.Выгрузить());
	Запрос.УстановитьПараметр("СписокКТК", СоставУслуги.ВыгрузитьКолонку("НомерКТК"));
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		МассивКонтейнеров = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("НомерКТК");
	КонецЕсли;
	
	Возврат МассивКонтейнеров;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, BUG 93345 / TA 96388, 25-11-2024, конец

// ДИТ US 81881 ТА 83581 Сержантова А.С. 08.04.2024 
//Если изменились рейсы, то обновляем данные в запросах на авто (Терминал выдачи и Дата и время подачи КТК)
Процедура ПроверитьЗапросНаАвтоСоздатьЗадачуНаОбновление()

	// проверяем есть ли не помеченные на удаление запросы на авто, в которых есть строки из данной заявки    
	КлючиВЗаявке = СоставУслуги.ВыгрузитьКолонку("КлючАналитикиПеревозки");  
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КлючиВЗаявке, ТранспортныеСредства.ВыгрузитьКолонку("КлючАналитикиПеревозки"));  
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КлючиВЗаявке, ТранспортныеСредстваПоследняяМиля.ВыгрузитьКолонку("КлючАналитикиПеревозки"));
	
	Запрос = Новый Запрос;
	// Евросиб(ДИТ) BUG 87051 Сержантова А.С. Начало: 20.06.2024
	// Было:
	//Запрос.Текст = 
		//"ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	ЗапросНаАвтоперевозкуКонтейнеры.Ссылка КАК ЗапросНаАвто
		//|ИЗ
		//|	Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
		//|ГДЕ
		//|	НЕ ЗапросНаАвтоперевозкуКонтейнеры.Ссылка.ПометкаУдаления
		//|	И ЗапросНаАвтоперевозкуКонтейнеры.КлючАналитикиПеревозки В(&КлючиВЗаявке)";
	//Стало:
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗапросНаАвтоперевозкуКонтейнеры.Ссылка КАК ЗапросНаАвто
		|ИЗ
		|	Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
		|ГДЕ
		|	НЕ ЗапросНаАвтоперевозкуКонтейнеры.Ссылка.ПометкаУдаления
		|	И ЗапросНаАвтоперевозкуКонтейнеры.КлючАналитикиПеревозки В(&КлючиВЗаявке)
		|	И ЗапросНаАвтоперевозкуКонтейнеры.Ссылка.Заявка = &Заявка
		|	И ЗапросНаАвтоперевозкуКонтейнеры.КлючАналитикиПеревозки <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиПеревозки.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Заявка", Ссылка);
	// Евросиб(ДИТ) BUG 87051 Сержантова А.С. Конец: 20.06.2024
	Запрос.УстановитьПараметр("КлючиВЗаявке", КлючиВЗаявке);
	
	Результат = Запрос.Выполнить();
	Если не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();  
		СостояниеДляЗадачиОбновления = Справочники.Состояния.НеобходимоОбновитьДанные;
		Пока Выборка.Следующий() Цикл
			ОбъектЗапросаНаАвто = Выборка.ЗапросНаАвто.ПолучитьОбъект();
			ЗадачаОбновленияДобавлена = Ложь;
			Для каждого СтрСостояния Из ОбъектЗапросаНаАвто.Состояния Цикл
				Если СтрСостояния.Состояние = СостояниеДляЗадачиОбновления Тогда
					СтрСостояния.Статус = Перечисления.СтатусыЭтапов.ВРаботе;
					СтрСостояния.НачалоРаботы = ТекущаяДата(); 
					ЗадачаОбновленияДобавлена = Истина;
				КонецЕсли;
			КонецЦикла;  
			Если не ЗадачаОбновленияДобавлена Тогда
				//Применить к запросу на авто маршрут
				ПараметрыЗапроса = Новый Соответствие;
				РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьЗапросНаАвто(ПараметрыЗапроса, ОбъектЗапросаНаАвто.Дата);
				Если РезультатЗапроса.Количество() > 0 Тогда
					Если РезультатЗапроса.Количество() > 0 Тогда
						МаршрутизацияСервер.ПрименитьМаршрут(ОбъектЗапросаНаАвто, РезультатЗапроса, ОбъектЗапросаНаАвто.Автор, Новый СписокЗначений); 
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;
			ОбъектЗапросаНаАвто.Записать();
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры  

// ДИТ US 81881 ТА 83581 Сержантова А.С. 09.04.2024 
Процедура УдалитьИзМассиваАвтомобильныеРейсы(МассивРейсов)
	
	Счетчик = МассивРейсов.Количество() - 1;
	Пока Счетчик >= 0 Цикл
		Если ТипЗнч(МассивРейсов[Счетчик]) <> Тип("СправочникСсылка.РейсыЖД")
			и ТипЗнч(МассивРейсов[Счетчик]) <> Тип("СправочникСсылка.РейсыМоре") Тогда
		    МассивРейсов.Удалить(Счетчик);
		КонецЕсли;	
	    Счетчик = Счетчик - 1;
	КонецЦикла;

КонецПроцедуры

// Евросиб US 88665 TA 88668 Рыбьяков К.А. 02.12.2024 ((
Процедура ПроверитьЗаписиВДоплатныхБлокахПоРелизамСобственника()
	
	ДанныеЗаписи = Новый Массив;
	
	РезультатЗапросаСоставУслуги = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "СоставУслуги");
	СоставУслугиДоИзменений = РезультатЗапросаСоставУслуги.Выгрузить();
	Для Каждого Строка Из СоставУслугиДоИзменений Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("ГУИДСтроки", Строка.ГУИДСтроки);
		НайденныеСтроки = СоставУслуги.НайтиСтроки(Отбор);
		ОкончаниеПользования = Строка.ДатаВыдачи + 86400 * Строка.НормативноеИспользование;
		Если НайденныеСтроки.Количество() > 0 Тогда
			Для Каждого СтрокаНайденная Из НайденныеСтроки Цикл
				Если СтрокаНайденная.НомерКТК <> Строка.НомерКТК 
					ИЛИ СтрокаНайденная.СтокВыдачи <> Строка.СтокВыдачи Тогда
					РезультатСтруктура = Документы.Заявка.ПодобратьРелизСобственника(Строка.СтокВыдачи, 
																					Строка.НомерКТК, 
																					ОкончаниеПользования, 
																					Строка.ДатаВозвратаКлиентом,
																					Ссылка);
					Если РезультатСтруктура.ДанныеДобавленияВРелизСобственника.Количество() > 0 Тогда
						Для Каждого ЭлементМассива Из РезультатСтруктура.ДанныеДобавленияВРелизСобственника Цикл
							КлючОбъект = ЭлементМассива.КлючАналитикиСтрокиРелиза.ПолучитьОбъект();
							КлючОбъект.СтокВыдачи = Справочники.Локации.ПустаяСсылка();
							КлючОбъект.ДатаВозвратаКлиентом = Дата('00010101');
							КлючОбъект.Записать();
						КонецЦикла;
					КонецЕсли;
					ОкончаниеПользования = СтрокаНайденная.ДатаВыдачи + 86400 * СтрокаНайденная.НормативноеИспользование;
					РезультатСтруктура = Документы.Заявка.ПодобратьРелизСобственника(СтрокаНайденная.СтокВыдачи, 
																					СтрокаНайденная.НомерКТК, 
																					ОкончаниеПользования, 
																					СтрокаНайденная.ДатаВозвратаКлиентом,
																					Ссылка);
					Если РезультатСтруктура.ДанныеДобавленияВРелизСобственника.Количество() > 0 Тогда
						Для Каждого ЭлементМассива Из РезультатСтруктура.ДанныеДобавленияВРелизСобственника Цикл
							Данные = Новый Структура;
							Данные.Вставить("Локация", ЭлементМассива.Локация);
							Данные.Вставить("РелизСобственника", ЭлементМассива.РелизСобственника);
							Данные.Вставить("КлючАналитикиСтрокиРелиза", ЭлементМассива.КлючАналитикиСтрокиРелиза);
							Данные.Вставить("ДатаСдачи", ЭлементМассива.ДатаСдачи);
							Данные.Вставить("ГУИДСтроки", ЭлементМассива.ГУИДСтроки);
							Данные.Вставить("КлючАналитикиПеревозки", ЭлементМассива.КлючАналитикиПеревозки);
							ДанныеЗаписи.Добавить(Данные);
						КонецЦикла;
						Документы.Заявка.ДобавитьДанныеВКлючАналитикиСтрокиРелизаСобственника(ДанныеЗаписи);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		Иначе
			РезультатСтруктура = Документы.Заявка.ПодобратьРелизСобственника(Строка.СтокВыдачи, 
																			Строка.НомерКТК, 
																			ОкончаниеПользования, 
																			Строка.ДатаВозвратаКлиентом,
																			Ссылка);
			Если РезультатСтруктура.ДанныеДобавленияВРелизСобственника.Количество() > 0 Тогда
				Для Каждого ЭлементМассива Из РезультатСтруктура.ДанныеДобавленияВРелизСобственника Цикл
					КлючОбъект = ЭлементМассива.КлючАналитикиСтрокиРелиза.ПолучитьОбъект();
					КлючОбъект.СтокВыдачи = Справочники.Локации.ПустаяСсылка();
					КлючОбъект.ДатаВозвратаКлиентом = Дата('00010101');
					КлючОбъект.Записать();
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
// Евросиб Рыбьяков К.А. 02.12.2024 )) 

//Евросиб Коханенко Н.А. 10.06.2025 (( #93365 
Функция ПолучитьРезультатПроверкиНаОшибкиПринадлежностиКТКИЗаполненностиСтавокВКалькуляций()

	ТабЧастьСоставУслуги = СоставУслуги.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТабЧастьСоставУслуги.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
		|	ТабЧастьСоставУслуги.РазмерКТК КАК РазмерКТК,
		|	ТабЧастьСоставУслуги.Калькуляция КАК Калькуляция
		|ПОМЕСТИТЬ ДанныеДляПроверки
		|ИЗ
		|	&ТабЧастьСоставУслуги КАК ТабЧастьСоставУслуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ КалькуляцииСЗаполненнойСтавкой20
		|ИЗ
		|	Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДляПроверки КАК ЗаявкаСоставУслуги
		|		ПО (ЗаявкаСоставУслуги.Калькуляция = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка)
		|			И (КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Цена20 > 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ КалькуляцииСЗаполненнойСтавкой40
		|ИЗ
		|	Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДляПроверки КАК ЗаявкаСоставУслуги
		|		ПО (ЗаявкаСоставУслуги.Калькуляция = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка)
		|			И (КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Цена40 > 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаявкаСоставУслуги.Калькуляция КАК Калькуляция,
		|	ДокКалькуляция.ММ_ИтогоСтавка20 КАК ММ_ИтогоСтавка20,
		|	ДокКалькуляция.ММ_ИтогоСтавка КАК ММ_ИтогоСтавка,
		|	ДокКалькуляция.Номер КАК Номер
		|ИЗ
		|	ДанныеДляПроверки КАК ЗаявкаСоставУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция КАК ДокКалькуляция
		|			ЛЕВОЕ СОЕДИНЕНИЕ КалькуляцииСЗаполненнойСтавкой20 КАК КалькуляцииСЗаполненнойСтавкой20
		|			ПО (КалькуляцииСЗаполненнойСтавкой20.Ссылка = ДокКалькуляция.Ссылка)
		|			ЛЕВОЕ СОЕДИНЕНИЕ КалькуляцииСЗаполненнойСтавкой40 КАК КалькуляцииСЗаполненнойСтавкой40
		|			ПО (КалькуляцииСЗаполненнойСтавкой40.Ссылка = ДокКалькуляция.Ссылка)
		|		ПО ЗаявкаСоставУслуги.Калькуляция = ДокКалькуляция.Ссылка
		|ГДЕ
		|	ДокКалькуляция.ТипКалькуляции <> ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого)
		|	И ДокКалькуляция.ТипКалькуляции <> ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПССТарифом)
		|	И (ЗаявкаСоставУслуги.ПринадлежностьТЕ = ЗНАЧЕНИЕ(Перечисление.ПринадлежностьТЕ.КТКлиента)
		|				И НЕ ДокКалькуляция.веб_ДляКТККлиента
		|			ИЛИ ЗаявкаСоставУслуги.ПринадлежностьТЕ = ЗНАЧЕНИЕ(Перечисление.ПринадлежностьТЕ.КТЕвросиба)
		|				И НЕ ДокКалькуляция.веб_ДляКТКЕвросиб)
		|			ИЛИ ЗаявкаСоставУслуги.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
		|				И КалькуляцииСЗаполненнойСтавкой20.Ссылка ЕСТЬ NULL
		|				И ДокКалькуляция.ММ_ИтогоСтавка20 = 0
		|			ИЛИ (ЗаявкаСоставУслуги.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К40)
		|				ИЛИ ЗаявкаСоставУслуги.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К45))
		|				И КалькуляцииСЗаполненнойСтавкой40.Ссылка ЕСТЬ NULL
		|				И ДокКалькуляция.ММ_ИтогоСтавка = 0
		|	 		
		|";
	
	Запрос.УстановитьПараметр("ТабЧастьСоставУслуги", ТабЧастьСоставУслуги);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Ложь;
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТекстСообщения = СтрШаблон("В калькуляции %1 в разделе 1.3 не определена ставка для указанного размера и принадлежности КТК.", Выборка.Номер);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Результат = Истина;
	КонецЦикла; 
	
	Возврат Результат;

КонецФункции //Евросиб Коханенко Н.А. 10.06.2025 )) #93365

//Евросиб Коханенко Н.А. 12.02.2026 (( #93365
Функция СформироватьТекстСообщенияОНесоответствииЗначенийРеквизитов(ДокументСравнения, НомерДокументаСравнения, МассивРеквизитов)

	КоличествоРеквизитовБольшеОдного = МассивРеквизитов.Количество() > 1; 
	КоличествоРеквизитовРавноДва = МассивРеквизитов.Количество() = 2;
	ТекстСообщения = СтрШаблон("В %1 № %2 пол%3 %4 не совпада%5т с аналогичным%6 пол%3м%6 в заявке. Необходимо внести изменения.", 
	ДокументСравнения,
	ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(НомерДокументаСравнения),
		?(КоличествоРеквизитовБольшеОдного, "я", "е"),
		СтрСоединить(МассивРеквизитов, ?(КоличествоРеквизитовРавноДва, " и ", ", ")),
		?(КоличествоРеквизитовБольшеОдного, "ю", "е"),
		?(КоличествоРеквизитовБольшеОдного, "и", ""));
	Возврат ТекстСообщения;
	
КонецФункции 

//Евросиб Коханенко Н.А. 12.02.2026 (( #93365
Функция ПроверкаСоответствияЗначенийРеквизитовЗаявкиКалькуляцииПСЦ(Отказ);
	
	ОтказРезультат = Отказ;
	
	//для начала найдем все модифицированные реквизиты
	ПроверяемыеРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Контрагент, Договор, ВидПеревозки");
	ИзмененныеРеквизиты = Новый Массив;
	Для Каждого Реквизит Из ПроверяемыеРеквизиты Цикл
		Если ЭтотОбъект[Реквизит.Ключ] <> Реквизит.Значение Тогда
			Проверять = Истина;
		Иначе
			Проверять = Ложь;
		КонецЕсли;
		ИзмененныеРеквизиты.Добавить(Новый Структура("Проверять, Ключ, Значение", Проверять, Реквизит.Ключ, Реквизит.Значение));
	КонецЦикла;
	
	//если что-то из нашего списка менялось, то сравним с реквизитами в калькуляциях и ПСЦ
	Если ИзмененныеРеквизиты.Количество() > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ДокументКалькуляция.Ссылка КАК Ссылка,
			|	ДокументКалькуляция.Номер КАК Номер,
			|	ДокументКалькуляция.Контрагент КАК Контрагент,
			|	ДокументКалькуляция.Договор КАК Договор,
			|	ЗначенияДополнительныхАналитикДокументовКалькуляции.Значение КАК ТранзитДляКлиента
			|ПОМЕСТИТЬ вт_СвязанныеКалькуляции
			|ИЗ
			|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция КАК ДокументКалькуляция
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхАналитикДокументов КАК ЗначенияДополнительныхАналитикДокументовКалькуляции
			|			ПО (ЗначенияДополнительныхАналитикДокументовКалькуляции.Документ = ДокументКалькуляция.Ссылка)
			|				И (ЗначенияДополнительныхАналитикДокументовКалькуляции.Аналитика = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеАналитикиДокументов.ТранзитДляКлиента))
			|		ПО ЗаявкаСоставУслуги.Калькуляция = ДокументКалькуляция.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК Заявка
			|		ПО ЗаявкаСоставУслуги.Ссылка = Заявка.Ссылка
			|			И (Заявка.Проведен)
			|			И (Заявка.Ссылка = &Заявка)
			|			И (ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ДокументПСЦ.Ссылка КАК Ссылка,
			|	ДокументПСЦ.Номер КАК Номер,
			|	ДокументПСЦ.Контрагент КАК Контрагент,
			|	ДокументПСЦ.Договор КАК Договор,
			|	ДокументПСЦ.ВидПеревозки КАК ВидПеревозки
			|ПОМЕСТИТЬ вт_СвязанныеПСЦ
			|ИЗ
			|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПСЦ КАК ДокументПСЦ
			|		ПО ЗаявкаСоставУслуги.ПСЦ = ДокументПСЦ.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК Заявка
			|		ПО ЗаявкаСоставУслуги.Ссылка = Заявка.Ссылка
			|			И (Заявка.Проведен)
			|			И (Заявка.Ссылка = &Заявка)
			|			И (ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	вт_СвязанныеПСЦ.Номер КАК Номер,
			|	&ПроверятьКонтрагент
			|		И вт_СвязанныеПСЦ.Контрагент <> &Контрагент КАК ОшибкаКонтрагент,
			|	&ПроверятьДоговор
			|		И вт_СвязанныеПСЦ.Договор <> &Договор КАК ОшибкаДоговор,
			|	&ПроверятьВидПеревозки
			|		И вт_СвязанныеПСЦ.ВидПеревозки <> &ВидПеревозки КАК ОшибкаВидПеревозки
			|ИЗ
			|	вт_СвязанныеПСЦ КАК вт_СвязанныеПСЦ
			|ГДЕ
			|	(&ПроверятьКонтрагент
			|				И вт_СвязанныеПСЦ.Контрагент <> &Контрагент
			|			ИЛИ &ПроверятьДоговор
			|				И вт_СвязанныеПСЦ.Договор <> &Договор
			|			ИЛИ &ПроверятьВидПеревозки
			|				И вт_СвязанныеПСЦ.ВидПеревозки <> &ВидПеревозки)
			|
			|УПОРЯДОЧИТЬ ПО
			|	Номер
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	вт_СвязанныеКалькуляции.Номер КАК Номер,
			|	&ПроверятьКонтрагент
			|		И вт_СвязанныеКалькуляции.Контрагент <> &Контрагент КАК ОшибкаКонтрагент,
			|	&ПроверятьДоговор
			|		И вт_СвязанныеКалькуляции.Договор <> &Договор КАК ОшибкаДоговор,
			|	&ПроверятьТранзитДляКлиента
			|		И вт_СвязанныеКалькуляции.ТранзитДляКлиента <> &ТранзитДляКлиента КАК ОшибкаТранзитДляКлиента
			|ИЗ
			|	вт_СвязанныеКалькуляции КАК вт_СвязанныеКалькуляции
			|ГДЕ
			|	(&ПроверятьКонтрагент
			|				И вт_СвязанныеКалькуляции.Контрагент <> &Контрагент
			|			ИЛИ &ПроверятьДоговор
			|				И вт_СвязанныеКалькуляции.Договор <> &Договор
			|			ИЛИ &ПроверятьТранзитДляКлиента
			|				И вт_СвязанныеКалькуляции.ТранзитДляКлиента <> &ТранзитДляКлиента)
			|
			|УПОРЯДОЧИТЬ ПО
			|	Номер";
		
		Запрос.УстановитьПараметр("Заявка", Ссылка);
		Для Каждого Параметр Из ИзмененныеРеквизиты Цикл
			Запрос.УстановитьПараметр("Проверять" + Параметр.Ключ, Параметр.Проверять);
			Запрос.УстановитьПараметр(Параметр.Ключ, ЭтотОбъект[Параметр.Ключ]);
		КонецЦикла; 
		//пока непонятно, как проверять этот реквизит
		Запрос.УстановитьПараметр("ПроверятьТранзитДляКлиента", Ложь);
		Запрос.УстановитьПараметр("ТранзитДляКлиента", Неопределено);
		Результат = Запрос.ВыполнитьПакет();
		ВыборкаПСЦ = Результат[2].Выбрать();
		Пока ВыборкаПСЦ.Следующий() Цикл
			МассивРеквизитов = Новый Массив;
			Если ВыборкаПСЦ.ОшибкаКонтрагент Тогда МассивРеквизитов.Добавить("Контрагент") КонецЕсли;
			Если ВыборкаПСЦ.ОшибкаДоговор Тогда МассивРеквизитов.Добавить("Договор") КонецЕсли;
			Если ВыборкаПСЦ.ОшибкаВидПеревозки Тогда МассивРеквизитов.Добавить("ВидПеревозки") КонецЕсли;
			ОбщегоНазначения.СообщитьПользователю(СформироватьТекстСообщенияОНесоответствииЗначенийРеквизитов("ПСЦ", ВыборкаПСЦ.Номер, МассивРеквизитов));
			РезультатОтказ = Истина;
		КонецЦикла;   
		ВыборкаКалькуляции = Результат[3].Выбрать();
		Пока ВыборкаКалькуляции.Следующий() Цикл
			МассивРеквизитов = Новый Массив;
			Если ВыборкаКалькуляции.ОшибкаКонтрагент Тогда МассивРеквизитов.Добавить("Контрагент") КонецЕсли;
			Если ВыборкаКалькуляции.ОшибкаДоговор Тогда МассивРеквизитов.Добавить("Договор") КонецЕсли;
			Если ВыборкаКалькуляции.ОшибкаТранзитДляКлиента Тогда МассивРеквизитов.Добавить("ТранзитДляКлиента") КонецЕсли;
			ОбщегоНазначения.СообщитьПользователю(СформироватьТекстСообщенияОНесоответствииЗначенийРеквизитов("Калькуляции", ВыборкаКалькуляции.Номер, МассивРеквизитов));
			РезультатОтказ = Истина;
		КонецЦикла; 
	КонецЕсли;
	
	Возврат РезультатОтказ;

КонецФункции //Евросиб Коханенко Н.А. 12.02.2026 )) #93365 

НеПроверятьВидСобственностиКТК = Ложь;
