Процедура СформироватьДвиженияРазнесениеСуммРасходов(ОбъектАкцепт) Экспорт 
	
	ОбъектАкцепт.Движения.РазнесениеСуммРасходов.Записывать = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АкцептУслуги.Ссылка КАК Регистратор,
	|	АкцептУслуги.Ссылка.Дата КАК Период,
	|	АкцептУслуги.Сделка КАК Сделка,
	|	АкцептУслуги.ИдентификаторСтрокиРасходовВСделке КАК ГУИДРасходов,
	|	АкцептУслуги.ПоступлениеЦена КАК Сумма,
	|	АкцептУслуги.Номенклатура КАК Номенклатура,
	|	АкцептУслуги.ПоступлениеСтавкаНДС КАК СтавкаНДС,
	|	АкцептУслуги.ПоступлениеСуммаНДС КАК СуммаНДС,
	|	АкцептУслуги.ПоступлениеСумма КАК СуммаВсего,
	|	АкцептУслуги.Ссылка.Поступление.ВалютаДокумента КАК Валюта
	|ИЗ
	|	Документ.Акцепт.Услуги КАК АкцептУслуги
	|ГДЕ
	|	АкцептУслуги.Ссылка = &Ссылка
	|	И НЕ АкцептУслуги.Сделка = ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
	|	И НЕ АкцептУслуги.ИдентификаторСтрокиРасходовВСделке = """"";
	Запрос.УстановитьПараметр("Ссылка", ОбъектАкцепт.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;  
	ОбъектАкцепт.Движения.РазнесениеСуммРасходов.Загрузить(РезультатЗапроса.Выгрузить());
		
КонецПроцедуры