
Функция ЕстьСсылкиНаДоговорКонтрагента(ДоговорКонтрагента) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос();
	Запрос.Текст = "	
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПользовательскиеМакетыПечати.Договор КАК ДоговорКонтрагента
	|ИЗ
	|	РегистрСведений.ПользовательскиеМакетыПечати КАК ПользовательскиеМакетыПечати
	|ГДЕ
	|	ПользовательскиеМакетыПечати.Договор = &ДоговорКонтрагента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВзаиморасчетыСПокупателями.Договор
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСПокупателями КАК ВзаиморасчетыСПокупателями
	|ГДЕ
	|	ВзаиморасчетыСПокупателями.Договор = &ДоговорКонтрагента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВзаиморасчетыСПоставщиками.Договор
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСПоставщиками КАК ВзаиморасчетыСПоставщиками
	|ГДЕ
	|	ВзаиморасчетыСПоставщиками.Договор = &ДоговорКонтрагента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	РеализованныеТоварыКомитентов.ДоговорКонтрагента
	|ИЗ
	|	РегистрНакопления.РеализованныеТоварыКомитентов КАК РеализованныеТоварыКомитентов
	|ГДЕ
	|	РеализованныеТоварыКомитентов.ДоговорКонтрагента = &ДоговорКонтрагента
	|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ ПЕРВЫЕ 1
	//|	ЗакупленныеТоварыКомитентов.ДоговорКонтрагента
	//|ИЗ
	//|	РегистрНакопления.ЗакупленныеТоварыКомитентов КАК ЗакупленныеТоварыКомитентов
	//|ГДЕ
	//|	ЗакупленныеТоварыКомитентов.ДоговорКонтрагента = &ДоговорКонтрагента
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ ПЕРВЫЕ 1
	//|	ЗакрытиеПериодов.Договор
	//|ИЗ
	//|	РегистрНакопления.ЗакрытиеПериодов КАК ЗакрытиеПериодов
	//|ГДЕ
	//|	ЗакрытиеПериодов.Договор = &ДоговорКонтрагента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	РазнесениеСчетовПокупателейПоВходящимПлатежам.Договор
	|ИЗ
	|	РегистрНакопления.РазнесениеСчетовПокупателейПоВходящимПлатежам КАК РазнесениеСчетовПокупателейПоВходящимПлатежам
	|ГДЕ
	|	РазнесениеСчетовПокупателейПоВходящимПлатежам.Договор = &ДоговорКонтрагента";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт 

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ДоговорМакет";
	КомандаПечати.Представление = "Макет договора";
	КомандаПечати.Обработчик    = "ДополнительныйМодульКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаЭлемента";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "ДоговорПредоставленияПС";
	//КомандаПечати.Представление = "Договор предоставления ПС";
	//КомандаПечати.Обработчик    = "ДополнительныйМодульКлиент.ВыполнитьКомандуПечати";
	//КомандаПечати.СписокФорм    = "ФормаСписка,ФормаЭлемента";
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	

КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ДоговорМакет") Тогда
		
		Для каждого ЭлМассива из МассивОбъектов Цикл
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ДоговорМакет", "Макет договора", НапечататьДоговор(ЭлМассива));
		КонецЦикла;
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ДоговорПредоставленияПС") Тогда
		
		Для каждого ЭлМассива из МассивОбъектов Цикл
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ДоговорПредоставленияПС", "Договор предоставления ПС", НапечататьДоговорПС(ЭлМассива));
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция НапечататьДоговор (СсылкаНаОбъект) Экспорт
	
	Результат = Новый ТабличныйДокумент;
	Результат.АвтоМасштаб = Истина;
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаОбъект.МакетПечатнойФормыДоговора) Тогда
		Сообщить("Не выбран макет печатной формы договора! Печать доступна только для типового договора.");
		Возврат Результат;
	КонецЕсли;
	
	Если СсылкаНаОбъект.МакетПечатнойФормыДоговора = Перечисления.ВидыМакетовДоговоров.ДоговорТЭО Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ДоговорТЭО");
	ИначеЕсли СсылкаНаОбъект.МакетПечатнойФормыДоговора = Перечисления.ВидыМакетовДоговоров.ДоговорАвтомобильнойПеревозки Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ДоговорАвтомобильнойПеревозки");
	ИначеЕсли СсылкаНаОбъект.МакетПечатнойФормыДоговора = Перечисления.ВидыМакетовДоговоров.ДоговорПредоставленияКонтейнеров Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ДоговорПредоставленияКонтейнеров");
	ИначеЕсли СсылкаНаОбъект.МакетПечатнойФормыДоговора = Перечисления.ВидыМакетовДоговоров.ДоговорПредоставленияПодвижногоСостава Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ДоговорПредоставленияПодвижногоСостава");
	Иначе	
		Сообщить("Не задан макет печатной формы договора!");
		Возврат Результат;
	КонецЕсли;
	//Вывод шапки
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		
	ОбластьШапка.Параметры.НомерДоговора = СсылкаНаОбъект.Номер;
	ОбластьШапка.Параметры.ДатаДоговора = СсылкаНаОбъект.Дата;
	Результат.Вывести(ОбластьШапка);
		
	//Вывод тела договора
	
	ОбластьТело = Макет.ПолучитьОбласть("ТелоДоговора");
	ДанныеРуководителяОрг = ОтветственныеЛица_сервер.ПолучитьРуководителя(СсылкаНаОбъект.Организация, ТекущаяДата());
	ДанныеРуководителяКонтр = ОтветственныеЛица_сервер.ПолучитьРуководителя(СсылкаНаОбъект.Владелец,ТекущаяДата());
//Евросиб ( Литвинов 21.01.2021 #30025
	//ОбластьТело.Параметры.ПолноеНаименованиеОрганизации = СсылкаНаОбъект.Организация.НаименованиеПолное;
	ОбластьТело.Параметры.ПолноеНаименованиеОрганизации = Справочники.Организации.НаименованияНаДату(СсылкаНаОбъект.Организация, СсылкаНаОбъект.Дата).НаименованиеПолное;
//Евросиб ) Литвинов 21.01.2021 #30025
	ОбластьТело.Параметры.РуководительОрганизации  = ДанныеРуководителяОрг.ФИОРПРус;
	ОбластьТело.Параметры.ОснованиеРуководителяОрганизации =ДанныеРуководителяОрг.ОснованиеРус; 
	ОбластьТело.Параметры.ПолноеНаименованиеКонтрагента = СсылкаНаОбъект.Владелец.НаименованиеПолное;
	ОбластьТело.Параметры.РуководительКонтрагента = ДанныеРуководителяКонтр.ФИОРПРус;
	ОбластьТело.Параметры.ОснованиеРуководителяКонтрагента = ДанныеРуководителяКонтр.ОснованиеРус; 
	
	Если СсылкаНаОбъект.МакетПечатнойФормыДоговора = Перечисления.ВидыМакетовДоговоров.ДоговорТЭО Тогда
		ОбластьТело.Параметры.КраткоеНаименованиеОрганизацииРод = СсылкаНаОбъект.Организация.НаименованиеВРодительномПадеже;
		ОбластьТело.Параметры.КраткоеНаименованиеОрганизации  = СсылкаНаОбъект.Организация.НаименованиеСокращенное;
		ОбластьТело.Параметры.НаименованиеОрганизации = СсылкаНаОбъект.Организация.НаименованиеСокращенное;
		ОбластьТело.Параметры.КраткоеНаименованиеОрганизацииДат =СсылкаНаОбъект.Организация.НаименованиеВДательномПадеже;
		ОбластьТело.Параметры.КраткоеНаименованиеОрганизацииТвор = СсылкаНаОбъект.Организация.НаименованиеВТворительномПадеже;
		ОбластьТело.Параметры.ДатаОкончанияДоговора = СсылкаНаОбъект.СрокДействия;
		ОтветственныйОтОрганизации = СсылкаНаОбъект.ОтветственныйЗаДоговор.ФизическоеЛицо;
		ТелОтвОрг = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ОтветственныйОтОрганизации, Справочники.ВидыКонтактнойИнформации.ТелефонФизическогоЛица,ТекущаяДата(),Истина);
		ЕмайлОтвОрг = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ОтветственныйОтОрганизации, Справочники.ВидыКонтактнойИнформации.EmailФизическогоЛица,ТекущаяДата(),Истина);
		ОтветственныйОтКонтрагента = СсылкаНаОбъект.ОтветственныйОтЗаказчика;
		ТелОтвОрг = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ОтветственныйОтКонтрагента, Справочники.ВидыКонтактнойИнформации.ТелефонФизическогоЛица,ТекущаяДата(),Истина);
		ЕмайлОтвОрг = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ОтветственныйОтКонтрагента, Справочники.ВидыКонтактнойИнформации.EmailФизическогоЛица,ТекущаяДата(),Истина);
		
		ОбластьТело.Параметры.ФиоКонтактаОрганизации = ОтветственныйОтОрганизации.НаименованиеДляПечатиВРП;
		ОбластьТело.Параметры.ТелефонКонтактаОрганизации  = ТелОтвОрг;
		ОбластьТело.Параметры.ЭлПочтаКотактаОрганизации  =ЕмайлОтвОрг;
		ОбластьТело.Параметры.ФиоКонтактаКонтрагента = ОтветственныйОтКонтрагента.НаименованиеДляПечатиВРП;
		ОбластьТело.Параметры.ТелефонКонтактаКонтрагента =ТелОтвОрг;
		ОбластьТело.Параметры.ЭлПочтаКонтрактаКонтрагента =ЕмайлОтвОрг;
	Иначе
		ОбластьТело.Параметры.ДатаОкончанияДоговора = Формат(СсылкаНаОбъект.СрокДействия,"ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	Если  СсылкаНаОбъект.МакетПечатнойФормыДоговора = Перечисления.ВидыМакетовДоговоров.ДоговорАвтомобильнойПеревозки Тогда

		ОбластьТело.Параметры.ДатаНачалаДоговора = Формат(СсылкаНаОбъект.Дата,"ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	Результат.Вывести(ОбластьТело);
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подписи");
	//ДанныеОрганизации
	ОбластьПодвал.Параметры.КраткоеНаименованиеОрганизации =СсылкаНаОбъект.Организация.НаименованиеСокращенное;
//Евросиб ( Литвинов 21.01.2021 #30025
	//ОбластьПодвал.Параметры.ПолноеНаименованиеОрганизации = СсылкаНаОбъект.Организация.НаименованиеПолное;                                           
	//Евросиб - АСуслов 06.09.2023 13:26:58 #74705
	//(
	//ОбластьПодвал.Параметры.ПолноеНаименованиеОрганизации = Справочники.Организации.НаименованияНаДату(СсылкаНаОбъект.Организация, СсылкаНаОбъект.Дата).НаименованиеПолное;
	Наименования = Справочники.Организации.НаименованияНаДату(СсылкаНаОбъект.Организация, СсылкаНаОбъект.Дата);
	ОбластьПодвал.Параметры.ПолноеНаименованиеОрганизации = Наименования.НаименованиеПолное;
	//)
	//Евросиб - АСуслов 06.09.2023 13:27:00 #74705
//Евросиб ) Литвинов 21.01.2021 #30025
	ОбластьПодвал.Параметры.ЮрАдресОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СсылкаНаОбъект.Организация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,ТекущаяДата(),Истина);
	ОбластьПодвал.Параметры.ИННОрганизации = СсылкаНаОбъект.Организация.ИНН;
	//Евросиб - АСуслов 06.09.2023 13:23:29 #74705
	//(
	//ОбластьПодвал.Параметры.КППОрганизации = СсылкаНаОбъект.Организация.КПП;
	ОбластьПодвал.Параметры.КППОрганизации = Наименования.КПП;
	//)
	//Евросиб - АСуслов 06.09.2023 13:23:31 #74705
	
	//ОбластьПодвал.Параметры.НомерСчетаОрганизации = СсылкаНаОбъект.Организация.ОсновнойБанковскийСчет.НомерСчета;
	//ОбластьПодвал.Параметры.НаименованиеБанкаОрганизации =  СсылкаНаОбъект.Организация.ОсновнойБанковскийСчет.Банк.Наименование;
	//ОбластьПодвал.Параметры.БИКБанкаОрганизации = СсылкаНаОбъект.Организация.ОсновнойБанковскийСчет.Банк.Код;
	//ОбластьПодвал.Параметры.КорСчетОрганизации  =СсылкаНаОбъект.Организация.ОсновнойБанковскийСчет.Банк.КоррСчет;  
	//ДИТ, Беляев СЮ, TA48059, 12-04-2022, начало	
	БанковскийСчетОрганизации = ОбщегоНазначенияВызовСервера.РасчетныйСчетПоДоговору(СсылкаНаОбъект);
	РеквизитыБанковскогоСчетаОрганизации = ПечатьБухгалтерскихДокументов.ПолучитьРеквизитыБанковскогоСчета(БанковскийСчетОрганизации);
	ОбластьПодвал.Параметры.НомерСчетаОрганизации = РеквизитыБанковскогоСчетаОрганизации.НомерСчета;
	ОбластьПодвал.Параметры.НаименованиеБанкаОрганизации =  РеквизитыБанковскогоСчетаОрганизации.НаименованиеБанка;
	ОбластьПодвал.Параметры.БИКБанкаОрганизации = РеквизитыБанковскогоСчетаОрганизации.БИК;
	ОбластьПодвал.Параметры.КорСчетОрганизации  = РеквизитыБанковскогоСчетаОрганизации.КоррСчет;
	//ДИТ, Беляев СЮ, TA48059, 12-04-2022, конец	
	
	ОбластьПодвал.Параметры.ОКПООрганизации = СсылкаНаОбъект.Организация.ОКПО;
	ОбластьПодвал.Параметры.ОГРНОрганизации = СсылкаНаОбъект.Организация.ОГРН;
	ОбластьПодвал.Параметры.ОКВЭДОрганизации = СсылкаНаОбъект.Организация.КодОКВЭД;
	ОбластьПодвал.Параметры.ТелефонОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СсылкаНаОбъект.Организация, Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации,ТекущаяДата(),Истина);
	ОбластьПодвал.Параметры.ФаксОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СсылкаНаОбъект.Организация, Справочники.ВидыКонтактнойИнформации.ФаксОрганизации,ТекущаяДата(),Истина);
	ОбластьПодвал.Параметры.ЭлПочтаОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СсылкаНаОбъект.Организация, Справочники.ВидыКонтактнойИнформации.EmailОрганизации,ТекущаяДата(),Истина);
	//ОбластьПодвал.Параметры.СайтОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СсылкаНаОбъект.Организация, Справочники.ВидыКонтактнойИнформации,ТекущаяДата(),Истина);
	
	//ДанныеКонтрагента
	ОбластьПодвал.Параметры.КраткоеНаименованиеКонтрагента  = СсылкаНаОбъект.Владелец.Наименование;
	ОбластьПодвал.Параметры.ПолноеНаименованиеКонтрагента = СсылкаНаОбъект.Владелец.НаименованиеПолное;
	ОбластьПодвал.Параметры.ЮрАдресКонтрагента =УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СсылкаНаОбъект.Владелец, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,ТекущаяДата(),Истина);
	ОбластьПодвал.Параметры.ИННКонтрагента  = СсылкаНаОбъект.Владелец.ИНН;
	ОбластьПодвал.Параметры.КППКонтрагента = СсылкаНаОбъект.Владелец.КПП;
	ОбластьПодвал.Параметры.НомерСчетаКонтрагента = СсылкаНаОбъект.Владелец.ОсновнойБанковскийСчет.НомерСчета;
	ОбластьПодвал.Параметры.НаименованиеБанкаКонтрагента = СсылкаНаОбъект.Владелец.ОсновнойБанковскийСчет.Банк.Наименование;
	ОбластьПодвал.Параметры.БИКБанкаКонтрагента = СсылкаНаОбъект.Владелец.ОсновнойБанковскийСчет.Банк.Код;
	ОбластьПодвал.Параметры.КорСчетКонтрагента = СсылкаНаОбъект.Владелец.ОсновнойБанковскийСчет.Банк.КоррСчет;
	ОбластьПодвал.Параметры.ТелефонКонтрагента = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СсылкаНаОбъект.Владелец, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента,ТекущаяДата(),Истина);
	ОбластьПодвал.Параметры.ЭлПочтаКонтрагента = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СсылкаНаОбъект.Владелец, Справочники.ВидыКонтактнойИнформации.EmailКонтрагента,ТекущаяДата(),Истина);

	Результат.Вывести(ОбластьПодвал);
	Если СсылкаНаОбъект.МакетПечатнойФормыДоговора = Перечисления.ВидыМакетовДоговоров.ДоговорТЭО Тогда
		Приложение1 = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ДоговорТЭО_Приложение1");
		Приложение2 = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ДоговорТЭО_Приложение2");
		Приложение3 = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ДоговорТЭО_Приложение3");
		
		Результат.ВывестиГоризонтальныйРазделительСтраниц();
		
		//Приложение 1
		ОбластьШапка = Приложение1.ПОлучитьОбласть("Шапка");
		ОбластьШапка.Параметры.НомерДоговора = СсылкаНаОбъект.Номер;
		ОбластьШапка.Параметры.ДатаДоговора = Формат(СсылкаНаОбъект.Дата,"ДФ=dd.MM.yyyy");
		Результат.Вывести(ОбластьШапка);
		
		ОбластьТело = Приложение1.ПолучитьОбласть("Таблица");
		ОбластьТело.Параметры.ПолноеНаименованиеКонтрагента = СсылкаНаОбъект.Владелец.НаименованиеПолное;
		ОбластьТело.Параметры.НомерДоговора = СсылкаНаОбъект.Номер;
		Результат.Вывести(ОбластьТело);
		
		ОбластьПодвал = Приложение1.ПолучитьОбласть("Подвал");
		ОбластьПодвал.Параметры.КраткоеНаименованиеОрганизации = СсылкаНаОбъект.Организация.НаименованиеСокращенное;
		Результат.Вывести(ОбластьПодвал);
		
		Результат.ВывестиГоризонтальныйРазделительСтраниц();
		
		//Приложение 2
		ОбластьШапка = Приложение2.ПолучитьОбласть("Шапка");
		ОбластьШапка.Параметры.НомерДоговора = СсылкаНаОбъект.Номер;
		ОбластьШапка.Параметры.ДатаДоговора = Формат(СсылкаНаОбъект.Дата,"ДФ=dd.MM.yyyy");
		Результат.Вывести(ОбластьШапка);
		
		ОбластьТело = Приложение2.ПолучитьОбласть("Тело");
		ОбластьТело.Параметры.ПолноеНаименованиеКонтрагента  = СсылкаНаОбъект.Владелец.НаименованиеПолное;
		Результат.Вывести(ОбластьТело);
		
		Результат.ВывестиГоризонтальныйРазделительСтраниц();
		
		//Приложение 3
		ОбластьШапка = Приложение3.ПолучитьОбласть("Шапка");
		ОбластьШапка.Параметры.НомерДоговора = СсылкаНаОбъект.Номер;
		ОбластьШапка.Параметры.ДатаДоговора = Формат(СсылкаНаОбъект.Дата,"ДФ=dd.MM.yyyy");
		Результат.Вывести(ОбластьШапка);
		
		ОбластьТело = Приложение3.ПолучитьОбласть("Тело");
		ОбластьТело.Параметры.КраткоеНаименованиеОрганизации =  СсылкаНаОбъект.Организация.НаименованиеСокращенное;
		ОбластьТело.Параметры.НомерДоговора = СсылкаНаОбъект.Номер;
		ОбластьТело.Параметры.ДатаДоговора = Формат(СсылкаНаОбъект.Дата,"ДФ=dd.MM.yyyy");
		ОбластьТело.Параметры.КраткоеНаименованиеОрганизацииТвор = СсылкаНаОбъект.Организация.НаименованиеВТворительномПадеже; 
		ОбластьТело.Параметры.КраткоеНаименованиеОрганизацииРод = СсылкаНаОбъект.Организация.НаименованиеВРодительномПадеже;
		ОбластьТело.Параметры.КраткоеНаименованиеОрганизацииДат =СсылкаНаОбъект.Организация.НаименованиеВДательномПадеже;
		Результат.Вывести(ОбластьТело);
		
		ОбластьПодвал = Приложение3.ПолучитьОбласть("Подвал");
//Евросиб ( Литвинов 21.01.2021 #30025
		//ОбластьПодвал.Параметры.ПолноеНаименованиеОрганизации = СсылкаНаОбъект.Организация.НаименованиеПолное;
		ОбластьПодвал.Параметры.ПолноеНаименованиеОрганизации = Справочники.Организации.НаименованияНаДату(СсылкаНаОбъект.Организация, СсылкаНаОбъект.Дата).НаименованиеПолное;
//Евросиб ) Литвинов 21.01.2021 #30025
		Результат.Вывести(ОбластьПодвал);
		
	ИначеЕсли СсылкаНаОбъект.МакетПечатнойФормыДоговора = Перечисления.ВидыМакетовДоговоров.ДоговорАвтомобильнойПеревозки Тогда
		Приложение1 = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ДоговорАвтомобильнойПеревозки_Приложение1_Форма1");
		Приложение2 = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ДоговорАвтомобильнойПеревозки_Приложение1_Форма2");
		Приложение3 = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ДоговорАвтомобильнойПеревозки_Приложение2");
		
		Результат.ВывестиГоризонтальныйРазделительСтраниц();
		
		//Приложение 1 Форма 1
		ОбластьШапка = Приложение1.ПолучитьОбласть("Шапка");
		Результат.Вывести(ОбластьШапка);
		
		ОбластьТело = Приложение1.ПолучитьОбласть("Тело");
		ОбластьТело.Параметры.НомерДоговора = СсылкаНаОбъект.Номер;
		ОбластьТело.Параметры.ДатаДоговора = Формат(СсылкаНаОбъект.Дата,"ДФ=dd.MM.yyyy");
//Евросиб ( Литвинов 21.01.2021 #30025
		//ОбластьТело.Параметры.ПолноеНаименованиеОрганизации = СсылкаНаОбъект.Организация.НаименованиеПолное;
		ОбластьТело.Параметры.ПолноеНаименованиеОрганизации = Справочники.Организации.НаименованияНаДату(СсылкаНаОбъект.Организация, СсылкаНаОбъект.Дата).НаименованиеПолное;
//Евросиб ) Литвинов 21.01.2021 #30025
		ОбластьТело.Параметры.ПолноеНаименованиеКонтрагента =  СсылкаНаОбъект.Владелец.НаименованиеПолное;
		Результат.Вывести(ОбластьТело);
		
		ОбластьПодвал = Приложение1.ПолучитьОбласть("Подвал");
		Результат.Вывести(ОбластьПодвал);
		
		Результат.ВывестиГоризонтальныйРазделительСтраниц();
		
		//Приложение 1 Форма 2
		ОбластьШапка = Приложение2.ПолучитьОбласть("Шапка");
		Результат.Вывести(ОбластьШапка);
		
		ОбластьТело = Приложение2.ПолучитьОбласть("Тело");
		ОбластьТело.Параметры.НомерДоговора = СсылкаНаОбъект.Номер;
		ОбластьТело.Параметры.ДатаДоговора = Формат(СсылкаНаОбъект.Дата,"ДФ=dd.MM.yyyy");
//Евросиб ( Литвинов 21.01.2021 #30025
		//ОбластьТело.Параметры.ПолноеНаименованиеОрганизации = СсылкаНаОбъект.Организация.НаименованиеПолное;
		ОбластьТело.Параметры.ПолноеНаименованиеОрганизации = Справочники.Организации.НаименованияНаДату(СсылкаНаОбъект.Организация, СсылкаНаОбъект.Дата).НаименованиеПолное;
//Евросиб ) Литвинов 21.01.2021 #30025
		ОбластьТело.Параметры.ПолноеНаименованиеКонтрагента =  СсылкаНаОбъект.Владелец.НаименованиеПолное;
		Результат.Вывести(ОбластьТело);
		
		ОбластьПодвал = Приложение2.ПОлучитьОбласть("Подвал");
		Результат.Вывести(ОбластьПодвал);
		
		Результат.ВывестиГоризонтальныйРазделительСтраниц();
		
		//Приложение 3
		ОбластьШапка = Приложение3.ПолучитьОбласть("Шапка");
		Результат.Вывести(ОбластьШапка);
		
		ОбластьТело = Приложение3.ПолучитьОбласть("Тело");
		ОбластьТело.Параметры.Город = СсылкаНаОбъект.РегионДоговора;
		ОбластьТело.Параметры.ПолноеНаименованиеКонтрагента = СсылкаНаОбъект.Владелец.НаименованиеПолное;
		ОбластьТело.Параметры.РуководительКонтрагента = ДанныеРуководителяКонтр.ФИОРПРус;
		ОбластьТело.Параметры.ОснованиеРуководителяКонтрагента = ДанныеРуководителяКонтр.ОснованиеРус; 
//Евросиб ( Литвинов 21.01.2021 #30025
		//ОбластьТело.Параметры.ПолноеНаименованиеОрганизации = СсылкаНаОбъект.Организация.НаименованиеПолное;
		ОбластьТело.Параметры.ПолноеНаименованиеОрганизации = Справочники.Организации.НаименованияНаДату(СсылкаНаОбъект.Организация, СсылкаНаОбъект.Дата).НаименованиеПолное;
//Евросиб ) Литвинов 21.01.2021 #30025
		ОбластьТело.Параметры.РуководительОрганизации =  ДанныеРуководителяОрг.ФИОРПРус;
		ОбластьТело.Параметры.ОснованиеРуководителяОрганизации = ДанныеРуководителяОрг.ОснованиеРус; 
		ОбластьТело.Параметры.НомерДоговора = СсылкаНаОбъект.Номер;
		ОбластьТело.Параметры.ДатаДоговора = Формат(СсылкаНаОбъект.Дата,"ДФ=dd.MM.yyyy");
		Результат.Вывести(ОбластьТело);
		
		ОбластьПодвал = Приложение3.ПолучитьОбласть("Подвал");
		Результат.Вывести(ОбластьПодвал);
		
	ИначеЕсли СсылкаНаОбъект.МакетПечатнойФормыДоговора = Перечисления.ВидыМакетовДоговоров.ДоговорПредоставленияКонтейнеров Тогда
		Приложение1 = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ДоговорПредоставленияКонтейнеров_Приложение1");
		Приложение2 = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ДоговорПредоставленияКонтейнеров_Приложение2");
		Приложение3 = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ДоговорПредоставленияКонтейнеров_Приложение3");
		
		Результат.ВывестиГоризонтальныйРазделительСтраниц();
		
		//Приложение 1
		ОбластьШапка = Приложение1.ПОлучитьОбласть("Шапка");
		ОбластьШапка.Параметры.НомерДоговора = СсылкаНаОбъект.Номер;
		ОбластьШапка.Параметры.ДатаДоговора = Формат(СсылкаНаОбъект.Дата,"ДФ=dd.MM.yyyy");
		Результат.Вывести(ОбластьШапка);
		
		ОбластьТело = Приложение1.ПолучитьОбласть("Тело");
//Евросиб ( Литвинов 21.01.2021 #30025
		//ОбластьТело.Параметры.ПолноеНаименованиеОрганизации = СсылкаНаОбъект.Организация.НаименованиеПолное;
		ОбластьТело.Параметры.ПолноеНаименованиеОрганизации = Справочники.Организации.НаименованияНаДату(СсылкаНаОбъект.Организация, СсылкаНаОбъект.Дата).НаименованиеПолное;
//Евросиб ) Литвинов 21.01.2021 #30025
		ОбластьТело.Параметры.НомерДоговора = СсылкаНаОбъект.Номер;
		Результат.Вывести(ОбластьТело);
		
		ОбластьПодвал = Приложение1.ПолучитьОбласть("Подвал");
		Результат.Вывести(ОбластьПодвал);
		
		Результат.ВывестиГоризонтальныйРазделительСтраниц();
		
		//Приложение 2
		ОбластьШапка = Приложение2.ПОлучитьОбласть("Шапка");
		ОбластьШапка.Параметры.НомерДоговора = СсылкаНаОбъект.Номер;
		ОбластьШапка.Параметры.ДатаДоговора = Формат(СсылкаНаОбъект.Дата,"ДФ=dd.MM.yyyy");
		Результат.Вывести(ОбластьШапка);
		
		ОбластьТело = Приложение2.ПолучитьОбласть("Тело");
//Евросиб ( Литвинов 21.01.2021 #30025
		//ОбластьТело.Параметры.ПолноеНаименованиеОрганизации = СсылкаНаОбъект.Организация.НаименованиеПолное;
		ОбластьТело.Параметры.ПолноеНаименованиеОрганизации = Справочники.Организации.НаименованияНаДату(СсылкаНаОбъект.Организация, СсылкаНаОбъект.Дата).НаименованиеПолное;
//Евросиб ) Литвинов 21.01.2021 #30025
		ОбластьТело.Параметры.РуководительОрганизации = ДанныеРуководителяОрг.ФИОРПРус;
		ОбластьТело.Параметры.ОснованиеРуководителяОрганизации = ДанныеРуководителяОрг.ОснованиеРус; 
		ОбластьТело.Параметры.ПолноеНаименованиеКонтрагента = СсылкаНаОбъект.Владелец.НаименованиеПолное;
		ОбластьТело.Параметры.РуководительКонтрагента = ДанныеРуководителяКонтр.ФИОРПРус;
		ОбластьТело.Параметры.ОснованиеРуководителяКонтрагента = ДанныеРуководителяКонтр.ОснованиеРус;
		ОбластьТело.Параметры.ДатаДоговора = Формат(СсылкаНаОбъект.Дата,"ДФ=dd.MM.yyyy");
		ОбластьТело.Параметры.НомерДоговора = СсылкаНаОбъект.Номер;
		Результат.Вывести(ОбластьТело);
		
		ОбластьПодвал = Приложение2.ПолучитьОбласть("Подвал");
		Результат.Вывести(ОбластьПодвал);
		
		Результат.ВывестиГоризонтальныйРазделительСтраниц();
		
		//Приложение 3
		ОбластьШапка = Приложение3.ПОлучитьОбласть("Шапка");
		ОбластьШапка.Параметры.НомерДоговора = СсылкаНаОбъект.Номер;
		ОбластьШапка.Параметры.ДатаДоговора = Формат(СсылкаНаОбъект.Дата,"ДФ=dd.MM.yyyy");
		Результат.Вывести(ОбластьШапка);
		
		ОбластьТело = Приложение3.ПолучитьОбласть("Тело");
//Евросиб ( Литвинов 21.01.2021 #30025
		//ОбластьТело.Параметры.ПолноеНаименованиеОрганизации = СсылкаНаОбъект.Организация.НаименованиеПолное;
		ОбластьТело.Параметры.ПолноеНаименованиеОрганизации = Справочники.Организации.НаименованияНаДату(СсылкаНаОбъект.Организация, СсылкаНаОбъект.Дата).НаименованиеПолное;
//Евросиб ) Литвинов 21.01.2021 #30025
		ОбластьТело.Параметры.РуководительОрганизации = ДанныеРуководителяОрг.ФИОРПРус;
		ОбластьТело.Параметры.ОснованиеРуководителяОрганизации = ДанныеРуководителяОрг.ОснованиеРус;
		ОбластьТело.Параметры.ПолноеНаименованиеКонтрагента = СсылкаНаОбъект.Владелец.НаименованиеПолное;
		ОбластьТело.Параметры.РуководительКонтрагента = ДанныеРуководителяКонтр.ФИОРПРус;
		ОбластьТело.Параметры.ОснованиеРуководителяКонтрагента = ДанныеРуководителяКонтр.ОснованиеРус;
		ОбластьТело.Параметры.НомерДоговора = СсылкаНаОбъект.Номер;
		ОбластьТело.Параметры.ДатаДоговора = Формат(СсылкаНаОбъект.Дата,"ДФ=dd.MM.yyyy");
		Результат.Вывести(ОбластьТело);
		
		ОбластьПодвал = Приложение3.ПолучитьОбласть("Подвал");
		Результат.Вывести(ОбластьПодвал);
		
	ИначеЕсли СсылкаНаОбъект.МакетПечатнойФормыДоговора = Перечисления.ВидыМакетовДоговоров.ДоговорПредоставленияПодвижногоСостава И СсылкаНаОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
		Приложение1 = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ДоговорПредоставленияПодвижногоСостава_Приложение1");
		Приложение2 = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ДоговорПредоставленияПодвижногоСостава_Приложение2");
		
		Результат.ВывестиГоризонтальныйРазделительСтраниц();
		
		//Приложение 1
		ОбластьШапка = Приложение1.ПОлучитьОбласть("Шапка");
		ОбластьШапка.Параметры.НомерДоговора = СсылкаНаОбъект.Номер;
		ОбластьШапка.Параметры.ДатаДоговора = Формат(СсылкаНаОбъект.Дата,"ДФ=dd.MM.yyyy");
		Результат.Вывести(ОбластьШапка);
		
		ОбластьТело = Приложение1.ПолучитьОбласть("Тело");
//Евросиб ( Литвинов 21.01.2021 #30025
		//ОбластьТело.Параметры.ПолноеНаименованиеОрганизации = СсылкаНаОбъект.Организация.НаименованиеПолное;
		ОбластьТело.Параметры.ПолноеНаименованиеОрганизации = Справочники.Организации.НаименованияНаДату(СсылкаНаОбъект.Организация, СсылкаНаОбъект.Дата).НаименованиеПолное;
//Евросиб ) Литвинов 21.01.2021 #30025
		ОбластьТело.Параметры.НомерДоговора = Формат(СсылкаНаОбъект.Дата,"ДФ=dd.MM.yyyy");
		Результат.Вывести(ОбластьТело);
		
		ОбластьПодвал = Приложение1.ПолучитьОбласть("Подвал");
		Результат.Вывести(ОбластьПодвал);
		
		Результат.ВывестиГоризонтальныйРазделительСтраниц();
		
		//Приложение 2
		ОбластьШапка = Приложение2.ПОлучитьОбласть("Шапка");
		ОбластьШапка.Параметры.НомерДоговора = СсылкаНаОбъект.Номер;
		ОбластьШапка.Параметры.ДатаДоговора = Формат(СсылкаНаОбъект.Дата,"ДФ=dd.MM.yyyy");
		Результат.Вывести(ОбластьШапка);
		
		ОбластьТело = Приложение2.ПолучитьОбласть("Тело");
		ОбластьТело.Параметры.ПолноеНаименованиеКонтрагента = СсылкаНаОбъект.Владелец.НаименованиеПолное; 
		ОбластьТело.Параметры.РуководительКонтрагента = ДанныеРуководителяКонтр.ФИОРПРус;
		ОбластьТело.Параметры.ОснованиеРуководителяКонтрагента = ДанныеРуководителяКонтр.ОснованиеРус;
//Евросиб ( Литвинов 21.01.2021 #30025
		//ОбластьТело.Параметры.ПолноеНаименованиеОрганизации = СсылкаНаОбъект.Организация.НаименованиеПолное;
		ОбластьТело.Параметры.ПолноеНаименованиеОрганизации = Справочники.Организации.НаименованияНаДату(СсылкаНаОбъект.Организация, СсылкаНаОбъект.Дата).НаименованиеПолное;
//Евросиб ) Литвинов 21.01.2021 #30025
		ОбластьТело.Параметры.РуководительОрганизации = ДанныеРуководителяОрг.ФИОРПРус;
		ОбластьТело.Параметры.ОснованиеРуководителяОрганизации = ДанныеРуководителяОрг.ОснованиеРус; 
		ОбластьТело.Параметры.НомерДоговора = СсылкаНаОбъект.Номер;
		ОбластьТело.Параметры.ДатаДоговора = Формат(СсылкаНаОбъект.Дата,"ДФ=dd.MM.yyyy");
		Результат.Вывести(ОбластьТело);
		
		ОбластьПодвал = Приложение2.ПолучитьОбласть("Подвал");
		Результат.Вывести(ОбластьПодвал);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НапечататьДоговорПС (СсылкаНаОбъект) Экспорт
	
	Результат = Новый ТабличныйДокумент;
	Результат.АвтоМасштаб = Истина;
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаОбъект.МакетПечатнойФормыДоговора) Тогда
		Сообщить("Не выбран макет печатной формы договора! Печать доступна только для типового договора.");
		Возврат Результат;
	КонецЕсли;
	
	//Если СсылкаНаОбъект.МакетПечатнойФормыДоговора = Перечисления.ВидыМакетовДоговоров.ДоговорПредоставленияПодвижногоСостава Тогда
		Макет = Справочники.ДоговорыКонтрагентов.ПолучитьМакет("ПФ_MXL_ДоговорПредоставленияПодвижногоСостава");
	//Иначе	
		//Сообщить("Данный макет не предназначен для выбранного макета печатной формы договора");
		//Возврат Результат;
	//КонецЕсли;
	//Вывод шапки
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		
	ОбластьШапка.Параметры.НомерДоговора = СсылкаНаОбъект.Номер;
	ОбластьШапка.Параметры.ДатаДоговора = СсылкаНаОбъект.Дата;
	Результат.Вывести(ОбластьШапка);
		
	//Вывод тела договора
	
	ОбластьТело = Макет.ПолучитьОбласть("ТелоДоговора");
	ДанныеРуководителяОрг = ОтветственныеЛица_сервер.ПолучитьРуководителя(СсылкаНаОбъект.Организация, ТекущаяДата());
	ДанныеРуководителяКонтр = ОтветственныеЛица_сервер.ПолучитьРуководителя(СсылкаНаОбъект.Владелец,ТекущаяДата());
//Евросиб ( Литвинов 21.01.2021 #30025
	//ОбластьТело.Параметры.ПолноеНаименованиеОрганизации = СсылкаНаОбъект.Организация.НаименованиеПолное;
	ОбластьТело.Параметры.ПолноеНаименованиеОрганизации = Справочники.Организации.НаименованияНаДату(СсылкаНаОбъект.Организация, СсылкаНаОбъект.Дата).НаименованиеПолное;
//Евросиб ) Литвинов 21.01.2021 #30025
	ОбластьТело.Параметры.РуководительОрганизации  = ДанныеРуководителяОрг.ФИОРПРус;
	ОбластьТело.Параметры.ОснованиеРуководителяОрганизации =ДанныеРуководителяОрг.ОснованиеРус; 
	ОбластьТело.Параметры.ПолноеНаименованиеКонтрагента = СсылкаНаОбъект.Владелец.НаименованиеПолное;
	ОбластьТело.Параметры.РуководительКонтрагента = ДанныеРуководителяКонтр.ФИОРПРус;
	ОбластьТело.Параметры.ОснованиеРуководителяКонтрагента = ДанныеРуководителяКонтр.ОснованиеРус; 
	
	ОбластьТело.Параметры.ДатаОкончанияДоговора = Формат(СсылкаНаОбъект.СрокДействия,"ДФ=dd.MM.yyyy");
	ОбластьТело.Параметры.ВалютаДоговора = СсылкаНаОбъект.ВалютаВзаиморасчетов;
	ОбластьТело.Параметры.КраткоеНаименованиеОрганизации = СсылкаНаОбъект.Организация.НаименованиеСокращенное;
	ОтветственныйОтОрганизации = СсылкаНаОбъект.ОтветственныйЗаДоговор.ФизическоеЛицо;
	ТелОтвОрг = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ОтветственныйОтОрганизации, Справочники.ВидыКонтактнойИнформации.ТелефонФизическогоЛица,ТекущаяДата(),Истина);
	ЕмайлОтвОрг = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ОтветственныйОтОрганизации, Справочники.ВидыКонтактнойИнформации.EmailФизическогоЛица,ТекущаяДата(),Истина);
	ОтветственныйОтКонтрагента = СсылкаНаОбъект.ОтветственныйОтЗаказчика;
	ТелОтвКонтр = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ОтветственныйОтКонтрагента, Справочники.ВидыКонтактнойИнформации.ТелефонФизическогоЛица,ТекущаяДата(),Истина);
	ЕмайлОтвКонтр = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ОтветственныйОтКонтрагента, Справочники.ВидыКонтактнойИнформации.EmailФизическогоЛица,ТекущаяДата(),Истина);
	ОбластьТело.Параметры.ОтветственныйПоДоговору = ОтветственныйОтОрганизации;
	ОбластьТело.Параметры.ТелОтветственногоПоДоговору =ТелОтвОрг;
	ОбластьТело.Параметры.ЭлПочтаОтветственногоПоДоговору =ЕмайлОтвОрг;
	ОбластьТело.Параметры.ОтветственныйОтЗаказчика =  ОтветственныйОтКонтрагента;
	ОбластьТело.Параметры.ТелОтветственногоОтЗаказчика =ТелОтвКонтр;
	ОбластьТело.Параметры.ЭлПочтаОтветственногоОтЗаказчика  =ЕмайлОтвКонтр;

	Результат.Вывести(ОбластьТело);
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подписи");
	//ДанныеОрганизации
//Евросиб ( Литвинов 21.01.2021 #30025
	//ОбластьПодвал.Параметры.КраткоеНаименованиеОрганизации =СсылкаНаОбъект.Организация.НаименованиеСокращенное;
	//ОбластьПодвал.Параметры.ПолноеНаименованиеОрганизации = СсылкаНаОбъект.Организация.НаименованиеПолное;
	НаименованияНаДату = Справочники.Организации.НаименованияНаДату(СсылкаНаОбъект.Организация, СсылкаНаОбъект.Дата);
	ОбластьПодвал.Параметры.КраткоеНаименованиеОрганизации = НаименованияНаДату.НаименованиеСокращенное;
	ОбластьПодвал.Параметры.ПолноеНаименованиеОрганизации = НаименованияНаДату.НаименованиеПолное;
//Евросиб ) Литвинов 21.01.2021 #30025
	ОбластьПодвал.Параметры.ЮрАдресОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СсылкаНаОбъект.Организация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,ТекущаяДата(),Истина);
	ОбластьПодвал.Параметры.ИННОрганизации = СсылкаНаОбъект.Организация.ИНН;
	//Евросиб - АСуслов 06.09.2023 13:28:59 #74705
	//(
	//ОбластьПодвал.Параметры.КППОрганизации = СсылкаНаОбъект.Организация.КПП;
	ОбластьПодвал.Параметры.КППОрганизации = НаименованияНаДату.КПП;
	//)
	//Евросиб - АСуслов 06.09.2023 13:29:01 #74705

	//ОбластьПодвал.Параметры.НомерСчетаОрганизации = СсылкаНаОбъект.Организация.ОсновнойБанковскийСчет.НомерСчета;
	//ОбластьПодвал.Параметры.НаименованиеБанкаОрганизации =  СсылкаНаОбъект.Организация.ОсновнойБанковскийСчет.Банк.Наименование;
	//ОбластьПодвал.Параметры.БИКБанкаОрганизации = СсылкаНаОбъект.Организация.ОсновнойБанковскийСчет.Банк.Код;
	//ОбластьПодвал.Параметры.КорСчетОрганизации  =СсылкаНаОбъект.Организация.ОсновнойБанковскийСчет.Банк.КоррСчет;  
	//ДИТ, Беляев СЮ, TA48059, 12-04-2022, начало
	БанковскийСчетОрганизации = ОбщегоНазначенияВызовСервера.РасчетныйСчетПоДоговору(СсылкаНаОбъект);
	РеквизитыБанковскогоСчетаОрганизации = ПечатьБухгалтерскихДокументов.ПолучитьРеквизитыБанковскогоСчета(БанковскийСчетОрганизации);
	ОбластьПодвал.Параметры.НомерСчетаОрганизации = РеквизитыБанковскогоСчетаОрганизации.НомерСчета;
	ОбластьПодвал.Параметры.НаименованиеБанкаОрганизации =  РеквизитыБанковскогоСчетаОрганизации.НаименованиеБанка;
	ОбластьПодвал.Параметры.БИКБанкаОрганизации = РеквизитыБанковскогоСчетаОрганизации.БИК;
	ОбластьПодвал.Параметры.КорСчетОрганизации  = РеквизитыБанковскогоСчетаОрганизации.КоррСчет; 
	//ДИТ, Беляев СЮ, TA48059, 12-04-2022, конец
	
	ОбластьПодвал.Параметры.ОКПООрганизации = СсылкаНаОбъект.Организация.ОКПО;
	ОбластьПодвал.Параметры.ОГРНОрганизации = СсылкаНаОбъект.Организация.ОГРН;
	ОбластьПодвал.Параметры.ОКВЭДОрганизации = СсылкаНаОбъект.Организация.КодОКВЭД;
	ОбластьПодвал.Параметры.ТелефонОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СсылкаНаОбъект.Организация, Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации,ТекущаяДата(),Истина);
	ОбластьПодвал.Параметры.ФаксОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СсылкаНаОбъект.Организация, Справочники.ВидыКонтактнойИнформации.ФаксОрганизации,ТекущаяДата(),Истина);
	ОбластьПодвал.Параметры.ЭлПочтаОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СсылкаНаОбъект.Организация, Справочники.ВидыКонтактнойИнформации.EmailОрганизации,ТекущаяДата(),Истина);
	//ОбластьПодвал.Параметры.СайтОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СсылкаНаОбъект.Организация, Справочники.ВидыКонтактнойИнформации,ТекущаяДата(),Истина);
	
	//ДанныеКонтрагента
	ОбластьПодвал.Параметры.КраткоеНаименованиеКонтрагента  = СсылкаНаОбъект.Владелец.Наименование;
	ОбластьПодвал.Параметры.ПолноеНаименованиеКонтрагента = СсылкаНаОбъект.Владелец.НаименованиеПолное;
	ОбластьПодвал.Параметры.ЮрАдресКонтрагента =УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СсылкаНаОбъект.Владелец, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,ТекущаяДата(),Истина);
	ОбластьПодвал.Параметры.ИННКонтрагента  = СсылкаНаОбъект.Владелец.ИНН;
	ОбластьПодвал.Параметры.КППКонтрагента = СсылкаНаОбъект.Владелец.КПП;
	ОбластьПодвал.Параметры.НомерСчетаКонтрагента = СсылкаНаОбъект.Владелец.ОсновнойБанковскийСчет.НомерСчета;
	ОбластьПодвал.Параметры.НаименованиеБанкаКонтрагента = СсылкаНаОбъект.Владелец.ОсновнойБанковскийСчет.Банк.Наименование;
	ОбластьПодвал.Параметры.БИКБанкаКонтрагента = СсылкаНаОбъект.Владелец.ОсновнойБанковскийСчет.Банк.Код;
	ОбластьПодвал.Параметры.КорСчетКонтрагента = СсылкаНаОбъект.Владелец.ОсновнойБанковскийСчет.Банк.КоррСчет;
	ОбластьПодвал.Параметры.ТелефонКонтрагента = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СсылкаНаОбъект.Владелец, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента,ТекущаяДата(),Истина);
	ОбластьПодвал.Параметры.ЭлПочтаКонтрагента = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СсылкаНаОбъект.Владелец, Справочники.ВидыКонтактнойИнформации.EmailКонтрагента,ТекущаяДата(),Истина);

	Результат.Вывести(ОбластьПодвал);
	
//	Если СсылкаНаОбъект.МакетПечатнойФормыДоговора = Перечисления.ВидыМакетовДоговоров.ДоговорПредоставленияПодвижногоСостава Тогда
		Приложение1 = Справочники.ДоговорыКонтрагентов.ПолучитьМакет("ПФ_MXL_ДоговорПредоставленияПодвижногоСостава_Приложение1");
			
		Результат.ВывестиГоризонтальныйРазделительСтраниц();
		
		//Приложение 1
		ОбластьШапка = Приложение1.ПОлучитьОбласть("Шапка");
		ОбластьШапка.Параметры.НомерДоговора = СсылкаНаОбъект.Номер;
		ОбластьШапка.Параметры.ДатаДоговора = Формат(СсылкаНаОбъект.Дата,"ДФ=dd.MM.yyyy");
		Результат.Вывести(ОбластьШапка);
		
		ОбластьТело = Приложение1.ПолучитьОбласть("Тело");
		Результат.Вывести(ОбластьТело);
		
		ОбластьПодвал = Приложение1.ПолучитьОбласть("Подвал");
		Результат.Вывести(ОбластьПодвал);
		
	
//	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//Евросиб Каблов 12.08.2022 ( Task 55578
Функция ПолучитьОтветственногоЗаДоговор(Договор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Пользователи.Ссылка, &ПользовательПустаяСсылка) КАК ОтветственныйЗаДоговор
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО ДоговорыКонтрагентов.ОтветственныйЗаДоговор = Пользователи.Ссылка
	|			И (НЕ Пользователи.Недействителен)
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка = &Договор";
	Запрос.УстановитьПараметр("Договор", Договор);
	
	ПользовательПустаяСсылка = Справочники.Пользователи.ПустаяСсылка();
	Запрос.УстановитьПараметр("ПользовательПустаяСсылка", ПользовательПустаяСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ОтветственныйЗаДоговор;
	Иначе
		Результат = ПользовательПустаяСсылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
//Евросиб Каблов 12.08.2022 )          

// Функция - Получить ответственного  (Ответственные были перенесены из реквизитов в ТЧ "Ответственные")
//
// Параметры:
//  Параметры - Структура - Договор, ЦФО, ТипОтветственного 
//  
// Возвращаемое значение:
//  Ответственный - СправочникСсылка.Пользователи 
//
Функция ПолучитьОтветственного(Знач Параметры) Экспорт 
	// ДИТ US 51951 TA 61497 Евсенкин М.А. 28.11.2022  // Функция исправлена по замечаниям.                                                
	//Если ТипОтветственногоСтрока 		= "ОтветственныйЗаУчет" Тогда  
	//	ТипОтветственного = ПредопределенноеЗначение("Перечисление.ТипыОтветственных.ОтветственныйЗаУчет");
	//	ЦФО = ПредопределенноеЗначение("Справочник.ЦентрыФинансовойОтветственности.ОсновнойЦФО");
	//ИначеЕсли ТипОтветственногоСтрока 	= "ОтветственныйЗаСопровождение" Тогда 
	//	ТипОтветственного = ПредопределенноеЗначение("Перечисление.ТипыОтветственных.ОтветственныйЗаСопровождение");
	//	ЦФО = ПредопределенноеЗначение("Справочник.ЦентрыФинансовойОтветственности.ОсновнойЦФО");
	//ИначеЕсли ТипОтветственногоСтрока 	= "ОтветственныйЗаСопровождениеНСК" Тогда
	//	ТипОтветственного = ПредопределенноеЗначение("Перечисление.ТипыОтветственных.ОтветственныйЗаСопровождение");
	//	ЦФО = ПредопределенноеЗначение("Справочник.ЦентрыФинансовойОтветственности.ТерминалНовосибирск");
	//ИначеЕсли ТипОтветственногоСтрока	= "ОтветственныйЗаУчетНСК" Тогда	
	//	ТипОтветственного = ПредопределенноеЗначение("Перечисление.ТипыОтветственных.ОтветственныйЗаУчет");
	//	ЦФО = ПредопределенноеЗначение("Справочник.ЦентрыФинансовойОтветственности.ТерминалНовосибирск");
	//Иначе 
	//	Возврат ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	//КонецЕсли;	
	//
	//Если ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда 
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	Ответственные.Ответственный КАК Ответственный
	//	|ИЗ
	//	|	Справочник.ДоговорыКонтрагентов.Ответственные КАК Ответственные
	//	|ГДЕ
	//	|	Ответственные.ТипОтветственного = &ТипОтветственного
	//	|	И Ответственные.ЦФО = &ЦФО
	//	|	И Ответственные.Ссылка = &Договор";
	//	
	//	Запрос.УстановитьПараметр("Договор", Договор);
	//	Запрос.УстановитьПараметр("ТипОтветственного", ТипОтветственного);
	//	Запрос.УстановитьПараметр("ЦФО", ЦФО);
	//	
	//	Результат = Запрос.Выполнить();
	//	
	//	Если Не Результат.Пустой() Тогда
	//		Выборка = Результат.Выбрать();
	//		Если Выборка.Следующий() Тогда 
	//			Ответственный = Выборка.Ответственный;
	//		КонецЕсли;	
	//	Иначе 
	//		Ответственный = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");	
	//	КонецЕсли;
	//ИначеЕсли ТипЗнч(Договор) = Тип("СправочникОбъект.ДоговорыКонтрагентов") Тогда 
	//	Отбор = Новый Структура("ТипОтветственного,ЦФО",ТипОтветственного,ЦФО);
	//	МасивСтрок = Договор.Ответственные.НайтиСтроки(Отбор);
	//	Если МасивСтрок.Количество() > 0 Тогда 
	//		Ответственный = МасивСтрок[0].Ответственный;	
	//	Иначе 
	//		Ответственный = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");	
	//	КонецЕсли;	
	//КонецЕсли; 
	//
	//Возврат Ответственный;
	
	Ответственный = Справочники.Пользователи.ПустаяСсылка();
	
	Если ТипЗнч(Параметры.Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда 
		
		//Евросиб СубботинВ #117990 20.01.2026 Начало
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ ПЕРВЫЕ 1
		//|	Ответственные.Ответственный КАК Ответственный
		//|ИЗ
		//|	Справочник.ДоговорыКонтрагентов.Ответственные КАК Ответственные
		//|ГДЕ
		//|	Ответственные.ТипОтветственного = &ТипОтветственного
		//|	И Ответственные.ЦФО = &ЦФО
		//|	И Ответственные.Ссылка = &Договор";
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(Ответственные.Ответственный) = ТИП(Справочник.ГруппыПользователей)
		|			ТОГДА ГруппыПользователейСостав.Пользователь
		|		ИНАЧЕ Ответственные.Ответственный
		|	КОНЕЦ КАК Ответственный
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов.Ответственные КАК Ответственные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
		|		ПО Ответственные.Ответственный = ГруппыПользователейСостав.Ссылка
		|ГДЕ
		|	Ответственные.ТипОтветственного = &ТипОтветственного
		|	И Ответственные.ЦФО = &ЦФО
		|	И Ответственные.Ссылка = &Договор";		
		//Евросиб СубботинВ #117990 20.01.2026 Конец
		
		Для Каждого СтрПараметры Из Параметры Цикл 
			Запрос.УстановитьПараметр(СтрПараметры.Ключ, СтрПараметры.Значение);	
		КонецЦикла;
		
		Результат = Запрос.Выполнить();	
		
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Если Выборка.Следующий() Тогда 
				Ответственный = Выборка.Ответственный;
			КонецЕсли;	
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Параметры.Договор) = Тип("СправочникОбъект.ДоговорыКонтрагентов") Тогда 	
		ДоговорОбъект = Параметры.Договор;
		ПараметрыКопия = Новый Структура(Новый ФиксированнаяСтруктура(Параметры));
		ПараметрыКопия.Удалить("Договор");
		МассивСтрок = ДоговорОбъект.Ответственные.НайтиСтроки(ПараметрыКопия);
		Если МассивСтрок.Количество() > 0 Тогда
			//Евросиб СубботинВ #117990 20.01.2026 Начало 
			//Ответственный = МасивСтрок[0].Ответственный;
			Если ТипЗнч(МассивСтрок[0].Ответственный) = Тип("СправочникСсылка.ГруппыПользователей") Тогда
				СоставГруппы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(МассивСтрок[0].Ответственный, "Состав").Выгрузить();
				Если СоставГруппы.Количество() > 0 Тогда
					Ответственный = СоставГруппы[0].Пользователь;
				КонецЕсли;
			Иначе				
				Ответственный = МассивСтрок[0].Ответственный;
			КонецЕсли
			//Евросиб СубботинВ #117990 20.01.2026 Конец
		КонецЕсли;	
	КонецЕсли;		
	
	Возврат Ответственный;
	// ДИТ US 51951 TA 61497 Евсенкин М.А. 28.11.2022
КонецФункции 

//ДИТ Шевченко А.В. 50879 17.01.23 -добавил параметр ПроверитьВхождениеОднойДаты
Функция ПроверитьПериодДействияДоговора(Ссылка,ДатаНачалаДействия,ДатаОкончанияДействия,ПроверитьВхождениеОднойДаты = Ложь) Экспорт
	
	ДатаНачалаДействияДоговора 			= Дата(1,1,1);
	ДатаОкончанияДействияДоговора 	    = Дата(1,1,1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.ДатаНачалаДействияДоговора КАК ДатаНачалаДействияДоговора,
		|	ДоговорыКонтрагентов.СрокДействия КАК СрокДействия
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДатаНачалаДействияДоговора    = ВыборкаДетальныеЗаписи.ДатаНачалаДействияДоговора;
		ДатаОкончанияДействияДоговора = ВыборкаДетальныеЗаписи.СрокДействия;	
	КонецЦикла;	
	
	Если ПроверитьВхождениеОднойДаты Тогда
		Возврат ДатаНачалаДействия >= НачалоДня(ДатаНачалаДействияДоговора) И ДатаНачалаДействия <= КонецДня(ДатаОкончанияДействияДоговора);
	КонецЕсли;	
	
	Возврат ДатаНачалаДействия >= НачалоДня(ДатаНачалаДействияДоговора) И ДатаОкончанияДействия <= КонецДня(ДатаОкончанияДействияДоговора);
КонецФункции


Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	РаботаСМенеджерамиОбъектов.ОбработкаПолученияДанныхВыбораПолучитьДанныеВыбораБезПомеченныхНаУдаление("ДоговорыКонтрагентов", ДанныеВыбора, Параметры, СтандартнаяОбработка);
КонецПроцедуры

//Евросиб Каблов 04.06.2024 #67092
Функция ПолучитьЗначенияРеквизитовДоговораПоУмолчанию(Договор) Экспорт
	
	//Евросиб СубботинВ #89675 16.08.2024 Начало //добавил в структуру возврат значения "МультивалютныйДоговор")
	//ЗначенияРеквизитов = Новый Структура("Типовой, ВалютаОплаты, ВалютаВзаиморасчетов, ОтветственныйЗаДоговор, НаименованиеСтороны");
	ЗначенияРеквизитов = Новый Структура("Типовой, ВалютаОплаты, ВалютаВзаиморасчетов, ОтветственныйЗаДоговор, НаименованиеСтороны, НаименованиеCтороныЕвросиб, МультивалютныйДоговор, ФормаПротокола");
	//Евросиб СубботинВ #89675 16.08.2024 Конец

	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.МультивалютныйДоговор КАК МультивалютныйДоговор,
	|	ЕСТЬNULL(ДоговорыКонтрагентов1.ВалютаВзаиморасчетов, НЕОПРЕДЕЛЕНО) КАК ВалютаПоУмолчаниюМультивалютногоДоговора,
	|	ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	ДоговорыКонтрагентов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ДоговорыКонтрагентов.ОтветственныйЗаДоговор КАК ОтветственныйЗаДоговор,
	|	ДоговорыКонтрагентов.НаименованиеСтороны КАК НаименованиеСтороны,
	|	ДоговорыКонтрагентов.Типовой КАК Типовой,
	|	ДоговорыКонтрагентов.НаименованиеCтороныЕвросиб КАК НаименованиеCтороныЕвросиб,
	|	ДоговорыКонтрагентов.ФормаПротокола КАК ФормаПротокола
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.ДоговорыОплаты КАК ДоговорыКонтрагентовДоговорыОплаты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов1
	|			ПО ДоговорыКонтрагентовДоговорыОплаты.Договор = ДоговорыКонтрагентов1.Ссылка
	|		ПО ДоговорыКонтрагентов.Ссылка = ДоговорыКонтрагентовДоговорыОплаты.Ссылка
	|			И (ДоговорыКонтрагентовДоговорыОплаты.ВалютаПоУмолчанию)
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка = &Договор";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ЗначенияРеквизитов, Выборка);
		
		Если Выборка.МультивалютныйДоговор Тогда
			ЗначенияРеквизитов.ВалютаОплаты = Выборка.ВалютаПоУмолчаниюМультивалютногоДоговора;
		Иначе
			ЗначенияРеквизитов.ВалютаОплаты = Выборка.ВалютаВзаиморасчетов;
		КонецЕсли;		
		
	КонецЕсли;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции

//Евросиб СубботинВ #90789 16.08.2024 Начало
// возвращает всегда сам договор и (при наличии) массив договоров связанный с основным(который передали) при мультивалютных историях
Функция ПолучитьСписокСвязанныхДоговоров(Договор) Экспорт
	
	МассивДоговоров = Новый Массив;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
		|	ДоговорыКонтрагентов.МультивалютныйДоговор КАК МультивалютныйДоговор
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Владелец = &Владелец
		|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
		//Евросиб СубботинВ #126100 26.12.2025 Начало
		|	И НЕ ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах
		//Евросиб СубботинВ #126100 26.12.2025 Конец		
		|	И ДоговорыКонтрагентов.Код = &Код
		|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления";
		
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ВидДоговора, Код, Владелец, Ссылка");
	Запрос.УстановитьПараметр("Владелец", РеквизитыДоговора.Владелец);
	Запрос.УстановитьПараметр("ВидДоговора", РеквизитыДоговора.ВидДоговора);
    Запрос.УстановитьПараметр("Код", РеквизитыДоговора.Код);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	СтруктураПоиска = Новый Структура("МультивалютныйДоговор", Истина); 
	МультивалютныйДоговор = РезультатЗапроса.НайтиСтроки(СтруктураПоиска);
	Если МультивалютныйДоговор.Количество()>0 Тогда
		Для Каждого СтрокаДоговор из РезультатЗапроса Цикл
			МассивДоговоров.Добавить(СтрокаДоговор.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	Если МассивДоговоров.Количество() = 0 тогда
	    МассивДоговоров.Добавить(Договор);
	КонецЕсли;
	
    Возврат МассивДоговоров;
	
КонецФункции 
//Евросиб СубботинВ #90789 16.08.2024 Конец 

