 
Процедура ПередЗаписью(Отказ)
	
	Если Не ОбменДанными.Загрузка И НЕ БитФинансСервер.ЭтотОбъектЕстьВБФ(Владелец) Тогда
		Сообщить("Нельзя вводить договор по контрагенту, отсутствующему в Бит.Финанс. Операция прервана.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	
	// + Состояния
	
	// проверяем корректность перечня состояний в ТЧ Состояния
	Для Сч = 0 По Состояния.Количество() - 2 Цикл
		ТекСостояние = Состояния[Сч].Состояние;
		Для ТекСч = Сч + 1 По Состояния.Количество() - 1 Цикл
			Если Состояния[ТекСч].Состояние = ТекСостояние Тогда
				Сообщить("Ошибка: одно состояние может встречаться в документе только один раз!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Заполняем этапы операции
	Если Не ОбменДанными.Загрузка И Состояния.Количество() = 0 Тогда
		НСтр = Состояния.Добавить();
		НСтр.Исполнитель = Редактор;
		НСтр.Состояние = Справочники.Состояния.Выполнение;
		НСтр.Статус = Перечисления.СтатусыЭтапов.Новый;
	КонецЕсли;
	
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0398546, 14-05-2025, начало (перенес блок кода ниже, после перемаршрутизации, чтобы закрывалась задача)
	////ДИТ Шевченко А.В. 07.09.2022 56947 - начало
	//Если ПолученОригинал Тогда
	//	ЗадачиДляОтмены = Новый Массив;
	//	ЗадачиДляОтмены.Добавить(Справочники.Состояния.КонтрольПоступленияОригиналаДоговора);
	//	МаршрутизацияСервер.ОтметитьВыполнениеЗадач(ЭтотОбъект, ЗадачиДляОтмены);
	//КонецЕсли;
	////ДИТ Шевченко А.В. 07.09.2022 56947 - конец
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0398546, 14-05-2025, конец
	
	//// для состояний отражаем логику движения статусов
	//Для Сч = 0 По Состояния.Количество() - 2 Цикл
	//	Если Состояния[Сч].Статус = Перечисления.СтатусыЭтапов.Выполнен И Состояния[Сч+1].Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//		Состояния[Сч+1].Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//		Если НЕ ЗначениеЗаполнено(Состояния[Сч+1].Исполнитель) Тогда
	//			Состояния[Сч+1].Исполнитель = Пользователи.ТекущийПользователь();
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	
	//++ Зубов 35844 04.08.2021
	//	//Стаценко Параллельное согласование
	//Для каждого СтрТЧ из Состояния Цикл
	//	Если Не ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//		СтрТЧ.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//        ПредыдущиеЭтапы = СтрТЧ.ПредыдущиеЭтапы;
	//		Попытка
	//			МассивЭтапов = СтрРазделить(ПредыдущиеЭтапы,",",Ложь);
	//		Исключение
	//			Сообщить("Некорректная строка предыдущих этапов");
	//		КонецПопытки;
	//		ВозможноВыполнение = Истина;
	//		Если МассивЭтапов.Количество() > 0 Тогда
	//			Для каждого Эл из МассивЭтапов Цикл
	//				Попытка
	//					НомСтр = Число(Эл);
	//					СтрЭтапа = Состояния.Найти(НомСтр,"НомерСтроки");
	//					Если СтрЭтапа <> Неопределено Тогда
	//						Если СтрЭтапа.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//							ВозможноВыполнение = Ложь;
	//						КонецЕсли;
	//					КонецЕсли;
	//				Исключение
	//					Сообщить("Некорректное указание этапа состояние. Возможен только ввод цифр.");
	//				КонецПопытки
	//			КонецЦикла;
	//		КонецЕсли;
	//		Если ВозможноВыполнение Тогда
	//			СтрТЧ.Статус =  Перечисления.СтатусыЭтапов.НаВыполнение;
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//КонецЦикла;
	////Стаценко
	//МаршрутизацияСервер.ПараллельноеСогласование(Состояния); //ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, закомментировал (перенёс ниже)
	//-- Зубов 35844 04.08.2021

	//ДИТ Авдеева В.С. 47090 11.04.2022 Начало 
	ОбработаноВыполнениеЗафиксировано = Ложь;
	//ДИТ Авдеева В.С. 47090 11.04.2022 Конец
	
	//Евосиб Максимова
	//Если ОбменДанными.Загрузка Тогда
	//	Если Подписан и УсловиеОплаты=Перечисления.ВидыУсловийОплаты.ОплатаПоФакту Тогда
	//		НСтр = Состояния.Добавить();
	//		НСтр.Состояние = Справочники.Состояния.НайтиПоНаименованию("Заполнить условия оплаты");
	//		НСтр.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//        НСтр.Исполнитель=Справочники.ГруппыПользователей.НайтиПоНаименованию("ФО");
	//		НСтр.Наблюдатель=Справочники.ГруппыПользователей.НайтиПоНаименованию("Руководитель ФО");
	//		НСтр.НормативИсполненияСМоментаСоздания=26;
	//		НСтр.ВидНормативаИсполнения=Перечисления.ВидыНормативовИспользования.ЧасовСМоментаСозданияДокумента;
	//	КонецЕсли;
	//КонецЕсли;
	
	//Евосиб Максимова
	// Маршрутизация договора
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = Не ОбменДанными.Загрузка И 
	(Состояния.Количество() = 0 ИЛИ НЕ ЗначениеЗаполнено(Ссылка) ИЛИ 
	Ссылка.Организация <> Организация ИЛИ 
	Ссылка.ТипДоговорнойЗаписи <> ТипДоговорнойЗаписи ИЛИ 
	Ссылка.Типовой <> Типовой ИЛИ 
	Ссылка.РегионДоговора <> РегионДоговора ИЛИ 
	Ссылка.КатегорияДоговора <> КатегорияДоговора ИЛИ 
	Ссылка.ВидДоговора <> ВидДоговора ИЛИ
	Ссылка.ОтветственныйЗаДоговор <> ОтветственныйЗаДоговор ИЛИ //Евросиб Гудкова( 27.07.2020 Ticket№ 0201581
	Ссылка.ЦФО <> ЦФО ИЛИ //Евросиб Гудкова( 11.08.2020
	Ссылка.ВалютаВзаиморасчетов <> ВалютаВзаиморасчетов);
	
	Если Не ОбменДанными.Загрузка И Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Владелец);
		ПараметрыЗапроса.Вставить("Договор", ЭтотОбъект);
		
		ПараметрыЗапроса.Вставить("КатегорияДоговора", КатегорияДоговора);
		ПараметрыЗапроса.Вставить("ТипДоговорнойЗаписи", ТипДоговорнойЗаписи);
		ПараметрыЗапроса.Вставить("Нетиповой", Не Типовой);
		ПараметрыЗапроса.Вставить("РегионДоговора", РегионДоговора);
		ПараметрыЗапроса.Вставить("ВидДоговора", ВидДоговора);
		ПараметрыЗапроса.Вставить("Валюта", ВалютаВзаиморасчетов);
		ПараметрыЗапроса.Вставить("ЦФО", ЦФО);
		ПараметрыЗапроса.Вставить("Нерезидент", (Владелец.СтранаРегистрации <> Справочники.СтраныМира.Россия));
		//Евросиб Максимова Ticket#0203438
		ПараметрыЗапроса.Вставить("УсловиеОплаты",УсловиеОплаты);
		ПараметрыЗапроса.Вставить("Подписан", Подписан);
		//Евросиб Максимова

		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьДоговор(ПараметрыЗапроса, Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			
			Если РезультатЗапроса.Количество() > 0 Тогда
				УказанныеВручнуюИспНаблюдатель = Новый СписокЗначений;
				Если ДополнительныеСвойства.Свойство("ДопСвойстваОбъекта") тогда
					УказанныеВручнуюИспНаблюдатель = ДополнительныеСвойства.ДопСвойстваОбъекта;
				КонецЕсли;
				МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъект, РезультатЗапроса, Автор, УказанныеВручнуюИспНаблюдатель); 
				
				//ДИТ, Беляев СЮ, Ticket#0287047, 26-10-2022, закомментировал, перенёс в МаршрутизацияСервер.ПостобработкаТЧСостояний()
				////ДИТ Авдеева В.С. 47090 11.04.2022 Начало
				//МаршрутизацияСервер.УстановитьВыполнениеЗафиксировано(ЭтотОбъект);  
				//ОбработаноВыполнениеЗафиксировано = Истина; 
				//МаршрутизацияСервер.ПостобработкаВыполненныхЗадач(ЭтотОбъект);
				////ДИТ Авдеева В.С. 47090 11.04.2022 Конец
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;       
	
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, начало
	МаршрутизацияСервер.ПараллельноеСогласование(Состояния);
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, конец
	
	//ДИТ, Беляев СЮ, Ticket#0287047, 26-10-2022, закомментировал, перенёс в МаршрутизацияСервер.ПостобработкаТЧСостояний()
	////ДИТ Авдеева В.С. 47090 11.04.2022 Начало 
	//Если Не ОбработаноВыполнениеЗафиксировано Тогда 
	//	МаршрутизацияСервер.УстановитьВыполнениеЗафиксировано(ЭтотОбъект);  
	//КонецЕсли;
	////ДИТ Авдеева В.С. 47090 11.04.2022 Конец

	
	// если исполнитель пустой, то проставляем тек пользователя
	Для каждого Стр из Состояния Цикл
		
		Если Стр.ВидНормативаИсполнения = Перечисления.ВидыНормативовИспользования.Плюс30ДнейСДатыДоговора Тогда
			Стр.НормативИсполненияСМоментаСоздания = 30*24;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Стр.ВидНормативаИсполнения) Тогда
			Стр.ВидНормативаИсполнения = Перечисления.ВидыНормативовИспользования.ЧасовСМоментаСозданияДокумента;
		КонецЕсли;
		
		Если Стр.ПримечаниеЗадачаИсполнителю Тогда
			// если текст примечания изменился, то создать новое сообщение. если остался прежним, то не менять
			// т.к. состояние уникально, ищем по нему
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Состояние",Стр.Состояние);
			НайденнаяСтр = Ссылка.Состояния.НайтиСтроки(ПараметрыОтбора);
			Если НайденнаяСтр.Количество()>0 Тогда
				Если НЕ НайденнаяСтр[0].Комментарий = Стр.Комментарий Тогда
					
					// +Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					ДатаСообщения = ТекущаяДата();
					АвторСообщения = Пользователи.ТекущийПользователь();
					ТекстСообщения = Стр.Комментарий;
					ГУИДСообщения = Новый УникальныйИдентификатор();
					
					ГУИДТемы = Новый УникальныйИдентификатор;
					
					РассылкаПоЛичнымЦелям.СформироватьЛичноеСообщение(ГУИДТемы, , Ссылка, ДатаСообщения, АвторСообщения, ТекстСообщения, , ГУИДСообщения, Стр.Исполнитель);
					// -Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если Стр.НаблюдательКакРуководительИсполнителя И ТипЗнч(Стр.Исполнитель) = Тип("СправочникСсылка.Пользователи") И ЗначениеЗаполнено(Стр.Исполнитель.НепосредственныйРуководитель) Тогда
			Стр.Наблюдатель = Стр.Исполнитель.НепосредственныйРуководитель;
		КонецЕсли;
		
	КонецЦикла;
	
	// определяем текущее состояние. для нас это первое состояние не в "выполнено"
	//Для каждого Состояние из Состояния Цикл
	//	Если Состояние.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//		ТекущееСостояние = Состояние.Состояние;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	
	МаршрутизацияСервер.ПостобработкаТЧСостояний(ЭтотОбъект, Пользователи.ТекущийПользователь());
	
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0398546, 14-05-2025, начало
	Если ПолученОригинал Тогда
		ЗадачиДляОтмены = Новый Массив;
		ЗадачиДляОтмены.Добавить(Справочники.Состояния.КонтрольПоступленияОригиналаДоговора);
		МаршрутизацияСервер.ОтметитьВыполнениеЗадач(ЭтотОбъект, ЗадачиДляОтмены);
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0398546, 14-05-2025, конец
	
	// - Состояния
	
	//<< Евросиб - Витвицкий 09.07.2019
	Если НЕ ОбменДанными.Загрузка И НЕ ЭтоНовый() И Не ЭтоГруппа Тогда	
		Если Владелец <> Ссылка.Владелец Тогда		
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	ДокументыПоДоговоруКонтрагента.Ссылка
			|ИЗ
			|	КритерийОтбора.ДокументыПоДоговоруКонтрагента(&Договор) КАК ДокументыПоДоговоруКонтрагента";
			
			Запрос.УстановитьПараметр("Договор", Ссылка);
			
			Результат = Запрос.Выполнить();
			ЕстьДокументыПоДоговору = НЕ Результат.Пустой();
			
			Если ЕстьДокументыПоДоговору Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Существуют документы, оформленные по договору """ + Наименование + """.
																|Контрагент договора не может быть изменен, элемент не записан.",,,,Отказ);				
			КонецЕсли; 
		КонецЕсли;
		
		// Проверим возможность смены способа ведения взаиморасчетов и валюты взаиморасчетов
		Если ВалютаВзаиморасчетов <> Ссылка.ВалютаВзаиморасчетов 
			ИЛИ ВидДоговора <> Ссылка.ВидДоговора
			ИЛИ Организация <> Ссылка.Организация
			ИЛИ РасчетыВУсловныхЕдиницах <> Ссылка.РасчетыВУсловныхЕдиницах Тогда
			
			Если Справочники.ДоговорыКонтрагентов.ЕстьСсылкиНаДоговорКонтрагента(Ссылка) Тогда		
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Существуют документы, проведенные по договору """ + Наименование + """.
				|Реквизиты: ""Организация"", ""Валюта взаиморасчетов"", ""Вид договора"", 
				|""Расчеты в условных единицах"" не могут быть изменены, элемент не записан.",,,,Отказ);
			КонецЕсли;		
		КонецЕсли;	
	КонецЕсли;	
	//>> Евросиб - Витвицкий 09.07.2019
	
//Евросиб Гудкова( 16.07.2020 Ticket№ 0200289
	//Если Не ОбменДанными.Загрузка И НЕ ЗначениеЗаполнено(СрокОплаты) Тогда
	//	СрокОплаты = Константы.СрокЗадолженностиДляОтнесенияПокупателяВСтопЛист.Получить();
	//КонецЕсли;
// Евросиб Гудкова) 	
	
	ЛичныеЦелиСервер.ОчиститьЗаписиЛичныхЦелей(Ссылка);
	
	// если изменились данные по реквизитам ПДЗ - записать их в регистр
	Если Ссылка.СтатусПДЗ <> СтатусПДЗ ИЛИ
		Ссылка.КомментарийПДЗ <>КомментарийПДЗ Тогда
		
		ТекЗапись = РегистрыСведений.ИсторияСтатусовПДЗ.СоздатьМенеджерЗаписи();
		ТекЗапись.Период = ТекущаяДата();
		ТекЗапись.Договор = Ссылка;
		ТекЗапись.Статус = СтатусПДЗ;
		ТекЗапись.Комментарий = КомментарийПДЗ;
		ТекЗапись.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
		ТекЗапись.Записать();
	
	КонецЕсли;   
	
	// ДИТ 56017 Давудов М.А. Начало: 13.07.2023
	Если НЕ (ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем)
	   И УчаствуетВРассылкеПДЗ Тогда
		УчаствуетВРассылкеПДЗ = Ложь;
	КонецЕсли;
	// ДИТ 56017 Давудов М.А. Конец: 13.07.2023
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Автор = Пользователи.ТекущийПользователь();
	ЦФО = Автор.ЦФО;
	Создано = ТекущаяДата();
	ОтветственныйЗаДоговор = Автор;
	Организация = Константы.ОсновнаяОрганизация.Получить();
	Маршрутизировать = Константы.МаршрутизироватьДоговор.Получить();
	ТипДоговорнойЗаписи = Перечисления.ТипДоговорнойЗаписи.НовыйДоговор;
//Евросиб Гудкова( 24.09.2019 Ticket№ 0177200
	СрокПредоставленияОригиналаДней = 30;
	СрокПредупрежденияАвтопролонгацииДней = 30;
//Евросиб Гудкова)
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Активный = Ложь;
//Евросиб Гудкова( 12.11.2019
	Подписан = Ложь;
	ПолученОригинал = Ложь;
	ТипДоговорнойЗаписи = Перечисления.ТипДоговорнойЗаписи.НовыйДоговор;
	Маршрутизировать = Константы.МаршрутизироватьДоговор.Получить();
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Редактор = неопределено;
	Изменено = неопределено;
	Состояния.Очистить();
// Евросиб Гудкова) 	

КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	МаршрутизацияСервер.РегистрацияСостоянийДокументаПриЗаписи(ЭтотОбъект, Отказ, Истина);
	МаршрутизацияСервер.МаршрутизацияВРегистрБезРегистратораПриЗаписи(ЭтотОбъект, Отказ);		
	
	ЛичныеЦелиСервер.ДобавитьЗаписиЛичныхЦелей(Ссылка);
	//Евросиб - АСуслов 26.11.2021 16:36:23 #35693
	//(
	РегистрыСведений.ФормированиеФинДокументов.ЗаписатьПараметрыФормированияФинДокументов(Ссылка);
	//)
	//Евросиб - АСуслов 26.11.2021 16:36:24 #35693
	
	// ++ Евросиб Дудоров С.В. US 57543 30.01.2023 
	ТипОтветственныйЗаСопровождение = Перечисления.ТипыОтветственных.ОтветственныйЗаСопровождение;
	КонтрагентыДоговоры_сервер.АктуализацияОтветственныхПоДоговорамКлиента(Ссылка, ЦФО
			, ПолучитьОтветственногоВФормеДоговора(ТипОтветственныйЗаСопровождение)
			, ТипОтветственныйЗаСопровождение
			, Владелец);
	// -- Евросиб Дудоров С.В. US 57543 30.01.2023
	//Евросиб - АСуслов 13.04.2023 14:56:27 #67444
	//(
	ОтложенноеИзменениеСервер.ПоставитьСвязанныеОбъектыВОчередьИзменения(ЭтотОбъект);
	//)
	//Евросиб - АСуслов 13.04.2023 14:56:29 #67444
	
	// ДИТ 56017 Давудов М.А. Начало: 13.07.2023
	Если Не Отказ
	   И УчаствуетВРассылкеПДЗ
	   И Не ПометкаУдаления Тогда
		ЗаполнитьНастройкуРассылкиПДЗ();
	КонецЕсли;
	// ДИТ 56017 Давудов М.А. Конец: 13.07.2023
	
КонецПроцедуры

// ++ Евросиб Дудоров С.В. US 57543 30.01.2023 
Функция ПолучитьОтветственногоВФормеДоговора(ТипОтветственного)
	ОсновнойЦФО = ПредопределенноеЗначение("Справочник.ЦентрыФинансовойОтветственности.ОсновнойЦФО");
	Если ЦФО = Неопределено 
		или ЦФО = ПредопределенноеЗначение("Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка") 
		Тогда ЦФО = ОсновнойЦФО;
	КонецЕсли;	
	Если ТипОтветственного = Неопределено Тогда
		ТипОтветственного = ПредопределенноеЗначение("Перечисление.ТипыОтветственных.ОтветственныйЗаСопровождение");
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДоговорыКонтрагентовОтветственные.Ответственный КАК Ответственный
		|ПОМЕСТИТЬ вт_Ответственные
		|ИЗ
		|	&ТЧОтветственные КАК ДоговорыКонтрагентовОтветственные
		|ГДЕ
		|	ДоговорыКонтрагентовОтветственные.ЦФО = &ЦФО
		|	И ДоговорыКонтрагентовОтветственные.ТипОтветственного = &ТипОтветственного
		|	И ДоговорыКонтрагентовОтветственные.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Ответственные.Ответственный КАК Ответственный
		|ИЗ
		|	вт_Ответственные КАК вт_Ответственные";
	
	Запрос.УстановитьПараметр("ТЧОтветственные", Ответственные.ВыгрузитьКолонки());
	Запрос.УстановитьПараметр("ТипОтветственного", ТипОтветственного);
	Запрос.УстановитьПараметр("ЦФО", ЦФО);
    Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ответственный;
	КонецЦикла;
	Возврат ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
КонецФункции
// -- Евросиб Дудоров С.В. US 57543 30.01.2023 
	

// ДИТ 56017 Давудов М.А. Начало: 13.07.2023
Процедура ЗаполнитьНастройкуРассылкиПДЗ()
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.НастройкиРассылкиПДЗ.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Договор.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Ссылка.Владелец);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтрагентыТабМенеджеры.Фамилия КАК Фамилия,
	|	КонтрагентыТабМенеджеры.Имя КАК Имя,
	|	КонтрагентыТабМенеджеры.Отчество КАК Отчество,
	|	КонтрагентыТабМенеджеры.EMail КАК EMail
	|ИЗ
	|	Справочник.Контрагенты.ТабМенеджеры КАК КонтрагентыТабМенеджеры
	|ГДЕ
	|	КонтрагентыТабМенеджеры.Ссылка = &Контрагент
	|	И (КонтрагентыТабМенеджеры.КонтактДляПСЦ
	|			ИЛИ КонтрагентыТабМенеджеры.КонтактДляСчетаКлиенту
	|			ИЛИ КонтрагентыТабМенеджеры.КонтактДляРеализации)
	|	И КонтрагентыТабМенеджеры.EMail ПОДОБНО ""%@%""
	|	И НЕ КонтрагентыТабМенеджеры.EMail ПОДОБНО ""%@eurosib.biz""";
	
	Результат = Запрос.Выполнить();
	ТаблицаМенеджеров = Результат.Выгрузить();
	
	Если ТаблицаМенеджеров.Количество() = 0 Тогда
		ТекстСообщения = 
			НСтр("ru = 'Для договора ""%1"" не удалось автоматически заполнить «Настройки рассылки ПДЗ», требуется ручное заполнение'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Ссылка);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаМенеджера Из ТаблицаМенеджеров Цикл
		МенеджерЗаписи = РегистрыСведений.НастройкиРассылкиПДЗ.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Договор = Ссылка;
		МенеджерЗаписи.ЭлектроннаяПочта = СтрокаМенеджера.EMail;
		МенеджерЗаписи.ФИО = СтрокаМенеджера.Фамилия + ?(ЗначениеЗаполнено(СтрокаМенеджера.Фамилия), " ", "") + 
			СтрокаМенеджера.Имя + 
			?(ЗначениеЗаполнено(СтрокаМенеджера.Фамилия) ИЛИ ЗначениеЗаполнено(СтрокаМенеджера.Имя), " ", "") + 
		СтрокаМенеджера.Отчество;
		МенеджерЗаписи.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры // ДИТ 56017 Давудов М.А. Конец: 13.07.2023

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если МультивалютныйДоговор
		И ДоговорыОплаты.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Не выбраны договоры оплаты для мультивалютного договора",ЭтотОбъект,"ДоговорыОплаты",,Отказ);
	КонецЕсли;
КонецПроцедуры
