
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("ПараметрПередан", Параметры.Свойство("СписокВидовДоговоров"));
	Список.Параметры.УстановитьЗначениеПараметра("СписокДоговоров", ?(Параметры.Свойство("СписокВидовДоговоров"), Параметры.СписокВидовДоговоров, неопределено));
	Список.Параметры.УстановитьЗначениеПараметра("Контрагент", ?(Параметры.Свойство("Контрагент"), Параметры.Контрагент, неопределено));
	Список.Параметры.УстановитьЗначениеПараметра("Организация", ?(Параметры.Свойство("Организация"), Параметры.Организация, неопределено));

	//ДИТ Авдеева В.С. 46862 08.04.2022 Начало
	Список.Параметры.УстановитьЗначениеПараметра("ОтборПоСпискуКонтрагентов", Параметры.Свойство("СписокКонтрагентов"));
	Список.Параметры.УстановитьЗначениеПараметра("СписокКонтрагентов", ?(Параметры.Свойство("СписокКонтрагентов"), Параметры.СписокКонтрагентов, Неопределено));
	Список.Параметры.УстановитьЗначениеПараметра("ОтборВсеКромеКлиентов", Параметры.Свойство("ОтборВсеКромеКлиентов"));
	//ДИТ Авдеева В.С. 46862 08.04.2022 Конец             
	
	//Евросиб - АСуслов 24.01.2024 11:58:40 #78327
	//(
	Если Параметры.Свойство("Отбор") Тогда
		//Если Параметры.Отбор.Свойство("ВалютаВзаиморасчетовНеРавно") Тогда
		//	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"ВалютаВзаиморасчетов",Параметры.Отбор.ВалютаВзаиморасчетовНеРавно,ВидСравненияКомпоновкиДанных.НеРавно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);			
		//КонецЕсли;
		Если Параметры.Отбор.Свойство("КодРавно") Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Код",Параметры.Отбор.КодРавно,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);			
		КонецЕсли;
		Если Параметры.Отбор.Свойство("ВидДоговораРавно") Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"ВидДоговора",Параметры.Отбор.ВидДоговораРавно,ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);			
		КонецЕсли;
	КонецЕсли;
	//)
	//Евросиб - АСуслов 24.01.2024 11:59:40 #78327
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )
	//Евросиб - АСуслов 04.07.2023 17:55:01 #67501 локации
	//(
	РаботаСФормамиСервер.УстановитьОграничениеНаВыборПомеченныхНаУдалениеЭлементов(Список);
	//)
	//Евросиб - АСуслов 04.07.2023 17:55:09 #67501 локации

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

