
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗначениеПараметра = Неопределено;
	
	Если Параметры.Свойство("Контрагент", ЗначениеПараметра) Тогда
		Контрагент = ЗначениеПараметра;
	КонецЕсли;
	
	Если Параметры.Свойство("ВРеестре", ЗначениеПараметра) Тогда
		ВРеестре = ЗначениеПараметра;
	КонецЕсли;
	
	Если Параметры.Свойство("Период", ЗначениеПараметра) Тогда
		Период = ЗначениеПараметра;
	Иначе
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Параметры.Свойство("Пользователь", ЗначениеПараметра) Тогда
		Пользователь = ЗначениеПараметра;
	Иначе
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если ВРеестре Тогда		
		Элементы.ФормаЗаписать.Заголовок = "Внести клиента";
	Иначе
		Элементы.ФормаЗаписать.Заголовок = "Исключить клиента";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
	
	ЗаписатьВРегистр();
	Оповестить("ЗаписьВРеестреИсключенийИзЗапретаРасходов", Контрагент);
	ОповеститьОбИзменении(Тип("СправочникСсылка.Контрагенты"));
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьВРегистр()
	
	Запись = РегистрыСведений.РеестрИсключенийИзЗапретаРасходовПоОхранеВСтавкуСНДС0.СоздатьМенеджерЗаписи();
	Запись.Период = Период;
	Запись.Пользователь = Пользователь;
	Запись.Контрагент = Контрагент;
	Запись.ВРеестре = ВРеестре;
	Запись.Комментарий = Комментарий;
	Запись.Записать();
	
КонецПроцедуры

#КонецОбласти
