
Процедура АктуализироватьСостоянияОтправленныхВДиадокДокументов() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.АктуализироватьСостоянияОтправленныхВДиадокДокументов);
	
КонецПроцедуры

Процедура ВыдачаЗаданийНаКомплектацииПоездовИНазначениеВагонов() Экспорт
	
	ЗаСколькоВагоны = Константы.ЗаСколькоДоОтправленияСтавитьЗадачуНазначенияВагонов.Получить();
	ЗаСколькоСделки = Константы.ЗаСколькоДоОтправленияСтавитьЗадачуСозданияСделки.Получить();
	ИсполнителиВагоны = Константы.ГруппаИсполнителейПоНазначениюВагонов.Получить();
	ИсполнителиСделки = Константы.ГруппаИсполнителейПоСозданиюСделки.Получить();
	КоридорПоиска = 5; 	// система ищет в коридоре за 5 дней до дедлайна ~ дедлайн и для каждой отправки проверяет, что там все назначено. 
						// Нужно для поиска пропущенных "вчера" отправок
						
	////////////////////////////////
	
	// 1. Ищем отправки без вагонов
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РейсыЖД.Ссылка КАК Ссылка,
	               |	РейсыЖД.ДатаОтправления КАК ДатаОтправления
	               |ИЗ
	               |	Справочник.РейсыЖД КАК РейсыЖД
	               |ГДЕ
	               |	НЕ РейсыЖД.ПометкаУдаления
	               |	И РейсыЖД.ДатаОтправления МЕЖДУ &Дата1 И &Дата2
	               |	И НЕ РейсыЖД.Ссылка В
	               |				(ВЫБРАТЬ
	               |					ВагоныВОтправке.Отправка КАК Отправка
	               |				ИЗ
	               |					РегистрСведений.ВагоныВОтправке КАК ВагоныВОтправке)
	               |	И НЕ РейсыЖД.РейсОтменен";
	Запрос.УстановитьПараметр("Дата1", ТекущаяДата()-КоридорПоиска*24*3600);
	Запрос.УстановитьПараметр("Дата2", ТекущаяДата()+ЗаСколькоВагоны*24*3600);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		// немного плагиата...
		ПолучОб = Ответ.Ссылка.ПолучитьОбъект();
		ТЧ = ПолучОб.Состояния;
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Состояние", Справочники.Состояния.ТребуетсяНазначениеВагонов);
		НайденныеСтроки = ТЧ.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			ТекСтр = ТЧ.Добавить();
			ТекСтр.Состояние = Справочники.Состояния.ТребуетсяНазначениеВагонов;
			ТекСтр.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
			ТекСтр.Исполнитель = ИсполнителиВагоны;
			ТекСтр.НормативИсполненияСМоментаСоздания = 2;
			ТекСтр.НачалоРаботы = Ответ.ДатаОтправления - ЗаСколькоВагоны*24*3600;
			Попытка
				ПолучОб.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
			
	КонецЦикла;
	
	// 2. Ищем отправки без сделок
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РейсыЖД.Ссылка КАК Ссылка,
	               |	РейсыЖД.ДатаОтправления КАК ДатаОтправления
	               |ИЗ
	               |	Справочник.РейсыЖД КАК РейсыЖД
	               |ГДЕ
	               |	НЕ РейсыЖД.ПометкаУдаления
	               |	И РейсыЖД.ДатаОтправления МЕЖДУ &Дата1 И &Дата2
	               |	И НЕ РейсыЖД.Ссылка В
	               |				(ВЫБРАТЬ
	               |					СделкаРейсы.Рейс КАК Рейс
	               |				ИЗ
	               |					Документ.Сделка.Рейсы КАК СделкаРейсы)";
	Запрос.УстановитьПараметр("Дата1", ТекущаяДата()-КоридорПоиска*24*3600);
	Запрос.УстановитьПараметр("Дата2", ТекущаяДата()+ЗаСколькоСделки*24*3600);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		// немного плагиата...
		ПолучОб = Ответ.Ссылка.ПолучитьОбъект();
		ТЧ = ПолучОб.Состояния;
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Состояние", Справочники.Состояния.ТребуетсяСозданиеСделки);
		НайденныеСтроки = ТЧ.НайтиСтроки(ПараметрыОтбора);
		
		НайдОтветственный = ОтветственныйПоРейсуЗаСозданиеСделки(Ответ.Ссылка);
		
		Если НайденныеСтроки.Количество() = 0 И НайдОтветственный <> неопределено Тогда
			ТекСтр = ТЧ.Добавить();
			ТекСтр.Состояние = Справочники.Состояния.ТребуетсяСозданиеСделки;
			ТекСтр.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
			ТекСтр.Исполнитель = НайдОтветственный;
			ТекСтр.НормативИсполненияСМоментаСоздания = 2;
			ТекСтр.НачалоРаботы = Ответ.ДатаОтправления - ЗаСколькоСделки*24*3600;
			Попытка
				ПолучОб.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
	////////////////////////////////
	// Работа завершена. Все что ниже - оставлено для дальнейшего обсуждения
	Возврат;
	////////////////////////////////
	
	//Счетчик = 0;
	//Пока Счетчик<2 Цикл
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ
	//	               |	ВагоныВОтправке.Отправка КАК Отправка
	//	               |ПОМЕСТИТЬ ОтправкиСВагонами
	//	               |ИЗ
	//	               |	РегистрСведений.ВагоныВОтправке КАК ВагоныВОтправке
	//	               |ГДЕ
	//	               |	ВагоныВОтправке.Отправка.ДатаОтправления <= &ДатаНачалаНапоминания
	//	               |;
	//	               |
	//	               |////////////////////////////////////////////////////////////////////////////////
	//	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	               |	РейсыЖД.Ссылка КАК Ссылка
	//	               |ПОМЕСТИТЬ ОтправкиБезВагонов
	//	               |ИЗ
	//	               |	Справочник.РейсыЖД КАК РейсыЖД
	//	               |ГДЕ
	//	               |	НЕ РейсыЖД.Ссылка В
	//	               |				(ВЫБРАТЬ
	//	               |					ОтправкиСВагонами.Отправка
	//	               |				ИЗ
	//	               |					ОтправкиСВагонами КАК ОтправкиСВагонами)
	//	               |
	//	               |СГРУППИРОВАТЬ ПО
	//	               |	РейсыЖД.Ссылка
	//	               |;
	//	               |
	//	               |////////////////////////////////////////////////////////////////////////////////
	//	               |ВЫБРАТЬ
	//	               |	ОтправкиБезВагонов.Ссылка КАК Ссылка,
	//	               |	МАКСИМУМ(ЕСТЬNULL(РейсыЖДСостояния.НормативИсполненияСМоментаСоздания, 0)) КАК НормативИсполненияСМоментаСоздания
	//	               |ИЗ
	//	               |	ОтправкиБезВагонов КАК ОтправкиБезВагонов
	//	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РейсыЖД.Состояния КАК РейсыЖДСостояния
	//	               |		ПО ОтправкиБезВагонов.Ссылка = РейсыЖДСостояния.Ссылка
	//	               |
	//	               |СГРУППИРОВАТЬ ПО
	//	               |	ОтправкиБезВагонов.Ссылка";
	//	
	//	Если Счетчик = 0 Тогда
	//		Запрос.УстановитьПараметр("ДатаНачалаНапоминания", ТекущаяДата()+ЗаСколькоВагоны*24*3600);//+КоридорПоиска*24*3600);
	//		Состояние = Справочники.Состояния.ТребуетсяНазначениеВагонов;
	//		НачалоРаботы = ЗаСколькоВагоны*24*3600;
	//	Иначе
	//		Запрос.УстановитьПараметр("ДатаНачалаНапоминания", ТекущаяДата()+ЗаСколькоСделки*24*3600);//+КоридорПоиска*24*3600);
	//		Состояние = Справочники.Состояния.ТребуетсяСозданиеСделки;
	//		НачалоРаботы = ЗаСколькоСделки*24*3600;
	//	КонецЕсли;
	//	
	//	Ответ = Запрос.Выполнить().Выбрать();
	//	Пока Ответ.Следующий() Цикл
	//		
	//		ПолучОб = Ответ.Ссылка.ПолучитьОбъект();
	//		ТЧ = ПолучОб.Состояния;
	//		
	//		ПараметрыОтбора = Новый Структура;
	//		ПараметрыОтбора.Вставить("Состояние",Состояние);
	//		НайденныеСтроки = ТЧ.НайтиСтроки(ПараметрыОтбора);
	//		Если НайденныеСтроки.Количество()=0 Тогда
	//			ТекСтр = ТЧ.Добавить();
	//			ТекСтр.Состояние = Состояние;
	//		Иначе
	//			ТекСтр = НайденныеСтроки[0];
	//		КонецЕсли;
	//		ТекСтр.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//		ТекСтр.Исполнитель = Константы.ГруппаИсполнителейПоСозданиюСделки.Получить();
	//		ТекСтр.НачалоРаботы = ПолучОб.ДатаОтправления-НачалоРаботы;
	//		ТекСтр.ЗавершениеРаботы = (ПолучОб.ДатаОтправления-НачалоРаботы)+2*3600;
	//		// нужно прибавить 2 часа к максимальному часу в таблице, чтобы получить нарастающий итог
	//		ТекСтр.НормативИсполненияСМоментаСоздания = Ответ.НормативИсполненияСМоментаСоздания + 2;
	//		Попытка
	//			ПолучОб.Записать();
	//		Исключение
	//			Продолжить;
	//		КонецПопытки;
	//	КонецЦикла;
	//	Счетчик = Счетчик+1;
	//КонецЦикла;
	
КонецПроцедуры

Функция ОтветственныйПоРейсуЗаСозданиеСделки(Рейс)
	
	Результат = неопределено;
	
	Запрос = Новый Запрос;
	// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 30.11.2022
	// Было:
	//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	//               |	ЗаявкаПереченьРейсов.Ссылка.Договор.ОтветственныйЗаСопровождение КАК Ответственный
	//               |ИЗ
	//               |	Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
	//               |ГДЕ
	//               |	ЗаявкаПереченьРейсов.Рейс = &Рейс";
	//Стало:
	//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	//               |	ТЧОтветственные.Ответственный КАК Ответственный
	//               |ИЗ
	//               |	Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
	//               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.Ответственные КАК ТЧОтветственные
	//               |		ПО ЗаявкаПереченьРейсов.Ссылка.Договор = ТЧОтветственные.Ссылка
	//               |			И ЗаявкаПереченьРейсов.Ссылка.Договор = ТЧОтветственные.Ссылка
	//               |			И (ТЧОтветственные.ЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ОсновнойЦФО))
	//               |			И (ТЧОтветственные.ТипОтветственного = ЗНАЧЕНИЕ(Перечисление.ТипыОтветственных.ОтветственныйЗаСопровождение))
	//               |ГДЕ
	//               |	ЗаявкаПереченьРейсов.Рейс = &Рейс";
	// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 30.11.2022
	
	//Евросиб СубботинВ #117990 20.01.2026 Начало 
	//ДИТ, Беляев СЮ, Ticket#0304020, 14-03-2023, начало
	//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	//               |	ТЧОтветственные.Ответственный КАК Ответственный,
	//               |	ТЧОтветственные.ЦФО КАК ОтветственныйЦФО,
	//               |	ЗаявкаПереченьРейсов.Ссылка.ЦФО КАК ЗаявкаЦФО
	//               |ПОМЕСТИТЬ ВТ_Ответственные
	//               |ИЗ
	//               |	Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
	//               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.Ответственные КАК ТЧОтветственные
	//               |		ПО ЗаявкаПереченьРейсов.Ссылка.Договор = ТЧОтветственные.Ссылка
	//               |			И ЗаявкаПереченьРейсов.Ссылка.Договор = ТЧОтветственные.Ссылка
	//               |			И (ТЧОтветственные.ТипОтветственного = ЗНАЧЕНИЕ(Перечисление.ТипыОтветственных.ОтветственныйЗаСопровождение))
	//               |ГДЕ
	//               |	ЗаявкаПереченьРейсов.Рейс = &Рейс
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ВТ_ОтветственныеСУчетомЦФОЗаявки.Ответственный КАК Ответственный
	//               |ИЗ
	//               |	ВТ_Ответственные КАК ВТ_ОтветственныеСУчетомЦФОЗаявки
	//               |ГДЕ
	//               |	ВТ_ОтветственныеСУчетомЦФОЗаявки.ЗаявкаЦФО = ВТ_ОтветственныеСУчетомЦФОЗаявки.ОтветственныйЦФО
	//               |
	//               |ОБЪЕДИНИТЬ
	//               |
	//               |ВЫБРАТЬ
	//               |	ВТ_ОтветственныеПоОсновномуЦФО.Ответственный
	//               |ИЗ
	//               |	ВТ_Ответственные КАК ВТ_ОтветственныеПоОсновномуЦФО
	//               |ГДЕ
	//               |	ВТ_ОтветственныеПоОсновномуЦФО.ОтветственныйЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ОсновнойЦФО)
	//               |	И НЕ 1 В
	//               |				(ВЫБРАТЬ ПЕРВЫЕ 1
	//               |					1
	//               |				ИЗ
	//               |					ВТ_Ответственные КАК ВТ_Ответственные
	//               |				ГДЕ
	//               |					ВТ_Ответственные.ЗаявкаЦФО = ВТ_Ответственные.ОтветственныйЦФО)";
	//ДИТ, Беляев СЮ, Ticket#0304020, 14-03-2023, конец
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВЫБОР
		               |		КОГДА ТИПЗНАЧЕНИЯ(ТЧОтветственные.Ответственный) = ТИП(Справочник.ГруппыПользователей)
		               |			ТОГДА ГруппыПользователейСостав.Пользователь
		               |		ИНАЧЕ Пользователи.Ссылка
		               |	КОНЕЦ КАК Ответственный,
		               |	ТЧОтветственные.ЦФО КАК ОтветственныйЦФО,
		               |	ЗаявкаПереченьРейсов.Ссылка.ЦФО КАК ЗаявкаЦФО
		               |ПОМЕСТИТЬ ВТ_Ответственные
		               |ИЗ
		               |	Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.Ответственные КАК ТЧОтветственные
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		               |			ПО ТЧОтветственные.Ответственный = Пользователи.Ссылка
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
		               |			ПО ТЧОтветственные.Ответственный = ГруппыПользователейСостав.Пользователь
		               |		ПО ЗаявкаПереченьРейсов.Ссылка.Договор = ТЧОтветственные.Ссылка
		               |			И (ТЧОтветственные.ТипОтветственного = ЗНАЧЕНИЕ(Перечисление.ТипыОтветственных.ОтветственныйЗаСопровождение))
		               |ГДЕ
		               |	ЗаявкаПереченьРейсов.Рейс = &Рейс
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ОтветственныеСУчетомЦФОЗаявки.Ответственный КАК Ответственный
		               |ИЗ
		               |	ВТ_Ответственные КАК ВТ_ОтветственныеСУчетомЦФОЗаявки
		               |ГДЕ
		               |	ВТ_ОтветственныеСУчетомЦФОЗаявки.ЗаявкаЦФО = ВТ_ОтветственныеСУчетомЦФОЗаявки.ОтветственныйЦФО
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ
		               |	ВТ_ОтветственныеПоОсновномуЦФО.Ответственный
		               |ИЗ
		               |	ВТ_Ответственные КАК ВТ_ОтветственныеПоОсновномуЦФО
		               |ГДЕ
		               |	ВТ_ОтветственныеПоОсновномуЦФО.ОтветственныйЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ОсновнойЦФО)
		               |	И НЕ 1 В
		               |				(ВЫБРАТЬ ПЕРВЫЕ 1
		               |					1
		               |				ИЗ
		               |					ВТ_Ответственные КАК ВТ_Ответственные
		               |				ГДЕ
		               |					ВТ_Ответственные.ЗаявкаЦФО = ВТ_Ответственные.ОтветственныйЦФО)";
	//Евросиб СубботинВ #117990 20.01.2026 Конец
	
		Запрос.УстановитьПараметр("Рейс", Рейс);
	СписокОтветственных = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ответственный");
	
	Если СписокОтветственных.Количество() = 1 И ЗначениеЗаполнено(СписокОтветственных[0]) Тогда
		Результат = СписокОтветственных[0];
	ИначеЕсли СписокОтветственных.Количество() > 1 Тогда
		Результат = Константы.ГруппаИсполнителейПоСозданиюСделки.Получить();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


Функция ВагоныНазначены(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ВагоныВОтправке.Вагон КАК Вагон
	               |ИЗ
	               |	РегистрСведений.ВагоныВОтправке КАК ВагоныВОтправке
	               |ГДЕ
	               |	ВагоныВОтправке.Отправка = &Отправка";
	Запрос.УстановитьПараметр("Отправка", Ссылка);
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Процедура АктуализацияИнформацииОтТерминалов() Экспорт
	
	// ДИТ 65310 Давудов М.А. Начало: 16.02.2023
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИнформацияОтТерминалов.Период КАК Период,
	|	ИнформацияОтТерминалов.Контейнер КАК Контейнер,
	|	ИнформацияОтТерминалов.НомерКонтейнера КАК НомерКонтейнера,
	|	ИнформацияОтТерминалов.КодТерминала КАК КодТерминала,
	|	ИнформацияОтТерминалов.НомерТранспорта КАК НомерТранспорта,
	|	ИнформацияОтТерминалов.КомментарийКОшибке КАК КомментарийКОшибке
	|ИЗ
	|	РегистрСведений.ИнформацияОтТерминалов КАК ИнформацияОтТерминалов
	|ГДЕ
	|	ИнформацияОтТерминалов.Транспорт = ЗНАЧЕНИЕ(Перечисление.ВидыТранспорта.ЖД)
	|	И ТИПЗНАЧЕНИЯ(ИнформацияОтТерминалов.НомерТранспорта) = ТИП(СТРОКА)
	|	И ИнформацияОтТерминалов.КомментарийКОшибке ПОДОБНО ""%которого нет в справочнике """"Вагоны, суда, авто""""%""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИнформацияОтТерминалов.Период,
	|	ИнформацияОтТерминалов.Контейнер,
	|	ИнформацияОтТерминалов.НомерКонтейнера,
	|	ИнформацияОтТерминалов.КодТерминала,
	|	"""",
	|	ИнформацияОтТерминалов.КомментарийКОшибке
	|ИЗ
	|	РегистрСведений.ИнформацияОтТерминалов КАК ИнформацияОтТерминалов
	|ГДЕ
	|	ИнформацияОтТерминалов.Транспорт = ЗНАЧЕНИЕ(Перечисление.ВидыТранспорта.ЖД)
	|	И ИнформацияОтТерминалов.НомерТранспорта = ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)
	|	И ИнформацияОтТерминалов.КомментарийКОшибке ПОДОБНО ""%которого нет в справочнике """"Вагоны, суда, авто""""%""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИнформацияОтТерминалов.Период,
	|	ИнформацияОтТерминалов.Контейнер,
	|	ИнформацияОтТерминалов.НомерКонтейнера,
	|	ИнформацияОтТерминалов.КодТерминала,
	|	"""",
	|	ИнформацияОтТерминалов.КомментарийКОшибке
	|ИЗ
	|	РегистрСведений.ИнформацияОтТерминалов КАК ИнформацияОтТерминалов
	|ГДЕ
	|	ИнформацияОтТерминалов.Транспорт = ЗНАЧЕНИЕ(Перечисление.ВидыТранспорта.ЖД)
	|	И ИнформацияОтТерминалов.НомерТранспорта = НЕОПРЕДЕЛЕНО
	|	И ИнформацияОтТерминалов.КомментарийКОшибке ПОДОБНО ""%которого нет в справочнике """"Вагоны, суда, авто""""%""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТС.Ссылка КАК Ссылка,
	|	ТС.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ТС КАК ТС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипоразмерыТС КАК ТипоразмерыТС
	|		ПО ТС.ТипТС = ТипоразмерыТС.Ссылка
	|ГДЕ
	|	ЕСТЬNULL(ТипоразмерыТС.Вагон, ЛОЖЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИнформацияОтТерминалов.Период КАК Период,
	|	ИнформацияОтТерминалов.Контейнер КАК Контейнер,
	|	ИнформацияОтТерминалов.НомерКонтейнера КАК НомерКонтейнера,
	|	ИнформацияОтТерминалов.КодТерминала КАК КодТерминала,
	|	ИнформацияОтТерминалов.КомментарийКОшибке КАК КомментарийКОшибке
	|ИЗ
	|	РегистрСведений.ИнформацияОтТерминалов КАК ИнформацияОтТерминалов
	|ГДЕ
	|	ИнформацияОтТерминалов.Терминал = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|	И ИнформацияОтТерминалов.КомментарийКОшибке ПОДОБНО ""%которого нет в справочнике """"Локации (терминал)""""%""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Локации.Ссылка КАК Ссылка,
	|	Локации.ПредставлениеВCodeco КАК ПредставлениеВCodeco
	|ИЗ
	|	Справочник.Локации КАК Локации
	|ГДЕ
	|	Локации.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Терминал)";
	
	ТаблицаРезультат = Запрос.ВыполнитьПакет();
	
	ТЗНомерТранспорта = ТаблицаРезультат[0].Выгрузить();
	ТЗВагоны = ТаблицаРезультат[1].Выгрузить();
	ТЗКодовТерминалов = ТаблицаРезультат[2].Выгрузить();
	ТЗТерминалы = ТаблицаРезультат[3].Выгрузить();
	
	ЗаполнитьДанныеНомерТранспорта(ТЗНомерТранспорта, ТЗВагоны);
	ЗаполнитьДанныеКодТерминала(ТЗКодовТерминалов, ТЗТерминалы);
	// ДИТ 65310 Давудов М.А. Конец: 16.02.2023
	
КонецПроцедуры

Процедура ЗаполнитьДанныеНомерТранспорта(ТЗНомерТранспорта, ТЗВагоны)
	
	// ДИТ 65310 Давудов М.А. Начало: 16.02.2023
	Для Каждого СтрокаТЗ Из ТЗНомерТранспорта Цикл
		
		Попытка
			МенеджерЗаписи = РегистрыСведений.ИнформацияОтТерминалов.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = СтрокаТЗ.Период;
			МенеджерЗаписи.Контейнер = СтрокаТЗ.Контейнер;
			МенеджерЗаписи.НомерКонтейнера = СтрокаТЗ.НомерКонтейнера;
			//МенеджерЗаписи.КодТерминала = СтрокаТЗ.КодТерминала;
			//МенеджерЗаписи.Прочитать();
			//ДИТ, Беляев СЮ, BUG 67625/TA 72362, 07-07-2023, начало
			МенеджерЗаписи.Прочитать();
			МенеджерЗаписи.КодТерминала = СтрокаТЗ.КодТерминала;
			//ДИТ, Беляев СЮ, BUG 67625/TA 72362, 07-07-2023, конец
			
			СообщениеПоВагону = "";
			УдалитьОшибкуПоВагону = Ложь;
			МассивСообщений = СтрРазделить(МенеджерЗаписи.КомментарийКОшибке, Символы.ПС, Ложь);
			НовыйМассивСообщений = Новый Массив;
			Для Каждого СообщениеМассива Из МассивСообщений Цикл
				Если СтрНайти(СообщениеМассива,"которого нет в справочнике ""Вагоны, суда, авто"" DataCore") > 0 Тогда
					СообщениеПоВагону = СообщениеМассива;
					СообщениеМассива = "";
				Иначе
					НовыйМассивСообщений.Добавить(СообщениеМассива);
				КонецЕсли;
			КонецЦикла;
			
			Если Не ЗначениеЗаполнено(СтрокаТЗ.НомерТранспорта) Тогда
				
				Если СообщениеПоВагону = "" Тогда
					Продолжить;
				КонецЕсли;
				
				ПозицияСимволаОкончание = СтрНайти(СообщениеПоВагону, ">") - 1;
				ПозицияСимволаНачало =  СтрНайти(СообщениеПоВагону, "<");
				
				Если ПозицияСимволаОкончание <= 0
					ИЛИ ПозицияСимволаНачало = 0 Тогда
					//Сообщение отличается от шаблона
					Продолжить;
				КонецЕсли;
				
				ДлинаНомера = ПозицияСимволаОкончание - ПозицияСимволаНачало;
				
				Если ДлинаНомера > 150 Тогда
					//Не может быть больше 150 символов (ограничение длины наименования "Справочник.ТС"
					Продолжить;
				КонецЕсли;
				
				НомерТранспорта = Сред(
				СообщениеПоВагону,
				СтрНайти(СообщениеПоВагону, "<") + 1,
				ДлинаНомера);
				
				Если НомерТранспорта = "" Тогда
					Продолжить;
				КонецЕсли;
				
			Иначе
				
				НомерТранспорта = СтрокаТЗ.НомерТранспорта;
				
			КонецЕсли;
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Наименование", НомерТранспорта);
			НайденныеСтроки = ТЗВагоны.НайтиСтроки(СтруктураОтбора);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				НомерТранспорта = НайденныеСтроки[0].Ссылка;
				УдалитьОшибкуПоВагону = Истина;
			КонецЕсли;
			
			МенеджерЗаписи.НомерТранспорта = НомерТранспорта;
			Если УдалитьОшибкуПоВагону Тогда
				МенеджерЗаписи.Ошибка = Ложь;
				МенеджерЗаписи.КомментарийКОшибке = СтрСоединить(НовыйМассивСообщений, Символы.ПС);
			КонецЕсли;
			
			РегистрыСведений.ИнформацияОтТерминалов.ПроверитьЗапись(МенеджерЗаписи);
			МенеджерЗаписи.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось обновить номер транспорта в записях регистра: "+ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	// ДИТ 65310 Давудов М.А. Конец: 16.02.2023
	
КонецПроцедуры

Процедура ЗаполнитьДанныеКодТерминала(ТЗКодовТерминалов, ТЗТерминалы)
	
	// ДИТ 65310 Давудов М.А. Начало: 16.02.2023
	Для Каждого СтрокаТЗ Из ТЗКодовТерминалов Цикл
		
		Попытка
			МенеджерЗаписи = РегистрыСведений.ИнформацияОтТерминалов.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = СтрокаТЗ.Период;
			МенеджерЗаписи.Контейнер = СтрокаТЗ.Контейнер;
			МенеджерЗаписи.НомерКонтейнера = СтрокаТЗ.НомерКонтейнера;
			//МенеджерЗаписи.КодТерминала = СтрокаТЗ.КодТерминала;
			//МенеджерЗаписи.Прочитать();
			//ДИТ, Беляев СЮ, BUG 67625/TA 72362, 07-07-2023, начало
			МенеджерЗаписи.Прочитать();
			МенеджерЗаписи.КодТерминала = СтрокаТЗ.КодТерминала;
			//ДИТ, Беляев СЮ, BUG 67625/TA 72362, 07-07-2023, конец
			
			СообщениеПоКодуТерминала = "";
			УдалитьОшибкуПоТерминула = Ложь;
			МассивСообщений = СтрРазделить(МенеджерЗаписи.КомментарийКОшибке, Символы.ПС, Ложь);
			НовыйМассивСообщений = Новый Массив;
			Для Каждого СообщениеМассива Из МассивСообщений Цикл
				Если СтрНайти(СообщениеМассива,"которого нет в справочнике ""Локации (терминал)""") > 0 Тогда
					СообщениеПоКодуТерминала = СообщениеМассива;
					СообщениеМассива = "";
				Иначе
					НовыйМассивСообщений.Добавить(СообщениеМассива);
				КонецЕсли;
			КонецЦикла;
				
			Если НЕ ЗначениеЗаполнено(СтрокаТЗ.КодТерминала) Тогда
				
				Если СообщениеПоКодуТерминала = "" Тогда
					Продолжить;
				КонецЕсли;
				
				ПозицияСимволаОкончание = СтрНайти(СообщениеПоКодуТерминала, ">") - 1;
				ПозицияСимволаНачало =  СтрНайти(СообщениеПоКодуТерминала, "<");
				
				Если ПозицияСимволаОкончание <= 0
					ИЛИ ПозицияСимволаНачало = 0 Тогда
					//Сообщение отличается от шаблона
					Продолжить;
				КонецЕсли;
				
				ДлинаНомера = ПозицияСимволаОкончание - ПозицияСимволаНачало;
				
				Если ДлинаНомера > 30 Тогда
					//Не может быть больше 30 символов (ограничение длины реквизита "ПредставлениеВCodeco" "Справочник.Локации"
					Продолжить;
				КонецЕсли;
				
				КодТерминала = Сред(
				СообщениеПоКодуТерминала,
				СтрНайти(СообщениеПоКодуТерминала, "<") + 1,
				ДлинаНомера);
				
				Если КодТерминала = "" Тогда
					Продолжить;
				КонецЕсли;
				
			Иначе
				
				КодТерминала = СтрокаТЗ.КодТерминала;
				
			КонецЕсли;
				
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("ПредставлениеВCodeco", КодТерминала);
			НайденныеСтроки = ТЗТерминалы.НайтиСтроки(СтруктураОтбора);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				МенеджерЗаписи.Терминал = НайденныеСтроки[0].Ссылка;
				УдалитьОшибкуПоТерминула = Истина;
			КонецЕсли;
			
			МенеджерЗаписи.КодТерминала = КодТерминала;
			Если УдалитьОшибкуПоТерминула Тогда
				МенеджерЗаписи.Ошибка = Ложь;
				МенеджерЗаписи.КомментарийКОшибке = СтрСоединить(НовыйМассивСообщений, Символы.ПС);
			КонецЕсли;
			
			РегистрыСведений.ИнформацияОтТерминалов.ПроверитьЗапись(МенеджерЗаписи);
			МенеджерЗаписи.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось обновить код терминала в записях регистра: "+ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	// ДИТ 65310 Давудов М.А. Конец: 16.02.2023
	
КонецПроцедуры

Процедура ОбновитьСтатусОтправкиИПодписанияЭДОвРТУ() Экспорт //Евросиб Шевченко А.В. 24.06.2025 US 104900 TA 112049
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияДополнительныхАналитикДокументов.Документ КАК Документ
		|ПОМЕСТИТЬ ВТ_РТУНаслежение
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхАналитикДокументов КАК ЗначенияДополнительныхАналитикДокументов
		|ГДЕ
		|	ЗначенияДополнительныхАналитикДокументов.Аналитика = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеАналитикиДокументов.НеОтслеживатьРТУвЭДО)
		|	И ЗначенияДополнительныхАналитикДокументов.Значение = ЛОЖЬ
		|	И ЗначенияДополнительныхАналитикДокументов.Документ.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗначенияДополнительныхАналитикДокументов.Документ КАК Документ,
		|	ЗначенияДополнительныхАналитикДокументов.Значение КАК Значение
		|ПОМЕСТИТЬ ВТ_РТУНеВРаботеНЕТребуютНачалаРаботы
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхАналитикДокументов КАК ЗначенияДополнительныхАналитикДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РТУНаслежение КАК ВТ_РТУНаслежение
		|		ПО (ВТ_РТУНаслежение.Документ = ЗначенияДополнительныхАналитикДокументов.Документ)
		|ГДЕ
		|	ЗначенияДополнительныхАналитикДокументов.Аналитика = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеАналитикиДокументов.СтатусОтправкиИПодписанияРТУ)
		|	И ЗначенияДополнительныхАналитикДокументов.Значение = ЗНАЧЕНИЕ(Перечисление.СтатусыОтправкиИПодписанияРТУ.ДокументНеВРаботеИНеТребуетНачалаРаботы)
		|	И ЗначенияДополнительныхАналитикДокументов.Документ.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗначенияДополнительныхАналитикДокументов.Документ,
		|	ЗначенияДополнительныхАналитикДокументов.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхАналитикДокументов КАК ЗначенияДополнительныхАналитикДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РТУНаслежение КАК ВТ_РТУНаслежение
		|		ПО (ВТ_РТУНаслежение.Документ = ЗначенияДополнительныхАналитикДокументов.Документ)
		|ГДЕ
		|	ЗначенияДополнительныхАналитикДокументов.Аналитика = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеАналитикиДокументов.СтатусОтправкиИПодписанияРТУ)
		|	И ЗначенияДополнительныхАналитикДокументов.Значение = ЗНАЧЕНИЕ(Перечисление.СтатусыОтправкиИПодписанияРТУ.НеОтправлен)
		|	И ЗначенияДополнительныхАналитикДокументов.Документ.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗначенияДополнительныхАналитикДокументов.Документ,
		|	ЗначенияДополнительныхАналитикДокументов.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхАналитикДокументов КАК ЗначенияДополнительныхАналитикДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РТУНаслежение КАК ВТ_РТУНаслежение
		|		ПО (ВТ_РТУНаслежение.Документ = ЗначенияДополнительныхАналитикДокументов.Документ)
		|ГДЕ
		|	ЗначенияДополнительныхАналитикДокументов.Аналитика = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеАналитикиДокументов.СтатусОтправкиИПодписанияРТУ)
		|	И ЗначенияДополнительныхАналитикДокументов.Значение = ЗНАЧЕНИЕ(Перечисление.СтатусыОтправкиИПодписанияРТУ.НеОтправленПослеEmail)
		|	И ЗначенияДополнительныхАналитикДокументов.Документ.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗначенияДополнительныхАналитикДокументов.Документ,
		|	ЗначенияДополнительныхАналитикДокументов.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхАналитикДокументов КАК ЗначенияДополнительныхАналитикДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РТУНаслежение КАК ВТ_РТУНаслежение
		|		ПО (ВТ_РТУНаслежение.Документ = ЗначенияДополнительныхАналитикДокументов.Документ)
		|ГДЕ
		|	ЗначенияДополнительныхАналитикДокументов.Аналитика = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеАналитикиДокументов.СтатусОтправкиИПодписанияРТУ)
		|	И ЗначенияДополнительныхАналитикДокументов.Значение = ЗНАЧЕНИЕ(Перечисление.СтатусыОтправкиИПодписанияРТУ.ОжидаетсяПодписьКонтрагента)
		|	И ЗначенияДополнительныхАналитикДокументов.Документ.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗначенияДополнительныхАналитикДокументов.Документ,
		|	ЗначенияДополнительныхАналитикДокументов.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхАналитикДокументов КАК ЗначенияДополнительныхАналитикДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РТУНаслежение КАК ВТ_РТУНаслежение
		|		ПО (ВТ_РТУНаслежение.Документ = ЗначенияДополнительныхАналитикДокументов.Документ)
		|ГДЕ
		|	ЗначенияДополнительныхАналитикДокументов.Аналитика = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеАналитикиДокументов.СтатусОтправкиИПодписанияРТУ)
		|	И ЗначенияДополнительныхАналитикДокументов.Значение = ЗНАЧЕНИЕ(Перечисление.СтатусыОтправкиИПодписанияРТУ.КонтрагентОтказалВПодписи)
		|	И ЗначенияДополнительныхАналитикДокументов.Документ.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗначенияДополнительныхАналитикДокументов.Документ,
		|	ЗначенияДополнительныхАналитикДокументов.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхАналитикДокументов КАК ЗначенияДополнительныхАналитикДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РТУНаслежение КАК ВТ_РТУНаслежение
		|		ПО (ВТ_РТУНаслежение.Документ = ЗначенияДополнительныхАналитикДокументов.Документ)
		|ГДЕ
		|	ЗначенияДополнительныхАналитикДокументов.Аналитика = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеАналитикиДокументов.СтатусОтправкиИПодписанияРТУ)
		|	И ЗначенияДополнительныхАналитикДокументов.Значение = ЗНАЧЕНИЕ(Перечисление.СтатусыОтправкиИПодписанияРТУ.ТребуетсяАннулирование)
		|	И ЗначенияДополнительныхАналитикДокументов.Документ.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗначенияДополнительныхАналитикДокументов.Документ,
		|	ЗначенияДополнительныхАналитикДокументов.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхАналитикДокументов КАК ЗначенияДополнительныхАналитикДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РТУНаслежение КАК ВТ_РТУНаслежение
		|		ПО (ВТ_РТУНаслежение.Документ = ЗначенияДополнительныхАналитикДокументов.Документ)
		|ГДЕ
		|	ЗначенияДополнительныхАналитикДокументов.Аналитика = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеАналитикиДокументов.СтатусОтправкиИПодписанияРТУ)
		|	И ЗначенияДополнительныхАналитикДокументов.Значение = ЗНАЧЕНИЕ(Перечисление.СтатусыОтправкиИПодписанияРТУ.ТребуетсяУточнение)
		|	И ЗначенияДополнительныхАналитикДокументов.Документ.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗначенияДополнительныхАналитикДокументов.Документ,
		|	ЗначенияДополнительныхАналитикДокументов.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхАналитикДокументов КАК ЗначенияДополнительныхАналитикДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РТУНаслежение КАК ВТ_РТУНаслежение
		|		ПО (ВТ_РТУНаслежение.Документ = ЗначенияДополнительныхАналитикДокументов.Документ)
		|ГДЕ
		|	ЗначенияДополнительныхАналитикДокументов.Аналитика = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеАналитикиДокументов.СтатусОтправкиИПодписанияРТУ)
		|	И ЗначенияДополнительныхАналитикДокументов.Значение = ЗНАЧЕНИЕ(Перечисление.СтатусыОтправкиИПодписанияРТУ.НеПолучен)
		|	И ЗначенияДополнительныхАналитикДокументов.Документ.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РТУНеВРаботеНЕТребуютНачалаРаботы.Документ КАК Документ,
		|	ВТ_РТУНеВРаботеНЕТребуютНачалаРаботы.Документ.Дата КАК ДокументДата,
		|	ЕСТЬNULL(СостоянияДокументовВДиадоке.СостояниеДокументооборота, """") КАК СостояниеДокументооборота,
		|	ЕСТЬNULL(ДАТАВРЕМЯ(1, 1, 1), ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПодписиКонтрагентом,
		|	ВТ_РТУНеВРаботеНЕТребуютНачалаРаботы.Значение КАК Статус,
		|	ЕСТЬNULL(ОтправленныеПоПочтеДокументыСрезПоследних.ДатаОтправки, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаОтправкиЭлПисьма,
		|	ЕСТЬNULL(СостоянияДокументовВДиадоке.ДатаОбновленияСостояния, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаОбновленияСостояния
		|ИЗ
		|	ВТ_РТУНеВРаботеНЕТребуютНачалаРаботы КАК ВТ_РТУНеВРаботеНЕТребуютНачалаРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияДокументовВДиадоке КАК СостоянияДокументовВДиадоке
		|		ПО ВТ_РТУНеВРаботеНЕТребуютНачалаРаботы.Документ = СостоянияДокументовВДиадоке.Документ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтправленныеПоПочтеДокументы.СрезПоследних(, ) КАК ОтправленныеПоПочтеДокументыСрезПоследних
		|		ПО ВТ_РТУНеВРаботеНЕТребуютНачалаРаботы.Документ = ОтправленныеПоПочтеДокументыСрезПоследних.ОтправленныйДокумент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Диадок_НастройкиКонтрагентов КАК Диадок_НастройкиКонтрагентов
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
		|			ПО Диадок_НастройкиКонтрагентов.Контрагент = Диадок_ЮрФизЛица.Ссылка
		|				И (Диадок_ЮрФизЛица.Клиент)
		|				И (Диадок_НастройкиКонтрагентов.Значение = ""IsMyCounteragent"")
		|		ПО ВТ_РТУНеВРаботеНЕТребуютНачалаРаботы.Документ.Контрагент = Диадок_НастройкиКонтрагентов.Контрагент.СвязанныйСправочник1
		|			И ВТ_РТУНеВРаботеНЕТребуютНачалаРаботы.Документ.Организация = Диадок_НастройкиКонтрагентов.Организация.СвязанныйСправочник1
		|			И (ВТ_РТУНеВРаботеНЕТребуютНачалаРаботы.Документ.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РТУНеВРаботеНЕТребуютНачалаРаботы.Документ КАК Документ,
		|	ВТ_РТУНеВРаботеНЕТребуютНачалаРаботы.Документ.Дата КАК ДокументДата,
		|	ЕСТЬNULL(ПакетыДокументовСрезПоследних.ДатаОтправки, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОтправки,
		|	ВТ_РТУНеВРаботеНЕТребуютНачалаРаботы.Значение КАК Статус,
		|	ЕСТЬNULL(ПакетыДокументовСрезПоследних.ДатаВозврата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВозврата
		|ИЗ
		|	ВТ_РТУНеВРаботеНЕТребуютНачалаРаботы КАК ВТ_РТУНеВРаботеНЕТребуютНачалаРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Диадок_НастройкиКонтрагентов КАК Диадок_НастройкиКонтрагентов
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Диадок_ЮрФизЛица КАК Диадок_ЮрФизЛица
		|			ПО Диадок_НастройкиКонтрагентов.Контрагент = Диадок_ЮрФизЛица.Ссылка
		|				И (Диадок_ЮрФизЛица.Клиент)
		|				И (Диадок_НастройкиКонтрагентов.Значение = ""IsMyCounteragent"")
		|		ПО ВТ_РТУНеВРаботеНЕТребуютНачалаРаботы.Документ.Контрагент = Диадок_НастройкиКонтрагентов.Контрагент.СвязанныйСправочник1
		|			И ВТ_РТУНеВРаботеНЕТребуютНачалаРаботы.Документ.Организация = Диадок_НастройкиКонтрагентов.Организация.СвязанныйСправочник1
		|			И (ВТ_РТУНеВРаботеНЕТребуютНачалаРаботы.Документ.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПакетыДокументов.СрезПоследних(&ТекДата, ) КАК ПакетыДокументовСрезПоследних
		|		ПО ВТ_РТУНеВРаботеНЕТребуютНачалаРаботы.Документ = ПакетыДокументовСрезПоследних.Документ
		|ГДЕ
		|	Диадок_НастройкиКонтрагентов.Контрагент.СвязанныйСправочник1 ЕСТЬ NULL";
	
    Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
	
	Результат = Запрос.ВыполнитьПакет();
	ТаблицаДокументов = Результат[2].Выгрузить();
	ТаблицаДокументовБезЭДО = Результат[3].Выгрузить();
	
	
	СтруктураПоискаСтатуса = Новый Структура("Статус",Перечисления.СтатусыОтправкиИПодписанияРТУ.ДокументНеВРаботеИНеТребуетНачалаРаботы);
	
	НайденныеСтроки = ТаблицаДокументовБезЭДО.НайтиСтроки(СтруктураПоискаСтатуса);
	
	Для Каждого СтрокаТ Из НайденныеСтроки Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТ.ДатаОтправки) И (НачалоДня(ТекущаяДата()) - НачалоДня(СтрокаТ.ДокументДата)) / (60 * 60 * 24) > 5 Тогда
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьВРаботеПоСтатусуОтправкиИПодписанияПоДокументу(СтрокаТ.Документ, Перечисления.СтатусыОтправкиИПодписанияРТУ.НеОтправлен);
		ИначеЕсли ЗначениеЗаполнено(СтрокаТ.ДатаОтправки) И НЕ ЗначениеЗаполнено(СтрокаТ.ДатаВозврата) И (НачалоДня(ТекущаяДата()) - НачалоДня(СтрокаТ.ДатаОтправки)) / (60 * 60 * 24) > 60 Тогда
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьВРаботеПоСтатусуОтправкиИПодписанияПоДокументу(СтрокаТ.Документ, Перечисления.СтатусыОтправкиИПодписанияРТУ.НеПолучен);
		КонецЕсли;	
	КонецЦикла;
	
	СтруктураПоискаСтатуса = Новый Структура("Статус",Перечисления.СтатусыОтправкиИПодписанияРТУ.НеОтправлен);
	
	НайденныеСтроки = ТаблицаДокументовБезЭДО.НайтиСтроки(СтруктураПоискаСтатуса);
	
	Для Каждого СтрокаТ Из НайденныеСтроки Цикл
		Если ЗначениеЗаполнено(СтрокаТ.ДатаОтправки) Тогда
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьВРаботеПоСтатусуОтправкиИПодписанияПоДокументу(СтрокаТ.Документ, Перечисления.СтатусыОтправкиИПодписанияРТУ.ДокументНеВРаботеИНеТребуетНачалаРаботы);
		КонецЕсли;	
	КонецЦикла;
	
	СтруктураПоискаСтатуса = Новый Структура("Статус",Перечисления.СтатусыОтправкиИПодписанияРТУ.НеПолучен);
	
	НайденныеСтроки = ТаблицаДокументовБезЭДО.НайтиСтроки(СтруктураПоискаСтатуса);
	
	Для Каждого СтрокаТ Из НайденныеСтроки Цикл
		Если ЗначениеЗаполнено(СтрокаТ.ДатаВозврата) Тогда
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьВРаботеПоСтатусуОтправкиИПодписанияПоДокументу(СтрокаТ.Документ, Перечисления.СтатусыОтправкиИПодписанияРТУ.ДокументНеВРаботеИНеТребуетНачалаРаботы);
		КонецЕсли;	
	КонецЦикла;
	
	
	СтруктураПоискаСтатуса = Новый Структура("Статус",Перечисления.СтатусыОтправкиИПодписанияРТУ.ДокументНеВРаботеИНеТребуетНачалаРаботы);
	
	НайденныеСтроки = ТаблицаДокументов.НайтиСтроки(СтруктураПоискаСтатуса);
	
	Для Каждого СтрокаТ Из НайденныеСтроки Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТ.СостояниеДокументооборота) И (НачалоДня(ТекущаяДата()) - НачалоДня(СтрокаТ.ДокументДата)) / (60 * 60 * 24) > 3 Тогда
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьВРаботеПоСтатусуОтправкиИПодписанияПоДокументу(СтрокаТ.Документ, Перечисления.СтатусыОтправкиИПодписанияРТУ.НеОтправлен);
		ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаТ.СостояниеДокументооборота) И (НачалоДня(ТекущаяДата()) - НачалоДня(СтрокаТ.ДатаОтправкиЭлПисьма)) / (60 * 60 * 24) > 5 Тогда
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьВРаботеПоСтатусуОтправкиИПодписанияПоДокументу(СтрокаТ.Документ, Перечисления.СтатусыОтправкиИПодписанияРТУ.НеОтправленПослеEmail);
		ИначеЕсли СтрокаТ.СостояниеДокументооборота = "Ожидается подпись контрагента" И (НачалоДня(ТекущаяДата()) - НачалоДня(СтрокаТ.ДатаОбновленияСостояния)) / (60 * 60 * 24) > 5 Тогда
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьВРаботеПоСтатусуОтправкиИПодписанияПоДокументу(СтрокаТ.Документ, Перечисления.СтатусыОтправкиИПодписанияРТУ.ОжидаетсяПодписьКонтрагента);	
		ИначеЕсли СтрокаТ.СостояниеДокументооборота = "Контрагент отказал в подписи" Тогда
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьВРаботеПоСтатусуОтправкиИПодписанияПоДокументу(СтрокаТ.Документ, Перечисления.СтатусыОтправкиИПодписанияРТУ.КонтрагентОтказалВПодписи);
		ИначеЕсли СтрокаТ.СостояниеДокументооборота = "Требуется аннулирование" Тогда
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьВРаботеПоСтатусуОтправкиИПодписанияПоДокументу(СтрокаТ.Документ, Перечисления.СтатусыОтправкиИПодписанияРТУ.ТребуетсяАннулирование);	
		ИначеЕсли СтрокаТ.СостояниеДокументооборота = "Требуется уточнение" Тогда
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьВРаботеПоСтатусуОтправкиИПодписанияПоДокументу(СтрокаТ.Документ, Перечисления.СтатусыОтправкиИПодписанияРТУ.ТребуетсяУточнение);	
		КонецЕсли;	
	КонецЦикла;		
	
	СтруктураПоискаСтатуса = Новый Структура("Статус",Перечисления.СтатусыОтправкиИПодписанияРТУ.НеОтправлен);
	
	НайденныеСтроки = ТаблицаДокументов.НайтиСтроки(СтруктураПоискаСтатуса);
	
	Для Каждого СтрокаТ Из НайденныеСтроки Цикл
		Если СтрокаТ.СостояниеДокументооборота = "Отправлен" Тогда
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьВРаботеПоСтатусуОтправкиИПодписанияПоДокументу(СтрокаТ.Документ, Перечисления.СтатусыОтправкиИПодписанияРТУ.ДокументНеВРаботеИНеТребуетНачалаРаботы);	
		КонецЕсли;	
	КонецЦикла;
	
	СтруктураПоискаСтатуса = Новый Структура("Статус",Перечисления.СтатусыОтправкиИПодписанияРТУ.НеОтправленПослеEmail);
	
	НайденныеСтроки = ТаблицаДокументов.НайтиСтроки(СтруктураПоискаСтатуса);
	
	Для Каждого СтрокаТ Из НайденныеСтроки Цикл
		Если СтрокаТ.СостояниеДокументооборота = "Отправлен" Тогда
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьВРаботеПоСтатусуОтправкиИПодписанияПоДокументу(СтрокаТ.Документ, Перечисления.СтатусыОтправкиИПодписанияРТУ.ДокументНеВРаботеИНеТребуетНачалаРаботы);	
		КонецЕсли;	
	КонецЦикла;
	
	СтруктураПоискаСтатуса = Новый Структура("Статус",Перечисления.СтатусыОтправкиИПодписанияРТУ.ОжидаетсяПодписьКонтрагента);
	
	НайденныеСтроки = ТаблицаДокументов.НайтиСтроки(СтруктураПоискаСтатуса);
	
	Для Каждого СтрокаТ Из НайденныеСтроки Цикл
		Если СтрокаТ.СостояниеДокументооборота = "Подписан контрагентом" Тогда
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьВРаботеПоСтатусуОтправкиИПодписанияПоДокументу(СтрокаТ.Документ, Перечисления.СтатусыОтправкиИПодписанияРТУ.ДокументНеВРаботеИНеТребуетНачалаРаботы);	
		КонецЕсли;	
	КонецЦикла;
	
	СтруктураПоискаСтатуса = Новый Структура("Статус",Перечисления.СтатусыОтправкиИПодписанияРТУ.КонтрагентОтказалВПодписи);
	
	НайденныеСтроки = ТаблицаДокументов.НайтиСтроки(СтруктураПоискаСтатуса);
	
	Для Каждого СтрокаТ Из НайденныеСтроки Цикл
		Если СтрокаТ.СостояниеДокументооборота = "Подписан контрагентом" Тогда
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьВРаботеПоСтатусуОтправкиИПодписанияПоДокументу(СтрокаТ.Документ, Перечисления.СтатусыОтправкиИПодписанияРТУ.ДокументНеВРаботеИНеТребуетНачалаРаботы);	
		КонецЕсли;	
	КонецЦикла;
	
	СтруктураПоискаСтатуса = Новый Структура("Статус",Перечисления.СтатусыОтправкиИПодписанияРТУ.ТребуетсяАннулирование);
	
	НайденныеСтроки = ТаблицаДокументов.НайтиСтроки(СтруктураПоискаСтатуса);
	
	Для Каждого СтрокаТ Из НайденныеСтроки Цикл
		Если СтрокаТ.СостояниеДокументооборота <> "Требуется аннулирование" Тогда
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьВРаботеПоСтатусуОтправкиИПодписанияПоДокументу(СтрокаТ.Документ, Перечисления.СтатусыОтправкиИПодписанияРТУ.ДокументНеВРаботеИНеТребуетНачалаРаботы);	
		КонецЕсли;	
	КонецЦикла;
	
	СтруктураПоискаСтатуса = Новый Структура("Статус",Перечисления.СтатусыОтправкиИПодписанияРТУ.ТребуетсяУточнение);
	
	НайденныеСтроки = ТаблицаДокументов.НайтиСтроки(СтруктураПоискаСтатуса);
	
	Для Каждого СтрокаТ Из НайденныеСтроки Цикл
		Если СтрокаТ.СостояниеДокументооборота <> "Требуется уточнение" Тогда
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьВРаботеПоСтатусуОтправкиИПодписанияПоДокументу(СтрокаТ.Документ, Перечисления.СтатусыОтправкиИПодписанияРТУ.ДокументНеВРаботеИНеТребуетНачалаРаботы);	
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры	

// *** Фоновое задание постановки задачи специалистам на комплектацию поезда // на формирование сделки.
// Почему здесь? Более подходящего места не нашел.

