Функция НапечататьРасчетРисков_ПоПростомуБезЭтихВашихБСП(МассивОбъектов)
	
	Результат = Новый ТабличныйДокумент;
	Результат.АвтоМасштаб = Истина;
	
	Первый = Истина;
	Для каждого Док из МассивОбъектов Цикл
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.Контрагенты.ПФ_MXL_РасчетУровняРиска", Док.Ссылка, неопределено);
		СтрМакета = Макет.ПолучитьОбласть("Строка");
		
		Если НЕ Первый Тогда Результат.ВывестиГоризонтальныйРазделительСтраниц(); КонецЕсли;
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьШапка.Параметры.НаименованиеКонтрагента = Док.НаименованиеПолное;
		Результат.Вывести(ОбластьШапка);
		
		СокрТЧ = Док.РасчетРисков.Выгрузить();
		СокрТЧ.Свернуть("КатегорияРиска");
		Для каждого Услуга из СокрТЧ.ВыгрузитьКолонку("КатегорияРиска") Цикл
			
			ШапкаУслуги = Макет.ПолучитьОбласть("ШапкаУслуги");
			ШапкаУслуги.Параметры.НаименованиеУслуги = Строка(Услуга);
			Результат.Вывести(ШапкаУслуги);
			
			ИтогПроцентУслуги = 0;
			Сч = 1;
			Для каждого Стр из Док.РасчетРисков Цикл
				Если Стр.КатегорияРиска <> Услуга Тогда Продолжить; КонецЕсли;
				
				СтрМакета.Параметры.ПП = Сч;
				СтрМакета.Параметры.Характеристика = Стр.Характеристика;
				СтрМакета.Параметры.Значение = Стр.ЗначениеХарактеристики;
				СтрМакета.Параметры.ЗначениеРиска = Формат(Стр.Риски, "ЧДЦ=2; ЧН='Риска нет'");
				
				Результат.Вывести(СтрМакета);
				
				ИтогПроцентУслуги = ИтогПроцентУслуги + Стр.Риски;
				Сч = Сч + 1;
			КонецЦикла;
			
			Подвал = Макет.ПолучитьОбласть("Подвал");
			Подвал.Параметры.ИтогоРиск = "" + Формат(ИтогПроцентУслуги, "ЧДЦ=2; ЧН=") + "%";
			Результат.Вывести(Подвал);
			
		КонецЦикла;
		
		
		
		Первый = Ложь;
		
	КонецЦикла;
	
	Возврат Результат;
	
	
КонецФункции

Функция НапечататьАнкетуКлиента_ПоПростомуБезЭтихВашихБСП(МассивОбъектов)
	
	Результат = Новый ТабличныйДокумент;
	Результат.АвтоМасштаб = Истина;
	
	Первый = Истина;
	Для каждого Док из МассивОбъектов Цикл
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.Контрагенты.ПФ_MXL_АнкетаКлиента", Док.Ссылка, неопределено);		
		Если НЕ Первый Тогда Результат.ВывестиГоризонтальныйРазделительСтраниц(); КонецЕсли;
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьШапка.Параметры.Клиент = Док.НаименованиеПолное;
		ОбластьШапка.Параметры.ИНН = Док.ИНН;
		ОбластьШапка.Параметры.Н = Док.ПлановыеПоказателиРаботыСКлиентом.Количество();
		Результат.Вывести(ОбластьШапка);
		
		КонтрибуцияИтого = 0;
		ПогрузкаИтого = 0;
		
		Для каждого Стр из Док.ПлановыеПоказателиРаботыСКлиентом Цикл
			
			СтрокаПлана = Макет.ПолучитьОбласть("СтрокаПлана");
			СтрокаПлана.Параметры.Н = Формат(Стр.МесяцНачалаРаботы, "ДФ='ММММ гг'");
			СтрокаПлана.Параметры.Контрибуция = Формат(Стр.КонтрибуцияБезНДС, "ЧДЦ=2");
			СтрокаПлана.Параметры.Погрузка = Формат(Стр.Погрузка, "ЧДЦ=2");
			Результат.Вывести(СтрокаПлана);
			
			КонтрибуцияИтого = КонтрибуцияИтого +  Стр.КонтрибуцияБезНДС;
			ПогрузкаИтого = ПогрузкаИтого + Стр.Погрузка;
			
		КонецЦикла;
		
		Подшапка = Макет.ПолучитьОбласть("Подшапка");
		Подшапка.Параметры.КонтрибуцияИтого = Формат(КонтрибуцияИтого, "ЧДЦ=2");
		Подшапка.Параметры.ПогрузкаИтого = Формат(ПогрузкаИтого, "ЧДЦ=2");
		Результат.Вывести(Подшапка);
		
		Сч = 1;
		//Евросиб Каблов 09.01.2019 (
		//Для каждого Стр из Док.ХарактеристикиПодрядчика Цикл
		//	Строка = Макет.ПолучитьОбласть("Подстрока");
		//	Строка.Параметры.Н = Сч;
		//	Строка.Параметры.Вопрос = Стр.Вопрос;
		//	Строка.Параметры.Ответ = Стр.Ответ;
		//	Строка.Параметры.Комментарий = Стр.Комментарий;
		//	Результат.Вывести(Строка);
		//	
		//	Сч = Сч + 1;
		//	
		//КонецЦикла;
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КонтрагентыХарактеристикиКлиента.Вопрос.Наименование КАК ВопросНаименование,
		|	ПРЕДСТАВЛЕНИЕ(КонтрагентыХарактеристикиКлиента.Ответ) КАК ОтветПредставление,
		|	КонтрагентыХарактеристикиКлиента.Комментарий КАК Комментарий,
		|	КонтрагентыХарактеристикиКлиента.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Справочник.Контрагенты.ХарактеристикиКлиента КАК КонтрагентыХарактеристикиКлиента
		|ГДЕ
		|	КонтрагентыХарактеристикиКлиента.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		Запрос.УстановитьПараметр("Ссылка", Док);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Строка = Макет.ПолучитьОбласть("Подстрока");
			Строка.Параметры.Н = Выборка.НомерСтроки;
			Строка.Параметры.Вопрос = Выборка.ВопросНаименование;
			Строка.Параметры.Ответ = Выборка.ОтветПредставление;
			Строка.Параметры.Комментарий = Выборка.Комментарий;
			Результат.Вывести(Строка);
		КонецЦикла;
		//Евросиб Каблов 09.01.2019 )
		
		Первый = Ложь;
		
	КонецЦикла;
	
	Возврат Результат;
	
	
КонецФункции

Функция НапечататьАнкетуПоставщика_ПоПростомуБезЭтихВашихБСП(МассивОбъектов)
	
	Результат = Новый ТабличныйДокумент;
	Результат.АвтоМасштаб = Истина;
	
	Первый = Истина;
	Для каждого Док из МассивОбъектов Цикл
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.Контрагенты.ПФ_MXL_АнкетаПоставщика", Док.Ссылка, неопределено);		
		Если НЕ Первый Тогда Результат.ВывестиГоризонтальныйРазделительСтраниц(); КонецЕсли;
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьШапка.Параметры.Поставщик = Док.НаименованиеПолное;
		ОбластьШапка.Параметры.ИНН = Док.ИНН;
		//Евросиб Каблов 11.12.2019 (
		//ОбластьШапка.Параметры.Н = Док.ПлановыеПоказателиРаботыСПодрядчиком.Количество();
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	АнкетыПодрядчиков.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТАнкета
		|ИЗ
		|	Справочник.АнкетыПодрядчиков КАК АнкетыПодрядчиков
		|ГДЕ
		|	АнкетыПодрядчиков.Владелец = &Контрагент
		|
		|УПОРЯДОЧИТЬ ПО
		|	АнкетыПодрядчиков.ДатаАнкеты УБЫВ,
		|	АнкетыПодрядчиков.Ссылка УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АнкетыПодрядчиковПлановыеПоказателиРаботыСПодрядчиком.МесяцНачалаРаботы КАК МесяцНачалаРаботы,
		|	АнкетыПодрядчиковПлановыеПоказателиРаботыСПодрядчиком.ОбъемЗакупаемыхУслугТР КАК ОбъемЗакупаемыхУслугТР,
		|	АнкетыПодрядчиковПлановыеПоказателиРаботыСПодрядчиком.Количество КАК Количество,
		|	АнкетыПодрядчиковПлановыеПоказателиРаботыСПодрядчиком.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ВТАнкета КАК ВТАнкета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АнкетыПодрядчиков.ПлановыеПоказателиРаботыСПодрядчиком КАК АнкетыПодрядчиковПлановыеПоказателиРаботыСПодрядчиком
		|		ПО ВТАнкета.Ссылка = АнкетыПодрядчиковПлановыеПоказателиРаботыСПодрядчиком.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	МесяцНачалаРаботы";
		Запрос.УстановитьПараметр("Контрагент", Док);
		Выборка = Запрос.Выполнить().Выбрать();
		ОбластьШапка.Параметры.Н = Выборка.Количество();
		//Евросиб Каблов 11.12.2019 )
		Результат.Вывести(ОбластьШапка);
		
		ОбъемУслугИтого = 0;
		КолвоИтого = 0;
		
		//Евросиб Каблов 11.12.2019 (
		//Для каждого Стр из Док.ПлановыеПоказателиРаботыСПодрядчиком Цикл
		//	
		//	СтрокаПлана = Макет.ПолучитьОбласть("СтрокаПлана");
		//	СтрокаПлана.Параметры.Н = Формат(Стр.МесяцНачалаРаботы, "ДФ='ММММ гг'");
		//	СтрокаПлана.Параметры.ОбъемУслуг = Формат(Стр.ОбъемЗакупаемыхУслугТР, "ЧДЦ=2");
		//	СтрокаПлана.Параметры.Колво = 1;
		//	Результат.Вывести(СтрокаПлана);
		//	
		//	ОбъемУслугИтого = ОбъемУслугИтого +  Стр.ОбъемЗакупаемыхУслугТР;
		//	КолвоИтого = КолвоИтого + 1;
		//	
		//КонецЦикла;
			
		
		СтрокаПлана = Макет.ПолучитьОбласть("СтрокаПлана");
		Пока Выборка.Следующий() Цикл
			СтрокаПлана.Параметры.Н = Формат(Выборка.МесяцНачалаРаботы, "ДФ='ММММ гг'");
			СтрокаПлана.Параметры.ОбъемУслуг = Формат(Выборка.ОбъемЗакупаемыхУслугТР, "ЧДЦ=2");
			СтрокаПлана.Параметры.Колво = 1;
			Результат.Вывести(СтрокаПлана);
			
			ОбъемУслугИтого = ОбъемУслугИтого +  Выборка.ОбъемЗакупаемыхУслугТР;
			КолвоИтого = КолвоИтого + 1;
		КонецЦикла;		
		//Евросиб Каблов 11.12.2019 )
		
		Подшапка = Макет.ПолучитьОбласть("Подшапка");
		Подшапка.Параметры.ОбъемУслугИтого = Формат(ОбъемУслугИтого, "ЧДЦ=2");
		Подшапка.Параметры.КолвоИтого = Формат(КолвоИтого, "ЧДЦ=2");
		Результат.Вывести(Подшапка);
		//Евросиб Каблов 09.01.2020 (
		//Сч = 1;
		//Для каждого Стр из Док.ХарактеристикиПодрядчика Цикл
		//	
		//	Строка = Макет.ПолучитьОбласть("Подстрока");
		//	Строка.Параметры.Н = Сч;
		//	Строка.Параметры.Вопрос = Стр.Вопрос;
		//	Строка.Параметры.Ответ = Стр.Ответ;
		//	Строка.Параметры.Комментарий = Стр.Комментарий;
		//	Результат.Вывести(Строка);
		//	
		//	Сч = Сч + 1;
		//	
		//КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	АнкетыПодрядчиков.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТАнкета
		|ИЗ
		|	Справочник.АнкетыПодрядчиков КАК АнкетыПодрядчиков
		|ГДЕ
		|	АнкетыПодрядчиков.Владелец = &Контрагент
		|
		|УПОРЯДОЧИТЬ ПО
		|	АнкетыПодрядчиков.ДатаАнкеты УБЫВ,
		|	АнкетыПодрядчиков.Ссылка УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АнкетыПодрядчиковХарактеристикиПодрядчика.НомерСтроки КАК НомерСтроки,
		|	АнкетыПодрядчиковХарактеристикиПодрядчика.Вопрос.Наименование КАК ВопросНаименование,
		|	ПРЕДСТАВЛЕНИЕ(АнкетыПодрядчиковХарактеристикиПодрядчика.Ответ) КАК ОтветПредставление,
		|	АнкетыПодрядчиковХарактеристикиПодрядчика.Комментарий КАК Комментарий
		|ИЗ
		|	ВТАнкета КАК ВТАнкета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АнкетыПодрядчиков.ХарактеристикиПодрядчика КАК АнкетыПодрядчиковХарактеристикиПодрядчика
		|		ПО ВТАнкета.Ссылка = АнкетыПодрядчиковХарактеристикиПодрядчика.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		Запрос.УстановитьПараметр("Контрагент", Док);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Строка = Макет.ПолучитьОбласть("Подстрока");
			Строка.Параметры.Н = Выборка.НомерСтроки;
			Строка.Параметры.Вопрос = Выборка.ВопросНаименование;
			Строка.Параметры.Ответ = Выборка.ОтветПредставление;
			Строка.Параметры.Комментарий = Выборка.Комментарий;
			Результат.Вывести(Строка);
			
		КонецЦикла;		
		//Евросиб Каблов 11.12.2019 )
		
		Первый = Ложь;
		
	КонецЦикла;
	
	Возврат Результат;
	
	
КонецФункции

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт 

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РасчетУровняРиска";
	КомандаПечати.Представление = "Расчет уровня риска";
	КомандаПечати.Обработчик    = "ДополнительныйМодульКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаЭлемента";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
		
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АнкетаКлиента";
	КомандаПечати.Представление = "Анкета клиента";
	КомандаПечати.Обработчик    = "ДополнительныйМодульКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаЭлемента";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
				
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АнкетаПоставщика";
	КомандаПечати.Представление = "Анкета поставщика";
	КомандаПечати.Обработчик    = "ДополнительныйМодульКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаЭлемента";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
				
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РасчетУровняРиска") Тогда
		
		Для каждого ЭлМассива из МассивОбъектов Цикл
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РасчетУровняРиска", "Расчет уровня риска", НапечататьРасчетРисков_ПоПростомуБезЭтихВашихБСП(МассивОбъектов),,"рандом");
		КонецЦикла;
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АнкетаКлиента") Тогда
		
		Для каждого ЭлМассива из МассивОбъектов Цикл
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АнкетаКлиента", "Анкета клиента", НапечататьАнкетуКлиента_ПоПростомуБезЭтихВашихБСП(МассивОбъектов),,"рандом");
		КонецЦикла;
				
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АнкетаПоставщика") Тогда
		
		Для каждого ЭлМассива из МассивОбъектов Цикл
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АнкетаПоставщика", "Анкета поставщика", НапечататьАнкетуПоставщика_ПоПростомуБезЭтихВашихБСП(МассивОбъектов),,"рандом");
		КонецЦикла;
				
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьВопросыХарактеристикиКлиента() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВопросыАнкетКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ВопросыАнкетКонтрагентов КАК ВопросыАнкетКонтрагентов
	|ГДЕ
	|	ВопросыАнкетКонтрагентов.ТипКонтрагента_Клиент
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВопросыАнкетКонтрагентов.Код";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция КонтрагентНерезидент(Контрагент) Экспорт
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "СтранаРегистрации") <> ПредопределенноеЗначение("Справочник.СтраныМира.Россия");
КонецФункции

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	РаботаСМенеджерамиОбъектов.ОбработкаПолученияДанныхВыбораПолучитьДанныеВыбораБезПомеченныхНаУдаление("Контрагенты", ДанныеВыбора, Параметры, СтандартнаяОбработка);
КонецПроцедуры

//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, начало
Функция СформироватьКодовоеНаименование(Ссылка, НаименованиеКонтрагента) Экспорт
	
	Результат = СформироватьПрефиксПоСтроке(НаименованиеКонтрагента);
	
	//проверка на уникальность
	Если КодовоеНаименованиеЗанято(Ссылка, Результат) Тогда
		МассивЗанятыхКодовыхНаименований = ПолучитьЗанятыеКодовыеНаименованияАналогичногоПрефикса(Результат);
		КодовоеНаименованиеСПостфиксом = "";
		
		//Если при присвоении кодового имени контрагента в системе имеется идентичный код - то к кодовому наименованию добавляется цифровой постфикс (ABC1)
		Для ТекНомер = 1 По 9 Цикл
			ПроверяемаяСтрока = Результат+Строка(ТекНомер);
			Если МассивЗанятыхКодовыхНаименований.Найти(ПроверяемаяСтрока) = Неопределено Тогда
				КодовоеНаименованиеСПостфиксом = ПроверяемаяСтрока;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	
		//Если в кодовом наименовании идентичного объекта используется максимальное число символов - то цифровой постфикс заменяет буквенное значение.
		Если НЕ ЗначениеЗаполнено(КодовоеНаименованиеСПостфиксом) Тогда
			//Добавляем только заглавные латинские буквы
			СтрокаЛатинскихБукв = "ABCDEFGHЯKLMNOPQRSTVXYZ";
			Для НомерСимвола = 1 По СтрДлина(СтрокаЛатинскихБукв) Цикл
				ПроверяемаяСтрока = Результат+Сред(СтрокаЛатинскихБукв, НомерСимвола, 1);
				Если МассивЗанятыхКодовыхНаименований.Найти(ПроверяемаяСтрока) = Неопределено Тогда
					КодовоеНаименованиеСПостфиксом = ПроверяемаяСтрока;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
			
		Если ЗначениеЗаполнено(КодовоеНаименованиеСПостфиксом) Тогда
			Результат = КодовоеНаименованиеСПостфиксом;
		Иначе
			Результат = "";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, начало
Функция СформироватьПрефиксПоСтроке(Знач НаименованиеКонтрагента)
	
	Результат = "";
	
	МаксимальноеКоличествоСимволов = 8; //Максимальное Количество символов в сокращении = 9 символов. СТАВИМ = 8, С УЧЕТОМ ПОСТФИКСА БУДЕТ 9
	КоличествоСимволовДляДлинныхСлов = 4;
	ГраничноеЧислоСлов = 3;
	
	//УБРАТЬ ФОРМУ СОБСТВЕННОСТИ
	//Для кодировки используется только наименование Контрагента, без указания формы собственности
	//ПОЛНОЕ НАИММЕНОВАНИЕ
	ИсключаемыеСлова = МассивСловФормСобственности();
	Для Каждого ПолноеНаименованиеФормы Из ИсключаемыеСлова Цикл
		НаименованиеКонтрагента = СтрЗаменить(НаименованиеКонтрагента, ПолноеНаименованиеФормы, "");
	КонецЦикла;
	//СОКРАЩЕННОЕ НАИМЕНОВАНИЕ
	МассивСловЧерезПробелы = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(НаименованиеКонтрагента," -"); //СтрРазделить(НаименованиеКонтрагента, " ", Ложь);
	ИсключаемыеСлова = МассивСокращенныхСловФормСобственности();
	МассивСловБезФормСобственности = ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивСловЧерезПробелы, ИсключаемыеСлова);
	КоличествоСлов = МассивСловБезФормСобственности.Количество();
	НаименованиеКонтрагента = ВРЕГ(СтрСоединить(МассивСловБезФормСобственности, " "));
	
	//ТРАНСЛИТЕРАЦИЯ
	//Буквы Кириллицы требуется преобразовывать в соответствии с транслитерацией ГОСТ-7.79-2000
	СтрокаЛатиницей = СтроковыеФункцииКлиентСервер.СтрокаЛатиницей(НаименованиеКонтрагента);
	
	//В сокращенном наименовании используются только заглавные латинские символы и цифры (другие символы игнорируются)
	СтрокаЛатиницей = СтрЗаменитьПоРегулярномуВыражению(СтрокаЛатиницей, "[^A-Za-z0-9 ]", "", Истина, Истина); // https://regex101.com/
	
	МассивСловЧерезПробелы = СтрРазделить(СтрокаЛатиницей, " ", Ложь);
	КоличествоСлов = МассивСловЧерезПробелы.Количество();
	
	СтрокаЛатиницейБезПробелов =  СтрСоединить(МассивСловЧерезПробелы, "");
	
	Если СтрДлина(СтрокаЛатиницейБезПробелов) <= МаксимальноеКоличествоСимволов Тогда
		//Для Контрагентов, в транслитерованных наименованиях которых 9 символов и меньше - использовать транслитерованное наименование
		Результат = СтрокаЛатиницейБезПробелов;
	ИначеЕсли КоличествоСлов = 1 Тогда
		Результат = Лев(СтрокаЛатиницейБезПробелов, МаксимальноеКоличествоСимволов); //Максимальное Количество символов в сокращении = 9 символов.
	ИначеЕсли КоличествоСлов > 1 Тогда
		//Максимальное Количество символов в сокращении = 9 символов.
		
		Если КоличествоСлов <= 3 Тогда
			//Для контрагентов, наименование которых состоит из двух или трех слов (в качестве разделителя может использоваться пробел и дефис) - использовать по 3 первые буквы каждого слова
			Результат = ПоПервымТремБуквамИзСловИзМассива(МассивСловЧерезПробелы);
		Иначе
			//Если Наименование содержит более трех слов - использовать первые буквы каждого слова
			Результат = ПоПервымБуквамИзСловИзМассива(МассивСловЧерезПробелы);
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтрДлина(Результат) > МаксимальноеКоличествоСимволов Тогда
		//Для контрагентов , в транслитерованных наименованиях которых 9 символов и больше - использовать 4 первых и 4 последних символа. 
		Результат = Лев(Результат, 4) + Прав(Результат, 4);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, начало
Функция КодовоеНаименованиеЗанято(Ссылка, КодовоеНаименование) Экспорт
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контрагенты.КодовоеНаименование КАК КодовоеНаименование
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.КодовоеНаименование = &КодовоеНаименование
		|	И Контрагенты.КодовоеНаименование <> """"
		|	И Контрагенты.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("КодовоеНаименование", КодовоеНаименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, начало
Функция ПолучитьЗанятыеКодовыеНаименованияАналогичногоПрефикса(КодовоеНаименование)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.КодовоеНаименование КАК КодовоеНаименование
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.КодовоеНаименование ПОДОБНО &КодовоеНаименование
		|	И Контрагенты.КодовоеНаименование <> """"";
	
	Запрос.УстановитьПараметр("КодовоеНаименование", КодовоеНаименование+"_");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("КодовоеНаименование");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, начало
Функция ПоПервымТремБуквамИзСловИзМассива(МассивСловЧерезПробелы)
	
	Результат = "";
	
	Для Каждого Слово Из МассивСловЧерезПробелы Цикл
		Результат = Результат + Лев(Слово, 3);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, начало
Функция ПоПервымБуквамИзСловИзМассива(МассивСловЧерезПробелы)
	
	Результат = "";
	
	Для Каждого Слово Из МассивСловЧерезПробелы Цикл
		Результат = Результат + Лев(Слово, 1);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, начало
Функция МассивСокращенныхСловФормСобственности()
	
	Массив = Новый Массив;
	Массив.Добавить("ООО");
	//Массив.Добавить("Общество с ограниченной ответственностью");
	Массив.Добавить("LTD");
	Массив.Добавить("АО");
	Массив.Добавить("ЗАО");
	//Массив.Добавить("Акционерное общество");
	//Массив.Добавить("Закрытое акционерное общество");
	//Массив.Добавить("Индивидуальный предприниматель");
	Массив.Добавить("ИП");

	Возврат Массив;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, начало
Функция МассивСловФормСобственности()
	
	Массив = Новый Массив;
	Массив.Добавить("Общество с ограниченной ответственностью");
	Массив.Добавить("Акционерное общество");
	Массив.Добавить("Закрытое акционерное общество");
	Массив.Добавить("Индивидуальный предприниматель");

	Возврат Массив;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, конец