
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЭтоГруппа Тогда
		СтранаРегистрации = Справочники.СтраныМира.Россия;
		ТипПодрядчика = Перечисления.ТипыПодрядчиков.Основной;
	КонецЕсли;
	
	//Евросиб Каблов 30.10.2023 ( #75269
	Маршрутизировать = Истина;
	//Евросиб Каблов 30.10.2023 )
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, начало
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, конец
	
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0355738, 21-06-2024, начало (алгоритмы, распложенные ниже, работают только для элементов справочника)
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0355738, 21-06-2024, конец
	
	Если НЕ ЭтоГруппа И СинонимыДляПоиска.Количество() = 0 Тогда
		Если ЗначениеЗаполнено(Наименование) Тогда СинонимыДляПоиска.Добавить().СинонимКонтрагента = Наименование; КонецЕсли;
		Если ЗначениеЗаполнено(НаименованиеПолное) Тогда СинонимыДляПоиска.Добавить().СинонимКонтрагента = НаименованиеПолное; КонецЕсли;
		Если ЗначениеЗаполнено(НаименованиеПолноеАнгл) Тогда СинонимыДляПоиска.Добавить().СинонимКонтрагента = НаименованиеПолноеАнгл; КонецЕсли;
	КонецЕсли;
	
	СтрокаСинонимовДляПоиска = СтрСоединить(СинонимыДляПоиска.Выгрузить().ВыгрузитьКолонку("СинонимКонтрагента"), "; ");
	
	//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, начало
	Если НЕ ЗначениеЗаполнено(КодовоеНаименование) Тогда
		КодовоеНаименованиеСсылки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "КодовоеНаименование");
		Если ЗначениеЗаполнено(КодовоеНаименованиеСсылки) И РегистрыСведений.ВнешниеНомераЗаявок.ЕстьЗаписиПоКонтрагенту(Ссылка) Тогда
			ОбщегоНазначения.СообщитьПользователю("Запрещено очищать кодовое наименование Кодовое наименование в случае наличия записей в регистре Внешние номера заявок. Запись отменена!",,,,Отказ);
		КонецЕсли;
		СтрокаДляКодовогоНаименования = ?(ЗначениеЗаполнено(НаименованиеПолное), НаименованиеПолное, Наименование);
		КодовоеНаименование = Справочники.Контрагенты.СформироватьКодовоеНаименование(Ссылка, СтрокаДляКодовогоНаименования);
	Иначе
		Если Справочники.Контрагенты.КодовоеНаименованиеЗанято(Ссылка, КодовоеНаименование) Тогда
			ОбщегоНазначения.СообщитьПользователю("Кодовое наименование " + КодовоеНаименование + " уже занято. Запись отменена!",,,,Отказ);
		КонецЕсли;
		КодовоеНаименованиеСсылки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "КодовоеНаименование");
		Если КодовоеНаименованиеСсылки <> КодовоеНаименование И РегистрыСведений.ВнешниеНомераЗаявок.ЕстьЗаписиПоКонтрагенту(Ссылка) Тогда
			ОбщегоНазначения.СообщитьПользователю("Кодовое наименование запрещено изменять в случае наличия записей в регистре Внешние номера заявок. Запись отменена!",,,,Отказ);
		КонецЕсли;
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 90031 / TA 101224, 31-01-2025, конец
	
	//Евросиб Коханенко Н.А. 29.07.2024 (( #88035	 
	ЗадачиДляЗакрытия = Новый Массив;
	ЗадачиДляЗакрытия.Добавить(Справочники.Состояния.ЗаполнитьТипИХарактеристикуКлиента);
	Если ЗначениеЗаполнено(ТипКлиента) И ЗначениеЗаполнено(ХарактеристикаКлиента) Тогда
		МаршрутизацияСервер.ОтметитьВыполнениеЗадач(ЭтотОбъект, ЗадачиДляЗакрытия);
	Иначе
		МаршрутизацияСервер.ОтменитьВыполнениеЗадач(ЭтотОбъект, ЗадачиДляЗакрытия);
	КонецЕсли;
	//Евросиб Коханенко Н.А. 29.07.2024 )) #88035 
	
	//Евросиб Каблов 30.10.2023 ( #75269
	// + Состояния
	
	// проверяем корректность перечня состояний в ТЧ Состояния
	Для Сч = 0 По Состояния.Количество() - 2 Цикл
		ТекСостояние = Состояния[Сч].Состояние;
		Для ТекСч = Сч + 1 По Состояния.Количество() - 1 Цикл
			Если Состояния[ТекСч].Состояние = ТекСостояние Тогда
				Сообщить("Ошибка: одно состояние может встречаться в документе только один раз!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Заполняем этапы операции
	//МаршрутизацияСервер.ПараллельноеСогласование(Состояния); //ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, закомментировал (перенёс ниже)

	ОбработаноВыполнениеЗафиксировано = Ложь;
	
	// Маршрутизация
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = Не ОбменДанными.Загрузка И 
	(Состояния.Количество() = 0 ИЛИ НЕ ЗначениеЗаполнено(Ссылка) ИЛИ 
	Ссылка.ТипКонтрагента_Клиент <> ТипКонтрагента_Клиент ИЛИ 
	Ссылка.ТипКонтрагента_Подрядчик <> ТипКонтрагента_Подрядчик);
	
	Если Не ОбменДанными.Загрузка И Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("ТипКонтрагента_Клиент", ТипКонтрагента_Клиент);
		ПараметрыЗапроса.Вставить("ТипКонтрагента_Подрядчик", ТипКонтрагента_Подрядчик);
		ПараметрыЗапроса.Вставить("Нерезидент", (СтранаРегистрации <> Справочники.СтраныМира.Россия));

		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьКонтрагента(ПараметрыЗапроса, ТекущаяДата());
		Если РезультатЗапроса.Количество() > 0 Тогда
			
			Если РезультатЗапроса.Количество() > 0 Тогда
				УказанныеВручнуюИспНаблюдатель = Новый СписокЗначений;
				Если ДополнительныеСвойства.Свойство("ДопСвойстваОбъекта") тогда
					УказанныеВручнуюИспНаблюдатель = ДополнительныеСвойства.ДопСвойстваОбъекта;
				КонецЕсли;
				МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъект, РезультатЗапроса, Неопределено, УказанныеВручнуюИспНаблюдатель); 
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;       
	
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, начало
	МаршрутизацияСервер.ПараллельноеСогласование(Состояния);
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, конец
	
	// если исполнитель пустой, то проставляем тек пользователя
	Для каждого Стр из Состояния Цикл
		
		Если Стр.ВидНормативаИсполнения = Перечисления.ВидыНормативовИспользования.Плюс30ДнейСДатыДоговора Тогда
			Стр.НормативИсполненияСМоментаСоздания = 30*24;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Стр.ВидНормативаИсполнения) Тогда
			Стр.ВидНормативаИсполнения = Перечисления.ВидыНормативовИспользования.ЧасовСМоментаСозданияДокумента;
		КонецЕсли;
		
		Если Стр.ПримечаниеЗадачаИсполнителю Тогда
			// если текст примечания изменился, то создать новое сообщение. если остался прежним, то не менять
			// т.к. состояние уникально, ищем по нему
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Состояние",Стр.Состояние);
			НайденнаяСтр = Ссылка.Состояния.НайтиСтроки(ПараметрыОтбора);
			Если НайденнаяСтр.Количество()>0 Тогда
				Если НЕ НайденнаяСтр[0].Комментарий = Стр.Комментарий Тогда
					
					ДатаСообщения = ТекущаяДата();
					АвторСообщения = Пользователи.ТекущийПользователь();
					ТекстСообщения = Стр.Комментарий;
					ГУИДСообщения = Новый УникальныйИдентификатор();
					
					ГУИДТемы = Новый УникальныйИдентификатор;
					
					РассылкаПоЛичнымЦелям.СформироватьЛичноеСообщение(ГУИДТемы, , Ссылка, ДатаСообщения, АвторСообщения, ТекстСообщения, , ГУИДСообщения, Стр.Исполнитель);
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если Стр.НаблюдательКакРуководительИсполнителя И ТипЗнч(Стр.Исполнитель) = Тип("СправочникСсылка.Пользователи") И ЗначениеЗаполнено(Стр.Исполнитель.НепосредственныйРуководитель) Тогда
			Стр.Наблюдатель = Стр.Исполнитель.НепосредственныйРуководитель;
		КонецЕсли;
		
	КонецЦикла;
	
	МаршрутизацияСервер.ПостобработкаТЧСостояний(ЭтотОбъект, Пользователи.ТекущийПользователь());
	
	// - Состояния
	//Евросиб Каблов 30.10.2023 )
	
КонецПроцедуры
