#Область ОписаниеПеременных

&НаКлиенте
Перем ВыполняетсяЗакрытие;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Контейнеры.Загрузить(Параметры.ДокументОбъект.Контейнеры.Выгрузить());
	//ДИТ Шевченко А.В. TASK 51973 03.06.2022 -Начало
	ТранспортныеСредстваИмяТЧ = Параметры.ТранспортныеСредстваИмяТЧ;
	ИдентификаторСтрокиТСИмя  		   = Параметры.ИдентификаторСтрокиТСИмя;
	ПроверитьКорректностьПараметров(Отказ,ТранспортныеСредстваИмяТЧ,ИдентификаторСтрокиТСИмя);
	ТранспортныеСредства.Загрузить(Параметры.ДокументОбъект[ТранспортныеСредстваИмяТЧ].Выгрузить());
	//ДИТ Шевченко А.В. TASK 51973 03.06.2022 -Конец	
	ПривязкаКВодителям = Параметры.ПривязкаКВодителям;
	ПроставитьПризнакПривязки();	
	
	ТолькоНепривязанные = Истина;
	УстановитьОтборКТК();
	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаСервереБезКонтекста
Процедура ПроверитьКорректностьПараметров(Отказ,ТранспортныеСредстваИмяТЧ,ИдентификаторСтрокиТСИмя)
	Если ТранспортныеСредстваИмяТЧ <> "ТранспортныеСредства" И ТранспортныеСредстваИмяТЧ <> "ТранспортныеСредстваПоследняяМиля" Тогда
		Отказ = Истина;
	КонецЕсли;
	Если ИдентификаторСтрокиТСИмя <> "ИдентификаторСтрокиТС" И ИдентификаторСтрокиТСИмя <> "ИдентификаторСтрокиТСПоследняяМиля" Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура ПроставитьПризнакПривязки();
	
	// Проставим признак "Привязан" в строках контейнеров.
	// Он потребуется для установки фильтра "Только непривязанные".
	
	Для Каждого ТекущаяСтрока Из Контейнеры Цикл
		Если ПривязкаКВодителям Тогда
			ТекущаяСтрока.Привязан = ЗначениеЗаполнено(ТекущаяСтрока[ИдентификаторСтрокиТСИмя]);
		//ДИТ Шевченко А.В. 06.10.2022 -начало	
		//Иначе
		//	ТекущаяСтрока.Привязан = ЗначениеЗаполнено(ТекущаяСтрока[ИдентификаторСтрокиПеревозчикаИмя]);
		//ДИТ Шевченко А.В. 06.10.2022 -конец	
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастроитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ВыполняетсяЗакрытие И Модифицированность И Не СохранитьПараметры Тогда
		
		СохранитьПараметры = Ложь;
		Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
		ТекстПредупреждения = НСтр("ru = 'Привязка контейнеров была изменена. Перенести изменения?'");
		
		ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы, ТекстПредупреждения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ВыполняетсяЗакрытие = Истина;
	СохранитьПараметры  = Истина;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если СохранитьПараметры И Не ЗавершениеРаботы Тогда
		
		ОповеститьОВыборе(СтруктураВозвращаемыхДанных());
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыКонтейнеры

&НаКлиенте
Процедура КонтейнерыСвязатьПриИзменении(Элемент)
	
	// Если выполняется привязка КТК к водителям, то можно выделить только одну строку
	// Если выполняется привязка КТК в автоперевозчикам, то можно выделить несколько строк КТК и одну строку автоперевозчика.
	Если ПривязкаКВодителям = Ложь Тогда
		Возврат;
	КонецЕсли;	
	
	ТекущиеДанные = Элементы.Контейнеры.ТекущиеДанные;
	
	Если ТекущиеДанные.Связать Тогда
		Для Каждого ТекСтрока Из Контейнеры Цикл
			ТекСтрока.Связать = Ложь;
		КонецЦикла;
		ТекущиеДанные.Связать = Истина;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыТранспортныеСредства

&НаКлиенте
Процедура ТранспортныеСредстваСвязатьПриИзменении(Элемент)
	
	// Для связки можно выбрать только одного водителя
	
	ТекущиеДанные = Элементы.ТранспортныеСредства.ТекущиеДанные;
	
	Если ТекущиеДанные.Связать Тогда
		Для Каждого ТекСтрока Из ТранспортныеСредства Цикл
			ТекСтрока.Связать = Ложь;
		КонецЦикла;
		ТекущиеДанные.Связать = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыАвтоперевозчики

&НаКлиенте
Процедура АвтоперевозчикиСвязатьПриИзменении(Элемент)
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)	
	СохранитьПараметры = Истина;		
	Закрыть();	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)	
	Закрыть();	
КонецПроцедуры

&НаКлиенте
Процедура СвязатьСтроки(Команда)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Связать", Истина);
	
    СтрокиДляСвязиКТК = Контейнеры.НайтиСтроки(ПараметрыОтбора);
	
	Если ПривязкаКВодителям Тогда
		
		// Связываем водителей с КТК
		
		СтрокиДляСвязиВодители = ТранспортныеСредства.НайтиСтроки(ПараметрыОтбора);		
		
		Если СтрокиДляСвязиКТК.Количество() = 0
			ИЛИ СтрокиДляСвязиВодители.Количество() = 0 Тогда
			ПоказатьПредупреждение(, "Не выбраны строки для связи");
			Возврат;
		КонецЕсли;
					
		СтрокаКТК = СтрокиДляСвязиКТК[0];
		СтрокаВодителя = СтрокиДляСвязиВодители[0];
		
		ИдентификаторСтрокиВодителя = СтрокаВодителя.ИдентификаторСтроки;
		
		// Если уже есть строки КТК с таким водителем, то нужно спросить о необходимости перепривязать водителя
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить(ИдентификаторСтрокиТСИмя, ИдентификаторСтрокиВодителя);
		
		СвязанныеСтроки = Контейнеры.НайтиСтроки(ПараметрыОтбора);
		
		Если СвязанныеСтроки.Количество() > 0 Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			
			ПараметрыПривязки = Новый Структура();
			ПараметрыПривязки.Вставить("СтрокаКТК", 			СтрокаКТК);
			ПараметрыПривязки.Вставить("ИдентификаторСтроки", 	СтрокаВодителя.ИдентификаторСтроки);
			ПараметрыПривязки.Вставить("СвязанныеСтроки", 		СвязанныеСтроки);
			
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОПерепривязке", ЭтотОбъект, ПараметрыПривязки);
			ПоказатьВопрос(Оповещение, "Привязка строки с данными по автоперевозке с нескольким контейнерам невозможна. 
							|Перепривязать данные по водителю " + СтрокаВодителя.ФИОВодителя + " (" + СтрокаВодителя.РегНомерТС + ") к контейнеру " + СтрокаКТК.Контейнер + "?" , Режим, 0);
		Иначе
			СтрокаКТК[ИдентификаторСтрокиТСИмя] = СтрокаВодителя.ИдентификаторСтроки;
			СтрокаКТК.Привязан = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьОтборКТК();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборТолькоНепривязанные(Команда)
	ТолькоНепривязанные = Не ТолькоНепривязанные;
	УстановитьОтборКТК();	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеЗакрытияВопросаОПерепривязке(Результат, ДопПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
	
	// Уберем идентификатор водителя в ранее привязанных строках
	СвязанныеСтроки = ДопПараметры.СвязанныеСтроки;
	Для Каждого ТекущаяСтрока Из СвязанныеСтроки Цикл
		ТекущаяСтрока[ИдентификаторСтрокиТСИмя] = "";
		ТекущаяСтрока.Привязан = Ложь;
	КонецЦикла;	
	
	ДопПараметры.СтрокаКТК[ИдентификаторСтрокиТСИмя] = ДопПараметры.ИдентификаторСтроки;
	ДопПараметры.СтрокаКТК.Привязан = Истина;
	
КонецПроцедуры

&НаСервере
Функция СтруктураВозвращаемыхДанных()
	
	СтруктураВозврата = Новый Структура;
	
	РеквизитыФормы = ПолучитьРеквизиты();
	Для Каждого РеквизитФормы Из РеквизитыФормы Цикл
		
		СтруктураВозврата.Вставить(РеквизитФормы.Имя, ЭтотОбъект[РеквизитФормы.Имя]);
		
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервере
Процедура УстановитьОтборКТК()
	
	Элементы.КонтейнерыОтборТолькоНепривязанные.Пометка = ТолькоНепривязанные;
	
	Если ТолькоНепривязанные Тогда
		ОтборСтрок = Новый ФиксированнаяСтруктура("Привязан", Ложь);
		Элементы.Контейнеры.ОтборСтрок = ОтборСтрок;
	Иначе
		Элементы.Контейнеры.ОтборСтрок = Неопределено;
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура НастроитьВидимостьЭлементов()	
	Элементы.ТранспортныеСредства.Видимость = ПривязкаКВодителям;
КонецПроцедуры	

#КонецОбласти

#Область Инициализация
ВыполняетсяЗакрытие 			  = Ложь;
#КонецОбласти