
//Евросиб Коханенко Н.А. 23.10.2023 (( #76425
//перенесено из модуля объекта ПТУ, универсальная проверка в обработке проведения ПТУ и КоррПТУ
Процедура КонтрольОтрицательныхОстатковПоПривязаннымСчетам(Ссылка, Отказ) Экспорт
	
	//Евросиб Каблов 11.05.2021 ( Ticket#0230766
	//   Запрос = Новый Запрос(
	//   "ВЫБРАТЬ
	//   |	СвязанныеСчетаПоставщиков.СчетПоставщика КАК СчетПоставщику
	//   |ПОМЕСТИТЬ ВР_ПривязанныеСчетаПоставщику
	//   |ИЗ
	//   |	&СвязанныеСчетаПоставщиков КАК СвязанныеСчетаПоставщиков
	//   |;
	//   |
	//   |////////////////////////////////////////////////////////////////////////////////
	//   |ВЫБРАТЬ
	//   |	ОстаткиПоСчетам.СчетПоставщика КАК Номенклатура,
	//   |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ОстаткиПоСчетам.СчетПоставщика) КАК СчетПредставление,
	//   |	-ОстаткиПоСчетам.СуммаОстаток КАК ПереборСуммы
	//   |ИЗ
	//   |	РегистрНакопления.ПривязанныеСчетаПоставщиков.Остатки(
	//   |			&МоментВремени,
	//   |			СчетПоставщика В
	//   |				(ВЫБРАТЬ
	//   |					ПривязанныеСчетаПоставщику.СчетПоставщику КАК СчетПоставщику
	//   |				ИЗ
	//   |					ВР_ПривязанныеСчетаПоставщику КАК ПривязанныеСчетаПоставщику)) КАК ОстаткиПоСчетам
	//   |ГДЕ
	//   |	ОстаткиПоСчетам.СуммаОстаток < 0");
    //ГраницаКонтроля = Новый Граница(МоментВремени(), ВидГраницы.Включая);
    //Запрос.УстановитьПараметр("МоментВремени", ГраницаКонтроля);
    //Запрос.УстановитьПараметр("СвязанныеСчетаПоставщиков", СвязанныеСчетаПоставщиков.Выгрузить());
    //РезультатЗапроса = Запрос.Выполнить();
   
////    Если Не РезультатЗапроса.Пустой() Тогда
    //    Отказ = Истина;
    //    ВыборкаОшибки = РезультатЗапроса.Выбрать();
    //    Пока ВыборкаОшибки.Следующий() Цикл
    //        Сообщение = Новый СообщениеПользователю;
    //        Сообщение.Текст = "По счету "+ВыборкаОшибки.СчетПредставление+" превышение суммы "+ВыборкаОшибки.ПереборСуммы+" руб.";
    //        Сообщение.Сообщить();
    //    КонецЦикла;
    //КонецЕсли;
    
    Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.СчетПоставщика КАК СчетПоставщику
	|ПОМЕСТИТЬ ВР_ПривязанныеСчетаПоставщику
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.СвязанныеСчетаПоставщиков КАК ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков
	|ГДЕ
	|	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.Ссылка = &Ссылка
    //Евросиб Коханенко Н.А. 23.10.2023 (( #76425
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	КорректировкаПоступленияСвязанныеСчетаПоставщиков.СчетПоставщика
	|ИЗ
	|	Документ.КорректировкаПоступления.СвязанныеСчетаПоставщиков КАК КорректировкаПоступленияСвязанныеСчетаПоставщиков
	|ГДЕ
	|	КорректировкаПоступленияСвязанныеСчетаПоставщиков.Ссылка = &Ссылка
	//Евросиб Коханенко Н.А. 23.10.2023 )) #76425 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиПоСчетам.СчетПоставщика КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ОстаткиПоСчетам.СчетПоставщика) КАК СчетПредставление,
	|	-ОстаткиПоСчетам.СуммаОстаток КАК ПереборСуммы,
    //Евросиб Коханенко Н.А. 23.10.2023 (( #76425
	|	ЕСТЬNULL(Валюты.СокращенноеНаименование, """") КАК ВалютыСокращенноеНаименование,
	//Евросиб Коханенко Н.А. 23.10.2023 )) #76425 
	|	ЛОЖЬ КАК СчетПозжеПТУ
	|ИЗ
	|	РегистрНакопления.ПривязанныеСчетаПоставщиков.Остатки(
	|			,
	|			СчетПоставщика В
	|				(ВЫБРАТЬ
	|					ПривязанныеСчетаПоставщику.СчетПоставщику КАК СчетПоставщику
	|				ИЗ
	|					ВР_ПривязанныеСчетаПоставщику КАК ПривязанныеСчетаПоставщику)) КАК ОстаткиПоСчетам
    //Евросиб Коханенко Н.А. 23.10.2023 (( #76425
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО (ОстаткиПоСчетам.СчетПоставщика.ВалютаДокумента = Валюты.Ссылка)
	//Евросиб Коханенко Н.А. 23.10.2023 )) #76425 
	|ГДЕ
	|	ОстаткиПоСчетам.СуммаОстаток < 0");
    //ДИТ, Беляев СЮ, Ticket#0309546, 24-05-2023, начало (закомментировал, согласовано отключение условия по дате)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ВР_ПривязанныеСчетаПоставщику.СчетПоставщику,
	//|	ПРЕДСТАВЛЕНИЕ(ВР_ПривязанныеСчетаПоставщику.СчетПоставщику),
	//|	0,
	//|	ИСТИНА
	//|ИЗ
	//|	ВР_ПривязанныеСчетаПоставщику КАК ВР_ПривязанныеСчетаПоставщику
	//|ГДЕ
	//|	ВР_ПривязанныеСчетаПоставщику.СчетПоставщику.Дата > &ДатаПоступления
	//|	И ВР_ПривязанныеСчетаПоставщику.СчетПоставщику ССЫЛКА Документ.СчетНаОплатуПоставщика");
	//ДИТ, Беляев СЮ, Ticket#0309546, 24-05-2023, конец
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//Запрос.УстановитьПараметр("ДатаПоступления", Дата); //ДИТ, Беляев СЮ, Ticket#0309546, 24-05-2023, закомментировал, согласовано отключение условия по дате
	ДанныеОбОшибке = Запрос.Выполнить().Выбрать();
   
	Пока ДанныеОбОшибке.Следующий() Цикл
		//Если ДанныеОбОшибке.СчетПозжеПТУ Тогда
		//	ТекстСообщения = СтрШаблон("Дата счета %1 больше даты поступления!", ДанныеОбОшибке.СчетПредставление);
		//ИначеЕсли ДанныеОбОшибке.ПереборСуммы <> 0 Тогда
		//	ТекстСообщения = СтрШаблон("По счету %1 превышение суммы %2 руб.", ДанныеОбОшибке.СчетПредставление, ДанныеОбОшибке.ПереборСуммы);
		//КонецЕсли;
		//ДИТ, Беляев СЮ, Ticket#0309546, 24-05-2023, начало (согласовано отключение условия по дате, оставляем только контроль сумм)
		//Евросиб Коханенко Н.А. 23.10.2023 (( #76425
		//ТекстСообщения = СтрШаблон("По счету %1 превышение суммы %2 руб.", ДанныеОбОшибке.СчетПредставление, ДанныеОбОшибке.ПереборСуммы);
		ТекстСообщения = СтрШаблон("По счету %1 превышение суммы %2 %3", ДанныеОбОшибке.СчетПредставление, ДанныеОбОшибке.ПереборСуммы, ДанныеОбОшибке.ВалютыСокращенноеНаименование);
		//Евросиб Коханенко Н.А. 23.10.2023 )) #76425 
		//ДИТ, Беляев СЮ, Ticket#0309546, 24-05-2023, конец
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЦикла;
	//Евросиб Каблов 11.05.2021 )
	
КонецПроцедуры
//Евросиб Коханенко Н.А. 23.10.2023 )) #76425  
