
Функция ПроверкаОперацииНаВыполнениеУсловий(Операция) ЭКСПОРТ
	
	ДатаОтпр = Операция.ДатаОтправленияФакт;
	ДатаНазн = Операция.ДатаНазначенияФакт;
	
	
	КвалификаторыДаты = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
    ОписаниеДаты = Новый ОписаниеТипов("Дата", , ,КвалификаторыДаты);
	
	ОперацииДляИзменения = Новый ТаблицаЗначений;
	ОперацииДляИзменения.Колонки.Добавить("Операция",Новый ОписаниеТипов("ДокументСсылка.Операция"));
	ОперацииДляИзменения.Колонки.Добавить("Контейнер",Новый ОписаниеТипов("СправочникСсылка.ТЕ"));
	ОперацииДляИзменения.Колонки.Добавить("ДатаОтправленияФакт",ОписаниеДаты);
	ОперацииДляИзменения.Колонки.Добавить("ДатаНазначенияФакт",ОписаниеДаты);
	
	// 1. изменилась операция с признаком ВыдачаКонтейнераКлиентуИзСтока
	Если Операция.Услуга.ВыдачаКонтейнераКлиентуИзСтока Тогда
		
		// получить массив КТК
		МассивКТК = Новый Массив;
		Для Каждого Стр Из Операция.Грузы Цикл
			Если ЗначениеЗаполнено(Стр.ТЕ) Тогда
				МассивКТК.Добавить(Стр.ТЕ);
			КонецЕсли;
		КонецЦикла;
		// проверка КТК в заявке
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗаявкаСоставУслуги.ДатаВыдачи КАК ДатаВыдачи,
		               |	ЗаявкаСоставУслуги.НомерКТК КАК НомерКТК
		               |ИЗ
		               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
					   // Евросиб Фролов (26.12.2021 TASK №44663 
					   //|		ПО СделкаСвязьУчетныхЕдиниц.Контейнер = ЗаявкаСоставУслуги.НомерКТК 
					   |		ПО СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки = ЗаявкаСоставУслуги.ГУИДСтроки
					   // Евросиб Фролов)		              
		               |			И СделкаСвязьУчетныхЕдиниц.Заявка = ЗаявкаСоставУслуги.Ссылка
		               |			И (НЕ ЗаявкаСоставУслуги.ДатаВыдачи = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		               |ГДЕ
		               |	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
		               |	И СделкаСвязьУчетныхЕдиниц.Контейнер В(&Контейнер)
		               |	И НЕ СделкаСвязьУчетныхЕдиниц.Заявка = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ДатаВыдачи";
		Запрос.УстановитьПараметр("Ссылка",Операция.Сделка);
		Запрос.УстановитьПараметр("Контейнер",МассивКТК);
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Стр Из ТЗ Цикл
			
			НовСтр = ОперацииДляИзменения.Добавить();
			НовСтр.Операция = Операция.Ссылка;
			НовСтр.ДатаОтправленияФакт = Стр.ДатаВыдачи;
			НовСтр.ДатаНазначенияФакт = Стр.ДатаВыдачи;
			НовСтр.Контейнер = Стр.НомерКТК;
			
		КонецЦикла;
		
		// проверить, если в Операции в ТЧ заполнились все даты по КТК и можно заполнить шапку операции,
		// то обновить дату начала и дату окончания
		
		ВремТбл = Операция.Грузы.Выгрузить(,"ТЕ,ДатаОтправления,ДатаПрибытия");
		
		ДтОтпрЗаполнено = Истина;
		ДтПрибЗаполнено = Истина;
		Для Каждого Стр Из ВремТбл Цикл
			// из таблицы ОперацииДляИзменения берем информацию по данной операции и каждому КТК.
			// если в таблице ОперацииДляИзменения есть такой КТК, то берем его дату отправления или назначения.
			// если они не заполнены, то оставляем то, что было изначально в документе Операция.
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Контейнер",Стр.ТЕ);
			ПараметрыОтбора.Вставить("Операция",Операция.Ссылка);
			НайденныеСтр = ОперацииДляИзменения.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтр.Количество()>0 Тогда
				Стр.ДатаОтправления = ?(ЗначениеЗаполнено(НайденныеСтр[0].ДатаОтправленияФакт),НайденныеСтр[0].ДатаОтправленияФакт,Стр.ДатаОтправления);
				Стр.ДатаПрибытия = ?(ЗначениеЗаполнено(НайденныеСтр[0].ДатаНазначенияФакт),НайденныеСтр[0].ДатаНазначенияФакт,Стр.ДатаПрибытия);
			КонецЕсли;
			Если ЗначениеЗаполнено(Стр.ТЕ) И Не ЗначениеЗаполнено(Стр.ДатаОтправления) Тогда
				ДтОтпрЗаполнено = Ложь;
			КонецЕсли;
			Если ЗначениеЗаполнено(Стр.ТЕ) И Не ЗначениеЗаполнено(Стр.ДатаПрибытия) Тогда
				ДтПрибЗаполнено = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		// если все даты заполнены, то сортируем таблицу по возрастанию и убыванию по нужным датам и берем 
		// первую из них с заполненным значением ТЕ
		Если ДтОтпрЗаполнено = Истина Тогда
			ВремТбл.Сортировать("ДатаОтправления ВОЗР");
			Для Каждого Стр Из ВремТбл Цикл
				Если ЗначениеЗаполнено(Стр.ТЕ) Тогда
					ДатаОтпр = Стр.ДатаОтправления;
					НовСтр = ОперацииДляИзменения.Добавить();
					НовСтр.Операция = Операция.Ссылка;
					НовСтр.ДатаОтправленияФакт = ДатаОтпр;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если ДтПрибЗаполнено = Истина Тогда
			ВремТбл.Сортировать("ДатаПрибытия УБЫВ");
			Для Каждого Стр Из ВремТбл Цикл
				Если ЗначениеЗаполнено(Стр.ТЕ) Тогда
					ДатаНазн = Стр.ДатаПрибытия;
					НовСтр = ОперацииДляИзменения.Добавить();
					НовСтр.Операция = Операция.Ссылка;
					НовСтр.ДатаНазначенияФакт = ДатаНазн;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;	
		
	// 2. изменилась операция с признаком "ПРРГруженогоКонтейнера" -> ПРР 
	// (с 26.05 просто ПРР, но проверяем, что есть хотя бы 1 груженый КТК)
	Если Операция.Услуга.ПРР И ЕстьГруженыеКТК(Операция) Тогда
		
		МассивГУИДРодителей = РаботаСМаршрутизациейДокументов.ПолучитьМассивРодителей(Операция.Ссылка,Истина,1);
		МассивГУИДПодчиненных = РаботаСМаршрутизациейДокументов.ПолучитьМассивРодителей(Операция.Ссылка,Ложь,1);
		
		// проверяем, что предыдущая операция - фрахт и проставляем даты тек операции ПРРГруженогоКонтейнера по дате назначения фрахта
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТехнологическаяСхемаТЧ.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
		               |ГДЕ
		               |	ТехнологическаяСхемаТЧ.Операция = &Операция
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТехнологическаяСхемаТЧ.Операция.ДатаНазначенияФакт КАК ДатаНазначенияФакт
		               |ИЗ
		               |	ВТ КАК ВТ
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
		               |		ПО ВТ.Ссылка = ТехнологическаяСхемаТЧ.Ссылка
		               |ГДЕ
		               |	ТехнологическаяСхемаТЧ.ГУИД В(&ГУИД)
		               |	И ТехнологическаяСхемаТЧ.Операция.Услуга.Фрахт
		               |	И НЕ ТехнологическаяСхемаТЧ.Операция.ДатаНазначенияФакт = &ДатаНазначенияФакт
		               |	И НЕ ТехнологическаяСхемаТЧ.Операция.ДатаНазначенияФакт = &ДатаОтправленияФакт";
		Запрос.УстановитьПараметр("Операция",Операция.Ссылка);
		Запрос.УстановитьПараметр("ДатаНазначенияФакт",ДатаНазн);
		Запрос.УстановитьПараметр("ДатаОтправленияФакт",ДатаОтпр);
		Запрос.УстановитьПараметр("ГУИД",МассивГУИДРодителей);
		ТЗ1 = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Стр Из ТЗ1 Цикл
			
			НовСтр = ОперацииДляИзменения.Добавить();
			НовСтр.Операция = Операция.Ссылка;
			НовСтр.ДатаОтправленияФакт = Стр.ДатаНазначенияФакт;
			НовСтр.ДатаНазначенияФакт = Стр.ДатаНазначенияФакт;
			
		КонецЦикла;
		
		// проверяем, что следующая операция - фрахт и проставляем даты тек операции ПРРГруженогоКонтейнера по дате отправления фрахта
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТехнологическаяСхемаТЧ.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
		               |ГДЕ
		               |	ТехнологическаяСхемаТЧ.Операция = &Операция
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТехнологическаяСхемаТЧ.Операция.ДатаОтправленияФакт КАК ДатаОтправленияФакт
		               |ИЗ
		               |	ВТ КАК ВТ
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
		               |		ПО ВТ.Ссылка = ТехнологическаяСхемаТЧ.Ссылка
		               |ГДЕ
		               |	ТехнологическаяСхемаТЧ.ГУИД В(&ГУИД)
		               |	И ТехнологическаяСхемаТЧ.Операция.Услуга.Фрахт
		               |	И НЕ ТехнологическаяСхемаТЧ.Операция.ДатаОтправленияФакт = &ДатаНазначенияФакт
		               |	И НЕ ТехнологическаяСхемаТЧ.Операция.ДатаОтправленияФакт = &ДатаОтправленияФакт";
		Запрос.УстановитьПараметр("Операция",Операция.Ссылка);
		Запрос.УстановитьПараметр("ДатаНазначенияФакт",ДатаНазн);
		Запрос.УстановитьПараметр("ДатаОтправленияФакт",ДатаОтпр);
		Запрос.УстановитьПараметр("ГУИД",МассивГУИДПодчиненных);
		ТЗ2 = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Стр Из ТЗ2 Цикл
			
			НовСтр = ОперацииДляИзменения.Добавить();
			НовСтр.Операция = Операция.Ссылка;
			НовСтр.ДатаОтправленияФакт = Стр.ДатаОтправленияФакт;
			НовСтр.ДатаНазначенияФакт = Стр.ДатаОтправленияФакт;
			
		КонецЦикла;
	КонецЕсли;
			
	// 4. изменилась операция с признаком КрановыеОперации и ХранениеНаТерминалеГруженогоКонтейнера
	Если Операция.Услуга.КрановыеОперации ИЛИ Операция.Услуга.ХранениеНаТерминалеГруженогоКонтейнера Тогда
				
		// проверяем, что есть операция с признаком ПРР и проставляем дату отправления текущей операции по дате назначения ПРР
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТехнологическаяСхемаТЧ.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
		               |ГДЕ
		               |	ТехнологическаяСхемаТЧ.Операция = &Операция
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МАКСИМУМ(ТехнологическаяСхемаТЧ.Операция.ДатаНазначенияФакт) КАК ДатаНазначенияФакт,
		               |	ТехнологическаяСхемаТЧ.Ссылка КАК Ссылка
		               |ИЗ
		               |	ВТ КАК ВТ
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
		               |		ПО ВТ.Ссылка = ТехнологическаяСхемаТЧ.Ссылка
		               |ГДЕ
		               |	ТехнологическаяСхемаТЧ.Операция.Услуга.ПРР
		               |	И НЕ ТехнологическаяСхемаТЧ.Операция.ДатаНазначенияФакт = &ДатаОтправленияФакт
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТехнологическаяСхемаТЧ.Ссылка";
		Запрос.УстановитьПараметр("Операция",Операция.Ссылка);
		Запрос.УстановитьПараметр("ДатаОтправленияФакт",ДатаОтпр);
		ТЗ1 = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Стр Из ТЗ1 Цикл
			
			НовСтр = ОперацииДляИзменения.Добавить();
			НовСтр.Операция = Операция.Ссылка;
			НовСтр.ДатаОтправленияФакт = Стр.ДатаНазначенияФакт;
			
		КонецЦикла;
		
		// проверяем, что есть операция с признаком КомплекснаяУслугаПоТерминaльнойОбработке и проставляем дату назначения
		// по дате отправления КомплекснаяУслугаПоТерминaльнойОбработке
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТехнологическаяСхемаТЧ.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
		               |ГДЕ
		               |	ТехнологическаяСхемаТЧ.Операция = &Операция
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МАКСИМУМ(ТехнологическаяСхемаТЧ.Операция.ДатаОтправленияФакт) КАК ДатаОтправленияФакт,
		               |	ТехнологическаяСхемаТЧ.Ссылка КАК Ссылка
		               |ИЗ
		               |	ВТ КАК ВТ
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
		               |		ПО ВТ.Ссылка = ТехнологическаяСхемаТЧ.Ссылка
		               |ГДЕ
		               |	ТехнологическаяСхемаТЧ.Операция.Услуга.КомплекснаяУслугаПоТерминaльнойОбработке
		               |	И НЕ ТехнологическаяСхемаТЧ.Операция.ДатаОтправленияФакт = &ДатаОтправленияФакт
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТехнологическаяСхемаТЧ.Ссылка";
		Запрос.УстановитьПараметр("Операция",Операция.Ссылка);
		Запрос.УстановитьПараметр("ДатаОтправленияФакт",ДатаНазн);
		ТЗ2 = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Стр Из ТЗ2 Цикл
			
			НовСтр = ОперацииДляИзменения.Добавить();
			НовСтр.Операция = Операция.Ссылка;
			НовСтр.ДатаНазначенияФакт = Стр.ДатаОтправленияФакт;
			
		КонецЦикла;
	КонецЕсли;
		
		
	// 7. если изменилась операция с признаком ОтмечатьНачалоКакФактОкончанияПредыдущей
	// то нужно проверить операцию до нее и проставить для текущей операции дату начала из даты окончания предыдущей	
	Если Операция.Услуга.ОтмечатьНачалоКакФактОкончанияПредыдущей Тогда
		
		МассивГУИДРодителей = РаботаСМаршрутизациейДокументов.ПолучитьМассивРодителей(Операция.Ссылка,Истина,1);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТехнологическаяСхемаТЧ.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
		               |ГДЕ
		               |	ТехнологическаяСхемаТЧ.Операция = &Операция
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТехнологическаяСхемаТЧ.Операция.Ссылка КАК Операция,
		               |	ТехнологическаяСхемаТЧ.Операция.ДатаНазначенияФакт КАК ДатаНазначенияФакт
		               |ИЗ
		               |	ВТ КАК ВТ
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
		               |		ПО ВТ.Ссылка = ТехнологическаяСхемаТЧ.Ссылка
		               |ГДЕ
		               |	ТехнологическаяСхемаТЧ.ГУИД В(&ГУИД)
		               |	И НЕ ТехнологическаяСхемаТЧ.Операция.ДатаНазначенияФакт = &ДатаНазначенияФакт";
		Запрос.УстановитьПараметр("Операция",Операция.Ссылка);
		Запрос.УстановитьПараметр("ДатаНазначенияФакт",ДатаОтпр);
		Запрос.УстановитьПараметр("ГУИД",МассивГУИДРодителей);
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Стр Из ТЗ Цикл
			
			НовСтр = ОперацииДляИзменения.Добавить();
			НовСтр.Операция = Операция.Ссылка;
			НовСтр.ДатаОтправленияФакт = Стр.ДатаНазначенияФакт;
			
		КонецЦикла;
	КонецЕсли;
		
	// 8. если изменилась операция с признаком ОтмечатьОкончаниеКакФактНачалаПоследующей
	// то нужно проверить операцию после нее и проставить для текущей операции дату окончанию из даты начала следующей	
	Если Операция.Услуга.ОтмечатьОкончаниеКакФактНачалаПоследующей Тогда
		
		МассивГУИДПодчиненных = РаботаСМаршрутизациейДокументов.ПолучитьМассивРодителей(Операция.Ссылка,Ложь,1);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТехнологическаяСхемаТЧ.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
		               |ГДЕ
		               |	ТехнологическаяСхемаТЧ.Операция = &Операция
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТехнологическаяСхемаТЧ.Операция.Ссылка КАК Операция,
		               |	ТехнологическаяСхемаТЧ.Операция.ДатаНазначенияФакт КАК ДатаОтправленияФакт
		               |ИЗ
		               |	ВТ КАК ВТ
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
		               |		ПО ВТ.Ссылка = ТехнологическаяСхемаТЧ.Ссылка
		               |ГДЕ
		               |	ТехнологическаяСхемаТЧ.ГУИД В(&ГУИД)
		               |	И НЕ ТехнологическаяСхемаТЧ.Операция.ДатаОтправленияФакт = &ДатаОтправленияФакт";
		Запрос.УстановитьПараметр("Операция",Операция.Ссылка);
		Запрос.УстановитьПараметр("ДатаОтправленияФакт",ДатаНазн);
		Запрос.УстановитьПараметр("ГУИД",МассивГУИДПодчиненных);
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Стр Из ТЗ Цикл
			
			НовСтр = ОперацииДляИзменения.Добавить();
			НовСтр.Операция = Операция.Ссылка;
			НовСтр.ДатаНазначенияФакт = Стр.ДатаОтправленияФакт;
			
		КонецЦикла;
	КонецЕсли;
		
		
	Возврат ОперацииДляИзменения;
	
	
КонецФункции

Функция ПроверкаСоседнихОперацийНаВыполнениеУсловий(Операция) ЭКСПОРТ
	
	ДатаОтпр = Операция.ДатаОтправленияФакт;
	ДатаНазн = Операция.ДатаНазначенияФакт;
	
	
	КвалификаторыДаты = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
    ОписаниеДаты = Новый ОписаниеТипов("Дата", , ,КвалификаторыДаты);
	
	ОперацииДляИзменения = Новый ТаблицаЗначений;
	ОперацииДляИзменения.Колонки.Добавить("Операция",Новый ОписаниеТипов("ДокументСсылка.Операция"));
	ОперацииДляИзменения.Колонки.Добавить("Контейнер",Новый ОписаниеТипов("СправочникСсылка.ТЕ"));
	ОперацииДляИзменения.Колонки.Добавить("ДатаОтправленияФакт",ОписаниеДаты);
	ОперацииДляИзменения.Колонки.Добавить("ДатаНазначенияФакт",ОписаниеДаты);
	
	
	// 3. если изменилась операция с признаком фрахт, то нужно проверить операции с признаком ПРРГруженогоКонтейнера вокруг него
	// С 26.05 проверяем операции ПРР с имеющимся хотя бы одним груженым КТК
	Если Операция.Услуга.Фрахт Тогда
		
		МассивГУИДРодителей = РаботаСМаршрутизациейДокументов.ПолучитьМассивРодителей(Операция.Ссылка,Истина,1);
		МассивГУИДПодчиненных = РаботаСМаршрутизациейДокументов.ПолучитьМассивРодителей(Операция.Ссылка,Ложь,1);
		
		// проверяем, что предыдущая операция - ПРРГруженогоКонтейнера и проставляем даты в нее по дате отправления фрахта
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТехнологическаяСхемаТЧ.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
		               |ГДЕ
		               |	ТехнологическаяСхемаТЧ.Операция = &Операция
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТехнологическаяСхемаТЧ.Операция.Ссылка КАК Операция
		               |ПОМЕСТИТЬ ТСх
		               |ИЗ
		               |	ВТ КАК ВТ
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
		               |		ПО ВТ.Ссылка = ТехнологическаяСхемаТЧ.Ссылка
		               |ГДЕ
		               |	ТехнологическаяСхемаТЧ.ГУИД В(&ГУИД)
		               |	И ТехнологическаяСхемаТЧ.Операция.Услуга.ПРР
		               |	И НЕ ТехнологическаяСхемаТЧ.Операция.ДатаОтправленияФакт = &ДатаНазначенияФакт
		               |	И НЕ ТехнологическаяСхемаТЧ.Операция.ДатаОтправленияФакт = &ДатаОтправленияФакт
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ОперацияГрузы.Ссылка КАК Операция
		               |ИЗ
		               |	Документ.Операция.Грузы КАК ОперацияГрузы
		               |ГДЕ
		               |	ОперацияГрузы.Ссылка В
		               |			(ВЫБРАТЬ
		               |				ТСх.Операция
		               |			ИЗ
		               |				ТСх КАК ТСх)
		               |	И НЕ ОперацияГрузы.ТЕ = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		               |	И ОперацияГрузы.ГруженоеТЕ";
		Запрос.УстановитьПараметр("Операция",Операция.Ссылка);
		Запрос.УстановитьПараметр("ДатаНазначенияФакт",ДатаНазн);
		Запрос.УстановитьПараметр("ДатаОтправленияФакт",ДатаОтпр);
		Запрос.УстановитьПараметр("ГУИД",МассивГУИДРодителей);
		ТЗ1 = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Стр Из ТЗ1 Цикл
			
			НовСтр = ОперацииДляИзменения.Добавить();
			НовСтр.Операция = Стр.Операция;
			НовСтр.ДатаОтправленияФакт = ДатаОтпр;
			НовСтр.ДатаНазначенияФакт = ДатаОтпр;
			
		КонецЦикла;
		
		// проверяем, что следующая операция - ПРРГруженогоКонтейнера и проставляем ее даты по дате назначения фрахта
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТехнологическаяСхемаТЧ.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
		               |ГДЕ
		               |	ТехнологическаяСхемаТЧ.Операция = &Операция
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТехнологическаяСхемаТЧ.Операция.Ссылка КАК Операция
		               |ПОМЕСТИТЬ ТСх
		               |ИЗ
		               |	ВТ КАК ВТ
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
		               |		ПО ВТ.Ссылка = ТехнологическаяСхемаТЧ.Ссылка
		               |ГДЕ
		               |	ТехнологическаяСхемаТЧ.ГУИД В(&ГУИД)
		               |	И ТехнологическаяСхемаТЧ.Операция.Услуга.ПРР
		               |	И НЕ ТехнологическаяСхемаТЧ.Операция.ДатаНазначенияФакт = &ДатаНазначенияФакт
		               |	И НЕ ТехнологическаяСхемаТЧ.Операция.ДатаНазначенияФакт = &ДатаОтправленияФакт
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ОперацияГрузы.Ссылка КАК Операция
		               |ИЗ
		               |	Документ.Операция.Грузы КАК ОперацияГрузы
		               |ГДЕ
		               |	ОперацияГрузы.Ссылка В
		               |			(ВЫБРАТЬ
		               |				ТСх.Операция
		               |			ИЗ
		               |				ТСх КАК ТСх)
		               |	И НЕ ОперацияГрузы.ТЕ = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		               |	И ОперацияГрузы.ГруженоеТЕ";
		Запрос.УстановитьПараметр("Операция",Операция.Ссылка);
		Запрос.УстановитьПараметр("ДатаНазначенияФакт",ДатаНазн);
		Запрос.УстановитьПараметр("ДатаОтправленияФакт",ДатаОтпр);
		Запрос.УстановитьПараметр("ГУИД",МассивГУИДПодчиненных);
		ТЗ2 = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Стр Из ТЗ2 Цикл
			
			НовСтр = ОперацииДляИзменения.Добавить();
			НовСтр.Операция = Стр.Операция;
			НовСтр.ДатаОтправленияФакт = ДатаНазн;
			НовСтр.ДатаНазначенияФакт = ДатаНазн;
			
		КонецЦикла;
	КонецЕсли;	
		
	// 5. если изменилась операция с признаком ПРР, то нужно проверить операции с признаком КрановыеОперации ИЛИ ХранениеНаТерминалеГруженогоКонтейнера вокруг него	
	Если Операция.Услуга.ПРР Тогда
		
		// проверяем, что есть операция - КрановыеОперации ИЛИ ХранениеНаТерминалеГруженогоКонтейнера и проставляем 
		// в нее дату отправления по дате назначения ПРР
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТехнологическаяСхемаТЧ.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
		               |ГДЕ
		               |	ТехнологическаяСхемаТЧ.Операция = &Операция
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТехнологическаяСхемаТЧ.Операция.Ссылка КАК Операция,
		               |	ТехнологическаяСхемаТЧ.Операция.ДатаНазначенияФакт КАК ДатаНазначенияФакт
		               |ИЗ
		               |	ВТ КАК ВТ
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
		               |		ПО ВТ.Ссылка = ТехнологическаяСхемаТЧ.Ссылка
		               |ГДЕ
		               |	(ТехнологическаяСхемаТЧ.Операция.Услуга.КрановыеОперации
		               |			ИЛИ ТехнологическаяСхемаТЧ.Операция.Услуга.ХранениеНаТерминалеГруженогоКонтейнера)
		               |	И НЕ ТехнологическаяСхемаТЧ.Операция.ДатаНазначенияФакт = &ДатаНазначенияФакт";
		Запрос.УстановитьПараметр("Операция",Операция.Ссылка);
		Запрос.УстановитьПараметр("ДатаНазначенияФакт",ДатаОтпр);
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Стр Из ТЗ Цикл
			
			НовСтр = ОперацииДляИзменения.Добавить();
			НовСтр.Операция = Стр.Операция;
			НовСтр.ДатаОтправленияФакт = ДатаНазн;
			
		КонецЦикла;
	КонецЕсли;
				
	// 6. если изменилась операция с признаком КомплекснаяУслугаПоТерминaльнойОбработке
	Если Операция.Услуга.КомплекснаяУслугаПоТерминaльнойОбработке Тогда
		
		// 6.1. то нужно проверить операции с признаком КрановыеОперации ИЛИ ХранениеНаТерминалеГруженогоКонтейнера вокруг нее	
		
		// проверяем, что операция - КрановыеОперации ИЛИ ХранениеНаТерминалеГруженогоКонтейнера и проставляем 
		// дату назначения в нее по дате отправления КомплекснаяУслугаПоТерминaльнойОбработке
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТехнологическаяСхемаТЧ.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
		               |ГДЕ
		               |	ТехнологическаяСхемаТЧ.Операция = &Операция
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТехнологическаяСхемаТЧ.Операция.Ссылка КАК Операция,
		               |	ТехнологическаяСхемаТЧ.Операция.ДатаОтправленияФакт КАК ДатаОтправленияФакт
		               |ИЗ
		               |	ВТ КАК ВТ
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
		               |		ПО ВТ.Ссылка = ТехнологическаяСхемаТЧ.Ссылка
		               |ГДЕ
		               |	(ТехнологическаяСхемаТЧ.Операция.Услуга.КрановыеОперации
		               |			ИЛИ ТехнологическаяСхемаТЧ.Операция.Услуга.ХранениеНаТерминалеГруженогоКонтейнера)
		               |	И НЕ ТехнологическаяСхемаТЧ.Операция.ДатаОтправленияФакт = &ДатаОтправленияФакт";
		Запрос.УстановитьПараметр("Операция",Операция.Ссылка);
		Запрос.УстановитьПараметр("ДатаОтправленияФакт",ДатаНазн);
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Стр Из ТЗ Цикл
			
			НовСтр = ОперацииДляИзменения.Добавить();
			НовСтр.Операция = Стр.Операция;
			НовСтр.ДатаНазначенияФакт = ДатаОтпр;
			
		КонецЦикла;
		
		// 6.2 ПО СЛЕЖЕНИЮ
	КонецЕсли;	
		
					
	// 9. изменилась ЛЮБАЯ операция ПОСЛЕ КОТОРОЙ есть операция с признаком ОтмечатьНачалоКакФактОкончанияПредыдущей
	// ИЛИ до нее есть операция с признаком ОтмечатьОкончаниеКакФактНачалаПоследующей
	МассивГУИДРодителей = РаботаСМаршрутизациейДокументов.ПолучитьМассивРодителей(Операция.Ссылка,Истина,1);
	МассивГУИДПодчиненных = РаботаСМаршрутизациейДокументов.ПолучитьМассивРодителей(Операция.Ссылка,Ложь,1);
	
	// проверяем, что у предыдущей операции есть признак ОтмечатьОкончаниеКакФактНачалаПоследующей.
	// если у предыдущей операции дата назначения равна дате отправления текущей операции, то такие 
	// записи не выбирать, чтобы не перезаписывать операцию
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТехнологическаяСхемаТЧ.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
	               |ГДЕ
	               |	ТехнологическаяСхемаТЧ.Операция = &Операция
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТехнологическаяСхемаТЧ.Операция.Ссылка КАК Операция
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
	               |		ПО ВТ.Ссылка = ТехнологическаяСхемаТЧ.Ссылка
	               |ГДЕ
	               |	ТехнологическаяСхемаТЧ.ГУИД В(&ГУИД)
	               |	И ТехнологическаяСхемаТЧ.Операция.Услуга.ОтмечатьОкончаниеКакФактНачалаПоследующей
	               |	И НЕ ТехнологическаяСхемаТЧ.Операция.ДатаНазначенияФакт = &ДатаНазначенияФакт";
	Запрос.УстановитьПараметр("Операция",Операция.Ссылка);
	Запрос.УстановитьПараметр("ДатаНазначенияФакт",ДатаОтпр);
	Запрос.УстановитьПараметр("ГУИД",МассивГУИДРодителей);
	ТЗ1 = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр Из ТЗ1 Цикл
		
		НовСтр = ОперацииДляИзменения.Добавить();
		НовСтр.Операция = Стр.Операция;
		НовСтр.ДатаНазначенияФакт = ДатаОтпр;
		
	КонецЦикла;
	
	// проверяем, что у следующей операции есть признак ОтмечатьНачалоКакФактОкончанияПредыдущей.
	// если у следующей операции дата отправления равна дате назначения текущей операции, то такие 
	// записи не выбирать, чтобы не перезаписывать операцию
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТехнологическаяСхемаТЧ.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
	               |ГДЕ
	               |	ТехнологическаяСхемаТЧ.Операция = &Операция
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТехнологическаяСхемаТЧ.Операция.Ссылка КАК Операция
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
	               |		ПО ВТ.Ссылка = ТехнологическаяСхемаТЧ.Ссылка
	               |ГДЕ
	               |	ТехнологическаяСхемаТЧ.ГУИД В(&ГУИД)
	               |	И ТехнологическаяСхемаТЧ.Операция.Услуга.ОтмечатьНачалоКакФактОкончанияПредыдущей
	               |	И НЕ ТехнологическаяСхемаТЧ.Операция.ДатаОтправленияФакт = &ДатаОтправленияФакт";
	Запрос.УстановитьПараметр("Операция",Операция.Ссылка);
	Запрос.УстановитьПараметр("ДатаОтправленияФакт",ДатаНазн);
	Запрос.УстановитьПараметр("ГУИД",МассивГУИДПодчиненных);
	ТЗ2 = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр Из ТЗ2 Цикл
		
		НовСтр = ОперацииДляИзменения.Добавить();
		НовСтр.Операция = Стр.Операция;
		НовСтр.ДатаОтправленияФакт = ДатаНазн;
		
	КонецЦикла;
	
	
	Возврат ОперацииДляИзменения;
	
	
КонецФункции

Функция ЕстьГруженыеКТК(Операция)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОперацияГрузы.ТЕ КАК ТЕ
	               |ИЗ
	               |	Документ.Операция.Грузы КАК ОперацияГрузы
	               |ГДЕ
	               |	НЕ ОперацияГрузы.ТЕ = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	               |	И ОперацияГрузы.ГруженоеТЕ
	               |	И ОперацияГрузы.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Операция.Ссылка);
	РЗ = Запрос.Выполнить();
	
	ЕстьГруженые = НЕ РЗ.Пустой();
		
	Возврат ЕстьГруженые;
	
КонецФункции