
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПТУ") Тогда
		ПТУ = Параметры.ПТУ;
	КонецЕсли;
	Если Параметры.Свойство("НомерСтроки") Тогда
		НомерСтрокиЪ = Параметры.НомерСтроки;
	КонецЕсли;
	Если Параметры.Свойство("СуммаКРазнесению") Тогда
		СуммаКРазнесению = Параметры.СуммаКРазнесению;
	КонецЕсли;
	Если Параметры.Свойство("Перевыставляемые") Тогда
		Перевыставляемые = Параметры.Перевыставляемые;
	КонецЕсли;
	
	СтрокаПТУ = ПолучитьТекСтрокуПТУ(ПТУ, НомерСтрокиЪ)[0];
	
	ТЗСделок = ПолучитьДоступныеСделки(СтрокаПТУ,Неопределено,Перевыставляемые);
	Если Перевыставляемые Тогда
		ТЗСделок = ТЗСделок.Скопировать(,"Сделка,СтанцияОтправления,СтанцияНазначения,Клиент,Договор,Груз,Калькуляция,РазмерКТК,КолвоКТК,КолвоВаг,КолвоЖДН");
		ТЗСделок.Свернуть("Сделка,СтанцияОтправления,СтанцияНазначения,Клиент,Договор,Груз,Калькуляция,РазмерКТК","КолвоКТК,КолвоВаг,КолвоЖДН");
	Иначе
		ТЗСделок = ТЗСделок.Скопировать(,"Сделка,СтанцияОтправления,СтанцияНазначения,РазмерКТК,КолвоКТК,КолвоВаг,КолвоЖДН");
		ТЗСделок.Свернуть("Сделка,СтанцияОтправления,СтанцияНазначения","КолвоКТК,КолвоВаг,КолвоЖДН");
	КонецЕсли;
	
	СписокСделок.Загрузить(ТЗСделок);
	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ГруппаПеревыставляемые.Видимость = Перевыставляемые;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	Для Каждого Стр Из СписокСделок Цикл
		Стр.Отметка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметку(Команда)
	Для Каждого Стр Из СписокСделок Цикл
		Стр.Отметка = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РазнестиСумму(Команда)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Отметка",Истина);
	НайденныеСтроки = СписокСделок.НайтиСтроки(ПараметрыОтбора);
	КолвоОтмеченных = НайденныеСтроки.Количество();
	
	Если КолвоОтмеченных = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НаСделку = Окр(СуммаКРазнесению/КолвоОтмеченных,2);
	// проверим правильность округления
	Общ = НаСделку*КолвоОтмеченных;
	ПоследняяСумма = НаСделку;
	// если округлилось неверно, то отредактировать последнюю сумму (ту, которая будет записываться в последнюю строку)
	Если Общ < СуммаКРазнесению Тогда
		ПоследняяСумма = НаСделку+(СуммаКРазнесению-Общ);
	ИначеЕсли Общ > СуммаКРазнесению Тогда
		ПоследняяСумма = НаСделку+(Общ-СуммаКРазнесению);
	КонецЕсли;
	Для ШагЦикла = 0 ПО НайденныеСтроки.Количество()-1 Цикл
		Если ШагЦикла = НайденныеСтроки.Количество()-1 Тогда
			НайденныеСтроки[ШагЦикла].СуммаНаСделку = ПоследняяСумма;
		Иначе
			НайденныеСтроки[ШагЦикла].СуммаНаСделку = НаСделку;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура РазнестиРасходНаСервере(ТипРасхода)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Отметка",Истина);
	НайденныеСтроки = СписокСделок.НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого Стр Из НайденныеСтроки Цикл
		ПолучОб = Стр.Сделка.ПолучитьОбъект();
		
		ТЧРасход = ПолучОб.Расходы;
		НовСтр = ТЧРасход.Добавить();
		НовСтр.Поставщик = ПТУ.Контрагент;
		НовСтр.Договор = ПТУ.ДоговорКонтрагента;
//		НовСтр.Услуга = 
		
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДоступныеСделки(СтрокаПТУ,МассивСделок,Перевыставляемые)
	
	// если перевысталвяемые, тогда нужно создать строку и в расходах и доходах. 
	// Для ТЧ доходы нужно получить из сделки клиента, договор, калькуляцию
	
	ТЗСделок = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	Если МассивСделок = Неопределено Тогда
		УсловиеНаСделку = "";
	Иначе
		УсловиеНаСделку = "	И СделкаСвязьУчетныхЕдиниц.Ссылка В(&Ссылка)";
	КонецЕсли;
	// 1. Перевыставлемые
	Если Перевыставляемые Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Сделка,
		               |	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
		               |	СделкаСвязьУчетныхЕдиниц.Вагон КАК Вагон,
		               |	СделкаСвязьУчетныхЕдиниц.ЖДН КАК ЖДН,
		               |	СделкаСвязьУчетныхЕдиниц.Клиент КАК Клиент,
		               |	СделкаСвязьУчетныхЕдиниц.Договор КАК Договор,
		               |	СделкаСвязьУчетныхЕдиниц.Груз КАК Груз,
		               |	СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция,
		               |	СделкаСвязьУчетныхЕдиниц.РазмерКТК КАК РазмерКТК,
		               |	ВЫБОР
		               |		КОГДА ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.Контейнер, 0) = 0
		               |			ТОГДА 0
		               |		ИНАЧЕ 1
		               |	КОНЕЦ КАК КолвоКТК,
		               |	ВЫБОР
		               |		КОГДА ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.Вагон, 0) = 0
		               |			ТОГДА 0
		               |		ИНАЧЕ 1
		               |	КОНЕЦ КАК КолвоВаг,
		               |	ВЫБОР
		               |		КОГДА ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.ЖДН, 0) = 0
		               |			ТОГДА 0
		               |		ИНАЧЕ 1
		               |	КОНЕЦ КАК КолвоЖДН,
		               |	СделкаСвязьУчетныхЕдиниц.Ссылка.СтанцияОтправления КАК СтанцияОтправления,
		               |	СделкаСвязьУчетныхЕдиниц.Ссылка.СтанцияНазначения КАК СтанцияНазначения
		               |ИЗ
		               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		               |ГДЕ
		               |	(&Вагон ПОДОБНО ""%"" + СделкаСвязьУчетныхЕдиниц.Вагон.Наименование + ""%""
		               |			ИЛИ СделкаСвязьУчетныхЕдиниц.ЖДН В (&ЖДН)
		               |			ИЛИ &Контейнер ПОДОБНО ""%"" + СделкаСвязьУчетныхЕдиниц.Контейнер.Наименование + ""%"")" + УсловиеНаСделку + "";
	// 2. Собственные расходы
	Иначе
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Сделка,
		               |	СделкаСвязьУчетныхЕдиниц.Ссылка.СтанцияОтправления КАК СтанцияОтправления,
		               |	СделкаСвязьУчетныхЕдиниц.Ссылка.СтанцияНазначения КАК СтанцияНазначения,
		               |	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
		               |	СделкаСвязьУчетныхЕдиниц.Вагон КАК Вагон,
		               |	СделкаСвязьУчетныхЕдиниц.ЖДН КАК ЖДН,
		               |	СделкаСвязьУчетныхЕдиниц.РазмерКТК КАК РазмерКТК,
		               |	ВЫБОР
		               |		КОГДА ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.Контейнер, 0) = 0
		               |			ТОГДА 0
		               |		ИНАЧЕ 1
		               |	КОНЕЦ КАК КолвоКТК,
		               |	ВЫБОР
		               |		КОГДА ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.Вагон, 0) = 0
		               |			ТОГДА 0
		               |		ИНАЧЕ 1
		               |	КОНЕЦ КАК КолвоВаг,
		               |	ВЫБОР
		               |		КОГДА ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.ЖДН, 0) = 0
		               |			ТОГДА 0
		               |		ИНАЧЕ 1
		               |	КОНЕЦ КАК КолвоЖДН
		               |ИЗ
		               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		               |ГДЕ
		               |	(&Вагон ПОДОБНО ""%"" + СделкаСвязьУчетныхЕдиниц.Вагон.Наименование + ""%""
		               |			ИЛИ СделкаСвязьУчетныхЕдиниц.ЖДН В (&ЖДН)
		               |			ИЛИ &Контейнер ПОДОБНО ""%"" + СделкаСвязьУчетныхЕдиниц.Контейнер.Наименование + ""%"")" + УсловиеНаСделку + "";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Вагон",СтрокаПТУ.СписокТС);
	Запрос.УстановитьПараметр("Контейнер",СтрокаПТУ.СписокТЕ);
	Запрос.УстановитьПараметр("ЖДН",СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаПТУ.СписокТД, ","));
	Если НЕ МассивСделок = Неопределено Тогда
		Запрос.УстановитьПараметр("Ссылка",МассивСделок);
	КонецЕсли;
	РЗ = Запрос.Выполнить();
	ТЗСделок = РЗ.Выгрузить();
	
	Возврат ТЗСделок;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТекСтрокуПТУ(ПТУ, НомерСтроки)
	
	ТЗПТУ = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеТоваровУслугУслуги.Ссылка КАК ДокументПТУ,
	               |	ПоступлениеТоваровУслугУслуги.НомерСтроки КАК НомерСтроки,
	               |	ПоступлениеТоваровУслугУслуги.Номенклатура КАК Услуга,
	               |	ПоступлениеТоваровУслугУслуги.Содержание КАК Содержание,
	               |	ПоступлениеТоваровУслугУслуги.Количество КАК Количество,
	               |	ПоступлениеТоваровУслугУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	ПоступлениеТоваровУслугУслуги.Сумма КАК Сумма,
	               |	ПоступлениеТоваровУслугУслуги.СуммаНДС КАК СуммаНДС,
	               |	ПоступлениеТоваровУслугУслуги.Цена КАК Цена,
	               |	ПоступлениеТоваровУслугУслуги.Номенклатура.КатегорияРасходов КАК КатегорияРасходов,
	               |	ПоступлениеТоваровУслугУслуги.Перевыставление КАК Перевыставление,
	               |	ПоступлениеТоваровУслугУслуги.СписокТС КАК СписокТС,
	               |	ПоступлениеТоваровУслугУслуги.СписокТЕ КАК СписокТЕ,
	               |	ПоступлениеТоваровУслугУслуги.СписокТД КАК СписокТД,
	               |	ПоступлениеТоваровУслугУслуги.ГУИДПТУ КАК ГУИДПТУ,
	               |	ПоступлениеТоваровУслугУслуги.Всего КАК Всего,
	               |	ПоступлениеТоваровУслугУслуги.Ссылка.Контрагент КАК Поставщик,
	               |	ПоступлениеТоваровУслугУслуги.Ссылка.ДоговорКонтрагента КАК Договор,
	               |	ПоступлениеТоваровУслугУслуги.Ссылка.СуммаВключаетНДС КАК НДСВключенВСтоимость,
	               |	ПоступлениеТоваровУслугУслуги.Ссылка.ВалютаДокумента КАК Валюта,
	               |	ПоступлениеТоваровУслугУслуги.СтанцияОтправления КАК СтанцияОтправления,
	               |	ПоступлениеТоваровУслугУслуги.СтанцияНазначения КАК СтанцияНазначения
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	               |ГДЕ
	               |	ПоступлениеТоваровУслугУслуги.НомерСтроки = &НомерСтроки
	               |	И ПоступлениеТоваровУслугУслуги.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("НомерСтроки",НомерСтроки);
	Запрос.УстановитьПараметр("Ссылка",ПТУ);
	РЗ = Запрос.Выполнить();
	ТЗПТУ = РЗ.Выгрузить();
	
	Возврат ТЗПТУ;
	
КонецФункции

&НаСервере
Процедура ОтнестиНаЗатраты(СтрокаПТУ,ТЗСделок)
	
	Для Каждого Стр Из СписокСделок Цикл
		ПроцентНДС = 0;
		СуммаНДС = 0;
		СебестоимостьИтого = 0;
		Себестоимость = 0;
		
		СписокТЕ = "";
		СписокТС = "";
		СписокТД = "";
		
		// в таблице на форме ищем сумму разнесения для текущей сделки
		ПараметрыОтбора = Новый Структура;
		Если Перевыставляемые Тогда
			ПараметрыОтбора.Вставить("Клиент",Стр.Клиент);
			ПараметрыОтбора.Вставить("Договор",Стр.Договор);
			ПараметрыОтбора.Вставить("Груз",Стр.Груз);
			ПараметрыОтбора.Вставить("Калькуляция",Стр.Калькуляция);
			ПараметрыОтбора.Вставить("РазмерКТК",Стр.РазмерКТК);
			ПараметрыОтбора.Вставить("Сделка",Стр.Сделка);
		Иначе
			ПараметрыОтбора.Вставить("Сделка",Стр.Сделка);
		КонецЕсли;
		НайденнаяСумма = СписокСделок.НайтиСтроки(ПараметрыОтбора);
		СуммаНаСделку = НайденнаяСумма[0].СуммаНаСделку;
		
		// ищем в исходной таблице (до свертки) номера КТК, вагонов, ЖДН. нужны только те данные,
		// которые есть в сделке, а не все, указанные в ПТУ
		НайденныеСтроки = ТЗСделок.НайтиСтроки(ПараметрыОтбора);
		
		СписокТЕ = СтрокаПТУ.СписокТЕ;
		СписокТС = СтрокаПТУ.СписокТС;
		СписокТД = СтрокаПТУ.СписокТД;
		
		ПолучОб = Стр.Сделка.ПолучитьОбъект();
		
		ГУИДЫПоКТК = Новый Соответствие;
		
		Для каждого КТКСтрока из СтрРазделить(СписокТЕ, ";", Ложь) Цикл
			
			КТКСсылка = РаботаСКонтейнерамиСервер.НайтиКТК(КТКСтрока, Истина);
			
			НайдСтрокиСоставаПоезда = ПолучОб.СвязьУчетныхЕдиниц.НайтиСтроки(Новый Структура("Контейнер", КТКСсылка));
			Если НайдСтрокиСоставаПоезда.Количество() = 0 Тогда
				НСтрока = ПолучОб.СвязьУчетныхЕдиниц.Добавить();
				НСтрока.ГУИД = Строка(Новый УникальныйИдентификатор);
			Иначе
				НСтрока = НайдСтрокиСоставаПоезда[0];
			КонецЕсли;
			
			НСтрока.Контейнер = КТКСсылка;
			
			ГУИДЫПоКТК.Вставить(КТКСсылка, НСтрока.ГУИД);
			
		КонецЦикла;
		
		ПериодБлокировки8 = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Стр.Сделка.Организация);
		
		ПроцентНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СтрокаПТУ.СтавкаНДС);
		Если СтрокаПТУ.НДСВключенВСтоимость Тогда
			СуммаНДС = СуммаНаСделку*ПроцентНДС/(100+ПроцентНДС);
			СебестоимостьИтого = СуммаНаСделку;
			Себестоимость = СебестоимостьИтого/?(СтрокаПТУ.Количество=0,1,СтрокаПТУ.Количество);
		Иначе
			СуммаНДС = СуммаНаСделку*ПроцентНДС/100;
			СебестоимостьИтого = СуммаНаСделку-СуммаНДС;
			Себестоимость = СебестоимостьИтого/?(СтрокаПТУ.Количество=0,1,СтрокаПТУ.Количество);
		КонецЕсли;
		
		Если Перевыставляемые Тогда
			
			// 1. Доходы
			ТЧДоходы = ПолучОб.Доходы.Добавить(); 
			//ДИТ, Беляев СЮ, ТА48688, 28-03-2022, начало 
			ТЧДоходы.ДатаПоявленияСтрокиЭкономики = ТекущаяДата();
			//ДИТ, Беляев СЮ, ТА48688, 28-03-2022, конец
			ЗаполнитьЗначенияСвойств(ТЧДоходы,СтрокаПТУ,,"СуммаНДС, Договор");
			ЗаполнитьЗначенияСвойств(ТЧДоходы,Стр,"Клиент, Договор");
			ГУИДДоходы = Строка(Новый УникальныйИдентификатор);
			ТЧДоходы.ГУИД = ГУИДДоходы;
			
			ТЧДоходы.ПериодВО = ПериодБлокировки8;
			
			ТЧДоходы.СуммаИтого = СуммаНаСделку;
			
			ТЧДоходы.СебестоимостьИтого = СебестоимостьИтого;
			ТЧДоходы.СуммаНДС = СуммаНДС;
			ТЧДоходы.Себестоимость = Себестоимость;
			ТЧДоходы.Ставка = Себестоимость;
			ТЧДоходы.СтавкаИтого = СебестоимостьИтого;
			
			ТЧДоходы.Перевыставляемая = Истина;
			
			// 2. вспомогательные таблицы
			Если ЗначениеЗаполнено(СписокТЕ) Тогда
				ТЧДоходыКТК = ПолучОб.ДоходыКТК.Добавить();
				ТЧДоходыКТК.КТК = СписокТЕ;
				ТЧДоходыКТК.ГУИД = ГУИДДоходы;
			КонецЕсли;
			Если ЗначениеЗаполнено(СписокТС) Тогда
				ТЧДоходыВаг = ПолучОб.ДоходыВагоны.Добавить();
				ТЧДоходыВаг.Вагон = СписокТС;
				ТЧДоходыВаг.ГУИД = ГУИДДоходы;
			КонецЕсли;
			Если ЗначениеЗаполнено(СписокТД) Тогда
				ТЧДоходыЖДН = ПолучОб.ДоходыТД.Добавить();
				ТЧДоходыЖДН.ТД = СписокТД;
				ТЧДоходыЖДН.ГУИД = ГУИДДоходы;
			КонецЕсли;
			
		КонецЕсли;
		
		// 3. ТЧ Расходы создается всегда
		ТЧРасходы = ПолучОб.Расходы.Добавить();
		ГУИДРасходы = Строка(Новый УникальныйИдентификатор);
		ТЧРасходы.ГУИД = ГУИДРасходы;
		ЗаполнитьЗначенияСвойств(ТЧРасходы,СтрокаПТУ,,"СуммаНДС");
		ТЧРасходы.СуммаИтого = СуммаНаСделку;
		ТЧРасходы.СуммаНДС = СуммаНДС;
		ТЧРасходы.Себестоимость = Себестоимость;
		ТЧРасходы.СебестоимостьИтого = СебестоимостьИтого;
		ТЧРасходы.ПериодВО = ПериодБлокировки8;
		ТЧРасходы.УчДокумент = ПТУ;
		ТЧРасходы.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ПроизвольнаяУслугаВручную;
		ТЧРасходы.Регламентный = Истина;
		ТЧРасходы.Комментарий = "Доб. из ПТУ " + Пользователи.ТекущийПользователь() + " " + ТекущаяДата();
		ТЧРасходы.ПунктОтправления = СтрокаПТУ.СтанцияОтправления;
		ТЧРасходы.ПунктНазначения = СтрокаПТУ.СтанцияНазначения;
		
		Если Перевыставляемые Тогда
			ТЧРасходы.Перевыставляемая = Истина;
			
			// создать связь доходы-расходы
			ТЧДоходыРасходы = ПолучОб.СвязьДоходовИРасходов.Добавить();
			ТЧДоходыРасходы.Доходы = ГУИДДоходы;
			ТЧДоходыРасходы.Расходы = ГУИДРасходы;
		Иначе
			ТЧРасходы.Перевыставляемая = Ложь;
		КонецЕсли;
		// 2. вспомогательные таблицы
		Если ЗначениеЗаполнено(СписокТЕ) Тогда
			ТЧДоходыКТК = ПолучОб.ДоходыКТК.Добавить();
			ТЧДоходыКТК.КТК = СписокТЕ;
			ТЧДоходыКТК.ГУИД = ГУИДРасходы
		КонецЕсли;
		Если ЗначениеЗаполнено(СписокТС) Тогда
			ТЧДоходыВаг = ПолучОб.ДоходыВагоны.Добавить();
			ТЧДоходыВаг.Вагон = СписокТС;
			ТЧДоходыВаг.ГУИД = ГУИДРасходы
		КонецЕсли;
		Если ЗначениеЗаполнено(СписокТД) Тогда
			ТЧДоходыЖДН = ПолучОб.ДоходыТД.Добавить();
			ТЧДоходыЖДН.ТД = СписокТД;
			ТЧДоходыЖДН.ГУИД = ГУИДРасходы
		КонецЕсли;
		
		ПолучОб.Записать();
				
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазнестиРасходы(Команда)
	
	РазнестиРасходыСервер();
	
КонецПроцедуры

&НаСервере
Процедура РазнестиРасходыСервер();
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Отметка",Истина);
	НайденныеСтроки = СписокСделок.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() = 0 Тогда
		Сообщить("Не выбрано ни одной сделки!");
		Возврат;
	КонецЕсли;
	МассивСделок = Новый Массив;
	Для Каждого Стр Из НайденныеСтроки Цикл
		МассивСделок.Добавить(Стр.Сделка);
	КонецЦикла;
	
	СтрокаПТУ = ПолучитьТекСтрокуПТУ(ПТУ, НомерСтрокиЪ)[0];
	ТЗСделок = ПолучитьДоступныеСделки(СтрокаПТУ,МассивСделок,Перевыставляемые);
	ОтнестиНаЗатраты(СтрокаПТУ,ТЗСделок);
	
КонецПроцедуры

