#Область ОбработчикиСобытийФормы
// ДИТ US 51148 TA 64324 Евсенкин М.А. Начало: 23.01.2023
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	ОтобразитьНаФормеАктуальныеПериоды();
КонецПроцедуры                                           
// ДИТ US 51148 TA 64324 Евсенкин М.А. Конец: 23.01.2023
#КонецОбласти

#Область ОбработчикиСобытийФормы  
// ДИТ US 51148 TA 64324 Евсенкин М.А. Начало: 23.01.2023
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры 
// ДИТ US 51148 TA 64324 Евсенкин М.А. Конец: 23.01.2023

// ДИТ US 51148 TA 64324 Евсенкин М.А. Начало: 23.01.2023
&НаКлиенте
Процедура ДобавитьРазрешение(Команда)
	
	Отказ = Ложь;
	Ошибки = Неопределено;  
	Если ПериодРедактирования.ДатаНачала < НачалоМесяца(ПериодВО) Тогда 
		Ошибки = Неопределено;
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,"ПериодРедактирования",СтрШаблон("Период редактирования не может быть меньше периода ВО %1",Формат(ПериодВО,"ДФ='ММММ гггг'")));
	КонецЕсли; 
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки,Отказ);
	Если Не Отказ Тогда 
		Если Не ЗначениеЗаполнено(ПериодРедактирования) Тогда 
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,"ПериодРедактирования","Период редактирования не заполнен","Период",,"Период редактирования не заполнен!");
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ПериодПереноса) Тогда 
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,"ПериодПереноса","Период переноса не заполнен","Период",,"Период переноса не заполнен!"); 
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки,Отказ);
	КонецЕсли;
	
	Если Не Отказ Тогда 
		Если ПериодыУстановлены Тогда 
			Ф = "ДФ=dd.MM.yyyy";
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",ЭтаФорма);
			ТекстВопроса = СтрШаблон("Текущее разрешение переноса ИСФ из периода
									|%1 - %2 в период %3 - %4. 
									|Изменить на перенос из периода 
									|%5 - %6  в период %7 - %8?",
			Формат(ДатаНачалаПериодаРазрешенияРедактирования,Ф),
			Формат(ДатаОкончанияПериодаРазрешенияРедактирования,Ф),
			Формат(ДатаНачалаРазрешенногоПериодаПереноса,Ф),
			Формат(ДатаОкончанияРазрешенногоПериодаПереноса,Ф),
			Формат(ПериодРедактирования.ДатаНачала,Ф),
			Формат(ПериодРедактирования.ДатаОкончания,Ф), 
			Формат(ПериодПереноса.ДатаНачала,Ф),
			Формат(ПериодПереноса.ДатаОкончания,Ф));
			
			ПоказатьВопрос(ОписаниеОповещения,ТекстВопроса,РежимДиалогаВопрос.ДаНет,60,КодВозвратаДиалога.Нет,,КодВозвратаДиалога.Нет);
		Иначе 
			ДобавитьРазрешениеНаСервере();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
// ДИТ US 51148 TA 64324 Евсенкин М.А. Конец: 23.01.2023

// ДИТ US 51148 TA 64324 Евсенкин М.А. Начало: 23.01.2023
&НаКлиенте
Процедура ПослеЗакрытияВопроса(Ответ, ДополнительныеПараметры) Экспорт 
	Если Ответ = КодВозвратаДиалога.Да Тогда 
		ДобавитьРазрешениеНаСервере();	
	КонецЕсли;	
КонецПроцедуры
// ДИТ US 51148 TA 64324 Евсенкин М.А. Конец: 23.01.2023

// ДИТ US 51148 TA 64324 Евсенкин М.А. Начало: 23.01.2023
&НаКлиенте
Процедура УдалитьРазрешение(Команда)
	УдалитьРазрешениеНаСервере();
КонецПроцедуры
// ДИТ US 51148 TA 64324 Евсенкин М.А. Конец: 23.01.2023

// ДИТ US 51148 TA 64324 Евсенкин М.А. Начало: 23.01.2023
&НаКлиенте
Процедура ПериодРедактированияПриИзменении(Элемент) 
	Если ПериодРедактирования.ДатаНачала < НачалоМесяца(ПериодВО) Тогда 
		Ошибки = Неопределено;
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,"ПериодРедактирования",СтрШаблон("Период редактирования не может быть меньше периода ВО %1",Формат(ПериодВО,"ДФ='ММММ гггг'")));
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
	КонецЕсли;
КонецПроцедуры
// ДИТ US 51148 TA 64324 Евсенкин М.А. Конец: 23.01.2023
#КонецОбласти

#Область ОбработчикиКомандФормы
// ДИТ US 51148 TA 64324 Евсенкин М.А. Начало: 23.01.2023
&НаСервере
Процедура ДобавитьРазрешениеНаСервере() 
	
	СтруктураПараметров = РегистрыСведений.РазрешенныйПериодРедактирования.ПолучитьСтруктуруПараметров();
	
	СтруктураПараметров.ДатаНачалаПериодаРазрешенияРедактирования 		= ПериодРедактирования.ДатаНачала;
	СтруктураПараметров.ДатаОкончанияПериодаРазрешенияРедактирования 	= ПериодРедактирования.ДатаОкончания;
	СтруктураПараметров.ДатаНачалаРазрешенногоПериодаПереноса 			= ПериодПереноса.ДатаНачала;
	СтруктураПараметров.ДатаОкончанияРазрешенногоПериодаПереноса 		= ПериодПереноса.ДатаОкончания;
	
	РегистрыСведений.РазрешенныйПериодРедактирования.ДобавитьРазрешение(СтруктураПараметров);	
	
	ОтобразитьНаФормеАктуальныеПериоды();
	
КонецПроцедуры
// ДИТ US 51148 TA 64324 Евсенкин М.А. Конец: 23.01.2023

// ДИТ US 51148 TA 64324 Евсенкин М.А. Начало: 23.01.2023
&НаСервере
Процедура УдалитьРазрешениеНаСервере()
	РегистрыСведений.РазрешенныйПериодРедактирования.УдалитьРазрешение();
	ОтобразитьНаФормеАктуальныеПериоды();	
КонецПроцедуры
// ДИТ US 51148 TA 64324 Евсенкин М.А. Конец: 23.01.2023
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
// ДИТ US 51148 TA 64324 Евсенкин М.А. Начало: 23.01.2023
&НаСервере
Процедура ОтобразитьНаФормеАктуальныеПериоды()
	
	//Евросиб Каблов 09.04.2025 ( #105407
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ДОБАВИТЬКДАТЕ(ЗакрытыеПериодыСрезПоследних.Период, МЕСЯЦ, 1) КАК Период
	//	|ИЗ
	//	|	РегистрСведений.ЗакрытыеПериоды.СрезПоследних КАК ЗакрытыеПериодыСрезПоследних";
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	//	ПериодВО = ВыборкаДетальныеЗаписи.Период;
	//	Элементы.ДекорацияПериодВОЗначение.Заголовок = Формат(ВыборкаДетальныеЗаписи.Период,"ДФ='ММММ гггг'");
	//КонецЕсли;
	ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(Константы.ОсновнаяОрганизация.Получить());
	Элементы.ДекорацияПериодВОЗначение.Заголовок = Формат(ПериодВО,"ДФ='ММММ гггг'");
	//Евросиб Каблов 09.04.2025 )

	СтруктураПараметров = РегистрыСведений.РазрешенныйПериодРедактирования.ПолучитьАктуальныйПериодРедактирования(); 
	Для Каждого Стр Из СтруктураПараметров Цикл 
		ЭтаФорма[Стр.Ключ] = Стр.Значение;
	КонецЦикла;	
	ТекстЗаголовкаПериодРедактирования 	= "Не задан.";
	ТекстЗаголовкаПериодПереноса		= "Не задан.";
	Если СтруктураПараметров.ПериодыУстановлены Тогда 
		ТекстЗаголовкаПериодРедактирования 	= СтрШаблон("с: %1 по: %2.",Формат(СтруктураПараметров.ДатаНачалаПериодаРазрешенияРедактирования,"ДФ=dd.MM.yyyy"),Формат(СтруктураПараметров.ДатаОкончанияПериодаРазрешенияРедактирования,"ДФ=dd.MM.yyyy")); 
		ТекстЗаголовкаПериодПереноса 		= СтрШаблон("с: %1 по: %2.",Формат(СтруктураПараметров.ДатаНачалаРазрешенногоПериодаПереноса,"ДФ=dd.MM.yyyy"),Формат(СтруктураПараметров.ДатаОкончанияРазрешенногоПериодаПереноса,"ДФ=dd.MM.yyyy"));
	КонецЕсли;  
	Элементы.ПериодРедактированияЗначение.Заголовок 	= ТекстЗаголовкаПериодРедактирования;
	Элементы.ПериодПереносаЗначение.Заголовок 			= ТекстЗаголовкаПериодПереноса;
	
КонецПроцедуры
// ДИТ US 51148 TA 64324 Евсенкин М.А. Конец: 23.01.2023
#КонецОбласти
