Процедура КонтейнерыВСтоках_ДобавитьПриход(НаборДвижений, НомерКТК, Сток, Назначение, Контрагент, ДатаПриемаВПользованиеПередПоставщиком, СрокВозврата) Экспорт
	
	Если НЕ ЗначениеЗаполнено(НомерКТК) ИЛИ НЕ ЗначениеЗаполнено(Контрагент) Тогда Возврат; КонецЕсли;
	
	СторнироватьПредыдущееМестоположение(НаборДвижений, НомерКТК, ДатаПриемаВПользованиеПередПоставщиком);
	
	Движение = НаборДвижений.КонтейнерыВСтоках.ДобавитьПриход();
	Движение.Контейнер = НомерКТК;
	Движение.Сток = Сток;
	Движение.Назначение = Назначение;
	Движение.Контрагент = Контрагент;
	Движение.ДатаПриемаВСток = ДатаПриемаВПользованиеПередПоставщиком;
	Движение.СрокВозврата = СрокВозврата;
	Движение.Количество = 1;
	Движение.Период = ДатаПриемаВПользованиеПередПоставщиком;
	
	Движение = НаборДвижений.СтатусыКТК.Добавить();
	Движение.Период = ДатаПриемаВПользованиеПередПоставщиком;
	Движение.Контейнер = НомерКТК;
	Движение.Количество = 1;
	Движение.Сток = Сток;
	Движение.Направление = Назначение;
	Движение.Контрагент = Контрагент;
	Движение.Статус = Перечисления.СтатусыКТК.Свободен;
	
КонецПроцедуры

Процедура КонтейнерыВСтоках_СнятьСУчета(НаборДвижений, НомерКТК, ДатаСнятияСУчета) Экспорт
	
	Если НЕ ЗначениеЗаполнено(НомерКТК) ИЛИ НЕ ЗначениеЗаполнено(ДатаСнятияСУчета) Тогда Возврат; КонецЕсли;
	
	СторнироватьПредыдущееМестоположение(НаборДвижений, НомерКТК, ДатаСнятияСУчета+1);
	
	СоответствиеПараметры = Новый Соответствие;
	СоответствиеПараметры.Вставить("ВозвратВСток", ДатаСнятияСУчета);
	СоответствиеПараметры.Вставить("ВозвратОтКлиента", ДатаСнятияСУчета);
	УправлениеКТКВСтокахСервер.ДобавитьЗаписьИспользованияКонтейнера(ДатаСнятияСУчета, НомерКТК, СоответствиеПараметры, Ложь);
	
КонецПроцедуры

Процедура СторнироватьПредыдущееМестоположение(НаборДвижений, НомерКТК, ДатаПриемаВПользованиеПередПоставщиком)
	
	Ответ = ПолучитьПредыдущиеДанныеСтока(НомерКТК, ДатаПриемаВПользованиеПередПоставщиком-1);
	
	Если Ответ.Количество() > 0 Тогда
		Движение = НаборДвижений.КонтейнерыВСтоках.ДобавитьРасход();
		ЗаполнитьЗначенияСвойств(Движение, Ответ[0]);
		Движение.Период = ДатаПриемаВПользованиеПередПоставщиком-1;
		Движение.Количество = Ответ[0].КоличествоОстаток;
	КонецЕсли;
	
	Для каждого Стр из НаборДвижений.КонтейнерыВСтоках Цикл
		Если Стр.Контейнер = НомерКТК И Стр.ВидДвижения = ВидДвиженияНакопления.Приход Тогда 
			
			Движение = НаборДвижений.КонтейнерыВСтоках.ДобавитьРасход();
			ЗаполнитьЗначенияСвойств(Движение, Стр);
			Движение.Период = ДатаПриемаВПользованиеПередПоставщиком;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьЗаписьИспользованияКонтейнера(ПериодЗаписи, Контейнер, СтруктураИзменяемыхРеквизитов, Удалить = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	*
	               |ИЗ
	               |	РегистрСведений.СрокиИспользованияКонтейнеров.СрезПоследних(&Период, Контейнер = &Контейнер) КАК СрокиИспользованияКонтейнеровСрезПоследних";
	Запрос.УстановитьПараметр("Период", ПериодЗаписи);
	Запрос.УстановитьПараметр("Контейнер", Контейнер);
	Ответ = запрос.Выполнить().Выбрать();
	
	МЗ = РегистрыСведений.СрокиИспользованияКонтейнеров.СоздатьМенеджерЗаписи();
	
	Если Ответ.Следующий() И ПериодЗаписи = Ответ.Период Тогда
		ЗаполнитьЗначенияСвойств(МЗ, Ответ);
		Если Удалить Тогда
			МЗ.Удалить();
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	МЗ.Период = ПериодЗаписи;
	МЗ.Контейнер = Контейнер;
	Для каждого стр из СтруктураИзменяемыхРеквизитов Цикл
		МЗ[стр.Ключ] = стр.Значение;
	КонецЦикла;
	МЗ.Записать();
	
КонецПроцедуры

Процедура ОтметитьВДокументеСтокКТКДатуСдачиКТК(КТК, ДатаСдачи) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СтокКонтейнеровКонтейнеры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.СтокКонтейнеров.Контейнеры КАК СтокКонтейнеровКонтейнеры
	               |ГДЕ
	               |	СтокКонтейнеровКонтейнеры.Ссылка.Проведен
	               |	И СтокКонтейнеровКонтейнеры.Контейнер = &Контейнер
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СтокКонтейнеровКонтейнеры.Ссылка.Дата УБЫВ";
	Запрос.УстановитьПараметр("Контейнер", КТК);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() ТОгда
		
		СтокОбъект = Ответ.Ссылка.ПолучитьОбъект();
		НайдСтрока = СтокОбъект.Контейнеры.НайтиСтроки(Новый Структура("Контейнер", КТК))[0];
		
		Если НЕ ЗначениеЗаполнено(НайдСтрока.ДатаСдачиКТКПоставщику) Тогда НайдСтрока.ДатаСдачиКТКПоставщику = ДатаСдачи; СтокОбъект.Записать(); КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//////////////////////////////
// Дальше начинается новый механизм. Старый когда-нибудь удалим
// 

Функция ПолучитьПредыдущиеДанныеСтока(НомерКТК, ДатаПолучения) Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтейнерыВСтокахОстатки.Контейнер КАК Контейнер,
	               |	КонтейнерыВСтокахОстатки.Сток КАК Сток,
	               |	КонтейнерыВСтокахОстатки.Назначение КАК Назначение,
	               |	КонтейнерыВСтокахОстатки.Контрагент КАК Контрагент,
	               |	КонтейнерыВСтокахОстатки.ДатаПриемаВСток КАК ДатаПриемаВСток,
	               |	КонтейнерыВСтокахОстатки.СрокВозврата КАК СрокВозврата,
	               |	КонтейнерыВСтокахОстатки.КоличествоОстаток КАК КоличествоОстаток,
	               |	ПризнакСобственностиКонтейнераСрезПоследних.ПризнакСобственности КАК ПризнакСобственности,
	               |	ПризнакСобственностиКонтейнераСрезПоследних.ВладелецКТК КАК ВладелецКТК
	               |ИЗ
	               |	РегистрНакопления.КонтейнерыВСтоках.Остатки(, Контейнер = &Контейнер) КАК КонтейнерыВСтокахОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПризнакСобственностиКонтейнера.СрезПоследних КАК ПризнакСобственностиКонтейнераСрезПоследних
	               |		ПО КонтейнерыВСтокахОстатки.Контейнер = ПризнакСобственностиКонтейнераСрезПоследних.Контейнер";
	Запрос.УстановитьПараметр("ПериодПроверки", ДатаПолучения);
	Запрос.УстановитьПараметр("Контейнер", НомерКТК);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		СледующийСток = неопределено;
		ИнструкцииПоСдачеПорожнего = "";
		
		
		ЗапросИзДокумента = Новый Запрос;
		ЗапросИзДокумента.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		                          |	СтокКонтейнеровКонтейнеры.Контейнер КАК Контейнер,
		                          |	СтокКонтейнеровКонтейнеры.СледующийСток КАК СледующийСток,
		                          |	СтокКонтейнеровКонтейнеры.ИнструкцииПоСдачеПорожнего КАК ИнструкцииПоСдачеПорожнего
		                          |ИЗ
		                          |	Документ.СтокКонтейнеров.Контейнеры КАК СтокКонтейнеровКонтейнеры
		                          |ГДЕ
		                          |	СтокКонтейнеровКонтейнеры.Контейнер = &Контейнер
		                          |	И СтокКонтейнеровКонтейнеры.Ссылка.Сток = &Сток
		                          |
		                          |УПОРЯДОЧИТЬ ПО
		                          |	СтокКонтейнеровКонтейнеры.Ссылка.Дата УБЫВ";
		ЗапросИзДокумента.УстановитьПараметр("Контейнер", Ответ.Контейнер);
		ЗапросИзДокумента.УстановитьПараметр("Сток", Ответ.Сток);
		ОтветИзДокумента = ЗапросИзДокумента.Выполнить().Выбрать();
		Если ОтветИзДокумента.Следующий() Тогда
			СледующийСток 				= ОтветИзДокумента.СледующийСток;
			ИнструкцииПоСдачеПорожнего 	= ОтветИзДокумента.ИнструкцииПоСдачеПорожнего;
		КонецЕсли;
		
		Результат.Добавить(Новый Структура("Контейнер,Сток,Назначение,Контрагент,ДатаПриемаВСток,СрокВозврата,КоличествоОстаток,СледующийСток,ИнструкцииПоСдачеПорожнего,ПризнакСобственностиЪ,ВладелецКТКЪ", Ответ.Контейнер,Ответ.Сток,Ответ.Назначение,?(ЗначениеЗаполнено(Ответ.Контрагент), Ответ.Контрагент, Ответ.ВладелецКТК),Ответ.ДатаПриемаВСток,Ответ.СрокВозврата,Ответ.КоличествоОстаток,СледующийСток,ИнструкцииПоСдачеПорожнего,Ответ.ПризнакСобственности,Ответ.ВладелецКТК));
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ОбновитьСтатусПросрочкиРелизов() Экспорт
	
	Запрос = Новый Запрос;
	//++ Зубов US 33131 TA 38910 26.10.2021
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	Релиз.Ссылка КАК Ссылка
	//               |ИЗ
	//               |	Документ.Релиз КАК Релиз
	//               |ГДЕ
	//               |	НЕ Релиз.ПометкаУдаления
	//               |	И Релиз.Активность = &Активность_Активен
	//               |	И Релиз.ОкончаниеДействия < &ТекущаяДата";
	Запрос.Текст = "ВЫБРАТЬ
	               |	Релиз.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.РелизСобственника КАК Релиз
	               |ГДЕ
	               |	НЕ Релиз.ПометкаУдаления
	               |	И Релиз.Активность = &Активность_Активен
	               |	И Релиз.ОкончаниеДействия < &ТекущаяДата";
	//-- Зубов US 33131 TA 38910 26.10.2021
	Запрос.УстановитьПараметр("Активность_Активен", Перечисления.СтатусАктивностиРелиза.Активен);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		РОбъект = Ответ.Ссылка.ПолучитьОбъект();
		РОбъект.Записать();
	КонецЦикла;
	
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	ПроверитьРелизыКлиентов();
	ПроверитьКТКСПредварительнымРезервом();
	// Евросиб Фролов)
	
КонецПроцедуры

Функция ПолучитьМультилокацию(ОписаниеМультилокации) Экспорт
	
	Результат = неопределено;
	
	Если ЗначениеЗаполнено(ОписаниеМультилокации) Тогда
		
		МассивЛокаций = Новый Массив;
		СтрМ = СтрРазделить(ОписаниеМультилокации, ";", Ложь);
		//++ Зубов 39480 29.09.2021
		//НЭлемент = справочники.Мультилокации.СоздатьЭлемент();
		Локации = Новый СписокЗначений;
		Для каждого Стр из СтрМ Цикл
			
			НайдЛ = Локации_сервер.ПолучитьЛокациюПоНечеткомуПоиску(СокрЛП(Стр), Истина);
		//	Если ЗначениеЗаполнено(НайдЛ) Тогда НЭлемент.Локации.Добавить().Локация = НайдЛ; КонецЕсли;
			Если ЗначениеЗаполнено(НайдЛ) Тогда Локации.Добавить(НайдЛ); КонецЕсли;
		//	
		КонецЦикла;
		//
		//Если НЭлемент.Локации.Количество() > 0 Тогда
		//	
		//	НЭлемент.Записать();
		//	Результат = НЭлемент.Ссылка;
		//	
		//КонецЕсли;
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Мультилокации.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Мультилокации КАК Мультилокации
			|ГДЕ
			|	НЕ Мультилокации.ПометкаУдаления
			|	И Мультилокации.Локации.Локация В(&ЛокацияСписок)
			|
			|УПОРЯДОЧИТЬ ПО
			|	Мультилокации.Код";
		
		Запрос.УстановитьПараметр("ЛокацияСписок", Локации);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Результат = Неопределено;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если Локации.Количество() = ВыборкаДетальныеЗаписи.Ссылка.Локации.Количество() Тогда
				НайденныеЛокации = 0;
				Для каждого Лок из Локации Цикл
					Если НЕ ВыборкаДетальныеЗаписи.Ссылка.Локации.Найти(Лок.Значение)=Неопределено Тогда
						НайденныеЛокации = НайденныеЛокации+1;
					Иначе
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если НайденныеЛокации = Локации.Количество() Тогда
					Результат = ВыборкаДетальныеЗаписи.Ссылка;
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

		Если Результат = Неопределено Тогда
			Результат = Справочники.Мультилокации.СоздатьЭлемент();
			Для каждого Лок из Локации Цикл
				СтрокаРезультата = Результат.Локации.Добавить();
				СтрокаРезультата.Локация = Лок.Значение;
			КонецЦикла;
			Результат.Записать();
		КонецЕсли;
			//-- Зубов 39480 29.09.2021
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеКТКизАРМКТК(НомерКТК) Экспорт
	
	Результат = Новый Структура("кл_ЗаявкаНаВыдачу,допл_Клиент,допл_Договор,допл_Калькуляция,допл_ПСЦ,комм_Ставка,комм_Валюта,кл_ДатаВозврата,тек_СобственностьКТК,тек_СрокВозврата,кл_ДатаВыдачи,тек_РелизНомерДокумента,кл_СрокПользования,КТК,тек_ВидСобственности,тек_Собственник,тек_Сток,тек_СтокСдачи,тек_ИнструкцияПоСдаче,тек_ДатаВзятияИзСтока,тек_ДатаПриемаВПользование,тек_Релиз,кл_НомерТСЗабор,кл_ВодительЗабор");
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//Результат = Новый Структура("кл_ЗаявкаНаВыдачу,допл_Клиент,допл_Договор,допл_Калькуляция,допл_ПСЦ,комм_Ставка,комм_Валюта,кл_ДатаВозврата,тек_СобственностьКТК,тек_СрокВозврата,кл_ДатаВыдачи,тек_РелизНомерДокумента,кл_СрокПользования,КТК,тек_ВидСобственности,тек_Собственник,тек_Сток,тек_СтокСдачи,тек_ИнструкцияПоСдаче,тек_ДатаВзятияИзСтока,тек_ДатаПриемаВПользование,тек_Релиз,кл_НомерТСЗабор,кл_ВодительЗабор");
	//ок)
	Результат = Новый Структура("кл_ЗаявкаНаВыдачу,допл_Клиент,допл_Договор,допл_Калькуляция,допл_ПСЦ,комм_Ставка,комм_Валюта,кл_ДатаВозврата,Удалитьтек_СобственностьКТК,тек_ПринадлежностьТЕ,тек_СрокВозврата,кл_ДатаВыдачи,тек_РелизНомерДокумента,кл_СрокПользования,КТК,тек_ВидСобственности,тек_Собственник,тек_Сток,тек_СтокСдачи,тек_ИнструкцияПоСдаче,тек_ДатаВзятияИзСтока,тек_ДатаПриемаВПользование,тек_Релиз,кл_НомерТСЗабор,кл_ВодительЗабор");
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЕ.Ссылка КАК КТК,
	               |	стоки_ТекущиеДанныеСрезПоследних.тек_ВидСобственности КАК тек_ВидСобственности,
	               |	стоки_ТекущиеДанныеСрезПоследних.тек_Собственник КАК тек_Собственник,
	               |	стоки_ТекущиеДанныеСрезПоследних.тек_Сток КАК тек_Сток,
	               |	стоки_ТекущиеДанныеСрезПоследних.тек_СтокСдачи КАК тек_СтокСдачи,
	               |	стоки_ТекущиеДанныеСрезПоследних.тек_ИнструкцияПоСдаче КАК тек_ИнструкцияПоСдаче,
	               |	стоки_ТекущиеДанныеСрезПоследних.тек_ДатаВзятияИзСтока КАК тек_ДатаВзятияИзСтока,
	               |	стоки_ТекущиеДанныеСрезПоследних.тек_ДатаПриемаВПользование КАК тек_ДатаПриемаВПользование,
	               |	стоки_ТекущиеДанныеСрезПоследних.тек_Релиз КАК тек_Релиз,
	               |	стоки_КлиентскоеОперированиеСрезПоследних.кл_НомерТСЗабор КАК кл_НомерТСЗабор,
	               |	стоки_КлиентскоеОперированиеСрезПоследних.кл_ВодительЗабор КАК кл_ВодительЗабор,
	               |	стоки_КлиентскоеОперированиеСрезПоследних.кл_ДатаВыдачи КАК кл_ДатаВыдачи,
	               |	стоки_КлиентскоеОперированиеСрезПоследних.кл_СрокПользования КАК кл_СрокПользования,
	               |	стоки_ТекущиеДанныеСрезПоследних.тек_Релиз.НомерДокумента КАК тек_РелизНомерДокумента,
	               |	стоки_ТекущиеДанныеСрезПоследних.тек_СрокВозврата КАК тек_СрокВозврата,
	               // ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	               //ок(
	               //|	стоки_ТекущиеДанныеСрезПоследних.тек_СобственностьКТК КАК тек_СобственностьКТК,
	               //ок)
	               |	стоки_ТекущиеДанныеСрезПоследних.Удалитьтек_СобственностьКТК КАК Удалитьтек_СобственностьКТК,
	               |	стоки_ТекущиеДанныеСрезПоследних.тек_ПринадлежностьТЕ КАК тек_ПринадлежностьТЕ,
	               // ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	               |	стоки_КлиентскоеОперированиеСрезПоследних.кл_ДатаВозврата КАК кл_ДатаВозврата,
	               |	стоки_ТекущиеДанныеСрезПоследних.комм_Ставка КАК комм_Ставка,
	               |	стоки_ТекущиеДанныеСрезПоследних.комм_Валюта КАК комм_Валюта,
	               |	стоки_КлиентскоеОперированиеСрезПоследних.допл_Клиент КАК допл_Клиент,
	               |	стоки_КлиентскоеОперированиеСрезПоследних.допл_Договор КАК допл_Договор,
	               |	стоки_КлиентскоеОперированиеСрезПоследних.допл_Калькуляция КАК допл_Калькуляция,
	               |	стоки_КлиентскоеОперированиеСрезПоследних.допл_ПСЦ КАК допл_ПСЦ,
	               |	стоки_КлиентскоеОперированиеСрезПоследних.кл_ЗаявкаНаВыдачу КАК кл_ЗаявкаНаВыдачу
	               |ИЗ
	               |	Справочник.ТЕ КАК ТЕ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные.СрезПоследних КАК стоки_ТекущиеДанныеСрезПоследних
	               |		ПО ТЕ.Ссылка = стоки_ТекущиеДанныеСрезПоследних.КТК
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.стоки_КлиентскоеОперирование.СрезПоследних КАК стоки_КлиентскоеОперированиеСрезПоследних
	               |		ПО ТЕ.Ссылка = стоки_КлиентскоеОперированиеСрезПоследних.КТК
	               |ГДЕ
	               |	ТЕ.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", НомерКТК);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Ответ);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТекущиеПараметрыСНП(КТК) Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	стоки_ТекущиеДанные_СНП.ГУИДЗаписи КАК ГУИДЗаписи
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	РегистрСведений.стоки_КлиентскоеОперирование КАК стоки_КлиентскоеОперирование
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные_СНП КАК стоки_ТекущиеДанные_СНП
	               |		ПО стоки_КлиентскоеОперирование.ГУИДЗаписи = стоки_ТекущиеДанные_СНП.ГУИДЗаписи
	               |ГДЕ
	               |	стоки_КлиентскоеОперирование.КТК = &КТК
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	стоки_КлиентскоеОперирование.Период УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	стоки_ТекущиеДанные_СНП.ГУИДЗаписи КАК ГУИДЗаписи,
	               |	стоки_ТекущиеДанные_СНП.От КАК От,
	               |	стоки_ТекущиеДанные_СНП.До КАК До,
	               |	стоки_ТекущиеДанные_СНП.Сумма КАК Сумма
	               |ИЗ
	               |	РегистрСведений.стоки_ТекущиеДанные_СНП КАК стоки_ТекущиеДанные_СНП
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	               |		ПО стоки_ТекущиеДанные_СНП.ГУИДЗаписи = ВТ.ГУИДЗаписи
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	От";
	Запрос.УстановитьПараметр("КТК", КТК);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		Результат.Добавить(Новый Структура("От, До, Стоимость", Ответ.От, Ответ.До, Ответ.Сумма));
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
Процедура ПроверитьРелизыКлиентов()   
	
	// Рег. задание выбирает релизы, у которых:
	// - имеется установленная галка "Номерная выдача" 
	// - текущая дата больше конечной даты из поля "Период действия релиза" на 5 суток
	// В отобранном списке релизов необходимо по контейнерам у которых пустое поле "Дата взятия"
	// устанавливать статус "Свободен" в АРМ КТК.	
	
	
	#Область СтарыйЗапрос
	//ТекстЗапроса =
	//"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	РелизКлиентаКонтейнеры.Контейнер КАК КТК
	//|ИЗ
	//|	Документ.РелизКлиента.Контейнеры КАК РелизКлиентаКонтейнеры
	//// ++ ДИТ_Агафонов_task 56709 11.09.2022
	//|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные.СрезПоследних КАК стоки_ТекущиеДанныеСрезПоследних
	//|	ПО РелизКлиентаКонтейнеры.Контейнер = стоки_ТекущиеДанныеСрезПоследних.КТК
	//// -- ДИТ_Агафонов_task 56709 11.09.2022
	//|ГДЕ
	//|	РелизКлиентаКонтейнеры.Ссылка.НомернаяВыдача
	//|	И РелизКлиентаКонтейнеры.Ссылка.Проведен
	//// Евросиб Фролов (23.03.2022 Ticket №0265008
	//// Текущая дата больше конечной даты из поля "Период действия релиза" не на 5, а на 1 сутки.
	////|	И НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -5), ДЕНЬ) >= РелизКлиентаКонтейнеры.Ссылка.ДействиеРелизаОкончание
	//|	И НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -1), ДЕНЬ) >= РелизКлиентаКонтейнеры.Ссылка.ДействиеРелизаОкончание
	//// Евросиб Фролов)
	//// ++ ДИТ_Агафонов_task 56709 11.09.2022
	//|	И стоки_ТекущиеДанныеСрезПоследних.тек_Статус В (Значение(Перечисление.СтатусыКТК.Зарезервирован),Значение(Перечисление.СтатусыКТК.ПредварительныйРезерв))
	//// -- ДИТ_Агафонов_task 56709 11.09.2022
	//|	И РелизКлиентаКонтейнеры.ДатаВывоза = ДАТАВРЕМЯ(1, 1, 1)";
	#КонецОбласти
	
	 ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РелизКлиентаКонтейнеры.КлючАналитикиПеревозки.Контейнер КАК КТК
	|ИЗ
	|	Документ.РелизКлиента.Контейнеры КАК РелизКлиентаКонтейнеры
    // ++ ДИТ_Агафонов_task 56709 11.09.2022
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные.СрезПоследних КАК стоки_ТекущиеДанныеСрезПоследних
	|	ПО РелизКлиентаКонтейнеры.КлючАналитикиПеревозки.Контейнер = стоки_ТекущиеДанныеСрезПоследних.КТК
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозки 
	|		ПО КлючиАналитикиПеревозки.Ссылка = РелизКлиентаКонтейнеры.КлючАналитикиПеревозки
	|			И КлючиАналитикиПеревозки.ЭтапПеревозки = Значение(Перечисление.ЭтапыПеревозки.ПерваяМиля)
	// -- ДИТ_Агафонов_task 56709 11.09.2022
	|ГДЕ
	|	РелизКлиентаКонтейнеры.Ссылка.НомернаяВыдача
	|	И РелизКлиентаКонтейнеры.Ссылка.Проведен
	// Евросиб Фролов (23.03.2022 Ticket №0265008
	// Текущая дата больше конечной даты из поля "Период действия релиза" не на 5, а на 1 сутки.
	//|	И НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -5), ДЕНЬ) >= РелизКлиентаКонтейнеры.Ссылка.ДействиеРелизаОкончание
    |	И НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -1), ДЕНЬ) >= РелизКлиентаКонтейнеры.Ссылка.ДействиеРелизаОкончание
	// Евросиб Фролов)
	// ++ ДИТ_Агафонов_task 56709 11.09.2022
	|	И стоки_ТекущиеДанныеСрезПоследних.тек_Статус В (Значение(Перечисление.СтатусыКТК.Зарезервирован),Значение(Перечисление.СтатусыКТК.ПредварительныйРезерв))
	// -- ДИТ_Агафонов_task 56709 11.09.2022
	|	И ЕстьNULL(КлючиАналитикиПеревозки.ДатаВыдачиКТКСТерминала,ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|	И РелизКлиентаКонтейнеры.КлючАналитикиПеревозки.Контейнер <> Значение(Справочник.КлючиАналитикиПеревозки.ПустаяСсылка)";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МассивИзмЗначений = Новый Соответствие;
		МассивИзмЗначений.Вставить("тек_Статус", Перечисления.СтатусыКТК.Свободен);
		МассивИзмЗначений.Вставить("ИсточникЗаписи", "Добавлено рег. заданием " + ТекущаяДата());
		
		РегистрыСведений.стоки_ТекущиеДанные.ДобавитьЗапись(Выборка.КТК, МассивИзмЗначений);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьКТКСПредварительнымРезервом()
	
	Если НЕ РаботаСПочтовымиСообщениями.ПроверитьСистемнаяУчетнаяЗаписьДоступна() Тогда 
		ЗаписьЖурналаРегистрации("Ошибка отправки писем об ожидании резервирования КТК", УровеньЖурналаРегистрации.Ошибка,,,"Недоступна системная учетная запись");
		Возврат; 
	КонецЕсли;
	
	// Для КТК, у которых в текущих данных установлен статус "Предварительный резерв" и "В эксплуатации",
	// и с момент установки этого статуса прошло более 24 часов, необходимо отправить письмо автору релиза клиента
	// (на каждый релиз отдельное письмо).
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	стоки_ТекущиеДанныеСрезПоследних.КТК КАК КТК
	|ПОМЕСТИТЬ втКТК
	|ИЗ
	|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних КАК стоки_ТекущиеДанныеСрезПоследних
	|ГДЕ
	|	стоки_ТекущиеДанныеСрезПоследних.тек_ВЭксплуатации
	|	И стоки_ТекущиеДанныеСрезПоследних.тек_Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКТК.ПредварительныйРезерв)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РелизКлиентаКонтейнеры.Ссылка.Автор КАК Автор,
	|	РелизКлиентаКонтейнеры.Ссылка.НомерРелиза КАК НомерРелиза
	|ИЗ
	|	втКТК КАК втКТК
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РелизКлиента.Контейнеры КАК РелизКлиентаКонтейнеры 
	//ДИТ Шевченко А.В. US 62421 TA 64343 27.02.2023 -начало
	//|		ПО втКТК.КТК = РелизКлиентаКонтейнеры.Контейнер
	|		ПО втКТК.КТК = РелизКлиентаКонтейнеры.КлючАналитикиПеревозки.Контейнер
	//ДИТ Шевченко А.В. US 62421 TA 64343 27.02.2023 -конец
	|			И (РелизКлиентаКонтейнеры.Ссылка.НомернаяВыдача)
	|			И (РелизКлиентаКонтейнеры.Ссылка.СтатусСогласованияСпискаКТК = ЗНАЧЕНИЕ(Перечисление.СтатусыСогласованияСпискаКТКСТерминалами.НеСогласован))
	|ГДЕ
	|	НЕ РелизКлиентаКонтейнеры.ДатаПредварительногоРезерва ЕСТЬ NULL
	|	И РАЗНОСТЬДАТ(РелизКлиентаКонтейнеры.ДатаПредварительногоРезерва, &ТекущаяДата, ЧАС) > 24
	|ИТОГИ ПО
	|	Автор";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаАвтор = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СУЗ = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	УстановитьПривилегированныйРежим(Истина);
	Пароли = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(СУЗ, "ПарольSMTP");
	УстановитьПривилегированныйРежим(Ложь);
	
	Попытка
		
		Пока ВыборкаАвтор.Следующий() Цикл
			
			ВыборкаРелизы = ВыборкаАвтор.Выбрать();
			Пока ВыборкаРелизы.Следующий() Цикл
				
				АдресаАвтораДокумента = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаАвтор.Автор, Справочники.ВидыКонтактнойИнформации.EmailПользователя,, Ложь);
				
				ТекстПисьма = СтрШаблон("Необходимо подтвердить/отменить резервирование контейнеров в релизе %1.
									|Контейнеры находятся в статусе предварительного резервирования более суток.", ВыборкаРелизы.НомерРелиза);
				
				ИПП = Новый ИнтернетПочтовыйПрофиль;
				ИПП.АдресСервераSMTP = СУЗ.СерверИсходящейПочты;
				ИПП.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
				ИПП.ПарольSMTP = Пароли;
				ИПП.ПользовательSMTP = СУЗ.ПользовательSMTP;
				ИПП.ПортSMTP = СУЗ.ПортСервераИсходящейПочты;
				
				ИС = Новый ИнтернетПочтовоеСообщение;
				ИС.ИмяОтправителя = СУЗ.ИмяПользователя;
				ИС.Отправитель.Адрес = СУЗ.АдресЭлектроннойПочты;
				Для Каждого ТекПолучатель Из АдресаАвтораДокумента Цикл
					Если Не ПустаяСтрока(ТекПолучатель.Представление) Тогда
						ИС.Получатели.Добавить(ТекПолучатель.Представление);
					КонецЕсли;
				КонецЦикла;
				ИС.Тема = СтрШаблон("Ожидание подтверждения резервирования КТК по релизу %1", ВыборкаРелизы.НомерРелиза);
				ИС.Тексты.Добавить(ТекстПисьма, ТипТекстаПочтовогоСообщения.ПростойТекст);
				ИС.ОбработатьТексты();
				ИП = Новый ИнтернетПочта;
				ИП.Подключиться(ИПП);
				ИП.Послать(ИС);
				ИП.Отключиться()
				
			КонецЦикла;
		КонецЦикла;	
		
	Исключение
		ЗаписьЖурналаРегистрации("Ошибка отправки результатов исполнения личных целей", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры	

// Евросиб Фролов)