#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КоличествоСтрок = Параметры.КоличествоСтрок;
	ТипоразмерКТК = Параметры.ТипоразмерКТК;
	СтокВыдачи = Параметры.СтокВыдачи;

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрочитатьДанные(Команда)
	
	РаспознанныеДанные.Очистить();
	
	НомерСтроки = 2;
	ПредставлениеНомераСтроки = Формат(НомерСтроки, "ЧГ=0");	
	
	ПрочитаннаяСтрока = Excel.Область("R" + ПредставлениеНомераСтроки + "C1").Текст;
	
	МассивКТК = Новый Массив;
	
	Пока ПрочитаннаяСтрока <> "" Цикл
		
		НомерКТК = СокрЛП(Excel.Область("R" + ПредставлениеНомераСтроки + "C1").Текст);
		КТК = РаботаСКонтейнерамиСервер.НайтиКТК(НомерКТК, Ложь);
		Если КТК <> Неопределено Тогда
			МассивКТК.Добавить(КТК);
		КонецЕсли;	

		НомерСтроки = НомерСтроки + 1;
		ПредставлениеНомераСтроки = Формат(НомерСтроки, "ЧГ=0");
		ПрочитаннаяСтрока = Excel.Область("R" + ПредставлениеНомераСтроки + "C1").Текст;
		
	КонецЦикла;
	
	ПолучитьСведенияПоКТК(МассивКТК);
	
КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
	
	Если ЕстьОшибки Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "Перенос данных будет проведен только по строкам,
										|не имеющим ошибок. Продолжить?", Режим, 0);
	Иначе
		ВыполнитьПеренос(0);  // ++ ДИТ US 76619 ТА 76735 Сержантова А.С. добавила тип заполнения
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьСведенияПоКТК(МассивКТК)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТЕ.Ссылка КАК Контейнер,
	|	стоки_ТекущиеДанныеСрезПоследних.тек_Сток КАК ТекущийСток,
	|	стоки_ТекущиеДанныеСрезПоследних.тек_Статус КАК Статус,
	|	стоки_ТекущиеДанныеСрезПоследних.тек_Собственник КАК тек_Собственник,
	|	стоки_ТекущиеДанныеСрезПоследних.тек_ВидСобственности КАК тек_ВидСобственности,
	|	ТЕ.ТипТЕ КАК ТипоразмерКТК
	|ИЗ
	|	Справочник.ТЕ КАК ТЕ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные.СрезПоследних КАК стоки_ТекущиеДанныеСрезПоследних
	|		ПО ТЕ.Ссылка = стоки_ТекущиеДанныеСрезПоследних.КТК
	|ГДЕ
	|	ТЕ.Ссылка В(&МассивКТК)";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("МассивКТК", МассивКТК);
	
	ТипоразмермерыКТК = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивКТК, "ТипТЕ");
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	// ДИТ US 76619 ТА 76735 Сержантова А.С. Начало: 15.11.2023 - при такой заливке в распознанных данных не соблюдается порядок, указанный в таб доке
	// Было:
	//РаспознанныеДанные.Загрузить(Результат); 
	//Стало: 
	РаспознанныеДанные.Очистить();
	Для каждого КТК Из МассивКТК Цикл
	    СтрРезультата = Результат.НайтиСтроки(Новый Структура("Контейнер", КТК));
		Если СтрРезультата.Количество() = 1 Тогда
			НС = РаспознанныеДанные.Добавить();
			ЗаполнитьЗначенияСвойств(НС, СтрРезультата[0]);
		КонецЕсли;
	КонецЦикла;
	// ДИТ US 76619 ТА 76735 Сержантова А.С. Конец: 15.11.2023
	
	// Проверки
	НомеСтроки = 1;
	Для Каждого ТекущаяСтрока Из РаспознанныеДанные Цикл
		
		Если НомеСтроки > КоличествоСтрок Тогда
			ТекущаяСтрока.Ошибки = ТекущаяСтрока.Ошибки
							+ ?(ПустаяСтрока(ТекущаяСтрока.Ошибки), "", ", ")
							+ "превышение макс. кол-ва";
			ТекущаяСтрока.ОтказВДобавлении = Истина; //ДИТ Шевченко А.В. BUG 75898 TA 75908 10.10.2023				
			ЕстьОшибки = Истина;				
		КонецЕсли;
		
		ТипТекущегоКТК = ТипоразмермерыКТК.Получить(ТекущаяСтрока.Контейнер);
		Если ТипоразмерКТК <> ТипТекущегоКТК Тогда
			//ДИТ Шевченко А.В. BUG 75898 TA 75908 10.10.2023
			ТекущаяСтрока.Ошибки = ТекущаяСтрока.Ошибки
							+ ?(ПустаяСтрока(ТекущаяСтрока.Ошибки), "", ", ")
							+ "несоответствие типоразмера";
			//ЕстьОшибки = Истина;
			//ДИТ Шевченко А.В. BUG 75898 TA 75908 10.10.2023
		КонецЕсли;	
		
		Если СтокВыдачи <> ТекущаяСтрока.ТекущийСток Тогда
			//ДИТ Шевченко А.В. BUG 75898 TA 75908 10.10.2023
			ТекущаяСтрока.Ошибки = ТекущаяСтрока.Ошибки
							+ ?(ПустаяСтрока(ТекущаяСтрока.Ошибки), "", ", ")
							+ "несоответствие текущего стока";
			//ЕстьОшибки = Истина;
			//ДИТ Шевченко А.В. BUG 75898 TA 75908 10.10.2023
		КонецЕсли;
		
		Если ТекущаяСтрока.Статус <> Перечисления.СтатусыКТК.Свободен Тогда
			//ДИТ Шевченко А.В. BUG 75898 TA 75908 10.10.2023
			ТекущаяСтрока.Ошибки = ТекущаяСтрока.Ошибки
							+ ?(ПустаяСтрока(ТекущаяСтрока.Ошибки), "", ", ")
							+ "несоответствие статуса КТК";
			//ЕстьОшибки = Истина;
			//ДИТ Шевченко А.В. BUG 75898 TA 75908 10.10.2023
		КонецЕсли;
		
		НомеСтроки = НомеСтроки + 1;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьДопустимыеСимволы(СтрокаПроверки)
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить("1234567890");
	МассивСтрок.Добавить("qwertyuiopasdfghjklzxcvbnm");
	МассивСтрок.Добавить("абвгдеёжзийклмнопрстуфхцчшщыьъэюя");
	МассивСтрок.Добавить(" .-");
	
	СтрокаДопустимыхСимволов = СтрСоединить(МассивСтрок);
	СтрокаДопустимыхСимволов = ВРег(СтрокаДопустимыхСимволов);
	
	Для НомерСимвола = 1 по СтрДлина(СтрокаПроверки) Цикл
		Если Найти(СтрокаДопустимыхСимволов, ВРег(Сред(СтрокаПроверки, НомерСимвола, 1))) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции		

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	// ДИТ US 76619 ТА 76735 Сержантова А.С. Начало: 13.11.2023
	// Было:
	//ВыполнитьПеренос(); 
	//Стало:      
	Если Параметры <> Неопределено и Параметры.Свойство("ТипЗаполнения") Тогда
		ВыполнитьПеренос(Параметры.ТипЗаполнения);
	Иначе	
	    ВыполнитьПеренос(0);
	КонецЕсли;
	// ДИТ US 76619 ТА 76735 Сержантова А.С. Конец: 13.11.2023

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПеренос(ТипЗаполнения) // ++ ДИТ US 76619 ТА 76735 Сержантова А.С. добавила тип заполнения

	Результат = Новый Массив;
	Для каждого СтрокаДанных из РаспознанныеДанные Цикл
		
		//Если НЕ ПустаяСтрока(СтрокаДанных.Ошибки) Тогда
		Если СтрокаДанных.ОтказВДобавлении //ДИТ Шевченко А.В. BUG 75898 TA 75908 10.10.2023   
			// ДИТ US 76619 ТА 76735 Сержантова А.С. Начало: 15.11.2023 - при перезаполнении строк не проверяем превышение количества
			и не ТипЗаполнения = 1 Тогда
			// ДИТ US 76619 ТА 76735 Сержантова А.С. Конец: 15.11.2023
			Продолжить;
		КонецЕсли;
		
		СтруктураСведений = Новый Структура("Контейнер, ТипоразмерКТК");
		ЗаполнитьЗначенияСвойств(СтруктураСведений, СтрокаДанных);
		Результат.Добавить(СтруктураСведений);
	КонецЦикла;
	
	Закрыть(Новый Структура("Результат, ТипЗаполнения", Результат, ТипЗаполнения)); // ++ ДИТ US 76619 ТА 76735 Сержантова А.С. добавила тип заполнения
	
КонецПроцедуры 

// ДИТ US 76619 ТА 76735 Сержантова А.С. 07.11.2023
&НаКлиенте
Процедура ЗаполнитьПустыеСтроки(Команда) 
	ВыполнитьПеренос(1);
КонецПроцедуры

#КонецОбласти