Функция ПолучитьАктуальнуюТаблицуЗамен() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить(Новый Структура("Переменная, Описание", "##КурсКалькуляции", "Выводит курс валюты калькуляции с учетом округления"));
	Результат.Добавить(Новый Структура("Переменная, Описание", "##КурсФрахта", "Выводит курс валюты фрахта с учетом округления"));
	Результат.Добавить(Новый Структура("Переменная, Описание", "##Коносамент", "Выводит номер коносамента"));
	Результат.Добавить(Новый Структура("Переменная, Описание", "##Букинг", "Выводит номер букинга"));
	Результат.Добавить(Новый Структура("Переменная, Описание", "##ПунктОтправленияСуша", "Станция отправления из заявки"));
	Результат.Добавить(Новый Структура("Переменная, Описание", "##ПунктНазначенияСуша", "Станция назначения из заявки"));    
	// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Начало: 30.10.2024
	// Было:
	//Результат.Добавить(Новый Структура("Переменная, Описание", "##ПунктОтправленияКС", "Пункт отправления из коносамента"));  
	//Результат.Добавить(Новый Структура("Переменная, Описание", "##ПунктНазначенияКС", "Пункт назначения из коносамента"));
	//Стало:
	Результат.Добавить(Новый Структура("Переменная, Описание", "##ПортОтправленияКС", "Порт отправления из коносамента"));  
	Результат.Добавить(Новый Структура("Переменная, Описание", "##ПортНазначенияКС", "Порт назначения из коносамента"));
	// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Конец: 30.10.2024
	Результат.Добавить(Новый Структура("Переменная, Описание", "##ВалютаКалькуляции", "Выводит валюту ставки всей калькуляции"));
	Результат.Добавить(Новый Структура("Переменная, Описание", "##СуммаКомплекснойСтавки", "Выводит сумму компл. ставки калькуляции (указана в подвале документа)"));
	Результат.Добавить(Новый Структура("Переменная, Описание", "##ВалютаФрахта", "Выводит валюту ставки фрахта"));
	Результат.Добавить(Новый Структура("Переменная, Описание", "##СписокКТК", "Список контейнеров"));
	
	Результат.Добавить(Новый Структура("Переменная, Описание", "##Пункт_ОтправленияСушаENG", "Станция отправления из заявки (англ.)"));
	Результат.Добавить(Новый Структура("Переменная, Описание", "##Пункт_НазначенияСушаENG", "Станция назначения из заявки (англ.)"));  
	// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Начало: 30.10.2024
	// Было:
	//Результат.Добавить(Новый Структура("Переменная, Описание", "##Пункт_ОтправленияКСENG", "Пункт отправления из коносамента (англ.)"));
	//Результат.Добавить(Новый Структура("Переменная, Описание", "##Пункт_НазначенияКСENG", "Пункт назначения из коносамента (англ.)")); 
	//Стало:
	Результат.Добавить(Новый Структура("Переменная, Описание", "##ПортОтправленияКСENG", "Порт отправления из коносамента (англ.)"));
	Результат.Добавить(Новый Структура("Переменная, Описание", "##ПортНазначенияКСENG", "Порт назначения из коносамента (англ.)"));  
	
	Результат.Добавить(Новый Структура("Переменная, Описание", "##МорскойТерминалОтправленияКС", "Морской терминал отправления из коносамента"));
	Результат.Добавить(Новый Структура("Переменная, Описание", "##МорскойТерминалНазначенияКС", "Морской терминал назначения из коносамента")); 
	Результат.Добавить(Новый Структура("Переменная, Описание", "##МорскойТерминалОтправленияКСENG", "Морской терминал отправления из коносамента (англ.)"));
	Результат.Добавить(Новый Структура("Переменная, Описание", "##МорскойТерминалНазначенияКСENG", "Морской терминал назначения из коносамента (англ.)")); 
	// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Конец: 30.10.2024
	
	Результат.Добавить(Новый Структура("Переменная, Описание", "##Регион_ОтправленияКС", "Регион отправления из коносамента"));
	Результат.Добавить(Новый Структура("Переменная, Описание", "##Регион_НазначенияКС", "Регион назначения из коносамента"));
	Результат.Добавить(Новый Структура("Переменная, Описание", "##Регион_ОтправленияКСENG", "Регион отправления из коносамента (англ.)"));
	Результат.Добавить(Новый Структура("Переменная, Описание", "##Регион_НазначенияКСENG", "Регион назначения из коносамента (англ.)"));
	
	Результат.Добавить(Новый Структура("Переменная, Описание", "##ДатаКурса", "Дата курса (= дата документа)"));
	
	Результат.Добавить(Новый Структура("Переменная, Описание", "##ПогранПереходОтправление", "Погран. переход из страны отправления из сделки"));
	Результат.Добавить(Новый Структура("Переменная, Описание", "##ПогранПереходПрибытие", "Погран. переход в страну прибытия из сделки"));
	Результат.Добавить(Новый Структура("Переменная, Описание", "##ПогранПереходОтправлениеENG", "Погран. переход из страны отправления из сделки (англ.)"));
	Результат.Добавить(Новый Структура("Переменная, Описание", "##ПогранПереходПрибытиеENG", "Погран. переход в страну прибытия из сделки (англ.)"));
	
	Результат.Добавить(Новый Структура("Переменная, Описание", "##ДатаПодачиАвто", "Дата подачи авто по отправлению из заявки"));
	Результат.Добавить(Новый Структура("Переменная, Описание", "##РегионОтправленияСуша", "Пункт отправления из заявки (указан над станцией)"));
	Результат.Добавить(Новый Структура("Переменная, Описание", "##РегионНазначенияСуша", "Пункт назначения из заявки (указан над станцией)"));
	
	Результат.Добавить(Новый Структура("Переменная, Описание", "##НомерРеестраКлиента", "Номер реестра / погруз.поручения из заявки"));
	Результат.Добавить(Новый Структура("Переменная, Описание", "##НомерАвтоВывоза", "Номер авто вывоза (авто по отправлению) из заявки"));
	
	Результат.Добавить(Новый Структура("Переменная, Описание", "##АдресЗабораГруза", "Адрес забора груза из заявки"));
	Результат.Добавить(Новый Структура("Переменная, Описание", "##АдресДоставкиГруза", "Адрес доставки груза из заявки"));
	
	// Евросиб Фролов (11.03.2022, Task №44976
	Результат.Добавить(Новый Структура("Переменная, Описание", "##КоносаментыСоставаПоезда", "Выводит номера коносаментов (из состава поезда) всех КТК из группировки"));
	// Евросиб Фролов)
	
	Возврат Результат;
	
КонецФункции

//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, начало
Функция ПолучитьАктуальнуюТаблицуЗамен_ОтчетКомитенту() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить(Новый Структура("Переменная, Описание", "##ДатаСФ", "Дата СФ в разделе Товары и услуги"));

	Возврат Результат;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, конец

Функция ПолучитьАктуальнуюТаблицуЗамен_Счет() Экспорт //Евросиб Шевченко А.В. 07.05.2025 US 95275 TA 106445
	
	Результат = Новый Массив;

	Результат.Добавить(Новый Структура("Переменная, Описание", "##КурсВалютыДляСНП", "При формировании счета на оплату по СНП в поле ""Содержание услуги"" после данных об услуге будет отображаться данная информация."));
	Результат.Добавить(Новый Структура("Переменная, Описание", "##ДатыСНП", "При формировании счета на оплату по СНП в поле ""Содержание услуги"" после данных об услуге и о курсе валюты будет отображаться данная информация."));
	
	Возврат Результат;
	
КонецФункции