
Процедура Связь_ЭТРАН_DC_ПриЗаписиПриЗаписи(Источник, Отказ) Экспорт
	
	НайтиСоздатьЭлементДЦ(Источник.Ссылка);
		
КонецПроцедуры

Функция НайтиСоздатьЭлементДЦ(ЭлементАТК) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЭлементАТК) Тогда Возврат неопределено; КонецЕсли;
	
	//СопостЭлемент = ПолучитьСопоставлениеДляСпрАТК(ЭлементАТК);
	//Если ЗначениеЗаполнено(СопостЭлемент) Тогда Возврат СопостЭлемент; КонецЕсли;
	
	// э_Контейнеры
	Если ТипЗнч(ЭлементАТК) = Тип("СправочникСсылка.э_Контейнеры") Тогда
		
		КТКДейств = неопределено;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	ТЕ.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ТЕ КАК ТЕ
		               |ГДЕ
		               |	НЕ ТЕ.ПометкаУдаления
//		               |	И ТЕ.ВЭксплуатации
		               |	И ТЕ.Наименование ПОДОБНО &Наименование";
		Запрос.УстановитьПараметр("Наименование", ЭлементАТК.НомерКонтейнера);
		Ответ = запрос.Выполнить().Выбрать();
		Если Ответ.Следующий() Тогда
			КТКДейств = Ответ.Ссылка;
		КонецЕсли;

		Если ЗначениеЗаполнено(КТКДейств) Тогда
			МЗ = РегистрыСведений.Связь_ЭТРАН_DC_Сопоставление.СоздатьМенеджерЗаписи();
			МЗ.Период = ТекущаяДата();
			МЗ.СпрДатакор = КТКДейств;
			МЗ.СпрЭтрана = ЭлементАТК.Ссылка;
			МЗ.Записать(Истина);
			Возврат КТКДейств;
		КонецЕсли;
		
//		НЭлемент = Справочники.ТЕ.СоздатьЭлемент();
//		НЭлемент.ТипТЕ = НайтиСоздатьЭлементДЦ(ЭлементАТК.ТипКонтейнера);
//		НЭлемент.Наименование = ЭлементАТК.НомерКонтейнера;
////		НЭлемент.ВЭксплуатации = Истина;
//		НЭлемент.Префикс = Лев(ЭлементАТК.НомерКонтейнера, 4);
//		НЭлемент.Номер = Сред(ЭлементАТК.НомерКонтейнера, 5, 6);
//		НЭлемент.КонтрольноеЧисло = Прав(ЭлементАТК.НомерКонтейнера, 1);
//		НЭлемент.Записать();

		ссЭлемент = РаботаСКонтейнерамиСервер.СоздатьКТК(ЭлементАТК.НомерКонтейнера, НайтиСоздатьЭлементДЦ(ЭлементАТК.ТипКонтейнера));
		
		// Евросиб Фролов (26.10.2021 Ticket№ 41408
		МассивСозданныхКТК = Новый Массив;
		МассивСозданныхКТК.Добавить(ссЭлемент);
		РаботаСКонтейнерамиСервер.ДобавитьИнформациюОбИсточникеСозднияКонтейнеров(МассивСозданныхКТК, "ЭТРАН");
		// Евросиб Фролов)
		
		МЗ = РегистрыСведений.Связь_ЭТРАН_DC_Сопоставление.СоздатьМенеджерЗаписи();
		МЗ.Период = ТекущаяДата();
		МЗ.СпрДатакор = ссЭлемент;
		МЗ.СпрЭтрана = ЭлементАТК.Ссылка;
		МЗ.Записать(Истина);
		
		Возврат ссЭлемент;
		
	// э_ЕТСНГ
	ИначеЕсли ТипЗнч(ЭлементАТК) = Тип("СправочникСсылка.э_ЕТСНГ") Тогда
		
		ГрузДейств = неопределено;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Грузы.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Грузы КАК Грузы
		               |ГДЕ
		               |	НЕ Грузы.ПометкаУдаления
		               |	И Грузы.ЕТСНГ ПОДОБНО &ЕТСНГ";
		Запрос.УстановитьПараметр("ЕТСНГ", ""+Формат(ЭлементАТК.Код, "ЧГ=")+"%");
		Ответ = запрос.Выполнить().Выбрать();
		Если Ответ.Следующий() Тогда
			ГрузДейств = Ответ.Ссылка;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ГрузДейств) Тогда
			МЗ = РегистрыСведений.Связь_ЭТРАН_DC_Сопоставление.СоздатьМенеджерЗаписи();
			МЗ.Период = ТекущаяДата();
			МЗ.СпрДатакор = ГрузДейств;
			МЗ.СпрЭтрана = ЭлементАТК;
			МЗ.Записать(Истина);
			Возврат ГрузДейств;
		КонецЕсли;
		
		НЭлемент = Справочники.Грузы.СоздатьЭлемент();
		НЭлемент.Наименование = ЭлементАТК.Наименование;
		НЭлемент.ЕТСНГ = Формат(ЭлементАТК.Код, "ЧГ=");
		НЭлемент.Записать();
		
		МЗ = РегистрыСведений.Связь_ЭТРАН_DC_Сопоставление.СоздатьМенеджерЗаписи();
		МЗ.Период = ТекущаяДата();
		МЗ.СпрДатакор = НЭлемент.Ссылка;
		МЗ.СпрЭтрана = ЭлементАТК.Ссылка;
		МЗ.Записать(Истина);
		
		Возврат НЭлемент.Ссылка;
		
	// э_Вагоны
	ИначеЕсли ТипЗнч(ЭлементАТК) = Тип("СправочникСсылка.э_Вагоны") Тогда
		
		ВагонДейств = неопределено;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	ТС.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ТС КАК ТС
		               |ГДЕ
//		               |	ТС.ВЭксплуатации
		               |	И НЕ ТС.ПометкаУдаления
		               |	И ТС.Наименование ПОДОБНО &Наименование";
		Запрос.УстановитьПараметр("Наименование", ""+Формат(ЭлементАТК.НомерВагона, "ЧГ=")+"%");
		Ответ = запрос.Выполнить().Выбрать();
		Если Ответ.Следующий() Тогда
			ВагонДейств = Ответ.Ссылка;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВагонДейств) Тогда
			МЗ = РегистрыСведений.Связь_ЭТРАН_DC_Сопоставление.СоздатьМенеджерЗаписи();
			МЗ.Период = ТекущаяДата();
			МЗ.СпрДатакор = ВагонДейств;
			МЗ.СпрЭтрана = ЭлементАТК;
			МЗ.Записать(Истина);
			Возврат ГрузДейств;
		КонецЕсли;
		
		НЭлемент = Справочники.ТС.СоздатьЭлемент();
		НЭлемент.Наименование = Формат(ЭлементАТК.НомерВагона, "ЧГ=");
		НЭлемент.ЗаписьИсторииДанных.КомментарийВерсии = "Создан подпиской Связь_ЭТРАН_DC_ПриЗаписи"; //ДИТ Шевченко US 63491 TA 74038 18.09.2023
//		НЭлемент.ВЭксплуатации = Истина;
		НЭлемент.Записать();
		
		МЗ = РегистрыСведений.Связь_ЭТРАН_DC_Сопоставление.СоздатьМенеджерЗаписи();
		МЗ.Период = ТекущаяДата();
		МЗ.СпрДатакор = НЭлемент.Ссылка;
		МЗ.СпрЭтрана = ЭлементАТК.Ссылка;
		МЗ.Записать(Истина);
		
		Возврат НЭлемент.Ссылка;
		
	// э_Станции
	ИначеЕсли ТипЗнч(ЭлементАТК) = Тип("СправочникСсылка.э_Станции") 
		ИЛИ ТипЗнч(ЭлементАТК) = Тип("СправочникСсылка.э_СтанцииИностранные") Тогда
		СтанцияДейств = неопределено;
		
		//Евросиб - АСуслов 02.06.2023 13:12:17 #67494
		//(
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтраныМира.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Страны
		|ИЗ
		|	Справочник.э_Страны КАК э_Страны
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМира
		|		ПО э_Страны.КодОКСМ = СтраныМира.Код
		|			И (СтраныМира.ЗагружатьДорогиИСтанцииИзЭТРАН)
		|ГДЕ
		|	э_Страны.Код = &КодСтраныЭтран
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Страны.Ссылка КАК Страна
		|ИЗ
		|	ВТ_Страны КАК ВТ_Страны
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Локации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Локации КАК Локации
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Страны КАК ВТ_Страны
		//|		ПО Локации.Страна = ВТ_Страны.Ссылка
		|ГДЕ
		//|	НЕ Локации.ПометкаУдаления
		//|	И Локации.КодЖДСтанции ПОДОБНО &КодЖДСтанции";
		|	Локации.КодЖДСтанции = &КодЖДСтанции";
		//|;
		//|ВЫБРАТЬ Локации.Ссылка КАК Регион
		//|ИЗ Справочник.Локации КАК Локации
		//|ГДЕ Локации.Тип = &Тип И Локации.КодСубъектаРФ = &КодСубъектаРФ";
		//Запрос.УстановитьПараметр("КодЖДСтанции", ""+Формат(ЭлементАТК.Код, "ЧГ=")+"%");
		Запрос.УстановитьПараметр("КодЖДСтанции", Формат(ЭлементАТК.Код, "ЧГ="));
		Запрос.УстановитьПараметр("КодСтраныЭтран", ЭлементАТК.КодСтраны);
		//Если ТипЗнч(ЭлементАТК) = Тип("СправочникСсылка.э_Станции") Тогда
		//	Запрос.УстановитьПараметр("КодСубъектаРФ", ЭлементАТК.КодРегиона);
		//	Запрос.УстановитьПараметр("Тип", Справочники.ТипыЛокаций.Регион);
		//Иначе
		//	Запрос.УстановитьПараметр("КодСубъектаРФ", Неопределено);
		//	Запрос.УстановитьПараметр("Тип", Справочники.ТипыЛокаций.Регион);
		//КонецЕсли;
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		Ответ = РезультатыЗапроса[2].Выбрать();
		Если Ответ.Следующий() Тогда
			СтанцияДейств = Ответ.Ссылка;
		КонецЕсли;
		Если РезультатыЗапроса[1].Пустой() Тогда
			Если ЗначениеЗаполнено(СтанцияДейств) Тогда
				нЭлемент = СтанцияДейств.ПолучитьОбъект();
				нЭлемент.УстановитьПометкуУдаления(Истина);
				нЭлемент.ДатаСинхронизацииЭтран = ТекущаяДата();
				НЭлемент.Записать();
			КонецЕсли;
			Возврат СтанцияДейств;
		КонецЕсли;
		Если СтанцияДейств = Неопределено Тогда
			НЭлемент = Справочники.Локации.СоздатьЭлемент();
		Иначе
			нЭлемент = СтанцияДейств.ПолучитьОбъект();
			Если нЭлемент.ПометкаУдаления Тогда
				НЭлемент.УстановитьПометкуУдаления(Ложь);
				нЭлемент.ДатаСинхронизацииЭтран = ТекущаяДата();
			КонецЕсли;
		КонецЕсли;  

		//)
		//Евросиб - АСуслов 02.06.2023 13:12:18 #67494
		
		//Если ЗначениеЗаполнено(СтанцияДейств) Тогда
		//	МЗ = РегистрыСведений.Связь_ЭТРАН_DC_Сопоставление.СоздатьМенеджерЗаписи();
		//	МЗ.Период = ТекущаяДата();
		//	МЗ.СпрДатакор = СтанцияДейств;
		//	МЗ.СпрЭтрана = ЭлементАТК;
		//	МЗ.Записать(Истина);
		//	Возврат СтанцияДейств;
		//КонецЕсли;
		
		//НЭлемент.Родитель = Справочники.Локации.Загруженные; //Евросиб Гудкова( 11.07.2019
		Если ЗначениеЗаполнено(СтанцияДейств) Тогда
			ЛокацияВышестоящегоУровня = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтанцияДейств, "ЛокацияВышестоящегоУровня"); 
			ЛокацияВышестоящегоУровняВторогоУровня = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЛокацияВышестоящегоУровня, "ЛокацияВышестоящегоУровня");
		КонецЕсли;
		
		//ЭлементАТК.
		//Если нЭлемент.ЛокацияВышестоящегоУровня = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(нЭлемент.Лока Тогда
		//	
		//КонецЕсли;
		НЭлемент.Наименование = ЭлементАТК.Наименование;
		НЭлемент.КодЖДСтанции = ЭлементАТК.Код;
		НЭлемент.Тип = Справочники.ТипыЛокаций.СтанцияЖД;
		нЭлемент.ДатаВводаВДействие = ЭлементАТК.ДатаВводаВДействие;
		нЭлемент.ДатаВыводаИзДействия = ЭлементАТК.ДатаВыводаИзДействия;
		нЭлемент.Страна = РезультатыЗапроса[1].Выгрузить()[0].Страна; 
		Если ТипЗнч(ЭлементАТК) = Тип("СправочникСсылка.э_Станции") Тогда
			//Евросиб - АСуслов 07.11.2023 17:48:04 #77106
			//(
			Если НЕ ЗначениеЗаполнено(НЭлемент.Широта) Тогда
				НЭлемент.Широта = ЭлементАТК.ШиротаСтанции;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(НЭлемент.Долгота) Тогда
				НЭлемент.Долгота = ЭлементАТК.ДолготаСтанции;
			КонецЕсли;
			//)
			//Евросиб - АСуслов 07.11.2023 17:48:05 #77106
			НЭлемент.ЖелезнаяДорога = ПолучитьСопоставлениеДляСпрАТК(ЭлементАТК.Дорога);
			//нЭлемент.ПараграфыСтанции = ЭлементАТК.ПараграфыСтанции;
			//Если НЕ РезультатыЗапроса[3].Пустой() Тогда
				РегионЭтран = ПолучитьСопоставлениеДляСпрАТК(ЭлементАтк.Регион);
				Если НЕ ЗначениеЗаполнено(ЛокацияВышестоящегоУровня)
					ИЛИ (ЛокацияВышестоящегоУровня.Тип = Справочники.ТипыЛокаций.Регион 
					И ЛокацияВышестоящегоУровняВторогоУровня <> РегионЭтран)
					ИЛИ ЛокацияВышестоящегоУровня.Тип <> Справочники.ТипыЛокаций.НаселенныйПункт Тогда
					НЭлемент.ЛокацияВышестоящегоУровня = РегионЭтран;	
				КонецЕсли;                                           
			//КонецЕсли;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НЭлемент.ЛокацияВышестоящегоУровня) Тогда
			нЭлемент.ЛокацияВышестоящегоУровня = Локации_сервер.ПолучитьЛокациюПоСтране(нЭлемент.Страна);	
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НЭлемент.Родитель) Тогда
			нЭлемент.Родитель = Локации_сервер.ПолучитьЛокациюПоСтране(нЭлемент.Страна);	
		КонецЕсли;
		нЭлемент.ДатаСинхронизацииЭтран = ТекущаяДата();
		НЭлемент.Записать();
		
		МЗ = РегистрыСведений.Связь_ЭТРАН_DC_Сопоставление.СоздатьМенеджерЗаписи();
		МЗ.Период = ТекущаяДата();
		МЗ.СпрДатакор = НЭлемент.Ссылка;
		МЗ.СпрЭтрана = ЭлементАТК.Ссылка;
		МЗ.Записать(Истина);
		
		Возврат НЭлемент.Ссылка;
		
	// э_ГНГ
	ИначеЕсли ТипЗнч(ЭлементАТК) = Тип("СправочникСсылка.э_ГНГ") Тогда
		
		ГрузДейств = неопределено;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Грузы.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Грузы КАК Грузы
		               |ГДЕ
		               |	НЕ Грузы.ПометкаУдаления
		               |	И Грузы.ГНГ ПОДОБНО &ЕТСНГ";
		Запрос.УстановитьПараметр("ЕТСНГ", ""+Формат(ЭлементАТК.КодГНГ, "ЧГ=")+"%");
		Ответ = запрос.Выполнить().Выбрать();
		Если Ответ.Следующий() Тогда
			ГрузДейств = Ответ.Ссылка;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ГрузДейств) Тогда
			МЗ = РегистрыСведений.Связь_ЭТРАН_DC_Сопоставление.СоздатьМенеджерЗаписи();
			МЗ.Период = ТекущаяДата();
			МЗ.СпрДатакор = ГрузДейств;
			МЗ.СпрЭтрана = ЭлементАТК;
			МЗ.Записать(Истина);
			Возврат ГрузДейств;
		КонецЕсли;
		
		НЭлемент = Справочники.Грузы.СоздатьЭлемент();
		НЭлемент.Наименование = ЭлементАТК.Наименование;
		НЭлемент.ЕТСНГ = Формат(ЭлементАТК.КодЕТСНГ, "ЧГ=");
		НЭлемент.ГНГ = Формат(ЭлементАТК.КодГНГ, "ЧГ=");
		НЭлемент.Записать();
		
		МЗ = РегистрыСведений.Связь_ЭТРАН_DC_Сопоставление.СоздатьМенеджерЗаписи();
		МЗ.Период = ТекущаяДата();
		МЗ.СпрДатакор = НЭлемент.Ссылка;
		МЗ.СпрЭтрана = ЭлементАТК.Ссылка;
		МЗ.Записать(Истина);
		
		Возврат НЭлемент.Ссылка;
		
	// э_Дороги
	ИначеЕсли ТипЗнч(ЭлементАТК) = Тип("СправочникСсылка.э_Дороги") Тогда
		
		ДорогаДейств = неопределено;
		
		//Евросиб - АСуслов 02.06.2023 13:12:42 #67494
		//(
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтраныМира.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.э_Страны КАК э_Страны
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМира
		|		ПО э_Страны.КодОКСМ = СтраныМира.Код
		|			И (СтраныМира.ЗагружатьДорогиИСтанцииИзЭТРАН)
		|ГДЕ
		|	э_Страны.Код = &КодСтраныЭтран
		|;
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЖелезныеДороги.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЖелезныеДороги КАК ЖелезныеДороги
		|ГДЕ
		|	ЖелезныеДороги.Код = &Код";
		//|	И НЕ ЖелезныеДороги.ПометкаУдаления";
		Запрос.УстановитьПараметр("Код", ""+Формат(ЭлементАТК.КодДороги, "ЧГ="));
		Запрос.УстановитьПараметр("КодСтраныЭтран", ЭлементАТК.КодСтраны);
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		Если РезультатыЗапроса[0].Пустой() Тогда
			Возврат ДорогаДейств;
		КонецЕсли;
		Ответ = РезультатыЗапроса[1].Выбрать();
		Если Ответ.Следующий() Тогда
			ДорогаДейств = Ответ.Ссылка;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДорогаДейств) Тогда
			Если ЭлементАТК.ДатаВыводаИзДействия < ТекущаяДата() Тогда
				обДорогаДейств = ДорогаДейств.ПолучитьОбъект();
				обДорогаДейств.УстановитьПометкуУдаления(Истина);
				Возврат ДорогаДейств;
			КонецЕсли;
		//)
		//Евросиб - АСуслов 02.06.2023 13:12:44 #67494 
		
			//МЗ = РегистрыСведений.Связь_ЭТРАН_DC_Сопоставление.СоздатьМенеджерЗаписи();
			//МЗ.Период = ТекущаяДата();
			//МЗ.СпрДатакор = ДорогаДейств;
			//МЗ.СпрЭтрана = ЭлементАТК;
			//МЗ.Записать(Истина);
			//Возврат ДорогаДейств;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДорогаДейств) Тогда
			нЭлемент = ДорогаДейств.ПолучитьОбъект();
			Если нЭлемент.ПометкаУдаления Тогда
				нЭлемент.УстановитьПометкуУдаления(Ложь);
			КонецЕсли;
		Иначе
			НЭлемент = Справочники.ЖелезныеДороги.СоздатьЭлемент();
		КонецЕсли;
		НЭлемент.Код = ЭлементАТК.КодДороги;
		НЭлемент.Наименование = ЭлементАТК.Наименование;             
		//Евросиб - АСуслов 02.06.2023 14:41:34 #67494
		//(
		нЭлемент.Страна = РезультатыЗапроса[0].Выгрузить()[0].Ссылка;
		нЭлемент.ДатаВводаВДействие = ЭлементАТК.ДатаВводаВДействие;
		нЭлемент.ДатаВыводаИзДействия = ЭлементАТК.ДатаВыводаИзДействия;
		//)
		//Евросиб - АСуслов 02.06.2023 14:41:36 #67494
		НЭлемент.Записать();
		
		МЗ = РегистрыСведений.Связь_ЭТРАН_DC_Сопоставление.СоздатьМенеджерЗаписи();
		МЗ.Период = ТекущаяДата();
		МЗ.СпрДатакор = НЭлемент.Ссылка;
		МЗ.СпрЭтрана = ЭлементАТК.Ссылка;
		МЗ.Записать(Истина);
		
		Возврат НЭлемент.Ссылка;
		
	// э_ПаспортаОрганизаций
	ИначеЕсли ТипЗнч(ЭлементАТК) = Тип("СправочникСсылка.э_ПаспортаОрганизаций") Тогда
		
		КонтрагентДейств = неопределено;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Контрагенты.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Контрагенты КАК Контрагенты
		               |ГДЕ
		               |	Контрагенты.ИНН = &ИНН
		               |	И Контрагенты.КПП = &КПП
		               |	И НЕ Контрагенты.ПометкаУдаления
		               |	И НЕ Контрагенты.ЭтоГруппа";
		Запрос.УстановитьПараметр("ИНН", ЭлементАТК.ИНН);
		Запрос.УстановитьПараметр("КПП", ЭлементАТК.КПП);
		Ответ = Запрос.Выполнить().Выбрать();
		Если Ответ.Следующий() Тогда
			КонтрагентДейств = Ответ.Ссылка;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КонтрагентДейств) Тогда
			МЗ = РегистрыСведений.Связь_ЭТРАН_DC_Сопоставление.СоздатьМенеджерЗаписи();
			МЗ.Период = ТекущаяДата();
			МЗ.СпрДатакор = КонтрагентДейств;
			МЗ.СпрЭтрана = ЭлементАТК;
			МЗ.Записать(Истина);
			Возврат КонтрагентДейств;
		КонецЕсли;
		
		//НЭлемент = Справочники.Контрагенты.СоздатьЭлемент();
		//
		//НЭлемент.КодПоОКПО 		= ЭлементАТК.ОКПО;
		//НЭлемент.ИНН 			= ЭлементАТК.ИНН;
		//НЭлемент.КПП 			= ЭлементАТК.КПП;
		//НЭлемент.Наименование 	= ЭлементАТК.Наименование;
		//
		//НЭлемент.Записать();
		//
		//МЗ = РегистрыСведений.Связь_ЭТРАН_DC_Сопоставление.СоздатьМенеджерЗаписи();
		//МЗ.Период = ТекущаяДата();
		//МЗ.СпрДатакор = НЭлемент.Ссылка;
		//МЗ.СпрЭтрана = ЭлементАТК;
		//МЗ.Записать(Истина);
		
		Возврат неопределено;
		
	// э_Дороги
	ИначеЕсли ТипЗнч(ЭлементАТК) = Тип("СправочникСсылка.э_Страны") Тогда
		
		СтранаДейств = неопределено;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Страны.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.СтраныМира КАК Страны
		               |ГДЕ
		               |	Страны.Код = &Код
		               |	И НЕ Страны.ПометкаУдаления";
		Запрос.УстановитьПараметр("Код", ""+Формат(ЭлементАТК.КодОКСМ, "ЧГ="));
		Ответ = запрос.Выполнить().Выбрать();
		Если Ответ.Следующий() Тогда
			СтранаДейств = Ответ.Ссылка;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтранаДейств) Тогда
			МЗ = РегистрыСведений.Связь_ЭТРАН_DC_Сопоставление.СоздатьМенеджерЗаписи();
			МЗ.Период = ТекущаяДата();
			МЗ.СпрДатакор = СтранаДейств;
			МЗ.СпрЭтрана = ЭлементАТК;
			МЗ.Записать(Истина);
			Возврат СтранаДейств;
		КонецЕсли;
		
		НЭлемент = Справочники.СтраныМира.СоздатьЭлемент();
		НЭлемент.Код = ЭлементАТК.КодОКСМ;                          
		нЭлемент.КодАльфа2 = ЭлементАТК.КодАльфа2;
		НЭлемент.Наименование = ЭлементАТК.Наименование;
		нЭлемент.НаименованиеПолное = ЭлементАТК.НаименованиеПолное;
		НЭлемент.Записать();
		
		МЗ = РегистрыСведений.Связь_ЭТРАН_DC_Сопоставление.СоздатьМенеджерЗаписи();
		МЗ.Период = ТекущаяДата();
		МЗ.СпрДатакор = НЭлемент.Ссылка;
		МЗ.СпрЭтрана = ЭлементАТК.Ссылка;
		МЗ.Записать(Истина);
		
		Возврат НЭлемент.Ссылка;
	ИначеЕсли ТипЗнч(ЭлементАТК) = Тип("СправочникСсылка.э_Регионы") Тогда
		
		РегионДейств = неопределено;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Локации.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Локации КАК Локации
		               |ГДЕ
		               |	Локации.Наименование = &Наименование
		               |	И Локации.Тип = &Тип";
		Запрос.УстановитьПараметр("Наименование", ЭлементАТК.Наименование);
		Запрос.УстановитьПараметр("Тип", Справочники.ТипыЛокаций.Регион);
		Ответ = запрос.Выполнить().Выбрать();
		Если Ответ.Следующий() Тогда
			РегионДейств = Ответ.Ссылка;
		КонецЕсли; 
		
		Если РегионДейств = Неопределено Тогда
			Возврат Неопределено;	
		КонецЕсли;
		
		НЭлемент = РегионДейств.ПолучитьОбъект(); 
		нЭлемент.КодСубъектаРФ = ЭлементАТК.КодРегионаФНС;
		нЭлемент.ЛокацияВышестоящегоУровня = Локации_сервер.ПолучитьЛокациюПоСтране(нЭлемент.Страна);
		НЭлемент.Записать();
		
		МЗ = РегистрыСведений.Связь_ЭТРАН_DC_Сопоставление.СоздатьМенеджерЗаписи();
		МЗ.Период = ТекущаяДата();
		МЗ.СпрДатакор = НЭлемент.Ссылка;
		МЗ.СпрЭтрана = ЭлементАТК.Ссылка;
		МЗ.Записать(Истина);
		
		Возврат НЭлемент.Ссылка;
	КонецЕсли;
	
КонецФункции

// Эта функция не используется кодом. Сейчас пока это просто заметка о сопоставлении справочников
Функция ПолучитьСправочникДатакорПоАТК(ИмяСпрАТК) Экспорт
	
	Соотв = Новый Соответствие;
	Соотв.Вставить("э_Контейнеры", 						"ТЕ");
	Соотв.Вставить("э_ЕТСНГ", 							"Грузы");
	Соотв.Вставить("э_Вагоны", 							"ТС");
	Соотв.Вставить("э_Станции", 						"Локации");
	Соотв.Вставить("э_ГНГ", 							"Грузы");
	Соотв.Вставить("э_Дороги", 							"ЖелезныеДороги");
	Соотв.Вставить("э_ПаспортаОрганизаций", 			"Контрагенты");
	
	//Соотв.Вставить("э_РодаВагоновДляЗаявок", 			"ТипоразмерыТС");
	//Соотв.Вставить("э_ТипыКрупнотоннажныхКонтейнеров","ТипоразмерыТЕ");
	//Соотв.Вставить("э_РодаВагоновДляНакладных", 		"ТипоразмерыТС");
	//Соотв.Вставить("э_РазмерыКрупнотоннажныхКонтейнеров", "");
	//Соотв.Вставить("э_МоделиВагонов", "");
	//Соотв.Вставить("э_КлассификаторУпаковок", "");
	//Соотв.Вставить("э_ТипыУпаковки", "");
	//Соотв.Вставить("э_СобственникиАрендаторыВагонов", "");
	//Соотв.Вставить("э_ТипыВагонов", "");
	//Соотв.Вставить("э_НовыеРодаВагонов", "");
	//Соотв.Вставить("э_ТипыКонтейнеров", "");
	
	Возврат Соотв.Получить(ИмяСпрАТК);
	
КонецФункции

Функция ПолучитьСопоставлениеДляСпрАТК(СсылкаАТК) Экспорт
	
	Результат = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СпрЭтрана", СсылкаАТК);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Связь_ЭТРАН_DC_Сопоставление.СпрДатакор КАК СпрДатакор
	               |ИЗ
	               |	РегистрСведений.Связь_ЭТРАН_DC_Сопоставление КАК Связь_ЭТРАН_DC_Сопоставление
	               |ГДЕ
	               |	Связь_ЭТРАН_DC_Сопоставление.СпрЭтрана = &СпрЭтрана";
	Ответ = запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.СпрДатакор;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСопоставлениеДляСпрDC(СсылкаDC) Экспорт
	
	Результат = неопределено;
	
	//ДИТ Давудов М.А. US 64009 12.01.2024 Начало
	УстановитьПривилегированныйРежим(Истина);
	//ДИТ Давудов М.А. US 64009 12.01.2024 Конец
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СпрЭтрана", СсылкаDC);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Связь_ЭТРАН_DC_Сопоставление.СпрЭтрана КАК СпрЭтрана
	               |ИЗ
	               |	РегистрСведений.Связь_ЭТРАН_DC_Сопоставление КАК Связь_ЭТРАН_DC_Сопоставление
	               |ГДЕ
	               |	Связь_ЭТРАН_DC_Сопоставление.СпрДатакор = &СпрЭтрана";
	Ответ = запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.СпрЭтрана;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТрДокПоЭ_Накладной(э_Накладная) Экспорт
	
	Результат = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТранспортныйДокумент.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	               |ГДЕ
	               |	ТранспортныйДокумент.НакладнаяЭТРАН = &НакладнаяЭТРАН
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТранспортныйДокумент.Дата УБЫВ";
	Запрос.УстановитьПараметр("НакладнаяЭТРАН", э_Накладная);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//Евросиб Литвинов 28.06.2021 ( Ticket#0219692 #33382
Процедура Связь_ЭТРАН_DC_ПолучитьОбновитьДатуРаскредитации(МассивЖДН) Экспорт
	Для Каждого ЖДН Из МассивЖДН Цикл
		ПередаваемыйПараметр = Новый Структура;
		ПередаваемыйПараметр.Вставить("ЖДН", ЖДН);
		ПередаваемыйПараметр.Вставить("ИДНакладной", ?(СтрДлина(ЖДН.НакладнаяИД)>8,Формат(ЖДН.НакладнаяИД, "ЧГ="),Неопределено));
		ПередаваемыйПараметр.Вставить("НомерНакладной", ?(СтрДлина(ЖДН.НакладнаяНомер)>8,Неопределено,ЖДН.НакладнаяНомер));
		
		э_ОбщиеСервер.ПолучитьДатуРаскредитацииПоНакладной(ПередаваемыйПараметр);
	КонецЦикла;
КонецПроцедуры
//Евросиб Литвинов 28.06.2021 ) Ticket#0219692 #33382

