Функция ВнестиДанныеНакладныхВСделку(СписокНакладных, Сделка, ДобавитьВДоходы, ДобавитьВРасходы) Экспорт
	
	Если Сделка = ИСТИНА Тогда
		Сделка = СоздатьСлужебнуюСделкуДляНакладных();
	КонецЕсли;
	
	СделкаОбъект = Сделка.ПолучитьОбъект();
	
	// Евросиб Фролов (26.10.2021 Ticket№ 41408
	МассивСозданныхКТК = Новый Массив;
	// Евросиб Фролов)
	
	Для каждого Стр из СписокНакладных Цикл
		
		НСтр = СделкаОбъект.СвязьУчетныхЕдиниц.Добавить();
		
		КТКСсылка = РаботаСКонтейнерамиСервер.СоздатьКТК(Стр.Контейнер, Справочники.ТипоразмерыТЕ.ПустаяСсылка());
		НСтр.Контейнер = КТКСсылка;
		НСтр.РазмерКТК = КТКСсылка.ТипТЕ.РазмерКТК;
		
		НСтр.Груз = Справочники.Грузы.НайтиПоРеквизиту("ЕТСНГ", Стр.Груз.Код);
		
		ВагонСсылка = РаботаСКонтейнерамиСервер.ПолучитьВагонПоНомеру(Стр.Вагон, Истина);
		НСтр.Вагон = ВагонСсылка;
		
		//Евросиб - АСуслов 19.01.2022 10:17:57 #0257100
		//(
		РеквизитыЖДН = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Стр.ЖДН,"НакладнаяНомер, Дата, СтанцияОтправления, СтанцияНазначения");
		НСтр.НомерЖДН = РеквизитыЖДН.НакладнаяНомер; 
		//НСтр.ЖДН = ТранспортныеДокументы_сервер.НайтиТранспортныйДокумент(НСтр.НомерЖДН, НСтр.ДатаЖДН, Перечисления.ВидыОперацийТранспортныхДокументов.ЖДНакладная);		
		НСтр.ЖДН = ТранспортныеДокументы_сервер.НайтиТранспортныйДокумент(НСтр.НомерЖДН, РеквизитыЖДН.Дата, Перечисления.ВидыОперацийТранспортныхДокументов.ЖДНакладная);		
		
		СделкаОбъект.СтанцияОтправления = РеквизитыЖДН.СтанцияОтправления;
		СделкаОбъект.СтанцияНазначения = РеквизитыЖДН.СтанцияНазначения;
		//)
		//Евросиб - АСуслов 19.01.2022 10:17:57 #0257100
					
		НСтр.ПравилоГотовностиКВыставлению = Перечисления.ПравилоГотовностиКВыставлению.Вручную;
		НСтр.ВесГрузаНетто = Стр.ВесГруза;
		НСтр.Груженый = (НСтр.ВесГрузаНетто > 0);
		
		// Евросиб Фролов (26.10.2021 Ticket№ 41408
		МассивСозданныхКТК.Добавить(КТКСсылка);
		// Евросиб Фролов)
		
	КонецЦикла;
	
	// Евросиб Фролов (26.10.2021 Ticket№ 41408
	Если МассивСозданныхКТК.Количество() > 0 Тогда
		РаботаСКонтейнерамиСервер.ДобавитьИнформациюОбИсточникеСозднияКонтейнеров(МассивСозданныхКТК, НСтр("ru = 'АРМ ""Накладные""'"));
	КонецЕсли;	
	// Евросиб Фролов)
	
	Если СделкаОбъект.Рейсы.Количество() = 0 Тогда
		СделкаОбъект.Рейсы.Добавить().Рейс = Справочники.РейсыЖД.БезРейса;
	КонецЕсли;
	
	СделкаОбъект.Записать();
	Возврат СделкаОбъект.Ссылка;
	
КонецФункции

Функция ВнестиДанныеАкцептаВСделку(СписокВыбранныхСтрок, Сделка, ДобавитьВДоходы, ДобавитьВРасходы) Экспорт
	
	Если Сделка = ИСТИНА Тогда
		Сделка = СоздатьСлужебнуюСделкуДляНакладных();
	КонецЕсли;
	
	СделкаОбъект = Сделка.ПолучитьОбъект();
	
	РезультатРазнесения = новый Массив;
	
	Для каждого Стр из СписокВыбранныхСтрок Цикл
		
		СтрокаРасхода = СделкаОбъект.Расходы.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРасхода, Стр);
		СтрокаРасхода.ГУИД = Строка(Новый УникальныйИдентификатор());
		Если ТипЗнч(Стр.ТипВагонов) = Тип("СправочникСсылка.ТС") Тогда СтрокаРасхода.ТипВагонов = Стр.ТипВагонов.ТипТС; КонецЕсли;
		Если ТипЗнч(Стр.ТипКТК) = Тип("СправочникСсылка.ТЕ") Тогда СтрокаРасхода.ТипКТК = Стр.ТипКТК.ТипТЕ; КонецЕсли;
		СтрокаРасхода.ВнутренняяСебестоимость = НЕ ДобавитьВДоходы;
		СтрокаРасхода.Перевыставляемая = ДобавитьВДоходы;
		
		СтрокаРасхода.СебестоимостьИтого	= СтрокаРасхода.Себестоимость * СтрокаРасхода.Количество;
		СтрокаРасхода.СуммаНДС 				= БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СтрокаРасхода.СебестоимостьИтого, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СтрокаРасхода.СтавкаНДС), Истина, СтрокаРасхода.НДСВключенВСтоимость);
		СтрокаРасхода.СуммаИтого 			= СтрокаРасхода.СебестоимостьИтого + ?(СтрокаРасхода.НДСВключенВСтоимость, 0, СтрокаРасхода.СуммаНДС);
		
		Если ЗначениеЗаполнено(Стр.Контейнер) Тогда
			СтрокаКТК = СделкаОбъект.ДоходыКТК.Добавить();
			СтрокаКТК.ГУИД = СтрокаРасхода.ГУИД;
			СтрокаКТК.КТК = Стр.Контейнер;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.Вагон) Тогда
			СтрокаКТК = СделкаОбъект.ДоходыВагоны.Добавить();
			СтрокаКТК.ГУИД = СтрокаРасхода.ГУИД;
			СтрокаКТК.Вагон = Стр.Вагон;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.ТД) Тогда
			СтрокаКТК = СделкаОбъект.ДоходыТД.Добавить();
			СтрокаКТК.ГУИД = СтрокаРасхода.ГУИД;
			СтрокаКТК.ТД = Стр.ТД.НомерТранспортногоДокумента;
		КонецЕсли;
		
		РезультатРазнесения.Добавить(Новый Структура("ИсхНомерСтроки, Сделка, ГУИДРасходов", Стр.НомерИсходнойСтроки, Сделка, СтрокаРасхода.ГУИД));
		
		Если ДобавитьВДоходы Тогда
			
			СтрокаДохода = СделкаОбъект.Доходы.Добавить();
			//ДИТ, Беляев СЮ, ТА48688, 28-03-2022, начало 
			СтрокаДохода.ДатаПоявленияСтрокиЭкономики = ТекущаяДата();
			//ДИТ, Беляев СЮ, ТА48688, 28-03-2022, конец
			ЗаполнитьЗначенияСвойств(СтрокаДохода, Стр,,"Договор");
			СтрокаДохода.ГУИД = Строка(Новый УникальныйИдентификатор());
			Если ТипЗнч(Стр.ТипВагонов) = Тип("СправочникСсылка.ТС") Тогда СтрокаДохода.ТипВагонов = Стр.ТипВагонов.ТипТС; КонецЕсли;
			Если ТипЗнч(Стр.ТипКТК) = Тип("СправочникСсылка.ТЕ") Тогда СтрокаДохода.ТипКТК = Стр.ТипКТК.ТипТЕ; КонецЕсли;
			СтрокаДохода.Перевыставляемая = ДобавитьВДоходы;
			СтрокаДохода.Ставка = СтрокаДохода.Себестоимость;
			СтрокаДохода.РазмерКТК = СтрокаДохода.ТипКТК.РазмерКТК;
			
			Если ЗначениеЗаполнено(Стр.Контейнер) Тогда
				СтрокаКТК = СделкаОбъект.ДоходыКТК.Добавить();
				СтрокаКТК.ГУИД = СтрокаДохода.ГУИД;
				СтрокаКТК.КТК = Стр.Контейнер;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Стр.Вагон) Тогда
				СтрокаКТК = СделкаОбъект.ДоходыВагоны.Добавить();
				СтрокаКТК.ГУИД = СтрокаДохода.ГУИД;
				СтрокаКТК.Вагон = Стр.Вагон;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Стр.ТД) Тогда
				СтрокаКТК = СделкаОбъект.ДоходыТД.Добавить();
				СтрокаКТК.ГУИД = СтрокаДохода.ГУИД;
				СтрокаКТК.ТД = Стр.ТД.НомерТранспортногоДокумента;
			КонецЕсли;
			
			//Евросиб Каблов 01.04.2021 (
			//СтрСвязь = СделкаОбъект.СвязьДоходовИРасходов.Добавить();
			//СтрСвязь.Доходы = СтрокаДохода.ГУИД;
			//СтрСвязь.Расходы = СтрокаРасхода.ГУИД;
			
			ПараметрыОтбораСУЕ = Новый Структура;
			ПараметрыОтбораСУЕ.Вставить("Контейнер", Стр.ТД);
			ПараметрыОтбораСУЕ.Вставить("Вагон", Стр.Вагон);
			ПараметрыОтбораСУЕ.Вставить("Накладная", Стр.Накладная);
			ДобавитьСвязьДоходыРасходы(СделкаОбъект, СтрокаДохода.ГУИД, СтрокаРасхода.ГУИД, Неопределено, СтрокаДохода.Услуга, ПараметрыОтбораСУЕ);
			//Евросиб Каблов 01.04.2021 )
			
		КонецЕсли;
		
	КонецЦикла;
	
	
	СделкаОбъект.Записать();
	Возврат Новый Структура("Сделка, РезультатРазнесения", СделкаОбъект.Ссылка, РезультатРазнесения);
	
КонецФункции

//Евросиб Каблов 01.04.2021 
Функция ДобавитьСвязьДоходыРасходы(СделкаОбъект, ГУИДДоходы, ГУИДРасходы, Знач ГУИДСУЕ, Услуга, ПараметрыОтбораСУЕ) Экспорт
	
	Если Не ЗначениеЗаполнено(ГУИДСУЕ) Тогда
		
		ВсеПараметрыОтбора = Новый Структура;
		
		ЗначениеПараметра = Неопределено;
		Если ПараметрыОтбораСУЕ.Свойство("Контейнер", ЗначениеПараметра) И ЗначениеЗаполнено(ЗначениеПараметра) Тогда
			ВсеПараметрыОтбора.Вставить("Контейнер", ЗначениеПараметра);
		КонецЕсли;
		
		Если ПараметрыОтбораСУЕ.Свойство("Вагон", ЗначениеПараметра) И ЗначениеЗаполнено(ЗначениеПараметра) Тогда
			ВсеПараметрыОтбора.Вставить("Вагон", ЗначениеПараметра);
		КонецЕсли;
		
		Если ПараметрыОтбораСУЕ.Свойство("Накладная", ЗначениеПараметра) И ЗначениеЗаполнено(ЗначениеПараметра) Тогда
			ВсеПараметрыОтбора.Вставить("Накладная", ЗначениеПараметра);
		КонецЕсли;
				
		ПараметрыОтбора = ОбщегоНазначенияКлиентСервер.СкопироватьРекурсивно(ВсеПараметрыОтбора);		
		Если ПараметрыОтбора.Количество() > 0 Тогда
		
			НайденныеСтроки = СделкаОбъект.СвязьУчетныхЕдиниц.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() > 0 Тогда
				ГУИДСУЕ = НайденныеСтроки[0].ГУИД;
			КонецЕсли;			
		
		КонецЕсли; 
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГУИДДоходы) Тогда
		//Евросиб - АСуслов 21.09.2021 18:13:02 #
		//(
		//СделкаОбъект.СвязатьДоходыРасходыСУЕ(ГУИДДоходы, Неопределено, ГУИДСУЕ, Услуга);
		Документы.Сделка.СвязатьДоходыРасходыСУЕ(СделкаОбъект, ГУИДДоходы, Неопределено, ГУИДСУЕ, Услуга);
		//)
		//Евросиб - АСуслов 21.09.2021 18:13:03 #
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГУИДРасходы) Тогда
		Документы.Сделка.СвязатьДоходыРасходыСУЕ(СделкаОбъект, Неопределено, ГУИДРасходы, ГУИДСУЕ, Услуга);
	КонецЕсли;
	
КонецФункции

Функция СоздатьСлужебнуюСделкуДляНакладных(ТипЗаказа = неопределено) Экспорт
	
	Если ТипЗаказа = неопределено Тогда
		ТипЗаказа = Справочники.ТипыЗаказов.КонтейнерныйПоезд;
	КонецЕсли;
	
	НДок = Документы.Сделка.СоздатьДокумент();
	НДок.Заполнить(неопределено);
	НДок.ТипЗаказа = ТипЗаказа;
	НДок.СтанцияОтправления = Справочники.Локации.ВСЕ;
	НДок.СтанцияНазначения = Справочники.Локации.ВСЕ;
	НДок.Дата = ТекущаяДата();
	Ндок.Рейсы.Добавить().Рейс = Справочники.РейсыЖД.БезРейса;
	//Евросиб Каблов 10.03.2021 (
	НДок.Служебная = Истина;
	//Евросиб Каблов 10.03.2021 )
	НДок.Записать(РежимЗаписиДокумента.Проведение);
	Возврат НДок.Ссылка;
	
КонецФункции

Функция ПолучитьСуммуНакладнойПоПараметрам(э_Накладная, Вагон, Контейнер) Экспорт
	
	Результат = 0;
	
	Если Результат = 0 Тогда
		Для каждого Стр из э_Накладная.ПровозныеПлатежиИСборыПоОтправлению Цикл
			Если (НЕ ЗначениеЗаполнено(Стр.НомерВагона) ИЛИ Стр.НомерВагона = Строка(Вагон)) И (НЕ ЗначениеЗаполнено(Стр.НомерКонтейнера) ИЛИ Стр.НомерКонтейнера = Строка(Контейнер)) Тогда Результат = Результат + Стр.СуммаВРублях; КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Результат = 0 Тогда
		Для каждого Стр из э_Накладная.ПровозныеПлатежиИСборыПоПрибытию Цикл
			Если (НЕ ЗначениеЗаполнено(Стр.НомерВагона) ИЛИ Стр.НомерВагона = Строка(Вагон)) И (НЕ ЗначениеЗаполнено(Стр.НомерКонтейнера) ИЛИ Стр.НомерКонтейнера = Строка(Контейнер)) Тогда Результат = Результат + Стр.СуммаВРублях; КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Результат = 0 Тогда
		Для каждого Стр из э_Накладная.ПровозныеПлатежиИСборыПоВходу Цикл
			Если (НЕ ЗначениеЗаполнено(Стр.НомерВагона) ИЛИ Стр.НомерВагона = Строка(Вагон)) И (НЕ ЗначениеЗаполнено(Стр.НомерКонтейнера) ИЛИ Стр.НомерКонтейнера = Строка(Контейнер)) Тогда Результат = Результат + Стр.СуммаВРублях; КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПодборВСделкиНакладныеПослеГруженого() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПотребностьПоискаНакладнойПослеГруженогоПлечаОстатки.Сделка КАК Сделка
	               |ИЗ
	               |	РегистрНакопления.ПотребностьПоискаНакладнойПослеГруженогоПлеча.Остатки КАК ПотребностьПоискаНакладнойПослеГруженогоПлечаОстатки
	               |ГДЕ
	               |	ПотребностьПоискаНакладнойПослеГруженогоПлечаОстатки.ПоискОстаток > 0";
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		СделкаОбъект = Ответ.Сделка.ПолучитьОбъект();
		РЕЗЗапуска = СделкаОбъект.ПодобратьНакладныеВСделку(40);
		Если РЕЗЗапуска = 1 Тогда		
			Попытка
				СделкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ОО = ОписаниеОшибки();
				Сообщить("Ошибка: " + ОО, СтатусСообщения.ОченьВажное);
				ЗаписьЖурналаРегистрации("ОшибкаЗаписиСделки",УровеньЖурналаРегистрации.Ошибка,Метаданные.Документы.Сделка, Ответ.Сделка,ОО);
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьНомераТДдляНакладных(СписокНакладных) Экспорт
	
	Результат = Новый Соответствие;
	
	РазрешенныеКВыборкеДокументыИД = Новый Массив;
	РазрешенныеКВыборкеДокументыИД.Добавить(1323); // Электронная транзитная декларация (ЭТД)
	РазрешенныеКВыборкеДокументыИД.Добавить(1204); // Транзитная декларация (ТД)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	э_НакладнаяПрилагаемыеДокументы.НомерДокумента КАК НомерДокумента,
	               |	ТранспортныйДокумент.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.э_Накладная.ПрилагаемыеДокументы КАК э_НакладнаяПрилагаемыеДокументы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	               |		ПО э_НакладнаяПрилагаемыеДокументы.Ссылка = ТранспортныйДокумент.НакладнаяЭТРАН
	               |ГДЕ
	               |	ТранспортныйДокумент.Ссылка В(&Ссылка)
	               |	И э_НакладнаяПрилагаемыеДокументы.ПрилагаемыеДокументыИД В(&ПрилагаемыеДокументыИД)";
	Запрос.УстановитьПараметр("Ссылка", СписокНакладных);
	Запрос.УстановитьПараметр("ПрилагаемыеДокументыИД", РазрешенныеКВыборкеДокументыИД);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		Результат.Вставить(Ответ.Ссылка, Ответ.НомерДокумента);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// SIV 29-04-21 Фоновое задание ищет и очищает недействительные накладные по сделкам, рисует задачи, пишет комментарии и т.п.
Процедура ОчисткаАннулированныхНакладныхИзСделок() Экспорт
	
//	1. По настраиваемому расписанию запускается и выполняет алгоритм;
//2. Для Груженой ЖДН выполняет следующее:
//2.1. Ищет прописанные в составе поезда груженые ЖДН с недействительным статусом (не только аннулировано, а с ЛЮБЫМ недействительным. Например, «Сторнировано по назначению»). 
// Удаляет ее из состава поезда. Пытается найти вместо нее действительную.
//2.1.1. Если замена нашлась и она отличается по реквизитам из Отгрузочной информации от предыдущей И по этой накладной уже есть РТУ, то помечать такие строки светло-желтым и ставить задачу менеджеру Ответственному за сделку от бэк-офиса на проверку документов. Написать комментарий, какие конкретно значения поменялись, чтобы человек понял, в чем проблема.
//2.1.2. Если замена нашлась и она не отличается по реквизитам отгрузочной информации от предыдущей, то никаких задач не ставить и никак не помечать эту строчку. Заменили и заменили.
//2.1.3. Если замена не нашлась, то помечать такие строки светло-красным и ставить задачу ответственному менеджеру за сделку от ОРК на подбор накладной. После подбора действуем по сценарию 2.1.1.
//3. Для всех прочих накладных (а именно этих пяти: подсыл вагона под подсыл ктк, подсыл КТК, подсыл вагона, накладная на возврат вагона, накладная на возврат КТК) выполнять алгоритм 2.1 без проверки разницы с предыдущей и без выдачи заданий. Просто заменяем номера и ссылки этих накладных молча. Если же замены нет, то хотя бы удаляем накладную, которая висит аннулированной.
//4. Вопрос к Александру: как система будет работать с расходами, по которым привязан акцепт к удаленной строке подсыльной накладной. Т.е. была накладная подсыла, сделали акцепт, потом накладная удаляется. Что произойдет? Как не потерять привязанные расходы?

	Сообщить("Начало: " + ТекущаяДата());
	
	// Евросиб Фролов (03.03.2022
	МассивСообщений = Новый Массив;
	// Евросиб Фролов)
	
	ОбрРаботыСАннЖДН = Обработки.РаботаСАннулированнымиЖДН.Создать();
	ДОК = ТекущаяДата();
	ДНА = ДобавитьМесяц(ДОК, -12);
	//ДИТ Авдеева В.С. 47101 29.09.2022 Начало
	//ТаблицаВсехАннулированныхЖДН = ОбрРаботыСАннЖДН.ПолучитьВсеАннулированныеЖДНВСделках(ДНА, ДОК);
	ТаблицаВсехАннулированныхЖДН = ОбрРаботыСАннЖДН.ПолучитьВсеАннулированныеЖДНВСделках(ДНА, ДОК, Истина);
	//ДИТ Авдеева В.С. 47101 29.09.2022 Конец
	
	МассивУникальныхСделок = Новый Массив;
	Для каждого Стр из ТаблицаВсехАннулированныхЖДН Цикл
		Если МассивУникальныхСделок.Найти(Стр.Сделка) = неопределено Тогда
			МассивУникальныхСделок.Добавить(Стр.Сделка);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого УнСделка из МассивУникальныхСделок Цикл
		
		СделкаО = УнСделка.ПолучитьОбъект();
		
		СоответствиеУдаленныхЖДНГруж = Новый Соответствие;
		СоответствиеВозвратныхВагон = Новый Соответствие;
		СоответствиеВозвратныхКТК = Новый Соответствие;
		СоответствиеЖДНПодсылаКТК = Новый Соответствие;
		СоответствиеЖДНПодсылаВагонаПодКТК = Новый Соответствие;
		СоответствиеЖДНПодсылаВагоны = Новый Соответствие;
		
		Для каждого Стр из ТаблицаВсехАннулированныхЖДН Цикл
			
			// Груженые (ЖДН)
			Если Стр.Сделка = УнСделка И ЗначениеЗаполнено(Стр.ЖДНГруженая) И Стр.ЖДНГруженаяДействующая = Ложь Тогда
				Для каждого СтрСоставПоезда из СделкаО.СвязьУчетныхЕдиниц Цикл
					Если СтрСоставПоезда.ЖДН = Стр.ЖДНГруженая Тогда
						СоответствиеУдаленныхЖДНГруж.Вставить(Стр.ГУИДСоставПоезда, Стр.ЖДНГруженая);
						СтрСоставПоезда.ЖДН = неопределено;
						СтрСоставПоезда.НомерЖДН = неопределено;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			// Возвратные на вагоны (НакладнаяПослеГруженогоПлеча)
			Если Стр.Сделка = УнСделка И ЗначениеЗаполнено(Стр.ЖДНПослеГруж) И Стр.ЖДНПослеГружДействующая = Ложь Тогда
				Для каждого СтрСоставПоезда из СделкаО.СвязьУчетныхЕдиниц Цикл
					Если СтрСоставПоезда.НакладнаяПослеГруженогоПлеча = Стр.ЖДНПослеГруж Тогда
						СоответствиеВозвратныхВагон.Вставить(Стр.ГУИДСоставПоезда, Стр.ЖДНПослеГруж);
						СтрСоставПоезда.НакладнаяПослеГруженогоПлеча = неопределено;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			// Возвратные на КТК (НакладнаяПослеГружКТК)
			Если Стр.Сделка = УнСделка И ЗначениеЗаполнено(Стр.ЖДНПослеГружКТК) И Стр.ЖДНПослеГружКТКДействующая = Ложь Тогда
				Для каждого СтрСоставПоезда из СделкаО.СвязьУчетныхЕдиниц Цикл
					Если СтрСоставПоезда.НакладнаяПослеГружКТК = Стр.ЖДНПослеГружКТК Тогда
						СоответствиеВозвратныхВагон.Вставить(Стр.ГУИДСоставПоезда, Стр.ЖДНПослеГружКТК);
						СтрСоставПоезда.НакладнаяПослеГружКТК = неопределено;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			// Подсыл КТК (ПорожняяЖДНКТК)
			Если Стр.Сделка = УнСделка И ЗначениеЗаполнено(Стр.ЖДНПодсылКТК) И Стр.ЖДНПодсылКТКДействующая = Ложь Тогда
				Для каждого СтрСоставПоезда из СделкаО.СвязьУчетныхЕдиниц Цикл
					Если СтрСоставПоезда.НомерПорожнейЖДНКТК = Стр.ЖДНПодсылКТК.НакладнаяЭТРАН.НакладнаяНомер Тогда
						СоответствиеВозвратныхВагон.Вставить(Стр.ГУИДСоставПоезда, Стр.ЖДНПодсылКТК);
						СтрСоставПоезда.НомерПорожнейЖДНКТК = неопределено;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			// Подсыл вагона (ВагоннаяЖДН)  
			//ДИТ Авдеева В.С. 47101 29.09.2022 Начало
			//Если Стр.Сделка = УнСделка И ЗначениеЗаполнено(Стр.ЖДНПодсылВагона) И Стр.ЖДНПодсылВагонаДействующая = Ложь Тогда
			Если Стр.Сделка = УнСделка И (ЗначениеЗаполнено(Стр.ЖДНПодсылВагона) 
				И Стр.ЖДНПодсылВагонаДействующая = Ложь 
					Или Стр.ОчищатьВагоннуюЖДН = Истина) Тогда
			//ДИТ Авдеева В.С. 47101 29.09.2022 Конец
				Для каждого СтрСоставПоезда из СделкаО.СвязьУчетныхЕдиниц Цикл
					//ДИТ Авдеева В.С. 47101 29.09.2022 Начало  
					//Если СтрСоставПоезда.НомерВагоннойЖДН = Стр.ЖДНПодсылВагона.НакладнаяЭТРАН.НакладнаяНомер Тогда 
					Если Стр.ОчищатьВагоннуюЖДН И СтрСоставПоезда.НомерВагоннойЖДН = Стр.НомерВагоннойЖДН
						Или ЗначениеЗаполнено(Стр.ЖДНПодсылВагона) И 
						СтрСоставПоезда.НомерВагоннойЖДН = Стр.ЖДНПодсылВагона.НакладнаяЭТРАН.НакладнаяНомер Тогда 
					//ДИТ Авдеева В.С. 47101 29.09.2022 Конец  
						   
						 
						СоответствиеВозвратныхВагон.Вставить(Стр.ГУИДСоставПоезда, Стр.ЖДНПодсылВагона);
						СтрСоставПоезда.НомерВагоннойЖДН = неопределено;
						//ДИТ Авдеева В.С. 47101 29.09.2022 Начало
						Если Стр.ОчищатьВагоннуюЖДН Тогда
							СтрСоставПоезда.ВагоннаяЖДН = неопределено;
						КонецЕсли;
						//ДИТ Авдеева В.С. 47101 29.09.2022 Конец
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			// Подсыл вагона под КТК (ПорожняяВагоннаяЖДН)
			Если Стр.Сделка = УнСделка И ЗначениеЗаполнено(Стр.ЖДНПодсылВагонаПодКТК) И Стр.ЖДНПодсылВагонаПодКТКДействующая = Ложь Тогда
				Для каждого СтрСоставПоезда из СделкаО.СвязьУчетныхЕдиниц Цикл
					Если СтрСоставПоезда.НомерПорожнейВагоннойЖДН = Стр.ЖДНПодсылВагонаПодКТК.НакладнаяЭТРАН.НакладнаяНомер Тогда
						СоответствиеВозвратныхВагон.Вставить(Стр.ГУИДСоставПоезда, Стр.ЖДНПодсылВагонаПодКТК);
						СтрСоставПоезда.НомерПорожнейВагоннойЖДН = неопределено;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		
		// Евросиб Фролов (03.03.2022
		//СделкаО.ПодобратьНакладныеВСделку();
		РаботаСоСделкамиСервер.ПодобратьНакладныеВСделку(СделкаО,, МассивСообщений);	
		// Евросиб Фролов)
		
		// груженые ЖДН
		Для каждого Стр из СоответствиеУдаленныхЖДНГруж Цикл
			
			ПредрешенноеСостояние = неопределено;
			КомментарийЗаменыЖДН = "";
			НайдСтрСделки = СделкаО.СвязьУчетныхЕдиниц.Найти(Стр.Ключ, "ГУИД");
			Если НайдСтрСделки <> неопределено И ЗначениеЗаполнено(НайдСтрСделки.ЖДН) Тогда
				// Вариант - замена накладной обнаружена
				НайдСтрСделки.КомментарийЗаменыЖДН = ЕстьРазницаВНакладных(Стр.Значение, НайдСтрСделки.ЖДН);
				Если НайдСтрСделки.КомментарийЗаменыЖДН = "" ИЛИ ЖДННеСодержитсяВВыставленныхДоходах(СделкаО, Стр.Значение) Тогда
					// Вариант - накладные идентичны
					// В этом варианте ничего не делаем, т.к. никто не заметит подмены
				Иначе
					// Вариант - накладные отличаются
					ПредрешенноеСостояние = Справочники.Состояния.ЖДНЗамененаПроверитьРТУ;
					НайдСтрСделки.ЖДНГруженаяЗаменена = Истина;
				КонецЕсли;
			Иначе
				// Вариант - замены для удаленной накладной не нашлось
				ПредрешенноеСостояние = Справочники.Состояния.ЖДНАннулированаПодобратьЗамену;
				НайдСтрСделки.ЖДНГруженаяУдаленаИНеЗаменена = Истина;
			КонецЕсли;
			Если ПредрешенноеСостояние <> неопределено Тогда
				НайдСтр = СделкаО.Состояния.Найти(ПредрешенноеСостояние, "Состояние");
				Если НайдСтр = неопределено Тогда
					НСтрСостояния = СделкаО.Состояния.Добавить();
					НСтрСостояния.Состояние = ПредрешенноеСостояние;
					НСтрСостояния.Статус = Перечисления.СтатусыЭтапов.ВРаботе;
					// Евросиб Фролов (04.03.2022 Ticket №0262470
					// Если ЖДН очищается, то задачу нужно сразу закрыть.
					Если НайдСтрСделки <> Неопределено И Не ЗначениеЗаполнено(НайдСтрСделки.ЖДН) Тогда
						НСтрСостояния.Статус = Перечисления.СтатусыЭтапов.Выполнен;	
					КонецЕсли;	
					// Евросиб Фролов)					
					НСтрСостояния.Комментарий = КомментарийЗаменыЖДН;
					// ДИТ US 51951 TA 61497 Евсенкин М.А. 28.11.2022 
					//Ответственный = ?(СделкаО.КомуСтавитсяЗадачаПоДокументам = 0, СделкаО.ЕдиныйОтветственныйОтУчета, НайдСтрСделки.Договор.ОтветственныйЗаУчет);
					СтруктураПараметров = Новый Структура;
					СтруктураПараметров.Вставить("Договор",				НайдСтрСделки.Договор);
					СтруктураПараметров.Вставить("ЦФО",					Справочники.ЦентрыФинансовойОтветственности.ОсновнойЦФО);
					СтруктураПараметров.Вставить("ТипОтветственного",	Перечисления.ТипыОтветственных.ОтветственныйЗаУчет);  
					ОтветственныйЗаУчет = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственного(СтруктураПараметров);
					 
					Ответственный = ?(СделкаО.КомуСтавитсяЗадачаПоДокументам = 0, СделкаО.ЕдиныйОтветственныйОтУчета, ОтветственныйЗаУчет);
					// ДИТ US 51951 TA 61497 Евсенкин М.А. 28.11.2022
					НСтрСостояния.Исполнитель = ?(ПредрешенноеСостояние = Справочники.Состояния.ЖДНАннулированаПодобратьЗамену, СделкаО.ЕдиныйОтветственныйОтОРК, Ответственный);
					НСтрСостояния.Наблюдатель = НСтрСостояния.Исполнитель;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		Попытка
			СделкаО.УстановитьКомментарийВерсииИсторииДанных("Очистка аннулированных накладных (ОчисткаАннулированныхНакладныхИзСделок)");
			СделкаО.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОО = ОписаниеОшибки();
			// Евросиб Фролов (03.03.2022
			// Сообщения в рег. заданиях некуда посылать
			//Сообщить("Ошибка по сделке: " + СделкаО.Ссылка);
			//Сообщить(ОО);
			ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); 
			МассивСообщений.Добавить("Ошибка при проведении сделки. " + СделкаО.Ссылка + ": " + ПредставлениеОшибки);
			ЗаписьЖурналаРегистрации("ОчисткаАннулированныхНакладных.Проведение сделки",
    			УровеньЖурналаРегистрации.Ошибка,, УнСделка.Ссылка, ПредставлениеОшибки);
			// Евросиб Фролов)	
		КонецПопытки;
		
	КонецЦикла;
	
	// Евросиб Фролов (03.03.2022
	Если МассивСообщений.Количество() > 0 Тогда
		Тема = "Рег. задание: Очистка аннулированных накладных из сделок";
		ТекстСообщения = "Ошибки и уведомления при выполнении рег. задания:
						|" + СтрСоединить(МассивСообщений, Символы.ПС);
		ВыполнитьОтправкуУведомлений(Тема, ТекстСообщения, Метаданные.РегламентныеЗадания.ОчисткаАннулированныхНакладныхИзСделок);
	КонецЕсли;
	// Евросиб Фролов)
	
	Сообщить("Окончание: " + ТекущаяДата());
	
КонецПроцедуры

Функция ЕстьРазницаВНакладных(Знач Накл1, Знач Накл2)
	
	Результат = "";
	
	// 1. НомерЖДН
	// 2. Вагон
	// 3. Груз
	// 4. Станция отправления
	// 5. Станция назначения
	// 6. Дата раскредитации
	
	Накл1 = ?(ТипЗнч(Накл1) = Тип("ДокументСсылка.ТранспортныйДокумент"), Накл1.НакладнаяЭТРАН, Накл1);
	Накл2 = ?(ТипЗнч(Накл2) = Тип("ДокументСсылка.ТранспортныйДокумент"), Накл2.НакладнаяЭТРАН, Накл2);
	
	НомерЖДН_1 = Накл1.НакладнаяНомер;
	НомерЖДН_2 = Накл2.НакладнаяНомер;
	Вагон_1 = ?(Накл1.Вагоны.Количество() > 0, Накл1.Вагоны[0].НомерВагона, "");
	Вагон_2 = ?(Накл2.Вагоны.Количество() > 0, Накл2.Вагоны[0].НомерВагона, "");
	Груз_1 = ?(Накл1.ГрузыЖД.Количество() > 0, Накл1.ГрузыЖД[0].НаименованиеГруза, "");
	Груз_2 = ?(Накл2.ГрузыЖД.Количество() > 0, Накл2.ГрузыЖД[0].НаименованиеГруза, "");
	СтОтправления_1 = Накл1.СтанцияОтправленияКод;
	СтОтправления_2 = Накл2.СтанцияОтправленияКод;
	СтНазначения_1 = Накл1.СтанцияНазначенияКод;
	СтНазначения_2 = Накл2.СтанцияНазначенияКод;
	ДатаРаскр_1 = НачалоДня(Накл1.ДатаИВремяРаскредитованияГруза);
	ДатаРаскр_2 = НачалоДня(Накл2.ДатаИВремяРаскредитованияГруза);
	
	Если НомерЖДН_1 <> НомерЖДН_2 Тогда Результат = Результат + ?(Результат = "", "", "; ") + "ЖДН1: " + НомерЖДН_1 + " ЖДН2: " + НомерЖДН_2 КонецЕсли;
	Если Вагон_1 <> Вагон_2 Тогда Результат = Результат + ?(Результат = "", "", "; ") + "Вагон1: " + Вагон_1 + " Вагон2: " + Вагон_2 КонецЕсли;
	Если Груз_1 <> Груз_2 Тогда Результат = Результат + ?(Результат = "", "", "; ") + "Груз1: " + Груз_1 + " Груз2: " + Груз_2 КонецЕсли;
	Если СтОтправления_1 <> СтОтправления_2 Тогда Результат = Результат + ?(Результат = "", "", "; ") + "Ст. отпр1: " + СтОтправления_1 + " Ст. отпр2: " + СтОтправления_2 КонецЕсли;
	Если СтНазначения_1 <> СтНазначения_2 Тогда Результат = Результат + ?(Результат = "", "", "; ") + "Ст. назн1: " + СтНазначения_1 + " Ст. назн2: " + СтНазначения_2 КонецЕсли;
	Если ДатаРаскр_1 <> ДатаРаскр_2 Тогда Результат = Результат + ?(Результат = "", "", "; ") + "Дата раскр.1: " + ДатаРаскр_1 + " Дата раскр.2: " + ДатаРаскр_2 КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

Функция ЖДННеСодержитсяВВыставленныхДоходах(СделкаО, ЖДН)
	
	НеСодержится = Истина;
	
	Для каждого СтрДоходы из СделкаО.Доходы Цикл
		Если ЗначениеЗаполнено(СтрДоходы.УчДокумент) ТОгда
			СтрТД = СделкаО.ДоходыТД.Найти(СтрДоходы.ГУИД, "ГУИД");
			Если СтрТД <> неопределено И Найти(СтрТД.ТД, ЖДН.Номер) <> неопределено Тогда
				НеСодержится = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НеСодержится;
	
КонецФункции

//Функция ПолучитьСписокФильтрующихсяНакладных() Экспорт
//	
//	Результат = Новый Массив;
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	НастройкаПодбораНакладных.ВидНакладной КАК ВидНакладной
//	               |ИЗ
//	               |	РегистрСведений.НастройкаПодбораНакладных КАК НастройкаПодбораНакладных
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	НастройкаПодбораНакладных.ВидНакладной
//	               |
//	               |ИМЕЮЩИЕ
//	               |	СУММА(1) > 0";
//	Ответ = Запрос.Выполнить().Выбрать();
//	Пока Ответ.Следующий() Цикл
//		Результат.Добавить(Ответ.ВидНакладной);
//	КонецЦикла;
//	
//	Возврат Результат;
//	
//КонецФункции

Функция ПривестиНакладнуюК_Э_Накладной(Знач э_Накладная) Экспорт
	
	Если ТипЗнч(э_Накладная) = Тип("ДокументСсылка.ТранспортныйДокумент") Тогда
		э_Накладная = э_Накладная.НакладнаяЭТРАН;
	ИначеЕсли ТипЗнч(э_Накладная) = Тип("Строка") Тогда
		э_Накладная = РаботаСКонтейнерамиСервер.ПолучитьНакладнуюЭТРАН(э_Накладная, Истина);
	КонецЕсли;
	
	Возврат э_Накладная;
	
КонецФункции

//Функция НакладнаяСоответствуетПравилам(Знач э_Накладная, ВидНакладной) Экспорт
//	
//	Результат = Истина;
//	
//	э_Накладная = ПривестиНакладнуюК_Э_Накладной(э_Накладная);
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	НастройкаПодбораНакладных.СтанцияОтправления КАК СтанцияОтправления,
//	               |	НастройкаПодбораНакладных.СтанцияНазначения КАК СтанцияНазначения,
//	               |	НастройкаПодбораНакладных.ВидНакладной КАК ВидНакладной,
//	               |	НастройкаПодбораНакладных.Действие КАК Действие
//	               |ИЗ
//	               |	РегистрСведений.НастройкаПодбораНакладных КАК НастройкаПодбораНакладных
//	               |ГДЕ
//	               |	НастройкаПодбораНакладных.ВидНакладной = &ВидНакладной";
//	Запрос.УстановитьПараметр("ВидНакладной", ВидНакладной);
//	Табл = Запрос.Выполнить().Выгрузить();
//	
//	РежимЯвногоЗапрета = Истина;
//	НакладнаяСоответствует = Истина;
//	
//	Если Табл.Количество() > 0 Тогда 
//		
//		КодСтОтпр5Символов = Лев(э_Накладная.СтанцияОтправленияКод, 5);
//		КодСтНазн5Символов = Лев(э_Накладная.СтанцияНазначенияКод, 5);
//		
//		Для каждого Стр из Табл Цикл
//			
//			Если Стр.Действие = Перечисления.НастройкаПодбораНакладных_Действие.Разрешить Тогда
//				РежимЯвногоЗапрета = Ложь;
//			КонецЕсли;
//			
//			Если ЗначениеЗаполнено(Стр.СтанцияОтправления) Тогда
//				НакладнаяСоответствует = НакладнаяСоответствует И КодСтОтпр5Символов = Лев(Стр.СтанцияОтправления.КодЖДСтанции, 5);
//			КонецЕсли;
//			
//			Если ЗначениеЗаполнено(Стр.СтанцияНазначения) Тогда
//				НакладнаяСоответствует = НакладнаяСоответствует И КодСтНазн5Символов = Лев(Стр.СтанцияНазначения.КодЖДСтанции, 5);
//			КонецЕсли;
//			
//		КонецЦикла;
//		
//		Если (РежимЯвногоЗапрета = Истина И НакладнаяСоответствует = Истина) ИЛИ (РежимЯвногоЗапрета = Ложь И НакладнаяСоответствует = Ложь) Тогда
//			Результат = Ложь;
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//	Возврат Результат;
//	
//КонецФункции

//Евросиб Каблов 06.09.2021 Ticket#0237622
Процедура ДобавитьСтрокиРасходовВСделку(СделкаОбъект, ТаблицаДанных, ДанныеИзСП = Ложь) Экспорт
	
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
	МассивИдентификаторовГруппировкиКорректировокВР = Новый Массив;
	МассивГУИДРасходовПеревязатьНаСтрокиКорректировки = Новый Массив;
	ЕстьКолонкаИдентификаторСтрокиДоходовВСделкеКорректируемый = Ложь;
	Если ТипЗнч(ТаблицаДанных) = Тип("Массив") И ТаблицаДанных.Количество() > 0 Тогда
		//Евросиб Каблов 18.08.2025 ( #117204
		//ТабЗначений = ТаблицаДанных[0].Владелец();
		//ЕстьКолонкаИдентификаторСтрокиДоходовВСделкеКорректируемый = ТабЗначений.Колонки.Найти("ИдентификаторСтрокиДоходовВСделкеКорректируемый") <> Неопределено;
		СтрокаТаблицыДанных = ТаблицаДанных[0];
		Если ТипЗнч(СтрокаТаблицыДанных) = Тип("СтрокаТаблицыЗначений") Тогда
			ТабЗначений = ТаблицаДанных[0].Владелец();
			ЕстьКолонкаИдентификаторСтрокиДоходовВСделкеКорректируемый = ТабЗначений.Колонки.Найти("ИдентификаторСтрокиДоходовВСделкеКорректируемый") <> Неопределено;
		ИначеЕсли ТипЗнч(СтрокаТаблицыДанных) = Тип("Структура") Тогда
			ЕстьКолонкаИдентификаторСтрокиДоходовВСделкеКорректируемый = СтрокаТаблицыДанных.Свойство("ИдентификаторСтрокиДоходовВСделкеКорректируемый");
		КонецЕсли;
		//Евросиб Каблов 18.08.2025 )
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
	
	Для каждого Стр из ТаблицаДанных Цикл
		
		// Евросиб US 83437 TA 83438 Рыбьяков К.А. 03.07.2024 ((
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Стр, "ДанныеИзСП") Тогда
			ДанныеИзСП = Стр.ДанныеИзСп;
		КонецЕсли; 
		// Евросиб Рыбьяков К.А. 03.07.2024 ))
		
		Если Стр.Доходы = Истина Тогда
			
			НДоходы = неопределено;
			Для каждого ДСтр из СделкаОбъект.Доходы Цикл
				Если ДСтр.ГУИД = Стр.ГУИДСтрокиДоходов Тогда НДоходы = ДСтр; Прервать; КонецЕсли;
			КонецЦикла;
			
			Если НДоходы = неопределено Тогда
				НДоходы = СделкаОбъект.Доходы.Добавить();
				//ДИТ, Беляев СЮ, ТА48688, 28-03-2022, начало 
				НДоходы.ДатаПоявленияСтрокиЭкономики = ТекущаяДата();
				//ДИТ, Беляев СЮ, ТА48688, 28-03-2022, конец  
								
				ЗаполнитьЗначенияСвойств(НДоходы, Стр, "Клиент, Договор, Услуга, Калькуляция, Себестоимость, Вознаграждение, Ставка, Количество, СебестоимостьИтого, ВознаграждениеИтого, СтавкаИтого, Рентабельность, СтавкаНДС, СуммаНДС, НДСВключенВСтоимость, СуммаИтого, Груз, РазмерКТК, Валюта, Перевыставляемая, НоменклатурнаяГруппа, ПСЦ, Подсыл, Комментарий, НеВыставлятьКлиенту, УслугаВнеСтавки, ПроцентВознаграждения, СтавкаНДСВознаграждения, ВознаграждениеВключаетНДС, ЕдиницаИзмерения, ИсточникПоявленияСтрокиЭкономики");
				нДоходы.ГотовоКВыставлению = Истина;
				
				Если СделкаОбъект.СтанцияОтправления = Справочники.Локации.ВСЕ Тогда
					СделкаОбъект.СтанцияОтправления = Стр.ПунктОтправления;
					СделкаОбъект.СтанцияНазначения = Стр.ПунктНазначения;
				КонецЕсли;
				
				//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
				Если ЕстьКолонкаИдентификаторСтрокиДоходовВСделкеКорректируемый И ЗначениеЗаполнено(Стр.ИдентификаторСтрокиДоходовВСделкеКорректируемый) Тогда
						НДоходы.ГУИДИсправляемойСтроки = Стр.ИдентификаторСтрокиДоходовВСделкеКорректируемый;
						СтрокаДоходаИсправляемая = СделкаОбъект.Доходы.Найти(НДоходы.ГУИДИсправляемойСтроки,"ГУИД");
						Если Стр.ВидОперацииКорректировки = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
							НДоходы.Себестоимость = СтрокаДоходаИсправляемая.Себестоимость + Стр.Себестоимость;
							НДоходы.СебестоимостьИтого = СтрокаДоходаИсправляемая.СебестоимостьИтого + Стр.СебестоимостьИтого;
							НДоходы.Ставка = СтрокаДоходаИсправляемая.Ставка + Стр.Ставка;
							НДоходы.СтавкаИтого = СтрокаДоходаИсправляемая.СтавкаИтого + Стр.СтавкаИтого;
							НДоходы.СуммаИтого = СтрокаДоходаИсправляемая.СуммаИтого + Стр.СуммаИтого;
							НДоходы.СуммаНДС = СтрокаДоходаИсправляемая.СуммаНДС + Стр.СуммаНДС;
						Иначе
							НДоходы.Себестоимость = Стр.Себестоимость;
							НДоходы.СебестоимостьИтого = Стр.СебестоимостьИтого;
							НДоходы.Ставка = Стр.Ставка;
							НДоходы.СтавкаИтого = Стр.СтавкаИтого;
							НДоходы.СуммаИтого = Стр.СуммаИтого;
							НДоходы.СуммаНДС = Стр.СуммаНДС;
							МассивГУИДРасходовПеревязатьНаСтрокиКорректировки.Добавить(Стр.ГУИДРасходов);
						КонецЕсли;
						НДоходы.ПроцентВознаграждения = СтрокаДоходаИсправляемая.ПроцентВознаграждения;
						НДоходы.СтавкаНДСВознаграждения = СтрокаДоходаИсправляемая.СтавкаНДСВознаграждения;
						НДоходы.ВознаграждениеВключаетНДС = СтрокаДоходаИсправляемая.ВознаграждениеВключаетНДС;
						НДоходы.ДобавленаКорректировкаИзАкцепта = Истина;
						МассивИдентификаторовГруппировкиКорректировокВР.Добавить(СтрокаДоходаИсправляемая.ИдентификаторГруппировки);
				КонецЕсли;
				//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
				
				//Евросиб - АСуслов 08.11.2023 13:04:41 #77057
				//(
				Стр.ГуидСтрокиДоходов = Новый УникальныйИдентификатор;
				//)
				//Евросиб - АСуслов 08.11.2023 13:04:46 #77057
				НДоходы.ГУИД = Стр.ГУИДСтрокиДоходов;
				НДоходыСписокКТК = СтрСоединить(Стр.СписокКТК.ВыгрузитьЗначения(), ";");
				Если ЗначениеЗаполнено(НДоходыСписокКТК) Тогда
					НДоходыКТКСтр = СделкаОбъект.ДоходыКТК.Добавить();
					НДоходыКТКСтр.ГУИД = НДоходы.ГУИД;
					НДоходыКТКСтр.КТК = НДоходыСписокКТК;
				КонецЕсли;
				НДоходыСписокВагонов = СтрСоединить(Стр.СписокВагонов.ВыгрузитьЗначения(), ";");
				Если ЗначениеЗаполнено(НДоходыСписокВагонов) Тогда
					НДоходыКТКСтр = СделкаОбъект.ДоходыВагоны.Добавить();
					НДоходыКТКСтр.ГУИД = НДоходы.ГУИД;
					НДоходыКТКСтр.Вагон = НДоходыСписокВагонов;
				КонецЕсли;
				НДоходыСписокТД = СтрСоединить(Стр.СписокТД.ВыгрузитьЗначения(), ";");
				Если ЗначениеЗаполнено(НДоходыСписокТД) Тогда
					НДоходыКТКСтр = СделкаОбъект.ДоходыТД.Добавить();
					НДоходыКТКСтр.ГУИД = НДоходы.ГУИД;
					НДоходыКТКСтр.ТД = НДоходыСписокТД;
				КонецЕсли;
				НДоходы.РеестрКлиента = Стр.НомерРеестра;
				НДоходы.ПериодВО = неопределено;
				
				ОбработатьСтрокуДоходов(НДоходы);
			Иначе
				//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 06-08-2025, начало
				Если НДоходы.ГУИДИсправляемойСтроки <> "" И НДоходы.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта Тогда
					ЗаполнитьЗначенияСвойств(НДоходы, Стр, "Себестоимость, СебестоимостьИтого, Ставка, СтавкаИтого, СуммаИтого, СуммаНДС, СтавкаНДС");
					Если НЕ Стр.НДСВключенВСтоимость Тогда //в строках дохода с ВР всегда сумма включает НДС
						НДоходы.Себестоимость = НДоходы.Себестоимость + НДоходы.СуммаНДС;
					КонецЕсли;
					ОбработатьСтрокуДоходов(НДоходы);
				КонецЕсли;
				//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 06-08-2025, конец
			КонецЕсли;  
			
		КонецЕсли;
		
		Если Стр.Расходы = Истина Тогда
			
			НРасходы = неопределено;
			Для каждого ДСтр из СделкаОбъект.Расходы Цикл
				Если ДСтр.ГУИД = Стр.ГУИДРасходов Тогда НРасходы = ДСтр; Прервать; КонецЕсли;
			КонецЦикла;
			
			Если НРасходы = неопределено Тогда
				НРасходы = СделкаОбъект.Расходы.Добавить();
			//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
			Иначе
				Если МассивГУИДРасходовПеревязатьНаСтрокиКорректировки.Найти(НРасходы.ГУИД) <> Неопределено Тогда
					НайденоСвязьДоходовИРасходов = СделкаОбъект.СвязьДоходовИРасходов.НайтиСтроки(Новый Структура("Расходы", НРасходы.ГУИД));
					Если НайденоСвязьДоходовИРасходов.Количество()>0 Тогда
						СделкаОбъект.СвязьДоходовИРасходов.Удалить(НайденоСвязьДоходовИРасходов[0]);
					КонецЕсли;
				КонецЕсли;
			//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(НРасходы, Стр, "Услуга, Калькуляция, Себестоимость, Количество, СебестоимостьИтого, Груз, ВознаграждениеИтого, ВнутренняяСебестоимость, Валюта, Перевыставляемая, НоменклатурнаяГруппа, Подсыл, Комментарий, НеВключатьВПлановыеРасходы, ПунктОтправления, ПунктНазначения, ИсточникПоявленияСтрокиЭкономики, ЕдиницаИзмерения, ОтнестиНаЗатраты, АвтоматическиПривязыватьРасходКДоходу");			
			НРасходы.Услуга = Стр.УслугаРасхода;
			
			НРасходы.Поставщик = Стр.Расходы_Поставщик;
			НРасходы.Договор = Стр.Расходы_Договор;
			НРасходы.СтавкаНДС = Стр.Расходы_СтавкаНДС;
			НРасходы.НДСВключенВСтоимость = Стр.Расходы_НДСВключенВСтоимость;
			НРасходы.ГУИД = Стр.ГУИДРасходов;
			НРасходы.Регламентный = Истина;
			//Евросиб - АСуслов 22.09.2021 11:18:45 #33698
			//(
			//НРасходы.ПериодВО = неопределено;
			//НРасходы.ПериодВО = Стр.ПериодВО;
			//НРасходы.ПериодУУ = Стр.ПериодУУ;
			НРасходы.Вагон = Стр.Вагон;
			НРасходы.Контейнер = Стр.Контейнер;
			НРасходы.ТранспортныйДокумент = Стр.ТранспортныйДокумент;
			//)
			//Евросиб - АСуслов 22.09.2021 11:18:47 #33698
			//Евросиб Каблов 02.07.2021 ( Ticket#0234010
			//НРасходы.УчДокумент = Стр.ПТУ;
			//ДИТ Шевченко А.В. 55587 22.12.22 -начало
			Если ТипЗнч(Стр.ПТУ) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
				//Евросиб Каблов 06.04.2022 (
				//НРасходы.УчДокумент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.ПТУ, "ДокументПоступления");
				Если Стр.Перевыставляемая И НЕ Стр.ПТУ.КорректироватьСуммыВПервичномВСФ Тогда
					НРасходы.УчДокумент = Стр.ПТУ;
				Иначе
					НРасходы.УчДокумент = БухгалтерскийУчетПереопределяемый.ПолучитьИсправляемыйДокументПоступления(Стр.ПТУ, Истина);
				КонецЕсли;			
				//Евросиб Каблов 06.04.2022 )
			Иначе
				НРасходы.УчДокумент = Стр.ПТУ;
			КонецЕсли;
			//ДИТ Шевченко А.В. 55587 22.12.22 -конец
			//Евросиб Каблов 02.07.2021 )			
			
			НДоходыСписокКТК = СтрСоединить(Стр.СписокКТК.ВыгрузитьЗначения(), ";");
			Если ЗначениеЗаполнено(НДоходыСписокКТК) Тогда
				НДоходыКТКСтр = СделкаОбъект.ДоходыКТК.Добавить();
				НДоходыКТКСтр.ГУИД = НРасходы.ГУИД;
				НДоходыКТКСтр.КТК = НДоходыСписокКТК;
			КонецЕсли;
			НДоходыСписокВагонов = СтрСоединить(Стр.СписокВагонов.ВыгрузитьЗначения(), ";");
			Если ЗначениеЗаполнено(НДоходыСписокВагонов) Тогда
				НДоходыКТКСтр = СделкаОбъект.ДоходыВагоны.Добавить();
				НДоходыКТКСтр.ГУИД = НРасходы.ГУИД;
				НДоходыКТКСтр.Вагон = НДоходыСписокВагонов;
			КонецЕсли;
			НДоходыСписокТД = СтрСоединить(Стр.СписокТД.ВыгрузитьЗначения(), ";");
			Если ЗначениеЗаполнено(НДоходыСписокТД) Тогда
				НДоходыКТКСтр = СделкаОбъект.ДоходыТД.Добавить();
				НДоходыКТКСтр.ГУИД = НРасходы.ГУИД;
				НДоходыКТКСтр.ТД = НДоходыСписокТД;
			КонецЕсли;
			
			СтруктураПоиска = Новый Структура();
			
			//Евросиб - АСуслов 27.01.2022 17:22:32 #
			//(
			//ДИТ Шевченко А.В. US 68330 ТА 69907 16.05.2023 -Начало
			Если ДанныеИзСП Тогда
				СтруктураПоиска.Вставить("ГУИД", Стр.ГУИДСП);
			//ДИТ Шевченко А.В. US 68330 ТА 69907 16.05.2023 -Конец	
			ИначеЕсли ЗначениеЗаполнено(Стр.Контейнер) Тогда
				СтруктураПоиска.Вставить("Контейнер", Стр.Контейнер);
			ИначеЕсли ЗначениеЗаполнено(Стр.Вагон) Тогда
				СтруктураПоиска.Вставить("Вагон", Стр.Вагон);
			ИначеЕсли ЗначениеЗаполнено(Стр.ТранспортныйДокумент) Тогда
				СтруктураПоиска.Вставить("ЖДН", Стр.ТранспортныйДокумент);
			//)
			//Евросиб - АСуслов 27.01.2022 17:22:33 #
			ИначеЕсли Стр.СписокКТК.Количество() > 0 Тогда
				СтруктураПоиска.Вставить("Контейнер", Стр.СписокКТК[0].Значение);
			ИначеЕсли Стр.СписокВагонов.Количество() > 0 Тогда
				СтруктураПоиска.Вставить("Вагон", Стр.СписокВагонов[0].Значение);
			ИначеЕсли Стр.СписокТД.Количество() > 0 Тогда
				СтруктураПоиска.Вставить("ЖДН", Стр.СписокТД[0].Значение);
			КонецЕсли;
			
			//ДИТ, Беляев СЮ, Ticket#0331045, 09-11-2023, начало
			СтруктураПоиска.Вставить("НеАктивна", Ложь);
			СтруктураПоиска.Вставить("Удалена", Ложь);
			//ДИТ, Беляев СЮ, Ticket#0331045, 09-11-2023, конец
			
			//Евросиб Каблов 12.12.2023 ( Ticket#0329972
			СтруктураПоиска.Вставить("ОтключитьРасходы", Ложь);
			//Евросиб Каблов 12.12.2023 )
			
			// Евросиб US 123769 TA 127881 Рыбьяков К.А. 19.01.2026 ((
			Если Стр.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.АРМДополнительныеРасходы Тогда
				СтруктураПоиска.Вставить("ВидТранспортногоСообщения", Стр.ВидТранспортногоСообщения);
			КонецЕсли;
			// Евросиб Рыбьяков К.А. 19.01.2026 ))
			
			//Евросиб - АСуслов 03.05.2023 12:01:17 #69494
			//(
			//Если СтруктураПоиска.Количество() > 0 Тогда
			//)
			//Евросиб - АСуслов 03.05.2023 12:04:30 #69494
			
				НайдСтроки = СделкаОбъект.СвязьУчетныхЕдиниц.НайтиСтроки(СтруктураПоиска);
				//Евросиб Каблов 16.05.2024 ( Ticket#0352009
				//Если НайдСтроки.Количество() > 0 Тогда										
					//СтрокаСУЕ = НайдСтроки[0];
				СтрокаСУЕ = Неопределено;
				Если ЗначениеЗаполнено(НайдСтроки) Тогда
					Фрахт = Константы.УслугаФрахтаДляКалькуляции.Получить();
					ВидТранспортногоСообщения = ?(Стр.Услуга = Фрахт, Перечисления.ВидыТранспортныхСообщений.Море, Перечисления.ВидыТранспортныхСообщений.ЖД);
					Для Каждого НайденнаяСтрока Из НайдСтроки Цикл
						Если НайденнаяСтрока.ВидТранспортногоСообщения = ВидТранспортногоСообщения
								Или Не ЗначениеЗаполнено(НайденнаяСтрока.ВидТранспортногоСообщения) Тогда
							СтрокаСУЕ = НайденнаяСтрока;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если СтрокаСУЕ = Неопределено Тогда
						СтрокаСУЕ = НайдСтроки[0];
					КонецЕсли;
				КонецЕсли;
				
				Если СтрокаСУЕ <> Неопределено Тогда
				//Евросиб Каблов 16.05.2024 )
				
					//Евросиб Каблов 24.12.2023 ( #78938
					//НРасходы.СтрокаСвязьУчетныхЕдиниц = НайдСтроки[0].ГУИД;
					НРасходы.СтрокаСвязьУчетныхЕдиниц = СтрокаСУЕ.ГУИД;
					
					Если ЗначениеЗаполнено(СтрокаСУЕ.Калькуляция) Тогда
						РеквизитыКалькуляции = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаСУЕ.Калькуляция, "ТипКалькуляции, ОтнестиРасходыНаСобственныеЗатраты");
						Если РеквизитыКалькуляции.ТипКалькуляции = Перечисления.ТипыКалькуляций.МежсервисныеРасходы И РеквизитыКалькуляции.ОтнестиРасходыНаСобственныеЗатраты Тогда
							НРасходы.ОтнестиНаЗатраты = Истина;
						КонецЕсли;
					КонецЕсли;
					//Евросиб Каблов 24.12.2023 )
				Иначе
					НСтрСвязи = СделкаОбъект.СвязьУчетныхЕдиниц.Добавить();
					НСтрСвязи.ГУИД = Строка(Новый УникальныйИдентификатор);
					НРасходы.СтрокаСвязьУчетныхЕдиниц = НСтрСвязи.ГУИД;
					//ЗаполнитьЗначенияСвойств(НСтрСвязи, СтруктураПоиска);
					//ДИТ Шевченко А.В. US 68330 ТА 69907 16.05.2023 -Начало
					Если ДанныеИзСП Тогда
						ЗаполнитьЗначенияСвойств(НСтрСвязи, СтруктураПоиска,,"ГУИД");
					Иначе
						ЗаполнитьЗначенияСвойств(НСтрСвязи, СтруктураПоиска);
					КонецЕсли;
					//ДИТ Шевченко А.В. US 68330 ТА 69907 16.05.2023 -Конец
					// ДИТ US 47112 TA 62979 Евсенкин М.А. Начало: 28.02.2023
					Фрахт = Константы.УслугаФрахтаДляКалькуляции.Получить();
					НСтрСвязи.ВидТранспортногоСообщения = ?(Стр.Услуга = Фрахт,Перечисления.ВидыТранспортныхСообщений.Море,Перечисления.ВидыТранспортныхСообщений.ЖД);
					// ДИТ US 47112 TA 62979 Евсенкин М.А. Конец: 28.02.2023
					Если Стр.СписокКТК.Количество() > 0 Тогда
						НСтрСвязи.Контейнер = Стр.СписокКТК[0].Значение;
					КонецЕсли;
					Если Стр.СписокВагонов.Количество() > 0 Тогда
						НСтрСвязи.Вагон = Стр.СписокВагонов[0].Значение;
					КонецЕсли;
					Если Стр.СписокТД.Количество() > 0 Тогда
						НСтрСвязи.ЖДН = Стр.СписокТД[0].Значение;
						НСтрСвязи.НомерЖДН = Стр.СписокТД[0].Значение.НомерТранспортногоДокумента;
					КонецЕсли;
				КонецЕсли;
			//КонецЕсли;
			
			//Евросиб - АСуслов 29.04.2022 12:21:23 #
			//(
			//Документы.Сделка.СвязатьДоходыРасходыСУЕ(СделкаОбъект, Стр.ГУИДСтрокиДоходов, Стр.ГУИДРасходов, НРасходы.СтрокаСвязьУчетныхЕдиниц, Стр.Услуга);
			Документы.Сделка.СвязатьДоходыРасходыСУЕ(СделкаОбъект, Стр.ГУИДСтрокиДоходов, Стр.ГУИДРасходов, НРасходы.СтрокаСвязьУчетныхЕдиниц, Стр.УслугаРасхода);
			//)
			//Евросиб - АСуслов 29.04.2022 12:21:24 #
			ОбработатьСтрокуРасходов(НРасходы);
			
		КонецЕсли;

		// Евросиб US 83437 TA 83438 Рыбьяков К.А. 03.06.2024 ((
		//Если СделкаОбъект.ДополнительныеСвойства.Свойство("ДанныеДляЗаполненияСделкиИзАкцепта") Тогда
		//	МенеджерЗаписи = РегистрыСведений.ДанныеДляДобавленияСтрокАкцептовВСделку.СоздатьМенеджерЗаписи();
		//	МенеджерЗаписи.ПТУ = Стр.ПТУ;
		//	МенеджерЗаписи.ГУИД = Стр.ГУИД;
		//	МенеджерЗаписи.Прочитать();
		//	Если МенеджерЗаписи.Выбран() Тогда
		//		МенеджерЗаписи.Обработано = Истина;
		//		МенеджерЗаписи.Записать();
		//	КонецЕсли;
		//	ОтложенноеИзменениеСервер.ПоставитьОбъектВОчередьИзменения(Стр.ПТУ, СделкаОбъект.Ссылка);
		//КонецЕсли;
		// Евросиб Рыбьяков К.А. 03.06.2024 ))
		
		//Если ЗначениеЗаполнено(Стр.ГУИДСтрокиДоходов) И Стр.Расходы = Истина Тогда
		//	
		//	НСвязь = СделкаОбъект.СвязьДоходовИРасходов.Добавить();
		//	НСвязь.Доходы = Стр.ГУИДСтрокиДоходов;
		//	НСвязь.Расходы = НРасходы.ГУИД;
		//	НСвязь.Услуга = Стр.Услуга;
		//	
		//КонецЕсли;
		
	КонецЦикла;
	
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
	Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(МассивИдентификаторовГруппировкиКорректировокВР, Истина);
	Для Каждого ИдентификаторГруппировки Из МассивИдентификаторовГруппировкиКорректировокВР Цикл
		Если ИдентификаторГруппировки = 0 Тогда
			Продолжить;
		КонецЕсли;
		МассивГУИДдоходовИсходныхСтрок = Новый Массив;
		МассивГУИДдляСозданияСтрокКорректировок = Новый Массив;
		НайденныеСтрокиДоходов = СделкаОбъект.Доходы.НайтиСтроки(Новый Структура("ИдентификаторГруппировки", ИдентификаторГруппировки));
		Для Каждого СтрокаДохода Из НайденныеСтрокиДоходов Цикл
			МассивГУИДдоходовИсходныхСтрок.Добавить(СтрокаДохода.ГУИД);
		КонецЦикла;
		Для Каждого ГУИДИсправляемойСтроки Из МассивГУИДдоходовИсходныхСтрок Цикл
			Если СделкаОбъект.Доходы.Найти(ГУИДИсправляемойСтроки, "ГУИДИсправляемойСтроки") <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			МассивГУИДдляСозданияСтрокКорректировок.Добавить(ГУИДИсправляемойСтроки);
		КонецЦикла;
		Для Каждого ГУИДИсправляемойСтроки Из МассивГУИДдляСозданияСтрокКорректировок Цикл
			СтрокаДоходаДляКопирования = СделкаОбъект.Доходы.Найти(ГУИДИсправляемойСтроки, "ГУИД");
			НДоходы = СделкаОбъект.Доходы.Добавить();
			НДоходы.ДатаПоявленияСтрокиЭкономики = ТекущаяДата();
			
			ЗаполнитьЗначенияСвойств(НДоходы, СтрокаДоходаДляКопирования, "Клиент, Договор, Услуга, Калькуляция, Себестоимость, Вознаграждение, Ставка, Количество, СебестоимостьИтого, ВознаграждениеИтого, СтавкаИтого, Рентабельность, СтавкаНДС, СуммаНДС, НДСВключенВСтоимость, СуммаИтого, Груз, РазмерКТК, Валюта, Перевыставляемая, НоменклатурнаяГруппа, ПСЦ, Подсыл, Комментарий, НеВыставлятьКлиенту, УслугаВнеСтавки, ПроцентВознаграждения, СтавкаНДСВознаграждения, ВознаграждениеВключаетНДС, ЕдиницаИзмерения, ИсточникПоявленияСтрокиЭкономики");
			нДоходы.ГотовоКВыставлению = Истина;
			
			НДоходы.ГУИД = Новый УникальныйИдентификатор;
			НДоходы.ГУИДИсправляемойСтроки = ГУИДИсправляемойСтроки;
			
			//ТЧ ДОХОДЫ КТК
			СтрокаСписокКТК = СделкаОбъект.ДоходыКТК.Найти(ГУИДИсправляемойСтроки, "ГУИД");
			Если СтрокаСписокКТК <> Неопределено Тогда
				НДоходыКТКСтр = СделкаОбъект.ДоходыКТК.Добавить();
				НДоходыКТКСтр.ГУИД = НДоходы.ГУИД;
				НДоходыКТКСтр.КТК = СтрокаСписокКТК.КТК;
			КонецЕсли;
			
			//ТЧ ДоходыВагоны
			СтрокаСписокВагонов = СделкаОбъект.ДоходыВагоны.Найти(ГУИДИсправляемойСтроки, "ГУИД");
			Если СтрокаСписокВагонов <> Неопределено Тогда
				НДоходыКТКСтр = СделкаОбъект.ДоходыВагоны.Добавить();
				НДоходыКТКСтр.ГУИД = НДоходы.ГУИД;
				НДоходыКТКСтр.КТК = СтрокаСписокВагонов.Вагон;
			КонецЕсли;
			
			//ТЧ СписокТД
			СтрокаСписокТД = СделкаОбъект.ДоходыТД.Найти(ГУИДИсправляемойСтроки, "ГУИД");
			Если СтрокаСписокТД <> Неопределено Тогда
				НДоходыКТКСтр = СделкаОбъект.ДоходыТД.Добавить();
				НДоходыКТКСтр.ГУИД = НДоходы.ГУИД;
				НДоходыКТКСтр.КТК = СтрокаСписокТД.ТД;
			КонецЕсли;
			
			НДоходы.РеестрКлиента = СтрокаДоходаДляКопирования.РеестрКлиента;
			НДоходы.ПериодВО = неопределено;
			
			ОбработатьСтрокуДоходов(НДоходы);
		КонецЦикла;
		
	КонецЦикла;
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
	
	// SIV 31-05-21 Исправление по периодамВО доплатной услуги
	//Евросиб - АСуслов 22.09.2021 11:21:25 #33698
	//(
	//ПересчитатьПериодыНаСервере(СделкаОбъект, Истина);
	Документы.Сделка.ПересчитатьПериоды(СделкаОбъект);
	//)
	//Евросиб - АСуслов 22.09.2021 11:21:27 #33698
	
КонецПроцедуры

Процедура ПересчитатьПериодыНаСервере(СделкаО, СохранитьИмеющиеся)
	
	//Евросиб Каблов 09.04.2025 ( #105407
	//ДатаОткрытогоПериода = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(СделкаО.Организация);
	ДатаОткрытогоПериода = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(СделкаО.Организация);
	//Евросиб Каблов 09.04.2025 )
	
	Для каждого Стр из СделкаО.Доходы Цикл
		Если (ЗначениеЗаполнено(Стр.ПериодВО) 
			И СохранитьИмеющиеся = Истина)
			ИЛИ ЗначениеЗаполнено(Стр.УчДокумент)
			Тогда Продолжить; КонецЕсли;
		РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Стр.Договор, "ПравилоФормированияДатыУслуги, ПериодичностьВыставленияДокументов, ДатаПаспортаСделки");
		СтруктураПараметров = Новый Структура("ПериодВО, Клиент, Дата, Номенклатура, СтрокаДоходовСделки, СписокТД, СписокТЕ, НомерСтроки, Коносамент");
		СтруктураПараметров.ПериодВО = ДатаОткрытогоПериода;
		СтруктураПараметров.Клиент = Стр.Клиент;
		СтруктураПараметров.Дата = ТекущаяДата();
		СтруктураПараметров.Номенклатура = Стр.Услуга;
		СтруктураПараметров.СтрокаДоходовСделки = Стр.ГУИД;
		СтруктураПараметров.СписокТД = ПолучитьЗначениеСписочнойТаблицы(СделкаО, "ДоходыТД", Стр.ГУИД);// Стр.СписокТД;
		СтруктураПараметров.СписокТЕ = ПолучитьЗначениеСписочнойТаблицы(СделкаО, "ДоходыКТК", Стр.ГУИД);//Стр.СписокКТК;
		СтруктураПараметров.НомерСтроки = Стр.НомерСтроки;
		СтруктураПараметров.Коносамент = Стр.Коносамент;
		Стр.ПериодВО = ФормированиеДатДокументов.УстановкаДатыДокумента(СделкаО.Ссылка,
														 РеквизитыДоговора.ПравилоФормированияДатыУслуги,
														 РеквизитыДоговора.ПериодичностьВыставленияДокументов,
														 РеквизитыДоговора.ДатаПаспортаСделки,
														 СтруктураПараметров);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьЗначениеСписочнойТаблицы(СделкаОбъект, ИмяТаблицы, ИскомыйГУИД)
	
	Результат = "";
	
	НайдСтр = СделкаОбъект[ИмяТаблицы].Найти(ИскомыйГУИД, "ГУИД");
	
	Если НайдСтр <> неопределено Тогда
		Если ИмяТаблицы = "ДоходыВагоны" Тогда
			Результат = НайдСтр.Вагон;
		ИначеЕсли ИмяТаблицы = "ДоходыКТК" Тогда
			Результат = НайдСтр.КТК;
		ИначеЕсли ИмяТаблицы = "ДоходыТД" Тогда
			Результат = НайдСтр.ТД;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ОбработатьСтрокуДоходов(ТекД = неопределено) Экспорт
	
	Если ТекД <> неопределено Тогда
		
		ТекД.Ставка 				= ТекД.Себестоимость + ТекД.Вознаграждение;
		ТекД.Рентабельность 		= ТекД.Вознаграждение / ?(ТекД.Ставка = 0, 1, ТекД.Ставка);
		
		ТекД.СебестоимостьИтого 	= ТекД.Количество * ТекД.Себестоимость;
		ТекД.ВознаграждениеИтого 	= ТекД.Количество * ТекД.Вознаграждение;
		ТекД.СтавкаИтого 			= ТекД.Количество * ТекД.Ставка;
		
		ТекД.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(ТекД.СтавкаИтого, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ТекД.СтавкаНДС), Истина, ТекД.НДСВключенВСтоимость);
		
		ТекД.СуммаИтого = ТекД.СтавкаИтого + ?(ТекД.НДСВключенВСтоимость, 0, ТекД.СуммаНДС);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьСтрокуРасходов(ТекД = неопределено) Экспорт
	
	Если ТекД <> неопределено Тогда
		
		ТекД.СебестоимостьИтого		= ТекД.Себестоимость * ТекД.Количество;
		ТекД.СуммаНДС 				= БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(ТекД.СебестоимостьИтого, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ТекД.СтавкаНДС), Истина, ТекД.НДСВключенВСтоимость);
		ТекД.СуммаИтого 			= ТекД.СебестоимостьИтого + ?(ТекД.НДСВключенВСтоимость, 0, ТекД.СуммаНДС);
		
	КонецЕсли;
	
	
КонецПроцедуры

//функции и процедуры подбора ждн
// Евросиб Фролов (03.03.2022, добавил в параметры МассивСообщений)
// Евросиб Фролов, 15.04.2022 Task №48577 (добавил в параметры ДобавленныеСтроки - массив ГУИД строк состава поезда, по которым нужно заполнить сведения)
Функция ПодобратьНакладныеВСделку(ОбъектСделка, ГоризонтПоискаНакладныхПодсыла = 40, МассивСообщений = Неопределено, ДобавленныеСтроки = Неопределено) Экспорт
	
	// Евросиб Фролов (03.03.2022
	Если МассивСообщений = Неопределено Тогда
		МассивСообщений = Новый Массив;
	КонецЕсли;	
	// Евросиб Фролов)
	
	Результат = 0;
	
	// статусы кодов возврата
	// -1 - не найдены рейсы или они кривые. ошибка.
	// -2 - станции следования не заполнены. ошибка.
	//  0 - при выполнении алгоритма ничего не изменилось
	//  1 - при выполнении алгоритма что-то изменилось
	
	// определение коридора времени
	ДатаМин = Дата("00010101");
	ДатаМакс = Дата("00010101");
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	МАКСИМУМ(СделкаРейсы.Рейс.ДатаОтправления) КАК РейсДатаОтправления,
	//               |	МАКСИМУМ(СделкаРейсы.Рейс.ДатаПрибытия) КАК РейсДатаПрибытия
	//               |ИЗ
	//               |	Документ.Сделка.Рейсы КАК СделкаРейсы
	//               |ГДЕ
	//               |	СделкаРейсы.Ссылка = &Ссылка
	//               |	И ТИПЗНАЧЕНИЯ(СделкаРейсы.Рейс) = ТИП(Справочник.РейсыЖД)";
	//Запрос.УстановитьПараметр("Ссылка", ОбъектСделка.Ссылка);
	//Ответ = Запрос.Выполнить().Выбрать();
	//Если Ответ.Следующий() Тогда
	//	ДатаМин = Ответ.РейсДатаОтправления;
	//	ДатаМакс = Ответ.РейсДатаПрибытия;
	//КонецЕсли;
	
	//Для каждого Стр из ОбъектСделка.Рейсы Цикл
	//	
	//	Если ТипЗнч(Стр.Рейс) = Тип("СправочникСсылка.РейсыЖД") Тогда
	//		ДатаМин = Макс(ДатаМин, Стр.Рейс.ДатаОтправления);
	//		ДатаМакс = Макс(ДатаМакс, Стр.Рейс.ДатаПрибытия);
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, начало
    ДанныеИзРейсовСделки = ПолучитьДанныеИзРейсовСделки(ОбъектСделка);
	ДатаМин = ДанныеИзРейсовСделки.ДатаМин;
	ДатаМакс = ДанныеИзРейсовСделки.ДатаМакс;
	МассивСтанцийНазначений = ДанныеИзРейсовСделки.МассивСтанцийНазначений;
    МассивСтанцийОтправления = ДанныеИзРейсовСделки.МассивСтанцийОтправления;
	//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, конец
	
	// Евросиб Фролов (03.03.2022
	Если ОбъектСделка.Рейсы.Количество() = 0 Тогда
		МассивСообщений.Добавить("" + ОбъектСделка.Ссылка + ": не найдены рейсы ЖД."); // Евросиб Фролов, 03.03.2022
	Иначе
		Если Не ЗначениеЗаполнено(ДатаМин) Тогда
			МассивСообщений.Добавить("" + ОбъектСделка.Ссылка + ": не удалось определить минимальную дату по рейсу ЖД (по дате отправления).");
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ДатаМакс) ИЛИ НЕ ЗначениеЗаполнено(ДатаМин) Тогда
			МассивСообщений.Добавить("" + ОбъектСделка.Ссылка + ": не удалось определить максимальную дату по рейсу ЖД (по дате прибытия).");
		КонецЕсли;
	КонецЕсли;	
	// Евросиб Фролов)
	
	Если НЕ ЗначениеЗаполнено(ДатаМакс) ИЛИ НЕ ЗначениеЗаполнено(ДатаМин) Тогда
		Возврат -1;
	КонецЕсли;
	
	// определение маршрута
	ПунктОтправленияЪ = ?(ЗначениеЗаполнено(ОбъектСделка.ПогранпереходИзСтраныОтправления), ОбъектСделка.ПогранпереходИзСтраныОтправления, ОбъектСделка.СтанцияОтправления);
	ПунктНазначенияЪ = ?(ЗначениеЗаполнено(ОбъектСделка.ПогранпереходВСтрануНазначения), ОбъектСделка.ПогранпереходВСтрануНазначения, ОбъектСделка.СтанцияНазначения);
	
	// Евросиб Фролов (03.03.2022
	Если Не ЗначениеЗаполнено(ПунктОтправленияЪ) Тогда
		МассивСообщений.Добавить("" + ОбъектСделка.Ссылка + ": не удалось определить пункт отправления (в сделке не заполнены погранпереход из страны отправления и станция отправления).");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ПунктНазначенияЪ) Тогда
		МассивСообщений.Добавить("" + ОбъектСделка.Ссылка + ": не удалось определить пункт назначения (в сделке не заполнены погранпереход в страну назначения и станция назначения).");
	КонецЕсли;
	// Евросиб Фролов)
	
	Если НЕ ЗначениеЗаполнено(ПунктОтправленияЪ) ИЛИ НЕ ЗначениеЗаполнено(ПунктНазначенияЪ) Тогда
		Возврат -2;
	КонецЕсли;
	
	//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, начало
	МассивСтанцийОтправления.Добавить(ПунктОтправленияЪ);
	МассивСтанцийНазначений.Добавить(ПунктНазначенияЪ);
	//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, конец
	
	МинДатаЪ = ДатаМин - ГоризонтПоискаНакладныхПодсыла*24*3600;
	МаксДатаЪ = ДатаМакс + ГоризонтПоискаНакладныхПодсыла*24*3600;
	
	//ДИТ, Беляев СЮ, US 69796/ TA 76295, 15-12-2023, начало
	МассивГУИДпоКоторымИзменилсяВагон = Новый Массив;
	//ДИТ, Беляев СЮ, US 69796/ TA 76295, 15-12-2023, конец

	Для каждого Стр из ОбъектСделка.СвязьУчетныхЕдиниц Цикл
		
		//Евросиб - АСуслов 22.09.2022 15:40:15 #56288
		//(
		Если Стр.ВидТранспортногоСообщения = Перечисления.ВидыТранспортныхСообщений.Море Тогда
			Продолжить;
		КонецЕсли;
		//)
		//Евросиб - АСуслов 22.09.2022 15:40:15 #56288
		
		// Евросиб Фролов (15.04.2022 Task №48577
		Если ДобавленныеСтроки <> Неопределено Тогда
			Если ДобавленныеСтроки.Найти(Стр.ГУИД) = Неопределено Тогда
				Продолжить;
			КонецЕсли;	
		КонецЕсли;	
		// Евросиб Фролов)
		
		//ДИТ, Беляев СЮ, US 69796/ TA 76295, 15-12-2023, начало
		ВагонДоИзменения = Стр.Вагон;
		//ДИТ, Беляев СЮ, US 69796/ TA 76295, 15-12-2023, конец
		
		//Евросиб Каблов 22.04.2021 (
		// Если ЗначениеЗаполнено(Стр.ЖДН) И Стр.ЖДН.ПометкаУдаления Тогда
		//	Стр.НомерЖДН = "";
		//	Стр.ЖДН = Неопределено;
		//	Стр.ГруженаяЖДННеНайдена = Истина;
		//КонецЕсли;
		
		//ДИТ, Беляев СЮ, US 69796/ TA 76295, 15-12-2023, начало (в случае помеченной на удаление, подбираем с таким же номером ЖДН)
		// Евросиб US 83395 TA 116021 Рыбьяков К.А. 08.09.2025 Добавил ЗначениеЗаполнено(Стр.ВидТранспортногоСообщения) И ЗначениеЗаполнено(Стр.Клиент)
		Если ЗначениеЗаполнено(Стр.ЖДН) И Стр.ЖДН.ПометкаУдаления И ЗначениеЗаполнено(Стр.ВидТранспортногоСообщения) И ЗначениеЗаполнено(Стр.Клиент) Тогда
			РеквизитыЖДН = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Стр.ЖДН, "НомерТранспортногоДокумента, ДатаТранспортногоДокумента");
			АналогичнаяЖДН = ТранспортныеДокументы_сервер.НайтиТранспортныйДокумент(РеквизитыЖДН.НомерТранспортногоДокумента, 
																					РеквизитыЖДН.ДатаТранспортногоДокумента, 
																					Перечисления.ВидыОперацийТранспортныхДокументов.ЖДНакладная);
			Если ЗначениеЗаполнено(АналогичнаяЖДН) Тогда
				//РеквизитыЖДН = ПолучитьРеквизитыНакладной( АналогичнаяЖДН );
				//ДИТ, Беляев СЮ, Ticket#0339735, 26-01-2024, начало
				РеквизитыЖДН = ПолучитьРеквизитыНакладной( АналогичнаяЖДН, Стр.Контейнер );
				//ДИТ, Беляев СЮ, Ticket#0339735, 26-01-2024, конец
				Стр.Вагон = РеквизитыЖДН.Вагон;
				Стр.НомерЖДН = РеквизитыЖДН.НомерЖДН;
				Стр.ЖДН = АналогичнаяЖДН;
				Стр.ГруженаяЖДННеНайдена = Ложь;
				Стр.Охрана = РеквизитыЖДН.Охрана;
				Результат = 1;
			Иначе 
				Продолжить;
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(Стр.ЖДН) Тогда
			//РеквизитыЖДН = ПолучитьРеквизитыНакладной( Стр.ЖДН );
			//ДИТ, Беляев СЮ, Ticket#0339735, 26-01-2024, начало
			РеквизитыЖДН = ПолучитьРеквизитыНакладной( Стр.ЖДН, Стр.Контейнер );
			//ДИТ, Беляев СЮ, Ticket#0339735, 26-01-2024, конец
			Если ЗначениеЗаполнено(РеквизитыЖДН.Вагон) И РеквизитыЖДН.Вагон <> Стр.Вагон Тогда
				Стр.Вагон = РеквизитыЖДН.Вагон;
			КонецЕсли;
			Стр.Охрана = РеквизитыЖДН.Охрана;
		КонецЕсли;
		//ДИТ, Беляев СЮ, US 69796/ TA 76295, 15-12-2023, конец
		
		Если ЗначениеЗаполнено(Стр.НакладнаяПослеГруженогоПлеча) И Стр.НакладнаяПослеГруженогоПлеча.ПометкаУдаления Тогда
			Стр.НакладнаяПослеГруженогоПлеча = Неопределено;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.НакладнаяПослеГружКТК) И Стр.НакладнаяПослеГружКТК.ПометкаУдаления Тогда
			Стр.НакладнаяПослеГружКТК = Неопределено;
		КонецЕсли;		
		//Евросиб Каблов 22.04.2021 )
		
		// SIV 04-05-21 Странное условие, учитывая, что накладная ГРУЖ может быть подобрана, но поменялась (аннулировалась) подсыльная.
		//Если НЕ ЗначениеЗаполнено(Стр.Контейнер) ИЛИ (ЗначениеЗаполнено(Стр.ЖДН) И Стр.ЖДН.НакладнаяЭТРАН.ТекущееСостояниеНакладнойДействующийСтатус = Истина) тогда Продолжить; КонецЕсли;
		
		МинДатаЪ = ДатаМин - ГоризонтПоискаНакладныхПодсыла*24*3600;
		МаксДатаЪ = ДатаМакс + ГоризонтПоискаНакладныхПодсыла*24*3600;
		
		//ДИТ, Беляев СЮ, Ticket#0327630, 06-10-2023, начало (закомментировал очистку ЖДН)
		//// ДИТ 69796 Давудов М.А. Начало: 27.09.2023
		////Очистка связанных реквизитов для повторного заполнения
		//Стр.Вагон = Справочники.ТС.ПустаяСсылка();
		//Стр.НомерЖДН = "";
		//Стр.ЖДН = Документы.ТранспортныйДокумент.ПустаяСсылка();
		//Стр.Охрана = Ложь;
		//Стр.ГруженаяЖДННеНайдена = Ложь;
		//Стр.НомерПорожнейЖДНКТК = "";
		//Стр.ПорожняяЖДНКТК = Документы.ТранспортныйДокумент.ПустаяСсылка();
		//Стр.ЖДНПерестановкиДоГружКТК = Документы.ТранспортныйДокумент.ПустаяСсылка();
		//Стр.ЖДНПерестановкиДоПорКТК = Документы.ТранспортныйДокумент.ПустаяСсылка();
		//Стр.НомерВагоннойЖДН = "";
		//Стр.ВагоннаяЖДН = Документы.ТранспортныйДокумент.ПустаяСсылка();
		//Стр.ВагонПодсылаПорКТК = Справочники.ТС.ПустаяСсылка();
		//Стр.ВагонПересылаПорКТК = Справочники.ТС.ПустаяСсылка();
		//Стр.НомерПорожнейВагоннойЖДН = "";
		//Стр.ПорожняяВагоннаяЖДН = Документы.ТранспортныйДокумент.ПустаяСсылка();
		//Стр.НакладнаяПослеГруженогоПлеча = Документы.ТранспортныйДокумент.ПустаяСсылка();
		//Стр.НакладнаяПослеГружКТК = Документы.ТранспортныйДокумент.ПустаяСсылка();
		//// ДИТ 69796 Давудов М.А. Конец: 27.09.2023
		//ДИТ, Беляев СЮ, Ticket#0327630, 06-10-2023, конец
		
		// 1.1. Поиск груженой ЖДН по ЭТРАН для заполненного контейнера
		//РезультатПоиска = НайтиНомерГруженойНакладнойПоЭТРАНПоКТК(Стр.Контейнер, МинДатаЪ, МаксДатаЪ, ПунктОтправленияЪ, ПунктНазначенияЪ, ДатаМакс);
		// Евросиб US 83395 TA 116021 Рыбьяков К.А. 08.09.2025 Добавил ЗначениеЗаполнено(Стр.ВидТранспортногоСообщения) И ЗначениеЗаполнено(Стр.Клиент)
		Если НЕ ЗначениеЗаполнено(Стр.ЖДН) И ЗначениеЗаполнено(Стр.ВидТранспортногоСообщения) И ЗначениеЗаполнено(Стр.Клиент) Тогда //ДИТ, Беляев СЮ, US 69796/ TA 76295, 15-12-2023, подбирать, если не заполнена
			//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, начало
			РезультатПоиска = НайтиНомерГруженойНакладнойПоЭТРАНПоКТК(Стр.Контейнер, МинДатаЪ, МаксДатаЪ, МассивСтанцийОтправления, МассивСтанцийНазначений, ДатаМакс);
			//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, конец
			Если ЗначениеЗаполнено(РезультатПоиска.СсылкаЖДН) Тогда
				
				Стр.Вагон = РезультатПоиска.Вагон;
				Стр.НомерЖДН = РезультатПоиска.НомерЖДН;
				Стр.ЖДН = РезультатПоиска.СсылкаЖДН;
				Стр.ГруженаяЖДННеНайдена = Ложь;
				//Евросиб Каблов 18.06.2021 ( Ticket#0209893
				Стр.Охрана = РезультатПоиска.Охрана;
				//Евросиб Каблов 18.06.2021 )
				Результат = 1;
				
			КонецЕсли;
		КонецЕсли;
		
		// Евросиб US 83395 TA 116021 Рыбьяков К.А. 08.09.2025 Добавил ЗначениеЗаполнено(Стр.ВидТранспортногоСообщения) И ЗначениеЗаполнено(Стр.Клиент)
		Если НЕ ЗначениеЗаполнено(Стр.ЖДН) И ЗначениеЗаполнено(Стр.ВидТранспортногоСообщения) И ЗначениеЗаполнено(Стр.Клиент) Тогда
			
			// 1.2. Поиск порожней ЖДН по ЭТРАН как основной накладной по сделке (для порожнего плеча)
			//РезультатПоиска = НайтиНомерГруженойПорожнимиВагонамиНакладнойПоЭТРАНПоКТК(Стр.Контейнер, МинДатаЪ, МаксДатаЪ, ПунктОтправленияЪ, ПунктНазначенияЪ);
			//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, начало
			РезультатПоиска = НайтиНомерГруженойПорожнимиВагонамиНакладнойПоЭТРАНПоКТК(Стр.Контейнер, МинДатаЪ, МаксДатаЪ, МассивСтанцийОтправления, МассивСтанцийНазначений);
			//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, конец
			Если ЗначениеЗаполнено(РезультатПоиска.СсылкаЖДН) Тогда
				
				Стр.Вагон = РезультатПоиска.Вагон;
				Стр.НомерЖДН = РезультатПоиска.НомерЖДН;
				Стр.ЖДН = РезультатПоиска.СсылкаЖДН;
				Стр.ГруженаяЖДННеНайдена = Истина;
				Результат = 1;
				
			КонецЕсли;
			
		КонецЕсли;
			
		Если ЗначениеЗаполнено(Стр.ЖДН) Тогда
			МаксДатаЪ = Стр.ЖДН.ДатаОтправления-1; //4*3600; // Стр.ЖДН.ДатаПрибытия;
			МинДатаЪ = МаксДатаЪ - ГоризонтПоискаНакладныхПодсыла*24*3600;
		КонецЕсли;
		
		//ДИТ, Беляев СЮ, US 69796/ TA 76295, 15-12-2023, начало
		ВагонИзменился = ВагонДоИзменения <> Стр.Вагон;
		Если ВагонИзменился Тогда
			МассивГУИДпоКоторымИзменилсяВагон.Добавить(Стр.ГУИД);
		КонецЕсли;
		//ДИТ, Беляев СЮ, US 69796/ TA 76295, 15-12-2023, конец

		// SIV --> 03-06-21 Юля попросила добавить подбор накладной на перестановку А -> А для подсыла вагона перед груженым или порожним рейсом
		//Если ЗначениеЗаполнено(Стр.Вагон) Тогда
		//ДИТ, Беляев СЮ, US 69796/ TA 76295, 15-12-2023, начало
		Если ЗначениеЗаполнено(Стр.Вагон) И (ВагонИзменился ИЛИ НЕ ЗначениеЗаполнено(Стр.ЖДНПерестановкиДоГружКТК)) Тогда
			 Стр.ЖДНПерестановкиДоГружКТК = Документы.ТранспортныйДокумент.ПустаяСсылка();
		//ДИТ, Беляев СЮ, US 69796/ TA 76295, 15-12-2023, конец
		
			//ЖДНПодсылВагонов = НайтиПодсылПорожнегоВагонаПоЭТРАН(Стр.Вагон.Наименование, МаксДатаЪ, ПунктОтправленияЪ.КодЖДСтанции, ГоризонтПоискаНакладныхПодсыла,, Истина, Истина);
			//ДИТ Авдеева В.С. 47101 05.09.2022 Начало
			//СтруктураЖДНПодсыла = НайтиПодсылПорожнегоВагонаПоЭТРАН(Стр.Вагон.Наименование, МаксДатаЪ, ПунктОтправленияЪ.КодЖДСтанции, ГоризонтПоискаНакладныхПодсыла,, Истина, Истина);
			//СтруктураЖДНПодсыла = НайтиПодсылПорожнегоВагонаПоЭТРАН(Стр.Вагон.Наименование, МаксДатаЪ, ПунктОтправленияЪ.КодЖДСтанции, ГоризонтПоискаНакладныхПодсыла,, Истина, Истина, Ложь);
			//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, начало
			СтруктураЖДНПодсыла = НайтиПодсылПорожнегоВагонаПоЭТРАН(Стр.Вагон.Наименование, МаксДатаЪ, МассивСтанцийОтправления, ГоризонтПоискаНакладныхПодсыла,, Истина, Истина, Ложь);
			//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, конец
			//ДИТ Авдеева В.С. 47101 05.09.2022 Конец
			ЖДНПодсылВагонов = СтруктураЖДНПодсыла.НакладнаяПодсылаВагонаСсылка;
			Если ЗначениеЗаполнено(ЖДНПодсылВагонов)
				//Евросиб - АСуслов 22.11.2022 12:18:16 #61531
				//(
				//И Стр.ГруженаяЖДННеНайдена = Ложь  
				Тогда
				//Стр.ЖДНПерестановкиДоГружКТК = ПолучитьТДПоНомеруЖДН(ЖДНПодсылВагонов); 
				Стр.ЖДНПерестановкиДоГружКТК = ПолучитьТДПоНакладнойЭтран(ЖДНПодсылВагонов); 
			//ИначеЕсли ЗначениеЗаполнено(ЖДНПодсылВагонов) И Стр.ГруженаяЖДННеНайдена = Истина Тогда
			//	//Стр.ЖДНПерестановкиДоПорКТК = ПолучитьТДПоНомеруЖДН(ЖДНПодсылВагонов); 
			//	Стр.ЖДНПерестановкиДоПорКТК = ПолучитьТДПоНакладнойЭтран(ЖДНПодсылВагонов); 
			//)
			//Евросиб - АСуслов 22.11.2022 12:18:42 #61531
			КонецЕсли;
			
		КонецЕсли;
		// SIV <--
		
		// Евросиб US 86202 TA 106817 Рыбьяков К.А. 15.05.2025 ((
		ДатаНачалаРаботыНовогоАлгоритмаПодбораЖДН = Константы.ДатаНачалаРаботыНовогоАлгоритмаПодбораЖДН.Получить();
		// Евросиб Рыбьяков К.А. 15.05.2025 ))
		
		// 2.1 ПОДСЫЛ ВАГОНА ЖДН
		//Если ЗначениеЗаполнено(Стр.Вагон) Тогда
		//ДИТ, Беляев СЮ, US 69796/ TA 76295, 15-12-2023, начало
		Если ЗначениеЗаполнено(Стр.Вагон) И (ВагонИзменился ИЛИ НЕ ЗначениеЗаполнено(Стр.ВагоннаяЖДН)) Тогда
			Стр.ВагоннаяЖДН = Документы.ТранспортныйДокумент.ПустаяСсылка();
		//ДИТ, Беляев СЮ, US 69796/ TA 76295, 15-12-2023, начало
			
			//ЖДНПодсылВагонов = НайтиПодсылПорожнегоВагонаПоЭТРАН(Стр.Вагон.Наименование, МаксДатаЪ, ПунктОтправленияЪ.КодЖДСтанции, ГоризонтПоискаНакладныхПодсыла, ЖДНПодсылВагонов);
			//СтруктураЖДНПодсылВагонов = НайтиПодсылПорожнегоВагонаПоЭТРАН(Стр.Вагон.Наименование, МаксДатаЪ, ПунктОтправленияЪ.КодЖДСтанции, ГоризонтПоискаНакладныхПодсыла, ЖДНПодсылВагонов);
			// Евросиб US 86202 TA 106817 Рыбьяков К.А. 11.04.2025 (( 
			СтруктураЖДНПодсылВагонов = Новый Структура("НакладнаяПодсылаВагона, НакладнаяПодсылаВагонаСсылка");
			Если ЗначениеЗаполнено(ДатаНачалаРаботыНовогоАлгоритмаПодбораЖДН) И ЗначениеЗаполнено(Стр.ЖДН) И ОбъектСделка.Дата > ДатаНачалаРаботыНовогоАлгоритмаПодбораЖДН Тогда
				СтруктураЖДНПодсылВагонов = НайтиПодсылПорожнегоВагонаПоЭТРАННовыйАлгоритм(Стр.Вагон.Наименование, МаксДатаЪ, МассивСтанцийНазначений, ГоризонтПоискаНакладныхПодсыла, ЖДНПодсылВагонов,,,, Стр.ЖДН.НакладнаяЭТРАН.ДатаИВремяРаскредитованияГруза);
			ИначеЕсли Не ЗначениеЗаполнено(ДатаНачалаРаботыНовогоАлгоритмаПодбораЖДН) Или ОбъектСделка.Дата < ДатаНачалаРаботыНовогоАлгоритмаПодбораЖДН Тогда
				//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, начало
				СтруктураЖДНПодсылВагонов = НайтиПодсылПорожнегоВагонаПоЭТРАН(Стр.Вагон.Наименование, МаксДатаЪ, МассивСтанцийОтправления, ГоризонтПоискаНакладныхПодсыла, ЖДНПодсылВагонов);
				//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, конец
			КонецЕсли;
			// Евросиб Рыбьяков К.А. 11.04.2025 ))
			ЖДНПодсылВагонов = СтруктураЖДНПодсылВагонов.НакладнаяПодсылаВагонаСсылка;
			Если ЗначениеЗаполнено(ЖДНПодсылВагонов) Тогда 
				Стр.НомерВагоннойЖДН = СтруктураЖДНПодсылВагонов.НакладнаяПодсылаВагона; 
				//Евросиб - АСуслов 16.09.2021 14:00:19 #
				//(
				//Стр.ВагоннаяЖДН = ПолучитьТДПоНомеруЖДН(ЖДНПодсылВагонов); 				
				Стр.ВагоннаяЖДН = ПолучитьТДПоНакладнойЭтран(ЖДНПодсылВагонов); 				
				//)
				//Евросиб - АСуслов 16.09.2021 14:00:19 #
			КонецЕсли;    
		КонецЕсли;
		
		ЖДНПодсылКТК = Новый Структура("ВагонПорожнегоКТК, СтанцияПогрузкиКТК, НакладнаяКТК, РаскредитацияКТК");
		
		// 3.1. ПОДСЫЛ КТК ЖДН
		Если ЗначениеЗаполнено(Стр.Контейнер) И ЗначениеЗаполнено(Стр.ЖДН) Тогда
			//ЖДНПодсылКТК = НайтиПодсылПорожнегоКТКПоЭТРАН(Стр.Контейнер, МинДатаЪ, МаксДатаЪ, ПунктОтправленияЪ);
			//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, начало
			ЖДНПодсылКТК = НайтиПодсылПорожнегоКТКПоЭТРАН(Стр.Контейнер, МинДатаЪ, МаксДатаЪ, МассивСтанцийОтправления);
			//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, конец
			Если ЗначениеЗаполнено(ЖДНПодсылКТК.НакладнаяКТК) Тогда 
				Стр.НомерПорожнейЖДНКТК = ЖДНПодсылКТК.НакладнаяКТК; 
				//Евросиб - АСуслов 16.09.2021 14:02:04 #
				//(
				//Стр.ПорожняяЖДНКТК = ПолучитьТДПоНомеруЖДН(ЖДНПодсылКТК.НакладнаяКТК);
				Стр.ПорожняяЖДНКТК = ПолучитьТДПоНакладнойЭтран(ЖДНПодсылКТК.НакладнаяКТКСсылка);
				//)
				//Евросиб - АСуслов 16.09.2021 14:02:05 #           
				//Евросиб - АСуслов 21.11.2022 16:39:46 #61531
				//(
				Стр.ВагонПодсылаПорКТК = ЖДНПодсылКТК.ВагонПорожнегоКТКСсылка;
				СтруктураЖДНПодсыла = НайтиПодсылПорожнегоВагонаПоЭТРАН(ЖДНПодсылКТК.ВагонПорожнегоКТК, ЖДНПодсылКТК.РаскредитацияКТК, ЖДНПодсылКТК.СтанцияПогрузкиКТК, ГоризонтПоискаНакладныхПодсыла,, Истина, Истина, Ложь);
				Стр.ЖДНПерестановкиДоПорКТК = ПолучитьТДПоНакладнойЭтран(СтруктураЖДНПодсыла.НакладнаяПодсылаВагонаСсылка); 
				//)
				//Евросиб - АСуслов 22.11.2022 12:34:27 #61531
			КонецЕсли;
		КонецЕсли;
		
		// Евросиб US 86202 TA 109222 Рыбьяков К.А. 11.04.2025 (( Закомментировал, подбор данной ждн больше не актуален. Смотреть таск 109222
		Если Не ЗначениеЗаполнено(ДатаНачалаРаботыНовогоАлгоритмаПодбораЖДН) И ОбъектСделка.Дата > ДатаНачалаРаботыНовогоАлгоритмаПодбораЖДН Тогда
			// 4.1 ПОДСЫЛ ВАГОНА ПОД ПОРОЖНИЙ КТК ЖДН
			Если ЗначениеЗаполнено(ЖДНПодсылКТК.НакладнаяКТК) Тогда
				//ЖДНПодсылВагонов = НайтиПодсылПорожнегоВагонаПоЭТРАН(ЖДНПодсылКТК.ВагонПорожнегоКТК, ЖДНПодсылКТК.РаскредитацияКТК, ЖДНПодсылКТК.СтанцияПогрузкиКТК, ГоризонтПоискаНакладныхПодсыла, ЖДНПодсылКТК.НакладнаяКТК); 
				//ДИТ Авдеева В.С. 47101 05.09.2022 Начало
				//СтруктураЖДНПодсылВагонов = НайтиПодсылПорожнегоВагонаПоЭТРАН(ЖДНПодсылКТК.ВагонПорожнегоКТК, ЖДНПодсылКТК.РаскредитацияКТК, ЖДНПодсылКТК.СтанцияПогрузкиКТК, ГоризонтПоискаНакладныхПодсыла, ЖДНПодсылКТК.НакладнаяКТК);
				СтруктураЖДНПодсылВагонов = НайтиПодсылПорожнегоВагонаПоЭТРАН(ЖДНПодсылКТК.ВагонПорожнегоКТК, ЖДНПодсылКТК.РаскредитацияКТК, ЖДНПодсылКТК.СтанцияПогрузкиКТК, ГоризонтПоискаНакладныхПодсыла, ЖДНПодсылКТК.НакладнаяКТК,,,Ложь);
				//ДИТ Авдеева В.С. 47101 05.09.2022 Конец
				ЖДНПодсылВагонов = СтруктураЖДНПодсылВагонов.НакладнаяПодсылаВагонаСсылка;
				Если ЗначениеЗаполнено(ЖДНПодсылВагонов) тогда
					Стр.НомерПорожнейВагоннойЖДН = СтруктураЖДНПодсылВагонов.НакладнаяПодсылаВагона; 
					//Евросиб - АСуслов 16.09.2021 14:03:26 #
					//(
					Стр.ПорожняяВагоннаяЖДН = ПолучитьТДПоНакладнойЭтран(ЖДНПодсылВагонов); 
					//)
					//Евросиб - АСуслов 16.09.2021 14:03:26 #
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		// Евросиб Рыбьяков К.А. 11.04.2025 ))
	КонецЦикла;
	
	// блок поиска накладных после груженого плеча. по хронологии данные накладные появляются после появления груженых.
	ТребуетсяЛиПоискНакладной = Новый Соответствие;
	Для каждого Стр из ОбъектСделка.СвязьУчетныхЕдиниц Цикл
		
		//Евросиб - АСуслов 22.09.2022 15:40:15 #56288
		//(
		Если Стр.ВидТранспортногоСообщения = Перечисления.ВидыТранспортныхСообщений.Море Тогда
			Продолжить;
		КонецЕсли;
		//)
		//Евросиб - АСуслов 22.09.2022 15:40:15 #56288
		
		// Евросиб Фролов (15.04.2022 Task №48577
		Если ДобавленныеСтроки <> Неопределено Тогда
			Если ДобавленныеСтроки.Найти(Стр.ГУИД) = Неопределено Тогда
				Продолжить;
			КонецЕсли;	
		КонецЕсли;	
		// Евросиб Фролов)
		
		Если НЕ ЗначениеЗаполнено(Стр.Калькуляция) ИЛИ НЕ ЗначениеЗаполнено(Стр.Вагон) Тогда Продолжить; КонецЕсли;
		
		ТребуетсяПоискНакладной = ТребуетсяЛиПоискНакладной.Получить(Стр.Калькуляция);
		Если ТребуетсяПоискНакладной = неопределено Тогда
			ТребуетсяПоискНакладной = Ложь;
			Для каждого СтрКальк из Стр.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки Цикл
				Если (СтрКальк.Услуга.УслугаРасходовВыбираетсяПриУсловии = 1 ИЛИ СтрКальк.Услуга.УслугаРасходовВыбираетсяПриУсловии = 2) И ЗначениеЗаполнено(СтрКальк.ГруппаУслуг) Тогда
					ТребуетсяПоискНакладной = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			ТребуетсяЛиПоискНакладной.Вставить(Стр.Калькуляция, ТребуетсяПоискНакладной);
		КонецЕсли;
		Если ТребуетсяПоискНакладной = Истина Тогда
			
			//Если НЕ ЗначениеЗаполнено(Стр.НакладнаяПослеГруженогоПлеча) Тогда
			Если НЕ ЗначениеЗаполнено(Стр.НакладнаяПослеГруженогоПлеча) ИЛИ МассивГУИДпоКоторымИзменилсяВагон.Найти(Стр.ГУИД)<>Неопределено Тогда //ДИТ, Беляев СЮ, US 69796/ TA 76295, 15-12-2023, перезаполнить при измении вагона
				//Стр.НакладнаяПослеГруженогоПлеча = НайтиПорожнююНакладнуюПослеГруженогоЭТРАН_поискВАГОН(Стр.Вагон.Наименование, Стр.ЖДН.ДатаПрибытия, ОбъектСделка.СтанцияНазначения, ГоризонтПоискаНакладныхПодсыла, "");
				//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, начало
				Стр.НакладнаяПослеГруженогоПлеча = НайтиПорожнююНакладнуюПослеГруженогоЭТРАН_поискВАГОН(Стр.Вагон.Наименование, Стр.ЖДН.ДатаПрибытия, МассивСтанцийНазначений, ГоризонтПоискаНакладныхПодсыла, "");
				//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, конец
				Если ЗначениеЗаполнено(Стр.НакладнаяПослеГруженогоПлеча) Тогда Результат = 1; КонецЕсли;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Стр.НакладнаяПослеГружКТК) Тогда
				//Стр.НакладнаяПослеГружКТК = НайтиПорожнююНакладнуюПослеГруженогоЭТРАН_поискКТК(Стр.Контейнер.Наименование, Стр.ждн.ДатаПрибытия, ОбъектСделка.СтанцияНазначения, 90, "");
				//РезультатПодбора = НайтиПорожнююНакладнуюПослеГруженогоЭТРАН_поискКТК(Стр.Контейнер.Наименование, Стр.ждн.ДатаПрибытия, ОбъектСделка.СтанцияНазначения, 90, "");
				//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, начало
				РезультатПодбора = НайтиПорожнююНакладнуюПослеГруженогоЭТРАН_поискКТК(Стр.Контейнер.Наименование, Стр.ждн.ДатаПрибытия, МассивСтанцийНазначений, 90, "");
				//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, конец
				Стр.НакладнаяПослеГружКТК = РезультатПодбора.НакладнаяПодсылаВагона;
				Стр.ВагонПересылаПорКТК = РезультатПодбора.ВагонСсылка;
				Если ЗначениеЗаполнено(Стр.НакладнаяПослеГружКТК) Тогда Результат = 1; КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	//Евросиб Каблов 27.07.2023 ( #72568
	//Евросиб Каблов 10.06.2025 ( #111512
	//ЗаполнитьРейсыВСоставеПоезда(ОбъектСделка);
	ПерезаполнениеСделкиСервер.ЗаполнитьРейсыВСоставеПоезда(ОбъектСделка);
	//Евросиб Каблов 10.06.2025 )
	//Евросиб Каблов 27.07.2023 )
	
#Область БлокЗапретов	
	//// SIV 02-06-21 Блок запретов на подбор накладных в сделку
	//МассивНастроенныхВидовНакладных = РаботаСоСделкамиСервер.ПолучитьСписокФильтрующихсяНакладных();
	//ВсеОшибкиСообщать = Истина;
	//
	//Для каждого Стр из ОбъектСделка.СвязьУчетныхЕдиниц Цикл
	//	
	//	// Евросиб Фролов (15.04.2022 Task №48577
	//	Если ДобавленныеСтроки <> Неопределено Тогда
	//		Если ДобавленныеСтроки.Найти(Стр.ГУИД) = Неопределено Тогда
	//			Продолжить;
	//		КонецЕсли;	
	//	КонецЕсли;	
	//	// Евросиб Фролов)
	//	
	//	ИскПоле = "НомерПорожнейВагоннойЖДН";
	//	ИскВНакл = Перечисления.НастройкаПодбораНакладных_ВидыНакладных.ПодсылВагонаПодКТК;
	//	ИскОписание = "подсыла вагона под порожний КТК";
	//	Если ЗначениеЗаполнено(Стр[ИскПоле]) И МассивНастроенныхВидовНакладных.Найти(ИскВНакл) <> Неопределено Тогда
	//		РезРазрешения = РаботаСоСделкамиСервер.НакладнаяСоответствуетПравилам(Стр[ИскПоле], ИскВНакл);
	//		Если РезРазрешения = Ложь Тогда
	//			Если ВсеОшибкиСообщать Тогда
	//				// Евросиб Фролов (03.03.2022
	//				ТекстСообщения = "ЖДН " + ИскОписание + " не соответствует настройкам. Исключена из сделки: " + Стр[ИскПоле] + " КТК " + Стр.Контейнер;
	//				МассивСообщений.Добавить("" + ОбъектСделка.Ссылка + ": " + ТекстСообщения);
	//				Сообщить(ТекстСообщения);
	//				//Сообщить("ЖДН " + ИскОписание + " не соответствует настройкам. Исключена из сделки: " + Стр[ИскПоле] + " КТК " + Стр.Контейнер);
	//				// Евросиб Фролов 03.03.2022)
	//			КонецЕсли;
	//			Стр[ИскПоле] = неопределено;
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//	ИскПоле = "НомерВагоннойЖДН";
	//	ИскВНакл = Перечисления.НастройкаПодбораНакладных_ВидыНакладных.ПодсылВагона;
	//	ИскОписание = "подсыла вагона";
	//	Если ЗначениеЗаполнено(Стр[ИскПоле]) И МассивНастроенныхВидовНакладных.Найти(ИскВНакл) <> Неопределено Тогда
	//		РезРазрешения = РаботаСоСделкамиСервер.НакладнаяСоответствуетПравилам(Стр[ИскПоле], ИскВНакл);
	//		Если РезРазрешения = Ложь Тогда
	//			Если ВсеОшибкиСообщать Тогда
	//				// Евросиб Фролов (03.03.2022
	//				ТекстСообщения = "ЖДН " + ИскОписание + " не соответствует настройкам. Исключена из сделки: " + Стр[ИскПоле] + " КТК " + Стр.Контейнер;
	//				МассивСообщений.Добавить("" + ОбъектСделка.Ссылка + ": " + ТекстСообщения);
	//				Сообщить(ТекстСообщения);
	//				//Сообщить("ЖДН " + ИскОписание + " не соответствует настройкам. Исключена из сделки: " + Стр[ИскПоле] + " КТК " + Стр.Контейнер);
	//				// Евросиб Фролов 03.03.2022)
	//			КонецЕсли;
	//			Стр[ИскПоле] = неопределено;
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//	ИскПоле = "НомерПорожнейЖДНКТК";
	//	ИскВНакл = Перечисления.НастройкаПодбораНакладных_ВидыНакладных.ПодсылКТК;
	//	ИскОписание = "подсыла КТК";
	//	Если ЗначениеЗаполнено(Стр[ИскПоле]) И МассивНастроенныхВидовНакладных.Найти(ИскВНакл) <> Неопределено Тогда
	//		РезРазрешения = РаботаСоСделкамиСервер.НакладнаяСоответствуетПравилам(Стр[ИскПоле], ИскВНакл);
	//		Если РезРазрешения = Ложь Тогда
	//			Если ВсеОшибкиСообщать Тогда
	//				// Евросиб Фролов (03.03.2022
	//				ТекстСообщения = "ЖДН " + ИскОписание + " не соответствует настройкам. Исключена из сделки: " + Стр[ИскПоле] + " КТК " + Стр.Контейнер;
	//				МассивСообщений.Добавить("" + ОбъектСделка.Ссылка + ": " + ТекстСообщения);
	//				Сообщить(ТекстСообщения);
	//				//Сообщить("ЖДН " + ИскОписание + " не соответствует настройкам. Исключена из сделки: " + Стр[ИскПоле] + " КТК " + Стр.Контейнер);
	//				// Евросиб Фролов 03.03.2022)
	//			КонецЕсли;
	//			Стр[ИскПоле] = неопределено;
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//	ИскПоле = "ЖДН";
	//	ИскВНакл = Перечисления.НастройкаПодбораНакладных_ВидыНакладных.Груженая;
	//	ИскОписание = "груженая";
	//	Если ЗначениеЗаполнено(Стр[ИскПоле]) И МассивНастроенныхВидовНакладных.Найти(ИскВНакл) <> Неопределено Тогда
	//		РезРазрешения = РаботаСоСделкамиСервер.НакладнаяСоответствуетПравилам(Стр[ИскПоле], ИскВНакл);
	//		Если РезРазрешения = Ложь Тогда
	//			Если ВсеОшибкиСообщать Тогда
	//				// Евросиб Фролов (03.03.2022
	//				ТекстСообщения = "ЖДН " + ИскОписание + " не соответствует настройкам. Исключена из сделки: " + Стр[ИскПоле] + " КТК " + Стр.Контейнер;
	//				МассивСообщений.Добавить("" + ОбъектСделка.Ссылка + ": " + ТекстСообщения);
	//				Сообщить(ТекстСообщения);
	//				//Сообщить("ЖДН " + ИскОписание + " не соответствует настройкам. Исключена из сделки: " + Стр[ИскПоле] + " КТК " + Стр.Контейнер);
	//				// Евросиб Фролов 03.03.2022)
	//			КонецЕсли;
	//			Стр[ИскПоле] = неопределено;
	//			Стр.НомерЖДН = неопределено; // SIV: да, красиво не получится :(
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//	ИскПоле = "НакладнаяПослеГруженогоПлеча";
	//	ИскВНакл = Перечисления.НастройкаПодбораНакладных_ВидыНакладных.ВозвратВагона;
	//	ИскОписание = "возврата вагона";
	//	Если ЗначениеЗаполнено(Стр[ИскПоле]) И МассивНастроенныхВидовНакладных.Найти(ИскВНакл) <> Неопределено Тогда
	//		РезРазрешения = РаботаСоСделкамиСервер.НакладнаяСоответствуетПравилам(Стр[ИскПоле], ИскВНакл);
	//		Если РезРазрешения = Ложь Тогда
	//			Если ВсеОшибкиСообщать Тогда
	//				// Евросиб Фролов (03.03.2022
	//				ТекстСообщения = "ЖДН " + ИскОписание + " не соответствует настройкам. Исключена из сделки: " + Стр[ИскПоле] + " КТК " + Стр.Контейнер;
	//				МассивСообщений.Добавить("" + ОбъектСделка.Ссылка + ": " + ТекстСообщения);
	//				Сообщить(ТекстСообщения);
	//				//Сообщить("ЖДН " + ИскОписание + " не соответствует настройкам. Исключена из сделки: " + Стр[ИскПоле] + " КТК " + Стр.Контейнер);
	//				// Евросиб Фролов 03.03.2022)
	//			КонецЕсли;
	//			Стр[ИскПоле] = неопределено;
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//	ИскПоле = "НакладнаяПослеГружКТК";
	//	ИскВНакл = Перечисления.НастройкаПодбораНакладных_ВидыНакладных.ВозвратКТК;
	//	ИскОписание = "возврата КТК";
	//	Если ЗначениеЗаполнено(Стр[ИскПоле]) И МассивНастроенныхВидовНакладных.Найти(ИскВНакл) <> Неопределено Тогда
	//		РезРазрешения = РаботаСоСделкамиСервер.НакладнаяСоответствуетПравилам(Стр[ИскПоле], ИскВНакл);
	//		Если РезРазрешения = Ложь Тогда
	//			Если ВсеОшибкиСообщать Тогда
	//				// Евросиб Фролов (03.03.2022
	//				ТекстСообщения = "ЖДН " + ИскОписание + " не соответствует настройкам. Исключена из сделки: " + Стр[ИскПоле] + " КТК " + Стр.Контейнер;
	//				МассивСообщений.Добавить("" + ОбъектСделка.Ссылка + ": " + ТекстСообщения);
	//				Сообщить(ТекстСообщения);
	//				//Сообщить("ЖДН " + ИскОписание + " не соответствует настройкам. Исключена из сделки: " + Стр[ИскПоле] + " КТК " + Стр.Контейнер);;
	//				// Евросиб Фролов 03.03.2022)
	//			КонецЕсли;
	//			Стр[ИскПоле] = неопределено;
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//КонецЦикла;
#КонецОбласти 

	Возврат Результат;
	
КонецФункции

//ДИТ, Беляев СЮ, US 69796/ TA 76295, 15-12-2023, начало
//Функция ПолучитьРеквизитыНакладной( ЖДН ) 
Функция ПолучитьРеквизитыНакладной( ЖДН, КонтейнерСсылка ) //ДИТ, Беляев СЮ, Ticket#0339735, 26-01-2024, добавлен параметр КонтейнерСсылка
	Результат = Новый Структура("НомерЖДН, СсылкаЖДН, Вагон, Охрана");
	
	Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	э_НакладнаяВагоны.Ссылка.НакладнаяНомер КАК НакладнаяНомер,
	//	|	э_НакладнаяВагоны.НомерВагона КАК НомерВагона,
	//	|	э_НакладнаяВагоны.Ссылка.Охрана КАК Охрана,
	//	|	ТС.Ссылка КАК ВагонСсылка,
	//	|	ТранспортныйДокумент.Ссылка КАК ТД_Ссылка
	//	|ИЗ
	//	|	Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
	//	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТС КАК ТС
	//	|			ПО э_НакладнаяВагоны.НомерВагона = ТС.Наименование
	//	|		ПО ТранспортныйДокумент.НакладнаяЭТРАН = э_НакладнаяВагоны.Ссылка
	//	|ГДЕ
	//	|	ТранспортныйДокумент.Ссылка = &ЖДН";
	//ДИТ, Беляев СЮ, Ticket#0339735, 26-01-2024, начало
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	э_Накладная.НакладнаяНомер КАК НакладнаяНомер,
		|	ТранспортныйДокументУчетныеЕдиницы.НомерВагона КАК НомерВагона,
		|	э_Накладная.Охрана КАК Охрана,
		|	ТранспортныйДокументУчетныеЕдиницы.Вагон КАК ВагонСсылка,
		|	ТранспортныйДокумент.Ссылка КАК ТД_Ссылка
		|ИЗ
		|	Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная КАК э_Накладная
		|		ПО ТранспортныйДокумент.НакладнаяЭТРАН = э_Накладная.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент.УчетныеЕдиницы КАК ТранспортныйДокументУчетныеЕдиницы
		|		ПО ТранспортныйДокумент.Ссылка = ТранспортныйДокументУчетныеЕдиницы.Ссылка
		|			И (ТранспортныйДокументУчетныеЕдиницы.Контейнер = &КонтейнерСсылка)
		|			И (ТранспортныйДокументУчетныеЕдиницы.Вагон.Наименование <> """")
		|ГДЕ
		|	ТранспортныйДокумент.Ссылка = &ЖДН";
	//ДИТ, Беляев СЮ, Ticket#0339735, 26-01-2024, конец
	
	Запрос.УстановитьПараметр("ЖДН", ЖДН);
	//ДИТ, Беляев СЮ, Ticket#0339735, 26-01-2024, начало
	Запрос.УстановитьПараметр("КонтейнерСсылка", КонтейнерСсылка); 
	//ДИТ, Беляев СЮ, Ticket#0339735, 26-01-2024, конец
	
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		
		Результат.НомерЖДН = Ответ.НакладнаяНомер;
		Результат.СсылкаЖДН = Ответ.ТД_Ссылка;
		Результат.Вагон = Ответ.ВагонСсылка;
		Если НЕ ЗначениеЗаполнено(Ответ.ВагонСсылка) И ЗначениеЗаполнено(Ответ.НомерВагона) Тогда
			Результат.Вагон = РаботаСКонтейнерамиСервер.ПолучитьВагонПоНомеру(Ответ.НомерВагона);
		КонецЕсли;
		Результат.Охрана = Ответ.Охрана;
		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции
//ДИТ, Беляев СЮ, US 69796/ TA 76295, 15-12-2023, конец

//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, начало
Функция ПолучитьДанныеИзРейсовСделки(ОбъектСделка)
	
	Результат = Новый Структура();
	Результат.Вставить("ДатаМин", Дата("00010101"));
	Результат.Вставить("ДатаМакс", Дата("00010101"));
	Результат.Вставить("МассивСтанцийОтправления", Новый Массив);
	Результат.Вставить("МассивСтанцийНазначений", Новый Массив);
	
	МассивРейсов = ОбъектСделка.Рейсы.Выгрузить().ВыгрузитьКолонку("Рейс");
	Если МассивРейсов.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	//Евросиб Шевченко А.В. US 102893 TA 114464 14.07.2025
	
	Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	РейсыЖД.ДатаОтправления КАК ДатаОтправления,
	//|	РейсыЖД.ДатаПрибытия КАК ДатаПрибытия,
	//|	РейсыЖД.ПунктОтправления КАК ПунктОтправления,
	//|	РейсыЖД.ПунктНазначения КАК ПунктНазначения
	//|ПОМЕСТИТЬ ВТ
	//|ИЗ
	//|	Справочник.РейсыЖД КАК РейсыЖД
	//|ГДЕ
	//|	РейсыЖД.Ссылка В(&РейсыСделки)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	МАКСИМУМ(ВТ.ДатаОтправления) КАК ДатаОтправления,
	//|	МАКСИМУМ(ВТ.ДатаПрибытия) КАК ДатаПрибытия
	//|ИЗ
	//|	ВТ КАК ВТ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВТ.ПунктОтправления КАК ПунктОтправления,
	//|	ВТ.ПунктНазначения КАК ПунктНазначения
	//|ИЗ
	//|	ВТ КАК ВТ
	//|ГДЕ
	//|	ВТ.ПунктОтправления <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	//|	И ВТ.ПунктНазначения <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)";
	 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РейсыЖД.ДатаПрибытия КАК ДатаПрибытия,
	|	РейсыЖД.ПунктНазначения КАК ПунктНазначения,
	|	РейсыЖД.СвязанныйРейс КАК СвязанныйРейс
	|ПОМЕСТИТЬ ВТ_ПерегрузИсхВСделке
	|ИЗ
	|	Справочник.РейсыЖД КАК РейсыЖД
	|ГДЕ
	|	РейсыЖД.Ссылка В(&РейсыСделки)
	|	И РейсыЖД.Перегруз
	|	И НЕ РейсыЖД.Входящий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РейсыЖДВхд.ДатаОтправления КАК ДатаОтправления,
	|	РейсыЖДВхд.ПунктОтправления КАК ПунктОтправления,
	|	ВТ_ПерегрузИсхВСделке.ДатаПрибытия КАК ДатаПрибытия,
	|	ВТ_ПерегрузИсхВСделке.ПунктНазначения КАК ПунктНазначения
	|ПОМЕСТИТЬ ВТ_ПерегрузВхдИсх
	|ИЗ
	|	ВТ_ПерегрузИсхВСделке КАК ВТ_ПерегрузИсхВСделке
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РейсыЖД КАК РейсыЖДВхд
	|		ПО (РейсыЖДВхд.Ссылка = ВТ_ПерегрузИсхВСделке.СвязанныйРейс)
	|			И (РейсыЖДВхд.Входящий)
	|			И (РейсыЖДВхд.Перегруз)
	|;
	|
	|ВЫБРАТЬ
	|	РейсыЖД.ДатаОтправления КАК ДатаОтправления,
	|	РейсыЖД.ПунктОтправления КАК ПунктОтправления,
	|	РейсыЖД.СвязанныйРейс КАК СвязанныйРейс
	|ПОМЕСТИТЬ ВТ_ПерегрузВхдВСделке
	|ИЗ
	|	Справочник.РейсыЖД КАК РейсыЖД
	|ГДЕ
	|	РейсыЖД.Ссылка В(&РейсыСделки)
	|	И РейсыЖД.Перегруз
	|	И РейсыЖД.Входящий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПерегрузВхдВСделке.ДатаОтправления КАК ДатаОтправления,
	|	ВТ_ПерегрузВхдВСделке.ПунктОтправления КАК ПунктОтправления,
	|	РейсыЖДИсх.ДатаПрибытия КАК ДатаПрибытия,
	|	РейсыЖДИсх.ПунктНазначения КАК ПунктНазначения
	|ПОМЕСТИТЬ ВТ_ПерегрузИсхВхд
	|ИЗ
	|	ВТ_ПерегрузВхдВСделке КАК ВТ_ПерегрузВхдВСделке
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РейсыЖД КАК РейсыЖДИсх
	|		ПО (РейсыЖДИсх.Ссылка = ВТ_ПерегрузВхдВСделке.СвязанныйРейс)
	|			И (НЕ РейсыЖДИсх.Входящий)
	|			И (РейсыЖДИсх.Перегруз)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПерегрузВхдИсх.ДатаОтправления КАК ДатаОтправления,
	|	ВТ_ПерегрузВхдИсх.ДатаПрибытия КАК ДатаПрибытия,
	|	ВТ_ПерегрузВхдИсх.ПунктОтправления КАК ПунктОтправления,
	|	ВТ_ПерегрузВхдИсх.ПунктНазначения КАК ПунктНазначения
	|ПОМЕСТИТЬ ВТ_Перегруз
	|ИЗ
	|	ВТ_ПерегрузВхдИсх КАК ВТ_ПерегрузВхдИсх
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_ПерегрузИсхВхд.ДатаОтправления,
	|	ВТ_ПерегрузИсхВхд.ДатаПрибытия,
	|	ВТ_ПерегрузИсхВхд.ПунктОтправления,
	|	ВТ_ПерегрузИсхВхд.ПунктНазначения
	|ИЗ
	|	ВТ_ПерегрузИсхВхд КАК ВТ_ПерегрузИсхВхд
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РейсыЖД.ДатаОтправления КАК ДатаОтправления,
	|	РейсыЖД.ДатаПрибытия КАК ДатаПрибытия,
	|	РейсыЖД.ПунктОтправления КАК ПунктОтправления,
	|	РейсыЖД.ПунктНазначения КАК ПунктНазначения
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Справочник.РейсыЖД КАК РейсыЖД
	|ГДЕ
	|	РейсыЖД.Ссылка В(&РейсыСделки)
	|	И НЕ РейсыЖД.Перегруз
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Перегруз.ДатаОтправления,
	|	ВТ_Перегруз.ДатаПрибытия,
	|	ВТ_Перегруз.ПунктОтправления,
	|	ВТ_Перегруз.ПунктНазначения
	|ИЗ
	|	ВТ_Перегруз КАК ВТ_Перегруз
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ.ДатаОтправления) КАК ДатаОтправления,
	|	МАКСИМУМ(ВТ.ДатаПрибытия) КАК ДатаПрибытия
	|ИЗ
	|	ВТ КАК ВТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ.ПунктОтправления КАК ПунктОтправления,
	|	ВТ.ПунктНазначения КАК ПунктНазначения
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВТ.ПунктОтправления <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|	И ВТ.ПунктНазначения <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)";
	
	//Евросиб Шевченко А.В. US 102893 TA 114464 14.07.2025
	
	Запрос.УстановитьПараметр("РейсыСделки", МассивРейсов);
	РезультатЗапросаПакет = Запрос.ВыполнитьПакет();
	ВыборкаПериода = РезультатЗапросаПакет[РезультатЗапросаПакет.Количество()-2].Выбрать();
	Если ВыборкаПериода.Следующий() Тогда
		Результат.ДатаМин = ВыборкаПериода.ДатаОтправления;
		Результат.ДатаМакс = ВыборкаПериода.ДатаПрибытия;
	КонецЕсли;
	ТаблицаСтанций = РезультатЗапросаПакет[РезультатЗапросаПакет.Количество()-1].Выгрузить();
	Результат.МассивСтанцийОтправления  = ТаблицаСтанций.ВыгрузитьКолонку("ПунктОтправления");
	Результат.МассивСтанцийНазначений = ТаблицаСтанций.ВыгрузитьКолонку("ПунктНазначения");
	
	Возврат Результат;

КонецФункции
//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, конец

Функция НайтиПорожнююНакладнуюПослеГруженогоЭТРАН_поискВАГОН(Вагон, ДатаНачалаПоиска, СтанцияОтправления, ГоризонтПоискаНакладныхПодсыла, ИсключаяНакладную = "") Экспорт
	
	НакладнаяПодсылаВагона = неопределено;
	
	КодыЕТСНГПорожниеВагоны = э_ОбщиеСервер.МассивКодовЕТСНГ_ПорожниеВагоны();
	//КодыЕТСНГПорожниеКТК = э_ОбщиеСервер.МассивКодовЕТСНГ_ПорожниеКТК();
	
	//ВсеКодыВсехАналоговСтанции = Локации_сервер.ПолучитьКодыАналоговСтанцииПоКоду(СтанцияОтправления.КодЖДСтанции);
	//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, начало
	Если ТипЗнч(СтанцияОтправления) = Тип("Массив") Тогда
		ВсеКодыВсехАналоговСтанции = Локации_сервер.ПолучитьКодыАналоговСтанций(СтанцияОтправления);	
	Иначе
		ВсеКодыВсехАналоговСтанции = Локации_сервер.ПолучитьКодыАналоговСтанцииПоКоду(СтанцияОтправления.КодЖДСтанции);
	КонецЕсли;
	//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, конец
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ первые 1
				   |	э_НакладнаяВагоны.Ссылка.ДатаИВремяОтправленияГруза КАК УчетнаяДата,
	               |	э_НакладнаяВагоны.Ссылка КАК Ссылка,
	               |	э_НакладнаяВагоны.Ссылка.НакладнаяНомер КАК НакладнаяНомер
	               |ИЗ
	               |	Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
	               |ГДЕ
	               |	э_НакладнаяВагоны.НомерВагона = &НомерВагона
	               |	И НЕ э_НакладнаяВагоны.Ссылка.ПометкаУдаления
	               |	И э_НакладнаяВагоны.Ссылка.ТекущееСостояниеНакладнойДействующийСтатус
	               |	И э_НакладнаяВагоны.Ссылка.ДатаИВремяОтправленияГруза МЕЖДУ &ДатаНачалаПоиска И &ГоризонтПоискаНакладныхПодсыла
	               |	И э_НакладнаяВагоны.Ссылка.НакладнаяНомер <> &ИсключаяНакладную
				   |	И э_НакладнаяВагоны.Ссылка.ТипНакладной <> &ДосылочнаяНакладная
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	УчетнаяДата ВОЗР";
	Запрос.УстановитьПараметр("НомерВагона", Вагон);
	Запрос.УстановитьПараметр("ДатаНачалаПоиска", ДатаНачалаПоиска);
	Запрос.УстановитьПараметр("ИсключаяНакладную", ИсключаяНакладную);
	Запрос.УстановитьПараметр("ГоризонтПоискаНакладныхПодсыла", ДатаНачалаПоиска+ГоризонтПоискаНакладныхПодсыла*24*3600);
	//ДИТ Шевченко А.В 01.08.2022 53548 -Начало
	Запрос.УстановитьПараметр("ДосылочнаяНакладная", Справочники.э_ОбщиеПоказатели.ДосылочнаяНакладная);
	//ДИТ Шевченко А.В 01.08.2022 53548 -Конец
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		
		УсловиеГрузаСоблюдено = Ложь;
		УсловиеСтанцииСоблюдено = Ложь;
		
		УсловиеСтанцииСоблюдено = ВсеКодыВсехАналоговСтанции.Найти(Ответ.Ссылка.СтанцияОтправленияКод) <> неопределено;
		Для каждого Стр из Ответ.Ссылка.ГрузыЖД Цикл
			УсловиеГрузаСоблюдено = УсловиеГрузаСоблюдено ИЛИ КодыЕТСНГПорожниеВагоны.Найти(Стр.ЕТСНГ.Код) <> неопределено;
		КонецЦикла;
		
		Если УсловиеГрузаСоблюдено И УсловиеСтанцииСоблюдено Тогда 
			
			НакладнаяПодсылаВагона = Связь_ЭТРАН_DC.ПолучитьТрДокПоЭ_Накладной(Ответ.Ссылка);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НакладнаяПодсылаВагона;
	
КонецФункции

Функция НайтиПорожнююНакладнуюПослеГруженогоЭТРАН_поискКТК(КТК, ДатаНачалаПоиска, СтанцияОтправления, ГоризонтПоискаНакладныхПодсыла, ИсключаяНакладную = "") Экспорт
	
	НакладнаяПодсылаВагона = неопределено;
	ВагонСсылка = Неопределено;
	
	//КодыЕТСНГПорожниеВагоны = э_ОбщиеСервер.МассивКодовЕТСНГ_ПорожниеВагоны();
	КодыЕТСНГПорожниеКТК = э_ОбщиеСервер.МассивКодовЕТСНГ_ПорожниеКТК();
	
	//ВсеКодыВсехАналоговСтанции = Локации_сервер.ПолучитьКодыАналоговСтанцииПоКоду(СтанцияОтправления.КодЖДСтанции);
	//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, начало
	Если ТипЗнч(СтанцияОтправления) = Тип("Массив") Тогда
		ВсеКодыВсехАналоговСтанции = Локации_сервер.ПолучитьКодыАналоговСтанций(СтанцияОтправления);	
	Иначе
		ВсеКодыВсехАналоговСтанции = Локации_сервер.ПолучитьКодыАналоговСтанцииПоКоду(СтанцияОтправления.КодЖДСтанции);
	КонецЕсли;
	//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, конец
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяОтправленияГруза КАК УчетнаяДата,
	|	э_НакладнаяКонтейнеры.Ссылка КАК Ссылка,
	|	э_НакладнаяКонтейнеры.Ссылка.НакладнаяНомер КАК НакладнаяНомер,
	|	ТС.Ссылка КАК ВагонСсылка
	|ИЗ
	|	Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТС КАК ТС
	|			ПО (э_НакладнаяВагоны.НомерВагона = ТС.Наименование)
	|				И (НЕ ТС.ПометкаУдаления)
	|		ПО э_НакладнаяКонтейнеры.Ссылка = э_НакладнаяВагоны.Ссылка
	|			И (э_НакладнаяКонтейнеры.НомерВагонаДляКонтейнерногоПоезда = э_НакладнаяВагоны.ПорядковыйНомерВагонаВОтправке
	|				ИЛИ э_НакладнаяКонтейнеры.НомерВагонаДляКонтейнерногоПоезда = 0)
	|ГДЕ
	|	НЕ э_НакладнаяКонтейнеры.Ссылка.ПометкаУдаления
	|	И э_НакладнаяКонтейнеры.Ссылка.ТекущееСостояниеНакладнойДействующийСтатус
	|	И э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяОтправленияГруза МЕЖДУ &ДатаНачалаПоиска И &ГоризонтПоискаНакладныхПодсыла
	|	И э_НакладнаяКонтейнеры.Ссылка.НакладнаяНомер <> &ИсключаяНакладную
	|	И э_НакладнаяКонтейнеры.НомерКонтейнера = &НомерКонтейнера
	|	И э_НакладнаяКонтейнеры.Ссылка.ТипНакладной <> &ДосылочнаяНакладная
	|
	|УПОРЯДОЧИТЬ ПО
	|	УчетнаяДата";
	Запрос.УстановитьПараметр("НомерКонтейнера", КТК);
	Запрос.УстановитьПараметр("ДатаНачалаПоиска", ДатаНачалаПоиска);
	Запрос.УстановитьПараметр("ИсключаяНакладную", ИсключаяНакладную);
	Запрос.УстановитьПараметр("ГоризонтПоискаНакладныхПодсыла", ДатаНачалаПоиска+ГоризонтПоискаНакладныхПодсыла*24*3600);
	//ДИТ Шевченко А.В 01.08.2022 53548 -Начало
	Запрос.УстановитьПараметр("ДосылочнаяНакладная", Справочники.э_ОбщиеПоказатели.ДосылочнаяНакладная);
	//ДИТ Шевченко А.В 01.08.2022 53548 -Конец
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		
		УсловиеГрузаСоблюдено = Ложь;
		УсловиеСтанцииСоблюдено = Ложь;
		
		УсловиеСтанцииСоблюдено = ВсеКодыВсехАналоговСтанции.Найти(Ответ.Ссылка.СтанцияОтправленияКод) <> неопределено;
		Для каждого Стр из Ответ.Ссылка.ГрузыЖД Цикл
			УсловиеГрузаСоблюдено = УсловиеГрузаСоблюдено ИЛИ КодыЕТСНГПорожниеКТК.Найти(Стр.ЕТСНГ.Код) <> неопределено;
		КонецЦикла;
		
		Если УсловиеГрузаСоблюдено И УсловиеСтанцииСоблюдено Тогда 
			
			НакладнаяПодсылаВагона = Связь_ЭТРАН_DC.ПолучитьТрДокПоЭ_Накладной(Ответ.Ссылка);
			ВагонСсылка = Ответ.ВагонСсылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый Структура("НакладнаяПодсылаВагона, ВагонСсылка", НакладнаяПодсылаВагона, ВагонСсылка);
	
КонецФункции

//ДИТ Авдеева В.С. 47101 05.09.2022 Начало
//Функция НайтиПодсылПорожнегоВагонаПоЭТРАН(Вагон, ДатаОтправления, СтанцияОтправления, ГоризонтПоискаНакладныхПодсыла, ИсключаяНакладную = "", СтанцияОтправленияСтрогоСоответствуетСтанцииПрибытия = Ложь, ИскатьПоДатеПрибытия = Ложь) Экспорт
Функция НайтиПодсылПорожнегоВагонаПоЭТРАН(Вагон, 
										ДатаОтправления, 
										СтанцияОтправления, 
										ГоризонтПоискаНакладныхПодсыла, 
										ИсключаяНакладную = "", 
										СтанцияОтправленияСтрогоСоответствуетСтанцииПрибытия = Ложь, 
										ИскатьПоДатеПрибытия = Ложь, 
										ИсключатьРемонт = Истина) Экспорт
//ДИТ Авдеева В.С. 47101 05.09.2022 Конец
	
	НакладнаяПодсылаВагона = "";
	НакладнаяПодсылаСсылка = неопределено;
	
	КодыЕТСНГПорожниевагоны = э_ОбщиеСервер.МассивКодовЕТСНГ_ПорожниеВагоны();
	
	//ВсеКодыВсехАналоговСтанции = Локации_сервер.ПолучитьКодыАналоговСтанцииПоКоду(СтанцияОтправления);
	//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, начало
	Если ТипЗнч(СтанцияОтправления) = Тип("Массив") Тогда
		ВсеКодыВсехАналоговСтанции = Локации_сервер.ПолучитьКодыАналоговСтанций(СтанцияОтправления);	
	Иначе
		ВсеКодыВсехАналоговСтанции = Локации_сервер.ПолучитьКодыАналоговСтанцииПоКоду(СтанцияОтправления);
	КонецЕсли;
	//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, конец
	
	//Евросиб - АСуслов 20.11.2021 12:50:10 #39798
	//(
	//в запросе добавлено исключение по ожидающим накладным
	//)
	//Евросиб - АСуслов 20.11.2021 12:50:11 #39798  
	//ДИТ Авдеева В.С. 47101 05.09.2022 
	//в запросе добавлено получение признакак ремонта и перед ремонтом
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОжиданиеПодбораНакладнойПослеГруженогоПлеча.УчетнаяЕдиница.Наименование КАК УчетнаяЕдиницаНаименование,
	|	ОжиданиеПодбораНакладнойПослеГруженогоПлеча.Период КАК Период,
	|	ОжиданиеПодбораНакладнойПослеГруженогоПлеча.ЖДН КАК ЖДН,
	|	ОжиданиеПодбораНакладнойПослеГруженогоПлеча.ЖДН.НакладнаяЭТРАН КАК ЖДННакладнаяЭтран,
	|	ОжиданиеПодбораНакладнойПослеГруженогоПлеча.ПериодОжидания КАК ПериодОжидания
	|ПОМЕСТИТЬ ВТ_ОжидающиеУЕ
	|ИЗ
	|	РегистрСведений.ОжиданиеПодбораНакладнойПослеГруженогоПлеча.СрезПоследних(
	|			&ДатаОтправления,
	|			УчетнаяЕдиница ССЫЛКА Справочник.ТС
	|				И УчетнаяЕдиница.Наименование = &НомерВагона) КАК ОжиданиеПодбораНакладнойПослеГруженогоПлеча
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	УчетнаяЕдиницаНаименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА э_НакладнаяВагоны.Ссылка.ДатаИВремяРаскредитованияГруза <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА э_НакладнаяВагоны.Ссылка.ДатаИВремяРаскредитованияГруза
	|		ИНАЧЕ э_НакладнаяВагоны.Ссылка.ДатаИВремяОтправленияГруза
	|	КОНЕЦ КАК УчетнаяДата,
	|	ВЫБОР
	|		КОГДА э_НакладнаяВагоны.Ссылка.ДатаИВремяПрибытияГруза <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА э_НакладнаяВагоны.Ссылка.ДатаИВремяПрибытияГруза
	|		ИНАЧЕ э_НакладнаяВагоны.Ссылка.ДатаИВремяОтправленияГруза
	|	КОНЕЦ КАК ДатаПрибытия,
	|	э_НакладнаяВагоны.Ссылка КАК Ссылка,
	|	э_НакладнаяВагоны.Ссылка.НакладнаяНомер КАК НакладнаяНомер,
	|	э_НакладнаяВагоны.Ссылка.СтанцияНазначенияКод КАК СтанцияНазначенияКод,
	|	ВЫБОР
	|		КОГДА э_НакладнаяСпециальныеОтметки.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоНакладнаяВРемонт,
	|	э_НакладнаяВагоны.Ссылка.СтанцияНазначения КАК СтанцияНазначения
	|ПОМЕСТИТЬ ВТ_НакладныеВагоны
	|ИЗ
	|	Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОжидающиеУЕ КАК ВТ_ОжидающиеУЕ
	|		ПО э_НакладнаяВагоны.НомерВагона = ВТ_ОжидающиеУЕ.УчетнаяЕдиницаНаименование
	|			И э_НакладнаяВагоны.Ссылка.ДатаИВремяОтправленияГруза >= ВТ_ОжидающиеУЕ.Период
	|			И (э_НакладнаяВагоны.Ссылка.ДатаИВремяОтправленияГруза < ДОБАВИТЬКДАТЕ(ВТ_ОжидающиеУЕ.Период, ДЕНЬ, ВТ_ОжидающиеУЕ.ПериодОжидания))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.СпециальныеОтметки КАК э_НакладнаяСпециальныеОтметки
	|		ПО э_НакладнаяВагоны.Ссылка = э_НакладнаяСпециальныеОтметки.Ссылка
	|			И (э_НакладнаяСпециальныеОтметки.ОтметкаИД = 1212)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная КАК э_Накладная
	|		ПО э_НакладнаяВагоны.Ссылка = э_Накладная.Ссылка
	|			И (НЕ э_Накладная.ПометкаУдаления)
	|			И (э_Накладная.ТекущееСостояниеНакладнойДействующийСтатус)
	|			И (ВЫБОР
	|				КОГДА &ПоДатеПрибытия
	|					ТОГДА ВЫБОР
	|							КОГДА э_Накладная.ДатаИВремяПрибытияГруза <> ДАТАВРЕМЯ(1, 1, 1)
	|								ТОГДА э_Накладная.ДатаИВремяПрибытияГруза
	|							ИНАЧЕ э_Накладная.ДатаИВремяОтправленияГруза
	|						КОНЕЦ МЕЖДУ &ДатаОтправленияМинусГоризонт И &ДатаОтправления
	|				ИНАЧЕ ВЫБОР
	|						КОГДА э_Накладная.ДатаИВремяРаскредитованияГруза <> ДАТАВРЕМЯ(1, 1, 1)
	|							ТОГДА э_Накладная.ДатаИВремяРаскредитованияГруза
	|						ИНАЧЕ э_Накладная.ДатаИВремяОтправленияГруза
	|					КОНЕЦ МЕЖДУ &ДатаОтправленияМинусГоризонт И &ДатаОтправления
	|			КОНЕЦ)
	|			И (э_Накладная.НакладнаяНомер <> &ИсключаяНакладную)
	|			И (э_Накладная.ТипНакладной <> &ДосылочнаяНакладная)
	|ГДЕ
	|	э_НакладнаяВагоны.НомерВагона = &НомерВагона
	|	И ВЫБОР
	|			КОГДА ВТ_ОжидающиеУЕ.ЖДН ЕСТЬ NULL
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ НЕ ВТ_ОжидающиеУЕ.ЖДННакладнаяЭтран = э_НакладнаяВагоны.Ссылка
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_НакладныеВагоны.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ НакладныеПередРемонтом
	|ИЗ
	|	ВТ_НакладныеВагоны КАК ВТ_НакладныеВагоны
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная КАК э_Накладная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
	|			ПО э_Накладная.Ссылка = э_НакладнаяВагоны.Ссылка
	|				И (э_НакладнаяВагоны.НомерВагона = &НомерВагона)
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная.СпециальныеОтметки КАК э_НакладнаяСпециальныеОтметки
	|			ПО э_Накладная.Ссылка = э_НакладнаяСпециальныеОтметки.Ссылка
	|				И (э_НакладнаяСпециальныеОтметки.ОтметкаИД = 1212)
	|		ПО (НЕ э_Накладная.ПометкаУдаления)
	|			И ВТ_НакладныеВагоны.СтанцияНазначения = э_Накладная.СтанцияОтправления
	|			И (ВЫБОР
	|				КОГДА э_Накладная.ДатаИВремяРаскредитованияГруза <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА э_Накладная.ДатаИВремяРаскредитованияГруза
	|				ИНАЧЕ э_Накладная.ДатаИВремяПрибытияГруза
	|			КОНЕЦ МЕЖДУ ДОБАВИТЬКДАТЕ(ВТ_НакладныеВагоны.ДатаПрибытия, СЕКУНДА, -1) И &ДатаОтправления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НакладныеВагоны.УчетнаяДата КАК УчетнаяДата,
	|	ВТ_НакладныеВагоны.Ссылка КАК Ссылка,
	|	ВТ_НакладныеВагоны.НакладнаяНомер КАК НакладнаяНомер,
	|	ВТ_НакладныеВагоны.СтанцияНазначенияКод КАК СтанцияНазначенияКод,
	|	ВТ_НакладныеВагоны.ЭтоНакладнаяВРемонт КАК ЭтоНакладнаяВРемонт,
	|	ВЫБОР
	|		КОГДА НакладныеПередРемонтом.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоНакладнаяПередРемонтом
	|ИЗ
	|	ВТ_НакладныеВагоны КАК ВТ_НакладныеВагоны
	|		ЛЕВОЕ СОЕДИНЕНИЕ НакладныеПередРемонтом КАК НакладныеПередРемонтом
	|		ПО ВТ_НакладныеВагоны.Ссылка = НакладныеПередРемонтом.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	УчетнаяДата УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	э_НакладнаяГрузы.Ссылка КАК Ссылка,
	|	э_НакладнаяГрузы.ЕТСНГ.Код КАК ЕТСНГКод
	|ИЗ
	|	Документ.э_Накладная.ГрузыЖД КАК э_НакладнаяГрузы
	|ГДЕ
	|	э_НакладнаяГрузы.Ссылка В
	|			(ВЫБРАТЬ
	|				т.Ссылка
	|			ИЗ
	|				ВТ_НакладныеВагоны КАК т)";
	Запрос.УстановитьПараметр("ПоДатеПрибытия", ИскатьПоДатеПрибытия);
	Запрос.УстановитьПараметр("НомерВагона", Вагон);
	Запрос.УстановитьПараметр("ДатаОтправленияМинусГоризонт", ДатаОтправления-ГоризонтПоискаНакладныхПодсыла*24*3600);
	Запрос.УстановитьПараметр("ИсключаяНакладную", ИсключаяНакладную);
	Запрос.УстановитьПараметр("ДатаОтправления", КонецДня(ДатаОтправления));
	//ДИТ Шевченко А.В 01.08.2022 53548 -Начало
	Запрос.УстановитьПараметр("ДосылочнаяНакладная", Справочники.э_ОбщиеПоказатели.ДосылочнаяНакладная);
	//ДИТ Шевченко А.В 01.08.2022 53548 -Конец
	Пакеты = Запрос.ВыполнитьПакет();
	Ответ = Пакеты[Пакеты.Количество()-2].Выбрать();
	ГрузыЖД = Пакеты[Пакеты.Количество()-1].Выгрузить();
	Если ГрузыЖД.Количество() > 1000 Тогда
		ГрузыЖД.Индексы.Добавить("Ссылка");
	КонецЕсли;
	//Евросиб Каблов 29.04.2021 ( Ticket#0223256
	//Если Ответ.Следующий() Тогда
	Пока Ответ.Следующий() Цикл
	//Евросиб Каблов 29.04.2021 )
		
		УсловиеГрузаСоблюдено = Ложь;
		УсловиеСтанцииСоблюдено = Ложь;
		//ДИТ Авдеева В.С. 47101 05.09.2022 Начало
		УсловиеРемонтаСоблюдено = Истина;
		//ДИТ Авдеева В.С. 47101 05.09.2022 Конец
		
		УсловиеСтанцииСоблюдено = ВсеКодыВсехАналоговСтанции.Найти(Ответ.СтанцияНазначенияКод) <> неопределено;
		СтрокиГрузыЖД = ГрузыЖД.НайтиСтроки(Новый Структура("Ссылка", Ответ.Ссылка));
		//Для каждого Стр из Ответ.Ссылка.ГрузыЖД Цикл
		Для каждого Стр из СтрокиГрузыЖД Цикл
			УсловиеГрузаСоблюдено = УсловиеГрузаСоблюдено ИЛИ КодыЕТСНГПорожниевагоны.Найти(Стр.ЕТСНГКод) <> неопределено; 
			//ДИТ Авдеева В.С. 47101 05.09.2022 Начало
			Если ИсключатьРемонт
				И (Стр.ЕТСНГКод = "421195" 
				И Ответ.ЭтоНакладнаяВРемонт 
				Или Ответ.ЭтоНакладнаяПередРемонтом) Тогда
				УсловиеРемонтаСоблюдено = Ложь;	
			КонецЕсли;
			//ДИТ Авдеева В.С. 47101 05.09.2022 Конец
		КонецЦикла;         

		//ДИТ Авдеева В.С. 47101 05.09.2022 Начало
		//Если УсловиеГрузаСоблюдено И УсловиеСтанцииСоблюдено Тогда 
		Если УсловиеГрузаСоблюдено 
			И УсловиеСтанцииСоблюдено 
			И УсловиеРемонтаСоблюдено
			Тогда 
		//ДИТ Авдеева В.С. 47101 05.09.2022 Конец
			НакладнаяПодсылаВагона = Ответ.НакладнаяНомер;
			НакладнаяПодсылаСсылка = Ответ.Ссылка;
			//Евросиб Каблов 29.04.2021 ( Ticket#0223256
			Прервать;
			//Евросиб Каблов 29.04.2021 )
		КонецЕсли;
		
	//Евросиб Каблов 29.04.2021 ( Ticket#0223256
	//КонецЕсли;
	КонецЦикла;
	//Евросиб Каблов 29.04.2021 )
	
	Если ЗначениеЗаполнено(НакладнаяПодсылаСсылка) И СтанцияОтправленияСтрогоСоответствуетСтанцииПрибытия = Истина И НакладнаяПодсылаСсылка.СтанцияОтправленияКод <> НакладнаяПодсылаСсылка.СтанцияНазначенияКод Тогда
		НакладнаяПодсылаВагона = "";
		НакладнаяПодсылаСсылка = Неопределено;
	КонецЕсли;
	СтруктураРезультат = Новый Структура("НакладнаяПодсылаВагона, НакладнаяПодсылаВагонаСсылка", НакладнаяПодсылаВагона, НакладнаяПодсылаСсылка);
	
	//Возврат НакладнаяПодсылаВагона;
	Возврат СтруктураРезультат;
	
КонецФункции

// Евросиб US 86202 TA 109222 Рыбьяков К.А. 11.04.2025
Функция НайтиПодсылПорожнегоВагонаПоЭТРАННовыйАлгоритм(Вагон, 
										ДатаОтправления, 
										СтанцияОтправления, 
										ГоризонтПоискаНакладныхПодсыла, 
										ИсключаяНакладную = "", 
										СтанцияОтправленияСтрогоСоответствуетСтанцииПрибытия = Ложь, 
										ИскатьПоДатеПрибытия = Ложь, 
										ИсключатьРемонт = Истина,
										ДатаРаскредитацииИзГрЖДН = '00010101') Экспорт
	
	НакладнаяПодсылаВагона = "";
	НакладнаяПодсылаСсылка = неопределено;
	
	КодыЕТСНГПорожниевагоны = э_ОбщиеСервер.МассивКодовЕТСНГ_ПорожниеВагоны();
	
	Если ТипЗнч(СтанцияОтправления) = Тип("Массив") Тогда
		ВсеКодыВсехАналоговСтанции = Локации_сервер.ПолучитьКодыАналоговСтанций(СтанцияОтправления);	
	Иначе
		ВсеКодыВсехАналоговСтанции = Локации_сервер.ПолучитьКодыАналоговСтанцииПоКоду(СтанцияОтправления);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОжиданиеПодбораНакладнойПослеГруженогоПлеча.УчетнаяЕдиница.Наименование КАК УчетнаяЕдиницаНаименование,
	|	ОжиданиеПодбораНакладнойПослеГруженогоПлеча.Период КАК Период,
	|	ОжиданиеПодбораНакладнойПослеГруженогоПлеча.ЖДН КАК ЖДН,
	|	ОжиданиеПодбораНакладнойПослеГруженогоПлеча.ЖДН.НакладнаяЭТРАН КАК ЖДННакладнаяЭтран,
	|	ОжиданиеПодбораНакладнойПослеГруженогоПлеча.ПериодОжидания КАК ПериодОжидания
	|ПОМЕСТИТЬ ВТ_ОжидающиеУЕ
	|ИЗ
	|	РегистрСведений.ОжиданиеПодбораНакладнойПослеГруженогоПлеча.СрезПоследних(, ) КАК ОжиданиеПодбораНакладнойПослеГруженогоПлеча
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	УчетнаяЕдиницаНаименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА э_НакладнаяВагоны.Ссылка.ДатаИВремяРаскредитованияГруза <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА э_НакладнаяВагоны.Ссылка.ДатаИВремяРаскредитованияГруза
	|		ИНАЧЕ э_НакладнаяВагоны.Ссылка.ДатаИВремяОтправленияГруза
	|	КОНЕЦ КАК УчетнаяДата,
	|	ВЫБОР
	|		КОГДА э_НакладнаяВагоны.Ссылка.ДатаИВремяПрибытияГруза <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА э_НакладнаяВагоны.Ссылка.ДатаИВремяПрибытияГруза
	|		ИНАЧЕ э_НакладнаяВагоны.Ссылка.ДатаИВремяОтправленияГруза
	|	КОНЕЦ КАК ДатаПрибытия,
	|	э_НакладнаяВагоны.Ссылка КАК Ссылка,
	|	э_НакладнаяВагоны.Ссылка.НакладнаяНомер КАК НакладнаяНомер,
	|	э_НакладнаяВагоны.Ссылка.СтанцияНазначенияКод КАК СтанцияНазначенияКод,
	|	ВЫБОР
	|		КОГДА э_НакладнаяСпециальныеОтметки.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоНакладнаяВРемонт,
	|	э_НакладнаяВагоны.Ссылка.СтанцияНазначения КАК СтанцияНазначения,
	|	э_НакладнаяВагоны.Ссылка.СтанцияОтправленияКод КАК СтанцияОтправленияКод,
	|	э_НакладнаяВагоны.Ссылка.СтанцияОтправления КАК СтанцияОтправления
	|ПОМЕСТИТЬ ВТ_НакладныеВагоны
	|ИЗ
	|	Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОжидающиеУЕ КАК ВТ_ОжидающиеУЕ
	|		ПО э_НакладнаяВагоны.Ссылка = ВТ_ОжидающиеУЕ.ЖДННакладнаяЭтран
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.СпециальныеОтметки КАК э_НакладнаяСпециальныеОтметки
	|		ПО э_НакладнаяВагоны.Ссылка = э_НакладнаяСпециальныеОтметки.Ссылка
	|			И (э_НакладнаяСпециальныеОтметки.ОтметкаИД = 1212)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
	|		ПО э_НакладнаяВагоны.Ссылка = э_НакладнаяКонтейнеры.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная КАК э_Накладная
	|		ПО э_НакладнаяВагоны.Ссылка = э_Накладная.Ссылка
	|			И (НЕ э_Накладная.ПометкаУдаления)
	|			И (э_Накладная.ТекущееСостояниеНакладнойДействующийСтатус)
	|			И (э_Накладная.ДатаИВремяОтправленияГруза <> ДАТАВРЕМЯ(1, 1, 1))
	|			И (э_Накладная.ДатаИВремяОтправленияГруза > &ДатаРаскредитацииИзГрЖДН)
	|			И (э_Накладная.ДатаИВремяОтправленияГруза < &ДатаОтправленияПлюсГоризонт)
	|			И (э_Накладная.НакладнаяНомер <> &ИсключаяНакладную)
	|			И (э_Накладная.ТипНакладной <> &ДосылочнаяНакладная)
	|ГДЕ
	|	э_НакладнаяВагоны.НомерВагона = &НомерВагона
	|	И ВЫБОР
	|			КОГДА ВТ_ОжидающиеУЕ.ЖДН ЕСТЬ NULL
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ НЕ ВТ_ОжидающиеУЕ.ЖДННакладнаяЭтран = э_НакладнаяВагоны.Ссылка
	|		КОНЕЦ
	|	И э_НакладнаяКонтейнеры.Ссылка ЕСТЬ NULL
	|	И ВТ_ОжидающиеУЕ.ЖДННакладнаяЭтран ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_НакладныеВагоны.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ НакладныеПередРемонтом
	|ИЗ
	|	ВТ_НакладныеВагоны КАК ВТ_НакладныеВагоны
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная КАК э_Накладная
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
	|			ПО э_Накладная.Ссылка = э_НакладнаяВагоны.Ссылка
	|				И (э_НакладнаяВагоны.НомерВагона = &НомерВагона)
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная.СпециальныеОтметки КАК э_НакладнаяСпециальныеОтметки
	|			ПО э_Накладная.Ссылка = э_НакладнаяСпециальныеОтметки.Ссылка
	|				И (э_НакладнаяСпециальныеОтметки.ОтметкаИД = 1212)
	|		ПО (НЕ э_Накладная.ПометкаУдаления)
	|			И ВТ_НакладныеВагоны.СтанцияНазначения = э_Накладная.СтанцияОтправления
	|			И (ВЫБОР
	|				КОГДА э_Накладная.ДатаИВремяРаскредитованияГруза <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА э_Накладная.ДатаИВремяРаскредитованияГруза
	|				ИНАЧЕ э_Накладная.ДатаИВремяПрибытияГруза
	|			КОНЕЦ МЕЖДУ ДОБАВИТЬКДАТЕ(ВТ_НакладныеВагоны.ДатаПрибытия, СЕКУНДА, -1) И &ДатаОтправления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НакладныеВагоны.УчетнаяДата КАК УчетнаяДата,
	|	ВТ_НакладныеВагоны.Ссылка КАК Ссылка,
	|	ВТ_НакладныеВагоны.НакладнаяНомер КАК НакладнаяНомер,
	|	ВТ_НакладныеВагоны.СтанцияНазначенияКод КАК СтанцияНазначенияКод,
	|	ВТ_НакладныеВагоны.ЭтоНакладнаяВРемонт КАК ЭтоНакладнаяВРемонт,
	|	ВЫБОР
	|		КОГДА НакладныеПередРемонтом.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоНакладнаяПередРемонтом,
	|	ВТ_НакладныеВагоны.СтанцияОтправленияКод КАК СтанцияОтправленияКод
	|ИЗ
	|	ВТ_НакладныеВагоны КАК ВТ_НакладныеВагоны
	|		ЛЕВОЕ СОЕДИНЕНИЕ НакладныеПередРемонтом КАК НакладныеПередРемонтом
	|		ПО ВТ_НакладныеВагоны.Ссылка = НакладныеПередРемонтом.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	УчетнаяДата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	э_НакладнаяГрузы.Ссылка КАК Ссылка,
	|	э_НакладнаяГрузы.ЕТСНГ.Код КАК ЕТСНГКод
	|ИЗ
	|	Документ.э_Накладная.ГрузыЖД КАК э_НакладнаяГрузы
	|ГДЕ
	|	э_НакладнаяГрузы.Ссылка В
	|			(ВЫБРАТЬ
	|				т.Ссылка
	|			ИЗ
	|				ВТ_НакладныеВагоны КАК т)";
	
	Запрос.УстановитьПараметр("ДатаРаскредитацииИзГрЖДН", ДатаРаскредитацииИзГрЖДН);
	Запрос.УстановитьПараметр("ДатаОтправленияПлюсГоризонт", ДатаОтправления + ГоризонтПоискаНакладныхПодсыла * 24 * 3600);
	Запрос.УстановитьПараметр("НомерВагона", Вагон);
	Запрос.УстановитьПараметр("ИсключаяНакладную", ИсключаяНакладную);
	Запрос.УстановитьПараметр("ДатаОтправления", КонецДня(ДатаОтправления));
	Запрос.УстановитьПараметр("ДосылочнаяНакладная", Справочники.э_ОбщиеПоказатели.ДосылочнаяНакладная);
	
	Пакеты = Запрос.ВыполнитьПакет();
	Ответ = Пакеты[Пакеты.Количество()-2].Выбрать();
	ГрузыЖД = Пакеты[Пакеты.Количество()-1].Выгрузить();
	
	Если ГрузыЖД.Количество() > 1000 Тогда
		ГрузыЖД.Индексы.Добавить("Ссылка");
	КонецЕсли;
	
	Пока Ответ.Следующий() Цикл
		
		УсловиеГрузаСоблюдено = Ложь;
		УсловиеСтанцииСоблюдено = Ложь;
		УсловиеРемонтаСоблюдено = Истина;
		ВтороеУсловиеСтанцииСоблюдено = Истина;
		
		Если ДатаРаскредитацииИзГрЖДН <> '00010101' Тогда
			ВтороеУсловиеСтанцииСоблюдено = ПроверитьСтанцииОтправленияИНазначения(Ответ.СтанцияНазначенияКод, Ответ.СтанцияОтправленияКод);
		КонецЕсли;
		
		Если ДатаРаскредитацииИзГрЖДН <> '00010101' Тогда
			УсловиеСтанцииСоблюдено = ВсеКодыВсехАналоговСтанции.Найти(Ответ.СтанцияОтправленияКод) <> неопределено;
		КонецЕсли;
		
		СтрокиГрузыЖД = ГрузыЖД.НайтиСтроки(Новый Структура("Ссылка", Ответ.Ссылка));
		Для каждого Стр из СтрокиГрузыЖД Цикл
			УсловиеГрузаСоблюдено = УсловиеГрузаСоблюдено ИЛИ КодыЕТСНГПорожниевагоны.Найти(Стр.ЕТСНГКод) <> неопределено; 
			Если ИсключатьРемонт
				И (Стр.ЕТСНГКод = "421195" 
				И Ответ.ЭтоНакладнаяВРемонт 
				Или Ответ.ЭтоНакладнаяПередРемонтом) Тогда
				УсловиеРемонтаСоблюдено = Ложь;
			КонецЕсли;
		КонецЦикла;

		Если УсловиеГрузаСоблюдено 
			И УсловиеСтанцииСоблюдено 
			И УсловиеРемонтаСоблюдено
			И ВтороеУсловиеСтанцииСоблюдено Тогда 
			НакладнаяПодсылаВагона = Ответ.НакладнаяНомер;
			НакладнаяПодсылаСсылка = Ответ.Ссылка;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(НакладнаяПодсылаСсылка) И СтанцияОтправленияСтрогоСоответствуетСтанцииПрибытия = Истина И НакладнаяПодсылаСсылка.СтанцияОтправленияКод <> НакладнаяПодсылаСсылка.СтанцияНазначенияКод Тогда
		НакладнаяПодсылаВагона = "";
		НакладнаяПодсылаСсылка = Неопределено;
	КонецЕсли;
	
	СтруктураРезультат = Новый Структура("НакладнаяПодсылаВагона, НакладнаяПодсылаВагонаСсылка", НакладнаяПодсылаВагона, НакладнаяПодсылаСсылка);
	
	Возврат СтруктураРезультат;
	
КонецФункции // Евросиб Рыбьяков К.А. 15.05.2025 ))

Функция НайтиПодсылПорожнегоКТКПоЭТРАН(Контейнер, ДатаОтправления, МаксДата, СтанцияОтправления)
	
	Результат = Новый Структура("ВагонПорожнегоКТК, ВагонПорожнегоКТКСсылка, СтанцияПогрузкиКТК, НакладнаяКТК, РаскредитацияКТК, НакладнаяКТКСсылка");
	
	НакладнаяПодсылаКТК = "";
	
	//ВсеКодыВсехАналоговСтанции = Локации_сервер.ПолучитьКодыАналоговСтанцииПоКоду(СтанцияОтправления.КодЖДСтанции);
	//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, начало
	Если ТипЗнч(СтанцияОтправления) = Тип("Массив") Тогда
		ВсеКодыВсехАналоговСтанции = Локации_сервер.ПолучитьКодыАналоговСтанций(СтанцияОтправления);	
	Иначе
		ВсеКодыВсехАналоговСтанции = Локации_сервер.ПолучитьКодыАналоговСтанцииПоКоду(СтанцияОтправления.КодЖДСтанции);
	КонецЕсли;
	//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, конец
	
	КодыЕТСНГПорожниеКТК = э_ОбщиеСервер.МассивКодовЕТСНГ_ПорожниеКТК();
	
	//Евросиб - АСуслов 20.11.2021 12:50:10 #39798
	//(
	//в запросе добавлено исключение по ожидающим накладным
	//)
	//Евросиб - АСуслов 20.11.2021 12:50:11 #39798
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОжиданиеПодбораНакладнойПослеГруженогоПлеча.УчетнаяЕдиница.Наименование КАК УчетнаяЕдиницаНаименование,
	|	ОжиданиеПодбораНакладнойПослеГруженогоПлеча.Период КАК Период,
	|	ОжиданиеПодбораНакладнойПослеГруженогоПлеча.ЖДН КАК ЖДН,
	|	ОжиданиеПодбораНакладнойПослеГруженогоПлеча.ПериодОжидания КАК ПериодОжидания
	|ПОМЕСТИТЬ ВТ_ОжидающиеУЕ
	|ИЗ
	|	РегистрСведений.ОжиданиеПодбораНакладнойПослеГруженогоПлеча.СрезПоследних(
	|			&ДатаОтправления,
	|			УчетнаяЕдиница ССЫЛКА Справочник.ТЕ
	|				И УчетнаяЕдиница.Наименование = &НомерКонтейнера) КАК ОжиданиеПодбораНакладнойПослеГруженогоПлеча
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	УчетнаяЕдиницаНаименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяРаскредитованияГруза КАК РаскредитацияКТК,
	|	ВЫБОР
	|		КОГДА э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяРаскредитованияГруза <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяРаскредитованияГруза
	|		ИНАЧЕ э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяОтправленияГруза
	|	КОНЕЦ КАК УчетнаяДата,
	|	э_НакладнаяКонтейнеры.Ссылка КАК Ссылка,
	|	э_НакладнаяКонтейнеры.Ссылка.СтанцияОтправленияКод КАК СтанцияОтправленияКод,
	|	э_НакладнаяВагоны.НомерВагона КАК НомерВагона,
	|	э_НакладнаяКонтейнеры.Ссылка.НакладнаяНомер КАК НакладнаяНомер,
	|	э_Накладная.Ссылка КАК Ссылка1,
	|	ТС.Ссылка КАК ВагонСсылка
	|ИЗ
	|	Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОжидающиеУЕ КАК ВТ_ОжидающиеУЕ
	|		ПО э_НакладнаяКонтейнеры.НомерКонтейнера = ВТ_ОжидающиеУЕ.УчетнаяЕдиницаНаименование
	|			И э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяОтправленияГруза >= ВТ_ОжидающиеУЕ.Период
	|			И (э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяОтправленияГруза < ДОБАВИТЬКДАТЕ(ВТ_ОжидающиеУЕ.Период, ДЕНЬ, ВТ_ОжидающиеУЕ.ПериодОжидания))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТС КАК ТС
	|			ПО э_НакладнаяВагоны.НомерВагона = ТС.Наименование
	|				И (НЕ ТС.ПометкаУдаления)
	|		ПО э_НакладнаяКонтейнеры.Ссылка = э_НакладнаяВагоны.Ссылка
	|			И (э_НакладнаяКонтейнеры.НомерВагонаДляКонтейнерногоПоезда = э_НакладнаяВагоны.ПорядковыйНомерВагонаВОтправке
	|				ИЛИ э_НакладнаяКонтейнеры.НомерВагонаДляКонтейнерногоПоезда = 0)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная КАК э_Накладная
	|		ПО э_НакладнаяКонтейнеры.Ссылка = э_Накладная.Ссылка
	|			И (э_Накладная.ТекущееСостояниеНакладнойДействующийСтатус)
	|			И (НЕ э_Накладная.ПометкаУдаления)
	|			И (э_Накладная.ТипНакладной <> &ДосылочнаяНакладная)
	|			И (ВЫБОР
	|				КОГДА э_Накладная.ДатаИВремяРаскредитованияГруза <> ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА э_Накладная.ДатаИВремяРаскредитованияГруза
	|				ИНАЧЕ э_Накладная.ДатаИВремяОтправленияГруза
	|			КОНЕЦ МЕЖДУ &ДатаОтправленияМинусГоризонт И &ДатаОтправления)
	|ГДЕ
	|	э_НакладнаяКонтейнеры.НомерКонтейнера = &НомерКонтейнера
	|	И ВЫБОР
	|			КОГДА ВТ_ОжидающиеУЕ.ЖДН ЕСТЬ NULL
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ НЕ ВТ_ОжидающиеУЕ.ЖДН = э_НакладнаяКонтейнеры.Ссылка
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	УчетнаяДата УБЫВ";
	Запрос.УстановитьПараметр("НомерКонтейнера", Контейнер.Наименование);
	Запрос.УстановитьПараметр("ДатаОтправленияМинусГоризонт", ДатаОтправления);
	Запрос.УстановитьПараметр("ДатаОтправления", МаксДата);
	//ДИТ Шевченко А.В 01.08.2022 53548 -Начало
	Запрос.УстановитьПараметр("ДосылочнаяНакладная", Справочники.э_ОбщиеПоказатели.ДосылочнаяНакладная);
	//ДИТ Шевченко А.В 01.08.2022 53548 -Конец
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		
		УсловиеГрузаСоблюдено = Ложь;
		УсловиеСтанцииСоблюдено = Ложь;
		
		УсловиеСтанцииСоблюдено = ВсеКодыВсехАналоговСтанции.Найти(Ответ.Ссылка.СтанцияНазначенияКод) <> неопределено;
		Для каждого Стр из Ответ.Ссылка.ГрузыЖД Цикл
			УсловиеГрузаСоблюдено = УсловиеГрузаСоблюдено ИЛИ КодыЕТСНГПорожниеКТК.Найти(Стр.КодЕТСНГ) <> неопределено;
		КонецЦикла;
		
		Если УсловиеГрузаСоблюдено И УсловиеСтанцииСоблюдено Тогда 
			Результат.НакладнаяКТК = Ответ.НакладнаяНомер; 
			Результат.ВагонПорожнегоКТК = Ответ.НомерВагона;
			Результат.ВагонПорожнегоКТКСсылка = Ответ.ВагонСсылка;
			Результат.СтанцияПогрузкиКТК = Ответ.СтанцияОтправленияКод;
			Результат.РаскредитацияКТК = Ответ.РаскредитацияКТК;
			Результат.НакладнаяКТКСсылка = Ответ.Ссылка;
			//Прервать;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТДПоНомеруЖДН(ЖДНПодсылВагонов)
	
	Результат = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТранспортныйДокумент.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	               |ГДЕ
	               |	ТранспортныйДокумент.ПометкаУдаления = ЛОЖЬ
	               |	И ТранспортныйДокумент.НомерТранспортногоДокумента = &НомерТранспортногоДокумента
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТранспортныйДокумент.Создано УБЫВ";
	Запрос.УстановитьПараметр("НомерТранспортногоДокумента", ЖДНПодсылВагонов);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТДПоНакладнойЭтран(НакладнаяЭтран) Экспорт
	
	Результат = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТранспортныйДокумент.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	               |ГДЕ
	               |	ТранспортныйДокумент.ПометкаУдаления = ЛОЖЬ
	               |	И ТранспортныйДокумент.НакладнаяЭТРАН = &НакладнаяЭтран
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТранспортныйДокумент.Создано УБЫВ";
	Запрос.УстановитьПараметр("НакладнаяЭтран", НакладнаяЭтран);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//Функция НайтиНомерГруженойПорожнимиВагонамиНакладнойПоЭТРАНПоКТК(КТК, НачалоПериода, КонецПериода, СтанцияПогрузки, СтанцияВыгрузки)
//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, начало
Функция НайтиНомерГруженойПорожнимиВагонамиНакладнойПоЭТРАНПоКТК(КТК, НачалоПериода, КонецПериода, МассивСтанцийОтправления, МассивСтанцийНазначений)
//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, конец
	
	Результат = Новый Структура("НомерЖДН, СсылкаЖДН, Вагон");
	ПорожниеВагоныЕТСНГ = э_ОбщиеСервер.МассивКодовЕТСНГ_ПорожниеВагоны();
	ПорожниеКТКЕТСНГ = э_ОбщиеСервер.МассивКодовЕТСНГ_ПорожниеКТК();
	
	//ВсеКодыВсехАналоговСтанцииОтправления = Локации_сервер.ПолучитьКодыАналоговСтанцииПоКоду(СтанцияПогрузки.КодЖДСтанции);
	//ВсеКодыВсехАналоговСтанцииПрибытия = Локации_сервер.ПолучитьКодыАналоговСтанцииПоКоду(СтанцияВыгрузки.КодЖДСтанции);
	//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, начало
	ВсеКодыВсехАналоговСтанцииОтправления = Локации_сервер.ПолучитьКодыАналоговСтанций(МассивСтанцийОтправления);
	ВсеКодыВсехАналоговСтанцииПрибытия = Локации_сервер.ПолучитьКодыАналоговСтанций(МассивСтанцийНазначений);
	//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, конец
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	э_НакладнаяКонтейнеры.Ссылка КАК ЖДН_Ссылка,
	               |	ВЫБОР
	               |		КОГДА э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяРаскредитованияГруза <> ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяРаскредитованияГруза
	               |		ИНАЧЕ э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяОтправленияГруза
	               |	КОНЕЦ КАК Период,
	               |	э_НакладнаяКонтейнеры.НомерКонтейнера КАК НомерКонтейнера,
	               |	э_НакладнаяКонтейнеры.Ссылка.Вагон КАК Вагон,
	               |	э_НакладнаяКонтейнеры.Ссылка.НакладнаяНомер КАК НакладнаяНомер,
	               |	ТранспортныйДокумент.Ссылка КАК ТД_Ссылка,
	               |	э_НакладнаяКонтейнеры.НомерВагонаДляКонтейнерногоПоезда КАК НомерВагонаДляКонтейнерногоПоезда,
	               |	э_НакладнаяВагоны.НомерВагона КАК НомерВагона,
	               |	ТС.Ссылка КАК ТС_Ссылка
	               |ИЗ
	               |	Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная.ГрузыЖД КАК э_НакладнаяГрузыЖД
	               |		ПО э_НакладнаяКонтейнеры.Ссылка = э_НакладнаяГрузыЖД.Ссылка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	               |		ПО э_НакладнаяКонтейнеры.Ссылка = ТранспортныйДокумент.НакладнаяЭТРАН
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТС КАК ТС
	               |			ПО э_НакладнаяВагоны.НомерВагона = ТС.Наименование
	               |				И (НЕ ТС.ПометкаУдаления)
	               |		ПО э_НакладнаяКонтейнеры.Ссылка = э_НакладнаяВагоны.Ссылка
	               |			И (э_НакладнаяКонтейнеры.НомерВагонаДляКонтейнерногоПоезда = э_НакладнаяВагоны.ПорядковыйНомерВагонаВОтправке
	               |				ИЛИ э_НакладнаяКонтейнеры.НомерВагонаДляКонтейнерногоПоезда = 0)
	               |ГДЕ
	               |	э_НакладнаяКонтейнеры.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	               |	И НЕ э_НакладнаяКонтейнеры.Ссылка.ПометкаУдаления
	               |	И э_НакладнаяКонтейнеры.НомерКонтейнера = &Контейнер
	               |	И э_НакладнаяКонтейнеры.Ссылка.ТекущееСостояниеНакладнойДействующийСтатус
	               |	И э_НакладнаяКонтейнеры.Ссылка.СтанцияНазначенияКод В(&СтанцияНазначенияКод)
	               |	И э_НакладнаяКонтейнеры.Ссылка.СтанцияОтправленияКод В(&СтанцияОтправленияКод)
				   |	И э_НакладнаяКонтейнеры.Ссылка.ТипНакладной <> &ДосылочнаяНакладная
	               |	И (э_НакладнаяГрузыЖД.КодЕТСНГ В (&ПорожниеВагоныЕТСНГ)
	               |			ИЛИ э_НакладнаяГрузыЖД.КодЕТСНГ В (&ПорожниеКТКЕТСНГ))
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерВагона УБЫВ";
	Запрос.УстановитьПараметр("Контейнер", КТК.Наименование);
	Запрос.УстановитьПараметр("СтанцияОтправленияКод", ВсеКодыВсехАналоговСтанцииОтправления);
	Запрос.УстановитьПараметр("СтанцияНазначенияКод", ВсеКодыВсехАналоговСтанцииПрибытия);
	Запрос.УстановитьПараметр("Дата1", НачалоПериода);
	Запрос.УстановитьПараметр("Дата2", КонецПериода);
	Запрос.УстановитьПараметр("ПорожниеВагоныЕТСНГ", ПорожниеВагоныЕТСНГ);
	Запрос.УстановитьПараметр("ПорожниеКТКЕТСНГ", ПорожниеКТКЕТСНГ);
	//ДИТ Шевченко А.В 01.08.2022 53548 -Начало
	Запрос.УстановитьПараметр("ДосылочнаяНакладная", Справочники.э_ОбщиеПоказатели.ДосылочнаяНакладная);
	//ДИТ Шевченко А.В 01.08.2022 53548 -Конец
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		
		Результат.НомерЖДН = Ответ.НакладнаяНомер;
		Результат.СсылкаЖДН = Ответ.ТД_Ссылка;
		Результат.Вагон = Ответ.ТС_Ссылка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//Функция НайтиНомерГруженойНакладнойПоЭТРАНПоКТК(КТК, НачалоПериода, КонецПериода, СтанцияПогрузки, СтанцияВыгрузки, ДатаМакс)
//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, начало
Функция НайтиНомерГруженойНакладнойПоЭТРАНПоКТК(КТК, НачалоПериода, КонецПериода, МассивСтанцийОтправления, МассивСтанцийНазначений, ДатаМакс)
//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, конец

	
	//Евросиб Каблов 18.06.2021 ( Ticket#0209893
	//Результат = Новый Структура("НомерЖДН, СсылкаЖДН, Вагон");
	Результат = Новый Структура("НомерЖДН, СсылкаЖДН, Вагон, Охрана");
	//Евросиб Каблов 18.06.2021 ) 
	
	ПорожниеВагоныЕТСНГ = э_ОбщиеСервер.МассивКодовЕТСНГ_ПорожниеВагоны();
	ПорожниеКТКЕТСНГ = э_ОбщиеСервер.МассивКодовЕТСНГ_ПорожниеКТК();
	
	//ВсеКодыВсехАналоговСтанцииОтправления = Локации_сервер.ПолучитьКодыАналоговСтанцииПоКоду(СтанцияПогрузки.КодЖДСтанции);
	//ВсеКодыВсехАналоговСтанцииПрибытия = Локации_сервер.ПолучитьКодыАналоговСтанцииПоКоду(СтанцияВыгрузки.КодЖДСтанции);
	//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, начало
	ВсеКодыВсехАналоговСтанцииОтправления = Локации_сервер.ПолучитьКодыАналоговСтанций(МассивСтанцийОтправления);
	ВсеКодыВсехАналоговСтанцииПрибытия = Локации_сервер.ПолучитьКодыАналоговСтанций(МассивСтанцийНазначений);
	//ДИТ, Беляев СЮ, US 68284/ TA 68289, 11-05-2023, конец
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	э_НакладнаяКонтейнеры.Ссылка КАК ЖДН_Ссылка,
	               |	ВЫБОР
	               |		КОГДА э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяРаскредитованияГруза <> ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяРаскредитованияГруза
	               |		ИНАЧЕ э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяОтправленияГруза
	               |	КОНЕЦ КАК Период,
	               |	э_НакладнаяКонтейнеры.НомерКонтейнера КАК НомерКонтейнера,
	               |	э_НакладнаяКонтейнеры.Ссылка.Вагон КАК Вагон,
	               |	э_НакладнаяКонтейнеры.Ссылка.НакладнаяНомер КАК НакладнаяНомер,
	               |	ТранспортныйДокумент.Ссылка КАК ТД_Ссылка,
	               |	э_НакладнаяКонтейнеры.НомерВагонаДляКонтейнерногоПоезда КАК НомерВагонаДляКонтейнерногоПоезда,
	               |	э_НакладнаяВагоны.НомерВагона КАК НомерВагона,
	               |	ТС.Ссылка КАК ТС_Ссылка,
	               |	э_НакладнаяКонтейнеры.Ссылка.Охрана КАК Охрана
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная.ГрузыЖД КАК э_НакладнаяГрузыЖД
	               |		ПО э_НакладнаяКонтейнеры.Ссылка = э_НакладнаяГрузыЖД.Ссылка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	               |		ПО э_НакладнаяКонтейнеры.Ссылка = ТранспортныйДокумент.НакладнаяЭТРАН
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТС КАК ТС
	               |			ПО э_НакладнаяВагоны.НомерВагона = ТС.Наименование
	               |				И (НЕ ТС.ПометкаУдаления)
	               |		ПО э_НакладнаяКонтейнеры.Ссылка = э_НакладнаяВагоны.Ссылка
	               |			И (э_НакладнаяКонтейнеры.НомерВагонаДляКонтейнерногоПоезда = э_НакладнаяВагоны.ПорядковыйНомерВагонаВОтправке
	               |				ИЛИ э_НакладнаяКонтейнеры.НомерВагонаДляКонтейнерногоПоезда = 0)
	               |ГДЕ
	               |	э_НакладнаяКонтейнеры.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	               |	И НЕ э_НакладнаяКонтейнеры.Ссылка.ПометкаУдаления
	               |	И э_НакладнаяКонтейнеры.НомерКонтейнера = &Контейнер
	               |	И э_НакладнаяКонтейнеры.Ссылка.ТекущееСостояниеНакладнойДействующийСтатус
	               |	И э_НакладнаяКонтейнеры.Ссылка.СтанцияНазначенияКод В(&СтанцияНазначенияКод)
	               |	И э_НакладнаяКонтейнеры.Ссылка.СтанцияОтправленияКод В(&СтанцияОтправленияКод)
	               |	И НЕ э_НакладнаяГрузыЖД.КодЕТСНГ В (&ПорожниеВагоныЕТСНГ)
	               |	И НЕ э_НакладнаяГрузыЖД.КодЕТСНГ В (&ПорожниеКТКЕТСНГ)
				   |	И э_НакладнаяКонтейнеры.Ссылка.ТипНакладной <> &ДосылочнаяНакладная
	               |	И (э_НакладнаяКонтейнеры.Ссылка.ТекущееСостояниеНакладной.КатегорияДокументов В (""Прибытие"", ""В пути"")
	               |			ИЛИ э_НакладнаяКонтейнеры.Ссылка.ТекущееСостояниеНакладной.Наименование В (""Груз принят к перевозке"", ""Готов комплект документов"", ""Грузоотправитель накладную получил""))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.ЖДН_Ссылка КАК ЖДН_Ссылка,
	               |	ВТ.Период КАК Период,
	               |	ВТ.НомерКонтейнера КАК НомерКонтейнера,
	               |	ВТ.Вагон КАК Вагон,
	               |	ВТ.НакладнаяНомер КАК НакладнаяНомер,
	               |	ВТ.ТД_Ссылка КАК ТД_Ссылка,
	               |	ВТ.НомерВагонаДляКонтейнерногоПоезда КАК НомерВагонаДляКонтейнерногоПоезда,
	               |	ВТ.НомерВагона КАК НомерВагона,
	               |	ВТ.ТС_Ссылка КАК ТС_Ссылка,
	               |	ВТ.Охрана КАК Охрана,
	               |	ВЫБОР
	               |		КОГДА РАЗНОСТЬДАТ(&ДатаМакс, ВТ.Период, ДЕНЬ) > 0
	               |			ТОГДА РАЗНОСТЬДАТ(&ДатаМакс, ВТ.Период, ДЕНЬ)
	               |		ИНАЧЕ РАЗНОСТЬДАТ(ВТ.Период, &ДатаМакс, ДЕНЬ)
	               |	КОНЕЦ КАК РазностьДат
	               |ИЗ
	               |	ВТ КАК ВТ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РазностьДат";
				   //Евросиб Каблов 08.07.2021 )
	Запрос.УстановитьПараметр("Контейнер", КТК.Наименование);
	Запрос.УстановитьПараметр("СтанцияОтправленияКод", ВсеКодыВсехАналоговСтанцииОтправления);
	Запрос.УстановитьПараметр("СтанцияНазначенияКод", ВсеКодыВсехАналоговСтанцииПрибытия);
	Запрос.УстановитьПараметр("Дата1", НачалоПериода);
	Запрос.УстановитьПараметр("Дата2", КонецПериода);
	Запрос.УстановитьПараметр("ПорожниеВагоныЕТСНГ", ПорожниеВагоныЕТСНГ);
	Запрос.УстановитьПараметр("ПорожниеКТКЕТСНГ", ПорожниеКТКЕТСНГ);
	Запрос.УстановитьПараметр("ДатаМакс", ДатаМакс);
	//ДИТ Шевченко А.В 01.08.2022 53548 -Начало
	Запрос.УстановитьПараметр("ДосылочнаяНакладная", Справочники.э_ОбщиеПоказатели.ДосылочнаяНакладная);
	//ДИТ Шевченко А.В 01.08.2022 53548 -Конец
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		
		Результат.НомерЖДН = Ответ.НакладнаяНомер;
		Результат.СсылкаЖДН = Ответ.ТД_Ссылка;
		Результат.Вагон = Ответ.ТС_Ссылка;
		Если НЕ ЗначениеЗаполнено(Ответ.Вагон) И ЗначениеЗаполнено(Ответ.НомерВагона) Тогда
			Результат.Вагон = РаботаСКонтейнерамиСервер.ПолучитьВагонПоНомеру(Ответ.НомерВагона);
		КонецЕсли;
		//Евросиб Каблов 18.06.2021 ( Ticket#0209893
		Результат.Охрана = Ответ.Охрана;
		//Евросиб Каблов 18.06.2021 )
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьПотребностьПоискаНакладнойПослеГруженогоПлеча(ОбъектСделка) Экспорт
	
	//Евросиб - АСуслов 28.10.2021 23:42:51 #
	//(
	//изначальный алгоритм переделал в запрос
	//)
	//Евросиб - АСуслов 28.10.2021 23:42:51 #
	// блок работы с накладными на возврат после груженого плеча
	//Движения.ПотребностьПоискаНакладнойПослеГруженогоПлеча.Записывать = Истина;
	//ТребуетсяЛиПоискНакладной = Новый Соответствие;
	//Для каждого Стр из СвязьУчетныхЕдиниц Цикл
	//	
	//	Если НЕ ЗначениеЗаполнено(Стр.Калькуляция) ИЛИ НЕ ЗначениеЗаполнено(Стр.Вагон) ИЛИ ЗначениеЗаполнено(Стр.НакладнаяПослеГруженогоПлеча) Тогда Продолжить; КонецЕсли;
	//	
	//	ТребуетсяПоискНакладной = ТребуетсяЛиПоискНакладной.Получить(Стр.Калькуляция);
	//	Если ТребуетсяПоискНакладной = неопределено Тогда
	//		ТребуетсяПоискНакладной = Ложь;
	//		Для каждого СтрКальк из Стр.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки Цикл
	//			Если (СтрКальк.Услуга.УслугаРасходовВыбираетсяПриУсловии = 1 ИЛИ СтрКальк.Услуга.УслугаРасходовВыбираетсяПриУсловии = 2) И ЗначениеЗаполнено(СтрКальк.ГруппаУслуг) Тогда
	//				ТребуетсяПоискНакладной = Истина;
	//				Прервать;
	//			КонецЕсли;
	//		КонецЦикла;
	//		ТребуетсяЛиПоискНакладной.Вставить(Стр.Калькуляция, ТребуетсяПоискНакладной);
	//	КонецЕсли;
	//	Если ТребуетсяПоискНакладной = Истина Тогда
	//		Движение = Движения.ПотребностьПоискаНакладнойПослеГруженогоПлеча.ДобавитьПриход();
	//		Движение.Период = Дата;
	//		Движение.Сделка = Ссылка;
	//		Движение.Вагон = Стр.Вагон;
	//		Движение.Поиск = 1;
	//	КонецЕсли;
	//	
	//КонецЦикла;
	ОбъектСделка.Движения.ПотребностьПоискаНакладнойПослеГруженогоПлеча.Записывать = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция,
	|	СделкаСвязьУчетныхЕдиниц.Вагон КАК Вагон,
	|	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Сделка,
	|	СделкаСвязьУчетныхЕдиниц.Ссылка.Дата КАК Период
	|ПОМЕСТИТЬ СвязьУчетныхЕдиниц
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|ГДЕ
	|	НЕ СделкаСвязьУчетныхЕдиниц.Калькуляция = ЗНАЧЕНИЕ(Документ.Калькуляция.ПустаяСсылка)
	|	И НЕ СделкаСвязьУчетныхЕдиниц.Вагон = ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)
	|	И СделкаСвязьУчетныхЕдиниц.НакладнаяПослеГруженогоПлеча = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|	И СделкаСвязьУчетныхЕдиниц.Ссылка = &Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция,
	|	СвязьУчетныхЕдиниц.Вагон КАК Вагон,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА (КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга.УслугаРасходовВыбираетсяПриУсловии = 1
	|					ИЛИ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга.УслугаРасходовВыбираетсяПриУсловии = 2)
	|					И КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ГруппаУслуг > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Поиск,
	|	СвязьУчетныхЕдиниц.Сделка КАК Сделка,
	|	СвязьУчетныхЕдиниц.Период КАК Период
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	|		ПО СвязьУчетныхЕдиниц.Калькуляция = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СвязьУчетныхЕдиниц.Калькуляция,
	|	СвязьУчетныхЕдиниц.Вагон,
	|	СвязьУчетныхЕдиниц.Сделка,
	|	СвязьУчетныхЕдиниц.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ.Калькуляция КАК Калькуляция,
	|	ВТ.Вагон КАК Вагон,
	|	ВТ.Поиск КАК Поиск,
	|	ВТ.Сделка КАК Сделка,
	|	ВТ.Период КАК Период
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВТ.Поиск > 0";
	Запрос.УстановитьПараметр("Сделка", ОбъектСделка.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();                 
	Если РезультатЗапроса.Пустой() Тогда
		ОбъектСделка.Движения.ПотребностьПоискаНакладнойПослеГруженогоПлеча.Очистить();
	Иначе
		ОбъектСделка.Движения.ПотребностьПоискаНакладнойПослеГруженогоПлеча.Загрузить(Запрос.Выполнить().Выгрузить());		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПодборЖДННакладныхВСделки(КоличествоСделок = 0, АдресРезультата) Экспорт

	Запрос = Новый Запрос;  
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Сделка
	//|ПОМЕСТИТЬ ВТ_ОсновнойПоиск
	//|ИЗ
	//|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	//|ГДЕ
	//|	СделкаСвязьУчетныхЕдиниц.Ссылка.Проведен = ИСТИНА
	//|	И СделкаСвязьУчетныхЕдиниц.НеАктивна = ЛОЖЬ
	//|	И СделкаСвязьУчетныхЕдиниц.Удалена = ЛОЖЬ
	//|	И (СделкаСвязьУчетныхЕдиниц.ЖДН = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	//|			ИЛИ СделкаСвязьУчетныхЕдиниц.ЖДН.НакладнаяЭТРАН.ТекущееСостояниеНакладной.ДействующийСтатус = ЛОЖЬ)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ОжиданиеПодбораНакладнойПослеГруженогоПлечаСрезПоследних.Регистратор КАК Сделка
	//|ПОМЕСТИТЬ ВТ_Ожидающие
	//|ИЗ
	//|	РегистрСведений.ОжиданиеПодбораНакладнойПослеГруженогоПлеча.СрезПоследних КАК ОжиданиеПодбораНакладнойПослеГруженогоПлечаСрезПоследних
	//|ГДЕ
	//|	ОжиданиеПодбораНакладнойПослеГруженогоПлечаСрезПоследних.ЖДН = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	//|	И &ТекущаяДата <= ДОБАВИТЬКДАТЕ(ОжиданиеПодбораНакладнойПослеГруженогоПлечаСрезПоследних.Период, ДЕНЬ, ОжиданиеПодбораНакладнойПослеГруженогоПлечаСрезПоследних.ПериодОжидания)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_ОсновнойПоиск.Сделка КАК Сделка
	//|ПОМЕСТИТЬ ВТ_СделкиДляПодбора
	//|ИЗ
	//|	ВТ_ОсновнойПоиск КАК ВТ_ОсновнойПоиск
	//|
	//|ОБЪЕДИНИТЬ
	//|
	//|ВЫБРАТЬ
	//|	ВТ_Ожидающие.Сделка
	//|ИЗ
	//|	ВТ_Ожидающие КАК ВТ_Ожидающие
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ ПЕРВЫЕ 1
	//|	ВТ_СделкиДляПодбора.Сделка КАК Сделка,
	//|	ЕСТЬNULL(ПротоколПодбораЖДНВСделкиСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПодбора
	//|ИЗ
	//|	ВТ_СделкиДляПодбора КАК ВТ_СделкиДляПодбора
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколАвтоподбораЖДНВСделки.СрезПоследних КАК ПротоколПодбораЖДНВСделкиСрезПоследних
	//|		ПО ВТ_СделкиДляПодбора.Сделка = ПротоколПодбораЖДНВСделкиСрезПоследних.Сделка
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ДатаПодбора,
	//|	ВТ_СделкиДляПодбора.Сделка.Дата УБЫВ";    
	
	//ДИТ, Беляев СЮ, Ticket#0269524, 27-04-2022, начало
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Сделка
	|ПОМЕСТИТЬ ВТ_ОсновнойПоиск
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|ГДЕ
	|	СделкаСвязьУчетныхЕдиниц.Ссылка.Проведен = ИСТИНА
	// Евросиб US 83395 TA 116021 Рыбьяков К.А. 13.08.2025 ((
	|	И СделкаСвязьУчетныхЕдиниц.Ссылка.Создано МЕЖДУ ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -365) И &ТекущаяДата
	|	И СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения = Значение(Перечисление.ВидыТранспортныхСообщений.ЖД)
	|	И СделкаСвязьУчетныхЕдиниц.Клиент <> Значение(Справочник.Контрагенты.ПустаяСсылка) 
	|	И СделкаСвязьУчетныхЕдиниц.Калькуляция.ОсновнаяУслуга <> Значение(Справочник.Номенклатура.АвтоперевозкаГруженыйКонтейнер)
	// Евросиб Рыбьяков К.А. 13.08.2025 ))
	|	И СделкаСвязьУчетныхЕдиниц.НеАктивна = ЛОЖЬ
	|	И СделкаСвязьУчетныхЕдиниц.Удалена = ЛОЖЬ
	|	И (СделкаСвязьУчетныхЕдиниц.ЖДН = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|			ИЛИ СделкаСвязьУчетныхЕдиниц.ЖДН.НакладнаяЭТРАН.ТекущееСостояниеНакладной.ДействующийСтатус = ЛОЖЬ
	//ДИТ, Беляев СЮ, US 69796/ TA 76295, 15-12-2023, начало
	|			ИЛИ СделкаСвязьУчетныхЕдиниц.ЖДН.ПометкаУдаления)
	//ДИТ, Беляев СЮ, US 69796/ TA 76295, 15-12-2023, конец
	|
	// Евросиб US 83395 TA 116021 Рыбьяков К.А. 13.08.2025 ((
	|ОБЪЕДИНИТЬ
	|			
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Сделка
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|ГДЕ
	|	СделкаСвязьУчетныхЕдиниц.Ссылка.Проведен = ИСТИНА 
	|	И СделкаСвязьУчетныхЕдиниц.Ссылка.Создано МЕЖДУ ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -365) И &ТекущаяДата
	|	И СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения = Значение(Перечисление.ВидыТранспортныхСообщений.ЖД)
	|	И СделкаСвязьУчетныхЕдиниц.Клиент <> Значение(Справочник.Контрагенты.ПустаяСсылка) 
	|	И СделкаСвязьУчетныхЕдиниц.Калькуляция.ОсновнаяУслуга <> Значение(Справочник.Номенклатура.АвтоперевозкаГруженыйКонтейнер)
	|	И СделкаСвязьУчетныхЕдиниц.НеАктивна = ЛОЖЬ
	|	И СделкаСвязьУчетныхЕдиниц.Удалена = ЛОЖЬ
	|	И СделкаСвязьУчетныхЕдиниц.ЖДН.НакладнаяЭТРАН.ДатаИВремяРаскредитованияГруза МЕЖДУ ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -10) И &ТекущаяДата
	|	И СделкаСвязьУчетныхЕдиниц.ЖДН.НакладнаяЭТРАН <> ЗНАЧЕНИЕ(Документ.э_Накладная.ПустаяСсылка)
	|	И СделкаСвязьУчетныхЕдиниц.ПорожняяЖДНКТК = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|	И (СделкаСвязьУчетныхЕдиниц.ЖДН <> ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|			ИЛИ СделкаСвязьУчетныхЕдиниц.ЖДН.НакладнаяЭТРАН.ТекущееСостояниеНакладной.ДействующийСтатус = ЛОЖЬ
	|			ИЛИ СделкаСвязьУчетныхЕдиниц.ЖДН.ПометкаУдаления)
	|;
	// Евросиб Рыбьяков К.А. 13.08.2025 ))
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОжиданиеПодбораНакладнойПослеГруженогоПлечаСрезПоследних.Регистратор КАК Сделка
	|ПОМЕСТИТЬ ВТ_Ожидающие
	|ИЗ
	|	РегистрСведений.ОжиданиеПодбораНакладнойПослеГруженогоПлеча.СрезПоследних КАК ОжиданиеПодбораНакладнойПослеГруженогоПлечаСрезПоследних
	|ГДЕ
	|	ОжиданиеПодбораНакладнойПослеГруженогоПлечаСрезПоследних.ЖДН = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|	И &ТекущаяДата <= ДОБАВИТЬКДАТЕ(ОжиданиеПодбораНакладнойПослеГруженогоПлечаСрезПоследних.Период, ДЕНЬ, ОжиданиеПодбораНакладнойПослеГруженогоПлечаСрезПоследних.ПериодОжидания)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОсновнойПоиск.Сделка КАК Сделка
	|ПОМЕСТИТЬ ВТ_СделкиДляПодбора
	|ИЗ
	|	ВТ_ОсновнойПоиск КАК ВТ_ОсновнойПоиск
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_Ожидающие.Сделка
	|ИЗ
	|	ВТ_Ожидающие КАК ВТ_Ожидающие
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ОсновнойПоиск.Сделка КАК Сделка
	|ПОМЕСТИТЬ ВТ_СделкиДляПодбора_сУчетомРейсов
	|ИЗ
	|	ВТ_ОсновнойПоиск КАК ВТ_ОсновнойПоиск
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Рейсы КАК СделкаРейсы
	|		ПО ВТ_ОсновнойПоиск.Сделка = СделкаРейсы.Ссылка
	|			И (ТИПЗНАЧЕНИЯ(СделкаРейсы.Рейс) = ТИП(Справочник.РейсыЖД))
	|			И ((ВЫРАЗИТЬ(СделкаРейсы.Рейс КАК Справочник.РейсыЖД)) <> ЗНАЧЕНИЕ(Справочник.РейсыЖД.БезРейса))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ_СделкиДляПодбора_сУчетомРейсов.Сделка КАК Сделка,
	|	ЕСТЬNULL(ПротоколПодбораЖДНВСделкиСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПодбора
	|ИЗ
	|	ВТ_СделкиДляПодбора_сУчетомРейсов КАК ВТ_СделкиДляПодбора_сУчетомРейсов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколАвтоподбораЖДНВСделки.СрезПоследних КАК ПротоколПодбораЖДНВСделкиСрезПоследних
	|		ПО ВТ_СделкиДляПодбора_сУчетомРейсов.Сделка = ПротоколПодбораЖДНВСделкиСрезПоследних.Сделка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПодбора,      
	|	ВТ_СделкиДляПодбора_сУчетомРейсов.Сделка.Дата УБЫВ"; 
	//ДИТ, Беляев СЮ, Ticket#0269524, 27-04-2022, конец
	
	Если КоличествоСделок = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1", "");
	Иначе	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1", СтрШаблон("ПЕРВЫЕ %1", КоличествоСделок));
	КонецЕсли;
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;       
	Выборка = РезультатЗапроса.Выбрать();
	МассивОтработанныхСделок = Новый Массив;
	ВсегоСделок = Выборка.Количество();     
	Итератор = 0;
	// Евросиб Фролов (03.03.2022
	МассивОшибок = Новый Массив;
	// Евросиб Фролов)
	Пока Выборка.Следующий() Цикл           
		Итератор = Итератор + 1;
		обСделка = Выборка.Сделка.ПолучитьОбъект();                
		ГоризонтПоискаНакладных = ?(обСделка.ГоризонтПоискаНакладных = 0, 40, обСделка.ГоризонтПоискаНакладных);
		
		//РаботаСоСделкамиСервер.ПодобратьНакладныеВСделку(обСделка, ГоризонтПоискаНакладных, МассивОшибок);		
		//ДИТ, Беляев СЮ, Ticket#0269524, 27-04-2022, начало //результат функции ПодобратьНакладныеВСделку() не используем, есть неточности    
		ТаблицаСУЕдоИзменений = обСделка.СвязьУчетныхЕдиниц.Выгрузить();
		РаботаСоСделкамиСервер.ПодобратьНакладныеВСделку(обСделка, ГоризонтПоискаНакладных, МассивОшибок); 
		ТаблицаСУЕпослеИзменений = обСделка.СвязьУчетныхЕдиниц.Выгрузить();
		ФлагНаличияИзменений = НЕ ОбщегоНазначения.КоллекцииИдентичны(ТаблицаСУЕдоИзменений, ТаблицаСУЕпослеИзменений,,, Истина); 
		//ДИТ, Беляев СЮ, Ticket#0269524, 27-04-2022, конец
		
		// Евросиб Фролов (03.03.2022
		// Добавил проведение в попытку, т.к. мог возникать конфликт блокировок.
		// Ошибки собираем в массив, чтобы после выполнения задания отправить их на почту.
		Попытка 
			//обСделка.Записать(РежимЗаписиДокумента.Проведение);
			//ДИТ, Беляев СЮ, Ticket#0269524, 27-04-2022, начало
			Если ФлагНаличияИзменений Тогда
				обСделка.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			//ДИТ, Беляев СЮ, Ticket#0269524, 27-04-2022, конец
			МассивОтработанныхСделок.Добавить(Выборка.Сделка);
			РегистрыСведений.ПротоколАвтоподбораЖДНВСделки.ДобавитьЗапись(Выборка.Сделка);
		Исключение
			ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации("ПодборЖДННакладныхВСделки.Проведение сделки",
    												УровеньЖурналаРегистрации.Предупреждение,, Выборка.Сделка, ПредставлениеОшибки);
			МассивОшибок.Добавить("" + Выборка.Сделка + ": " + ПредставлениеОшибки);
		КонецПопытки;
		// Евросиб Фролов)			
		ДлительныеОперации.СообщитьПрогресс(Итератор/ВсегоСделок * 100, Выборка.Сделка); 
	КонецЦикла;                                           
	ПоместитьВоВременноеХранилище(МассивОтработанныхСделок, АдресРезультата);
	// Евросиб Фролов (03.03.2022
	Если МассивОшибок.Количество() > 0 Тогда
		Тема = "Рег. задание: Подбор ЖДН накладных в сделки";
		ТекстСообщения = "Во время выполнения рег. задания произошли следующие ошибки:
						|" + СтрСоединить(МассивОшибок, Символы.ПС);
		ВыполнитьОтправкуУведомлений(Тема, ТекстСообщения, Метаданные.РегламентныеЗадания.ПодборЖДННакладныхВСделки);
	КонецЕсли;
	// Евросиб Фролов)
КонецПроцедуры

//Процедура ОчиститьОчередьОтложенногоИзменения(МассивОтработанныхСделок) //ДИТ Шевченко А.В. 55599 23.01.2023
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.ОбрабатываемыйОбъект КАК ОбрабатываемыйОбъект,
//		|	ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.ИсточникИзменения КАК ИсточникИзменения
//		|ИЗ
//		|	РегистрСведений.ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов КАК ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов
//		|ГДЕ
//		|	НЕ ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.Обработано
//		|	И ТИПЗНАЧЕНИЯ(ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.ИсточникИзменения) = ТИП(Документ.ТранспортныйДокумент)
//		|	И ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.ОбрабатываемыйОбъект В(&ОбрабатываемыйОбъект)";
//	
//	Запрос.УстановитьПараметр("ОбрабатываемыйОбъект",МассивОтработанныхСделок);
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		мз = РегистрыСведений.ОчередьОтложенногоИзмененияВзаимосвязанныхОбъектов.СоздатьМенеджерЗаписи();
//		мз.ОбрабатываемыйОбъект = ВыборкаДетальныеЗаписи.ОбрабатываемыйОбъект;
//		мз.ИсточникИзменения = ВыборкаДетальныеЗаписи.ИсточникИзменения;
//		мз.Прочитать();
//		Если мз.Выбран() Тогда
//			мз.Обработано = Истина;
//			мз.ДатаОбработки = ТекущаяДата();
//			мз.Записать();
//		КонецЕсли;
//	КонецЦикла;
//		
//КонецПроцедуры	

Процедура СформироватьДвиженияОжиданиеПодбораНакладнойПослеГруженогоПлеча(ОбъектСделка) Экспорт
	
	ОбъектСделка.Движения.ОжиданиеПодбораНакладнойПослеГруженогоПлеча.Записывать = Истина;
	ОбъектСделка.Движения.ОжиданиеПодбораНакладнойПослеГруженогоПлеча.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОжиданиеПодбораНакладнойПослеГруженогоПлеча.УчетнаяЕдиница КАК УчетнаяЕдиница,
	|	ОжиданиеПодбораНакладнойПослеГруженогоПлеча.Период КАК Период,
	|	ОжиданиеПодбораНакладнойПослеГруженогоПлеча.ЖДН КАК ЖДН,
	|	ОжиданиеПодбораНакладнойПослеГруженогоПлеча.ПериодОжидания КАК ПериодОжидания
	|ПОМЕСТИТЬ ВТ_ОжидающиеУЕ
	|ИЗ
	|	РегистрСведений.ОжиданиеПодбораНакладнойПослеГруженогоПлеча КАК ОжиданиеПодбораНакладнойПослеГруженогоПлеча
	//|ГДЕ
	//|	ОжиданиеПодбораНакладнойПослеГруженогоПлеча.ЖДН = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_КалькуляцииСАльтернативнымиГруппамиУслуг
	|ИЗ
	|	Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	|ГДЕ
	|	(КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга.УслугаРасходовВыбираетсяПриУсловии = 1
	|			ИЛИ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга.УслугаРасходовВыбираетсяПриУсловии = 2)
	|	И КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ГруппаУслуг > 0
	|	И КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка В
	|			(ВЫБРАТЬ
	|				т.Калькуляция
	|			ИЗ
	|				Документ.Сделка.СвязьУчетныхЕдиниц КАК т
	|			ГДЕ
	|				т.Ссылка = &Сделка) 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.ЖДН.ДатаРаскредитации КАК Период,
	|	СделкаСвязьУчетныхЕдиниц.Вагон КАК УчетнаяЕдиница,
	|	СделкаСвязьУчетныхЕдиниц.НакладнаяПослеГруженогоПлеча КАК ЖДН,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияНазначения КАК СтанцияОжидания,
	|	СделкаСвязьУчетныхЕдиниц.Ссылка.ГоризонтПоискаНакладных КАК ПериодОжидания
	|ПОМЕСТИТЬ ВТ_ПостановкаВОжидание
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|ГДЕ
	|	СделкаСвязьУчетныхЕдиниц.Ссылка = &Сделка
	|	И НЕ СделкаСвязьУчетныхЕдиниц.Калькуляция = ЗНАЧЕНИЕ(Документ.Калькуляция.ПустаяСсылка)
	|	И НЕ СделкаСвязьУчетныхЕдиниц.Вагон = ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)
	|	И СделкаСвязьУчетныхЕдиниц.НеАктивна = ЛОЖЬ
	|	И СделкаСвязьУчетныхЕдиниц.Удалена = ЛОЖЬ
	|	И НЕ СделкаСвязьУчетныхЕдиниц.ЖДН.ДатаРаскредитации = ДАТАВРЕМЯ(1, 1, 1)
	|	И НЕ СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияНазначения = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|	И СделкаСвязьУчетныхЕдиниц.Калькуляция В
	|			(ВЫБРАТЬ
	|				т.Ссылка
	|			ИЗ
	|				ВТ_КалькуляцииСАльтернативнымиГруппамиУслуг КАК т) 
	|   И НЕ (СделкаСвязьУчетныхЕдиниц.ЖДН.ДатаРаскредитации, СделкаСвязьУчетныхЕдиниц.Вагон) В (ВЫБРАТЬ т.Период, т.УчетнаяЕдиница ИЗ ВТ_ОжидающиеУЕ КАК т)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.ЖДН.ДатаРаскредитации,
	|	СделкаСвязьУчетныхЕдиниц.Контейнер,
	|	СделкаСвязьУчетныхЕдиниц.НакладнаяПослеГружКТК,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияНазначения,
	|	СделкаСвязьУчетныхЕдиниц.Ссылка.ГоризонтПоискаНакладных
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|ГДЕ
	|	СделкаСвязьУчетныхЕдиниц.Ссылка = &Сделка
	|	И НЕ СделкаСвязьУчетныхЕдиниц.Калькуляция = ЗНАЧЕНИЕ(Документ.Калькуляция.ПустаяСсылка)
	|	И НЕ СделкаСвязьУчетныхЕдиниц.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	|	И СделкаСвязьУчетныхЕдиниц.НеАктивна = ЛОЖЬ
	|	И СделкаСвязьУчетныхЕдиниц.Удалена = ЛОЖЬ
	|	И НЕ СделкаСвязьУчетныхЕдиниц.ЖДН.ДатаРаскредитации = ДАТАВРЕМЯ(1, 1, 1)
	|	И НЕ СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияНазначения = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|	И СделкаСвязьУчетныхЕдиниц.Калькуляция В
	|			(ВЫБРАТЬ
	|				т.Ссылка
	|			ИЗ
	|				ВТ_КалькуляцииСАльтернативнымиГруппамиУслуг КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.ЖДН.ДатаОтправления КАК Период,
	|	СделкаСвязьУчетныхЕдиниц.Вагон КАК УчетнаяЕдиница,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН КАК ЖДН,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияОтправления КАК СтанцияОжидания,
	|	0 КАК ПериодОжидания,
	|	МИНИМУМ(ВТ_ОжидающиеУЕ.Период) КАК Период1
	|ПОМЕСТИТЬ ВТ_СнятиеСОжидания
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОжидающиеУЕ КАК ВТ_ОжидающиеУЕ
	|		ПО СделкаСвязьУчетныхЕдиниц.ЖДН.ДатаОтправления >= ВТ_ОжидающиеУЕ.Период
	|          И ВТ_ОжидающиеУЕ.ЖДН = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|ГДЕ
	|	СделкаСвязьУчетныхЕдиниц.Ссылка = &Сделка
	|	И НЕ СделкаСвязьУчетныхЕдиниц.Калькуляция = ЗНАЧЕНИЕ(Документ.Калькуляция.ПустаяСсылка)
	|	И НЕ СделкаСвязьУчетныхЕдиниц.Вагон = ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)
	|	И НЕ СделкаСвязьУчетныхЕдиниц.ЖДН = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|	И СделкаСвязьУчетныхЕдиниц.НеАктивна = ЛОЖЬ
	|	И СделкаСвязьУчетныхЕдиниц.Удалена = ЛОЖЬ
	|	И НЕ ВТ_ОжидающиеУЕ.УчетнаяЕдиница ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	СделкаСвязьУчетныхЕдиниц.Вагон,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН.ДатаОтправления,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияОтправления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.ЖДН.ДатаОтправления,
	|	СделкаСвязьУчетныхЕдиниц.Контейнер,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияОтправления,
	|	0,
	|	МИНИМУМ(ВТ_ОжидающиеУЕ.Период)
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОжидающиеУЕ КАК ВТ_ОжидающиеУЕ
	|		ПО СделкаСвязьУчетныхЕдиниц.Контейнер = ВТ_ОжидающиеУЕ.УчетнаяЕдиница
	|			И СделкаСвязьУчетныхЕдиниц.ЖДН.ДатаОтправления >= ВТ_ОжидающиеУЕ.Период
	|           И ВТ_ОжидающиеУЕ.ЖДН = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|ГДЕ
	|	СделкаСвязьУчетныхЕдиниц.Ссылка = &Сделка
	|	И НЕ СделкаСвязьУчетныхЕдиниц.Калькуляция = ЗНАЧЕНИЕ(Документ.Калькуляция.ПустаяСсылка)
	|	И НЕ СделкаСвязьУчетныхЕдиниц.Вагон = ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)
	|	И НЕ СделкаСвязьУчетныхЕдиниц.ЖДН = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|	И СделкаСвязьУчетныхЕдиниц.НеАктивна = ЛОЖЬ
	|	И СделкаСвязьУчетныхЕдиниц.Удалена = ЛОЖЬ
	|	И НЕ ВТ_ОжидающиеУЕ.УчетнаяЕдиница ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	СделкаСвязьУчетныхЕдиниц.Контейнер,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН.ДатаОтправления,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН.СтанцияОтправления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СнятиеСОжидания.Период КАК Период,
	|	ВТ_СнятиеСОжидания.УчетнаяЕдиница КАК УчетнаяЕдиница,
	|	ВТ_СнятиеСОжидания.ЖДН КАК ЖДН,
	|	ВТ_СнятиеСОжидания.СтанцияОжидания КАК СтанцияОжидания,
	|	ВТ_СнятиеСОжидания.ПериодОжидания КАК ПериодОжидания
	|ПОМЕСТИТЬ ВТ_СнятиеСОжидания_2
	|ИЗ
	|	ВТ_СнятиеСОжидания КАК ВТ_СнятиеСОжидания
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОжидающиеУЕ КАК ВТ_ОжидающиеУЕ
	|		ПО ВТ_СнятиеСОжидания.Период1 = ВТ_ОжидающиеУЕ.Период
	|			И ВТ_СнятиеСОжидания.УчетнаяЕдиница = ВТ_ОжидающиеУЕ.УчетнаяЕдиница
	//Евросиб - АСуслов 22.02.2022 15:50:10 #47651
	//(
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОжиданиеПодбораНакладнойПослеГруженогоПлеча КАК ОжиданиеПодбораНакладнойПослеГруженогоПлеча
	|		ПО ВТ_СнятиеСОжидания.Период = ОжиданиеПодбораНакладнойПослеГруженогоПлеча.Период
	|			И ВТ_СнятиеСОжидания.УчетнаяЕдиница = ОжиданиеПодбораНакладнойПослеГруженогоПлеча.УчетнаяЕдиница
	|ГДЕ
	|	НЕ ВТ_ОжидающиеУЕ.ЖДН ЕСТЬ NULL
	|	И ВТ_ОжидающиеУЕ.ЖДН = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|	И ОжиданиеПодбораНакладнойПослеГруженогоПлеча.УчетнаяЕдиница ЕСТЬ NULL
	//)
	//Евросиб - АСуслов 22.02.2022 15:50:18 #47651
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ПостановкаВОжидание.Период КАК Период,
	|	ВТ_ПостановкаВОжидание.УчетнаяЕдиница КАК УчетнаяЕдиница,
	|	ВТ_ПостановкаВОжидание.ЖДН КАК ЖДН,
	|	ВТ_ПостановкаВОжидание.СтанцияОжидания КАК СтанцияОжидания,
	|	ВТ_ПостановкаВОжидание.ПериодОжидания КАК ПериодОжидания
	|ИЗ
	|	ВТ_ПостановкаВОжидание КАК ВТ_ПостановкаВОжидание
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_СнятиеСОжидания_2.Период,
	|	ВТ_СнятиеСОжидания_2.УчетнаяЕдиница,
	|	ВТ_СнятиеСОжидания_2.ЖДН,
	|	ВТ_СнятиеСОжидания_2.СтанцияОжидания,
	|	ВТ_СнятиеСОжидания_2.ПериодОжидания
	|ИЗ
	|	ВТ_СнятиеСОжидания_2 КАК ВТ_СнятиеСОжидания_2";
	Запрос.УстановитьПараметр("Сделка", ОбъектСделка.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();                 
	Если РезультатЗапроса.Пустой() Тогда
		ОбъектСделка.Движения.ОжиданиеПодбораНакладнойПослеГруженогоПлеча.Очистить();
	Иначе
		ОбъектСделка.Движения.ОжиданиеПодбораНакладнойПослеГруженогоПлеча.Загрузить(Запрос.Выполнить().Выгрузить());		
	КонецЕсли;
		
КонецПроцедуры

Процедура СформироватьДвиженияРазнесенияЗатратПТУ(ОбъектСделка) Экспорт 
	
	ОбъектСделка.Движения.РазнесениеЗатратПТУ.Записывать = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаРасходы.ГУИД КАК ГУИД,
//	|	СделкаРасходы.ПериодВО КАК ПериодВО,
	|	ЕСТЬNULL(ТЕ.Ссылка, НЕОПРЕДЕЛЕНО) КАК Контейнер,
	|	ВЫБОР
	|		КОГДА СделкаРасходы.Количество <> 0
	|			ТОГДА СделкаРасходы.СуммаИтого / СделкаРасходы.Количество
	|		ИНАЧЕ СделкаРасходы.СуммаИтого
	|	КОНЕЦ КАК СуммаПодлежащаяРазнесению,
	|	СделкаРасходы.Регламентный КАК Регламентный
	|ИЗ
	|	Документ.Сделка.Расходы КАК СделкаРасходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|		ПО СделкаРасходы.Ссылка = СделкаСвязьУчетныхЕдиниц.Ссылка
	|			И СделкаРасходы.СтрокаСвязьУчетныхЕдиниц = СделкаСвязьУчетныхЕдиниц.ГУИД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ДоходыКТК КАК СделкаДоходыКТК
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
	|			ПО (ПОДСТРОКА(СделкаДоходыКТК.КТК, 1, 11) = ТЕ.Наименование)
	|				И (НЕ ТЕ.ПометкаУдаления)
	|		ПО СделкаРасходы.ГУИД = СделкаДоходыКТК.ГУИД
	|ГДЕ
	|	СделкаРасходы.Ссылка = &Ссылка
	|	И СделкаРасходы.УслугаОтключена = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	СделкаРасходы.НомерСтроки";
	Запрос.УстановитьПараметр("Ссылка", ОбъектСделка.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение = ОбъектСделка.Движения.РазнесениеЗатратПТУ.ДобавитьПриход();
		Движение.ГУИДРасходов = Выборка.ГУИД;
		Движение.КТК = Выборка.Контейнер;
		Движение.Период = ОбъектСделка.Дата;
		//Движение.ПериодВО = Выборка.ПериодВО;
		Движение.ПодлежащаяРазнесению = Выборка.СуммаПодлежащаяРазнесению;
		Движение.Регистратор = ОбъектСделка.Ссылка;
		Движение.Сделка = ОбъектСделка.Ссылка;
		Движение.Регламентный = Выборка.Регламентный;
		Движение.ПолностьюРазнесено = -1;
	КонецЦикла;
		
КонецПроцедуры

//Евросиб - АСуслов 17.08.2022 14:02:06 #55129
//(
Процедура СформироватьДвиженияРазнесениеРасходов(ОбъектСделка) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ  
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	СделкаРасходы.Ссылка КАК Регистратор,
	|	СделкаРасходы.Ссылка.Дата КАК Период,
	|	СделкаРасходы.Ссылка КАК Сделка,
	|	СделкаРасходы.ГУИД КАК ГУИДРасходов,
	|	1 КАК НеРазнесено
	|ИЗ
	|	Документ.Сделка.Расходы КАК СделкаРасходы
	|ГДЕ 
	|   СделкаРасходы.Ссылка = &Ссылка
	|	И НЕ СделкаРасходы.УслугаОтключена
	|	И НЕ СделкаРасходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта)
	|	И НЕ СделкаРасходы.ВнутренняяСебестоимость";
	Запрос.УстановитьПараметр("Ссылка", ОбъектСделка.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	//Евросиб - АСуслов 26.12.2022 14:46:22 #без таски
	//(
	//Если РезультатЗапроса.Пустой() Тогда
	//	Возврат;
	//КонецЕсли;  
	//)
	//Евросиб - АСуслов 26.12.2022 14:46:23 #
	ОбъектСделка.Движения.РазнесениеРасходов.Записывать = Истина;
	ОбъектСделка.Движения.РазнесениеРасходов.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры
//)
//Евросиб - АСуслов 17.08.2022 14:02:26 #55129

Процедура ЗаписатьСвязиДоходовИСУЕ(ОбъектСделка, Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаДоходы.ГУИД КАК ГУИД,
	|	СделкаДоходы.Услуга КАК Услуга,
	|	СделкаДоходы.Клиент КАК Клиент,
	|	СделкаДоходы.Договор КАК Договор,
	|	СделкаДоходы.Калькуляция КАК Калькуляция,
	|	СделкаДоходы.РазмерКТК КАК РазмерКТК,
	|	СделкаДоходы.Груз КАК Груз,
	|	СделкаДоходы.Коносамент КАК Коносамент,
	|	СделкаДоходы.УслугаВнеСтавки КАК УслугаВнеСтавки
	|ПОМЕСТИТЬ ВТ_Доходы
	|ИЗ
	|	&Доходы КАК СделкаДоходы
	|ГДЕ  
	//Евросиб - АСуслов 21.03.2022 13:42:57 #
	//(
	//убрал условие в запросе добавил поиск по пустому гуиду доход в отборе строк при обработке результата
	|	//СделкаДоходы.НеВыставлятьКлиенту = ЛОЖЬ
	//)
	//Евросиб - АСуслов 21.03.2022 13:42:58 #
	|	ВЫБОР КОГДА &ДляКоррРТУ ТОГДА НЕ СделкаДоходы.КорректировкаДокумента = ЗНАЧЕНИЕ(Документ.КорректировкаРеализации.ПустаяСсылка) ИНАЧЕ СделкаДоходы.КорректировкаДокумента = ЗНАЧЕНИЕ(Документ.КорректировкаРеализации.ПустаяСсылка) КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	|	СделкаСвязьУчетныхЕдиниц.НомерСтроки КАК НомерСтроки,
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.Контейнер КАК Справочник.ТЕ) КАК Контейнер,
	|	СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция,
	|	СделкаСвязьУчетныхЕдиниц.РазмерКТК КАК РазмерКТК,
	|	СделкаСвязьУчетныхЕдиниц.Груз КАК Груз,
	|	СделкаСвязьУчетныхЕдиниц.Коносамент КАК Коносамент,
	|	СделкаСвязьУчетныхЕдиниц.Клиент КАК Клиент,
	|	СделкаСвязьУчетныхЕдиниц.Договор КАК Договор
	|ПОМЕСТИТЬ ВТ_СвязьУчетныхЕдиниц
	|ИЗ
	|	&СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаДоходыКТК.ГУИД КАК ГУИД,
	|	СделкаДоходыКТК.КТК КАК КТК
	|ПОМЕСТИТЬ ВТ_ДоходыКТК
	|ИЗ
	|	&ДоходыКТК КАК СделкаДоходыКТК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Доходы.ГУИД КАК ГУИД_Доходы,
	|	ВЫБОР
	|		КОГДА ВТ_Доходы.УслугаВнеСтавки
	|				ИЛИ ВТ_Доходы.Услуга = &Фрахт
	|			ТОГДА ВТ_Доходы.Услуга
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК Услуга,
	|	СделкаДоходыКТК.КТК КАК КТК,
	|	ВТ_Доходы.Клиент КАК Клиент,
	|	ВТ_Доходы.Договор КАК Договор,
	|	ВТ_Доходы.Калькуляция КАК Калькуляция,
	|	ВТ_Доходы.РазмерКТК КАК РазмерКТК,
	|	ВТ_Доходы.Груз КАК Груз,
	|	ВТ_Доходы.УслугаВнеСтавки КАК УслугаВнеСтавки,
	|	ЕСТЬNULL(ФормированиеФинДокументов.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно, ЛОЖЬ) КАК Построчно,
	|	ВТ_Доходы.Коносамент КАК Коносамент
	|ПОМЕСТИТЬ ВТ_Предварительный
	|ИЗ
	|	ВТ_Доходы КАК ВТ_Доходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ДоходыКТК КАК СделкаДоходыКТК
	|		ПО ВТ_Доходы.ГУИД = СделкаДоходыКТК.ГУИД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФормированиеФинДокументов КАК ФормированиеФинДокументов
	|		ПО ВТ_Доходы.Клиент = ФормированиеФинДокументов.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.НомерСтроки КАК НомерСтроки,
	|	ВложенныйЗапрос.ГУИД_Доходы КАК ГУИД_Доходы,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.УслугаВнеСтавки
	|				ИЛИ ВложенныйЗапрос.Услуга = &Фрахт
	|			ТОГДА ВложенныйЗапрос.Услуга
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК Услуга,
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД_СУЕ,
	|	ВложенныйЗапрос.КТК КАК КТК,
	|	СделкаСвязьУчетныхЕдиниц.Контейнер.Наименование КАК Контейнер,
	|	ВложенныйЗапрос.Коносамент КАК Коносамент
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТ_СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Предварительный КАК ВложенныйЗапрос
	|		ПО СделкаСвязьУчетныхЕдиниц.Клиент = ВложенныйЗапрос.Клиент
	|			И СделкаСвязьУчетныхЕдиниц.Договор = ВложенныйЗапрос.Договор
	|			И (ВЫБОР
	|				КОГДА &НеУчитыватьКалькуляции
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ СделкаСвязьУчетныхЕдиниц.Калькуляция = ВложенныйЗапрос.Калькуляция
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА &РежимПодобно = ИСТИНА
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ СделкаСвязьУчетныхЕдиниц.РазмерКТК = ВложенныйЗапрос.РазмерКТК
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА &НеУчитыватьГруз
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ СделкаСвязьУчетныхЕдиниц.Груз = ВложенныйЗапрос.Груз
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА &РежимПодобно = ЛОЖЬ
	|						И ПОДСТРОКА(ВложенныйЗапрос.КТК, 13, 13) = """"
	|					ТОГДА СделкаСвязьУчетныхЕдиниц.Контейнер.Наименование = ПОДСТРОКА(ВложенныйЗапрос.КТК, 1, 11)
	|				КОГДА &РежимПодобно = ИСТИНА
	|					ТОГДА ВложенныйЗапрос.КТК ПОДОБНО ""%"" + СделкаСвязьУчетныхЕдиниц.Контейнер.Наименование + ""%""
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА &РежимПодобно = ИСТИНА
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ СделкаСвязьУчетныхЕдиниц.Коносамент = ВложенныйЗапрос.Коносамент
	|			КОНЕЦ)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВложенныйЗапрос.Построчно
	|				ТОГДА НЕ ВложенныйЗапрос.ГУИД_Доходы ЕСТЬ NULL
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.НомерСтроки КАК НомерСтроки,
	|	ВТ.ГУИД_Доходы КАК Доходы,
	|	ВТ.Услуга КАК Услуга,
	|	ВТ.ГУИД_СУЕ КАК СвязьУчетныхЕдиниц,
	|	СделкаСвязьДоходовИРасходов.НомерСтроки КАК НомерСтроки1,
	|	ВТ.КТК КАК КТК,
	|	ВТ.Контейнер КАК Контейнер
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|		ПО ВТ.ГУИД_Доходы = СделкаСвязьДоходовИРасходов.Доходы
	|			И ВТ.ГУИД_СУЕ = СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц
	|			И ВТ.Услуга = СделкаСвязьДоходовИРасходов.Услуга
	|ГДЕ
	|	СделкаСвязьДоходовИРасходов.НомерСтроки ЕСТЬ NULL
	|   И НЕ ВТ.ГУИД_Доходы = """" 
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|ИТОГИ ПО
	|	СделкаСвязьДоходовИРасходов.Ссылка";	
	Запрос.УстановитьПараметр("Доходы", ОбъектСделка.Доходы.Выгрузить());
	Запрос.УстановитьПараметр("ДоходыКТК", ОбъектСделка.ДоходыКТК.Выгрузить());
	Запрос.УстановитьПараметр("СвязьУчетныхЕдиниц", ОбъектСделка.СвязьУчетныхЕдиниц.Выгрузить());
	Запрос.УстановитьПараметр("НеУчитыватьКалькуляции", Истина);
	Запрос.УстановитьПараметр("НеУчитыватьГруз", Истина);
	Запрос.УстановитьПараметр("Фрахт", ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("УслугаФрахтаДляКалькуляции"));
	Запрос.УстановитьПараметр("РежимПодобно", Истина);
	Запрос.УстановитьПараметр("ДляКоррРТУ", Параметры.ДляКоррРТУ);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаСделки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСделки.Следующий() Цикл
		//обСделка = ВыборкаСделки.Ссылка.ПолучитьОбъект();
		ВыборкаСтроки = ВыборкаСделки.Выбрать();
		Пока ВыборкаСтроки.Следующий() Цикл
			СтрокиСвязей = ОбъектСделка.СвязьДоходовИРасходов.НайтиСтроки(Новый Структура("Доходы, СвязьУчетныхЕдиниц, Услуга", "", ВыборкаСтроки.СвязьУчетныхЕдиниц, ВыборкаСтроки.Услуга));
			Если СтрокиСвязей.Количество() > 0 Тогда
				Для каждого СтрокаСвязи Из СтрокиСвязей Цикл
					СтрокаСвязи.Доходы = ВыборкаСтроки.Доходы;
				КонецЦикла;
			Иначе
				нСтрока = ОбъектСделка.СвязьДоходовИРасходов.Добавить();
				ЗаполнитьЗначенияСвойств(нСтрока, ВыборкаСтроки);
			КонецЕсли; 
		КонецЦикла; 
	КонецЦикла; 
	
КонецПроцедуры

Функция ЕстьПроведенныеРТУКСделке(Сделка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка,
	|	ИсторияКорректировокРеализацийСрезПоследних.ВидОперации КАК ВидОперации
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияКорректировокРеализаций.СрезПоследних КАК ИсторияКорректировокРеализацийСрезПоследних
	|		ПО РеализацияТоваровУслугУслуги.Ссылка = ИсторияКорректировокРеализацийСрезПоследних.ПервичныйДокумент
	|ГДЕ
	|	РеализацияТоваровУслугУслуги.Сделка = &Сделка
	|	И РеализацияТоваровУслугУслуги.Ссылка.Проведен
	|	И НЕ ЕСТЬNULL(ИсторияКорректировокРеализацийСрезПоследних.ВидОперации, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтчетКомитентуОПродажах.Ссылка,
	|	ИсторияКорректировокРеализацийСрезПоследних.ВидОперации
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияКорректировокРеализаций.СрезПоследних КАК ИсторияКорректировокРеализацийСрезПоследних
	|		ПО ОтчетКомитентуОПродажах.Ссылка = ИсторияКорректировокРеализацийСрезПоследних.ПервичныйДокумент
	|ГДЕ
	|	ОтчетКомитентуОПродажах.Сделка = &Сделка
	|	И ОтчетКомитентуОПродажах.Ссылка.Проведен
	|	И НЕ ЕСТЬNULL(ИсторияКорректировокРеализацийСрезПоследних.ВидОперации, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование)";
	Запрос.УстановитьПараметр("Сделка", Сделка);
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ЕстьАктуальныеАкцептыКСделке(Сделка) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Акцепт.Поступление КАК Поступление,
	|	Акцепт.Ссылка КАК Акцепт
	|ПОМЕСТИТЬ ВТАктуальныеАкцепты
	|ИЗ
	// Евросиб US 83437 TA 83438 Рыбьяков К.А. 11.06.2024 ((
	|	РегистрСведений.АктуальныеАкцепты КАК АктуальныеАкцепты
	//|	Документ.Акцепт КАК Акцепт
	// Евросиб Рыбьяков К.А. 11.06.2024 ))
	|ГДЕ
	|	Акцепт.Проведен
	|	И Акцепт.СторнируемыйАкцепт = ЗНАЧЕНИЕ(Документ.Акцепт.ПустаяСсылка)
	|	И НЕ Акцепт.Ссылка В
	|				(ВЫБРАТЬ
	|					Акцепт.СторнируемыйАкцепт КАК СторнируемыйАкцепт
	|				ИЗ
	|					Документ.Акцепт КАК Акцепт
	|				ГДЕ
	|					Акцепт.Проведен)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АкцептУслуги.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Акцепт.Услуги КАК АкцептУслуги
	|ГДЕ
	|	АкцептУслуги.Сделка = &Сделка
	|	И АкцептУслуги.Ссылка В (ВЫБРАТЬ т.Акцепт ИЗ ВТАктуальныеАкцепты КАК т)";
	Запрос.УстановитьПараметр("Сделка", Сделка);
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции


Процедура РегламентноеЗаданиеПодборЖДННакладныхВСделки() Экспорт
	ПодборЖДННакладныхВСделки(0,"");
КонецПроцедуры

// Евросиб Фролов (03.03.2022
Процедура ВыполнитьОтправкуУведомлений(Тема, ТекстСообщения, МетаданныеРегЗадания) Экспорт
	
	ПолучателиУведомлений = Константы.ПолучателиУведомленийОРегЗаданиях.Получить();
	
	Если Не ЗначениеЗаполнено(ПолучателиУведомлений) Тогда
		Возврат;
	КонецЕсли;	
	
	УчетнаяЗаписьПоУмолчаниюДоступна = РаботаСПочтовымиСообщениями.ПроверитьСистемнаяУчетнаяЗаписьДоступна();
		
	Если УчетнаяЗаписьПоУмолчаниюДоступна = Ложь Тогда
		Возврат;
	КонецЕсли;	
	
	СистемнаяУчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	ПолучателиПисьма = Новый Массив;
	
	Если ТипЗнч(ПолучателиУведомлений) = Тип("СправочникСсылка.Пользователи") Тогда
		ЭлАдресПользователя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПолучателиУведомлений, Справочники.ВидыКонтактнойИнформации.EmailПользователя, , Истина);
		ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", ПолучателиУведомлений, ЭлАдресПользователя));
	Иначе	
		Для Каждого ТекущийПользователь Из ПолучателиУведомлений.Состав Цикл								
			ЭлАдресПользователя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ТекущийПользователь.Пользователь, Справочники.ВидыКонтактнойИнформации.EmailПользователя, , Истина);
			ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", ТекущийПользователь.Пользователь, ЭлАдресПользователя));
		КонецЦикла;
	КонецЕсли;
	
	ПараметрыОтправкиПисьма = Новый Структура;
	ПараметрыОтправкиПисьма.Вставить("ТипТекста", 	Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст);
	ПараметрыОтправкиПисьма.Вставить("Тема", 		Тема);
	ПараметрыОтправкиПисьма.Вставить("Тело", 		ТекстСообщения);		
	ПараметрыОтправкиПисьма.Вставить("Кому", 		ПолучателиПисьма);
	
	Попытка
		РезультатОтправки = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(СистемнаяУчетнаяЗапись, ПараметрыОтправкиПисьма);
	Исключение
		ЗаписьЖурналаРегистрации("ОтправкаПисьмаОВыполненииРегЗадания",
							УровеньЖурналаРегистрации.Ошибка, МетаданныеРегЗадания, , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
						
КонецПроцедуры	
// Евросиб Фролов)

// Евросиб Фролов (11.03.2022, Task №44976
// Перенос из формы "ФормаСозданияКомплектаДокументов" документа "Сделка".

Функция ПолучитьСодержаниеУслуги(Сделка,Выборка,ПараметрыФФД,ТипДокумента,СчетНаАнгл, Контейнер = Неопределено, Вагон = Неопределено, КурсВалютыФрахт = Неопределено, ИзОбработки, КТКВХранилище, РелизСобственника = Неопределено) Экспорт
//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
//	Если ЗначениеЗаполнено(Выборка.Коносамент) Тогда
		//ПараметрыФФД = Справочники.ФормированиеФинДокументов.ПолучитьПараметрыФормированияФинансовыхДокументов(Выборка.Клиент, Выборка.Калькуляция.ПС_ВидПеревозки, Сделка.ПовагонныеОтправки);
		Если ПараметрыФФД <> Неопределено 
			И ПараметрыФФД.ИспользоватьРасширенныеПараметры
			//Евросиб - АСуслов 02.06.2021 10:50:49 #0233721
			//(
			И ЗначениеЗаполнено(ПараметрыФФД.ТекстРеализацииИИСФ) Тогда
			//)
			//Евросиб - АСуслов 02.06.2021 10:51:06 #0233721
			СодержаниеУслуги = ПолучитьСодержаниеУслугиМорскойЭкспорт(Сделка, Выборка, КурсВалютыФрахт, ПараметрыФФД);
			Возврат СодержаниеУслуги;
		КонецЕсли;
//	КонецЕсли; 
	// если клиент обычный, то стандартное заполнение содержания услуги
	СодержаниеУслуги = "";

	// Евросиб US 82073 TA 114490 Рыбьяков К.А. 18.03.2026 ((
	ЗаполнитьПоРелизу = Ложь;
	ПунктОтправленияРелиз = Неопределено;
	ПунктНазначенияРелиз = Неопределено;
	Если ЗначениеЗаполнено(РелизСобственника) Тогда
		Ответ = Новый Структура("ТаблицаДанных");
		ДоходыСделкиСервер.ЗаполнитьДанныеРелизаСобственника(, Сделка, Выборка.ГУИД, РелизСобственника, Ответ);
		//НайденныеСтроки = Ответ.ТаблицаДанных.НайтиСтроки(Новый Структура("КлючАналитикиСоставаПоезда", Выборка.КлючАналитикиСоставаПоезда));
		Если Ответ.ТаблицаДанных.Количество() = 1 Тогда
		//Если НайденныеСтроки.Количество() = 1 Тогда
			ПунктОтправленияРелиз = Ответ.ТаблицаДанных[0].ПунктОтправления;
			ПунктНазначенияРелиз = Ответ.ТаблицаДанных[0].ПунктНазначения;
			//ПунктОтправленияРелиз = НайденныеСтроки[0].ПунктОтправления;
			//ПунктНазначенияРелиз = НайденныеСтроки[0].ПунктНазначения;
			ЗаполнитьПоРелизу = Истина;
		КонецЕсли;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 18.03.2026 ))
	
	//Если НайденныйКлиент.Пустой() Тогда
	//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
	Если ПараметрыФФД = Неопределено Тогда
	//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
		// Евросиб US 82073 TA 114490 Рыбьяков К.А. 18.03.2026 ((
		Если ЗаполнитьПоРелизу Тогда
			СодержаниеУслуги = Выборка.Услуга.НаименованиеПолное + " по направлению " +  ПунктОтправленияРелиз + " - " +  ПунктНазначенияРелиз;
		Иначе
			СодержаниеУслуги = Выборка.Услуга.НаименованиеПолное + " по направлению " + Сделка.СтанцияОтправления + " - " + Сделка.СтанцияНазначения;
		КонецЕсли;
		//СодержаниеУслуги = Выборка.Услуга.НаименованиеПолное + " по направлению " + Сделка.СтанцияОтправления + " - " + Сделка.СтанцияНазначения;
		// Евросиб Рыбьяков К.А. 18.03.2026 ))
		//РейсВСделке = Сделка.Рейсы[0].Рейс; //ДИТ, Беляев СЮ, Ticket#0291686, 10-11-2022, закомментировано, не используется ниже, а к ошибке приводит если рейсов нет в Сделке
		//Для обычных клиентов Номер КП не нужен.
		//Если ЗначениеЗаполнено(РейсВСделке) Тогда
		//	НомерПоезда = ?(ТипЗнч(РейсВСделке) = Тип("СправочникСсылка.РейсыЖД")," КП №"+РейсВСделке.НомерПоезда,"");
		//	СодержаниеУслуги = СодержаниеУслуги +  НомерПоезда;
		//КонецЕсли;
		Если Сделка.ТипЗаказа <> Справочники.ТипыЗаказов.ПовагоннаяОтправка Тогда
			КТКСписок = Сделка.ДоходыКТК.Найти(Выборка.ГУИД,"ГУИД");
			Если КТКСписок <> Неопределено Тогда
				 СодержаниеУслуги = СодержаниеУслуги + Символы.ПС + "Список контейнеров: " + КТКСписок.КТК;
			КонецЕсли;
		Иначе
			ВагоныСписок = Сделка.ДоходыВагоны.Найти(Выборка.ГУИД,"ГУИД");
			Если ВагоныСписок <> Неопределено Тогда
				 СодержаниеУслуги = СодержаниеУслуги + Символы.ПС + "Список вагонов: " + ВагоныСписок.Вагон;
			КонецЕсли;
		КонецЕсли;
		
	// если клиент особый, то содержание услуги заполняется согласно образцу, заполненному в справочнике ФормированиеФинДокументов
	// для данного клиента
	//ИначеЕсли НЕ НайденныйКлиент.Пустой() И НЕ ИзОбработки Тогда
	//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
	ИначеЕсли ПараметрыФФД <> Неопределено И НЕ ИзОбработки Тогда
	//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
		КТКСписок = Сделка.ДоходыКТК.Найти(Выборка.ГУИД,"ГУИД");
		Если Контейнер <> Неопределено Тогда
			КТКСписок = Новый Структура("КТК", Контейнер.Наименование);
		КонецЕсли; 
		ВагоныСписок = Сделка.ДоходыВагоны.Найти(Выборка.ГУИД,"ГУИД");
		Если Вагон <> Неопределено Тогда
			ВагоныСписок = Новый Структура("Вагон", Вагон.Наименование);
		КонецЕсли; 
		Если КТКСписок <> Неопределено ИЛИ Выборка.Сделка.ПовагонныеОтправки Тогда
			// для набора контейнеров нужно получить список Гос номеров
			Запрос = Новый Запрос;
			Запрос.Текст =
				
			"ВЫБРАТЬ
			|	ЗаявкаСоставУслуги.НомерАвто КАК НомерАвто,
			// ДИТ Поморцева Т.П. Заявка 37404(36099) 01.09.2021.
			//|	ЗаявкаСоставУслуги.ДатаВзятия КАК ДатаВзятия,
			|	ЗаявкаСоставУслуги.АдресПогрузки КАК АдресПогрузки,
			|	ЗаявкаСоставУслуги.АдресВыгрузки КАК АдресВыгрузки,
			|	ВЫБОР
			|		КОГДА ЗаявкаСоставУслуги.СтанцияОтправления = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
			//Евросиб - АСуслов 05.10.2021 18:05:38 #
			//(
			//|			ТОГДА ЗаявкаСоставУслуги.ПунктОтправления.Наименование
			//|		ИНАЧЕ ЗаявкаСоставУслуги.СтанцияОтправления.Наименование
			|			ТОГДА ЗаявкаСоставУслуги.ПунктОтправления.Представление
			|		ИНАЧЕ ЗаявкаСоставУслуги.СтанцияОтправления.Представление
			//)
			//Евросиб - АСуслов 05.10.2021 18:05:39 #
			|	КОНЕЦ КАК СтанцияОтправления,
			|	ВЫБОР
			|		КОГДА ЗаявкаСоставУслуги.СтанцияНазначения = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
			//Евросиб - АСуслов 05.10.2021 18:06:19 #
			//(
			//|			ТОГДА ЗаявкаСоставУслуги.ПунктНазначения.Наименование
			//|		ИНАЧЕ ЗаявкаСоставУслуги.СтанцияНазначения.Наименование
			|			ТОГДА ЗаявкаСоставУслуги.ПунктНазначения.Представление
			|		ИНАЧЕ ЗаявкаСоставУслуги.СтанцияНазначения.Представление
			//)
			//Евросиб - АСуслов 05.10.2021 18:06:20 #
			|	КОНЕЦ КАК СтанцияНазначения,
			|	ЗаявкаСоставУслуги.РеестрКлиента КАК РеестрКлиента,
			// Евросиб Фролов (11.03.2022 Task №44976 
			|	ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.Коносамент.НомерТранспортногоДокумента, """") КАК Коносамент
			// Евросиб Фролов)
			|ИЗ
			|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
			// Евросиб Фролов (11.03.2022 Task №44976
			|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
			|		ПО ЗаявкаСоставУслуги.ГУИДСтроки = СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки
			|			И ЗаявкаСоставУслуги.Ссылка = СделкаСвязьУчетныхЕдиниц.Заявка
			|			И СделкаСвязьУчетныхЕдиниц.Ссылка = &Сделка
			// Евросиб Фролов)
			|ГДЕ
			|	ЗаявкаСоставУслуги.Ссылка В(&Ссылка)
			//|   И ВЫБОР КОГДА &ПовагонныеОтправки ТОГДА &НомерВагона ПОДОБНО ""%"" + ЗаявкаСоставУслуги.Вагон.Наименование + ""%"" ИНАЧЕ
			//ДИТ, Беляев СЮ, BUG 57210/TA 58096, 30-09-2022, начало (добавлен отбор по КТК, в случае когда вагон повторяется в нескольких строках Заявки поиск данных будет точнее)
			|   И ВЫБОР КОГДА &ПовагонныеОтправки ТОГДА &НомерВагона ПОДОБНО ""%"" + ЗаявкаСоставУслуги.Вагон.Наименование + ""%"" 
			|											И &ТекстУсловияПоКТК ИНАЧЕ
			//ДИТ, Беляев СЮ, BUG 57210/TA 58096, 30-09-2022, конец
			|	&НомерКТК ПОДОБНО ""%"" + ЗаявкаСоставУслуги.НомерКТК.Наименование + ""%"" КОНЕЦ";

						
			//Запрос.УстановитьПараметр("Ссылка",Выборка.Заявка);
			Запрос.УстановитьПараметр("Ссылка",Сделка.Заявки.ВыгрузитьКолонку("Заявка"));
			// Евросиб Фролов (11.03.2022 Task №44976
			Запрос.УстановитьПараметр("Сделка", Сделка);
			// Евросиб Фролов)
		
			// ДИТ Поморцва Т.П. Задача 0248387 29.10.21. начало
			//Запрос.УстановитьПараметр("НомерВагона",ВагоныСписок.Вагон);
			Если ВагоныСписок <> Неопределено Тогда
				Запрос.УстановитьПараметр("НомерВагона",ВагоныСписок.Вагон);
			Иначе
				Запрос.УстановитьПараметр("НомерВагона","");
			КонецЕсли;
			// ДИТ Поморцва Т.П. Задача 0248387 29.10.21. конец
			
			Запрос.УстановитьПараметр("ПовагонныеОтправки",Выборка.Сделка.ПовагонныеОтправки);
			
			// ДИТ Поморцва Т.П. Задача 234920 25.06.21. начало
			//Запрос.УстановитьПараметр("НомерКТК",КТКСписок.КТК);
			//ДИТ, Беляев СЮ, BUG 57210/TA 58096, 30-09-2022, начало
			ТекстУсловияПоКТК = "ИСТИНА";
			//ДИТ, Беляев СЮ, BUG 57210/TA 58096, 30-09-2022, конец
			Если КТКСписок <> Неопределено Тогда
				Запрос.УстановитьПараметр("НомерКТК",КТКСписок.КТК);
				//ДИТ, Беляев СЮ, BUG 57210/TA 58096, 30-09-2022, начало
				ТекстУсловияПоКТК = "&НомерКТК ПОДОБНО ""%"" + ЗаявкаСоставУслуги.НомерКТК.Наименование + ""%""";
				//ДИТ, Беляев СЮ, BUG 57210/TA 58096, 30-09-2022, конец
			Иначе
				Запрос.УстановитьПараметр("НомерКТК","");
			КонецЕсли;
			//ДИТ, Беляев СЮ, BUG 57210/TA 58096, 30-09-2022, начало
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ТекстУсловияПоКТК", ТекстУсловияПоКТК);
			//ДИТ, Беляев СЮ, BUG 57210/TA 58096, 30-09-2022, конец	
			// ДИТ Поморцва Т.П. Задача 234920 25.06.21. конец	
			
			НайденныеСтроки = Запрос.Выполнить().Выгрузить();
			ГосНомерСписок = "";
			ДатаПогрузки = "";
			Маршрут = "";
			МаршрутАвто = "";
			РеестрКлиента = "";
			// Евросиб Фролов (11.03.2022 Task №44976
			МассивКоносаментов = Новый Массив;
			// Евросиб Фролов)
			Для Каждого СтрН Из НайденныеСтроки Цикл
				ГосНомерСписок = ГосНомерСписок + " " + СокрЛП(СтрН.НомерАвто);
				// ДИТ Поморцева Т.П. Задача 37404(36099) 01.09.2021.
				//ДатаПогрузки = ДатаПогрузки + " " + Формат(СтрН.ДатаВзятия,"ДФ=dd.MM.yyyy HH:mm");
				РеестрКлиента = РеестрКлиента + " " + СокрЛП(СтрН.РеестрКлиента);
				Если Маршрут = "" Тогда
					// Евросиб US 82073 TA 114490 Рыбьяков К.А. 18.03.2026 ((
					Если ЗаполнитьПоРелизу Тогда
						Маршрут = СтрШаблон("%1 - %2", ПунктОтправленияРелиз, ПунктНазначенияРелиз);
					Иначе
						Маршрут = СтрШаблон("%1 - %2", СтрН.СтанцияОтправления, СтрН.СтанцияНазначения);
					КонецЕсли;
					//Маршрут = СтрШаблон("%1 - %2", СтрН.СтанцияОтправления, СтрН.СтанцияНазначения);
					// Евросиб Рыбьяков К.А. 18.03.2026 ))
				КонецЕсли; 
				Если МаршрутАвто = "" Тогда
					МаршрутАвто = СтрШаблон("%1 - %2", СтрН.АдресПогрузки, СтрН.АдресВыгрузки);
				КонецЕсли; 
				// Евросиб Фролов (11.03.2022 Task №44976
				Если ЗначениеЗаполнено(СтрН.Коносамент) И МассивКоносаментов.Найти(СтрН.Коносамент) = Неопределено Тогда
					МассивКоносаментов.Добавить(СтрН.Коносамент);
				КонецЕсли;
				// Евросиб Фролов)
			КонецЦикла;
			ГосНомерСписок = СтрЗаменить(СокрЛП(ГосНомерСписок)," ",", ");
			// ДИТ Поморцева Т.П. Задача 37404(36099) 01.09.2021.
			//ДатаПогрузки = СтрЗаменить(СокрЛП(ДатаПогрузки)," ",", ");
		КонецЕсли;
		
		// цикл по таблице справочника ФормированиеФинДокументов. Берем данные для формирования содержания услуги.
		// таблицу берем в зависимости от типа документа, для которого нужно сформировать состав услуги
		//ПараметрыОтбора = Новый Структура("Использование",Истина);
		//Если ТипДокумента = "Счет" Тогда
		//	ТЗ = НайденныйКлиент.Выгрузить()[0].Ссылка.ОписаниеУслугиСчет.Выгрузить(ПараметрыОтбора);
		//ИначеЕсли ТипДокумента = "Акт" Тогда
		//	ТЗ = НайденныйКлиент.Выгрузить()[0].Ссылка.ОписаниеУслугиАкт.Выгрузить(ПараметрыОтбора);
		//Иначе
		//	ТЗ = НайденныйКлиент.Выгрузить();
		//КонецЕсли;     
		ТЗ = ПолучитьТЗнастроекФормированияОписанияУслуг(ТипДокумента, ПараметрыФФД);
		
		Для Каждого Стр Из ТЗ Цикл
			ТекстСодержание = "";
			//Попытка 
			//	ТекстСодержание = Выборка[Стр.НазваниеРеквизита];
			//Исключение
			//КонецПопытки;
			//НуженПереводСтроки = Ложь; //ДИТ, Беляев СЮ, Ticket#0305974 , 11-04-2023, закомментировал
			Если Стр.НазваниеРеквизита = "Маршрут" И
				НЕ СчетНаАнгл = Неопределено Тогда
				ТекстСодержание = Выборка.МаршрутАнгл;
			КонецЕсли;
			Если Стр.НазваниеРеквизита = "НомерКТК" Тогда
				Если КТКСписок <> Неопределено Тогда
					ТекстСодержание = ТекстСодержание + Символы.ПС + КТКСписок.КТК;
				КонецЕсли;
			КонецЕсли;
			Если Стр.НазваниеРеквизита = "НомерАвто" Тогда
				ТекстСодержание = ГосНомерСписок;
			КонецЕсли;       
			//ДИТ, Беляев СЮ, Ticket#0267483, 05-04-2022, начало
			//Если Стр.НазваниеРеквизита = "Вагон" Тогда
			Если Стр.НазваниеРеквизита = "Вагон" И ВагоныСписок <> Неопределено Тогда
			//ДИТ, Беляев СЮ, Ticket#0267483, 05-04-2022, начало
				//НуженПереводСтроки = Истина; //ДИТ, Беляев СЮ, Ticket#0305974 , 11-04-2023, закомментировал
				//ТекстСодержание = СтрЗаменить(ВагоныСписок.Вагон,";",Символы.ПС);
				//ДИТ, Беляев СЮ, Ticket#0307513, 11-05-2023, начало
				ТекстСодержание = ВагоныСписок.Вагон;
				//ДИТ, Беляев СЮ, Ticket#0307513, 11-05-2023, конец
			КонецЕсли;
			// ДИТ Поморцева Т.П. Задача 37404(36099) 01.09.2021. начало
			//Если Стр.НазваниеРеквизита = "ДатаПогрузки" Тогда
			//	ТекстСодержание = ДатаПогрузки;
			//КонецЕсли;
			// ДИТ Поморцева Т.П. Задача 37404(36099) 01.09.2021. конец
			Если Стр.НазваниеРеквизита = "Маршрут" Тогда
				ТекстСодержание = ?(Маршрут="", Выборка.Маршрут, Маршрут);
			КонецЕсли; 
			Если Стр.НазваниеРеквизита = "МаршрутАвто" Тогда
				ТекстСодержание = МаршрутАвто;
			КонецЕсли; 
			Если Стр.НазваниеРеквизита = "РеестрКлиента" Тогда
				ТекстСодержание = РеестрКлиента;
			КонецЕсли; 
			Если Стр.НазваниеРеквизита = "Номенклатура" Тогда
				ТекстСодержание = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Услуга,"НаименованиеПолное");
			КонецЕсли; 
			
			// Евросиб Фролов (11.03.2022 Task №44976
			Если Стр.НазваниеРеквизита = "КоносаментыПоезда" Тогда
				Коносаменты = СтрСоединить(МассивКоносаментов, ";");
				ТекстСодержание = Коносаменты;
			КонецЕсли;
			// Евросиб Фролов)
			
			//СодержаниеУслуги = СодержаниеУслуги + ?(НуженПереводСтроки,Символы.ПС,"") + Стр.ТекстовоеОписание + " " + ТекстСодержание + " ";
			//ДИТ, Беляев СЮ, Ticket#0305974 , 11-04-2023, начало
			СодержаниеУслуги = СодержаниеУслуги + ?(Стр.СНовойСтроки,Символы.ПС,"") + Стр.ТекстовоеОписание + " " + ТекстСодержание + " ";
			//ДИТ, Беляев СЮ, Ticket#0305974 , 11-04-2023, конец
			
		КонецЦикла;
		СодержаниеУслуги = СокрЛП(СодержаниеУслуги);
		
		//// Евросиб Фролов (11.03.2022 Task №44976
		//Если ПараметрыФФД.ВидГруппировкиФрахта = Перечисления.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки Тогда
		//	Коносаменты = СтрСоединить(МассивКоносаментов, ";");
		//	СодержаниеУслуги = СодержаниеУслуги + " Коносаменты " + Коносаменты;
		//КонецЕсли;	
		//// Евросиб Фролов)
		
	// если данные изменяются из обработки, то нужно получить таблицу с маршрутом, 
	// номером реестра и ДатаНазначенияФакт, по которым сформируем список КТК
	//ИначеЕсли НЕ НайденныйКлиент.Пустой() И ИзОбработки Тогда 
	//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
	ИначеЕсли ПараметрыФФД <> Неопределено И ИзОбработки Тогда
	//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
		ДанныеИзОбработки = ПолучитьИзВременногоХранилища(КТКВХранилище);

		// для повагонной отправки механизм не должен содержать информацию по номеру авто и водителю.
		// достаточно получить сделку. а т.к. она одна в рамках выбранного периода, то не нужно проходить циклом по всем строкам
		//Если НайденныйКлиент.Выгрузить()[0].ДанныеИзРеестраПовагонки Тогда
		//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
		Если ПараметрыФФД.ДанныеИзРеестраПовагонки Тогда
		//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --
			//Евросиб Каблов 05.05.2022 ( Task 45436 Сделка - входной параметр этой процедуры. Из-за изменения здесь, менялась в вызывающей процедуре, что приводило к некорректному формированию акта.
			//Сделка = ДанныеИзОбработки[0].Сделка;
			//Евросиб Каблов 05.05.2022 )
		Иначе
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Маршрут",Выборка.Маршрут);
			ПараметрыОтбора.Вставить("НомерРеестра",Выборка.РеестрКлиента);
			ПараметрыОтбора.Вставить("ТипЗаказа",Выборка.ТипЗаказа);
			// для каждого контейнера нужно получить из заявки Гос номер авто
			Запрос = Новый Запрос;			
			Запрос.Текст = "ВЫБРАТЬ
			               |	ДанныеХран.Маршрут КАК Маршрут,
			               |	ДанныеХран.ДатаПогрузки КАК ДатаПогрузки,
			               |	ДанныеХран.НомерРеестра КАК НомерРеестра,
			               |	ДанныеХран.ТипЗаказа КАК ТипЗаказа,
			               |	ДанныеХран.Контейнер КАК Контейнер,
			               |	ДанныеХран.Заявка КАК Заявка
			               |ПОМЕСТИТЬ ВТ
			               |ИЗ
			               |	&ДанныеХран КАК ДанныеХран
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВТ.Маршрут КАК Маршрут,
			               |	ВТ.ДатаПогрузки КАК ДатаПогрузки,
			               |	ВТ.НомерРеестра КАК НомерРеестра,
			               |	ВТ.ТипЗаказа КАК ТипЗаказа,
			               |	ВТ.Контейнер КАК Контейнер,
			               |	ВТ.Заявка КАК Заявка,
						   // ДИТ Поморцева Т.П. Задача 37404(36099) 01.09.2021. начало
						   //|	ЗаявкаСоставУслуги.НомерАвто КАК НомерАвто,
			               //|	ЗаявкаСоставУслуги.ДатаВзятия КАК ДатаВзятия
						   |	ЗаявкаСоставУслуги.НомерАвто КАК НомерАвто
						   // ДИТ Поморцева Т.П. Задача 37404(36099) 01.09.2021. конец
			               |ИЗ
			               |	ВТ КАК ВТ
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
			               |		ПО ВТ.Заявка = ЗаявкаСоставУслуги.Ссылка
			               |			И ВТ.Контейнер = ЗаявкаСоставУслуги.НомерКТК";

			// Нужно отбирать только те данные, которые по отбору подходят для текущей выборки
			Запрос.УстановитьПараметр("ДанныеХран",ДанныеИзОбработки.Скопировать(ПараметрыОтбора));
			НайденныеСтроки = Запрос.Выполнить().Выгрузить();
			//КТКСписок = ""; //ДИТ, Беляев СЮ, Ticket#0307513, 13-04-2023, закомментировал
			ГосНомерСписок = "";
			ДатаПогрузки = "";
			Для Каждого СтрН Из НайденныеСтроки Цикл
				//КТКСписок = КТКСписок + " " + СтрН.Контейнер; //ДИТ, Беляев СЮ, Ticket#0307513, 13-04-2023, закомментировал
				ГосНомерСписок = ГосНомерСписок + " " + СокрЛП(СтрН.НомерАвто);
				// ДИТ Поморцева Т.П. Задача 37404(36099) 01.09.2021.
				//ДатаПогрузки = ДатаПогрузки + " " + Формат(СтрН.ДатаВзятия,"ДФ=dd.MM.yyyy HH:mm");
			КонецЦикла;
			//КТКСписок = СтрЗаменить(СокрЛП(КТКСписок)," ",", "); //ДИТ, Беляев СЮ, Ticket#0307513, 13-04-2023, закомментировал
			ГосНомерСписок = СтрЗаменить(СокрЛП(ГосНомерСписок)," ",", ");
			// ДИТ Поморцева Т.П. Задача 37404(36099) 01.09.2021.
			//ДатаПогрузки = СтрЗаменить(СокрЛП(ДатаПогрузки)," ",", ");
		КонецЕсли;
		
		ВагоныСписок = Сделка.ДоходыВагоны.Найти(Выборка.ГУИД,"ГУИД");
		//ДИТ, Беляев СЮ, Ticket#0307513, 13-04-2023, начало
		КТКСписок = "";
		СтрДоходыКТК = Сделка.ДоходыКТК.Найти(Выборка.ГУИД,"ГУИД");
		Если СтрДоходыКТК <> Неопределено Тогда
			КТКСписок = СтрДоходыКТК.КТК;
		КонецЕсли;
		//ДИТ, Беляев СЮ, Ticket#0307513, 13-04-2023, конец
		
		// цикл по таблице справочника ФормированиеФинДокументов. Берем данные для формирования содержания услуги.
		// таблицу берем в зависимости от типа документа, для которого нужно сформировать состав услуги
		//ПараметрыОтбора = Новый Структура("Использование",Истина);
		//Если ТипДокумента = "Счет" Тогда
		//	 ТЗ = НайденныйКлиент.Выгрузить()[0].Ссылка.ОписаниеУслугиСчет.Выгрузить(ПараметрыОтбора); 
		//ИначеЕсли ТипДокумента = "Акт" Тогда
		//	ТЗ = НайденныйКлиент.Выгрузить()[0].Ссылка.ОписаниеУслугиАкт.Выгрузить(ПараметрыОтбора);  
		//Иначе
		//	ТЗ = НайденныйКлиент.Выгрузить();
		//КонецЕсли; 
		ТЗ = ПолучитьТЗнастроекФормированияОписанияУслуг(ТипДокумента, ПараметрыФФД);
			
		Для Каждого Стр Из ТЗ Цикл
			ТекстСодержание = "";
			Попытка 
				ТекстСодержание = Выборка[Стр.НазваниеРеквизита];
			Исключение
			КонецПопытки;
			Если Стр.НазваниеРеквизита = "Маршрут" И
				НЕ СчетНаАнгл = Неопределено Тогда
				ТекстСодержание = Выборка.МаршрутАнгл;
			КонецЕсли;
			Если Стр.НазваниеРеквизита = "НомерКТК" Тогда
				ТекстСодержание = ТекстСодержание + Символы.ПС + КТКСписок;
			КонецЕсли;
			Если Стр.НазваниеРеквизита = "НомерАвто" Тогда
				ТекстСодержание = ТекстСодержание + ГосНомерСписок;
			КонецЕсли;
			// ДИТ Поморцева Т.П. Задача 37404(36099) 01.09.2021. начало
			//Если Стр.НазваниеРеквизита = "ДатаПогрузки" Тогда
			//	ТекстСодержание = Формат(ТекстСодержание,"ДФ=dd.MM.yyyy HH:mm");
			//КонецЕсли;
			// ДИТ Поморцева Т.П. Задача 37404(36099) 01.09.2021. конец 
			
			//ДИТ, Беляев СЮ, Ticket#0267483, 05-04-2022, начало
			//Если Стр.НазваниеРеквизита = "Вагон" Тогда			
			Если Стр.НазваниеРеквизита = "Вагон" И ВагоныСписок <> Неопределено Тогда  
			//ДИТ, Беляев СЮ, Ticket#0267483, 05-04-2022, конец
				//ТекстСодержание = СтрЗаменить(ВагоныСписок.Вагон,";",Символы.ПС);
				//ДИТ, Беляев СЮ, Ticket#0307513, 11-05-2023, начало
				ТекстСодержание = ВагоныСписок.Вагон;
				//ДИТ, Беляев СЮ, Ticket#0307513, 11-05-2023, конец
			КонецЕсли;
			//СодержаниеУслуги = СодержаниеУслуги + Стр.ТекстовоеОписание + " " + ТекстСодержание + " ";
			//ДИТ, Беляев СЮ, Ticket#0305974 , 11-04-2023, начало
			СодержаниеУслуги = СодержаниеУслуги + ?(Стр.СНовойСтроки,Символы.ПС,"") + Стр.ТекстовоеОписание + " " + ТекстСодержание + " ";
			//ДИТ, Беляев СЮ, Ticket#0305974 , 11-04-2023, конец
		КонецЦикла;
		СодержаниеУслуги = СокрЛП(СодержаниеУслуги);
	КонецЕсли;
	
	Возврат СодержаниеУслуги;
	
КонецФункции			

Функция ПолучитьСодержаниеУслугиМорскойЭкспорт(Сделка, Выборка, КурсВалютыФрахт, ПараметрыФФД) 

	ЗаменаСоответствие = Новый Соответствие;
	СтруктураКоносамента = Новый Структура("НомерТранспортногоДокумента, 
											|НомерБукинга,
											|СтанцияОтправления,
											|СтанцияНазначения,
											|МестоПолученияГруза,
											|МестоПоставкиГруза");
	Если ЗначениеЗаполнено(Выборка.Коносамент) Тогда
		РеквизитыКоносамента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Выборка.Коносамент, СтруктураКоносамента);   		
	Иначе
		РеквизитыКоносамента = Неопределено;
	КонецЕсли; 
	РеквизитыКалькуляции = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Выборка.Калькуляция,"Курс, Валюта, ММ_ИтогоСтавка, ММ_ИтогоСтавка20");																					
	ЗаменаСоответствие.Вставить("##КурсКалькуляции",РеквизитыКалькуляции.Курс) ;
	ЗаменаСоответствие.Вставить("##КурсФрахта", КурсВалютыФрахт.Курс);
	ЗаменаСоответствие.Вставить("##ДатаКурса", Формат(КурсВалютыФрахт.ДатаКурса,"ДФ=dd.MM.yyyy"));
	ЗаменаСоответствие.Вставить("##ПунктОтправленияСуша", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.СтанцияОтправления,"Наименование"));
	ЗаменаСоответствие.Вставить("##ПунктНазначенияСуша", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.СтанцияНазначения,"Наименование"));
	Если РеквизитыКоносамента <> Неопределено Тогда
		ЗаменаСоответствие.Вставить("##Коносамент", РеквизитыКоносамента.НомерТранспортногоДокумента);
		ЗаменаСоответствие.Вставить("##Букинг", РеквизитыКоносамента.НомерБукинга);
		// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Начало: 08.11.2024
		// Было:
		//ЗаменаСоответствие.Вставить("##ПунктОтправленияКС", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыКоносамента.СтанцияОтправления,"Наименование"));
		//ЗаменаСоответствие.Вставить("##ПунктНазначенияКС", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыКоносамента.СтанцияНазначения,"Наименование"));
		//Стало:
		ЗаменаСоответствие.Вставить("##ПортОтправленияКС", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыКоносамента.СтанцияОтправления,"Наименование"));
		ЗаменаСоответствие.Вставить("##ПортНазначенияКС", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыКоносамента.СтанцияНазначения,"Наименование"));
		ЗаменаСоответствие.Вставить("##МорскойТерминалОтправленияКС", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыКоносамента.МестоПолученияГруза,"Наименование"));
		ЗаменаСоответствие.Вставить("##МорскойТерминалНазначенияКС", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыКоносамента.МестоПоставкиГруза,"Наименование"));
		// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Конец: 08.11.2024
	Иначе
		ЗаменаСоответствие.Вставить("##Коносамент", "");
		ЗаменаСоответствие.Вставить("##Букинг", "");
		// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Начало: 08.11.2024
		// Было:
		//ЗаменаСоответствие.Вставить("##ПунктОтправленияКС", "");
		//ЗаменаСоответствие.Вставить("##ПунктНазначенияКС", ""); 
		//Стало:
		ЗаменаСоответствие.Вставить("##ПортОтправленияКС", "");
		ЗаменаСоответствие.Вставить("##ПортНазначенияКС", ""); 
		ЗаменаСоответствие.Вставить("##МорскойТерминалОтправленияКС", "");
		ЗаменаСоответствие.Вставить("##МорскойТерминалНазначенияКС", "");
		// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Конец: 08.11.2024
	КонецЕсли; 
	//Евросиб Каблов 04.05.2021 (
	//ЗаменаСоответствие.Вставить("##ВалютаКалькуляции", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыКалькуляции.Валюта,"СокращенноеНаименование"));
	Если ЗначениеЗаполнено(РеквизитыКалькуляции.Валюта) Тогда
		ЗаменаСоответствие.Вставить("##ВалютаКалькуляции", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыКалькуляции.Валюта,"СокращенноеНаименование"));
	Иначе
		ЗаменаСоответствие.Вставить("##ВалютаКалькуляции", "");
	КонецЕсли;
	//Евросиб Каблов 04.05.2021 )
	ЗаменаСоответствие.Вставить("##ВалютаФрахта", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КурсВалютыФрахт.Валюта,"СокращенноеНаименование"));	
	//Евросиб Каблов 04.05.2021 (
	//ЗаменаСоответствие.Вставить("##СписокКТК", Сделка.ДоходыКТК.Найти(Выборка.ГУИД,"ГУИД").КТК);
	НайденнаяСтрокаКТК = Сделка.ДоходыКТК.Найти(Выборка.ГУИД,"ГУИД");
	Если НайденнаяСтрокаКТК <> Неопределено Тогда
		ЗаменаСоответствие.Вставить("##СписокКТК", НайденнаяСтрокаКТК.КТК);
	Иначе
		ЗаменаСоответствие.Вставить("##СписокКТК", "");
	КонецЕсли;
	//Евросиб Каблов 04.05.2021 )
	
	ЗаменаСоответствие.Вставить("##СуммаКомплекснойСтавки", Формат(?(Выборка.РазмерКТК = Справочники.РазмерыКТК.К20, РеквизитыКалькуляции.ММ_ИтогоСтавка20, РеквизитыКалькуляции.ММ_ИтогоСтавка), "ЧДЦ=2; ЧН="));
	
	
	ЗаменаСоответствие.Вставить("##Пункт_ОтправленияСушаENG", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.СтанцияОтправления,"НаименованиеАнгл"));
	ЗаменаСоответствие.Вставить("##Пункт_НазначенияСушаENG", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.СтанцияНазначения,"НаименованиеАнгл"));
	Если РеквизитыКоносамента <> Неопределено Тогда
		// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Начало: 08.11.2024
		// Было:
		//ЗаменаСоответствие.Вставить("##Пункт_ОтправленияКСENG", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыКоносамента.СтанцияОтправления,"НаименованиеАнгл"));
		//ЗаменаСоответствие.Вставить("##Пункт_НазначенияКСENG", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыКоносамента.СтанцияНазначения,"НаименованиеАнгл"));
		//Стало:
		ЗаменаСоответствие.Вставить("##ПортОтправленияКСENG", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыКоносамента.СтанцияОтправления,"НаименованиеАнгл"));
		ЗаменаСоответствие.Вставить("##ПортНазначенияКСENG", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыКоносамента.СтанцияНазначения,"НаименованиеАнгл")); 
		ЗаменаСоответствие.Вставить("##МорскойТерминалОтправленияКСENG", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыКоносамента.МестоПолученияГруза,"НаименованиеАнгл"));
		ЗаменаСоответствие.Вставить("##МорскойТерминалНазначенияКСENG", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыКоносамента.МестоПоставкиГруза,"НаименованиеАнгл"));
		// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Конец: 08.11.2024
		
		РегионОтправленияКС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыКоносамента.СтанцияОтправления,"Родитель");
		РегионНазначенияКС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыКоносамента.СтанцияНазначения,"Родитель");
		
		ЗаменаСоответствие.Вставить("##Регион_ОтправленияКС", РегионОтправленияКС);
		ЗаменаСоответствие.Вставить("##Регион_НазначенияКС", РегионНазначенияКС);
		ЗаменаСоответствие.Вставить("##Регион_ОтправленияКСENG", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РегионОтправленияКС, "НаименованиеАнгл"));
		ЗаменаСоответствие.Вставить("##Регион_НазначенияКСENG", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РегионНазначенияКС, "НаименованиеАнгл"));
	Иначе
		// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Начало: 08.11.2024
		// Было:
		//ЗаменаСоответствие.Вставить("##Пункт_ОтправленияКСENG", "");
		//ЗаменаСоответствие.Вставить("##Пункт_НазначенияКСENG", ""); 
		//Стало:
		ЗаменаСоответствие.Вставить("##ПортОтправленияКСENG", "");
		ЗаменаСоответствие.Вставить("##ПортНазначенияКСENG", "");
		ЗаменаСоответствие.Вставить("##МорскойТерминалОтправленияКСENG", "");
		ЗаменаСоответствие.Вставить("##МорскойТерминалНазначенияКСENG", "");
		// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Конец: 08.11.2024
		ЗаменаСоответствие.Вставить("##Регион_ОтправленияКС", "");
		ЗаменаСоответствие.Вставить("##Регион_НазначенияКС", "");
		ЗаменаСоответствие.Вставить("##Регион_ОтправленияКСENG", "");
		ЗаменаСоответствие.Вставить("##Регион_НазначенияКСENG", "");
	КонецЕсли; 
	
	//Евросиб - АСуслов 27.04.2021 13:20:46 #
	//(
	ЗаменаСоответствие["##ПогранПереходОтправление"] = Сделка.ПогранпереходИзСтраныОтправления.Наименование;
	ЗаменаСоответствие["##ПогранПереходПрибытие"] = Сделка.ПогранпереходВСтрануНазначения.Наименование;
	ЗаменаСоответствие["##ПогранПереходОтправлениеENG"] = Сделка.ПогранпереходИзСтраныОтправления.НаименованиеАнгл;
	ЗаменаСоответствие["##ПогранПереходПрибытиеENG"] = Сделка.ПогранпереходВСтрануНазначения.НаименованиеАнгл;
	
	ЗаменаСоответствие["##НомерРеестраКлиента"] = Выборка.РеестрКлиента;
	
	СтруктураДанныхПоЗаявке = ПолучитьДанныеПоЗаявке(Выборка, Сделка);
	
	ЗаменаСоответствие["##НомерАвтоВывоза"] = СтруктураДанныхПоЗаявке.ГосНомерСписок;
	ЗаменаСоответствие["##ДатаПодачиАвто"] = Формат(СтруктураДанныхПоЗаявке.ДатаПодачиАвтоПодПогрузку,"ДФ=dd.MM.yyyy");
	
	ЗаменаСоответствие["##РегионОтправленияСуша"] 	= СтруктураДанныхПоЗаявке.РегионОтравленияСуша;
	ЗаменаСоответствие["##РегионНазначенияСуша"] = СтруктураДанныхПоЗаявке.РегионНазначенияСуша;
	
	ЗаменаСоответствие["##АдресДоставкиГруза"] 	= СтруктураДанныхПоЗаявке.АдресВыгрузки;
	ЗаменаСоответствие["##АдресЗабораГруза"] = СтруктураДанныхПоЗаявке.АдресПогрузки;
                             
    // Евросиб Фролов (11.03.2022 Task №44976
	ЗаменаСоответствие.Вставить("##КоносаментыСоставаПоезда", СтруктураДанныхПоЗаявке.Коносаменты);	
	// Евросиб Фролов)                             

	//)
	//Евросиб - АСуслов 27.04.2021 13:20:47 #
	
	//Евросиб Каблов 25.08.2023 (
	ТекстыСодержанияУслуг = ПараметрыФФД.ФормированиеФинДокументовСсылка.ТекстыСодержанияУслуг;
	НайденнаяСтрока = ТекстыСодержанияУслуг.Найти(Выборка.Услуга, "Услуга");
	Если НайденнаяСтрока <> Неопределено Тогда
		ШаблонСодержания = НайденнаяСтрока.ТекстСодержанияУслуги;
	//Евросиб Каблов 25.08.2023 )
	ИначеЕсли Выборка.Услуга = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("УслугаФрахтаДляКалькуляции") Тогда
		ШаблонСодержания = ПараметрыФФД.ТекстРеализацииИИСФФрахт;
	Иначе
		ШаблонСодержания = ПараметрыФФД.ТекстРеализацииИИСФ;
	КонецЕсли; 
	Для каждого Замена Из ЗаменаСоответствие Цикл
		ШаблонСодержания = СтрЗаменить(ШаблонСодержания, Замена.Ключ, Замена.Значение);	
	КонецЦикла;
		
	Возврат ШаблонСодержания;
	
КонецФункции 

Функция ПолучитьДанныеПоЗаявке(Выборка, Сделка)
	КТКСписок = Сделка.ДоходыКТК.Найти(Выборка.ГУИД,"ГУИД");	
	Если КТКСписок <> Неопределено Тогда
		// для набора контейнеров нужно получить список Гос номеров
		Запрос = Новый Запрос;
		Запрос.Текст =		
		"ВЫБРАТЬ
		|	ЗаявкаСоставУслуги.НомерАвто КАК НомерАвто,
		// ДИТ Поморцева Т.П. Задача 37404(36099) 01.09.2021.
		//|	ЗаявкаСоставУслуги.ДатаВзятия КАК ДатаВзятия,
		|	ЗаявкаСоставУслуги.АдресПогрузки КАК АдресПогрузки,
		|	ЗаявкаСоставУслуги.АдресВыгрузки КАК АдресВыгрузки,
		|	ЗаявкаСоставУслуги.ПунктОтправления.Наименование КАК ПунктОтправленияСуша,
		|	ЗаявкаСоставУслуги.ПунктНазначения.Наименование КАК ПунктНазначенияСуша,
		|	ЗаявкаСоставУслуги.РеестрКлиента КАК РеестрКлиента,
		|	ЗаявкаСоставУслуги.ДатаПодачиАвтоПодПогрузку КАК ДатаПодачиАвтоПодПогрузку,
		// Евросиб Фролов (11.03.2022 Task №44976 
		|	ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.Коносамент.НомерТранспортногоДокумента, """") КАК Коносамент
		// Евросиб Фролов)
		|ИЗ
		|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		// Евросиб Фролов (11.03.2022 Task №44976
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
		|		ПО ЗаявкаСоставУслуги.ГУИДСтроки = СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки
		|			И ЗаявкаСоставУслуги.Ссылка = СделкаСвязьУчетныхЕдиниц.Заявка
		|			И СделкаСвязьУчетныхЕдиниц.Ссылка = &Сделка
		// Евросиб Фролов)
		|ГДЕ
		|	ЗаявкаСоставУслуги.Ссылка В(&Ссылка)
		|	И &НомерКТК ПОДОБНО ""%"" + ЗаявкаСоставУслуги.НомерКТК.Наименование + ""%""";
		
		//Запрос.УстановитьПараметр("Ссылка",Выборка.Заявка);
		Запрос.УстановитьПараметр("Ссылка",Сделка.Заявки.ВыгрузитьКолонку("Заявка"));
		Запрос.УстановитьПараметр("НомерКТК",КТКСписок.КТК);
		// Евросиб Фролов (11.03.2022 Task №44976
		Запрос.УстановитьПараметр("Сделка", Сделка);
		// Евросиб Фролов)
		НайденныеСтроки = Запрос.Выполнить().Выгрузить();
		ГосНомерСписок = "";
		ДатаПогрузки = "";
		ДатаПодачиАвтоПодПогрузку = Дата(1,1,1);
		Маршрут = "";
		МаршрутАвто = "";
		РеестрКлиента = "";
		РегионОтправления = Новый Массив;
		РегионНазначения = Новый Массив;
		мАдресПогрузки = Новый Массив;
		мАдресВыгрузки = Новый Массив;
		// Евросиб Фролов (11.03.2022 Task №44976
		МассивКоносаментов = Новый Массив;
		// Евросиб Фролов)
		Для Каждого СтрН Из НайденныеСтроки Цикл
			ГосНомерСписок = ГосНомерСписок + " " + СокрЛП(СтрН.НомерАвто);
			// ДИТ Поморцева Т.П. Задача 37404(36099) 01.09.2021.
			//ДатаПогрузки = ДатаПогрузки + " " + Формат(СтрН.ДатаВзятия,"ДФ=dd.MM.yyyy HH:mm");
			РеестрКлиента = РеестрКлиента + " " + СокрЛП(СтрН.РеестрКлиента);
			РегионОтправления.Добавить(СтрН.ПунктОтправленияСуша);
			РегионНазначения.Добавить(СтрН.ПунктНазначенияСуша);
			ДатаПодачиАвтоПодПогрузку = Макс(ДатаПодачиАвтоПодПогрузку, СтрН.ДатаПодачиАвтоПодПогрузку);
			мАдресПогрузки.Добавить(СтрН.АдресПогрузки);
			мАдресВыгрузки.Добавить(СтрН.АдресВыгрузки);
			// Евросиб Фролов (11.03.2022 Task №44976
			Если ЗначениеЗаполнено(СтрН.Коносамент) И МассивКоносаментов.Найти(СтрН.Коносамент) = Неопределено Тогда
				МассивКоносаментов.Добавить(СтрН.Коносамент);
			КонецЕсли;
			// Евросиб Фролов)
		КонецЦикла;
		РегионОтправления = Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(РегионОтправления);
		РегионНазначения = Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(РегионНазначения);
		мАдресПогрузки = Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(мАдресПогрузки);
		мАдресВыгрузки = Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(мАдресВыгрузки);
		ГосНомерСписок = СтрЗаменить(СокрЛП(ГосНомерСписок)," ",", ");
		// ДИТ Поморцева Т.П. Задача 37404(36099) 01.09.2021.
		//ДатаПогрузки = СтрЗаменить(СокрЛП(ДатаПогрузки)," ",", ");
		РегионОтравленияСуша = СтроковыеФункцииКлиентСервер.СтрокаИзМассиваПодстрок(РегионОтправления, ";");
		РегионНазначенияСуша = СтроковыеФункцииКлиентСервер.СтрокаИзМассиваПодстрок(РегионНазначения, ";");
		//++ Зубов Ticket#0248196 09.11.2021
		//АдресПогрузки = СтроковыеФункцииКлиентСервер.СтрокаИзМассиваПодстрок(РегионОтправления, ";");
		//АдресВыгрузки = СтроковыеФункцииКлиентСервер.СтрокаИзМассиваПодстрок(РегионНазначения, ";");
		АдресПогрузки = СтроковыеФункцииКлиентСервер.СтрокаИзМассиваПодстрок(мАдресПогрузки, ";");
		АдресВыгрузки = СтроковыеФункцииКлиентСервер.СтрокаИзМассиваПодстрок(мАдресВыгрузки, ";");
		//-- Зубов Ticket#0248196 09.11.2021
		
		// Евросиб Фролов (11.03.2022 Task №44976
		Коносаменты = СтрСоединить(МассивКоносаментов, ";");
		// Евросиб Фролов)
		
	КонецЕсли;
	
	// Евросиб Фролов (11.03.2022 Task №44976: добавил коносаменты)
	Возврат Новый Структура("ГосНомерСписок, ДатаПодачиАвтоПодПогрузку, РегионОтравленияСуша, РегионНазначенияСуша, АдресПогрузки, АдресВыгрузки, Коносаменты",
							ГосНомерСписок, ДатаПогрузки, РегионОтравленияСуша, РегионНазначенияСуша, АдресПогрузки, АдресВыгрузки, Коносаменты);
КонецФункции

//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++                 
//функция возвращает одну из табличных частей элемента справочника "ФормированиеФинДокументов", исходя из принятых параметров 
Функция ПолучитьТЗнастроекФормированияОписанияУслуг(Знач ТипДокумента, ПараметрыФФД)
	ТЗ = Новый ТаблицаЗначений; 
	Если ПараметрыФФД = Неопределено Тогда 
		Возврат ТЗ;
	КонецЕсли;
	
	ФормированиеФинДокументовСсылка = ПараметрыФФД.ФормированиеФинДокументовСсылка;
	Если ФормированиеФинДокументовСсылка = Справочники.ФормированиеФинДокументов.ПустаяСсылка() Тогда
		Возврат ТЗ;
	КонецЕсли; 
	ФормированиеФинДокументовОбъект = ФормированиеФинДокументовСсылка.ПолучитьОбъект();
	ПараметрыОтбора = Новый Структура("Использование",Истина);
	Если ТипДокумента = "Счет" Тогда
		ТЗ = ФормированиеФинДокументовОбъект.ОписаниеУслугиСчет.Выгрузить(ПараметрыОтбора);
	ИначеЕсли ТипДокумента = "Акт" Тогда
		ТЗ = ФормированиеФинДокументовОбъект.ОписаниеУслугиАкт.Выгрузить(ПараметрыОтбора);
	Иначе
		ТЗ = ФормированиеФинДокументовОбъект.ОписаниеУслугиСчФ.Выгрузить(ПараметрыОтбора);
	КонецЕсли;                                                                            
	Возврат ТЗ;
КонецФункции 
//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --

// Евросиб Фролов)
Процедура ЗаполнитьРасходыПоСделке_СтарыйАлгоритм(Сделка) Экспорт
	//Евросиб - АСуслов 26.12.2022 17:45:40 #58550
	//(
	Если Сделка.НеЗаполнятьРасходы = Ложь Тогда
		//)
		//Евросиб - АСуслов 26.12.2022 17:45:42 #58550
		//ЗаполнитьГУИДыСУЕ    
		Расходы = Сделка.Расходы;
		СвязьУчетныхЕдиниц = Сделка.СвязьУчетныхЕдиниц;
		СвязьДоходовИРасходов = Сделка.СвязьДоходовИРасходов;
		ДоходыВагоны = Сделка.ДоходыВагоны;
		ДоходыКТК = Сделка.ДоходыКТК;
		ДоходыТД = Сделка.ДоходыТД;
		
		СтрокиРасходовДопУслуг = Расходы.НайтиСтроки(Новый Структура("ИсточникПоявленияСтрокиЭкономики_Старая", Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта));
		Для каждого СтрокаРасходаДопУслуг Из СтрокиРасходовДопУслуг Цикл
			СтрокаРасходаДопУслуг.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта;
		КонецЦикла;   
		СтрокиРасходовДопУслуг = Расходы.НайтиСтроки(Новый Структура("ИсточникПоявленияСтрокиЭкономики_Старая", Перечисления.ИсточникПоявленияСтрокиЭкономики.ПроизвольнаяУслугаВручную));
		Для каждого СтрокаРасходаДопУслуг Из СтрокиРасходовДопУслуг Цикл
			СтрокаРасходаДопУслуг.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ПроизвольнаяУслугаВручную;
		КонецЦикла;   
		
		Для каждого СтрокаСУЕ Из СвязьУчетныхЕдиниц Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаСУЕ.ГУИД) Тогда
				СтрокаСУЕ.ГУИД = Новый УникальныйИдентификатор;
			КонецЕсли; 
		КонецЦикла; 
		//Евросиб - АСуслов 27.05.2021 11:55:15 #
		//(
		//Возникла проблема, что услуги отключаются, а обратно не включаются
		//Чтобы не усложнять запрос просто включим все услуги обратно
		Для каждого СтрокаРасход Из Расходы Цикл
			//Евросиб Каблов 21.11.2022 ( 52045
			//Если НЕ СтрокаРасход.СтрокаРасходовВПеренесеннойСделке = "" Тогда
			Если ЗначениеЗаполнено(СтрокаРасход.ПеренесеннаяСделка)
				//Евросиб - АСуслов 09.12.2022 16:02:18 #62448
				//(
				ИЛИ ЗначениеЗаполнено(СтрокаРасход.ПеренесеннаяСделкаИсточник)
				//)
				//Евросиб - АСуслов 09.12.2022 16:02:21 #62448
				ИЛИ СтрокаРасход.ПричинаОтключенияСтроки = Перечисления.ПричиныОтключенияСтрокиРасходовСделки.ТехническиеРаботы
				Тогда
				//Евросиб Каблов 21.11.2022 )
				Продолжить;
			КонецЕсли; 
			СтрокаРасход.УслугаОтключена = Ложь;
		КонецЦикла; 
		//)
		//Евросиб - АСуслов 27.05.2021 11:55:16 #
		
		#Область ЗапросДляРасходов
		//////////////// ЗАПРОС ДЛЯ РАСХОДОВ ////////////////
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(&Ссылка КАК Документ.Сделка) КАК Сделка,
		|	ВЫРАЗИТЬ(ВыгрТЧ.Калькуляция КАК Документ.Калькуляция) КАК Калькуляция,
		|	ВЫРАЗИТЬ(ВыгрТЧ.Контейнер КАК Справочник.ТЕ) КАК СписокКТК,
		|	ВЫРАЗИТЬ(ВыгрТЧ.Контейнер КАК Справочник.ТЕ) КАК Контейнер,
		|	ВЫРАЗИТЬ(ВыгрТЧ.Вагон КАК Справочник.ТС) КАК СписокВагонов,
		|	1 КАК Количество,
		|	ВыгрТЧ.РазмерКТК КАК РазмерКТК,
		|	ВЫБОР
		//|		КОГДА НЕ ВыгрТЧ.НомерВагоннойЖДН = """"
		|		КОГДА НЕ ВыгрТЧ.ВагоннаяЖДН = Значение(Документ.ТранспортныйДокумент.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьПодсыл,
		|	ВыгрТЧ.НомерЖДН КАК СписокТД,
		|	ВыгрТЧ.Груз КАК Груз,
		|	ВыгрТЧ.ПортОтправления КАК ПортОтправления,
		|	ВыгрТЧ.ПортНазначения КАК ПортНазначения,
		// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
		//ок(
		//|	ВыгрТЧ.СобственностьПеревозимогоКТК КАК СобственностьПеревозимогоКТК,
		//ок)
		|	ВыгрТЧ.УдалитьСобственностьПеревозимогоКТК КАК УдалитьСобственностьПеревозимогоКТК,
		|	ВыгрТЧ.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
		// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
		|	ВыгрТЧ.Удалена КАК Удалена,
		|	ВыгрТЧ.НеАктивна КАК НеАктивна,
		//Евросиб - АСуслов 12.07.2022 15:29:08 #
		//(
		|	ВыгрТЧ.ОтключитьРасходы КАК ОтключитьРасходы,
		//)
		//Евросиб - АСуслов 12.07.2022 15:29:08 #
		|	ВЫРАЗИТЬ(ВыгрТЧ.Коносамент КАК Документ.ТранспортныйДокумент) КАК Коносамент,
		|	ВыгрТЧ.ГУИД КАК СтрокаСвязьУчетныхЕдиниц,
		|	ВыгрТЧ.ГУИД КАК ГУИД,
		|	ВыгрТЧ.ЖДН КАК ЖДН,
		|	ВыгрТЧ.ГруженаяЖДННеНайдена КАК ГруженаяЖДННеНайдена,
		|	ВЫРАЗИТЬ(ВыгрТЧ.НакладнаяПослеГруженогоПлеча КАК Документ.ТранспортныйДокумент) КАК НакладнаяПослеГруженогоПлеча,
		|	ВЫРАЗИТЬ(ВыгрТЧ.НакладнаяПослеГружКТК КАК Документ.ТранспортныйДокумент) КАК НакладнаяПослеГружКТК,
		|	ВЫРАЗИТЬ(ВыгрТЧ.ЖДНПерестановкиДоГружКТК КАК Документ.ТранспортныйДокумент) КАК НакладнаяПерестановкиДоГружКТК,
		|	ВЫРАЗИТЬ(ВыгрТЧ.ЖДНПерестановкиДоПорКТК КАК Документ.ТранспортныйДокумент) КАК НакладнаяПерестановкиДоПорКТК,
		|	ВЫРАЗИТЬ(ВыгрТЧ.ВагоннаяЖДН КАК Документ.ТранспортныйДокумент) КАК НакладнаяВагоннаяЖДН,
		|	ВЫРАЗИТЬ(ВыгрТЧ.ПорожняяЖДНКТК КАК Документ.ТранспортныйДокумент) КАК НакладнаяПорожняяЖДНКТК,
		|	ВЫРАЗИТЬ(ВыгрТЧ.ПорожняяВагоннаяЖДН КАК Документ.ТранспортныйДокумент) КАК НакладнаяПорожняяВагоннаяЖДН
		|ПОМЕСТИТЬ ВТ_ВыгрТЧ
		|ИЗ
		|	&ВыгрТЧ КАК ВыгрТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
		|	СделкаРасходы.Услуга КАК Услуга,
		|	СделкаРасходы.Калькуляция КАК Калькуляция,
		|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики_Старая КАК ИсточникПоявленияСтрокиЭкономики_Старая,
		|	ВЫРАЗИТЬ(СделкаРасходы.УчДокумент КАК Документ.ПоступлениеТоваровУслуг) КАК УчДокумент,
		|	СделкаРасходы.ГУИД КАК ГУИД,
		|	СделкаРасходы.СтрокаРасходовВПеренесеннойСделке КАК СтрокаРасходовВПеренесеннойСделке,
		//Евросиб - АСуслов 09.12.2022 16:48:36 #62448
		//(
		|	СделкаРасходы.СтрокаРасходовВСделкеИсточник КАК СтрокаРасходовВСделкеИсточник,
		//)
		//Евросиб - АСуслов 09.12.2022 16:48:38 #62448
		|	СделкаРасходы.ПунктОтправления КАК ПунктОтправления,
		|	СделкаРасходы.ПунктНазначения КАК ПунктНазначения,
		|	СделкаРасходы.Поставщик КАК Поставщик,
		|	СделкаРасходы.Договор КАК Договор,
		|	СделкаРасходы.Себестоимость КАК Себестоимость,
		|	СделкаРасходы.СтавкаНДС КАК СтавкаНДС,
		|	СделкаРасходы.Валюта КАК Валюта,
		|	СделкаРасходы.Перевыставляемая КАК Перевыставляемая,
		|	СделкаРасходы.СтрокаКалькуляции КАК СтрокаКалькуляции
		|ПОМЕСТИТЬ ВТ_Расходы
		|ИЗ
		|	&ТЧРасходы КАК СделкаРасходы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЧСвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
		|	ТЧСвязьДоходовИРасходов.Доходы КАК Доходы
		|ПОМЕСТИТЬ ВТ_ТЧСвязьДоходовИРасходов
		|ИЗ
		|	&ТЧСвязьДоходовИРасходов КАК ТЧСвязьДоходовИРасходов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыгрТЧ.Сделка КАК Сделка,
		|	ВыгрТЧ.Калькуляция КАК Калькуляция,
		|	ВЫРАЗИТЬ(ВыгрТЧ.Контейнер КАК Справочник.ТЕ) КАК СписокКТК,
		|	ВЫРАЗИТЬ(ВыгрТЧ.Контейнер КАК Справочник.ТЕ) КАК Контейнер,
		|	ВыгрТЧ.СписокВагонов КАК СписокВагонов,
		|	1 КАК Количество,
		|	ВыгрТЧ.РазмерКТК КАК РазмерКТК,
		|	ВыгрТЧ.ЕстьПодсыл КАК ЕстьПодсыл,
		|	ВыгрТЧ.СписокТД КАК СписокТД,
		|	ВыгрТЧ.Груз КАК Груз,
		|	ВыгрТЧ.ПортОтправления КАК ПортОтправления,
		|	ВыгрТЧ.ПортНазначения КАК ПортНазначения,
		// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
		//ок(
		//|	ВыгрТЧ.СобственностьПеревозимогоКТК КАК СобственностьПеревозимогоКТК,
		//ок)
		|	ВыгрТЧ.УдалитьСобственностьПеревозимогоКТК КАК УдалитьСобственностьПеревозимогоКТК,
		|	ВыгрТЧ.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
		// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
		|	ВыгрТЧ.Удалена КАК Удалена,
		|	ВыгрТЧ.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
		|	ПризнакСобственностиВагонаСрезПоследних.ПризнакСобственности КАК ПризнакСобственности,
		|	ВыгрТЧ.Коносамент КАК Коносамент,
		|	ВыгрТЧ.ГУИД КАК ГУИД,
		|	ВыгрТЧ.ЖДН КАК ЖДН,
		|	ВыгрТЧ.НакладнаяВагоннаяЖДН КАК НакладнаяВагоннаяЖДН,
		|	ВыгрТЧ.НакладнаяПорожняяЖДНКТК КАК НакладнаяПорожняяЖДНКТК,
		|	ВыгрТЧ.НакладнаяПорожняяВагоннаяЖДН КАК НакладнаяПорожняяВагоннаяЖДН,
		|	ВыгрТЧ.ГруженаяЖДННеНайдена КАК ГруженаяЖДННеНайдена,
		|	ВыгрТЧ.НакладнаяПослеГруженогоПлеча КАК НакладнаяПослеГруженогоПлеча,
		|	ВыгрТЧ.НакладнаяПослеГружКТК КАК НакладнаяПослеГружКТК1,
		|	ВыгрТЧ.НакладнаяПерестановкиДоГружКТК КАК НакладнаяПерестановкиДоГружКТК,
		|	ВыгрТЧ.НакладнаяПерестановкиДоПорКТК КАК НакладнаяПерестановкиДоПорКТК
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	ВТ_ВыгрТЧ КАК ВыгрТЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПризнакСобственностиВагона.СрезПоследних КАК ПризнакСобственностиВагонаСрезПоследних
		|		ПО ВыгрТЧ.СписокВагонов = ПризнакСобственностиВагонаСрезПоследних.Вагон
		|ГДЕ
		|	НЕ ВыгрТЧ.Удалена
		|	И НЕ ВыгрТЧ.НеАктивна
		//Евросиб - АСуслов 12.07.2022 15:28:26 #
		//(
		|  	И НЕ ВыгрТЧ.ОтключитьРасходы
		//)
		//Евросиб - АСуслов 12.07.2022 15:28:26 #
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА ВТ.Контейнер.ТипТЕ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
		|			ТОГДА КалькуляцияНФ_ВыбранныеСтавки.Фрахт20
		|		ИНАЧЕ КалькуляцияНФ_ВыбранныеСтавки.Фрахт40
		|	КОНЕЦ КАК Ставка,
		|	ВЫБОР
		|		КОГДА ВТ.Контейнер.ТипТЕ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
		|			ТОГДА КалькуляцияНФ_ВыбранныеСтавки.Вознаграждение20
		|		ИНАЧЕ КалькуляцияНФ_ВыбранныеСтавки.Вознаграждение40
		|	КОНЕЦ КАК Вознаграждение,
		|	ВЫБОР
		|		КОГДА ВТ.Контейнер.ТипТЕ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
		|			ТОГДА КалькуляцияНФ_ВыбранныеСтавки.Итого20
		|		ИНАЧЕ КалькуляцияНФ_ВыбранныеСтавки.Итого40
		|	КОНЕЦ КАК Итого,
		|	КалькуляцияНФ_ВыбранныеСтавки.Ссылка КАК КалькуляцияФрахта,
		|	КалькуляцияНФ_ВыбранныеСтавки.Контрагент.Контрагент КАК ПоставщикФрахт,
		|	КалькуляцияНФ_ВыбранныеСтавки.Валюта КАК Валюта,
		|	КалькуляцияНФ_ВыбранныеСтавки.Порт КАК Порт,
		|	ВТ.Удалена КАК Удалена,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС) КАК СтавкаНДС,
		|	ВТ.Коносамент.СтанцияОтправления КАК КоносаментСтанцияОтправления,
		|	ВТ.Коносамент.СтанцияНазначения КАК КоносаментСтанцияНазначения,
		|	ВТ.Коносамент.НомерТранспортногоДокумента КАК КоносаментНомерТранспортногоДокумента,
		|	ВТ.Коносамент КАК Коносамент,
		|	ВТ.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
		|	КалькуляцияНФ_ВыбранныеСтавки.ИдентификаторСтроки КАК ИдентификаторСтроки
		|ПОМЕСТИТЬ ФрахтПоКалькуляции
		|ИЗ
		|	ВТ КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция.НФ_ВыбранныеСтавки КАК КалькуляцияНФ_ВыбранныеСтавки
		|		ПО ВТ.Калькуляция = КалькуляцияНФ_ВыбранныеСтавки.Ссылка
		|			И (ВЫБОР
		|				КОГДА ВТ.Калькуляция.ФрахтИмпорт
		|					ТОГДА ВТ.Коносамент.СтанцияОтправления = КалькуляцияНФ_ВыбранныеСтавки.Порт
		|				ИНАЧЕ ВТ.ПортНазначения = КалькуляцияНФ_ВыбранныеСтавки.Порт
		|						ИЛИ ВТ.Коносамент.СтанцияНазначения = КалькуляцияНФ_ВыбранныеСтавки.Порт
		|			КОНЕЦ)
		|			И (ВЫБОР
		// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
		//ок(
		//|				КОГДА ВТ.СобственностьПеревозимогоКТК = ЗНАЧЕНИЕ(Перечисление.СобственностьПеревозимогоКонтейнера.SOC)
		//ок)
		|				КОГДА ВТ.ПринадлежностьТЕ = ЗНАЧЕНИЕ(Перечисление.ПринадлежностьТЕ.КТКлиента)
		// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
		|					ТОГДА ""SOC""
		|				ИНАЧЕ ""COC""
		|			КОНЕЦ = КалькуляцияНФ_ВыбранныеСтавки.SOCCOC)
		|ГДЕ
		|	(КалькуляцияНФ_ВыбранныеСтавки.Выбрано20
		|			ИЛИ КалькуляцияНФ_ВыбранныеСтавки.Выбрано40)
		|	И НЕ ВТ.Коносамент = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
		|	СделкаРасходы.Услуга КАК Услуга,
		|	СделкаРасходы.Калькуляция КАК Калькуляция,
		|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики_Старая КАК ИсточникПоявленияСтрокиЭкономики_Старая,
		|	ВЫРАЗИТЬ(СделкаРасходы.УчДокумент КАК Документ.ПоступлениеТоваровУслуг) КАК УчДокумент,
		|	СделкаРасходы.ГУИД КАК ГУИД,
		|	СделкаРасходы.СтрокаРасходовВПеренесеннойСделке КАК СтрокаРасходовВПеренесеннойСделке,
		//Евросиб - АСуслов 09.12.2022 16:48:50 #62448
		//(
		|	СделкаРасходы.СтрокаРасходовВСделкеИсточник КАК СтрокаРасходовВСделкеИсточник,
		//)
		//Евросиб - АСуслов 09.12.2022 16:48:51 #62448
		|	СделкаРасходы.ПунктОтправления КАК ПунктОтправления,
		|	СделкаРасходы.ПунктНазначения КАК ПунктНазначения,
		|	СделкаРасходы.Поставщик КАК Поставщик,
		|	СделкаРасходы.Договор КАК Договор,
		|	СделкаРасходы.Себестоимость КАК Себестоимость,
		|	СделкаРасходы.СтавкаНДС КАК СтавкаНДС,
		|	СделкаРасходы.Валюта КАК Валюта,
		|	СделкаРасходы.Перевыставляемая КАК Перевыставляемая,
		|	ВТ.СписокКТК КАК СписокКТК,
		|	ВТ.СписокВагонов КАК СписокВагонов,
		|	СделкаРасходы.СтрокаКалькуляции КАК СтрокаКалькуляции,
		|	ВЫБОР
		|		КОГДА ВТ.ГУИД ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СтрокаСУЕОтсутствует
		|ПОМЕСТИТЬ ВТ_РасходыГУИДыСУЕ
		|ИЗ
		|	ВТ_Расходы КАК СделкаРасходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
		|		ПО СделкаРасходы.СтрокаСвязьУчетныхЕдиниц = ВТ.ГУИД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	э_Накладная.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ОтборНакладных
		|ИЗ
		|	Документ.э_Накладная КАК э_Накладная
		|ГДЕ
		|	э_Накладная.Ссылка В
		|			(ВЫБРАТЬ
		|				т.НакладнаяЭТРАН
		|			ИЗ
		|				документ.транспортныйдокумент КАК т
		|			ГДЕ
		|				т.Ссылка В (&СписокТранспортныхДокументов))
		|	И э_Накладная.ПометкаУдаления = ЛОЖЬ
		|	И э_Накладная.ТекущееСостояниеНакладнойДействующийСтатус
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	э_Накладная.Ссылка КАК Ссылка,
		|	СУММА(ВЫБОР
		|			КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаВРублях > 0
		|				ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаВРублях
		|			КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаВРублях > 0
		|				ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаВРублях
		|			ИНАЧЕ э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СуммаВРублях
		|		КОНЕЦ) КАК СуммаВРублях,
		|	э_Накладная.НакладнаяНомер КАК НакладнаяНомер,
		|	СУММА(ВЫБОР
		|			КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаВРублях > 0
		|				ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаНалога
		|			КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаВРублях > 0
		|				ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаНалога
		|			ИНАЧЕ э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СуммаНалога
		|		КОНЕЦ) КАК СуммаНалога,
		|	ВЫБОР
		|		КОГДА ВЫБОР
		|				КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаВРублях > 0
		|					ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СтавкаНалога
		|				КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаВРублях > 0
		|					ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СтавкаНалога
		|				ИНАЧЕ э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СтавкаНалога
		|			КОНЕЦ = 20
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
		|		КОГДА ВЫБОР
		|				КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаВРублях > 0
		|					ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СтавкаНалога
		|				КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаВРублях > 0
		|					ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СтавкаНалога
		|				ИНАЧЕ э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СтавкаНалога
		|			КОНЕЦ = 0
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
		//Евросиб СубботинВ #125845 09.12.2025 Начало 
		|		КОГДА ВЫБОР
		|				КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаВРублях > 0
		|					ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СтавкаНалога
		|				КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаВРублях > 0
		|					ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СтавкаНалога
		|				ИНАЧЕ э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СтавкаНалога
		|			КОНЕЦ = 22
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
		//Евросиб СубботинВ #125845 09.12.2025 Конец
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
		|	КОНЕЦ КАК СтавкаНДС,
		|	ЛокацииОтправления.Ссылка КАК СтанцияОтправления,
		|	ЛокацииНазначения.Ссылка КАК СтанцияНазначения,
		|	э_Накладная.ТекущееСостояниеНакладнойДействующийСтатус КАК ТекущееСостояниеНакладнойДействующийСтатус,
		|	ВЫБОР
		|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаВРублях > 0
		|			ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.НомерВагона
		|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаВРублях > 0
		|			ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.НомерВагона
		|		ИНАЧЕ э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.НомерВагона
		|	КОНЕЦ КАК НомерВагона,
		|	ВЫБОР
		|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаВРублях > 0
		|			ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.НомерКонтейнера
		|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаВРублях > 0
		|			ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.НомерКонтейнера
		|		ИНАЧЕ э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.НомерКонтейнера
		|	КОНЕЦ КАК НомерКонтейнера,
		|	э_НакладнаяКонтейнеры.НомерКонтейнера КАК НомерКонтейнераИзНакладной,
		|	ТС.Ссылка КАК НомерВагонаИзНакладной
		|ПОМЕСТИТЬ ВТ_Накладные
		|ИЗ
		|	Документ.э_Накладная КАК э_Накладная
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОтборНакладных КАК ВТ_ОтборНакладных
		|		ПО (ВТ_ОтборНакладных.Ссылка = э_Накладная.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.ПровозныеПлатежиИСборыПоОтправлению КАК э_НакладнаяПровозныеПлатежиИСборыПоОтправлению
		|		ПО э_Накладная.Ссылка = э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.Ссылка
		|			И (э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаВРублях > 0)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.ПровозныеПлатежиИСборыПоПрибытию КАК э_НакладнаяПровозныеПлатежиИСборыПоПрибытию
		|		ПО э_Накладная.Ссылка = э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.Ссылка
		|			И (э_Накладная.ПровозныеПлатежиИСборыПоПрибытию.СуммаВРублях > 0)
		|			И (э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.Ссылка ЕСТЬ NULL)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.ПровозныеПлатежиИСборыПоВходу КАК э_НакладнаяПровозныеПлатежиИСборыПоВходу
		|		ПО э_Накладная.Ссылка = э_НакладнаяПровозныеПлатежиИСборыПоВходу.Ссылка
		|			И (э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаВРублях > 0)
		|			И (э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.Ссылка ЕСТЬ NULL)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Локации КАК ЛокацииОтправления
		|		ПО (ЛокацииОтправления.КодЖДСтанции = э_Накладная.СтанцияОтправленияКод)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Локации КАК ЛокацииНазначения
		|		ПО (ЛокацииНазначения.КодЖДСтанции = э_Накладная.СтанцияНазначенияКод)
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			э_Накладная.НакладнаяНомер КАК НакладнаяНомер,
		|			э_Накладная.ИсточникНакладной КАК ИсточникНакладной
		|		ИЗ
		|			Документ.э_Накладная КАК э_Накладная
		|		ГДЕ
		|			э_Накладная.ИсточникНакладной = ЗНАЧЕНИЕ(Перечисление.ИсточникЖДН.ЭТРАН)
		|			И э_Накладная.ПометкаУдаления = ЛОЖЬ
		|			И э_Накладная.ТекущееСостояниеНакладнойДействующийСтатус) КАК ВложенныйЗапрос
		|		ПО э_Накладная.НакладнаяНомер = ВложенныйЗапрос.НакладнаяНомер
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТС КАК ТС
		|				ПО э_НакладнаяВагоны.НомерВагона = ТС.Наименование
		|					И (НЕ ТС.ПометкаУдаления)
		|			ПО э_НакладнаяКонтейнеры.Ссылка = э_НакладнаяВагоны.Ссылка
		|				И (э_НакладнаяКонтейнеры.НомерВагонаДляКонтейнерногоПоезда = э_НакладнаяВагоны.ПорядковыйНомерВагонаВОтправке
		|					ИЛИ э_НакладнаяКонтейнеры.НомерВагонаДляКонтейнерногоПоезда = 0)
		|		ПО э_Накладная.Ссылка = э_НакладнаяКонтейнеры.Ссылка
		|			И (ВЫБОР
		|				КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаВРублях > 0
		|					ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.НомерКонтейнера
		|				КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаВРублях > 0
		|					ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.НомерКонтейнера
		|				ИНАЧЕ э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.НомерКонтейнера
		|			КОНЕЦ = э_НакладнаяКонтейнеры.НомерКонтейнера)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаВРублях > 0
		|				ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаВРублях
		|			КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаВРублях > 0
		|				ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаВРублях
		|			ИНАЧЕ э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СуммаВРублях
		|		КОНЕЦ > 0
		|	И ВЫБОР
		|			КОГДА э_Накладная.ИсточникНакладной = ЗНАЧЕНИЕ(Перечисление.ИсточникЖДН.ГВЦ)
		|				ТОГДА ВложенныйЗапрос.НакладнаяНомер ЕСТЬ NULL
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	э_Накладная.Ссылка,
		|	э_Накладная.НакладнаяНомер,
		|	ЛокацииОтправления.Ссылка,
		|	ЛокацииНазначения.Ссылка,
		|	э_Накладная.ТекущееСостояниеНакладнойДействующийСтатус,
		|	ВЫБОР
		|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаВРублях > 0
		|			ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.НомерВагона
		|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаВРублях > 0
		|			ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.НомерВагона
		|		ИНАЧЕ э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.НомерВагона
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаВРублях > 0
		|			ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.НомерКонтейнера
		|		КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаВРублях > 0
		|			ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.НомерКонтейнера
		|		ИНАЧЕ э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.НомерКонтейнера
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВЫБОР
		|				КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаВРублях > 0
		|					ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СтавкаНалога
		|				КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаВРублях > 0
		|					ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СтавкаНалога
		|				ИНАЧЕ э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СтавкаНалога
		|			КОНЕЦ = 20
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
		|		КОГДА ВЫБОР
		|				КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаВРублях > 0
		|					ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СтавкаНалога
		|				КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаВРублях > 0
		|					ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СтавкаНалога
		|				ИНАЧЕ э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СтавкаНалога
		|			КОНЕЦ = 0
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
		//Евросиб СубботинВ #125845 09.12.2025 Начало 
		|		КОГДА ВЫБОР
		|				КОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СуммаВРублях > 0
		|					ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоВходу.СтавкаНалога
		|				КОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СуммаВРублях > 0
		|					ТОГДА э_НакладнаяПровозныеПлатежиИСборыПоОтправлению.СтавкаНалога
		|				ИНАЧЕ э_НакладнаяПровозныеПлатежиИСборыПоПрибытию.СтавкаНалога
		|			КОНЕЦ = 22
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
		//Евросиб СубботинВ #125845 09.12.2025 Конец
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
		|	КОНЕЦ,
		|	э_НакладнаяКонтейнеры.НомерКонтейнера,
		|	ТС.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Накладные.Ссылка КАК Ссылка,
		|	э_НакладнаяВагоны.НомерВагона КАК НомерВагона,
		|	э_НакладнаяВагоны.ПорядковыйНомерВагонаВОтправке КАК ПорядковыйНомерВагонаВОтправке
		|ПОМЕСТИТЬ ВТ_НакладныеВсеВагоны
		|ИЗ
		|	ВТ_Накладные КАК ВТ_Накладные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
		|		ПО ВТ_Накладные.Ссылка = э_НакладнаяВагоны.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_НакладныеВсеВагоны.Ссылка КАК Ссылка,
		|	ВТ_НакладныеВсеВагоны.НомерВагона КАК НомерВагона,
		|	ВТ_НакладныеВсеВагоны.ПорядковыйНомерВагонаВОтправке КАК ПорядковыйНомерВагонаВОтправке
		|ПОМЕСТИТЬ ВТ_НакладныеВагоны
		|ИЗ
		|	ВТ_НакладныеВсеВагоны КАК ВТ_НакладныеВсеВагоны
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НакладныеВсеВагоны КАК ВТ_НакладныеЗаполненныеВагоны
		|		ПО ВТ_НакладныеВсеВагоны.Ссылка = ВТ_НакладныеЗаполненныеВагоны.Ссылка
		|			И ВТ_НакладныеВсеВагоны.ПорядковыйНомерВагонаВОтправке = ВТ_НакладныеЗаполненныеВагоны.ПорядковыйНомерВагонаВОтправке
		|			И (ВТ_НакладныеВсеВагоны.НомерВагона = ""
		|																					И ВТ_НакладныеЗаполненныеВагоны.НомерВагона <> "")
		|ГДЕ
		|	ВТ_НакладныеЗаполненныеВагоны.НомерВагона ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Накладные.Ссылка КАК Ссылка,
		|	э_НакладнаяВагоны.НомерВагона КАК НомерВагона,
		|	э_НакладнаяКонтейнеры.НомерКонтейнера КАК НомерКонтейнера,
		|	ТЕ.Ссылка КАК КонтейнерСсылка,
		|	ТС.Ссылка КАК ВагонСсылка,
		|	ВТ_Накладные.СтанцияОтправления КАК ЛокацияОтправления,
		|	ВТ_Накладные.СтанцияНазначения КАК ЛокацияНазначения,
		|	ВТ_Накладные.СуммаВРублях КАК СуммаВРублях,
		|	ВТ_Накладные.СуммаНалога КАК СуммаНалога,
		|	ВТ_Накладные.СтавкаНДС КАК СтавкаНДС,
		|	ВТ_Накладные.НакладнаяНомер КАК НакладнаяНомер
		|ПОМЕСТИТЬ ВТ_НакладныеВагоныКТК
		|ИЗ
		|	ВТ_Накладные КАК ВТ_Накладные
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НакладныеВагоны КАК э_НакладнаяВагоны
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
		|				ПО э_НакладнаяКонтейнеры.НомерКонтейнера = ТЕ.Наименование
		|					И (НЕ ТЕ.ПометкаУдаления)
		|			ПО (э_НакладнаяВагоны.Ссылка = э_НакладнаяКонтейнеры.Ссылка
		|						И э_НакладнаяКонтейнеры.НомерВагонаДляКонтейнерногоПоезда = э_НакладнаяВагоны.ПорядковыйНомерВагонаВОтправке
		|					ИЛИ э_НакладнаяКонтейнеры.НомерВагонаДляКонтейнерногоПоезда = 0
		|						И э_НакладнаяКонтейнеры.Ссылка = э_НакладнаяВагоны.Ссылка)
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТС КАК ТС
		|			ПО э_НакладнаяВагоны.НомерВагона = ТС.Наименование
		|				И (НЕ ТС.ПометкаУдаления)
		|		ПО ВТ_Накладные.Ссылка = э_НакладнаяВагоны.Ссылка  
		//ДИТ, Беляев СЮ, Ticket#0276626, 28-06-2022, начало
		|		И (ВТ_Накладные.НомерКонтейнера = э_НакладнаяКонтейнеры.НомерКонтейнера ИЛИ ВТ_Накладные.НомерВагона = э_НакладнаяВагоны.НомерВагона)

		//ДИТ, Беляев СЮ, Ticket#0276626, 28-06-2022, конец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Поставщик КАК Поставщик,
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Договор КАК Договор,
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга КАК Услуга,
		|	ВЫБОР
		|		КОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ГруппаУслуг > 0
		|				И НЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ОсновнаяУслугаГруппы
		|			ТОГДА ИСТИНА
		|		КОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга.ВключатьВРасходыПоФактуОказанияУслуги
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НеВключатьВПлановыеРасходы,
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка КАК Калькуляция,
		|	ВЫБОР
		|		КОГДА ВТ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
		|			ТОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Цена20
		|		ИНАЧЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Цена40
		|	КОНЕЦ КАК Себестоимость,
		|	ВТ.Количество КАК Количество,
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СтавкаНДС КАК СтавкаНДС,
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга КАК ВыставляемаяУслуга,
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Цена20 КАК Цена20,
		|	ВТ.Груз КАК Груз,
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Цена40 КАК Цена40,
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СуммаВознаграждения20 КАК СуммаВознаграждения20,
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СуммаВознаграждения40 КАК СуммаВознаграждения40,
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Итого20 КАК Итого20,
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Итого40 КАК Итого40,
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Валюта КАК Валюта,
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВнутренняяСебестоимость КАК ВнутренняяСебестоимость,
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.море20_Контрагент КАК море20_Контрагент,
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.море20_Себестоимость КАК море20_Себестоимость,
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.море40_Контрагент КАК море40_Контрагент,
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.море40_Себестоимость КАК море40_Себестоимость,
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ММ_ВалютаФрахтовыхСтавок КАК ММ_ВалютаФрахтовыхСтавок,
		|	ВТ.СписокКТК КАК СписокКТК,
		|	ВТ.СписокВагонов КАК СписокВагонов,
		|	ВТ.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга.Перевыставляемая КАК Перевыставляемая,
		|	ВЫБОР
		|		КОГДА ВТ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
		|			ТОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СуммаВознаграждения20
		|		ИНАЧЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СуммаВознаграждения40
		|	КОНЕЦ * ВТ.Количество КАК ВознаграждениеИтого,
		//Евросиб - АСуслов 16.08.2022 17:00:19 #54349
		//(
		//|	ВЫБОР
		//|		КОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПодсылПорожних
		//|			ТОГДА НЕОПРЕДЕЛЕНО
		////|		ИНАЧЕ ВТ.СписокТД
		//|		ИНАЧЕ ВТ.ЖДН
		//|	КОНЕЦ КАК СписокТД,
		//)
		|ВЫБОР
		|	КОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПодсылПорожних
		|		ТОГДА ВЫБОР
		|				КОГДА ВТ.ГруженаяЖДННеНайдена
		|					ТОГДА ВТ.ЖДН
		|				ИНАЧЕ НЕОПРЕДЕЛЕНО
		|			КОНЕЦ
		|	ИНАЧЕ ВТ.ЖДН
		|КОНЕЦ КАК СписокТД,
		//Евросиб - АСуслов 16.08.2022 17:00:19 #54349
		|	ВТ.ЕстьПодсыл КАК ЕстьПодсыл,
		|	ВЫБОР КОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПодсылПорожних
		|   ИЛИ (КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ТипКалькуляции В(&МежсервисныеРасходы) И КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.Контрагент = &КонтрагентДирекция И КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ОтнестиРасходыНаСебестоимостьКлиента) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК Подсыл,
		|	ВТ.РазмерКТК КАК РазмерКТК,
		|	ВЫБОР
		|		КОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого)
		|				ИЛИ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПССТарифом)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.Вагон)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.Ктк)
		|	КОНЕЦ КАК ЕдиницаИзмерения,
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Возмещаемая КАК Возмещаемая,
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПунктОтправления КАК ПунктОтправления,
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПунктНазначения КАК ПунктНазначения,
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПлановаяСтоимостьИзЖДН КАК ПлановаяСтоимостьИзЖДН,
		|	ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ОсновнаяУслугаАвтоматически) КАК ИсточникПоявленияСтрокиЭкономики_Старая,
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ГруппаУслуг КАК ГруппаУслуг,
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ОсновнаяУслугаГруппы КАК ОсновнаяУслугаГруппы,
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ИдентификаторСтроки КАК СтрокаКалькуляции,
		|	ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ОсновнаяУслугаАвтоматически) КАК ИсточникПоявленияСтрокиЭкономики,
		|	NULL КАК ВидЖДН,
		//|	ВЫБОР
		//|		КОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		//|			ТОГДА ИСТИНА
		//|		ИНАЧЕ ЛОЖЬ
		//|	КОНЕЦ КАК ОтнестиНаЗатраты
		|	ВЫБОР
		|		КОГДА ВТ.Калькуляция.ТипКалькуляции В(&МежсервисныеРасходы)
		| 			И ВТ.Калькуляция.Контрагент = &КонтрагентДирекция
		| 			И ВТ.Калькуляция.ОтнестиРасходыНаСобственныеЗатраты 
		|		ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОтнестиНаЗатраты                            
		|ПОМЕСТИТЬ ИтоговаяРасходы
		|ИЗ
		|	ВТ КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
		|		ПО ВТ.Калькуляция = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка
		|			И (НЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
		|ГДЕ
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Возмещаемая = ЛОЖЬ
		|	И (КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПодсылПорожних = &ЭтоПодсылПорожних
		|			ИЛИ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПодсылПорожних = ВТ.ЕстьПодсыл
		|				И ВТ.ЕстьПодсыл = ИСТИНА)
		|	И ВЫБОР
		|			КОГДА ВТ.Сделка.ПовагонныеОтправки
		|					И КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПССТарифом)
		|				ТОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга = &НоменклатураЖДТарифГруженогоРейса
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА ВТ.ПризнакСобственности = ЗНАЧЕНИЕ(Перечисление.ВариантыСобственности.Собственный)
		// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
		//Было:
		//|					ИЛИ ВТ.ПризнакСобственности = ЗНАЧЕНИЕ(Перечисление.ВариантыСобственности.Арендованный)
		//Стало:
		|					ИЛИ ВТ.ПризнакСобственности = ЗНАЧЕНИЕ(Перечисление.ВариантыСобственности.АрендаДлительная)
		// ДИТ 65580 Давудов М.А. Конец: 23.02.2023
		|				ТОГДА НЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга = &НоменклатураПредоставлениеПС
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА НЕ(ВТ.НакладнаяПорожняяЖДНКТК = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
		|						ИЛИ ВТ.ГруженаяЖДННеНайдена
		|							И НЕ ВТ.ЖДН = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка))
		|				ТОГДА НЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга = &УслугаПорожнийТарифКонтейнер
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.контрагенты.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
		|	&УслугаПорожнийТарифПодПодгрузку,
		|	NULL,
		|	ВТ.Калькуляция,
		|	NULL,
		|	ВТ.Количество,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ВТ.Груз,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ВалютаРегламентированногоУчета.Значение.Ссылка,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ВТ.СписокКТК,
		|	ВТ.СписокВагонов,
		|	ВТ.СтрокаСвязьУчетныхЕдиниц,
		|	NULL,
		|	NULL,
		|	ВТ.НакладнаяВагоннаяЖДН,
		|	ВТ.ЕстьПодсыл,
		|	NULL,
		|	ВТ.РазмерКТК,
		|	NULL,
		|	NULL,
		|	ВТ_Накладные.СтанцияОтправления,
		|	ВТ_Накладные.СтанцияНазначения,
		|	ИСТИНА,
		|	ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ПорожняяЖДН),
		|	NULL,
		|	NULL,
		|	NULL,
		|	ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДН),
		|	ЗНАЧЕНИЕ(Справочник.ВидыЖДН.ПорожняяЖДН_Ваг),
		|	ВЫБОР
		|		КОГДА ВТ.Калькуляция.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Накладные КАК ВТ_Накладные
		|		ПО ВТ.НакладнаяВагоннаяЖДН.НомерТранспортногоДокумента = ВТ_Накладные.НакладнаяНомер
		|			И ВТ.СписокВагонов.Наименование = ВТ_Накладные.НомерВагона,
		|	Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
		|ГДЕ
		|	НЕ ВТ.НакладнаяВагоннаяЖДН = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.контрагенты.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
		|	&УслугаПорожнийТарифПодПодгрузку,
		|	NULL,
		|	ВТ.Калькуляция,
		|	NULL,
		|	ВТ.Количество,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ВТ.Груз,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ВалютаРегламентированногоУчета.Значение.Ссылка,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ВТ.СписокКТК,
		|	ВТ.СписокВагонов,
		|	ВТ.СтрокаСвязьУчетныхЕдиниц,
		|	NULL,
		|	NULL,
		|	ВТ.НакладнаяПорожняяВагоннаяЖДН,
		|	ВТ.ЕстьПодсыл,
		|	NULL,
		|	ВТ.РазмерКТК,
		|	NULL,
		|	NULL,
		|	ЕСТЬNULL(ВТ_Накладные.СтанцияОтправления, ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)),
		|	ЕСТЬNULL(ВТ_Накладные.СтанцияНазначения, ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)),
		|	ИСТИНА,
		|	ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДНПодсылаВагонов),
		|	NULL,
		|	NULL,
		|	NULL,
		|	ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДН),
		|	ЗНАЧЕНИЕ(Справочник.ВидыЖДН.ЖДН_ПодсылПодПорожнийКТК),
		|	ВЫБОР
		|		КОГДА ВТ.Калькуляция.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Накладные КАК ВТ_Накладные
		|		ПО ВТ.НакладнаяПорожняяВагоннаяЖДН.НомерТранспортногоДокумента = ВТ_Накладные.НакладнаяНомер
		|			И ВТ.СписокВагонов.Наименование = ВТ_Накладные.НомерВагона,
		|	Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
		|ГДЕ
		|	НЕ ВТ.НакладнаяПорожняяВагоннаяЖДН = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.контрагенты.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
		|	&УслугаПорожнийТарифПодПодгрузку,
		|	NULL,
		|	ВТ.Калькуляция,
		|	NULL,
		|	ВТ.Количество,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ВТ.Груз,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ВалютаРегламентированногоУчета.Значение.Ссылка,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ВТ.СписокКТК,
		|	ВТ.СписокВагонов,
		|	ВТ.СтрокаСвязьУчетныхЕдиниц,
		|	NULL,
		|	NULL,
		|	ВТ.НакладнаяПерестановкиДоГружКТК,
		|	ВТ.ЕстьПодсыл,
		|	NULL,
		|	ВТ.РазмерКТК,
		|	NULL,
		|	NULL,
		|	ВТ_Накладные.СтанцияОтправления,
		|	ВТ_Накладные.СтанцияНазначения,
		|	ИСТИНА,
		|	ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДНПерестановкиВагонов),
		|	NULL,
		|	NULL,
		|	NULL,
		|	ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДН),
		|	ЗНАЧЕНИЕ(Справочник.ВидыЖДН.ЖДН_ПерестановкиДоГружКТК),
		|	ВЫБОР
		|		КОГДА ВТ.Калькуляция.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Накладные КАК ВТ_Накладные
		|		ПО ВТ.НакладнаяПерестановкиДоГружКТК.НомерТранспортногоДокумента = ВТ_Накладные.НакладнаяНомер
		|			И ВТ.СписокВагонов.Наименование = ВТ_Накладные.НомерВагона,
		|	Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
		|ГДЕ
		|	НЕ ВТ.НакладнаяПерестановкиДоГружКТК = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.контрагенты.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
		|	&УслугаПорожнийТарифПодПодгрузку,
		|	NULL,
		|	ВТ.Калькуляция,
		|	NULL,
		|	ВТ.Количество,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ВТ.Груз,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ВалютаРегламентированногоУчета.Значение.Ссылка,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ВТ.СписокКТК,
		|	ВТ.СписокВагонов,
		|	ВТ.СтрокаСвязьУчетныхЕдиниц,
		|	NULL,
		|	NULL,
		|	ВТ.НакладнаяПерестановкиДоПорКТК,
		|	ВТ.ЕстьПодсыл,
		|	NULL,
		|	ВТ.РазмерКТК,
		|	NULL,
		|	NULL,
		|	ВТ_Накладные.СтанцияОтправления,
		|	ВТ_Накладные.СтанцияНазначения,
		|	ИСТИНА,
		|	ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДНПерестановкиВагонов),
		|	NULL,
		|	NULL,
		|	NULL,
		|	ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДН),
		|	ЗНАЧЕНИЕ(Справочник.ВидыЖДН.ЖДН_ПерестановкиДоПорКТК),
		|	ВЫБОР
		|		КОГДА ВТ.Калькуляция.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Накладные КАК ВТ_Накладные
		|		ПО ВТ.НакладнаяПерестановкиДоПорКТК.НомерТранспортногоДокумента = ВТ_Накладные.НакладнаяНомер
		|			И ВТ.СписокВагонов.Наименование = ВТ_Накладные.НомерВагона,
		|	Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
		|ГДЕ
		|	НЕ ВТ.НакладнаяПерестановкиДоПорКТК = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.контрагенты.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
		|	&УслугаФрахта,
		|	NULL,
		|	ФрахтПоКалькуляции.КалькуляцияФрахта,
		|	ФрахтПоКалькуляции.Ставка,
		|	ВТ.Количество,
		|	ФрахтПоКалькуляции.СтавкаНДС,
		|	NULL,
		|	&УслугаФрахта,
		|	NULL,
		|	ВТ.Груз,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ФрахтПоКалькуляции.Валюта,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ВТ.СписокКТК,
		|	ВТ.СписокВагонов,
		|	ВТ.СтрокаСвязьУчетныхЕдиниц,
		|	ВЫРАЗИТЬ(&УслугаФрахта КАК Справочник.Номенклатура).Перевыставляемая,
		|	ФрахтПоКалькуляции.Вознаграждение * ВТ.Количество,
		|	ФрахтПоКалькуляции.Коносамент,
		|	ВТ.ЕстьПодсыл,
		|	NULL,
		|	ВТ.РазмерКТК,
		|	NULL,
		|	NULL,
		|	ВТ.Коносамент.СтанцияОтправления,
		|	ВТ.Коносамент.СтанцияНазначения,
		|	NULL,
		|	ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ДопУслугаАвтоматически),
		|	NULL,
		|	NULL,
		|	ФрахтПоКалькуляции.ИдентификаторСтроки,
		|	ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ФрахтИзКалькуляции),
		|	NULL,
		|	ВЫБОР
		|		КОГДА ФрахтПоКалькуляции.КалькуляцияФрахта.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|ИЗ
		|	ВТ КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ФрахтПоКалькуляции КАК ФрахтПоКалькуляции
		|		ПО ВТ.Калькуляция = ФрахтПоКалькуляции.КалькуляцияФрахта
		|			И (ВЫБОР
		|				КОГДА ВТ.Калькуляция.ФрахтИмпорт
		|					ТОГДА ВТ.ПортОтправления = ФрахтПоКалькуляции.Порт
		|							ИЛИ ВТ.Коносамент.СтанцияОтправления = ФрахтПоКалькуляции.Порт
		|				ИНАЧЕ ВТ.ПортНазначения = ФрахтПоКалькуляции.Порт
		|						ИЛИ ВТ.Коносамент.СтанцияНазначения = ФрахтПоКалькуляции.Порт
		|			КОНЕЦ)
		|			И ВТ.СтрокаСвязьУчетныхЕдиниц = ФрахтПоКалькуляции.СтрокаСвязьУчетныхЕдиниц
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.контрагенты.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
		|	&УслугаПорожнийТарифКонтейнер,
		|	NULL,
		|	ВТ.Калькуляция,
		|	NULL,
		|	ВТ.Количество,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ВТ.Груз,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ВалютаРегламентированногоУчета.Значение.Ссылка,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ВТ.СписокКТК,
		|	ВТ_НакладныеВагоныКТК.ВагонСсылка,
		|	ВТ.СтрокаСвязьУчетныхЕдиниц,
		|	NULL,
		|	NULL,
		|	ВТ.НакладнаяПорожняяЖДНКТК,
		|	ВТ.ЕстьПодсыл,
		|	NULL,
		|	ВТ.РазмерКТК,
		|	NULL,
		|	NULL,
		|	ВТ_НакладныеВагоныКТК.ЛокацияОтправления,
		|	ВТ_НакладныеВагоныКТК.ЛокацияНазначения,
		|	ИСТИНА,
		|	ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДНПодсылаКТК),
		|	NULL,
		|	NULL,
		|	NULL,
		|	ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДН),
		|	ЗНАЧЕНИЕ(Справочник.ВидыЖДН.ПорожняяЖДН_КТК),
		|	ВЫБОР
		|		КОГДА ВТ.Калькуляция.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НакладныеВагоныКТК КАК ВТ_НакладныеВагоныКТК
		|		ПО ВТ.НакладнаяПорожняяЖДНКТК.НомерТранспортногоДокумента = ВТ_НакладныеВагоныКТК.Ссылка.НакладнаяНомер
		|			И ВТ.СписокКТК.Наименование = ВТ_НакладныеВагоныКТК.НомерКонтейнера,
		|	Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
		|ГДЕ
		|	НЕ ВТ.НакладнаяПорожняяЖДНКТК = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
		|	МАКСИМУМ(СделкаСвязьДоходовИРасходов.Доходы) КАК Доходы
		|ПОМЕСТИТЬ СУЕ_Доходы
		|ИЗ
		|	ВТ_ТЧСвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
		|
		|СГРУППИРОВАТЬ ПО
		|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(СделкаДоходы.ПериодВО) КАК ПериодВО,
		|	СУЕ_Доходы.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
		|	СУЕ_Доходы.Доходы КАК Доходы,
		|	ВЫБОР
		|		КОГДА СделкаДоходы.УчДокумент ССЫЛКА Документ.ОтчетКомитентуОПродажах
		|				И НЕ СделкаДоходы.УчДокумент = ЗНАЧЕНИЕ(документ.ОтчетКомитентуОПродажах.Пустаяссылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьОтчетКомитенту,
		|	СделкаДоходы.НеВыставлятьКлиенту КАК НеВыставлятьКлиенту
		|ПОМЕСТИТЬ СУЕ_Доходы_ПериодВО
		|ИЗ
		|	СУЕ_Доходы КАК СУЕ_Доходы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
		|		ПО СУЕ_Доходы.Доходы = СделкаДоходы.ГУИД
		|
		|СГРУППИРОВАТЬ ПО
		|	СУЕ_Доходы.СвязьУчетныхЕдиниц,
		|	СУЕ_Доходы.Доходы,
		|	ВЫБОР
		|		КОГДА СделкаДоходы.УчДокумент ССЫЛКА Документ.ОтчетКомитентуОПродажах
		|				И НЕ СделкаДоходы.УчДокумент = ЗНАЧЕНИЕ(документ.ОтчетКомитентуОПродажах.Пустаяссылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	СделкаДоходы.НеВыставлятьКлиенту
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СвязьУчетныхЕдиниц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИтоговаяРасходы.Поставщик КАК Поставщик,
		|	ИтоговаяРасходы.Договор КАК Договор,
		|	ИтоговаяРасходы.Услуга КАК Услуга,
		|	ВЫБОР
		|		КОГДА СУЕ_Доходы_ПериодВО.НеВыставлятьКлиенту
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ИтоговаяРасходы.НеВключатьВПлановыеРасходы
		|	КОНЕЦ КАК НеВключатьВПлановыеРасходы,
		|	ИтоговаяРасходы.Калькуляция КАК Калькуляция,
		|	ИтоговаяРасходы.Себестоимость КАК Себестоимость,
		|	ИтоговаяРасходы.Количество КАК Количество,
		|	ИтоговаяРасходы.СтавкаНДС КАК СтавкаНДС,
		|	ИтоговаяРасходы.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
		|	ИтоговаяРасходы.ВыставляемаяУслуга КАК ВыставляемаяУслуга,
		|	ИтоговаяРасходы.Цена20 КАК Цена20,
		|	ИтоговаяРасходы.Груз КАК Груз,
		|	ИтоговаяРасходы.Цена40 КАК Цена40,
		|	ИтоговаяРасходы.СуммаВознаграждения20 КАК СуммаВознаграждения20,
		|	ИтоговаяРасходы.СуммаВознаграждения40 КАК СуммаВознаграждения40,
		|	ИтоговаяРасходы.Итого20 КАК Итого20,
		|	ИтоговаяРасходы.Итого40 КАК Итого40,
		|	ИтоговаяРасходы.Валюта КАК Валюта,
		|	ИтоговаяРасходы.ВнутренняяСебестоимость КАК ВнутренняяСебестоимость,
		|	ИтоговаяРасходы.море20_Контрагент КАК море20_Контрагент,
		|	ИтоговаяРасходы.море20_Себестоимость КАК море20_Себестоимость,
		|	ИтоговаяРасходы.море40_Контрагент КАК море40_Контрагент,
		|	ИтоговаяРасходы.море40_Себестоимость КАК море40_Себестоимость,
		|	ИтоговаяРасходы.ММ_ВалютаФрахтовыхСтавок КАК ММ_ВалютаФрахтовыхСтавок,
		|	ИтоговаяРасходы.СписокКТК КАК СписокКТК,
		|	ИтоговаяРасходы.СписокВагонов КАК СписокВагонов,
		|	ИтоговаяРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
		//Евросиб - АСуслов 23.08.2022 16:36:02 #55561
		//(
		//|	ИтоговаяРасходы.Перевыставляемая КАК Перевыставляемая,
		//)
		//Евросиб - АСуслов 23.08.2022 16:36:11 #55561
		|	ИтоговаяРасходы.ВознаграждениеИтого КАК ВознаграждениеИтого,
		|	ИтоговаяРасходы.СписокТД КАК СписокТД,
		|	ИтоговаяРасходы.ЕстьПодсыл КАК ЕстьПодсыл,
		|	ИтоговаяРасходы.Подсыл КАК Подсыл,
		|	ИтоговаяРасходы.РазмерКТК КАК РазмерКТК,
		|	ИтоговаяРасходы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ИтоговаяРасходы.Возмещаемая КАК Перевыставляемая,
		|	ИтоговаяРасходы.ПунктОтправления КАК ПунктОтправления,
		|	ИтоговаяРасходы.ПунктНазначения КАК ПунктНазначения,
		|	ИтоговаяРасходы.ПлановаяСтоимостьИзЖДН КАК ПлановаяСтоимостьИзЖДН,
		|	ИтоговаяРасходы.ИсточникПоявленияСтрокиЭкономики_Старая КАК ИсточникПоявленияСтрокиЭкономики_Старая,
		|	ЕСТЬNULL(ВТ_РасходыГУИДыСУЕ.ГУИД, """") КАК ГУИД,
		|	ЛОЖЬ КАК Удалить,
		|	ВЫБОР
		|		КОГДА ИтоговаяРасходы.ПлановаяСтоимостьИзЖДН
		|			ТОГДА ВТ_НакладныеВагоныКТК.СуммаВРублях
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СтоимостьИзЖДН,
		|	ВЫБОР
		|		КОГДА ИтоговаяРасходы.ПлановаяСтоимостьИзЖДН
		|			ТОГДА ВТ_НакладныеВагоныКТК.СуммаНалога
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаНДСИзЖДН,
		|	ВЫБОР
		|		КОГДА ИтоговаяРасходы.ПлановаяСтоимостьИзЖДН
		|			ТОГДА ВТ_НакладныеВагоныКТК.СтавкаНДС
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СтавкаНДСИзЖДН,
		|	ЕСТЬNULL(СУЕ_Доходы_ПериодВО.ПериодВО, ДАТАВРЕМЯ(1, 1, 1)) КАК ПериодВО,
		|	ИтоговаяРасходы.ГруппаУслуг КАК ГруппаУслуг,
		|	ИтоговаяРасходы.ОсновнаяУслугаГруппы КАК ОсновнаяУслугаГруппы,
		|	NULL КАК УчДокумент,
		|	ЕСТЬNULL(СУЕ_Доходы_ПериодВО.ЕстьОтчетКомитенту, ЛОЖЬ) КАК ЕстьОтчетКомитенту,
		|	ИтоговаяРасходы.СтрокаКалькуляции КАК СтрокаКалькуляции,
		|	ИтоговаяРасходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
		|	ИтоговаяРасходы.ВидЖДН КАК ВидЖДН,
		|	ИтоговаяРасходы.ОтнестиНаЗатраты КАК ОтнестиНаЗатраты
		|ИЗ
		|	ИтоговаяРасходы КАК ИтоговаяРасходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасходыГУИДыСУЕ КАК ВТ_РасходыГУИДыСУЕ
		|		ПО (ВЫБОР
		|				КОГДА НЕ ИтоговаяРасходы.ИсточникПоявленияСтрокиЭкономики_Старая = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДНВозврата)
		|						И НЕ ИтоговаяРасходы.ИсточникПоявленияСтрокиЭкономики_Старая = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ПорожняяЖДН)
		|						И НЕ ИтоговаяРасходы.ИсточникПоявленияСтрокиЭкономики_Старая = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДНПерестановкиВагонов)
		|					ТОГДА ИтоговаяРасходы.СтрокаСвязьУчетныхЕдиниц = ВТ_РасходыГУИДыСУЕ.СтрокаСвязьУчетныхЕдиниц
		|							И ИтоговаяРасходы.ИсточникПоявленияСтрокиЭкономики_Старая = ВТ_РасходыГУИДыСУЕ.ИсточникПоявленияСтрокиЭкономики_Старая
		|							И ИтоговаяРасходы.Услуга = ВТ_РасходыГУИДыСУЕ.Услуга
		|							И ИтоговаяРасходы.ПунктОтправления = ВТ_РасходыГУИДыСУЕ.ПунктОтправления
		|							И ИтоговаяРасходы.ПунктНазначения = ВТ_РасходыГУИДыСУЕ.ПунктНазначения
		|							И ИтоговаяРасходы.Поставщик = ВТ_РасходыГУИДыСУЕ.Поставщик
		|							И ИтоговаяРасходы.Договор = ВТ_РасходыГУИДыСУЕ.Договор
		|							И ИтоговаяРасходы.Валюта = ВТ_РасходыГУИДыСУЕ.Валюта
		|							И ВЫБОР
		|								КОГДА ИтоговаяРасходы.ПлановаяСтоимостьИзЖДН
		|									ТОГДА ИСТИНА
		|								ИНАЧЕ ИтоговаяРасходы.Себестоимость = ВТ_РасходыГУИДыСУЕ.Себестоимость
		|							КОНЕЦ
		|				ИНАЧЕ ИтоговаяРасходы.Валюта = ВТ_РасходыГУИДыСУЕ.Валюта
		|						И ИтоговаяРасходы.ИсточникПоявленияСтрокиЭкономики_Старая = ВТ_РасходыГУИДыСУЕ.ИсточникПоявленияСтрокиЭкономики_Старая
		|						И ИтоговаяРасходы.Услуга = ВТ_РасходыГУИДыСУЕ.Услуга
		|						И ИтоговаяРасходы.Поставщик = ВТ_РасходыГУИДыСУЕ.Поставщик
		|						И ИтоговаяРасходы.Договор = ВТ_РасходыГУИДыСУЕ.Договор
		|						И ИтоговаяРасходы.СтрокаСвязьУчетныхЕдиниц = ВТ_РасходыГУИДыСУЕ.СтрокаСвязьУчетныхЕдиниц
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НакладныеВагоныКТК КАК ВТ_НакладныеВагоныКТК
		|		ПО ИтоговаяРасходы.СписокТД = ВТ_НакладныеВагоныКТК.НакладнаяНомер
		|			И (ВЫБОР
		|				КОГДА ЕСТЬNULL(ИтоговаяРасходы.СписокКТК, ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|						ИЛИ ИтоговаяРасходы.ИсточникПоявленияСтрокиЭкономики_Старая = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ПорожняяЖДН)
		|						ИЛИ ИтоговаяРасходы.ИсточникПоявленияСтрокиЭкономики_Старая = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДНПерестановкиВагонов)
		|						ИЛИ ИтоговаяРасходы.ИсточникПоявленияСтрокиЭкономики_Старая = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДНПодсылаВагонов)
		|					ТОГДА ИтоговаяРасходы.СписокВагонов = ВТ_НакладныеВагоныКТК.ВагонСсылка
		|				ИНАЧЕ ИтоговаяРасходы.СписокКТК = ВТ_НакладныеВагоныКТК.КонтейнерСсылка
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ СУЕ_Доходы_ПериодВО КАК СУЕ_Доходы_ПериодВО
		|		ПО ИтоговаяРасходы.СтрокаСвязьУчетныхЕдиниц = СУЕ_Доходы_ПериодВО.СвязьУчетныхЕдиниц
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка),
		|	NULL,
		|	NULL, 
		//Евросиб - АСуслов 23.08.2022 16:36:27 #55561
		//(
		//|	NULL,
		//)
		//Евросиб - АСуслов 23.08.2022 16:36:29 #55561
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ВТ_РасходыГУИДыСУЕ.ГУИД,
		|	ИСТИНА,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ВТ_РасходыГУИДыСУЕ.УчДокумент,
		|	ЛОЖЬ,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL
		|ИЗ
		|	ВТ_РасходыГУИДыСУЕ КАК ВТ_РасходыГУИДыСУЕ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИтоговаяРасходы КАК ИтоговаяРасходы
		|		ПО (ИтоговаяРасходы.Услуга = ВТ_РасходыГУИДыСУЕ.Услуга)
		|			И (ИтоговаяРасходы.СтрокаСвязьУчетныхЕдиниц = ВТ_РасходыГУИДыСУЕ.СтрокаСвязьУчетныхЕдиниц)
		|			И (ИтоговаяРасходы.ИсточникПоявленияСтрокиЭкономики_Старая = ВТ_РасходыГУИДыСУЕ.ИсточникПоявленияСтрокиЭкономики_Старая)
		|			И ВТ_РасходыГУИДыСУЕ.ПунктОтправления = ИтоговаяРасходы.ПунктОтправления
		|			И ВТ_РасходыГУИДыСУЕ.ПунктНазначения = ИтоговаяРасходы.ПунктНазначения
		|			И ВТ_РасходыГУИДыСУЕ.Поставщик = ИтоговаяРасходы.Поставщик
		|			И ВТ_РасходыГУИДыСУЕ.Договор = ИтоговаяРасходы.Договор
		|			И ВТ_РасходыГУИДыСУЕ.Валюта = ИтоговаяРасходы.Валюта
		|			И ВТ_РасходыГУИДыСУЕ.Калькуляция = ИтоговаяРасходы.Калькуляция
		|			И (ВЫБОР
		|				КОГДА НЕ ВТ_РасходыГУИДыСУЕ.ИсточникПоявленияСтрокиЭкономики_Старая В (ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ПорожняяЖДН), ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДНПерестановкиВагонов), ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДНПодсылаВагонов))
		|						И НЕ ИтоговаяРасходы.ПлановаяСтоимостьИзЖДН
		|						И ВТ_РасходыГУИДыСУЕ.УчДокумент = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
		|					ТОГДА ВТ_РасходыГУИДыСУЕ.Себестоимость = ИтоговаяРасходы.Себестоимость
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА НЕ ВТ_РасходыГУИДыСУЕ.ИсточникПоявленияСтрокиЭкономики_Старая В (ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ПорожняяЖДН), ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДНПерестановкиВагонов), ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДНПодсылаВагонов))
		|						И НЕ ИтоговаяРасходы.ПлановаяСтоимостьИзЖДН
		|						И ВТ_РасходыГУИДыСУЕ.УчДокумент = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
		|					ТОГДА ВТ_РасходыГУИДыСУЕ.СтавкаНДС = ИтоговаяРасходы.СтавкаНДС
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|ГДЕ
		|	(ВТ_РасходыГУИДыСУЕ.ИсточникПоявленияСтрокиЭкономики_Старая В (&Источники)
		|			ИЛИ ВТ_РасходыГУИДыСУЕ.Услуга = &УслугаФрахта
		|				И ВТ_РасходыГУИДыСУЕ.ИсточникПоявленияСтрокиЭкономики_Старая = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ДопуслугаАвтоматически))
		|	И ВТ_РасходыГУИДыСУЕ.СтрокаРасходовВПеренесеннойСделке = """" 
		//Евросиб - АСуслов 09.12.2022 16:49:46 #61448
		//(
		|   И ВТ_РасходыГУИДыСУЕ.СтрокаРасходовВСделкеИсточник = """"
		//)
		//Евросиб - АСуслов 09.12.2022 16:49:50 #61448
		|	И (ИтоговаяРасходы.СтрокаСвязьУчетныхЕдиниц ЕСТЬ NULL
		|			ИЛИ ВТ_РасходыГУИДыСУЕ.СтрокаСУЕОтсутствует)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СписокКТК";
		#КонецОбласти
		#Область ПараметрыЗапроса
		Запрос.УстановитьПараметр("УслугаФрахта", ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("УслугаФрахтаДляКалькуляции"));
		Запрос.УстановитьПараметр("ЭтоПодсылПорожних", Сделка.ПодсылПорожних);
		//Запрос.УстановитьПараметр("НоменклатураЖДТарифГруженогоРейса", Справочники.Номенклатура.НайтиПоНаименованию("ГруженыйЖДтарифРФ"));
		Запрос.УстановитьПараметр("НоменклатураЖДТарифГруженогоРейса", ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("НоменклатураЖДТарифГруженогоРейса"));
		Запрос.УстановитьПараметр("НоменклатураПредоставлениеПС", ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("УслугаДляПовагоннойЗаявки"));
		Запрос.УстановитьПараметр("Ссылка", Сделка.Ссылка);
		Запрос.УстановитьПараметр("ВыгрТЧ", СвязьУчетныхЕдиниц.Выгрузить());
		Запрос.УстановитьПараметр("ТЧРасходы", Расходы.Выгрузить());
		Запрос.УстановитьПараметр("ТЧСвязьДоходовИРасходов", СвязьДоходовИРасходов.Выгрузить());        
		//НоменклатураТарифаПодсылаВагонов = Константы.НоменклатураТарифаПодсылаВагонов.Получить();
		НоменклатураТарифаПодсылаВагонов = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("НоменклатураТарифаПодсылаВагонов");
		//НоменклатураТарифаПодсылаКТК = Константы.НоменклатураТарифаПодсылаКТК.Получить();
		НоменклатураТарифаПодсылаКТК = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("НоменклатураТарифаПодсылаКТК");
		Запрос.УстановитьПараметр("УслугаПорожнийТарифПодПодгрузку",НоменклатураТарифаПодсылаВагонов);
		Запрос.УстановитьПараметр("УслугаПорожнийТарифКонтейнер", НоменклатураТарифаПодсылаКТК);
		//Запрос.УстановитьПараметр("УслугаПорожнийТарифПослеВыгрузки", Справочники.Номенклатура.НайтиПоНаименованию("ПорожнийТарифПослеВыгрузки"));
		Запрос.УстановитьПараметр("УслугаПорожнийТарифПослеВыгрузки", ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("НоменклатураПорожнегоТарифаПослеВыгрузки"));
		МассивУслугПодсыла = Новый Массив;
		МассивУслугПодсыла.Добавить(НоменклатураТарифаПодсылаВагонов);
		МассивУслугПодсыла.Добавить(НоменклатураТарифаПодсылаКТК);
		Запрос.УстановитьПараметр("УслугиПодсыла", МассивУслугПодсыла);
		МежсервисныеРасходы = Новый Массив;
		МежсервисныеРасходы.Добавить(Перечисления.ТипыКалькуляций.МежсервисныеРасходы);
		МежсервисныеРасходы.Добавить(Перечисления.ТипыКалькуляций.МежсервисныеРасходыРеф);
		Запрос.УстановитьПараметр("МежсервисныеРасходы", МежсервисныеРасходы);
		Запрос.УстановитьПараметр("КонтрагентДирекция", Константы.КонтрагентДирекцияКонтейнерныхПеревозок.Получить());
		
		СписокНомеровНакладных = Новый Массив;
		//ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СписокНомеровНакладных, СвязьУчетныхЕдиниц.ВыгрузитьКолонку("НомерЖДН"), Истина);
		//ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СписокНомеровНакладных, СвязьУчетныхЕдиниц.ВыгрузитьКолонку("НомерВагоннойЖДН"), Истина);
		//ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СписокНомеровНакладных, СвязьУчетныхЕдиниц.ВыгрузитьКолонку("НомерПорожнейЖДНКТК"), Истина);
		//ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СписокНомеровНакладных, СвязьУчетныхЕдиниц.ВыгрузитьКолонку("НомерПорожнейВагоннойЖДН"), Истина);
		
		СписокНакладных = Новый Массив;
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СписокНакладных, СвязьУчетныхЕдиниц.ВыгрузитьКолонку("ЖДН"),Истина);
		//МассивНакладных = СвязьУчетныхЕдиниц.ВыгрузитьКолонку("ЖДН");
		//НомераНакладных = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивНакладных, "НомерТранспортногоДокумента");
		//Для каждого НомерНакладной Из НомераНакладных Цикл
		//	СписокНомеровНакладных.Добавить(НомерНакладной.Значение);
		//КонецЦикла; 
		//МассивНакладных = СвязьУчетныхЕдиниц.ВыгрузитьКолонку("ВагоннаяЖДН");
		//НомераНакладных = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивНакладных, "НомерТранспортногоДокумента");
		//Для каждого НомерНакладной Из НомераНакладных Цикл
		//	СписокНомеровНакладных.Добавить(НомерНакладной.Значение);
		//КонецЦикла; 
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СписокНакладных, СвязьУчетныхЕдиниц.ВыгрузитьКолонку("ВагоннаяЖДН"),Истина);
		//МассивНакладных = СвязьУчетныхЕдиниц.ВыгрузитьКолонку("ПорожняяЖДНКТК");
		//НомераНакладных = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивНакладных, "НомерТранспортногоДокумента");
		//Для каждого НомерНакладной Из НомераНакладных Цикл
		//	СписокНомеровНакладных.Добавить(НомерНакладной.Значение);
		//КонецЦикла; 
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СписокНакладных, СвязьУчетныхЕдиниц.ВыгрузитьКолонку("ПорожняяЖДНКТК"),Истина);
		//МассивНакладных = СвязьУчетныхЕдиниц.ВыгрузитьКолонку("ПорожняяВагоннаяЖДН");
		//НомераНакладных = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивНакладных, "НомерТранспортногоДокумента");
		//Для каждого НомерНакладной Из НомераНакладных Цикл
		//	СписокНомеровНакладных.Добавить(НомерНакладной.Значение);
		//КонецЦикла; 
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СписокНакладных, СвязьУчетныхЕдиниц.ВыгрузитьКолонку("ПорожняяВагоннаяЖДН"),Истина);
		//МассивНакладных = СвязьУчетныхЕдиниц.ВыгрузитьКолонку("НакладнаяПослеГруженогоПлеча");
		//НомераНакладных = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивНакладных, "НомерТранспортногоДокумента");
		//Для каждого НомерНакладной Из НомераНакладных Цикл
		//	СписокНомеровНакладных.Добавить(НомерНакладной.Значение);
		//КонецЦикла; 
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СписокНакладных, СвязьУчетныхЕдиниц.ВыгрузитьКолонку("НакладнаяПослеГруженогоПлеча"),Истина);
		//МассивНакладных = СвязьУчетныхЕдиниц.ВыгрузитьКолонку("НакладнаяПослеГружКТК");
		//НомераНакладных = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивНакладных, "НомерТранспортногоДокумента");
		//Для каждого НомерНакладной Из НомераНакладных Цикл
		//	СписокНомеровНакладных.Добавить(НомерНакладной.Значение);
		//КонецЦикла; 
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СписокНакладных, СвязьУчетныхЕдиниц.ВыгрузитьКолонку("НакладнаяПослеГружКТК"),Истина);
		//МассивНакладных = СвязьУчетныхЕдиниц.ВыгрузитьКолонку("ЖДНПерестановкиДоГружКТК");
		//НомераНакладных = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивНакладных, "НомерТранспортногоДокумента");
		//Для каждого НомерНакладной Из НомераНакладных Цикл
		//	СписокНомеровНакладных.Добавить(НомерНакладной.Значение);
		//КонецЦикла; 
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СписокНакладных, СвязьУчетныхЕдиниц.ВыгрузитьКолонку("ЖДНПерестановкиДоГружКТК"),Истина);
		//МассивНакладных = СвязьУчетныхЕдиниц.ВыгрузитьКолонку("ЖДНПерестановкиДоПорКТК");
		//НомераНакладных = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивНакладных, "НомерТранспортногоДокумента");
		//Для каждого НомерНакладной Из НомераНакладных Цикл
		//	СписокНомеровНакладных.Добавить(НомерНакладной.Значение);
		//КонецЦикла; 
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СписокНакладных, СвязьУчетныхЕдиниц.ВыгрузитьКолонку("ЖДНПерестановкиДоПорКТК"),Истина);
		Запрос.УстановитьПараметр("СписокТранспортныхДокументов", СписокНакладных);
		
		МассивИсточникиСтрок = Новый Массив;
		МассивИсточникиСтрок.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ОсновнаяУслугаАвтоматически);
		//МассивИсточникиСтрок.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ДопУслугаАвтоматически);
		МассивИсточникиСтрок.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ПорожняяЖДН);
		МассивИсточникиСтрок.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДНПодсылаВагонов);
		МассивИсточникиСтрок.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДНПодсылаКТК);
		МассивИсточникиСтрок.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДНВозврата);
		МассивИсточникиСтрок.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДНВозвратаКТК);
		МассивИсточникиСтрок.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДНПерестановкиВагонов);
		Запрос.УстановитьПараметр("Источники", МассивИсточникиСтрок);
		
		//ВыборкаПоСтрокамСУЕ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		//Евросиб Каблов 09.04.2025 ( #105407 Не используется
		//ГлобальныйОткрытыйПериод = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Сделка.Организация);
		//Евросиб Каблов 09.04.2025 )
		МассивКалькуляцийСоСтавкойЗаВагон = Новый Массив;
		ТаблицаСтрокДляОтвязкиАкцептов = Расходы.Выгрузить(,"УчДокумент, ГУИД, Калькуляция, Услуга");
		ТаблицаСтрокДляОтвязкиАкцептов.Очистить();
		МассивПТУДляОтвязки = Новый Массив;
		МассивСтрокДляУдаления = Новый Массив;
		ТЗПорожнихЖДН = Новый ТаблицаЗначений;
		ТЗПорожнихЖДН.Колонки.Добавить("СписокТД");
		ТЗПорожнихЖДН.Колонки.Добавить("СписокВагонов");
		
		#КонецОбласти	
		//Пока ВыборкаПоСтрокамСУЕ.Следующий() Цикл
		//	СтруктураПоиска = Новый Структура("СтрокаСвязьУчетныхЕдиниц", ВыборкаПоСтрокамСУЕ.СтрокаСвязьУчетныхЕдиниц); 
		//	СтрокиРасходов = Расходы.НайтиСтроки(СтруктураПоиска);
		//	Если СтрокиРасходов.Количество() = 0 Тогда
		//добавим расходы
		
		//Евросиб Мелентьев  (Ticket#0239191
		//ЗагрузитьТЗвТЧ = Ложь;
		//Если Расходы.Количество() > 1000 Тогда
		//	ТаблицаДляПоиска = Расходы.Выгрузить();
		//	ТаблицаДляПоиска.Индексы.Добавить("ГУИД");
		//	ЗагрузитьТЗвТЧ = Истина;
		//Иначе
		//	ТаблицаДляПоиска = Расходы;
		//КонецЕсли;          
		//проиндексировали реквизит в тч
		ТаблицаДляПоиска = Расходы;
		
		
		//Врем = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
		ВыборкаДетали = Запрос.Выполнить().Выбрать();
		МассивИспользованныхГУИД = Новый Массив;
		Пока ВыборкаДетали.Следующий() Цикл
			//Если ВыборкаДетали.ОсновнаяУслугаГруппы = Ложь 
			//	И ЗначениеЗаполнено(ВыборкаДетали.ГруппаУслуг) 
			//	Тогда 
			//	Продолжить;
			//КонецЕсли;
			//в тексте запроса идёт проверка что ключевые поля изменились,
			//поэтому здесь отвязываем акцепт, если он есть
			//СтрокаРасходов = Расходы.Найти(ВыборкаДетали.ГУИД, "ГУИД");
			СтрокаРасходов = ТаблицаДляПоиска.Найти(ВыборкаДетали.ГУИД, "ГУИД");
			//Евросиб Мелентьев  )Ticket#0239191
			//Если ВыборкаДетали.ЕстьОтчетКомитенту <> Истина Тогда // SIV 03-03-21 . здесь он почему-то в null выходил, было так: Если НЕ ВыборкаДетали.ЕстьОтчетКомитенту Тогда
			//	Если ЗначениеЗаполнено(ВыборкаДетали.УчДокумент) Тогда
			//		Если МассивПТУДляОтвязки.Найти(ВыборкаДетали.УчДокумент) = Неопределено Тогда
			//			МассивПТУДляОтвязки.Добавить(ВыборкаДетали.УчДокумент);
			//		КонецЕсли; 
			//		нСтрокаОтвязки = ТаблицаСтрокДляОтвязкиАкцептов.Добавить();
			//		нСтрокаОтвязки.УчДокумент = СтрокаРасходов.УчДокумент;
			//		нСтрокаОтвязки.ГУИД = СтрокаРасходов.ГУИД;
			//		нСтрокаОтвязки.Калькуляция = СтрокаРасходов.Калькуляция;
			//		нСтрокаОтвязки.Услуга = СтрокаРасходов.Услуга;
			//	КонецЕсли;
			//	Если ВыборкаДетали.Удалить = Истина Тогда
			//		//Расходы.Удалить(СтрокаРасходов);
			//		СтрокаРасходов.У0слугаОтключена = Истина;
			//		Продолжить;
			//	КонецЕсли;
			//КонецЕсли; 
			//СтрокаРасходов = Расходы.Найти(ВыборкаДетали.ГУИД, "ГУИД");
			Если ВыборкаДетали.Удалить = Истина Тогда
				//Евросиб - АСуслов 03.10.2023 13:08:58 #74994
				//(
				Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаРасходов.Услуга, "НеИспользовать") Тогда
					МассивСтрокДляУдаления.Добавить(СтрокаРасходов);
				КонецЕсли;
				//)
				//Евросиб - АСуслов 03.10.2023 13:09:03 #74994
				Продолжить;
			КонецЕсли; 
			Если СтрокаРасходов = Неопределено 
				ИЛИ ВыборкаДетали.ГУИД = "" 
				ИЛИ МассивИспользованныхГУИД.Найти(ВыборкаДетали.ГУИД) <> Неопределено Тогда
				СтрокаРасходов = Расходы.Добавить();
				СтрокаРасходов.ГУИД 				= Новый УникальныйИдентификатор;
			КонецЕсли; 
			//Евросиб - АСуслов 21.08.2021 15:09:37 #33698
			//(
			СтрокаРасходов.Вагон = ВыборкаДетали.СписокВагонов;
			СтрокаРасходов.Контейнер = ВыборкаДетали.СписокКТК;
			СтрокаРасходов.ТранспортныйДокумент = ВыборкаДетали.СписокТД;
			//)
			//Евросиб - АСуслов 21.08.2021 15:09:40 #33698
			//в некоторых случаях, например по ЖДН возврата, добавляются дополнительные строки, которые привязываются к уже существующему гуид,
			//поэтому для таких случаев будем считать, если строчка гуид-а уже использована, то добавляем новую
			Если ЗначениеЗаполнено(ВыборкаДетали.ГУИД) Тогда
				МассивИспользованныхГУИД.Добавить(ВыборкаДетали.ГУИД);	
			КонецЕсли; 
			ЗаполнитьЗначенияСвойств(СтрокаРасходов, ВыборкаДетали,,"ГУИД, НеВключатьВПлановыеРасходы, СтавкаНДС, НДСВключенВСтоимость, УчДокумент");
			Если НЕ ЗначениеЗаполнено(СтрокаРасходов.УчДокумент) Тогда
				СтрокаРасходов.СтавкаНДС			= ВыборкаДетали.СтавкаНДС;
				СтрокаРасходов.НДСВключенВСтоимость = ВыборкаДетали.НДСВключенВСтоимость;
			КонецЕсли; 
			СтрокаРасходов.НоменклатурнаяГруппа = РазнесениеЗатратСервер.ПодобратьНоменклатурнуюГруппуПоНаборуПараметров(Сделка.ТипЗаказа, ВыборкаДетали.СписокВагонов);
			СтрокаРасходов.СебестоимостьИтого		= СтрокаРасходов.Себестоимость * СтрокаРасходов.Количество;
			СтрокаРасходов.СуммаНДС 				= БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СтрокаРасходов.СебестоимостьИтого,	БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СтрокаРасходов.СтавкаНДС), Истина, СтрокаРасходов.НДСВключенВСтоимость);
			СтрокаРасходов.СуммаИтого 				= СтрокаРасходов.СебестоимостьИтого + ?(СтрокаРасходов.НДСВключенВСтоимость, 0, СтрокаРасходов.СуммаНДС);
			Если ВыборкаДетали.ПлановаяСтоимостьИзЖДН = Истина Тогда
				СтрокаРасходов.СтавкаНДС = ВыборкаДетали.СтавкаНДСИзЖДН;
				СтрокаРасходов.Валюта = Справочники.Валюты.Рубль;
				СтрокаРасходов.Себестоимость = ВыборкаДетали.СтоимостьИзЖДН;
				СтрокаРасходов.СебестоимостьИтого		= СтрокаРасходов.Себестоимость * СтрокаРасходов.Количество;
				//СтрокаРасходов.СуммаНДС 				= БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СтрокаРасходов.СебестоимостьИтого,	БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ВыборкаДетали.СтавкаНДСИзЖДН), Истина, Истина);
				СтрокаРасходов.СуммаНДС 				= ВыборкаДетали.СуммаНДСИзЖДН;
				СтрокаРасходов.СуммаИтого 				= СтрокаРасходов.СебестоимостьИтого + ?(Истина, 0, СтрокаРасходов.СуммаНДС);
			КонецЕсли; 
			МассивИсточниковСПустойНоменклатурой = Новый Массив;
			МассивИсточниковСПустойНоменклатурой.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ОсновнаяУслугаАвтоматически);
			МассивИсточниковСПустойНоменклатурой.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДНВозврата);
			МассивИсточниковСПустойНоменклатурой.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДНПодсылаВагонов);
			МассивИсточниковСПустойНоменклатурой.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДНПодсылаКТК);
			МассивИсточниковСПустойНоменклатурой.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ПорожняяЖДН);
			//Евросиб - АСуслов 15.11.2023 11:41:01 #76851
			//(
			//Документы.Сделка.СвязатьДоходыРасходыСУЕ(Сделка,,
			//СтрокаРасходов.ГУИД,
			//СтрокаРасходов.СтрокаСвязьУчетныхЕдиниц,
			//?(МассивИсточниковСПустойНоменклатурой.Найти(СтрокаРасходов.ИсточникПоявленияСтрокиЭкономики_Старая) <> Неопределено, Неопределено, СтрокаРасходов.Услуга));
			//)
			//Евросиб - АСуслов 15.11.2023 11:41:04 #76851
			//по ждн подсыла ктк будем добавлять вагон здесь, т.к. вагон берется не из состава поезда, а из накладной
			Если ВыборкаДетали.ИсточникПоявленияСтрокиЭкономики_Старая = Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДНПодсылаКТК Тогда
				СтрокаДоходыВагоны = ДоходыВагоны.Найти(СтрокаРасходов.ГУИД, "ГУИД");
				Если СтрокаДоходыВагоны = Неопределено Тогда
					СтрокаДоходыВагоны = ДоходыВагоны.Добавить();
				КонецЕсли; 
				СтрокаДоходыВагоны.ГУИД = СтрокаРасходов.ГУИД;
				СтрокаДоходыВагоны.Вагон = ВыборкаДетали.СписокВагонов;
				СтрокаРасходов.Вагон = ВыборкаДетали.СписокВагонов;
			КонецЕсли; 
			//по ждн возврата ктк будем добавлять здесь, т.к. ктк берется из накладной
			Если ВыборкаДетали.ИсточникПоявленияСтрокиЭкономики_Старая = Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДНВозврата Тогда
				СтрокаДоходыКТК = ДоходыКТК.Найти(СтрокаРасходов.ГУИД, "ГУИД");
				Если СтрокаДоходыКТК = Неопределено Тогда
					СтрокаДоходыКТК = ДоходыКТК.Добавить();
				КонецЕсли; 
				СтрокаДоходыКТК.ГУИД = СтрокаРасходов.ГУИД;
				СтрокаДоходыКТК.КТК = ВыборкаДетали.СписокКТК;
				СтрокаРасходов.Контейнер = ВыборкаДетали.СписокКТК;
			КонецЕсли; 
			//Если ВыборкаДетали.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ПорожняяЖДН Тогда
			//	ЗаполнитьЗначенияСвойств(нСтрока, ВыборкаДетали);
			//КонецЕсли;
			//Если ВыборкаДетали.ЕстьПодсыл Тогда
			//	СтрокаРасходовПодсыл = Расходы.Добавить();
			//	ЗаполнитьЗначенияСвойств(СтрокаРасходовПодсыл, СтрокаРасходов,,"ГУИД");
			//	СтрокаРасходовПодсыл.Подсыл = Истина;
			//	СтрокаРасходовПодсыл.ГУИД = Новый УникальныйИдентификатор;
			//КонецЕсли; 
			Если ВыборкаДетали.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.вагон Тогда
				МассивКалькуляцийСоСтавкойЗаВагон.Добавить(ВыборкаДетали.Калькуляция);
			КонецЕсли; 
		КонецЦикла; 
		//КонецЕсли; 
		//КонецЦикла;
		УдалитьСтрокиРасходов_СтарыйАлгоритм(Сделка, МассивСтрокДляУдаления, Истина, Истина, Ложь);
		Документы.Сделка.ЗаполнитьСсылкиНаВагоны_КТК_ТД_ВРасходах(Сделка);
		ЗаписатьВагоныКТКТДВТЧ(Сделка);
		
		//процедура переключает активность групповых услуг в зависимости от наличия возвратных ждн
		ОтработатьАктивностьСтрокРасходов(Сделка);
		//для вагонных накладных "ЖДНВозврата" и "ПорожняяЖДН" нужно отключить лишние строчки по КТК
		ОтключитьДублиВагонныхУслуг_СтарыйАлгоритм(Сделка, МассивПТУДляОтвязки);
		
		//УстановитьПривилегированныйРежим(Истина);
		//ТаблицаРассылки = Новый ТаблицаЗначений;
		//ТаблицаРассылки = Новый ТаблицаЗначений;
		//ТаблицаРассылки.Колонки.Добавить("Сделка");
		//ТаблицаРассылки.Колонки.Добавить("ГУИД");
		//ТаблицаРассылки.Колонки.Добавить("ГУИДАкцепт");
		//ТаблицаРассылки.Колонки.Добавить("Калькуляция");
		//ТаблицаРассылки.Колонки.Добавить("Номенклатура");
		//ТаблицаРассылки.Колонки.Добавить("Вагон");
		//ТаблицаРассылки.Колонки.Добавить("КТК");
		//ТаблицаРассылки.Колонки.Добавить("ТД");
		//ТаблицаРассылки.Колонки.Добавить("ПТУ");
		//НужноОтправлятьПисьмо = Ложь;
		//Для каждого ПТУДляОтвязки Из МассивПТУДляОтвязки Цикл
		//	обАкцепт = Документы.Акцепт.НайтиСоздатьАктуальныйАкцепт(ПТУДляОтвязки,Ложь);
		//	АкцептИзменен = Ложь;
		//	СтрокиУслуг = ТаблицаСтрокДляОтвязкиАкцептов.НайтиСтроки(Новый Структура("УчДокумент", ПТУДляОтвязки));
		//	Для каждого СтрокаУслуг из СтрокиУслуг Цикл
		//		СтрокиАкцепта = обАкцепт.Услуги.НайтиСтроки(Новый Структура("ИдентификаторСтрокиРасходовВСделке", СтрокаУслуг.ГУИД));
		//		Для каждого Стр Из СтрокиАкцепта Цикл
		//			АкцептИзменен = Истина;
		//			
		//			СтрокаРассылки = ТаблицаРассылки.Добавить();
		//			СтрокаРассылки.Сделка = Ссылка;
		//			СтрокаРассылки.ГУИД = СтрокаУслуг.ГУИД;
		//			СтрокаРассылки.ГУИДАкцепт = Стр.ИдентификаторСтрокиПоступления;
		//			СтрокаРассылки.Калькуляция = СтрокаУслуг.Калькуляция;
		//			СтрокаРассылки.Номенклатура = СтрокаУслуг.Услуга;
		//			СтрокаРассылки.ПТУ = ПТУДляОтвязки;
		//			СтрокаРассылки.Вагон = ?(ЗначениеЗаполнено(Стр.Вагон),ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Вагон,"Наименование"),"");
		//			СтрокаРассылки.КТК = ?(ЗначениеЗаполнено(Стр.Контейнер),ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Контейнер,"Наименование"),"");
		//			СтрокаРассылки.ТД = ?(ЗначениеЗаполнено(Стр.ТранспортныйДокумент),ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.ТранспортныйДокумент,"НомерТранспортногоДокумента"),"");
		//			
		//			//Стр.ИдентификаторСтрокиРасходовВСделке = неопределено;
		//			//Стр.Сделка = неопределено;
		//			//Стр.ПолностьюРазнесено = Ложь;
		//			//Стр.НоменклатурнаяГруппа = Неопределено;
		//			//Стр.СделкаСумма = 0;
		//			//Стр.СделкаСтавкаНДС = Неопределено;
		//			//Стр.СделкаСуммаНДС = 0;
		//			//Стр.НоменклатураСделки = Неопределено;
		//			//Стр.ВидРасходов = Неопределено;
		//			//Стр.Сумма = 0;
		//			//Стр.СуммаНДС = 0;
		//			//Стр.УчДокумент = Неопределено;
		//			//Стр.Количество = 0;
		//			//Стр.Цена = 0;
		//			//Стр.ПривязалПользователь = Неопределено;
		//			
		//		КонецЦикла;
		//		
		//	КонецЦикла; 
		//	Если АкцептИзменен Тогда
		//		//обАкцепт.ДополнительныеСвойства.Вставить("ЗаписьИзСделки");
		//		НужноОтправлятьПисьмо = Истина;
		//		//обАкцепт.Записать();
		//	КонецЕсли; 
		//КонецЦикла;
		//УстановитьПривилегированныйРежим(Ложь);
		//Если НужноОтправлятьПисьмо Тогда
		//	Попытка
		//		ОтправитьПисьмоОповещениеОбОтвязкеАкцепта(ТаблицаРассылки);
		//	Исключение
		//		ТекстОшибки = ОписаниеОшибки();
		//	КонецПопытки; 
		//КонецЕсли; 
		Если Не Сделка.ПодсылПорожних Тогда //Евросиб Гудкова( 04.12.2020
			ВключитьВДоходыРасходыУслугиНевключенныеВСтавку_СтарыйАлгоритм(Сделка);
		КонецЕсли; // Евросиб Гудкова) 	
	КонецЕсли;
	ДополнитьПомеченныеРасходыПлановойЦенойИзЖДН(Сделка);
	
	//Евросиб - АСуслов 04.01.2021 13:42:37 #
	//(
	//Перезаполнить данные доходов по ВР.
	//ИзменитьДанныеДоходовПоРасходам();
	//жизнь течет, все меняется, вот и расходы по доходам надо заполнять 
	//Евросиб - АСуслов 29.07.2022 17:59:19 #55052
	//(
	ПривязатьРасходыСУслугойНаДоходыПоОсновнойУслуге(Сделка);
	//)
	//Евросиб - АСуслов 29.07.2022 17:59:24 #55052
	ИзменитьДанныеРасходовПоДоходам(Сделка);
	//)
	//Евросиб - АСуслов 04.01.2021 13:42:37 #
	
	//ДополнитьЭкономикуДаннымиПодсыловПоЖДН();
	
КонецПроцедуры

Процедура ВключитьВДоходыРасходыУслугиНевключенныеВСтавку_СтарыйАлгоритм(Сделка)
	
	Расходы = Сделка.Расходы;
	
	СтрокиРасходовДопУслуг = Расходы.НайтиСтроки(Новый Структура("ИсточникПоявленияСтрокиЭкономики_Старая", Перечисления.ИсточникПоявленияСтрокиЭкономики.ДопУслугаАвтоматически));
	УслугаФрахта = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("УслугаФрахтаДляКалькуляции");
	Для каждого СтрокаРасходаДопУслуг Из СтрокиРасходовДопУслуг Цикл
		Если СтрокаРасходаДопУслуг.Услуга = УслугаФрахта Тогда
			Продолжить;
		КонецЕсли;
		СтрокаРасходаДопУслуг.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ДопУслугаАвтоматически;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.Клиент КАК Клиент,
	|	СделкаСвязьУчетныхЕдиниц.Договор КАК Договор,
	|	СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция,
	|	СделкаСвязьУчетныхЕдиниц.РазмерКТК КАК РазмерКТК,
	|	СУММА(1) КАК Количество,
	|	СделкаСвязьУчетныхЕдиниц.Груз КАК Груз,
	|	СделкаСвязьУчетныхЕдиниц.Заявка.ПСЦ КАК ПСЦ,
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК СтрокаСУЕ,
	|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	|	СделкаСвязьУчетныхЕдиниц.Вагон КАК Вагон,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН КАК ЖДН,
	|	ЕСТЬNULL(ФормированиеФинДокументов.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно, ЛОЖЬ) КАК ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно
	|ПОМЕСТИТЬ ВТ_Отбор
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФормированиеФинДокументов КАК ФормированиеФинДокументов
	|		ПО СделкаСвязьУчетныхЕдиниц.Клиент = ФормированиеФинДокументов.Контрагент
	|			И (СделкаСвязьУчетныхЕдиниц.Калькуляция.ПС_ВидПеревозки = ФормированиеФинДокументов.ВидПеревозки
	|				ИЛИ ФормированиеФинДокументов.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ПустаяСсылка))
	|ГДЕ
	|	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
	|	И НЕ СделкаСвязьУчетныхЕдиниц.Удалена
	|	И НЕ СделкаСвязьУчетныхЕдиниц.НеАктивна
	|
	|СГРУППИРОВАТЬ ПО
	|	СделкаСвязьУчетныхЕдиниц.Клиент,
	|	СделкаСвязьУчетныхЕдиниц.Договор,
	|	СделкаСвязьУчетныхЕдиниц.Калькуляция,
	|	СделкаСвязьУчетныхЕдиниц.РазмерКТК,
	|	СделкаСвязьУчетныхЕдиниц.Груз,
	|	СделкаСвязьУчетныхЕдиниц.Заявка.ПСЦ,
	|	СделкаСвязьУчетныхЕдиниц.ГУИД,
	|	СделкаСвязьУчетныхЕдиниц.Контейнер,
	|	СделкаСвязьУчетныхЕдиниц.Вагон,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН,
	|	ЕСТЬNULL(ФормированиеФинДокументов.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно, ЛОЖЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЧРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	|	ТЧРасходы.СтрокаКалькуляции КАК СтрокаКалькуляции,
	|	ТЧРасходы.Услуга КАК Услуга,
	|	ТЧРасходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	|	ТЧРасходы.ГУИД КАК ГУИД,
	|	ТЧРасходы.ПунктОтправления КАК ПунктОтправления,
	|	ТЧРасходы.ПунктНазначения КАК ПунктНазначения,
	|	ТЧРасходы.Поставщик КАК Поставщик,
	|	ТЧРасходы.Договор КАК Договор,
	|	ТЧРасходы.Валюта КАК Валюта,
	|	ТЧРасходы.Себестоимость КАК Себестоимость
	|ПОМЕСТИТЬ ВТ_Расходы
	|ИЗ
	|	&ТЧРасходы КАК ТЧРасходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КалькуляцияЖД_УслугиВнеСтавки.Услуга КАК Услуга,
	|	ВТ_Отбор.Клиент КАК Клиент,
	|	ВТ_Отбор.Договор КАК ДоговорКлиента,
	|	ВЫБОР
	|		КОГДА ВТ_Отбор.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|			ТОГДА КалькуляцияЖД_УслугиВнеСтавки.Себестоимость20
	|		ИНАЧЕ КалькуляцияЖД_УслугиВнеСтавки.Себестоимость40
	|	КОНЕЦ КАК Себестоимость,
	|	ВЫБОР
	|		КОГДА ВТ_Отбор.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|			ТОГДА КалькуляцияЖД_УслугиВнеСтавки.Вознаграждение20
	|		ИНАЧЕ КалькуляцияЖД_УслугиВнеСтавки.Вознаграждение40
	|	КОНЕЦ КАК Вознаграждение,
	|	КалькуляцияЖД_УслугиВнеСтавки.Ссылка КАК Калькуляция,
	|	ИСТИНА КАК НеВыставлятьКлиенту,
	|	КалькуляцияЖД_УслугиВнеСтавки.ТипСтавки КАК ТипСтавки,
	|	ВЫБОР
	|		КОГДА КалькуляцияЖД_УслугиВнеСтавки.ТипСтавки = ЗНАЧЕНИЕ(Перечисление.ТипыСтавокПротокола.Ставка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Перевыставляемая,
	|	КалькуляцияЖД_УслугиВнеСтавки.Поставщик КАК Поставщик,
	|	КалькуляцияЖД_УслугиВнеСтавки.Договор КАК Договор,
	|	КалькуляцияЖД_УслугиВнеСтавки.ПроцентВознаграждения КАК ПроцентВознаграждения,
	|	КалькуляцияЖД_УслугиВнеСтавки.СтавкаНДСВознаграждения КАК СтавкаНДСВознаграждения,
	|	КалькуляцияЖД_УслугиВнеСтавки.ВознаграждениеВключаетНДС КАК ВознаграждениеВключаетНДС,
	|	КалькуляцияЖД_УслугиВнеСтавки.СтавкаНДС КАК СтавкаНДС,
	|	КалькуляцияЖД_УслугиВнеСтавки.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	КалькуляцияЖД_УслугиВнеСтавки.Валюта КАК Валюта,
	|	ВТ_Отбор.Количество КАК Количество,
	|	ВТ_Отбор.РазмерКТК КАК РазмерКТК,
	|	ВТ_Отбор.Груз КАК Груз,
	|	ВТ_Отбор.ПСЦ КАК ПСЦ,
	|	КалькуляцияЖД_УслугиВнеСтавки.ПлановаяСтоимостьИзЖДН КАК ПлановаяСтоимостьИзЖДН,
	|	ИСТИНА КАК УслугаВнеСтавки,
	|	ВТ_Отбор.СтрокаСУЕ КАК СтрокаСУЕ,
	|	ВТ_Отбор.Контейнер КАК Контейнер,
	|	ВТ_Отбор.Вагон КАК Вагон,
	|	ВТ_Отбор.ЖДН КАК ЖДН,
	|	ВТ_Отбор.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно КАК ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно,
	|	КалькуляцияЖД_УслугиВнеСтавки.ПунктОтправления КАК ПунктОтправления,
	|	КалькуляцияЖД_УслугиВнеСтавки.ПунктНазначения КАК ПунктНазначения,
	|	ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ДопУслугаАвтоматически) КАК ИсточникПоявленияСтрокиЭкономики,
	|	КалькуляцияЖД_УслугиВнеСтавки.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ВТ_РасходыВнеСтавки
	|ИЗ
	|	ВТ_Отбор КАК ВТ_Отбор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция.ЖД_УслугиВнеСтавки КАК КалькуляцияЖД_УслугиВнеСтавки
	|		ПО ВТ_Отбор.Калькуляция = КалькуляцияЖД_УслугиВнеСтавки.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РасходыВнеСтавки.Услуга КАК Услуга,
	|	ВТ_РасходыВнеСтавки.Клиент КАК Клиент,
	|	ВТ_РасходыВнеСтавки.ДоговорКлиента КАК ДоговорКлиента,
	|	ВТ_РасходыВнеСтавки.Себестоимость КАК Себестоимость,
	|	ВТ_РасходыВнеСтавки.Вознаграждение КАК Вознаграждение,
	|	ВТ_РасходыВнеСтавки.Калькуляция КАК Калькуляция,
	|	ВТ_РасходыВнеСтавки.НеВыставлятьКлиенту КАК НеВыставлятьКлиенту,
	|	ВТ_РасходыВнеСтавки.ТипСтавки КАК ТипСтавки,
	|	ВТ_РасходыВнеСтавки.Перевыставляемая КАК Перевыставляемая,
	|	ВТ_РасходыВнеСтавки.Поставщик КАК Поставщик,
	|	ВТ_РасходыВнеСтавки.Договор КАК Договор,
	|	ВТ_РасходыВнеСтавки.ПроцентВознаграждения КАК ПроцентВознаграждения,
	|	ВТ_РасходыВнеСтавки.СтавкаНДСВознаграждения КАК СтавкаНДСВознаграждения,
	|	ВТ_РасходыВнеСтавки.ВознаграждениеВключаетНДС КАК ВознаграждениеВключаетНДС,
	|	ВТ_РасходыВнеСтавки.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_РасходыВнеСтавки.СуммаВключаетНДС КАК НДСВключенВСтоимость,
	|	ВТ_РасходыВнеСтавки.Валюта КАК Валюта,
	|	ВТ_РасходыВнеСтавки.Количество КАК Количество,
	|	ВТ_РасходыВнеСтавки.РазмерКТК КАК РазмерКТК,
	|	ВТ_РасходыВнеСтавки.Груз КАК Груз,
	|	ВТ_РасходыВнеСтавки.ПСЦ КАК ПСЦ,
	|	ВТ_РасходыВнеСтавки.ПлановаяСтоимостьИзЖДН КАК ПлановаяСтоимостьИзЖДН,
	|	ВТ_РасходыВнеСтавки.УслугаВнеСтавки КАК УслугаВнеСтавки,
	|	ВТ_РасходыВнеСтавки.СтрокаСУЕ КАК СтрокаСУЕ,
	|	ВТ_РасходыВнеСтавки.Контейнер КАК Контейнер,
	|	ВТ_РасходыВнеСтавки.Вагон КАК Вагон,
	|	ВТ_РасходыВнеСтавки.ЖДН КАК ЖДН,
	|	ВТ_РасходыВнеСтавки.ЖДН КАК ТранспортныйДокумент,
	|	ВТ_РасходыВнеСтавки.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно КАК ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно,
	|	ВТ_РасходыВнеСтавки.ПунктОтправления КАК ПунктОтправления,
	|	ВТ_РасходыВнеСтавки.ПунктНазначения КАК ПунктНазначения,
	|	ВТ_РасходыВнеСтавки.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики_Старая,
	|	ВТ_РасходыВнеСтавки.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	|	ВТ_РасходыВнеСтавки.ИдентификаторСтроки КАК СтрокаКалькуляции,
	|	СделкаРасходы.ГУИД КАК ГУИД
	|ИЗ
	|	ВТ_РасходыВнеСтавки КАК ВТ_РасходыВнеСтавки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Расходы КАК СделкаРасходы
	|		ПО ВТ_РасходыВнеСтавки.Услуга = СделкаРасходы.Услуга
	|			И ВТ_РасходыВнеСтавки.СтрокаСУЕ = СделкаРасходы.СтрокаСвязьУчетныхЕдиниц
	|			И ВТ_РасходыВнеСтавки.ИсточникПоявленияСтрокиЭкономики = СделкаРасходы.ИсточникПоявленияСтрокиЭкономики
	|			И ВТ_РасходыВнеСтавки.ПунктОтправления = СделкаРасходы.ПунктОтправления
	|			И ВТ_РасходыВнеСтавки.ПунктНазначения = СделкаРасходы.ПунктНазначения
	|			И ВТ_РасходыВнеСтавки.Поставщик = СделкаРасходы.Поставщик
	|			И ВТ_РасходыВнеСтавки.Договор = СделкаРасходы.Договор
	|			И ВТ_РасходыВнеСтавки.Валюта = СделкаРасходы.Валюта
	//|			И ВТ_РасходыВнеСтавки.Себестоимость = СделкаРасходы.Себестоимость //ДИТ, Беляев СЮ, ТА54360, 06-07-2022, закомментировал
	|ГДЕ
	|	(СделкаРасходы.СтрокаСвязьУчетныхЕдиниц ЕСТЬ NULL
	|			ИЛИ СделкаРасходы.СтрокаКалькуляции = """")
	|ИТОГИ
	|	МАКСИМУМ(ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно)
	|ПО
	|	ПСЦ";
	//|ГДЕ
	//|	ВТ_Отбор.Договор В(&Договор)";
	Запрос.УстановитьПараметр("Ссылка", Сделка.Ссылка);
	Запрос.УстановитьПараметр("ТЧРасходы", Расходы.Выгрузить(,"СтрокаСвязьУчетныхЕдиниц, СтрокаКалькуляции, Услуга, ИсточникПоявленияСтрокиЭкономики, ГУИД, ПунктОтправления, ПунктНазначения, Поставщик, Договор, Валюта, Себестоимость"));
	//Евросиб Каблов 09.04.2025 ( #105407 Не используется
	//ГлобальныйОткрытыйПериод = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Сделка.Организация);
	//Евросиб Каблов 09.04.2025 )
	//Запрос.УстановитьПараметр("Договор", СписокГотовыхКОформлениюДоговоров.Выгрузить(,"Договор").ВыгрузитьКолонку("Договор"));
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаПСЦ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПСЦ.Следующий() Цикл
		Выборка = ВыборкаПСЦ.Выбрать();
		МассивКТК = Новый Массив;
		МассивВагоны = Новый Массив;
		МассивТД = Новый Массив;
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.ГУИД) Тогда
				нСтрокаРасход = Расходы.Найти(Выборка.ГУИД, "ГУИД");
			Иначе 
				ИдентификаторДоходов = Строка(Новый УникальныйИдентификатор);
				ИдентификаторРасходов = Строка(Новый УникальныйИдентификатор);
				нСтрокаРасход = Расходы.Добавить();
				нСтрокаРасход.ГУИД = ИдентификаторРасходов;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(нСтрокаРасход, Выборка,,"ГУИД");
			нСтрокаРасход.НоменклатурнаяГруппа = РазнесениеЗатратСервер.ПодобратьНоменклатурнуюГруппуПоНаборуПараметров(Сделка.ТипЗаказа, Выборка.Вагон);
			нСтрокаРасход.НеВключатьВПлановыеРасходы = Истина;
			нСтрокаРасход.Договор = Выборка.Договор;
			нСтрокаРасход.СтрокаСвязьУчетныхЕдиниц = Выборка.СтрокаСУЕ;
			нСтрокаРасход.СебестоимостьИтого	= нСтрокаРасход.Себестоимость * нСтрокаРасход.Количество;
			нСтрокаРасход.СуммаНДС 				= БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(нСтрокаРасход.СебестоимостьИтого, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(нСтрокаРасход.СтавкаНДС), Истина, нСтрокаРасход.НДСВключенВСтоимость);
			нСтрокаРасход.СуммаИтого 			= нСтрокаРасход.СебестоимостьИтого + ?(нСтрокаРасход.НДСВключенВСтоимость, 0, нСтрокаРасход.СуммаНДС);
			нСтрокаРасход.ИсточникПоявленияСтрокиЭкономики_Старая = Перечисления.ИсточникПоявленияСтрокиЭкономики.ДопУслугаАвтоматически;
			Документы.Сделка.СвязатьДоходыРасходыСУЕ(Сделка,,ИдентификаторРасходов,Выборка.СтрокаСУЕ, Выборка.Услуга);
			
			//Если Выборка.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно Тогда
			//	МассивКТК = Новый Массив;
			//	МассивВагоны = Новый Массив;
			//	МассивТД = Новый Массив;
			//	МассивКТК.Добавить(Выборка.Контейнер);
			//	МассивВагоны.Добавить(Выборка.Вагон);
			//	МассивТД.Добавить(Выборка.ЖДН);
			//	ДобавитьДоходыНевключенныеВСтавку(Выборка, МассивКТК, МассивВагоны, МассивТД);
			//Иначе
			//	МассивКТК.Добавить(Выборка.Контейнер);
			//	МассивВагоны.Добавить(Выборка.Вагон);
			//	МассивТД.Добавить(Выборка.ЖДН);
			//КонецЕсли; 
			
		КонецЦикла;
		//Выборка.Сбросить();
		//Выборка.Следующий();
		//ДобавитьДоходыНевключенныеВСтавку(Выборка, МассивКТК, МассивВагоны, МассивТД);
		
	КонецЦикла;
	
	////найдем все перевыставляемые и заполним доходные суммы
	//ЗаполнитьСуммыДоходовПоПеревыставляемымРасходам();
	
КонецПроцедуры

Процедура УдалитьСтрокиРасходов_СтарыйАлгоритм(Сделка, МассивСтрокКУдалению, ОтключатьУслуги = Истина, ОтвязыватьПривязанные = Ложь, ЗаписыватьАкцепт = Истина) Экспорт
	
	Расходы = Сделка.Расходы;
	Доходы = Сделка.Доходы;
	ДоходыВагоны = Сделка.ДоходыВагоны;
	ДоходыКТК = Сделка.ДоходыКТК;
	ДоходыТД = Сделка.ДоходыТД;
	
	ТаблицаСтрокДляОтвязкиАкцептов = Расходы.Выгрузить(,"УчДокумент, ГУИД, Калькуляция, Услуга");
	ТаблицаСтрокДляОтвязкиАкцептов.Очистить();
	МассивПТУДляОтвязки = Новый Массив;
	МассивУдаляемыхСтрок = Новый Массив;
	МассивУдаляемыхСтрокД = Новый Массив;
	//Евросиб Каблов 17.01.2022 ( Ticket#0246698
	ОтвязываемыеСтроки = Новый Массив;
	//Евросиб Каблов 17.01.2022 )
	Для каждого СтрокаКУдалению Из МассивСтрокКУдалению Цикл
		Если СтрокаКУдалению.ЕстьОтчетКомитенту Тогда
			//сразу нет, если док проведен
			//ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("По строке расходов %1 выставлен отчет комитенту", ТекС.НомерСтроки));
			Продолжить;
		КонецЕсли; 
		Если ЗначениеЗаполнено(СтрокаКУдалению.УчДокумент) Тогда
			Если МассивПТУДляОтвязки.Найти(СтрокаКУдалению.УчДокумент) = Неопределено Тогда
				МассивПТУДляОтвязки.Добавить(СтрокаКУдалению.УчДокумент);
			КонецЕсли; 
			нСтрокаОтвязки = ТаблицаСтрокДляОтвязкиАкцептов.Добавить();
			нСтрокаОтвязки.УчДокумент = СтрокаКУдалению.УчДокумент;
			нСтрокаОтвязки.ГУИД = СтрокаКУдалению.ГУИД;
			нСтрокаОтвязки.Калькуляция = СтрокаКУдалению.Калькуляция;
			нСтрокаОтвязки.Услуга = СтрокаКУдалению.Услуга;
		КонецЕсли;
		//Евросиб Каблов 17.01.2022 ( Ticket#0246698
		УдалитьСтрокуРасходов = Истина;
		//Евросиб Каблов 17.01.2022 )
		НайдСтроки = Сделка.СвязьДоходовИРасходов.НайтиСтроки(Новый Структура("Расходы", СтрокаКУдалению.ГУИД));
		Если СтрокаКУдалению.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта Тогда
			//в этом случае удалим доходы
			Для каждого ТекС Из НайдСтроки Цикл
				
				//Евросиб Каблов 06.07.2021 (
				НайденнаяСтрокаДоходов = Доходы.Найти(ТекС.Доходы, "ГУИД");
				Если НайденнаяСтрокаДоходов <> Неопределено И НайденнаяСтрокаДоходов.ИсточникПоявленияСтрокиЭкономики <> Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта Тогда
					Продолжить;
				КонецЕсли;	
				//Евросиб Каблов 06.07.2021 )
				
				//Евросиб Каблов 17.01.2022 ( Ticket#0246698
				Если НайденнаяСтрокаДоходов <> Неопределено И ЗначениеЗаполнено(НайденнаяСтрокаДоходов.УчДокумент) Тогда					
					УчДокПроведен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НайденнаяСтрокаДоходов.УчДокумент, "Проведен");
					Если УчДокПроведен Тогда
						УдалитьСтрокуРасходов = Ложь;
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				//Евросиб Каблов 17.01.2022 )
				
				НайдСтрокиД = ДоходыВагоны.НайтиСтроки(Новый Структура("ГУИД", ТекС.Доходы));
				Для каждого НайдСтрД из НайдСтрокиД Цикл ДоходыВагоны.Удалить(НайдСтрД); КонецЦикла;
				
				НайдСтрокиД = ДоходыКТК.НайтиСтроки(Новый Структура("ГУИД", ТекС.Доходы));
				Для каждого НайдСтрД из НайдСтрокиД Цикл ДоходыКТК.Удалить(НайдСтрД); КонецЦикла;
				
				НайдСтрокиД = ДоходыТД.НайтиСтроки(Новый Структура("ГУИД", ТекС.Доходы));
				Для каждого НайдСтрД из НайдСтрокиД Цикл ДоходыТД.Удалить(НайдСтрД); КонецЦикла;
				
				МассивУдаляемыхСтрокД.Добавить(Доходы.Найти(ТекС.Доходы, "ГУИД"));
			КонецЦикла;
			Для каждого УдаляемаяСтрока Из МассивУдаляемыхСтрокД Цикл
				Если УдаляемаяСтрока <> Неопределено Тогда
					Доходы.Удалить(УдаляемаяСтрока);
				КонецЕсли; 
			КонецЦикла; 
		КонецЕсли;
		
		//Евросиб Каблов 17.01.2022 ( Ticket#0246698
		Если УдалитьСтрокуРасходов Тогда
		//Евросиб Каблов 17.01.2022 )
			Для каждого НайдСтр из НайдСтроки Цикл 
				НайдСтр.Расходы = "";
			КонецЦикла;
			
			НайдСтроки = Сделка.ДоходыВагоны.НайтиСтроки(Новый Структура("ГУИД", СтрокаКУдалению.ГУИД));
			Для каждого НайдСтр из НайдСтроки Цикл Сделка.ДоходыВагоны.Удалить(НайдСтр); КонецЦикла;
			
			НайдСтроки = ДоходыКТК.НайтиСтроки(Новый Структура("ГУИД", СтрокаКУдалению.ГУИД));
			Для каждого НайдСтр из НайдСтроки Цикл ДоходыКТК.Удалить(НайдСтр); КонецЦикла;
			
			НайдСтроки = ДоходыТД.НайтиСтроки(Новый Структура("ГУИД", СтрокаКУдалению.ГУИД));
			Для каждого НайдСтр из НайдСтроки Цикл ДоходыТД.Удалить(НайдСтр); КонецЦикла;
			МассивУдаляемыхСтрок.Добавить(СтрокаКУдалению);
		//Евросиб Каблов 17.01.2022 ( Ticket#0246698
		Иначе
			ОтвязываемыеСтроки.Добавить(СтрокаКУдалению);
		КонецЕсли;
		//Евросиб Каблов 17.01.2022 )
		
	КонецЦикла;
	Для каждого УдаляемаяСтрока Из МассивУдаляемыхСтрок Цикл
		Если ЗначениеЗаполнено(УдаляемаяСтрока.УчДокумент) И НЕ ОтвязыватьПривязанные Тогда
			Продолжить;
		КонецЕсли; 
		Если ОтключатьУслуги 
			И Не УдаляемаяСтрока.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта Тогда
			УдаляемаяСтрока.УслугаОтключена = Истина;
		Иначе
			Расходы.Удалить(УдаляемаяСтрока);
		КонецЕсли;
	КонецЦикла;
	//Евросиб Каблов 17.01.2022 ( Ticket#0246698
	Для Каждого ОтвязываемаяСтрока Из ОтвязываемыеСтроки Цикл
		ОтвязываемаяСтрока.УчДокумент = Неопределено;
	КонецЦикла;
	//Евросиб Каблов 17.01.2022 )
	
	// Евросиб Фролов (14.04.2022 Task №50195
	Если Не Сделка.ДополнительныеСвойства.Свойство("ЗаписьСвязанныхОбъектов") Тогда
		ЗаписыватьАкцепт = Ложь;
	КонецЕсли;
	// Евросиб Фролов)	
	
	Если Не ЗаписыватьАкцепт Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаРассылки = Новый ТаблицаЗначений;
	ТаблицаРассылки = Новый ТаблицаЗначений;
	ТаблицаРассылки.Колонки.Добавить("Сделка");
	ТаблицаРассылки.Колонки.Добавить("ГУИД");
	ТаблицаРассылки.Колонки.Добавить("ГУИДАкцепт");
	ТаблицаРассылки.Колонки.Добавить("Калькуляция");
	ТаблицаРассылки.Колонки.Добавить("Номенклатура");
	ТаблицаРассылки.Колонки.Добавить("Вагон");
	ТаблицаРассылки.Колонки.Добавить("КТК");
	ТаблицаРассылки.Колонки.Добавить("ТД");
	ТаблицаРассылки.Колонки.Добавить("ПТУ");
	НужноОтправлятьПисьмо = Ложь;	
	Для каждого ПТУДляОтвязки Из МассивПТУДляОтвязки Цикл
		обАкцепт = Документы.Акцепт.НайтиСоздатьАктуальныйАкцепт(ПТУДляОтвязки,Ложь);
		//Субботин 75883 10.10.2023 начало
        ТаблицаДанныхДляОтвязкиАкцепта = Документы.Акцепт.СоставитьТЗДанныхДляОтвязкиАкцепта(обАкцепт.Услуги);
		//Субботин 75883 10.10.2023 Конец 
		АкцептИзменен = Ложь;
		СтрокиУслуг = ТаблицаСтрокДляОтвязкиАкцептов.НайтиСтроки(Новый Структура("УчДокумент", ПТУДляОтвязки));
		Для каждого СтрокаУслуг из СтрокиУслуг Цикл
			СтрокиАкцепта = обАкцепт.Услуги.НайтиСтроки(Новый Структура("ИдентификаторСтрокиРасходовВСделке", СтрокаУслуг.ГУИД));
			Для каждого Стр Из СтрокиАкцепта Цикл
				АкцептИзменен = Истина;
				
				СтрокаРассылки = ТаблицаРассылки.Добавить();
				СтрокаРассылки.Сделка = Сделка.Ссылка;
				СтрокаРассылки.ГУИД = СтрокаУслуг.ГУИД;
				СтрокаРассылки.ГУИДАкцепт = Стр.ИдентификаторСтрокиПоступления;
				СтрокаРассылки.Калькуляция = СтрокаУслуг.Калькуляция;
				СтрокаРассылки.Номенклатура = СтрокаУслуг.Услуга;
				СтрокаРассылки.ПТУ = ПТУДляОтвязки;
				СтрокаРассылки.Вагон = ?(ЗначениеЗаполнено(Стр.Вагон),ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Вагон,"Наименование"),"");
				СтрокаРассылки.КТК = ?(ЗначениеЗаполнено(Стр.Контейнер),ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Контейнер,"Наименование"),"");
				СтрокаРассылки.ТД = ?(ЗначениеЗаполнено(Стр.ТранспортныйДокумент),ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.ТранспортныйДокумент,"НомерТранспортногоДокумента"),"");
				
				Если Не ОтключатьУслуги Тогда //если мы не удаляем услуги, то в акцепте ничего не трогаем
					Если ОтвязыватьПривязанные Тогда //если удаляем, то проверяем режим работы с привязанными строками
						//Евросиб Каблов 17.01.2022 ( Task 41630
						//Стр.ИдентификаторСтрокиРасходовВСделке = неопределено;
						//Стр.Сделка = неопределено;
						//Стр.ПолностьюРазнесено = Ложь;
						//Стр.НоменклатурнаяГруппа = Неопределено;
						//Стр.СделкаСумма = 0;
						//Стр.СделкаСтавкаНДС = Неопределено;
						//Стр.СделкаСуммаНДС = 0;
						//Стр.НоменклатураСделки = Неопределено;
						//Стр.ВидРасходов = Неопределено;
						//Стр.Сумма = 0;
						//Стр.СуммаНДС = 0;
						//Стр.УчДокумент = Неопределено;
						//Стр.Количество = 0;
						//Стр.Цена = 0;
						//Стр.ПривязалПользователь = Неопределено;
						
						//Субботин 75883 10.10.2023 начало
						СтрокаТаблицыДанныхДляОтвязки = ТаблицаДанныхДляОтвязкиАкцепта.НайтиСтроки(Новый Структура("ГУИД", Стр.Гуид));
						//Было
						//Документы.Акцепт.ОтвязатьСтрокуАкцептаОтСделки(Стр, обАкцепт, Перечисления.СобытияОтвязкиПоступления.ЗаписьСделки);
						//Стало
						Документы.Акцепт.ОтвязатьСтрокуАкцептаОтСделки(СтрокаТаблицыДанныхДляОтвязки[0], обАкцепт, Перечисления.СобытияОтвязкиПоступления.ЗаписьСделки);
						ЗаполнитьЗначенияСвойств(Стр, СтрокаТаблицыДанныхДляОтвязки[0]);
						//Субботин 75883 10.10.2023 Конец 
						//Евросиб Каблов 17.01.2022 )
					КонецЕсли; 
				КонецЕсли; 
			КонецЦикла;
		КонецЦикла; 
		Если АкцептИзменен Тогда
			обАкцепт.ДополнительныеСвойства.Вставить("ЗаписьИзСделки");
			НужноОтправлятьПисьмо = Истина;
			Если Не ОтключатьУслуги Тогда
				Если ОтвязыватьПривязанные Тогда
					//Евросиб Каблов 02.12.2021 ( Ticket#0244590
					//обАкцепт.Записать();
					Попытка // Евросиб Фролов (14.04.2022 Task №50195
						обАкцепт.Записать(РежимЗаписиДокумента.Проведение);
					// Евросиб Фролов (14.04.2022 Task №50195	
					Исключение
						ЗаписьЖурналаРегистрации(НСтр("ru = 'Отвязка строк акцепта от сделки'", Метаданные.ОсновнойЯзык.КодЯзыка),
											УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.Акцепт, обАкцепт, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
							
						ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось отвязать строки акцепта №%1 от %2 от сделки.
                                                         |Ошибка: %3'"),
															обАкцепт.Номер,
															обАкцепт.Дата,
															КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));				
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, обАкцепт);				
					КонецПопытки;
					// Евросиб Фролов)							
					//Евросиб Каблов 02.12.2021 )
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры


Процедура ЗаполнитьРасходы(Сделка) Экспорт
	//ЗаполнитьГУИДыСУЕ
	Для каждого СтрокаСУЕ Из Сделка.СвязьУчетныхЕдиниц Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаСУЕ.ГУИД) Тогда
			СтрокаСУЕ.ГУИД = Новый УникальныйИдентификатор;
		КонецЕсли; 
	КонецЦикла;                          

    //Евросиб - АСуслов 26.12.2022 17:45:58 #58550
	//(
	Если Сделка.НеЗаполнятьРасходы = Ложь Тогда
	//)
	//Евросиб - АСуслов 26.12.2022 17:46:00 #58550
		МассивПТУДляОтвязки = Новый Массив;
		МассивСтрокДляУдаления = Новый Массив;
		ТЗПорожнихЖДН = Новый ТаблицаЗначений;
		ТЗПорожнихЖДН.Колонки.Добавить("СписокТД");
		ТЗПорожнихЖДН.Колонки.Добавить("СписокВагонов");
		
		ВремТаблицаРасходов = Сделка.Расходы.Выгрузить();
		//ВремТаблицаРасходов.Колонки.Добавить("ВагонЗаполненИзЖДН", Новый ОписаниеТипов("Булево"));
		//ВремТаблицаРасходов.Колонки.Добавить("СтанцияОтправленияЗаполненИзЖДН", Новый ОписаниеТипов("Булево"));
		//ВремТаблицаРасходов.Колонки.Добавить("СтанцияНазначенияЗаполненИзЖДН", Новый ОписаниеТипов("Булево"));
		//ВремТаблицаРасходов.Колонки.Добавить("ЗаполнятьВагонИзЖДН", Новый ОписаниеТипов("Булево"));
		ВремТаблицаРасходов.Колонки.Добавить("ЗаполнятьСтанциюОтправленияИзЖДН", Новый ОписаниеТипов("Булево"));
		ВремТаблицаРасходов.Колонки.Добавить("ЗаполнятьСтанциюНазначенияИзЖДН", Новый ОписаниеТипов("Булево"));
		ВремТаблицаРасходов.Колонки.Добавить("КлючАналитикиСтрокиКалькуляции", Новый ОписаниеТипов("СправочникСсылка.КлючиАналитикиСтрокКалькуляции"));
		ВремТаблицаРасходов.Очистить();
		ВремТаблицаРасходов.Индексы.Добавить("ГУИД"); 
		
		МассивОбработанныхСтрок = Новый Массив;
		
		ЗаполнитьРасходыПоКалькуляциям(ВремТаблицаРасходов, Сделка, МассивОбработанныхСтрок);
		ЗаполнитьРасходыУслугамиНевключеннымиВСтавку(ВремТаблицаРасходов, Сделка, МассивОбработанныхСтрок);
		ЗаполнитьРасходыПоЖДН(ВремТаблицаРасходов, Сделка, МассивОбработанныхСтрок);
		ОбработатьТаблицуРасходов(ВремТаблицаРасходов, Сделка, МассивОбработанныхСтрок);
		
		//ЗаполнитьРасходыПоЖДН(ТаблицаРасходов, Сделка);
		
		
		
		//Сделка.УдалитьСтрокиРасходов(МассивСтрокДляУдаления, Истина, Истина, Ложь);
		
		
		//Евросиб - АСуслов 31.03.2022 11:18:18 #
		//( ОТКЛЮЧИЛ!!!
		//Документы.Сделка.ЗаполнитьСсылкиНаВагоны_КТК_ТД_ВРасходах(Сделка);
		//ЗаписатьВагоныКТКТДВТЧ(Сделка);
		//)
		//Евросиб - АСуслов 31.03.2022 11:18:19 #
		
		//процедура переключает активность групповых услуг в зависимости от наличия возвратных ждн
		ОтработатьАктивностьСтрокРасходов(Сделка);
		//для вагонных накладных "ЖДНВозврата" и "ПорожняяЖДН" нужно отключить лишние строчки по КТК
		//ОтключитьДублиВагонныхУслуг(Сделка, МассивПТУДляОтвязки);
	КонецЕсли;
	
	//ДИТ, Беляев СЮ, US 66796 / TA 73519, 09-08-2023, начало
	//ОтключитьРасходыДобавленныеИзАкцепта(Сделка);
	//ДИТ, Беляев СЮ, US 66796 / TA 73519, 09-08-2023, конец
	//ДИТ, Беляев СЮ, US 54854/TA 76187, 19-10-2023, начало
	ОтключитьРасходыДобавленныеИзАкцептаИПроизвольныеУслуги(Сделка);
	//ДИТ, Беляев СЮ, US 54854/TA 76187, 19-10-2023, конец
	
	//Евросиб - АСуслов 17.10.2023 11:53:31 #76119
	//(
	//ДополнитьПомеченныеРасходыПлановойЦенойИзЖДН(Сделка);
	//)
	//Евросиб - АСуслов 17.10.2023 11:53:37 #76119
	
	//Евросиб - АСуслов 04.01.2021 13:42:37 #
	//(
	//Перезаполнить данные доходов по ВР.
	//ИзменитьДанныеДоходовПоРасходам();
	//жизнь течет, все меняется, вот и расходы по доходам надо заполнять 
	//Евросиб - АСуслов 29.07.2022 17:57:56 #55052
	//(
	ПривязатьРасходыСУслугойНаДоходыПоОсновнойУслуге(Сделка);
	//)
	//Евросиб - АСуслов 29.07.2022 17:58:15 #55052
	ИзменитьДанныеРасходовПоДоходам(Сделка);
	//)
	//Евросиб - АСуслов 04.01.2021 13:42:37 #
	
	//ДополнитьЭкономикуДаннымиПодсыловПоЖДН();
	
КонецПроцедуры  

//ДИТ, Беляев СЮ, US 66796 / TA 73519, 09-08-2023, начало
//Процедура ОтключитьРасходыДобавленныеИзАкцепта(Сделка)
//ДИТ, Беляев СЮ, US 54854/TA 76187, 19-10-2023, переименовал процедуру
Процедура ОтключитьРасходыДобавленныеИзАкцептаИПроизвольныеУслуги(Сделка)
	Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	//|	СделкаСвязьУчетныхЕдиниц.Удалена
	//|		ИЛИ СделкаСвязьУчетныхЕдиниц.НеАктивна КАК СтрокаОтключена,
	//|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	//|	СделкаСвязьУчетныхЕдиниц.Вагон КАК Вагон
	//|ПОМЕСТИТЬ ВТ_СделкаСвязьУчетныхЕдиницБезОтбора
	//|ИЗ
	//|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	//|	СделкаРасходы.ГУИД КАК ГУИД,
	//|	СделкаРасходы.Контейнер КАК Контейнер,
	//|	СделкаРасходы.Вагон КАК Вагон
	////ДИТ, Беляев СЮ, US 54854/TA 76187, 19-10-2023, начало
	//|	,СделкаРасходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики
	////ДИТ, Беляев СЮ, US 54854/TA 76187, 19-10-2023, конец
	//|ПОМЕСТИТЬ ВТ_Расходы
	//|ИЗ
	//|	Документ.Сделка.Расходы КАК СделкаРасходы
	//|ГДЕ
	//|	НЕ СделкаРасходы.УслугаОтключена
	//|	И (СделкаРасходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта)
	////ДИТ, Беляев СЮ, US 54854/TA 76187, 19-10-2023, начало
	//|     ИЛИ СделкаРасходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ПроизвольнаяУслугаВручную))
	////ДИТ, Беляев СЮ, US 54854/TA 76187, 19-10-2023, конец
	//|	И СделкаРасходы.СтрокаСвязьУчетныхЕдиниц <> """"
	//|;
	//|
	////Евросиб Каблов 06.10.2023 ( Ticket#0327386
	////|////////////////////////////////////////////////////////////////////////////////
	////|ВЫБРАТЬ
	////|	ВТ_Расходы.ГУИД КАК ГУИД,
	////|	ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	////|	ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.СтрокаОтключена КАК СтрокаСУЕОтключена
	////|ИЗ
	////|	ВТ_Расходы КАК ВТ_Расходы
	////|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СделкаСвязьУчетныхЕдиницБезОтбора КАК ВТ_СделкаСвязьУчетныхЕдиницБезОтбора
	////|		ПО ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц = ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.ГУИД
	////|ГДЕ
	////|	(ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.ГУИД ЕСТЬ NULL
	////|			ИЛИ ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.СтрокаОтключена
	////|			ИЛИ ВЫБОР
	////|				КОГДА &ПовагонныеОтправки
	////|					ТОГДА ВЫБОР
	////|							КОГДА ВТ_Расходы.Вагон = ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)
	////|								ТОГДА ЛОЖЬ
	////|							ИНАЧЕ ВТ_Расходы.Вагон <> ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.Вагон
	////|						КОНЕЦ
	////|				ИНАЧЕ ВЫБОР
	////|						КОГДА ВТ_Расходы.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	////|							ТОГДА ЛОЖЬ
	////|						ИНАЧЕ ВТ_Расходы.Контейнер <> ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.Контейнер
	////|					КОНЕЦ
	////|			КОНЕЦ)
	////|;
	////|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Расходы.ГУИД КАК ГУИД,
	//|	ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	//|	ЗНАЧЕНИЕ(Перечисление.ПричиныОтключенияСтрокиРасходовСделки.ОтсутствуетСтрокаСоставаПоезда) КАК ПричинаОтключенияСтроки,
	//|	ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.СтрокаОтключена КАК СтрокаСУЕОтключена
	//|ИЗ
	//|	ВТ_Расходы КАК ВТ_Расходы
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СделкаСвязьУчетныхЕдиницБезОтбора КАК ВТ_СделкаСвязьУчетныхЕдиницБезОтбора
	//|		ПО ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц = ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.ГУИД
	//|ГДЕ
	//|	ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.ГУИД ЕСТЬ NULL
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ВТ_Расходы.ГУИД,
	//|	ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц,
	//|	ЗНАЧЕНИЕ(Перечисление.ПричиныОтключенияСтрокиРасходовСделки.ОтключенаСтрокаСоставаПоезда),
	//|	ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.СтрокаОтключена
	//|ИЗ
	//|	ВТ_Расходы КАК ВТ_Расходы
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СделкаСвязьУчетныхЕдиницБезОтбора КАК ВТ_СделкаСвязьУчетныхЕдиницБезОтбора
	//|		ПО ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц = ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.ГУИД
	//|ГДЕ
	//|	ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.СтрокаОтключена
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ВТ_Расходы.ГУИД,
	//|	ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц,
	//|	ЗНАЧЕНИЕ(Перечисление.ПричиныОтключенияСтрокиРасходовСделки.ОтличаетсяВагонВСтрокеСоставаПоезда),
	//|	ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.СтрокаОтключена
	//|ИЗ
	//|	ВТ_Расходы КАК ВТ_Расходы
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СделкаСвязьУчетныхЕдиницБезОтбора КАК ВТ_СделкаСвязьУчетныхЕдиницБезОтбора
	//|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаПоСсылкеСвязьУчетныхЕдиниц
	//|			ПО ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.ГУИД = СделкаПоСсылкеСвязьУчетныхЕдиниц.ГУИД
	//|				И (СделкаПоСсылкеСвязьУчетныхЕдиниц.Ссылка = &Сделка)
	//|		ПО ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц = ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.ГУИД
	//|ГДЕ
	//|	НЕ ЕСТЬNULL(ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.СтрокаОтключена, ИСТИНА)
	////ДИТ, Беляев СЮ, US 54854/TA 76187, 19-10-2023, начало
	//|   И ВТ_Расходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта)
	////ДИТ, Беляев СЮ, US 54854/TA 76187, 19-10-2023, конец
	//|	И ВЫБОР
	//|			КОГДА &ПовагонныеОтправки
	//|				ТОГДА ВЫБОР
	//|						КОГДА ВТ_Расходы.Вагон = ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)
	//|							ТОГДА ЛОЖЬ
	//|						ИНАЧЕ ВТ_Расходы.Вагон <> ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.Вагон
	//|					КОНЕЦ
	//|		КОНЕЦ
	//|  	И ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.Вагон <> СделкаПоСсылкеСвязьУчетныхЕдиниц.Вагон	
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ВТ_Расходы.ГУИД,
	//|	ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц,
	//|	ЗНАЧЕНИЕ(Перечисление.ПричиныОтключенияСтрокиРасходовСделки.ОтличаетсяКонтейнерВСтрокеСоставаПоезда),
	//|	ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.СтрокаОтключена
	//|ИЗ
	//|	ВТ_Расходы КАК ВТ_Расходы
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СделкаСвязьУчетныхЕдиницБезОтбора КАК ВТ_СделкаСвязьУчетныхЕдиницБезОтбора
	//|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаПоСсылкеСвязьУчетныхЕдиниц
	//|			ПО ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.ГУИД = СделкаПоСсылкеСвязьУчетныхЕдиниц.ГУИД
	//|				И (СделкаПоСсылкеСвязьУчетныхЕдиниц.Ссылка = &Сделка)
	//|		ПО ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц = ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.ГУИД
	//|ГДЕ
	//|	НЕ ЕСТЬNULL(ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.СтрокаОтключена, ИСТИНА)
	////ДИТ, Беляев СЮ, US 54854/TA 76187, 19-10-2023, начало
	//|   И ВТ_Расходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта)
	////ДИТ, Беляев СЮ, US 54854/TA 76187, 19-10-2023, конец
	//|	И ВЫБОР
	//|			КОГДА НЕ &ПовагонныеОтправки
	//|				ТОГДА ВЫБОР
	//|						КОГДА ВТ_Расходы.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	//|							ТОГДА ЛОЖЬ
	//|						ИНАЧЕ ВТ_Расходы.Контейнер <> ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.Контейнер
	//|					КОНЕЦ
	//|		КОНЕЦ
	////Евросиб Каблов 06.10.2023 )
	//|  	И ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.Контейнер <> СделкаПоСсылкеСвязьУчетныхЕдиниц.Контейнер	
	//|";
	//ДИТ, Беляев СЮ, BUG 82454, 16-04-2024, начало
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	|	СделкаСвязьУчетныхЕдиниц.Удалена
	|		ИЛИ СделкаСвязьУчетныхЕдиниц.НеАктивна КАК СтрокаОтключена,
	|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	|	СделкаСвязьУчетныхЕдиниц.Вагон КАК Вагон,
	|	СделкаСвязьУчетныхЕдиниц.ОтключитьРасходы КАК ОтключитьРасходы
	|ПОМЕСТИТЬ ВТ_СделкаСвязьУчетныхЕдиницБезОтбора
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	|	СделкаРасходы.ГУИД КАК ГУИД,
	|	СделкаРасходы.Контейнер КАК Контейнер,
	|	СделкаРасходы.Вагон КАК Вагон,
	|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	|	СделкаРасходы.УслугаОтключена КАК УслугаОтключена
	|ПОМЕСТИТЬ ВТ_РасходыВсе
	|ИЗ
	|	Документ.Сделка.Расходы КАК СделкаРасходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	|	СделкаРасходы.ГУИД КАК ГУИД,
	|	СделкаРасходы.Контейнер КАК Контейнер,
	|	СделкаРасходы.Вагон КАК Вагон,
	|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики
	|ПОМЕСТИТЬ ВТ_РасходыДляОпределенияПричин
	|ИЗ
	|	ВТ_РасходыВсе КАК СделкаРасходы
	|ГДЕ
	|	НЕ СделкаРасходы.УслугаОтключена
	|	И (СделкаРасходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта)
	|			ИЛИ СделкаРасходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ПроизвольнаяУслугаВручную))
	|	И СделкаРасходы.СтрокаСвязьУчетныхЕдиниц <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	|	СделкаРасходы.ГУИД КАК ГУИД,
	|	СделкаРасходы.Контейнер КАК Контейнер,
	|	СделкаРасходы.Вагон КАК Вагон,
	|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики
	|ПОМЕСТИТЬ ВТ_ВСЕРасходыНеОтключенные
	|ИЗ
	|	ВТ_РасходыВсе КАК СделкаРасходы
	|ГДЕ
	|	НЕ СделкаРасходы.УслугаОтключена
	|	И СделкаРасходы.СтрокаСвязьУчетныхЕдиниц <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РасходыДляОпределенияПричин.ГУИД КАК ГУИД,
	|	ВТ_РасходыДляОпределенияПричин.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	|	ЗНАЧЕНИЕ(Перечисление.ПричиныОтключенияСтрокиРасходовСделки.ОтсутствуетСтрокаСоставаПоезда) КАК ПричинаОтключенияСтроки,
	|	ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.СтрокаОтключена КАК СтрокаСУЕОтключена
	|ПОМЕСТИТЬ ВТ_РасходыДляОтключения
	|ИЗ
	|	ВТ_РасходыДляОпределенияПричин КАК ВТ_РасходыДляОпределенияПричин
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СделкаСвязьУчетныхЕдиницБезОтбора КАК ВТ_СделкаСвязьУчетныхЕдиницБезОтбора
	|		ПО ВТ_РасходыДляОпределенияПричин.СтрокаСвязьУчетныхЕдиниц = ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.ГУИД
	|ГДЕ
	|	ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.ГУИД ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_РасходыДляОпределенияПричин.ГУИД,
	|	ВТ_РасходыДляОпределенияПричин.СтрокаСвязьУчетныхЕдиниц,
	|	ЗНАЧЕНИЕ(Перечисление.ПричиныОтключенияСтрокиРасходовСделки.ОтключенаСтрокаСоставаПоезда),
	|	ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.СтрокаОтключена
	|ИЗ
	|	ВТ_РасходыДляОпределенияПричин КАК ВТ_РасходыДляОпределенияПричин
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СделкаСвязьУчетныхЕдиницБезОтбора КАК ВТ_СделкаСвязьУчетныхЕдиницБезОтбора
	|		ПО ВТ_РасходыДляОпределенияПричин.СтрокаСвязьУчетныхЕдиниц = ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.ГУИД
	|ГДЕ
	|	ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.СтрокаОтключена
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_РасходыДляОпределенияПричин.ГУИД,
	|	ВТ_РасходыДляОпределенияПричин.СтрокаСвязьУчетныхЕдиниц,
	|	ЗНАЧЕНИЕ(Перечисление.ПричиныОтключенияСтрокиРасходовСделки.ОтличаетсяВагонВСтрокеСоставаПоезда),
	|	ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.СтрокаОтключена
	|ИЗ
	|	ВТ_РасходыДляОпределенияПричин КАК ВТ_РасходыДляОпределенияПричин
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СделкаСвязьУчетныхЕдиницБезОтбора КАК ВТ_СделкаСвязьУчетныхЕдиницБезОтбора
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаПоСсылкеСвязьУчетныхЕдиниц
	|			ПО ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.ГУИД = СделкаПоСсылкеСвязьУчетныхЕдиниц.ГУИД
	|				И (СделкаПоСсылкеСвязьУчетныхЕдиниц.Ссылка = &Сделка)
	|		ПО ВТ_РасходыДляОпределенияПричин.СтрокаСвязьУчетныхЕдиниц = ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.ГУИД
	|ГДЕ
	|	НЕ ЕСТЬNULL(ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.СтрокаОтключена, ИСТИНА)
	|	И ВТ_РасходыДляОпределенияПричин.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта)
	|	И ВЫБОР
	|			КОГДА &ПовагонныеОтправки
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_РасходыДляОпределенияПричин.Вагон = ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)
	|							ТОГДА ЛОЖЬ
	|						ИНАЧЕ ВТ_РасходыДляОпределенияПричин.Вагон <> ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.Вагон
	|					КОНЕЦ
	|		КОНЕЦ
	|	И ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.Вагон <> СделкаПоСсылкеСвязьУчетныхЕдиниц.Вагон
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_РасходыДляОпределенияПричин.ГУИД,
	|	ВТ_РасходыДляОпределенияПричин.СтрокаСвязьУчетныхЕдиниц,
	|	ЗНАЧЕНИЕ(Перечисление.ПричиныОтключенияСтрокиРасходовСделки.ОтличаетсяКонтейнерВСтрокеСоставаПоезда),
	|	ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.СтрокаОтключена
	|ИЗ
	|	ВТ_РасходыДляОпределенияПричин КАК ВТ_РасходыДляОпределенияПричин
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СделкаСвязьУчетныхЕдиницБезОтбора КАК ВТ_СделкаСвязьУчетныхЕдиницБезОтбора
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаПоСсылкеСвязьУчетныхЕдиниц
	|			ПО ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.ГУИД = СделкаПоСсылкеСвязьУчетныхЕдиниц.ГУИД
	|				И (СделкаПоСсылкеСвязьУчетныхЕдиниц.Ссылка = &Сделка)
	|		ПО ВТ_РасходыДляОпределенияПричин.СтрокаСвязьУчетныхЕдиниц = ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.ГУИД
	|ГДЕ
	|	НЕ ЕСТЬNULL(ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.СтрокаОтключена, ИСТИНА)
	|	И ВТ_РасходыДляОпределенияПричин.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта)
	|	И ВЫБОР
	|			КОГДА НЕ &ПовагонныеОтправки
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_РасходыДляОпределенияПричин.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	|							ТОГДА ЛОЖЬ
	|						ИНАЧЕ ВТ_РасходыДляОпределенияПричин.Контейнер <> ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.Контейнер
	|					КОНЕЦ
	|		КОНЕЦ
	|	И ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.Контейнер <> СделкаПоСсылкеСвязьУчетныхЕдиниц.Контейнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РасходыДляОтключения.ГУИД КАК ГУИД,
	|	ВТ_РасходыДляОтключения.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	|	ВТ_РасходыДляОтключения.ПричинаОтключенияСтроки КАК ПричинаОтключенияСтроки,
	|	ВТ_РасходыДляОтключения.СтрокаСУЕОтключена КАК СтрокаСУЕОтключена
	|ИЗ
	|	ВТ_РасходыДляОтключения КАК ВТ_РасходыДляОтключения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ВСЕРасходыНеОтключенные.ГУИД,
	|	ВТ_ВСЕРасходыНеОтключенные.СтрокаСвязьУчетныхЕдиниц,
	|	ЗНАЧЕНИЕ(Перечисление.ПричиныОтключенияСтрокиРасходовСделки.РучноеОтключениеСтрокиСоставаПоезда),
	|	ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.СтрокаОтключена
	|ИЗ
	|	ВТ_ВСЕРасходыНеОтключенные КАК ВТ_ВСЕРасходыНеОтключенные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СделкаСвязьУчетныхЕдиницБезОтбора КАК ВТ_СделкаСвязьУчетныхЕдиницБезОтбора
	|		ПО ВТ_ВСЕРасходыНеОтключенные.СтрокаСвязьУчетныхЕдиниц = ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.ГУИД
	|			И (ВТ_СделкаСвязьУчетныхЕдиницБезОтбора.ОтключитьРасходы)
	|ГДЕ
	|	НЕ ВТ_ВСЕРасходыНеОтключенные.ГУИД В
	|				(ВЫБРАТЬ
	|					ВТ_РасходыДляОтключения.ГУИД
	|				ИЗ
	|					ВТ_РасходыДляОтключения КАК ВТ_РасходыДляОтключения)";
	//ДИТ, Беляев СЮ, BUG 82454, 16-04-2024, конец
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц", "&СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.Расходы", "&Расходы");
	
	Запрос.УстановитьПараметр("СвязьУчетныхЕдиниц", Сделка.СвязьУчетныхЕдиниц.Выгрузить());
	Запрос.УстановитьПараметр("Расходы", Сделка.Расходы.Выгрузить());
	Запрос.УстановитьПараметр("СвязьДоходовИРасходов", Сделка.СвязьДоходовИРасходов.Выгрузить());        
	Запрос.УстановитьПараметр("ПовагонныеОтправки", Сделка.ПовагонныеОтправки);
	Запрос.УстановитьПараметр("Сделка", Сделка.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаРасхода = Сделка.Расходы.Найти(ВыборкаДетальныеЗаписи.ГУИД, "ГУИД");
		СтрокаРасхода.УслугаОтключена = Истина;
		//Евросиб Каблов 06.10.2023 ( Ticket#0327386
		//СтрокаРасхода.ПричинаОтключенияСтроки = Перечисления.ПричиныОтключенияСтрокиРасходовСделки.ОтвязываниеСтрокиАкцептаОтСделки;
		СтрокаРасхода.ПричинаОтключенияСтроки = ВыборкаДетальныеЗаписи.ПричинаОтключенияСтроки;
		//Евросиб Каблов 06.10.2023 )
	КонецЦикла;
	
КонецПроцедуры
//ДИТ, Беляев СЮ, US 66796 / TA 73519, 09-08-2023, конец

Процедура ЗаполнитьРасходыПоКалькуляциям(ВремТаблицаРасходов, Сделка, МассивОбработанныхСтрок)
	
	#Область ЗапросДляРасходов
	//////////////// ЗАПРОС ДЛЯ РАСХОДОВ ////////////////
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Документ.Калькуляция) КАК Калькуляция,
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.Контейнер КАК Справочник.ТЕ) КАК Контейнер,
	|	ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка) КАК Вагон,
	|	1 КАК Количество,
	|	СделкаСвязьУчетныхЕдиниц.РазмерКТК КАК РазмерКТК,
	|	ВЫБОР
	//|		КОГДА НЕ СделкаСвязьУчетныхЕдиниц.НомерВагоннойЖДН = """"
	|		КОГДА НЕ СделкаСвязьУчетныхЕдиниц.ВагоннаяЖДН = Значение(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьПодсыл,
	|	СделкаСвязьУчетныхЕдиниц.НомерЖДН КАК СписокТД,
	|	СделкаСвязьУчетныхЕдиниц.Груз КАК Груз,
	|	СделкаСвязьУчетныхЕдиниц.ПортОтправления КАК ПортОтправления,
	|	СделкаСвязьУчетныхЕдиниц.ПортНазначения КАК ПортНазначения,
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|	СделкаСвязьУчетныхЕдиниц.СобственностьПеревозимогоКТК КАК СобственностьПеревозимогоКТК,
	//ок)
	|	СделкаСвязьУчетныхЕдиниц.УдалитьСобственностьПеревозимогоКТК КАК УдалитьСобственностьПеревозимогоКТК,
	|	СделкаСвязьУчетныхЕдиниц.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|	СделкаСвязьУчетныхЕдиниц.Удалена КАК Удалена,
	|	СделкаСвязьУчетныхЕдиниц.ОтключитьРасходы КАК ОтключитьРасходы,
	|	СделкаСвязьУчетныхЕдиниц.НеАктивна КАК НеАктивна,
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.Коносамент КАК Документ.ТранспортныйДокумент) КАК Коносамент,
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК СтрокаСвязьУчетныхЕдиниц,
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	|	СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН КАК ЖДН,
	|	СделкаСвязьУчетныхЕдиниц.ГруженаяЖДННеНайдена КАК ГруженаяЖДННеНайдена,
	|	СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения,
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.НакладнаяПослеГруженогоПлеча КАК Документ.ТранспортныйДокумент) КАК НакладнаяПослеГруженогоПлеча,
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.НакладнаяПослеГружКТК КАК Документ.ТранспортныйДокумент) КАК НакладнаяПослеГружКТК,
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.ЖДНПерестановкиДоГружКТК КАК Документ.ТранспортныйДокумент) КАК НакладнаяПерестановкиДоГружКТК,
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.ЖДНПерестановкиДоПорКТК КАК Документ.ТранспортныйДокумент) КАК НакладнаяПерестановкиДоПорКТК,
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.ВагоннаяЖДН КАК Документ.ТранспортныйДокумент) КАК НакладнаяВагоннаяЖДН,
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.ПорожняяЖДНКТК КАК Документ.ТранспортныйДокумент) КАК НакладнаяПорожняяЖДНКТК,
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.ПорожняяВагоннаяЖДН КАК Документ.ТранспортныйДокумент) КАК НакладнаяПорожняяВагоннаяЖДН
	|ПОМЕСТИТЬ ВТ_СделкаСвязьУчетныхЕдиниц
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|ГДЕ
	|	НЕ СделкаСвязьУчетныхЕдиниц.ДобавленаПриДобавленииДоходовВручную
	|	И НЕ СделкаСвязьУчетныхЕдиниц.Удалена
	|	И НЕ СделкаСвязьУчетныхЕдиниц.НеАктивна
	|	И НЕ СделкаСвязьУчетныхЕдиниц.ОтключитьРасходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//78336
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция
	|ПОМЕСТИТЬ ВТ_КалькуляцииСДвойнымФрахтом
	|ИЗ
	|	ВТ_СделкаСвязьУчетныхЕдиниц КАК ВТ_СделкаСвязьУчетныхЕдиниц
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	|		ПО ВТ_СделкаСвязьУчетныхЕдиниц.Калькуляция = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка
	|			И (КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга = &УслугаФрахта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.НФ_ВыбранныеСтавки КАК КалькуляцияНФ_ВыбранныеСтавки
	|		ПО ВТ_СделкаСвязьУчетныхЕдиниц.Калькуляция = КалькуляцияНФ_ВыбранныеСтавки.Ссылка
	|ГДЕ
	|	НЕ КалькуляцияНФ_ВыбранныеСтавки.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//78336
	|ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки,
	|	СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения,
	|   СделкаСвязьУчетныхЕдиниц.Удалена ИЛИ СделкаСвязьУчетныхЕдиниц.НеАктивна ИЛИ СделкаСвязьУчетныхЕдиниц.ОтключитьРасходы КАК СтрокаОтключена
	|ПОМЕСТИТЬ ВТ_СделкаСвязьУчетныхЕдиницБезОтбора
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	|	СделкаРасходы.Услуга КАК Услуга,
	|	СделкаРасходы.Калькуляция КАК Калькуляция,
	|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики_Старая КАК ИсточникПоявленияСтрокиЭкономики_Старая,
	|	ВЫРАЗИТЬ(СделкаРасходы.УчДокумент КАК Документ.ПоступлениеТоваровУслуг) КАК УчДокумент,
	|	СделкаРасходы.ГУИД КАК ГУИД,
	|	СделкаРасходы.СтрокаРасходовВПеренесеннойСделке КАК СтрокаРасходовВПеренесеннойСделке,
	//Евросиб - АСуслов 09.12.2022 16:49:59 #61448
	//(
	|	СделкаРасходы.СтрокаРасходовВСделкеИсточник КАК СтрокаРасходовВСделкеИсточник,
	//)
	//Евросиб - АСуслов 09.12.2022 16:50:02 #61448
	|	СделкаРасходы.ПунктОтправления КАК ПунктОтправления,
	|	СделкаРасходы.ПунктНазначения КАК ПунктНазначения,
	|	СделкаРасходы.Поставщик КАК Поставщик,
	|	СделкаРасходы.Договор КАК Договор,
	|	СделкаРасходы.Себестоимость КАК Себестоимость,
	|	СделкаРасходы.СтавкаНДС КАК СтавкаНДС,
	|	СделкаРасходы.Валюта КАК Валюта,
	|	СделкаРасходы.ВидЖДН КАК ВидЖДН,
	|	СделкаРасходы.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	СделкаРасходы.СтрокаКалькуляции КАК СтрокаКалькуляции
	|ПОМЕСТИТЬ ВТ_Расходы
	|ИЗ
	|	Документ.Сделка.Расходы КАК СделкаРасходы
	|ГДЕ
	|	(НЕ СделкаРасходы.УслугаОтключена
	|			ИЛИ СделкаРасходы.УслугаОтключенаУсловно)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
	|	СделкаСвязьДоходовИРасходов.Доходы КАК Доходы
	|ПОМЕСТИТЬ ВТ_ТЧСвязьДоходовИРасходов
	|ИЗ
	|	Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыгрТЧ.Калькуляция КАК Калькуляция,
	|	ВЫРАЗИТЬ(ВыгрТЧ.Контейнер КАК Справочник.ТЕ) КАК Контейнер,
	|	ВыгрТЧ.Вагон КАК Вагон,
	|	1 КАК Количество,
	|	ВыгрТЧ.РазмерКТК КАК РазмерКТК,
	|	ВыгрТЧ.ЕстьПодсыл КАК ЕстьПодсыл,
	|	ВыгрТЧ.СписокТД КАК СписокТД,
	|	ВыгрТЧ.Груз КАК Груз,
	|	ВыгрТЧ.ПортОтправления КАК ПортОтправления,
	|	ВыгрТЧ.ПортНазначения КАК ПортНазначения,
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|	ВыгрТЧ.СобственностьПеревозимогоКТК КАК СобственностьПеревозимогоКТК,
	//ок)
	|	ВыгрТЧ.УдалитьСобственностьПеревозимогоКТК КАК УдалитьСобственностьПеревозимогоКТК,
	|	ВыгрТЧ.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|	ВыгрТЧ.Удалена КАК Удалена,
	|	ВыгрТЧ.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	|	ПризнакСобственностиВагонаСрезПоследних.ПризнакСобственности КАК ПризнакСобственности,
	|	ВыгрТЧ.Коносамент КАК Коносамент,
	|	ВыгрТЧ.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения,
	|	ВыгрТЧ.ГУИД КАК ГУИД,
	|	ВыгрТЧ.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки,
	|	ВыгрТЧ.ЖДН КАК ЖДН,
	|	ВыгрТЧ.НакладнаяВагоннаяЖДН КАК НакладнаяВагоннаяЖДН,
	|	ВыгрТЧ.НакладнаяПорожняяЖДНКТК КАК НакладнаяПорожняяЖДНКТК,
	|	ВыгрТЧ.НакладнаяПорожняяВагоннаяЖДН КАК НакладнаяПорожняяВагоннаяЖДН,
	|	ВыгрТЧ.ГруженаяЖДННеНайдена КАК ГруженаяЖДННеНайдена,
	|	ВыгрТЧ.НакладнаяПослеГруженогоПлеча КАК НакладнаяПослеГруженогоПлеча,
	|	ВыгрТЧ.НакладнаяПослеГружКТК КАК НакладнаяПослеГружКТК1,
	|	ВыгрТЧ.НакладнаяПерестановкиДоГружКТК КАК НакладнаяПерестановкиДоГружКТК,
	|	ВыгрТЧ.НакладнаяПерестановкиДоПорКТК КАК НакладнаяПерестановкиДоПорКТК,
	//Евросиб - АСуслов 04.01.2023 12:26:27 #63214
	//(
	|	ЕСТЬNULL(ВТ_СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ЖД) КАК ЕстьЖД
	//)
	//Евросиб - АСуслов 04.01.2023 12:26:29 #63214
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТ_СделкаСвязьУчетныхЕдиниц КАК ВыгрТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПризнакСобственностиВагона.СрезПоследних КАК ПризнакСобственностиВагонаСрезПоследних
	|		ПО ВыгрТЧ.Вагон = ПризнакСобственностиВагонаСрезПоследних.Вагон
	//Евросиб - АСуслов 04.01.2023 12:26:27 #63214
	//(
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СделкаСвязьУчетныхЕдиницБезОтбора КАК ВТ_СделкаСвязьУчетныхЕдиниц
	|		ПО ВыгрТЧ.ГУИДСтрокиЗаявки = ВТ_СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки
	|			И (ВыгрТЧ.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море))
	|			И (ВТ_СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ЖД))
	//)
	//Евросиб - АСуслов 04.01.2023 12:26:29 #63214
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГУИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Калькуляция КАК Калькуляция,
	|	ВТ.Контейнер КАК Контейнер,
	|	ВТ.Вагон КАК Вагон,
	|	ВТ.Количество КАК Количество,
	|	ВТ.РазмерКТК КАК РазмерКТК,
	|	ВТ.ЕстьПодсыл КАК ЕстьПодсыл,
	|	ВТ.СписокТД КАК СписокТД,
	|	ВТ.Груз КАК Груз,
	|	ВТ.ПортОтправления КАК ПортОтправления,
	|	ВТ.ПортНазначения КАК ПортНазначения,
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|	ВТ.СобственностьПеревозимогоКТК КАК СобственностьПеревозимогоКТК,
	//ок)
	|	ВТ.УдалитьСобственностьПеревозимогоКТК КАК УдалитьСобственностьПеревозимогоКТК,
	|	ВТ.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|	ВТ.Удалена КАК Удалена,
	|	ВТ.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	|	ВТ.ПризнакСобственности КАК ПризнакСобственности,
	|	ВТ.Коносамент КАК Коносамент,
	|	ВТ.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения,
	|	ВТ.ГУИД КАК ГУИД,
	|	ВТ.ЖДН КАК ЖДН,
	|	ВТ.НакладнаяВагоннаяЖДН КАК НакладнаяВагоннаяЖДН,
	|	ВТ.НакладнаяПорожняяЖДНКТК КАК НакладнаяПорожняяЖДНКТК,
	|	ВТ.НакладнаяПорожняяВагоннаяЖДН КАК НакладнаяПорожняяВагоннаяЖДН,
	|	ВТ.ГруженаяЖДННеНайдена КАК ГруженаяЖДННеНайдена,
	|	ВТ.НакладнаяПослеГруженогоПлеча КАК НакладнаяПослеГруженогоПлеча,
	|	ВТ.НакладнаяПослеГружКТК1 КАК НакладнаяПослеГружКТК1,
	|	ВТ.НакладнаяПерестановкиДоГружКТК КАК НакладнаяПерестановкиДоГружКТК,
	|	ВТ.НакладнаяПерестановкиДоПорКТК КАК НакладнаяПерестановкиДоПорКТК,
	|	ВТ2.ГУИД КАК ГУИД_ЖД
	|ПОМЕСТИТЬ ВТ_Фрахт
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ1
	|		ПО ВТ.ГУИДСтрокиЗаявки = ВТ1.ГУИДСтрокиЗаявки
	|			И (ВТ1.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ2
	|		ПО ВТ.ГУИДСтрокиЗаявки = ВТ2.ГУИДСтрокиЗаявки
	|			И (НЕ ВТ2.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море))
	|ГДЕ
	|	НЕ ВТ.Коносамент = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|	И (ВТ.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море)
	//Евросиб - АСуслов 04.10.2022 15:15:33 #тэуфрахт
	//(
	|			ИЛИ ВТ.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ПустаяСсылка))
	//)
	//Евросиб - АСуслов 04.10.2022 15:15:33 #тэуфрахт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА ВТ.Контейнер.ТипТЕ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|			ТОГДА КалькуляцияНФ_ВыбранныеСтавки.Фрахт20
	|		ИНАЧЕ КалькуляцияНФ_ВыбранныеСтавки.Фрахт40
	|	КОНЕЦ КАК Ставка,
	|	ВЫБОР
	|		КОГДА ВТ.Контейнер.ТипТЕ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|			ТОГДА КалькуляцияНФ_ВыбранныеСтавки.Вознаграждение20
	|		ИНАЧЕ КалькуляцияНФ_ВыбранныеСтавки.Вознаграждение40
	|	КОНЕЦ КАК Вознаграждение,
	|	ВЫБОР
	|		КОГДА ВТ.Контейнер.ТипТЕ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|			ТОГДА КалькуляцияНФ_ВыбранныеСтавки.Итого20
	|		ИНАЧЕ КалькуляцияНФ_ВыбранныеСтавки.Итого40
	|	КОНЕЦ КАК Итого,
	|	КалькуляцияНФ_ВыбранныеСтавки.Ссылка КАК КалькуляцияФрахта,
	|	КалькуляцияНФ_ВыбранныеСтавки.Контрагент.Контрагент КАК ПоставщикФрахт,
	|	КалькуляцияНФ_ВыбранныеСтавки.Валюта КАК Валюта,
	|	КалькуляцияНФ_ВыбранныеСтавки.Порт КАК Порт,
	|	ВТ.Удалена КАК Удалена,
	//|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС) КАК СтавкаНДС,
	//Евросиб(ДИТ), Беляев СЮ, US 98066 / TA 98869, 26-12-2024, начало
	|	КалькуляцияНФ_ВыбранныеСтавки.Ссылка.НДСФрахт КАК СтавкаНДС,
	|	КалькуляцияНФ_ВыбранныеСтавки.Ссылка.СуммаВключаетНДСФрахт КАК СуммаВключаетНДСФрахт,
	//Евросиб(ДИТ), Беляев СЮ, US 98066 / TA 98869, 26-12-2024, конец
	|	ВТ.Коносамент.СтанцияОтправления КАК КоносаментСтанцияОтправления,
	|	ВТ.Коносамент.СтанцияНазначения КАК КоносаментСтанцияНазначения,
	|	ВТ.Коносамент.НомерТранспортногоДокумента КАК КоносаментНомерТранспортногоДокумента,
	|	ВТ.Коносамент КАК Коносамент,
	|	ВТ.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	|	КалькуляцияНФ_ВыбранныеСтавки.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	КалькуляцияНФ_ВыбранныеСтавки.КлючАналитикиСтрокиКалькуляции КАК КлючАналитикиСтрокиКалькуляции
	|ПОМЕСТИТЬ ФрахтПоКалькуляции
	|ИЗ
	|	ВТ_Фрахт КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция.НФ_ВыбранныеСтавки КАК КалькуляцияНФ_ВыбранныеСтавки
	|		ПО ВТ.Калькуляция = КалькуляцияНФ_ВыбранныеСтавки.Ссылка
	|			И (ВЫБОР
	|				КОГДА ВТ.Калькуляция.ФрахтИмпорт
	|					ТОГДА ВТ.Коносамент.СтанцияОтправления = КалькуляцияНФ_ВыбранныеСтавки.Порт
	|				ИНАЧЕ ВТ.ПортНазначения = КалькуляцияНФ_ВыбранныеСтавки.Порт
	|						ИЛИ ВТ.Коносамент.СтанцияНазначения = КалькуляцияНФ_ВыбранныеСтавки.Порт
	|			КОНЕЦ)
	|			И (ВЫБОР
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|				КОГДА ВТ.СобственностьПеревозимогоКТК = ЗНАЧЕНИЕ(Перечисление.СобственностьПеревозимогоКонтейнера.SOC)
	//ок)
	|				КОГДА ВТ.ПринадлежностьТЕ = ЗНАЧЕНИЕ(Перечисление.ПринадлежностьТЕ.КТКлиента)
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|					ТОГДА ""SOC""
	|				ИНАЧЕ ""COC""
	|			КОНЕЦ = КалькуляцияНФ_ВыбранныеСтавки.SOCCOC)
	|ГДЕ
	|	(КалькуляцияНФ_ВыбранныеСтавки.Выбрано20
	|			ИЛИ КалькуляцияНФ_ВыбранныеСтавки.Выбрано40)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КалькуляцияФрахта,
	|	СтрокаСвязьУчетныхЕдиниц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	|	СделкаРасходы.Услуга КАК Услуга,
	|	СделкаРасходы.Калькуляция КАК Калькуляция,
	|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики_Старая КАК ИсточникПоявленияСтрокиЭкономики_Старая,
	|	ВЫРАЗИТЬ(СделкаРасходы.УчДокумент КАК Документ.ПоступлениеТоваровУслуг) КАК УчДокумент,
	|	СделкаРасходы.ГУИД КАК ГУИД,
	|	СделкаРасходы.СтрокаРасходовВПеренесеннойСделке КАК СтрокаРасходовВПеренесеннойСделке,
	|	СделкаРасходы.СтрокаРасходовВСделкеИсточник КАК СтрокаРасходовВСделкеИсточник,
	|	СделкаРасходы.ПунктОтправления КАК ПунктОтправления,
	|	СделкаРасходы.ПунктНазначения КАК ПунктНазначения,
	|	СделкаРасходы.Поставщик КАК Поставщик,
	|	СделкаРасходы.Договор КАК Договор,
	|	СделкаРасходы.Себестоимость КАК Себестоимость,
	|	СделкаРасходы.СтавкаНДС КАК СтавкаНДС,
	|	СделкаРасходы.Валюта КАК Валюта,
	|	СделкаРасходы.ВидЖДН КАК ВидЖДН,
	|	СделкаРасходы.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	ВТ.Контейнер КАК Контейнер,
	|	ВТ.Вагон КАК Вагон,
	|	СделкаРасходы.СтрокаКалькуляции КАК СтрокаКалькуляции,
	|	ВЫБОР
	|		КОГДА ВТ.ГУИД ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СтрокаСУЕОтсутствует,
	|	ВТ1.ГУИД КАК СтрокаСвязьУчетныхЕдиницЖД,
	//Евросиб - АСуслов 07.12.2022 12:40:04 #62120
	//(
	//некорректно проверять на услугу фрахта, т.к. фрахт может быть и в 1.3
	//проверяем на источник = фрахт из калькуляции
	//|	ВЫБОР КОГДА СделкаРасходы.Услуга = &УслугаФрахта ТОГДА НФ_ВыбранныеСтавки.КлючАналитикиСтрокиКалькуляции ИНАЧЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.КлючАналитикиСтрокиКалькуляции КОНЕЦ КАК КлючАналитикиСтрокиКалькуляции
	|	ВЫБОР
	|		КОГДА СделкаРасходы.ИсточникПоявленияСтрокиЭкономики = Значение(Перечисление.ИсточникПоявленияСтрокиЭкономики.ФрахтИзКалькуляции)
	|			ТОГДА НФ_ВыбранныеСтавки.КлючАналитикиСтрокиКалькуляции
	|		ИНАЧЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.КлючАналитикиСтрокиКалькуляции
	|	КОНЕЦ КАК КлючАналитикиСтрокиКалькуляции
	//)
	//Евросиб - АСуслов 07.12.2022 12:40:06 #62120
	|ПОМЕСТИТЬ ВТ_РасходыГУИДыСУЕ
	|ИЗ
	|	ВТ_Расходы КАК СделкаРасходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ1
	|			ПО ВТ.ГУИДСтрокиЗаявки = ВТ1.ГУИДСтрокиЗаявки
	|				И (НЕ ВТ1.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море))
	|  				И НЕ ВТ1.ГУИДСтрокиЗаявки = """"
	|		ПО СделкаРасходы.СтрокаСвязьУчетныхЕдиниц = ВТ.ГУИД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	|		ПО СделкаРасходы.Калькуляция = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка
	|			И СделкаРасходы.СтрокаКалькуляции = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ИдентификаторСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.НФ_ВыбранныеСтавки КАК НФ_ВыбранныеСтавки
	|		ПО СделкаРасходы.Калькуляция = НФ_ВыбранныеСтавки.Ссылка
	|			И СделкаРасходы.СтрокаКалькуляции = НФ_ВыбранныеСтавки.ИдентификаторСтроки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СделкаРасходы.СтрокаКалькуляции,
	|	СтрокаСвязьУчетныхЕдиниц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Поставщик КАК Поставщик,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Договор КАК Договор,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга КАК Услуга,
	|	ВЫБОР
	|		КОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ГруппаУслуг > 0
	|				И НЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ОсновнаяУслугаГруппы
	|			ТОГДА ИСТИНА
	|		КОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга.ВключатьВРасходыПоФактуОказанияУслуги
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НеВключатьВПлановыеРасходы,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка КАК Калькуляция,
	|	ВЫБОР
	|		КОГДА ВТ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|			ТОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Цена20
	|		ИНАЧЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Цена40
	|	КОНЕЦ КАК Себестоимость,
	|	ВТ.Количество КАК Количество,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СтавкаНДС КАК СтавкаНДС,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга КАК ВыставляемаяУслуга,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Цена20 КАК Цена20,
	|	ВТ.Груз КАК Груз,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Цена40 КАК Цена40,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СуммаВознаграждения20 КАК СуммаВознаграждения20,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СуммаВознаграждения40 КАК СуммаВознаграждения40,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Итого20 КАК Итого20,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Итого40 КАК Итого40,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Валюта КАК Валюта,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВнутренняяСебестоимость КАК ВнутренняяСебестоимость,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.море20_Контрагент КАК море20_Контрагент,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.море20_Себестоимость КАК море20_Себестоимость,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.море40_Контрагент КАК море40_Контрагент,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.море40_Себестоимость КАК море40_Себестоимость,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ММ_ВалютаФрахтовыхСтавок КАК ММ_ВалютаФрахтовыхСтавок,
	|	ВТ.Контейнер КАК Контейнер,
	|	ВТ.Вагон КАК Вагон,
	|	ВТ.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга.Перевыставляемая КАК Перевыставляемая,
	|	ВЫБОР
	|		КОГДА ВТ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|			ТОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СуммаВознаграждения20
	|		ИНАЧЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СуммаВознаграждения40
	|	КОНЕЦ * ВТ.Количество КАК ВознаграждениеИтого,
	//78336
	|	ВЫБОР
	|		КОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга = &УслугаФрахта
	|				И ВТ_КалькуляцииСДвойнымФрахтом.Калькуляция ЕСТЬ NULL
	|			ТОГДА ВТ.Коносамент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|	КОНЕЦ КАК ТранспортныйДокумент,
	//78336
	|	ВТ.ЕстьПодсыл КАК ЕстьПодсыл,
	|	ВЫБОР КОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПодсылПорожних 
	|   ИЛИ (КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ТипКалькуляции В(&МежсервисныеРасходы) И КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.Контрагент = &КонтрагентДирекция И КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ОтнестиРасходыНаСебестоимостьКлиента) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК Подсыл,
	|	ВТ.РазмерКТК КАК РазмерКТК,
	|	ВЫБОР
	|		КОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого)
	|				ИЛИ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПССТарифом)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.Вагон)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.Ктк)
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Возмещаемая КАК Возмещаемая,
	//78336
	|	ВЫБОР
	|		КОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга = &УслугаФрахта
	|				И ВТ_КалькуляцииСДвойнымФрахтом.Калькуляция ЕСТЬ NULL
	|               И НЕ ВТ.Коносамент.СтанцияОтправления ЕСТЬ NULL
	|			ТОГДА ВТ.Коносамент.СтанцияОтправления
	|		ИНАЧЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПунктОтправления
	|	КОНЕЦ КАК ПунктОтправления,
	|	ВЫБОР
	|		КОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга = &УслугаФрахта
	|				И ВТ_КалькуляцииСДвойнымФрахтом.Калькуляция ЕСТЬ NULL
	//Евросиб - АСуслов 13.09.2023 11:54:56 #74879
	//(
	|               И НЕ ВТ.Коносамент.СтанцияНазначения ЕСТЬ NULL
	//)
	//Евросиб - АСуслов 13.09.2023 11:54:57 #74879
	|			ТОГДА ВТ.Коносамент.СтанцияНазначения
	|		ИНАЧЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПунктНазначения
	|	КОНЕЦ КАК ПунктНазначения,
	//78336
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПлановаяСтоимостьИзЖДН КАК ПлановаяСтоимостьИзЖДН,
	|	ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ОсновнаяУслугаАвтоматически) КАК ИсточникПоявленияСтрокиЭкономики,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ГруппаУслуг КАК ГруппаУслуг,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ОсновнаяУслугаГруппы КАК ОсновнаяУслугаГруппы,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ИдентификаторСтроки КАК СтрокаКалькуляции,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.КлючАналитикиСтрокиКалькуляции КАК КлючАналитикиСтрокиКалькуляции,
	|	NULL КАК ГУИД_ЖД
	|ПОМЕСТИТЬ ИтоговаяРасходы
	|ИЗ
	|	ВТ КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	|		ПО ВТ.Калькуляция = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка
	|			И (НЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	//78336
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КалькуляцииСДвойнымФрахтом КАК ВТ_КалькуляцииСДвойнымФрахтом
	|		ПО ВТ.Калькуляция = ВТ_КалькуляцииСДвойнымФрахтом.Калькуляция
	//78336
	|ГДЕ
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Возмещаемая = ЛОЖЬ
	|	И (КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПодсылПорожних = &ЭтоПодсылПорожних
	|			ИЛИ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПодсылПорожних = ВТ.ЕстьПодсыл
	|				И ВТ.ЕстьПодсыл = ИСТИНА)
	|	И ВЫБОР
	|			КОГДА &ПовагонныеОтправки
	|					И КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПССТарифом)
	|				ТОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга = &НоменклатураЖДТарифГруженогоРейса
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ВТ.ПризнакСобственности = ЗНАЧЕНИЕ(Перечисление.ВариантыСобственности.Собственный)
	// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
	//Было:
	//|					ИЛИ ВТ.ПризнакСобственности = ЗНАЧЕНИЕ(Перечисление.ВариантыСобственности.Арендованный)
	//Стало:
	|					ИЛИ ВТ.ПризнакСобственности = ЗНАЧЕНИЕ(Перечисление.ВариантыСобственности.АрендаДлительная)
	// ДИТ 65580 Давудов М.А. Конец: 23.02.2023
	|				ТОГДА НЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга = &НоменклатураПредоставлениеПС
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	//Евросиб - АСуслов 04.01.2023 12:26:05 #63214
	//(
	|	И (НЕ ВТ.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море)
	|			ИЛИ ВТ.ЕстьЖД = ЛОЖЬ)
	//)
	//Евросиб - АСуслов 04.01.2023 12:26:07 #63214
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.контрагенты.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
	|	&УслугаФрахта,
	|	NULL,
	|	ФрахтПоКалькуляции.КалькуляцияФрахта,
	|	ФрахтПоКалькуляции.Ставка,
	|	ВТ.Количество,
	|	ФрахтПоКалькуляции.СтавкаНДС,
	//|	ЛОЖЬ,
	//Евросиб(ДИТ), Беляев СЮ, US 98066 / TA 98869, 26-12-2024, начало
	|	ФрахтПоКалькуляции.СуммаВключаетНДСФрахт,
	//Евросиб(ДИТ), Беляев СЮ, US 98066 / TA 98869, 26-12-2024, конец
	|	&УслугаФрахта,
	|	NULL,
	|	ВТ.Груз,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ФрахтПоКалькуляции.Валюта,
	|	ЛОЖЬ,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВТ.Контейнер,
	|	ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка),
	|	ВТ.СтрокаСвязьУчетныхЕдиниц,
	|	ВЫРАЗИТЬ(&УслугаФрахта КАК Справочник.Номенклатура).Перевыставляемая,
	|	ФрахтПоКалькуляции.Вознаграждение * ВТ.Количество,
	|	ФрахтПоКалькуляции.Коносамент,
	|	ВТ.ЕстьПодсыл,
	|	NULL,
	|	ВТ.РазмерКТК,
	|	NULL,
	|	NULL,
	|	ВТ.Коносамент.СтанцияОтправления,
	|	ВТ.Коносамент.СтанцияНазначения,
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ФрахтИзКалькуляции),
	|	0,
	|	ЛОЖЬ,
	|	ФрахтПоКалькуляции.ИдентификаторСтроки,
	|	ФрахтПоКалькуляции.КлючАналитикиСтрокиКалькуляции,
	|	ВТ.ГУИД_ЖД
	|ИЗ
	|	ВТ_Фрахт КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ФрахтПоКалькуляции КАК ФрахтПоКалькуляции
	|		ПО ВТ.Калькуляция = ФрахтПоКалькуляции.КалькуляцияФрахта
	|			И ВТ.СтрокаСвязьУчетныхЕдиниц = ФрахтПоКалькуляции.СтрокаСвязьУчетныхЕдиниц
	|			И (ВЫБОР
	|				КОГДА ВТ.Калькуляция.ФрахтИмпорт
	|					ТОГДА ВТ.ПортОтправления = ФрахтПоКалькуляции.Порт
	|							ИЛИ ВТ.Коносамент.СтанцияОтправления = ФрахтПоКалькуляции.Порт
	|				ИНАЧЕ ВТ.ПортНазначения = ФрахтПоКалькуляции.Порт
	|						ИЛИ ВТ.Коносамент.СтанцияНазначения = ФрахтПоКалькуляции.Порт
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
	|	МАКСИМУМ(СделкаСвязьДоходовИРасходов.Доходы) КАК Доходы
	|ПОМЕСТИТЬ СУЕ_Доходы
	|ИЗ
	|	ВТ_ТЧСвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|
	|СГРУППИРОВАТЬ ПО
	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(СделкаДоходы.ПериодВО) КАК ПериодВО,
	|	СУЕ_Доходы.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
	|	СУЕ_Доходы.Доходы КАК Доходы,
	|	ВЫБОР
	|		КОГДА СделкаДоходы.УчДокумент ССЫЛКА Документ.ОтчетКомитентуОПродажах
	|				И НЕ СделкаДоходы.УчДокумент = ЗНАЧЕНИЕ(документ.ОтчетКомитентуОПродажах.Пустаяссылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьОтчетКомитенту,
	|	СделкаДоходы.НеВыставлятьКлиенту КАК НеВыставлятьКлиенту
	|ПОМЕСТИТЬ СУЕ_Доходы_ПериодВО
	|ИЗ
	|	СУЕ_Доходы КАК СУЕ_Доходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
	|		ПО СУЕ_Доходы.Доходы = СделкаДоходы.ГУИД
	|
	|СГРУППИРОВАТЬ ПО
	|	СУЕ_Доходы.СвязьУчетныхЕдиниц,
	|	СУЕ_Доходы.Доходы,
	|	ВЫБОР
	|		КОГДА СделкаДоходы.УчДокумент ССЫЛКА Документ.ОтчетКомитентуОПродажах
	|				И НЕ СделкаДоходы.УчДокумент = ЗНАЧЕНИЕ(документ.ОтчетКомитентуОПродажах.Пустаяссылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	СделкаДоходы.НеВыставлятьКлиенту
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СвязьУчетныхЕдиниц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Расходы.ГУИД КАК ГУИД
	|ИЗ
	|	ВТ_Расходы КАК ВТ_Расходы
	|ГДЕ
	|	ВТ_Расходы.ИсточникПоявленияСтрокиЭкономики В(&ИсточникиПоявленияСтрокиЭкономики)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяРасходы.Поставщик КАК Поставщик,
	|	ИтоговаяРасходы.Договор КАК Договор,
	|	ИтоговаяРасходы.Услуга КАК Услуга,
	|	ВЫБОР
	|		КОГДА СУЕ_Доходы_ПериодВО.НеВыставлятьКлиенту
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ИтоговаяРасходы.НеВключатьВПлановыеРасходы
	|	КОНЕЦ КАК НеВключатьВПлановыеРасходы,
	|	ИтоговаяРасходы.Калькуляция КАК Калькуляция,
	|	ИтоговаяРасходы.Калькуляция.ФрахтИмпорт КАК КалькуляцияФрахтИмпорт,
	// Евросиб US 115279 TA 115468 Рыбьяков К.А. 18.09.2025 ((
	|	ИтоговаяРасходы.Себестоимость * ИтоговаяРасходы.Контейнер.ТипТе.ТЕУ КАК Себестоимость,
	//|	ИтоговаяРасходы.Себестоимость КАК Себестоимость,
	// Евросиб Рыбьяков К.А. 18.09.2025 ))
	|	ИтоговаяРасходы.Количество КАК Количество,
	|	ИтоговаяРасходы.СтавкаНДС КАК СтавкаНДС,
	|	ИтоговаяРасходы.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	|	ИтоговаяРасходы.ВыставляемаяУслуга КАК ВыставляемаяУслуга,
	|	ИтоговаяРасходы.Цена20 КАК Цена20,
	|	ИтоговаяРасходы.Груз КАК Груз,
	|	ИтоговаяРасходы.Цена40 КАК Цена40,
	|	ИтоговаяРасходы.СуммаВознаграждения20 КАК СуммаВознаграждения20,
	|	ИтоговаяРасходы.СуммаВознаграждения40 КАК СуммаВознаграждения40,
	|	ИтоговаяРасходы.Итого20 КАК Итого20,
	|	ИтоговаяРасходы.Итого40 КАК Итого40,
	|	ИтоговаяРасходы.Валюта КАК Валюта,
	|	ИтоговаяРасходы.ВнутренняяСебестоимость КАК ВнутренняяСебестоимость,
	|	ИтоговаяРасходы.море20_Контрагент КАК море20_Контрагент,
	|	ИтоговаяРасходы.море20_Себестоимость КАК море20_Себестоимость,
	|	ИтоговаяРасходы.море40_Контрагент КАК море40_Контрагент,
	|	ИтоговаяРасходы.море40_Себестоимость КАК море40_Себестоимость,
	|	ИтоговаяРасходы.ММ_ВалютаФрахтовыхСтавок КАК ММ_ВалютаФрахтовыхСтавок,
	|	ИтоговаяРасходы.Контейнер КАК Контейнер,
	|	ИтоговаяРасходы.Вагон КАК Вагон,
	|	ИтоговаяРасходы.Перевыставляемая КАК Перевыставляемая,
	|	ИтоговаяРасходы.ВознаграждениеИтого КАК ВознаграждениеИтого,
	|	ИтоговаяРасходы.ЕстьПодсыл КАК ЕстьПодсыл,
	|	ИтоговаяРасходы.Подсыл КАК Подсыл,
	|	ИтоговаяРасходы.РазмерКТК КАК РазмерКТК,
	|	ИтоговаяРасходы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ИтоговаяРасходы.Возмещаемая КАК Возмещаемая,
	|	ИтоговаяРасходы.ПунктОтправления КАК ПунктОтправления,
	|	ИтоговаяРасходы.ПунктНазначения КАК ПунктНазначения,
	|	ИтоговаяРасходы.ПлановаяСтоимостьИзЖДН КАК ПлановаяСтоимостьИзЖДН,
	|	ИтоговаяРасходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	|	ВТ_РасходыГУИДыСУЕ.ИсточникПоявленияСтрокиЭкономики_Старая КАК ИсточникПоявленияСтрокиЭкономики_Старая,
	|	ЕСТЬNULL(ВТ_РасходыГУИДыСУЕ.ГУИД, &ПустойГУИД) КАК ГУИД,
	|	ЛОЖЬ КАК Удалить,
	|	ЕСТЬNULL(СУЕ_Доходы_ПериодВО.ПериодВО, ДАТАВРЕМЯ(1, 1, 1)) КАК ПериодВО,
	|	ИтоговаяРасходы.ГруппаУслуг КАК ГруппаУслуг,
	|	ИтоговаяРасходы.ОсновнаяУслугаГруппы КАК ОсновнаяУслугаГруппы,
	|	NULL КАК УчДокумент,
	|	ЕСТЬNULL(СУЕ_Доходы_ПериодВО.ЕстьОтчетКомитенту, ЛОЖЬ) КАК ЕстьОтчетКомитенту,
	|	ИтоговаяРасходы.СтрокаКалькуляции КАК СтрокаКалькуляции,
	|	ИтоговаяРасходы.КлючАналитикиСтрокиКалькуляции КАК КлючАналитикиСтрокиКалькуляции,
	|	ЕСТЬNULL(ИтоговаяРасходы.ПунктОтправления.Родитель, НЕОПРЕДЕЛЕНО) КАК ПунктОтправленияРодитель,
	|	ЕСТЬNULL(ИтоговаяРасходы.ПунктНазначения.Родитель, НЕОПРЕДЕЛЕНО) КАК ПунктНазначенияРодитель,
	|	ИтоговаяРасходы.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	ВТ_РасходыГУИДыСУЕ.ВидЖДН КАК ВидЖДН,
	|	ВТ_РасходыГУИДыСУЕ.ТранспортныйДокумент КАК ЖДН,
	//|	ВЫБОР
	//|		КОГДА ИтоговаяРасходы.Калькуляция.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ КАК ОтнестиНаЗатраты,
	|	ВЫБОР
	|		КОГДА ИтоговаяРасходы.Калькуляция.ТипКалькуляции В(&МежсервисныеРасходы)
	| 			И ИтоговаяРасходы.Калькуляция.Контрагент = &КонтрагентДирекция
	| 			И ИтоговаяРасходы.Калькуляция.ОтнестиРасходыНаСобственныеЗатраты 
	|		ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОтнестиНаЗатраты,                            
	|	ИтоговаяРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц
	|ИЗ
	|	ИтоговаяРасходы КАК ИтоговаяРасходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасходыГУИДыСУЕ КАК ВТ_РасходыГУИДыСУЕ
	|		ПО ИтоговаяРасходы.СтрокаКалькуляции = ВТ_РасходыГУИДыСУЕ.СтрокаКалькуляции
	//|		ПО ИтоговаяРасходы.КлючАналитикиСтрокиКалькуляции = ВТ_РасходыГУИДыСУЕ.КлючАналитикиСтрокиКалькуляции
	|			И ИтоговаяРасходы.СтрокаСвязьУчетныхЕдиниц = ВТ_РасходыГУИДыСУЕ.СтрокаСвязьУчетныхЕдиниц
	|		ЛЕВОЕ СОЕДИНЕНИЕ СУЕ_Доходы_ПериодВО КАК СУЕ_Доходы_ПериодВО
	|		ПО ИтоговаяРасходы.СтрокаСвязьУчетныхЕдиниц = СУЕ_Доходы_ПериодВО.СвязьУчетныхЕдиниц
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контейнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	|	ВТ_СделкаСвязьУчетныхЕдиниц1.ГУИД КАК СтрокаСвязьУчетныхЕдиницСтарая,
	|	ВТ_РасходыГУИДыСУЕ.ГУИД КАК ГУИДРасходов
	|ИЗ
	|	ИтоговаяРасходы КАК ИтоговаяРасходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СделкаСвязьУчетныхЕдиниц КАК ВТ_СделкаСвязьУчетныхЕдиниц
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СделкаСвязьУчетныхЕдиниц КАК ВТ_СделкаСвязьУчетныхЕдиниц1
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РасходыГУИДыСУЕ КАК ВТ_РасходыГУИДыСУЕ
	|				ПО ВТ_СделкаСвязьУчетныхЕдиниц1.СтрокаСвязьУчетныхЕдиниц = ВТ_РасходыГУИДыСУЕ.СтрокаСвязьУчетныхЕдиниц
	|					И (ВТ_РасходыГУИДыСУЕ.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ФрахтИзКалькуляции))
	|			ПО ВТ_СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки = ВТ_СделкаСвязьУчетныхЕдиниц1.ГУИДСтрокиЗаявки
	|				И (НЕ ВТ_СделкаСвязьУчетныхЕдиниц1.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море))
	|		ПО ИтоговаяРасходы.СтрокаСвязьУчетныхЕдиниц = ВТ_СделкаСвязьУчетныхЕдиниц.ГУИД";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.СвязьУчетныхЕдиниц", "&СвязьУчетныхЕдиниц");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.Расходы", "&Расходы");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.СвязьДоходовИРасходов", "&СвязьДоходовИРасходов");
	
	#КонецОбласти                
	
	#Область ПараметрыЗапроса
	Запрос.УстановитьПараметр("СвязьУчетныхЕдиниц", Сделка.СвязьУчетныхЕдиниц.Выгрузить());
	Запрос.УстановитьПараметр("Расходы", Сделка.Расходы.Выгрузить());
	Запрос.УстановитьПараметр("СвязьДоходовИРасходов", Сделка.СвязьДоходовИРасходов.Выгрузить());        
	
	УслугаФрахтаДляКалькуляции = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("УслугаФрахтаДляКалькуляции");
	Запрос.УстановитьПараметр("УслугаФрахта", УслугаФрахтаДляКалькуляции);
	Запрос.УстановитьПараметр("ЭтоПодсылПорожних", Сделка.ПодсылПорожних); 
	ПустойУИ = ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор();
	Запрос.УстановитьПараметр("ПустойГУИД", ПустойУИ);
	Запрос.УстановитьПараметр("ПовагонныеОтправки", Сделка.ПовагонныеОтправки);
	
	МассивИсточникиСтрок = Новый Массив;
	МассивИсточникиСтрок.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ОсновнаяУслугаАвтоматически);
	МассивИсточникиСтрок.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ФрахтИзКалькуляции);
	Запрос.УстановитьПараметр("ИсточникиПоявленияСтрокиЭкономики", МассивИсточникиСтрок);
	
	Запрос.УстановитьПараметр("НоменклатураЖДТарифГруженогоРейса", ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("НоменклатураЖДТарифГруженогоРейса"));
	Запрос.УстановитьПараметр("НоменклатураПредоставлениеПС", ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("УслугаДляПовагоннойЗаявки"));
 	МежсервисныеРасходы = Новый Массив;
	МежсервисныеРасходы.Добавить(Перечисления.ТипыКалькуляций.МежсервисныеРасходы);
	МежсервисныеРасходы.Добавить(Перечисления.ТипыКалькуляций.МежсервисныеРасходыРеф);
	Запрос.УстановитьПараметр("МежсервисныеРасходы", МежсервисныеРасходы);
	Запрос.УстановитьПараметр("КонтрагентДирекция", Константы.КонтрагентДирекцияКонтейнерныхПеревозок.Получить());

	
	//ВыборкаПоСтрокамСУЕ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//Евросиб Каблов 09.04.2025 ( #105407 Не используется
	//ГлобальныйОткрытыйПериод = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Сделка.Организация);
	//Евросиб Каблов 09.04.2025 )
	МассивКалькуляцийСоСтавкойЗаВагон = Новый Массив;
	ТаблицаСтрокДляОтвязкиАкцептов = Сделка.Расходы.Выгрузить(,"УчДокумент, ГУИД, Калькуляция, Услуга");
	ТаблицаСтрокДляОтвязкиАкцептов.Очистить();
	
	#КонецОбласти	
	//ТаблицаДляПоиска = Сделка.Расходы; 
	
	
	//Врем = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	Пакеты = Запрос.ВыполнитьПакет();
	КоличествоПакетов = Пакеты.Количество();
	
	//ВыборкаДетали = Пакеты[КоличествоПакетов-1].Выбрать();
	ТаблицаРасходовРезультат = Пакеты[КоличествоПакетов-2].Выгрузить();
	ТаблицаДляФрахта = Пакеты[КоличествоПакетов-1].Выгрузить();
	Для каждого СтрокаРасходРезультат Из ТаблицаРасходовРезультат Цикл 
		Если СтрокаРасходРезультат.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ФрахтИзКалькуляции 
			И НЕ ЗначениеЗаполнено(СтрокаРасходРезультат.ГУИД) Тогда
			//найдем расход который нужно подменить
			СтрокаФрахта = ТаблицаДляФрахта.Найти(СтрокаРасходРезультат.СтрокаСвязьУчетныхЕдиниц, "СтрокаСвязьУчетныхЕдиниц");
			Если ЗначениеЗаполнено(СтрокаФрахта) Тогда
				СтрокаРасходРезультат.ГУИД = СтрокаФрахта.ГУИДРасходов;		
			КонецЕсли;
		КонецЕсли;
		нСтрокаВремРасход = ВремТаблицаРасходов.Добавить();
		ЗаполнитьЗначенияСвойств(нСтрокаВремРасход, СтрокаРасходРезультат);
		Если ЗначениеЗаполнено(СтрокаРасходРезультат.ЖДН) 
			//Евросиб - АСуслов 29.08.2022 12:53:36 #56523
			//(
			//для коносамента вид ждн не заполняется
			И ЗначениеЗаполнено(СтрокаРасходРезультат.ВидЖДН) Тогда
			//)
			//Евросиб - АСуслов 29.08.2022 12:53:45 #56523
			нСтрокаВремРасход.ТранспортныйДокумент = СтрокаРасходРезультат.ЖДН;
		КонецЕсли;
		Если нСтрокаВремРасход.ГУИД = Строка(ПустойУИ) Тогда
			нСтрокаВремРасход.ГУИД = Строка(Новый УникальныйИдентификатор);
		КонецЕсли;
	КонецЦикла;  
КонецПроцедуры

Процедура ОбработатьТаблицуРасходов(ВремТаблицаРасходов, Сделка, МассивОбработанныхСтрок)
	
	СтруктураНеобработанныхСтрок = ПолучитьМассивНеобработанныхСтрок(Сделка);
	МассивНеобработанныхСтрок = СтруктураНеобработанныхСтрок.Расходы;
	АктуальныеГУИДСвязьУчетныхЕдиниц = СтруктураНеобработанныхСтрок.СвязьУчетныхЕдиниц;
	УслугаФрахтаДляКалькуляции = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("УслугаФрахтаДляКалькуляции");
	//МассивНеобработанныхСтрок = Пакеты[КоличествоПакетов-2].Выгрузить().ВыгрузитьКолонку("ГУИД");
	//МассивОбработанныхСтрок = Новый Массив; 
	ВремТаблицаРасходов = ДополнитьТаблицу(ВремТаблицаРасходов, Сделка);
	ТаблицаРасходов = Сделка.Расходы.Выгрузить();
	ТаблицаРасходов = ДополнитьТаблицу(ТаблицаРасходов, Сделка);
	ТаблицаРасходов.Индексы.Добавить("ГУИД");
	//ВсеПоляСравнения = ПолучитьВсеПоляСравнения(ВыборкаДетали);
	//
	//Пока ВыборкаДетали.Следующий() Цикл
	Для каждого ВыборкаДетали Из ВремТаблицаРасходов Цикл
		ВсеПоляСравнения = ПолучитьВсеПоляСравнения(ВыборкаДетали);
		//СтрокаРасходов = Сделка.Расходы.Найти(ВыборкаДетали.ГУИД, "ГУИД");
		СтрокаРасходов = ТаблицаРасходов.Найти(ВыборкаДетали.ГУИД, "ГУИД");
		//сравним значения
		Если СтрокаРасходов <> Неопределено           
			//Евросиб - АСуслов 03.10.2023 12:46:04 #74994
			//(
			И НЕ СтрокаРасходов.УслугаНеИспользовать
			//)
			//Евросиб - АСуслов 03.10.2023 12:46:05 #74994
			И НЕ СтрокаРасходов.УслугаОтключена Тогда 
			//Евросиб - АСуслов 02.06.2022 15:24:58 #
			//(
			Если ВыборкаДетали.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДН
				И НЕ ЗначениеЗаполнено(ВыборкаДетали.ВидЖДН) Тогда
				СтрокаРасходов.УслугаОтключена = Истина;
				СтрокаРасходов.ПричинаОтключенияСтроки = Перечисления.ПричиныОтключенияСтрокиРасходовСделки.ЗаменаЖДН;
				Продолжить;
			КонецЕсли;
			//)
			//Евросиб - АСуслов 02.06.2022 15:24:58 #
			//Евросиб - АСуслов 07.04.2022 12:55:26 #
			//(
			//п.2 замечаний
			МассивОбработанныхСтрок.Добавить(СтрокаРасходов.ГУИД);
			//)
			//Евросиб - АСуслов 07.04.2022 12:55:27 #
			//если ничего не поменялось, то ничего не делаем
			//в запросе должны быть явно прописаны типы для значений по умолчанию
			Если СравнитьДанные(СтрокаРасходов, ВыборкаДетали, ВсеПоляСравнения) Тогда
				ЗаполнитьДанныеСтроки(СтрокаРасходов, ВыборкаДетали, Сделка);
				Продолжить;
			КонецЕсли;	
			//проверим изменение данных в калькуляции
			//отключение строк                 
			//Евросиб - АСуслов 07.04.2022 13:23:17 #
			//( 
			//замечание п.4
			//родителей пунктов отправления/назначения проверим обычным сравнением
			//ПоляСравненияКалькуляция = "Услуга, ГруппаУслуг, ОсновнаяУслугаГруппы, ВнутренняяСебестоимость, ПунктОтправления, ПунктНазначения";
			//ПоляСравненияКалькуляция = "Услуга, ГруппаУслуг, ОсновнаяУслугаГруппы, ВнутренняяСебестоимость";
			кэшМассивПоляСравненияКалькуляция = КлючиАналитикСтрокКалькуляции.ПолучитьСписокКлючевыхПолей(ВыборкаДетали.ИсточникПоявленияСтрокиЭкономики);
			МассивПоляСравненияКалькуляция = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(кэшМассивПоляСравненияКалькуляция);
			ИсключитьПоляСравненияЗаполненныеИзЖДН(МассивПоляСравненияКалькуляция, СтрокаРасходов, ВыборкаДетали);
			ПоляСравненияКалькуляция = СтрСоединить(МассивПоляСравненияКалькуляция, ",");
			ДанныеИдентичны = СравнитьДанные(СтрокаРасходов, ВыборкаДетали, ПоляСравненияКалькуляция);
			//Евросиб - АСуслов 11.07.2022 20:08:45 #
			//(
			//Ниже сравнение с условием добавления данных из ждн,
			//удалим сравнения, если какие-то данные заполнены из ждн
			//)
			//Евросиб - АСуслов 11.07.2022 20:08:45 #
			//Если ДанныеИдентичны 
			//	И НЕ ВыборкаДетали.Услуга = УслугаФрахтаДляКалькуляции 
			//	И НЕ ВыборкаДетали.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ДопУслугаАвтоматически Тогда
			//	//Евросиб - АСуслов 06.07.2022 14:31:43 #
			//	//(
			//	Если НЕ ВыборкаДетали.СтанцияОтправленияЗаполненИзЖДН Тогда
			//		ДанныеИдентичны = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаРасходов.ПунктОтправления, "Родитель") = ВыборкаДетали.ПунктОтправленияРодитель;
			//	КонецЕсли;        
			//	Если Не ВыборкаДетали.СтанцияНазначенияЗаполненИзЖДН Тогда
			//		ДанныеИдентичны = ДанныеИдентичны И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаРасходов.ПунктНазначения, "Родитель") = ВыборкаДетали.ПунктНазначенияРодитель;	
			//	КонецЕсли;
			//	//)
			//	//Евросиб - АСуслов 06.07.2022 14:31:45 #
			//КонецЕсли;
			//)
			//Евросиб - АСуслов 07.04.2022 13:23:18 #
			Если НЕ ДанныеИдентичны Тогда
				//текущую отключаем, новую добавляем
				//в запросе отключенные не связываются по строке калькуляции
				МассивОбработанныхСтрок.Добавить(СтрокаРасходов.ГУИД);
				Если Сделка.НовыйАлгоритмЗаполненияРасходов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сделка.Ссылка, "НовыйАлгоритмЗаполненияРасходов") Тогда
					СтрокаРасходов = ОтключитьИДобавитьСтрокуРасходов(ТаблицаРасходов, СтрокаРасходов, Перечисления.ПричиныОтключенияСтрокиРасходовСделки.ИзменениеКалькуляции, Ложь);
				КонецЕсли;	
			КонецЕсли;    
			//проверим изменение данных в составе поезда
			//отключение строк
			Если ДанныеИдентичны Тогда
				//Евросиб - АСуслов 05.05.2022 13:53:02 #
				//(
				//транспортный документ сравниваем только для фрахта,
				//по ждн отдельная процедура
				//см. ЗаполнитьРасходыПоЖДН
				//ПоляСравненияСоставПоезда = "Контейнер, Вагон, ТранспортныйДокумент";
				ПоляСравненияСоставПоезда = "Контейнер";
				//Если ВыборкаДетали.ЗаполнятьВагонИзЖДН 
				//	ИЛИ (НЕ ЗначениеЗаполнено(ВыборкаДетали.ТранспортныйДокумент)
				//	И ЗначениеЗаполнено(СтрокаРасходов.ТранспортныйДокумент)
				//	И СтрокаРасходов.ЗаполнятьВагонИзЖДН) Тогда
				//	ПоляСравненияСоставПоезда = ПоляСравненияСоставПоезда + ", Вагон";
				//КонецЕсли;
				//Евросиб - АСуслов 30.05.2022 14:49:42 #
				Если ВыборкаДетали.Услуга = УслугаФрахтаДляКалькуляции 
					И НЕ СтрокаРасходов.ТранспортныйДокумент = Документы.ТранспортныйДокумент.ПустаяСсылка() Тогда
					ПоляСравненияСоставПоезда = ПоляСравненияСоставПоезда + ", ТранспортныйДокумент";
				КонецЕсли;
				//)
				//Евросиб - АСуслов 05.05.2022 13:53:02 #
				ДанныеИдентичны = СравнитьДанные(СтрокаРасходов, ВыборкаДетали, ПоляСравненияСоставПоезда);
				Если НЕ ДанныеИдентичны Тогда
					//текущую отключаем, новую добавляем
					//в запросе отключенные не связываются по строке калькуляции
					МассивОбработанныхСтрок.Добавить(СтрокаРасходов.ГУИД);
					Если Сделка.НовыйАлгоритмЗаполненияРасходов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сделка.Ссылка, "НовыйАлгоритмЗаполненияРасходов") Тогда
						СтрокаРасходов = ОтключитьИДобавитьСтрокуРасходов(ТаблицаРасходов, СтрокаРасходов, Перечисления.ПричиныОтключенияСтрокиРасходовСделки.ИзменениеЗаявки, Ложь);
					КонецЕсли;
				ИначеЕсли СтрокаРасходов.ТранспортныйДокумент <> ВыборкаДетали.ТранспортныйДокумент Тогда
					//СтрокаРасход = ОтключитьИДобавитьСтрокуРасходов(Сделка.Расходы, СтрокаРасход, Перечисления.ПричиныОтключенияСтрокиРасходовСделки.ЗаменаЖДН, Истина);
					//СтрокаРасход.УслугаОтключена = Истина;
					//получим новую строку            
					//если ждн не было, то просто заполним поле
					Если НЕ ЗначениеЗаполнено(СтрокаРасходов.ТранспортныйДокумент) Тогда
						СтрокаРасходов.ТранспортныйДокумент = ВыборкаДетали.ТранспортныйДокумент;
						СтрокаРасходов.ВидЖДН = ВыборкаДетали.ВидЖДН;
					//если номер остался прежним, то поменяем ссылку
					ИначеЕсли ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаРасходов.ТранспортныйДокумент, "НомерТранспортногоДокумента") =
						ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДетали.ТранспортныйДокумент, "НомерТранспортногоДокумента") Тогда
						СтрокаРасходов.ТранспортныйДокумент = ВыборкаДетали.ТранспортныйДокумент;
					Иначе    
						Если Сделка.НовыйАлгоритмЗаполненияРасходов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сделка.Ссылка, "НовыйАлгоритмЗаполненияРасходов") Тогда
							СтрокаРасходов = ОтключитьИДобавитьСтрокуРасходов(ТаблицаРасходов, СтрокаРасходов, Перечисления.ПричиныОтключенияСтрокиРасходовСделки.ЗаменаЖДН, Истина);
							ДанныеИдентичны = Ложь;
						КонецЕсли;
						СтрокаРасходов.ВидЖДН = ВыборкаДетали.ВидЖДН;
						СтрокаРасходов.ТранспортныйДокумент = ВыборкаДетали.ТранспортныйДокумент;
					КонецЕсли;
					//НайдСтрокиРасходов[0].УслугаОтключена = Истина;
				КонецЕсли;
			КонецЕсли;
			//проверим изменение данных по полям без отключения строк
			//обновление строк  
			//Евросиб - АСуслов 29.08.2022 11:44:12 #56523
			//(
			//ненужный кусок
			//Если ДанныеИдентичны Тогда
			//	ПоляСравнения = "Калькуляция, Поставщик, Договор, ПлановаяСтоимостьИзЖДН, ПунктОтправления,
			//					|ПунктНазначения, Себестоимость, СтавкаНДС, НДСВключенВСтоимость, Валюта, ОтнестиНаЗатраты,
			//					|Вагон";
			//	ДанныеИдентичны = СравнитьДанные(СтрокаРасходов, ВыборкаДетали, ПоляСравнения);
			//	Если ДанныеИдентичны Тогда                                
			//		//Евросиб - АСуслов 07.04.2022 12:55:10 #
			//		//(
			//		//п.2 замечаний
			//		//перенес выше, как только строка найдена, помечаем её как отработанную
			//		//МассивОбработанныхСтрок.Добавить(СтрокаРасходов.ГУИД);
			//		//)
			//		//Евросиб - АСуслов 07.04.2022 12:55:10 #
			//		Продолжить;   
			//	КонецЕсли;
			//КонецЕсли;
			//)
			//Евросиб - АСуслов 29.08.2022 11:44:14 #56523
		КонецЕсли;
		Если СтрокаРасходов = Неопределено                                                 
			//Евросиб - АСуслов 06.09.2022 13:07:38 #
			//(
			ИЛИ (СтрокаРасходов.УслугаОтключена И Не СтрокаРасходов.УслугаОтключенаУсловно)
			//)
			//Евросиб - АСуслов 06.09.2022 13:07:38 #
			ИЛИ ВыборкаДетали.ГУИД = ""
			Тогда
			//СтрокаРасходов = Сделка.Расходы.Добавить();
			СтрокаРасходов = ТаблицаРасходов.Добавить();
			СтрокаРасходов.ГУИД 				= Новый УникальныйИдентификатор;
			//Евросиб Каблов 03.03.2026 ( Ticket#0427865
			СтрокаРасходов.УслугаОтключена = Ложь;
			//Евросиб Каблов 03.03.2026 ) Ticket#0427865
		КонецЕсли; 
		//СтрокаРасходов.Вагон = ВыборкаДетали.СписокВагонов;
		//СтрокаРасходов.Контейнер = ВыборкаДетали.СписокКТК;
		//СтрокаРасходов.ТранспортныйДокумент = ВыборкаДетали.СписокТД;
		//ЗаполнитьЗначенияСвойств(СтрокаРасходов, ВыборкаДетали,,"ГУИД, НеВключатьВПлановыеРасходы, СтавкаНДС, НДСВключенВСтоимость, УчДокумент");
		//Если НЕ ЗначениеЗаполнено(СтрокаРасходов.УчДокумент) Тогда
		//	СтрокаРасходов.СтавкаНДС			= ВыборкаДетали.СтавкаНДС;
		//	СтрокаРасходов.НДСВключенВСтоимость = ВыборкаДетали.НДСВключенВСтоимость;
		//КонецЕсли; 
		//СтрокаРасходов.НоменклатурнаяГруппа = РазнесениеЗатратСервер.ПодобратьНоменклатурнуюГруппуПоНаборуПараметров(Сделка.ТипЗаказа, ВыборкаДетали.Вагон);
		////СтрокаРасходов.ПериодВО = ?(ЗначениеЗаполнено(ВыборкаДетали.ПериодВО), ВыборкаДетали.ПериодВО, ГлобальныйОткрытыйПериод);
		//СтрокаРасходов.СебестоимостьИтого		= СтрокаРасходов.Себестоимость * СтрокаРасходов.Количество;
		//СтрокаРасходов.СуммаНДС 				= БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СтрокаРасходов.СебестоимостьИтого,	БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СтрокаРасходов.СтавкаНДС), Истина, СтрокаРасходов.НДСВключенВСтоимость);
		//СтрокаРасходов.СуммаИтого 				= СтрокаРасходов.СебестоимостьИтого + ?(СтрокаРасходов.НДСВключенВСтоимость, 0, СтрокаРасходов.СуммаНДС);
		ЗаполнитьДанныеСтроки(СтрокаРасходов, ВыборкаДетали, Сделка);
		//Если ВыборкаДетали.ПлановаяСтоимостьИзЖДН = Истина Тогда
		//	СтрокаРасходов.СтавкаНДС = ВыборкаДетали.СтавкаНДСИзЖДН;
		//	СтрокаРасходов.Валюта = Справочники.Валюты.Рубль;
		//	СтрокаРасходов.Себестоимость = ВыборкаДетали.СтоимостьИзЖДН;
		//	СтрокаРасходов.СебестоимостьИтого		= СтрокаРасходов.Себестоимость * СтрокаРасходов.Количество;
		//	//СтрокаРасходов.СуммаНДС 				= БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СтрокаРасходов.СебестоимостьИтого,	БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ВыборкаДетали.СтавкаНДСИзЖДН), Истина, Истина);
		//	СтрокаРасходов.СуммаНДС 				= ВыборкаДетали.СуммаНДСИзЖДН;
		//	СтрокаРасходов.СуммаИтого 				= СтрокаРасходов.СебестоимостьИтого + ?(Истина, 0, СтрокаРасходов.СуммаНДС);
		//КонецЕсли; 
		МассивИсточниковСПустойНоменклатурой = Новый Массив;
		МассивИсточниковСПустойНоменклатурой.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ОсновнаяУслугаАвтоматически);
		МассивИсточниковСПустойНоменклатурой.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДНВозврата);
		МассивИсточниковСПустойНоменклатурой.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДНПодсылаВагонов);
		МассивИсточниковСПустойНоменклатурой.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДНПодсылаКТК);
		МассивИсточниковСПустойНоменклатурой.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ПорожняяЖДН);
		Документы.Сделка.СвязатьДоходыРасходыСУЕ(Сделка,,
		СтрокаРасходов.ГУИД,
		СтрокаРасходов.СтрокаСвязьУчетныхЕдиниц,
		?(МассивИсточниковСПустойНоменклатурой.Найти(СтрокаРасходов.ИсточникПоявленияСтрокиЭкономики) <> Неопределено, Неопределено, СтрокаРасходов.Услуга));
	КонецЦикла; 
	//КонецЕсли; 
	//КонецЦикла;  
	МассивНеобработанныхСтрок = ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивНеобработанныхСтрок, МассивОбработанныхСтрок);
	//Все необработанные строки пометим на удаление, т.к. по ним нет новых данных по калькуляциям
	Для каждого НеобработаннаяСтрока Из МассивНеобработанныхСтрок Цикл
		//СтрокаРасходов = Сделка.Расходы.Найти(НеобработаннаяСтрока, "ГУИД");
		СтрокаРасходов = ТаблицаРасходов.Найти(НеобработаннаяСтрока, "ГУИД");
		Если АктуальныеГУИДСвязьУчетныхЕдиниц.Найти(СтрокаРасходов.СтрокаСвязьУчетныхЕдиниц) = Неопределено Тогда
			СтрокаРасходов.ПричинаОтключенияСтроки = Перечисления.ПричиныОтключенияСтрокиРасходовСделки.ИзменениеЗаявки;
		Иначе
			СтрокаРасходов.ПричинаОтключенияСтроки = Перечисления.ПричиныОтключенияСтрокиРасходовСделки.ИзменениеКалькуляции;
		КонецЕсли;
		//СтрокаРасходов = Неопределено;
		//Евросиб - АСуслов 03.10.2023 12:51:01 #74994
		//(
		Если СтрокаРасходов.УслугаНеИспользовать = Ложь 
			ИЛИ Не ЗначениеЗаполнено(СтрокаРасходов.УчДокумент) Тогда
			СтрокаРасходов.УслугаОтключена = Истина;
		КонецЕсли;
		//)
		//Евросиб - АСуслов 03.10.2023 12:51:05 #74994
	КонецЦикла;   
	
	//Евросиб Каблов 03.03.2026 ( Ticket#0427865
	ИсточникПоявленияСтрокиЭкономикиЖДН = Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДН;
	ПричинаОтключенияДублированиеРасходов = Перечисления.ПричиныОтключенияСтрокиРасходовСделки.ДублированиеРасходов;
	ПоляПоискаДублей = "Клиент,Контейнер,Услуга,ТранспортныйДокумент,ВидЖДН,УслугаОтключена";
	СтруктураПоискаДублей = Новый Структура(ПоляПоискаДублей);
	
	СтрокиРасходов = ТаблицаРасходов.НайтиСтроки(Новый Структура("ИсточникПоявленияСтрокиЭкономики,ВидЖДН,УслугаОтключена", ИсточникПоявленияСтрокиЭкономикиЖДН, Справочники.ВидыЖДН.ГруженаяЖДН, Ложь));
	Для Каждого СтрокаРасходов Из СтрокиРасходов Цикл
		
		Если СтрокаРасходов.УслугаОтключена Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтруктураПоискаДублей, СтрокаРасходов);
		НайденныеСтроки = ТаблицаРасходов.НайтиСтроки(СтруктураПоискаДублей);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			
			Если НайденнаяСтрока = СтрокаРасходов Тогда
				Продолжить;
			КонецЕсли;
			
			Если НайденнаяСтрока.ИсточникПоявленияСтрокиЭкономики = ИсточникПоявленияСтрокиЭкономикиЖДН И Не ЗначениеЗаполнено(НайденнаяСтрока.УчДокумент) Тогда
				НайденнаяСтрока.УслугаОтключена = Истина;
				НайденнаяСтрока.УслугаОтключенаУсловно = Истина;
				НайденнаяСтрока.ПричинаОтключенияСтроки = ПричинаОтключенияДублированиеРасходов;
			ИначеЕсли Не ЗначениеЗаполнено(СтрокаРасходов.УчДокумент) Тогда
				СтрокаРасходов.УслугаОтключена = Истина;
				СтрокаРасходов.УслугаОтключенаУсловно = Истина;
				СтрокаРасходов.ПричинаОтключенияСтроки = ПричинаОтключенияДублированиеРасходов;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	//Евросиб Каблов 03.03.2026 )
	
	Сделка.Расходы.Загрузить(ТаблицаРасходов);
	
КонецПроцедуры                        

Процедура ЗаполнитьДанныеСтроки(СтрокаРасходов, ВыборкаДетали, Сделка)
	//Евросиб Каблов 10.11.2022 ( 52045 
	//ЗаполнитьЗначенияСвойств(СтрокаРасходов, ВыборкаДетали,,"ГУИД, НеВключатьВПлановыеРасходы, СтавкаНДС, НДСВключенВСтоимость, УчДокумент, УслугаОтключена, УслугаОтключенаУсловно");
	//Евросиб - АСуслов 09.12.2022 16:11:09 #62448
	//(
	//ЗаполнитьЗначенияСвойств(СтрокаРасходов, ВыборкаДетали,, "ГУИД, НеВключатьВПлановыеРасходы, СтавкаНДС, НДСВключенВСтоимость, УчДокумент, УслугаОтключена, УслугаОтключенаУсловно, ПеренесеннаяСделка, СтрокаРасходовВПеренесеннойСделке");
	ЗаполнитьЗначенияСвойств(СтрокаРасходов, ВыборкаДетали,, "ГУИД, НеВключатьВПлановыеРасходы, СтавкаНДС, НДСВключенВСтоимость, УчДокумент, УслугаОтключена, УслугаОтключенаУсловно, ПеренесеннаяСделка, ПеренесеннаяСделкаИсточник, СтрокаРасходовВПеренесеннойСделке, СтрокаРасходовВСделкеИсточник");
	//)
	//Евросиб - АСуслов 09.12.2022 16:11:11 #62448
	//Евросиб Каблов 10.11.2022 )       
	//Евросиб - АСуслов 24.05.2023 16:40:11 #
	//(
	СтрокаРасходов.АвтоматическиПривязыватьРасходКДоходу = Истина;
	//)
	//Евросиб - АСуслов 24.05.2023 16:07:16 #

	//)
	//Евросиб - АСуслов 24.05.2023 16:40:11 #
	Если НЕ ЗначениеЗаполнено(СтрокаРасходов.УчДокумент) Тогда
		СтрокаРасходов.СтавкаНДС			= ВыборкаДетали.СтавкаНДС;
		СтрокаРасходов.НДСВключенВСтоимость = ВыборкаДетали.НДСВключенВСтоимость;
	КонецЕсли; 
	//СтрокаРасходов.НоменклатурнаяГруппа = РазнесениеЗатратСервер.ПодобратьНоменклатурнуюГруппуПоНаборуПараметров(Сделка.ТипЗаказа, ВыборкаДетали.Вагон);
	//СтрокаРасходов.ПериодВО = ?(ЗначениеЗаполнено(ВыборкаДетали.ПериодВО), ВыборкаДетали.ПериодВО, ГлобальныйОткрытыйПериод);
	СтрокаРасходов.СебестоимостьИтого		= СтрокаРасходов.Себестоимость * СтрокаРасходов.Количество;
	СтрокаРасходов.СуммаНДС 				= БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СтрокаРасходов.СебестоимостьИтого,	БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СтрокаРасходов.СтавкаНДС), Истина, СтрокаРасходов.НДСВключенВСтоимость);
	СтрокаРасходов.СуммаИтого 				= СтрокаРасходов.СебестоимостьИтого + ?(СтрокаРасходов.НДСВключенВСтоимость, 0, СтрокаРасходов.СуммаНДС);
КонецПроцедуры


Функция ПолучитьМассивНеобработанныхСтрок(Сделка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаРасходы.ГУИД КАК ГУИД
	|ПОМЕСТИТЬ ВТ_Расходы
	|ИЗ
	|	Документ.Сделка.Расходы КАК СделкаРасходы
	|ГДЕ
	|	НЕ СделкаРасходы.УслугаОтключена
	|	И СделкаРасходы.ИсточникПоявленияСтрокиЭкономики В(&ИсточникПоявленияСтрокиЭкономики)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД
	|ПОМЕСТИТЬ ВТ_СвязьУчетныхЕдиниц
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|ГДЕ
	|	НЕ СделкаСвязьУчетныхЕдиниц.Удалена
	|	И НЕ СделкаСвязьУчетныхЕдиниц.ОтключитьРасходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Расходы.ГУИД КАК ГУИД
	|ИЗ
	|	ВТ_Расходы КАК ВТ_Расходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СвязьУчетныхЕдиниц.ГУИД КАК ГУИД
	|ИЗ
	|	ВТ_СвязьУчетныхЕдиниц КАК ВТ_СвязьУчетныхЕдиниц";                              
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.Расходы", "&Расходы");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.СвязьУчетныхЕдиниц", "&СвязьУчетныхЕдиниц");
	Запрос.УстановитьПараметр("Расходы", Сделка.Расходы.Выгрузить());
	Запрос.УстановитьПараметр("СвязьУчетныхЕдиниц", Сделка.СвязьУчетныхЕдиниц.Выгрузить());
	МассивИсточниковПоявленияСтрокиЭкономики = Новый Массив;
	МассивИсточниковПоявленияСтрокиЭкономики.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ОсновнаяУслугаАвтоматически);
	МассивИсточниковПоявленияСтрокиЭкономики.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ДопУслугаАвтоматически);
	МассивИсточниковПоявленияСтрокиЭкономики.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ФрахтИзКалькуляции);
	МассивИсточниковПоявленияСтрокиЭкономики.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДН);
	Запрос.УстановитьПараметр("ИсточникПоявленияСтрокиЭкономики", МассивИсточниковПоявленияСтрокиЭкономики);
	Пакеты = Запрос.ВыполнитьПакет();
	КоличествоПакетов = Пакеты.Количество();
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("Расходы",Пакеты[КоличествоПакетов-2].Выгрузить().ВыгрузитьКолонку("ГУИД"));
	СтруктураРезультата.Вставить("СвязьУчетныхЕдиниц",Пакеты[КоличествоПакетов-1].Выгрузить().ВыгрузитьКолонку("ГУИД"));
	Возврат СтруктураРезультата;
	
КонецФункции

Процедура ИсключитьПоляСравненияЗаполненныеИзЖДН(МассивПолейДляСравнения, СтарыеДанныеВСтроке, НовыеДанныеВСтроке)
	
	ПоляДляУдаления = Новый Массив;
	УслугаФрахтаДляКалькуляции = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("УслугаФрахтаДляКалькуляции");
	//костыль для фрахта
	Если НовыеДанныеВСтроке.Услуга = УслугаФрахтаДляКалькуляции Тогда
		Если НовыеДанныеВСтроке.КалькуляцияФрахтИмпорт Тогда
			МассивПолейДляСравнения.Добавить("ПунктОтправления");
		Иначе
			МассивПолейДляСравнения.Добавить("ПунктНазначения");
		КонецЕсли;
	КонецЕсли;
	Для каждого ПолеДляСравнения Из МассивПолейДляСравнения Цикл
		Если //НовыеДанныеВСтроке.ЗаполнятьВагонИзЖДН 
			//ИЛИ
			НЕ ЗначениеЗаполнено(НовыеДанныеВСтроке.ТранспортныйДокумент)
			И ЗначениеЗаполнено(СтарыеДанныеВСтроке.ТранспортныйДокумент)
			//И СтарыеДанныеВСтроке.ЗаполнятьВагонИзЖДН)
			Тогда
			Если СтрНайти(ПолеДляСравнения, "Вагон") > 0 Тогда
				ПоляДляУдаления.Добавить(ПолеДляСравнения);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		Если НовыеДанныеВСтроке.ЗаполнятьСтанциюОтправленияИзЖДН 
			ИЛИ (НЕ ЗначениеЗаполнено(НовыеДанныеВСтроке.ТранспортныйДокумент)
			И ЗначениеЗаполнено(СтарыеДанныеВСтроке.ТранспортныйДокумент)
			И СтарыеДанныеВСтроке.ЗаполнятьСтанциюОтправленияИзЖДН) Тогда
			Если СтрНайти(ПолеДляСравнения, "ПунктОтправления") > 0 Тогда
				ПоляДляУдаления.Добавить(ПолеДляСравнения);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		Если НовыеДанныеВСтроке.ЗаполнятьСтанциюНазначенияИзЖДН 
			ИЛИ (НЕ ЗначениеЗаполнено(НовыеДанныеВСтроке.ТранспортныйДокумент)
			И ЗначениеЗаполнено(СтарыеДанныеВСтроке.ТранспортныйДокумент)
			И СтарыеДанныеВСтроке.ЗаполнятьСтанциюНазначенияИзЖДН) Тогда
			Если СтрНайти(ПолеДляСравнения, "ПунктНазначения") > 0 Тогда
				ПоляДляУдаления.Добавить(ПолеДляСравнения);
				Продолжить;
			КонецЕсли;
		КонецЕсли; 
		//Евросиб - АСуслов 13.09.2023 16:58:41 #74879
		//(
		Если НЕ НовыеДанныеВСтроке.ТранспортныйДокумент = Документы.ТранспортныйДокумент.ПустаяСсылка() 
			И НовыеДанныеВСтроке.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ОсновнаяУслугаАвтоматически
			И НовыеДанныеВСтроке.Услуга = УслугаФрахтаДляКалькуляции Тогда
			Если СтрНайти(ПолеДляСравнения, "Пункт") > 0 Тогда
				ПоляДляУдаления.Добавить(ПолеДляСравнения);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		//)
		//Евросиб - АСуслов 13.09.2023 16:59:15 #74879
	КонецЦикла;       
	Для каждого ПолеДляУдаления Из ПоляДляУдаления Цикл
		МассивПолейДляСравнения.Удалить(МассивПолейДляСравнения.Найти(ПолеДляУдаления));
	КонецЦикла;
	
КонецПроцедуры


Функция ДополнитьТаблицу(ВремТаблицаРасходов, Сделка)


	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ *, 
	|	СделкаРасходы.ВидЖДН,
	//Евросиб Каблов 03.03.2026 ( Ticket#0427865
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц,
	//Евросиб Каблов 03.03.2026 ) Ticket#0427865
	|	ВЫРАЗИТЬ(СделкаРасходы.Услуга КАК Справочник.Номенклатура) КАК УслугаРасход, 
	|	ВЫРАЗИТЬ(СделкаРасходы.Калькуляция КАК Документ.Калькуляция) КАК Калькуляция,
	|	ВЫРАЗИТЬ(СделкаРасходы.Вагон КАК Справочник.ТС) КАК Вагон,
	|   СделкаРасходы.ГУИД КАК ГУИД,
	|	СделкаРасходы.НомерСтроки КАК НомерСтрокиРасходов
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&Расходы КАК СделкаРасходы
	|;
	//Евросиб Каблов 03.03.2026 ( Ticket#0427865
	|ВЫБРАТЬ 
	|	ТаблицаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД, 
	|	ТаблицаСвязьУчетныхЕдиниц.Клиент КАК Клиент
	|ПОМЕСТИТЬ ТаблицаСвязьУчетныхЕдиниц
	|ИЗ
	|	&ТаблицаСвязьУчетныхЕдиниц КАК ТаблицаСвязьУчетныхЕдиниц
	|;
	//Евросиб Каблов 03.03.2026 ) Ticket#0427865
	|
	|ВЫБРАТЬ
	|	ПризнакСобственностиВагонаСрезПоследних.Вагон КАК Вагон,
	|	ПризнакСобственностиВагонаСрезПоследних.ПризнакСобственности КАК ПризнакСобственности
	|ПОМЕСТИТЬ ВТ_ПризнакиСобственностиВагонов
	|ИЗ
	|	РегистрСведений.ПризнакСобственностиВагона.СрезПоследних(&Дата, Вагон В (ВЫБРАТЬ т.Вагон ИЗ ВТ КАК т)) КАК ПризнакСобственностиВагонаСрезПоследних
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Расходы.ГУИД КАК ГУИД,
	|	ВТ_Расходы.Вагон КАК Вагон,
	|	ОпределениеНоменклатурнойГруппы.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	1 КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ОпределениеНоменклатурнойГруппыСПриоритетами
	|ИЗ
	|	ВТ КАК ВТ_Расходы
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПризнакиСобственностиВагонов КАК ПризнакиСобственностиВагонов
	|	ПО ВТ_Расходы.Вагон = ПризнакиСобственностиВагонов.Вагон
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОпределениеНоменклатурнойГруппы КАК ОпределениеНоменклатурнойГруппы
	|	ПО ОпределениеНоменклатурнойГруппы.ТипЗаказа = &ТипЗаказа
	|	И ЕСТЬNULL(ПризнакиСобственностиВагонов.ПризнакСобственности, Значение(Перечисление.ВариантыСобственности.ПустаяСсылка)) = ОпределениеНоменклатурнойГруппы.ВидСобственности
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Расходы.ГУИД,
	|	ВТ_Расходы.Вагон,
	|	ОпределениеНоменклатурнойГруппы.НоменклатурнаяГруппа,
	|	2
	|ИЗ
	|	ВТ КАК ВТ_Расходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОпределениеНоменклатурнойГруппы КАК ОпределениеНоменклатурнойГруппы
	|		ПО ОпределениеНоменклатурнойГруппы.ТипЗаказа = &ТипЗаказа
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0378454, 06-12-2024, начало
	|			И ОпределениеНоменклатурнойГруппы.ВидСобственности = Значение(Перечисление.ВариантыСобственности.ПустаяСсылка)
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0378454, 06-12-2024, конец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОпределениеНоменклатурнойГруппыСПриоритетами.ГУИД КАК ГУИД,
	//Евросиб - АСуслов 28.11.2023 13:53:50 #77908
	//(
	//по части расходов гуиды заполняются позже, поэтому дополнительно соединим по вагону
	|	ВТ_ОпределениеНоменклатурнойГруппыСПриоритетами.Вагон КАК Вагон,
	//)
	//Евросиб - АСуслов 28.11.2023 13:53:52 #77908
	|	МИНИМУМ(ВТ_ОпределениеНоменклатурнойГруппыСПриоритетами.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ПриоритетыНоменклатурныхГрупп
	|ИЗ
	|	ВТ_ОпределениеНоменклатурнойГруппыСПриоритетами КАК ВТ_ОпределениеНоменклатурнойГруппыСПриоритетами
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОпределениеНоменклатурнойГруппыСПриоритетами.ГУИД,
	//Евросиб - АСуслов 28.11.2023 13:54:34 #77908
	//(
	|	ВТ_ОпределениеНоменклатурнойГруппыСПриоритетами.Вагон
	//)
	//Евросиб - АСуслов 28.11.2023 13:54:36 #77908
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОпределениеНоменклатурнойГруппыСПриоритетами.ГУИД КАК ГУИД,
	//Евросиб - АСуслов 28.11.2023 13:54:43 #77908
	//(
	|	ВТ_ОпределениеНоменклатурнойГруппыСПриоритетами.Вагон КАК Вагон,
	//)
	//Евросиб - АСуслов 28.11.2023 13:54:45 #77908
	|	ВТ_ОпределениеНоменклатурнойГруппыСПриоритетами.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
	|ПОМЕСТИТЬ ВТ_ОпределениеНоменклатурнойГруппы
	|ИЗ
	|	ВТ_ОпределениеНоменклатурнойГруппыСПриоритетами КАК ВТ_ОпределениеНоменклатурнойГруппыСПриоритетами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПриоритетыНоменклатурныхГрупп КАК ВТ_ПриоритетыНоменклатурныхГрупп
	|		ПО (ВТ_ОпределениеНоменклатурнойГруппыСПриоритетами.ГУИД = ВТ_ПриоритетыНоменклатурныхГрупп.ГУИД)
	//Евросиб - АСуслов 28.11.2023 13:54:52 #77908
	//(
	|  			И 	ВТ_ОпределениеНоменклатурнойГруппыСПриоритетами.Вагон = ВТ_ПриоритетыНоменклатурныхГрупп.Вагон
	//)
	//Евросиб - АСуслов 28.11.2023 13:54:54 #77908
	|			И (ВТ_ОпределениеНоменклатурнойГруппыСПриоритетами.Приоритет = ВТ_ПриоритетыНоменклатурныхГрупп.Приоритет)
	|;
	|///////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ВТ.*,
	|   ВТ.НомерСтрокиРасходов,
	|   &ПоляКлючейАналитики,
	|	ВТ.Калькуляция.ФрахтИмпорт КАК КалькуляцияФрахтИмпорт,
	//|   ЕСТЬNULL(ВидыЖДНУслуги.ЗаполнятьВагонИзЖДН, ЛОЖЬ) КАК ЗаполнятьВагонИзЖДН,
	|   ЕСТЬNULL(ВидыЖДНУслуги.ЗаполнятьСтанциюОтправленияИзЖДН, ЛОЖЬ) КАК ЗаполнятьСтанциюОтправленияИзЖДН,
	|   ЕСТЬNULL(ВидыЖДНУслуги.ЗаполнятьСтанциюНазначенияИзЖДН, ЛОЖЬ) КАК ЗаполнятьСтанциюНазначенияИзЖДН,
	//|  ,
	//|	ЕСТЬNULL(ВТ.ПунктНазначения.Родитель, НЕОПРЕДЕЛЕНО) КАК ПунктНазначенияРодитель,
	//|	ЕСТЬNULL(ВТ.ПунктОтправления.Родитель, НЕОПРЕДЕЛЕНО) КАК ПунктОтправленияРодитель
	//Евросиб - АСуслов 17.10.2023 14:44:15 #
	//(
	//настройки в шаблонах ключей аналитики строк калькуляции
	//)
	//Евросиб - АСуслов 17.10.2023 14:44:19 #
	//Евросиб Коханенко Н.А. 01.08.2023 (( #72829
	//|	ВЫБОР
	//|		КОГДА ВТ.Калькуляция.ТипКалькуляции В(&МежсервисныеРасходы)
	//| 			И ВТ.Калькуляция.Контрагент = &КонтрагентДирекция
	//| 			И ВТ.Калькуляция.ОтнестиРасходыНаСебестоимостьКлиента 
	//|		ТОГДА ИСТИНА
	////Евросиб Коханенко Н.А. 08.08.2023 (( #73570 
	////|	КОНЕЦ КАК ВнутрСебестоимость,
	//|	КОНЕЦ КАК Подсыл,
	//Евросиб Коханенко Н.А. 08.08.2023 )) #73570 
	//Евросиб Коханенко Н.А. 01.08.2023 )) #72829 
	//БИТ Белинский Д.А. 17.04.2023 -начало  
	//|	ВЫБОР
	//|		КОГДА ВТ.Калькуляция.ТипКалькуляции В(&МежсервисныеРасходы)
	////Евросиб Коханенко Н.А. 01.08.2023 (( #72829
	////ужесточаем условия согласно п.4
	//| 			И ВТ.Калькуляция.Контрагент = &КонтрагентДирекция
	//| 			И ВТ.Калькуляция.ОтнестиРасходыНаСобственныеЗатраты 
	////Евросиб Коханенко Н.А. 01.08.2023 )) #72829 
	//|		ТОГДА ИСТИНА
	////БИТ Белинский Д.А. 17.04.2023 -конец 
	////|		ИНАЧЕ ВТ.ОтнестиНаЗатраты
	//|	КОНЕЦ КАК ОтнестиНаЗатраты,                            
	|   ОпределениеНоменклатурнойГруппы.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	//Евросиб Каблов 03.03.2026 ( Ticket#0427865
	|	ТаблицаСвязьУчетныхЕдиниц.Клиент КАК Клиент,
	//Евросиб Каблов 03.03.2026 ) Ticket#0427865
	//Евросиб - АСуслов 03.10.2023 12:48:18 #74994
	//(
	|	ВТ.УслугаРасход.НеИспользовать КАК УслугаНеИспользовать
	//)
	//Евросиб - АСуслов 03.10.2023 12:48:25 #74994
	|ИЗ
	|	ВТ КАК ВТ
	|   ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЖДН.СвязанныеУслуги КАК ВидыЖДНУслуги
	|   ПО ВТ.ВидЖДН = ВидыЖДНУслуги.Ссылка
	|   	И ВТ.УслугаРасход = ВидыЖДНУслуги.Услуга                         
	|   ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОпределениеНоменклатурнойГруппы КАК ОпределениеНоменклатурнойГруппы
	|   	ПО ВТ.ГУИД = ОпределениеНоменклатурнойГруппы.ГУИД
	//Евросиб - АСуслов 28.11.2023 13:55:06 #77908
	//(
	|   	И ВТ.Вагон = ОпределениеНоменклатурнойГруппы.Вагон
	//)
	//Евросиб - АСуслов 28.11.2023 13:55:07 #77908
	//Евросиб Каблов 03.03.2026 ( Ticket#0427865
	|	ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСвязьУчетныхЕдиниц
	|		ПО ВТ.СтрокаСвязьУчетныхЕдиниц = ТаблицаСвязьУчетныхЕдиниц.ГУИД
	//Евросиб Каблов 03.03.2026 ) Ticket#0427865
	|УПОРЯДОЧИТЬ ПО ВТ.НомерСтрокиРасходов";          
	
	ЗапросКлючейАналитики = Новый Запрос;
	ЗапросКлючейАналитики.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КлючиАналитикиСтрокКалькуляцииКлючевыеПоля.ИмяПоля КАК ИмяПоля,
	|	КлючиАналитикиСтрокКалькуляцииКлючевыеПоля.ИмяПоляСделка КАК ИмяПоляСделка
	|ИЗ
	|	Справочник.КлючиАналитикиСтрокКалькуляции.КлючевыеПоля КАК КлючиАналитикиСтрокКалькуляцииКлючевыеПоля
	|ГДЕ
	|	КлючиАналитикиСтрокКалькуляцииКлючевыеПоля.Ссылка.ИспользуетсяКакШаблон
	|	И НЕ КлючиАналитикиСтрокКалькуляцииКлючевыеПоля.Ссылка.ПометкаУдаления";
	ВыборкаПолейКлючейАналитики = ЗапросКлючейАналитики.Выполнить().Выбрать();
	ТекстВыборкиПолейКлючейАналитики = "";
	Пока ВыборкаПолейКлючейАналитики.Следующий() Цикл            
		Если НЕ ЗначениеЗаполнено(ВыборкаПолейКлючейАналитики.ИмяПоляСделка) Тогда
			ТекстИмяПоля = СтрШаблон("ЕСТЬNULL(ВТ.%1, НЕОПРЕДЕЛЕНО) КАК %2,
			|", ВыборкаПолейКлючейАналитики.ИмяПоля, СтрЗаменить(ВыборкаПолейКлючейАналитики.ИмяПоля, ".", ""));
		Иначе
			ТекстИмяПоля = СтрШаблон("ЕСТЬNULL(ВТ.%1, НЕОПРЕДЕЛЕНО) КАК %2,
			|", ВыборкаПолейКлючейАналитики.ИмяПоляСделка, СтрЗаменить(ВыборкаПолейКлючейАналитики.ИмяПоляСделка, ".", ""));
		КонецЕсли;
		ТекстВыборкиПолейКлючейАналитики = ТекстВыборкиПолейКлючейАналитики + ТекстИмяПоля;
	КонецЦикла; 
	//ТекстВыборкиПолейКлючейАналитики = Лев(ТекстВыборкиПолейКлючейАналитики, СтрДлина(ТекстВыборкиПолейКлючейАналитики)-2);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПоляКлючейАналитики,", ТекстВыборкиПолейКлючейАналитики);
	
	Запрос.УстановитьПараметр("Расходы", ВремТаблицаРасходов);
	Запрос.УстановитьПараметр("ТипЗаказа", Сделка.ТипЗаказа); 
	Запрос.УстановитьПараметр("Дата", Сделка.Дата);
	//Евросиб Каблов 03.03.2026 ( Ticket#0427865
	ТаблицаСвязьУчетныхЕдиниц = Сделка.СвязьУчетныхЕдиниц.Выгрузить(, "ГУИД, Клиент");
	Запрос.УстановитьПараметр("ТаблицаСвязьУчетныхЕдиниц", ТаблицаСвязьУчетныхЕдиниц);
	//Евросиб Каблов 03.03.2026 ) Ticket#0427865
	//БИТ Белинский Д.А. 17.04.2023 -начало  
	МежсервисныеРасходы = Новый Массив;
	МежсервисныеРасходы.Добавить(Перечисления.ТипыКалькуляций.МежсервисныеРасходы);
	МежсервисныеРасходы.Добавить(Перечисления.ТипыКалькуляций.МежсервисныеРасходыРеф);
	Запрос.УстановитьПараметр("МежсервисныеРасходы", МежсервисныеРасходы);
	//БИТ Белинский Д.А. 17.04.2023 -конец 
	//Евросиб Коханенко Н.А. 01.08.2023 (( #72829 
	Запрос.УстановитьПараметр("КонтрагентДирекция", Константы.КонтрагентДирекцияКонтейнерныхПеревозок.Получить());
	//Евросиб Коханенко Н.А. 01.08.2023 )) #72829 
	РезультатЗапроса = Запрос.Выполнить(); 
	ВремТаблицаРасходов = РезультатЗапроса.Выгрузить();
	//Евросиб Коханенко Н.А. 01.08.2023 (( #72829 
	//попытка обойти ошибку выполнения: "Повторяющийся псевдоним Внутренняя Себестоимость"
	//Для Каждого Стр Из ВремТаблицаРасходов Цикл
	//	//Евросиб Коханенко Н.А. 08.08.2023 (( #73570 
	//	//Стр.ВнутренняяСебестоимость = Стр.ВнутрСебестоимость;
	//	//попытка обойти ошибку выполнения: "Повторяющийся псевдоним Подсыл"
	//	Стр.Подсыл = Стр.ВТ_Подсыл;
	//	//Евросиб Коханенко Н.А. 08.08.2023 )) #73570 
	//КонецЦикла;
	//Евросиб Коханенко Н.А. 01.08.2023 )) #72829 
	Возврат ВремТаблицаРасходов;
	
КонецФункции


Функция ЗаполнитьРасходыПоЖДН(ТаблицаРасходов, Сделка, МассивОбработанныхСтрок)

	//добавим в таблицу данные по ждн
	//Евросиб Каблов 03.03.2026 ( Ticket#0427865
	//ТаблицаРасходовПоЖДН = Сделка.Расходы.Выгрузить(Новый Структура("ИсточникПоявленияСтрокиЭкономики, УслугаОтключена", Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДН, Ложь));
	//Для каждого СтрокаРасходЖДН Из ТаблицаРасходовПоЖДН Цикл
	//	нСтрокаВремРасход = ТаблицаРасходов.Добавить();
	//	ЗаполнитьЗначенияСвойств(нСтрокаВремРасход, СтрокаРасходЖДН);
	//КонецЦикла;
	ПричинаОтключенияДублированиеРасходов = Перечисления.ПричиныОтключенияСтрокиРасходовСделки.ДублированиеРасходов;
	СтрокиРасходовПоЖДН = Сделка.Расходы.НайтиСтроки(Новый Структура("ИсточникПоявленияСтрокиЭкономики", Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДН));
	Для каждого СтрокаРасходЖДН Из СтрокиРасходовПоЖДН Цикл
		Если Не СтрокаРасходЖДН.УслугаОтключена Или СтрокаРасходЖДН.ПричинаОтключенияСтроки = ПричинаОтключенияДублированиеРасходов Тогда
			нСтрокаВремРасход = ТаблицаРасходов.Добавить();
			ЗаполнитьЗначенияСвойств(нСтрокаВремРасход, СтрокаРасходЖДН);
		КонецЕсли;
	КонецЦикла;
	//Евросиб Каблов 03.03.2026 ) Ticket#0427865
	СтруктураСоответствияРеквизитаВагонРеквизитуЖДН = Справочники.ВидыЖДН.ПолучитьСтруктуруСоответствияРеквизитаВагонРеквизитуЖДН();
	
	СписокПолейСТипомНакладная = ПолучитьСписокПолейСТипомНакладная(Сделка);
	ТекстЗапросаДляОтладки = "";
	ШаблонЗапроса = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Документ.Калькуляция) КАК Калькуляция,
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.Контейнер КАК Справочник.ТЕ) КАК Контейнер,
	// Евросиб US 115279 TA 115468 Рыбьяков К.А. 18.09.2025 ((
	|	СделкаСвязьУчетныхЕдиниц.Контейнер.ТипТЕ.ТЕУ КАК КоэффициентТЕУ, 
	// Евросиб Рыбьяков К.А. 18.09.2025 ))
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.Вагон КАК Справочник.ТС) КАК Вагон, 
	|	1 КАК Количество,
	|	СделкаСвязьУчетныхЕдиниц.РазмерКТК КАК РазмерКТК,
	|	ВЫБОР
	|		КОГДА НЕ СделкаСвязьУчетныхЕдиниц.НомерВагоннойЖДН = """"
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьПодсыл,
	|	СделкаСвязьУчетныхЕдиниц.НомерЖДН КАК СписокТД,
	|	СделкаСвязьУчетныхЕдиниц.Груз КАК Груз,
	|	СделкаСвязьУчетныхЕдиниц.ПортОтправления КАК ПортОтправления,
	|	СделкаСвязьУчетныхЕдиниц.ПортНазначения КАК ПортНазначения,
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|	СделкаСвязьУчетныхЕдиниц.СобственностьПеревозимогоКТК КАК СобственностьПеревозимогоКТК,
	//ок)
	|	СделкаСвязьУчетныхЕдиниц.УдалитьСобственностьПеревозимогоКТК КАК УдалитьСобственностьПеревозимогоКТК,
	|	СделкаСвязьУчетныхЕдиниц.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|	СделкаСвязьУчетныхЕдиниц.Удалена КАК Удалена,
	|	СделкаСвязьУчетныхЕдиниц.НеАктивна КАК НеАктивна,
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.Коносамент КАК Документ.ТранспортныйДокумент) КАК Коносамент,
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК СтрокаСвязьУчетныхЕдиниц,
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	|	СделкаСвязьУчетныхЕдиниц.ГруженаяЖДННеНайдена КАК ГруженаяЖДННеНайдена,
	|	&ПолеЖДН КАК НакладнаяЖДН,
	|	&ИмяПоляЖДНДляСвязи КАК ИмяПоляЖДНДляСвязи,
	|   &ИмяПоляВагонПоЖДН КАК ВагонПоЖДН
	|ПОМЕСТИТЬ ВТ_СвязьУчетныхЕдиницСНакладными
	|ИЗ
	|	ВТ_СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|ГДЕ
	|	НЕ &ПолеЖДН = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|   И НЕ ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Документ.Калькуляция).ОтсутствуетПеревозкаПоЖД
	|	И НЕ СделкаСвязьУчетныхЕдиниц.Удалена
	|	И НЕ СделкаСвязьУчетныхЕдиниц.НеАктивна
	|   И НЕ СделкаСвязьУчетныхЕдиниц.ОтключитьРасходы";
	ТекстЗапросаОбщий = "";                                  
	ВсегоЗапросов = 0;
	ИмяРеквизитаПоляВагон = "";
	Для каждого ПолеНакладная Из СписокПолейСТипомНакладная Цикл
		ВсегоЗапросов = ВсегоЗапросов + 1;
		ТекстЗапроса = СтрЗаменить(ШаблонЗапроса, "&ПолеЖДН", СтрШаблон("СделкаСвязьУчетныхЕдиниц.%1",ПолеНакладная));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяПоляЖДНДляСвязи", СтрШаблон("%1%2%3","""",ПолеНакладная,""""));
		Если СтруктураСоответствияРеквизитаВагонРеквизитуЖДН.Свойство(ПолеНакладная, ИмяРеквизитаПоляВагон) И ЗначениеЗаполнено(ИмяРеквизитаПоляВагон) Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяПоляВагонПоЖДН", СтрШаблон("СделкаСвязьУчетныхЕдиниц.%1",ИмяРеквизитаПоляВагон));
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяПоляВагонПоЖДН", "Неопределено");
		КонецЕсли;
		Если ВсегоЗапросов > 1 Тогда
			ТекстЗапросаОбщий = ТекстЗапросаОбщий + "
			|ОБЪЕДИНИТЬ ВСЕ
			|";
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ВТ_СвязьУчетныхЕдиницСНакладными", "");
		КонецЕсли;
		ТекстЗапросаОбщий = ТекстЗапросаОбщий + ТекстЗапроса;
	КонецЦикла;
	ТекстЗапросаВТ = 
	"ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_СвязьУчетныхЕдиниц ИЗ &СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц;
	//|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Расходы ИЗ &Расходы КАК Расходы ГДЕ Расходы.УслугаОтключена = ЛОЖЬ;";
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_РасходыТек ИЗ &ТекРасходы КАК ТекРасходы;
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_РасходыСделки ИЗ &РасходыСделки КАК РасходыСделки;";
	
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;        
	Запрос.МенеджерВременныхТаблиц = МВТ;

	Запрос.Текст = ТекстЗапросаВТ+"
	|"+ТекстЗапросаОбщий;

	Запрос.УстановитьПараметр("СвязьУчетныхЕдиниц", Сделка.СвязьУчетныхЕдиниц.Выгрузить());
	Запрос.УстановитьПараметр("РасходыСделки", Сделка.Расходы.Выгрузить());
	Запрос.УстановитьПараметр("ТекРасходы", ТаблицаРасходов);

	Запрос.Выполнить();
	ТекстЗапросаДляОтладки = ТекстЗапросаДляОтладки + Запрос.Текст;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВТ_СвязьУчетныхЕдиницСНакладными.Калькуляция КАК Документ.Калькуляция) КАК Калькуляция,
	|	ВТ_СвязьУчетныхЕдиницСНакладными.Контейнер КАК Контейнер,
	// Евросиб US 115279 TA 115468 Рыбьяков К.А. 18.09.2025 ((
	|	ВТ_СвязьУчетныхЕдиницСНакладными.КоэффициентТЕУ КАК КоэффициентТЕУ, 
	// Евросиб Рыбьяков К.А. 18.09.2025 ))
	//Евросиб СубботинВ #124205 27.11.2025 Начало	
	//|	ВТ_СвязьУчетныхЕдиницСНакладными.Вагон КАК Вагон,
	|	ВЫБОР
	|	КОГДА НЕ ВидыЖДНСвязанныеУслуги.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыЖДН.ФТГПослеПерегруза)
	|		ТОГДА ВТ_СвязьУчетныхЕдиницСНакладными.Вагон
	|	ИНАЧЕ ВТ_СвязьУчетныхЕдиницСНакладными.ВагонПоЖДН
	|	КОНЕЦ  КАК Вагон,
	//Евросиб СубботинВ #124205 27.11.2025 Конец	
	|	ВТ_СвязьУчетныхЕдиницСНакладными.Количество КАК Количество,
	|	ВТ_СвязьУчетныхЕдиницСНакладными.РазмерКТК КАК РазмерКТК,
	|	ВТ_СвязьУчетныхЕдиницСНакладными.ЕстьПодсыл КАК ЕстьПодсыл,
	|	ВТ_СвязьУчетныхЕдиницСНакладными.Груз КАК Груз,
	|	ВТ_СвязьУчетныхЕдиницСНакладными.ГУИД КАК ГУИД,
	|	ВТ_СвязьУчетныхЕдиницСНакладными.ГруженаяЖДННеНайдена КАК ГруженаяЖДННеНайдена,
	|	ВТ_СвязьУчетныхЕдиницСНакладными.ВагонПоЖДН КАК ВагонПоЖДН,
	|	ВЫРАЗИТЬ(ВТ_СвязьУчетныхЕдиницСНакладными.НакладнаяЖДН КАК Документ.ТранспортныйДокумент) КАК НакладнаяЖДН,
	|	ВидыЖДНСвязанныеУслуги.Услуга КАК Услуга,
	//Евросиб - АСуслов 27.05.2022 16:27:45 #52272
	//(
	|	ВидыЖДНСвязанныеУслуги.ТолькоИскатьУслугиВРасходах КАК ТолькоИскатьУслугиВРасходах,
	//|	ВидыЖДНСвязанныеУслуги.ЗаполнятьВагонИзЖДН КАК ЗаполнятьВагонИзЖДН,
	|	ВидыЖДНСвязанныеУслуги.ЗаполнятьСтанциюОтправленияИзЖДН КАК ЗаполнятьСтанциюОтправленияИзЖДН,
	|	ВидыЖДНСвязанныеУслуги.ЗаполнятьСтанциюНазначенияИзЖДН КАК ЗаполнятьСтанциюНазначенияИзЖДН,
	//)
	//Евросиб - АСуслов 27.05.2022 16:27:46 #52272
	|	ВидыЖДНСвязанныеУслуги.Ссылка КАК ВидЖДН
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТ_СвязьУчетныхЕдиницСНакладными КАК ВТ_СвязьУчетныхЕдиницСНакладными
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЖДН.СвязанныеУслуги КАК ВидыЖДНСвязанныеУслуги
	|		ПО ВТ_СвязьУчетныхЕдиницСНакладными.ИмяПоляЖДНДляСвязи = ВидыЖДНСвязанныеУслуги.Ссылка.ИмяРеквизитаЖДНВСоставеПоезда
	|			И (ВЫБОР
	|				КОГДА ВидыЖДНСвязанныеУслуги.Ссылка.ЕстьДопРазделениеКТКПорожний
	|					ТОГДА ВТ_СвязьУчетныхЕдиницСНакладными.ГруженаяЖДННеНайдена = ВидыЖДНСвязанныеУслуги.Ссылка.КТКПорожний
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//Евросиб Каблов 16.03.2025 ( #100520
	//|ВЫБРАТЬ
	//|	СтоимостьПоЖДНакладнымОбороты.ТранспортныйДокумент КАК ТранспортныйДокумент,
	//|	СтоимостьПоЖДНакладнымОбороты.Контейнер КАК Контейнер,
	//|	СтоимостьПоЖДНакладнымОбороты.Вагон КАК Вагон,
	//|	СтоимостьПоЖДНакладнымОбороты.СтавкаНДС КАК СтавкаНДС,
	//|	СтоимостьПоЖДНакладнымОбороты.СуммаБезНДСОборот КАК СуммаБезНДС,
	//|	СтоимостьПоЖДНакладнымОбороты.СуммаНДСОборот КАК СуммаНДС
	//|ПОМЕСТИТЬ ВТ_СтоимостьПоЖДНакладным
	//|ИЗ
	//|	РегистрНакопления.СтоимостьПоЖДНакладным.Обороты КАК СтоимостьПоЖДНакладнымОбороты
	//|ГДЕ ТранспортныйДокумент В (ВЫБРАТЬ т.НакладнаяЖДН ИЗ ВТ КАК т) 
	//|Индексировать по ТранспортныйДокумент
	
	//Евросиб Каблов 12.03.2026 ( #126776
	//|ВЫБРАТЬ
	//|	СтоимостьПоЖДНакладнымОбороты.ТранспортныйДокумент КАК ТранспортныйДокумент,
	//|	СтоимостьПоЖДНакладнымОбороты.Контейнер КАК Контейнер,
	//|	СтоимостьПоЖДНакладнымОбороты.Вагон КАК Вагон,
	//|	СтоимостьПоЖДНакладнымОбороты.СтавкаНДС КАК СтавкаНДС,
	//|	СтоимостьПоЖДНакладнымОбороты.СуммаБезНДСОборот КАК СуммаБезНДС,
	//|	СтоимостьПоЖДНакладнымОбороты.СуммаНДСОборот КАК СуммаНДС
	//|ПОМЕСТИТЬ ВТ_СтоимостьПоЖДНакладным
	//|ИЗ
	//|	РегистрНакопления.СтоимостьПоЖДНакладным.Обороты(
	//|			,
	//|			,
	//|			,
	//|			ТранспортныйДокумент В
	//|				(ВЫБРАТЬ
	//|					т.НакладнаяЖДН
	//|				ИЗ
	//|					ВТ КАК т)) КАК СтоимостьПоЖДНакладнымОбороты
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	ТранспортныйДокумент
	
	|ВЫБРАТЬ
	|	СтоимостьПоЖДНакладнымОбороты.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	СтоимостьПоЖДНакладнымОбороты.Контейнер КАК Контейнер,
	|	СтоимостьПоЖДНакладнымОбороты.Вагон КАК Вагон,
	|	СтоимостьПоЖДНакладнымОбороты.СтавкаНДС КАК СтавкаНДС,
	|	СтоимостьПоЖДНакладнымОбороты.СуммаБезНДСОборот КАК СуммаБезНДС,
	|	СтоимостьПоЖДНакладнымОбороты.СуммаНДСОборот КАК СуммаНДС
	|ПОМЕСТИТЬ ВТ_ПолнаяСтоимостьПоЖДНакладным
	|ИЗ
	|	РегистрНакопления.СтоимостьПоЖДНакладным.Обороты(
	|			,
	|			,
	|			,
	|			ТранспортныйДокумент В
	|				(ВЫБРАТЬ
	|					т.НакладнаяЖДН
	|				ИЗ
	|					ВТ КАК т)) КАК СтоимостьПоЖДНакладнымОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТранспортныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СвязьУчетныхЕдиниц.ВагоннаяЖДН КАК ПорожняяЖДН,
	|	СвязьУчетныхЕдиниц.ЖДН КАК ГруженаяЖДН
	|ПОМЕСТИТЬ ВТ_СвязанныеГруженыеПорожниеЖДН
	|ИЗ
	|	ВТ_СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц
	|ГДЕ
	|	СвязьУчетныхЕдиниц.ЖДН.Ссылка ЕСТЬ НЕ NULL 
	|	И СвязьУчетныхЕдиниц.ВагоннаяЖДН.Ссылка ЕСТЬ НЕ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПолнаяСтоимостьПоЖДНакладным.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	ВТ_ПолнаяСтоимостьПоЖДНакладным.Вагон КАК Вагон,
	|	ВТ_СвязанныеГруженыеПорожниеЖДН.ГруженаяЖДН КАК ГруженаяЖДН
	|ПОМЕСТИТЬ СвязьСГружеными
	|ИЗ
	|	ВТ_ПолнаяСтоимостьПоЖДНакладным КАК ВТ_ПолнаяСтоимостьПоЖДНакладным
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СвязанныеГруженыеПорожниеЖДН КАК ВТ_СвязанныеГруженыеПорожниеЖДН
	|		ПО ВТ_ПолнаяСтоимостьПоЖДНакладным.ТранспортныйДокумент = ВТ_СвязанныеГруженыеПорожниеЖДН.ПорожняяЖДН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СвязьСГружеными.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	СвязьСГружеными.Вагон КАК Вагон,
	|	СвязьСГружеными.ГруженаяЖДН КАК ГруженаяЖДН,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ПолнаяСтоимостьПоЖДНакладным.Контейнер) КАК КоличествоКонтейнеров
	|ПОМЕСТИТЬ КонтейнерыГруженойНаВагонеПорожней
	|ИЗ
	|	СвязьСГружеными КАК СвязьСГружеными
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвязьУчетныхЕдиниц КАК ВТ_СвязьУчетныхЕдиниц
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПолнаяСтоимостьПоЖДНакладным КАК ВТ_ПолнаяСтоимостьПоЖДНакладным
	|			ПО ВТ_СвязьУчетныхЕдиниц.ЖДН = ВТ_ПолнаяСтоимостьПоЖДНакладным.ТранспортныйДокумент
	|				И ВТ_СвязьУчетныхЕдиниц.Вагон = ВТ_ПолнаяСтоимостьПоЖДНакладным.Вагон
	|				И ВТ_СвязьУчетныхЕдиниц.Контейнер = ВТ_ПолнаяСтоимостьПоЖДНакладным.Контейнер
	|		ПО СвязьСГружеными.ГруженаяЖДН = ВТ_СвязьУчетныхЕдиниц.ЖДН
	|			И СвязьСГружеными.Вагон = ВТ_СвязьУчетныхЕдиниц.Вагон
	|
	|СГРУППИРОВАТЬ ПО
	|	СвязьСГружеными.ТранспортныйДокумент,
	|	СвязьСГружеными.ГруженаяЖДН,
	|	СвязьСГружеными.Вагон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПолнаяСтоимостьПоЖДНакладным.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	ВТ_ПолнаяСтоимостьПоЖДНакладным.Контейнер КАК Контейнер,
	|	ВТ_ПолнаяСтоимостьПоЖДНакладным.Вагон КАК Вагон,
	|	ВТ_ПолнаяСтоимостьПоЖДНакладным.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_ПолнаяСтоимостьПоЖДНакладным.СуммаБезНДС / ЕСТЬNULL(КонтейнерыГруженойНаВагонеПорожней.КоличествоКонтейнеров, 1) КАК СуммаБезНДС,
	|	ВТ_ПолнаяСтоимостьПоЖДНакладным.СуммаНДС / ЕСТЬNULL(КонтейнерыГруженойНаВагонеПорожней.КоличествоКонтейнеров, 1) КАК СуммаНДС
	|ПОМЕСТИТЬ ВТ_СтоимостьПоЖДНакладным
	|ИЗ
	|	ВТ_ПолнаяСтоимостьПоЖДНакладным КАК ВТ_ПолнаяСтоимостьПоЖДНакладным
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтейнерыГруженойНаВагонеПорожней КАК КонтейнерыГруженойНаВагонеПорожней
	|		ПО ВТ_ПолнаяСтоимостьПоЖДНакладным.ТранспортныйДокумент = КонтейнерыГруженойНаВагонеПорожней.ТранспортныйДокумент
	|			И ВТ_ПолнаяСтоимостьПоЖДНакладным.Вагон = КонтейнерыГруженойНаВагонеПорожней.Вагон
	//Евросиб Каблов 12.03.2026 ) #126776
	//Евросиб Каблов 16.03.2025 )
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Услуга КАК Услуга,
	|	ВТ.Калькуляция КАК Калькуляция,
	|	ВТ.Контейнер КАК Контейнер,
	// Евросиб US 115279 TA 115468 Рыбьяков К.А. 18.09.2025 ((
	|	ВТ.КоэффициентТЕУ КАК КоэффициентТЕУ, 
	// Евросиб Рыбьяков К.А. 18.09.2025 ))
	|	ВТ.Вагон КАК Вагон,
	|	ВТ.Количество КАК Количество,
	|	ВалютаРегламентированногоУчета.Значение КАК Валюта,
	|	ВТ.Груз КАК Груз,
	|	ВТ.ГУИД КАК СтрокаСвязьУчетныхЕдиниц,
	|	ВТ.НакладнаяЖДН КАК ТранспортныйДокумент,
	|	ВТ.НакладнаяЖДН.НомерТранспортногоДокумента КАК НомерТранспортногоДокумента,
	|	ВТ.НакладнаяЖДН.СтанцияОтправления КАК ПунктОтправления,
	|	ВТ.НакладнаяЖДН.СтанцияНазначения КАК ПунктНазначения,
	|	ВТ.ВидЖДН КАК ВидЖДН,
	|	ВТ.ВидЖДН.ВсегдаДобавлятьУслугу КАК ВсегдаДобавлятьУслугу,
	//Евросиб - АСуслов 27.05.2022 15:41:46 #
	//(
	|   ВТ.ТолькоИскатьУслугиВРасходах КАК ТолькоИскатьУслугиВРасходах,
	//|	ВТ.ЗаполнятьВагонИзЖДН КАК ЗаполнятьВагонИзЖДН,
	|   ВТ.ВагонПоЖДН КАК ВагонПоЖДН,
	|	ВТ.ЗаполнятьСтанциюОтправленияИзЖДН КАК ЗаполнятьСтанциюОтправленияИзЖДН,
	|	ВТ.ЗаполнятьСтанциюНазначенияИзЖДН КАК ЗаполнятьСтанциюНазначенияИзЖДН,
	//)
	//Евросиб - АСуслов 27.05.2022 15:41:47 #
	|	ВТ.ВидЖДН.ИспользоватьТолькоУслугиСГруппой КАК ИспользоватьТолькоУслугиСГруппой,
	|	ВТ.ВидЖДН.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	|	ВТ.ВидЖДН.ЭтоВагоннаяЖДН КАК ЭтоВагоннаяЖДН,
	//Евросиб - АСуслов 05.05.2022 14:04:52 #
	//(
	|	ЕСТЬNULL(ВТ_Расходы.ПлановаяСтоимостьИзЖДН, Ложь) КАК ПлановаяСтоимостьИзЖДНРасход,
	|	ЕСТЬNULL(ВТ_Расходы.СуммаИтого, 0) КАК СуммаИтогоРасход,
	|	ЕСТЬNULL(ВТ_Расходы.СуммаНДС, 0) КАК СуммаНДСРасход,
	//Евросиб - АСуслов 25.05.2022 12:06:26 #50186
	//(
	//|   ВЫБОР КОГДА ВТ_Расходы.Калькуляция.Контрагент = Значение(Справочник.Контрагенты.ПустаяСсылка) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ОтнестиНаЗатраты,
	|	ВЫБОР
	|		КОГДА ВТ_Расходы.Калькуляция.ТипКалькуляции В(&МежсервисныеРасходы)
	| 			И ВТ_Расходы.Калькуляция.Контрагент = &КонтрагентДирекция
	| 			И ВТ_Расходы.Калькуляция.ОтнестиРасходыНаСобственныеЗатраты 
	|		ТОГДА ИСТИНА
	|	КОНЕЦ КАК ОтнестиНаЗатраты,                            
	//)
	//Евросиб - АСуслов 25.05.2022 12:06:27 #50186
	|	ВЫБОР КОГДА ВТ_Расходы.УчДокумент ЕСТЬ NULL ИЛИ ВТ_Расходы.УчДокумент = Значение(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка) ТОГДА 0 ИНАЧЕ 1 КОНЕЦ КАК ЕстьУчДокумент,
	//)
	//Евросиб - АСуслов 05.05.2022 14:04:53 # 
	//|   ЕСТЬNULL(УчетныеЕдиницыТранспортныхДокументов.Вагон, Значение(Справочник.ТС.ПустаяСсылка)) КАК ВагонЖДН, //Евросиб(ДИТ), Беляев СЮ, Ticket#0378454, 06-12-2024, (закомментировал)
	|	ЕСТЬNULL(ВТ_Расходы.ГУИД, """") КАК ГУИДРасход,
	|ВЫБОР
	|	КОГДА ВТ.ВидЖДН.ЭтоВагоннаяЖДН
	|		ТОГДА ВТ.Вагон
	|	ИНАЧЕ ВТ.Контейнер
	|КОНЕЦ КАК УЕДляСвязи
	|ПОМЕСТИТЬ ВТ_Накладные
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасходыТек КАК ВТ_Расходы
	|		ПО ВТ.ГУИД = ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц
	|			И ВТ.ВидЖДН = ВТ_Расходы.ВидЖДН
	|			И ВТ.Услуга = ВТ_Расходы.Услуга
	|			И ВТ.НакладнаяЖДН = ВТ_Расходы.ТранспортныйДокумент
	//Евросиб - АСуслов 02.06.2022 14:52:42 #
	//(если услуги не добавляются из ждн, то ищем во всех строках кроме добавленных из ждн, чтобы их отключить, если они добавились ранее
	|   		И ВЫБОР КОГДА ВТ.ТолькоИскатьУслугиВРасходах ТОГДА (ВТ_Расходы.ИсточникПоявленияСтрокиЭкономики <> Значение(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДН)) ИНАЧЕ ИСТИНА КОНЕЦ
	//)
	//Евросиб - АСуслов 02.06.2022 14:52:42 #
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0378454, 06-12-2024, начало (закомментировал соединение с УчетныеЕдиницыТранспортныхДокументов, приводит к дублям строк, а данные не используются)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетныеЕдиницыТранспортныхДокументов КАК УчетныеЕдиницыТранспортныхДокументов
	//|			ПО ВТ.НакладнаяЖДН = УчетныеЕдиницыТранспортныхДокументов.ТранспортныйДокумент
	//|     		И  ВЫБОР КОГДА ВТ.ВидЖДН.ЭтоВагоннаяЖДН ТОГДА
	//|				ВТ.Вагон = УчетныеЕдиницыТранспортныхДокументов.Вагон
	//|   			ИНАЧЕ ВТ.Контейнер = УчетныеЕдиницыТранспортныхДокументов.Контейнер КОНЕЦ,
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0378454, 06-12-2024, конец
	|	,Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
	|;
	|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Накладные.Услуга КАК Услуга,
	//|	ВТ_Накладные.Вагон КАК Вагон,
	//|	ВТ_Накладные.ТранспортныйДокумент КАК НакладнаяЖДН,
	//|	МАКСИМУМ(ВТ_Накладные.СтрокаСвязьУчетныхЕдиниц) КАК СтрокаСвязьУчетныхЕдиниц
	//|ПОМЕСТИТЬ ВТ_НакладныеВагоны
	//|ИЗ
	//|	ВТ_Накладные КАК ВТ_Накладные
	//|ГДЕ
	////|	ВТ_Накладные.Услуга.ЭтоТариф
	//|	ВТ_Накладные.ЭтоВагоннаяЖДН
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_Накладные.Услуга,
	//|	ВТ_Накладные.Вагон,
	//|	ВТ_Накладные.ТранспортныйДокумент
	//|;

	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	МАКСИМУМ(ВТ_Накладные.СтрокаСвязьУчетныхЕдиниц) КАК СтрокаСвязьУчетныхЕдиниц,
	//|	ВложенныйЗапрос.Вагон КАК Вагон,
	//|	ВложенныйЗапрос.ТранспортныйДокумент КАК НакладнаяЖДН,
	//|	ВложенныйЗапрос.ЕстьУчДокумент КАК ЕстьУчДокумент,
	//|   ВложенныйЗапрос.ВидЖДН
	//|ПОМЕСТИТЬ ВТ_НакладныеВагоны
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		ВТ_Накладные.Вагон КАК Вагон,
	//|		ВТ_Накладные.ТранспортныйДокумент КАК ТранспортныйДокумент,
	////Евросиб - АСуслов 23.05.2022 19:05:38 #
	////(
	//|		ВТ_Накладные.ВидЖДН КАК ВидЖДН,
	////)
	////Евросиб - АСуслов 23.05.2022 19:05:38 #
	//|		МАКСИМУМ(ВТ_Накладные.ЕстьУчДокумент) КАК ЕстьУчДокумент
	//|	ИЗ
	//|		ВТ_Накладные КАК ВТ_Накладные
	//|   ГДЕ ВТ_Накладные.ЭтоВагоннаяЖДН
	//|	
	//|	СГРУППИРОВАТЬ ПО
	//|		ВТ_Накладные.Вагон,
	//|		ВТ_Накладные.ТранспортныйДокумент,
	//|		ВТ_Накладные.ВидЖДН) КАК ВложенныйЗапрос
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Накладные КАК ВТ_Накладные
	//|		ПО ВложенныйЗапрос.Вагон = ВТ_Накладные.Вагон
	//|			И ВложенныйЗапрос.ТранспортныйДокумент = ВТ_Накладные.ТранспортныйДокумент
	////Евросиб - АСуслов 23.05.2022 19:05:56 #
	////(
	//|			И ВложенныйЗапрос.ВидЖДН = ВТ_Накладные.ВидЖДН
	////)
	////Евросиб - АСуслов 23.05.2022 19:05:56 #
	//|			И ВложенныйЗапрос.ЕстьУчДокумент = ВТ_Накладные.ЕстьУчДокумент
	//|СГРУППИРОВАТЬ ПО
	//|	ВложенныйЗапрос.Вагон,
	//|	ВложенныйЗапрос.ЕстьУчДокумент,
	//|	ВложенныйЗапрос.ТранспортныйДокумент,
	//|	ВложенныйЗапрос.ВидЖДН
	//|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаРасходы.ГУИД КАК ГУИД
	|ИЗ
	|	ВТ_РасходыТек КАК СделкаРасходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаРасходы.ГУИД КАК ГУИД
	|ИЗ
	|	ВТ_РасходыСделки КАК СделкаРасходы
	|ГДЕ
	|	СделкаРасходы.ВидЖДН В
	|			(ВЫБРАТЬ
	//|				т.ИсточникПоявленияСтрокиЭкономики
	|				т.Ссылка
	|			ИЗ
	|				Справочник.ВидыЖДН КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Накладные.Услуга КАК Услуга,
	|	ВТ_Накладные.Калькуляция КАК Калькуляция,
	//|	ВТ_Накладные.Контейнер КАК Контейнер,
	//|	ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка) КАК Вагон,
	//|   ВЫБОР КОГДА НЕ ВТ_Накладные.Услуга.ЭтоТариф ТОГДА ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка) ИНАЧЕ ВТ_Накладные.Вагон Конец КАК Вагон,
	|   ВЫБОР КОГДА НЕ ВТ_Накладные.ЭтоВагоннаяЖДН Тогда ВТ_Накладные.Контейнер ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка) КОНЕЦ КАК Контейнер,
	//Евросиб - АСуслов 20.12.2022 17:16:15 #63164
	//(
	|   ВТ_Накладные.ВагонПоЖДН КАК Вагон,
	//)
	//Евросиб - АСуслов 20.12.2022 17:16:16 #63164
	|	ВТ_Накладные.Количество КАК Количество,
	|	ВТ_Накладные.Валюта КАК Валюта,
	|	ВТ_Накладные.Груз КАК Груз,
	|	ВТ_Накладные.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	|	ВТ_Накладные.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	ВТ_Накладные.НомерТранспортногоДокумента КАК НомерТранспортногоДокумента,
	|	ВТ_Накладные.ПунктОтправления КАК ПунктОтправления,
	|	ВТ_Накладные.ПунктНазначения КАК ПунктНазначения,
	|	ВТ_Накладные.ВидЖДН КАК ВидЖДН,
	|	ВТ_Накладные.ВсегдаДобавлятьУслугу КАК ВсегдаДобавлятьУслугу,
	//Евросиб - АСуслов 27.05.2022 15:43:38 #
	//(
	|   ВТ_Накладные.ТолькоИскатьУслугиВРасходах КАК ТолькоИскатьУслугиВРасходах,
	//|	ВТ_Накладные.ЗаполнятьВагонИзЖДН КАК ЗаполнятьВагонИзЖДН, 
	|   ВТ_Накладные.ВагонПоЖДН,
	|	ВТ_Накладные.ЗаполнятьСтанциюОтправленияИзЖДН КАК ЗаполнятьСтанциюОтправленияИзЖДН,
	|	ВТ_Накладные.ЗаполнятьСтанциюНазначенияИзЖДН КАК ЗаполнятьСтанциюНазначенияИзЖДН,
	//)
	//Евросиб - АСуслов 27.05.2022 15:43:38 #
	|	ВТ_Накладные.ИспользоватьТолькоУслугиСГруппой КАК ИспользоватьТолькоУслугиСГруппой,
	|	ВТ_Накладные.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	|	ВТ_Накладные.ГУИДРасход КАК ГУИДРасход,
	|	ВТ_Накладные.ПлановаяСтоимостьИзЖДНРасход КАК ПлановаяСтоимостьИзЖДНРасход,
	//Евросиб - АСуслов 27.05.2022 16:18:12 #
	//(
	|   ВТ_Накладные.ОтнестиНаЗатраты КАК ОтнестиНаЗатраты,
	//)
	//Евросиб - АСуслов 27.05.2022 16:18:13 #
	|	ВТ_Накладные.СуммаИтогоРасход КАК СуммаИтогоРасход,
	|	ВТ_Накладные.СуммаНДСРасход КАК СуммаНДСРасход,
	|	СтоимостьПоЖДНакладным.СтавкаНДС КАК СтавкаНДС,
	// Евросиб US 115279 TA 115468 Рыбьяков К.А. 18.09.2025 ((
	|	ВЫБОР 
	|		КОГДА НЕ ВТ_Накладные.ЭтоВагоннаяЖДН 
	|			ТОГДА СтоимостьПоЖДНакладным.СуммаБезНДС * ВТ_Накладные.КоэффициентТЕУ 
	|			ИНАЧЕ СтоимостьПоЖДНакладным.СуммаБезНДС 
	|	КОНЕЦ КАК Себестоимость,
	//|	СтоимостьПоЖДНакладным.СуммаБезНДС КАК Себестоимость,
	// Евросиб Рыбьяков К.А. 18.09.2025 ))
	|	СтоимостьПоЖДНакладным.СуммаНДС КАК СуммаНДС,
	|	СтоимостьПоЖДНакладным.СуммаБезНДС КАК СебестоимостьИтого,
	|	СтоимостьПоЖДНакладным.СуммаБезНДС КАК СуммаИтого
	|ИЗ
	|	ВТ_Накладные КАК ВТ_Накладные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтоимостьПоЖДНакладным КАК СтоимостьПоЖДНакладным
	|		ПО ВТ_Накладные.ТранспортныйДокумент = СтоимостьПоЖДНакладным.ТранспортныйДокумент
	//Евросиб - АСуслов 17.10.2023 11:51:05 #76119
	//(
	|И (ВЫБОР
	|	КОГДА ВТ_Накладные.ВидЖДН.ЭтоВагоннаяЖДН
	|		ТОГДА ВТ_Накладные.УЕДляСвязи = СтоимостьПоЖДНакладным.Вагон
	|	ИНАЧЕ ВТ_Накладные.УЕДляСвязи = СтоимостьПоЖДНакладным.Контейнер
	|КОНЕЦ)
	//)
	//Евросиб - АСуслов 17.10.2023 11:52:49 #76119
	//|			И ВТ_Накладные.Контейнер = СтоимостьПоЖДНакладнымОбороты.Контейнер
	//|ГДЕ
	//|	НЕ ВТ_Накладные.СтрокаСвязьУчетныхЕдиниц В
	//|			(ВЫБРАТЬ
	//|				т.СтрокаСвязьУчетныхЕдиниц
	//|			ИЗ
	//|				ВТ_НакладныеВагоны КАК т)
	//|	НЕ ВТ_Накладные.ЭтоВагоннаяЖДН
	|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ВТ_Накладные.Услуга,
	//|	ВТ_Накладные.Калькуляция,
	////|	ВТ_Накладные.Контейнер,
	//|	ВЫБОР КОГДА ВТ_Накладные.Услуга.ЕдиницаИзмерения = Значение(Справочник.КлассификаторЕдиницИзмерения.Вагон) ТОГДА Значение(Справочник.ТЕ.ПустаяСсылка) ИНАЧЕ ВТ_Накладные.Контейнер КОНЕЦ,
	////|	ВТ_Накладные.Вагон,
	//|	ВТ_Накладные.ВагонЖДН,
	//|	ВТ_Накладные.Количество,
	//|	ВТ_Накладные.Валюта,
	//|	ВТ_Накладные.Груз,
	//|	ВТ_Накладные.СтрокаСвязьУчетныхЕдиниц,
	//|	ВТ_Накладные.ТранспортныйДокумент,
	//|	ВТ_Накладные.НомерТранспортногоДокумента,
	//|	ВТ_Накладные.ПунктОтправления,
	//|	ВТ_Накладные.ПунктНазначения,
	//|	ВТ_Накладные.ВидЖДН,
	//|	ВТ_Накладные.ВсегдаДобавлятьУслугу,
	////Евросиб - АСуслов 27.05.2022 15:43:38 #
	////(
	//|   ВТ_Накладные.ТолькоИскатьУслугиВРасходах,
	//|	ВТ_Накладные.ЗаполнятьВагонИзЖДН,
	//|	ВТ_Накладные.ЗаполнятьСтанциюОтправленияИзЖДН,
	//|	ВТ_Накладные.ЗаполнятьСтанциюНазначенияИзЖДН,
	////)
	////Евросиб - АСуслов 27.05.2022 15:43:38 #
	//|	ВТ_Накладные.ИспользоватьТолькоУслугиСГруппой,
	//|	ВТ_Накладные.ИсточникПоявленияСтрокиЭкономики,
	//|	ВТ_Накладные.ГУИДРасход,
	//|	ВТ_Накладные.ПлановаяСтоимостьИзЖДНРасход КАК ПлановаяСтоимостьИзЖДНРасход,
	////Евросиб - АСуслов 27.05.2022 16:18:12 #
	////(
	//|   ВТ_Накладные.ОтнестиНаЗатраты,
	////)
	////Евросиб - АСуслов 27.05.2022 16:18:13 #
	//|	ВТ_Накладные.СуммаИтогоРасход КАК СуммаИтогоРасход,
	//|	ВТ_Накладные.СуммаНДСРасход КАК СуммаНДСРасход,
	//|	СтоимостьПоЖДНакладнымОбороты.СтавкаНДС,
	//|	СтоимостьПоЖДНакладнымОбороты.СуммаБезНДСОборот,
	//|	СтоимостьПоЖДНакладнымОбороты.СуммаНДСОборот,
	//|	СтоимостьПоЖДНакладнымОбороты.СуммаБезНДСОборот,
	//|	СтоимостьПоЖДНакладнымОбороты.СуммаБезНДСОборот
	//|ИЗ
	//|	ВТ_Накладные КАК ВТ_Накладные
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьПоЖДНакладным.Обороты КАК СтоимостьПоЖДНакладнымОбороты
	//|		ПО ВТ_Накладные.ТранспортныйДокумент = СтоимостьПоЖДНакладнымОбороты.ТранспортныйДокумент
	//|			И ВТ_Накладные.Вагон = СтоимостьПоЖДНакладнымОбороты.Вагон
	//|ГДЕ
	////|	ВТ_Накладные.Услуга.ЭтоТариф
	////|	ВТ_Накладные.СтрокаСвязьУчетныхЕдиниц В
	////|			(ВЫБРАТЬ
	////|				т.СтрокаСвязьУчетныхЕдиниц
	////|			ИЗ
	////|				ВТ_НакладныеВагоны КАК т)";
	//|(ВТ_Накладные.СтрокаСвязьУчетныхЕдиниц, ВТ_Накладные.ТранспортныйДокумент, ВТ_Накладные.ВидЖДН) В

	//|		(ВЫБРАТЬ           
	//|			т.СтрокаСвязьУчетныхЕдиниц,

	//|			т.НакладнаяЖДН,
	//|      		т.ВидЖДН

	//|		ИЗ

	//|			ВТ_НакладныеВагоны КАК т)

	|;

	|////////////////////////////////////////////////////////////////////////////////
	//это текущая таблица по калькуляции
	|ВЫБРАТЬ
	|	СделкаРасходы.ГУИД КАК ГУИД,
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	|	СделкаРасходы.Услуга КАК Услуга,
	|	СделкаРасходы.ГруппаУслуг > 0 КАК ЭтоГруппаУслуг,
//Евросиб - АСуслов 02.06.2022 12:52:32 #
//(
	|	ВЫБОР
	|		КОГДА ВТ_Накладные.ГУИДРасход ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Использовано,
	|	ВЫБОР
	|		КОГДА СделкаРасходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДН)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИсточникЖДН
	|ИЗ
	|	ВТ_РасходыТек КАК СделкаРасходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Накладные КАК ВТ_Накладные
	|		ПО СделкаРасходы.ГУИД = ВТ_Накладные.ГУИДРасход
//)
//Евросиб - АСуслов 02.06.2022 12:52:33 #
	|ГДЕ   
	|	НЕ СделкаРасходы.ИсточникПоявленияСтрокиЭкономики В (&ИсточникПоявленияСтрокиЭкономики)
	|   И НЕ СделкаРасходы.УслугаОтключена
	//|ОБЪЕДИНИТЬ ВСЕ 
	////это таблица по ждн из уже записанных данных сделки
	//|ВЫБРАТЬ
	//|	СделкаРасходы.ГУИД,
	//|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц,
	//|	СделкаРасходы.Услуга,
	//|	СделкаРасходы.ГруппаУслуг > 0,
	//|	ЛОЖЬ
	//|ИЗ
	//|	ВТ_РасходыСделки КАК СделкаРасходы
	//|ГДЕ
	//|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики = Значение(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДН)
	//|	И НЕ СделкаРасходы.УслугаОтключена	
	|";
	//Евросиб Каблов 14.11.2022 ( 52045
	//Запрос.УстановитьПараметр("ИсточникПоявленияСтрокиЭкономики", Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта);
	//Запрос.УстановитьПараметр("ИсточникПоявленияСтрокиЭкономики", Перечисления.ИсточникПоявленияСтрокиЭкономики.ПроизвольнаяУслугаВручную);
	//Запрос.УстановитьПараметр("ИсточникПоявленияСтрокиЭкономики", Перечисления.ИсточникПоявленияСтрокиЭкономики.ОбъединениеПорожнейИГруженойСделок);
	ИсточникПоявленияСтрокиЭкономики = Новый Массив;
	ИсточникПоявленияСтрокиЭкономики.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта);
	ИсточникПоявленияСтрокиЭкономики.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ПроизвольнаяУслугаВручную);
	ИсточникПоявленияСтрокиЭкономики.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ОбъединениеПорожнейИГруженойСделок);
	ИсточникПоявленияСтрокиЭкономики.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ПеремещениеКТК);
	Запрос.УстановитьПараметр("ИсточникПоявленияСтрокиЭкономики", ИсточникПоявленияСтрокиЭкономики);
	//Евросиб Каблов 14.11.2022 )
	МежсервисныеРасходы = Новый Массив;
	МежсервисныеРасходы.Добавить(Перечисления.ТипыКалькуляций.МежсервисныеРасходы);
	МежсервисныеРасходы.Добавить(Перечисления.ТипыКалькуляций.МежсервисныеРасходыРеф);
	Запрос.УстановитьПараметр("МежсервисныеРасходы", МежсервисныеРасходы);
	Запрос.УстановитьПараметр("КонтрагентДирекция", Константы.КонтрагентДирекцияКонтейнерныхПеревозок.Получить());
	Пакеты = Запрос.ВыполнитьПакет();
	ТекстЗапросаДляОтладки = ТекстЗапросаДляОтладки + Запрос.Текст;
	КоличествоПакетов = Пакеты.Количество();
	
	Выборка = Пакеты[КоличествоПакетов-2].Выбрать();
	
	МассивНеОбработанныхСтрок = Пакеты[КоличествоПакетов-3].Выгрузить().ВыгрузитьКолонку("ГУИД");
	МассивНеОбработанныхТекущихСтрок = Пакеты[КоличествоПакетов-4].Выгрузить().ВыгрузитьКолонку("ГУИД");
	//ТаблицаПоискаРасходов = Сделка.Расходы.Выгрузить(Новый Структура("УслугаОтключена", ЛОЖЬ),"ГУИД, СтрокаСвязьУчетныхЕдиниц, Услуга, УслугаОтключена, ГруппаУслуг");
	//ТаблицаПоискаРасходов.Колонки.Добавить("Использовано", Новый ОписаниеТипов("Булево"));
	ТаблицаПоискаРасходов = Пакеты [КоличествоПакетов-1].Выгрузить();
	ТаблицаПоискаРасходов.Индексы.Добавить("СтрокаСвязьУчетныхЕдиниц, Услуга, Использовано, ЭтоГруппаУслуг");
	
	//ТаблицаРасходов = Пакеты [КоличествоПакетов-1].Выгрузить();
	//ТаблицаРасходов.Индексы.Добавить("ГУИД");
	
	//МассивОбработанныхСтрок = Новый Массив;
	Пока Выборка.Следующий() Цикл
		
		УслугаНайдена = Ложь;
		СтрокаРасход = Неопределено;
		Если ЗначениеЗаполнено(Выборка.ГУИДРасход) Тогда 
			//Евросиб - АСуслов 05.05.2022 13:57:42 #
			//(
			//обновим суммы, если суммы берутся из ЖДН
			//Если Выборка.ПлановаяСтоимостьИзЖДНРасход 
			//	И (Выборка.СуммаИтого <> Выборка.СуммаИтогоРасход 
			//	ИЛИ Выборка.СуммаНДС <> Выборка.СуммаНДСРасход)	Тогда
			//	//СтрокаРасход = Сделка.Расходы.Найти(Выборка.ГУИДРасход, "ГУИД");
			//	ЗаполняемыеСвойства = "Себестоимость, СебестоимостьИтого, СуммаНДС, СтавкаНДС, СуммаИтого";
			//	ЗаполнитьЗначенияСвойств(СтрокаРасход, Выборка, ЗаполняемыеСвойства);
			//КонецЕсли;
			СтрокаРасход = ТаблицаРасходов.Найти(Выборка.ГУИДРасход, "ГУИД");
			ЗаполняемыеСвойства = ПолучитьСписокПолейДляЗаполнения(Выборка);
			ЗаполнитьЗначенияСвойств(СтрокаРасход, Выборка, ЗаполняемыеСвойства);
			//)
			//Евросиб - АСуслов 05.05.2022 13:57:44 #
			МассивОбработанныхСтрок.Добавить(Выборка.ГУИДРасход);
			УслугаНайдена = Истина;
			//раньше после обработки уходили на новый цикл, теперь же поищем ещё такие же услуги, вдруг их больше чем 1
			//Продолжить;
		КонецЕсли;
		// Евросиб US 114964 TA 114988 Рыбьяков К.А. 10.10.2025 ((
		Если СтрокаБылаДобавленаПрОбъединенииСделок(Выборка, Сделка) Тогда
			Продолжить;
		КонецЕсли;
		// Евросиб Рыбьяков К.А. 10.10.2025 ))
		//ищем строку расходов в которую нужно подставить ждн
		//1. если вид ждн не "всегда добавлять услугу", тогда нужно найти строку суе+услуга                                  
		Если НЕ Выборка.ВсегдаДобавлятьУслугу 
			ИЛИ Выборка.ТолькоИскатьУслугиВРасходах Тогда                
			СтруктураПоиска = Новый Структура("СтрокаСвязьУчетныхЕдиниц, Услуга, Использовано, ЭтоГруппаУслуг",
										Выборка.СтрокаСвязьУчетныхЕдиниц, Выборка.Услуга, Ложь, Выборка.ИспользоватьТолькоУслугиСГруппой);
			//Если НЕ Выборка.ИспользоватьТолькоУслугиСГруппой Тогда
			//	СтруктураПоиска.Вставить("ГруппаУслуг", 0);
			//КонецЕсли; 
			НайдСтрокиРасходов = ТаблицаПоискаРасходов.НайтиСтроки(СтруктураПоиска);
			ГУИДРасходов = "";																
			//Если НайдСтрокиРасходов.Количество() > 0 Тогда
			//Если только ищем услуги, то строчки из ждн пропускаем в обработке таблицы расходов они отключатся
			Для каждого НайдСтрокаРасходов ИЗ НайдСтрокиРасходов Цикл
				Если Выборка.ТолькоИскатьУслугиВРасходах Тогда
					Если НайдСтрокаРасходов.ИсточникЖДН Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				//Если ЗначениеЗаполнено(МассивОбработанныхСтрок.Найти(НайдСтрокаРасходов.ГУИД)) Тогда
				//	Продолжить;
				//КонецЕсли;
				//Если Выборка.ИспользоватьТолькоУслугиСГруппой Тогда
				//	Для каждого НайдСтрокаРасходов Из НайдСтрокиРасходов Цикл
				//		Если НайдСтрокаРасходов.ГруппаУслуг > 0 Тогда
				//			ГУИДРасходов = НайдСтрокаРасходов.ГУИД;
				//		КонецЕсли;
				//	КонецЦикла;                                    
				//Иначе
					//ГУИДРасходов = НайдСтрокиРасходов[0].ГУИД;
					ГУИДРасходов = НайдСтрокаРасходов.ГУИД;
				//КонецЕсли;
				Если ЗначениеЗаполнено(ГУИДРасходов) Тогда
					//СтрокаРасход = Сделка.Расходы.Найти(ГУИДРасходов); 
					СтрокаРасход = ТаблицаРасходов.Найти(ГУИДРасходов, "ГУИД");
					//Евросиб - АСуслов 30.05.2022 22:05:29 #
					//(
					//Если ЗначениеЗаполнено(СтрокаРасход.ТранспортныйДокумент) Тогда
					//	//если ЖДН уже подобрана и номер различается, то нужно удалить строчку
						//Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаРасход.ТранспортныйДокумент, "НомерТранспортногоДокумента") <> Выборка.НомерТранспортногоДокумента Тогда
						//Если ЗначениеЗаполнено(СтрокаРасход.ТранспортныйДокумент) 
						//	И СтрокаРасход.ТранспортныйДокумент <> Выборка.НомерТранспортногоДокумента Тогда
						//	//СтрокаРасход = ОтключитьИДобавитьСтрокуРасходов(Сделка.Расходы, СтрокаРасход, Перечисления.ПричиныОтключенияСтрокиРасходовСделки.ЗаменаЖДН, Истина);
						//	//СтрокаРасход.УслугаОтключена = Истина;
						//	//получим новую строку            
						//	//если номер остался прежним
						//	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаРасход.ТранспортныйДокумент, "НомерТранспортногоДокумента") = Выборка.НомерТранспортногоДокумента Тогда
						//		СтрокаРасход.ТранспортныйДокумент = Выборка.ТранспортныйДокумент;
						//	Иначе
						//		СтрокаРасход = ОтключитьИДобавитьСтрокуРасходов(ТаблицаРасходов, СтрокаРасход, Перечисления.ПричиныОтключенияСтрокиРасходовСделки.ЗаменаЖДН, Истина);	
						//	КонецЕсли;
						//	//НайдСтрокиРасходов[0].УслугаОтключена = Истина;
						//КонецЕсли;
					//КонецЕсли;                                      
					//ЗаполняемыеСвойства = "ТранспортныйДокумент, ВидЖДН, ПунктОтправления, ПунктНазначения";
					//)
					//Евросиб - АСуслов 30.05.2022 22:05:30 #
					
					//Евросиб Каблов 29.05.2025 ( #100520
					//ЗаполняемыеСвойства = ПолучитьСписокПолейДляЗаполнения(Выборка);
					ПараметрыСтроки = Новый Структура("ЗаполнятьСтанциюОтправленияИзЖДН, ЗаполнятьСтанциюНазначенияИзЖДН");
					ЗаполнитьЗначенияСвойств(ПараметрыСтроки, Выборка);
					ПараметрыСтроки.Вставить("ПлановаяСтоимостьИзЖДНРасход", СтрокаРасход.ПлановаяСтоимостьИзЖДН);
					ЗаполняемыеСвойства = ПолучитьСписокПолейДляЗаполнения(ПараметрыСтроки);
					//Евросиб Каблов 29.05.2025 )
					
					ЗаполнитьЗначенияСвойств(СтрокаРасход, Выборка, ЗаполняемыеСвойства);
					//СтрокаРасход.ВагонЗаполненИзЖДН = Выборка.ЗаполнятьВагонИзЖДН;
					//СтрокаРасход.СтанцияОтправленияЗаполненИзЖДН = Выборка.ЗаполнятьСтанциюОтправленияИзЖДН;
					//СтрокаРасход.СтанцияНазначенияЗаполненИзЖДН = Выборка.ЗаполнятьСтанциюНазначенияИзЖДН;
					//НайдСтрокиРасходов[0].Использовано = Истина;
					НайдСтрокаРасходов.Использовано = Истина;
					МассивОбработанныхСтрок.Добавить(ГУИДРасходов);
					//Продолжить;
					УслугаНайдена = Истина;
				КонецЕсли;
			КонецЦикла;
			//КонецЕсли;
		КонецЕсли;
		Если Выборка.ТолькоИскатьУслугиВРасходах 
			ИЛИ УслугаНайдена Тогда
			Продолжить;
		КонецЕсли;
		//2. если ничего не нашли, то добавляем новую 
		//Евросиб - АСуслов 26.05.2022 16:55:53 #
		//(
		//если это не услуги с группой
		Если Выборка.ИспользоватьТолькоУслугиСГруппой Тогда
			Продолжить;
		КонецЕсли;
		//)
		//Евросиб - АСуслов 26.05.2022 16:55:56 #
		//нСтрокаРасход = Сделка.Расходы.Добавить();      
		нСтрокаРасход = ТаблицаРасходов.Добавить();
		нСтрокаРасход.ГУИД = Новый УникальныйИдентификатор;
		нСтрокаРасход.ПлановаяСтоимостьИзЖДН = Истина;
		ЗаполнитьЗначенияСвойств(нСтрокаРасход, Выборка);
		
	КонецЦикла;

	МассивНеобработанныхТекущихСтрок = ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивНеобработанныхТекущихСтрок, МассивОбработанныхСтрок);
	Для каждого НеобработаннаяСтрока Из МассивНеобработанныхТекущихСтрок Цикл
		СтрокаРасходов = ТаблицаРасходов.Найти(НеобработаннаяСтрока, "ГУИД");
		Если СтрокаРасходов.Услуга = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("УслугаФрахтаДляКалькуляции") Тогда
			Продолжить;
		КонецЕсли;
		СтрокаРасходов.ВидЖДН = Неопределено;
		СтрокаРасходов.ТранспортныйДокумент = Неопределено;  
		МассивОбработанныхСтрок.Добавить(НеобработаннаяСтрока);
	КонецЦикла;
	МассивНеобработанныхСтрок = ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивНеобработанныхСтрок, МассивОбработанныхСтрок);
	//Все необработанные строки пометим на удаление, т.к. по ним нет новых данных по калькуляциям
	//Возврат МассивНеОбработанныхСтрок;
	//Для каждого НеобработаннаяСтрока Из МассивнеОбработанныхСтрок Цикл
	//	СтрокаРасходов = Сделка.Расходы.Найти(НеобработаннаяСтрока, "ГУИД");
	//	Если СтрокаРасходов.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДН Тогда
	//		СтрокаРасходов.УслугаОтключена = Истина;
	//		СтрокаРасходов.ПричинаОтключенияСтроки = Перечисления.ПричиныОтключенияСтрокиРасходовСделки.ЗаменаЖДН;
	//		СтрокаРасходов = Неопределено;
	//	Иначе
	//		СтрокаРасходов.ТранспортныйДокумент = Документы.ТранспортныйДокумент.ПустаяСсылка();
	//	КонецЕсли;
	//КонецЦикла;
	Для каждого СтрокаРасход Из Сделка.Расходы Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаРасход.ТранспортныйДокумент) Тогда
			СтрокаРасход.ВидЖДН = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции 

Функция ПолучитьСписокПолейДляЗаполнения(Выборка)

	мЗаполняемыеСвойства = Новый Массив; 
	мЗаполняемыеСвойства.Добавить("ВидЖДН");
	мЗаполняемыеСвойства.Добавить("ТранспортныйДокумент");
	//Евросиб - АСуслов 12.07.2022 22:05:59 #
	//(
	мЗаполняемыеСвойства.Добавить("Калькуляция");
	//мЗаполняемыеСвойства.Добавить("ЗаполнятьВагонИзЖДН");
	мЗаполняемыеСвойства.Добавить("ЗаполнятьСтанциюОтправленияИзЖДН");
	мЗаполняемыеСвойства.Добавить("ЗаполнятьСтанциюНазначенияИзЖДН");
	//)
	//Евросиб - АСуслов 12.07.2022 22:05:59 #
	//Если Выборка.ЗаполнятьВагонИзЖДН Тогда
	мЗаполняемыеСвойства.Добавить("Вагон");
	//КонецЕсли;
	Если Выборка.ЗаполнятьСтанциюОтправленияИзЖДН Тогда
		мЗаполняемыеСвойства.Добавить("ПунктОтправления");
	КонецЕсли;
	Если Выборка.ЗаполнятьСтанциюНазначенияИзЖДН Тогда
		мЗаполняемыеСвойства.Добавить("ПунктНазначения");
	КонецЕсли;                                        
	ЗаполняемыеСвойства = СтрСоединить(мЗаполняемыеСвойства, ",");
	Если Выборка.ПлановаяСтоимостьИзЖДНРасход Тогда
		ЗаполняемыеСвойства = ЗаполняемыеСвойства + ", Себестоимость, СебестоимостьИтого, СуммаНДС, СтавкаНДС, СуммаИтого, ОтнестиНаЗатраты";
	КонецЕсли;
	Возврат ЗаполняемыеСвойства;
	
КонецФункции


Процедура ЗаполнитьРасходыУслугамиНевключеннымиВСтавку(ВремТаблицаРасходов, Сделка, МассивОбработанныхСтрок)
	Если Сделка.ПодсылПорожних Тогда //Евросиб Гудкова( 04.12.2020
		Возврат;
	КонецЕсли; // Евросиб Гудкова) 	    
	//добавим в таблицу данные по доп.расходам
	ТаблицаДопРасходов = Сделка.Расходы.Выгрузить(Новый Структура("ИсточникПоявленияСтрокиЭкономики, УслугаОтключена", Перечисления.ИсточникПоявленияСтрокиЭкономики.ДопУслугаАвтоматически, Ложь));
	//Для каждого СтрокаРасходЖДН Из ТаблицаРасходовПоЖДН Цикл
	//	нСтрокаВремРасход = ВремТаблицаРасходов.Добавить();
	//	ЗаполнитьЗначенияСвойств(нСтрокаВремРасход, СтрокаРасходЖДН);
	//КонецЦикла; 
	
#Область Запрос
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.Клиент КАК Клиент,
	|	СделкаСвязьУчетныхЕдиниц.Договор КАК Договор,
	|	СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция,
	|	СделкаСвязьУчетныхЕдиниц.РазмерКТК КАК РазмерКТК,
	|	СделкаСвязьУчетныхЕдиниц.Груз КАК Груз,
	|	СделкаСвязьУчетныхЕдиниц.Протокол КАК ПСЦ,
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК СтрокаСУЕ,
	|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	|	СделкаСвязьУчетныхЕдиниц.Вагон КАК Вагон,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН КАК ЖДН,
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	|	СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки,
	|	СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения
	|ПОМЕСТИТЬ ВТ_СделкаСвязьУчетныхЕдиниц
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|ГДЕ
	|	НЕ СделкаСвязьУчетныхЕдиниц.Удалена
	|	И НЕ СделкаСвязьУчетныхЕдиниц.НеАктивна
	|	И НЕ СделкаСвязьУчетныхЕдиниц.ОтключитьРасходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//Евросиб - АСуслов 28.11.2023 13:18:36 #77908
	//(
	//|ВЫБРАТЬ        
	//убираем дубли жд строчек если они есть
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//)
	//Евросиб - АСуслов 28.11.2023 13:18:44 #77908
	|	ВТ_СделкаСвязьУчетныхЕдиниц.Клиент КАК Клиент,
	|	ВТ_СделкаСвязьУчетныхЕдиниц.Договор КАК Договор,
	|	ВТ_СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция,
	|	ВТ_СделкаСвязьУчетныхЕдиниц.РазмерКТК КАК РазмерКТК,
	|	ВТ_СделкаСвязьУчетныхЕдиниц.Груз КАК Груз,
	|	ВТ_СделкаСвязьУчетныхЕдиниц.ПСЦ КАК ПСЦ,
	|	ВТ_СделкаСвязьУчетныхЕдиниц.СтрокаСУЕ КАК СтрокаСУЕ,
	|	ВТ_СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	|	ВТ_СделкаСвязьУчетныхЕдиниц.Вагон КАК Вагон,
	|	ВТ_СделкаСвязьУчетныхЕдиниц.ЖДН КАК ЖДН,
	|	ВТ_СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	|	ВТ_СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки,
	|	ВТ_СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения
	|ПОМЕСТИТЬ ВТ_СделкаСвязьУчетныхЕдиниц2
	|ИЗ
	|	ВТ_СделкаСвязьУчетныхЕдиниц КАК ВТ_СделкаСвязьУчетныхЕдиниц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СделкаСвязьУчетныхЕдиниц КАК ВТ_СделкаСвязьУчетныхЕдиниц1
	|		ПО ВТ_СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки = ВТ_СделкаСвязьУчетныхЕдиниц1.ГУИДСтрокиЗаявки
	|			И (ВТ_СделкаСвязьУчетныхЕдиниц1.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ЖД))
	|ГДЕ
	|	(ВТ_СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ПустаяСсылка)
	|			ИЛИ ВТ_СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ЖД)
	|			ИЛИ ВТ_СделкаСвязьУчетныхЕдиниц1.ВидТранспортногоСообщения ЕСТЬ NULL)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	|	СделкаРасходы.Услуга КАК Услуга,
	|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики_Старая КАК ИсточникПоявленияСтрокиЭкономики_Старая,
	|	СделкаРасходы.ГУИД КАК ГУИД,
	|	СделкаРасходы.ПунктОтправления КАК ПунктОтправления,
	|	СделкаРасходы.ПунктНазначения КАК ПунктНазначения,
	|	СделкаРасходы.Поставщик КАК Поставщик,
	|	СделкаРасходы.Договор КАК Договор,
	|	СделкаРасходы.Валюта КАК Валюта,
	|	СделкаРасходы.СтрокаКалькуляции КАК СтрокаКалькуляции
	|ПОМЕСТИТЬ ВТ_Расходы
	|ИЗ
	|	Документ.Сделка.Расходы КАК СделкаРасходы
	|ГДЕ
	|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ДопУслугаАвтоматически)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КалькуляцияЖД_УслугиВнеСтавки.Услуга КАК Услуга,
	|	ВТ_Отбор.Клиент КАК Клиент,
	|	ВТ_Отбор.Договор КАК ДоговорКлиента,
	|	ВЫБОР
	|		КОГДА ВТ_Отбор.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|			ТОГДА КалькуляцияЖД_УслугиВнеСтавки.Себестоимость20
	|		ИНАЧЕ КалькуляцияЖД_УслугиВнеСтавки.Себестоимость40
	|	КОНЕЦ КАК Себестоимость,
	|	ВЫБОР
	|		КОГДА ВТ_Отбор.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|			ТОГДА КалькуляцияЖД_УслугиВнеСтавки.Вознаграждение20
	|		ИНАЧЕ КалькуляцияЖД_УслугиВнеСтавки.Вознаграждение40
	|	КОНЕЦ КАК Вознаграждение,
	|	КалькуляцияЖД_УслугиВнеСтавки.Ссылка КАК Калькуляция,
	|	ИСТИНА КАК НеВыставлятьКлиенту,
	|	КалькуляцияЖД_УслугиВнеСтавки.ТипСтавки КАК ТипСтавки,
	|	ВЫБОР
	|		КОГДА КалькуляцияЖД_УслугиВнеСтавки.ТипСтавки = ЗНАЧЕНИЕ(Перечисление.ТипыСтавокПротокола.Ставка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Перевыставляемая,
	|	КалькуляцияЖД_УслугиВнеСтавки.Поставщик КАК Поставщик,
	|	КалькуляцияЖД_УслугиВнеСтавки.Договор КАК Договор,
	|	КалькуляцияЖД_УслугиВнеСтавки.ПроцентВознаграждения КАК ПроцентВознаграждения,
	|	КалькуляцияЖД_УслугиВнеСтавки.СтавкаНДСВознаграждения КАК СтавкаНДСВознаграждения,
	|	КалькуляцияЖД_УслугиВнеСтавки.ВознаграждениеВключаетНДС КАК ВознаграждениеВключаетНДС,
	|	КалькуляцияЖД_УслугиВнеСтавки.СтавкаНДС КАК СтавкаНДС,
	|	КалькуляцияЖД_УслугиВнеСтавки.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	КалькуляцияЖД_УслугиВнеСтавки.Валюта КАК Валюта,
	|	1 КАК Количество,
	|	ВТ_Отбор.РазмерКТК КАК РазмерКТК,
	|	ВТ_Отбор.Груз КАК Груз,
	|	ВТ_Отбор.ПСЦ КАК ПСЦ,
	|	КалькуляцияЖД_УслугиВнеСтавки.ПлановаяСтоимостьИзЖДН КАК ПлановаяСтоимостьИзЖДН,
	|	ИСТИНА КАК УслугаВнеСтавки,
	|	ВТ_Отбор.СтрокаСУЕ КАК СтрокаСУЕ,
	|	ВТ_Отбор.Контейнер КАК Контейнер,
	|	ВТ_Отбор.Вагон КАК Вагон,
	|	ВТ_Отбор.ЖДН КАК ЖДН,
	|	КалькуляцияЖД_УслугиВнеСтавки.ПунктОтправления КАК ПунктОтправления,
	|	КалькуляцияЖД_УслугиВнеСтавки.ПунктНазначения КАК ПунктНазначения,
	|	ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ДопУслугаАвтоматически) КАК ИсточникПоявленияСтрокиЭкономики,
	|	КалькуляцияЖД_УслугиВнеСтавки.ИдентификаторСтроки КАК ИдентификаторСтрокиКалькуляции,
	|	ВТ_Отбор.ГУИД КАК ГУИД,
	|	КалькуляцияЖД_УслугиВнеСтавки.КлючАналитикиСтрокиКалькуляции КАК КлючАналитикиСтрокиКалькуляции
	|ПОМЕСТИТЬ ВТ_РасходыВнеСтавки
	|ИЗ
	|	ВТ_СделкаСвязьУчетныхЕдиниц2 КАК ВТ_Отбор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция.ЖД_УслугиВнеСтавки КАК КалькуляцияЖД_УслугиВнеСтавки
	|		ПО ВТ_Отбор.Калькуляция = КалькуляцияЖД_УслугиВнеСтавки.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Расходы.ГУИД КАК ГУИД
	|ИЗ
	|	ВТ_Расходы КАК ВТ_Расходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РасходыВнеСтавки.Услуга КАК Услуга,
	|	ВТ_РасходыВнеСтавки.Клиент КАК Клиент,
	|	ВТ_РасходыВнеСтавки.ДоговорКлиента КАК ДоговорКлиента,
	|	ВТ_РасходыВнеСтавки.Себестоимость КАК Себестоимость,
	|	ВТ_РасходыВнеСтавки.Вознаграждение КАК Вознаграждение,
	|	ВТ_РасходыВнеСтавки.Калькуляция КАК Калькуляция,
	|	ВТ_РасходыВнеСтавки.НеВыставлятьКлиенту КАК НеВыставлятьКлиенту,
	|	ВТ_РасходыВнеСтавки.ТипСтавки КАК ТипСтавки,
	|	ВТ_РасходыВнеСтавки.Перевыставляемая КАК Перевыставляемая,
	|	ВТ_РасходыВнеСтавки.Поставщик КАК Поставщик,
	|	ВТ_РасходыВнеСтавки.Договор КАК Договор,
	|	ВТ_РасходыВнеСтавки.ПроцентВознаграждения КАК ПроцентВознаграждения,
	|	ВТ_РасходыВнеСтавки.СтавкаНДСВознаграждения КАК СтавкаНДСВознаграждения,
	|	ВТ_РасходыВнеСтавки.ВознаграждениеВключаетНДС КАК ВознаграждениеВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВТ_РасходыВнеСтавки.Перевыставляемая
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВТ_РасходыВнеСтавки.СтавкаНДС
	|	КОНЕЦ КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ВТ_РасходыВнеСтавки.Перевыставляемая
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВТ_РасходыВнеСтавки.СуммаВключаетНДС
	|	КОНЕЦ КАК НДСВключенВСтоимость,
	|	ВТ_РасходыВнеСтавки.Валюта КАК Валюта,
	|	ВТ_РасходыВнеСтавки.Количество КАК Количество,
	|	ВТ_РасходыВнеСтавки.РазмерКТК КАК РазмерКТК,
	|	ВТ_РасходыВнеСтавки.Груз КАК Груз,
	|	ВТ_РасходыВнеСтавки.ПСЦ КАК ПСЦ,
	|	ВТ_РасходыВнеСтавки.ПлановаяСтоимостьИзЖДН КАК ПлановаяСтоимостьИзЖДН,
	|	ВТ_РасходыВнеСтавки.УслугаВнеСтавки КАК УслугаВнеСтавки,
	|	ВТ_РасходыВнеСтавки.СтрокаСУЕ КАК СтрокаСУЕ,
	|	ВТ_РасходыВнеСтавки.Контейнер КАК Контейнер,
	|	ВТ_РасходыВнеСтавки.Вагон КАК Вагон,
	|	ВТ_РасходыВнеСтавки.ЖДН КАК ЖДН,
	|	ВТ_РасходыВнеСтавки.ПунктОтправления КАК ПунктОтправления,
	|	ВТ_РасходыВнеСтавки.ПунктНазначения КАК ПунктНазначения,
	|	ВТ_РасходыВнеСтавки.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	|	ВТ_РасходыВнеСтавки.ИдентификаторСтрокиКалькуляции КАК СтрокаКалькуляции,
	|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики_Старая КАК ИсточникПоявленияСтрокиЭкономики_Старая,
	|	СделкаРасходы.ГУИД КАК ГУИД,
	|	ВТ_РасходыВнеСтавки.КлючАналитикиСтрокиКалькуляции КАК КлючАналитикиСтрокиКалькуляции
	|ИЗ
	|	ВТ_РасходыВнеСтавки КАК ВТ_РасходыВнеСтавки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Расходы КАК СделкаРасходы
	|		ПО ВТ_РасходыВнеСтавки.СтрокаСУЕ = СделкаРасходы.СтрокаСвязьУчетныхЕдиниц
	|			И ВТ_РасходыВнеСтавки.ИдентификаторСтрокиКалькуляции = СделкаРасходы.СтрокаКалькуляции";
	//|ГДЕ
	//|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц ЕСТЬ NULL";
#КонецОбласти
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.СвязьУчетныхЕдиниц", "&СвязьУчетныхЕдиниц");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.Расходы", "&Расходы");
	
	Запрос.УстановитьПараметр("Ссылка", Сделка.Ссылка);
	Запрос.УстановитьПараметр("СвязьУчетныхЕдиниц", Сделка.СвязьУчетныхЕдиниц.Выгрузить());
	//Запрос.УстановитьПараметр("Расходы", Сделка.Расходы.Выгрузить());
	//Запрос.УстановитьПараметр("Расходы", ВремТаблицаРасходов);
	Запрос.УстановитьПараметр("Расходы", ТаблицаДопРасходов);
	//Евросиб Каблов 09.04.2025 ( #105407 Не используется
	//ГлобальныйОткрытыйПериод = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Сделка.Организация);
	//Евросиб Каблов 09.04.2025 )
	//Запрос.УстановитьПараметр("Договор", СписокГотовыхКОформлениюДоговоров.Выгрузить(,"Договор").ВыгрузитьКолонку("Договор"));
	//РезультатЗапроса = Запрос.Выполнить();
	Пакеты = Запрос.ВыполнитьПакет();
	КоличествоПакетов = Пакеты.Количество();      
	МассивНеобработанныхСтрок = Пакеты[КоличествоПакетов - 2].Выгрузить().ВыгрузитьКолонку("ГУИД");
	Выборка = Пакеты[КоличествоПакетов - 1].Выбрать();
	//МассивОбработанныхСтрок = Новый Массив;
	Пока Выборка.Следующий() Цикл
		
		//будем искать строку в расходах и сравнивать с актуальными данными,
		//если есть изменения, то
		СтрокаРасходов = Сделка.Расходы.Найти(Выборка.ГУИД, "ГУИД");
		//СтрокаРасходов = ВремТаблицаРасходов.Найти(Выборка.ГУИД, "ГУИД");
		//сравним значения
		Если СтрокаРасходов <> Неопределено Тогда
			МассивОбработанныхСтрок.Добавить(СтрокаРасходов.ГУИД);
			кэшМассивПоляСравненияКалькуляция = КлючиАналитикСтрокКалькуляции.ПолучитьСписокКлючевыхПолей(Выборка.ИсточникПоявленияСтрокиЭкономики);
			МассивПоляСравненияКалькуляция = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(кэшМассивПоляСравненияКалькуляция);
			//ИсключитьПоляСравненияЗаполненныеИзЖДН(МассивПоляСравненияКалькуляция, СтрокаРасходов, Выборка);
			ПоляСравнения = СтрСоединить(МассивПоляСравненияКалькуляция, ",");
			ДанныеИдентичны = СравнитьДанные(СтрокаРасходов, Выборка, ПоляСравнения);
			Если НЕ ДанныеИдентичны Тогда
				//текущую отключаем, новую добавляем
				//в запросе отключенные не связываются по строке калькуляции
				СтрокаРасходов.УслугаОтключена = Истина;
				СтрокаРасходов.ПричинаОтключенияСтроки = Перечисления.ПричиныОтключенияСтрокиРасходовСделки.ИзменениеКалькуляции;
				СтрокаРасходов = Неопределено;
			Иначе
				ПоляСравнения = "Перевыставляемая, ПлановаяСтоимостьИзЖДН, Поставщик, Договор,
				//|ПунктОтправления, ПунктНазначения, Себестоимость, Валюта";
                //ДИТ, Беляев СЮ, Ticket#0276626, 29-06-2022, начало  (с) Суслов Александр
				|Себестоимость, Валюта";
                //ДИТ, Беляев СЮ, Ticket#0276626, 29-06-2022, конец
				
				//Евросиб - АСуслов 02.06.2022 14:25:15 #
				//(
				//добавил вагон, ктк
				//это сравнение будет в общей процедуре сравнения т.к. вагон и контейнер может измениться в ждн. (с) Суслов Александр
				//ПоляСравнения = ПоляСравнения + ", Вагон, Контейнер";  //ДИТ, Беляев СЮ, Ticket#0276626, 29-06-2022, закомментировал
				//)
				//Евросиб - АСуслов 02.06.2022 14:25:16 #
				ДанныеИдентичны = СравнитьДанные(СтрокаРасходов, Выборка, ПоляСравнения);
				//Евросиб Каблов 10.01.2024 ( #78725
				//Если ДанныеИдентичны Тогда
				//	нСтрокаВремРасход = ВремТаблицаРасходов.Добавить();
				//	ЗаполнитьЗначенияСвойств(нСтрокаВремРасход, СтрокаРасходов);
				//	Продолжить;   
				//КонецЕсли;
				нСтрокаВремРасход = ВремТаблицаРасходов.Добавить();
				ЗаполнитьЗначенияСвойств(нСтрокаВремРасход, СтрокаРасходов);
				СтрокаРасходов = нСтрокаВремРасход;
				Если ДанныеИдентичны Тогда					
					Продолжить;   
				КонецЕсли;
				//Евросиб Каблов 10.01.2024 )
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаРасходов = Неопределено Тогда
			//СтрокаРасходов = Сделка.Расходы.Добавить();
			СтрокаРасходов = ВремТаблицаРасходов.Добавить();
			//Евросиб - АСуслов 03.05.2023 14:45:42 #69494
			//(
			//Идентификатор присвоится в процедуре ОбработатьТаблицуРасходов
			//ИдентификаторРасходов = Новый УникальныйИдентификатор;
			//СтрокаРасходов.ГУИД = ИдентификаторРасходов;
			//)
			//Евросиб - АСуслов 03.05.2023 14:45:44 #69494
		КонецЕсли;                  
		//Евросиб - АСуслов 14.12.2022 17:11:16 #62448
		//(
		Если Выборка.Перевыставляемая Тогда    
			ПоляИсключения = "ГУИД, СтавкаНДС, СуммаВключаетНДС";
		Иначе
			ПоляИсключеня = "ГУИД";
		КонецЕсли;
		//)
		//Евросиб - АСуслов 14.12.2022 17:11:20 #62448
		ЗаполнитьЗначенияСвойств(СтрокаРасходов, Выборка,,"ГУИД");
		СтрокаРасходов.НоменклатурнаяГруппа = РазнесениеЗатратСервер.ПодобратьНоменклатурнуюГруппуПоНаборуПараметров(Сделка.ТипЗаказа, Выборка.Вагон);
		СтрокаРасходов.НеВключатьВПлановыеРасходы = Истина;
		СтрокаРасходов.Договор = Выборка.Договор;
		СтрокаРасходов.СтрокаСвязьУчетныхЕдиниц = Выборка.СтрокаСУЕ;
		//СтрокаРасходов.ПериодВО = ГлобальныйОткрытыйПериод;
		СтрокаРасходов.СебестоимостьИтого	= СтрокаРасходов.Себестоимость * СтрокаРасходов.Количество;
		СтрокаРасходов.СуммаНДС 				= БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(СтрокаРасходов.СебестоимостьИтого, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СтрокаРасходов.СтавкаНДС), Истина, СтрокаРасходов.НДСВключенВСтоимость);
		СтрокаРасходов.СуммаИтого 			= СтрокаРасходов.СебестоимостьИтого + ?(СтрокаРасходов.НДСВключенВСтоимость, 0, СтрокаРасходов.СуммаНДС);
		СтрокаРасходов.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ДопУслугаАвтоматически;
		//Евросиб - АСуслов 03.05.2023 14:44:14 #69494
		//(
		//связь добавится в процедуре ОбработатьТаблицуРасходов 
		//Документы.Сделка.СвязатьДоходыРасходыСУЕ(Сделка,,СтрокаРасходов.ГУИД ,Выборка.СтрокаСУЕ, Выборка.Услуга);
		//)
		//Евросиб - АСуслов 03.05.2023 14:44:40 #69494
		
	КонецЦикла;
	//МассивНеобработанныхСтрок = ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивНеобработанныхСтрок, МассивОбработанныхСтрок);
	////Все необработанные строки пометим на удаление, т.к. по ним нет новых данных по калькуляциям
	//Для каждого НеобработаннаяСтрока Из МассивНеОбработанныхСтрок Цикл
	//	СтрокаРасходов = Сделка.Расходы.Найти(НеобработаннаяСтрока, "ГУИД");
	//	СтрокаРасходов.УслугаОтключена = Истина;
	//	СтрокаРасходов.ПричинаОтключенияСтроки = Перечисления.ПричиныОтключенияСтрокиРасходовСделки.ИзменениеКалькуляции;
	//	СтрокаРасходов = Неопределено;
	//КонецЦикла;
	//
КонецПроцедуры

Функция ОтключитьИДобавитьСтрокуРасходов(Расходы, СтрокаДляОтключения, ПричинаОтключения, СкопироватьДанныеВНовуюСтрокуИзОтключаемой)
	СтрокаРасходНовая = Неопределено;
	СтрокаДляОтключения.УслугаОтключена = Истина;
	СтрокаДляОтключения.УслугаОтключенаУсловно = Ложь;
	СтрокаДляОтключения.ПричинаОтключенияСтроки = ПричинаОтключения;
	Если СкопироватьДанныеВНовуюСтрокуИзОтключаемой Тогда
		СтрокаРасходНовая = Расходы.Добавить();             
		СтрокаРасходНовая.ГУИД = Новый УникальныйИдентификатор;
		СтрокаРасходНовая.УслугаОтключена = Ложь;                                                                       
		//Евросиб - АСуслов 29.08.2022 14:59:41 #56528
		//(
		//ЗаполнитьЗначенияСвойств(СтрокаРасходНовая, СтрокаДляОтключения,,"ГУИД, УслугаОтключена, ПричинаОтключенияСтроки");
		ЗаполнитьЗначенияСвойств(СтрокаРасходНовая, СтрокаДляОтключения,,"ГУИД, УслугаОтключена, ПричинаОтключенияСтроки, УчДокумент");
		//)
		//Евросиб - АСуслов 29.08.2022 14:59:52 #56528                                                                                 
	КонецЕсли;
	Возврат СтрокаРасходНовая;
КонецФункции

Функция ПолучитьВсеПоляСравнения(ВыборкаДетали)
	//УслугаФрахтаДляКалькуляции = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("УслугаФрахтаДляКалькуляции");	
	ПоляСравнения = "Услуга,
			|ГруппаУслуг,
			|ОсновнаяУслугаГруппы,
			|ВнутренняяСебестоимость,
			|Контейнер,
			|Вагон,
			|ТранспортныйДокумент,
			|Калькуляция,
			|Поставщик,
			|Договор,
			|ПлановаяСтоимостьИзЖДН,
			|ПунктОтправления,
			|ПунктНазначения,
			|Себестоимость,  
			|СтавкаНДС,
			|НДСВключенВСтоимость,
			|Валюта,
			|ОтнестиНаЗатраты";
	//Если УслугаФрахтаДляКалькуляции = ВыборкаДетали.Услуга Тогда
	//	ПоляСравнения = ПоляСравнения + "
	//	|ТранспортныйДокумент";
	//	Если ВыборкаДетали.КалькуляцияФрахтИмпорт Тогда
	//		ПоляСравненияКалькуляция = ПоляСравненияКалькуляция + ", ПунктОтправления";
	//	Иначе
	//		ПоляСравненияКалькуляция = ПоляСравненияКалькуляция + ", ПунктНазначения";
	//	КонецЕсли;
	//КонецЕсли;                 
	Возврат ПоляСравнения;
КонецФункции

Функция ПолучитьСписокПолейСТипомНакладная(Сделка) Экспорт
	МассивПолей = Новый Массив;
	ТипТранспортныйДокумент = Новый ОписаниеТипов("ДокументСсылка.ТранспортныйДокумент");
	Для каждого РеквизитТЧ Из Сделка.Метаданные().ТабличныеЧасти.СвязьУчетныхЕдиниц.Реквизиты Цикл
		Если РеквизитТЧ.Тип = ТипТранспортныйДокумент Тогда
			МассивПолей.Добавить(РеквизитТЧ.Имя);
		КонецЕсли;
	КонецЦикла;
	Возврат МассивПолей;
КонецФункции

Функция СравнитьДанные(Источник1, Источник2, ПоляСравнения)
	СтруктураИсточник1 = Новый Структура(ПоляСравнения);
	СтруктураИсточник2 = Новый Структура(ПоляСравнения);
	ЗаполнитьЗначенияСвойств(СтруктураИсточник1, Источник1);
	ЗаполнитьЗначенияСвойств(СтруктураИсточник2, Источник2);            
	Возврат ОбщегоНазначения.КоллекцииИдентичны(СтруктураИсточник1, СтруктураИсточник2);
КонецФункции

Процедура ЗаписатьВагоныКТКТДВТЧ(Сделка)
	Возврат;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	|	СделкаРасходы.ГУИД КАК ГУИД,
	|	СделкаРасходы.Подсыл КАК Подсыл,
	|	СделкаРасходы.ГруппаУслуг КАК ГруппаУслуг,
	|	СделкаРасходы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	|	ВЫРАЗИТЬ(СделкаРасходы.Услуга КАК Справочник.Номенклатура) КАК Услуга
	|ПОМЕСТИТЬ ВремТЧ_Расходы
	|ИЗ
	|	&ТЧРасходы КАК СделкаРасходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.Контейнер КАК Справочник.ТЕ) КАК Контейнер,
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.Вагон КАК Справочник.ТС) КАК Вагон,
	|	СделкаСвязьУчетныхЕдиниц.НомерЖДН КАК НомерЖДН,
	|	СделкаСвязьУчетныхЕдиниц.НомерВагоннойЖДН КАК НомерВагоннойЖДН,
	|	СделкаСвязьУчетныхЕдиниц.НомерПорожнейВагоннойЖДН КАК НомерПорожнейВагоннойЖДН,
	|	СделкаСвязьУчетныхЕдиниц.НомерПорожнейЖДНКТК КАК НомерПорожнейЖДНКТК,
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.Коносамент КАК Документ.ТранспортныйДокумент) КАК Коносамент,
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.НакладнаяПослеГруженогоПлеча КАК Документ.ТранспортныйДокумент) КАК НакладнаяПослеГруженогоПлеча,
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.ЖДНПерестановкиДоГружКТК КАК Документ.ТранспортныйДокумент) КАК НакладнаяПерестановкиДоГружКТК,
	|	ВЫРАЗИТЬ(СделкаСвязьУчетныхЕдиниц.ЖДНПерестановкиДоПорКТК КАК Документ.ТранспортныйДокумент) КАК НакладнаяПерестановкиДоПорКТК,
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД
	|ПОМЕСТИТЬ ВремТЧ_СУЕ
	|ИЗ
	|	&ТЧСУЕ КАК СделкаСвязьУчетныхЕдиниц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТЧ_Расходы.ГУИД КАК ГУИД,
	|	ВЫБОР
	|		КОГДА ВремТЧ_Расходы.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.вагон)
	|			ТОГДА """"
	|		ИНАЧЕ ВремТЧ_СУЕ.Контейнер.Наименование
	|	КОНЕЦ КАК СписокКТК,
	|	ВремТЧ_СУЕ.Вагон.Наименование КАК СписокВагонов,
	|	ВЫБОР
	|		КОГДА ВремТЧ_Расходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ПорожняяЖДН)
	|			ТОГДА ВремТЧ_СУЕ.НомерВагоннойЖДН
	|		КОГДА ВремТЧ_Расходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДНПодсылаВагонов)
	|			ТОГДА ВремТЧ_СУЕ.НомерПорожнейВагоннойЖДН
	|		КОГДА ВремТЧ_Расходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДНПодсылаКТК)
	|			ТОГДА ВремТЧ_СУЕ.НомерПорожнейЖДНКТК
	|		КОГДА ВремТЧ_Расходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДНВозврата)
	|			ТОГДА ВЫРАЗИТЬ(ВремТЧ_СУЕ.НакладнаяПослеГруженогоПлеча КАК Документ.ТранспортныйДокумент).НомерТранспортногоДокумента
	|		КОГДА ВремТЧ_Расходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДНПерестановкиВагонов)
	|			ТОГДА ВЫБОР 
	|   				КОГДА ВремТЧ_СУЕ.НакладнаяПерестановкиДоГружКТК = Значение(Документ.ТранспортныйДокумент.ПустаяСсылка) 
	|  						ТОГДА ВЫРАЗИТЬ(ВремТЧ_СУЕ.НакладнаяПерестановкиДоПорКТК КАК Документ.ТранспортныйДокумент).НомерТранспортногоДокумента 
	|  							ИНАЧЕ ВЫРАЗИТЬ(ВремТЧ_СУЕ.НакладнаяПерестановкиДоГружКТК КАК Документ.ТранспортныйДокумент).НомерТранспортногоДокумента 
	|  				  КОНЕЦ
	|		КОГДА ВремТЧ_Расходы.Услуга = &УслугаФрахт
	|			ТОГДА ВремТЧ_СУЕ.Коносамент.НомерТранспортногоДокумента
	//|		КОГДА (ВремТЧ_Расходы.Услуга.УслугаРасходовВыбираетсяПриУсловии = 1
	//|				ИЛИ ВремТЧ_Расходы.Услуга.УслугаРасходовВыбираетсяПриУсловии = 2)
	//|				И ВремТЧ_Расходы.ГруппаУслуг > 0
	//|			ТОГДА ВремТЧ_СУЕ.НакладнаяПослеГруженогоПлеча.НомерТранспортногоДокумента
	|       КОГДА ВремТЧ_Расходы.Подсыл ТОГДА """"
	|		ИНАЧЕ ВремТЧ_СУЕ.НомерЖДН
	|	КОНЕЦ КАК СписокТД,
	|	ВремТЧ_Расходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	|	ВремТЧ_Расходы.Услуга КАК Услуга,
	|	ВремТЧ_СУЕ.НомерЖДН КАК НомерЖДН,
	|	ВремТЧ_СУЕ.НомерВагоннойЖДН КАК НомерВагоннойЖДН,
	|	ВремТЧ_СУЕ.НомерПорожнейВагоннойЖДН КАК НомерПорожнейВагоннойЖДН,
	|	ВремТЧ_СУЕ.НомерПорожнейЖДНКТК КАК НомерПорожнейЖДНКТК,
	|	ВремТЧ_СУЕ.Коносамент.НомерТранспортногоДокумента КАК КоносаментНомерТранспортногоДокумента
	|ИЗ
	|	ВремТЧ_Расходы КАК ВремТЧ_Расходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремТЧ_СУЕ КАК ВремТЧ_СУЕ
	|		ПО ВремТЧ_Расходы.СтрокаСвязьУчетныхЕдиниц = ВремТЧ_СУЕ.ГУИД";
	Запрос.УстановитьПараметр("ТЧРасходы", Сделка.Расходы.Выгрузить(,"СтрокаСвязьУчетныхЕдиниц, ГУИД, ЕдиницаИзмерения, ИсточникПоявленияСтрокиЭкономики, Услуга, ГруппаУслуг, Подсыл"));
	Запрос.УстановитьПараметр("ТЧСУЕ", Сделка.СвязьУчетныхЕдиниц.Выгрузить(,"Контейнер, Вагон, НомерЖДН, ГУИД, НомерВагоннойЖДН, НомерПорожнейЖДНКТК, НомерПорожнейВагоннойЖДН, Коносамент, НакладнаяПослеГруженогоПлеча,ЖДНПерестановкиДоГружКТК,ЖДНПерестановкиДоПорКТК"));
	Запрос.УстановитьПараметр("УслугаФрахт", ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("УслугаФрахтаДляКалькуляции"));
	РезультатЗапроса = Запрос.Выполнить();
	Стр = РезультатЗапроса.Выбрать();
	
	Пока Стр.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Стр.СписокВагонов) Тогда
			Если НЕ Стр.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДНПодсылаКТК Тогда
				//эти вагоны добавляются при добавлении основных услуг
				НСтр = Сделка.ДоходыВагоны.Найти(Стр.ГУИД, "ГУИД");
				Если НСтр = Неопределено Тогда
					НСтр = Сделка.ДоходыВагоны.Добавить(); 
				КонецЕсли; 
				НСтр.ГУИД = Стр.ГУИД; 
				НСтр.Вагон = Стр.СписокВагонов; 
			КонецЕсли; 
		КонецЕсли;
		Если ЗначениеЗаполнено(Стр.СписокКТК) Тогда 
			//эти ктк добавляются при добавлении основных услуг
			Если НЕ Стр.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДНВозврата Тогда
				НСтр = Сделка.ДоходыКТК.Найти(Стр.ГУИД, "ГУИД");
				Если НСтр = Неопределено Тогда
					НСтр = Сделка.ДоходыКТК.Добавить(); 
				КонецЕсли;
				НСтр.ГУИД = Стр.ГУИД; 
				НСтр.КТК = Стр.СписокКТК; 
			КонецЕсли; 
		КонецЕсли;
		//Если ЗначениеЗаполнено(Стр.СписокТД) Тогда 
			НСтр = Сделка.ДоходыТД.Найти(Стр.ГУИД, "ГУИД");
			Если НСтр = Неопределено Тогда
				НСтр = Сделка.ДоходыТД.Добавить(); 
			КонецЕсли;
			НСтр.ГУИД = Стр.ГУИД; 
			НСтр.ТД = Стр.СписокТД; 
		//КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

Процедура ОтработатьАктивностьСтрокРасходов(Сделка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаРасходы.ГУИД КАК ГУИД,
	|	ВЫРАЗИТЬ(СделкаРасходы.Услуга КАК Справочник.Номенклатура) КАК Услуга,
	|	СделкаРасходы.ГруппаУслуг КАК ГруппаУслуг,
	|	СделкаРасходы.УслугаОтключена КАК УслугаОтключена,
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	|	СделкаРасходы.ОсновнаяУслугаГруппы КАК ОсновнаяУслугаГруппы,
	|	СделкаРасходы.УчДокумент КАК УчДокумент,
	//Евросиб - АСуслов 06.09.2022 13:05:59 #
	//(
	|   СделкаРасходы.УслугаОтключенаУсловно КАК УслугаОтключенаУсловно
	//)
	//Евросиб - АСуслов 06.09.2022 13:06:00 #
	|ПОМЕСТИТЬ ВТ_Расходы
	|ИЗ
	|	&Расходы КАК СделкаРасходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	|	СделкаСвязьУчетныхЕдиниц.НакладнаяПослеГруженогоПлеча КАК НакладнаяПослеГруженогоПлеча,
	|	СделкаСвязьУчетныхЕдиниц.НакладнаяПослеГружКТК КАК НакладнаяПослеГружКТК
	|ПОМЕСТИТЬ ВТ_СвязьУчетныхЕдиниц
	|ИЗ
	|	&СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаРасходы.ГУИД КАК ГУИД,
	|	СделкаРасходы.Услуга КАК Услуга,
	|	ВЫБОР КОГДА СделкаРасходы.ОсновнаяУслугаГруппы Тогда -1 ИНАЧЕ СделкаРасходы.Услуга.УслугаРасходовВыбираетсяПриУсловии КОНЕЦ КАК ВидУслуги,
	|	СделкаРасходы.ГруппаУслуг КАК ГруппаУслуг,
	|	СделкаРасходы.УслугаОтключена КАК УслугаОтключена,
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	|	ВЫБОР
	|		КОГДА СделкаРасходы.УчДокумент = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
	|				И СделкаРасходы.УслугаОтключена
	|			ТОГДА 2
	|		КОГДА СделкаРасходы.УчДокумент = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК УчДокумент,
	|	ВЫБОР
	|		КОГДА СделкаСвязьУчетныхЕдиниц.НакладнаяПослеГруженогоПлеча = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|				И СделкаСвязьУчетныхЕдиниц.НакладнаяПослеГружКТК = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|				И СделкаРасходы.ОсновнаяУслугаГруппы
	|			ТОГДА ИСТИНА
	|		КОГДА НЕ СделкаСвязьУчетныхЕдиниц.НакладнаяПослеГруженогоПлеча = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|				И СделкаРасходы.Услуга.УслугаРасходовВыбираетсяПриУсловии = 1
	|			ТОГДА ИСТИНА
	|		КОГДА НЕ СделкаСвязьУчетныхЕдиниц.НакладнаяПослеГружКТК = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|				И СделкаРасходы.Услуга.УслугаРасходовВыбираетсяПриУсловии = 2
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Включить,
	|	СделкаСвязьУчетныхЕдиниц.НакладнаяПослеГружКТК КАК НакладнаяПослеГружКТК
	|ИЗ
	|	ВТ_Расходы КАК СделкаРасходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|		ПО СделкаРасходы.СтрокаСвязьУчетныхЕдиниц = СделкаСвязьУчетныхЕдиниц.ГУИД
	|ГДЕ
	|	СделкаРасходы.ГруппаУслуг > 0 
	//Евросиб - АСуслов 06.09.2022 13:05:31 #
	//(
	|	И ВЫБОР КОГДА СделкаРасходы.УслугаОтключена ТОГДА СделкаРасходы.УслугаОтключенаУсловно ИНАЧЕ ИСТИНА КОНЕЦ
	//)
	//Евросиб - АСуслов 06.09.2022 13:05:32 #
	|  
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтрокаСвязьУчетныхЕдиниц,
	|	ГруппаУслуг,
	|	ВидУслуги,
	|	УчДокумент";
	Запрос.УстановитьПараметр("Расходы", Сделка.Расходы.Выгрузить());
	Запрос.УстановитьПараметр("СвязьУчетныхЕдиниц", Сделка.СвязьУчетныхЕдиниц.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();                            
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("СтрокаСвязьУчетныхЕдиниц") Цикл
		Пока Выборка.СледующийПоЗначениюПоля("ГруппаУслуг") Цикл
			Пока Выборка.СледующийПоЗначениюПоля("ВидУслуги") Цикл
				ПерваяСтрока = Истина;
				Пока Выборка.СледующийПоЗначениюПоля("УчДокумент") Цикл
					СтрокаРасход = Сделка.Расходы.Найти(Выборка.ГУИД);
					СтрокаРасход.УслугаОтключена = НЕ ПерваяСтрока ИЛИ НЕ Выборка.Включить;
					//Евросиб - АСуслов 06.09.2022 13:06:55 #
					//(
					СтрокаРасход.УслугаОтключенаУсловно = СтрокаРасход.УслугаОтключена;
					//)
					//Евросиб - АСуслов 06.09.2022 13:06:55 #
					//Евросиб - АСуслов 27.11.2022 13:23:53 #62636
					//дубли строк
					//(
					//СтрокаРасход.ОсновнаяУслугаГруппы = ПерваяСтрока И Выборка.Включить;
					//)
					//Евросиб - АСуслов 27.11.2022 13:23:55 #62636
					ПерваяСтрока = Ложь;
				КонецЦикла;
			КонецЦикла;	
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтключитьДублиВагонныхУслуг_СтарыйАлгоритм(Сделка, МассивПТУДляОтвязки)
	Расходы = Сделка.Расходы;
	ДоходыВагоны = Сделка.ДоходыВагоны;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СделкаРасходы.НомерСтроки КАК НомерСтроки,
	|	СделкаРасходы.Вагон КАК Вагон,
	|	СделкаРасходы.Контейнер КАК Контейнер,
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	|	СделкаРасходы.ГУИД КАК ГУИД,
	|	СделкаРасходы.ГруппаУслуг КАК ГруппаУслуг,
	|	ВЫРАЗИТЬ(СделкаРасходы.Услуга КАК Справочник.Номенклатура) КАК Услуга,
	|	СделкаРасходы.УчДокумент КАК УчДокумент,
	|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики
	|ПОМЕСТИТЬ ВТ_Расходы
	|ИЗ
	|	&ТЧРасходы КАК СделкаРасходы 
	|ГДЕ СделкаРасходы.УслугаОтключена = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	СделкаДоходыВагоны.ГУИД КАК ГУИД,
	//|	СделкаДоходыВагоны.Вагон КАК Вагон
	//|ПОМЕСТИТЬ ВТ_ДоходыВагоны
	//|ИЗ
	//|	&ТЧДоходыВагоны КАК СделкаДоходыВагоны
	//|;
	//|
	|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	////|	ПОДСТРОКА(СделкаДоходыВагоны.Вагон, 1, 8) КАК Вагон,
	//|	СделкаРасходы.Вагон КАК Вагон,
	//|	МИНИМУМ(СделкаРасходы.СтрокаСвязьУчетныхЕдиниц) КАК СтрокаСвязьУчетныхЕдиниц,
	//|	СУММА(1) КАК Поле1
	//|ПОМЕСТИТЬ ВТ
	//|ИЗ
	//|	ВТ_Расходы КАК СделкаРасходы
	////|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоходыВагоны КАК СделкаДоходыВагоны
	////|		ПО СделкаРасходы.ГУИД = СделкаДоходыВагоны.ГУИД
	//|ГДЕ
	//|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики В(&ИсточникПоявленияСтрокиЭкономики)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики,
	////|	ПОДСТРОКА(СделкаДоходыВагоны.Вагон, 1, 8)
	//|	СделкаРасходы.Вагон
	//|
	//|ИМЕЮЩИЕ
	//|	СУММА(1) > 1
	//|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	|	СделкаРасходы.Вагон КАК Вагон,
	|	СделкаРасходы.Контейнер КАК Контейнер,
	//|	ПОДСТРОКА(СделкаДоходыВагоны.Вагон, 1, 8) КАК Вагон,
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	|	1 КАК Поле1,
	|	СделкаРасходы.ГУИД КАК ГУИД,
	|	ВЫБОР
	|		КОГДА СделкаРасходы.УчДокумент = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ЕстьУчДокумент,
	|	СделкаРасходы.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_Полный
	|ИЗ
	|	ВТ_Расходы КАК СделкаРасходы
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоходыВагоны КАК СделкаДоходыВагоны
	//|		ПО СделкаРасходы.ГУИД = СделкаДоходыВагоны.ГУИД
	|ГДЕ
	|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики В(&ИсточникПоявленияСтрокиЭкономики)
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики,
	|	СделкаРасходы.Вагон,
	|	СделкаРасходы.Контейнер,
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц,
	|	1,
	|	СделкаРасходы.ГУИД,
	|	ВЫБОР
	|		КОГДА СделкаРасходы.УчДокумент = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	СделкаРасходы.НомерСтроки
	|ИЗ
	|	ВТ_Расходы КАК СделкаРасходы
	|ГДЕ
	|	СделкаРасходы.ГруппаУслуг > 0
	|И СделкаРасходы.Услуга.УслугаРасходовВыбираетсяПриУсловии = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Полный.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	|	ВТ_Полный.Вагон КАК Вагон,
	|	ВТ_Полный.Контейнер КАК Контейнер,
	|	ВТ_Полный.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	|	ВТ_Полный.Поле1 КАК Поле1,
	|	ВТ_Полный.ГУИД КАК ГУИД,
	|	ВТ_Полный.ЕстьУчДокумент КАК ЕстьУчДокумент,
	|	ВТ_Полный.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ВТ_Полный КАК ВТ_Полный
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИсточникПоявленияСтрокиЭкономики,
	|	Вагон,
	|	Контейнер,
	|	ЕстьУчДокумент УБЫВ,
	|	НомерСтроки";
	МассивИсточниковВагонныхЖДН = Новый Массив;
	МассивИсточниковВагонныхЖДН.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДНПодсылаВагонов);
	МассивИсточниковВагонныхЖДН.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ПорожняяЖДН);
	МассивИсточниковВагонныхЖДН.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДНВозврата);
	МассивИсточниковВагонныхЖДН.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДНПерестановкиВагонов);
	Запрос.УстановитьПараметр("ИсточникПоявленияСтрокиЭкономики", МассивИсточниковВагонныхЖДН);
	Запрос.УстановитьПараметр("ТЧРасходы", Расходы.Выгрузить());
	Запрос.УстановитьПараметр("ТЧДоходыВагоны", ДоходыВагоны.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаУслуги = РезультатЗапроса.Выбрать();
	Пока ВыборкаУслуги.СледующийПоЗначениюПоля("ИсточникПоявленияСтрокиЭкономики") Цикл
		Пока ВыборкаУслуги.СледующийПоЗначениюПоля("Вагон") Цикл
			ПерваяСтрока = Истина;
			Контейнер = ВыборкаУслуги.Контейнер;
			СуммаПоВагону = 0;
			СуммаНДСПоВагону = 0;
			Пока ВыборкаУслуги.СледующийПоЗначениюПоля("ГУИД") Цикл    
				СтрокаРасход = Расходы.Найти(ВыборкаУслуги.ГУИД, "ГУИД");
				Если ВыборкаУслуги.Контейнер = Контейнер Тогда
					СтрокаРасход.УслугаОтключена = Ложь;
					СтрокаРасход.Контейнер = Справочники.ТЕ.ПустаяСсылка();
					СуммаПоВагону = СуммаПоВагону + СтрокаРасход.СуммаИтого;
					СуммаНДСПоВагону = СуммаНДСПоВагону + СтрокаРасход.СуммаНДС;
					ВключеннаяСтрокаРасход = СтрокаРасход;
					ПерваяСтрока = Ложь;
				Иначе
					СтрокаРасход.УслугаОтключена = Истина;
					Если ЗначениеЗаполнено(СтрокаРасход.УчДокумент) Тогда
						Если МассивПТУДляОтвязки.Найти(СтрокаРасход.УчДокумент) = Неопределено Тогда
							МассивПТУДляОтвязки.Добавить(СтрокаРасход.УчДокумент);
						КонецЕсли; 
					КонецЕсли; 
				КонецЕсли; 
			КонецЦикла;
			ВключеннаяСтрокаРасход.СуммаИтого = СуммаПоВагону;
			ВключеннаяСтрокаРасход.СуммаНДС = СуммаНДСПоВагону;
		КонецЦикла; 
	КонецЦикла; 
	//Пока ВыборкаУслуги.Следующий() Цикл
	//	ВыборкаНакладные = ВыборкаУслуги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//	
	//ВыборкаНакладные = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"НакладнаяПослеГруженогоПлеча");
	//Пока ВыборкаНакладные.Следующий() Цикл
	//	ВыборкаДетали = ВыборкаНакладные.Выбрать(ОбходРезультатаЗапроса.Прямой,"", "ВСЕ");
	//	ПерваяСтрока = Истина;
	//	Пока ВыборкаДетали.Следующий() Цикл
	//		СтрокаРасход = Расходы.Найти(ВыборкаДетали.ГУИД, "ГУИД");
	//		Если ПерваяСтрока Тогда
	//			СтрокаРасход.УслугаОтключена = Ложь;
	//			ПерваяСтрока = Ложь;
	//		Иначе
	//			СтрокаРасход.УслугаОтключена = Истина;
	//		КонецЕсли; 
	//	КонецЦикла; 
	//КонецЦикла; 
	
	
КонецПроцедуры

Процедура ОтключитьДублиВагонныхУслуг(Сделка, МассивПТУДляОтвязки)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СделкаРасходы.НомерСтроки КАК НомерСтроки,
	|	СделкаРасходы.Вагон КАК Вагон,
	|	СделкаРасходы.Контейнер КАК Контейнер,
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	|	СделкаРасходы.ГУИД КАК ГУИД,
	|	СделкаРасходы.ГруппаУслуг КАК ГруппаУслуг,
	|	ВЫРАЗИТЬ(СделкаРасходы.Услуга КАК Справочник.Номенклатура) КАК Услуга,
	|	СделкаРасходы.УчДокумент КАК УчДокумент,
	|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики
	|ПОМЕСТИТЬ ВТ_Расходы
	|ИЗ
	|	&ТЧРасходы КАК СделкаРасходы 
	|ГДЕ СделкаРасходы.УслугаОтключена = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	СделкаДоходыВагоны.ГУИД КАК ГУИД,
	//|	СделкаДоходыВагоны.Вагон КАК Вагон
	//|ПОМЕСТИТЬ ВТ_ДоходыВагоны
	//|ИЗ
	//|	&ТЧДоходыВагоны КАК СделкаДоходыВагоны
	//|;
	//|
	|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	////|	ПОДСТРОКА(СделкаДоходыВагоны.Вагон, 1, 8) КАК Вагон,
	//|	СделкаРасходы.Вагон КАК Вагон,
	//|	МИНИМУМ(СделкаРасходы.СтрокаСвязьУчетныхЕдиниц) КАК СтрокаСвязьУчетныхЕдиниц,
	//|	СУММА(1) КАК Поле1
	//|ПОМЕСТИТЬ ВТ
	//|ИЗ
	//|	ВТ_Расходы КАК СделкаРасходы
	////|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоходыВагоны КАК СделкаДоходыВагоны
	////|		ПО СделкаРасходы.ГУИД = СделкаДоходыВагоны.ГУИД
	//|ГДЕ
	//|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики В(&ИсточникПоявленияСтрокиЭкономики)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики,
	////|	ПОДСТРОКА(СделкаДоходыВагоны.Вагон, 1, 8)
	//|	СделкаРасходы.Вагон
	//|
	//|ИМЕЮЩИЕ
	//|	СУММА(1) > 1
	//|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	|	СделкаРасходы.Вагон КАК Вагон,
	|	СделкаРасходы.Контейнер КАК Контейнер,
	//|	ПОДСТРОКА(СделкаДоходыВагоны.Вагон, 1, 8) КАК Вагон,
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	|	1 КАК Поле1,
	|	СделкаРасходы.ГУИД КАК ГУИД,
	|	ВЫБОР
	|		КОГДА СделкаРасходы.УчДокумент = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ЕстьУчДокумент,
	|	СделкаРасходы.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_Полный
	|ИЗ
	|	ВТ_Расходы КАК СделкаРасходы
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоходыВагоны КАК СделкаДоходыВагоны
	//|		ПО СделкаРасходы.ГУИД = СделкаДоходыВагоны.ГУИД
	|ГДЕ
	//|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики В(&ИсточникПоявленияСтрокиЭкономики)
	|	СделкаРасходы.ВидЖДН В(&ВидыЖДН)
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики,
	|	СделкаРасходы.Вагон,
	|	СделкаРасходы.Контейнер,
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц,
	|	1,
	|	СделкаРасходы.ГУИД,
	|	ВЫБОР
	|		КОГДА СделкаРасходы.УчДокумент = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	СделкаРасходы.НомерСтроки
	|ИЗ
	|	ВТ_Расходы КАК СделкаРасходы
	|ГДЕ
	|	СделкаРасходы.ГруппаУслуг > 0
	|И СделкаРасходы.Услуга.УслугаРасходовВыбираетсяПриУсловии = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Полный.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	|	ВТ_Полный.Вагон КАК Вагон,
	|	ВТ_Полный.Контейнер КАК Контейнер,
	|	ВТ_Полный.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	|	ВТ_Полный.Поле1 КАК Поле1,
	|	ВТ_Полный.ГУИД КАК ГУИД,
	|	ВТ_Полный.ЕстьУчДокумент КАК ЕстьУчДокумент,
	|	ВТ_Полный.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ВТ_Полный КАК ВТ_Полный
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИсточникПоявленияСтрокиЭкономики,
	|	Вагон,
	|	Контейнер,
	|	ЕстьУчДокумент УБЫВ,
	|	НомерСтроки";
	МассивИсточниковВагонныхЖДН = Новый Массив;
	МассивИсточниковВагонныхЖДН.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДНПодсылаВагонов);
	МассивИсточниковВагонныхЖДН.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ПорожняяЖДН);
	МассивИсточниковВагонныхЖДН.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДНВозврата);
	МассивИсточниковВагонныхЖДН.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДНПерестановкиВагонов);
	Запрос.УстановитьПараметр("ИсточникПоявленияСтрокиЭкономики", МассивИсточниковВагонныхЖДН);
	Запрос.УстановитьПараметр("ТЧРасходы", Сделка.Расходы.Выгрузить());
	Запрос.УстановитьПараметр("ТЧДоходыВагоны", Сделка.ДоходыВагоны.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаУслуги = РезультатЗапроса.Выбрать();
	Пока ВыборкаУслуги.СледующийПоЗначениюПоля("ИсточникПоявленияСтрокиЭкономики") Цикл
		Пока ВыборкаУслуги.СледующийПоЗначениюПоля("Вагон") Цикл
			ПерваяСтрока = Истина;
			Контейнер = ВыборкаУслуги.Контейнер;
			СуммаПоВагону = 0;
			СуммаНДСПоВагону = 0;
			Пока ВыборкаУслуги.СледующийПоЗначениюПоля("ГУИД") Цикл    
				СтрокаРасход = Сделка.Расходы.Найти(ВыборкаУслуги.ГУИД, "ГУИД");
				Если ВыборкаУслуги.Контейнер = Контейнер Тогда
					СтрокаРасход.УслугаОтключена = Ложь;
					СтрокаРасход.Контейнер = Справочники.ТЕ.ПустаяСсылка();
					СуммаПоВагону = СуммаПоВагону + СтрокаРасход.СуммаИтого;
					СуммаНДСПоВагону = СуммаНДСПоВагону + СтрокаРасход.СуммаНДС;
					ВключеннаяСтрокаРасход = СтрокаРасход;
					ПерваяСтрока = Ложь;
				Иначе
					СтрокаРасход.УслугаОтключена = Истина;
					Если ЗначениеЗаполнено(СтрокаРасход.УчДокумент) Тогда
						Если МассивПТУДляОтвязки.Найти(СтрокаРасход.УчДокумент) = Неопределено Тогда
							МассивПТУДляОтвязки.Добавить(СтрокаРасход.УчДокумент);
						КонецЕсли; 
					КонецЕсли; 
				КонецЕсли; 
			КонецЦикла;
			ВключеннаяСтрокаРасход.СуммаИтого = СуммаПоВагону;
			ВключеннаяСтрокаРасход.СуммаНДС = СуммаНДСПоВагону;
		КонецЦикла; 
	КонецЦикла; 
	//Пока ВыборкаУслуги.Следующий() Цикл
	//	ВыборкаНакладные = ВыборкаУслуги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//	
	//ВыборкаНакладные = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"НакладнаяПослеГруженогоПлеча");
	//Пока ВыборкаНакладные.Следующий() Цикл
	//	ВыборкаДетали = ВыборкаНакладные.Выбрать(ОбходРезультатаЗапроса.Прямой,"", "ВСЕ");
	//	ПерваяСтрока = Истина;
	//	Пока ВыборкаДетали.Следующий() Цикл
	//		СтрокаРасход = Расходы.Найти(ВыборкаДетали.ГУИД, "ГУИД");
	//		Если ПерваяСтрока Тогда
	//			СтрокаРасход.УслугаОтключена = Ложь;
	//			ПерваяСтрока = Ложь;
	//		Иначе
	//			СтрокаРасход.УслугаОтключена = Истина;
	//		КонецЕсли; 
	//	КонецЦикла; 
	//КонецЦикла; 
	
	
КонецПроцедуры

Процедура ДополнитьПомеченныеРасходыПлановойЦенойИзЖДН(Сделка)
	
	Для каждого Стр из Сделка.Расходы Цикл
		
		МассивИсточников = Новый Массив;
		МассивИсточников.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДНПодсылаВагонов);
		МассивИсточников.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДНПодсылаКТК);
		МассивИсточников.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ПорожняяЖДН);
		МассивИсточников.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДНВозврата);
		МассивИсточников.Добавить(Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДНПерестановкиВагонов);
		Если Стр.ПлановаяСтоимостьИзЖДН = Истина 
			И МассивИсточников.Найти(Стр.ИсточникПоявленияСтрокиЭкономики) = Неопределено Тогда
			
			СтрокаСУЕ = Сделка.СвязьУчетныхЕдиниц.Найти(Стр.СтрокаСвязьУчетныхЕдиниц,"ГУИД");
			Если СтрокаСУЕ <> Неопределено И ЗначениеЗаполнено(СтрокаСУЕ.ЖДН) Тогда
				Стр.Себестоимость = РаботаСоСделкамиСервер.ПолучитьСуммуНакладнойПоПараметрам(
											ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаСУЕ.ЖДН,"НакладнаяЭТРАН"),
											СтрокаСУЕ.Вагон,
											СтрокаСУЕ.Контейнер);
				Стр.СебестоимостьИтого		= Стр.Себестоимость * Стр.Количество;
				Стр.СуммаНДС 				= БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Стр.СебестоимостьИтого, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Стр.СтавкаНДС), Истина, Стр.НДСВключенВСтоимость);
				Стр.СуммаИтого 				= Стр.СебестоимостьИтого + ?(Стр.НДСВключенВСтоимость, 0, Стр.СуммаНДС);

			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ИзменитьДанныеРасходовПоДоходам(Сделка) Экспорт
	
	
    //Евросиб - АСуслов 25.08.2022 14:06:15 #56348
	//(
	//Евросиб Каблов 23.12.2025 ( #126470
	//Если НЕ Сделка.ДополнительныеСвойства.Свойство("ЗаписьИзАкцепта") Тогда
	//	Возврат;
	//КонецЕсли;
	МенятьПризнакНеВыставлятьКлиенту = Сделка.ДополнительныеСвойства.Свойство("ЗаписьИзАкцепта");
	//Евросиб Каблов 23.12.2025 ) #126470
	//)
	//Евросиб - АСуслов 25.08.2022 14:06:18 #56348
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаРасходы.Перевыставляемая КАК Перевыставляемая,
	|	СделкаРасходы.ГУИД КАК ГУИД,
	|	СделкаРасходы.Услуга КАК Услуга,
	|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	|	СделкаРасходы.НеВключатьВПлановыеРасходы КАК НеВключатьВПлановыеРасходы,
	|	СделкаРасходы.УчДокумент КАК УчДокумент,
	//Евросиб Каблов 23.12.2025 ( #126470
	|	СделкаРасходы.СтавкаНДС КАК СтавкаНДС,
	//Евросиб Каблов 23.12.2025 ) #126470
	|	СделкаРасходы.УслугаОтключена КАК УслугаОтключена
	|ПОМЕСТИТЬ ВТ_Расходы
	|ИЗ
	|	Документ.Сделка.Расходы КАК СделкаРасходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаДоходы.ГУИД КАК ГУИД,
	|	СделкаДоходы.Перевыставляемая КАК Перевыставляемая,
	|	СделкаДоходы.УчДокумент КАК УчДокумент,
	|	СделкаДоходы.УслугаВнеСтавки КАК УслугаВнеСтавки,
	|	СделкаДоходы.НеВыставлятьКлиенту КАК НеВыставлятьКлиенту,
	//Евросиб Каблов 23.12.2025 ( #126470
	|	СделкаДоходы.СтавкаНДС КАК СтавкаНДС,
	//Евросиб Каблов 23.12.2025 ) #126470
	//Евросиб - АСуслов 24.08.2022 10:15:46 #56348
	//(
	|   СделкаДоходы.ВыставитьПринудительно КАК ВыставитьПринудительно
	//)
	//Евросиб - АСуслов 24.08.2022 10:15:55 #56348
	
	|ПОМЕСТИТЬ ВТ_Доходы
	|ИЗ
	|	Документ.Сделка.Доходы КАК СделкаДоходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаСвязьДоходовИРасходов.Доходы КАК Доходы,
	|	СделкаСвязьДоходовИРасходов.Расходы КАК Расходы,
	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
	|	СделкаСвязьДоходовИРасходов.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_СвязьДоходовИРасходов
	|ИЗ
	|	Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаДоходы.Перевыставляемая КАК Перевыставляемая,
	|	СделкаРасходы.Перевыставляемая КАК ПеревыставляемаяРасход,
	|	ВЫБОР
	|		КОГДА СделкаРасходы.УчДокумент = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК УчДокументРасходовЗаполнен,
	|	СделкаСвязьДоходовИРасходов.Доходы КАК Доходы,
	|	СделкаДоходы.НеВыставлятьКлиенту КАК НеВыставлятьКлиенту,
	|   СделкаДоходы.УслугаВнеСтавки КАК УслугаВнеСтавки,
	//Евросиб - АСуслов 24.08.2022 10:15:46 #56348
	//(
	|   СделкаДоходы.ВыставитьПринудительно КАК ВыставитьПринудительно,
	//)
	//Евросиб - АСуслов 24.08.2022 10:15:55 #56348
	|	СделкаРасходы.УслугаОтключена КАК УслугаОтключена,
	//Евросиб Каблов 23.12.2025 ( #126470
	|	СделкаДоходы.СтавкаНДС КАК ДоходыСтавкаНДС,
	|	СделкаРасходы.СтавкаНДС КАК РасходыСтавкаНДС,
	//Евросиб Каблов 23.12.2025 ) #126470
	|	СделкаРасходы.ГУИД КАК Расходы
	|ИЗ
	|	ВТ_Расходы КАК СделкаРасходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Доходы КАК СделкаДоходы
	|			ПО СделкаСвязьДоходовИРасходов.Доходы = СделкаДоходы.ГУИД
	|		ПО СделкаРасходы.ГУИД = СделкаСвязьДоходовИРасходов.Расходы
	//|			И СделкаРасходы.Услуга = СделкаСвязьДоходовИРасходов.Услуга
	//|			И (НЕ СделкаСвязьДоходовИРасходов.Услуга = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|ГДЕ
	|	(ВЫБОР
	//Евросиб Каблов 23.12.2025 ( #126470
	|				КОГДА СделкаРасходы.УчДокумент = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
	|  					И (СделкаДоходы.СтавкаНДС = &СтавкаНДС20 И СделкаРасходы.СтавкаНДС = &СтавкаНДС22
	|						ИЛИ СделкаДоходы.СтавкаНДС = &СтавкаНДС22 И СделкаРасходы.СтавкаНДС = &СтавкаНДС20)
	|					ТОГДА Истина
	//Евросиб Каблов 23.12.2025 ) #126470
	|				КОГДА НЕ СделкаРасходы.УчДокумент = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
	//Евросиб - АСуслов 26.01.2022 12:50:58 #0258392
	//(
	//|  						И СделкаРасходы.Перевыставляемая
	|  						И СделкаДоходы.УслугаВнеСтавки
	//Евросиб Каблов 23.12.2025 ( #126470
	|						И &МенятьПризнакНеВыставлятьКлиенту
	//Евросиб Каблов 23.12.2025 ) #126470
	|  						
	//Евросиб - АСуслов 27.01.2022 9:30:31 #
	//(
	|  						
	//)
	//Евросиб - АСуслов 27.01.2022 9:30:32 #
	//)
	//Евросиб - АСуслов 26.01.2022 12:50:59 #0258932
	|					ТОГДА СделкаДоходы.НеВыставлятьКлиенту = Истина
	//|				ИНАЧЕ СделкаРасходы.Перевыставляемая <> СделкаДоходы.Перевыставляемая
	|				КОГДА СделкаРасходы.УчДокумент = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
	|  					И СделкаДоходы.УслугаВнеСтавки
	//Евросиб Каблов 23.12.2025 ( #126470
	|					И &МенятьПризнакНеВыставлятьКлиенту
	//Евросиб Каблов 23.12.2025 ) #126470
	|  					ТОГДА СделкаДоходы.НеВыставлятьКлиенту = Ложь
	|			КОНЕЦ)
	//|			ИЛИ СделкаРасходы.Перевыставляемая <> СделкаДоходы.Перевыставляемая)
	|	И НЕ СделкаДоходы.ГУИД ЕСТЬ NULL
	|	И НЕ СделкаДоходы.ГУИД = """"";     
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.Доходы", "&ТЧДоходы");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.Расходы", "&ТЧРасходы");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.СвязьДоходовИРасходов", "&ТЧСвязьДоходовИРасходов");
	
	//Евросиб Каблов 23.12.2025 ( #126470
	СтавкаНДС20 = Перечисления.СтавкиНДС.НДС20;
	СтавкаНДС22 = Перечисления.СтавкиНДС.НДС22;
	Запрос.УстановитьПараметр("СтавкаНДС20", СтавкаНДС20);
	Запрос.УстановитьПараметр("СтавкаНДС22", СтавкаНДС22);
	Запрос.УстановитьПараметр("МенятьПризнакНеВыставлятьКлиенту", МенятьПризнакНеВыставлятьКлиенту);
	//Евросиб Каблов 23.12.2025 ) #126470
	
	Запрос.УстановитьПараметр("ТЧРасходы", Сделка.Расходы.Выгрузить());
	Запрос.УстановитьПараметр("ТЧДоходы", Сделка.Доходы.Выгрузить());
	Запрос.УстановитьПараметр("ТЧСвязьДоходовИРасходов", Сделка.СвязьДоходовИРасходов.Выгрузить());
	Запрос.УстановитьПараметр("НеВключатьВПлановыеРасходы", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		//в доходной части сделки снимем галку <Не выставлять клиенту> и установим признак <Готово к выставлению>
		//Для каждого СтрокаДоход Из Доходы.НайтиСтроки(Новый Структура("ГУИД", Выборка.Доходы)) Цикл
		//	//СтрокаДоход.НеВыставлятьКлиенту = Выборка.НеВключатьВПлановыеРасходы ИЛИ Выборка.УслугаОтключена;
		//ДИТ, Беляев СЮ, Ticket#0254869, 12-01-2022, ++ 
		//НеВыставлятьКлиентуДляУстановки = Выборка.НеВключатьВПлановыеРасходы ИЛИ Выборка.УслугаОтключена; 
		//в доходах "НеВыставлятьКлиенту" меняем если только Уч.Документ не заполнен, а также сброс галки в любом случае
		//Если НЕ ЗначениеЗаполнено(СтрокаДоход.УчДокумент) ИЛИ НеВыставлятьКлиентуДляУстановки = Ложь Тогда
		//	СтрокаДоход.НеВыставлятьКлиенту = НеВыставлятьКлиентуДляУстановки;
		//КонецЕсли;                               
		//ДИТ, Беляев СЮ, Ticket#0254869, 12-01-2022, --
		//	Если Выборка.Перевыставляемая Тогда
		//		СтрокаДоход.ГотовоКВыставлению = НЕ Выборка.НеВключатьВПлановыеРасходы;
		//		СтрокаДоход.Перевыставляемая = Выборка.Перевыставляемая;
		//	КонецЕсли; 
		//КонецЦикла;
		
		//Евросиб Каблов 23.12.2025 ( #126470
		Если МенятьПризнакНеВыставлятьКлиенту Тогда
		//Евросиб Каблов 23.12.2025 ) #126470
		Для каждого СтрокаДоход Из Сделка.Доходы.НайтиСтроки(Новый Структура("ГУИД", Выборка.Доходы)) Цикл
			//НеВыставлятьКлиентуДляУстановки = НЕ Выборка.УчДокументРасходовЗаполнен ИЛИ Выборка.УслугаОтключена; 
			//НеВыставлятьКлиентуДляУстановки = НЕ (Выборка.УчДокументРасходовЗаполнен И Выборка.ПеревыставляемаяРасход);
			НеВыставлятьКлиентуДляУстановки = НЕ (Выборка.УчДокументРасходовЗаполнен И Выборка.УслугаВнеСтавки);
			//в доходах "НеВыставлятьКлиенту" меняем если только Уч.Документ не заполнен, а также сброс галки в любом случае
			//Евросиб - АСуслов 28.07.2022 15:05:17 #55052
			//(
			//снимаем галку если учдок отвязали
			//Если НЕ ЗначениеЗаполнено(СтрокаДоход.УчДокумент) И НеВыставлятьКлиентуДляУстановки = Ложь Тогда
			Если НЕ ЗначениеЗаполнено(СтрокаДоход.УчДокумент)
				//Евросиб Каблов 03.06.2024 ( Ticket#0354087
				И Не (НеВыставлятьКлиентуДляУстановки И СтрокаДоход.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.АРМСверхнормативы
				//Евросиб Каблов 03.06.2024 )
				// Евросиб US 91362 TA 104075 Рыбьяков К.А. 02.06.2025 ((
				ИЛИ СтрокаДоход.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.АРМДополнительныеРасходы)
				// Евросиб Рыбьяков К.А. 02.06.2025 ))
				Тогда
				////Евросиб - АСуслов 24.08.2022 10:14:54 #56348
				////(
				//И НЕ СтрокаДоход.ВыставитьПринудительно Тогда
				////)
				////Евросиб - АСуслов 24.08.2022 10:15:02 #56348
				СтрокаДоход.НеВыставлятьКлиенту = НеВыставлятьКлиентуДляУстановки;
			КонецЕсли;
			СтрокаДоход.ГотовоКВыставлению = Не СтрокаДоход.НеВыставлятьКлиенту;
			//)
			//Евросиб - АСуслов 28.07.2022 12:11:08 #55052
		КонецЦикла;
		//Евросиб Каблов 23.12.2025 ( #126470
		КонецЕсли;
		//Евросиб Каблов 23.12.2025 ) #126470
		Для каждого СтрокаРасход Из Сделка.Расходы.НайтиСтроки(Новый Структура("ГУИД", Выборка.Расходы)) Цикл
			//Евросиб Каблов 23.12.2025 ( #126470
			//СтрокаРасход.Перевыставляемая = Выборка.Перевыставляемая;
			Если МенятьПризнакНеВыставлятьКлиенту Тогда
				СтрокаРасход.Перевыставляемая = Выборка.Перевыставляемая;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаРасход.УчДокумент) Тогда
				Если (Выборка.ДоходыСтавкаНДС = СтавкаНДС20 И СтрокаРасход.СтавкаНДС = СтавкаНДС22)
						Или (Выборка.ДоходыСтавкаНДС = СтавкаНДС22 И СтрокаРасход.СтавкаНДС = СтавкаНДС20) Тогда
						
					СтрокаРасход.СтавкаНДС = Выборка.ДоходыСтавкаНДС;					
					СтрокаРасход.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СтрокаРасход.СебестоимостьИтого, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СтрокаРасход.СтавкаНДС), Истина, СтрокаРасход.НДСВключенВСтоимость);
					СтрокаРасход.СуммаИтого = СтрокаРасход.СебестоимостьИтого + ?(СтрокаРасход.НДСВключенВСтоимость, 0, СтрокаРасход.СуммаНДС);
						
				КонецЕсли;
			КонецЕсли;
			//Евросиб Каблов 23.12.2025 ) #126470
		КонецЦикла;
	КонецЦикла; 
	
	//найдем все перевыставляемые и заполним доходные суммы
	ЗаполнитьСуммыДоходовПоПеревыставляемымРасходам(Сделка);
	
	//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 90886, 10-09-2024, начало
	Документы.Сделка.ОбъединитьCтрокиДоходовВРдляВыставления(Сделка);
	//Евросиб(ДИТ), Беляев СЮ, US 88163/TA 90886, 10-09-2024, конец
КонецПроцедуры

Процедура ЗаполнитьСуммыДоходовПоПеревыставляемымРасходам(Сделка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Ссылка КАК Ссылка,
	|	СделкаРасходы.ГУИД КАК ГУИД,
	|	СделкаРасходы.Услуга КАК Услуга,
	|	СделкаРасходы.Количество КАК Количество,
	|	СделкаРасходы.СуммаНДС КАК СуммаНДС,
	|   СделкаРасходы.УчДокумент КАК УчДокумент,
	|	СделкаРасходы.СтавкаНДС КАК СтавкаНДС,
	|	СделкаРасходы.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	|	СделкаРасходы.НеВключатьВПлановыеРасходы КАК НеВключатьВПлановыеРасходы,
	|	СделкаРасходы.Перевыставляемая КАК Перевыставляемая
	|ПОМЕСТИТЬ ВремТЧ
	|ИЗ
	|	Документ.Сделка.Расходы КАК СделкаРасходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Ссылка КАК Ссылка,
	|	ТЧСвязьДоходовИРасходов.НомерСтроки КАК НомерСтроки,
	|	ТЧСвязьДоходовИРасходов.Доходы КАК Доходы,
	|	ТЧСвязьДоходовИРасходов.Расходы КАК Расходы,
	|	ТЧСвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
	|	ТЧСвязьДоходовИРасходов.Услуга КАК Услуга
	|ПОМЕСТИТЬ Врем_СУЕ
	|ИЗ
	|	Документ.Сделка.СвязьДоходовИРасходов КАК ТЧСвязьДоходовИРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(СделкаРасходы.Количество) КАК Количество,
	|	Врем_СУЕ.Доходы КАК Доходы,
	//Евросиб - АСуслов 17.08.2022 17:26:31 #55129
	//(
	//|	СУММА(РазнесениеЗатратПТУОстатки.РазнесеннаяОстаток) КАК РазнесеннаяОстаток,
	//|	СУММА(ПоступлениеТоваровУслугУслуги.Сумма) КАК ПТУ_Сумма1,
	//|	СУММА(ПоступлениеТоваровУслугУслуги.СуммаНДС) КАК ПТУ_СуммаНДС1,
	//|	СУММА(ПоступлениеТоваровУслугУслуги.Всего) КАК ПТУ_Всего1,
	//|	СУММА(ПоступлениеТоваровУслугУслуги.Цена) КАК ПТУ_Цена1,
	//)
	//Евросиб - АСуслов 17.08.2022 17:26:31 #
	//Евросиб - АСуслов 06.12.2023 12:48:59 #78322
	//(
	//|	ВЫБОР
	//|		КОГДА СделкаРасходы.УчДокумент.НДСВключенВСтоимость
	//|			ТОГДА АкцептУслуги.ПоступлениеСумма
	//|		ИНАЧЕ АкцептУслуги.ПоступлениеСумма + АкцептУслуги.ПоступлениеСуммаНДС
	//|	КОНЕЦ КАК ПТУ_Всего,
	//)
	//Евросиб - АСуслов 06.12.2023 12:49:01 #78322
	|	СделкаРасходы.Ссылка КАК Ссылка,
	|	СделкаРасходы.НеВключатьВПлановыеРасходы КАК НеВключатьВПлановыеРасходы,
	|   СделкаРасходы.УчДокумент КАК УчДокументРасходы,
	|	СделкаРасходы.СуммаНДС КАК СуммаНДС,
	|	СделкаРасходы.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	|	СделкаРасходы.СтавкаНДС КАК СтавкаНДС,
	|	АкцептУслуги.ПоступлениеЦена КАК ПТУ_Цена,
	|	АкцептУслуги.ПоступлениеСумма КАК ПТУ_Сумма,
	|	АкцептУслуги.ПоступлениеСуммаНДС КАК ПТУ_СуммаНДС,
	|	АкцептУслуги.ПоступлениеСтавкаНДС КАК ПТУ_СтавкаНДС
	|ПОМЕСТИТЬ ВТ_РасходыРазнесение
	|ИЗ
	|	ВремТЧ КАК СделкаРасходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Врем_СУЕ КАК Врем_СУЕ
	|		ПО СделкаРасходы.ГУИД = Врем_СУЕ.Расходы
	|			И СделкаРасходы.Услуга = Врем_СУЕ.Услуга
	//Евросиб - АСуслов 17.08.2022 17:24:49 #55129
	//(
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РазнесениеЗатратПТУ.Остатки КАК РазнесениеЗатратПТУОстатки
	//)
	//Евросиб - АСуслов 17.08.2022 17:24:50 #55129
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	//|			ПО РазнесениеЗатратПТУОстатки.ГУИДПТУ = ПоступлениеТоваровУслугУслуги.ГУИДПТУ
	//|		ПО СделкаРасходы.ГУИД = РазнесениеЗатратПТУОстатки.ГУИДРасходов
	//|			И СделкаРасходы.Ссылка = РазнесениеЗатратПТУОстатки.Сделка
	//)
	//Евросиб - АСуслов 17.08.2022 17:25:36 #55129
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Акцепт.Услуги КАК АкцептУслуги
	|		ПО СделкаРасходы.ГУИД = АкцептУслуги.ИдентификаторСтрокиРасходовВСделке
	|ГДЕ
	|	СделкаРасходы.Перевыставляемая
	|   И ЕСТЬNULL(АкцептУслуги.ПоступлениеСумма,0) > 0

	|СГРУППИРОВАТЬ ПО
	|	Врем_СУЕ.Доходы,
	|	СделкаРасходы.Ссылка,
	|	СделкаРасходы.НеВключатьВПлановыеРасходы,
	|   СделкаРасходы.УчДокумент,
	|   СделкаРасходы.УчДокумент.НДСВключенВСтоимость,
	|	СделкаРасходы.СуммаНДС,
	|	СделкаРасходы.НДСВключенВСтоимость,
	|	СделкаРасходы.СтавкаНДС,
	|	АкцептУслуги.ПоступлениеЦена,
	|	АкцептУслуги.ПоступлениеСумма,
	|	АкцептУслуги.ПоступлениеСуммаНДС,
	|	АкцептУслуги.ПоступлениеСтавкаНДС
	//Евросиб - АСуслов 17.08.2022 17:27:32 #55129
	//(
	//|	ВЫБОР
	//|		КОГДА ПоступлениеТоваровУслугУслуги.Ссылка.НДСВключенВСтоимость
	//|			ТОГДА АкцептУслуги.ПоступлениеСумма
	//|		ИНАЧЕ АкцептУслуги.ПоступлениеСумма + АкцептУслуги.ПоступлениеСуммаНДС
	//|	КОНЕЦ
	//)
	//Евросиб - АСуслов 17.08.2022 17:27:34 #55129
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаДоходы.ГУИД КАК ГУИД,
	|	СделкаДоходы.Количество КАК Количество
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
	|	,СделкаДоходы.ГУИДИсправляемойСтроки КАК ГУИДИсправляемойСтроки
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
	|ПОМЕСТИТЬ ВТ_Доходы
	|ИЗ
	|	Документ.Сделка.Доходы КАК СделкаДоходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РасходыРазнесение.Количество КАК Количество,
	|	ВТ_РасходыРазнесение.Доходы КАК Доходы,
	//Евросиб - АСуслов 17.08.2022 17:28:00 #55129
	//(
	//|	ВТ_РасходыРазнесение.РазнесеннаяОстаток КАК РазнесеннаяОстаток,
	//)
	//Евросиб - АСуслов 17.08.2022 17:28:00 #55129
	|	ВТ_РасходыРазнесение.ПТУ_Сумма КАК ПТУ_Сумма,
	|	ВТ_РасходыРазнесение.ПТУ_СуммаНДС КАК ПТУ_СуммаНДС,
	//|	ВТ_РасходыРазнесение.ПТУ_Всего КАК ПТУ_Всего,
	|	ВТ_РасходыРазнесение.ПТУ_Цена КАК ПТУ_Цена,
	//|	ВТ_РасходыРазнесение.НеВключатьВПлановыеРасходы КАК НеВыставлятьКлиенту,
	//|   ВЫБОР КОГДА ВТ_РасходыРазнесение.УчДокументРасходы = Значение(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка) ТОГДА ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ НеВыставлятьКлиенту,
	//|	НЕ ВТ_РасходыРазнесение.НеВключатьВПлановыеРасходы КАК ГотовоКВыставлению,
	|	ВЫБОР КОГДА НЕ ВТ_РасходыРазнесение.УчДокументРасходы = Значение(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ГотовоКВыставлению,
	|	ВТ_РасходыРазнесение.СуммаНДС КАК СуммаНДС,
	|	ВТ_РасходыРазнесение.СтавкаНДС КАК СтавкаНДС
	//|	ВТ_РасходыРазнесение.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	|ИЗ
	|	ВТ_РасходыРазнесение КАК ВТ_РасходыРазнесение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Доходы КАК СделкаДоходы
	|		ПО ВТ_РасходыРазнесение.Доходы = СделкаДоходы.ГУИД
	//|			И ВТ_РасходыРазнесение.Ссылка = СделкаДоходы.Ссылка
	|ГДЕ
	|	ВТ_РасходыРазнесение.Количество = ЕСТЬNULL(СделкаДоходы.Количество, 0)
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
	|	И ЕСТЬNULL(СделкаДоходы.ГУИДИсправляемойСтроки, """") = """" ";
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.Доходы", "&ТЧДоходы");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.Расходы", "&ВремТЧ");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.СвязьДоходовИРасходов", "&ТЧСвязьДоходовИРасходов");

	Запрос.УстановитьПараметр("Ссылка", Сделка.Ссылка);
	Запрос.УстановитьПараметр("ВремТЧ", Сделка.Расходы.Выгрузить());
	Запрос.УстановитьПараметр("ТЧСвязьДоходовИРасходов", Сделка.СвязьДоходовИРасходов.Выгрузить());
	Запрос.УстановитьПараметр("ТЧДоходы", Сделка.Доходы.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
 	ВыборкаДоходы = РезультатЗапроса.Выбрать();
	Пока ВыборкаДоходы.Следующий() Цикл
		СтрокаДоходы = Сделка.Доходы.Найти(ВыборкаДоходы.Доходы, "ГУИД");
		//СтрокаДоходы.НеВыставлятьКлиенту 	= ВыборкаДоходы.НеВыставлятьКлиенту;
		//ДИТ, Беляев СЮ, Ticket#0254869, 12-01-2022, ++           
		//в доходах "НеВыставлятьКлиенту" меняем если только Уч.Документ не заполнен, а также сброс галки в любом случае
		//Евросиб - АСуслов 28.01.2022 14:47:20 #
		//(
		//см. ИзменитьДанныеРасходовПоДоходам()
		//Если НЕ ЗначениеЗаполнено(СтрокаДоходы.УчДокумент) ИЛИ ВыборкаДоходы.НеВыставлятьКлиенту = Ложь Тогда
		//	СтрокаДоходы.НеВыставлятьКлиенту = ВыборкаДоходы.НеВыставлятьКлиенту;
		//КонецЕсли;                               
		//ДИТ, Беляев СЮ, Ticket#0254869, 12-01-2022, --
		//)
		//Евросиб - АСуслов 28.01.2022 14:47:21 #
		СтрокаДоходы.ГотовоКВыставлению 	= ВыборкаДоходы.ГотовоКВыставлению;
		//СтрокаДоходы.НДСВключенВСтоимость 	= ВыборкаДоходы.НДСВключенВСтоимость;
		СтрокаДоходы.НДСВключенВСтоимость 	= Истина;
		СтрокаДоходы.СтавкаНДС 				= ВыборкаДоходы.СтавкаНДС;
		
		СтрокаДоходы.Себестоимость 			= ВыборкаДоходы.ПТУ_Сумма / ВыборкаДоходы.Количество;
		СтрокаДоходы.Ставка 				= СтрокаДоходы.Себестоимость;
		СтрокаДоходы.СуммаНДС 				= ВыборкаДоходы.ПТУ_СуммаНДС;
		
		СтрокаДоходы.СебестоимостьИтого     = СтрокаДоходы.Себестоимость * ВыборкаДоходы.Количество;
		СтрокаДоходы.СтавкаИтого			= СтрокаДоходы.Ставка * ВыборкаДоходы.Количество;
		//СтрокаДоходы.СуммаИтого 			= ВыборкаДоходы.ПТУ_Всего;
		СтрокаДоходы.СуммаИтого 			= ВыборкаДоходы.ПТУ_Сумма;
		
		СтрокаДоходы.Вознаграждение 		= 0;
		//Если ВыборкаДоходы.НДСВключенВСтоимость Тогда
		//	//СтрокаДоходы.Ставка = СтрокаДоходы.СтавкаИтого / СтрокаДоходы.Количество;
		//	//СтрокаДоходы.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(СтрокаДоходы.Ставка, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СтрокаДоходы.СтавкаНДС), Истина, ВыборкаДоходы.НДСВключенВСтоимость);
		//	СтрокаДоходы.Ставка = ВыборкаДоходы.ПТУ_Сумма;
		//	СтрокаДоходы.СуммаНДС = ВыборкаДоходы.ПТУ_СуммаНДС;
		//	//Евросиб - АСуслов 17.11.2020 10:25:01 #
		//	//(
		//	//суммы вознаграждения по ндс включенному в стоимость считаем при создании КД
		//	//СтрокаДоходы.ВознаграждениеИтого = СтрокаДоходы.СтавкаИтого * СтрокаДоходы.ПроцентВознаграждения / 100;
		//	//СтрокаДоходы.Вознаграждение = СтрокаДоходы.ВознаграждениеИтого / СтрокаДоходы.Количество;
		//	//)
		//	//Евросиб - АСуслов 17.11.2020 10:25:02 #
		//Иначе
		//	СтрокаДоходы.Ставка = СтрокаДоходы.СтавкаИтого / СтрокаДоходы.Количество;
		//	СтрокаДоходы.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(СтрокаДоходы.Ставка, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СтрокаДоходы.СтавкаНДС), Истина, ВыборкаДоходы.НДСВключенВСтоимость);
		//	СтрокаДоходы.Ставка = СтрокаДоходы.Ставка - СтрокаДоходы.СуммаНДС;
		//	//СтрокаДоходы.Вознаграждение = СтрокаДоходы.Ставка * СтрокаДоходы.ПроцентВознаграждения / 100;
		//	//СтрокаДоходы.ВознаграждениеИтого = СтрокаДоходы.Вознаграждение * СтрокаДоходы.Количество;
		//КонецЕсли; 
		//это не то вознаграждение
		//СтрокаДоходы.ВознаграждениеИтого = СтрокаДоходы.СтавкаИтого * СтрокаДоходы.ПроцентВознаграждения / 100 * СтрокаДоходы.Количество;
		//СтрокаДоходы.Вознаграждение = СтрокаДоходы.ВознаграждениеИтого / СтрокаДоходы.Количество;
		//Сумму НДС считаем от ставки
		//СтрокаДоходы.СуммаНДС = ВыборкаДоходы.СуммаНДС;
		
		//вознаграждение считаем при создании документов
		//СтрокаДоходы.СуммаИтого = СтрокаДоходы.СтавкаИтого + СтрокаДоходы.ВознаграждениеИтого;
		//найдем строку вознаграждения по этой строке
		//СтрокаСвязьДоходыРасходыСУЕ = СвязьДоходовИРасходов.Найти(СтрокаДоходы.ГУИД,"ГУИД");
		//СтрокиВознаграждения = Доходы.НайтиСтроки(Новый Структура("ГУИДСтрокиДохода, Услуга",ВыборкаДоходы.Доходы, Справочники.Номенклатура.Вознаграждение));
		//Если СтрокиВознаграждения.Количество() > 0 Тогда
		//	СтрокаВознаграждения = СтрокиВознаграждения[0];
		//	СтрокаВознаграждения.Ставка = СтрокаДоходы.Вознаграждение;
		//	СтрокаВознаграждения.СтавкаИтого = СтрокаВознаграждения.Количество * СтрокаВознаграждения.Ставка;
		//	СтрокаВознаграждения.СтавкаНДС = СтрокаДоходы.СтавкаНДСВознаграждения;
		//	СтрокаВознаграждения.НДСВключенВСтоимость = СтрокаДоходы.ВознаграждениеВключаетНДС;
		//КонецЕсли; 
	КонецЦикла; 
	
	
КонецПроцедуры
//)
//Евросиб - АСуслов 28.03.2022 13:37:28 #
Процедура СформироватьДвиженияАктуальныеЖДН(ОбъектСделка) Экспорт
	
	//ДИТ Шевченко А.В. 59063 02.03.2023 -начало
	//СписокПолейСТипомНакладная = ПолучитьСписокПолейСТипомНакладная(ОбъектСделка); 
	//ШаблонЗапроса = 
	//"ВЫБРАТЬ
	//|	&ПолеЖДН КАК НакладнаяЖДН
	//|ПОМЕСТИТЬ ВТ_Накладные
	//|ИЗ
	//|	ВТ_СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	//|ГДЕ
	//|	НЕ &ПолеЖДН = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)";
	//ТекстЗапросаОбщий = "";                                  
	//ВсегоЗапросов = 0;
	//Для каждого ПолеНакладная Из СписокПолейСТипомНакладная Цикл
	//	ВсегоЗапросов = ВсегоЗапросов + 1;
	//	ТекстЗапроса = СтрЗаменить(ШаблонЗапроса, "&ПолеЖДН", СтрШаблон("СделкаСвязьУчетныхЕдиниц.%1",ПолеНакладная));
	//	Если ВсегоЗапросов > 1 Тогда
	//		ТекстЗапросаОбщий = ТекстЗапросаОбщий + "
	//		|ОБЪЕДИНИТЬ ВСЕ
	//		|";
	//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ВТ_Накладные", "");
	//	КонецЕсли;
	//	ТекстЗапросаОбщий = ТекстЗапросаОбщий + ТекстЗапроса;
	//КонецЦикла;
	//ТекстЗапросаВТ = 
	//"ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_СвязьУчетныхЕдиниц ИЗ &СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц;";
	//МВТ = Новый МенеджерВременныхТаблиц;
	//
	//Запрос = Новый Запрос;        
	//Запрос.МенеджерВременныхТаблиц = МВТ;

	//Запрос.Текст = ТекстЗапросаВТ+"
	//|"+ТекстЗапросаОбщий;

	//Запрос.УстановитьПараметр("СвязьУчетныхЕдиниц", ОбъектСделка.СвязьУчетныхЕдиниц.Выгрузить());
	//Запрос.Выполнить();
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	//|	&Дата КАК Период,
	//|	ТранспортныйДокументУчетныеЕдиницы.Ссылка КАК ЖДН,
	//|	ТранспортныйДокументУчетныеЕдиницы.Контейнер КАК Контейнер,
	//|	ТранспортныйДокументУчетныеЕдиницы.Вагон КАК Вагон,
	//|	1 КАК Наличие
	//|ИЗ
	//|	Документ.ТранспортныйДокумент.УчетныеЕдиницы КАК ТранспортныйДокументУчетныеЕдиницы
	//|ГДЕ
	//|	ТранспортныйДокументУчетныеЕдиницы.Ссылка В (ВЫБРАТЬ т.НакладнаяЖДН ИЗ ВТ_Накладные КАК т)";
	//Запрос.УстановитьПараметр("Дата", ОбъектСделка.Дата);
	//ОбъектСделка.Движения.АктуальныеЖДН.Записывать = Истина;
	//ОбъектСделка.Движения.АктуальныеЖДН.Загрузить(Запрос.Выполнить().Выгрузить());
	
	СоответствиеПолейКТКиЖДН = Новый Соответствие;
	СоответствиеПолейКТКиЖДН.Вставить("ЖДН","СделкаСвязьУчетныхЕдиниц.Контейнер");
	СоответствиеПолейКТКиЖДН.Вставить("НакладнаяПослеГружКТК","СделкаСвязьУчетныхЕдиниц.Контейнер");
	СоответствиеПолейКТКиЖДН.Вставить("ПорожняяЖДНКТК","СделкаСвязьУчетныхЕдиниц.Контейнер");
	СоответствиеПолейКТКиЖДН.Вставить("ВагоннаяЖДН","ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)");
	СоответствиеПолейКТКиЖДН.Вставить("НакладнаяПослеГруженогоПлеча","ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)");
	СоответствиеПолейКТКиЖДН.Вставить("ЖДНПерестановкиДоГружКТК","ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)");
	СоответствиеПолейКТКиЖДН.Вставить("ЖДНПерестановкиДоПорКТК","ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)");
	СоответствиеПолейКТКиЖДН.Вставить("ПорожняяВагоннаяЖДН","ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)");
	
	СоответствиеПолейВагоновиЖДН = Новый Соответствие;
	СоответствиеПолейВагоновиЖДН.Вставить("ЖДН","СделкаСвязьУчетныхЕдиниц.Вагон");
	СоответствиеПолейВагоновиЖДН.Вставить("НакладнаяПослеГружКТК","СделкаСвязьУчетныхЕдиниц.ВагонПодсылаПорКТК");
	СоответствиеПолейВагоновиЖДН.Вставить("ПорожняяЖДНКТК","СделкаСвязьУчетныхЕдиниц.ВагонПодсылаПорКТК");
	СоответствиеПолейВагоновиЖДН.Вставить("ВагоннаяЖДН","СделкаСвязьУчетныхЕдиниц.Вагон");
	СоответствиеПолейВагоновиЖДН.Вставить("НакладнаяПослеГруженогоПлеча","СделкаСвязьУчетныхЕдиниц.Вагон");
	СоответствиеПолейВагоновиЖДН.Вставить("ЖДНПерестановкиДоГружКТК","СделкаСвязьУчетныхЕдиниц.Вагон");
	СоответствиеПолейВагоновиЖДН.Вставить("ЖДНПерестановкиДоПорКТК","СделкаСвязьУчетныхЕдиниц.Вагон");
	СоответствиеПолейВагоновиЖДН.Вставить("ПорожняяВагоннаяЖДН","СделкаСвязьУчетныхЕдиниц.ВагонПодсылаПорКТК");
	
	СписокПолейСТипомНакладная = ПолучитьСписокПолейСТипомНакладная(ОбъектСделка); 
	ШаблонЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Дата КАК Период,
	|	&ПолеЖДН КАК ЖДН,
	|	&ПолеКТК КАК Контейнер,
	|	&ПолеВагон КАК Вагон,
	|	&ПолеКлиент КАК Клиент,
	|	&ПолеДоговор КАК Договор,
	|	1 КАК Наличие
	|ИЗ
	|	ВТ_СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|ГДЕ
	|	НЕ &ПолеЖДН = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)";
	ТекстЗапросаОбщий = "";                                  
	ВсегоЗапросов = 0;
	Для каждого ПолеНакладная Из СписокПолейСТипомНакладная Цикл
		ВсегоЗапросов = ВсегоЗапросов + 1;
		ТекстЗапроса = СтрЗаменить(ШаблонЗапроса, "&ПолеЖДН", СтрШаблон("СделкаСвязьУчетныхЕдиниц.%1",ПолеНакладная));
		
		ИмяПоляКонтейнера = СоответствиеПолейКТКиЖДН.Получить(ПолеНакладная);
		Если ИмяПоляКонтейнера = Неопределено Тогда
			ИмяПоляКонтейнера = "Контейнер";
		КонецЕсли;	
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеКТК", ИмяПоляКонтейнера);
		
		ИмяПоляВагона = СоответствиеПолейВагоновиЖДН.Получить(ПолеНакладная);
		Если ИмяПоляВагона = Неопределено Тогда
			ИмяПоляВагона = "Вагон";
		КонецЕсли;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеВагон", ИмяПоляВагона);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеКлиент", СтрШаблон("СделкаСвязьУчетныхЕдиниц.%1","Клиент"));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеДоговор", СтрШаблон("СделкаСвязьУчетныхЕдиниц.%1","Договор"));
		Если ВсегоЗапросов > 1 Тогда
			ТекстЗапросаОбщий = ТекстЗапросаОбщий + "
			|ОБЪЕДИНИТЬ
			|";
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ВТ_Накладные", "");
		КонецЕсли;
		ТекстЗапросаОбщий = ТекстЗапросаОбщий + ТекстЗапроса;
	КонецЦикла;
	
	ТекстЗапросаРасходыЖДН = 	"
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&Дата КАК Период,
	|	СделкаРасходы.ТранспортныйДокумент КАК ЖДН,
	|	СделкаРасходы.Контейнер КАК Контейнер,
	|	СделкаРасходы.Вагон КАК Вагон,
	|	ЕстьNULL(СвязьУчетныхЕдиниц.Клиент,ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Клиент,
	|	ЕстьNULL(СвязьУчетныхЕдиниц.Договор,ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор,
	|	1 КАК Наличие
	|ИЗ
	|	ВТ_Расходы КАК СделкаРасходы
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц
	|		ПО СвязьУчетныхЕдиниц.ГУИД = СделкаРасходы.СтрокаСвязьУчетныхЕдиниц
	|				И НЕ СделкаРасходы.ОтнестиНаЗатраты
	|ГДЕ
	|	НЕ СделкаРасходы.ТранспортныйДокумент = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|	И НЕ СделкаРасходы.УслугаОтключена
	|	И НЕ СделкаРасходы.ТранспортныйДокумент.ПометкаУдаления
	|	И СделкаРасходы.ИсточникПоявленияСтрокиЭкономики = Значение(Перечисление.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта)
	|	СГРУППИРОВАТЬ ПО
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	&Дата,
	|	СделкаРасходы.ТранспортныйДокумент,
	|	СделкаРасходы.Контейнер,
	|	СделкаРасходы.Вагон,
	|	ЕстьNULL(СвязьУчетныхЕдиниц.Клиент,ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)),
	|	ЕстьNULL(СвязьУчетныхЕдиниц.Договор,ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка))";
	
	ТекстЗапросаОбщий = ТекстЗапросаОбщий + ТекстЗапросаРасходыЖДН;
	
	ТекстЗапросаВТРасходы = 
	"ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Расходы ИЗ &Расходы КАК Расходы;";
	
	
	ТекстЗапросаВТ = 
	"ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_СвязьУчетныхЕдиниц ИЗ &СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц;";
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;        
	Запрос.МенеджерВременныхТаблиц = МВТ;

	Запрос.Текст = ТекстЗапросаВТРасходы +"
	|"+ТекстЗапросаВТ+"
	|"+ТекстЗапросаОбщий;
	Запрос.УстановитьПараметр("СвязьУчетныхЕдиниц", ОбъектСделка.СвязьУчетныхЕдиниц.Выгрузить());
	Запрос.УстановитьПараметр("Расходы", ОбъектСделка.Расходы.Выгрузить());
	Запрос.УстановитьПараметр("Дата", ОбъектСделка.Дата);
	ОбъектСделка.Движения.АктуальныеЖДН.Записывать = Истина;
	ОбъектСделка.Движения.АктуальныеЖДН.Загрузить(Запрос.Выполнить().Выгрузить());
	//ДИТ Шевченко А.В. 59063 02.03.2023 -конец
КонецПроцедуры

//Евросиб - АСуслов 06.12.2022 15:06:09 #59168
//(

// Евросиб Фролов (25.04.2022 Task №42905
Процедура ОтвязатьАкцептыОтОтключенныхРасходов(Сделка) Экспорт
	
	Если НЕ Константы.ОтвязыватьАкцептыОтОтключенныхСтрок.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	//Получим список акцептов и поставим их в очередь отложенного изменения
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АктуальныеАкцептыСрезПоследних.Поступление КАК Поступление,
	|	АктуальныеАкцептыСрезПоследних.Акцепт КАК Акцепт
	|ПОМЕСТИТЬ ВТ_АктуальныеАкцепты
	|ИЗ
	|	РегистрСведений.АктуальныеАкцепты.СрезПоследних КАК АктуальныеАкцептыСрезПоследних
	|ГДЕ
	|	НЕ АктуальныеАкцептыСрезПоследних.Акцепт = ЗНАЧЕНИЕ(Документ.Акцепт.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_АктуальныеАкцепты.Поступление КАК Поступление
	|ПОМЕСТИТЬ ВТ_ТекущиеПривязкиАкцептов
	|ИЗ
	|	Документ.Сделка.Расходы КАК СделкаРасходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Акцепт.Услуги КАК АкцептУслуги
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_АктуальныеАкцепты КАК ВТ_АктуальныеАкцепты
	|			ПО АкцептУслуги.Ссылка = ВТ_АктуальныеАкцепты.Акцепт
	|		ПО СделкаРасходы.ГУИД = АкцептУслуги.ИдентификаторСтрокиРасходовВСделке
	|			И (СделкаРасходы.Ссылка = &Сделка)
	|			И (СделкаРасходы.УслугаОтключена)";
	Запрос.УстановитьПараметр("Сделка", Сделка);
	РезультатЗапроса = Запрос.Выполнить();
	
	
	
	//ТекстЗапроса =
	//"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	Расходы.УчДокумент КАК Поступление,
	//|	Расходы.ГУИД КАК ГУИД,
	//|	Расходы.ПричинаОтключенияСтроки КАК ПричинаОтключенияСтроки
	//|ПОМЕСТИТЬ втРасходы
	//|ИЗ
	//|	&Расходы КАК Расходы
	//|ГДЕ
	//|	Расходы.УчДокумент <> ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
	//|	И Расходы.УслугаОтключена
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	втРасходы.Поступление КАК Поступление,
	//|	втРасходы.ГУИД КАК ГУИД,
	//|	втРасходы.ПричинаОтключенияСтроки КАК ПричинаОтключенияСтроки
	//|ИЗ
	//|	втРасходы КАК втРасходы
	//|ИТОГИ ПО
	//|	Поступление";
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = ТекстЗапроса;
	//Запрос.УстановитьПараметр("Расходы", ОбъектСделка.Расходы.Выгрузить());
	//
	//Результат = Запрос.Выполнить();
	//
	//Если Результат.Пустой() Тогда
	//	Возврат;
	//КонецЕсли;	
	//
	//ВыборкаПТУ = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//
	//МассивСтрокСделкиДляИзменения = Новый Массив;
	//
	//Пока ВыборкаПТУ.Следующий() Цикл
	//	
	//	МассивОбработанныхСтрок = Новый Массив;
	//	
	//	АкцептОбъект = Документы.Акцепт.НайтиСоздатьАктуальныйАкцепт(ВыборкаПТУ.Поступление, Ложь);
	//	
	//	ДанныеОбАкцепте 				= СведенияКорректировочногоАкцепта(АкцептОбъект, ОбъектСделка);
	//	ЭтоКорректировочныйАкцепт 		= ДанныеОбАкцепте.ЭтоКорректировочныйАкцепт;
	//	СтрокиКорректировкиПоступления 	= ДанныеОбАкцепте.СтрокиКорректировкиПоступления;
	//	
	//	// Строки расходов, которые отключены.
	//	ВыборкаСтрокДляОтвязки = ВыборкаПТУ.Выбрать();
	//	
	//	АкцептОбъект.ДополнительныеСвойства.Вставить("ЗаписьИзСделки");
	//	Попытка
	//		АкцептОбъект.Заблокировать();
	//		
	//		Пока ВыборкаСтрокДляОтвязки.Следующий() Цикл 
	//			ОтвязываемыеСтроки = АкцептОбъект.Услуги.НайтиСтроки(Новый Структура("Сделка, ИдентификаторСтрокиРасходовВСделке", ОбъектСделка.Ссылка, ВыборкаСтрокДляОтвязки.ГУИД));
	//			Для Каждого СтрокаАкцепта Из ОтвязываемыеСтроки Цикл
	//				
	//				Если ЭтоКорректировочныйАкцепт Тогда
	//					//Обновлять только те строки сделки, которые связаны со строками корректировки поступления, не связанными со строками ПТУ (т.е. добавленными в Корректировку поступления).
	//					СтрокаКоректировкиПоступления = СтрокиКорректировкиПоступления.Найти(СтрокаАкцепта.ИдентификаторСтрокипоступления, "ИдентификаторСтрокипоступления"); 
	//					Если СтрокаКоректировкиПоступления <> Неопределено И Не ЗначениеЗаполнено(СтрокаКоректировкиПоступления.Поступление) Тогда
	//						МассивОбработанныхСтрок.Добавить(Новый Структура("ГУИДРасходов", СтрокаАкцепта.ИдентификаторСтрокиРасходовВСделке));
	//					КонецЕсли;
	//				Иначе
	//					МассивОбработанныхСтрок.Добавить(Новый Структура("ГУИДРасходов", СтрокаАкцепта.ИдентификаторСтрокиРасходовВСделке));
	//				КонецЕсли;
	//				
	//				//Евросиб - АСуслов 29.08.2022 14:05:39 #56528
	//				//(
	//				//Документы.Акцепт.ОтвязатьСтрокуАкцептаОтСделки(СтрокаАкцепта);
	//			 	Документы.Акцепт.ОтвязатьСтрокуАкцептаОтСделки(СтрокаАкцепта, АкцептОбъект, Перечисления.СобытияОтвязкиПоступления.ЗаписьСделки, ВыборкаСтрокДляОтвязки.ПричинаОтключенияСтроки);
	//				//)
	//				//Евросиб - АСуслов 29.08.2022 14:05:46 #56528
	//				
	//			КонецЦикла;			
	//		КонецЦикла;
	//		
	//		АкцептОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//		
	//		Для Каждого ОбработаннаяСтрока Из МассивОбработанныхСтрок Цикл
	//			МассивСтрокСделкиДляИзменения.Добавить(ОбработаннаяСтрока);
	//		КонецЦикла;
	//	Исключение
	//		ЗаписьЖурналаРегистрации(НСтр("ru = 'Отвязка строк акцепта от сделки (отключенные расходы)'", Метаданные.ОсновнойЯзык.КодЯзыка),
	//					УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.Акцепт, АкцептОбъект, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	//		
	//		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось отвязать строки акцепта №%1 от %2 от сделки.
	//									|Ошибка: %3'"),
	//									АкцептОбъект.Номер,
	//									АкцептОбъект.Дата,
	//									КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));				
	//		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, АкцептОбъект);				
	//	КонецПопытки;

	//КонецЦикла;	
	//
	//Для каждого Стр Из МассивСтрокСделкиДляИзменения Цикл
	//	СтрокаРасходов = ОбъектСделка.Расходы.Найти(Стр.ГУИДРасходов);
	//	Если СтрокаРасходов = Неопределено Тогда
	//		Продолжить;
	//	КонецЕсли; 
	//	Если СтрокаРасходов.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта Тогда
	//		мСтрокКУдалению = Новый Массив;
	//		мСтрокКУдалению.Добавить(СтрокаРасходов);		 
	//		ОбъектСделка.УдалитьСтрокиРасходов(мСтрокКУдалению, Ложь, Истина, Ложь);
	//	Иначе
	//		СтрокаРасходов.УчДокумент = Документы.ПоступлениеТоваровУслуг.ПустаяСсылка();
	//	КонецЕсли;
	//КонецЦикла;
	
КонецПроцедуры
// Евросиб Фролов)
//)
//Евросиб - АСуслов 06.12.2022 15:06:11 #59168
// Евросиб Фролов (28.04.2022 Task №49949
Функция СведенияКорректировочногоАкцепта(АкцептОбъект, Сделка) Экспорт
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("ЭтоКорректировочныйАкцепт", Ложь);
	СтруктураОтвета.Вставить("СтрокиКорректировкиПоступления", Неопределено);
	
	Если ТипЗнч(АкцептОбъект.Поступление) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
		
		СтруктураОтвета.ЭтоКорректировочныйАкцепт = Истина;
		
		ТаблицаОтвязываемыхСтрок = АкцептОбъект.Услуги.Выгрузить(Новый Структура("Сделка", Сделка), "ИдентификаторСтрокиПоступления, ИдентификаторСтрокиРасходовВСделке, ГУИД");
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаАкцепта.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
		|	ТаблицаАкцепта.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке,
		|	ТаблицаАкцепта.ГУИД КАК ГУИД
		|ПОМЕСТИТЬ ВТСтрокиАкцепта
		|ИЗ
		|	&ТаблицаАкцепта КАК ТаблицаАкцепта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСтрокиАкцепта.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
		|	ВТСтрокиАкцепта.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке,
		|	ВТСтрокиАкцепта.ГУИД КАК ГУИД,
		|	КорректировкаПоступленияУслуги.Ссылка КАК КорректировкаПоступления,
		|	ПоступлениеТоваровУслугУслуги.Ссылка КАК Поступление
		|ИЗ
		|	ВТСтрокиАкцепта КАК ВТСтрокиАкцепта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления.Услуги КАК КорректировкаПоступленияУслуги
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
		|			ПО КорректировкаПоступленияУслуги.Ссылка.ДокументПоступления = ПоступлениеТоваровУслугУслуги.Ссылка
		|				И КорректировкаПоступленияУслуги.ГУИДПТУ = ПоступлениеТоваровУслугУслуги.ГУИДПТУ
		|		ПО ВТСтрокиАкцепта.ИдентификаторСтрокиПоступления = КорректировкаПоступленияУслуги.ГУИДПТУ
		|ГДЕ
		|	КорректировкаПоступленияУслуги.Ссылка = &КорректировкаПоступления";
		Запрос.УстановитьПараметр("ТаблицаАкцепта", ТаблицаОтвязываемыхСтрок);
		Запрос.УстановитьПараметр("КорректировкаПоступления", АкцептОбъект.Поступление);
		СтруктураОтвета.СтрокиКорректировкиПоступления = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	Возврат СтруктураОтвета;
КонецФункции
// Евросиб Фролов)

// Евросиб Фролов (27.04.2022 Task №50551
Процедура ОтключитьСтрокиРасходовПоОтмеченнымКТК(Сделка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД
	|ПОМЕСТИТЬ втСвязьУчетныхЕдиниц
	|ИЗ
	|	&СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|ГДЕ
	|	СделкаСвязьУчетныхЕдиниц.ОтключитьРасходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаРасходы.ГУИД КАК ГУИД,
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц
	|ПОМЕСТИТЬ втРасходы
	|ИЗ
	|	&Расходы КАК СделкаРасходы
	|ГДЕ
	|	СделкаРасходы.УслугаОтключена = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаРасходы.ГУИД КАК ГУИД
	|ИЗ
	|	втСвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРасходы КАК СделкаРасходы
	|		ПО СделкаСвязьУчетныхЕдиниц.ГУИД = СделкаРасходы.СтрокаСвязьУчетныхЕдиниц";

	Запрос.УстановитьПараметр("Расходы", Сделка.Расходы.Выгрузить());
	Запрос.УстановитьПараметр("СвязьУчетныхЕдиниц", Сделка.СвязьУчетныхЕдиниц.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();                            
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаРасход = Сделка.Расходы.Найти(Выборка.ГУИД, "ГУИД");
		СтрокаРасход.УслугаОтключена = Истина;
		СтрокаРасход.ПричинаОтключенияСтроки = Перечисления.ПричиныОтключенияСтрокиРасходовСделки.РучноеОтключениеСтрокиСоставаПоезда;
	КонецЦикла;
	
КонецПроцедуры

Функция ВсеРасходыКТКОтключены(ГУИД, ОбъектСделка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&Расходы КАК СделкаРасходы
	|ГДЕ
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц = &ГУИД
	|	И СделкаРасходы.УслугаОтключена = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц
	|ИЗ
	|	ВТ КАК ВТ";
	
	Запрос.УстановитьПараметр("Расходы", ОбъектСделка.Расходы.Выгрузить());
	Запрос.УстановитьПараметр("ГУИД", ГУИД);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции	

Процедура ПривязатьРасходыСУслугойНаДоходыПоОсновнойУслуге(Сделка) Экспорт
	
	Доходы = Сделка.Доходы;
	Расходы = Сделка.Расходы;
	СвязьДоходовИРасходов = Сделка.СвязьДоходовИРасходов;
	СвязьУчетныхЕдиниц = Сделка.СвязьУчетныхЕдиниц;
	
	//этот алгоритм перевешивает расходы по доп.услугам на основную, пока ожидаем выставление доп.услуги
	//также чистит лишние связи
	СтрокиДляУдаления = Новый Массив; 
	//ИдентификаторыДоплатныхУслуг = Доходы.Выгрузить(Новый Структура("ДоплатныеКТК", Истина),"ГУИД").ВыгрузитьКолонку("ГУИД");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаРасходы.ГУИД КАК ГУИД,
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	|	СделкаРасходы.Услуга КАК Услуга,
	|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	|	СделкаРасходы.Перевыставляемая КАК Перевыставляемая,
	|	СделкаРасходы.ОтнестиНаЗатраты КАК ОтнестиНаЗатраты,
	|   СделкаРасходы.АвтоматическиПривязыватьРасходКДоходу КАК АвтоматическиПривязыватьРасходКДоходу,
	|   СделкаРасходы.СтрокаРасходовВСделкеИсточник КАК СтрокаРасходовВСделкеИсточник,
	|   СделкаРасходы.ПеренесеннаяСделкаИсточник КАК ПеренесеннаяСделкаИсточник,
	|   //Евросиб - АСуслов 14.08.2023 11:32:29 #71410
		//(
	|   СделкаРасходы.СтрокаКалькуляции КАК СтрокаКалькуляции	
		//)
		//Евросиб - АСуслов 14.08.2023 11:32:31 #71410
	|ПОМЕСТИТЬ ВТ_Расходы
	|ИЗ
	|	Документ.Сделка.Расходы КАК СделкаРасходы
	|ГДЕ
//	|	СделкаРасходы.Ссылка = &Сделка И
	|	СделкаРасходы.АвтоматическиПривязыватьРасходКДоходу
	|;
	|
	|ВЫБРАТЬ
	|	СделкаСвязьДоходовИРасходов.Доходы КАК Доходы,
	|	СделкаСвязьДоходовИРасходов.Расходы КАК Расходы,
	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
	|	СделкаСвязьДоходовИРасходов.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_СвязьДоходовИРасходов
	|ИЗ
	|	Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
//	|ГДЕ	СделкаСвязьДоходовИРасходов.Ссылка = &Сделка
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаДоходы.ГУИД КАК ГУИД,
	|	СделкаДоходы.Услуга КАК Услуга,
	|	СделкаДоходы.Перевыставляемая КАК Перевыставляемая,
	|	СделкаДоходы.УслугаВнеСтавки КАК УслугаВнеСтавки,
	|	СделкаДоходы.ДоплатныеКТК КАК ДоплатныеКТК,
	|	СделкаДоходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики, 
	|   ВЫРАЗИТЬ(СделкаДоходы.КорректировкаДокумента КАК Документ.КорректировкаРеализации) КАК КорректировкаДокумента,
	//Евросиб - АСуслов 14.08.2023 11:23:06 #71410
	//(
	|  	СделкаДоходы.СтрокаКалькуляции 
	//)
	//Евросиб - АСуслов 14.08.2023 11:23:11 #71410
	|   
	|ПОМЕСТИТЬ ВТ_Доходы
	|ИЗ
	|	Документ.Сделка.Доходы КАК СделкаДоходы
	|ГДЕ 
//	|	СделкаДоходы.Ссылка = &Сделка И
	|   СделкаДоходы.НеВыставлятьКлиенту = ЛОЖЬ
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	|	СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения
	|ПОМЕСТИТЬ ВТ_СвязьУчетныхЕдиниц
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
//	|ГДЕ СделкаСвязьУчетныхЕдиниц.Ссылка = &Сделка
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаДоходы.ГУИД КАК ГУИД,
	|	СделкаДоходы.Услуга КАК Услуга,
	|	СделкаДоходы.Перевыставляемая КАК Перевыставляемая,
	|	СделкаДоходы.УслугаВнеСтавки КАК УслугаВнеСтавки,
	|	СделкаДоходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
	|   СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения,
	//Евросиб - АСуслов 14.08.2023 11:30:25 #71410
	//(
	|   СделкаДоходы.СтрокаКалькуляции КАК СтрокаКалькуляции
	//)
	//Евросиб - АСуслов 14.08.2023 11:30:28 #71410
	|ПОМЕСТИТЬ ВТ_СвязьДоходыСУЕ
	|ИЗ
	|	ВТ_Доходы КАК СделкаДоходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|			ПО СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц = СделкаСвязьУчетныхЕдиниц.ГУИД
	|		ПО СделкаДоходы.ГУИД = СделкаСвязьДоходовИРасходов.Доходы
	// Евросиб US 86792 TA 90935 Рыбьяков К.А. 02.09.2024 ((
	//			И НЕ СделкаДоходы.ДоплатныеКТК 
	// Евросиб Рыбьяков К.А. 02.09.2024 ))
	//Евросиб - АСуслов 31.05.2023 13:04:05 #70886
	//(           
	|  			И (СделкаДоходы.ИсточникПоявленияСтрокиЭкономики = Значение(Перечисление.ИсточникПоявленияСтрокиЭкономики.ПустаяСсылка)
	//)
	//Евросиб - АСуслов 31.05.2023 13:04:07 #70886
	//Евросиб - АСуслов 31.05.2023 13:04:05 #70886
	//( 
	//71410 добавлен источник при заполнении доп из калькуляции в доходах, после этого строчки перестали попадать в связку
	|  			ИЛИ СделкаДоходы.ИсточникПоявленияСтрокиЭкономики = Значение(Перечисление.ИсточникПоявленияСтрокиЭкономики.ДопУслугаАвтоматически))
	//)
	//Евросиб - АСуслов 31.05.2023 13:04:07 #70886
	//Евросиб - АСуслов 27.02.2024 11:40:57 #81376
	//(
	|           И НЕ ЕСТЬNULL(СделкаДоходы.КорректировкаДокумента.ВидОперации, Значение(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ПустаяСсылка)) = Значение(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование)
	//)
	//Евросиб - АСуслов 27.02.2024 11:41:07 #81376
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 
	|ВЫБРАТЬ
	|	ВТ_СвязьДоходыСУЕ.ГУИД КАК Доходы,
	|	ВТ_Расходы.ГУИД КАК Расходы,
	|	ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Услуга
	|ПОМЕСТИТЬ ВТ_Итоговая
	|ИЗ
	|	ВТ_Расходы КАК ВТ_Расходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвязьДоходыСУЕ КАК ВТ_СвязьДоходыСУЕ
	|		ПО ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц = ВТ_СвязьДоходыСУЕ.СвязьУчетныхЕдиниц
	|			И ВТ_Расходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ОсновнаяУслугаАвтоматически)
	|			И (ВТ_СвязьДоходыСУЕ.УслугаВнеСтавки = ЛОЖЬ)
	|			И (ВТ_СвязьДоходыСУЕ.Перевыставляемая = ЛОЖЬ)
	// Евросиб US 86792 TA 90935 Рыбьяков К.А. 02.09.2024 ((
	|			И ВЫБОР 
	|				КОГДА ВТ_СвязьДоходыСУЕ.СтрокаКалькуляции <> """" 
	|					ТОГДА ВТ_Расходы.СтрокаКалькуляции = ВТ_СвязьДоходыСУЕ.СтрокаКалькуляции 
	|				ИНАЧЕ ИСТИНА 
	|			КОНЕЦ
	// Евросиб Рыбьяков К.А. 02.09.2024 ))
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	ВТ_СвязьДоходыСУЕ.ГУИД КАК Доходы,
	|	ВТ_Расходы.ГУИД КАК Расходы,
	|	ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Услуга
	|ИЗ
	|	ВТ_Расходы КАК ВТ_Расходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвязьДоходыСУЕ КАК ВТ_СвязьДоходыСУЕ
	|		ПО ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц = ВТ_СвязьДоходыСУЕ.СвязьУчетныхЕдиниц
	|			И ВТ_Расходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДН)
	|			И (ВТ_СвязьДоходыСУЕ.УслугаВнеСтавки = ЛОЖЬ)
	|			И (ВТ_СвязьДоходыСУЕ.Перевыставляемая = ЛОЖЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_СвязьДоходыСУЕ.ГУИД,
	|	ВТ_Расходы.ГУИД,
	|	ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц,
	|	&Фрахт
	|ИЗ
	|	ВТ_Расходы КАК ВТ_Расходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвязьДоходыСУЕ КАК ВТ_СвязьДоходыСУЕ
	|		ПО ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц = ВТ_СвязьДоходыСУЕ.СвязьУчетныхЕдиниц
	|			И (ВТ_Расходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ФрахтИзКалькуляции))
	|			И (ВТ_СвязьДоходыСУЕ.УслугаВнеСтавки = ЛОЖЬ)
	|			И (ВТ_СвязьДоходыСУЕ.Перевыставляемая = ЛОЖЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_СвязьДоходыСУЕ.ГУИД,
	|	ВТ_Расходы.ГУИД,
	|	ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц,
	|	ВТ_Расходы.Услуга
	|ИЗ
	|	ВТ_Расходы КАК ВТ_Расходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвязьДоходыСУЕ КАК ВТ_СвязьДоходыСУЕ
	|		ПО ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц = ВТ_СвязьДоходыСУЕ.СвязьУчетныхЕдиниц
	|			И ВТ_Расходы.Услуга = ВТ_СвязьДоходыСУЕ.Услуга
	|			И (ВТ_Расходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ДопУслугаАвтоматически))
	|			И (ВТ_СвязьДоходыСУЕ.УслугаВнеСтавки = ИСТИНА)
	//Евросиб - АСуслов 14.08.2023 11:32:01 #71410
	//(
	|   		И ВЫБОР КОГДА ВТ_СвязьДоходыСУЕ.СтрокаКалькуляции <> """" ТОГДА ВТ_Расходы.СтрокаКалькуляции = ВТ_СвязьДоходыСУЕ.СтрокаКалькуляции ИНАЧЕ ИСТИНА КОНЕЦ
	//)
	//Евросиб - АСуслов 14.08.2023 11:32:03 #71410
	|          
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	ВТ_СвязьДоходыСУЕ.ГУИД,
	|	ВТ_Расходы.ГУИД,
	|	ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц,
	|	ВЫБОР КОГДА ВТ_СвязьДоходыСУЕ.ВидТранспортногоСообщения = Значение(Перечисление.ВидыТранспортныхСообщений.ЖД) ТОГДА Значение(Справочник.Номенклатура.ПустаяСсылка) 
	|   ИНАЧЕ &Фрахт КОНЕЦ
	|ИЗ
	|	ВТ_Расходы КАК ВТ_Расходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвязьДоходыСУЕ КАК ВТ_СвязьДоходыСУЕ
	|		ПО ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц = ВТ_СвязьДоходыСУЕ.СвязьУчетныхЕдиниц
	|			И (ВТ_Расходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта))
	|			И (ВТ_СвязьДоходыСУЕ.УслугаВнеСтавки = ЛОЖЬ)
	|			И (ВТ_СвязьДоходыСУЕ.Перевыставляемая = ЛОЖЬ)
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	ВТ_СвязьДоходыСУЕ.ГУИД,
	|	ВТ_Расходы.ГУИД,
	|	ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц,
	|	ВЫБОР КОГДА ВТ_СвязьДоходыСУЕ.ВидТранспортногоСообщения = Значение(Перечисление.ВидыТранспортныхСообщений.ЖД) ТОГДА Значение(Справочник.Номенклатура.ПустаяСсылка) 
	|   ИНАЧЕ &Фрахт КОНЕЦ
	|ИЗ
	|	ВТ_Расходы КАК ВТ_Расходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвязьДоходыСУЕ КАК ВТ_СвязьДоходыСУЕ
	|		ПО ВТ_Расходы.СтрокаСвязьУчетныхЕдиниц = ВТ_СвязьДоходыСУЕ.СвязьУчетныхЕдиниц
	|			И (ВТ_Расходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ОбъединениеПорожнейИГруженойСделок))
	|			И (ВТ_СвязьДоходыСУЕ.УслугаВнеСтавки = ЛОЖЬ)
	|			И (ВТ_СвязьДоходыСУЕ.Перевыставляемая = ЛОЖЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Итоговая.Доходы КАК Доходы,
	//|	ВТ_Итоговая.Расходы КАК Расходы,
	//|	ВТ_Итоговая.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
	//|	ВТ_Итоговая.Услуга КАК Услуга
	//|ИЗ
	//|	ВТ_Итоговая КАК ВТ_Итоговая
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	//|		ПО 
	//|			ВТ_Итоговая.Расходы = СделкаСвязьДоходовИРасходов.Расходы
	////|  		И ВТ_Итоговая.Доходы = СделкаСвязьДоходовИРасходов.Доходы
	//|			И ВТ_Итоговая.СвязьУчетныхЕдиниц = СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц
	//|			И ВТ_Итоговая.Услуга = СделкаСвязьДоходовИРасходов.Услуга
	////|			И (СделкаСвязьДоходовИРасходов.Ссылка = &Сделка)
	////|;
	|ВЫБРАТЬ
	|	ВТ_Итоговая.Доходы КАК Доходы,
	|	ВТ_Итоговая.Расходы КАК Расходы,
	|	ВТ_Итоговая.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
	|	ВТ_Итоговая.Услуга КАК Услуга
	|ИЗ
	|	ВТ_Итоговая КАК ВТ_Итоговая
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|		ПО (ВТ_Итоговая.Расходы = СделкаСвязьДоходовИРасходов.Расходы)
	|			И (ВТ_Итоговая.СвязьУчетныхЕдиниц = СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц)
	|ГДЕ ВТ_Итоговая.Доходы <> ЕСТЬNULL(СделкаСвязьДоходовИРасходов.Доходы, """")
	|
	|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	СделкаРасходы.ГУИД КАК ГУИД,
	//|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	//|	СделкаРасходы.УслугаОтключена КАК УслугаОтключена,
	//|	ВТ_Итоговая.Доходы КАК Доходы
	//|ИЗ
	//|	Документ.Сделка.Расходы КАК СделкаРасходы
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Итоговая КАК ВТ_Итоговая
	//|		ПО СделкаРасходы.ГУИД = ВТ_Итоговая.Расходы
	//|ГДЕ
	//|	СделкаРасходы.Ссылка = &Сделка
	//|	И ВТ_Итоговая.Расходы ЕСТЬ NULL
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	СделкаРасходы.ИсточникПоявленияСтрокиЭкономики
	|";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.Расходы КАК СделкаРасходы", "&Расходы КАК СделкаРасходы");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.СвязьДоходовИРасходов", "&СвязьДоходовИРасходов");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.Доходы", "&Доходы");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.СвязьУчетныхЕдиниц", "&СвязьУчетныхЕдиниц");
	
	Если Сделка.ДополнительныеСвойства.Свойство("ЗаписьИзАкцепта") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НЕ ВТ_Доходы.НеВыставлятьКлиенту", "");	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Расходы", Расходы.Выгрузить());
	Запрос.УстановитьПараметр("СвязьДоходовИРасходов", СвязьДоходовИРасходов.Выгрузить());
	Запрос.УстановитьПараметр("СвязьУчетныхЕдиниц", СвязьУчетныхЕдиниц.Выгрузить());
	Запрос.УстановитьПараметр("Доходы", Доходы.Выгрузить());
	Запрос.УстановитьПараметр("Фрахт", Константы.УслугаФрахтаДляКалькуляции.Получить());
	
	ВыборкаСвязиДляДобавления = Запрос.Выполнить().Выбрать();
	Пока ВыборкаСвязиДляДобавления.Следующий() Цикл
		//ищем комбинацию расход суе услуга,
		//если находим, то добавляем связь с доходами,
		//если нет, то добавляем строчку целиком
		СтрокиСвязей = Сделка.СвязьДоходовИРасходов.НайтиСтроки(Новый Структура("Расходы, СвязьУчетныхЕдиниц", ВыборкаСвязиДляДобавления.Расходы, ВыборкаСвязиДляДобавления.СвязьУчетныхЕдиниц));
		Если СтрокиСвязей.Количество() > 0 Тогда
			Для каждого СтрокаСвязи Из СтрокиСвязей Цикл
				//Евросиб - АСуслов 11.10.2023 18:06:27 #
				//(
				//чтобы можно было перевязать на другой доход вручную
				Если СтрокаСвязи.Доходы = "" Тогда
					СтрокаСвязи.Доходы = ВыборкаСвязиДляДобавления.Доходы;
				КонецЕсли;
				//)
				//Евросиб - АСуслов 11.10.2023 18:06:27 #
			КонецЦикла;	                                              
		Иначе
			СтрокаСвязи = Сделка.СвязьДоходовИРасходов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСвязи, ВыборкаСвязиДляДобавления);
		КонецЕсли;
	КонецЦикла;
	
	ОчиститьБитыеСсылкиНаДоходыРасходы(Сделка);
	
КонецПроцедуры    

Процедура ОчиститьБитыеСсылкиНаДоходыРасходы(Сделка)

	Доходы = Сделка.Доходы;
	Расходы = Сделка.Расходы;
	СвязьДоходовИРасходов = Сделка.СвязьДоходовИРасходов;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаДоходы.ГУИД КАК ГУИД
	|ПОМЕСТИТЬ ВТ_Доходы
	|ИЗ
	|	&Доходы КАК СделкаДоходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаРасходы.ГУИД КАК ГУИД
	|ПОМЕСТИТЬ ВТ_Расходы
	|ИЗ
	|	&Расходы КАК СделкаРасходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаСвязьДоходовИРасходов.Доходы КАК Доходы,
	|	СделкаСвязьДоходовИРасходов.Расходы КАК Расходы,
	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
	|	СделкаСвязьДоходовИРасходов.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_СвязьДоходовИРасходов
	|ИЗ
	|	&СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//Евросиб Каблов 11.01.2024 ( #78949
	//|ВЫБРАТЬ
	//|	ЕСТЬNULL(ВТ_Доходы.ГУИД, """") КАК Доходы,
	//|	ЕСТЬNULL(ВТ_Расходы.ГУИД, """") КАК Расходы,
	//|	ВТ_СвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
	//|	ВТ_СвязьДоходовИРасходов.Услуга КАК Услуга
	//|ИЗ
	//|	ВТ_СвязьДоходовИРасходов КАК ВТ_СвязьДоходовИРасходов
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Доходы КАК ВТ_Доходы
	//|		ПО ВТ_СвязьДоходовИРасходов.Доходы = ВТ_Доходы.ГУИД
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Расходы КАК ВТ_Расходы
	//|		ПО ВТ_СвязьДоходовИРасходов.Расходы = ВТ_Расходы.ГУИД";	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(ВТ_Доходы.ГУИД, """") КАК Доходы,
	|	ЕСТЬNULL(ВТ_Расходы.ГУИД, """") КАК Расходы,
	|	ВТ_СвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
	|	ВТ_СвязьДоходовИРасходов.Услуга КАК Услуга
	|ПОМЕСТИТЬ СвязиБезБитыхСсылок
	|ИЗ
	|	ВТ_СвязьДоходовИРасходов КАК ВТ_СвязьДоходовИРасходов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Доходы КАК ВТ_Доходы
	|		ПО ВТ_СвязьДоходовИРасходов.Доходы = ВТ_Доходы.ГУИД
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Расходы КАК ВТ_Расходы
	|		ПО ВТ_СвязьДоходовИРасходов.Расходы = ВТ_Расходы.ГУИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СвязиБезБитыхСсылок.Доходы КАК Доходы,
	|	СвязиБезБитыхСсылок.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц
	|ПОМЕСТИТЬ СвязиБезРасходов
	|ИЗ
	|	СвязиБезБитыхСсылок КАК СвязиБезБитыхСсылок
	|ГДЕ
	|	СвязиБезБитыхСсылок.Расходы = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СвязьДоходовИРасходов.Доходы КАК Доходы,
	|	ВТ_СвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
	|	ВТ_СвязьДоходовИРасходов.Услуга КАК Услуга
	|ПОМЕСТИТЬ СвязиСДублямиБезРасходов
	|ИЗ
	|	ВТ_СвязьДоходовИРасходов КАК ВТ_СвязьДоходовИРасходов
	|ГДЕ
	|	(ВТ_СвязьДоходовИРасходов.Доходы, ВТ_СвязьДоходовИРасходов.СвязьУчетныхЕдиниц) В
	|			(ВЫБРАТЬ
	|				СвязиБезРасходов.Доходы КАК Доходы,
	|				СвязиБезРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц
	|			ИЗ
	|				СвязиБезРасходов КАК СвязиБезРасходов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СвязьДоходовИРасходов.Доходы,
	|	ВТ_СвязьДоходовИРасходов.СвязьУчетныхЕдиниц,
	|	ВТ_СвязьДоходовИРасходов.Услуга
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ВТ_СвязьДоходовИРасходов.Расходы) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СвязиБезБитыхСсылок.Доходы КАК Доходы,
	|	СвязиБезБитыхСсылок.Расходы КАК Расходы,
	|	СвязиБезБитыхСсылок.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
	|	СвязиБезБитыхСсылок.Услуга КАК Услуга
	|ИЗ
	|	СвязиБезБитыхСсылок КАК СвязиБезБитыхСсылок
	|		ЛЕВОЕ СОЕДИНЕНИЕ СвязиСДублямиБезРасходов КАК СвязиСДублямиБезРасходов
	|		ПО СвязиБезБитыхСсылок.СвязьУчетныхЕдиниц = СвязиСДублямиБезРасходов.СвязьУчетныхЕдиниц
	|			И СвязиБезБитыхСсылок.Доходы = СвязиСДублямиБезРасходов.Доходы
	|			И (СвязиБезБитыхСсылок.Расходы = """")
	|			И СвязиБезБитыхСсылок.Услуга = СвязиСДублямиБезРасходов.Услуга
	|ГДЕ
	|	СвязиСДублямиБезРасходов.Доходы ЕСТЬ NULL";
	//Евросиб Каблов 11.01.2024 )
	
	Запрос.УстановитьПараметр("Доходы", Доходы.Выгрузить());
	Запрос.УстановитьПараметр("Расходы", Расходы.Выгрузить());
	Запрос.УстановитьПараметр("СвязьДоходовИРасходов", СвязьДоходовИРасходов.Выгрузить());
	СвязьДоходовИРасходов.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

//Евросиб - АСуслов 08.09.2022 14:28:31 #56540
//(
Процедура СформироватьДвиженияДатыПодачАвтоПодВыгрузку(Сделка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаСоставУслуги.ДатаПодачиАвтоПодВыгрузку КАК Дата,
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ИдентификаторСвязьУчетныхЕдиниц
	|ИЗ
	|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|		ПО ЗаявкаСоставУслуги.ГУИДСтроки = СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки
	|ГДЕ
	|	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
	|   И НЕ СделкаСвязьУчетныхЕдиниц.ГуидСтрокиЗаявки = """"";
	Запрос.УстановитьПараметр("Ссылка", Сделка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;  
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		мз = РегистрыСведений.ДатыПодачАвтоПодВыгрузку.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(мз, Выборка);
		мз.Записать();
	КонецЦикла;
		
КонецПроцедуры
//)
//Евросиб - АСуслов 08.09.2022 14:28:32 #56540 
//Евросиб - АСуслов 26.01.2023 13:07:32 #59259
//(
Функция ЗаполнитьСчетаПокупателю(СделкаОбъект) Экспорт
	Ошибка = Ложь;                                     
	ТаблицаСвязьУчетныхЕдиниц = СделкаОбъект.СвязьУчетныхЕдиниц.Выгрузить();
	СписокКТК = ТаблицаСвязьУчетныхЕдиниц.ВыгрузитьКолонку("Контейнер");
	СсылкаНаСделку = ТаблицаСвязьУчетныхЕдиниц.ВыгрузитьКолонку("Заявка");
	//СсылкаНаСделку.Добавить(СделкаОбъект.Ссылка); //ДИТ, Беляев СЮ, Ticket#0301354, 02-03-2023, закомментировано, ищем только по Заявкам
	НеобходимаЗаписьОбъекта = Ложь; 
	Если СписокКТК.Количество() > 0 Тогда
		УслугаФрахта = Константы.УслугаФрахтаДляКалькуляции.Получить();
		//СчетаДляКТК = КлючевыеСобытияСделкиСервер.ПолучитьСчетаДляКТК(СписокКТК, СсылкаНаСделку, УслугаФрахта);
		//ДИТ, Беляев СЮ, Ticket#0301354, 02-03-2023, начало
		ТаблицаСчетов = КлючевыеСобытияСделкиСервер.ПолучитьСчетаДляКТК(СделкаОбъект, УслугаФрахта);
		//ДИТ, Беляев СЮ, Ticket#0301354, 02-03-2023, конец
		Для каждого Стр из СделкаОбъект.СвязьУчетныхЕдиниц Цикл
			//РезСоотв = СчетаДляКТК.Получить(Стр.Контейнер);
			//Если РезСоотв = Неопределено Тогда
			//	Продолжить;	
			//КонецЕсли;
			
			//ДИТ, Беляев СЮ, Ticket#0301354, 02-03-2023, начало
			РезСоотв = ТаблицаСчетов.Найти(Стр.ГУИД, "ГУИД");
			Если РезСоотв = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			//ДИТ, Беляев СЮ, Ticket#0301354, 02-03-2023, конец
			
			Если НЕ ЗначениеЗаполнено(Стр.СчетЖД) И ЗначениеЗаполнено(РезСоотв.СчетЖД) Тогда
				Стр.СчетЖД = РезСоотв.СчетЖД;
				НеобходимаЗаписьОбъекта = Истина;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Стр.СчетФрахт) И ЗначениеЗаполнено(РезСоотв.СчетФрахт) Тогда
				Стр.СчетФрахт = РезСоотв.СчетФрахт;
				НеобходимаЗаписьОбъекта = Истина;
			КонецЕсли;
			//Евросиб - АСуслов 22.09.2022 19:25:24 #56288
			//(
			//Если Стр.ВидТранспортногоСообщения = Перечисления.ВидыТранспортныхСообщений.Море
			//	И НЕ ЗначениеЗаполнено(Стр.СчетЖД) И ЗначениеЗаполнено(РезСоотв.СчетФрахт) Тогда
			//	Стр.СчетЖД = РезСоотв.СчетФрахт;
			//КонецЕсли;
			Если Стр.ВидТранспортногоСообщения = Перечисления.ВидыТранспортныхСообщений.Море Тогда
				Стр.СчетЖД = Стр.СчетФрахт;
			КонецЕсли;
			//)
			//Евросиб - АСуслов 22.09.2022 19:25:44 #56288
		КонецЦикла;
	КонецЕсли;                               
	Возврат НеобходимаЗаписьОбъекта;
КонецФункции  
//)
//Евросиб - АСуслов 26.01.2023 13:07:34 #59259

// Евросиб(ДИТ) BUG 84707 ТА 85256 Сержантова А.С. 01.07.2024
Процедура РегламентноеЗаданиеПодборАктуальныхИОчисткаАннулированныхЖДНвСделках() Экспорт
	
	//Порядок работы: 
	//	сначала отрабатывает ПодборЖДННакладныхВСделки, далее ОчисткаАннулированныхНакладныхИзСделок и далее снова ПодборЖДННакладныхВСделки.
	//Неоходимо для того, чтобы сначала произошла актуализация накладных в составе поезда сделки (подмена неактивных на аналогичные активные), 
	//далее произошло удаление из сделок оставшихся неактивных накладны, далее произошел подбор накладных.

    ПодборЖДННакладныхВСделки(0,"");    
	ОчисткаАннулированныхНакладныхИзСделок();
	ПодборЖДННакладныхВСделки(0,"");    

КонецПроцедуры

Функция ПерезаполнениеРейсовВЗаявке(Сделка,Заявка,НадоЗаписатьРейсыЗаявки = Ложь) Экспорт // Евросиб(ДИТ) Bug 96219 ТА 96254 Шевченко А.В. 26.11.2024
	
	ЗСсылка = Заявка.Ссылка;
	//ДИТ, Беляев СЮ, BUG 51934\TASK 57123, 05-04-2023, начало
	НадоЗаписать_РеестрКлиента = Ложь;
	НадоЗаписать_ВремяПрибытияНаТерминал = Ложь;    
	// Евросиб(ДИТ) US 88359 ТА 88360 Сержантова А.С. Начало: 16.07.2024 
	//Если по заявке из строки состава поезда удалили рейс, то удалим рейс из заявки  
	СтрокиСоставаПоезда = Сделка.СвязьУчетныхЕдиниц.НайтиСтроки(Новый Структура("Заявка", ЗСсылка)); 
	РейсыЗаявкиДоЗаписи = Новый Массив;
	
	МассивСтрокКУдалению = Новый Массив;
	Для Каждого СтрокаПереченьРейсов Из Заявка.ПереченьРейсов Цикл
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0380056, 17-12-2024, начало
		Если ТипЗнч(СтрокаПереченьРейсов.Рейс) <> Тип("СправочникСсылка.РейсыЖД") Тогда
			Продолжить;
		КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0380056, 17-12-2024, конец
		Если ЗначениеЗаполнено(СтрокаПереченьРейсов.Рейс) И СтрокаПереченьРейсов.Пользователь = Справочники.Пользователи.ПустаяСсылка() Тогда
			Если  Сделка.СвязьУчетныхЕдиниц.НайтиСтроки(Новый Структура("Заявка,ЖДРейс", ЗСсылка, СтрокаПереченьРейсов.Рейс)).Количество() = 0 Тогда
				МассивСтрокКУдалению.Добавить(СтрокаПереченьРейсов);	
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	
	Если МассивСтрокКУдалению.Количество() > 0 Тогда	
		Для Каждого СтрокаКУдалению Из МассивСтрокКУдалению Цикл
			Если ТипЗнч(Заявка) = Тип("ДокументОбъект.Заявка") Тогда
				Заявка.ПереченьРейсов.Удалить(СтрокаКУдалению);
			КонецЕсли;
			НадоЗаписатьРейсыЗаявки = Истина;
		КонецЦикла;				
	КонецЕсли;	
	
	// Евросиб(ДИТ) US 88359 ТА 88360 Сержантова А.С. Конец: 16.07.2024
	Для каждого СтрокаСУЕ из Сделка.СвязьУчетныхЕдиниц.НайтиСтроки(Новый Структура("Заявка", ЗСсылка)) Цикл 
		// Евросиб(ДИТ) US 88359 ТА 88360 Сержантова А.С. Начало: 16.07.2024
		// Добавляем рейсы в заявку
		Если ЗначениеЗаполнено(СтрокаСУЕ.ЖДРейс) и Сделка.Рейсы.Найти(СтрокаСУЕ.ЖДРейс) <> Неопределено 
			и Заявка.ПереченьРейсов.Найти(СтрокаСУЕ.ЖДРейс, "Рейс") = Неопределено Тогда
			Если ТипЗнч(Заявка) = Тип("ДокументОбъект.Заявка") Тогда
				СтрокаРейса = Заявка.ПереченьРейсов.Добавить(); 
				СтрокаРейса.Рейс = СтрокаСУЕ.ЖДРейс;  
				СтрокаРейса.Продукт = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаСУЕ.ЖДРейс, "Продукт");
			КонецЕсли;
			НадоЗаписатьРейсыЗаявки = Истина;
		КонецЕсли;
		// Евросиб(ДИТ) US 88359 ТА 88360 Сержантова А.С. Конец: 16.07.2024
		Если НЕ ЗначениеЗаполнено(СтрокаСУЕ.Коносамент) И НЕ ЗначениеЗаполнено(СтрокаСУЕ.ВремяПрибытияНаТерминал) Тогда 
			Продолжить; 
		КонецЕсли;
		Для каждого СтрокаЗаявки из Заявка.СоставУслуги.НайтиСтроки(Новый Структура("ГУИДСтроки", СтрокаСУЕ.ГУИДСтрокиЗаявки)) Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаЗаявки.НомерКТК) Тогда
				Продолжить;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрокаЗаявки.РеестрКлиента) И ЗначениеЗаполнено(СтрокаСУЕ.Коносамент.НомерТранспортногоДокумента) Тогда
				Если ТипЗнч(Заявка) = Тип("ДокументОбъект.Заявка") Тогда
					СтрокаЗаявки.РеестрКлиента = СтрокаСУЕ.Коносамент.НомерТранспортногоДокумента;
				КонецЕсли;
				НадоЗаписать_РеестрКлиента = Истина;					
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрокаЗаявки.ВремяПрибытияНаТерминал) И ЗначениеЗаполнено(СтрокаСУЕ.ВремяПрибытияНаТерминал) Тогда
				Если ТипЗнч(Заявка) = Тип("ДокументОбъект.Заявка") Тогда
					СтрокаЗаявки.ВремяПрибытияНаТерминал = СтрокаСУЕ.ВремяПрибытияНаТерминал;
				КонецЕсли;
				НадоЗаписать_ВремяПрибытияНаТерминал = Истина;					
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если НадоЗаписать_РеестрКлиента ИЛИ НадоЗаписать_ВремяПрибытияНаТерминал 
		// Евросиб(ДИТ) US 88359 ТА 88360 Сержантова А.С. Начало: 16.07.2024
		ИЛИ НадоЗаписатьРейсыЗаявки Тогда
		// Евросиб(ДИТ) US 88359 ТА 88360 Сержантова А.С. Конец: 16.07.2024
		Возврат Истина;
	КонецЕсли;
	//ДИТ, Беляев СЮ, BUG 51934\TASK 57123, 05-04-2023, конец
	
	Возврат Ложь;
	
КонецФункции	

//Евросиб Шевченко А.В. 15.05.2025 US 95275 TA 106445
Функция ПолучитьДополнениеУслугиСчета(НовСчет, ПараметрыФФД, ВыводитьКурс, РасчетСНП, Валюта) Экспорт
	
	Результат = "";
	
	Если ПараметрыФФД = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ПараметрыФФД.ТекстДополненияУслугиРТУ;
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	СтрокаКурса = "";
	
	Если ВыводитьКурс Тогда
		
		КурсВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта, НовСчет.ДатаКурса);
		
		СтрокаКурса = "Курс " + НовСчет.ВалютаДокумента + " / " + Валюта + " " + Формат(НовСчет.ДатаКурса,"ДФ=dd.MM.yyyy") + " " + КурсВалюты.Курс;
	КонецЕсли;
	
	СтрокаДатыСНП = "";
	
	Если ЗначениеЗаполнено(РасчетСНП) Тогда
		
		ДатаНачала = Дата(1,1,1);
		ДатаОкончания = Дата(1,1,1);
		
		Если ЗначениеЗаполнено(РасчетСНП.ДатаНачалаСНПРед) Тогда			
			ДатаНачала = РасчетСНП.ДатаНачалаСНПРед + (РасчетСНП.НормативныйСрок * 86400);			
		ИначеЕсли ЗначениеЗаполнено(РасчетСНП.ФактическаяДатаНачалаПоДаннымКлиента) Тогда			
			ДатаНачала = РасчетСНП.ФактическаяДатаНачалаПоДаннымКлиента + (РасчетСНП.НормативныйСрок * 86400);	
		ИначеЕсли ЗначениеЗаполнено(РасчетСНП.ФактическаяДатаНачалаПоДаннымПодрядчика) Тогда
			ДатаНачала = РасчетСНП.ФактическаяДатаНачалаПоДаннымПодрядчика + (РасчетСНП.НормативныйСрок * 86400);
		КонецЕсли;	
			
		Если ЗначениеЗаполнено(РасчетСНП.ДатаОкончанияСНПРед) Тогда			
			ДатаОкончания = РасчетСНП.ДатаОкончанияСНПРед;			
		ИначеЕсли ЗначениеЗаполнено(РасчетСНП.ФактическаяДатаОкончанияПоДаннымКлиента) Тогда			
			ДатаОкончания = РасчетСНП.ФактическаяДатаОкончанияПоДаннымКлиента;	
		ИначеЕсли ЗначениеЗаполнено(РасчетСНП.ФактическаяДатаОкончанияПоДаннымПодрядчика) Тогда
			ДатаОкончания = РасчетСНП.ФактическаяДатаОкончанияПоДаннымПодрядчика;
		КонецЕсли;
		
		СтрокаДатыСНП = "Даты СНП: " + Формат(ДатаНачала,"ДФ=dd.MM.yyyy") + " - " + Формат(ДатаОкончания,"ДФ=dd.MM.yyyy");			
	КонецЕсли;	
	
	ЗаменаСоответствие = Новый Соответствие;
	ЗаменаСоответствие.Вставить("##КурсВалютыДляСНП", СтрокаКурса);
	ЗаменаСоответствие.Вставить("##ДатыСНП", СтрокаДатыСНП);
	
	Для каждого Замена Из ЗаменаСоответствие Цикл
		Результат = СтрЗаменить(Результат, Замена.Ключ, Замена.Значение);	
	КонецЦикла;
	
	Результат = Символы.ПС + Результат; //добавим пробел
	
	Возврат Результат;
	
КонецФункции
//Евросиб Шевченко А.В. 15.05.2025 US 95275 TA 106445

//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, начало
Функция ПолучитьДополнениеУслугиОтчетаКомитенту(НовОтчет, ПараметрыФФД) Экспорт
	
	Результат = "";
	
	Если ПараметрыФФД = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ПараметрыФФД.ТекстДополненияУслугиОтчетКомитенту;
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	СтрокаТЧПоставщики = НовОтчет.Поставщики[0];
	
	ЗаменаСоответствие = Новый Соответствие;
	ЗаменаСоответствие.Вставить("##ДатаСФ", Формат(СтрокаТЧПоставщики.ДатаСФ,"ДФ=dd.MM.yyyy"));
	
	Для каждого Замена Из ЗаменаСоответствие Цикл
		Результат = СтрЗаменить(Результат, Замена.Ключ, Замена.Значение);	
	КонецЦикла;
	
	Результат = " "+Результат; //добавим пробел
	
	Возврат Результат;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, конец

Функция ПроверитьСтанцииОтправленияИНазначения(КодСтанцииНазначения, КодСтанцииОтправления)
	
	// Евросиб US 86202 TA 106817 Рыбьяков К.А. 12.05.2025 ((
	СредиСтанцийОтправленияНетСовпадений = Истина;
	
	ВсеКодыВсехАналоговСтанцииНазначения = Локации_сервер.ПолучитьКодыАналоговСтанцииПоКоду(КодСтанцииНазначения);
	ВсеКодыВсехАналоговСтанцииОтправления = Локации_сервер.ПолучитьКодыАналоговСтанцииПоКоду(КодСтанцииОтправления);

	Для Каждого КодСтанции Из ВсеКодыВсехАналоговСтанцииНазначения Цикл
		Если ВсеКодыВсехАналоговСтанцииОтправления.Найти(КодСтанции) <> Неопределено Тогда
			СредиСтанцийОтправленияНетСовпадений = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СредиСтанцийОтправленияНетСовпадений;
	
КонецФункции 	// Евросиб Рыбьяков К.А. 12.05.2025 ))
//Евросиб(ДИТ), Беляев СЮ, US 93521 / TA 94125, 13-12-2024, конец

// Евросиб US 114964 TA 114988 Рыбьяков К.А. 10.10.2025 ((
Функция СтрокаБылаДобавленаПрОбъединенииСделок(Строка, Сделка)
	
	Ответ = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("СтрокаСвязьУчетныхЕдиниц", Строка.СтрокаСвязьУчетныхЕдиниц);
	Отбор.Вставить("Услуга", Строка.Услуга);
	Отбор.Вставить("Контейнер", Строка.Контейнер);
	Отбор.Вставить("Вагон", Строка.Вагон);
	Отбор.Вставить("ТранспортныйДокумент", Строка.ТранспортныйДокумент);
	Отбор.Вставить("ИсточникПоявленияСтрокиЭкономики", Перечисления.ИсточникПоявленияСтрокиЭкономики.ОбъединениеПорожнейИГруженойСделок);
	Отбор.Вставить("УслугаОтключена", Ложь);
	НайденныеСтроки = Сделка.Расходы.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() = 1 Тогда
		Ответ = Истина;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции // Евросиб Рыбьяков К.А. 10.10.2025 ))


//Евросиб СубботинВ #124205 27.11.2025 Начало
Процедура ЗаполнитьПорожняяЖДНПослеПерегруза(ОбъектСделка, ГоризонтПоискаНакладныхПодсыла = 40) Экспорт
	
	//Евросиб СубботинВ #128108 19.01.2026 Начало 
	Отбор = Новый Структура("ФТГПослеПерегруза", Справочники.ТС.ПустаяСсылка());
	ТаблицаУЕ = ОбъектСделка.СвязьУчетныхЕдиниц;
	МассивСтрок = ТаблицаУЕ.НайтиСтроки(Отбор);
	Если МассивСтрок.Количество() = ТаблицаУЕ.Количество() Тогда
		Возврат
	Конецесли;
	//Евросиб СубботинВ #128108 19.01.2026 Конец	
	
	
	ДатаМин = Дата("00010101");
	ДатаМакс = Дата("00010101");
	
    ДанныеИзРейсовСделки = ПолучитьДанныеИзРейсовСделки(ОбъектСделка);
	ДатаМин = ДанныеИзРейсовСделки.ДатаМин;
	ДатаМакс = ДанныеИзРейсовСделки.ДатаМакс;
	МассивСтанцийНазначений = ДанныеИзРейсовСделки.МассивСтанцийНазначений;
    МассивСтанцийОтправления = ДанныеИзРейсовСделки.МассивСтанцийОтправления;
	

	
	Если ОбъектСделка.Рейсы.Количество() = 0 ИЛИ НЕ ЗначениеЗаполнено(ДатаМакс) ИЛИ НЕ ЗначениеЗаполнено(ДатаМин) Тогда		
		ОбщегоНазначения.СообщитьПользователю("Не подобран Документ ЖДН порожний, из-за отсутствия рейса после перегруза. Обратитесь к ответственному менеджеру для установления связи между рейсами с перегрузом в системе DX.");
		Для Каждого Стр из ТаблицаУЕ Цикл //Евросиб СубботинВ #128108 19.01.2026 Начало // поправил нейминг
			Если ЗначениеЗаполнено(Стр.ПорожняяЖДНПослеПерегруза) Тогда
				Стр.ПорожняяЖДНПослеПерегруза = Неопределено;
			КонецЕсли;	
		КонецЦикла;                            
		
		Возврат;
	КонецЕсли; 
	
	// определение маршрута
	ПунктОтправленияЪ = ?(ЗначениеЗаполнено(ОбъектСделка.ПогранпереходИзСтраныОтправления), ОбъектСделка.ПогранпереходИзСтраныОтправления, ОбъектСделка.СтанцияОтправления);
	ПунктНазначенияЪ = ?(ЗначениеЗаполнено(ОбъектСделка.ПогранпереходВСтрануНазначения), ОбъектСделка.ПогранпереходВСтрануНазначения, ОбъектСделка.СтанцияНазначения);
	МассивСтанцийОтправления.Добавить(ПунктОтправленияЪ);
	МассивСтанцийНазначений.Добавить(ПунктНазначенияЪ);
	
	МинДатаЪ = ДатаМин - ГоризонтПоискаНакладныхПодсыла*24*3600;
	МаксДатаЪ = ДатаМакс + ГоризонтПоискаНакладныхПодсыла*24*3600;

	Для Каждого Стр из ТаблицаУЕ Цикл //Евросиб СубботинВ #128108 19.01.2026 Начало // поправил нейминг
		Если ЗначениеЗаполнено(Стр.ЖДН) Тогда
			ДатаОтпр = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.ЖДН, "ДатаОтправления");
			МаксДатаЪ = ДатаОтпр - 1; 
			МинДатаЪ = МаксДатаЪ - ГоризонтПоискаНакладныхПодсыла*24*3600;
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(Стр.ФТГПослеПерегруза) Тогда 
			ДатаИВремяРаскредитованияГруза = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.ЖДН.НакладнаяЭТРАН, "ДатаИВремяРаскредитованияГруза");
			СтруктураЖДНПодсылВагонов = НайтиПодсылПорожнегоВагонаПоЭТРАННовыйАлгоритм(Стр.ФТГПослеПерегруза.Наименование, МаксДатаЪ, МассивСтанцийНазначений, ГоризонтПоискаНакладныхПодсыла,,,,,ДатаИВремяРаскредитованияГруза );
			ЖДНПослеПерегруз = СтруктураЖДНПодсылВагонов.НакладнаяПодсылаВагонаСсылка;
			Если ЗначениеЗаполнено(ЖДНПослеПерегруз) Тогда
				Стр.ПорожняяЖДНПослеПерегруза = ПолучитьТДПоНакладнойЭтран(ЖДНПослеПерегруз); 
			КонецЕсли; 
		Иначе
		    Стр.ПорожняяЖДНПослеПерегруза = Неопределено;
		КонецЕсли;
	КонецЦикла;	
		
КонецПроцедуры
//Евросиб СубботинВ #124205 27.11.2025 Конец
