
&НаКлиенте
Процедура ЗаполнитьШаблоном(Команда)
	
	Объект.ПараметрыРейтинга.Очистить();
	Объект.ПараметрыРейтинга.Добавить().Аналитика = ПредопределенноеЗначение("Перечисление.АналитикиРейтингаКлиентов.СуммаДебиторскойЗадолженности");
	Объект.ПараметрыРейтинга.Добавить().Аналитика = ПредопределенноеЗначение("Перечисление.АналитикиРейтингаКлиентов.ДоляПДЗВСреднемесячнойВыручке");
	Объект.ПараметрыРейтинга.Добавить().Аналитика = ПредопределенноеЗначение("Перечисление.АналитикиРейтингаКлиентов.КоличествоДнейОтСчетаНаОплату");
	Объект.ПараметрыРейтинга.Добавить().Аналитика = ПредопределенноеЗначение("Перечисление.АналитикиРейтингаКлиентов.СводныйРискСПАРК");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого СтрокаТаблицыПараметров Из Объект.ПараметрыРейтинга Цикл
		
		Получатели = Объект.ПолучателиУведомлений.Выгрузить(Новый Структура("Аналитика, УровеньРиска", СтрокаТаблицыПараметров.Аналитика, Перечисления.СПАРКЗначенияРисков.Средний), "ПолучательУведомления").ВыгрузитьКолонку("ПолучательУведомления");
		СтрокаТаблицыПараметров.ПолучателиУведомленийЖелтойЗоны.ЗагрузитьЗначения(Получатели);
		
		Получатели = Объект.ПолучателиУведомлений.Выгрузить(Новый Структура("Аналитика, УровеньРиска", СтрокаТаблицыПараметров.Аналитика, Перечисления.СПАРКЗначенияРисков.Высокий), "ПолучательУведомления").ВыгрузитьКолонку("ПолучательУведомления");
		СтрокаТаблицыПараметров.ПолучателиУведомленийКраснойЗоны.ЗагрузитьЗначения(Получатели);		
		
	КонецЦикла;
	
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )



&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПолучателиУведомлений = ТекущийОбъект.ПолучателиУведомлений;
	ПолучателиУведомлений.Очистить();
	
	Для Каждого СтрокаТаблицыПараметров Из Объект.ПараметрыРейтинга Цикл
		
		Для Каждого Получатель Из СтрокаТаблицыПараметров.ПолучателиУведомленийЖелтойЗоны Цикл
			НоваяСтрокаПолучателя = ПолучателиУведомлений.Добавить();
			НоваяСтрокаПолучателя.Аналитика = СтрокаТаблицыПараметров.Аналитика;
			НоваяСтрокаПолучателя.УровеньРиска = Перечисления.СПАРКЗначенияРисков.Средний;
			НоваяСтрокаПолучателя.ПолучательУведомления = Получатель.Значение;
		КонецЦикла;
		
		Для Каждого Получатель Из СтрокаТаблицыПараметров.ПолучателиУведомленийКраснойЗоны Цикл
			НоваяСтрокаПолучателя = ПолучателиУведомлений.Добавить();
			НоваяСтрокаПолучателя.Аналитика = СтрокаТаблицыПараметров.Аналитика;
			НоваяСтрокаПолучателя.УровеньРиска = Перечисления.СПАРКЗначенияРисков.Высокий;
			НоваяСтрокаПолучателя.ПолучательУведомления = Получатель.Значение;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыРейтингаПолучателиУведомленийЖелтойЗоныНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Элементы.ПараметрыРейтинга.ТекущиеДанные.ПолучателиУведомленийЖелтойЗоны.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Пользователи, СправочникСсылка.ГруппыПользователей");
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыРейтингаПолучателиУведомленийКраснойЗоныНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Элементы.ПараметрыРейтинга.ТекущиеДанные.ПолучателиУведомленийКраснойЗоны.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Пользователи, СправочникСсылка.ГруппыПользователей");
		
КонецПроцедуры
