Функция ПолучитьТСхОбъекта(Объект, Вариант = Неопределено) Экспорт
	
	Результат = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(Объект) Тогда Возврат Результат; КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТехнологическаяСхема.ТСх КАК ТСх,
	               |	ТехнологическаяСхема.Вариант КАК Вариант
	               |ИЗ
	               |	РегистрСведений.ТехнологическаяСхема КАК ТехнологическаяСхема
	               |ГДЕ
	               |	ТехнологическаяСхема.ПредметТСх = &ПредметТСх
	               |	И НЕ ТехнологическаяСхема.ТСх.ПометкаУдаления";
//Евросиб Гудкова( 14.11.2019 Ticket№ 
	Если ЗначениеЗаполнено(Вариант) Тогда
		Запрос.УстановитьПараметр("Вариант", Вариант);
		Запрос.Текст = Запрос.Текст + "
	               |	И ТехнологическаяСхема.Вариант = &Вариант";
	КонецЕсли; 
// Евросиб Гудкова) 	
	Запрос.УстановитьПараметр("ПредметТСх", Объект);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		Результат.Добавить(Новый Структура("ТСх, Вариант", Ответ.ТСх, Ответ.Вариант));
	КонецЦикла;
	
	Если Результат.Количество() = 0 Тогда
		Результат.Добавить(Новый Структура("ТСх, Вариант", неопределено, "Основной"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура Удалить_ТСх(СсылкаТСх) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СсылкаТСх) тогда Возврат; КонецЕсли;
	
	ОО = СсылкаТСх.ПолучитьОбъект();
	ОО.ПометкаУдаления = Истина;
	ОО.Записать();
	Для каждого Стр из ОО.ТЧ Цикл
		Если ЗначениеЗаполнено(Стр.Операция) Тогда  
			ОО2 = Стр.Операция.ПолучитьОбъект();
			ОО2.ПометкаУдаления = Истина;
			ОО2.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьОперацию(Параметры) Экспорт
	
	Возврат Документы.Операция.СоздатьОперациюПоПараметрам(Параметры);
	
КонецФункции

Функция СкопироватьТСх(Источник) Экспорт
	
	Результат = Источник.Скопировать();
	Для каждого Стр из Результат.ТЧ Цикл
		Если ЗначениеЗаполнено(Стр.Операция) Тогда
			НОбъект = СкопироватьОперацию(Стр.Операция);
			НОбъект.Дата = Стр.Операция.дата;
			НОбъект.записать(РежимЗаписиДокумента.Запись);
			Попытка
				НОбъект.записать(РежимЗаписиДокумента.Проведение);
			Исключение
			КонецПопытки;
			Стр.Операция = НОбъект.ссылка;
		КонецЕсли;
	КонецЦикла;
	Результат.Записать();
	Возврат Результат.Ссылка;
	
КонецФункции

Функция СкопироватьОперацию(Источник) Экспорт
	
	Результат = Источник.Скопировать();
	
	Возврат Результат;
	
КонецФункции

Процедура ПереименоватьТСх(Объект, СтароеИмя, НовоеИмя, ТСх) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	*
	               |ИЗ
	               |	РегистрСведений.ТехнологическаяСхема КАК ТехнологическаяСхема
	               |ГДЕ
	               |	ТехнологическаяСхема.ПредметТСх = &ПредметТСх
	               |	И ТехнологическаяСхема.Вариант = &Вариант";
	Запрос.УстановитьПараметр("ПредметТСх", Объект);
	Запрос.УстановитьПараметр("Вариант", СтароеИмя);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		МЗ = РегистрыСведений.ТехнологическаяСхема.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, Ответ);
		МЗ.Удалить();
		
		МЗ = РегистрыСведений.ТехнологическаяСхема.СоздатьМенеджерЗаписи();
		МЗ.Период = ТекущаяДата();
		МЗ.ПредметТСх = Объект;
		МЗ.ТСх = ТСх;
		МЗ.Вариант = НовоеИмя;
		МЗ.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

Функция ПодобратьПроизводственныйКалендарь(Контрагент, Номенклатура) Экспорт
	
	Результат = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СвязьПроизводственныхКалендарейИВидовОпераций.Календарь КАК Календарь
	               |ИЗ
	               |	РегистрСведений.СвязьПроизводственныхКалендарейИВидовОпераций КАК СвязьПроизводственныхКалендарейИВидовОпераций
	               |ГДЕ
	               |	(СвязьПроизводственныхКалендарейИВидовОпераций.ВидОперации = &ВидОперации
	               |			ИЛИ СвязьПроизводственныхКалендарейИВидовОпераций.ВидОперации = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	               |	И (СвязьПроизводственныхКалендарейИВидовОпераций.Контрагент = &Контрагент
	               |			ИЛИ СвязьПроизводственныхКалендарейИВидовОпераций.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СвязьПроизводственныхКалендарейИВидовОпераций.Контрагент УБЫВ,
	               |	СвязьПроизводственныхКалендарейИВидовОпераций.ВидОперации УБЫВ";
	Запрос.УстановитьПараметр("ВидОперации", Номенклатура);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Календарь;
	КонецЕсли;
	
	Возврат Результат;	
	
КонецФункции