
&НаКлиенте
Процедура Заполнить(Команда)
	Для каждого СТрока из ТЗ Цикл
		СТрока.ДатаИВремяПрибытия = ДатаИВремяПрибытия;
		Строка.ДатаИВремяРаскредитованияГруза = ДатаИВремяРаскредитованияГруза;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	ПеренестиВДокументНаСервере();
	ОповеститьОбИзменении(Тип("ДокументСсылка.э_Накладная"));
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Сделка") Тогда
		Сделка = Параметры.Сделка;
	КонецЕсли;
	
	Если НЕ Сделка = Документы.Сделка.ПустаяСсылка() Тогда
		Для каждого СтрокаСвязи из Сделка.СвязьУчетныхЕдиниц Цикл 
			Попытка
				Если НЕ ЗначениеЗаполнено(СтрокаСвязи.ЖДН.НакладнаяЭТРАН.ДатаИВремяПрибытияГруза) ИЛИ НЕ ЗначениеЗаполнено(СтрокаСвязи.ЖДН.НакладнаяЭТРАН.ДатаИВремяРаскредитованияГруза) Тогда
					НоваяСтрока = ТЗ.Добавить();
					НоваяСтрока.ЖДНакладная = СтрокаСвязи.ЖДН;
					НоваяСтрока.Вагон = СтрокаСвязи.Вагон;
					НоваяСтрока.НомерКТК = СтрокаСвязи.Контейнер;
					НоваяСтрока.ДатаИВремяПрибытия = СтрокаСвязи.ЖДН.НакладнаяЭТРАН.ДатаИВремяПрибытияГруза;
					НоваяСтрока.ДатаИВремяРаскредитованияГруза = СтрокаСвязи.ЖДН.НакладнаяЭТРАН.ДатаИВремяРаскредитованияГруза;
				КонецЕсли;
			Исключение
				Если НЕ ЗначениеЗаполнено(СтрокаСвязи.ЖДН) Тогда
					Сообщить("В строке "+СтрокаСвязи.НомерСтроки+" не установлена ЖДН!");
				ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаСвязи.ЖДН.НакладнаяЭТРАН) Тогда
					Сообщить("В ЖДН "+СтрокаСвязи.ЖДН+" не задана НакладнаяЭТРАН!");
				КонецЕсли;
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаСервере
Процедура ПеренестиВДокументНаСервере()
	Для каждого СтрокаТЗ из ТЗ Цикл
		Если ЗначениеЗаполнено(СтрокаТЗ.ЖДНакладная) Тогда
			НакладнаяЭТРАН = СтрокаТЗ.ЖДНакладная.НакладнаяЭТРАН.ПолучитьОбъект();
			НакладнаяЭТРАН.ДатаИВремяПрибытияГруза = СтрокаТЗ.ДатаИВремяПрибытия;
			НакладнаяЭТРАН.ДатаИВремяРаскредитованияГруза = СтрокаТЗ.ДатаИВремяРаскредитованияГруза;
			НакладнаяЭТРАН.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры