#Область ПрограммныйИнтерфейс

// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиент

// Позволяет определить есть ли в табличной части документа строки с одинаковыми
// значениями заданных реквизитов (всех одновременно).
// При нахождении дублей формирует сообщения пользователю.
//
// Параметры
//  Объект            - Объект ссылочного типа
//  ИмяТабличнойЧасти - Имя табличной части, в которой нужно искать дубли
//  ПоляПроверки      - Структура с перечнем реквизитов, по которым нужно искать дубли.
//                      Ключ структуры - имя реквизита, значение - признак необходимости
//                      поиска дублей в том числе по пустым значениям. Истина - искать
//                      дубли по пустым значениям реквизита, любое другое значение - 
//                      игнорировать строки, в которых реквизит не заполнен
//  Отказ             - Признак отказа от дальнейшей обработки. В случае нахождения дублей
//                      выставляется в Истина.
//
// Возвращаемое значение:
//   Булево - Истина - ошибок (дублей) не обнаружено, Ложь - в противном случае.
//
Функция ПроверитьОтсутствиеДублейВТабличнойЧасти(Объект, ИмяТабличнойЧасти, ПоляПроверки, Отказ) Экспорт
	
	СтруктураОтбора = Новый Структура;
	
	ПоляПроверкиСтрокой = "";
	Для Каждого КлючИЗначение Из ПоляПроверки Цикл
		ПоляПроверкиСтрокой = ПоляПроверкиСтрокой + ", " + КлючИЗначение.Ключ;
		СтруктураОтбора.Вставить(КлючИЗначение.Ключ);
	КонецЦикла;
	ПоляПроверкиСтрокой = Сред(ПоляПроверкиСтрокой, 3);
	
	НаборыЗначений = Объект[ИмяТабличнойЧасти].Выгрузить(, ПоляПроверкиСтрокой);
	НаборыЗначений.Колонки.Добавить("__КоличествоВхождений", ОбщегоНазначения.ОписаниеТипаЧисло(10));
	НаборыЗначений.ЗаполнитьЗначения(1, "__КоличествоВхождений");
	НаборыЗначений.Свернуть(ПоляПроверкиСтрокой, "__КоличествоВхождений");
	
	НайденыДубли = Ложь;
	
	Если ПоляПроверки.Количество() > 1 Тогда
		ШаблонСообщенияОбОшибке = НСтр("ru = 'Значения %1 повторяются в строках %2.'");
	Иначе
		ШаблонСообщенияОбОшибке = НСтр("ru = 'Значение %1 повторяется в строках %2.'");
	КонецЕсли;
	ТекстСообщения = "";
	
	Если НаборыЗначений.Количество() <> Объект[ИмяТабличнойЧасти].Количество() Тогда
		// Есть дубли
		Для Каждого НаборЗначений Из НаборыЗначений Цикл
			Если НаборЗначений.__КоличествоВхождений = 1 Тогда
				Продолжить;
			КонецЕсли;
			
			ЗначенияСтрокой = "";
			
			ПропуститьНаборЗначений = Ложь;
			Для Каждого КлючИЗначение Из ПоляПроверки Цикл
				Если КлючИЗначение.Значение <> Истина Тогда
					Если НЕ ЗначениеЗаполнено(НаборЗначений[КлючИЗначение.Ключ]) Тогда
						ПропуститьНаборЗначений = Истина;
						Прервать;
					КонецЕсли;
				КонецЕсли;
				
				ЗначенияСтрокой = ЗначенияСтрокой + ", """ + НаборЗначений[КлючИЗначение.Ключ] + """";
			КонецЦикла;
			Если ПропуститьНаборЗначений Тогда
				Продолжить;
			КонецЕсли;
			
			НайденыДубли = Истина;
			
			ЗначенияСтрокой = Сред(ЗначенияСтрокой, 3);
			
			НомераСтрок = "";
			ЗаполнитьЗначенияСвойств(СтруктураОтбора, НаборЗначений);
			СтрокиДубли = Объект[ИмяТабличнойЧасти].НайтиСтроки(СтруктураОтбора);
			Для Каждого СтрокаДубль Из СтрокиДубли Цикл
				НомераСтрок = НомераСтрок + ", " + Формат(СтрокаДубль.НомерСтроки, "ЧГ=");
			КонецЦикла;
			НомераСтрок = Сред(НомераСтрок, 3);
			
			ТекстСообщения = ТекстСообщения + Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонСообщенияОбОшибке, ЗначенияСтрокой, НомераСтрок);
		КонецЦикла;
	КонецЕсли;
	
	Если НайденыДубли Тогда
		ПредставленияРеквизитов = "";
		МетаданныеТабличнойЧасти = Объект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти];
		Для Каждого КлючИЗначение Из ПоляПроверки Цикл
			ПредставленияРеквизитов = ПредставленияРеквизитов + ", """
				+ МетаданныеТабличнойЧасти.Реквизиты[КлючИЗначение.Ключ].Представление() + """";
		КонецЦикла;
		ПредставленияРеквизитов = Сред(ПредставленияРеквизитов, 3);
		
		Если ПоляПроверки.Количество() > 1 Тогда
			ШаблонСообщения = НСтр("ru = 'Значения в колонках %1 не должны повторяться.'");
		Иначе
			ШаблонСообщения = НСтр("ru = 'Значения в колонке %1 не должны повторяться.'");
		КонецЕсли;
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, ПредставленияРеквизитов)
			+ ТекстСообщения;
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("СПИСОК", "КОРРЕКТНОСТЬ", , ,
			МетаданныеТабличнойЧасти.Представление(), ТекстСообщения);
			
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект, ИмяТабличнойЧасти);
		
		Отказ = Истина;
	КонецЕсли;
	
	Возврат НЕ НайденыДубли;
	
КонецФункции

// Евросиб Фролов)

// Евросиб Фролов (02.03.2022 TASK№ №46354

// Позволяет определить есть ли в табличной части документа строки с одинаковыми
// значениями заданных реквизитов (всех одновременно).
// При нахождении дублей формирует сообщения пользователю.
//
// Параметры
//  Объект            - Объект ссылочного типа
//  ИмяТабличнойЧасти - Имя табличной части, в которой нужно искать дубли
//  ПоляПроверки      - Структура с перечнем реквизитов, по которым нужно искать дубли.
//                      Ключ структуры - имя реквизита, значение - признак необходимости
//                      поиска дублей в том числе по пустым значениям. Истина - искать
//                      дубли по пустым значениям реквизита, любое другое значение - 
//                      игнорировать строки, в которых реквизит не заполнен
//  Отказ             - Признак отказа от дальнейшей обработки. В случае нахождения дублей
//                      выставляется в Истина.
//
// Возвращаемое значение:
//   Булево - Истина - ошибок (дублей) не обнаружено, Ложь - в противном случае.
//
Функция ПроверитьОтсутствиеДублейВТабличныхЧастяхВсехОбъектов(Объект, ИмяТабличнойЧасти, ПоляПроверки, УточнениеПоиска, Отказ) Экспорт
	
	СтруктураОтбора = Новый Структура;
	
	ПоляПроверкиСтрокой = "";
	Для Каждого КлючИЗначение Из ПоляПроверки Цикл
		ПоляПроверкиСтрокой = ПоляПроверкиСтрокой + ", " + КлючИЗначение.Ключ;
		СтруктураОтбора.Вставить(КлючИЗначение.Ключ);
	КонецЦикла;
	ПоляПроверкиСтрокой = Сред(ПоляПроверкиСтрокой, 3);
	
	Запрос = Новый Запрос;
	
	/////////////
	ПолноеИмяОбъектаМетаданных = Объект.Метаданные().ПолноеИмя() + "." + ИмяТабличнойЧасти;
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&Реквизиты,
	|	1 КАК __КоличествоВхождений
	|ИЗ
	|	&ПолноеИмяОбъектаМетаданных КАК Таблица
	|ГДЕ
	|	НЕ Таблица.Ссылка.ПометкаУдаления
	|	И Таблица.Ссылка <> &Ссылка";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Реквизиты", ПоляПроверкиСтрокой);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолноеИмяОбъектаМетаданных", ПолноеИмяОбъектаМетаданных);
	
	Для Каждого КлюЗначениеУточнения Из УточнениеПоиска Цикл
		ТекстЗапроса = ТекстЗапроса + " И Таблица.Ссылка." + КлюЗначениеУточнения.Ключ + " = &" + КлюЗначениеУточнения.Ключ;
		Запрос.УстановитьПараметр(КлюЗначениеУточнения.Ключ, КлюЗначениеУточнения.Значение);
	КонецЦикла;	
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Запрос.Текст = ТекстЗапроса;
	НаборыЗначений = Запрос.Выполнить().Выгрузить();
	/////////////
	
	//НаборыЗначений = Объект[ИмяТабличнойЧасти].Выгрузить(, ПоляПроверкиСтрокой);
	//НаборыЗначений.Колонки.Добавить("__КоличествоВхождений", ОбщегоНазначения.ОписаниеТипаЧисло(10));
	//НаборыЗначений.ЗаполнитьЗначения(1, "__КоличествоВхождений");
	
	Для Каждого ТекСтрока Из Объект[ИмяТабличнойЧасти] Цикл	
		НоваяСтрока = НаборыЗначений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		НоваяСтрока.__КоличествоВхождений = 1;
	КонецЦикла;	
	
	ИсходноеКоличествоСрок = НаборыЗначений.Количество();
	НаборыЗначений.Свернуть(ПоляПроверкиСтрокой, "__КоличествоВхождений");
	
	НайденыДубли = Ложь;
	
	Если ПоляПроверки.Количество() > 1 Тогда
		//ШаблонСообщенияОбОшибке = НСтр("ru = 'Значения %1 повторяются в строках %2.'");
		ШаблонСообщенияОбОшибке = НСтр("ru = 'Значения %1 в строках %2 найдены в других элементах.'");
	Иначе
		//ШаблонСообщенияОбОшибке = НСтр("ru = 'Значение %1 повторяется в строках %2.'");
		ШаблонСообщенияОбОшибке = НСтр("ru = 'Значение %1 в строках %2 найдены в других элементах.'");
	КонецЕсли;
	ТекстСообщения = "";
	
	//Если НаборыЗначений.Количество() <> Объект[ИмяТабличнойЧасти].Количество() Тогда
	Если НаборыЗначений.Количество() <> ИсходноеКоличествоСрок Тогда
		// Есть дубли
		Для Каждого НаборЗначений Из НаборыЗначений Цикл
			Если НаборЗначений.__КоличествоВхождений = 1 Тогда
				Продолжить;
			КонецЕсли;
			
			ЗначенияСтрокой = "";
			
			ПропуститьНаборЗначений = Ложь;
			Для Каждого КлючИЗначение Из ПоляПроверки Цикл
				Если КлючИЗначение.Значение <> Истина Тогда
					Если НЕ ЗначениеЗаполнено(НаборЗначений[КлючИЗначение.Ключ]) Тогда
						ПропуститьНаборЗначений = Истина;
						Прервать;
					КонецЕсли;
				КонецЕсли;
				
				ЗначенияСтрокой = ЗначенияСтрокой + ", """ + НаборЗначений[КлючИЗначение.Ключ] + """";
			КонецЦикла;
			Если ПропуститьНаборЗначений Тогда
				Продолжить;
			КонецЕсли;
			
			НайденыДубли = Истина;
			
			ЗначенияСтрокой = Сред(ЗначенияСтрокой, 3);
			
			НомераСтрок = "";
			ЗаполнитьЗначенияСвойств(СтруктураОтбора, НаборЗначений);
			СтрокиДубли = Объект[ИмяТабличнойЧасти].НайтиСтроки(СтруктураОтбора);
			Для Каждого СтрокаДубль Из СтрокиДубли Цикл
				НомераСтрок = НомераСтрок + ", " + Формат(СтрокаДубль.НомерСтроки, "ЧГ=");
			КонецЦикла;
			НомераСтрок = Сред(НомераСтрок, 3);
			
			ТекстСообщения = ТекстСообщения + Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонСообщенияОбОшибке, ЗначенияСтрокой, НомераСтрок);
		КонецЦикла;
	КонецЕсли;
	
	Если НайденыДубли Тогда
		ПредставленияРеквизитов = "";
		МетаданныеТабличнойЧасти = Объект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти];
		Для Каждого КлючИЗначение Из ПоляПроверки Цикл
			ПредставленияРеквизитов = ПредставленияРеквизитов + ", """
				+ МетаданныеТабличнойЧасти.Реквизиты[КлючИЗначение.Ключ].Представление() + """";
		КонецЦикла;
		ПредставленияРеквизитов = Сред(ПредставленияРеквизитов, 3);
		
		Если ПоляПроверки.Количество() > 1 Тогда
			ШаблонСообщения = НСтр("ru = 'Значения в колонках %1 не должны повторяться в других элементах.'");
		Иначе
			ШаблонСообщения = НСтр("ru = 'Значения в колонке %1 не должны повторяться в других элементах.'");
		КонецЕсли;
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, ПредставленияРеквизитов)
			+ ТекстСообщения;
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("СПИСОК", "КОРРЕКТНОСТЬ", , ,
			МетаданныеТабличнойЧасти.Представление(), ТекстСообщения);
			
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект, ИмяТабличнойЧасти);
		
		Отказ = Истина;
	КонецЕсли;
	
	Возврат НЕ НайденыДубли;
	
КонецФункции	
// Евросиб Фролов)

// Евросиб Фролов (15.03.2022 Task №40571
Процедура ПроверитьКоличествоВТабличнойЧасти(ТабличнаяЧасть, СинонимТабличнойЧасти, Отказ, СписокРеквизитов = Неопределено, ЭтотОбъект) Экспорт

	Если СписокРеквизитов = Неопределено Тогда
		СписокРеквизитов = "Количество";
	КонецЕсли;	
	
	МассивРеквизитов = СтрРазделить(СписокРеквизитов, ",", Ложь);
	Для Индекс = 0 По МассивРеквизитов.Количество() - 1 Цикл
		МассивРеквизитов[Индекс] = СокрЛП(МассивРеквизитов[Индекс]);
	КонецЦикла;	
	
	МассивЕдиницИзмерений = ТабличнаяЧасть.Выгрузить().ВыгрузитьКолонку("ЕдиницаИзмерения");
	ТолькоЦелоеКоличество = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивЕдиницИзмерений, "ТолькоЦелое");

	ЧастиПутиКТабличнойЧасти = СтрРазделить(Строка(ТабличнаяЧасть), ".");
	ИмяТаблинойЧасти = ЧастиПутиКТабличнойЧасти[ЧастиПутиКТабличнойЧасти.Количество() - 1];
	
	Для Каждого ТекущаяСтрока Из ТабличнаяЧасть Цикл
		
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.ЕдиницаИзмерения) Тогда
			Продолжить;
		КонецЕсли;	
		
		ТолькоЦелое = ТолькоЦелоеКоличество.Получить(ТекущаяСтрока.ЕдиницаИзмерения);
		
		Если ТолькоЦелое Тогда
			
			ШаблонСообщения = "В строке %1 списка ""%2"" для единицы измерения ""%3"" разрешено вводить только целое количество.
																	|Необходимо исправить введенное значение (%4 %5) на целое число.";
			
			Для Каждого ТекущийРеквизит Из МассивРеквизитов Цикл
				Если Цел(ТекущаяСтрока[ТекущийРеквизит]) <> ТекущаяСтрока[ТекущийРеквизит] Тогда
					ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекущаяСтрока.НомерСтроки, СинонимТабличнойЧасти, ТекущаяСтрока.ЕдиницаИзмерения, ТекущаяСтрока.Количество, ТекущаяСтрока.ЕдиницаИзмерения);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
																ТекстСообщения,
																ЭтотОбъект,
																ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТаблинойЧасти, ТекущаяСтрока.НомерСтроки, ТекущийРеквизит),
																,
																Отказ);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры
// Евросиб Фролов)

#КонецОбласти
