&НаКлиенте
Процедура ОбновитьПараметрыФильтров()
	
	Список.Параметры.УстановитьЗначениеПараметра("ОтборОтправлениеУстановлен", ЗначениеЗаполнено(ПланОтправления.ДатаНачала));
	Список.Параметры.УстановитьЗначениеПараметра("Отправление1", ПланОтправления.ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("Отправление2", ПланОтправления.ДатаОкончания);
	Список.Параметры.УстановитьЗначениеПараметра("ОтборПрибытиеУстановлен", ЗначениеЗаполнено(ПланПрибытия.ДатаНачала));
	Список.Параметры.УстановитьЗначениеПараметра("Прибытие1", ПланПрибытия.ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("Прибытие2", ПланПрибытия.ДатаОкончания);
	
	//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, начало
	Список.Параметры.УстановитьЗначениеПараметра("РежимОтображенияЗаявок", РежимОтображенияЗаявок);
	//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, конец
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("ОтборОтправлениеУстановлен", ЗначениеЗаполнено(ПланОтправления.ДатаНачала));
	Список.Параметры.УстановитьЗначениеПараметра("Отправление1", ПланОтправления.ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("Отправление2", ПланОтправления.ДатаОкончания);
	Список.Параметры.УстановитьЗначениеПараметра("ОтборПрибытиеУстановлен", ЗначениеЗаполнено(ПланПрибытия.ДатаНачала));
	Список.Параметры.УстановитьЗначениеПараметра("Прибытие1", ПланПрибытия.ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("Прибытие2", ПланПрибытия.ДатаОкончания);
	
	////Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, начало
	//Список.Параметры.УстановитьЗначениеПараметра("РежимОтображенияЗаявок", РежимОтображенияЗаявок);
	//Элементы.РежимОтображенияЗаявок.Видимость = РольДоступна("ПолныеПрава");
	////Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, конец  
	//
	////Евросиб Коханенко Н.А. 23.06.2025 (( #103831 
	//Если НЕ РольДоступна("ПолныеПрава") Тогда
	//    Список.Параметры.УстановитьЗначениеПараметра("ФильтрТолькоБезПризнакаЛКК", Истина);
	//Иначе	
	//    Список.Параметры.УстановитьЗначениеПараметра("ФильтрТолькоБезПризнакаЛКК", Ложь);
	//КонецЕсли;
	////Евросиб Коханенко Н.А. 23.06.2025 )) #103831
	
	//Евросиб(ДИТ), Беляев СЮ, US 101347 / TA 114688, 15-07-2025, начало
	ДоступныЗаявкиЛК = РольДоступна("ПолныеПрава") ИЛИ РольДоступна("dc_РазрешитьРедактированиеЗаявокИзЛК");
	Список.Параметры.УстановитьЗначениеПараметра("РежимОтображенияЗаявок", РежимОтображенияЗаявок);
	Элементы.РежимОтображенияЗаявок.Видимость = ДоступныЗаявкиЛК;
	Список.Параметры.УстановитьЗначениеПараметра("ФильтрТолькоБезПризнакаЛКК", НЕ ДоступныЗаявкиЛК);
	//Евросиб(ДИТ), Беляев СЮ, US 101347 / TA 114688, 15-07-2025, конец
	
	//Евросиб(ДИТ), Беляев СЮ, US 87367/TA 88267, 14-08-2024, начало (закомментировал блок кода, перенес запрос в динамический список)
	//УскоритьРаботуФормыПутемОтключенияЧастиКолонок = ХранилищеОбщихНастроек.Загрузить("Заявка", "УскоритьРаботуФормыПутемОтключенияЧастиКолонок"); 
	//
	//НовыйТекстЗапроса = "ВЫБРАТЬ
	//                    |	ДокументЗаявка.Ссылка КАК Ссылка,
	//                    |	ДокументЗаявка.ПометкаУдаления КАК ПометкаУдаления,
	//                    |	ДокументЗаявка.Номер КАК Номер,
	//                    |	ДокументЗаявка.Дата КАК Дата,
	//                    |	ДокументЗаявка.Проведен КАК Проведен,
	//                    |	ДокументЗаявка.Автор КАК Автор,
	//                    |	ДокументЗаявка.Изменено КАК Изменено,
	//                    |	ДокументЗаявка.Комментарий КАК Комментарий,
	//                    |	ДокументЗаявка.Редактор КАК Редактор,
	//                    |	ДокументЗаявка.Создано КАК Создано,
	//                    |	ДокументЗаявка.Контрагент КАК Контрагент,
	//                    |	ДокументЗаявка.Договор КАК Договор,
	//                    |	ДокументЗаявка.ПСЦ КАК ПСЦ,
	//                    |	ДокументЗаявка.КонтактноеЛицо КАК КонтактноеЛицо,
	//                    |	ЕСТЬNULL(ДатыОтправленияРейсовЗаявок.ДатаОтправления, ДокументЗаявка.Отправка) КАК Отправка,
	//                    |	ЕСТЬNULL(ДатыОтправленияРейсовЗаявок.ДатаПрибытия, ДокументЗаявка.Прибытие) КАК Прибытие,
	//                    |	ДокументЗаявка.ВнешнийНомер КАК ВнешнийНомер,
	//                    |	ДокументЗаявка.ВнешняяДата КАК ВнешняяДата,
	//                    |	ДокументЗаявка.ОтветственныйМенеджер КАК ОтветственныйМенеджер,
	//                    |	ДокументЗаявка.Организация КАК Организация,
	//                    |	ДокументЗаявка.КраткоеОписаниеГруза КАК КраткоеОписаниеГруза,
	//                    |	ДокументЗаявка.КоличествоКТК20 КАК КоличествоКТК20,
	//                    |	ДокументЗаявка.КоличествоКТК40 КАК КоличествоКТК40,
	//                    |	ДокументЗаявка.Маршрутизировать КАК Маршрутизировать,
	//                    |	ДокументЗаявка.ПримененныйМаршрут КАК ПримененныйМаршрут,
	//                    |	ДокументЗаявка.ТекущееСостояние КАК ТекущееСостояние,
	//                    |	ДокументЗаявка.ЦФО КАК ЦФО,
	//                    |	ДокументЗаявка.Подразделение КАК Подразделение,
	//                    |	ДокументЗаявка.Служебная КАК Служебная,
	//                    |	ДокументЗаявка.МоментВремени КАК МоментВремени,
	//                    |	ЗаявкаСостояния.Исполнитель КАК Исполнитель,
	//                    |	ЗаявкаСостояния.Наблюдатель КАК Наблюдатель,
	//                    |	ЗаявкаСостояния.Статус КАК Статус,
	//                    |	ЗаявкаСостояния.ПричинаОтказа КАК ПричинаОтказа,
	//                    |	ЗаявкаСостояния.СтатусСогласования КАК СтатусСогласования,
	//                    |	ДокументЗаявка.ДоходностьЗаявки КАК ДоходностьЗаявки,
	//                    |	ДокументЗаявка.КонтрибуцияЗаявки КАК КонтрибуцияЗаявки,
	//                    |	СПАРКИндексыРисковСрезПоследних.СводныйИндикаторРиска КАК СводныйИндикаторРиска,
	//                    |	СПАРКИндексыРисковСрезПоследних.ИндексДолжнойОсмотрительности КАК ИндексДолжнойОсмотрительности,
	//                    |	СПАРКИндексыРисковСрезПоследних.ИндексФинансовогоРиска КАК ИндексФинансовогоРиска,
	//                    |	СПАРКИндексыРисковСрезПоследних.ИндексПлатежнойДисциплины КАК ИндексПлатежнойДисциплины,
	//                    |	ВЫБОР
	//                    |		КОГДА ДокументЗаявка.ПСЦ = ЗНАЧЕНИЕ(Документ.ПСЦ.ПустаяСсылка)
	//                    |			ТОГДА ИСТИНА
	//                    |		ИНАЧЕ ЛОЖЬ
	//                    |	КОНЕЦ КАК ПСЦНЕЗаполнен,
	//					|	ДокументЗаявка.Ссылка В
	//					// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 08.02.2023
	//					// Было:
	//					//|		(ВЫБРАТЬ
	//					//|			ЗаявкаДетализацияПоГрузу.Ссылка КАК Ссылка
	//					//|		ИЗ
	//					//|			Документ.Заявка.ДетализацияПоГрузу КАК ЗаявкаДетализацияПоГрузу
	//					//|		ГДЕ
	//					//|			ЗаявкаДетализацияПоГрузу.ОпасныйГруз) КАК ОпасныйГруз,
	//					// Стало:
	//					|(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//					|КлючиАналитикиПеревозки.Заявка КАК Заявка
	//					|ИЗ
	//					|Справочник.КлючиАналитикиПеревозки.ДетализацияПоГрузу КАК мДетализацияПоГрузу
	//					|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
	//					|ПО
	//					|мДетализацияПоГрузу.Ссылка = КлючиАналитикиПеревозки.Ссылка
	//					|И КлючиАналитикиПеревозки.Заявка = ДокументЗаявка.Ссылка) КАК ОпасныйГруз,
	//					// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 08.02.2023
	//					|	ДатыОтправленияРейсовЗаявок.Рейс КАК Рейс,
	//					|	ДатыОтправленияРейсовЗаявок.НомерПоезда КАК НомерПоезда,
	//					// Евросиб Фролов (16.02.2022 Task №44768
	//					|	ДокументЗаявка.ЗапросНаКТК КАК ЗапросНаКТК
	//					// Евросиб Фролов)
	//					|ИЗ
	//                    |	Документ.Заявка КАК ДокументЗаявка
	//                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.Состояния КАК ЗаявкаСостояния
	//                    |		ПО ДокументЗаявка.Ссылка = ЗаявкаСостояния.Ссылка
	//                    |			И ДокументЗаявка.ТекущееСостояние = ЗаявкаСостояния.Состояние
	//                    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//                    |			ЗаявкаПереченьРейсов.Ссылка КАК Заявка,
	//                    |			МИНИМУМ(ЗаявкаПереченьРейсов.Рейс.ДатаОтправления) КАК ДатаОтправления,
	//                    |			МАКСИМУМ(ЗаявкаПереченьРейсов.Рейс.ДатаПрибытия) КАК ДатаПрибытия,
	//                    |			МАКСИМУМ(ЗаявкаПереченьРейсов.Рейс) КАК Рейс,
	//                    |			МАКСИМУМ(ЗаявкаПереченьРейсов.Рейс.НомерПоезда) КАК НомерПоезда
	//                    |		ИЗ
	//                    |			Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
	//                    |		
	//                    |		СГРУППИРОВАТЬ ПО
	//                    |			ЗаявкаПереченьРейсов.Ссылка) КАК ДатыОтправленияРейсовЗаявок
	//                    |		ПО ДокументЗаявка.Ссылка = ДатыОтправленияРейсовЗаявок.Заявка
	//                    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СПАРКИндексыРисков.СрезПоследних КАК СПАРКИндексыРисковСрезПоследних
	//                    |		ПО ДокументЗаявка.Контрагент = СПАРКИндексыРисковСрезПоследних.Контрагент
	//                    |ГДЕ
	//                    |	ВЫБОР
	//                    |			КОГДА &ОтборОтправлениеУстановлен
	//                    |				ТОГДА ЕСТЬNULL(ДатыОтправленияРейсовЗаявок.ДатаОтправления, ДокументЗаявка.Отправка) МЕЖДУ &Отправление1 И &Отправление2
	//                    |			ИНАЧЕ ИСТИНА
	//                    |		КОНЕЦ
	//                    |	И ВЫБОР
	//                    |			КОГДА &ОтборПрибытиеУстановлен
	//                    |				ТОГДА ЕСТЬNULL(ДатыОтправленияРейсовЗаявок.ДатаПрибытия, ДокументЗаявка.Прибытие) МЕЖДУ &Прибытие1 И &Прибытие2
	//                    |			ИНАЧЕ ИСТИНА
	//                    |		КОНЕЦ";
	//
	//Если УскоритьРаботуФормыПутемОтключенияЧастиКолонок = Истина Тогда
	//	Список.ТекстЗапроса = НовыйТекстЗапроса;
	//КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 87367/TA 88267, 14-08-2024, конец
	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура УскоритьРаботуФормыПутемОтключенияЧастиКолонокПриИзменении(Элемент)
	
	УстановитьПользовательскуюНастройкуОтображенияФормыСпискаЗаявки(УскоритьРаботуФормыПутемОтключенияЧастиКолонок);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьПользовательскуюНастройкуОтображенияФормыСпискаЗаявки(УскоритьРаботуФормыПутемОтключенияЧастиКолонок)
	
	ХранилищеОбщихНастроек.Сохранить("Заявка", "УскоритьРаботуФормыПутемОтключенияЧастиКолонок", УскоритьРаботуФормыПутемОтключенияЧастиКолонок);
	
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	
	Элементы.ГруппаНастройкиФормы.Видимость = НЕ Элементы.ГруппаНастройкиФормы.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура ПланОтправленияПриИзменении(Элемент)
	
	ОбновитьПараметрыФильтров();
	
КонецПроцедуры

&НаКлиенте
Процедура ПланПрибытияПриИзменении(Элемент)
	
	ОбновитьПараметрыФильтров();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрупповоеРедактированиеЗаявок(Команда)
	ОткрытьФорму("Обработка.ГрупповоеРедактированиеЗаявок.Форма",, , ЭтаФорма.УникальныйИдентификатор, ,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//УстановитьСтандартныеНастройкиФормы(); //Евросиб(ДИТ), Беляев СЮ, BUG 91146 / TA 91376, 09-09-2024, закомментировал
	
КонецПроцедуры

//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, начало
&НаКлиенте
Процедура РежимОтображенияЗаявокПриИзменении(Элемент)
	
	ОбновитьПараметрыФильтров();
	
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 92704 / TA 101723, 11-02-2025, конец

//Евросиб(ДИТ), Беляев СЮ, BUG 91146 / TA 91376, 09-09-2024, начало (закомментировал процедуру)
//&НаСервере
//Процедура УстановитьСтандартныеНастройкиФормы()
//	
//	ХранилищеСистемныхНастроек.Удалить("Документ.Заявка.Форма.ФормаДокумента/НастройкиФормы",, ИмяПользователя());
//	ХранилищеСистемныхНастроек.Удалить("Документ.Заявка.Форма.ФормаДокумента/НастройкиОкна",, ИмяПользователя());
//	
//КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, BUG 91146 / TA 91376, 09-09-2024, конец