
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
//	Обработки.ДД_подключаемыйМодуль.СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки);
	
КонецПроцедуры

// Евросиб Фролов (28.10.2021 
// Кнопка на форме удалена
//&НаКлиенте
//Процедура ЗагрузитьИзExcel(Команда)
//	Об = ПолучитьФорму("Обработка.ЗагрузкаВСФизExcel.Форма");
//	Об.Открыть();
//КонецПроцедуры
// Евросиб Фролов)

&НаКлиенте
Процедура НастроитьРасписаниеАвторазнесения(Команда)
	
	Расп = ПретензииИНеакцептыСервер.ПолучитьРасписаниеФоновогоЗаданияАвтоакцептов();
	ОпОп = Новый ОписаниеОповещения("ОкончаниеРедактированияРасписание", ПретензииИНеакцептыСервер);
	
	
	ДиалогРедактирования = Новый ДиалогРасписанияРегламентногоЗадания(Расп);
    ДиалогРедактирования.Показать(ОпОп);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокПричинДублирования(Команда)
	
	ОткрытьФорму("Документ.ПоступлениеТоваровУслуг.Форма.ПричиныДублированияВСписке",, ЭтаФорма);
	
КонецПроцедуры

//Евросиб (Гонтаренко 27.02.2021 #26783
&НаСервере
Процедура ЗагрузитьИзРИТМНаСервере()
	МассивПТУ = Элементы.Список.ВыделенныеСтроки;
 	Обработки.ЗагрузкаВСФизРИТМа.ЗагрузитьФайлы(МассивПТУ);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзРИТМ(Команда)
	ЗагрузитьИзРИТМНаСервере();
КонецПроцедуры
//Евросиб )Гонтаренко 27.02.2021 #26783

//++ Зубов 37766 19.08.2021
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.Найти("ФормаОбщаяКомандаВернутьЗадачу") = Неопределено Тогда
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОбщаяКомандаВернутьЗадачу.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры
//-- Зубов 37766 19.08.2021

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 ) 

// ++ Дудоров С.В. Ticket#61931 29.11.2022
// Закомментирован для стандартизации кода. В других документах, кроме Протокола, этого нет
//++ Зубов 37766 19.08.2021
//&НаКлиенте
//Процедура ПриОткрытии(Отказ)
//	Если НЕ Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.Найти("ФормаОбщаяКомандаВернутьЗадачу") = Неопределено Тогда
//		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаОбщаяКомандаВернутьЗадачу.Видимость = Ложь;
//	КонецЕсли;
//КонецПроцедуры
//-- Зубов 37766 19.08.2021
// -- Дудоров С.В. Ticket#61931 29.11.2022

