
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("МассивКлиентов") Тогда
		Для каждого Элемент Из Параметры.МассивКлиентов Цикл
			НовСтр = ТаблицаКонтрагентов.Добавить();
			НовСтр.Контрагенты = Элемент
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаКонтрагентов
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть(МассивВыбранныхКонтрагентов());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция МассивВыбранныхКонтрагентов()
	ОтборВыбранных = Новый Структура();
	ОтборВыбранных.Вставить("Выбор", Истина);
	СтрокиСВыбором = ТаблицаКонтрагентов.НайтиСтроки(ОтборВыбранных);
	
	МассивКлиентов = Новый Массив(); 
	
	Для Каждого Стр Из СтрокиСВыбором Цикл
		МассивКлиентов.Добавить(Стр.Контрагенты);	
	КонецЦикла;
	Возврат МассивКлиентов;
КонецФункции

#КонецОбласти