
&НаКлиенте
Процедура РеквизитыПродавцаИПокупателяНажатие(Элемент)
	
	ОбъектА = ЭтотОбъект.Объект;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДоверенностьЗаРуководителя", ОбъектА.ДоверенностьЗаРуководителя);
	ПараметрыФормы.Вставить("ДоверенностьЗаГлБухгалтера", ОбъектА.ДоверенностьЗаГлБухгалтера);
	ПараметрыФормы.Вставить("Грузоотправитель", ОбъектА.Грузоотправитель);
	ПараметрыФормы.Вставить("Грузополучатель", ОбъектА.Грузополучатель);
	ПараметрыФормы.Вставить("ГлавныйБухгалтер", ОбъектА.ГлавныйБухгалтер);
	ПараметрыФормы.Вставить("Руководитель", ОбъектА.Руководитель);
	ПараметрыФормы.Вставить("АдресДоставки", ОбъектА.АдресДоставки);
	ПараметрыФормы.Вставить("ЗаРуководителяНаОсновании", ОбъектА.ЗаРуководителяНаОсновании);
	ПараметрыФормы.Вставить("ЗаГлавногоБухгалтераНаОсновании", ОбъектА.ЗаГлавногоБухгалтераНаОсновании);
	ПараметрыФормы.Вставить("БезДоверенностей", ОбъектА.БезДоверенностей); 
	//ДИТ Авдеева В.С. 43329 29.04.2022 Начало
	ПараметрыФормы.Вставить("РуководительКонтрагента", ОбъектА.РуководительКонтрагента); 
	ПараметрыФормы.Вставить("КонтрагентДокумента", ОбъектА.Контрагент); 
	//ДИТ Авдеева В.С. 43329 29.04.2022 Конец
	ОткрытьФорму("Документ.РеализацияТоваровУслуг.Форма.ФормаРеквизитыПродавцаИПокупателя",ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаРеквизитыПродавцаИПокупателя" Тогда
		ОбработкаВыбораРеквизитыПродавцаИПокупателя(ЭтаФорма,ВыбранноеЗначение,ИсточникВыбора);
	ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.УчетНДСВДокументах" Тогда
		ОбработкаВыбораУчетНДС(ЭтаФорма,ВыбранноеЗначение,ИсточникВыбора);
	ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.КурсВалютыВДокументах" Тогда
		ОбработкаВыбораКурсыВалют(ЭтаФорма,ВыбранноеЗначение,ИсточникВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораРеквизитыПродавцаИПокупателя(Форма, ВыбранноеЗначение, ИсточникВыбора)
	
	ЗаполнитьЗначенияСвойств(Объект, ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораУчетНДС(Форма, ВыбранноеЗначение, ИсточникВыбора)
	ЗаполнитьЗначенияСвойств(Объект, ВыбранноеЗначение);
	Для каждого Стр из Объект.Товары Цикл
		БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(Стр,Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);
		БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(Стр,Объект.СуммаВключаетНДС);
		
	КонецЦикла;
	
	Для каждого Стр из Объект.Услуги Цикл
		БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(Стр,Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);
		БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(Стр,Объект.СуммаВключаетНДС);

	КонецЦикла;
	Для каждого Стр из Объект.АгентскиеУслуги Цикл
		БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(Стр,Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);
		БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(Стр,Объект.СуммаВключаетНДС);

	КонецЦикла;

	РассчитатьСуммыВсегоПоДокументу();
	УстановитьВидимостьКолонокНДС();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораКурсыВалют(Форма, ВыбранноеЗначение, ИсточникВыбора)
	СтараяВалюта = Объект.ВалютаДокумента;
	СтарыйКурс = Объект.КурсВзаиморасчетов;
	СтараяКратность = Объект.КратностьВзаиморасчетов;
	
	Объект.ВалютаДокумента = ВыбранноеЗначение.ВалютаДокумента;
	Объект.КратностьВзаиморасчетов = ВыбранноеЗначение.КратностьВзаиморасчетов;
	Объект.КурсВзаиморасчетов = ВыбранноеЗначение.КурсВзаиморасчетов;
	//Евросиб - АСуслов 21.09.2021 12:57:33 #
	//(
	Объект.ДатаКурса = ВыбранноеЗначение.ДатаДокумента;
	//)
	//Евросиб - АСуслов 21.09.2021 12:57:33 #
	Если СтараяВалюта <> Объект.ВалютаДокумента или СтарыйКурс <> Объект.КурсВзаиморасчетов Тогда
		СтруктураТекущая = Новый Структура;
		СтруктураТекущая.Вставить("Валюта",СтараяВалюта);
		СтруктураТекущая.Вставить("Курс",СтарыйКурс);
		СтруктураТекущая.Вставить("Кратность",СтараяКратность);
		СтруктураНовая = Новый Структура;
		СтруктураНовая.Вставить("Валюта",Объект.ВалютаДокумента);
		СтруктураНовая.Вставить("Курс",Объект.КурсВзаиморасчетов);
		СтруктураНовая.Вставить("Кратность",Объект.КратностьВзаиморасчетов);
		
		ПересчитатьСуммыДокументаПоВалютеВзаиморасчетов(СтруктураТекущая,СтруктураНовая);
		Для каждого Стр из Объект.Услуги Цикл
			БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(Стр,Объект.СуммаВключаетНДС);
		КонецЦикла;

		РассчитатьСуммыВсегоПоДокументу();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УчитыватьНДСНажатие(Элемент)
	ОбъектА = ЭтотОбъект.Объект;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("УчитыватьНДС", ОбъектА.УчитыватьНДС);
	ПараметрыФормы.Вставить("СуммаВключаетНДС", ОбъектА.СуммаВключаетНДС);
	ОткрытьФорму("ОбщаяФорма.УчетНДСВДокументах",ПараметрыФормы,ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура КурсВалютыНажатие(Элемент)
	ОбъектА = ЭтотОбъект.Объект;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВалютаДокумента", ОбъектА.ВалютаДокумента);
	ПараметрыФормы.Вставить("КурсВзаиморасчетов", ОбъектА.КурсВзаиморасчетов);
	ПараметрыФормы.Вставить("КратностьВзаиморасчетов", ОбъектА.КратностьВзаиморасчетов);
	//Евросиб - АСуслов 21.09.2021 12:45:30 #33698
	//(
	//ПараметрыФормы.Вставить("ДатаДокумента", ОбъектА.Дата);
	ПараметрыФормы.Вставить("ДатаДокумента", ОбъектА.ДатаКурса);
	//)
	//Евросиб - АСуслов 21.09.2021 12:45:32 #33698
	ОткрытьФорму("ОбщаяФорма.КурсВалютыВДокументах",ПараметрыФормы,ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Услуги1ЦенаПриИзменении(Элемент)
	СтрТабЧасти = Элементы.Услуги1.ТекущиеДанные;
	
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТабЧасти);
	БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(СтрТабЧасти,Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТабЧасти,Объект.СуммаВключаетНДС);
	РассчитатьСуммыВсегоПоДокументу();
	
	ПересчитатьРасшифровку(СтрТабЧасти);

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьРасшифровку(СтрТабЧасти)
	Для каждого СтрРасшифровка Из Объект.РасшифровкаУслугПоТС Цикл
		Если СтрРасшифровка.СтрокаДоходовСделки <> СтрТабЧасти.СтрокаДоходовСделки Тогда
			Продолжить;
		КонецЕсли; 
		СтрРасшифровка.Цена = СтрТабЧасти.Цена;
		СтрРасшифровка.Сумма = СтрТабЧасти.Сумма / СтрТабЧасти.Количество;
		СтрРасшифровка.СуммаНДС = СтрТабЧасти.СуммаНДС / СтрТабЧасти.Количество;
	КонецЦикла; 	
КонецПроцедуры


&НаКлиенте
Процедура Товары1ЦенаПриИзменении(Элемент)
	СтрТабЧасти = Элементы.Товары1.ТекущиеДанные;
	
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТабЧасти);
	БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(СтрТабЧасти,Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);	
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТабЧасти,Объект.СуммаВключаетНДС);
	РассчитатьСуммыВсегоПоДокументу();
КонецПроцедуры

&НаКлиенте
Процедура Товары1КоличествоПриИзменении(Элемент)
	СтрТЧ = Элементы.Товары1.ТекущиеДанные;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТЧ);
	БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(СтрТЧ,Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
	РассчитатьСуммыВсегоПоДокументу();
КонецПроцедуры

&НаКлиенте
Процедура Товары1СтавкаНДСПриИзменении(Элемент)
	СтрТЧ = Элементы.Товары1.ТекущиеДанные;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТЧ);
	СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСуммуНДС(СтрТЧ.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СТрТЧ.СтавкаНДС), Объект.УчитыватьНДС, Объект.СуммаВключаетНДС);
	СтрТч.СуммаНДС = СуммаНДС;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
	РассчитатьСуммыВсегоПоДокументу();

КонецПроцедуры

&НаКлиенте
Процедура Услуги1КоличествоПриИзменении(Элемент)
	СтрТЧ = Элементы.Услуги1.ТекущиеДанные;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТЧ);
	БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(СтрТЧ,Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
	РассчитатьСуммыВсегоПоДокументу();
	
	// Евросиб Фролов (15.03.2022 Task №40571 
	БухгалтерскийУчетОбщиеПроцедурыКлиент.ПроверитьКоличествоВТабличнойЧасти(ЭтаФорма, "Услуги1");
	// Евросиб Фролов)
	
КонецПроцедуры

&НаКлиенте
Процедура Услуги1СтавкаНДСПриИзменении(Элемент)
	СтрТЧ = Элементы.Услуги1.ТекущиеДанные;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТЧ);
	СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСуммуНДС(СтрТЧ.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СТрТЧ.СтавкаНДС), Объект.УчитыватьНДС, Объект.СуммаВключаетНДС);
	СтрТч.СуммаНДС = СуммаНДС;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
	РассчитатьСуммыВсегоПоДокументу();

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммыВсегоПоДокументу()
	ИтогоНДС = ?(Объект.Товары.Количество()>0, Объект.Товары.Итог("СуммаНДС"),0)+?(Объект.Услуги.Количество()>0,Объект.Услуги.Итог("СуммаНДС"),0)+?(Объект.АгентскиеУслуги.Количество()>0,Объект.АгентскиеУслуги.Итог("СуммаНДС"),0);
	ИтогоВсего = ?(Объект.Товары.Количество()>0, Объект.Товары.Итог("Сумма"),0)+ ?(Объект.Услуги.Количество()>0,Объект.Услуги.Итог("Сумма"),0)+ ?(Объект.АгентскиеУслуги.Количество()>0,Объект.АгентскиеУслуги.Итог("Сумма"),0)+?(Объект.СуммаВключаетНДС,0,ИтогоНДС);
	Попытка
		Объект.СуммаДокумента = ИтогоВсего;
	Исключение
		// недостаточно прав для обновления полей
	КонецПопытки;
	Элементы.Валюта.Заголовок = Объект.ВалютаДокумента;
КонецПроцедуры

&НаКлиенте
Процедура СчФНадписьНажатие(Элемент)
	
	ОповещениеОтветаВопроса = Новый ОписаниеОповещения("ОбработкаВопросаЗаписи", ЭтаФорма);
	РеквизитыСФ = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьРеквизитыСчетФактуры(Объект,"СчетФактураВыданный");
	Если РеквизитыСФ <> Неопределено и ЭтаФорма.Модифицированность Тогда
		ПоказатьВопрос(ОповещениеОтветаВопроса, "Документ был изменен, будет выполнена запись документа с актуализацией данных подчиненной счет-фактуры. Продолжить?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет);	
	КонецЕсли;
	Если РеквизитыСФ = Неопределено и ЭтаФорма.Модифицированность Тогда
	//	ОповещениеОтветаВопроса = Новый ОписаниеОповещения("ОбработкаВопросаЗаписи", ЭтаФорма);
		ПоказатьВопрос(ОповещениеОтветаВопроса, "Перед созданием счет-фактуры документ необходимо записать. Продолжить?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет);
	ИначеЕсли РеквизитыСФ = Неопределено Тогда
		ОбработкаВопросаЗаписи(КодВозвратаДиалога.Да, Истина);
	КонецЕсли;	
	Если РеквизитыСф <> Неопределено и Не ЭтаФорма.Модифицированность Тогда
		БухгалтерскийУчетОбщиеПроцедурыКлиент.ОткрытьСчетФактуру(Объект,ЭтаФорма,"СчетФактураВыданный");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаЗаписи(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 <> КодВозвратаДиалога.Да Тогда Возврат; КонецЕсли;
	
	Если Параметр2 = неопределено Тогда
		ЗаписатьДокументРеализации();
	конецЕсли;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.ВвестиСчетФактуру(Объект,ЭтаФорма,"СчетФактураВыданный");
	РеквизитыСФ = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьРеквизитыСчетФактуры(Объект,"СчетФактураВыданный");
	Если РеквизитыСФ <> Неопределено Тогда
		Элементы.СчФНадпись.Заголовок = БухгалтерскийУчетОбщиеПроцедурыКлиент.ЗаполнитьНадписьСчФ(РеквизитыСФ);
	КонецЕсли;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.ОткрытьСчетФактуру(Объект,ЭтаФорма,"СчетФактураВыданный");	
КонецПроцедуры

// +++ БЛОК НОВОЙ МАРШРУТИЗАЦИИ

&НаКлиенте
Функция ПроверитьУказатьОтветственных(РезультатЗапроса, СобытиеПередЗаписью)
	
	ДопСвойстваОбъекта.Очистить();
	ЧтоНужноУказатьВручную = Новый Массив;
	Для каждого Стр из  РезультатЗапроса Цикл
		Исполнитель = Стр.Исполнитель;
		Если НЕ Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Исполнитель) Тогда Исполнитель = Объект.Автор; КонецЕсли;
		Наблюдатель = Стр.Наблюдатель;
		Если НЕ Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Наблюдатель) Тогда Наблюдатель = Объект.Автор; КонецЕсли;
		
		Если Стр.ТребуетсяУказатьИсполнителя ИЛИ Стр.ТребуетсяУказатьНаблюдателя Тогда 
			ЧтоНужноУказатьВручную.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель", Стр.Состояние, Исполнитель, Наблюдатель)); 
		КонецЕсли;
	КонецЦикла;
	Если ЧтоНужноУказатьВручную.Количество() > 0 Тогда
		ОпОп = Новый ОписаниеОповещения("ОбработкаУказанияОтветственных", ЭтаФорма, Новый Структура("РезультатЗапроса, СобытиеПередЗаписью", РезультатЗапроса, СобытиеПередЗаписью));
		ПараметрыОтбора = Новый СТруктура;
		ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация", ЧтоНужноУказатьВручную);
		ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Если НЕ СобытиеПередЗаписью Тогда ПовторнаяМаршрутизация_сервер(РезультатЗапроса); КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаУказанияОтветственных(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	ДопСвойстваОбъекта.ЗагрузитьЗначения(П1);
	Если П2.СобытиеПередЗаписью Тогда
		Записать();
	Иначе
		ПовторнаяМаршрутизация_сервер(П2.РезультатЗапроса);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПовторнаяМаршрутизация_сервер(РезультатЗапроса)
	
	ЭтотОбъектЪ = РеквизитФормыВЗначение("Объект");
	МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъектЪ, РезультатЗапроса, Объект.Автор, ДопСвойстваОбъекта);
	ЗначениеВРеквизитФормы(ЭтотОбъектЪ, "Объект");
	
КонецПроцедуры

// --- БЛОК НОВОЙ МАРШРУТИЗАЦИИ

&НаСервере
Процедура ЗаписатьДокументРеализации()
	ЭтотОбъект.Записать();	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РеквизитыСФ = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьРеквизитыСчетФактуры(Объект,"СчетФактураВыданный");
	Если РеквизитыСФ <> Неопределено Тогда
		Элементы.СчФНадпись.Заголовок = БухгалтерскийУчетОбщиеПроцедурыКлиент.ЗаполнитьНадписьСчФ(РеквизитыСФ);
	КонецЕсли;
	Для каждого Стр из Объект.Товары Цикл
		БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(Стр,Объект.СуммаВключаетНДС);
	КонецЦикла;
	Для каждого Стр из Объект.Услуги Цикл
		БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(Стр,Объект.СуммаВключаетНДС);
	КонецЦикла;
	Для каждого Стр из Объект.АгентскиеУслуги Цикл
		БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(Стр,Объект.СуммаВключаетНДС);
	КонецЦикла;

	РассчитатьСуммыВсегоПоДокументу();
	УстановитьВидимостьКолонокНДС();
	Если Объект.ЭтоКомиссия Тогда
		Элементы.ГруппаКомитент.Видимость = Истина;
		Элементы.АгентскиеУслуги1Контрагент.Видимость = ложь;
		Элементы.АгентскиеУслуги1ДоговорКонтрагента.Видимость = ложь;
	Иначе
		Элементы.ГруппаКомитент.Видимость = Ложь;
		
		Элементы.АгентскиеУслуги1Контрагент.Видимость = Истина;
		Элементы.АгентскиеУслуги1ДоговорКонтрагента.Видимость = Истина;
		
	КонецЕсли;
	ОтчПериод = Формат(Объект.ПериодВО,"ДФ='ММММ гггг'") + " г.";
	
	//Евросиб Каблов 14.07.2020 ( Проверку доступности по периоду перенёс в процедуру КонтрольДоступностиДокументов_сервер.ПолучитьДанныеОБлокировке. Вызывается ПриСозданииНаСервере
	////Евросиб Каблов 11.07.2020 (
	////ЭтаФорма.ТолькоПросмотр = ПроверкаДоступнотиПоПериоду();
	//Если Не ТолькоПросмотр Тогда	
	//	ЭтаФорма.ТолькоПросмотр = ПроверкаДоступностиПоПериоду();
	//КонецЕсли;
	////Евросиб Каблов 11.07.2020 )
	////Евросиб - АСуслов 05.09.2020 10:10:45 #
	////(
	////Элементы.ОбновитьДатыДокумента.Доступность = НЕ ПроверкаДоступностиПоПериоду();
	//Элементы.ОбновитьДатыДокумента.Доступность = НЕ ЭтаФорма.ТолькоПросмотр;
	////)
	////Евросиб - АСуслов 05.09.2020 10:10:46 #
	//Евросиб Каблов 14.07.2020 )

//Евросиб Литвинов ( 12.11.2021 #42060 #0248963
    УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
//Евросиб Литвинов ) 12.11.2021 #42060 #0248963	
	
КонецПроцедуры

//Перенес в модуль
//&НаСервере
//Функция ПроверкаДоступностиПоПериоду()
//	Если Не Объект.Проведен Тогда
//		Возврат Ложь;
//	КонецЕсли; 
//	Возврат КонтрольДоступностиДокументов_сервер.ДатаПопадаетВЗакрытыйПериодВыполненныхОбъемов(Объект.ПериодВО, Объект.Организация);
//КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ДопСвойстваОбъекта.Очистить();
	Для каждого СтрТЧ из Объект.Товары Цикл
		БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
	КонецЦикла;
	Для каждого СтрТЧ из Объект.Услуги Цикл
		БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
	КонецЦикла;
	Для каждого СтрТЧ из Объект.АгентскиеУслуги Цикл
		БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
	КонецЦикла;

	РассчитатьСуммыВсегоПоДокументу();
	//Период = Формат(Объект.ПериодВО,"ДФ='ММММ гггг'") + " г.";

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКолонокНДС()
	Если Не Объект.УчитыватьНДС Тогда
		Элементы.Товары1СтавкаНДС.Видимость = Ложь;
		Элементы.Товары1СуммаНДС.Видимость = Ложь;
		Элементы.Услуги1СтавкаНДС.Видимость = Ложь;
		Элементы.Услуги1СуммаНДС.Видимость = Ложь;
		Элементы.АгентскиеУслуги1СтавкаНДС.Видимость = Ложь;
		Элементы.АгентскиеУслуги1СуммаНДС.Видимость = Ложь;

	Иначе
		Элементы.Товары1СтавкаНДС.Видимость = Истина;
		Элементы.Товары1СуммаНДС.Видимость = Истина;
		Элементы.Услуги1СтавкаНДС.Видимость = Истина;
		Элементы.Услуги1СуммаНДС.Видимость = Истина;
		Элементы.АгентскиеУслуги1СтавкаНДС.Видимость = Истина;
		Элементы.АгентскиеУслуги1СуммаНДС.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЭтоКомиссияПриИзменении(Элемент)
	Если Объект.ЭтоКомиссия Тогда
		Элементы.ГруппаКомитент.Видимость = Истина;
		Элементы.АгентскиеУслуги1Контрагент.Видимость = ложь;
		Элементы.АгентскиеУслуги1ДоговорКонтрагента.Видимость = ложь;
	Иначе
		Элементы.ГруппаКомитент.Видимость = Ложь;
		
		Элементы.АгентскиеУслуги1Контрагент.Видимость = Истина;
		Элементы.АгентскиеУслуги1ДоговорКонтрагента.Видимость = Истина;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Услуги1СписокТСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораУчЕдиницы", ЭтаФорма, Новый Структура("ТС", Истина));
	ОткрытьФорму("ОбщаяФорма.ОкноРедактированияСоставаУчетныхЕдиниц", Новый Структура("ТС, СоставТС", Истина, Элементы.Услуги1.ТекущиеДанные.СписокТС),, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораУчЕдиницы(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	Если Параметр2.Свойство("ТС") Тогда
		
		ЭТС = "";
		Для каждого Стр из Параметр1 Цикл
			ЭТС = ЭТС + ?(ЭТС = "", "", ";") + Строка(Стр);
		КонецЦикла;
		Элементы.Услуги1.ТекущиеДанные.СписокТС = ЭТС;
		
	ИначеЕсли Параметр2.Свойство("ТЕ") Тогда
		
		ЭТС = "";
		Для каждого Стр из Параметр1 Цикл
			ЭТС = ЭТС + ?(ЭТС = "", "", ";") + Строка(Стр);
		КонецЦикла;
		Элементы.Услуги1.ТекущиеДанные.СписокТЕ = ЭТС;
		
	ИначеЕсли Параметр2.Свойство("ТД") Тогда
		
		ЭТС = "";
		Для каждого Стр из Параметр1 Цикл
			ЭТС = ЭТС + ?(ЭТС = "", "", ";") + ПолучитьКодТД(Стр);
		КонецЦикла;
		Элементы.Услуги1.ТекущиеДанные.СписокТД = ЭТС;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКодТД(ТД)
	//озврат ТД.Номер;
	//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, начало 
	Результат = "";
	Если ТипЗнч(ТД) = Тип("ДокументСсылка.ТранспортныйДокумент") Тогда
		Результат = ТД.НомерТранспортногоДокумента;
	КонецЕсли;
	Возврат Результат;
	//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, конец
КонецФункции

&НаКлиенте
Процедура Услуги1СписокТЕНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораУчЕдиницы", ЭтаФорма, Новый Структура("ТЕ", Истина));
	ОткрытьФорму("ОбщаяФорма.ОкноРедактированияСоставаУчетныхЕдиниц", Новый Структура("ТЕ, СоставТЕ", Истина, Элементы.Услуги1.ТекущиеДанные.СписокТЕ),, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Услуги1СписокТДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораУчЕдиницы", ЭтаФорма, Новый Структура("ТД", Истина));
	//ОткрытьФорму("ОбщаяФорма.ОкноРедактированияСоставаУчетныхЕдиниц", Новый Структура("ТД, СоставТД", Истина, Элементы.Услуги1.ТекущиеДанные.СписокТД),, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, начало
	ОткрытьФорму("ОбщаяФорма.ОкноРедактированияСоставаУчетныхЕдиниц", Новый Структура("ТД, СоставТД, ДатаПоискаТранпортныхДокументов", Истина, Элементы.Услуги1.ТекущиеДанные.СписокТД, Объект.ДатаДокумента),, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, конец
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Евросиб Каблов 11.07.2020 ( TASK 23506
	//Элементы.ПредупреждениеРедактирования.Видимость = КонтрольДоступностиДокументов_сервер.ДокументЗаблокирован(Объект.Ссылка);
	//Элементы.ПредупреждениеРедактирования.Заголовок = КонтрольДоступностиДокументов_сервер.ПолучитьОписаниеБлокировки();
	Если Не РольДоступна("ПолныеПрава") Тогда
		Элементы.ГруппаВыставлен.ТолькоПросмотр = Истина;
	КонецЕсли;	
	//ОбработатьБлокировкуДокумента();	
	КонтрольДоступностиДокументов_сервер.ОбработатьБлокировкуЭлементовФормы(Объект.Ссылка, Элементы);
	//Евросиб Каблов 11.07.2020 )
	
	// SIV 27-10-20 заблокировать реквизит, если ФД принудительно установил счет взаиморасчетов в договоре
	//Евросиб Каблов 31.01.2021 (
	//Если Не РольДоступна("ПолныеПрава") И ЗначениеЗаполнено(Объект.ДоговорКонтрагента) И ЗначениеЗаполнено(Объект.БанковскийСчетОрганизации) И Объект.ДоговорКонтрагента.БанковскиеРеквизитыДляОплаты.Количество() > 0 Тогда
	//	Элементы.БанковскийСчетОрганизации.ТолькоПросмотр = Истина;
	//КонецЕсли;
	Если Не РольДоступна("ПолныеПрава") И ЗначениеЗаполнено(Объект.ДоговорКонтрагента) И ЗначениеЗаполнено(Объект.БанковскийСчетОрганизации) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентовБанковскиеРеквизитыДляОплаты.РасчетныйСчет КАК РасчетныйСчет
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов.БанковскиеРеквизитыДляОплаты КАК ДоговорыКонтрагентовБанковскиеРеквизитыДляОплаты
		|ГДЕ
		|	ДоговорыКонтрагентовБанковскиеРеквизитыДляОплаты.Ссылка = &Договор
		|	И (ДоговорыКонтрагентовБанковскиеРеквизитыДляОплаты.ДействуетС <= &ДатаДокумента
		|			ИЛИ ДоговорыКонтрагентовБанковскиеРеквизитыДляОплаты.ДействуетС = &ПустаяДата)
		|	И (ДоговорыКонтрагентовБанковскиеРеквизитыДляОплаты.ДействуетПо >= &ДатаДокумента
		|			ИЛИ ДоговорыКонтрагентовБанковскиеРеквизитыДляОплаты.ДействуетПо = &ПустаяДата)
		|	И ДоговорыКонтрагентовБанковскиеРеквизитыДляОплаты.РасчетныйСчет = &РасчетныйСчет";
		Запрос.УстановитьПараметр("Договор", Объект.ДоговорКонтрагента);
		Запрос.УстановитьПараметр("ДатаДокумента", Объект.ДатаДокумента);
		Запрос.УстановитьПараметр("ПустаяДата", '00010101');
		Запрос.УстановитьПараметр("РасчетныйСчет", Объект.БанковскийСчетОрганизации);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Элементы.БанковскийСчетОрганизации.ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЕсли;
	//Евросиб Каблов 31.01.2021 )
	
	// Евросиб Фролов (29.12.2021 TASK№ 40645, закомментировал изменения от 16.12.2021г.
	//// Евросиб Фролов (16.12.2021 TASK№ 40645
	//// Поля "Вагон", "ЖДН" в расшифровке должны быть доступны только роли "dc_РаботаСНДС0".
	//ДоступнаРольРаботаСНДС0 = Пользователи.РолиДоступны("dc_РаботаСНДС0");
	//Если Не ДоступнаРольРаботаСНДС0 Тогда
	//	Элементы.РасшифровкаУслугПоТСЖДН.ТолькоПросмотр = Истина;
	//	Элементы.РасшифровкаУслугПоТСВагон.ТолькоПросмотр = Истина;
	//КонецЕсли;	
	//// Евросиб Фролов)
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);

	// Обновляем панель текущего пользователя и панель состояний
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	// - Состояния
	
	ОбновитьОтображениеПанелиКорректировок();
	КорректировкиДокумента.ЗагрузитьЗначения(КорректировкиРТУСервер.ПолучитьКорректировкуПоОснованию(Объект.Ссылка));
	Элементы.ГруппаКорректировкиДокумента.Видимость = (КорректировкиДокумента.Количество() > 0);
	ПоказатьВерсию();
	
//Евросиб Литвинов ( 12.11.2021 #42060 #0248963 
    // Обработчик подсистемы "Свойства"
    ДополнительныеПараметры = Новый Структура;
    ДополнительныеПараметры.Вставить("Объект", Объект);
    ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
    УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, ДополнительныеПараметры);
//Евросиб Литвинов ) 12.11.2021 #42060 #0248963 

	// Евросиб Фролов (23.11.2021 Ticket№ 0244435
	// Добавить команду печати.
	НоваяКоманда = Команды.Добавить("ПечатьСлужебнойЗаписки");
	НоваяКоманда.Действие = "ПечатьСлужебнойЗаписки";
	// Добавим элемент формы - кнопку
	НовыйЭлемент = Элементы.Добавить("КнопкаПечатьСлужебнойЗаписки", Тип("КнопкаФормы"), КоманднаяПанель.ПодчиненныеЭлементы.ПодменюПечать);
	НовыйЭлемент.Заголовок = "Служебная записка";
	НовыйЭлемент.ИмяКоманды = "ПечатьСлужебнойЗаписки";
	
	ЗаполнитьДоплатныеПСЦ();
	// Евросиб Фролов)
	//Евросиб - АСуслов 24.01.2022 16:56:21 #0258238
	//(
	//запомним дату, чтобы сравнивать при изменении
	ДатаДокументаТекущая = Объект.ДатаДокумента;
	//)
	//Евросиб - АСуслов 24.01.2022 16:56:35 #0258238

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 ) 
	
	// ДИТ US 51148 TA 64324 Евсенкин М.А. Начало: 19.01.2023
	Элементы.ДатаДокумента.ТолькоПросмотр = Истина; // всем запрет на редактирование даты документа
	Если КонтрольДоступностиДокументов_сервер.ПроверитьДоступностьРоли("dc_РазрешитьРедактированиеИСФ") Тогда // разрешить редактировать без учета разрешенного периода 
		Элементы.ДатаДокумента.ТолькоПросмотр = Ложь;	
		// Евросиб US 89967 TA 91565 Рыбьяков К.А. 17.10.2024 ((
		Элементы.ПричинаИзмененияДатыДокумента.ТолькоПросмотр = Ложь;
		// Евросиб Рыбьяков К.А. 17.10.2024 ))
	КонецЕсли;	
	Если КонтрольДоступностиДокументов_сервер.ПроверитьДоступностьРоли("dc_РаботаСДокументамиКлиентов") Тогда 
		СтруктураПараметров = РегистрыСведений.РазрешенныйПериодРедактирования.ПолучитьАктуальныйПериодРедактирования(); 
		ДатаНачалаРазрешенногоПериодаПереноса = СтруктураПараметров.ДатаНачалаРазрешенногоПериодаПереноса;
		ДатаОкончанияРазрешенногоПериодаПереноса = СтруктураПараметров.ДатаОкончанияРазрешенногоПериодаПереноса;
		Если Объект.ДатаДокумента >= СтруктураПараметров.ДатаНачалаПериодаРазрешенияРедактирования 
			И Объект.ДатаДокумента <= СтруктураПараметров.ДатаОкончанияПериодаРазрешенияРедактирования Тогда 
			Элементы.ДатаДокумента.ТолькоПросмотр = Ложь;
		КонецЕсли;
	КонецЕсли;
	// ДИТ US 51148 TA 64324 Евсенкин М.А. Конец: 19.01.2023
	
	// Субботин TASK 72390 18.07.2023  Начало
	
	Группа = Элементы.Вставить("НДСВРублях",Тип("ГруппаФормы"),Элементы.Услуги1, Элементы.Услуги1СчетНаОплатуПокупателю);
	Группа.Вид = ВидГруппыФормы.ГруппаКолонок;
		
	нЭлемент 				= Элементы.Добавить("СтавкаНДСРуб", Тип("ПолеФормы"), Элементы.НДСВРублях);
	нЭлемент.Вид 			= ВидПоляФормы.ПолеВвода; 
	нЭлемент.ПутьКДанным 	= "Объект.Услуги.СтавкаНДСРуб";
	нЭлемент.Заголовок	 	= "Ставка НДС, руб.";
		
	нЭлемент 				= Элементы.Добавить("СуммаНДСРуб", Тип("ПолеФормы"), Элементы.НДСВРублях);
	нЭлемент.Вид 			= ВидПоляФормы.ПолеВвода; 
	нЭлемент.ПутьКДанным 	= "Объект.Услуги.СуммаНДСРуб";
	нЭлемент.Заголовок	 	= "Сумма НДС, руб.";
		
	нЭлемент 				= Элементы.Вставить("СуммаБезНалога", Тип("ПолеФормы"), Элементы.Услуги1, Элементы.Услуги1СчетНаОплатуПокупателю);
	нЭлемент.Вид 			= ВидПоляФормы.ПолеВвода; 
	нЭлемент.ПутьКДанным 	= "Объект.Услуги.СуммаБезНалога";
	нЭлемент.Заголовок	 	= "Сумма без налога, руб.";

	нЭлемент 				= Элементы.Вставить("ВсегоСНДС", Тип("ПолеФормы"), Элементы.Услуги1, Элементы.Услуги1СчетНаОплатуПокупателю);
	нЭлемент.Вид 			= ВидПоляФормы.ПолеВвода; 
	нЭлемент.ПутьКДанным 	= "Объект.Услуги.ВсегоСНДС";
	нЭлемент.Заголовок	 	= "Всего с НДС, руб.";
	// Субботин TASK 72390 18.07.2023  Конец
	
	//Евросиб СубботинВ #88804 12.08.2024 Начало
	Если не ПустаяСтрока(РегистрыСведений.ПротоколОбменов.ПолучитьЗначенияЗаписей(Перечисления.ДействияПриОбмене.ЗагрузкаДанных,
																				  Перечисления.УзлыОбмена.РИТМ,
																				  Объект.Ссылка).УИДИсточника) Тогда
																				  
		Элементы.ЗаказыРитма.Видимость = Истина;	
	КонецЕсли;	
	//Евросиб СубботинВ #88804 12.08.2024 Начало
	
	// Евросиб US 89967 TA 91565 Рыбьяков К.А. 02.10.2024 ((
	ПроверитьЗапретРедактированияДатыДокумента();
	// Евросиб Рыбьяков К.А. 02.10.2024 ))
	
	//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, начало
	ВидЗадолженности = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьВидЗадолженностиПоДокументу(Объект.Ссылка);
	Если ЗначениеЗаполнено(ВидЗадолженности) И НЕ РольДоступна("ПолныеПрава") Тогда
		Элементы.Услуги1ВидЗадолженности.Видимость = Ложь;
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, конец
	
	//ДИТ Шевченко А.В. 17.01.2024 US 91366 TA 93137 -начало
	ТранзитДляКлиента = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьТранзитДляКлиентаПоДокументу(Объект.Ссылка);
	Если НЕ ЗначениеЗаполнено(ТранзитДляКлиента) Тогда
		ТранзитДляКлиента = ПолучитьТранзитДляКлиентаПокументаОснования();
	КонецЕсли;
	//ДИТ Шевченко А.В. 17.01.2024 US 91366 TA 93137 -конец
	
	//Евросиб Шевченко А.В. 24.06.2025 US 104900 TA 112049 -начало
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ЗначениеЗаполнено(Объект.ДатаЗапретаПечатиИОтправкиПоЭДО) Тогда
			НеОтслеживать = Истина;
		ИначеЕсли Объект.Штраф Тогда
			НеОтслеживать = Истина;
		ИначеЕсли Объект.ДоговорКонтрагента.ПричинаОтказаОтЭДО = Перечисления.ПричинаОтказаОтЭДО.ИндивидуальнаяОтправкаРТУВДругиеСистемыЭДОКАПоДаннымОРК Тогда
			НеОтслеживать = Истина;
		Иначе
			НеОтслеживать = Ложь;
		КонецЕсли;			
		ВРаботеПоСтатусуОтправкиИПодписания = Перечисления.СтатусыОтправкиИПодписанияРТУ.ДокументНеВРаботеИНеТребуетНачалаРаботы;
	Иначе
		НеОтслеживать = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьПризнакНеОтслеживатьПоДокументу(Объект.Ссылка);
		Если НеОтслеживать = Неопределено Тогда
			Если ЗначениеЗаполнено(Объект.ДатаЗапретаПечатиИОтправкиПоЭДО) Тогда
				НеОтслеживать = Истина;
			ИначеЕсли Объект.Штраф Тогда
				НеОтслеживать = Истина;
			ИначеЕсли Объект.ДоговорКонтрагента.ПричинаОтказаОтЭДО = Перечисления.ПричинаОтказаОтЭДО.ИндивидуальнаяОтправкаРТУВДругиеСистемыЭДОКАПоДаннымОРК Тогда
				НеОтслеживать = Истина;
			Иначе
				НеОтслеживать = Ложь;
			КонецЕсли;	
		КонецЕсли;	
		ВРаботеПоСтатусуОтправкиИПодписания = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьСтатусОтправкиИПодписанияПоДокументу(Объект.Ссылка);
		Если НЕ ЗначениеЗаполнено(ВРаботеПоСтатусуОтправкиИПодписания) Тогда
			ВРаботеПоСтатусуОтправкиИПодписания = Перечисления.СтатусыОтправкиИПодписанияРТУ.ДокументНеВРаботеИНеТребуетНачалаРаботы;
		КонецЕсли;	
		ДатаПодписанияКонтрагентомВЭДО = ПолучитьДатуПодписанияДиадок(Объект.Ссылка)
	КонецЕсли;
	
	УстановитьОграниченияСтатусыОтправкиИПодписанияРТУ();
	
	//Евросиб Шевченко А.В. 24.06.2025 US 104900 TA 112049 -конец
	
	ЗаполнитьДанныеОбОтправкиДокумента(); //Евросиб Шевченко А.В. US 108619 TA 113566 15.07.2025
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеОбОтправкиДокумента() //Евросиб Шевченко А.В. US 108619 TA 113566 15.07.2025
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СобытияДокументовВПакетахАктуальныйСрезПоследних.СпособОтправки КАК СпособОтправки,
		|	СобытияДокументовВПакетахАктуальныйСрезПоследних.Событие КАК Событие,
		|	СобытияДокументовВПакетахАктуальныйСрезПоследних.ДатаОтправки КАК ДатаОтправки,
		|	СобытияДокументовВПакетахАктуальныйСрезПоследних.ДатаВозврата КАК ДатаВозврата,
		|	СобытияДокументовВПакетахАктуальныйСрезПоследних.Подписан КАК Подписан,
		|	СобытияДокументовВПакетахАктуальныйСрезПоследних.Пользователь КАК Пользователь,
		|	РАЗНОСТЬДАТ(СобытияДокументовВПакетахАктуальныйСрезПоследних.ДатаОтправки, ВЫБОР
		|			КОГДА СобытияДокументовВПакетахАктуальныйСрезПоследних.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА &ТекущаяДата
		|			ИНАЧЕ СобытияДокументовВПакетахАктуальныйСрезПоследних.ДатаВозврата
		|		КОНЕЦ, ДЕНЬ) КАК КолвоДнейОжидания,
		|	ВЫБОР
		|		КОГДА НЕ СобытияДокументовВПакетахАктуальныйСрезПоследних.Событие В (ЗНАЧЕНИЕ(Перечисление.СобытияОтправкиДокументов.Возвращен), ЗНАЧЕНИЕ(Перечисление.СобытияОтправкиДокументов.Аннулирован))
		|				И РАЗНОСТЬДАТ(СобытияДокументовВПакетахАктуальныйСрезПоследних.ДатаОтправки, &ТекущаяДата, ДЕНЬ) > СобытияДокументовВПакетахАктуальныйСрезПоследних.ДоговорКонтрагента.СрокВозвратаДокументовКонтрагентомДни
		|			ТОГДА РАЗНОСТЬДАТ(СобытияДокументовВПакетахАктуальныйСрезПоследних.ДатаОтправки, &ТекущаяДата, ДЕНЬ) - СобытияДокументовВПакетахАктуальныйСрезПоследних.ДоговорКонтрагента.СрокВозвратаДокументовКонтрагентомДни
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КолвоДнейПросрочки
		|ИЗ
		|	РегистрСведений.СобытияДокументовВПакетахАктуальный.СрезПоследних КАК СобытияДокументовВПакетахАктуальныйСрезПоследних
		|ГДЕ
		|	СобытияДокументовВПакетахАктуальныйСрезПоследних.Документ = &Документ";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Документ", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ВыборкаДетальныеЗаписи)
	КонецЦикла;
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьДатуПодписанияДиадок(ДокСсылка)
	
	СчФ = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(ДокСсылка, "СчетФактураВыданный");
	
	Если НЕ ЗначениеЗаполнено(СчФ) Тогда
		Возврат Дата(1,1,1);
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Диадок_Документы.DocumentId КАК DocumentId
		|ПОМЕСТИТЬ ВТ_Исх
		|ИЗ
		|	Справочник.Диадок_Документы КАК Диадок_Документы
		|ГДЕ
		|	Диадок_Документы.Документ = &Документ
		|	И Диадок_Документы.Направление = ""Исходящее""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕстьNull(Диадок_Документы.ДатаПодписиКонтрагентом,ДАТАВРЕМЯ(1,1,1)) КАК ДатаПодписиКонтрагентом
		|ИЗ
		|	ВТ_Исх КАК ВТ_Исх
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Диадок_Документы КАК Диадок_Документы
		|		ПО ВТ_Исх.DocumentId = Диадок_Документы.DocumentId
		|			И Диадок_Документы.Направление = ""Входящее""";
	
	Запрос.УстановитьПараметр("Документ", СчФ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ДатаПодписиКонтрагентом;
	КонецЦикла;
		
	Возврат Дата(1,1,1);
	
КонецФункции	

&НаСервере
Функция ПолучитьТранзитДляКлиентаПокументаОснования() //ДИТ Шевченко А.В. 17.01.2024 US 91366 TA 93137
	Результат = Неопределено;
	
	Если Объект.СчетаНаОплатуПокупателям.Количество()>0 Тогда
		ПервыйСчетПокупателю = Объект.СчетаНаОплатуПокупателям[0].СчетПокупателю;		
		Результат = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьТранзитДляКлиентаПоДокументу(ПервыйСчетПокупателю);				
	КонецЕсли;
	
	Возврат Результат;
КонецФункции//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

&НаКлиенте 
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтаФорма,Команда,Объект);	
КонецПроцедуры  

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
          ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
          ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры 

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	СтараяВалюта = Объект.ВалютаДокумента;
	СтарыйКурс = Объект.КурсВзаиморасчетов;
	СтараяКратность = Объект.КратностьВзаиморасчетов;
	
	НадоОчиститьРСчета = Ложь;
	
	Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		СтрПараметров = КонтрагентыДоговоры_сервер.ПолучитьВалютуДоговора(Объект.ДоговорКонтрагента, Объект.Дата);
		НадоОчиститьРСчета = (Объект.ВалютаДокумента <> СтрПараметров.Валюта);
		Объект.ВалютаДокумента = СтрПараметров.Валюта;
		Объект.КурсВзаиморасчетов = СтрПараметров.Курс;
		Объект.КратностьВзаиморасчетов = СтрПараметров.Кратность;
	КонецЕсли;
	
	Если НадоОчиститьРСчета Тогда
		Объект.БанковскийСчетОрганизации = неопределено;
	КонецЕсли;
	Если СтараяВалюта <> Объект.ВалютаДокумента  или СтарыйКурс <> Объект.КурсВзаиморасчетов  Тогда
		СтруктураТекущая = Новый Структура;
		СтруктураТекущая.Вставить("Валюта",СтараяВалюта);
		СтруктураТекущая.Вставить("Курс",СтарыйКурс);
		СтруктураТекущая.Вставить("Кратность",СтараяКратность);
		СтруктураНовая = Новый Структура;
		СтруктураНовая.Вставить("Валюта",Объект.ВалютаДокумента);
		СтруктураНовая.Вставить("Курс",Объект.КурсВзаиморасчетов);
		СтруктураНовая.Вставить("Кратность",Объект.КратностьВзаиморасчетов);
		
		ПересчитатьСуммыДокументаПоВалютеВзаиморасчетов(СтруктураТекущая, СтруктураНовая);
		Для каждого Стр из Объект.Услуги Цикл
			БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(Стр,Объект.СуммаВключаетНДС);
		КонецЦикла;

		РассчитатьСуммыВсегоПоДокументу();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммыДокументаПоВалютеВзаиморасчетов(СтруктураТекущая,СтруктураНовая)
	//ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, начало
	ОкруглениеКурса = Справочники.ФормированиеФинДокументов.ПолучитьЗначениеОкругленияКурсаИзПравил(Объект.ПравилоФормирования);
	//ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, конец
	Для каждого Стр из Объект.Услуги Цикл
		Всего = Стр.Сумма +?(Объект.СуммаВключаетНДС,0,Стр.СуммаНДС);
		//Всего = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Всего, СтруктураТекущая,СтруктураНовая);
		//ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, начало
		Всего = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Всего, СтруктураТекущая,СтруктураНовая, , ОкруглениеКурса);
		//ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, конец
		Стр.Сумма = ?(Объект.СуммаВключаетНДС, Всего,Всего/(1+(БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Стр.СтавкаНДС)/100)));
		Стр.СуммаНДС = ?(Объект.СуммаВключаетНДС,  Всего*БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Стр.СтавкаНДС)/100,Всего- Стр.Сумма);
		Стр.Цена = Стр.Сумма/Стр.Количество;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	ДанныеПоУмолчанию = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСчетДоговорПоУмолчанию(Объект.Контрагент);
	Если ЗначениеЗаполнено(ДанныеПоУмолчанию.Договор) Тогда 
		Объект.ДоговорКонтрагента = ДанныеПоУмолчанию.Договор;
	КонецЕсли;     
	
	//ДИТ Авдеева В.С. 43329 29.04.2022 Начало     
	СтруктураРуководитель = ОтветственныеЛица_сервер.ПолучитьРуководителя(Объект.Контрагент, ТекущаяДата());
	Объект.РуководительКонтрагента = СтруктураРуководитель.Ссылка;
	//ДИТ Авдеева В.С. 43329 29.04.2022 Конец  

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомитентПриИзмененииНаСервере()
	ДанныеПоУмолчанию = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСчетДоговорПоУмолчанию(Объект.Контрагент);
	Если ЗначениеЗаполнено(ДанныеПоУмолчанию.Договор) Тогда 
		Объект.ДоговорКомитента = ДанныеПоУмолчанию.Договор;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомитентПриИзменении(Элемент)
	КомитентПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьСодержанияУслугиВагонами(Команда)
	ТД = Элементы.Услуги1.ТекущиеДанные;
	ПолноеОписание = ТД.Содержание + Символы.ПС+ТД.СписокТС;
	ТД.Содержание = ПолноеОписание;
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьСодержаниеУслугиКТК(Команда)
	
	ТД = Элементы.Услуги1.ТекущиеДанные;
	ПолноеОписание = ТД.Содержание + Символы.ПС+ТД.СписокТЕ;
	ТД.Содержание = ПолноеОписание;

КонецПроцедуры

&НаКлиенте
Процедура АгентскиеУслуги1ПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Если Объект.ЭтоКомиссия Тогда
			ТД = Элементы.АгентскиеУслуги1.ТекущиеДанные;
			ТД.Контрагент = Объект.Комитент;
			ТД.ДоговорКонтрагента = Объект.ДоговорКомитента;
		КонецЕсли;
	КонецЕСли;
КонецПроцедуры

&НаКлиенте
Процедура АгентскиеУслуги1КоличествоПриИзменении(Элемент)
	СтрТЧ = Элементы.АгентскиеУслуги1.ТекущиеДанные;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТЧ);
	БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(СтрТЧ,Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
	РассчитатьСуммыВсегоПоДокументу();

КонецПроцедуры

&НаКлиенте
Процедура АгентскиеУслуги1ЦенаПриИзменении(Элемент)
	СтрТабЧасти = Элементы.АгентскиеУслуги1.ТекущиеДанные;
	
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТабЧасти);
	БухгалтерскийУчетОбщиеПроцедурыКлиент.ПересчитатьСуммыНДС(СтрТабЧасти,Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТабЧасти,Объект.СуммаВключаетНДС);
	РассчитатьСуммыВсегоПоДокументу();

КонецПроцедуры

&НаКлиенте
Процедура АгентскиеУслуги1СтавкаНДСПриИзменении(Элемент)
	СтрТЧ = Элементы.АгентскиеУслуги1.ТекущиеДанные;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуСтрокиТабличнойЧасти(СтрТЧ);
	СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСуммуНДС(СтрТЧ.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(СТрТЧ.СтавкаНДС), Объект.УчитыватьНДС, Объект.СуммаВключаетНДС);
	СтрТч.СуммаНДС = СуммаНДС;
	БухгалтерскийУчетОбщиеПроцедурыКлиент.РассчитатьСуммуВсегоПоСтроке(СтрТЧ,Объект.СуммаВключаетНДС);
	РассчитатьСуммыВсегоПоДокументу();

КонецПроцедуры

&НаКлиенте
Процедура excel_ВставитьВагоны(Команда)
	
	Если Элементы.Услуги1.ТекущиеДанные = неопределено Тогда Возврат; КонецЕсли;
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВставкиExcel", ЭтаФорма, Новый Структура("Вагоны", Истина));
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("Вагоны", Истина), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура excel_ВставитьКонтейнеры(Команда)
	
	Если Элементы.Услуги1.ТекущиеДанные = неопределено Тогда Возврат; КонецЕсли;
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВставкиExcel", ЭтаФорма, Новый Структура("КТК", Истина));
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("КТК", Истина), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВставкиExcel(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	ТекД = Элементы.Услуги1.ТекущиеДанные;
	
	Если Параметр1 <> неопределено И Параметр2 <> неопределено И Параметр2.Свойство("Вагоны") Тогда
		
		ТекД.СписокТС = СтрСоединить(Параметр1, ";");
		
	ИначеЕсли Параметр1 <> неопределено И Параметр2 <> неопределено И Параметр2.Свойство("КТК") Тогда
		
		ТекД.СписокТЕ = СтрСоединить(Параметр1, ";");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Услуги1НоменклатураПриИзменении(Элемент)
	ТД= Элементы.Услуги1.ТекущиеДанные;
	ТД.Содержание = ПолучитьСодержаниеНаСервере(ТД.Номенклатура);

КонецПроцедуры

&НаСервере
Функция ПолучитьСодержаниеНаСервере(Номенклатура)
	Возврат Номенклатура.НаименованиеПолное;
КонецФункции

&НаКлиенте
Процедура АгентскиеУслуги1НоменклатураПриИзменении(Элемент)
	ТД= Элементы.АгентскиеУслуги1.ТекущиеДанные;
	ТД.Содержание = ПолучитьСодержаниеНаСервере(ТД.Номенклатура);

КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Оп = Новый ОписаниеОповещения("ОповещениеВыбораПериодаЗавершение",ЭтотОбъект);
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Показать(Оп); 

КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВыбораПериодаЗавершение(Период3, ДополнительныеПараметры) Экспорт

	Если Период3 = неопределено Тогда Возврат; КонецЕсли;
	
	//Период = Формат(Период3.ДатаНачала,"ДФ='ММММ гггг'") + " г.";
	
	//Объект.ПериодВО = Период3.ДатаНачала;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДатыДокументаНаСервере()
//Евросиб Гудкова( 30.10.2019 
    Документ = РеквизитФормыВЗначение("Объект");
    Документ.УстановитьДатыДокумента();
    ЗначениеВРеквизитФормы(Документ, "Объект");
//было
//	ОбновитьДатуДокумента();
// Евросиб Гудкова) 	
	
КонецПроцедуры

&НаСервере
Функция НайтиМаксимальнуюДатуТД(Реквизит);
	СтрокаТД = "";
	Для каждого Стр из Объект.Услуги Цикл
		СтрокаТД = СтрокаТД+?(СтрокаТД = "","",";")+Стр.СписокТД;
	КонецЦикла;
	МассивНомеровТД = СтрРазделить(СтрокаТД,";",Ложь);
	ДатаМакс = ЗапросПоТД(МассивНомеровТД,Реквизит);	
	
	Возврат ДатаМакс;
КонецФункции

&НаСервере
Функция ЗапросПоТД(МассивТД,Реквизит)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	МАКСИМУМ(ТранспортныйДокумент."+Реквизит+") КАК Дата
	                      |ИЗ
	                      |	Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	                      |ГДЕ
	                      |	ТранспортныйДокумент.Номер В(&МассивНомеров)");
	Запрос.УстановитьПараметр("МассивНомеров",МассивТД);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат ?(Выборка.Дата = NULL, Дата('00010101'), Выборка.Дата);
	КонецЕсли;
	Возврат Дата('00010101');

КонецФункции

//Евросиб Гудкова( 30.10.2019
#Область плохо
//&НаСервере
//Процедура ОбновитьДатуДокумента() 
//		//Установка даты оказания услуги
//	Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента.ПравилоФормированияДатыУслуги) Тогда
//		Если Объект.ДоговорКонтрагента.ПравилоФормированияДатыУслуги = Перечисления.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеОтправления тогда
//			МаксДатаОтправки = НайтиМаксимальнуюДатуТД("Дата");
//			Объект.ДатаДокумента = МаксДатаОтправки;
//			//Объект.ПериодВО = НачалоМесяца(МаксДатаОтправки);
//			
//		ИначеЕсли Объект.ДоговорКонтрагента.ПравилоФормированияДатыУслуги = Перечисления.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеРаскредитации Тогда
//			МаксДатаОтправки = НайтиМаксимальнуюДатуТД("ДатаРаскредитации");
//			Объект.ДатаДокумента = МаксДатаОтправки;
//			//Объект.ПериодВО = НачалоМесяца(МаксДатаОтправки);
//		ИначеЕсли Объект.ДоговорКонтрагента.ПравилоФормированияДатыУслуги = Перечисления.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеПрибытия Тогда
//			МаксДатаОтправки = НайтиМаксимальнуюДатуТД("ДатаПрибытия");
//			Объект.ДатаДокумента = МаксДатаОтправки;
//			//Объект.ПериодВО = НачалоМесяца(МаксДатаОтправки);
//		ИначеЕсли Объект.ДоговорКонтрагента.ПравилоФормированияДатыУслуги = Перечисления.СпособыОпределенияДатыДокументаДляДоговора.ПоПятидневке Тогда
//			МаксДатаОтправки = НайтиМаксимальнуюДатуТД("Дата");
//			Если День(МаксДатаОтправки) <= 5 Тогда
//				Объект.ДатаДокумента = Дата(Год(МаксДатаОтправки),Месяц(МаксДатаОтправки),5);
//			ИначеЕсли День(МаксДатаОтправки) <= 10 и День(МаксДатаОтправки) > 5 Тогда
//				Объект.ДатаДокумента = Дата(Год(МаксДатаОтправки),Месяц(МаксДатаОтправки),10);
//			ИначеЕсли День(МаксДатаОтправки) <= 15 и День(МаксДатаОтправки) > 10 Тогда
//				Объект.ДатаДокумента = Дата(Год(МаксДатаОтправки),Месяц(МаксДатаОтправки),15);
//			ИначеЕсли День(МаксДатаОтправки) <= 20 и День(МаксДатаОтправки) > 15 Тогда
//				Объект.ДатаДокумента = Дата(Год(МаксДатаОтправки),Месяц(МаксДатаОтправки),20);
//			ИначеЕсли День(МаксДатаОтправки) <= 25 и День(МаксДатаОтправки) > 20 Тогда
//				Объект.ДатаДокумента = Дата(Год(МаксДатаОтправки),Месяц(МаксДатаОтправки),25);
//			ИначеЕсли День(МаксДатаОтправки) > 25 Тогда
//				Объект.ДатаДокумента = КонецМесяца(МаксДатаОтправки);
//			КонецЕсли;
//			//Объект.ПериодВО = НачалоМесяца(МаксДатаОтправки);
//		ИначеЕсли Объект.ДоговорКонтрагента.ПравилоФормированияДатыУслуги = Перечисления.СпособыОпределенияДатыДокументаДляДоговора.ПоДекаде Тогда	
//			МаксДатаОтправки = НайтиМаксимальнуюДатуТД("Дата");
//			Если День(МаксДатаОтправки) <= 10 Тогда
//				Объект.ДатаДокумента = Дата(Год(МаксДатаОтправки),Месяц(МаксДатаОтправки),10);
//			ИначеЕсли День(МаксДатаОтправки) <= 20 и День(МаксДатаОтправки) > 10 Тогда
//				Объект.ДатаДокумента = Дата(Год(МаксДатаОтправки),Месяц(МаксДатаОтправки),20);
//			ИначеЕсли День(МаксДатаОтправки) > 20 Тогда
//				Объект.ДатаДокумента = КонецМесяца(МаксДатаОтправки);
//			КонецЕСли;
//			//Объект.ПериодВО = НачалоМесяца(МаксДатаОтправки);

//		ИначеЕсли Объект.ДоговорКонтрагента.ПравилоФормированияДатыУслуги = Перечисления.СпособыОпределенияДатыДокументаДляДоговора.ДваРазаВМесяц Тогда				
//			МаксДатаОтправки = НайтиМаксимальнуюДатуТД("Дата");
//			Если День(МаксДатаОтправки) <= 15 Тогда
//				Объект.ДатаДокумента = Дата(Год(МаксДатаОтправки),Месяц(МаксДатаОтправки),15);
//			ИначеЕсли День(МаксДатаОтправки) > 15 Тогда
//				Объект.ДатаДокумента = КонецМесяца(МаксДатаОтправки);
//			КонецЕСли;
//			//Объект.ПериодВО = НачалоМесяца(МаксДатаОтправки);
//		ИначеЕсли Объект.ДоговорКонтрагента.ПравилоФормированияДатыУслуги = Перечисления.СпособыОпределенияДатыДокументаДляДоговора.РазВМесяц Тогда	
//			МаксДатаОтправки = НайтиМаксимальнуюДатуТД("Дата");
//			Объект.ДатаДокумента = КонецМесяца(МаксДатаОтправки);
//			Объект.ПериодВО = НачалоМесяца(МаксДатаОтправки);
//		
//		КонецЕсли;
//		//Проверка на закрытый период
//		Если Объект.Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия Тогда
//			Если Объект.ДатаДокумента < ОткрытыйПериод() Тогда
//				Объект.ДатаДокумента = ОткрытыйПериод();
//				//Объект.ПериодВО = НачалоМесяца(Объект.ДатаДокумента);
//			КонецЕсли;
//		Иначе
//			Если Объект.ДатаДокумента >= ОткрытыйПериод() Тогда
//				СледующийПериодЗаОткрытым = НачалоМесяца(ДобавитьМесяц(ОткрытыйПериод(),1));
//				Если Объект.ДатаДокумента <= СледующийПериодЗаОткрытым Тогда
//					Объект.ДатаДокумента = КонецМесяца(ОткрытыйПериод());
//					//Объект.ПериодВО = НачалоМесяца(Объект.ДатаДокумента);
//				КонецЕсли;
//			Иначе
//					
//				Объект.ДатаДокумента = ОткрытыйПериод();
//				//Объект.ПериодВО = НачалоМесяца(Объект.ДатаДокумента);
//			КонецЕсли;
//		КонецЕсли;	

//	Иначе 
//		МаксДата = Дата('00010101');
//		Для каждого Стр из Объект.Услуги Цикл
//			Если Стр.Номенклатура.ВидУслуги = Перечисления.ВидыУслуг.ПредоставлениеВагонов Тогда 
//				МассивНомеровТД = СтрРазделить(Стр.СписокТД,";",Ложь);
//				ДатаМаксПоСтроке = ЗапросПоТД(МассивНомеровТД,"Дата");
//				МаксДата = ?(МаксДата > ДатаМаксПоСтроке, МаксДата, ДатаМаксПоСтроке);
//			ИначеЕсли Стр.Номенклатура.ВидУслуги = Перечисления.ВидыУслуг.ТранспортноЭкспедиторские Тогда
//				МассивНомеровТД = СтрРазделить(Стр.СписокТД,";",Ложь);
//				ДатаМаксПоСтроке = ЗапросПоТД(МассивНомеровТД,"ДатаПрибытия");
//				МаксДата = ?(МаксДата > ДатаМаксПоСтроке, МаксДата, ДатаМаксПоСтроке);
//			ИначеЕсли Стр.Номенклатура.ВидУслуги = Перечисления.ВидыУслуг.АгентскиеУслуги Тогда
//				//ДатаМаксПоСтроке = 
//			ИначеЕсли Стр.Номенклатура.ВидУслуги = Перечисления.ВидыУслуг.ТерминальнаяОбработкаГрузов Тогда
//				//ДатаМаксПоСтроке = 
//			ИначеЕсли Стр.Номенклатура.ВидУслуги = Перечисления.ВидыУслуг.Аренда Тогда
//				//
//			ИначеЕсли Стр.Номенклатура.ВидУслуги = Перечисления.ВидыУслуг.Комплексные Тогда	
//				//
//			КонецЕсли;
//		КонецЦикла;
//		Если Объект.Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия Тогда
//			Если МаксДата < ОткрытыйПериод() Тогда
//				Объект.ДатаДокумента = ОткрытыйПериод();
//				//Объект.ПериодВО = НачалоМесяца(Объект.ДатаДокумента);
//			Иначе
//				Объект.ДатаДокумента = МаксДата;
//				//Объект.ПериодВО = НачалоМесяца(МаксДата);
//				
//			КонецЕсли;
//		Иначе
//			ДатаПаспортаСделки = Объект.ДоговорКонтрагента.ДатаПаспортаСделки;
//			
//			Если МаксДата >= ОткрытыйПериод() Тогда
//				СледующийПериодЗаОткрытым = НачалоМесяца(ДобавитьМесяц(ОткрытыйПериод(),1));
//				Если Объект.ДатаДокумента < СледующийПериодЗаОткрытым Тогда
//					Объект.ДатаДокумента = КонецМесяца(ОткрытыйПериод());
//					Объект.ПериодВО = НачалоМесяца(Объект.ДатаДокумента);
//				Иначе
//					Если ДатаПаспортаСделки> МаксДата Тогда
//						Объект.ДатаДокумента  = ДатаПаспортаСделки;
//						//Объект.ПериодВО = НачалоМесяца(Объект.ДатаДокумента);
//					Иначе
//						Объект.ДатаДокумента = Объект.Дата;
//						//Объект.ПериодВО = НачалоМесяца(Объект.Дата);
//					КонецЕСли;
//				КонецЕсли;
//			Иначе
//					
//				Объект.ДатаДокумента = ОткрытыйПериод();
//				//Объект.ПериодВО = НачалоМесяца(Объект.ДатаДокумента);
//			КонецЕсли;
//		КонецЕсли;	
//	КонецЕсли;
//	Если Не ЗначениеЗаполнено(Объект.ДатаДокумента) Тогда
//		Объект.ДатаДокумента = ТекущаяДата();
//	КонецЕсли;
//КонецПроцедуры
//&НаСервере
//Функция ОткрытыйПериод()
//	ДатаЗП = Дата('00010101');
//	Запрос = Новый Запрос("ВЫБРАТЬ
//	                      |	ЗакрытыеПериодыСрезПоследних.Период КАК Период
//	                      |ИЗ
//	                      |	РегистрСведений.ЗакрытыеПериоды.СрезПоследних(, Организация = &Организация) КАК ЗакрытыеПериодыСрезПоследних");
//	Запрос.УстановитьПараметр("Организация", Объект.Организация);
//	Выборка = Запрос.Выполнить().Выбрать();
//	Если Выборка.Следующий() Тогда
//		ДатаЗП = Выборка.Период;
//	КонецЕсли;
//	Если ДатаЗП <> Дата('00010101') Тогда
//		СледующийОткрытыйМесяц = НачалоМесяца(ДобавитьМесяц(ДатаЗП,1));
//	Иначе
//		СледующийОткрытыйМесяц = Дата('00010101');
//	КонецЕсли;
//	
//	Возврат СледующийОткрытыйМесяц;
//	
//КонецФункции
#КонецОбласти
// Евросиб Гудкова) 

&НаКлиенте
Процедура ОбновитьДатыДокумента(Команда)
	
	ОбновитьДатыДокументаНаСервере();
	ОтчПериод = Формат(Объект.ПериодВО,"ДФ='ММММ гггг'") + " г.";
	//Период = Формат(Объект.ПериодВО,"ДФ='ММММ гггг'") + " г.";
	//Евросиб Гудкова( 30.10.2019 не соответсвует ТЗ
// Объект.ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Объект.Организация);	
	// Евросиб Гудкова)
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаДокументаПриИзменении(Элемент)
	// ДИТ US 51148 TA 64324 Евсенкин М.А. Начало: 19.01.2023
	Если Не КонтрольДоступностиДокументов_сервер.ПроверитьДоступностьРоли("dc_РазрешитьРедактированиеИСФ") Тогда // разрешить редактировать без учета разрешенного периода
		Если КонтрольДоступностиДокументов_сервер.ПроверитьДоступностьРоли("dc_РаботаСДокументамиКлиентов") Тогда // только в разрешенном периоде и периоде ВО
			Если Объект.ДатаДокумента < Объект.ПериодВО Тогда  
				Если Объект.ДатаДокумента >= ДатаНачалаРазрешенногоПериодаПереноса
					И Объект.ДатаДокумента <= ДатаОкончанияРазрешенногоПериодаПереноса 
					Или КонтрольДоступностиДокументов_сервер.ПроверитьДоступностьРоли("dc_РедактированиеДатыДокумента") Тогда // Евросиб US 89967 TA 91565 Рыбьяков К.А. 03.10.2024 ((
					//Все ок
				Иначе       
					Ошибки = Неопределено;
					ТекстОшибки = СтрШаблон("Дата документа может быть перенесена в период %1 - %2",Формат(ДатаНачалаРазрешенногоПериодаПереноса,"ДФ=dd.MM.yyyy"),Формат(ДатаОкончанияРазрешенногоПериодаПереноса,"ДФ=dd.MM.yyyy"));
					ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,"Объект.ДатаДокумента",ТекстОшибки);
					ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
					Объект.ДатаДокумента = ДатаДокументаТекущая; 
					Возврат;	
				КонецЕсли;
			КонецЕсли;
		Иначе  
			Объект.ДатаДокумента = ДатаДокументаТекущая;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	// ДИТ US 51148 TA 64324 Евсенкин М.А. Конец: 19.01.2023
	
	
//	Объект.ПериодВО = НачалоМесяца(Объект.ДатаДокумента);
	//Период = Формат(Объект.ПериодВО,"ДФ='ММММ гггг'") + " г.";
	//Евросиб - АСуслов 24.01.2022 16:52:15 #0258238
	//(
	Если Год(Объект.ДатаДокумента) <> Год(ДатаДокументаТекущая) Тогда
		//системную дату поставим в конец года выбранной даты        
		//или текущую, если год совпадает с текущим годом
		Если Год(Объект.ДатаДокумента) = Год(ТекущаяДата()) Тогда
			Объект.Дата = ТекущаяДата();
		Иначе
			Объект.Дата = КонецГода(Объект.ДатаДокумента);
		КонецЕсли;
		//очистим номер, чтобы при записи он заполнился с учетом новой даты
		//ДИТ, Беляев СЮ, Ticket#0316040, 04-07-2023, начало (закоментировал, перенёс в модуль документа)
		//Объект.Номер = "";
		//Объект.НомерДляПечати = "";
		//ДИТ, Беляев СЮ, Ticket#0316040, 04-07-2023, конец
	КонецЕсли;                     
	ДатаДокументаТекущая = Объект.Дата;
	//)
	//Евросиб - АСуслов 24.01.2022 16:52:46 #0258238
	
	//Субботин 83554 12.04.2024 начало 
	Если Объект.УслугиПрошлыхПериодов Тогда
		 Объект.УслугиПрошлыхПериодов = Ложь;
	КонецЕсли; 
	//Субботин 83554 12.04.2024 Конец	 

	// Евросиб US 89967 TA 91565 Рыбьяков К.А. 03.10.2024 ((
	Если Объект.ДатаДокумента < Объект.ПериодВО Тогда
		Элементы.ПричинаИзмененияДатыДокумента.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
	ПроверитьНаЗапретПечати = Истина;
	// Евросиб Рыбьяков К.А. 03.10.2024 ))
	
КонецПроцедуры

// + ОБЛАСТЬ СОСТОЯНИЯ

// Процедура обновляет панель текущего пользователя
&НаСервере
Процедура ОбновитьПанельТекущегоПользователя()
	
	МаршрутизацияСервер.ОбновитьПанельТекущегоПользователя(Объект, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
КонецПроцедуры

// Функция обновляет панель состояний документа для графического отражения его движения по состояниям
&НаСервере
Процедура ОбновитьПанельСостояний()
	
	МаршрутизацияСервер.ОбновитьПанельСостояний(ЭтотОбъект);
	
КонецПроцедуры

// Этот обработчик вызывается при нажатии на состояния на панели состояний
// Ссылка на него устанавливается кодом, поэтому при проверке конфигурации 1с может сказать, что эта функция не испольузется
// Не верьте 1с!
&НаКлиенте
Процедура ОбработчикНажатияПлитокСостояния(П1 = неопределено, П2 = неопределено) Экспорт
	МаршрутизацияКлиент.ОбработчикНажатияНаПлиткуОбщий(П1, П2);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	//Евросиб Каблов 11.07.2020 ( TASK 23506
	//ОбработатьБлокировкуДокумента();	
	КонтрольДоступностиДокументов_сервер.ОбработатьБлокировкуЭлементовФормы(Объект.Ссылка, Элементы);
	//Евросиб Каблов 11.07.2020 )
	
	// Евросиб Фролов (23.11.2021 Ticket№ 0244435
	ЗаполнитьДоплатныеПСЦ();
	// Евросиб Фролов)
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийИсполнитель_СтатусПриИзменении(Элемент)
	
	// обновляем информацию по состоянию 
	МаршрутизацияКлиент.ТекущийИсполнитель_СтатусПриИзменении(Объект, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
	ОбновитьПанельСостояний();
	
КонецПроцедуры

&НаКлиенте
Процедура ПовторнаяМаршрутизация(Команда)
	
	Если Объект.Маршрутизировать Тогда
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыЗапроса.Вставить("Договор", Объект.ДоговорКонтрагента);
//Евросиб Гудкова( 12.09.2020 Ticket№ 0206196
		ПараметрыЗапроса.Вставить("ЭДО", ЕстьЭДОСКонтрагентом(Объект.Контрагент));
		ПараметрыЗапроса.Вставить("ЦФО", Объект.ЦФО);
// Евросиб Гудкова) 
//Евросиб Максимова  16.02.2021
ПараметрыЗапроса.Вставить("ОплатаОригинал",ЕстьОплатаОригинал(Объект.ДоговорКонтрагента));
//Евросиб

		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьРТУ(ПараметрыЗапроса, Объект.Дата);

		Если РезультатЗапроса.Количество() > 0 Тогда
			Отказ = ПроверитьУказатьОтветственных(РезультатЗапроса, Ложь);
		Иначе
			Сообщить("Для документа не найден подходящий маршрут. Изменения не внесены!");
		КонецЕсли;
		
		ОбновитьПанельСостояний();
	КонецЕсли;
	
	//Если Объект.Маршрутизировать Тогда
	//	ПараметрыЗапроса = Новый Соответствие;
	//	ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
	//	ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
	//	ПараметрыЗапроса.Вставить("Договор", Объект.ДоговорКонтрагента);
	//	РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьПоступлениеНаРС(ПараметрыЗапроса, Объект.Дата);
	//	Если РезультатЗапроса.Количество() > 0 Тогда
	//		ПримененныйМаршрут = РезультатЗапроса[0].Ссылка;
	//		
	//		ТребуетсяДонастройка = Ложь;
	//		Для каждого Стр из РезультатЗапроса Цикл
	//			Если (Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Стр.Исполнитель)) ИЛИ
	//				(Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Стр.Наблюдатель)) Тогда
	//				ТребуетсяДонастройка = Истина;
	//				Прервать;
	//			КонецЕсли;
	//		КонецЦикла;
	//		Если ТребуетсяДонастройка Тогда
	//			
	//			Отказ = Истина;
	//			
	//			// очищаем таблицу состояний
	//			Объект.Состояния.Очистить();
	//			// открываем форму для заполнения таблицы состояний
	//			ПараметрыОтбора = Новый СТруктура;
	//			ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация",ПримененныйМаршрут);
	//			ОпОп = Новый ОписаниеОповещения("УстановкаОтветственных", ЭтаФорма);
	//			ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//		КонецЕсли;
	//	Иначе
	//		Сообщить("Для документа не найден подходящий маршрут. Изменения не внесены!");
	//	КонецЕсли;
	//	
	//	ОбновитьПанельСостояний();
	//КонецЕсли;
	
КонецПроцедуры

// - ОБЛАСТЬ СОСТОЯНИЯ



&НаКлиенте
Процедура Делегировать(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ВыборДелегирования", ЭтаФорма);
	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаВыбора",,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборДелегирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	Для Сч = 0 По Объект.Состояния.Количество()-1 Цикл
		Если Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение") ИЛИ Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.ВРаботе") Тогда
			Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Новый");
			НСтр = Объект.Состояния.Вставить(Сч);
			НСтр.Состояние = ПредопределенноеЗначение("Справочник.Состояния.ДелегированноеСогласование");
			НСтр.Исполнитель = Параметр1;
			НСтр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение");
			ОбновитьПанельСостояний();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Рецензирование(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаРецензирования", ЭтаФорма);
	ПараметрыФормы = Новый Структура("РецензОбъект", Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.РецензированиеПриСогласовании", ПараметрыФормы,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРецензирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СостоянияСтатусСогласованияПриИзменении(Элемент)
	
	ТекД = Элементы.Состояния.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ТекД.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛистСогласования(Команда)
	
	ТабДок = МаршрутизацияСервер.ПолучитьТабдокЛистаСогласования(Объект.Ссылка);
	ТабДок.Показать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "АвторизацияВДиадокеПройдена" Тогда
		Источник.КомандаЗагрузитьИОтправить(Неопределено);		
	ИначеЕсли ИмяСобытия = "ОбновленыПризнакиРазрешенияКорректировокРТУ" Тогда
		ОбновитьОтображениеПанелиКорректировок();
	КонецЕсли;
	
	//Евросиб Каблов 24.11.2025 ( #111016
	Элементы.СчетаНаОплатуПокупателям.Обновить();
	//Евросиб Каблов 24.11.2025 ) #111016

//Евросиб Литвинов ( 12.11.2021 #42060 #0248963
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
        ОбновитьЭлементыДополнительныхРеквизитов();
        УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
    КонецЕсли;
//Евросиб Литвинов ) 12.11.2021 #42060 #0248963

КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеПанелиКорректировок()
	
	Рез = КорректировкиРТУСервер.ПолучитьСтатусРазрешенияКорректировки(Объект.Ссылка);
	Элементы.ГруппаКорректировкаИсправление.Видимость = Рез.Корректировка ИЛИ Рез.Исправление;
	корр_РазрешенаКорректировка = Рез.Корректировка;
	корр_РазрешеноИсправление = Рез.Исправление;
	корр_Описание = Рез.Описание;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетНаОплатуПриИзменении(Элемент)
	ОповещениеВопроса = Новый ОписаниеОповещения("ОбработкаВопросаЗаполненияПоСчету", ЭтаФорма);
//Евросиб Гудкова( 22.10.2020 Ticket№ 1
	//ПоказатьВопрос(ОповещениеВопроса, "При изменении счета на оплату весь документ будет перезаполнен по данным выбранного счета. Продолжить?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет);
	ОбработкаВопросаЗаполненияПоСчету();
// Евросиб Гудкова) 	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаЗаполненияПоСчету(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 <> КодВозвратаДиалога.Да Тогда 
		СформироватьНомерДляПечати(); //Евросиб Гудкова( 22.10.2020 Ticket№ 1
		Возврат; 
	КонецЕсли;
	
	Если Параметр2 = неопределено Тогда
		ЗаполнитьДокументРТУПоСчетуНаСервере();
		РассчитатьСуммыВсегоПоДокументу();
		СформироватьНомерДляПечати();
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура СформироватьНомерДляПечати()
	//Евросиб Коханенко Н.А. 02.04.2024 (( #82079 
	//Объект.НомерДляПечати = Объект.Номер+"/"+?(Объект.СчетНаОплатуПокупателю.Номер<>"",Объект.СчетНаОплатуПокупателю.Номер+"/","")+?(Объект.Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия,"Р","Н");	
	//Евросиб СубботинВ #84453 02.07.2024 Начало // в связи с удаление реквизита, переделал фомирование номера для печати на 1 строку тч счетов
	//Объект.НомерДляПечати = Объект.Номер+"/"+?(Объект.СчетНаОплатуПокупателю.ПервоначальныйНомер<>"",Объект.СчетНаОплатуПокупателю.ПервоначальныйНомер+"/","")+?(Объект.Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия,"Р","Н");	
	ПервоначальныйНомерСчета = "";
	Если Объект.СчетаНаОплатуПокупателям.Количество()>0 Тогда
	ПервоначальныйНомерСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетаНаОплатуПокупателям[0].СчетПокупателю, "ПервоначальныйНомер");
	КонецЕсли;
	Объект.НомерДляПечати = Объект.Номер+"/"+?(ПервоначальныйНомерСчета<>"",ПервоначальныйНомерСчета+"/","")+?(Объект.Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия,"Р","Н");	
    //Евросиб СубботинВ #84453 02.07.2024 Конец
	//Евросиб Коханенко Н.А. 02.04.2024 )) #82079 
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьДокументРТУПоСчетуНаСервере()
		
	//Об = Объект.Ссылка.ПолучитьОбъект();
	Об = РеквизитФормыВЗначение("Объект");
	Об.Услуги.Очистить();
	Об.Товары.Очистить();
	Об.РасшифровкаУслугПоТС.Очистить();
	Об.АгентскиеУслуги.Очистить();

	Об.Заполнить(Объект.СчетНаОплатуПокупателю);
	ЗначениеВДанныеФормы(Об,Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчПериодРегулирование(Элемент, Направление, СтандартнаяОбработка)
	Объект.ПериодВО = ДобавитьМесяц(Объект.ПериодВО, Направление);
	ОтчПериод = Формат(Объект.ПериодВО, "ДФ='ММММ гггг'") + "г.";
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	//Для Каждого Стр Из Объект.Состояния Цикл
	//	// если исполнитель пустой, то проставляем тек пользователя
	//	Если НЕ ЗначениеЗаполнено(Стр.Исполнитель) И Стр.ТребуетсяУказатьИсполнителя Тогда 
	//		Сообщить("Требуется указать исполнителя");
	//		Отказ = Истина;
	//	КонецЕсли;
	//	Если НЕ ЗначениеЗаполнено(Стр.Наблюдатель) И Стр.ТребуетсяУказатьНаблюдателя Тогда 
	//		Сообщить("Требуется указать наблюдателя");
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = ПроверитьНеобходимостьМаршрутизации();
	Если Объект.Маршрутизировать И ДопСвойстваОбъекта.Количество() = 0 И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыЗапроса.Вставить("Договор", Объект.ДоговорКонтрагента);
//Евросиб Гудкова( 12.09.2020 Ticket№ 0206196
		ПараметрыЗапроса.Вставить("ЭДО", ЕстьЭДОСКонтрагентом(Объект.Контрагент));
		ПараметрыЗапроса.Вставить("ЦФО", Объект.ЦФО);
// Евросиб Гудкова) 
//Евросиб Максимова(
	    ПараметрыЗапроса.Вставить("ОплатаОригинал", ЕстьОплатаОригинал(Объект.ДоговорКонтрагента));
//Евросиб)
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьРТУ(ПараметрыЗапроса, Объект.Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			Отказ = ПроверитьУказатьОтветственных(РезультатЗапроса, Истина);
		КонецЕсли;
		
	КонецЕсли;
	
	//Если НЕ ПараметрыЗаписи.Свойство("СостоянияИзменены") Тогда
	//	
	//	ДляДанногоОбъектаТребуетсяПеремаршрутизация = ПроверитьНеобходимостьМаршрутизации();
	//	
	//	Если Объект.Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
	//		
	//		ПараметрыЗапроса = Новый Соответствие;
	//		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
	//		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
	//		ПараметрыЗапроса.Вставить("Договор", Объект.ДоговорКонтрагента);
	//		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьРТУ(ПараметрыЗапроса, Объект.Дата);
	//		Если РезультатЗапроса.Количество() > 0 Тогда
	//			ПримененныйМаршрут = РезультатЗапроса[0].Ссылка;
	//			
	//			ТребуетсяДонастройка = Ложь;
	//			Для каждого Стр из РезультатЗапроса Цикл
	//				Если (Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Стр.Исполнитель)) ИЛИ
	//					(Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Стр.Наблюдатель)) Тогда
	//					ТребуетсяДонастройка = Истина;
	//					Прервать;
	//				КонецЕсли;
	//			КонецЦикла;
	//			Если ТребуетсяДонастройка Тогда
	//				
	//				Отказ = Истина;
	//				
	//				// очищаем таблицу состояний
	//				Объект.Состояния.Очистить();
	//				// открываем форму для заполнения таблицы состояний
	//				ПараметрыОтбора = Новый СТруктура;
	//				ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация",ПримененныйМаршрут);
	//				ОпОп = Новый ОписаниеОповещения("УстановкаОтветственных", ЭтаФорма);
	//				ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры 


&НаКлиенте
Процедура УстановкаОтветственных(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда 
		Возврат; 
	КонецЕсли;
	
	Для Каждого Стр Из Параметр1 Цикл
		НовСтр = Объект.Состояния.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Стр);		
	КонецЦикла;
	Параметры.СохранитьДанныеСостояний = Истина;
	
	СтруктураЗаписиДанных = Новый СТруктура;
	СтруктураЗаписиДанных.Вставить("СостоянияИзменены",Истина);
	
	Записать(СтруктураЗаписиДанных);

КонецПроцедуры

&НаСервере
Функция ПроверитьНеобходимостьМаршрутизации()

	ДляДанногоОбъектаТребуетсяПеремаршрутизация = 
	НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ 
	Объект.Ссылка.Организация <> Объект.Организация ИЛИ 
	Объект.Ссылка.Контрагент <> Объект.Контрагент ИЛИ
	Объект.Ссылка.ДоговорКонтрагента <> Объект.ДоговорКонтрагента ИЛИ Объект.Состояния.Количество() = 0;
	
	Возврат ДляДанногоОбъектаТребуетсяПеремаршрутизация;
	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Евросиб Литвинов ( 30.12.21 #44592 Ticket#0254477 #44587 
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
		ТекущийОбъект.ДатаСоставления = ТекущийОбъект.ДатаДокумента;
	Иначе
		ДатаДокументаВБазе = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийОбъект.Ссылка, "ДатаДокумента");
		Если ТекущийОбъект.ДатаДокумента <> ДатаДокументаВБазе Тогда
			//Евросиб Каблов 09.04.2025 ( #105407			
			//Запрос = Новый Запрос;
			//Запрос.УстановитьПараметр("Период", НачалоМесяца(ТекущийОбъект.ДатаДокумента));
			//Запрос.Текст = 
			//"ВЫБРАТЬ ПЕРВЫЕ 1
			//|	1 КАК Поле1
			//|ИЗ
			//|	РегистрСведений.ЗакрытыеПериоды КАК ЗакрытыеПериоды
			//|ГДЕ
			//|	ЗакрытыеПериоды.Период >= &Период";   
			//Если НЕ Запрос.Выполнить().Пустой() Тогда
			ДатаОткрытогоПериода = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(ТекущийОбъект.Организация);
			Если ТекущийОбъект.ДатаДокумента < ДатаОткрытогоПериода Тогда
			//Евросиб Каблов 09.04.2025 )
				Если ЗначениеЗаполнено(ДатаДокументаВБазе) И Год(ТекущийОбъект.ДатаДокумента) <> Год(ДатаДокументаВБазе) Тогда
					ТекущийОбъект.ДатаСоставления = Мин(КонецМесяца(ТекущийОбъект.ПериодВО), ТекущийОбъект.Создано);
				Иначе
					ТекущийОбъект.ДатаСоставления = Мин(КонецМесяца(ТекущийОбъект.ПериодВО), ТекущийОбъект.Дата);
				КонецЕсли;
			Иначе
				ТекущийОбъект.ДатаСоставления = ТекущийОбъект.ДатаДокумента;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Евросиб Литвинов) 	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ДопСвойстваОбъекта", ДопСвойстваОбъекта);
	//Евросиб Каблов 28.07.2020 (
	ЗначениеПараметра = Неопределено;
	Если ПараметрыЗаписи.Свойство("СнятьПризнакВыставленУСчетаФактуры", ЗначениеПараметра) Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("СнятьПризнакВыставленУСчетаФактуры", ЗначениеПараметра);
	КонецЕсли;
	//Евросиб Каблов 11.07.2020 )
	
	//Евросиб Каблов 02.12.2020 ( Ticket#0215459
	ИзмененияЗапрещены = Отказ;
	ТекРежимЗаписи = Неопределено;
	ТекРежимПроведения = Неопределено;
	ПараметрыЗаписи.Свойство("РежимЗаписи", ТекРежимЗаписи);
	ПараметрыЗаписи.Свойство("РежимПроведения", ТекРежимПроведения);
	КонтрольДоступностиДокументов_сервер.ПроверитьДоступностьПолейДляИзменения(ТекущийОбъект, ИзмененияЗапрещены, ТекРежимЗаписи, ТекРежимПроведения);
	//Евросиб Каблов 02.12.2020 )
	
	//Если Параметры.СохранитьДанныеСостояний Тогда
	//	ТЗ = Объект.Состояния.Выгрузить();
	//	ТекущийОбъект.ДополнительныеСвойства.Вставить("Состояния", ТЗ);
	//	Параметры.СохранитьДанныеСостояний = Ложь;
	//КонецЕсли;
	

// Субботин TASK 72390 07.08.2023  Начало
     мВалютаРеглУчета =   Константы.ВалютаРегламентированногоУчета.Получить();
	Для каждого строка из ТекущийОбъект.Услуги цикл
		Если Объект.СуммаВключаетНДС тогда					
			строка.ВсегоСНДС  		= Валюта_сервер.ПересчитатьПоКурсу(Строка.Сумма, Объект.ВалютаДокумента, мВалютаРеглУчета, Объект.ДатаДокумента);
			строка.СуммаБезНалога 	= Валюта_сервер.ПересчитатьПоКурсу(Строка.Сумма - строка.СуммаНДС, Объект.ВалютаДокумента, мВалютаРеглУчета, Объект.ДатаДокумента);
		Иначе 
			строка.ВсегоСНДС  		= Валюта_сервер.ПересчитатьПоКурсу(Строка.Сумма + строка.СуммаНДС, Объект.ВалютаДокумента, мВалютаРеглУчета, Объект.ДатаДокумента);
			строка.СуммаБезНалога 	= Валюта_сервер.ПересчитатьПоКурсу(Строка.Сумма, Объект.ВалютаДокумента, мВалютаРеглУчета, Объект.ДатаДокумента);
		КонецЕсли;	
		строка.СуммаНДСРуб 			= Валюта_сервер.ПересчитатьПоКурсу(Строка.СуммаНДС, Объект.ВалютаДокумента, мВалютаРеглУчета, Объект.ДатаДокумента);
		строка.СтавкаНДСРуб 		= строка.СтавкаНДС ;
	КонецЦикла; 
	// Субботин TASK 72390 07.08.2023 Конец
	
	//Евросиб Литвинов ( 12.11.2021 #42060 #0248963	
	// Обработчик подсистемы "Свойства"
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	//Евросиб Литвинов ) 12.11.2021 #42060 #0248963 

	// Евросиб US 89967 TA 91565 Рыбьяков К.А. 03.10.2024 ((
	Если ПроверитьНаЗапретПечати Тогда
		Ответ = ЗапрещенаПечатьИОтправкаПоЭДО(ТекущийОбъект);
		ТекущийОбъект.ДатаЗапретаПечатиИОтправкиПоЭДО = Ответ.ДатаЗапрета;
		
		Если Ответ.ДатаЗапрета <> Дата("00010101") Тогда
			ТекущийОбъект.ДатаСоставления = Ответ.ДатаСоставления;
		КонецЕсли;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 25.10.2024 ))
	
	// Евросиб US 89967 TA 91565 Рыбьяков К.А. 03.10.2024 ((
	Если Объект.ДатаДокумента < Объект.ПериодВО И ДатаДокументаТекущая <> Объект.ДатаДокумента 
				И Не ЗначениеЗаполнено(Объект.ПричинаИзмененияДатыДокумента) Тогда
		Текст = НСтр("ru = 'Дата документа меньше Периода ВО. Необходимо заполнить причину изменения даты'");
		ОбщегоНазначения.СообщитьПользователю(Текст, , "ПричинаИзмененияДатыДокумента", "Объект", Отказ);
	ИначеЕсли Объект.ДатаДокумента >= Объект.ПериодВО И ДатаДокументаТекущая <> Объект.ДатаДокумента И ЗначениеЗаполнено(Объект.ПричинаИзмененияДатыДокумента) Тогда
		ТекущийОбъект.ПричинаИзмененияДатыДокумента = Справочники.ПричиныРедактированияДатыРТУ.ПустаяСсылка();
		Элементы.ПричинаИзмененияДатыДокумента.АвтоОтметкаНезаполненного = Ложь;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 03.10.2024 ))
	
	//Евросиб Шевченко А.В. 24.06.2025 US 104900 TA 112049 -начало
	Если ЗначениеЗаполнено(ТекущийОбъект.ДатаЗапретаПечатиИОтправкиПоЭДО) Тогда
		НеОтслеживать = Истина;
		ВРаботеПоСтатусуОтправкиИПодписания = Перечисления.СтатусыОтправкиИПодписанияРТУ.ДокументНеВРаботеИНеТребуетНачалаРаботы; 
	ИначеЕсли ТекущийОбъект.Штраф Тогда
		НеОтслеживать = Истина;
		ВРаботеПоСтатусуОтправкиИПодписания = Перечисления.СтатусыОтправкиИПодписанияРТУ.ДокументНеВРаботеИНеТребуетНачалаРаботы;
	ИначеЕсли ТекущийОбъект.ДоговорКонтрагента.ПричинаОтказаОтЭДО = Перечисления.ПричинаОтказаОтЭДО.ИндивидуальнаяОтправкаРТУВДругиеСистемыЭДОКАПоДаннымОРК Тогда
		НеОтслеживать = Истина;
		ВРаботеПоСтатусуОтправкиИПодписания = Перечисления.СтатусыОтправкиИПодписанияРТУ.ДокументНеВРаботеИНеТребуетНачалаРаботы;
	КонецЕсли;	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("НеОтслеживать", НеОтслеживать);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ВРаботеПоСтатусуОтправкиИПодписания", ВРаботеПоСтатусуОтправкиИПодписания);
	//Евросиб Шевченко А.В. 24.06.2025 US 104900 TA 112049 -конец
КонецПроцедуры

//Евросиб Каблов 11.07.2020 ( TASK 23506
&НаКлиенте
Процедура СнятьПризнакВыставлен(Команда)
	
	//Проверка доступности по Периоду ВО
	ДокументВЗакрытомПериоде = КонтрольДоступностиДокументов_сервер.ПроверкаДоступностиПоПериоду(Объект.Ссылка);
	Если ДокументВЗакрытомПериоде Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Редактирование документа запрещено, так как он в закрытом периоде!");
		Возврат;
	КонецЕсли;
	
	// Евросиб US 89967 TA 91565 Рыбьяков К.А. 02.10.2024 ((
	Если КонтрольДоступностиДокументов_сервер.ПроверитьДоступностьРоли("dc_РедактированиеДатыДокумента") Тогда
		СтатусДокумента = КонтрольДоступностиДокументов_сервер.ПолучитьДанныеБлокировкиДокумента(Объект.Ссылка);
		Если СтатусДокумента.Количество() > 0 Тогда
			РазрешитьРедактированиеВыгруженногоДокумента("");
		КонецЕсли;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 02.10.2024 ))
	
	СнятьПризнакВыставленСервер();
	
КонецПроцедуры

//Евросиб Каблов 15.09.2020 ( TASK 23506
&НаСервере
Процедура СнятьПризнакВыставленСервер()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.СнятьПризнакВыставлен();
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	
	//ОбработатьБлокировкуДокумента();
	КонтрольДоступностиДокументов_сервер.ОбработатьБлокировкуЭлементовФормы(Объект.Ссылка, Элементы);
	
	// Евросиб US 89967 TA 91565 Рыбьяков К.А. 02.10.2024 ((
	ПроверитьЗапретРедактированияДатыДокумента();
	// Евросиб Рыбьяков К.А. 02.10.2024 ))
	
КонецПроцедуры

//Евросиб Каблов 13.09.2020 ( Ticket#0205328  
&НаСервере
Процедура СнятьПризнакВыгруженНаСервере()
	
	//Евросиб Дубская 27.10.2022 ( Ticket#0287875
	////Проверка доступности по Периоду ВО
	//ДокументВЗакрытомПериоде = КонтрольДоступностиДокументов_сервер.ПроверкаДоступностиПоПериоду(Объект.Ссылка);
	//Если ДокументВЗакрытомПериоде Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Редактирование документа запрещено, так как он в закрытом периоде!");
	//	Возврат;
	//КонецЕсли;
	//
	////Проверка доступности по наличию привязанных оплат
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	ПоступлениеНаРасчетныйСчетДокументыОплаты.Ссылка КАК Ссылка,
	//|	СУММА(ПоступлениеНаРасчетныйСчетДокументыОплаты.СуммаОплаты) КАК СуммаОплаты
	//|ИЗ
	//|	Документ.ПоступлениеНаРасчетныйСчет.ДокументыОплаты КАК ПоступлениеНаРасчетныйСчетДокументыОплаты
	//|ГДЕ
	//|	ПоступлениеНаРасчетныйСчетДокументыОплаты.ДокументРеализации = &ДокументРеализации
	////Евросиб Каблов 18.11.2021 (
	//|	И ПоступлениеНаРасчетныйСчетДокументыОплаты.Ссылка.Проведен
	////Евросиб Каблов 18.11.2021 )
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ПоступлениеНаРасчетныйСчетДокументыОплаты.Ссылка
	//|
	//|ИМЕЮЩИЕ
	//|	СУММА(ПоступлениеНаРасчетныйСчетДокументыОплаты.СуммаОплаты) <> 0";
	//Запрос.УстановитьПараметр("ДокументРеализации", Объект.Ссылка);
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Количество() > 0 Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запрещено редактирование документа из-за наличия привязанных оплат.");
	//	Возврат;
	//КонецЕсли;
	//Евросиб Дубская 27.10.2022 )  
	
	//Удаление признака выгрузки      
	ЗаписьПротоколаОбмена = РегистрыСведений.ПротоколОбменов.СоздатьМенеджерЗаписи();
	ЗаписьПротоколаОбмена.УзелОбмена = Перечисления.УзлыОбмена.УПП;
	ЗаписьПротоколаОбмена.Объект = Объект.Ссылка;
	ЗаписьПротоколаОбмена.ДействиеПриОбмене = Перечисления.ДействияПриОбмене.ВыгрузкаДанных;
	ЗаписьПротоколаОбмена.Удалить(); 
	
	//Обновление информации о блокировке документа
	
	//ОбработатьБлокировкуДокумента();
	КонтрольДоступностиДокументов_сервер.ОбработатьБлокировкуЭлементовФормы(Объект.Ссылка, Элементы);

КонецПроцедуры 

&НаКлиенте
Процедура РазрешитьРедактированиеВыгруженногоДокумента(Команда)  
	
	//Евросиб Дубская 27.10.2022 ( Ticket#0287875
	//СнятьПризнакВыгруженНаСервере(); 
	Ссылка = Объект.Ссылка;
	
	//Проверка доступности по Периоду ВО
	ДокументВЗакрытомПериоде = КонтрольДоступностиДокументов_сервер.ПроверкаДоступностиПоПериоду(Ссылка);
	Если ДокументВЗакрытомПериоде Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Редактирование документа запрещено, так как он в закрытом периоде!");
		Возврат;
	КонецЕсли;     
	
	//Проверка доступности по наличию привязанных оплат
	Если ЕстьПривязанныеОплаты(Ссылка) Тогда
		Если КонтрольДоступностиДокументов_сервер.ПроверитьДоступностьРоли("dc_РазрешитьРедактированиеИСФ") Тогда
			ОповещениеОтветаВопроса = Новый ОписаниеОповещения("ОбработкаВопросаПривязанныхОплат", ЭтаФорма);
			ПоказатьВопрос(ОповещениеОтветаВопроса, "Есть привязанные оплаты. Разрешить редактирование?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет);
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запрещено редактирование документа из-за наличия привязанных оплат.");
		КонецЕсли;
		Возврат;
	КонецЕсли;   
	
	СнятьПризнакВыгруженНаСервере();
	//Евросиб Дубская 27.10.2022 ) 
	
КонецПроцедуры
//Евросиб Каблов 13.09.2020 ) 

//Евросиб Дубская 27.10.2022 ( Ticket#0287875
&НаКлиенте
Процедура ОбработкаВопросаПривязанныхОплат(Ответ, Параметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда 
		Возврат; 
	КонецЕсли;   
	
	СнятьПризнакВыгруженНаСервере();
			
КонецПроцедуры //Евросиб Дубская 27.10.2022 ) 

//Евросиб Дубская 27.10.2022 ( Ticket#0287875
&НаСервереБезКонтекста
Функция ЕстьПривязанныеОплаты(Ссылка)
	Возврат Документы.РеализацияТоваровУслуг.ЕстьПривязанныеОплаты(Ссылка)
КонецФункции //Евросиб Дубская 27.10.2022 ) 

//Евросиб Каблов 11.07.2020 ( TASK 23506
&НаСервере
Процедура ОбработатьБлокировкуДокумента()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ДанныеОБлокировке = КонтрольДоступностиДокументов_сервер.ПолучитьДанныеОБлокировке(Объект.Ссылка);
		ТолькоПросмотр = ДанныеОБлокировке.Заблокирован;		
		Элементы.ПредупреждениеРедактирования.Видимость = ДанныеОБлокировке.Заблокирован;
		Элементы.ПредупреждениеРедактирования.Заголовок = ДанныеОБлокировке.ОписаниеБлокировки;
	Иначе
		Элементы.ПредупреждениеРедактирования.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Гудкова( 12.09.2020 Ticket№ 0206196

// <Описание процедуры>
//
// Параметры:
//  Контрагент  - СправочникСсылка.Контрагенты - контрагент, по которому
//                 проверяется настроенная связь в Диадоке
&НаСервереБезКонтекста
Функция ЕстьЭДОСКонтрагентом(Контрагент)

	Возврат Обработки.ДД_подключаемыйМодуль.ЕстьЭДОСКонтрагентом(Контрагент);

КонецФункции // ЕстьЭДОСКонтрагентом()
//Максимова 16.02.21
&НаСервереБезКонтекста
Функция ЕстьОплатаОригинал(Договор)

	Возврат Договор.ОплатаПоОригиналу;

КонецФункции // ЕстьЭДОСКонтрагентом()
//Максимова
&НаКлиенте
Процедура Услуги1СодержаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОпОп = Новый ОписаниеОповещения("ОбработкаВводаСодержания", ЭтаФорма);
	ПоказатьВводСтроки(ОпОп, Элемент.ТекстРедактирования,"Содержание услуги",,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВводаСодержания(СтрокаЗнач, ДополнительныеПараметры) Экспорт
	Если СтрокаЗнач = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	ТекД = Элементы.Услуги1.ТекущиеДанные;
	ТекД.Содержание = СтрокаЗнач;
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаУслугПоТСПриИзменении(Элемент)
	
	Если ЗаполнятьПоПервойСтроке Тогда
		ИмяТЧ = Элемент.Имя;
		ИмяПоля = Сред(Элемент.ТекущийЭлемент.Имя, СтрДлина(ИмяТЧ)+1);
		
		Для Сч = 1 По Объект[ИмяТЧ].Количество() - 1 Цикл
			Объект[ИмяТЧ][Сч][ИмяПоля] = Объект[ИмяТЧ][0][ИмяПоля];
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьОтгрузочнуюИнформацию(Команда)
	//Объект.РасшифровкаУслугПоТС.Очистить();
	ПерезаполнитьОтгрузочнуюИнформациюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьОтгрузочнуюИнформациюНаСервере_Старая()
	
	СписокТЕ = Новый Массив;
	Услуга = неопределено;
	Для каждого Стр из Объект.Услуги Цикл
		Услуга = Стр.Номенклатура;
		МассивКТК = СтрРазделить(СТрзаменить(Стр.СписокТЕ, " ", ""), ";", Ложь);
		Для каждого Стр2 из МассивКТК Цикл
			
			СписокТЕ.Добавить( РаботаСКонтейнерамиСервер.НайтиКТК(Стр2, Ложь) );
			
		КонецЦикла;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	               |	СделкаСвязьУчетныхЕдиниц.Вагон КАК Вагон,
	               |	СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция,
	               |	СделкаСвязьУчетныхЕдиниц.НомерЖДН КАК НомерЖДН,
	               |	СделкаСвязьУчетныхЕдиниц.ЖДН КАК ЖДН,
	               |	СделкаСвязьУчетныхЕдиниц.Коносамент КАК Коносамент,
	               |	СделкаСвязьУчетныхЕдиниц.ЖДН.НакладнаяЭТРАН.ДатаИВремяОтправленияГруза КАК ДатаОтправки,
	               |	СделкаСвязьУчетныхЕдиниц.Груз КАК Груз,
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка.СтанцияОтправления КАК ПунктОтправления,
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка.СтанцияНазначения КАК ПунктНазначения,
	               |	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Ссылка,
	               |	СделкаСвязьУчетныхЕдиниц.ВесГрузаНетто КАК ФактическийВес,
	               |	СделкаСвязьУчетныхЕдиниц.ВесГрузаНетто КАК РасчетныйВес,
	               |	СделкаСвязьУчетныхЕдиниц.Заявка.ВидПеревозки КАК ВидПеревозки,
	               |	СделкаСвязьУчетныхЕдиниц.ЖДН.НакладнаяЭТРАН КАК ЖДННакладнаяЭТРАН
	               |ИЗ
	               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |ГДЕ
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
	               |	И СделкаСвязьУчетныхЕдиниц.Контейнер В(&СписокКТК)";
	Запрос.УстановитьПараметр("Ссылка", Объект.Сделка);
	Запрос.УстановитьПараметр("СписокКТК", СписокТЕ);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		НСтр = Объект.РасшифровкаУслугПоТС.Добавить();
		ЗаполнитьЗначенияСвойств(НСтр, Ответ);
		НСтр.Услуга = Услуга;
		Для каждого Стр из Ответ.ЖДННакладнаяЭТРАН.Контейнеры Цикл
			
			Если Стр.НомерКонтейнера = Строка(Ответ.Контейнер) Тогда
				НСтр.ФактическийВес = Стр.МассыВКгНетто;
				НСтр.РасчетныйВес = Стр.МассыВКгНетто;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;

		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьОтгрузочнуюИнформациюНаСервере()
	
	//Документы.РеализацияТоваровУслуг.ПерезаполнитьОтгрузочнуюИнформацию(Объект);
	//ДИТ, Беляев СЮ, BUG 59400/TA 59404, 21-10-2022, начало
	ДоходыСделкиСервер.ПерезаполнитьОтгрузочнуюИнформацию(Объект);
	//ДИТ, Беляев СЮ, BUG 59400/TA 59404, 21-10-2022, конец
	
КонецПроцедуры

&НаСервере
Функция НайтиСтрокиКТК(Сделка, СтрокаДоходовСделки)
	СписокКТК = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаДоходыКТК.КТК КАК КТК
	|ИЗ
	|	Документ.Сделка.ДоходыКТК КАК СделкаДоходыКТК
	|ГДЕ
	|	СделкаДоходыКТК.ГУИД = &ГУИД";
	Запрос.УстановитьПараметр("ГУИД", СтрокаДоходовСделки);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		СписокКТК = РезультатЗапроса.Выгрузить()[0].КТК;
	КонецЕсли; 
	Возврат СписокКТК;
КонецФункции
 
&НаСервере
Функция НайтиСтрокиВагоны(Сделка, СтрокаДоходовСделки)
	СписокВагоны = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоходыВагоны.Вагон КАК Вагоны
	|ИЗ
	|	Документ.Сделка.ДоходыВагоны КАК ДоходыВагоны
	|ГДЕ
	|	ДоходыВагоны.ГУИД = &ГУИД";
	Запрос.УстановитьПараметр("ГУИД", СтрокаДоходовСделки);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		СписокВагоны = РезультатЗапроса.Выгрузить()[0].Вагоны;
	КонецЕсли; 
	Возврат СписокВагоны;
КонецФункции

&НаСервере
Процедура ПоказатьВерсию()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПротоколОбменов.НУИНУ КАК Версия
	|ИЗ
	|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|ГДЕ
	|	ПротоколОбменов.УзелОбмена = &УзелОбмена
	|	И ПротоколОбменов.Объект = &Объект";
	Запрос.УстановитьПараметр("УзелОбмена", Перечисления.УзлыОбмена.РИТМ);
	Запрос.УстановитьПараметр("Объект", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		знВерсия = РезультатЗапроса.Выгрузить()[0].Версия;
		Если знВерсия = 0 Тогда
			Версия = "Б/0";
		Иначе
			Версия = "Н/"+знВерсия;
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

// ДИТ Поморцева Т.П. Задача 235405 09.07.2021
&НаКлиенте
Процедура ВыставленПриИзменении(Элемент)	
	Если Объект.Выставлен Тогда
		Объект.ДатаВыставления = ТекущаяДата();
	Иначе
		Объект.ДатаВыставления = Дата(1,1,1);
	КонецЕсли;	
КонецПроцедуры

// Евросиб Гудкова)

//Евросиб Литвинов ( 12.11.2021 #42060 #0248963
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Евросиб Фролов (23.11.2021 Ticket№ 0244435
	ЗаполнитьДоплатныеПСЦ();
	// Евросиб Фролов)
	
    УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
    УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма, РеквизитФормыВЗначение("Объект"));
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
    УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
//Евросиб Литвинов ) 12.11.2021 #42060 #0248963

&НаСервере
Процедура ЗаполнитьДоплатныеПСЦ()
	// Евросиб Фролов (23.11.2021 Ticket№ 0244435
	
	//Элементы.ФормаПечатьСлужебнойЗаписки.Доступность = Истина;
		
	ТаблицаКонтейнеровУслуг = Новый ТаблицаЗначений;
	ТаблицаКонтейнеровУслуг.Колонки.Добавить("КТК", ОбщегоНазначения.ОписаниеТипаСтрока(11));
	ТаблицаКонтейнеровУслуг.Колонки.Добавить("НомерСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(10));
	//Евросиб СубботинВ #84453 02.07.2024 Начало // получение сделки
	ТаблицаКонтейнеровУслуг.Колонки.Добавить("Сделка", Новый ОписаниеТипов("ДокументСсылка.Сделка"));
	//Евросиб СубботинВ #84453 02.07.2024 Конец
	Для Каждого ТекущаяСтрока Из Объект.Услуги Цикл
		
		МассивПредставленийКТК = СтрРазделить(ТекущаяСтрока.СписокТЕ, ";", Ложь);
		Для Каждого ПредставлениеКТК из МассивПредставленийКТК Цикл
		
			СтрокаКТК = ТаблицаКонтейнеровУслуг.Добавить();
			СтрокаКТК.КТК = ПредставлениеКТК;
			СтрокаКТК.НомерСтроки = ТекущаяСтрока.НомерСтроки;
		    //Евросиб СубботинВ #84453 02.07.2024 Начало
            СтрокаКТК.Сделка = ТекущаяСтрока.Сделка; 
			//Евросиб СубботинВ #84453 02.07.2024 Конец
		КонецЦикла;		
		
	КонецЦикла;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Услуги.КТК КАК КТК,
	|	Услуги.НомерСтроки КАК НомерСтроки,
	//Евросиб СубботинВ #84453 02.07.2024 Начало
	|	Услуги.Сделка КАК Сделка
	//Евросиб СубботинВ #84453 02.07.2024 Конец
	|ПОМЕСТИТЬ втУслуги
	|ИЗ
	|	&Услуги КАК Услуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЕ.Ссылка КАК КТК,
	|	втУслуги.НомерСтроки КАК НомерСтроки,
	//Евросиб СубботинВ #84453 02.07.2024 Начало
	|	втУслуги.Сделка КАК Сделка
	//Евросиб СубботинВ #84453 02.07.2024 Конец
	|ПОМЕСТИТЬ втТаблицаКонтейнеров
	|ИЗ
	|	втУслуги КАК втУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
	|		ПО втУслуги.КТК = ТЕ.Наименование
	|			И (НЕ ТЕ.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втТаблицаКонтейнеров.КТК КАК КТК,
	|	втТаблицаКонтейнеров.НомерСтроки КАК НомерСтроки,
	|	СделкаСвязьУчетныхЕдиниц.Доплата_ПСЦ КАК Доплата_ПСЦ
	|ИЗ
	|	втТаблицаКонтейнеров КАК втТаблицаКонтейнеров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|		ПО втТаблицаКонтейнеров.КТК = СделкаСвязьУчетныхЕдиниц.Контейнер 
	//Евросиб СубботинВ #84453 02.07.2024 Начало	
	//|			И (СделкаСвязьУчетныхЕдиниц.Ссылка = &Сделка)
	|			И (втТаблицаКонтейнеров.Сделка = СделкаСвязьУчетныхЕдиниц.Ссылка)
	//Евросиб СубботинВ #84453 02.07.2024 Конец
	|ГДЕ
	|	СделкаСвязьУчетныхЕдиниц.Доплата_ПСЦ <> ЗНАЧЕНИЕ(Документ.ПСЦ.ПустаяСсылка)";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса; 
	//Евросиб СубботинВ #84453 02.07.2024 Начало
    //Запрос.УстановитьПараметр("Сделка", Объект.Сделка);
	//Евросиб СубботинВ #84453 02.07.2024 Конец

	Запрос.УстановитьПараметр("Услуги", ТаблицаКонтейнеровУслуг);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		СтрокаДанных = Объект.Услуги[Выборка.НомерСтроки - 1];
		СтрокаДанных.Доплата_ПСЦ = Выборка.Доплата_ПСЦ;		
	КонецЦикла;	

	// Евросиб Фролов)
КонецПроцедуры	

&НаКлиенте
Процедура ПечатьСлужебнойЗаписки(Команда)
	// Евросиб Фролов (23.11.2021 Ticket№ 0244435

	// По строковым представлениям получим список КТК для печати служебной записки
	ВыделенныеСтроки = Элементы.Услуги1.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не выделены строки в списке услуг для печати служебной записи.");
		Возврат;
	КонецЕсли;	
	
	ПротоколыРазные = Ложь;
	Протокол = ПредопределенноеЗначение("Документ.ПСЦ.ПустаяСсылка");
	//МассивПредставленийКТК = Новый Массив;
	МассивСтрок = Новый Массив;
    МассивКТК = Новый Массив;
	Для Каждого ИндексВыделеннойСтроки Из ВыделенныеСтроки Цикл
		
		СтрокаДанных = Объект.Услуги[ИндексВыделеннойСтроки];
		
		Если ЗначениеЗаполнено(СтрокаДанных.Доплата_ПСЦ)
			И ЗначениеЗаполнено(Протокол)
			И СтрокаДанных.Доплата_ПСЦ <> Протокол Тогда
			ПротоколыРазные = Истина;
			Прервать;
		КонецЕсли;	
		
		Протокол = СтрокаДанных.Доплата_ПСЦ;		
		
		СписокСделок = Новый СписокЗначений;
		СписокСделок.Добавить(Объект.Сделка);
		
		СписокСФ = Новый СписокЗначений;
		СписокСФ.Добавить(БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(Объект.Ссылка, "СчетФактураВыданный"));
		
		СписокКлиентов = Новый СписокЗначений;
		СписокКлиентов.Добавить(Объект.Контрагент);
		
		МассивПредставленийКТКСтроки = СтрРазделить(СтрокаДанных.СписокТЕ, ";", Ложь);		
		КонтейнерыСтроки = ПолучитьМассивКТК(МассивПредставленийКТКСтроки);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивКТК, КонтейнерыСтроки, Истина);
		
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("Сделки", 				СписокСделок);
		СтруктураСтроки.Вставить("СчетаФактуры", 		СписокСФ);
		СтруктураСтроки.Вставить("Контейнеры", 			КонтейнерыСтроки);
		СтруктураСтроки.Вставить("ДатаРаскредитации", 	Дата(1, 1, 1));
		СтруктураСтроки.Вставить("Клиенты", 			СписокКлиентов);
		
		МассивСтрок.Добавить(СтруктураСтроки);
		
	КонецЦикла;
	
	Если ПротоколыРазные Тогда
		ПоказатьПредупреждение(, "В выбранных строках отличаются доплатные протоколы.
								|Проверьте данные.");
		Возврат;
	КонецЕсли;	
	
	//МассивКТК = ПолучитьМассивКТК(МассивПредставленийКТК);
	
	СписокКТК = Новый СписокЗначений;	
	СписокКТК.ЗагрузитьЗначения(МассивКТК);

	//ДатыСозданияИСФ = "";
	
	ПараметрыФормыПечати = Новый Структура;
	ПараметрыФормыПечати.Вставить("СписокКТК", 			СписокКТК);
	ПараметрыФормыПечати.Вставить("Протокол", 			Протокол);
	ПараметрыФормыПечати.Вставить("МассивСтрок", 		МассивСтрок);
	//ПараметрыФормыПечати.Вставить("ТаблицаРТУ", 		ПолучитьТаблицуРТУ(ДатыСозданияИСФ));
	//ПараметрыФормыПечати.Вставить("ДатыСозданияИСФ", 	ДатыСозданияИСФ);
	
	ОткрытьФорму("Обработка.ПечатьСлужебныхЗаписокПоДоплатнымКТК.Форма", ПараметрыФормыПечати);
	// Евросиб Фролов)
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивКТК(МассивПредставленийКТК)
	// Евросиб Фролов (23.11.2021 Ticket№ 0244435

	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЕ.Ссылка КАК КТК
	|ИЗ
	|	Справочник.ТЕ КАК ТЕ
	|ГДЕ
	|	ТЕ.Наименование В(&МассивПредставленийКТК)
	|	И НЕ ТЕ.ПометкаУдаления";	

	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивПредставленийКТК", МассивПредставленийКТК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивКТК = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("КТК");
	
	Возврат МассивКТК;
	
	// Евросиб Фролов)
КонецФункции	

&НаКлиенте
Процедура РасшифровкаУслугПоТСЖДНОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Евросиб Фролов (16.12.2021 TASK №40645
	// При смене ссылки на ЖДН автоматом менять "Номер ЖДН".
	ТекущиеДанные = Элементы.РасшифровкаУслугПоТС.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ЖДН) Тогда
		ТекущиеДанные.НомерЖДН = ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "НомерТранспортногоДокумента");
	КонецЕсли;	
	// Евросиб Фролов)
КонецПроцедуры	

&НаКлиенте
Процедура Услуги1ЕдиницаИзмеренияПриИзменении(Элемент)
	// Евросиб Фролов (15.03.2022 Task №40571 
	БухгалтерскийУчетОбщиеПроцедурыКлиент.ПроверитьКоличествоВТабличнойЧасти(ЭтаФорма, "Услуги1");
	// Евросиб Фролов)
КонецПроцедуры 

//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, начало
&НаКлиенте
Процедура Услуги1СписокТСПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги1.ТекущиеДанные;
	СтрокаТЧ.СписокТС = ОбщегоНазначенияВызовСервера.ПривестиСтрокуУчетныхЕдиницКТребуемомуФормату(СтрокаТЧ.СписокТС);
КонецПроцедуры  
//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, конец

//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, начало
&НаКлиенте
Процедура Услуги1СписокТЕПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги1.ТекущиеДанные;
	СтрокаТЧ.СписокТЕ = ОбщегоНазначенияВызовСервера.ПривестиСтрокуУчетныхЕдиницКТребуемомуФормату(СтрокаТЧ.СписокТЕ);
КонецПроцедуры
//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, конец

//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, начало
&НаКлиенте
Процедура Услуги1СписокТДПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги1.ТекущиеДанные;
	СтрокаТЧ.СписокТД = ОбщегоНазначенияВызовСервера.ПривестиСтрокуУчетныхЕдиницКТребуемомуФормату(СтрокаТЧ.СписокТД);
КонецПроцедуры
//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, конец

//Субботин 80515 15.02.2024
&НаКлиенте
Процедура ШтрафПриИзменении(Элемент)
	Если НЕ КонтрольДоступностиДокументов_сервер.РольДоступнаВызовСервера("dc_РазрешитьРедактированиеПризнакаШтрафРТУ") Тогда
		Объект.Штраф = Не Объект.Штраф;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Недостаточно прав для изменения признака Штраф");
	КонецЕсли;  
	
	// Евросиб US 89967 TA 95438 Рыбьяков К.А. 13.11.2024 ((
	ПроверитьЗапретРедактированияДатыДокумента();
	// Евросиб Рыбьяков К.А. 13.11.2024 ))
	
	//Евросиб Шевченко А.В. 24.06.2025 US 104900 TA 112049 -начало
	НеОтслеживать = Объект.Штраф;
	ВРаботеПоСтатусуОтправкиИПодписания = ПредопределенноеЗначение("Перечисление.СтатусыОтправкиИПодписанияРТУ.ДокументНеВРаботеИНеТребуетНачалаРаботы");
	УстановитьОграниченияСтатусыОтправкиИПодписанияРТУ();
	//Евросиб Шевченко А.В. 24.06.2025 US 104900 TA 112049 -конец
КонецПроцедуры
//Субботин 80515 15.02.2024

// Евросиб US 89967 TA 91565 Рыбьяков К.А. 03.10.2024 ((
&НаСервереБезКонтекста
Функция ЗапрещенаПечатьИОтправкаПоЭДО(Знач Объект)
	
	
	СтавкаНДС20 = Ложь;
	
	Для Каждого Строка Из Объект.Услуги Цикл
		//Евросиб СубботинВ #125845 09.12.2025 Начало
		//Если Строка.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
		Если Строка.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") или Строка.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22") Тогда
		//Евросиб СубботинВ #125845 09.12.2025 Конец
			СтавкаНДС20 = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// Евросиб US 106352 TA 106351 Рыбьяков К.А. 03.04.2025 ((
	Результат = Новый Структура;
	Результат.Вставить("ДатаЗапрета", Дата("00010101"));
	Результат.Вставить("ДатаСоставления", Дата("00010101"));
	//Результат = Дата("00010101");
	// Евросиб Рыбьяков К.А. 03.04.2025 ))
	ДатыСдачиДекларацийПоНДС = Константы.ДатыСдачиДекларацийПоНДС.Получить();
	СписокДат = ДатыСдачиДекларацийПоНДС.Получить();
	
	Если СписокДат = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если СтавкаНДС20 И СписокДат.Количество() > 0 Тогда
		
		//Евросиб Каблов 09.04.2025 ( #105407
		//ДатаОткрытогоПериода = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Объект.Организация);
		ДатаОткрытогоПериода = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(Объект.Организация);
		//Евросиб Каблов 09.04.2025 )
		
		ДатаСдачиДекларации = Дата("00010101");
		
		ТекущийГод = Год(ТекущаяДатаСеанса());
		Для Каждого БлижайшаяДата Из СписокДат Цикл
			БлижайшаяДатаСдачиДекларации = КонецДня(ДобавитьМесяц(БлижайшаяДата.Значение, (ТекущийГод - 1) * 12));
			Если Объект.Создано >= ДатаОткрытогоПериода 
				И Объект.Создано < БлижайшаяДатаСдачиДекларации Тогда
				ДатаСдачиДекларации = БлижайшаяДатаСдачиДекларации;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ДатаЗакрытогоПериода = ДобавитьМесяц(ДатаОткрытогоПериода, - 1);
		ДатаКонцаКвартала = КонецМесяца(ДобавитьМесяц(ДатаСдачиДекларации, - 1));
		ДатаНачалаКвартала = КонецМесяца(ДобавитьМесяц(ДатаКонцаКвартала, - 3)) + 1; 

		//Евросиб Коханенко Н.А. 16.01.2025 (( #100309 
		//Если НачалоМесяца(Объект.Создано) > ДатаЗакрытогоПериода 
		Запрос = Новый Запрос;
		//Евросиб Каблов 09.04.2025 ( #105407
		//Запрос.Текст = "ВЫБРАТЬ
		//               |	ЗакрытыеПериодыСрезПоследних.Регистратор.Создано КАК РегистраторСоздано
		//               |ИЗ
		//               |	РегистрСведений.ЗакрытыеПериоды.СрезПоследних(&Период, Организация = &Организация) КАК ЗакрытыеПериодыСрезПоследних
		//               |ГДЕ
		//               |	ЗакрытыеПериодыСрезПоследних.Период = &Период";
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗакрытыеПериодыДоходовСрезПоследних.Регистратор.Создано КАК РегистраторСоздано
		               |ИЗ
		               |	РегистрСведений.ЗакрытыеПериодыДоходов.СрезПоследних(&Период, Организация = &Организация) КАК ЗакрытыеПериодыДоходовСрезПоследних
		               |ГДЕ
		               |	ЗакрытыеПериодыДоходовСрезПоследних.Период = &Период";
		//Евросиб Каблов 09.04.2025 )
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("Период", ДатаЗакрытогоПериода);
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			ДатаКонцаКвартала = Выборка.РегистраторСоздано; 
		КонецЕсли;  
		
		КонтрольныеМесяцы = Новый СписокЗначений;
		КонтрольныеМесяцы.Добавить(1);
		КонтрольныеМесяцы.Добавить(4);
		КонтрольныеМесяцы.Добавить(7);
		КонтрольныеМесяцы.Добавить(10);

		Если Объект.Создано > ДатаКонцаКвартала
			И КонтрольныеМесяцы.НайтиПоЗначению(Месяц(Объект.Создано)) <> Неопределено
		//Евросиб Коханенко Н.А. 16.01.2025 )) #100309 
			И Объект.Создано < ДатаСдачиДекларации 
				И Объект.ДатаДокумента <= ДатаКонцаКвартала
				И Объект.ДатаДокумента >= ДатаНачалаКвартала 
				И ДатаСдачиДекларации >= ТекущаяДатаСеанса() 
				// Евросиб US 113892 TA 113893 Рыбьяков К.А. 09.07.2025 ((
				И Месяц(ДатаОткрытогоПериода) = Месяц(ДатаСдачиДекларации) Тогда
				// Евросиб Рыбьяков К.А. 09.07.2025 ))
			Результат.ДатаЗапрета = ДатаСдачиДекларации + 1;
		КонецЕсли;
	КонецЕсли;
	
	// Евросиб US 106352 TA 106351 Рыбьяков К.А. 03.04.2025 ((
	Если Результат.ДатаЗапрета <> Дата("00010101") Тогда
		Результат.ДатаСоставления = ДатаОткрытогоПериода + 25 * 86400;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 03.04.2025 ))

	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПроверитьЗапретРедактированияДатыДокумента()

	Если Пользователи.РолиДоступны("dc_РедактированиеДатыДокумента") Тогда
		СтранаРегистрации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Контрагент, "СтранаРегистрации");
		ДокументВЗакрытомПериоде = КонтрольДоступностиДокументов_сервер.ПроверкаДоступностиПоПериоду(Объект.Ссылка);
		Если СтранаРегистрации = Справочники.СтраныМира.Россия 
			И НЕ ДокументВЗакрытомПериоде 
			И НЕ Объект.Штраф 
			И НЕ Объект.Субсидии 
			И НЕ Объект.Выставлен Тогда
			Элементы.ДатаДокумента.ТолькоПросмотр = Ложь;
			Элементы.ПричинаИзмененияДатыДокумента.ТолькоПросмотр = Ложь;
		Иначе
			Элементы.ДатаДокумента.ТолькоПросмотр = Истина;
			Элементы.ПричинаИзмененияДатыДокумента.ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
// Евросиб Рыбьяков К.А. 24.10.2024 ))

//Евросиб Шевченко А.В. 17.06.2025 US 104900 TA 112049
&НаКлиенте
Процедура НеОтслеживатьПриИзменении(Элемент)
	Если НеОтслеживать Тогда
		ВРаботеПоСтатусуОтправкиИПодписания = ПредопределенноеЗначение("Перечисление.СтатусыОтправкиИПодписанияРТУ.ДокументНеВРаботеИНеТребуетНачалаРаботы");
	КонецЕсли;
	
	УстановитьОграниченияСтатусыОтправкиИПодписанияРТУ();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОграниченияСтатусыОтправкиИПодписанияРТУ()
	
	Перем мПараметрыВыбора, Параметр, мДоступныеСтатусы;
	
	мПараметрыВыбора = Новый Массив();
	
	Если НеОтслеживать Тогда
		
		мДоступныеСтатусы = Новый Массив();
		мДоступныеСтатусы.Добавить(Перечисления.СтатусыОтправкиИПодписанияРТУ.ДокументНеВРаботеИНеТребуетНачалаРаботы);
		
		Параметр = Новый ПараметрВыбора(
				"Отбор.Ссылка",
		    	    	Новый ФиксированныйМассив(мДоступныеСтатусы)
			);
			
		мПараметрыВыбора.Добавить(Параметр); 
	Иначе
		
		мДоступныеСтатусы = Новый Массив();
		мДоступныеСтатусы.Добавить(Перечисления.СтатусыОтправкиИПодписанияРТУ.КонтрагентОтказалВПодписи);
		мДоступныеСтатусы.Добавить(Перечисления.СтатусыОтправкиИПодписанияРТУ.ВРаботе);
		мДоступныеСтатусы.Добавить(Перечисления.СтатусыОтправкиИПодписанияРТУ.НеОтправлен);
		мДоступныеСтатусы.Добавить(Перечисления.СтатусыОтправкиИПодписанияРТУ.НеОтправленПослеEmail);
		мДоступныеСтатусы.Добавить(Перечисления.СтатусыОтправкиИПодписанияРТУ.НеПолучен);
		мДоступныеСтатусы.Добавить(Перечисления.СтатусыОтправкиИПодписанияРТУ.ОжидаетсяПодписьКонтрагента);
		мДоступныеСтатусы.Добавить(Перечисления.СтатусыОтправкиИПодписанияРТУ.ТребуетсяАннулирование);
		мДоступныеСтатусы.Добавить(Перечисления.СтатусыОтправкиИПодписанияРТУ.ТребуетсяУточнение);
		мДоступныеСтатусы.Добавить(Перечисления.СтатусыОтправкиИПодписанияРТУ.ДокументНеВРаботеИНеТребуетНачалаРаботы);
		
				
		Параметр = Новый ПараметрВыбора(
				"Отбор.Ссылка",
		    	    	Новый ФиксированныйМассив(мДоступныеСтатусы)
			);
			
		мПараметрыВыбора.Добавить(Параметр); 
		
	КонецЕсли;
	
	ЭтаФорма.Элементы.ВРаботеПоСтатусуОтправкиИПодписания.ПараметрыВыбора = Новый ФиксированныйМассив(мПараметрыВыбора);
	
КонецПроцедуры
//Евросиб Шевченко А.В. 17.06.2025 US 104900 TA 112049

&НаКлиенте
Процедура СчетаНаОплатуПокупателямПриИзменении(Элемент)
	
	//Евросиб Каблов 01.09.2025 ( #111016
	СчетаНаОплатуПокупателямПриИзмененииСервер();
	//Евросиб Каблов 01.09.2025 ) #111016
	
КонецПроцедуры

//Евросиб Каблов 01.09.2025 #111016
&НаСервере
Процедура СчетаНаОплатуПокупателямПриИзмененииСервер()
	
	ТаблицаСчетов = Объект.СчетаНаОплатуПокупателям.Выгрузить();
	Документы.РеализацияТоваровУслуг.ЗаполнитьВидыДоходовПоСчетам(ТаблицаСчетов);
	Для Каждого Стр Из Объект.СчетаНаОплатуПокупателям Цикл
		Если Не ЗначениеЗаполнено(Стр.ВидДоходов) Тогда
			НайденныеСтроки = ТаблицаСчетов.НайтиСтроки(Новый Структура("СчетПокупателю, Номенклатура, Контейнер", Стр.СчетПокупателю, Стр.Номенклатура, Стр.Контейнер));
			Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
				Стр.ВидДоходов = НайденныеСтроки[0].ВидДоходов;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//Евросиб Каблов 01.09.2025 #111016
&НаСервере
Процедура ЗаполнитьВидыДоходовНаСервере(СтрокиТаблицы = Неопределено)
	
	Если ЗначениеЗаполнено(СтрокиТаблицы) Тогда
		ТаблицаСчетов = Объект.СчетаНаОплатуПокупателям.Выгрузить(СтрокиТаблицы);
	Иначе
		ТаблицаСчетов = Объект.СчетаНаОплатуПокупателям.Выгрузить();
	КонецЕсли;
	
	Документы.РеализацияТоваровУслуг.ЗаполнитьВидыДоходовПоСчетам(ТаблицаСчетов);
	Для Каждого Стр Из Объект.СчетаНаОплатуПокупателям Цикл
		НайденныеСтроки = ТаблицаСчетов.НайтиСтроки(Новый Структура("СчетПокупателю, Номенклатура, Контейнер", Стр.СчетПокупателю, Стр.Номенклатура, Стр.Контейнер));
		Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
			Стр.ВидДоходов = НайденныеСтроки[0].ВидДоходов;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//Евросиб Каблов 01.09.2025 #111016
&НаКлиенте
Процедура ЗаполнитьВидыДоходов(Команда)
	
	ЗаполнитьВидыДоходовНаСервере();
	
КонецПроцедуры

//Евросиб Каблов 01.09.2025 #111016
&НаКлиенте
Процедура УстановитьНомераСчетов(Команда)
	
	СписокСчетов = Новый Массив;
	Для Каждого Стр Из Объект.СчетаНаОплатуПокупателям Цикл
		СписокСчетов.Добавить(Стр.СчетПокупателю);
	КонецЦикла;
	СписокСчетов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(СписокСчетов);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СписокСчетов", СписокСчетов);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработатьУстановкуНовыхНомеровСчетов", ЭтаФорма);
	ОткрытьФорму("Документ.РеализацияТоваровУслуг.Форма.СчетаНаОплатуПокупателям", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

//Евросиб Каблов 01.09.2025 #111016
&НаКлиенте
Процедура ОбработатьУстановкуНовыхНомеровСчетов(Результат, ДополнительныеПараметры) Экспорт
	
	ЭтаФорма.ОбновитьОтображениеДанных(Элементы.СчетаПокупателям);
	
КонецПроцедуры

//Евросиб Каблов 24.11.2025 #111016
&НаСервере
Функция ПолучитьАдресХранилищаДанныхДляПодбораСчетов()
	
	ТаблицаУслуг = Объект.Услуги.Выгрузить(, "Номенклатура, Сумма");
	ТаблицаУслуг.Свернуть("Номенклатура", "Сумма");
	
	ПодобранныеСчетаПокупателям = Объект.СчетаНаОплатуПокупателям.Выгрузить(, "СчетПокупателю, Номенклатура, Сумма");
	ПодобранныеСчетаПокупателям.Свернуть("СчетПокупателю, Номенклатура, Сумма");
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Новый Структура("ТаблицаУслуг, ПодобранныеСчетаПокупателям", ТаблицаУслуг, ПодобранныеСчетаПокупателям));
	
	Возврат АдресХранилища;
	
КонецФункции

//Евросиб Каблов 24.11.2025 #111016
&НаКлиенте
Процедура ОбработкаПодбораСчетов(АдресТаблицыВыбранныхСчетов, ДопПараметры) Экспорт
	
	УдалитьИзВременногоХранилища(ДопПараметры.АдресХранилищаДанных);
	
	Если ЗначениеЗаполнено(АдресТаблицыВыбранныхСчетов) Тогда
		ОбработкаПодбораСчетовСервер(АдресТаблицыВыбранныхСчетов);
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Каблов 24.11.2025 #111016
&НаСервере
Процедура ОбработкаПодбораСчетовСервер(АдресТаблицыВыбранныхСчетов)
	
	ВыбранныеСчета = ПолучитьИзВременногоХранилища(АдресТаблицыВыбранныхСчетов);
	ОбработанныеСтроки = Новый Массив;
	Для Каждого Стр Из ВыбранныеСчета Цикл
		НайденныеСтроки = Объект.СчетаНаОплатуПокупателям.НайтиСтроки(Новый Структура("СчетПокупателю, Номенклатура", Стр.СчетПокупателю, Стр.Номенклатура));
		Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
			НайденнаяСтрока = НайденныеСтроки[0];
			НайденнаяСтрока.Сумма = Стр.Сумма;
			ОбработанныеСтроки.Добавить(НайденнаяСтрока);
		Иначе
			НоваяСтрока = Объект.СчетаНаОплатуПокупателям.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
			ОбработанныеСтроки.Добавить(НоваяСтрока);
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьВидыДоходовНаСервере(ОбработанныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетаНаОплатуПокупателямПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	//Евросиб Каблов 24.11.2025 ( #111016
	Если Не Копирование Тогда
		
		Отказ = Истина;
		
		ПараметрыФормыПодбора = Новый Структура;
		ПараметрыФормыПодбора.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыФормыПодбора.Вставить("ДоговорКонтрагента", Объект.ДоговорКонтрагента);
		ПараметрыФормыПодбора.Вставить("Реализация", Объект.Ссылка);
		
		АдресХранилищаДанных = ПолучитьАдресХранилищаДанныхДляПодбораСчетов();
		ПараметрыФормыПодбора.Вставить("АдресХранилищаДанных", АдресХранилищаДанных);
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("АдресХранилищаДанных", АдресХранилищаДанных);	
		ОписаниеОповещенияОПодбореСчетов = Новый ОписаниеОповещения("ОбработкаПодбораСчетов", ЭтаФорма, ДопПараметры);
		
		ОткрытьФорму("Документ.СчетНаОплатуПокупателю.Форма.ФормаПодбораСчетов", ПараметрыФормыПодбора, ЭтаФорма,,,, ОписаниеОповещенияОПодбореСчетов, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	КонецЕсли;
	//Евросиб Каблов 24.11.2025 ) #111016
	
КонецПроцедуры

