
&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;    
		
	//ПараметрыФормы.Вставить("ВидОтправки",Элемент.ВидОтправки);
	//ПараметрыФормы.Вставить("ВидПодвижногоСостава",Элемент.ТекущиеДанные.ВидПодвижногоСостава);
	//ПараметрыФормы.Вставить("ВидУпаковки",Элемент.ТекущиеДанные.ВидУпаковки);
	//ПараметрыФормы.Вставить("ВладелецКонтейнера",Элемент.ТекущиеДанные.ВладелецКонтейнера);
	//ПараметрыФормы.Вставить("ГрузПоГНГ",Элемент.ТекущиеДанные.ГрузПоГНГ);
	//ПараметрыФормы.Вставить("ГрузПоГНГ2001",Элемент.ТекущиеДанные.ГрузПоГНГ2001);
	//ПараметрыФормы.Вставить("КоличествоВагоновКонтейнеров",Элемент.ТекущиеДанные.КоличествоВагоновКонтейнеров);
	//ПараметрыФормы.Вставить("НовыйВидПодвижногоСостава",Элемент.ТекущиеДанные.НовыйВидПодвижногоСостава);
	//ПараметрыФормы.Вставить("СтанцияНазначения",Элемент.ТекущиеДанные.СтанцияНазначения);
	//ПараметрыФормы.Вставить("СтранаНазначения",Элемент.ТекущиеДанные.СтранаНазначения);
	//ПараметрыФормы.Вставить("ТипСобственностиВагоновДляКонтейнеров",Элемент.ТекущиеДанные.ТипСобственностиВагоновДляКонтейнеров);
	//ПараметрыФормы.Вставить("ГрузПоЕТСНГ",Элемент.ТекущиеДанные.ГрузПоЕТСНГ);

	ЭтаФорма.Закрыть("ку");
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВидОтправки") Тогда
        ВидОтправки = Параметры.ВидОтправки;
		ВидПодвижногоСостава = Параметры.ВидПодвижногоСостава;
    КонецЕсли;


	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

