
#Область УПП
Функция ПередатьСписокВходящихДокументов(XMLParams) Экспорт
	
	Параметры = ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	Данные = ПолучитьДанныеЧерезМакетСКД("СписокВходящихДокументов", Параметры, "УИДКонтрагента,УИДДоговора");
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(ОбщегоНазначения.ТаблицаЗначенийВМассив(Данные));
	
КонецФункции

Функция ПередатьСписокПодтвержденийИСФНДС0(XMLParams) Экспорт
	
	Параметры = ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	// Евросиб(ДИТ) US 90779 ТА 99010 Сержантова А.С. Начало: 14.01.2025
	// Было:
	//Данные = ПолучитьДанныеЧерезМакетСКД("СписокПодтвержденийИСФНДС0", Параметры); 
	//Стало:
	Данные = ПолучитьДанныеЧерезМакетСКД("СписокПодтвержденийИСФНДСПострочно", Параметры);
	// Евросиб(ДИТ) US 90779 ТА 99010 Сержантова А.С. Конец: 14.01.2025
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(Данные);
	
КонецФункции

Функция ПередатьСписокИсходящихДокументов(XMLParams, ВидОбъекта) Экспорт

	Параметры = ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&ВидОбъекта.Ссылка КАК СсылкаИСФ,
	|	ВЫБОР КОГДА &ВидОбъекта.НомерДляПечати = """" ТОГДА &ВидОбъекта.Номер ИНАЧЕ &ВидОбъекта.НомерДляПечати КОНЕЦ КАК НомерИСФ,
	|	ВЫБОР КОГДА &ВидОбъекта.ДатаДокумента = ДАТАВРЕМЯ(1,1,1) ТОГДА &ВидОбъекта.Дата ИНАЧЕ &ВидОбъекта.ДатаДокумента КОНЕЦ КАК ДатаИСФ,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(&ВидОбъекта.Ссылка) = ТИП(Документ.РеализацияТоваровУслуг) ТОГДА ""Б""
	|		КОГДА ТИПЗНАЧЕНИЯ(&ВидОбъекта.Ссылка) = ТИП(Документ.КорректировкаРеализации) ТОГДА ""К"" ИНАЧЕ ""О"" КОНЕЦ КАК ТипИСФ,
	|	НЕ ПротоколОбменов.Объект ЕСТЬ NULL КАК ЗагрузкаПодтверждена
	|ИЗ
	|	Документ.&ВидОбъекта КАК &ВидОбъекта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|		ПО &ВидОбъекта.Ссылка = ПротоколОбменов.Объект
	|			И (ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
	|			И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО &ВидОбъекта.Организация = Организации.Ссылка
	|			И (Организации.Код = &КодОрганизации)
	|			И (&ВидОбъекта.Проведен)
	|			//&УсловиеПоКонтрагенту
	|			//&УсловиеПоДоговоруКонтрагента
	|ГДЕ
  	|	&ВидОбъекта.ПериодВО МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПротоколОбменов.Объект ЕСТЬ NULL
	//ДИТ Шевченко А.В. US 59973 ТА 71435 29.08.2023
	|	//&УсловиеПоСубсидии
	//ДИТ Шевченко А.В. US 59973 ТА 71435 29.08.2023
	|   ";
	Запрос.УстановитьПараметр("НачалоПериода",				Параметры.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",				Параметры.КонецПериода);
	Запрос.УстановитьПараметр("КодОрганизации",				Параметры.КодОрганизации);
	Если ВидОбъекта = "ОтчетКомитентуОПродажах" Тогда
		Запрос.Текст = Запрос.Текст + "
	 	|И ОтчетКомитентуОПродажах.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОЗакупках)
		|ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ
		|	ОтчетКомитентуОПродажах.Ссылка КАК Ссылка,
		|   ОтчетКомитентуОПродажах.НомерДляПечатиВознаграждение,
		|   ОтчетКомитентуОПродажах.ДатаДокумента,
		|	""Б"",
		|	НЕ ПротоколОбменов.Объект ЕСТЬ NULL КАК ЗагрузкаПодтверждена
		|ИЗ
		|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|		ПО ОтчетКомитентуОПродажах.Ссылка = СчетФактураВыданный.ДокументОснование
		|			И (СчетФактураВыданный.Продавец = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		|		ПО ОтчетКомитентуОПродажах.Ссылка = ПротоколОбменов.Объект
		|			И (ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
		|			И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))	
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО ОтчетКомитентуОПродажах.Организация = Организации.Ссылка
		|			И (Организации.Код = &КодОрганизации)
		|			И (ОтчетКомитентуОПродажах.Проведен)
		|			//&УсловиеПоКонтрагенту
		|			//&УсловиеПоДоговоруКонтрагента
		|ГДЕ ОтчетКомитентуОПродажах.СпособРасчетаКомиссионногоВознаграждения <> ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается)
		|	И ОтчетКомитентуОПродажах.ПериодВО МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ПротоколОбменов.Объект ЕСТЬ NULL
		|   ";
	КонецЕсли; 
	Если ЗначениеЗаполнено(Параметры.УИДКонтрагента) Тогда
		Запрос.УстановитьПараметр("УИДКонтрагента",				Параметры.УИДКонтрагента);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//&УсловиеПоКонтрагенту","
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Контрагенты
	|		ПО &ВидОбъекта.Контрагент = Контрагенты.Объект
	|			И (Контрагенты.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|			И (Контрагенты.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			И (Контрагенты.УИДИсточника = &УИДКонтрагента)");
	КонецЕсли; 
	Если ЗначениеЗаполнено(Параметры.УИДДоговораКонтрагента) Тогда
		Запрос.УстановитьПараметр("УИДДоговораКонтрагента",		Параметры.УИДДоговораКонтрагента);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//&УсловиеПоДоговоруКонтрагента","
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ДоговорыКонтрагентов
	|		ПО &ВидОбъекта.ДоговорКонтрагента = ДоговорыКонтрагентов.Объект
	|			И (ДоговорыКонтрагентов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|			И (ДоговорыКонтрагентов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			И (ДоговорыКонтрагентов.УИДИсточника = &УИДДоговораКонтрагента)");
	КонецЕсли;
	
	//ДИТ Шевченко А.В. US 59973 ТА 71435 29.08.2023
	Если ВидОбъекта = "РеализацияТоваровУслуг" Тогда	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//&УсловиеПоСубсидии","
		|	И &ВидОбъекта.Субсидии = " + XMLСтрока(Параметры.Субсидии) + "");
	КонецЕсли;	
	//ДИТ Шевченко А.В. US 59973 ТА 71435 29.08.2023
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВидОбъекта", ВидОбъекта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ДокументыКВыгрузке = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		СтруктураДокумента = Новый Структура;
		СтруктураДокумента.Вставить("ГУИД", Выборка.СсылкаИСФ.УникальныйИдентификатор()); 
		СтруктураДокумента.Вставить("НомерИСФ", Выборка.НомерИСФ); 
		СтруктураДокумента.Вставить("ДатаИСФ", Выборка.ДатаИСФ);
		СтруктураДокумента.Вставить("ТипИСФ", Выборка.ТипИСФ);
		СтруктураДокумента.Вставить("ЗагрузкаПодтверждена", Выборка.ЗагрузкаПодтверждена);
		ДокументыКВыгрузке.Добавить(СтруктураДокумента);
	КонецЦикла;	
	
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(ДокументыКВыгрузке);		


КонецФункции // ПолучитьСписокИсходящихДокументов(XMLParams, ВидОбъекта)

Функция ПередатьДанныеПоСчетамДляЗаказа(XMLParams) Экспорт

	ГУИДДокументов =  ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	СсылкиНаДокументы = Новый ТаблицаЗначений;
	СсылкиНаДокументы.Колонки.Добавить("ГУИД",Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	СсылкиНаДокументы.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.СчетНаОплатуПоставщика"));
	Для Каждого СтрокаГУИД Из ГУИДДокументов Цикл
		Строка = СсылкиНаДокументы.Добавить();
		Строка.ГУИД = СтрокаГУИД;
		Строка.Ссылка = Документы.СчетНаОплатуПоставщика.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.ГУИД));		
	КонецЦикла;
	
#Область Запрос
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	СсылкиНаДокументы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СсылкиНаДокументы
	|ИЗ
	|	&СсылкиНаДокументы КАК СсылкиНаДокументы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|  ""Счет""  КАК ТипДокумента,  
	// Евросиб(ДИТ) US 73033 ТА 88304 Сержантова А.С. Начало: 18.07.2024  
	//реквизиты были добавлены для Заявки, здесь для того, чтобы на стороне УПП не выходила ошибка
	|	СчетНаОплатуПоставщика.Проведен КАК Проведен,
	|	СчетНаОплатуПоставщика.ПометкаУдаления КАК ПометкаУдаления,
	// Евросиб(ДИТ) US 73033 ТА 88304 Сержантова А.С. Конец: 18.07.2024   
	// Евросиб(ДИТ) US 89517 ТА 91085 Сержантова А.С. Начало: 17.09.2024
	|	Выразить("""" КАК Строка(150)) КАК ВебСсылка,  
	// Евросиб(ДИТ) US 89517 ТА 91085 Сержантова А.С. Конец: 17.09.2024
	|	СчетНаОплатуПоставщика.Дата КАК Дата,
	|	СчетНаОплатуПоставщика.Организация.Код КАК ОрганизацияКод,
	|	СчетНаОплатуПоставщика.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	ПОДСТРОКА(СчетНаОплатуПоставщика.Комментарий, 1, 1000) КАК Комментарий,
	|	СчетНаОплатуПоставщика.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	СчетНаОплатуПоставщика.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	СчетНаОплатуПоставщика.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	ПРЕДСТАВЛЕНИЕ(СчетНаОплатуПоставщика.Ответственный) КАК Ответственный,
	|	СчетНаОплатуПоставщика.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	СчетНаОплатуПоставщика.СуммаДокумента КАК СуммаДокумента,
	|	СчетНаОплатуПоставщика.УчитыватьНДС КАК УчитыватьНДС,
	|	СчетНаОплатуПоставщика.ПодразделениеОрганизации.Код КАК ПодразделениеОрганизацииКод,
	|	СчетНаОплатуПоставщика.ЦФО.Код КАК ЦФОКод,
	|	СчетНаОплатуПоставщика.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	//Евросиб - АСуслов 06.02.2024 17:33:35 #78327
	//(
	|	"""" КАК ГУИДЗаявка,
	|	СсылкиНаДокументы.ГУИД КАК ГУИДЗаказ,
	//)
	//Евросиб - АСуслов 06.02.2024 17:33:39 #78327
	|	ПРЕДСТАВЛЕНИЕ(СчетНаОплатуПоставщика.Автор) КАК Автор,
	|	Контрагенты.УИДИсточника КАК УИДКонтрагента,
	|	ДоговорыКонтрагентов.УИДИсточника КАК УИДДоговораКонтрагента,
	|	"""" КАК УИДДоговораОплаты,
	|	СчетНаОплатуПоставщика.БанковскийСчетКонтрагента.НомерСчета КАК БанковскийСчетКонтрагентаНомерСчета,
	|	СчетНаОплатуПоставщика.БанковскийСчетОрганизации.НомерСчета КАК БанковскийСчетОрганизацииНомерСчета,
	|	СчетНаОплатуПоставщика.ДатаПоступления КАК ДатаПоступления,
	|	СчетНаОплатуПоставщика.ДатаОплаты КАК ДатаОплаты,
	|	Ложь КАК ОплатаВИнойВалюте,
	|	"""" КАК ВалютаОплатыКод,
	//Евросиб СубботинВ #89541 16.10.2024 Начало
    |	Выразить("""" КАК Строка(150)) как ВидОперации	
	//Евросиб СубботинВ #89541 16.10.2024 Конец
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПоставщика КАК СчетНаОплатуПоставщика
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Контрагенты
	|			ПО СчетНаОплатуПоставщика.Контрагент = Контрагенты.Объект
	|				И (Контрагенты.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (Контрагенты.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ДоговорыКонтрагентов
	|			ПО СчетНаОплатуПоставщика.ДоговорКонтрагента = ДоговорыКонтрагентов.Объект
	|				И (ДоговорыКонтрагентов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (ДоговорыКонтрагентов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))  
	|		ПО СсылкиНаДокументы.Ссылка = СчетНаОплатуПоставщика.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	//Евросиб - АСуслов 06.02.2024 17:33:35 #78327
	//(
	|	"""" КАК ГУИДЗаявка,
	|	СсылкиНаДокументы.ГУИД КАК ГУИДЗаказ,
	|	"""" ТипДокумента,
	|   """" КАК НомерВходящегоДокумента,
	|   """" КАК ДатаВходящегоДокумента,
	//)
	//Евросиб - АСуслов 06.02.2024 17:33:39 #78327
	|	СчетНаОплатуПоставщикаТовары.НомерСтроки КАК НомерСтроки,
	|	ПОДСТРОКА(СчетНаОплатуПоставщикаТовары.Содержание, 1, 1000) КАК Содержание,
	|	СчетНаОплатуПоставщикаТовары.Количество КАК Количество,
	|	СчетНаОплатуПоставщикаТовары.СтавкаНДС КАК СтавкаНДС,
	|	СчетНаОплатуПоставщикаТовары.Сумма КАК Сумма,
	|	СчетНаОплатуПоставщикаТовары.СуммаНДС КАК СуммаНДС,
	|	СчетНаОплатуПоставщикаТовары.Цена КАК Цена,
	|	СчетНаОплатуПоставщикаТовары.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	ПротоколОбменов.УИДИсточника КАК НоменклатураКод,
	|	СчетНаОплатуПоставщикаТовары.Номенклатура.СтатьяДДС.Код КАК СтатьяДвиженияДенежныхСредствКод,
	|	СчетНаОплатуПоставщикаТовары.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПоставщика.Товары КАК СчетНаОплатуПоставщикаТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|			ПО СчетНаОплатуПоставщикаТовары.Номенклатура = ПротоколОбменов.Объект
	|				И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	|				И (ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
	|		ПО СсылкиНаДокументы.Ссылка = СчетНаОплатуПоставщикаТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ               
	|   СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	Файлы.Том.ПолныйПутьWindows КАК ТомПолныйПутьWindows,
	|	Файлы.ПутьКФайлу КАК ПутьКФайлу
	|ИЗ 
	|   СсылкиНаДокументы КАК СсылкиНаДокументы
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Файлы КАК Файлы
	|   	ПО СсылкиНаДокументы.Ссылка = Файлы.ВладелецФайла";
	
	
#КонецОбласти 	
	Запрос.УстановитьПараметр("СсылкиНаДокументы", СсылкиНаДокументы);
	
	Результаты = Запрос.ВыполнитьПакет();		
	Шапки = Результаты[1].Выгрузить(); 
	ТЧУслуги = Результаты[2].Выгрузить();
	Файлы = Результаты[3].Выгрузить();
	
	СтруктураШапкиИТЧУслуги = Новый Структура;
	СтруктураШапкиИТЧУслуги.Вставить("Шапки", Шапки);
	СтруктураШапкиИТЧУслуги.Вставить("ТЧУслуги", ТЧУслуги);
	СтруктураШапкиИТЧУслуги.Вставить("Файлы", Файлы);
	//Евросиб СубботинВ #89541 16.10.2024 Начало  ПРОБНЫЙ ВАРИАНТ ЗАГЛУШКИ!!! поменять!!!!!! 
	ТЗпту = Новый ТаблицаЗначений;
	ТЗпту.Колонки.Добавить("УИДИсточника", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(20)));
	ТЗпту.Колонки.Добавить("ГУИДЗаявки", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(20)));
	СтруктураШапкиИТЧУслуги.Вставить("СвязанныеПТУ", ТЗпту);
	//Евросиб СубботинВ #89541 16.10.2024 Конец		
	
	ПередаваемаяСтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(СтруктураШапкиИТЧУслуги); 
	
	Возврат ПередаваемаяСтрокаXML;		

КонецФункции // ПолучитьДанныеПоСчетам(XMLParams)

Функция ПередатьДанныеПоПТУДляЗаказа(XMLParams) Экспорт

	ГУИДДокументов =  ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	СсылкиНаДокументы = Новый ТаблицаЗначений;
	СсылкиНаДокументы.Колонки.Добавить("ГУИД",Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	СсылкиНаДокументы.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.ПоступлениеТоваровУслуг"));
	Для Каждого СтрокаГУИД Из ГУИДДокументов Цикл
		Строка = СсылкиНаДокументы.Добавить();
		Строка.ГУИД = СтрокаГУИД;
		Строка.Ссылка = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.ГУИД));		
	КонецЦикла;
	
#Область Запрос
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	СсылкиНаДокументы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СсылкиНаДокументы
	|ИЗ
	|	&СсылкиНаДокументы КАК СсылкиНаДокументы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""ПТУ"" КАК ТипДокумента,
	//Евросиб Литвинов ( 30.12.21 #44592 Ticket#0254477 #44587 
	|	ПоступлениеТоваровУслуг.ДатаСФХЖ КАК ДатаСФХЖ,
	//Евросиб Литвинов) 	     
	// Евросиб(ДИТ) US 73033 ТА 88304 Сержантова А.С. Начало: 18.07.2024  
	//реквизиты были добавлены для Заявки, здесь для того, чтобы на стороне УПП не выходила ошибка
	|	ПоступлениеТоваровУслуг.Проведен КАК Проведен,
	|	ПоступлениеТоваровУслуг.ПометкаУдаления КАК ПометкаУдаления,
	// Евросиб(ДИТ) US 73033 ТА 88304 Сержантова А.С. Конец: 18.07.2024   
	// Евросиб(ДИТ) US 89517 ТА 91085 Сержантова А.С. Начало: 17.09.2024
	|	Выразить("""" КАК Строка(150)) КАК ВебСсылка,  
	// Евросиб(ДИТ) US 89517 ТА 91085 Сержантова А.С. Конец: 17.09.2024
	|	ПоступлениеТоваровУслуг.Дата КАК Дата,
	|	ПоступлениеТоваровУслуг.Организация.Код КАК ОрганизацияКод,
	|	ПоступлениеТоваровУслуг.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	ПОДСТРОКА(ПоступлениеТоваровУслуг.Комментарий, 1, 1000) КАК Комментарий,
	|	ПоступлениеТоваровУслуг.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ПоступлениеТоваровУслуг.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ПоступлениеТоваровУслуг.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслуг.Ответственный) КАК Ответственный,
	|	ПоступлениеТоваровУслуг.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ПоступлениеТоваровУслуг.УчитыватьНДС КАК УчитыватьНДС,
	|	ПоступлениеТоваровУслуг.ПодразделениеОрганизации.Код КАК ПодразделениеОрганизацииКод,
	|	ПоступлениеТоваровУслуг.ЦФО.Код КАК ЦФОКод,
	|	ПоступлениеТоваровУслуг.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	СсылкиНаДокументы.ГУИД КАК ГУИДЗаказ,
	|	"""" КАК ГУИДЗаявка,
	|	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслуг.Автор) КАК Автор,
	|	Контрагенты.УИДИсточника КАК УИДКонтрагента,
	|	ДоговорыКонтрагентов.УИДИсточника КАК УИДДоговораКонтрагента,
	|	"""" КАК УИДДоговораОплаты,
	|	ПоступлениеТоваровУслуг.БанковскийСчетКонтрагента.НомерСчета КАК БанковскийСчетКонтрагентаНомерСчета,
	|	ПоступлениеТоваровУслуг.БанковскийСчетОрганизации.НомерСчета КАК БанковскийСчетОрганизацииНомерСчета,
	|	ПоступлениеТоваровУслуг.ДатаВходящегоДокумента КАК ДатаПоступления,
	|	ПоступлениеТоваровУслуг.ДатаОплаты КАК ДатаОплаты,
	|	ВложенныйЗапрос.СуммаНаПТУ КАК СуммаДокумента,
	|	Ложь КАК ОплатаВИнойВалюте,
	|	"""" КАК ВалютаОплатыКод,
	//Евросиб СубботинВ #89541 16.10.2024 Начало
    |	Выразить("""" КАК Строка(150)) как ВидОперации	
	//Евросиб СубботинВ #89541 16.10.2024 Конец
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Контрагенты
	|			ПО ПоступлениеТоваровУслуг.Контрагент = Контрагенты.Объект
	|				И (Контрагенты.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (Контрагенты.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ДоговорыКонтрагентов
	|			ПО ПоступлениеТоваровУслуг.ДоговорКонтрагента = ДоговорыКонтрагентов.Объект
	|				И (ДоговорыКонтрагентов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (ДоговорыКонтрагентов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|		ПО СсылкиНаДокументы.Ссылка = ПоступлениеТоваровУслуг.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.СуммаНаПТУ) КАК СуммаНаПТУ,
	|			СсылкиНаДокументы.Ссылка КАК Ссылка
	|		ИЗ
	|			СсылкиНаДокументы КАК СсылкиНаДокументы
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.СвязанныеСчетаПоставщиков КАК ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков
	|				ПО СсылкиНаДокументы.Ссылка = ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.Ссылка
	|		ГДЕ
	|			ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.СчетПоставщика = СсылкиНаДокументы.Ссылка
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СсылкиНаДокументы.Ссылка) КАК ВложенныйЗапрос
	|		ПО СсылкиНаДокументы.Ссылка = ВложенныйЗапрос.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	"""" КАК ГУИДЗаявки,
	|	ПОДСТРОКА(ПоступлениеТоваровУслугТовары.Содержание, 1, 1000) КАК Содержание,
	|	1 КАК Количество,
	|	ПоступлениеТоваровУслугСвязьУслугИСчетов.НомерСтроки КАК НомерСтроки,
	|	ПоступлениеТоваровУслугСвязьУслугИСчетов.СтавкаНДС КАК СтавкаНДС,
	//Евросиб Каблов 11.10.2023 ( Ticket#0317657
	//|	ВЫРАЗИТЬ(ВЫБОР
	//|		КОГДА ПоступлениеТоваровУслугСвязьУслугИСчетов.Ссылка.СуммаВключаетНДС
	//|			ТОГДА ПоступлениеТоваровУслугСвязьУслугИСчетов.ОтнесеннаяСумма
	//|		ИНАЧЕ ПоступлениеТоваровУслугСвязьУслугИСчетов.ОтнесеннаяСумма - ПоступлениеТоваровУслугСвязьУслугИСчетов.СуммаНДС
	//|	КОНЕЦ КАК ЧИСЛО(15,2)) КАК Сумма,
	//|	ПоступлениеТоваровУслугСвязьУслугИСчетов.СуммаНДС КАК СуммаНДС,
	//|	ВЫРАЗИТЬ(ВЫБОР
	//|		КОГДА ПоступлениеТоваровУслугСвязьУслугИСчетов.Ссылка.СуммаВключаетНДС
	//|			ТОГДА ПоступлениеТоваровУслугСвязьУслугИСчетов.ОтнесеннаяСумма
	//|		ИНАЧЕ ПоступлениеТоваровУслугСвязьУслугИСчетов.ОтнесеннаяСумма - ПоступлениеТоваровУслугСвязьУслугИСчетов.СуммаНДС
	//|	КОНЕЦ КАК ЧИСЛО(15,2)) КАК Цена,
	//Евросиб - АСуслов 06.02.2024 17:33:35 #78327
	//(
	|	"""" КАК ГУИДЗаявка,
	|	СсылкиНаДокументы.ГУИД КАК ГУИДЗаказ,
	|	"""" ТипДокумента,
	|   """" КАК НомерВходящегоДокумента,
	|   """" КАК ДатаВходящегоДокумента,
	//)
	//Евросиб - АСуслов 06.02.2024 17:33:39 #78327
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугСвязьУслугИСчетов.Ссылка.СуммаВключаетНДС
	|			ТОГДА ПоступлениеТоваровУслугСвязьУслугИСчетов.ПолнаяСумма
	|		ИНАЧЕ ПоступлениеТоваровУслугСвязьУслугИСчетов.ПолнаяСумма - ПоступлениеТоваровУслугСвязьУслугИСчетов.ПолнаяСуммаНДС
	|	КОНЕЦ КАК ЧИСЛО(15,2)) КАК Сумма,
	|	ПоступлениеТоваровУслугСвязьУслугИСчетов.ПолнаяСуммаНДС КАК СуммаНДС,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугСвязьУслугИСчетов.Ссылка.СуммаВключаетНДС
	|			ТОГДА ПоступлениеТоваровУслугСвязьУслугИСчетов.ПолнаяСумма
	|		ИНАЧЕ ПоступлениеТоваровУслугСвязьУслугИСчетов.ПолнаяСумма - ПоступлениеТоваровУслугСвязьУслугИСчетов.ПолнаяСуммаНДС
	|	КОНЕЦ КАК ЧИСЛО(15,2)) КАК Цена,
	//Евросиб Каблов 11.10.2023 )
	|	ПоступлениеТоваровУслугТовары.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	ПротоколОбменов.УИДИсточника КАК НоменклатураКод,
	|	ПоступлениеТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	ПоступлениеТоваровУслугТовары.Номенклатура.СтатьяДДС.Код КАК СтатьяДвиженияДенежныхСредствКод
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугТовары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.СвязьУслугИСчетов КАК ПоступлениеТоваровУслугСвязьУслугИСчетов
	|			ПО ПоступлениеТоваровУслугТовары.Ссылка = ПоступлениеТоваровУслугСвязьУслугИСчетов.Ссылка
	|				И ПоступлениеТоваровУслугТовары.ГУИДПТУ = ПоступлениеТоваровУслугСвязьУслугИСчетов.ГУИДПТУ
	|				И (ПоступлениеТоваровУслугСвязьУслугИСчетов.СчетПоставщика ССЫЛКА Документ.ПоступлениеТоваровУслуг)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|			ПО ПоступлениеТоваровУслугТовары.Номенклатура = ПротоколОбменов.Объект
	|				И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	|				И (ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
	|		ПО СсылкиНаДокументы.Ссылка = ПоступлениеТоваровУслугТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ               
	|   СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	Файлы.Том.ПолныйПутьWindows КАК ТомПолныйПутьWindows,
	|	Файлы.ПутьКФайлу КАК ПутьКФайлу
	|ИЗ 
	|   СсылкиНаДокументы КАК СсылкиНаДокументы
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Файлы КАК Файлы
	|   	ПО СсылкиНаДокументы.Ссылка = Файлы.ВладелецФайла";
	
#КонецОбласти 	
	Запрос.УстановитьПараметр("СсылкиНаДокументы", СсылкиНаДокументы);
	
	Результаты = Запрос.ВыполнитьПакет();		
	Шапки = Результаты[1].Выгрузить(); 
	ТЧУслуги = Результаты[2].Выгрузить();
	Файлы = Результаты[3].Выгрузить();
	
	СтруктураШапкиИТЧУслуги = Новый Структура;
	СтруктураШапкиИТЧУслуги.Вставить("Шапки", Шапки);
	СтруктураШапкиИТЧУслуги.Вставить("ТЧУслуги", ТЧУслуги);	
	СтруктураШапкиИТЧУслуги.Вставить("Файлы", Файлы);
	//Евросиб СубботинВ #89541 16.10.2024 Начало  ПРОБНЫЙ ВАРИАНТ ЗАГЛУШКИ!!! поменять!!!!!! 
	ТЗпту = Новый ТаблицаЗначений;
	ТЗпту.Колонки.Добавить("УИДИсточника", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(20)));
	ТЗпту.Колонки.Добавить("ГУИДЗаявки", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(20)));
	СтруктураШапкиИТЧУслуги.Вставить("СвязанныеПТУ", ТЗпту);
	//Евросиб СубботинВ #89541 16.10.2024 Конец		
	
	ПередаваемаяСтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(СтруктураШапкиИТЧУслуги); 
	
	Возврат ПередаваемаяСтрокаXML;		


КонецФункции // ПолучитьДанныеПоСчетам(XMLParams)

Функция ПередатьДанныеПоЗаявкеНаОплатуДляЗаказа(XMLParams) Экспорт

	ГУИДДокументов =  ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	СсылкиНаДокументы = Новый ТаблицаЗначений;
	СсылкиНаДокументы.Колонки.Добавить("ГУИД",Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	СсылкиНаДокументы.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.ЗаявкаНаОплату"));
	Для Каждого СтрокаГУИД Из ГУИДДокументов Цикл
		Строка = СсылкиНаДокументы.Добавить();
		Строка.ГУИД = СтрокаГУИД;
		Строка.Ссылка = Документы.ЗаявкаНаОплату.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.ГУИД));		
	КонецЦикла;
	
#Область Запрос
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	СсылкиНаДокументы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СсылкиНаДокументы
	|ИЗ
	|	&СсылкиНаДокументы КАК СсылкиНаДокументы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""ЗаявкаНаОплату"" КАК ТипДокумента, 
	// Евросиб(ДИТ) US 73033 ТА 88304 Сержантова А.С. Начало: 18.07.2024
	|	ЗаявкаНаОплату.Проведен КАК Проведен,   
	|	ЗаявкаНаОплату.ПометкаУдаления КАК ПометкаУдаления,
	// Евросиб(ДИТ) US 73033 ТА 88304 Сержантова А.С. Конец: 18.07.2024
	// Евросиб(ДИТ) US 89517 ТА 91085 Сержантова А.С. Начало: 09.09.2024
	|	Выразить("""" КАК Строка(150)) КАК ВебСсылка,  
	// Евросиб(ДИТ) US 89517 ТА 91085 Сержантова А.С. Конец: 09.09.2024
	|	ЗаявкаНаОплату.Дата КАК Дата,
	|	ЗаявкаНаОплату.Организация.Код КАК ОрганизацияКод,
	//Евросиб СубботинВ #98089 03.02.2025 Начало
    //|	"""" КАК Комментарий,
	|	ЗаявкаНаОплату.Комментарий КАК Комментарий,
	//Евросиб СубботинВ #98089 03.02.2025 Конец
	|	1 КАК КратностьВзаиморасчетов,
	|	1 КАК КурсВзаиморасчетов,
	|	ПРЕДСТАВЛЕНИЕ(ЗаявкаНаОплату.ОтветственныйЗаОплату) КАК Ответственный,
	|	ВложенныйЗапрос.ЦФОКод КАК ЦФОКод,
	|	ВложенныйЗапрос.ПодразделениеОрганизацииКод КАК ПодразделениеОрганизацииКод,
	|	ЗаявкаНаОплату.ДоговорКонтрагента.ВалютаВзаиморасчетов.Код КАК ВалютаДокументаКод,
	|	ЗаявкаНаОплату.ВалютаОплаты.Код КАК ВалютаОплатыКод,
	|	ЗаявкаНаОплату.ОплатаВИнойВалюте КАК ОплатаВИнойВалюте,
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	СсылкиНаДокументы.ГУИД КАК ГУИДЗаявка,
	|	СсылкиНаДокументы.ГУИД КАК ГУИДЗаказ,
	|	ПРЕДСТАВЛЕНИЕ(ЗаявкаНаОплату.Автор) КАК Автор,
	|	Контрагенты.УИДИсточника КАК УИДКонтрагента,
	|	ДоговорыКонтрагентов.УИДИсточника КАК УИДДоговораКонтрагента,
	|	ДоговорыКонтрагентовОплаты.УИДИсточника КАК УИДДоговораОплаты,
	|	ЗаявкаНаОплату.ДатаПланируемойОплаты КАК ДатаОплаты,
	|	ЗаявкаНаОплату.ВсегоПоЗаявке КАК СуммаДокумента,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВходящегоДокумента,
	|	"""" КАК НомерВходящегоДокумента,
	|	ИСТИНА КАК СуммаВключаетНДС,
	|	ИСТИНА КАК УчитыватьНДС,
	|	"""" КАК БанковскийСчетКонтрагентаНомерСчета,
	|	"""" КАК БанковскийСчетОрганизацииНомерСчета,
	|	"""" КАК ДатаПоступления,
	//Евросиб СубботинВ #89541 16.10.2024 Начало
    |	ВЫБОР
	|		КОГДА ЗаявкаНаОплату.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаявкиНаОплату.ОплатаШтрафов)
	|			ТОГДА ""Штраф""
	|		КОГДА ЗаявкаНаОплату.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаявкиНаОплату.ОплатаПретензий)
	|			ТОГДА ""Претензия""
	|		КОГДА ЗаявкаНаОплату.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаявкиНаОплату.ОплатаПоставщику)
	|			ТОГДА """"
	|		КОГДА ЗаявкаНаОплату.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаявкиНаОплату.ПустаяСсылка)
	|			ТОГДА """"
	|	КОНЕЦ КАК ВидОперации	
	//Евросиб СубботинВ #89541 16.10.2024 Конец
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаОплату КАК ЗаявкаНаОплату
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Контрагенты
	|			ПО ЗаявкаНаОплату.Контрагент = Контрагенты.Объект
	|				И (Контрагенты.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (Контрагенты.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ДоговорыКонтрагентов
	|			ПО ЗаявкаНаОплату.ДоговорКонтрагента = ДоговорыКонтрагентов.Объект
	|				И (ДоговорыКонтрагентов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (ДоговорыКонтрагентов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ДоговорыКонтрагентовОплаты
	|			ПО ЗаявкаНаОплату.ДоговорОплаты = ДоговорыКонтрагентовОплаты.Объект
	|				И (ДоговорыКонтрагентовОплаты.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (ДоговорыКонтрагентовОплаты.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|		ПО СсылкиНаДокументы.Ссылка = ЗаявкаНаОплату.Ссылка
	// Евросиб(ДИТ) US 73033 ТА 88304 Сержантова А.С. Начало: 18.07.2024
	// нужно передавать документы с пометкой удаления и распроведенные для отражения в УПП(при распроведении ТЧ пустая)
	//Было:
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
	//Стало:
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
	// Евросиб(ДИТ) US 73033 ТА 88304 Сержантова А.С. Конец: 18.07.2024
	|			ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа.ЦФО.Код КАК ЦФОКод,
	|			ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа.ПодразделениеОрганизации.Код КАК ПодразделениеОрганизацииКод,
	|			СсылкиНаДокументы.Ссылка КАК Ссылка
	|		ИЗ
	|			СсылкиНаДокументы КАК СсылкиНаДокументы
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаОплату.ДокументыНаОплату КАК ЗаявкаНаОплатуДокументыНаОплату
	|				ПО СсылкиНаДокументы.Ссылка = ЗаявкаНаОплатуДокументыНаОплату.Ссылка) КАК ВложенныйЗапрос
	|		ПО СсылкиНаДокументы.Ссылка = ВложенныйЗапрос.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	СсылкиНаДокументы.ГУИД КАК ГУИДЗаявка,
	|	ПротоколОбменов.УИДИсточника КАК ГУИДЗаказ,
	|	ЗаявкаНаОплатуДокументыНаОплату.НомерСтроки КАК НомерСтроки,
	//Евросиб СубботинВ #102528 09.04.2025 Начло
   // |	ЗаявкаНаОплатуДокументыНаОплату.Ссылка.СтавкаНДС КАК СтавкаНДС,
	|	ЗаявкаНаОплатуДокументыНаОплату.СтавкаНДС КАК СтавкаНДС,
	//Евросиб СубботинВ #102528 09.04.2025 Конец

	|	СтатьиДвиженияДенежныхСредств.Сумма КАК Сумма,
	|	СтатьиДвиженияДенежныхСредств.СтатьяДвиженияДенежныхСредств.Код КАК СтатьяДвиженияДенежныхСредствКод,
	|	ВЫБОР
	|		КОГДА ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа ССЫЛКА Документ.СчетНаОплатуПоставщика
	|			ТОГДА ""Счет""
	|		ИНАЧЕ ""ПТУ""
	|	КОНЕЦ КАК ТипДокумента,
	|	ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	"""" КАК Содержание,
	|	1 КАК Количество,
	//Евросиб СубботинВ #107729 18.04.2025 Начало
	//Евросиб СубботинВ #105826 01.04.2025 Начало
	//|	0 КАК СуммаНДС,
	//|	ЗаявкаНаОплатуДокументыНаОплату.СуммаНДС КАК СуммаНДС,
	//Евросиб СубботинВ #105826 01.04.2025 Конец
	|	СтатьиДвиженияДенежныхСредств.СуммаНДС КАК СуммаНДС,
	//Евросиб СубботинВ #107729 18.04.2025 Конец
	|	0 КАК Цена,
	|	"""" КАК НоменклатураНаименование,
	|	"""" КАК НоменклатураКод,
	|	"""" КАК ЕдиницаИзмеренияКод
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	// Евросиб(ДИТ) US 73033 ТА 88304 Сержантова А.С. Начало: 18.07.2024
	// нужно передавать документы с пометкой удаления и распроведенные для отражения в УПП(при распроведении ТЧ пустая)
	//Было:
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаОплату.ДокументыНаОплату КАК ЗаявкаНаОплатуДокументыНаОплату   
	//Стало:
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаОплату.ДокументыНаОплату КАК ЗаявкаНаОплатуДокументыНаОплату 
	// Евросиб(ДИТ) US 73033 ТА 88304 Сержантова А.С. Конец: 18.07.2024
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаОплату.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
	|			ПО ЗаявкаНаОплатуДокументыНаОплату.Ссылка = СтатьиДвиженияДенежныхСредств.Ссылка
	|				И ЗаявкаНаОплатуДокументыНаОплату.ИдентификаторСтроки = СтатьиДвиженияДенежныхСредств.ИдентификаторСтрокиОплаты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|			ПО ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа = ПротоколОбменов.Объект
	|				И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УППЗаказ))
	|				И (ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
	|		ПО СсылкиНаДокументы.Ссылка = ЗаявкаНаОплатуДокументыНаОплату.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	Файлы.Том.ПолныйПутьWindows КАК ТомПолныйПутьWindows,
	|	Файлы.ПутьКФайлу КАК ПутьКФайлу
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаОплату.ДокументыНаОплату КАК ЗаявкаНаОплатуДокументыНаОплату
	|		ПО СсылкиНаДокументы.Ссылка = ЗаявкаНаОплатуДокументыНаОплату.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Файлы КАК Файлы
	|		ПО (ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа = Файлы.ВладелецФайла)
	|			И (НЕ Файлы.ПометкаУдаления); 
	//Евросиб СубботинВ #89541 16.10.2024 Начало	
	////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	СсылкиНаДокументы.Ссылка КАК Ссылка,
	|	ЕстьNull(СсылкиНаДокументы.ГУИД,Выразить("""" КАК Строка(36))) КАК ГУИДЗаявки,
	//|	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.Ссылка КАК СсылкаПТУ,
	//|	ПротоколОбменов.ПроведенВБУ КАК ПТУПроведенВУПП,
	//|	ПротоколОбменов.Статус КАК Статус,
	//|	ПротоколОбменов.НомерДатаВБУ КАК НомерДатаВУПП,
	|	ЕстьNull(ПротоколОбменов.УИДИсточника, Выразить("""" КАК Строка(36))) КАК УИДИсточника
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаОплату.ДокументыНаОплату КАК ЗаявкаНаОплатуДокументыНаОплату
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.СвязанныеСчетаПоставщиков КАК ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|				ПО ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.Ссылка = ПротоколОбменов.Объект
	|					И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.Упп))
	|			ПО (ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.СчетПоставщика = ЗаявкаНаОплатуДокументыНаОплату.ОснованиеДляПлатежа)
	|				и ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.Ссылка.Проведен
	|		ПО СсылкиНаДокументы.Ссылка = ЗаявкаНаОплатуДокументыНаОплату.Ссылка";
	//Евросиб СубботинВ #89541 16.10.2024 Конец	
#КонецОбласти 	
	Запрос.УстановитьПараметр("СсылкиНаДокументы", СсылкиНаДокументы);
	
	Результаты = Запрос.ВыполнитьПакет();		
	Шапки = Результаты[1].Выгрузить(); 
	ТЧУслуги = Результаты[2].Выгрузить();     
	Файлы = Результаты[3].Выгрузить();
	//Евросиб СубботинВ #89541 16.10.2024 Начало
	СвязанныеПТУ = Результаты[4].Выгрузить();
	//Евросиб СубботинВ #89541 16.10.2024 Конец	

	// Евросиб(ДИТ) US 89517 ТА 91085 Сержантова А.С. Начало: 09.09.2024
	ЗаполнитьВебСсылкуНаЗаявку(Шапки);
	// Евросиб(ДИТ) US 89517 ТА 91085 Сержантова А.С. Конец: 09.09.2024
	
	СтруктураШапкиИТЧУслуги = Новый Структура;
	СтруктураШапкиИТЧУслуги.Вставить("Шапки", Шапки);
	СтруктураШапкиИТЧУслуги.Вставить("ТЧУслуги", ТЧУслуги);
	СтруктураШапкиИТЧУслуги.Вставить("Файлы", Файлы);
	//Евросиб СубботинВ #89541 16.10.2024 Начало
	СтруктураШапкиИТЧУслуги.Вставить("СвязанныеПТУ",СвязанныеПТУ);
	//Евросиб СубботинВ #89541 16.10.2024 Конец	

	
	ПередаваемаяСтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(СтруктураШапкиИТЧУслуги); 
	
	Возврат ПередаваемаяСтрокаXML;		


КонецФункции // ПолучитьДанныеПоСчетам(XMLParams) 

// Евросиб(ДИТ) US 89517 ТА 91085 Сержантова А.С. 09.09.2024
Процедура ЗаполнитьВебСсылкуНаЗаявку(Шапки)

	Для каждого СтрокаШапки Из Шапки Цикл  
		ЗаявкаСсылка = Документы.ЗаявкаНаОплату.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаШапки.ГУИД));
		СтрокаШапки.ВебСсылка = ПолучитьСсылкуWebСсылку(ЗаявкаСсылка);
	КонецЦикла;	

КонецПроцедуры    

// Евросиб(ДИТ) US 89517 ТА 91085 Сержантова А.С. 09.09.2024
Функция ПолучитьСсылкуWebСсылку(СсылкаНаОбъект) Экспорт 

	Результат = ПолучитьНавигационнуюСсылку(СсылкаНаОбъект);

	
	СтрокаСоединенияСБД = СтрокаСоединенияИнформационнойБазы();
	знСоединенияСБД		= Врег(СтрокаСоединенияСБД);
	
	ПозицияПоиска		= Найти(знСоединенияСБД, "SRVR=");
	Если ПозицияПоиска = 1 тогда
		знСоединенияСБД	= СтрЗаменить(знСоединенияСБД, "SRVR=""", "http://");
		знСоединенияСБД	= СтрЗаменить(знСоединенияСБД, """;REF=""", "/");
		знСоединенияСБД	= СтрЗаменить(знСоединенияСБД, """;", "#");
		
		Результат = знСоединенияСБД + СокрЛП(Результат);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ПередатьДанныеПоСФДляЗаказа(XMLParams) Экспорт

	ГУИДДокументов =  ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	СсылкиНаДокументы = Новый ТаблицаЗначений;
	СсылкиНаДокументы.Колонки.Добавить("ГУИД",Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	СсылкиНаДокументы.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.СчетФактураПолученный"));
	Для Каждого СтрокаГУИД Из ГУИДДокументов Цикл
		Строка = СсылкиНаДокументы.Добавить();
		Строка.ГУИД = СтрокаГУИД;
		Строка.Ссылка = Документы.СчетФактураПолученный.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.ГУИД));		
	КонецЦикла;
	
#Область Запрос
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	СсылкиНаДокументы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СсылкиНаДокументы
	|ИЗ
	|	&СсылкиНаДокументы КАК СсылкиНаДокументы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""ВСФ"" КАК ТипДокумента,  
	// Евросиб(ДИТ) US 73033 ТА 88304 Сержантова А.С. Начало: 18.07.2024  
	//реквизиты были добавлены для Заявки, здесь для того, чтобы на стороне УПП не выходила ошибка
	|	ПоступлениеТоваровУслуг.Проведен КАК Проведен,
	|	ПоступлениеТоваровУслуг.ПометкаУдаления КАК ПометкаУдаления,
	// Евросиб(ДИТ) US 73033 ТА 88304 Сержантова А.С. Конец: 18.07.2024
	// Евросиб(ДИТ) US 89517 ТА 91085 Сержантова А.С. Начало: 17.09.2024
	|	Выразить("""" КАК Строка(150)) КАК ВебСсылка,  
	// Евросиб(ДИТ) US 89517 ТА 91085 Сержантова А.С. Конец: 17.09.2024
	|	ПоступлениеТоваровУслуг.Дата КАК Дата,
	//Евросиб Литвинов ( 30.12.21 #44592 Ticket#0254477 #44587 
	|	ПоступлениеТоваровУслуг.ДатаСФХЖ КАК ДатаСФХЖ,
	//Евросиб Литвинов) 	
	|	ПоступлениеТоваровУслуг.Организация.Код КАК ОрганизацияКод,
	|	СчетФактураПолученный.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	ПОДСТРОКА(ПоступлениеТоваровУслуг.Комментарий, 1, 1000) КАК Комментарий,
	|	ПоступлениеТоваровУслуг.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ПоступлениеТоваровУслуг.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	СчетФактураПолученный.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслуг.Ответственный) КАК Ответственный,
	|	ПоступлениеТоваровУслуг.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВложенныйЗапрос.СуммаНаПТУ КАК СуммаДокумента,
	|	ПоступлениеТоваровУслуг.УчитыватьНДС КАК УчитыватьНДС,
	|	ПоступлениеТоваровУслуг.ПодразделениеОрганизации.Код КАК ПодразделениеОрганизацииКод,
	|	ПоступлениеТоваровУслуг.ЦФО.Код КАК ЦФОКод,
	|	ПоступлениеТоваровУслуг.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслуг.Автор) КАК Автор,
	|	Контрагенты.УИДИсточника КАК УИДКонтрагента,
	|	ДоговорыКонтрагентов.УИДИсточника КАК УИДДоговораКонтрагента,
	|	ПоступлениеТоваровУслуг.БанковскийСчетКонтрагента.НомерСчета КАК БанковскийСчетКонтрагентаНомерСчета,
	|	ПоступлениеТоваровУслуг.БанковскийСчетОрганизации.НомерСчета КАК БанковскийСчетОрганизацииНомерСчета,
	|	СчетФактураПолученный.ДатаВходящегоДокумента КАК ДатаПоступления,
	|	ПоступлениеТоваровУслуг.ДатаОплаты КАК ДатаОплаты
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Контрагенты
	|				ПО ПоступлениеТоваровУслуг.Контрагент = Контрагенты.Объект
	|					И (Контрагенты.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|					И (Контрагенты.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ДоговорыКонтрагентов
	|				ПО ПоступлениеТоваровУслуг.ДоговорКонтрагента = ДоговорыКонтрагентов.Объект
	|					И (ДоговорыКонтрагентов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|					И (ДоговорыКонтрагентов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			ПО СчетФактураПолученный.ДокументОснование = ПоступлениеТоваровУслуг.Ссылка
	|		ПО СсылкиНаДокументы.Ссылка = СчетФактураПолученный.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.СуммаНаПТУ) КАК СуммаНаПТУ,
	|			СсылкиНаДокументы.Ссылка КАК Ссылка
	|		ИЗ
	|			СсылкиНаДокументы КАК СсылкиНаДокументы
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.СвязанныеСчетаПоставщиков КАК ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков
	|					ПО СчетФактураПолученный.ДокументОснование = ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.Ссылка
	|				ПО СсылкиНаДокументы.Ссылка = СчетФактураПолученный.Ссылка
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СсылкиНаДокументы.Ссылка) КАК ВложенныйЗапрос
	|		ПО СсылкиНаДокументы.Ссылка = ВложенныйЗапрос.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	"""" КАК ГУИДЗаявки,
	|	ПОДСТРОКА(ПоступлениеТоваровУслугТовары.Содержание, 1, 1000) КАК Содержание,
	|	ПоступлениеТоваровУслугСвязьУслугИСчетов.НомерСтроки КАК НомерСтроки,
	|	ПоступлениеТоваровУслугСвязьУслугИСчетов.СтавкаНДС КАК СтавкаНДС,
	//Евросиб Каблов 11.10.2023 ( Ticket#0317657
	//|	ВЫРАЗИТЬ(ВЫБОР
	//|		КОГДА ПоступлениеТоваровУслугСвязьУслугИСчетов.Ссылка.СуммаВключаетНДС
	//|			ТОГДА ПоступлениеТоваровУслугСвязьУслугИСчетов.ОтнесеннаяСумма
	//|		ИНАЧЕ ПоступлениеТоваровУслугСвязьУслугИСчетов.ОтнесеннаяСумма - ПоступлениеТоваровУслугСвязьУслугИСчетов.СуммаНДС
	//|	КОНЕЦ КАК ЧИСЛО(15,2)) КАК Сумма,
	//|	ПоступлениеТоваровУслугСвязьУслугИСчетов.СуммаНДС КАК СуммаНДС,
	//|	ВЫРАЗИТЬ(ВЫБОР
	//|		КОГДА ПоступлениеТоваровУслугСвязьУслугИСчетов.Ссылка.СуммаВключаетНДС
	//|			ТОГДА ПоступлениеТоваровУслугСвязьУслугИСчетов.ОтнесеннаяСумма
	//|		ИНАЧЕ ПоступлениеТоваровУслугСвязьУслугИСчетов.ОтнесеннаяСумма - ПоступлениеТоваровУслугСвязьУслугИСчетов.СуммаНДС
	//|	КОНЕЦ КАК ЧИСЛО(15,2)) КАК Цена,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугСвязьУслугИСчетов.Ссылка.СуммаВключаетНДС
	|			ТОГДА ПоступлениеТоваровУслугСвязьУслугИСчетов.ПолнаяСумма
	|		ИНАЧЕ ПоступлениеТоваровУслугСвязьУслугИСчетов.ПолнаяСумма - ПоступлениеТоваровУслугСвязьУслугИСчетов.ПолнаяСуммаНДС
	|	КОНЕЦ КАК ЧИСЛО(15,2)) КАК Сумма,
	|	ПоступлениеТоваровУслугСвязьУслугИСчетов.ПолнаяСуммаНДС КАК СуммаНДС,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугСвязьУслугИСчетов.Ссылка.СуммаВключаетНДС
	|			ТОГДА ПоступлениеТоваровУслугСвязьУслугИСчетов.ПолнаяСумма
	|		ИНАЧЕ ПоступлениеТоваровУслугСвязьУслугИСчетов.ПолнаяСумма - ПоступлениеТоваровУслугСвязьУслугИСчетов.ПолнаяСуммаНДС
	|	КОНЕЦ КАК ЧИСЛО(15,2)) КАК Цена,
	//Евросиб Каблов 11.10.2023 )
	|	1 КАК Количество,
	|	ПоступлениеТоваровУслугТовары.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	ПротоколОбменов.УИДИсточника КАК НоменклатураКод,
	|	ПоступлениеТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	ПоступлениеТоваровУслугТовары.Номенклатура.СтатьяДДС.Код КАК СтатьяДвиженияДенежныхСредствКод
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугТовары
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.СвязьУслугИСчетов КАК ПоступлениеТоваровУслугСвязьУслугИСчетов
	|				ПО ПоступлениеТоваровУслугТовары.Ссылка = ПоступлениеТоваровУслугСвязьУслугИСчетов.Ссылка
	|					И ПоступлениеТоваровУслугТовары.ГУИДПТУ = ПоступлениеТоваровУслугСвязьУслугИСчетов.ГУИДПТУ
	|					И (ПоступлениеТоваровУслугСвязьУслугИСчетов.СчетПоставщика ССЫЛКА Документ.ПоступлениеТоваровУслуг)
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|				ПО ПоступлениеТоваровУслугТовары.Номенклатура = ПротоколОбменов.Объект
	|					И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	|					И (ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
	|			ПО СчетФактураПолученный.ДокументОснование = ПоступлениеТоваровУслугТовары.Ссылка
	|		ПО СсылкиНаДокументы.Ссылка = СчетФактураПолученный.Ссылка";
	
#КонецОбласти 	
	Запрос.УстановитьПараметр("СсылкиНаДокументы", СсылкиНаДокументы);
	
	Результаты = Запрос.ВыполнитьПакет();		
	Шапки = Результаты[1].Выгрузить(); 
	ТЧУслуги = Результаты[2].Выгрузить();
	
	СтруктураШапкиИТЧУслуги = Новый Структура;
	СтруктураШапкиИТЧУслуги.Вставить("Шапки", Шапки);
	СтруктураШапкиИТЧУслуги.Вставить("ТЧУслуги", ТЧУслуги);	
	
	ПередаваемаяСтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(СтруктураШапкиИТЧУслуги); 
	
	Возврат ПередаваемаяСтрокаXML;		


КонецФункции // ПолучитьДанныеПоСчетам(XMLParams)

Процедура ПередатьЗаказЗаявкуВУПП(МассивСсылок, ТипДокументов, ПараметрСоздания) Экспорт

	ГУИД = Новый Массив;
	Для каждого Ссылка Из МассивСсылок Цикл
		ГУИД.Добавить(Ссылка.УникальныйИдентификатор());
	КонецЦикла; 
	
	Прокси = ВебСервисы_сервер.ПолучитьПрокси("ВебСервисЗаказовУПП");

	Если ТипДокументов = "СчетНаОплатуПоставщика" Тогда
		XMLParams = ЕСОбменСервер.ПередатьДанныеПоСчетамДляЗаказа(ОбщегоНазначения.ЗначениеВСтрокуXML(ГУИД));
	ИначеЕсли ТипДокументов = "ПоступлениеТоваровУслуг" Тогда
		XMLParams = ЕСОбменСервер.ПередатьДанныеПоПТУДляЗаказа(ОбщегоНазначения.ЗначениеВСтрокуXML(ГУИД));
	ИначеЕсли ТипДокументов = "СчетФактураПолученный" Тогда
		XMLParams = ЕСОбменСервер.ПередатьДанныеПоСФДляЗаказа(ОбщегоНазначения.ЗначениеВСтрокуXML(ГУИД));
	ИначеЕсли ТипДокументов = "ЗаявкаНаОплату" Тогда
		XMLParams = ЕСОбменСервер.ПередатьДанныеПоЗаявкеНаОплатуДляЗаказа(ОбщегоНазначения.ЗначениеВСтрокуXML(ГУИД));
	КонецЕсли; 
	ОтветУПП = Прокси.CreateOrderFromDC(XMLParams, ПараметрСоздания);
	ТаблицаОтвета = ОбщегоНазначения.ЗначениеИзСтрокиXML(ОтветУПП);
	Для каждого СтрокаОтвета Из ТаблицаОтвета Цикл
		Если ЗначениеЗаполнено(СтрокаОтвета.Комментарий) Тогда
			ОбщегоНазначения.СообщитьПользователю("Документ не выгружен. Ошибки: " + СтрокаОтвета.Комментарий);   
			// Евросиб(ДИТ) US 73033 ТА 88304 Сержантова А.С. Начало: 31.07.2024 
			СсылкаДокумента = Документы[ТипДокументов].ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаОтвета.ГУИД));
			РегистрыСведений.ОшибкиПриОбменах.ЗафиксироватьОшибку(СсылкаДокумента, Перечисления.УзлыОбмена.УППЗаказ, СтрокаОтвета.Комментарий);
			// Евросиб(ДИТ) US 73033 ТА 88304 Сержантова А.С. Конец: 31.07.2024
		Иначе	
			СсылкаДокумента = Документы[ТипДокументов].ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаОтвета.ГУИД));
			СтруктураПоиска = Новый Структура("ДействиеПриОбмене, УзелОбмена, Объект", Перечисления.ДействияПриОбмене.ВыгрузкаДанных, 
												Перечисления.УзлыОбмена.УППЗаказ, СсылкаДокумента);
			ПредставлениеДокументовВУПП = ""+СтрокаОтвета.ПредставлениеЗаказаПоставщику+"; "+СтрокаОтвета.ПредставлениеЗаявкиНаРасходованиеСредств;	
			СтруктураДанных = Новый Структура("УИДИсточника, Ответственный, НомерДатаВБУ", СтрокаОтвета.ГУИД,  Пользователи.АвторизованныйПользователь(), ПредставлениеДокументовВУПП);
            //Евросиб - АСуслов 31.03.2024 23:20:17 #78327
			//(
			//Сообщение = РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных, "Созданы Заказ " + СтрокаОтвета.ПредставлениеЗаказаПоставщику + " и Заявка " + СтрокаОтвета.ПредставлениеЗаявкиНаРасходованиеСредств);
			Сообщение = РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных, "Создан Заказ " + СтрокаОтвета.ПредставлениеЗаказаПоставщику);
			//)
			//Евросиб - АСуслов 31.03.2024 23:20:19 #78327
			Сообщение.Сообщить();
			Если ТипДокументов = "СчетФактураПолученный" Тогда
				СсылкаПТУ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаДокумента, "ДокументОснование");
				ГУИД_ПТУ = СсылкаПТУ.УникальныйИдентификатор();
				СтруктураПоиска = Новый Структура("ДействиеПриОбмене, УзелОбмена, Объект", Перечисления.ДействияПриОбмене.ВыгрузкаДанных, 
													Перечисления.УзлыОбмена.УППЗаказ, СсылкаПТУ);
				ПредставлениеДокументовВУПП = ""+СтрокаОтвета.ПредставлениеЗаказаПоставщику+"; "+СтрокаОтвета.ПредставлениеЗаявкиНаРасходованиеСредств;									
				СтруктураДанных = Новый Структура("УИДИсточника, Ответственный, НомерДатаВБУ", ГУИД_ПТУ,  Пользователи.АвторизованныйПользователь(), ПредставлениеДокументовВУПП);
				Сообщение = РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных, "Созданы Заказ " + СтрокаОтвета.ПредставлениеЗаказаПоставщику + " и Заявка " + СтрокаОтвета.ПредставлениеЗаявкиНаРасходованиеСредств);
				//Сообщение.Сообщить();
			КонецЕсли;	
		КонецЕсли; 
	КонецЦикла; 

КонецПроцедуры

//Евросиб - АСуслов 31.03.2024 23:20:17 #78327
//(
Процедура ПередатьЗаявкуВУПП(МассивСсылок, ТипДокументов, ПараметрСоздания, ОтправлятьУведомления = Истина) Экспорт

	ГУИД = Новый Массив;
	Для каждого Ссылка Из МассивСсылок Цикл
		ГУИД.Добавить(Ссылка.УникальныйИдентификатор());
	КонецЦикла;
	
	//Евросиб СубботинВ #106812 07.04.2025 Начало
	
	Запрос = Новый Запрос; 
	//Евросиб СубботинВ #128538 22.01.2026 Начало 
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	СтатусыОбъектовСрезПоследних.Объект КАК Объект,
	//	|	СтатусыОбъектовСрезПоследних.Статус КАК Статус,
	//	|	СтатусыОбъектовСрезПоследних.Период КАК Период
	//	|ПОМЕСТИТЬ ВТ_ТекущиеСтатусы
	//	|ИЗ
	//	|	РегистрСведений.СтатусыОбъектов.СрезПоследних КАК СтатусыОбъектовСрезПоследних
	//	|ГДЕ
	//	|	СтатусыОбъектовСрезПоследних.Объект В(&МассивСсылок)
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_ТекущиеСтатусы.Объект КАК Объект,
	//	|	ВТ_ТекущиеСтатусы.Статус КАК СтатусПоследний,
	//	|	СтатусыОбъектовСрезПоследних.Статус КАК СтатусПредпоследний
	//	|ИЗ
	//	|	ВТ_ТекущиеСтатусы КАК ВТ_ТекущиеСтатусы
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыОбъектов.СрезПоследних(
	//	|				,
	//	|				НЕ (Объект, Статус, Период) В
	//	|						(ВЫБРАТЬ
	//	|							ВТ_ТекущиеСтатусы.Объект КАК Объект,
	//	|							ВТ_ТекущиеСтатусы.Статус КАК Статус,
	//	|							ВТ_ТекущиеСтатусы.Период КАК Период
	//	|						ИЗ
	//	|							ВТ_ТекущиеСтатусы КАК ВТ_ТекущиеСтатусы)) КАК СтатусыОбъектовСрезПоследних
	//	|		ПО ВТ_ТекущиеСтатусы.Объект = СтатусыОбъектовСрезПоследних.Объект";
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыОбъектовСрезПоследних.Объект КАК Объект,
		|	СтатусыОбъектовСрезПоследних.Статус КАК СтатусПоследний,
		|	СтатусыОбъектовСрезПоследних.СтатусПредыдущий КАК СтатусПредпоследний
		|ИЗ
		|	РегистрСведений.СтатусыОбъектов.СрезПоследних(, Объект В (&МассивСсылок)) КАК СтатусыОбъектовСрезПоследних"; 
	
	//Евросиб СубботинВ #128538 22.01.2026 Конец
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);	
	ИсторияСтатусов = Запрос.Выполнить().Выгрузить();	
	//Евросиб СубботинВ #106812 07.04.2025 Конец	

	
	Прокси = ВебСервисы_сервер.ПолучитьПрокси("ВебСервисЗаказовУПП");
	XMLParams = ЕСОбменСервер.ПередатьДанныеПоЗаявкеНаОплатуДляЗаказа(ОбщегоНазначения.ЗначениеВСтрокуXML(ГУИД));
	ОтветУПП = Прокси.CreateOrderFromDC(XMLParams, ПараметрСоздания);
	ТаблицаОтвета = ОбщегоНазначения.ЗначениеИзСтрокиXML(ОтветУПП); 
	
	// Евросиб(ДИТ) US 73033 ТА 88304 Сержантова А.С. Начало: 30.07.2024
	// Если был запуск по рег заданию Выгрузка заявок в УПП, то снимаем с регистрации по плану обмена
	Если ПараметрСоздания = 2 Тогда    
		ДокументыКСнятиюРегистрации = Новый Массив;
		Для каждого СтрокаОтвета Из ТаблицаОтвета Цикл 
			СсылкаДокумента = Документы[ТипДокументов].ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаОтвета.ГУИД));
			ПредставлениеДокументовВУПП = СтрокаОтвета.ПредставлениеЗаявкиНаРасходованиеСредств;
			
			Если ЗначениеЗаполнено(СтрокаОтвета.Комментарий) Тогда
				ОбщегоНазначения.СообщитьПользователю("Документ не выгружен ("+СсылкаДокумента+"). Ошибки: " + СтрокаОтвета.Комментарий); 
				РегистрыСведений.ОшибкиПриОбменах.ЗафиксироватьОшибку(СсылкаДокумента, Перечисления.УзлыОбмена.УПП, СтрокаОтвета.Комментарий);				
				//Евросиб СубботинВ #105221 19.03.2025 Начало
				//Евросиб СубботинВ #106143 31.03.2025 Начало
				//Если Справочники.СобытияОтправкиДокументов.ОшибкаПередачиЗаявкиВУПП.ОтправкаПисемПоСобытию Тогда
				Если Справочники.СобытияОтправкиДокументов.ОшибкаПередачиЗаявкиВУПП.ОтправкаПисемПоСобытию и ОтправлятьУведомления Тогда
				//Евросиб СубботинВ #106143 31.03.2025 Конец
					РассылкаУведомленийПользователям.СформироватьЗаписиСобытийИзменений(СсылкаДокумента, 
					Справочники.СобытияОтправкиДокументов.ОшибкаПередачиЗаявкиВУПП,
					СсылкаДокумента.Дата, Ложь); 
				КонецЕсли;
				Документы.РеестрПлатежей.ИзменитьПризнакАктивностиЗаявкиВРеестрах(СсылкаДокумента, Истина);
				РегистрыСведений.СтатусыОбъектов.ЗафиксироватьИзменениеСтатусаОбъекта(СсылкаДокумента, 
												Справочники.СтатусыДокументов.НеВыгруженаВУПП,
												Пользователи.ТекущийПользователь(),,
												СтрЗаменить("Сбой в работе обмена c УПП. " + СтрокаОтвета.Комментарий + "Создан запрос в службу поддержки",Символы.ПС,""));
				//Евросиб СубботинВ #105221 19.03.2025 Конец
				
				//Евросиб СубботинВ #106143 31.03.2025 Начало	
				ДокументыКСнятиюРегистрации.Добавить(СсылкаДокумента); 
				//Евросиб СубботинВ #106143 31.03.2025 Конец
			Иначе 
				СтруктураПоиска = Новый Структура("ДействиеПриОбмене, УзелОбмена, Объект", Перечисления.ДействияПриОбмене.ВыгрузкаДанных,Перечисления.УзлыОбмена.УПП, СсылкаДокумента);
				//Евросиб СубботинВ #122636 02.12.2025 Начало
				//СтруктураДанных = Новый Структура("УИДИсточника, Ответственный, НомерДатаВБУ, Статус, ПроведенВБУ", 
				//			СтрокаОтвета.ГУИД,  Пользователи.АвторизованныйПользователь(), ПредставлениеДокументовВУПП, СтрокаОтвета.Состояние, СтрокаОтвета.Проведен);
				СтруктураДанных = Новый Структура("УИДИсточника, Ответственный, НомерДатаВБУ, Статус, ПроведенВБУ, ДатаПланируемойОплаты",
							СтрокаОтвета.ГУИД,  Пользователи.АвторизованныйПользователь(), ПредставлениеДокументовВУПП, СтрокаОтвета.Состояние, СтрокаОтвета.Проведен, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаДокумента, "ДатаПланируемойОплаты"));
				//Евросиб СубботинВ #122636 02.12.2025 Конец 			
				Сообщение = РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных, ?(СтрокаОтвета.Проведен, "Создана/обновлена Заявка ", "") + СтрокаОтвета.ПредставлениеЗаявкиНаРасходованиеСредств);
				Сообщение.Сообщить();
				//Евросиб СубботинВ #105749 us 105745 20.08.2025 Начало
                СтруктураПоиска = Новый Структура("ДействиеПриОбмене, УзелОбмена, Объект", Перечисления.ДействияПриОбмене.ЗагрузкаДанных, 
												  Перечисления.УзлыОбмена.УПП, СсылкаДокумента);
				СтруктураДанных = Новый Структура("УИДИсточника",СтрокаОтвета.ГУИД_УПП);
				РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных);
				//Евросиб СубботинВ #105749 us 105745 20.08.2025 Начало

				
				//Евросиб СубботинВ #106812 07.04.2025 Начало
				ИсторияЗаписейПоЗаяке =  ИсторияСтатусов.Найти(СсылкаДокумента, "Объект");
				Если НЕ ИсторияЗаписейПоЗаяке = Неопределено Тогда
					Если ИсторияЗаписейПоЗаяке.СтатусПоследний = Справочники.СтатусыДокументов.ВРеестреDCНаСогласовании //плановая выгрузка обычного маршрута
						или ИсторияЗаписейПоЗаяке.СтатусПоследний = Справочники.СтатусыДокументов.ВключенаВРеестрDC  //плановая по короткому
						или (ИсторияЗаписейПоЗаяке.СтатусПоследний = Справочники.СтатусыДокументов.НеВыгруженаВУПП //ошибка в длинном маршруте
						и ИсторияЗаписейПоЗаяке.СтатусПредпоследний = Справочники.СтатусыДокументов.ВРеестреDCНаСогласовании)
						или (ИсторияЗаписейПоЗаяке.СтатусПоследний = Справочники.СтатусыДокументов.НеВыгруженаВУПП   //ошибка в коротком маршруте
						и ИсторияЗаписейПоЗаяке.СтатусПредпоследний = Справочники.СтатусыДокументов.ВключенаВРеестрDC) Тогда
						ПроставляемыйСтатус = Справочники.СтатусыДокументов.ВыгруженаВУПП;
					ИначеЕсли ИсторияЗаписейПоЗаяке.СтатусПоследний = Справочники.СтатусыДокументов.НеВыгруженаВУПП
						и НЕ ИсторияЗаписейПоЗаяке.СтатусПредпоследний = Справочники.СтатусыДокументов.ВРеестреDCНаСогласовании
						и НЕ ИсторияЗаписейПоЗаяке.СтатусПредпоследний = Справочники.СтатусыДокументов.ВключенаВРеестрDC Тогда 
						ПроставляемыйСтатус = ИсторияЗаписейПоЗаяке.СтатусПредпоследний;
					Иначе
						ПроставляемыйСтатус = ИсторияЗаписейПоЗаяке.СтатусПоследний;	
					КонецЕсли;
				Иначе
					ПроставляемыйСтатус = Справочники.СтатусыДокументов.ПустаяСсылка();
				КонецЕсли;
				//РегистрыСведений.СтатусыОбъектов.ЗафиксироватьИзменениеСтатусаОбъекта(СсылкаДокумента, 
				//Справочники.СтатусыДокументов.ВыгруженаВУПП, Пользователи.ТекущийПользователь());
                РегистрыСведений.СтатусыОбъектов.ЗафиксироватьИзменениеСтатусаОбъекта(СсылкаДокумента, 
				ПроставляемыйСтатус, Пользователи.ТекущийПользователь());
				//Евросиб СубботинВ #106812 07.04.2025 Конец
				
				РегистрыСведений.ОшибкиПриОбменах.УдалитьСообщенияОбОшибках(СсылкаДокумента, Перечисления.УзлыОбмена.УПП);								
				ДокументыКСнятиюРегистрации.Добавить(СсылкаДокумента); 
			КонецЕсли;  
		КонецЦикла; 
		Если ДокументыКСнятиюРегистрации.Количество() Тогда
			УзелОбмена = Перечисления.УзлыОбмена.УПП;
			//Евросиб СубботинВ #89527 30.10.2024 Начало //вернул 10.02.2025  //вернул 28.03
			Для Каждого ДокументСнятия из  ДокументыКСнятиюРегистрации цикл
			//ПланыОбмена.ВыгрузкаДанных.УдалитьРегистрациюИзменений(ДокументыКСнятиюРегистрации, УзелОбмена);
			ПланыОбмена.ВыгрузкаДанных.УдалитьРегистрациюИзменений(ДокументСнятия, УзелОбмена);
			КонецЦикла;
			//Евросиб СубботинВ #89527 30.10.2024 Конец
		КонецЕсли;
	Иначе
		// Евросиб(ДИТ) US 73033 ТА 88304 Сержантова А.С. Конец: 30.07.2024
		
		Для каждого СтрокаОтвета Из ТаблицаОтвета Цикл  
			
			Если ЗначениеЗаполнено(СтрокаОтвета.Комментарий) Тогда
				ОбщегоНазначения.СообщитьПользователю("Документ не выгружен. Ошибки: " + СтрокаОтвета.Комментарий);
			Иначе	
				СсылкаДокумента = Документы[ТипДокументов].ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаОтвета.ГУИД));
				СтруктураПоиска = Новый Структура("ДействиеПриОбмене, УзелОбмена, Объект", Перечисления.ДействияПриОбмене.ВыгрузкаДанных, 
												   Перечисления.УзлыОбмена.УПП, СсылкаДокумента);
				ПредставлениеДокументовВУПП = СтрокаОтвета.ПредставлениеЗаявкиНаРасходованиеСредств;
				СтруктураДанных = Новый Структура("УИДИсточника, Ответственный, НомерДатаВБУ, Статус", СтрокаОтвета.ГУИД,  Пользователи.АвторизованныйПользователь(), ПредставлениеДокументовВУПП, "Подготовлен"); 
				Сообщение = РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных, "Создана Заявка " + СтрокаОтвета.ПредставлениеЗаявкиНаРасходованиеСредств);
				
				//Евросиб СубботинВ #89527 30.10.2024 Начало			
				РегистрыСведений.СтатусыОбъектов.ЗафиксироватьИзменениеСтатусаОбъекта(СсылкаДокумента, Справочники.СтатусыДокументов.ВыгруженаВУПП);			
				//Евросиб СубботинВ #89527 30.10.2024 Конец	
				
				Сообщение.Сообщить();    
				
			КонецЕсли; 
		КонецЦикла;  
		
	// Евросиб(ДИТ) US 73033 ТА 88304 Сержантова А.С. Начало: 30.07.2024
	КонецЕсли;
	// Евросиб(ДИТ) US 73033 ТА 88304 Сержантова А.С. Конец: 30.07.2024

КонецПроцедуры
//)
//Евросиб - АСуслов 31.03.2024 23:20:19 #78327   

//Евросиб СубботинВ #106143 31.03.2025 Начало 
// Евросиб(ДИТ) US 73033 ТА 88304 Сержантова А.С. 30.07.2024 
//Процедура РегЗадание_ВыгрузкаЗаявокНаОплатуВУПП(ДокументыКВыгрузке = Неопределено) Экспорт 
Процедура РегЗадание_ВыгрузкаЗаявокНаОплатуВУПП(ДокументыКВыгрузке = Неопределено, ОтправлятьУведомления = Истина) Экспорт
 //Евросиб СубботинВ #106143 31.03.2025 Конец

	НомерСообщения = 1;
	
	УзлыОбмена = ПланыОбмена.ВыгрузкаДанных.ПолучитьУзелОбмена(Перечисления.УзлыОбмена.УПП);
	Для каждого Узел Из УзлыОбмена Цикл 
		// Евросиб(ДИТ) US 73033 Сержантова А.С. Начало: 03.09.2024 
		// Устранение взаимоблокировок при обмене
		// Было:
		//ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(Узел, НомерСообщения); 
		//Стало:
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаОплатуИзменения.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаявкаНаОплату.Изменения КАК ЗаявкаНаОплатуИзменения
		|ГДЕ
		|	ЗаявкаНаОплатуИзменения.Узел = &Узел
		|	И &УсловиеПоДокументам";
		Запрос.УстановитьПараметр("Узел", Узел);  
		
		Если ДокументыКВыгрузке <> Неопределено Тогда
		    Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоДокументам", "ЗаявкаНаОплатуИзменения.Ссылка В (&ДокументыКВыгрузке)");
			Запрос.УстановитьПараметр("ДокументыКВыгрузке", ДокументыКВыгрузке); 
		Иначе	
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоДокументам", "Истина");
		КонецЕсли;
		
		РезультатЗапроса = Запрос.Выполнить(); 
		Если РезультатЗапроса.Пустой() Тогда
			Продолжить;
		КонецЕсли;
		ВыборкаИзменений = РезультатЗапроса.Выбрать();
		// Евросиб(ДИТ) US 73033 Сержантова А.С. Конец: 03.09.2024
		
		МассивСсылокКВыгрузке = Новый Массив;
		Пока ВыборкаИзменений.Следующий() Цикл    
			// Евросиб(ДИТ) US 73033 Сержантова А.С. Начало: 03.09.2024
			// Было:
			//ЗаявкаСсылка = ВыборкаИзменений.Получить().Ссылка; 
			//Если ДокументыКВыгрузке <> Неопределено Тогда 
			//	Если ДокументыКВыгрузке.Найти(ЗаявкаСсылка) <> Неопределено Тогда
			//		МассивСсылокКВыгрузке.Добавить(ЗаявкаСсылка); 
			//	КонецЕсли;
			//Иначе	
			//    МассивСсылокКВыгрузке.Добавить(ЗаявкаСсылка);
			//КонецЕсли;
			//Стало:
			МассивСсылокКВыгрузке.Добавить(ВыборкаИзменений.Ссылка);
			// Евросиб(ДИТ) US 73033 Сержантова А.С. Конец: 03.09.2024			
		КонецЦикла;  
		
		Если МассивСсылокКВыгрузке.Количество() Тогда
			// Евросиб(ДИТ) US 73033 Сержантова А.С. Начало: 03.09.2024
			// Было:
			//ПередатьЗаявкуВУПП(МассивСсылокКВыгрузке, "ЗаявкаНаОплату", 2); 
			//Стало:
			ИмяМетода = "ЕСОбменСервер.ПередатьЗаявкуВУПП";
			
			ПараметрыПроцедуры = Новый Массив;
			ПараметрыПроцедуры.Добавить(МассивСсылокКВыгрузке);
			ПараметрыПроцедуры.Добавить("ЗаявкаНаОплату");			
			ПараметрыПроцедуры.Добавить(2);
			//Евросиб СубботинВ #106143 31.03.2025 Начало
			ПараметрыПроцедуры.Добавить(ОтправлятьУведомления);
			//Евросиб СубботинВ #106143 31.03.2025 Конец
			
			НаименованиеФоновогоЗадания = НСтр("ru = 'Выгрузка Заявок на оплату в УПП (регламентное задание)'");
			КлючФоновогоЗадания = Строка(Новый УникальныйИдентификатор);
			
			ФоновоеЗадание = ФоновыеЗадания.Выполнить(ИмяМетода, ПараметрыПроцедуры, КлючФоновогоЗадания, НаименованиеФоновогоЗадания);
			ФоновоеЗадание.ОжидатьЗавершения(); 
			
			МассивСообщений = ДлительныеОперации.СообщенияПользователю(Истина, ФоновоеЗадание.УникальныйИдентификатор);
			Если МассивСообщений <> Неопределено Тогда
				Количество = МассивСообщений.Количество();
				Для Номер = 0 По Количество - 1 Цикл
					Сообщение = МассивСообщений[Номер];
					Сообщить(Сообщение.Текст);
				КонецЦикла;
			КонецЕсли;
			// Евросиб(ДИТ) US 73033 Сержантова А.С. Конец: 03.09.2024
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередатьПланыДДСВУПП(МассивСсылок) Экспорт

	Прокси = ВебСервисы_сервер.ПолучитьПрокси("ВебСервисПлановДДСУПП");

	СсылкиНаДокументы = Новый ТаблицаЗначений;
	СсылкиНаДокументы.Колонки.Добавить("ГУИД",Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	СсылкиНаДокументы.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.ПланПоступленийСписаний"));
	
	Для каждого Ссылка Из МассивСсылок Цикл
		Строка = СсылкиНаДокументы.Добавить();
		Строка.ГУИД = Ссылка.УникальныйИдентификатор();
		Строка.Ссылка = Ссылка;
	КонецЦикла;
	
#Область Запрос
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	СсылкиНаДокументы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СсылкиНаДокументы
	|ИЗ
	|	&СсылкиНаДокументы КАК СсылкиНаДокументы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПланПоступленийСписаний.Дата КАК Дата,
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	ПланПоступленийСписаний.Комментарий КАК Комментарий,
	|	ПРЕДСТАВЛЕНИЕ(ПланПоступленийСписаний.Автор) КАК Автор,
	|	ПланПоступленийСписаний.Номер КАК Номер,
	|	ПланПоступленийСписаний.ВариантПланаПродаж.Наименование КАК ВариантПланаПродажНаименование,
	|	ПланПоступленийСписаний.ДатаНачала КАК ДатаНачала,
	|	ПланПоступленийСписаний.ДатаОкончания КАК ДатаОкончания,
	|	ПланПоступленийСписаний.ЦФО.Код КАК ЦФОКод
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПланПоступленийСписаний КАК ПланПоступленийСписаний
	|		ПО СсылкиНаДокументы.Ссылка = ПланПоступленийСписаний.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	""Приход"" КАК ВидДвижения,
	|	ВЫРАЗИТЬ(ПланПоступленийСписанийПоступления.Сумма КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	ПланПоступленийСписанийПоступления.ДатаДвижения КАК ДатаДвижения,
	|	ПланПоступленийСписанийПоступления.Валюта.Код КАК ВалютаКод,
	|	ПланПоступленийСписанийПоступления.СтатьяДвиженияДенежныхСредств.Код КАК СтатьяДвиженияДенежныхСредствКод,
	|	Контрагенты.УИДИсточника КАК УИДКонтрагента,
	|	ДоговорыКонтрагентов.УИДИсточника КАК УИДДоговораКонтрагента,
	|	ВЫРАЗИТЬ(ПланПоступленийСписанийПоступления.КлючСтроки КАК Строка(36)) КАК КлючСтроки
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПланПоступленийСписаний.Поступления КАК ПланПоступленийСписанийПоступления
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Контрагенты
	|			ПО ПланПоступленийСписанийПоступления.Контрагент = Контрагенты.Объект
	|				И (Контрагенты.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (Контрагенты.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ДоговорыКонтрагентов
	|			ПО ПланПоступленийСписанийПоступления.ДоговорКонтрагента = ДоговорыКонтрагентов.Объект
	|				И (ДоговорыКонтрагентов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (ДоговорыКонтрагентов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|		ПО СсылкиНаДокументы.Ссылка = ПланПоступленийСписанийПоступления.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД,
	|	""Расход"",
	|	ВЫРАЗИТЬ(ПланПоступленийСписанийСписания.Сумма КАК ЧИСЛО(15, 2)),
	|	ПланПоступленийСписанийСписания.ДатаДвижения,
	|	ПланПоступленийСписанийСписания.Валюта.Код,
	|	ПланПоступленийСписанийСписания.СтатьяДвиженияДенежныхСредств.Код,
	|	Контрагенты.УИДИсточника,
	|	ДоговорыКонтрагентов.УИДИсточника,
	|	ВЫРАЗИТЬ(ПланПоступленийСписанийСписания.КлючСтроки КАК Строка(36))
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПланПоступленийСписаний.Списания КАК ПланПоступленийСписанийСписания
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Контрагенты
	|			ПО (Контрагенты.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (Контрагенты.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|				И ПланПоступленийСписанийСписания.Контрагент = Контрагенты.Объект
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ДоговорыКонтрагентов
	|			ПО ПланПоступленийСписанийСписания.ДоговорКонтрагента = ДоговорыКонтрагентов.Объект
	|				И (ДоговорыКонтрагентов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (ДоговорыКонтрагентов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|		ПО СсылкиНаДокументы.Ссылка = ПланПоступленийСписанийСписания.Ссылка";
	
#КонецОбласти 	
	Запрос.УстановитьПараметр("СсылкиНаДокументы", СсылкиНаДокументы);
	
	Результаты = Запрос.ВыполнитьПакет();		
	Шапки = Результаты[1].Выгрузить(); 
	ТЧДвижений = Результаты[2].Выгрузить();
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Шапки", Шапки);
	СтруктураДанных.Вставить("ТЧДвижений", ТЧДвижений);	
	
	ПередаваемаяСтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(СтруктураДанных); 

	ОтветУПП = Прокси.CreateCashFlowPlanFromDC(ПередаваемаяСтрокаXML);
	ТаблицаОтвета = ОбщегоНазначения.ЗначениеИзСтрокиXML(ОтветУПП);
	Для каждого СтрокаОтвета Из ТаблицаОтвета Цикл
		Если ЗначениеЗаполнено(СтрокаОтвета.Комментарий) Тогда
			ОбщегоНазначения.СообщитьПользователю("Документ не выгружен. Ошибки: " + СтрокаОтвета.Комментарий);
		Иначе	
			СтруктураПоиска = Новый Структура("ДействиеПриОбмене, УзелОбмена, Объект", Перечисления.ДействияПриОбмене.ВыгрузкаДанных, Перечисления.УзлыОбмена.УПП,
											Документы.ПланПоступленийСписаний.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаОтвета.ГУИД)));
			СтруктураДанных = Новый Структура("УИДИсточника, Ответственный, НомерДатаВБУ", СтрокаОтвета.ГУИД,  Пользователи.АвторизованныйПользователь(), СтрокаОтвета.ПредставлениеПланаДДС);
			Сообщение = РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных, "Создан План ДДС: " + СтрокаОтвета.ПредставлениеПланаДДС);
			Сообщение.Сообщить();
		КонецЕсли; 
	КонецЦикла; 

КонецПроцедуры

Функция ПередатьДанныеПоПТУ(XMLParams) Экспорт

	ГУИДДокументов =  ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	СсылкиНаДокументы = Новый ТаблицаЗначений;
	СсылкиНаДокументы.Колонки.Добавить("ГУИД",Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	СсылкиНаДокументы.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.ПоступлениеТоваровУслуг"));
	
	Для Каждого СтрокаГУИД Из ГУИДДокументов Цикл
		Строка = СсылкиНаДокументы.Добавить();
		Строка.ГУИД = СтрокаГУИД;
		Строка.Ссылка = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.ГУИД));
	КонецЦикла;
	
#Область Запрос
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	СсылкиНаДокументы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СсылкиНаДокументы
	|ИЗ
	|	&СсылкиНаДокументы КАК СсылкиНаДокументы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	ПоступлениеТоваровУслуг.ДатаВходящегоДокумента КАК Дата,
	//Евросиб Литвинов ( 30.12.21 #44592 Ticket#0254477 #44587 
	|	ПоступлениеТоваровУслуг.ДатаСФХЖ КАК ДатаСФХЖ,
	//Евросиб Литвинов) 	
	|	ПоступлениеТоваровУслуг.Организация.Код КАК ОрганизацияКод,
	|	ПоступлениеТоваровУслуг.ПодразделениеОрганизации.Код КАК ПодразделениеОрганизацииКод,
	|	ПоступлениеТоваровУслуг.ЦФО.Код КАК ЦФОКод,
	|	Контрагенты.УИДИсточника КАК УИДКонтрагента,
	|	ДоговорыКонтрагентов.УИДИсточника КАК УИДДоговораКонтрагента,
	|	ПоступлениеТоваровУслуг.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	ПоступлениеТоваровУслуг.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	ПоступлениеТоваровУслуг.БанковскийСчетКонтрагента.НомерСчета КАК БанковскийСчетКонтрагентаНомерСчета,
	|	ЕСТЬNULL(СчетФактураПолученный.ДатаВходящегоДокумента, ПоступлениеТоваровУслуг.ДатаВходящегоДокумента) КАК ДатаВСФ,
	|	ЕСТЬNULL(СчетФактураПолученный.НомерВходящегоДокумента, ПоступлениеТоваровУслуг.НомерВходящегоДокумента) КАК НомерВСФ,
	|	ПОДСТРОКА(ПоступлениеТоваровУслуг.Комментарий, 1, 1000) КАК Комментарий,
	|	ПоступлениеТоваровУслуг.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ПоступлениеТоваровУслуг.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ПоступлениеТоваровУслуг.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	|	ПоступлениеТоваровУслуг.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслуг.Ответственный) КАК ОтветственныйНаименование,
	|	ПоступлениеТоваровУслуг.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ПоступлениеТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
	|	ПоступлениеТоваровУслуг.УчитыватьНДС КАК УчитыватьНДС,
	|	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслуг.Автор) КАК АвторНаименование,
	|	Грузоотправители.УИДИсточника КАК УИДГрузоотправителя,
	|	Грузополучатели.УИДИсточника КАК УИДГрузополучателя,
	|	ПоступлениеТоваровУслуг.ДатаПересчета КАК ДатаПересчета,
	|	ПоставщикиВУ.УИДИсточника КАК УИДПоставщикаВУ,
	|	ВЫБОР
	|		КОГДА Диадок_Документы.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭЦП,
	|	ПоступлениеТоваровУслуг.Копия КАК Копия,
	|	ПоступлениеТоваровУслуг.Штраф КАК Штраф , 
	//Евросиб Дубская 08.11.2023 ( Ticket#0330957
	|	ПоступлениеТоваровУслуг.Претензия КАК Претензия, 
	//Евросиб Дубская 08.11.2023 )
	// ++ ДИТ, Сгонник, 2022-02-15 US 35092; TA 47342 необходимо добавить в обмен ДК-УПП ГУИД и ссылку на карточку в базе 1С:ДО
	|	ЕСТЬNULL(ПротоколОбменовДО.УИДИсточника, Неопределено) КАК ГУИДОсновногоДокументаВПакетеДО,
	|	ПоступлениеТоваровУслуг.Ссылка.СсылкаОсновногоДокументаДО КАК СсылкаОсновногоДокументаДО,
	// -- ДИТ, Сгонник, 2022-02-15 US 35092; TA 47342 необходимо добавить в обмен ДК-УПП ГУИД и ссылку на карточку в базе 1С:ДО
	//(Евросиб Максимова 05.05.2021 #0230136
	|   ПротоколОбменовРИТМ.УИДИсточника КАК УИДРИТМ
	//)Евросиб Максимова 05.05.2021 #0230136
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|			ПО ПоступлениеТоваровУслуг.Ссылка = СчетФактураПолученный.ДокументОснование
	|				И (СчетФактураПолученный.Проведен)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Контрагенты
	|			ПО ПоступлениеТоваровУслуг.Контрагент = Контрагенты.Объект
	|				И (Контрагенты.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (Контрагенты.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ДоговорыКонтрагентов
	|			ПО ПоступлениеТоваровУслуг.ДоговорКонтрагента = ДоговорыКонтрагентов.Объект
	|				И (ДоговорыКонтрагентов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (ДоговорыКонтрагентов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Грузоотправители
	|			ПО ПоступлениеТоваровУслуг.Грузоотправитель = Грузоотправители.Объект
	|				И (Грузоотправители.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (Грузоотправители.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Грузополучатели
	|			ПО ПоступлениеТоваровУслуг.Грузополучатель = Грузополучатели.Объект
	|				И (Грузополучатели.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (Грузополучатели.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПоставщикиВУ
	|			ПО ПоступлениеТоваровУслуг.ПоставщикВУ = ПоставщикиВУ.Объект
	|				И (ПоставщикиВУ.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (ПоставщикиВУ.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Диадок_Документы КАК Диадок_Документы
	|			ПО ПоступлениеТоваровУслуг.Ссылка = Диадок_Документы.Документ
	// ++ ДИТ, Сгонник, 2022-02-15 US 35092; TA 47342 необходимо добавить в обмен ДК-УПП ГУИД и ссылку на карточку в базе 1С:ДО
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменовДО
	|			ПО ПоступлениеТоваровУслуг.Ссылка = ПротоколОбменовДО.Объект
	|				И (ПротоколОбменовДО.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (ПротоколОбменовДО.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.ДО))
	// -- ДИТ, Сгонник, 2022-02-15 US 35092; TA 47342 необходимо добавить в обмен ДК-УПП ГУИД и ссылку на карточку в базе 1С:ДО
	//(Евросиб Максимова 05.05.2021 #0230136
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменовРИТМ
	|		ПО ПоступлениеТоваровУслуг.Ссылка = ПротоколОбменовРИТМ.Объект 
	//Евросиб Дубская ( 18.02.2022 Ticket№0255381
	//|			И (ПротоколОбменовРИТМ.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))  
	// Евросиб Дубская)
	|			И (ПротоколОбменовРИТМ.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.РИТМ))
	//)Евросиб Максимова 05.05.2021 #0230136
	|		ПО СсылкиНаДокументы.Ссылка = ПоступлениеТоваровУслуг.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	ПоступлениеТоваровУслугСвязьУслугИСчетов.НомерСтроки КАК НомерСтроки,
	|	ПоступлениеТоваровУслугУслуги.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	ПротоколОбменов.УИДИсточника КАК НоменклатураКод,
	|	ПОДСТРОКА(ПоступлениеТоваровУслугУслуги.Содержание, 1, 1000) КАК Содержание,
	|	1 КАК Количество,
	|	ПоступлениеТоваровУслугСвязьУслугИСчетов.ОтнесеннаяСумма КАК Цена,
	|	ПоступлениеТоваровУслугСвязьУслугИСчетов.ОтнесеннаяСумма КАК Сумма,
	|	ПоступлениеТоваровУслугСвязьУслугИСчетов.СтавкаНДС КАК СтавкаНДС,
	|	ПоступлениеТоваровУслугСвязьУслугИСчетов.СуммаНДС КАК СуммаНДС,
	|	Счета.УИДИсточника КАК ГУИДЗаказа
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.СвязьУслугИСчетов КАК ПоступлениеТоваровУслугСвязьУслугИСчетов
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Счета
	|				ПО ПоступлениеТоваровУслугСвязьУслугИСчетов.СчетПоставщика = Счета.Объект
	|					И (Счета.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УППЗаказ))
	|			ПО ПоступлениеТоваровУслугУслуги.Ссылка = ПоступлениеТоваровУслугСвязьУслугИСчетов.Ссылка
	|				И ПоступлениеТоваровУслугУслуги.ГУИДПТУ = ПоступлениеТоваровУслугСвязьУслугИСчетов.ГУИДПТУ
	//Евросиб Каблов 11.10.2023 ( Ticket#0317657
	|				И ПоступлениеТоваровУслугСвязьУслугИСчетов.ОтнесеннаяСумма <> 0
	//Евросиб Каблов 11.10.2023 )
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|			ПО ПоступлениеТоваровУслугУслуги.Номенклатура = ПротоколОбменов.Объект
	|				И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	|				И (ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
	|		ПО СсылкиНаДокументы.Ссылка = ПоступлениеТоваровУслугУслуги.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	ЕСТЬNULL(ПротоколОбменов.УИДИсточника, ЕСТЬNULL(ПротоколОбменовСФ.УИДИсточника, """")) КАК ГУИДЗаказа,
	|	ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.ОтнесеннаяСумма КАК СуммаНаПТУ,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.СчетПоставщика ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоСчетНаоплатуПоставщика,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.СчетПоставщика ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|			ТОГДА ЕСТЬNULL(СчетФактураПолученный.Номер, ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.СчетПоставщика.Номер)
	|		ИНАЧЕ ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.СчетПоставщика.Номер
	|	КОНЕЦ КАК СчетПоставщикаНомер,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.СчетПоставщика ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|			ТОГДА ЕСТЬNULL(СчетФактураПолученный.Дата, ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.СчетПоставщика.Дата)
	|		ИНАЧЕ ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.СчетПоставщика.Дата
	|	КОНЕЦ КАК СчетПоставщикаДата,
	|	ПротоколОбменовДоговоры.УИДИсточника КАК ГУИДДоговора
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.СвязьУслугИСчетов КАК ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|			ПО (ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.СчетПоставщика = ПротоколОбменов.Объект)
	|				И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УППЗаказ))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменовДоговоры
	|			ПО ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.Ссылка.ДоговорКонтрагента = ПротоколОбменовДоговоры.Объект
	|				И (ПротоколОбменовДоговоры.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (ПротоколОбменовДоговоры.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|		ПО СсылкиНаДокументы.Ссылка = ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.Ссылка
	//Евросиб Каблов 11.10.2023 ( Ticket#0317657
	|			И ПоступлениеТоваровУслугСвязанныеСчетаПоставщиков.ОтнесеннаяСумма <> 0
	//Евросиб Каблов 11.10.2023 )
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменовСФ
	|			ПО СчетФактураПолученный.Ссылка = ПротоколОбменовСФ.Объект
	|				И (ПротоколОбменовСФ.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УППЗаказ))
	|		ПО СсылкиНаДокументы.Ссылка = СчетФактураПолученный.ДокументОснование";
	
#КонецОбласти 	
	Запрос.УстановитьПараметр("СсылкиНаДокументы", СсылкиНаДокументы);
	
	Результаты = Запрос.ВыполнитьПакет();		
	Шапки = Результаты[1].Выгрузить(); 
	ТЧУслуги = Результаты[2].Выгрузить();
	ТЧЗаказы = Результаты[3].Выгрузить();
	
	СтруктураШапкиИТЧ = Новый Структура;
	СтруктураШапкиИТЧ.Вставить("Шапки", Шапки);
	СтруктураШапкиИТЧ.Вставить("ТЧУслуги", ТЧУслуги);	
	СтруктураШапкиИТЧ.Вставить("ТЧЗаказы", ТЧЗаказы);	
	
	ПередаваемаяСтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(СтруктураШапкиИТЧ); 
	
	Возврат ПередаваемаяСтрокаXML;		

КонецФункции // ПередатьДанныеПоПТУ(XMLParams)

Функция ПередатьДанныеПоКоррПТУ(XMLParams) Экспорт

	ГУИДДокументов =  ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	СсылкиНаДокументы = Новый ТаблицаЗначений;
	СсылкиНаДокументы.Колонки.Добавить("ГУИД",Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	СсылкиНаДокументы.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.КорректировкаПоступления"));
	
	Для Каждого СтрокаГУИД Из ГУИДДокументов Цикл
		Строка = СсылкиНаДокументы.Добавить();
		Строка.ГУИД = СтрокаГУИД;
		Строка.Ссылка = Документы.КорректировкаПоступления.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.ГУИД));
		ДокументПоступления = БухгалтерскийУчетПереопределяемый.ПолучитьИсправляемыйДокументПоступления(Строка.Ссылка, Истина);
	КонецЦикла;
	
#Область Запрос
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	СсылкиНаДокументы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СсылкиНаДокументы
	|ИЗ
	|	&СсылкиНаДокументы КАК СсылкиНаДокументы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	//Евросиб Литвинов ( 30.12.21 #44592 Ticket#0254477 #44587 
	|	КорректировкаПоступления.ДатаСФХЖ КАК ДатаСФХЖ,
	//Евросиб Литвинов) 	
	|	КорректировкаПоступления.ДатаВходящегоДокумента КАК Дата,
	|	КорректировкаПоступления.Организация.Код КАК ОрганизацияКод,
	|	КорректировкаПоступления.ПодразделениеОрганизации.Код КАК ПодразделениеОрганизацииКод,
	|	КорректировкаПоступления.ЦФО.Код КАК ЦФОКод,
	|	Контрагенты.УИДИсточника КАК УИДКонтрагента,
	|	ДоговорыКонтрагентов.УИДИсточника КАК УИДДоговораКонтрагента,
	|	КорректировкаПоступления.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	КорректировкаПоступления.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	КорректировкаПоступления.БанковскийСчетКонтрагента.НомерСчета КАК БанковскийСчетКонтрагентаНомерСчета,
	|	ЕСТЬNULL(СчетФактураПолученный.ДатаВходящегоДокумента, Неопределено) КАК ДатаВСФ,
	|	ЕСТЬNULL(СчетФактураПолученный.НомерВходящегоДокумента, """") КАК НомерВСФ,
	|	ПОДСТРОКА(КорректировкаПоступления.Комментарий, 1, 1000) КАК Комментарий,
	|	КорректировкаПоступления.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	КорректировкаПоступления.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	КорректировкаПоступления.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	|	КорректировкаПоступления.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	ПРЕДСТАВЛЕНИЕ(КорректировкаПоступления.Ответственный) КАК ОтветственныйНаименование,
	|	КорректировкаПоступления.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	КорректировкаПоступления.СуммаДокумента КАК СуммаДокумента,
	|	КорректировкаПоступления.УчитыватьНДС КАК УчитыватьНДС,
	|	ПРЕДСТАВЛЕНИЕ(КорректировкаПоступления.Автор) КАК АвторНаименование,
	|	Грузоотправители.УИДИсточника КАК УИДГрузоотправителя,
	|	Грузополучатели.УИДИсточника КАК УИДГрузополучателя,
	|	КорректировкаПоступления.ДатаПересчета КАК ДатаПересчета,
	|	ПоставщикиВУ.УИДИсточника КАК УИДПоставщикаВУ,
	|	ВЫБОР
	|		КОГДА Диадок_Документы.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭЦП,
	|	КорректировкаПоступления.Копия КАК Копия,
	|	ВЫБОР
	|		КОГДА КорректировкаПоступления.ДокументПоступления ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(КорректировкаПоступления.ДокументПоступления КАК Документ.ПоступлениеТоваровУслуг).Штраф
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Штраф,    
	//Евросиб Дубская 08.11.2023 ( Ticket#0330957
	|	ВЫБОР
	|		КОГДА КорректировкаПоступления.ДокументПоступления ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(КорректировкаПоступления.ДокументПоступления КАК Документ.ПоступлениеТоваровУслуг).Претензия
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Претензия,    
	//Евросиб Дубская 08.11.2023 )
	|	КорректировкаПоступления.НомерИсправления КАК НомерИсправления,
	|	КорректировкаПоступления.ДатаИсправления КАК ДатаИсправления,
	|	КорректировкаПоступления.НомерИсходногоДокумента КАК НомерИсходногоДокумента,
	|	КорректировкаПоступления.ДатаИсходногоДокумента КАК ДатаИсходногоДокумента,
	|	КорректировкаПоступления.НомерИсправленияИсходногоДокумента КАК НомерИсправленияИсходногоДокумента,
	|	КорректировкаПоступления.ДатаИсправленияИсходногоДокумента КАК ДатаИсправленияИсходногоДокумента,
	|	ДокументыПоступления.УИДИсточника КАК УИДДокументаПоступления,
	|	ИсправляемыеДокументыПоступления.УИДИсточника КАК УИДИсправляемогоДокументаПоступления,
	// ++ ДИТ, Сгонник, 2022-02-15 US 35092; TA 47342 необходимо добавить в обмен ДК-УПП ГУИД и ссылку на карточку в базе 1С:ДО
	|	ЕСТЬNULL(ПротоколОбменовДО.УИДИсточника, Неопределено) КАК ГУИДОсновногоДокументаВПакетеДО,
	|	КорректировкаПоступления.Ссылка.СсылкаОсновногоДокументаДО КАК СсылкаОсновногоДокументаДО,
	// -- ДИТ, Сгонник, 2022-02-15 US 35092; TA 47342 необходимо добавить в обмен ДК-УПП ГУИД и ссылку на карточку в базе 1С:ДО
	|	КорректировкаПоступления.ВидОперации КАК ВидОперации
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления КАК КорректировкаПоступления
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|			ПО КорректировкаПоступления.Ссылка = СчетФактураПолученный.ДокументОснование
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Контрагенты
	|			ПО КорректировкаПоступления.Контрагент = Контрагенты.Объект
	|				И (Контрагенты.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (Контрагенты.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ДоговорыКонтрагентов
	|			ПО КорректировкаПоступления.ДоговорКонтрагента = ДоговорыКонтрагентов.Объект
	|				И (ДоговорыКонтрагентов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (ДоговорыКонтрагентов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Грузоотправители
	|			ПО КорректировкаПоступления.Грузоотправитель = Грузоотправители.Объект
	|				И (Грузоотправители.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (Грузоотправители.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Грузополучатели
	|			ПО КорректировкаПоступления.Грузополучатель = Грузополучатели.Объект
	|				И (Грузополучатели.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (Грузополучатели.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПоставщикиВУ
	|			ПО КорректировкаПоступления.ПоставщикВУ = ПоставщикиВУ.Объект
	|				И (ПоставщикиВУ.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (ПоставщикиВУ.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ДокументыПоступления
	|			ПО КорректировкаПоступления.ДокументПоступления = ДокументыПоступления.Объект
	|				И (ДокументыПоступления.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
	|				И (ДокументыПоступления.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ИсправляемыеДокументыПоступления
	|			ПО КорректировкаПоступления.ИсправляемыйДокументПоступления = ИсправляемыеДокументыПоступления.Объект
	|				И (ИсправляемыеДокументыПоступления.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
	|				И (ИсправляемыеДокументыПоступления.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Диадок_Документы КАК Диадок_Документы
	|			ПО КорректировкаПоступления.Ссылка = Диадок_Документы.Документ
	// ++ ДИТ, Сгонник, 2022-02-15 US 35092; TA 47342 необходимо добавить в обмен ДК-УПП ГУИД и ссылку на карточку в базе 1С:ДО
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменовДО
	|			ПО КорректировкаПоступления.Ссылка = ПротоколОбменовДО.Объект
	|				И (ПротоколОбменовДО.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (ПротоколОбменовДО.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.ДО))
	// -- ДИТ, Сгонник, 2022-02-15 US 35092; TA 47342 необходимо добавить в обмен ДК-УПП ГУИД и ссылку на карточку в базе 1С:ДО
	|		ПО СсылкиНаДокументы.Ссылка = КорректировкаПоступления.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	ЕСТЬNULL(ПоступлениеТоваровУслугСвязьУслугИСчетов.НомерСтроки, 0) КАК НомерСтроки,
	|	ПротоколОбменовНоменклатура.УИДИсточника КАК НоменклатураКод,
	|	ПОДСТРОКА(КорректировкаПоступленияУслуги.Содержание, 1, 1000) КАК Содержание,
	|	1 КАК Количество,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ПоступлениеТоваровУслугСвязьУслугИСчетов.ОтнесеннаяСумма, 0) + КорректировкаПоступленияСвязьУслугИСчетов.ОтнесеннаяСумма КАК ЧИСЛО(15, 2)) КАК Цена,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ПоступлениеТоваровУслугСвязьУслугИСчетов.ОтнесеннаяСумма, 0) + КорректировкаПоступленияСвязьУслугИСчетов.ОтнесеннаяСумма КАК ЧИСЛО(15, 2)) КАК Сумма, 
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА КорректировкаПоступленияУслуги.ВсегоДоКорректировки = 0
	|				ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугСвязьУслугИСчетов.ОтнесеннаяСумма, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаДоИзменения,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА КорректировкаПоступленияУслуги.ВсегоДоКорректировки <> 0
	|				ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугСвязьУслугИСчетов.ОтнесеннаяСумма, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаДоКорректировки,
	|	КорректировкаПоступленияУслуги.СтавкаНДС КАК СтавкаНДС,
	|	КорректировкаПоступленияУслуги.СтавкаНДСДоИзменения КАК СтавкаНДСДоИзменения,  
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ПоступлениеТоваровУслугСвязьУслугИСчетов.СуммаНДС, 0) + КорректировкаПоступленияСвязьУслугИСчетов.СуммаНДС КАК ЧИСЛО(15, 2)) КАК СуммаНДС, 
	|	ПОДСТРОКА(КорректировкаПоступленияУслуги.СодержаниеДоИзменения, 1, 1000) КАК СодержаниеДоИзменения,
	|	1 КАК КоличествоДоИзменения,  
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА КорректировкаПоступленияУслуги.ВсегоДоКорректировки = 0
	|				ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугСвязьУслугИСчетов.ОтнесеннаяСумма, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК ЦенаДоИзменения,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА КорректировкаПоступленияУслуги.ВсегоДоКорректировки = 0
	|				ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугСвязьУслугИСчетов.СуммаНДС, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДСДоИзменения,
	|	1 КАК КоличествоДоКорректировки,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА КорректировкаПоступленияУслуги.ВсегоДоКорректировки <> 0
	|				ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугСвязьУслугИСчетов.ОтнесеннаяСумма, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК ЦенаДоКорректировки,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА КорректировкаПоступленияУслуги.ВсегоДоКорректировки <> 0
	|				ТОГДА ЕСТЬNULL(ПоступлениеТоваровУслугСвязьУслугИСчетов.СуммаНДС, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДСДоКорректировки,
	|	Счета.УИДИсточника КАК ГУИДЗаказа
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления.Услуги КАК КорректировкаПоступленияУслуги
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменовНоменклатура
	|			ПО КорректировкаПоступленияУслуги.Номенклатура = ПротоколОбменовНоменклатура.Объект
	|				И (ПротоколОбменовНоменклатура.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	|				И (ПротоколОбменовНоменклатура.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления.СвязьУслугИСчетов КАК КорректировкаПоступленияСвязьУслугИСчетов
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Счета
	|				ПО (ВЫБОР
	|						КОГДА КорректировкаПоступленияСвязьУслугИСчетов.СчетПоставщика ССЫЛКА Документ.КорректировкаПоступления
	|							ТОГДА КорректировкаПоступленияСвязьУслугИСчетов.Ссылка = Счета.Объект
	|									И Счета.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП)
	|						ИНАЧЕ КорректировкаПоступленияСвязьУслугИСчетов.СчетПоставщика = Счета.Объект
	|								И Счета.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УППЗаказ)
	|					КОНЕЦ)
	|			ПО КорректировкаПоступленияУслуги.Ссылка = КорректировкаПоступленияСвязьУслугИСчетов.Ссылка
	|				И КорректировкаПоступленияУслуги.ГУИДПТУ = КорректировкаПоступленияСвязьУслугИСчетов.ГУИДПТУ
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.СвязьУслугИСчетов КАК ПоступлениеТоваровУслугСвязьУслугИСчетов
	|			ПО (КорректировкаПоступленияСвязьУслугИСчетов.Ссылка.ДокументПоступления = ПоступлениеТоваровУслугСвязьУслугИСчетов.Ссылка)
	|				И (КорректировкаПоступленияСвязьУслугИСчетов.ГУИДПТУ = ПоступлениеТоваровУслугСвязьУслугИСчетов.ГУИДПТУ)
	|				И (КорректировкаПоступленияСвязьУслугИСчетов.СчетПоставщика = ПоступлениеТоваровУслугСвязьУслугИСчетов.СчетПоставщика)
	|		ПО СсылкиНаДокументы.Ссылка = КорректировкаПоступленияУслуги.Ссылка
	|   
	|УПОРЯДОЧИТЬ ПО
	|	ЕСТЬNULL(ПоступлениеТоваровУслугСвязьУслугИСчетов.НомерСтроки, 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	ЕСТЬNULL(ПротоколОбменов.УИДИсточника, ЕСТЬNULL(ПротоколОбменовСФ.УИДИсточника, """")) КАК ГУИДЗаказа,
	|	КорректировкаПоступленияСвязанныеСчетаПоставщиков.СуммаНаПТУ КАК СуммаНаПТУ,
	|	ВЫБОР
	|		КОГДА КорректировкаПоступленияСвязанныеСчетаПоставщиков.СчетПоставщика ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоСчетНаоплатуПоставщика,
	|	ВЫБОР
	|		КОГДА КорректировкаПоступленияСвязанныеСчетаПоставщиков.СчетПоставщика ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|			ТОГДА ЕСТЬNULL(СчетФактураПолученный.Номер, КорректировкаПоступленияСвязанныеСчетаПоставщиков.СчетПоставщика.Номер)
	|		ИНАЧЕ КорректировкаПоступленияСвязанныеСчетаПоставщиков.СчетПоставщика.Номер
	|	КОНЕЦ КАК СчетПоставщикаНомер,
	|	ВЫБОР
	|		КОГДА КорректировкаПоступленияСвязанныеСчетаПоставщиков.СчетПоставщика ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|			ТОГДА ЕСТЬNULL(СчетФактураПолученный.Дата, КорректировкаПоступленияСвязанныеСчетаПоставщиков.СчетПоставщика.Дата)
	|		ИНАЧЕ КорректировкаПоступленияСвязанныеСчетаПоставщиков.СчетПоставщика.Дата
	|	КОНЕЦ КАК СчетПоставщикаДата,
	|	ПротоколОбменовДоговоры.УИДИсточника КАК ГУИДДоговора
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления.СвязанныеСчетаПоставщиков КАК КорректировкаПоступленияСвязанныеСчетаПоставщиков
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|			ПО КорректировкаПоступленияСвязанныеСчетаПоставщиков.СчетПоставщика = ПротоколОбменов.Объект
	|				И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УППЗаказ))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменовДоговоры
	|			ПО КорректировкаПоступленияСвязанныеСчетаПоставщиков.Ссылка.ДоговорКонтрагента = ПротоколОбменовДоговоры.Объект
	|				И (ПротоколОбменовДоговоры.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (ПротоколОбменовДоговоры.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|		ПО СсылкиНаДокументы.Ссылка = КорректировкаПоступленияСвязанныеСчетаПоставщиков.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменовСФ
	|			ПО СчетФактураПолученный.Ссылка = ПротоколОбменовСФ.Объект
	|				И (ПротоколОбменовСФ.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УППЗаказ))
	|		ПО СсылкиНаДокументы.Ссылка = СчетФактураПолученный.ДокументОснование";
#КонецОбласти 	
	Запрос.УстановитьПараметр("СсылкиНаДокументы", СсылкиНаДокументы);
	
	Результаты = Запрос.ВыполнитьПакет();		
	Шапки 		= Результаты[1].Выгрузить(); 
	ТЧУслуги 	= Результаты[2].Выгрузить();
	ТЧЗаказы 	= Результаты[3].Выгрузить(); 
	
	СтруктураШапкиИТЧУслуги = Новый Структура;
	СтруктураШапкиИТЧУслуги.Вставить("Шапки", Шапки);
	СтруктураШапкиИТЧУслуги.Вставить("ТЧУслуги", ТЧУслуги);	
	СтруктураШапкиИТЧУслуги.Вставить("ТЧЗаказы", ТЧЗаказы);	
	
	ПередаваемаяСтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(СтруктураШапкиИТЧУслуги); 
	
	Возврат ПередаваемаяСтрокаXML;		

КонецФункции // ПолучитьДанныеПоПТУ(XMLParams)

Функция ПередатьДанныеПоВСФ(XMLParams) Экспорт

	ГУИДДокументов =  ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	СсылкиНаДокументы = Новый ТаблицаЗначений;
	СсылкиНаДокументы.Колонки.Добавить("ГУИД",Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	СсылкиНаДокументы.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.СчетФактураПолученный"));
	СсылкиНаДокументы.Колонки.Добавить("ГУИД_ПТУ", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	
	Для Каждого СтрокаГУИД Из ГУИДДокументов Цикл
		Строка = СсылкиНаДокументы.Добавить();
		Строка.ГУИД = СтрокаГУИД;
		Строка.Ссылка = Документы.СчетФактураПолученный.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.ГУИД));
		Строка.ГУИД_ПТУ = Строка.Ссылка.ДокументОснование.УникальныйИдентификатор();
	КонецЦикла;
	
#Область Запрос
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	СсылкиНаДокументы.ГУИД_ПТУ КАК ГУИД_ПТУ,
	|	СсылкиНаДокументы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СсылкиНаДокументы
	|ИЗ
	|	&СсылкиНаДокументы КАК СсылкиНаДокументы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	СсылкиНаДокументы.ГУИД_ПТУ КАК ГУИДДокументаОснования,
	|	СчетФактураПолученный.ДатаВходящегоДокумента КАК Дата,
	|	СчетФактураПолученный.ДатаИсправления КАК ДатаИсправления,
//Евросиб Литвинов ( 30.12.21 #44592 Ticket#0254477 #44587 
	|	ДокПоступлениеТоваровУслуг.ДатаСФХЖ КАК ДатаСФХЖ,
//Евросиб Литвинов) 	
	|	СчетФактураПолученный.ВидСчетаФактуры КАК ВидСчетаФактуры,
	|	СчетФактураПолученный.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	СчетФактураПолученный.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	СчетФактураПолученный.НомерИсходногоДокумента КАК НомерИсходногоДокумента,
	|	СчетФактураПолученный.ДатаИсходногоДокумента КАК ДатаИсходногоДокумента,
	|	СчетФактураПолученный.КодВидаОперации КАК КодВидаОперации,
	|	Контрагенты.УИДИсточника КАК УИДКонтрагента,
	|	ДоговорыКонтрагентов.УИДИсточника КАК УИДДоговораКонтрагента,
	|	СчетФактураПолученный.Исправление КАК Исправление,
	|	ИсправляемыеСФ.УИДИсточника КАК ГУИДИсправляемогоСФ,
	|	СчетФактураПолученный.НомерИсправления КАК НомерИсправления,
	|	Продавцы.УИДИсточника КАК УИДПродавца,
	|	СчетФактураПолученный.Организация.Код КАК ОрганизацияКод,
	|	СчетФактураПолученный.КодСпособаПолучения КАК КодСпособаПолучения,
	|	СчетФактураПолученный.СуммаДокумента КАК СуммаДокумента,
	|	СчетФактураПолученный.СуммаУвеличение КАК СуммаУвеличение,
	|	СчетФактураПолученный.СуммаУменьшение КАК СуммаУменьшение,
	|	СчетФактураПолученный.СуммаНДСДокумента КАК СуммаНДСДокумента,
	|	СчетФактураПолученный.СуммаНДСУвеличение КАК СуммаНДСУвеличение,
	|	СчетФактураПолученный.СуммаНДСУменьшение КАК СуммаНДСУменьшение,
	|	СчетФактураПолученный.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	СчетФактураПолученный.Ответственный.Наименование КАК ОтветственныйНаименование,
	|	СчетФактураПолученный.Комментарий КАК Комментарий,
	|	СчетФактураПолученный.СводныйКорректировочный КАК СводныйКорректировочный,
	|	СчетФактураПолученный.СводныйКомиссионный КАК СводныйКомиссионный,
	|	СФВыданныеПокупателю.УИДИсточника КАК ГУИДСФВыданногоПокупателю,
	|	Комитенты.УИДИсточника КАК УИДКомитента,
	|	ДоговорыКомитентов.УИДИсточника КАК УИДДоговораКомитента,
	|	СчетФактураПолученный.ДатаПолучения КАК ДатаПолучения,
	|	СчетФактураПолученный.Получен КАК Получен,
	|	СчетФактураПолученный.Автор.Наименование КАК АвторНаименование
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный
//Евросиб Литвинов ( 30.12.21 #44592 Ticket#0254477 #44587 
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ДокПоступлениеТоваровУслуг
	|			ПО СчетФактураПолученный.ДокументОснование = ДокПоступлениеТоваровУслуг.Ссылка
//Евросиб Литвинов) 	
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ИсправляемыеСФ
	|			ПО СчетФактураПолученный.ИсправляемыйСчетФактура = ИсправляемыеСФ.Объект
	|				И (ИсправляемыеСФ.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
	|				И (ИсправляемыеСФ.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ДокументыОснованияСФ
	|			ПО СчетФактураПолученный.ДокументОснование = ДокументыОснованияСФ.Объект
	|				И (ДокументыОснованияСФ.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	|				И (ДокументыОснованияСФ.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК СФВыданныеПокупателю
	|			ПО СчетФактураПолученный.СчетФактураВыданныйПокупателю = СФВыданныеПокупателю.Объект
	|				И (СФВыданныеПокупателю.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	|				И (СФВыданныеПокупателю.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Контрагенты
	|			ПО СчетФактураПолученный.Контрагент = Контрагенты.Объект
	|				И (Контрагенты.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|				И (Контрагенты.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ДоговорыКонтрагентов
	|			ПО СчетФактураПолученный.ДоговорКонтрагента = ДоговорыКонтрагентов.Объект
	|				И (ДоговорыКонтрагентов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (ДоговорыКонтрагентов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Продавцы
	|			ПО СчетФактураПолученный.Продавец = Продавцы.Объект
	|				И (Продавцы.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|				И (Продавцы.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Комитенты
	|			ПО СчетФактураПолученный.Комитент = Комитенты.Объект
	|				И (Комитенты.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|				И (Комитенты.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ДоговорыКомитентов
	|			ПО СчетФактураПолученный.ДоговорКомитента = ДоговорыКомитентов.Объект
	|				И (ДоговорыКомитентов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|				И (ДоговорыКомитентов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|		ПО СсылкиНаДокументы.Ссылка = СчетФактураПолученный.Ссылка";	
#КонецОбласти 	

	Запрос.УстановитьПараметр("СсылкиНаДокументы", СсылкиНаДокументы);
	
	Результат = Запрос.Выполнить();		
	Шапки = Результат.Выгрузить(); 
	
	ПередаваемаяСтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(Шапки); 
	
	Возврат ПередаваемаяСтрокаXML;		

КонецФункции // ПолучитьДанныеПоСчетам(XMLParams)

Функция ПередатьСписокАкцептов(XMLParams) Экспорт
	
	Параметры = ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	Данные = ПолучитьДанныеЧерезМакетСКД("СписокАкцептов1", Параметры, "УИДКонтрагента, УИДДоговора");
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(ОбщегоНазначения.ТаблицаЗначенийВМассив(Данные));
	
КонецФункции

Функция ПередатьДанныеПоАкцептам(XMLParams) Экспорт
	
	ГУИДДокументов =  ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	СсылкиНаДокументы = Новый ТаблицаЗначений;
	СсылкиНаДокументы.Колонки.Добавить("ГУИД",Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	СсылкиНаДокументы.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.Акцепт"));
	СсылкиНаДокументы.Колонки.Добавить("ГУИД_ПТУ", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	СсылкиНаДокументы.Колонки.Добавить("ГУИД_СторнируемогоАкцепта", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	
	Для Каждого СтрокаГУИД Из ГУИДДокументов Цикл
		Строка = СсылкиНаДокументы.Добавить();
		Строка.ГУИД = СтрокаГУИД;
		Строка.Ссылка = Документы.Акцепт.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.ГУИД));
		Строка.ГУИД_ПТУ = Строка.Ссылка.Поступление.УникальныйИдентификатор();
 		Строка.ГУИД_СторнируемогоАкцепта = ?(ЗначениеЗаполнено(Строка.Ссылка.СторнируемыйАкцепт), Строка.Ссылка.СторнируемыйАкцепт.УникальныйИдентификатор(), "");
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	СсылкиНаДокументы.ГУИД_ПТУ КАК ГУИД_ПТУ,
	|	СсылкиНаДокументы.Ссылка КАК Ссылка,
	|	СсылкиНаДокументы.ГУИД_СторнируемогоАкцепта КАК ГУИД_СторнируемогоАкцепта
	|ПОМЕСТИТЬ СсылкиНаДокументы
	|ИЗ
	|	&СсылкиНаДокументы КАК СсылкиНаДокументы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Акцепт.Организация.Код КАК ОрганизацияКод,
	|	ПротоколОбменовКонтрагенты.УИДИсточника КАК КонтрагентУИД,
	|	Акцепт.Поступление.НомерВходящегоДокумента КАК НомерВСФ,
	|	ВЫБОР
	|		КОГДА Акцепт.Поступление.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.РЖД)
	|			ТОГДА СчетФактураПолученный.ДатаВходящегоДокумента
	|		ИНАЧЕ Акцепт.Поступление.ДатаВходящегоДокумента
	|	КОНЕЦ КАК ДатаВСФ,
	|	Акцепт.ПометкаУдаления КАК ПометкаУдаления,
	|	Акцепт.Поступление.ВалютаДокумента.Код КАК ВалютаКод,
	|	Акцепт.СуммаАкцепта КАК СуммаАкцепта,
	|	Акцепт.Дата КАК ДатаАкцепта,
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	СсылкиНаДокументы.ГУИД_ПТУ КАК ГУИД_ПТУ,
	|	СсылкиНаДокументы.ГУИД_СторнируемогоАкцепта КАК СторнируемыйАкцепт,
	|	Акцепт.Поступление.ДатаВходящегоДокумента КАК Дата,
	|	Акцепт.Поступление.Штраф КАК Штраф,
	//Евросиб Дубская 08.11.2023 ( Ticket#0330957
	|	ВЫБОР
	|		КОГДА Акцепт.Поступление ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(Акцепт.Поступление КАК Документ.ПоступлениеТоваровУслуг).Претензия
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Претензия,    
	//Евросиб Дубская 08.11.2023 )
	|	Акцепт.Номер КАК Номер
	|ИЗ
	|	Документ.Акцепт КАК Акцепт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ПО (СсылкиНаДокументы.Ссылка = Акцепт.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменовКонтрагенты
	|		ПО Акцепт.Поступление.Контрагент = ПротоколОбменовКонтрагенты.Объект
	|			И (ПротоколОбменовКонтрагенты.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|			И (ПротоколОбменовКонтрагенты.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|		ПО (Акцепт.Поступление = СчетФактураПолученный.ДокументОснование)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	ПротоколОбменовНоменклатура.УИДИсточника КАК НоменклатураУИД, 
//Евросиб Дубская( 28.04.2022 Ticket№50512
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(АкцептУслуги.НоменклатураСделки) КАК НоменклатураНаименование, 
// Евросиб Дубская)  
//Евросиб Дубская( 17.07.2022 TASK 72316
	|	АкцептУслуги.РасходыЗаСчетЧП КАК РасходыЗаСчетЧП, 
// Евросиб Дубская)
	|	АкцептУслуги.НоменклатурнаяГруппа.Код КАК НоменклатурнаяГруппаКод,
	|	АкцептУслуги.ПоступлениеСтавкаНДС КАК СтавкаНДС,
	|	АкцептУслуги.НоменклатураСделки.КатегорияРасходов.Код КАК СтатьяЗатратКод,
	|	АкцептУслуги.Сделка.ЦФО.Код КАК ПодразделениеКод,
	|	АкцептУслуги.Сделка.Подразделение.Код КАК ПодразделениеОрганизацииКод,
	|	ВЫБОР
	|		КОГДА АкцептУслуги.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходов.Возмещаемые)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Возмещаемые,
	|	СУММА(АкцептУслуги.Сумма) КАК Сумма,
	|	СУММА(АкцептУслуги.СуммаНДС) КАК СуммаНДС,
	|	СУММА(АкцептУслуги.СуммаПретензии) КАК СуммаПретензии,
	|	ПротоколОбменовКлиент.УИДИсточника КАК УИДКлиента,
//Евросиб Гудкова( 01.03.2022 Ticket№ 0234066
	|	АкцептУслуги.УчДокумент.ДатаДокумента как ДатаИСФ,
// Евросиб Гудкова)
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(АкцептУслуги.УчДокумент) КАК УчДокумент,
	|	ПротоколОбменовИСФ.УИДИсточника КАК УИДУчДокумента,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА АкцептУслуги.Ссылка.Поступление.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.РЖД)
	|					ТОГДА СчетФактураПолученный.ДатаВходящегоДокумента
	|				ИНАЧЕ АкцептУслуги.Ссылка.Поступление.ДатаВходящегоДокумента
	|			КОНЕЦ < ДАТАВРЕМЯ(2021, 1, 1)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(АкцептУслуги.ВидЗатрат)
	|	КОНЕЦ КАК ВидЗатрат   
	//Евросиб(ДИТ), Беляев СЮ, US 88214 / TA 93126, 21-10-2024, начало
	|	,УНИКАЛЬНЫЙИДЕНТИФИКАТОР(АкцептУслуги.УчДокумент) КАК СистемныйИдентификаторУчДокумента
	//Евросиб(ДИТ), Беляев СЮ, US 88214 / TA 93126, 21-10-2024, конец
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Акцепт.Услуги КАК АкцептУслуги
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменовНоменклатура
	|			ПО АкцептУслуги.НоменклатураСделки = ПротоколОбменовНоменклатура.Объект
	|				И (ПротоколОбменовНоменклатура.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	|				И (ПротоколОбменовНоменклатура.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменовИСФ
	|			ПО АкцептУслуги.УчДокумент = ПротоколОбменовИСФ.Объект
	|				И (ПротоколОбменовИСФ.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	|				И (ПротоколОбменовИСФ.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменовКлиент
	|			ПО АкцептУслуги.УчДокумент.Контрагент = ПротоколОбменовКлиент.Объект
	|				И (ПротоколОбменовКлиент.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (ПротоколОбменовКлиент.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|		ПО СсылкиНаДокументы.Ссылка = АкцептУслуги.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|		ПО (АкцептУслуги.Ссылка.Поступление = СчетФактураПолученный.ДокументОснование)
	|ГДЕ
	|	(АкцептУслуги.Сделка <> ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
	|		ИЛИ АкцептУслуги.ПричинаНеакцепта <> ЗНАЧЕНИЕ(Справочник.Претензии.ПустаяСсылка) И АкцептУслуги.СтатусПричины <> ЗНАЧЕНИЕ(Перечисление.СтатусыПричинНеакцепта.Откз))
	|	И ВЫБОР
	|			КОГДА АкцептУслуги.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходов.Возмещаемые)
	|				ТОГДА АкцептУслуги.УчДокумент ССЫЛКА Документ.ОтчетКомитентуОПродажах
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|   И (АкцептУслуги.Сумма <> 0 ИЛИ АкцептУслуги.СуммаПретензии <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	СсылкиНаДокументы.ГУИД,
	|	ПротоколОбменовНоменклатура.УИДИсточника, 
//Евросиб Дубская( 28.04.2022 Ticket№50512
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(АкцептУслуги.НоменклатураСделки), 
// Евросиб Дубская)                  
//Евросиб Дубская( 17.07.2022 TASK 72316
	|	АкцептУслуги.РасходыЗаСчетЧП, 
// Евросиб Дубская)
	|	АкцептУслуги.НоменклатурнаяГруппа.Код,
	|	АкцептУслуги.ПоступлениеСтавкаНДС,
	|	АкцептУслуги.НоменклатураСделки.КатегорияРасходов.Код,
	|	АкцептУслуги.Сделка.ЦФО.Код,
	|	АкцептУслуги.Сделка.Подразделение.Код,
	|	ВЫБОР
	|		КОГДА АкцептУслуги.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходов.Возмещаемые)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ПротоколОбменовИСФ.УИДИсточника,
	|	ПротоколОбменовКлиент.УИДИсточника,
//Евросиб Гудкова( 01.03.2022 Ticket№ 0234066
	|	АкцептУслуги.УчДокумент.ДатаДокумента,
// Евросиб Гудкова)
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(АкцептУслуги.УчДокумент),
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА АкцептУслуги.Ссылка.Поступление.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.РЖД)
	|					ТОГДА СчетФактураПолученный.ДатаВходящегоДокумента
	|				ИНАЧЕ АкцептУслуги.Ссылка.Поступление.ДатаВходящегоДокумента
	|			КОНЕЦ < ДАТАВРЕМЯ(2021, 1, 1)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(АкцептУслуги.ВидЗатрат)
	|	КОНЕЦ
	//Евросиб(ДИТ), Беляев СЮ, US 88214 / TA 93126, 21-10-2024, начало
	|	,УНИКАЛЬНЫЙИДЕНТИФИКАТОР(АкцептУслуги.УчДокумент)";
	//Евросиб(ДИТ), Беляев СЮ, US 88214 / TA 93126, 21-10-2024, конец
	
	Запрос.УстановитьПараметр("СсылкиНаДокументы", СсылкиНаДокументы);
	
	Результаты = Запрос.ВыполнитьПакет();		
	Шапки = Результаты[1].Выгрузить(); 
	ТЧУслуги = Результаты[2].Выгрузить();
	
	СтруктураШапкиИТЧУслуги = Новый Структура;
	СтруктураШапкиИТЧУслуги.Вставить("Шапки", Шапки);
	СтруктураШапкиИТЧУслуги.Вставить("ТЧУслуги", ТЧУслуги);	
	
	ПередаваемаяСтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(СтруктураШапкиИТЧУслуги); 
	
	Возврат ПередаваемаяСтрокаXML;		
	
КонецФункции

Функция ПередатьДанныеПоИСФ(XMLParams) Экспорт

	ГУИДДокументов =  ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	СсылкиНаДокументы = Новый ТаблицаЗначений;
	СсылкиНаДокументы.Колонки.Добавить("ГУИД",Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	СсылкиНаДокументы.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг"));
	
	Для Каждого СтрокаГУИД Из ГУИДДокументов Цикл
		Строка = СсылкиНаДокументы.Добавить();
		Строка.ГУИД = СтрокаГУИД;
		Строка.Ссылка = Документы.РеализацияТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.ГУИД));
	КонецЦикла;
	
#Область Запрос
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	СсылкиНаДокументы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СсылкиНаДокументы
	|ИЗ
	|	&СсылкиНаДокументы КАК СсылкиНаДокументы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//Евросиб СубботинВ #84453 02.07.2024 Начало //Поменял запрос на работу только с ТЧ СчетаНаОплатуПокупателям 
	//|ВЫБРАТЬ
	//|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	//|	Контрагенты.УИДИсточника КАК УИДКонтрагента,
	//|	ДоговорыКонтрагентов.УИДИсточника КАК УИДДоговораКонтрагента,
	//|	ПОДСТРОКА(РеализацияТоваровУслуг.Комментарий, 1, 1000) КАК Комментарий,
	//|	РеализацияТоваровУслуг.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	//|	РеализацияТоваровУслуг.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	//|	ПРЕДСТАВЛЕНИЕ(РеализацияТоваровУслуг.Ответственный) КАК ОтветственныйНаименование,
	//|	РеализацияТоваровУслуг.СуммаВключаетНДС КАК СуммаВключаетНДС,
	//|	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
	//|	РеализацияТоваровУслуг.УчитыватьНДС КАК УчитыватьНДС,
	//|	ПРЕДСТАВЛЕНИЕ(РеализацияТоваровУслуг.Автор) КАК АвторНаименование,
	//|	Грузополучатели.УИДИсточника КАК УИДГрузополучателя,
	//|	ПоставщикиВУ.УИДИсточника КАК УИДПоставщикаВУ,
	//|	ПокупателиВУ.УИДИсточника КАК УИДПокупателяВУ,
	//|	ЛОЖЬ КАК ЭЦП,
	//|	ВЫБОР
	//|		КОГДА РеализацияТоваровУслуг.ДатаДокумента = ДАТАВРЕМЯ(1, 1, 1)
	//|			ТОГДА РеализацияТоваровУслуг.Дата
	//|		ИНАЧЕ РеализацияТоваровУслуг.ДатаДокумента
	//|	КОНЕЦ КАК ДатаАкта,
	//|	ВЫБОР
	//|		КОГДА РеализацияТоваровУслуг.НомерДляПечати = """"
	//|			ТОГДА РеализацияТоваровУслуг.Номер
	//|		ИНАЧЕ РеализацияТоваровУслуг.НомерДляПечати
	//|	КОНЕЦ КАК НомерАкта,
	//|	РеализацияТоваровУслуг.Организация.Код КАК ОрганизацияКод,
	//|	РеализацияТоваровУслуг.ПодразделениеОрганизации.Код КАК ПодразделениеОрганизацииКод,
	//|	РеализацияТоваровУслуг.ЦФО.Код КАК ЦФОКод,
	//|	РеализацияТоваровУслуг.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	//|	ВЫБОР
	//|		КОГДА СчетФактураВыданный.ДатаДокумента = ДАТАВРЕМЯ(1, 1, 1)
	//|			ТОГДА СчетФактураВыданный.Дата
	//|		ИНАЧЕ СчетФактураВыданный.ДатаДокумента
	//|	КОНЕЦ КАК ДатаИСФ,
	//|	ВЫБОР
	//|		КОГДА СчетФактураВыданный.НомерДляПечати = """"
	//|			ТОГДА СчетФактураВыданный.Номер
	//|		ИНАЧЕ СчетФактураВыданный.НомерДляПечати
	//|	КОНЕЦ КАК НомерИСФ,
	//|	ВЫБОР
	//|		КОГДА СчетНаОплату.НомерДляПечати = """"
	//|			ТОГДА СчетНаОплату.Номер
	//|		ИНАЧЕ СчетНаОплату.НомерДляПечати
	//|	КОНЕЦ КАК НомерСчета,
	//|	ВЫБОР
	//|		КОГДА СчетНаОплату.ДатаДокумента = ДАТАВРЕМЯ(1, 1, 1)
	//|			ТОГДА СчетНаОплату.Дата
	//|		ИНАЧЕ СчетНаОплату.ДатаДокумента
	//|	КОНЕЦ КАК ДатаСчета,
	////Евросиб Литвинов ( 30.12.21 #44592 Ticket#0254477 #44587 
	//|	РеализацияТоваровУслуг.ДатаСоставления КАК ДатаСоставления,
	////Евросиб Литвинов)
	////ДИТ Шевченко А.В. US 59973 ТА 71435 29.08.2023
	//|	РеализацияТоваровУслуг.Субсидии КАК Субсидии,
	////ДИТ Шевченко А.В. US 59973 ТА 71435 29.08.2023 
	////ДИТ Шевченко А.В. US 59973 ТА 71435 29.08.2023
	//|	РеализацияТоваровУслуг.Дата КАК ДатаДК
	////ДИТ Шевченко А.В. US 59973 ТА 71435 29.08.2023
	//|ИЗ
	//|	СсылкиНаДокументы КАК СсылкиНаДокументы
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	//|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	//|			ПО РеализацияТоваровУслуг.Ссылка = СчетФактураВыданный.ДокументОснование
	//|				И (СчетФактураВыданный.Проведен)
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Контрагенты
	//|			ПО РеализацияТоваровУслуг.Контрагент = Контрагенты.Объект
	//|				И (Контрагенты.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	//|				И (Контрагенты.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ДоговорыКонтрагентов
	//|			ПО РеализацияТоваровУслуг.ДоговорКонтрагента = ДоговорыКонтрагентов.Объект
	//|				И (ДоговорыКонтрагентов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	//|				И (ДоговорыКонтрагентов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Грузополучатели
	//|			ПО РеализацияТоваровУслуг.Грузополучатель = Грузополучатели.Объект
	//|				И (Грузополучатели.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	//|				И (Грузополучатели.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПоставщикиВУ
	//|			ПО РеализацияТоваровУслуг.ПоставщикВУ = ПоставщикиВУ.Объект
	//|				И (ПоставщикиВУ.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	//|				И (ПоставщикиВУ.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПокупателиВУ
	//|			ПО РеализацияТоваровУслуг.ПокупательВУ = ПокупателиВУ.Объект
	//|				И (ПокупателиВУ.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	//|				И (ПокупателиВУ.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	//|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК СчетНаОплату
	//|			ПО РеализацияТоваровУслуг.УдалитьСчетНаОплатуПокупателю = СчетНаОплату.Ссылка 
	//|				И (СчетНаОплату.Проведен)
	//|		ПО СсылкиНаДокументы.Ссылка = РеализацияТоваровУслуг.Ссылка
	//|;
	//|	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	Контрагенты.УИДИсточника КАК УИДКонтрагента,
	|	ДоговорыКонтрагентов.УИДИсточника КАК УИДДоговораКонтрагента,
	|	ПОДСТРОКА(РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.Комментарий, 1, 1000) КАК Комментарий,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ПРЕДСТАВЛЕНИЕ(РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.Ответственный) КАК ОтветственныйНаименование,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.СуммаДокумента КАК СуммаДокумента,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.УчитыватьНДС КАК УчитыватьНДС,
	|	ПРЕДСТАВЛЕНИЕ(РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.Автор) КАК АвторНаименование,
	|	Грузополучатели.УИДИсточника КАК УИДГрузополучателя,
	|	ПоставщикиВУ.УИДИсточника КАК УИДПоставщикаВУ,
	|	ПокупателиВУ.УИДИсточника КАК УИДПокупателяВУ,
	|	ЛОЖЬ КАК ЭЦП,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.ДатаДокумента = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.Дата
	|		ИНАЧЕ РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.ДатаДокумента
	|	КОНЕЦ КАК ДатаАкта,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.НомерДляПечати = """"
	|			ТОГДА РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.Номер
	|		ИНАЧЕ РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.НомерДляПечати
	|	КОНЕЦ КАК НомерАкта,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.Организация.Код КАК ОрганизацияКод,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.ПодразделениеОрганизации.Код КАК ПодразделениеОрганизацииКод,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.ЦФО.Код КАК ЦФОКод,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.ДатаДокумента = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА СчетФактураВыданный.Дата
	|		ИНАЧЕ СчетФактураВыданный.ДатаДокумента
	|	КОНЕЦ КАК ДатаИСФ,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.НомерДляПечати = """"
	|			ТОГДА СчетФактураВыданный.Номер
	|		ИНАЧЕ СчетФактураВыданный.НомерДляПечати
	|	КОНЕЦ КАК НомерИСФ,
	|	ВЫБОР
	|		КОГДА СчетНаОплату.НомерДляПечати = """"
	|			ТОГДА СчетНаОплату.Номер
	|		ИНАЧЕ СчетНаОплату.НомерДляПечати
	|	КОНЕЦ КАК НомерСчета,
	|	ВЫБОР
	|		КОГДА СчетНаОплату.ДатаДокумента = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА СчетНаОплату.Дата
	|		ИНАЧЕ СчетНаОплату.ДатаДокумента
	|	КОНЕЦ КАК ДатаСчета,
	//Евросиб Литвинов ( 30.12.21 #44592 Ticket#0254477 #44587 
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.ДатаСоставления КАК ДатаСоставления,
	//Евросиб Литвинов)
	//ДИТ Шевченко А.В. US 59973 ТА 71435 29.08.2023
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.Субсидии КАК Субсидии,
	//ДИТ Шевченко А.В. US 59973 ТА 71435 29.08.2023 
	//ДИТ Шевченко А.В. US 59973 ТА 71435 29.08.2023
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.Дата КАК ДатаДК
	//ДИТ Шевченко А.В. US 59973 ТА 71435 29.08.2023
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.СчетаНаОплатуПокупателям КАК РеализацияТоваровУслугСчетаНаОплатуПокупателям
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|			ПО РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка = СчетФактураВыданный.ДокументОснование
	|				И (СчетФактураВыданный.Проведен)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Контрагенты
	|			ПО РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.Контрагент = Контрагенты.Объект
	|				И (Контрагенты.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (Контрагенты.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ДоговорыКонтрагентов
	|			ПО РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.ДоговорКонтрагента = ДоговорыКонтрагентов.Объект
	|				И (ДоговорыКонтрагентов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (ДоговорыКонтрагентов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Грузополучатели
	|			ПО РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.Грузополучатель = Грузополучатели.Объект
	|				И (Грузополучатели.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (Грузополучатели.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПоставщикиВУ
	|			ПО РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.ПоставщикВУ = ПоставщикиВУ.Объект
	|				И (ПоставщикиВУ.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (ПоставщикиВУ.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПокупателиВУ
	|			ПО РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.ПокупательВУ = ПокупателиВУ.Объект
	|				И (ПокупателиВУ.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (ПокупателиВУ.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК СчетНаОплату
	|			ПО РеализацияТоваровУслугСчетаНаОплатуПокупателям.СчетПокупателю = СчетНаОплату.Ссылка 
	|				И (СчетНаОплату.Проведен)
	|		ПО СсылкиНаДокументы.Ссылка = РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка
	//Евросиб СубботинВ #118244 01.09.2025 Начало 
	|			И РеализацияТоваровУслугСчетаНаОплатуПокупателям.НомерСтроки = 1
    //Евросиб СубботинВ #118244 01.09.2025 Конец 
    |;
	|
    //Евросиб СубботинВ #84453 02.07.2024 Конец 
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	РеализацияТоваровУслугУслуги.НомерСтроки КАК НомерСтроки,
	|	ПОДСТРОКА(РеализацияТоваровУслугУслуги.Содержание, 1, 1000) КАК Содержание,
	|	РеализацияТоваровУслугУслуги.Количество КАК Количество,
	|	РеализацияТоваровУслугУслуги.Цена КАК Цена,
	|	РеализацияТоваровУслугУслуги.Сумма КАК Сумма,
	|	РеализацияТоваровУслугУслуги.СтавкаНДС КАК СтавкаНДС,
	|	РеализацияТоваровУслугУслуги.СуммаНДС КАК СуммаНДС,
	|	ПротоколОбменов.УИДИсточника КАК НоменклатураКод,
	|	РеализацияТоваровУслугУслуги.НоменклатурнаяГруппа.Код КАК НоменклатурнаяГруппаКод
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|			ПО РеализацияТоваровУслугУслуги.Номенклатура = ПротоколОбменов.Объект
	|				И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	|				И (ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
	|		ПО СсылкиНаДокументы.Ссылка = РеализацияТоваровУслугУслуги.Ссылка";
	
#КонецОбласти 	
	Запрос.УстановитьПараметр("СсылкиНаДокументы", СсылкиНаДокументы);
	
	Результаты = Запрос.ВыполнитьПакет();		
	Шапки = Результаты[1].Выгрузить(); 
	ТЧУслуги = Результаты[2].Выгрузить();
//	ТЧАгентскиеУслуги = Результаты[3].Выгрузить();
	
	СтруктураШапкиИТЧУслуги = Новый Структура;
	СтруктураШапкиИТЧУслуги.Вставить("Шапки", Шапки);
	СтруктураШапкиИТЧУслуги.Вставить("ТЧУслуги", ТЧУслуги);
	
	ПередаваемаяСтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(СтруктураШапкиИТЧУслуги); 
	
	Возврат ПередаваемаяСтрокаXML;		

КонецФункции // ПолучитьДанныеПоИСФ(XMLParams)

Функция ПередатьДанныеПоКоррИСФ(XMLParams) Экспорт

	ГУИДДокументов =  ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	СсылкиНаДокументы = Новый ТаблицаЗначений;
	СсылкиНаДокументы.Колонки.Добавить("ГУИД",Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	СсылкиНаДокументы.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.КорректировкаРеализации"));
	
	Для Каждого СтрокаГУИД Из ГУИДДокументов Цикл
		Строка = СсылкиНаДокументы.Добавить();
		Строка.ГУИД = СтрокаГУИД;
		Строка.Ссылка = Документы.КорректировкаРеализации.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.ГУИД));
	КонецЦикла;
#Область Запрос
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	СсылкиНаДокументы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СсылкиНаДокументы
	|ИЗ
	|	&СсылкиНаДокументы КАК СсылкиНаДокументы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	Контрагенты.УИДИсточника КАК УИДКонтрагента,
	|	ДоговорыКонтрагентов.УИДИсточника КАК УИДДоговораКонтрагента,
	|	ПОДСТРОКА(КорректировкаРеализации.Комментарий, 1, 1000) КАК Комментарий,
	|	КорректировкаРеализации.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	КорректировкаРеализации.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ПРЕДСТАВЛЕНИЕ(КорректировкаРеализации.Ответственный) КАК ОтветственныйНаименование,
	|	КорректировкаРеализации.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	КорректировкаРеализации.СуммаДокумента КАК СуммаДокумента,
	|	КорректировкаРеализации.УчитыватьНДС КАК УчитыватьНДС,
	|	ПРЕДСТАВЛЕНИЕ(КорректировкаРеализации.Автор) КАК АвторНаименование,
	|	Грузополучатели.УИДИсточника КАК УИДГрузополучателя,
	|	Грузоотправители.УИДИсточника КАК УИДГрузоотправителя,
	|	ПоставщикиВУ.УИДИсточника КАК УИДПоставщикаВУ,
	|	ПокупателиВУ.УИДИсточника КАК УИДПокупателяВУ,
	|	Продавцы.УИДИсточника КАК УИДПродавца,
	|	ЛОЖЬ КАК ЭЦП,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализации.ДатаДокумента = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА КорректировкаРеализации.Дата
	|		ИНАЧЕ КорректировкаРеализации.ДатаДокумента
	|	КОНЕЦ КАК ДатаАкта,  
	// Евросиб(ДИТ) US 98305 ТА 99114 Сержантова А.С. Начало: 21.01.2025
	|	КорректировкаРеализации.ПериодВО КАК ПериодВО,
	// Евросиб(ДИТ) US 98305 ТА 99114 Сержантова А.С. Конец: 21.01.2025
	|	ВЫБОР
	|		КОГДА КорректировкаРеализации.ДокументРеализации.ДатаДокумента = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА КорректировкаРеализации.ДокументРеализации.Дата
	|		ИНАЧЕ КорректировкаРеализации.ДокументРеализации.ДатаДокумента
	|	КОНЕЦ КАК ДатаКорректируемогоАкта,
	|	КорректировкаРеализации.НомерДляПечати КАК НомерАкта,
	|	КорректировкаРеализации.Организация.Код КАК ОрганизацияКод,
	|	КорректировкаРеализации.ПодразделениеОрганизации.Код КАК ПодразделениеОрганизацииКод,
	|	КорректировкаРеализации.ЦФО.Код КАК ЦФОКод,
	|	КорректировкаРеализации.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.ДатаДокумента = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА СчетФактураВыданный.Дата
	|		ИНАЧЕ СчетФактураВыданный.ДатаДокумента
	|	КОНЕЦ КАК ДатаИСФ,
	|	СчетФактураВыданный.НомерДляПечати КАК НомерИСФ,
	|	СчетНаОплатуДокументыОснования.Ссылка.НомерДляПечати КАК НомерСчета,
	|	ВЫБОР
	|		КОГДА СчетНаОплатуДокументыОснования.Ссылка.ДатаДокумента = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА СчетНаОплатуДокументыОснования.Ссылка.Дата
	|		ИНАЧЕ СчетНаОплатуДокументыОснования.Ссылка.ДатаДокумента
	|	КОНЕЦ КАК ДатаСчета,
	|	КорректировкаРеализации.БанковскийСчетОрганизации.НомерСчета КАК БанковскийСчетОрганизацииНомерСчета,
	|	КорректировкаРеализации.ВидОперации КАК ВидОперации,
	|	ДокументыРеализации.УИДИсточника КАК ГУИДДокументаРеализации,
	|	ИсправляемыеДокументыРеализации.УИДИсточника КАК ГУИДИсправляемогоДокументаРеализации,
	|	КорректировкаРеализации.СуммаНДСДокумента КАК СуммаНДСДокумента,
	|	КорректировкаРеализации.КорректировкаОтчетаКомитенту КАК КорректировкаОтчетаКомитенту,
	|	СчетФактураВыданный.ДатаИсправляемогоКорректировочногоДокумента КАК ДатаИсправляемогоКорректировочногоДокумента,
	|	СчетФактураВыданный.ДатаИсходногоДокумента КАК ДатаИсходногоДокумента,
	|	СчетФактураВыданный.Исправление КАК Исправление,
	|	СчетФактураВыданный.НомерИсправления КАК НомерИсправления,
	|	СчетФактураВыданный.НомерИсправляемогоКорректировочногоДокумента КАК НомерИсправляемогоКорректировочногоДокумента,
	|	СчетФактураВыданный.НомерИсходногоДокумента КАК НомерИсходногоДокумента,
	|	СчетФактураВыданный.ВидСчетаФактуры КАК ВидСчетаФактуры,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(КорректировкаРеализации.ДокументРеализации) = ТИП(Документ.РеализацияТоваровУслуг)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ КорректировкаРеализации.ЭтоИзменениеВознаграждения
	|	КОНЕЦ КАК ЭтоИзменениеВознаграждения,   
	// Евросиб(ДИТ) US 96950 ТА 96980 Сержантова А.С. Начало: 06.12.2024
	|	КорректировкаРеализации.КорректировкаОтчетаКомитенту КАК ЭтоКорректировкаОтчетаКомитенту,
	// Евросиб(ДИТ) US 96950 ТА 96980 Сержантова А.С. Конец: 06.12.2024
	//Евросиб Литвинов ( 30.12.21 #44592 Ticket#0254477 #44587 
	|	КорректировкаРеализации.ДатаСоставления КАК ДатаСоставления,
	//Евросиб Литвинов) 	
	|	ВЫБОР
	|	КОГДА ТИПЗНАЧЕНИЯ(КорректировкаРеализации.ДокументРеализации) = ТИП(Документ.КорректировкаРеализации)
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|КОНЕЦ КАК ЭтоКорректировкаКорРТУ
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|			ПО КорректировкаРеализации.Ссылка = СчетФактураВыданный.ДокументОснование
	|				И (СчетФактураВыданный.Проведен)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Контрагенты
	|			ПО КорректировкаРеализации.Контрагент = Контрагенты.Объект
	|				И (Контрагенты.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (Контрагенты.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ДоговорыКонтрагентов
	|			ПО КорректировкаРеализации.ДоговорКонтрагента = ДоговорыКонтрагентов.Объект
	|				И (ДоговорыКонтрагентов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (ДоговорыКонтрагентов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Грузополучатели
	|			ПО КорректировкаРеализации.Грузополучатель = Грузополучатели.Объект
	|				И (Грузополучатели.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (Грузополучатели.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПоставщикиВУ
	|			ПО (ПоставщикиВУ.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (ПоставщикиВУ.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|				И КорректировкаРеализации.ПоставщикВУ = ПоставщикиВУ.Объект
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПокупателиВУ
	|			ПО (ПокупателиВУ.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (ПокупателиВУ.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|				И КорректировкаРеализации.ПокупательВУ = ПокупателиВУ.Объект
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Продавцы
	|			ПО (Продавцы.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (Продавцы.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|				И КорректировкаРеализации.Продавец = Продавцы.Объект
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуДокументыОснования
	|			ПО (СчетНаОплатуДокументыОснования.Ссылка.Проведен)
	|				И КорректировкаРеализации.Ссылка = СчетНаОплатуДокументыОснования.Документ
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Грузоотправители
	|			ПО КорректировкаРеализации.Грузоотправитель = Грузоотправители.Объект
	|				И (Грузоотправители.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (Грузоотправители.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ИсправляемыеДокументыРеализации
	|			ПО (ВЫБОР
	|					КОГДА КорректировкаРеализации.КорректировкаОтчетаКомитенту
	|							И КорректировкаРеализации.ИсправляемыйДокументРеализации ССЫЛКА Документ.СчетФактураВыданный
	|						ТОГДА КорректировкаРеализации.ИсправляемыйДокументРеализации.ДокументОснование
	|					ИНАЧЕ КорректировкаРеализации.ИсправляемыйДокументРеализации
	|				КОНЕЦ = ИсправляемыеДокументыРеализации.Объект)
	|				И (ИсправляемыеДокументыРеализации.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
	|				И (ИсправляемыеДокументыРеализации.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	|		ПО СсылкиНаДокументы.Ссылка = КорректировкаРеализации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ДокументыРеализации
	|		ПО (ВЫБОР
	|				КОГДА КорректировкаРеализации.КорректировкаОтчетаКомитенту
	|						И КорректировкаРеализации.ДокументРеализации ССЫЛКА Документ.СчетФактураВыданный
	|					ТОГДА КорректировкаРеализации.ДокументРеализации.ДокументОснование
	|				ИНАЧЕ КорректировкаРеализации.ДокументРеализации
	|			КОНЕЦ = ДокументыРеализации.Объект)
	|			И (ДокументыРеализации.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
	|			И (ДокументыРеализации.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	КорректировкаРеализацииУслуги.НомерСтроки КАК НомерСтроки,
	|	ПОДСТРОКА(КорректировкаРеализацииУслуги.Содержание, 1, 1000) КАК Содержание,
	|	КорректировкаРеализацииУслуги.Количество КАК Количество,
	|	КорректировкаРеализацииУслуги.Цена КАК Цена,
	|	ВЫБОР
	|		КОГДА НЕ КорректировкаРеализацииУслуги.Ссылка.ДокументРеализации.СуммаВключаетНДС
	|				И КорректировкаРеализацииУслуги.Ссылка.СуммаВключаетНДС
	|			ТОГДА КорректировкаРеализацииУслуги.Сумма - КорректировкаРеализацииУслуги.СуммаНДС
	|		КОГДА КорректировкаРеализацииУслуги.Ссылка.ДокументРеализации.СуммаВключаетНДС
	|				И НЕ КорректировкаРеализацииУслуги.Ссылка.СуммаВключаетНДС
	|			ТОГДА КорректировкаРеализацииУслуги.Сумма + КорректировкаРеализацииУслуги.СуммаНДС
	|		ИНАЧЕ КорректировкаРеализацииУслуги.Сумма
	|	КОНЕЦ КАК Сумма,
	|	КорректировкаРеализацииУслуги.СтавкаНДС КАК СтавкаНДС,
	|	КорректировкаРеализацииУслуги.СуммаНДС КАК СуммаНДС,
	|	ПОДСТРОКА(КорректировкаРеализацииУслуги.СодержаниеДоИзменения, 1, 1000) КАК СодержаниеДоИзменения,
	|	КорректировкаРеализацииУслуги.КоличествоДоИзменения КАК КоличествоДоИзменения,
	|	КорректировкаРеализацииУслуги.ЦенаДоИзменения КАК ЦенаДоИзменения,
	|	КорректировкаРеализацииУслуги.СуммаДоИзменения КАК СуммаДоИзменения,
	|	КорректировкаРеализацииУслуги.СуммаНДСДоИзменения КАК СуммаНДСДоИзменения,
	|	КорректировкаРеализацииУслуги.СтавкаНДСДоИзменения КАК СтавкаНДСДоИзменения,
	|	КорректировкаРеализацииУслуги.КоличествоДоКорректировки КАК КоличествоДоКорректировки,
	|	КорректировкаРеализацииУслуги.ЦенаДоКорректировки КАК ЦенаДоКорректировки,
	|	КорректировкаРеализацииУслуги.СуммаДоКорректировки КАК СуммаДоКорректировки,
	|	КорректировкаРеализацииУслуги.СуммаНДСДоКорректировки КАК СуммаНДСДоКорректировки,
	|	КорректировкаРеализацииУслуги.ЕстьВДокументеРеализации КАК ЕстьВДокументеРеализации,
	|	ПротоколОбменов.УИДИсточника КАК НоменклатураКод
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Услуги КАК КорректировкаРеализацииУслуги
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|			ПО КорректировкаРеализацииУслуги.Номенклатура = ПротоколОбменов.Объект
	|				И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	|				И (ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
	|		ПО СсылкиНаДокументы.Ссылка = КорректировкаРеализацииУслуги.Ссылка 
	// ДИТ US  83997 ТА 83999  Сержантова А.С. Начало: 16.04.2024 - тест (выгрузка кор реализации по отчету комитенту)
	|ГДЕ
	|	не КорректировкаРеализацииУслуги.Ссылка.КорректировкаОтчетаКомитенту	
	// ДИТ US  83997 ТА 83999  Сержантова А.С. Конец: 16.04.2024
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 
	|ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	КорректировкаРеализацииАгентскиеУслуги.НомерСтроки КАК НомерСтроки,
	|	КорректировкаРеализацииАгентскиеУслуги.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	ПротоколОбменов.УИДИсточника КАК НоменклатураКод,
	|	ПОДСТРОКА(КорректировкаРеализацииАгентскиеУслуги.Содержание, 1, 1000) КАК Содержание,
	|	КорректировкаРеализацииАгентскиеУслуги.Количество КАК Количество,
	|	КорректировкаРеализацииАгентскиеУслуги.Цена КАК Цена,
	|	КорректировкаРеализацииАгентскиеУслуги.Сумма КАК Сумма,
	|	КорректировкаРеализацииАгентскиеУслуги.СтавкаНДС КАК СтавкаНДС,
	|	КорректировкаРеализацииАгентскиеУслуги.СуммаНДС КАК СуммаНДС,
	|	Контрагенты.УИДИсточника КАК УИДПодрядчика,
	|	КорректировкаРеализацииАгентскиеУслуги.СодержаниеДоИзменения КАК СодержаниеДоИзменения,
	|	КорректировкаРеализацииАгентскиеУслуги.КоличествоДоКорректировки КАК КоличествоДоКорректировки,
	|	КорректировкаРеализацииАгентскиеУслуги.КоличествоДоИзменения КАК КоличествоДоИзменения,
	|	КорректировкаРеализацииАгентскиеУслуги.ЦенаДоКорректировки КАК ЦенаДоКорректировки,
	|	КорректировкаРеализацииАгентскиеУслуги.ЦенаДоИзменения КАК ЦенаДоИзменения,
	|	КорректировкаРеализацииАгентскиеУслуги.СуммаДоКорректировки КАК СуммаДоКорректировки,
	|	КорректировкаРеализацииАгентскиеУслуги.СуммаДоИзменения КАК СуммаДоИзменения,
	|	КорректировкаРеализацииАгентскиеУслуги.СтавкаНДСДоИзменения КАК СтавкаНДСДоИзменения,
	|	КорректировкаРеализацииАгентскиеУслуги.СуммаНДСДоКорректировки КАК СуммаНДСДоКорректировки,
	|	КорректировкаРеализацииАгентскиеУслуги.СуммаНДСДоИзменения КАК СуммаНДСДоИзменения,  
	// Евросиб(ДИТ) US 96950 ТА 96980 Сержантова А.С. Начало: 06.12.2024
	|	NULL КАК НомерВСФ,
	|	NULL КАК ДатаВСФ,  
	|	NULL КАК УИДВСФ, 
	// Евросиб(ДИТ) US 96950 ТА 96980 Сержантова А.С. Конец: 06.12.2024
	|	КорректировкаРеализацииАгентскиеУслуги.ЕстьВДокументеРеализации КАК ЕстьВДокументеРеализации
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.АгентскиеУслуги КАК КорректировкаРеализацииАгентскиеУслуги
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Контрагенты
	|			ПО КорректировкаРеализацииАгентскиеУслуги.Контрагент = Контрагенты.Объект
	|				И (Контрагенты.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (Контрагенты.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|			ПО КорректировкаРеализацииАгентскиеУслуги.Номенклатура = ПротоколОбменов.Объект
	|				И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	|				И (ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
	|		ПО СсылкиНаДокументы.Ссылка = КорректировкаРеализацииАгентскиеУслуги.Ссылка
	// ДИТ US  83997 ТА 83999 Сержантова А.С. Начало: 16.04.2024 - тест (выгрузка кор реализации по отчету комитенту)
	|
	|Объединить все 
	|
	|ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД,
	|	КорректировкаРеализацииУслуги.НомерСтроки,   
	|	КорректировкаРеализацииУслуги.Номенклатура.Наименование, 
	|   ПротоколОбменов.УИДИсточника,      
	|	ПОДСТРОКА(КорректировкаРеализацииУслуги.Содержание, 1, 1000),
	|	КорректировкаРеализацииУслуги.Количество,
	|	КорректировкаРеализацииУслуги.Цена,
	|	ВЫБОР
	|		КОГДА НЕ КорректировкаРеализацииУслуги.Ссылка.ДокументРеализации.СуммаВключаетНДС
	|				И КорректировкаРеализацииУслуги.Ссылка.СуммаВключаетНДС
	|			ТОГДА КорректировкаРеализацииУслуги.Сумма - КорректировкаРеализацииУслуги.СуммаНДС
	|		КОГДА КорректировкаРеализацииУслуги.Ссылка.ДокументРеализации.СуммаВключаетНДС
	|				И НЕ КорректировкаРеализацииУслуги.Ссылка.СуммаВключаетНДС
	|			ТОГДА КорректировкаРеализацииУслуги.Сумма + КорректировкаРеализацииУслуги.СуммаНДС
	|		ИНАЧЕ КорректировкаРеализацииУслуги.Сумма
	|	КОНЕЦ,
	|	КорректировкаРеализацииУслуги.СтавкаНДС,
	|	КорректировкаРеализацииУслуги.СуммаНДС,  
	// Евросиб(ДИТ) US 96950 ТА 96980 Сержантова А.С. Начало: 16.12.2024
	// Было:
	//|	Контрагенты.УИДИсточника, 
	//Стало:
	|   Поставщики.УИДИсточника,
	// Евросиб(ДИТ) US 96950 ТА 96980 Сержантова А.С. Конец: 16.12.2024
	|	ПОДСТРОКА(КорректировкаРеализацииУслуги.СодержаниеДоИзменения, 1, 1000),  
	|	КорректировкаРеализацииУслуги.КоличествоДоКорректировки,
	|	КорректировкаРеализацииУслуги.КоличествоДоИзменения,    
	|	КорректировкаРеализацииУслуги.ЦенаДоКорректировки,
	|	КорректировкаРеализацииУслуги.ЦенаДоИзменения, 
	|	КорректировкаРеализацииУслуги.СуммаДоКорректировки,
	|	КорректировкаРеализацииУслуги.СуммаДоИзменения,
	|	КорректировкаРеализацииУслуги.СтавкаНДСДоИзменения,  
	|	КорректировкаРеализацииУслуги.СуммаНДСДоКорректировки,
	|	КорректировкаРеализацииУслуги.СуммаНДСДоИзменения,
	// Евросиб(ДИТ) US 96950 ТА 96980 Сержантова А.С. Начало: 06.12.2024
	|   ОтчетКомитентуОПродажахПоставщики.Партия.НомерВходящегоДокумента,
	|	ОтчетКомитентуОПродажахПоставщики.Партия.ДатаВходящегоДокумента,   
	|	ПротоколОбменовПТУ.УИДИсточника, 
	// Евросиб(ДИТ) US 96950 ТА 96980 Сержантова А.С. Конец: 06.12.2024
	|	КорректировкаРеализацииУслуги.ЕстьВДокументеРеализации
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Услуги КАК КорректировкаРеализацииУслуги
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|			ПО КорректировкаРеализацииУслуги.Номенклатура = ПротоколОбменов.Объект
	|				И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	|				И (ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))   
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Контрагенты
	|			ПО КорректировкаРеализацииУслуги.Ссылка.Контрагент = Контрагенты.Объект
	|				И (Контрагенты.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (Контрагенты.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|		ПО СсылкиНаДокументы.Ссылка = КорректировкаРеализацииУслуги.Ссылка  
	// Евросиб(ДИТ) US 96950 ТА 96980 Сержантова А.С. Начало: 06.12.2024
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.Поставщики КАК ОтчетКомитентуОПродажахПоставщики
	|			ПО (ОтчетКомитентуОПродажахПоставщики.Ссылка = КорректировкаРеализацииУслуги.Ссылка.ИсправляемыйДокументРеализации
	|				И КорректировкаРеализацииУслуги.КлючСтроки = ОтчетКомитентуОПродажахПоставщики.КлючСтроки)  
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Поставщики
	|			ПО ОтчетКомитентуОПродажахПоставщики.Поставщик = Поставщики.Объект
	|				И (Поставщики.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (Поставщики.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменовПТУ
	|		ПО (ОтчетКомитентуОПродажахПоставщики.Партия = ПротоколОбменовПТУ.Объект
	|				И ПротоколОбменовПТУ.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных)
	|				И ПротоколОбменовПТУ.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	// Евросиб(ДИТ) US 96950 ТА 96980 Сержантова А.С. Конец: 06.12.2024
	|ГДЕ
	|	КорректировкаРеализацииУслуги.Ссылка.КорректировкаОтчетаКомитенту";
	// ДИТ US  83997 ТА 83999 Сержантова А.С. Конец: 16.04.2024
	
#КонецОбласти 	
	Запрос.УстановитьПараметр("СсылкиНаДокументы", СсылкиНаДокументы);
	
	Результаты = Запрос.ВыполнитьПакет();		
	Шапки = Результаты[1].Выгрузить(); 
	ТЧУслуги = Результаты[2].Выгрузить();
	ТЧАгентскиеУслуги = Результаты[3].Выгрузить(); 
	
	СтруктураШапкиИТЧУслуги = Новый Структура;
	СтруктураШапкиИТЧУслуги.Вставить("Шапки", Шапки);
	СтруктураШапкиИТЧУслуги.Вставить("ТЧУслуги", ТЧУслуги);	
	СтруктураШапкиИТЧУслуги.Вставить("ТЧАгентскиеУслуги", ТЧАгентскиеУслуги);
	
	ПередаваемаяСтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(СтруктураШапкиИТЧУслуги); 
	
	Возврат ПередаваемаяСтрокаXML;		

КонецФункции // ПолучитьДанныеПоКоррИСФ(XMLParams)

Функция ПередатьДанныеПоОтчетуКомитенту(XMLParams) Экспорт

	ГУИДДокументов =  ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	СсылкиНаДокументы = Новый ТаблицаЗначений;
	СсылкиНаДокументы.Колонки.Добавить("ГУИД",Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	СсылкиНаДокументы.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.ОтчетКомитентуОПродажах"));
	
	Для Каждого СтрокаГУИД Из ГУИДДокументов Цикл
		Строка = СсылкиНаДокументы.Добавить();
		Строка.ГУИД = СтрокаГУИД;
		Строка.Ссылка = Документы.ОтчетКомитентуОПродажах.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.ГУИД));
	КонецЦикла;
	
#Область Запрос
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	СсылкиНаДокументы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СсылкиНаДокументы
	|ИЗ
	|	&СсылкиНаДокументы КАК СсылкиНаДокументы
	|;
	//Евросиб Шевченко А.В. US 112687 TA 126873 26.12.2025
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ОтчетКомитентуОПродажахСчета.Ссылка КАК Ссылка,
	|		ОтчетКомитентуОПродажахСчета.СчетПокупателю КАК СчетПокупателю
	|	ПОМЕСТИТЬ СсылкиНаДокументыСчета
	|	ИЗ
	|		СсылкиНаДокументы КАК СсылкиНаДокументы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.СчетаНаОплатуПокупателям КАК ОтчетКомитентуОПродажахСчета
	|				ПО СсылкиНаДокументы.Ссылка = ОтчетКомитентуОПродажахСчета.Ссылка
	|	;
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		СсылкиНаДокументыСчета.Ссылка КАК Ссылка,
	|		СсылкиНаДокументыСчета.СчетПокупателю КАК СчетНаОплатуПокупателю
	|	ПОМЕСТИТЬ СсылкиНаДокументыСчетаТовары
	|	ИЗ
	|		СсылкиНаДокументыСчета КАК СсылкиНаДокументыСчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.Товары КАК СсылкиНаДокументыСчетаТовары
	|				ПО СсылкиНаДокументыСчета.Ссылка = СсылкиНаДокументыСчетаТовары.Ссылка			
	|	;
	//Евросиб Шевченко А.В. US 112687 TA 126873 26.12.2025
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	Контрагенты.УИДИсточника КАК УИДКонтрагента,
	|	ДоговорыКонтрагентов.УИДИсточника КАК УИДДоговораКонтрагента,
	|	ПОДСТРОКА(ОтчетКомитентуОПродажах.Комментарий, 1, 1000) КАК Комментарий,
	|	ОтчетКомитентуОПродажах.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ОтчетКомитентуОПродажах.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ПРЕДСТАВЛЕНИЕ(ОтчетКомитентуОПродажах.Ответственный) КАК ОтветственныйНаименование,
	|	ОтчетКомитентуОПродажах.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ОтчетКомитентуОПродажах.СуммаДокумента КАК СуммаДокумента,
	|	ОтчетКомитентуОПродажах.УчитыватьНДС КАК УчитыватьНДС,
	|	ПоставщикиВУ.УИДИсточника КАК УИДПоставщикаВУ,
	|	ПокупателиВУ.УИДИсточника КАК УИДПокупателяВУ,
	|	ПРЕДСТАВЛЕНИЕ(ОтчетКомитентуОПродажах.Автор) КАК АвторНаименование,
	|	ЛОЖЬ КАК ЭЦП,
	|	ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажах.ДатаДокумента = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ОтчетКомитентуОПродажах.Дата
	|		ИНАЧЕ ОтчетКомитентуОПродажах.ДатаДокумента
	|	КОНЕЦ КАК ДатаАкта,
//Евросиб Литвинов ( 30.12.21 #44592 Ticket#0254477 #44587 
	|	ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажах.ДатаДокумента = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ОтчетКомитентуОПродажах.Дата
	|		ИНАЧЕ ОтчетКомитентуОПродажах.ДатаДокумента
	|	КОНЕЦ КАК ДатаСоставления,
//Евросиб Литвинов) 	
	|	ОтчетКомитентуОПродажах.НомерДляПечати КАК НомерАкта,
	|	ОтчетКомитентуОПродажах.Организация.Код КАК ОрганизацияКод,
	|	ОтчетКомитентуОПродажах.ПодразделениеОрганизации.Код КАК ПодразделениеОрганизацииКод,
	|	ОтчетКомитентуОПродажах.ЦФО.Код КАК ЦФОКод,
	|	ОтчетКомитентуОПродажах.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданный.ДатаДокумента = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА СчетФактураВыданный.Дата
	|		ИНАЧЕ СчетФактураВыданный.ДатаДокумента
	|	КОНЕЦ КАК ДатаИСФ,
	|	СчетФактураВыданный.НомерДляПечати КАК НомерИСФ,
	|	СчетНаОплату.НомерДляПечати КАК НомерСчета,
	|	ВЫБОР
	|		КОГДА СчетНаОплату.ДатаДокумента = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА СчетНаОплату.Дата
	|		ИНАЧЕ СчетНаОплату.ДатаДокумента
	|	КОНЕЦ КАК ДатаСчета,
	|	ПРЕДСТАВЛЕНИЕ(ОтчетКомитентуОПродажах.СпособРасчетаКомиссионногоВознаграждения) КАК СпособРасчетаКомиссионногоВознагражденияПредставление
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|			ПО ОтчетКомитентуОПродажах.Ссылка = СчетФактураВыданный.ДокументОснование
	|				И (СчетФактураВыданный.Проведен)
	|				И (СчетФактураВыданный.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Контрагенты
	|			ПО ОтчетКомитентуОПродажах.Контрагент = Контрагенты.Объект
	|				И (Контрагенты.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (Контрагенты.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ДоговорыКонтрагентов
	|			ПО ОтчетКомитентуОПродажах.ДоговорКонтрагента = ДоговорыКонтрагентов.Объект
	|				И (ДоговорыКонтрагентов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (ДоговорыКонтрагентов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПоставщикиВУ
	|			ПО ОтчетКомитентуОПродажах.ПоставщикВУ = ПоставщикиВУ.Объект
	|				И (ПоставщикиВУ.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (ПоставщикиВУ.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПокупателиВУ
	|			ПО ОтчетКомитентуОПродажах.ПокупательВУ = ПокупателиВУ.Объект
	|				И (ПокупателиВУ.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|				И (ПокупателиВУ.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК СчетНаОплату
	|			ПО (СчетНаОплату.Проведен)
	|				И ОтчетКомитентуОПродажах.Ссылка = СчетНаОплату.УдалитьДокументОснование
	|				И ОтчетКомитентуОПродажах.СуммаДокумента = СчетНаОплату.СуммаДокумента
	|		ПО СсылкиНаДокументы.Ссылка = ОтчетКомитентуОПродажах.Ссылка
	|ГДЕ
	|	ОтчетКомитентуОПродажах.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОЗакупках)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	ОтчетКомитентуОПродажахТовары.НомерСтроки КАК НомерСтроки,
	|	ПОДСТРОКА(ОтчетКомитентуОПродажахТовары.Содержание, 1, 1000) КАК Содержание,
	|	ОтчетКомитентуОПродажахТовары.Количество КАК Количество,
	|	ОтчетКомитентуОПродажахТовары.Цена КАК Цена,
	|	ОтчетКомитентуОПродажахТовары.Сумма КАК Сумма,
	|	ОтчетКомитентуОПродажахТовары.СтавкаНДС КАК СтавкаНДС,
	|	ОтчетКомитентуОПродажахТовары.СуммаНДС КАК СуммаНДС,
	|	ПТУ.УИДИсточника КАК ГУИДВСФ,
	|	Контрагенты.УИДИсточника КАК УИДПодрядчика,
	|	ПротоколОбменов.УИДИсточника КАК НоменклатураКод,
	|	ОтчетКомитентуОПродажахПоставщики.Партия.НомерВходящегоДокумента КАК НомерВСФ,
	|	ОтчетКомитентуОПродажахПоставщики.Партия.ДатаВходящегоДокумента КАК ДатаВСФ
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.Поставщики КАК ОтчетКомитентуОПродажахПоставщики
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Контрагенты
	|				ПО ОтчетКомитентуОПродажахПоставщики.Поставщик = Контрагенты.Объект
	|					И (Контрагенты.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|					И (Контрагенты.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПТУ
	|				ПО ОтчетКомитентуОПродажахПоставщики.Партия = ПТУ.Объект
	|					И (ПТУ.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
	|					И (ПТУ.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	|			ПО ОтчетКомитентуОПродажахТовары.Ссылка = ОтчетКомитентуОПродажахПоставщики.Ссылка
	|				И ОтчетКомитентуОПродажахТовары.КлючСтроки = ОтчетКомитентуОПродажахПоставщики.КлючСтроки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|			ПО ОтчетКомитентуОПродажахТовары.Номенклатура = ПротоколОбменов.Объект
	|				И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	|				И (ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
	|		ПО СсылкиНаДокументы.Ссылка = ОтчетКомитентуОПродажахТовары.Ссылка
	|;
	|
	//Евросиб Шевченко А.В. US 112687 TA 126873 26.12.2025
	//|//////////////////////////////////////////////////////////////////////////////// 
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	//|	ОтчетКомитентуОПродажахТовары.Ссылка.УслугаПоВознаграждению.НаименованиеПолное КАК Содержание,
	//|	ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВознаграждения КАК Сумма,
	//|	ОтчетКомитентуОПродажахТовары.Ссылка.СтавкаНДСВознаграждения КАК СтавкаНДС,
	//|	ОтчетКомитентуОПродажахТовары.Ссылка.СуммаНДСВознаграждения КАК СуммаНДС,
	//|	СчетФактураВыданный.НомерДляПечати КАК НомерИСФ,
	//|	ВЫБОР
	//|		КОГДА СчетФактураВыданный.ДатаДокумента = ДАТАВРЕМЯ(1, 1, 1)
	//|			ТОГДА СчетФактураВыданный.Дата
	//|		ИНАЧЕ СчетФактураВыданный.ДатаДокумента
	//|	КОНЕЦ КАК ДатаИСФ,
	//|	Счет.НомерДляПечати КАК НомерСчета,
	//|	ВЫБОР
	//|		КОГДА Счет.ДатаДокумента = ДАТАВРЕМЯ(1, 1, 1)
	//|			ТОГДА Счет.Дата
	//|		ИНАЧЕ Счет.ДатаДокумента
	//|	КОНЕЦ КАК ДатаСчета,
	//|	ПротоколОбменов.УИДИсточника КАК НоменклатураКод,
	//|	ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВознагражденияВключаетНДС КАК СуммаВознагражденияВключаетНДС,
	//|	ОтчетКомитентуОПродажахТовары.Ссылка.НомерДляПечатиВознаграждение КАК НомерАкта
	//|ИЗ
	//|	СсылкиНаДокументы КАК СсылкиНаДокументы
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	//|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	//|			ПО ОтчетКомитентуОПродажахТовары.Ссылка = СчетФактураВыданный.ДокументОснование
	//|				И (СчетФактураВыданный.Проведен)
	//|				И (СчетФактураВыданный.Продавец = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	//|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК Счет
	//|			ПО ОтчетКомитентуОПродажахТовары.Ссылка = Счет.УдалитьДокументОснование
	//|				И (ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВознаграждения = ОтчетКомитентуОПродажахТовары.СчетНаОплатуПокупателю.СуммаДокумента)
	//|				И (ОтчетКомитентуОПродажахТовары.Ссылка.СчетНаОплатуПокупателю.Проведен)
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	//|			ПО ОтчетКомитентуОПродажахТовары.Ссылка.УслугаПоВознаграждению = ПротоколОбменов.Объект
	//|				И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	//|				И (ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
	//|		ПО СсылкиНаДокументы.Ссылка = ОтчетКомитентуОПродажахТовары.Ссылка
	//|ГДЕ
	//|	ОтчетКомитентуОПродажахТовары.Ссылка.СпособРасчетаКомиссионногоВознаграждения <> ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается)
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		СсылкиНаДокументы.ГУИД КАК ГУИД,
	|		ВЫРАЗИТЬ(ОтчетКомитентуОПродажахТовары.Ссылка.УслугаПоВознаграждению.НаименованиеПолное КАК СТрока(1000)) КАК Содержание,
	|		ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВознаграждения КАК Сумма,
	|		ОтчетКомитентуОПродажахТовары.Ссылка.СтавкаНДСВознаграждения КАК СтавкаНДС,
	|		ОтчетКомитентуОПродажахТовары.Ссылка.СуммаНДСВознаграждения КАК СуммаНДС,
	|		СчетФактураВыданный.НомерДляПечати КАК НомерИСФ,
	|		ВЫБОР
	|			КОГДА СчетФактураВыданный.ДатаДокумента = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА СчетФактураВыданный.Дата
	|			ИНАЧЕ СчетФактураВыданный.ДатаДокумента
	|		КОНЕЦ КАК ДатаИСФ,
	|		Счет.НомерДляПечати КАК НомерСчета,
	|		ВЫБОР
	|			КОГДА Счет.ДатаДокумента = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Счет.Дата
	|			ИНАЧЕ Счет.ДатаДокумента
	|		КОНЕЦ КАК ДатаСчета,
	|		ПротоколОбменов.УИДИсточника КАК НоменклатураКод,
	|		ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВознагражденияВключаетНДС КАК СуммаВознагражденияВключаетНДС,
	|		ОтчетКомитентуОПродажахТовары.Ссылка.НомерДляПечатиВознаграждение КАК НомерАкта
	|	ИЗ
	|		СсылкиНаДокументы КАК СсылкиНаДокументы
	|			ЛЕВОЕ СОЕДИНЕНИЕ СсылкиНаДокументыСчетаТовары КАК ОтчетКомитентуОПродажахТовары
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|				ПО ОтчетКомитентуОПродажахТовары.Ссылка = СчетФактураВыданный.ДокументОснование
	|					И (СчетФактураВыданный.Проведен)
	|					И (СчетФактураВыданный.Продавец = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК Счет
	|				ПО ОтчетКомитентуОПродажахТовары.Ссылка = Счет.УдалитьДокументОснование
	|					И (ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВознаграждения = ОтчетКомитентуОПродажахТовары.СчетНаОплатуПокупателю.СуммаДокумента)
	|					И (ОтчетКомитентуОПродажахТовары.СчетНаОплатуПокупателю.Проведен)
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|				ПО ОтчетКомитентуОПродажахТовары.Ссылка.УслугаПоВознаграждению = ПротоколОбменов.Объект
	|					И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	|					И (ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
	|			ПО СсылкиНаДокументы.Ссылка = ОтчетКомитентуОПродажахТовары.Ссылка
	|	ГДЕ
	|		ОтчетКомитентуОПродажахТовары.Ссылка.СпособРасчетаКомиссионногоВознаграждения <> ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается)";
	//Евросиб Шевченко А.В. US 112687 TA 126873 26.12.2025
	#КонецОбласти 	
	Запрос.УстановитьПараметр("СсылкиНаДокументы", СсылкиНаДокументы);
	
	Результаты = Запрос.ВыполнитьПакет();
	
	//Евросиб Шевченко А.В. US 112687 TA 126873 26.12.2025
	Шапки = Результаты[3].Выгрузить(); 
	ТЧАгентскиеУслуги = Результаты[4].Выгрузить();
	ТЧКомиссия = Результаты[5].Выгрузить();
	//Евросиб Шевченко А.В. US 112687 TA 126873 26.12.2025
	
	СтруктураШапкиИТЧУслуги = Новый Структура;
	СтруктураШапкиИТЧУслуги.Вставить("Шапки", Шапки);
	СтруктураШапкиИТЧУслуги.Вставить("ТЧАгентскиеУслуги", ТЧАгентскиеУслуги);	
	СтруктураШапкиИТЧУслуги.Вставить("ТЧКомиссия", ТЧКомиссия);	
	
	ПередаваемаяСтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(СтруктураШапкиИТЧУслуги); 
	
	Возврат ПередаваемаяСтрокаXML;		

КонецФункции // ПолучитьДанныеПоИСФ(XMLParams)

Функция ЗаписатьОплаты(XMLParams) Экспорт

	СтруктураДанных =  ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	Организация = Справочники.Организации.НайтиПоКоду(СтруктураДанных.ОрганизацияКод);
	ТЗОплат = СтруктураДанных.ТаблицаОплат;
	ТЗРезультат = Новый ТаблицаЗначений;
	ТЗРезультат.Колонки.Добавить("НомерСтроки");
	ТЗРезультат.Колонки.Добавить("Комментарий");
	ТЗРезультат.Колонки.Добавить("НеобходимоеДействие", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100)));
	Запрос = Новый Запрос;
#Область Запрос
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗОплат.НомерСтроки КАК НомерСтрокиОплаты,
	|	ТЗОплат.ДатаОплаты КАК ДатаОплаты,
	|	ТЗОплат.ДатаРеализации КАК ДатаРеализации,
	|	ТЗОплат.СуммаОплаты КАК СуммаОплаты,
	|	ТЗОплат.УИДДокументаРеализации КАК УИДДокументаРеализации,
	|	ТЗОплат.ВерсияИСФ КАК ВерсияИСФ,
	|	ТЗОплат.УИДПоступленияНаРасчетныйСчет КАК УИДПоступленияНаРасчетныйСчет,
	|	ТЗОплат.ЭтоВР КАК ЭтоВР
	|ПОМЕСТИТЬ ТЗОплат
	|ИЗ
	|	&ТЗОплат КАК ТЗОплат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыРеализацииРИТМ.УИДИсточника КАК УИДИсточника,
	|	ДокументыРеализацииРИТМ.НУИНУ КАК НУИНУ,
	|	ДокументыРеализацииРИТМ.ДействиеПриОбмене КАК ДействиеПриОбмене,
	|	ДокументыРеализацииРИТМ.УзелОбмена КАК УзелОбмена,
	|	ДокументыРеализацииРИТМ.Объект КАК Объект
	|ПОМЕСТИТЬ ДокументыРеализацииРИТМ
	|ИЗ
	|	РегистрСведений.ПротоколОбменов КАК ДокументыРеализацииРИТМ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЗОплат КАК ТЗОплат
	|		ПО ДокументыРеализацииРИТМ.УИДИсточника = ТЗОплат.УИДДокументаРеализации
	|			И (ДокументыРеализацииРИТМ.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|			И (ДокументыРеализацииРИТМ.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.РИТМ))
	|			И ДокументыРеализацииРИТМ.НУИНУ = ТЗОплат.ВерсияИСФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗОплат.НомерСтрокиОплаты КАК НомерСтрокиОплаты,
	|	ДокументыПоступленияДС.Объект КАК ПоступлениеДС,
	//|	ВЫБОР
	//|		КОГДА НАЧАЛОПЕРИОДА(ТЗОплат.ДатаОплаты, МЕСЯЦ) >= ТЗОплат.ДатаРеализации
	//|				И НАЧАЛОПЕРИОДА(ТЗОплат.ДатаОплаты, МЕСЯЦ) >= ЕСТЬNULL(ДокументыРеализации.Объект.ПериодВО, ДокументыРеализацииРИТМ.Объект.ПериодВО)
	//|				И НАЧАЛОПЕРИОДА(ТЗОплат.ДатаОплаты, МЕСЯЦ) >= ЕСТЬNULL(ДокументыПоступленияДС.Объект.ДатаВзаиморасчетов, ДокументыПоступленияДС.Объект.Дата)
	//|			ТОГДА НАЧАЛОПЕРИОДА(ТЗОплат.ДатаОплаты, МЕСЯЦ)
	//|		КОГДА ТЗОплат.ДатаРеализации >= ЕСТЬNULL(ДокументыРеализации.Объект.ПериодВО, ДокументыРеализацииРИТМ.Объект.ПериодВО)
	//|				И ТЗОплат.ДатаРеализации >= ДокументыПоступленияДС.Объект.ДатаВзаиморасчетов
	//|			ТОГДА ТЗОплат.ДатаРеализации
	//|		КОГДА ЕСТЬNULL(ДокументыРеализации.Объект.ПериодВО, ДокументыРеализацииРИТМ.Объект.ПериодВО) >= ДокументыПоступленияДС.Объект.ДатаВзаиморасчетов
	//|			ТОГДА ЕСТЬNULL(ДокументыРеализации.Объект.ПериодВО, ДокументыРеализацииРИТМ.Объект.ПериодВО)
	//|		ИНАЧЕ ЕСТЬNULL(ДокументыПоступленияДС.Объект.ДатаВзаиморасчетов, ДокументыПоступленияДС.Объект.Дата)
	//|	КОНЕЦ КАК ДатаОплаты,
	//Евросиб(ДИТ), Беляев СЮ, BUG 91902 / TA 92400, 02-10-2024, начало
	//Изменена логика определения "Даты оплаты" согласно условиям:
	//Необходимо выбирать максимальную дату из: "ДатаОплаты", "ДатаРеализации", "ПериодВО" в реализации, "ДатаВзаиморасчетов" ("Дата" для КорректировкиДолга)
	//1) Если входящая "ДатаОплаты" 
	//					больше "ДатаРеализации" 
	//					и больше "ПериодВО" в реализации 
	//					и больше "ДатаВзаиморасчетов" ("Дата" для КорректировкиДолга), тогда устанавливаем "ДатаОплаты"
	//2) Если входящая "ДатаРеализации" 
	//					и больше "ПериодВО" в реализации 
	//					и больше "ДатаВзаиморасчетов" ("Дата" для КорректировкиДолга), тогда устанавливаем "ДатаРеализации"
	//3) Если входящая  "ПериодВО" в реализации 
	//					и больше "ДатаВзаиморасчетов" ("Дата" для КорректировкиДолга), тогда устанавливаем "ПериодВО"
	//4) Устанавливаем "ДатаВзаиморасчетов" ("Дата" для КорректировкиДолга), если другие условия не выполнены 
	|	ВЫБОР
	|		КОГДА ТЗОплат.ДатаОплаты >= ТЗОплат.ДатаРеализации
	|				И НАЧАЛОПЕРИОДА(ТЗОплат.ДатаОплаты, МЕСЯЦ) >= ЕСТЬNULL(ДокументыРеализации.Объект.ПериодВО, ДокументыРеализацииРИТМ.Объект.ПериодВО)
	|				И НАЧАЛОПЕРИОДА(ТЗОплат.ДатаОплаты, МЕСЯЦ) >= ЕСТЬNULL(ДокументыПоступленияДС.Объект.ДатаВзаиморасчетов, ДокументыПоступленияДС.Объект.Дата)
	//|			ТОГДА ТЗОплат.ДатаОплаты
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0370271, 15-10-2024, начало (в УПП создают документы будущей датой, некорректно такие данные загружать в ДК)
	|			ТОГДА НАЧАЛОПЕРИОДА(ТЗОплат.ДатаОплаты, МЕСЯЦ)
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0370271, 15-10-2024, конец
	|		КОГДА ТЗОплат.ДатаРеализации >= ЕСТЬNULL(ДокументыРеализации.Объект.ПериодВО, ДокументыРеализацииРИТМ.Объект.ПериодВО)
	|				И ТЗОплат.ДатаРеализации >= ЕСТЬNULL(ДокументыПоступленияДС.Объект.ДатаВзаиморасчетов, ДокументыПоступленияДС.Объект.Дата)
	|			ТОГДА ТЗОплат.ДатаРеализации
	|		КОГДА ЕСТЬNULL(ДокументыРеализации.Объект.ПериодВО, ДокументыРеализацииРИТМ.Объект.ПериодВО) >= ЕСТЬNULL(ДокументыПоступленияДС.Объект.ДатаВзаиморасчетов, ДокументыПоступленияДС.Объект.Дата)
	|			ТОГДА ЕСТЬNULL(ДокументыРеализации.Объект.ПериодВО, ДокументыРеализацииРИТМ.Объект.ПериодВО)
	|		ИНАЧЕ ЕСТЬNULL(ДокументыПоступленияДС.Объект.ДатаВзаиморасчетов, ДокументыПоступленияДС.Объект.Дата)
	|	КОНЕЦ КАК ДатаОплаты,	
	//Евросиб(ДИТ), Беляев СЮ, BUG 91902 / TA 92400, 02-10-2024, конец
	|	ТЗОплат.СуммаОплаты КАК СуммаОплаты,
	|	ТЗОплат.УИДПоступленияНаРасчетныйСчет КАК УИДПоступленияНаРасчетныйСчет,
	|	ТЗОплат.УИДДокументаРеализации КАК УИДДокументаРеализации,
	|	ТЗОплат.ВерсияИСФ КАК ВерсияИСФ,
	|	ЕСТЬNULL(ДокументыРеализации.Объект, ДокументыРеализацииРИТМ.Объект) КАК ДокументРеализации,
	|	ТЗОплат.ДатаРеализации КАК ДатаРеализации,
	|	ТЗОплат.ЭтоВР КАК ЭтоВР
	|ПОМЕСТИТЬ ВТОплатыРеализации
	|ИЗ
	|	ТЗОплат КАК ТЗОплат
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ДокументыРеализацииРИТМ
	|		ПО ТЗОплат.УИДДокументаРеализации = ДокументыРеализацииРИТМ.УИДИсточника
	|			И ТЗОплат.ВерсияИСФ = ДокументыРеализацииРИТМ.НУИНУ
	|			И (ДокументыРеализацииРИТМ.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|			И (ДокументыРеализацииРИТМ.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.РИТМ))
	|			И (ДокументыРеализацииРИТМ.Объект ССЫЛКА Документ.РеализацияТоваровУслуг)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ДокументыПоступленияДС
	|		ПО ТЗОплат.УИДПоступленияНаРасчетныйСчет = ДокументыПоступленияДС.УИДИсточника
	|			И (ДокументыПоступленияДС.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|			И (ДокументыПоступленияДС.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	|			И (ДокументыПоступленияДС.Объект ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет
	|				ИЛИ ДокументыПоступленияДС.Объект ССЫЛКА Документ.КорректировкаДолга)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ДокументыРеализации
	|		ПО ТЗОплат.УИДДокументаРеализации = ДокументыРеализации.УИДИсточника
	|			И ТЗОплат.ВерсияИСФ = ДокументыРеализации.НУИНУ
	|			И (ДокументыРеализации.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
	|			И (ДокументыРеализации.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	|;
	|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ПоступлениеДС КАК ПоступлениеДС,
	|	ВложенныйЗапрос.ДатаОплаты КАК ДатаОплаты,
	|	ВложенныйЗапрос.СуммаОплаты КАК СуммаОплаты,
	|	ВложенныйЗапрос.ДокументРеализации КАК ДокументРеализации,
	|	ВложенныйЗапрос.КорректировкаДолга КАК КорректировкаДолга
	|ПОМЕСТИТЬ ВТКорректировкиДолга
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТОплатыРеализации.ПоступлениеДС КАК ПоступлениеДС,
	|		ВТОплатыРеализации.ДатаОплаты КАК ДатаОплаты,
	//Евросиб Каблов 08.02.2022 ( Ticket#0259323
	//|		ВТОплатыРеализации.СуммаОплаты КАК СуммаОплаты,
	|		КорректировкаДолгаДебиторскаяЗадолженность.Сумма КАК СуммаОплаты,
	//Евросиб Каблов 08.02.2022 )
	|		ВТОплатыРеализации.ДокументРеализации КАК ДокументРеализации,
	|		КорректировкаДолгаДебиторскаяЗадолженность.Ссылка КАК КорректировкаДолга
	|	ИЗ
	|		ВТОплатыРеализации КАК ВТОплатыРеализации
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаДолга.ДебиторскаяЗадолженность КАК КорректировкаДолгаДебиторскаяЗадолженность
	|			ПО ВТОплатыРеализации.ДокументРеализации = КорректировкаДолгаДебиторскаяЗадолженность.Сделка
	|				И ВТОплатыРеализации.ДатаОплаты = КорректировкаДолгаДебиторскаяЗадолженность.Ссылка.Дата
	//|				И ВТОплатыРеализации.СуммаОплаты = КорректировкаДолгаДебиторскаяЗадолженность.Сумма
	|				И (ВТОплатыРеализации.СуммаОплаты = КорректировкаДолгаДебиторскаяЗадолженность.Сумма
	|				ИЛИ ВТОплатыРеализации.СуммаОплаты = -КорректировкаДолгаДебиторскаяЗадолженность.Сумма)
	|				И НЕ КорректировкаДолгаДебиторскаяЗадолженность.Ссылка.ПометкаУдаления) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаДолга.КредиторскаяЗадолженность КАК КорректировкаДолгаКредиторскаяЗадолженность
	|		ПО ВложенныйЗапрос.КорректировкаДолга = КорректировкаДолгаКредиторскаяЗадолженность.Ссылка
	|			И ВложенныйЗапрос.ПоступлениеДС = КорректировкаДолгаКредиторскаяЗадолженность.Сделка
	|			И ВложенныйЗапрос.ДатаОплаты = КорректировкаДолгаКредиторскаяЗадолженность.Ссылка.Дата
	//Евросиб Каблов 08.02.2022 ( Ticket#0259323
	//|			И (ВложенныйЗапрос.СуммаОплаты = КорректировкаДолгаКредиторскаяЗадолженность.Сумма
	//|			ИЛИ ВложенныйЗапрос.СуммаОплаты = -КорректировкаДолгаКредиторскаяЗадолженность.Сумма)
	|			И ВложенныйЗапрос.СуммаОплаты = КорректировкаДолгаКредиторскаяЗадолженность.Сумма
	//Евросиб Каблов 08.02.2022 )
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОплатыРеализации.ДокументРеализации КАК ДокументРеализации,
	|	МАКСИМУМ(РеализацияТоваровУслугУслуги.СтавкаНДС) КАК СтавкаНДС
	|ПОМЕСТИТЬ ВТСтавкиНДСРеализаций
	|ИЗ
	|	ВТОплатыРеализации КАК ВТОплатыРеализации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|		ПО ВТОплатыРеализации.ДокументРеализации = РеализацияТоваровУслугУслуги.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТОплатыРеализации.ДокументРеализации
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеализацияТоваровУслугУслуги.СтавкаНДС) = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОплатыРеализации.НомерСтрокиОплаты КАК НомерСтрокиОплаты,
	|	ОплатыРеализации.ПоступлениеДС КАК ПоступлениеДС,
	|	ОплатыРеализации.ДатаОплаты КАК ДатаОплаты,
	|	ОплатыРеализации.СуммаОплаты КАК СуммаОплаты,
	|	ПоступлениеНаРасчетныйСчетДокументыОплаты.НомерСтроки КАК НомерСтроки,
	|	ОплатыРеализации.УИДПоступленияНаРасчетныйСчет КАК УИДПоступленияНаРасчетныйСчет,
	|	ОплатыРеализации.УИДДокументаРеализации КАК УИДДокументаРеализации,
	|	ОплатыРеализации.ВерсияИСФ КАК ВерсияИСФ,
	|	ОплатыРеализации.ДокументРеализации КАК ДокументРеализации,
	|	ОплатыРеализации.ДатаРеализации КАК ДатаРеализации,
	|	ВТКорректировкиДолга.КорректировкаДолга КАК КорректировкаДолга,
	//Евросиб Каблов 16.12.2020 ( Ticket#0215416 При выгрузке сторно привязки в том же периоде, что и привязка, удалять исходную привязку
	|	ПоступлениеНаРСИсходныеОплаты.НомерСтроки КАК НомерСтрокиСторнируемойОплаты,
	|	ВТКорректировкиДолгаИсходныеОплаты.КорректировкаДолга КАК КорректировкаДолгаСторнируемойОплаты,
	//Евросиб Каблов 16.12.2020 )
	|	ЕСТЬNULL(ПоступлениеНаРасчетныйСчет.Организация, КорректировкаДолга2.Организация) КАК Организация,
	|	ЕСТЬNULL(ПоступлениеНаРасчетныйСчет.ПодразделениеОрганизации, КорректировкаДолга2.ПодразделениеОрганизации) КАК ПодразделениеОрганизации,
	|	ЕСТЬNULL(ПоступлениеНаРасчетныйСчет.СтавкаНДС, КорректировкаДолгаКредиторскаяЗадолженность.СтавкаНДС) КАК СтавкаНДС,
	|	ЕСТЬNULL(ПоступлениеНаРасчетныйСчет.Контрагент, КорректировкаДолга2.КонтрагентКредитор) КАК Контрагент,
	//|	ЕСТЬNULL(ПоступлениеНаРасчетныйСчет.ДоговорКонтрагента, КорректировкаДолгаКредиторскаяЗадолженность.ДоговорКонтрагента) КАК ДоговорКонтрагента,
	|	ОплатыРеализации.ДокументРеализации.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(ПоступлениеНаРасчетныйСчет.ВалютаДокумента, КорректировкаДолга2.ВалютаДокумента) КАК ВалютаДокумента,
	|	ЕСТЬNULL(ПоступлениеНаРасчетныйСчет.Организация.ДатаНачалаВеденияУчета, КорректировкаДолга2.Организация.ДатаНачалаВеденияУчета) КАК ДатаНачалаВеденияУчета,
	|	ПРЕДСТАВЛЕНИЕ(ОплатыРеализации.ДокументРеализации) КАК ДокументРеализацииПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ОплатыРеализации.ПоступлениеДС) КАК ПоступлениеДСПредставление,
	|	ВТСтавкиНДСРеализаций.СтавкаНДС КАК СтавкаНДСРеализации,
	// Евросиб Фролов (12.01.2022 Task№ 45208
	|	ОплатыРеализации.ЭтоВР КАК ЭтоВР
	// Евросиб Фролов)
	|ИЗ
	|	ВТОплатыРеализации КАК ОплатыРеализации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаРасчетныйСчет.ДокументыОплаты КАК ПоступлениеНаРасчетныйСчетДокументыОплаты
	|		ПО ОплатыРеализации.ПоступлениеДС = ПоступлениеНаРасчетныйСчетДокументыОплаты.Ссылка
	|			И ОплатыРеализации.ДокументРеализации = ПоступлениеНаРасчетныйСчетДокументыОплаты.ДокументРеализации
	|			И ОплатыРеализации.СуммаОплаты = ПоступлениеНаРасчетныйСчетДокументыОплаты.СуммаОплаты
	|			И ОплатыРеализации.ДатаОплаты = ПоступлениеНаРасчетныйСчетДокументыОплаты.ДатаОплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКорректировкиДолга КАК ВТКорректировкиДолга
	|		ПО ОплатыРеализации.ПоступлениеДС = ВТКорректировкиДолга.ПоступлениеДС
	|			И ОплатыРеализации.ДокументРеализации = ВТКорректировкиДолга.ДокументРеализации
	|			И ОплатыРеализации.ДатаОплаты = ВТКорректировкиДолга.ДатаОплаты
	|			И ОплатыРеализации.СуммаОплаты = ВТКорректировкиДолга.СуммаОплаты
	//Евросиб Каблов 16.12.2020 ( Ticket#0215416 При выгрузке сторно привязки в том же периоде, что и привязка, удалять исходную привязку
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаРасчетныйСчет.ДокументыОплаты КАК ПоступлениеНаРСИсходныеОплаты
	//Евросиб Каблов 24.08.2021 ( Ticket#0239821
	//|		ПО ОплатыРеализации.СуммаОплаты < 0
	//Евросиб Каблов 24.08.2021 ) 
	|			ПО ОплатыРеализации.ПоступлениеДС = ПоступлениеНаРСИсходныеОплаты.Ссылка
	|			И ОплатыРеализации.ДокументРеализации = ПоступлениеНаРСИсходныеОплаты.ДокументРеализации
	|			И ОплатыРеализации.СуммаОплаты = -ПоступлениеНаРСИсходныеОплаты.СуммаОплаты
	|			И ОплатыРеализации.ДатаОплаты = ПоступлениеНаРСИсходныеОплаты.ДатаОплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКорректировкиДолга КАК ВТКорректировкиДолгаИсходныеОплаты
	//Евросиб Каблов 24.08.2021 ( Ticket#0239821
	//|		ПО ОплатыРеализации.СуммаОплаты < 0
	//Евросиб Каблов 24.08.2021 )
	|			ПО ОплатыРеализации.ПоступлениеДС = ВТКорректировкиДолгаИсходныеОплаты.ПоступлениеДС
	|			И ОплатыРеализации.ДокументРеализации = ВТКорректировкиДолгаИсходныеОплаты.ДокументРеализации
	|			И ОплатыРеализации.ДатаОплаты = ВТКорректировкиДолгаИсходныеОплаты.ДатаОплаты
	|			И ОплатыРеализации.СуммаОплаты = -ВТКорректировкиДолгаИсходныеОплаты.СуммаОплаты
	//Евросиб Каблов 16.12.2020 )
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	|		ПО ОплатыРеализации.ПоступлениеДС = ПоступлениеНаРасчетныйСчет.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаДолга КАК КорректировкаДолга2
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаДолга.КредиторскаяЗадолженность КАК КорректировкаДолгаКредиторскаяЗадолженность
	|			ПО КорректировкаДолга2.Ссылка = КорректировкаДолгаКредиторскаяЗадолженность.Ссылка
	|		ПО ОплатыРеализации.ПоступлениеДС = КорректировкаДолга2.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиНДСРеализаций КАК ВТСтавкиНДСРеализаций
	|		ПО ОплатыРеализации.ДокументРеализации = ВТСтавкиНДСРеализаций.ДокументРеализации
	|ИТОГИ ПО
	|	ПоступлениеДС;
	//Евросиб СубботинВ #92045 14.10.2024 Начало // добавил получение ТЧ в рамках оптимизации
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.НомерСтроки КАК НомерСтроки,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.СчетПокупателю КАК СчетПокупателю,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Номенклатура КАК Номенклатура,
	//Евросиб Каблов 28.11.2025 ( #111016
	//|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Сделка КАК Сделка,
	//Евросиб Каблов 28.11.2025 ) #111016
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Сумма КАК Сумма,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Количество КАК Количество,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Контейнер КАК Контейнер
	|ИЗ
	|	ВТОплатыРеализации КАК ВТОплатыРеализации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.СчетаНаОплатуПокупателям КАК РеализацияТоваровУслугСчетаНаОплатуПокупателям
	|		ПО ВТОплатыРеализации.ДокументРеализации = РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка";
	//Евросиб СубботинВ #92045 14.10.2024 Конец //
#КонецОбласти
//Евросиб Каблов 31.07.2020 )
	Запрос.УстановитьПараметр("ТЗОплат", ТЗОплат);
	Результат = Запрос.ВыполнитьПакет();
	Выборка = Результат[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//Евросиб СубботинВ #92045 14.10.2024 Начало // добавил получение ТЧ в рамках оптимизации
    ВыборкаТЧРТУ = Результат[6].выгрузить();
	//Евросиб СубботинВ #92045 14.10.2024 Конец // добавил получение ТЧ в рамках оптимизации 
	
	СтруктураПараметровОплаты = Новый Структура;
	СтруктураПараметровОплаты.Вставить("КорректировкаДолга");
	СтруктураПараметровОплаты.Вставить("ДатаОплаты");
	СтруктураПараметровОплаты.Вставить("Организация");
	СтруктураПараметровОплаты.Вставить("ПодразделениеОрганизации");
	СтруктураПараметровОплаты.Вставить("ВалютаДокумента");
	СтруктураПараметровОплаты.Вставить("Контрагент");
	СтруктураПараметровОплаты.Вставить("ДоговорКонтрагента");
	СтруктураПараметровОплаты.Вставить("СуммаОплаты");								
	СтруктураПараметровОплаты.Вставить("СтавкаНДС");
	СтруктураПараметровОплаты.Вставить("ДокументРеализации");
	СтруктураПараметровОплаты.Вставить("ДокументРеализацииПредставление");
	СтруктураПараметровОплаты.Вставить("ПоступлениеДС");
	СтруктураПараметровОплаты.Вставить("ПоступлениеДСПредставление");
	
	Пока Выборка.Следующий() Цикл
		Ошибки = "";
		Если ЗначениеЗаполнено(Выборка.ПоступлениеДС) Тогда
			//Евросиб Каблов 31.07.2020 (
			//ПоступлениеДСОбъект = Выборка.ПоступлениеДС.ПолучитьОбъект();
			ПоступлениеДСПроведен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.ПоступлениеДС, "Проведен");
			Если ПоступлениеДСПроведен И ТипЗнч(Выборка.ПоступлениеДС) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
				ПоступлениеДСОбъект = Выборка.ПоступлениеДС.ПолучитьОбъект();
				ТабОплат = ПоступлениеДСОбъект.ДокументыОплаты;		
				ВыборкаСтрока = Выборка.Выбрать();
				Пока ВыборкаСтрока.Следующий() Цикл
					Ошибки = "";
					Если ЗначениеЗаполнено(ВыборкаСтрока.НомерСтроки) Тогда
						Ошибки = "Оплата от " + ВыборкаСтрока.ДатаОплаты + " на сумму " + ВыборкаСтрока.СуммаОплаты + " не загружена. повтор!
									|";
					ИначеЕсли ЗначениеЗаполнено(ВыборкаСтрока.ДокументРеализации) Тогда
						//Евросиб Каблов 16.12.2020 ( Ticket#0215416 При выгрузке сторно привязки в том же периоде, что и привязка, удалять исходную привязку
						Если ЗначениеЗаполнено(ВыборкаСтрока.НомерСтрокиСторнируемойОплаты) Тогда
							СтрокиОплаты = ТабОплат.НайтиСтроки(Новый Структура("ДокументРеализации, СуммаОплаты, ДатаОплаты", ВыборкаСтрока.ДокументРеализации, -ВыборкаСтрока.СуммаОплаты, ВыборкаСтрока.ДатаОплаты));
							Если СтрокиОплаты.Количество() > 0 Тогда
								ТабОплат.Удалить(СтрокиОплаты[0]);
						// Субботин 82477 04.04.2024 начало // удаляет счет из списка разнесения при сторно 
							//Евросиб СубботинВ #92045 14.10.2024 Начало //перевел на работу с тч счетов, т.к это будет реалитзовано в дальнейшем 

							//Документы.ПоступлениеНаРасчетныйСчет.УдалитьСчетИзРазнесенияПоступления(ПоступлениеДСОбъект.РазнесениеНаСчетаПокупателям,
							//ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаСтрока.ДокументРеализации,"СчетНаОплатуПокупателю"));
							//Евросиб СубботинВ #92045 14.10.2024 Начало // добавил получение ТЧ в рамках оптимизации
							ПараметрыПоиска = Новый Структура("Ссылка", ВыборкаСтрока.ДокументРеализации);	
							НайденныеСтрокиПоРТУ = ВыборкаТЧРТУ.НайтиСтроки(ПараметрыПоиска);							
							//Документы.ПоступлениеНаРасчетныйСчет.УдалитьСчетИзРазнесенияПоступления(ПоступлениеДСОбъект.РазнесениеНаСчетаПокупателям,
							//ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаСтрока.ДокументРеализации,"СчетаНаОплатуПокупателям"));
							Документы.ПоступлениеНаРасчетныйСчет.УдалитьСчетИзРазнесенияПоступления(ПоступлениеДСОбъект.РазнесениеНаСчетаПокупателям,
							НайденныеСтрокиПоРТУ);
                            //Евросиб СубботинВ #92045 14.10.2024 Конец // добавил получение ТЧ в рамках оптимизации
                            //Евросиб СубботинВ #92045 14.10.2024 Конец  

						// Субботин 82477 04.04.2024 Конец //								
							Иначе
								Ошибки = "Сторнируемая оплата не найдена!";
							КонецЕсли;						
						Иначе
							//Евросиб Каблов 16.12.2020 )
							
							//Субботин 85246  17.05.2024 начало //если в рамках одной загрузки добавляются стразу и привязка и сторно, то такие строки выхоят в 0
							СтрокиОплаты = ТабОплат.НайтиСтроки(Новый Структура("ДокументРеализации, СуммаОплаты, ДатаОплаты", ВыборкаСтрока.ДокументРеализации, -ВыборкаСтрока.СуммаОплаты, ВыборкаСтрока.ДатаОплаты));
							Если СтрокиОплаты.Количество() > 0 Тогда
								ТабОплат.Удалить(СтрокиОплаты[0]);
							Иначе
							//Субботин 85246  17.05.2024 Конец //если в рамках одной загрузки добавляются стразу и привязка и сторно, то такие строки выхоят в 0	
								СтрокаОПлаты = ТабОплат.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаОПлаты, Выборкастрока);
								СтрокаОПлаты.ДатаОплаты = ВыборкаСтрока.ДатаОплаты;
								// Субботин 82477 04.04.2024 начало // удаляет счет из списка разнесения при сторно 
								// Субботин 82477 правки бага начало
								Если ВыборкаСтрока.СуммаОплаты < 0 Тогда 
									// Субботин 82477 правки бага Конец
									//Евросиб СубботинВ #92045 14.10.2024 Начало 
									//Документы.ПоступлениеНаРасчетныйСчет.УдалитьСчетИзРазнесенияПоступления(ПоступлениеДСОбъект.РазнесениеНаСчетаПокупателям,
									//ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаСтрока.ДокументРеализации,"СчетНаОплатуПокупателю"));
									//Евросиб СубботинВ #92045 14.10.2024 Начало // добавил получение ТЧ в рамках оптимизации
									ПараметрыПоиска = Новый Структура("Ссылка", ВыборкаСтрока.ДокументРеализации);	
									НайденныеСтрокиПоРТУ = ВыборкаТЧРТУ.НайтиСтроки(ПараметрыПоиска);							
									//Документы.ПоступлениеНаРасчетныйСчет.УдалитьСчетИзРазнесенияПоступления(ПоступлениеДСОбъект.РазнесениеНаСчетаПокупателям,
									//ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаСтрока.ДокументРеализации,"СчетаНаОплатуПокупателям"));
									Документы.ПоступлениеНаРасчетныйСчет.УдалитьСчетИзРазнесенияПоступления(ПоступлениеДСОбъект.РазнесениеНаСчетаПокупателям,
									НайденныеСтрокиПоРТУ);
									//Евросиб СубботинВ #92045 14.10.2024 Конец // добавил получение ТЧ в рамках оптимизации
									//Евросиб СубботинВ #92045 14.10.2024 Конец  
                           	
									// Субботин 82477 правки бага Начало	
								КонецЕсли;
								// Субботин 82477 правки бага Конец 
								// Субботин 82477 04.04.2024 Конец //
							КонецЕсли;
						КонецЕсли;
					Иначе
						Ошибки = "Реализация не найдена в DATACore!
									|";
					КонецЕсли; 
					Если ЗначениеЗаполнено(Ошибки) Тогда
						СтрокаРез = ТЗРезультат.Добавить();
						СтрокаРез.НомерСтроки = ВыборкаСтрока.НомерСтрокиОплаты;
						СтрокаРез.Комментарий = Ошибки;
					КонецЕсли;
					НомерСтрокиОплаты = ВыборкаСтрока.НомерСтрокиОплаты;
				КонецЦикла; 
				
				Если ПоступлениеДСОбъект.Модифицированность() Тогда
					// Евросиб Фролов (31.03.2022 Task №49440
					Если ПоступлениеДСОбъект.ВыполненаПопыткаРазнесения Тогда
						Документы.ПоступлениеНаРасчетныйСчет.РазнестиОплатуПоСчетамНаСервере(ПоступлениеДСОбъект);
					КонецЕсли;
					// Евросиб Фролов)
					
					
					Попытка
						ПоступлениеДСОбъект.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						Ошибки = Ошибки + ОписаниеОшибки();			
						СтрокаРез = ТЗРезультат.Добавить();
						СтрокаРез.НомерСтроки = НомерСтрокиОплаты;
						СтрокаРез.Комментарий = Ошибки;
					КонецПопытки;
				КонецЕсли;
			Иначе
				//если поступление ДС не проведено, это считается введёнными остатками. Или Поступление ДС это КД.
				//тогда нужно делать и проводить КД с операцией взаимозачет по указанным ПП и РТУ, чтобы закрылись остатки по ним на сумму зачета.
				ВыборкаСтрока = Выборка.Выбрать();
				Пока ВыборкаСтрока.Следующий() Цикл
					Если ЗначениеЗаполнено(ВыборкаСтрока.КорректировкаДолга) Тогда
						Ошибки = "Оплата от " + ВыборкаСтрока.ДатаОплаты + " на сумму " + ВыборкаСтрока.СуммаОплаты + " не загружена. повтор!
							|";
					//Евросиб Каблов 16.12.2020 ( Ticket#0215416 При выгрузке сторно привязки в том же периоде, что и привязка, удалять исходную привязку	
					ИначеЕсли ЗначениеЗаполнено(ВыборкаСтрока.КорректировкаДолгаСторнируемойОплаты) Тогда
						КорректировкаОбъект = ВыборкаСтрока.КорректировкаДолгаСторнируемойОплаты.ПолучитьОбъект();
						Попытка
							КорректировкаОбъект.УстановитьПометкуУдаления(Истина);
						Исключение
							ТекстОшибки = ОписаниеОшибки();
							Ошибки = "При удалении КД произошла ошибка:" + Символы.ПС + ТекстОшибки;
						КонецПопытки;
					//Евросиб Каблов 16.12.2020 )
					ИначеЕсли ЗначениеЗаполнено(ВыборкаСтрока.ДокументРеализации) Тогда
						НачатьТранзакцию();
						Попытка
							ЗаполнитьКорректировкуДолга(ВыборкаСтрока);
							//Евросиб Каблов 18.02.2021 ( Ticket#022359
							Если ВыборкаСтрока.ДокументРеализации.ПометкаУдаления Тогда
								СоздатьКДПоАннулированномуИСФ(ВыборкаСтрока);
							КонецЕсли;
							//Евросиб Каблов 18.02.2021 )
							ЗафиксироватьТранзакцию();
						Исключение							
							Ошибки = ОписаниеОшибки();
							ОтменитьТранзакцию();
						КонецПопытки;
					Иначе						
						//Нет РТУ. Если загружается Сторно оплаты и Дата РТУ до начала учета, то нужно загрузить его из РИТМА не проведённый
						//а потом создать к нему корректировку долга						
						Если ВыборкаСтрока.СуммаОплаты < 0 И ВыборкаСтрока.ДатаРеализации < ВыборкаСтрока.ДатаНачалаВеденияУчета Тогда
							//Загрузка базового ИСФ
							РезультатЗагрузкиИСФ = Обработки.ЗагрузкаИСФизРИТМа.ЗагрузитьИСФ(ВыборкаСтрока.Организация, ВыборкаСтрока.УИДДокументаРеализации, "Б", ВыборкаСтрока.ВерсияИСФ, Ложь);
							Реализация = РезультатЗагрузкиИСФ.СсылкаИСФ;
							Если ЗначениеЗаполнено(РезультатЗагрузкиИСФ.Комментарий) Тогда
								Ошибки = "При загрузке ИСФ из РИТМа произошла ошибка: " + РезультатЗагрузкиИСФ.Комментарий;
							КонецЕсли;
							
							Если Не ЗначениеЗаполнено(Реализация) Тогда
								//Загрузка корректировочного ИСФ
								РезультатЗагрузкиИСФ = Обработки.ЗагрузкаИСФизРИТМа.ЗагрузитьИСФ(ВыборкаСтрока.Организация, ВыборкаСтрока.УИДДокументаРеализации, "К", ВыборкаСтрока.ВерсияИСФ, Ложь);
								Реализация = РезультатЗагрузкиИСФ.СсылкаИСФ;
								Если ЗначениеЗаполнено(РезультатЗагрузкиИСФ.Комментарий) Тогда
									Ошибки = "При загрузке ИСФ из РИТМа произошла ошибка: " + РезультатЗагрузкиИСФ.Комментарий;
								КонецЕсли;
							КонецЕсли;							
							
							Если ЗначениеЗаполнено(Реализация) И Не ЗначениеЗаполнено(Ошибки) Тогда
								
								ЗаполнитьЗначенияСвойств(СтруктураПараметровОплаты, ВыборкаСтрока,, "ДокументРеализации");
								СтруктураПараметровОплаты.ДокументРеализации = Реализация;
								СтруктураПараметровОплаты.ДокументРеализацииПредставление = Строка(Реализация);
								
								Попытка
									ЗаполнитьКорректировкуДолга(СтруктураПараметровОплаты);
									//Евросиб Каблов 18.02.2021 ( Ticket#0223595
									Если СтруктураПараметровОплаты.ДокументРеализации.ПометкаУдаления Тогда
										СоздатьКДПоАннулированномуИСФ(СтруктураПараметровОплаты);
									КонецЕсли;
									//Евросиб Каблов 18.02.2021 )
								Исключение
									Ошибки = ОписаниеОшибки();
								КонецПопытки;											
								
							ИначеЕсли Не ЗначениеЗаполнено(Ошибки) Тогда
								Ошибки = "Реализация не найдена в DATACore и не удалось загрузить её из РИТМа!";
							КонецЕсли;
						Иначе
							Ошибки = "Реализация не найдена в DATACore!
										|";
						КонецЕсли;						
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Ошибки) Тогда
						СтрокаРез = ТЗРезультат.Добавить();
						СтрокаРез.НомерСтроки = ВыборкаСтрока.НомерСтрокиОплаты;
						СтрокаРез.Комментарий = Ошибки;
					КонецЕсли;
				КонецЦикла;
				Продолжить;
			КонецЕсли;
			//Евросиб Каблов 31.07.2020 )
		//ИначеЕсли ЗначениеЗаполнено(Выборка.ПоступлениеДС) И ТипЗнч(Выборка.ПоступлениеДС) = Тип("ДокументСсылка.КорректировкаДолга") Тогда
			
		Иначе
			ДатаНачалаВеденияУчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ДатаНачалаВеденияУчета");
			ВыборкаСтрока = Выборка.Выбрать();
			Пока ВыборкаСтрока.Следующий() Цикл
				СтрокаРез = ТЗРезультат.Добавить();
				СтрокаРез.НомерСтроки = ВыборкаСтрока.НомерСтрокиОплаты;				
				СтрокаРез.Комментарий = "Документ поступления ДС не найден в DATACore!";
				//Евросиб Каблов 12.08.2020 (
				Если ВыборкаСтрока.СуммаОплаты < 0 И ВыборкаСтрока.ДатаРеализации < ДатаНачалаВеденияУчета Тогда
					СтрокаРез.НеобходимоеДействие = "ВыгрузитьПоступлениеНаРасчетныйСчет";
				КонецЕсли;				
				//Евросиб Каблов 12.08.2020 )
			КонецЦикла;
			Продолжить;	
		КонецЕсли;		 
		
	КонецЦикла;
	
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(ТЗРезультат);

КонецФункции // ЗаписатьОплаты()

Функция ЗаполнитьКорректировкуДолга(ПараметрыОплаты)
	
	Если ЗначениеЗаполнено(ПараметрыОплаты.КорректировкаДолга) Тогда
		КорректировкаДолга = ПараметрыОплаты.КорректировкаДолга;
	Иначе
		КорректировкаДолга = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КорректировкаДолга) Тогда
		КорректировкаДолгаОбъект = КорректировкаДолга.ПолучитьОбъект();
		КорректировкаДолгаОбъект.ДебиторскаяЗадолженность.Очистить();
		КорректировкаДолгаОбъект.КредиторскаяЗадолженность.Очистить();
	Иначе
		КорректировкаДолгаОбъект = Документы.КорректировкаДолга.СоздатьДокумент();
	КонецЕсли;
	
//Евросиб Гудкова( 12.11.2020 Ticket№ 0211554
//	ДатаОплаты = ПараметрыОплаты.ДатаОплаты;
	//Евросиб Каблов 19.11.2020 ( Сделал расчет поля ДатаОплаты в запросе
	//ДатаОплаты = Макс(ПараметрыОплаты.ДатаРеализации, ПараметрыОплаты.ДокументРеализации.ПериодВО, ПараметрыОплаты.ПоступлениеДС.ДатаВзаиморасчетов, НачалоМесяца(ПараметрыОплаты.ДатаОплаты));
	ДатаОплаты = ПараметрыОплаты.ДатаОплаты;
	//Евросиб Каблов 19.11.2020 )
// Евросиб Гудкова) 						
	
	КорректировкаДолгаОбъект.Заполнить(Неопределено);
	КорректировкаДолгаОбъект.Дата = ДатаОплаты;
	КорректировкаДолгаОбъект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.Прочее;
	КорректировкаДолгаОбъект.Организация = ПараметрыОплаты.Организация;
	КорректировкаДолгаОбъект.ПодразделениеОрганизации = ПараметрыОплаты.ПодразделениеОрганизации;
	
	ПараметрыКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ПараметрыОплаты.ВалютаДокумента, ДатаОплаты);
	КорректировкаДолгаОбъект.КурсДокумента = ПараметрыКурсаДокумента.Курс;
	КорректировкаДолгаОбъект.КратностьДокумента = ПараметрыКурсаДокумента.Кратность;
	КорректировкаДолгаОбъект.ВалютаДокумента = ПараметрыОплаты.ВалютаДокумента;
	
	КорректировкаДолгаОбъект.КонтрагентДебитор = ПараметрыОплаты.Контрагент;
	КорректировкаДолгаОбъект.КонтрагентКредитор = ПараметрыОплаты.Контрагент;
	
	//Евросиб Каблов 18.11.2020 (
	//СтрокаДт = КорректировкаДолгаОбъект.ДебиторскаяЗадолженность.Добавить();
	//СтрокаДт.ДатаВзаиморасчетов = ДатаОплаты;
	//СтрокаДт.ДоговорКонтрагента = ПараметрыОплаты.ДоговорКонтрагента;
	//СтрокаДт.КурсВзаиморасчетов = ПараметрыКурсаДокумента.Курс;
	//СтрокаДт.КратностьВзаиморасчетов = ПараметрыКурсаДокумента.Кратность;
	//Если ПараметрыОплаты.СуммаОплаты > 0 Тогда
	//	СуммаОплаты = ПараметрыОплаты.СуммаОплаты;
	//	СтрокаДт.Сделка = ПараметрыОплаты.ДокументРеализации;
	//	Комментарий = "Привязка оплаты";
	//Иначе
	//	СуммаОплаты = -ПараметрыОплаты.СуммаОплаты;
	//	СтрокаДт.Сделка = ПараметрыОплаты.ПоступлениеДС;
	//	Комментарий = "Сторно привязки оплаты";
	//КонецЕсли;
	//СтрокаДт.Сумма = СуммаОплаты;
	//СтрокаДт.СуммаВзаиморасчетов = СуммаОплаты;
	//СтрокаДт.КорДоговорКонтрагента = ПараметрыОплаты.ДоговорКонтрагента;
	//СтрокаДт.СтавкаНДС = ПараметрыОплаты.СтавкаНДС;
	//СтрокаДт.НДСВключая = Истина;

	//СтрокаКт = КорректировкаДолгаОбъект.КредиторскаяЗадолженность.Добавить();
	//СтрокаКт.ДатаВзаиморасчетов = ДатаОплаты;
	//СтрокаКт.ДоговорКонтрагента = ПараметрыОплаты.ДоговорКонтрагента;
	//СтрокаКт.КурсВзаиморасчетов = ПараметрыКурсаДокумента.Курс;
	//СтрокаКт.КратностьВзаиморасчетов = ПараметрыКурсаДокумента.Кратность;
	//Если ПараметрыОплаты.СуммаОплаты > 0 Тогда
	//	СтрокаКт.Сделка = ПараметрыОплаты.ПоступлениеДС;
	//Иначе
	//	СтрокаКт.Сделка = ПараметрыОплаты.ДокументРеализации;
	//КонецЕсли;	
	//СтрокаКт.Сумма = СуммаОплаты;
	//СтрокаКт.СуммаВзаиморасчетов = СуммаОплаты;
	//СтрокаКт.КорДоговорКонтрагента = ПараметрыОплаты.ДоговорКонтрагента;
	//СтрокаКт.СтавкаНДС = ПараметрыОплаты.СтавкаНДС;
	//СтрокаКт.НДСВключая = Истина;
	
	
	СтрокаДт = КорректировкаДолгаОбъект.ДебиторскаяЗадолженность.Добавить();
	СтрокаДт.ДатаВзаиморасчетов = ДатаОплаты;
	СтрокаДт.ДоговорКонтрагента = ПараметрыОплаты.ДоговорКонтрагента;
	СтрокаДт.КурсВзаиморасчетов = ПараметрыКурсаДокумента.Курс;
	СтрокаДт.КратностьВзаиморасчетов = ПараметрыКурсаДокумента.Кратность;
	СтрокаДт.Сделка = ПараметрыОплаты.ДокументРеализации;
	СтрокаДт.Сумма = ПараметрыОплаты.СуммаОплаты;
	СтрокаДт.СуммаВзаиморасчетов = ПараметрыОплаты.СуммаОплаты;
	СтрокаДт.КорДоговорКонтрагента = ПараметрыОплаты.ДоговорКонтрагента;
	СтрокаДт.СтавкаНДС = ПараметрыОплаты.СтавкаНДСРеализации;
	СтрокаДт.НДСВключая = Истина;

	СтрокаКт = КорректировкаДолгаОбъект.КредиторскаяЗадолженность.Добавить();
	СтрокаКт.ДатаВзаиморасчетов = ДатаОплаты;
	СтрокаКт.ДоговорКонтрагента = ПараметрыОплаты.ДоговорКонтрагента;
	СтрокаКт.КурсВзаиморасчетов = ПараметрыКурсаДокумента.Курс;
	СтрокаКт.КратностьВзаиморасчетов = ПараметрыКурсаДокумента.Кратность;
	СтрокаКт.Сделка = ПараметрыОплаты.ПоступлениеДС;
	СтрокаКт.Сумма = ПараметрыОплаты.СуммаОплаты;
	СтрокаКт.СуммаВзаиморасчетов = ПараметрыОплаты.СуммаОплаты;
	СтрокаКт.КорДоговорКонтрагента = ПараметрыОплаты.ДоговорКонтрагента;
	СтрокаКт.СтавкаНДС = ПараметрыОплаты.СтавкаНДС;
	СтрокаКт.НДСВключая = Истина;
	
	Если ПараметрыОплаты.СуммаОплаты > 0 Тогда
		Комментарий = "Привязка оплаты";
	Иначе
		Комментарий = "Сторно привязки оплаты";
	КонецЕсли;
	//Евросиб Каблов 18.11.2020 )
	
	КорректировкаДолгаОбъект.Комментарий = Комментарий + " " + ПараметрыОплаты.ПоступлениеДСПредставление + " - " + ПараметрыОплаты.ДокументРеализацииПредставление;
	
	КорректировкаДолгаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецФункции

//Евросиб Каблов 18.02.2021 Ticket#0223595
Функция СоздатьКДПоАннулированномуИСФ(ПараметрыОплаты)
	
	КорректировкаДолгаОбъект = Документы.КорректировкаДолга.СоздатьДокумент();
	
	ДатаОплаты = ПараметрыОплаты.ДатаОплаты;
	
	КорректировкаДолгаОбъект.Заполнить(Неопределено);
	КорректировкаДолгаОбъект.Дата = ДатаОплаты;
	КорректировкаДолгаОбъект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ФормированиеЗадолженности;
	КорректировкаДолгаОбъект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя;
	КорректировкаДолгаОбъект.Организация = ПараметрыОплаты.Организация;
	КорректировкаДолгаОбъект.ПодразделениеОрганизации = ПараметрыОплаты.ПодразделениеОрганизации;
	
	ПараметрыКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ПараметрыОплаты.ВалютаДокумента, ДатаОплаты);
	КорректировкаДолгаОбъект.КурсДокумента = ПараметрыКурсаДокумента.Курс;
	КорректировкаДолгаОбъект.КратностьДокумента = ПараметрыКурсаДокумента.Кратность;
	КорректировкаДолгаОбъект.ВалютаДокумента = ПараметрыОплаты.ВалютаДокумента;
	
	КорректировкаДолгаОбъект.КонтрагентДебитор = ПараметрыОплаты.Контрагент;
	КорректировкаДолгаОбъект.КонтрагентКредитор = ПараметрыОплаты.Контрагент;
	
	СтрокаДт = КорректировкаДолгаОбъект.ДебиторскаяЗадолженность.Добавить();
	СтрокаДт.ДатаВзаиморасчетов = ДатаОплаты;
	СтрокаДт.ДоговорКонтрагента = ПараметрыОплаты.ДоговорКонтрагента;
	СтрокаДт.КурсВзаиморасчетов = ПараметрыКурсаДокумента.Курс;
	СтрокаДт.КратностьВзаиморасчетов = ПараметрыКурсаДокумента.Кратность;
	СтрокаДт.Сделка = ПараметрыОплаты.ДокументРеализации;
	СтрокаДт.Сумма = ПараметрыОплаты.СуммаОплаты;
	СтрокаДт.СуммаВзаиморасчетов = ПараметрыОплаты.СуммаОплаты;
	СтрокаДт.КорДоговорКонтрагента = ПараметрыОплаты.ДоговорКонтрагента;
	СтрокаДт.СтавкаНДС = ПараметрыОплаты.СтавкаНДСРеализации;
	СтрокаДт.НДСВключая = Истина;

	Комментарий = "Закрытие остатка по аннулированному ИСФ при загрузке сторно привязки";
	
	КорректировкаДолгаОбъект.Комментарий = Комментарий + " " + ПараметрыОплаты.ПоступлениеДСПредставление + " - " + ПараметрыОплаты.ДокументРеализацииПредставление;
	
	КорректировкаДолгаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецФункции

Функция СоздатьКД(XMLParams) Экспорт

	ТЗРезультат = Новый ТаблицаЗначений;	
	ТЗРезультат.Колонки.Добавить("ГУИДКД");
	ТЗРезультат.Колонки.Добавить("Комментарий");
	ТЗРезультат.Колонки.Добавить("НомерСтроки");
	
	СтруктураОбязательныхРеквизитовШапки = Новый Структура("Организация, КонтрагентДебитор, КонтрагентКредитор, ВидОперации, 
	|ЦФО, ВалютаДокумента, Дата");
	СтруктураОбязательныхРеквизитовТЧ = Новый Структура("ДоговорКонтрагента, КурсВзаиморасчетов, КратностьВзаиморасчетов, Сделка, Сумма, СуммаВзаиморасчетов, КорДоговорКонтрагента");
	СтруктураОбязательныхРеквизитовШапкиСписание = Новый Структура("Организация, КонтрагентДебитор, ВидОперации, 
	|ЦФО, ВалютаДокумента, Дата");
	СтруктураОбязательныхРеквизитовТЧСписание = Новый Структура("ДоговорКонтрагента, КурсВзаиморасчетов, КратностьВзаиморасчетов, Сделка, Сумма, СуммаВзаиморасчетов");
	
	СтруктураДанных = ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	Организация = Справочники.Организации.НайтиПоКоду(СтруктураДанных.ОрганизацияКод);
	Ошибки = "";
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Ошибки = "Не найдена организация!";
		Для каждого СтрокаДанных Из СтруктураДанных.ТабКД Цикл
				СтрокаТЗРезультата = ТЗРезультат.Добавить();
				СтрокаТЗРезультата.Комментарий = Ошибки;
				СтрокаТЗРезультата.НомерСтроки = СтрокаДанных.НомерСтроки;
				СтрокаТЗРезультата.ГУИДКД = СтрокаДанных.ГУИДКД;
		КонецЦикла; 
		Возврат ТЗРезультат;
	КонецЕсли; 
	
#Область Запрос
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПОДСТРОКА(ТабКД.Комментарий, 1, 1000) КАК Комментарий,
	               |	ТабКД.НомерСтроки КАК НомерСтроки,
	               |	ТабКД.ГУИДКД КАК ГУИДКД,
	               |	ТабКД.Номер КАК НомерКД,
	               |	ТабКД.Дата КАК Дата,
	               |	ТабКД.ПодразделениеКод КАК ПодразделениеКод,
	               |	ТабКД.ОтветственныйНаименование КАК ОтветственныйНаименование,
	               |	ТабКД.ВалютаДокументаКод КАК ВалютаДокументаКод,
	               |	ТабКД.КурсДокумента КАК КурсДокумента,
	               |	ТабКД.КратностьДокумента КАК КратностьДокумента,
	               |	ТабКД.ВидОперации КАК ВидОперации,
	               |	ТабКД.УИДКонтрагентаДт КАК УИДКонтрагентаДт,
	               |	ТабКД.УИДКонтрагентаКт КАК УИДКонтрагентаКт,
				   //Евросиб Каблов 21.06.2021 ( Ticket#0235050
				   |	ТабКД.ГУИДЗаказа КАК ГУИДЗаказа,
				   |	ТабКД.ГУИДКорДоговора КАК ГУИДКорДоговора
				   //Евросиб Каблов 21.06.2021 ) 
				   //Евросиб Дубская 22.05.2023 ( Ticket#0294896
				   |   ,
				   |   ТабКД.ДатаКурса как ДатаКурса 
				   //Евросиб Дубская 22.05.2023 ) 
				   // ДИТ Сержантова А.С. 03.04.2024 (Ticket#0336753  
				   |   ,
				   |   ТабКД.КурсПереноса как КурсПереноса,
				   |   ТабКД.ИспользоватьКурс как ИспользоватьКурс
				   // ДИТ Сержантова А.С. 03.04.2024)
	               |ПОМЕСТИТЬ ТабКД
	               |ИЗ
	               |	&ТабКД КАК ТабКД
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТабТЧКД.ГУИДКД КАК ГУИДКД,
	               |	ТабТЧКД.ВидЗадолженности КАК ВидЗадолженности,
	               |	ТабТЧКД.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	               |	ТабТЧКД.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	               |	ТабТЧКД.ГУИДСделки КАК ГУИДСделки,
				   //Евросиб Каблов 30.12.2020 ( Ticket#0218600
				   |	ТабТЧКД.ГУИДЗаказа КАК ГУИДЗаказа,
				   //Евросиб Каблов 30.12.2020 )
				   //Евросиб Каблов 10.11.2021 ( Ticket#0248191
				   |	ТабТЧКД.ЗаказПредставление КАК ЗаказПредставление,
				   //Евросиб Каблов 10.11.2021 )
	               |	ТабТЧКД.Сумма КАК Сумма,
	               |	ТабТЧКД.СуммаРегл КАК СуммаРегл,
	               |	ТабТЧКД.УИДДоговораКонтрагента КАК УИДДоговораКонтрагента,
	               |	ТабТЧКД.УИДКорДоговораКонтрагента КАК УИДКорДоговораКонтрагента
	               |ПОМЕСТИТЬ ТабТЧКД
	               |ИЗ
	               |	&ТабТЧКД КАК ТабТЧКД
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////     
				   //Евросиб Дубская 29.12.2022 ( Ticket#0296221
				   |ВЫБРАТЬ
				   |	ТабКД.ГУИДКД КАК ГУИДКД,
				   |	ТабТЧКД.ГУИДСделки КАК ГУИДСделки,
				   |	МАКСИМУМ(СделкиКД.ДатаОбмена) КАК ДатаОбмена
				   |ПОМЕСТИТЬ Вт_Сделки
				   |ИЗ
				   |	ТабКД КАК ТабКД
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабТЧКД КАК ТабТЧКД
				   |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК СделкиКД
				   |			ПО ТабТЧКД.ГУИДСделки = СделкиКД.УИДИсточника
				   |				И (ТабТЧКД.ГУИДСделки <> """")
				   |				И (СделкиКД.Объект ССЫЛКА Документ.КорректировкаДолга)
				   |				И (СделкиКД.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
				   |		ПО ТабКД.ГУИДКД = ТабТЧКД.ГУИДКД
				   |
				   |СГРУППИРОВАТЬ ПО
				   |	ТабТЧКД.ГУИДСделки,
				   |	ТабКД.ГУИДКД
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ТабКД.ГУИДКД КАК ГУИДКД,
				   |	ТабТЧКД.ГУИДСделки КАК ГУИДСделки,
				   |	МАКСИМУМ(СделкиРТУ.ДатаОбмена) КАК ДатаОбмена
				   |ПОМЕСТИТЬ Вт_РТУ
				   |ИЗ
				   |	ТабКД КАК ТабКД
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабТЧКД КАК ТабТЧКД
				   |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК СделкиРТУ
				   |			ПО ТабТЧКД.ГУИДСделки = СделкиРТУ.УИДИсточника
				   |				И (ТабТЧКД.ГУИДСделки <> """")
				   |				И (СделкиРТУ.Объект ССЫЛКА Документ.РеализацияТоваровУслуг)
				   |		ПО ТабКД.ГУИДКД = ТабТЧКД.ГУИДКД
				   |
				   |СГРУППИРОВАТЬ ПО
				   |	ТабТЧКД.ГУИДСделки,
				   |	ТабКД.ГУИДКД
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ТабКД.ГУИДКД КАК ГУИДКД,
				   |	ТабТЧКД.ГУИДСделки КАК ГУИДСделки,
				   |	МАКСИМУМ(СделкиРТУ.ДатаОбмена) КАК ДатаОбмена
				   |ИЗ
				   |	ТабКД КАК ТабКД
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабТЧКД КАК ТабТЧКД
				   |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК СделкиРТУ
				   |			ПО ТабТЧКД.ГУИДСделки = СделкиРТУ.УИДИсточника
				   |				И (ТабТЧКД.ГУИДСделки <> """")
				   |				И (СделкиРТУ.Объект ССЫЛКА Документ.РеализацияТоваровУслуг)
				   |		ПО ТабКД.ГУИДКД = ТабТЧКД.ГУИДКД
				   |
				   |СГРУППИРОВАТЬ ПО
				   |	ТабТЧКД.ГУИДСделки,
				   |	ТабКД.ГУИДКД
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	МАКСИМУМ(СделкиКД.Объект) КАК Объект,
				   |	Вт_Сделки.ГУИДКД КАК ГУИДКД,
				   |	Вт_Сделки.ГУИДСделки КАК ГУИДСделки
				   |ПОМЕСТИТЬ ВТ_СделкиИтог
				   |ИЗ
				   |	Вт_Сделки КАК Вт_Сделки
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК СделкиКД
				   |		ПО Вт_Сделки.ДатаОбмена = СделкиКД.ДатаОбмена
				   |			И Вт_Сделки.ГУИДСделки = СделкиКД.УИДИсточника
				   |			И (СделкиКД.Объект ССЫЛКА Документ.КорректировкаДолга)
				   |			И (СделкиКД.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
				   |ГДЕ
				   |	Вт_Сделки.ГУИДСделки <> """"
				   |
				   |СГРУППИРОВАТЬ ПО
				   |	Вт_Сделки.ГУИДКД,
				   |	Вт_Сделки.ГУИДСделки
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	МАКСИМУМ(СделкиРТУ.Объект) КАК Объект,
				   |	Вт_РТУ.ГУИДКД КАК ГУИДКД,
				   |	Вт_РТУ.ГУИДСделки КАК ГУИДСделки
				   |ПОМЕСТИТЬ ВТ_РТУИтог
				   |ИЗ
				   |	Вт_РТУ КАК Вт_РТУ
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК СделкиРТУ
				   |		ПО Вт_РТУ.ДатаОбмена = СделкиРТУ.ДатаОбмена
				   |			И Вт_РТУ.ГУИДСделки = СделкиРТУ.УИДИсточника
				   |			И (СделкиРТУ.Объект ССЫЛКА Документ.РеализацияТоваровУслуг)
				   |ГДЕ
				   |	Вт_РТУ.ГУИДСделки <> """"
				   |
				   |СГРУППИРОВАТЬ ПО
				   |	Вт_РТУ.ГУИДКД,
				   |	Вт_РТУ.ГУИДСделки
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////			   
				   //Евросиб Дубская 29.12.2022 )
	               |ВЫБРАТЬ
	               |	ТабКД.Комментарий КАК Комментарий,
	               |	ТабКД.НомерСтроки КАК НомерСтроки,
	               |	ТабКД.ГУИДКД КАК ГУИДКД,
	               |	ТабКД.НомерКД КАК НомерКД,
	               |	ТабКД.Дата КАК Дата,
	               |	ТабКД.КурсДокумента КАК КурсДокумента,
	               |	ТабКД.КратностьДокумента КАК КратностьДокумента,
	               |	ВЫБОР
				   |		КОГДА ТабКД.ВидОперации = ""ПереносЗадолженности""				   
				   |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.ПереносЗадолженности)
	               |		КОГДА ТабКД.ВидОперации = ""СписаниеЗадолженности""
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКорректировкаДолга.Прочее)
	               |	КОНЕЦ КАК ВидОперации,
	               |	ЗагруженныеКД.Объект КАК КорректировкаДолгаСсылка,
	               |	ЦентрыФинансовойОтветственности.Ссылка КАК ЦФО,
	               |	Пользователи.Ссылка КАК Автор,
	               |	Пользователи.Ссылка КАК Ответственный,
	               |	Валюты.Ссылка КАК ВалютаДокумента,
	               |	КонтрагентыДт.Объект КАК КонтрагентДебитор,
	               |	КонтрагентыКт.Объект КАК КонтрагентКредитор,
	               |	&Организация КАК Организация,
	               |	ТабТЧКД.ВидЗадолженности КАК ВидЗадолженности,
	               |	ТабТЧКД.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	               |	ТабТЧКД.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
				   //Евросиб Каблов 19.11.2020 ( Ticket#0214177
				   //|	ТабТЧКД.СуммаРегл КАК Сумма,
				   //|	ТабТЧКД.Сумма КАК СуммаВзаиморасчетов,
				   |	ТабТЧКД.Сумма КАК Сумма,
				   |	ТабТЧКД.СуммаРегл КАК СуммаВзаиморасчетов,
				   //Евросиб Каблов 19.11.2020 )
	               |	ДоговорыКонтрагентов.Объект КАК ДоговорКонтрагента,
	               |	КорДоговорыКонтрагентов.Объект КАК КорДоговорКонтрагента,
				   //Евросиб Каблов 30.12.2020 ( Ticket#0218600
	               //|	ЕСТЬNULL(СделкиРТУ.Объект, СделкиДСиКД.Объект) КАК Сделка,
				   |	ТабТЧКД.ГУИДСделки КАК ГУИДСделки,
				   |	ТабТЧКД.ГУИДЗаказа КАК ГУИДЗаказа,
				   |	ВЫБОР                            
				   //Евросиб Дубская 29.12.2022 ( Ticket#0296221
				   //|		КОГДА НЕ СделкиРТУ.Объект ЕСТЬ NULL
				   //|			ТОГДА СделкиРТУ.Объект  
	               |		КОГДА НЕ ВТ_РТУИтог.Объект ЕСТЬ NULL
	               |			ТОГДА ВТ_РТУИтог.Объект  
				   //Евросиб Дубская 29.12.2022 )
	               |		КОГДА НЕ СделкиПТУ.Объект ЕСТЬ NULL
	               |			ТОГДА СделкиПТУ.Объект
				   |		КОГДА НЕ СделкиДС.Объект ЕСТЬ NULL
	               |			ТОГДА СделкиДС.Объект 
				   //Евросиб Дубская 29.12.2022 ( Ticket#0296221
				   //|		ИНАЧЕ СделкиКД.Объект
	               |		ИНАЧЕ ВТ_СделкиИтог.Объект
				   //Евросиб Дубская 29.12.2022 )
	               |	КОНЕЦ КАК Сделка,
				   |	ЕСТЬNULL(Заказы.Объект, ЗаказыПоГУИДСделки.Объект) КАК ДокументРасшифровка,
				   //Евросиб Каблов 30.12.2020 )
				   //Евросиб Каблов 10.11.2021 ( Ticket#0248191
				   |	ТабТЧКД.ЗаказПредставление КАК ЗаказПредставление,
				   //Евросиб Каблов 10.11.2021 )
				   //Евросиб Каблов 21.06.2021 ( Ticket#0235050
				   |	ТабКД.ГУИДЗаказа КАК ГУИДЗаказаШапки,
				   |	ЗаказыШапки.Объект КАК ЗаказШапки,
				   |	КорДоговорШапки.Объект КАК КорДоговор
				   //Евросиб Каблов 21.06.2021 )   
				   //Евросиб Дубская 22.05.2023 ( Ticket#0294896
				   |   ,
				   |   ТабКД.ДатаКурса как ДатаВзаиморасчетов 
				   //Евросиб Дубская 22.05.2023 )
				   // ДИТ Сержантова А.С. 03.04.2024 (Ticket#0336753  
				   |   ,
				   |   ТабКД.КурсПереноса как КурсПереноса,
				   |   ТабКД.ИспользоватьКурс как ИспользоватьКурс
				   // ДИТ Сержантова А.С. 03.04.2024)
	               |ИЗ
	               |	ТабКД КАК ТабКД
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабТЧКД КАК ТабТЧКД
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ДоговорыКонтрагентов
	               |			ПО ТабТЧКД.УИДДоговораКонтрагента = ДоговорыКонтрагентов.УИДИсточника
	               |				И (ДоговорыКонтрагентов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	               |				И (ДоговорыКонтрагентов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК КорДоговорыКонтрагентов
	               |			ПО ТабТЧКД.УИДКорДоговораКонтрагента = КорДоговорыКонтрагентов.УИДИсточника
	               |				И (КорДоговорыКонтрагентов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	               |				И (КорДоговорыКонтрагентов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
				   //Евросиб Каблов 30.12.2020 ( Ticket#0218600
				   //|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК СделкиРТУ
				   //|			ПО ТабТЧКД.ГУИДСделки = СделкиРТУ.УИДИсточника
				   //|				И (СделкиРТУ.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
				   //|				И (СделкиРТУ.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
				   //|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК СделкиДСиКД
				   //|			ПО ТабТЧКД.ГУИДСделки = СделкиДСиКД.УИДИсточника
				   //|				И (СделкиДСиКД.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))  
				   //Евросиб Дубская 29.12.2022 ( Ticket#0296221
				   //|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК СделкиРТУ
				   //|			ПО ТабТЧКД.ГУИДСделки = СделкиРТУ.УИДИсточника И ТабТЧКД.ГУИДСделки <> """"
				   //|				И СделкиРТУ.Объект ССЫЛКА Документ.РеализацияТоваровУслуг 
				   | 			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РТУИтог КАК ВТ_РТУИтог
				   |			ПО ТабТЧКД.ГУИДСделки = ВТ_РТУИтог.ГУИДСделки
				   |				И (ТабТЧКД.ГУИДСделки <> """")
				   //Евросиб Дубская 29.12.2022 )
				   |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК СделкиПТУ
	               |			ПО ТабТЧКД.ГУИДСделки = СделкиПТУ.УИДИсточника И ТабТЧКД.ГУИДСделки <> """"
				   |				И СделкиПТУ.Объект ССЫЛКА Документ.ПоступлениеТоваровУслуг
//Евросиб Гудкова( 27.01.2021 Ticket№ 0221295				   |				И (СделкиПТУ.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
				   |				И (СделкиПТУ.УзелОбмена <> ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УППЗаказ))
				   |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК СделкиДС
				   |			ПО ТабТЧКД.ГУИДСделки = СделкиДС.УИДИсточника И ТабТЧКД.ГУИДСделки <> """"
				   //Евросиб Каблов 09.03.2021 (
				   //|				И СделкиДС.Объект ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет
				   |				И (СделкиДС.Объект ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет ИЛИ СделкиДС.Объект ССЫЛКА Документ.СписаниеСРасчетногоСчета)
				   //Евросиб Каблов 09.03.2021 )
				   |				И (СделкиДС.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных)) 
				   //Евросиб Дубская 29.12.2022 ( Ticket#0296221
				   //|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК СделкиКД
				   //|			ПО ТабТЧКД.ГУИДСделки = СделкиКД.УИДИсточника И ТабТЧКД.ГУИДСделки <> """"
				   //|				И СделкиКД.Объект ССЫЛКА Документ.КорректировкаДолга
				   //|				И (СделкиКД.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных)) 
				   |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СделкиИтог КАК ВТ_СделкиИтог
				   |			ПО ТабТЧКД.ГУИДСделки = ВТ_СделкиИтог.ГУИДСделки
				   |				И (ТабТЧКД.ГУИДСделки <> """")
				   //Евросиб Дубская 29.12.2022 )
				   |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Заказы
	               |			ПО ТабТЧКД.ГУИДЗаказа = Заказы.УИДИсточника И ТабТЧКД.ГУИДЗаказа <> """"
//Евросиб Гудкова( 27.01.2021 Ticket№ 0221295				   |				И (Заказы.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
				   |				И (Заказы.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УППЗаказ))
				   //Евросиб Каблов 30.12.2020 )
				   //Евросиб Каблов 10.02.2021 ( Ticket#0222228
				   |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ЗаказыПоГУИДСделки
	               |			ПО ТабТЧКД.ГУИДСделки = ЗаказыПоГУИДСделки.УИДИсточника И ТабТЧКД.ГУИДСделки <> """"
				   |				И (ЗаказыПоГУИДСделки.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УППЗаказ))
				   //Евросиб Каблов 10.02.2021 )
	               |		ПО ТабКД.ГУИДКД = ТабТЧКД.ГУИДКД 
					//Евросиб Пирожкова(19.07.2024 Ticket#0335775
				  // |		и ТабКД.ГУИДЗаказа = ТабТЧКД.ГУИДЗаказа
				   // Евросиб Пирожкова 19.07.2024)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ЗагруженныеКД
	               |		ПО ТабКД.ГУИДКД = ЗагруженныеКД.УИДИсточника
	               |			И (ЗагруженныеКД.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	               |			И (ЗагруженныеКД.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	               |			И (ЗагруженныеКД.Объект ССЫЛКА Документ.КорректировкаДолга)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦентрыФинансовойОтветственности КАК ЦентрыФинансовойОтветственности
	               |		ПО ТабКД.ПодразделениеКод = ЦентрыФинансовойОтветственности.Код
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	               |		ПО ТабКД.ОтветственныйНаименование = Пользователи.Наименование
				   //Евросиб Каблов 16.12.2021 ( Ticket#0252959
				   |		И Не Пользователи.Недействителен
				   //Евросиб Каблов 16.12.2021 )
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	               |		ПО ТабКД.ВалютаДокументаКод = Валюты.Код
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК КонтрагентыДт
	               |		ПО ТабКД.УИДКонтрагентаДт = КонтрагентыДт.УИДИсточника
	               |			И (КонтрагентыДт.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	               |			И (КонтрагентыДт.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК КонтрагентыКт
	               |		ПО ТабКД.УИДКонтрагентаКт = КонтрагентыКт.УИДИсточника
	               |			И (КонтрагентыКт.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	               |			И (КонтрагентыКт.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
				   //Евросиб Каблов 21.06.2021 ( Ticket#0235050
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ЗаказыШапки
	               |		ПО ТабКД.ГУИДЗаказа = ЗаказыШапки.УИДИсточника И ТабКД.ГУИДЗаказа <> """"
				   |			И (ЗаказыШапки.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УППЗаказ))
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК КорДоговорШапки
	               |		ПО ТабКД.ГУИДКорДоговора = КорДоговорШапки.УИДИсточника
	               |			И (КорДоговорШапки.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	               |			И (КорДоговорШапки.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
				   //Евросиб Каблов 21.06.2021 )
	               |ИТОГИ
	               |	МАКСИМУМ(Комментарий),
	               |	МАКСИМУМ(НомерСтроки),
	               |	МАКСИМУМ(НомерКД),
	               |	МАКСИМУМ(Дата),
	               |	МАКСИМУМ(КурсДокумента),
	               |	МАКСИМУМ(КратностьДокумента),
	               |	МАКСИМУМ(ВидОперации),
	               |	МАКСИМУМ(КорректировкаДолгаСсылка),
	               |	МАКСИМУМ(ЦФО),
	               |	МАКСИМУМ(Автор),
	               |	МАКСИМУМ(Ответственный),
	               |	МАКСИМУМ(ВалютаДокумента),
	               |	МАКСИМУМ(КонтрагентДебитор),
	               |	МАКСИМУМ(КонтрагентКредитор),
	               |	МАКСИМУМ(Организация),
				   |	МАКСИМУМ(ЗаказШапки),
				   |	МАКСИМУМ(ГУИДЗаказаШапки),
				   |	МАКСИМУМ(КорДоговор),
				   |	СУММА(Сумма),
				   |	СУММА(СуммаВзаиморасчетов)  
				   //Евросиб Дубская 22.05.2023 ( Ticket#0294896
				   |   	,
				   |   	МАКСИМУМ(ДатаКурса) 
				   //Евросиб Дубская 22.05.2023 )
	               |ПО
	               |	ГУИДКД";
	Запрос.УстановитьПараметр("ТабКД", СтруктураДанных.ТабКД);
	Запрос.УстановитьПараметр("ТабТЧКД", СтруктураДанных.ТабТЧКД);
	Запрос.УстановитьПараметр("Организация", Организация);
#КонецОбласти
	ВыборкаШапка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаШапка.Следующий() Цикл
	
		Ошибки = "";
		Отказ = Ложь;
		Если ЗначениеЗаполнено(ВыборкаШапка.КорректировкаДолгаСсылка) Тогда
			КДОбъект = ВыборкаШапка.КорректировкаДолгаСсылка.ПолучитьОбъект();
			КДОбъект.ДебиторскаяЗадолженность.Очистить();
			КДОбъект.КредиторскаяЗадолженность.Очистить();
			//Евросиб Каблов 16.06.2021 ( Ticket#0235050
			КДСсылка = ВыборкаШапка.КорректировкаДолгаСсылка;
			//Евросиб Каблов 16.06.2021 )
		Иначе	
			КДОбъект = Документы.КорректировкаДолга.СоздатьДокумент();
			//Евросиб Каблов 16.06.2021 ( Ticket#0235050
			КДСсылка = Документы.КорректировкаДолга.ПолучитьСсылку(Новый УникальныйИдентификатор);
			КДОбъект.УстановитьСсылкуНового(КДСсылка);
			//Евросиб Каблов 16.06.2021 )
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(КДОбъект, ВыборкаШапка);
		//Евросиб Каблов 19.11.2020 (
		//КДОбъект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя;
		Если ВыборкаШапка.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности Тогда
			ВыборкаСтрока = ВыборкаШапка.Выбрать();
			Если ВыборкаСтрока.Следующий() Тогда
				Если ВыборкаСтрока.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
					Если ВыборкаСтрока.ВидЗадолженности = "ДебиторскаяЗадолженность" Тогда
						КДОбъект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику;
					Иначе
						КДОбъект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику;
					КонецЕсли;
				Иначе
					Если ВыборкаСтрока.ВидЗадолженности = "ДебиторскаяЗадолженность" Тогда
						КДОбъект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя;
					Иначе
						КДОбъект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		//Евросиб Каблов 17.06.2021 (
		ИначеЕсли ВыборкаШапка.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности Тогда
			Если ЗначениеЗаполнено(ВыборкаШапка.ГУИДЗаказаШапки) Тогда
				КДОбъект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.Прочее;
			Иначе
				ВыборкаСтрока = ВыборкаШапка.Выбрать();
				Если ВыборкаСтрока.Следующий() Тогда
					Если ВыборкаСтрока.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
						Если ВыборкаСтрока.ВидЗадолженности = "ДебиторскаяЗадолженность" Тогда
							КДОбъект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику;
						Иначе
							КДОбъект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику;
						КонецЕсли;
					Иначе
						Если ВыборкаСтрока.ВидЗадолженности = "ДебиторскаяЗадолженность" Тогда
							КДОбъект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя;
						Иначе
							КДОбъект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		//Евросиб Каблов 17.06.2021 ) 
		Иначе
			КДОбъект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя;
		КонецЕсли;		
		//Евросиб Каблов 19.11.2020 )
		КДОбъект.Комментарий = ВыборкаШапка.Комментарий + " Загружен из УПП " + ТекущаяДата() + " №" + ВыборкаШапка.НомерКД + " от " + Формат(ВыборкаШапка.Дата, "ДЛФ=Д");
		
		//Евросиб Дубская 22.05.2023 ( Ticket#0294896   
		ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить();
		//Евросиб Дубская 22.05.2023 )
		
		ВыборкаСтрока = ВыборкаШапка.Выбрать();
		Пока ВыборкаСтрока.Следующий() Цикл
			НоваяСтрока = КДОбъект[ВыборкаСтрока.ВидЗадолженности].Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСтрока);  
			// ДИТ Сержантова А.С. 02.04.2024 (Ticket#0336753  
			Если НЕ КДОбъект.ВалютаДокумента = ВалютаРегл 
				и ВыборкаСтрока.ИспользоватьКурс 
				И ЗначениеЗаполнено(НоваяСтрока.КорДоговорКонтрагента) Тогда   
				ВалютаРасчетов = НоваяСтрока.КорДоговорКонтрагента.ВалютаВзаиморасчетов;
			    НоваяСтрока.СуммаВзаиморасчетов = РаботаСКурсамиВалют.ПересчитатьВВалюту(НоваяСтрока.СуммаВзаиморасчетов, 
											ВалютаРегл, ВалютаРасчетов, ВыборкаШапка.Дата, ВыборкаСтрока.КурсПереноса, , );   
			Иначе
			// ДИТ Сержантова А.С. 02.04.2024)
			//Евросиб Дубская 22.05.2023 ( Ticket#0294896   
			Если НЕ КДОбъект.ВалютаДокумента = ВалютаРегл 
				И ЗначениеЗаполнено(ВыборкаШапка.ДатаВзаиморасчетов) 
				И ЗначениеЗаполнено(НоваяСтрока.КорДоговорКонтрагента) Тогда 
				// Евросиб(ДИТ) Ticket#0335775 US 78995 ТА 86346 Сержантова А.С. Начало: 14.06.2024
				Если ВыборкаШапка.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности
					//Евросиб Пирожкова( 30.07.2025 Ticket№0406227
					И НЕ ВыборкаСтрока.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем 
					И НЕ ВыборкаСтрока.КорДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем
					// Евросиб Пирожкова 30.07.2025)
					//Евросиб Пирожкова 03.07.2024 ( Ticket#0357832 
					И НЕ НоваяСтрока.ДоговорКонтрагента.ВалютаВзаиморасчетов = ВалютаРегл
					И НЕ НоваяСтрока.КорДоговорКонтрагента.ВалютаВзаиморасчетов = ВалютаРегл Тогда   
					//не пересчитываем - с УПП летят корректные суммы 
					//Евросиб Пирожкова 03.07.2024 ) 
				Иначе
				//Евросиб(ДИТ) Ticket#0335775 US 78995 ТА 86346 Сержантова А.С. Конец: 14.06.2024
					ВалютаРасчетов = НоваяСтрока.КорДоговорКонтрагента.ВалютаВзаиморасчетов;
					ПараметрыТекущегоКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаРегл, ВыборкаШапка.ДатаВзаиморасчетов);
					ПараметрыНовогоКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаРасчетов, ВыборкаШапка.ДатаВзаиморасчетов);
					НоваяСтрока.СуммаВзаиморасчетов = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(НоваяСтрока.СуммаВзаиморасчетов, ПараметрыТекущегоКурса, ПараметрыНовогоКурса);
				// Евросиб(ДИТ) Ticket#0335775 US 78995 ТА 86346 Сержантова А.С. Начало: 14.06.2024
				КонецЕсли;
				// Евросиб(ДИТ) Ticket#0335775 US 78995 ТА 86346 Сержантова А.С. Конец: 14.06.2024	
			КонецЕсли;
			//Евросиб Дубская 22.05.2023 )  
			// ДИТ Сержантова А.С. 02.04.2024 (Ticket#0336753  
			КонецЕсли;
			// ДИТ Сержантова А.С. 02.04.2024)
			
			//Евросиб Каблов 10.02.2021 ( Ticket#0222228
			Если Не ЗначениеЗаполнено(НоваяСтрока.Сделка) Тогда
				//Евросиб Каблов 16.06.2021 ( Ticket#0235050
				//Ошибки = Ошибки + СтрШаблон("По идентификатору %1 не найден документ расчетов!", ВыборкаСтрока.ГУИДСделки) + Символы.ПС;
				НоваяСтрока.Сделка = КДСсылка;
				//Евросиб Каблов 16.06.2021 )
			КонецЕсли;
			//Евросиб(ДИТ), Беляев СЮ, BUG 106982 / TA 106985, 18-04-2025, начало
			НоваяСтрока.СтавкаНДС = ВзаиморасчетыСервер.ПолучитьСтавкуНДСдляДокумента(НоваяСтрока.Сделка);
			//Евросиб(ДИТ), Беляев СЮ, BUG 106982 / TA 106985, 18-04-2025, конец
			Если Не ЗначениеЗаполнено(НоваяСтрока.ДокументРасшифровка) Тогда
				ТипСделки = ТипЗнч(НоваяСтрока.Сделка);
				Если ТипСделки = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Или ТипСделки = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
					НоваяСтрока.ДокументРасшифровка = НоваяСтрока.Сделка;
				КонецЕсли;
			КонецЕсли; 
			//Евросиб Каблов 10.02.2021 ) 
			//Евросиб Каблов 10.11.2021 ( Ticket#0248191
			Если Не ЗначениеЗаполнено(НоваяСтрока.ДокументРасшифровка) И ЗначениеЗаполнено(ВыборкаСтрока.ЗаказПредставление) Тогда
				Ошибки = Ошибки + "В Датакоре не найден счет для документа УПП " + ВыборкаСтрока.ЗаказПредставление + Символы.ПС; 
			КонецЕсли;
			//Евросиб Каблов 10.11.2021 )
		КонецЦикла;
		КДОбъект.СуммаДтЗадолженности = КДОбъект.ДебиторскаяЗадолженность.Итог("СуммаВзаиморасчетов");
		КДОбъект.СуммаКтЗадолженности = КДОбъект.КредиторскаяЗадолженность.Итог("СуммаВзаиморасчетов");
		
		//Евросиб Каблов 21.06.2021 ( Ticket#0235050
		Если ВыборкаШапка.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности И ЗначениеЗаполнено(ВыборкаШапка.ГУИДЗаказаШапки) Тогда
			// Евросиб(ДИТ) Ticket#0335775 US 78995 ТА 86346 Сержантова А.С. Начало: 17.06.2024
			ВалютаКорДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаШапка.КорДоговор, "ВалютаВзаиморасчетов"); 
			ПараметрыТекущегоКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаРегл, ВыборкаШапка.ДатаВзаиморасчетов);
			ПараметрыНовогоКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаКорДоговора, ВыборкаШапка.ДатаВзаиморасчетов);
			// Евросиб(ДИТ) Ticket#0335775 US 78995 ТА 86346 Сержантова А.С. Конец: 17.06.2024
			Если КДОбъект.СуммаДтЗадолженности <> 0 Тогда
				НоваяСтрока = КДОбъект.КредиторскаяЗадолженность.Добавить();
				НоваяСтрока.ДоговорКонтрагента = ВыборкаШапка.КорДоговор;
				//НоваяСтрока.КурсВзаиморасчетов = ВыборкаШапка.КурсДокумента;
				//НоваяСтрока.КратностьВзаиморасчетов = ВыборкаШапка.КратностьДокумента;
				НоваяСтрока.Сделка = КДСсылка;
				//НоваяСтрока.Сумма = КДОбъект.ДебиторскаяЗадолженность.Итог("Сумма");
				НоваяСтрока.СуммаВзаиморасчетов = КДОбъект.СуммаДтЗадолженности;
				НоваяСтрока.ДокументРасшифровка = ВыборкаШапка.ЗаказШапки;  
				// Евросиб(ДИТ) Ticket#0335775 US 78995 ТА 86346 Сержантова А.С. Начало: 17.06.2024
				НоваяСтрока.КурсВзаиморасчетов = ПараметрыНовогоКурса.Курс;
				НоваяСтрока.КратностьВзаиморасчетов = ПараметрыНовогоКурса.Кратность; 
				СуммаКПересчету = КДОбъект.ДебиторскаяЗадолженность.Итог("СуммаВзаиморасчетов");
				НоваяСтрока.Сумма = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(СуммаКПересчету, ПараметрыТекущегоКурса, ПараметрыНовогоКурса);
				// Евросиб(ДИТ) Ticket#0335775 US 78995 ТА 86346 Сержантова А.С. Конец: 17.06.2024
			ИначеЕсли КДОбъект.СуммаКтЗадолженности <> 0 Тогда
				НоваяСтрока = КДОбъект.КредиторскаяЗадолженность.Добавить();
				НоваяСтрока.ДоговорКонтрагента = ВыборкаШапка.КорДоговор;
				//НоваяСтрока.КурсВзаиморасчетов = ВыборкаШапка.КурсДокумента;
				//НоваяСтрока.КратностьВзаиморасчетов = ВыборкаШапка.КратностьДокумента;
				НоваяСтрока.Сделка = КДСсылка;
				//НоваяСтрока.Сумма = КДОбъект.КредиторскаяЗадолженность.Итог("Сумма");
				НоваяСтрока.СуммаВзаиморасчетов = КДОбъект.СуммаКтЗадолженности;
				НоваяСтрока.ДокументРасшифровка = ВыборкаШапка.ЗаказШапки;  
				// Евросиб(ДИТ) Ticket#0335775 US 78995 ТА 86346 Сержантова А.С. Начало: 17.06.2024
				НоваяСтрока.КурсВзаиморасчетов = ПараметрыНовогоКурса.Курс;
				НоваяСтрока.КратностьВзаиморасчетов = ПараметрыНовогоКурса.Кратность; 
				СуммаКПересчету = КДОбъект.КредиторскаяЗадолженность.Итог("СуммаВзаиморасчетов");
				НоваяСтрока.Сумма = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(СуммаКПересчету, ПараметрыТекущегоКурса, ПараметрыНовогоКурса);
				// Евросиб(ДИТ) Ticket#0335775 US 78995 ТА 86346 Сержантова А.С. Конец: 17.06.2024
			КонецЕсли;
		КонецЕсли;
		//Евросиб Каблов 21.06.2021 )
		
		ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(КДОбъект, 
				?(КДОбъект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности, СтруктураОбязательныхРеквизитовШапки, СтруктураОбязательныхРеквизитовШапкиСписание),
				Отказ, Ошибки, Ложь);
		ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(КДОбъект, "КредиторскаяЗадолженность", 
				?(КДОбъект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности, СтруктураОбязательныхРеквизитовТЧ, СтруктураОбязательныхРеквизитовТЧСписание),
				Отказ, Ошибки, Ложь);
		ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(КДОбъект, "ДебиторскаяЗадолженность",
				?(КДОбъект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности, СтруктураОбязательныхРеквизитовТЧ, СтруктураОбязательныхРеквизитовТЧСписание),
				Отказ, Ошибки, Ложь);
		
		Если Не Отказ Тогда
			НачатьТранзакцию();
			Попытка
				Если КДОбъект.ПометкаУдаления Тогда
					КДОбъект.ПометкаУдаления = Ложь;
				КонецЕсли; 
				КДОбъект.Записать(РежимЗаписиДокумента.Проведение);
				//добавляем историю в регистр загрузок
				СтруктураПоиска = Новый Структура("ДействиеПриОбмене, УзелОбмена, Объект", Перечисления.ДействияПриОбмене.ЗагрузкаДанных, 
												Перечисления.УзлыОбмена.УПП, КДОбъект.Ссылка);
				//Евросиб СубботинВ #83828 10.09.2024 Начало // добавил заполнение номера и даты ВБУ								
				СтруктураДанных = Новый Структура("УИДИсточника, Ответственный, НомерДатаВБУ", ВыборкаШапка.ГУИДКД,
																							   КДОбъект.Ответственный, Строка(КДОбъект.Номер + " от " + Формат(КДОбъект.Дата,"ДФ=dd.MM.yyyy")));
				//Евросиб СубботинВ #83828 10.09.2024 Конец
				РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных);
				
				ЗафиксироватьТранзакцию();
			Исключение
				Ошибки = Ошибки + "Не удалось записать документ " + ОписаниеОшибки();
				ОтменитьТранзакцию();
				Отказ = Истина;
			КонецПопытки;
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Ошибки) Тогда
			СтрокаТЗРезультата = ТЗРезультат.Добавить();
			СтрокаТЗРезультата.ГУИДКД = ВыборкаШапка.ГУИДКД;
			СтрокаТЗРезультата.Комментарий = Ошибки;
			СтрокаТЗРезультата.НомерСтроки = ВыборкаШапка.НомерСтроки;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(ТЗРезультат);
	
КонецФункции // СоздатьКД(XMLParams)

Функция СоздатьБанковскиеВыписки(XMLParams) Экспорт

	ТЗРезультат = Новый ТаблицаЗначений;
	ТЗРезультат.Колонки.Добавить("ГУИДППБФ");
	ТЗРезультат.Колонки.Добавить("Комментарий");
	ТЗРезультат.Колонки.Добавить("НомерСтроки");
	
	СтруктураОбязательныхРеквизитовШапкиПоступление = Новый Структура("Организация, Контрагент, ДатаВзаиморасчетов, ДатаВходящегоДокумента, НомерВходящегоДокумента, 
	|ЦФО, ВалютаДокумента, Дата, ВидОперации");
	СтруктураОбязательныхРеквизитовТЧ = Новый Структура("ДоговорКонтрагента, КурсВзаиморасчетов, КратностьВзаиморасчетов, СуммаПлатежа, СуммаВзаиморасчетов, СтавкаНДС");
	СтруктураОбязательныхРеквизитовШапкиСписание = Новый Структура("Организация, Контрагент, ДатаВзаиморасчетов, ВидОперации, 
	|ЦФО, ВалютаДокумента, Дата");
	
	СтруктураДанных = ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	Организация = Справочники.Организации.НайтиПоКоду(СтруктураДанных.ОрганизацияКод);
	//Евросиб Каблов 12.08.2020 (
	Проводить = Истина;
	Если СтруктураДанных.Свойство("Проводить") И ТипЗнч(СтруктураДанных.Проводить) = Тип("Булево") Тогда
		Проводить = СтруктураДанных.Проводить;
	КонецЕсли;
	//Евросиб Каблов 12.08.2020 )
	Ошибки = "";
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Ошибки = "Не найдена организация!";
		Для каждого СтрокаДанных Из СтруктураДанных.ТабВыписки Цикл
				СтрокаТЗРезультата = ТЗРезультат.Добавить();
				СтрокаТЗРезультата.Комментарий = Ошибки;
				СтрокаТЗРезультата.НомерСтроки = СтрокаДанных.НомерСтроки;
				СтрокаТЗРезультата.ГУИДППБФ = СтрокаДанных.ГУИДППБФ;
		КонецЦикла; 
		Возврат ТЗРезультат;
	КонецЕсли; 
	
#Область Запрос
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТабВыписки.НомерСтроки КАК НомерСтроки,
	               |	ТабВыписки.ГУИДППБФ КАК ГУИДППБФ,
	               |	ТабВыписки.ГУИДППУПП КАК ГУИДППУПП,
	               |	ТабВыписки.Дата КАК Дата,
	               |	ТабВыписки.Номер КАК Номер,
	               |	ТабВыписки.ПодразделениеКод КАК ПодразделениеКод,
	               |	ПОДСТРОКА(ТабВыписки.Комментарий, 1, 1000) КАК Комментарий,
	               |	ТабВыписки.ОтветственныйНаименование КАК ОтветственныйНаименование,
	               |	ТабВыписки.ВалютаДокументаКод КАК ВалютаДокументаКод,
	               |	ТабВыписки.УИДКонтрагента КАК УИДКонтрагента,
	               |	ТабВыписки.УИДДоговораКонтрагента КАК УИДДоговораКонтрагента,
	               |	ТабВыписки.ВидОперации КАК ВидОперации,
	               |	ТабВыписки.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	               |	ТабВыписки.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	               |	ТабВыписки.Оплачено КАК Оплачено,
	               |	ТабВыписки.ДатаОплаты КАК ДатаОплаты,
	               |	ТабВыписки.СтатьяДвиженияДенежныхСредствКод КАК СтатьяДвиженияДенежныхСредствКод,
	               |	ТабВыписки.СуммаДокумента КАК СуммаДокумента,
	               |	ПОДСТРОКА(ТабВыписки.НазначениеПлатежа, 1, 1000) КАК НазначениеПлатежа,
	               |	ПОДСТРОКА(ТабВыписки.КомментарийБухгалтерии, 1, 1000) КАК КомментарийБухгалтерии,
	               |	ТабВыписки.СчетОрганизации КАК НомерСчета,
	               |	ТабВыписки.ЭтоПоступлениеДС КАК ЭтоПоступлениеДС
	               |ПОМЕСТИТЬ ТабВыписки
	               |ИЗ
	               |	&ТабВыписки КАК ТабВыписки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТабТЧВыписки.ГУИДППБФ КАК ГУИДППБФ,
	               |	ТабТЧВыписки.ГУИДППУПП КАК ГУИДППУПП,
	               |	ТабТЧВыписки.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	               |	ТабТЧВыписки.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	               |	ТабТЧВыписки.УИДДоговораКонтрагента КАК УИДДоговораКонтрагента,
	               |	ТабТЧВыписки.НомерСтроки КАК НомерСтроки,
	               |	ТабТЧВыписки.ГУИДОснованияПлатежа КАК ГУИДОснованияПлатежа,
	               |	ТабТЧВыписки.СтатьяДвиженияДенежныхСредствКод КАК СтатьяДвиженияДенежныхСредствКод,
	               |	ТабТЧВыписки.СуммаПлатежа КАК СуммаПлатежа,
	               |	ТабТЧВыписки.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	               |	ТабТЧВыписки.СтавкаНДС КАК СтавкаНДС,
				   |	ТабТЧВыписки.СуммаНДС КАК СуммаНДС,
				   //Евросиб Субботин 92530 22.10.2024 начало
				   |	Выразить(ТабТЧВыписки.ЗаявкаНаОплату КАК СТРОКА(36)) как ЗаявкаНаОплату
				   //Евросиб Субботин 92530 22.10.2024 Конец				   
	               |ПОМЕСТИТЬ ТабТЧВыписки
	               |ИЗ
	               |	&ТабТЧВыписки КАК ТабТЧВыписки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТабВыписки.ГУИДППБФ КАК ГУИДППБФ,
	               |	ТабВыписки.ГУИДППУПП КАК ГУИДППУПП,
	               |	ТабВыписки.НомерСтроки КАК ПорядковыйНомерПП,
	               |	ТабВыписки.Номер КАК Номер,
	               |	ТабВыписки.Дата КАК Дата,
	               |	ЦентрыФинансовойОтветственности.Ссылка КАК ЦФО,
	               |	Подразделения.Ссылка КАК ПодразделениеОрганизации,
	               |	ТабВыписки.Комментарий КАК Комментарий,
	               |	ЕСТЬNULL(Пользователи.Ссылка, &Пользователь) КАК Автор,
	               |	Пользователи.Ссылка КАК Ответственный,
	               |	Валюты.Ссылка КАК ВалютаДокумента,
	               |	Контрагенты.Объект КАК Контрагент,
	               |	ДоговорыКонтрагентовШапка.Объект КАК ДоговорКонтрагентаШапка,
	               |	ТабВыписки.ВидОперации КАК ВидОперации,
	               |	ЗагруженныеПП.Объект КАК ППСсылка,
	               |	&Организация КАК Организация,
	               |	ТабВыписки.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	               |	ТабВыписки.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	               |	ТабВыписки.Оплачено КАК Оплачено,
	               |	СтатьиДвиженияДенежныхСредствШапка.Ссылка КАК СтатьяДвиженияДенежныхСредствШапка,
	               |	ТабВыписки.ДатаОплаты КАК ДатаВзаиморасчетов,
	               |	ТабВыписки.СуммаДокумента КАК СуммаДокумента,
	               |	ТабВыписки.НазначениеПлатежа КАК НазначениеПлатежа,
	               |	ИСТИНА КАК ТребуетсяАвтоматическоеРазнесениеПоСчетам,
	               |	ИСТИНА КАК Маршрутизировать,
	               |	ТабТЧВыписки.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	               |	ТабТЧВыписки.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	               |	ТабТЧВыписки.СуммаПлатежа КАК СуммаПлатежа,
	               |	ТабТЧВыписки.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	               |	ДоговорыКонтрагентов.Объект КАК ДоговорКонтрагента,
	               |	ЕСТЬNULL(СделкиПТУ.Объект, СделкиСчета.Объект) КАК Сделка,
	               |	ТабТЧВыписки.СтавкаНДС КАК СтавкаНДС,
	               |	ТабТЧВыписки.СуммаНДС КАК СуммаНДС,
	               |	СтатьиДвиженияДенежныхСредств.Ссылка КАК СтатьяДвиженияДенежныхСредств,
	               |	ТабТЧВыписки.НомерСтроки КАК НомерСтроки,
	               |	ТабВыписки.ЭтоПоступлениеДС КАК ЭтоПоступлениеДС,
	               |	ТабВыписки.КомментарийБухгалтерии КАК КомментарийБухгалтерии,
	               |	БанковскиеСчета.Ссылка КАК СчетОрганизации
//Евросиб Коханенко Н.А. Ticket#0306079 29.03.2023 ((
	               |	,ТабВыписки.ПодразделениеКод КАК ПодразделениеКод
//Евросиб Коханенко Н.А. Ticket#0306079 29.03.2023 ))
				   //Евросиб Субботин 92530 22.10.2024 начало
				   |	,ПротоколОбменов.Объект как ЗаявкаНаОплату
				   //Евросиб Субботин 92530 22.10.2024 Конец				   

	               |ИЗ
	               |	ТабВыписки КАК ТабВыписки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ЗагруженныеПП
	               |		ПО (ЗагруженныеПП.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	               |			И (ЗагруженныеПП.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	               |			И ТабВыписки.ГУИДППУПП = ЗагруженныеПП.УИДИсточника
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦентрыФинансовойОтветственности КАК ЦентрыФинансовойОтветственности
	               |		ПО ТабВыписки.ПодразделениеКод = ЦентрыФинансовойОтветственности.Код
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	               |		ПО ТабВыписки.ОтветственныйНаименование = Пользователи.Наименование
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	               |		ПО ТабВыписки.ВалютаДокументаКод = Валюты.Код
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Подразделения КАК Подразделения
	               |		ПО ТабВыписки.ПодразделениеКод = Подразделения.Код
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Контрагенты
	               |		ПО ТабВыписки.УИДКонтрагента = Контрагенты.УИДИсточника
	               |			И (Контрагенты.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	               |			И (Контрагенты.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ДоговорыКонтрагентовШапка
	               |		ПО ТабВыписки.УИДДоговораКонтрагента = ДоговорыКонтрагентовШапка.УИДИсточника
	               |			И (ДоговорыКонтрагентовШапка.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	               |			И (ДоговорыКонтрагентовШапка.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабТЧВыписки КАК ТабТЧВыписки
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ДоговорыКонтрагентов
	               |			ПО ТабТЧВыписки.УИДДоговораКонтрагента = ДоговорыКонтрагентов.УИДИсточника
	               |				И (ДоговорыКонтрагентов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	               |				И (ДоговорыКонтрагентов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК СделкиПТУ
	               |			ПО ТабТЧВыписки.ГУИДОснованияПлатежа = СделкиПТУ.УИДИсточника
//Евросиб Гудкова( 27.01.2021 Ticket№ 0221295	               |				И (СделкиПТУ.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
	               |				И (СделкиПТУ.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УППЗаказ))
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК СделкиСчета
	               |			ПО ТабТЧВыписки.ГУИДОснованияПлатежа = СделкиСчета.УИДИсточника
	               |				И (СделкиСчета.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	               |				И (СделкиСчета.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
				   |			ПО ТабТЧВыписки.СтатьяДвиженияДенежныхСредствКод = СтатьиДвиженияДенежныхСредств.Код
				   //Евросиб Субботин 92530 22.10.2024 начало
				   |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
				   |			ПО ТабТЧВыписки.ЗаявкаНаОплату = ПротоколОбменов.УИДИсточника
				   //Евросиб Субботин 92530 22.10.2024 Конец
				   |		ПО ТабВыписки.ГУИДППУПП = ТабТЧВыписки.ГУИДППУПП
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредствШапка
	               |		ПО ТабВыписки.СтатьяДвиженияДенежныхСредствКод = СтатьиДвиженияДенежныхСредствШапка.Код
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	               |		ПО ТабВыписки.НомерСчета = БанковскиеСчета.НомерСчета
	               |			И (БанковскиеСчета.Владелец = &Организация)
	               |			И (НЕ БанковскиеСчета.ПометкаУдаления)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ГУИДППУПП,
	               |	НомерСтроки";  
	//Евросиб(ДИТ), Беляев СЮ, US 95442 / TA 95565, 14-11-2024, начало
	Если СтруктураДанных.ТабТЧВыписки.Колонки.Найти("ЗаявкаНаОплату") = Неопределено Тогда
		СтруктураДанных.ТабТЧВыписки.Колонки.Добавить("ЗаявкаНаОплату", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(36)));
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 95442 / TA 95565, 14-11-2024, конец
	Запрос.УстановитьПараметр("ТабВыписки", СтруктураДанных.ТабВыписки);
	Запрос.УстановитьПараметр("ТабТЧВыписки", СтруктураДанных.ТабТЧВыписки);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
#КонецОбласти 	
	ВыборкаШапка = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаШапка.СледующийПоЗначениюПоля("ГУИДППУПП") Цикл
	
		Ошибки = "";
		Отказ = Ложь;
		
		Если ЗначениеЗаполнено(ВыборкаШапка.ППСсылка) Тогда
			ППОбъект = ВыборкаШапка.ППСсылка.ПолучитьОбъект();
			
			Если ТипЗнч(ППОбъект) = Тип("ДокументОбъект.ПоступлениеНаРасчетныйСчет") Тогда
				//Евросиб Каблов 23.11.2020 (
				//Для Каждого СтрокаОплаты Из ППОбъект.ДокументыОплаты Цикл
				ТаблицаПривязокОплат = ППОбъект.ДокументыОплаты.Выгрузить(, "ДокументРеализации, СуммаОплаты");
				ТаблицаПривязокОплат.Свернуть("ДокументРеализации", "СуммаОплаты");
				Для Каждого СтрокаОплаты Из ТаблицаПривязокОплат Цикл
					Если ЗначениеЗаполнено(СтрокаОплаты.СуммаОплаты) Тогда
						Ошибки = "По платежному поручению есть привязка оплат! Загрузка не выполнена.";
						Отказ = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				//Евросиб Каблов 23.11.2020 )
			КонецЕсли;
			
			Если Не Отказ Тогда
				ППОбъект.РасшифровкаПлатежа.Очистить();
//Евросиб Гудкова( 09.07.2020
// Субботин 79718 //16.01.2024 начало убрал очистку состояний
			//	ППОбъект.Состояния.Очистить();
// Субботин 79718 //16.01.2024 Конец				
				Если ТипЗнч(ППОбъект) = Тип("ДокументОбъект.ПоступлениеНаРасчетныйСчет") Тогда
					//Евросиб Каблов 03.06.2021 ( Ticket#0233084 Ошибка: после повторной загрузки ПП, загруженные оплаты очистились.
					//ППОбъект.ДокументыОплаты.Очистить();
					//Евросиб Каблов 03.06.2021 )
					
					//Евросиб Каблов 26.08.2022 ( Ticket#0280983
					//ППОбъект.РазнесениеНаСчетаПокупателям.Очистить();
					////Евросиб Каблов 16.02.2021 ( Ticket#0223159
					//ППОбъект.ВыполненаПопыткаРазнесения = Ложь;
					//ППОбъект.УспешноРазнесенаВсяСумма = Ложь;
					////Евросиб Каблов 16.02.2021 )
					//Евросиб Каблов 26.08.2022 )
				КонецЕсли;				
// Евросиб Гудкова)
			КонецЕсли;

		ИначеЕсли ВыборкаШапка.ЭтоПоступлениеДС Тогда	
			ППОбъект = Документы.ПоступлениеНаРасчетныйСчет.СоздатьДокумент();
		Иначе
			ППОбъект = Документы.СписаниеСРасчетногоСчета.СоздатьДокумент();
		КонецЕсли;
		
		//Евросиб Коханенко Н.А. Ticket#0306079 29.03.2023 (( 
		//Если ЗначениеЗаполнено(ВыборкаШапка.ПодразделениеКод) И НЕ ЗначениеЗаполнено(ВыборкаШапка.ЦФО) Тогда
		//	//во входящей строке XML код подразделения присутствует, значит сообщение должно быть другое
		//	Ошибки = "Не найдено соответствие подразделения в DataCore. Код подразделения: " + СокрЛП(ВыборкаШапка.ПодразделениеКод);
		//	Отказ = Истина;
		//КонецЕсли;
		//Евросиб Коханенко Н.А. Ticket#0306079 29.03.2023 )) 

		Если Не Отказ Тогда
			ЗаполнитьЗначенияСвойств(ППОбъект, ВыборкаШапка);
			// Субботин 75328 22.09.2023 Начало
			Если ЗначениеЗаполнено(ППОбъект.ДоговорКонтрагента) тогда
				РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ППОбъект.ДоговорКонтрагента,"РасчетыВУсловныхЕдиницах, ВалютаВзаиморасчетов");
				Если РеквизитыДоговора.РасчетыВУсловныхЕдиницах тогда
					ППОбъект.ВалютаДокумента = РеквизитыДоговора.ВалютаВзаиморасчетов;
				КонецЕсли;
			КонецЕсли;
			// Субботин 75328 22.09.2023 конец
			ППОбъект.Комментарий = ВыборкаШапка.Комментарий + " Загружен из УПП " + ТекущаяДата();
			//Евросиб Гудкова( 12.12.2019 
			Если ТипЗнч(ППОбъект) = Тип("ДокументОбъект.СписаниеСРасчетногоСчета") Тогда
				Если ВыборкаШапка.ВидОперации = "Оплата поставщику" Тогда
					ППОбъект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику;
				Иначе
					ППОбъект.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ВозвратПокупателю;
				КонецЕсли; 
			Иначе
				Если ВыборкаШапка.ВидОперации = "Оплата от покупателя" Тогда
					ППОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя;
				Иначе
					ППОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ВозвратОтПоставщика;
				КонецЕсли;
				//ДИТ Шевченко А.В. US 59973 ТА 71435 29.08.2023 +
				Если ВыборкаШапка.ВидОперации = "Прочее поступление безналичных денежных средств" Тогда
					ППОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя;
				КонецЕсли;
				//ДИТ Шевченко А.В. US 59973 ТА 71435 29.08.2023 -
			КонецЕсли;
			// Евросиб Гудкова) 
			
			Пока ВыборкаШапка.СледующийПоЗначениюПоля("НомерСтроки") Цикл
				НоваяСтрока = ППОбъект.РасшифровкаПлатежа.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаШапка);
			КонецЦикла;
			
			//Евросиб Каблов 17.11.2020 (
			Если Проводить Тогда
			//Евросиб Каблов 17.11.2020 )
				ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ППОбъект, 
						?(ВыборкаШапка.ЭтоПоступлениеДС, СтруктураОбязательныхРеквизитовШапкиПоступление, СтруктураОбязательныхРеквизитовШапкиСписание),
						Отказ, Ошибки, Ложь);
				ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ППОбъект, "РасшифровкаПлатежа", 
						СтруктураОбязательныхРеквизитовТЧ, Отказ, Ошибки, Ложь);
			КонецЕсли;
					
			//Евросиб Каблов 26.08.2022 ( Ticket#0280983
			Если Не ППОбъект.ЭтоНовый() И ТипЗнч(ППОбъект) = Тип("ДокументОбъект.ПоступлениеНаРасчетныйСчет") Тогда
				
				Запрос = Новый Запрос;
            	Запрос.Текст =
				"ВЫБРАТЬ
				|	СУММА(РасшифровкаПлатежа.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов
				|ИЗ
				|	Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК РасшифровкаПлатежа
				|ГДЕ
				|	РасшифровкаПлатежа.Ссылка = &Ссылка";
				Запрос.УстановитьПараметр("Ссылка", ППОбъект.Ссылка);
				
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.СуммаВзаиморасчетов) Тогда
					ПрежняяСумма = Выборка.СуммаВзаиморасчетов;
				Иначе
					ПрежняяСумма = 0;
				КонецЕсли;
				
				ТекСумма = ППОбъект.РасшифровкаПлатежа.Итог("СуммаВзаиморасчетов");
				
				Если ПрежняяСумма <> ТекСумма Тогда
					ППОбъект.РазнесениеНаСчетаПокупателям.Очистить();
					ППОбъект.ВыполненаПопыткаРазнесения = Ложь;
					ППОбъект.УспешноРазнесенаВсяСумма = Ложь;
				КонецЕсли;
					
			КонецЕсли;
			//Евросиб Каблов 26.08.2022 )
			
			Если Не Отказ Тогда
				НачатьТранзакцию();
				Попытка
					Если ППОбъект.ПометкаУдаления Тогда
						ППОбъект.ПометкаУдаления = Ложь;
					КонецЕсли;
					//Евросиб Каблов 12.08.2020 (
					//ППОбъект.Записать(РежимЗаписиДокумента.Проведение);
					//ДИТ, Беляев СЮ, BUG 82027 / TA 82906, 25-03-2024, начало (если документ есть в базе и он проведён, то обязательно перепроводим)
					Если ППОбъект.Проведен Тогда
						Проводить = Истина;
					КонецЕсли;
					//ДИТ, Беляев СЮ, BUG 82027 / TA 82906, 25-03-2024, конец
					Если Проводить Тогда
						ППОбъект.Записать(РежимЗаписиДокумента.Проведение);
					Иначе
						ППОбъект.Записать(РежимЗаписиДокумента.Запись);
					КонецЕсли;
					//Евросиб Каблов 12.08.2020 )
					//добавляем историю в регистр загрузок
					СтруктураПоиска = Новый Структура("ДействиеПриОбмене, УзелОбмена, Объект", Перечисления.ДействияПриОбмене.ЗагрузкаДанных, 
													Перечисления.УзлыОбмена.УПП, ППОбъект.Ссылка);
					СтруктураДанных = Новый Структура("УИДИсточника, Ответственный", ВыборкаШапка.ГУИДППУПП,  ППОбъект.Автор);
					РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных);
					
					СтруктураПоиска = Новый Структура("ДействиеПриОбмене, УзелОбмена, Объект", Перечисления.ДействияПриОбмене.ЗагрузкаДанных, 
													Перечисления.УзлыОбмена.БитФинанс, ППОбъект.Ссылка);
					СтруктураДанных = Новый Структура("УИДИсточника, Ответственный", ВыборкаШапка.ГУИДППБФ,  ППОбъект.Автор);
					РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных);
					
					ЗафиксироватьТранзакцию();
				Исключение
					Ошибки = Ошибки + "Не удалось записать документ " + ОписаниеОшибки();
					ОтменитьТранзакцию();
					Отказ = Истина;
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		
		//Евросиб Каблов 07.08.2020 (
		Если ЗначениеЗаполнено(Ошибки) Тогда
		//Евросиб Каблов 07.08.2020 )
			СтрокаТЗРезультата = ТЗРезультат.Добавить();
			СтрокаТЗРезультата.ГУИДППБФ = ВыборкаШапка.ГУИДППБФ;
			СтрокаТЗРезультата.Комментарий = Ошибки;
			СтрокаТЗРезультата.НомерСтроки = ВыборкаШапка.ПорядковыйНомерПП;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(ТЗРезультат);
	
КонецФункции // СоздатьБанковскиеВыписки(XMLParams)

Функция ЗаписатьКомментарийБухгалтерии(ИдентификаторДокумента, Комментарий) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗагруженныеПП.Объект КАК Объект
	|ИЗ
	|	РегистрСведений.ПротоколОбменов КАК ЗагруженныеПП
	|ГДЕ
	|	ЗагруженныеПП.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных)
	|	И ЗагруженныеПП.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП)
	|	И ЗагруженныеПП.УИДИсточника = &ИдентификаторДокумента";
	Запрос.УстановитьПараметр("ИдентификаторДокумента", ИдентификаторДокумента);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Ложь;
	Если Выборка.Следующий() Тогда
		ДокОбъект = Выборка.Объект.ПолучитьОбъект();
		ДокОбъект.КомментарийБухгалтерии = Комментарий;
		ДокОбъект.ОбменДанными.Загрузка = Истина;
		ДокОбъект.Записать();
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПодтвердитьЗагрузку(XMLParams) Экспорт

	ТЗДокументов =  ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	СтруктураПоиска = Новый Структура("ДействиеПриОбмене, УзелОбмена, Объект", Перечисления.ДействияПриОбмене.ВыгрузкаДанных, Перечисления.УзлыОбмена.УПП);
	СтруктураДанных = Новый Структура("УИДИсточника, Ответственный, НомерДатаВБУ, СуммаВБУ, СуммаНДСВБУ, ПроведенВБУ");
//Евросиб Гудкова( 21.02.2022 Ticket№ 0224955
	СтруктураДанных.Вставить("ДатаОбмена");
// Евросиб Гудкова)
	//Евросиб Каблов 18.07.2022 ( Task 54465
	СтруктураДанных.Вставить("ДатаДокументаВнешнейИС");
	//Евросиб Каблов 18.07.2022 )
	СтруктураДанных.Ответственный = Справочники.Пользователи.НайтиПоНаименованию(ТЗДокументов[0].Ответственный);
	ОписаниеОшибки = "";
	Для Каждого Строка Из ТЗДокументов Цикл
		СсылкаНаОбъект = Документы[Строка.ВидДокумента].ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.ГУИД));
//Евросиб Гудкова( 21.02.2022 Ticket№ 0224955
		ЕстьВыгрузкаРанее = РегистрыСведений.ПротоколОбменов.ПроверитьВыгрузку(СсылкаНаОбъект, Перечисления.УзлыОбмена.УПП, Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
// Евросиб Гудкова)

		//(Евросиб Максимова 21052021 #0224955
		Подтвердить=Истина;
		Если ЗначениеЗаполнено(ЕстьВыгрузкаРанее.Ссылка) И  //Евросиб Гудкова( 21.02.2022 Ticket№ 0224955
			(ТипЗнч(СсылкаНаОбъект)=Тип("ДокументСсылка.Акцепт")
//Евросиб Гудкова( 09.07.2021 Ticket№ 0224955
			Или ТипЗнч(СсылкаНаОбъект)=Тип("ДокументСсылка.ПоступлениеТоваровУслуг") или ТипЗнч(СсылкаНаОбъект)=Тип("ДокументСсылка.СчетФактураПолученный")
			или ТипЗнч(СсылкаНаОбъект)=Тип("ДокументСсылка.КорректировкаПоступления"))
// Евросиб Гудкова) 			
			Тогда
			Если Строка.ДатаПолучения<=СсылкаНаОбъект.ДатаМодификации Тогда
				Подтвердить=Ложь;
				ОписаниеОшибки="Изменилась дата модификации документа. Подтверждение выгрузки отклонено";
			КонецЕсли;
		//Евросиб Максимова 30052021 #0224955			
//Евросиб Гудкова( 21.02.2022 Ticket№ 0224955
		//ИначеЕсли ТипЗнч(СсылкаНаОбъект)=Тип("ДокументСсылка.КорректировкаРеализации") или
		//ТипЗнч(СсылкаНаОбъект)=Тип("ДокументСсылка.ОтчетКомитентуОПродажах") или ТипЗнч(СсылкаНаОбъект)=Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда	
// Евросиб Гудкова) 			
		Иначе
			Если Строка.ДатаПолучения<=СсылкаНаОбъект.Изменено Тогда
				Подтвердить=Ложь;
				ОписаниеОшибки="Изменилась дата модификации документа. Подтверждение выгрузки отклонено";
			КонецЕсли;		
		//Евросиб Максимова 30052021 #0224955
		КонецЕсли;
		Если Подтвердить=Истина Тогда
		//)Евросиб Максимова 21052021 #0224955
			
			СтруктураПоиска.Объект = СсылкаНаОбъект;
			СтруктураДанных.УИДИсточника = Строка.ГУИД;
//Евросиб Гудкова( 21.02.2022 Ticket№ 0224955
			СтруктураДанных.ДатаОбмена = Строка.ДатаПолучения;
// Евросиб Гудкова)
			//Евросиб Каблов 18.07.2022 ( Task 54465
			СтруктураДанных.ДатаДокументаВнешнейИС = Строка.Дата;
			//Евросиб Каблов 18.07.2022 )
			ЗаполнитьЗначенияСвойств(СтруктураДанных, Строка,, "Ответственный");
			
			//Евросиб Каблов 18.07.2022 ( Task 54465
			НачатьТранзакцию();
			//Евросиб Каблов 18.07.2022 )
			
			Сообщение = РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных, "");			
			ОписаниеОшибки = ОписаниеОшибки + Сообщение.Текст;
			
			//Евросиб Каблов 18.07.2022 ( Task 54465
			Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.Акцепт") Тогда
		
				ДокОбъект = СсылкаНаОбъект.ПолучитьОбъект();
				Если ДокОбъект.Проведен Тогда
					Если ЗначениеЗаполнено(ДокОбъект.СторнируемыйАкцепт) Тогда
						УчетДоходовРасходовСервер.Акцепт_СформироватьДвиженияСторноНезавершенноеПроизводствоПоПериодуПроведенияВБУ(ДокОбъект);
						//Евросиб Каблов 20.11.2025 ( #104968
						УчетДоходовРасходовСервер.Акцепт_СформироватьДвиженияСторноНезавершенноеПроизводствоРасширенный(ДокОбъект);
						//Евросиб Каблов 20.11.2025 ) #104968
					Иначе
						УчетДоходовРасходовСервер.Акцепт_СформироватьДвиженияНезавершенноеПроизводствоПоПериодуПроведенияВБУ(ДокОбъект);
						//Евросиб Каблов 20.11.2025 ( #104968
						УчетДоходовРасходовСервер.Акцепт_СформироватьДвиженияНезавершенноеПроизводствоРасширенный(ДокОбъект);
						//Евросиб Каблов 20.11.2025 ) #104968
					КонецЕсли;
					//Евросиб Каблов 20.11.2025 ( #104968
					ДокОбъект.Движения.Записать();
					//Евросиб Каблов 20.11.2025 ) #104968
				КонецЕсли;
				
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			//Евросиб Каблов 18.07.2022 )
			
		//(Евросиб Максимова 21052021 #0224955
		КонецЕсли;
		//)Евросиб Максимова 21052021 #0224955
		
	КонецЦикла;
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(ОписаниеОшибки);
	
КонецФункции
 
Функция ОтметитьПроведениеДокументаВБухУчете(XMLParams) Экспорт

	СтрокаОтвета = ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	СсылкаДокумента = РегистрыСведений.ПротоколОбменов.СсылкаПоУИД(СтрокаОтвета.ГУИД, Перечисления.ДействияПриОбмене.ВыгрузкаДанных, Перечисления.УзлыОбмена.УПП);
	СтруктураПоиска = Новый Структура("ДействиеПриОбмене, УзелОбмена, Объект", Перечисления.ДействияПриОбмене.ВыгрузкаДанных, Перечисления.УзлыОбмена.УПП, СсылкаДокумента);
	//Евросиб Каблов 18.07.2022 ( Task 54465
	//СтруктураДанных = Новый Структура("ПроведенВБУ, НомерДатаВБУ, УИДИсточника, Ответственный", СтрокаОтвета.ПроведенВБУ, СтрокаОтвета.НомерДокумента + " от " + СтрокаОтвета.ДатаДокумента, СтрокаОтвета.ГУИД, СтрокаОтвета.Ответственный);
	Ответственный = Справочники.Пользователи.НайтиПоНаименованию(СтрокаОтвета.Ответственный);
	СтруктураДанных = Новый Структура("ПроведенВБУ, НомерДатаВБУ, УИДИсточника, Ответственный, ДатаДокументаВнешнейИС", СтрокаОтвета.ПроведенВБУ, СтрокаОтвета.НомерДокумента + " от " + СтрокаОтвета.ДатаДокумента, СтрокаОтвета.ГУИД, Ответственный, СтрокаОтвета.ДатаДокумента);
	
	НачатьТранзакцию();
	
	//Евросиб Каблов 18.07.2022 )
	
	Сообщение = РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных,, Истина);
	//Евросиб Каблов 28.12.2021 ( Task 44350
	Если ТипЗнч(СсылкаДокумента) = Тип("ДокументСсылка.Акцепт") Тогда
		
		//Евросиб Каблов 18.07.2022 ( Task 54465
		//НачатьТранзакцию();
		//
		//ДокОбъект = СсылкаДокумента.ПолучитьОбъект();
		//Если СтрокаОтвета.ПроведенВБУ Тогда
		//	ДокОбъект.ДатаПроведенияВБУ = СтрокаОтвета.ДатаДокумента;
		//Иначе
		//	ПустаяДата = '00010101';
		//	ДокОбъект.ДатаПроведенияВБУ = ПустаяДата;
		//КонецЕсли;
		//
		//ДокОбъект.ОбменДанными.Загрузка = Истина;
		//ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		//
		//Если ДокОбъект.Проведен Тогда
		//	ДокОбъект.СоздатьДвиженияПоНезавершенномуПроизводству();
		//	ДокОбъект.Движения.НезавершенноеПроизводство.Записать();
		//	ДокОбъект.Движения.НезавершенноеПроизводствоПоПериодуПроведенияВБУ.Записать();
		//КонецЕсли;
		//
		//ЗафиксироватьТранзакцию();
		ДокОбъект = СсылкаДокумента.ПолучитьОбъект();
		Если ДокОбъект.Проведен Тогда
			Если ЗначениеЗаполнено(ДокОбъект.СторнируемыйАкцепт) Тогда
				УчетДоходовРасходовСервер.Акцепт_СформироватьДвиженияСторноНезавершенноеПроизводствоПоПериодуПроведенияВБУ(ДокОбъект);
			Иначе
				УчетДоходовРасходовСервер.Акцепт_СформироватьДвиженияНезавершенноеПроизводствоПоПериодуПроведенияВБУ(ДокОбъект);
			КонецЕсли;
			ДокОбъект.Движения.Записать();
		КонецЕсли;
		//Евросиб Каблов 18.07.2022 )
		
	КонецЕсли;
	//Евросиб Каблов 28.12.2021 )
	
	//Евросиб Каблов 18.07.2022 ( Task 54465
	ЗафиксироватьТранзакцию();
	//Евросиб Каблов 18.07.2022 )
	
	Возврат Сообщение.Текст;
	
КонецФункции // ОтметитьПроведениеДокументаВБухУчете(XMLParams)

Функция УстановитьСтатусДокумента(XMLParams) Экспорт

	СтрокаОтвета = ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	СсылкаДокумента = РегистрыСведений.ПротоколОбменов.СсылкаПоУИД(СтрокаОтвета.ГУИД, Перечисления.ДействияПриОбмене.ВыгрузкаДанных, Перечисления.УзлыОбмена.УПП);
	СтруктураПоиска = Новый Структура("ДействиеПриОбмене, УзелОбмена, Объект", Перечисления.ДействияПриОбмене.ВыгрузкаДанных, Перечисления.УзлыОбмена.УПП, СсылкаДокумента);
	//Евросиб СубботинВ #89527 30.10.2024 Начало
	//СтруктураДанных = Новый Структура("УИДИсточника, Статус, ДатаОплаты", СтрокаОтвета.ГУИД, СтрокаОтвета.Состояние, СтрокаОтвета.ДатаОплаты);
	//Евросиб СубботинВ #111466 09.06.2025 Начало
	//СтруктураДанных = Новый Структура("УИДИсточника, Статус, ДатаОплаты",
	//ДопИнфо1,Комментарий",
    //СтрокаОтвета.ГУИД, СтрокаОтвета.Состояние, СтрокаОтвета.ДатаОплаты);

	СтруктураДанных = Новый Структура("УИДИсточника, ДатаОплаты", СтрокаОтвета.ГУИД, СтрокаОтвета.ДатаОплаты);
	//Евросиб СубботинВ #111466 09.06.2025 Конец

	// СтрокаОтвета.СтатусРеестра, СтрокаОтвета.Комментарий);
	Если СтрокаОтвета.Свойство("СтатусРеестра") Тогда 
		СтруктураДанных.Вставить("ДопИнфо1", СтрокаОтвета.СтатусРеестра);									  
	КонецЕсли;
	
	//Евросиб СубботинВ #122636 02.12.2025 Начало	
	НеобходимоОбнулениеДатыОплаты = Ложь;
	//Евросиб СубботинВ #122636 02.12.2025 Конец		
	
	//Евросиб СубботинВ #111466 04.07.2025 Начало
	Если СтрокаОтвета.Свойство("Состояния") и СтрокаОтвета.Состояния.Количество() > 0 Тогда
		Состояния = СтрокаОтвета.Состояния;
		ПоследнийСтатус = Состояния[Состояния.Количество()-1]; 		
		//Если СтрокаОтвета.Свойство("Комментарий") Тогда 
		//	СтруктураДанных.Вставить("Комментарий",?(СтрокаОтвета.Состояние = "Отклонен", Строка(СтрокаОтвета.Состояние + ". " 
		//	+ СтрЗаменить(СтрокаОтвета.Комментарий,Символы.ПС," ")), СтрЗаменить(СтрокаОтвета.Комментарий,Символы.ПС," ")));
		//	Если СтрокаОтвета.Свойство("ПричинаОтказа") и ЗначениеЗаполнено(СтрокаОтвета.ПричинаОтказа) Тогда 
		//		СтруктураДанных.Вставить("Комментарий", Строка(СтрЗаменить(СтрокаОтвета.ПричинаОтказа,Символы.ПС," ") + " " + СтруктураДанных.Комментарий));
		//	КонецЕсли;
		//КонецЕсли;	
		////Евросиб СубботинВ #89527 30.10.2024 Конец
		//
		////Евросиб СубботинВ #111466 09.06.2025 Начало
		//Если СтрокаОтвета.Свойство("ДатаПланируемойОплатыУПП") Тогда
		//	СтруктураДанных.Вставить("ДатаПланируемойОплаты",СтрокаОтвета.ДатаПланируемойОплатыУПП);
		//КонецЕсли;		
		////Евросиб СубботинВ #111466 09.06.2025 Конец 
		СтруктураДанных.Вставить("Статус", ПоследнийСтатус.Состояние);
		Если ПоследнийСтатус.Свойство("Комментарий") Тогда 
			СтруктураДанных.Вставить("Комментарий",?(ПоследнийСтатус.Состояние = "Отклонен", Строка(ПоследнийСтатус.Состояние + ". " 
			+ СтрЗаменить(ПоследнийСтатус.Комментарий,Символы.ПС," ")), СтрЗаменить(ПоследнийСтатус.Комментарий,Символы.ПС," ")));
			Если ПоследнийСтатус.Свойство("ПричинаОтказа") и ЗначениеЗаполнено(ПоследнийСтатус.ПричинаОтказа) Тогда 
				СтруктураДанных.Вставить("Комментарий", Строка(СтрЗаменить(ПоследнийСтатус.ПричинаОтказа,Символы.ПС," ") + " " + СтруктураДанных.Комментарий));
			КонецЕсли;
		КонецЕсли;
		//Евросиб СубботинВ #122636 02.12.2025 Начало 
		Если ПоследнийСтатус.Состояние = "Отклонен" Тогда
			НеобходимоОбнулениеДатыОплаты = Истина;
		КонецЕсли;	
		//Евросиб СубботинВ #122636 02.12.2025 Конец		
	КонецЕсли;
	
	//Евросиб СубботинВ #122636 02.12.2025 Начало
	ПоследняяДата = Неопределено;
	Если НЕ НеобходимоОбнулениеДатыОплаты Тогда
	//Евросиб СубботинВ #122636 02.12.2025 Конец
		Если СтрокаОтвета.Свойство("ДатыПланируемойОплаты") и СтрокаОтвета.ДатыПланируемойОплаты.Количество() > 0 Тогда
			ДатыПланируемойОплаты = СтрокаОтвета.ДатыПланируемойОплаты; 
			ПоследняяДата = ДатыПланируемойОплаты[ДатыПланируемойОплаты.Количество()-1];
			СтруктураДанных.Вставить("ДатаПланируемойОплаты", СтроковыеФункцииКлиентСервер.СтрокаВДату(Формат(ПоследняяДата.ДатаПланируемойОплатыУПП,"ДФ=dd.MM.yyyy")));
		КонецЕсли;		
		//Евросиб СубботинВ #111466 04.07.2025 Конец
	//Евросиб СубботинВ #122636 02.12.2025 Начало
	Иначе
		СтруктураДанных.Вставить("ДатаПланируемойОплаты", Неопределено);
		ПоследняяДата = Неопределено;
	КонецЕсли;	
	//Евросиб СубботинВ #122636 02.12.2025 Конец		
	
	ДопДанные = РегистрыСведений.ПротоколОбменов.ПолучитьЗначенияЗаписей(Перечисления.ДействияПриОбмене.ВыгрузкаДанных,
																			 Перечисления.УзлыОбмена.УПП, СсылкаДокумента);
		
	Сообщение = РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных,, Истина);
	
	//Евросиб СубботинВ #89527 30.10.2024 Начало// переписал на большее количество получаемых из упп статусов
	// Евросиб(ДИТ) US 73033 ТА 88304 Ticket 0315506 Сержантова А.С. Начало: 19.07.2024
	//// По Заявка на оплату, если с УПП пришел статус "Отклонен", то в соответствующей заявке тоже ставим статус отклонен
	//Если ТипЗнч(СсылкаДокумента) = Тип("ДокументСсылка.ЗаявкаНаОплату") 
	//	и СтрокаОтвета.Состояние = "Отклонен" Тогда
	//    РегистрыСведений.СтатусыОбъектов.ЗафиксироватьИзменениеСтатусаОбъекта(СсылкаДокумента, Справочники.СтатусыДокументов.Отклонен,Перечисления.УзлыОбмена.УПП);
	//КонецЕсли;
	Если ТипЗнч(СсылкаДокумента) = Тип("ДокументСсылка.ЗаявкаНаОплату") Тогда		
		//Евросиб СубботинВ #111466 09.06.2025 Начало
		//ДопДанные = РегистрыСведений.ПротоколОбменов.ПолучитьЗначенияЗаписей(Перечисления.ДействияПриОбмене.ВыгрузкаДанных,
		//																	 Перечисления.УзлыОбмена.УПП, СсылкаДокумента);
		//Если ЗначениеЗаполнено(СтрокаОтвета.ДатаПланируемойОплатыУПП)Тогда			
		//	Если НЕ ЗначениеЗаполнено(ДопДанные.ДатаПланируемойОплаты)
		//		или (ЗначениеЗаполнено(ДопДанные.ДатаПланируемойОплаты) и НЕ ДопДанные.ДатаПланируемойОплаты = СтрокаОтвета.ДатаПланируемойОплатыУПП) Тогда
		//		РегистрыСведений.СтатусыОбъектов.ЗафиксироватьИзменениеСтатусаОбъекта(СсылкаДокумента,
		//												Справочники.СтатусыДокументов.ИзмененаДатаОплатыВУПП,
		//												Перечисления.УзлыОбмена.УПП,,
		//												СтрокаОтвета.КомментарийДатыПланируемойОплатыУПП);
		//		
		//		Если Справочники.СобытияОтправкиДокументов.ИзмененаДатаОплатыВУПП.ОтправкаПисемПоСобытию Тогда
		//			РассылкаУведомленийПользователям.СформироватьЗаписиСобытийИзменений(СсылкаДокумента,
		//												Справочники.СобытияОтправкиДокументов.ИзмененаДатаОплатыВУПП,Неопределено);
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;
		
		//Евросиб СубботинВ #128763 04.02.2026 Начало
		ТаблицаСтатусов = Новый ТаблицаЗначений;
		ТаблицаСтатусов.Колонки.Добавить("Объект", Новый ОписаниеТипов("ДокументСсылка.ЗаявкаНаОплату"));
		ТаблицаСтатусов.Колонки.Добавить("Статус", Новый ОписаниеТипов("СправочникСсылка.СтатусыДокументов"));
		ТаблицаСтатусов.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
		ТаблицаСтатусов.Колонки.Добавить("Пользователь", Новый ОписаниеТипов("ПеречислениеСсылка.УзлыОбмена"));
		ТаблицаСтатусов.Колонки.Добавить("Комментарий", Новый ОписаниеТипов("Строка"));
		ТаблицаСтатусов.Колонки.Добавить("НеобходимоИзменениеПризнакаАктивности", Новый ОписаниеТипов("Булево"));
		ТаблицаСтатусов.Колонки.Добавить("Признак", Новый ОписаниеТипов("Булево"));
		//Евросиб СубботинВ #128763 04.02.2026 Конец
		
        ИзмениласьДатаОплатыУПП = Ложь; 
		Если НЕ ПоследняяДата = Неопределено Тогда
			Если ЗначениеЗаполнено(ПоследняяДата.ДатаПланируемойОплатыУПП) Тогда			
				Если НЕ ЗначениеЗаполнено(ДопДанные.ДатаПланируемойОплаты)
					или (ЗначениеЗаполнено(ДопДанные.ДатаПланируемойОплаты) и НЕ ДопДанные.ДатаПланируемойОплаты = СтроковыеФункцииКлиентСервер.СтрокаВДату(Формат(ПоследняяДата.ДатаПланируемойОплатыУПП,"ДФ=dd.MM.yyyy"))) Тогда
					 //Евросиб СубботинВ #128763 04.02.2026 Начало 
					//РегистрыСведений.СтатусыОбъектов.ЗафиксироватьИзменениеСтатусаОбъекта(СсылкаДокумента,
					//																	Справочники.СтатусыДокументов.ИзмененаДатаОплатыВУПП,
					//																	Перечисления.УзлыОбмена.УПП,,
					//																	ПоследняяДата.КомментарийДатыПланируемойОплатыУПП,
					//																	ПоследняяДата.ДатаИзменения);
					НоваяСтрока = ТаблицаСтатусов.Добавить();
					НоваяСтрока.Объект = СсылкаДокумента;
					НоваяСтрока.Статус = Справочники.СтатусыДокументов.ИзмененаДатаОплатыВУПП;
					НоваяСтрока.Период = ПоследняяДата.ДатаИзменения;
					НоваяСтрока.Пользователь = Перечисления.УзлыОбмена.УПП;
					НоваяСтрока.Комментарий = ПоследняяДата.КомментарийДатыПланируемойОплатыУПП;
					НоваяСтрока.НеобходимоИзменениеПризнакаАктивности = Ложь; 
					НоваяСтрока.Признак = Ложь; 

					//Евросиб СубботинВ #128763 04.02.2026 Конец																	
					ИзмениласьДатаОплатыУПП = Истина;
				Иначе
					ИзмениласьДатаОплатыУПП = Ложь;
				КонецЕсли;
			КонецЕсли;		
		КонецЕсли;
		Если ИзмениласьДатаОплатыУПП и Справочники.СобытияОтправкиДокументов.ИзмененаДатаОплатыВУПП.ОтправкаПисемПоСобытию Тогда
			РассылкаУведомленийПользователям.СформироватьЗаписиСобытийИзменений(СсылкаДокумента,
																				Справочники.СобытияОтправкиДокументов.ИзмененаДатаОплатыВУПП,Неопределено);
		КонецЕсли;																		
		//Евросиб СубботинВ #118153 28.08.2025 Начало //перенес ниже																	 
		//Евросиб СубботинВ #115052 28.07.2025 Начало // истина 
		//НеобходимоИзменениеПризнакаАктивности = Ложь;
		//Евросиб СубботинВ #115052 28.07.2025 Конец
		//Евросиб СубботинВ #118153 28.08.2025 Конец 
		
		Если СтрокаОтвета.Свойство("Состояния") Тогда
			Для Каждого СтрокаСостояния из СтрокаОтвета.Состояния Цикл			
				//Евросиб СубботинВ #111466 09.06.2025 Конец
				
				//Евросиб СубботинВ #118153 28.08.2025 Начало 																	 
				НеобходимоИзменениеПризнакаАктивности = Ложь;
				//Евросиб СубботинВ #118153 28.08.2025 Конец				
				
				Если СтрокаСостояния.Состояние = "Отклонен" Тогда
					ФиксируемыйСтатус = Справочники.СтатусыДокументов.ОтклоненаВУПП; 
					//Евросиб СубботинВ #115052 28.07.2025 Начало
					НеобходимоИзменениеПризнакаАктивности = Истина;
					Признак = Истина;
					//Документы.РеестрПлатежей.ИзменитьПризнакАктивностиЗаявкиВРеестрах(СсылкаДокумента, Истина);
					//Евросиб СубботинВ #115052 28.07.2025 Конец
				ИначеЕсли СтрокаСостояния.Состояние = "Оплачена" Тогда
					ФиксируемыйСтатус = Справочники.СтатусыДокументов.ЗаявкаОплачена;
					//Евросиб СубботинВ #97103 16.12.2024 Начало
				ИначеЕсли СтрокаСостояния.Состояние = "Утвержден" Тогда 
					ФиксируемыйСтатус = Справочники.СтатусыДокументов.УтвержденаВРеестреУПП;
					ТекущийСтатус = РегистрыСведений.СтатусыОбъектов.ПолучитьПоследнее(, Новый Структура("Объект", СсылкаДокумента));
					Если ТекущийСтатус.Статус = Справочники.СтатусыДокументов.ОтклоненаВУПП Тогда
						Если Справочники.СобытияОтправкиДокументов.УтверждениеЗаявкиНаОплатуУПП.ОтправкаПисемПоСобытию Тогда
							РассылкаУведомленийПользователям.СформироватьЗаписиСобытийИзменений(СсылкаДокумента,
																								Справочники.СобытияОтправкиДокументов.УтверждениеЗаявкиНаОплатуУПП
																								,,Истина);  
						КонецЕсли;																	
						//Евросиб СубботинВ #115052 28.07.2025 Начало
						НеобходимоИзменениеПризнакаАктивности = Истина;
						Признак = Ложь;
						//Документы.РеестрПлатежей.ИзменитьПризнакАктивностиЗаявкиВРеестрах(СсылкаДокумента, Ложь);
						//Евросиб СубботинВ #115052 28.07.2025 Конец						
					КонецЕсли;
					
				ИначеЕсли СтрокаСостояния.Состояние = "Выгружен в КЦ" Тогда
					ФиксируемыйСтатус = Справочники.СтатусыДокументов.ВыгруженаВКЦ;
				ИначеЕсли СтрокаСостояния.Состояние = "Согласован" Тогда
					ФиксируемыйСтатус = Справочники.СтатусыДокументов.СогласованаВУПП;				
					//Евросиб СубботинВ #97103 16.12.2024 Конец				
					//Евросиб СубботинВ #111466 09.06.2025 Начало
               	Иначе 
					Продолжить		
					//Евросиб СубботинВ #111466 09.06.2025 Конец
				КонецЕсли;
				//Евросиб СубботинВ #111466 09.06.2025 Начало 
			
				    //Евросиб СубботинВ #128763 04.02.2026 Начало 
					НоваяСтрока = ТаблицаСтатусов.Добавить();
					НоваяСтрока.Объект = СсылкаДокумента;
					НоваяСтрока.Статус = ФиксируемыйСтатус;
					НоваяСтрока.Период = СтрокаСостояния.ДатаСостояния;
					НоваяСтрока.Пользователь = Перечисления.УзлыОбмена.УПП;
					НоваяСтрока.Комментарий = СтрокаСостояния.Комментарий; 				
                    НоваяСтрока.НеобходимоИзменениеПризнакаАктивности = НеобходимоИзменениеПризнакаАктивности; 
					НоваяСтрока.Признак = Признак;				
				//ПроверитьНаличиеЗаписи = РегистрыСведений.СтатусыОбъектов.ПроверитьНаличиеЗаписиСтатуса(СсылкаДокумента, СтрокаСостояния.ДатаСостояния, ФиксируемыйСтатус);		
				//Если НЕ ПроверитьНаличиеЗаписи Тогда
				//	РегистрыСведений.СтатусыОбъектов.ЗафиксироватьИзменениеСтатусаОбъекта(СсылкаДокумента, ФиксируемыйСтатус,
				//                                                                        Перечисления.УзлыОбмена.УПП,,
				//																  		  СтрокаСостояния.Комментарий,
				//																		  СтрокаСостояния.ДатаСостояния);
					////Евросиб СубботинВ #115052 28.07.2025 Начало																	  
					//Если НеобходимоИзменениеПризнакаАктивности Тогда
					//	Документы.РеестрПлатежей.ИзменитьПризнакАктивностиЗаявкиВРеестрах(СсылкаДокумента, Признак);
					//КонецЕсли;
					////Евросиб СубботинВ #115052 28.07.2025 Конец 				
					//КонецЕсли;
					//Евросиб СубботинВ #128763 04.02.2026 Конец

			КонецЦикла;
			//Евросиб СубботинВ #128763 04.02.2026 Начало 
			ТаблицаСтатусов.Сортировать("Период Возр");
			РегистрыСведений.СтатусыОбъектов.ЗафиксироватьМассивСтатусов(ТаблицаСтатусов, СсылкаДокумента);
			//Евросиб СубботинВ #128763 04.02.2026 Конец
		КонецЕсли;
		//Евросиб СубботинВ #111466 09.06.2025 Конец
	КонецЕсли;
	//Евросиб СубботинВ #89527 30.10.2024 Конец	
	Возврат Сообщение.Текст;
	
КонецФункции // ОтметитьПроведениеДокументаВБухУчете(XMLParams)

// Евросиб(ДИТ) US 73033 ТА 88304 Сержантова А.С. 29.07.2024
Функция ПолучитьСтатусДокумента(XMLParams) Экспорт

	СтрокиЗапроса = ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	
	Для каждого Строка Из СтрокиЗапроса Цикл
		ЗаявкаСсылка = Документы.ЗаявкаНаОплату.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.ГУИД)); 	
		ЗначениеСтатуса = РегистрыСведений.СтатусыОбъектов.ПолучитьПоследнее(ТекущаяДата(), Новый Структура("Объект", ЗаявкаСсылка));
	    Строка.Вставить("Состояние", ЗначениеСтатуса.Статус.Наименование);
	КонецЦикла;      
	
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(СтрокиЗапроса);

КонецФункции 

Функция ЗаписатьИзмененияВПланДДС(XMLParams) Экспорт

	СтруктураПлана = ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	ПланДДССсылка = РегистрыСведений.ПротоколОбменов.СсылкаПоУИД(СтруктураПлана.ГУИД, Перечисления.ДействияПриОбмене.ВыгрузкаДанных, Перечисления.УзлыОбмена.УПП);
	Если Не ЗначениеЗаполнено(ПланДДССсылка) Тогда
		Возврат ОбщегоНазначения.ЗначениеВСтрокуXML("План ДДС с ГУИД "  + СтруктураПлана.ГУИД + " не найден. Данные не записаны.");
	КонецЕсли;
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗДДС.ТЧДокумента КАК ТЧДокумента,
	               |	ТЗДДС.СтатьяДДСНаименование КАК СтатьяДДСНаименование,
	               |	ТЗДДС.Сумма КАК Сумма,
	               |	ТЗДДС.ДатаДвижения КАК ДатаДвижения,
	               |	ТЗДДС.КлючСтроки КАК КлючСтроки,
	               |	ТЗДДС.ВалютаДокументаКод КАК ВалютаДокументаКод,
	               |	ТЗДДС.УИДДоговораКонтаргента КАК УИДДоговораКонтаргента,
	               |	ТЗДДС.УИДКонтрагента КАК УИДКонтрагента
	               |ПОМЕСТИТЬ ТЗДДС
	               |ИЗ
	               |	&ТЗДДС КАК ТЗДДС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗДДС.ТЧДокумента КАК ТЧДокумента,
	               |	СтатьиДвиженияДенежныхСредств.Ссылка КАК СтатьяДвиженияДенежныхСредств,
	               |	Валюты.Ссылка КАК Валюта,
	               |	ТЗДДС.Сумма КАК Сумма,
	               |	ТЗДДС.ДатаДвижения КАК ДатаДвижения,
	               |	ТЗДДС.КлючСтроки КАК КлючСтроки,
	               |	Контрагенты.Объект КАК Контрагент,
	               |	ДоговорыКонтрагентов.Объект КАК ДоговорКонтрагента
	               |ИЗ
	               |	ТЗДДС КАК ТЗДДС
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
	               |		ПО ТЗДДС.СтатьяДДСНаименование = СтатьиДвиженияДенежныхСредств.Код
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	               |		ПО ТЗДДС.ВалютаДокументаКод = Валюты.Код
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Контрагенты
	               |		ПО ТЗДДС.УИДКонтрагента = Контрагенты.УИДИсточника
	               |			И (Контрагенты.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	               |			И (Контрагенты.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ДоговорыКонтрагентов
	               |		ПО ТЗДДС.УИДДоговораКонтаргента = ДоговорыКонтрагентов.УИДИсточника
	               |			И (ДоговорыКонтрагентов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	               |			И (ДоговорыКонтрагентов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))";
	Запрос.УстановитьПараметр("ПланДДССсылка", ПланДДССсылка);
	Запрос.УстановитьПараметр("ТЗДДС", СтруктураПлана.ТЗДДС);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	ПланДДСОбъект = ПланДДССсылка.ПолучитьОбъект();
	Пока Выборка.Следующий() Цикл
		Строка = ПланДДСОбъект[Выборка.ТЧДокумента].Найти(Выборка.КлючСтроки, "КлючСтроки");
		Если Строка = Неопределено Тогда
			Строка = ПланДДСОбъект[Выборка.ТЧДокумента].Добавить();
		КонецЕсли; 
		ЗаполнитьЗначенияСвойств(Строка, Выборка);
	КонецЦикла;
	
	ПланДДСОбъект.ОбменДанными.Загрузка = Истина;
	ПланДДСОбъект.Записать();
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML("План ДДС обновлён");

КонецФункции // ЗаписатьИзмененияВПланДДС(XMLParams)

//++ Глеков Д.В. Ticket#0257625  21.01.2022 
Функция ПередатьРеестрНДСЭкспортИмпорт(ДатаНачала, ДатаОкончания) Экспорт

	Запрос = Новый Запрос;
	#Область ТекстЗапроса
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетФактураВыданныйДокументыОснования.Ссылка КАК Ссылка,
	|	СчетФактураВыданныйДокументыОснования.Ссылка.ВидПеревозки КАК ВидПеревозки,
	|	СчетФактураВыданныйДокументыОснования.ДокументОснование КАК ДокументОснование,
	|	СчетФактураВыданныйДокументыОснования.СуммаУвеличение КАК СуммаУвеличение,
	|	СчетФактураВыданныйДокументыОснования.СуммаУменьшение КАК СуммаУменьшение
	|ПОМЕСТИТЬ СсылкаСФВыданный
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияКорректировокРеализаций КАК ИсторияКорректировокРеализаций
	|		ПО СчетФактураВыданныйДокументыОснования.ДокументОснование = ИсторияКорректировокРеализаций.КорректируемыйДокумент
	|ГДЕ
	|	СчетФактураВыданныйДокументыОснования.Ссылка.СуммаНДСДокумента = 0
	|	И СчетФактураВыданныйДокументыОснования.Ссылка.Проведен
	|	И СчетФактураВыданныйДокументыОснования.Ссылка.УдалитьДатаОтчетаДляФНС МЕЖДУ &ДатаС И &ДатаПо
	|	И СчетФактураВыданныйДокументыОснования.Ссылка.УдалитьВключатьВОтчетДляФНС
	|	И ВЫБОР
	|			КОГДА &ФормаРеестра = ""Транзит""
	|					ИЛИ &ФормаРеестра = ""ЭкспортИмпорт""
	|				ТОГДА НЕ СчетФактураВыданныйДокументыОснования.Ссылка.Фрахт
	|			ИНАЧЕ СчетФактураВыданныйДокументыОснования.Ссылка.Фрахт
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ФормаРеестра = ""Транзит""
	|				ТОГДА СчетФактураВыданныйДокументыОснования.Ссылка.ВидПеревозки В (&СписокТранзит)
	|			КОГДА &ФормаРеестра = ""ЭкспортИмпорт""
	|				ТОГДА НЕ СчетФактураВыданныйДокументыОснования.Ссылка.ВидПеревозки В (&СписокЭкспортИмпорт)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ИсторияКорректировокРеализаций.КорректируемыйДокумент ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетФактураВыданныйДокументыОснования.Ссылка,
	|	СчетФактураВыданныйДокументыОснования.Ссылка.ВидПеревозки,
	|	СчетФактураВыданныйДокументыОснования.ДокументОснование,
	|	СчетФактураВыданныйДокументыОснования.СуммаУвеличение,
	|	СчетФактураВыданныйДокументыОснования.СуммаУменьшение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СсылкаСФВыданный.ВидПеревозки КАК ВидПеревозки,
	|	СчетФактураВыданныйПодтверждающиеДокументы.ЖДН.НомерТранспортногоДокумента КАК НомерЖДНакладной,
	|	СчетФактураВыданныйПодтверждающиеДокументы.Контейнер КАК НомерКонтейнера,
	|	СчетФактураВыданныйПодтверждающиеДокументы.НомерГТД КАК НомерГТД,
	|	СчетФактураВыданныйПодтверждающиеДокументы.СтранаОтправления КАК СтранаОтправления,
	|	СчетФактураВыданныйПодтверждающиеДокументы.СтанцияОтправления КАК СтанцияОтправления,
	|	СчетФактураВыданныйПодтверждающиеДокументы.СтранаНазначения КАК СтранаНазначения,
	|	СчетФактураВыданныйПодтверждающиеДокументы.СтанцияНазначения КАК СтанцияНазначения,
	|	ВЫБОР
	|		КОГДА НЕ КоносаментТЧ.ТипДокумента
	|			ТОГДА ВЫБОР
	|					КОГДА КоносаментТЧ.ДатаДокумента = ДАТАВРЕМЯ(""0001"", ""01"", ""01"")
	|						ТОГДА """"
	|					ИНАЧЕ ""Коносамент""
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Коносамент,
	|	ВЫБОР
	|		КОГДА НЕ КоносаментТЧ.ТипДокумента
	|			ТОГДА КоносаментТЧ.НомерДокумента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НомерДокументаКоносамент,
	|	ВЫБОР
	|		КОГДА НЕ КоносаментТЧ.ТипДокумента
	|			ТОГДА КоносаментТЧ.ДатаДокумента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ДатаДокументаКоносамент,
	|	ВЫБОР
	|		КОГДА ПоручениеТЧ.ТипДокумента
	|			ТОГДА ВЫБОР
	|					КОГДА ПоручениеТЧ.ДатаДокумента = ДАТАВРЕМЯ(""0001"", ""01"", ""01"")
	|						ТОГДА """"
	|					ИНАЧЕ ""Поручение""
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Поручение,
	|	ВЫБОР
	|		КОГДА ПоручениеТЧ.ТипДокумента
	|			ТОГДА ПоручениеТЧ.НомерДокумента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НомерДокументаПоручение,
	|	ВЫБОР
	|		КОГДА ПоручениеТЧ.ТипДокумента
	|			ТОГДА ПоручениеТЧ.ДатаДокумента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ДатаДокументаПоручение,
	|	КоносаментТЧ.Судно КАК НаименованиеСудна,
	|	КоносаментТЧ.ДатаРазрешенияПогрузки КАК ДатаРазрешенияПогрузки,
	|	КоносаментТЧ.ПортРазгрузки КАК ПортРазгрузки,
	|	СсылкаСФВыданный.Ссылка.Контрагент КАК Клиент,
	|	СсылкаСФВыданный.Ссылка.ДоговорКонтрагента КАК ДоговорКлиента,
	|	СсылкаСФВыданный.Ссылка КАК СчетФактура,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА СсылкаСФВыданный.Ссылка.ВалютаДокумента = ЗНАЧЕНИЕ(Справочник.Валюты.Рубль)
	|				ТОГДА ВЫБОР
	|						КОГДА ТИПЗНАЧЕНИЯ(СсылкаСФВыданный.ДокументОснование) = ТИП(Документ.КорректировкаРеализации)
	|							ТОГДА ВЫБОР
	|									КОГДА СсылкаСФВыданный.ДокументОснование.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)
	|										ТОГДА СсылкаСФВыданный.СуммаУвеличение - СсылкаСФВыданный.СуммаУменьшение
	|									ИНАЧЕ СсылкаСФВыданный.Ссылка.СуммаДокумента
	|								КОНЕЦ
	|						ИНАЧЕ СсылкаСФВыданный.Ссылка.СуммаДокумента
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(СсылкаСФВыданный.ДокументОснование) = ТИП(Документ.КорректировкаРеализации)
	|						ТОГДА ВЫБОР
	|								КОГДА СсылкаСФВыданный.ДокументОснование.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)
	|									ТОГДА СсылкаСФВыданный.СуммаУвеличение - СсылкаСФВыданный.СуммаУменьшение
	|								ИНАЧЕ СсылкаСФВыданный.Ссылка.СуммаДокумента
	|							КОНЕЦ
	|					ИНАЧЕ СсылкаСФВыданный.Ссылка.СуммаДокумента
	|				КОНЕЦ * КурсыВалют.Курс / КурсыВалют.Кратность
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК ОбщаяСуммаСчетаФактуры,
	|	СчетФактураВыданныйПодтверждающиеДокументы.НомерСтроки КАК НомерСтроки,
	|	СчетФактураВыданныйПодтверждающиеДокументы.ВходнаяСтанция КАК ВходнаяСтанция,
	|	ВЫБОР
	|		КОГДА КоносаментТЧ.ТипДокумента = ИСТИНА
	|			ТОГДА ""Поручение""
	|		ИНАЧЕ ""Коносамент""
	|	КОНЕЦ КАК ВидДокумента,
	|	КоносаментТЧ.НомерДокумента КАК НомерДокумента,
	|	КоносаментТЧ.ДатаДокумента КАК ДатаДокумента,  
	//Евросиб(ДИТ) Антонова А.С. US 107157 ТА 107159 Начало 28.04.2025
	|	СчетФактураВыданныйПодтверждающиеДокументы.РегНомерТранзитнойДекларации КАК РегНомерТранзитнойДекларации,
	//Евросиб(ДИТ) Антонова А.С. US 107157 ТА 107159 Конец 28.04.2025
	|	КоносаментТЧ.Судно.Наименование КАК Судно,
	|	КоносаментТЧ.СтранаРазгрузки.КодАльфа2 КАК СтранаРазгрузки
	|ПОМЕСТИТЬ ВТБезДублей
	|ИЗ
	|	СсылкаСФВыданный КАК СсылкаСФВыданный
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ПодтверждающиеДокументы КАК СчетФактураВыданныйПодтверждающиеДокументы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.МорскойТранспорт КАК КоносаментТЧ
	|			ПО СчетФактураВыданныйПодтверждающиеДокументы.КлючСтроки = КоносаментТЧ.КлючСтроки
	|				И (НЕ КоносаментТЧ.ТипДокумента)    
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.МорскойТранспорт КАК ПоручениеТЧ
	|			ПО СчетФактураВыданныйПодтверждающиеДокументы.КлючСтроки = ПоручениеТЧ.КлючСтроки
	|				И (ПоручениеТЧ.ТипДокумента) 
	|		ПО СсылкаСФВыданный.Ссылка = СчетФактураВыданныйПодтверждающиеДокументы.Ссылка  
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО СсылкаСФВыданный.Ссылка.ВалютаДокумента = КурсыВалют.Валюта
	|			И СсылкаСФВыданный.ДокументОснование.ДатаДокумента = КурсыВалют.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетФактураВыданныйПодтверждающиеДокументы.СтанцияНазначения,
	|	СчетФактураВыданныйПодтверждающиеДокументы.СтранаОтправления,
	|	СсылкаСФВыданный.ВидПеревозки,
	|	СчетФактураВыданныйПодтверждающиеДокументы.ЖДН.НомерТранспортногоДокумента,
	|	СсылкаСФВыданный.Ссылка,
	|	СчетФактураВыданныйПодтверждающиеДокументы.СтранаНазначения,
	|	КоносаментТЧ.ДатаРазрешенияПогрузки,
	|	СчетФактураВыданныйПодтверждающиеДокументы.СтанцияОтправления,
	|	КоносаментТЧ.Судно,
	|	КоносаментТЧ.ПортРазгрузки,
	|	СчетФактураВыданныйПодтверждающиеДокументы.НомерГТД,
	|	СчетФактураВыданныйПодтверждающиеДокументы.Контейнер,
	|	СсылкаСФВыданный.Ссылка.Контрагент,
	|	СсылкаСФВыданный.Ссылка.ДоговорКонтрагента,
	|	СчетФактураВыданныйПодтверждающиеДокументы.НомерСтроки,
	|	ВЫБОР
	|		КОГДА НЕ КоносаментТЧ.ТипДокумента
	|			ТОГДА ВЫБОР
	|					КОГДА КоносаментТЧ.ДатаДокумента = ДАТАВРЕМЯ(""0001"", ""01"", ""01"")
	|						ТОГДА """"
	|					ИНАЧЕ ""Коносамент""
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ КоносаментТЧ.ТипДокумента
	|			ТОГДА КоносаментТЧ.ДатаДокумента
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПоручениеТЧ.ТипДокумента
	|			ТОГДА ВЫБОР
	|					КОГДА ПоручениеТЧ.ДатаДокумента = ДАТАВРЕМЯ(""0001"", ""01"", ""01"")
	|						ТОГДА """"
	|					ИНАЧЕ ""Поручение""
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПоручениеТЧ.ТипДокумента
	|			ТОГДА ПоручениеТЧ.НомерДокумента
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ КоносаментТЧ.ТипДокумента
	|			ТОГДА КоносаментТЧ.НомерДокумента
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПоручениеТЧ.ТипДокумента
	|			ТОГДА ПоручениеТЧ.ДатаДокумента
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА СсылкаСФВыданный.Ссылка.ВалютаДокумента = ЗНАЧЕНИЕ(Справочник.Валюты.Рубль)
	|				ТОГДА ВЫБОР
	|						КОГДА ТИПЗНАЧЕНИЯ(СсылкаСФВыданный.ДокументОснование) = ТИП(Документ.КорректировкаРеализации)
	|							ТОГДА ВЫБОР
	|									КОГДА СсылкаСФВыданный.ДокументОснование.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)
	|										ТОГДА СсылкаСФВыданный.СуммаУвеличение - СсылкаСФВыданный.СуммаУменьшение
	|									ИНАЧЕ СсылкаСФВыданный.Ссылка.СуммаДокумента
	|								КОНЕЦ
	|						ИНАЧЕ СсылкаСФВыданный.Ссылка.СуммаДокумента
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(СсылкаСФВыданный.ДокументОснование) = ТИП(Документ.КорректировкаРеализации)
	|						ТОГДА ВЫБОР
	|								КОГДА СсылкаСФВыданный.ДокументОснование.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)
	|									ТОГДА СсылкаСФВыданный.СуммаУвеличение - СсылкаСФВыданный.СуммаУменьшение
	|								ИНАЧЕ СсылкаСФВыданный.Ссылка.СуммаДокумента
	|							КОНЕЦ
	|					ИНАЧЕ СсылкаСФВыданный.Ссылка.СуммаДокумента
	|				КОНЕЦ * КурсыВалют.Курс / КурсыВалют.Кратность
	|		КОНЕЦ КАК ЧИСЛО(15, 2)),
	|	СчетФактураВыданныйПодтверждающиеДокументы.ВходнаяСтанция,
	|	ВЫБОР
	|		КОГДА КоносаментТЧ.ТипДокумента = ИСТИНА
	|			ТОГДА ""Поручение""
	|		ИНАЧЕ ""Коносамент""
	|	КОНЕЦ,
	|	КоносаментТЧ.НомерДокумента,
	|	КоносаментТЧ.ДатаДокумента,  
	//Евросиб(ДИТ) Антонова А.С. US 107157 ТА 107159 Начало 28.04.2025
	|	СчетФактураВыданныйПодтверждающиеДокументы.РегНомерТранзитнойДекларации,
	//Евросиб(ДИТ) Антонова А.С. US 107157 ТА 107159 Конец 28.04.2025
	|	КоносаментТЧ.СтранаРазгрузки.КодАльфа2,
	|	КоносаментТЧ.Судно.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТБезДублей.СчетФактура КАК СчетФактура,
	|	КОЛИЧЕСТВО(ВТБезДублей.НомерКонтейнера) КАК НомерКонтейнера,
	|	ВТБезДублей.ОбщаяСуммаСчетаФактуры КАК ОбщаяСуммаСчетаФактуры
	|ПОМЕСТИТЬ КоличествоКТК
	|ИЗ
	|	ВТБезДублей КАК ВТБезДублей
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТБезДублей.СчетФактура,
	|	ВТБезДублей.ОбщаяСуммаСчетаФактуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КоличествоКТК.СчетФактура КАК СчетФактура,
	|	КоличествоКТК.НомерКонтейнера КАК НомерКонтейнера,
	|	СУММА(ВЫРАЗИТЬ(КоличествоКТК.ОбщаяСуммаСчетаФактуры / КоличествоКТК.НомерКонтейнера КАК ЧИСЛО(15, 2))) КАК СуммаНаКонтейнер,
	|	ВЫРАЗИТЬ(КоличествоКТК.ОбщаяСуммаСчетаФактуры КАК ЧИСЛО(15, 2)) КАК ОбщаяСуммаСчетаФактуры
	|ПОМЕСТИТЬ КоличествоКТКССуммой
	|ИЗ
	|	КоличествоКТК КАК КоличествоКТК
	|
	|СГРУППИРОВАТЬ ПО
	|	КоличествоКТК.СчетФактура,
	|	КоличествоКТК.НомерКонтейнера,
	|	ВЫРАЗИТЬ(КоличествоКТК.ОбщаяСуммаСчетаФактуры КАК ЧИСЛО(15, 2))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КоличествоКТКССуммой.СчетФактура КАК СчетФактура,
	|	КоличествоКТКССуммой.НомерКонтейнера КАК НомерКонтейнера,
	|	КоличествоКТКССуммой.ОбщаяСуммаСчетаФактуры - КоличествоКТКССуммой.СуммаНаКонтейнер * КоличествоКТКССуммой.НомерКонтейнера КАК ОстатокРаспределения
	|ПОМЕСТИТЬ КоличествоКТКССуммойИОстатком
	|ИЗ
	|	КоличествоКТКССуммой КАК КоличествоКТКССуммой
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТБезДублей.НомерЖДНакладной КАК Номер,
	|	ВТБезДублей.НомерГТД КАК НомерГТД,     
	//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 107705 Начало 20.05.2025
	//Было                          
	//|	ВТБезДублей.СтанцияОтправления.КодЖДСтанции КАК СтанцияОтправления,
	|	ВТБезДублей.СтанцияОтправления.КодЖДСтанции КАК КодСтанцииОтправления,
	//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 107705 Конец 20.05.2025
	|	ВТБезДублей.СтранаОтправления.КодАльфа2 КАК СтранаОтправления,
	|	ВТБезДублей.НаименованиеСудна.Наименование КАК НаименованиеСудна,
	|	ВТБезДублей.ДатаРазрешенияПогрузки КАК ДатаПогрузкиРазрешена,
	|	ВТБезДублей.ПортРазгрузки.Наименование КАК ПортРазгрузки,
	|	ВТБезДублей.ДоговорКлиента.Наименование КАК Примечание,
	|	ВТБезДублей.СчетФактура КАК Ссылка,
	|	СУММА(ВЫБОР
	|			КОГДА КоличествоКТКССуммойИОстатком.НомерКонтейнера = 1
	|				ТОГДА ВТБезДублей.ОбщаяСуммаСчетаФактуры
	|			ИНАЧЕ ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА ВТБезДублей.НомерСтроки = 1
	|							ТОГДА ВТБезДублей.ОбщаяСуммаСчетаФактуры / КоличествоКТКССуммойИОстатком.НомерКонтейнера + КоличествоКТКССуммойИОстатком.ОстатокРаспределения
	|						ИНАЧЕ ВТБезДублей.ОбщаяСуммаСчетаФактуры / КоличествоКТКССуммойИОстатком.НомерКонтейнера
	|					КОНЕЦ КАК ЧИСЛО(15, 2))
	|		КОНЕЦ) КАК НалоговаяБаза,
	|	ВТБезДублей.ВходнаяСтанция.Наименование КАК ВходнаяСтанция,
	|	ВТБезДублей.ВходнаяСтанция.КодЖДСтанции КАК КодВходнойСтанции,
	//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 107705 Начало 20.05.2025
	//Было:          
	//|	ВТБезДублей.СтанцияНазначения.КодЖДСтанции КАК СтанцияНазначения,  
	|	ВТБезДублей.СтанцияНазначения.КодЖДСтанции КАК КодСтанцииНазначения,
	//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 107705 Конец 20.05.2025
	|	ВТБезДублей.СтранаНазначения.КодАльфа2 КАК СтранаНазначения,
	|	ВТБезДублей.ВидДокумента КАК Вид,
	|	ВТБезДублей.НомерДокумента КАК НомерДокумента,
	|	ВТБезДублей.ДатаДокумента КАК ДатаДокумента, 
	//Евросиб(ДИТ) Антонова А.С. US 107157 ТА 107159 Начало 28.04.2025
	|	ВТБезДублей.РегНомерТранзитнойДекларации КАК РегНомерТранзитнойДекларации,
	//Евросиб(ДИТ) Антонова А.С. US 107157 ТА 107159 Конец 28.04.2025
	|	ВТБезДублей.СтранаРазгрузки КАК КодСтраны
	|ИЗ
	|	ВТБезДублей КАК ВТБезДублей
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоКТКССуммойИОстатком КАК КоличествоКТКССуммойИОстатком
	|		ПО ВТБезДублей.СчетФактура = КоличествоКТКССуммойИОстатком.СчетФактура
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТБезДублей.НомерЖДНакладной,
	|	ВТБезДублей.НомерГТД,
	|	ВТБезДублей.СтанцияОтправления.КодЖДСтанции,
	|	ВТБезДублей.СтранаОтправления.КодАльфа2,
	|	ВТБезДублей.НаименованиеСудна.Наименование,
	|	ВТБезДублей.ДатаРазрешенияПогрузки,
	|	ВТБезДублей.ПортРазгрузки.Наименование,
	|	ВТБезДублей.ДоговорКлиента.Наименование,
	|	ВТБезДублей.СчетФактура,
	|	ВТБезДублей.ВходнаяСтанция.Наименование,
	|	ВТБезДублей.ВходнаяСтанция.КодЖДСтанции,
	|	ВТБезДублей.СтанцияНазначения.КодЖДСтанции,
	|	ВТБезДублей.СтранаНазначения.КодАльфа2,
	|	ВТБезДублей.ВидДокумента,
	|	ВТБезДублей.НомерДокумента,
	|	ВТБезДублей.ДатаДокумента, 
	//Евросиб(ДИТ) Антонова А.С. US 107157 ТА 107159 Начало 28.04.2025
	|	ВТБезДублей.РегНомерТранзитнойДекларации,
	//Евросиб(ДИТ) Антонова А.С. US 107157 ТА 107159 Конец 28.04.2025
	|	ВТБезДублей.СтранаРазгрузки  
	|ИТОГИ ПО
	|	Ссылка";
		
	#КонецОбласти
	Запрос.УстановитьПараметр("ФормаРеестра", "ЭкспортИмпорт");
	Запрос.УстановитьПараметр("ДатаС", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаПо", ДатаОкончания);
	МассивВидовПеревозок= Новый Массив;
	МассивВидовПеревозок.Добавить(Справочники.ВидыПеревозок.Транзит);
	МассивВидовПеревозок.Добавить(Справочники.ВидыПеревозок.ТранзитМоре);
	Запрос.УстановитьПараметр("СписокТранзит", МассивВидовПеревозок);
	Запрос.УстановитьПараметр("СписокЭкспортИмпорт", МассивВидовПеревозок);
	
	Результат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(Результат);	

КонецФункции // ПередатьРеестрНДСЭкспортИмпорт()

Функция ПередатьРеестрНДС(xmlParams) Экспорт
	
	Параметры = ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	//++ Глеков Д.В. Ticket#0257625  21.01.2022  
	//для экспорта/импорта как временная заплатка
	Если Параметры.ТипПеревозки = 1 Тогда
	
		Возврат ПередатьРеестрНДСЭкспортИмпорт(Параметры.НачалоПериода, Параметры.КонецПериода);
	
	КонецЕсли;
	//-- Глеков Д.В. Ticket#0257625  21.01.2022
	ТекстЗапроса = ПолучитьТекстЗапросаРеестрНДС(Параметры.ТипПеревозки);    
	
	//Евросиб(ДИТ) Антонова А.С. US 87497 ТА 104723 Начало 22.05.2025
	Если ТекстЗапроса = "" Тогда
		Возврат "";
	КонецЕсли;
	//Евросиб(ДИТ) Антонова А.С. US 87497 ТА 104723 Конец 22.05.2025   
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("НачалоПериода", Параметры.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", Параметры.КонецПериода);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	Для каждого СтрокаСФ Из РезультатЗапроса.Строки Цикл
		СуммаРаспределения = СтрокаСФ.НалоговаяБаза / СтрокаСФ.Номер;
	    ИтоговаяСумма = СтрокаСФ.НалоговаяБаза;
		Для каждого СтрокаНакладная Из СтрокаСФ.Строки Цикл
			СтрокаНакладная.НалоговаяБаза = СуммаРаспределения;
			ИтоговаяСумма = ИтоговаяСумма - СуммаРаспределения;
		КонецЦикла; 
		Если ИтоговаяСумма <> 0 Тогда
			СтрокаНакладная.НалоговаяБаза = СтрокаНакладная.НалоговаяБаза + ИтоговаяСумма;
		КонецЕсли; 
	КонецЦикла;   

	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(РезультатЗапроса);
	
КонецФункции

Функция ПолучитьТекстЗапросаРеестрНДС(ТипПеревозки)
	
	ТекстЗапроса = "";
	Если ТипПеревозки = 1 Тогда
		
		ТекстЗапроса = 
		
//Евросиб Литвинов КВТ ( 22.10.2021 #0247507
		"ВЫБРАТЬ
		|	СчетФактураВыданный.Ссылка КАК СчетФактура
		|ПОМЕСТИТЬ АннулированныеСчетаФактуры
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК КорректировкаРеализации
		|		ПО (КорректировкаРеализации.ДокументРеализации = СчетФактураВыданный.ДокументОснование)
		|ГДЕ
		|	КорректировкаРеализации.Проведен
		|	И СчетФактураВыданный.Проведен
		|	И КорректировкаРеализации.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА СчетФактураВыданный.СуммаУвеличение > 0
		|			ТОГДА СчетФактураВыданный.СуммаУвеличение
		|		ИНАЧЕ СчетФактураВыданный.СуммаУменьшение
		|	КОНЕЦ КАК СуммаКорректировки,
		|	СчетФактураВыданный.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_СуммыКорректировок
		|ИЗ
		|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.Ссылка.Проведен
		|	И СчетФактураВыданный.ДокументОснование ССЫЛКА Документ.КорректировкаРеализации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вложенный.Ссылка КАК Ссылка,
		|	КурсыВалют.Курс / КурсыВалют.Кратность КАК Коэф
		|ПОМЕСТИТЬ КурсыПоДокументу
		|ИЗ
		|	(ВЫБРАТЬ
		|		СчетФактураВыданный.Ссылка КАК Ссылка,
		|		МАКСИМУМ(КурсыВалют.Период) КАК Период,
		|		КурсыВалют.Валюта КАК Валюта
		|	ИЗ
		|		Документ.СчетФактураВыданный.ПодтверждающиеДокументы КАК СчетФактураВыданный
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|			ПО СчетФактураВыданный.Ссылка.ВалютаДокумента = КурсыВалют.Валюта
		|				И СчетФактураВыданный.Ссылка.ДокументОснование.ДатаДокумента >= КурсыВалют.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СчетФактураВыданный.Ссылка,
		|		КурсыВалют.Валюта) КАК Вложенный
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО (Вложенный.Валюта = КурсыВалют.Валюта)
		|			И (Вложенный.Период = КурсыВалют.Период)
		|ГДЕ
		|	Вложенный.Ссылка.Проведен
		|	И Вложенный.Ссылка.УдалитьВключатьВОтчетДляФНС
		|	И Вложенный.Ссылка.УдалитьДатаОтчетаДляФНС МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ Вложенный.Ссылка.Фрахт
		|	И НЕ Вложенный.Ссылка.ВидПеревозки В (ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.Транзит), ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ТранзитМоре))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СчетФактураВыданныйПодтверждающиеДокументы.ЖДН.НомерТранспортногоДокумента КАК Номер,
		|	СчетФактураВыданныйПодтверждающиеДокументы.СтанцияОтправления.КодЖДСтанции КАК СтанцияОтправления,
		|	СчетФактураВыданныйПодтверждающиеДокументы.СтранаОтправления.КодАльфа2 КАК СтранаОтправления,
		|	СчетФактураВыданныйПодтверждающиеДокументы.ВходнаяСтанция.Наименование КАК ВходнаяСтанция,
		|	СчетФактураВыданныйПодтверждающиеДокументы.ВходнаяСтанция.КодЖДСтанции КАК КодВходнойСтанции,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_СуммыКорректировок.СуммаКорректировки, СчетФактураВыданныйПодтверждающиеДокументы.Ссылка.СуммаДокумента) * КурсыПоДокументу.Коэф КАК ЧИСЛО(15, 2)) КАК НалоговаяБаза,
		|	СчетФактураВыданныйПодтверждающиеДокументы.Ссылка.ДоговорКонтрагента.Наименование КАК Примечание,
		|	СчетФактураВыданныйПодтверждающиеДокументы.СтанцияНазначения.КодЖДСтанции КАК СтанцияНазначения,
		|	СчетФактураВыданныйПодтверждающиеДокументы.СтранаНазначения.КодАльфа2 КАК СтранаНазначения,
		|	СчетФактураВыданныйПодтверждающиеДокументы.НомерГТД КАК НомерГТД,
		|	ВЫБОР
		|		КОГДА СчетФактураВыданныйМорскойТранспорт.ТипДокумента = ИСТИНА
		|			ТОГДА ""Поручение""
		|		ИНАЧЕ ""Коносамент""
		|	КОНЕЦ КАК Вид,
		|	СчетФактураВыданныйМорскойТранспорт.НомерДокумента КАК НомерДокумента,
		|	СчетФактураВыданныйМорскойТранспорт.ДатаДокумента КАК ДатаДокумента,
		|	СчетФактураВыданныйМорскойТранспорт.Судно.Наименование КАК НаименованиеСудна,
		|	СчетФактураВыданныйМорскойТранспорт.ДатаРазрешенияПогрузки КАК ДатаПогрузкиРазрешена,
		|	СчетФактураВыданныйМорскойТранспорт.ПортРазгрузки.Наименование КАК ПортРазгрузки,
		|	СчетФактураВыданныйМорскойТранспорт.СтранаРазгрузки.КодАльфа2 КАК КодСтраны,
		|	СчетФактураВыданныйПодтверждающиеДокументы.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СчетФактураВыданный.ПодтверждающиеДокументы КАК СчетФактураВыданныйПодтверждающиеДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыПоДокументу КАК КурсыПоДокументу
		|		ПО (СчетФактураВыданныйПодтверждающиеДокументы.Ссылка = КурсыПоДокументу.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.МорскойТранспорт КАК СчетФактураВыданныйМорскойТранспорт
		|		ПО (СчетФактураВыданныйПодтверждающиеДокументы.Ссылка = СчетФактураВыданныйМорскойТранспорт.Ссылка)
		|			И (СчетФактураВыданныйМорскойТранспорт.КлючСтроки = СчетФактураВыданныйПодтверждающиеДокументы.КлючСтроки)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммыКорректировок КАК ВТ_СуммыКорректировок
		|		ПО (СчетФактураВыданныйПодтверждающиеДокументы.Ссылка = ВТ_СуммыКорректировок.Ссылка)
		|ГДЕ
		|	СчетФактураВыданныйПодтверждающиеДокументы.Ссылка.Проведен
		|	И НЕ СчетФактураВыданныйПодтверждающиеДокументы.Ссылка В
		|				(ВЫБРАТЬ
		|					т.СчетФактура
		|				ИЗ
		|					АннулированныеСчетаФактуры КАК т)
		|	И СчетФактураВыданныйПодтверждающиеДокументы.Ссылка.УдалитьВключатьВОтчетДляФНС
		|	И СчетФактураВыданныйПодтверждающиеДокументы.Ссылка.УдалитьДатаОтчетаДляФНС МЕЖДУ &НачалоПериода И &КонецПериода
		|	И СчетФактураВыданныйПодтверждающиеДокументы.Ссылка.СуммаНДСДокумента = 0
		|	И НЕ СчетФактураВыданныйПодтверждающиеДокументы.Ссылка.Фрахт
		|	И НЕ СчетФактураВыданныйПодтверждающиеДокументы.Ссылка.ВидПеревозки В (ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.Транзит), ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ТранзитМоре))
		|ИТОГИ
		|	КОЛИЧЕСТВО(Номер),
		|	СРЕДНЕЕ(НалоговаяБаза)
		|ПО
		|	СчетФактураВыданныйПодтверждающиеДокументы.Ссылка";
		
		
	ИначеЕсли ТипПеревозки = 2 Тогда 
		ТекстЗапроса =      
		//ДИТ, Беляев СЮ, ТА47958, 10-03-2022, начало
        "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СчетФактураВыданныйДокументыОснования.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ СчФактурыКоторыеНеКорректировали
		|ИЗ
		|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияКорректировокРеализаций КАК ИсторияКорректировокРеализаций
		|		ПО (СчетФактураВыданныйДокументыОснования.ДокументОснование = ИсторияКорректировокРеализаций.КорректируемыйДокумент)
		|ГДЕ
		|	СчетФактураВыданныйДокументыОснования.Ссылка.УдалитьДатаОтчетаДляФНС МЕЖДУ &НачалоПериода И &КонецПериода
		|	И СчетФактураВыданныйДокументыОснования.Ссылка.Проведен
		|	И СчетФактураВыданныйДокументыОснования.Ссылка.УдалитьВключатьВОтчетДляФНС
		|	И ИсторияКорректировокРеализаций.КорректируемыйДокумент ЕСТЬ NULL
		|;
        |
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(СчетФактураВыданный.СуммаУвеличение - СчетФактураВыданный.СуммаУменьшение) КАК СуммаКорректировки,
		|	СчетФактураВыданный.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ СчФактурыПоСогласованиюСторон
		|ИЗ
		|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.Ссылка.Проведен
		|	И СчетФактураВыданный.ДокументОснование ССЫЛКА Документ.КорректировкаРеализации
		|	И СчетФактураВыданный.Ссылка.УдалитьДатаОтчетаДляФНС МЕЖДУ &НачалоПериода И &КонецПериода
		|	И СчетФактураВыданный.Ссылка.УдалитьВключатьВОтчетДляФНС
		|	И СчетФактураВыданный.ДокументОснование.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)
        |
		|СГРУППИРОВАТЬ ПО
		|	СчетФактураВыданный.Ссылка
		|;
        |   
		//ДИТ, Беляев СЮ, ТА47958, 10-03-2022, конец
		|////////////////////////////////////////////////////////////////////////////////
		//Евросиб Литвинов КВТ ( 22.10.2021 #0247507
		|ВЫБРАТЬ
		|	Вложенный.Ссылка КАК Ссылка,
		|	КурсыВалют.Курс / КурсыВалют.Кратность КАК Коэф
		|ПОМЕСТИТЬ КурсыПоДокументу
		|ИЗ
		|	(ВЫБРАТЬ
		|		СчетФактураВыданный.Ссылка КАК Ссылка,
		|		МАКСИМУМ(КурсыВалют.Период) КАК Период,
		|		КурсыВалют.Валюта КАК Валюта
		|	ИЗ
		|		Документ.СчетФактураВыданный.ПодтверждающиеДокументы КАК СчетФактураВыданный
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|			ПО СчетФактураВыданный.Ссылка.ВалютаДокумента = КурсыВалют.Валюта
		|				И СчетФактураВыданный.Ссылка.ДокументОснование.ДатаДокумента >= КурсыВалют.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СчетФактураВыданный.Ссылка,
		|		КурсыВалют.Валюта) КАК Вложенный
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО Вложенный.Валюта = КурсыВалют.Валюта
		|			И Вложенный.Период = КурсыВалют.Период
		|ГДЕ
		|	Вложенный.Ссылка.Проведен
		|	И Вложенный.Ссылка.УдалитьВключатьВОтчетДляФНС
		|	И Вложенный.Ссылка.УдалитьДатаОтчетаДляФНС МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ Вложенный.Ссылка.Фрахт
		|	И Вложенный.Ссылка.ВидПеревозки В (ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.Транзит), ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ТранзитМоре))
		|;
		|ВЫБРАТЬ
//Евросиб Литвинов КВТ ) 22.10.2021 #0247507
		|	СчетФактураВыданныйПодтверждающиеДокументы.ЖДН.НомерТранспортногоДокумента КАК Номер,
		|	СчетФактураВыданныйПодтверждающиеДокументы.СтанцияОтправления.Наименование КАК СтанцияОтправления,
		|	СчетФактураВыданныйПодтверждающиеДокументы.СтанцияОтправления.КодЖДСтанции КАК КодСтанцииОтправления,
		|	СчетФактураВыданныйПодтверждающиеДокументы.СтранаОтправления.КодАльфа2 КАК СтранаСтанцииОтправления,
		|	СчетФактураВыданныйПодтверждающиеДокументы.ВходнаяСтанция.Наименование КАК ВходнаяСтанция,
		|	СчетФактураВыданныйПодтверждающиеДокументы.ВходнаяСтанция.КодЖДСтанции КАК КодВходнойСтанции, 
		//ДИТ, Беляев СЮ, ТА47958, 10-03-2022, начало
		////Евросиб Литвинов КВТ ( 22.10.2021 #0247507
		//|	ВЫРАЗИТЬ(СчетФактураВыданныйПодтверждающиеДокументы.Ссылка.СуммаДокумента * КурсыПоДокументу.Коэф КАК Число(15,2)) КАК НалоговаяБаза,
		////|	СчетФактураВыданныйПодтверждающиеДокументы.Ссылка.СуммаДокумента КАК НалоговаяБаза,
		////Евросиб Литвинов КВТ ) 22.10.2021 #0247507
        |	ВЫРАЗИТЬ(ЕСТЬNULL(СчФактурыПоСогласованиюСторон.СуммаКорректировки, СчетФактураВыданныйПодтверждающиеДокументы.Ссылка.СуммаДокумента) * КурсыПоДокументу.Коэф КАК ЧИСЛО(15, 2)) КАК НалоговаяБаза,
		//ДИТ, Беляев СЮ, ТА47958, 10-03-2022, конец
		|	СчетФактураВыданныйПодтверждающиеДокументы.Ссылка.ДоговорКонтрагента.Наименование КАК Примечание,
		|	СчетФактураВыданныйПодтверждающиеДокументы.СтанцияНазначения.Наименование КАК СтанцияНазначения,
		|	СчетФактураВыданныйПодтверждающиеДокументы.СтанцияНазначения.КодЖДСтанции КАК КодСтанцииНазначения,
		|	СчетФактураВыданныйПодтверждающиеДокументы.СтранаНазначения.КодАльфа2 КАК странаСтанцииНазначения,
		|	СчетФактураВыданныйПодтверждающиеДокументы.НомерГТД КАК НомерГТД,
		|	СчетФактураВыданныйПодтверждающиеДокументы.ВыходнаяСтанция.Наименование КАК ВыходнаяСтанция,
		|	СчетФактураВыданныйПодтверждающиеДокументы.ВыходнаяСтанция.КодЖДСтанции КАК КодВыходнойСтанции
		|ИЗ
		|	Документ.СчетФактураВыданный.ПодтверждающиеДокументы КАК СчетФактураВыданныйПодтверждающиеДокументы
//Евросиб Литвинов КВТ ( 22.10.2021 #0247507
		|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыПоДокументу
		|		ПО СчетФактураВыданныйПодтверждающиеДокументы.Ссылка = КурсыПоДокументу.Ссылка  
//Евросиб Литвинов КВТ ) 22.10.2021 #0247507
        //ДИТ, Беляев СЮ, ТА47958, 10-03-2022, начало
		|ЛЕВОЕ СОЕДИНЕНИЕ СчФактурыПоСогласованиюСторон КАК СчФактурыПоСогласованиюСторон
		|ПО (СчФактурыПоСогласованиюСторон.Ссылка = СчетФактураВыданныйПодтверждающиеДокументы.Ссылка)  
		//ДИТ, Беляев СЮ, ТА47958, 10-03-2022, конец
		|ГДЕ
		|	СчетФактураВыданныйПодтверждающиеДокументы.Ссылка.Проведен
		|	И СчетФактураВыданныйПодтверждающиеДокументы.Ссылка.УдалитьВключатьВОтчетДляФНС
		|	И СчетФактураВыданныйПодтверждающиеДокументы.Ссылка.УдалитьДатаОтчетаДляФНС МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ СчетФактураВыданныйПодтверждающиеДокументы.Ссылка.Фрахт
		|	И СчетФактураВыданныйПодтверждающиеДокументы.Ссылка.ВидПеревозки В(ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.Транзит),ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ТранзитМоре)) 
		//ДИТ, Беляев СЮ, ТА47958, 10-03-2022, начало
		|	И СчетФактураВыданныйПодтверждающиеДокументы.Ссылка В
		|										(ВЫБРАТЬ
		|												СчФактурыКоторыеНеКорректировали.Ссылка
		|											ИЗ
		|										СчФактурыКоторыеНеКорректировали КАК СчФактурыКоторыеНеКорректировали)  
		//ДИТ, Беляев СЮ, ТА47958, 10-03-2022, конец
		|ИТОГИ
		//++ Глеков Д.В. Ticket#0257625  21.01.2022 
		|	КОЛИЧЕСТВО(Номер), СРЕДНЕЕ(НалоговаяБаза)
		//-- Глеков Д.В. Ticket#0257625  21.01.2022
		|ПО
		|	СчетФактураВыданныйПодтверждающиеДокументы.Ссылка"
	ИначеЕсли ТипПеревозки = 3 Тогда
		
		ТекстЗапроса =  
		//ДИТ, Беляев СЮ, ТА47958, 10-03-2022, начало
        "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СчетФактураВыданныйДокументыОснования.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ СчФактурыКоторыеНеКорректировали
		|ИЗ
		|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияКорректировокРеализаций КАК ИсторияКорректировокРеализаций
		|		ПО (СчетФактураВыданныйДокументыОснования.ДокументОснование = ИсторияКорректировокРеализаций.КорректируемыйДокумент)
		|ГДЕ
		|	СчетФактураВыданныйДокументыОснования.Ссылка.УдалитьДатаОтчетаДляФНС МЕЖДУ &НачалоПериода И &КонецПериода
		|	И СчетФактураВыданныйДокументыОснования.Ссылка.Проведен
		|	И СчетФактураВыданныйДокументыОснования.Ссылка.УдалитьВключатьВОтчетДляФНС
		|	И ИсторияКорректировокРеализаций.КорректируемыйДокумент ЕСТЬ NULL
		|;
        |
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(СчетФактураВыданный.СуммаУвеличение - СчетФактураВыданный.СуммаУменьшение) КАК СуммаКорректировки,
		|	СчетФактураВыданный.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ СчФактурыПоСогласованиюСторон
		|ИЗ
		|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.Ссылка.Проведен
		|	И СчетФактураВыданный.ДокументОснование ССЫЛКА Документ.КорректировкаРеализации
		|	И СчетФактураВыданный.Ссылка.УдалитьДатаОтчетаДляФНС МЕЖДУ &НачалоПериода И &КонецПериода
		|	И СчетФактураВыданный.Ссылка.УдалитьВключатьВОтчетДляФНС
		|	И СчетФактураВыданный.ДокументОснование.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)
        |
		|СГРУППИРОВАТЬ ПО
		|	СчетФактураВыданный.Ссылка
		|;
        |   
		//ДИТ, Беляев СЮ, ТА47958, 10-03-2022, конец
		|////////////////////////////////////////////////////////////////////////////////
		//Евросиб Литвинов КВТ ( 22.10.2021 #0247507 
		|
		|ВЫБРАТЬ
		|	Вложенный.Ссылка КАК Ссылка,
		|	КурсыВалют.Курс / КурсыВалют.Кратность КАК Коэф
		|ПОМЕСТИТЬ КурсыПоДокументу
		|ИЗ
		|	(ВЫБРАТЬ
		|		СчетФактураВыданный.Ссылка КАК Ссылка,
		|		МАКСИМУМ(КурсыВалют.Период) КАК Период,
		|		КурсыВалют.Валюта КАК Валюта
		|	ИЗ
		|		Документ.СчетФактураВыданный.ПодтверждающиеДокументы КАК СчетФактураВыданный
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|			ПО СчетФактураВыданный.Ссылка.ВалютаДокумента = КурсыВалют.Валюта
		|				И СчетФактураВыданный.Ссылка.ДокументОснование.ДатаДокумента >= КурсыВалют.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СчетФактураВыданный.Ссылка,
		|		КурсыВалют.Валюта) КАК Вложенный
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО Вложенный.Валюта = КурсыВалют.Валюта
		|			И Вложенный.Период = КурсыВалют.Период
		|ГДЕ
		|	Вложенный.Ссылка.Проведен
		|	И Вложенный.Ссылка.Фрахт
		|	И Вложенный.Ссылка.УдалитьВключатьВОтчетДляФНС
		|	И Вложенный.Ссылка.УдалитьДатаОтчетаДляФНС МЕЖДУ &НачалоПериода И &КонецПериода
		|;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	ВЫРАЗИТЬ(СчетФактураВыданныйМорскойТранспорт.Ссылка.СуммаДокумента * КурсыПоДокументу.Коэф КАК Число(15,2)) КАК НалоговаяБаза,
		//ДИТ, Беляев СЮ, ТА47958, 10-03-2022, начало
		|ВЫРАЗИТЬ(ЕСТЬNULL(СчФактурыПоСогласованиюСторон.СуммаКорректировки, СчетФактураВыданныйМорскойТранспорт.Ссылка.СуммаДокумента) * КурсыПоДокументу.Коэф КАК ЧИСЛО(15, 2)) КАК НалоговаяБаза,
		//ДИТ, Беляев СЮ, ТА47958, 10-03-2022, конец
		//|	СчетФактураВыданныйМорскойТранспорт.Ссылка.СуммаДокумента КАК НалоговаяБаза,
//Евросиб Литвинов КВТ ) 22.10.2021 #0247507
		|	СчетФактураВыданныйМорскойТранспорт.Ссылка.ДоговорКонтрагента.Наименование КАК Примечание,
		|	ВЫБОР
		|		КОГДА СчетФактураВыданныйМорскойТранспорт.ТипДокумента = ИСТИНА
		|			ТОГДА ""Поручение""
		|		ИНАЧЕ ""Коносамент""
		|	КОНЕЦ КАК Вид,
		|	СчетФактураВыданныйМорскойТранспорт.НомерДокумента КАК Номер,
		|	СчетФактураВыданныйМорскойТранспорт.ДатаДокумента КАК Дата,
		|	СчетФактураВыданныйМорскойТранспорт.Судно.Наименование КАК НаименованиеСудна,
		|	СчетФактураВыданныйМорскойТранспорт.Судно.flag КАК КодСтраныСудна,
		|	СчетФактураВыданныйМорскойТранспорт.СтранаРазгрузки.КодАльфа2 КАК КодСтраныПортаРазгрузки,
		|	СчетФактураВыданныйМорскойТранспорт.ПортРазгрузки.Наименование КАК НаименованиеПортаРазгрузки,
		//++ Глеков Д.В. Ticket#0259536 04.02.2022 
		|	Выбор Когда СчетФактураВыданныйМорскойТранспорт.СтранаРазгрузки <> Значение(Справочник.СтраныМира.Россия) Тогда СчетФактураВыданныйМорскойТранспорт.ДатаРазрешенияПогрузки Иначе ДатаВремя(1,1,1) Конец КАК ДатаПогрузкаРазрешена,
		|	ДатаВремя(1,1,1) КАК ДатаВыгрузкаРазрешена,
		//-- Глеков Д.В. Ticket#0259536 04.02.2022
		|	СчетФактураВыданныйМорскойТранспорт.НомерГТД КАК НомерГТД,
		|	СчетФактураВыданныйМорскойТранспорт.СтранаПогрузки.КодАльфа2 КАК КодСтраныПортаПогрузки,
		|	СчетФактураВыданныйМорскойТранспорт.ПортПогрузки.Наименование КАК НаименованиеПортаПогрузки
		|ИЗ
		|	Документ.СчетФактураВыданный.МорскойТранспорт КАК СчетФактураВыданныйМорскойТранспорт
//Евросиб Литвинов КВТ ( 22.10.2021 #0247507
		|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыПоДокументу
		|		ПО СчетФактураВыданныйМорскойТранспорт.Ссылка = КурсыПоДокументу.Ссылка
//Евросиб Литвинов КВТ ) 22.10.2021 #0247507    
		//ДИТ, Беляев СЮ, ТА47958, 10-03-2022, начало
		|		ЛЕВОЕ СОЕДИНЕНИЕ СчФактурыПоСогласованиюСторон КАК СчФактурыПоСогласованиюСторон
		|		ПО (СчФактурыПоСогласованиюСторон.Ссылка = СчетФактураВыданныйМорскойТранспорт.Ссылка) 
		//ДИТ, Беляев СЮ, ТА47958, 10-03-2022, конец
		|ГДЕ
		|	СчетФактураВыданныйМорскойТранспорт.Ссылка.Проведен
		|	И СчетФактураВыданныйМорскойТранспорт.Ссылка.Фрахт
		|	И СчетФактураВыданныйМорскойТранспорт.Ссылка.УдалитьВключатьВОтчетДляФНС
		|	И СчетФактураВыданныйМорскойТранспорт.Ссылка.УдалитьДатаОтчетаДляФНС МЕЖДУ &НачалоПериода И &КонецПериода
		//++ Глеков Д.В. Ticket#0257978 02.02.2022 
		|	И Не СчетФактураВыданныйМорскойТранспорт.Ссылка в (ВЫБРАТЬ
		|	СчетФактураВыданный.Ссылка КАК СчетФактура
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК КорректировкаРеализации
		|		ПО (КорректировкаРеализации.ДокументРеализации = СчетФактураВыданный.ДокументОснование)
		|ГДЕ
		|	КорректировкаРеализации.Проведен
		|	И СчетФактураВыданный.Проведен
		|	И КорректировкаРеализации.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование))
		//-- Глеков Д.В. Ticket#0257978 02.02.2022
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Номер), СРЕДНЕЕ(НалоговаяБаза)
		|ПО
		|	СчетФактураВыданныйМорскойТранспорт.Ссылка";
	КонецЕсли;
	
	Возврат ТекстЗапроса;
КонецФункции

//Евросиб(ДИТ) Антонова А.С. US 90779 19.05.2025   
Функция ПередатьДанныеПоРеестрамНДС(xmlParams) Экспорт   
	
	Параметры = ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams); 
	
	//ТипПеревозки = 1 - Реестр НДС Приложение 7  (КНД 1155112) - Экспорт/Импорт
	Если Параметры.ТипПеревозки = 1 Тогда
		ФормаРеестра = "ЭкспортИмпорт";
		СтрокаВыводимыхПолей = "Номер,НомерГТД,КодСтанцииОтправления,СтранаОтправления,НаименованиеСудна,ДатаПогрузкиРазрешена,ПортРазгрузки,"
		+ "Примечание,Ссылка,НалоговаяБаза,ВходнаяСтанция,КодВходнойСтанции,КодСтанцииНазначения,СтранаНазначения,Вид,НомерДокумента,ДатаДокумента,"
		+ "РегНомерТранзитнойДекларации,КодСтраны";
		
	//ТипПеревозки = 2 - Реестр НДС Приложение 11 (КНД 1155122) - Транзит
	ИначеЕсли Параметры.ТипПеревозки = 2 Тогда
		ФормаРеестра = "Транзит";  
		СтрокаВыводимыхПолей = "Номер,СтанцияОтправления,КодСтанцииОтправления,СтранаСтанцииОтправления,ВходнаяСтанция,КодВходнойСтанции,"
		+ "НалоговаяБаза,Примечание,СтанцияНазначения,КодСтанцииНазначения,СтранаСтанцииНазначения,НомерГТД,ВыходнаяСтанция,КодВыходнойСтанции";
		
	//ТипПеревозки = 3 - Реестр НДС Приложение 10 (КНД 1155115) - Фрахт
	ИначеЕсли Параметры.ТипПеревозки = 3 Тогда
		ФормаРеестра = "Фрахт"; 
		СтрокаВыводимыхПолей = "НалоговаяБаза,Примечание,Вид,Номер,Дата,НаименованиеСудна,КодСтраныСудна,КодСтраныПортаРазгрузки,"
		+ "НаименованиеПортаРазгрузки,ДатаПогрузкаРазрешена,ДатаВыгрузкаРазрешена,НомерГТД,КодСтраныПортаПогрузки,НаименованиеПортаПогрузки,Ссылка";
		
	//ТипПеревозки = 4 - Реестр НДС Приложение 8  (КНД 1155113) - Авто
	ИначеЕсли Параметры.ТипПеревозки = 4 Тогда
	    ФормаРеестра = "Авто";   
		СтрокаВыводимыхПолей = "НомерДокумента,ДатаДокумента,Код,НомерТаможеннойНакладной,НомерГТД,Отправитель_ИНН,Отправитель_Наименование,"
		+ "Отправитель_Адрес,Получатель_ИНН,Получатель_Наименование,Получатель_Адрес,Перевозчик_ИНН,Перевозчик_Наименование,Перевозчик_Адрес,"
		+ "РегНомерАвто,РегНомерПрицепа,СтранаРазгрузки,СтранаПогрузки,НалоговаяБаза,Примечание,Ссылка";
		
	КонецЕсли;  
	
	ВыводимыеПоля = СтрРазделить(СтрокаВыводимыхПолей, ",", Ложь);
	
	Параметры.Вставить("ФормаРеестра", ФормаРеестра);
	
	Период = Новый СтандартныйПериод(Параметры.НачалоПериода, Параметры.КонецПериода); 
	Параметры.Вставить("Период", Период);
	
	Данные = ПолучитьДанныеЧерезМакетСКД("ДанныеРеестровНДСдляУПП", Параметры,,Истина,ВыводимыеПоля);  
	
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(Данные);

КонецФункции 

//Евросиб Гудкова( 20.09.2020 Ticket№ 0207337
Функция СоздатьСчетПоставщика(XMLParams) Экспорт

	СтруктураЗаказа = ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
#Область Запрос
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Шапка.ВалютаДокументаКод КАК ВалютаДокументаКод,
	               |	Шапка.УИДДоговораКонтаргента КАК УИДДоговораКонтаргента,
	               |	Шапка.УИДКонтрагента КАК УИДКонтрагента,
	               |	Шапка.ОрганизацияКод КАК ОрганизацияКод,
	               |	Шапка.НомерУПП КАК НомерУПП,
	               |	Шапка.ДатаУПП КАК ДатаУПП,
	               |	Шапка.ДатаОплаты КАК ДатаОплаты,
	               |	Шапка.ДатаПоступления КАК ДатаПоступления,
	               |	Шапка.Комментарий КАК Комментарий,
	               |	Шапка.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	               |	Шапка.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	               |	Шапка.ОтветственныйНаименование КАК ОтветственныйНаименование,
	               |	Шапка.ПодразделениеКод КАК ПодразделениеКод,
	               |	Шапка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	               |	Шапка.СуммаДокумента КАК СуммаДокумента,
	               |	Шапка.УчитыватьНДС КАК УчитыватьНДС,
	               |	Шапка.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	               |	Шапка.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента
	               |ПОМЕСТИТЬ ВТ_Шапка
	               |ИЗ
	               |	&Шапка КАК Шапка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Услуги.НомерСтроки КАК НомерСтроки,
	               |	Услуги.Содержание КАК Содержание,
	               |	Услуги.Количество КАК Количество,
	               |	Услуги.Цена КАК Цена,
	               |	Услуги.Сумма КАК Сумма,
	               |	Услуги.СтавкаНДС КАК СтавкаНДС,
	               |	Услуги.СуммаНДС КАК СуммаНДС,
	               |	Услуги.НоменклатураКод КАК НоменклатураКод
	               |ПОМЕСТИТЬ ВТ_Услуги
	               |ИЗ
	               |	&Услуги КАК Услуги
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Шапка.ВалютаДокументаКод КАК ВалютаДокументаКод,
	               |	ВТ_Шапка.УИДДоговораКонтаргента КАК УИДДоговораКонтаргента,
	               |	ВТ_Шапка.УИДКонтрагента КАК УИДКонтрагента,
	               |	ВТ_Шапка.ОрганизацияКод КАК ОрганизацияКод,
	               |	ВТ_Шапка.НомерУПП КАК НомерУПП,
	               |	ВТ_Шапка.ДатаУПП КАК ДатаУПП,
	               |	ВТ_Шапка.ДатаОплаты КАК ДатаОплаты,
	               |	ВТ_Шапка.ДатаПоступления КАК ДатаПоступления,
	               |	ВТ_Шапка.Комментарий КАК Комментарий,
	               |	ВТ_Шапка.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	               |	ВТ_Шапка.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	               |	ВТ_Шапка.ОтветственныйНаименование КАК ОтветственныйНаименование,
	               |	ВТ_Шапка.ПодразделениеКод КАК ПодразделениеКод,
	               |	ВТ_Шапка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	               |	ВТ_Шапка.СуммаДокумента КАК СуммаДокумента,
	               |	ВТ_Шапка.УчитыватьНДС КАК УчитыватьНДС,
	               |	ВТ_Шапка.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	               |	ВТ_Шапка.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	               |	Организации.Ссылка КАК Организация,
	               |	ЦентрыФинансовойОтветственности.Ссылка КАК ЦФО,
	               |	Пользователи.Ссылка КАК Автор,
	               |	Пользователи.Подразделение КАК ПодразделениеОрганизации,
	               |	Контрагенты.Объект КАК Контрагент,
	               |	Договоры.Объект КАК ДоговорКонтрагента,
	               |	Валюты.Ссылка КАК ВалютаДокумента
	               |ИЗ
	               |	ВТ_Шапка КАК ВТ_Шапка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	               |		ПО ВТ_Шапка.ОрганизацияКод = Организации.Код
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦентрыФинансовойОтветственности КАК ЦентрыФинансовойОтветственности
	               |		ПО ВТ_Шапка.ПодразделениеКод = ЦентрыФинансовойОтветственности.Код
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	               |		ПО ВТ_Шапка.ОтветственныйНаименование = Пользователи.Наименование
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Контрагенты
	               |		ПО ВТ_Шапка.УИДКонтрагента = Контрагенты.УИДИсточника
	               |			И (Контрагенты.УзелОбмена = ЗНАЧЕНИЕ(перечисление.УзлыОбмена.БитФинанс))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Договоры
	               |		ПО ВТ_Шапка.УИДДоговораКонтаргента = Договоры.УИДИсточника
	               |			И (Договоры.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	               |		ПО ВТ_Шапка.ВалютаДокументаКод = Валюты.Код
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Услуги.НомерСтроки КАК НомерСтроки,
	               |	ВТ_Услуги.Содержание КАК Содержание,
	               |	ВТ_Услуги.Количество КАК Количество,
	               |	ВТ_Услуги.Цена КАК Цена,
	               |	ВТ_Услуги.Сумма КАК Сумма,
	               |	ВТ_Услуги.СтавкаНДС КАК СтавкаНДС,
	               |	ВТ_Услуги.СуммаНДС КАК СуммаНДС,
	               |	ВТ_Услуги.НоменклатураКод КАК НоменклатураКод,
				   //Евросиб Каблов 24.11.2020 (
	               //|	Номенклатура.Объект КАК Номенклатура
				   |	ЕСТЬNULL(Номенклатура.Объект, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПредоставлениеПлатформ)) КАК Номенклатура
				   //Евросиб Каблов 24.11.2020 )
	               |ИЗ
	               |	ВТ_Услуги КАК ВТ_Услуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Номенклатура
	               |		ПО ВТ_Услуги.НоменклатураКод = Номенклатура.УИДИсточника
	               |			И (Номенклатура.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
				   //Евросиб Каблов 17.06.2021 ( Ticket#0235050
				   |			И Номенклатура.НУИНУ = 0";
				   //Евросиб Каблов 17.06.2021 ) 
				   
	Запрос.УстановитьПараметр("Шапка", СтруктураЗаказа.Шапка);
	Запрос.УстановитьПараметр("Услуги", СтруктураЗаказа.Услуги);
	Результат = Запрос.ВыполнитьПакет();
#КонецОбласти 	
	СтруктураЗаказа.Шапка = Результат[2].Выгрузить();
	СтруктураЗаказа.Услуги = Результат[3].Выгрузить();
	
	СтруктураОтвета = Новый Структура("Сообщение, ГУИД", "", "");
	Попытка
		СчетОбъект = Документы.СчетНаОплатуПоставщика.СоздатьДокумент();
		СчетОбъект.Заполнить(СтруктураЗаказа);
		СчетОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Ссылка = СчетОбъект.Ссылка;
		СтруктураОтвета.ГУИД = Ссылка.УникальныйИдентификатор();
		СтруктураПоиска = Новый Структура("ДействиеПриОбмене, УзелОбмена, Объект", Перечисления.ДействияПриОбмене.ВыгрузкаДанных, Перечисления.УзлыОбмена.УППЗаказ, Ссылка);
		СтруктураДанных = Новый Структура("УИДИсточника, ПроведенВБУ, НомерДатаВБУ, Ответственный", СтруктураОтвета.ГУИД, Истина, СтруктураЗаказа.Шапка[0].НомерУПП + " от " + СтруктураЗаказа.Шапка[0].ДатаУПП, СтруктураЗаказа.Шапка[0].ОтветственныйНаименование);
		РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных, СтруктураОтвета.Сообщение);
	Исключение
		СтруктураОтвета.Сообщение = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(СтруктураОтвета);

КонецФункции // СоздатьСчетПоставщика()

//Евросиб Гудкова( 20.09.2020 Ticket№ 0207320
Функция СоздатьКДНаОстаток(XMLParams) Экспорт

	ТЗРезультат = Новый ТаблицаЗначений;	
	ТЗРезультат.Колонки.Добавить("ГУИДПП");
	ТЗРезультат.Колонки.Добавить("Комментарий");
	
	СтруктураДанных = ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	Организация = Справочники.Организации.НайтиПоКоду(СтруктураДанных.ОрганизацияКод);
	Ошибки = "";
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Ошибки = "Не найдена организация!";
				СтрокаТЗРезультата = ТЗРезультат.Добавить();
				СтрокаТЗРезультата.Комментарий = Ошибки;
				СтрокаТЗРезультата.ГУИДПП = СтруктураДанных.ТабТЧКД[0].ГУИДППУПП;
		Возврат ТЗРезультат;
	КонецЕсли; 
	
	СсылкаПП = РегистрыСведений.ПротоколОбменов.СсылкаПоУИД(СтруктураДанных.ГУИДППУПП, Перечисления.ДействияПриОбмене.ЗагрузкаДанных, Перечисления.УзлыОбмена.УПП);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КорректировкаДолгаДебиторскаяЗадолженность.Ссылка КАК СсылкаКД,
	               |	КорректировкаДолгаДебиторскаяЗадолженность.Ссылка.Проведен КАК Проведен
	               |ИЗ
	               |	Документ.КорректировкаДолга.ДебиторскаяЗадолженность КАК КорректировкаДолгаДебиторскаяЗадолженность
	               |ГДЕ
	               |	КорректировкаДолгаДебиторскаяЗадолженность.Сделка = &Сделка";
	Запрос.УстановитьПараметр("Сделка", СсылкаПП);
	ТЗРез = Запрос.Выполнить().Выгрузить();
	Если ТЗРез.Количество() > 0 Тогда
		Если ТЗРез[0].Проведен Тогда
			СтрокаТЗРезультата = ТЗРезультат.Добавить();
			СтрокаТЗРезультата.ГУИДПП = СтруктураДанных.ГУИДППУПП;
			СтрокаТЗРезультата.Комментарий = "В Датакоре уже проведена " + ТЗРез[0].СсылкаКД + ". Повторная выгрузка невозможна.";
			Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(ТЗРезультат);
		Иначе
			КДОбъект = ТЗРез[0].СсылкаКД.ПолучитьОбъект();
			КДОбъект.ПометкаУдаления = Ложь;
			КДОбъект.ДебиторскаяЗадолженность.Очистить();
			КДОбъект.КредиторскаяЗадолженность.Очистить();
		КонецЕсли;
	Иначе
		КДОбъект = Документы.КорректировкаДолга.СоздатьДокумент();
	КонецЕсли; 
	Отказ = Ложь;
		
	КДОбъект.Дата = Дата("20201001");
	ЗаполнитьЗначенияСвойств(КДОбъект, СсылкаПП, ,"Номер, Дата");
	КДОбъект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ФормированиеЗадолженности;
	КДОбъект.КонтрагентДебитор = СсылкаПП.Контрагент;
	КДОбъект.КонтрагентКредитор = СсылкаПП.Контрагент;
	КДОбъект.Комментарий = "Загружено из УПП для остатка. " + СсылкаПП.Комментарий;
	КДОбъект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику;
			
	НСтр = КДОбъект.ДебиторскаяЗадолженность.Добавить();
	ЗаполнитьЗначенияСвойств(НСтр, СсылкаПП.РасшифровкаПлатежа[0], "ДоговорКонтрагента, КурсВзаиморасчетов, КратностьВзаиморасчетов, СтавкаНДС");
	НСтр.ДатаВзаиморасчетов = СсылкаПП.ДатаВзаиморасчетов;
	НСтр.КорДоговорКонтрагента = НСтр.ДоговорКонтрагента;
	Нстр.Сумма = СтруктураДанных.ОстатокСумма;
	Нстр.СуммаВзаиморасчетов = НСтр.Сумма * Нстр.КурсВзаиморасчетов / Нстр.КратностьВзаиморасчетов;
	НСтр.НДСВключая = Истина;
	НСтр.Сделка = СсылкаПП;

	НачатьТранзакцию();
	Попытка
		КДОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//добавляем историю в регистр загрузок
		//СтруктураПоиска = Новый Структура("ДействиеПриОбмене, УзелОбмена, Объект", Перечисления.ДействияПриОбмене.ЗагрузкаДанных, Перечисления.УзлыОбмена.УПП, ППСсылка);
		//СтруктураДанных = Новый Структура("УИДИсточника, НомерДатаВБУ, ПроведенВБУ, Ответственный", СтруктураДанных.ТабТЧКД[0].ГУИДППУПП,  СтруктураДанных.ТабТЧКД[0].НомерПП + " от " + СтруктураДанных.ТабТЧКД[0].ДатаПП, Истина, Пользователи.ТекущийПользователь());
		//РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных);
		
		ЗафиксироватьТранзакцию();
	Исключение
		Ошибки = Ошибки + "Не удалось записать документ " + ОписаниеОшибки();
		ОтменитьТранзакцию();
		Отказ = Истина;
	КонецПопытки;
		
	Если ЗначениеЗаполнено(Ошибки) Тогда
		СтрокаТЗРезультата = ТЗРезультат.Добавить();
		СтрокаТЗРезультата.ГУИДПП = СтруктураДанных.ТабТЧКД[0].ГУИДППУПП;
		СтрокаТЗРезультата.Комментарий = Ошибки;
	КонецЕсли;
		
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(ТЗРезультат);
	
КонецФункции // СоздатьКДНаОстаток()
 
// Евросиб Гудкова))

//Евросиб Каблов 14.12.2022 US 56988
Функция СоздатьПланыПоступленийСписаний(XMLParams) Экспорт
	
	ТаблицаОшибок = Новый ТаблицаЗначений;	
	ТаблицаОшибок.Колонки.Добавить("ГУИДПланаУПП");
	ТаблицаОшибок.Колонки.Добавить("ПредставлениеПлана");
	ТаблицаОшибок.Колонки.Добавить("Комментарий");
	
	СтруктураДанных = ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	
	Планы = СтруктураДанных.Планы;
	СтрокиПланов = СтруктураДанных.СтрокиПланов;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Планы.ГУИДПланаУПП КАК ГУИДПланаУПП,
	|	Планы.ОрганизацияКод КАК ОрганизацияКод,
	|	Планы.Дата КАК Дата,
	|	Планы.Номер КАК Номер,
	|	Планы.Проведен КАК Проведен,
	|	Планы.ПодразделениеКод КАК ПодразделениеКод,
	|	Планы.ДатаНачала КАК ДатаНачала,
	|	Планы.ДатаОкончания КАК ДатаОкончания,
	|	Планы.СценарийНаименование КАК СценарийНаименование,
	|	Планы.ОтветственныйНаименование КАК ОтветственныйНаименование
	|ПОМЕСТИТЬ Планы
	|ИЗ
	|	&Планы КАК Планы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Строки.ГУИДПланаУПП КАК ГУИДПланаУПП,
	|	Строки.ВидДвижения КАК ВидДвижения,
	|	Строки.СтатьяДвиженияДенежныхСредствКод КАК СтатьяДвиженияДенежныхСредствКод,
	|	Строки.УИДКонтрагента КАК УИДКонтрагента,
	|	Строки.УИДДоговораКонтрагента КАК УИДДоговораКонтрагента,
	|	Строки.ДатаДвижения КАК ДатаДвижения,
	|	Строки.ВалютаКод КАК ВалютаКод,
	|	Строки.Сумма КАК Сумма,
	|	Строки.КонтрагентПредставление КАК КонтрагентПредставление,
	|	Строки.ДоговорПредставление КАК ДоговорПредставление
	|ПОМЕСТИТЬ Строки
	|ИЗ
	|	&Строки КАК Строки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Планы.ГУИДПланаУПП КАК ГУИДПланаУПП,
	|	Планы.Дата КАК Дата,
	|	Планы.Номер КАК Номер,
	|	Планы.Проведен КАК Проведен,
	|	Планы.ПодразделениеКод КАК ПодразделениеКод,
	|	Планы.ДатаНачала КАК ДатаНачала,
	|	Планы.ДатаОкончания КАК ДатаОкончания,
	|	Планы.СценарийНаименование КАК СценарийНаименование,
	|	ЗагруженныеПланы.Объект КАК ПланСсылка,
	|	Организации.Ссылка КАК Организация,
	|	ЦентрыФинансовойОтветственности.Ссылка КАК ЦФО,
	|	ЦентрыФинансовойОтветственности.Подразделение КАК Подразделение,
	|	ВариантыПланаПродаж.Ссылка КАК ВариантПланаПродаж,
	|	Пользователи.Ссылка КАК Ответственный
	|ИЗ
	|	Планы КАК Планы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ЗагруженныеПланы
	|		ПО Планы.ГУИДПланаУПП = ЗагруженныеПланы.УИДИсточника
	|			И (ЗагруженныеПланы.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	|			И (ЗагруженныеПланы.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦентрыФинансовойОтветственности КАК ЦентрыФинансовойОтветственности
	|		ПО Планы.ПодразделениеКод = ЦентрыФинансовойОтветственности.Код
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыПланаПродаж КАК ВариантыПланаПродаж
	|		ПО Планы.СценарийНаименование = ВариантыПланаПродаж.Наименование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО Планы.ОрганизацияКод = Организации.Код
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО Планы.ОтветственныйНаименование = Пользователи.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Строки.ГУИДПланаУПП КАК ГУИДПланаУПП,
	|	Строки.ВидДвижения КАК ВидДвижения,
	|	Строки.СтатьяДвиженияДенежныхСредствКод КАК СтатьяДвиженияДенежныхСредствКод,
	|	Строки.УИДКонтрагента КАК УИДКонтрагента,
	|	Строки.УИДДоговораКонтрагента КАК УИДДоговораКонтрагента,
	|	НАЧАЛОПЕРИОДА(Строки.ДатаДвижения, ДЕНЬ) КАК ДатаДвижения,
	|	Строки.ВалютаКод КАК ВалютаКод,
	|	Строки.Сумма КАК Сумма,
	|	Контрагенты.Объект КАК Контрагент,
	|	ДоговорыКонтрагентов.Объект КАК ДоговорКонтрагента,
	|	Статьи.Ссылка КАК СтатьяДвиженияДенежныхСредств,
	|	Валюты.Ссылка КАК Валюта,
	|	Строки.КонтрагентПредставление КАК КонтрагентПредставление,
	|	Строки.ДоговорПредставление КАК ДоговорПредставление
	|ПОМЕСТИТЬ СтрокиСсылки
	|ИЗ
	|	Строки КАК Строки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК Контрагенты
	|		ПО Строки.УИДКонтрагента = Контрагенты.УИДИсточника
	|			И (Контрагенты.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|			И (Контрагенты.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ДоговорыКонтрагентов
	|		ПО Строки.УИДДоговораКонтрагента = ДоговорыКонтрагентов.УИДИсточника
	|			И (ДоговорыКонтрагентов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
	|			И (ДоговорыКонтрагентов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтатьиДвиженияДенежныхСредств КАК Статьи
	|		ПО Строки.СтатьяДвиженияДенежныхСредствКод = Статьи.Код
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО Строки.ВалютаКод = Валюты.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтрокиСсылки.ГУИДПланаУПП КАК ГУИДПланаУПП,
	|	СтрокиСсылки.ВидДвижения КАК ВидДвижения,
	|	СтрокиСсылки.СтатьяДвиженияДенежныхСредствКод КАК СтатьяДвиженияДенежныхСредствКод,
	|	СтрокиСсылки.УИДКонтрагента КАК УИДКонтрагента,
	|	СтрокиСсылки.УИДДоговораКонтрагента КАК УИДДоговораКонтрагента,
	|	СтрокиСсылки.ДатаДвижения КАК ДатаДвижения,
	|	СтрокиСсылки.Сумма КАК Сумма,
	|	СтрокиСсылки.Контрагент КАК Контрагент,
	|	СтрокиСсылки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СтрокиСсылки.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	СтрокиСсылки.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА СтрокиСсылки.Валюта = &ВалютаРубль
	|			ТОГДА СтрокиСсылки.Сумма
	|		ИНАЧЕ СтрокиСсылки.Сумма * КурсыВалют.Курс / КурсыВалют.Кратность
	|	КОНЕЦ КАК СуммаРуб,
	|	СтрокиСсылки.КонтрагентПредставление КАК КонтрагентПредставление,
	|	СтрокиСсылки.ДоговорПредставление КАК ДоговорПредставление,
	|	СтрокиСсылки.ВалютаКод КАК ВалютаКод
	|ИЗ
	|	СтрокиСсылки КАК СтрокиСсылки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО СтрокиСсылки.Валюта = КурсыВалют.Валюта
	|			И СтрокиСсылки.ДатаДвижения = КурсыВалют.Период";
	
	Запрос.УстановитьПараметр("Планы", Планы);
	Запрос.УстановитьПараметр("Строки", СтрокиПланов);
	Запрос.УстановитьПараметр("ВалютаРубль", Справочники.Валюты.Рубль);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Планы = РезультатыЗапроса[2].Выгрузить();
	СтрокиПланов = РезультатыЗапроса[4].Выгрузить();
	
	ОсновнаяОрганизация = Константы.ОсновнаяОрганизация.Получить();
	ТекДата = ТекущаяДата();
	КоличествоЗагруженныхПланов = 0;
	
	Для Каждого СтрокаТаблицыПланов Из Планы Цикл
		
		ЕстьОшибки = Ложь;
		
		НомерДатаВБУ = СтрШаблон("%1 от %2", СтрокаТаблицыПланов.Номер, Формат(СтрокаТаблицыПланов.Дата, "ДФ=dd.MM.yyyy"));
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицыПланов.Организация) Тогда
			СтрокаТЗРезультата = ТаблицаОшибок.Добавить();
			СтрокаТЗРезультата.Комментарий = "Не найдена организация!";
			СтрокаТЗРезультата.ПредставлениеПлана = НомерДатаВБУ;
			СтрокаТЗРезультата.ГУИДПланаУПП = СтрокаТаблицыПланов.ГУИДПланаУПП;
			ЕстьОшибки = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицыПланов.ВариантПланаПродаж) Тогда
			СтрокаТЗРезультата = ТаблицаОшибок.Добавить();
			СтрокаТЗРезультата.Комментарий = СтрШаблон("Не найден Вариант плана продаж (Сценарий в УПП) %1!", СтрокаТаблицыПланов.СценарийНаименование);
			СтрокаТЗРезультата.ПредставлениеПлана = НомерДатаВБУ;
			СтрокаТЗРезультата.ГУИДПланаУПП = СтрокаТаблицыПланов.ГУИДПланаУПП;
			ЕстьОшибки = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицыПланов.ЦФО) Тогда
			СтрокаТЗРезультата = ТаблицаОшибок.Добавить();
			СтрокаТЗРезультата.Комментарий = "Не найден ЦФО!";
			СтрокаТЗРезультата.ПредставлениеПлана = НомерДатаВБУ;
			СтрокаТЗРезультата.ГУИДПланаУПП = СтрокаТаблицыПланов.ГУИДПланаУПП;
			ЕстьОшибки = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицыПланов.ПланСсылка) Тогда
			ПланОбъект = СтрокаТаблицыПланов.ПланСсылка.ПолучитьОбъект();
		Иначе
			ПланОбъект = Документы.ПланПоступленийСписаний.СоздатьДокумент();
			ПланОбъект.Дата = ТекущаяДата();
		КонецЕсли;
		
		ПланОбъект.Поступления.Очистить();
		ПланОбъект.Списания.Очистить();
		
		ПланОбъект.Организация = ОсновнаяОрганизация;
		ЗаполнитьЗначенияСвойств(ПланОбъект, СтрокаТаблицыПланов, "Дата, ДатаНачала, ДатаОкончания, ВариантПланаПродаж, ЦФО, Подразделение");
		
		СтрокиПлана = СтрокиПланов.НайтиСтроки(Новый Структура("ГУИДПланаУПП", СтрокаТаблицыПланов.ГУИДПланаУПП));		
		Для Каждого СтрокаТЧ Из СтрокиПлана Цикл
			
			Если СтрокаТЧ.ВидДвижения = "Приход" Тогда
				НоваяСтрока = ПланОбъект.Поступления.Добавить();
			Иначе
				НоваяСтрока = ПланОбъект.Списания.Добавить();
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрокаТЧ.СтатьяДвиженияДенежныхСредств) Тогда
				СтрокаТЗРезультата = ТаблицаОшибок.Добавить();
				СтрокаТЗРезультата.Комментарий = СтрШаблон("Не найдена Статья ДДС с кодом %1!", СтрокаТЧ.СтатьяДвиженияДенежныхСредствКод);
				СтрокаТЗРезультата.ПредставлениеПлана = НомерДатаВБУ;
				СтрокаТЗРезультата.ГУИДПланаУПП = СтрокаТаблицыПланов.ГУИДПланаУПП;
				ЕстьОшибки = Истина;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрокаТЧ.Валюта) Тогда
				СтрокаТЗРезультата = ТаблицаОшибок.Добавить();
				СтрокаТЗРезультата.Комментарий = СтрШаблон("Не найдена Валюта с кодом %1!", СтрокаТЧ.ВалютаКод);
				СтрокаТЗРезультата.ПредставлениеПлана = НомерДатаВБУ;
				СтрокаТЗРезультата.ГУИДПланаУПП = СтрокаТаблицыПланов.ГУИДПланаУПП;
				ЕстьОшибки = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТЧ.УИДКонтрагента) И Не ЗначениеЗаполнено(СтрокаТЧ.Контрагент) Тогда
				СтрокаТЗРезультата = ТаблицаОшибок.Добавить();
				СтрокаТЗРезультата.Комментарий = СтрШаблон("Не найден Контрагент %1 (%2)!", СтрокаТЧ.КонтрагентПредставление, СтрокаТЧ.УИДКонтрагента);
				СтрокаТЗРезультата.ПредставлениеПлана = НомерДатаВБУ;
				СтрокаТЗРезультата.ГУИДПланаУПП = СтрокаТаблицыПланов.ГУИДПланаУПП;
				ЕстьОшибки = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТЧ.УИДДоговораКонтрагента) И Не ЗначениеЗаполнено(СтрокаТЧ.ДоговорКонтрагента) Тогда
				СтрокаТЗРезультата = ТаблицаОшибок.Добавить();
				СтрокаТЗРезультата.Комментарий = СтрШаблон("Не найден Договор %1 (%2)!", СтрокаТЧ.ДоговорПредставление, СтрокаТЧ.УИДДоговораКонтрагента);
				СтрокаТЗРезультата.ПредставлениеПлана = НомерДатаВБУ;
				СтрокаТЗРезультата.ГУИДПланаУПП = СтрокаТаблицыПланов.ГУИДПланаУПП;
				ЕстьОшибки = Истина;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ, "СтатьяДвиженияДенежныхСредств, Контрагент, ДоговорКонтрагента, ДатаДвижения, Сумма, Валюта, СуммаРуб");
			
		КонецЦикла;
		
		Если ЕстьОшибки Тогда
			Продолжить;
		КонецЕсли;
		
		ИтогоПоступления = ПланОбъект.Поступления.Итог("Сумма");
		ИтогоСписания = ПланОбъект.Списания.Итог("Сумма");
		СуммаВБУ = ИтогоПоступления - ИтогоСписания;
		
		НачатьТранзакцию();
		
		СтруктураПоиска = Новый Структура("ДействиеПриОбмене, УзелОбмена", Перечисления.ДействияПриОбмене.ЗагрузкаДанных, Перечисления.УзлыОбмена.УПП);
		
		Если Не ПланОбъект.ЭтоНовый() Тогда
			
			СтруктураПоиска.Вставить("Объект", ПланОбъект.Ссылка);
					
			ЗаписьВПротоколеОбменов = РегистрыСведений.ПротоколОбменов.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(ЗаписьВПротоколеОбменов, СтруктураПоиска);
			ЗаписьВПротоколеОбменов.Прочитать();
			Если ЗаписьВПротоколеОбменов.Выбран() Тогда
				ЗаписьВПротоколеОбменов.Удалить();
			КонецЕсли;
			
		КонецЕсли;
		
		ПланОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		Если Не СтруктураПоиска.Свойство("Объект") Тогда
			СтруктураПоиска.Вставить("Объект", ПланОбъект.Ссылка);
		КонецЕсли;
		
		СтруктураДанных = Новый Структура("УИДИсточника, Ответственный, ПроведенВБУ, СуммаВБУ, ДатаДокументаВнешнейИС, ДатаОбмена, НомерДатаВБУ", СтрокаТаблицыПланов.ГУИДПланаУПП,  СтрокаТаблицыПланов.Ответственный, СтрокаТаблицыПланов.Проведен, СуммаВБУ, СтрокаТаблицыПланов.Дата, ТекДата, НомерДатаВБУ);
		РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных);
		
		ЗафиксироватьТранзакцию();
		
		КоличествоЗагруженныхПланов = КоличествоЗагруженныхПланов + 1;
		
	КонецЦикла;
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("КоличествоЗагруженныхПланов", КоличествоЗагруженныхПланов);
	СтруктураРезультат.Вставить("ТаблицаОшибок", ТаблицаОшибок);
	
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(СтруктураРезультат);
	
КонецФункции

//записывает дерево значений в XML
Функция ЗаписатьДеревоВXML(ДЗ) Экспорт
	
	Запись = Новый ЗаписьXML();
	Запись.УстановитьСтроку();
	Запись.ЗаписатьОбъявлениеXML();
	Запись.ЗаписатьНачалоЭлемента("Корневой");
	Запись.ЗаписатьНачалоЭлемента("Структура");
	Для каждого Колонка ИЗ ДЗ.Колонки Цикл
		Запись.ЗаписатьАтрибут(Колонка.Имя,Колонка.Имя);
	КонецЦикла;
	Запись.ЗаписатьКонецЭлемента();
	Для каждого СтрокиДЗ из ДЗ.Строки Цикл
		УровеньГруппировки = 1;
		ЗаписатьСтрокиДереваВXML(СтрокиДЗ,Запись,ДЗ,УровеньГруппировки);
	КонецЦикла;	
	Запись.ЗаписатьКонецЭлемента();
	СтрокаXML = Запись.Закрыть();
	Возврат СтрокаXML;
	
КонецФункции	
//рекурсия для ЗаписатьДеревоВXML()
Процедура ЗаписатьСтрокиДереваВXML(СтрокиДерева,Запись,ДЗ,УровеньГруппировки)
	
	Запись.ЗаписатьНачалоЭлемента("Элемент"+УровеньГруппировки);
	Для каждого Колонка из ДЗ.Колонки Цикл
		Если НЕ СтрокиДерева[Колонка.Имя] = NULL Тогда
			Запись.ЗаписатьАтрибут(Колонка.Имя,Строка(СтрокиДерева[Колонка.Имя]));
		КонецЕсли;
	КонецЦикла;
	Для каждого СтрокаДерева Из СтрокиДерева.Строки Цикл
		ЗаписатьСтрокиДереваВXML(СтрокаДерева,Запись,ДЗ,УровеньГруппировки+1);
	КонецЦикла;
	Запись.ЗаписатьКонецЭлемента();
	
КонецПроцедуры	

Функция ПолучитьСписокКатегорийДоговоров(xmlParam) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КатегорииДоговоров.Код КАК Код,
	|	КатегорииДоговоров.Наименование КАК Наименование
	|ИЗ
	|	Справочник.КатегорииДоговоров КАК КатегорииДоговоров
	|ГДЕ
	|	НЕ КатегорииДоговоров.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	ТаблицаКатегорий = Запрос.Выполнить().Выгрузить();
	
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(ТаблицаКатегорий);
	
КонецФункции

//Евросиб Дубская 24.04.2023 ( Для отчета НЗП
Функция ПередатьСписокАкцептовДляОтчетаНЗП(XMLParams) Экспорт 
	
	ГУИДДокументов =  ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	СсылкиНаДокументы = Новый ТаблицаЗначений;
	СсылкиНаДокументы.Колонки.Добавить("ГУИД",Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	СсылкиНаДокументы.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.Акцепт"));
	СсылкиНаДокументы.Колонки.Добавить("ГУИД_СторнируемогоАкцепта", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	СсылкиНаДокументы.Колонки.Добавить("СторнируемыйАкцепт", Новый ОписаниеТипов("ДокументСсылка.Акцепт"));
	
	Для Каждого СтрокаГУИД Из ГУИДДокументов Цикл
		Строка = СсылкиНаДокументы.Добавить();
		Строка.ГУИД = СтрокаГУИД;
		Строка.Ссылка = Документы.Акцепт.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка.ГУИД));
 		Строка.ГУИД_СторнируемогоАкцепта = ?(ЗначениеЗаполнено(Строка.Ссылка.СторнируемыйАкцепт), Строка.Ссылка.СторнируемыйАкцепт.УникальныйИдентификатор(), "");
 		Строка.СторнируемыйАкцепт = ?(ЗначениеЗаполнено(Строка.Ссылка.СторнируемыйАкцепт), Строка.Ссылка.СторнируемыйАкцепт, Документы.Акцепт.ПустаяСсылка());
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СсылкиНаДокументы.ГУИД КАК ГУИД,
	|	СсылкиНаДокументы.Ссылка КАК Ссылка,
	|	СсылкиНаДокументы.СторнируемыйАкцепт КАК СторнируемыйАкцепт,
	|	СсылкиНаДокументы.ГУИД_СторнируемогоАкцепта КАК ГУИД_СторнируемогоАкцепта
	|ПОМЕСТИТЬ СсылкиНаДокументы
	|ИЗ
	|	&СсылкиНаДокументы КАК СсылкиНаДокументы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Акцепт.Ссылка КАК Ссылка,
	|	Акцепт.Поступление КАК Поступление,
	|	МИНИМУМ(Акцепт_СледующийЗаСторно.Дата) КАК Дата
	|ПОМЕСТИТЬ Акцепты_Следующие_Дата
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Акцепт КАК Акцепт
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Акцепт КАК Акцепт_СледующийЗаСторно
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|				ПО Акцепт_СледующийЗаСторно.Ссылка = ПротоколОбменов.Объект
	|					И (ИСТИНА = ПротоколОбменов.ПроведенВБУ)
	|			ПО Акцепт.Дата < Акцепт_СледующийЗаСторно.Дата
	|				И (Акцепт_СледующийЗаСторно.Проведен)
	|				И (Акцепт_СледующийЗаСторно.СторнируемыйАкцепт = ЗНАЧЕНИЕ(Документ.Акцепт.ПустаяСсылка))
	|				И (Акцепт_СледующийЗаСторно.Поступление = Акцепт.Поступление)
	|		ПО СсылкиНаДокументы.Ссылка = Акцепт.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Акцепт.Ссылка,
	|	Акцепт.Поступление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Акцепты_Следующие_Дата.Ссылка КАК Ссылка,
	|	Акцепт_СледующийЗаСторно.Ссылка КАК СсылкаСледующийАкцепт
	|ПОМЕСТИТЬ Акцепты_Следующие
	|ИЗ
	|	Акцепты_Следующие_Дата КАК Акцепты_Следующие_Дата
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Акцепт КАК Акцепт_СледующийЗаСторно
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|			ПО Акцепт_СледующийЗаСторно.Ссылка = ПротоколОбменов.Объект
	|				И (ИСТИНА = ПротоколОбменов.ПроведенВБУ)
	|		ПО Акцепты_Следующие_Дата.Дата = Акцепт_СледующийЗаСторно.Дата
	|			И (Акцепт_СледующийЗаСторно.Проведен)
	|			И (Акцепт_СледующийЗаСторно.СторнируемыйАкцепт = ЗНАЧЕНИЕ(Документ.Акцепт.ПустаяСсылка))
	|			И (Акцепт_СледующийЗаСторно.Поступление = Акцепты_Следующие_Дата.Поступление)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АкцептУслуги.ГУИД КАК ГУИД,
	|	СсылкиНаДокументы.Ссылка КАК Ссылка,
	|	СУММА(АкцептУслуги.Сумма) КАК Сумма,
	|	СУММА(АкцептУслуги.СуммаНДС) КАК СуммаНДС,
	|	АкцептУслуги.ВидЗатрат КАК ВидЗатрат,
	|	АкцептУслуги.НоменклатураСделки.КатегорияРасходов.Код КАК НоменклатураСделкиКатегорияРасходовКод
	|ПОМЕСТИТЬ ДанныеСтрокИзПредыдущегоАкцепта
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Акцепт.Услуги КАК АкцептУслуги
	|		ПО СсылкиНаДокументы.СторнируемыйАкцепт = АкцептУслуги.Ссылка
	|ГДЕ
	|	АкцептУслуги.ВидЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыЗатрат.НезавершенноеПроизводство)
	|
	|СГРУППИРОВАТЬ ПО
	|	АкцептУслуги.ГУИД,
	|	АкцептУслуги.ВидЗатрат,
	|	СсылкиНаДокументы.Ссылка,
	|	АкцептУслуги.НоменклатураСделки.КатегорияРасходов.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Акцепты_Следующие.Ссылка КАК Ссылка,
	|	СУММА(АкцептУслуги.Сумма) КАК Сумма,
	|	СУММА(АкцептУслуги.СуммаНДС) КАК СуммаНДС,
	|	АкцептУслуги.ВидЗатрат КАК ВидЗатрат,
	|	АкцептУслуги.ГУИД КАК ГУИД,
	|	АкцептУслуги.УчДокумент КАК УчДокумент,
	|	АкцептУслуги.НоменклатураСделки.КатегорияРасходов.Код КАК СтатьяЗатратКод
	|ПОМЕСТИТЬ ДанныеСтрокИзСледующегоАкцепта
	|ИЗ
	|	Акцепты_Следующие КАК Акцепты_Следующие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Акцепт.Услуги КАК АкцептУслуги
	|		ПО Акцепты_Следующие.СсылкаСледующийАкцепт = АкцептУслуги.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Акцепты_Следующие.Ссылка,
	|	АкцептУслуги.ВидЗатрат,
	|	АкцептУслуги.ГУИД,
	|	АкцептУслуги.УчДокумент,
	|	АкцептУслуги.НоменклатураСделки.КатегорияРасходов.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеСтрокИзПредыдущегоАкцепта.ГУИД КАК ГУИД,
	|	ДанныеСтрокИзПредыдущегоАкцепта.Ссылка КАК Ссылка,
	|	ДанныеСтрокИзПредыдущегоАкцепта.Сумма - ДанныеСтрокИзПредыдущегоАкцепта.СуммаНДС КАК СуммаНач,
	|	ДанныеСтрокИзПредыдущегоАкцепта.СуммаНДС КАК СуммаНДСНач,
	|	ДанныеСтрокИзПредыдущегоАкцепта.ВидЗатрат КАК ВидЗатратНач,
	|	ДанныеСтрокИзСледующегоАкцепта.Сумма - ДанныеСтрокИзСледующегоАкцепта.СуммаНДС КАК СуммаКон,
	|	ДанныеСтрокИзСледующегоАкцепта.СуммаНДС КАК СуммаНДСКон,
	|	ДанныеСтрокИзСледующегоАкцепта.ВидЗатрат КАК ВидЗатратКон,
	|	ДанныеСтрокИзСледующегоАкцепта.УчДокумент КАК УчДокумент,
	|	ДанныеСтрокИзПредыдущегоАкцепта.НоменклатураСделкиКатегорияРасходовКод КАК СтатьяЗатратКод
	|ПОМЕСТИТЬ ДанныеПоСтрокамСравнение
	|ИЗ
	|	ДанныеСтрокИзПредыдущегоАкцепта КАК ДанныеСтрокИзПредыдущегоАкцепта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеСтрокИзСледующегоАкцепта КАК ДанныеСтрокИзСледующегоАкцепта
	|		ПО ДанныеСтрокИзПредыдущегоАкцепта.Ссылка = ДанныеСтрокИзСледующегоАкцепта.Ссылка
	|			И ДанныеСтрокИзПредыдущегоАкцепта.ГУИД = ДанныеСтрокИзСледующегоАкцепта.ГУИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоСтрокамСравнение.ГУИД КАК ГУИДСтроки,
	|	ВЫБОР
	|		КОГДА ДанныеПоСтрокамСравнение.СуммаНач ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ДанныеПоСтрокамСравнение.СуммаНач КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаНач,
	|	ВЫБОР
	|		КОГДА ДанныеПоСтрокамСравнение.СуммаКон ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ДанныеПоСтрокамСравнение.СуммаКон КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаКон,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДанныеПоСтрокамСравнение.ВидЗатратКон) КАК ВидЗатратКон,
	|	ПротоколОбменов_РТУ.УИДИсточника КАК ГУИД_РТУ,
	|	СсылкиНаДокументы.ГУИД КАК ГУИД_АкцептСторно,
	|	СсылкиНаДокументы.ГУИД_СторнируемогоАкцепта КАК ГУИД_СторнируемогоАкцепта,
	|	ДанныеПоСтрокамСравнение.УчДокумент.Номер КАК НомерРТУ,
	|	ДанныеПоСтрокамСравнение.УчДокумент.Дата КАК ДатаРТУ,
	|	ДанныеПоСтрокамСравнение.УчДокумент.ПериодВО КАК ПериодВО_РТУ,
	|	Акцепты_Следующие.Ссылка.ПериодБУ КАК ПериодБУ_АкцептСторно,
	|	ПротоколОбменов_СледующийАкцепт.УИДИсточника КАК ГУИД_СледующийАкцепт,
	|	Акцепты_Следующие.Ссылка.СторнируемыйАкцепт.ПериодБУ КАК ПериодБУ_СторнируемыйАкцепт,
	|	ДанныеПоСтрокамСравнение.СтатьяЗатратКод КАК СтатьяЗатратКод,
	|	Акцепты_Следующие.СсылкаСледующийАкцепт.ПериодБУ КАК ПериодБУ_СледующийАкцепт
	|ИЗ
	|	СсылкиНаДокументы КАК СсылкиНаДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоСтрокамСравнение КАК ДанныеПоСтрокамСравнение
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов_РТУ
	|			ПО ДанныеПоСтрокамСравнение.УчДокумент = ПротоколОбменов_РТУ.Объект
	|				И (ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП) = ПротоколОбменов_РТУ.УзелОбмена)
	|				И (ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных) = ПротоколОбменов_РТУ.ДействиеПриОбмене)
	|		ПО СсылкиНаДокументы.Ссылка = ДанныеПоСтрокамСравнение.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Акцепты_Следующие КАК Акцепты_Следующие
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов_СледующийАкцепт
	|			ПО Акцепты_Следующие.СсылкаСледующийАкцепт = ПротоколОбменов_СледующийАкцепт.Объект
	|				И (ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных) = ПротоколОбменов_СледующийАкцепт.ДействиеПриОбмене)
	|				И (ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП) = ПротоколОбменов_СледующийАкцепт.УзелОбмена)
	|		ПО СсылкиНаДокументы.Ссылка = Акцепты_Следующие.Ссылка
	|ГДЕ
	|	ДанныеПоСтрокамСравнение.ГУИД <> """"";
	
	Запрос.УстановитьПараметр("СсылкиНаДокументы", СсылкиНаДокументы);
	
	ДанныеПоАкцептам = Запрос.Выполнить().Выгрузить();
	Структура = Новый Структура;
	Структура.Вставить("ДанныеПоАкцептам", ДанныеПоАкцептам);
	
	ПередаваемаяСтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(Структура); 
	
	Возврат ПередаваемаяСтрокаXML;		
	
КонецФункции //Евросиб Дубская 24.04.2023 )

//Евросиб Каблов 14.02.2024 Ticket#0317695
Функция ПолучитьНеурегулированныеРасходы(XMLParams) Экспорт 
	
	Параметры = ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	
	ПериодБУ = Неопределено;
	Если Не Параметры.Свойство("ПериодБУ", ПериодБУ) Тогда
		ПериодБУ = КонецМесяца(ТекущаяДата());
	КонецЕсли;
	
	КодКонтрагента = Неопределено;
	Если Параметры.Свойство("КодКонтрагента", КодКонтрагента) И ЗначениеЗаполнено(КодКонтрагента) Тогда
		Контрагент = Справочники.Контрагенты.НайтиПоКоду(КодКонтрагента);
	Иначе
		Контрагент = Неопределено;
	КонецЕсли;
	
	КодОрганизации = Неопределено;
	Если Параметры.Свойство("КодОрганизации", КодОрганизации) И ЗначениеЗаполнено(КодОрганизации) Тогда
		Организация = Справочники.Организации.НайтиПоКоду(КодОрганизации);
	Иначе
		Организация = Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Акцепт.Поступление КАК Поступление,
	|	Акцепт.Ссылка КАК Акцепт
	|ПОМЕСТИТЬ АктуальныеАкцепты
	|ИЗ
	|	Документ.Акцепт КАК Акцепт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Акцепт КАК Акцепт1
	|		ПО Акцепт.Ссылка = Акцепт1.СторнируемыйАкцепт
	|			И (Акцепт1.ПериодБУ <= &ПериодБУ)
	|			И (Акцепт1.Проведен)
	|ГДЕ
	|	Акцепт.Проведен
	|	И Акцепт.ПериодБУ <= &ПериодБУ
	|	И Акцепт.СторнируемыйАкцепт = ЗНАЧЕНИЕ(Документ.Акцепт.ПустаяСсылка)
	|	И Акцепт1.Ссылка ЕСТЬ NULL
	|	И Акцепт.Поступление.Проведен
	|	И Акцепт.Поступление.Контрагент = &Контрагент
	|	И Акцепт.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктуальныеАкцепты.Поступление КАК Поступление,
	|	АктуальныеАкцепты.Акцепт КАК Акцепт,
	|	СУММА(АкцептУслуги.ПоступлениеСумма - АкцептУслуги.Сумма) КАК НеакцептованнаяСумма,
	|	СУММА(ВЫБОР
	|			КОГДА АкцептУслуги.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходов.Возмещаемые)
	|					И &ВыводитьАкцептыБезВСФНаВР
	|					И АкцептУслуги.УчДокумент.Ссылка ЕСТЬ NULL
	|				ТОГДА АкцептУслуги.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаНеПеревыставленныхВР
	|ПОМЕСТИТЬ НеурегулированныеРасходы
	|ИЗ
	|	АктуальныеАкцепты КАК АктуальныеАкцепты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Акцепт.Услуги КАК АкцептУслуги
	|		ПО АктуальныеАкцепты.Акцепт = АкцептУслуги.Ссылка
	|ГДЕ
	|	АкцептУслуги.Неурег <> ЗНАЧЕНИЕ(Справочник.ПричиныНеурегулированныхРасходов.ОтработкаВРитм)
	|	И (АкцептУслуги.ПоступлениеСумма <> АкцептУслуги.Сумма
	|			ИЛИ АкцептУслуги.ВидРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыРасходов.Возмещаемые)
	|				И &ВыводитьАкцептыБезВСФНаВР
	|				И АкцептУслуги.УчДокумент.Ссылка ЕСТЬ NULL
	|				И АкцептУслуги.Сумма <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	АктуальныеАкцепты.Акцепт,
	|	АктуальныеАкцепты.Поступление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НеурегулированныеРасходы.Поступление КАК Поступление,
	|	NULL КАК КорПТУ,
	|	НеурегулированныеРасходы.Акцепт КАК Акцепт,
	|	НеурегулированныеРасходы.НеакцептованнаяСумма КАК НеакцептованнаяСумма,
	|	НеурегулированныеРасходы.СуммаНеПеревыставленныхВР КАК СуммаНеПеревыставленныхВР,
	|	ПоступлениеТоваровУслуг.Организация КАК Организация,
	|	ПоступлениеТоваровУслуг.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслуг.КратностьВзаиморасчетов <> 0
	|			ТОГДА ПоступлениеТоваровУслуг.КурсВзаиморасчетов / ПоступлениеТоваровУслуг.КратностьВзаиморасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Курс
	|ПОМЕСТИТЬ ПоступленияИКорректировки
	|ИЗ
	|	НеурегулированныеРасходы КАК НеурегулированныеРасходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ПО НеурегулированныеРасходы.Поступление = ПоступлениеТоваровУслуг.Ссылка
	|ГДЕ
	|	НеурегулированныеРасходы.Поступление ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|	И (НеурегулированныеРасходы.НеакцептованнаяСумма <> 0
	|			ИЛИ НеурегулированныеРасходы.СуммаНеПеревыставленныхВР <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НеурегулированныеРасходы.Поступление.ДокументПоступления,
	|	НеурегулированныеРасходы.Поступление,
	|	НеурегулированныеРасходы.Акцепт,
	|	НеурегулированныеРасходы.НеакцептованнаяСумма,
	|	НеурегулированныеРасходы.СуммаНеПеревыставленныхВР,
	|	КорректировкаПоступления.Организация,
	|	КорректировкаПоступления.Контрагент,
	|	ВЫБОР
	|		КОГДА КорректировкаПоступления.КратностьВзаиморасчетов <> 0
	|			ТОГДА КорректировкаПоступления.КурсВзаиморасчетов / КорректировкаПоступления.КратностьВзаиморасчетов
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	НеурегулированныеРасходы КАК НеурегулированныеРасходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления КАК КорректировкаПоступления
	|		ПО НеурегулированныеРасходы.Поступление = КорректировкаПоступления.Ссылка
	|ГДЕ
	|	НеурегулированныеРасходы.Поступление ССЫЛКА Документ.КорректировкаПоступления
	|	И (НеурегулированныеРасходы.НеакцептованнаяСумма <> 0
	|			ИЛИ НеурегулированныеРасходы.СуммаНеПеревыставленныхВР <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступленияИКорректировки.Организация.Код КАК КодОрганизации,
	|	ПоступленияИКорректировки.Контрагент.Код КАК КодКонтрагента,
	|	ВыгруженныеПоступления.УИДИсточника КАК УИДПТУ,
	|	ВыгруженныеКорПТУ.УИДИсточника КАК УИДКорПТУ,
	|	ВыгруженныеАкцепты.УИДИсточника КАК УИДАкцепта,
	|	ВЫБОР
	|		КОГДА НЕ КорректировкаПоступления.Ссылка ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(ВыгруженныеКорПТУ.ПроведенВБУ, ЛОЖЬ)
	|		ИНАЧЕ ЕСТЬNULL(ВыгруженныеПоступления.ПроведенВБУ, ЛОЖЬ)
	|	КОНЕЦ КАК ПТУПроведенВБУ,
	|	ВыгруженныеАкцепты.ПроведенВБУ КАК АкцептПроведенВБУ,
	|	ПоступленияИКорректировки.Поступление.Номер КАК НомерПТУ,
	|	ПоступленияИКорректировки.Поступление.Дата КАК ДатаПТУ,
	|	КорректировкаПоступления.Номер КАК НомерКорПТУ,
	|	КорректировкаПоступления.Дата КАК ДатаКорПТУ,
	|	ПоступленияИКорректировки.Поступление.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	ПоступленияИКорректировки.Поступление.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	КорректировкаПоступления.НомерВходящегоДокумента КАК НомерВходящегоКорПТУ,
	|	КорректировкаПоступления.ДатаВходящегоДокумента КАК ДатаВходящегоКорПТУ,
	|	СчетФактураПолученный.НомерВходящегоДокумента КАК НомерВСФ,
	|	СчетФактураПолученный.ДатаВходящегоДокумента КАК ДатаВСФ,
	|	КорректировочныйСФ.НомерВходящегоДокумента КАК НомерКорВСФ,
	|	КорректировочныйСФ.ДатаВходящегоДокумента КАК ДатаКорВСФ,
	|	ВЫРАЗИТЬ(ПоступленияИКорректировки.НеакцептованнаяСумма КАК ЧИСЛО(15, 2)) КАК НеакцептованнаяСумма,
	|	ВЫРАЗИТЬ(ПоступленияИКорректировки.СуммаНеПеревыставленныхВР КАК ЧИСЛО(15, 2)) КАК СуммаНеПеревыставленныхВР,
	|	ВЫРАЗИТЬ(ПоступленияИКорректировки.НеакцептованнаяСумма * ПоступленияИКорректировки.Курс КАК ЧИСЛО(15, 2)) КАК НеакцептованнаяСуммаРуб,
	|	ВЫРАЗИТЬ(ПоступленияИКорректировки.СуммаНеПеревыставленныхВР * ПоступленияИКорректировки.Курс КАК ЧИСЛО(15, 2)) КАК СуммаНеПеревыставленныхВРРуб
	|ИЗ
	|	ПоступленияИКорректировки КАК ПоступленияИКорректировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ВыгруженныеПоступления
	|		ПО ПоступленияИКорректировки.Поступление = ВыгруженныеПоступления.Объект
	|			И (ВыгруженныеПоступления.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|		ПО ПоступленияИКорректировки.Поступление = СчетФактураПолученный.ДокументОснование
	|			И (СчетФактураПолученный.Проведен)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления КАК КорректировкаПоступления
	|		ПО ПоступленияИКорректировки.КорПТУ = КорректировкаПоступления.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК КорректировочныйСФ
	|		ПО (КорректировкаПоступления.Ссылка = КорректировочныйСФ.ДокументОснование)
	|			И (КорректировочныйСФ.Проведен)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ВыгруженныеКорПТУ
	|		ПО ПоступленияИКорректировки.КорПТУ = ВыгруженныеКорПТУ.Объект
	|			И (ВыгруженныеКорПТУ.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ВыгруженныеАкцепты
	|		ПО ПоступленияИКорректировки.Акцепт = ВыгруженныеАкцепты.Объект
	|			И (ВыгруженныеАкцепты.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))";
	
	Запрос.УстановитьПараметр("ПериодБУ", ПериодБУ);
	Запрос.УстановитьПараметр("ВыводитьАкцептыБезВСФНаВР", Истина);
	
	Если Контрагент <> Неопределено Тогда
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Акцепт.Поступление.Контрагент = &Контрагент", "");
	КонецЕсли;
	
	Если Организация <> Неопределено Тогда
		Запрос.УстановитьПараметр("Организация", Организация);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Акцепт.Организация = &Организация", "");
	КонецЕсли;
	
	НеакцептованныеРасходы = Запрос.Выполнить().Выгрузить();
	
	ПередаваемаяСтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(НеакцептованныеРасходы);
	
	Возврат ПередаваемаяСтрокаXML;
	
КонецФункции

// Евросиб(ДИТ) US 73033 ТА 88304 Сержантова А.С. 17.07.2024
Функция ПередатьСтатусЗаявкиНаОплатуВУПП(ЗаявкаНаОплатуСсылка, НовыйСтатус) Экспорт

	Прокси = ВебСервисы_сервер.ПолучитьПрокси("ВебСервисЗаказовУПП");

	ДанныеДляПередачи = Новый Структура("ГУИД, Состояние, ОрганизацияКод");
	ДанныеДляПередачи.ГУИД = Строка(ЗаявкаНаОплатуСсылка.УникальныйИдентификатор());
	ДанныеДляПередачи.Состояние = НовыйСтатус; 
	ОрганизацияДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаявкаНаОплатуСсылка, "Организация"); 
	ДанныеДляПередачи.ОрганизацияКод = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОрганизацияДокумента, "Код"); 
	
	ПередаваемаяСтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(ДанныеДляПередачи); 

	ОтветУПП = Прокси.PutDocumentStatus(ПередаваемаяСтрокаXML);
	СтрокаОтвета = ОбщегоНазначения.ЗначениеИзСтрокиXML(ОтветУПП);
	Если ЗначениеЗаполнено(СтрокаОтвета.Комментарий) Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрокаОтвета.Комментарий);
		Если ЗначениеЗаполнено(СтрокаОтвета.Состояние) Тогда
			ОбщегоНазначения.СообщитьПользователю("Состояние документа в УПП не изменено - " + СтрокаОтвета.Состояние);
			СтруктураПоиска = Новый Структура("ДействиеПриОбмене, УзелОбмена, Объект", Перечисления.ДействияПриОбмене.ВыгрузкаДанных, 
												Перечисления.УзлыОбмена.УПП, ЗаявкаНаОплатуСсылка);
			СтруктураДанных = Новый Структура("УИДИсточника,Статус", ДанныеДляПередачи.ГУИД, СтрокаОтвета.Состояние);
			РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных,,Истина); 
		КонецЕсли;
		Возврат Ложь;
	Иначе	 
		СтруктураПоиска = Новый Структура("ДействиеПриОбмене, УзелОбмена, Объект", Перечисления.ДействияПриОбмене.ВыгрузкаДанных, 
		Перечисления.УзлыОбмена.УПП, ЗаявкаНаОплатуСсылка);
		СтруктураДанных = Новый Структура("УИДИсточника,Статус", ДанныеДляПередачи.ГУИД, НовыйСтатус);
		РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных,,Истина); 
		
		ОбщегоНазначения.СообщитьПользователю("Состояние заявки изменено в УПП");    
		Возврат Истина;
	КонецЕсли; 
	
КонецФункции 

//Евросиб Каблов 25.09.2025 ( #104972
Функция ПолучитьНЗП(XMLParams) Экспорт
	
	Параметры = ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	
	ДатаОтчета = Неопределено;
	Если Не Параметры.Свойство("ДатаОтчета", ДатаОтчета) Тогда
		ДатаОтчета = КонецМесяца(ТекущаяДата());
	КонецЕсли;
	
	НаименованиеВалюты = Неопределено;
	Если Параметры.Свойство("НаименованиеВалюты", НаименованиеВалюты) И ЗначениеЗаполнено(НаименованиеВалюты) Тогда
		Валюта = Справочники.Валюты.НайтиПоНаименованию(НаименованиеВалюты);
		Если Не ЗначениеЗаполнено(Валюта) Тогда
			Валюта = NULL;
		КонецЕсли;
	Иначе
		Валюта = Неопределено;
	КонецЕсли;
	
	КодыОрганизаций = Неопределено;
	Организации = Новый Массив;
	Если Параметры.Свойство("КодыОрганизаций", КодыОрганизаций) И ЗначениеЗаполнено(КодыОрганизаций) Тогда
		Для Каждого КодОрганизации Из КодыОрганизаций Цикл
			Организации.Добавить(Справочники.Организации.НайтиПоКоду(КодОрганизации));
		КонецЦикла;
	КонецЕсли;
	
	КодКонтрагента = Неопределено;
	Если Параметры.Свойство("КодКонтрагента", КодКонтрагента) И ЗначениеЗаполнено(КодКонтрагента) Тогда
		Контрагент = Справочники.Контрагенты.НайтиПоКоду(КодКонтрагента);
	Иначе
		Контрагент = Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НезавершенноеПроизводствоРасширенныйОстатки.Поступление.Организация КАК Организация,
	|	НезавершенноеПроизводствоРасширенныйОстатки.Поступление КАК Поступление,
	|	НезавершенноеПроизводствоРасширенныйОстатки.Поступление.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	НезавершенноеПроизводствоРасширенныйОстатки.Поступление.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	НезавершенноеПроизводствоРасширенныйОстатки.Валюта КАК Валюта,
	|	НезавершенноеПроизводствоРасширенныйОстатки.Поступление.Контрагент КАК ПоступлениеКонтрагент,
	|	НезавершенноеПроизводствоРасширенныйОстатки.Акцепт КАК Акцепт,
	|	НезавершенноеПроизводствоРасширенныйОстатки.СуммаОстаток КАК СуммаОстаток,
	|	НезавершенноеПроизводствоРасширенныйОстатки.СуммаРубОстаток КАК СуммаРубОстаток,
	|	НезавершенноеПроизводствоРасширенныйОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток,
	|	НезавершенноеПроизводствоРасширенныйОстатки.СуммаНДСРубОстаток КАК СуммаНДСРубОстаток
	|ПОМЕСТИТЬ НЗП
	|ИЗ
	|	РегистрНакопления.НезавершенноеПроизводствоРасширенный.Остатки(
	|			&ДатаОтчета,
	|			Выгружен
	|				И Поступление.Организация В (&Организации)
	|				И Валюта = &Валюта
	|				И Поступление.Контрагент = &Контрагент) КАК НезавершенноеПроизводствоРасширенныйОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Организации.Код КАК КодОрганизации,
	|	Контрагенты.Код КАК КодКонтрагента,
	|	ВыгруженныеПоступления.УИДИсточника КАК УИДПТУ,
	|	НЗП.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	НЗП.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	СчетФактураПолученный.НомерВходящегоДокумента КАК НомерВСФ,
	|	СчетФактураПолученный.ДатаВходящегоДокумента КАК ДатаВСФ,
	|	ДокументАкцепт.Номер КАК НомерАкцепта,
	|	ВыгруженныеАкцепты.УИДИсточника КАК УИДАкцепта,
	|	Валюты.Наименование КАК НаименованиеВалюты,
	|	НЗП.СуммаОстаток - НЗП.СуммаНДСОстаток КАК Сумма,
	|	НЗП.СуммаРубОстаток - НЗП.СуммаНДСРубОстаток КАК СуммаРуб,
	|	НЗП.СуммаНДСОстаток КАК СуммаНДС,
	|	НЗП.СуммаНДСРубОстаток КАК СуммаНДСРуб
	|ИЗ
	|	НЗП КАК НЗП
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО НЗП.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО НЗП.ПоступлениеКонтрагент = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|		ПО НЗП.Поступление = СчетФактураПолученный.ДокументОснование
	|			И (СчетФактураПолученный.Проведен)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ВыгруженныеПоступления
	|		ПО НЗП.Поступление = ВыгруженныеПоступления.Объект
	|			И (ВыгруженныеПоступления.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО НЗП.Валюта = Валюты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Акцепт КАК ДокументАкцепт
	|		ПО НЗП.Акцепт = ДокументАкцепт.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ВыгруженныеАкцепты
	|		ПО НЗП.Акцепт = ВыгруженныеАкцепты.Объект
	|			И (ВыгруженныеАкцепты.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))";
	
	Запрос.УстановитьПараметр("ДатаОтчета", ДатаОтчета);
	
	Если Валюта <> Неопределено Тогда
		Запрос.УстановитьПараметр("Валюта", Валюта);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Валюта = &Валюта", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организации) Тогда
		Запрос.УстановитьПараметр("Организации", Организации);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Поступление.Организация В (&Организации)", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Поступление.Контрагент = &Контрагент", "");
	КонецЕсли;
	
	НЗП = Запрос.Выполнить().Выгрузить();
	
	ПередаваемаяСтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(НЗП);
	
	Возврат ПередаваемаяСтрокаXML;
	
КонецФункции

#КонецОбласти 

#Область ОповещениеПользователей

Функция НайтиПолучателейВПравилахОповещения(ВидЗагрузки, ПолнаяСтрокаУсловий = "") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НастройкаПравилОповещений.ГруппаПользователей,
	|	НастройкаПравилОповещений.УсловияОтбора
	|ИЗ
	|	РегистрСведений.НастройкаПравилОповещений КАК НастройкаПравилОповещений
	|ГДЕ
	|	НастройкаПравилОповещений.Вкл
	|	И НастройкаПравилОповещений.ВидЗагрузки = &ВидЗагрузки";
	
	Запрос.УстановитьПараметр("ВидЗагрузки", ВидЗагрузки);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Новый Массив();
	КонецЕсли; 
	
	ТаблицаНастроек = Результат.Выгрузить();
	МассивКудалению = Новый Массив;
	Для каждого СтрокаНастройки Из ТаблицаНастроек Цикл
		УсловиеОтбора = СокрЛП(СтрокаНастройки.УсловияОтбора);
		МассивУсловий = _СтрРазделить(УсловиеОтбора, "#");
		//проверяем полную строку на вхождения услвоий отбора по частям
		Для каждого КонечноеУсловие Из МассивУсловий Цикл
			Если Найти(ПолнаяСтрокаУсловий, КонечноеУсловие) = 0 Тогда
				МассивКудалению.Добавить(СтрокаНастройки);
				Прервать;
			КонецЕсли;
		КонецЦикла; 
	КонецЦикла; 
	Если МассивКУдалению.Количество() > 0 Тогда //удаляем лишние настройки
		Для каждого СтрокаУдалить Из МассивКУдалению Цикл
			ТаблицаНастроек.Удалить(СтрокаУдалить);
		КонецЦикла; 
	КонецЕсли;
	Если ТаблицаНастроек.Количество() = 0 Тогда
		Возврат Новый Массив();
	КонецЕсли;
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПользователиКонтактнаяИнформация.АдресЭП КАК Адрес
	|ИЗ
	|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|		ПО ГруппыПользователейСостав.Пользователь = ПользователиКонтактнаяИнформация.Ссылка
	|ГДЕ
	|	ГруппыПользователейСостав.Ссылка В(&ГруппаПользователей)
	|	И ПользователиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)";
	
	Запрос.УстановитьПараметр("ГруппаПользователей", ТаблицаНастроек.ВыгрузитьКолонку("ГруппаПользователей"));
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Новый Массив();
	Иначе
		Возврат Результат.Выгрузить().ВыгрузитьКолонку("Адрес");
	КонецЕсли; 
КонецФункции

Процедура ОтправитьСообщение(Тип, Имя, Ошибка, ИмяФайла, Получатели) Экспорт
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	Профиль.АдресСервераSMTP = "esxexch";
	Профиль.ПортSMTP = "25";
	Профиль.АутентификацияSMTP = Ложь;
	Почта = Новый ИнтернетПочта;
	Попытка
		Почта.Подключиться(Профиль);
	Исключение
	КонецПопытки;
	Письмо = Новый ИнтернетПочтовоеСообщение;
	Для каждого Получатель Из Получатели Цикл
		Письмо.Получатели.Добавить(Получатель);
	КонецЦикла; 
	Письмо.Отправитель.Адрес = "tpdper@eurosib.biz";
	ТекстСообщения = Письмо.Тексты.Добавить();
	ТекстСообщения.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
	ТекстСообщения.Текст = ""+Тип+"
	|"+Имя+"
	|"+Ошибка+"
	|"""+ИмяФайла+"""";
	Письмо.Тема = Тип;
	Попытка
		Почта.Послать(Письмо);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Функция _СтрРазделить(Строка, Разделитель, ВключатьПустые = Ложь)
	МассивЗначений = Новый Массив();
	Символ = Найти(Строка, Разделитель);
	Пока Символ > 0 Цикл
		Если ВключатьПустые или (СтрДлина(Лев(Строка, Символ - 1)) > 0) Тогда
			МассивЗначений.Добавить(Лев(Строка, Символ - 1));
		КонецЕсли;
		Строка = Прав(Строка, СтрДлина(Строка) - Символ);
		Символ = Найти(Строка, Разделитель);
	КонецЦикла;
	Если (ВключатьПустые или СтрДлина(Строка) > 0) Тогда
		МассивЗначений.Добавить(Строка);
	КонецЕсли;
	Возврат МассивЗначений;
КонецФункции
 
Процедура ОтправитьСообщенияОбОшибках(СтатусТаблица, Тип, Имя, Ссылка = "", Ошибка = "", ИмяФайла = "", ВидЗагрузки) Экспорт
	
	СтрокаСтатусТаблица					=	СтатусТаблица.Добавить();
	СтрокаСтатусТаблица.Тип				=	Тип;
	СтрокаСтатусТаблица.Имя				=	Имя;
	СтрокаСтатусТаблица.Ссылка			=	Ссылка;
	СтрокаСтатусТаблица.Ошибка			=	Ошибка;
	СтрокаСтатусТаблица.ИмяФайла		= 	ИмяФайла;	
	СтатусТаблица.Очистить();
	Получатели = НайтиПолучателейВПравилахОповещения(ВидЗагрузки, "" + Тип + Имя + Ошибка + ИмяФайла);
	Если Получатели.Количество() > 0 Тогда
		Если СтрНайти(ИмяФайла, "ESContra") > 0 Или СтрНайти(ИмяФайла, "FACT_PAYMENT") > 0 Тогда
			Тип = "Загрузка из Бит.Финанс в Datacore: " + Тип; //тема письма
		КонецЕсли; 	
		ОтправитьСообщение(Тип, Имя, Ошибка, ИмяФайла, Получатели);
	КонецЕсли;  
КонецПроцедуры

//Евросиб Каблов 05.08.2020
Процедура ОтправитьСообщениеВФорматеHTML(Получатели, Тема, ТекстСообщения) Экспорт
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	Профиль.АдресСервераSMTP = "esxexch";
	Профиль.ПортSMTP = "25";
	Профиль.АутентификацияSMTP = Ложь;
	Почта = Новый ИнтернетПочта;
	Попытка
		Почта.Подключиться(Профиль);
	Исключение
	КонецПопытки;
	Письмо = Новый ИнтернетПочтовоеСообщение;
	Для каждого Получатель Из Получатели Цикл
		Письмо.Получатели.Добавить(Получатель);
	КонецЦикла; 
	Письмо.Отправитель.Адрес = "tpdper@eurosib.biz";
	Текст = Письмо.Тексты.Добавить();
	Текст.ТипТекста = ТипТекстаПочтовогоСообщения.HTML;
	Текст.Текст = ТекстСообщения;
	Письмо.Тема = Тема;
	Попытка
		Почта.Послать(Письмо);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область Работа_с_Диадоком

//<< Евросиб - Витвицкий 23.07.2019
Процедура ЗаписатьСостояниеДокументаВДиадоке(Документ, СостояниеДокументооборота, ДатаОбновленияСостояния) Экспорт
	МенеджерЗаписи = РегистрыСведений.СостоянияДокументовВДиадоке.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Документ = Документ;
	МенеджерЗаписи.СостояниеДокументооборота = СостояниеДокументооборота;
	МенеджерЗаписи.ДатаОбновленияСостояния = ДатаОбновленияСостояния;
	МенеджерЗаписи.Записать();
КонецПроцедуры //>> Евросиб - Витвицкий 23.07.2019

#КонецОбласти

#Область РаботаСАсуИнформ

Процедура ВыгрузитьВагоныИКонтейнеры() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТС.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ТС КАК ТС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПризнакСобственностиВагона.СрезПоследних КАК ПризнакСобственностиВагонаСрезПоследних
	|		ПО ТС.Ссылка = ПризнакСобственностиВагонаСрезПоследних.Вагон
	|ГДЕ
	|	НЕ ТС.ПометкаУдаления
	|	И ПризнакСобственностиВагонаСрезПоследних.ВЭксплуатации
	|	И ПризнакСобственностиВагонаСрезПоследних.ПризнакСобственности В(&ПризнакСобственности)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЕ.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ТЕ КАК ТЕ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные.СрезПоследних КАК стоки_ТекущиеДанныеСрезПоследних
	|		ПО ТЕ.Ссылка = стоки_ТекущиеДанныеСрезПоследних.КТК
	|ГДЕ
	|	НЕ ТЕ.ПометкаУдаления
	|	И стоки_ТекущиеДанныеСрезПоследних.тек_ВЭксплуатации = ИСТИНА";
	
//Евросиб Гудкова( 19.01.2020
	МассивПризнаковСобственности = Новый Массив;
	МассивПризнаковСобственности.Добавить(Перечисления.ВариантыСобственности.Собственный); 
	// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
	//Было:
	//МассивПризнаковСобственности.Добавить(Перечисления.ВариантыСобственности.Арендованный); 
	//Стало:
	МассивПризнаковСобственности.Добавить(Перечисления.ВариантыСобственности.АрендаДлительная);
	// ДИТ 65580 Давудов М.А. Конец: 23.02.2023
	МассивПризнаковСобственности.Добавить(Перечисления.ВариантыСобственности.Спот); 
	// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
	//Было:
	//МассивПризнаковСобственности.Добавить(Перечисления.ВариантыСобственности.Море); // а вы что, морских вагонов не видели?
	//Стало:
	МассивПризнаковСобственности.Добавить(Перечисления.ВариантыСобственности.СпотМорской);
	// ДИТ 65580 Давудов М.А. Конец: 23.02.2023
	Запрос.УстановитьПараметр("ПризнакСобственности", МассивПризнаковСобственности);	
// Евросиб Гудкова) 	
	Результаты = Запрос.ВыполнитьПакет();
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(Константы.КаталогДислокацииРФ.Получить() + "\RequestFromDC\DataCore_TrackItem_" + Формат(ТекущаяДата(), "ДФ=yyyyMMddччммсс")+ ".xml");    
	ЗаписьXML.ЗаписатьНачалоЭлемента("TrackItem");
	
	//ЗаписьXML.ЗаписатьНачалоЭлемента("VAG");	
	//ВыборкаВагонов = Результаты[0].Выбрать();	
	//Пока ВыборкаВагонов.Следующий() Цикл
	//	ЗаписьXML.ЗаписатьНачалоЭлемента("VAG_NUMBER");
	//	ЗаписьXML.ЗаписатьТекст(СокрЛП(ВыборкаВагонов.Наименование));
	//	ЗаписьXML.ЗаписатьКонецЭлемента();	
	//КонецЦикла;
	//ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CONT");	
	ВыборкаКонтейнеров = Результаты[1].Выбрать();	
	Пока ВыборкаКонтейнеров.Следующий() Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("CONT_NUMBER");
		ЗаписьXML.ЗаписатьТекст(СокрЛП(ВыборкаКонтейнеров.Наименование));
		ЗаписьXML.ЗаписатьКонецЭлемента();	
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();		
	ЗаписьXML.Закрыть();
	
КонецПроцедуры

Процедура ВыгрузитьКонтейнерыДляПостановкиНаСлежениеПоМорю() Экспорт
	
	ДатаДислокации = ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТранспортныйДокументКоносаменты.НомерКТК КАК НомерКТК,
	|	ТранспортныйДокументКоносаменты.НомерКТК.Наименование КАК НомерКТКНаименование,
	|	ЕСТЬNULL(ТранспортныйДокументКоносаменты.Ссылка.МорскаяЛиния.КодSearates, """") КАК МорскаяЛинияКодSearates,
	|	ЕСТЬNULL(ТранспортныйДокументКоносаменты.Ссылка.МорскаяЛиния.Наименование, """") КАК МорскаяЛинияНаименование
	|ИЗ
	|	Документ.ТранспортныйДокумент.Коносаменты КАК ТранспортныйДокументКоносаменты
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ТранспортныйДокументКоносаменты.Ссылка.ДатаПрибытия <> &ПустаяДата
	|				ТОГДА ТранспортныйДокументКоносаменты.Ссылка.ДатаПрибытия
	|			ИНАЧЕ ТранспортныйДокументКоносаменты.Ссылка.ДатаПрибытияПлан
	|		КОНЕЦ >= &ДатаДислокации
	|	И ВЫБОР
	|			КОГДА ТранспортныйДокументКоносаменты.Ссылка.ДатаОтправления <> &ПустаяДата
	|				ТОГДА ТранспортныйДокументКоносаменты.Ссылка.ДатаОтправления
	|			ИНАЧЕ ТранспортныйДокументКоносаменты.Ссылка.ДатаОтправленияПлан
	|		КОНЕЦ <= &ДатаДислокации
	|	И ТранспортныйДокументКоносаменты.Ссылка.Проведен";
	
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	Запрос.УстановитьПараметр("ДатаДислокации", ДатаДислокации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Запись = Новый ЗаписьXML;
	
	//ИмяФайла = Константы.КаталогДислокацииРФ.Получить() + "\RequestFromDC\DataCore_SeaDislocation_" + Формат(ДатаДислокации, "ДФ=yyyyMMddччммсс")+ ".xml";
	ИмяФайла = Константы.КаталогДислокацииРФ.Получить() + "\RequestFromDC\DataCore_SeaDislocation.xml";
	//Запись.УстановитьСтроку("UTF-8");
	//Запись.УстановитьСтроку("windows-1251");
	Запись.ОткрытьФайл(ИмяФайла);
	Запись.ЗаписатьОбъявлениеXML();
	
	Запись.ЗаписатьНачалоЭлемента("SeaDislocation");
	
	Пока Выборка.Следующий() Цикл
		ДобавитьЭлементВФайл(Запись, "Container", "", Новый Структура("Number, CodeSearates, SeaLineName", Выборка.НомерКТКНаименование, Выборка.МорскаяЛинияКодSearates, Выборка.МорскаяЛинияНаименование));
	КонецЦикла;
	
	Запись.ЗаписатьКонецЭлемента();
		
	СтрокаXML = Запись.Закрыть();
	
КонецПроцедуры

// При ЭтоТест = Истина в базе создаются вагоны и контейнеры по загружаемым номерам и не перемещаются обработанные файлы
Процедура ЗагрузитьДислокацииВРегистр(ЭтоТест = Ложь) Экспорт
	
	ЭтоТест = ЭтоТест или ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована;

	ОбработкаФайловАсуИнформ("Вагоны", ЭтоТест);
	ОбработкаФайловАсуИнформ("Контейнеры", ЭтоТест);
	ОбработкаФайловАсуИнформ("Пробеги", ЭтоТест);
	//Евросиб Каблов 22.06.2020 (
	ОбработкаФайловАсуИнформ("Контейнеры море", ЭтоТест);
	//Евросиб Каблов 22.06.2020 )
	
КонецПроцедуры

Функция ПолучитьОстаточноеРасстояниеМеждуСтанциями(СтанцияОтправления, СтанцияНазначения) Экспорт
	
	Результат = РегистрыСведений.РасстоянияМеждуЛокациями.ПолучитьРасстояние(СтанцияОтправления, СтанцияНазначения);
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Если НЕ ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("СохранятьРасстояниеМеждуСтанциямиПриПолученииДислокации") = Истина Тогда
			Возврат 0;	
		КонецЕсли; 
		РЕЗ_РТ = РейлТариф_сервер.ПолучитьРасстояние(СтанцияОтправления.КодЖДСтанции, СтанцияНазначения.КодЖДСтанции);
		Если РЕЗ_РТ > 0 Тогда
			Результат = РЕЗ_РТ;
			РейлТариф_сервер.СохранитьРасстояниеМеждуЛокациями(СтанцияОтправления.КодЖДСтанции, СтанцияНазначения.КодЖДСтанции, РЕЗ_РТ);
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

Процедура ЗагрузитьРемонты(ЭтоТест = Ложь) Экспорт
	
	ОбработкаФайловАсуИнформ("Ремонты", ЭтоТест);
	
КонецПроцедуры

Процедура ЗагрузитьПаспортаВагонов(ЭтоТест = Ложь) Экспорт
	
	ОбработкаФайловАсуИнформ("ПаспортаВагонов", ЭтоТест);
	
КонецПроцедуры

Процедура ОбработкаФайловАсуИнформ(ИмяПапки, ЭтоТест) Экспорт
	
	МассивФайлов = НайтиФайлы(Константы.КаталогДислокацииРФ.Получить() + "\Дислокации для загрузки в DC\" + ИмяПапки, "*.xml");
	СписокФайлов = Новый СписокЗначений;
	Для Каждого Файл Из МассивФайлов Цикл
		СписокФайлов.Добавить(Файл, Файл.ИмяБезРасширения);		
	КонецЦикла;
	СписокФайлов.СортироватьПоПредставлению();
	
	Для Каждого Файл Из СписокФайлов Цикл
		ЗаписьЖурналаРегистрации("Загрузка дислокаций", 
								УровеньЖурналаРегистрации.Информация,
								,
								,
								СтрШаблон("Начало загрузки файла дислокаций (%1) %2 %3",ИмяПапки, Файл.Значение.Имя, ТекущаяДата()));
		МассивОшибок = Новый Массив;
		Отказ = Ложь;
		
		//Евросиб Каблов 22.06.2020 (
		Если ИмяПапки = "Контейнеры море" Тогда
			ЗаписатьМорскиеДислокацииКонтейнеров(Файл.Значение.ПолноеИмя, МассивОшибок, ЭтоТест);
		Иначе		
		//Евросиб Каблов 22.06.2020 )		
			Чтение = Новый ЧтениеXML;
			Чтение.ОткрытьФайл(Файл.Значение.ПолноеИмя);
			КорневойОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(Чтение);
			Чтение.Закрыть();
			ТаблицаДислокации = ПолучитьТаблицуДислокации();
			
			Если ТипЗнч(КорневойОбъектXDTO.ROW) = Тип("СписокXDTO") Тогда
				Для Каждого Элемент Из КорневойОбъектXDTO.ROW Цикл
					Если ИмяПапки = "Вагоны" Тогда
						нСтрокаДислокации = ТаблицаДислокации.Добавить();
						ПрочитатьДислокациюВагона(Элемент, МассивОшибок, нСтрокаДислокации, ЭтоТест);
					ИначеЕсли ИмяПапки = "Контейнеры" Тогда
						ЗаписатьДислокациюКонтейнера(Элемент, МассивОшибок, ЭтоТест);
					ИначеЕсли ИмяПапки = "Пробеги" Тогда
						ЗаписатьПробегиВагонов(Элемент, МассивОшибок, Файл.Представление, ЭтоТест);
					ИначеЕсли ИмяПапки = "Ремонты" Тогда
						ЗаписатьРемонты(Элемент, МассивОшибок, ЭтоТест);
					ИначеЕсли ИмяПапки = "ПаспортаВагонов" Тогда
						ЗаписатьПаспортаВагонов(Элемент, МассивОшибок, ЭтоТест);
					КонецЕсли;
				КонецЦикла;
				Если ИмяПапки = "Вагоны" Тогда
					ТаблицаДислокации.Сортировать("Вагон, Период");
					ЗаполнитьДатыОтправления(ТаблицаДислокации);
					Для каждого СтрокаДислокации Из ТаблицаДислокации Цикл
						мз = РегистрыСведений.ДислокацияВагонов.СоздатьМенеджерЗаписи();
						ЗаполнитьЗначенияСвойств(мз, СтрокаДислокации);
						мз.Записать();
					КонецЦикла; 
				КонецЕсли; 
			ИначеЕсли ТипЗнч(КорневойОбъектXDTO.ROW) = Тип("ОбъектXDTO") Тогда
				Если ИмяПапки = "Вагоны" Тогда
					ЗаписатьДислокациюВагона(КорневойОбъектXDTO.ROW, МассивОшибок, ЭтоТест);
				ИначеЕсли ИмяПапки = "Контейнеры" Тогда
					ЗаписатьДислокациюКонтейнера(КорневойОбъектXDTO.ROW, МассивОшибок, ЭтоТест);
				ИначеЕсли ИмяПапки = "Пробеги" Тогда
					ЗаписатьПробегиВагонов(КорневойОбъектXDTO.ROW, МассивОшибок, Файл.Представление, ЭтоТест);
				ИначеЕсли ИмяПапки = "Ремонты" Тогда
					ЗаписатьРемонты(КорневойОбъектXDTO.ROW, МассивОшибок, ЭтоТест);
				ИначеЕсли ИмяПапки = "ПаспортаВагонов" Тогда
					ЗаписатьПаспортаВагонов(КорневойОбъектXDTO.ROW, МассивОшибок, ЭтоТест);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если МассивОшибок.Количество() > 0 Тогда
			ЗаписьЖурналаРегистрации("Загрузка дислокаций", 
									УровеньЖурналаРегистрации.Ошибка,
									,
									,
									СтрШаблон("При загрузке файла %1 произошли следующие ошибки %2", Файл.Значение.Имя, СтрСоединить(МассивОшибок, Символы.ПС)));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При загрузке файла " + Файл.Значение.ПолноеИмя + " произошли следующие ошибки:" + Символы.ПС + СтрСоединить(МассивОшибок, Символы.ПС));	
			Если Не ЭтоТест Тогда
				Попытка
					ПереместитьФайл(Файл.Значение.ПолноеИмя, Константы.КаталогДислокацииРФ.Получить() + "\Дислокации для загрузки в DC\Обработанные файлы\Ошибки\" + Файл.Значение.Имя); 
				Исключение
					ЗаписьЖурналаРегистрации("Загрузка дислокаций", 
											УровеньЖурналаРегистрации.Ошибка,
											,
											,
											СтрШаблон("При перемещении файла %1 произошла ошибка %2", Файл.Значение.Имя, ОписаниеОшибки()));
				КонецПопытки;
			КонецЕсли;
			//Евросиб Коханенко Н.А. 28.12.2023 (( #79320 
			ОтправлениеЭлектронногоСообщенияОбОшибкахЗагрузкиЛокаций(МассивОшибок);
			//Евросиб Коханенко Н.А. 28.12.2023 )) #79320 
		Иначе
			Если Не ЭтоТест Тогда
				Попытка
					ПереместитьФайл(Файл.Значение.ПолноеИмя, Константы.КаталогДислокацииРФ.Получить() +"\Дислокации для загрузки в DC\Обработанные файлы\Успешно\" + Файл.Значение.Имя); 
				Исключение
					ЗаписьЖурналаРегистрации("Загрузка дислокаций", 
											УровеньЖурналаРегистрации.Ошибка,
											,
											,
											СтрШаблон("При перемещении файла %1 произошла ошибка %2", Файл.Значение.Имя, ОписаниеОшибки()));
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		ЗаписьЖурналаРегистрации("Загрузка дислокаций", 
							УровеньЖурналаРегистрации.Информация,
							,
							,
							СтрШаблон("Конец загрузки файла дислокаций (%1) %2 %3",ИмяПапки, Файл.Значение.Имя, ТекущаяДата()));
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ЗаписатьПробегиВагонов(ДислокацияXDTO, МассивОшибок, ИмяФайла, ЭтоТест)
	
	Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Прав(ИмяФайла, 14)) Тогда
		Попытка
			Период = Дата(Прав(ИмяФайла, 14));
		Исключение
			МассивОшибок.Добавить("Неверный формат даты в имени файла");
			Возврат;
		КонецПопытки;
	Иначе
		МассивОшибок.Добавить("Неверный формат даты в имени файла");
		Возврат;
	КонецЕсли;
	
	Если ДислокацияXDTO.Свойства().Получить("carNum") <> Неопределено Тогда 
		Вагон = Справочники.ТС.НайтиПоНаименованию(ДислокацияXDTO.carNum, Истина); 	
		Если Вагон.Пустая() Тогда
			Если ЭтоТест Тогда
				ВагонОбъект = Справочники.ТС.СоздатьЭлемент();
				ВагонОбъект.Наименование = ДислокацияXDTO.carNum;
				ВагонОбъект.Записать();
				Вагон = ВагонОбъект.Ссылка;
			Иначе
				МассивОшибок.Добавить("В справочнике ""ТС"" не найден вагон с номером " + ДислокацияXDTO.carNum);
				Возврат;
			КонецЕсли;
		КонецЕсли;
	Иначе
		МассивОшибок.Добавить("В одном из пробегов не заполнено обязательное поле carNum");
		Возврат;
	КонецЕсли;
	
	//Если МассивОшибок.Количество() > 0 Тогда
	//	Возврат;
	//КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ПробегиВагонов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = Период; 	
	МенеджерЗаписи.Вагон = Вагон;
	Если ДислокацияXDTO.Свойства().Получить("totalRun") <> Неопределено Тогда
		МенеджерЗаписи.ПолныйПробег = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ДислокацияXDTO.totalRun);	
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("restRun") <> Неопределено Тогда
		МенеджерЗаписи.ОстаточныйПробег = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ДислокацияXDTO.restRun);	
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("brdRun") <> Неопределено Тогда
		МенеджерЗаписи.ПорогПробега = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ДислокацияXDTO.brdRun);	
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("nrmRun") <> Неопределено Тогда
		МенеджерЗаписи.НормативныйПробег = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ДислокацияXDTO.nrmRun);	
	КонецЕсли;
	
	Попытка
		МенеджерЗаписи.Записать();
	Исключение
		МассивОшибок.Добавить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьТаблицуДислокации()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДислокацияВагонов.Период КАК Период,
	|	ДислокацияВагонов.Вагон КАК Вагон,
	|	ДислокацияВагонов.ОперацияСВагоном КАК ОперацияСВагоном,
	|	ДислокацияВагонов.РабочийПарк КАК РабочийПарк,
	|	ДислокацияВагонов.Груженый КАК Груженый,
	|	ДислокацияВагонов.НомерПоезда КАК НомерПоезда,
	|	ДислокацияВагонов.ИндексПоезда КАК ИндексПоезда,
	|	ДислокацияВагонов.КодГрузоотправителя КАК КодГрузоотправителя,
	|	ДислокацияВагонов.КодГрузополучателя КАК КодГрузополучателя,
	|	ДислокацияВагонов.Собственник КАК Собственник,
	|	ДислокацияВагонов.КодГрузаЕТСНГ КАК КодГрузаЕТСНГ,
	|	ДислокацияВагонов.Груз КАК Груз,
	|	ДислокацияВагонов.ВесГруза КАК ВесГруза,
	|	ДислокацияВагонов.СтанцияОперации КАК СтанцияОперации,
	|	ДислокацияВагонов.СтанцияНазначения КАК СтанцияНазначения,
	|	ДислокацияВагонов.СтанцияОтправления КАК СтанцияОтправления,
	|	ДислокацияВагонов.ДатаПрибытияНаСтанцию КАК ДатаПрибытияНаСтанцию,
	|	ДислокацияВагонов.ПростойНаСтанции КАК ПростойНаСтанции,
	|	ДислокацияВагонов.ДатаОтправленияСоСтанции КАК ДатаОтправленияСоСтанции,
	|	ДислокацияВагонов.ОстаточноеРасстояниеКМ КАК ОстаточноеРасстояниеКМ
	|ИЗ
	|	РегистрСведений.ДислокацияВагонов КАК ДислокацияВагонов";
	ТЗ = Запрос.Выполнить().Выгрузить();
	ТЗ.Очистить();
	Возврат ТЗ;
	
	
КонецФункции

Процедура ЗаполнитьДатыОтправления(ТаблицаДислокации)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДислокацияВагонов.Период КАК Период,
	|	ДислокацияВагонов.Вагон КАК Вагон,
	|	ДислокацияВагонов.ОперацияСВагоном КАК ОперацияСВагоном,
	|	ДислокацияВагонов.РабочийПарк КАК РабочийПарк,
	|	ДислокацияВагонов.Груженый КАК Груженый,
	|	ДислокацияВагонов.НомерПоезда КАК НомерПоезда,
	|	ДислокацияВагонов.ИндексПоезда КАК ИндексПоезда,
	|	ДислокацияВагонов.КодГрузоотправителя КАК КодГрузоотправителя,
	|	ДислокацияВагонов.КодГрузополучателя КАК КодГрузополучателя,
	|	ДислокацияВагонов.Собственник КАК Собственник,
	|	ДислокацияВагонов.КодГрузаЕТСНГ КАК КодГрузаЕТСНГ,
	|	ДислокацияВагонов.Груз КАК Груз,
	|	ДислокацияВагонов.ВесГруза КАК ВесГруза,
	|	ДислокацияВагонов.СтанцияОперации КАК СтанцияОперации,
	|	ДислокацияВагонов.СтанцияНазначения КАК СтанцияНазначения,
	|	ДислокацияВагонов.СтанцияОтправления КАК СтанцияОтправления,
	|	ДислокацияВагонов.ДатаПрибытияНаСтанцию КАК ДатаПрибытияНаСтанцию,
	|	ДислокацияВагонов.ПростойНаСтанции КАК ПростойНаСтанции,
	|	ДислокацияВагонов.ДатаОтправленияСоСтанции КАК ДатаОтправленияСоСтанции,
	|	ДислокацияВагонов.ОстаточноеРасстояниеКМ КАК ОстаточноеРасстояниеКМ
	|ПОМЕСТИТЬ ВремТЧ
	|ИЗ
	|	&ДислокацияВагонов КАК ДислокацияВагонов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТЧ.Период КАК Период,
	|	ВремТЧ.Вагон КАК Вагон,
	|	ВремТЧ.ОперацияСВагоном КАК ОперацияСВагоном,
	|	ВремТЧ.РабочийПарк КАК РабочийПарк,
	|	ВремТЧ.Груженый КАК Груженый,
	|	ВремТЧ.НомерПоезда КАК НомерПоезда,
	|	ВремТЧ.ИндексПоезда КАК ИндексПоезда,
	|	ВремТЧ.КодГрузоотправителя КАК КодГрузоотправителя,
	|	ВремТЧ.КодГрузополучателя КАК КодГрузополучателя,
	|	ВремТЧ.Собственник КАК Собственник,
	|	ВремТЧ.КодГрузаЕТСНГ КАК КодГрузаЕТСНГ,
	|	ВремТЧ.Груз КАК Груз,
	|	ВремТЧ.ВесГруза КАК ВесГруза,
	|	ВремТЧ.СтанцияОперации КАК СтанцияОперации,
	|	ВремТЧ.СтанцияНазначения КАК СтанцияНазначения,
	|	ВремТЧ.СтанцияОтправления КАК СтанцияОтправления,
	|	ВремТЧ.ДатаПрибытияНаСтанцию КАК ДатаПрибытияНаСтанцию,
	|	ВремТЧ.ПростойНаСтанции КАК ПростойНаСтанции,
	|	ВЫБОР
	|		КОГДА ВремТЧ.СтанцияОперации = ВремТЧ.СтанцияОтправления
	|			ТОГДА ВремТЧ.Период
	|		ИНАЧЕ ВложенныйЗапрос.ДатаОтправленияСоСтанции
	|	КОНЕЦ КАК ДатаОтправленияСоСтанции,
	|	ВремТЧ.ОстаточноеРасстояниеКМ КАК ОстаточноеРасстояниеКМ
	|ИЗ
	|	ВремТЧ КАК ВремТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ДислокацияВагоновСрезПоследних.Вагон КАК Вагон,
	|			МАКСИМУМ(ДислокацияВагоновСрезПоследних.ДатаОтправленияСоСтанции) КАК ДатаОтправленияСоСтанции
	|		ИЗ
	|			РегистрСведений.ДислокацияВагонов.СрезПоследних КАК ДислокацияВагоновСрезПоследних
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					ДислокацияВагонов.Вагон КАК Вагон,
	|					МАКСИМУМ(ДислокацияВагонов.Период) КАК Период
	|				ИЗ
	|					РегистрСведений.ДислокацияВагонов КАК ДислокацияВагонов
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремТЧ КАК ВремТЧ
	|						ПО ДислокацияВагонов.Вагон = ВремТЧ.Вагон
	|							И ДислокацияВагонов.Период <= ВремТЧ.Период
	|				
	|				СГРУППИРОВАТЬ ПО
	|					ДислокацияВагонов.Вагон) КАК ВложенныйЗапрос
	|				ПО ДислокацияВагоновСрезПоследних.Вагон = ВложенныйЗапрос.Вагон
	|					И ДислокацияВагоновСрезПоследних.Период = ВложенныйЗапрос.Период
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ДислокацияВагоновСрезПоследних.Вагон) КАК ВложенныйЗапрос
	|		ПО ВремТЧ.Вагон = ВложенныйЗапрос.Вагон";
	Запрос.УстановитьПараметр("ДислокацияВагонов", ТаблицаДислокации);
	ТаблицаДислокации = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

Процедура ЗаписатьДислокациюКонтейнера(ДислокацияXDTO, МассивОшибок, ЭтоТест)
	
	Если ДислокацияXDTO.Свойства().Получить("NOM_KON") <> Неопределено Тогда 
		//Евросиб Каблов 06.10.2020 (
		//Контейнер = РаботаСКонтейнерамиСервер.НайтиКТК(ДислокацияXDTO.NOM_KON); // Справочники.ТЕ.НайтиПоНаименованию(ДислокацияXDTO.NOM_KON, Истина);
		//Если Контейнер.Пустая() Тогда
		Контейнер = РаботаСКонтейнерамиСервер.НайтиКТК(ДислокацияXDTO.NOM_KON, Ложь);				
		Если Не ЗначениеЗаполнено(Контейнер) Тогда
		//Евросиб Каблов 06.10.2020 )
			Если ЭтоТест Тогда
				//КонтейнерОбъект = Справочники.ТЕ.СоздатьЭлемент();
				//КонтейнерОбъект.Префикс = Лев(ДислокацияXDTO.NOM_KON, 4); 
				//КонтейнерОбъект.Номер =  Сред(ДислокацияXDTO.NOM_KON, 5, 6); 
				//КонтейнерОбъект.КонтрольноеЧисло = Прав(ДислокацияXDTO.NOM_KON, 1);			
				//КонтейнерОбъект.Записать();
				//Контейнер = КонтейнерОбъект.Ссылка;
				Префикс = Лев(ДислокацияXDTO.NOM_KON, 4); 
				Номер =  Сред(ДислокацияXDTO.NOM_KON, 5, 6); 
				КонтрольноеЧисло = Прав(ДислокацияXDTO.NOM_KON, 1);			
				НомерКТК = "" + Префикс + Номер + КонтрольноеЧисло;
				Контейнер = РаботаСКонтейнерамиСервер.СоздатьКТК(НомерКТК);
			Иначе
				МассивОшибок.Добавить("В справочнике DataCore не найден контейнер с номером " + ДислокацияXDTO.NOM_KON);
				Возврат;
			КонецЕсли;
		КонецЕсли;
	Иначе
		МассивОшибок.Добавить("В одной из дислокаций не заполнено обязательное поле NOM_KON");
		Возврат;
	КонецЕсли;
	
	//Если МассивОшибок.Количество() > 0 Тогда
	//	Возврат;
	//КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ДислокацияКонтейнеров.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Контейнер = Контейнер;
		
	Если ДислокацияXDTO.Свойства().Получить("KOP_KMD") <> Неопределено И ДислокацияXDTO.Свойства().Получить("PR_KOP_KMD") <> Неопределено Тогда
//Евросиб Гудкова( 10.10.2019 
//было		ОперацияСВагоном = Справочники.ОперацииСВагонами.НайтиПоКоду(ДислокацияXDTO.PR_KOP_KMD + ДислокацияXDTO.KOP_KMD);
		ОперацияСВагоном = Неопределено;
		ОперацииСВагономВыборка = Справочники.ОперацииСВагонами.Выбрать(,, Новый Структура("Код", ДислокацияXDTO.PR_KOP_KMD + ДислокацияXDTO.KOP_KMD));
		Пока ОперацииСВагономВыборка.Следующий() Цикл
			Если ОперацииСВагономВыборка.ОперацияСКТК Тогда
				ОперацияСВагоном = ОперацииСВагономВыборка.Ссылка;
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
// Евросиб Гудкова) 		
		Если Не ЗначениеЗаполнено(ОперацияСВагоном) Тогда
			НоваяОперацияСВагоном = Справочники.ОперацииСВагонами.СоздатьЭлемент();
			НоваяОперацияСВагоном.Наименование = ДислокацияXDTO.PR_KOP_KMD + ДислокацияXDTO.KOP_KMD;
			НоваяОперацияСВагоном.Код = ДислокацияXDTO.PR_KOP_KMD + ДислокацияXDTO.KOP_KMD;
			НоваяОперацияСВагоном.ОперацияСКТК = Истина;
			Попытка
				НоваяОперацияСВагоном.Записать();
			Исключение
				МассивОшибок.Добавить(ОписаниеОшибки());
				Возврат;
			КонецПопытки;
			ОперацияСВагоном = НоваяОперацияСВагоном.Ссылка;	
		КонецЕсли;
		МенеджерЗаписи.ОперацияСВагоном = ОперацияСВагоном;
	КонецЕсли;	
	
	Если ДислокацияXDTO.Свойства().Получить("TIP_KON") <> Неопределено Тогда
		МенеджерЗаписи.ТипКонтейнера = ДислокацияXDTO.TIP_KON;
	КонецЕсли;	
	Если ДислокацияXDTO.Свойства().Получить("PPK_POR") <> Неопределено Тогда
		МенеджерЗаписи.Груженый = XMLЗначение(Тип("Булево"), ДислокацияXDTO.PPK_POR);
	КонецЕсли;	
	Если ДислокацияXDTO.Свойства().Получить("STR_OTPRV") <> Неопределено Тогда
		МенеджерЗаписи.СтранаОтправления = Справочники.СтраныМира.НайтиПоКоду(ДислокацияXDTO.STR_OTPRV)
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("STR_NAZN") <> Неопределено Тогда
		МенеджерЗаписи.СтранаНазначения = Справочники.СтраныМира.НайтиПоКоду(ДислокацияXDTO.STR_NAZN);
	КонецЕсли;	
	Если ДислокацияXDTO.Свойства().Получить("NOM_OTPRK") <> Неопределено Тогда
		МенеджерЗаписи.НомерНакладной = ДислокацияXDTO.NOM_OTPRK;
	КонецЕсли;	
	Если ДислокацияXDTO.Свойства().Получить("KOD_GRZ_ETSNG") <> Неопределено Тогда
		МенеджерЗаписи.КодГрузаЕТСНГ = ДислокацияXDTO.KOD_GRZ_ETSNG;
		МенеджерЗаписи.Груз = Справочники.Грузы.НайтиПоРеквизиту("ЕТСНГ", ДислокацияXDTO.KOD_GRZ_ETSNG);
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("KOD_GRZ_GNG") <> Неопределено И МенеджерЗаписи.Груз.Пустая() Тогда
		МенеджерЗаписи.Груз = Справочники.Грузы.НайтиПоРеквизиту("ГНГ", ДислокацияXDTO.KOD_GRZ_GNG);
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("MAS_GRZ") <> Неопределено Тогда
		МенеджерЗаписи.ВесГруза = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ДислокацияXDTO.MAS_GRZ);
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("DATE_OP") <> Неопределено Тогда
		МенеджерЗаписи.Период = XMLЗначение(Тип("Дата"), ДислокацияXDTO.DATE_OP);
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("INDEX_POEZD") <> Неопределено Тогда
		МенеджерЗаписи.ИндексПоезда = ДислокацияXDTO.INDEX_POEZD;
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("NOM_VAG") <> Неопределено Тогда
		МенеджерЗаписи.Вагон = Справочники.ТС.НайтиПоНаименованию(ДислокацияXDTO.NOM_VAG, Истина);
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("NOM_PPV") <> Неопределено Тогда
		МенеджерЗаписи.НомерППВ = ДислокацияXDTO.NOM_PPV; 
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("STAN_POGR_OTPRK") <> Неопределено Тогда
		МенеджерЗаписи.СтанцияПогрузкиКонтейнера = ЛокацияПоКодуСтанции(ДислокацияXDTO.STAN_POGR_OTPRK);
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("STAN_NAZN_VAG") <> Неопределено Тогда
		МенеджерЗаписи.СтанцияНазначения = ЛокацияПоКодуСтанции(ДислокацияXDTO.STAN_NAZN_VAG);
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("STAN_POGR_VAG") <> Неопределено Тогда
		МенеджерЗаписи.СтанцияПогрузкиВагона = ЛокацияПоКодуСтанции(ДислокацияXDTO.STAN_POGR_VAG);
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("STAN_OP") <> Неопределено Тогда
		МенеджерЗаписи.СтанцияОперации = ЛокацияПоКодуСтанции(ДислокацияXDTO.STAN_OP);
	КонецЕсли;	
	
	// siv 08/07/20 добавлю пробег
	МенеджерЗаписи.ОстаточноеРасстояниеКМ = ПолучитьОстаточноеРасстояниеМеждуСтанциями(МенеджерЗаписи.СтанцияОперации, МенеджерЗаписи.СтанцияНазначения);
	
	//Евросиб Каблов 07.12.2020 (
	МенеджерЗаписи.ДатаЗаписи = ТекущаяДата();
	//Евросиб Каблов 07.12.2020 )
	
	Попытка
		МенеджерЗаписи.Записать();
	Исключение
		МассивОшибок.Добавить(ОписаниеОшибки());
	КонецПопытки;
	
	Если ДислокацияXDTO.Свойства().Получить("OWN") <> Неопределено Тогда
		ЗаписатьПризнакСобственностиКонтейнера(Контейнер, ДислокацияXDTO.OWN, XMLЗначение(Тип("Дата"),ДислокацияXDTO.OWN_DATE_START));	
	КонецЕсли; 
		
КонецПроцедуры	

//Евросиб Каблов 22.06.2020
Процедура ЗаписатьМорскиеДислокацииКонтейнеров(ИмяФайла, МассивОшибок, ЭтоТест)
	
	ЗначенияПолейЗаписи = Новый Структура;
	ЗначенияПолейЗаписи.Вставить("Период");
	ЗначенияПолейЗаписи.Вставить("Контейнер");
	ЗначенияПолейЗаписи.Вставить("Линия");
	ЗначенияПолейЗаписи.Вставить("Порт");
	ЗначенияПолейЗаписи.Вставить("Судно");
	ЗначенияПолейЗаписи.Вставить("Рейс");
	ЗначенияПолейЗаписи.Вставить("Событие");
	ЗначенияПолейЗаписи.Вставить("containerNumber");
	ЗначенияПолейЗаписи.Вставить("sealine");
	ЗначенияПолейЗаписи.Вставить("id");
	ЗначенияПолейЗаписи.Вставить("name");
	ЗначенияПолейЗаписи.Вставить("lat");
	ЗначенияПолейЗаписи.Вставить("lng");
	ЗначенияПолейЗаписи.Вставить("country");
	ЗначенияПолейЗаписи.Вставить("distTo");
	ЗначенияПолейЗаписи.Вставить("type");
	ЗначенияПолейЗаписи.Вставить("voyage");
	ЗначенияПолейЗаписи.Вставить("vessel");
	ЗначенияПолейЗаписи.Вставить("pathTo"); 
	ЗначенияПолейЗаписи.Вставить("status");
	
	ТаблицаДислокаций = Новый ТаблицаЗначений;
	ТаблицаДислокаций.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТаблицаДислокаций.Колонки.Добавить("Контейнер", Новый ОписаниеТипов("СправочникСсылка.ТЕ"));
	ТаблицаДислокаций.Колонки.Добавить("Линия", Новый ОписаниеТипов("СправочникСсылка.МорскиеЛинии"));
	ТаблицаДислокаций.Колонки.Добавить("Порт", Новый ОписаниеТипов("СправочникСсылка.Локации"));
	ТаблицаДислокаций.Колонки.Добавить("Судно", Новый ОписаниеТипов("СправочникСсылка.ТС"));
	ТаблицаДислокаций.Колонки.Добавить("Рейс", Новый ОписаниеТипов("СправочникСсылка.РейсыМоре"));
	ТаблицаДислокаций.Колонки.Добавить("Событие", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(255)));
	ТаблицаДислокаций.Колонки.Добавить("containerNumber", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(11)));
	ТаблицаДислокаций.Колонки.Добавить("sealine", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(10)));
	ТаблицаДислокаций.Колонки.Добавить("id", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(10)));
	ТаблицаДислокаций.Колонки.Добавить("name", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(255)));
	ТаблицаДислокаций.Колонки.Добавить("lat", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 5)));
	ТаблицаДислокаций.Колонки.Добавить("lng", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 5)));
	ТаблицаДислокаций.Колонки.Добавить("country", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(2)));
	ТаблицаДислокаций.Колонки.Добавить("distTo", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(10, 0)));
	ТаблицаДислокаций.Колонки.Добавить("type", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(3)));
	ТаблицаДислокаций.Колонки.Добавить("voyage", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(255)));
	ТаблицаДислокаций.Колонки.Добавить("vessel", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(255)));
	ТаблицаДислокаций.Колонки.Добавить("pathTo", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(0)));
	
	МорскиеЛинии = Новый Соответствие;
	Локации = Новый Соответствие;
	РейсыМоре = Новый Соответствие;
	Суда = Новый Соответствие;
	
	Чтение = Новый ЧтениеXML;
	Чтение.ОткрытьФайл(ИмяФайла);
	
	ДанныеФайла = ФабрикаXDTO.ПрочитатьXML(Чтение);
	
	СтрокиДислокации = ДанныеФайла.row;
	Если ТипЗнч(СтрокиДислокации) = Тип("ОбъектXDTO") Тогда
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(СтрокиДислокации);
		СтрокиДислокации = МассивСтрок;
	КонецЕсли;
	
	Для Каждого СтрокаДислокации Из СтрокиДислокации Цикл
		
		НомерКонтейнера = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(СтрокаДислокации, "containerNumber");
		Если Не ЗначениеЗаполнено(НомерКонтейнера) Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЗначенияПолейЗаписи, СтрокаДислокации);
		
		//Евросиб Каблов 06.10.2020 (
		//ЗначенияПолейЗаписи.Контейнер = РаботаСКонтейнерамиСервер.НайтиКТК(ЗначенияПолейЗаписи.containerNumber); // Справочники.ТЕ.НайтиПоНаименованию(ЗначенияПолейЗаписи.containerNumber);
		ЗначенияПолейЗаписи.Контейнер = РаботаСКонтейнерамиСервер.НайтиКТК(НомерКонтейнера, Ложь);
		Если Не ЗначениеЗаполнено(ЗначенияПолейЗаписи.Контейнер) Тогда
			Если ЭтоТест Тогда
				//КонтейнерОбъект = Справочники.ТЕ.СоздатьЭлемент();
				//КонтейнерОбъект.Префикс = Лев(НомерКонтейнера, 4); 
				//КонтейнерОбъект.Номер =  Сред(НомерКонтейнера, 5, 6); 
				//КонтейнерОбъект.КонтрольноеЧисло = Прав(НомерКонтейнера, 1);			
				//КонтейнерОбъект.Записать();
				//ЗначенияПолейЗаписи.Контейнер = КонтейнерОбъект.Ссылка;
				Префикс = Лев(НомерКонтейнера, 4); 
				Номер =  Сред(НомерКонтейнера, 5, 6); 
				КонтрольноеЧисло = Прав(НомерКонтейнера, 1);			
				НомерКТК = "" + Префикс + Номер + КонтрольноеЧисло;
				Контейнер = РаботаСКонтейнерамиСервер.СоздатьКТК(НомерКТК);
				ЗначенияПолейЗаписи.Контейнер = Контейнер;
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		//Евросиб Каблов 06.10.2020 )
		
		МорскаяЛинияСсылка = МорскиеЛинии.Получить(ЗначенияПолейЗаписи.sealine);
		Если ЗначениеЗаполнено(МорскаяЛинияСсылка) Тогда
			ЗначенияПолейЗаписи.Линия = МорскаяЛинияСсылка;
		Иначе
			ЗначенияПолейЗаписи.Линия = Справочники.МорскиеЛинии.НайтиПоРеквизиту("КодSearates", ЗначенияПолейЗаписи.sealine);
			МорскиеЛинии.Вставить(ЗначенияПолейЗаписи.sealine, ЗначенияПолейЗаписи.Линия);
		КонецЕсли;
		
		СписокТочек = СтрокаДислокации.points;
		Точки = СписокТочек.point;
		Если ТипЗнч(Точки) = Тип("ОбъектXDTO") Тогда
			МассивСтрок = Новый Массив;
			МассивСтрок.Добавить(Точки);
			Точки = МассивСтрок;
		КонецЕсли;
		
		Для Каждого Точка Из Точки Цикл
			
			ЗаполнитьЗначенияСвойств(ЗначенияПолейЗаписи, Точка);
			//ИД = Точка.id;
			//Имя = Точка.name;
			//ПорядковыйНомер = Точка.orderNo;
			Если НЕ ЗначениеЗаполнено(ЗначенияПолейЗаписи.name) Тогда
				Продолжить;
			КонецЕсли; 
			
			ЛокацияСсылка = Локации.Получить(ЗначенияПолейЗаписи.name);
			Если ЗначениеЗаполнено(ЛокацияСсылка) Тогда
				ЗначенияПолейЗаписи.Порт = ЛокацияСсылка;
			Иначе				
				ЗначенияПолейЗаписи.Порт = Справочники.Локации.НайтиПоРеквизиту("НаименованиеАнгл", ЗначенияПолейЗаписи.name);
				Локации.Вставить(ЗначенияПолейЗаписи.name, ЗначенияПолейЗаписи.Порт);
			КонецЕсли;
			
			//Точки следования до порта
			Если Точка.Свойства().Получить("pathTo") <> Неопределено Тогда
				
				Путь = Точка.pathTo;
				ТочкиПути = Путь.row;
				Если ТипЗнч(ТочкиПути) = Тип("ОбъектXDTO") Тогда
					МассивСтрок = Новый Массив;
					МассивСтрок.Добавить(ТочкиПути);
					ТочкиПути = МассивСтрок;
				КонецЕсли;
				
				ТочкиСледованияДоПорта = Новый Массив;
				Для Каждого ТочкаПути Из ТочкиПути Цикл
					
					ДанныеТочки = Новый Структура;
					ДанныеТочки.Вставить("lattitude");
					ДанныеТочки.Вставить("longtitude");
					ДанныеТочки.Вставить("orderNo");
									
					ЗаполнитьЗначенияСвойств(ДанныеТочки, ТочкаПути);
									
					ТочкаСледоования = СтрШаблон("%1:%2:%3", ДанныеТочки.orderNo, ДанныеТочки.lattitude, ДанныеТочки.longtitude);
					ТочкиСледованияДоПорта.Добавить(ТочкаСледоования);
					
				КонецЦикла;
				
				ЗначенияПолейЗаписи.pathTo = СтрСоединить(ТочкиСледованияДоПорта, ";");
				
			Иначе
				
				ЗначенияПолейЗаписи.pathTo = "";
				
			КонецЕсли;
			
			//События			
			Если Точка.Свойства().Получить("events") <> Неопределено Тогда
				СписокСобытий = Точка.events;
				События = СписокСобытий.row;
				Если ТипЗнч(События) = Тип("ОбъектXDTO") Тогда
					МассивСтрок = Новый Массив;
					МассивСтрок.Добавить(События);
					События = МассивСтрок;
				КонецЕсли;
			Иначе
				События = Новый Массив;
			КонецЕсли;
		
			Для Каждого Событие Из События Цикл
				
				//Евросиб Каблов 18.09.2020 (
				//ЗначенияПолейЗаписи.Вставить("vessel", Неопределено);
				//ЗначенияПолейЗаписи.Вставить("voyage", Неопределено);
				//ЗначенияПолейЗаписи.Вставить("Рейс", Неопределено);
				//ЗначенияПолейЗаписи.Вставить("Судно", Неопределено);
				//
				//ЗаполнитьЗначенияСвойств(ЗначенияПолейЗаписи, Событие);
				ЗначенияПолейЗаписи.Вставить("vessel", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(Событие, "vessel", Тип("Строка"), ""));
				ЗначенияПолейЗаписи.Вставить("voyage", ПолучитьЗначениеПоляОбъектаXDTOПоИмени(Событие, "voyage", Тип("Строка"), ""));
				РейсСсылка = РейсыМоре.Получить(ЗначенияПолейЗаписи.voyage);
				Если ЗначениеЗаполнено(РейсСсылка) Тогда
					ЗначенияПолейЗаписи.Вставить("Рейс", РейсСсылка);
				Иначе
					РейсСсылка = Справочники.РейсыМоре.НайтиПоРеквизиту("НомерРейса", ЗначенияПолейЗаписи.voyage);
					ЗначенияПолейЗаписи.Вставить("Рейс", РейсСсылка);
					РейсыМоре.Вставить(ЗначенияПолейЗаписи.voyage, РейсСсылка);
				КонецЕсли;
				
				СудноСсылка = Суда.Получить(ЗначенияПолейЗаписи.vessel);
				Если ЗначениеЗаполнено(СудноСсылка) Тогда
					ЗначенияПолейЗаписи.Вставить("Судно", СудноСсылка);
				Иначе
					СудноСсылка = Справочники.ТС.НайтиПоНаименованию(ЗначенияПолейЗаписи.vessel);
					ЗначенияПолейЗаписи.Вставить("Судно", СудноСсылка);
					Суда.Вставить(ЗначенияПолейЗаписи.vessel, СудноСсылка);
				КонецЕсли;				
				//Евросиб Каблов 18.09.2020 )
				
				//ЗначенияПолейЗаписи.Период = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(Событие, "date", Тип("Дата"));
				ЗначенияПолейЗаписи.Период = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(Событие, "NDate", Тип("Дата"));
				ЗначенияПолейЗаписи.status = ПолучитьЗначениеПоляОбъектаXDTOПоИмени(Событие, "status");
				ЗначенияПолейЗаписи.Событие = Событие.description;
				
				Если ЗначениеЗаполнено(ЗначенияПолейЗаписи.voyage) Тогда
					ЗначенияПолейЗаписи.Рейс = Справочники.РейсыМоре.НайтиПоКоду(ЗначенияПолейЗаписи.voyage);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ЗначенияПолейЗаписи.vessel) Тогда
					ЗначенияПолейЗаписи.Судно = Справочники.ТС.НайтиПоНаименованию(ЗначенияПолейЗаписи.vessel);
				КонецЕсли;
				
				//СтрокаТаблицы = ТаблицаДислокаций.Добавить();
				//ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ЗначенияПолейЗаписи);
				Запись = РегистрыСведений.ДислокацияКонтейнеровМоре.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись, ЗначенияПолейЗаписи);
				Запись.Записать();
				
			КонецЦикла;		
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДислокаций", ТаблицаДислокаций);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДислокаций.Период КАК Период,
	|	ТаблицаДислокаций.Контейнер КАК Контейнер,
	|	ТаблицаДислокаций.Событие КАК Событие,
	|	ТаблицаДислокаций.containerNumber КАК containerNumber,
	|	ТаблицаДислокаций.sealine КАК sealine,
	|	ТаблицаДислокаций.id КАК id,
	|	ТаблицаДислокаций.name КАК name,
	|	ТаблицаДислокаций.lat КАК lat,
	|	ТаблицаДислокаций.lng КАК lng,
	|	ТаблицаДислокаций.country КАК country,
	|	ТаблицаДислокаций.distTo КАК distTo,
	|	ТаблицаДислокаций.type КАК type,
	|	ТаблицаДислокаций.voyage КАК voyage,
	|	ТаблицаДислокаций.vessel КАК vessel,
	|	ТаблицаДислокаций.pathTo КАК pathTo
	|ПОМЕСТИТЬ ВТДислокации
	|ИЗ
	|	&ТаблицаДислокаций КАК ТаблицаДислокаций
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДислокации.Период КАК Период,
	|	ВТДислокации.Контейнер КАК Контейнер,
	|	ВТДислокации.Событие КАК Событие,
	|	ВТДислокации.containerNumber КАК containerNumber,
	|	ВТДислокации.sealine КАК sealine,
	|	ВТДислокации.id КАК id,
	|	ВТДислокации.name КАК name,
	|	ВТДислокации.lat КАК lat,
	|	ВТДислокации.lng КАК lng,
	|	ВТДислокации.country КАК country,
	|	ВТДислокации.distTo КАК distTo,
	|	ВТДислокации.type КАК type,
	|	ВТДислокации.voyage КАК voyage,
	|	ВТДислокации.vessel КАК vessel,
	|	ВТДислокации.pathTo КАК pathTo,
	|	МорскиеЛинии.Ссылка КАК Линия,
	|	Локации.Ссылка КАК Порт,
	|	РейсыМоре.Ссылка КАК Рейс,
	|	ТС.Ссылка КАК Судно
	|ИЗ
	|	ВТДислокации КАК ВТДислокации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МорскиеЛинии КАК МорскиеЛинии
	|		ПО ВТДислокации.sealine = МорскиеЛинии.КодSearates
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Локации КАК Локации
	|		ПО ВТДислокации.name = Локации.НаименованиеАнгл
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РейсыМоре КАК РейсыМоре
	|		ПО ВТДислокации.voyage = РейсыМоре.НомерРейса
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТС КАК ТС
	|		ПО ВТДислокации.vessel = ТС.Наименование";
	 
	ТаблицаДислокаций = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Дислокация Из ТаблицаДислокаций Цикл
		
		Если Не ЗначениеЗаполнено(Дислокация.Контейнер) Тогда
			Если ЭтоТест Тогда
				//КонтейнерОбъект = Справочники.ТЕ.СоздатьЭлемент();
				//КонтейнерОбъект.Префикс = Лев(Дислокация.containerNumber, 4); 
				//КонтейнерОбъект.Номер =  Сред(Дислокация.containerNumber, 5, 6); 
				//КонтейнерОбъект.КонтрольноеЧисло = Прав(Дислокация.containerNumber, 1);			
				//КонтейнерОбъект.Записать();
				Префикс = Лев(Дислокация.containerNumber, 4); 
				Номер =  Сред(Дислокация.containerNumber, 5, 6); 
				КонтрольноеЧисло = Прав(Дислокация.containerNumber, 1);			
				Контейнер = РаботаСКонтейнерамиСервер.СоздатьКТК(НомерКТК);
				Дислокация.Контейнер = Контейнер;
			Иначе
				МассивОшибок.Добавить("В справочнике DataCore не найден контейнер с номером " + Дислокация.containerNumber);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Дислокация.Период) Тогда
			МассивОшибок.Добавить("Не указан период для дислокации контейнера " + Дислокация.containerNumber);
			Продолжить;
		КонецЕсли;
		
		Запись = РегистрыСведений.ДислокацияКонтейнеровМоре.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Дислокация);
		Запись.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьПризнакСобственностиКонтейнера(Контейнер, Собственность, ДатаНачалаСобственности)
	
	Если Собственность = "own" Тогда
		ПризнакСобственности = Перечисления.ВариантыСобственности.Собственный;
		ВЭксплуатации = Истина;
	ИначеЕсли Собственность = "spot" Тогда
		ПризнакСобственности = Перечисления.ВариантыСобственности.Спот;
		ВЭксплуатации = Истина;
	ИначеЕсли Собственность = "other" Тогда
		// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
		//Было:
		//ПризнакСобственности = Перечисления.ВариантыСобственности.Прочее;
		//Стало:
		ПризнакСобственности = Перечисления.ВариантыСобственности.Клиентский;
		// ДИТ 65580 Давудов М.А. Конец: 23.02.2023
		ВЭксплуатации = Ложь;
	ИначеЕсли Собственность = "leased" Тогда
		// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
		//Было:
		//ПризнакСобственности = Перечисления.ВариантыСобственности.Арендованный;
		//Стало:
		ПризнакСобственности = Перечисления.ВариантыСобственности.АрендаДлительная;
		// ДИТ 65580 Давудов М.А. Конец: 23.02.2023
		ВЭксплуатации = Истина;
	Иначе
		// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
		//Было:
		//ПризнакСобственности = Перечисления.ВариантыСобственности.Неизвестно;
		//Стало:
		ПризнакСобственности = Перечисления.ВариантыСобственности.ПустаяСсылка();
		// ДИТ 65580 Давудов М.А. Конец: 23.02.2023
		ВЭксплуатации = Ложь;
	КонецЕсли; 
	МенеджерЗаписи = РегистрыСведений.ПризнакСобственностиКонтейнера.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ДатаНачалаСобственности;
	МенеджерЗаписи.Контейнер = Контейнер;
	МенеджерЗаписи.ПризнакСобственности = ПризнакСобственности;
	МенеджерЗаписи.ВЭксплуатации = ВЭксплуатации;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры
	
Процедура ЗаписатьПризнакСобственностиВагона(Вагон, Собственность, ДатаНачалаСобственности,СданВАренду)
	
	Если Собственность = "own" Тогда
		ПризнакСобственности = Перечисления.ВариантыСобственности.Собственный;
		ВЭксплуатации = Истина;
	ИначеЕсли Собственность = "spot" Тогда
		ПризнакСобственности = Перечисления.ВариантыСобственности.Спот;
		ВЭксплуатации = Истина;
	ИначеЕсли Собственность = "other" Тогда
		// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
		//Было:
		//ПризнакСобственности = Перечисления.ВариантыСобственности.Прочее;
		//Стало:
		ПризнакСобственности = Перечисления.ВариантыСобственности.Клиентский;
		// ДИТ 65580 Давудов М.А. Конец: 23.02.2023
		ВЭксплуатации = Ложь;
	ИначеЕсли Собственность = "leased" Тогда
		// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
		//Было:
		//ПризнакСобственности = Перечисления.ВариантыСобственности.Арендованный;
		//Стало:
		ПризнакСобственности = Перечисления.ВариантыСобственности.АрендаДлительная;
		// ДИТ 65580 Давудов М.А. Конец: 23.02.2023
		ВЭксплуатации = Истина;
	Иначе
		// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
		//Было:
		//ПризнакСобственности = Перечисления.ВариантыСобственности.Неизвестно;
		//Стало:
		ПризнакСобственности = Перечисления.ВариантыСобственности.ПустаяСсылка();
		// ДИТ 65580 Давудов М.А. Конец: 23.02.2023
		ВЭксплуатации = Ложь;
	КонецЕсли; 
	МенеджерЗаписи = РегистрыСведений.ПризнакСобственностиВагона.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ДатаНачалаСобственности;
	МенеджерЗаписи.Вагон = Вагон;
	МенеджерЗаписи.Прочитать();
	//ДИТ Шевченко А.В. 54982 09.08.2022 -Начало //Добавил СданВАренду
 	Если МенеджерЗаписи.Выбран() 
		И (МенеджерЗаписи.ПризнакСобственности <> ПризнакСобственности
		ИЛИ МенеджерЗаписи.ВЭксплуатации <> ВЭксплуатации ИЛИ МенеджерЗаписи.СданВАренду <> СданВАренду) Тогда
		МенеджерЗаписи.ПризнакСобственности = ПризнакСобственности;
		МенеджерЗаписи.СданВАренду = СданВАренду;
		МенеджерЗаписи.ВЭксплуатации = ВЭксплуатации;
		МенеджерЗаписи.Записать();
	Иначе
		МенеджерЗаписи.Период = ДатаНачалаСобственности;
		МенеджерЗаписи.Вагон = Вагон;
		МенеджерЗаписи.СданВАренду = СданВАренду;
		МенеджерЗаписи.ПризнакСобственности = ПризнакСобственности;
		МенеджерЗаписи.ВЭксплуатации = ВЭксплуатации;
		МенеджерЗаписи.Записать();
	КонецЕсли; 
	//ДИТ Шевченко А.В. 54982 09.08.2022 -Начало
КонецПроцедуры
	
Процедура ЗаписатьДислокациюВагона(ДислокацияXDTO, МассивОшибок, ЭтоТест)
	
	Если ДислокацияXDTO.Свойства().Получить("AKT_NINV") <> Неопределено Тогда 
		Вагон = Справочники.ТС.НайтиПоНаименованию(ДислокацияXDTO.AKT_NINV, Истина); 	
		Если Вагон.Пустая() Тогда
			Если ЭтоТест Тогда
				ВагонОбъект = Справочники.ТС.СоздатьЭлемент();
				ВагонОбъект.Наименование = ДислокацияXDTO.AKT_NINV;
				ВагонОбъект.Записать();
				Вагон = ВагонОбъект.Ссылка;
			Иначе
				МассивОшибок.Добавить("В справочнике DataCore не найден вагон с номером " + ДислокацияXDTO.AKT_NINV);
				Возврат;
			КонецЕсли;
		КонецЕсли;
	Иначе
		МассивОшибок.Добавить("В одной из дислокаций не заполнено обязательное поле AKT_NINV");
		Возврат;
	КонецЕсли;
	
	//Если МассивОшибок.Количество() > 0 Тогда
	//	Возврат;
	//КонецЕсли;
		
	МенеджерЗаписи = РегистрыСведений.ДислокацияВагонов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Вагон = Вагон;
	
	Если ДислокацияXDTO.Свойства().Получить("AKT_AKT_KOP") <> Неопределено И ДислокацияXDTO.Свойства().Получить("AKT_PR_KOP") <> Неопределено Тогда
//Евросиб Гудкова( 10.10.2019 
//было 		ОперацияСВагоном = Справочники.ОперацииСВагонами.НайтиПоКоду(ДислокацияXDTO.AKT_PR_KOP + ДислокацияXDTO.AKT_AKT_KOP);
		ОперацияСВагоном = Неопределено;
		ОперацииСВагономВыборка = Справочники.ОперацииСВагонами.Выбрать(,, Новый Структура("Код", ДислокацияXDTO.AKT_PR_KOP + ДислокацияXDTO.AKT_AKT_KOP));
		Пока ОперацииСВагономВыборка.Следующий() Цикл
			Если Не ОперацииСВагономВыборка.ОперацияСКТК Тогда
				ОперацияСВагоном = ОперацииСВагономВыборка.Ссылка;
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
// Евросиб Гудкова) 		
		Если Не ЗначениеЗаполнено(ОперацияСВагоном) Тогда
			НоваяОперацияСВагоном = Справочники.ОперацииСВагонами.СоздатьЭлемент();
			НоваяОперацияСВагоном.Наименование = ДислокацияXDTO.AKT_PR_KOP + ДислокацияXDTO.AKT_AKT_KOP;
			НоваяОперацияСВагоном.Код = ДислокацияXDTO.AKT_PR_KOP + ДислокацияXDTO.AKT_AKT_KOP; 
			Попытка
				НоваяОперацияСВагоном.Записать();
			Исключение
				МассивОшибок.Добавить(ОписаниеОшибки());
				Возврат;
			КонецПопытки;
			ОперацияСВагоном = НоваяОперацияСВагоном.Ссылка;	
		КонецЕсли;
		МенеджерЗаписи.ОперацияСВагоном = ОперацияСВагоном;
	КонецЕсли;
	
	Если ДислокацияXDTO.Свойства().Получить("AKT_AKT_KSTN") <> Неопределено Тогда
		//Евросиб Каблов 21.09.2020 (
		//МенеджерЗаписи.СтанцияОперации = ЛокацияПоКодуСтанции(ДислокацияXDTO.AKT_AKT_KSTN);
		КодСтанции = ДислокацияXDTO.AKT_AKT_KSTN;
		
		// Евросиб Фролов (21.10.2021 Ticket№ 0243986
		//МенеджерЗаписи.СтанцияОперации = ЛокацияПоКодуСтанции(КодСтанции);
		КодДороги = Неопределено;
		Если ДислокацияXDTO.Свойства().Получить("AKT_AKT_KDOR") <> Неопределено Тогда
			КодДороги = ДислокацияXDTO.AKT_AKT_KDOR;
		КонецЕсли;
		МенеджерЗаписи.СтанцияОперации = ЛокацияПоКодуСтанции(КодСтанции, КодДороги);
		// Евросиб Фролов)
		
		Если Не ЗначениеЗаполнено(МенеджерЗаписи.СтанцияОперации) Тогда
			//Евросиб Коханенко Н.А. 28.12.2023 (( #79320
			//НеизвестнаяСтанция = Справочники.Локации.СоздатьЭлемент();
			//НеизвестнаяСтанция.Тип 				= Справочники.ТипыЛокаций.СтанцияЖД;
			//НеизвестнаяСтанция.КодЖДСтанции 		= КодСтанции;
			//НеизвестнаяСтанция.Наименование 		= "Неизвестная станция";
			//НеизвестнаяСтанция.Записать();
			//МенеджерЗаписи.СтанцияОперации = НеизвестнаяСтанция.Ссылка;
			МенеджерЗаписи.СтанцияОперации = ПолучитьНеизвестнуюСтанциюПоУмолчанию(КодСтанции, МассивОшибок);
            //Евросиб Коханенко Н.А. 28.12.2023 )) #79320
		КонецЕсли;
		//Евросиб Каблов 21.09.2020 )
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("AKT_AKT_DAT") <> Неопределено Тогда
		МенеджерЗаписи.Период = XMLЗначение(Тип("Дата"), ДислокацияXDTO.AKT_AKT_DAT);
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("AKT_PRIZN_P") <> Неопределено Тогда
		МенеджерЗаписи.РабочийПарк = XMLЗначение(Тип("Булево"), ДислокацияXDTO.AKT_PRIZN_P);
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("AKT_PGRUZ") <> Неопределено Тогда
		МенеджерЗаписи.Груженый = XMLЗначение(Тип("Булево"), ДислокацияXDTO.AKT_PGRUZ);
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("AKT_NTRA") <> Неопределено Тогда
		МенеджерЗаписи.НомерПоезда = ДислокацияXDTO.AKT_NTRA;
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("AKT_IND") <> Неопределено Тогда
		МенеджерЗаписи.ИндексПоезда = ДислокацияXDTO.AKT_IND;
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("AKT_KSTN_NAZN") <> Неопределено Тогда
		//Евросиб Каблов 21.09.2020 (
		//МенеджерЗаписи.СтанцияНазначения = ЛокацияПоКодуСтанции(ДислокацияXDTO.AKT_KSTN_NAZN);
		КодСтанции = ДислокацияXDTO.AKT_KSTN_NAZN;
				
		// Евросиб Фролов (21.10.2021 Ticket№ 0243986
		//МенеджерЗаписи.СтанцияНазначения = ЛокацияПоКодуСтанции(КодСтанции);
		КодДороги = Неопределено;
		Если ДислокацияXDTO.Свойства().Получить("AKT_KDOR_NAZN") <> Неопределено Тогда
			КодДороги = ДислокацияXDTO.AKT_KDOR_NAZN;
		КонецЕсли;
		МенеджерЗаписи.СтанцияНазначения = ЛокацияПоКодуСтанции(КодСтанции, КодДороги);
		// Евросиб Фролов)
		
		Если Не ЗначениеЗаполнено(МенеджерЗаписи.СтанцияНазначения) Тогда
			//Евросиб Коханенко Н.А. 28.12.2023 (( #79320
			//НеизвестнаяСтанция = Справочники.Локации.СоздатьЭлемент();
			//НеизвестнаяСтанция.Тип 				= Справочники.ТипыЛокаций.СтанцияЖД;
			//НеизвестнаяСтанция.КодЖДСтанции 		= КодСтанции;
			//НеизвестнаяСтанция.Наименование 		= "Неизвестная станция";
			//НеизвестнаяСтанция.Записать();
			//МенеджерЗаписи.СтанцияОперации = НеизвестнаяСтанция.Ссылка;
			МенеджерЗаписи.СтанцияОперации = ПолучитьНеизвестнуюСтанциюПоУмолчанию(КодСтанции, МассивОшибок);
            //Евросиб Коханенко Н.А. 28.12.2023 )) #79320
		КонецЕсли;
		//Евросиб Каблов 21.09.2020 )
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("AKT_WGR") <> Неопределено Тогда
		МенеджерЗаписи.ВесГруза = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ДислокацияXDTO.AKT_WGR);
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("AKT_KGR") <> Неопределено Тогда
		МенеджерЗаписи.КодГрузаЕТСНГ = ДислокацияXDTO.AKT_KGR;
		МенеджерЗаписи.Груз = Справочники.Грузы.НайтиПоРеквизиту("ЕТСНГ", ДислокацияXDTO.AKT_KGR);
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("OKPO") <> Неопределено Тогда
		МенеджерЗаписи.Собственник = Справочники.Контрагенты.НайтиПоРеквизиту("КодПоОКПО", ДислокацияXDTO.OKPO); 
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("AKT_KGRO") <> Неопределено Тогда
		МенеджерЗаписи.КодГрузоотправителя = ДислокацияXDTO.AKT_KGRO;	
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("AKT_KGRP") <> Неопределено Тогда
		МенеджерЗаписи.КодГрузополучателя = ДислокацияXDTO.AKT_KGRP; 
	КонецЕсли;
//Евросиб Гудкова( 20.09.2020 Ticket№ 0206314 добавлена станция отправления в дислокации
	Если ДислокацияXDTO.Свойства().Получить("AKT_KSTN_OTPR") <> Неопределено Тогда
		//Евросиб Каблов 21.09.2020 (
		//МенеджерЗаписи.СтанцияОтправления = ЛокацияПоКодуСтанции(ДислокацияXDTO.AKT_KSTN_OTPR);
		КодСтанции = ДислокацияXDTO.AKT_KSTN_OTPR;
		
		// Евросиб Фролов (21.10.2021 Ticket№ 0243986
		//МенеджерЗаписи.СтанцияОтправления = ЛокацияПоКодуСтанции(КодСтанции);
		КодДороги = Неопределено;
		Если ДислокацияXDTO.Свойства().Получить("AKT_KDOR_OTPR") <> Неопределено Тогда
			КодДороги = ДислокацияXDTO.AKT_KDOR_OTPR;
		КонецЕсли;
		МенеджерЗаписи.СтанцияОтправления = ЛокацияПоКодуСтанции(КодСтанции, КодДороги);
		// Евросиб Фролов)
		
		Если Не ЗначениеЗаполнено(МенеджерЗаписи.СтанцияОтправления) Тогда
			//Евросиб Коханенко Н.А. 28.12.2023 (( #79320
			//НеизвестнаяСтанция = Справочники.Локации.СоздатьЭлемент();
			//НеизвестнаяСтанция.Тип 				= Справочники.ТипыЛокаций.СтанцияЖД;
			//НеизвестнаяСтанция.КодЖДСтанции 		= КодСтанции;
			//НеизвестнаяСтанция.Наименование 		= "Неизвестная станция";
			//НеизвестнаяСтанция.Записать();
			//МенеджерЗаписи.СтанцияОперации = НеизвестнаяСтанция.Ссылка;
			МенеджерЗаписи.СтанцияОперации = ПолучитьНеизвестнуюСтанциюПоУмолчанию(КодСтанции, МассивОшибок);
            //Евросиб Коханенко Н.А. 28.12.2023 )) #79320
		КонецЕсли;
		//Евросиб Каблов 21.09.2020 )
	КонецЕсли;
// Евросиб Гудкова) 	
	// siv 08/07/20 добавлю пробег
	МенеджерЗаписи.ОстаточноеРасстояниеКМ = ПолучитьОстаточноеРасстояниеМеждуСтанциями(МенеджерЗаписи.СтанцияОперации, МенеджерЗаписи.СтанцияНазначения); 
	
	Попытка
		МенеджерЗаписи.Записать();
	Исключение
		МассивОшибок.Добавить(ОписаниеОшибки());
	КонецПопытки;
	
	Если ДислокацияXDTO.Свойства().Получить("OWN") <> Неопределено Тогда
		//ДИТ Шевченко А.В. 54982 09.08.2022 -Начало
		СданВАренду = Ложь;	
		Если ДислокацияXDTO.Свойства().Получить("IS_RENT") <> Неопределено Тогда
			СданВАренду = XMLЗначение(Тип("Булево"),ДислокацияXDTO.IS_RENT);
		КонецЕсли;
		//ДИТ Шевченко А.В. 54982 09.08.2022 -Конец
		ЗаписатьПризнакСобственностиВагона(Вагон, ДислокацияXDTO.OWN, XMLЗначение(Тип("Дата"),ДислокацияXDTO.OWN_DATE_START),СданВАренду);	
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПрочитатьДислокациюВагона(ДислокацияXDTO, МассивОшибок, СтрокаДислокации, ЭтоТест)
	
	Если ДислокацияXDTO.Свойства().Получить("AKT_NINV") <> Неопределено Тогда 
		Вагон = Справочники.ТС.НайтиПоНаименованию(ДислокацияXDTO.AKT_NINV, Истина); 	
		Если Вагон.Пустая() Тогда
			Если ЭтоТест Тогда
				ВагонОбъект = Справочники.ТС.СоздатьЭлемент();
				ВагонОбъект.Наименование = ДислокацияXDTO.AKT_NINV;
				ВагонОбъект.Записать();
				Вагон = ВагонОбъект.Ссылка;
			Иначе
				МассивОшибок.Добавить("В справочнике DataCore не найден вагон с номером " + ДислокацияXDTO.AKT_NINV);
				Возврат;
			КонецЕсли;
		КонецЕсли;
	Иначе
		МассивОшибок.Добавить("В одной из дислокаций не заполнено обязательное поле AKT_NINV");
		Возврат;
	КонецЕсли;
	
	//Если МассивОшибок.Количество() > 0 Тогда
	//	Возврат;
	//КонецЕсли;
		
	//МенеджерЗаписи = РегистрыСведений.ДислокацияВагонов.СоздатьМенеджерЗаписи();
	СтрокаДислокации.Вагон = Вагон;
	
	Если ДислокацияXDTO.Свойства().Получить("AKT_AKT_KOP") <> Неопределено И ДислокацияXDTO.Свойства().Получить("AKT_PR_KOP") <> Неопределено Тогда
//Евросиб Гудкова( 10.10.2019 
//было 		ОперацияСВагоном = Справочники.ОперацииСВагонами.НайтиПоКоду(ДислокацияXDTO.AKT_PR_KOP + ДислокацияXDTO.AKT_AKT_KOP);
		ОперацияСВагоном = Неопределено;
		ОперацииСВагономВыборка = Справочники.ОперацииСВагонами.Выбрать(,, Новый Структура("Код", ДислокацияXDTO.AKT_PR_KOP + ДислокацияXDTO.AKT_AKT_KOP));
		Пока ОперацииСВагономВыборка.Следующий() Цикл
			Если Не ОперацииСВагономВыборка.ОперацияСКТК Тогда
				ОперацияСВагоном = ОперацииСВагономВыборка.Ссылка;
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
// Евросиб Гудкова) 		
		Если Не ЗначениеЗаполнено(ОперацияСВагоном) Тогда
			НоваяОперацияСВагоном = Справочники.ОперацииСВагонами.СоздатьЭлемент();
			НоваяОперацияСВагоном.Наименование = ДислокацияXDTO.AKT_PR_KOP + ДислокацияXDTO.AKT_AKT_KOP;
			НоваяОперацияСВагоном.Код = ДислокацияXDTO.AKT_PR_KOP + ДислокацияXDTO.AKT_AKT_KOP; 
			Попытка
				НоваяОперацияСВагоном.Записать();
			Исключение
				МассивОшибок.Добавить(ОписаниеОшибки());
				Возврат;
			КонецПопытки;
			ОперацияСВагоном = НоваяОперацияСВагоном.Ссылка;	
		КонецЕсли;
		СтрокаДислокации.ОперацияСВагоном = ОперацияСВагоном;
	КонецЕсли;
	
	Если ДислокацияXDTO.Свойства().Получить("AKT_AKT_KSTN") <> Неопределено Тогда
		//Евросиб Каблов 21.09.2020 (
		//МенеджерЗаписи.СтанцияОперации = ЛокацияПоКодуСтанции(ДислокацияXDTO.AKT_AKT_KSTN);
		КодСтанции = ДислокацияXDTO.AKT_AKT_KSTN;
		
		// Евросиб Фролов (21.10.2021 Ticket№ 0243986
		//СтрокаДислокации.СтанцияОперации = ЛокацияПоКодуСтанции(КодСтанции);
		КодДороги = Неопределено;
		Если ДислокацияXDTO.Свойства().Получить("AKT_AKT_KDOR") <> Неопределено Тогда
			КодДороги = ДислокацияXDTO.AKT_AKT_KDOR;
		КонецЕсли;
		СтрокаДислокации.СтанцияОперации = ЛокацияПоКодуСтанции(КодСтанции, КодДороги);
		// Евросиб Фролов)		
		
		Если Не ЗначениеЗаполнено(СтрокаДислокации.СтанцияОперации) Тогда
			//Евросиб Коханенко Н.А. 28.12.2023 (( #79320
			//НеизвестнаяСтанция = Справочники.Локации.СоздатьЭлемент();
			//НеизвестнаяСтанция.Тип 				= Справочники.ТипыЛокаций.СтанцияЖД;
			//НеизвестнаяСтанция.КодЖДСтанции 		= КодСтанции;
			//НеизвестнаяСтанция.Наименование 		= "Неизвестная станция";
			//НеизвестнаяСтанция.Записать();                                 
			//СтрокаДислокации.СтанцияОтправления = НеизвестнаяСтанция.Ссылка;
			СтрокаДислокации.СтанцияОтправления = ПолучитьНеизвестнуюСтанциюПоУмолчанию(КодСтанции, МассивОшибок);
			//Евросиб Коханенко Н.А. 28.12.2023 )) #79320
		КонецЕсли;
		//Евросиб Каблов 21.09.2020 )
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("AKT_AKT_DAT") <> Неопределено Тогда
		СтрокаДислокации.Период = XMLЗначение(Тип("Дата"), ДислокацияXDTO.AKT_AKT_DAT);
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("AKT_PRIZN_P") <> Неопределено Тогда
		СтрокаДислокации.РабочийПарк = XMLЗначение(Тип("Булево"), ДислокацияXDTO.AKT_PRIZN_P);
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("AKT_PGRUZ") <> Неопределено Тогда
		СтрокаДислокации.Груженый = XMLЗначение(Тип("Булево"), ДислокацияXDTO.AKT_PGRUZ);
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("AKT_NTRA") <> Неопределено Тогда
		СтрокаДислокации.НомерПоезда = ДислокацияXDTO.AKT_NTRA;
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("AKT_IND") <> Неопределено Тогда
		СтрокаДислокации.ИндексПоезда = ДислокацияXDTO.AKT_IND;
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("AKT_KSTN_NAZN") <> Неопределено Тогда
		//Евросиб Каблов 21.09.2020 (
		//МенеджерЗаписи.СтанцияНазначения = ЛокацияПоКодуСтанции(ДислокацияXDTO.AKT_KSTN_NAZN);
		КодСтанции = ДислокацияXDTO.AKT_KSTN_NAZN;
		
		// Евросиб Фролов (21.10.2021 Ticket№ 0243986
		//СтрокаДислокации.СтанцияНазначения = ЛокацияПоКодуСтанции(КодСтанции);
		КодДороги = Неопределено;
		Если ДислокацияXDTO.Свойства().Получить("AKT_KDOR_NAZN") <> Неопределено Тогда
			КодДороги = ДислокацияXDTO.AKT_KDOR_NAZN;
		КонецЕсли;
		СтрокаДислокации.СтанцияНазначения = ЛокацияПоКодуСтанции(КодСтанции, КодДороги);
		// Евросиб Фролов)
		
		Если Не ЗначениеЗаполнено(СтрокаДислокации.СтанцияНазначения) Тогда
			//Евросиб Коханенко Н.А. 28.12.2023 (( #79320
			//НеизвестнаяСтанция = Справочники.Локации.СоздатьЭлемент();
			//НеизвестнаяСтанция.Тип 				= Справочники.ТипыЛокаций.СтанцияЖД;
			//НеизвестнаяСтанция.КодЖДСтанции 		= КодСтанции;
			//НеизвестнаяСтанция.Наименование 		= "Неизвестная станция";
			//НеизвестнаяСтанция.Записать();                                 
			//СтрокаДислокации.СтанцияОтправления = НеизвестнаяСтанция.Ссылка;
			СтрокаДислокации.СтанцияОтправления = ПолучитьНеизвестнуюСтанциюПоУмолчанию(КодСтанции, МассивОшибок);
			//Евросиб Коханенко Н.А. 28.12.2023 )) #79320
		КонецЕсли;
		//Евросиб Каблов 21.09.2020 )
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("AKT_WGR") <> Неопределено Тогда
		СтрокаДислокации.ВесГруза = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ДислокацияXDTO.AKT_WGR);
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("AKT_KGR") <> Неопределено Тогда
		СтрокаДислокации.КодГрузаЕТСНГ = ДислокацияXDTO.AKT_KGR;
		СтрокаДислокации.Груз = Справочники.Грузы.НайтиПоРеквизиту("ЕТСНГ", ДислокацияXDTO.AKT_KGR);
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("OKPO") <> Неопределено Тогда
		СтрокаДислокации.Собственник = Справочники.Контрагенты.НайтиПоРеквизиту("КодПоОКПО", ДислокацияXDTO.OKPO); 
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("AKT_KGRO") <> Неопределено Тогда
		СтрокаДислокации.КодГрузоотправителя = ДислокацияXDTO.AKT_KGRO;	
	КонецЕсли;
	Если ДислокацияXDTO.Свойства().Получить("AKT_KGRP") <> Неопределено Тогда
		СтрокаДислокации.КодГрузополучателя = ДислокацияXDTO.AKT_KGRP; 
	КонецЕсли;
//Евросиб Гудкова( 20.09.2020 Ticket№ 0206314 добавлена станция отправления в дислокации
	Если ДислокацияXDTO.Свойства().Получить("AKT_KSTN_OTPR") <> Неопределено Тогда
		//Евросиб Каблов 21.09.2020 (
		//МенеджерЗаписи.СтанцияОтправления = ЛокацияПоКодуСтанции(ДислокацияXDTO.AKT_KSTN_OTPR);
		КодСтанции = ДислокацияXDTO.AKT_KSTN_OTPR;
				
		// Евросиб Фролов (21.10.2021 Ticket№ 0243986
		//СтрокаДислокации.СтанцияОтправления = ЛокацияПоКодуСтанции(КодСтанции);
		КодДороги = Неопределено;
		Если ДислокацияXDTO.Свойства().Получить("AKT_KDOR_OTPR") <> Неопределено Тогда
			КодДороги = ДислокацияXDTO.AKT_KDOR_OTPR;
		КонецЕсли;
		СтрокаДислокации.СтанцияОтправления = ЛокацияПоКодуСтанции(КодСтанции, КодДороги);
		// Евросиб Фролов)
		
		Если Не ЗначениеЗаполнено(СтрокаДислокации.СтанцияОтправления) Тогда
			//Евросиб Коханенко Н.А. 28.12.2023 (( #79320
			//НеизвестнаяСтанция = Справочники.Локации.СоздатьЭлемент();
			//НеизвестнаяСтанция.Тип 				= Справочники.ТипыЛокаций.СтанцияЖД;
			//НеизвестнаяСтанция.КодЖДСтанции 		= КодСтанции;
			//НеизвестнаяСтанция.Наименование 		= "Неизвестная станция";
			//НеизвестнаяСтанция.Записать();                                 
			//СтрокаДислокации.СтанцияОтправления = НеизвестнаяСтанция.Ссылка;
			СтрокаДислокации.СтанцияОтправления = ПолучитьНеизвестнуюСтанциюПоУмолчанию(КодСтанции, МассивОшибок);
			//Евросиб Коханенко Н.А. 28.12.2023 )) #79320
		КонецЕсли;
		//Евросиб Каблов 21.09.2020 )
	КонецЕсли;
// Евросиб Гудкова) 	
	// siv 08/07/20 добавлю пробег
	СтрокаДислокации.ОстаточноеРасстояниеКМ = ПолучитьОстаточноеРасстояниеМеждуСтанциями(СтрокаДислокации.СтанцияОперации, СтрокаДислокации.СтанцияНазначения); 
	
	Если ДислокацияXDTO.Свойства().Получить("OWN") <> Неопределено Тогда
		//ДИТ Шевченко А.В. 54982 09.08.2022 -Начало
		СданВАренду = Ложь;	
		Если ДислокацияXDTO.Свойства().Получить("IS_RENT") <> Неопределено Тогда
			СданВАренду = XMLЗначение(Тип("Булево"),ДислокацияXDTO.IS_RENT);
		КонецЕсли;
		//ДИТ Шевченко А.В. 54982 09.08.2022 -Конец
		ЗаписатьПризнакСобственностиВагона(Вагон, ДислокацияXDTO.OWN, XMLЗначение(Тип("Дата"),ДислокацияXDTO.OWN_DATE_START),СданВАренду);	
	КонецЕсли; 
	
КонецПроцедуры 

//Евросиб Коханенко Н.А. 28.12.2023 (( #79320 
Функция ПолучитьНеизвестнуюСтанциюПоУмолчанию(КодЖДСтанции, МассивОшибок)
	
	МассивОшибок.Добавить("В справочнике DataCore ""Локации"" не найдена станция с кодом " + КодЖДСтанции + ". Необходимо добавить станцию вручную.");
    Возврат ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Локации.НеизвестнаяСтанция");
	
КонецФункции

Процедура ОтправлениеЭлектронногоСообщенияОбОшибкахЗагрузкиЛокаций(МассивОшибок);

	ТекстОбОшибках = "";
	Для Каждого СтрокаОшибки Из МассивОшибок Цикл
		//Евросиб Коханенко Н.А. 03.07.2024 (( #87690
		Если СтрНайти(СтрокаОшибки, "не найдена станция с кодом") > 0 Тогда
			ТекстОбОшибках = ТекстОбОшибках + СтрокаОшибки + "<BR>";
		КонецЕсли;
		//Евросиб Коханенко Н.А. 03.07.2024 )) #87690 
	КонецЦикла;
	//Евросиб Коханенко Н.А. 03.07.2024 (( #87690
	Если ТекстОбОшибках = "" Тогда
		Возврат;
	КонецЕсли;
	//Евросиб Коханенко Н.А. 03.07.2024 )) #87690 
	ТекстСообщения = СтрШаблон("<HTML><BODY>%1</BODY></HTML>", ТекстОбОшибках);
	Получатели = НайтиПолучателейВПравилахОповещения(Перечисления.УзлыОбмена.РИТМ);
	ОтправитьСообщениеВФорматеHTML(Получатели, "Ошибки при загрузке Локаций из РИТМа в DC", ТекстСообщения);
	
КонецПроцедуры
//Евросиб Коханенко Н.А. 28.12.2023 )) #79320 

Процедура ЗаписатьПаспортаВагонов(ОбъектXDTO, МассивОшибок, ЭтоТест)
	
	Если ОбъектXDTO.Свойства().Получить("carNum") <> Неопределено Тогда 
		Вагон = Справочники.ТС.НайтиПоНаименованию(ОбъектXDTO.carNum, Истина); 	
		Если Вагон.Пустая() Тогда
			Если ЭтоТест Тогда
				ВагонОбъект = Справочники.ТС.СоздатьЭлемент();
				ВагонОбъект.Наименование = ОбъектXDTO.carNum;
				ВагонОбъект.Записать();
				Вагон = ВагонОбъект.Ссылка;
			Иначе
				МассивОшибок.Добавить("В справочнике ТС не найден вагон с номером " + ОбъектXDTO.carNum);
				Возврат;
			КонецЕсли;
		КонецЕсли;
	Иначе
		МассивОшибок.Добавить("В одном из паспортов не заполнено обязательное поле carNum");
		Возврат;
	КонецЕсли;
	
	//Евросиб Каблов 29.04.2020 (
	//КоличествоВидовРемонтов = Перечисления.ВидыРемонтов.Количество();
	//Евросиб Каблов 29.04.2020 )
	
	//Если МассивОшибок.Количество() > 0 Тогда
	//	Возврат;
	//КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ПаспортаВагонов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = НачалоДня(ТекущаяДата());
	МенеджерЗаписи.Вагон = Вагон;
	
	Если ОбъектXDTO.Свойства().Получить("qualityCode") <> Неопределено Тогда
		МенеджерЗаписи.ПризнакКачества = ОбъектXDTO.qualityCode;
	КонецЕсли;
	
	Если ОбъектXDTO.Свойства().Получить("currentStateCode") <> Неопределено Тогда
		МенеджерЗаписи.КодСостоянияВагона = ОбъектXDTO.currentStateCode;
		//Евросиб Каблов 29.04.2020 (
		МенеджерЗаписи.СостояниеВагона = Справочники.СостоянияВагонов.НайтиПоКоду(ОбъектXDTO.currentStateCode);
		Если Не ЗначениеЗаполнено(МенеджерЗаписи.СостояниеВагона) Тогда
			НовыйЭлемент = Справочники.СостоянияВагонов.СоздатьЭлемент();
			НовыйЭлемент.Код = ОбъектXDTO.currentStateCode;
			НовыйЭлемент.Наименование = НовыйЭлемент.Код;
			НовыйЭлемент.Записать();
			МенеджерЗаписи.СостояниеВагона = НовыйЭлемент.Ссылка;
		КонецЕсли;
		//Евросиб Каблов 29.04.2020 )
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("curStateDate") <> Неопределено Тогда
		МенеджерЗаписи.ДатаНазначенияСостояния = XMLЗначение(Тип("Дата"), ОбъектXDTO.curStateDate);
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("curStateReason") <> Неопределено Тогда
		МенеджерЗаписи.ПричинаНазначенияСостояния = ОбъектXDTO.curStateReason;
		//Евросиб Каблов 29.04.2020 (
		Если Не ЗначениеЗаполнено(МенеджерЗаписи.ПричинаНазначенияСостоянияСсылка) И ЗначениеЗаполнено(МенеджерЗаписи.ПричинаНазначенияСостояния) И МенеджерЗаписи.ПричинаНазначенияСостояния <> "0" Тогда
			КодВидаРемонта = Число(МенеджерЗаписи.ПричинаНазначенияСостояния);
			//Евросиб Каблов 06.07.2020 ( Для паспортов код 3 - ОкончаниеСрокаСлужбы
			//Если КодВидаРемонта <= КоличествоВидовРемонтов Тогда
			//	МенеджерЗаписи.ПричинаНазначенияСостоянияСсылка = Перечисления.ВидыРемонтов.Получить(КодВидаРемонта - 1);
			//КонецЕсли;
			Если КодВидаРемонта = 3 Тогда
				МенеджерЗаписи.ПричинаНазначенияСостоянияСсылка = Перечисления.ВидыРемонтов.ОкончаниеСрокаСлужбы;
			Иначе
				МенеджерЗаписи.ПричинаНазначенияСостоянияСсылка = Перечисления.ВидыРемонтов.Получить(КодВидаРемонта - 1);			
			КонецЕсли;
			//Евросиб Каблов 06.07.2020 )
		КонецЕсли;		
		//Евросиб Каблов 29.04.2020 )
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("curStateStation") <> Неопределено Тогда
		МенеджерЗаписи.СтанцияНазначенияСостояния = ЛокацияПоКодуСтанции(ОбъектXDTO.curStateStation);
		Если Не ЗначениеЗаполнено(МенеджерЗаписи.СтанцияНазначенияСостояния) Тогда
			МенеджерЗаписи.Ошибки = МенеджерЗаписи.Ошибки + " Станция назначения состояния: " + ОбъектXDTO.curStateStation; 
		КонецЕсли; 
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("registryDate") <> Неопределено Тогда
		МенеджерЗаписи.ДатаРегистрации = XMLЗначение(Тип("Дата"), ОбъектXDTO.registryDate);
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("productionDate") <> Неопределено Тогда
		МенеджерЗаписи.ДатаПостройки = XMLЗначение(Тип("Дата"), ОбъектXDTO.productionDate);
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("nextRepairType") <> Неопределено Тогда
		МенеджерЗаписи.ВидСледующегоПлановогоРемонта = ОбъектXDTO.nextRepairType;
		//Евросиб Каблов 29.04.2020 (
		Если Не ЗначениеЗаполнено(МенеджерЗаписи.ВидСледующегоПлановогоРемонтаСсылка) И ЗначениеЗаполнено(МенеджерЗаписи.ВидСледующегоПлановогоРемонта) И МенеджерЗаписи.ВидСледующегоПлановогоРемонта <> "0" Тогда
			КодВидаРемонта = Число(МенеджерЗаписи.ВидСледующегоПлановогоРемонта);
			//Евросиб Каблов 06.07.2020 ( Для паспортов код 3 - ОкончаниеСрокаСлужбы
			//Если КодВидаРемонта <= КоличествоВидовРемонтов Тогда
			//	МенеджерЗаписи.ВидСледующегоПлановогоРемонтаСсылка = Перечисления.ВидыРемонтов.Получить(КодВидаРемонта - 1);
			//КонецЕсли;
			Если КодВидаРемонта = 3 Тогда
				МенеджерЗаписи.ВидСледующегоПлановогоРемонтаСсылка = Перечисления.ВидыРемонтов.ОкончаниеСрокаСлужбы;
			Иначе
				МенеджерЗаписи.ВидСледующегоПлановогоРемонтаСсылка = Перечисления.ВидыРемонтов.Получить(КодВидаРемонта - 1);
			КонецЕсли;
			//Евросиб Каблов 06.07.2020 )
		КонецЕсли;		
		//Евросиб Каблов 29.04.2020 )
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("nextRepairDate") <> Неопределено Тогда
		МенеджерЗаписи.ДатаСледующегоПлановогоРемонта = XMLЗначение(Тип("Дата"), ОбъектXDTO.nextRepairDate);
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("factoryNumber") <> Неопределено Тогда
		МенеджерЗаписи.ЗаводскойНомер = ОбъектXDTO.factoryNumber;
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("factoryCode") <> Неопределено Тогда
		МенеджерЗаписи.ЗаводИзготовитель = ОбъектXDTO.factoryCode;
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("carType") <> Неопределено Тогда
		МенеджерЗаписи.ТипВагона = ОбъектXDTO.carType;
		//Евросиб Каблов 29.04.2020 (
		МенеджерЗаписи.ТипВагонаСсылка = Справочники.ТипыВагонов.НайтиПоКоду(ОбъектXDTO.carType);
		Если Не ЗначениеЗаполнено(МенеджерЗаписи.ТипВагонаСсылка) Тогда
			НовыйЭлемент = Справочники.ТипыВагонов.СоздатьЭлемент();
			НовыйЭлемент.Код = ОбъектXDTO.carType;
			НовыйЭлемент.Наименование = НовыйЭлемент.Код;
			НовыйЭлемент.Записать();
			МенеджерЗаписи.ТипВагонаСсылка = НовыйЭлемент.Ссылка;
		КонецЕсли;
		//Евросиб Каблов 29.04.2020 )
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("carModel") <> Неопределено Тогда
		МенеджерЗаписи.МодельВагона = ОбъектXDTO.carModel;
	КонецЕсли;
	//Евросиб Каблов 09.02.2020 (
	Если ОбъектXDTO.Свойства().Получить("carModelName") <> Неопределено Тогда
		МенеджерЗаписи.НаименованиеМоделиВагона = ОбъектXDTO.carModelName;
	КонецЕсли;
	//Евросиб Каблов 09.02.2020 )
	Если ОбъектXDTO.Свойства().Получить("tareWeight") <> Неопределено Тогда
		МенеджерЗаписи.ТараВагона = ОбъектXDTO.tareWeight;
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("tonnage") <> Неопределено Тогда
		МенеджерЗаписи.Грузоподъемность = XMLЗначение(Тип("Число"), ОбъектXDTO.tonnage);
	КонецЕсли;	
	Если ОбъектXDTO.Свойства().Получить("axlesLength") <> Неопределено Тогда
		МенеджерЗаписи.ДлинаПоОсямАвтосцепки = XMLЗначение(Тип("Число"), ОбъектXDTO.axlesLength);
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("costBalance") <> Неопределено Тогда
		МенеджерЗаписи.БалансоваяСтоимость = XMLЗначение(Тип("Число"), ОбъектXDTO.costBalance);
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("lastCapRepDepo") <> Неопределено Тогда
		МенеджерЗаписи.ДепоПоследнегоКапРемонта = Справочники.Депо.НайтиПоКоду(ОбъектXDTO.lastCapRepDepo);
		Если Не ЗначениеЗаполнено(МенеджерЗаписи.ДепоПоследнегоКапРемонта) Тогда
			МенеджерЗаписи.Ошибки = МенеджерЗаписи.Ошибки + " Депо последнего капремонта: " + ОбъектXDTO.lastCapRepDepo; 
		КонецЕсли; 
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("lastCapRepDate") <> Неопределено Тогда
		МенеджерЗаписи.ДатаПоследнегоКапРемонта = XMLЗначение(Тип("Дата"), ОбъектXDTO.lastCapRepDate);
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("lastDepotRepDepo") <> Неопределено Тогда
		МенеджерЗаписи.ДепоПоследнегоДеповскогоРемонта = Справочники.Депо.НайтиПоКоду(ОбъектXDTO.lastDepotRepDepo);
		Если Не ЗначениеЗаполнено(МенеджерЗаписи.ДепоПоследнегоДеповскогоРемонта) Тогда
			МенеджерЗаписи.Ошибки = МенеджерЗаписи.Ошибки + " Депо последнего деповского ремонта: " + ОбъектXDTO.lastDepotRepDepo; 
		КонецЕсли; 
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("lastDepotRepDate") <> Неопределено Тогда
		МенеджерЗаписи.ДатаПоследнегоДеповскогоРемонта = XMLЗначение(Тип("Дата"), ОбъектXDTO.lastDepotRepDate);
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("regRailway") <> Неопределено Тогда
		МенеджерЗаписи.ДорогаПриписки = Справочники.ЖелезныеДороги.НайтиПоКоду(ОбъектXDTO.regRailway);
		Если Не ЗначениеЗаполнено(МенеджерЗаписи.ДорогаПриписки) Тогда
			МенеджерЗаписи.Ошибки = МенеджерЗаписи.Ошибки + " Дорога приписки: " + ОбъектXDTO.regRailway; 
		КонецЕсли; 
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("regDepo") <> Неопределено Тогда
		МенеджерЗаписи.ДепоПриписки = Справочники.Депо.НайтиПоКоду(ОбъектXDTO.regDepo);
		Если Не ЗначениеЗаполнено(МенеджерЗаписи.ДепоПриписки) Тогда
			МенеджерЗаписи.Ошибки = МенеджерЗаписи.Ошибки + " Депо приписки: " + ОбъектXDTO.regDepo; 
		КонецЕсли; 
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("exclusionDate") <> Неопределено Тогда
		МенеджерЗаписи.ДатаИсключения = XMLЗначение(Тип("Дата"), ОбъектXDTO.exclusionDate);
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("prohibitionReason") <> Неопределено Тогда
		МенеджерЗаписи.ПричинаЗапретаНаКурсирование = ОбъектXDTO.prohibitionReason;
		//Евросиб Каблов 29.04.2020 (
		МенеджерЗаписи.ПричинаЗапретаНаКурсированиеСсылка = Справочники.ПричиныНеисправностейТС.НайтиПоКоду(ОбъектXDTO.prohibitionReason);
		Если Не ЗначениеЗаполнено(МенеджерЗаписи.ПричинаЗапретаНаКурсированиеСсылка) Тогда
			НовыйЭлемент = Справочники.ПричиныНеисправностейТС.СоздатьЭлемент();
			НовыйЭлемент.Код = ОбъектXDTO.prohibitionReason;
			НовыйЭлемент.Наименование = НовыйЭлемент.Код;
			НовыйЭлемент.Записать();
			МенеджерЗаписи.ПричинаЗапретаНаКурсированиеСсылка = НовыйЭлемент.Ссылка;
		КонецЕсли;
		//Евросиб Каблов 29.04.2020 )
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("residualValue") <> Неопределено Тогда
		МенеджерЗаписи.ОстаточнаяСтоимостьВагона = XMLЗначение(Тип("Число"), ОбъектXDTO.residualValue);
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("oldNumber") <> Неопределено Тогда
		МенеджерЗаписи.ПрежнийНомерВагона = ОбъектXDTO.oldNumber;
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("RZDOwnerCode") <> Неопределено Тогда
		МенеджерЗаписи.КодРЖДСобственника = ОбъектXDTO.RZDOwnerCode;
		//Евросиб Каблов 24.02.2020 (
		МенеджерЗаписи.Собственник = Справочники.э_СобственникиАрендаторыВагонов.НайтиПоКоду(МенеджерЗаписи.КодРЖДСобственника);
		//Евросиб Каблов 24.02.2020 )
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("regStation") <> Неопределено Тогда
		МенеджерЗаписи.СтанцияПриписки = ЛокацияПоКодуСтанции(ОбъектXDTO.regStation);
		Если Не ЗначениеЗаполнено(МенеджерЗаписи.СтанцияПриписки) Тогда
			МенеджерЗаписи.Ошибки = МенеджерЗаписи.Ошибки + " Станция приписки: " + ОбъектXDTO.regStation; 
		КонецЕсли; 
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("isOnThreshold") <> Неопределено Тогда
		МенеджерЗаписи.ПорогВагона = ОбъектXDTO.isOnThreshold;	
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("isLeased") <> Неопределено Тогда
		МенеджерЗаписи.ВАренде = XMLЗначение(Тип("Булево"), ОбъектXDTO.isLeased);	
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("RZDLeaseholderCode") <> Неопределено Тогда
		МенеджерЗаписи.КодРЖДАрендатора = ОбъектXDTO.RZDLeaseholderCode;
		//Евросиб Каблов 24.02.2020 (
		МенеджерЗаписи.Арендатор = Справочники.э_СобственникиАрендаторыВагонов.НайтиПоКоду(МенеджерЗаписи.КодРЖДАрендатора);
		//Евросиб Каблов 24.02.2020 )
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("leaseRegStation") <> Неопределено Тогда
		МенеджерЗаписи.СтанцияПрипискиАренды = ЛокацияПоКодуСтанции(ОбъектXDTO.leaseRegStation);
		Если Не ЗначениеЗаполнено(МенеджерЗаписи.СтанцияПрипискиАренды) Тогда
			МенеджерЗаписи.Ошибки = МенеджерЗаписи.Ошибки + " Станция приписки аренды: " + ОбъектXDTO.leaseRegStation; 
		КонецЕсли; 
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("leaseEndDate") <> Неопределено Тогда
		МенеджерЗаписи.ДатаОкончанияАренды = XMLЗначение(Тип("Дата"), ОбъектXDTO.leaseEndDate);
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("expirationDate") <> Неопределено Тогда
		МенеджерЗаписи.СрокСлужбыВагона = XMLЗначение(Тип("Дата"), ОбъектXDTO.expirationDate);
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("modelCode") <> Неопределено Тогда
		МенеджерЗаписи.КодМоделиВагона = ОбъектXDTO.modelCode;	
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("size") <> Неопределено Тогда
		МенеджерЗаписи.Габарит = ОбъектXDTO.size;	
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("armTransmission") <> Неопределено Тогда
		МенеджерЗаписи.РычажнаяПередача = ОбъектXDTO.armTransmission;	
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("airDistributor") <> Неопределено Тогда
		МенеджерЗаписи.ТипВоздухораспределителя = ОбъектXDTO.airDistributor;	
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("automode") <> Неопределено Тогда
		МенеджерЗаписи.Авторежим = ОбъектXDTO.automode;	
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("manualGearAutoRegulator") <> Неопределено Тогда
		МенеджерЗаписи.АвторегуляторРучнойПередачи = ОбъектXDTO.manualGearAutoRegulator;	
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("brakeType") <> Неопределено Тогда
		МенеджерЗаписи.ТипТормоза = ОбъектXDTO.brakeType;
		//Евросиб Каблов 29.04.2020 (
		МенеджерЗаписи.ТипТормозаСсылка = Справочники.ТипыТормозов.НайтиПоКоду(ОбъектXDTO.brakeType);
		Если Не ЗначениеЗаполнено(МенеджерЗаписи.ТипТормозаСсылка) Тогда
			НовыйЭлемент = Справочники.ТипыТормозов.СоздатьЭлемент();
			НовыйЭлемент.Код = ОбъектXDTO.brakeType;
			НовыйЭлемент.Наименование = НовыйЭлемент.Код;
			НовыйЭлемент.Записать();
			МенеджерЗаписи.ТипТормозаСсылка = НовыйЭлемент.Ссылка;
		КонецЕсли;
		//Евросиб Каблов 29.04.2020 )
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("autocouplingType") <> Неопределено Тогда
		МенеджерЗаписи.ТипАвтосцепки = ОбъектXDTO.autocouplingType;
		//Евросиб Каблов 29.04.2020 (
		МенеджерЗаписи.ТипАвтосцепкиСсылка = Справочники.ТипыАвтосцепок.НайтиПоКоду(ОбъектXDTO.autocouplingType);
		Если Не ЗначениеЗаполнено(МенеджерЗаписи.ТипАвтосцепкиСсылка) Тогда
			НовыйЭлемент = Справочники.ТипыАвтосцепок.СоздатьЭлемент();
			НовыйЭлемент.Код = ОбъектXDTO.autocouplingType;
			НовыйЭлемент.Наименование = НовыйЭлемент.Код;
			НовыйЭлемент.Записать();
			МенеджерЗаписи.ТипАвтосцепкиСсылка = НовыйЭлемент.Ссылка;
		КонецЕсли;
		//Евросиб Каблов 29.04.2020 )
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("bogieType") <> Неопределено Тогда
		МенеджерЗаписи.МодельТележек = ОбъектXDTO.bogieType;	
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("absorptionUnitType") <> Неопределено Тогда
		МенеджерЗаписи.ТипПоглощающегоАппарата = ОбъектXDTO.absorptionUnitType;	
		//Евросиб Каблов 29.04.2020 (
		МенеджерЗаписи.ТипПоглощающегоАппаратаСсылка = Справочники.ТипыПоглощающихАппаратов.НайтиПоКоду(ОбъектXDTO.absorptionUnitType);
		Если Не ЗначениеЗаполнено(МенеджерЗаписи.ТипПоглощающегоАппаратаСсылка) Тогда
			НовыйЭлемент = Справочники.ТипыПоглощающихАппаратов.СоздатьЭлемент();
			НовыйЭлемент.Код = ОбъектXDTO.absorptionUnitType;
			НовыйЭлемент.Наименование = НовыйЭлемент.Код;
			НовыйЭлемент.Записать();
			МенеджерЗаписи.ТипПоглощающегоАппаратаСсылка = НовыйЭлемент.Ссылка;
		КонецЕсли;
		//Евросиб Каблов 29.04.2020 )
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("runRepairSign") <> Неопределено Тогда
		МенеджерЗаписи.РемонтПоПробегу = XMLЗначение(Тип("Булево"), ОбъектXDTO.runRepairSign);	
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("lifeTimeContinuationSign") <> Неопределено Тогда
		МенеджерЗаписи.СрокСлужбыВагонаПродлен = XMLЗначение(Тип("Булево"), ОбъектXDTO.lifeTimeContinuationSign);	
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("cauldronGauge") <> Неопределено Тогда
		МенеджерЗаписи.КалибрКотла = ОбъектXDTO.cauldronGauge; 
	КонецЕсли;
	
	//ДИТ Шевченко А.В. US 69900 ТА 73673 15.08.2023 -начало
	Если ОбъектXDTO.Свойства().Получить("carTypeIRS") <> Неопределено Тогда
		МенеджерЗаписи.ТипПС = ОбъектXDTO.carTypeIRS; 
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("parkName") <> Неопределено Тогда
		МенеджерЗаписи.НаименованиеПаркаВагонов = ОбъектXDTO.parkName; 
	КонецЕсли;
	//ДИТ Шевченко А.В. US 69900 ТА 73673 15.08.2023 -конец
	
//Евросиб Каблов 09.02.2020 (
	ДлинаПоОсямАвтосцепки = МенеджерЗаписи.ДлинаПоОсямАвтосцепки;
//Евросиб Каблов 09.11.2019 )

//Евросиб Каблов 15.11.2019 ( Записывать, если есть изменения в паспорте
	//Попытка
	//	МенеджерЗаписи.Записать();
	//Исключение
	//	МассивОшибок.Добавить(ОписаниеОшибки());
	//КонецПопытки;	
	ПоследняяЗапись = РегистрыСведений.ПаспортаВагонов.ПолучитьПоследнее(МенеджерЗаписи.Период, Новый Структура("Вагон", Вагон));
	ЕстьИзменения = Ложь;
	
	Для Каждого ПолеЗаписи Из ПоследняяЗапись Цикл
		Если ПолеЗаписи.Значение <> МенеджерЗаписи[ПолеЗаписи.Ключ] Тогда
			ЕстьИзменения = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьИзменения Тогда
		Попытка
			МенеджерЗаписи.Записать();
		Исключение
			МассивОшибок.Добавить(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
//Евросиб Каблов 15.11.2019 )

//Евросиб Каблов 09.02.2020 (
	// Иван 18.авг.19
	//Если НЕ ЗначениеЗаполнено(Вагон.ТипТС) И ЗначениеЗаполнено(МенеджерЗаписи.МодельВагона) Тогда
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТС.ТипТС КАК ТипТС,
	|	ТС.ТипТС.Длина КАК ТипТСДлина,
	|	ТС.ТипТС.УсловнаяДлина КАК ТипТСУсловнаяДлина
	|ИЗ
	|	Справочник.ТС КАК ТС
	|ГДЕ
	|	ТС.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Вагон);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДанныеПоВагону = Новый Структура("ТипТС, ТипТСДлина, ТипТСУсловнаяДлина");
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеПоВагону, Выборка);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеПоВагону.ТипТС) И ЗначениеЗаполнено(МенеджерЗаписи.МодельВагона) Тогда
//Евросиб Каблов 09.02.2020 )
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	ТипоразмерыТСОбозначенияМоделиВагона.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ТипоразмерыТС.ОбозначенияМоделиВагона КАК ТипоразмерыТСОбозначенияМоделиВагона
		               |ГДЕ
		               |	ТипоразмерыТСОбозначенияМоделиВагона.Обозначение = &Обозначение
		               |	И НЕ ТипоразмерыТСОбозначенияМоделиВагона.Ссылка.ПометкаУдаления";
		Запрос.УстановитьПараметр("Обозначение", МенеджерЗаписи.МодельВагона);
		Ответ = Запрос.Выполнить().Выбрать();
		Если Ответ.Следующий() Тогда
			ВО = Вагон.ПолучитьОбъект();
			ВО.ТипТС = Ответ.Ссылка;
			ВО.Записать();
		Иначе
			НовыйТипТС = Справочники.ТипоразмерыТС.СоздатьЭлемент();
			НовыйТипТС.Код = МенеджерЗаписи.МодельВагона;
			НовыйТипТС.Наименование = "НОВЫЙ ТИП!! " + МенеджерЗаписи.МодельВагона;
			НовыйТипТС.Вагон = Истина;
			//Евросиб Каблов 09.02.2020 (
	        НовыйТипТС.Длина = ДлинаПоОсямАвтосцепки;
			НовыйТипТС.УсловнаяДлина = ДлинаПоОсямАвтосцепки / 13920;
			//Евросиб Каблов 09.11.2019 )
			НовыйТипТС.Записать();
			
			ВО = Вагон.ПолучитьОбъект();
			ВО.ТипТС = НовыйТипТС.Ссылка;
			ВО.Записать();
		КонецЕсли;
	//Евросиб Каблов 09.02.2020 (
	ИначеЕсли ЗначениеЗаполнено(ДанныеПоВагону.ТипТС) Тогда
		
		Если Не ЗначениеЗаполнено(ДанныеПоВагону.ТипТСДлина) Или Не ЗначениеЗаполнено(ДанныеПоВагону.ТипТСУсловнаяДлина) Тогда
			ТипТСОбъект = ДанныеПоВагону.ТипТС.ПолучитьОбъект();
			ТипТСОбъект.Длина = ДлинаПоОсямАвтосцепки;
			ТипТСОбъект.УсловнаяДлина = ДлинаПоОсямАвтосцепки / 13920;
			ТипТСОбъект.Записать();
		КонецЕсли;
	//Евросиб Каблов 09.02.2020 )
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьРемонты(ОбъектXDTO, МассивОшибок, ЭтоТест)
	
	ЕстьОшибка = Ложь; // Евросиб Фролов, 24.02.2022
	
	СписокОбязательныхПолей = Новый СписокЗначений;
	СписокОбязательныхПолей.Добавить("carNum");
	СписокОбязательныхПолей.Добавить("rpDoc23_No");
	СписокОбязательныхПолей.Добавить("rpDT_put");
	Для каждого ЗначениеРеквизита Из СписокОбязательныхПолей Цикл
		Если ОбъектXDTO.Свойства().Получить(ЗначениеРеквизита.Значение) = Неопределено Тогда
			МассивОшибок.Добавить("В одной из ВУ не заполнено обязательное поле " + ЗначениеРеквизита.Значение);
			ЕстьОшибка = Истина; // Евросиб Фролов, 24.02.2022
		КонецЕсли;
	КонецЦикла; 
	Если ОбъектXDTO.Свойства().Получить("carNum") <> Неопределено Тогда 
		Вагон = Справочники.ТС.НайтиПоНаименованию(ОбъектXDTO.carNum, Истина); 	
		Если Вагон.Пустая() Тогда
			Если ЭтоТест Тогда
				ВагонОбъект = Справочники.ТС.СоздатьЭлемент();
				ВагонОбъект.Наименование = ОбъектXDTO.carNum;
				ВагонОбъект.Записать();
				Вагон = ВагонОбъект.Ссылка;
			Иначе
				МассивОшибок.Добавить("В справочнике ТС не найден вагон с номером " + ОбъектXDTO.carNum);
				ЕстьОшибка = Истина; // Евросиб Фролов, 24.02.2022
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	// Евросиб Фролов, 24.02.2022 (Яна просила исправить ошибку)
	// Если при загрузке появилась ошибка, то нужно прервать выполнение процедуры.
	// Файл при этом перемещается в каталог ошибочных. Возврат был закомментирован и
	// из-за этого при выполнении процедуры появлялась ошибка в момент установки параметров
	// запроса "ОбъектXDTO.rpDoc23_No". Раскомментировал.
	//Если МассивОшибок.Количество() > 0 Тогда
	Если ЕстьОшибка Тогда // Евросиб Фролов, 24.02.2022
		Возврат;
	КонецЕсли;
	ДатаПереводаВНерабочийПарк = XMLЗначение(Тип("Дата"), ОбъектXDTO.rpDT_put);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	РемонтныеВедомости.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.РемонтныеВедомости КАК РемонтныеВедомости
	               |ГДЕ
	               |	РемонтныеВедомости.НомерВУ23 = &НомерВУ23
	               |	И РемонтныеВедомости.ДатаПереводаВНерабочийПарк = &ДатаПереводаВНерабочийПарк
	               |	И РемонтныеВедомости.Вагон = &Вагон";
	Запрос.УстановитьПараметр("НомерВУ23", ОбъектXDTO.rpDoc23_No);
	Запрос.УстановитьПараметр("ДатаПереводаВНерабочийПарк", ДатаПереводаВНерабочийПарк);
	Запрос.УстановитьПараметр("Вагон", Вагон);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		РемонтнаяВедомость = Результат.Ссылка.ПолучитьОбъект();
		РемонтнаяВедомость.Неисправности.Очистить();
		РемонтнаяВедомость.ПроведенныеРаботы.Очистить();
		РемонтнаяВедомость.Комментарий = "";
	Иначе
		РемонтнаяВедомость = Документы.РемонтныеВедомости.СоздатьДокумент();
		РемонтнаяВедомость.Заполнить(неопределено); // Иван 15.08.19
		РемонтнаяВедомость.РежимРемонтнойВедомости = Перечисления.РежимРемонтнойВедомости.ЗагруженаАвтоматически; // Иван 15.08.19
	КонецЕсли; 	
	
	РемонтнаяВедомость.НомерВУ23 = ОбъектXDTO.rpDoc23_No;
	РемонтнаяВедомость.ДатаПереводаВНерабочийПарк = ДатаПереводаВНерабочийПарк;
	РемонтнаяВедомость.Вагон = Вагон;
	
	Если ОбъектXDTO.Свойства().Получить("rpRepType") <> Неопределено Тогда
		РемонтнаяВедомость.ВидРемонта = Перечисления.ВидыРемонтов.Получить(Число(ОбъектXDTO.rpRepType) - 1);
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("stCode") <> Неопределено Тогда
		РемонтнаяВедомость.СтанцияОтцепки = ЛокацияПоКодуСтанции(ОбъектXDTO.stCode);
		Если Не ЗначениеЗаполнено(РемонтнаяВедомость.СтанцияОтцепки) Тогда
			РемонтнаяВедомость.Комментарий = "Код станции отцепки: " + ОбъектXDTO.stCode;
		КонецЕсли; 
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("rwCode") <> Неопределено Тогда
		РемонтнаяВедомость.ДорогаПереводаВНерабочийПарк = Справочники.ЖелезныеДороги.НайтиПоКоду(ОбъектXDTO.rwCode);
		Если Не ЗначениеЗаполнено(РемонтнаяВедомость.ДорогаПереводаВНерабочийПарк) Тогда
			РемонтнаяВедомость.Комментарий = РемонтнаяВедомость.Комментарий + " Код дороги: " + ОбъектXDTO.rwCode;
		КонецЕсли; 
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("shCode") <> Неопределено Тогда
		РемонтнаяВедомость.ДепоРемонта = Справочники.Депо.НайтиПоКоду(ОбъектXDTO.shCode);
		Если Не ЗначениеЗаполнено(РемонтнаяВедомость.ДепоРемонта) Тогда
			РемонтнаяВедомость.Комментарий = РемонтнаяВедомость.Комментарий + " Депо ремонта: " + ОбъектXDTO.shCode;
		КонецЕсли; 
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("flCode1") <> Неопределено Тогда
		НоваяСтрока = РемонтнаяВедомость.Неисправности.Добавить();
		НоваяСтрока.ПричинаНеисправности = Справочники.ПричиныНеисправностейТС.НайтиПоКоду(ОбъектXDTO.flCode1);
		НоваяСтрока.КодПричиныНеисправности = ОбъектXDTO.flCode1;
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("flCode2") <> Неопределено Тогда
		НоваяСтрока = РемонтнаяВедомость.Неисправности.Добавить();
		НоваяСтрока.ПричинаНеисправности = Справочники.ПричиныНеисправностейТС.НайтиПоКоду(ОбъектXDTO.flCode2);
		НоваяСтрока.КодПричиныНеисправности = ОбъектXDTO.flCode2;
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("flCode3") <> Неопределено Тогда
		НоваяСтрока = РемонтнаяВедомость.Неисправности.Добавить();
		НоваяСтрока.ПричинаНеисправности = Справочники.ПричиныНеисправностейТС.НайтиПоКоду(ОбъектXDTO.flCode3);
		НоваяСтрока.КодПричиныНеисправности = ОбъектXDTO.flCode3;
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("productionDate") <> Неопределено Тогда
		РемонтнаяВедомость.ДатаПостройки = XMLЗначение(Тип("Дата"), ОбъектXDTO.productionDate);
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("depoDep") <> Неопределено Тогда
		РемонтнаяВедомость.ДепоДеповскогоРемонта = Справочники.Депо.НайтиПоКоду(ОбъектXDTO.depoDep);
		Если Не ЗначениеЗаполнено(РемонтнаяВедомость.ДепоДеповскогоРемонта) Тогда
			РемонтнаяВедомость.Комментарий = РемонтнаяВедомость.Комментарий + " Депо деповского ремонта: " + ОбъектXDTO.depoDep;
		КонецЕсли; 
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("lastDepotRepairDate") <> Неопределено Тогда
		РемонтнаяВедомость.ДатаДеповскогоРемонта = XMLЗначение(Тип("Дата"), ОбъектXDTO.lastDepotRepairDate);
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("depoCap") <> Неопределено Тогда
		РемонтнаяВедомость.ДепоКапитальногоРемонта = Справочники.Депо.НайтиПоКоду(ОбъектXDTO.depoCap);
		Если Не ЗначениеЗаполнено(РемонтнаяВедомость.ДепоКапитальногоРемонта) Тогда
			РемонтнаяВедомость.Комментарий = РемонтнаяВедомость.Комментарий + " Депо кап. ремонта: " + ОбъектXDTO.depoCap;
		КонецЕсли; 
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("lastCapitalRepairDate") <> Неопределено Тогда
		РемонтнаяВедомость.ДатаКапитальногоРемонта = XMLЗначение(Тип("Дата"), ОбъектXDTO.lastCapitalRepairDate);
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("rpDoc36_No") <> Неопределено Тогда
		РемонтнаяВедомость.НомерВУ36 = ОбъектXDTO.rpDoc36_No;
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("rpDT_Start") <> Неопределено Тогда
		РемонтнаяВедомость.ДатаНачалаРемонта = XMLЗначение(Тип("Дата"), ОбъектXDTO.rpDT_Start);
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("rpDT_End") <> Неопределено Тогда
		РемонтнаяВедомость.ДатаОкончанияРемонта = XMLЗначение(Тип("Дата"), ОбъектXDTO.rpDT_End);
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("moderRem") <> Неопределено Тогда
		МассивРабот = новый Массив;
		Строкаработ = СокрЛП(ОбъектXDTO.moderRem);
		Пока ЗначениеЗаполнено(Строкаработ) Цикл
			Если Лев(Строкаработ, 4) <> "0000" Тогда
				МассивРабот.Добавить(Лев(Строкаработ, 4));
			КонецЕсли; 
			Строкаработ = Сред(Строкаработ, 5);
		КонецЦикла;
		МассивРаботБезПовторов = Новый Массив;
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивРаботБезПовторов, МассивРабот, Истина);
		Для каждого Работа Из МассивРаботБезПовторов Цикл
			НоваяСтрокаРабот = РемонтнаяВедомость.ПроведенныеРаботы.Добавить();
			НоваяСтрокаРабот.КодРаботы = Работа;
			НоваяСтрокаРабот.Работа = Справочники.ПроведенныеРемонтныеРаботы.НайтиПоКоду(Работа);
		КонецЦикла; 
	КонецЕсли;
	Если ОбъектXDTO.Свойства().Получить("psCarTState") <> Неопределено Тогда
		РемонтнаяВедомость.ВРемонте = ?(ОбъектXDTO.psCarTState = "R", Истина, Ложь);
	КонецЕсли;
	РемонтнаяВедомость.Дата = ДатаПереводаВНерабочийПарк;
	Попытка
		РемонтнаяВедомость.Записать();
	Исключение
		МассивОшибок.Добавить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

// Евросиб Фролов (21.10.2021 Ticket№ 0243986
// Для вагонной дислокации локация теперь ищется не только по коду станции, но и по коду дороги.
//Функция ЛокацияПоКодуСтанции(КодЖДСтанции)
Функция ЛокацияПоКодуСтанции(КодЖДСтанции, КодДороги = Неопределено)
// Евросиб Фролов)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Локации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Локации КАК Локации
	|ГДЕ
	|	Локации.КодЖДСтанции ПОДОБНО &КодЖДСтанции";
	
	// Евросиб Фролов (21.10.2021 Ticket№ 0243986
	// Если передан параметр "КодДороги", то поиск выполняется для вагонной дислокации.
	// Для вагонной дислокации к поиску по коду станции добавляется поиск по коду дороги.
	// Если локация с необходимым кодом станции и дороги не найдена,
	// то пытаемся искать просто по коду станции, т.к. возможно, что такая станция была создана
	// в системе, но код дороги указан неверно.
	Если КодДороги <> Неопределено Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Локации.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ втЛокации
		|ИЗ
		|	Справочник.Локации КАК Локации
		|ГДЕ
		|	Локации.КодЖДСтанции ПОДОБНО &КодЖДСтанции
		|	И Локации.ЖелезнаяДорога.Код ПОДОБНО &КодДороги
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Локации.Ссылка
		|ИЗ
		|	Справочник.Локации КАК Локации
		|ГДЕ
		|	Локации.КодЖДСтанции ПОДОБНО &КодЖДСтанции
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	втЛокации.Ссылка КАК Ссылка
		|ИЗ
		|	втЛокации КАК втЛокации
		|УПОРЯДОЧИТЬ ПО
		|	втЛокации.Ссылка.ЖелезнаяДорога.Код УБЫВ";
		
		Запрос.УстановитьПараметр("КодДороги", КодДороги + "%");
	КонецЕсли;	
	// Евросиб Фролов
	
	Запрос.УстановитьПараметр("КодЖДСтанции", ""+КодЖДСтанции+"%");	 // Иван. 25-09-19. Фоновое задание выдавало ошибку, я переписал этот кусок, перенес % из запроса в параметр
	Выборка = Запрос.Выполнить().Выбрать();	
	Если Выборка.Следующий() Тогда
		Локация = Выборка.Ссылка;
	Иначе
		Локация = Неопределено;
	КонецЕсли;
	
	Возврат Локация;
	
КонецФункции

Процедура ЗагрузитьСпискиНаСлеженииВагоновКонтейнеров(ЭтоТест = Ложь) Экспорт

	ЭтоТест = ЭтоТест или ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована;
	МассивФайлов = НайтиФайлы(Константы.КаталогДислокацииРФ.Получить() + "\Дислокации для загрузки в DC\" + "Список на слежении", "*.xml");
	СписокФайлов = Новый СписокЗначений;
	Для Каждого Файл Из МассивФайлов Цикл
		СписокФайлов.Добавить(Файл, Файл.ИмяБезРасширения);		
	КонецЦикла;
	СписокФайлов.СортироватьПоПредставлению();
	
	Для Каждого Файл Из СписокФайлов Цикл
		МассивОшибок = Новый Массив;
		Отказ = Ложь;
		
		Чтение = Новый ЧтениеXML;
		Чтение.ОткрытьФайл(Файл.Значение.ПолноеИмя);
		КорневойОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(Чтение);
		Чтение.Закрыть();
		
		Если Найти(Файл.Значение.Имя, "DataCore_TRACKITEM_WAG") > 0 Тогда
			
			ТаблицаВагонов = Новый ТаблицаЗначений;
			ТаблицаВагонов.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(10, ДопустимаяДлина.Переменная)));
	
			Если ТипЗнч(КорневойОбъектXDTO.ROW) = Тип("СписокXDTO") Тогда				
				Для Каждого Элемент Из КорневойОбъектXDTO.ROW Цикл
					Номер = Элемент.VAG_NUMBER;
					Если ЗначениеЗаполнено(Номер) Тогда
						Вагон = ТаблицаВагонов.Добавить();
						Вагон.Номер = Номер;
					КонецЕсли;
				КонецЦикла;				
			ИначеЕсли ТипЗнч(КорневойОбъектXDTO.ROW) = Тип("ОбъектXDTO") Тогда
				Элемент = КорневойОбъектXDTO;
				Номер = Элемент.VAG_NUMBER;
				Если ЗначениеЗаполнено(Номер) Тогда
					Вагон = ТаблицаВагонов.Добавить();
					Вагон.Номер = Номер;
				КонецЕсли;
			КонецЕсли;
			
			ЗагрузитьСписокВагоновНаСлежении(ТаблицаВагонов);
			
			Если НЕ ЭтоТест Тогда
				ПереместитьФайл(Файл.Значение.ПолноеИмя, Константы.КаталогДислокацииРФ.Получить() +"\Дислокации для загрузки в DC\Обработанные файлы\Успешно\" + Файл.Значение.Имя);
			КонецЕсли;
			
		ИначеЕсли Найти(Файл.Значение.Имя, "DataCore_TRACKITEM_CONT") > 0 Тогда
			
			ТаблицаКонтейнеров = Новый ТаблицаЗначений;
			ТаблицаКонтейнеров.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(6, ДопустимаяДлина.Переменная)));
			ТаблицаКонтейнеров.Колонки.Добавить("Префикс", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(6, ДопустимаяДлина.Переменная)));
			ТаблицаКонтейнеров.Колонки.Добавить("КонтрольноеЧисло", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(1, 0, ДопустимыйЗнак.Неотрицательный)));
			ТаблицаКонтейнеров.Колонки.Добавить("Тип", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(10, ДопустимаяДлина.Переменная)));
			
			Если ТипЗнч(КорневойОбъектXDTO.ROW) = Тип("СписокXDTO") Тогда				
				
				Для Каждого Элемент Из КорневойОбъектXDTO.ROW Цикл
					
					Номер = Элемент.CONT_NUMBER;					
					Если ЗначениеЗаполнено(Номер) Тогда
						
						Контейнер = ТаблицаКонтейнеров.Добавить();
						Контейнер.Номер = Номер;
						
						Если Элемент.Свойства().Получить("CONT_SER") <> Неопределено Тогда
							Контейнер.Префикс = Элемент.CONT_SER;
						КонецЕсли;
						
						Если Элемент.Свойства().Получить("CONT_NUMBER_KEY") <> Неопределено Тогда
							Контейнер.КонтрольноеЧисло = Элемент.CONT_NUMBER_KEY;
						КонецЕсли;
						
						Если Элемент.Свойства().Получить("CONT_TYPE") <> Неопределено Тогда
							Контейнер.Тип = Элемент.CONT_TYPE;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли ТипЗнч(КорневойОбъектXDTO.ROW) = Тип("ОбъектXDTO") Тогда
				
				Элемент = КорневойОбъектXDTO;
				Номер = Элемент.CONT_NUMBER;					
				Если ЗначениеЗаполнено(Номер) Тогда
					
					Контейнер = ТаблицаКонтейнеров.Добавить();
					Контейнер.Номер = Номер;
					
					Если Элемент.Свойства().Получить("CONT_SER") <> Неопределено Тогда
						Контейнер.Префикс = Элемент.CONT_SER;
					КонецЕсли;
					
					Если Элемент.Свойства().Получить("CONT_NUMBER_KEY") <> Неопределено Тогда
						Контейнер.КонтрольноеЧисло = Элемент.CONT_NUMBER_KEY;
					КонецЕсли;
					
					Если Элемент.Свойства().Получить("CONT_TYPE") <> Неопределено Тогда
						Контейнер.Тип = Элемент.CONT_TYPE;
					КонецЕсли;
					
				КонецЕсли;
					
			КонецЕсли;
			
			ЗагрузитьСписокКонтейнеровНаСлежении(ТаблицаКонтейнеров, ЭтоТест);
			
			Если НЕ ЭтоТест Тогда
				ПереместитьФайл(Файл.Значение.ПолноеИмя, Константы.КаталогДислокацииРФ.Получить() +"\Дислокации для загрузки в DC\Обработанные файлы\Успешно\" + Файл.Значение.Имя); 
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры // ЗагрузитьСписокНаСлежении()

Процедура ЗагрузитьСписокВагоновНаСлежении(ТаблицаВагонов)
	
	ДатаЗаписей = НачалоДня(ТекущаяДатаСеанса());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаВагонов", ТаблицаВагонов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаВагонов.Номер КАК Номер
	|ПОМЕСТИТЬ ВТНомераВагонов
	|ИЗ
	|	&ТаблицаВагонов КАК ТаблицаВагонов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНомераВагонов.Номер КАК Номер,
	|	ТС.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТВагоны
	|ИЗ
	|	ВТНомераВагонов КАК ВТНомераВагонов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТС КАК ТС
	|		ПО ВТНомераВагонов.Номер = ТС.Наименование
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПризнакСобственностиВагонаСрезПоследних.Вагон КАК Вагон,
	|	ПризнакСобственностиВагонаСрезПоследних.ВЭксплуатации КАК ВЭксплуатации
	|ПОМЕСТИТЬ ВТПризнакиСобственности
	|ИЗ
	|	РегистрСведений.ПризнакСобственностиВагона.СрезПоследних(
	|			,
	|			Вагон В
	|				(ВЫБРАТЬ
	|					Вагоны.Ссылка
	|				ИЗ
	|					ВТВагоны КАК Вагоны
	|				ГДЕ
	|					НЕ Вагоны.Ссылка ЕСТЬ NULL)) КАК ПризнакСобственностиВагонаСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Вагон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВагоныНаСлеженииСрезПоследних.Вагон КАК Вагон,
	|	ВагоныНаСлеженииСрезПоследних.НаСлежении КАК НаСлежении
	|ПОМЕСТИТЬ ВТВагоныНаСлежении
	|ИЗ
	|	РегистрСведений.ВагоныНаСлежении.СрезПоследних КАК ВагоныНаСлеженииСрезПоследних
	|ГДЕ
	|	ВагоныНаСлеженииСрезПоследних.НаСлежении
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Вагон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТВагоны.Номер КАК Номер,
	|	ВТВагоны.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ВТПризнакиСобственности.ВЭксплуатации, ЛОЖЬ) КАК ВЭксплуатации,
	|	ЕСТЬNULL(ВТВагоныНаСлежении.НаСлежении, ЛОЖЬ) КАК НаСлежении,
	|	ЛОЖЬ КАК СнятьПризнакНаСлежении
	|ИЗ
	|	ВТВагоны КАК ВТВагоны
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПризнакиСобственности КАК ВТПризнакиСобственности
	|		ПО ВТВагоны.Ссылка = ВТПризнакиСобственности.Вагон
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВагоныНаСлежении КАК ВТВагоныНаСлежении
	|		ПО ВТВагоны.Ссылка = ВТВагоныНаСлежении.Вагон
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	ВТВагоныНаСлежении.Вагон,
	|	NULL,
	|	NULL,
	|	ИСТИНА
	|ИЗ
	|	ВТВагоныНаСлежении КАК ВТВагоныНаСлежении
	|ГДЕ
	|	НЕ ВТВагоныНаСлежении.Вагон В
	|				(ВЫБРАТЬ
	|					Вагоны.Ссылка
	|				ИЗ
	|					ВТВагоны КАК Вагоны
	|				ГДЕ
	|					НЕ Вагоны.Ссылка ЕСТЬ NULL)";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Вагон = Выборка.Ссылка;
		
		Если Выборка.СнятьПризнакНаСлежении Тогда
			
			Запись = РегистрыСведений.ВагоныНаСлежении.СоздатьМенеджерЗаписи();
			Запись.Вагон = Вагон;
			Запись.Период = ДатаЗаписей;
			Запись.НаСлежении = Ложь;
			Запись.Записать();
			
		Иначе
			
			Если Не ЗначениеЗаполнено(Вагон) Тогда
				НовыйВагонОбъект = Справочники.ТС.СоздатьЭлемент();
				НовыйВагонОбъект.Наименование = Выборка.Номер;
//Евросиб Гудкова( 28.10.2020 Ticket№ 0209404
				НовыйВагонОбъект.ТипТС = Справочники.ТипоразмерыТС.ВагонБезПаспортаНеопределен;
// Евросиб Гудкова)
				НовыйВагонОбъект.ЗаписьИсторииДанных.КомментарийВерсии = "Создан регламентом Загрузка списков вагонов контейнеров на слежении"; //ДИТ Шевченко US 63491 TA 74038 18.09.2023
				НовыйВагонОбъект.Записать();
				Вагон = НовыйВагонОбъект.Ссылка;
//Евросиб Гудкова( 06.10.2020 
			ИначеЕсли Вагон.ПометкаУдаления Тогда
				ВагонОбъект = Вагон.ПолучитьОбъект();
				ВагонОбъект.УстановитьПометкуУдаления(Ложь);
// Евросиб Гудкова) 
			КонецЕсли;
			
			Если НЕ Выборка.ВЭксплуатации Тогда
				Запись = РегистрыСведений.ПризнакСобственностиВагона.СоздатьМенеджерЗаписи();
				Запись.Период = ДатаЗаписей;
				Запись.Вагон = Вагон;
				Запись.ВЭксплуатации = Истина;
				// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
				//Было:
				//Запись.ПризнакСобственности = Перечисления.ВариантыСобственности.Неизвестно;
				//Стало:
				Запись.ПризнакСобственности = Перечисления.ВариантыСобственности.ПустаяСсылка();
				// ДИТ 65580 Давудов М.А. Конец: 23.02.2023
				Запись.Записать();
			КонецЕсли;
			
			Если НЕ Выборка.НаСлежении Тогда				
				Запись = РегистрыСведений.ВагоныНаСлежении.СоздатьМенеджерЗаписи();
				Запись.Вагон = Вагон;
				Запись.Период = ДатаЗаписей;
				Запись.НаСлежении = Истина;
				Запись.Записать();				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьСписокКонтейнеровНаСлежении(ТаблицаКонтейнеров, ЭтоТест)
	
//Евросиб Гудкова( 30.09.2020 Ticket№ слежение ставится только в этой системе
	Если ЭтоТест Тогда
		Возврат;
	КонецЕсли; 
// Евросиб Гудкова) 	
	ДатаЗаписей = НачалоДня(ТекущаяДатаСеанса());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаКонтейнеров", ТаблицаКонтейнеров);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаКонтейнеров.Номер КАК Номер,
	|	ТаблицаКонтейнеров.Префикс КАК Префикс,
	|	ТаблицаКонтейнеров.КонтрольноеЧисло КАК КонтрольноеЧисло,
	|	ТаблицаКонтейнеров.Тип КАК Тип
	|ПОМЕСТИТЬ ВТНомераКонтейнеров
	|ИЗ
	|	&ТаблицаКонтейнеров КАК ТаблицаКонтейнеров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНомераКонтейнеров.Номер КАК Номер,
	|	ВТНомераКонтейнеров.Префикс КАК Префикс,
	|	ВТНомераКонтейнеров.КонтрольноеЧисло КАК КонтрольноеЧисло,
	|	ВТНомераКонтейнеров.Тип КАК Тип,
	|	ТЕ.Ссылка КАК Ссылка,
	|	ТЕ.ТипТЕ КАК ТипТЕ
	|ПОМЕСТИТЬ ВТКонтейнеры
	|ИЗ
	|	ВТНомераКонтейнеров КАК ВТНомераКонтейнеров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
	|		ПО ВТНомераКонтейнеров.Номер = ТЕ.Номер
	|			И ВТНомераКонтейнеров.Префикс = ТЕ.Префикс
//Евросиб Гудкова( 31.10.2019 со слов Ивана контрольное число может прийти кривое. 
//было	|			И ВТНомераКонтейнеров.КонтрольноеЧисло = ТЕ.КонтрольноеЧисло
// Евросиб Гудкова) 	
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПризнакСобственностиКонтейнераСрезПоследних.Контейнер КАК Контейнер,
	|	ПризнакСобственностиКонтейнераСрезПоследних.ВЭксплуатации КАК ВЭксплуатации
	|ПОМЕСТИТЬ ВТПризнакиСобственности
	|ИЗ
	|	РегистрСведений.ПризнакСобственностиКонтейнера.СрезПоследних(
	|			,
	|			Контейнер В
	|				(ВЫБРАТЬ
	|					Контейнеры.Ссылка
	|				ИЗ
	|					ВТКонтейнеры КАК Контейнеры
	|				ГДЕ
	|					НЕ Контейнеры.Ссылка ЕСТЬ NULL)) КАК ПризнакСобственностиКонтейнераСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контейнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТипоразмерыТЕ.Наименование КАК Наименование,
	|	ТипоразмерыТЕ.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТТипыТЕ
	|ИЗ
	|	Справочник.ТипоразмерыТЕ КАК ТипоразмерыТЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтейнерыНаСлеженииСрезПоследних.Контейнер КАК Контейнер,
	|	КонтейнерыНаСлеженииСрезПоследних.НаСлежении КАК НаСлежении
	|ПОМЕСТИТЬ ВТКонтейнерыНаСлежении
	|ИЗ
	|	РегистрСведений.КонтейнерыНаСлежении.СрезПоследних КАК КонтейнерыНаСлеженииСрезПоследних
	|ГДЕ
	|	КонтейнерыНаСлеженииСрезПоследних.НаСлежении
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контейнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТКонтейнеры.Номер КАК Номер,
	|	ВТКонтейнеры.Префикс КАК Префикс,
	|	ВТКонтейнеры.КонтрольноеЧисло КАК КонтрольноеЧисло,
	|	ВТКонтейнеры.Ссылка КАК Ссылка,
	|	ВТКонтейнеры.ТипТЕ КАК КонтейнерТипТЕ,
	|	ВТТипыТЕ.Ссылка КАК ТипТЕ,
	|	ЕСТЬNULL(ВТПризнакиСобственности.ВЭксплуатации, ЛОЖЬ) КАК ВЭксплуатации,
	|	ЕСТЬNULL(ВТКонтейнерыНаСлежении.НаСлежении, ЛОЖЬ) КАК НаСлежении,
	|	ЛОЖЬ КАК СнятьПризнакНаСлежении
	|ИЗ
	|	ВТКонтейнеры КАК ВТКонтейнеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПризнакиСобственности КАК ВТПризнакиСобственности
	|		ПО ВТКонтейнеры.Ссылка = ВТПризнакиСобственности.Контейнер
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТипыТЕ КАК ВТТипыТЕ
	|		ПО ВТКонтейнеры.Тип = ВТТипыТЕ.Наименование
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКонтейнерыНаСлежении КАК ВТКонтейнерыНаСлежении
	|		ПО ВТКонтейнеры.Ссылка = ВТКонтейнерыНаСлежении.Контейнер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВТКонтейнерыНаСлежении.Контейнер,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ИСТИНА
	|ИЗ
	|	ВТКонтейнерыНаСлежении КАК ВТКонтейнерыНаСлежении
	|ГДЕ
	|	НЕ ВТКонтейнерыНаСлежении.Контейнер В
	|				(ВЫБРАТЬ
	|					Контейнеры.Ссылка
	|				ИЗ
	|					ВТКонтейнеры КАК Контейнеры
	|				ГДЕ
	|					НЕ Контейнеры.Ссылка ЕСТЬ NULL)";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Контейнер = Выборка.Ссылка;
//Евросиб Гудкова( 30.09.2020 Ticket№ 
			Если НЕ (ЭтоТест Или ЗначениеЗаполнено(Контейнер)) Тогда
				Продолжить;
			КонецЕсли;
// Евросиб Гудкова) 		
		
		Если Выборка.СнятьПризнакНаСлежении Тогда
			
			Запись = РегистрыСведений.КонтейнерыНаСлежении.СоздатьМенеджерЗаписи();
			Запись.Контейнер = Контейнер;
			Запись.Период = ДатаЗаписей;
			Запись.НаСлежении = Ложь;
			Запись.Записать();
			
		Иначе
		
			Контейнер = Выборка.Ссылка;
			Если Не ЗначениеЗаполнено(Контейнер) Тогда
				//КонтейнерОбъект = Справочники.ТЕ.СоздатьЭлемент();
				//КонтейнерОбъект.Наименование = Выборка.Префикс + Выборка.Номер + Строка(Выборка.КонтрольноеЧисло);
				//КонтейнерОбъект.Номер = Выборка.Номер;
				//КонтейнерОбъект.Префикс = Выборка.Префикс;
				//КонтейнерОбъект.КонтрольноеЧисло = Выборка.КонтрольноеЧисло;
				//КонтейнерОбъект.ТипТЕ = Выборка.ТипТЕ;
				//КонтейнерОбъект.Записать();
				НомерКТК = Выборка.Префикс + Выборка.Номер + Строка(Выборка.КонтрольноеЧисло);
				ТипТЕ = Выборка.ТипТЕ;
				Контейнер = РаботаСКонтейнерамиСервер.СоздатьКТК(НомерКТК, ТипТЕ);
			ИначеЕсли Не ЗначениеЗаполнено(Выборка.КонтейнерТипТЕ) И ЗначениеЗаполнено(Выборка.ТипТЕ) Тогда
				КонтейнерОбъект = Контейнер.ПолучитьОбъект();
				КонтейнерОбъект.ТипТЕ = Выборка.ТипТЕ;
				КонтейнерОбъект.Записать();
			КонецЕсли;
			
			Если Не Выборка.ВЭксплуатации Тогда
				Запись = РегистрыСведений.ПризнакСобственностиКонтейнера.СоздатьМенеджерЗаписи();
				Запись.Период = ДатаЗаписей;
				Запись.Контейнер = Контейнер;
				Запись.ВЭксплуатации = Истина;
				// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
				//Было:
				//Запись.ПризнакСобственности = Перечисления.ВариантыСобственности.Неизвестно;
				//Стало:
				Запись.ПризнакСобственности = Перечисления.ВариантыСобственности.ПустаяСсылка();
				// ДИТ 65580 Давудов М.А. Конец: 23.02.2023
				Запись.Записать();
			КонецЕсли;
			
			Если Не Выборка.НаСлежении Тогда
				Запись = РегистрыСведений.КонтейнерыНаСлежении.СоздатьМенеджерЗаписи();
				Запись.Контейнер = Контейнер;
				Запись.Период = ДатаЗаписей;
				Запись.НаСлежении = Истина;
				Запись.Записать();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти 

#Область РаботаСРИТМ

Процедура ЗагрузитьНазначениеВагоновИзИРС() Экспорт
	Обработки.ЗагрузкаНазначенныхВагоновИзИРС.Создать().ПолучитьНазначенныеВагоныИЗИРС();		
КонецПроцедуры

Процедура ВыгрузитьСделкиПривязанныеКНакладнымЭтран() Экспорт
	
	ФорматДаты = "ДФ='yyyy-MM-dd'";
	
	Запрос = Новый Запрос;
	//Евросиб Коханенко Н.А. #62003, #63020 19.12.2022 ( Пункт 2 добавить новые теги, дополнительно пункт 1
	//было
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	СделкиПривязанныеКНакладнымЭТРАН.Сделка КАК Сделка,
	//|	СделкиПривязанныеКНакладнымЭТРАН.Сделка.Номер КАК dealNumber,
	//|	СделкиПривязанныеКНакладнымЭТРАН.Сделка.Дата КАК dealDate,
	//|	СделкиПривязанныеКНакладнымЭТРАН.Накладная КАК Накладная,
	//|	СделкиПривязанныеКНакладнымЭТРАН.Накладная.НакладнаяЭТРАН.НакладнаяИД КАК invoiceID,
	//|	СделкиПривязанныеКНакладнымЭТРАН.ДатаПривязки КАК dcUpdate,
	//|	СделкаСвязьУчетныхЕдиниц.Клиент.Код КАК cRfCode,
	//|	СделкаСвязьУчетныхЕдиниц.Договор.Код КАК dRfCode
	//|ИЗ
	//|	РегистрСведений.СделкиПривязанныеКНакладнымЭТРАН КАК СделкиПривязанныеКНакладнымЭТРАН
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	//|		ПО СделкиПривязанныеКНакладнымЭТРАН.Сделка = СделкаСвязьУчетныхЕдиниц.Ссылка
	//|			И СделкиПривязанныеКНакладнымЭТРАН.Накладная = СделкаСвязьУчетныхЕдиниц.ЖДН
	//|ГДЕ
	//|	НЕ СделкиПривязанныеКНакладнымЭТРАН.ПривязкаВыгруженаВРИТМ";
	//конец было
	//стало      
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//Евросиб Коханенко Н.А. 06.10.2023 (( #75673 
	|	АктуальныеЖДН.Регистратор КАК Сделка,
	|	АктуальныеЖДН.ЖДН КАК Накладная,
	|	АктуальныеЖДН.Вагон КАК Вагон,
	|	АктуальныеЖДН.Контейнер КАК Контейнер,
	//Евросиб Коханенко Н.А. 06.10.2023 )) #75673 
	|	АктуальныеЖДН.Регистратор.Номер КАК dealNumber,
	|	АктуальныеЖДН.Регистратор.Дата КАК dealDate,
	|	ИдентификаторыТранспортныхДокументов.ИдентификаторНакладнойЭтран КАК invoiceID,
	|	АктуальныеЖДН.ЖДН.НомерТранспортногоДокумента КАК invNum,
	|	АктуальныеЖДН.ЖДН.ДатаТранспортногоДокумента КАК invDate,
	|	АктуальныеЖДН.Контейнер.Наименование КАК contNum,
	|	АктуальныеЖДН.Вагон.Наименование КАК wagNum
	|ИЗ
	|	РегистрНакопления.АктуальныеЖДН КАК АктуальныеЖДН
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыТранспортныхДокументов КАК ИдентификаторыТранспортныхДокументов
	|		ПО АктуальныеЖДН.ЖДН = ИдентификаторыТранспортныхДокументов.ТранспортныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВыгруженныеВРИТМЖДНПривязанныеКСделкам КАК ВыгруженныеВРИТМЖДНПривязанныеКСделкам
	|		ПО АктуальныеЖДН.ЖДН = ВыгруженныеВРИТМЖДНПривязанныеКСделкам.Накладная
	|			И АктуальныеЖДН.Вагон = ВыгруженныеВРИТМЖДНПривязанныеКСделкам.Вагон
	|			И АктуальныеЖДН.Контейнер = ВыгруженныеВРИТМЖДНПривязанныеКСделкам.Контейнер
	|ГДЕ
	|	АктуальныеЖДН.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И НЕ АктуальныеЖДН.ЖДН В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					СделкиПривязанныеКНакладнымЭТРАН.Накладная КАК Накладная
	|				ИЗ
	|					РегистрСведений.СделкиПривязанныеКНакладнымЭТРАН КАК СделкиПривязанныеКНакладнымЭТРАН)
	|	И ВыгруженныеВРИТМЖДНПривязанныеКСделкам.Накладная ЕСТЬ NULL";
	//конец стало
	//Евросиб Коханенко Н.А. #62003, #63020 19.12.2022 )
	
	ВыборкаДанных = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДанных.Количество() > 0 Тогда
		
		Запись = Новый ЗаписьXML;
	
		Запись.УстановитьСтроку("windows-1251"); 
		Запись.ЗаписатьОбъявлениеXML();
		
		Запись.ЗаписатьНачалоЭлемента("root");
		
		//Евросиб Коханенко Н.А. #62003, #63020 19.12.2022 ( Пункт 2 добавить новые теги 
		//было 
		////('Идентификатор документа Этран', "Номер сделки", "Дата сделки", "Дата обновления документа"
		////<R invoiceID="959099694" dealNumber="199/199/199" dealDate="2019-12-31" dcUpdate="2019-12-31"/>
		////
		//СтруктураАтрибутов = Новый Структура("invoiceID, dealNumber, dealDate, dcUpdate, cRfCode, dRfCode");
		//Пока ВыборкаДанных.Следующий() Цикл
		//	ЗаполнитьЗначенияСвойств(СтруктураАтрибутов, ВыборкаДанных,, "dealDate, dcUpdate");
		//	СтруктураАтрибутов.dealDate = Формат(ВыборкаДанных.dealDate, ФорматДаты);
		//	СтруктураАтрибутов.dcUpdate = Формат(ВыборкаДанных.dcUpdate, ФорматДаты); 
		//стало
		СтруктураАтрибутов = Новый Структура("dealNumber, dealDate, invoiceID, dcUpdate, cRfCode, dRfCode, invNum, invDate, contNum, wagNum");
		Пока ВыборкаДанных.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(СтруктураАтрибутов, ВыборкаДанных,, "dealNumber, dealDate, invoiceID, invNum, invDate, contNum, wagNum");
			СтруктураАтрибутов.dealNumber = ВыборкаДанных.dealNumber; 
			СтруктураАтрибутов.dealDate = Формат(ВыборкаДанных.dealDate, ФорматДаты);
			СтруктураАтрибутов.invoiceID = ВыборкаДанных.invoiceID; 
			СтруктураАтрибутов.dcUpdate = Формат(ТекущаяДата(), ФорматДаты); 
			СтруктураАтрибутов.invNum = ВыборкаДанных.invNum;
			СтруктураАтрибутов.invDate = Формат(ВыборкаДанных.invDate, ФорматДаты);
			СтруктураАтрибутов.contNum = ВыборкаДанных.contNum;
			СтруктураАтрибутов.wagNum = ВыборкаДанных.wagNum;
		//Евросиб Коханенко Н.А. #62003, #63020 19.12.2022 )
		
			ДобавитьЭлементВФайл(Запись, "R", "", СтруктураАтрибутов);
		КонецЦикла;
		
		Запись.ЗаписатьКонецЭлемента();
			
		ДанныеДляОтправки = Запись.Закрыть();
		
		ОтветXML = ВебСервисы_сервер.ЗапроситьРИТМ("sendDealInfo", ДанныеДляОтправки);
		
		ОбработаноЗаписей = 0;
		
		//Разбор ответа
		Если ЗначениеЗаполнено(ОтветXML) Тогда
			
			Чтение = Новый ЧтениеXML;
			Чтение.УстановитьСтроку(ОтветXML);
			
			Фабрика = Новый ФабрикаXDTO;
			ОбъектXDTO = Фабрика.ПрочитатьXML(Чтение);		
			
			Если ОбъектXDTO.Свойства().Получить("R") <> Неопределено Тогда
				РезультатВыполнения = ОбъектXDTO.R;
				ОбработаноЗаписей = Число(РезультатВыполнения.Добавлено);
				ОбработаноЗаписей = ОбработаноЗаписей + Число(РезультатВыполнения.Обновлено);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ОбработаноЗаписей > 0 Тогда
			
			//Евросиб Коханенко Н.А. 24.10.2023 (( #75968
			ДатаПривязки = ТекущаяДатаСеанса();
			НаборЗаписейВыгруженныеВРИТМЖДН = РегистрыСведений.ВыгруженныеВРИТМЖДНПривязанныеКСделкам.СоздатьНаборЗаписей();
			//Евросиб Коханенко Н.А. 24.10.2023 )) #75968
			ВыборкаДанных.Сбросить();
			Пока ВыборкаДанных.Следующий() Цикл			
				ЗаписьСделкиПривязаннойКНакладной = РегистрыСведений.СделкиПривязанныеКНакладнымЭТРАН.СоздатьМенеджерЗаписи(); 
				ЗаписьСделкиПривязаннойКНакладной.Сделка = ВыборкаДанных.Сделка;
				ЗаписьСделкиПривязаннойКНакладной.Накладная = ВыборкаДанных.Накладная;
				//Евросиб Коханенко Н.А. 24.10.2023 (( #75968
				//ЗаписьСделкиПривязаннойКНакладной.Прочитать();
				ЗаписьСделкиПривязаннойКНакладной.ДатаПривязки = ДатаПривязки; 
				//Евросиб Коханенко Н.А. 24.10.2023 )) #75968
				ЗаписьСделкиПривязаннойКНакладной.ПривязкаВыгруженаВРИТМ = Истина;
				ЗаписьСделкиПривязаннойКНакладной.Записать();
				
			//Евросиб Коханенко Н.А. 24.10.2023 (( #75968
			//КонецЦикла;
				ЗаписьВыгруженныеВРИТМЖДН = НаборЗаписейВыгруженныеВРИТМЖДН.Добавить();
				ЗаписьВыгруженныеВРИТМЖДН.Сделка = ВыборкаДанных.Сделка; 
				ЗаписьВыгруженныеВРИТМЖДН.Накладная = ВыборкаДанных.Накладная;
				ЗаписьВыгруженныеВРИТМЖДН.Контейнер = ВыборкаДанных.Контейнер;
				ЗаписьВыгруженныеВРИТМЖДН.Вагон = ВыборкаДанных.Вагон; 
				ЗаписьВыгруженныеВРИТМЖДН.ПривязкаВыгруженаВРИТМ = Истина;
				ЗаписьВыгруженныеВРИТМЖДН.ДатаПривязки = ДатаПривязки;
			КонецЦикла;
			НаборЗаписейВыгруженныеВРИТМЖДН.Записать(Ложь);
			//Евросиб Коханенко Н.А. 24.10.2023 )) #75968  
			
		Иначе
			КоличествоОтправленныхЗаписей = ВыборкаДанных.Количество();
			ТекстСообщения = СтрШаблон("При отправке %1 записей в РИТМ не обработано ни одной строки!", КоличествоОтправленныхЗаписей);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьИСФизРИТМаЗаПериод(Организация, ПериодЗагрузки)

	//Инициализация обработки загрузки
	ОбработкаЗагрузки = Обработки.ЗагрузкаИСФизРИТМа.Создать();
	ОбработкаЗагрузки.Организация = Организация;
	ОбработкаЗагрузки.ПериодВО = ПериодЗагрузки.ДатаНачала;
	ОбработкаЗагрузки.ПериодЗагрузки = ПериодЗагрузки;
	
	Попытка
		//Загрузка данных
		ОбработкаЗагрузки.ПолучитьСписокИСФ(ОбработкаЗагрузки.ПериодЗагрузки.ДатаНачала, ОбработкаЗагрузки.ПериодЗагрузки.ДатаОкончания, ОбработкаЗагрузки.Организация);
		//Евросиб СубботинВ #106299 19.06.2025 Начало
		// добавил признак рег задания
		//ОбработкаЗагрузки.ПолучитьДанныеПоИСФ();
		ОбработкаЗагрузки.ПолучитьДанныеПоИСФ(Истина);
		//Евросиб СубботинВ #106299 19.06.2025 Конец

	Исключение
		// Евросиб Фролов (26.04.2022
		Тема = "Рег. задание: Загрузка ИСФ из РИТМа";
		ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); 
		ТекстСообщения = "Ошибки и уведомления при выполнении рег. задания:
					|" + ПредставлениеОшибки;
		РаботаСоСделкамиСервер.ВыполнитьОтправкуУведомлений(Тема, ТекстСообщения, Метаданные.РегламентныеЗадания.ЗагрузкаИСФизРИТМа);
		// Евросиб Фролов)
	КонецПопытки;
	СписокЗагруженныхИСФ = Новый Массив;
	СтрокиСОшибками = Новый Массив;
	//Евросиб СубботинВ #101004 28.01.2025 Начало
	ЛогинПользователя = Пользователи.ТекущийПользователь().ЛогинAD;
	ЛогинПользователя = СтрЗаменить(ЛогинПользователя, "\", Символы.ПС);
	ЛогинПользователя = СтрПолучитьСтроку(ЛогинПользователя, СтрЧислоСтрок(ЛогинПользователя));
	//Евросиб СубботинВ #101004 28.01.2025 Конец	

	Для Каждого Строка Из ОбработкаЗагрузки.СписокДокументов Цикл
		Если Строка.СтатусЗагрузки = ПредопределенноеЗначение("Перечисление.СтатусыЗагрузки.ОтработаноБезОшибок") 
			Или Строка.СтатусЗагрузки = ПредопределенноеЗначение("Перечисление.СтатусыЗагрузки.НеЗагружать")
			Тогда
			//Евросиб СубботинВ #101004 28.01.2025 Начало 
			//СписокЗагруженныхИСФ.Добавить(Новый Структура("invRfCode, TypeRec, invoiceVersion, dtUnloadDC", Строка.КодИСФ, Строка.ТипИСФ, Строка.ВерсияИСФ, ТекущаяДата()));
			// добавил атрибут с логином текущего пользователя для подтверждения в ритме
            СписокЗагруженныхИСФ.Добавить(Новый Структура("invRfCode, TypeRec, invoiceVersion, dtUnloadDC, login", Строка.КодИСФ, Строка.ТипИСФ, Строка.ВерсияИСФ, ТекущаяДата(), ЛогинПользователя));
			//Евросиб СубботинВ #101004 28.01.2025 Конец 

		КонецЕсли;
		Если Строка.СтатусЗагрузки = ПредопределенноеЗначение("Перечисление.СтатусыЗагрузки.ОшибкаПриАнализе")
			Или Строка.СтатусЗагрузки = ПредопределенноеЗначение("Перечисление.СтатусыЗагрузки.ОшибкаПриЗагрузке") Тогда
			СтрокиСОшибками.Добавить(Строка);
		КонецЕсли;			
	КонецЦикла;
	
	//Отправка подтверждения
	Если СписокЗагруженныхИСФ.Количество() > 0 Тогда
		Обработки.ЗагрузкаИСФизРИТМа.ОтправитьПодтверждениеЗагрузки(СписокЗагруженныхИСФ);
	КонецЕсли;
	
	//Оповещение об ошибках
	Если СтрокиСОшибками.Количество() > 0 Тогда
		
		//Формирование заголовка письма
		Заголовок = СтрШаблон("Загрузка ИСФ из РИТМа в DC за период с %1 по %2", ОбработкаЗагрузки.ПериодЗагрузки.ДатаНачала, ОбработкаЗагрузки.ПериодЗагрузки.ДатаОкончания);
		
		//Формирование таблицы ошибок
		ТаблицаОшибок = ОбработкаЗагрузки.СписокДокументов.Выгрузить(СтрокиСОшибками);
		СтрокиТаблицы = Новый Массив;
		ШаблонСтрокиТаблицы = "<TR><TD>%1</TD><TD>%2</TD><TD>%3</TD><TD>%4</TD><TD>%5</TD><TD>%6</TD><TD>%7</TD><TD>%8</TD><TD>%9</TD></TR>";
		//Формирование заголовка таблицы
		ТекстСтроки = СтрШаблон(ШаблонСтрокиТаблицы, "Код ИСФ", "Тип ИСФ", "Версия ИСФ", "Вид ИСФ", "Номер ИСФ", "Дата ИСФ", "СсылкаИСФ", "Статус загрузки", "Комментарий");
		СтрокиТаблицы.Добавить(ТекстСтроки);
		//Формирование строк таблицы
		Для Каждого СтрокаТаблицы Из ТаблицаОшибок Цикл
			ТекстСтроки = СтрШаблон(ШаблонСтрокиТаблицы, СтрокаТаблицы.КодИСФ, СтрокаТаблицы.ТипИСФ, СтрокаТаблицы.ВерсияИСФ, СтрокаТаблицы.ВидИСФ, СтрокаТаблицы.НомерИСФ, СтрокаТаблицы.ДатаИСФ, СтрокаТаблицы.СсылкаИСФ, СтрокаТаблицы.СтатусЗагрузки, СтрокаТаблицы.Комментарий);
			СтрокиТаблицы.Добавить(ТекстСтроки);
		КонецЦикла;
		ТекстСтрокТаблицы = СтрСоединить(СтрокиТаблицы, Символы.ПС);
		ТекстТаблицы = СтрШаблон("<TABLE><TBODY>%1</TBODY></TABLE>", ТекстСтрокТаблицы);
		
		ТекстСообщения = СтрШаблон("<HTML><BODY>%1%2</BODY></HTML>", Заголовок, ТекстТаблицы);
		
		Получатели = НайтиПолучателейВПравилахОповещения(Перечисления.УзлыОбмена.РИТМ);
		ОтправитьСообщениеВФорматеHTML(Получатели, "Ошибки при загрузке ИСФ из РИТМа", ТекстСообщения);
		
	КонецЕсли;

КонецПроцедуры
 
Процедура ЗагрузитьИСФИзРИТМа() Экспорт
	
	Организация = Константы.ОсновнаяОрганизация.Получить();
	ПериодЗагрузки = Новый СтандартныйПериод;
	//Евросиб СубботинВ #106299 19.06.2025 Начало
	////Евросиб Каблов 09.04.2025 ( #105407
	////ПериодЗагрузки.ДатаНачала = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Организация);
	//ПериодЗагрузки.ДатаНачала = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(Организация);
	////Евросиб Каблов 09.04.2025 )
	
	КоличествоМесяцевПрошлогоПериодаДляЗагрузкиИзРитма = Константы.КоличествоМесяцевПрошлогоПериодаДляЗагрузкиИзРитма.Получить();
	ОткрытыйПериод = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(Организация);

	Если КоличествоМесяцевПрошлогоПериодаДляЗагрузкиИзРитма > 0 Тогда 
		ПериодЗагрузки.ДатаНачала = ДобавитьМесяц(НачалоМесяца(ОткрытыйПериод), КоличествоМесяцевПрошлогоПериодаДляЗагрузкиИзРитма*-1);
	Иначе
		ПериодЗагрузки.ДатаНачала = ОткрытыйПериод;
	КонецЕсли;
	//ПериодЗагрузки.ДатаОкончания = КонецМесяца(ПериодЗагрузки.ДатаНачала);	
	ПериодЗагрузки.ДатаОкончания = КонецМесяца(ОткрытыйПериод);
	//Евросиб СубботинВ #106299 19.06.2025 Конец

	ЗагрузитьИСФизРИТМаЗаПериод(Организация, ПериодЗагрузки);

	
	Если ПериодЗагрузки.ДатаНачала < НачалоМесяца(ТекущаяДата()) Тогда
		ПериодЗагрузки.ДатаНачала = НачалоМесяца(ТекущаяДата());
		ПериодЗагрузки.ДатаОкончания = КонецМесяца(ПериодЗагрузки.ДатаНачала);
		ЗагрузитьИСФизРИТМаЗаПериод(Организация, ПериодЗагрузки);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ВыгрузитьВРИТМСостояниеКопияВСФ(Поступление, Копия) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПротоколОбменов.УИДИсточника КАК УИДИсточника
	|ИЗ
	|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|ГДЕ
	|	ПротоколОбменов.ДействиеПриОбмене = &ДействиеПриОбмене_Загрузка
	|	И ПротоколОбменов.УзелОбмена = &УзелОбмена_РИТМ
	|	И ПротоколОбменов.Объект = &Объект_Ссылка";
	Запрос.УстановитьПараметр("ДействиеПриОбмене_Загрузка", Перечисления.ДействияПриОбмене.ЗагрузкаДанных);
	Запрос.УстановитьПараметр("УзелОбмена_РИТМ", Перечисления.УзлыОбмена.РИТМ);
	Запрос.УстановитьПараметр("Объект_Ссылка", Поступление);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Запись = Новый ЗаписьXML;
		Запись.УстановитьСтроку();
		Запись.ЗаписатьНачалоЭлемента("Список_ВСФ");
		Запись.ЗаписатьНачалоЭлемента("ВСФ");
		ДобавитьЭлементВФайл(Запись, "Ссылочный_код_ВСФ", Выборка.УИДИсточника);
		ДобавитьЭлементВФайл(Запись, "isCopy", Формат(Копия, "БЛ=0; БИ=1"));
		Запись.ЗаписатьКонецЭлемента();
		Запись.ЗаписатьКонецЭлемента();
		ОтправляемыеДанные = Запись.Закрыть();
		
		РЕЗ = ВебСервисы_сервер.ЗапроситьРИТМ("DCUpdateIsCopyVSF", ОтправляемыеДанные);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузаПризнакаЕстьXMLФНС() Экспорт
	// Евросиб Фролов (21.12.2021 TASK №43345
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ЗагрузкаПризнакаЕстьXMLФНС);

	ДатаНачалаЗапроса = НачалоДня(ТекущаяДатаСеанса());
	ДатаОкончанияЗапроса = КонецДня(ДатаНачалаЗапроса);
	
	Обработки.ЗагрузкаПризнаковXML_ФНС.ПолучитьСписокИСФ_XML_ФНС(ДатаНачалаЗапроса, ДатаОкончанияЗапроса);	
	// Евросиб Фролов)
КонецПроцедуры

#КонецОбласти

#Область Работа_с_ИРС

Процедура ВыгрузитьНазначениеВИРС(ОперацияНазначение, Грузоотправитель, ТипНазначения, Успешно = Ложь, ТекстСообщения = "") Экспорт
	
	Успешно = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОперацияНазначение", ОперацияНазначение);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОперацияГрузы.Ссылка.Номер КАК НомерЖДОтправки,
	|	ОперацияГрузы.Ссылка.РейсЖД.Наименование КАК НаименованиеРейсаЖД,
	|	ОперацияГрузы.ТС.Наименование КАК НомерВагона,
	|	ОперацияГрузы.Ссылка.ПунктНазначения.КодЖДСтанции КАК КодЖДСтанции,
	|	ОперацияГрузы.Ссылка.РейсЖД.ИРС_Грузоотправитель КАК ИРС_Грузоотправитель,
	|	ОперацияГрузы.Ссылка.ДатаОтправления КАК ДатаОтправления,
	|	ОперацияГрузы.Ссылка.ДатаНазначения КАК ДатаНазначения,
	|	ОперацияГрузы.Ссылка.Примечание КАК Примечание,
	|	ЕСТЬNULL(ПротоколОбменов.УИДИсточника, """") КАК КодНазначенияИРС
	|ИЗ
	|	Документ.Операция.Грузы КАК ОперацияГрузы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|		ПО ОперацияГрузы.Ссылка = ПротоколОбменов.Объект
	|			И (ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
	|			И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.ИРС))
	|ГДЕ
	|	ОперацияГрузы.Ссылка = &ОперацияНазначение";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ТекущийПользовательОС = ПользователиИнформационнойБазы.ТекущийПользователь().ПользовательОС;
		Пока СтрНачинаетсяС(ТекущийПользовательОС, "\") Цикл
			ТекущийПользовательОС = Прав(ТекущийПользовательОС, СтрДлина(ТекущийПользовательОС) - 1);
		КонецЦикла;
		
		Запись = Новый ЗаписьXML;
		
		//Запись.УстановитьСтроку("UTF-8");
		Запись.УстановитьСтроку("windows-1251"); 
		Запись.ЗаписатьОбъявлениеXML();
		
		Запись.ЗаписатьНачалоЭлемента("root");
		
		ДобавитьЭлементВФайл(Запись, "R", "", Новый Структура("nmParams, valueParams", "templateId", ТипНазначения));
		ДобавитьЭлементВФайл(Запись, "R", "", Новый Структура("nmParams, valueParams", "carNum", Выборка.НомерВагона));
		ДобавитьЭлементВФайл(Запись, "R", "", Новый Структура("nmParams, valueParams", "stCode", Выборка.КодЖДСтанции));
		ДобавитьЭлементВФайл(Запись, "R", "", Новый Структура("nmParams, valueParams", "receiverId", Грузоотправитель));
		ДобавитьЭлементВФайл(Запись, "R", "", Новый Структура("nmParams, valueParams", "loginName", ТекущийПользовательОС));
		ДобавитьЭлементВФайл(Запись, "R", "", Новый Структура("nmParams, valueParams", "notes", Выборка.Примечание));
		ДобавитьЭлементВФайл(Запись, "R", "", Новый Структура("nmParams, valueParams", "receiveDateFrom", Формат(Выборка.ДатаОтправления, "ДФ='ггггММдд чч:мм'")));
		ДобавитьЭлементВФайл(Запись, "R", "", Новый Структура("nmParams, valueParams", "receiveDateTo", Формат(Выборка.ДатаНазначения, "ДФ='ггггММдд чч:мм'")));
		
		Запись.ЗаписатьКонецЭлемента();
		
		ДанныеДляОтправки = Запись.Закрыть();
		
		ОтветXML = ВебСервисы_сервер.ЗапроситьРИТМ("CreateFleeAssignmentToIRS", ДанныеДляОтправки);
		
		//Разбор ответа
		Чтение = Новый ЧтениеXML;
		Чтение.УстановитьСтроку(ОтветXML);
		
		Фабрика = Новый ФабрикаXDTO;
		ОбъектXDTO = Фабрика.ПрочитатьXML(Чтение);
		СтруктураОтвета = Новый Структура("errorCode,errorMsg,Error,ErrorMessage","","","",""); 
		Если ОбъектXDTO.Свойства().Получить("errorCode") <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтруктураОтвета, ОбъектXDTO);
			КодОтвета = СтруктураОтвета.errorCode;
			СообщениеОтвета = СтруктураОтвета.errorMsg;
		ИначеЕсли ОбъектXDTO.Свойства().Получить("Error") <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтруктураОтвета, ОбъектXDTO.Error);
			Ошибка = СтруктураОтвета.Error;
			КодОтвета = СтруктураОтвета.ErrorCode;
			СообщениеОтвета = СтруктураОтвета.ErrorMessage;
		Иначе
			КодОтвета = "-";
			СообщениеОтвета = ОтветXML;
		КонецЕсли;
		
		Если КодОтвета = "0" Тогда //назначение успешно создано и СообщениеОтвета содержит код созданного назначения
				
			ЗаписьПротоколаОбменов = РегистрыСведений.ПротоколОбменов.СоздатьМенеджерЗаписи();
			ЗаписьПротоколаОбменов.Объект = ОперацияНазначение;
			ЗаписьПротоколаОбменов.УзелОбмена = Перечисления.УзлыОбмена.ИРС;
			ЗаписьПротоколаОбменов.ДействиеПриОбмене = Перечисления.ДействияПриОбмене.ВыгрузкаДанных;
			ЗаписьПротоколаОбменов.УИДИсточника = СообщениеОтвета;
			ЗаписьПротоколаОбменов.Ответственный = Пользователи.ТекущийПользователь();
			ЗаписьПротоколаОбменов.ДатаОбмена = ТекущаяДатаСеанса();
			ЗаписьПротоколаОбменов.Записать();
			
			Успешно = Истина;
			ТекстСообщения = "Назначение успешно создано в ИРС";
			
		ИначеЕсли КодОтвета = "4" Тогда //назначение в ИРС уже есть, в строке СообщениеОтвета есть код назначения
			
			СтрокаПоискаНомера = "код назначения в ИРС=";
			Цифры = "0123456789";
			НомерНайденногоСимвола = СтрНайти(СообщениеОтвета, СтрокаПоискаНомера);
			СимволыКода = Новый Массив;
			Если НомерНайденногоСимвола > 0 Тогда
				Для НомерСимвола = НомерНайденногоСимвола + СтрДлина(СтрокаПоискаНомера) По СтрДлина(СообщениеОтвета) Цикл
					ТекСимвол = Сред(СообщениеОтвета, НомерСимвола, 1);
					Если СтрНайти(Цифры, ТекСимвол) > 0 Тогда
						СимволыКода.Добавить(ТекСимвол);
					КонецЕсли;
				КонецЦикла;			
			КонецЕсли;		
			КодНазначения = СтрСоединить(СимволыКода);
			
			Если ЗначениеЗаполнено(КодНазначения) Тогда
				
				Если Не ЗначениеЗаполнено(Выборка.КодНазначенияИРС) Тогда
					ЗаписьПротоколаОбменов = РегистрыСведений.ПротоколОбменов.СоздатьМенеджерЗаписи();
					ЗаписьПротоколаОбменов.Объект = ОперацияНазначение;
					ЗаписьПротоколаОбменов.УзелОбмена = Перечисления.УзлыОбмена.ИРС;
					ЗаписьПротоколаОбменов.ДействиеПриОбмене = Перечисления.ДействияПриОбмене.ВыгрузкаДанных;				
					ЗаписьПротоколаОбменов.УИДИсточника = КодНазначения;
					ЗаписьПротоколаОбменов.Ответственный = Пользователи.ТекущийПользователь();
					ЗаписьПротоколаОбменов.ДатаОбмена = ТекущаяДатаСеанса();
					ЗаписьПротоколаОбменов.Записать();
				КонецЕсли;

			КонецЕсли;
			
			Успешно = Ложь;				
			ТекстСообщения = СтрШаблон("При выгрузке в ИРС ЖД отправки №%1 (вагон %2 рейс %3), произошла ошибка: %4 Код ошибки(%5)", 
										Выборка.НомерЖДОтправки, Выборка.НомерВагона, Выборка.НаименованиеРейсаЖД, СообщениеОтвета, КодОтвета);
										
			ЗаписьЖурналаРегистрации("Выгрузка назначенных вагонов в ИРС",
									УровеньЖурналаРегистрации.Ошибка,
									,
									ОперацияНазначение,
									ТекстСообщения);
			Сообщить(ТекстСообщения);
			
		Иначе
			
			Успешно = Ложь;				
			ТекстСообщения = СтрШаблон("При выгрузке в ИРС ЖД отправки №%1 (вагон %2 рейс %3), произошла ошибка: %4 Код ошибки(%5)", 
										Выборка.НомерЖДОтправки, Выборка.НомерВагона, Выборка.НаименованиеРейсаЖД, СообщениеОтвета, КодОтвета);
										
			ЗаписьЖурналаРегистрации("Выгрузка назначенных вагонов в ИРС",
									УровеньЖурналаРегистрации.Ошибка,
									,
									ОперацияНазначение,
									ТекстСообщения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьАтрибутВФайл(Файл, ИмяЭлемента, Значение) Экспорт
	
	Файл.ЗаписатьНачалоАтрибута(ИмяЭлемента);		
	Файл.ЗаписатьТекст(XMLСтрока(Значение));		
	Файл.ЗаписатьКонецАтрибута();
	
КонецПроцедуры

Процедура ДобавитьЭлементВФайл(Файл, ИмяЭлемента, Значение, Атрибуты = Неопределено) Экспорт
	
	Файл.ЗаписатьНачалоЭлемента(ИмяЭлемента);
	
	Если Атрибуты <> Неопределено Тогда
		Для Каждого Атрибут Из Атрибуты Цикл
			ДобавитьАтрибутВФайл(Файл, Атрибут.Ключ, Атрибут.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Файл.ЗаписатьТекст(XMLСтрока(Значение));		
	Файл.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Функция ПолучитьПланОтправок(ДатаНачала = Неопределено, ДатаКонца = Неопределено) Экспорт
	Запрос = Новый  Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РейсыЖД.ПунктОтправления.КодЖДСтанции КАК КодЖДСтанцииОтправления,
	|	РейсыЖД.ПунктНазначения.КодЖДСтанции КАК КодЖДСтанцииНазначения,
	|	РейсыЖД.ДатаОтправления КАК ДатаОтправления,
	|	РейсыЖД.ДатаПрибытия КАК ДатаПрибытия,
	|	РейсыЖД.УсловнаяДлинаСостава КАК УсловнаяДлинаСостава,
	|	24 КАК ДлительностьВыгрузки,
	|	РейсыЖД.КоличествоТЕУ КАК КоличествоТЕУ,
	|	РейсыЖД.Сервис.Наименование КАК Сервис,
	|	РейсыЖД.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ЗапрЗарезервирТЕУ.ЗарезервированоТЕУ, 0) КАК ЗарезервированоТЭУ,
	|	РейсыЖД.Автор.Представление КАК Автор
	|ИЗ
	|	Справочник.РейсыЖД КАК РейсыЖД
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗаявкаПереченьРейсов.Рейс КАК Рейс,
	|			СУММА(ЗаявкаПереченьРейсов.Ссылка.КоличествоКТК20 + ЗаявкаПереченьРейсов.Ссылка.КоличествоКТК40 * 2) КАК ЗарезервированоТЕУ
	|		ИЗ
	|			Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
	|		ГДЕ
	|			НЕ ЗаявкаПереченьРейсов.Ссылка.ПометкаУдаления
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаявкаПереченьРейсов.Рейс) КАК ЗапрЗарезервирТЕУ
	|		ПО РейсыЖД.Ссылка = ЗапрЗарезервирТЕУ.Рейс
	|ГДЕ
	|	НЕ РейсыЖД.РейсОтменен
	|	И ВЫБОР
	|			КОГДА &ДатаНачала = НЕОПРЕДЕЛЕНО
	|				ТОГДА РейсыЖД.ДатаОтправления >= &ДатаОтправления
	|			ИНАЧЕ РейсыЖД.ДатаОтправления МЕЖДУ &ДатаНачала И &ДатаКонца
	|		КОНЕЦ
	|	И НЕ РейсыЖД.ПометкаУдаления";
	ДлинаСутокВСекундах = 60*60*24;
	ДатаОтправки = НачалоДня(ТекущаяДата()) + ДлинаСутокВСекундах;
	Запрос.УстановитьПараметр("ДатаОтправления", ДатаОтправки);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКонца", ?(ДатаКонца <> Неопределено, КонецДня(ДатаКонца), ДатаКонца));
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьИнформациюПоВагонам(СписокВагоновСтрокой) Экспорт
	МассивНомеровВагонов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СписокВагоновСтрокой);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ПробегиВагоновСрезПоследних.ПолныйПробег, 0) КАК FullRun,
	|	ЕСТЬNULL(ПробегиВагоновСрезПоследних.ОстаточныйПробег, 0) КАК LeftRun,
	|	ЕСТЬNULL(ПробегиВагоновСрезПоследних.ПорогПробега, 0) КАК YellowLimit,
	|	ЕСТЬNULL(ПробегиВагоновСрезПоследних.НормативныйПробег, 0) КАК RedLimit,
	|	ТС.ТипТС.УсловнаяДлина КАК Length,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОграниченияИспользования.ПоказательОграничения, ЛОЖЬ) = ИСТИНА
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ExportDeny,
	|	ТС.Наименование КАК CarNumber
	|ИЗ
	|	Справочник.ТС КАК ТС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПробегиВагонов.СрезПоследних КАК ПробегиВагоновСрезПоследних
	|		ПО (ПробегиВагоновСрезПоследних.Вагон = ТС.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОграниченияИспользования КАК ОграниченияИспользования
	|		ПО (ОграниченияИспользования.УчетнаяЕдиница = ТС.Ссылка)
	|			И (ОграниченияИспользования.Ограничение = ЗНАЧЕНИЕ(Справочник.ОграниченияУчетныхЕдиниц.РазрешенПогранПереход))
	|			И (ОграниченияИспользования.ПоказательОграничения = ЛОЖЬ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПризнакСобственностиВагона.СрезПоследних КАК ПризнакСобственностиВагонаСрезПоследних
	|		ПО ТС.Ссылка = ПризнакСобственностиВагонаСрезПоследних.Вагон
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ЗаданСписокВагонов
	|				ТОГДА ТС.Наименование В (&МассивНомеровВагонов)
	|			ИНАЧЕ ЕСТЬNULL(ПризнакСобственностиВагонаСрезПоследних.ВЭксплуатации, ЛОЖЬ) = ИСТИНА
	|		КОНЕЦ
	|	И ТС.ТипТС.Вагон";
	Запрос.УстановитьПараметр("ЗаданСписокВагонов", МассивНомеровВагонов.Количество() > 0);
	Запрос.УстановитьПараметр("МассивНомеровВагонов", МассивНомеровВагонов);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ЗагрузкаИзИРСВагоновВРефСцепах() Экспорт
	
	//ДИТ Моисеенко Ю.В. 03.11.2022 59323 -начало	
	ОтветXML = ВебСервисы_сервер.ЗапроситьРИТМ("ListRefHitch");
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(ОтветXML);
	ОбъектДанных = ФабрикаXDTO.ПрочитатьXML(Чтение);
	СвойстваОбъекта = ОбъектДанных.Свойства();
	СвойствоОшибка = СвойстваОбъекта.Получить("error");
	
	Если СвойствоОшибка <> Неопределено Тогда
		
		Ошибка = ОбъектДанных.error;
		
		Если ТипЗнч(Ошибка) = Тип("Строка") Тогда
			КодОшибки = "";
			Описание = Ошибка;
		Иначе
			КодОшибки = Ошибка.ErrorCode;
			Описание = Ошибка.ErrorMessage;
		КонецЕсли;
		
		ТекстОшибки = СтрШаблон("При запросе данных из РИТМа, произошла ошибка(%1): %2", КодОшибки, Описание); 
		ЗаписьЖурналаРегистрации("ИРС.ЗагрузкаВагоновВРефСцепах", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ВызватьИсключение ТекстОшибки;

		Возврат;
		
	КонецЕсли;
	
	ТаблицаВагонов = ВебСервисы_сервер.УниверсальныйПарсерXML(ОтветXML, "refHitch");
	ЗагрузитьВагоныВРефСцепах(ТаблицаВагонов);
	//ДИТ Моисеенко Ю.В. 03.11.2022 59323 -конец
	
КонецПроцедуры

Процедура ЗагрузитьВагоныВРефСцепах(ТаблицаДанных)
	
	//ДИТ Моисеенко Ю.В. 03.11.2022 59323 -начало
	ТаблицаВагонов = ТипизироватьТаблицуВагонов(ТаблицаДанных);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаВагонов", ТаблицаВагонов);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаВагонов.refHitch КАК refHitch,
	|	ТаблицаВагонов.hitchNum КАК hitchNum,
	|	ТаблицаВагонов.wagonNumber КАК wagonNumber,
	|	ТаблицаВагонов.hitchPossible КАК hitchPossible,
	|	ТаблицаВагонов.controller1 КАК controller1,
	|	ТаблицаВагонов.Controller2 КАК Controller2,
	|	ТаблицаВагонов.email КАК email,
	|	ТаблицаВагонов.НомерКонтейнера КАК НомерКонтейнера
	|ПОМЕСТИТЬ ВТТЗВагоны
	|ИЗ
	|	&ТаблицаВагонов КАК ТаблицаВагонов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТЗВагоны.refHitch КАК refHitch,
	|	ВТТЗВагоны.hitchNum КАК hitchNum,
	|	ВТТЗВагоны.wagonNumber КАК wagonNumber,
	|	ВТТЗВагоны.hitchPossible КАК hitchPossible,
	|	ВТТЗВагоны.controller1 КАК controller1,
	|	ВТТЗВагоны.Controller2 КАК Controller2,
	|	ВТТЗВагоны.email КАК email,
	|	АВТОНОМЕРЗАПИСИ() КАК НомерСтроки
	|ПОМЕСТИТЬ ВТВагоныНумерация
	|ИЗ
	|	ВТТЗВагоны КАК ВТТЗВагоны
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТЗВагоны.refHitch КАК refHitch,
	|	ВТТЗВагоны.hitchNum КАК hitchNum,
	|	ВТТЗВагоны.wagonNumber КАК wagonNumber,
	|	ВТТЗВагоны.hitchPossible КАК hitchPossible,
	|	ВТТЗВагоны.controller1 КАК controller1,
	|	ВТТЗВагоны.Controller2 КАК Controller2,
	|	ВТТЗВагоны.email КАК email,
	|	АВТОНОМЕРЗАПИСИ() КАК НомерСтроки,
	|	ВТТЗВагоны.НомерКонтейнера КАК НомерКонтейнера
	|ПОМЕСТИТЬ ВТВагоныЗаполненные
	|ИЗ
	|	ВТТЗВагоны КАК ВТТЗВагоны
	|ГДЕ
	|	НЕ ВТТЗВагоны.wagonNumber = """"
	|	И НЕ ВТТЗВагоны.hitchPossible = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТВагоныЗаполненные.refHitch КАК refHitch,
	|	ВТВагоныЗаполненные.hitchNum КАК hitchNum
	|ПОМЕСТИТЬ ВТНомерСцепыУникальные
	|ИЗ
	|	ВТВагоныЗаполненные КАК ВТВагоныЗаполненные
	|ГДЕ
	|	НЕ ВТВагоныЗаполненные.refHitch = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНомерСцепыУникальные.refHitch КАК refHitch,
	|	ВТНомерСцепыУникальные.hitchNum КАК hitchNum
	|ПОМЕСТИТЬ ВТДублиНомеровВСцепе
	|ИЗ
	|	ВТНомерСцепыУникальные КАК ВТНомерСцепыУникальные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВагоныЗаполненные КАК ВТВагоныЗаполненные
	|		ПО ВТНомерСцепыУникальные.refHitch = ВТВагоныЗаполненные.refHitch
	|			И ВТНомерСцепыУникальные.hitchNum = ВТВагоныЗаполненные.hitchNum
	|ГДЕ
	|	ВТВагоныЗаполненные.hitchNum <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТНомерСцепыУникальные.refHitch,
	|	ВТНомерСцепыУникальные.hitchNum
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ВТВагоныЗаполненные.hitchNum) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(РефСцепы.Ссылка) КАК РефСцепа,
	|	ВТВагоныЗаполненные.refHitch КАК refHitch,
	|	МАКСИМУМ(ТС.Ссылка) КАК Вагон,
	|	ВТВагоныЗаполненные.wagonNumber КАК wagonNumber,
	|	ВТВагоныЗаполненные.hitchPossible КАК hitchPossible,
	|	ВТВагоныЗаполненные.controller1 КАК controller1,
	|	ВТВагоныЗаполненные.Controller2 КАК Controller2,
	|	ВТВагоныЗаполненные.email КАК email,
	|	ВТВагоныЗаполненные.hitchNum КАК hitchNum,
	|	ВТВагоныЗаполненные.НомерСтроки КАК НомерСтроки,
	|	МАКСИМУМ(ТЕ.Ссылка) КАК Контейнер,
	|	ВТВагоныЗаполненные.НомерКонтейнера КАК НомерКонтейнера
	|ПОМЕСТИТЬ ВТДанныеДляЗагрузки
	|ИЗ
	|	ВТВагоныЗаполненные КАК ВТВагоныЗаполненные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РефСцепы КАК РефСцепы
	|		ПО ВТВагоныЗаполненные.refHitch = РефСцепы.Наименование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТС КАК ТС
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипоразмерыТС КАК ТипоразмерыТС
	|			ПО ТС.ТипТС = ТипоразмерыТС.Ссылка
	|		ПО ВТВагоныЗаполненные.wagonNumber = ТС.Наименование
	|			И (ЕСТЬNULL(ТипоразмерыТС.Вагон, ИСТИНА))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДублиНомеровВСцепе КАК ВТДублиНомеровВСцепе
	|		ПО ВТВагоныЗаполненные.refHitch = ВТДублиНомеровВСцепе.refHitch
	|			И ВТВагоныЗаполненные.hitchNum = ВТДублиНомеровВСцепе.hitchNum
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
	|		ПО (ТЕ.Префикс = ""ETSN"")
	|			И (ТЕ.Номер = ВТВагоныЗаполненные.НомерКонтейнера)
	|ГДЕ
	|	ВТДублиНомеровВСцепе.refHitch ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТВагоныЗаполненные.hitchPossible,
	|	ВТВагоныЗаполненные.controller1,
	|	ВТВагоныЗаполненные.Controller2,
	|	ВТВагоныЗаполненные.email,
	|	ВТВагоныЗаполненные.wagonNumber,
	|	ВТВагоныЗаполненные.refHitch,
	|	ВТВагоныЗаполненные.hitchNum,
	|	ВТВагоныЗаполненные.НомерСтроки,
	|	ВТВагоныЗаполненные.НомерКонтейнера";
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВТДанныеДляЗагрузки.РефСцепа КАК РефСцепа,
	|	ВТДанныеДляЗагрузки.refHitch КАК refHitch,
	|	ВТДанныеДляЗагрузки.Вагон КАК Вагон,
	|	ВТДанныеДляЗагрузки.wagonNumber КАК wagonNumber,
	|	ВТДанныеДляЗагрузки.hitchPossible КАК hitchPossible,
	|	ВТДанныеДляЗагрузки.controller1 КАК Номер1Контроллера,
	|	ВТДанныеДляЗагрузки.Controller2 КАК Номер2Контроллера,
	|	ВТДанныеДляЗагрузки.email КАК EmailОтвтетственного,
	|	ВТДанныеДляЗагрузки.hitchNum КАК hitchNum,
	|	ВТДанныеДляЗагрузки.НомерСтроки КАК НомерСтроки,
	|	ВТДанныеДляЗагрузки.Контейнер КАК Контейнер,
	|	ЕСТЬNULL(ВТДанныеДляЗагрузки.РефСцепа.ПометкаУдаления, ЛОЖЬ) КАК РефСцепаПометкаУдаления,
	|	ЕСТЬNULL(ВТДанныеДляЗагрузки.Вагон.ПометкаУдаления,ЛОЖЬ) КАК ВагонПометкаУдаления,
	|	ЕСТЬNULL(ВТДанныеДляЗагрузки.Контейнер.ПометкаУдаления, ЛОЖЬ) КАК КонтейнерПометкаУдаления,
	|	ВТДанныеДляЗагрузки.НомерКонтейнера КАК НомерКонтейнера
	|ИЗ
	|	ВТДанныеДляЗагрузки КАК ВТДанныеДляЗагрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТЗВагоны.refHitch КАК refHitch,
	|	ВТТЗВагоны.hitchNum КАК hitchNum,
	|	ВТТЗВагоны.wagonNumber КАК wagonNumber,
	|	ВТТЗВагоны.hitchPossible КАК hitchPossible,
	|	ВТТЗВагоны.email КАК email
	|ИЗ
	|	ВТТЗВагоны КАК ВТТЗВагоны
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВагоныЗаполненные КАК ВТВагоныЗаполненные
	|		ПО ВТТЗВагоны.refHitch = ВТВагоныЗаполненные.refHitch
	|			И ВТТЗВагоны.hitchNum = ВТВагоныЗаполненные.hitchNum
	|			И ВТТЗВагоны.wagonNumber = ВТВагоныЗаполненные.wagonNumber
	|			И ВТТЗВагоны.hitchPossible = ВТВагоныЗаполненные.hitchPossible
	|ГДЕ
	|	ВТВагоныЗаполненные.refHitch ЕСТЬ NULL
	|ИТОГИ ПО
	|	email
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДублиНомеровВСцепе.refHitch КАК refHitch,
	|	ВТДублиНомеровВСцепе.hitchNum КАК hitchNum,
	|	ВТТЗВагоны.email КАК email,
	|	ВТТЗВагоны.wagonNumber КАК wagonNumber
	|ИЗ
	|	ВТДублиНомеровВСцепе КАК ВТДублиНомеровВСцепе
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТЗВагоны КАК ВТТЗВагоны
	|		ПО ВТДублиНомеровВСцепе.refHitch = ВТТЗВагоны.refHitch
	|			И ВТДублиНомеровВСцепе.hitchNum = ВТТЗВагоны.hitchNum
	|ИТОГИ ПО
	|	email,
	|	refHitch,
	|	hitchNum";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДанныеДляЗагрузки = РезультатЗапроса[0].Выбрать();
	ВыборкаОшибкиЗаполнения = РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаДубли = РезультатЗапроса[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НЗ = РегистрыСведений.ВагоныВРефСцепах.СоздатьНаборЗаписей();
	НЗ.Записать();
	
	ЗагрузитьПроверенныеДанные(ВыборкаДанныеДляЗагрузки);
	ОтправитьПисьмаСОшибкамиЗаполнения(ВыборкаОшибкиЗаполнения);
	ОтправитьПисьмаСОшибкамиДублирования(ВыборкаДубли);
	//ДИТ Моисеенко Ю.В. 03.11.2022 59323 -конец
	
	// +++ Евросиб Дудоров С.В. USER STORY 57543 30.01.2023  
	РефСцепСервер.ПроверкаАктуальностиДокументовРефСцеп();	
	// --- Евросиб Дудоров С.В. USER STORY 57543 30.01.2023  
	
КонецПроцедуры

Функция ТипизироватьТаблицуВагонов(ТаблицаВагонов)

	//ДИТ Моисеенко Ю.В. 03.11.2022 59323 -начало
	ТЗ = Новый ТаблицаЗначений;
	
	Для Каждого Колонка Из ТаблицаВагонов.Колонки Цикл
		Если Колонка.Имя = "hitchNum" Тогда 
			Тип = ОбщегоНазначения.ОписаниеТипаЧисло(2, 0);
		Иначе
			Тип = ОбщегоНазначения.ОписаниеТипаСтрока(60);
		КонецЕсли;
		
		ТЗ.Колонки.Добавить(Колонка.Имя, Тип);
	КонецЦикла;
	
	ТЗ.Колонки.Добавить("НомерКонтейнера", ОбщегоНазначения.ОписаниеТипаСтрока(60));
	ДлинаНомераКонтейнера = 6;
	
	Для Каждого СтрокаВагон Из ТаблицаВагонов Цикл
		НоваяСтрока = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВагон);
		
		НоваяСтрока.НомерКонтейнера = НоваяСтрока.refHitch;
		
		Пока СтрДлина(НоваяСтрока.НомерКонтейнера) < 6 Цикл
			НоваяСтрока.НомерКонтейнера = "0" + НоваяСтрока.НомерКонтейнера;	
		КонецЦикла;
		
	КонецЦикла; 
	
	Возврат ТЗ;
	//ДИТ Моисеенко Ю.В. 03.11.2022 59323 -конец
	
КонецФункции

Процедура ЗагрузитьПроверенныеДанные(ВыборкаДанныеДляЗагрузки)
	
	//ДИТ Моисеенко Ю.В. 03.11.2022 59323 -начало
	НомерБезСцепа = 1;
	
	ЗагруженныеРефСцепы 	= Новый Соответствие;
	ЗагруженныеКонтейнеры 	= Новый Соответствие;
	ЗагруженныеВагоны 		= Новый Соответствие;
	
	Пока ВыборкаДанныеДляЗагрузки.Следующий() Цикл
		
		//проверяем есть ли рефсцепа в бд, если нет, то создаем новую. Если есть, проверяем пометку удаления
		РефСцеп = ВыборкаДанныеДляЗагрузки.РефСцепа;
		Если Не ЗначениеЗаполнено(РефСцеп) Тогда
			РефСцеп = ЗагруженныеРефСцепы.Получить(ВыборкаДанныеДляЗагрузки.refHitch);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаДанныеДляЗагрузки.refHitch) Тогда
			Если Не ЗначениеЗаполнено(РефСцеп) Тогда
				РефСцепаОбъект = Справочники.РефСцепы.СоздатьЭлемент();
				РефСцепаОбъект.Наименование = ВыборкаДанныеДляЗагрузки.refHitch;
				Попытка
					РефСцепаОбъект.Записать();
					РефСцеп = РефСцепаОбъект.Ссылка;
					ЗагруженныеРефСцепы.Вставить(ВыборкаДанныеДляЗагрузки.refHitch, РефСцеп);
				Исключение
					Тема = "Рег. задание: Загрузка вагонов в реф сцепах из РИТМа";
					ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); 
					ТекстСообщения = "Ошибки и уведомления при выполнении рег. задания:
					|" + ПредставлениеОшибки;
					РаботаСоСделкамиСервер.ВыполнитьОтправкуУведомлений(Тема, ТекстСообщения, Метаданные.РегламентныеЗадания.ЗагрузкаИзИРСВагоновВРефСцепах);
				КонецПопытки;
				
			Иначе
				Если ВыборкаДанныеДляЗагрузки.РефСцепаПометкаУдаления Тогда
					РефСцепаОбъект = РефСцеп.ПолучитьОбъект();
					РефСцепаОбъект.ПометкаУдаления = Ложь;
					Попытка
						РефСцепаОбъект.Записать();
					Исключение
						Тема = "Рег. задание: Загрузка вагонов в реф сцепах из РИТМа";
						ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); 
						ТекстСообщения = "Ошибки и уведомления при выполнении рег. задания:
						|" + ПредставлениеОшибки;
						РаботаСоСделкамиСервер.ВыполнитьОтправкуУведомлений(Тема, ТекстСообщения, Метаданные.РегламентныеЗадания.ЗагрузкаИзИРСВагоновВРефСцепах);
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//проверяем есть ли Контейнер в бд, если нет, то создаем новый. Если есть, проверяем пометку удаления	
		Если Не ЗначениеЗаполнено(ВыборкаДанныеДляЗагрузки.Контейнер) И ЗагруженныеКонтейнеры.Получить(ВыборкаДанныеДляЗагрузки.НомерКонтейнера) = Неопределено Тогда
			
			Контейнер = Справочники.ТЕ.СоздатьЭлемент();
			Контейнер.Префикс = "ETSN";
			Контейнер.Номер = ВыборкаДанныеДляЗагрузки.НомерКонтейнера;
			
			Попытка
				Контейнер.Записать();
				
				ЗагруженныеКонтейнеры.Вставить(ВыборкаДанныеДляЗагрузки.НомерКонтейнера, Контейнер.Ссылка);
				
				ЗаписьКонтейнер = РегистрыСведений.ИсточникСозданияКонтейнеров.СоздатьМенеджерЗаписи();
				ЗаписьКонтейнер.Контейнер = Контейнер.Ссылка;
				ЗаписьКонтейнер.ИсточникСоздания = "загрузка реф. сцепов";
				ЗаписьКонтейнер.Записать();
			Исключение
				Тема = "Рег. задание: Загрузка вагонов в реф сцепах из РИТМа";
				ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); 
				ТекстСообщения = "Ошибки и уведомления при выполнении рег. задания:
				|" + ПредставлениеОшибки;
				РаботаСоСделкамиСервер.ВыполнитьОтправкуУведомлений(Тема, ТекстСообщения, Метаданные.РегламентныеЗадания.ЗагрузкаИзИРСВагоновВРефСцепах);
			КонецПопытки;
			
		Иначе
			
			Если ВыборкаДанныеДляЗагрузки.КонтейнерПометкаУдаления Тогда
				Контейнер = ВыборкаДанныеДляЗагрузки.Контейнер.ПолучитьОбъект();
				Контейнер.ПометкаУдаления = Ложь;
				Попытка
					Контейнер.Записать();
				Исключение
					Тема = "Рег. задание: Загрузка вагонов в реф сцепах из РИТМа";
					ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); 
					ТекстСообщения = "Ошибки и уведомления при выполнении рег. задания:
					|" + ПредставлениеОшибки;
					РаботаСоСделкамиСервер.ВыполнитьОтправкуУведомлений(Тема, ТекстСообщения, Метаданные.РегламентныеЗадания.ЗагрузкаИзИРСВагоновВРефСцепах);
				КонецПопытки;
			КонецЕсли;
			
		КонецЕсли;
		
		//проверяем есть ли вагон в бд, если нет, то создаем новый. Если есть, проверяем пометку удаления
		Вагон = ВыборкаДанныеДляЗагрузки.Вагон;
		
		Если Не ЗначениеЗаполнено(Вагон) Тогда 
			Вагон = ЗагруженныеВагоны.Получить(ВыборкаДанныеДляЗагрузки.wagonNumber);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Вагон) Тогда
			ВагонОбъект = Справочники.ТС.СоздатьЭлемент();
			ВагонОбъект.Наименование = ВыборкаДанныеДляЗагрузки.wagonNumber;
			ВагонОбъект.ТипТС = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ТипоразмерыТС.РефСцПлатформа");
			Попытка
				ВагонОбъект.ЗаписьИсторииДанных.КомментарийВерсии = "Создан регламентом Загрузка из ИРС вагонов в реф сцепах"; //ДИТ Шевченко US 63491 TA 74038 18.09.2023
				ВагонОбъект.Записать();
				Вагон = ВагонОбъект.Ссылка;
				
				ЗагруженныеВагоны.Вставить(ВыборкаДанныеДляЗагрузки.wagonNumber, Вагон);
			Исключение
				Тема = "Рег. задание: Загрузка вагонов в реф сцепах из РИТМа";
				ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); 
				ТекстСообщения = "Ошибки и уведомления при выполнении рег. задания:
				|" + ПредставлениеОшибки;
				РаботаСоСделкамиСервер.ВыполнитьОтправкуУведомлений(Тема, ТекстСообщения, Метаданные.РегламентныеЗадания.ЗагрузкаИзИРСВагоновВРефСцепах);
			КонецПопытки;
		Иначе
			Если ВыборкаДанныеДляЗагрузки.ВагонПометкаУдаления Тогда
				ВагонОбъект = Вагон.ПолучитьОбъект();
				ВагонОбъект.ПометкаУдаления = Ложь;
				Попытка
					ВагонОбъект.Записать();
				Исключение
					Тема = "Рег. задание: Загрузка вагонов в реф сцепах из РИТМа";
					ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); 
					ТекстСообщения = "Ошибки и уведомления при выполнении рег. задания:
					|" + ПредставлениеОшибки;
					РаботаСоСделкамиСервер.ВыполнитьОтправкуУведомлений(Тема, ТекстСообщения, Метаданные.РегламентныеЗадания.ЗагрузкаИзИРСВагоновВРефСцепах);
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаДанныеДляЗагрузки.refHitch) Тогда
			ПорядковыйНомерВСцепе = ВыборкаДанныеДляЗагрузки.hitchNum;
		Иначе
			ПорядковыйНомерВСцепе = НомерБезСцепа;
			НомерБезСцепа = НомерБезСцепа + 1;
		КонецЕсли;
		
		Если ВыборкаДанныеДляЗагрузки.hitchPossible = "Годен для реф. сцепа" Тогда 
			ПризнакВагона = 1;
		ИначеЕсли ВыборкаДанныеДляЗагрузки.hitchPossible = "Монтирован ДГК" Тогда
			ПризнакВагона = 2;
		Иначе
			ПризнакВагона = 0;
		КонецЕсли;
		
		Запись = РегистрыСведений.ВагоныВРефСцепах.СоздатьМенеджерЗаписи();
		Запись.РефСцеп = РефСцеп;
		Запись.ПорядковыйНомерВСцепе = ПорядковыйНомерВСцепе;
		Запись.Вагон = Вагон;
		Запись.ПризнакВагона = ПризнакВагона;
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаДанныеДляЗагрузки, "Номер1Контроллера,Номер2Контроллера,EmailОтвтетственного");
		
		Запись.Записать();
		
	КонецЦикла;
	//ДИТ Моисеенко Ю.В. 03.11.2022 59323 -конец
	
КонецПроцедуры

Процедура ОтправитьПисьмаСОшибкамиЗаполнения(ВыборкаОшибкиЗаполнения)
	
	//ДИТ Моисеенко Ю.В. 03.11.2022 59323 -начало
	СоответствиеПолейСинонимов = Новый Соответствие;
	СоответствиеПолейСинонимов.Вставить("wagonNumber", 		"Вагон");
	СоответствиеПолейСинонимов.Вставить("hitchPossible", 	"Признак вагона");
	
	Пока ВыборкаОшибкиЗаполнения.Следующий() Цикл
		
		Email = ВыборкаОшибкиЗаполнения.email;
		
		Тема 			= "В систему ИРС внесены некорректные данные по вагонам: ";
		СписокВагонов 	= "";
		Тело 		= "";
		
		Выборка = ВыборкаОшибкиЗаполнения.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			СписокВагонов = СписокВагонов + ?(ЗначениеЗаполнено(СписокВагонов), ", ", "") + Выборка.wagonNumber;
			Шаблон = "Вагон %1: не заполнены обязательные поля: %2";
			ПустыеПоля = "";
			
			Для Каждого Поле Из СоответствиеПолейСинонимов Цикл
				Если Не ЗначениеЗаполнено(Выборка[Поле.Ключ]) Тогда 
					ПустыеПоля = ПустыеПоля + ?(ЗначениеЗаполнено(ПустыеПоля), ", ", "") + Поле.Значение;
				КонецЕсли;
			КонецЦикла;
			
			Тело = Тело + ?(ЗначениеЗаполнено(Тело), "<br>", "") + СтрШаблон(Шаблон, Выборка.wagonNumber, ПустыеПоля);
			
		КонецЦикла;
		
		Тема = Тема + СписокВагонов;
		ПолучателиПисьма = Новый Массив;
		
		СистемнаяУчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
		ПараметрыОтправкиПисьма = Новый Структура;
		ПараметрыОтправкиПисьма.Вставить("Тема", Тема);
		ПараметрыОтправкиПисьма.Вставить("Тело", Тело);
		ПараметрыОтправкиПисьма.Вставить("ТипТекста", Перечисления.ТипыТекстовЭлектронныхПисем.HTML);
		ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", Email, Email));
		ПараметрыОтправкиПисьма.Вставить("Кому", ПолучателиПисьма);
		ПараметрыОтправкиПисьма.Вставить("Важность", ВажностьИнтернетПочтовогоСообщения.Высокая);
		
		Результат = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(СистемнаяУчетнаяЗапись, ПараметрыОтправкиПисьма);
		
	КонецЦикла;
	//ДИТ Моисеенко Ю.В. 03.11.2022 59323 -конец
	
КонецПроцедуры

Процедура ОтправитьПисьмаСОшибкамиДублирования(ВыборкаДубли)
	
	//ДИТ Моисеенко Ю.В. 03.11.2022 59323 -начало
    Пока ВыборкаДубли.Следующий() Цикл
		
		Email = ВыборкаДубли.email;
		
		Тема 			= "В систему ИРС внесены некорректные данные по вагонам: ";
		Тело 			= "";
		
		ВыборкаСцепы = ВыборкаДубли.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСцепы.Следующий() Цикл
			
			ТекстСцепы = "Реф. сцеп %1: есть дубли порядковых номеров вагонов: ";
			ТекстСцепы = СтрШаблон(ТекстСцепы, ВыборкаСцепы.refHitch);

			ВыборкаНомера = ВыборкаСцепы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаНомера.Следующий() Цикл
				
				Выборка = ВыборкаНомера.Выбрать();
				СписокВагонов 	= "";
				
				Пока Выборка.Следующий() Цикл
					СписокВагонов = СписокВагонов + ?(ЗначениеЗаполнено(СписокВагонов), ", ", "") + Выборка.wagonNumber;
				КонецЦикла;
				
				ШаблонНомер = " - порядковый номер в сцепе: %1 вагоны: %2";
				ШаблонНомер = СтрШаблон(ШаблонНомер, ВыборкаНомера.hitchNum, СписокВагонов);
				ТекстСцепы = ТекстСцепы + "<br>" + ШаблонНомер;
				
			КонецЦикла;
			
			Тело = Тело + ?(ЗначениеЗаполнено(Тело), "<br>", "") + ТекстСцепы;
			
		КонецЦикла;
		
		Тема = Тема + СписокВагонов;
		ПолучателиПисьма = Новый Массив;
		
		СистемнаяУчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
		ПараметрыОтправкиПисьма = Новый Структура;
		ПараметрыОтправкиПисьма.Вставить("Тема", Тема);
		ПараметрыОтправкиПисьма.Вставить("Тело", Тело);
		ПараметрыОтправкиПисьма.Вставить("ТипТекста", Перечисления.ТипыТекстовЭлектронныхПисем.HTML);
		ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", Email, Email));
		ПараметрыОтправкиПисьма.Вставить("Кому", ПолучателиПисьма);
		ПараметрыОтправкиПисьма.Вставить("Важность", ВажностьИнтернетПочтовогоСообщения.Высокая);
		
		Результат = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(СистемнаяУчетнаяЗапись, ПараметрыОтправкиПисьма);

	КонецЦикла;
	//ДИТ Моисеенко Ю.В. 03.11.2022 59323 -конец
	
КонецПроцедуры

#КонецОбласти

#Область Работа_С_ДО
// ДИТ US 64822 Сержантова А.С. Начало: 28.06.2023
Процедура СоздатьКарточкуПСЦвДО(СписокДокументовПСЦ, ОтправлятьУведомлениеОбОшибках = Ложь) Экспорт  
	
	Прокси = ВебСервисы_сервер.ПолучитьПрокси("ВебСервисОбменаСДО", Истина);
	
	// отправляем состояние в веб-сервис 1С:ДО
	ИмяМетода = "FileAndDocumentData";
	ИмяОперации = "CreateApproval"; 
	
	Попытка
		//Получаем параметры метода
		ТипWSПараметра = Прокси.ФабрикаXDTO.Пакеты.Получить(ИмяМетода).Получить(ИмяОперации);
	Исключение
		//Евросиб Каблов 13.01.2026 ( Ticket#0426699
		ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Подключение к вебсервису 1С:ДО'"),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПредставлениеОшибки);
		//Евросиб Каблов 13.01.2026 ) Ticket#0426699
		Возврат; // нет подключения к веб-сервису	
	КонецПопытки;
			
	//Создаем параметр на основе типа и заполняем значение параметров
	WSПараметр = Прокси.ФабрикаXDTO.Создать(ТипWSПараметра);    
	
	// ДИТ BUG 79699 ТА 81720 Сержантова А.С. Начало: 04.03.2024
	//Запись = Новый ЗаписьXML;
	//
	//Запись.УстановитьСтроку("UTF-8"); 
	//Запись.ЗаписатьОбъявлениеXML();
	//
	//Запись.ЗаписатьНачалоЭлемента("Protocols");
	//
	//Запись.ЗаписатьНачалоАтрибута("xmlns:xsi");		
	//Запись.ЗаписатьТекст(XMLСтрока("http://www.w3.org/2001/XMLSchema-instance"));		
	//Запись.ЗаписатьКонецАтрибута(); //xmlns:xsi 
	//
	//Запись.ЗаписатьНачалоАтрибута("xmlns:xs");		
	//Запись.ЗаписатьТекст(XMLСтрока("http://www.w3.org/2001/XMLSchema"));		
	//Запись.ЗаписатьКонецАтрибута(); //xmlns:xs
	//
	//Запись.ЗаписатьНачалоАтрибута("xmlns");		
	//Запись.ЗаписатьТекст(XMLСтрока("XMLDocuments"));		
	//Запись.ЗаписатьКонецАтрибута(); //xmlns
	// ДИТ BUG 79699 ТА 81720 Сержантова А.С. Конец: 04.03.2024
		
	Для каждого СтрДокумента Из СписокДокументовПСЦ Цикл
		
		Попытка
			
			ДокументПСЦ = СтрДокумента.Ссылка; 
			// ДИТ BUG 79699 ТА 81720 Сержантова А.С. Начало: 04.04.2024
			//Евросиб Каблов 28.06.2024 ( #67092
			//РеквизитыПСЦ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументПСЦ, 
			//"Автор,ОтветственныйМенеджер,Договор,НачалоДействия,ОкончаниеДействия,ДействуетДоСогласованияНовыхУсловий,ПСЦПоставщика,НомерПСЦ,ДатаПСЦ,ПодписанСДвухСторон,НетиповойПротокол");
			Если ТипЗнч(ДокументПСЦ) = Тип("ДокументСсылка.ПСЦПоставщика") Тогда
				РеквизитыПСЦ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументПСЦ, 
				"Автор,ОтветственныйМенеджер,Договор,НачалоДействия,ОкончаниеДействия,ДействуетДоСогласованияНовыхУсловий,НомерПСЦ,ДатаПСЦ,ПодписанСДвухСторон,Типовой,Контрагент");
				РеквизитыПСЦ.Вставить("ПСЦПоставщика", Истина);
				РеквизитыПСЦ.Вставить("НетиповойПротокол", Не РеквизитыПСЦ.Типовой);
				//Евросиб Шевченко А.В. 20.05.2025 US 85366 TA 108364
				сРук = ОтветственныеЛица_сервер.ПолучитьРуководителя(РеквизитыПСЦ.Контрагент, РеквизитыПСЦ.ДатаПСЦ, неопределено, Неопределено, Истина);
				РеквизитыПСЦ.Вставить("ФИОРук", сРук.ФИОРус);
				//Евросиб Шевченко А.В. 20.05.2025 US 85366 TA 108364
			Иначе
				РеквизитыПСЦ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументПСЦ, 
				"Автор,ОтветственныйМенеджер,Договор,НачалоДействия,ОкончаниеДействия,ДействуетДоСогласованияНовыхУсловий,ПСЦПоставщика,НомерПСЦ,ДатаПСЦ,ПодписанСДвухСторон,НетиповойПротокол,Контрагент");
				//Евросиб Шевченко А.В. 20.05.2025 US 85366 TA 108364
				сРук = ОтветственныеЛица_сервер.ПолучитьРуководителя(РеквизитыПСЦ.Контрагент, РеквизитыПСЦ.ДатаПСЦ, неопределено, Неопределено, Ложь);
				РеквизитыПСЦ.Вставить("ФИОРук", сРук.ФИОРус);
				//Евросиб Шевченко А.В. 20.05.2025 US 85366 TA 108364
			КонецЕсли;
			// ДИТ BUG 79699 ТА 81720 Сержантова А.С. Конец: 04.04.2024
			
			//Евросиб Каблов 18.08.2025 ( #112391
			ОшибкиЗаполнения = Новый Массив;
			Если Не ЗначениеЗаполнено(РеквизитыПСЦ.Автор) Тогда
				ОшибкиЗаполнения.Добавить("В Протоколе не указан Автор");
			КонецЕсли;		
			Если Не ЗначениеЗаполнено(РеквизитыПСЦ.ОтветственныйМенеджер) Тогда
				ОшибкиЗаполнения.Добавить("В Протоколе не указан Ответственный менеджер");
			КонецЕсли;
			Если ЗначениеЗаполнено(ОшибкиЗаполнения) Тогда
				ТекстОшибки = СтрСоединить(ОшибкиЗаполнения, Символы.ПС);
				РегистрыСведений.ИсторияОбменов.ЗафиксироватьИнформациюОбИсторииОбмена(ДокументПСЦ, Перечисления.УзлыОбмена.ДО, Истина, ТекстОшибки);
				Продолжить;
			КонецЕсли;
			//Евросиб Каблов 18.08.2025 ) #112391
			
			//Получаем данные для заполнения запроса
			УстановитьПривилегированныйРежим(Истина);
			СвойстваАвтора = Пользователи.СвойстваПользователяИБ(РеквизитыПСЦ.Автор.ИдентификаторПользователяИБ);
			
			СвойстваОтветственного = Пользователи.СвойстваПользователяИБ(РеквизитыПСЦ.ОтветственныйМенеджер.ИдентификаторПользователяИБ);
			УстановитьПривилегированныйРежим(Ложь);
			ГУИДДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыПСЦ.Договор, "ИдентификаторМСД");   
			ДопускаетПродление = ЗначениеЗаполнено(РеквизитыПСЦ.ОкончаниеДействия) и РеквизитыПСЦ.ДействуетДоСогласованияНовыхУсловий;
			ПереченьВложенныхФайлов = СформироватьВложенныеФайлыДляПСЦ(ДокументПСЦ);    
			
			Мт = РегистрыСведений.ПротоколОбменов.СоздатьНаборЗаписей();
			Мт.Отбор.Объект.Установить(ДокументПСЦ);
			Мт.Отбор.УзелОбмена.Установить(Перечисления.УзлыОбмена.ДО);
			Мт.Отбор.ДействиеПриОбмене.Установить(Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
			Мт.Прочитать();
			ГУИДвДО = "";
			Если Мт.Количество() > 0 Тогда
				ГУИДвДО = Мт[0].УИДИсточника;
			КонецЕсли;    
			
			// ДИТ BUG 79699 ТА 81720 Сержантова А.С. Начало: 04.04.2024
			Если не ЗначениеЗаполнено(ГУИДДоговора) Тогда
				
				//Евросиб Каблов 18.08.2025 ( #112391
				//ЗаписьЖурналаРегистрации(НСтр("ru = 'Подключение к вебсервису 1С:ДО'"),
				//	УровеньЖурналаРегистрации.Ошибка,,,
				//	"В договоре не заполнен ГУИД МСД "+РеквизитыПСЦ.Договор);
				ТекстОшибки = СтрШаблон("В договоре '%1' не заполнен ГУИД МСД", РеквизитыПСЦ.Договор);	
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Подключение к вебсервису 1С:ДО'"),
					УровеньЖурналаРегистрации.Ошибка,,,
					ТекстОшибки);
				//Евросиб Каблов 18.08.2025 ) #112391

				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("ДействиеПриОбмене", Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
				СтруктураПоиска.Вставить("УзелОбмена", Перечисления.УзлыОбмена.ДО);
				СтруктураПоиска.Вставить("Объект", ДокументПСЦ);
				
				СтруктураДанных = Новый Структура;
				СтруктураДанных.Вставить("ДатаОбмена", ТекущаяДата()); 
				СтруктураДанных.Вставить("УИДИсточника", ГУИДвДО);
				СтруктураДанных.Вставить("ЗагрузкаПодтверждена", Ложь);
				Сообщение = РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных, "");
				
				//Евросиб Каблов 18.08.2025 ( #112391
				РегистрыСведений.ИсторияОбменов.ЗафиксироватьИнформациюОбИсторииОбмена(ДокументПСЦ, Перечисления.УзлыОбмена.ДО, Истина, ТекстОшибки);
				//Евросиб Каблов 18.08.2025 ) #112391
				
				Если ОтправлятьУведомлениеОбОшибках Тогда
					//Отправка письма в техподдержку
					ОтправитьПисьмоОбОшибкахОбменаДКДО("Ошибка при переносе ПСЦ " + ДокументПСЦ + " из Датакор в Документооборот." + Символы.ПС  
								+ "У договора " + РеквизитыПСЦ.Договор + " отсутствует ГУИД. Необходимо внести в договор ГУИД МСД", ДокументПСЦ);
				КонецЕсли;
				Продолжить;
			КонецЕсли;
			// ДИТ BUG 79699 ТА 81720 Сержантова А.С. Конец: 04.04.2024
			
			//Евросиб Каблов 28.06.2024 ( #67092
			//Если ДокументПСЦ.ПСЦПоставщика Тогда
			Если РеквизитыПСЦ.ПСЦПоставщика Тогда
			//Евросиб Каблов 28.06.2024 )
				ТипДокумента = "Протокол сдц (подрядчик)";	
			Иначе	
				ТипДокумента = "Протокол сдц";
			КонецЕсли;   
			
			// ДИТ BUG 79699 ТА 81720 Сержантова А.С. Начало: 04.03.2024
			Запись = Новый ЗаписьXML;
			
			Запись.УстановитьСтроку("UTF-8"); 
			Запись.ЗаписатьОбъявлениеXML();
			
			Запись.ЗаписатьНачалоЭлемента("Protocols");
			
			Запись.ЗаписатьНачалоАтрибута("xmlns:xsi");		
			Запись.ЗаписатьТекст(XMLСтрока("http://www.w3.org/2001/XMLSchema-instance"));		
			Запись.ЗаписатьКонецАтрибута(); //xmlns:xsi 
			
			Запись.ЗаписатьНачалоАтрибута("xmlns:xs");		
			Запись.ЗаписатьТекст(XMLСтрока("http://www.w3.org/2001/XMLSchema"));		
			Запись.ЗаписатьКонецАтрибута(); //xmlns:xs
			
			Запись.ЗаписатьНачалоАтрибута("xmlns");		
			Запись.ЗаписатьТекст(XMLСтрока("XMLDocuments"));		
			Запись.ЗаписатьКонецАтрибута(); //xmlns
			// ДИТ BUG 79699 ТА 81720 Сержантова А.С. Конец: 04.03.2024
			
			Запись.ЗаписатьНачалоЭлемента("Protocol");   
			
			Запись.ЗаписатьНачалоЭлемента("ApplicationName");
			Запись.ЗаписатьТекст(XMLСтрока("Протокол (" + РеквизитыПСЦ.НомерПСЦ + " от " + Формат(РеквизитыПСЦ.ДатаПСЦ, "ДФ=dd.MM.yyyy") + ")"));		
			Запись.ЗаписатьКонецЭлемента(); //ApplicationName - имя протокола 
			
			Запись.ЗаписатьНачалоЭлемента("ApplicationType");
			Запись.ЗаписатьТекст(XMLСтрока(ТипДокумента));		
			Запись.ЗаписатьКонецЭлемента(); //ApplicationType – описывает тип документа
			
			Запись.ЗаписатьНачалоЭлемента("Number");
			Запись.ЗаписатьТекст(XMLСтрока(РеквизитыПСЦ.НомерПСЦ));		
			Запись.ЗаписатьКонецЭлемента(); //Number 
			
			Запись.ЗаписатьНачалоЭлемента("DateCreation");
			Запись.ЗаписатьТекст(XMLСтрока(РеквизитыПСЦ.ДатаПСЦ));		
			Запись.ЗаписатьКонецЭлемента(); //DateCreation – дата создания 
			
			Запись.ЗаписатьНачалоЭлемента("DateStart");
			Запись.ЗаписатьТекст(XMLСтрока(РеквизитыПСЦ.НачалоДействия));		
			Запись.ЗаписатьКонецЭлемента(); //DateStart – дата начала действия
			
			Запись.ЗаписатьНачалоЭлемента("DateEnd");
			Запись.ЗаписатьТекст(XMLСтрока(РеквизитыПСЦ.ОкончаниеДействия));		
			Запись.ЗаписатьКонецЭлемента(); //DateEnd – дата окончания действия  
			
			Запись.ЗаписатьНачалоЭлемента("Extend");
			Запись.ЗаписатьТекст(XMLСтрока(ДопускаетПродление));		
			Запись.ЗаписатьКонецЭлемента(); //Extend - допускает ли продление 
			
			Запись.ЗаписатьНачалоЭлемента("Author");
			Запись.ЗаписатьТекст(XMLСтрока(СвойстваАвтора.ПользовательОС));		
			Запись.ЗаписатьКонецЭлемента(); //Author 
			
			Запись.ЗаписатьНачалоЭлемента("GUIDContract");
			Запись.ЗаписатьТекст(XMLСтрока(ГУИДДоговора));		
			Запись.ЗаписатьКонецЭлемента(); //GUIDContract – идентификатор договора(идентификатор объекта 1с), строка длинной 36, по шаблону в XML схеме
			
			Если ЗначениеЗаполнено(ГУИДвДО) Тогда
				Запись.ЗаписатьНачалоЭлемента("GUIDProtocol");
				Запись.ЗаписатьТекст(XMLСтрока(ГУИДвДО));		
				Запись.ЗаписатьКонецЭлемента(); //GUIDProtocol – внутренний идентификатор созданного документа во внешней системе
			КонецЕсли;
			
			Запись.ЗаписатьНачалоЭлемента("ExternalLink");
			Запись.ЗаписатьТекст(XMLСтрока(ДокументПСЦ.УникальныйИдентификатор()));		
			Запись.ЗаписатьКонецЭлемента(); //ExternalLink – ссылка на объект в текущей системе   
			
			Запись.ЗаписатьНачалоЭлемента("ExternalSystemID");
			Запись.ЗаписатьТекст(XMLСтрока("Data Core"));		
			Запись.ЗаписатьКонецЭлемента(); //ExternalSystemID 
			
			Запись.ЗаписатьНачалоЭлемента("Signed");
			Запись.ЗаписатьТекст(XMLСтрока(РеквизитыПСЦ.ПодписанСДвухСторон));		
			Запись.ЗаписатьКонецЭлемента(); //Signed
			
			Запись.ЗаписатьНачалоЭлемента("Comment");
			Запись.ЗаписатьТекст(XMLСтрока(""));		
			Запись.ЗаписатьКонецЭлемента(); //Comment  
			
			Для каждого СтрФайла Из ПереченьВложенныхФайлов Цикл
				
				Запись.ЗаписатьНачалоЭлемента("Files");
				
				Запись.ЗаписатьНачалоЭлемента("Name");
				Запись.ЗаписатьТекст(XMLСтрока(СтрФайла.Имя));		
				Запись.ЗаписатьКонецЭлемента(); //Name – имя файла
				
				Запись.ЗаписатьНачалоЭлемента("Extension");
				Запись.ЗаписатьТекст(XMLСтрока(СтрФайла.Расширение));		
				Запись.ЗаписатьКонецЭлемента(); //Extension – расширение передаваемого файла 
				
				Запись.ЗаписатьНачалоЭлемента("GUID");
				Запись.ЗаписатьТекст(XMLСтрока(СтрФайла.ГуидФайла));		
				Запись.ЗаписатьКонецЭлемента(); //GUID – гуид передаваемого файла
				
				Запись.ЗаписатьНачалоЭлемента("DeleteMark");    
				Запись.ЗаписатьТекст(XMLСтрока(СтрФайла.ПометкаУдаления)); 
				Запись.ЗаписатьКонецЭлемента(); //DeleteMark - пометка удаления

				Запись.ЗаписатьНачалоЭлемента("BinaryData");
				Запись.ЗаписатьТекст(XMLСтрока(СтрФайла.Файл));		
				Запись.ЗаписатьКонецЭлемента(); //BinaryData - Тип base64Binary – закодированный файл 
				
				Запись.ЗаписатьКонецЭлемента(); //Files	
				
			КонецЦикла;
			
			Запись.ЗаписатьНачалоЭлемента("ResponsibleManager");
			Запись.ЗаписатьТекст(XMLСтрока(СвойстваОтветственного.ПользовательОС));		
			Запись.ЗаписатьКонецЭлемента(); //ResponsibleManager
			
			////Евросиб Шевченко А.В. 20.05.2025 US 85366 TA 108364   //Временно закомментировано для тестирования по задаче US 110873
			//Если РеквизитыПСЦ.ПСЦПоставщика Тогда
			//	Запись.ЗаписатьНачалоЭлемента("CounterpartySignatory");	
			//Иначе
			//	Запись.ЗаписатьНачалоЭлемента("CounterpartyHead");
			//КонецЕсли;	
			//Запись.ЗаписатьТекст(XMLСтрока(РеквизитыПСЦ.ФИОРук));		
			//Запись.ЗаписатьКонецЭлемента();
			////Евросиб Шевченко А.В. 20.05.2025 US 85366 TA 108364
			
			Запись.ЗаписатьНачалоЭлемента("AtypicalProtocol");
			Запись.ЗаписатьТекст(XMLСтрока(РеквизитыПСЦ.НетиповойПротокол));		
			Запись.ЗаписатьКонецЭлемента(); //AtypicalProtocol
			
			Запись.ЗаписатьКонецЭлемента(); //Protocol  
			
			// ДИТ BUG 79699 ТА 81720 Сержантова А.С. Начало: 04.03.2024
			//КонецЦикла;
			// ДИТ BUG 79699 ТА 81720 Сержантова А.С. Конец: 04.03.2024	
			
			Запись.ЗаписатьКонецЭлемента(); //Protocols
			
			ЗапросXML = Запись.Закрыть();
			
		Исключение
			
			ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Подключение к вебсервису 1С:ДО'"),
				УровеньЖурналаРегистрации.Ошибка,,,
				ПредставлениеОшибки);
				
			ТекстОшибки = "Ошибка при подключении к веб-сервису. " + ПредставлениеОшибки;
			РегистрыСведений.ИсторияОбменов.ЗафиксироватьИнформациюОбИсторииОбмена(ДокументПСЦ, Перечисления.УзлыОбмена.ДО, Истина, ТекстОшибки);
			
			ЗапросXML = Неопределено;
			
		КонецПопытки;
		
		//Евросиб Каблов 17.12.2025 ( Ticket#0426699
		ОтветXML = Неопределено;
		//Евросиб Каблов 17.12.2025 ) Ticket#0426699
		Если ЗначениеЗаполнено(ЗапросXML) Тогда
			Попытка
				ОтветВебСервиса = "out";
				//Вызываем метод веб-сервиса
				ОтветXML = Прокси.CreateApproval(
				ЗапросXML,
				ОтветВебСервиса);
			Исключение				
				//Сообщить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Подключение к вебсервису 1С:ДО'"),
				УровеньЖурналаРегистрации.Ошибка,,,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				// ДИТ #112391 Дедуник Д.О. Начало: 17.07.2025
				ТекстОшибки = "Ошибка при подключении к веб-сервису. " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				РегистрыСведений.ИсторияОбменов.ЗафиксироватьИнформациюОбИсторииОбмена(ДокументПСЦ, Перечисления.УзлыОбмена.ДО, Истина, ТекстОшибки);
				// ДИТ #112391 Дедуник Д.О. Конец: 17.07.2025
				
				ОтветВебСервиса = "";
				
			КонецПопытки;
		КонецЕсли;
		
		Если НЕ ОтветXML = Истина Тогда  
			// ответ не успешен
			
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Подключение к вебсервису 1С:ДО'"),
				УровеньЖурналаРегистрации.Ошибка,,,
				"При запросе:
				|"+ЗапросXML+"
				|не удалось получить успешный ответ.
				|"+ОтветВебСервиса);   
			// ДИТ BUG 79699 ТА 81720 Сержантова А.С. Начало: 29.02.2024	
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("ДействиеПриОбмене", Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
			СтруктураПоиска.Вставить("УзелОбмена", Перечисления.УзлыОбмена.ДО);
			СтруктураПоиска.Вставить("Объект", ДокументПСЦ);
			
			СтруктураДанных = Новый Структура;
			СтруктураДанных.Вставить("ДатаОбмена", ТекущаяДата()); 
			СтруктураДанных.Вставить("УИДИсточника", ГУИДвДО);
			СтруктураДанных.Вставить("ЗагрузкаПодтверждена", Ложь);
			Сообщение = РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных, ОтветВебСервиса);  
			
			Если ОтправлятьУведомлениеОбОшибках Тогда
				//Отправка письма в техподдержку 
				ТаблицаДанных = ВебСервисы_сервер.УниверсальныйПарсерXML(ОтветВебСервиса, "Protocol"); 
				ТекстОшибки = "";
				Для каждого СтрОтвета Из ТаблицаДанных Цикл
					ТекстОшибки = ТекстОшибки + ?(ТекстОшибки <> "", Символы.ПС, "") + СтрОтвета.Comment; 	
				КонецЦикла;  
				Если ТекстОшибки <> "" Тогда
					ОтправитьПисьмоОбОшибкахОбменаДКДО(ТекстОшибки, ДокументПСЦ);
				КонецЕсли;
			КонецЕсли;
			// ДИТ BUG 79699 ТА 81720 Сержантова А.С. Конец: 29.02.2024
			
			// ДИТ #112391 Дедуник Д.О. Начало: 17.07.2025
			РегистрыСведений.ИсторияОбменов.ЗафиксироватьИнформациюОбИсторииОбмена(ДокументПСЦ, Перечисления.УзлыОбмена.ДО, Истина, ОтветВебСервиса);
			// ДИТ #112391 Дедуник Д.О. Конец: 17.07.2025

		Иначе
			ТаблицаДанных = ВебСервисы_сервер.УниверсальныйПарсерXML(ОтветВебСервиса, "Protocol");
			// ДИТ Ticket 0390645 ТА 112121 Дедуник Д.О. Начало: 17.07.2025
			//Отбор = Новый Структура("Номер");
			Отбор = Новый Структура("УИД");
			// ДИТ Ticket 0390645 ТА 112121 Дедуник Д.О. Конец: 17.07.2025
			Для каждого СтрокаОтвета Из ТаблицаДанных Цикл
				// ДИТ Ticket 0390645 ТА 112121 Дедуник Д.О. Начало: 17.07.2025
				//Отбор.Номер = СтрокаОтвета.Number;
				Отбор.УИД = СтрокаОтвета.GUIDExternalSystem;
				// ДИТ Ticket 0390645 ТА 112121 Дедуник Д.О. Конец: 17.07.2025
				Ответ = СписокДокументовПСЦ.НайтиСтроки(Отбор);		
				Если Ответ.Количество() = 1 Тогда
					Ответ[0].Ссылка_В_ДО = СтрокаОтвета.ExternalLink;
					Ответ[0].Сообщение = СтрокаОтвета.Comment; 
					
					// ДИТ BUG 79699 ТА 81720 Сержантова А.С. Начало: 29.02.2024  
					// Было:
					//РегистрыСведений.ПротоколОбменов.ЗаписатьУИДИсточника(
					//СтрокаОтвета.GUIDProtocol, Перечисления.ДействияПриОбмене.ВыгрузкаДанных, Перечисления.УзлыОбмена.ДО, Ответ[0].Ссылка, 0); 
					// Стало:				
					СтруктураПоиска = Новый Структура;
					СтруктураПоиска.Вставить("ДействиеПриОбмене", Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
					СтруктураПоиска.Вставить("УзелОбмена", Перечисления.УзлыОбмена.ДО);
					СтруктураПоиска.Вставить("Объект", Ответ[0].Ссылка);
					
					СтруктураДанных = Новый Структура;
					СтруктураДанных.Вставить("ДатаОбмена", ТекущаяДата());
					СтруктураДанных.Вставить("УИДИсточника", СтрокаОтвета.GUIDProtocol);
					СтруктураДанных.Вставить("ЗагрузкаПодтверждена", Истина);
					Сообщение = РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных); 
					// ДИТ BUG 79699 ТА 81720 Сержантова А.С. Конец: 29.02.2024
					
					// ДИТ #112391 Дедуник Д.О. Начало: 17.07.2025
					РегистрыСведений.ИсторияОбменов.ЗафиксироватьИнформациюОбИсторииОбмена(ДокументПСЦ, Перечисления.УзлыОбмена.ДО, Ложь);
					// ДИТ #112391 Дедуник Д.О. Конец: 17.07.2025

				КонецЕсли;   
			КонецЦикла;
		КонецЕсли;
		
		// ДИТ BUG 79699 ТА 81720 Сержантова А.С. Начало: 04.03.2024
	КонецЦикла;
	// ДИТ BUG 79699 ТА 81720 Сержантова А.С. Конец: 04.03.2024
		
КонецПроцедуры

// ДИТ US 64822 Сержантова А.С. Начало: 28.06.2023
Функция СформироватьВложенныеФайлыДляПСЦ(ДокументПСЦ) 
	
	ТЗФайлы = Новый ТаблицаЗначений;   
	ТЗФайлы.Колонки.Добавить("Имя");
	ТЗФайлы.Колонки.Добавить("Расширение"); 
	ТЗФайлы.Колонки.Добавить("ПометкаУдаления");
	ТЗФайлы.Колонки.Добавить("Файл"); 
	ТЗФайлы.Колонки.Добавить("ГуидФайла");
	
	// прикрепляем ПФ Протокола для ПСЦ клиента
	// ДИТ BUG 79699 ТА 82943 Сержантова А.С. Начало: 03.04.2024
	// Было:
	//Если не ДокументПСЦ.ПСЦПоставщика Тогда //и ЗначениеЗаполнено(ДокументПСЦ.ФорматПротокола)
	//Стало:
	//Евросиб Коханенко Н.А. 03.04.2025 (( #102319
	//если это Типовой ПСЦПоставщика с типом Автоперевозки, то тоже ищем прикрепленный файл
	//Если ЗначениеЗаполнено(ДокументПСЦ.ФорматПротокола) Тогда 
	Если ЗначениеЗаполнено(ДокументПСЦ.ФорматПротокола)
		//Евросиб Коханенко Н.А. 24.07.2025 (( #115134 
		//ИЛИ (ДокументПСЦ.Типовой
		ИЛИ (ТипЗнч(ДокументПСЦ) = Тип("ДокументСсылка.ПСЦПоставщика") //реквизит Типовой есть только у ПСЦПоставщика
			И ДокументПСЦ.Типовой
		//Евросиб Коханенко Н.А. 24.07.2025 )) #115134 
			И ДокументПСЦ.ВидУслугПоставщика = ПредопределенноеЗначение("Справочник.ВидыУслугПоставщиков.Автоперевозки")) Тогда
	//Евросиб Коханенко Н.А. 03.04.2025 )) #102319 
	// ДИТ BUG 79699 ТА 82943 Сержантова А.С. Конец: 03.04.2024	
		
		ИмяФайлаПФ = "Протокол " + СтрЗаменить(ДокументПСЦ.НомерПСЦ,"/","-") + " от " + Формат(ДокументПСЦ.ДатаПСЦ, "ДФ=dd.MM.yyyy");  
		
		Запрос = Новый Запрос;
		Запрос.Текст =    
		// ДИТ BUG 82479 ТА 84966 Сержантова А.С. Начало: 23.05.2024
		// Было:
		//"ВЫБРАТЬ ПЕРВЫЕ 1 
		//Стало:
		"ВЫБРАТЬ 
		// ДИТ BUG 82479 ТА 84966 Сержантова А.С. Конец: 23.05.2024
		|	Файлы.Ссылка КАК Файл,
		|	Файлы.Наименование КАК Имя,
		|	Файлы.Расширение КАК Расширение,
		|	Файлы.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|ГДЕ
		|	Файлы.ВладелецФайла = &ВладелецФайла  
		// ДИТ BUG 82479 ТА 84966 Сержантова А.С. Начало: 23.05.2024
		// Было:
		//|	И Файлы.Наименование ПОДОБНО ""%"" + &ИмяФайла + ""%"""; 
		//Стало:
		|	И Файлы.Наименование ПОДОБНО &ИмяФайла";
		// ДИТ BUG 82479 ТА 84966 Сержантова А.С. Конец: 23.05.2024
		
		Запрос.УстановитьПараметр("ВладелецФайла", ДокументПСЦ);  
		// ДИТ BUG 82479 ТА 84966 Сержантова А.С. Начало: 23.05.2024 
		// выбираем все протоколы по шаблону наименования, возможно ранее были помеченные на удаление или с другим номером/датой
		// Было:
		//Запрос.УстановитьПараметр("ИмяФайла", ИмяФайлаПФ); 
		//Стало:
		Запрос.УстановитьПараметр("ИмяФайла", "Протокол % от %");
		// ДИТ BUG 82479 ТА 84966 Сержантова А.С. Конец: 23.05.2024
		
		РезультатЗапроса = Запрос.Выполнить();
		Если не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать(); 
			// ДИТ BUG 82479 ТА 84966 Сержантова А.С. Начало: 23.05.2024
			// Было:
			//Выборка.Следующий(); 
			//Стало: 
			ЕстьАктуальныйПротокол = Ложь;
			Пока Выборка.Следующий() Цикл
				Если Выборка.Имя = ИмяФайлаПФ и не Выборка.ПометкаУдаления Тогда
					ЕстьАктуальныйПротокол = Истина;	
				КонецЕсли;
			// ДИТ BUG 82479 ТА 84966 Сержантова А.С. Конец: 23.05.2024
				ДвоичныеДанныеФайла = РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.Файл,Ложь); 
				Если ДвоичныеДанныеФайла <> Неопределено Тогда
					СтрокаПФ = Base64Строка(ДвоичныеДанныеФайла);   
					НС = ТЗФайлы.Добавить();
					НС.Файл 			= СтрокаПФ;  
					НС.Расширение 		= Выборка.Расширение;
					НС.Имя 				= Выборка.Имя; 
					НС.ПометкаУдаления 	= Выборка.ПометкаУдаления; 
					НС.ГуидФайла 		= Выборка.Файл.УникальныйИдентификатор(); 
				КонецЕсли;    
			// ДИТ BUG 82479 ТА 84966 Сержантова А.С. Начало: 23.05.2024
			КонецЦикла;
			Если не ЕстьАктуальныйПротокол Тогда
				МассивОбъектов = Новый Массив;
				МассивОбъектов.Добавить(ДокументПСЦ);
				//Евросиб Каблов 18.12.2024 ( #67092
				//ТабДокПротокола = Документы.ПСЦ.ИнтеллектуальныйОпределительФорматаПротокола(МассивОбъектов,,Новый СписокЗначений);	  
				ТипДокументаПСЦ = ТипЗнч(ДокументПСЦ);
				Если ТипДокументаПСЦ = Тип("ДокументСсылка.ПСЦПоставщика") Тогда
					//Евросиб Коханенко Н.А. 03.04.2025 (( #102319 
					//ТабДокПротокола = Документы.ПСЦПоставщика.НапечататьТиповойПротокол(МассивОбъектов);
					Если ДокументПСЦ.Типовой
						И ДокументПСЦ.ВидУслугПоставщика = ПредопределенноеЗначение("Справочник.ВидыУслугПоставщиков.Автоперевозки") Тогда
						ТабДокПротокола = Документы.ПСЦПоставщика.НапечататьТиповойПротоколАвтоперевозки(МассивОбъектов);
					Иначе
						ТабДокПротокола = Документы.ПСЦПоставщика.НапечататьТиповойПротокол(МассивОбъектов);
					КонецЕсли;
					//Евросиб Коханенко Н.А. 03.04.2025 )) #102319 
				Иначе
					ТабДокПротокола = Документы.ПСЦ.ИнтеллектуальныйОпределительФорматаПротокола(МассивОбъектов,,Новый СписокЗначений);
				КонецЕсли;
				//Евросиб Каблов 18.12.2024 )
				
				ИмяФайла = КаталогВременныхФайлов() + ИмяФайлаПФ + ".pdf";
				ТабДокПротокола.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.PDF);    
				ПрикрепленныйФайл = РаботаСФайлами.ДобавитьФайлСДиска(ДокументПСЦ, ИмяФайла);
				ДвоичныеДанныеФайла = Новый ДвоичныеДанные(ИмяФайла);   
				СтрокаПФ = Base64Строка(ДвоичныеДанныеФайла); 
				НС = ТЗФайлы.Добавить();
				НС.Файл 			= СтрокаПФ;  
				НС.Расширение 		= "pdf";   
				НС.ПометкаУдаления	= Ложь;
				НС.Имя 				= "Протокол " + СтрЗаменить(ДокументПСЦ.НомерПСЦ,"/","-") + " от " + ДокументПСЦ.ДатаПСЦ;  
				НС.ГуидФайла 		= ПрикрепленныйФайл.УникальныйИдентификатор();    
				Попытка
					УдалитьФайлы(КаталогВременныхФайлов(), ИмяФайлаПФ + ".pdf");
				Исключение
				КонецПопытки;
			КонецЕсли;
			// ДИТ BUG 82479 ТА 84966 Сержантова А.С. Конец: 23.05.2024
		Иначе	
			МассивОбъектов = Новый Массив;
			МассивОбъектов.Добавить(ДокументПСЦ);
			//Евросиб Каблов 18.12.2024 ( #67092
			//ТабДокПротокола = Документы.ПСЦ.ИнтеллектуальныйОпределительФорматаПротокола(МассивОбъектов,,Новый СписокЗначений);	  
			ТипДокументаПСЦ = ТипЗнч(ДокументПСЦ);
			Если ТипДокументаПСЦ = Тип("ДокументСсылка.ПСЦПоставщика") Тогда
				//Евросиб Коханенко Н.А. 03.04.2025 (( #102319 
				//ТабДокПротокола = Документы.ПСЦПоставщика.НапечататьТиповойПротокол(МассивОбъектов);
				Если ДокументПСЦ.Типовой
					И ДокументПСЦ.ВидУслугПоставщика = ПредопределенноеЗначение("Справочник.ВидыУслугПоставщиков.Автоперевозки") Тогда
					ТабДокПротокола = Документы.ПСЦПоставщика.НапечататьТиповойПротоколАвтоперевозки(МассивОбъектов);
				Иначе
					ТабДокПротокола = Документы.ПСЦПоставщика.НапечататьТиповойПротокол(МассивОбъектов);
				КонецЕсли;
				//Евросиб Коханенко Н.А. 03.04.2025 )) #102319 
			Иначе
				ТабДокПротокола = Документы.ПСЦ.ИнтеллектуальныйОпределительФорматаПротокола(МассивОбъектов,,Новый СписокЗначений);
			КонецЕсли;
			//Евросиб Каблов 18.12.2024 )
			
			ИмяФайла = КаталогВременныхФайлов() + ИмяФайлаПФ + ".pdf";
			ТабДокПротокола.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.PDF);    
			ПрикрепленныйФайл = РаботаСФайлами.ДобавитьФайлСДиска(ДокументПСЦ, ИмяФайла);
			ДвоичныеДанныеФайла = Новый ДвоичныеДанные(ИмяФайла);   
			СтрокаПФ = Base64Строка(ДвоичныеДанныеФайла); 
			НС = ТЗФайлы.Добавить();
			НС.Файл 			= СтрокаПФ;  
			НС.Расширение 		= "pdf";   
			НС.ПометкаУдаления	= Ложь;
			НС.Имя 				= "Протокол " + СтрЗаменить(ДокументПСЦ.НомерПСЦ,"/","-") + " от " + ДокументПСЦ.ДатаПСЦ;  
			НС.ГуидФайла 		= ПрикрепленныйФайл.УникальныйИдентификатор();    
			Попытка
			    УдалитьФайлы(КаталогВременныхФайлов(), ИмяФайлаПФ + ".pdf");
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;	
		
	// прикрепляем лист согласования и скан-копию подписанного ПСЦ    
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Файлы.Ссылка КАК Файл,
		|	Файлы.Наименование КАК Имя,
		|	Файлы.Расширение КАК Расширение,
		|	Файлы.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|ГДЕ
		|	Файлы.ВладелецФайла = &ВладелецФайла
		|	И Файлы.Наименование ПОДОБНО ""%Лист согласования%""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Файлы.Ссылка,
		|	Файлы.Наименование,
		|	Файлы.Расширение,
		|	Файлы.ПометкаУдаления
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|ГДЕ
		|	Файлы.ВладелецФайла = &ВладелецФайла
		|	И Файлы.ЭтоСканКопия";
	
	Запрос.УстановитьПараметр("ВладелецФайла", ДокументПСЦ);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДвоичныеДанныеЛС = РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.Файл,Ложь); 
			Если ДвоичныеДанныеЛС <> Неопределено Тогда
				СтрокаПФ = Base64Строка(ДвоичныеДанныеЛС);   
				НС = ТЗФайлы.Добавить();
				НС.Файл 			= СтрокаПФ;  
				НС.Расширение 		= Выборка.Расширение; 
				НС.ПометкаУдаления	= Выборка.ПометкаУдаления;
				НС.Имя 				= Выборка.Имя;   
				НС.ГуидФайла 		= Выборка.Файл.УникальныйИдентификатор();
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли; 
	
	Возврат ТЗФайлы;
	
КонецФункции 
	
// ДИТ US 64822 Сержантова А.С. Начало: 30.06.2023
Функция ПодготовитьТаблицуПСЦдляОтправкиДО(СсылкиПСЦ) Экспорт
	
	Если ТипЗнч(СсылкиПСЦ) <> Тип("Массив") Тогда
		МассивСсылокПСЦ = Новый Массив;
		МассивСсылокПСЦ.Добавить(СсылкиПСЦ);
	Иначе
		МассивСсылокПСЦ = СсылкиПСЦ;
	КонецЕсли;   
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Ссылка");
	ТЗ.Колонки.Добавить("Номер");
	ТЗ.Колонки.Добавить("Ссылка_В_ДО");
	ТЗ.Колонки.Добавить("Сообщение");
	// ДИТ Ticket 0390645 ТА 112121 Дедуник Д.О. Начало: 17.07.2025
	ТЗ.Колонки.Добавить("УИД");
	// ДИТ Ticket 0390645 ТА 112121 Дедуник Д.О. Конец: 17.07.2025
	
	Для каждого Стр  Из МассивСсылокПСЦ Цикл
		НС = ТЗ.Добавить();
		НС.Ссылка = Стр;
		НС.Номер = Стр.НомерПСЦ;
		// ДИТ Ticket 0390645 ТА 112121 Дедуник Д.О. Начало: 17.07.2025
		НС.УИД = Строка(Стр.УникальныйИдентификатор());
		// ДИТ Ticket 0390645 ТА 112121 Дедуник Д.О. Конец: 17.07.2025
	КонецЦикла;

	Возврат ТЗ;
	
КонецФункции // ПодготовитьТаблицуПСЦдляОтправкиДО()

// Процедуры по рег заданию ВыгрузкаПСЦвДО 

// ДИТ BUG 79699 ТА 81720 Сержантова А.С. 29.02.2024
Процедура ВыполнитьПовторнуюОтправкуПСЦвДО() Экспорт 
	
	ДатаЗапускаРЗ = ТекущаяДата();
	
	ТаблицаПСЦДляСверкиФайлов = Новый ТаблицаЗначений;
	//Евросиб Каблов 17.12.2024 ( #98275
	//МассивТиповДокументов = Новый Массив;
	//МассивТиповДокументов.Добавить(Тип("ДокументСсылка.ПСЦ"));	
	//ТаблицаПСЦДляСверкиФайлов.Колонки.Добавить("Ссылка", Новый ОписаниеТипов(МассивТиповДокументов));
	ТаблицаПСЦДляСверкиФайлов.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.ПСЦ,ДокументСсылка.ПСЦПоставщика"));
	//Евросиб Каблов 17.12.2024 )
	КвалификаторыСтроки = Новый КвалификаторыСтроки(36);
	ТаблицаПСЦДляСверкиФайлов.Колонки.Добавить("GUIDProtocol", Новый ОписаниеТипов("Строка",,,,КвалификаторыСтроки));
	ТаблицаПСЦДляСверкиФайлов.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
	ТаблицаПСЦДляСверкиФайлов.Колонки.Добавить("ДатаОкончания", Новый ОписаниеТипов("Дата"));
	
	МассивДляПереотправки = Новый Массив;

	//1. Собираем данные для переотправки 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПСЦ.Ссылка КАК Ссылка,
		|	ПротоколОбменов.УИДИсточника КАК СсылкаНаВнутреннийДокументДО,
		|	ПСЦ.Дата КАК ДатаНачала,
		|	ПротоколОбменов.ДатаОбмена КАК ДатаОкончания
		|ИЗ
		|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПСЦ КАК ПСЦ
		|		ПО (ПротоколОбменов.Объект = ПСЦ.Ссылка)
		|			И (ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
		|			И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.ДО))
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ПСЦ.ДатаПереводаВСтатусПодписан, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
		|	И ПСЦ.Проведен
		|	И ПСЦ.ПСЦПоставщика
		|	И ПСЦ.СсылкаНаВнутреннийДокументДО <> """"
		|
		//Евросиб Каблов 17.12.2024 ( #98275		
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПСЦПоставщика.Ссылка,
		|	ПротоколОбменов.УИДИсточника,
		|	ПСЦПоставщика.Дата,
		|	ПротоколОбменов.ДатаОбмена
		|ИЗ
		|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПСЦПоставщика КАК ПСЦПоставщика
		|		ПО (ПротоколОбменов.Объект = ПСЦПоставщика.Ссылка)
		|			И (ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
		|			И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.ДО))
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ПСЦПоставщика.ДатаПереводаВСтатусПодписан, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
		|	И ПСЦПоставщика.Проведен
		|	И ПСЦПоставщика.СсылкаНаВнутреннийДокументДО <> """"
		|
		//Евросиб Каблов 17.12.2024 )
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПСЦ.Ссылка,
		|	ПротоколОбменов.УИДИсточника,
		|	ПСЦ.Дата,
		|	ПротоколОбменов.ДатаОбмена
		|ИЗ
		|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПСЦ КАК ПСЦ
		|		ПО ПротоколОбменов.Объект = ПСЦ.Ссылка
		|			И (ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
		|			И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.ДО))
		|ГДЕ
		|	(НАЧАЛОПЕРИОДА(ПСЦ.ДатаПереводаВСтатусПодписан, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
		|			ИЛИ НАЧАЛОПЕРИОДА(ПСЦ.ДатаСогласования, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ))
		|	И ПСЦ.Проведен
		|	И НЕ ПСЦ.ПСЦПоставщика
		|	И ПСЦ.СсылкаНаВнутреннийДокументДО <> """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПСЦ.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Переотправка
		|ИЗ
		|	Документ.ПСЦ КАК ПСЦ
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ПСЦ.ДатаПереводаВСтатусПодписан, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
		|	И ПСЦ.Проведен
		|	И ПСЦ.ПСЦПоставщика
		|	И ПСЦ.СсылкаНаВнутреннийДокументДО = """"
		|
		|ОБЪЕДИНИТЬ ВСЕ		
		|
		|ВЫБРАТЬ
		|	ПСЦ.Ссылка
		|ИЗ
		|	Документ.ПСЦ КАК ПСЦ
		|ГДЕ
		|	(НАЧАЛОПЕРИОДА(ПСЦ.ДатаПереводаВСтатусПодписан, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
		|			ИЛИ НАЧАЛОПЕРИОДА(ПСЦ.ДатаСогласования, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ))
		|	И ПСЦ.Проведен
		|	И НЕ ПСЦ.ПСЦПоставщика
		|	И ПСЦ.СсылкаНаВнутреннийДокументДО = """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПротоколОбменов.Объект
		|ИЗ
		|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		|ГДЕ
		|	ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных)
		|	И ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.ДО)
		|	И ПротоколОбменов.ДатаОбмена >= &НачалоВчерашнегоДня
		|	И НЕ ПротоколОбменов.ЗагрузкаПодтверждена
		|	И ТИПЗНАЧЕНИЯ(ПротоколОбменов.Объект) = ЗНАЧЕНИЕ(Документ.ПСЦ)
		//Евросиб Каблов 17.12.2024 ( #98275
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПСЦПоставщика.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПСЦПоставщика КАК ПСЦПоставщика
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ПСЦПоставщика.ДатаПереводаВСтатусПодписан, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
		|	И ПСЦПоставщика.Проведен
		|	И ПСЦПоставщика.СсылкаНаВнутреннийДокументДО = """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПротоколОбменов.Объект
		|ИЗ
		|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		|ГДЕ
		|	ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных)
		|	И ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.ДО)
		|	И ПротоколОбменов.ДатаОбмена >= &НачалоВчерашнегоДня
		|	И НЕ ПротоколОбменов.ЗагрузкаПодтверждена
		|	И ТИПЗНАЧЕНИЯ(ПротоколОбменов.Объект) = ЗНАЧЕНИЕ(Документ.ПСЦПоставщика)
		//Евросиб Каблов 17.12.2024 )
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Переотправка.Ссылка КАК Ссылка
		|ИЗ
		|	ВТ_Переотправка КАК ВТ_Переотправка";
	
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ДатаЗапускаРЗ));    
	Запрос.УстановитьПараметр("НачалоВчерашнегоДня", НачалоДня(ДатаЗапускаРЗ) - 24*3600); 
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();  
	ВыборкаДляСверки = РезультатыЗапроса[0].Выбрать();
	
	// 1.1. Берем те, которые отправлялись ранее, проверяем соответствие вложений
	// - ПСЦ с клиентом (с текущей датой подписания или датой согласования)
	// - ПСЦ с поставщиком (с текущей датой подписания)
	// В этом блоке, если нашли расхождение в составе вложенных файлов, то добавим в массив для переотправки
	Пока ВыборкаДляСверки.Следующий() Цикл 
		Если не ЗначениеЗаполнено(ВыборкаДляСверки.СсылкаНаВнутреннийДокументДО) Тогда
			Продолжить;
		КонецЕсли;
		НС = ТаблицаПСЦДляСверкиФайлов.Добавить();
		НС.Ссылка = ВыборкаДляСверки.Ссылка;
		НС.GUIDProtocol = ВыборкаДляСверки.СсылкаНаВнутреннийДокументДО;  
		НС.ДатаНачала = ВыборкаДляСверки.ДатаНачала; 
		НС.ДатаОкончания = ВыборкаДляСверки.ДатаОкончания;
	КонецЦикла; 
	
	Если ТаблицаПСЦДляСверкиФайлов.Количество() Тогда
		Результат = Новый Структура("Успешно", Ложь);
		ЗапроситьВложенияПСЦвДОиСверить(ТаблицаПСЦДляСверкиФайлов, МассивДляПереотправки, Результат);
		
		Если не Результат.Успешно Тогда
			ЗаписьЖурналаРегистрации(НСтр("ru = 'РЗ. Переотправка ПСЦ в ДО'"),
						УровеньЖурналаРегистрации.Ошибка,,,
						"Не удалось сверить файлы отправленных ПСЦ за дату " + ДатаЗапускаРЗ);
		КонецЕсли;
	КонецЕсли;
	
	// 1.2. Берем те, которые не отправлялись или отправились с ошибкой
	// - об этом есть отметка в регистре Протокол обменов (вчера и сегодня)
	// - или ПСЦ с клиентом (с текущей датой подписания или датой согласования), где не заполнена ссылка на ПСЦ в ДО
	// - или ПСЦ с поставщиком (с текущей датой подписания), где не заполнена ссылка на ПСЦ в ДО
	ВыборкаДляПереотправки = РезультатыЗапроса[2].Выбрать();
	Пока ВыборкаДляПереотправки.Следующий() Цикл    
		Если МассивДляПереотправки.Найти(ВыборкаДляПереотправки.Ссылка) = Неопределено Тогда
			МассивДляПереотправки.Добавить(ВыборкаДляПереотправки.Ссылка);
		КонецЕсли;
	КонецЦикла;
	//Евросиб Каблов 17.12.2024 ( #98275
	МассивДляПереотправки = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивДляПереотправки);
	//Евросиб Каблов 17.12.2024 )
	ТаблицаДляОтправки = ПодготовитьТаблицуПСЦдляОтправкиДО(МассивДляПереотправки);
	СоздатьКарточкуПСЦвДО(ТаблицаДляОтправки, Истина); 
	
	Для каждого СтрокаПротокола Из ТаблицаДляОтправки Цикл
		Если ЗначениеЗаполнено(СтрокаПротокола.Ссылка_В_ДО) Тогда
			ПротоколОбъект = СтрокаПротокола.Ссылка.ПолучитьОбъект();
			ПротоколОбъект.СсылкаНаВнутреннийДокументДО = СтрокаПротокола.Ссылка_В_ДО;
			ПротоколОбъект.ОбменДанными.Загрузка = Истина;
		    ПротоколОбъект.Записать();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// ДИТ BUG 79699 ТА 81720 Сержантова А.С. 01.03.2024
Процедура ЗапроситьВложенияПСЦвДОиСверить(ТаблицаПСЦДляСверкиФайлов, МассивДляПереотправки, Результат)
	
	Прокси = ВебСервисы_сервер.ПолучитьПрокси("ВебСервисОбменаСДО");
	
	// отправляем состояние в веб-сервис 1С:ДО
	ИмяМетода = "FileAndDocumentData";
	ИмяОперации = "GetDocumentsFile"; 
	
	Попытка
		//Получаем параметры метода
		ТипWSПараметра = Прокси.ФабрикаXDTO.Пакеты.Получить(ИмяМетода).Получить(ИмяОперации);
	Исключение
		Возврат; // нет подключения к веб-сервису	
	КонецПопытки;
	
	Для каждого СтрДокумента Из ТаблицаПСЦДляСверкиФайлов Цикл   
		
		Запись = Новый ЗаписьXML;
		
		Запись.УстановитьСтроку("UTF-8"); 
		Запись.ЗаписатьОбъявлениеXML();
		
		Запись.ЗаписатьНачалоЭлемента("Protocols"); 
		
		Запись.ЗаписатьНачалоАтрибута("xmlns");		
		Запись.ЗаписатьТекст(XMLСтрока("XMLDocuments"));		
		Запись.ЗаписатьКонецАтрибута(); //xmlns
		
		Запись.ЗаписатьНачалоАтрибута("xmlns:xs");		
		Запись.ЗаписатьТекст(XMLСтрока("http://www.w3.org/2001/XMLSchema"));		
		Запись.ЗаписатьКонецАтрибута(); //xmlns:xs
		
		Запись.ЗаписатьНачалоАтрибута("xmlns:xsi");		
		Запись.ЗаписатьТекст(XMLСтрока("http://www.w3.org/2001/XMLSchema-instance"));		
		Запись.ЗаписатьКонецАтрибута(); //xmlns:xsi 
		
		Запись.ЗаписатьНачалоЭлемента("Protocol");   
		
		Запись.ЗаписатьНачалоЭлемента("DateStart");
		Запись.ЗаписатьТекст(XMLСтрока(НачалоДня(СтрДокумента.ДатаНачала)));		
		Запись.ЗаписатьКонецЭлемента();
		
		Запись.ЗаписатьНачалоЭлемента("DateEnd");
		Запись.ЗаписатьТекст(XMLСтрока(КонецДня(СтрДокумента.ДатаОкончания)));		
		Запись.ЗаписатьКонецЭлемента(); 
		
		Запись.ЗаписатьНачалоЭлемента("GUIDProtocol");
		Запись.ЗаписатьТекст(XMLСтрока(СтрДокумента.GUIDProtocol));		
		Запись.ЗаписатьКонецЭлемента();
		
		Запись.ЗаписатьНачалоЭлемента("NoBinaryData");
		Запись.ЗаписатьТекст(XMLСтрока(Ложь));		
		Запись.ЗаписатьКонецЭлемента();  
		
		Запись.ЗаписатьНачалоЭлемента("AllFiles");    
		Запись.ЗаписатьТекст(XMLСтрока(Истина));		
		Запись.ЗаписатьКонецЭлемента();
		
		Запись.ЗаписатьКонецЭлемента(); //Protocol    
		
		Запись.ЗаписатьКонецЭлемента(); //Protocols
		
		ЗапросXML = Запись.Закрыть();
		
		ОтветВебСервиса = "out";
		
		Попытка
			//Вызываем метод веб-сервиса
			ОтветXML = Прокси.GetDocumentsFile(
			ЗапросXML,
			ОтветВебСервиса);
		Исключение
			//Сообщить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Подключение к вебсервису 1С:ДО'"),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
		КонецПопытки;
		
		Если НЕ ОтветXML = Истина Тогда  
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Подключение к вебсервису 1С:ДО'"),
			УровеньЖурналаРегистрации.Ошибка,,СтрДокумента.Ссылка,
			"При запросе:
			|"+ЗапросXML+"
			|не удалось получить успешный ответ.
			|"+ОтветВебСервиса); 
			
			//письмо не отправляем, добавим автоматически в массив для переотправки 
			//ТаблицаДанных = ВебСервисы_сервер.УниверсальныйПарсерXML(ОтветВебСервиса, "Protocol"); 
			//ТекстОшибки = "";
			//Для каждого СтрОтвета Из ТаблицаДанных Цикл
			//	ТекстОшибки = ТекстОшибки + ?(ТекстОшибки <> "", Символы.ПС, "") + СтрОтвета.Comment; 	
			//КонецЦикла;  
			//Если ТекстОшибки <> "" Тогда
			//	ОтправитьПисьмоОбОшибкахОбменаДКДО(ТекстОшибки, СтрДокумента.Ссылка);
			//КонецЕсли;
            МассивДляПереотправки.Добавить(СтрДокумента.Ссылка);
		Иначе        
			Результат.Успешно = Истина;
			ТаблицаДанных = ВебСервисы_сервер.УниверсальныйПарсерXML(ОтветВебСервиса, "Protocol");   
			
			ПереченьВложенныхФайлов = СформироватьВложенныеФайлыДляПСЦ(СтрДокумента.Ссылка);    
			Если ПереченьВложенныхФайлов.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			Если ТаблицаДанных.Количество() = 0 и ПереченьВложенныхФайлов.Количество() <> 0 Тогда
				МассивДляПереотправки.Добавить(СтрДокумента.Ссылка);  
			Иначе
				Для каждого СтрокаВложенногоФайла Из ПереченьВложенныхФайлов Цикл
					СтруктураПоиска = Новый Структура("GUIDProtocol, Name, Extension", 
					СтрДокумента.GUIDProtocol, СтрокаВложенногоФайла.Имя, СтрокаВложенногоФайла.Расширение); 
					СтрокаФайлаДО = ТаблицаДанных.НайтиСтроки(СтруктураПоиска); 
					Если СтрокаФайлаДО.Количество() = 0 или 
						(СтрокаФайлаДО.Количество() <> 0 и СтрокаФайлаДО[0].BinaryData <> СтрокаВложенногоФайла.Файл) Тогда
						МассивДляПереотправки.Добавить(СтрДокумента.Ссылка);
					КонецЕсли;
				КонецЦикла; 	
			КонецЕсли;
			
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

// ДИТ BUG 79699 ТА 81720 Сержантова А.С. 04.04.2024
Процедура ОтправитьПисьмоОбОшибкахОбменаДКДО(ТекстОшибки, СсылкаПротокол)
	
	Если ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована Тогда
		Возврат;
	КонецЕсли;
	
	ПолучателиУведомлений = Константы.ПолучателиУведомленийОРегЗаданиях.Получить();
	Если Не ЗначениеЗаполнено(ПолучателиУведомлений) Тогда
		Возврат;
	КонецЕсли;	
	УчетнаяЗаписьПоУмолчаниюДоступна = РаботаСПочтовымиСообщениями.ПроверитьСистемнаяУчетнаяЗаписьДоступна();	
	Если УчетнаяЗаписьПоУмолчаниюДоступна = Ложь Тогда
		Возврат;
	КонецЕсли;	
	СистемнаяУчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	ПолучателиПисьма = Новый Массив;
	Если ТипЗнч(ПолучателиУведомлений) = Тип("СправочникСсылка.Пользователи") Тогда
		ЭлАдресПользователя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПолучателиУведомлений, Справочники.ВидыКонтактнойИнформации.EmailПользователя, , Истина);
		ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", ПолучателиУведомлений, ЭлАдресПользователя));
	Иначе	
		Для Каждого ТекущийПользователь Из ПолучателиУведомлений.Состав Цикл								
			ЭлАдресПользователя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ТекущийПользователь.Пользователь, Справочники.ВидыКонтактнойИнформации.EmailПользователя, , Истина);
			ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", ТекущийПользователь.Пользователь, ЭлАдресПользователя));
		КонецЦикла;
	КонецЕсли;
	
	ТекстПисьма = "ДОКУМЕНТ " + СсылкаПротокол;
	ТекстПисьма = ТекстПисьма + Символы.ПС + " ТЕКСТ ОШИБКИ: " + ТекстОшибки + Символы.ПС + Символы.ПС;
	
	ПараметрыОтправкиПисьма = Новый Структура;
	ПараметрыОтправкиПисьма.Вставить("ТипТекста", 	Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст);
	ПараметрыОтправкиПисьма.Вставить("Тема", 		"Ошибка отправки Протокола из ДК в ДО");
	ПараметрыОтправкиПисьма.Вставить("Тело", 		ТекстПисьма);		
	ПараметрыОтправкиПисьма.Вставить("Кому", 		ПолучателиПисьма);
	
	Попытка
		РезультатОтправки = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(СистемнаяУчетнаяЗапись, ПараметрыОтправкиПисьма);
	Исключение
		ЗаписьЖурналаРегистрации("ОтправкаПисьмаОбОшибкахОбменаДК_ДО",
							УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры	

// Евросиб(ДИТ) US 85722 ТА 86908 Сержантова А.С. 23.07.2024  

// Получает ссылку на договор контрагента в ДО
//
// Параметры:
// 	РеквизитыДоговора - Структура - Структура, содержащая поля ВидДоговора, ДатаНачала, ДатаОкончания, ИдентификаторМСД 
//
Функция ПолучитьСсылкуИзДОдляДоговораКонтрагента(РеквизитыДоговора) Экспорт

	Прокси = ВебСервисы_сервер.ПолучитьПрокси("ВебСервисОбменаСДО");
	
	ИмяМетода = "FileAndDocumentData";
	ИмяОперации = "GetDocuments"; 
	
	Попытка
		//Получаем параметры метода
		ТипWSПараметра = Прокси.ФабрикаXDTO.Пакеты.Получить(ИмяМетода).Получить(ИмяОперации);
	Исключение
		Возврат Неопределено; // нет подключения к веб-сервису	
	КонецПопытки;
			
	//Создаем параметр на основе типа и заполняем значение параметров
	WSПараметр = Прокси.ФабрикаXDTO.Создать(ТипWSПараметра);       
	
	Если РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
		ТипДокумента = "Договор с клиентом";	
	Иначе 	
		ТипДокумента = "Договор с подрядчиком"; 
	КонецЕсли;          
	
	Запись = Новый ЗаписьXML;
	
	Запись.УстановитьСтроку("UTF-8"); 
	Запись.ЗаписатьОбъявлениеXML();
	
	Запись.ЗаписатьНачалоЭлемента("DocumentData");
	
	Запись.ЗаписатьНачалоАтрибута("xmlns:xsi");		
	Запись.ЗаписатьТекст(XMLСтрока("http://www.w3.org/2001/XMLSchema-instance"));		
	Запись.ЗаписатьКонецАтрибута(); //xmlns:xsi 
	
	Запись.ЗаписатьНачалоАтрибута("xmlns:xs");		
	Запись.ЗаписатьТекст(XMLСтрока("http://www.w3.org/2001/XMLSchema"));		
	Запись.ЗаписатьКонецАтрибута(); //xmlns:xs
	
	Запись.ЗаписатьНачалоАтрибута("xmlns");		
	Запись.ЗаписатьТекст(XMLСтрока("XMLDocuments"));		
	Запись.ЗаписатьКонецАтрибута(); //xmlns
	
	Запись.ЗаписатьНачалоЭлемента("ApplicationType");
	Запись.ЗаписатьТекст(XMLСтрока(ТипДокумента));		
	Запись.ЗаписатьКонецЭлемента(); //ApplicationType – описывает тип документа
	
	Запись.ЗаписатьНачалоЭлемента("DateStart");
	Запись.ЗаписатьТекст(XMLСтрока(РеквизитыДоговора.ДатаНачала));		
	Запись.ЗаписатьКонецЭлемента(); //DateStart – дата начала действия
	
	Запись.ЗаписатьНачалоЭлемента("DateEnd");
	Запись.ЗаписатьТекст(XMLСтрока(РеквизитыДоговора.ДатаОкончания));		
	Запись.ЗаписатьКонецЭлемента(); //DateEnd – дата окончания действия   
	
	Запись.ЗаписатьНачалоЭлемента("ExternalSystemID");
	Запись.ЗаписатьТекст(XMLСтрока("Data Core"));		
	Запись.ЗаписатьКонецЭлемента(); //ExternalSystemID 
	
	Запись.ЗаписатьНачалоЭлемента("GUIDContract");
	Запись.ЗаписатьТекст(XMLСтрока(РеквизитыДоговора.ИдентификаторМСД));		
	Запись.ЗаписатьКонецЭлемента(); //GUIDContract – идентификатор договора(идентификатор объекта 1с), строка длинной 36, по шаблону в XML схеме 
	
	Запись.ЗаписатьКонецЭлемента(); //DocumentData
	
	ЗапросXML = Запись.Закрыть();
	
	ОтветВебСервиса = "out";
	
	Попытка
		//Вызываем метод веб-сервиса
		ОтветXML = Прокси.GetDocuments(
		ЗапросXML,
		ОтветВебСервиса);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Подключение к вебсервису 1С:ДО'"),
		УровеньЖурналаРегистрации.Ошибка,,,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Если НЕ ОтветXML = Истина Тогда  
		// ответ не успешен
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Подключение к вебсервису 1С:ДО'"),
		УровеньЖурналаРегистрации.Ошибка,,,
		"При запросе:
		|"+ЗапросXML+"
		|не удалось получить успешный ответ.
		|"+ОтветВебСервиса);   
	Иначе
		ТаблицаДанных = ВебСервисы_сервер.УниверсальныйПарсерXML(ОтветВебСервиса, "Protocol"); 
		Если ТаблицаДанных.Количество() Тогда
			Если ЗначениеЗаполнено(ТаблицаДанных[0].ExternalLink) Тогда
				Возврат ТаблицаДанных[0].ExternalLink;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат "";
		
КонецФункции 

//Евросиб(ДИТ), Беляев СЮ, US 89714 / TA 89717, 06-12-2024, начало
Функция ПолучитьПрисоединенныеФайлыИзДО(Документ, ГУИДДокумента = Неопределено) Экспорт
	
	ТаблицаФайлов = Новый ТаблицаЗначений;
	ТаблицаФайлов.Колонки.Добавить("Doc_Name", Новый ОписаниеТипов("Строка"));
	ТаблицаФайлов.Колонки.Добавить("File_GUID", Новый ОписаниеТипов("Строка"));
	ТаблицаФайлов.Колонки.Добавить("File_Name", Новый ОписаниеТипов("Строка"));
	ТаблицаФайлов.Колонки.Добавить("File_Type", Новый ОписаниеТипов("Строка"));
	ТаблицаФайлов.Колонки.Добавить("Original", Новый ОписаниеТипов("Булево"));
	ТаблицаФайлов.Колонки.Добавить("АдресВременногоХранилища");
	
	Если ЗначениеЗаполнено(Документ) И НЕ ЗначениеЗаполнено(ГУИДДокумента) Тогда
		
		Заголовок = Строка(Документ);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПротоколОбменов.УИДИсточника КАК УИДИсточника
			|ИЗ
			|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
			|ГДЕ
			|	ПротоколОбменов.Объект = &Объект
			|	И ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных)
			|	И ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.ДО)";
		
		Запрос.УстановитьПараметр("Объект", Документ);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
			ГУИДДокумента = ВыборкаДетальныеЗаписи.УИДИсточника;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГУИДДокумента) Тогда 
		
		// получим список актуальных файлов из 1С:ДО
		ИмяМетода = "FileAndDocumentData";
		ИмяОперации = "Get_FileInformation";
		
		//Прокси = ВебСервисы_сервер.ПолучитьПрокси("ВебСервисОбменаСДО");
		Прокси = ВебСервисы_сервер.ПолучитьПрокси("ВебСервисОбменаСДО");
		
		//Получаем тип параметра, который передается в метод Get_FileInformation.
		ТипWSПараметра = Прокси.ФабрикаXDTO.Пакеты.Получить(ИмяМетода).Получить(ИмяОперации);
		
		//Создаем параметр на основе типа и заполняем значение параметров
		WSПараметр = Прокси.ФабрикаXDTO.Создать(ТипWSПараметра);
		WSПараметр.Document_GUID 			= ГУИДДокумента;
		WSПараметр.Related_Docs_Required 	= "true"; // получаем файлы связанных документов в 1С:ДО
		
		Попытка
			//Вызываем метод веб-сервиса
			ОбъектXDTO = Прокси.Get_FileInformation(
				WSПараметр.Document_GUID,
				WSПараметр.Related_Docs_Required);
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Подключение к вебсервису 1С:ДО'"),
			   УровеньЖурналаРегистрации.Ошибка,,,
			   ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Возврат ТаблицаФайлов;
		КонецПопытки;
		
		Если ТипЗнч(ОбъектXDTO) <> Тип("ОбъектXDTO")
				ИЛИ ОбъектXDTO.Свойства().Получить("FileInfo") = Неопределено Тогда
			Возврат ТаблицаФайлов;
		КонецЕсли;
		
		Для Каждого СтрокаОбъектаXDTO Из ОбъектXDTO.FileInfo Цикл
			
			СтрокаТаблицыФайлов = ТаблицаФайлов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыФайлов, СтрокаОбъектаXDTO);

		КонецЦикла;
		
	КонецЕсли;
	
	Если ТаблицаФайлов.Количество()>0 Тогда
		//Получаем параметры метода
		ИмяМетода = "FileAndDocumentData";
		ИмяОперации = "Get_File";
		ТипWSПараметра = Прокси.ФабрикаXDTO.Пакеты.Получить(ИмяМетода).Получить(ИмяОперации);
		
		Для Каждого СтрокаТаблицыФайлов Из ТаблицаФайлов Цикл
			
			//Создаем параметр на основе типа и заполняем значение параметров
			WSПараметр = Прокси.ФабрикаXDTO.Создать(ТипWSПараметра);
			WSПараметр.File_GUID 	= СтрокаТаблицыФайлов.File_GUID;
			
			Попытка
				//Вызываем метод веб-сервиса
				ОбъектXDTO = Прокси.Get_File(
				WSПараметр.File_GUID);
			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Подключение к вебсервису 1С:ДО'"),
				УровеньЖурналаРегистрации.Ошибка,,,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
			
			Если ТипЗнч(ОбъектXDTO) <> Тип("ОбъектXDTO")
				ИЛИ ОбъектXDTO.Свойства().Получить("Extension") = Неопределено
				ИЛИ ОбъектXDTO.Свойства().Получить("BinaryData") = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Попытка
				АдресВременногоХранилища = ПоместитьВоВременноеХранилище(ОбъектXDTO.BinaryData, Новый УникальныйИдентификатор);
				СтрокаТаблицыФайлов.АдресВременногоХранилища = АдресВременногоХранилища;
			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Подключение к вебсервису 1С:ДО'"),
				УровеньЖурналаРегистрации.Ошибка,,,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаФайлов;
КонецФункции

// ДИТ Ticket 115001 Дедуник Д.О. Начало: 11.08.2025
Процедура ВыполнитьОтправкуПСЦвДО() Экспорт

	УзлыПланаОбмена = ПланыОбмена.ВыгрузкаДанных.ПолучитьУзелОбмена(Перечисления.УзлыОбмена.ДО);
	
	Если Не ЗначениеЗаполнено(УзлыПланаОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	НомерСообщения = 1;
	УзелПланаОбмена = УзлыПланаОбмена[0];
	ПланыОбмена.ВыбратьИзменения(УзелПланаОбмена, НомерСообщения);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПСЦИзменения.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПСЦ.Изменения КАК ПСЦИзменения
	|ГДЕ
	|	ПСЦИзменения.Узел.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.ДО)
	|	И ПСЦИзменения.НомерСообщения = &НомерСообщения
	|	И ПСЦИзменения.Ссылка.Проведен
	|	И ПСЦИзменения.Ссылка.ДатаСогласования <> &ПустаяДата
	|	И ВЫБОР
	|			КОГДА ПСЦИзменения.Ссылка.ПСЦПоставщика
	|				ТОГДА ПСЦИзменения.Ссылка.ПодписанСДвухСторон
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НЕ (ПСЦИзменения.Ссылка.Организация = &Организация
	|	И ПСЦИзменения.Ссылка.ТипКалькуляции В(&ИсключаемыеТипыКалькуляции))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПСЦПоставщикаИзменения.Ссылка
	|ИЗ
	|	Документ.ПСЦПоставщика.Изменения КАК ПСЦПоставщикаИзменения
	|ГДЕ
	|	ПСЦПоставщикаИзменения.Узел.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.ДО)
	|	И ПСЦПоставщикаИзменения.НомерСообщения = &НомерСообщения
	|	И ПСЦПоставщикаИзменения.Ссылка.Проведен
	|	И ПСЦПоставщикаИзменения.Ссылка.ПодписанСДвухСторон
	|	И ПСЦПоставщикаИзменения.Ссылка.ДатаСогласования <> &ПустаяДата";
	
	ИсключаемыеТипыКалькуляции = Новый Массив;
	ИсключаемыеТипыКалькуляции.Добавить(Перечисления.ТипыКалькуляций.МежсервисныеРасходы);
	ИсключаемыеТипыКалькуляции.Добавить(Перечисления.ТипыКалькуляций.МежсервисныеРасходыРеф);
	Запрос.УстановитьПараметр("ИсключаемыеТипыКалькуляции", ИсключаемыеТипыКалькуляции);
	Запрос.УстановитьПараметр("Узел", УзелПланаОбмена);
	Запрос.УстановитьПараметр("НомерСообщения", НомерСообщения);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	Запрос.УстановитьПараметр("Организация", Константы.ОсновнаяОрганизация.Получить());
	 
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
	    Возврат;
	КонецЕсли;
	
	Протоколы = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	ТаблицаДляОтправки = ПодготовитьТаблицуПСЦдляОтправкиДО(Протоколы);
	СоздатьКарточкуПСЦвДО(ТаблицаДляОтправки, Ложь);
	
	ПротоколыСОшибками = Новый Массив;
	
	Для Каждого Стр Из ТаблицаДляОтправки Цикл
		Если СтрНайти(Стр.Сообщение, "ОК") <> 0 Тогда
			ОбъектПСЦ = Стр.Ссылка.ПолучитьОбъект();
			ОбъектПСЦ.СсылкаНаВнутреннийДокументДО = Стр.Ссылка_В_ДО; 
			ОбъектПСЦ.Записать();
		Иначе
			ПротоколыСОшибками.Добавить(Стр.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	НачатьТранзакцию();
	
	ПланыОбмена.УдалитьРегистрациюИзменений(УзелПланаОбмена, НомерСообщения);
	
	Если ЗначениеЗаполнено(ПротоколыСОшибками) Тогда
		УзлыПланаОбмена = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(УзелПланаОбмена);
		ПланыОбмена.ЗарегистрироватьИзменения(УзлыПланаОбмена, ПротоколыСОшибками);
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

#КонецОбласти    

//Евросиб Каблов 12.10.2022 58752
Функция ПолучитьТаблицуТарифовПоставщиков() Экспорт
	
	ОписаниеТиповСтрока36 = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36));
	ОписаниеТиповСтрока30 = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(30));
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТарифыПоставщиков.Код КАК Код,
	|	ТарифыПоставщиков.Наименование КАК Наименование,
	|	ТарифыПоставщиков.Родитель.Код КАК КодРодителя,
	|	ТарифыПоставщиков.ЭтоГруппа КАК ЭтоГруппа,
	|	ТарифыПоставщиков.ПунктОтправления.Тип.Наименование КАК ТипЛокацииОтправления,
	|	ВЫБОР
	|		КОГДА ТарифыПоставщиков.ПунктОтправления.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.СтанцияЖД)
	|			ТОГДА ПОДСТРОКА(ТарифыПоставщиков.ПунктОтправления.КодЖДСтанции, 1, 5)
	|		КОГДА ТарифыПоставщиков.ПунктОтправления.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Порт)
	|			ТОГДА ТарифыПоставщиков.ПунктОтправления.КодПортаUNLOCODE
	|		КОГДА ТарифыПоставщиков.ПунктОтправления.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Терминал)
	|			ТОГДА ТарифыПоставщиков.ПунктОтправления.ПредставлениеВCodeco
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодЛокацииОтправления,
	|	ТарифыПоставщиков.ПунктНазначения.Тип.Наименование КАК ТипЛокацииНазначения,
	|	ВЫБОР
	|		КОГДА ТарифыПоставщиков.ПунктНазначения.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.СтанцияЖД)
	|			ТОГДА ПОДСТРОКА(ТарифыПоставщиков.ПунктНазначения.КодЖДСтанции, 1, 5)
	|		КОГДА ТарифыПоставщиков.ПунктНазначения.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Порт)
	|			ТОГДА ТарифыПоставщиков.ПунктНазначения.КодПортаUNLOCODE
	|		КОГДА ТарифыПоставщиков.ПунктНазначения.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Терминал)
	|			ТОГДА ТарифыПоставщиков.ПунктНазначения.ПредставлениеВCodeco
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодЛокацииНазначения,
	|	ТарифыПоставщиков.Поставщик.Код КАК ПоставщикКод,
	|	ТарифыПоставщиков.Поставщик.Наименование КАК ПоставщикНаименование,
	|	ТарифыПоставщиков.ЕИНормативнойДлительности КАК ТипДлительности,
	|	ТарифыПоставщиков.НормативнаяДлительность КАК НормаДлительности,
	|	ТарифыПоставщиков.Валюта.Код КАК ВалютаКод,
	|	ТарифыПоставщиков.ЕстьУслугиЭкспедитора КАК ЕстьУслугиЭкспедитора,
	|	ТарифыПоставщиков.ЕстьПредоставлениеКТК КАК ЕстьПредоставлениеКТК,
	|	ТарифыПоставщиков.ЕстьПредоставлениеВагона КАК ЕстьПредоставлениеВагона,
	|	ТарифыПоставщиков.ЕстьСкидка КАК ЕстьСкидка,
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|	ПРЕДСТАВЛЕНИЕ(ТарифыПоставщиков.СобственностьПеревозимогоКТК) КАК COC_SOC,
	//ок)
	|	ПРЕДСТАВЛЕНИЕ(ТарифыПоставщиков.ПринадлежностьТЕ) КАК COC_SOC,
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|	ТарифыПоставщиков.РазмерЛота КАК РазмерЛота,
	|	ТарифыПоставщиков.ПропускнаяСпособность КАК ПропускнаяСпособность,
	|	ТарифыПоставщиков.РазмерыКТК.(
	|		РазмерКТК.Размер КАК Размер
	|	) КАК РазмерыКТК,
	|	ТарифыПоставщиков.Ссылка КАК Ссылка,
	|	ТарифыПоставщиков.Родитель КАК Родитель,
	|	ТарифыПоставщиков.ТаблицаСтоимость.(
	|		От КАК От,
	|		До КАК До,
	|		Стоимость КАК Стоимость
	|	) КАК ТаблицаСтоимость
	|ИЗ
	|	Справочник.ТарифыПоставщиков КАК ТарифыПоставщиков
	|ГДЕ
	|	НЕ ТарифыПоставщиков.ПометкаУдаления
	|ИТОГИ ПО
	|	Ссылка ТОЛЬКО ИЕРАРХИЯ";
	
	ДеревоТарифов = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТаблицаТарифов = Новый ТаблицаЗначений;	
	Для Каждого Колонка Из ДеревоТарифов.Колонки Цикл		
		ТаблицаТарифов.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);		
	КонецЦикла;
	
	СкопироватьДеровоВТаблицу(ДеревоТарифов, ТаблицаТарифов);
	
	ТаблицаТарифов.Колонки.Вставить(1, "УИД", ОписаниеТиповСтрока36);	
	ТаблицаТарифов.Колонки.Вставить(4, "УИДРодителя", ОписаниеТиповСтрока36);
	ТаблицаТарифов.Колонки.Добавить("РазмерКТК", ОписаниеТиповСтрока);
	
	Для Каждого Стр Из ТаблицаТарифов Цикл
		
		Стр.УИД = Стр.Ссылка.УникальныйИдентификатор();
		
		Если ЗначениеЗаполнено(Стр.Родитель) Тогда
			Стр.УИДРодителя = Стр.Родитель.УникальныйИдентификатор();
		КонецЕсли;
		
		Если Не Стр.ЭтоГруппа Тогда
			РазмерыКТК = Стр.РазмерыКТК.ВыгрузитьКолонку("Размер");
			Стр.РазмерКТК = СтрСоединить(РазмерыКТК, "; ");
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаТарифов.Колонки.Удалить("РазмерыКТК");
	ТаблицаТарифов.Колонки.Удалить("Ссылка");
	ТаблицаТарифов.Колонки.Удалить("Родитель");
	
	Возврат ТаблицаТарифов;
	
КонецФункции

//Евросиб Каблов 12.10.2022 58752
Функция ПолучитьТаблицуОбязательныхОперацийПеревозок() Экспорт
	
	ОписаниеТиповСтрока36 = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36));
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбязательныеОперацииПеревозок.ТипУчастка1.Ссылка КАК ТипУчастка1Ссылка,
	|	ОбязательныеОперацииПеревозок.ТипУчастка1.Код КАК ТипУчастка1Код,
	|	ОбязательныеОперацииПеревозок.ТипУчастка2.Ссылка КАК ТипУчастка2Ссылка,
	|	ОбязательныеОперацииПеревозок.ТипУчастка2.Код КАК ТипУчастка2Код,
	|	ОбязательныеОперацииПеревозок.ОбязательнаяОперация.Ссылка КАК ОбязательнаяОперацияСсылка,
	|	ОбязательныеОперацииПеревозок.ОбязательнаяОперация.Код КАК ОбязательнаяОперацияКод
	|ИЗ
	|	РегистрСведений.ОбязательныеОперацииПеревозок КАК ОбязательныеОперацииПеревозок
	|ГДЕ
	|	НЕ ОбязательныеОперацииПеревозок.ТипУчастка1.ПометкаУдаления
	|	И НЕ ОбязательныеОперацииПеревозок.ТипУчастка2.ПометкаУдаления
	|	И НЕ ОбязательныеОперацииПеревозок.ОбязательнаяОперация.ПометкаУдаления";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Таблица.Колонки.Вставить(2, "ТипУчастка1УИД", ОписаниеТиповСтрока36);
	Таблица.Колонки.Вставить(5, "ТипУчастка2УИД", ОписаниеТиповСтрока36);
	Таблица.Колонки.Добавить("ОбязательнаяОперацияУИД", ОписаниеТиповСтрока36);
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ТипУчастка1Ссылка) Тогда
			СтрокаТаблицы.ТипУчастка1УИД = СтрокаТаблицы.ТипУчастка1Ссылка.УникальныйИдентификатор();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ТипУчастка2Ссылка) Тогда
			СтрокаТаблицы.ТипУчастка2УИД = СтрокаТаблицы.ТипУчастка2Ссылка.УникальныйИдентификатор();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ОбязательнаяОперацияСсылка) Тогда
			СтрокаТаблицы.ОбязательнаяОперацияУИД = СтрокаТаблицы.ОбязательнаяОперацияСсылка.УникальныйИдентификатор();
		КонецЕсли;		
		
	КонецЦикла;
	
	Таблица.Колонки.Удалить("ТипУчастка1Ссылка");
	Таблица.Колонки.Удалить("ТипУчастка2Ссылка");
	Таблица.Колонки.Удалить("ОбязательнаяОперацияСсылка");
	
	Возврат Таблица;
	
КонецФункции

#Область ОбщегоНазначения

Функция ПолучитьДанныеЧерезМакетСКД(МакетСКД, Параметры, СписокОтборов="",ВыводВДерево = Ложь, ВыводимыеПоля = Неопределено) Экспорт

	МассивСписокОтборов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СписокОтборов);
	СхемаКомпоновкиДанных = Справочники.Макеты.ПолучитьМакет(МакетСКД);
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	КомпоновкаДанныхКлиентСервер.УстановитьКоллекциюПараметров(Настройки, Параметры);
	Для каждого элОтбор Из МассивСписокОтборов Цикл
		Если Параметры.Свойство(элОтбор) И ЗначениеЗаполнено(Параметры[элОтбор]) Тогда
			КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(Настройки, элОтбор, Параметры[элОтбор], ВидСравненияКомпоновкиДанных.Равно);
		КонецЕсли; 
	КонецЦикла; 
	//Если Параметры.Свойство("УИДКонтрагента") И ЗначениеЗаполнено(Параметры.УИДКонтрагента) Тогда
	//	КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(Настройки, "УИДКонтрагента", Параметры.УИДКонтрагента, ВидСравненияКомпоновкиДанных.Равно);
	//КонецЕсли; 
	//Если Параметры.Свойство("УИДДоговораКонтрагента") И ЗначениеЗаполнено(Параметры.УИДДоговораКонтрагента) Тогда
	//	КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(Настройки, "УИДДоговора", Параметры.УИДДоговораКонтрагента, ВидСравненияКомпоновкиДанных.Равно);
	//КонецЕсли;          
	//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 107705 Начало 20.05.2025
	Если ВыводимыеПоля <> Неопределено Тогда
		КомпоновкаДанныхКлиентСервер.УстановитьВыбранныеПоляКомпоновкиДанных(Настройки, ВыводимыеПоля);	
	КонецЕсли;
	//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 107705 Конец 20.05.2025
	МакетКомпоновкиДанных = КомпоновкаДанныхСервер.ПолучитьМакетКомпоновки(СхемаКомпоновкиДанных, Настройки);
	Результат = КомпоновкаДанныхСервер.ВыгрузитьРезультатСКД(СхемаКомпоновкиДанных, Настройки,,ВыводВДерево);
	Возврат Результат;
	
КонецФункции
 
Функция ПолучитьЗначениеПоляОбъектаXDTOПоИмени(ОбъектXDTO, ИмяПоля, ТипЗначения = Неопределено, ПустоеЗначение = Неопределено)
	
	Если ОбъектXDTO.Свойства().Получить(ИмяПоля) <> Неопределено Тогда
		ПолеОбъекта = ОбъектXDTO[ИмяПоля];
	Иначе
		ПолеОбъекта = ПустоеЗначение;
	КонецЕсли;
		
	Если ТипЗнч(ПолеОбъекта) = Тип("ОбъектXDTO") Тогда
		ЗначениеПоля = ПустоеЗначение;
	ИначеЕсли ТипЗначения <> Неопределено Тогда
		Попытка
			ЗначениеПоля = XMLЗначение(ТипЗначения, ПолеОбъекта);
		Исключение
			Если ТипЗначения = Тип("Дата") И ТипЗнч(ПолеОбъекта) = Тип("Строка") Тогда
				Если СтрДлина(ПолеОбъекта) = 17 Тогда
					СтрокаДаты = СтрЗаменить(ПолеОбъекта, " ", "");
					СтрокаДаты = СтрЗаменить(СтрокаДаты, ":", "");
					ОписаниеТипа = Новый ОписаниеТипов("Дата");
					ЗначениеПоля = ОписаниеТипа.ПривестиЗначение(СтрокаДаты);
				КонецЕсли;			
			КонецЕсли;
		КонецПопытки;
	Иначе
		ЗначениеПоля = ПолеОбъекта;
	КонецЕсли;
	
	Возврат ЗначениеПоля;
	
КонецФункции

//Евросиб Каблов 12.10.2022 58752
Процедура СкопироватьДеровоВТаблицу(Дерево, Таблица) Экспорт
	
	СкопированныеСсылки = Новый Массив;
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		
		Если ЗначениеЗаполнено(СтрокаДерева.ЭтоГруппа) И СкопированныеСсылки.Найти(СтрокаДерева.Ссылка) = Неопределено Тогда
			СтрокаТаблицы = Таблица.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаДерева);
			СкопированныеСсылки.Добавить(СтрокаДерева.Ссылка);
		КонецЕсли;
		
		Если СтрокаДерева.Строки.Количество() Тогда
			СкопироватьСтрокиДереваВТаблицу(СтрокаДерева, Таблица);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//Евросиб Каблов 12.10.2022 58752
Процедура СкопироватьСтрокиДереваВТаблицу(Группа, Таблица) Экспорт
	
	Для Каждого СтрокаДерева Из Группа.Строки Цикл
		
		Если СтрокаДерева.Ссылка = Группа.Ссылка Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицы = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаДерева);
		
		Если СтрокаДерева.ЭтоГруппа Тогда
			СкопироватьСтрокиДереваВТаблицу(СтрокаДерева, Таблица);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//Евросиб Каблов 12.10.2022 58752
Функция ЗаписатьТаблицуВXML(Таблица, ИмяТаблицы = Неопределено) Экспорт
	
	ТипТаблицаЗначений = Тип("ТаблицаЗначений");
	
	Если Не ЗначениеЗаполнено(ИмяТаблицы) Тогда
		ИмяТаблицы = "Таблица";
	КонецЕсли;
	
	Запись = Новый ЗаписьXML();
	Запись.УстановитьСтроку();
	Запись.ЗаписатьОбъявлениеXML();
	Запись.ЗаписатьНачалоЭлемента(ИмяТаблицы);
	Для каждого СтрокаТаблицы из Таблица Цикл
		Запись.ЗаписатьНачалоЭлемента("СтрокаТаблицы");
		Для Каждого Колонка Из Таблица.Колонки Цикл
			Если ТипЗнч(СтрокаТаблицы[Колонка.Имя]) = ТипТаблицаЗначений Тогда
				ДобавитьТаблицуВXML(Запись, СтрокаТаблицы[Колонка.Имя], Колонка.Имя);
			Иначе
				Запись.ЗаписатьАтрибут(Колонка.Имя, XMLСтрока(СтрокаТаблицы[Колонка.Имя]));
			КонецЕсли;
		КонецЦикла;
		Запись.ЗаписатьКонецЭлемента();
	КонецЦикла;
	
	Запись.ЗаписатьКонецЭлемента();
	СтрокаXML = Запись.Закрыть();
	Возврат СтрокаXML;
	
КонецФункции

//Евросиб Каблов 12.10.2022 58752
Функция ДобавитьТаблицуВXML(Запись, Таблица, ИмяТаблицы = Неопределено) Экспорт
	
	ТипТаблицаЗначений = Тип("ТаблицаЗначений");
	
	Если Не ЗначениеЗаполнено(ИмяТаблицы) Тогда
		ИмяТаблицы = "Таблица";
	КонецЕсли;
	
	Запись.ЗаписатьНачалоЭлемента(ИмяТаблицы);
	
	Для каждого СтрокаТаблицы из Таблица Цикл
		Запись.ЗаписатьНачалоЭлемента("СтрокаТаблицы");
		Для Каждого Колонка Из Таблица.Колонки Цикл
			Если ТипЗнч(СтрокаТаблицы[Колонка.Имя]) = ТипТаблицаЗначений Тогда
				ДобавитьТаблицуВXML(Запись, СтрокаТаблицы[Колонка.Имя], Колонка.Имя);
			Иначе
				Запись.ЗаписатьАтрибут(Колонка.Имя, XMLСтрока(СтрокаТаблицы[Колонка.Имя]));
			КонецЕсли;
		КонецЦикла;
		Запись.ЗаписатьКонецЭлемента();
	КонецЦикла;
	
	Запись.ЗаписатьКонецЭлемента();
		
КонецФункции

#КонецОбласти

#Область ЗагрузкаОтТерминалов

Процедура ЗагрузаДанныхОтТерминалов() Экспорт
	// Евросиб Фролов (21.12.2021 TASK №43108
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ЗагрузкаДанныхОтТерминалов);
	
	КаталогФайлов = Константы.КаталогПолученияФайловСТерминалов.Получить();
	
	Если ПустаяСтрока(КаталогФайлов) Тогда
		ЗаписьЖурналаРегистрации(Обработки.ЗагрузкаДанныхОтТерминалов.ИмяСобытияЖурналаРегистрации(), 
									УровеньЖурналаРегистрации.Ошибка,
									,
									,
									"Не указан каталог расположения файлов от терминалов");
		Возврат;							
	Иначе
		Файл = Новый Файл(КаталогФайлов); 
		Если Не Файл.Существует() Тогда
			ЗаписьЖурналаРегистрации(Обработки.ЗагрузкаДанныхОтТерминалов.ИмяСобытияЖурналаРегистрации(), 
									УровеньЖурналаРегистрации.Ошибка,
									,
									,
									СтрШаблон("Не найден каталог с файлами от терминалов: ", КаталогФайлов));
			Возврат;						
		КонецЕсли;
	КонецЕсли; 
	
	Обработки.ЗагрузкаДанныхОтТерминалов.ЗагрузитьДанныеОтТерминала();	
	// Евросиб Фролов)
КонецПроцедуры

#КонецОбласти

//Евросиб Каблов 07.05.2021 Ticket#0226665
Процедура ВыгрузкаФактическихРасходовПоАкцептам() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ВыгрузкаФактическихРасходовПоАкцептам);
	
	Выгрузка = Обработки.ВыгрузкаФактическихРасходовПоАкцептам.Создать();
	Выгрузка.ВыгрузитьВSQLЗаТекущийПериодВО();
	
КонецПроцедуры

Процедура ОбъединениеПорожнихИГруженыхСделок() Экспорт
	ТаблицаПереноса = Документы.Сделка.ПолучитьСписокПорожнихГруженыхСделокДляОбъединения();
	Документы.Сделка.ОбъединитьПорожниеИГруженыеСделки(ТаблицаПереноса);
КонецПроцедуры

#Область Озон  
//Евросиб - Дубская 14.06.2022 #52244  

Функция ПолучитьОтвет(АдресСервиса, Заголовки, метод, СтруктураДанных, ИмяСобытия)   
	
	ЗапросHTTP = Новый HTTPЗапрос(метод, Заголовки);     
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураДанных);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	ЗапросHTTP.УстановитьТелоИзСтроки(СтрокаJSON, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
	HTTPСоединение = Новый HTTPСоединение(АдресСервиса,,,,,,Новый ЗащищенноеСоединениеOpenSSL); 
	Ответ = HTTPСоединение.ОтправитьДляОбработки(ЗапросHTTP);   
	СтрокаОтвета = Ответ.ПолучитьТелоКакСтроку("UTF-8");  
	Результат = Неопределено;
	Если Ответ.КодСостояния = 200 Тогда
		ЧтениеJSON    = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(СтрокаОтвета);
		Результат = ПрочитатьJSON(ЧтениеJSON);    
	Иначе
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,,СтрокаОтвета);
	КонецЕсли;   
	
	Возврат Результат; 
	
КонецФункции

Процедура ЗагрузитьПеревозкиОзон() Экспорт
	
	ДанныеПодключения = ?(ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована, 
							Справочники.НастройкиПрограммы.Озон_тестовый, Справочники.НастройкиПрограммы.Озон); 
	АдресСервиса = ДанныеПодключения.АдресСервиса;
	userName = ДанныеПодключения.userName;
	password = ДанныеПодключения.password;
	contractId = ДанныеПодключения.contractId;
	Контрагент = ДанныеПодключения.Контрагент; 
	Договор = ДанныеПодключения.Договор; 
	
	ПолучателиПисьма = Новый Массив;
	ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", "Адрес отслеживания", Пользователи_sd_сервер.ПолучитьEMAILПользователя(Договор.ОтветственныйЗаДоговор)));
	// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 30.11.2022
	// Было:
	//Если Договор.ОтветственныйЗаДоговор <> Договор.ОтветственныйЗаСопровождение Тогда 
	//	ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", "Адрес отслеживания", Пользователи_sd_сервер.ПолучитьEMAILПользователя(Договор.ОтветственныйЗаСопровождение)));
	//КонецЕсли; 
	//Стало: 
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Договор",				Договор);
	СтруктураПараметров.Вставить("ЦФО",					Справочники.ЦентрыФинансовойОтветственности.ОсновнойЦФО);
	СтруктураПараметров.Вставить("ТипОтветственного",	Перечисления.ТипыОтветственных.ОтветственныйЗаСопровождение);  
	мОтветственныйЗаСопровождение = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственного(СтруктураПараметров);
	Если Договор.ОтветственныйЗаДоговор <> мОтветственныйЗаСопровождение Тогда 
		ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", "Адрес отслеживания", Пользователи_sd_сервер.ПолучитьEMAILПользователя(мОтветственныйЗаСопровождение)));
	КонецЕсли;	
	// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 30.11.2022	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("userName", userName);
	СтруктураДанных.Вставить("password", password);
	
	РезультатData = ПолучитьОтвет(АдресСервиса, Заголовки, "/v1/token", СтруктураДанных, "Озон.ПолучениеТокена");
	
	Если РезультатData <> Неопределено Тогда
		Токен = РезультатData.access_token;     
	Иначе
		Возврат;
	КонецЕсли;
	
	//получим перевозки 
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("Authorization", "Bearer " + Токен);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("contractId", contractId);
	СтруктураДанных.Вставить("carriageType", "Expected"); 
	Если ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована = Ложь Тогда //это рабочая
		startDate = Формат(НачалоДня(ТекущаяДата()), "ДФ=yyyy-MM-ddTHH:mm:ss"); 
		СтруктураДанных.Вставить("startDate", startDate);      
	КонецЕсли;
	//endDate = Формат(ДатаОкончания, "ДФ=yyyy-MM-ddTHH:mm:ss"); 
	//СтруктураДанных.Вставить("endDate", endDate);
	
	РезультатData = ПолучитьОтвет(АдресСервиса, Заголовки, "/v1/carriage/list-get", СтруктураДанных, "Озон.ПолучениеСпискаПеревозок");
	
	Если РезультатData <> Неопределено Тогда
		Если РезультатData.resultCode <> 0 Тогда
			ЗаписьЖурналаРегистрации("Озон.ПолучениеСпискаПеревозок", УровеньЖурналаРегистрации.Ошибка,,,РезультатData.resultMessage);
			возврат;
		КонецЕсли;
        СписокПеревозок = РезультатData.carriages;
		Для каждого Стр Из СписокПеревозок Цикл
			//проверяем, что нет такой Заявки 
			День = число(Лев(Стр.date, 2));
			Месяц = число(Сред(Стр.date, 4, 2));
			Год = число(Прав(Стр.date, 4));   
			Дата = Дата(Год, Месяц, День); 
			id_строка = Строка(Стр.id);
			нашлиЗаявку = ПоискЗаявкиПоВнешнемуНомеру(id_строка); //Изменить на тип строка	
		
		    //если нет, тогда создаем Заявку
			Если Не нашлиЗаявку Тогда      
				Заявка = Документы.Заявка.СоздатьДокумент();
				Заявка.Заполнить(неопределено);   
				Заявка.Дата = Дата;
				Заявка.Контрагент = Контрагент;
				Заявка.Договор = Договор;
				Заявка.ВнешняяДата = Дата;
				Заявка.ВнешнийНомер = id_строка;          
				Заявка.ИсточникЗаявки = Перечисления.ИсточникЗаявок.ВебСайт;
				//Заявка.Автор = Договор.ОтветственныйЗаСопровождение;
				//Заявка.Редактор = Договор.ОтветственныйЗаСопровождение;
				НоваяСтрока = Заявка.СоставУслуги.Добавить();
				// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 30.11.2022
				// Было:
				//НоваяСтрока.АдресВыгрузки = НайтиЛокацию(Стр.destinationAddress, Договор.ОтветственныйЗаСопровождение);
				//НоваяСтрока.АдресПогрузки = НайтиЛокацию(Стр.sourceAddress, Договор.ОтветственныйЗаСопровождение); 
				//Стало:
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("Договор",				Договор);
				СтруктураПараметров.Вставить("ЦФО",					Справочники.ЦентрыФинансовойОтветственности.ОсновнойЦФО);
				СтруктураПараметров.Вставить("ТипОтветственного",	Перечисления.ТипыОтветственных.ОтветственныйЗаСопровождение);  
				мОтветственныйЗаСопровождение = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственного(СтруктураПараметров);
				НоваяСтрока.АдресВыгрузки = НайтиЛокацию(Стр.destinationAddress, мОтветственныйЗаСопровождение);
				НоваяСтрока.АдресПогрузки = НайтиЛокацию(Стр.sourceAddress, мОтветственныйЗаСопровождение);	
				// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 30.11.2022
				Заявка.Комментарий = "Создан автоматически при загрузке перевозок из Озон";
				Заявка.Записать(РежимЗаписиДокумента.Запись); 

				//отправляем оповещение   
				УчетнаяЗаписьПоУмолчанию = РаботаСПочтовымиСообщениями.ПроверитьСистемнаяУчетнаяЗаписьДоступна();
				Если УчетнаяЗаписьПоУмолчанию Тогда 
					СистемнаяУчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
					МассивПисем = новый Массив;
					ТекстПисьма = "Склад погрузки - " + Стр.sourceAddress;
					Тема = "Клиент " + Строка(Контрагент) + " опубликовал Заявку " + Заявка.Номер + " от " + Формат(Заявка.Дата, "ДФ=dd.MM.yyyy");
					ПараметрыОтправкиПисьма = новый Структура;
					ПараметрыОтправкиПисьма.Вставить("Тема", Тема);
					ПараметрыОтправкиПисьма.Вставить("Тело", ТекстПисьма);
					ПараметрыОтправкиПисьма.Вставить("ТипТекста", "HTML");
					ПараметрыОтправкиПисьма.Вставить("Кому", ПолучателиПисьма);
					МассивПисем.Добавить(ПараметрыОтправкиПисьма);
					РЕЗУЛЬТАТ = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(СистемнаяУчетнаяЗапись, ПараметрыОтправкиПисьма);
				КонецЕсли;
				
				//получить файлы по заявке и сохранить во вложенных файлах
				СтруктураДанных = Новый Структура;
				СтруктураДанных.Вставить("contractId", contractId);
				СтруктураДанных.Вставить("carriageId", Стр.id); 
				ДанныеПоДокументам = ПолучитьОтвет(АдресСервиса, Заголовки, "/v1/carriage/document-list-get", СтруктураДанных, "Озон.ПолучениеФайлов");
				               
				Если ДанныеПоДокументам <> Неопределено Тогда
					Если ДанныеПоДокументам.resultCode <> 0 Тогда
						ЗаписьЖурналаРегистрации("Озон.ПолучениеФайлов", УровеньЖурналаРегистрации.Ошибка,,,ДанныеПоДокументам.resultMessage);
					КонецЕсли;
					ДокументыПоПеревозке = ДанныеПоДокументам.documents;
					Для каждого Док Из ДокументыПоПеревозке Цикл
						СтруктураДанных = Новый Структура;
						СтруктураДанных.Вставить("contractId", contractId);
						СтруктураДанных.Вставить("id", Док.documentId);
						СтруктураДанных.Вставить("reportFormat", "PDF");
						ПечатнаяФорма = ПолучитьОтвет(АдресСервиса, Заголовки, "/v1/carriage/report-get", СтруктураДанных, "Озон.ПолучениеПечатнойФормы");
						
						Если ПечатнаяФорма <> Неопределено Тогда
							Если ПечатнаяФорма.resultCode <> 0 Тогда
								ЗаписьЖурналаРегистрации("Озон.ПолучениеПечатнойФормы", УровеньЖурналаРегистрации.Ошибка,,,ПечатнаяФорма.resultMessage);
							Иначе
								СохранитьФайлВЗаявке(Заявка.Ссылка, ПечатнаяФорма.reportData, Док.documentName); 
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;  
				КонецЕсли;
	
				ЗаписьЖурналаРегистрации("Озон.ПолучениеСпискаПеревозок", УровеньЖурналаРегистрации.Информация,,,"Создана заявка " + Строка(Заявка));
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;   
	
КонецПроцедуры

Функция ПоискЗаявкиПоВнешнемуНомеру(Номер)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Заявка.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Заявка КАК Заявка
	               |ГДЕ
	               |	НЕ Заявка.ПометкаУдаления
	               |	И Заявка.ВнешнийНомер = &ВнешнийНомер"; 
	Запрос.УстановитьПараметр("ВнешнийНомер", Номер);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Функция НайтиЛокацию(Наименование, Получатель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Локации.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Локации КАК Локации
	               |ГДЕ
	               |	Локации.Наименование ПОДОБНО &Наименование
	               |	И НЕ Локации.ПометкаУдаления";  
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Выборка = Запрос.Выполнить().Выбрать();   
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;      
	//отправляем сообщение, что нет такой локации   
	УчетнаяЗаписьПоУмолчанию = РаботаСПочтовымиСообщениями.ПроверитьСистемнаяУчетнаяЗаписьДоступна();
	Если УчетнаяЗаписьПоУмолчанию Тогда 
		СистемнаяУчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
		МассивПисем = новый Массив;
		ТекстПисьма = "Не найдена локация - " + Наименование;
		ПолучателиПисьма = Новый Массив;
		ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", "Адрес отслеживания", Пользователи_sd_сервер.ПолучитьEMAILПользователя(Получатель)));
		ПараметрыОтправкиПисьма = новый Структура;
		ПараметрыОтправкиПисьма.Вставить("Тема", "Озон. Не найдена локация");
		ПараметрыОтправкиПисьма.Вставить("Тело", ТекстПисьма);
		ПараметрыОтправкиПисьма.Вставить("ТипТекста", "HTML");
		ПараметрыОтправкиПисьма.Вставить("Кому", ПолучателиПисьма);
		МассивПисем.Добавить(ПараметрыОтправкиПисьма);
		РЕЗУЛЬТАТ = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(СистемнаяУчетнаяЗапись, ПараметрыОтправкиПисьма);
	КонецЕсли;
	ЗаписьЖурналаРегистрации("Озон.НеНайденаЛокация", УровеньЖурналаРегистрации.Предупреждение,,,Наименование);
	Возврат Неопределено;
		
КонецФункции

Процедура СохранитьФайлВЗаявке(Заявка, ДанныеПФ, Наименование) 
	
	ДвоичныеДанные = Base64Значение(ДанныеПФ);
	АдресХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные);     
	
	ПараметрыФайла = Новый Структура;
	ПараметрыФайла.Вставить("Автор", ПользователиКлиентСервер.ТекущийПользователь());
	ПараметрыФайла.Вставить("ВладелецФайлов", Заявка);
	ПараметрыФайла.Вставить("ИмяБезРасширения", Наименование);
	ПараметрыФайла.Вставить("РасширениеБезТочки", "pdf");
	ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", Неопределено); 
	ПараметрыФайла.Вставить("ХранитьВерсии", Истина);
	Файл = РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, АдресХранилища);
	
	УдалитьИзВременногоХранилища(АдресХранилища);
	
КонецПроцедуры  

Функция ОтправитьДатуПрибытияОзон(ВнешнийНомер, ПлановаяДатаПрибытия) Экспорт
	
	ДанныеПодключения = ?(ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована, 
							Справочники.НастройкиПрограммы.Озон_тестовый, Справочники.НастройкиПрограммы.Озон); 
	АдресСервиса = ДанныеПодключения.АдресСервиса;
	userName = ДанныеПодключения.userName;
	password = ДанныеПодключения.password;
	contractId = ДанныеПодключения.contractId;
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("userName", userName);
	СтруктураДанных.Вставить("password", password);
	
	РезультатData = ПолучитьОтвет(АдресСервиса, Заголовки, "/v1/token", СтруктураДанных, "Озон.ПолучениеТокена");
	
	Если РезультатData <> Неопределено Тогда
		Токен = РезультатData.access_token;     
	Иначе
		Возврат "Не удалось выполнить передачу данных. Подробности в журнале регистрации.";
	КонецЕсли;    
	
	Попытка
		Номер = Число(ВнешнийНомер);
	Исключение
		Возврат "Внешний номер не корректен";
	КонецПопытки;
	
	//Установка даты поставки на все отправления из перевозки 
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("Authorization", "Bearer " + Токен);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("contractId", contractId);
	СтруктураДанных.Вставить("carriageId", Номер);   
	moment = Формат(ПлановаяДатаПрибытия, "ДФ=yyyy-MM-ddTHH:mm:ssZ"); 
	СтруктураДанных.Вставить("moment", moment); 
	РезультатData = ПолучитьОтвет(АдресСервиса, Заголовки, "/v1/carriage/carriage-content-transfer-date-set", СтруктураДанных, "Озон.УстановкаДатыПоставки");
	
	Если РезультатData <> Неопределено Тогда
		Если РезультатData.resultCode <> 0 Тогда
			Возврат "Не удалось выполнить передачу данных. " + РезультатData.resultMessage; 
		Иначе
			Возврат "Данные переданы";
		КонецЕсли;
	Иначе   
		Возврат "Не удалось выполнить передачу данных. Подробности в журнале регистрации.";
	КонецЕсли;   
	
КонецФункции
//Евросиб - Дубская 14.06.2022 #52244
#КонецОбласти

#Область ЗагрузкаКурсовЦБР

Процедура ЗагрузкаКурсовВалютЦБР() Экспорт
	Обработки["ЗагрузкаКурсовВалютЦБРФ"].ЗагрузитьАктуальныйКурс();
КонецПроцедуры 

Функция ЗагрузитьКурсыВалютСЦБРФ(ДатаЗагрузки) Экспорт
	
	//Создаем прокси для обращения к внешнему веб-сервису,
	// передаем в функцию URI пространства имен, имя сервиса, имя порта.
	Прокси = WSСсылки.ЦБРФ.СоздатьWSПрокси(
	"http://web.cbr.ru/", "DailyInfo", "DailyInfoSoap");
	
	//Получаем тип параметра, который передается в метод GetCursOnDate.
	ТипWSПараметра = Прокси.ФабрикаXDTO.Пакеты.Получить(
	"http://web.cbr.ru/").Получить("GetCursOnDate");
	//Создаем параметр на основе типа и заполняем значение параметра On_Date.
	WSПараметр                  = Прокси.ФабрикаXDTO.Создать(ТипWSПараметра);
	WSПараметр.On_Date           = ДатаЗагрузки;
	
	//Вызываем метод веб-сервиса, записываем результат в переменную КурсыВалют.
	КурсыВалют = Прокси.GetCursOnDate(WSПараметр);
	
	// Перебираем таблицу ValuteCursOnDate, каждое значение таблицы
	// добавляем в таблицу на форме (колонки заполняем соответствующими значениями).
	
	Результат = Новый ТаблицаЗначений ;
	Результат.Колонки.Добавить("НазваниеВалюты") ;
	Результат.Колонки.Добавить("Номинал") ;
	Результат.Колонки.Добавить("ЦифровойКодВалюты") ;
	Результат.Колонки.Добавить("СимвольныйКодВалюты") ;
	Результат.Колонки.Добавить("КурсВалюты") ;
	
	
	Для Каждого Элемент Из КурсыВалют.GetCursOnDateResult.diffgram.ValuteData.ValuteCursOnDate Цикл 
		Строка = Результат.Добавить();
		Строка.НазваниеВалюты      = Элемент.Vname;
		Строка.Номинал             = Элемент.Vnom;
		Строка.ЦифровойКодВалюты   = Элемент.Vcode;
		Строка.СимвольныйКодВалюты = Элемент.VChCode;
		Строка.КурсВалюты          = Элемент.Vcurs;
	КонецЦикла;
	
	Возврат Результат ;
	
КонецФункции

Процедура РассылкаПриПроверкеНаличияЗаписиКурсовНаТекущуюДату() Экспорт  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КурсыВалют.Валюта КАК Валюта
	|ИЗ
	|	РегистрСведений.КурсыВалют КАК КурсыВалют
	|ГДЕ
	|	КурсыВалют.Период = &Период";   
	ДатаПроверки = НачалоДня(ТекущаяДата());
	Запрос.УстановитьПараметр("Период", ДатаПроверки);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		Тема = СтрШаблон("Отсутствуют курсы валют в DataCore на %1", Формат(ДатаПроверки, "ДФ=dd.MM.yyyy"));
		ТекстПисьма = "";
		ПолучателиПисьма = Новый Массив;
		
		СистемнаяУчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
		ПараметрыОтправкиПисьма = новый Структура;
		ПараметрыОтправкиПисьма.Вставить("Тема", Тема);
		ПараметрыОтправкиПисьма.Вставить("Тело", ТекстПисьма);
		ПараметрыОтправкиПисьма.Вставить("ТипТекста", "HTML");
		ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", "datacore@eurosib.biz", "datacore@eurosib.biz"));
		ПараметрыОтправкиПисьма.Вставить("Кому", ПолучателиПисьма);
		ПараметрыОтправкиПисьма.Вставить("Важность", ВажностьИнтернетПочтовогоСообщения.Высокая);
		
		Результат = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(СистемнаяУчетнаяЗапись, ПараметрыОтправкиПисьма);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ТЛ  

//Евросиб - Дубская 07.07.2022 #54080   
Функция ОбновитьДанныеЗапросаНаАвтоперевозку(XMLParams) Экспорт	
	//ДИТ - Шевченко А.В. 25.07.2022 #54974 - начало	
	ПараметрыXml = ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	
	//Евросиб Коханенко Н.А. 17.12.2025 (( #125251 
	ДатаИзКонстанты = Константы.ДатаПереходаНаСсылкиАдресовНаселенныхПунктов.Получить();
	Если ЗначениеЗаполнено(ДатаИзКонстанты) 
		И (ТекущаяДата() >= ДатаИзКонстанты) Тогда
		ОбменСсылкамиНаАдресаВНаселенныхПунктахАктивен = Истина;
	Иначе
		ОбменСсылкамиНаАдресаВНаселенныхПунктахАктивен = Ложь;
	КонецЕсли;	
	//Евросиб Коханенко Н.А. 17.12.2025 )) #125251 
	
	ТаблицаОтвета = Новый ТаблицаЗначений;
	
	ТаблицаОтвета.Колонки.Добавить("ГУИД");
	ТаблицаОтвета.Колонки.Добавить("НомерЗаказаНаТС");
	ТаблицаОтвета.Колонки.Добавить("ДатаСозданияЗаказаНаТС");
	ТаблицаОтвета.Колонки.Добавить("Ошибка");
	ТаблицаОбработанныхГуидов = ТаблицаОтвета.СкопироватьКолонки();
	
	
	МассивГуидов = ПараметрыXml.ВыгрузитьКолонку("ГУИД");
	
	ДеревоСсылок = Документы.ЗапросНаАвтоперевозку.ВыполнитьПоискЗапросаНаАвтоперевозкуПоГуидуСтроки(МассивГуидов);
	Для Каждого СтрокаДокумент Из ДеревоСсылок.Строки Цикл
		
		СоздатьЗадачуПередатьКлиентуДанныеПоАвтоперевозке 	       = Ложь;
		СоответствиеГуидСтрокиРелиз                                = Новый Соответствие;
		
		ЗапросОб = СтрокаДокумент.Ссылка.ПолучитьОбъект();
		СтруктураТаблицОформления = ЗапросОб.ПолучитьТаблицыОформленияИзХранилища();
		ТаблицаОбработанныхГуидов.Очистить();		
		Для Каждого СтрокаГУИД Из СтрокаДокумент.Строки Цикл
			
			ЗнчМассив = МассивГуидов.Найти(СтрокаГУИД.ГУИД);

			//Евросиб Коханенко Н.А. 21.02.2024 (( #81158
			//МассивГуидов.Удалить(ЗнчМассив);
			//СтруктураПоиска = Новый Структура("ГУИД",СтрокаГУИД.ГУИД);
			//СтрокаПараметрМассив = ПараметрыXml.НайтиСтроки(СтруктураПоиска);
			//СтрокаПараметр = СтрокаПараметрМассив[0];
			СтруктураПоиска = Новый Структура("ГУИД",СтрокаГУИД.ГУИД);
			СтрокаПараметрМассив = ПараметрыXml.НайтиСтроки(СтруктураПоиска);
			ИндексВСтрокеПараметров = 0;
			Пока ЗнчМассив <> Неопределено Цикл
				СтрокаПараметр = СтрокаПараметрМассив[ИндексВСтрокеПараметров];
				Если ИндексВСтрокеПараметров < СтрокаПараметрМассив.ВГраница() Тогда
					ИндексВСтрокеПараметров = ИндексВСтрокеПараметров + 1;
				КонецЕсли;
				МассивГуидов.Удалить(ЗнчМассив);
			//Евросиб Коханенко Н.А. 21.02.2024 )) #81158       
			
			// ДИТ US 82176 ТА 82559 Сержантова А.С. Начало: 25.03.2024
			КодТерминалаВыдачиБезНулей  = СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(СтрокаПараметр.ТерминалВыдачиКодФакт, "0", "СЛЕВА");  
			КодТерминалаСдачиБезНулей  = СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(СтрокаПараметр.ТерминалСдачиКодФакт, "0", "СЛЕВА");
			Если ЗначениеЗаполнено(СтрокаПараметр.ТерминалВыдачиКодФакт) и КодТерминалаВыдачиБезНулей <> "" Тогда
				ТерминалВыдачиФакт = Справочники.Локации.НайтиПоКоду(СтрокаПараметр.ТерминалВыдачиКодФакт); 
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаПараметр.ТерминалСдачиКодФакт) и КодТерминалаСдачиБезНулей <> "" Тогда
				ТерминалСдачиФакт = Справочники.Локации.НайтиПоКоду(СтрокаПараметр.ТерминалСдачиКодФакт); 
			КонецЕсли; 
			// ДИТ US 82176 ТА 82559 Сержантова А.С. Конец: 25.03.2024
			
			СтруктураПоиска = Новый Структура("ИдентификаторСтрокиТЧ",СтрокаГУИД.ГУИД);
			НайденныеСтроки = ЗапросОб.Контейнеры.НайтиСтроки(СтруктураПоиска);
			
			Для Каждого НайденнаяСтрока ИЗ НайденныеСтроки Цикл
				//ДИТ Шевченко А.В. 59965 25.11.2022 -начало
				ИзменилосьЗначенияВСтроке = Ложь;
				//ДИТ Шевченко А.В. 59965 25.11.2022 -конец
				Если ЗначениеЗаполнено(НайденнаяСтрока.СтатусЗаказаНаТС) И НайденнаяСтрока.СтатусЗаказаНаТС <> Перечисления.СтатусЗаказаНаТс[СтрЗаменить(СтрокаПараметр.СтатусЗаказаНаТс," ","")] Тогда
					ЗапросОб.ОбновитьТаблицуОформленияДокумента(СтруктураТаблицОформления.ТаблицаОформленияТЧ,"СтатусЗаказаНаТС",СтрокаПараметр.ГУИД);
				КонецЕсли;
				Если ЗначениеЗаполнено(НайденнаяСтрока.ДатаИВремяВывоза) И НайденнаяСтрока.ДатаИВремяВывоза <> СтрокаПараметр.ДатаИВремяВвозаВывоза Тогда
					ЗапросОб.ОбновитьТаблицуОформленияДокумента(СтруктураТаблицОформления.ТаблицаОформленияТЧ,"ДатаИВремяВывоза",СтрокаПараметр.ГУИД);
				КонецЕсли;
				Если ЗначениеЗаполнено(НайденнаяСтрока.ДатаИВремяСдачи) И НайденнаяСтрока.ДатаИВремяСдачи <> СтрокаПараметр.ДатаИВремяСдачи Тогда
					ЗапросОб.ОбновитьТаблицуОформленияДокумента(СтруктураТаблицОформления.ТаблицаОформленияТЧ,"ДатаИВремяСдачи",СтрокаПараметр.ГУИД);
				КонецЕсли;
				Если ЗначениеЗаполнено(НайденнаяСтрока.ДатаЗавершенияОперацииНаСкладеКлиента) И НайденнаяСтрока.ДатаЗавершенияОперацииНаСкладеКлиента <> СтрокаПараметр.ДатаЗавершенияОперацииНаСкладеКлиента Тогда
					ЗапросОб.ОбновитьТаблицуОформленияДокумента(СтруктураТаблицОформления.ТаблицаОформленияТЧ,"ДатаЗавершенияОперацииНаСкладеКлиента",СтрокаПараметр.ГУИД);
				КонецЕсли;
				Если ЗначениеЗаполнено(НайденнаяСтрока.ИтоговаяСтоимостьПеревозки) И НайденнаяСтрока.ИтоговаяСтоимостьПеревозки <> СтрокаПараметр.ИтоговаяСтоимостьПеревозки Тогда
					ЗапросОб.ОбновитьТаблицуОформленияДокумента(СтруктураТаблицОформления.ТаблицаОформленияТЧ,"ИтоговаяСтоимостьПеревозки",СтрокаПараметр.ГУИД);
				КонецЕсли;
				Если ЗначениеЗаполнено(НайденнаяСтрока.КонтейнерФакт) И НайденнаяСтрока.КонтейнерФакт <> СтрокаПараметр.КонтейнерФакт Тогда
					ЗапросОб.ОбновитьТаблицуОформленияДокумента(СтруктураТаблицОформления.ТаблицаОформленияТЧ,"КонтейнерФакт",СтрокаПараметр.ГУИД);
				КонецЕсли;
				
				//Евросиб Коханенко Н.А. 14.03.2024 (( #82183 
				Если ЗначениеЗаполнено(НайденнаяСтрока.ТерминалВыдачиФакт) И НайденнаяСтрока.ТерминалВыдачиФакт <> ТерминалВыдачиФакт Тогда
					ЗапросОб.ОбновитьТаблицуОформленияДокумента(СтруктураТаблицОформления.ТаблицаОформленияТЧ,"ТерминалВыдачиФакт",СтрокаПараметр.ГУИД);
				КонецЕсли;
				Если ЗначениеЗаполнено(НайденнаяСтрока.АдресСкладаФакт) И НайденнаяСтрока.АдресСкладаФакт <> СтрокаПараметр.АдресСкладаФакт Тогда
					ЗапросОб.ОбновитьТаблицуОформленияДокумента(СтруктураТаблицОформления.ТаблицаОформленияТЧ,"АдресСкладаФакт",СтрокаПараметр.ГУИД);
				КонецЕсли;
				Если ЗначениеЗаполнено(НайденнаяСтрока.ТерминалСдачиФакт) И НайденнаяСтрока.ТерминалСдачиФакт <> ТерминалСдачиФакт Тогда
					ЗапросОб.ОбновитьТаблицуОформленияДокумента(СтруктураТаблицОформления.ТаблицаОформленияТЧ,"ТерминалСдачиФакт",СтрокаПараметр.ГУИД);
				КонецЕсли;
				//Евросиб Коханенко Н.А. 14.03.2024 )) #82183 
				
				//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 начало
				//Если ЗначениеЗаполнено(НайденнаяСтрока.Перевозчик) И НайденнаяСтрока.Перевозчик <> СтрокаПараметр.НаименованиеКомпанииАвтоперевозчика Тогда
				//	ЗапросОб.ОбновитьТаблицуОформленияДокумента(СтруктураТаблицОформления.ТаблицаОформленияТЧ,"Перевозчик",СтрокаПараметр.ГУИД); 
				//	ИзменилосьЗначенияВСтроке = Истина;
				//КонецЕсли;
				//Если ЗначениеЗаполнено(НайденнаяСтрока.НомерАвто) И НайденнаяСтрока.НомерАвто <> СтрокаПараметр.НомерАвто Тогда
				//	ЗапросОб.ОбновитьТаблицуОформленияДокумента(СтруктураТаблицОформления.ТаблицаОформленияТЧ,"НомерАвто",СтрокаПараметр.ГУИД);
				//	ИзменилосьЗначенияВСтроке = Истина;
				//КонецЕсли;
				//Если ЗначениеЗаполнено(НайденнаяСтрока.ПаспортныеДанные) И НайденнаяСтрока.ПаспортныеДанные <> СтрокаПараметр.ПаспортныеДанные Тогда
				//	ЗапросОб.ОбновитьТаблицуОформленияДокумента(СтруктураТаблицОформления.ТаблицаОформленияТЧ,"ПаспортныеДанные",СтрокаПараметр.ГУИД);
				//	ИзменилосьЗначенияВСтроке = Истина;
				//КонецЕсли;
				//Если ЗначениеЗаполнено(НайденнаяСтрока.ФИОВодителя) И НайденнаяСтрока.ФИОВодителя <> СтрокаПараметр.ФИОВодителя Тогда
				//	ЗапросОб.ОбновитьТаблицуОформленияДокумента(СтруктураТаблицОформления.ТаблицаОформленияТЧ,"ФИОВодителя",СтрокаПараметр.ГУИД);
				//	ИзменилосьЗначенияВСтроке = Истина;
				//КонецЕсли;
				
				МассивКлючей = Новый Массив;
				МассивКлючей.Добавить(НайденнаяСтрока.КлючАналитикиПеревозки);
				ЗначениеПолейКлюча = Справочники.КлючиАналитикиПеревозки.КлючиАналитикиЗначенияПолейПоЭтапуПеревозки(МассивКлючей,СтрокаДокумент.Ссылка.ЭтапПеревозки);
				Перевозчик 		 = "";
				НомерАвто  		 = "";
				ПаспортныеДанные = "";
				ФИОВодителя      = "";
				Если ЗначениеПолейКлюча.Количество() > 0 Тогда
					Перевозчик 		 = ЗначениеПолейКлюча[0].Автоперевозчик;
					НомерАвто  		 = ЗначениеПолейКлюча[0].РегНомерТС;
					ПаспортныеДанные = ЗначениеПолейКлюча[0].ПаспортныеДанные;
					ФИОВодителя      = ЗначениеПолейКлюча[0].ФИОВодителя;
				КонецЕсли;	
				
				
				Если Перевозчик <> СтрокаПараметр.НаименованиеКомпанииАвтоперевозчика Тогда
					ЗапросОб.ОбновитьТаблицуОформленияДокумента(СтруктураТаблицОформления.ТаблицаОформленияТЧ,"Перевозчик",СтрокаПараметр.ГУИД); 
					ИзменилосьЗначенияВСтроке = Истина;
				КонецЕсли;
				Если НомерАвто <> СтрокаПараметр.НомерАвто Тогда
					ЗапросОб.ОбновитьТаблицуОформленияДокумента(СтруктураТаблицОформления.ТаблицаОформленияТЧ,"НомерАвто",СтрокаПараметр.ГУИД);
					ИзменилосьЗначенияВСтроке = Истина;
				КонецЕсли;
				Если ПаспортныеДанные <> СтрокаПараметр.ПаспортныеДанные Тогда
					ЗапросОб.ОбновитьТаблицуОформленияДокумента(СтруктураТаблицОформления.ТаблицаОформленияТЧ,"ПаспортныеДанные",СтрокаПараметр.ГУИД);
					ИзменилосьЗначенияВСтроке = Истина;
				КонецЕсли;
				Если ФИОВодителя <> СтрокаПараметр.ФИОВодителя Тогда
					ЗапросОб.ОбновитьТаблицуОформленияДокумента(СтруктураТаблицОформления.ТаблицаОформленияТЧ,"ФИОВодителя",СтрокаПараметр.ГУИД);
					ИзменилосьЗначенияВСтроке = Истина;
				КонецЕсли;
				//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 конец
				
				НайденнаяСтрока.СтатусЗаказаНаТС 						= Перечисления.СтатусЗаказаНаТс[СтрЗаменить(СтрокаПараметр.СтатусЗаказаНаТс," ","")];
				НайденнаяСтрока.ДатаИВремяВывоза 						= СтрокаПараметр.ДатаИВремяВвозаВывоза;
				
				НайденнаяСтрока.ДатаИВремяСдачи 						= СтрокаПараметр.ДатаИВремяСдачи;
				НайденнаяСтрока.ДатаЗавершенияОперацииНаСкладеКлиента 	= СтрокаПараметр.ДатаЗавершенияОперацииНаСкладеКлиента;
				
				НайденнаяСтрока.ИтоговаяСтоимостьПеревозки  			= СтрокаПараметр.ИтоговаяСтоимостьПеревозки;
				НайденнаяСтрока.КонтейнерФакт 							= СтрокаПараметр.КонтейнерФакт;
				
				//Евросиб Коханенко Н.А. 14.03.2024 (( #82183 
				НайденнаяСтрока.ТерминалВыдачиФакт 						= ТерминалВыдачиФакт;
				
				//Евросиб Коханенко Н.А. 17.12.2025 (( #125251
				//НайденнаяСтрока.АдресСкладаФакт 						= СтрокаПараметр.АдресСкладаФакт;
				Если ОбменСсылкамиНаАдресаВНаселенныхПунктахАктивен 
					И ЗначениеЗаполнено(СтрокаПараметр.АдресСкладаФакт)
					И СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(СтрокаПараметр.АдресСкладаФакт) Тогда
					НайденнаяСтрока.АдресСкладаФакт = Справочники.АдресаВНаселенныхПунктах.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаПараметр.АдресСкладаФакт));	
					НайденнаяСтрока.УдалитьАдресСкладаФакт = "";
				Иначе
					НайденнаяСтрока.АдресСкладаФакт = Справочники.АдресаВНаселенныхПунктах.ПустаяСсылка();
					НайденнаяСтрока.УдалитьАдресСкладаФакт = СтрокаПараметр.АдресСкладаФакт;
				КонецЕсли;
				//Евросиб Коханенко Н.А. 17.12.2025 )) #125251
				
				НайденнаяСтрока.ТерминалСдачиФакт 						= ТерминалСдачиФакт;
				//Евросиб Коханенко Н.А. 14.03.2024 )) #82183

				
				//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 начало

				//НайденнаяСтрока.Перевозчик 								= СтрокаПараметр.НаименованиеКомпанииАвтоперевозчика;
				//НайденнаяСтрока.НомерАвто 								= СтрокаПараметр.НомерАвто;
				//НайденнаяСтрока.ПаспортныеДанные 						= СтрокаПараметр.ПаспортныеДанные;
				//НайденнаяСтрока.ФИОВодителя 							= СтрокаПараметр.ФИОВодителя;
				
				СтруктураКлюча = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
				СтруктураКлюча.КлючАналитики = НайденнаяСтрока.КлючАналитикиПеревозки;
				
				Если СтрокаДокумент.Ссылка.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля Тогда
					ИмяСтруктуры = "СтруктураТЧМилиПерваяМиляКлючаАналитики";
					ДопУсловие = Истина; //ДИТ Шевченко А.В. US 62482 ТА 68277 17.04.2023 
				//Евросиб Коханенко Н.А. 13.08.2024 (( #87840
				//Иначе 
				ИначеЕсли СтрокаДокумент.Ссылка.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.СредняяМиля Тогда
					ИмяСтруктуры = "СтруктураТЧМилиСредняяМиляКлючаАналитики";
					ДопУсловие = ЗначениеЗаполнено(СтрокаПараметр.ДатаИВремяСдачи); //ДИТ Шевченко А.В. US 62482 ТА 68277 17.04.2023
				ИначеЕсли СтрокаДокумент.Ссылка.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПоследняяМиля Тогда
				//Евросиб Коханенко Н.А. 13.08.2024 )) #87840
					ИмяСтруктуры = "СтруктураТЧМилиПоследняяМиляКлючаАналитики";
					ДопУсловие = ЗначениеЗаполнено(СтрокаПараметр.ДатаИВремяСдачи); //ДИТ Шевченко А.В. US 62482 ТА 68277 17.04.2023
				КонецЕсли; 
				
				//Евросиб Коханенко Н.А. 23.07.2024 (( #88706
				Если ЗначениеЗаполнено(СтрокаПараметр.НомерЗаказаНаТС) 
					И ЗначениеЗаполнено(СтрокаПараметр.ДатаСозданияЗаказаНаТС) Тогда
					ПредставлениеДокументаВТЛ = "" + СтрокаПараметр.НомерЗаказаНаТС + " от " + СтрокаПараметр.ДатаСозданияЗаказаНаТС;
					СтруктураКлюча[ИмяСтруктуры].НомерЗаказаНаТС = ПредставлениеДокументаВТЛ;
				КонецЕсли;
				//Евросиб Коханенко Н.А. 23.07.2024 )) #88706 
				
				Если ЗначениеЗаполнено(СтрокаПараметр.ФИОВодителя) И ДопУсловие Тогда
					СтруктураКлюча[ИмяСтруктуры].ФИОВодителя 		= СтрокаПараметр.ФИОВодителя;
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаПараметр.НомерАвто) И ДопУсловие Тогда
					СтруктураКлюча[ИмяСтруктуры].РегНомерТС 		= СтрокаПараметр.НомерАвто;
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаПараметр.ПаспортныеДанные) И ДопУсловие Тогда
					СтруктураКлюча[ИмяСтруктуры].ПаспортныеДанные	= СтрокаПараметр.ПаспортныеДанные;
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаПараметр.НаименованиеКомпанииАвтоперевозчика) И ДопУсловие Тогда
					СтруктураКлюча[ИмяСтруктуры].Автоперевозчик 	= СтрокаПараметр.НаименованиеКомпанииАвтоперевозчика;
				КонецЕсли;
				Если СтрокаДокумент.Ссылка.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля Тогда
					Если ЗначениеЗаполнено(СтрокаПараметр.ДатаИВремяВвозаВывоза) Тогда
						СтруктураКлюча[ИмяСтруктуры].ДатаВыдачиКТКСТерминала 		= СтрокаПараметр.ДатаИВремяВвозаВывоза;
					КонецЕсли;
				КонецЕсли;
				//ДИТ Шевченко А.В. US 62482 ТА 68277 17.04.2023 -Начало
				Если ЗначениеЗаполнено(СтрокаПараметр.ДатаИВремяВвозаВывоза) 
					//Евросиб Коханенко Н.А. 27.03.2025 (( #102956
					ИЛИ СтрокаДокумент.Ссылка.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.СредняяМиля
					//Евросиб Коханенко Н.А. 27.03.2025 )) #102956 
				Тогда
					СтруктураКлюча[ИмяСтруктуры].ДатаВыдачиКТКСТерминала 		= СтрокаПараметр.ДатаИВремяВвозаВывоза;
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаПараметр.ДатаИВремяСдачи)
					//Евросиб Коханенко Н.А. 27.03.2025 (( #102956
					ИЛИ СтрокаДокумент.Ссылка.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.СредняяМиля
					//Евросиб Коханенко Н.А. 27.03.2025 )) #102956 
				Тогда
					СтруктураКлюча[ИмяСтруктуры].ДатаСдачиКТКНаТерминал 		= СтрокаПараметр.ДатаИВремяСдачи;
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаПараметр.ДатаЗавершенияОперацииНаСкладеКлиента) Тогда
					СтруктураКлюча[ИмяСтруктуры].ДатаВыездаКТКСоСклада 		= СтрокаПараметр.ДатаЗавершенияОперацииНаСкладеКлиента;
				КонецЕсли;
				//ДИТ Шевченко А.В. US 62482 ТА 68277 17.04.2023 -Конец  
				
				//Евросиб Коханенко Н.А. 21.07.2025 (( #114761 
				Если ЗначениеЗаполнено(СтрокаПараметр.GateInContainerOperationTypeFact) Тогда
					СтруктураКлюча[ИмяСтруктуры].ОперацияНаТерминалеПостановкиФакт = ПолучитьТипОперацииНаТерминалеПоОперацииВыполненияВТЛ(СтрокаПараметр.GateInContainerOperationTypeFact);
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаПараметр.ClientStorageOperationTypeFact) Тогда
					СтруктураКлюча[ИмяСтруктуры].ОперацияНаСкладеКлиентаФакт = ПолучитьТипОперацииНаТерминалеПоОперацииВыполненияВТЛ(СтрокаПараметр.ClientStorageOperationTypeFact);
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаПараметр.GateOutContainerOperationTypeFact) Тогда
					СтруктураКлюча[ИмяСтруктуры].ОперацияНаТерминалеСдачиФакт = ПолучитьТипОперацииНаТерминалеПоОперацииВыполненияВТЛ(СтрокаПараметр.GateOutContainerOperationTypeFact);
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаПараметр.DateOfArrival) Тогда
					СтруктураКлюча[ИмяСтруктуры].ДатаИВремяПрибытияНаПогрузкуВыгрузку = СтрокаПараметр.DateOfArrival;
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаПараметр.FreightForwardFact) Тогда
					СтруктураКлюча[ИмяСтруктуры].ЭкспедированиеФакт	= СтрокаПараметр.FreightForwardFact;
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаПараметр.AddInfoExpeditorES) Тогда
					СтруктураКлюча[ИмяСтруктуры].КомментарийДиспЕвросиб = СтрокаПараметр.AddInfoExpeditorES;
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаПараметр.AddInfoCarrier) Тогда
					СтруктураКлюча[ИмяСтруктуры].КомментарийПеревозчика = СтрокаПараметр.AddInfoCarrier;
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаПараметр.PSCID) Тогда
					//Евросиб Коханенко Н.А. 17.09.2025 (( #119413 
					//СтруктураКлюча[ИмяСтруктуры].ПротоколПоставщика	= СтрокаПараметр.PSCID;
					ПСЦСсылка = Документы.ПСЦПоставщика.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаПараметр.PSCID));
					Если ОбщегоНазначения.СсылкаСуществует(ПСЦСсылка) Тогда
						СтруктураКлюча[ИмяСтруктуры].ПротоколПоставщика = ПСЦСсылка;	
					КонецЕсли;
					//Евросиб Коханенко Н.А. 17.09.2025 )) #119413 
				КонецЕсли;
				//Евросиб Коханенко Н.А. 17.09.2025 (( #119413 
				//Если ЗначениеЗаполнено(СтрокаПараметр.OrderID) Тогда
				//	СтруктураКлюча[ИмяСтруктуры].ЗаказНаТС = СтрокаПараметр.OrderID;
				//КонецЕсли;
				//Евросиб Коханенко Н.А. 17.09.2025 )) #119413 
				//Евросиб Коханенко Н.А. 21.07.2025 )) #114761
				
				//Евросиб Коханенко Н.А. 05.08.2025 (( #115647 
				Если ЗначениеЗаполнено(СтрокаПараметр.NetWeightFact) Тогда
					СтруктураКлюча[ИмяСтруктуры].ВесНеттоФакт = СтрокаПараметр.NetWeightFact;
				КонецЕсли;
				//Евросиб Коханенко Н.А. 05.08.2025 )) #115647 
				
				//Евросиб Коханенко Н.А. 05.03.2026 (( #128357  
				Если СтрокаПараметр.ХолостойПрогон = 0 Тогда
					ЗначениеХолостогоПрогона = Перечисления.ВидыПрогонаТС.ГруженыйПрогон;
				ИначеЕсли СтрокаПараметр.ХолостойПрогон = 1 Тогда
					ЗначениеХолостогоПрогона = Перечисления.ВидыПрогонаТС.ХолостойПрогонСКТК;
				ИначеЕсли СтрокаПараметр.ХолостойПрогон = 2 Тогда
					ЗначениеХолостогоПрогона = Перечисления.ВидыПрогонаТС.ХолостойПрогонБезКТК; 
					//Евросиб 13.03.2026 (( #133369
					//Н.Дадабаева:
					//Надо зачищать:	Адрес погрузки/выгрузки (но он и так зачищается), 
					//					+Операция на складе клиента, 
					//					+Терминал сдачи, 
					//					+Операция на терминале сдачи,
					//					Дата сдачи КТК на терминал, 
					//					Дата выезда КТК со склада
					СтруктураКлюча[ИмяСтруктуры].ОперацияНаСкладеКлиентаФакт = ПолучитьТипОперацииНаТерминалеПоОперацииВыполненияВТЛ(""); 
					НайденнаяСтрока.ТерминалСдачиФакт = Справочники.Локации.ПустаяСсылка();
					СтруктураКлюча[ИмяСтруктуры].ОперацияНаТерминалеСдачиФакт = ПолучитьТипОперацииНаТерминалеПоОперацииВыполненияВТЛ("");
					СтруктураКлюча[ИмяСтруктуры].ДатаСдачиКТКНаТерминал = Дата("00010101");
					СтруктураКлюча[ИмяСтруктуры].ДатаВыездаКТКСоСклада = Дата("00010101"); 
					СтруктураКлюча[ИмяСтруктуры].ДатаИВремяПрибытияНаПогрузкуВыгрузку = Дата("00010101");
					//Евросиб 13.03.2026 )) #133369 
				КонецЕсли;	
				СтруктураКлюча[ИмяСтруктуры].ХолостойПрогон = ЗначениеХолостогоПрогона;
				//Евросиб Коханенко Н.А. 05.03.2026 )) #128357  

				Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлюча);
				
				//Евросиб Шевченко А.В. 15.05.2025 US 94035 TA 104217
				//Евросиб Коханенко Н.А. 20.03.2025 (( #102956
				//Если СтрокаДокумент.Ссылка.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.СредняяМиля Тогда
				//	ПередатьКлючАналитикиВDX(НайденнаяСтрока.КлючАналитикиПеревозки);
				//КонецЕсли;
				//Евросиб Коханенко Н.А. 20.03.2025 )) #102956 
				//Евросиб Шевченко А.В. 15.05.2025 US 94035 TA 104217
				
				// ДИТ US 79379 ТА 80813 Сержантова А.С. Начало: 06.03.2024
				РегистрыСведений.ДанныеКлючейАналитикиПеревозкиЗагруженные.ЗафиксироватьПолучениеДанныхИзВнешнейСистемы(СтруктураКлюча, 
												Перечисления.УзлыОбмена.ТЛ);
				// ДИТ US 79379 ТА 80813 Сержантова А.С. Конец: 06.03.2024
				
				//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 конец
				НайденнаяСтрока.НомерПрицепа 							= СтрокаПараметр.НомерПрицепа;
				
				Если Не ЗначениеЗаполнено(НайденнаяСтрока.КлючАналитикиПеревозки.Контейнер) И ЗначениеЗаполнено(СтрокаПараметр.КонтейнерФакт) Тогда
					КонтФакт = НайденнаяСтрока.КонтейнерФакт;
					ВычисленноеКонтрольноеЧисло = ?(СтрДлина(КонтФакт) = 11,РаботаСКонтейнерамиСервер.ПолучитьКонтрольноеЧисло(Лев(КонтФакт,4), Сред(КонтФакт,5,6)),0);
					КонтрольноеЧислоПолученное  = Число(Прав(КонтФакт,1));
					
					Если ВычисленноеКонтрольноеЧисло <> КонтрольноеЧислоПолученное И РаботаСКонтейнерамиСервер.КорректнаяМаска(Лев(КонтФакт,4),Сред(КонтФакт,5,6)) Тогда
						Продолжить;		
					КонецЕсли;
					
					КТК = РаботаСКонтейнерамиСервер.НайтиКТК(КонтФакт, Ложь);
					//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 начало
					Если КТК <> Неопределено Тогда
						//НайденнаяСтрока.Контейнер = КТК;
						СтруктураКлюча  = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();	
						СтруктураКлюча.Вставить("КлючАналитики",НайденнаяСтрока.КлючАналитикиПеревозки);
						СтруктураКлюча.Вставить("Контейнер",КТК);
						Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлюча);
					Иначе
						//НайденнаяСтрока.Контейнер = РаботаСКонтейнерамиСервер.СоздатьКТК(КонтФакт, НайденнаяСтрока.ТипКТК);
						КТК = РаботаСКонтейнерамиСервер.СоздатьКТК(КонтФакт, НайденнаяСтрока.ТипКТК);
						СтруктураКлюча  = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();	
						СтруктураКлюча.Вставить("КлючАналитики",НайденнаяСтрока.КлючАналитикиПеревозки);
						СтруктураКлюча.Вставить("Контейнер",КТК);
						Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлюча);
						МассивКонтейнеров = Новый Массив;
						МассивКонтейнеров.Добавить(НайденнаяСтрока.Контейнер);
						РаботаСКонтейнерамиСервер.ДобавитьИнформациюОбИсточникеСозднияКонтейнеров(МассивКонтейнеров, "Заказ на ТС № " + СтрокаПараметр.НомерЗаказаНаТС);
					КонецЕсли;
					//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 конец
				КонецЕсли;
				
				Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НайденнаяСтрока.КлючАналитикиПеревозки.Контейнер,"Наименование") <> СтрокаПараметр.КонтейнерФакт Тогда
					ЗапросОб.ОбновитьТаблицуОформленияДокумента(СтруктураТаблицОформления.ТаблицаОформленияТЧ,"КонтейнерФакт",СтрокаПараметр.ГУИД);
					ЗапросОб.СоздатьЗадачуНесовпадениеПланФактНомераКТК();
				КонецЕсли;
				
				
				
				//ДИТ Шевченко А.В. 59965 25.11.2022 -начало
				Если НайденнаяСтрока.СтатусЗаказаНаТС = Перечисления.СтатусЗаказаНаТс.ГотовКВыдачеВРейс И ИзменилосьЗначенияВСтроке И НЕ НайденнаяСтрока.СтатусЗапросаНаАвтоперевозку = Перечисления.СтатусЗапросаНаПеревозку.Отменен Тогда	
					//ДИТ Шевченко А.В. US 62487 ТА 68012 04.05.2023
					Если НЕ НайденнаяСтрока.НеТребуетсяТерминалВыдачи Тогда
						НайденнаяСтрока.СтатусОтправкиЗапросаНаТерминалВыдачи = Перечисления.СтатусОтправкиЗапросаНаТерминалВыдачи.НеОтправлен;
					КонецЕсли;
					//ДИТ Шевченко А.В. US 62487 ТА 68012 04.05.2023
					//ПринадлежностьТЕ = ЗапросОб.ПолучитьПринадлежностьТЕКТКПоЗаявке(ЗапросОб.Заявка,НайденнаяСтрока.КлючАналитикиПеревозки.Контейнер,НайденнаяСтрока.ИдентификаторСтрокиУслуги);
					ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТЕвросиба;
					МассивКонтейнеров 		= Новый Массив;
					МассивКонтейнеров.Добавить(НайденнаяСтрока.КлючАналитикиПеревозки.Контейнер);
					ДанныеКТК 	= Документы.РелизКлиента.ПолучитьИнструкции(МассивКонтейнеров);
					ДанныеТекущегоКТК = ДанныеКТК.Получить(НайденнаяСтрока.КлючАналитикиПеревозки.Контейнер);
					Если ДанныеТекущегоКТК <> Неопределено Тогда
						ПринадлежностьТЕ = АРМ_Сервер.ОпределитьПринадлежностьПоВидуСобственности(ДанныеТекущегоКТК.ВидСобственности);
					КонецЕсли;						
					Если ПринадлежностьТЕ <> Неопределено Тогда
						Если ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТКлиента Тогда
							СоздатьЗадачуПередатьКлиентуДанныеПоАвтоперевозке = Истина; 
							//ИначеЕсли ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТЕвросиба Тогда
							//Если ЗначениеЗаполнено(НайденнаяСтрока.Релиз) Тогда
							//	Если НЕ НайденнаяСтрока.Релиз.ПометкаУдаления Тогда
							//		СоответствиеГуидСтрокиРелиз.Вставить(НайденнаяСтрока.ИдентификаторСтрокиТЧ,НайденнаяСтрока.Релиз);
							//	КонецЕсли;
							//КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				//ДИТ Шевченко А.В. 59965 25.11.2022 -конец      
				
				// ДИТ US 83871 ТА 84799 Сержантова А.С. Начало: 07.05.2024 
				Справочники.РейсыАвто.ОбновитьДанныеВАвтоРейсеСтрокиЗапросаНаАвто(НайденнаяСтрока, ЗапросОб.Заявка, ЗапросОб.ЭтапПеревозки);
				// ДИТ US 83871 ТА 84799 Сержантова А.С. Конец: 07.05.2024
				
			КонецЦикла;
			ЗаполнитьЗначенияСвойств(ТаблицаОбработанныхГуидов.Добавить(),СтрокаПараметр);  
			
		//Евросиб Коханенко Н.А. 21.02.2024 (( #81158 
		ЗнчМассив = МассивГуидов.Найти(СтрокаГУИД.ГУИД);
		КонецЦикла;
		//Евросиб Коханенко Н.А. 21.02.2024 )) #81158 

		КонецЦикла;
		
		Если СоздатьЗадачуПередатьКлиентуДанныеПоАвтоперевозке Тогда
			ЗапросОб.СоздатьЗадачуПередатьКлиентуДанныеПоАвтоперевозке();
		Иначе
			ЗапросОб.УдалитАктивнуюЗадачуПередатьКлиентуДанныеПоАвтоперевозке();
		КонецЕсли;
		
		//Для Каждого знчСоотв Из СоответствиеГуидСтрокиРелиз Цикл
		//	РелизОб = знчСоотв.Значение.ПолучитьОбъект();
		//	знчСоотв.Значение = РелизОб;
		//КонецЦикла;		
		
		//Если СоответствиеГуидСтрокиРелиз.Количество() > 0 Тогда
		//	Для Каждого СтрокаЗапроса Из ЗапросОб.Контейнеры Цикл 
		//		РелизОб = СоответствиеГуидСтрокиРелиз.Получить(СтрокаЗапроса.ИдентификаторСтрокиТЧ);
		//		Если РелизОб <> Неопределено Тогда
		//			СтруктураПоискаСтрок = Новый Структура("ИдентификаторСтроки",СтрокаЗапроса.ИдентификаторСтрокиТЧ);
		//			НайденныеСтрокиРелиза = РелизОб.ТранспортныеСредства.НайтиСтроки(СтруктураПоискаСтрок);
		//			Если НайденныеСтрокиРелиза.Количество() > 0 Тогда
		//				НайденныеСтрокиРелиза[0].ФИОВодителя 		= СтрокаЗапроса.ФИОВодителя;
		//				НайденныеСтрокиРелиза[0].РегНомерТС 		= СтрокаЗапроса.НомерАвто;
		//				НайденныеСтрокиРелиза[0].ПаспортныеДанные 	= СтрокаЗапроса.ПаспортныеДанные;
		//				НайденныеСтрокиРелиза[0].Автоперевозчик 	= СтрокаЗапроса.Перевозчик;
		//			Иначе
		//				НовСтрока					 = РелизОб.ТранспортныеСредства.Добавить();
		//				НовСтрока.ФИОВодителя		 = СтрокаЗапроса.ФИОВодителя;
		//				НовСтрока.РегНомерТС		 = СтрокаЗапроса.НомерАвто;
		//				НовСтрока.ПаспортныеДанные	 = СтрокаЗапроса.ПаспортныеДанные;
		//				НовСтрока.Автоперевозчик	 = СтрокаЗапроса.Перевозчик;
		//			КонецЕсли;	
		//		КонецЕсли;	
		//	КонецЦикла; 
		//КонецЕсли;
		
		Попытка
			ЗапросОб.ПоместитьТаблицыОформленияВХранилище(СтруктураТаблицОформления.ТаблицаОформленияТЧ,СтруктураТаблицОформления.СписокОформленияШапки);		
			ЗапросОб.Записать(РежимЗаписиДокумента.Проведение);
			
			//Для Каждого знчСоотв Из СоответствиеГуидСтрокиРелиз Цикл
			//	РелизОб = знчСоотв.Значение.ПолучитьОбъект();
			//	РелизОб.Записать(РежимЗаписиДокумента.Проведение);
			//КонецЦикла;
			
			Для Каждого СтрокаТЗ Из ТаблицаОбработанныхГуидов Цикл
				НовСтрока = ТаблицаОтвета.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрока,СтрокатЗ);
				НовСтрока.Ошибка = "";
			КонецЦикла;
		Исключение
			Для Каждого СтрокаТЗ Из ТаблицаОбработанныхГуидов Цикл
				НовСтрока = ТаблицаОтвета.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрока,СтрокатЗ);
				НовСтрока.Ошибка = ОписаниеОшибки();
			КонецЦикла;
		КонецПопытки;
		
	КонецЦикла;
	
	Для Каждого МассивГуидовЗнч Из МассивГуидов Цикл
		СтруктураПоиска = Новый Структура("ГУИД",МассивГуидовЗнч);
		СтрокаПараметрМассив = ПараметрыXml.НайтиСтроки(СтруктураПоиска);
		СтрокаПараметр = СтрокаПараметрМассив[0];		
		НовСтрока = ТаблицаОтвета.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока,СтрокаПараметр);
		НовСтрока.Ошибка = "По данному гуиду документ не найден.";	
	КонецЦикла;	
	
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(ТаблицаОтвета);
		
	//ДИТ - Шевченко А.В. 25.07.2022 #54974 - Конец
КонецФункции   
//Евросиб - Дубская 07.07.2022 #54080

//Евросиб Гудкова( 09.07.2022 Ticket№ 54442
Процедура ПередатьЗапросыНаАвтоВТЛ(Параметры) Экспорт
	
	ТаблицаВыгружаемых = Параметры.СтрокиКВыгрузке;
	Параметры.СтрокиКВыгрузке = ТаблицаВыгружаемых.ВыгрузитьКолонку("ИдентификаторСтрокиТЧ");
	ОсновныеДанные = ПолучитьДанныеЧерезМакетСКД("СписокЗапросовНаАвто", Параметры);
	ДетализацияПоГрузу = ПолучитьДетализациюПоГрузу(Параметры.СсылкаЗапросНаАвтоперевозку);
	
	//Евросиб Коханенко Н.А. 06.10.2023 (( US 75549 TA 75774 
	//ДанныеXML = ОбщегоНазначения.ЗначениеВСтрокуXML(Новый Структура("ОсновныеДанные, ДетализацияПоГрузу", ОсновныеДанные, ДетализацияПоГрузу));
	ДополнительныеАдресаКлиента = ПолучитьДополнительныеАдресаКлиента(Параметры);
	ДанныеXML = ОбщегоНазначения.ЗначениеВСтрокуXML(Новый Структура("ОсновныеДанные, ДополнительныеАдресаКлиента, ДетализацияПоГрузу", ОсновныеДанные, ДополнительныеАдресаКлиента, ДетализацияПоГрузу));
	//Евросиб Коханенко Н.А. 06.10.2023 )) US 75549 TA 75774  
	
   	Прокси = ВебСервисы_сервер.ПолучитьПрокси("ВебСервисОбменТЛ");
	
	//Евросиб Коханенко Н.А. 19.11.2025 (( #124142 
	//передаем Типоразмеры КТК, если такие есть в Плане Обмена
	ПередатьТипоразмерыКТКвТЛ(Прокси, Перечисления.УзлыОбмена.ТЛ);
	//Евросиб Коханенко Н.А. 19.11.2025 )) #124142 
	
	//Евросиб Коханенко Н.А. 16.12.2025 (( #125251 
	//передаем Адреса в Населенных Пунктах, если такие есть в Плане Обмена
	ПередатьАдресаВНПвТЛ(Прокси, Перечисления.УзлыОбмена.ТЛ);
	//Евросиб Коханенко Н.А. 16.12.2025 )) #125251 

	Ответ = Прокси.UploadTransportationRequest(ДанныеXML);
	ТаблицаОтвета = ОбщегоНазначения.ЗначениеИзСтрокиXML(Ответ);
	
	МассивОшибок = Новый Массив;
	
	Для каждого СтрокаОтвета Из ТаблицаОтвета Цикл
		Если ЗначениеЗаполнено(СтрокаОтвета.Комментарий) Тогда
			ОбщегоНазначения.СообщитьПользователю("Документ не выгружен. Ошибки: " + СтрокаОтвета.Комментарий);
			
			//Евросиб Коханенко Н.А. 07.02.2025 (( #101909
			//МассивОшибок.Добавить(СтрокаОтвета);
			ЗаписьЖурналаРегистрации("ОшибкаОтправкиДокументаДК_ТЛ",
							УровеньЖурналаРегистрации.Ошибка,,,СтрокаОтвета.Комментарий);
			//Евросиб Коханенко Н.А. 07.02.2025 )) #101909
			
		Иначе
			СтрокаВыгружаемых = ТаблицаВыгружаемых.Найти(СтрокаОтвета.ГУИД, "ИдентификаторСтрокиТЧ");
			СтруктураПоиска = Новый Структура("ДействиеПриОбмене, УзелОбмена, Объект, НУИНУ", Перечисления.ДействияПриОбмене.ВыгрузкаДанных, 
												Перечисления.УзлыОбмена.ТЛ, Параметры.СсылкаЗапросНаАвтоперевозку, СтрокаВыгружаемых.ИдентификаторСтрокиТабличнойЧасти);
			ПредставлениеДокументаВТЛ = ""+СтрокаОтвета.НомерЗаказа+" от "+СтрокаОтвета.ДатаЗаказа;									
			СтруктураДанных = Новый Структура("УИДИсточника, Ответственный, НомерДатаВБУ", СтрокаОтвета.ГУИД,  Пользователи.АвторизованныйПользователь(), ПредставлениеДокументаВТЛ);
			//Евросиб Коханенко Н.А. 23.07.2024 (( #88706
			ЗапросНаАвтоКонтейнерыСтруктура = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.СсылкаЗапросНаАвтоперевозку, "ЭтапПеревозки, Контейнеры");
			ЗапросНаАвтоКонтейнеры = ЗапросНаАвтоКонтейнерыСтруктура.Контейнеры.Выгрузить(); 
			СтрокаКТК = ЗапросНаАвтоКонтейнеры.Найти(СтрокаОтвета.ГУИД, "ИдентификаторСтрокиТЧ");
			Если СтрокаКТК <> Неопределено Тогда
				СтруктураКлючаАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
				СтруктураКлючаАналитикиПеревозки.КлючАналитики = СтрокаКТК.КлючАналитикиПеревозки;
				Если ЗапросНаАвтоКонтейнерыСтруктура.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля Тогда
					СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПерваяМиляКлючаАналитики.НомерЗаказаНаТС = ПредставлениеДокументаВТЛ;
				ИначеЕсли ЗапросНаАвтоКонтейнерыСтруктура.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПоследняяМиля Тогда
					СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПоследняяМиляКлючаАналитики.НомерЗаказаНаТС = ПредставлениеДокументаВТЛ;
				//Евросиб Коханенко Н.А. 13.08.2024 (( #87840
				ИначеЕсли ЗапросНаАвтоКонтейнерыСтруктура.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.СредняяМиля Тогда
					СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиСредняяМиляКлючаАналитики.НомерЗаказаНаТС = ПредставлениеДокументаВТЛ;
				//Евросиб Коханенко Н.А. 13.08.2024 )) #87840
				КонецЕсли;
				ОбновленныйКлючАналитики = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлючаАналитикиПеревозки);
			КонецЕсли;
			//Евросиб Коханенко Н.А. 23.07.2024 )) #88706 
			//Евросиб Коханенко Н.А. 01.07.2024 (( #83866
			//Сообщение = РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных, "Создан Заказ на перевозку: " + ПредставлениеДокументаВТЛ);
			Текст = "Создан/обновлен заказ на перевозку: ";
			Сообщение = РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных, Текст + ПредставлениеДокументаВТЛ);
			//Евросиб Коханенко Н.А. 01.07.2024 )) #83866
			Сообщение.Сообщить();
		КонецЕсли; 
	КонецЦикла; 
	
	Если МассивОшибок.Количество() > 0 Тогда
		//Евросиб Коханенко Н.А. 12.12.2023 (( US 75549 TA 75774 
		//не отправляем "письма счастья" при ошибках передачи между тестовыми базами
		Если НЕ ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована Тогда
			ОтправитьПисьмоОбОшибкахОбменаДКТЛ(МассивОшибок,Параметры.СсылкаЗапросНаАвтоперевозку);
		КонецЕсли;
		//Евросиб Коханенко Н.А. 12.12.2023 (( US 75549 TA 75774 
	КонецЕсли;	
	
КонецПроцедуры

//ДИТ Шевченко А.В. 55131 01.08.2022 -начало
Процедура ОтправитьПисьмоОбОшибкахОбменаДКТЛ(МассивОшибок,СсылкаЗапросНаАвтоперевозку)
	
	ПолучателиУведомлений = Константы.ПолучателиУведомленийОРегЗаданиях.Получить();
	Если Не ЗначениеЗаполнено(ПолучателиУведомлений) Тогда
		Возврат;
	КонецЕсли;	
	УчетнаяЗаписьПоУмолчаниюДоступна = РаботаСПочтовымиСообщениями.ПроверитьСистемнаяУчетнаяЗаписьДоступна();	
	Если УчетнаяЗаписьПоУмолчаниюДоступна = Ложь Тогда
		Возврат;
	КонецЕсли;	
	СистемнаяУчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	ПолучателиПисьма = Новый Массив;
	Если ТипЗнч(ПолучателиУведомлений) = Тип("СправочникСсылка.Пользователи") Тогда
		ЭлАдресПользователя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПолучателиУведомлений, Справочники.ВидыКонтактнойИнформации.EmailПользователя, , Истина);
		ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", ПолучателиУведомлений, ЭлАдресПользователя));
	Иначе	
		Для Каждого ТекущийПользователь Из ПолучателиУведомлений.Состав Цикл								
			ЭлАдресПользователя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ТекущийПользователь.Пользователь, Справочники.ВидыКонтактнойИнформации.EmailПользователя, , Истина);
			ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", ТекущийПользователь.Пользователь, ЭлАдресПользователя));
		КонецЦикла;
	КонецЕсли;
	
	ТекстПисма = "ДОКУМЕНТ " + СсылкаЗапросНаАвтоперевозку;
	Для Каждого ЗнчМассива Из МассивОшибок Цикл
		ТекстПисма = ТекстПисма + "ТЕКСТ ОШИБКИ:" + Символы.ПС + ЗнчМассива.Комментарий + Символы.ПС + Символы.ПС;
		ТекстПисма = ТекстПисма + "ГУИДЫ СТРОК ДОКУМЕНТА ОТПРАВЛЯЕМЫХ В ЗАПРОСЕ:" + Символы.ПС;
		ТекстПисма = ТекстПисма + ЗнчМассива.ГУИД;
	КонецЦикла;
	
	ПараметрыОтправкиПисьма = Новый Структура;
	ПараметрыОтправкиПисьма.Вставить("ТипТекста", 	Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст);
	ПараметрыОтправкиПисьма.Вставить("Тема", 		"Ошибка отправки Запрос на автоперевозку из ДК в ИС Транспортная логистика");
	ПараметрыОтправкиПисьма.Вставить("Тело", 		ТекстПисма);		
	ПараметрыОтправкиПисьма.Вставить("Кому", 		ПолучателиПисьма);
	
	Попытка
		РезультатОтправки = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(СистемнаяУчетнаяЗапись, ПараметрыОтправкиПисьма);
	Исключение
		ЗаписьЖурналаРегистрации("ОтправкаПисьмаОбОшибкахОбменаДК_ТЛ",
							УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	ЗаписьЖурналаРегистрации("ОшибкаОбменаЗапросНаАвтоперевозкуДК_ТЛ",
							УровеньЖурналаРегистрации.Ошибка,,,ТекстПисма);
	
КонецПроцедуры	
//ДИТ Шевченко А.В. 55131 01.08.2022 -Конец

Функция ПолучитьДетализациюПоГрузу(СсылкаЗапросНаАвто)
	
	//ДИТ Шевченко А.В. US 62421 TA 64345 20.01.23 -начало
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ЗапросНаАвтоперевозкуДетализацияПоГрузу.ГУИДСтроки КАК QueryID,
	//               |	ЗапросНаАвтоперевозкуДетализацияПоГрузу.Груз.ЕТСНГ КАК DetailCargoCode,
	//               |	ЗапросНаАвтоперевозкуДетализацияПоГрузу.Груз.Наименование КАК DetailCargoName,
	//               |	ЗапросНаАвтоперевозкуДетализацияПоГрузу.КоличествоМест КАК DetailPackageNumber,
	//               |	ЗапросНаАвтоперевозкуДетализацияПоГрузу.ВесГруза КАК DetailNetWeight
	//               |ИЗ
	//               |	Документ.ЗапросНаАвтоперевозку.ДетализацияПоГрузу КАК ЗапросНаАвтоперевозкуДетализацияПоГрузу
	//               |ГДЕ
	//               |	ЗапросНаАвтоперевозкуДетализацияПоГрузу.Ссылка = &СсылкаЗапросНаАвто";
	//Запрос.УстановитьПараметр("СсылкаЗапросНаАвто", СсылкаЗапросНаАвто);
	//Возврат Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗапросНаАвтоперевозкуКонтейнеры.ИдентификаторСтрокиТЧ КАК QueryID,
		|	КлючиАналитикиПеревозкиДетализацияПоГрузу.Груз.ЕТСНГ КАК DetailCargoCode,
		|	КлючиАналитикиПеревозкиДетализацияПоГрузу.КоличествоМест КАК DetailPackageNumber,
		|	КлючиАналитикиПеревозкиДетализацияПоГрузу.Груз.Наименование КАК DetailCargoName,
		|	КлючиАналитикиПеревозкиДетализацияПоГрузу.ВесГруза КАК DetailNetWeight
		|ИЗ
		|	Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.ДетализацияПоГрузу КАК КлючиАналитикиПеревозкиДетализацияПоГрузу
		|		ПО ЗапросНаАвтоперевозкуКонтейнеры.КлючАналитикиПеревозки = КлючиАналитикиПеревозкиДетализацияПоГрузу.Ссылка
		|ГДЕ
		|	ЗапросНаАвтоперевозкуКонтейнеры.Ссылка = &СсылкаЗапросНаАвто";
	
	Запрос.УстановитьПараметр("СсылкаЗапросНаАвто", СсылкаЗапросНаАвто);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	//ДИТ Шевченко А.В. US 62421 TA 64345 20.01.23 -конец
	
КонецФункции // ПолучитьДетализациюПоГрузу()
// Евросиб Гудкова)

//ДИТ Шевченко А.В. 03.10.2022 57967 -начало
Функция ВыгрузитьXMLНаТерминал(АдресаФайлов,ПараметрыВыгрузки) Экспорт
	// ДИТ US 58592 TA 60724  Евсенкин М.А. Начало: 22.12.2022
	Если ПараметрыВыгрузки.Свойство("ВариантыАвтоперевозкиНеТребуется")
		И ПараметрыВыгрузки.ВариантыАвтоперевозкиНеТребуется Тогда
		Если ПараметрыВыгрузки.НомернаяВыдача Тогда
			ПолучитьФайлДляНомернойВыдачи(АдресаФайлов,ПолучитьДанныеЧерезМакетСКД("СписокРелизКлиентаЯниноНомернаяВыдачаОтправкаПоЖДСТерминала", ПараметрыВыгрузки));	
		Иначе 
			ПолучитьФайлДляБезНомернойВыдачи(АдресаФайлов,ПолучитьДанныеЧерезМакетСКД("СписокРелизКлиентаЯниноБезНомернаяВыдачаОтправкаПоЖДСТерминала", ПараметрыВыгрузки));
		КонецЕсли;	
	Иначе 
		// ДИТ US 58592 TA 60724  Евсенкин М.А. 22.12.2022
		Если ПараметрыВыгрузки.НомернаяВыдача Тогда	
			ПолучитьФайлДляНомернойВыдачи(АдресаФайлов,ПолучитьДанныеЧерезМакетСКД("СписокРелизКлиентаЯниноНомернаяВыдача", ПараметрыВыгрузки));
		Иначе	
			ПолучитьФайлДляБезНомернойВыдачи(АдресаФайлов,ПолучитьДанныеЧерезМакетСКД("СписокРелизКлиентаЯниноБезНомернаяВыдача", ПараметрыВыгрузки));	
		КонецЕсли;
	КонецЕсли; // ДИТ US 58592 TA 60724  Евсенкин М.А. Конец: 22.12.2022
	
	Возврат АдресаФайлов;
КонецФункции

Процедура ПолучитьФайлДляНомернойВыдачи(АдресаФайлов,ОсновныеДанные)
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 22.12.2022
	Railway = Ложь;
	Если НЕ ОсновныеДанные.Колонки.Найти("Railway_DestinationStation") = Неопределено
		И НЕ ОсновныеДанные.Колонки.Найти("Railway_DepartureDate") = Неопределено Тогда
		Railway = Истина;
	КонецЕсли;	
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 22.12.2022
	
	Для Каждого СтрокаТЗ Из ОсновныеДанные Цикл
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
		
		Запись = Новый ЗаписьXML;
		
		Запись.ОткрытьФайл(ИмяВременногоФайла, "windows-1251");
		
		Запись.ЗаписатьОбъявлениеXML();
		Запись.ЗаписатьНачалоЭлемента("ReleaseOrder");
		Запись.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
		Запись.ЗаписатьАтрибут("xsi:noNamespaceSchemaLocation", "ReleaseOrder.xsd");	
		
		Запись.ЗаписатьНачалоЭлемента("DocHead");  
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "DocName", СтрокаТЗ.DocHead_DocName);   
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "DocNumber", "КТК"+СтрокаТЗ.DocHead_DocNumber);
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "DocDate", СтрокаТЗ.DocHead_DocDate);
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "Modification", СтрокаТЗ.DocHead_Modification);				
		Запись.ЗаписатьКонецЭлемента();
		
		Запись.ЗаписатьНачалоЭлемента("Stevedore");  
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "Name", СтрокаТЗ.Stevedore_Name);   				
		Запись.ЗаписатьКонецЭлемента();
		
		Запись.ЗаписатьНачалоЭлемента("Agent");  
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "Name", СтрокаТЗ.Agent_Name);   				
		Запись.ЗаписатьКонецЭлемента();
		
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ExpireDate", СтрокаТЗ.ExpireDate);
		
		Запись.ЗаписатьНачалоЭлемента("Container");  
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "Prefix", СтрокаТЗ.Container_Prefix);   
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "Number", СтрокаТЗ.Container_Number);
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "Type", СтрокаТЗ.Container_Type);
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "IsState", СтрокаТЗ.Container_IsState);
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "IsRef", СтрокаТЗ.Container_IsRef);
		Запись.ЗаписатьКонецЭлемента();
		
		Запись.ЗаписатьНачалоЭлемента("Forwarder");  
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ForwarderName", СтрокаТЗ.Forwarder_ForwarderName);
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ForwarderINN", СтрокаТЗ.Forwarder_ForwarderINN);
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ForwarderKPP", СтрокаТЗ.Forwarder_ForwarderKPP);
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "OutputTransport", СтрокаТЗ.Forwarder_OutputTransport);
		Запись.ЗаписатьКонецЭлемента();
		
		Запись.ЗаписатьНачалоЭлемента("Driver");  
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "DriverName", СтрокаТЗ.Driver_DriverName);   
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "TransportNum", СтрокаТЗ.Driver_TransportNum);
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "PassportNumber", СтрокаТЗ.Driver_PassportNumber);
		Запись.ЗаписатьКонецЭлемента();
		
		// ДИТ US 58592 TA 60724  Евсенкин М.А. Начало: 22.12.2022
		Если Railway Тогда  
			Запись.ЗаписатьНачалоЭлемента("Railway");  
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "DestinationStation", СтрокаТЗ.Railway_DestinationStation);   
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "DepartureDate", СтрокаТЗ.Railway_DepartureDate);
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "OutputTransport", СтрокаТЗ.Forwarder_OutputTransport);
			Запись.ЗаписатьКонецЭлемента();
		КонецЕсли;
		// ДИТ US 58592 TA 60724  Евсенкин М.А. Конец: 22.12.2022
		
		Запись.ЗаписатьКонецЭлемента();
		Запись.Закрыть();
		
		Двоичное=Новый ДвоичныеДанные(ИмяВременногоФайла);  // получаем двоичные данные из файла
		Адрес = ПоместитьВоВременноеХранилище(Двоичное, Новый УникальныйИдентификатор);
		ДатаДокументаВНужномФормате = Формат(СтрокаТЗ.DocHead_DocDate,"ДФ='dd.MM.yyyy ЧЧ.мм.сс'");
		ИмяФайла = СтрокаТЗ.НомерРелиза+"_"+СтрокаТЗ.Container_Prefix+СтрокаТЗ.Container_Number+" "+ДатаДокументаВНужномФормате+".xml";
		СтруктураВложения = Новый Структура("Представление,АдресВоВременномХранилище",ИмяФайла,Адрес);
		АдресаФайлов.Добавить(СтруктураВложения);
	КонецЦикла;
	
КонецПроцедуры	

Процедура ПолучитьФайлДляБезНомернойВыдачи(АдресаФайлов,ОсновныеДанные)
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 22.12.2022
	Railway = Ложь;
	Если НЕ ОсновныеДанные.Колонки.Найти("Railway_DestinationStation") = Неопределено
		И НЕ ОсновныеДанные.Колонки.Найти("Railway_DepartureDate") = Неопределено Тогда
		Railway = Истина;
	КонецЕсли;	
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 22.12.2022
	
	МассивКолонокДляСвертки = Новый Массив;
	МассивКолонокДляСвертки.Добавить("DocHead_DocName");
	МассивКолонокДляСвертки.Добавить("DocHead_DocNumber");
	МассивКолонокДляСвертки.Добавить("DocHead_DocDate");
	МассивКолонокДляСвертки.Добавить("DocHead_Modification");
	МассивКолонокДляСвертки.Добавить("Stevedore_Name");
	МассивКолонокДляСвертки.Добавить("Agent_Name");
	МассивКолонокДляСвертки.Добавить("ExpireDate");
	МассивКолонокДляСвертки.Добавить("Container_MwdetspecCode");
    МассивКолонокДляСвертки.Добавить("Container_IsState");
	МассивКолонокДляСвертки.Добавить("Container_IsRef");
    МассивКолонокДляСвертки.Добавить("Forwarder_ForwarderName");
	МассивКолонокДляСвертки.Добавить("Forwarder_ForwarderINN");
	МассивКолонокДляСвертки.Добавить("Forwarder_ForwarderKPP");
	МассивКолонокДляСвертки.Добавить("Forwarder_OutputTransport");
	МассивКолонокДляСвертки.Добавить("НомерРелиза");
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 22.12.2022
	Если Railway Тогда 
		МассивКолонокДляСвертки.Добавить("Railway_DestinationStation");
		МассивКолонокДляСвертки.Добавить("Railway_DepartureDate");
	КонецЕсли;
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 22.12.2022
	

	ВодителиТЗ = ОсновныеДанные.Скопировать(,"Driver_DriverName,Driver_TransportNum,Driver_PassportNumber,Forwarder_ForwarderName,Forwarder_ForwarderINN,Forwarder_ForwarderKPP"); 
	
	ОсновныеДанные.Свернуть(СтрСоединить(МассивКолонокДляСвертки,","),"Count");
	
	Для Каждого СтрокаТЗ Из ОсновныеДанные Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЗ.DocHead_DocName) Тогда
			Продолжить;
		КонецЕсли;	
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
		
		Запись = Новый ЗаписьXML;
		
		Запись.ОткрытьФайл(ИмяВременногоФайла, "windows-1251");
		
		Запись.ЗаписатьОбъявлениеXML();
		Запись.ЗаписатьНачалоЭлемента("MultiRelease");
		Запись.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
		Запись.ЗаписатьАтрибут("xsi:noNamespaceSchemaLocation", "ReleaseOrder.xsd");	
		
		Запись.ЗаписатьНачалоЭлемента("DocHead");  
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "DocName", СтрокаТЗ.DocHead_DocName);   
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "DocNumber", "ИНН"+СтрокаТЗ.DocHead_DocNumber);
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "DocDate", СтрокаТЗ.DocHead_DocDate);
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "Modification", СтрокаТЗ.DocHead_Modification);				
		Запись.ЗаписатьКонецЭлемента();
		
		Запись.ЗаписатьНачалоЭлемента("Stevedore");  
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "Name", СтрокаТЗ.Stevedore_Name);   				
		Запись.ЗаписатьКонецЭлемента();
		
		Запись.ЗаписатьНачалоЭлемента("Agent");  
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "Name", СтрокаТЗ.Agent_Name);   				
		Запись.ЗаписатьКонецЭлемента();
		
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ExpireDate", СтрокаТЗ.ExpireDate);
		
		Запись.ЗаписатьНачалоЭлемента("Container");
		Запись.ЗаписатьНачалоЭлемента("NotNumbered");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "MwdetspecCode", СтрокаТЗ.Container_MwdetspecCode);
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "Count", СтрокаТЗ.Count);
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "IsState", СтрокаТЗ.Container_IsState);
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "IsRef", СтрокаТЗ.Container_IsRef);
		Запись.ЗаписатьКонецЭлемента();
		Запись.ЗаписатьКонецЭлемента();
		
		Запись.ЗаписатьНачалоЭлемента("Forwarder");  
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ForwarderName", СтрокаТЗ.Forwarder_ForwarderName);
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ForwarderINN", СтрокаТЗ.Forwarder_ForwarderINN);
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ForwarderKPP", СтрокаТЗ.Forwarder_ForwarderKPP);
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "OutputTransport", СтрокаТЗ.Forwarder_OutputTransport);
		Запись.ЗаписатьКонецЭлемента();
		
		СтрокиВодителей = ВодителиТЗ.НайтиСтроки(Новый Структура("Forwarder_ForwarderName,Forwarder_ForwarderINN,Forwarder_ForwarderKPP",СтрокаТЗ.Forwarder_ForwarderName,СтрокаТЗ.Forwarder_ForwarderINN,СтрокаТЗ.Forwarder_ForwarderKPP));
		
		Для Каждого СтрокаВ Из СтрокиВодителей Цикл
			Запись.ЗаписатьНачалоЭлемента("Driver");  
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "DriverName", СтрокаВ.Driver_DriverName);   
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "TransportNum", СтрокаВ.Driver_TransportNum);
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "PassportNumber", СтрокаВ.Driver_PassportNumber);
			Запись.ЗаписатьКонецЭлемента();
		КонецЦикла;
		
		// ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 22.12.2022
		Если Railway Тогда  
			Запись.ЗаписатьНачалоЭлемента("Railway");  
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "DestinationStation", СтрокаТЗ.Railway_DestinationStation);   
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "DepartureDate", СтрокаТЗ.Railway_DepartureDate);
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "OutputTransport", СтрокаТЗ.Forwarder_OutputTransport);
			Запись.ЗаписатьКонецЭлемента();
		КонецЕсли;	
		// ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 22.12.2022
		
		Запись.ЗаписатьКонецЭлемента();
		Запись.Закрыть();
		
		Двоичное=Новый ДвоичныеДанные(ИмяВременногоФайла);  // получаем двоичные данные из файла
		Адрес = ПоместитьВоВременноеХранилище(Двоичное, Новый УникальныйИдентификатор);
		ДатаДокументаВНужномФормате = Формат(СтрокаТЗ.DocHead_DocDate,"ДФ='dd.MM.yyyy ЧЧ.мм.сс'");
		ИмяФайла = СтрокаТЗ.НомерРелиза+"_"+СокрЛП(СтрЗаменить(СтрокаТЗ.Forwarder_ForwarderINN," ",""))+" "+ДатаДокументаВНужномФормате+".xml";
		СтруктураВложения = Новый Структура("Представление,АдресВоВременномХранилище",ИмяФайла,Адрес);
		АдресаФайлов.Добавить(СтруктураВложения);
	КонецЦикла;
	
КонецПроцедуры	
//ДИТ Шевченко А.В. 03.10.2022 57967 -конец   

//Евросиб Коханенко Н.А. 11.12.2023 (( US 75549 TA 75774 
Функция ПолучитьДополнительныеАдресаКлиента(Параметры)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АдресаВНаселенныхПунктахКомпонентыАдреса.Ссылка КАК Ссылка,
	|	МАКСИМУМ(АдресаВНаселенныхПунктахКомпонентыАдреса.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ МаксНомераСтрокТопонимов
	|ИЗ
	|	Справочник.АдресаВНаселенныхПунктах.КомпонентыАдреса КАК АдресаВНаселенныхПунктахКомпонентыАдреса
	|ГДЕ
	|	АдресаВНаселенныхПунктахКомпонентыАдреса.ВидНайденногоТопонима = &ВидТопонима
	|
	|СГРУППИРОВАТЬ ПО
	|	АдресаВНаселенныхПунктахКомпонентыАдреса.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АдресаВНаселенныхПунктахКомпонентыАдреса.Ссылка КАК Ссылка,
	|	АдресаВНаселенныхПунктахКомпонентыАдреса.Имя КАК Имя
	|ПОМЕСТИТЬ ТопонимProvince
	|ИЗ
	|	Справочник.АдресаВНаселенныхПунктах.КомпонентыАдреса КАК АдресаВНаселенныхПунктахКомпонентыАдреса
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксНомераСтрокТопонимов КАК МаксНомераСтрокТопонимов
	|		ПО АдресаВНаселенныхПунктахКомпонентыАдреса.Ссылка = МаксНомераСтрокТопонимов.Ссылка
	|			И АдресаВНаселенныхПунктахКомпонентыАдреса.НомерСтроки = МаксНомераСтрокТопонимов.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗапросНаАвтоперевозкуКонтейнеры.ИдентификаторСтрокиТЧ КАК QueryID,
	|	ПРЕДСТАВЛЕНИЕ(ВЫБОР
	|			КОГДА ЗапросНаАвтоперевозкуДополнительныеАдресаКлиента.Регион <> """"
	|				ТОГДА ЗапросНаАвтоперевозкуДополнительныеАдресаКлиента.Регион
	|			ИНАЧЕ ТопонимProvince.Имя
	|		КОНЕЦ) КАК Locality,
	|	ПРЕДСТАВЛЕНИЕ(ВЫБОР
	|			КОГДА ЕСТЬNULL(ЗапросНаАвтоперевозкуДополнительныеАдресаКлиента.АдресСкладаКлиента, ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)
	|				ТОГДА КлючиАналитикиПеревозкиМили.АдресКлиента
	|			ИНАЧЕ ЗапросНаАвтоперевозкуДополнительныеАдресаКлиента.АдресСкладаКлиента
	|		КОНЕЦ) КАК Address,
	//Евросиб Коханенко Н.А. 27.01.2026 (( #125251 
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВЫБОР
	|			КОГДА ЕСТЬNULL(ЗапросНаАвтоперевозкуДополнительныеАдресаКлиента.АдресСкладаКлиента, ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)
	|				ТОГДА КлючиАналитикиПеревозкиМили.АдресКлиента
	|			ИНАЧЕ ЗапросНаАвтоперевозкуДополнительныеАдресаКлиента.АдресСкладаКлиента
	|		КОНЕЦ) КАК AddressUID,
	//Евросиб Коханенко Н.А. 27.01.2026 )) #125251 
	|	ПРЕДСТАВЛЕНИЕ(ВЫБОР
	|			КОГДА ЕСТЬNULL(ЗапросНаАвтоперевозкуДополнительныеАдресаКлиента.АдресСкладаКлиента, ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)
	|				ТОГДА ЗапросНаАвтоперевозкуКонтейнеры.ТипОперацииНаСкладеКлиента
	|			ИНАЧЕ ЗапросНаАвтоперевозкуДополнительныеАдресаКлиента.ТипОперацииНаСкладеКлиента
	|		КОНЕЦ) КАК ClientStorageOperationType,
	|	ВЫБОР
	|		КОГДА ЗапросНаАвтоперевозкуДополнительныеАдресаКлиента.Номер ЕСТЬ NULL
	|			ТОГДА 1
	|		ИНАЧЕ ЗапросНаАвтоперевозкуДополнительныеАдресаКлиента.Номер 
	|	КОНЕЦ КАК НомерДляСортировки
	|ИЗ
	|	Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗапросНаАвтоперевозку.ДополнительныеАдресаКлиента КАК ЗапросНаАвтоперевозкуДополнительныеАдресаКлиента
	|		ПО (ЗапросНаАвтоперевозкуДополнительныеАдресаКлиента.QueryID = ЗапросНаАвтоперевозкуКонтейнеры.ИдентификаторСтрокиТЧ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
	|		ПО ЗапросНаАвтоперевозкуКонтейнеры.КлючАналитикиПеревозки = КлючиАналитикиПеревозкиМили.Ссылка
	|			И (КлючиАналитикиПеревозкиМили.ЭтапПеревозки = ЗапросНаАвтоперевозкуКонтейнеры.Ссылка.ЭтапПеревозки)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТопонимProvince КАК ТопонимProvince
	|		ПО (ВЫБОР
	|				КОГДА ЕСТЬNULL(ЗапросНаАвтоперевозкуДополнительныеАдресаКлиента.АдресСкладаКлиента, ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка)
	|					ТОГДА КлючиАналитикиПеревозкиМили.АдресКлиента
	|				ИНАЧЕ ЗапросНаАвтоперевозкуДополнительныеАдресаКлиента.АдресСкладаКлиента
	|			КОНЕЦ = ТопонимProvince.Ссылка)
	|ГДЕ
	|	ЗапросНаАвтоперевозкуКонтейнеры.Ссылка = &СсылкаЗапросНаАвтоперевозку
	|	И ЗапросНаАвтоперевозкуКонтейнеры.ИдентификаторСтрокиТЧ В(&СтрокиКВыгрузке)
	|	И НЕ ЗапросНаАвтоперевозкуКонтейнеры.НеТребуетсяАдрес
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерДляСортировки";
	
	Запрос.УстановитьПараметр("СсылкаЗапросНаАвтоперевозку", Параметры.СсылкаЗапросНаАвтоперевозку);
	Запрос.УстановитьПараметр("СтрокиКВыгрузке", Параметры.СтрокиКВыгрузке);
    Запрос.УстановитьПараметр("ВидТопонима", "province");
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции //Евросиб Коханенко Н.А. 11.12.2023 )) US 75549 TA 75774

//Евросиб Коханенко Н.А. 18.03.2025 (( #104519 
&НаСервере
Процедура РегЗадание_ОбменСТранспортнойЛогистикой() Экспорт

	НомерСообщения = 1;
	
	УзлыОбмена = ПланыОбмена.ВыгрузкаДанных.ПолучитьУзелОбмена(Перечисления.УзлыОбмена.ТЛ);
	Для каждого Узел Из УзлыОбмена Цикл 
		ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(Узел, НомерСообщения); 
		
		МассивСсылокКВыгрузке = Новый Массив;
		Пока ВыборкаИзменений.Следующий() Цикл    
			ЗапросНаАвтоСсылка = ВыборкаИзменений.Получить().Ссылка; 
			МассивСсылокКВыгрузке.Добавить(ЗапросНаАвтоСсылка); 
		КонецЦикла;  
		
		Если МассивСсылокКВыгрузке.Количество() Тогда
	
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЗапросНаАвтоперевозкуКонтейнеры.Ссылка КАК СсылкаЗапросНаАвтоперевозку,
				|	ЗапросНаАвтоперевозкуКонтейнеры.ИдентификаторСтрокиТЧ КАК ИдентификаторСтрокиТЧ,
				|	ЗапросНаАвтоперевозкуКонтейнеры.ИдентификаторСтрокиУслуги КАК ИдентификаторСтрокиУслуги
				|ИЗ
				|	Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗапросНаАвтоперевозку КАК ЗапросНаАвтоперевозку
				|		ПО ЗапросНаАвтоперевозкуКонтейнеры.Ссылка = ЗапросНаАвтоперевозку.Ссылка
				|ГДЕ
				|	ЗапросНаАвтоперевозку.Ссылка В(&МассивСсылокКВыгрузке)
				|	И ЗапросНаАвтоперевозку.Проведен
				|	И ЗапросНаАвтоперевозку.ЭтапПеревозки = &ЭтапПеревозки
				|	И (ЗапросНаАвтоперевозкуКонтейнеры.СтатусЗапросаНаАвтоперевозку = ЗНАЧЕНИЕ(Перечисление.СтатусЗапросаНаПеревозку.ГотовКОтправке)
				|			ИЛИ ЗапросНаАвтоперевозкуКонтейнеры.СтатусЗапросаНаАвтоперевозку = ЗНАЧЕНИЕ(Перечисление.СтатусЗапросаНаПеревозку.Отправлен))
				|
				|УПОРЯДОЧИТЬ ПО
				|	ЗапросНаАвтоперевозкуКонтейнеры.Ссылка";	
			Запрос.Параметры.Вставить("МассивСсылокКВыгрузке", МассивСсылокКВыгрузке);
			Запрос.Параметры.Вставить("ЭтапПеревозки", Перечисления.ЭтапыПеревозки.СредняяМиля);
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			
			ИмяМетода = "ЕСОбменСервер.ПередатьЗапросыНаАвтоВТЛ";	
			
			Пока Выборка.СледующийПоЗначениюПоля("СсылкаЗапросНаАвтоперевозку") Цикл
				
				СтрокиКВыгрузке = Новый ТаблицаЗначений;  
				СтрокиКВыгрузке.Колонки.Добавить("ИдентификаторСтрокиТЧ", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
				СтрокиКВыгрузке.Колонки.Добавить("ИдентификаторСтрокиТабличнойЧасти", Новый ОписаниеТипов("Число",,,, Новый КвалификаторыЧисла(7, 0)));
				
				Пока Выборка.Следующий() Цикл
					СтрокаКВыгрузке = СтрокиКВыгрузке.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаКВыгрузке, Выборка);
				КонецЦикла;
				
				ПараметрыПроцедуры = Новый Массив;
				ПараметрыПроцедуры.Добавить(Новый Структура("СсылкаЗапросНаАвтоперевозку, СтрокиКВыгрузке", Выборка.СсылкаЗапросНаАвтоперевозку, СтрокиКВыгрузке));
				
				НаименованиеФоновогоЗадания = НСтр("ru = 'Обмен с Транспортной Логистикой (регламентное задание)'");
				КлючФоновогоЗадания = Строка(Новый УникальныйИдентификатор);
				
				ФоновоеЗадание = ФоновыеЗадания.Выполнить(ИмяМетода, ПараметрыПроцедуры, КлючФоновогоЗадания, НаименованиеФоновогоЗадания);
				ФоновоеЗадание.ОжидатьЗавершения(); 
				
				МассивСообщений = ДлительныеОперации.СообщенияПользователю(Истина, ФоновоеЗадание.УникальныйИдентификатор);
				Если МассивСообщений <> Неопределено Тогда
					Количество = МассивСообщений.Количество();
					Если Количество > 0 
						И СтрНачинаетсяС(МассивСообщений[0].Текст, "Обновлено") Тогда
						ПланыОбмена.УдалитьРегистрациюИзменений(Узел, Выборка.СсылкаЗапросНаАвтоперевозку); 
					КонецЕсли;
					Для Номер = 0 По Количество - 1 Цикл
						Сообщение = МассивСообщений[Номер];
						Сообщить(Сообщение.Текст);
					КонецЦикла;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры //Евросиб Коханенко Н.А. 18.03.2025 )) #104519 

//Евросиб Коханенко Н.А. 20.03.2025 (( #102956 
Процедура ПередатьКлючАналитикиВDX(КлючАналитикиПеревозки)
	ПланыОбмена.ВыгрузкаДанных.ЗарегистрироватьИзмененияПоДокументу(КлючАналитикиПеревозки, Перечисления.УзлыОбмена.DX);
КонецПроцедуры //Евросиб Коханенко Н.А. 20.03.2025 )) #102956

//Евросиб Коханенко Н.А. 21.03.2025 (( #102956 
Функция ВыгрузитьКлючиАналитикиПеревозки(ИмяУзла) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИмяУзла) Тогда
		Возврат "<xml><error>Пустое значение параметра RequestingSystem!</error></xml>";
	КонецЕсли;  
	
	УзелОбмена = Неопределено;
	Для каждого ЗначПеречисления Из Метаданные.Перечисления.УзлыОбмена.ЗначенияПеречисления Цикл
		Если ЗначПеречисления.Имя = ИмяУзла Тогда
			УзелОбмена = Перечисления.УзлыОбмена[ЗначПеречисления.Имя];  
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	Если УзелОбмена = Неопределено Тогда
		Возврат "<xml><error>Не найден узел обмена по входному параметру RequestingSystem!</error></xml>";
	КонецЕсли;
	
	ВремяВыгрузки = ТекущаяДата();
	
	Запрос = Новый Запрос;
	
	УзлыПланаОбмена = ПланыОбмена.ВыгрузкаДанных.ПолучитьУзелОбмена(УзелОбмена);
	
	Если Не ЗначениеЗаполнено(УзлыПланаОбмена) Тогда
		Возврат "<xml><error>Не настроен узел плана обмена по входному параметру RequestingSystem!</error></xml>";
	КонецЕсли;           

	//Евросиб Каблов 20.05.2025 ( #110106
	НастройкаОбмена = Справочники.НастройкиОбменов.ПолучитьНастройкуОбмена(УзелОбмена, "GetTransportationAnalyticsKeys");
	
	КоличествоЗаписейВПорцииДанных = НастройкаОбмена.КоличествоЗаписейВПорцииДанных;
	Если ЗначениеЗаполнено(КоличествоЗаписейВПорцииДанных) Тогда
		КоличествоЗаписейВПорцииДанныхПлюсОдин = КоличествоЗаписейВПорцииДанных + 1;
		ТекстОграниченияПорции = СтрШаблон("ПЕРВЫЕ %1", Формат(КоличествоЗаписейВПорцииДанныхПлюсОдин, "ЧГ=0"));
	Иначе
		ТекстОграниченияПорции = "";
	КонецЕсли;
	//Евросиб Каблов 20.05.2025 )
	
	//начинаем отбор ключей аналитики из плана обмена
	
	Для Каждого Узел Из УзлыПланаОбмена Цикл 
		
		Запись = Новый ЗаписьXML; 
		Запись.УстановитьСтроку();
		Запись.ЗаписатьОбъявлениеXML(); 
		Запись.ЗаписатьНачалоЭлемента("Root"); 

		Запрос = Новый Запрос;
		//Евросиб Шевченко А.В. 15.05.2025 US 94035 TA 104217
		//Запрос.Текст = 
		//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
		//	|	КлючиАналитикиПеревозкиИзменения.Ссылка КАК Ссылка,
		//	|	КлючиАналитикиПеревозкиМили.ДатаВыдачиКТКСТерминала КАК ДатаВыдачиКТКСТерминала,
		//	|	КлючиАналитикиПеревозкиМили.ДатаСдачиКТКНаТерминал КАК ДатаСдачиКТКНаТерминал,
		//	|	ДанныеПакетовОбмена.ИдентификаторСтрокиПакетаДанных КАК ИдентификаторСтрокиПакетаДанных,
		//	|	ЗапросНаАвтоперевозкуКонтейнеры.ТерминалСдачиФакт КАК ТерминалСдачиФакт
		//	|ИЗ
		//	|	Справочник.КлючиАналитикиПеревозки.Изменения КАК КлючиАналитикиПеревозкиИзменения
		//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
		//	|		ПО (КлючиАналитикиПеревозкиИзменения.Ссылка = КлючиАналитикиПеревозкиМили.Ссылка)
		//	|			И (КлючиАналитикиПеревозкиМили.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.СредняяМиля))
		//	|			И КлючиАналитикиПеревозкиИзменения.Узел = &УзелОбмена
		//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПакетовОбмена КАК ДанныеПакетовОбмена
		//	|		ПО (ДанныеПакетовОбмена.ОбъектДанных = КлючиАналитикиПеревозкиИзменения.Ссылка)
		//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
		//	|		ПО КлючиАналитикиПеревозкиМили.ЗапросНаАвто = ЗапросНаАвтоперевозкуКонтейнеры.Ссылка
		//	|			И (КлючиАналитикиПеревозкиИзменения.Ссылка = ЗапросНаАвтоперевозкуКонтейнеры.КлючАналитикиПеревозки)
		//	|";
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 11
			|	КлючиАналитикиПеревозкиИзменения.Ссылка КАК Ссылка,
			|	КлючиАналитикиПеревозкиМили.ДатаВыдачиКТКСТерминала КАК ДатаВыдачиКТКСТерминала,
			|	КлючиАналитикиПеревозкиМили.ДатаСдачиКТКНаТерминал КАК ДатаСдачиКТКНаТерминал,
			//Евросиб Коханенко Н.А. 25.12.2025 (( #124559
			//|	ДанныеПакетовОбмена.ИдентификаторСтрокиПакетаДанных КАК ИдентификаторСтрокиПакетаДанных,
			|	ПротоколОбменов.УИДИсточника КАК ИдентификаторСтрокиПакетаДанных,
			//Евросиб Коханенко Н.А. 25.12.2025 )) #124559 
			|	ЗапросНаАвтоперевозкуКонтейнеры.ТерминалСдачиФакт КАК ТерминалСдачиФакт
			|ПОМЕСТИТЬ ВТ_Ключи
			|ИЗ
			|	Справочник.КлючиАналитикиПеревозки.Изменения КАК КлючиАналитикиПеревозкиИзменения
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
			|		ПО КлючиАналитикиПеревозкиИзменения.Ссылка = КлючиАналитикиПеревозкиМили.Ссылка
			|			И (КлючиАналитикиПеревозкиМили.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.СредняяМиля))
			|			И (КлючиАналитикиПеревозкиИзменения.Узел = &УзелОбмена)
			//Евросиб Коханенко Н.А. 25.12.2025 (( #124559
			//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПакетовОбмена КАК ДанныеПакетовОбмена
			//|		ПО (ДанныеПакетовОбмена.ОбъектДанных = КлючиАналитикиПеревозкиИзменения.Ссылка)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
			|		ПО (ПротоколОбменов.Объект = КлючиАналитикиПеревозкиИзменения.Ссылка)
			|			И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.DX))
			//|			И (ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
			//Евросиб Коханенко Н.А. 25.12.2025 )) #124559 
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
			|		ПО (КлючиАналитикиПеревозкиМили.ЗапросНаАвто = ЗапросНаАвтоперевозкуКонтейнеры.Ссылка)
			|			И КлючиАналитикиПеревозкиИзменения.Ссылка = ЗапросНаАвтоперевозкуКонтейнеры.КлючАналитикиПеревозки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			//Евросиб Коханенко Н.А. 06.03.2026 (( #117279 
			//|ВЫБРАТЬ
			//|	ВТ_Ключи.Ссылка КАК Ссылка,
			//|	ВТ_Ключи.ДатаВыдачиКТКСТерминала КАК ДатаВыдачиКТКСТерминала,
			//|	ВТ_Ключи.ДатаСдачиКТКНаТерминал КАК ДатаСдачиКТКНаТерминал,
			//|	ВТ_Ключи.ИдентификаторСтрокиПакетаДанных КАК ИдентификаторСтрокиПакетаДанных,
			//|	ВТ_Ключи.ТерминалСдачиФакт КАК ТерминалСдачиФакт
			//|ИЗ
			//|	ВТ_Ключи КАК ВТ_Ключи
			|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 11
			|	КлючиАналитикиПеревозкиИзменения.Ссылка КАК Ссылка,
			|	ПротоколОбменов.УИДИсточника КАК ИдентификаторСтрокиПакетаДанных,
			|	КлючиАналитикиПеревозкиМили.ДатаВыдачиКТКСТерминала КАК ДатаВыдачиКТКСТерминала,
			|	КлючиАналитикиПеревозкиМили.ДатаСдачиКТКНаТерминал КАК ДатаСдачиКТКНаТерминал,
			|	КлючиАналитикиПеревозкиМили.ДатаВыездаКТКСоСклада КАК ДатаВыездаКТКСоСклада,
			|	ЗапросНаАвтоперевозкуКонтейнеры.ТерминалВыдачиФакт КАК ТерминалВыдачиФакт,
			|	ЗапросНаАвтоперевозкуКонтейнеры.ТерминалСдачиФакт КАК ТерминалСдачиФакт
			|ПОМЕСТИТЬ вт_КлючиПоследнейМили
			|ИЗ
			|	Справочник.КлючиАналитикиПеревозки.Изменения КАК КлючиАналитикиПеревозкиИзменения
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
			|		ПО КлючиАналитикиПеревозкиИзменения.Ссылка = КлючиАналитикиПеревозкиМили.Ссылка
			|			И (КлючиАналитикиПеревозкиМили.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.ПоследняяМиля))
			|			И (КлючиАналитикиПеревозкиИзменения.Узел = &УзелОбмена)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
			|		ПО (ПротоколОбменов.Объект = КлючиАналитикиПеревозкиИзменения.Ссылка)
			|			И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.DX))
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
			|		ПО (КлючиАналитикиПеревозкиМили.ЗапросНаАвто = ЗапросНаАвтоперевозкуКонтейнеры.Ссылка)
			|			И КлючиАналитикиПеревозкиИзменения.Ссылка = ЗапросНаАвтоперевозкуКонтейнеры.КлючАналитикиПеревозки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 11
			|	ВТ_Ключи.Ссылка КАК Ссылка,
			|	ВТ_Ключи.ИдентификаторСтрокиПакетаДанных КАК ИдентификаторСтрокиПакетаДанных,
			|	ВТ_Ключи.ДатаВыдачиКТКСТерминала КАК ДатаВыдачиКТКСТерминала,
			|	ВТ_Ключи.ДатаСдачиКТКНаТерминал КАК ДатаСдачиКТКНаТерминал,
			|	ВТ_Ключи.ТерминалСдачиФакт КАК ТерминалСдачиФакт,
			|	ЕСТЬNULL(вт_КлючиПоследнейМили.ДатаВыдачиКТКСТерминала, ДАТАВРЕМЯ(1,1,1)) КАК ПоследняяМиляДатаВыдачиКТКСТерминала,
			|	ЕСТЬNULL(вт_КлючиПоследнейМили.ДатаВыездаКТКСоСклада, ДАТАВРЕМЯ(1,1,1)) КАК ПоследняяМиляДатаВыездаКТКСоСклада,
			|	ЕСТЬNULL(вт_КлючиПоследнейМили.ДатаСдачиКТКНаТерминал, ДАТАВРЕМЯ(1,1,1)) КАК ПоследняяМиляДатаСдачиКТКНаТерминал,
			|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ЕСТЬNULL(вт_КлючиПоследнейМили.ТерминалВыдачиФакт, ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка))) КАК ПоследняяМиляТерминалВыдачиФактГУИД,
			|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ЕСТЬNULL(вт_КлючиПоследнейМили.ТерминалСдачиФакт, ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка))) КАК ПоследняяМиляТерминалСдачиФактГУИД
			|ИЗ
			|	ВТ_Ключи КАК ВТ_Ключи
			|	ПОЛНОЕ СОЕДИНЕНИЕ вт_КлючиПоследнейМили КАК вт_КлючиПоследнейМили
			|		ПО ВТ_Ключи.Ссылка = вт_КлючиПоследнейМили.Ссылка
			|			И ВТ_Ключи.ИдентификаторСтрокиПакетаДанных = вт_КлючиПоследнейМили.ИдентификаторСтрокиПакетаДанных
			//Евросиб Коханенко Н.А. 06.03.2026 )) #117279 
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Ключи.Ссылка КАК Ссылка,
			|	КлючиАналитикиПеревозкиЭтапыСНП.ЭтапСНП КАК ЭтапСНП,
			|	КлючиАналитикиПеревозкиЭтапыСНП.НомерСчета КАК НомерСчета,
			|	КлючиАналитикиПеревозкиЭтапыСНП.ДатаСчета КАК ДатаСчета
			|ИЗ
			|	ВТ_Ключи КАК ВТ_Ключи
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.ЭтапыСНП КАК КлючиАналитикиПеревозкиЭтапыСНП
			|		ПО ВТ_Ключи.Ссылка = КлючиАналитикиПеревозкиЭтапыСНП.Ссылка";
		//Евросиб Каблов 20.05.2025 ( #110106
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 11", ТекстОграниченияПорции);
		//Евросиб Каблов 20.05.2025 )
		//Евросиб Шевченко А.В. 15.05.2025 US 94035 TA 104217	
		Запрос.Параметры.Вставить("УзелОбмена", Узел); 
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		//Евросиб Коханенко Н.А. 06.03.2026 (( #117279 
		//Выборка = РезультатЗапроса[1].Выбрать();
		//тЭтапыСНП = РезультатЗапроса[2].Выгрузить(); //Евросиб Шевченко А.В. 15.05.2025 US 94035 TA 104217
		Выборка = РезультатЗапроса[2].Выбрать();
		тЭтапыСНП = РезультатЗапроса[3].Выгрузить(); //Евросиб Шевченко А.В. 15.05.2025 US 94035 TA 104217
		//Евросиб Коханенко Н.А. 06.03.2026 )) #117279 
		//Евросиб Каблов 20.05.2025 ( #110106
		Счетчик = 0;
		ОсталисьДанныеДляВыгрузки = Ложь;
		КоличествоЗаписейВПорцииДанных = НастройкаОбмена.КоличествоЗаписейВПорцииДанных;
		Если ЗначениеЗаполнено(КоличествоЗаписейВПорцииДанных) Тогда
			ОграничиватьПорцию = Истина;
		Иначе
			ОграничиватьПорцию = Ложь;
		КонецЕсли;
		//Евросиб Каблов 20.05.2025 )
		
		Пока Выборка.Следующий() Цикл
			
			//Евросиб Каблов 20.05.2025 ( #110106
			Счетчик = Счетчик + 1;
			Если ОграничиватьПорцию И Счетчик > КоличествоЗаписейВПорцииДанных Тогда
				ОсталисьДанныеДляВыгрузки = Истина;
				Прервать;
			КонецЕсли;
			//Евросиб Каблов 20.05.2025 )
			ГУИДПакетаДанных = XMLСтрока(Выборка.ИдентификаторСтрокиПакетаДанных);
			ГУИДТерминала = XMLСтрока(Выборка.ТерминалСдачиФакт.УникальныйИдентификатор());
			
			Запись.ЗаписатьНачалоЭлемента("КлючАналитикиПеревозки"); 
			Запись.ЗаписатьАтрибут("ГУИД",				ГУИДПакетаДанных);
			Запись.ЗаписатьАтрибут("ДатаИВремяВывоза",	XMLСтрока(Выборка.ДатаВыдачиКТКСТерминала));
			Запись.ЗаписатьАтрибут("ДатаИВремяСдачи",	XMLСтрока(Выборка.ДатаСдачиКТКНаТерминал));
			Запись.ЗаписатьАтрибут("ТерминалСдачиГУИД",	ГУИДТерминала);
			//Евросиб Коханенко Н.А. 06.03.2026 (( #117279 
			Запись.ЗаписатьАтрибут("ПоследняяМиляДатаВыдачиКТКСТерминала",	XMLСтрока(Выборка.ПоследняяМиляДатаВыдачиКТКСТерминала));
			Запись.ЗаписатьАтрибут("ПоследняяМиляДатаВыездаКТКСоСклада",	XMLСтрока(Выборка.ПоследняяМиляДатаВыездаКТКСоСклада));
			Запись.ЗаписатьАтрибут("ПоследняяМиляДатаСдачиКТКНаТерминал",	XMLСтрока(Выборка.ПоследняяМиляДатаСдачиКТКНаТерминал));
			Запись.ЗаписатьАтрибут("ПоследняяМиляТерминалВыдачиФактГУИД",	XMLСтрока(Выборка.ПоследняяМиляТерминалВыдачиФактГУИД));
			Запись.ЗаписатьАтрибут("ПоследняяМиляТерминалСдачиФактГУИД",	XMLСтрока(Выборка.ПоследняяМиляТерминалСдачиФактГУИД));
			//Евросиб Коханенко Н.А. 06.03.2026 )) #117279 
			//Евросиб Шевченко А.В. 15.05.2025 US 94035 TA 104217
			Запись.ЗаписатьНачалоЭлемента("ЭтапыСНП");
			Для Каждого СтрокаЭтапСНП Из тЭтапыСНП Цикл
				Атрибуты = Новый Соответствие();
				Атрибуты.Вставить("НомерЭтапаСНП",XMLСтрока(СтрокаЭтапСНП.ЭтапСНП));
				Атрибуты.Вставить("НомерСчета",XMLСтрока(СтрокаЭтапСНП.НомерСчета));
				Атрибуты.Вставить("ДатаСчета",XMLСтрока(СтрокаЭтапСНП.ДатаСчета));
				ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ЭтапСНП","" ,Атрибуты);
			КонецЦикла;
			Запись.ЗаписатьКонецЭлемента();
			//Евросиб Шевченко А.В. 15.05.2025 US 94035 TA 104217
			Запись.ЗаписатьКонецЭлемента();

			СтруктураПоиска = Новый Структура("ДействиеПриОбмене, УзелОбмена, Объект", Перечисления.ДействияПриОбмене.ВыгрузкаДанных, УзелОбмена, Выборка.Ссылка);
			СтруктураДанных = Новый Структура("УИДИсточника, ЗагрузкаПодтверждена, ДатаОбмена", ГУИДПакетаДанных, Ложь, ВремяВыгрузки);
			РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных);
			
		КонецЦикла;
		
		//Евросиб Каблов 20.05.2025 ( #110106
		ДобавитьЭлементВФайл(Запись, "ОсталисьДанныеДляВыгрузки", ОсталисьДанныеДляВыгрузки);
		//Евросиб Каблов 20.05.2025 )
		Запись.ЗаписатьКонецЭлемента();
		ОтветXml = Запись.Закрыть();
		
	КонецЦикла;
	
	Возврат ОтветXml;

КонецФункции //Евросиб Коханенко Н.А. 21.03.2025 )) #102956

//Евросиб Коханенко Н.А. 24.03.2025 (( #102956 
Функция ПолучитьТаблицуКлючейАналитикиПеревозки(МассивГУИДовСтрокДХ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеПакетовОбмена.Объект КАК Ссылка,
		|	ДанныеПакетовОбмена.УИДИсточника КАК ГУИД
		|ИЗ
		|	Справочник.КлючиАналитикиПеревозки.Изменения КАК КлючиАналитикиПеревозкиИзменения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ДанныеПакетовОбмена
		|		ПО (ДанныеПакетовОбмена.Объект = КлючиАналитикиПеревозкиИзменения.Ссылка)
		|			И (ДанныеПакетовОбмена.УИДИсточника В (&МассивГУИДовСтрокДХ))";	
	Запрос.Параметры.Вставить("МассивГУИДовСтрокДХ", МассивГУИДовСтрокДХ);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	//Евросиб Коханенко Н.А. 18.03.2026 (( #117279 
	//Возврат РезультатЗапроса.Выгрузить();
 	Возврат РезультатЗапроса;
   //Евросиб Коханенко Н.А. 18.03.2026 )) #117279 
	
КонецФункции //Евросиб Коханенко Н.А. 24.03.2025 )) #102956 

// Евросиб US 105219 TA 105220 Рыбьяков К.А. 16.04.2025 ((
Функция ВыгрузитьПротоколы(Параметр) Экспорт
		
	УзлыПланаОбмена = ПланыОбмена.ВыгрузкаДанных.ПолучитьУзелОбмена(Перечисления.УзлыОбмена.ТЛ);
	
	ТаблицаОтвета = Новый ТаблицаЗначений;
	ТаблицаОтвета.Колонки.Добавить("ГУИД");
	ТаблицаОтвета.Колонки.Добавить("ДатаПСЦ");
	ТаблицаОтвета.Колонки.Добавить("НомерПСЦ");
	ТаблицаОтвета.Колонки.Добавить("НачалоДействия");
	ТаблицаОтвета.Колонки.Добавить("ОкончаниеДействия");
	ТаблицаОтвета.Колонки.Добавить("ИдентификаторДоговора");
	ТаблицаОтвета.Колонки.Добавить("СтавкаНДС");
	ТаблицаОтвета.Колонки.Добавить("ПредставлениеСсылки");
	//Евросиб Коханенко Н.А. 24.09.2025 (( #119429 
	ТаблицаОтвета.Колонки.Добавить("ПометкаУдаления"); 
	//Евросиб Коханенко Н.А. 24.09.2025 )) #119429 
	
	Запись = Новый ЗаписьXML; 
	Запись.УстановитьСтроку("windows-1251");
	Запись.ЗаписатьОбъявлениеXML(); 
	Запись.ЗаписатьНачалоЭлемента("Root");
	
	Для Каждого УзелОбмена Из УзлыПланаОбмена Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПСЦИзменения.Ссылка КАК Ссылка,
		|	ПСЦ.ДатаПСЦ КАК ДатаПСЦ,
		|	ПСЦ.НомерПСЦ КАК НомерПСЦ,
		|	ПСЦ.НачалоДействия КАК НачалоДействия,
		|	ПСЦ.ОкончаниеДействия КАК ОкончаниеДействия,
		|	ПубличныеИдентификаторы.Идентификатор КАК ИдентификаторДоговора,
		|	ПСЦ.СтавкаНДС КАК СтавкаНДС,
		//Евросиб Коханенко Н.А. 24.09.2025 (( #119429 
		|	ПСЦ.ПометкаУдаления КАК ПометкаУдаления, 
		//Евросиб Коханенко Н.А. 24.09.2025 )) #119429 
		|	ПРЕДСТАВЛЕНИЕ(ПСЦИзменения.Ссылка) КАК ПредставлениеСсылки
		|ИЗ
		|	Документ.ПСЦ.Изменения КАК ПСЦИзменения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПСЦ КАК ПСЦ
		|		ПО ПСЦИзменения.Ссылка = ПСЦ.Ссылка
		|			И (ПСЦИзменения.Узел = &УзелОбмена)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПубличныеИдентификаторы
		|		ПО (ПСЦ.Договор = ПубличныеИдентификаторы.Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПСЦПоставщикаИзменения.Ссылка КАК Ссылка,
		|	ДокументПСЦПоставщика.ДатаПСЦ КАК ДатаПСЦ,
		|	ДокументПСЦПоставщика.НомерПСЦ КАК НомерПСЦ,
		|	ДокументПСЦПоставщика.НачалоДействия КАК НачалоДействия,
		|	ДокументПСЦПоставщика.ОкончаниеДействия КАК ОкончаниеДействия,
		|	ПубличныеИдентификаторы.Идентификатор КАК ИдентификаторДоговора,
		//|	ВЫБОР
		//|		КОГДА ДокументПСЦПоставщика.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
		//|			ИЛИ ДокументПСЦПоставщика.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5_105)
		//|			ИЛИ ДокументПСЦПоставщика.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
		//|			ИЛИ ДокументПСЦПоставщика.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7_107)
		//|		ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка)
		//|		ИНАЧЕ ДокументПСЦПоставщика.СтавкаНДС
		//|	КОНЕЦ КАК СтавкаНДС,
		|	ДокументПСЦПоставщика.СтавкаНДС КАК СтавкаНДС,
		//Евросиб Коханенко Н.А. 24.09.2025 (( #119429 
		|	ДокументПСЦПоставщика.ПометкаУдаления КАК ПометкаУдаления, 
		//Евросиб Коханенко Н.А. 24.09.2025 )) #119429 
		|	ПРЕДСТАВЛЕНИЕ(ПСЦПоставщикаИзменения.Ссылка) КАК ПредставлениеСсылки
		|ИЗ
		|	Документ.ПСЦПоставщика.Изменения КАК ПСЦПоставщикаИзменения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПСЦПоставщика КАК ДокументПСЦПоставщика
		|		ПО ПСЦПоставщикаИзменения.Ссылка = ДокументПСЦПоставщика.Ссылка
		|			И (ПСЦПоставщикаИзменения.Узел = &УзелОбмена)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПубличныеИдентификаторы
		|		ПО (ДокументПСЦПоставщика.Договор = ПубличныеИдентификаторы.Ссылка)";
		
		Запрос.Параметры.Вставить("УзелОбмена", УзелОбмена);
		
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
		ВыборкаПСЦ = РезультатыЗапроса[0].Выбрать();
		
		Пока ВыборкаПСЦ.Следующий() Цикл
			
			НоваяСтрока = ТаблицаОтвета.Добавить();
			НоваяСтрока.ГУИД = ВыборкаПСЦ.Ссылка.УникальныйИдентификатор();
			НоваяСтрока.ДатаПСЦ = ВыборкаПСЦ.ДатаПСЦ;
			НоваяСтрока.НомерПСЦ = ВыборкаПСЦ.НомерПСЦ;
			НоваяСтрока.НачалоДействия = ВыборкаПСЦ.НачалоДействия;
			НоваяСтрока.ОкончаниеДействия = ВыборкаПСЦ.ОкончаниеДействия;
			НоваяСтрока.ИдентификаторДоговора = ВыборкаПСЦ.ИдентификаторДоговора;
			НоваяСтрока.СтавкаНДС = ВыборкаПСЦ.СтавкаНДС;
			НоваяСтрока.ПредставлениеСсылки = ВыборкаПСЦ.ПредставлениеСсылки;
			//Евросиб Коханенко Н.А. 24.09.2025 (( #119429 
			НоваяСтрока.ПометкаУдаления = ВыборкаПСЦ.ПометкаУдаления; 
			//Евросиб Коханенко Н.А. 24.09.2025 )) #119429 
			
		КонецЦикла;
		
		ВыборкаПСЦПоставщика = РезультатыЗапроса[1].Выбрать();
		
		Пока ВыборкаПСЦПоставщика.Следующий() Цикл
			
			НоваяСтрока = ТаблицаОтвета.Добавить();
			НоваяСтрока.ГУИД = ВыборкаПСЦПоставщика.Ссылка.УникальныйИдентификатор();
			НоваяСтрока.ДатаПСЦ = ВыборкаПСЦПоставщика.ДатаПСЦ;
			НоваяСтрока.НомерПСЦ = ВыборкаПСЦПоставщика.НомерПСЦ;
			НоваяСтрока.НачалоДействия = ВыборкаПСЦПоставщика.НачалоДействия;
			НоваяСтрока.ОкончаниеДействия = ВыборкаПСЦПоставщика.ОкончаниеДействия;
			НоваяСтрока.ИдентификаторДоговора = ВыборкаПСЦПоставщика.ИдентификаторДоговора;
			НоваяСтрока.СтавкаНДС = ВыборкаПСЦПоставщика.СтавкаНДС;
			НоваяСтрока.ПредставлениеСсылки = ВыборкаПСЦПоставщика.ПредставлениеСсылки;
			//Евросиб Коханенко Н.А. 24.09.2025 (( #119429 
			НоваяСтрока.ПометкаУдаления = ВыборкаПСЦПоставщика.ПометкаУдаления; 
			//Евросиб Коханенко Н.А. 24.09.2025 )) #119429 
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(ТаблицаОтвета);
	
КонецФункции

Функция ПолучитьМассивСсылокПСЦ(МассивГУИДов)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПСЦИзменения.Узел КАК Узел,
	|	ПСЦИзменения.Ссылка КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ПСЦИзменения.Ссылка) КАК УникальныйИдентификатор
	|ИЗ
	|	Документ.ПСЦ.Изменения КАК ПСЦИзменения
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПСЦПоставщикаИзменения.Узел,
	|	ПСЦПоставщикаИзменения.Ссылка КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ПСЦПоставщикаИзменения.Ссылка)
	|ИЗ
	|	Документ.ПСЦПоставщика.Изменения КАК ПСЦПоставщикаИзменения";
	
	ТаблицаЗарегистрированных = Запрос.Выполнить().Выгрузить();
	
	ПараметрыОтбора = Новый Структура;
	
	МассивСсылокКлючей = Новый Массив;
	
	Для Каждого ГУИД Из МассивГУИДов Цикл
		ПараметрыОтбора.Вставить("УникальныйИдентификатор", Новый УникальныйИдентификатор(ГУИД));
		НайденныеСтроки = ТаблицаЗарегистрированных.НайтиСтроки(ПараметрыОтбора);
		Для Каждого Строка Из НайденныеСтроки Цикл
			МассивСсылокКлючей.Добавить(Строка.Ссылка);
		КонецЦикла;
	КонецЦикла;
	
	Возврат МассивСсылокКлючей;

КонецФункции

Функция ЗагрузитьДоговорыИзТЛ(XMLParams) Экспорт
	
	ПараметрыXml = ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	
	МассивГуидов = ПараметрыXml.ВыгрузитьКолонку("ГУИД");
	
	ТаблицаОтвета = Новый ТаблицаЗначений;
	ТаблицаОтвета.Колонки.Добавить("ГУИД");
	
	Если МассивГуидов.Количество() > 0 Тогда
		
		УзлыПланаОбмена = ПланыОбмена.ВыгрузкаДанных.ПолучитьУзелОбмена(Перечисления.УзлыОбмена.ТЛ);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПротоколОбменов.Объект КАК Ссылка,
		|	ПротоколОбменов.УИДИсточника КАК УИДИсточника
		|ИЗ
		|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		|ГДЕ
		|	ПротоколОбменов.УзелОбмена = &УзелОбмена
		|	И ПротоколОбменов.УИДИсточника В(&УИДИсточника)";
		
		Запрос.УстановитьПараметр("УзелОбмена", Перечисления.УзлыОбмена.БитФинанс);
		Запрос.УстановитьПараметр("УИДИсточника", МассивГуидов);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СтруктураЗаписи = Новый Структура;
			СтруктураЗаписи.Вставить("УзелИнформационнойБазы", УзлыПланаОбмена[0]);
			СтруктураЗаписи.Вставить("Ссылка", Выборка.Ссылка);
			СтруктураЗаписи.Вставить("Идентификатор", Выборка.УИДИсточника);
			РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.ДобавитьЗапись(СтруктураЗаписи);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(ТаблицаОтвета);
		
КонецФункции
// Евросиб Рыбьяков К.А. 16.04.2025 ))

//Евросиб Коханенко Н.А. 21.07.2025 (( #114761 
Функция ПолучитьТипОперацииНаТерминалеПоОперацииВыполненияВТЛ(ОперацияВыполнения)
	
	СоотвЗначений = Новый Соответствие;
	СоотвЗначений.Вставить("загрузка грузом порожнего КТК", ПредопределенноеЗначение("Перечисление.ТипОперацииНаТерминале.ЗагрузкаПорожнегоКТК"));
	СоотвЗначений.Вставить("прием груженого КТК", 		ПредопределенноеЗначение("Перечисление.ТипОперацииНаТерминале.ПриемГруженогоКТК"));
	СоотвЗначений.Вставить("получение порожнего КТК", 	ПредопределенноеЗначение("Перечисление.ТипОперацииНаТерминале.ПриемПорожнегоКТК"));
	СоотвЗначений.Вставить("разгрузка груженого КТК", 	ПредопределенноеЗначение("Перечисление.ТипОперацииНаТерминале.РазгрузкаГруженогоКТК"));
	СоотвЗначений.Вставить("сдача груженого КТК", 		ПредопределенноеЗначение("Перечисление.ТипОперацииНаТерминале.СдачаГруженогоКТК"));
	СоотвЗначений.Вставить("сдача порожнего КТК", 		ПредопределенноеЗначение("Перечисление.ТипОперацииНаТерминале.СдачаПорожнегоКТК"));
	СоотвЗначений.Вставить(Неопределено, 				ПредопределенноеЗначение("Перечисление.ТипОперацииНаТерминале.ПустаяСсылка"));
	СоотвЗначений.Вставить("", 							ПредопределенноеЗначение("Перечисление.ТипОперацииНаТерминале.ПустаяСсылка"));
	
	Результат = СоотвЗначений.Получить(ОперацияВыполнения);
	Возврат Результат;
	
КонецФункции //Евросиб Коханенко Н.А. 21.07.2025 )) #114761 

//Евросиб Коханенко Н.А. 16.07.2025 (( #114766
//получение Реестров Автоперевозчиков из ТЛ
Функция ЗагрузитьРеестрыАвтоперевозчикаИзТЛ(XMLParams) Экспорт  
	
	МассивОтветов = Новый Массив;
	
	ПараметрыXml = ОбщегоНазначения.ЗначениеИзСтрокиXML(XMLParams);
	Если ПараметрыXML.Количество() > 0 Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		Для Каждого ДанныеРеестра Из ПараметрыXML Цикл
			Попытка
				РеестрОбъект = Неопределено;
			    РеестрСсылка = Документы.РеестрАвтоподрядчика.ПолучитьСсылку(ДанныеРеестра.ГУИДРеестра);
				РеестрОбъект = РеестрСсылка.ПолучитьОбъект();
				//если реестр не нашелся или не было ГУИДа для поиска
				Если РеестрОбъект = Неопределено Тогда
					//создаем новый реестр
					РеестрОбъект = Документы.РеестрАвтоподрядчика.СоздатьДокумент();
					РеестрОбъект.Дата = ТекущаяДата();
					РеестрОбъект.УстановитьСсылкуНового(РеестрСсылка);
				КонецЕсли;
					
				РеестрОбъект.ДатаРеестраВТЛ = ДанныеРеестра.ДатаРеестра;
				РеестрОбъект.ДатаНачала = ДанныеРеестра.ПериодНачало;
				РеестрОбъект.ДатаОкончания = ДанныеРеестра.ПериодОкончание;
				РеестрОбъект.ВнешнийНомерРеестра = ДанныеРеестра.ВнешнийНомерРеестра;
				РеестрОбъект.НомерРеестраВТЛ = ДанныеРеестра.НомерРеестра;
				//Евросиб Трундуков С.А 15.08.2025 (( #118894
				//Было РеестрОбъект.КомментарийДиспетчераИзТЛ = ДанныеРеестра.Комментарий;
				//Было РеестрОбъект.Договор = ПолучитьДоговорПоГУИД(ДанныеРеестра.Договор);
	            //Было РеестрОбъект.Контрагент = ПолучитьКонтрагентаПоГУИД(ДанныеРеестра.Контрагент);
				РеестрОбъект.Комментарий = ДанныеРеестра.Комментарий;
				РеестрОбъект.Договор = РегистрыСведений.ПротоколОбменов.СсылкаПоУИД(Строка(ДанныеРеестра.Договор), Перечисления.ДействияПриОбмене.ЗагрузкаДанных, Перечисления.УзлыОбмена.БитФинанс);
				РеестрОбъект.Контрагент = РегистрыСведений.ПротоколОбменов.СсылкаПоУИД(Строка(ДанныеРеестра.Контрагент), Перечисления.ДействияПриОбмене.ЗагрузкаДанных, Перечисления.УзлыОбмена.БитФинанс);
				//Евросиб Трундуков С.А 15.08.2025 )) #118894
				РеестрОбъект.СтавкаНДС = ПолучитьСтавкуНДС(ДанныеРеестра.СтавкаНДС);
				РеестрОбъект.ВидРеестра = Справочники.ВидыУслугПоставщиков.Автоперевозки;//Евросиб Трундуков С.А 12.08.2025 #118894
				РеестрОбъект.ПСЦПоставщика = ПолучитьПротоколПоГУИД(ДанныеРеестра.ПротоколПоставщика); //Евросиб Трундуков С.А 13.08.2025 #118894
				РеестрОбъект.СтатусРеестра = Справочники.СтатусыДокументов.АвтоподрядчикНовый; //Евросиб Трундуков С.А 16.08.2025 #118894
				РеестрОбъект.Валюта = Справочники.Валюты.Рубль; //Евросиб Трундуков С.А 16.08.2025 #118894
				РеестрОбъект.ОтветственныйМенеджер = ?(ЗначениеЗаполнено(РеестрОбъект.Договор), ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеестрОбъект.Договор,"ОтветственныйЗаДоговор"), Справочники.Пользователи.ПустаяСсылка()); //Евросиб Трундуков С.А 18.08.2025 #118894
				РеестрОбъект.Подразделение = Справочники.Подразделения.НайтиПоНаименованию("Основное подразделение");//Евросиб Трундуков С.А 18.08.2025 #118894
				РеестрОбъект.ЦФО = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеестрОбъект.Подразделение,"ЦФО");//Евросиб Трундуков С.А 18.08.2025 #118894
				РеестрОбъект.Создано = ТекущаяДата();//Евросиб Трундуков С.А 24.08.2025 #118894
				РеестрОбъект.Организация=  ПолучитьОрганизациюПоГУИД(Строка(ДанныеРеестра.Организация));//Евросиб Трундуков С.А 27.08.2025 #118894
				
				ДанныеТЧ = ДанныеРеестра.ЗаказыНаТС;
				Если ДанныеТЧ.Количество() > 0 Тогда
					//Евросиб Трундуков С.А 08.09.2025 (( #118894
										
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	ТЧРеестра.ИдентификаторСтрокиЗапросаНаАвтоперевозку КАК ИдентификаторСтрокиЗапросаНаАвтоперевозку,
						|	ТЧРеестра.ДатаВремяПодачиКТКПлан КАК ДатаВремяПодачиКТКПлан,
						|	ТЧРеестра.НормативныйСрокПогрузкиВыгрузки КАК НормативныйСрокПогрузкиВыгрузки,
						|	ТЧРеестра.ДопАдресаКоличество КАК ДопАдресаКоличество,
						|	ТЧРеестра.БазоваяСтавкаНадбавка КАК БазоваяСтавкаНадбавка
						|ПОМЕСТИТЬ ГуидЗаказаНаТС
						|ИЗ
						|	&ТаблицаРеестра КАК ТЧРеестра
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	КлючиАналитикиПеревозкиМили.ЗапросНаАвто КАК ЗапросНаАвто,
						|	КлючиАналитикиПеревозкиМили.ПротоколПоставщика КАК ПСЦПоставщика,
						|	КлючиАналитикиПеревозкиМили.Ссылка КАК КлючАналитики,
						|	КлючиАналитикиПеревозкиМили.ХолостойПрогон КАК ХолостойПрогон,
						|	ГуидЗаказаНаТС.ИдентификаторСтрокиЗапросаНаАвтоперевозку КАК ИдентификаторСтрокиЗапросаНаАвтоперевозку,
						|	ВЫБОР
						|		КОГДА КлючиАналитикиПеревозкиМили.ХолостойПрогон = ЗНАЧЕНИЕ(Перечисление.ВидыПрогонаТС.ГруженыйПрогон)
						|			ТОГДА 0
						|		ИНАЧЕ ВЫБОР
						|				КОГДА ПСЦПост.СуммаВключаетНДС
						|					ТОГДА ТарифыПоставщиков.СтоимостьСНДС
						|				ИНАЧЕ ТарифыПоставщиков.СтоимостьБезНДС
						|			КОНЕЦ
						|	КОНЕЦ КАК ХолостойПрогонРуб
						|ИЗ
						|	ГуидЗаказаНаТС КАК ГуидЗаказаНаТС
						|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
						|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
						|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗапросНаАвтоперевозку КАК ЗапросНаАвтоперевозку
						|				ПО КлючиАналитикиПеревозкиМили.ЗапросНаАвто = ЗапросНаАвтоперевозку.Ссылка
						|					И (ЗапросНаАвтоперевозку.ЭтапПеревозки = КлючиАналитикиПеревозкиМили.ЭтапПеревозки)
						|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыПоставщиков КАК ТарифыПоставщиков
						|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПСЦПоставщика КАК ПСЦПост
						|					ПО ТарифыПоставщиков.Регистратор = ПСЦПост.Ссылка
						|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КритерииУслугПоставщиков КАК КритерииУслугПоставщиков
						|					ПО ТарифыПоставщиков.Критерий = КритерииУслугПоставщиков.Ссылка
						|						И (КритерииУслугПоставщиков.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.АвтоперевозкаХолостойПрогон))
						|				ПО (ТарифыПоставщиков.Регистратор = КлючиАналитикиПеревозкиМили.ПротоколПоставщика)
						|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
						|				ПО КлючиАналитикиПеревозкиМили.Ссылка = ЗаявкаСоставУслуги.КлючАналитикиПеревозки
						|					И (ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПУстаяСсылка))
						|			ПО ЗапросНаАвтоперевозкуКонтейнеры.КлючАналитикиПеревозки = КлючиАналитикиПеревозкиМили.Ссылка
						|		ПО ГуидЗаказаНаТС.ИдентификаторСтрокиЗапросаНаАвтоперевозку = ЗапросНаАвтоперевозкуКонтейнеры.ИдентификаторСтрокиТЧ";
					
					Запрос.УстановитьПараметр("ТаблицаРеестра", ДанныеТЧ);
					ТаблицаКлючей = Запрос.Выполнить().Выгрузить();
					Если РеестрОбъект.ПСЦПоставщика <> Документы.ПСЦПоставщика.ПустаяСсылка() Тогда
						ТаблицаКлючей.ЗаполнитьЗначения(РеестрОбъект.ПСЦПоставщика,"ПСЦПоставщика");	
					КонецЕсли;
					
					РеестрОбъект.Заказы.Загрузить(ТаблицаКлючей);				
					//Евросиб Трундуков С.А 08.09.2025 )) #118894
				КонецЕсли;
				
				РеестрОбъект.Заполнить(ИСТИНА);
				
				СтруктураОтвета = Новый Структура("GUID_TL, ResponseCode, ResponseText", "", 200, "");
				СтруктураОтвета.GUID_TL = ДанныеРеестра.ГУИДРеестра;
				
				РеестрОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение   
				ТекстОшибки = ОписаниеОшибки();
				СтруктураОтвета = Новый Структура("GUID_TL, ResponseCode, ResponseText", "", 400, "");
				СтруктураОтвета.ResponseText = ТекстОшибки;
				СтруктураОтвета.GUID_TL = ДанныеРеестра.ГУИДРеестра;
			КонецПопытки;
			
			МассивОтветов.Добавить(СтруктураОтвета);
			
		КонецЦикла;
		УстановитьПривилегированныйРежим(Ложь);

	КонецЕсли;
	
	Ответ = ОбщегоНазначения.ЗначениеВСтрокуXML(МассивОтветов);
	Возврат Ответ;

КонецФункции //Евросиб Коханенко Н.А. 16.07.2025 )) #114766 

//Евросиб Коханенко Н.А. 21.07.2025 (( #114766 
Функция ПолучитьСтавкуНДС(СтавкаНДССтрока)
	
	СоотвСтавокНДС = Новый Соответствие;
	СоотвСтавокНДС.Вставить("5%", ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС5"));
	СоотвСтавокНДС.Вставить("5% / 105%", ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС5_105"));
	СоотвСтавокНДС.Вставить("7%", ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7"));
	СоотвСтавокНДС.Вставить("7% / 107%", ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7_107"));
	СоотвСтавокНДС.Вставить("10%", ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10"));
	СоотвСтавокНДС.Вставить("10% / 110%", ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10_110"));
	СоотвСтавокНДС.Вставить("18%", ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18"));
	СоотвСтавокНДС.Вставить("18% / 118%", ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18_118"));
	СоотвСтавокНДС.Вставить("20%", ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20"));
	СоотвСтавокНДС.Вставить("20% / 120%", ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20_120"));
	СоотвСтавокНДС.Вставить("0%", ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0"));
	СоотвСтавокНДС.Вставить("Без НДС", ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС"));
	СоотвСтавокНДС.Вставить("", ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка"));
	СоотвСтавокНДС.Вставить(Неопределено, ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка"));
	//Евросиб СубботинВ #125845 09.12.2025 Начало
	//Евросиб Коханенко Н.А. 13.01.2026 (( #127442 
	//СоотвСтавокНДС.Вставить("22%", ПредопределенноеЗначение("Перечисление.СтавкиНДС.22"));
	СоотвСтавокНДС.Вставить("22%", ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22"));
	//Евросиб Коханенко Н.А. 13.01.2026 )) #127442 
	СоотвСтавокНДС.Вставить("22% / 122%", ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22_122"));
	//Евросиб СубботинВ #125845 09.12.2025 Конец


	
	Возврат Справочники.СтавкиНДС.НайтиПоРеквизиту("СтавкаНДС", СоотвСтавокНДС.Получить(СтавкаНДССтрока));
	
КонецФункции //Евросиб Коханенко Н.А. 21.07.2025 )) #114766 

//Евросиб Трундуков С.А 13.08.2025 (( #118894 
Функция ПолучитьПротоколПоГУИД(ГУИД)
	Если НЕ ЗначениеЗаполнено(ГУИД) Тогда
		Возврат Документы.ПСЦПоставщика.ПустаяСсылка();		
	КонецЕсли;
		
	ПсцГуид = Новый УникальныйИдентификатор(ГУИД);
	СсылкаПСЦ = Документы.ПСЦПоставщика.ПолучитьСсылку(ПсцГуид);
	Если ОбщегоНазначения.СсылкаСуществует(СсылкаПСЦ) Тогда
		Возврат СсылкаПСЦ;	
	Иначе
		Возврат Документы.ПСЦПоставщика.ПустаяСсылка();
	КонецЕсли;
КонецФункции 
//Евросиб Трундуков С.А 13.08.2025 )) #118894 

//Евросиб Трундуков С.А 02.09.2025 (( #118894 
Функция ПолучитьОрганизациюПоГУИД(ГУИД)
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("СправочникСсылка.Организации"));
	Возврат РегистрыСведений.ПротоколОбменов.СсылкаПоУИД(ГУИД, Перечисления.ДействияПриОбмене.ЗагрузкаДанных, Перечисления.УзлыОбмена.БитФинанс, МассивТипов)
КонецФункции 
//Евросиб Трундуков С.А 02.09.2025 )) #118894 
 
// Евросиб Рыбьяков К.А. 16.04.2025 ))  

//Евросиб Коханенко Н.А. 19.11.2025 (( #124142 
//передаем Типоразмеры КТК, если такие есть в Плане Обмена
Функция ПередатьТипоразмерыКТКвТЛ(Прокси, УзелОбмена)

	УзлыПланаОбмена = ПланыОбмена.ВыгрузкаДанных.ПолучитьУзелОбмена(УзелОбмена);
	
	Если Не ЗначениеЗаполнено(УзлыПланаОбмена) Тогда
		Возврат "<xml><error>Не настроен узел плана обмена по входному параметру RequestingSystem!</error></xml>";
	КонецЕсли;           

	НастройкаОбмена = Справочники.НастройкиОбменов.ПолучитьНастройкуОбмена(УзелОбмена, "UploadNSI");
	
	КоличествоЗаписейВПорцииДанных = НастройкаОбмена.КоличествоЗаписейВПорцииДанных;
	Если ЗначениеЗаполнено(КоличествоЗаписейВПорцииДанных) Тогда
		КоличествоЗаписейВПорцииДанныхПлюсОдин = КоличествоЗаписейВПорцииДанных + 1;
		ТекстОграниченияПорции = СтрШаблон("ПЕРВЫЕ %1", Формат(КоличествоЗаписейВПорцииДанныхПлюсОдин, "ЧГ=0"));
	Иначе
		ТекстОграниченияПорции = "";
	КонецЕсли;
	
	Для Каждого Узел Из УзлыПланаОбмена Цикл 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 999
			|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ТипоразмерыТЕ.Ссылка) КАК Идентификатор,
			|	ТипоразмерыТЕ.Наименование КАК Наименование,
			|	РазмерыКТК.Размер КАК РазмерКТК,
			|	ТипоразмерыТЕ.Длина КАК Длина,
			|	ТипоразмерыТЕ.Ширина КАК Ширина,
			|	ТипоразмерыТЕ.Высота КАК Высота,
			|	ТипоразмерыТЕ.Объем КАК Объем,
			|	ТипоразмерыТЕ.КодISO КАК КодISO,
			|	ТипоразмерыТЕ.ТЕУ КАК ТЕУ,
			|	ТипоразмерыТЕ.Рефрижераторный КАК Рефрижераторный
			|ИЗ
			|	Справочник.ТипоразмерыТЕ.Изменения КАК ТипоразмерыТЕИзменения
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипоразмерыТЕ КАК ТипоразмерыТЕ
			|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РазмерыКТК КАК РазмерыКТК
			|			ПО ТипоразмерыТЕ.РазмерКТК = РазмерыКТК.Ссылка
			|		ПО ТипоразмерыТЕИзменения.Ссылка = ТипоразмерыТЕ.Ссылка
			|ГДЕ
			|	ТипоразмерыТЕИзменения.Узел = &УзелОбмена";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 999", ТекстОграниченияПорции);
		Запрос.Параметры.Вставить("УзелОбмена", Узел); 
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	КонецЦикла; 
		
	ДанныеXML = ОбщегоНазначения.ЗначениеВСтрокуXML(Новый Структура("ТипоразмерыКТК, КоличествоЗаписейВПорцииДанных", РезультатЗапроса, КоличествоЗаписейВПорцииДанных));
		
	Ответ = Прокси.UploadNSI(ДанныеXML);
	Возврат Ответ;
			
КонецФункции //Евросиб Коханенко Н.А. 19.11.2025 )) #124142 

//Евросиб Коханенко Н.А. 03.02.2026 (( #125251 
//передаем Адреса в Населенных Пунктах, если такие есть в Плане Обмена
Функция ПередатьАдресаВНПвТЛ(Прокси, УзелОбмена) Экспорт

	УзлыПланаОбмена = ПланыОбмена.ВыгрузкаДанных.ПолучитьУзелОбмена(УзелОбмена);
	
	Если Не ЗначениеЗаполнено(УзлыПланаОбмена) Тогда
		Возврат "<xml><error>Не настроен узел плана обмена по входному параметру RequestingSystem!</error></xml>";
	КонецЕсли;           

	НастройкаОбмена = Справочники.НастройкиОбменов.ПолучитьНастройкуОбмена(УзелОбмена, "UploadNSI");
	
	КоличествоЗаписейВПорцииДанных = НастройкаОбмена.КоличествоЗаписейВПорцииДанных;
	Если ЗначениеЗаполнено(КоличествоЗаписейВПорцииДанных) Тогда
		КоличествоЗаписейВПорцииДанныхПлюсОдин = КоличествоЗаписейВПорцииДанных + 1;
		ТекстОграниченияПорции = СтрШаблон("ПЕРВЫЕ %1", Формат(КоличествоЗаписейВПорцииДанныхПлюсОдин, "ЧГ=0"));
	Иначе
		ТекстОграниченияПорции = "";
	КонецЕсли;
	
	Для Каждого Узел Из УзлыПланаОбмена Цикл 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 999
			|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(АдресаВНаселенныхПунктах.Ссылка) КАК Идентификатор,
			|	АдресаВНаселенныхПунктах.Адрес КАК Адрес,
			|	АдресаВНаселенныхПунктах.Широта КАК Широта,
			|	АдресаВНаселенныхПунктах.Долгота КАК Долгота,
			|	АдресаВНаселенныхПунктах.ПометкаУдаления КАК ПометкаУдаления,
			|	АдресаВНаселенныхПунктахКомпонентыАдреса.НомерСтроки КАК НомерСтроки,
			|	АдресаВНаселенныхПунктахКомпонентыАдреса.ВидНайденногоТопонима КАК ВидНайденногоТопонима,
			|	АдресаВНаселенныхПунктахКомпонентыАдреса.Имя КАК Имя
			|ИЗ
			|	Справочник.АдресаВНаселенныхПунктах.Изменения КАК АдресаВНаселенныхПунктахИзменения
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АдресаВНаселенныхПунктах.КомпонентыАдреса КАК АдресаВНаселенныхПунктахКомпонентыАдреса
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АдресаВНаселенныхПунктах КАК АдресаВНаселенныхПунктах
			|			ПО АдресаВНаселенныхПунктахКомпонентыАдреса.Ссылка = АдресаВНаселенныхПунктах.Ссылка
			|		ПО АдресаВНаселенныхПунктахИзменения.Ссылка = АдресаВНаселенныхПунктахКомпонентыАдреса.Ссылка
			|ГДЕ
			|	АдресаВНаселенныхПунктахИзменения.Узел = &УзелОбмена";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 999", ТекстОграниченияПорции);
		Запрос.Параметры.Вставить("УзелОбмена", Узел); 
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	КонецЦикла; 
		
	ДанныеXML = ОбщегоНазначения.ЗначениеВСтрокуXML(Новый Структура("АдресаВНаселенныхПунктах, КоличествоЗаписейВПорцииДанных", РезультатЗапроса, КоличествоЗаписейВПорцииДанных));
		
	Ответ = Прокси.UploadNSI(ДанныеXML);
	Возврат Ответ;
			
КонецФункции //Евросиб Коханенко Н.А. 03.02.2026 )) #125251 

#КонецОбласти 

#Область Мониторинг

//Рыбьяков К.А 08.04.2024 Ticket# 83360
Функция ОбновитьДанныеПоМониторингу(ТекстЗапроса) Экспорт
	
	Запрос = Новый Запрос;
	
	Если СтрНайти(ТекстЗапроса, "[ТекущаяДата]") > 0 Тогда
		Запрос.Текст = СтрЗаменить(ТекстЗапроса, "[ТекущаяДата]", "&Период");
		Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Иначе
		Запрос.Текст = ТекстЗапроса;
	КонецЕсли;
	
	Результат = ПреобразоватьРезультатВПредставления(Запрос);
	
	//Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Возврат СериализаторXDTO.ЗаписатьXDTO(Результат);

КонецФункции
//Рыбьяков К.А 08.04.2024 Ticket# 83360

// Евросиб TA 118382 Рыбьяков К.А. 06.01.2026 ((
Функция ПреобразоватьРезультатВПредставления(Запрос)
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	НаименованияКолонок = Новый Массив;
	
	Для Каждого Колонка Из Выгрузка.Колонки Цикл
		НаименованияКолонок.Добавить(Колонка.Имя);
	КонецЦикла;
	
	Для Каждого Колонка Из НаименованияКолонок Цикл
		
		НовоеИмя = Колонка + "_";
		Выгрузка.Колонки.Добавить(НовоеИмя, Новый ОписаниеТипов("Строка"));
		
		Для Каждого СтрокаВыгрузки Из Выгрузка Цикл
			СтрокаВыгрузки[НовоеИмя] = Строка(СтрокаВыгрузки[Колонка]);
		КонецЦикла;
		Выгрузка.Колонки.Удалить(Колонка);
		
	КонецЦикла;
	
	Возврат Выгрузка;
	
КонецФункции // Евросиб Рыбьяков К.А. 06.01.2026 ))

#КонецОбласти

// Формирует структуру, в которой определяется источник загрузки документа.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка - ссылка на документ
// Возвращаемое значение:
//  Структура: 
//		* ДокументЗагруженИзВнешнегоИсточника - Булево
//		* УзелОбмена - ПеречислениеСсылка.УзлыОбмена 
Функция ДокументЗагруженИзВнешнегоИсточника(ДокументСсылка) Экспорт        
	
	СтруктураРезультата = Новый Структура("ДокументЗагруженИзВнешнегоИсточника, УзелОбмена", Ложь, Неопределено);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПротоколОбменов.УзелОбмена КАК УзелОбмена
	|ИЗ
	|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|ГДЕ
	|	ПротоколОбменов.ДействиеПриОбмене = Значение(Перечисление.ДействияПриОбмене.ЗагрузкаДанных)
	|	И ПротоколОбменов.Объект = &Документ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.Диадок)
	|ИЗ
	|	Справочник.Диадок_Документы КАК Диадок_Документы
	|ГДЕ
	|	Диадок_Документы.Документ = &Документ";

	Запрос.УстановитьПараметр("Документ", ДокументСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		СтруктураРезультата.ДокументЗагруженИзВнешнегоИсточника = Истина;
		СтруктураРезультата.УзелОбмена = Выборка.УзелОбмена;
	КонецЕсли; 
	Возврат СтруктураРезультата;
	
КонецФункции

 //Субботин 75158 27.09.2023 начало
Функция ОбработатьКоносамент(ДанныеКоносамента, СтруктураПоискаВПротоколах, ОбъектXDTO, ТипыДокументов) Экспорт 
	
	СсылкаПоУИД = СтруктураПоискаВПротоколах.МодульРС.СсылкаПоУИД(ДанныеКоносамента.ГУИД_DX, СтруктураПоискаВПротоколах.ЗагрузкаДанных, СтруктураПоискаВПротоколах.УзелОбмена, ТипыДокументов);
	Результат = Новый Структура("ГУИД, Error");
	Если СсылкаПоУИД = Неопределено Тогда	
		КоносаментОбъект = Документы.ТранспортныйДокумент.СоздатьДокумент();
		КоносаментОбъект.Заполнить(Неопределено);
		ЭтоНовый = Истина;
		//Евросиб(ДИТ), Беляев СЮ, US 104074 / TA 104682, 11-03-2025, начало
		РезультатПроверки = Документы.ТранспортныйДокумент.НайтиДублирующийДокумент(Документы.ТранспортныйДокумент.ПустаяСсылка(), ДанныеКоносамента.НомерДокумента, Истина);
		Если РезультатПроверки.ЕстьДубль Тогда
			КоносаментОбъект = РезультатПроверки.Ссылка.ПолучитьОбъект();
			Результат.Вставить("ГУИД", РезультатПроверки.УИДИсточника);
			ЭтоНовый = Ложь;
		КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, US 104074 / TA 104682, 11-03-2025, конец
	Иначе 
		КоносаментОбъект = СсылкаПоУИД.ПолучитьОбъект();
		ЭтоНовый = Ложь;
	КонецЕсли;
	
	КоносаментОбъект.ОбменДанными.Загрузка = Истина;
		
	КоносаментОбъект.ВидОперации 					= Перечисления.ВидыОперацийТранспортныхДокументов.Коносамент;
	КоносаментОбъект.Дата 							= ДанныеКоносамента.ДатаВыпускаДокумента;
	КоносаментОбъект.НомерТранспортногоДокумента 	= ДанныеКоносамента.НомерДокумента;
	КоносаментОбъект.ДатаТранспортногоДокумента 	= ДанныеКоносамента.ДатаВыпускаДокумента;
	КоносаментОбъект.ДатаОтправленияПлан 			= ДанныеКоносамента.ДатаОтправленияПлан;
	КоносаментОбъект.ДатаПрибытияПлан 				= ДанныеКоносамента.ДатаПрибытияПлан;
	КоносаментОбъект.ДатаОтправления 				= ДанныеКоносамента.ДатаОтправленияФакт;
	КоносаментОбъект.ДатаПрибытия 					= ДанныеКоносамента.ДатаПрибытияФакт; 
	КоносаментОбъект.Грузоотправитель 				= СтрЗаменить(ДанныеКоносамента.Грузоотправитель, Символы.ПС, " ");
	КоносаментОбъект.Грузополучатель 				= СтрЗаменить(ДанныеКоносамента.Грузополучатель, Символы.ПС, " ");
	КоносаментОбъект.Изменено 	 					= ТекущаяДата(); 
	//Евросиб СубботинВ #88129 18.07.2024 Начало// поменял заполнение и добавил реквизит Ответственный
	//КоносаментОбъект.Автор 	 						= Справочники.Пользователи.ПолучитьПользователяПоЛогинуAD(ДанныеКоносамента.Сотрудник);
	КоносаментОбъект.Автор 	 						= Пользователи.ТекущийПользователь();
    КоносаментОбъект.Ответственный 	 				= Справочники.Пользователи.ПолучитьПользователяПоЛогинуAD(ДанныеКоносамента.Сотрудник); 
	//Евросиб СубботинВ #88129 18.07.2024 Конец
	
	МассивУведомляемыхСторон = Новый Массив;
	МассивУведомляемыхСторон.Добавить(ДанныеКоносамента.УведомляемаяСторона);
	МассивУведомляемыхСторон.Добавить(ДанныеКоносамента.ДругиеУведомляемыеСтороны);
	КоносаментОбъект.УведомляемыеСтороны = СтрЗаменить(СтрСоединить(МассивУведомляемыхСторон, ", "), Символы.ПС, " ");
		
	ТипСправочника = Новый СписокЗначений;
	ТипСправочника.Добавить(тип("СправочникСсылка.Контрагенты"));
	КоносаментОбъект.Контрагент =  РегистрыСведений.ПротоколОбменов.СсылкаПоУИД(ДанныеКоносамента.Контрагент,
	СтруктураПоискаВПротоколах.ЗагрузкаДанных, Перечисления.УзлыОбмена.БитФинанс, ТипСправочника);
	
	КоносаментОбъект.ФрахтНадбавки		= ДанныеКоносамента.Фрахт;
	КоносаментОбъект.МорскаяЛиния 		= ПолучитьМорскуюЛинию(ДанныеКоносамента.МорскаяЛинияID, ДанныеКоносамента.МорскаяЛиния, СтруктураПоискаВПротоколах); 
	КоносаментОбъект.СтанцияОтправления	= ПолучитьПорт(ДанныеКоносамента.ПортПогрузкиКод);
	КоносаментОбъект.СтанцияНазначения 	= ПолучитьПорт(ДанныеКоносамента.ПортНазначенияКод); 
	
	СпособВыпускаДокумента = ДанныеКоносамента.СпособВыпускаКоносамента ;
	СпособВыпускаДок = Перечисления.СпособыВыпускаДокумента;
	Если СпособВыпускаДокумента = Строка(СпособВыпускаДок.Original)   Тогда
		КоносаментОбъект.СпособВыпускаДокумента = СпособВыпускаДок.Original;
	ИначеЕсли СпособВыпускаДокумента = Строка(СпособВыпускаДок.SWB)  Тогда
		КоносаментОбъект.СпособВыпускаДокумента = СпособВыпускаДок.SWB; 
	ИначеЕсли СпособВыпускаДокумента = Строка(СпособВыпускаДок.Telex)  Тогда
		КоносаментОбъект.СпособВыпускаДокумента = СпособВыпускаДок.Telex;
	КонецЕсли;
	
	//данные по судну++
	СтруктураДанныеПоСудну = Новый Структура("Судно,СудноГодПостройки,СудноКодIMO,СудноНоминальнаяКонтейнеровместимость,СудноСтранаКод");
	СтруктураДанныеПоСудну.Вставить("Судно",ДанныеКоносамента.Судно);
	СтруктураДанныеПоСудну.Вставить("СудноГодПостройки", ДанныеКоносамента.СудноГодПостройки);
	СтруктураДанныеПоСудну.Вставить("СудноКодIMO", ДанныеКоносамента.СудноКодIMO);
	СтруктураДанныеПоСудну.Вставить("СудноНоминальнаяКонтейнеровместимость", ДанныеКоносамента.СудноНоминальнаяКонтейнеровместимость);
	СтруктураДанныеПоСудну.Вставить("СудноСтранаКод", ДанныеКоносамента.СудноСтранаКод ); 
	СтруктураДанныеПоСудну.Вставить("ID_DX", ДанныеКоносамента.СудноID); 
	КоносаментОбъект.Судно = ПолучитьСудно(СтруктураДанныеПоСудну, СтруктураПоискаВПротоколах); 
	//данные по судну --
	
	КоносаментОбъект.МорскойРейс = ПолучитьМорскойРейс(ДанныеКоносамента.НомерРейса, ДанныеКоносамента.ГУИДРейса, СтруктураПоискаВПротоколах);
	
	// Евросиб(ДИТ) BUG 95403 ТА 95433 Сержантова А.С. Начало: 14.11.2024
	//Стало:
	Если ЗначениеЗаполнено(КоносаментОбъект.МорскойРейс) Тогда
		СтрокаРеквизитов = "ПунктОтправления, ПунктНазначения, МестоПогрузки, МестоРазгрузки, ДатаОтправления, ДатаПрибытия";
		РеквизитыМорскогоРейса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КоносаментОбъект.МорскойРейс, СтрокаРеквизитов);						 
		КоносаментОбъект.СтанцияОтправления	= РеквизитыМорскогоРейса.ПунктОтправления; 
		КоносаментОбъект.СтанцияНазначения 	= РеквизитыМорскогоРейса.ПунктНазначения; 
		КоносаментОбъект.МестоПолученияГруза 	= РеквизитыМорскогоРейса.МестоПогрузки; 
		КоносаментОбъект.МестоПоставкиГруза 	= РеквизитыМорскогоРейса.МестоРазгрузки; 
		КоносаментОбъект.ДатаОтправления 		= РеквизитыМорскогоРейса.ДатаОтправления; 
		КоносаментОбъект.ДатаПрибытия 			= РеквизитыМорскогоРейса.ДатаПрибытия;
	КонецЕсли;
	// Евросиб(ДИТ) BUG 95403 ТА 95433 Сержантова А.С. Конец: 14.11.2024  
	ГрузНеНайден = Ложь; //Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025
	//ТЧ контейнеры ++
	Свойство = ДанныеКоносамента.Свойства().получить("Контейнеры");
	Если НЕ Свойство = Неопределено Тогда
		КоносаментОбъект.Коносаменты.Очистить();
		КоносаментОбъект.ДетализацияПоГрузу.Очистить();
		Если НЕ Типзнч(ДанныеКоносамента.Контейнеры.Контейнер) = ТИП(ОбъектXDTO) Тогда
			СписокКТК = ДанныеКоносамента.Контейнеры.Контейнер;
		Иначе
			ДанныеКТК = ДанныеКоносамента.Контейнеры.Контейнер;
			СписокКТК = Новый Массив;
			СписокКТК.Добавить(ДанныеКТК);
		КонецЕсли;	
		Для каждого СтрокаКТК Из СписокКТК Цикл
			СтрокаКТККоносаментОбъект 			= КоносаментОбъект.Коносаменты.Добавить();
			СтруктураДанныеКТК 					= ПолучитьКТК(СтрокаКТК);
			СтрокаКТККоносаментОбъект.НомерКТК 	= СтруктураДанныеКТК.КТК;
			СтрокаКТККоносаментОбъект.ТипКТК 	= СтруктураДанныеКТК.ТипТЕ;
			СтрокаКТККоносаментОбъект.НомерПломбы = СтрокаКТК.НомерПломбы;
			СтрокаКТККоносаментОбъект.КоличествоЕдиницУпаковки = СтрокаКТК.КоличествоМестГруза;
			СтрокаКТККоносаментОбъект.ТипУпаковки = СтрокаКТК.ТипУпаковки; //уточнить длину типа в DX
			
			//Субботин 80722 07.02.2024 Начало// добавил чтение массива кодов для заполнения тч детализации груза
			МассивКодовТНВЭД = СтрРазделить(СтрокаКТК.КодHS,";", Ложь);
			Если НЕ МассивКодовТНВЭД.Количество() = 0 Тогда
				//Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025
				//СтрокаКТККоносаментОбъект.Груз = Справочники.ГрузыПоТНВЭД.НайтиСоздатьГрузПоТНВЭД(МассивКодовТНВЭД[0]);
				Груз = РегистрыСведений.ПротоколОбменов.СсылкаПоУИД(МассивКодовТНВЭД[0],Перечисления.ДействияПриОбмене.ЗагрузкаДанных,Перечисления.УзлыОбмена.NSI);
				Если Не ЗначениеЗаполнено(Груз) Тогда
					ГрузНеНайден = Истина;
				Иначе
					СтрокаКТККоносаментОбъект.Груз = Груз;
				КонецЕсли;
				//Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025
			КонецЕсли;
			//Субботин 80722 07.02.2024 Конец
			
			СтрокаКТККоносаментОбъект.ВесНетто 	= СтрокаКТК.ВесНетто;
			СтрокаКТККоносаментОбъект.ВесБрутто = СтрокаКТК.ВесБрутто;
			СтрокаКТККоносаментОбъект.Объем 	= СтрокаКТК.ОбъемГруза;
			
			//Субботин 80722 07.02.2024 начало
			СтрокаКТККоносаментОбъект.ГУИДСтроки = Новый УникальныйИдентификатор();				 
			Если МассивКодовТНВЭД.Количество() > 1 Тогда
				Для Сч = 1 по МассивКодовТНВЭД.Количество() -1 Цикл
					СтрокаДетализацииГруза = КоносаментОбъект.ДетализацияПоГрузу.Добавить();
					//Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025
					//СтрокаДетализацииГруза.Груз = Справочники.ГрузыПоТНВЭД.НайтиСоздатьГрузПоТНВЭД(МассивКодовТНВЭД[Сч]);
					Груз = РегистрыСведений.ПротоколОбменов.СсылкаПоУИД(МассивКодовТНВЭД[Сч],Перечисления.ДействияПриОбмене.ЗагрузкаДанных,Перечисления.УзлыОбмена.NSI);
					Если Не ЗначениеЗаполнено(Груз) Тогда
						ГрузНеНайден = Истина;
					Иначе
						СтрокаДетализацииГруза.Груз = Груз;
					КонецЕсли;	
					//Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025
					СтрокаДетализацииГруза.СтрокаКоносаментаГУИД = СтрокаКТККоносаментОбъект.ГУИДСтроки;
					СтрокаДетализацииГруза.ГУИД = Новый УникальныйИдентификатор();
					СтрокаДетализацииГруза.СтрокаЗагруженаИзСтороннейСистемы = Истина;
				КонецЦикла;
			КонецЕсли;			
			//Субботин 80722 07.02.2024 Конец
		КонецЦикла; 
	КонецЕсли;
	//ТЧ контейнеры --
	
	Попытка
		//Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025
		Если ГрузНеНайден Тогда
			ВызватьИсключение("Груз не найден");
		КонецЕсли;
		//Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025
		//ДИТ Шевченко А.В. US 102524 TA 102526 13.02.2025
		//Если ЗначениеЗаполнено(КоносаментОбъект.Ссылка) Тогда
		//	Если ДокументИзменен(КоносаментОбъект) Тогда
		//		КоносаментОбъект.Записать(РежимЗаписиДокумента.Запись);
		//	КонецЕсли;
		//Иначе
		//	КоносаментОбъект.Записать(РежимЗаписиДокумента.Запись);	
		//КонецЕсли;	
		//ДИТ Шевченко А.В. US 102524 TA 102526 13.02.2025
		//Если ДанныеКоносамента.ПризнакУдаления <> "0" Тогда
		//	КоносаментОбъект.УстановитьПометкуУдаления(Истина);		
		//Иначе 
		//	КоносаментОбъект.УстановитьПометкуУдаления(Ложь);
		//КонецЕсли;
		
		//Евросиб(ДИТ), Беляев СЮ, BUG 102524 / TA 103699, 25-02-2025, начало
		Если ДанныеКоносамента.ПризнакУдаления <> "0" Тогда
			КоносаментОбъект.ПометкаУдаления = Истина;
		Иначе
			КоносаментОбъект.ПометкаУдаления = Ложь;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КоносаментОбъект.Ссылка) Тогда
			ИмяИзмененногоРеквизита = "";
			Если ДокументИзменен(КоносаментОбъект, , ,ИмяИзмененногоРеквизита) Тогда
				КоносаментОбъект.УстановитьКомментарийВерсииИсторииДанных("Проверка измененния данных. Изменен реквизит - " + ИмяИзмененногоРеквизита);
				КоносаментОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		Иначе
			КоносаментОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, BUG 102524 / TA 103699, 25-02-2025, конец
		           	 
		ГУИД = КоносаментОбъект.Ссылка.УникальныйИдентификатор();
		Результат.Вставить("ГУИД", ГУИД);
		Результат.Вставить("Error", "");
		Если ЭтоНовый Тогда
			СтруктураПоискаВПротоколах.МодульРС.ЗаписатьУИДИсточника(ГУИД, СтруктураПоискаВПротоколах.ЗагрузкаДанных, СтруктураПоискаВПротоколах.УзелОбмена, КоносаментОбъект.Ссылка);
		КонецЕсли;
	Исключение
		Результат.Вставить("ГУИД", ДанныеКоносамента.ГУИД_DX);
		Результат.Вставить("Error", ОписаниеОшибки());
	КонецПопытки; 
			
	Возврат Результат

КонецФункции
//Субботин 75158 27.09.2023 Конец

//Функция ДокументИзменен(КоносаментОбъект, ПроверятьТабличныеЧасти = Истина, ПроверятьСтандартные = Истина) //ДИТ Шевченко А.В. US 102524 TA 102526 13.02.2025
Функция ДокументИзменен(КоносаментОбъект, ПроверятьТабличныеЧасти = Истина, ПроверятьСтандартные = Истина, ИмяИзмененногоРеквизита = "") //Евросиб(ДИТ), Беляев СЮ, BUG 102524 / TA 103699, 25-02-2025, добавлен параметр ИмяИзмененногоРеквизита
	
	Объект = КоносаментОбъект;
	
	рез = Ложь;
    Ссылка = Объект.Ссылка;
    Метаданное = Ссылка.Метаданные();
    
    Для каждого Реквизит из Метаданное.Реквизиты Цикл
		Если Объект[Реквизит.Имя] <> Ссылка[Реквизит.Имя] Тогда
			Если Реквизит.Имя = "Изменено" Тогда
				Продолжить;
			КонецЕсли;	
			//Евросиб(ДИТ), Беляев СЮ, BUG 102524 / TA 103699, 25-02-2025, начало
			ИмяИзмененногоРеквизита = Реквизит.Имя;
			//Евросиб(ДИТ), Беляев СЮ, BUG 102524 / TA 103699, 25-02-2025, конец
            Возврат Истина;
        КонецЕсли;
    КонецЦикла;
    
    Если ПроверятьСтандартные Тогда
    Для каждого Реквизит из Метаданное.СтандартныеРеквизиты Цикл
		Если Объект[Реквизит.Имя] <> Ссылка[Реквизит.Имя] Тогда
			//Евросиб(ДИТ), Беляев СЮ, BUG 102524 / TA 103699, 25-02-2025, начало
			ИмяИзмененногоРеквизита = Реквизит.Имя;
			//Евросиб(ДИТ), Беляев СЮ, BUG 102524 / TA 103699, 25-02-2025, конец
            Возврат Истина;
        КонецЕсли;
    КонецЦикла;
    КонецЕсли;
    
    
    Если ПроверятьТабличныеЧасти Тогда
        Для каждого ТЧ из Метаданное.ТабличныеЧасти Цикл
            
			Если Объект[ТЧ.Имя].Количество() <> Ссылка[ТЧ.Имя].Количество() Тогда
				//Евросиб(ДИТ), Беляев СЮ, BUG 102524 / TA 103699, 25-02-2025, начало
				ИмяИзмененногоРеквизита = ТЧ.Имя;
				//Евросиб(ДИТ), Беляев СЮ, BUG 102524 / TA 103699, 25-02-2025, конец
                рез = истина;
            КонецЕсли;
            
            Для Индекс = 0 по Объект[ТЧ.Имя].Количество()-1 Цикл
                ОбъектСтрокаТЧ = Объект[ТЧ.Имя][Индекс];
                СсылкаСтрокаТЧ = Ссылка[ТЧ.Имя][Индекс];    
                
                Для каждого РеквизитТЧ из ТЧ.Реквизиты Цикл
					Если ОбъектСтрокаТЧ[РеквизитТЧ.Имя] <> СсылкаСтрокаТЧ[РеквизитТЧ.Имя] Тогда
						Если РеквизитТЧ.Имя = "ГУИДСтроки" Тогда
							Продолжить;
						КонецЕсли;
						Если РеквизитТЧ.Имя = "ГУИД" Тогда
							Продолжить;
						КонецЕсли;
						//Евросиб(ДИТ), Беляев СЮ, BUG 102524 / TA 103699, 25-02-2025, начало
						ИмяИзмененногоРеквизита = РеквизитТЧ.Имя;
						//Евросиб(ДИТ), Беляев СЮ, BUG 102524 / TA 103699, 25-02-2025, конец
                        рез =  Истина; 
                    КонецЕсли;
                КонецЦикла;
            КонецЦикла;
            
        КонецЦикла;        
    КонецЕсли;
    
    Возврат рез;
    
КонецФункции

 //Субботин 74357 27.09.2023 Начало
Функция ОбработатьРейс(ДанныеРейса, СтруктураПоискаВПротоколах, ОбъектXDTO, ТипыДокументов) экспорт 	
	
	//Евросиб(ДИТ), Беляев СЮ, US 104074 / TA 104682, 11-03-2025, начало
	СтруктураДанныеПоСудну = Новый Структура("Судно,СудноГодПостройки,СудноКодIMO,СудноНоминальнаяКонтейнеровместимость,СудноСтранаКод");
	СтруктураДанныеПоСудну.Вставить("Судно",ДанныеРейса.Судно);
	СтруктураДанныеПоСудну.Вставить("СудноГодПостройки", ДанныеРейса.СудноГодПостройки);
	СтруктураДанныеПоСудну.Вставить("СудноКодIMO", ДанныеРейса.СудноКодIMO);
	СтруктураДанныеПоСудну.Вставить("СудноНоминальнаяКонтейнеровместимость", ДанныеРейса.СудноНоминальнаяКонтейнеровместимость);
	СтруктураДанныеПоСудну.Вставить("СудноСтранаКод", ДанныеРейса.СудноСтранаКод ); 
	СтруктураДанныеПоСудну.Вставить("ID_DX", ДанныеРейса.СудноID);
	
	ПараметрыПроверкиДублей = Новый Структура;
	ПараметрыПроверкиДублей.Вставить("Судно", ПолучитьСудно(СтруктураДанныеПоСудну,СтруктураПоискаВПротоколах));
	ПараметрыПроверкиДублей.Вставить("ПунктОтправления", ПолучитьПорт(ДанныеРейса.ПортПогрузкиКод));
	ПараметрыПроверкиДублей.Вставить("ПунктНазначения", ПолучитьПорт(ДанныеРейса.ПортНазначенияКод));
	ПараметрыПроверкиДублей.Вставить("ДатаОтправления", Дата(ДанныеРейса.ДатаОтправления));
	ПараметрыПроверкиДублей.Вставить("ДатаПрибытия", Дата(ДанныеРейса.ДатаПрибытия));
	ПараметрыПроверкиДублей.Вставить("Ссылка", Справочники.РейсыМоре.ПустаяСсылка());
	//Евросиб(ДИТ), Беляев СЮ, US 104074 / TA 104682, 11-03-2025, конец
	
	СсылкаПоУИД = СтруктураПоискаВПротоколах.МодульРС.СсылкаПоУИД(ДанныеРейса.ГУИД_DX, СтруктураПоискаВПротоколах.ЗагрузкаДанных, СтруктураПоискаВПротоколах.УзелОбмена, ТипыДокументов);
	Результат = Новый Структура("ГУИД, Error");
	Если СсылкаПоУИД = Неопределено Тогда	
		РейсОбъект = Справочники.РейсыМоре.СоздатьЭлемент();
		ЭтоНовый = Истина;
		//Евросиб(ДИТ), Беляев СЮ, US 104074 / TA 104682, 11-03-2025, начало
		ТаблицаДублейИзDX = Новый ТаблицаЗначений;
		Справочники.РейсыМоре.ВыполнитьПроверкуНаДубли(ПараметрыПроверкиДублей, ТаблицаДублейИзDX);
		Если ТаблицаДублейИзDX.Количество()>0 Тогда
			ПерваяСтрокаТаблицы = ТаблицаДублейИзDX[0];
			РейсОбъект = ПерваяСтрокаТаблицы.Ссылка.ПолучитьОбъект();
			Результат.ГУИД = ПерваяСтрокаТаблицы.УИДИсточника;
			ЭтоНовый = Ложь;
		КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, US 104074 / TA 104682, 11-03-2025, конец
	Иначе 
		РейсОбъект = СсылкаПоУИД.ПолучитьОбъект();
		ЭтоНовый = Ложь;
		//Евросиб(ДИТ), Беляев СЮ, US 102934 / TA 103591, 06-03-2025, начало (отключим проверки, если рейс уже загружался ранее)
		//РейсОбъект.ОбменДанными.Загрузка = Истина;
		//Евросиб(ДИТ), Беляев СЮ, US 102934 / TA 103591, 06-03-2025, конец
	КонецЕсли; 	
	РейсОбъект.Наименование = ДанныеРейса.Наименование ;
	// Евросиб(ДИТ) US 84968 ТА 85632 Сержантова А.С. Начало: 03.09.2024
	РейсОбъект.IDРейса = ДанныеРейса.ID_DX;
	// Евросиб(ДИТ) US 84968 ТА 85632 Сержантова А.С. Конец: 03.09.2024
	//Евросиб(ДИТ), Беляев СЮ, US 104074 / TA 104682, 11-03-2025, начало
	РейсОбъект.ОбменДанными.Загрузка = Истина;
	//Евросиб(ДИТ), Беляев СЮ, US 104074 / TA 104682, 11-03-2025, конец
	
	//Евросиб(ДИТ), Беляев СЮ, US 104074 / TA 104682, 11-03-2025, начало (перенес выше блок кода)
	//СтруктураДанныеПоСудну = Новый Структура("Судно,СудноГодПостройки,СудноКодIMO,СудноНоминальнаяКонтейнеровместимость,СудноСтранаКод");
	//СтруктураДанныеПоСудну.Вставить("Судно",ДанныеРейса.Судно);
	//СтруктураДанныеПоСудну.Вставить("СудноГодПостройки", ДанныеРейса.СудноГодПостройки);
	//СтруктураДанныеПоСудну.Вставить("СудноКодIMO", ДанныеРейса.СудноКодIMO);
	//СтруктураДанныеПоСудну.Вставить("СудноНоминальнаяКонтейнеровместимость", ДанныеРейса.СудноНоминальнаяКонтейнеровместимость);
	//СтруктураДанныеПоСудну.Вставить("СудноСтранаКод", ДанныеРейса.СудноСтранаКод ); 
	//СтруктураДанныеПоСудну.Вставить("ID_DX", ДанныеРейса.СудноID);
	//Евросиб(ДИТ), Беляев СЮ, US 104074 / TA 104682, 11-03-2025, конец
	
	//РейсОбъект.Судно 			= ПолучитьСудно(СтруктураДанныеПоСудну,СтруктураПоискаВПротоколах);
	//Евросиб(ДИТ), Беляев СЮ, US 104074 / TA 104682, 11-03-2025, начало
	РейсОбъект.Судно 			= ПараметрыПроверкиДублей.Судно;
	//Евросиб(ДИТ), Беляев СЮ, US 104074 / TA 104682, 11-03-2025, конец
	РейсОбъект.НомерРейса 		= ДанныеРейса.НомерРейса;
	РейсОбъект.Линия 			= ПолучитьМорскуюЛинию(ДанныеРейса.МорскаяЛинияID, ДанныеРейса.МорскаяЛиния, СтруктураПоискаВПротоколах);
    ПерваяСтрока = Истина;
	
	// Евросиб(ДИТ) US 84968 ТА 85632 Сержантова А.С. Начало: 03.09.2024
	//Было:
	//Свойство = ДанныеРейса.Свойства().Получить("Маршрут");
	//Если НЕ Свойство = Неопределено Тогда
	//	РейсОбъект.ДеталиМаршрута.Очистить();
	//	Плечи  = ДанныеРейса.Маршрут.Свойства().Получить("Плечо");
	//	Если НЕ Плечи = Неопределено Тогда
	//		Если НЕ Типзнч(ДанныеРейса.Маршрут.Плечо) = ТИП(ОбъектXDTO) Тогда				
	//			СтрокиПлеч = ДанныеРейса.Маршрут.Плечо;
	//		Иначе
	//			ДанныеПлеча = ДанныеРейса.Маршрут.Плечо;
	//			СтрокиПлеч = Новый Массив;
	//			СтрокиПлеч.Добавить(ДанныеПлеча);
	//		КонецЕсли;			
	//		Для каждого СтрокаПлеч Из СтрокиПлеч Цикл 
	//			ЧастьМаршрута = РейсОбъект.ДеталиМаршрута.добавить();	
	//			ЧастьМаршрута.ДатаОтправления 	= СтрокаПлеч. ДатаОтправления;
	//			ЧастьМаршрута.ПунктОтправления 	= ПолучитьПорт(СтрокаПлеч.ПортПогрузкиКод);    
	//			ЧастьМаршрута.ДатаПрибытия 		=    СтрокаПлеч.ДатаПрибытия;
	//			ЧастьМаршрута.ПунктНазначения 	=	ПолучитьПорт(СтрокаПлеч.ПортНазначенияКод);				
	//			//заполняем рейс по первому плечу
	//			Если ПерваяСтрока Тогда
	//				РейсОбъект.ПунктОтправления = ЧастьМаршрута.ПунктОтправления;
	//				РейсОбъект.ДатаОтправления 	= ЧастьМаршрута.ДатаОтправления;
	//			КонецЕсли;
	//			РейсОбъект.ПунктНазначения 	= ЧастьМаршрута.ПунктНазначения;
	//			РейсОбъект.ДатаПрибытия     = ЧастьМаршрута.ДатаПрибытия;
	//			ПерваяСтрока = Ложь;
	//		КонецЦикла;
	//	КонецЕсли;
	//КонецЕсли;   
	//Стало:
	//РейсОбъект.ПунктОтправления	= ПолучитьПорт(ДанныеРейса.ПортПогрузкиКод); 
	//РейсОбъект.ПунктНазначения	= ПолучитьПорт(ДанныеРейса.ПортНазначенияКод);
	//РейсОбъект.МестоПогрузки	= ПолучитьТерминал(ДанныеРейса.ТерминалПогрузкиКод);
	//РейсОбъект.МестоРазгрузки	= ПолучитьТерминал(ДанныеРейса.ТерминалНазначенияКод);             
	//РейсОбъект.ДатаОтправления	= ДанныеРейса.ДатаОтправления;
	//РейсОбъект.ДатаПрибытия	= ДанныеРейса.ДатаПрибытия;
	// Евросиб(ДИТ) US 84968 ТА 85632 Сержантова А.С. Конец: 03.09.2024
	
	//Евросиб(ДИТ), Беляев СЮ, US 104074 / TA 104682, 11-03-2025, начало
	
	//Евросиб Шевченко А.В. US 108007 TA 108027 05.06.2025
	Если НЕ ДанныеРейса.Свойства().Получить("ПортПогрузкиID") = Неопределено Тогда
		РейсОбъект.ПунктОтправления	= ПолучитьПортТерминалПоГуид(ДанныеРейса.ПортПогрузкиID);
		РейсОбъект.ПунктНазначения	= ПолучитьПортТерминалПоГуид(ДанныеРейса.ПортНазначенияID);
		РейсОбъект.МестоПогрузки	= ПолучитьПортТерминалПоГуид(ДанныеРейса.ТерминалПогрузкиID);
		РейсОбъект.МестоРазгрузки	= ПолучитьПортТерминалПоГуид(ДанныеРейса.ТерминалНазначенияID);
	Иначе
		РейсОбъект.ПунктОтправления	= ПараметрыПроверкиДублей.ПунктОтправления; 
		РейсОбъект.ПунктНазначения	= ПараметрыПроверкиДублей.ПунктНазначения;
		РейсОбъект.МестоПогрузки	= ПолучитьТерминал(ДанныеРейса.ТерминалПогрузкиКод);
		РейсОбъект.МестоРазгрузки	= ПолучитьТерминал(ДанныеРейса.ТерминалНазначенияКод);
	КонецЕсли;
	//Евросиб Шевченко А.В. US 108007 TA 108027 05.06.2025
	
	РейсОбъект.ДатаОтправления	= ПараметрыПроверкиДублей.ДатаОтправления;
	РейсОбъект.ДатаПрибытия	= ПараметрыПроверкиДублей.ДатаПрибытия;
	//Евросиб(ДИТ), Беляев СЮ, US 104074 / TA 104682, 11-03-2025, конец
	
	Если ДанныеРейса.ПризнакУдаления <>"0" Тогда
		РейсОбъект.ПометкаУдаления = Истина;
	Иначе 
		РейсОбъект.ПометкаУдаления = Ложь;
	КонецЕсли;

	Попытка
		//РейсОбъект.Записать(); 
		//Евросиб(ДИТ), Беляев СЮ, BUG 102524 / TA 103699, 25-02-2025, начало
		Если ЗначениеЗаполнено(РейсОбъект.Ссылка) Тогда
			ИмяИзмененногоРеквизита = "";
			Если ДокументИзменен(РейсОбъект, , ,ИмяИзмененногоРеквизита) Тогда
				РейсОбъект.УстановитьКомментарийВерсииИсторииДанных("Проверка измененния данных. Изменен реквизит - " + ИмяИзмененногоРеквизита);
				РейсОбъект.Записать();
			КонецЕсли;
		Иначе
			РейсОбъект.Записать();
		КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, BUG 102524 / TA 103699, 25-02-2025, конец
		
		ГУИД = РейсОбъект.Ссылка.УникальныйИдентификатор();
		Результат.Вставить("ГУИД", ГУИД );
		Результат.Вставить("Error", "");
		Если ЭтоНовый Тогда
			СтруктураПоискаВПротоколах.МодульРС.ЗаписатьУИДИсточника(ГУИД, СтруктураПоискаВПротоколах.ЗагрузкаДанных, СтруктураПоискаВПротоколах.УзелОбмена, РейсОбъект.Ссылка);
		КонецЕсли;  
	Исключение	
		Результат.Вставить("ГУИД", ДанныеРейса.ГУИД_DX);
		Результат.Вставить("Error", ОписаниеОшибки());
		Возврат Результат
	КонецПопытки; 
	
	Возврат Результат

КонецФункции

Функция ПолучитьПорт (Порт) экспорт 
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Локации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Локации КАК Локации
		|ГДЕ
		|	Локации.КодПортаUNLOCODE = &КодПортаUNLOCODE
		|	И НЕ Локации.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("КодПортаUNLOCODE", Порт);	
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		НайденоПортов = ВыборкаДетальныеЗаписи.Количество();
		Если НайденоПортов = 1 Тогда
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда 		
				Возврат ВыборкаДетальныеЗаписи.Ссылка;
			КонецЕсли;
		Иначе 
			Возврат Справочники.Локации.ПустаяСсылка();	
		КонецЕсли;
		
КонецФункции  

Функция ПолучитьКТК (СтрокаДокумента) экспорт  //поиск +создание
	
	СтруктураДанныеКТК = Новый Структура("КТК, ТипТЕ");	
	Попытка	
		Ктк = РаботаСКонтейнерамиСервер.СоздатьКТК(СтрокаДокумента.НомерКонтейнера,РаботаСКонтейнерамиСервер.ПолучитьТипТЕПоСтроке(СтрокаДокумента.Типоразмер));	
		Если Ктк <> Неопределено тогда
			Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КТК,"Ссылка,ТипТЕ");
			СтруктураДанныеКТК.Вставить("КТК", Реквизиты.Ссылка);
			СтруктураДанныеКТК.Вставить("ТипТЕ", Реквизиты.ТипТЕ);
		КонецЕсли;
	Исключение 
		СтруктураДанныеКТК.Вставить("КТК", Справочники.ТЕ.ПустаяСсылка());
		СтруктураДанныеКТК.Вставить("ТипТЕ", Справочники.ТипоразмерыТЕ.ПустаяСсылка());		
	КонецПопытки;
	
	Возврат СтруктураДанныеКТК 
	
КонецФункции

Функция ПолучитьМорскойРейс (НомерРейса, ГУИДРейса, СтруктураПоискаВПротоколах) экспорт
	
	ТипыДокументов = Новый СписокЗначений;
	ТипыДокументов.Добавить(Тип("СправочникСсылка.РейсыМоре"));
	Рейс = СтруктураПоискаВПротоколах.МодульРС.СсылкаПоУИД(ГУИДРейса, СтруктураПоискаВПротоколах.ЗагрузкаДанных, СтруктураПоискаВПротоколах.УзелОбмена, ТипыДокументов); 
	//Если Рейс = Неопределено тогда
	//	//Рейс = Справочники.РейсыМоре.НайтиПоКоду(НомерРейса);
	//	//Попытка
	//	//	СтруктураПоискаВПротоколах.МодульРС.ЗаписатьУИДИсточника(IDРейса, СтруктураПоискаВПротоколах.ЗагрузкаДанных, СтруктураПоискаВПротоколах.УзелОбмена, Рейс);
	//	//Исключение
	//	//КонецПопытки;
	//КонецЕсли;
	Возврат Рейс ;
	
КонецФункции   

Функция ПолучитьМорскуюЛинию (МорскаяЛинияID, МорскаяЛинияНаименование,СтруктураПоискаВПротоколах) экспорт// поиск по ид ДХ в протоколах обмена, по наим в справочнике, и создание 
	
	ТипыДокументов = Новый СписокЗначений;
	ТипыДокументов.Добавить(Тип("справочникССылка.МорскиеЛинии"));
	Линия = СтруктураПоискаВПротоколах.МодульРС.СсылкаПоУИД(МорскаяЛинияID, СтруктураПоискаВПротоколах.ЗагрузкаДанных, СтруктураПоискаВПротоколах.УзелОбмена, ТипыДокументов);
	Если Линия = Неопределено тогда		 
			НовЛиния = Справочники.МорскиеЛинии.СоздатьЭлемент();
			НовЛиния.Наименование = МорскаяЛинияНаименование;
			НовЛиния.Записать();
			Линия = НовЛиния.Ссылка;   
		СтруктураПоискаВПротоколах.МодульРС.ЗаписатьУИДИсточника(МорскаяЛинияID, СтруктураПоискаВПротоколах.ЗагрузкаДанных, СтруктураПоискаВПротоколах.УзелОбмена, Линия);
	КонецЕсли;
	Возврат Линия 
	
КонецФункции 

Функция ПолучитьСудно (ДанныеСудна, СтруктураПоискаВПротоколах) экспорт // поиск по ид ДХ в протоколах обмена, по ИМО в справочнике, и создание 
	
	ТипыДокументов = Новый СписокЗначений;
	ТипыДокументов.Добавить(Тип("СправочникСсылка.ТС"));
	Результат = СтруктураПоискаВПротоколах.МодульРС.СсылкаПоУИД(ДанныеСудна.ID_DX, СтруктураПоискаВПротоколах.ЗагрузкаДанных, СтруктураПоискаВПротоколах.УзелОбмена, ТипыДокументов);
	Если Результат = Неопределено Тогда
		НовЭлем = Справочники.ТС.СоздатьЭлемент();
		НовЭлем.Наименование 	= ДанныеСудна.Судно;
		НовЭлем.buildDate 		= Дата(Строка(?(ЗначениеЗаполнено(ДанныеСудна.СудноГодПостройки), ДанныеСудна.СудноГодПостройки, "0001") + "0101"));
		НовЭлем.imoNumber 		= ДанныеСудна.СудноКодIMO;
		НовЭлем.capacityTeu		= ДанныеСудна.СудноНоминальнаяКонтейнеровместимость;
		НовЭлем.flag 			= ДанныеСудна.СудноСтранаКод ; 
		НовЭлем.ТипТС 			= Справочники.ТипоразмерыТС.СудноКонтейнеровоз;  
		//	НовЭлем.ТипТС.Судно     = Истина;		
		НовЭлем.Записать();
		Результат = НовЭлем.Ссылка;				
		СтруктураПоискаВПротоколах.МодульРС.ЗаписатьУИДИсточника(ДанныеСудна.ID_DX, СтруктураПоискаВПротоколах.ЗагрузкаДанных, СтруктураПоискаВПротоколах.УзелОбмена, Результат);
	КонецЕсли;
	
	Возврат Результат 
КонецФункции

// Евросиб(ДИТ) US 84968 ТА 85632 Сержантова А.С. 12.09.2024
Функция ПолучитьТерминал(КодСправочникаЛокаций)      
	
	НайденыйТерминал = Справочники.Локации.ПустаяСсылка();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Локации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Локации КАК Локации
		|ГДЕ
		|	Локации.Код = &Код
		|	И Локации.Тип = &Тип
		|	И НЕ Локации.ПометкаУдаления
		|	И Локации.ТипПодрядчика = ЗНАЧЕНИЕ(Перечисление.ТипПодрядчикаТерминал.Порт)";
	
	Запрос.УстановитьПараметр("Код", КодСправочникаЛокаций);
	Запрос.УстановитьПараметр("Тип", Справочники.ТипыЛокаций.Терминал);   
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
        НайденыйТерминал = Выборка.Ссылка;
	КонецЕсли;
		
	Возврат НайденыйТерминал;
	
КонецФункции

Функция ПолучитьПортТерминалПоГуид(ГУИД) //Евросиб Шевченко А.В. US 108007 TA 108027 05.06.2025
	
	УИД = Новый УникальныйИдентификатор(ГУИД);
	
	Локация = Справочники.Локации.ПолучитьСсылку(УИД);
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|    Локации.Ссылка
	|ИЗ
	|    Справочник.Локации КАК Локации
	|ГДЕ
	|    Локации.Ссылка = &Ссылка
	|";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", Локация);
       	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		Возврат Локация;
	КонецЕсли;	
	
	Возврат Справочники.Локации.ПустаяСсылка();	
	
КонецФункции	

Функция ПроверитьНаборОбязательныхРеквизитов(Данные)экспорт
	
	Если ЗначениеЗаполнено(Данные.ДатаВыпускаДокумента)Тогда
		Возврат истина
	Иначе 
		Возврат Ложь
	КонецЕсли;
КонецФункции
 //Субботин 74357 27.09.2023 Конец 
 
//Евросиб(ДИТ), Беляев СЮ, US 88935/TA 89126, 12-08-2024, начало
Процедура УдалитьНеподтвержденныеОбъектыИзDX() Экспорт
	
	ДействияПриОбмене_ЗагрузкаДанных = Перечисления.ДействияПриОбмене.ЗагрузкаДанных;
	УзелОбменаDX = Перечисления.УзлыОбмена.DX;

	//РЕЙСЫ
	ТипОбъекта = Новый СписокЗначений;
	ТипОбъекта.Добавить(Тип("СправочникСсылка.РейсыМоре"));
	РегистрыСведений.ПротоколОбменов.УдалитьНеподтвержденныеОбъекты(УзелОбменаDX, ДействияПриОбмене_ЗагрузкаДанных, ТипОбъекта); 
	
	//КОНОСАМЕНТЫ
	ТипыДокументов = Новый СписокЗначений;
	ТипыДокументов.Добавить(Тип("ДокументСсылка.ТранспортныйДокумент"));
	РегистрыСведений.ПротоколОбменов.УдалитьНеподтвержденныеОбъекты(УзелОбменаDX, ДействияПриОбмене_ЗагрузкаДанных, ТипыДокументов);
	
КонецПроцедуры

//Евросиб(ДИТ), Беляев СЮ, US 88935/TA 89126, 12-08-2024, конец   

//Евросиб Каблов 14.11.2024 #93051
////Евросиб СубботинВ #90973 19.09.2024 Начало 
Функция ВыгрузитьКалькуляции(ИмяУзла, ДатаНачала, ДатаОкончания) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИмяУзла) Тогда
		Возврат "<xml><error>Пустое значение параметра RequestingSystem!</error></xml>";
	КонецЕсли;  
	
	УзелОбмена = Неопределено;
	Для каждого ЗначПеречисления Из Метаданные.Перечисления.УзлыОбмена.ЗначенияПеречисления Цикл
		Если ЗначПеречисления.Имя = ИмяУзла Тогда
			УзелОбмена = Перечисления.УзлыОбмена[ЗначПеречисления.Имя];  
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	Если УзелОбмена = Неопределено Тогда
		Возврат "<xml><error>Не найден узел обмена по входному параметру RequestingSystem!</error></xml>";
	КонецЕсли;
	
	//Евросиб Каблов 20.05.2025 ( #110106
	НастройкаОбмена = Справочники.НастройкиОбменов.ПолучитьНастройкуОбмена(УзелОбмена, "GetCalculation");
	
	КоличествоЗаписейВПорцииДанных = НастройкаОбмена.КоличествоЗаписейВПорцииДанных;
	Если ЗначениеЗаполнено(КоличествоЗаписейВПорцииДанных) Тогда
		КоличествоЗаписейВПорцииДанныхПлюсОдин = КоличествоЗаписейВПорцииДанных + 1;
		ТекстОграниченияПорции = СтрШаблон("ПЕРВЫЕ %1", Формат(КоличествоЗаписейВПорцииДанныхПлюсОдин, "ЧГ=0"));
	Иначе
		ТекстОграниченияПорции = "";
	КонецЕсли;
	//Евросиб Каблов 20.05.2025 )
	
	ВремяВыгрузки = ТекущаяДата();
	
	Запрос = Новый Запрос;
	Если ЗначениеЗаполнено(ДатаНачала) и ЗначениеЗаполнено(ДатаОкончания) Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 11
		|	Калькуляция.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_УникальныеКалькуляции
		|ИЗ
		|	Документ.Калькуляция КАК Калькуляция
		|ГДЕ
		|	Калькуляция.Проведен
		|	И Калькуляция.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
		
	Иначе
		
		УзлыПланаОбмена = ПланыОбмена.ВыгрузкаДанных.ПолучитьУзелОбмена(УзелОбмена);
		Если Не ЗначениеЗаполнено(УзлыПланаОбмена) Тогда
			Возврат "<xml><error>Не настроен узел плана обмена по входному параметру RequestingSystem!</error></xml>";
		КонецЕсли;
		
		УзелПланаОбмена = УзлыПланаОбмена[0];
				
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 11
		|	КалькуляцияИзменения.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_УникальныеКалькуляции
		|ИЗ
		|	Документ.Калькуляция.Изменения КАК КалькуляцияИзменения
		|ГДЕ
		|	КалькуляцияИзменения.Ссылка.Проведен
		|	И КалькуляцияИзменения.Узел = &УзелПланаОбмена";
		Запрос.УстановитьПараметр("УзелПланаОбмена", УзелПланаОбмена);
		
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|;";
	
	Запрос.Текст = Запрос.Текст + 
	"ВЫБРАТЬ
	|	ВТ_УникальныеКалькуляции.Ссылка КАК СсылкаКалькуляции,
	|	КалькуляцияСписокСтанцийОтправления.Станция КАК Локация
	|ИЗ
	|	ВТ_УникальныеКалькуляции КАК ВТ_УникальныеКалькуляции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция.СписокСтанцийОтправления КАК КалькуляцияСписокСтанцийОтправления
	|		ПО ВТ_УникальныеКалькуляции.Ссылка = КалькуляцияСписокСтанцийОтправления.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_УникальныеКалькуляции.Ссылка,
	|	КалькуляцияСписокСтанцийОтправления.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УникальныеКалькуляции.Ссылка КАК СсылкаКалькуляции,
	|	КалькуляцияСписокСтанцийНазначения.Станция КАК Локация
	|ИЗ
	|	ВТ_УникальныеКалькуляции КАК ВТ_УникальныеКалькуляции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция.СписокСтанцийНазначения КАК КалькуляцияСписокСтанцийНазначения
	|		ПО ВТ_УникальныеКалькуляции.Ссылка = КалькуляцияСписокСтанцийНазначения.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_УникальныеКалькуляции.Ссылка,
	|	КалькуляцияСписокСтанцийНазначения.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КалькуляцияШапка.Номер КАК Номер,
	|	КалькуляцияШапка.Дата КАК Дата,
	|	ПротоколОбменов.УИДИсточника КАК Контрагент,
	|	КалькуляцияШапка.Договор КАК Договор,
	|	КалькуляцияШапка.Договор.ОтветственныйЗаДоговор КАК ДоговорОтветственныйЗаДоговор,
	|	КалькуляцияШапка.НачалоДействия КАК ПериодДействия,
	|	КалькуляцияШапка.ОкончаниеДействия КАК ОкончаниеДействия,
	|	КалькуляцияШапка.ТипКалькуляции КАК ТипКалькуляции,
	|	КалькуляцияШапка.УчетноеНаправление.Код КАК УчетноеНаправление,
	|	ВЫБОР
	|		КОГДА КалькуляцияШапка.веб_ДляКТКЕвросиб
	|			ТОГДА КалькуляцияШапка.веб_ДляКТКЕвросиб
	|		КОГДА КалькуляцияШапка.веб_ДляКТККлиента
	|			ТОГДА КалькуляцияШапка.веб_ДляКТККлиента
	|	КОНЕЦ КАК ПринадлежностьКТК,
	|	КалькуляцияШапка.ПС_ВидПеревозки КАК ВидПеревозки,
	|	КалькуляцияШапка.ММ_ИтогоСебестоимость20 КАК ИтогоСебестоимость20,
	|	КалькуляцияШапка.ММ_ИтогоСебестоимость КАК ИтогоСебестоимость40,
	|	КалькуляцияШапка.ММ_ИтогоВознаграждение20 КАК ИтогоВознаграждение20,
	|	КалькуляцияШапка.ММ_ИтогоВознаграждение КАК ИтогоВознаграждение40,
	|	КалькуляцияШапка.ММ_ИтогоСтавка20 КАК ИтогоСтавка20,
	|	КалькуляцияШапка.ММ_ИтогоСтавка КАК ИтогоСтавка40,
	|	ПСЦКалькуляции.Ссылка.Номер КАК НомерСвязанногоПротокола,
	|	ПСЦКалькуляции.Ссылка.СтатусДокумента КАК СтатусСвязанногоПротокола,
	|	МАКСИМУМ(СделкаСвязьУчетныхЕдиниц.ДокументыВыставлены) КАК ДокументыПоСделкеВыставлены,
	|	КалькуляцияШапка.УсловияПеревозки_Отправление КАК УсловияПеревозкиПоОтправлениюПоЖД,
	|	КалькуляцияШапка.УсловияПеревозки_Прибытие КАК УсловияПеревозкиПоПрибытиюПоЖД,
	|	КалькуляцияШапка.Суша_ПунктНазначения КАК ПунктНазначенияПоЖД,
	|	КалькуляцияШапка.Суша_ПунктОтправления КАК ПунктОтправленияПоЖД,
	|	КалькуляцияШапка.СписокПунктовОтправления КАК ПереченьВозможныхПунктовОтправленияПоЖД,
	|	КалькуляцияШапка.СписокПунктовНазначения КАК ПереченьВозможныхПунктовНазначенияПоЖД,
	|	КалькуляцияШапка.ММ_ПортОтправления КАК ММ_ПортОтправления_Назначения,
	|	КалькуляцияШапка.Море_УсловияПогрузки КАК Море_УсловияПогрузки,
	|	КалькуляцияШапка.Море_УсловияВыгрузки КАК Море_УсловияВыгрузки,
	|	ВЫБОР
	|		КОГДА КалькуляцияШапка.ФрахтИмпорт = 0
	|			ТОГДА ""Импорт""
	|		ИНАЧЕ ""Экспорт""
	|	КОНЕЦ КАК ЭкспортИмпорт,
	|	КалькуляцияШапка.ММ_ДействиеСтавокНа КАК ПериодДействияСтавкиФрахта,
	|	КалькуляцияШапка.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_УникальныеКалькуляции КАК ВТ_УникальныеКалькуляции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция КАК КалькуляцияШапка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПСЦ.Калькуляции КАК ПСЦКалькуляции
	|			ПО КалькуляцияШапка.Ссылка = ПСЦКалькуляции.Калькуляция
	|				И (ПСЦКалькуляции.Ссылка.Проведен)
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|			ПО КалькуляцияШапка.Ссылка = СделкаСвязьУчетныхЕдиниц.Калькуляция
	|				И (СделкаСвязьУчетныхЕдиниц.Ссылка.Проведен)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|			ПО КалькуляцияШапка.Контрагент = ПротоколОбменов.Объект
	|				И (ПротоколОбменов.ДействиеПриОбмене = &ДействиеПриОбмене)
	|				И (ПротоколОбменов.УзелОбмена = &УзелОбмена)
	|		ПО ВТ_УникальныеКалькуляции.Ссылка = КалькуляцияШапка.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	КалькуляцияШапка.Номер,
	|	КалькуляцияШапка.Дата,
	|	КалькуляцияШапка.Договор,
	|	КалькуляцияШапка.Договор.ОтветственныйЗаДоговор,
	|	НАЧАЛОПЕРИОДА(КалькуляцияШапка.НачалоДействия, ДЕНЬ),
	|	КалькуляцияШапка.ОкончаниеДействия,
	|	КалькуляцияШапка.ТипКалькуляции,
	|	КалькуляцияШапка.ПС_ВидПеревозки,
	|	КалькуляцияШапка.ММ_ИтогоСебестоимость20,
	|	КалькуляцияШапка.ММ_ИтогоСебестоимость,
	|	КалькуляцияШапка.ММ_ИтогоВознаграждение20,
	|	КалькуляцияШапка.ММ_ИтогоВознаграждение,
	|	КалькуляцияШапка.ММ_ИтогоСтавка20,
	|	КалькуляцияШапка.ММ_ИтогоСтавка,
	|	ПСЦКалькуляции.Ссылка.Номер,
	|	ПСЦКалькуляции.Ссылка.СтатусДокумента,
	|	КалькуляцияШапка.УсловияПеревозки_Отправление,
	|	КалькуляцияШапка.УсловияПеревозки_Прибытие,
	|	КалькуляцияШапка.Суша_ПунктНазначения,
	|	КалькуляцияШапка.Суша_ПунктОтправления,
	|	КалькуляцияШапка.СписокПунктовОтправления,
	|	КалькуляцияШапка.СписокПунктовНазначения,
	|	КалькуляцияШапка.ММ_ПортОтправления,
	|	КалькуляцияШапка.Море_УсловияПогрузки,
	|	КалькуляцияШапка.Море_УсловияВыгрузки,
	|	КалькуляцияШапка.ММ_ДействиеСтавокНа,
	|	ВЫБОР
	|		КОГДА КалькуляцияШапка.ФрахтИмпорт = 0
	|			ТОГДА ""Импорт""
	|		ИНАЧЕ ""Экспорт""
	|	КОНЕЦ,
	|	КалькуляцияШапка.Ссылка,
	|	ПротоколОбменов.УИДИсточника,
	|	КалькуляцияШапка.УчетноеНаправление.Код,
	|	ВЫБОР
	|		КОГДА КалькуляцияШапка.веб_ДляКТКЕвросиб
	|			ТОГДА КалькуляцияШапка.веб_ДляКТКЕвросиб
	|		КОГДА КалькуляцияШапка.веб_ДляКТККлиента
	|			ТОГДА КалькуляцияШапка.веб_ДляКТККлиента
	|	КОНЕЦ,
	|	КалькуляцияШапка.НачалоДействия
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга КАК Услуга,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПунктОтправления КАК ПунктОтправления,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПунктНазначения КАК ПунктНазначения,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Тариф20 КАК Тариф20,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Тариф40 КАК Тариф40,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Валюта.Код КАК ВалютаКод,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СуммаВознаграждения20 КАК СуммаВознаграждения20,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СуммаВознаграждения40 КАК СуммаВознаграждения40,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Итого20 КАК Итого20,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Итого40 КАК Итого40,
	|	ВТ_УникальныеКалькуляции.Ссылка КАК СсылкаКалькуляции,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СтавкаНДС КАК СтавкаНДС,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.НДСВключенВСтоимость КАК НДСВключенВСтоимость
	|ИЗ
	|	ВТ_УникальныеКалькуляции КАК ВТ_УникальныеКалькуляции
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	|		ПО ВТ_УникальныеКалькуляции.Ссылка = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КалькуляцияНФ_ВыбранныеСтавки.Фрахт20 КАК Фрахт20,
	|	КалькуляцияНФ_ВыбранныеСтавки.Вознаграждение20 КАК Вознаграждение20,
	|	КалькуляцияНФ_ВыбранныеСтавки.Итого20 КАК Итого20,
	|	КалькуляцияНФ_ВыбранныеСтавки.Фрахт40 КАК Фрахт40,
	|	КалькуляцияНФ_ВыбранныеСтавки.Вознаграждение40 КАК Вознаграждение40,
	|	КалькуляцияНФ_ВыбранныеСтавки.Итого40 КАК Итого40,
	|	КалькуляцияНФ_ВыбранныеСтавки.Валюта.Код КАК ВалютаКод,
	|	КалькуляцияНФ_ВыбранныеСтавки.Порт КАК Порт,
	|	КалькуляцияНФ_ВыбранныеСтавки.SOCCOC КАК SOCCOC,
	|	ВТ_УникальныеКалькуляции.Ссылка КАК СсылкаКалькуляции,
	|	КалькуляцияНФ_ВыбранныеСтавки.ПортВыгрузкиОтгрузки КАК ПортВыгрузкиОтгрузки
	|ИЗ
	|	ВТ_УникальныеКалькуляции КАК ВТ_УникальныеКалькуляции
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.НФ_ВыбранныеСтавки КАК КалькуляцияНФ_ВыбранныеСтавки
	|		ПО ВТ_УникальныеКалькуляции.Ссылка = КалькуляцияНФ_ВыбранныеСтавки.Ссылка";
	
	//Евросиб Каблов 20.05.2025 ( #110106
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 11", ТекстОграниченияПорции);
	//Евросиб Каблов 20.05.2025 )
	
	Запрос.УстановитьПараметр("ДействиеПриОбмене", Перечисления.ДействияПриОбмене.ЗагрузкаДанных);
	Запрос.УстановитьПараметр("УзелОбмена", перечисления.УзлыОбмена.БитФинанс);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	КоличествоПакетов = РезультатЗапроса.Количество();
	ВыборкаШапка= РезультатЗапроса[КоличествоПакетов-3].Выбрать();
	ВыборкаЖД = РезультатЗапроса[КоличествоПакетов-2].Выгрузить();    	 
	ВыборкаФрахт = РезультатЗапроса[КоличествоПакетов-1].Выгрузить();
	
	ТаблицаПунктовОтправления = РезультатЗапроса[КоличествоПакетов-5].Выгрузить();
	ТаблицаПунктовНазначения = РезультатЗапроса[КоличествоПакетов-4].Выгрузить();
	
	Запись = Новый ЗаписьXML; 
	Запись.УстановитьСтроку();
	Запись.ЗаписатьОбъявлениеXML(); //
	Запись.ЗаписатьНачалоЭлемента("Root");
	
	//Евросиб Каблов 20.05.2025 ( #110106
	Счетчик = 0;
	ОсталисьДанныеДляВыгрузки = Ложь;
	КоличествоЗаписейВПорцииДанных = НастройкаОбмена.КоличествоЗаписейВПорцииДанных;
	Если ЗначениеЗаполнено(КоличествоЗаписейВПорцииДанных) Тогда
		ОграничиватьПорцию = Истина;
	Иначе
		ОграничиватьПорцию = Ложь;
	КонецЕсли;
	//Евросиб Каблов 20.05.2025 )
   	
	Пока ВыборкаШапка.СледующийПоЗначениюПоля("Ссылка") Цикл
		
		//Евросиб Каблов 20.05.2025 ( #110106
		Счетчик = Счетчик + 1;
		Если ОграничиватьПорцию И Счетчик > КоличествоЗаписейВПорцииДанных Тогда
			ОсталисьДанныеДляВыгрузки = Истина;
			Прервать;
		КонецЕсли;
		//Евросиб Каблов 20.05.2025 )
		
		Запись.ЗаписатьНачалоЭлемента("Калькуляция"); 
		
		ГУИДКалькуляции = Строка(ВыборкаШапка.Ссылка.УникальныйИдентификатор());
		
		Запись.ЗаписатьАтрибут("ГУИД",										ГУИДКалькуляции);
		Запись.ЗаписатьАтрибут("НомерКалькуляции",							Строка(ВыборкаШапка.Номер));
		Запись.ЗаписатьАтрибут("ДатаСозданияКалькуляции",					Строка(ВыборкаШапка.Дата));
		Запись.ЗаписатьАтрибут("Контрагент",								Строка(ВыборкаШапка.Контрагент));
		Запись.ЗаписатьАтрибут("Договор",									Строка(ВыборкаШапка.Договор));
		Запись.ЗаписатьАтрибут("ОтветственныйМенеджерОПЗаДоговор",			Строка(ВыборкаШапка.ДоговорОтветственныйЗаДоговор));
		Запись.ЗаписатьАтрибут("ПериодДействия", 							Строка(ВыборкаШапка.ПериодДействия) + "/" + Строка(ВыборкаШапка.ОкончаниеДействия));
	//	Запись.ЗаписатьАтрибут("ОкончаниеДействия",							Строка(ВыборкаШапка.ОкончаниеДействия));
		Запись.ЗаписатьАтрибут("ТипКалькуляции",							Строка(ВыборкаШапка.ТипКалькуляции));
		Запись.ЗаписатьАтрибут("УчетноеНаправление", 						Строка(ВыборкаШапка.УчетноеНаправление));
		Запись.ЗаписатьАтрибут("ПринадлежностьКТК",							Строка(ВыборкаШапка.ПринадлежностьКТК));
		Запись.ЗаписатьАтрибут("ВидПеревозки", 								Строка(ВыборкаШапка.ВидПеревозки));
		Запись.ЗаписатьАтрибут("ИтогоСебестоимость20", 						Строка(ВыборкаШапка.ИтогоСебестоимость20));
		Запись.ЗаписатьАтрибут("ИтогоСебестоимость40",						Строка(ВыборкаШапка.ИтогоСебестоимость40));
		Запись.ЗаписатьАтрибут("ИтогоВознаграждение20",						Строка(ВыборкаШапка.ИтогоВознаграждение20));
		Запись.ЗаписатьАтрибут("ИтогоВознаграждение40",						Строка(ВыборкаШапка.ИтогоВознаграждение40));
		Запись.ЗаписатьАтрибут("ИтогоСтавка20", 							Строка(ВыборкаШапка.ИтогоСтавка20));
		Запись.ЗаписатьАтрибут("ИтогоСтавка40", 							Строка(ВыборкаШапка.ИтогоСтавка40));
		Запись.ЗаписатьАтрибут("НомерСвязанногоПротокола",					Строка(ВыборкаШапка.НомерСвязанногоПротокола));
		Запись.ЗаписатьАтрибут("СтатусСвязанногоПротокола",					Строка(ВыборкаШапка.СтатусСвязанногоПротокола));
		Запись.ЗаписатьАтрибут("ДокументыПоСделкеВыставлены",				Строка(ВыборкаШапка.ДокументыПоСделкеВыставлены));
		Запись.ЗаписатьАтрибут("УсловияПеревозкиПоОтправлениюПоЖД",			Строка(ВыборкаШапка.УсловияПеревозкиПоОтправлениюПоЖД));
		Запись.ЗаписатьАтрибут("УсловияПеревозкиПоПрибытиюПоЖД",			Строка(ВыборкаШапка.УсловияПеревозкиПоПрибытиюПоЖД));
		
		Запись.ЗаписатьАтрибут("ПунктОтправленияПоЖД", 						Строка(ВыборкаШапка.ПунктОтправленияПоЖД));		
		Если ЗначениеЗаполнено(ВыборкаШапка.ПунктОтправленияПоЖД) Тогда
			ЛокацияГуид = Строка(ВыборкаШапка.ПунктОтправленияПоЖД.УникальныйИдентификатор());
		Иначе
			ЛокацияГУИД = "";
		КонецЕсли;
		Запись.ЗаписатьАтрибут("ПунктОтправленияПоЖД_ГУИД", 						ЛокацияГУИД);
		
		Запись.ЗаписатьАтрибут("ПунктНазначенияПоЖД", 						Строка(ВыборкаШапка.ПунктНазначенияПоЖД));
		Если ЗначениеЗаполнено(ВыборкаШапка.ПунктНазначенияПоЖД) Тогда
			ЛокацияГуид = Строка(ВыборкаШапка.ПунктНазначенияПоЖД.УникальныйИдентификатор());
		Иначе
			ЛокацияГУИД = "";
		КонецЕсли;
		Запись.ЗаписатьАтрибут("ПунктНазначенияПоЖД_ГУИД", 						ЛокацияГУИД);
		
		//Запись.ЗаписатьАтрибут("ПереченьВозможныхПунктовОтправленияПоЖД", 	Строка(ВыборкаШапка.ПереченьВозможныхПунктовОтправленияПоЖД));
		//Запись.ЗаписатьАтрибут("ПереченьВозможныхПунктовНазначенияПоЖД", 	Строка(ВыборкаШапка.ПереченьВозможныхПунктовНазначенияПоЖД));
		Запись.ЗаписатьАтрибут("ПериодДействияСтавкиФрахта", 				Строка(ВыборкаШапка.ПериодДействияСтавкиФрахта));

		СтруктураПоиска = Новый Структура("СсылкаКалькуляции", ВыборкаШапка.Ссылка);
		
		ПереченьПунктовОтправления = ТаблицаПунктовОтправления.НайтиСтроки(СтруктураПоиска);
		Запись.ЗаписатьНачалоЭлемента("ПереченьВозможныхПунктовОтправленияПоЖД");
		Для Каждого Стр из ПереченьПунктовОтправления Цикл
			Запись.ЗаписатьНачалоЭлемента("Локация");
			Запись.ЗаписатьАтрибут("Наименование", 			Строка(Стр.Локация));
			Запись.ЗаписатьАтрибут("ГУИД", 					Строка(Стр.Локация.УникальныйИдентификатор()));			
			Запись.ЗаписатьКонецЭлемента();
		КонецЦикла;
		Запись.ЗаписатьКонецЭлемента();
		
		ПереченьПунктовНазначения = ТаблицаПунктовНазначения.НайтиСтроки(СтруктураПоиска);
		Запись.ЗаписатьНачалоЭлемента("ПереченьВозможныхПунктовНазначенияПоЖД");
		Для Каждого Стр из ПереченьПунктовНазначения Цикл
			Запись.ЗаписатьНачалоЭлемента("Локация");
			Запись.ЗаписатьАтрибут("Наименование", 			Строка(Стр.Локация));
			Запись.ЗаписатьАтрибут("ГУИД", 					Строка(Стр.Локация.УникальныйИдентификатор()));			
			Запись.ЗаписатьКонецЭлемента();
		КонецЦикла;
		Запись.ЗаписатьКонецЭлемента();
		
		СтрокиЖДПоКалькуляции = ВыборкаЖД.НайтиСтроки(СтруктураПоиска);
		Запись.ЗаписатьНачалоЭлемента("ТабличнаяЧастьРазделаКалькуляцииПоСуше");
		Для Каждого СтрокаЖД из СтрокиЖДПоКалькуляции Цикл
			Запись.ЗаписатьНачалоЭлемента("СтрокаТабличнойЧастиРазделаКалькуляцииПоСуше");
			Запись.ЗаписатьАтрибут("Услуга", 				Строка(СтрокаЖД.Услуга));
			
			Запись.ЗаписатьАтрибут("ПунктОтправления", 		Строка(СтрокаЖД.ПунктОтправления));
			Если ЗначениеЗаполнено(СтрокаЖД.ПунктОтправления) Тогда
				ЛокацияГуид = Строка(СтрокаЖД.ПунктОтправления.УникальныйИдентификатор());
			Иначе
				ЛокацияГУИД = "";
			КонецЕсли;			
			Запись.ЗаписатьАтрибут("ПунктОтправления_ГУИД", ЛокацияГУИД);
			
			Запись.ЗаписатьАтрибут("ПунктНазначения", 		Строка(СтрокаЖД.ПунктНазначения));
			Если ЗначениеЗаполнено(СтрокаЖД.ПунктНазначения) Тогда
				ЛокацияГуид = Строка(СтрокаЖД.ПунктНазначения.УникальныйИдентификатор());
			Иначе
				ЛокацияГУИД = "";
			КонецЕсли;
			Запись.ЗаписатьАтрибут("ПунктНазначения_ГУИД", 	ЛокацияГУИД);
			
			Запись.ЗаписатьАтрибут("Тариф20", 				Строка(СтрокаЖД.Тариф20));
			Запись.ЗаписатьАтрибут("Тариф40", 				Строка(СтрокаЖД.Тариф40));
			Запись.ЗаписатьАтрибут("ВалютаКод", 			Строка(СтрокаЖД.ВалютаКод));
			Запись.ЗаписатьАтрибут("СуммаВознаграждения20", Строка(СтрокаЖД.СуммаВознаграждения20));
			Запись.ЗаписатьАтрибут("СуммаВознаграждения40", Строка(СтрокаЖД.СуммаВознаграждения40));
			Запись.ЗаписатьАтрибут("Итого20", 				Строка(СтрокаЖД.Итого20));
			Запись.ЗаписатьАтрибут("Итого40", 				Строка(СтрокаЖД.Итого40));
			Запись.ЗаписатьАтрибут("СтавкаНДС", 			Строка(СтрокаЖД.СтавкаНДС));
			Запись.ЗаписатьАтрибут("СтавкаНДСЗначение", 	Строка(БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСтавкуНДС(СтрокаЖД.СтавкаНДС)));
			Запись.ЗаписатьАтрибут("НДСВключенВСтавку",		XMLСтрока(СтрокаЖД.НДСВключенВСтоимость));
			Запись.ЗаписатьКонецЭлемента();
		КонецЦикла;	
		Запись.ЗаписатьКонецЭлемента();
		
		СтрокиМоре = ВыборкаФрахт.НайтиСтроки(СтруктураПоиска);
		Запись.ЗаписатьНачалоЭлемента("РазделКалькуляцииПоМорскомуПлечу");
		Для Каждого СтрокаМоре из СтрокиМоре Цикл
			Запись.ЗаписатьНачалоЭлемента("СтрокаРазделаКалькуляцииПоМорскомуПлечу");
			Запись.ЗаписатьАтрибут("Порт", 			Строка(СтрокаМоре.Порт));
			Запись.ЗаписатьАтрибут("ВалютаСтавкиФрахта" 			+ Строка(СтрокаМоре.SOCCOC), 	Строка(СтрокаМоре.ВалютаКод ));
			Запись.ЗаписатьАтрибут("СебестоимостьСтавкиФрахта20" 	+ Строка(СтрокаМоре.SOCCOC), 	Строка(СтрокаМоре.Фрахт20));
			Запись.ЗаписатьАтрибут("Вознаграждение20" 				+ Строка(СтрокаМоре.SOCCOC), 	Строка(СтрокаМоре.Вознаграждение20));
			Запись.ЗаписатьАтрибут("СтавкаФрахтаФлиенту20" 			+ Строка(СтрокаМоре.SOCCOC), 	Строка(СтрокаМоре.Итого20));
			Запись.ЗаписатьАтрибут("СебестоимостьСтавкиФрахта40" 	+ Строка(СтрокаМоре.SOCCOC),	Строка(СтрокаМоре.Фрахт40));
			Запись.ЗаписатьАтрибут("Вознаграждение40" 				+ Строка(СтрокаМоре.SOCCOC), 	Строка(СтрокаМоре.Вознаграждение40 ));
			Запись.ЗаписатьАтрибут("СтавкаФрахтаКлиенту40" 			+ Строка(СтрокаМоре.SOCCOC), 	Строка(СтрокаМоре.Итого40));
			Запись.ЗаписатьАтрибут("ПортВыгрузкиОтгрузки", 											Строка(СтрокаМоре.ПортВыгрузкиОтгрузки));
			Запись.ЗаписатьКонецЭлемента();
		КонецЦикла;	
	
		Запись.ЗаписатьКонецЭлемента();		
		Запись.ЗаписатьКонецЭлемента();
		
		СтруктураПоиска = Новый Структура("ДействиеПриОбмене, УзелОбмена, Объект", Перечисления.ДействияПриОбмене.ВыгрузкаДанных, УзелОбмена, ВыборкаШапка.Ссылка);
		СтруктураДанных = Новый Структура("УИДИсточника, ЗагрузкаПодтверждена, ДатаОбмена", ГУИДКалькуляции, Ложь, ВремяВыгрузки);
		РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных);
	
	КонецЦикла;
	
	//Евросиб Каблов 20.05.2025 ( #110106
	ДобавитьЭлементВФайл(Запись, "ОсталисьДанныеДляВыгрузки", ОсталисьДанныеДляВыгрузки);
	//Евросиб Каблов 20.05.2025 )
	
	Запись.ЗаписатьКонецЭлемента();
	ОтветXml = Запись.Закрыть();  
	
	Возврат ОтветXml

КонецФункции

//Евросиб Каблов 14.11.2024 ( #93051 перенес из модуля веб-сервиса DataCoreWS
// Евросиб(ДИТ) US 86002 ТА 87080 Сержантова А.С. 02.08.2024
//Функция DownloadConfirmation(XMLParams, RequestingSystem, DocumentType)
Функция ПодтвердитьЗагрузкуДокументовВУзелОбмена(XMLParams, RequestingSystem, DocumentType) Экспорт
//Евросиб Каблов 14.11.2024 )

    //общее описание обмена
	//http://tsxconfluence:8090/x/n5JXCQ
	


	Если НЕ ЗначениеЗаполнено(RequestingSystem) Тогда
		Возврат "<xml><error>Пустое значение параметра RequestingSystem!</error></xml>";
	КонецЕсли;    
	
	Если НЕ ЗначениеЗаполнено(DocumentType) Тогда
		Возврат "<xml><error>Пустое значение параметра DocumentType!</error></xml>";
	КонецЕсли;
	
	УзелОбмена = Неопределено;
	Для каждого ЗначПеречисления Из Метаданные.Перечисления.УзлыОбмена.ЗначенияПеречисления Цикл
		Если ЗначПеречисления.Имя = RequestingSystem Тогда
			УзелОбмена = Перечисления.УзлыОбмена[ЗначПеречисления.Имя];  
			Прервать;
		КонецЕсли;
	КонецЦикла;  
	
	УзелПланаОбмена = ПланыОбмена.ВыгрузкаДанных.ПолучитьУзелОбмена(УзелОбмена);
	Если УзелПланаОбмена = Неопределено Тогда
		Возврат "<xml><error>Не найден узел обмена по входному параметру RequestingSystem!</error></xml>";
	КонецЕсли; 
	
	//Евросиб Каблов 05.02.2025 ( #100571
	//МетаданныеДокумента = Метаданные.НайтиПоПолномуИмени("Документ." + DocumentType);
	Если DocumentType = "Тариф" Тогда
		МетаданныеДокумента = Метаданные.Справочники.КлючиАналитикиСтрокПротокола;
		МенеджерОбъекта = Справочники.КлючиАналитикиСтрокПротокола;  
	//Евросиб Коханенко Н.А. 21.11.2025 (( #124142 
	ИначеЕсли DocumentType = "ТипоразмерыТЕ" Тогда 
		МетаданныеДокумента = Метаданные.Справочники.ТипоразмерыТЕ;
		МенеджерОбъекта = Справочники.ТипоразмерыТЕ;
	//Евросиб Коханенко Н.А. 21.11.2025 )) #124142 
	//Евросиб Коханенко Н.А. 16.12.2025 (( #125251 
	ИначеЕсли DocumentType = "АдресаВНаселенныхПунктах" Тогда 
		МетаданныеДокумента = Метаданные.Справочники.АдресаВНаселенныхПунктах;
		МенеджерОбъекта = Справочники.АдресаВНаселенныхПунктах;
	//Евросиб Коханенко Н.А. 16.12.2025 )) #125251 
	//Евросиб Коханенко Н.А. 24.03.2025 (( #102956 
	ИначеЕсли DocumentType = "КлючиАналитикиПеревозки" Тогда 
		МетаданныеДокумента = Метаданные.НайтиПоПолномуИмени("Справочник." + DocumentType);
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Справочник." + DocumentType);
	//Евросиб Коханенко Н.А. 24.03.2025 )) #102956 
	// Евросиб US 105219 TA 105220 Рыбьяков К.А. 20.04.2025 ((
	ИначеЕсли DocumentType = "ПСЦПоставщика" Тогда 
		МетаданныеДокумента = Метаданные.НайтиПоПолномуИмени("Документ." + DocumentType);
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Документ." + DocumentType);
	// Евросиб Рыбьяков К.А. 20.04.2025 ))
	Иначе
		МетаданныеДокумента = Метаданные.НайтиПоПолномуИмени("Документ." + DocumentType);
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Документ." + DocumentType);
	КонецЕсли;
	//Евросиб Каблов 05.02.2025 )
	
	Если МетаданныеДокумента = Неопределено Тогда
		Возврат "<xml><error>Не найден документ по типу в параметре DocumentType!</error></xml>";
	КонецЕсли;

	Чтение 				= Новый ЧтениеXML;
	Чтение.УстановитьСтроку(XMLParams);
	Фабрика 			= Новый ФабрикаXDTO;
	ОбъектXDTO			= Фабрика.ПрочитатьXML(Чтение);
	
	ВсеСвойстваОбъекта = ОбъектXDTO.Свойства();
	Если ВсеСвойстваОбъекта.Получить("Шапка") = Неопределено Тогда
		Возврат "<xml><error>Нет списка ГУИДов к подтверждению!</error></xml>";
	КонецЕсли;
	
	ВыгрузкаДанных 	= Перечисления.ДействияПриОбмене.ВыгрузкаДанных;
	КСнятиюСРегистрации = Новый Массив; 
	ТекстОшибки = ""; 
	
	//Евросиб Коханенко Н.А. 24.03.2025 (( #102956 
	Если DocumentType = "КлючиАналитикиПеревозки" Тогда 
		МассивГУИДовСтрокДХ = Новый Массив;
		Если НЕ ТипЗнч(ОбъектXDTO.Шапка)= ТИП(ОбъектXDTO) Тогда
			Для Каждого Объект Из ОбъектXDTO.Шапка Цикл
				МассивГУИДовСтрокДХ.Добавить(Объект.ГУИД);
			КонецЦикла;
		Иначе		
			Объект = ОбъектXDTO.Шапка;   
			МассивГУИДовСтрокДХ.Добавить(Объект.ГУИД);
		КонецЕсли;           
		
		ТаблицаКлючейАналитикиПеревозки = ПолучитьТаблицуКлючейАналитикиПеревозки(МассивГУИДовСтрокДХ);
		
		Для Каждого СтрокаТаблицыКлючейАналитики Из ТаблицаКлючейАналитикиПеревозки Цикл 
			
			ПланыОбмена.УдалитьРегистрациюИзменений(УзелПланаОбмена, СтрокаТаблицыКлючейАналитики.Ссылка);

			//ГУИД = СсылкаНаОбъект.УникальныйИдентификатор();
		
			ПодтвердитьЗагрузкуОбъектаПоГУИДБезПроведения(СтрокаТаблицыКлючейАналитики.ГУИД, ВыгрузкаДанных, УзелОбмена, СтрокаТаблицыКлючейАналитики.Ссылка);

		КонецЦикла;
		
		Возврат "<xml><success>Подтверждение загрузки завершено</success></xml>";
		
	КонецЕсли;
	//Евросиб Коханенко Н.А. 24.03.2025 )) #102956 
	
	// Евросиб US 105219 TA 105220 Рыбьяков К.А. 20.04.2025 ((
	Если DocumentType = "ПСЦПоставщика" Тогда 
		МассивГУИДовСтрок = Новый Массив;
		Если НЕ ТипЗнч(ОбъектXDTO.Шапка)= ТИП(ОбъектXDTO) Тогда
			Для Каждого Объект Из ОбъектXDTO.Шапка Цикл
				МассивГУИДовСтрок.Добавить(Объект.ГУИД);
			КонецЦикла;
		Иначе		
			Объект = ОбъектXDTO.Шапка;
			МассивГУИДовСтрок.Добавить(Объект.ГУИД);
		КонецЕсли;
		
		МассивСсылокКлючей = ПолучитьМассивСсылокПСЦ(МассивГУИДовСтрок);
		
		ПланыОбмена.УдалитьРегистрациюИзменений(УзелПланаОбмена, МассивСсылокКлючей);
		
		Возврат "<xml><success>Подтверждение загрузки завершено</success></xml>";
		
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 20.04.2025 ))   
	
	//Евросиб Коханенко Н.А. 21.11.2025 (( #124142
	Если DocumentType = "ТипоразмерыТЕ" Тогда 
		МассивСсылокКлючей = Новый Массив;
		Если НЕ ТипЗнч(ОбъектXDTO.Шапка)= ТИП(ОбъектXDTO) Тогда
			Для Каждого Объект Из ОбъектXDTO.Шапка Цикл
				МассивСсылокКлючей.Добавить(Справочники.ТипоразмерыТЕ.ПолучитьСсылку(Новый УникальныйИдентификатор(Объект.ГУИД)));
			КонецЦикла;
		Иначе		
			Объект = ОбъектXDTO.Шапка;
			МассивСсылокКлючей.Добавить(Справочники.ТипоразмерыТЕ.ПолучитьСсылку(Новый УникальныйИдентификатор(Объект.ГУИД)));
		КонецЕсли;
		
		ПланыОбмена.УдалитьРегистрациюИзменений(УзелПланаОбмена, МассивСсылокКлючей);
		
		Возврат "<xml><success>Подтверждение загрузки завершено</success></xml>";
		
	КонецЕсли;
	//Евросиб Коханенко Н.А. 21.11.2025 )) #124142 
	
    //Евросиб Коханенко Н.А. 16.12.2025 (( #125251
	Если DocumentType = "АдресаВНаселенныхПунктах" Тогда 
		МассивСсылокКлючей = Новый Массив;
		Если НЕ ТипЗнч(ОбъектXDTO.Шапка)= ТИП(ОбъектXDTO) Тогда
			Для Каждого Объект Из ОбъектXDTO.Шапка Цикл
				МассивСсылокКлючей.Добавить(Справочники.АдресаВНаселенныхПунктах.ПолучитьСсылку(Новый УникальныйИдентификатор(Объект.ГУИД)));
			КонецЦикла;
		Иначе		
			Объект = ОбъектXDTO.Шапка;
			МассивСсылокКлючей.Добавить(Справочники.АдресаВНаселенныхПунктах.ПолучитьСсылку(Новый УникальныйИдентификатор(Объект.ГУИД)));
		КонецЕсли;
		
		ПланыОбмена.УдалитьРегистрациюИзменений(УзелПланаОбмена, МассивСсылокКлючей);
		
		Возврат "<xml><success>Подтверждение загрузки завершено</success></xml>";
		
	КонецЕсли;
	//Евросиб Коханенко Н.А. 16.12.2025 )) #125251
	
	Если НЕ ТипЗнч(ОбъектXDTO.Шапка)= ТИП(ОбъектXDTO) Тогда
		Для Каждого Объект Из ОбъектXDTO.Шапка Цикл
			Если Не ПодтвердитьЗагрузкуДокумента(Объект, МенеджерОбъекта, DocumentType, УзелОбмена, УзелПланаОбмена, ТекстОшибки) Тогда
				Возврат ТекстОшибки;
			КонецЕсли;			 
		КонецЦикла	
	Иначе		
		Объект = ОбъектXDTO.Шапка;   
		Если Не ПодтвердитьЗагрузкуДокумента(Объект, МенеджерОбъекта, DocumentType, УзелОбмена, УзелПланаОбмена, ТекстОшибки) Тогда
			Возврат ТекстОшибки;
		КонецЕсли;
	КонецЕсли;    
		
	Возврат "<xml><success>Подтверждение загрузки завершено</success></xml>";
	
КонецФункции

//Евросиб Каблов 14.11.2024 #93051
Функция ПодтвердитьЗагрузкуДокумента(ОбъектХ, МенеджерОбъекта, ИмяОбъекта, УзелОбмена, УзелПланаОбмена, ТекстРезультат)
	
	ВыгрузкаДанных = Перечисления.ДействияПриОбмене.ВыгрузкаДанных;
	
	ПроизошлаОшибка = Ложь;
	Попытка
		СсылкаНаОбъект = МенеджерОбъекта.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектХ.ГУИД));
		Если Не ОбщегоНазначения.СсылкаСуществует(СсылкаНаОбъект) Тогда
			ПроизошлаОшибка = Истина;
		КонецЕсли;
	Исключение
	    ПроизошлаОшибка = Истина;
	КонецПопытки;		
	
	Если ПроизошлаОшибка Тогда
		ТекстРезультат = СтрШаблон("<xml><error>Не найден документ %1 по ГУИДу %2</error></xml>", ИмяОбъекта, ОбъектХ.ГУИД);
		Возврат Ложь;
	КонецЕсли;
	
	ВремяВыгрузки = РегистрыСведений.ПротоколОбменов.ДатаВыгрузкиОбъекта(УзелОбмена, ВыгрузкаДанных, СсылкаНаОбъект);
	ВремяПоследнегоИзменения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, "Изменено");
	
	Если ВремяПоследнегоИзменения <> Неопределено И ВремяВыгрузки > ВремяПоследнегоИзменения Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(УзелПланаОбмена, СсылкаНаОбъект);	
	КонецЕсли;
		
	ПодтвердитьЗагрузкуОбъектаПоГУИДБезПроведения(ОбъектХ.ГУИД, ВыгрузкаДанных, УзелОбмена, СсылкаНаОбъект);
	
	Возврат Истина;
			
КонецФункции

//Евросиб Каблов 14.11.2024 #93051 перенес из модуля веб-сервиса DataCoreWS
// Евросиб(ДИТ) US 86002 ТА 87080 Сержантова А.С. 08.08.2024
Процедура ПодтвердитьЗагрузкуОбъектаПоГУИДБезПроведения(ГУИД, Действие, УзелОбмена, СсылкаНаОбъект = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		СсылкаНаОбъект = РегистрыСведений.ПротоколОбменов.СсылкаПоУИД(ГУИД, Действие, УзелОбмена);
	КонецЕсли;
	
	Если СсылкаНаОбъект <> Неопределено Тогда
		
		//Объект = СсылкаНаОбъект.Получитьобъект();
		
		НаборЗаписей = РегистрыСведений.ПротоколОбменов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДействиеПриОбмене.Установить(Действие);
		НаборЗаписей.Отбор.УзелОбмена.Установить(УзелОбмена);
		НаборЗаписей.Отбор.Объект.Установить(СсылкаНаОбъект);
		
		НаборЗаписей.Прочитать();
		Для Каждого Запись Из НаборЗаписей Цикл
			Запись.ЗагрузкаПодтверждена = Истина; 
		КонецЦикла;
		НаборЗаписей.Записать();
		
	КонецЕсли;	

КонецПроцедуры

//Евросиб(ДИТ), Беляев СЮ, BUG 95529 / TA 95530, 18-11-2024, начало (перенёс процедуры из веб-сервиса DataCoreWS)
Функция ПолучитьДанныеРелизов(RequestingSystem, DateStart, DateEnd) Экспорт  
	
	Если НЕ ЗначениеЗаполнено(RequestingSystem) Тогда
		Возврат "<xml><error>Пустое значение параметра RequestingSystem!</error></xml>";
	КонецЕсли;  
	
	УзелОбмена = Неопределено;
	Для каждого ЗначПеречисления Из Метаданные.Перечисления.УзлыОбмена.ЗначенияПеречисления Цикл
		Если ЗначПеречисления.Представление() = RequestingSystem Тогда
			УзелОбмена = Перечисления.УзлыОбмена[ЗначПеречисления.Имя];  
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	УзелПланаОбмена = ПланыОбмена.ВыгрузкаДанных.ПолучитьУзелОбмена(УзелОбмена);
	Если УзелОбмена = Неопределено или УзелПланаОбмена.Количество() = 0 Тогда
		Возврат "<xml><error>Не найден узел обмена по входному параметру RequestingSystem!</error></xml>";
	КонецЕсли;
	
	//Евросиб Каблов 20.05.2025 ( #110106
	НастройкаОбмена = Справочники.НастройкиОбменов.ПолучитьНастройкуОбмена(УзелОбмена, "GetOwnerRelease");
	
	КоличествоЗаписейВПорцииДанных = НастройкаОбмена.КоличествоЗаписейВПорцииДанных;
	Если ЗначениеЗаполнено(КоличествоЗаписейВПорцииДанных) Тогда
		КоличествоЗаписейВПорцииДанныхПлюсОдин = КоличествоЗаписейВПорцииДанных + 1;
		ТекстОграниченияПорции = СтрШаблон("ПЕРВЫЕ %1", Формат(КоличествоЗаписейВПорцииДанныхПлюсОдин, "ЧГ=0"));
	Иначе
		ТекстОграниченияПорции = "";
	КонецЕсли;
	//Евросиб Каблов 20.05.2025 )
	
	Если ЗначениеЗаполнено(DateStart) и ЗначениеЗаполнено(DateEnd) Тогда
	// Выгрузка за период
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 11
		|	РелизСобственника.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_РелизыСобственника
		|ИЗ
		|	Документ.РелизСобственника КАК РелизСобственника
		|ГДЕ
		|	РелизСобственника.Проведен
		|	И РелизСобственника.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|;
		//Евросиб Шевченко А.В. US 106313 TA 109960 22.05.2025
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ПротоколОбменов.УИДИсточника) КАК УИДИсточника,
		|	ПротоколОбменов.Объект КАК Объект
		|ПОМЕСТИТЬ ВТ_Договоры
		|ИЗ
		|	ВТ_РелизыСобственника КАК ВТ_РелизыСобственника
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		|		ПО ВТ_РелизыСобственника.Ссылка.Договор = ПротоколОбменов.Объект
		|			И (ПротоколОбменов.УзелОбмена = &УзелБФ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПротоколОбменов.Объект
		|;
		//Евросиб Шевченко А.В. US 106313 TA 109960 22.05.2025
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РелизСобственника.Ссылка КАК РелизСобственника,
		|	РелизСобственника.Проведен КАК Проведен,
		|	РелизСобственника.ПометкаУдаления КАК ПометкаУдаления,
		|	РелизСобственника.Дата КАК Дата,
		|	РелизСобственника.Номер КАК Номер,
		|	РелизСобственника.Локация КАК Локация,
		|	РелизСобственника.Локация.Код КАК ЛокацияКод,
		|	РелизСобственника.Локация.Наименование КАК ЛокацияНаименование,
		|	РелизСобственника.Локация.КодЖДСтанции КАК ЛокацияКодЖДСтанции,
		|	РелизСобственника.Локация.КодПортаUNLOCODE КАК ЛокацияКодПорта,
		|	РелизСобственника.Локация.Тип КАК ЛокацияТип,
		|	РелизСобственника.ЛокацияСдачи КАК ЛокацияСдачи,
		|	ВЫРАЗИТЬ(РелизСобственника.ЛокацияСдачи КАК Справочник.Локации).Код КАК ЛокацияСдачиКод,
		|	ВЫРАЗИТЬ(РелизСобственника.ЛокацияСдачи КАК Справочник.Локации).Наименование КАК ЛокацияСдачиНаименование,
		|	ВЫРАЗИТЬ(РелизСобственника.ЛокацияСдачи КАК Справочник.Локации).КодЖДСтанции КАК ЛокацияСдачиКодЖДСтанции,
		|	ВЫРАЗИТЬ(РелизСобственника.ЛокацияСдачи КАК Справочник.Локации).КодПортаUNLOCODE КАК ЛокацияСдачиКодПорта,
		|	ВЫРАЗИТЬ(РелизСобственника.ЛокацияСдачи КАК Справочник.Локации).Тип КАК ЛокацияСдачиТип,
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(РелизСобственника.Ссылка) КАК ГУИД,
		//Евросиб Шевченко А.В. US 106313 TA 109960 22.05.2025
		|	ЕСТЬNULL(ВТ_Договоры.УИДИсточника, """") КАК ДоговорГУИД,
		|	ЕСТЬNULL(РелизСобственника.Договор.Наименование,"""") КАК ДоговорНаименование
		//Евросиб Шевченко А.В. US 106313 TA 109960 22.05.2025
		|ИЗ
		|	ВТ_РелизыСобственника КАК ВТ_РелизыСобственника
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РелизСобственника КАК РелизСобственника
		|		ПО ВТ_РелизыСобственника.Ссылка = РелизСобственника.Ссылка
		//Евросиб Шевченко А.В. US 106313 TA 109960 22.05.2025
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Договоры КАК ВТ_Договоры
		|		ПО (ВТ_Договоры.Объект = РелизСобственника.Договор)
		//Евросиб Шевченко А.В. US 106313 TA 109960 22.05.2025
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РелизСобственникаНоминации.Ссылка КАК Ссылка,
		|	РелизСобственникаНоминации.ГУИДСтроки КАК ГУИДСтроки,
		|	РелизСобственникаНоминации.Контейнер КАК Контейнер,
		|	РелизСобственникаНоминации.тек_СобственностьКТК КАК ВидСобственности,
		|	РелизСобственникаНоминации.ДатаВзятия КАК ДатаВзятия,
		|	РелизСобственникаНоминации.Ставка КАК Ставка,
		|	ЕСТЬNULL(РелизСобственникаНоминации.Валюта.Код, """") КАК Валюта,
		|	РелизСобственникаНоминации.СтавкаНДС КАК СтавкаНДС,
		|	РелизСобственникаНоминации.НДСВключая КАК НДСВключая,
		|	РелизСобственникаНоминации.ДатаВозвратаСобственнику КАК ДатаВозвратаСобственнику
		|ИЗ
		|	ВТ_РелизыСобственника КАК ВТ_РелизыСобственника
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
		|		ПО ВТ_РелизыСобственника.Ссылка = РелизСобственникаНоминации.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РелизыСобственника.Ссылка КАК Ссылка,
		|	РелизСобственникаСНП.НомерСтроки КАК НомерСтроки,
		|	РелизСобственникаСНП.ГУИДСтроки КАК ГУИДСтроки,
		|	РелизСобственникаСНП.От КАК От,
		|	РелизСобственникаСНП.До КАК До,
		|	РелизСобственникаСНП.Стоимость КАК Стоимость
		|ИЗ
		|	ВТ_РелизыСобственника КАК ВТ_РелизыСобственника
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РелизСобственника.СНП КАК РелизСобственникаСНП
		|		ПО ВТ_РелизыСобственника.Ссылка = РелизСобственникаСНП.Ссылка";
		
		Запрос.УстановитьПараметр("ДатаНачала", DateStart);
		Запрос.УстановитьПараметр("ДатаОкончания", DateEnd);
		//Евросиб Шевченко А.В. US 106313 TA 109960 22.05.2025
		Запрос.УстановитьПараметр("УзелБФ", Перечисления.УзлыОбмена.БитФинанс);
		//Евросиб Шевченко А.В. US 106313 TA 109960 22.05.2025
		//Евросиб Каблов 20.05.2025 ( #110106
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 11", ТекстОграниченияПорции);
		//Евросиб Каблов 20.05.2025 )
		
		РезультатЗапросаПакет = Запрос.ВыполнитьПакет();
		
	Иначе
		
		//Выгружаем все, что осталось в плане обмена
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 11
		|	РелизСобственникаИзменения.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_РелизыСобственника
		|ИЗ
		|	Документ.РелизСобственника.Изменения КАК РелизСобственникаИзменения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизСобственника КАК РелизСобственника
		|		ПО РелизСобственникаИзменения.Ссылка = РелизСобственника.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		|		ПО РелизСобственникаИзменения.Ссылка = ПротоколОбменов.Объект
		|			И (ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ВыгрузкаДанных))
		|			И (ПротоколОбменов.УзелОбмена = &УзелОбмена)
		|			И (ПротоколОбменов.ЗагрузкаПодтверждена)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ЕСТЬNULL(ПротоколОбменов.ЗагрузкаПодтверждена, ЛОЖЬ) = ЛОЖЬ
		|				ТОГДА РелизСобственника.Проведен
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|;
		//Евросиб Шевченко А.В. US 106313 TA 109960 22.05.2025
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ПротоколОбменов.УИДИсточника) КАК УИДИсточника,
		|	ПротоколОбменов.Объект КАК Объект
		|ПОМЕСТИТЬ ВТ_Договоры
		|ИЗ
		|	ВТ_РелизыСобственника КАК ВТ_РелизыСобственника
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		|		ПО ВТ_РелизыСобственника.Ссылка.Договор = ПротоколОбменов.Объект
		|			И (ПротоколОбменов.УзелОбмена = &УзелБФ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПротоколОбменов.Объект
		|;
		//Евросиб Шевченко А.В. US 106313 TA 109960 22.05.2025
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РелизСобственника.Ссылка КАК РелизСобственника,
		|	РелизСобственника.Проведен КАК Проведен,
		|	РелизСобственника.ПометкаУдаления КАК ПометкаУдаления,
		|	РелизСобственника.Дата КАК Дата,
		|	РелизСобственника.Номер КАК Номер,
		|	РелизСобственника.Локация КАК Локация,
		|	РелизСобственника.Локация.Код КАК ЛокацияКод,
		|	РелизСобственника.Локация.Наименование КАК ЛокацияНаименование,
		|	РелизСобственника.Локация.КодЖДСтанции КАК ЛокацияКодЖДСтанции,
		|	РелизСобственника.Локация.КодПортаUNLOCODE КАК ЛокацияКодПорта,
		|	РелизСобственника.Локация.Тип КАК ЛокацияТип,
		|	РелизСобственника.ЛокацияСдачи КАК ЛокацияСдачи,
		|	ВЫРАЗИТЬ(РелизСобственника.ЛокацияСдачи КАК Справочник.Локации).Код КАК ЛокацияСдачиКод,
		|	ВЫРАЗИТЬ(РелизСобственника.ЛокацияСдачи КАК Справочник.Локации).Наименование КАК ЛокацияСдачиНаименование,
		|	ВЫРАЗИТЬ(РелизСобственника.ЛокацияСдачи КАК Справочник.Локации).КодЖДСтанции КАК ЛокацияСдачиКодЖДСтанции,
		|	ВЫРАЗИТЬ(РелизСобственника.ЛокацияСдачи КАК Справочник.Локации).КодПортаUNLOCODE КАК ЛокацияСдачиКодПорта,
		|	ВЫРАЗИТЬ(РелизСобственника.ЛокацияСдачи КАК Справочник.Локации).Тип КАК ЛокацияСдачиТип,
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(РелизСобственника.Ссылка) КАК ГУИД,
		//Евросиб Шевченко А.В. US 106313 TA 109960 22.05.2025
		|	ЕСТЬNULL(ВТ_Договоры.УИДИсточника, """") КАК ДоговорГУИД,
		|	ЕСТЬNULL(РелизСобственника.Договор.Наименование,"""") КАК ДоговорНаименование
		//Евросиб Шевченко А.В. US 106313 TA 109960 22.05.2025
		|ИЗ
		|	ВТ_РелизыСобственника КАК ВТ_РелизыСобственника
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РелизСобственника КАК РелизСобственника
		|		ПО ВТ_РелизыСобственника.Ссылка = РелизСобственника.Ссылка
		//Евросиб Шевченко А.В. US 106313 TA 109960 22.05.2025
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Договоры КАК ВТ_Договоры
		|		ПО (ВТ_Договоры.Объект = РелизСобственника.Договор)
		//Евросиб Шевченко А.В. US 106313 TA 109960 22.05.2025
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РелизСобственникаНоминации.Ссылка КАК Ссылка,
		|	РелизСобственникаНоминации.ГУИДСтроки КАК ГУИДСтроки,
		|	РелизСобственникаНоминации.Контейнер КАК Контейнер,
		|	РелизСобственникаНоминации.тек_СобственностьКТК КАК ВидСобственности,
		|	РелизСобственникаНоминации.ДатаВзятия КАК ДатаВзятия,
		|	РелизСобственникаНоминации.Ставка КАК Ставка,
		|	ЕСТЬNULL(РелизСобственникаНоминации.Валюта.Код, """") КАК Валюта,
		|	РелизСобственникаНоминации.СтавкаНДС КАК СтавкаНДС,
		|	РелизСобственникаНоминации.НДСВключая КАК НДСВключая,
		|	РелизСобственникаНоминации.ДатаВозвратаСобственнику КАК ДатаВозвратаСобственнику
		|ИЗ
		|	ВТ_РелизыСобственника КАК ВТ_РелизыСобственника
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
		|		ПО ВТ_РелизыСобственника.Ссылка = РелизСобственникаНоминации.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РелизыСобственника.Ссылка КАК Ссылка,
		|	РелизСобственникаСНП.НомерСтроки КАК НомерСтроки,
		|	РелизСобственникаСНП.ГУИДСтроки КАК ГУИДСтроки,
		|	РелизСобственникаСНП.От КАК От,
		|	РелизСобственникаСНП.До КАК До,
		|	РелизСобственникаСНП.Стоимость КАК Стоимость
		|ИЗ
		|	ВТ_РелизыСобственника КАК ВТ_РелизыСобственника
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РелизСобственника.СНП КАК РелизСобственникаСНП
		|		ПО ВТ_РелизыСобственника.Ссылка = РелизСобственникаСНП.Ссылка";
		
		//Евросиб Каблов 20.05.2025 ( #110106
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 11", ТекстОграниченияПорции);
		//Евросиб Каблов 20.05.2025 )
		
		//Евросиб Шевченко А.В. US 106313 TA 109960 22.05.2025
		Запрос.УстановитьПараметр("УзелБФ", Перечисления.УзлыОбмена.БитФинанс);
		//Евросиб Шевченко А.В. US 106313 TA 109960 22.05.2025
		Запрос.УстановитьПараметр("УзелОбмена", УзелОбмена);
		РезультатЗапросаПакет = Запрос.ВыполнитьПакет();
	
	КонецЕсли; 
	
	Возврат ВыгрузитьРелизыСобственника(РезультатЗапросаПакет, УзелОбмена, НастройкаОбмена);
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, BUG 95529 / TA 95530, 18-11-2024, конец

//Евросиб(ДИТ), Беляев СЮ, BUG 95529 / TA 95530, 18-11-2024, начало
Функция ВыгрузитьРелизыСобственника(РезультатЗапросаПакет, УзелОбмена, НастройкаОбмена)
	
	ВыборкаИзменений = РезультатЗапросаПакет[2].Выбрать();
	ТаблицаКонтейнеров = РезультатЗапросаПакет[3].Выгрузить();
	ТаблицаСНП = РезультатЗапросаПакет[4].Выгрузить();
	
	Если ТаблицаКонтейнеров.Количество()>1000 Тогда
		ТаблицаКонтейнеров.Индексы.Добавить("Ссылка");
	КонецЕсли;
	Если ТаблицаСНП.Количество()>1000 Тогда
		ТаблицаСНП.Индексы.Добавить("Ссылка");
	КонецЕсли;

	РелизСобственникаТип 	= ФабрикаXDTO.Тип("XMLOwnerRelease", "РелизСобственника"); 
	РелизыСобственникаТип 	= ФабрикаXDTO.Тип("XMLOwnerRelease", "РелизыСобственника");
	ЛокацияТип 				= ФабрикаXDTO.Тип("XMLOwnerRelease", "Локация"); 
	СписокЛокацийТип		= ФабрикаXDTO.Тип("XMLOwnerRelease", "СписокЛокаций");
	КонтейнерТип 			= ФабрикаXDTO.Тип("XMLOwnerRelease", "Контейнер"); 
	СписокКонтейнеровТип 	= ФабрикаXDTO.Тип("XMLOwnerRelease", "СписокКонтенеров");
	СНПСтрокаТип 			= ФабрикаXDTO.Тип("XMLOwnerRelease", "СНПСтрока"); 
	СНПСписокТип 			= ФабрикаXDTO.Тип("XMLOwnerRelease", "СНПСписок");
	//Евросиб Шевченко А.В. US 106313 TA 109960 22.05.2025
	ДоговорТип				= ФабрикаXDTO.Тип("XMLOwnerRelease", "Договор");
	//Евросиб Шевченко А.В. US 106313 TA 109960 22.05.2025
	
	Релизы = ФабрикаXDTO.Создать(РелизыСобственникаТип);
	
	ТабОтправки = Новый ТаблицаЗначений;
	ТабОтправки.Колонки.Добавить("ГУИД");  
	ТабОтправки.Колонки.Добавить("РелизСобственника");
	
	//Евросиб Каблов 20.05.2025 ( #110106
	Счетчик = 0;
	ОсталисьДанныеДляВыгрузки = Ложь;
	КоличествоЗаписейВПорцииДанных = НастройкаОбмена.КоличествоЗаписейВПорцииДанных;
	Если ЗначениеЗаполнено(КоличествоЗаписейВПорцииДанных) Тогда
		ОграничиватьПорцию = Истина;
	Иначе
		ОграничиватьПорцию = Ложь;
	КонецЕсли;
	//Евросиб Каблов 20.05.2025 )
	
	Пока ВыборкаИзменений.Следующий() Цикл
		
		//Евросиб Каблов 20.05.2025 ( #110106
		Счетчик = Счетчик + 1;
		Если ОграничиватьПорцию И Счетчик > КоличествоЗаписейВПорцииДанных Тогда
			ОсталисьДанныеДляВыгрузки = Истина;
			Прервать;
		КонецЕсли;
		//Евросиб Каблов 20.05.2025 )
		
		Релиз = ФабрикаXDTO.Создать(РелизСобственникаТип);
		ЗаполнитьЗначенияСвойств(Релиз, ВыборкаИзменений, "Дата, Номер, Проведен, ПометкаУдаления");
		Релиз.ГУИД = Строка(ВыборкаИзменений.ГУИД);
		
		ЛокацияВзятия = ЗаполнитьЛокациюXDTO(ВыборкаИзменений.ЛокацияНаименование, ВыборкаИзменений.ЛокацияТип, ВыборкаИзменений.ЛокацияКод, 
											 ВыборкаИзменений.ЛокацияКодПорта, ВыборкаИзменений.ЛокацияКодЖДСтанции); 
		Релиз.ЛокацияВзятия = ЛокацияВзятия;
		
		//Евросиб Шевченко А.В. US 106313 TA 109960 22.05.2025
		Договор 				= ФабрикаXDTO.Создать(ДоговорТип);
		Договор.ГУИД 			= ВыборкаИзменений.ДоговорГУИД;
		Договор.Наименование 	= ВыборкаИзменений.ДоговорНаименование;
		Релиз.Договор			= Договор;
		//Евросиб Шевченко А.В. US 106313 TA 109960 22.05.2025
		
		СписокЛокацийСдачи = ФабрикаXDTO.Создать(СписокЛокацийТип);
		Если ТипЗнч(ВыборкаИзменений.ЛокацияСдачи) = Тип("СправочникСсылка.Мультилокации") Тогда
		    РезультатЛокацииСдачи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаИзменений.ЛокацияСдачи, "Локации");
			Если РезультатЛокацииСдачи <> Неопределено Тогда //Евросиб(ДИТ), Беляев СЮ, US 86002/TA 89992, 15-08-2024, добавил проверку
				ВыборкаЛокаций = РезультатЛокацииСдачи.Выбрать();
				Пока ВыборкаЛокаций.Следующий() Цикл
					РеквизитыЛокации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВыборкаЛокаций.Локация, 
					"Наименование, Код, Тип, КодПортаUNLOCODE, КодЖДСтанции"); 
					ЛокацияСдачи = ЗаполнитьЛокациюXDTO(РеквизитыЛокации.Наименование, РеквизитыЛокации.Тип, 
					РеквизитыЛокации.Код, РеквизитыЛокации.КодПортаUNLOCODE, РеквизитыЛокации.КодЖДСтанции);
					СписокЛокацийСдачи.ЛокацияСдачи.Добавить(ЛокацияСдачи);
				КонецЦикла;
			КонецЕсли;
		Иначе
			ЛокацияСдачи = ЗаполнитьЛокациюXDTO(ВыборкаИзменений.ЛокацияСдачиНаименование, ВыборкаИзменений.ЛокацияСдачиТип, 
											ВыборкаИзменений.ЛокацияСдачиКод, 
											ВыборкаИзменений.ЛокацияСдачиКодПорта, ВыборкаИзменений.ЛокацияСдачиКодЖДСтанции);
			СписокЛокацийСдачи.ЛокацияСдачи.Добавить(ЛокацияСдачи);
		КонецЕсли; 
		Релиз.ЛокацииСдачи = СписокЛокацийСдачи;  
		
		СписокКонтейнеров = ФабрикаXDTO.Создать(СписокКонтейнеровТип);
		
		ПоискНоминацийРелиза = Новый Структура("Ссылка", ВыборкаИзменений.РелизСобственника);
		СтрокиПоРелизу = ТаблицаКонтейнеров.НайтиСтроки(ПоискНоминацийРелиза);
		Для Каждого ВыборкаКонтейнеры Из СтрокиПоРелизу Цикл
			СтрокаКонтейнеров = ФабрикаXDTO.Создать(КонтейнерТип); 
			ЗаполнитьЗначенияСвойств(СтрокаКонтейнеров, ВыборкаКонтейнеры, "ДатаВзятия, ДатаВозвратаСобственнику, Валюта, НДСВключая, Ставка"); 
			Если ЗначениеЗаполнено(ВыборкаКонтейнеры.Контейнер) Тогда
				РеквизитыКонтенера = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВыборкаКонтейнеры.Контейнер, "Префикс,Номер,КонтрольноеЧисло");
				СтрокаКонтейнеров.НомерКонтейнера = РеквизитыКонтенера.Префикс + РеквизитыКонтенера.Номер + РеквизитыКонтенера.КонтрольноеЧисло;
			Иначе
				СтрокаКонтейнеров.НомерКонтейнера = "";
			КонецЕсли;           
			СтрокаКонтейнеров.ВидСобственности = Строка(ВыборкаКонтейнеры.ВидСобственности);
			СтрокаКонтейнеров.СтавкаНДС = Строка(ВыборкаКонтейнеры.СтавкаНДС);
			ПоискСтроки = Новый Структура("Ссылка, ГУИДСтроки", ВыборкаИзменений.РелизСобственника, ВыборкаКонтейнеры.ГУИДСтроки);
			СтрокиСНП = ТаблицаСНП.НайтиСтроки(ПоискСтроки);
			
			СписокСНП = ФабрикаXDTO.Создать(СНПСписокТип); 
			Для Каждого СтрокаСНП Из СтрокиСНП Цикл
				СНПСтрока = ФабрикаXDTO.Создать(СНПСтрокаТип);
				ЗаполнитьЗначенияСвойств(СНПСтрока, СтрокаСНП);
				СписокСНП.СтрокаСНП.Добавить(СНПСтрока);
			КонецЦикла;  
			СтрокаКонтейнеров.СНП = СписокСНП;  
			СписокКонтейнеров.Контейнер.Добавить(СтрокаКонтейнеров);
		КонецЦикла;
		
		Релиз.Контейнеры = СписокКонтейнеров;
		Релизы.РелизСобственника.Добавить(Релиз);
		
		НС = ТабОтправки.Добавить();
		НС.ГУИД = Строка(ВыборкаИзменений.ГУИД);
		НС.РелизСобственника = ВыборкаИзменений.РелизСобственника;
	КонецЦикла;
	
	//Евросиб Каблов 20.05.2025 ( #110106
	Релизы.ОсталисьДанныеДляВыгрузки = ОсталисьДанныеДляВыгрузки;
	//Евросиб Каблов 20.05.2025 )
	
	ЗаписьXML = Новый ЗаписьXML;
    ЗаписьXML.УстановитьСтроку();
    ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Релизы);
    ТекстОбъектаXDTO = ЗаписьXML.Закрыть(); 
	
	//Фиксируем информацию об отправке
	ВремяВыгрузки = ТекущаяДата();
	Для каждого СтрокаОтправки Из ТабОтправки Цикл
		СтруктураПоиска = Новый Структура("ДействиеПриОбмене, УзелОбмена, Объект", Перечисления.ДействияПриОбмене.ВыгрузкаДанных,УзелОбмена,СтрокаОтправки.РелизСобственника);
		СтруктураДанных = Новый Структура("УИДИсточника, ЗагрузкаПодтверждена, ДатаОбмена",СтрокаОтправки.ГУИД,Ложь,ВремяВыгрузки);
		РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных);
	КонецЦикла;
	
	Возврат ТекстОбъектаXDTO;

КонецФункции
//Евросиб(ДИТ), Беляев СЮ, BUG 95529 / TA 95530, 18-11-2024, конец

//Евросиб(ДИТ), Беляев СЮ, BUG 95529 / TA 95530, 18-11-2024, начало
Функция ЗаполнитьЛокациюXDTO(Наименование, Тип, Код, КодПорта, КодЖДСтанции)
	
	ЛокацияТип = ФабрикаXDTO.Тип("XMLOwnerRelease", "Локация"); 
	
	Локация = ФабрикаXDTO.Создать(ЛокацияТип);
	
	Если СокрЛП(Наименование) <> "" ИЛИ СокрЛП(Тип) <> "" Тогда //Евросиб(ДИТ), Беляев СЮ, US 86002/TA 89992, 15-08-2024, добавил проверку на пустые поля
		Локация.ТипЛокации = Строка(Тип);
		Локация.Наименование = Строка(Наименование);
		Если Тип = Справочники.ТипыЛокаций.Терминал Тогда
			Локация.Код = Строка(Код);
		ИначеЕсли Тип = Справочники.ТипыЛокаций.Порт Тогда 
			Локация.Код = Строка(КодПорта);
		ИначеЕсли Тип = Справочники.ТипыЛокаций.СтанцияЖД Тогда	
			Локация.Код = Строка(КодЖДСтанции);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Локация;

КонецФункции
//Евросиб(ДИТ), Беляев СЮ, BUG 95529 / TA 95530, 18-11-2024, конец

Функция СоздатьРейс(XMLParams) Экспорт
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(XMLParams);
	
	Фабрика = Новый ФабрикаXDTO;
	ОбъектXDTO = Фабрика.ПрочитатьXML(Чтение);
	
	НомерПоезда = 0;
	ПунктОтправления = Справочники.Локации.ПустаяСсылка();
	ПунктНазначения = Справочники.Локации.ПустаяСсылка(); 
	// Евросиб(ДИТ) US 85377 ТА 85380 Сержантова А.С. Начало: 09.07.2024
	// Было:
	//ДатаОтправления = '00010101';
	//ДатаПрибытия = '00010101'; 
	//Стало:
	ДатаОтправленияПлан = '00010101'; 
	ДатаОтправленияФакт = '00010101';
	ДатаОтправленияЖДН = '00010101';
	ДатаПрибытияПлан = '00010101'; 
	ДатаПрибытияФакт = '00010101'; 
	ДатаПрибытияЖДН = '00010101';
	// Евросиб(ДИТ) US 85377 ТА 85380 Сержантова А.С. Конец: 09.07.2024
	
	//ДИТ Шевченко А.В. US 66360 ТА 72965 26.07.2023
	//Сервис = Справочники.Продукты.ПустаяСсылка();
	Сервис = Справочники.СервисыУчетноеНаправление.ПустаяСсылка();
	Примечание = "";
	//Продукт = Справочники.Продукты.ПустаяСсылка();
	УчетноеНаправление = Справочники.СервисыУчетноеНаправление.ПустаяСсылка();
	//ДИТ Шевченко А.В. US 66360 ТА 72965 26.07.2023
	УсловнаяДлинаСостава = 0;
	РейсОтменен = Ложь;
	Автор = Справочники.Пользователи.ПустаяСсылка();
	Клиент = Справочники.Контрагенты.ПустаяСсылка();
	ГУИД_DX = "";
	
	//ДИТ, Беляев СЮ, US 68290 / TA 68860, 21-04-2023, начало
	ТаблицаРеестрКонтейнеров = Новый ТаблицаЗначений;
	ТаблицаФактическийСоставПоезда = Новый ТаблицаЗначений;
	//ДИТ, Беляев СЮ, US 68290 / TA 68860, 21-04-2023, конец
	
	//ДИТ Шевченко А.В. US 66360 ТА 73009 01.08.2023
	ТаблицаРеестрПродуктов = Новый ТаблицаЗначений;
	СхемаПеревозки = Справочники.СхемыПеревозки.ПустаяСсылка();
	ОтрезокСхемыПеревозки = Справочники.ОтрезкиСхемПеревозок.ПустаяСсылка();
	СхемаНаименование = "";
	СхемаКод = "";
	ОтрезокСхемыНаименование = "";
	ОтрезокСхемыКод = "";
	//ДИТ Шевченко А.В. US 66360 ТА 73009 01.08.2023 
	
	//ДИТ Шевченко А.В. US 102893 ТА 111601 11.07.2025
	Перегруз = 0;
	ПредыдущаяОтправка = 0;
	Входящий = 0;
	РеестрКонтейнеровСвязанногоРейса = Новый ТаблицаЗначений;
	//ДИТ Шевченко А.В. US 102893 ТА 111601 11.07.2025
	
	//Субботин 75866 начало 05.10.2023
	ПунктОтправленияКод = "";
	ПунктНазначенияКод = "";
	//Субботин 75866 конец  05.10.2023
	
	//Евросиб Каблов 09.10.2024 ( Ticket#0367291
	НомерЛота = "";
	//Евросиб Каблов 09.10.2024 )
	
	//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 91097, 14-10-2024, начало
	КТК_DX = "";
	ПлановаяВыручка_DX = 0;
	//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 91097, 14-10-2024, конец
	
	//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 93860, 28-11-2024, начало
	Макет = Справочники.РейсыЖД.ПолучитьМакет("СоответствиеРеквизитовИзDX");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.Вывести(Макет);
	
	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабДокумент.Область());
	Построитель.Выполнить();
	ТаблицаДополнительнойИнформации = Построитель.Результат.Выгрузить();
	ТаблицаДополнительнойИнформации.Колонки.Добавить("Значение");
	//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 93860, 28-11-2024, конец
	
	//НайденноеСвойство = ОбъектXDTO.Свойства().Получить("Шапка");
	//Если НайденноеСвойство <> Неопределено Тогда
		//Для Каждого Строка Из ОбъектXDTO.Шапка Цикл
		Для Каждого Строка Из ОбъектXDTO.Свойства() Цикл
			Если Строка.Имя = "НомерПоезда" Тогда
				//НомерПоезда = XMLЗначение(Тип("Число"), Строка.valueParams);
				НомерПоезда = Строка.ОбъектВладелец.НомерПоезда;				
			//ДИТ Шевченко А.В. US 102893 ТА 111601 11.07.2025
			ИначеЕсли Строка.Имя = "Перегруз" Тогда				
				Перегруз = Строка.ОбъектВладелец.Перегруз;				
			ИначеЕсли Строка.Имя = "ПредыдущаяОтправка" Тогда				
				ПредыдущаяОтправка = Строка.ОбъектВладелец.ПредыдущаяОтправка; 				
			ИначеЕсли Строка.Имя = "ВходящийИсходящий" Тогда				
				ВходящийИсходящий = Строка.ОбъектВладелец.ВходящийИсходящий;
			//ДИТ Шевченко А.В. US 102893 ТА 111601 11.07.2025	
			ИначеЕсли Строка.Имя = "ПунктОтправления" Тогда
				//ПунктОтправления = XMLЗначение(Тип("Строка"), Строка.valueParams);
				ПунктОтправления = Строка.ОбъектВладелец.ПунктОтправления;
			ИначеЕсли Строка.Имя = "ПунктНазначения" Тогда
				//ПунктНазначения = XMLЗначение(Тип("Строка"), Строка.valueParams);
				ПунктНазначения = Строка.ОбъектВладелец.ПунктНазначения;   
				// Евросиб(ДИТ) US 85377 ТА 85380 Сержантова А.С. Начало: 08.07.2024
			// Было:
			//ИначеЕсли Строка.Имя = "ДатаОтправления" Тогда
			//	//ДатаОтправления = XMLЗначение(Тип("Дата"), Строка.valueParams);
			//	ДатаОтправления = Строка.ОбъектВладелец.ДатаОтправления;
			//ИначеЕсли Строка.Имя = "ДатаПрибытия" Тогда
			//	//ДатаПрибытия = XMLЗначение(Тип("Дата"), Строка.valueParams);
			//	ДатаПрибытия = Строка.ОбъектВладелец.ДатаПрибытия; 
			//Стало:
			ИначеЕсли Строка.Имя = "ДатаПрибытияПлан" и ЗначениеЗаполнено(Строка.ОбъектВладелец.ДатаПрибытияПлан) Тогда
				ДатаПрибытияПлан = Строка.ОбъектВладелец.ДатаПрибытияПлан;	
			ИначеЕсли Строка.Имя = "ДатаПрибытияФакт" и ЗначениеЗаполнено(Строка.ОбъектВладелец.ДатаПрибытияФакт) Тогда	
				ДатаПрибытияФакт = Строка.ОбъектВладелец.ДатаПрибытияФакт;	
			ИначеЕсли Строка.Имя = "ДатаПрибытияЖДН" и ЗначениеЗаполнено(Строка.ОбъектВладелец.ДатаПрибытияЖДН) Тогда	
				ДатаПрибытияЖДН = Строка.ОбъектВладелец.ДатаПрибытияЖДН;
			ИначеЕсли Строка.Имя = "ДатаОтправленияПлан" и ЗначениеЗаполнено(Строка.ОбъектВладелец.ДатаОтправленияПлан) Тогда
				ДатаОтправленияПлан = Строка.ОбъектВладелец.ДатаОтправленияПлан;
			ИначеЕсли Строка.Имя = "ДатаОтправленияФакт" и ЗначениеЗаполнено(Строка.ОбъектВладелец.ДатаОтправленияФакт) Тогда	
				ДатаОтправленияФакт = Строка.ОбъектВладелец.ДатаОтправленияФакт;
			ИначеЕсли Строка.Имя = "ДатаОтправленияЖДН" и ЗначениеЗаполнено(Строка.ОбъектВладелец.ДатаОтправленияЖДН) Тогда	
				ДатаОтправленияЖДН = Строка.ОбъектВладелец.ДатаОтправленияЖДН;	
			// Евросиб(ДИТ) US 85377 ТА 85380 Сержантова А.С. Конец: 08.07.2024
			ИначеЕсли Строка.Имя = "Сервис" Тогда
				//Сервис = XMLЗначение(Тип("Строка"), Строка.valueParams);
				Сервис = Строка.ОбъектВладелец.Сервис;
			ИначеЕсли Строка.Имя = "Примечание" Тогда
				//Примечание = XMLЗначение(Тип("Строка"), Строка.valueParams);
				Примечание = Строка.ОбъектВладелец.Примечание;
			//ДИТ Шевченко А.В. US 66360 ТА 73009 01.08.2023 -начало
			//ИначеЕсли Строка.Имя = "Продукт" Тогда
			//	//Продукт = XMLЗначение(Тип("Строка"), Строка.valueParams);
			//	Продукт = Строка.ОбъектВладелец.Продукт;
			ИначеЕсли Строка.Имя = "УчетноеНаправление" Тогда
				//Продукт = XMLЗначение(Тип("Строка"), Строка.valueParams);
				УчетноеНаправление = Строка.ОбъектВладелец.УчетноеНаправление;
			//ДИТ Шевченко А.В. US 66360 ТА 73009 01.08.2023 -конец
			ИначеЕсли Строка.Имя = "УсловнаяДлинаСостава" Тогда
				//УсловнаяДлинаСостава = XMLЗначение(Тип("Число"), Строка.valueParams);
				УсловнаяДлинаСостава = Строка.ОбъектВладелец.УсловнаяДлинаСостава;
			ИначеЕсли Строка.Имя = "РейсОтменен" Тогда
				//РейсОтменен = XMLЗначение(Тип("Строка"), Строка.valueParams);
				РейсОтменен = ?(Строка.ОбъектВладелец.РейсОтменен="0",Ложь,Истина);
			ИначеЕсли Строка.Имя = "Автор" Тогда
				//Автор = XMLЗначение(Тип("Строка"), Строка.valueParams);
				Автор = Строка.ОбъектВладелец.Автор;
			ИначеЕсли Строка.Имя = "Клиент" Тогда
				//Клиент = XMLЗначение(Тип("Строка"), Строка.valueParams);
				Клиент = Строка.ОбъектВладелец.Клиент;
				//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 93860, 28-11-2024, начало
				ЗаполнитьЗначениеВТаблицуДополнительнойИнформации(Строка.ОбъектВладелец, Строка, ТаблицаДополнительнойИнформации);
				//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 93860, 28-11-2024, конец
			ИначеЕсли Строка.Имя = "ГУИД_DX" Тогда
				//ГУИД_DX = XMLЗначение(Тип("Строка"), Строка.valueParams);
				ГУИД_DX = Строка.ОбъектВладелец.ГУИД_DX;
			//ДИТ, Беляев СЮ, US 68290 / TA 68860, 21-04-2023, начало
			ИначеЕсли Строка.Имя = "ЛотКонтейнеры" Тогда
				ЛотКонтейнеры = Строка.ОбъектВладелец.ЛотКонтейнеры;
				ЗаполнитьТаблицуРеестрКонтейнеров(ЛотКонтейнеры, ТаблицаРеестрКонтейнеров);
			ИначеЕсли Строка.Имя = "ФактВагоны" Тогда
				ФактВагоны = Строка.ОбъектВладелец.ФактВагоны;
				ЗаполнитьТаблицуФактическийСоставПоезда(ФактВагоны, ТаблицаФактическийСоставПоезда);
			//ДИТ, Беляев СЮ, US 68290 / TA 68860, 21-04-2023, конец
			//ДИТ Шевченко А.В. US 66360 ТА 73009 01.08.2023 -начало
			ИначеЕсли Строка.Имя = "ЛотПродукты" Тогда
				ЛотПродукты = Строка.ОбъектВладелец.ЛотПродукты;
				ЗаполнитьТаблицуРеестрПродуктов(ЛотПродукты, ТаблицаРеестрПродуктов);
			ИначеЕсли Строка.Имя = "CхемаID" Тогда
				//Клиент = XMLЗначение(Тип("Строка"), Строка.valueParams);
				СхемаКод = Строка.ОбъектВладелец.CхемаID;
			ИначеЕсли Строка.Имя = "Cхема" Тогда
				//Клиент = XMLЗначение(Тип("Строка"), Строка.valueParams);
				СхемаНаименование = Строка.ОбъектВладелец.Cхема;
			ИначеЕсли Строка.Имя = "ОтрезокСхемы" Тогда
				//Клиент = XMLЗначение(Тип("Строка"), Строка.valueParams);
				ОтрезокСхемыНаименование = Строка.ОбъектВладелец.ОтрезокСхемы;
			ИначеЕсли Строка.Имя = "ОтрезокСхемыID" Тогда
				//Клиент = XMLЗначение(Тип("Строка"), Строка.valueParams);
				ОтрезокСхемыКод = Строка.ОбъектВладелец.ОтрезокСхемыID;
			//ДИТ Шевченко А.В. US 66360 ТА 73009 01.08.2023 -конец	
			
			//Субботин 75866 05.10.2023 начало
			ИначеЕсли Строка.Имя = "ПунктОтправленияКод" Тогда
				ПунктОтправленияКод = Строка.ОбъектВладелец.ПунктОтправленияКод;
			ИначеЕсли Строка.Имя = "ПунктНазначенияКод" Тогда
				ПунктНазначенияКод = Строка.ОбъектВладелец.ПунктНазначенияКод;
			//Субботин 75866 05.10.2023 конец
			
			//Евросиб Каблов 09.10.2024 ( Ticket#0367291
			ИначеЕсли Строка.Имя = "НомерЛота" Тогда
				НомерЛота = Строка.ОбъектВладелец.НомерЛота;
			//Евросиб Каблов 09.10.2024 )
			
			//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 91097, 14-10-2024, начало
			ИначеЕсли Строка.Имя = "КТК" Тогда
				КТК_DX = Строка.ОбъектВладелец.КТК;
			ИначеЕсли Строка.Имя = "ПлановаяВыручка" Тогда
				ПлановаяВыручка_DX = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Строка.ОбъектВладелец.ПлановаяВыручка);
			//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 91097, 14-10-2024, конец
			
			//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 93860, 28-11-2024, начало
		 	ИначеЕсли Строка.Имя = "Маршрут" 
			 			ИЛИ Строка.Имя = "Даты"
						ИЛИ Строка.Имя = "ВагоныКТК"
						ИЛИ Строка.Имя = "ОтменаПеренос"
						ИЛИ Строка.Имя = "ПринадлежностьСхеме" Тогда
				ТекущийВладелец = Строка.ОбъектВладелец.Получить(Строка);
				Для Каждого ТекущееСвойство Из ТекущийВладелец.Свойства() Цикл
					ЗаполнитьЗначениеВТаблицуДополнительнойИнформации(ТекущийВладелец, ТекущееСвойство, ТаблицаДополнительнойИнформации);
					//некоторые поля из ШАПКИ перетащили в МАРШРУТ (старый код тоже оставляем, для совместимости при асинхронном обновлении)
					Если ТекущееСвойство.Имя = "ПунктОтправленияКод" Тогда
						ПунктОтправленияКод = ТекущееСвойство.ОбъектВладелец.ПунктОтправленияКод;
					ИначеЕсли ТекущееСвойство.Имя = "ПунктНазначенияКод" Тогда
						ПунктНазначенияКод = ТекущееСвойство.ОбъектВладелец.ПунктНазначенияКод;
					//некоторые поля из ШАПКИ перетащили в ДАТЫ (старый код тоже оставляем, для совместимости при асинхронном обновлении)
					ИначеЕсли ТекущееСвойство.Имя = "ДатаОтправленияФакт" И ЗначениеЗаполнено(ТекущееСвойство.ОбъектВладелец.ДатаОтправленияФакт) Тогда
						ДатаОтправленияФакт = ТекущееСвойство.ОбъектВладелец.ДатаОтправленияФакт;
					ИначеЕсли ТекущееСвойство.Имя = "ДатаПрибытияФакт" И ЗначениеЗаполнено(ТекущееСвойство.ОбъектВладелец.ДатаПрибытияФакт) Тогда
						ДатаПрибытияФакт = ТекущееСвойство.ОбъектВладелец.ДатаПрибытияФакт;
					ИначеЕсли ТекущееСвойство.Имя = "ДатаОтправленияПлан" И ЗначениеЗаполнено(ТекущееСвойство.ОбъектВладелец.ДатаОтправленияПлан) Тогда
						ДатаОтправленияПлан = ТекущееСвойство.ОбъектВладелец.ДатаОтправленияПлан;
					ИначеЕсли ТекущееСвойство.Имя = "ДатаПрибытияПлан" И ЗначениеЗаполнено(ТекущееСвойство.ОбъектВладелец.ДатаПрибытияПлан) Тогда
						ДатаПрибытияПлан = ТекущееСвойство.ОбъектВладелец.ДатаПрибытияПлан;
					ИначеЕсли ТекущееСвойство.Имя = "ДатаОтправленияЖДН" И ЗначениеЗаполнено(ТекущееСвойство.ОбъектВладелец.ДатаОтправленияЖДН) Тогда
						ДатаОтправленияЖДН = ТекущееСвойство.ОбъектВладелец.ДатаОтправленияЖДН;
					ИначеЕсли ТекущееСвойство.Имя = "ДатаПрибытияЖДН" И ЗначениеЗаполнено(ТекущееСвойство.ОбъектВладелец.ДатаПрибытияЖДН) Тогда
						ДатаПрибытияЖДН = ТекущееСвойство.ОбъектВладелец.ДатаПрибытияЖДН;
					//некоторые поля из ШАПКИ перетащили в ВагоныКТК (старый код тоже оставляем, для совместимости при асинхронном обновлении)
					ИначеЕсли ТекущееСвойство.Имя = "УсловнаяДлинаСостава" Тогда
						УсловнаяДлинаСостава = ТекущееСвойство.ОбъектВладелец.УсловнаяДлинаСостава;
					//некоторые поля из ШАПКИ перетащили в ОтменаПеренос (старый код тоже оставляем, для совместимости при асинхронном обновлении)
					ИначеЕсли ТекущееСвойство.Имя = "РейсОтменен" Тогда
						РейсОтменен = ТекущееСвойство.ОбъектВладелец.РейсОтменен;
					//некоторые поля из ШАПКИ перетащили в ПринадлежностьСхеме (старый код тоже оставляем, для совместимости при асинхронном обновлении)
					ИначеЕсли ТекущееСвойство.Имя = "CхемаID" Тогда
						СхемаКод = ТекущееСвойство.ОбъектВладелец.CхемаID;
					ИначеЕсли ТекущееСвойство.Имя = "Cхема" Тогда
						СхемаНаименование = ТекущееСвойство.ОбъектВладелец.Cхема;
					ИначеЕсли ТекущееСвойство.Имя = "ОтрезокСхемы" Тогда
						ОтрезокСхемыНаименование = ТекущееСвойство.ОбъектВладелец.ОтрезокСхемы;
					ИначеЕсли ТекущееСвойство.Имя = "ОтрезокСхемыID" Тогда
						ОтрезокСхемыКод = ТекущееСвойство.ОбъектВладелец.ОтрезокСхемыID;
					КонецЕсли;
				КонецЦикла;
			ИначеЕсли Строка.Имя = "Менеджеры" Тогда
				Менеджеры = Строка.ОбъектВладелец.Менеджеры;
				ЗаполнитьМенеджеров(Менеджеры, ТаблицаДополнительнойИнформации);
			Иначе
				ЗаполнитьЗначениеВТаблицуДополнительнойИнформации(Строка.ОбъектВладелец, Строка, ТаблицаДополнительнойИнформации);
			//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 93860, 28-11-2024, конец
			КонецЕсли;
		КонецЦикла;
	//КонецЕсли;
	//Строка = ОбъектXDTO.Свойства()[0];
	//НомерПоезда = Строка.ОбъектВладелец.НомерПоезда;
	//ПунктОтправления = Строка.ОбъектВладелец.ПунктОтправления;
	//ПунктНазначения = Строка.ОбъектВладелец.ПунктНазначения;
	//ДатаОтправления = Строка.ОбъектВладелец.ДатаОтправления;
	//ДатаПрибытия = Строка.ОбъектВладелец.ДатаПрибытия;
	//Сервис = Строка.ОбъектВладелец.Сервис;
	//Примечание = Строка.ОбъектВладелец.Примечание;
	//Продукт = Строка.ОбъектВладелец.Продукт;
	//УсловнаяДлинаСостава = Строка.ОбъектВладелец.УсловнаяДлинаСостава;
	//РейсОтменен = Строка.ОбъектВладелец.РейсОтменен;
	//Автор = Строка.ОбъектВладелец.Автор;
	//Клиент = Строка.ОбъектВладелец.Клиент;
	//ГУИД_DX = Строка.ОбъектВладелец.ГУИД_DX;
	
	//Евросиб Шевченко А.В. US 106592 TA 107941 19.05.2025
	СтруктураОтвета = Новый Структура("Сообщение, ГУИД, КодРейса", "", "", "");
	//Евросиб Шевченко А.В. US 106592 TA 107941 19.05.2025
	
	Попытка
		//Евросиб Каблов 09.10.2024 ( Ticket#0367291		
		//Если ЗначениеЗаполнено(ГУИД_DX) Тогда
		//	ЗапросРейса = Новый Запрос;
		//	ЗапросРейса.Текст = 
		//		"ВЫБРАТЬ
		//		|	РейсыЖД.Ссылка КАК Ссылка
		//		|ИЗ
		//		|	Справочник.РейсыЖД КАК РейсыЖД
		//		|ГДЕ
		//		|	РейсыЖД.ГУИД_DX = &ГУИД_DX";
		//	ЗапросРейса.УстановитьПараметр("ГУИД_DX", ГУИД_DX);			
		//	РезультатЗапроса = ЗапросРейса.Выполнить().Выбрать();

		//	Если РезультатЗапроса.Следующий() Тогда
		//		РейсОбъект = РезультатЗапроса.Ссылка.ПолучитьОбъект();
		//	Иначе
		//		РейсОбъект = Справочники.РейсыЖД.СоздатьЭлемент();
		//		РейсОбъект.КП = Истина;
		//		РейсОбъект.ТребуютсяВагоныЕС = Истина;
		//	КонецЕсли;
		//Иначе
		//	РейсОбъект = Справочники.РейсыЖД.СоздатьЭлемент();
		//	РейсОбъект.КП = Истина;
		//	РейсОбъект.ТребуютсяВагоныЕС = Истина;
		//КонецЕсли;
		
		Если ЗначениеЗаполнено(ГУИД_DX) Тогда
			ТипыДокументов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Тип("СправочникСсылка.РейсыЖД"));
			СсылкаПоУИД = РегистрыСведений.ПротоколОбменов.СсылкаПоУИД(ГУИД_DX, Перечисления.ДействияПриОбмене.ЗагрузкаДанных, Перечисления.УзлыОбмена.DX, ТипыДокументов);
		Иначе
			СсылкаПоУИД = Неопределено;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СсылкаПоУИД) Тогда
			РейсОбъект = СсылкаПоУИД.ПолучитьОбъект();
			ЭтоНовый = Ложь;
		Иначе
			РейсОбъект = Справочники.РейсыЖД.СоздатьЭлемент();
			РейсОбъект.КП = Истина;
			РейсОбъект.ТребуютсяВагоныЕС = Истина;
			ЭтоНовый = Истина;
		КонецЕсли;
		//Евросиб Каблов 09.10.2024 )
		
		РейсОбъект.НомерПоезда = НомерПоезда; 
		//Субботин 75866 05.10.2023 начало
		//РейсОбъект.ПунктОтправления = Справочники.Локации.НайтиПоНаименованию((ПунктОтправления);
		//РейсОбъект.ПунктНазначения = Справочники.Локации.НайтиПоНаименованию((ПунктНазначения); 
		Если ЗначениеЗаполнено(ПунктОтправленияКод) тогда 
			РейсОбъект.ПунктОтправления = Справочники.Локации.НайтиПоРеквизиту("КодЖДСтанции", ПунктОтправленияКод);
		КонецЕсли; 
		Если ЗначениеЗаполнено(ПунктНазначенияКод) тогда
			РейсОбъект.ПунктНазначения = Справочники.Локации.НайтиПоРеквизиту("КодЖДСтанции", ПунктНазначенияКод);
		КонецЕсли;
		//Субботин 75866 05.10.2023 Конец
		Попытка
			//ДИТ Шевченко А.В. US 66360 ТА 72965 26.07.2023
			//РейсОбъект.Сервис = Справочники.Продукты.НайтиПоКоду(Продукт).Родитель;
			РейсОбъект.Сервис = Справочники.СервисыУчетноеНаправление.НайтиПоКоду(УчетноеНаправление).Родитель;
			//ДИТ Шевченко А.В. US 66360 ТА 72965 26.07.2023
		Исключение
		КонецПопытки;
		Если НЕ ЗначениеЗаполнено(РейсОбъект.Сервис) Тогда
			//ДИТ Шевченко А.В. US 66360 ТА 72965 26.07.2023
			//РейсОбъект.Сервис = Справочники.Продукты.НайтиПоКоду(Продукт);
			РейсОбъект.Сервис = Справочники.СервисыУчетноеНаправление.НайтиПоКоду(УчетноеНаправление);
			//ДИТ Шевченко А.В. US 66360 ТА 72965 26.07.2023
		КонецЕсли;
		//ДИТ Шевченко А.В. US 66360 ТА 72965 26.07.2023 -начало
		//РейсОбъект.Продукт = Справочники.Продукты.НайтиПоКоду(Продукт);
		РейсОбъект.Продукт = Справочники.СервисыУчетноеНаправление.НайтиПоКоду(УчетноеНаправление);
		//ДИТ Шевченко А.В. US 66360 ТА 72965 26.07.2023 -конец
		//ДИТ Шевченко А.В. US 66360 ТА 73009 01.08.2023 -начало
		Если ТаблицаРеестрПродуктов.Количество() = 1 Тогда
			РейсОбъект.ПродуктДКП = Справочники.ПродуктыДКП.НайтиПоКоду(СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ТаблицаРеестрПродуктов[0].ПродуктID, 9,,));
		КонецЕсли;
		                                                        
		СхемаПеревозки = Справочники.СхемыПеревозки.НайтиПоКоду(СтроковыеФункцииКлиентСервер.ДополнитьСтроку(СхемаКод, 9,,));
		Если СхемаПеревозки = Справочники.СхемыПеревозки.ПустаяСсылка() И ЗначениеЗаполнено(СхемаКод) Тогда
			СхемаПеревозкиОб = СПравочники.СхемыПеревозки.СоздатьЭлемент();
			СхемаПеревозкиОб.Наименование = СхемаНаименование;
			СхемаПеревозкиОб.Код = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(СхемаКод, 9,,);
			СхемаПеревозкиОб.Записать();
			СхемаПеревозки = СхемаПеревозкиОб.Ссылка;
		КонецЕсли;
		РейсОбъект.СхемаПеревозки = СхемаПеревозки;
		ОтрезокСхемыПеревозки = Справочники.ОтрезкиСхемПеревозок.НайтиПоКоду(СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ОтрезокСхемыКод, 9,,));
		Если ОтрезокСхемыПеревозки = Справочники.ОтрезкиСхемПеревозок.ПустаяСсылка() И ЗначениеЗаполнено(ОтрезокСхемыКод) Тогда
			ОтрезокСхемыПеревозкиОб = Справочники.ОтрезкиСхемПеревозок.СоздатьЭлемент();
			ОтрезокСхемыПеревозкиОб.Наименование = ОтрезокСхемыНаименование;
			ОтрезокСхемыПеревозкиОб.Код = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ОтрезокСхемыКод, 9,,);
			ОтрезокСхемыПеревозкиОб.Схема = РейсОбъект.СхемаПеревозки;
			ОтрезокСхемыПеревозкиОб.Записать();
			ОтрезокСхемыПеревозки = ОтрезокСхемыПеревозкиОб.Ссылка;
		КонецЕсли;
		РейсОбъект.ОтрезокСхемыПеревозки = ОтрезокСхемыПеревозки;
		//ДИТ Шевченко А.В. US 66360 ТА 73009 01.08.2023 -конец
		
		РейсОбъект.Автор = Справочники.Пользователи.НайтиПоНаименованию(Автор); 
		// Евросиб(ДИТ) US 85377 ТА 85380 Сержантова А.С. Начало: 08.07.2024
		// Было:
		//РейсОбъект.ДатаПрибытия = Дата(ДатаПрибытия);
		//РейсОбъект.ДатаОтправления = Дата(ДатаОтправления); 
		//Стало:
		//Евросиб Каблов 27.01.2026 ( #126739
		//РейсОбъект.ДатаПрибытия = Дата(ДатаПрибытияПлан); 
		//РейсОбъект.ДатаПрибытияФакт = Дата(ДатаПрибытияФакт);
		//РейсОбъект.ФактическаяДатаПрибытияПоЖДН = Дата(ДатаПрибытияЖДН);
		//РейсОбъект.ДатаОтправления = Дата(ДатаОтправленияПлан); 
		//РейсОбъект.ДатаОтправленияФакт = Дата(ДатаОтправленияФакт);
		//РейсОбъект.ФактическаяДатаОтправленияПоЖДН = Дата(ДатаОтправленияЖДН);
		Если ЗначениеЗаполнено(Дата(ДатаПрибытияПлан)) Тогда
			РейсОбъект.ДатаПрибытия = Дата(ДатаПрибытияПлан);
		КонецЕсли;
		Если ЗначениеЗаполнено(Дата(ДатаПрибытияФакт)) Тогда
			РейсОбъект.ДатаПрибытияФакт = Дата(ДатаПрибытияФакт);
		КонецЕсли;
		Если ЗначениеЗаполнено(Дата(ДатаПрибытияЖДН)) Тогда
			РейсОбъект.ФактическаяДатаПрибытияПоЖДН = Дата(ДатаПрибытияЖДН);
		КонецЕсли;
		Если ЗначениеЗаполнено(Дата(ДатаОтправленияПлан)) Тогда
			РейсОбъект.ДатаОтправления = Дата(ДатаОтправленияПлан);
		КонецЕсли;
		Если ЗначениеЗаполнено(Дата(ДатаОтправленияФакт)) Тогда
			РейсОбъект.ДатаОтправленияФакт = Дата(ДатаОтправленияФакт);
		КонецЕсли;
		Если ЗначениеЗаполнено(Дата(ДатаОтправленияЖДН)) Тогда
			РейсОбъект.ФактическаяДатаОтправленияПоЖДН = Дата(ДатаОтправленияЖДН);
		КонецЕсли;
		//Евросиб Каблов 27.01.2026 ) #126739
		// Евросиб(ДИТ) US 85377 ТА 85380 Сержантова А.С. Конец: 08.07.2024
		РейсОбъект.РейсОтменен = РейсОтменен;
		РейсОбъект.Примечание = Примечание;
		РейсОбъект.УсловнаяДлинаСостава = УсловнаяДлинаСостава;
		
		//ДИТ Шевченко А.В. US 102893 ТА 111601 11.07.2025
		РейсОбъект.Перегруз = ?(Перегруз = "1", Истина, Ложь);
		РейсОбъект.Входящий = ?(ВходящийИсходящий = "Входящий", Истина, Ложь);
		РейсОбъект.СвязанныйРейс = Справочники.РейсыЖД.НайтиПоРеквизиту("ЛотDX", ПредыдущаяОтправка);
		
		Если РейсОбъект.Входящий И ЗначениеЗаполнено(РейсОбъект.СвязанныйРейс) Тогда
			
			 РеестрКонтейнеровСвязанногоРейса = РейсОбъект.СвязанныйРейс.РеестрКонтейнеров.Выгрузить();
			
		КонецЕсли;	
		
		//ДИТ Шевченко А.В. US 102893 ТА 111601 11.07.2025
		
		//ДИТ, Беляев СЮ, US 68290 / TA 68860, 21-04-2023, начало
		РейсОбъект.РеестрКонтейнеров.Очистить();
		Для Каждого строкаТаблицыРеестрКонтейнеров Из ТаблицаРеестрКонтейнеров Цикл
			новСтрРеестрКонтейнеров = РейсОбъект.РеестрКонтейнеров.Добавить();
			ЗаполнитьЗначенияСвойств(новСтрРеестрКонтейнеров,строкаТаблицыРеестрКонтейнеров);
			новСтрРеестрКонтейнеров.ЧужойСервис = ?(строкаТаблицыРеестрКонтейнеров.ЧужойСервис = "1", Истина, Ложь);
			//ДИТ Шевченко А.В. US 102893 ТА 111601 11.07.2025
			новСтрРеестрКонтейнеров.ФиксированныйФакт = ?(строкаТаблицыРеестрКонтейнеров.ФиксированныйФакт = "1", Истина, Ложь);	
			//ДИТ Шевченко А.В. US 102893 ТА 111601 11.07.2025			
		КонецЦикла;
		
		//ДИТ Шевченко А.В. US 102893 ТА 111601 11.07.2025
		Для Каждого СтрокаРеестраСвязонного Из РеестрКонтейнеровСвязанногоРейса Цикл
			ПоискПоКТК = Новый Структура("НомерКонтейнера",СтрокаРеестраСвязонного.НомерКонтейнера);
			НайденныеСтроки = РейсОбъект.РеестрКонтейнеров.НайтиСтроки(ПоискПоКТК);
			Для Каждого НСтрока Из НайденныеСтроки Цикл
				НСтрока.ВагонПослеПерегруза = СтрокаРеестраСвязонного.НомерВагона;
			КонецЦикла;	
		КонецЦикла;
		//ДИТ Шевченко А.В. US 102893 ТА 111601 11.07.2025
		
		РейсОбъект.ФактическийСоставПоезда.Очистить();
		Для Каждого строкаТаблицыФактическийСоставПоезда Из ТаблицаФактическийСоставПоезда Цикл
			новСтрФактическийСоставПоезда = РейсОбъект.ФактическийСоставПоезда.Добавить();
			ЗаполнитьЗначенияСвойств(новСтрФактическийСоставПоезда,строкаТаблицыФактическийСоставПоезда);
		КонецЦикла;
		//ДИТ, Беляев СЮ, US 68290 / TA 68860, 21-04-2023, конец
		
		//Евросиб Каблов 09.10.2024 ( Ticket#0367291
		РейсОбъект.ЛотDX = НомерЛота;
		//Евросиб Каблов 09.10.2024 )
		
		//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 91097, 14-10-2024, начало
		РейсОбъект.КТК_DX = КТК_DX;
		РейсОбъект.ПлановаяВыручка_DX = ПлановаяВыручка_DX;
		//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 91097, 14-10-2024, конец
		
		//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 93860, 28-11-2024, начало
		СтруктураРеквизитов = Новый Структура;
		Для Каждого текРеквизит Из ТаблицаДополнительнойИнформации  Цикл
			СтруктураРеквизитов.Вставить(текРеквизит.ИмяРеквизитаРейса, текРеквизит.Значение);
		КонецЦикла;
		ЗаполнитьЗначенияСвойств(РейсОбъект, СтруктураРеквизитов);
		Если РейсОбъект.КТК_DX = 0 Тогда
			РейсОбъект.КТК_DX = РейсОбъект.SOC20План_DX + РейсОбъект.СOC20План_DX + РейсОбъект.SOC40План_DX +РейсОбъект. СOC40План_DX;
		КонецЕсли;
		РейсОбъект.Клиент_DX = Справочники.Контрагенты.НайтиПоКоду(Клиент);
		//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 93860, 28-11-2024, конец
		
		//ТрундуковСА 113370 30.06.2025 Начало
		РейсОбъект.РейсОтменен = РейсОбъект.Статус_DX = "Отменён";
		//ТрундуковСА 113370 30.06.2025 Конец
		
		//Евросиб Каблов 27.01.2026 ( #126739
		Если РейсОбъект.РейсОтменен И Не РейсОбъект.ПометкаУдаления Тогда
			РейсОбъект.ПометкаУдаления = Истина;
		ИначеЕсли Не РейсОбъект.РейсОтменен И РейсОбъект.ПометкаУдаления Тогда
			РейсОбъект.ПометкаУдаления = Ложь;
		КонецЕсли;
		//Евросиб Каблов 27.01.2026 ) #126739

		РейсОбъект.Записать();
		
		Ссылка = РейсОбъект.Ссылка;
		//ДИТ Шевченко А.В. US 102893 ТА 111601 11.07.2025
		Если ЗначениеЗаполнено(РейсОбъект.СвязанныйРейс) Тогда
			обСвязанныйРейс = РейсОбъект.СвязанныйРейс.ПолучитьОбъект();
			обСвязанныйРейс.СвязанныйРейс = Ссылка;
			обСвязанныйРейс.ОбменДанными.Загрузка = Истина;
			обСвязанныйРейс.Записать();
		КонецЕсли;	
		//ДИТ Шевченко А.В. US 102893 ТА 111601 11.07.2025
		//Евросиб Каблов 09.10.2024 ( Ticket#0367291
		//СтруктураОтвета.ГУИД = Ссылка.УникальныйИдентификатор();		
		//
		//РейсОбъект.ГУИД_DX = ?(ЗначениеЗаполнено(ГУИД_DX),ГУИД_DX,Ссылка.УникальныйИдентификатор());
		//РейсОбъект.Записать();
		Если ЭтоНовый Тогда
			ГУИД_DX = Строка(Ссылка.УникальныйИдентификатор());		
			РегистрыСведений.ПротоколОбменов.ЗаписатьУИДИсточника(ГУИД_DX, Перечисления.ДействияПриОбмене.ЗагрузкаДанных, Перечисления.УзлыОбмена.DX, РейсОбъект.Ссылка);
		КонецЕсли;
		
		СтруктураОтвета.ГУИД = ГУИД_DX;
		//Евросиб Каблов 09.10.2024 )
		
		//Евросиб Шевченко А.В. US 106592 TA 107941 19.05.2025
		СтруктураОтвета.КодРейса = Ссылка.Код;
		//Евросиб Шевченко А.В. US 106592 TA 107941 19.05.2025
		
		НаборЗаписей = РегистрыСведений.РеестрПримечанийКЖДОтправкам.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Отправка.Установить(Ссылка);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Отправка = Ссылка;
			НоваяЗапись.Примечание = "";
			//НоваяЗапись.РаспознанныйКлиент = Справочники.Контрагенты.НайтиПоНаименованию(Клиент);
			//НоваяЗапись.РаспознанныйКлиент = Справочники.Контрагенты.НайтиПоКоду(Клиент);
			//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 93860, 28-11-2024, начало
			НоваяЗапись.РаспознанныйКлиент = РейсОбъект.Клиент_DX;
			//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 93860, 28-11-2024, начало
		ИначеЕсли НаборЗаписей.Количество() = 1 Тогда
			НоваяЗапись = НаборЗаписей[0];
			//НоваяЗапись.РаспознанныйКлиент = Справочники.Контрагенты.НайтиПоНаименованию(Клиент);
			//НоваяЗапись.РаспознанныйКлиент = Справочники.Контрагенты.НайтиПоКоду(Клиент);
			//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 93860, 28-11-2024, начало
			НоваяЗапись.РаспознанныйКлиент = РейсОбъект.Клиент_DX;
			//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 93860, 28-11-2024, начало
		КонецЕсли;
		НаборЗаписей.Записать();
		
	Исключение
		СтруктураОтвета.Сообщение = ОписаниеОшибки();
	КонецПопытки;
	
	//Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(СтруктураОтвета);
	//Евросиб Шевченко А.В. US 106592 TA 107941 19.05.2025
	Возврат "<Property name=""Сообщение"">"+СтруктураОтвета.Сообщение+"</Property><Property name=""ГУИД"">"+СтруктураОтвета.ГУИД+"</Property><Property name=""КодРейса"">"+СтруктураОтвета.КодРейса+"</Property>";
	//Евросиб Шевченко А.В. US 106592 TA 107941 19.05.2025
КонецФункции

//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 93860, 28-11-2024, начало
Процедура ЗаполнитьЗначениеВТаблицуДополнительнойИнформации(Знач ОбъектВладелец, Свойство, Знач ТаблицаДополнительнойИнформации)
	
	Перем СтрокаТаблицыСоответствия;
	
	СтрокаТаблицыСоответствия = ТаблицаДополнительнойИнформации.Найти(Свойство.Имя, "ИмяВФайле");
	Если СтрокаТаблицыСоответствия <> Неопределено Тогда
		СтрокаТаблицыСоответствия.Значение = ОбъектВладелец.Получить(Свойство);
	КонецЕсли;

КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 93860, 28-11-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 93860, 28-11-2024, начало
Процедура ЗаполнитьМенеджеров(Менеджеры, ТаблицаДополнительнойИнформации)
	Если Менеджеры.Свойства().Получить("Менеджер") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//ЗаполнитьЗначениеВТаблицу(ТекущийВладелец, ТекущееСвойство, ТаблицаДополнительнойИнформации);
	Если ТипЗнч(Менеджеры.Менеджер) = Тип("СписокXDTO") Тогда
		Для Каждого Элемент Из Менеджеры.Менеджер Цикл
			ИмяПоискаМенеджера = "Менеджер"+Элемент.Тип;
			СтрокаТаблицыСоответствия = ТаблицаДополнительнойИнформации.Найти(ИмяПоискаМенеджера, "ИмяВФайле");
			Если СтрокаТаблицыСоответствия <> Неопределено Тогда
				СтрокаТаблицыСоответствия.Значение = Элемент.ФИО;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(Менеджеры.Менеджер) = Тип("ОбъектXDTO") Тогда
		ИмяПоискаМенеджера = "Менеджер"+Менеджеры.Менеджер.Тип;
		СтрокаТаблицыСоответствия = ТаблицаДополнительнойИнформации.Найти(ИмяПоискаМенеджера, "ИмяВФайле");
		Если СтрокаТаблицыСоответствия <> Неопределено Тогда
			СтрокаТаблицыСоответствия.Значение = Менеджеры.Менеджер.ФИО;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 87368 / TA 93860, 28-11-2024, конец

//ДИТ, Беляев СЮ, US 68290 / TA 68860, 21-04-2023, начало
Процедура ЗаполнитьТаблицуФактическийСоставПоезда(ФактВагоны, ТаблицаФактическийСоставПоезда)
	Если ФактВагоны.Свойства().Получить("Вагон") = Неопределено Тогда
		Возврат;
	КонецЕсли; 	
	ТаблицаФактическийСоставПоезда = Новый ТаблицаЗначений;
	ТаблицаФактическийСоставПоезда.Колонки.Добавить("НомерКонтейнера");
	ТаблицаФактическийСоставПоезда.Колонки.Добавить("НомерНакладной");
	ТаблицаФактическийСоставПоезда.Колонки.Добавить("НомерЗаписиМакета");
	ТаблицаФактическийСоставПоезда.Колонки.Добавить("ТипКонтейнера");
	ТаблицаФактическийСоставПоезда.Колонки.Добавить("НомерВагона");
	ТаблицаФактическийСоставПоезда.Колонки.Добавить("Статус");
	
	Если ТипЗнч(ФактВагоны.Вагон) = Тип("СписокXDTO") Тогда				
		Для Каждого Элемент Из ФактВагоны.Вагон Цикл
			стрТаблицыФактическийСоставПоезда = ТаблицаФактическийСоставПоезда.Добавить();	
			ЗаполнитьЗначенияСвойств(стрТаблицыФактическийСоставПоезда, Элемент);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ФактВагоны.Вагон) = Тип("ОбъектXDTO") Тогда
		стрТаблицыФактическийСоставПоезда = ТаблицаФактическийСоставПоезда.Добавить();	
		ЗаполнитьЗначенияСвойств(стрТаблицыФактическийСоставПоезда, ФактВагоны.Вагон);
	КонецЕсли;
КонецПроцедуры
//ДИТ, Беляев СЮ, US 68290 / TA 68860, 21-04-2023, конец

//ДИТ, Беляев СЮ, US 68290 / TA 68860, 21-04-2023, начало
Процедура ЗаполнитьТаблицуРеестрКонтейнеров(ЛотКонтейнеры, ТаблицаРеестрКонтейнеров)
	Если ЛотКонтейнеры.Свойства().Получить("Контейнер") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТаблицаРеестрКонтейнеров = Новый ТаблицаЗначений;
	ТаблицаРеестрКонтейнеров.Колонки.Добавить("НомерКонтейнера");
	ТаблицаРеестрКонтейнеров.Колонки.Добавить("ЧужойСервис");
	//ДИТ Шевченко А.В. US 102893 ТА 111601 11.07.2025
	ТаблицаРеестрКонтейнеров.Колонки.Добавить("НомерВагона");
	ТаблицаРеестрКонтейнеров.Колонки.Добавить("ФиксированныйФакт");
	ТаблицаРеестрКонтейнеров.Колонки.Добавить("ВагонПослеПерегруза");
	//ДИТ Шевченко А.В. US 102893 ТА 111601 11.07.2025
	
	Если ТипЗнч(ЛотКонтейнеры.Контейнер) = Тип("СписокXDTO") Тогда				
		Для Каждого Элемент Из ЛотКонтейнеры.Контейнер Цикл
			стрТаблицыРеестрКонтейнеров = ТаблицаРеестрКонтейнеров.Добавить();	
			ЗаполнитьЗначенияСвойств(стрТаблицыРеестрКонтейнеров, Элемент);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ЛотКонтейнеры.Контейнер) = Тип("ОбъектXDTO") Тогда
		стрТаблицыРеестрКонтейнеров = ТаблицаРеестрКонтейнеров.Добавить();	
		ЗаполнитьЗначенияСвойств(стрТаблицыРеестрКонтейнеров, ЛотКонтейнеры.Контейнер);		
	КонецЕсли;
КонецПроцедуры
//ДИТ, Беляев СЮ, US 68290 / TA 68860, 21-04-2023, конец

Процедура ЗаполнитьТаблицуРеестрПродуктов(ЛотПродукты, ТаблицаРеестрПродуктов) //ДИТ Шевченко А.В. US 66360 ТА 73009 01.08.2023
	Если ЛотПродукты.Свойства().Получить("Продукт") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТаблицаРеестрПродуктов = Новый ТаблицаЗначений;
	ТаблицаРеестрПродуктов.Колонки.Добавить("ПродуктID");
	ТаблицаРеестрПродуктов.Колонки.Добавить("Продукт");
	
	Если ТипЗнч(ЛотПродукты.Продукт) = Тип("СписокXDTO") Тогда				
		Возврат
	ИначеЕсли ТипЗнч(ЛотПродукты.Продукт) = Тип("ОбъектXDTO") Тогда
		ТаблицаРеестрПродуктовСтрока = ТаблицаРеестрПродуктов.Добавить();	
		ЗаполнитьЗначенияСвойств(ТаблицаРеестрПродуктовСтрока, ЛотПродукты.Продукт);		
	КонецЕсли;
КонецПроцедуры

//Евросиб Каблов 30.01.2025 #100571
Функция ПолучитьТарифы(ИмяУзла, ДатаНачала, ДатаОкончания) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИмяУзла) Тогда
		Возврат "<xml><error>Пустое значение параметра RequestingSystem!</error></xml>";
	КонецЕсли;  
	
	УзелОбмена = Неопределено;
	Для каждого ЗначПеречисления Из Метаданные.Перечисления.УзлыОбмена.ЗначенияПеречисления Цикл
		Если ЗначПеречисления.Имя = ИмяУзла Тогда
			УзелОбмена = Перечисления.УзлыОбмена[ЗначПеречисления.Имя];  
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	Если УзелОбмена = Неопределено Тогда
		Возврат "<xml><error>Не найден узел обмена по входному параметру RequestingSystem!</error></xml>";
	КонецЕсли;
	
	//Евросиб Каблов 20.05.2025 ( #110106 
	//Евросиб СубботинВ #131884 02.03.2026 Начало
	Если УзелОбмена = Перечисления.УзлыОбмена.BI ТОгда
		НастройкаОбмена = Справочники.НастройкиОбменов.ПолучитьНастройкуОбмена(УзелОбмена, "GetSupplierTariff");
		Если не ЗначениеЗаполнено(ДатаНачала) Тогда
			ДатаНачала = Дата("19000101");
		КонецЕсли;
	Иначе 
	//Евросиб СубботинВ #131884 02.03.2026 Конец
		НастройкаОбмена = Справочники.НастройкиОбменов.ПолучитьНастройкуОбмена(УзелОбмена, "GetTariff");
	//Евросиб СубботинВ #131884 02.03.2026 Начало
	КонецЕсли;
	//Евросиб СубботинВ #131884 02.03.2026 Конец

	КоличествоЗаписейВПорцииДанных = НастройкаОбмена.КоличествоЗаписейВПорцииДанных;
	Если ЗначениеЗаполнено(КоличествоЗаписейВПорцииДанных) Тогда
		КоличествоЗаписейВПорцииДанныхПлюсОдин = КоличествоЗаписейВПорцииДанных + 1;
		ТекстОграниченияПорции = СтрШаблон("ПЕРВЫЕ %1", Формат(КоличествоЗаписейВПорцииДанныхПлюсОдин, "ЧГ=0"));
	Иначе
		ТекстОграниченияПорции = "";
	КонецЕсли;
	//Евросиб Каблов 20.05.2025 )
	
	ТипСправочникСсылкаМультилокации = Тип("СправочникСсылка.Мультилокации");
	ЛокацияПустаяСсылка = Справочники.Локации.ПустаяСсылка();
	ТипЛокацииГород = Справочники.ТипыЛокаций.НаселенныйПункт;
	ТипЛокацииСтрана = Справочники.ТипыЛокаций.Страна;	
	ТипИерархииГород = Перечисления.ТипыИерархииЛокации.НаселенныйПункт;
	ТипИерархииСтрана = Перечисления.ТипыИерархииЛокации.Страна;
	СтатусСогласоваанПоПСЦ = Перечисления.СтатусыТарифовПоставщиков.СогласованПоПСЦ;
	//Евросиб Шевченко А.В. US 100317 TA 121250 24.10.2025
	СтатусПроведенПоПСЦ    = Перечисления.СтатусыТарифовПоставщиков.ПроведенПоПСЦ;
	НоменклатураКатегорииРасходов = Новый Массив;
	НоменклатураКатегорииРасходов.Добавить(Справочники.Номенклатура.РелокацияКонтейнерПорожний);
	НоменклатураКатегорииРасходов.Добавить(Справочники.Номенклатура.ПредоставлениеКТК);
	НоменклатураКатегорииРасходов.Добавить(Справочники.Номенклатура.ПредоставлениеПлатформ);
	//Евросиб Шевченко А.В. US 100317 TA 121250 24.10.2025
	КлючСтрокиПротоколаПустаяСсылка = Справочники.КлючиАналитикиСтрокПротокола.ПустаяСсылка();
	ВремяВыгрузки = ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЛокацияПустаяСсылка", ЛокацияПустаяСсылка);
	Запрос.УстановитьПараметр("ТипИерархииГород", ТипИерархииГород);
	Запрос.УстановитьПараметр("ТипИерархииСтрана", ТипИерархииСтрана);
	Запрос.УстановитьПараметр("ТипЛокацииГород", ТипЛокацииГород);
	Запрос.УстановитьПараметр("ТипЛокацииСтрана", ТипЛокацииСтрана);
	Запрос.УстановитьПараметр("СтатусСогласоваанПоПСЦ", СтатусСогласоваанПоПСЦ);
	Запрос.УстановитьПараметр("КлючСтрокиПротоколаПустаяСсылка", КлючСтрокиПротоколаПустаяСсылка);
	//Евросиб Шевченко А.В. US 100317 TA 121250 24.10.2025
	Запрос.УстановитьПараметр("НоменклатураКатегорииРасходов", НоменклатураКатегорииРасходов);
	Запрос.УстановитьПараметр("СтатусПроведенПоПСЦ", СтатусПроведенПоПСЦ);
	//Евросиб Шевченко А.В. US 100317 TA 121250 24.10.2025 
	
	//Евросиб СубботинВ #131884 02.03.2026 Начало
	Запрос.УстановитьПараметр("ОбменBi", УзелОбмена = Перечисления.УзлыОбмена.BI);
//	Если УзелОбмена = Перечисления.УзлыОбмена.BI Тогда
		ВидыУслугПоставщиков = Новый Массив;
		ВидыУслугПоставщиков.Добавить(Справочники.ВидыУслугПоставщиков.Автоперевозки);
		ВидыУслугПоставщиков.Добавить(Справочники.ВидыУслугПоставщиков.Контейнеры);
		ВидыУслугПоставщиков.Добавить(Справочники.ВидыУслугПоставщиков.Вагоны);
		Запрос.УстановитьПараметр("ВидыУслугПоставщиков", ВидыУслугПоставщиков);
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	//КонецЕсли; 
		//Евросиб СубботинВ #131884 02.03.2026 Конец
		
	
	Если ЗначениеЗаполнено(ДатаНачала) и ЗначениеЗаполнено(ДатаОкончания) Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 11
		|	ТарифыПоставщиков.Период КАК Период,
		|	ТарифыПоставщиков.Регистратор КАК Регистратор,
		|	ПРЕДСТАВЛЕНИЕ(ТарифыПоставщиков.Регистратор) КАК РегистраторПредставление,
		|	ТарифыПоставщиков.Критерий КАК Критерий,
		|	ТарифыПоставщиков.СтоимостьСНДС КАК СтоимостьСНДС,
		|	ТарифыПоставщиков.СтоимостьБезНДС КАК СтоимостьБезНДС,
		|	ТарифыПоставщиков.ОкончаниеДействия КАК ОкончаниеДействия,
		|	ТарифыПоставщиков.Статус КАК Статус,
		|	ТарифыПоставщиков.Регистратор.Автор КАК РегистраторАвтор,
		|	ТарифыПоставщиков.КлючАналитикиСтрокиПротокола КАК КлючАналитикиСтрокиПротокола
		|ПОМЕСТИТЬ Тарифы
		|ИЗ
		|	РегистрСведений.ТарифыПоставщиков КАК ТарифыПоставщиков
		|ГДЕ
		//Евросиб Шевченко А.В. US 100317 TA 121250 24.10.2025
		|	ВЫБОР
		|			КОГДА ТарифыПоставщиков.Критерий.Номенклатура В (&НоменклатураКатегорииРасходов)
		//Евросиб Шевченко А.В. US 132191 TA 132193 27.02.2026
		//|				ТОГДА ТарифыПоставщиков.Статус = &СтатусПроведенПоПСЦ
		|				ТОГДА ТарифыПоставщиков.Статус = &СтатусПроведенПоПСЦ ИЛИ ТарифыПоставщиков.Статус = &СтатусСогласоваанПоПСЦ
		//Евросиб Шевченко А.В. US 132191 TA 132193 27.02.2026
		|			ИНАЧЕ ТарифыПоставщиков.Статус = &СтатусСогласоваанПоПСЦ
		|		КОНЕЦ
		//|	ТарифыПоставщиков.Статус = &СтатусСогласоваанПоПСЦ
		//Евросиб Шевченко А.В. US 100317 TA 121250 24.10.2025
		|	И ТарифыПоставщиков.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ТарифыПоставщиков.КлючАналитикиСтрокиПротокола <> &КлючСтрокиПротоколаПустаяСсылка";
		
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
		
	Иначе
		
		УзлыПланаОбмена = ПланыОбмена.ВыгрузкаДанных.ПолучитьУзелОбмена(УзелОбмена);
		Если Не ЗначениеЗаполнено(УзлыПланаОбмена) Тогда
			Возврат "<xml><error>Не настроен узел плана обмена по входному параметру RequestingSystem!</error></xml>";
		КонецЕсли;
		
		УзелПланаОбмена = УзлыПланаОбмена[0];
				
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 11
		|	ТарифыПоставщиков.Период КАК Период,
		|	ТарифыПоставщиков.Регистратор КАК Регистратор,
		|	ПРЕДСТАВЛЕНИЕ(ТарифыПоставщиков.Регистратор) КАК РегистраторПредставление,
		|	ТарифыПоставщиков.Критерий КАК Критерий,
		|	ТарифыПоставщиков.СтоимостьСНДС КАК СтоимостьСНДС,
		|	ТарифыПоставщиков.СтоимостьБезНДС КАК СтоимостьБезНДС,
		|	ТарифыПоставщиков.ОкончаниеДействия КАК ОкончаниеДействия,
		|	ТарифыПоставщиков.Статус КАК Статус,
		|	ТарифыПоставщиков.Регистратор.Автор КАК РегистраторАвтор,
		|	КлючиАналитикиСтрокПротоколаИзменения.Ссылка КАК КлючАналитикиСтрокиПротокола
		|ПОМЕСТИТЬ Тарифы
		|ИЗ
		|	Справочник.КлючиАналитикиСтрокПротокола.Изменения КАК КлючиАналитикиСтрокПротоколаИзменения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыПоставщиков КАК ТарифыПоставщиков
		|		ПО КлючиАналитикиСтрокПротоколаИзменения.Ссылка = ТарифыПоставщиков.КлючАналитикиСтрокиПротокола
		//Евросиб Шевченко А.В. US 100317 TA 121250 24.10.2025
		//|		И ТарифыПоставщиков.Статус = &СтатусСогласоваанПоПСЦ
		//Евросиб СубботинВ #131884 02.03.2026 Начало
		//|		и ВЫБОР
		//|			КОГДА ТарифыПоставщиков.Критерий.Номенклатура В (&НоменклатураКатегорииРасходов)
		//|				ТОГДА ТарифыПоставщиков.Статус = &СтатусПроведенПоПСЦ
		//|			ИНАЧЕ ТарифыПоставщиков.Статус = &СтатусСогласоваанПоПСЦ
		//|		КОНЕЦ";
		//Евросиб Шевченко А.В. US 100317 TA 121250 24.10.2025
		//Евросиб СубботинВ #131884 02.03.2026 Начало
		|       И Выбор Когда &ОбменBi Тогда
		|         	ТарифыПоставщиков.Критерий.ВидУслуги В (&ВидыУслугПоставщиков)
		|          		И ТарифыПоставщиков.Период >= &ДатаНачала
		|				И (ТарифыПоставщиков.Статус = &СтатусПроведенПоПСЦ
		|				ИЛИ ТарифыПоставщиков.Статус = &СтатусСогласоваанПоПСЦ)
		|       Иначе
		|			ВЫБОР
		|				КОГДА ТарифыПоставщиков.Критерий.Номенклатура В (&НоменклатураКатегорииРасходов)
		|				ТОГДА ТарифыПоставщиков.Статус = &СтатусПроведенПоПСЦ ИЛИ ТарифыПоставщиков.Статус = &СтатусСогласоваанПоПСЦ
		|				ИНАЧЕ ТарифыПоставщиков.Статус = &СтатусСогласоваанПоПСЦ 
		|			КОНЕЦ
		|		КОНЕЦ
		|ГДЕ
		|		Выбор Когда &ОбменBi
		|		Тогда ТИПЗНАЧЕНИЯ(ТарифыПоставщиков.Регистратор) = ТИП(Документ.ПСЦПоставщика)
		|		Иначе Истина
		|		Конец";
        //Евросиб СубботинВ #131884 02.03.2026 Конец

		
		Запрос.УстановитьПараметр("УзелПланаОбмена", УзелПланаОбмена);
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|;";
	
	Запрос.Текст = Запрос.Текст + 
	"ВЫБРАТЬ
	|	Тарифы.Период КАК НачалоПериода,
	|	Тарифы.ОкончаниеДействия КАК ОкончаниеПериода,
	|	Тарифы.Регистратор КАК Регистратор,
	|	Тарифы.РегистраторПредставление КАК РегистраторПредставление,
	|	Тарифы.Статус КАК Статус,
	|	Тарифы.Критерий КАК Критерий,
	|	Тарифы.КлючАналитикиСтрокиПротокола КАК КлючАналитикиСтрокиПротокола,
	|	КритерииУслугПоставщиков.НормативныйПоказатель КАК НормативныйПоказатель,
	|	КритерииУслугПоставщиков.Валюта КАК Валюта,
	|	КритерииУслугПоставщиков.ТипоразмерКТК КАК ТипоразмерКТК,
	|	КритерииУслугПоставщиков.ТипоразмерКТК.Наименование КАК ТипоразмерКТКНаименование,
	|	ВЫБОР
	|		КОГДА КритерииУслугПоставщиков.ТипоразмерВагона.Вагон
	|			ТОГДА КритерииУслугПоставщиков.ТипоразмерВагона
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ТипоразмерВагона,
	|	ВЫБОР
	|		КОГДА КритерииУслугПоставщиков.ТипоразмерВагона.Вагон
	|			ТОГДА КритерииУслугПоставщиков.ТипоразмерВагона.Наименование
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ТипоразмерВагонаНаименование,
	|	КритерииУслугПоставщиков.ПунктОтправления КАК ПунктОтправления,
	|	КритерииУслугПоставщиков.ПунктОтправленияГород КАК ПунктОтправленияГород,
	|	КритерииУслугПоставщиков.ПунктОтправленияСтрана КАК ПунктОтправленияСтрана,
	|	КритерииУслугПоставщиков.ПунктНазначения КАК ПунктНазначения,
	|	КритерииУслугПоставщиков.ПунктНазначенияГород КАК ПунктНазначенияГород,
	|	КритерииУслугПоставщиков.ПунктНазначенияСтрана КАК ПунктНазначенияСтрана,
	|	КритерииУслугПоставщиков.ВидСобственности КАК ВидСобственности,
	|	Тарифы.СтоимостьСНДС КАК СтоимостьСНДС,
	|	Тарифы.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	КритерииУслугПоставщиков.ВидУслуги КАК ВидУслуги,
	|	КритерииУслугПоставщиков.ВидУслуги.Наименование КАК ВидУслугиНаименование,
	|	КритерииУслугПоставщиков.НормаПользования КАК НормаПользования,
	|	КритерииУслугПоставщиков.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	КритерииУслугПоставщиков.Номенклатура.Код КАК НоменклатураКод,
	|	Пользователи.Наименование КАК АвторНаименование,
	|	Пользователи.ЛогинAD КАК АвторЛогинAD,
	//Евросиб Шевченко А.В. US 100317 TA 121250 24.10.2025
	|	КритерииУслугПоставщиков.Номенклатура КАК Номенклатура,
	//Евросиб Шевченко А.В. US 100317 TA 121250 24.10.2025
	//Евросиб Каблов 19.12.2025 ( #126066
	|	КритерииУслугПоставщиков.ЕдиницаИзмерения КАК ЕдиницаИзмеренияСсылка,
	|	КритерииУслугПоставщиков.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|	КритерииУслугПоставщиков.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	КритерииУслугПоставщиков.Продукт.Наименование КАК ПродуктНаименование,
	|	КритерииУслугПоставщиков.Продукт.Код КАК ПродуктКод,
	|	КритерииУслугПоставщиков.УчетноеНаправление.Наименование КАК УчетноеНаправлениеНаименование,
	|	КритерииУслугПоставщиков.УчетноеНаправление.Код КАК УчетноеНаправлениеКод
	//Евросиб Каблов 19.12.2025 ) #126066
	//Евросиб СубботинВ #131884 02.03.2026 Начало
	|   ,ПРЕДСТАВЛЕНИЕ(КритерииУслугПоставщиков.Поставщик) КАК Контрагент,
	|   КритерииУслугПоставщиков.СтавкаНДС КАК СтавкаНДС,
	|   ПРЕДСТАВЛЕНИЕ(КритерииУслугПоставщиков.Договор) КАК Договор,
	|	КритерииУслугПоставщиков.НормативНахожденияНаПогрузке КАК НормативНахожденияНаПогрузке,
	|	КритерииУслугПоставщиков.НормативНахожденияНаВыгрузке КАК НормативНахожденияНаВыгрузке
	//Евросиб СубботинВ #131884 02.03.2026 Конец
	|ПОМЕСТИТЬ Критерии
	|ИЗ
	|	Тарифы КАК Тарифы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КритерииУслугПоставщиков КАК КритерииУслугПоставщиков
	|		ПО Тарифы.Критерий = КритерииУслугПоставщиков.Ссылка
	//Евросиб СубботинВ #131884 02.03.2026 Начало
	|       и Выбор Когда НЕ &ОбменBi Тогда
	|			 (КритерииУслугПоставщиков.НормативныйПоказатель)
	|         Иначе Истина
	|         Конец
	//Евросиб СубботинВ #131884 02.03.2026 Конец
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО Тарифы.РегистраторАвтор = Пользователи.Ссылка 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДействующиеНормативы.Критерий КАК Критерий,
	|	ВЫБОР
	|		КОГДА НЕ ДействующиеНормативы.ПунктОтправления.Ссылка ЕСТЬ NULL
	|			ТОГДА ДействующиеНормативы.ПунктОтправления
	|		КОГДА НЕ ДействующиеНормативы.ПунктОтправленияГород.Ссылка ЕСТЬ NULL
	|			ТОГДА ДействующиеНормативы.ПунктОтправленияГород
	|		КОГДА НЕ ДействующиеНормативы.ПунктОтправленияСтрана.Ссылка ЕСТЬ NULL
	|			ТОГДА ДействующиеНормативы.ПунктОтправленияСтрана
	|		ИНАЧЕ &ЛокацияПустаяСсылка
	|	КОНЕЦ КАК ПунктОтправления,
	|	ВЫБОР
	|		КОГДА НЕ ДействующиеНормативы.ПунктНазначения.Ссылка ЕСТЬ NULL
	|			ТОГДА ДействующиеНормативы.ПунктНазначения
	|		КОГДА НЕ ДействующиеНормативы.ПунктНазначенияГород.Ссылка ЕСТЬ NULL
	|			ТОГДА ДействующиеНормативы.ПунктНазначенияГород
	|		КОГДА НЕ ДействующиеНормативы.ПунктНазначенияСтрана.Ссылка ЕСТЬ NULL
	|			ТОГДА ДействующиеНормативы.ПунктНазначенияСтрана
	|		ИНАЧЕ &ЛокацияПустаяСсылка
	|	КОНЕЦ КАК ПунктНазначения
	|ПОМЕСТИТЬ КритерииНормативов
	|ИЗ
	|	Критерии КАК ДействующиеНормативы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КритерииНормативов.Критерий КАК Критерий,
	|	ЕСТЬNULL(МультилокацииЛокации.Локация, КритерииНормативов.ПунктОтправления) КАК Локация
	|ПОМЕСТИТЬ ЛокацииОтправленияНормативов
	|ИЗ
	|	КритерииНормативов КАК КритерииНормативов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ПО КритерииНормативов.ПунктОтправления = МультилокацииЛокации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛокацииОтправления.Критерий КАК Критерий,
	|	ВЫБОР
	|		КОГДА ЛокацииОтправления.Локация.Тип = &ТипЛокацииГород
	|				ИЛИ ЛокацииОтправления.Локация.Тип = &ТипЛокацииСтрана
	|			ТОГДА &ЛокацияПустаяСсылка
	|		ИНАЧЕ ЛокацииОтправления.Локация
	|	КОНЕЦ КАК Локация,
	|	ВЫБОР
	|		КОГДА ЛокацииОтправления.Локация.Тип = &ТипЛокацииГород
	|			ТОГДА ЛокацииОтправления.Локация
	|		ИНАЧЕ ЕСТЬNULL(Города.ЛокацияВышестоящегоУровня, &ЛокацияПустаяСсылка)
	|	КОНЕЦ КАК Город,
	|	ВЫБОР
	|		КОГДА ЛокацииОтправления.Локация.Тип = &ТипЛокацииСтрана
	|			ТОГДА ЛокацииОтправления.Локация
	|		ИНАЧЕ ЕСТЬNULL(Страны.ЛокацияВышестоящегоУровня, &ЛокацияПустаяСсылка)
	|	КОНЕЦ КАК Страна
	|ПОМЕСТИТЬ ЛокацииОтправленияНормативовСИерархией
	|ИЗ
	|	ЛокацииОтправленияНормативов КАК ЛокацииОтправления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК Города
	|		ПО ЛокацииОтправления.Локация = Города.Локация
	|			И (Города.ТипИерархии = &ТипИерархииГород)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК Страны
	|		ПО ЛокацииОтправления.Локация = Страны.Локация
	|			И (Страны.ТипИерархии = &ТипИерархииСтрана)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КритерииНормативов.Критерий КАК Критерий,
	|	ЕСТЬNULL(МультилокацииЛокации.Локация, КритерииНормативов.ПунктНазначения) КАК Локация
	|ПОМЕСТИТЬ ЛокацииНазначения
	|ИЗ
	|	КритерииНормативов КАК КритерииНормативов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ПО КритерииНормативов.ПунктНазначения = МультилокацииЛокации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛокацииНазначения.Критерий КАК Критерий,
	|	ВЫБОР
	|		КОГДА ЛокацииНазначения.Локация.Тип = &ТипЛокацииГород
	|				ИЛИ ЛокацииНазначения.Локация.Тип = &ТипЛокацииСтрана
	|			ТОГДА &ЛокацияПустаяСсылка
	|		ИНАЧЕ ЛокацииНазначения.Локация
	|	КОНЕЦ КАК Локация,
	|	ВЫБОР
	|		КОГДА ЛокацииНазначения.Локация.Тип = &ТипЛокацииГород
	|			ТОГДА ЛокацииНазначения.Локация
	|		ИНАЧЕ ЕСТЬNULL(Города.ЛокацияВышестоящегоУровня, &ЛокацияПустаяСсылка)
	|	КОНЕЦ КАК Город,
	|	ВЫБОР
	|		КОГДА ЛокацииНазначения.Локация.Тип = &ТипЛокацииСтрана
	|			ТОГДА ЛокацииНазначения.Локация
	|		ИНАЧЕ ЕСТЬNULL(Страны.ЛокацияВышестоящегоУровня, &ЛокацияПустаяСсылка)
	|	КОНЕЦ КАК Страна
	|ПОМЕСТИТЬ ЛокацииНазначенияНормативовСИерархией
	|ИЗ
	|	ЛокацииНазначения КАК ЛокацииНазначения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК Города
	|		ПО ЛокацииНазначения.Локация = Города.Локация
	|			И (Города.ТипИерархии = &ТипИерархииГород)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК Страны
	|		ПО ЛокацииНазначения.Локация = Страны.Локация
	|			И (Страны.ТипИерархии = &ТипИерархииСтрана)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Локации.Локация КАК Локация
	|ПОМЕСТИТЬ Мультилокации
	|ИЗ
	|	ЛокацииОтправленияНормативовСИерархией КАК Локации
	|ГДЕ
	|	Локации.Локация <> &ЛокацияПустаяСсылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Локации.Город
	|ИЗ
	|	ЛокацииОтправленияНормативовСИерархией КАК Локации
	|ГДЕ
	|	Локации.Город <> &ЛокацияПустаяСсылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Локации.Страна
	|ИЗ
	|	ЛокацииОтправленияНормативовСИерархией КАК Локации
	|ГДЕ
	|	Локации.Страна <> &ЛокацияПустаяСсылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Локации.Локация
	|ИЗ
	|	ЛокацииНазначенияНормативовСИерархией КАК Локации
	|ГДЕ
	|	Локации.Локация <> &ЛокацияПустаяСсылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Локации.Город
	|ИЗ
	|	ЛокацииНазначенияНормативовСИерархией КАК Локации
	|ГДЕ
	|	Локации.Город <> &ЛокацияПустаяСсылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Локации.Страна
	|ИЗ
	|	ЛокацииНазначенияНормативовСИерархией КАК Локации
	|ГДЕ
	|	Локации.Страна <> &ЛокацияПустаяСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Мультилокации.Локация КАК Мультилокация,
	|	ЕСТЬNULL(МультилокацииЛокации.Локация, ВЫРАЗИТЬ(Мультилокации.Локация КАК Справочник.Локации)) КАК Локация
	|ПОМЕСТИТЬ Локации
	|ИЗ
	|	Мультилокации КАК Мультилокации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ПО Мультилокации.Локация = МультилокацииЛокации.Ссылка
	|;
	| 	
	//Евросиб СубботинВ #131884 02.03.2026 Начало
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТарифыПоставщиковПоУчетнымЕдиницамСрезПоследних.Регистратор КАК Регистратор,
	|	ТарифыПоставщиковПоУчетнымЕдиницамСрезПоследних.УчетнаяЕдиница КАК УчетнаяЕдиница
	|ИЗ
	|	Тарифы КАК Тарифы
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыПоставщиковПоУчетнымЕдиницам.СрезПоследних(, ) КАК ТарифыПоставщиковПоУчетнымЕдиницамСрезПоследних
	|		ПО Тарифы.Критерий = ТарифыПоставщиковПоУчетнымЕдиницамСрезПоследних.Критерий;
	//Евросиб СубботинВ #131884 02.03.2026 Конец
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛокацииОтправленияНормативовСИерархией.Критерий КАК Критерий,
	|	ЛокацииОтправленияНормативовСИерархией.Локация КАК Локация,
	|	ЛокацииОтправленияНормативовСИерархией.Город КАК Город,
	|	ЛокацииОтправленияНормативовСИерархией.Страна КАК Страна
	|ИЗ
	|	ЛокацииОтправленияНормативовСИерархией КАК ЛокацииОтправленияНормативовСИерархией
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛокацииНазначенияНормативовСИерархией.Критерий КАК Критерий,
	|	ЛокацииНазначенияНормативовСИерархией.Локация КАК Локация,
	|	ЛокацииНазначенияНормативовСИерархией.Город КАК Город,
	|	ЛокацииНазначенияНормативовСИерархией.Страна КАК Страна
	|ИЗ
	|	ЛокацииНазначенияНормативовСИерархией КАК ЛокацииНазначенияНормативовСИерархией
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Локации.Локация КАК Локация,
	|	СпрЛокации.Код КАК Код,
	|	СпрЛокации.Наименование КАК Наименование
	|ИЗ
	|	Локации КАК Локации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Локации КАК СпрЛокации
	|		ПО Локации.Локация = СпрЛокации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Критерии.НачалоПериода КАК НачалоПериода,
	|	Критерии.ОкончаниеПериода КАК ОкончаниеПериода,
	|	Критерии.Регистратор КАК Регистратор,
	|	Критерии.РегистраторПредставление КАК РегистраторПредставление,
	|	Критерии.Статус КАК Статус,
	|	Критерии.Критерий КАК Критерий,
	|	Критерии.КлючАналитикиСтрокиПротокола КАК КлючАналитикиСтрокиПротокола,
	|	Критерии.НормативныйПоказатель КАК НормативныйПоказатель,
	|	Критерии.Валюта КАК Валюта,
	|	Критерии.ТипоразмерКТК КАК ТипоразмерКТК,
	|	Критерии.ТипоразмерКТКНаименование КАК ТипоразмерКТКНаименование,
	|	Критерии.ТипоразмерВагона КАК ТипоразмерВагона,
	|	Критерии.ТипоразмерВагонаНаименование КАК ТипоразмерВагонаНаименование,
	|	Критерии.ПунктОтправления КАК ПунктОтправления,
	|	Критерии.ПунктОтправленияГород КАК ПунктОтправленияГород,
	|	Критерии.ПунктОтправленияСтрана КАК ПунктОтправленияСтрана,
	|	Критерии.ПунктНазначения КАК ПунктНазначения,
	|	Критерии.ПунктНазначенияГород КАК ПунктНазначенияГород,
	|	Критерии.ПунктНазначенияСтрана КАК ПунктНазначенияСтрана,
	|	Критерии.ВидСобственности КАК ВидСобственности,
	|	Критерии.СтоимостьСНДС КАК СтоимостьСНДС,
	|	Критерии.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	Критерии.ВидУслуги КАК ВидУслуги,
	|	Критерии.ВидУслугиНаименование КАК ВидУслугиНаименование,
	|	Критерии.НормаПользования КАК НормаПользования,
	|	Критерии.НоменклатураНаименование КАК НоменклатураНаименование,
	|	Критерии.НоменклатураКод КАК НоменклатураКод,
	|	Критерии.АвторНаименование КАК АвторНаименование,
	|	Критерии.АвторЛогинAD КАК АвторЛогинAD,
	|	Валюты.Код КАК ВалютаКод,
	|	Валюты.Наименование КАК ВалютаНаименование,
	//Евросиб Шевченко А.В. US 100317 TA 121250 24.10.2025
	|	Критерии.Номенклатура КАК Номенклатура,
	//Евросиб Шевченко А.В. US 100317 TA 121250 24.10.2025
	//Евросиб Каблов 19.12.2025 ( #126066
	|	Критерии.ЕдиницаИзмеренияСсылка КАК ЕдиницаИзмеренияСсылка,
	|	Критерии.ЕдиницаИзмеренияНаименование КАК ЕдиницаИзмеренияНаименование,
	|	Критерии.ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод,
	|	Критерии.ПродуктНаименование КАК ПродуктНаименование,
	|	Критерии.ПродуктКод КАК ПродуктКод,
	|	Критерии.УчетноеНаправлениеНаименование КАК УчетноеНаправлениеНаименование,
	|	Критерии.УчетноеНаправлениеКод КАК УчетноеНаправлениеКод
	//Евросиб Каблов 19.12.2025 ) #126066
	//Евросиб СубботинВ #131884 02.03.2026 Начало
	|	,Критерии.Контрагент КАК Контрагент,
	|	Критерии.СтавкаНДС КАК СтавкаНДС,
	|	Критерии.Договор КАК Договор,
	|	Критерии.НормативНахожденияНаПогрузке КАК НормативНахожденияНаПогрузке,
	|	Критерии.НормативНахожденияНаВыгрузке КАК НормативНахожденияНаВыгрузке,
	|ВЫБОР
	|	КОГДА ТИПЗНАЧЕНИЯ(Критерии.Регистратор) = ТИП(Документ.ПСЦПоставщика)
	|		ТОГДА ПСЦПоставщика.Номер
	|	ИНАЧЕ NULL
	|КОНЕЦ КАК НомерДокументаПСЦ,
	|ВЫБОР
	|	КОГДА ТИПЗНАЧЕНИЯ(Критерии.Регистратор) = ТИП(Документ.ПСЦПоставщика)
	|		ТОГДА ПСЦПоставщика.Создано
	|	ИНАЧЕ NULL
	|КОНЕЦ КАК ДатаСозданияПСЦ,
	|ВЫБОР
	|	КОГДА ТИПЗНАЧЕНИЯ(Критерии.Регистратор) = ТИП(Документ.ПСЦПоставщика)
	|		ТОГДА ПСЦПоставщика.ДатаПСЦ
	|	ИНАЧЕ NULL
	|КОНЕЦ КАК ДатаПСЦ,
	|ВЫБОР
	|	КОГДА ТИПЗНАЧЕНИЯ(Критерии.Регистратор) = ТИП(Документ.ПСЦПоставщика)
	|		ТОГДА ПСЦПоставщика.НомерПСЦ
	|	ИНАЧЕ NULL
	|КОНЕЦ КАК НомерПСЦ
	//Евросиб СубботинВ #131884 02.03.2026 Конец
	|ИЗ
	|Критерии КАК Критерии
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|	ПО Критерии.Валюта = Валюты.Ссылка
	//Евросиб СубботинВ #131884 02.03.2026 Начало
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПСЦПоставщика КАК ПСЦПоставщика
	|	ПО Критерии.Регистратор = ПСЦПоставщика.Ссылка";
	//Евросиб СубботинВ #131884 02.03.2026 Конец
	//Евросиб Каблов 20.05.2025 ( #110106
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 11", ТекстОграниченияПорции);
	//Евросиб Каблов 20.05.2025 )
	
	Результаты = Запрос.ВыполнитьПакет();
	КоличествоРезультатов = Результаты.Количество();
	ВыборкаТарифов = Результаты[КоличествоРезультатов - 1].Выбрать();
	ВыборкаЛокаций = Результаты[КоличествоРезультатов - 2].Выбрать();
	ЛокацииНазначения = Результаты[КоличествоРезультатов - 3].Выгрузить();
	ЛокацииОтправления = Результаты[КоличествоРезультатов - 4].Выгрузить();
	//Евросиб СубботинВ #131884 02.03.2026 Начало
	ТаблицаУЕ = Результаты[КоличествоРезультатов - 5].Выгрузить();
	//Евросиб СубботинВ #131884 02.03.2026 Конец
	
	КодыЛокаций = Новый Соответствие;
	Пока ВыборкаЛокаций.Следующий() Цикл
		ГУИД = Строка(ВыборкаЛокаций.Локация.УникальныйИдентификатор());
		КодыЛокаций.Вставить(ВыборкаЛокаций.Локация, Новый Структура("ГУИД, Код, Наименование", ГУИД, СокрЛП(ВыборкаЛокаций.Код), СокрЛП(ВыборкаЛокаций.Наименование)));
	КонецЦикла;
	
	Запись = Новый ЗаписьXML; 
	Запись.УстановитьСтроку();
	Запись.ЗаписатьОбъявлениеXML(); //
	Запись.ЗаписатьНачалоЭлемента("Root");
	
	//Евросиб Каблов 20.05.2025 ( #110106
	Счетчик = 0;
	ОсталисьДанныеДляВыгрузки = Ложь;
	КоличествоЗаписейВПорцииДанных = НастройкаОбмена.КоличествоЗаписейВПорцииДанных;
	Если ЗначениеЗаполнено(КоличествоЗаписейВПорцииДанных) Тогда
		ОграничиватьПорцию = Истина;
	Иначе
		ОграничиватьПорцию = Ложь;
	КонецЕсли;
	//Евросиб Каблов 20.05.2025 )
	
	Пока ВыборкаТарифов.Следующий() Цикл
		
		//Евросиб Каблов 20.05.2025 ( #110106
		Счетчик = Счетчик + 1;
		Если ОграничиватьПорцию И Счетчик > КоличествоЗаписейВПорцииДанных Тогда
			ОсталисьДанныеДляВыгрузки = Истина;
			Прервать;
		КонецЕсли;
		//Евросиб Каблов 20.05.2025 )
		
		ГУИДТарифа = XMLСтрока(ВыборкаТарифов.КлючАналитикиСтрокиПротокола);
		
		Запись.ЗаписатьНачалоЭлемента("Тариф");
		Запись.ЗаписатьАтрибут("ГУИД", 					XMLСтрока(ВыборкаТарифов.КлючАналитикиСтрокиПротокола));
		//Евросиб Шевченко А.В. US 100317 TA 121250 24.10.2025
		//Если ВыборкаТарифов.Статус = Перечисления.СтатусыТарифовПоставщиков.СогласованПоПСЦ Тогда
		//Евросиб Шевченко А.В. US 132191 TA 132193 27.02.2026
		//Если (НоменклатураКатегорииРасходов.Найти(ВыборкаТарифов.Номенклатура) <> Неопределено И ВыборкаТарифов.Статус = Перечисления.СтатусыТарифовПоставщиков.ПроведенПоПСЦ)
		Если (НоменклатураКатегорииРасходов.Найти(ВыборкаТарифов.Номенклатура) <> Неопределено И (ВыборкаТарифов.Статус = Перечисления.СтатусыТарифовПоставщиков.ПроведенПоПСЦ ИЛИ ВыборкаТарифов.Статус = Перечисления.СтатусыТарифовПоставщиков.СогласованПоПСЦ))	
		//Евросиб Шевченко А.В. US 132191 TA 132193 27.02.2026
			ИЛИ (НоменклатураКатегорииРасходов.Найти(ВыборкаТарифов.Номенклатура) = Неопределено И ВыборкаТарифов.Статус = Перечисления.СтатусыТарифовПоставщиков.СогласованПоПСЦ)// Тогда
		//Евросиб Шевченко А.В. US 100317 TA 121250 24.10.2025 
			//Евросиб СубботинВ #131884 02.03.2026 Начало
			Или УзелОбмена = Перечисления.УзлыОбмена.BI Тогда
            //Евросиб СубботинВ #131884 02.03.2026 Конец
			Запись.ЗаписатьАтрибут("Актуальность",			XMLСтрока(Истина));
			Запись.ЗаписатьАтрибут("НачалоПериода",			XMLСтрока(ВыборкаТарифов.НачалоПериода));
			//Евросиб СубботинВ #131884 02.03.2026 Начало
			//Если ЗначениеЗаполнено(ВыборкаТарифов.ОкончаниеПериода) Тогда
			Если ЗначениеЗаполнено(ВыборкаТарифов.ОкончаниеПериода) или УзелОбмена = Перечисления.УзлыОбмена.BI Тогда
			//Евросиб СубботинВ #131884 02.03.2026 Конец
				Запись.ЗаписатьАтрибут("ОкончаниеПериода",			XMLСтрока(ВыборкаТарифов.ОкончаниеПериода));
			КонецЕсли;
			Запись.ЗаписатьАтрибут("Статус",				Строка(ВыборкаТарифов.Статус));
			Запись.ЗаписатьАтрибут("НормативныйПоказатель",	XMLСтрока(ВыборкаТарифов.НормативныйПоказатель));		
			Запись.ЗаписатьАтрибут("ВидСобственности",		Строка(ВыборкаТарифов.ВидСобственности));
			Запись.ЗаписатьАтрибут("СтоимостьБезНДС",		XMLСтрока(ВыборкаТарифов.СтоимостьБезНДС));
			Запись.ЗаписатьАтрибут("СтоимостьСНДС",			XMLСтрока(ВыборкаТарифов.СтоимостьСНДС));
			//Евросиб СубботинВ #131884 02.03.2026 Начало
			Запись.ЗаписатьАтрибут("СтавкаНДС",	XMLСтрока(ВыборкаТарифов.СтавкаНДС));
			//Евросиб СубботинВ #131884 02.03.2026 Конец
			Запись.ЗаписатьАтрибут("ТипоразмерКТК",			XMLСтрока(ВыборкаТарифов.ТипоразмерКТКНаименование));
			Запись.ЗаписатьАтрибут("ТипоразмерВагона",		XMLСтрока(ВыборкаТарифов.ТипоразмерВагонаНаименование));
			Запись.ЗаписатьАтрибут("ВидУслуги",				XMLСтрока(ВыборкаТарифов.ВидУслугиНаименование));
			Запись.ЗаписатьАтрибут("НормаПользования",		XMLСтрока(ВыборкаТарифов.НормаПользования));
			
			//Евросиб СубботинВ #131884 02.03.2026 Начало

			Запись.ЗаписатьНачалоЭлемента("Основание");			
			Если УзелОбмена = Перечисления.УзлыОбмена.BI Тогда 
				Запись.ЗаписатьАтрибут("НомерПротокола",	XMLСтрока(ВыборкаТарифов.НомерДокументаПСЦ));
				Запись.ЗаписатьАтрибут("ДатаСоздания",		XMLСтрока(ВыборкаТарифов.ДатаСозданияПСЦ));
				Запись.ЗаписатьАтрибут("Автор",				XMLСтрока(ВыборкаТарифов.АвторНаименование));
				Запись.ЗаписатьАтрибут("ГУИД",				XMLСтрока(ВыборкаТарифов.Регистратор));
				Запись.ЗаписатьАтрибут("НомерПСЦ",			XMLСтрока(ВыборкаТарифов.НомерПСЦ));
				Запись.ЗаписатьАтрибут("ДатаПСЦ",			XMLСтрока(Формат(ВыборкаТарифов.ДатаПСЦ, "ДФ=dd.MM.yyyy")));
			Иначе
				//Евросиб СубботинВ #131884 02.03.2026 Конец
				Запись.ЗаписатьАтрибут("Представление",	XMLСтрока(ВыборкаТарифов.РегистраторПредставление));
				Запись.ЗаписатьАтрибут("ГУИД",			XMLСтрока(ВыборкаТарифов.Регистратор));				
				//Евросиб СубботинВ #131884 02.03.2026 Начало
			КонецЕсли;
			Запись.ЗаписатьКонецЭлемента();
			//Евросиб СубботинВ #131884 02.03.2026 Конец
			Запись.ЗаписатьНачалоЭлемента("Номенклатура");
			Запись.ЗаписатьАтрибут("Наименование",	XMLСтрока(ВыборкаТарифов.НоменклатураНаименование));
			Запись.ЗаписатьАтрибут("Код",			XMLСтрока(ВыборкаТарифов.НоменклатураКод));
			Запись.ЗаписатьКонецЭлемента();
			
			Запись.ЗаписатьНачалоЭлемента("Валюта");
			Запись.ЗаписатьАтрибут("Код", 			XMLСтрока(ВыборкаТарифов.ВалютаКод));
			Запись.ЗаписатьАтрибут("СимвольныйКод", XMLСтрока(ВыборкаТарифов.ВалютаНаименование));
			Запись.ЗаписатьКонецЭлемента();
			
			//Евросиб Каблов 19.12.2025 ( #126066
			Запись.ЗаписатьНачалоЭлемента("ЕдиницаИзмерения");
			Запись.ЗаписатьАтрибут("ГУИД", 			XMLСтрока(ВыборкаТарифов.ЕдиницаИзмеренияСсылка));
			Запись.ЗаписатьАтрибут("Наименование", 	XMLСтрока(ВыборкаТарифов.ЕдиницаИзмеренияНаименование));
			Запись.ЗаписатьАтрибут("Код", 			XMLСтрока(ВыборкаТарифов.ЕдиницаИзмеренияКод));
			Запись.ЗаписатьКонецЭлемента();
			
			Запись.ЗаписатьНачалоЭлемента("Продукт");
			Запись.ЗаписатьАтрибут("Наименование", XMLСтрока(ВыборкаТарифов.ПродуктНаименование));
			Запись.ЗаписатьАтрибут("Код", 			XMLСтрока(ВыборкаТарифов.ПродуктКод));			
			Запись.ЗаписатьКонецЭлемента();
			
			Запись.ЗаписатьНачалоЭлемента("УчетноеНаправление");
			Запись.ЗаписатьАтрибут("Наименование", XMLСтрока(ВыборкаТарифов.УчетноеНаправлениеНаименование));
			Запись.ЗаписатьАтрибут("Код", 			XMLСтрока(ВыборкаТарифов.УчетноеНаправлениеКод));			
			Запись.ЗаписатьКонецЭлемента();
			//Евросиб Каблов 19.12.2025 ) #126066
			
			//Евросиб СубботинВ #131884 02.03.2026 Начало
			Запись.ЗаписатьНачалоЭлемента("Контрагент");
			Запись.ЗаписатьАтрибут("Наименование",	XMLСтрока(ВыборкаТарифов.Контрагент));
			Запись.ЗаписатьКонецЭлемента();
						
			Запись.ЗаписатьНачалоЭлемента("Договор");
			Запись.ЗаписатьАтрибут("Наименование",	XMLСтрока(ВыборкаТарифов.Договор));
			Запись.ЗаписатьКонецЭлемента();
			
			СписокУЕИзПСЦ = ТаблицаУЕ.НайтиСтроки(Новый Структура("Регистратор",ВыборкаТарифов.Регистратор));
			СписокУЕ = "";
			Если СписокУЕИзПСЦ.Количество()> 0 Тогда 
				Для Каждого УЕ из СписокУЕИзПСЦ Цикл
					СписокУЕ = СписокУЕ + УЕ.УчетнаяЕдиница + ";"; 	
				КонецЦикла;
			КонецЕсли;
			
			Запись.ЗаписатьНачалоЭлемента("КТКВагоны");
			Запись.ЗаписатьАтрибут("Список",	XMLСтрока(СписокУЕ));
			Запись.ЗаписатьКонецЭлемента();	
			
			Запись.ЗаписатьНачалоЭлемента("Нормативы");
			Запись.ЗаписатьАтрибут("НормаПользования",				XMLСтрока(ВыборкаТарифов.НормаПользования));
			Запись.ЗаписатьАтрибут("НормативНахожденияНаПогрузке",	XMLСтрока(ВыборкаТарифов.НормативНахожденияНаПогрузке));
			Запись.ЗаписатьАтрибут("НормативНахожденияНаВыгрузке",	XMLСтрока(ВыборкаТарифов.НормативНахожденияНаВыгрузке));
			Запись.ЗаписатьКонецЭлемента();

			//Евросиб СубботинВ #131884 02.03.2026 Конец
			
			Запись.ЗаписатьНачалоЭлемента("ПунктыОтправления");
			
			Локации = ЛокацииОтправления.НайтиСтроки(Новый Структура("Критерий", ВыборкаТарифов.Критерий));
			Для Каждого Стр Из Локации Цикл
				
				Запись.ЗаписатьНачалоЭлемента("ПунктОтправления");
				
				Если ЗначениеЗаполнено(Стр.Страна) Тогда
					КодыЛокации = КодыЛокаций.Получить(Стр.Страна);
					Если КодыЛокации <> Неопределено Тогда
						Запись.ЗаписатьНачалоЭлемента("Страна");
						Запись.ЗаписатьАтрибут("Код", КодыЛокации.Код);
						Запись.ЗаписатьАтрибут("ГУИД", КодыЛокации.ГУИД);
						Запись.ЗаписатьАтрибут("Наименование", КодыЛокации.Наименование);
						Запись.ЗаписатьКонецЭлемента();
					КонецЕсли;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Стр.Город) Тогда
					КодыЛокации = КодыЛокаций.Получить(Стр.Город);
					Если КодыЛокации <> Неопределено Тогда
						Запись.ЗаписатьНачалоЭлемента("Город");
						Запись.ЗаписатьАтрибут("Код", КодыЛокации.Код);
						Запись.ЗаписатьАтрибут("ГУИД", КодыЛокации.ГУИД);
						Запись.ЗаписатьАтрибут("Наименование", КодыЛокации.Наименование);
						Запись.ЗаписатьКонецЭлемента();
					КонецЕсли;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Стр.Локация) Тогда
					КодыЛокации = КодыЛокаций.Получить(Стр.Локация);
					Если КодыЛокации <> Неопределено Тогда
						Запись.ЗаписатьНачалоЭлемента("Локация");
						Запись.ЗаписатьАтрибут("Код", КодыЛокации.Код);
						Запись.ЗаписатьАтрибут("ГУИД", КодыЛокации.ГУИД);
						Запись.ЗаписатьАтрибут("Наименование", КодыЛокации.Наименование);
						Запись.ЗаписатьКонецЭлемента();
					КонецЕсли;
				КонецЕсли;
				
				Запись.ЗаписатьКонецЭлемента();
				
			КонецЦикла;
					
			Запись.ЗаписатьКонецЭлемента();		
			
			Запись.ЗаписатьНачалоЭлемента("ПунктыНазначения");
			
			Локации = ЛокацииНазначения.НайтиСтроки(Новый Структура("Критерий", ВыборкаТарифов.Критерий));
			Для Каждого Стр Из Локации Цикл
				
				Запись.ЗаписатьНачалоЭлемента("ПунктНазначения");
				
				Если ЗначениеЗаполнено(Стр.Страна) Тогда
					КодыЛокации = КодыЛокаций.Получить(Стр.Страна);
					Если КодыЛокации <> Неопределено Тогда
						Запись.ЗаписатьНачалоЭлемента("Страна");
						Запись.ЗаписатьАтрибут("Код", КодыЛокации.Код);
						Запись.ЗаписатьАтрибут("ГУИД", КодыЛокации.ГУИД);
						Запись.ЗаписатьАтрибут("Наименование", КодыЛокации.Наименование);
						Запись.ЗаписатьКонецЭлемента();
					КонецЕсли;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Стр.Город) Тогда
					КодыЛокации = КодыЛокаций.Получить(Стр.Город);
					Если КодыЛокации <> Неопределено Тогда
						Запись.ЗаписатьНачалоЭлемента("Город");
						Запись.ЗаписатьАтрибут("Код", КодыЛокации.Код);
						Запись.ЗаписатьАтрибут("ГУИД", КодыЛокации.ГУИД);
						Запись.ЗаписатьАтрибут("Наименование", КодыЛокации.Наименование);
						Запись.ЗаписатьКонецЭлемента();
					КонецЕсли;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Стр.Локация) Тогда
					КодыЛокации = КодыЛокаций.Получить(Стр.Локация);
					Если КодыЛокации <> Неопределено Тогда
						Запись.ЗаписатьНачалоЭлемента("Локация");
						Запись.ЗаписатьАтрибут("Код", КодыЛокации.Код);
						Запись.ЗаписатьАтрибут("ГУИД", КодыЛокации.ГУИД);
						Запись.ЗаписатьАтрибут("Наименование", КодыЛокации.Наименование);
						Запись.ЗаписатьКонецЭлемента();
					КонецЕсли;
				КонецЕсли;
				
				Запись.ЗаписатьКонецЭлемента();
				
			КонецЦикла;
					
			Запись.ЗаписатьКонецЭлемента();
			
			Запись.ЗаписатьНачалоЭлемента("Автор");
			Запись.ЗаписатьАтрибут("ПолноеИмя",					XMLСтрока(ВыборкаТарифов.АвторНаименование));
			Запись.ЗаписатьАтрибут("ЛогинAD",					XMLСтрока(ВыборкаТарифов.АвторЛогинAD));
			Запись.ЗаписатьКонецЭлемента();
			
		Иначе
			
			Запись.ЗаписатьАтрибут("Актуальность",			XMLСтрока(Ложь));
			
		КонецЕсли;
		
		Запись.ЗаписатьКонецЭлемента(); //Тариф
		
		СтруктураПоиска = Новый Структура("ДействиеПриОбмене, УзелОбмена, Объект", Перечисления.ДействияПриОбмене.ВыгрузкаДанных, УзелОбмена, ВыборкаТарифов.КлючАналитикиСтрокиПротокола);
		СтруктураДанных = Новый Структура("УИДИсточника, ЗагрузкаПодтверждена, ДатаОбмена", ГУИДТарифа, Ложь, ВремяВыгрузки);
		РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных);
		
	КонецЦикла;
	
	//Евросиб Каблов 20.05.2025 ( #110106
	ДобавитьЭлементВФайл(Запись, "ОсталисьДанныеДляВыгрузки", ОсталисьДанныеДляВыгрузки);
	//Евросиб Каблов 20.05.2025 )
	
	Запись.ЗаписатьКонецЭлемента();
	
	Возврат Запись.Закрыть();
	
КонецФункции

//Евросиб Каблов 03.02.2025 #100569
Функция ПолучитьЕдиницыИзмерения(ИмяУзла, ТолькоИзменения) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИмяУзла) Тогда
		Возврат "<xml><error>Пустое значение параметра RequestingSystem!</error></xml>";
	КонецЕсли;  
	
	УзелОбмена = Неопределено;
	Для каждого ЗначПеречисления Из Метаданные.Перечисления.УзлыОбмена.ЗначенияПеречисления Цикл
		Если ЗначПеречисления.Имя = ИмяУзла Тогда
			УзелОбмена = Перечисления.УзлыОбмена[ЗначПеречисления.Имя];  
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	Если УзелОбмена = Неопределено Тогда
		Возврат "<xml><error>Не найден узел обмена по входному параметру RequestingSystem!</error></xml>";
	КонецЕсли;
	
	ВремяВыгрузки = ТекущаяДата();
	
	Запрос = Новый Запрос;
	
	Если ТолькоИзменения Тогда
		
		УзлыПланаОбмена = ПланыОбмена.ВыгрузкаДанных.ПолучитьУзелОбмена(УзелОбмена);
		Если Не ЗначениеЗаполнено(УзлыПланаОбмена) Тогда
			Возврат "<xml><error>Не настроен узел плана обмена по входному параметру RequestingSystem!</error></xml>";
		КонецЕсли;
		
		УзелПланаОбмена = УзлыПланаОбмена[0];
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КлассификаторЕдиницИзмерения.Ссылка КАК Ссылка,
		|	КлассификаторЕдиницИзмерения.Родитель КАК Родитель,
		|	КлассификаторЕдиницИзмерения.Код КАК Код,
		|	КлассификаторЕдиницИзмерения.Наименование КАК Наименование,
		|	КлассификаторЕдиницИзмерения.НаименованиеПолное КАК НаименованиеПолное,
		|	КлассификаторЕдиницИзмерения.Родитель.Наименование КАК РодительНаименование
		|ИЗ
		|	Справочник.КлассификаторЕдиницИзмерения.Изменения КАК КлассификаторЕдиницИзмеренияИзменения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
		|		ПО КлассификаторЕдиницИзмеренияИзменения.Ссылка = КлассификаторЕдиницИзмерения.Ссылка
		|ГДЕ
		|	КлассификаторЕдиницИзмеренияИзменения.Узел = &УзелПланаОбмена
		|	И НЕ КлассификаторЕдиницИзмерения.ЭтоГруппа
		|	И НЕ КлассификаторЕдиницИзмерения.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Родитель,
		|	Ссылка";
		
		Запрос.УстановитьПараметр("УзелПланаОбмена", УзелПланаОбмена);
		
	Иначе		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КлассификаторЕдиницИзмерения.Ссылка КАК Ссылка,
		|	КлассификаторЕдиницИзмерения.Родитель КАК Родитель,
		|	КлассификаторЕдиницИзмерения.Код КАК Код,
		|	КлассификаторЕдиницИзмерения.Наименование КАК Наименование,
		|	КлассификаторЕдиницИзмерения.НаименованиеПолное КАК НаименованиеПолное,
		|	КлассификаторЕдиницИзмерения.Родитель.Наименование КАК РодительНаименование
		|ИЗ
		|	Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
		|ГДЕ
		|	НЕ КлассификаторЕдиницИзмерения.ЭтоГруппа
		|	И НЕ КлассификаторЕдиницИзмерения.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Родитель,
		|	Ссылка";		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Запись = Новый ЗаписьXML; 
	Запись.УстановитьСтроку();
	Запись.ЗаписатьОбъявлениеXML(); //
	Запись.ЗаписатьНачалоЭлемента("Root");
	
	Пока Выборка.Следующий() Цикл
		
		ГУИД = XMLСтрока(Выборка.Ссылка);
		
		Запись.ЗаписатьНачалоЭлемента("ЕдиницаИзмерения");
		Запись.ЗаписатьАтрибут("ГУИД",					ГУИД);
		Запись.ЗаписатьАтрибут("КраткоеНаименование",	XMLСтрока(Выборка.Наименование));
		Запись.ЗаписатьАтрибут("ПолноеНаименование",	XMLСтрока(Выборка.НаименованиеПолное));
		Запись.ЗаписатьАтрибут("Категория",				XMLСтрока(Выборка.РодительНаименование));
		Запись.ЗаписатьКонецЭлемента();
		
		СтруктураПоиска = Новый Структура("ДействиеПриОбмене, УзелОбмена, Объект", Перечисления.ДействияПриОбмене.ВыгрузкаДанных, УзелОбмена, Выборка.Ссылка);
		СтруктураДанных = Новый Структура("УИДИсточника, ЗагрузкаПодтверждена, ДатаОбмена", ГУИД, Ложь, ВремяВыгрузки);
		РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных);
			
	КонецЦикла;
	
	Запись.ЗаписатьКонецЭлемента();
	
	Возврат Запись.Закрыть();
	
КонецФункции

//Евросиб Шевченко А.В. 07.05.2025 US 94035 TA 104217
Функция ПолучитьДанныеТранспортнойАналитики(XMLParams, Данные = Неопределено) Экспорт  
		
	Если Данные = Неопределено Тогда //данные через веб-сервис
		Чтение = Новый ЧтениеXML;
		Чтение.УстановитьСтроку(XMLParams);
	
		Фабрика = Новый ФабрикаXDTO;
		ОбъектXDTO = Фабрика.ПрочитатьXML(Чтение);
	Иначе //данные через внешнюю обработку из файла
		ОбъектXDTO = Данные;
	КонецЕсли;
	
	МассивВхДокументов = Новый Массив;
									                             
	Если ТипЗнч(ОбъектXDTO.Шапка)= Тип("СписокXDTO") Тогда //в XML-файле несколько документов	
		Для каждого ДанныеДокумента из ОбъектXDTO.Шапка цикл
			МассивВхДокументов.Добавить(ДанныеДокумента);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ОбъектXDTO.Шапка)= ТИП("ОбъектXDTO") Тогда  //в XML-файле один документ   
		ДанныеДокумента = ОбъектXDTO.Шапка; 
		МассивВхДокументов.Добавить(ДанныеДокумента);
	КонецЕсли;  
	
	МассивГУИДовДляОтвета = Новый Массив;
	МассивДанных = Новый Массив;
	
	//записываем в регистр ДанныеПакетовОбмена с использованием НабораЗаписей
	ПериодОбмена = ТекущаяДата();
	НаборЗаписей = РегистрыСведений.ДанныеПакетовОбмена.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПериодОбмена.Установить(ПериодОбмена);
	Для Каждого Док Из МассивВхДокументов Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ПериодОбмена = ПериодОбмена;
		Если Док.ГУИД_ДК = "" Тогда
			ИдентификаторСтрокиПакетаДанных = Строка(Новый УникальныйИдентификатор);
		Иначе
			ИдентификаторСтрокиПакетаДанных = Док.ГУИД_ДК;
		КонецЕсли;
	    НоваяЗапись.ИдентификаторСтрокиПакетаДанных = ИдентификаторСтрокиПакетаДанных;
	    НоваяЗапись.ВнешнийИдентификаторСтрокиПакетаДанных = Док.ID_DX;
		//Евросиб Коханенко Н.А. 04.03.2026 (( #117279
		//не перенесено, в рабочей пока старое значение ПолучениеДанныхОСреднейМиле
		НоваяЗапись.ИсточникПакетаДанных = ПредопределенноеЗначение("Справочник.ИсточникиПакетовДанных.ПолучениеДанныхТранспортнойАналитики");
		//Евросиб Коханенко Н.А. 04.03.2026 )) #117279 
		НоваяЗапись.СтруктураДанных = Новый ХранилищеЗначения(ОбщегоНазначения.ОбъектXDTOВСтрокуXML(Док), Новый СжатиеДанных(9));
		НоваяЗапись.ОбъектДанных = Неопределено;
		НоваяЗапись.Обработано = Ложь;
		НоваяЗапись.ДатаОбработки = Дата(1,1,1);
		НоваяЗапись.ЕстьОшибки = Ложь;
		НоваяЗапись.ОписаниеОшибки = "";
		МассивГУИДовДляОтвета.Добавить(Новый Структура("ID_DX, ГУИД_ДК", Док.ID_DX, ИдентификаторСтрокиПакетаДанных));
		МассивДанных.Добавить(Новый Структура("ПериодОбмена, ГУИД_ДК, СтруктураДанных", ПериодОбмена, ИдентификаторСтрокиПакетаДанных, НоваяЗапись.СтруктураДанных)); 
	КонецЦикла; 
	НаборЗаписей.Записать(); 
	
	Если Данные = Неопределено Тогда //формируем ответ для веб-сервиса
		Запись = Новый ЗаписьXML;
		Запись.УстановитьСтроку();
		Запись.ЗаписатьОбъявлениеXML();
		Запись.ЗаписатьНачалоЭлемента("Документ");
		Для Каждого ВхДанные Из МассивГУИДовДляОтвета Цикл
			Запись.ЗаписатьНачалоЭлемента("Шапка");
			Запись.ЗаписатьАтрибут("ID_DX", ВхДанные.ID_DX);
			Запись.ЗаписатьАтрибут("ГУИД_ДК", ВхДанные.ГУИД_ДК);
			Запись.ЗаписатьКонецЭлемента();
		КонецЦикла;
		Запись.ЗаписатьКонецЭлемента();
		ОтветXML = Запись.Закрыть();
		Результат = ОтветXML;
	Иначе //возвращаем массив для внешней обработки для записи ответа в файл
		Результат =  МассивГУИДовДляОтвета;
	КонецЕсли;
	
	//Евросиб Коханенко Н.А. 13.02.2025 (( #102758 
	//обрабатываем только по регламентному заданию
	//ОбработатьПолученныеДанныеВФоне(МассивДанных, ПериодОбмена);
	//Евросиб Коханенко Н.А. 13.02.2025 )) #102758
	
	Возврат Результат;
	
КонецФункции

//Евросиб СубботинВ #118799 09.10.2025 Начало
Функция ВыгрузитьКЗПвУПП(МассивСсылок, ТипДокументов) Экспорт
	
	//ГУИД = Новый Массив;
	//Для Каждого Ссылка Из МассивСсылок Цикл
	//	ГУИД.Добавить(Ссылка.УникальныйИдентификатор());
	//КонецЦикла;
	//
	Прокси = ВебСервисы_сервер.ПолучитьПрокси("ВебСервисЗаказовУПП");
	//XMLParams = ЕСОбменСервер.ПередатьДанныеПоЗаявкеНаОплатуДляЗаказа(ОбщегоНазначения.ЗначениеВСтрокуXML(ГУИД));  
	XMLParams = ЕСОбменСервер.ПередатьДанныеПоКорректировкеЗаказаПоставщику(МассивСсылок);
	ОтветУПП = Прокси.SubmitOrderChanges(XMLParams);
	ТаблицаОтвета = ОбщегоНазначения.ЗначениеИзСтрокиXML(ОтветУПП);
	
	Для Каждого СтрокаОтвета Из ТаблицаОтвета Цикл
		Если ЗначениеЗаполнено(СтрокаОтвета.Комментарий) Тогда
			ОбщегоНазначения.СообщитьПользователю("Документ не выгружен. Ошибки: " + СтрокаОтвета.Комментарий);			
			СсылкаФиксации = Справочники.ФиксацияИзмененийСчетаПоступления.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаОтвета.ГУИД));			
			РегистрыСведений.ОшибкиПриОбменах.ЗафиксироватьОшибку(СсылкаФиксации, Перечисления.УзлыОбмена.УППЗаказ, СтрокаОтвета.Комментарий);
		Иначе	
			СсылкаФиксации = Справочники.ФиксацияИзмененийСчетаПоступления.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаОтвета.ГУИД));
			СтруктураПоиска = Новый Структура("ДействиеПриОбмене, УзелОбмена, Объект", Перечисления.ДействияПриОбмене.ВыгрузкаДанных, 
			Перечисления.УзлыОбмена.УППЗаказ, СсылкаФиксации);
			СтруктураДанных = Новый Структура("УИДИсточника, Ответственный, НомерДатаВБУ, Статус",
							  СтрокаОтвета.СсылкаВходящегоДокумента,  Пользователи.АвторизованныйПользователь(), СтрокаОтвета.ПредставлениеЗаказаПоставщику, СтрокаОтвета.Статус);
			Сообщение = РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных, "Создана КЗП " + СтрокаОтвета.ПредставлениеЗаказаПоставщику);
			ОбщегоНазначения.СообщитьПользователю(Сообщение.Текст);
			ПланыОбмена.ВыгрузкаДанных.УдалитьРегистрациюИзменений(СсылкаФиксации, Перечисления.УзлыОбмена.УПП);
		КонецЕсли; 
	КонецЦикла;
	
КонецФункции 

Функция ПередатьДанныеПоКорректировкеЗаказаПоставщику(МассивДокументов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФиксацияИзмененийСчетаПоступленияИзменения.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_СсылкиИзменений
		|ИЗ
		|	Справочник.ФиксацияИзмененийСчетаПоступления.Изменения КАК ФиксацияИзмененийСчетаПоступленияИзменения
		|ГДЕ
		|	ФиксацияИзмененийСчетаПоступленияИзменения.Узел В (&Узел)
		|	И ФиксацияИзмененийСчетаПоступленияИзменения.Ссылка.ИзменяемыйДокумент В(&Объект)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ФиксацияИзмененийСчетаПоступленияИзмененияДокумента.Ссылка) КАК ГуидИзменений,
		|	ФиксацияИзмененийСчетаПоступленияИзмененияДокумента.Содержание КАК Содержание,
		|	ФиксацияИзмененийСчетаПоступленияИзмененияДокумента.Количество КАК Количество,
		|	ФиксацияИзмененийСчетаПоступленияИзмененияДокумента.Цена КАК Цена,
		|	ФиксацияИзмененийСчетаПоступленияИзмененияДокумента.Сумма КАК Сумма,
		|	ФиксацияИзмененийСчетаПоступленияИзмененияДокумента.СтавкаНДС КАК СтавкаНДС,
		|	ФиксацияИзмененийСчетаПоступленияИзмененияДокумента.СуммаНДС КАК СуммаНДС,
		|	ФиксацияИзмененийСчетаПоступленияИзмененияДокумента.Ссылка.ДатаИзменения КАК ДатаИзменения,
		|	ПротоколОбменов.УИДИсточника КАК Номенклатура,
		|	ПротоколОбменов1.УИДИсточника КАК ГуидЗаказа
		|ИЗ
		|	ВТ_СсылкиИзменений КАК ВТ_СсылкиИзменений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФиксацияИзмененийСчетаПоступления.ИзмененияДокумента КАК ФиксацияИзмененийСчетаПоступленияИзмененияДокумента
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		|			ПО ФиксацияИзмененийСчетаПоступленияИзмененияДокумента.Номенклатура = ПротоколОбменов.Объект
		|				И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
		|				И ФиксацияИзмененийСчетаПоступленияИзмененияДокумента.Номенклатура = ПротоколОбменов.Объект
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов1
		|			ПО ФиксацияИзмененийСчетаПоступленияИзмененияДокумента.Ссылка.ИзменяемыйДокумент = ПротоколОбменов1.Объект
		|				И (ПротоколОбменов1.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УППЗаказ))
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов2
		|			ПО ФиксацияИзмененийСчетаПоступленияИзмененияДокумента.Ссылка = ПротоколОбменов2.Объект
		|				И (ПротоколОбменов2.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УППЗаказ))
		|		ПО ВТ_СсылкиИзменений.Ссылка = ФиксацияИзмененийСчетаПоступленияИзмененияДокумента.Ссылка
		|ГДЕ
		|	ФиксацияИзмененийСчетаПоступленияИзмененияДокумента.Ссылка.ИзменяемыйДокумент В(&Объект)
		|	И НЕ ФиксацияИзмененийСчетаПоступленияИзмененияДокумента.Ссылка.ПометкаУдаления
		|	И ПротоколОбменов2.Объект ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Объект", МассивДокументов);
	УзлыОбмена = ПланыОбмена.ВыгрузкаДанных.ПолучитьУзелОбмена(Перечисления.УзлыОбмена.УПП);
	Запрос.УстановитьПараметр("Узел", УзлыОбмена);

	
	Товары = Запрос.Выполнить().Выгрузить(); 
	Шапки = Товары.Скопировать(,"ГуидЗаказа, ГуидИзменений, ДатаИзменения");
	Шапки.Свернуть("ГуидЗаказа, ГуидИзменений, ДатаИзменения");
	Результат = ОбщегоНазначения.ЗначениеВСтрокуXML(Новый Структура("Шапки, Товары", Шапки, Товары));
	
	Возврат Результат;
	
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//ЗаписьXML = Новый ЗаписьXML; 
	//ЗаписьXML.УстановитьСтроку();
	//ЗаписьXML.ЗаписатьОбъявлениеXML();	
	//ЗаписьXML.ЗаписатьНачалоЭлемента("Документы");
	//Пока ВыборкаДетальныеЗаписи.СледующийПоЗначениюПоля("ИзменяемыйДокумент") Цикл
	//	ЗаписьXML.ЗаписатьНачалоЭлемента("Заказ");
	//	
	//	ЗаписьXML.ЗаписатьНачалоЭлемента("Гуид");
	//	ЗаписьXML.ЗаписатьТекст(XMLСтрока(ВыборкаДетальныеЗаписи.ГуидИзменений));
	//	ЗаписьXML.ЗаписатьКонецЭлемента();
	//	
	//	ЗаписьXML.ЗаписатьНачалоЭлемента("ГуидЗаказ");
	//	ЗаписьXML.ЗаписатьТекст(XMLСтрока(ВыборкаДетальныеЗаписи.ГуидЗаказа));
	//	ЗаписьXML.ЗаписатьКонецЭлемента();
	//	
	//	ЗаписьXML.ЗаписатьНачалоЭлемента("ДатаИзменения");
	//	ЗаписьXML.ЗаписатьТекст(XMLСтрока(ВыборкаДетальныеЗаписи.ДатаИзменения));
	//	ЗаписьXML.ЗаписатьКонецЭлемента();		
	//	
	//	ЗаписьXML.ЗаписатьНачалоЭлемента("Товары");
	//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 	
	//		ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураКод");
	//		ЗаписьXML.ЗаписатьТекст(XMLСтрока(ВыборкаДетальныеЗаписи.Номенклатура));
	//		ЗаписьXML.ЗаписатьКонецЭлемента();
	//		
	//		ЗаписьXML.ЗаписатьНачалоЭлемента("Содержание");
	//		ЗаписьXML.ЗаписатьТекст(XMLСтрока(ВыборкаДетальныеЗаписи.Содержание));
	//		ЗаписьXML.ЗаписатьКонецЭлемента();
	//		
	//		ЗаписьXML.ЗаписатьНачалоЭлемента("Количество");
	//		ЗаписьXML.ЗаписатьТекст(XMLСтрока(ВыборкаДетальныеЗаписи.Количество));
	//		ЗаписьXML.ЗаписатьКонецЭлемента();
	//		
	//		ЗаписьXML.ЗаписатьНачалоЭлемента("Цена");
	//		ЗаписьXML.ЗаписатьТекст(XMLСтрока(ВыборкаДетальныеЗаписи.Цена));
	//		ЗаписьXML.ЗаписатьКонецЭлемента();
	//		
	//		ЗаписьXML.ЗаписатьНачалоЭлемента("Сумма");
	//		ЗаписьXML.ЗаписатьТекст(XMLСтрока(ВыборкаДетальныеЗаписи.Сумма));
	//		ЗаписьXML.ЗаписатьКонецЭлемента();
	//		
	//		ЗаписьXML.ЗаписатьНачалоЭлемента("СтавкаНДС");
	//		ЗаписьXML.ЗаписатьТекст(XMLСтрока(ВыборкаДетальныеЗаписи.СтавкаНДС));
	//		ЗаписьXML.ЗаписатьКонецЭлемента();
	//		
	//		ЗаписьXML.ЗаписатьНачалоЭлемента("СуммаНДС");
	//		ЗаписьXML.ЗаписатьТекст(XMLСтрока(ВыборкаДетальныеЗаписи.СуммаНДС));
	//		ЗаписьXML.ЗаписатьКонецЭлемента();
	//	КонецЦикла; 
	//	ЗаписьXML.ЗаписатьКонецЭлемента();
	//	ЗаписьXML.ЗаписатьКонецЭлемента();
	//КонецЦикла;
	//ЗаписьXML.ЗаписатьКонецЭлемента();
	
	//Возврат ЗаписьXML
	
КонецФункции	

//Евросиб СубботинВ #118799 09.10.2025 Конец

//Субботин 80932 21.02.2024 Начало
&НаСервере
Процедура ЗагрузитьАктуальныеКодыТНВЭДНаСервере() Экспорт 
	
	Попытка
		ADOConnection    				= Новый COMОбъект("ADODB.Connection");
		ADOConnection.provider			= "SQLOLEDB";		
		ДанныеПодключенияДляЗагрузкиТНВЭД = Константы.ДанныеПодключенияСервер.Получить();
		Если НЕ ЗначениеЗаполнено(ДанныеПодключенияДляЗагрузкиТНВЭД) Тогда
			ОбщегоНазначения.СообщитьПользователю("Не заполнены данные подключения для Загруки ТНВЭД");
			Возврат;
		КонецЕсли; 			
		ADOConnection.ConnectionString	= ДанныеПодключенияДляЗагрузкиТНВЭД; 
		ADOConnection.open();
		ADOCommand						= Новый COMObject("ADODB.Command");
		ADOCommand.ActiveConnection 	= ADOConnection;
	Исключение
		ОбщегоНазначения.СообщитьПользователю("Не удалось установить соединение с сервером:"+ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	АдресSQLТаблицыДляЗагрузкиТНВЭД = Константы.АдресSQLТаблицыДляЗагрузкиТНВЭД.Получить();
	Если не ЗначениеЗаполнено(АдресSQLТаблицыДляЗагрузкиТНВЭД) Тогда
			ОбщегоНазначения.СообщитьПользователю("Не заполнены данные Таблицы для Загруки ТНВЭД");
		Возврат;
	КонецЕсли; 			

	SQLQuery = " SELECT * FROM "+ АдресSQLТаблицыДляЗагрузкиТНВЭД +" where version = 2";			
			
	ADOCommand.CommandText = SQLQuery;
	ADORecordSet = ADOCommand.Execute();
	КоличествоПолей = ADORecordSet.Fields().Count-1;
	ТЗ = Новый ТаблицаЗначений;
	//Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025
	ТЗ.Колонки.Добавить("parentid",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(15)));
	ТЗ.Колонки.Добавить("id",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(15)));
	ТЗ.Колонки.Добавить("level",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(3,0)));
	ТЗ.Колонки.Добавить("code",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(20)));
	ТЗ.Колонки.Добавить("version",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10)));
	ТЗ.Колонки.Добавить("value",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(150)));
	//Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025
	Пока НЕ ADORecordSet.EOF Цикл
		НоваяСтрока = ТЗ.Добавить();
		Для Инд = 0 По КоличествоПолей Цикл
			ИмяПоля = СтрЗаменить(ADORecordSet.Fields(Инд).Name," ","");
			НоваяСтрока[ИмяПоля] = ADORecordSet.Fields(Инд).Value;
		КонецЦикла;
		ADORECORDSET.MoveNext();
	КонецЦикла;
	
	ADOConnection.Close();
	ADOConnection 	= Неопределено;
	ADOCommand		= Неопределено;
	
	//Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(СТРЗАМЕНИТЬ(ТЗ.parentid, &НПП, """") КАК СТРОКА(20)) КАК parentid,
		|	ВЫРАЗИТЬ(СТРЗАМЕНИТЬ(ТЗ.id, &НПП, """") КАК СТРОКА(20)) КАК id,
		|	ТЗ.level КАК level,
		|	ТЗ.code КАК code,
		|	ТЗ.version КАК version,
		|	ТЗ.value КАК value
		|ПОМЕСТИТЬ Вт_Выгрузка
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Вт_Выгрузка.parentid КАК parentid,
		|	Вт_Выгрузка.id КАК id,
		|	Вт_Выгрузка.level КАК level,
		|	Вт_Выгрузка.code КАК code,
		|	Вт_Выгрузка.version КАК version,
		|	Вт_Выгрузка.value КАК value,
		|	ЕСТЬNULL(ПротоколОбменов.Объект, НЕОПРЕДЕЛЕНО) КАК ОбъектСсылка,
		|	ЕСТЬNULL(ПротоколОбменовРодитель.Объект, НЕОПРЕДЕЛЕНО) КАК Родитель
		|ИЗ
		|	Вт_Выгрузка КАК Вт_Выгрузка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		|		ПО Вт_Выгрузка.id = ПротоколОбменов.УИДИсточника
		|			И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.NSI))
		|			И (ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменовРодитель
		|		ПО Вт_Выгрузка.parentid = ПротоколОбменовРодитель.УИДИсточника
		|			И (ПротоколОбменовРодитель.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.NSI))
		|			И (ПротоколОбменовРодитель.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))";
	Запрос.УстановитьПараметр("ТЗ",ТЗ);
	Запрос.УстановитьПараметр("НПП",Символы.НПП);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТЗ Из РезультатЗапроса цикл
		
		СпрСсылка = Справочники.ГрузыПоТНВЭД.СоздатьАктуализироватьКарточкуТНВЭД(СтрокаТЗ);
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЗ.ОбъектСсылка) Тогда	
			СтруктураПоиска = Новый Структура("ДействиеПриОбмене, УзелОбмена, Объект", Перечисления.ДействияПриОбмене.ЗагрузкаДанных, Перечисления.УзлыОбмена.NSI, СпрСсылка);
			СтруктураДанных = Новый Структура("УИДИсточника, ЗагрузкаПодтверждена, ДатаОбмена", СтрокаТЗ.id, Ложь, ТекущаяДата());
			РегистрыСведений.ПротоколОбменов.ЗафиксироватьИнформациюОЗагрузке(СтруктураПоиска, СтруктураДанных);			
		КонецЕсли;	
		
	КонецЦикла;
	//Евросиб Шевченко А.В. US 124456 TA 125854 10.12.2025
	
	//Для сч = 0 по 100 цикл
	//	Справочники.ГрузыПоТНВЭД.СоздатьАктуализироватьКарточкуТНВЭД(ТЗ[сч]);
	//КонецЦикла
	  
КонецПроцедуры
