///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// В данной процедуре следует описать дополнительные зависимости объектов метаданных
//   конфигурации, которые будут использоваться для связи настроек отчетов.
//
// Параметры:
//   СвязиОбъектовМетаданных - ТаблицаЗначений - таблица связей.
//       * ПодчиненныйРеквизит - Строка - имя реквизита подчиненного объекта метаданных.
//       * ПодчиненныйТип      - Тип    - тип подчиненного объекта метаданных.
//       * ВедущийТип          - Тип    - тип ведущего объекта метаданных.
//
Процедура ДополнитьСвязиОбъектовМетаданных(СвязиОбъектовМетаданных) Экспорт
	
	
	
КонецПроцедуры

// Вызывается в форме отчета и в форме настройки отчета перед выводом настройки 
// для указания дополнительных параметров выбора.
//
// Параметры:
//  Форма - УправляемаяФорма, Неопределено - форма отчета.
//  СвойстваНастройки - Структура - описание настройки отчета, которая будет выведена в форме отчета.
//      * ПолеКД - ПолеКомпоновкиДанных - выводимая настройка.
//      * ОписаниеТипов - ОписаниеТипов - тип выводимой настройки.
//      * ЗначенияДляВыбора - СписокЗначений - указать объекты, которые будут предложены пользователю в списке выбора.
//                            Дополняет список объектов, уже выбранных пользователем ранее.
//                            При этом не следует присваивать в этот параметр новый список значений.
//      * ЗапросЗначенийВыбора - Запрос - указать запрос для выборки объектов, которыми необходимо дополнить 
//                               ЗначенияДляВыбора. Первой колонкой (с индексом 0) должен выбираться объект,
//                               который следует добавить в ЗначенияДляВыбора.Значение.
//                               Для отключения автозаполнения в свойство ЗапросЗначенийВыбора.Текст следует записать пустую строку.
//      * ОграничиватьВыборУказаннымиЗначениями - Булево - указать Истина, чтобы ограничить выбор пользователя
//                                                значениями, указанными в ЗначенияДляВыбора (его конечным состоянием).
//      * Тип - Строка - краткий идентификатор типа свойства настроек компоновщика настроек компоновки данных.
//              См. ОтчетыСервер.ТипНастройкиСтрокой.
//
// Пример:
//   1. Для всех настроек типа СправочникСсылка.Пользователи скрыть и не разрешать выбирать помеченных на удаление, 
//   недействительных и служебных пользователей.
//
//   Если СвойстваНастройки.ОписаниеТипов.СодержитТип(Тип("СправочникСсылка.Пользователи")) Тогда
//     СвойстваНастройки.ОграничиватьВыборУказаннымиЗначениями = Истина;
//     СвойстваНастройки.ЗначенияДляВыбора.Очистить();
//     СвойстваНастройки.ЗапросЗначенийВыбора.Текст =
//       "ВЫБРАТЬ Ссылка ИЗ Справочник.Пользователи
//       |ГДЕ НЕ ПометкаУдаления И НЕ Недействителен И НЕ Служебный";
//   КонецЕсли;
//
//   2. Для настройки "Размер" предусмотреть дополнительное значение для выбора.
//
//   Если СвойстваНастройки.ПолеКД = Новый ПолеКомпоновкиДанных("ПараметрыДанных.Размер") Тогда
//     СвойстваНастройки.ЗначенияДляВыбора.Добавить(10000000, НСтр("ru = 'Больше 10 Мб'"));
//   КонецЕсли;
//
Процедура ПриОпределенииПараметровВыбора(Форма, СвойстваНастройки) Экспорт
	
КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
// См. "УправляемаяФорма.ПриСозданииНаСервере" в синтакс-помощнике и ОтчетыКлиентПереопределяемый.ОбработчикКоманды.
//
// Параметры:
//   Форма - УправляемаяФорма - форма отчета.
//   Отказ - Булево - признак отказа от создания формы.
//   СтандартнаяОбработка - Булево - признак выполнения стандартной (системной) обработки события.
//
// Пример:
//	//Добавление команды с обработчиком в ОтчетыКлиентПереопределяемый.ОбработчикКоманды:
//	Команда = ФормаОтчета.Команды.Добавить("МояОсобеннаяКоманда");
//	Команда.Действие  = "Подключаемый_Команда";
//	Команда.Заголовок = НСтр("ru = 'Моя команда...'");
//	
//	Кнопка = ФормаОтчета.Элементы.Добавить(Команда.Имя, Тип("КнопкаФормы"), ФормаОтчета.Элементы.<ИмяПодменю>);
//	Кнопка.ИмяКоманды = Команда.Имя;
//	
//	ФормаОтчета.ПостоянныеКоманды.Добавить(КомандаСоздать.Имя);
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт 
	//Евросиб Коханенко Н.А. #61705 01.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(Форма);
	//Евросиб Коханенко Н.А. #61705 01.12.2022 )
КонецПроцедуры 

// Вызывается в обработчике одноименного события формы отчета и формы настройки отчета.
// См. "Расширение управляемой формы для отчета.ПередЗагрузкойВариантаНаСервере" в синтакс-помощнике.
//
// Параметры:
//   Форма - УправляемаяФорма - форма отчета или настроек отчета.
//   НовыеНастройкиКД - НастройкиКомпоновкиДанных - настройки для загрузки в компоновщик настроек.
//
Процедура ПередЗагрузкойВариантаНаСервере(Форма, НовыеНастройкиКД) Экспорт
КонецПроцедуры

#КонецОбласти

//ДИТ Беляев СЮ, TA 41046, 18-11-2021 ++
Функция ПолучитьГУИДСтрокиРелизаПоКТК(вхРелизСобственникаСсылка, вхКТК)
	Результат = "";
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РелизСобственникаНоминации.ГУИДСтроки КАК ГУИДСтроки
		|ИЗ
		|	Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
		|ГДЕ
		|	РелизСобственникаНоминации.Ссылка = &Ссылка
		|	И РелизСобственникаНоминации.Контейнер = &Контейнер";
	
	Запрос.УстановитьПараметр("Контейнер", вхКТК);
	Запрос.УстановитьПараметр("Ссылка", вхРелизСобственникаСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат = ВыборкаДетальныеЗаписи.ГУИДСтроки;
	КонецЦикла;

	Возврат Результат;	
КонецФункции
//ДИТ Беляев СЮ, TA 41046, 18-11-2021 --

//ДИТ Беляев СЮ, TA 41046, 18-11-2021 ++
Функция ПолучитьРезультатЗапросаДиапазонаСНПизРегистра_ТекущиеДанныеСНП( вхКТК, вхДата )
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	стоки_КлиентскоеОперирование.КТК КАК КТК,
	               |	стоки_ТекущиеДанные_СНП.ГУИДЗаписи КАК ГУИДЗаписи,
	               |	стоки_ТекущиеДанные_СНП.От КАК От,
	               |	стоки_ТекущиеДанные_СНП.До КАК До,
	               |	стоки_ТекущиеДанные_СНП.Сумма КАК Сумма,
	               |	стоки_КлиентскоеОперирование.Период КАК Период
	               |ПОМЕСТИТЬ Т1
	               |ИЗ
	               |	РегистрСведений.стоки_КлиентскоеОперирование КАК стоки_КлиентскоеОперирование
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные_СНП КАК стоки_ТекущиеДанные_СНП
	               |		ПО стоки_КлиентскоеОперирование.ГУИДЗаписи = стоки_ТекущиеДанные_СНП.ГУИДЗаписи
	               |ГДЕ
	               |	стоки_КлиентскоеОперирование.КТК = &КТК
	               |	И КОНЕЦПЕРИОДА(стоки_КлиентскоеОперирование.Период, ДЕНЬ) <= КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Т1.От КАК От,
	               |	Т1.До КАК До,
	               |	Т1.Сумма КАК Стоимость
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		Т1.КТК КАК КТК,
	               |		МАКСИМУМ(Т1.Период) КАК Период
	               |	ИЗ
	               |		Т1 КАК Т1
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		Т1.КТК) КАК ВложенныйЗапрос
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Т1 КАК Т1
	               |		ПО ВложенныйЗапрос.Период = Т1.Период
	               |			И ВложенныйЗапрос.КТК = Т1.КТК";
	Запрос.УстановитьПараметр("КТК", вхКТК); 
	Запрос.УстановитьПараметр("Дата", вхДата);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
КонецФункции 
//ДИТ Беляев СЮ, TA 41046, 18-11-2021 --

//ДИТ Беляев СЮ, TA 41046, 18-11-2021 ++
Функция ПолучитьРасчетОписаниеСНПпоРелизу(вхРелизСобственникаСсылка, Знач вхГУИДСтрокиРелизНоминации = "", вхКТК, вхКоличествоДнейДляРасчета = 0, вхТипВозвращаемогоЗначения = "СуммаСНП", вхДата = Неопределено) Экспорт
	//вхТипВозвращаемогоЗначения = "СуммаСНП"
	//вхТипВозвращаемогоЗначения = "СтрокаОписанияДиапазонов"
	//вхТипВозвращаемогоЗначения = "СписокНастроекДиапазонов" 
	МаксимальноеЗначениеДиапазона = 999999;
	СтрокаОписанияДиапазонов = "";
	СуммаСНП = 0; 
	СписокНастроекДиапазонов = Новый СписокЗначений; 
	Если вхДата = Неопределено Тогда
		вхДата = ТекущаяДата();
	КонецЕсли;

	ДанныеНайдены = Ложь;
	Если вхРелизСобственникаСсылка <> Неопределено Тогда
		Если ТипЗнч(вхРелизСобственникаСсылка) = Тип("ДокументСсылка.РелизСобственника") Тогда  
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РелизСобственникаСНП.От КАК От,
			|	РелизСобственникаСНП.До КАК До,
			|	РелизСобственникаСНП.Стоимость КАК Стоимость
			|ИЗ
			|	Документ.РелизСобственника.СНП КАК РелизСобственникаСНП
			|ГДЕ
			|	РелизСобственникаСНП.Ссылка = &Ссылка
			|	И РелизСобственникаСНП.ГУИДСтроки = &ГУИДСтроки";
			
			Если НЕ ЗначениеЗаполнено(вхГУИДСтрокиРелизНоминации) Тогда
				вхГУИДСтрокиРелизНоминации = ПолучитьГУИДСтрокиРелизаПоКТК(вхРелизСобственникаСсылка, вхКТК);		
			КонецЕсли;
			
			Запрос.УстановитьПараметр("ГУИДСтроки", вхГУИДСтрокиРелизНоминации);
			Запрос.УстановитьПараметр("Ссылка", вхРелизСобственникаСсылка);
			РезультатЗапроса = Запрос.Выполнить();
			ДанныеНайдены = НЕ РезультатЗапроса.Пустой();
		КонецЕсли;
	КонецЕсли;		
	
	Если НЕ ДанныеНайдены Тогда
		РезультатЗапроса = ПолучитьРезультатЗапросаДиапазонаСНПизРегистра_ТекущиеДанныеСНП( вхКТК, вхДата );	
		ДанныеНайдены = НЕ РезультатЗапроса.Пустой();
	КонецЕсли;
		
	Если ДанныеНайдены Тогда	
	        ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
			#Область Фомирование_СтрокаОписанияДиапазонов 
			Если вхТипВозвращаемогоЗначения = "СтрокаОписанияДиапазонов" Тогда    
				//Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда               
				//	ВыборкаДетальныеЗаписи.Следующий();
				//	СтрокаОписанияДиапазонов = СокрЛП(ВыборкаДетальныеЗаписи.Стоимость);
				//Иначе
				//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
				//		//СтрокаОписанияДиапазонов = СтрокаОписанияДиапазонов + "От " + СокрЛП(ВыборкаДетальныеЗаписи.От)
				//		//							+  " до " + СокрЛП(ВыборкаДетальныеЗаписи.До) + " - "
				//		//							+ СокрЛП(ВыборкаДетальныеЗаписи.Стоимость) + Символы.ПС;  
				//		//ДИТ, Беляев СЮ, ТА 43624, 13-12-2021 ++
				//		ЧастьСтроки_ДО = " до " + СокрЛП(ВыборкаДетальныеЗаписи.До);
				//		Если ВыборкаДетальныеЗаписи.До=0 ИЛИ ВыборкаДетальныеЗаписи.До>=МаксимальноеЗначениеДиапазона Тогда
				//			ЧастьСтроки_ДО = ""; //конец диапазона не указываем, если =0 или МаксимальноеЗначениеДиапазона
				//		КонецЕсли;  
				//		СтрокаОписанияДиапазонов = СтрокаОписанияДиапазонов + "От " + СокрЛП(ВыборкаДетальныеЗаписи.От)
				//									+ ЧастьСтроки_ДО + " - "
				//									+ СокрЛП(ВыборкаДетальныеЗаписи.Стоимость) + Символы.ПС;   
				//		//ДИТ, Беляев СЮ, ТА 43624, 13-12-2021 --
				//	КонецЦикла;	
				//КонецЕсли; 
				//ДИТ, Беляев СЮ, ТА 43624, 13-12-2021 ++
				СтрокаОписанияДиапазонов = ПолучитьСтрокуОписанияДиапазонов(ВыборкаДетальныеЗаписи, МаксимальноеЗначениеДиапазона);
				//ДИТ, Беляев СЮ, ТА 43624, 13-12-2021 --
			КонецЕсли;
			#КонецОбласти
			
			#Область Расчет_СуммаСНП    
			Если вхКоличествоДнейДляРасчета>0 Тогда
				//ВсегоДнейПросрочкиРаспределить = вхКоличествоДнейДляРасчета;
				//ВыборкаДетальныеЗаписи.Сбросить();
				//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
				//	НачалоДиапазона = Макс(ВыборкаДетальныеЗаписи.От, 1); //часто диапазон начинается с 0, что будет являтся не значащим днем и исказит расчет 
				//	//КонецДиапазона = Макс(ВыборкаДетальныеЗаписи.До-1,0);  //делаем "-1", т.к. у нас диапазон "до" и на всякий случай не меньше нуля
				//	//ДИТ, Беляев СЮ, ТА 43624, 13-12-2021 ++
				//	КонецДиапазона = Макс(ВыборкаДетальныеЗаписи.До, 0);
				//	Если КонецДиапазона = 0 Тогда
				//		КонецДиапазона = МаксимальноеЗначениеДиапазона;
				//	КонецЕсли;
				//	//ДИТ, Беляев СЮ, ТА 43624, 13-12-2021 --
				//	СтоимостьДиапазона = ВыборкаДетальныеЗаписи.Стоимость;
				//	Разница = КонецДиапазона - вхКоличествоДнейДляРасчета;
				//	Если Разница>=0 Тогда                                      
				//		СуммаТекущегоДиапазона = ВсегоДнейПросрочкиРаспределить*СтоимостьДиапазона;  
				//		СуммаСНП = СуммаСНП + СуммаТекущегоДиапазона;			
				//		Прервать;
				//	КонецЕсли;   
				//	
				//	КолВоДнейТекущегоДиапазона = КонецДиапазона - НачалоДиапазона + 1; //+1 день, т.к. включается день начала диапазона
				//	СуммаТекущегоДиапазона = КолВоДнейТекущегоДиапазона * СтоимостьДиапазона;
				//	СуммаСНП = СуммаСНП + СуммаТекущегоДиапазона;
				//	ВсегоДнейПросрочкиРаспределить = вхКоличествоДнейДляРасчета - КонецДиапазона; //отнимаем весь диапазон, независимо от его начального значения, например диапазон 0-20 или 5-20  		
				//КонецЦикла;  
				//ДИТ, Беляев СЮ, ТА 43624, 13-12-2021 ++
				СуммаСНП = ПолучитьСуммуСНП(ВыборкаДетальныеЗаписи, МаксимальноеЗначениеДиапазона, вхКоличествоДнейДляРасчета);
				//ДИТ, Беляев СЮ, ТА 43624, 13-12-2021 --
			КонецЕсли;
			#КонецОбласти
	КонецЕсли;	
	
	Результат = "";
	Если вхТипВозвращаемогоЗначения = "СуммаСНП" Тогда 
		Результат = СуммаСНП;
	ИначеЕсли вхТипВозвращаемогоЗначения = "СтрокаОписанияДиапазонов" Тогда 
        Результат = СтрокаОписанияДиапазонов;
	ИначеЕсли вхТипВозвращаемогоЗначения = "СписокНастроекДиапазонов" Тогда 
		Результат = СписокНастроекДиапазонов;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции      
//ДИТ Беляев СЮ, TA 41046, 18-11-2021 -- 

//ДИТ, Беляев СЮ, ТА 43624, 13-12-2021 ++
Функция ПолучитьРасчетОписаниеСНПпоПротоколу(вхПротокол, вхРазмерКТК, вхКоличествоДнейДляРасчета = 0, вхТипВозвращаемогоЗначения = "СуммаСНП") Экспорт
	//вхТипВозвращаемогоЗначения = "СуммаСНП"
	//вхТипВозвращаемогоЗначения = "СтрокаОписанияДиапазонов"
	//вхТипВозвращаемогоЗначения = "СписокНастроекДиапазонов" 
	МаксимальноеЗначениеДиапазона = 999999;
	СтрокаОписанияДиапазонов = "";
	СуммаСНП = 0; 
	СписокНастроекДиапазонов = Новый СписокЗначений; 

	ДанныеНайдены = Ложь;
	Если вхПротокол <> Неопределено Тогда
		Если ТипЗнч(вхПротокол) = Тип("ДокументСсылка.ПСЦ") Тогда  
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПСЦСверхнормативноеПользование.ГУИДСтроки КАК ГУИДСтроки
			|ПОМЕСТИТЬ УслугаПоТипуКТК
			|ИЗ
			|	Документ.ПСЦ.СверхнормативноеПользование КАК ПСЦСверхнормативноеПользование
			|ГДЕ
			|	ПСЦСверхнормативноеПользование.Ссылка = &Ссылка
			|	И ПСЦСверхнормативноеПользование.Услуга = &Услуга
			|	И ПСЦСверхнормативноеПользование.ТипКТК = &РазмерКТК
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПСЦПрогрессивнаяШкалаСНП.От КАК От,
			|	ПСЦПрогрессивнаяШкалаСНП.До КАК До,
			|	ПСЦПрогрессивнаяШкалаСНП.Стоимость КАК Стоимость
			|ИЗ
			|	УслугаПоТипуКТК КАК УслугаПоТипуКТК
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПСЦ.ПрогрессивнаяШкалаСНП КАК ПСЦПрогрессивнаяШкалаСНП
			|		ПО УслугаПоТипуКТК.ГУИДСтроки = ПСЦПрогрессивнаяШкалаСНП.ГУИДСтроки
			|ГДЕ
			|	ПСЦПрогрессивнаяШкалаСНП.Ссылка = &Ссылка";
					
			Запрос.УстановитьПараметр("Ссылка", вхПротокол);
			Запрос.УстановитьПараметр("Услуга", Справочники.Номенклатура.СНПКонтейнеров);
			Запрос.УстановитьПараметр("РазмерКТК", вхРазмерКТК);
			РезультатЗапроса = Запрос.Выполнить();
			ДанныеНайдены = НЕ РезультатЗапроса.Пустой();
		КонецЕсли;
	КонецЕсли;		
	
	Если ДанныеНайдены Тогда	
	        ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
			#Область Фомирование_СтрокаОписанияДиапазонов 
			Если вхТипВозвращаемогоЗначения = "СтрокаОписанияДиапазонов" Тогда    
				//Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда               
				//	ВыборкаДетальныеЗаписи.Следующий();
				//	СтрокаОписанияДиапазонов = СокрЛП(ВыборкаДетальныеЗаписи.Стоимость);
				//Иначе
				//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
				//		//СтрокаОписанияДиапазонов = СтрокаОписанияДиапазонов + "От " + СокрЛП(ВыборкаДетальныеЗаписи.От)
				//		//							+  " до " + СокрЛП(ВыборкаДетальныеЗаписи.До) + " - "
				//		//							+ СокрЛП(ВыборкаДетальныеЗаписи.Стоимость) + Символы.ПС;  
				//		//ДИТ, Беляев СЮ, ТА 43624, 13-12-2021 ++
				//		ЧастьСтроки_ДО = " до " + СокрЛП(ВыборкаДетальныеЗаписи.До);
				//		Если ВыборкаДетальныеЗаписи.До=0 ИЛИ ВыборкаДетальныеЗаписи.До>=МаксимальноеЗначениеДиапазона Тогда
				//			ЧастьСтроки_ДО = ""; //конец диапазона не указываем, если =0 или МаксимальноеЗначениеДиапазона
				//		КонецЕсли;  
				//		СтрокаОписанияДиапазонов = СтрокаОписанияДиапазонов + "От " + СокрЛП(ВыборкаДетальныеЗаписи.От)
				//									+ ЧастьСтроки_ДО + " - "
				//									+ СокрЛП(ВыборкаДетальныеЗаписи.Стоимость) + Символы.ПС;   
				//		//ДИТ, Беляев СЮ, ТА 43624, 13-12-2021 --
				//	КонецЦикла;
				//КонецЕсли;  
				//ДИТ, Беляев СЮ, ТА 43624, 13-12-2021 ++
				СтрокаОписанияДиапазонов = ПолучитьСтрокуОписанияДиапазонов(ВыборкаДетальныеЗаписи, МаксимальноеЗначениеДиапазона);
				//ДИТ, Беляев СЮ, ТА 43624, 13-12-2021 --
			КонецЕсли;
			#КонецОбласти
			
			#Область Расчет_СуммаСНП    
			Если вхКоличествоДнейДляРасчета>0 Тогда
				//ВсегоДнейПросрочкиРаспределить = вхКоличествоДнейДляРасчета;
				//ВыборкаДетальныеЗаписи.Сбросить();
				//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
				//	НачалоДиапазона = Макс(ВыборкаДетальныеЗаписи.От, 1); //часто диапазон начинается с 0, что будет являтся не значащим днем и исказит расчет 
				//	//КонецДиапазона = Макс(ВыборкаДетальныеЗаписи.До-1,0);  //делаем "-1", т.к. у нас диапазон "до" и на всякий случай не меньше нуля
				//	//ДИТ, Беляев СЮ, ТА 43624, 13-12-2021 ++
				//	КонецДиапазона = Макс(ВыборкаДетальныеЗаписи.До, 0);
				//	Если КонецДиапазона = 0 Тогда
				//		КонецДиапазона = МаксимальноеЗначениеДиапазона;
				//	КонецЕсли;
				//	//ДИТ, Беляев СЮ, ТА 43624, 13-12-2021 --
				//	СтоимостьДиапазона = ВыборкаДетальныеЗаписи.Стоимость;
				//	Разница = КонецДиапазона - вхКоличествоДнейДляРасчета;
				//	Если Разница>=0 Тогда                                      
				//		СуммаТекущегоДиапазона = ВсегоДнейПросрочкиРаспределить*СтоимостьДиапазона;  
				//		СуммаСНП = СуммаСНП + СуммаТекущегоДиапазона;			
				//		Прервать;
				//	КонецЕсли;   
				//	
				//	КолВоДнейТекущегоДиапазона = КонецДиапазона - НачалоДиапазона + 1; //+1 день, т.к. включается день начала диапазона
				//	СуммаТекущегоДиапазона = КолВоДнейТекущегоДиапазона * СтоимостьДиапазона;
				//	СуммаСНП = СуммаСНП + СуммаТекущегоДиапазона;
				//	ВсегоДнейПросрочкиРаспределить = вхКоличествоДнейДляРасчета - КонецДиапазона; //отнимаем весь диапазон, независимо от его начального значения, например диапазон 0-20 или 5-20  		
				//КонецЦикла; 
				//ДИТ, Беляев СЮ, ТА 43624, 13-12-2021 ++
				СуммаСНП = ПолучитьСуммуСНП(ВыборкаДетальныеЗаписи, МаксимальноеЗначениеДиапазона, вхКоличествоДнейДляРасчета);
				//ДИТ, Беляев СЮ, ТА 43624, 13-12-2021 --
			КонецЕсли;
			#КонецОбласти
	КонецЕсли;	
	
	Результат = "";
	Если вхТипВозвращаемогоЗначения = "СуммаСНП" Тогда 
		Результат = СуммаСНП;
	ИначеЕсли вхТипВозвращаемогоЗначения = "СтрокаОписанияДиапазонов" Тогда 
        Результат = СтрокаОписанияДиапазонов;
	ИначеЕсли вхТипВозвращаемогоЗначения = "СписокНастроекДиапазонов" Тогда 
		Результат = СписокНастроекДиапазонов;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции  
//ДИТ, Беляев СЮ, ТА 43624, 13-12-2021 --

//ДИТ, Беляев СЮ, ТА 43624, 13-12-2021 ++
Функция ПолучитьСтрокуОписанияДиапазонов(ВыборкаДетальныеЗаписи, МаксимальноеЗначениеДиапазона)
	СтрокаОписанияДиапазонов = "";
	Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда               
		ВыборкаДетальныеЗаписи.Следующий();
		СтрокаОписанияДиапазонов = СокрЛП(ВыборкаДетальныеЗаписи.Стоимость);
	Иначе
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
			//СтрокаОписанияДиапазонов = СтрокаОписанияДиапазонов + "От " + СокрЛП(ВыборкаДетальныеЗаписи.От)
			//							+  " до " + СокрЛП(ВыборкаДетальныеЗаписи.До) + " - "
			//							+ СокрЛП(ВыборкаДетальныеЗаписи.Стоимость) + Символы.ПС;  
			//ДИТ, Беляев СЮ, ТА 43624, 13-12-2021 ++
			ЧастьСтроки_ДО = " до " + СокрЛП(ВыборкаДетальныеЗаписи.До);
			Если ВыборкаДетальныеЗаписи.До=0 ИЛИ ВыборкаДетальныеЗаписи.До>=МаксимальноеЗначениеДиапазона Тогда
				ЧастьСтроки_ДО = ""; //конец диапазона не указываем, если =0 или МаксимальноеЗначениеДиапазона
			КонецЕсли;  
			СтрокаОписанияДиапазонов = СтрокаОписанияДиапазонов + "От " + СокрЛП(ВыборкаДетальныеЗаписи.От)
			+ ЧастьСтроки_ДО + " - "
			+ СокрЛП(ВыборкаДетальныеЗаписи.Стоимость) + Символы.ПС;   
			//ДИТ, Беляев СЮ, ТА 43624, 13-12-2021 --
		КонецЦикла;	
	КонецЕсли;
	Возврат СтрокаОписанияДиапазонов;			
КонецФункции  
//ДИТ, Беляев СЮ, ТА 43624, 13-12-2021 --

//ДИТ, Беляев СЮ, ТА 43624, 13-12-2021 ++
Функция ПолучитьСуммуСНП(ВыборкаДетальныеЗаписи, МаксимальноеЗначениеДиапазона, вхКоличествоДнейДляРасчета)    
	СуммаСНП = 0;
	ВсегоДнейПросрочкиРаспределить = вхКоличествоДнейДляРасчета;
	ВыборкаДетальныеЗаписи.Сбросить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		НачалоДиапазона = Макс(ВыборкаДетальныеЗаписи.От, 1); //часто диапазон начинается с 0, что будет являтся не значащим днем и исказит расчет 
		//КонецДиапазона = Макс(ВыборкаДетальныеЗаписи.До-1,0);  //делаем "-1", т.к. у нас диапазон "до" и на всякий случай не меньше нуля
		//ДИТ, Беляев СЮ, ТА 43624, 13-12-2021 ++
		КонецДиапазона = Макс(ВыборкаДетальныеЗаписи.До, 0);
		Если КонецДиапазона = 0 Тогда
			КонецДиапазона = МаксимальноеЗначениеДиапазона;
		КонецЕсли;
		//ДИТ, Беляев СЮ, ТА 43624, 13-12-2021 --
		СтоимостьДиапазона = ВыборкаДетальныеЗаписи.Стоимость;
		Разница = КонецДиапазона - вхКоличествоДнейДляРасчета;
		Если Разница>=0 Тогда                                      
			СуммаТекущегоДиапазона = ВсегоДнейПросрочкиРаспределить*СтоимостьДиапазона;  
			СуммаСНП = СуммаСНП + СуммаТекущегоДиапазона;			
			Прервать;
		КонецЕсли;   
		
		КолВоДнейТекущегоДиапазона = КонецДиапазона - НачалоДиапазона + 1; //+1 день, т.к. включается день начала диапазона
		СуммаТекущегоДиапазона = КолВоДнейТекущегоДиапазона * СтоимостьДиапазона;
		СуммаСНП = СуммаСНП + СуммаТекущегоДиапазона;
		ВсегоДнейПросрочкиРаспределить = вхКоличествоДнейДляРасчета - КонецДиапазона; //отнимаем весь диапазон, независимо от его начального значения, например диапазон 0-20 или 5-20  		
	КонецЦикла;  
	Возврат СуммаСНП; 
КонецФункции     
//ДИТ, Беляев СЮ, ТА 43624, 13-12-2021 --