
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	Если Параметры.ЗначенияЗаполнения.Свойство("ЖДСтанция") Тогда
		Запись.ЖДСтанция = Параметры.ЗначенияЗаполнения.ЖДСтанция;
		Элементы.ЖДСтанция.ТолькоПросмотр = Истина;
	ИначеЕсли Параметры.ЗначенияЗаполнения.Свойство("Терминал") Тогда
		Запись.Терминал = Параметры.ЗначенияЗаполнения.Терминал;
		Элементы.Терминал.ТолькоПросмотр = Истина;
	ИначеЕсли Параметры.ЗначенияЗаполнения.Свойство("Порт") Тогда
		Запись.Порт = Параметры.ЗначенияЗаполнения.Порт;
		Элементы.Порт.ТолькоПросмотр = Истина;
	КонецЕсли; 
	Если Параметры.Свойство("ЗаблокированноеПоле") Тогда
		Элементы[Параметры.ЗаблокированноеПоле].ТолькоПросмотр = Истина;	
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ?(ЗначениеЗаполнено(Запись.ЖДСтанция), 1, 0) 
		+ ?(ЗначениеЗаполнено(Запись.Терминал), 1, 0)
		+ ?(ЗначениеЗаполнено(Запись.Порт), 1, 0) < 2 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить минимум 2 поля",,,,Отказ);
	КонецЕсли;
КонецПроцедуры

