
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидыТиповДанных = Новый Массив;
	ВидыТиповДанных.Добавить("ЖД рейс");
	ВидыТиповДанных.Добавить("Морской рейс");
	ВидыТиповДанных.Добавить("Нотис");
	
	Для Каждого ВидТипа Из ВидыТиповДанных Цикл
		НоваяСтрока = ВыборТипаДанных.Добавить();
		НоваяСтрока.НазваниеТипаДанных = ВидТипа;
	КонецЦикла
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборТипаДанныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.ВыборТипаДанных.ТекущиеДанные;
		
	Если ТекДанные <> Неопределено Тогда
		ПараметрыФормы = Новый Структура;
		ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораДанных", ЭтаФорма);
		Если ТекДанные.НазваниеТипаДанных = "Морской рейс" Тогда
			ОткрытьФорму("Справочник.РейсыМоре.ФормаВыбора", ПараметрыФормы, Элемент,,,, ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ИначеЕсли ТекДанные.НазваниеТипаДанных = "ЖД рейс" Тогда
			ПараметрыФормы = Новый Структура;
			ОткрытьФорму("Справочник.РейсыЖД.ФормаВыбора", ПараметрыФормы, Элемент,,,, ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе 
			ЗначениеОтбора = Новый Структура;
			ЗначениеОтбора.Вставить("Нотис", Истина);
			//ЗначениеОтбора.Вставить("ПометкаУдаления", Ложь);
			ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);
			ОткрытьФорму("Документ.ПСЦ.ФормаВыбора", ПараметрыФормы, Элемент,,,, ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбораДанных(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	Если Параметр1 <> Неопределено Тогда
		Закрыть(Параметр1);
	КонецЕсли;
	
КонецПроцедуры