
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокСтатусов = Новый СписокЗначений;
	СписокСтатусов.Добавить(Перечисления.СтатусыЭтапов.НаВыполнение);
	СписокСтатусов.Добавить(Перечисления.СтатусыЭтапов.ВРаботе);
	
	СписокСтатусовВыполнено = Новый СписокЗначений;
	СписокСтатусовВыполнено.Добавить(Перечисления.СтатусыЭтапов.Выполнен);
	
	// планируемые
	ПланируемыеЗадачи.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	ПользовательЪ = Новый Массив;
	ТекПользователь = Пользователи.ТекущийПользователь();
	
	// ДИТ Поморцева Т.П. 238786 20.08.2021 начало
	//ПользовательЪ.Добавить(текпользователь);
	//ПользовательЪ.Добавить(Пользователи_sd_сервер.ПодобратьЗамещениеОбратное(текпользователь, текущаяДата()));
	ПользовательЪ = Пользователи_sd_Сервер.ПодобратьЗамещениеОбратное(ТекПользователь, ТекущаяДата());
	// ДИТ Поморцева Т.П. 238786 20.08.2021 конец
	ПланируемыеЗадачи.Параметры.УстановитьЗначениеПараметра("Пользователь", ПользовательЪ);
	ПланируемыеЗадачи.Параметры.УстановитьЗначениеПараметра("ПоказатьНаблюдателем", Истина);
	ПланируемыеЗадачи.Параметры.УстановитьЗначениеПараметра("Статус",СписокСтатусов);
	
	// желтый порог
	ЗадачиЖелтыйПорог.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	ПользовательЪ = Новый Массив;
	ТекПользователь = Пользователи.ТекущийПользователь();
	
	// ДИТ Поморцева Т.П. 238786 20.08.2021 начало
	//ПользовательЪ.Добавить(текпользователь);
	//ПользовательЪ.Добавить(Пользователи_sd_сервер.ПодобратьЗамещениеОбратное(текпользователь, текущаяДата()));
	ПользовательЪ = Пользователи_sd_Сервер.ПодобратьЗамещениеОбратное(ТекПользователь, ТекущаяДата());
	// ДИТ Поморцева Т.П. 238786 20.08.2021 конец
	ЗадачиЖелтыйПорог.Параметры.УстановитьЗначениеПараметра("Пользователь", ПользовательЪ);
	ЗадачиЖелтыйПорог.Параметры.УстановитьЗначениеПараметра("ПоказатьНаблюдателем", Истина);
	ЗадачиЖелтыйПорог.Параметры.УстановитьЗначениеПараметра("Статус",СписокСтатусов);
	
	// красный порог
	ЗадачиКрасныйПорог.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	ПользовательЪ = Новый Массив;
	ТекПользователь = Пользователи.ТекущийПользователь();
	// ДИТ Поморцева Т.П. 238786 20.08.2021 начало
	//ПользовательЪ.Добавить(текпользователь);
	//ПользовательЪ.Добавить(Пользователи_sd_сервер.ПодобратьЗамещениеОбратное(текпользователь, текущаяДата()));
	ПользовательЪ = Пользователи_sd_Сервер.ПодобратьЗамещениеОбратное(ТекПользователь, ТекущаяДата());
	// ДИТ Поморцева Т.П. 238786 20.08.2021 конец

	ЗадачиКрасныйПорог.Параметры.УстановитьЗначениеПараметра("Пользователь", ПользовательЪ);
	ЗадачиКрасныйПорог.Параметры.УстановитьЗначениеПараметра("ПоказатьНаблюдателем", Истина);
	ЗадачиКрасныйПорог.Параметры.УстановитьЗначениеПараметра("Статус",СписокСтатусов);
	
	// выполнено
	ПользовательЪ = Новый Массив;
	ТекПользователь = Пользователи.ТекущийПользователь();
	// ДИТ Поморцева Т.П. 238786 20.08.2021 начало
	//ПользовательЪ.Добавить(текпользователь);
	//ПользовательЪ.Добавить(Пользователи_sd_сервер.ПодобратьЗамещениеОбратное(текпользователь, текущаяДата()));
	ПользовательЪ = Пользователи_sd_Сервер.ПодобратьЗамещениеОбратное(ТекПользователь, ТекущаяДата());
	// ДИТ Поморцева Т.П. 238786 20.08.2021 конец

	ВыполненныеЗадачи.Параметры.УстановитьЗначениеПараметра("Пользователь", ПользовательЪ);
	ВыполненныеЗадачи.Параметры.УстановитьЗначениеПараметра("ПоказатьНаблюдателем", Истина);
	ВыполненныеЗадачи.Параметры.УстановитьЗначениеПараметра("СтатусВыполнен",СписокСтатусовВыполнено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПланируемыеЗадачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьТекДокумент("ПланируемыеЗадачи");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТекДокумент(ИмяТекТбл)
	
	ТекД = Элементы[ИмяТекТбл].ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ПоказатьЗначение(,ТекД.Документ);
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗадачиЖелтыйПорогВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьТекДокумент("ЗадачиЖелтыйПорог");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиКрасныйПорогВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьТекДокумент("ЗадачиКрасныйПорог");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполненныеЗадачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьТекДокумент("ВыполненныеЗадачи");
	
КонецПроцедуры

&НаКлиенте
Процедура ПланируемыеЗадачиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиЖелтыйПорогПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиКрасныйПорогПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыполненныеЗадачиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СтатусВыполнено(Команда)
	
	ТекСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя;
	ТекТбл = СтрЗаменить(ТекСтраница,"Группа","");
	
	ТекД = Элементы[ТекТбл].ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзменитьРегистрОперативныеЗадачи(ТекД);
	
	Элементы.ВыполненныеЗадачи.Обновить();
	Элементы[ТекТбл].Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьРегистрОперативныеЗадачи(ТекСтр)
	
	МЗ = РегистрыСведений.ОперативныеЗадачи.СоздатьМенеджерЗаписи();
	МЗ.Исполнитель = ТекСтр.Исполнитель;
	МЗ.Задача = ТекСтр.Задача;
	МЗ.Документ = ТекСтр.Документ;
	МЗ.Наблюдатель = ТекСтр.Наблюдатель;
	МЗ.ВидДокумента = ТекСтр.ВидДокумента;
	МЗ.Вагон = ТекСтр.Вагон;
	МЗ.Контейнер = ТекСтр.Контейнер;
	МЗ.ДокументОснование = ТекСтр.ДокументОснование;

	МЗ.Прочитать();
	МЗ.Статус = Перечисления.СтатусыЭтапов.Выполнен;
	МЗ.ДатаВыполнения = ТекущаяДата();
	
	МЗ.Записать();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоОбластиПримененияПриИзменении(Элемент)
	//ЭлементОтбора = ПланируемыеЗадачи.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОбластьПрименения");
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	//ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ; // Опционально
	//ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ОбластьПрименения.Документы");
	
	ТекСписок = ПланируемыеЗадачи;
	УстановитьОтборПоОбластиПрименения(ТекСписок);
	
 КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоОбластиПрименения(ТекСписок)
	
 	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(ТекСписок, "ОбластьПрименения");
	
	Если ОтборПоОбластиПрименения = 1 Тогда
		ЗначОтбора = ПредопределенноеЗначение("Перечисление.ОбластьПрименения.Документы");
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекСписок, "ОбластьПрименения", ЗначОтбора, ВидСравненияКомпоновкиДанных.Равно);
	ИначеЕсли ОтборПоОбластиПрименения = 2 Тогда
		ЗначОтбора = ПредопределенноеЗначение("Перечисление.ОбластьПрименения.Задачи");
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ТекСписок, "ОбластьПрименения", ЗначОтбора, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ОтборПоОбластиПрименения2ПриИзменении(Элемент)
	
	ТекСписок = ЗадачиЖелтыйПорог;
	УстановитьОтборПоОбластиПрименения(ТекСписок);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоОбластиПрименения3ПриИзменении(Элемент)
	
	ТекСписок = ЗадачиКрасныйПорог;
	УстановитьОтборПоОбластиПрименения(ТекСписок);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоОбластиПрименения4ПриИзменении(Элемент)
	
	ТекСписок = ВыполненныеЗадачи;
	УстановитьОтборПоОбластиПрименения(ТекСписок);
	
КонецПроцедуры

&НаКлиенте
Процедура ПланируемыеЗадачиПриАктивизацииСтроки(Элемент)
	
	ДоступностьКнопкиСменыСтатуса("ПланируемыеЗадачи");
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступностьКнопкиСменыСтатуса(ТекСписок)
	
	ТекД = Элементы[ТекСписок].ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НаименованиеКнопки = Строка(ТекСписок) + "СтатусВыполнено";
	
	Если ТекД.ОбластьПрименения = ПредопределенноеЗначение("Перечисление.ОбластьПрименения.Документы") Тогда
		Элементы[НаименованиеКнопки].Доступность = Ложь
	Иначе
		Элементы[НаименованиеКнопки].Доступность = Истина;
	КонецЕсли;
		
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиКрасныйПорогПриАктивизацииСтроки(Элемент)
		
	ДоступностьКнопкиСменыСтатуса("ЗадачиКрасныйПорог");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиЖелтыйПорогПриАктивизацииСтроки(Элемент)
		
	ДоступностьКнопкиСменыСтатуса("ЗадачиЖелтыйПорог");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму(Команда)
	
	ТекСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя;
	ТекТбл = СтрЗаменить(ТекСтраница,"Группа","");
	
	ТекД = Элементы[ТекТбл].ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы[ТекТбл].Обновить();
	
КонецПроцедуры
