#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет привязку релиза клиента к строке табличной части "Список запросов на КТК" дкоумента "Заявка".
//
Процедура ПривязатьРелизКЗапросу(Заявка, ИдентификаторСтрокиЗаявки, РелизКлиента, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Заявка.Установить(Заявка);
	Набор.Отбор.ИдентификаторСтрокиЗаявки.Установить(ИдентификаторСтрокиЗаявки);
	//ДИТ Шевченко А.В. US 62488 ТА 68011 02.05.2023 -Начало
	Набор.Прочитать();
	Если Набор.Количество() Тогда
		Если Набор[0].РелизКлиента <> РелизКлиента Тогда
			Набор[0].РелизКлиента = РелизКлиента;
			Набор.Записать();			
			Документы.ЗапросНаАвтоперевозку.ОбновитьРелизВЗапросеНаАвто(РелизКлиента,ИдентификаторСтрокиЗаявки);
		КонецЕсли;
	Иначе
		НоваяЗапись = Набор.Добавить();
		НоваяЗапись.Заявка 						= Заявка;
		НоваяЗапись.ИдентификаторСтрокиЗаявки 	= ИдентификаторСтрокиЗаявки;
		НоваяЗапись.РелизКлиента 				= РелизКлиента;
		Набор.Записать();
	КонецЕсли;	
	
	//НоваяЗапись = Набор.Добавить();
	//НоваяЗапись.Заявка 						= Заявка;
	//НоваяЗапись.ИдентификаторСтрокиЗаявки 	= ИдентификаторСтрокиЗаявки;
	//НоваяЗапись.РелизКлиента 				= РелизКлиента;
	//Набор.Записать();
	//ДИТ Шевченко А.В. US 62488 ТА 68011 02.05.2023 -Конец
КонецПроцедуры

// Удаляет записи по тем строкам заявки (табличной части "Список запросов на КТК"), которые были удалены в документе.
//
Процедура ОчиститьЗаписиПоУдаленнымСтрокам(Заявка) Экспорт
	
	ТексЗапроса =
	"ВЫБРАТЬ
	|	ЗаявкаСписокЗапросНаКТК.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ЗаявкаСписокЗапросНаКТК.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втСтрокиЗаявки
	|ИЗ
	|	Документ.Заявка.СписокЗапросНаКТК КАК ЗаявкаСписокЗапросНаКТК
	|ГДЕ
	|	ЗаявкаСписокЗапросНаКТК.Ссылка = &Заявка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РелизыКлиентовЗапросовНаКТК.Заявка КАК Заявка,
	|	РелизыКлиентовЗапросовНаКТК.ИдентификаторСтрокиЗаявки КАК ИдентификаторСтрокиЗаявки
	|ПОМЕСТИТЬ втСтрокиРегистра
	|ИЗ
	|	РегистрСведений.РелизыКлиентовЗапросовНаКТК КАК РелизыКлиентовЗапросовНаКТК
	|ГДЕ
	|	РелизыКлиентовЗапросовНаКТК.Заявка = &Заявка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСтрокиРегистра.ИдентификаторСтрокиЗаявки КАК ИдентификаторСтрокиЗаявки
	|ИЗ
	|	втСтрокиРегистра КАК втСтрокиРегистра
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСтрокиЗаявки КАК втСтрокиЗаявки
	|		ПО втСтрокиРегистра.Заявка = втСтрокиЗаявки.Ссылка
	|			И втСтрокиРегистра.ИдентификаторСтрокиЗаявки = втСтрокиЗаявки.ИдентификаторСтроки
	|ГДЕ
	|	втСтрокиЗаявки.Ссылка ЕСТЬ NULL";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТексЗапроса;
	Запрос.УстановитьПараметр("Заявка", Заявка);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		УстановитьПривилегированныйРежим(Истина);
		Набор = СоздатьНаборЗаписей();
		Набор.Отбор.Заявка.Установить(Заявка);
		Набор.Отбор.ИдентификаторСтрокиЗаявки.Установить(Выборка.ИдентификаторСтрокиЗаявки);
		Набор.Записать();
		
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли
