
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	Для Каждого Стр Из ЭтотОбъект Цикл   
		Если ЗначениеЗаполнено(Стр.Терминал) Тогда   
			Стр.ТипИсточникаИнформации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Терминал, "ТипПодрядчика");
			Стр.АдресМестаОперацииСКТК = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Терминал, "Адрес"); //ДИТ Шевченко А.В. US 62485 ТА 59970 28.04.2023
		//Евросиб(ДИТ) Антонова А.С. BUG 111585 ТА 112390 Начало 11.07.2025
		Иначе
			Стр.ТипИсточникаИнформации = Перечисления.ТипПодрядчикаТерминал.Терминал;
		//Евросиб(ДИТ) Антонова А.С. BUG 111585 ТА 112390 Конец 11.07.2025	
		КонецЕсли;
		Если Стр.СпособВнесенияДанных = ПредопределенноеЗначение("Перечисление.СпособыВнесенияДанныхТерминал.Ручной") Тогда   
			Стр.ФИОСотрудникаЕвросиб = Пользователи.ТекущийПользователь();
		Иначе 
			Стр.СпособВнесенияДанных = ПредопределенноеЗначение("Перечисление.СпособыВнесенияДанныхТерминал.Автоматический");
			Если Не ЗначениеЗаполнено(Стр.ФИОСотрудникаЕвросиб) Тогда
				Стр.ФИОСотрудникаЕвросиб = "auto"; 
			КонецЕсли;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Стр.ДатаВнесенияДанных) Тогда
			Стр.ДатаВнесенияДанных = ТекущаяДата();
		КонецЕсли;
		
		// ++ ДИТ_Агафонов_task 54348 11.07.2022
		//Если Не ЗначениеЗаполнено(Стр.НомерКонтейнера) Тогда
		//	Отказ = Истина;	
		//КонецЕсли;
		РегистрыСведений.ИнформацияОтТерминалов.ПроверитьЗапись(Стр);
		//// -- ДИТ_Агафонов_task 54348 11.07.2022
		
		//ДИТ, Беляев СЮ, BUG 67625/TA 69423, 06-06-2023, начало (временно заполняем ресурс из измерения)
		//Стр.КодТерминалаРесурс = Стр.КодТерминала; //ДИТ, Беляев СЮ, BUG 67625/TA 72362, 07-07-2023, закомментировал
		//ДИТ, Беляев СЮ, BUG 67625/TA 69423, 06-06-2023, конец
	КонецЦикла;
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	//Поставим все релизы в очередь
	ОтложенноеИзменениеСервер.ПоставитьСвязанныеОбъектыВОчередьИзменения(ЭтотОбъект);
	
	Источник = ЭтотОбъект;
	
	ТЗ = Источник.Выгрузить();
	
	ДатаНачалаЗагрузки = Константы.НачальнаяДатаЗагрузкиИнформацииОтТерминаловВЧистыйСток.Получить(); //Шевченко А.В. US 118463 TA 131308 04.03.2026
	
	Для Каждого СтрокаТЗ Из ТЗ Цикл   
		
		//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112632 Начало 23.06.2025
		Если СтрокаТЗ.СпособВнесенияДанных <> Перечисления.СпособыВнесенияДанныхТерминал.Автоматический Тогда
			Продолжить;
		КонецЕсли;
		//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112632 Конец 23.06.2025
		
		//Евросиб(ДИТ) Антонова А.С. Ticket#0392343 Начало 27.03.2025
		УстановитьПривилегированныйРежим(Истина);
		//Евросиб(ДИТ) Антонова А.С. Ticket#0392343 Конец 27.03.2025
		
		Приемник = РегистрыСведений.ИнформацияОтТерминаловCodeco.СоздатьМенеджерЗаписи();
		
		ЗаполнитьЗначенияСвойств(Приемник,СтрокаТЗ);
		Приемник.Контейнер = СтрокаТЗ.Контейнер;
		Приемник.ДатаОперации = СтрокаТЗ.Период;
		
		//Шевченко А.В. US 118372 TA 118375 04.09.2025
		//Шевченко А.В. US 118372 TA 127282 30.12.2025
		//Если СтрокаТЗ.Период > КонецДня(ТекущаяДата()) Тогда
		Если СтрокаТЗ.Период > КонецДня(КонецДня(ТекущаяДата())+1) ИЛИ СтрокаТЗ.Период < ДатаНачалаЗагрузки Тогда //Шевченко А.В. US 118463 TA 131308 04.03.2026
		//Шевченко А.В. US 118372 TA 127282 30.12.2025
			Продолжить;
		КонецЕсли;
		//Шевченко А.В. US 118372 TA 118375 04.09.2025
		
		//Евросиб(ДИТ) Антонова А.С. BUG 111585 ТА 114161 Начало 15.07.2025
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЗ.Терминал, "ПометкаУдаления") = Ложь Тогда
			Приемник.Терминал = СтрокаТЗ.Терминал;	      
		Иначе	
		    Приемник.Терминал = Справочники.Локации.ПустаяСсылка(); 
			//Если есть запись такая же с помеченным на удаление терминалом, то удалим ее
			ЗаписьКУдалению	= РегистрыСведений.ИнформацияОтТерминаловCodeco.СоздатьНаборЗаписей();
			ЗаписьКУдалению.Отбор.Контейнер.Установить(СтрокаТЗ.Контейнер, Истина);
			ЗаписьКУдалению.Отбор.ДатаОперации.Установить(СтрокаТЗ.Период, Истина);   
			ЗаписьКУдалению.Отбор.Терминал.Установить(СтрокаТЗ.Терминал, Истина);
			ЗаписьКУдалению.Прочитать(); 
			Если ЗаписьКУдалению.Количество() > 0 Тогда
				ЗаписьКУдалению.Удалить(0);
			КонецЕсли;  
			ЗаписьКУдалению.Записать();
		КонецЕсли;
		//Евросиб(ДИТ) Антонова А.С. BUG 111585 ТА 114161 Конец 15.07.2025
		
		//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112632 Начало 23.06.2025
		Если не ЗначениеЗаполнено(Приемник.Контейнер) Тогда
		//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112632 Конец 23.06.2025
			// + ДИТ Кузнецов Е.Е. US 78754 ТА 98408 20.05.2025
			СправочникОшибки = Неопределено;
			Обработки.АРМ_ЧистыйСток.ПроверитьСоздатьКТКЗаписьОтТерминалов(Приемник.Контейнер,СтрокаТЗ.НомерКонтейнера,СтрокаТЗ.РазмерКТК,Ложь,СправочникОшибки);
			Приемник.ОшибкиПриЗагрузкеИнформацииОтТерминалов = СправочникОшибки;
			// - ДИТ Кузнецов Е.Е. US 78754 ТА 98408 20.05.2025  
		//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112632 Начало 23.06.2025
		КонецЕсли;
		//Евросиб(ДИТ) Антонова А.С. US 112575 ТА 112632 Конец 23.06.2025
		
		Приемник.Записать(Истина);         
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

