
//Процедура ПриЗаписи(Отказ, Замещение)
//	// для каждого ПТУ переписывать таблицу с маршрутизацией, если документ пришел из Диадока
//	Для Каждого ТекСтрока Из ЭтотОбъект Цикл
//		Если (ТипЗнч(ТекСтрока.Объект) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") ИЛИ 
//				ТипЗнч(ТекСтрока.Объект) = Тип("ДокументСсылка.КорректировкаПоступления")) И
//			(ТекСтрока.УзелОбмена = Перечисления.УзлыОбмена.Диадок ИЛИ 
//				ТекСтрока.УзелОбмена = Перечисления.УзлыОбмена.РИТМ) Тогда
//			ПОлучОб = ТекСтрока.Объект.ПолучитьОбъект();
//						
//			ТЧСостояния = ПолучОб.Состояния;
//			ТЧСостояния.Очистить();
//			
//			ПараметрыЗапроса = Новый Соответствие;
//			ПараметрыЗапроса.Вставить("ОбъектМаршрутизации", ПОлучОб.Ссылка);
//			ПараметрыЗапроса.Вставить("Организация", ПОлучОб.Организация);
//			ПараметрыЗапроса.Вставить("Контрагент", ПОлучОб.Контрагент);
//			ПараметрыЗапроса.Вставить("Договор", ПОлучОб.ДоговорКонтрагента);
//			ПараметрыЗапроса.Вставить("Штраф", ПОлучОб.Штраф);
////Евросиб Гудкова( 10.08.2020
//			ПараметрыЗапроса.Вставить("Копия", ПОлучОб.Копия);
//// Евросиб Гудкова)
//			//ПараметрыЗапроса.Вставить("РазнесеноПолностью", ПОлучОб.РазнесеноПолностью);
//			Если ТипЗнч(ТекСтрока.Объект) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
//				РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьПТУ(ПараметрыЗапроса, ПОлучОб.Дата);
//			Иначе
//				РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьКорректировкуПоступления(ПараметрыЗапроса, ПОлучОб.Дата);
//			КонецЕсли;
//			
//			Если РезультатЗапроса.Количество() > 0 Тогда
//				УказанныеВручнуюИспНаблюдатель = Новый СписокЗначений;
//				МаршрутизацияСервер.ПрименитьМаршрут(ПОлучОб, РезультатЗапроса, неопределено, УказанныеВручнуюИспНаблюдатель);			
//			КонецЕсли;
//			
//			//Если РезультатЗапроса.Количество() > 0 Тогда
//			//	ПримененныйМаршрут = РезультатЗапроса[0].Ссылка;
//			//	Для каждого Стр из РезультатЗапроса Цикл
//			//		ЗаполнитьЗначенияСвойств(ТЧСостояния.Добавить(), Стр);
//			//	КонецЦикла;
//			//КонецЕсли;
//			
//			ПОлучОб.Записать();
//			
//		ИначеЕсли ТипЗнч(ТекСтрока.Объект) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") И
//			(ТекСтрока.УзелОбмена = Перечисления.УзлыОбмена.Диадок ИЛИ ТекСтрока.УзелОбмена = Перечисления.УзлыОбмена.РИТМ) Тогда
//			ПОлучОб = ТекСтрока.Объект.ПолучитьОбъект();
//			ТЧСостояния = ПолучОб.Состояния;
//			ТЧСостояния.Очистить();
//			
//			ПараметрыЗапроса = Новый Соответствие;
//			ПараметрыЗапроса.Вставить("ОбъектМаршрутизации", ПОлучОб.Ссылка);
//			ПараметрыЗапроса.Вставить("Организация", ПОлучОб.Организация);
//			ПараметрыЗапроса.Вставить("Контрагент", ПОлучОб.Контрагент);
//			ПараметрыЗапроса.Вставить("Договор", ПОлучОб.ДоговорКонтрагента);
//			ПараметрыЗапроса.Вставить("СчетПоставщикаБезКомплекта", НЕ ПОлучОб.ВСоставеКомплекта);
//			РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьСчетПоставщика(ПараметрыЗапроса, ПОлучОб.Дата);
//			Если РезультатЗапроса.Количество() > 0 Тогда
//				ПримененныйМаршрут = РезультатЗапроса[0].Ссылка;
//				Для каждого Стр из РезультатЗапроса Цикл
//					ЗаполнитьЗначенияСвойств(ТЧСостояния.Добавить(), Стр);
//				КонецЦикла;
//			КонецЕсли;
//			
//			ПОлучОб.Записать();
//			
//		КонецЕсли;
//	КонецЦикла;
//КонецПроцедуры
