#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
	//	Возврат;
	//КонецЕсли;
	//
	//Владелец = Неопределено;
	//
	//Если Параметры.Свойство("Отбор") 
	//	И Параметры.Отбор.Свойство("Владелец") Тогда

	//	Владелец = Параметры.Отбор.Владелец;

	//КонецЕсли;	
	//
	//Если Владелец <> Справочники.НаборыУпаковок.БазовыеЕдиницыИзмерения Тогда
	//	ТекстИсключения = НСтр("ru = 'Форма предназначена для отображения только списка единиц упаковок.'");
	//	ВызватьИсключение ТекстИсключения;
	//КонецЕсли;	
	//Элементы.ПодобратьИзКлассификатора.Видимость = ПравоДоступа("Добавление", Метаданные.Справочники.УпаковкиЕдиницыИзмерения);
	//
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )



#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодобратьИзКлассификатора(Команда)
	
	ОткрытьФорму("Справочник.ВМТП_КлассификаторУпаковок.Форма.КлассификаторУпаковок",
				,
				,
				,
				,
				,
				Новый ОписаниеОповещения("ПодобратьИзКлассификатораЗавершение", ЭтотОбъект),
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьИзКлассификатораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура")
		И Результат.Свойство("КоличествоНовыхЭлементов") Тогда
		
		НоменклатураКлиент.ОповеститьОбИзмененииСпискаВыбораЕдиницИзмерения(Результат.КоличествоНовыхЭлементов,
			Результат.НовыеЭлементы);
		
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти
