&НаКлиенте
Процедура ОтборПоКТКИзExcel(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВставкиКТКExcel"
		, ЭтаФорма
		, Новый Структура("КТК", Истина));
		
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена"
		, Новый Структура("КТК", Истина), 
		, ЭтаФорма.УникальныйИдентификатор, ,
		, ОписаниеОповещения
		, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВставкиКТКExcel(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 <> неопределено И Параметр2 <> неопределено И Параметр2.Свойство("КТК") Тогда
		
		СписокКТКОтбор.ЗагрузитьЗначения(Параметр1);
		Если СписокКТКОтбор.Количество() = 0 Тогда
			Список.Параметры.УстановитьЗначениеПараметра("ПустойСписокКТК",Истина);
		Иначе
			Список.Параметры.УстановитьЗначениеПараметра("ПустойСписокКТК",Ложь);
			Список.Параметры.УстановитьЗначениеПараметра("СписокКТК",СписокКТКОтбор);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКТКОтборПриИзменении(Элемент)

	УстановитьОтборПоКТК();

КонецПроцедуры

&НаКлиенте
Процедура ОтборПоВагонамИзExcel(Команда)

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВставкиВагоновExcel"
		, ЭтаФорма
		, Новый Структура("Вагоны", Истина));
		
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена"
		, Новый Структура("Вагоны", Истина), 
		, ЭтаФорма.УникальныйИдентификатор, ,
		, ОписаниеОповещения
		, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВставкиВагоновExcel(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 <> неопределено И Параметр2 <> неопределено И Параметр2.Свойство("Вагоны") Тогда
		
		СписокВагоныОтбор.ЗагрузитьЗначения(Параметр1);
		
		УстановитьОтборПоВагонам();	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВагоныОтборПриИзменении(Элемент)

	УстановитьОтборПоВагонам();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокРефСцепыОтборПриИзменении(Элемент)
	
	УстановитьОтборПоРефСцепам();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКлиентыОтборНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыОтбора= Новый Структура("ТипКонтрагента_Клиент, МножественныйВыбор", Истина, Истина);

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораКлиентов", ЭтаФорма);
	
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора"
		, ПараметрыОтбора
		, Элемент
		, ЭтаФорма.УникальныйИдентификатор,,
		, ОписаниеОповещения
		, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&наКлиенте
Процедура ОбработкаВыбораКлиентов(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если ТипЗнч(Параметр1) = Тип("Массив") Тогда
		СписокКлиентыОтбор.ЗагрузитьЗначения(Параметр1);
		УстановитьОтборПоКлиентам();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКлиентыОтборПриИзменении(Элемент)
	УстановитьОтборПоКлиентам()
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоКТК()
	Если СписокКТКОтбор.Количество() = 0 Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ПустойСписокКТК",Истина);
		Список.Параметры.УстановитьЗначениеПараметра("СписокКТК",СписокКТКОтбор);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ПустойСписокКТК",Ложь);
		Список.Параметры.УстановитьЗначениеПараметра("СписокКТК",СписокКТКОтбор);
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьОтборПоВагонам()
	
	Если СписокВагоныОтбор.Количество() = 0 Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ПустойСписокВагоны",Истина);
		Список.Параметры.УстановитьЗначениеПараметра("СписокВагоны",СписокВагоныОтбор);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ПустойСписокВагоны",Ложь);
		Список.Параметры.УстановитьЗначениеПараметра("СписокВагоны",СписокВагоныОтбор);
	КонецЕсли;	

КонецПроцедуры	

&НаКлиенте
Процедура УстановитьОтборПоРефСцепам()
	
	Если СписокРефСцепыОтбор.Количество() = 0 Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ПустойСписокРефСцепы",Истина);
		Список.Параметры.УстановитьЗначениеПараметра("СписокРефСцепы",СписокРефСцепыОтбор);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ПустойСписокРефСцепы",Ложь);
		Список.Параметры.УстановитьЗначениеПараметра("СписокРефСцепы",СписокРефСцепыОтбор);
	КонецЕсли;

КонецПроцедуры	

&НаКлиенте
Процедура УстановитьОтборПоКлиентам()
	
	Если СписокКлиентыОтбор.Количество() = 0 Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ПустойСписокКлиенты",Истина);
		Список.Параметры.УстановитьЗначениеПараметра("СписокКлиенты",СписокКлиентыОтбор);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ПустойСписокКлиенты",Ложь);
		Список.Параметры.УстановитьЗначениеПараметра("СписокРефСцепы",СписокКлиентыОтбор);
	КонецЕсли;

КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборПоКТК();
	УстановитьОтборПоВагонам();	
	УстановитьОтборПоРефСцепам();
	УстановитьОтборПоКлиентам();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокРефСцепыОтборНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	РефСцепыДокументов = ЗаполнитьСписокРефСцепыДокументов();
	
	ОповещениеПослеВыбора = Новый ОписаниеОповещения(
	"ВыбратьРефСцепЗавершение", ЭтотОбъект);
	
	РефСцепыДокументов.ПоказатьОтметкуЭлементов(
	ОповещениеПослеВыбора, "Выберите реф.сцепы");

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьРефСцепЗавершение(Элементы, Параметры) Экспорт
	Если Элементы <> Неопределено Тогда
		СписокРефСцепыОтбор.Очистить();
		Для Каждого РефСцеп Из Элементы Цикл
			Если РефСцеп.Пометка Тогда
				СписокРефСцепыОтбор.Добавить(РефСцеп.Значение);
			КонецЕсли;
		КонецЦикла;
		УстановитьОтборПоРефСцепам();		
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьСписокРефСцепыДокументов()
	
	РефСцепыДокументов = Новый СписокЗначений; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РефСцепДокументов.РефСцеп КАК РефСцеп
		|ИЗ
		|	Документ.РефСцеп КАК РефСцепДокументов
		|
		|СГРУППИРОВАТЬ ПО
		|	РефСцепДокументов.РефСцеп
		|
		|УПОРЯДОЧИТЬ ПО
		|	РефСцеп";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РефСцепыДокументов.Добавить(ВыборкаДетальныеЗаписи.РефСцеп);
	КонецЦикла;
	
	Возврат РефСцепыДокументов;

КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.	//Евросиб Коханенко Н.А. #61705 20.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 20.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 20.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 20.12.2022 )
