
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПериодРеестра.ДатаНачала = Объект.ПериодРеестраНачало;
	ПериодРеестра.ДатаОкончания = Объект.ПериодРеестраОкончание;
	
	// Обновляем панель текущего пользователя и панель состояний
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	
	Элементы.ГруппаСостояния.Видимость = РольДоступна("ПолныеПрава");
	
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )



// Процедура обновляет панель текущего пользователя
&НаСервере
Процедура ОбновитьПанельТекущегоПользователя()
	
	МаршрутизацияСервер.ОбновитьПанельТекущегоПользователя(Объект, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
КонецПроцедуры

// Функция обновляет панель состояний документа для графического отражения его движения по состояниям
&НаСервере
Процедура ОбновитьПанельСостояний()
	
	МаршрутизацияСервер.ОбновитьПанельСостояний(ЭтотОбъект);
	
КонецПроцедуры

// Этот обработчик вызывается при нажатии на состояния на панели состояний
// Ссылка на него устанавливается кодом, поэтому при проверке конфигурации 1с может сказать, что эта функция не испольузется
// Не верьте 1с!
&НаКлиенте
Процедура ОбработчикНажатияПлитокСостояния(П1 = неопределено, П2 = неопределено) Экспорт
	МаршрутизацияКлиент.ОбработчикНажатияНаПлиткуОбщий(П1, П2);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.ПереченьКонтейнеров.Количество()>0 Тогда
		Элементы.Группа1.Видимость = Истина;
		Элементы.Группа2.Видимость = Ложь;
	ИначеЕсли Объект.ПереченьВагонов.Количество()>0 Тогда
		Элементы.Группа1.Видимость = Ложь;
		Элементы.Группа2.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТекущийИсполнитель_СтатусПриИзменении(Элемент)
	
	МаршрутизацияКлиент.ТекущийИсполнитель_СтатусПриИзменении(Объект, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
	ОбновитьПанельСостояний();
	
КонецПроцедуры

//ДИТ, Беляев СЮ, Ticket#0285135, 09-09-2022, начало
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ЕстьРеестрСАналогичнымНаименованием(Объект.Ссылка, Объект.Клиент, Объект.Наименование) Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Запись отменена, уже есть Реестр с аналогичным наименованием! Требуется изменить наименование на уникальное",
													,"Объект.Наименование");
	КонецЕсли;		
КонецПроцедуры
//ДИТ, Беляев СЮ, Ticket#0285135, 09-09-2022, конец

//ДИТ, Беляев СЮ, Ticket#0285135, 09-09-2022, начало
&НаСервереБезКонтекста
Функция ЕстьРеестрСАналогичнымНаименованием(вхСсылка, вхКлиент, вхНаименование)
	Возврат Справочники.РеестрыСогласования.ЕстьРеестрСАналогичнымНаименованием(вхСсылка, вхКлиент, вхНаименование);
КонецФункции
//ДИТ, Беляев СЮ, Ticket#0285135, 09-09-2022, конец