
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ПеренестиВДокумент Тогда
		//ДИТ Авдеева В.С. 43329 29.04.2022 Начало
		//было
		//СтруктураРезультат = Новый Структура("Грузоотправитель,Грузополучатель,ГлавныйБухгалтер,Руководитель,АдресДоставки,ЗаРуководителяНаОсновании,ЗаГлавногоБухгалтераНаОсновании,ДоверенностьЗаРуководителя,ДоверенностьЗаГлБухгалтера,БезДоверенностей");
		//стало
		СтруктураРезультат = Новый Структура("Грузоотправитель,Грузополучатель,ГлавныйБухгалтер,Руководитель,АдресДоставки,ЗаРуководителяНаОсновании,ЗаГлавногоБухгалтераНаОсновании,ДоверенностьЗаРуководителя,ДоверенностьЗаГлБухгалтера,БезДоверенностей,РуководительКонтрагента");
		//ДИТ Авдеева В.С. 43329 29.04.2022 Конец
		ЗаполнитьЗначенияСвойств(СтруктураРезультат,ЭтаФорма);
		ОповеститьОВыборе(СтруктураРезультат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	ПеренестиВДокумент = Истина;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	ПеренестиВДокумент = Ложь;
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ДИТ Авдеева В.С. 43329 29.04.2022 Начало
	//было
	//ЗаполнитьЗначенияСвойств(ЭтаФорма,Параметры,"Грузоотправитель,Грузополучатель,ГлавныйБухгалтер,Руководитель,АдресДоставки,ЗаРуководителяНаОсновании,ЗаГлавногоБухгалтераНаОсновании,ДоверенностьЗаРуководителя,ДоверенностьЗаГлБухгалтера,БезДоверенностей");
	//стало
	ЗаполнитьЗначенияСвойств(ЭтаФорма,Параметры,"Грузоотправитель,Грузополучатель,ГлавныйБухгалтер,Руководитель,АдресДоставки,ЗаРуководителяНаОсновании,ЗаГлавногоБухгалтераНаОсновании,ДоверенностьЗаРуководителя,ДоверенностьЗаГлБухгалтера,БезДоверенностей,РуководительКонтрагента,КонтрагентДокумента");
	МассивРуководителей = ПолучитьРуководителейКонтрагента(КонтрагентДокумента);  
	Элементы.РуководительКонтрагента.СписокВыбора.ЗагрузитьЗначения(МассивРуководителей); 
	//ДИТ Авдеева В.С. 43329 29.04.2022 Конец
	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )



//ДИТ Авдеева В.С. 43329 29.04.2022 Начало
&НаКлиенте
Процедура РуководительКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	МассивРуководителей = ПолучитьРуководителейКонтрагента(КонтрагентДокумента);  
	Элементы.РуководительКонтрагента.СписокВыбора.ЗагрузитьЗначения(МассивРуководителей); 
	
КонецПроцедуры 	//ДИТ Авдеева В.С. 43329 29.04.2022 Конец

//ДИТ Авдеева В.С. 43329 29.04.2022 Начало
&НаСервереБезКонтекста
Функция ПолучитьРуководителейКонтрагента(Контрагент) 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеРуководителяКонтрагентов.Руководитель КАК Руководитель
	|ИЗ
	|	РегистрСведений.ДанныеРуководителяКонтрагентов КАК ДанныеРуководителяКонтрагентов
	|ГДЕ
	|	ДанныеРуководителяКонтрагентов.Контрагент = &Контрагент
	|	И ВЫБОР
	|			КОГДА ДанныеРуководителяКонтрагентов.ОкончаниеДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ИСТИНА
	|			КОГДА ДанныеРуководителяКонтрагентов.ОкончаниеДействия > &ТекущаяДата
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ";    
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивРуководителей = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Руководитель");         
	
	Возврат МассивРуководителей;

КонецФункции //ДИТ Авдеева В.С. 43329 29.04.2022 Конец
