
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект); //ДИТ Шевченко А.В. US 62492 ТА 68150 25.04.2023
	
	Если Параметры.Свойство("СоздатьНаОснованииЗаявки") Тогда
		ЗаявкаПараметр = Параметры.СоздатьНаОснованииЗаявки;
		Если ЗначениеЗаполнено(ЗаявкаПараметр) Тогда
			Если НЕ Параметры.Свойство("ЭтапПеревозки") Тогда
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			Если НЕ Параметры.Свойство("ПростойАлгоритмЗаполнения") Тогда
				Объект.УпрощенныйАлгоритмЗаполненияПоследнейМили = Ложь;
			Иначе
				Объект.УпрощенныйАлгоритмЗаполненияПоследнейМили = Параметры.ПростойАлгоритмЗаполнения;
			КонецЕсли;
			// ДИТ US 78243 ТА 80825 Сержантова А.С. Начало: 08.02.2024 
			Если Параметры.Свойство("ДобавлятьСтрокиБезРелиза") Тогда
				ЭтаФорма.ДобавлятьСтрокиБезРелиза = Истина;
			КонецЕсли;
			// ДИТ US 78243 ТА 80825 Сержантова А.С. Конец: 08.02.2024
			Объект.ЭтапПеревозки = Параметры.ЭтапПеревозки;
			
			ЗаполнитьНаОснованииЗаявки(ЗаявкаПараметр);
			УстановитьПросмотрСтатусОтправкиЗапросаНаТерминалВыдачи(); //ДИТ Шевченко А.В. US 62487 ТА 68012 04.05.2023
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	
	УстановитьРежимыВыбораДляТабличнойЧасти();
		
	// СтандартныеПодсистемы.КонтактнаяИнформация
    ДополнительныеПараметры = УправлениеКонтактнойИнформацией.ПараметрыКонтактнойИнформации();
    ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "КонтейнерыГруппаКонтактнаяИнформация");
    УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, Объект, ДополнительныеПараметры);
    // Конец СтандартныеПодсистемы.КонтактнаяИнформация
	УстановитьОформлениеДляПолейНеТребуется();
	УстановитьТолькоПросмотрПоСтатусуЗаказа();
	
	Если НЕ Пользователи.РолиДоступны("ПолныеПрава",, Ложь) Тогда
		РазрешитьРедактированиеСостоянияЗапроса = Пользователи.РолиДоступны("dc_РазрешитьРедактированиеСостоянияЗапросаНаАвтоперевозку",, Ложь);
		РегистрыСведений.СостоянияДокументов.УстановитьДоступностьТаблицыСостояния(Элементы.ГруппаСостояния, "Состояния", "СостоянияИсполнитель", РазрешитьРедактированиеСостоянияЗапроса);
		Элементы.КонтейнерыОбновленыИсходныеДанные.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ЗаполнитьСлужебныеСообщения(); //ДИТ Шевченко А.В. 59965 28.11.22
	
	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
	
	//БИТ Белинский Д.А. 26.06.2023 -начало
	УстановитьВидимостьПолейПоДирекцииКонтенерныхПеревозок();

	Если ЭтоДирекцияКонтейнерныхПеревозок() Тогда 
		ВыбранКонтрагентДирекцияКонтейнерныхПеревозок = Истина;
	КонецЕсли;
	//БИТ Белинский Д.А. 26.06.2023 -конец 
	//Евросиб - АСуслов 14.07.2023 15:54:50 #локации
	//(
	Элементы.КонтейнерыСкопироватьАдрес.Видимость = Ложь;
	Элементы.КонтейнерыВставитьАдрес.Видимость = Ложь;
	//)
	//Евросиб - АСуслов 14.07.2023 15:54:52 #локации  
	
	// ДИТ US 80736 ТА 81088 Сержантова А.С. Начало: 27.02.2024
	ОповеститьОНеобходимостиОбновленияДанных();
	// ДИТ US 80736 ТА 81088 Сержантова А.С. Конец: 27.02.2024
	
	//Евросиб Коханенко Н.А. 07.12.2023 (( US 75549 TA 77390 
	УстановитьВидимостьПолейВДополнительныхАдресах();
	//Евросиб Коханенко Н.А. 07.12.2023 )) US 75549 TA 77390 
	
	//Евросиб Коханенко Н.А. 07.02.2024 (( #80805 
	УстановитьЗначенияТиповОперацийНаТерминалеПоУмолчанию();
	//Евросиб Коханенко Н.А. 07.02.2024 )) #80805 
	
	//Евросиб Коханенко Н.А. 12.03.2024 (( #82185 
	УстановитьОбязательностьЗаполненияПолейДляИмпортМоре();
	//Евросиб Коханенко Н.А. 12.03.2024 )) #82185  
	
	//Евросиб Коханенко Н.А. 07.08.2024 (( #87840
	УстановитьСвойстваЭлементовФормыДляСреднейМили();
	//Евросиб Коханенко Н.А. 07.08.2024 )) #87840 
	
	//Евросиб Коханенко Н.А. 17.12.2025 (( #125251
	УстановитьВидимостьПолейАдресаСкладаФакт();
	//Евросиб Коханенко Н.А. 17.12.2025 )) #125251 

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.ЭтапПеревозки = ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПерваяМиля") Тогда
		ЗаголовокМиля = "Первая миля";
		Элементы.КонтейнерыГрузоотправительГрузопоолучательКонтакты.Заголовок = "Грузоотправитель, контакты"; //ДИТ Шевченко А.В. US 62515 ТА 69139 25.04.2023 
	//Евросиб Коханенко Н.А. 07.08.2024 (( #87840
	ИначеЕсли Объект.ЭтапПеревозки = ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.СредняяМиля") Тогда
		ЗаголовокМиля = "Средняя миля";
		Элементы.КонтейнерыГрузоотправительГрузопоолучательКонтакты.Заголовок = "Грузополучатель, контакты";
	//Евросиб Коханенко Н.А. 07.08.2024 )) #87840
	Иначе
		ЗаголовокМиля = "Последняя миля";
		Элементы.КонтейнерыГрузоотправительГрузопоолучательКонтакты.Заголовок = "Грузополучатель, контакты"; //ДИТ Шевченко А.В. US 62515 ТА 69139 25.04.2023
	КонецЕсли;	
	ЭтаФорма.Заголовок = СтрШаблон("(%1)",ЗаголовокМиля);
	УстановитьВидимостьКомандыДобавитьУдаленныеКТКВЗапрос();
	ОбновитьДоступностьУдаленияСтрокиИСозданияДопЗапроса();
	
	Если КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.Количество() > 0 Тогда
		ИмяПоля = КонтактнаяИнформацияОписаниеДополнительныхРеквизитов[0].ИмяРеквизита;
		Элементы[ИмяПоля].РедактированиеТекста = Ложь;
	КонецЕсли;	 
	
	// ДИТ US 81881 ТА 81882 Сержантова А.С. Начало: 04.04.2024 
	//если было заполнение заявки и есть дубли терминалов выдачи, то спрашиваем у пользователя какой установить терминал выдачи в Контейнерах
	Если СписокДублейТерминаловИзРейса.Количество() Тогда
		ВопросВыборТерминаловВыдачи();
	КонецЕсли;
	// ДИТ US 81881 ТА 81882 Сержантова А.С. Конец: 04.04.2024
	
КонецПроцедуры                           

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОтветСтруктура = ТекущийОбъект.ПолучитьТаблицыОформленияИзХранилища();
	
	// ДИТ US 78233 TA 79764 Сержантова А.С. Начало: 23.01.2024 
	ВосстановитьОтправленныеВТЛДанные();
	// ДИТ US 78233 TA 79764 Сержантова А.С. Конец: 23.01.2024
	
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -начало
	ЗаполнитьТаблицуПоКлючамАналитики(, Истина);
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -конец
	
	Если ОтветСтруктура.ТаблицаОформленияТЧ <> Неопределено Тогда
		Для Каждого СтрокаТЗ Из ОтветСтруктура.ТаблицаОформленияТЧ Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаОформленияКолонок.Добавить(),СтрокаТЗ);
		КонецЦикла;		
	КонецЕсли;	
	
	Если ОтветСтруктура.СписокОформленияШапки <> Неопределено Тогда
		Для Каждого ЗначениеСписка Из ОтветСтруктура.СписокОформленияШапки Цикл
			СписокРекОформленияШапки.Добавить(ЗначениеСписка.Значение);
		КонецЦикла;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьНомерДатуЗаказаНаТС();
	КонецЕсли;
		
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация

    УстановитьУсловноеОформлениеТЧ();
	УстановитьУсловноеОформлениеШапки(255,0,0);
	УстановитьПросмотрСтатусОтправкиЗапросаНаТерминалВыдачи(); //ДИТ Шевченко А.В. US 62487 ТА 68012 04.05.2023
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.КонтактнаяИнформация
    УправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Объект, Отказ);
    // Конец СтандартныеПодсистемы.КонтактнаяИнформация
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)	
	ТЗОформления = РеквизитФормыВЗначение("ТаблицаОформленияКолонок");
	ТекущийОбъект.ПоместитьТаблицыОформленияВХранилище(ТЗОформления,СписокРекОформленияШапки);
	// СтандартныеПодсистемы.КонтактнаяИнформация
    УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
    // Конец СтандартныеПодсистемы.КонтактнаяИнформация  
	
	//Евросиб Коханенко Н.А. 07.12.2023 (( US 75549 TA 78231
	//удалим пустые строки из Доп Адресов Клиента
	ОтборПоПустымСтрокам = Новый Структура;
	ОтборПоПустымСтрокам.Вставить("АдресСкладаКлиента", Справочники.АдресаВНаселенныхПунктах.ПустаяСсылка());
	МассивПустыхСтрок = ТекущийОбъект.ДополнительныеАдресаКлиента.НайтиСтроки(ОтборПоПустымСтрокам); 
	Для Каждого ПустаяСтрока Из  МассивПустыхСтрок Цикл
		ТекущийОбъект.ДополнительныеАдресаКлиента.Удалить(ПустаяСтрока);
	КонецЦикла;
	//Евросиб Коханенко Н.А. 07.12.2023 )) US 75549 TA 78231 

	//Евросиб Коханенко Н.А. 01.03.2024 (( #80981 
	ТаблицаДанныхИзКалькуляций = ПолучитьСтоимостьИСтавкуНДС(ТекущийОбъект);
	Для Каждого СтрокаКонтейнеры Из ТекущийОбъект.Контейнеры Цикл
		СтруктураПоиска = Новый Структура("ИдентификаторСтрокиУслуги", СтрокаКонтейнеры.ИдентификаторСтрокиУслуги);
		НайденныеСтроки = ТаблицаДанныхИзКалькуляций.НайтиСтроки(СтруктураПоиска);
		ЗапросСвязанСКалькуляцией = НайденныеСтроки.Количество() > 0;
		НовоеЗначениеСтавкиНДС = ?(ЗапросСвязанСКалькуляцией, НайденныеСтроки[0].СтавкаНДС, Перечисления.СтавкиНДС.ПустаяСсылка());
		НовоеЗначениеСтоимости = ?(ЗапросСвязанСКалькуляцией, НайденныеСтроки[0].СтоимостьАвтоперевозкиЗаложеннаяПриРасчете, 0);
		Если СтрокаКонтейнеры.СтавкаНДС <> НовоеЗначениеСтавкиНДС Тогда
			СтрокаКонтейнеры.СтавкаНДС = НовоеЗначениеСтавкиНДС;
			СтрокаКонтейнеры.ОбновленыИсходныеДанные = Истина;
		КонецЕсли;
		Если СтрокаКонтейнеры.СтоимостьАвтоперевозкиЗаложеннаяПриРасчете <> НовоеЗначениеСтоимости Тогда
			СтрокаКонтейнеры.СтоимостьАвтоперевозкиЗаложеннаяПриРасчете = НовоеЗначениеСтоимости;
			СтрокаКонтейнеры.ОбновленыИсходныеДанные = Истина;
		КонецЕсли;
	КонецЦикла;
	//Евросиб Коханенко Н.А. 01.03.2024 )) #80981   
	
	// ДИТ US 80736 ТА 81088 Сержантова А.С. Начало: 27.02.2024
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ВыполнитьЗадачуОбновления", БылоОбновлениеИзЗаявки);	
	// ДИТ US 80736 ТА 81088 Сержантова А.С. Конец: 27.02.2024
	
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Начало: 11.12.2023    
	//Проверяем изменились ли ключи аналитики
	БылоОбновлениеКлюча = Ложь;
	Для каждого СтрокаТЧ Из Объект.Контейнеры Цикл
		АктуальнаяВерсия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.КлючАналитикиПеревозки, "ВерсияДанных");
		Если СтрокаТЧ.ВерсияКлюча <> "" и СтрокаТЧ.ВерсияКлюча <> АктуальнаяВерсия Тогда
			ЗаполнитьТаблицуПоКлючамАналитики(СтрокаТЧ.КлючАналитикиПеревозки); 
			БылоОбновлениеКлюча = Истина;
		КонецЕсли;
	КонецЦикла;	
	Если БылоОбновлениеКлюча Тогда 
		ОбщегоНазначения.СообщитьПользователю("Перед записью запроса на авто обнаружено, что ключи аналитики перевозки изменились. Данные перезаполнены, внесите необходимые корректировки");		
		Отказ = Истина;
	КонецЕсли;  
	
	Если не Отказ Тогда 
		ЗаблокироватьКлючиАналитикиПеревозкиДляРедактирования();
		ДанныеОбновленияКлючей = ЗаполнитьДанныеДляОбновленияКлючейАналитикиПеревозки();
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ДанныеДляОбновленияКлючейАналитики", ДанныеОбновленияКлючей); 
	КонецЕсли; 
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Конец: 11.12.2023
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)	
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	// СтандартныеПодсистемы.КонтактнаяИнформация
    УправлениеКонтактнойИнформацией.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект);
    // Конец СтандартныеПодсистемы.КонтактнаяИнформация	
	
	ЗаполнитьТаблицуПоКлючамАналитики();
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьНомерДатуЗаказаНаТС();
	КонецЕсли;       
	
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Начало: 11.12.2023
	СнятьБлокировкуКлючейАналитикиПеревозкиДляРедактирования();
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Конец: 11.12.2023
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПроверитьСоответствиеВесаДетализацииПоГрузу(Отказ);	
	
	ВыводитьСообщение = Ложь;
	
	//Для Каждого СтрокаТЧ Из Объект.Контейнеры Цикл
	//	СтруктураПоиска = Новый Структура("ИдентификаторСтрокиТЧ",СтрокаТЧ.ИдентификаторСтрокиТЧ);
	//	НайденныеСтроки = ТаблицаОформленияКолонок.НайтиСтроки(СтруктураПоиска);
	//	Если НайденныеСтроки.Количество() = 0 Тогда
	//		СтрокаТЧ.ОбновленыИсходныеДанные = Ложь;
	//	КонецЕсли;	
	//КонецЦикла;	
	
	//БИТ Белинский Д.А. 10.04.2023 -начало  TASK 66201 
	Если ЭтоДирекцияКонтейнерныхПеревозок() Тогда
		Если ЗначениеЗаполнено(Объект.Заявка) Тогда 
			ПСЦ = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Объект.Заявка, "ПСЦ");
			Если ЗначениеЗаполнено(ПСЦ) И ЭтоМежсервисныеРасходы(ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ПСЦ, "ТипКалькуляции")) Тогда
				Если Объект.Проведен = Ложь И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
					Если РаботаСЗаявкамиВызовСервера.ЭтоЗаявкаНаАвтоРейс(Объект.Заявка) Тогда
						ОбновитьИзЗаявкиНаСервере()
					КонецЕсли;
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//БИТ Белинский Д.А. 10.04.2023 -конец  TASK 66201 
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		// ДИТ US 79379 Сержантова А.С. Начало: 18.03.2024
		//Если НЕ ПараметрыЗаписи.Свойство("ПропуститьВопросПоОформлению") Тогда
		//	МассивПроверкиКолонокТС = ПолучитьМассивПроверкиКолонокТС();
		//	
		//	НеобходимВопрос = Ложь;
		//	Для Каждого СтрокаОф Из ТаблицаОформленияКолонок Цикл
		//		МассивОформленныхКолонок = СтрРазделить(СтрокаОф.ИменаКолонок,";");
		//		Для Каждого МассивОф Из МассивОформленныхКолонок Цикл
		//			Если МассивПроверкиКолонокТС.Найти(МассивОф) <> Неопределено Тогда
		//				НеобходимВопрос = Истина;
		//				Прервать;
		//			КонецЕсли;
		//		КонецЦикла;
		//		Если НеобходимВопрос Тогда
		//			Прервать;
		//		КонецЕсли;	
		//	КонецЦикла;	
		//	
		//	Если НеобходимВопрос Тогда
		//		
		//		ДополнительныеПараметры = Новый Структура;
		//		ДополнительныеПараметры.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);
		//		
		//		СписокКнопок = Новый СписокЗначений;
		//		СписокКнопок.Добавить(КодВозвратаДиалога.Да,"Да");
		//		СписокКнопок.Добавить(КодВозвратаДиалога.Нет,"Нет");	
		//		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаСнятииОформленияКолонокТС", ЭтотОбъект,ДополнительныеПараметры); 
		//		// "... красным цветом таких полей?" - изменен текст вопроса Сержантова А.С. 10.01.2023 US 78233 TA 78240
		//		ПоказатьВопрос(Оповещение,"Документ содержит обновленные данные из ИС «Транспортная логистика». Снять подсвечивание таких строк?", СписокКнопок, 60,КодВозвратаДиалога.Нет,,КодВозвратаДиалога.Нет); 	
		//		Отказ = Истина;
		//		Возврат;
		//	КонецЕсли;	
		//	
		//КонецЕсли; 
		// ДИТ US 79379 Сержантова А.С. Конец: 18.03.2024
		
		СтруктураПоиска = Новый Структура("ОбновленыИсходныеДанные",Истина);
		НайденныеСтроки = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ВыводитьСообщение = Истина;
		КонецЕсли;
		Если СписокРекОформленияШапки.Количество() > 0 Тогда	
			ВыводитьСообщение = Истина;
		КонецЕсли;
		МассивГуидовТЧ = новый Массив;
		МассивНомеровСтрок = Новый Массив;
		Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
			//ДИТ Шевченко А.В. US 62421 TA 64345 20.01.23 -начало
			КонтейнерП = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(СтрокаТЧ.КлючАналитикиПеревозки,"Контейнер");
			
			Если НЕ ЗначениеЗаполнено(КонтейнерП) ИЛИ НЕ ЗначениеЗаполнено(СтрокаТЧ.КонтейнерФакт) Тогда
				Продолжить;
			КонецЕсли;
			Если Строка(КонтейнерП) <> СтрокаТЧ.КонтейнерФакт Тогда
				Продолжить;
			КонецЕсли;
			//ДИТ Шевченко А.В. US 62421 TA 64345 20.01.23 -конец
			СтруктураПоиска = Новый Структура("ИдентификаторСтрокиТЧ",СтрокаТч.ИдентификаторСтрокиТЧ);
			НайденныеСтрокиОфор = ТаблицаОформленияКолонок.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтрокиОфор.Количество() > 0 Тогда
				МассивКолонок = СтрРазделить(НайденныеСтрокиОфор[0].ИменаКолонок,";");
				Если МассивКолонок.Найти("КонтейнерФакт") <> Неопределено Тогда
					МассивГуидовТЧ.Добавить(СтрокаТч.ИдентификаторСтрокиТЧ); 
					МассивНомеровСтрок.Добавить(СтрокаТч.НомерСтроки);	
				КонецЕсли;	
			КонецЕсли;		
		КонецЦикла;
		
		Если ЗначениеЗаполнено(МассивГуидовТЧ) Тогда
			СписокКнопок = Новый СписокЗначений;
			СписокКнопок.Добавить(КодВозвратаДиалога.Да,"Да");
			СписокКнопок.Добавить(КодВозвратаДиалога.Нет,"Нет");	
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПланФактКТК", ЭтотОбъект, Новый Структура("МассивГуидовТЧ",МассивГуидовТЧ));
			ПоказатьВопрос(Оповещение, СтрШаблон("Необходимо отправить обновленные данные по строке %1 в ИС Транспортная логистика. Отправить данные?",СтрСоединить(МассивНомеровСтрок,",")), СписокКнопок, 60,КодВозвратаДиалога.Нет,,КодВозвратаДиалога.Нет);
			ВыводитьСообщение = Ложь;
		КонецЕсли;
		
	КонецЕсли;   
	
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Начало: 21.12.2023
	// Было:
	//Если ВыводитьСообщение Тогда 
	//Стало:
	Если ВыводитьСообщение и не Отказ Тогда
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Конец: 21.12.2023
		ПоказатьПредупреждение(,"Данные в запросе на автоперевозку обновлены, необходимо отправить информацию об изменениях в ИС «Транспортная логистика».");
	КонецЕсли;	
	
	Если НЕ Отказ Тогда
		МассивГуидовОтметки = Новый Массив;
		СтруктураПоиска = Новый Структура("Отметка",Истина);
		НайденныеСтроки = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска);
		Для Каждого СтрокаС Из НайденныеСтроки Цикл
			МассивГуидовОтметки.Добавить(СтрокаС.ИдентификаторСтрокиТЧ);
		КонецЦикла;	
		АдресХранильщаОтметки = ПоместитьВоВременноеХранилище(МассивГуидовОтметки,ЭтаФОрма.УникальныйИдентификатор);  
	КонецЕсли;	
	
КонецПроцедуры

//БИТ Белинский Д.А. 10.04.2023 -начало #66201
&НаСервереБезКонтекста
Функция ЭтоМежсервисныеРасходы(ТипКалькуляции)
	
	Результат = Ложь;
	Если ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.МежсервисныеРасходы") 
		ИЛИ ТипКалькуляции = ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.МежсервисныеРасходыРеф") Тогда
		Результат = Истина;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции
//БИТ Белинский Д.А. 10.04.2023 -конец #66201 

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Документ.ЗапросНаАвтоперевозку.Форма.ФормаВосстановленияУдаленных" Тогда
		Если ВыбранноеЗначение.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;	
		
		МассивНеВосстановленныхНомеровСтрок = ПроверитьСтрокиНаВозможностьВосстановления(ВыбранноеЗначение,Объект.Заявка,Объект.ЭтапПеревозки);
		
		Если МассивНеВосстановленныхНомеровСтрок.Количество() > 0 Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Ранее удаленные строки № %1 не были добавлены в Запрос на автоперевозку по причине несоответствия данных для добавления. Проверьте отсутствие таких контейнеров в Услугах текущей и других Заявок, а также наличие статуса «Силами Евросиб» для соответствующего этапа автоперевозки",СтрСоединить(МассивНеВосстановленныхНомеровСтрок,",")));
		КонецЕсли;
		
		УстановитьВидимостьКомандыДобавитьУдаленныеКТКВЗапрос();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОповеститьОЗаписиНового(Объект.Ссылка);
	
	ДанныеХран = ПолучитьИзВременногоХранилища(АдресХранильщаОтметки);
	Если ДанныеХран <> Неопределено Тогда
		Для Каждого СтрокаД Из ДанныеХран Цикл
			СтруктураПоиска = Новый Структура("ИдентификаторСтрокиТЧ",СтрокаД);
			НайденныеСтроки = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НайденнаяСтрока.Отметка = Истина;
			КонецЦикла;	
		КонецЦикла;
	КонецЕсли;
	Оповестить("ТребуетсяПеречитатьУказанныйДокумент", Объект.Заявка); //ДИТ Шевченко А.В. US 62482 ТА 72737 19.07.2023 -Начало
	УстановитьПросмотрСтатусОтправкиЗапросаНаТерминалВыдачи(); //ДИТ Шевченко А.В. US 62487 ТА 68012 04.05.2023 
	
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Начало: 11.12.2023
	ОповеститьОбИзменении(Тип("СправочникСсылка.КлючиАналитикиПеревозки"));   
	Оповестить("НеобходимоОбновитьДанныеКлючейАналитикиПеревозки", , ЭтаФорма);
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Конец: 11.12.2023       
	
	//// ДИТ US 80736 ТА 81088 Сержантова А.С. Начало: 01.03.2024
	//Если БылоОбновлениеИзЗаявки Тогда
	//	ТекущийИсполнитель_Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен");
	//КонецЕсли;
	//// ДИТ US 80736 ТА 81088 Сержантова А.С. Конец: 01.03.2024  
	// ДИТ US 81881 ТА 84217 Сержантова А.С. Начало: 26.04.2024
	СтатусАктивнойЗадачи = Неопределено;
	Для каждого СтрСостояния Из Объект.Состояния Цикл
		Если СтрСостояния.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен") Тогда
			СтатусАктивнойЗадачи = СтрСостояния.Статус;	
			Прервать;
		КонецЕсли;
	КонецЦикла; 
	Если СтатусАктивнойЗадачи = Неопределено Тогда
	    ТекущийИсполнитель_Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен");
	Иначе	
	    ТекущийИсполнитель_Статус = СтатусАктивнойЗадачи;
	КонецЕсли;
	// ДИТ US 81881 ТА 84217 Сержантова А.С. Конец: 26.04.2024
	
	// ДИТ US 82176 ТА 82559 Сержантова А.С. Начало: 28.03.2024
    ЭтаФорма.МодифицированностьФормы = Ложь;
	// ДИТ US 82176 ТА 82559 Сержантова А.С. Конец: 28.03.2024
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если Объект.ПометкаУдаления Тогда
		ОповеститьОЗаписиНового(Объект.Ссылка);
	КонецЕсли;	
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбработчикНажатияПлитокСостояния(П1 = неопределено, П2 = неопределено) Экспорт
	МаршрутизацияКлиент.ОбработчикНажатияНаПлиткуОбщий(П1, П2);
КонецПроцедуры

&НаКлиенте
Процедура ТекущийИсполнитель_СтатусПриИзменении(Элемент)
	
	// обновляем информацию по состоянию 
	МаршрутизацияКлиент.ТекущийИсполнитель_СтатусПриИзменении(Объект, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	Модифицированность = Истина;
	ОбновитьПанельСостояний();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийИсполнитель_СтатусОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка) //ДИТ Шевченко А.В. 59965 28.11.22   
	// ДИТ US 81881 ТА 83783 Сержантова А.С. Начало: 19.04.2024
	// Было:
	//Если ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен") и не БылоОбновлениеИзЗаявки Тогда 
	//Стало:
	СтрокиЗадачиНаОбновление = Объект.Состояния.НайтиСтроки(Новый Структура("Состояние", ПредопределенноеЗначение("Справочник.Состояния.НеобходимоОбновитьДанные")));
	Если СтрокиЗадачиНаОбновление.Количество() и СтрокиЗадачиНаОбновление[0].Статус <> ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен")
		и ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен") 
		и не БылоОбновлениеИзЗаявки Тогда
	// ДИТ US 81881 ТА 83783 Сержантова А.С. Конец: 19.04.2024
	// ДИТ US 80736 ТА 81088 Сержантова А.С. Начало: 29.02.2024
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нельзя выполнить задачу без обновления данных запроса на авто из заявки!"); 
		ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.ВРаботе");
		Возврат;
	КонецЕсли;
	// ДИТ US 80736 ТА 81088 Сержантова А.С. Конец: 29.02.2024
	МаршрутизацияКлиент.ТекущийИсполнитель_СтатусОбработкаВыбора(Объект, Объект.ТекущееСостояние, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель, ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура ОриентировочнаяДатаМорскогоРейсаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПроверитьИзменениеРеквизитаШапки(Элемент.Имя,Объект.ОриентировочнаяДатаМорскогоРейса); 
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ГруппаАвтодиспетчеровПриИзменении(Элемент) //ДИТ Шевченко А.В. US 62481 ТА 70964 05.06.2023
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПроверитьИзменениеРеквизитаШапки(Элемент.Имя,Объект.ГруппаАвтодиспетчеров); 
	КонецЕсли;
	Для Каждого Стр Из Объект.Контейнеры Цикл
		Стр.ОбновленыИсходныеДанные = Стр.СтатусЗапросаНаАвтоперевозку <> ПредопределенноеЗначение("Перечисление.СтатусЗапросаНаПеревозку.Отменен");	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОриентировочнаяДатаЖДРейсаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПроверитьИзменениеРеквизитаШапки(Элемент.Имя,Объект.ОриентировочнаяДатаЖДРейса); 
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКонтейнеры

//Евросиб Коханенко Н.А. 05.10.2023 (( US 75549 TA 75773 
&НаКлиенте
Процедура КонтейнерыАдресКлиентаПриИзменении(Элемент) 
	//вынесено в отдельную процедуру ДействияКонтейнерыАдресКлиентаПриИзменении
	ДействияКонтейнерыАдресКлиентаПриИзменении(); 
	ТекДанные = Элементы.Контейнеры.ТекущиеДанные;
	//Евросиб Коханенко Н.А. 27.08.2024 (( #90651 
	//ИзменитьПервуюСтрокуВДополнительныеАдресаКлиента(ТекДанные.ИдентификаторСтрокиТЧ, ТекДанные.АдресКлиента);
	ИзменитьПервуюСтрокуВДополнительныеАдресаКлиента(ТекДанные.ИдентификаторСтрокиТЧ, ТекДанные.АдресКлиента, ТекДанные.ТипОперацииНаСкладеКлиента);
	//Евросиб Коханенко Н.А. 27.08.2024 )) #90651 
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыТипОперацииНаСкладеКлиентаПриИзменении(Элемент)
	ТекДанные = Элементы.Контейнеры.ТекущиеДанные;
	ИзменитьПервуюСтрокуВДополнительныеАдресаКлиента(ТекДанные.ИдентификаторСтрокиТЧ,, ТекДанные.ТипОперацииНаСкладеКлиента); 
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыСтатусЗаказаНаТСПриИзменении(Элемент)
	Если Элементы.ДополнительныеАдресаКлиента.Видимость Тогда
		//если статус - Закрыт, то запретить редактирование
		Элементы.ДополнительныеАдресаКлиента.ТолькоПросмотр = (Элементы.Контейнеры.ТекущиеДанные.СтатусЗаказаНаТС = ПредопределенноеЗначение("Перечисление.СтатусЗаказаНаТс.Закрыт"));		
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура КонтейнерыНеТребуетсяАдресПриИзменении(Элемент)
	ОбновитьДоступностьКомандыДобавитьАдресКлиента();
КонецПроцедуры

&НаКлиенте
Процедура ДействияКонтейнерыАдресКлиентаПриИзменении();
	//перенесено из обработчика КонтейнерыАдресКлиентаПриИзменении 
	//ДИТ Шевченко А.В. US 62421 ТА 67386 18.05.2023
	ТекД = Элементы.Контейнеры.ТекущиеДанные;
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда	
			ТекД.ОбновленыИсходныеДанные = Истина;
			МассивИзменяемыхИдентификаторов = Новый Массив;
			МассивИзменяемыхИдентификаторов.Добавить(ТекД.ИдентификаторСтрокиТЧ);
			ПроверитьИзменениеИОформить(Объект.Ссылка,"АдресКлиента",ТекД.АдресКлиента,"ИдентификаторСтрокиТЧ",МассивИзменяемыхИдентификаторов,"Контейнеры",ЛОЖЬ);
		КонецЕсли;    
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Начало: 11.12.2023
	// Было:
	//ДобавитьЗначениеРеквизитаВКлюч(ТекД.КлючАналитикиПеревозки,ТекД.АдресКлиента,"АдресКлиента",Объект.ЭтапПеревозки,,ТекД.ВерсияКлюча); 
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Конец: 11.12.2023

 КонецПроцедуры
//Евросиб Коханенко Н.А. 05.10.2023 )) US 75549 TA 75773 

&НаКлиенте
Процедура КонтейнерыДополнительнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОпОп = Новый ОписаниеОповещения("ОбработкаВводаДополнительнаяИнформация", ЭтаФорма,Элемент.ТекстРедактирования);
	ПоказатьВводСтроки(ОпОп, Элемент.ТекстРедактирования,"Дополнительная информация",,Истина);
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыПриАктивизацииСтроки(Элемент)
	Если Элементы.Контейнеры.ТекущиеДанные <> Неопределено Тогда
		ОбновитьВидимостьДетализацияПоГрузу();
		ОбновитьДоступностьУдаленияСтрокиИСозданияДопЗапроса(); 
		Элементы.ДетализацияПоГрузу.ОтборСтрок = Новый ФиксированнаяСтруктура("Ключ", Элементы.Контейнеры.ТекущиеДанные.КлючАналитикиПеревозки);		
		Элементы.КонтейнерыСтатусОтправкиЗапросаНаТерминалВыдачи.ТолькоПросмотр = Элементы.Контейнеры.ТекущиеДанные.УсловияДоступностиСтатусаОтправкиЗапросаНаТерминалВыдачи; //ДИТ Шевченко А.В. US 62487 ТА 68012 04.05.2023
		//Евросиб Коханенко Н.А. 04.10.2023 (( US 75549 TA 75773 
		ОбновитьДоступностьКомандыДобавитьАдресКлиента();  
		Элементы.ДополнительныеАдресаКлиента.ОтборСтрок = Новый ФиксированнаяСтруктура("QueryID", Элементы.Контейнеры.ТекущиеДанные.ИдентификаторСтрокиТЧ);
		//Евросиб Коханенко Н.А. 04.10.2023 )) US 75549 TA 75773 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыПриИзменении(Элемент)
	
	ТекД = Элементы.Контейнеры.ТекущиеДанные;
	ЭтоПолеАдреса = Ложь;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;	   
	
	// ++ ДИТ BUG 76919 ТА 77021 Сержантова А.С. 20.11.2023
    //Евросиб Коханенко Н.А. 11.02.2026 (( BUG 130030 TA 130694 
    //перенес выставление Модифицированности в обработчик КонтейнерыПриОкончанииРедактирования
	//в ней осуществляется проверка, игнорирующая изменения в колонках "Отметка" и "Обновлены исходные данные"
	//ЭтаФорма.Модифицированность = Истина;   
	//МодифицированностьФормы = Истина;
	//Евросиб Коханенко Н.А. 11.02.2026 )) BUG 130030 TA 130694 
	// -- ДИТ BUG 76919 ТА 77021 Сержантова А.С. 20.11.2023
	
	МассивИзменяемыхИдентификаторов = Новый Массив;
	МассивИзменяемыхИдентификаторов.Добавить(ТекД.ИдентификаторСтрокиТЧ);
	МассивНеОформляемыхПолей = Новый Массив;
	
	МассивНеОформляемыхПолей.Добавить("Отметка");  
	// ДИТ US 78233 TA 79764 Сержантова А.С. Начало: 26.01.2024
	// Было:
	//МассивНеОформляемыхПолей.Добавить("Груз");
	// ДИТ US 78233 TA 79764 Сержантова А.С. Конец: 26.01.2024
	МассивКлючей = Новый Массив;
	
	
	Если ЗаполнятьВниз Тогда
				
		ИмяТЧ = Элемент.Имя;
		ИмяПоля = Сред(Элемент.ТекущийЭлемент.Имя, СтрДлина(ИмяТЧ)+1);
		
		Если СтрНайти(ИмяПоля,"ИнформацияПолеКонтейнеры") > 0 Тогда
			Возврат;
		КонецЕсли;	
		
		НовоеЗначение = ТекД[ИмяПоля];
		
		СтрокаПройдена = Ложь;		
		Для Сч = 0 По Объект[ИмяТЧ].Количество() - 1 Цикл
			РезПроверки = Элементы.Контейнеры.ПроверитьСтроку(Объект[ИмяТЧ][Сч].ПолучитьИдентификатор());
			
			СтрокаПройдена = СтрокаПройдена ИЛИ Элементы.Контейнеры.ТекущаяСтрока = Объект[ИмяТЧ][Сч].ПолучитьИдентификатор();
			
			Если РезПроверки = Истина И СтрокаПройдена = Истина Тогда
				
				Если Элементы.Контейнеры.ТекущаяСтрока = Объект[ИмяТЧ][Сч].ПолучитьИдентификатор() Тогда      
					// ДИТ US 76935 ТА 78648 Сержантова А.С. Начало: 19.12.2023 - в первой строке тоже ставим, что исх. данные обновлены
					Если ИмяПоля <> "Отметка" Тогда
						Объект[ИмяТЧ][Сч].ОбновленыИсходныеДанные = Истина;
					КонецЕсли;
					// ДИТ US 76935 ТА 78648 Сержантова А.С. Конец: 19.12.2023
					Продолжить;
				КонецЕсли;	
				
				Если Объект[ИмяТЧ][Сч].СтатусЗаказаНаТС = ПредопределенноеЗначение("Перечисление.СтатусЗаказаНаТс.ВыданВРейс") ИЛИ Объект[ИмяТЧ][Сч].СтатусЗаказаНаТС = ПредопределенноеЗначение("Перечисление.СтатусЗаказаНаТс.Закрыт") Тогда
					Продолжить;	
				КонецЕсли;
				
				Если Объект[ИмяТЧ][Сч].СтатусЗапросаНаАвтоперевозку = ПредопределенноеЗначение("Перечисление.СтатусЗапросаНаПеревозку.Отменен") Тогда
					Продолжить;	
				КонецЕсли;
				
				Если ИмяПоля = "НеТребуетсяТерминалВыдачи" Тогда	
					МожноУстановить = ПроверитьВозможностьУстановкиПоляНеТребуется(Объект[ИмяТЧ][Сч],НЕ НовоеЗначение);
					Если НЕ МожноУстановить Тогда
						Продолжить;
					КонецЕсли;
					Если ТекД[ИмяПоля] Тогда
						Объект[ИмяТЧ][Сч].СтатусОтправкиЗапросаНаТерминалВыдачи = ПредопределенноеЗначение("Перечисление.СтатусОтправкиЗапросаНаТерминалВыдачи.НеТребуется");
					Иначе
						Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
							Объект[ИмяТЧ][Сч].СтатусОтправкиЗапросаНаТерминалВыдачи = ПолучитьСтатусОтправкиЗапросаНаТерминалВыдачиДоИзменения(Объект.Ссылка,Объект[ИмяТЧ][Сч].КлючАналитикиПеревозки);
							Если Объект[ИмяТЧ][Сч].СтатусОтправкиЗапросаНаТерминалВыдачи = ПредопределенноеЗначение("Перечисление.СтатусОтправкиЗапросаНаТерминалВыдачи.НеТребуется") Тогда
								Объект[ИмяТЧ][Сч].СтатусОтправкиЗапросаНаТерминалВыдачи = ПредопределенноеЗначение("Перечисление.СтатусОтправкиЗапросаНаТерминалВыдачи.НеОтправлен");
							КонецЕсли;	
						Иначе
							Объект[ИмяТЧ][Сч].СтатусОтправкиЗапросаНаТерминалВыдачи = ПредопределенноеЗначение("Перечисление.СтатусОтправкиЗапросаНаТерминалВыдачи.НеОтправлен");
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				Если ИмяПоля = "НеТребуетсяТерминалСдачи" Тогда
					МожноУстановить = ПроверитьВозможностьУстановкиПоляНеТребуется(Объект[ИмяТЧ][Сч],НЕ НовоеЗначение);
					Если НЕ МожноУстановить Тогда
						Продолжить;
					КонецЕсли;	
				КонецЕсли;
				Если ИмяПоля = "НеТребуетсяАдрес" Тогда
					
					МожноУстановить = ПроверитьВозможностьУстановкиПоляНеТребуется(Объект[ИмяТЧ][Сч],НЕ НовоеЗначение);
					Если НЕ МожноУстановить Тогда
						Продолжить;
					КонецЕсли;	
				КонецЕсли;
				
				Если ИмяПоля = "СтатусОтправкиЗапросаНаТерминалВыдачи" Тогда
					МассивКлючей.Добавить(Объект[ИмяТЧ][Сч].КлючАналитикиПеревозки);	
				КонецЕсли;	
				
				Объект[ИмяТЧ][Сч][ИмяПоля] = НовоеЗначение;
				//ДИТ Шевченко А.В. US 62421 ТА 67386 18.05.2023 -Начало
				Если ИмяПоля = "АдресКлиента" Тогда
					//Евросиб - АСуслов 14.07.2023 15:55:50 #локации
					//(
					//ДобавитьЗначениеРеквизитаВКлюч(Объект[ИмяТЧ][Сч].КлючАналитикиПеревозки,НовоеЗначение,"АдресКлиента",Объект.ЭтапПеревозки,Объект[ИмяТЧ][Сч].ВерсияДанных);
					// ДИТ US 76935 ТА 78648 Сержантова А.С. Начало: 11.12.2023
					// Было:
					//ДобавитьЗначениеРеквизитаВКлюч(Объект[ИмяТЧ][Сч].КлючАналитикиПеревозки,НовоеЗначение,"АдресКлиента",Объект.ЭтапПеревозки,Объект[ИмяТЧ][Сч].ВерсияКлюча);
					// ДИТ US 76935 ТА 78648 Сержантова А.С. Конец: 11.12.2023
					//)
					//Евросиб - АСуслов 14.07.2023 15:55:52 #локации
				КонецЕсли;	
				//ДИТ Шевченко А.В. US 62421 ТА 67386 18.05.2023 -Конец 
				// ДИТ ТА 72097 BUG 68407 Сержантова А.С. Начало: 29.06.2023
				Если ИмяПоля = "Груз" Тогда   
					Если НовоеЗначение <> ПредопределенноеЗначение("Справочник.Грузы.СборнаяКонтейнернаяОтправка") Тогда
						СтруктураПоиска = Новый Структура("Ключ",Объект[ИмяТЧ][Сч].КлючАналитикиПеревозки);
						МассивСтрокДляУдаления = ДетализацияПоГрузу.НайтиСтроки(СтруктураПоиска);
						Для Каждого ЗнчМ Из МассивСтрокДляУдаления Цикл
							ДетализацияПоГрузу.Удалить(ЗнчМ);
						КонецЦикла;	
					КонецЕсли;
					// ДИТ US 76935 ТА 78648 Сержантова А.С. Начало: 11.12.2023
					// Было:
					//ДобавитьЗначениеРеквизитаВКлюч(Объект[ИмяТЧ][Сч].КлючАналитикиПеревозки,НовоеЗначение,"Груз",,ДетализацияПоГрузу,Объект[ИмяТЧ][Сч].ВерсияКлюча);
					//ДобавитьЗначениеРеквизитаВКлюч(Объект[ИмяТЧ][Сч].КлючАналитикиПеревозки,НовоеЗначение,"Груз",,,Объект[ИмяТЧ][Сч].ВерсияКлюча);
					// ДИТ US 76935 ТА 78648 Сержантова А.С. Конец: 11.12.2023
				КонецЕсли;
				// ДИТ ТА 72097 BUG 68407 Сержантова А.С. Конец: 29.06.2023
				
				// ДИТ US 78233 TA 78240 Сержантова А.С. Начало: 10.01.2024
				// Было:
				//Объект[ИмяТЧ][Сч].ОбновленыИсходныеДанные = Истина; 
				//Стало:
				Если ИмяПоля <> "Отметка" Тогда
					Объект[ИмяТЧ][Сч].ОбновленыИсходныеДанные = Истина;
				КонецЕсли;
				// ДИТ US 78233 TA 78240 Сержантова А.С. Конец: 10.01.2024
				
				МассивИзменяемыхИдентификаторов.Добавить(Объект[ИмяТЧ][Сч].ИдентификаторСтрокиТЧ);
				
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьВидимостьКомандыДобавитьУдаленныеКТКВЗапрос();
	
	ИмяТЧ = Элемент.Имя;
	ИмяПоля = Сред(Элемент.ТекущийЭлемент.Имя, СтрДлина(ИмяТЧ)+1);
	
	Если ИмяПоля = "НеТребуетсяТерминалВыдачи" ИЛИ ИмяПоля = "НеТребуетсяТерминалСдачи" ИЛИ ИмяПоля = "НеТребуетсяАдрес" Тогда
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ТекД.ОбновленыИсходныеДанные = Истина;
			УстановитьОформлениеПоПолямНеТребуется(ИмяТЧ,ИмяПоля,ТекД,МассивИзменяемыхИдентификаторов,ЭтоПолеАдреса);
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	Если ИмяПоля = "СтатусОтправкиЗапросаНаТерминалВыдачи" Тогда
		МассивКлючей.Добавить(ТекД["КлючАналитикиПеревозки"]);
		УстановитьПросмотрСтатусОтправкиЗапросаНаТерминалВыдачи(МассивКлючей,Ложь,ТекД[ИмяПоля]); //ДИТ Шевченко А.В. US 62487 ТА 68012 04.05.2023	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда	
		Если МассивНеОформляемыхПолей.Найти(ИмяПоля) = Неопределено Тогда
			ТекД.ОбновленыИсходныеДанные = Истина;
			ПроверитьИзменениеИОформить(Объект.Ссылка,ИмяПоля,ТекД[ИмяПоля],"ИдентификаторСтрокиТЧ",МассивИзменяемыхИдентификаторов,ИмяТЧ,ЭтоПолеАдреса);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОформлениеПоПолямНеТребуется(ИмяТЧ,ИмяПоля,ТекД,МассивИзменяемыхИдентификаторов,ЭтоПолеАдреса)
	
	Если ИмяПоля = "НеТребуетсяТерминалВыдачи" Тогда
		ЗначениеДляОтбора1 = ТекД["ТерминалВыдачи"];
		ЗначениеДляОтбора2 = ТекД["ТипОперацииНаТерминалеВыдачи"];
		Если ТекД[ИмяПоля] = Истина Тогда
			ЗначениеДляОтбора1 = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
			ЗначениеДляОтбора2 = ПредопределенноеЗначение("Перечисление.ТипОперацииНаТерминале.ПустаяСсылка");
		КонецЕсли;	
		ПроверитьИзменениеИОформить(Объект.Ссылка,"ТерминалВыдачи",ЗначениеДляОтбора1,"ИдентификаторСтрокиТЧ",МассивИзменяемыхИдентификаторов,ИмяТЧ,ЭтоПолеАдреса);
		//ТекД["ТерминалВыдачи"] = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
		ПроверитьИзменениеИОформить(Объект.Ссылка,"ТипОперацииНаТерминалеВыдачи",ЗначениеДляОтбора2,"ИдентификаторСтрокиТЧ",МассивИзменяемыхИдентификаторов,ИмяТЧ,ЭтоПолеАдреса);
		//ТекД["ТипОперацииНаТерминалеВыдачи"] = ПредопределенноеЗначение("Перечисление.ТипОперацииНаТерминале.ПустаяСсылка");
	КонецЕсли;
	Если ИмяПоля = "НеТребуетсяТерминалСдачи" Тогда
		ЗначениеДляОтбора1 = ТекД["ТерминалСдачи"];
		ЗначениеДляОтбора2 = ТекД["ТипОперацииНаТерминалеСдачи"];
		Если ТекД[ИмяПоля] = Истина Тогда
			ЗначениеДляОтбора1 = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
			ЗначениеДляОтбора2 = ПредопределенноеЗначение("Перечисление.ТипОперацииНаТерминале.ПустаяСсылка");
		КонецЕсли;
		ПроверитьИзменениеИОформить(Объект.Ссылка,"ТерминалСдачи",ЗначениеДляОтбора1,"ИдентификаторСтрокиТЧ",МассивИзменяемыхИдентификаторов,ИмяТЧ,ЭтоПолеАдреса);
		//ТекД["ТерминалСдачи"] = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
		ПроверитьИзменениеИОформить(Объект.Ссылка,"ТипОперацииНаТерминалеСдачи",ЗначениеДляОтбора2,"ИдентификаторСтрокиТЧ",МассивИзменяемыхИдентификаторов,ИмяТЧ,ЭтоПолеАдреса);
		//ТекД["ТипОперацииНаТерминалеСдачи"] = ПредопределенноеЗначение("Перечисление.ТипОперацииНаТерминале.ПустаяСсылка");
	КонецЕсли; 
	
	Если ИмяПоля = "НеТребуетсяАдрес" Тогда
		Если КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.Количество() > 0 Тогда
			//ДИТ Шевченко А.В. US 62421 ТА 67386 18.05.2023 -начало
			//ИмяПоляАдреса = КонтактнаяИнформацияОписаниеДополнительныхРеквизитов[0].ИмяРеквизита;
			//ЗначениеДляОтбора1 = ТекД[ИмяПоляАдреса];
			ЗначениеДляОтбора1 = ТекД["АдресКлиента"];
			//ДИТ Шевченко А.В. US 62421 ТА 67386 18.05.2023 -конец
			ЗначениеДляОтбора2 = ТекД["ТипОперацииНаСкладеКлиента"];
			Если ТекД[ИмяПоля] = Истина Тогда
				ЗначениеДляОтбора1 = ПредопределенноеЗначение("Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка"); //ДИТ Шевченко А.В. US 62421 ТА 67386 18.05.2023
				ЗначениеДляОтбора2 = ПредопределенноеЗначение("Перечисление.ТипОперацииНаТерминале.ПустаяСсылка");
			КонецЕсли;	
			//ЭтоПолеАдреса = Истина;
			ПроверитьИзменениеИОформить(Объект.Ссылка,"АдресКлиента",ЗначениеДляОтбора1,"ИдентификаторСтрокиТЧ",МассивИзменяемыхИдентификаторов,ИмяТЧ,ЭтоПолеАдреса); //ДИТ Шевченко А.В. US 62421 ТА 67386 18.05.2023
			ПроверитьИзменениеИОформить(Объект.Ссылка,"ТипОперацииНаСкладеКлиента",ЗначениеДляОтбора2,"ИдентификаторСтрокиТЧ",МассивИзменяемыхИдентификаторов,ИмяТЧ,ЭтоПолеАдреса);
			//ТекД["ТипОперацииНаСкладеКлиента"] = ПредопределенноеЗначение("Перечисление.ТипОперацииНаТерминале.ПустаяСсылка");
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыПередНачаломИзменения(Элемент, Отказ)
	ТекД = Элементы.Контейнеры.ТекущиеДанные;
	
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТЧ = Элемент.Имя;
	ИмяПоля = Сред(Элемент.ТекущийЭлемент.Имя, СтрДлина(ИмяТЧ)+1);
	Если ИмяПоля = "НеТребуетсяТерминалВыдачи" ИЛИ ИмяПоля = "НеТребуетсяТерминалСдачи" ИЛИ ИмяПоля = "НеТребуетсяАдрес" Тогда	
		МожноУстановить = ПроверитьВозможностьУстановкиПоляНеТребуется(ТекД,ТекД[ИмяПоля]);
		Если НЕ МожноУстановить Тогда
			Отказ = Истина;
		КонецЕсли;
		Если ИмяПоля = "НеТребуетсяТерминалВыдачи" И Не Отказ Тогда
			Если НЕ ТекД[ИмяПоля] Тогда
				ТекД.СтатусОтправкиЗапросаНаТерминалВыдачи = ПредопределенноеЗначение("Перечисление.СтатусОтправкиЗапросаНаТерминалВыдачи.НеТребуется");
			Иначе
				Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
					ТекД.СтатусОтправкиЗапросаНаТерминалВыдачи = ПолучитьСтатусОтправкиЗапросаНаТерминалВыдачиДоИзменения(Объект.Ссылка,ТекД.КлючАналитикиПеревозки);
					Если ТекД.СтатусОтправкиЗапросаНаТерминалВыдачи = ПредопределенноеЗначение("Перечисление.СтатусОтправкиЗапросаНаТерминалВыдачи.НеТребуется") Тогда
						ТекД.СтатусОтправкиЗапросаНаТерминалВыдачи = ПредопределенноеЗначение("Перечисление.СтатусОтправкиЗапросаНаТерминалВыдачи.НеОтправлен");
					КонецЕсли;	
				Иначе
					ТекД.СтатусОтправкиЗапросаНаТерминалВыдачи = ПредопределенноеЗначение("Перечисление.СтатусОтправкиЗапросаНаТерминалВыдачи.НеОтправлен");
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяПоля = "Отметка" И НЕ ТекД.Отметка Тогда
		//Отказ = (ТекД.СтатусЗаказаНаТС = ПредопределенноеЗначение("Перечисление.СтатусЗаказаНаТс.Закрыт") 
		//		ИЛИ ТекД.СтатусЗаказаНаТС = ПредопределенноеЗначение("Перечисление.СтатусЗаказаНаТс.ВыданВРейс")) 
		//		И НЕ ЗначениеЗаполнено(ТекД.КонтейнерФакт);
		//Если Отказ Тогда
		//	ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Отправка запроса на автоперевозку невозможна, так как заказ на ТС имеет статус ""%1""",ТекД.СтатусЗаказаНаТС));
		//	Возврат;
		//КонецЕсли;
		//Отказ = ТекД.СтатусЗапросаНаАвтоперевозку = ПредопределенноеЗначение("Перечисление.СтатусЗапросаНаПеревозку.Отменен");
		//Если Отказ Тогда
		//	ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Отправка запроса на автоперевозку невозможна, так как статус запроса ""%1""",ТекД.СтатусЗапросаНаАвтоперевозку));
		//	Возврат;
		//КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыНаименованиеГрузаПриИзменении(Элемент)
	ТекД = Элементы.Контейнеры.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		//ДИТ Шевченко А.В. US 62421 TA 64345 20.01.23 -начало
		//ОбновитьВидимостьДетализацияПоГрузу();
		//Если ТекД.Груз <> ПредопределенноеЗначение("Справочник.Грузы.СборнаяКонтейнернаяОтправка") Тогда
		//	Объект.ДетализацияПоГрузу.Очистить();	
		//КонецЕсли;
		//ДИТ Шевченко А.В. US 62421 TA 64345 20.01.23 -конец
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыГрузПриИзменении(Элемент) //ДИТ Шевченко А.В. US 62421 TA 64345 20.01.23
	ТекД = Элементы.Контейнеры.ТекущиеДанные;
		
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда	
		ТекД.ОбновленыИсходныеДанные = Истина;
		МассивИзменяемыхИдентификаторов = Новый Массив;
		МассивИзменяемыхИдентификаторов.Добавить(ТекД.ИдентификаторСтрокиТЧ);
		ПроверитьИзменениеИОформить(Объект.Ссылка,"Груз",ТекД.Груз,"ИдентификаторСтрокиТЧ",МассивИзменяемыхИдентификаторов,"Контейнеры",ЛОЖЬ);
	КонецЕсли;
	
	Если ТекД.Груз <> ПредопределенноеЗначение("Справочник.Грузы.СборнаяКонтейнернаяОтправка") Тогда
		СтруктураПоиска = Новый Структура("Ключ",ТекД.КлючАналитикиПеревозки);
		МассивСтрокДляУдаления = ДетализацияПоГрузу.НайтиСтроки(СтруктураПоиска);
		Для Каждого ЗнчМ Из МассивСтрокДляУдаления Цикл
			ДетализацияПоГрузу.Удалить(ЗнчМ);
		КонецЦикла;	
		ОбновитьВидимостьДетализацияПоГрузу(); 
	// ДИТ US 78234 ТА 78241 Сержантова А.С. Начало: 12.12.2023   
	Иначе
		Если ДетализацияПоГрузу.Количество() Тогда
			Найдено = ДетализацияПоГрузу.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки",ТекД.КлючАналитикиПеревозки));
			КоличествоМест = 0;
			ВесГруза = 0;
			Для Каждого СтрНайдено Из Найдено Цикл 
				КоличествоМест = КоличествоМест + СтрНайдено.КоличествоМест;
				ВесГруза = ВесГруза + СтрНайдено.ВесГруза;
			КонецЦикла;	 
			ТекСтрока = Объект.Контейнеры.НайтиПоИдентификатору(Элементы.Контейнеры.ТекущаяСтрока);     
			ТекСтрока.ВесГрузаНетто = ВесГруза;
			ТекСтрока.КоличествоМест = КоличествоМест;
		КонецЕсли;
	// ДИТ US 78234 ТА 78241 Сержантова А.С. Конец: 12.12.2023
	КонецЕсли;  
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Начало: 11.12.2023
	// Было:
	//ДобавитьЗначениеРеквизитаВКлюч(ТекД.КлючАналитикиПеревозки,ТекД.Груз,"Груз",,ДетализацияПоГрузу,ТекД.ВерсияКлюча);   
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Конец: 11.12.2023
	Если ТекД <> неопределено Тогда
		ОбновитьВидимостьДетализацияПоГрузу();
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура КонтейнерыАдресСкладаКлиентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуВводаАдреса(ЭтаФорма,Новый Структура("ЭлементФормыАдреса","Контейнеры"));
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыОтметкаПриИзменении(Элемент)
	МодифицированностьФормы = ЭтаФорма.Модифицированность;	
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекД = Элементы.Контейнеры.ТекущиеДанные;
	
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТЧ = Элемент.Имя;
	ИмяПоля = Сред(Элемент.ТекущийЭлемент.Имя, СтрДлина(ИмяТЧ)+1);
	
	//Евросиб Коханенко Н.А. 11.02.2026 (( BUG 130030 TA 130694 
	//Если ИмяПоля = "Отметка" Тогда
	//	ЭтаФорма.Модифицированность = МодифицированностьФормы;
	Если ИмяПоля = "Отметка" 
		ИЛИ ИмяПоля = "ОбновленыИсходныеДанные" Тогда
		ЭтаФорма.Модифицированность = МодифицированностьФормы;           
	Иначе
		МодифицированностьФормы = Истина;
		ЭтаФорма.Модифицированность = МодифицированностьФормы;
	//Евросиб Коханенко Н.А. 11.02.2026 )) BUG 130030 TA 130694 
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДетализацияПоГрузу

&НаКлиенте
Процедура ДетализацияПоГрузуПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 начало
	//Если НоваяСтрока Тогда
	//	Элементы.ДетализацияПоГрузу.ТекущиеДанные.ГУИДСтроки = Элементы.ДетализацияПоГрузу.ОтборСтрок.ГУИДСтроки;
	//	СтруктураПоиска = Новый Структура("ГУИДСтроки",Элементы.ДетализацияПоГрузу.ОтборСтрок.ГУИДСтроки);
	//	НайденныеСтроки = Объект.ДетализацияПоГрузу.НайтиСтроки(СтруктураПоиска);
	//	МаксНомер = 0;
	//	Для Каждого НайдСтрока Из НайденныеСтроки Цикл
	//		Если НайдСтрока.НомерСтрокиПоГуидам > МаксНомер Тогда
	//			МаксНомер = НайдСтрока.НомерСтрокиПоГуидам;
	//		КонецЕсли;	
	//	КонецЦикла;
	//	Элементы.ДетализацияПоГрузу.ТекущиеДанные.НомерСтрокиПоГуидам = МаксНомер + 1;
	//КонецЕсли;
	
	Если НоваяСтрока Тогда
		Элементы.ДетализацияПоГрузу.ТекущиеДанные.Ключ = Элементы.ДетализацияПоГрузу.ОтборСтрок.Ключ;
		СтруктураПоиска = Новый Структура("Ключ",Элементы.ДетализацияПоГрузу.ОтборСтрок.Ключ);
		НайденныеСтроки = ДетализацияПоГрузу.НайтиСтроки(СтруктураПоиска);
		МаксНомер = 0;
		Для Каждого НайдСтрока Из НайденныеСтроки Цикл
			Если НайдСтрока.НомерСтрокиПоГуидам > МаксНомер Тогда
				МаксНомер = НайдСтрока.НомерСтрокиПоГуидам;
			КонецЕсли;	
		КонецЦикла;
		Элементы.ДетализацияПоГрузу.ТекущиеДанные.НомерСтрокиПоГуидам = МаксНомер + 1;
	КонецЕсли;
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 конец
КонецПроцедуры

&НаКлиенте
Процедура ДетализацияПоГрузуПриИзменении(Элемент)
	
	Объект.ДанныеДетализацииГрузаБылиИзменены = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДетализацияПоГрузуКоличествоМестПриИзменении(Элемент)
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 начало
	//ТекД = Элементы.ДетализацияПоГрузу.ТекущиеДанные;
	//Если ТекД <> Неопределено Тогда
	//	СтруктураПоиска = Новый Структура("ГУИДСтроки",ТекД.ГУИДСтроки);
	//	НайденныеСтроки = Объект.ДетализацияПоГрузу.НайтиСтроки(СтруктураПоиска);
	//	ИтогПоГуиду = 0;
	//	Для Каждого НайдСтрока Из НайденныеСтроки Цикл
	//		ИтогПоГуиду = ИтогПоГуиду + НайдСтрока.КоличествоМест;
	//	КонецЦикла;	
	//КонецЕсли;
	//
	//ПроверитьИИзменитьКоличествоВес(ТекД.ГУИДСтроки,ИтогПоГуиду,"КоличествоМест");
	
	ТекД = Элементы.ДетализацияПоГрузу.ТекущиеДанные;
	Если ТекД <> Неопределено Тогда
		СтруктураПоиска = Новый Структура("Ключ",ТекД.Ключ);
		НайденныеСтроки = ДетализацияПоГрузу.НайтиСтроки(СтруктураПоиска);
		ИтогПоГуиду = 0;
		Для Каждого НайдСтрока Из НайденныеСтроки Цикл
			ИтогПоГуиду = ИтогПоГуиду + НайдСтрока.КоличествоМест;
		КонецЦикла;	
	КонецЕсли;
	
	ПроверитьИИзменитьКоличествоВес(ТекД.Ключ,ИтогПоГуиду,"КоличествоМест");
	СтруктураПоиска = Новый Структура("КлючАналитикиПеревозки",ТекД.Ключ);
	НайденныеСтроки = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска); 
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Начало: 11.12.2023
	// Было:
	//ДобавитьЗначениеРеквизитаВКлюч(ТекД.Ключ,"","",,ДетализацияПоГрузу,НайденныеСтроки[0].ВерсияКлюча); 
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Конец: 11.12.2023

	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 конец 
	
	//// ДИТ US 78234 ТА 78241 Сержантова А.С. Начало: 21.12.2023  //ДИТ US 76935 ТА 78648 Сержантова А.С. 21.12.2023
	//ДобавитьЗначениеРеквизитаВКлюч(ТекД.Ключ,ИтогПоГуиду,"КоличествоМест",,ДетализацияПоГрузу,НайденныеСтроки[0].ВерсияКлюча);
	//// ДИТ US 78234 ТА 78241 Сержантова А.С. Конец: 21.12.2023

КонецПроцедуры

&НаКлиенте
Процедура ДетализацияПоГрузуВесГрузаПриИзменении(Элемент)
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 начало
	//ТекД = Элементы.ДетализацияПоГрузу.ТекущиеДанные;
	//Если ТекД <> Неопределено Тогда
	//	СтруктураПоиска = Новый Структура("ГУИДСтроки",ТекД.ГУИДСтроки);
	//	НайденныеСтроки = Объект.ДетализацияПоГрузу.НайтиСтроки(СтруктураПоиска);
	//	ИтогПоГуиду = 0;
	//	Для Каждого НайдСтрока Из НайденныеСтроки Цикл
	//		ИтогПоГуиду = ИтогПоГуиду + НайдСтрока.ВесГруза;
	//	КонецЦикла;	
	//КонецЕсли;
	
	ТекД = Элементы.ДетализацияПоГрузу.ТекущиеДанные;
	Если ТекД <> Неопределено Тогда
		СтруктураПоиска = Новый Структура("Ключ",ТекД.Ключ);
		НайденныеСтроки = ДетализацияПоГрузу.НайтиСтроки(СтруктураПоиска);
		ИтогПоГуиду = 0;
		Для Каждого НайдСтрока Из НайденныеСтроки Цикл
			ИтогПоГуиду = ИтогПоГуиду + НайдСтрока.ВесГруза;
		КонецЦикла;	
	КонецЕсли;
	
	ПроверитьИИзменитьКоличествоВес(ТекД.Ключ,ИтогПоГуиду,"ВесГрузаНетто");
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Начало: 11.12.2023
	// Было:
	//СтруктураПоиска = Новый Структура("КлючАналитикиПеревозки",ТекД.Ключ);
	//НайденныеСтроки = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска); 
	//ДобавитьЗначениеРеквизитаВКлюч(ТекД.Ключ,"","",,ДетализацияПоГрузу,НайденныеСтроки[0].ВерсияКлюча);
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Конец: 11.12.2023
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 конец   
	
	//// ДИТ US 78234 ТА 78241 Сержантова А.С. Начало: 21.12.2023  //ДИТ US 76935 ТА 78648 Сержантова А.С. 21.12.2023
	//ДобавитьЗначениеРеквизитаВКлюч(ТекД.Ключ,ИтогПоГуиду,"ВесГруза",,ДетализацияПоГрузу,НайденныеСтроки[0].ВерсияКлюча);
	//// ДИТ US 78234 ТА 78241 Сержантова А.С. Конец: 21.12.2023

КонецПроцедуры

&НаКлиенте
Процедура ДетализацияПоГрузуРодУпаковкиПриИзменении(Элемент)
	ТекД = Элементы.ДетализацияПоГрузу.ТекущиеДанные;   
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Начало: 11.12.2023
	// Было:
	//СтруктураПоиска = Новый Структура("КлючАналитикиПеревозки",ТекД.Ключ);
	//НайденныеСтроки = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска);
	//ДобавитьЗначениеРеквизитаВКлюч(ТекД.Ключ,"","",,ДетализацияПоГрузу,НайденныеСтроки[0].ВерсияКлюча);    
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Конец: 11.12.2023
КонецПроцедуры

&НаКлиенте
Процедура ДетализацияПоГрузуГрузПриИзменении(Элемент)
	ТекД = Элементы.ДетализацияПоГрузу.ТекущиеДанные; 
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Начало: 11.12.2023
	// Было:
	//СтруктураПоиска = Новый Структура("КлючАналитикиПеревозки",ТекД.Ключ);
	//НайденныеСтроки = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска);
	//ДобавитьЗначениеРеквизитаВКлюч(ТекД.Ключ,"","",,ДетализацияПоГрузу,НайденныеСтроки[0].ВерсияКлюча);   
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Конец: 11.12.2023
КонецПроцедуры

&НаКлиенте
Процедура ДетализацияПоГрузуПослеУдаления(Элемент)
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 начало
	//ТекД = Элемент.ТекущиеДанные;
	//Если ТекД <> Неопределено Тогда
	//	СтруктураПоиска = Новый Структура("ГУИДСтроки",ТекД.ГУИДСтроки);
	//	НайденныеСтроки = Объект.ДетализацияПоГрузу.НайтиСтроки(СтруктураПоиска);
	//	НомерСтроки = 0;
	//	Для Каждого НайдСтрока Из НайденныеСтроки Цикл
	//		НомерСтроки = НомерСтроки + 1;
	//		НайдСтрока.НомерСтрокиПоГуидам = НомерСтроки;
	//	КонецЦикла;
	//КонецЕсли;
	
	ТекД = Элемент.ТекущиеДанные;
	Если ТекД <> Неопределено Тогда
		СтруктураПоиска = Новый Структура("Ключ",ТекД.Ключ);
		НайденныеСтроки = ДетализацияПоГрузу.НайтиСтроки(СтруктураПоиска);
		НомерСтроки = 0;
		Для Каждого НайдСтрока Из НайденныеСтроки Цикл
			НомерСтроки = НомерСтроки + 1;
			НайдСтрока.НомерСтрокиПоГуидам = НомерСтроки;
		КонецЦикла;
	КонецЕсли;         
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Начало: 11.12.2023
	// Было:
	//СтруктураПоиска = Новый Структура("КлючАналитикиПеревозки",Элементы.ДетализацияПоГрузу.ОтборСтрок.Ключ);
	//НайденныеСтроки = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска);
	//ДобавитьЗначениеРеквизитаВКлюч(НайденныеСтроки[0].КлючАналитикиПеревозки,"","",,ДетализацияПоГрузу,НайденныеСтроки[0].ВерсияКлюча);
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Конец: 11.12.2023
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 конец
КонецПроцедуры

&НаКлиенте
Процедура ДетализацияПоГрузуПередУдалением(Элемент, Отказ)
	ТекД = Элемент.ТекущиеДанные;
	Если ТекД <> Неопределено Тогда
		
		//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 начало
		//СтруктураПоиска = Новый Структура("ГУИДСтроки",ТекД.ГУИДСтроки);
		//НайденныеСтроки = Объект.ДетализацияПоГрузу.НайтиСтроки(СтруктураПоиска);
		//ИтогПоГуидуКоличествоМест = 0;
		//ИтогПоГуидуВес 			  = 0;
		//Для Каждого НайдСтрока Из НайденныеСтроки Цикл
		//	Если НайдСтрока.ПолучитьИдентификатор() = Элемент.ТекущаяСтрока Тогда
		//		Продолжить;
		//	КонецЕсли;	
		//	ИтогПоГуидуКоличествоМест = ИтогПоГуидуКоличествоМест + НайдСтрока.КоличествоМест;
		//	ИтогПоГуидуВес 			  = ИтогПоГуидуВес + НайдСтрока.ВесГруза;
		//КонецЦикла;
		//ПроверитьИИзменитьКоличествоВес(ТекД.ГУИДСтроки,ИтогПоГуидуКоличествоМест,"КоличествоМест");
		//ПроверитьИИзменитьКоличествоВес(ТекД.ГУИДСтроки,ИтогПоГуидуВес,"ВесГрузаНетто");
		
		СтруктураПоиска = Новый Структура("Ключ",ТекД.Ключ);
		НайденныеСтроки = ДетализацияПоГрузу.НайтиСтроки(СтруктураПоиска);
		ИтогПоГуидуКоличествоМест = 0;
		ИтогПоГуидуВес 			  = 0;
		Для Каждого НайдСтрока Из НайденныеСтроки Цикл
			Если НайдСтрока.ПолучитьИдентификатор() = Элемент.ТекущаяСтрока Тогда
				Продолжить;
			КонецЕсли;	
			ИтогПоГуидуКоличествоМест = ИтогПоГуидуКоличествоМест + НайдСтрока.КоличествоМест;
			ИтогПоГуидуВес 			  = ИтогПоГуидуВес + НайдСтрока.ВесГруза;
		КонецЦикла;
		ПроверитьИИзменитьКоличествоВес(ТекД.Ключ,ИтогПоГуидуКоличествоМест,"КоличествоМест");
		ПроверитьИИзменитьКоличествоВес(ТекД.Ключ,ИтогПоГуидуВес,"ВесГрузаНетто");
        //ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 конец
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЛистСогласования(Команда)
	
	ТабДок = МаршрутизацияСервер.ПолучитьТабдокЛистаСогласования(Объект.Ссылка);
	ТабДок.Показать();
	
КонецПроцедуры

&НаКлиенте
Процедура Рецензирование(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаРецензирования", ЭтаФорма);
	ПараметрыФормы = Новый Структура("РецензОбъект", Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.РецензированиеПриСогласовании", ПараметрыФормы,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Делегировать(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ВыборДелегирования", ЭтаФорма);
	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаВыбора",,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьКТКвДК(Команда)
	
	МассивУдовлетворяющихСтатусов = Новый Массив;
	МассивУдовлетворяющихСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.СтатусЗаказаНаТс.ВыданВРейс"));
	МассивУдовлетворяющихСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.СтатусЗаказаНаТс.Закрыт"));
	МассивУдовлетворяющихСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.СтатусЗаказаНаТс.Отменен"));
	
	Для Каждого СтрокаТЧ из Объект.Контейнеры Цикл
		Если НЕ СтрокаТЧ.Отметка Тогда
			Продолжить;
		КонецЕсли;
		Если МассивУдовлетворяющихСтатусов.Найти(СтрокаТЧ.СтатусЗаказаНаТС) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		//ДИТ Шевченко А.В. US 62421 TA 64345 20.01.23 -начало
		КонтейнерП = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(СтрокаТЧ.КлючАналитикиПеревозки,"Контейнер");
		
		Если ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(КонтейнерП,"Наименование") = СтрокаТЧ.КонтейнерФакт Тогда
			Продолжить;
		КонецЕсли;
		ЗаменитьКонтейнерИКонтейнерФакт(СтрокаТЧ.КонтейнерФакт,КонтейнерП,СтрокаТЧ.ИдентификаторСтрокиТЧ,"Контейнер",СтрокаТЧ.НомерЗаказаНаТС,СтрокаТЧ.ТипКТК,СтрокаТЧ.КлючАналитикиПеревозки,СтрокаТЧ.ВерсияКлюча);
		//ДИТ Шевченко А.В. US 62421 TA 64345 20.01.23 -конец
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьКТКвТЛ(Команда)
	МассивУдовлетворяющихСтатусов = Новый Массив;
	МассивУдовлетворяющихСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.СтатусЗаказаНаТс.ВыданВРейс"));
	МассивУдовлетворяющихСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.СтатусЗаказаНаТс.Закрыт"));
	МассивУдовлетворяющихСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.СтатусЗаказаНаТс.Отменен"));
	
	Для Каждого СтрокаТЧ из Объект.Контейнеры Цикл
		Если НЕ СтрокаТЧ.Отметка Тогда
			Продолжить;
		КонецЕсли;
		Если МассивУдовлетворяющихСтатусов.Найти(СтрокаТЧ.СтатусЗаказаНаТС) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		//ДИТ Шевченко А.В. US 62421 TA 64345 20.01.23 -начало
		КонтейнерП = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(СтрокаТЧ.КлючАналитикиПеревозки,"Контейнер");
		
		Если ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(КонтейнерП,"Наименование") = СтрокаТЧ.КонтейнерФакт Тогда
			Продолжить;
		КонецЕсли;
		ЗаменитьКонтейнерИКонтейнерФакт(КонтейнерП,СтрокаТЧ.КонтейнерФакт,СтрокаТЧ.ИдентификаторСтрокиТЧ,"КонтейнерФакт");
		//ДИТ Шевченко А.В. US 62421 TA 64345 20.01.23 -конец
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДетализацияПоГрузу(Команда)
	Элементы.ДетализацияПоГрузу.Видимость = НЕ Элементы.ДетализацияПоГрузу.Видимость;
	//Евросиб Коханенко Н.А. 05.10.2023 (( US 75549 TA 75773 
	//показываем только одну таблицу из двух ниже таблицы Контейнеры
	Если Элементы.ДополнительныеАдресаКлиента.Видимость И Элементы.ДетализацияПоГрузу.Видимость Тогда
		Элементы.ДополнительныеАдресаКлиента.Видимость = Ложь;
	КонецЕсли;
	//Евросиб Коханенко Н.А. 05.10.2023 )) US 75549 TA 75773
КонецПроцедуры

&НаКлиенте
Процедура Отметить(Команда)
	Для Каждого СтрокаТЧ из Объект.Контейнеры Цикл
		
		Пропустить = (СтрокаТЧ.СтатусЗаказаНаТС = ПредопределенноеЗначение("Перечисление.СтатусЗаказаНаТс.Закрыт") 
		ИЛИ СтрокаТЧ.СтатусЗаказаНаТС = ПредопределенноеЗначение("Перечисление.СтатусЗаказаНаТс.ВыданВРейс")) 
		И НЕ ЗначениеЗаполнено(СтрокаТЧ.КонтейнерФакт);
		
		Если Пропустить Тогда
			Продолжить;
		КонецЕсли;	
		
		Пропустить = СтрокаТЧ.СтатусЗапросаНаАвтоперевозку = ПредопределенноеЗначение("Перечисление.СтатусЗапросаНаПеревозку.Отменен");
		
		Если Пропустить Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТЧ.Отметка = Истина;
	КонецЦикла;
	МодифицированностьФормы = ЭтаФорма.Модифицированность;
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметку(Команда)
	Для Каждого СтрокаТЧ из Объект.Контейнеры Цикл 
		СтрокаТЧ.Отметка = Ложь;
	КонецЦикла;
	МодифицированностьФормы = ЭтаФорма.Модифицированность;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтроки(Команда)
	
	СтруктураОтбора = Новый Структура("Отметка",Истина);
	НайденныеСтроки = Объект.Контейнеры.НайтиСтроки(СтруктураОтбора);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	Для Каждого СтрокаТч Из НайденныеСтроки Цикл
		Если СтрокаТч.СтатусЗапросаНаАвтоперевозку = ПредопределенноеЗначение("Перечисление.СтатусЗапросаНаПеревозку.Отменен") Тогда
			Продолжить;
		КонецЕсли;	
		НомераНеУдаленныхСтрок  				= Новый Массив;
		НомераСтрокСоСтатусомЗаказаВыданВРейс 	= Новый Массив;
		НомераСтрокСоСтатусомЗаказаЗакрыт 		= Новый Массив;
		Если НЕ ЗначениеЗаполнено(СтрокаТч.ИдентификаторСтрокиУслуги) Тогда
			Если СтрокаТч.СтатусЗаказаНаТС = ПредопределенноеЗначение("Перечисление.СтатусЗаказаНаТс.ВыданВРейс") Тогда
				НомераСтрокСоСтатусомЗаказаВыданВРейс.Добавить(СтрокаТч.НомерСтроки);
				Продолжить;
			КонецЕсли;
			Если СтрокаТч.СтатусЗаказаНаТС = ПредопределенноеЗначение("Перечисление.СтатусЗаказаНаТс.Закрыт") Тогда
				НомераСтрокСоСтатусомЗаказаЗакрыт.Добавить(СтрокаТч.НомерСтроки);
				Продолжить;
			КонецЕсли;
			СтрокаТч.СтатусЗапросаНаАвтоперевозку = ПредопределенноеЗначение("Перечисление.СтатусЗапросаНаПеревозку.Отменен");
			
            МассивНомеровСтрок = ПолучитьНомераСтрокДляПередачиКлиентуДанныхПоАвтоперевозке();
			Если МассивНомеровСтрок.Количество() = 0 Тогда
				МассивНаУдаление = Новый Массив;
				НайденноеСостояние = Объект.Состояния.НайтиСтроки(Новый Структура("Состояние",ПредопределенноеЗначение("Справочник.Состояния.ПередатьКлиентуДанныеПоАвтоперевозке")));
				Если НайденноеСостояние.Количество() > 0 Тогда
					Если НЕ НайденноеСостояние[0].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен") Тогда
						МассивНаУдаление.Добавить(НайденноеСостояние[0]);	
					КонецЕсли;	
				КонецЕсли;
				Если МассивНаУдаление.Количество() > 0 Тогда
					Объект.Состояния.Удалить(МассивНаУдаление);
				КонецЕсли;
			КонецЕсли;
				
			Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
				СтрокаТч.ОбновленыИсходныеДанные = Истина;
			КонецЕсли;
			СтрокаТч.Отметка = Ложь;	
			ОбновитьТаблицуОформления("СтатусЗапросаНаАвтоперевозку","ИдентификаторСтрокиТЧ",СтрокаТч.ИдентификаторСтрокиТЧ,"Контейнеры");				
		Иначе
			НомераНеУдаленныхСтрок.Добавить(СтрокаТч.НомерСтроки);		
		КонецЕсли;		
	КонецЦикла;		
	
	Если НомераНеУдаленныхСтрок.Количество() > 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Строки %1 не были удалены, так как ручное удаление доступно только для строк, добавленных из запроса на КТК и отсутствующих на закладке Услуги в Заявке.",СтрСоединить(НомераНеУдаленныхСтрок,",")));
	КонецЕсли;
	
	Для Каждого СтрокаМ Из НомераСтрокСоСтатусомЗаказаВыданВРейс Цикл
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Удаление строки %1 невозможно, так как текущий статус заказа на ТС ""Выдан в рейс"" и не допускает внесения изменений.",СтрокаМ));	
	КонецЦикла;
	
	Для Каждого СтрокаМ Из НомераСтрокСоСтатусомЗаказаЗакрыт Цикл
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Удаление строки %1 невозможно, так как текущий статус заказа на ТС ""Закрыт"" и не допускает внесения изменений.",СтрокаМ));	
	КонецЦикла;
	
	УстановитьВидимостьКомандыДобавитьУдаленныеКТКВЗапрос();
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнятьВнизДействие(Команда)
	Элементы.КонтейнерыЗаполнятьВниз.Пометка = НЕ Элементы.КонтейнерыЗаполнятьВниз.Пометка;
	ЗаполнятьВниз = Элементы.КонтейнерыЗаполнятьВниз.Пометка;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИзЗаявки(Команда)
	
	ЭтаФорма.Прочитать(); 
	
	//Евросиб Коханенко Н.А. 25.12.2024 (( #97950 
	Если Объект.ЭтапПеревозки = ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.СредняяМиля") Тогда
		Ответ = ОбновитьЗапросПоСреднейМилеИзЗаявкиНаСервере();    
		Возврат;
	КонецЕсли;
	//Евросиб Коханенко Н.А. 25.12.2024 )) #97950 

	// ДИТ US 78243 ТА 80825 Сержантова А.С. Начало: 08.02.2024 
	//для первой мили проверяем есть ли строки, которые имеют значение "Силами Евросиб" в способе автоперевозки 
	//И имеют принадлежность = "КТК Евросиб" И имеют не заполненное поле "Релиз" ссылкой на документ релиз клиента
	Если Объект.ЭтапПеревозки = ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПерваяМиля") Тогда
	    НомераСтрокБезРелиза = ОпределитьСтрокиПоУсловиюПустогоРелиза(); 
		Если НомераСтрокБезРелиза.Количество() > 0 Тогда
		    Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОСоставеСтрокВЗаявкеНаАвто", ЭтотОбъект,);
			Если НомераСтрокБезРелиза.Количество() = 1 Тогда
				ТекстВопроса = СтрШаблон("Строка №%1 в заявке не связана с релизом клиента.
				|Продолжить перенос таких строк в запрос на автоперевозку?", НомераСтрокБезРелиза[0]);
			Иначе
			    ТекстВопроса = СтрШаблон("Строки №%1 в заявке не связаны с релизом клиента.
				|Продолжить перенос таких строк в запрос на автоперевозку?", СтрСоединить(НомераСтрокБезРелиза, ", "));
			КонецЕсли;                        
			КнопкиОтветов = Новый СписокЗначений;
			КнопкиОтветов.Добавить(КодВозвратаДиалога.Да, "Продолжить");
			КнопкиОтветов.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
			ПоказатьВопрос(Оповещение, ТекстВопроса, КнопкиОтветов, 0);
	    	Возврат; 
		КонецЕсли;
	КонецЕсли;
	// ДИТ US 78243 ТА 80825 Сержантова А.С. Конец: 08.02.2024
		
	Ответ = ОбновитьИзЗаявкиНаСервере();    
	
	// ДИТ US 81881 ТА 81882 Сержантова А.С. Начало: 04.04.2024 
	//если было заполнение заявки и есть дубли терминалов выдачи, то спрашиваем у пользователя какой установить терминал выдачи в Контейнерах
	Если СписокДублейТерминаловИзРейса.Количество() Тогда
		ВопросВыборТерминаловВыдачи();
	КонецЕсли;
	// ДИТ US 81881 ТА 81882 Сержантова А.С. Конец: 04.04.2024
	
	// ДИТ US 80736 ТА 81088 Сержантова А.С. Начало: 27.02.2024
	БылоОбновлениеИзЗаявки = Истина;
	// ДИТ US 80736 ТА 81088 Сержантова А.С. Конец: 27.02.2024
	
	Если Ответ.МассивНомеровСтрокВыданВРейс.Количество() > 0 ИЛИ Ответ.МассивНомеровСтрокЗакрыт.Количество() > 0 Тогда
		
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить(КодВозвратаДиалога.Да,"Да");
		СписокКнопок.Добавить(КодВозвратаДиалога.Нет,"Нет");
		ТекстВопроса = "";
		Если Ответ.МассивНомеровСтрокВыданВРейс.Количество() > 0 Тогда
			ТекстВопроса = СтрШаблон("Обновление данных по строке %1 невозможно, так как текущий статус заказа на ТС Выдан в рейс.",СтрСоединить(Ответ.МассивНомеровСтрокВыданВРейс,","));
			ТекстВопроса = ТекстВопроса + Символы.ПС  + Символы.ПС;
		КонецЕсли;
		Если Ответ.МассивНомеровСтрокЗакрыт.Количество() > 0 Тогда	
			ТекстВопроса = ТекстВопроса + СтрШаблон("Обновление данных по строке %1 невозможно, так как текущий статус заказа на ТС Закрыт.",СтрСоединить(Ответ.МассивНомеровСтрокЗакрыт,","));
			ТекстВопроса = ТекстВопроса + Символы.ПС + Символы.ПС;
		КонецЕсли;
		ТекстВопроса = ТекстВопроса + "Произвести обновление доступных строк ?";
		
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбОбновлении", ЭтотОбъект, Новый Структура("АдресХранилища,КоличествоНеДобавленных",Ответ.АдресХранилища,Ответ.КоличествоНеДобавленных));
		ПоказатьВопрос(Оповещение, ТекстВопроса, СписокКнопок, 60,КодВозвратаДиалога.Нет,,КодВозвратаДиалога.Нет);
	КонецЕсли;
	
	УстановитьВидимостьКомандыДобавитьУдаленныеКТКВЗапрос();
	УстановитьПросмотрСтатусОтправкиЗапросаНаТерминалВыдачи(); //ДИТ Шевченко А.В. US 62487 ТА 68012 04.05.2023
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -начало
	ЗаполнитьТаблицуПоКлючамАналитики(,Истина); // ДИТ US 78243 ТА 80825 Сержантова А.С. 08.02.2024)
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -конец
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьНомерДатуЗаказаНаТС();
	КонецЕсли;
	
	//Евросиб Коханенко Н.А. 07.02.2024 (( #80805
	Для Каждого СтрокаКонтейнеры Из Объект.Контейнеры Цикл 
		Если НЕ СтрокаКонтейнеры.НеТребуетсяТерминалВыдачи Тогда
			СтрокаКонтейнеры.ТипОперацииНаТерминалеВыдачи = ТипОперацииНаТерминалеВыдачиПоУмолчанию;
		КонецЕсли;
		Если НЕ СтрокаКонтейнеры.НеТребуетсяАдрес Тогда
			СтрокаКонтейнеры.ТипОперацииНаСкладеКлиента = ТипОперацииНаСкладеКлиентаПоУмолчанию;
		КонецЕсли;
		Если НЕ СтрокаКонтейнеры.НеТребуетсяТерминалСдачи Тогда
			СтрокаКонтейнеры.ТипОперацииНаТерминалеСдачи = ТипОперацииНаТерминалеСдачиПоУмолчанию;
		КонецЕсли;
	КонецЦикла;
	//Евросиб Коханенко Н.А. 07.02.2024 )) #80805 

	//БИТ Белинский Д.А. 10.04.2023 -начало
	КонтрагентДирекцияКонтейнерныхПеревозок = Ложь;
	Если ЭтоДирекцияКонтейнерныхПеревозок() Тогда 
		КонтрагентДирекцияКонтейнерныхПеревозок = Истина;	
	КонецЕсли;
	
	Если КонтрагентДирекцияКонтейнерныхПеревозок Тогда
		Для Каждого СтрокаКонтейнеры Из Объект.Контейнеры Цикл
			СтрокаКонтейнеры.НеТребуетсяАдрес = Истина;
			СтрокаКонтейнеры.ТипОперацииНаТерминалеВыдачи = ПредопределенноеЗначение("Перечисление.ТипОперацииНаТерминале.ПриемПорожнегоКТК");
			СтрокаКонтейнеры.ТипОперацииНаТерминалеСдачи = ПредопределенноеЗначение("Перечисление.ТипОперацииНаТерминале.СдачаПорожнегоКТК");
		КонецЦикла;
		ВыбранКонтрагентДирекцияКонтейнерныхПеревозок = Истина;
	ИначеЕсли ВыбранКонтрагентДирекцияКонтейнерныхПеревозок Тогда
		Для Каждого СтрокаКонтейнеры Из Объект.Контейнеры Цикл
			СтрокаКонтейнеры.НеТребуетсяАдрес = Ложь;
			СтрокаКонтейнеры.ТипОперацииНаТерминалеВыдачи = Неопределено;
			СтрокаКонтейнеры.ТипОперацииНаТерминалеСдачи = Неопределено;
		КонецЦикла;
		ВыбранКонтрагентДирекцияКонтейнерныхПеревозок = Ложь;
    КонецЕсли;
	
	УстановитьВидимостьПолейПоДирекцииКонтенерныхПеревозок();
	//БИТ Белинский Д.А. 10.04.2023 -конец          

	//Евросиб Коханенко Н.А. 12.03.2024 (( #82185 
	УстановитьОбязательностьЗаполненияПолейДляИмпортМоре();
	//Евросиб Коханенко Н.А. 12.03.2024 )) #82185 
	
	//Евросиб Коханенко Н.А. 24.04.2024 (( #84617
	ОбновитьУчетныеНаправленияИзЗаявкиНаСервере();
	//Евросиб Коханенко Н.А. 24.04.2024 )) #84617 
	
КонецПроцедуры   

// ДИТ US 78243 ТА 80825 Сержантова А.С. 08.02.2024
&НаСервере
Функция ОпределитьСтрокиПоУсловиюПустогоРелиза()
	
	Результат = Новый Массив;
	ТаблицаУслуг = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Заявка, "СоставУслуги");
	ТаблицаДляПроверки = ТаблицаУслуг.Выгрузить();  
	// Евросиб(ДИТ) BUG 89499 ТА 89615 Сержантова А.С. Начало: 08.08.2024 
	// Проверяем релиз для всех строк, а не только для новых добавленных. Иначе строки Отменяются(
	//ТаблицаТекущихСтрок = Объект.Контейнеры.Выгрузить(,"ИдентификаторСтрокиУслуги"); 
	// Евросиб(ДИТ) BUG 89499 ТА 89615 Сержантова А.С. Конец: 08.08.2024
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоставУслуги.НомерСтроки КАК НомерСтроки,
		|	СоставУслуги.ГУИДСтроки КАК ГУИДСтроки,
		|	СоставУслуги.ПерваяМиля КАК ПерваяМиля,
		|	СоставУслуги.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
		|	СоставУслуги.Релиз КАК Релиз
		|ПОМЕСТИТЬ ВТ_ИсходныеДанные
		|ИЗ
		|	&СоставУслуги КАК СоставУслуги
		|;
		|
		// Евросиб(ДИТ) BUG 89499 ТА 89615 Сержантова А.С. Начало: 08.08.2024
		// Было:
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ТекущиеСтроки.ИдентификаторСтрокиУслуги КАК ГУИДСтроки
		//|ПОМЕСТИТЬ ВТ_ПеренесенныеСтроки
		//|ИЗ
		//|	&ПеренесенныеСтроки КАК ТекущиеСтроки
		//|;
		//|  
		// Евросиб(ДИТ) BUG 89499 ТА 89615 Сержантова А.С. Конец: 08.08.2024
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ИсходныеДанные.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
		|ГДЕ
		|	ВТ_ИсходныеДанные.ПерваяМиля = ЗНАЧЕНИЕ(Перечисление.ВариантыАвтоперевозки.СиламиЕвросиб)
		|	И ВТ_ИсходныеДанные.ПринадлежностьТЕ = ЗНАЧЕНИЕ(Перечисление.ПринадлежностьТЕ.КТЕвросиба)
		|	И ВТ_ИсходныеДанные.Релиз В (ЗНАЧЕНИЕ(Документ.РелизКлиента.ПустаяСсылка), ЗНАЧЕНИЕ(Документ.РелизСобственника.ПустаяСсылка), НЕОПРЕДЕЛЕНО)";
		// Евросиб(ДИТ) BUG 89499 ТА 89615 Сержантова А.С. Начало: 08.08.2024
		// Было:
		//|	И НЕ ВТ_ИсходныеДанные.ГУИДСтроки В
		//|				(ВЫБРАТЬ
		//|					Т.ГУИДСтроки
		//|				ИЗ
		//|					ВТ_ПеренесенныеСтроки КАК Т)"; 
		// Евросиб(ДИТ) BUG 89499 ТА 89615 Сержантова А.С. Конец: 08.08.2024
	Запрос.УстановитьПараметр("СоставУслуги", ТаблицаДляПроверки);     
	// Евросиб(ДИТ) BUG 89499 ТА 89615 Сержантова А.С. Начало: 08.08.2024
	//Запрос.УстановитьПараметр("ПеренесенныеСтроки", ТаблицаТекущихСтрок); 
	// Евросиб(ДИТ) BUG 89499 ТА 89615 Сержантова А.С. Конец: 08.08.2024
	РезультатЗапроса = Запрос.Выполнить();
	Если не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Результат.Добавить(Выборка.НомерСтроки);			
		КонецЦикла;
	КонецЕсли;   
	
	Возврат Результат;

КонецФункции

// ДИТ US 78243 ТА 80825 Сержантова А.С. 08.02.2024
&НаКлиенте
Процедура ПослеЗакрытияВопросаОСоставеСтрокВЗаявкеНаАвто(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;  
	
	ЭтаФорма.ДобавлятьСтрокиБезРелиза = Истина; 
	
	// этот код дублируется из процедуры ОбновитьИзЗаявки
	Ответ = ОбновитьИзЗаявкиНаСервере();    
	
	// ДИТ US 81881 ТА 81882 Сержантова А.С. Начало: 04.04.2024 
	//если было заполнение заявки и есть дубли терминалов выдачи, то спрашиваем у пользователя какой установить терминал выдачи в Контейнерах
	Если СписокДублейТерминаловИзРейса.Количество() Тогда
		ВопросВыборТерминаловВыдачи();
	КонецЕсли;
	// ДИТ US 81881 ТА 81882 Сержантова А.С. Конец: 04.04.2024
	
	// ДИТ US 80736 ТА 81088 Сержантова А.С. Начало: 27.02.2024
	БылоОбновлениеИзЗаявки = Истина;
	// ДИТ US 80736 ТА 81088 Сержантова А.С. Конец: 27.02.2024
	
	Если Ответ.МассивНомеровСтрокВыданВРейс.Количество() > 0 ИЛИ Ответ.МассивНомеровСтрокЗакрыт.Количество() > 0 Тогда
		
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить(КодВозвратаДиалога.Да,"Да");
		СписокКнопок.Добавить(КодВозвратаДиалога.Нет,"Нет");
		ТекстВопроса = "";
		Если Ответ.МассивНомеровСтрокВыданВРейс.Количество() > 0 Тогда
			ТекстВопроса = СтрШаблон("Обновление данных по строке %1 невозможно, так как текущий статус заказа на ТС Выдан в рейс.",СтрСоединить(Ответ.МассивНомеровСтрокВыданВРейс,","));
			ТекстВопроса = ТекстВопроса + Символы.ПС  + Символы.ПС;
		КонецЕсли;
		Если Ответ.МассивНомеровСтрокЗакрыт.Количество() > 0 Тогда	
			ТекстВопроса = ТекстВопроса + СтрШаблон("Обновление данных по строке %1 невозможно, так как текущий статус заказа на ТС Закрыт.",СтрСоединить(Ответ.МассивНомеровСтрокЗакрыт,","));
			ТекстВопроса = ТекстВопроса + Символы.ПС + Символы.ПС;
		КонецЕсли;
		ТекстВопроса = ТекстВопроса + "Произвести обновление доступных строк ?";
		
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбОбновлении", ЭтотОбъект, Новый Структура("АдресХранилища,КоличествоНеДобавленных",Ответ.АдресХранилища,Ответ.КоличествоНеДобавленных));
		ПоказатьВопрос(Оповещение, ТекстВопроса, СписокКнопок, 60,КодВозвратаДиалога.Нет,,КодВозвратаДиалога.Нет);
	КонецЕсли;
	
	УстановитьВидимостьКомандыДобавитьУдаленныеКТКВЗапрос();
	УстановитьПросмотрСтатусОтправкиЗапросаНаТерминалВыдачи(); 
	ЗаполнитьТаблицуПоКлючамАналитики(,Истина);
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьНомерДатуЗаказаНаТС();
	КонецЕсли;
	
	//Евросиб Коханенко Н.А. 07.02.2024 (( #80805
	Для Каждого СтрокаКонтейнеры Из Объект.Контейнеры Цикл 
		Если НЕ СтрокаКонтейнеры.НеТребуетсяТерминалВыдачи Тогда
			СтрокаКонтейнеры.ТипОперацииНаТерминалеВыдачи = ТипОперацииНаТерминалеВыдачиПоУмолчанию;
		КонецЕсли;
		Если НЕ СтрокаКонтейнеры.НеТребуетсяАдрес Тогда
			СтрокаКонтейнеры.ТипОперацииНаСкладеКлиента = ТипОперацииНаСкладеКлиентаПоУмолчанию;
		КонецЕсли;
		Если НЕ СтрокаКонтейнеры.НеТребуетсяТерминалСдачи Тогда
			СтрокаКонтейнеры.ТипОперацииНаТерминалеСдачи = ТипОперацииНаТерминалеСдачиПоУмолчанию;
		КонецЕсли;
	КонецЦикла;
	//Евросиб Коханенко Н.А. 07.02.2024 )) #80805 

	КонтрагентДирекцияКонтейнерныхПеревозок = Ложь;
	Если ЭтоДирекцияКонтейнерныхПеревозок() Тогда 
		КонтрагентДирекцияКонтейнерныхПеревозок = Истина;	
	КонецЕсли;
	
	Если КонтрагентДирекцияКонтейнерныхПеревозок Тогда
		Для Каждого СтрокаКонтейнеры Из Объект.Контейнеры Цикл
			СтрокаКонтейнеры.НеТребуетсяАдрес = Истина;
			СтрокаКонтейнеры.ТипОперацииНаТерминалеВыдачи = ПредопределенноеЗначение("Перечисление.ТипОперацииНаТерминале.ПриемПорожнегоКТК");
			СтрокаКонтейнеры.ТипОперацииНаТерминалеСдачи = ПредопределенноеЗначение("Перечисление.ТипОперацииНаТерминале.СдачаПорожнегоКТК");
		КонецЦикла;
		ВыбранКонтрагентДирекцияКонтейнерныхПеревозок = Истина;
	ИначеЕсли ВыбранКонтрагентДирекцияКонтейнерныхПеревозок Тогда
		Для Каждого СтрокаКонтейнеры Из Объект.Контейнеры Цикл
			СтрокаКонтейнеры.НеТребуетсяАдрес = Ложь;
			СтрокаКонтейнеры.ТипОперацииНаТерминалеВыдачи = Неопределено;
			СтрокаКонтейнеры.ТипОперацииНаТерминалеСдачи = Неопределено;
		КонецЦикла;
		ВыбранКонтрагентДирекцияКонтейнерныхПеревозок = Ложь;
    КонецЕсли;
	
	УстановитьВидимостьПолейПоДирекцииКонтенерныхПеревозок();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьУдаленныеКТКВЗапрос(Команда)
	
	ПараметрыОткрытияФормы = Новый Структура("АдрезХранилищаТЧ",ПолучитьАдресТЧ());
	//Евросиб Коханенко Н.А. 15.05.2024 (( #83866 
	ПараметрыОткрытияФормы.Вставить("МассивГУИДыПеренесенныхКТК", ПолучитьМассивГУИДовПеренесенныхКТК(Объект.Заявка));
	//Евросиб Коханенко Н.А. 15.05.2024 )) #83866 
	ОткрытьФорму("Документ.ЗапросНаАвтоперевозку.Форма.ФормаВосстановленияУдаленных",ПараметрыОткрытияФормы,ЭтаФорма,ЭтаФорма.УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьАдрес(Команда)
	//ДИТ Шевченко А.В. US 62421 ТА 67386 18.05.2023 -начало
	//Тек = Элементы.Контейнеры.ТекущиеДанные;
	//Если Тек <> Неопределено Тогда	
	//	Если КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.Количество() = 0 Тогда
	//		Возврат;
	//	КонецЕсли;	
	//	ИмяПоля = КонтактнаяИнформацияОписаниеДополнительныхРеквизитов[0].ИмяРеквизита;
	//	АдресПредставление = Тек[ИмяПоля];
	//	
	//	ТекстСообщения = СтрШаблон("Скопирован адрес: %1",АдресПредставление);
	//	АдресБуфер = Тек.ИдентификаторСтрокиТабличнойЧасти;	
	//		
	//	СообщПольз = Новый СообщениеПользователю;
	//	СообщПольз.ИдентификаторНазначения = ЭтаФорма.УникальныйИдентификатор;
	//	СообщПольз.Текст = СтрШаблон("Скопирован адрес: %1",АдресПредставление); 
	//	СообщПольз.Сообщить();
	//КонецЕсли;
	//ДИТ Шевченко А.В. US 62421 ТА 67386 18.05.2023 - конец
КонецПроцедуры

&НаКлиенте
Процедура ВставитьАдрес(Команда)
	    //ДИТ Шевченко А.В. US 62421 ТА 67386 18.05.2023 -начало
		//Если КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.Количество() = 0 Тогда
		//	Возврат;
		//КонецЕсли;
		//
		//СтруктураПоиска = Новый Структура("ИдентификаторСтрокиТабличнойЧасти",АдресБуфер);
		//СтрокаКонтИнф = Объект.КонтактнаяИнформация.НайтиСтроки(СтруктураПоиска);
		//
		//Если СтрокаКонтИнф.Количество() = 0 Тогда
		//	Возврат;
		//КонецЕсли;	
		//
		//Тек = Элементы.Контейнеры.ВыделенныеСтроки;
		//Если Тек.Количество() > 0 Тогда
		//	Для Каждого СтрокаИдент Из Тек Цикл
		//		ТекСтрока = Объект.Контейнеры.НайтиПоИдентификатору(СтрокаИдент);	
		//					
		//		ТекСтрока[КонтактнаяИнформацияОписаниеДополнительныхРеквизитов[0].ИмяРеквизита] = СтрокаКонтИнф[0].Представление;
		//		ТекСтрока[КонтактнаяИнформацияОписаниеДополнительныхРеквизитов[0].ИмяРеквизита+"Значение"] = СтрокаКонтИнф[0].Значение;
		//					
		//	КонецЦикла;
		//КонецЕсли;
		//ДИТ Шевченко А.В. US 62421 ТА 67386 18.05.2023 -конец
КонецПроцедуры	

&НаКлиенте
Процедура СоздатьДополнительныйЗапрос(Команда)
	Если Элементы.Контейнеры.ТекущиеДанные <> Неопределено Тогда
		ТекСтрока = Элементы.Контейнеры.ТекущиеДанные;
		ИдентСтроки = ТекСтрока.ПолучитьИдентификатор();	
		СтрокаКонтейнер = Объект.Контейнеры.НайтиПоИдентификатору(ИдентСтроки);
		НовСтрока = Объект.Контейнеры.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока,СтрокаКонтейнер);
		НовСтрока.ИдентификаторСтрокиТЧ = Новый УникальныйИдентификатор;
		НовСтрока.ИдентификаторСтрокиТабличнойЧасти = НовСтрока.ПолучитьИдентификатор();
		НовСтрока.СтатусЗапросаНаАвтоперевозку = ПредопределенноеЗначение("Перечисление.СтатусЗапросаНаПеревозку.Черновик");
		НовСтрока.СтатусЗаказаНаТС = ПредопределенноеЗначение("Перечисление.СтатусЗаказаНаТс.ПустаяСсылка");
		НовСтрока.НомерАвто 				 = "";
		НовСтрока.НомерПрицепа 				 = "";
		НовСтрока.ФИОВодителя 				 = "";
		НовСтрока.ПаспортныеДанные 			 = "";
		НовСтрока.Перевозчик 				 = "";
		НовСтрока.ИтоговаяСтоимостьПеревозки = 0;
        НовСтрока.ДатаИВремяВывоза 			 = Дата(1,1,1);
		НовСтрока.КонтейнерФакт 			 = "";
		ОбновитьТаблицуОформления("","ИдентификаторСтрокиТЧ",НовСтрока.ИдентификаторСтрокиТЧ,"Контейнеры");
	КонецЕсли;	
КонецПроцедуры

//Евросиб Коханенко Н.А. 03.10.2023 (( US 75549 TA 75773
&НаКлиенте
Процедура ДобавитьАдресСкладаКлиента(Команда)
	Элементы.ДополнительныеАдресаКлиента.Видимость = НЕ Элементы.ДополнительныеАдресаКлиента.Видимость;
	//показываем только одну таблицу из двух ниже таблицы Контейнеры
	Если Элементы.ДополнительныеАдресаКлиента.Видимость И Элементы.ДетализацияПоГрузу.Видимость Тогда
		Элементы.ДетализацияПоГрузу.Видимость = Ложь;
	КонецЕсли;
	Если Элементы.ДополнительныеАдресаКлиента.Видимость Тогда 
		ТекДанные = Элементы.Контейнеры.ТекущиеДанные;
		ИзменитьПервуюСтрокуВДополнительныеАдресаКлиента(ТекДанные.ИдентификаторСтрокиТЧ, ТекДанные.АдресКлиента, ТекДанные.ТипОперацииНаСкладеКлиента);
		//запрещаем перемещение строк вверх
		ПунктПеремещениеВверх = Элементы.Найти("ДополнительныеАдресаКлиентаКонтекстноеМенюПереместитьВверх");
		Если ПунктПеремещениеВверх <> Неопределено Тогда 
			ПунктПеремещениеВверх.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 
//Евросиб Коханенко Н.А. 03.10.2023 )) US 75549 TA 75773

#КонецОбласти

#Область выгрузка
//Евросиб Гудкова( 09.07.2022 Ticket№ 54442
&НаКлиенте
Процедура ОтправитьЗапросВИСТранспортнаяЛогистика(Команда)
	
	Если НЕ ОтправкаВозможна() Тогда
		Возврат;
	КонецЕсли;		
	НеЗаписан = ЭтаФорма.Модифицированность или Не Объект.Проведен;
	ОповещениеОтветаВопроса = Новый ОписаниеОповещения("ОбработкаВопросаЗапрос", ЭтаФорма, НеЗаписан);
	Если НеЗаписан Тогда
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить(КодВозвратаДиалога.Да,"Да");
		СписокКнопок.Добавить(КодВозвратаДиалога.Нет,"Нет");
		ПоказатьВопрос(ОповещениеОтветаВопроса, "Перед выгрузкой заказ необходимо провести. Продолжить?", СписокКнопок, 60, КодВозвратаДиалога.Нет,,КодВозвратаДиалога.Нет);
	Иначе
		ОбработкаВопросаЗапрос(КодВозвратаДиалога.Да, НеЗаписан);
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаЗапрос(Ответ = неопределено, НеЗаписан = Неопределено) Экспорт
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	ЗаписатьИВыгрузитьЗаказНаАвто(НеЗаписан); 
	
	// ДИТ US 78233 TA 79764 Сержантова А.С. Начало: 23.01.2024
	ОповеститьОбИзменении(Тип("СправочникСсылка.КлючиАналитикиПеревозки"));   
	Оповестить("НеобходимоОбновитьДанныеКлючейАналитикиПеревозки", , ЭтаФорма);
	// ДИТ US 78233 TA 79764 Сержантова А.С. Конец: 23.01.2024
	
КонецПроцедуры
&НаСервере
Процедура ЗаписатьИВыгрузитьЗаказНаАвто(НеЗаписан)

	СтрокиКВыгрузке = НайтиСтрокиСОтметкой();
	//ДИТ Шевченко А.В. Ticket#0307346 14.04.2023 -Начало
	Рез = Истина;
	Если НеЗаписан Тогда
		СтруктураЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение);
		Рез = ЭтотОбъект.Записать(СтруктураЗаписи);	
	КонецЕсли;
	Если Рез Тогда
		ДатаОтправкиЗапроса = ТекущаяДата();
		ПараметрыВыгрузки = Новый Структура("СсылкаЗапросНаАвтоперевозку, СтрокиКВыгрузке", Объект.Ссылка, СтрокиКВыгрузке);
		ЕСОбменСервер.ПередатьЗапросыНаАвтоВТЛ(ПараметрыВыгрузки);	
		ОбновитьОформлениеПослеЗапроса(ДатаОтправкиЗапроса);  
	КонецЕсли;
	//ДИТ Шевченко А.В. Ticket#0307346 14.04.2023 -Конец
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьЗаказНаАвтоПоИзменениямПланФактКТК(МассивГуиды)
	
	СтрокиКВыгрузке = ПолучитьСтрокиКВыгрузкеПоГУИД(МассивГуиды);
	
	ДатаОтправкиЗапроса = ТекущаяДата();
	ПараметрыВыгрузки = Новый Структура("СсылкаЗапросНаАвтоперевозку, СтрокиКВыгрузке", Объект.Ссылка, СтрокиКВыгрузке);
	ЕСОбменСервер.ПередатьЗапросыНаАвтоВТЛ(ПараметрыВыгрузки);	
   	ОбновитьОформлениеПослеЗапроса(ДатаОтправкиЗапроса);	
КонецПроцедуры	

&НаСервере
Функция НайтиСтрокиСОтметкой()
	
	СтрокиКвыгрузке = Новый ТаблицаЗначений;
	СтрокиКвыгрузке.Колонки.Добавить("ИдентификаторСтрокиТабличнойЧасти");
	СтрокиКвыгрузке.Колонки.Добавить("ИдентификаторСтрокиТЧ");
	
	СтруктураПоиска = Новый Структура("Отметка", Истина);
	НайденныеСтроки = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска);
	Для каждого Строка Из НайденныеСтроки Цикл
		Стр = СтрокиКВыгрузке.Добавить();
		ЗаполнитьЗначенияСвойств(Стр, Строка);
	КонецЦикла;
  	Возврат СтрокиКВыгрузке;
	
КонецФункции // НайтиСтрокиСОтметкой()

&НаСервере
Функция ПолучитьСтрокиКВыгрузкеПоГУИД(МассивГуиды)
	
	СтрокиКвыгрузке = Новый ТаблицаЗначений;
	СтрокиКвыгрузке.Колонки.Добавить("ИдентификаторСтрокиТабличнойЧасти");
	СтрокиКвыгрузке.Колонки.Добавить("ИдентификаторСтрокиТЧ");
	
	Для Каждого ЗнчМ Из МассивГуиды Цикл
		СтруктураПоиска = Новый Структура("ИдентификаторСтрокиТЧ", ЗнчМ);
		НайденныеСтроки = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска);
		Для каждого Строка Из НайденныеСтроки Цикл
			Стр = СтрокиКВыгрузке.Добавить();
			ЗаполнитьЗначенияСвойств(Стр, Строка);
		КонецЦикла;
	КонецЦикла;
  	Возврат СтрокиКВыгрузке;
	
КонецФункции

// Евросиб Гудкова) 	

&НаКлиенте
Функция ОтправкаВозможна()
		
	Ответ = Истина;
	
	СтруктураПоиска = Новый Структура("Отметка",Истина);
	НайденныеСтроки = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбраны строки для отправки запроса на автоперевозку в ИС ""Транспортная логистика""");
		Возврат ложь;
	КонецЕсли;
	
	ВыводитОбщееСообщение = Ложь;
	
	МассивНомераСтрокСтатусЗаказаНаТСВыданВРейс 		= Новый Массив;
	МассивНомераСтрокСтатусЗаказаНаТСЗакрыт 			= Новый Массив;
	МассивНомераСтатусЗапросаНаАвтоперевозкуЧерновик 	= Новый Массив;
	МассивНомераСтатусЗапросаНаАвтоперевозкуОтменен 	= Новый Массив;
	МассивНомераОтправленыхБезИзменений		 			= Новый Массив;
	МассивНомераРазныйПланФактКТК			 			= Новый Массив;
	//Евросиб Коханенко Н.А. 29.11.2023 (( US 75549 TA 75773 
	МассивНомераНеЗаполненАдресКлиентаИлиНеТребуется	= Новый Массив;
	//Евросиб Коханенко Н.А. 29.11.2023 )) US 75549 TA 75773 
	
	//Евросиб Коханенко Н.А. 12.03.2024 (( #82185 
	ЭтоИмпортМоре = (ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Объект.Заявка, "ВидПеревозки") = ПредопределенноеЗначение("Справочник.ВидыПеревозок.ИмпортМоре"));
	//Евросиб Коханенко Н.А. 12.03.2024 )) #82185 
	
	//Евросиб Коханенко Н.А. 07.06.2024 (( #83866
	МассивГУИДыПеренесенныхКТК = ПолучитьМассивГУИДовПеренесенныхКТК(Объект.Заявка);
	//Евросиб Коханенко Н.А. 07.06.2024 )) #83866 

	Для Каждого СтрокаТч Из НайденныеСтроки Цикл
		
		НеучитыватьСтатусЗаказаНаТС = Ложь;
		СтруктураПоиска = Новый Структура("ИдентификаторСтрокиТЧ",СтрокаТч.ИдентификаторСтрокиТЧ);
		НайденныеСтроки = ТаблицаОформленияКолонок.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда
			МассивКолонок = СтрРазделить(НайденныеСтроки[0].ИменаКолонок,";");
			Если МассивКолонок.Найти("КонтейнерФакт") <> Неопределено Тогда
				НеучитыватьСтатусЗаказаНаТС = Истина;
			КонецЕсли;	
		КонецЕсли;
		
		Если СтрокаТч.СтатусЗаказаНаТС = ПредопределенноеЗначение("Перечисление.СтатусЗаказаНаТс.ВыданВРейс") Тогда			
			Если НЕ НеучитыватьСтатусЗаказаНаТС Тогда
				МассивНомераСтрокСтатусЗаказаНаТСВыданВРейс.Добавить(СтрокаТч.НомерСтроки);
				СтрокаТч.Отметка = Ложь;
			КонецЕсли;
		КонецЕсли;
		Если СтрокаТч.СтатусЗаказаНаТС = ПредопределенноеЗначение("Перечисление.СтатусЗаказаНаТс.Закрыт") Тогда
			Если НЕ НеучитыватьСтатусЗаказаНаТС Тогда
				МассивНомераСтрокСтатусЗаказаНаТСЗакрыт.Добавить(СтрокаТч.НомерСтроки);
				СтрокаТч.Отметка = Ложь;
			КонецЕсли;
		КонецЕсли;
		Если СтрокаТч.СтатусЗапросаНаАвтоперевозку = ПредопределенноеЗначение("Перечисление.СтатусЗапросаНаПеревозку.Черновик") Тогда
			МассивНомераСтатусЗапросаНаАвтоперевозкуЧерновик.Добавить(СтрокаТч.НомерСтроки);
			СтрокаТч.Отметка = Ложь;
		КонецЕсли;  
		// ДИТ BUG 76919 ТА 77021 Сержантова А.С. Начало: 17.11.2023
		// Было:
		//Если СтрокаТч.СтатусЗапросаНаАвтоперевозку = ПредопределенноеЗначение("Перечисление.СтатусЗапросаНаПеревозку.Отменен") И НЕ СтрокаТч.ОбновленыИсходныеДанные Тогда 
		//Стало:
		//Евросиб Коханенко Н.А. 07.06.2024 (( #83866 
		// Было:
		//Если СтрокаТч.СтатусЗапросаНаАвтоперевозку = ПредопределенноеЗначение("Перечисление.СтатусЗапросаНаПеревозку.Отменен") 
		//	И не значениеЗаполнено(СтрокаТч.НомерЗаказаНаТС)
		//	И НЕ СтрокаТч.ОбновленыИсходныеДанные Тогда
		//Стало:
		Если СтрокаТч.СтатусЗапросаНаАвтоперевозку = ПредопределенноеЗначение("Перечисление.СтатусЗапросаНаПеревозку.Отменен") 
			И (МассивГУИДыПеренесенныхКТК.Найти(СтрокаТч.ИдентификаторСтрокиУслуги) <> Неопределено
				ИЛИ (НЕ ЗначениеЗаполнено(СтрокаТч.НомерЗаказаНаТС)
					И НЕ СтрокаТч.ОбновленыИсходныеДанные)) Тогда
		//Евросиб Коханенко Н.А. 07.06.2024 )) #83866
		// ДИТ BUG 76919 ТА 77021 Сержантова А.С. Конец: 17.11.2023
			МассивНомераСтатусЗапросаНаАвтоперевозкуОтменен.Добавить(СтрокаТч.НомерСтроки);
			СтрокаТч.Отметка = Ложь;
		КонецЕсли;
		Если СтрокаТч.СтатусЗапросаНаАвтоперевозку = ПредопределенноеЗначение("Перечисление.СтатусЗапросаНаПеревозку.Отправлен") И НЕ СтрокаТч.ОбновленыИсходныеДанные Тогда
			МассивНомераОтправленыхБезИзменений.Добавить(СтрокаТч.НомерСтроки);
			СтрокаТч.Отметка = Ложь;
		КонецЕсли;
		
		//ДИТ Шевченко А.В. US 62421 TA 64345 20.01.23 -начало
		КонтейнерП = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(СтрокаТЧ.КлючАналитикиПеревозки,"Контейнер");
		
		Если ЗначениеЗаполнено(КонтейнерП) И ЗначениеЗаполнено(СтрокаТч.КонтейнерФакт) Тогда
			Если Строка(КонтейнерП) <> СтрокаТч.КонтейнерФакт Тогда
				МассивНомераРазныйПланФактКТК.Добавить(СтрокаТч.НомерСтроки);
				СтрокаТч.Отметка = Ложь;
			КонецЕсли;
		КонецЕсли;
		//ДИТ Шевченко А.В. US 62421 TA 64345 20.01.23 -конец
		
		//Евросиб Коханенко Н.А. 29.11.2023 (( US 75549 TA 75773 
		//Евросиб Коханенко Н.А. 12.03.2024 (( #82185 
		//Если Не ЗначениеЗаполнено(СтрокаТч.АдресКлиента) И Не СтрокаТч.НеТребуетсяАдрес Тогда
		Если НЕ ЗначениеЗаполнено(СтрокаТч.АдресКлиента) 
			И НЕ СтрокаТч.НеТребуетсяАдрес 
			И НЕ ЭтоИмпортМоре Тогда
		//Евросиб Коханенко Н.А. 12.03.2024 )) #82185 
			МассивНомераНеЗаполненАдресКлиентаИлиНеТребуется.Добавить(СтрокаТч.НомерСтроки);
			СтрокаТч.Отметка = Ложь;
		КонецЕсли;
		//Евросиб Коханенко Н.А. 29.11.2023 )) US 75549 TA 75773 
	КонецЦикла;	
	
	//Евросиб Коханенко Н.А. 29.11.2023 (( US 75549 TA 75773 
 	Если МассивНомераНеЗаполненАдресКлиентаИлиНеТребуется.Количество() > 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Отправка запроса на автоперевозку невозможна, так как в запросе по строке %1 необходимо заполнить ""Адрес склада клиента"" или выбрать ""Не требуется""",СтрСоединить(МассивНомераНеЗаполненАдресКлиентаИлиНеТребуется,",")));
		Ответ = Ложь;
		ВыводитОбщееСообщение = Истина;
	КонецЕсли;
   //Евросиб Коханенко Н.А. 29.11.2023 )) US 75549 TA 75773 
    		
	Если МассивНомераСтрокСтатусЗаказаНаТСВыданВРейс.Количество() > 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Отправка запроса на автоперевозку невозможна, так как запрос в строке %1 уже ""Выдан в рейс""",СтрСоединить(МассивНомераСтрокСтатусЗаказаНаТСВыданВРейс,",")));
		Ответ = Ложь;
		ВыводитОбщееСообщение = Истина;
	КонецЕсли;
	Если МассивНомераСтрокСтатусЗаказаНаТСЗакрыт.Количество() > 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Отправка запроса на автоперевозку невозможна, так как запрос в строке %1 уже отработан и ""Закрыт""",СтрСоединить(МассивНомераСтрокСтатусЗаказаНаТСЗакрыт,",")));
		Ответ = Ложь;
		ВыводитОбщееСообщение = Истина;
	КонецЕсли;
	Если МассивНомераСтатусЗапросаНаАвтоперевозкуЧерновик.Количество() > 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Отправка запроса на автоперевозку невозможна, так как запрос в строке %1 находится в статусе Черновик. Для появления возможности отправки запроса необходимо заполнить все обязательные поля в перечисленных строках и провести документ",СтрСоединить(МассивНомераСтатусЗапросаНаАвтоперевозкуЧерновик,",")));
		Ответ = Ложь;
		ВыводитОбщееСообщение = Истина;
	КонецЕсли;
	Если МассивНомераСтатусЗапросаНаАвтоперевозкуОтменен.Количество() > 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Отправка запроса на автоперевозку невозможна, так как запрос в строке %1 находится в статусе Отменен, то есть строка была удалена из запроса на автоперевозку",СтрСоединить(МассивНомераСтатусЗапросаНаАвтоперевозкуОтменен,",")));
		Ответ = Ложь;
		ВыводитОбщееСообщение = Истина;
	КонецЕсли;
	Если МассивНомераОтправленыхБезИзменений.Количество() > 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Данные по строке %1 уже были отправлены в ИС ""Транспортная логистика"" и поэтому повторно отправлены не будут",СтрСоединить(МассивНомераОтправленыхБезИзменений,",")));
		Ответ = Ложь;
		ВыводитОбщееСообщение = Истина;
	КонецЕсли;
	Если МассивНомераРазныйПланФактКТК.Количество() > 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Отправка запроса на автоперевозку невозможна, так как в запросе по строке %1 различаются значения полей ""Контейнер"" и ""Контейнер (факт.)""",СтрСоединить(МассивНомераРазныйПланФактКТК,",")));
		Ответ = Ложь;
		ВыводитОбщееСообщение = Истина;
	КонецЕсли;
	
	Если ВыводитОбщееСообщение Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Повторите отправку данных по доступным строкам повторным нажатием на кнопку «Отправить запрос в ИС ""Транспортная логистика""");	
	КонецЕсли;	
	
	Возврат Ответ;
	
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

// ДИТ US 76935 ТА 78648 Сержантова А.С. 11.12.2023  
&НаСервере
Функция ЗаполнитьДанныеДляОбновленияКлючейАналитикиПеревозки() 
	
	ДанныеОбновленияКлючейАналитики = Новый ТаблицаЗначений;   
	ДанныеОбновленияКлючейАналитики.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ДанныеОбновленияКлючейАналитики.Колонки.Добавить("КлючАналитикиПеревозки", Новый ОписаниеТипов("СправочникСсылка.КлючиАналитикиПеревозки"));  
	ДанныеОбновленияКлючейАналитики.Колонки.Добавить("Контейнер", Новый ОписаниеТипов("СправочникСсылка.ТЕ"));
	ДанныеОбновленияКлючейАналитики.Колонки.Добавить("ДанныеКлюча"); 
	
	Для каждого СтрокаТЧ Из Объект.Контейнеры Цикл
		СтруктураКлючаАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();   
		
		Если ДетализацияПоГрузу.Количество() Тогда 
			// ДИТ US 78233 TA 79764 Сержантова А.С. Начало: 23.01.2024
			//Было
			//СтрокиДетализацииПоГрузу = ДетализацияПоГрузу.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки",СтрокаТЧ.КлючАналитикиПеревозки));
			//Стало
			СтрокиДетализацииПоГрузу = ДетализацияПоГрузу.НайтиСтроки(Новый Структура("Ключ",СтрокаТЧ.КлючАналитикиПеревозки));
			// ДИТ US 78233 TA 79764 Сержантова А.С. Конец: 23.01.2024
			Если СтрокиДетализацииПоГрузу.Количество() Тогда
				СтруктураКлючаАналитикиПеревозки.ИзменятьТЧДетализацияПоГрузу = Истина;
				
				ДетализацияПоГрузуВКлюч = СтруктураКлючаАналитикиПеревозки.ТЧДетализацияПоГрузу;
				Для каждого СтрокаДетализацииГруза Из СтрокиДетализацииПоГрузу Цикл
					НС = ДетализацияПоГрузуВКлюч.Добавить(); 
					ЗаполнитьЗначенияСвойств(НС, СтрокаДетализацииГруза); 
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;    
		
		МилиКлюча = Новый Структура;
		МилиКлюча.Вставить("ДатаВыдачиКТКСТерминала", СтрокаТЧ.ДатаИВремяВывоза);
		МилиКлюча.Вставить("ДатаСдачиКТКНаТерминал", СтрокаТЧ.ДатаИВремяСдачи);
		МилиКлюча.Вставить("ДатаВыездаКТКСоСклада", СтрокаТЧ.ДатаЗавершенияОперацииНаСкладеКлиента);
		МилиКлюча.Вставить("ФИОВодителя", СтрокаТЧ.ФИОВодителя);
		МилиКлюча.Вставить("ПаспортныеДанные", СтрокаТЧ.ПаспортныеДанные);
		МилиКлюча.Вставить("РегНомерТС", СтрокаТЧ.НомерАвто);
		МилиКлюча.Вставить("Автоперевозчик", СтрокаТЧ.Перевозчик);
		Если ЗначениеЗаполнено(СтрокаТЧ.Перевозчик) 
			и ТипЗнч(СтрокаТЧ.Перевозчик) = Тип("СправочникСсылка.Контрагенты") Тогда
			МилиКлюча.Вставить("ИНН",ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.Перевозчик,"ИНН"));
			МилиКлюча.Вставить("КПП",ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.Перевозчик,"КПП"));
		КонецЕсли;
		МилиКлюча.Вставить("АдресКлиента", СтрокаТЧ.АдресКлиента);

		СтруктураКлючаАналитикиПеревозки.КлючАналитики = СтрокаТЧ.КлючАналитикиПеревозки;
		СтруктураКлючаАналитикиПеревозки.Контейнер = СтрокаТЧ.Контейнер;   
		СтруктураКлючаАналитикиПеревозки.Груз = СтрокаТЧ.Груз;
		СтруктураКлючаАналитикиПеревозки.ИнструкцияПоСдаче = СтрокаТЧ.ИнструкцияПоСдаче;
		// ДИТ US 78234 ТА 78241 Сержантова А.С. Начало: 14.12.2023
		СтруктураКлючаАналитикиПеревозки.ВесГруза = СтрокаТЧ.ВесГрузаНетто;
		СтруктураКлючаАналитикиПеревозки.КоличествоМест = СтрокаТЧ.КоличествоМест;
		// ДИТ US 78234 ТА 78241 Сержантова А.С. Конец: 14.12.2023  
		
		Если Объект.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля Тогда
			ЗаполнитьЗначенияСвойств(СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПерваяМиляКлючаАналитики, МилиКлюча);
		//Евросиб Коханенко Н.А. 15.01.2025 (( #97950 
		ИначеЕсли Объект.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.СредняяМиля Тогда
			ЗаполнитьЗначенияСвойств(СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиСредняяМиляКлючаАналитики, МилиКлюча);
		//Евросиб Коханенко Н.А. 15.01.2025 )) #97950 
		Иначе	
		    ЗаполнитьЗначенияСвойств(СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПоследняяМиляКлючаАналитики, МилиКлюча);
		КонецЕсли;
		
		НС = ДанныеОбновленияКлючейАналитики.Добавить(); 
		НС.НомерСтроки 				= СтрокаТЧ.НомерСтроки;
		НС.КлючАналитикиПеревозки 	= СтрокаТЧ.КлючАналитикиПеревозки;  
		НС.Контейнер 				= СтрокаТЧ.Контейнер;
		НС.ДанныеКлюча 				= СтруктураКлючаАналитикиПеревозки;
	КонецЦикла;    
	
	Возврат ДанныеОбновленияКлючейАналитики;
	
КонецФункции

// ДИТ US 76935 ТА 78648 Сержантова А.С. 11.12.2023  
&НаСервере 
Процедура ЗаблокироватьКлючиАналитикиПеревозкиДляРедактирования()

	Для каждого СтрКлюча Из Объект.Контейнеры Цикл
		ЗаблокироватьДанныеДляРедактирования(СтрКлюча.КлючАналитикиПеревозки); 	
	КонецЦикла;	
	НеОбновлятьДанныеКлючей = Истина;

КонецПроцедуры 

// ДИТ US 76935 ТА 78648 Сержантова А.С. 11.12.2023  
&НаСервере 
Процедура СнятьБлокировкуКлючейАналитикиПеревозкиДляРедактирования()

	Для каждого СтрКлюча Из Объект.Контейнеры Цикл
		РазблокироватьДанныеДляРедактирования(СтрКлюча.КлючАналитикиПеревозки); 	
	КонецЦикла;	
	НеОбновлятьДанныеКлючей = Ложь;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтатусОтправкиЗапросаНаТерминалВыдачиДоИзменения(СсылкаД,КлючАналитикиПеревозки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗапросНаАвтоперевозкуКонтейнеры.СтатусОтправкиЗапросаНаТерминалВыдачи КАК СтатусОтправкиЗапросаНаТерминалВыдачи
		|ИЗ
		|	Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
		|ГДЕ
		|	ЗапросНаАвтоперевозкуКонтейнеры.Ссылка = &Ссылка
		|	И ЗапросНаАвтоперевозкуКонтейнеры.КлючАналитикиПеревозки = &КлючАналитикиПеревозки";
	
	Запрос.УстановитьПараметр("КлючАналитикиПеревозки", КлючАналитикиПеревозки);
	Запрос.УстановитьПараметр("Ссылка", СсылкаД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.СтатусОтправкиЗапросаНаТерминалВыдачи;
	КонецЦикла;
	
КонецФункции	

&НаСервере
Процедура ДобавитьЗначениеРеквизитаВКлюч(Ключ,ЗначениеПоля,ИмяПоля,ЭтапПеревозки = Неопределено,Знач ДетализацияПоГрузу = Неопределено,ВерсияДанных=Неопределено) //ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23
	
	Если ВерсияДанных <> Ключ.ВерсияДанных Тогда 
		ЗаполнитьТаблицуПоКлючамАналитики(Ключ);
		ОбщегоНазначения.СообщитьПользователю("Версия ключа аналитики перевозки устарела, подгружены актуальные данные по строке.");	
	КонецЕсли;
	
	СтруктураКлюча  = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки(); 
	СтруктураКлюча.Вставить("КлючАналитики",Ключ);
	
	Если ЭтапПеревозки = Неопределено Тогда
		Если ЗначениеПоля <> Неопределено И ЗначениеЗаполнено(ИмяПоля) Тогда
			СтруктураКлюча.Вставить(ИмяПоля,ЗначениеПоля);
		КонецЕсли;
		Если ДетализацияПоГрузу <> Неопределено Тогда
			СтруктураПоиска = Новый Структура("Ключ",Ключ);
			СтруктураКлюча.ТЧДетализацияПоГрузу = ДетализацияПоГрузу.Выгрузить(ДетализацияПоГрузу.НайтиСтроки(СтруктураПоиска));
			СтруктураКлюча.Вставить("ИзменятьТЧДетализацияПоГрузу",Истина);
		КонецЕсли;
		ВерсияДанных = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлюча).ВерсияДанных;
	КонецЕсли;
	
	Если ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля Тогда
		СтруктураКлюча.СтруктураТЧМилиПерваяМиляКлючаАналитики.Вставить(ИмяПоля,ЗначениеПоля);
		ВерсияДанных = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлюча).ВерсияДанных;
	КонецЕсли;
	
	Если ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПоследняяМиля Тогда
		СтруктураКлюча.СтруктураТЧМилиПоследняяМиляКлючаАналитики.Вставить(ИмяПоля,ЗначениеПоля);
		ВерсияДанных = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлюча).ВерсияДанных;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура СравнитьКонтактнуюИнформациюНаИзменение() //ДИТ Шевченко А.В. 66106 03.10.2022
	//ДИТ Шевченко А.В. US 62421 ТА 67386 18.05.2023 -начало
	//СтрокаК = Объект.Контейнеры.НайтиПоИдентификатору(Элементы.Контейнеры.ТекущаяСтрока);
	//
	//Если КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.Количество() > 0 Тогда
	//	ИмяПоляАдреса = КонтактнаяИнформацияОписаниеДополнительныхРеквизитов[0].ИмяРеквизита;
	//	ЗначениеДляОтбора1 = СтрокаК[ИмяПоляАдреса];
	//	
	//	ЗначениеСтрокиСсылки = "";
	//
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ЗапросНаАвтоперевозкуКонтактнаяИнформация.Представление КАК Представление
	//	|ИЗ
	//	|	Документ.ЗапросНаАвтоперевозку.КонтактнаяИнформация КАК ЗапросНаАвтоперевозкуКонтактнаяИнформация
	//	|ГДЕ
	//	|	ЗапросНаАвтоперевозкуКонтактнаяИнформация.Ссылка = &Ссылка
	//	|	И ЗапросНаАвтоперевозкуКонтактнаяИнформация.ИдентификаторСтрокиТабличнойЧасти = &ИдентификаторСтрокиТабличнойЧасти";
	//	
	//	Запрос.УстановитьПараметр("ИдентификаторСтрокиТабличнойЧасти", Элементы.Контейнеры.ТекущаяСтрока);
	//	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//	
	//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//		ЗначениеСтрокиСсылки = ВыборкаДетальныеЗаписи.Представление;
	//	КонецЦикла;
	//	
	//	Если ЗначениеСтрокиСсылки <> ЗначениеДляОтбора1 Тогда
	//		СтрокаК.ОбновленыИсходныеДанные = Истина;
	//	КонецЕсли;	
	//	
	//КонецЕсли;		
	//ДИТ Шевченко А.В. US 62421 ТА 67386 18.05.2023 -конец
КонецПроцедуры	

//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23
&НаСервере
Процедура ЗаполнитьТаблицуПоКлючамАналитики(Ключ = Неопределено, ИзменениеКлючаПоСобытию = Ложь) 
	
	ДетализацияПоГрузу.Очистить();    
	// ДИТ US 78233 TA 78240 Сержантова А.С. Начало: 26.01.2024
	НужнаПроверкаИзмененийВОтправленныхДанных = Ложь;
	// ДИТ US 78233 TA 78240 Сержантова А.С. Конец: 26.01.2024
	
	Если ЗначениеЗаполнено(Ключ) Тогда
		СтруктураПоиска = Новый Структура("КлючАналитикиПеревозки",Ключ);
		МассивСтрок = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска);
		Если МассивСтрок.Количество() > 0 Тогда
			ВыполнитьЗаполнениеСтроки(МассивСтрок[0]);
			// ДИТ US 78233 TA 78240 Сержантова А.С. Начало: 28.12.2023
			Если ИзменениеКлючаПоСобытию и ЗначениеЗаполнено(МассивСтрок[0].ВерсияКлючаАналитикиОтправленоВТЛ) Тогда
			    НужнаПроверкаИзмененийВОтправленныхДанных = Истина;
			КонецЕсли;
			// ДИТ US 78233 TA 78240 Сержантова А.С. Конец: 28.12.2023
		КонецЕсли;	
	Иначе	 
		Для Каждого СтрокаТЧ Из Объект.Контейнеры Цикл
			ВыполнитьЗаполнениеСтроки(СтрокаТЧ);
			// ДИТ US 78233 TA 78240 Сержантова А.С. Начало: 28.12.2023
			Если ИзменениеКлючаПоСобытию и ЗначениеЗаполнено(СтрокаТЧ.ВерсияКлючаАналитикиОтправленоВТЛ) Тогда
            	НужнаПроверкаИзмененийВОтправленныхДанных = Истина;
			КонецЕсли;    
			// ДИТ US 78233 TA 78240 Сержантова А.С. Конец: 28.12.2023
		КонецЦикла; 
	КонецЕсли;
	
	// ДИТ US 78233 TA 78240 Сержантова А.С. Начало: 26.01.2024
	Если НужнаПроверкаИзмененийВОтправленныхДанных Тогда
		ОпределитьИзменениеОтправленныхВТЛДанных(Истина);	
	КонецЕсли;
	// ДИТ US 78233 TA 78240 Сержантова А.С. Конец: 26.01.2024
КонецПроцедуры

Процедура ВыполнитьЗаполнениеСтроки(СтрокаТЧ)
	 
	// ДИТ US 78239 Сержантова А.С. Начало: 05.12.2023 
	// Было:
	//СтрокаТЧ.Контейнер   = СтрокаТЧ.КлючАналитикиПеревозки.Контейнер;
	//СтрокаТЧ.Груз 		 = СтрокаТЧ.КлючАналитикиПеревозки.Груз;
	//СтрокаТЧ.ВерсияКлюча = СтрокаТЧ.КлючАналитикиПеревозки.ВерсияДанных;
	// Стало: 
	РеквизитыКлюча = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТЧ.КлючАналитикиПеревозки, "Контейнер, Груз, ВерсияДанных, ИнструкцияПоСдаче, КоличествоМест, ВесГруза");
	СтрокаТЧ.Контейнер   = РеквизитыКлюча.Контейнер; 
	// ДИТ BUG 81219 ТА 81220 Сержантова А.С. Начало: 16.02.2024
	Если ЗначениеЗаполнено(СтрокаТЧ.Контейнер) Тогда
		СтрокаТЧ.ТипКТК = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.Контейнер, "ТипТЕ");	
	КонецЕсли;
	// ДИТ BUG 81219 ТА 81220 Сержантова А.С. Конец: 16.02.2024
	СтрокаТЧ.Груз 		 = РеквизитыКлюча.Груз;
	СтрокаТЧ.ВерсияКлюча = РеквизитыКлюча.ВерсияДанных;
	СтрокаТЧ.ИнструкцияПоСдаче = РеквизитыКлюча.ИнструкцияПоСдаче;
	// ДИТ US 78239 Сержантова А.С. Конец: 05.12.2023   
	// ДИТ US 78234 ТА 78241 Сержантова А.С. Начало: 12.12.2023,
	//Если (ЗначениеЗаполнено(СтрокаТЧ.ВесГрузаНетто) и не ЗначениеЗаполнено(РеквизитыКлюча.ВесГруза)) 
	//	или (ЗначениеЗаполнено(СтрокаТЧ.КоличествоМест) и не ЗначениеЗаполнено(РеквизитыКлюча.КоличествоМест)) Тогда       
	//	ЭтаФорма.Модифицированность = Истина;
	//	ДобавитьЗначениеРеквизитаВКлюч(СтрокаТЧ.КлючАналитикиПеревозки,СтрокаТЧ.ВесГрузаНетто,"ВесГруза",,,СтрокаТЧ.ВерсияКлюча);   
	//	ДобавитьЗначениеРеквизитаВКлюч(СтрокаТЧ.КлючАналитикиПеревозки,СтрокаТЧ.КоличествоМест,"КоличествоМест",,,СтрокаТЧ.ВерсияКлюча);
	//Иначе	
		СтрокаТЧ.ВесГрузаНетто = РеквизитыКлюча.ВесГруза;
		СтрокаТЧ.КоличествоМест = РеквизитыКлюча.КоличествоМест;
	//КонецЕсли;
	// ДИТ US 78234 ТА 78241 Сержантова А.С. Конец: 12.12.2023
	ТЧ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.КлючАналитикиПеревозки,"Мили");
	ДетализацияПоГрузуТЧ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.КлючАналитикиПеревозки,"ДетализацияПоГрузу");
	Если ТЧ <> Неопределено Тогда
		Выборка = ТЧ.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ЭтапПеревозки = Объект.ЭтапПеревозки Тогда
				СтрокаТЧ.ФИОВодителя = Выборка.ФИОВодителя;
				СтрокаТЧ.ПаспортныеДанные = Выборка.ПаспортныеДанные;
				СтрокаТЧ.Перевозчик = Выборка.Автоперевозчик;
				СтрокаТЧ.ДатаИВремяВывоза = Выборка.ДатаВыдачиКТКСТерминала;
				СтрокаТЧ.ДатаИВремяСдачи = Выборка.ДатаСдачиКТКНаТерминал;
				СтрокаТЧ.ДатаЗавершенияОперацииНаСкладеКлиента = Выборка.ДатаВыездаКТКСоСклада;
				СтрокаТЧ.АдресКлиента = Выборка.АдресКлиента; //ДИТ Шевченко А.В. US 62421 ТА 67386 18.05.2023
				СтрокаТЧ.НомерАвто    = Выборка.РегНомерТС;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если ДетализацияПоГрузуТЧ <> Неопределено Тогда
		Выборка = ДетализацияПоГрузуТЧ.Выбрать();
		НомерСтрокиПоГуидам = 0;
		Пока Выборка.Следующий() Цикл
			НовДет = ДетализацияПоГрузу.Добавить();
			ЗаполнитьЗначенияСвойств(НовДет,Выборка);
			НовДет.Ключ = СтрокаТЧ.КлючАналитикиПеревозки; 
			НовДет.НомерСтрокиПоГуидам = НомерСтрокиПоГуидам + 1;
			НомерСтрокиПоГуидам = НомерСтрокиПоГуидам + 1;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаРецензирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВыборДелегирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	Для Сч = 0 По Объект.Состояния.Количество()-1 Цикл
		Если Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение") ИЛИ Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.ВРаботе") Тогда
			Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Новый");
			НСтр = Объект.Состояния.Вставить(Сч);
			НСтр.Состояние = ПредопределенноеЗначение("Справочник.Состояния.ДелегированноеСогласование");
			НСтр.Исполнитель = Параметр1;
			НСтр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение");
			ОбновитьПанельСостояний();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура СостоянияСтатусСогласованияПриИзменении(Элемент)
	
	ТекД = Элементы.Состояния.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ТекД.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен");
	КонецЕсли;
	
КонецПроцедуры

// Процедура обновляет панель текущего пользователя
&НаСервере
Процедура ОбновитьПанельТекущегоПользователя()
	
	МаршрутизацияСервер.ОбновитьПанельТекущегоПользователя(Объект, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
КонецПроцедуры

// Функция обновляет панель состояний документа для графического отражения его движения по состояниям
&НаСервере
Процедура ОбновитьПанельСостояний()
	
	МаршрутизацияСервер.ОбновитьПанельСостояний(ЭтотОбъект); 
	
	// ДИТ US 80736 ТА 81088 Сержантова А.С. Начало: 28.02.2024 - сформируем заголовок задачи обновления  // ДИТ US 81881 ТА 83581 08.04.2024
	//Если Объект.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля Тогда
	//	ТекстЗаменыЗаголовка = "выдачи";
	//Иначе	
	//    ТекстЗаменыЗаголовка = "сдачи";
	//КонецЕсли;
	//Для каждого ЭлементСостояния Из Элементы.ГруппаПрогрессСостояний.ПодчиненныеЭлементы Цикл
	//	Если СтрНайти(ЭлементСостояния.Заголовок, "[выдачи/сдачи]") <> 0  Тогда
	//		ЭлементСостояния.Заголовок = СтрЗаменить(ЭлементСостояния.Заголовок, "[выдачи/сдачи]", ТекстЗаменыЗаголовка);  	
	//	КонецЕсли;
	//КонецЦикла;
	// ДИТ US 80736 ТА 81088 Сержантова А.С. Конец: 28.02.2024
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИИзменитьКоличествоВес(Ключ,ИтогПоГуиду,ИмяРеквизита);
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 начало
	//СтруктураПоиска = Новый Структура("ИдентификаторСтрокиТЧ",ГУИДСтроки);
	//НайденныеСтроки = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска);
	//Для Каждого НайдСтрока Из НайденныеСтроки Цикл
	//	Если НайдСтрока[ИмяРеквизита] <> ИтогПоГуиду Тогда
	//		НайдСтрока[ИмяРеквизита] = ИтогПоГуиду;
	//		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//			НайдСтрока.ОбновленыИсходныеДанные = Истина;
	//			ОбновитьТаблицуОформления(ИмяРеквизита,"ИдентификаторСтрокиТЧ",ГУИДСтроки,"Контейнеры");
	//		КонецЕсли;
	//	КонецЕсли;	
	//КонецЦикла;
	
	СтруктураПоиска = Новый Структура("КлючАналитикиПеревозки",Ключ);
	НайденныеСтроки = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска);
	Для Каждого НайдСтрока Из НайденныеСтроки Цикл
		Если НайдСтрока[ИмяРеквизита] <> ИтогПоГуиду Тогда
			НайдСтрока[ИмяРеквизита] = ИтогПоГуиду;
			Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
				НайдСтрока.ОбновленыИсходныеДанные = Истина;
				ОбновитьТаблицуОформления(ИмяРеквизита,"ИдентификаторСтрокиТЧ",НайдСтрока.ИдентификаторСтрокиТЧ,"Контейнеры");
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;	
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 конец
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьКонтейнерИКонтейнерФакт(Источник,Приемник,ИдентификаторСтрокиТЧ,ИмяПоля,НомерЗаказаНаТС = Неопределено,ТипКТК = Неопределено,КлючАналитикиПеревозки = Неопределено,ВерсияКлюча = неопределено)
	
	МассивИзменяемыхИдентификаторов = Новый Массив;
	МассивИзменяемыхИдентификаторов.Добавить(ИдентификаторСтрокиТЧ);
	
	Если ТипЗнч(Приемник) = Тип("СправочникСсылка.ТЕ") Тогда
		КТК = РаботаСКонтейнерамиСервер.НайтиКТК(Источник, Ложь);
		Если КТК <> Неопределено Тогда
			Приемник = КТК; 
			// ДИТ US 76935 ТА 78648 Сержантова А.С. Начало: 12.12.2023
			// Было:
			//ДобавитьЗначениеРеквизитаВКлюч(КлючАналитикиПеревозки,Приемник,"Контейнер",,,ВерсияКлюча); 
			// ДИТ US 76935 ТА 78648 Сержантова А.С. Конец: 12.12.2023
			Возврат;
		Иначе
			Приемник = РаботаСКонтейнерамиСервер.СоздатьКТК(Источник, ТипКТК);     
			// ДИТ US 76935 ТА 78648 Сержантова А.С. Начало: 12.12.2023
			// Было:
			//ДобавитьЗначениеРеквизитаВКлюч(КлючАналитикиПеревозки,Приемник,"Контейнер",,,ВерсияКлюча);
			// ДИТ US 76935 ТА 78648 Сержантова А.С. Конец: 12.12.2023
			МассивКонтейнеров = Новый Массив;
			МассивКонтейнеров.Добавить(Приемник);
			РаботаСКонтейнерамиСервер.ДобавитьИнформациюОбИсточникеСозднияКонтейнеров(МассивКонтейнеров, "Заказ на ТС № " + НомерЗаказаНаТС);
		КонецЕсли;
		
	Иначе
		Приемник = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Источник,"Наименование");
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ПроверитьИзменениеИОформить(Объект.Ссылка,ИмяПоля,Приемник,"ИдентификаторСтрокиТЧ",МассивИзменяемыхИдентификаторов,"Контейнеры");
			ОбновленыИсходныеДанные = Истина;
		КонецЕсли;
	КонецЕсли;	
	
	
КонецПроцедуры	

&НаКлиенте
Процедура УдалитьКонтактнуюИнформациюПоТекДанным(ТекД,ИмяПоля = "")
	//ДИТ Шевченко А.В. US 62421 ТА 67386 18.05.2023
	//Если КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.Количество() = 0 Тогда
	//	Возврат;
	//КонецЕсли;	
	//ИмяПоля = КонтактнаяИнформацияОписаниеДополнительныхРеквизитов[0].ИмяРеквизита;
	//ИмяПоляЗначение = ИмяПоля + "Значение";
	//ТекД[ИмяПоля] = "";
	//ТекД[ИмяПоляЗначение] = "";
	//СтруктураПоиска = Новый Структура("ИдентификаторСтрокиТабличнойЧасти",ТекД.ИдентификаторСтрокиТабличнойЧасти);
	//НайденныеСтрки = Объект.КонтактнаяИнформация.НайтиСтроки(СтруктураПоиска);
	//Для Каждого НайденнаяСтрока Из НайденныеСтрки Цикл
	//	Объект.КонтактнаяИнформация.Удалить(НайденнаяСтрока);
	//КонецЦикла;
	//ДИТ Шевченко А.В. US 62421 ТА 67386 18.05.2023
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаВводаДополнительнаяИнформация(СтрокаЗнач, ДополнительныеПараметры) Экспорт
	Если СтрокаЗнач = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	ТекД = Элементы.Контейнеры.ТекущиеДанные;
	Если СтрокаЗнач <> ДополнительныеПараметры Тогда //ДИТ Шевченко А.В. 27.01.23 64884
		ТекД.ДополнительнаяИнформация = СтрокаЗнач;
		КонтейнерыПриИзменении(Элементы.Контейнеры); //ДИТ Шевченко А.В. 27.01.23 64884
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ОбновитьОформлениеПослеЗапроса(ДатаОтправкиЗапроса)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПротоколОбменов.УИДИсточника КАК УИДИсточника 
		// ДИТ US 78233 TA 78240 Сержантова А.С. Начало: 23.01.2024
		|ПОМЕСТИТЬ ВТ_ГУИДыОтправленныхСтрок
		// ДИТ US 78233 TA 78240 Сержантова А.С. Конец: 23.01.2024
		|ИЗ
		|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		|ГДЕ
		|	(ВЫРАЗИТЬ(ПротоколОбменов.Объект КАК Документ.ЗапросНаАвтоперевозку)) = &Объект
		|	И ПротоколОбменов.УзелОбмена        = &УзелОбмена
		|	И ПротоколОбменов.ДействиеПриОбмене = &ДействиеПриОбмене
		|	И ПротоколОбменов.ДатаОбмена        >= &ДатаОбмена
		// ДИТ US 78233 TA 78240 Сержантова А.С. Начало: 23.01.2024 - выберем сразу все данные для фиксирования отправленных данных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗапросНаАвтоперевозкуКонтейнеры.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	ВТ_ГуидыОтправленныхСтрок.УИДИсточника КАК ИдентификаторСтрокиТЧ,
		|	КлючиАналитикиПеревозки.Груз.ЕТСНГ КАК ГрузЕТСНГ,
		|	КлючиАналитикиПеревозки.Груз КАК Груз,
		|	КлючиАналитикиПеревозки.Контейнер КАК Контейнер,
		|	КлючиАналитикиПеревозки.ВесГруза КАК ВесГруза,
		|	КлючиАналитикиПеревозки.КоличествоМест КАК КоличествоМест,
		|	КлючиАналитикиПеревозки.ИнструкцияПоСдаче КАК ИнструкцияПоСдаче,
		|	КлючиАналитикиПеревозкиМили.АдресКлиента КАК АдресКлиента
		|ИЗ
		|	ВТ_ГуидыОтправленныхСтрок КАК ВТ_ГуидыОтправленныхСтрок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
		|				ПО (КлючиАналитикиПеревозки.Ссылка = КлючиАналитикиПеревозкиМили.Ссылка)
		|					И (КлючиАналитикиПеревозкиМили.ЭтапПеревозки = &ЭтапПеревозки)
		|			ПО (ЗапросНаАвтоперевозкуКонтейнеры.КлючАналитикиПеревозки = КлючиАналитикиПеревозки.Ссылка)
		|		ПО (ВТ_ГуидыОтправленныхСтрок.УИДИсточника = ЗапросНаАвтоперевозкуКонтейнеры.ИдентификаторСтрокиТЧ)
		|ГДЕ
		|	ЗапросНаАвтоперевозкуКонтейнеры.Ссылка = &Объект  
		|;
		| 
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗапросНаАвтоперевозкуКонтейнеры.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	ВТ_ГуидыОтправленныхСтрок.УИДИсточника КАК ИдентификаторСтрокиТЧ,
		|	КлючиАналитикиПеревозкиДетализацияПоГрузу.Груз КАК Груз,
		|	КлючиАналитикиПеревозкиДетализацияПоГрузу.Груз.ЕТСНГ КАК ГрузЕТСНГ,
		|	КлючиАналитикиПеревозкиДетализацияПоГрузу.КоличествоМест КАК КоличествоМест,
		|	КлючиАналитикиПеревозкиДетализацияПоГрузу.ВесГруза КАК ВесГруза
		|ИЗ
		|	ВТ_ГуидыОтправленныхСтрок КАК ВТ_ГуидыОтправленныхСтрок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.ДетализацияПоГрузу КАК КлючиАналитикиПеревозкиДетализацияПоГрузу
		|			ПО (ЗапросНаАвтоперевозкуКонтейнеры.КлючАналитикиПеревозки = КлючиАналитикиПеревозкиДетализацияПоГрузу.Ссылка)
		|		ПО (ВТ_ГуидыОтправленныхСтрок.УИДИсточника = ЗапросНаАвтоперевозкуКонтейнеры.ИдентификаторСтрокиТЧ)
		|ГДЕ
		|	ЗапросНаАвтоперевозкуКонтейнеры.Ссылка = &Объект  
		|ИТОГИ ПО
		|	ИдентификаторСтрокиТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ГуидыОтправленныхСтрок.УИДИсточника КАК УИДИсточника
		|ИЗ
		|	ВТ_ГуидыОтправленныхСтрок КАК ВТ_ГуидыОтправленныхСтрок";
	Запрос.УстановитьПараметр("ЭтапПеревозки", Объект.ЭтапПеревозки);	
	// ДИТ US 78233 TA 78240 Сержантова А.С. Конец: 23.01.2024
	
	Запрос.УстановитьПараметр("ДатаОбмена", ДатаОтправкиЗапроса);
	Запрос.УстановитьПараметр("ДействиеПриОбмене", Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
	Запрос.УстановитьПараметр("Объект", Объект.Ссылка);
	Запрос.УстановитьПараметр("УзелОбмена", Перечисления.УзлыОбмена.ТЛ);
	
	// ДИТ US 78233 TA 78240 Сержантова А.С. Начало: 23.01.2024
	// Было:
	//РезультатЗапроса = Запрос.Выполнить(); 
	//Стало:  
	ПакетРезультатов = Запрос.ВыполнитьПакет();   
	РезультатОтправленныеСтроки = ПакетРезультатов[1];
	РезультатОтправленнаяДетализациГруза = ПакетРезультатов[2];
	РезультатЗапроса = ПакетРезультатов[3];
	// ДИТ US 78233 TA 78240 Сержантова А.С. Конец: 23.01.2024
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		УстановитьУсловноеОформлениеШапки();
		СписокРекОформленияШапки.Очистить();
	КонецЕсли;	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураПоиска = Новый Структура("ИдентификаторСтрокиТЧ",ВыборкаДетальныеЗаписи.УИДИсточника);
		МассивСтрок = ТаблицаОформленияКолонок.НайтиСтроки(СтруктураПоиска);
		Если МассивСтрок.Количество() > 0 Тогда    
			// ДИТ US 78243 ТА 80825 Сержантова А.С. Начало: 08.02.2024
			// Было:
			//ТаблицаОформленияКолонок.Удалить(МассивСтрок[0]); 
			//Стало:
			Для каждого СтрокаОформления Из МассивСтрок Цикл
				ТаблицаОформленияКолонок.Удалить(СтрокаОформления);
			КонецЦикла;
			// ДИТ US 78243 ТА 80825 Сержантова А.С. Конец: 08.02.2024
		КонецЕсли;
		МассивСтрокКонтейнеры = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска);
		Если МассивСтрокКонтейнеры.Количество() > 0 Тогда
			МассивСтрокКонтейнеры[0].ОбновленыИсходныеДанные = Ложь;
			Если НЕ МассивСтрокКонтейнеры[0].СтатусЗапросаНаАвтоперевозку = Перечисления.СтатусЗапросаНаПеревозку.Отменен Тогда
				МассивСтрокКонтейнеры[0].СтатусЗапросаНаАвтоперевозку = Перечисления.СтатусЗапросаНаПеревозку.Отправлен;
			КонецЕсли;  
			// ДИТ US 78233 TA 78240 Сержантова А.С. Начало: 26.01.2024
			ВерсияКлюча = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(МассивСтрокКонтейнеры[0].КлючАналитикиПеревозки, "ВерсияДанных");
			МассивСтрокКонтейнеры[0].ВерсияКлючаАналитикиОтправленоВТЛ = ВерсияКлюча;
			// ДИТ US 78233 TA 78240 Сержантова А.С. Конец: 26.01.2024
		КонецЕсли;
	КонецЦикла;  
	
	// ДИТ US 78233 TA 78240 Сержантова А.С. Начало: 23.01.2024  
	// Здесь фиксируем данные ключа, отправленные в ТЛ для дальнейшего подсвечивания измененных  
	ВыборкаОтправленныеСтроки = РезультатОтправленныеСтроки.Выбрать();
	Пока ВыборкаОтправленныеСтроки.Следующий() Цикл
		СтруктураПоиска = Новый Структура("ИдентификаторСтрокиТЧ",ВыборкаОтправленныеСтроки.ИдентификаторСтрокиТЧ);
		ОтправленныеСтроки = ДанныеКлючейОтправленныхВТЛ.НайтиСтроки(СтруктураПоиска);    
		Если ОтправленныеСтроки.Количество() > 0 Тогда 
			ЗаполнитьЗначенияСвойств(ОтправленныеСтроки[0], ВыборкаОтправленныеСтроки);
		Иначе
			НС = ДанныеКлючейОтправленныхВТЛ.Добавить();
			ЗаполнитьЗначенияСвойств(НС, ВыборкаОтправленныеСтроки);
		КонецЕсли;
	КонецЦикла;	
	ВыборкаОтправленныеСтроки = РезультатОтправленнаяДетализациГруза.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОтправленныеСтроки.Следующий() Цикл
		СтруктураПоиска = Новый Структура("ИдентификаторСтрокиТЧ",ВыборкаОтправленныеСтроки.ИдентификаторСтрокиТЧ);
		ОтправленныеСтроки = ДетализацияПоГрузуОтправленоВТЛ.НайтиСтроки(СтруктураПоиска);    
		Если ОтправленныеСтроки.Количество() > 0 Тогда
			Для каждого СтрДетализацииПоКлючу Из ОтправленныеСтроки Цикл
				ДетализацияПоГрузуОтправленоВТЛ.Удалить(СтрДетализацииПоКлючу);	
			КонецЦикла;
		КонецЕсли;  
		ВыборкаДетализацииКлючаОтправлено = ВыборкаОтправленныеСтроки.Выбрать();
		Пока ВыборкаДетализацииКлючаОтправлено.Следующий() Цикл
			НС = ДетализацияПоГрузуОтправленоВТЛ.Добавить();
			ЗаполнитьЗначенияСвойств(НС, ВыборкаДетализацииКлючаОтправлено);
		КонецЦикла;
	КонецЦикла;  
	// ДИТ US 78233 TA 78240 Сержантова А.С. Конец: 23.01.2024
	
    УстановитьУсловноеОформлениеТЧ();
	// ДИТ US 78233 TA 78240 Сержантова А.С. Начало: 26.01.2024
	// Было:  
	//СтруктураЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	//ЭтотОбъект.Записать(СтруктураЗаписи); 
	//Стало:    
	ЗапросОб = РеквизитФормыВЗначение("Объект");     
	ТабКлючей = РеквизитФормыВЗначение("ДанныеКлючейОтправленныхВТЛ");   
	ТабДетализацияПоГрузу = РеквизитФормыВЗначение("ДетализацияПоГрузуОтправленоВТЛ");
	ЗапросОб.ПоместитьОтправленныеДанныеВТЛВХранилище(ТабКлючей, ТабДетализацияПоГрузу); 
	// ДИТ US 78243 ТА 80825 Сержантова А.С. Начало: 08.02.2024
	ТЗОформления = РеквизитФормыВЗначение("ТаблицаОформленияКолонок");
	ЗапросОб.ПоместитьТаблицыОформленияВХранилище(ТЗОформления,СписокРекОформленияШапки);
	// ДИТ US 78243 ТА 80825 Сержантова А.С. Конец: 08.02.2024
	Попытка
		ЗапросОб.Записать(РежимЗаписиДокумента.Проведение);    
	Исключение    
		Сообщить("Не удалось записать отправленные в ТЛ данные. Проведите документ");
	КонецПопытки;      
	// ДИТ US 78243 ТА 80825 Сержантова А.С. Начало: 08.02.2024
	// Было:
	//ЭтаФорма.Прочитать();  
	//Стало:          
	ЗначениеВРеквизитФормы(ЗапросОб, "Объект");  
	ЭтаФорма.Прочитать();
	// ДИТ US 78243 ТА 80825 Сержантова А.С. Конец: 08.02.2024
	// ДИТ US 78233 TA 78240 Сержантова А.С. Конец: 26.01.2024
	
	ЗаполнитьНомерДатуЗаказаНаТС();
КонецПроцедуры	

&НаКлиенте
Функция ПроверитьВозможностьУстановкиПоляНеТребуется(ТекД,ТекПолеЗначение,КолличествоУстановленных = 0)
	
	Если ТекПолеЗначение Тогда
		Возврат Истина;
	КонецЕсли;	
	
	Если ТекД.НеТребуетсяТерминалВыдачи Тогда
		КолличествоУстановленных = КолличествоУстановленных + 1;
	КонецЕсли;
	Если ТекД.НеТребуетсяТерминалСдачи Тогда
		КолличествоУстановленных = КолличествоУстановленных + 1;
	КонецЕсли;
	Если ТекД.НеТребуетсяАдрес Тогда
		КолличествоУстановленных = КолличествоУстановленных + 1;
	КонецЕсли;
	
	Если КолличествоУстановленных >= 2 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Исключение более двух пунктов из маршрута перевозки невозможно",,,,);	
	КонецЕсли;	
	
	Возврат КолличествоУстановленных < 2;
	
КонецФункции	

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбОбновлении(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет или Результат = КодВозвратаДиалога.Таймаут Тогда
        Возврат;
	КонецЕсли;
	ПолучитьПромежуточнуюИзХранилищаИОбновить(Параметры.АдресХранилища,Параметры.КоличествоНеДобавленных);	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаПланФактКТК(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет или Результат = КодВозвратаДиалога.Таймаут Тогда
        Возврат;
	КонецЕсли;
	ВыгрузитьЗаказНаАвтоПоИзменениямПланФактКТК(Параметры.МассивГуидовТЧ);	
КонецПроцедуры

&НаСервере
Процедура ПроверитьИзменениеИОформить(СсылкаЗапрос,ИмяПоля,НовоеЗначение,ПолеУсловия,МассивИзменяемыхИдентификаторов,ИмяТЧ,ЭтоАдрес = Ложь)
	
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 начало
	Если ИмяПоля = "Груз" ИЛИ ИмяПоля = "Контейнер" 
		// ДИТ US 76935 ТА 78648 Сержантова А.С. Начало: 18.12.2023
		или ИмяПоля = "ИнструкцияПоСдаче" Тогда
		// ДИТ US 76935 ТА 78648 Сержантова А.С. Конец: 18.12.2023
		ИмяПоля = "КлючАналитикиПеревозки." + ИмяПоля;	
	КонецЕсли;	
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 конец
	
	//ДИТ Шевченко А.В. US 62421 ТА 67386 18.05.2023 -Начало
	//Если ЭтоАдрес Тогда
	//	
	//	ТекстЗапроса = 
	//	"ВЫБРАТЬ
	//	|	ЗапросНаАвтоперевозкуКонтейнеры.ИдентификаторСтрокиТабличнойЧасти КАК ИдентификаторСтрокиТабличнойЧасти,
	//	|	ЗапросНаАвтоперевозкуКонтейнеры.ИдентификаторСтрокиТЧ КАК ИдентификаторСтрокиТЧ
	//	|ПОМЕСТИТЬ ВТ_СтрокаТЧ
	//	|ИЗ
	//	|	Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
	//	|ГДЕ
	//	|	ЗапросНаАвтоперевозкуКонтейнеры.ИдентификаторСтрокиТЧ В(&ИдентификаторСтрокиТЧ)
	//	|	И ЗапросНаАвтоперевозкуКонтейнеры.Ссылка = &Ссылка
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ЕСТЬNULL(ЗапросНаАвтоперевозкуКонтактнаяИнформация.Представление, """") КАК ИмяПоля,
	//	|	ВТ_СтрокаТЧ.ИдентификаторСтрокиТЧ КАК ИдентификаторСтрокиТЧ
	//	|ИЗ
	//	|	ВТ_СтрокаТЧ КАК ВТ_СтрокаТЧ
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗапросНаАвтоперевозку.КонтактнаяИнформация КАК ЗапросНаАвтоперевозкуКонтактнаяИнформация
	//	|		ПО ВТ_СтрокаТЧ.ИдентификаторСтрокиТабличнойЧасти = ЗапросНаАвтоперевозкуКонтактнаяИнформация.ИдентификаторСтрокиТабличнойЧасти";
	
	Запрос = Новый Запрос;
	
	Если ИмяПоля = "АдресКлиента" Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	КлючМили."+ИмяПоля+" КАК ИмяПоля,
		|	ЗапросНаАвтоперевозкуКонтейнеры.ИдентификаторСтрокиТЧ КАК ИдентификаторСтрокиТЧ
		|ИЗ
		|	Документ.ЗапросНаАвтоперевозку."+ИмяТЧ+" КАК ЗапросНаАвтоперевозкуКонтейнеры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючМили
		|				ПО ЗапросНаАвтоперевозкуКонтейнеры.КлючАналитикиПеревозки = КлючМили.Ссылка
		|					И КлючМили.ЭтапПеревозки = &ЭтапПеревозки
		|ГДЕ
		|	ЗапросНаАвтоперевозкуКонтейнеры.Ссылка = &Ссылка
		|	И ЗапросНаАвтоперевозкуКонтейнеры.ИдентификаторСтрокиТЧ В(&ИдентификаторСтрокиТЧ)";
		
		Запрос.УстановитьПараметр("ЭтапПеревозки", Объект.ЭтапПеревозки);
	//ДИТ Шевченко А.В. US 62421 ТА 67386 18.05.2023 -конец	
	Иначе
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ЗапросНаАвтоперевозкуКонтейнеры."+ИмяПоля+" КАК ИмяПоля,
		|	ЗапросНаАвтоперевозкуКонтейнеры.ИдентификаторСтрокиТЧ КАК ИдентификаторСтрокиТЧ
		|ИЗ
		|	Документ.ЗапросНаАвтоперевозку."+ИмяТЧ+" КАК ЗапросНаАвтоперевозкуКонтейнеры
		|ГДЕ
		|	ЗапросНаАвтоперевозкуКонтейнеры.Ссылка = &Ссылка
		|	И ЗапросНаАвтоперевозкуКонтейнеры.ИдентификаторСтрокиТЧ В(&ИдентификаторСтрокиТЧ)";
		
	КонецЕсли;	
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ИдентификаторСтрокиТЧ", МассивИзменяемыхИдентификаторов);
	Запрос.УстановитьПараметр("Ссылка", СсылкаЗапрос);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
	Для Каждого ИдентифСтроки Из МассивИзменяемыхИдентификаторов Цикл
		СтруктураПоиска = Новый Структура("ИдентификаторСтрокиТЧ",ИдентифСтроки);
		НайденныеСтроки = РезультатЗапроса.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Если НайденныеСтроки[0].ИмяПоля = НовоеЗначение И НЕ ЭтоАдрес Тогда
				//УдалитьСтрокуИзТаблицыОформления(ИмяПоля,ПолеУсловия,ИдентифСтроки,ИмяТЧ);
				Продолжить;
			КонецЕсли;
			ОбновитьТаблицуОформления(ИмяПоля,ПолеУсловия,ИдентифСтроки,ИмяТЧ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьНомерДатуЗаказаНаТС()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		//Евросиб Коханенко Н.А. 06.06.2024 (( #83866 
		//|	ПротоколОбменов.ДатаОбмена КАК ДатаСозданияЗаказаНаТС,
		|	ПротоколОбменов.ДатаОбмена КАК ДатаОбновленияЗаказаНаТС,
		//Евросиб Коханенко Н.А. 06.06.2024 )) #83866 
		|	ПротоколОбменов.НомерДатаВБУ КАК НомерЗаказаНаТС,
		|	ПротоколОбменов.УИДИсточника КАК ИдентификаторСтрокиТЧ
		|ИЗ
		|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		|ГДЕ
		|	(ВЫРАЗИТЬ(ПротоколОбменов.Объект КАК Документ.ЗапросНаАвтоперевозку)) = &Объект
		|	И ПротоколОбменов.УзелОбмена = &УзелОбмена";
	
	Запрос.УстановитьПараметр("Объект", Объект.Ссылка);
	Запрос.УстановитьПараметр("УзелОбмена", Перечисления.УзлыОбмена.ТЛ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураПоиска = Новый Структура("ИдентификаторСтрокиТЧ",ВыборкаДетальныеЗаписи.ИдентификаторСтрокиТЧ);
		НайденыеСтроки = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска);
		Если НайденыеСтроки.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(НайденыеСтроки[0],ВыборкаДетальныеЗаписи);
		КонецЕсли;	
	КонецЦикла;
	Модифицированность = ЭтаФорма.Модифицированность;
КонецПроцедуры	

&НаСервере
Функция ПроверитьСтрокиНаВозможностьВосстановления(ГуидыДляВосставновления,Заявка,ЭтапПеревозки)
	
	МассивСтрокДобавленныеИзУслуг      = Новый Массив;
	МассивСтрокДобавленныеИзЗапросаКТК = Новый Массив;
	Для Каждого ГуидСтрокиДляВосставновления Из ГуидыДляВосставновления Цикл
		СтруктураОтбора = Новый Структура("ИдентификаторСтрокиТЧ",ГуидСтрокиДляВосставновления);
		НайденныеСтроки = Объект.Контейнеры.НайтиСтроки(СтруктураОтбора);
		
		Если НайденныеСтроки.Количество() > 0 Тогда			
			СтрокаДляВосставновления = НайденныеСтроки[0];
			Если ЗначениеЗаполнено(СтрокаДляВосставновления.ИдентификаторСтрокиУслуги) Тогда
				МассивСтрокДобавленныеИзУслуг.Добавить(СтрокаДляВосставновления);
			Иначе
				МассивСтрокДобавленныеИзЗапросаКТК.Добавить(СтрокаДляВосставновления);
			КонецЕсли;		
		КонецЕсли;			
	КонецЦикла;
	
	Если МассивСтрокДобавленныеИзУслуг.Количество() > 0 Тогда
		МассивГуидовУслугиИтог = ПроверитВозможностьВосстановленияИзУслуг(МассивСтрокДобавленныеИзУслуг,Заявка,ЭтапПеревозки);
		Для Каждого МассивГуид из МассивГуидовУслугиИтог Цикл
			СтруктураПоиска = Новый Структура("ИдентификаторСтрокиТЧ",МассивГуид);
			НайденнаяСтрока = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска);
			Если НайденнаяСтрока.Количество() > 0 Тогда
				НайденнаяСтрока[0].СтатусЗапросаНаАвтоперевозку = Перечисления.СтатусЗапросаНаПеревозку.Черновик;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
	Если МассивСтрокДобавленныеИзЗапросаКТК.Количество() > 0 Тогда
		МассивГуидовЗапросИтог = ПроверитВозможностьВосстановленияИзЗапроса(МассивСтрокДобавленныеИзЗапросаКТК,Заявка,ЭтапПеревозки);
		Для Каждого МассивГуид из МассивГуидовЗапросИтог Цикл
			СтруктураПоиска = Новый Структура("ИдентификаторСтрокиТЧ",МассивГуид);
			НайденнаяСтрока = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска);
			Если НайденнаяСтрока.Количество() > 0 Тогда
				НайденнаяСтрока[0].СтатусЗапросаНаАвтоперевозку = Перечисления.СтатусЗапросаНаПеревозку.Черновик;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
	МассивНеВосстановленныхНомеровСтрок = Новый Массив;
	
	Для Каждого МассивЗнч Из МассивСтрокДобавленныеИзУслуг Цикл
		Если МассивГуидовУслугиИтог.Найти(МассивЗнч.ИдентификаторСтрокиТЧ) = Неопределено Тогда
			МассивНеВосстановленныхНомеровСтрок.Добавить(МассивЗнч.НомерСтроки);			
		КонецЕсли;	
	КонецЦикла;
	
	Для Каждого МассивЗнч Из МассивСтрокДобавленныеИзЗапросаКТК Цикл
		Если МассивГуидовЗапросИтог.Найти(МассивЗнч.ИдентификаторСтрокиТЧ) = Неопределено Тогда
			МассивНеВосстановленныхНомеровСтрок.Добавить(МассивЗнч.НомерСтроки);			
		КонецЕсли;	
	КонецЦикла;
	
	Возврат МассивНеВосстановленныхНомеровСтрок;
	
КонецФункции	

&НаСервереБезКонтекста
Функция ПроверитВозможностьВосстановленияИзУслуг(МассивСтрокДобавленныеИзУслуг,Заявка,ЭтапПеревозки)
	
	Тз = Новый ТаблицаЗначений;
	Тз.Колонки.Добавить("ИдентификаторСтрокиУслуги",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));
	Тз.Колонки.Добавить("ИдентификаторСтрокиТЧ",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));
	Для Каждого СтрокаМ Из МассивСтрокДобавленныеИзУслуг Цикл
		ЗаполнитьЗначенияСвойств(Тз.Добавить(),СтрокаМ);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.ИдентификаторСтрокиУслуги КАК ИдентификаторСтрокиУслуги,
	               |	ТЗ.ИдентификаторСтрокиТЧ КАК ИдентификаторСтрокиТЧ
	               |ПОМЕСТИТЬ ВТ_СтрокиДляВосстановления
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_СтрокиДляВосстановления.ИдентификаторСтрокиУслуги КАК ИдентификаторСтрокиУслуги,
	               |	ВТ_СтрокиДляВосстановления.ИдентификаторСтрокиТЧ КАК ИдентификаторСтрокиТЧ
	               |ИЗ
	               |	ВТ_СтрокиДляВосстановления КАК ВТ_СтрокиДляВосстановления
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	               |		ПО ВТ_СтрокиДляВосстановления.ИдентификаторСтрокиУслуги = ЗаявкаСоставУслуги.ГУИДСтроки
	               |ГДЕ
	               |	ЗаявкаСоставУслуги.Ссылка = &Ссылка
	               |	И &Миля = ЗНАЧЕНИЕ(Перечисление.ВариантыАвтоперевозки.СиламиЕвросиб)";
	
	Запрос.УстановитьПараметр("ТЗ",Тз);
	Запрос.УстановитьПараметр("Ссылка",Заявка);
	Если ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Миля","ЗаявкаСоставУслуги.ПерваяМиля");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Миля","ЗаявкаСоставУслуги.ПоследняяМиля");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаРезультата = РезультатЗапроса.Выбрать();
	
	МассивДляВозврата = Новый Массив;
	Пока ВыборкаРезультата.Следующий() Цикл
		МассивДляВозврата.Добавить(ВыборкаРезультата.ИдентификаторСтрокиТЧ);
	КонецЦикла;	
	
	Возврат МассивДляВозврата;
	
КонецФункции	

&НаСервере
Функция ПроверитВозможностьВосстановленияИзЗапроса(МассивСтрокДобавленныеИзЗапросаКТК,Заявка,ЭтапПеревозки)
	
	ТаблицаСтрокКонтейнеровДляВосст = Новый ТаблицаЗначений;
	ТаблицаСтрокКонтейнеровДляВосст.Колонки.Добавить("ИдентификаторСтрокиЗапроса",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));
	ТаблицаСтрокКонтейнеровДляВосст.Колонки.Добавить("ИдентификаторСтрокиТЧ",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));
	ТаблицаСтрокКонтейнеровДляВосст.Колонки.Добавить("Релиз",Новый ОписаниеТипов("ДокументСсылка.РелизКлиента"));
	ТаблицаСтрокКонтейнеровДляВосст.Колонки.Добавить("НеВосстанавливать",Новый ОписаниеТипов("булево"));
	ТаблицаСтрокКонтейнеровДляВосст.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10)));
	
	Для Каждого МассивЗнч Из МассивСтрокДобавленныеИзЗапросаКТК Цикл
		СтруктураПоиска = Новый Структура("ИдентификаторСтрокиТЧ",МассивЗнч.ИдентификаторСтрокиТЧ);
		НайденныеСтроки = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда
			НовСтрока = ТаблицаСтрокКонтейнеровДляВосст.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока,НайденныеСтроки[0]);
			НовСтрока.Количество = 1;
		КонецЕсли;	
	КонецЦикла;	
	
	ИдентификаторыСИзмененнымСтатусом = ПроверитьИзменениеСтатусаСиламиЕвросибвЗаявке(ТаблицаСтрокКонтейнеровДляВосст.ВыгрузитьКолонку("ИдентификаторСтрокиЗапроса"),Заявка,ЭтапПеревозки);
	
	Для Каждого Идентиф Из ИдентификаторыСИзмененнымСтатусом Цикл
		СтруктураПоиска = Новый Структура("ИдентификаторСтрокиЗапроса",Идентиф);
		НайденныеСтроки = ТаблицаСтрокКонтейнеровДляВосст.НайтиСтроки(СтруктураПоиска);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НайденнаяСтрока.НеВосстанавливать = Истина;
		КонецЦикла;	
	КонецЦикла;	
	
	
	ТаблицаТекНеОтмененныхСтрокВРазрезеРелизов                = ТаблицаСтрокКонтейнеровДляВосст.СкопироватьКолонки("Релиз,Количество");         //Для восстановления строк с релизами
	ТаблицаТекНеОтмененныхСтрокВРазрезеИдентификаторовЗапроса = ТаблицаСтрокКонтейнеровДляВосст.СкопироватьКолонки("ИдентификаторСтрокиЗапроса,Количество"); //Для восстановления строк без релизов
	МассивРелизовСтрокНаВосстановление = ТаблицаСтрокКонтейнеровДляВосст.ВыгрузитьКолонку("Релиз");
	
	Для Каждого СтрокаТЧ Из Объект.Контейнеры Цикл
		Если ЗначениеЗаполнено(СтрокаТч.Релиз) И СтрокаТЧ.СтатусЗапросаНаАвтоперевозку <> Перечисления.СтатусЗапросаНаПеревозку.Отменен Тогда
			НовСтрока = ТаблицаТекНеОтмененныхСтрокВРазрезеРелизов.Добавить();
			НовСтрока.Релиз = СтрокаТч.Релиз;
			НовСтрока.Количество 		 = 1;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТч.Релиз) И СтрокаТЧ.СтатусЗапросаНаАвтоперевозку <> Перечисления.СтатусЗапросаНаПеревозку.Отменен Тогда
			НовСтрока = ТаблицаТекНеОтмененныхСтрокВРазрезеИдентификаторовЗапроса.Добавить();
			НовСтрока.ИдентификаторСтрокиЗапроса = СтрокаТч.ИдентификаторСтрокиЗапроса;
			НовСтрока.Количество 		 = 1;
		КонецЕсли;
	КонецЦикла;	
	
	ТаблицаТекНеОтмененныхСтрокВРазрезеРелизов.Свернуть("Релиз","Количество");	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.ИдентификаторСтрокиЗапроса КАК ИдентификаторСтрокиЗапроса,
	               |	ТЗ.Количество КАК Количество
	               |ПОМЕСТИТЬ ВТ_НеОтмененныеТЗБезРелизов
	               |ИЗ
	               |	&ТЗБезРелизов КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаявкаСписокЗапросНаКТК.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	МАКСИМУМ(ЗаявкаСписокЗапросНаКТК.КоличествоКТК) КАК КоличествоКТК,
	               |	СУММА(ЕстьNull(ВТ_НеОтмененныеТЗБезРелизов.Количество,0)) КАК Количество
	               |ПОМЕСТИТЬ ВТ_КоличествоСтрокПоИндетификаторам
	               |ИЗ
	               |	Документ.Заявка.СписокЗапросНаКТК КАК ЗаявкаСписокЗапросНаКТК
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НеОтмененныеТЗБезРелизов КАК ВТ_НеОтмененныеТЗБезРелизов
	               |		ПО ЗаявкаСписокЗапросНаКТК.ИдентификаторСтроки = ВТ_НеОтмененныеТЗБезРелизов.ИдентификаторСтрокиЗапроса
	               |ГДЕ
	               |	ЗаявкаСписокЗапросНаКТК.Ссылка = &ТекЗаявка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаявкаСписокЗапросНаКТК.ИдентификаторСтроки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗ.Релиз КАК Релиз,
	               |	ТЗ.Количество КАК Количество
	               |ПОМЕСТИТЬ ВТ_НеОтмененныеТЗ
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РелизКлиента.Ссылка КАК Релиз,
	               |	РелизКлиента.ОбщееКоличествоКТКВРелизе - ЕСТЬNULL(ВТ_НеОтмененныеТЗ.Количество, 0) КАК КоличествоКТКВРелизеСУчетомЗапроса
	               |ПОМЕСТИТЬ ВТ_НеОтмененные
	               |ИЗ
	               |	Документ.РелизКлиента КАК РелизКлиента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НеОтмененныеТЗ КАК ВТ_НеОтмененныеТЗ
	               |		ПО (ВТ_НеОтмененныеТЗ.Релиз = РелизКлиента.Ссылка)
	               |ГДЕ
	               |	РелизКлиента.Ссылка В(&МассивРелизовСтрокНаВосстановление)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РелизыКлиентовЗапросовНаКТК.РелизКлиента КАК РелизКлиента,
	               |	СУММА(1) КАК КоличествоВДругихЗапросах
	               |ПОМЕСТИТЬ ВТ_КоличествоИзСвязаныхСРелизомЗапросов
	               |ИЗ
	               |	РегистрСведений.РелизыКлиентовЗапросовНаКТК КАК РелизыКлиентовЗапросовНаКТК
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НеОтмененные КАК ВТ_НеОтмененные
	               |		ПО РелизыКлиентовЗапросовНаКТК.РелизКлиента = ВТ_НеОтмененные.Релиз
	               |			И (РелизыКлиентовЗапросовНаКТК.Заявка <> &ТекЗаявка)
	               |			И (РелизыКлиентовЗапросовНаКТК.РелизКлиента <> ЗНАЧЕНИЕ(Документ.РелизКлиента.ПустаяСсылка))
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
	               |		ПО РелизыКлиентовЗапросовНаКТК.Заявка = ЗапросНаАвтоперевозкуКонтейнеры.Ссылка.Заявка
	               |			И РелизыКлиентовЗапросовНаКТК.ИдентификаторСтрокиЗаявки = ЗапросНаАвтоперевозкуКонтейнеры.ИдентификаторСтрокиЗапроса
	               |			И (ЗапросНаАвтоперевозкуКонтейнеры.СтатусЗапросаНаАвтоперевозку <> ЗНАЧЕНИЕ(Перечисление.СтатусЗапросаНаПеревозку.Отменен))
	               |			И РелизыКлиентовЗапросовНаКТК.РелизКлиента = ЗапросНаАвтоперевозкуКонтейнеры.Релиз
	               |			И (ЗапросНаАвтоперевозкуКонтейнеры.Ссылка.ЭтапПеревозки = &ЭтапПеревозки)
	               |			И (ЗапросНаАвтоперевозкуКонтейнеры.Ссылка.Проведен)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РелизыКлиентовЗапросовНаКТК.РелизКлиента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_НеОтмененные.Релиз КАК Релиз,
	               |	ВТ_НеОтмененные.КоличествоКТКВРелизеСУчетомЗапроса - ЕСТЬNULL(ВТ_КоличествоИзСвязаныхСРелизомЗапросов.КоличествоВДругихЗапросах, 0) КАК Количество
	               |ИЗ
	               |	ВТ_НеОтмененные КАК ВТ_НеОтмененные
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоИзСвязаныхСРелизомЗапросов КАК ВТ_КоличествоИзСвязаныхСРелизомЗапросов
	               |		ПО ВТ_НеОтмененные.Релиз = ВТ_КоличествоИзСвязаныхСРелизомЗапросов.РелизКлиента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_КоличествоСтрокПоИндетификаторам.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	ВТ_КоличествоСтрокПоИндетификаторам.КоличествоКТК - ВТ_КоличествоСтрокПоИндетификаторам.Количество КАК Количество
	               |ИЗ
	               |	ВТ_КоличествоСтрокПоИндетификаторам КАК ВТ_КоличествоСтрокПоИндетификаторам";
	
	Запрос.УстановитьПараметр("МассивРелизовСтрокНаВосстановление", МассивРелизовСтрокНаВосстановление);
	Запрос.УстановитьПараметр("ТЗ", ТаблицаТекНеОтмененныхСтрокВРазрезеРелизов);
	Запрос.УстановитьПараметр("ТЗБезРелизов", ТаблицаТекНеОтмененныхСтрокВРазрезеИдентификаторовЗапроса);
	Запрос.УстановитьПараметр("ТекЗаявка", Заявка);
	Запрос.УстановитьПараметр("ЭтапПеревозки", ЭтапПеревозки);
	РезультатЗапроса = Запрос.ВыполнитьПакет(); 
	ВыборкаРезультатаСРелизами  = РезультатЗапроса[5].Выбрать();
	ВыборкаРезультатаБезРелизов = РезультатЗапроса[6].Выбрать();
	
	Пока ВыборкаРезультатаСРелизами.Следующий() Цикл
		
		ОбщееКоличествоКТКВРелизе = ВыборкаРезультатаСРелизами.Количество;	
		
		СтруктураПоиска = Новый Структура("Релиз,НеВосстанавливать",ВыборкаРезультатаСРелизами.Релиз,Ложь);
		НайденныеСтроки = ТаблицаСтрокКонтейнеровДляВосст.НайтиСтроки(СтруктураПоиска);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Если ОбщееКоличествоКТКВРелизе <= 0 Тогда
				НайденнаяСтрока.НеВосстанавливать = Истина;
			КонецЕсли;	
			ОбщееКоличествоКТКВРелизе = ОбщееКоличествоКТКВРелизе - 1;
		КонецЦикла;	
		
	КонецЦикла;
	
	Пока ВыборкаРезультатаБезРелизов.Следующий() Цикл
		
		ОбщееКоличествоКТКВЗапросе = ВыборкаРезультатаБезРелизов.Количество;	
		
		СтруктураПоиска = Новый Структура("ИдентификаторСтрокиЗапроса,НеВосстанавливать",ВыборкаРезультатаБезРелизов.ИдентификаторСтроки,Ложь);
		НайденныеСтроки = ТаблицаСтрокКонтейнеровДляВосст.НайтиСтроки(СтруктураПоиска);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Если ОбщееКоличествоКТКВЗапросе <= 0 Тогда
				НайденнаяСтрока.НеВосстанавливать = Истина;
			КонецЕсли;	
			ОбщееКоличествоКТКВЗапросе = ОбщееКоличествоКТКВЗапросе - 1;
		КонецЦикла;	
		
	КонецЦикла;
	
	ТаблицаПредварительная = ТаблицаСтрокКонтейнеровДляВосст.Скопировать(Новый Структура("НеВосстанавливать",Ложь),"ИдентификаторСтрокиТЧ");
	МассивВозврата = ТаблицаПредварительная.ВыгрузитьКолонку("ИдентификаторСтрокиТЧ");
	Возврат МассивВозврата;
КонецФункции	

&НаСервере
Функция ПроверитьИзменениеСтатусаСиламиЕвросибвЗаявке(ИдентЗапроса,Заявка,ЭтапПеревозки)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаСписокЗапросНаКТК.ИдентификаторСтроки КАК ИдентификаторСтроки
		|ИЗ
		|	Документ.Заявка.СписокЗапросНаКТК КАК ЗаявкаСписокЗапросНаКТК
		|ГДЕ
		|	ЗаявкаСписокЗапросНаКТК.Ссылка = &Ссылка
		|	И ЗаявкаСписокЗапросНаКТК.ИдентификаторСтроки В(&ИдентификаторСтроки)
		|	И &Миля <> ЗНАЧЕНИЕ(Перечисление.ВариантыАвтоперевозки.СиламиЕвросиб)";
	
    Если ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Миля","ЗаявкаСписокЗапросНаКТК.Автоперевозка");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Миля","ЗаявкаСписокЗапросНаКТК.ПоследняяМиля");
	КонецЕсли;
	Запрос.УстановитьПараметр("ИдентификаторСтроки", ИдентЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Заявка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивОтвет = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивОтвет.Добавить(ВыборкаДетальныеЗаписи.ИдентификаторСтроки);
	КонецЦикла;
	
	Возврат МассивОтвет;
	
КонецФункции	

&НаСервере
Функция ПолучитьАдресТЧ()
	СтруктураОтбора = Новый Структура("СтатусЗапросаНаАвтоперевозку",Перечисления.СтатусЗапросаНаПеревозку.Отменен);
	НайденныеСтроки = Объект.Контейнеры.НайтиСтроки(СтруктураОтбора);
	Возврат ПоместитьВоВременноеХранилище(НайденныеСтроки,ЭтаФорма.УникальныйИдентификатор);
КонецФункции	

&НаКлиенте
Процедура УстановитьВидимостьКомандыДобавитьУдаленныеКТКВЗапрос()
	
	СтруктураПоиска = Новый Структура("СтатусЗапросаНаАвтоперевозку",ПредопределенноеЗначение("Перечисление.СтатусЗапросаНаПеревозку.Отменен"));
	НайденныеСтроки = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска);
	
	//Евросиб Коханенко Н.А. 16.05.2024 (( #83866 
	МассивГУИДыПеренесенныхКТК = ПолучитьМассивГУИДовПеренесенныхКТК(Объект.Заявка);
	КоличествоСтрок = НайденныеСтроки.Количество()-1;
    ИндексСтроки = КоличествоСтрок;
	Для Счетчик = 0 по КоличествоСтрок Цикл
		СтрокаКТК = НайденныеСтроки[ИндексСтроки];
		Если МассивГУИДыПеренесенныхКТК.Найти(СтрокаКТК.ИдентификаторСтрокиУслуги) <> Неопределено Тогда
			НайденныеСтроки.Удалить(ИндексСтроки);	
		КонецЕсли;
       	ИндексСтроки = ИндексСтроки - 1;
	КонецЦикла;
	//Евросиб Коханенко Н.А. 16.05.2024 )) #83866 

	Элементы.КонтейнерыДобавитьУдаленныеКТКВЗапрос.Видимость = НайденныеСтроки.Количество() > 0; 
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьРежимыВыбораДляТабличнойЧасти()
	
	Элементы.КонтейнерыТипОперацииНаТерминалеВыдачи.РежимВыбораИзСписка = Истина;
    Элементы.КонтейнерыТипОперацииНаТерминалеВыдачи.СписокВыбора.Добавить(Перечисления.ТипОперацииНаТерминале.ПриемПорожнегоКТК);
    Элементы.КонтейнерыТипОперацииНаТерминалеВыдачи.СписокВыбора.Добавить(Перечисления.ТипОперацииНаТерминале.ПриемГруженогоКТК);
	
	Элементы.КонтейнерыТипОперацииНаСкладеКлиента.РежимВыбораИзСписка = Истина;
    Элементы.КонтейнерыТипОперацииНаСкладеКлиента.СписокВыбора.Добавить(Перечисления.ТипОперацииНаТерминале.ЗагрузкаПорожнегоКТК);
    Элементы.КонтейнерыТипОперацииНаСкладеКлиента.СписокВыбора.Добавить(Перечисления.ТипОперацииНаТерминале.РазгрузкаГруженогоКТК);
	
	Элементы.КонтейнерыТипОперацииНаТерминалеСдачи.РежимВыбораИзСписка = Истина;                             
    Элементы.КонтейнерыТипОперацииНаТерминалеСдачи.СписокВыбора.Добавить(Перечисления.ТипОперацииНаТерминале.СдачаПорожнегоКТК);
    Элементы.КонтейнерыТипОперацииНаТерминалеСдачи.СписокВыбора.Добавить(Перечисления.ТипОперацииНаТерминале.СдачаГруженогоКТК);
	
	ТипыЛокаций.Добавить(Справочники.ТипыЛокаций.Терминал);
	ТипыЛокаций.Добавить(Справочники.ТипыЛокаций.Порт);
	ТипыЛокаций.Добавить(Справочники.ТипыЛокаций.СтанцияЖД);
	
	//Евросиб Коханенко Н.А. 04.10.2023 (( US 75549 TA 75773 
	Элементы.ДополнительныеАдресаКлиентаТипОперацииНаСкладеКлиента.РежимВыбораИзСписка = Истина;                             
    Элементы.ДополнительныеАдресаКлиентаТипОперацииНаСкладеКлиента.СписокВыбора.Добавить(Перечисления.ТипОперацииНаТерминале.ЗагрузкаПорожнегоКТК);
    Элементы.ДополнительныеАдресаКлиентаТипОперацииНаСкладеКлиента.СписокВыбора.Добавить(Перечисления.ТипОперацииНаТерминале.РазгрузкаГруженогоКТК);
	//Евросиб Коханенко Н.А. 04.10.2023 )) US 75549 TA 75773 
	
КонецПроцедуры	

&НаКлиенте
Процедура ПроверитьСоответствиеВесаДетализацииПоГрузу(Отказ)
	СтруктураОтбора = Новый Структура("Груз",ПредопределенноеЗначение("Справочник.Грузы.СборнаяКонтейнернаяОтправка"));
	
	НайденныеСтроки = Объект.Контейнеры.НайтиСтроки(СтруктураОтбора);
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		Если НайденнаяСтрока.СтатусЗапросаНаАвтоперевозку = ПредопределенноеЗначение("Перечисление.СтатусЗапросаНаПеревозку.Отменен") Тогда
			Продолжить;
		КонецЕсли;
		
		ВесГрузаНетто  = НайденнаяСтрока.ВесГрузаНетто;
		КоличествоМест = НайденнаяСтрока.КоличествоМест;
		
		//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 начало
		//СтруктураОтбораДГ = Новый Структура("ГУИДСтроки",НайденнаяСтрока.ИдентификаторСтрокиТЧ);
		//НайденыеСтрокиДГ = Объект.ДетализацияПоГрузу.НайтиСтроки(СтруктураОтбораДГ);
		
		СтруктураОтбораДГ = Новый Структура("Ключ",НайденнаяСтрока.КлючАналитикиПеревозки);
		НайденыеСтрокиДГ = ДетализацияПоГрузу.НайтиСтроки(СтруктураОтбораДГ);
		//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 конец
		
		ВесГруза 		= 0;
		КоличествоМестД  = 0;
		
		Для Каждого СтрокаДГ Из НайденыеСтрокиДГ Цикл
			ВесГруза = ВесГруза + СтрокаДГ.ВесГруза;
			КоличествоМестД = КоличествоМестД + СтрокаДГ.КоличествоМест;
		КонецЦикла;	
		
		Если ВесГрузаНетто <> ВесГруза Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Несоответствие общего веса груза в строке %1 с суммой значений веса в таблице Детализация по грузу",НайденнаяСтрока.НомерСтроки));
		КонецЕсли;
		
		Если КоличествоМест <> КоличествоМестД Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Несоответствие количества мест груза в строке %1 с суммой значений количества мест в таблице Детализация по грузу",НайденнаяСтрока.НомерСтроки));
		КонецЕсли;
		
	КонецЦикла;   
	
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Начало: 18.12.2023
	// если поле Груз не заполнено, тогда отказ! (проверка из процедуры ОбработкаПроверкиЗаполнения)  
	СтатусыНепроверяемыхСтрок = Новый Массив;
	СтатусыНепроверяемыхСтрок.Добавить(ПредопределенноеЗначение("Перечисление.СтатусЗапросаНаПеревозку.Отменен"));
	СтатусыНепроверяемыхСтрок.Добавить(ПредопределенноеЗначение("Перечисление.СтатусЗапросаНаПеревозку.Черновик"));
	
	ТекстОшибки = "Не заполнена колонка %1 в строке %2 списка ""Контейнеры""";
	
	Для каждого СтрокаТЧ Из Объект.Контейнеры Цикл   
		
		Если СтатусыНепроверяемыхСтрок.Найти(СтрокаТЧ.СтатусЗапросаНаАвтоперевозку) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;            
		
		Если не ЭтоДирекцияКонтейнерныхПеревозок() 
			//Евросиб Коханенко Н.А. 19.02.2025 (( #102955 
			И НЕ Объект.ЭтапПеревозки = ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.СредняяМиля")
			//Евросиб Коханенко Н.А. 19.02.2025 )) #102955 
			и Не ЗначениеЗаполнено(СтрокаТЧ.Груз) Тогда
			Отказ = Истина;  
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(ТекстОшибки, "Груз", СтрокаТЧ.НомерСтроки)); 
		КонецЕсли;	
	КонецЦикла;
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Конец: 18.12.2023
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьНаОснованииЗаявки(ЗаявкаПараметр)
	
	ЗаполнитьШапку(ЗаявкаПараметр);
	ЗаполнитьКонтейнеры(ЗаявкаПараметр);
	
	//БИТ Белинский Д.А. 10.04.2023 -начало
	УстановитьВидимостьПолейПоДирекцииКонтенерныхПеревозок();
	//БИТ Белинский Д.А. 10.04.2023 -конец
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьШапку(ЗаявкаПараметр)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Заявка.Ссылка КАК Заявка,
	|	Заявка.Контрагент КАК Контрагент,
	|	Заявка.Договор КАК Договор
	|ИЗ
	|	Документ.Заявка КАК Заявка
	|ГДЕ
	|	Заявка.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЗаявкаПараметр);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Объект,ВыборкаДетальныеЗаписи);
	КонецЦикла;	   
	
	// ДИТ US 81881 ТА 81882 Сержантова А.С. Начало: 01.04.2024 
	Объект.ОриентировочнаяДатаЖДРейса = Дата("00010101");
	Объект.ОриентировочнаяДатаМорскогоРейса = Дата("00010101");
	ЖДРейсИзЗаявки = НайтиРейсЗаявки(ЗаявкаПараметр); 
	МорскойРейсИзЗаявки = НайтиРейсЗаявки(ЗаявкаПараметр, Истина); 
	Объект.ОриентировочнаяДатаЖДРейса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЖДРейсИзЗаявки, "ДатаПрибытия"); 
	Объект.ОриентировочнаяДатаМорскогоРейса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(МорскойРейсИзЗаявки, "ДатаПрибытия");
	// ДИТ US 81881 ТА 81882 Сержантова А.С. Конец: 01.04.2024
	
КонецПроцедуры	    

// ДИТ US 81881 ТА 81882 Сержантова А.С. 01.04.2024
&НаСервере
Функция НайтиРейсЗаявки(ЗаявкаПараметр, Морской = Ложь)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаПереченьРейсов.Рейс КАК Рейс
		|ПОМЕСТИТЬ Вт_РейсыЗаявки
		|ИЗ
		|	Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
		|ГДЕ
		|	ЗаявкаПереченьРейсов.Ссылка = &Ссылка
		|	И ВЫБОР
		|			КОГДА &ВыбратьМорской = ИСТИНА
		|				ТОГДА ТИПЗНАЧЕНИЯ(ЗаявкаПереченьРейсов.Рейс) = ЗНАЧЕНИЕ(Справочник.РейсыМоре)
		|			ИНАЧЕ ТИПЗНАЧЕНИЯ(ЗаявкаПереченьРейсов.Рейс) = ЗНАЧЕНИЕ(Справочник.РейсыЖД)
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РейсыЖД.ДатаПрибытия КАК ДатаПрибытия,
		|	РейсыЖД.Ссылка КАК Рейс
		|ИЗ
		|	Вт_РейсыЗаявки КАК Вт_РейсыЗаявки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РейсыЖД КАК РейсыЖД
		|		ПО Вт_РейсыЗаявки.Рейс = РейсыЖД.Ссылка
		|ГДЕ
		|	НЕ РейсыЖД.РейсОтменен
		|	И НЕ РейсыЖД.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РейсыМоре.ДатаПрибытия,
		|	РейсыМоре.Ссылка
		|ИЗ
		|	Вт_РейсыЗаявки КАК Вт_РейсыЗаявки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РейсыМоре КАК РейсыМоре
		|		ПО Вт_РейсыЗаявки.Рейс = РейсыМоре.Ссылка
		|ГДЕ
		|	НЕ РейсыМоре.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПрибытия";
	
	Запрос.УстановитьПараметр("ВыбратьМорской", Морской);
	Запрос.УстановитьПараметр("Ссылка", ЗаявкаПараметр);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Рейс = Справочники.РейсыЖД.ПустаяСсылка();
	Если не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Рейс = Выборка.Рейс;
	КонецЕсли; 
	
	Возврат Рейс;

КонецФункции 

&НаСервере
Процедура ЗаполнитьКонтейнеры(ЗаявкаПараметр)
	
	КоличествоНеДобавленных = 0;
	
	СтруктураОтвет       = ПолучитьТаблицуЗапросыНаКТК(ЗаявкаПараметр);	
	СтруктураОтветУслуги = ПолучитьТаблицуУслуг(ЗаявкаПараметр);
 
	ПараметрыФункции = Новый Структура("ТаблицаЗапросыНаКТК,ТаблицаУслуг,ТаблицаОбщееКоличествоКонтВРелизе"
									,СтруктураОтвет.ТаблицаЗапросыНаКТК
									,СтруктураОтветУслуги.ТаблицаУслуг
									,СтруктураОтвет.ТЗКоличествоКонтейнеровВРелизахСУчетомЗапросов);
	
	ИтоговаяТаблица      = ПолучитьИтоговуюТаблицу(ПараметрыФункции,КоличествоНеДобавленных);	
	
	ТаблицаРелизов = ИтоговаяТаблица.Скопировать(,"Релиз");
	ТаблицаРелизов.Колонки.Добавить("Ключ");
	ТаблицаРелизов.Колонки.Добавить("Обработан");
	ТаблицаКлючейПоЗапросамИзГуидов = ИтоговаяТаблица.Скопировать(,"ИдентификаторСтрокиЗапроса");
	ТаблицаКлючейПоЗапросамИзГуидов.Колонки.Добавить("Ключ");
	ТаблицаКлючейПоЗапросамИзГуидов.Колонки.Добавить("Обработан");
	
	ПолучитьКлючиПоРелизам(ТаблицаРелизов);
	ПолучитьКлючиПоСозданнымЗапросам(ТаблицаКлючейПоЗапросамИзГуидов);
	
	//БИТ Белинский Д.А. 14.04.2023 -начало
	КонтрагентДирекцияКонтейнерныхПеревозок = Ложь;
	Если ЭтоДирекцияКонтейнерныхПеревозок() Тогда 
		КонтрагентДирекцияКонтейнерныхПеревозок = Истина;
		ВыбранКонтрагентДирекцияКонтейнерныхПеревозок = Истина;
	КонецЕсли;
	//БИТ Белинский Д.А. 14.04.2023 -конец 
	
	//Евросиб Коханенко Н.А. 07.02.2024 (( #80805 
	УстановитьЗначенияТиповОперацийНаТерминалеПоУмолчанию();
	//Евросиб Коханенко Н.А. 07.02.2024 )) #80805 
	
	// ДИТ US 81881 ТА 81882 Сержантова А.С. Начало: 02.04.2024 - в ТЧ контейнеров заполняем Терминал выдачи и Дату и время подачи КТК из рейса 
	ЗаполнитьРеквизитыТЧКонтейнеровПоРейсу(ИтоговаяТаблица, ЗаявкаПараметр);
	// ДИТ US 81881 ТА 81882 Сержантова А.С. Конец: 02.04.2024
	
	Для Каждого СтрокаИтог Из ИтоговаяТаблица Цикл
		НовСтрока = Объект.Контейнеры.Добавить(); 
		ЗаполнитьЗначенияСвойств(НовСтрока,СтрокаИтог);
		
		//Евросиб Коханенко Н.А. 07.02.2024 (( #80805
		Если НЕ НовСтрока.НеТребуетсяТерминалВыдачи Тогда
			НовСтрока.ТипОперацииНаТерминалеВыдачи = ТипОперацииНаТерминалеВыдачиПоУмолчанию;
		КонецЕсли;
		Если НЕ НовСтрока.НеТребуетсяАдрес Тогда
			НовСтрока.ТипОперацииНаСкладеКлиента = ТипОперацииНаСкладеКлиентаПоУмолчанию;
		КонецЕсли;
		Если НЕ НовСтрока.НеТребуетсяТерминалСдачи Тогда
			НовСтрока.ТипОперацииНаТерминалеСдачи = ТипОперацииНаТерминалеСдачиПоУмолчанию;
		КонецЕсли;
		//Евросиб Коханенко Н.А. 07.02.2024 )) #80805 
		
		//БИТ Белинский Д.А. 14.04.2023 -начало
		Если КонтрагентДирекцияКонтейнерныхПеревозок Тогда
			НовСтрока.НеТребуетсяАдрес = Истина;
			НовСтрока.ТипОперацииНаТерминалеВыдачи = Перечисления.ТипОперацииНаТерминале.ПриемПорожнегоКТК;
			НовСтрока.ТипОперацииНаТерминалеСдачи = Перечисления.ТипОперацииНаТерминале.СдачаПорожнегоКТК;
		КонецЕсли;
		//БИТ Белинский Д.А. 14.04.2023 -конец 
		//ДИТ Шевченко А.В. US 62421 TA 65316 17.02.23
		Если НЕ ЗначениеЗаполнено(СтрокаИтог.КлючАналитикиПеревозки) И ЗначениеЗаполнено(СтрокаИтог.Релиз) Тогда
			СтруктураОтбора = Новый Структура("Обработан,Релиз",Ложь,СтрокаИтог.Релиз);
			СтрокиРелизыКлючи = ТаблицаРелизов.НайтиСтроки(СтруктураОтбора);
			Если СтрокиРелизыКлючи.Количество() > 0 Тогда
				НовСтрока.КлючАналитикиПеревозки = СтрокиРелизыКлючи[0].Ключ;  
				СтрокиРелизыКлючи[0].Обработан = Истина; 
			КонецЕсли;
		// ДИТ BUG 77633 Сержантова А.С. Начало: 23.11.2023
		ИначеЕсли ЗначениеЗаполнено(СтрокаИтог.КлючАналитикиПеревозки) И ЗначениеЗаполнено(СтрокаИтог.Релиз) Тогда 
			СтруктураОтбораСКлючом = Новый Структура("Обработан,Релиз,Ключ",Ложь,СтрокаИтог.Релиз, НовСтрока.КлючАналитикиПеревозки);
			СтрокиРелизовПоКлючу = ТаблицаРелизов.НайтиСтроки(СтруктураОтбораСКлючом); 
			Если СтрокиРелизовПоКлючу.Количество() Тогда
				СтрокиРелизовПоКлючу[0].Обработан = Истина; 		
			КонецЕсли;	
		// ДИТ BUG 77633 Сержантова А.С. Конец: 23.11.2023
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(СтрокаИтог.КлючАналитикиПеревозки) И НЕ ЗначениеЗаполнено(СтрокаИтог.Релиз) Тогда
			
			СтруктураОтбора = Новый Структура("Обработан,ИдентификаторСтрокиЗапроса",Ложь,СтрокаИтог.ИдентификаторСтрокиЗапроса);
			СтрокиЗапросыКлючи = ТаблицаКлючейПоЗапросамИзГуидов.НайтиСтроки(СтруктураОтбора);
			Если СтрокиЗапросыКлючи.Количество() > 0 Тогда
				НовСтрока.КлючАналитикиПеревозки = СтрокиЗапросыКлючи[0].Ключ;
				СтрокиЗапросыКлючи[0].Обработан = Истина;
			Иначе
				СтруктураКлюча  = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
				СтруктураКлюча.Вставить("Заявка",Объект.Заявка);
				Ответ = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлюча);
				НовСтрока.КлючАналитикиПеревозки = Ответ.КлючАналитикиПеревозки;
				НовСтрока.ВерсияКлюча = Ответ.ВерсияДанных;
			КонецЕсли;
		// ДИТ BUG 77633 Сержантова А.С. Начало: 23.11.2023
		ИначеЕсли ЗначениеЗаполнено(СтрокаИтог.КлючАналитикиПеревозки) И не ЗначениеЗаполнено(СтрокаИтог.Релиз) Тогда 
			СтруктураОтбораСКлючом = Новый Структура("Обработан,ИдентификаторСтрокиЗапроса,Ключ",
									Ложь,СтрокаИтог.ИдентификаторСтрокиЗапроса, НовСтрока.КлючАналитикиПеревозки);
			СтрокиРелизовПоКлючу = ТаблицаКлючейПоЗапросамИзГуидов.НайтиСтроки(СтруктураОтбораСКлючом); 
			Если СтрокиРелизовПоКлючу.Количество() Тогда
				СтрокиРелизовПоКлючу[0].Обработан = Истина; 		
			КонецЕсли;	
		// ДИТ BUG 77633 Сержантова А.С. Конец: 23.11.2023
		КонецЕсли;
		//ДИТ Шевченко А.В. US 62421 TA 65316 17.02.23
		НовСтрока.ИдентификаторСтрокиТЧ = Новый УникальныйИдентификатор();
		НовСтрока.ИдентификаторСтрокиТабличнойЧасти = НовСтрока.ПолучитьИдентификатор();
	КонецЦикла;	
	
	//ЗаполнитьДетализациюПоГрузу(ИтоговаяТаблица.ВыгрузитьКолонку("ИдентификаторСтрокиУслуги"),ЗаявкаПараметр);
	
	Для Каждого СтрокаСообщение Из СтруктураОтвет.ТЗКоличествоКонтейнеровВДругихРелизах Цикл     
		//Евросиб Коханенко Н.А. 14.06.2024 (( #83866
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("в заявке: %1 есть %2 КТК из текущего запроса на КТК",
														СтрокаСообщение.Заявка, 
														СтрокаСообщение.КоличествоКонтейнеров));
		//Евросиб Коханенко Н.А. 14.06.2024 )) #83866 
	КонецЦикла;	
	
	Если КоличествоНеДобавленных > 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("В запрос на автоперевозку добавлено максимально возможное количество строк из связанного с запросом на КТК релиза клиента");
	КонецЕсли;	
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -начало
	ЗаполнитьТаблицуПоКлючамАналитики();
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -конец
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьНомерДатуЗаказаНаТС();
	КонецЕсли;
КонецПроцедуры	

// ДИТ US 81881 ТА 81882 Сержантова А.С. 02.04.2024
&НаСервере
Процедура ЗаполнитьРеквизитыТЧКонтейнеровПоРейсу(ИтоговаяТаблица, ЗаявкаПараметр)
	
	Для каждого СтрокаИтога Из ИтоговаяТаблица Цикл      
		//оставляем заполненными только данные из релизов
		Если не ЗначениеЗаполнено(СтрокаИтога.ТерминалВыдачиКТКДоУслуги) Тогда
			СтрокаИтога.ТерминалВыдачи = Справочники.Локации.ПустаяСсылка();	
	    КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		// Евросиб(ДИТ) ТА 86904 Сержантова А.С. Начало: 17.06.2024
		// Было:
		//"ВЫБРАТЬ
		//|	ВЫРАЗИТЬ(Контейнеры.Контейнер КАК Справочник.ТЕ) КАК Контейнер
		//|ПОМЕСТИТЬ ВТ_Контейнеры
		//|ИЗ
		//|	&ИтоговаяТаблица КАК Контейнеры
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////  
		// Евросиб(ДИТ) ТА 86904 Сержантова А.С. Конец: 17.06.2024
		"ВЫБРАТЬ
		|	ЗаявкаПереченьРейсов.Рейс КАК Рейс
		|ПОМЕСТИТЬ Вт_РейсыЗаявки
		|ИЗ
		|	Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
		|ГДЕ
		|	ЗаявкаПереченьРейсов.Ссылка = &Заявка
		|	И ТИПЗНАЧЕНИЯ(ЗаявкаПереченьРейсов.Рейс) = ЗНАЧЕНИЕ(Справочник.РейсыМоре)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаявкаПереченьРейсов.Рейс
		|ИЗ
		|	Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
		|ГДЕ
		|	ЗаявкаПереченьРейсов.Ссылка = &Заявка
		|	И ТИПЗНАЧЕНИЯ(ЗаявкаПереченьРейсов.Рейс) = ЗНАЧЕНИЕ(Справочник.РейсыЖД)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РейсыМоре.ДатаПрибытия КАК ДатаПрибытия,
		|	РейсыМоре.Ссылка КАК Ссылка,
		|	РейсыМоре.ПунктНазначения КАК ПунктНазначения,
		// Евросиб(ДИТ) ТА 86904 Сержантова А.С. Начало: 17.06.2024
		// Было:
		//|	ТранспортныйДокументКоносаменты.НомерКТК КАК НомерКТК,  
		// Евросиб(ДИТ) ТА 86904 Сержантова А.С. Конец: 17.06.2024
		|	2 КАК Приоритет
		|ПОМЕСТИТЬ ВТ_ДанныеРейсов
		|ИЗ
		|	Вт_РейсыЗаявки КАК Вт_РейсыЗаявки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РейсыМоре КАК РейсыМоре
		|		ПО Вт_РейсыЗаявки.Рейс = РейсыМоре.Ссылка      
		// Евросиб(ДИТ) ТА 86904 Сержантова А.С. Начало: 17.06.2024
		// Было:
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент КАК ТранспортныйДокумент  
		//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент.Коносаменты КАК ТранспортныйДокументКоносаменты
		//|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Контейнеры КАК ВТ_Контейнеры
		//|				ПО (ВТ_Контейнеры.Контейнер = ТранспортныйДокументКоносаменты.НомерКТК)
		//|			ПО (ТранспортныйДокументКоносаменты.Ссылка = ТранспортныйДокумент.Ссылка) 
		//|		ПО Вт_РейсыЗаявки.Рейс = ТранспортныйДокумент.МорскойРейс
		//|			И (ТранспортныйДокумент.Проведен) 
		// Евросиб(ДИТ) ТА 86904 Сержантова А.С. Конец: 17.06.2024
		|ГДЕ
		|	НЕ РейсыМоре.ПометкаУдаления 
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РейсыЖД.ДатаПрибытия,
		|	Вт_РейсыЗаявки.Рейс,
		|	РейсыЖД.ПунктНазначения,
		// Евросиб(ДИТ) ТА 86904 Сержантова А.С. Начало: 17.06.2024
		// Было:
		//|	ВТ_Контейнеры.Контейнер,
		// Евросиб(ДИТ) ТА 86904 Сержантова А.С. Конец: 17.06.2024
		|	1
		|ИЗ
		|	Вт_РейсыЗаявки КАК Вт_РейсыЗаявки  
		// Евросиб(ДИТ) ТА 86904 Сержантова А.С. Начало: 17.06.2024
		// Было:
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РейсыЖД.ФактическийСоставПоезда КАК РейсыЖДФактическийСоставПоезда  
		//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Контейнеры КАК ВТ_Контейнеры
		//|			ПО (ВТ_Контейнеры.Контейнер.Наименование = РейсыЖДФактическийСоставПоезда.НомерКонтейнера) 
		//|		ПО Вт_РейсыЗаявки.Рейс = РейсыЖДФактическийСоставПоезда.Ссылка
		// Стало:
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РейсыЖД КАК РейсыЖД
		|		ПО (Вт_РейсыЗаявки.Рейс = РейсыЖД.Ссылка)
		// Евросиб(ДИТ) ТА 86904 Сержантова А.С. Конец: 17.06.2024
		|ГДЕ
		|	НЕ РейсыЖД.РейсОтменен
		|	И НЕ РейсыЖД.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеРейсов.Приоритет КАК Приоритет,
		// Евросиб(ДИТ) ТА 86904 Сержантова А.С. Начало: 17.06.2024
		// Было:
		//|	ВТ_ДанныеРейсов.НомерКТК КАК НомерКТК, 
		// Евросиб(ДИТ) ТА 86904 Сержантова А.С. Конец: 17.06.2024
		|	ВТ_ДанныеРейсов.Ссылка КАК Рейс,
		|	ВТ_ДанныеРейсов.ДатаПрибытия КАК ДатаПрибытия,
		|	ВЫБОР
		|		КОГДА ВТ_ДанныеРейсов.ПунктНазначения.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.СтанцияЖД)
		|			ТОГДА ЕСТЬNULL(ГоризонтальныеСвязиСтанцийЖД.Терминал, ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка))
		|		КОГДА ВТ_ДанныеРейсов.ПунктНазначения.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Порт)
		|			ТОГДА ЕСТЬNULL(ГоризонтальныеСвязиПорта.Терминал, ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка))
		|		ИНАЧЕ ВТ_ДанныеРейсов.ПунктНазначения
		|	КОНЕЦ КАК ПунктНазначения
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	ВТ_ДанныеРейсов КАК ВТ_ДанныеРейсов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГоризонтальныеСвязиЛокаций КАК ГоризонтальныеСвязиСтанцийЖД
		|		ПО (ГоризонтальныеСвязиСтанцийЖД.ЖДСтанция = ВТ_ДанныеРейсов.ПунктНазначения)
		|			И (НЕ ГоризонтальныеСвязиСтанцийЖД.Терминал.ПометкаУдаления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГоризонтальныеСвязиЛокаций КАК ГоризонтальныеСвязиПорта
		|		ПО (ГоризонтальныеСвязиПорта.Порт = ВТ_ДанныеРейсов.ПунктНазначения)
		|			И (НЕ ГоризонтальныеСвязиПорта.Терминал.ПометкаУдаления)
		|; 
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ  
		// Евросиб(ДИТ) ТА 86904 Сержантова А.С. Начало: 17.06.2024
		// Было:
		//|	ВТ_Итог.НомерКТК КАК НомерКТК, 
		// Евросиб(ДИТ) ТА 86904 Сержантова А.С. Конец: 17.06.2024
		|	ВТ_Итог.Рейс КАК Рейс,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Итог.ПунктНазначения) КАК КоличествоТерминалов
		|ПОМЕСТИТЬ Вт_ПосчетКоличестваТерминалов
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|
		|СГРУППИРОВАТЬ ПО  
		// Евросиб(ДИТ) ТА 86904 Сержантова А.С. Начало: 17.06.2024
		// Было:
		//|	ВТ_Итог.НомерКТК, 
		// Евросиб(ДИТ) ТА 86904 Сержантова А.С. Конец: 17.06.2024
		|	ВТ_Итог.Рейс
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		// Евросиб(ДИТ) ТА 86904 Сержантова А.С. Начало: 17.06.2024
		// Было:
		//|	Вт_ПосчетКоличестваТерминалов.НомерКТК КАК Контейнер,  
		// Евросиб(ДИТ) ТА 86904 Сержантова А.С. Конец: 17.06.2024
		|	ВТ_Итог.ПунктНазначения КАК ТерминалВыдачи,
		|	ВТ_Итог.Рейс КАК Рейс
		|ИЗ
		|	Вт_ПосчетКоличестваТерминалов КАК Вт_ПосчетКоличестваТерминалов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Итог КАК ВТ_Итог   
		// Евросиб(ДИТ) ТА 86904 Сержантова А.С. Начало: 17.06.2024
		// Было:
		//|		ПО (ВТ_Итог.НомерКТК = Вт_ПосчетКоличестваТерминалов.НомерКТК)
		//|			И Вт_ПосчетКоличестваТерминалов.Рейс = ВТ_Итог.Рейс 
		// Стало:
		|		ПО Вт_ПосчетКоличестваТерминалов.Рейс = ВТ_Итог.Рейс
		// Евросиб(ДИТ) ТА 86904 Сержантова А.С. Конец: 17.06.2024
		|ГДЕ
		|	Вт_ПосчетКоличестваТерминалов.КоличествоТерминалов > 1
		|; 
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Итог.Приоритет КАК Приоритет,
		// Евросиб(ДИТ) ТА 86904 Сержантова А.С. Начало: 17.06.2024
		// Было:
		//|	ВТ_Итог.НомерКТК КАК НомерКТК, 
		// Евросиб(ДИТ) ТА 86904 Сержантова А.С. Конец: 17.06.2024
		|	ВТ_Итог.Рейс КАК Рейс,
		|	ВТ_Итог.ДатаПрибытия КАК ДатаПрибытия,
		|	ВТ_Итог.ПунктНазначения КАК ПунктНазначения
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &МиляЗаявки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.ПерваяМиля)
		|				ТОГДА ВТ_Итог.Приоритет = 2   
		// Евросиб(ДИТ) US 88359 ТА 88360 Сержантова А.С. Начало: 16.07.2024
		// По последней миле с видом перевозки "Морской импорт" не выбираем морские рейсы, только ЖД
		|			КОГДА &МиляЗаявки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.ПоследняяМиля) 
		|				И &ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ИмпортМоре)
		|				ТОГДА ВТ_Итог.Приоритет = 1  
		// Евросиб(ДИТ) US 88359 ТА 88360 Сержантова А.С. Конец: 16.07.2024
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет,
		|	ДатаПрибытия";
		// Евросиб(ДИТ) ТА 86904 Сержантова А.С. Начало: 17.06.2024
		// Было:
		//|ИТОГИ ПО
		//|	НомерКТК";   
		// Евросиб(ДИТ) ТА 86904 Сержантова А.С. Конец: 17.06.2024
	// Евросиб(ДИТ) ТА 86904 Сержантова А.С. Начало: 17.06.2024
	// Было:
	//Запрос.УстановитьПараметр("ИтоговаяТаблица", ИтоговаяТаблица); 
	// Евросиб(ДИТ) ТА 86904 Сержантова А.С. Конец: 17.06.2024
	Запрос.УстановитьПараметр("Заявка", ЗаявкаПараметр); 
	Запрос.УстановитьПараметр("МиляЗаявки", Объект.ЭтапПеревозки);
	// если это первая миля, то берем значения из морского рейса 
	 
	// Евросиб(ДИТ) US 88359 ТА 88360 Сержантова А.С. Начало: 16.07.2024
    ВидПеревозкиЗаявки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаявкаПараметр, "Видперевозки");
	Запрос.УстановитьПараметр("ВидПеревозки", ВидПеревозкиЗаявки);
	// Евросиб(ДИТ) US 88359 ТА 88360 Сержантова А.С. Конец: 16.07.2024
	
	//таблица для вопроса пользователю - выбор терминалов выдачи
	СписокДублейТерминаловИзРейса.Очистить();
	
	РезультатЗапроса = Запрос.ВыполнитьПакет(); 
	РезультатДанныеРейсов = РезультатЗапроса[5]; 
	РезультатДублиПунктовНазначения = РезультатЗапроса[4].Выбрать(); 
	Если не РезультатДанныеРейсов.Пустой() Тогда   
		// Евросиб(ДИТ) ТА 86904 Сержантова А.С. Начало: 17.06.2024
		// Было:
		//ВыборкаКТК = РезультатДанныеРейсов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		//Пока ВыборкаКТК.Следующий() Цикл 
		//	СтруктураПоискаСтроки = Новый Структура("Контейнер", ВыборкаКТК.НомерКТК);
		//	СтрокиВТаб = ИтоговаяТаблица.НайтиСтроки(СтруктураПоискаСтроки);
		//	ДанныеРейсовПоКТК = ВыборкаКТК.Выбрать();
		//	Если ДанныеРейсовПоКТК.Следующий() Тогда   
		//		// по первой миле Терминал выдачи грузится из релиза, если он есть
		//		Если Объект.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля
		//			и ЗначениеЗаполнено(СтрокиВТаб[0].ТерминалВыдачиКТКДоУслуги) Тогда
		//		    //пропускаем заполнение даты подачи КТК
		//		Иначе	
		//			СтрокиВТаб[0].ДатаВремяПодачиКТК = ДанныеРейсовПоКТК.ДатаПрибытия;
		//		КонецЕсли;
		//		Если не ЗначениеЗаполнено(СтрокиВТаб[0].ТерминалВыдачиКТКДоУслуги) Тогда
		//			СтрокиВТаб[0].ТерминалВыдачи = ДанныеРейсовПоКТК.ПунктНазначения;         
		//			
		//			//Если по контейнеру есть дубли терминала выдачи, то сохраним в СписокДублейТерминаловИзРейса для вопроса пользователю
		//			СтруктураПоискаСтроки.Вставить("ТерминалВыдачи", СтрокиВТаб[0].ТерминалВыдачи); 
		//			Если РезультатДублиПунктовНазначения.НайтиСледующий(СтруктураПоискаСтроки) Тогда 
		//				РезультатДублиПунктовНазначения.Сбросить();
		//				СтруктураПоискаСтроки.Удалить("ТерминалВыдачи"); 
		//				СтруктураПоискаСтроки.Вставить("Рейс", ДанныеРейсовПоКТК.Рейс);
		//				Пока РезультатДублиПунктовНазначения.НайтиСледующий(СтруктураПоискаСтроки) Цикл
		//					НС = СписокДублейТерминаловИзРейса.Добавить();
		//					ЗаполнитьЗначенияСвойств(НС, РезультатДублиПунктовНазначения);
		//				КонецЦикла;  
		//				РезультатДублиПунктовНазначения.Сбросить();
		//			КонецЕсли;
		//		КонецЕсли;
		//	КонецЕсли;  
		//КонецЦикла;
		//Стало:
		ВыборкаРейса = РезультатДанныеРейсов.Выбрать();
		ВыборкаРейса.Следующий();   
		Для каждого СтрокаИтога Из ИтоговаяТаблица Цикл 
			// по первой миле Терминал выдачи грузится из релиза, если он есть
			Если Объект.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля
				и ЗначениеЗаполнено(СтрокаИтога.ТерминалВыдачиКТКДоУслуги) Тогда
				//пропускаем заполнение даты подачи КТК
			Иначе	
				СтрокаИтога.ДатаВремяПодачиКТК = ВыборкаРейса.ДатаПрибытия;
			КонецЕсли;
			Если не ЗначениеЗаполнено(СтрокаИтога.ТерминалВыдачиКТКДоУслуги) Тогда
				СтрокаИтога.ТерминалВыдачи = ВыборкаРейса.ПунктНазначения;      
				
				//Если по рейсу есть дубли терминала выдачи, то сохраним в СписокДублейТерминаловИзРейса для вопроса пользователю
				СтруктураПоискаСтроки = Новый Структура;
				СтруктураПоискаСтроки.Вставить("ТерминалВыдачи", СтрокаИтога.ТерминалВыдачи); 
				Если РезультатДублиПунктовНазначения.НайтиСледующий(СтруктураПоискаСтроки) Тогда 
					РезультатДублиПунктовНазначения.Сбросить();
					СтруктураПоискаСтроки.Удалить("ТерминалВыдачи"); 
					СтруктураПоискаСтроки.Вставить("Рейс", ВыборкаРейса.Рейс);
					Пока РезультатДублиПунктовНазначения.НайтиСледующий(СтруктураПоискаСтроки)
						и СписокДублейТерминаловИзРейса.НайтиПоЗначению(РезультатДублиПунктовНазначения.ТерминалВыдачи) = Неопределено Цикл
						СписокДублейТерминаловИзРейса.Добавить(РезультатДублиПунктовНазначения.ТерминалВыдачи);
					КонецЦикла;  
					РезультатДублиПунктовНазначения.Сбросить();
				КонецЕсли;
		    КонецЕсли;
		КонецЦикла;
		// Евросиб(ДИТ) ТА 86904 Сержантова А.С. Конец: 17.06.2024
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьКлючиПоСозданнымЗапросам(ТаблицаКлючейПоЗапросамИзГуидов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаЗапросов.ИдентификаторСтрокиЗапроса КАК ИдентификаторСтрокиЗапроса
		|ПОМЕСТИТЬ ВТ_ТаблицаГуид
		|ИЗ
		|	&ТаблицаКлючейПоЗапросамИзГуидов КАК ТаблицаЗапросов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ТаблицаГуид.ИдентификаторСтрокиЗапроса КАК ИдентификаторСтрокиЗапроса,
		|	ЗапросНаАвтоКонтейнеры.КлючАналитикиПеревозки КАК Ключ,
		|	ЛОЖЬ КАК Обработан
		|ИЗ
		|	ВТ_ТаблицаГуид КАК ВТ_ТаблицаГуид
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоКонтейнеры
		|		ПО ВТ_ТаблицаГуид.ИдентификаторСтрокиЗапроса = ЗапросНаАвтоКонтейнеры.ИдентификаторСтрокиЗапроса
		|			И (НЕ ЗапросНаАвтоКонтейнеры.Ссылка.ПометкаУдаления)
		|ГДЕ
		|	ЗапросНаАвтоКонтейнеры.КлючАналитикиПеревозки <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиПеревозки.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ТаблицаКлючейПоЗапросамИзГуидов",ТаблицаКлючейПоЗапросамИзГуидов);
	
	ТаблицаКлючейПоЗапросамИзГуидов = Запрос.Выполнить().Выгрузить();	
	
КонецПроцедуры	

&НаСервере
Процедура ПолучитьКлючиПоРелизам(ТаблицаРелизов)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаРелизов.Релиз КАК Релиз
		|ПОМЕСТИТЬ ВТ_ТаблицаРелизов
		|ИЗ
		|	&ТаблицаРелизов КАК ТаблицаРелизов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ТаблицаРелизов.Релиз КАК Релиз,
		|	РелизКлиентаКонтейнеры.КлючАналитикиПеревозки КАК Ключ,
		|	ЛОЖЬ КАК Обработан
		|ИЗ
		|	ВТ_ТаблицаРелизов КАК ВТ_ТаблицаРелизов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизКлиента.Контейнеры КАК РелизКлиентаКонтейнеры
		|		ПО ВТ_ТаблицаРелизов.Релиз = РелизКлиентаКонтейнеры.Ссылка
		|ГДЕ
		|	РелизКлиентаКонтейнеры.КлючАналитикиПеревозки <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиПеревозки.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ТаблицаРелизов",ТаблицаРелизов);
	
	ТаблицаРелизов = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьДетализациюПоГрузу(МассивКлючей,ЗаявкаПараметр)
	//ДИТ Шевченко А.В. US 62421 TA 64345 20.01.23 -начало	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ЗаявкаДетализацияПоГрузу.ГУИДСтроки КАК ГУИДСтроки,
	//	|	ЗаявкаДетализацияПоГрузу.Груз КАК Груз,
	//	|	ЗаявкаДетализацияПоГрузу.КоличествоМест КАК КоличествоМест,
	//	|	ЗаявкаДетализацияПоГрузу.ВесГруза КАК ВесГруза,
	//	|	ЗаявкаДетализацияПоГрузу.РодУпаковки КАК РодУпаковки
	//	|ИЗ
	//	|	Документ.Заявка.ДетализацияПоГрузу КАК ЗаявкаДетализацияПоГрузу
	//	|ГДЕ
	//	|	ЗаявкаДетализацияПоГрузу.ГУИДСтроки В(&ГУИДСтроки)
	//	|	И ЗаявкаДетализацияПоГрузу.Ссылка = &Ссылка
	//	|ИТОГИ ПО
	//	|	ГУИДСтроки";
	//
	//Запрос.УстановитьПараметр("ГУИДСтроки", МассивГуидов);
	//Запрос.УстановитьПараметр("Ссылка", ЗаявкаПараметр);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаГУИДСтроки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//
	//Пока ВыборкаГУИДСтроки.Следующий() Цикл
	//	
	//	СтруктураПоиска = Новый Структура;
	//	СтруктураПоиска.Вставить("ИдентификаторСтрокиУслуги",ВыборкаГУИДСтроки.ГУИДСтроки);
	//	НайденныеСтрокиКонтейнеров = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска);
	//	
	//	Для Каждого НайденнаяСтрокаКонтейнеры Из НайденныеСтрокиКонтейнеров Цикл
	//		СтруктураПоиска = Новый Структура;
	//		СтруктураПоиска.Вставить("ГУИДСтроки",НайденнаяСтрокаКонтейнеры.ИдентификаторСтрокиТЧ);
	//		СтрокиДляУдаления = Объект.ДетализацияПоГрузу.НайтиСтроки(СтруктураПоиска);
	//		Для Каждого СтрокаУдаления Из СтрокиДляУдаления Цикл
	//			Объект.ДетализацияПоГрузу.Удалить(СтрокаУдаления);	
	//		КонецЦикла;
	//	КонецЦикла;	
	//
	//	ВыборкаДетальныеЗаписи = ВыборкаГУИДСтроки.Выбрать();
	//    НомерСтроки = 0;
	//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//		НовСтрока = Объект.ДетализацияПоГрузу.Добавить();
	//		ЗаполнитьЗначенияСвойств(НовСтрока,ВыборкаДетальныеЗаписи);
	//		СтруктураПоиска = Новый Структура;
	//		СтруктураПоиска.Вставить("ИдентификаторСтрокиУслуги",ВыборкаГУИДСтроки.ГУИДСтроки);
	//		НайденныеСтрокиКонтейнеров = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска);
	//		Для Каждого НайденнаяСтрокаКонтейнеры Из НайденныеСтрокиКонтейнеров Цикл
	//			НовСтрока.ГУИДСтроки = НайденнаяСтрокаКонтейнеры.ИдентификаторСтрокиТЧ;
	//			НомерСтроки = НомерСтроки + 1;
	//			НовСтрока.НомерСтрокиПоГуидам = НомерСтроки;
	//		КонецЦикла;
	//	КонецЦикла;
	//КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлючиАналитикиПеревозкиДетализацияПоГрузу.Ссылка КАК Ключ,
		|	КлючиАналитикиПеревозкиДетализацияПоГрузу.Груз КАК Груз,
		|	КлючиАналитикиПеревозкиДетализацияПоГрузу.КоличествоМест КАК КоличествоМест,
		|	КлючиАналитикиПеревозкиДетализацияПоГрузу.ВесГруза КАК ВесГруза,
		|	КлючиАналитикиПеревозкиДетализацияПоГрузу.РодУпаковки КАК РодУпаковки
		|ИЗ
		|	Справочник.КлючиАналитикиПеревозки.ДетализацияПоГрузу КАК КлючиАналитикиПеревозкиДетализацияПоГрузу
		|ГДЕ
		|	КлючиАналитикиПеревозкиДетализацияПоГрузу.Ссылка В(&Ключи)
		|ИТОГИ ПО
		|	Ключ";
	
	Запрос.УстановитьПараметр("Ключи", МассивКлючей);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаГУИДСтроки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаГУИДСтроки.Следующий() Цикл
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("КлючАналитикиПеревозки",ВыборкаГУИДСтроки.Ключ);
		НайденныеСтрокиКонтейнеров = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска);
		
		Для Каждого НайденнаяСтрокаКонтейнеры Из НайденныеСтрокиКонтейнеров Цикл
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Ключ",НайденнаяСтрокаКонтейнеры.КлючАналитикиПеревозки);
			СтрокиДляУдаления = ДетализацияПоГрузу.НайтиСтроки(СтруктураПоиска);
			Для Каждого СтрокаУдаления Из СтрокиДляУдаления Цикл
				ДетализацияПоГрузу.Удалить(СтрокаУдаления);	
			КонецЦикла;
		КонецЦикла;	
	
		ВыборкаДетальныеЗаписи = ВыборкаГУИДСтроки.Выбрать();
	    НомерСтроки = 0;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НовСтрока = ДетализацияПоГрузу.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока,ВыборкаДетальныеЗаписи);
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("КлючАналитикиПеревозки",ВыборкаГУИДСтроки.Ключ);
			НайденныеСтрокиКонтейнеров = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска);
			Для Каждого НайденнаяСтрокаКонтейнеры Из НайденныеСтрокиКонтейнеров Цикл
				НовСтрока.Ключ = НайденнаяСтрокаКонтейнеры.Ключ;
				НомерСтроки = НомерСтроки + 1;
				НовСтрока.НомерСтрокиПоГуидам = НомерСтроки;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	//ДИТ Шевченко А.В. US 62421 TA 64345 20.01.23 -конец	
КонецПроцедуры	

&НаСервере
Функция ПолучитьТаблицуЗапросыНаКТК(ЗаявкаПараметр)
	
	//ДИТ Шевченко А.В. 60951 11.11.2022 //Добавил поле СтокСдачи
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.Релиз КАК Релиз,
		|	ТЗ.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_НеОтмененныеТЗ
		|ИЗ
		|	&НеОтмененныеТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РелизыКлиентовЗапросовНаКТК.РелизКлиента КАК РелизКлиента
		|ПОМЕСТИТЬ ВТ_РелизыПоЗаявке
		|ИЗ
		|	РегистрСведений.РелизыКлиентовЗапросовНаКТК КАК РелизыКлиентовЗапросовНаКТК
		|ГДЕ
		|	РелизыКлиентовЗапросовНаКТК.Заявка = &Заявка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РелизыКлиентовЗапросовНаКТК.РелизКлиента КАК РелизКлиента,
		|	СУММА(ВЫБОР
		|			КОГДА ЗапросНаАвтоперевозкуКонтейнеры.Ссылка ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК КоличествоВЗапросах,
		|	МАКСИМУМ(РелизыКлиентовЗапросовНаКТК.РелизКлиента.ОбщееКоличествоКТКВРелизе) КАК ОбщееКоличествоКТКВРелизе
		|ПОМЕСТИТЬ ВТ_ОбщееКолКТКСУчетомЗапросов
		|ИЗ
		|	РегистрСведений.РелизыКлиентовЗапросовНаКТК КАК РелизыКлиентовЗапросовНаКТК
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РелизыПоЗаявке КАК ВТ_РелизыПоЗаявке
		|		ПО РелизыКлиентовЗапросовНаКТК.РелизКлиента = ВТ_РелизыПоЗаявке.РелизКлиента
		|			И (РелизыКлиентовЗапросовНаКТК.РелизКлиента <> ЗНАЧЕНИЕ(Документ.РелизКлиента.ПустаяСсылка))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
		|		ПО РелизыКлиентовЗапросовНаКТК.Заявка = ЗапросНаАвтоперевозкуКонтейнеры.Ссылка.Заявка
		|			И РелизыКлиентовЗапросовНаКТК.ИдентификаторСтрокиЗаявки = ЗапросНаАвтоперевозкуКонтейнеры.ИдентификаторСтрокиЗапроса
		|			И (ЗапросНаАвтоперевозкуКонтейнеры.СтатусЗапросаНаАвтоперевозку <> ЗНАЧЕНИЕ(Перечисление.СтатусЗапросаНаПеревозку.Отменен))
		|			И РелизыКлиентовЗапросовНаКТК.РелизКлиента = ЗапросНаАвтоперевозкуКонтейнеры.Релиз
		|			И (ЗапросНаАвтоперевозкуКонтейнеры.Ссылка.ЭтапПеревозки = &ЭтапПеревозки)
		|			И (ЗапросНаАвтоперевозкуКонтейнеры.Ссылка.Проведен)
		|			И (ЗапросНаАвтоперевозкуКонтейнеры.Ссылка <> &ТекЗапрос)
		|
		|СГРУППИРОВАТЬ ПО
		|	РелизыКлиентовЗапросовНаКТК.РелизКлиента 
		// ДИТ  Сержантова А.С. US 78243 ТА 79842 Начало: 31.01.2024
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РелизыПоЗаявке.РелизКлиента КАК РелизКлиента,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаСоставУслуги.НомерСтроки) КАК КолвоВУслугах
		|ПОМЕСТИТЬ ВТ_КолвоКТКпоВариантуАвтоперевозкиВУслугах
		|ИЗ
		|	ВТ_РелизыПоЗаявке КАК ВТ_РелизыПоЗаявке
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|		ПО ВТ_РелизыПоЗаявке.РелизКлиента = ЗаявкаСоставУслуги.Релиз
		|			И ВТ_РелизыПоЗаявке.РелизКлиента.Заявка = ЗаявкаСоставУслуги.Ссылка
		|ГДЕ
		|	&МиляВУслугах = ЗНАЧЕНИЕ(Перечисление.ВариантыАвтоперевозки.СиламиЕвросиб)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_РелизыПоЗаявке.РелизКлиента
		// ДИТ  Сержантова А.С. US 78243 ТА 79842 Конец: 31.01.2024
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОбщееКолКТКСУчетомЗапросовИТекЗапроса.РелизКлиента КАК РелизКлиента,
		//|	ВТ_ОбщееКолКТКСУчетомЗапросовИТекЗапроса.КоличествоВЗапросах + ЕСТЬNULL(ВТ_НеОтмененныеТЗ.Количество, 0) КАК КоличествоВЗапросах,
		|	ВТ_ОбщееКолКТКСУчетомЗапросовИТекЗапроса.КоличествоВЗапросах КАК КоличествоВЗапросах,        
		// ДИТ  Сержантова А.С. US 78243 ТА 79842 Начало: 31.01.2024
		// Было:
		//|	ВТ_ОбщееКолКТКСУчетомЗапросовИТекЗапроса.ОбщееКоличествоКТКВРелизе КАК ОбщееКоличествоКТКВРелизе 
		//Стало:
		|	ЕстьNULL(ВТ_КолвоКТКпоВариантуАвтоперевозкиВУслугах.КолвоВУслугах, 0) КАК ОбщееКоличествоКТКВРелизе
		// ДИТ  Сержантова А.С. US 78243 ТА 79842 Конец: 31.01.2024
		|ИЗ
		|	ВТ_ОбщееКолКТКСУчетомЗапросов КАК ВТ_ОбщееКолКТКСУчетомЗапросовИТекЗапроса
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НеОтмененныеТЗ КАК ВТ_НеОтмененныеТЗ
		|		ПО ВТ_ОбщееКолКТКСУчетомЗапросовИТекЗапроса.РелизКлиента = ВТ_НеОтмененныеТЗ.Релиз 
		// ДИТ US 78243 ТА 79842 Сержантова А.С. Начало: 31.01.2024
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КолвоКТКпоВариантуАвтоперевозкиВУслугах КАК ВТ_КолвоКТКпоВариантуАвтоперевозкиВУслугах
		|		ПО (ВТ_ОбщееКолКТКСУчетомЗапросовИТекЗапроса.РелизКлиента = ВТ_КолвоКТКпоВариантуАвтоперевозкиВУслугах.РелизКлиента)
		// ДИТ US 78243 ТА 79842 Сержантова А.С. Конец: 31.01.2024
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////    
		|ВЫБРАТЬ
		|	ЗаявкаСписокЗапросНаКТК.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ЗаявкаСписокЗапросНаКТК.КоличествоКТК КАК КоличествоКТК,
		|	ЗаявкаСписокЗапросНаКТК.ТипКТК КАК ТипКТК,
		|	ЗаявкаСписокЗапросНаКТК.ЛокацияВыдачи КАК ЛокацияВыдачи,
		|	ЗаявкаСписокЗапросНаКТК.Ссылка КАК Заявка
		|ПОМЕСТИТЬ ВТ_ИдентификаторыЗапросов
		|ИЗ
		|	Документ.Заявка.СписокЗапросНаКТК КАК ЗаявкаСписокЗапросНаКТК
		|ГДЕ
		|	ЗаявкаСписокЗапросНаКТК.Ссылка = &Заявка   
		// ДИТ US 78243 ТА 79842 Сержантова А.С. Начало: 31.01.2024  //BUG 81219 ТА 81220 раскомментировать!
		|	И &Миля = ЗНАЧЕНИЕ(Перечисление.ВариантыАвтоперевозки.СиламиЕвросиб) 
		// ДИТ US 78243 ТА 79842 Сержантова А.С. Конец: 31.01.2024
		|; 
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РелизыКлиентовЗапросовНаКТК.РелизКлиента КАК РелизКлиента,
		|	РелизыКлиентовЗапросовНаКТК.Заявка КАК Заявка
		|ПОМЕСТИТЬ втРелизыКлиентов
		|ИЗ
		|	РегистрСведений.РелизыКлиентовЗапросовНаКТК КАК РелизыКлиентовЗапросовНаКТК
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИдентификаторыЗапросов КАК ВТ_ИдентификаторыЗаявок
		|		ПО РелизыКлиентовЗапросовНаКТК.ИдентификаторСтрокиЗаявки = ВТ_ИдентификаторыЗаявок.ИдентификаторСтроки
		|			И РелизыКлиентовЗапросовНаКТК.Заявка = ВТ_ИдентификаторыЗаявок.Заявка
		|ГДЕ
		|	РелизыКлиентовЗапросовНаКТК.РелизКлиента <> ЗНАЧЕНИЕ(Документ.РелизКлиента.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РелизКлиентаКонтейнеры.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	втРелизыКлиентов.РелизКлиента КАК РелизКлиента
		|ПОМЕСТИТЬ ВТ_РелизыИдентификаторыСтрок
		|ИЗ
		|	втРелизыКлиентов КАК втРелизыКлиентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизКлиента.Контейнеры КАК РелизКлиентаКонтейнеры
		|		ПО втРелизыКлиентов.РелизКлиента = РелизКлиентаКонтейнеры.Ссылка
		|ГДЕ
		|	НЕ РелизКлиентаКонтейнеры.ИдентификаторСтроки ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	РелизКлиентаКонтейнеры.ИдентификаторСтроки,
		|	втРелизыКлиентов.РелизКлиента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РелизыИдентификаторыСтрок.РелизКлиента КАК РелизКлиента,
		|	ЗаявкаСоставУслуги.Ссылка КАК Заявка,
		|	1 КАК КоличествоКонтейнеров
		|ПОМЕСТИТЬ ВТ_КоличествоКонтейнеровВЗаявках
		|ИЗ
		|	ВТ_РелизыИдентификаторыСтрок КАК ВТ_РелизыИдентификаторыСтрок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|		ПО ВТ_РелизыИдентификаторыСтрок.ИдентификаторСтроки = ЗаявкаСоставУслуги.ИдентификаторСтрокиРелизаКлиента
		|			И (ЗаявкаСоставУслуги.Ссылка <> &Заявка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КоличествоКонтейнеровВЗаявках.РелизКлиента КАК РелизКлиента,
		|	СУММА(ВТ_КоличествоКонтейнеровВЗаявках.КоличествоКонтейнеров) КАК КоличествоКонтейнеров
		|ПОМЕСТИТЬ ВТ_КоличествоКонтейнеровВДругихЗаявках
		|ИЗ
		|	ВТ_КоличествоКонтейнеровВЗаявках КАК ВТ_КоличествоКонтейнеровВЗаявках
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_КоличествоКонтейнеровВЗаявках.РелизКлиента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КоличествоКонтейнеровВЗаявках.Заявка КАК Заявка,
		|	ВТ_КоличествоКонтейнеровВЗаявках.Заявка.Номер КАК ЗаявкаНомер,
		|	СУММА(ВТ_КоличествоКонтейнеровВЗаявках.КоличествоКонтейнеров) КАК КоличествоКонтейнеров
		|ИЗ
		|	ВТ_КоличествоКонтейнеровВЗаявках КАК ВТ_КоличествоКонтейнеровВЗаявках
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_КоличествоКонтейнеровВЗаявках.Заявка,
		|	ВТ_КоличествоКонтейнеровВЗаявках.Заявка.Номер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИдентификаторыЗапросов.ИдентификаторСтроки КАК ИдентификаторСтрокиЗапроса,
		|	ВТ_ИдентификаторыЗапросов.КоличествоКТК - ЕСТЬNULL(ВТ_КоличествоКонтейнеровВДругихЗаявках.КоличествоКонтейнеров, 0) КАК КоличествоКТК,
		|	ВТ_ИдентификаторыЗапросов.ТипКТК КАК ТипКТК,     
		//ДИТ Шевченко А.В. US 62515 ТА 69551 11.05.2023 -начало
		|	ЕСТЬNULL(ВЫБОР КОГДА &ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.ПерваяМиля) ТОГДА РелизыКлиентовЗапросовНаКТК.РелизКлиента.ТерминалВыдачи ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка) КОНЕЦ, ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)) КАК ТерминалВыдачи,
		//ДИТ Шевченко А.В. US 62515 ТА 69551 11.05.2023 -конец
		|	ЕСТЬNULL(РелизыКлиентовЗапросовНаКТК.РелизКлиента.СтокСдачи, ЗНАЧЕНИЕ(Справочник.Мультилокации.ПустаяСсылка)) КАК СтокСдачи,
		|	ЕСТЬNULL(РелизыКлиентовЗапросовНаКТК.РелизКлиента, ЗНАЧЕНИЕ(Документ.РелизКлиента.ПустаяСсылка)) КАК Релиз
		|ИЗ
		|	ВТ_ИдентификаторыЗапросов КАК ВТ_ИдентификаторыЗапросов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоКонтейнеровВДругихЗаявках КАК ВТ_КоличествоКонтейнеровВДругихЗаявках
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРелизыКлиентов КАК втРелизыКлиентов
		|			ПО (втРелизыКлиентов.РелизКлиента = ВТ_КоличествоКонтейнеровВДругихЗаявках.РелизКлиента)
		|		ПО (ВТ_ИдентификаторыЗапросов.Заявка = втРелизыКлиентов.Заявка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РелизыКлиентовЗапросовНаКТК КАК РелизыКлиентовЗапросовНаКТК
		|		ПО ВТ_ИдентификаторыЗапросов.ИдентификаторСтроки = РелизыКлиентовЗапросовНаКТК.ИдентификаторСтрокиЗаявки
		|			И ВТ_ИдентификаторыЗапросов.Заявка = РелизыКлиентовЗапросовНаКТК.Заявка
		|			И (РелизыКлиентовЗапросовНаКТК.РелизКлиента <> ЗНАЧЕНИЕ(Документ.РелизКлиента.ПустаяСсылка))"; 
	
	Если Объект.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля Тогда
		// ДИТ US 78243 ТА 79842 Сержантова А.С. Начало: 31.01.2024
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&МиляВУслугах","ЗаявкаСоставУслуги.ПерваяМиля");
		// ДИТ US 78243 ТА 79842 Сержантова А.С. Конец: 31.01.2024
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Миля","ЗаявкаСписокЗапросНаКТК.Автоперевозка");
	Иначе
		// ДИТ US 78243 ТА 79842 Сержантова А.С. Начало: 31.01.2024
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&МиляВУслугах","ЗаявкаСоставУслуги.ПоследняяМиля");
		// ДИТ US 78243 ТА 79842 Сержантова А.С. Конец: 31.01.2024
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Миля","ЗаявкаСписокЗапросНаКТК.ПоследняяМиля");   
	КонецЕсли;	
	
	ТаблицаТекОтмененныхСтрокВРазрезеРелизов = Новый ТаблицаЗначений;
	ТаблицаТекОтмененныхСтрокВРазрезеРелизов.Колонки.Добавить("Релиз",Новый ОписаниеТипов("ДокументСсылка.РелизКлиента"));
	ТаблицаТекОтмененныхСтрокВРазрезеРелизов.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10)));
	
	Для Каждого СтрокаТЧ Из Объект.Контейнеры Цикл
		Если ЗначениеЗаполнено(СтрокаТч.Релиз) И СтрокаТЧ.СтатусЗапросаНаАвтоперевозку = Перечисления.СтатусЗапросаНаПеревозку.Отменен И ЗначениеЗаполнено(СтрокаТч.ИдентификаторСтрокиЗапроса) Тогда
			НовСтрока = ТаблицаТекОтмененныхСтрокВРазрезеРелизов.Добавить();
			НовСтрока.Релиз = СтрокаТч.Релиз;
			НовСтрока.Количество 		 = 1;
		КонецЕсли;	
	КонецЦикла;	
	
	ТаблицаТекОтмененныхСтрокВРазрезеРелизов.Свернуть("Релиз","Количество");
	
	Запрос.УстановитьПараметр("НеОтмененныеТЗ", ТаблицаТекОтмененныхСтрокВРазрезеРелизов);
	Запрос.УстановитьПараметр("ТекЗапрос", Объект.Ссылка);
	Запрос.УстановитьПараметр("ЭтапПеревозки", Объект.ЭтапПеревозки);
	Запрос.УстановитьПараметр("Заявка", ЗаявкаПараметр);
	
	ПакетыЗапросов = Запрос.ВыполнитьПакет();
	
	// ДИТ US 78243 ТА 79842 Сержантова А.С. 31.01.2024 сдвинула нумерацию пакетов на 1 вперед. Было 3,9,10
	ТЗКоличествоКонтейнеровВРелизахСУчетомЗапросов  = ПакетыЗапросов[4].Выгрузить();
	ТЗКоличествоКонтейнеровВДругихРелизах 			= ПакетыЗапросов[10].Выгрузить();
	РезультатЗапроса = ПакетыЗапросов[11].Выгрузить();	
	
	СтруктураОтвет = Новый Структура("ТЗКоличествоКонтейнеровВДругихРелизах,ТаблицаЗапросыНаКТК,ТЗКоличествоКонтейнеровВРелизахСУчетомЗапросов"
									,ТЗКоличествоКонтейнеровВДругихРелизах
									,РезультатЗапроса
									,ТЗКоличествоКонтейнеровВРелизахСУчетомЗапросов);
	
	Возврат СтруктураОтвет;
	
КонецФункции	

&НаСервере
Функция ПолучитьТаблицуУслуг(ЗаявкаПараметр)
	
	//ДИТ Шевченко А.В. 59945 06.10.22 убрал из запроса тч автоперевозчиков
	//ДИТ Шевченко А.В. 60951 11.11.2022 //Добавил поле СтокСдачи
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		//|	ЗаявкаСоставУслуги.НомерКТК КАК Контейнер,
		|	ЗаявкаСоставУслуги.КлючАналитикиПеревозки.Контейнер КАК Контейнер,  
		// ДИТ BUG 81219 ТА 81220 Сержантова А.С. Начало: 15.02.2024
		// Было:
		////ДИТ Шевченко А.В. US 62482 ТА 68277 17.04.2023
		//|	ЗаявкаСоставУслуги.КлючАналитикиПеревозки.Контейнер.ТипТЕ КАК ТипКТК,
		////ДИТ Шевченко А.В. US 62482 ТА 68277 17.04.2023     
		//Стало:
		|	ВЫБОР КОГДА ЗаявкаСоставУслуги.КлючАналитикиПеревозки.Контейнер <> Значение(Справочник.ТЕ.ПустаяСсылка) 
		|		ТОГДА 
		|			ЗаявкаСоставУслуги.КлючАналитикиПеревозки.Контейнер.ТипТЕ 
		|		ИНАЧЕ
		|			ЗаявкаСоставУслуги.ТипКТК
		|	КОНЕЦ КАК ТипКТК,
		// ДИТ BUG 81219 ТА 81220 Сержантова А.С. Конец: 15.02.2024
		// ДИТ BUG 77633 ТА 77634 Сержантова А.С. Начало: 24.11.2023
		|	ЗаявкаСоставУслуги.НомерСтроки КАК НомерСтроки,
		// ДИТ BUG 77633 ТА 77634 Сержантова А.С. Конец: 24.11.2023
		//|	ЗаявкаСоставУслуги.Груз КАК Груз,
		|	ЗаявкаСоставУслуги.КлючАналитикиПеревозки.Груз КАК Груз,
		|	ЗаявкаСоставУслуги.ВесГрузаНетто КАК ВесГрузаНетто,
		|	ЗаявкаСоставУслуги.КоличествоМест КАК КоличествоМест,
		|	ЗаявкаСоставУслуги.ГУИДСтроки КАК ИдентификаторСтрокиУслуги,
		|	ВЫБОР
		// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
		//Было:
		//|		КОГДА ЗаявкаСоставУслуги.ВидСобственности <> ЗНАЧЕНИЕ(Перечисление.ВариантыСобственности.Прочее)
		//Стало:
		|		КОГДА ЗаявкаСоставУслуги.ВидСобственности <> ЗНАЧЕНИЕ(Перечисление.ВариантыСобственности.Клиентский) 
		// ДИТ 65580 Давудов М.А. Конец: 23.02.2023    
		// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Начало: 22.03.2024
		//|			ТОГДА ВЫРАЗИТЬ(ЗаявкаСоставУслуги.Релиз КАК Документ.РелизКлиента) 
		|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ЗаявкаСоставУслуги.Релиз КАК Документ.РелизКлиента), ЗНАЧЕНИЕ(Документ.РелизКлиента.ПустаяСсылка))
		// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Конец: 22.03.2024
		|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.РелизКлиента.ПустаяСсылка)
		|	КОНЕЦ КАК Релиз,
		|	ЗаявкаСоставУслуги.ПринадлежностьТЕ КАК ПринадлежностьТЕ,  
		|	ЗаявкаСоставУслуги.ИдентификаторСтрокиРелизаКлиента КАК ИдентификаторСтрокиРелизаКлиента, 
		// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Начало: 22.03.2024
		|	ЗаявкаСоставУслуги.ИдентификаторСтрокиЗапросаНаКТК КАК ИдентификаторСтрокиЗапросаНаКТК,
		// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Конец: 22.03.2024
		//Евросиб Коханенко Н.А. 24.04.2024 (( #84617 
		|	ЗаявкаСоставУслуги.УчетноеНаправление КАК УчетноеНаправление,
		//Евросиб Коханенко Н.А. 24.04.2024 )) #84617 
		|	ЗаявкаСоставУслуги.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки
		|ПОМЕСТИТЬ ВТ_ДанныеУслуг
		|ИЗ
		|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|ГДЕ
		|	ЗаявкаСоставУслуги.Ссылка = &Ссылка    
		|	И &Миля = ЗНАЧЕНИЕ(Перечисление.ВариантыАвтоперевозки.СиламиЕвросиб)
        //Евросиб Коханенко Н.А. 22.05.2024 (( #83866
		|	И ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка)
		//Евросиб Коханенко Н.А. 22.05.2024 )) #83866 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеУслуг.ИдентификаторСтрокиРелизаКлиента КАК ИдентификаторСтрокиРелизаКлиента,
		|	ВТ_ДанныеУслуг.Релиз
		|ПОМЕСТИТЬ ВТ_ДляПолученияДанныхПоРелизу
		|ИЗ
		|	ВТ_ДанныеУслуг КАК ВТ_ДанныеУслуг
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДанныеУслуг.ИдентификаторСтрокиРелизаКлиента,
		|	ВТ_ДанныеУслуг.Релиз
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДляПолученияДанныхПоРелизу.Релиз КАК Релиз,
		|	ЕСТЬNULL(РелизКлиентаКонтейнеры.КлючАналитикиПеревозки.Контейнер, ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)) КАК Контейнер,
		|   ЕСТЬNULL(РелизКлиентаКонтейнеры.ИдентификаторСтроки,"""") КАК ИдентификаторСтроки,
		|	ЕСТЬNULL(КлючиАналитикиПеревозкиМили.Автоперевозчик,"""") КАК Перевозчик,
		|	ЕСТЬNULL(КлючиАналитикиПеревозкиМили.ДатаВыдачиКТКСТерминала,ДАТАВРЕМЯ (1, 1, 1)) КАК ДатаВывоза,
		|	ЕСТЬNULL(КлючиАналитикиПеревозкиМили.ФИОВодителя,"""") КАК ФИОВодителя,
		|	ЕСТЬNULL(КлючиАналитикиПеревозкиМили.РегНомерТС,"""") КАК РегНомерТС
		|ИЗ
		|	ВТ_ДляПолученияДанныхПоРелизу КАК ВТ_ДляПолученияДанныхПоРелизу
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РелизКлиента.Контейнеры КАК РелизКлиентаКонтейнеры
		|		&УсловияПоМили	
		|		ПО ВТ_ДляПолученияДанныхПоРелизу.ИдентификаторСтрокиРелизаКлиента = РелизКлиентаКонтейнеры.ИдентификаторСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеУслуг.Контейнер КАК Контейнер,
		|	ВТ_ДанныеУслуг.ТипКТК КАК ТипКТК,
		|	ВТ_ДанныеУслуг.Груз КАК Груз,
		|	ВТ_ДанныеУслуг.ВесГрузаНетто КАК ВесГрузаНетто,
		|	ВТ_ДанныеУслуг.КоличествоМест КАК КоличествоМест,
		|	ВТ_ДанныеУслуг.ИдентификаторСтрокиУслуги КАК ИдентификаторСтрокиУслуги,
		|	ВТ_ДанныеУслуг.Релиз КАК Релиз,
		|	ВТ_ДанныеУслуг.Релиз.СтокСдачи КАК СтокСдачи,
		|	ВТ_ДанныеУслуг.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
		|	ВТ_ДанныеУслуг.ИдентификаторСтрокиРелизаКлиента КАК ИдентификаторСтрокиРелизаКлиента,    
		// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Начало: 22.03.2024
		|	ВТ_ДанныеУслуг.ИдентификаторСтрокиЗапросаНаКТК КАК ИдентификаторСтрокиЗапросаНаКТК, 
		// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Конец: 22.03.2024
		// ДИТ BUG 77633 ТА 77634 Сержантова А.С. Начало: 24.11.2023
		|	ВТ_ДанныеУслуг.НомерСтроки КАК НомерСтроки,
		// ДИТ BUG 77633 ТА 77634 Сержантова А.С. Конец: 24.11.2023   
		//Евросиб Коханенко Н.А. 24.04.2024 (( #84617 
		|	ВТ_ДанныеУслуг.УчетноеНаправление КАК УчетноеНаправление,
		//Евросиб Коханенко Н.А. 24.04.2024 )) #84617 
		|	ВТ_ДанныеУслуг.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки
		|ИЗ
		|	ВТ_ДанныеУслуг КАК ВТ_ДанныеУслуг
		//Евросиб Коханенко Н.А. 25.07.2024 (( #83866   
		|	&УсловиеПоНаличиюВЗапросе
		//Евросиб Коханенко Н.А. 25.07.2024 )) #83866 
		|";
	
	Если Объект.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Миля","ЗаявкаСоставУслуги.ПерваяМиля");
		//Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловияПоМили"
		//		  ,"ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизКлиента.ТранспортныеСредства КАК РелизКлиентаТранспортныеСредства
		//|			ПО РелизКлиентаКонтейнеры.ИдентификаторСтрокиТС = РелизКлиентаТранспортныеСредства.ИдентификаторСтроки");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловияПоМили"
				  ,"ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
	|				ПО РелизКлиентаКонтейнеры.КлючАналитикиПеревозки = КлючиАналитикиПеревозкиМили.Ссылка
	|	    			И КлючиАналитикиПеревозкиМили.ЭтапПеревозки = Значение(Перечисление.ЭтапыПеревозки.ПерваяМиля)");		  
		
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Миля","ЗаявкаСоставУслуги.ПоследняяМиля");
		//Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловияПоМили"
		//		  ,"ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизКлиента.ТранспортныеСредстваПоследняяМиля КАК РелизКлиентаТранспортныеСредства
		//|			ПО РелизКлиентаКонтейнеры.ИдентификаторСтрокиТСПоследняяМиля = РелизКлиентаТранспортныеСредства.ИдентификаторСтроки");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловияПоМили"
				  ,"ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
	|				ПО РелизКлиентаКонтейнеры.КлючАналитикиПеревозки = КлючиАналитикиПеревозкиМили.Ссылка
	|	    			И КлючиАналитикиПеревозкиМили.ЭтапПеревозки = Значение(Перечисление.ЭтапыПеревозки.ПоследняяМиля)");
	КонецЕсли;  
	
	//Евросиб Коханенко Н.А. 25.07.2024 (( #83866   
	//добавляем условие, не позволяющее вставлять в запрос контейнеры, если они уже добавлены в запрос (по данным ключа аналитики)
	Если Объект.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеПоНаличиюВЗапросе",
			"ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
		|	ПО ВТ_ДанныеУслуг.КлючАналитикиПеревозки = КлючиАналитикиПеревозкиМили.Ссылка
		|		И КлючиАналитикиПеревозкиМили.ЭтапПеревозки = Значение(Перечисление.ЭтапыПеревозки.ПерваяМиля)
		|		И (КлючиАналитикиПеревозкиМили.ЗапросНаАвто = Значение(Документ.ЗапросНаАвтоперевозку.ПустаяСсылка)	
		|			ИЛИ КлючиАналитикиПеревозкиМили.ЗапросНаАвто = &ЗапросСсылка)");	
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеПоНаличиюВЗапросе",
			"ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
		|	ПО ВТ_ДанныеУслуг.КлючАналитикиПеревозки = КлючиАналитикиПеревозкиМили.Ссылка
		|		И КлючиАналитикиПеревозкиМили.ЭтапПеревозки = Значение(Перечисление.ЭтапыПеревозки.ПоследняяМиля)
		|		И (КлючиАналитикиПеревозкиМили.ЗапросНаАвто = Значение(Документ.ЗапросНаАвтоперевозку.ПустаяСсылка)	
		|			ИЛИ КлючиАналитикиПеревозкиМили.ЗапросНаАвто = &ЗапросСсылка)");	
	КонецЕсли;  

	Запрос.УстановитьПараметр("ЗапросСсылка", Объект.Ссылка);
	//Евросиб Коханенко Н.А. 25.07.2024 )) #83866 
	
	Запрос.УстановитьПараметр("ЭтапПеревозки", Объект.ЭтапПеревозки);
	Запрос.УстановитьПараметр("Ссылка", ЗаявкаПараметр);
	
	ПакетыЗапросов = Запрос.ВыполнитьПакет();
		
	ТаблицаДанныхИзРелиза 			= ПакетыЗапросов[2].Выгрузить();
	ТаблицаУслуг 					= ПакетыЗапросов[3].Выгрузить();	

	СтруктураОтвет = Новый Структура("ТаблицаДанныхИзРелиза,ТаблицаУслуг"
									,ТаблицаДанныхИзРелиза
									,ТаблицаУслуг);
	
	Возврат СтруктураОтвет;
	
КонецФункции	

&НаСервере
Функция ПолучитьИтоговуюТаблицу(ПараметрыФункции,КоличествоНеДобавленных)
	
	ТаблицаЗапросыНаКТК 			  = ПараметрыФункции.ТаблицаЗапросыНаКТК;
	ТаблицаУслуг					  = ПараметрыФункции.ТаблицаУслуг;
	ТаблицаОбщееКоличествоКонтВРелизе = ПараметрыФункции.ТаблицаОбщееКоличествоКонтВРелизе;
	
	ИтоговаяТаблица = Объект.Контейнеры.Выгрузить();
	ИтоговаяТаблица.Очистить();
	ИтоговаяТаблица.Колонки.Добавить("ИдентификаторСтрокиРелизаКлиента",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));
	ИтоговаяТаблица.Колонки.Добавить("ТипКТКДоУслуги",Новый ОписаниеТипов("СправочникСсылка.ТипоразмерыТЕ"));
	ИтоговаяТаблица.Колонки.Добавить("ТерминалВыдачиКТКДоУслуги",Новый ОписаниеТипов("СправочникСсылка.Локации"));  
	ИтоговаяТаблица.Колонки.Добавить("НомерРелизаЕвросибДоУслуги",Новый ОписаниеТипов("ДокументСсылка.РелизКлиента"));
	ИтоговаяТаблица.Колонки.Удалить("ИдентификаторСтрокиТЧ");
	Если Объект.УпрощенныйАлгоритмЗаполненияПоследнейМили Тогда
		ЗаполниитьПоУпрощенномуАлгоритму(ИтоговаяТаблица,ТаблицаУслуг);
		Возврат ИтоговаяТаблица;
	КонецЕсли;	
	
	Для Каждого СтрокаЗапросов Из ТаблицаЗапросыНаКТК Цикл
		ЗапросБезРелиза = Ложь;
		СтруктураПоиска = Новый Структура("РелизКлиента",СтрокаЗапросов.Релиз);
		НайденнаяСтрока = ТаблицаОбщееКоличествоКонтВРелизе.НайтиСтроки(СтруктураПоиска);
		ЗапросСвязанСРелизомКлиента = НайденнаяСтрока.Количество() > 0;
		Если ЗапросСвязанСРелизомКлиента Тогда
			КоличествоВЗапросах      = НайденнаяСтрока[0].КоличествоВЗапросах;
			КоличествоКТККДобавлению = НайденнаяСтрока[0].ОбщееКоличествоКТКВРелизе - КоличествоВЗапросах;
		КонецЕсли;		
		индМакс = СтрокаЗапросов.КоличествоКТК;
		Для  инд = 1 По индМакс Цикл
			
			Если ЗапросСвязанСРелизомКлиента Тогда
				Если КоличествоКТККДобавлению = 0 Тогда
					КоличествоНеДобавленных = КоличествоНеДобавленных + 1;
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			НовСтрока = ИтоговаяТаблица.Добавить(); 
			ЗаполнитьЗначенияСвойств(НовСтрока,СтрокаЗапросов);  
			// ДИТ US 81881 ТА 83581 Сержантова А.С. Начало: 08.04.2024
			НовСтрока.ТерминалВыдачиКТКДоУслуги = СтрокаЗапросов.ТерминалВыдачи;
			// ДИТ US 81881 ТА 83581 Сержантова А.С. Конец: 08.04.2024
			НовСтрока.ТерминалСдачи = ПолучитьТерминалСдачиПоСтокуСдачиИзРелиза(СтрокаЗапросов.СтокСдачи); //ДИТ Шевченко А.В. 60951 11.11.2022
			НовСтрока.СтатусЗапросаНаАвтоперевозку = Перечисления.СтатусЗапросаНаПеревозку.Черновик;
			НовСтрока.СтатусОтправкиЗапросаНаТерминалВыдачи = Перечисления.СтатусОтправкиЗапросаНаТерминалВыдачи.НеОтправлен; //ДИТ Шевченко А.В. US 62487 ТА 68012 04.05.2023
			Если ЗапросСвязанСРелизомКлиента Тогда
				КоличествоВЗапросах      = КоличествоВЗапросах + 1;
				КоличествоКТККДобавлению = КоличествоКТККДобавлению - 1;
			КонецЕсли;
		КонецЦикла;
		Если ЗапросСвязанСРелизомКлиента Тогда
			НайденнаяСтрока[0].КоличествоВЗапросах = КоличествоВЗапросах;
		КонецЕсли;
	КонецЦикла;  
	
	// ДИТ BUG 81219 ТА 81220 Сержантова А.С. Начало: 15.02.2024
	ИтоговаяТаблица.Колонки.Добавить("УслугаЗаполненаВСтроке", Новый ОписаниеТипов("Булево"));
	// ДИТ BUG 81219 ТА 81220 Сержантова А.С. Конец: 15.02.2024

	Для Каждого СтрокаТчУслуга Из ТаблицаУслуг Цикл	  
		
		////ДИТ Шевченко А.В. US 62482 ТА 72737 19.07.2023 -Начало   // ДИТ US 78243 ТА 80825 Сержантова А.С. Закомментировала 08.02.2024
		//Если НЕ ЗначениеЗаполнено(СтрокаТчУслуга.Контейнер) Тогда
		//	Продолжить;
		//КонецЕсли;	
		////ДИТ Шевченко А.В. US 62482 ТА 72737 19.07.2023 -Конец     
		
			// ДИТ BUG 81219 ТА 81220 Сержантова А.С. Начало: 15.02.2024
			// Было:
			//СтруктураОтбора = Новый Структура("Релиз,Контейнер",СтрокаТчУслуга.Релиз,Справочники.ТЕ.ПустаяСсылка()); 
			//Стало:
			СтруктураОтбора = Новый Структура("Релиз,Контейнер, УслугаЗаполненаВСтроке",СтрокаТчУслуга.Релиз,Справочники.ТЕ.ПустаяСсылка(), Ложь);
			// ДИТ BUG 81219 ТА 81220 Сержантова А.С. Конец: 15.02.2024      
			// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Начало: 22.03.2024
			Если ЗначениеЗаполнено(СтрокаТчУслуга.ИдентификаторСтрокиЗапросаНаКТК) Тогда
				СтруктураОтбора.Вставить("ИдентификаторСтрокиЗапроса", СтрокаТчУслуга.ИдентификаторСтрокиЗапросаНаКТК);
			КонецЕсли;
			// ДИТ BUG 82599 ТА 82600 Сержантова А.С. Конец: 22.03.2024
			НайденныеСтроки = ИтоговаяТаблица.НайтиСтроки(СтруктураОтбора);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				НайденныеСтроки[0].ТипКТКДоУслуги             = НайденныеСтроки[0].ТипКТК;
				НайденныеСтроки[0].НомерРелизаЕвросибДоУслуги = НайденныеСтроки[0].Релиз;
				ЗаполнитьЗначенияСвойств(НайденныеСтроки[0],СтрокаТчУслуга);
				НайденныеСтроки[0].ТерминалСдачи = ПолучитьТерминалСдачиПоСтокуСдачиИзРелиза(СтрокаТчУслуга.СтокСдачи); //ДИТ Шевченко А.В. 60951 11.11.2022
				// ДИТ BUG 81219 ТА 81220 Сержантова А.С. Начало: 15.02.2024
				НайденныеСтроки[0].УслугаЗаполненаВСтроке = Истина; 
				// ДИТ BUG 81219 ТА 81220 Сержантова А.С. Конец: 15.02.2024
			Иначе
				//ДИТ Шевченко А.В. US 73869 ТА 73870 21.08.2023 -начало
				//Если СтрокаТчУслуга.ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТКлиента ИЛИ ЗначениеЗаполнено(СтрокаТчУслуга.Релиз) Тогда
				Если СтрокаТчУслуга.ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТКлиента 
					// ДИТ US 78243 ТА 79842 Сержантова А.С. Начало: 31.01.2024
					или ((СтрокаТчУслуга.ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТЕвросиба
						и ЗначениеЗаполнено(СтрокаТчУслуга.Релиз)) или ЭтаФорма.ДобавлятьСтрокиБезРелиза) Тогда
					// ДИТ US 78243 ТА 79842 Сержантова А.С. Конец: 31.01.2024
				//ДИТ Шевченко А.В. US 73869 ТА 73870 21.08.2023 -конец
					НовСтрока = ИтоговаяТаблица.Добавить(); 
					// ДИТ BUG 81219 ТА 81220 Сержантова А.С. Начало: 15.02.2024
					НовСтрока.УслугаЗаполненаВСтроке = Истина; 
					// ДИТ BUG 81219 ТА 81220 Сержантова А.С. Конец: 15.02.2024
					ЗаполнитьЗначенияСвойств(НовСтрока,СтрокаТчУслуга);
					НовСтрока.ТерминалСдачи = ПолучитьТерминалСдачиПоСтокуСдачиИзРелиза(СтрокаТчУслуга.СтокСдачи); //ДИТ Шевченко А.В. 60951 11.11.2022	
					НовСтрока.СтатусЗапросаНаАвтоперевозку = Перечисления.СтатусЗапросаНаПеревозку.Черновик;
					НовСтрока.СтатусОтправкиЗапросаНаТерминалВыдачи = Перечисления.СтатусОтправкиЗапросаНаТерминалВыдачи.НеОтправлен; //ДИТ Шевченко А.В. US 62487 ТА 68012 04.05.2023
				КонецЕсли;	
			КонецЕсли;
			
	КонецЦикла;   
		
	// ДИТ BUG 77633 ТА 77634 Сержантова А.С. Начало: 24.11.2023 - пронумеруем строки без КТК
	// Было:
	// ИтоговаяТаблица.Сортировать("ИдентификаторСтрокиЗапроса Убыв,ИдентификаторСтрокиУслуги Убыв"); 
	// Стало:
	СтрокиБезНумерации = ИтоговаяТаблица.НайтиСтроки(Новый Структура("НомерСтроки", 0));
	НомерСтроки = 1;
	Для каждого СтрБезНомера Из СтрокиБезНумерации Цикл    
		НомерСтроки = 1;
		НомерНайден = Ложь;
		Пока не НомерНайден Цикл
			Если ИтоговаяТаблица.Найти(НомерСтроки, "НомерСтроки") = Неопределено Тогда
				СтрБезНомера.НомерСтроки = НомерСтроки;  
				НомерНайден = Истина; Прервать;
			КонецЕсли;     
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;
	КонецЦикла; 
	ИтоговаяТаблица.Сортировать("НомерСтроки");
	// ДИТ BUG 77633 ТА 77634 Сержантова А.С. Конец: 24.11.2023
	
	Возврат ИтоговаяТаблица;
	
КонецФункции	

&НаСервере
Функция ПолучитьТерминалСдачиПоСтокуСдачиИзРелиза(СтокСдачи) //ДИТ Шевченко А.В. 60951 11.11.2022	
	Если Объект.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПоследняяМиля Тогда
		Если ЗначениеЗаполнено(СтокСдачи) Тогда
			//ДИТ Шевченко А.В. 63318 19.01.2023 - начало
			Если ТипЗнч(СтокСдачи) = Тип("СправочникСсылка.Мультилокации") Тогда
				МассивЛокацийСдачи = Справочники.Мультилокации.СоставМультилокации(СтокСдачи);
				Если МассивЛокацийСдачи.Количество() > 0 Тогда
					Возврат МассивЛокацийСдачи[0].Родитель;	
				КонецЕсли;
			ИначеЕсли ТипЗнч(СтокСдачи) = Тип("СправочникСсылка.Локации") Тогда
				Возврат СтокСдачи.Родитель;
			КонецЕсли;
			//ДИТ Шевченко А.В. 63318 19.01.2023 - конец
		КонецЕсли;
	//БИТ Белинский Д.А. 14.04.2023 -начало 
	ИначеЕсли Объект.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля Тогда
		
		ЕстьРейсАвто = Ложь;
		ЕстьДругиеРейсы = Ложь;
		Для Каждого СтрокаРейсы Из Объект.Заявка.ПереченьРейсов Цикл
			Если ТипЗнч(СтрокаРейсы.Рейс) = Тип("СправочникСсылка.РейсыАвто") Тогда
				ЕстьРейсАвто = Истина;
			Иначе
				ЕстьДругиеРейсы = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если ЕстьРейсАвто и НЕ ЕстьДругиеРейсы Тогда 
			Если ЗначениеЗаполнено(СтокСдачи) Тогда
				Если ТипЗнч(СтокСдачи) = Тип("СправочникСсылка.Мультилокации") Тогда
					МассивЛокацийСдачи = Справочники.Мультилокации.СоставМультилокации(СтокСдачи);
					Если МассивЛокацийСдачи.Количество() > 0 Тогда
						Возврат МассивЛокацийСдачи[0].Родитель;	
					КонецЕсли;
				ИначеЕсли ТипЗнч(СтокСдачи) = Тип("СправочникСсылка.Локации") Тогда
					Возврат СтокСдачи.Родитель;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	//БИТ Белинский Д.А. 14.04.2023 -конец 
	КонецЕсли;
	
	Возврат Справочники.Локации.ПустаяСсылка();
КонецФункции	

&НаСервере
Процедура УстановитьЦветИзменения(ПолеОформления,ПолеУсловия,ЗначениеСравнения,ИмяТабличнойЧасти = "",ЦветПодсветки)
	
	// ДИТ US 78233 TA 78240 Сержантова А.С. Начало: 09.01.2024
	// Было:
	//Если СтрНайти(ПолеОформления,"КлючАналитикиПеревозки.") Тогда
	//	ПолеОформления = СтрЗаменить(ПолеОформления,"КлючАналитикиПеревозки.","");	
	//КонецЕсли;
	//
	//Если СтрНайти(ПолеУсловия,"КлючАналитикиПеревозки.") Тогда
	//	ПолеУсловия = СтрЗаменить(ПолеУсловия,"КлючАналитикиПеревозки.","");	
	//КонецЕсли;
	//
	//ЭлементУО = УсловноеОформление.Элементы.Добавить();
	//ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ИмяТабличнойЧасти + ПолеОформления);
	//Если СтрНайти(ПолеОформления,"ИнформацияПолеКонтейнеры") > 0 Тогда
	//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ПолеОформления);
	//КонецЕсли;	
	//ОтборЭлемента = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТабличнойЧасти + ?(ЗначениеЗаполнено(ИмяТабличнойЧасти),".","") + ПолеУсловия);
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	//ОтборЭлемента.ПравоеЗначение = ЗначениеСравнения;
	//
	//ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветПодсветки);   
	// ДИТ US 78233 TA 78240 Сержантова А.С. Конец: 09.01.2024
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьДетализацияПоГрузу()
	Если Элементы.Контейнеры.ТекущиеДанные <> Неопределено Тогда
		//Элементы.КонтейнерыДетализацияПоГрузу.Доступность = Элементы.Контейнеры.ТекущиеДанные.Груз = ПредопределенноеЗначение("Справочник.Грузы.СборнаяКонтейнернаяОтправка");
		//ДИТ Шевченко А.В. US 62421 TA 64345 20.01.23 -начало
		Элементы.КонтейнерыДетализацияПоГрузу.Доступность = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Элементы.Контейнеры.ТекущиеДанные.КлючАналитикиПеревозки,"Груз") = ПредопределенноеЗначение("Справочник.Грузы.СборнаяКонтейнернаяОтправка");
		//ДИТ Шевченко А.В. US 62421 TA 64345 20.01.23 -конец	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьУдаленияСтрокиИСозданияДопЗапроса()
	Если Элементы.Контейнеры.ТекущиеДанные <> Неопределено Тогда
		Элементы.КонтейнерыСоздатьДополнительныйЗапрос.Доступность = (Элементы.Контейнеры.ТекущиеДанные.СтатусЗаказаНаТС = ПредопределенноеЗначение("Перечисление.СтатусЗаказаНаТс.ВыданВРейс") ИЛИ Элементы.Контейнеры.ТекущиеДанные.СтатусЗаказаНаТС = ПредопределенноеЗначение("Перечисление.СтатусЗаказаНаТс.Закрыт"));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ОбновитьИзЗаявкиНаСервере()
	
	ОбновитьШапку();
	
	КоличествоНеДобавленных = 0;	
	
	Ответ = Новый Структура("МассивНомеровСтрокВыданВРейс,МассивНомеровСтрокЗакрыт,АдресХранилища,КоличествоНеДобавленных",Новый Массив,Новый Массив,"",КоличествоНеДобавленных);
	
	СтруктураОтвет       = ПолучитьТаблицуЗапросыНаКТК(Объект.Заявка);	
	СтруктураОтветУслуги = ПолучитьТаблицуУслуг(Объект.Заявка);
	
	ПараметрыФункции = Новый Структура("ТаблицаЗапросыНаКТК,ТаблицаУслуг,ТаблицаОбщееКоличествоКонтВРелизе"
									,СтруктураОтвет.ТаблицаЗапросыНаКТК
									,СтруктураОтветУслуги.ТаблицаУслуг
									,СтруктураОтвет.ТЗКоличествоКонтейнеровВРелизахСУчетомЗапросов);

	ТаблицаОбновленная   = ПолучитьИтоговуюТаблицу(ПараметрыФункции,КоличествоНеДобавленных);
	
	//Евросиб Коханенко Н.А. 22.02.2024 (( #80981
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ОбновитьСтоимостьВЗапросеНаАвто();
	//Евросиб Коханенко Н.А. 22.02.2024 )) #80981 
	
	ПромежуточнаяКонтейнеры = Объект.Контейнеры.Выгрузить();
	ПромежуточнаяКонтейнеры.Колонки.Добавить("Обработана",Новый ОписаниеТипов("Булево"));
	ПромежуточнаяКонтейнеры.Колонки.Добавить("СтатусЗаказаНаТСЗапрет",Новый ОписаниеТипов("Булево"));
	ПромежуточнаяКонтейнеры.Колонки.Добавить("СтатусЗаказаОтменен",Новый ОписаниеТипов("Булево"));
	ПромежуточнаяКонтейнеры.Колонки.Добавить("СписокПолейКОформлению",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(1000)));
	
	// ДИТ US 81881 ТА 81882 Сержантова А.С. Начало: 02.04.2024 - в ТЧ контейнеров заполняем Терминал выдачи и Дату и время подачи КТК из рейса 
	ЗаполнитьРеквизитыТЧКонтейнеровПоРейсу(ТаблицаОбновленная, Объект.Заявка);
	// ДИТ US 81881 ТА 81882 Сержантова А.С. Конец: 02.04.2024
	
	Для Каждого СтрокаСОбновлениями Из ТаблицаОбновленная Цикл
		
		КолНайденныхСтрок = 0; 
		//Евросиб Коханенко Н.А. 17.12.2024 (( #97222 
		//Если ЗначениеЗаполнено(СтрокаСОбновлениями.ИдентификаторСтрокиУслуги) И ЗначениеЗаполнено(СтрокаСОбновлениями.ИдентификаторСтрокиЗапроса) Тогда
		Если ЗначениеЗаполнено(СтрокаСОбновлениями.КлючАналитикиПеревозки) Тогда
			СтруктураПоиска = Новый Структура("КлючАналитикиПеревозки",
			СтрокаСОбновлениями.КлючАналитикиПеревозки);
		ИначеЕсли ЗначениеЗаполнено(СтрокаСОбновлениями.ИдентификаторСтрокиУслуги) И ЗначениеЗаполнено(СтрокаСОбновлениями.ИдентификаторСтрокиЗапроса) Тогда	
		//Евросиб Коханенко Н.А. 17.12.2024 )) #97222 
			СтруктураПоиска = Новый Структура("ИдентификаторСтрокиЗапроса,ИдентификаторСтрокиУслуги",
			СтрокаСОбновлениями.ИдентификаторСтрокиЗапроса,
			СтрокаСОбновлениями.ИдентификаторСтрокиУслуги);
		ИначеЕсли ЗначениеЗаполнено(СтрокаСОбновлениями.ИдентификаторСтрокиЗапроса) И НЕ ЗначениеЗаполнено(СтрокаСОбновлениями.ИдентификаторСтрокиУслуги) Тогда
			СтруктураПоиска = Новый Структура("ИдентификаторСтрокиЗапроса",
			СтрокаСОбновлениями.ИдентификаторСтрокиЗапроса);
		ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаСОбновлениями.ИдентификаторСтрокиЗапроса) И ЗначениеЗаполнено(СтрокаСОбновлениями.ИдентификаторСтрокиУслуги) Тогда
			СтруктураПоиска = Новый Структура("ИдентификаторСтрокиУслуги",
			СтрокаСОбновлениями.ИдентификаторСтрокиУслуги);
		КонецЕсли;
		НайтиСтрокиПоПолямИЗаполнить(СтруктураПоиска,СтрокаСОбновлениями,ПромежуточнаяКонтейнеры,КолНайденныхСтрок);
		
		Если КолНайденныхСтрок = 0 И ЗначениеЗаполнено(СтрокаСОбновлениями.ИдентификаторСтрокиУслуги) И ЗначениеЗаполнено(СтрокаСОбновлениями.Релиз) Тогда
			СтруктураПоискаРелиза = Новый Структура("Релиз,ИдентификаторСтроки",СтрокаСОбновлениями.Релиз,СтрокаСОбновлениями.ИдентификаторСтрокиРелизаКлиента);
			НайденныйРелиз = СтруктураОтветУслуги.ТаблицаДанныхИзРелиза.НайтиСтроки(СтруктураПоискаРелиза);
					
			ВыполнитьПривязку = Истина;
			
			Если НайденныйРелиз.Количество() = 0 Тогда
				ВыполнитьПривязку = Ложь;	
			КонецЕсли;	
			
			Для Каждого НайденнаяСтрока Из НайденныйРелиз Цикл
				Если НЕ ЗначениеЗаполнено(НайденнаяСтрока.Контейнер) Тогда
					ТекстСообщения = "не удалось соотнести данные о добавленных контейнерах в Услуги со строками в запросе на автоперевозку по причине отсутствия в релизе клиента номера контейнера";
					ВыполнитьПривязку = Ложь;
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				КонецЕсли;	
				Если НЕ ЗначениеЗаполнено(НайденнаяСтрока.ДатаВывоза) Тогда
					ТекстСообщения = "не удалось соотнести данные о добавленных контейнерах в Услуги со строками в запросе на автоперевозку по причине отсутствия в релизе клиента Даты вывоза";
					ВыполнитьПривязку = Ложь;
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(НайденнаяСтрока.Перевозчик) И НЕ ЗначениеЗаполнено(НайденнаяСтрока.ФИОВодителя) И НЕ ЗначениеЗаполнено(НайденнаяСтрока.РегНомерТС) Тогда
					ТекстСообщения = "не удалось соотнести данные о добавленных контейнерах в Услуги со строками в запросе на автоперевозку по причине отсутствия в релизе клиента. Незаполнены перевозчик, ФИОВодителя, РегНомерТС";
					ВыполнитьПривязку = Ложь;
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				КонецЕсли;
				
				Если ВыполнитьПривязку Тогда
					Если ЗначениеЗаполнено(СтрокаСОбновлениями.ИдентификаторСтрокиУслуги) Тогда
						СтруктураПоиска = Новый Структура("ИдентификаторСтрокиЗапроса,ИдентификаторСтрокиУслуги",
						СтрокаСОбновлениями.ИдентификаторСтрокиЗапроса,
						СтрокаСОбновлениями.ИдентификаторСтрокиУслуги);
					Иначе 
						СтруктураПоиска = Новый Структура("ИдентификаторСтрокиЗапроса",
						СтрокаСОбновлениями.ИдентификаторСтрокиЗапроса);
					КонецЕсли;
					ПривязатьУслугуКСвободнойСтроке(СтруктураПоиска,СтрокаСОбновлениями,ПромежуточнаяКонтейнеры,НайденнаяСтрока,КолНайденныхСтрок);
					Если КолНайденныхСтрок = 0 Тогда
						ВыполнитьПривязку = Ложь;
					КонецЕсли;	
				КонецЕсли;
			КонецЦикла;	
			
			Если НЕ ВыполнитьПривязку Тогда  
				// ДИТ US 79950 ТА 79951 Сержантова А.С. Начало: 27.02.2024 - не очищаем данные строки с обновлениями! так теряются данные!
				// Если строка не найдена ранее, то пробуем искать по ключу аналитики, иначе добавим новую
				// Было:
				//Если ЗначениеЗаполнено(СтрокаСОбновлениями.ИдентификаторСтрокиЗапроса) Тогда	
				//	СтрокаСОбновлениями.Контейнер 		   = Справочники.ТЕ.ПустаяСсылка();
				//	СтрокаСОбновлениями.Груз  			   = Справочники.Грузы.ПустаяСсылка();
				//	СтрокаСОбновлениями.ВесГрузаНетто 	   = 0;
				//	СтрокаСОбновлениями.КоличествоМест 	   = 0;
				//	СтрокаСОбновлениями.ИдентификаторСтрокиУслуги   = "";
				//	СтрокаСОбновлениями.Релиз              = СтрокаСОбновлениями.НомерРелизаЕвросибДоУслуги;
				//	СтрокаСОбновлениями.ТипКТК 	           = СтрокаСОбновлениями.ТипКТКДоУслуги;
				//	Если ЗначениеЗаполнено(СтрокаСОбновлениями.ИдентификаторСтрокиУслуги) И ЗначениеЗаполнено(СтрокаСОбновлениями.ИдентификаторСтрокиЗапроса) Тогда
				//		СтруктураПоиска = Новый Структура("ИдентификаторСтрокиЗапроса,ИдентификаторСтрокиУслуги",
				//		СтрокаСОбновлениями.ИдентификаторСтрокиЗапроса,
				//		СтрокаСОбновлениями.ИдентификаторСтрокиУслуги);
				//	ИначеЕсли ЗначениеЗаполнено(СтрокаСОбновлениями.ИдентификаторСтрокиЗапроса) И НЕ ЗначениеЗаполнено(СтрокаСОбновлениями.ИдентификаторСтрокиУслуги) Тогда
				//		СтруктураПоиска = Новый Структура("ИдентификаторСтрокиЗапроса",
				//		СтрокаСОбновлениями.ИдентификаторСтрокиЗапроса);
				//	ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаСОбновлениями.ИдентификаторСтрокиЗапроса) И ЗначениеЗаполнено(СтрокаСОбновлениями.ИдентификаторСтрокиУслуги) Тогда
				//		СтруктураПоиска = Новый Структура("ИдентификаторСтрокиУслуги",
				//		СтрокаСОбновлениями.ИдентификаторСтрокиУслуги);
				//	КонецЕсли;
				//	НайтиСтрокиПоПолямИЗаполнить(СтруктураПоиска,СтрокаСОбновлениями,ПромежуточнаяКонтейнеры,КолНайденныхСтрок);
				//КонецЕсли;
				//Стало:
				Если ЗначениеЗаполнено(СтрокаСОбновлениями.КлючАналитикиПеревозки) Тогда
					СтруктураПоиска = Новый Структура("КлючАналитикиПеревозки",
										СтрокаСОбновлениями.КлючАналитикиПеревозки);
                    НайтиСтрокиПоПолямИЗаполнить(СтруктураПоиска,СтрокаСОбновлениями,ПромежуточнаяКонтейнеры,КолНайденныхСтрок);
				КонецЕсли;
				// ДИТ US 79950 ТА 79951 Сержантова А.С. Конец: 27.02.2024
			КонецЕсли;	
			
		КонецЕсли;	
		
		Если КолНайденныхСтрок = 0 Тогда
			ДобавитьСтрокуВПромежуточную(СтрокаСОбновлениями,ПромежуточнаяКонтейнеры);
		КонецЕсли;	
		
	КонецЦикла;	
	
	МассивНомеровСтрокВыданВРейс = Новый Массив;
	МассивНомеровСтрокЗакрыт     = Новый Массив;
	
	СтруктураПоиска = Новый Структура("СтатусЗаказаНаТСЗапрет,СтатусЗаказаНаТС",Истина,Перечисления.СтатусЗаказаНаТс.ВыданВРейс);
	НайденныеСтроки = ПромежуточнаяКонтейнеры.НайтиСтроки(СтруктураПоиска);
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		МассивНомеровСтрокВыданВРейс.Добавить(НайденнаяСтрока.НомерСтроки);
	КонецЦикла;
	
	СтруктураПоиска = Новый Структура("СтатусЗаказаНаТСЗапрет,СтатусЗаказаНаТС",Истина,Перечисления.СтатусЗаказаНаТс.Закрыт);
	НайденныеСтроки = ПромежуточнаяКонтейнеры.НайтиСтроки(СтруктураПоиска);
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		МассивНомеровСтрокЗакрыт.Добавить(НайденнаяСтрока.НомерСтроки);
	КонецЦикла;
	
	Ответ.МассивНомеровСтрокВыданВРейс = МассивНомеровСтрокВыданВРейс;
	Ответ.МассивНомеровСтрокЗакрыт 	   = МассивНомеровСтрокЗакрыт;
	
	//ДИТ Шевченко А.В. US 62487 ТА 68012 04.05.2023 -Начало
	Для Каждого СтрокаП Из ПромежуточнаяКонтейнеры Цикл
		Если Объект.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля И ЗначениеЗаполнено(СтрокаП.Релиз) Тогда
			Документы.ЗапросНаАвтоперевозку.ЗаполнитьСтатусОтправкиЗапросаНаТерминалВыдачиПоРелизу(СтрокаП,СтрокаП.Релиз);
		КонецЕсли;
	КонецЦикла;
	//ДИТ Шевченко А.В. US 62487 ТА 68012 04.05.2023 -Конец  
	
	Если МассивНомеровСтрокВыданВРейс.Количество() = 0 И МассивНомеровСтрокЗакрыт.Количество() = 0 Тогда
		ОбновитьСтрокиИзПромежуточнойТаблицы(ПромежуточнаяКонтейнеры,КоличествоНеДобавленных);	
		Возврат Ответ;
	Иначе
		АдресХранилища = ПоместитьВоВременноеХранилище(ПромежуточнаяКонтейнеры,ЭтаФорма.УникальныйИдентификатор);
		Ответ.АдресХранилища = АдресХранилища;
		Возврат Ответ;
	КонецЕсли;	
	
КонецФункции

&НаСервере
Процедура ПолучитьПромежуточнуюИзХранилищаИОбновить(АдресХранилища,КоличествоНеДобавленных)
	
	ПромежуточнаяКонтейнеры = ПолучитьИзВременногоХранилища(АдресХранилища);
	ОбновитьСтрокиИзПромежуточнойТаблицы(ПромежуточнаяКонтейнеры,КоличествоНеДобавленных)
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтрокиИзПромежуточнойТаблицы(ПромежуточнаяКонтейнеры,КоличествоНеДобавленных)
	ПометитьНаОтменуНеОбработанныеСтроки(ПромежуточнаяКонтейнеры);	
	// ДИТ US 78243 ТА 79842 Сержантова А.С. Начало: 31.01.2024 - удалим из КоличествоНеДобавленных не обработанные строки - они добавлены, изменится статус на отменено
	КоличествоНеобработанных = ПромежуточнаяКонтейнеры.НайтиСтроки(Новый Структура("Обработана", Ложь)); 
	КоличествоНеДобавленных = КоличествоНеДобавленных - КоличествоНеобработанных.Количество();
	// ДИТ US 78243 ТА 79842 Сержантова А.С. Конец: 31.01.2024
	МассивОбработанныхГуидов = Новый Массив;
	//ДИТ Шевченко А.В. US 62421 TA 65316 17.02.23
	ТаблицаРелизов = ПромежуточнаяКонтейнеры.Скопировать(,"Релиз");
	ТаблицаРелизов.Колонки.Добавить("Ключ");
	ТаблицаРелизов.Колонки.Добавить("Обработан");	
	ПолучитьКлючиПоРелизам(ТаблицаРелизов);
	
	ТаблицаКлючейПоЗапросамИзГуидов = ПромежуточнаяКонтейнеры.Скопировать(,"ИдентификаторСтрокиЗапроса");
	ТаблицаКлючейПоЗапросамИзГуидов.Колонки.Добавить("Ключ");
	ТаблицаКлючейПоЗапросамИзГуидов.Колонки.Добавить("Обработан");
	
	ПолучитьКлючиПоСозданнымЗапросам(ТаблицаКлючейПоЗапросамИзГуидов);
	
	Для Каждого СтрокаРелизыКлючи Из ТаблицаРелизов Цикл
		СтруктураПоиска = Новый Структура("КлючАналитикиПеревозки",СтрокаРелизыКлючи.Ключ);
		МассивСтрок = ПромежуточнаяКонтейнеры.НайтиСтроки(СтруктураПоиска);
		СтрокаРелизыКлючи.Обработан = МассивСтрок.Количество() > 0;	
	КонецЦикла;
	Для Каждого СтрокаЗапросКлючи Из ТаблицаКлючейПоЗапросамИзГуидов Цикл
		СтруктураПоиска = Новый Структура("КлючАналитикиПеревозки",СтрокаЗапросКлючи.Ключ);
		МассивСтрок = ПромежуточнаяКонтейнеры.НайтиСтроки(СтруктураПоиска);
		СтрокаЗапросКлючи.Обработан = МассивСтрок.Количество() > 0;	
	КонецЦикла;
	
	//ДИТ Шевченко А.В. US 62421 TA 65316 17.02.23
	Для Каждого ПромежуточнаяСтрока Из ПромежуточнаяКонтейнеры Цикл
		
		//Евросиб Коханенко Н.А. 17.12.2024 (( #97222 
		//Если ЗначениеЗаполнено(ПромежуточнаяСтрока.ИдентификаторСтрокиУслуги) И ЗначениеЗаполнено(ПромежуточнаяСтрока.ИдентификаторСтрокиЗапроса) Тогда
		Если ЗначениеЗаполнено(ПромежуточнаяСтрока.КлючАналитикиПеревозки) Тогда
			СтруктураПоиска = Новый Структура("КлючАналитикиПеревозки",
			ПромежуточнаяСтрока.КлючАналитикиПеревозки);
		ИначеЕсли ЗначениеЗаполнено(ПромежуточнаяСтрока.ИдентификаторСтрокиУслуги) И ЗначениеЗаполнено(ПромежуточнаяСтрока.ИдентификаторСтрокиЗапроса) Тогда	
		//Евросиб Коханенко Н.А. 17.12.2024 )) #97222 
			СтруктураПоиска = Новый Структура("ИдентификаторСтрокиЗапроса,ИдентификаторСтрокиУслуги",
			ПромежуточнаяСтрока.ИдентификаторСтрокиЗапроса,
			ПромежуточнаяСтрока.ИдентификаторСтрокиУслуги);
		ИначеЕсли ЗначениеЗаполнено(ПромежуточнаяСтрока.ИдентификаторСтрокиЗапроса) И НЕ ЗначениеЗаполнено(ПромежуточнаяСтрока.ИдентификаторСтрокиУслуги) Тогда
			СтруктураПоиска = Новый Структура("ИдентификаторСтрокиЗапроса",
			ПромежуточнаяСтрока.ИдентификаторСтрокиЗапроса);
		ИначеЕсли НЕ ЗначениеЗаполнено(ПромежуточнаяСтрока.ИдентификаторСтрокиЗапроса) И ЗначениеЗаполнено(ПромежуточнаяСтрока.ИдентификаторСтрокиУслуги) Тогда
			СтруктураПоиска = Новый Структура("ИдентификаторСтрокиУслуги",
			ПромежуточнаяСтрока.ИдентификаторСтрокиУслуги);
		КонецЕсли;
		
		НайденныеСтроки = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска);          
		ПромежуточнаяОбновлена = Ложь;
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Если МассивОбработанныхГуидов.Найти(НайденнаяСтрока.ИдентификаторСтрокиТЧ) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;	
			
			ПромежуточнаяОбновлена = Истина;
			Если НЕ ЗначениеЗаполнено(НайденнаяСтрока.ИдентификаторСтрокиТЧ) Тогда 
				НайденнаяСтрока.ИдентификаторСтрокиТЧ = Новый УникальныйИдентификатор();
				НайденнаяСтрока.ИдентификаторСтрокиТабличнойЧасти = НайденнаяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
			МассивОбработанныхГуидов.Добавить(НайденнаяСтрока.ИдентификаторСтрокиТЧ);
			Если ПромежуточнаяСтрока.СтатусЗаказаНаТСЗапрет Тогда
				Прервать;
			КонецЕсли;
			
			Если ПромежуточнаяСтрока.СтатусЗаказаОтменен Тогда 
				Прервать;
			КонецЕсли;
			
			//Евросиб Коханенко Н.А. 05.07.2024 (( #83866
			//ЗаполнитьЗначенияСвойств(НайденнаяСтрока,ПромежуточнаяСтрока);
			//нельзя отменять строки, по которым уже начато движение
			Если НЕ ЗначениеЗаполнено(НайденнаяСтрока.ДатаИВремяВывоза) 
				И НЕ ЗначениеЗаполнено(НайденнаяСтрока.ДатаЗавершенияОперацииНаСкладеКлиента) Тогда
				ЗаполнитьЗначенияСвойств(НайденнаяСтрока,ПромежуточнаяСтрока);
			КонецЕсли;
			//Евросиб Коханенко Н.А. 05.07.2024 )) #83866 
			
			
			МассивПолейДляОфрмления = СтрРазделить(ПромежуточнаяСтрока.СписокПолейКОформлению,";");
			
			Для Каждого ЗнчМассива Из МассивПолейДляОфрмления Цикл
				Если НЕ ЗнчМассива = "" Тогда
					ОбновитьТаблицуОформления(ЗнчМассива,"ИдентификаторСтрокиТЧ",НайденнаяСтрока.ИдентификаторСтрокиТЧ,"Контейнеры");
					НайденнаяСтрока.ОбновленыИсходныеДанные = Истина;
					ЭтаФорма.Модифицированность = Истина;
				КонецЕсли;
			КонецЦикла;
			Прервать;
		КонецЦикла;
		Если НЕ ПромежуточнаяОбновлена Тогда
			НовСтрока = Объект.Контейнеры.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока,ПромежуточнаяСтрока);
			//ДИТ Шевченко А.В. US 62421 TA 65316 17.02.23	
			Если НЕ ЗначениеЗаполнено(ПромежуточнаяСтрока.КлючАналитикиПеревозки) И ЗначениеЗаполнено(ПромежуточнаяСтрока.Релиз) Тогда
				СтруктураОтбора = Новый Структура("Обработан,Релиз",Ложь,ПромежуточнаяСтрока.Релиз);
				СтрокиРелизыКлючи = ТаблицаРелизов.НайтиСтроки(СтруктураОтбора);
				Если СтрокиРелизыКлючи.Количество() > 0 Тогда
					НовСтрока.КлючАналитикиПеревозки = СтрокиРелизыКлючи[0].Ключ;
					СтрокиРелизыКлючи[0].Обработан = Истина;
				КонецЕсли;	
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ПромежуточнаяСтрока.КлючАналитикиПеревозки) И НЕ ЗначениеЗаполнено(ПромежуточнаяСтрока.Релиз) Тогда
				
				СтруктураОтбора = Новый Структура("Обработан,ИдентификаторСтрокиЗапроса",Ложь,ПромежуточнаяСтрока.ИдентификаторСтрокиЗапроса);
				СтрокиЗапросыКлючи = ТаблицаКлючейПоЗапросамИзГуидов.НайтиСтроки(СтруктураОтбора);
				Если СтрокиЗапросыКлючи.Количество() > 0 Тогда
					НовСтрока.КлючАналитикиПеревозки = СтрокиЗапросыКлючи[0].Ключ;
					СтрокиЗапросыКлючи[0].Обработан = Истина;
				Иначе		
					СтруктураКлюча  = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
					СтруктураКлюча.Вставить("Заявка",Объект.Заявка);
					Если Объект.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля Тогда
						Ответ = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлюча);
						НовСтрока.КлючАналитикиПеревозки = Ответ.КлючАналитикиПеревозки;
						НовСтрока.ВерсияКлюча = Ответ.ВерсияДанных;
					Иначе
						Ответ = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлюча);
						НовСтрока.КлючАналитикиПеревозки = Ответ.КлючАналитикиПеревозки;
						НовСтрока.ВерсияКлюча = Ответ.ВерсияДанных;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			//ДИТ Шевченко А.В. US 62421 TA 65316 17.02.23
			НовСтрока.ИдентификаторСтрокиТЧ = Новый УникальныйИдентификатор();
			НовСтрока.ИдентификаторСтрокиТабличнойЧасти = НовСтрока.ПолучитьИдентификатор();
			МассивОбработанныхГуидов.Добавить(НовСтрока.ИдентификаторСтрокиТЧ);
			ЭтаФорма.Модифицированность = Истина;
			ОбновитьТаблицуОформления("","ИдентификаторСтрокиТЧ",НовСтрока.ИдентификаторСтрокиТЧ,"Контейнеры");
		КонецЕсли;	
	КонецЦикла;
	
	//Евросиб Коханенко Н.А. 23.08.2024 (( #89393 
	//Если КоличествоНеДобавленных > 0 Тогда
	//	ОбщегоНазначения.СообщитьПользователю(СтрШаблон("В запрос на автоперевозку не добавлено строк: %1 по причине их нахождения в других запросах на автоперевозку",КоличествоНеДобавленных));
	//КонецЕсли;
	//Евросиб Коханенко Н.А. 23.08.2024 )) #89393 
	
	ОбновитьДетализациюПоГрузу();	
КонецПроцедуры	

&НаСервере
Процедура ПривязатьУслугуКСвободнойСтроке(СтруктураПоиска,СтрокаСОбновлениями,ПромежуточнаяКонтейнеры,НайденныйРелиз,КолНайденныхСтрок)
	
	КолНайденныхСтрок = 0;
	НайденныеСтроки = ПромежуточнаяКонтейнеры.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьОбновлениеСтроки = Ложь;
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		
		Если НайденнаяСтрока.Обработана Тогда
			Продолжить;
		КонецЕсли;	
		
		Если НайденнаяСтрока.СтатусЗапросаНаАвтоперевозку = Перечисления.СтатусЗапросаНаПеревозку.Отменен Тогда
			КолНайденныхСтрок = КолНайденныхСтрок + 1;
			Продолжить;
		КонецЕсли;
		
		ВыполнитьОбновлениеСтроки = Ложь;
		
		Если НайденнаяСтрока.Контейнер = НайденныйРелиз.Контейнер 
			И НайденнаяСтрока.ДатаИВремяВывоза = НайденныйРелиз.ДатаВывоза 
			И НайденнаяСтрока.НомерАвто = НайденныйРелиз.РегНомерТС Тогда
			ВыполнитьОбновлениеСтроки = Истина;	
		КонецЕсли;
		
		Если НайденнаяСтрока.Контейнер = НайденныйРелиз.Контейнер 
			И НайденнаяСтрока.ДатаИВремяВывоза = НайденныйРелиз.ДатаВывоза 
			И НайденнаяСтрока.ФИОВодителя = НайденныйРелиз.ФИОВодителя Тогда
			ВыполнитьОбновлениеСтроки = Истина;	
		КонецЕсли;
		
		Если НайденнаяСтрока.Контейнер = НайденныйРелиз.Контейнер 
			И НайденнаяСтрока.ДатаИВремяВывоза = НайденныйРелиз.ДатаВывоза 
			И НайденнаяСтрока.Перевозчик = НайденныйРелиз.Перевозчик Тогда
			ВыполнитьОбновлениеСтроки = Истина;	
		КонецЕсли;
		
			
		Если ВыполнитьОбновлениеСтроки Тогда
			ОбновитьСтроку(НайденнаяСтрока,СтрокаСОбновлениями);
			НайденнаяСтрока.Обработана = Истина;
			КолНайденныхСтрок = КолНайденныхСтрок + 1; 
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ВыполнитьОбновлениеСтроки Тогда
		ОбщегоНазначения.СообщитьПользователю("Не одна строка запроса на автоперевозку не была сопоставлена с новой строкой услуги.");
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДетализациюПоГрузу()
	
	//Если Объект.ДанныеДетализацииГрузаБылиИзменены Тогда
	//	Возврат;
	//КонецЕсли;
	
	//МассивСтрокГуидов = Новый Массив;
	//Для Каждого СтрокаКонтейнер Из Объект.Контейнеры Цикл
	//	МассивСтрокГуидов.Добавить(СтрокаКонтейнер.ИдентификаторСтрокиУслуги); 
	//КонецЦикла;
	//
	//ДетализацияДоИзменения    = Объект.ДетализацияПоГрузу.Выгрузить(,"ГУИДСтроки,Груз,КоличествоМест,ВесГруза,РодУпаковки");	
	//ЗаполнитьДетализациюПоГрузу(МассивСтрокГуидов,Объект.Заявка);
	//ДетализацияПослеИзменения = Объект.ДетализацияПоГрузу.Выгрузить(,"ГУИДСтроки,Груз,КоличествоМест,ВесГруза,РодУпаковки");
	//
	//ВсеКолонки = "";
	//Для Каждого Колонка Из ДетализацияДоИзменения.Колонки Цикл 
	//	ВсеКолонки = ВсеКолонки + ", " + Колонка.Имя
	//КонецЦикла;
	//ВсеКолонки = Сред(ВсеКолонки, 2);	
	//Таблица = ДетализацияПослеИзменения.Скопировать();    	
	//Таблица.Колонки.Добавить("Знак", Новый ОписаниеТипов("Число"));	
	//Таблица.ЗаполнитьЗначения(1, "Знак");	
	//Для Каждого Строка Из ДетализацияДоИзменения Цикл
	//	ЗаполнитьЗначенияСвойств(Таблица.Добавить(), Строка) 
	//КонецЦикла;
	//
	//Таблица.Колонки.Добавить("Счёт");
	//Таблица.ЗаполнитьЗначения(1, "Счёт");
	//
	//Таблица.Свернуть(ВсеКолонки, "Знак, Счёт");
	//
	//Ответ = Таблица.Скопировать(Новый Структура("Счёт", 1), ВсеКолонки + ", Знак");
	//
	//Ответ.Свернуть("ГУИДСтроки");	

	//Для Каждого СтрокаОтвет Из Ответ Цикл
	//	СтруктураПоиска = Новый Структура;
	//	СтруктураПоиска.Вставить("ИдентификаторСтрокиТЧ",СтрокаОтвет.ГУИДСтроки);
	//	НайденнаяСтрока = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска);
	//	Если НайденнаяСтрока.Количество() > 0 Тогда
	//		ОбновитьТаблицуОформления("Груз","ИдентификаторСтрокиТЧ",НайденнаяСтрока[0].ИдентификаторСтрокиТЧ,"Контейнеры");
	//	КонецЕсли;
	//КонецЦикла;	
	
	Если Объект.ДанныеДетализацииГрузаБылиИзменены Тогда
		Возврат;
	КонецЕсли;
	
	МассивКлючей = Новый Массив;
	Для Каждого СтрокаКонтейнер Из Объект.Контейнеры Цикл
		Если ЗначениеЗаполнено(СтрокаКонтейнер.КлючАналитикиПеревозки) Тогда
			МассивКлючей.Добавить(СтрокаКонтейнер.ИдентификаторСтрокиУслуги);
		КонецЕсли;	
	КонецЦикла;
	
	ДетализацияДоИзменения 		= ДетализацияПоГрузу.Выгрузить();
	ЗаполнитьДетализациюПоГрузу(МассивКлючей,Объект.Заявка);
	ДетализацияПослеИзменения 	= ДетализацияПоГрузу.Выгрузить();
	
	ВсеКолонки = "";
	Для Каждого Колонка Из ДетализацияДоИзменения.Колонки Цикл 
		ВсеКолонки = ВсеКолонки + ", " + Колонка.Имя
	КонецЦикла;
	ВсеКолонки = Сред(ВсеКолонки, 2);	
	Таблица = ДетализацияПослеИзменения.Скопировать();    	
	Таблица.Колонки.Добавить("Знак", Новый ОписаниеТипов("Число"));	
	Таблица.ЗаполнитьЗначения(1, "Знак");	
	Для Каждого Строка Из ДетализацияДоИзменения Цикл
		ЗаполнитьЗначенияСвойств(Таблица.Добавить(), Строка) 
	КонецЦикла;
	
	Таблица.Колонки.Добавить("Счёт");
	Таблица.ЗаполнитьЗначения(1, "Счёт");
	
	Таблица.Свернуть(ВсеКолонки, "Знак, Счёт");
	
	Ответ = Таблица.Скопировать(Новый Структура("Счёт", 1), ВсеКолонки + ", Знак");
	
	Ответ.Свернуть("Ключ");	

	Для Каждого СтрокаОтвет Из Ответ Цикл
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("КлючАналитикиПеревозки",СтрокаОтвет.Ключ);
		НайденнаяСтрока = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска);
		Если НайденнаяСтрока.Количество() > 0 Тогда
			ОбновитьТаблицуОформления("Груз","ИдентификаторСтрокиТЧ",НайденнаяСтрока[0].ИдентификаторСтрокиТЧ,"Контейнеры");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры	

&НаСервере
Процедура ОбновитьШапку()
	ПоляДоИзменения    = Новый Структура;
	ПоляПослеИзменения = Новый Структура;
	
	ПоляДоИзменения.Вставить("Контрагент",Неопределено);
	ПоляДоИзменения.Вставить("Договор",Неопределено);
	ПоляПослеИзменения.Вставить("Контрагент",Неопределено);
	ПоляПослеИзменения.Вставить("Договор",Неопределено); 
	//Евросиб Коханенко Н.А. 27.12.2024 (( #97950 
	ПоляДоИзменения.Вставить("ОриентировочнаяДатаМорскогоРейса",Неопределено);
	ПоляПослеИзменения.Вставить("ОриентировочнаяДатаМорскогоРейса",Неопределено);
	//Евросиб Коханенко Н.А. 27.12.2024 )) #97950 
	
	ЗаполнитьЗначенияСвойств(ПоляДоИзменения,Объект);
	ЗаполнитьШапку(Объект.Заявка);
	ЗаполнитьЗначенияСвойств(ПоляПослеИзменения,Объект);
	Для Каждого ПолеДоИзменения Из ПоляДоИзменения Цикл
		Если ПолеДоИзменения.Значение <> ПоляПослеИзменения[ПолеДоИзменения.Ключ] Тогда
			Если СписокРекОформленияШапки.НайтиПоЗначению(ПолеДоИзменения.Ключ) = Неопределено Тогда
				СписокРекОформленияШапки.Добавить(ПолеДоИзменения.Ключ);
			КонецЕсли;
			ЭтаФорма.Модифицированность = Истина;
		КонецЕсли;
	КонецЦикла;	
	
	УстановитьУсловноеОформлениеШапки(255,0,0);
	
КонецПроцедуры	

&НаСервере
Процедура ПроверитьИзменениеРеквизитаШапки(ИмяЭлемента,Значение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗапросНаАвтоперевозку."+ИмяЭлемента+" КАК ОриентировочнаяДатаМорскогоРейса
		|ИЗ
		|	Документ.ЗапросНаАвтоперевозку КАК ЗапросНаАвтоперевозку
		|ГДЕ
		|	ЗапросНаАвтоперевозку.Ссылка = &Ссылка
		|	И ЗапросНаАвтоперевозку."+ИмяЭлемента+" = &Парам";
	
	Запрос.УстановитьПараметр("Парам", Значение);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Если СписокРекОформленияШапки.НайтиПоЗначению(ИмяЭлемента) = Неопределено Тогда
			СписокРекОформленияШапки.Добавить(ИмяЭлемента);
		КонецЕсли;
	КонецЕсли;	
	
	УстановитьУсловноеОформлениеШапки(255,0,0);
		
КонецПроцедуры

&НаСервере
Процедура ПометитьНаОтменуНеОбработанныеСтроки(ПромежуточнаяКонтейнеры)
	СтруктураПоиска = Новый Структура("Обработана",Ложь);	
	
	НайденныеСтроки = ПромежуточнаяКонтейнеры.НайтиСтроки(СтруктураПоиска);
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		Если НайденнаяСтрока.СтатусЗапросаНаАвтоперевозку = Перечисления.СтатусЗапросаНаПеревозку.Отменен Тогда
			Продолжить;
		КонецЕсли;
		НайденнаяСтрока.СтатусЗапросаНаАвтоперевозку = Перечисления.СтатусЗапросаНаПеревозку.Отменен;
		НайденнаяСтрока.ОбновленыИсходныеДанные = Истина;
		ОбновитьТаблицуОформления("СтатусЗапросаНаАвтоперевозку","ИдентификаторСтрокиТЧ",НайденнаяСтрока.ИдентификаторСтрокиТЧ,"Контейнеры");
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Процедура ДобавитьСтрокуВПромежуточную(СтрокаСОбновлениями,ПромежуточнаяКонтейнеры)
	
	НовСтрока = ПромежуточнаяКонтейнеры.Добавить();
	ЗаполнитьЗначенияСвойств(НовСтрока,СтрокаСОбновлениями);	
	//НовСтрока.ИдентификаторСтрокиТЧ = Новый УникальныйИдентификатор();
	НовСтрока.СтатусЗапросаНаАвтоперевозку = Перечисления.СтатусЗапросаНаПеревозку.Черновик;	
	НовСтрока.Обработана = Истина;
	НовСтрока.ОбновленыИсходныеДанные = Истина;
	
КонецПроцедуры	

&НаСервере
Процедура НайтиСтрокиПоПолямИЗаполнить(СтруктураПоиска,СтрокаСОбновлениями,ПромежуточнаяКонтейнеры,КолНайденныхСтрок)
	
	КолНайденныхСтрок = 0;
	НайденныеСтроки = ПромежуточнаяКонтейнеры.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		
		Если НайденнаяСтрока.Обработана Тогда
			Продолжить;
		КонецЕсли;
		
		Если НайденнаяСтрока.СтатусЗапросаНаАвтоперевозку = Перечисления.СтатусЗапросаНаПеревозку.Отменен Тогда 
			// ДИТ US 79950 ТА 79951 Сержантова А.С. Начало: 27.02.2024
			НайденнаяСтрока.СтатусЗапросаНаАвтоперевозку = Перечисления.СтатусЗапросаНаПеревозку.Черновик;
			// ДИТ US 79950 ТА 79951 Сержантова А.С. Конец: 27.02.2024
			КолНайденныхСтрок = КолНайденныхСтрок + 1;
			НайденнаяСтрока.Обработана = Истина;
		КонецЕсли;
		
		ОбновитьСтроку(НайденнаяСтрока,СтрокаСОбновлениями);		
		Если НЕ ЗначениеЗаполнено(СтрокаСОбновлениями.ИдентификаторСтрокиУслуги) И ЗначениеЗаполнено(НайденнаяСтрока.ИдентификаторСтрокиУслуги) Тогда
			НайденнаяСтрока.Контейнер 		  = Справочники.ТЕ.ПустаяСсылка();
			НайденнаяСтрока.ИдентификаторСтрокиУслуги  = "";		
		КонецЕсли;		
		НайденнаяСтрока.Обработана = Истина;
		КолНайденныхСтрок = КолНайденныхСтрок + 1;
		
		Если ЗначениеЗаполнено(СтрокаСОбновлениями.ИдентификаторСтрокиУслуги) И ЗначениеЗаполнено(НайденнаяСтрока.ИдентификаторСтрокиУслуги) Тогда
			Продолжить;		
		КонецЕсли;
		
		Прервать;
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Процедура ОбновитьСтроку(НайденнаяСтрока,СтрокаСОбновлениями)

	ПоляДоИзменения    = Новый Структура;
	ПоляПослеИзменения = Новый Структура;
	
	МассивПерезаролняемыхПолей = Новый Массив;
	МассивПерезаролняемыхПолей.Добавить("Контейнер");
	МассивПерезаролняемыхПолей.Добавить("ТипКТК");
	МассивПерезаролняемыхПолей.Добавить("ТерминалВыдачи");
	МассивПерезаролняемыхПолей.Добавить("Груз");
	МассивПерезаролняемыхПолей.Добавить("ВесГрузаНетто");
	МассивПерезаролняемыхПолей.Добавить("КоличествоМест");
	МассивПерезаролняемыхПолей.Добавить("Релиз");
	МассивПерезаролняемыхПолей.Добавить("ТерминалСдачи"); //ДИТ Шевченко А.В. 60951 11.11.2022
	МассивПерезаролняемыхПолей.Добавить("ДатаВремяПодачиКТК"); // ДИТ US 81881 ТА 83581 Сержантова А.С. 09.04.2024
	МассивПерезаролняемыхПолей.Добавить("ИдентификаторСтрокиУслуги"); //Евросиб Коханенко Н.А. 16.12.2024 (( #97222 
	
	Для Каждого ТекКолонка Из МассивПерезаролняемыхПолей Цикл			
		ПоляДоИзменения.Вставить(ТекКолонка, Неопределено);
		ПоляПослеИзменения.Вставить(ТекКолонка, Неопределено)
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(ПоляДоИзменения,НайденнаяСтрока);
	ЗаполнитьЗначенияСвойств(ПоляПослеИзменения,СтрокаСОбновлениями);
	
	Если ЗначениеЗаполнено(НайденнаяСтрока.ИдентификаторСтрокиТЧ) Тогда
		СтруктураПоиска = Новый Структура("ИдентификаторСтрокиТЧ",НайденнаяСтрока.ИдентификаторСтрокиТЧ);
		НайденныеСтроки = ТаблицаОформленияКолонок.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда
			МассивПолейДляОформления = Новый Массив;	
		КонецЕсли;	
		Для Каждого СтрокаОформления Из НайденныеСтроки Цикл
			МассивПолейДляОформления = СтрРазделить(СтрокаОформления.ИменаКолонок,";");
		КонецЦикла;
	Иначе
		МассивПолейДляОформления = Новый Массив;
	КонецЕсли;	
	
	Для Каждого ПолеДоИзменения Из ПоляДоИзменения Цикл
		Если ПолеДоИзменения.Значение <> ПоляПослеИзменения[ПолеДоИзменения.Ключ] Тогда
			
			//Если Не ЗначениеЗаполнено(СтрокаСОбновлениями[ПолеДоИзменения.Ключ]) Тогда
			//		Продолжить;
			//КонецЕсли;
			Если ПолеДоИзменения.Ключ = "ИдентификаторСтрокиТЧ" Тогда	
				Продолжить;
			КонецЕсли;
			
			//ДИТ Шевченко А.В. 60951 11.11.2022 //Добавил ТерминалСдачи в условие  
			Если (ПолеДоИзменения.Ключ = "Груз" ИЛИ ПолеДоИзменения.Ключ = "ВесГрузаНетто" ИЛИ ПолеДоИзменения.Ключ = "КоличествоМест"  ИЛИ ПолеДоИзменения.Ключ = "ТерминалВыдачи" ИЛИ ПолеДоИзменения.Ключ = "ТерминалСдачи")
				И НЕ ЗначениеЗаполнено(СтрокаСОбновлениями[ПолеДоИзменения.Ключ]) Тогда
				Продолжить;
			КонецЕсли;  
			
			//// ДИТ US 81881 ТА 83581 Сержантова А.С. Начало: 15.04.2024
			Если Объект.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля и ПолеДоИзменения.Ключ = "ДатаВремяПодачиКТК" 
				И не ЗначениеЗаполнено(СтрокаСОбновлениями[ПолеДоИзменения.Ключ]) и ЗначениеЗаполнено(ПолеДоИзменения.Значение) Тогда
				Продолжить;
			КонецЕсли;  
			//// ДИТ US 81881 ТА 83581 Сержантова А.С. Конец: 15.04.2024
			
			Если ПолеДоИзменения.Ключ = "ТерминалВыдачи" И НайденнаяСтрока.НеТребуетсяТерминалВыдачи Тогда
				Продолжить;
			КонецЕсли;	
			
			//ДИТ Шевченко А.В. 60951 11.11.2022 -начало
			Если ПолеДоИзменения.Ключ = "ТерминалСдачи" И НайденнаяСтрока.НеТребуетсяТерминалСдачи Тогда
				Продолжить;
			КонецЕсли;
			//ДИТ Шевченко А.В. 60951 11.11.2022 -конец
			
			НайденнаяСтрока[ПолеДоИзменения.Ключ] = СтрокаСОбновлениями[ПолеДоИзменения.Ключ];
			Если НайденнаяСтрока.СтатусЗаказаНаТС = Перечисления.СтатусЗаказаНаТс.ВыданВРейс ИЛИ НайденнаяСтрока.СтатусЗаказаНаТС = Перечисления.СтатусЗаказаНаТс.Закрыт Тогда
				НайденнаяСтрока.СтатусЗаказаНаТСЗапрет = Истина;
			КонецЕсли;
			Если НайденнаяСтрока.СтатусЗапросаНаАвтоперевозку = Перечисления.СтатусЗапросаНаПеревозку.Отменен Тогда
				НайденнаяСтрока.СтатусЗаказаОтменен = Истина;
			КонецЕсли;	
			Если МассивПолейДляОформления.Найти(ПолеДоИзменения.Ключ) = Неопределено Тогда
				МассивПолейДляОформления.Добавить(ПолеДоИзменения.Ключ);                       
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	НайденнаяСтрока.СписокПолейКОформлению = СтрСоединить(МассивПолейДляОформления,";");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуОформления(ПолеОформления,ПолеУсловия,ЗначениеСравнения,ИмяТабличнойЧасти = "")
	
	ОбработкаОб = РеквизитФормыВЗначение("Объект");
	ОбработкаОб.ОбновитьТаблицуОформленияДокумента(ТаблицаОформленияКолонок,ПолеОформления,ЗначениеСравнения);	
	
	УстановитьЦветИзменения(ПолеОформления,ПолеУсловия,ЗначениеСравнения,ИмяТабличнойЧасти,Новый Цвет(250, 0, 0));
	
КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокуИзТаблицыОформления(ПолеОформления,ПолеУсловия,ЗначениеСравнения,ИмяТабличнойЧасти = "")
	СтруктураПоиска = Новый Структура("ИдентификаторСтрокиТЧ",ЗначениеСравнения);
	НайденныеСтроки = ТаблицаОформленияКолонок.НайтиСтроки(СтруктураПоиска);
	Для Каждого СтрокаОформления Из НайденныеСтроки Цикл
		МассивПолейТаблицы = СтрРазделить(СтрокаОформления.ИменаКолонок,";");
		ПолеНайдено = МассивПолейТаблицы.Найти(ПолеОформления);
		Если ПолеНайдено <> Неопределено Тогда
			МассивПолейТаблицы.Удалить(ПолеНайдено);
		КонецЕсли;	
		СтрокаОформления.ИменаКолонок = СтрСоединить(МассивПолейТаблицы,";");
	КонецЦикла;
	
	Если СтрокаОформления.ИменаКолонок = "" Тогда
		ТаблицаОформленияКолонок.Удалить(СтрокаОформления);
	КонецЕсли;	
	
	УстановитьЦветИзменения(ПолеОформления,ПолеУсловия,ЗначениеСравнения,ИмяТабличнойЧасти,Новый Цвет(0, 0, 0))
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьУсловноеОформлениеТЧ()
	
	УсловноеОформление.Элементы.Очистить();	
	
	Для Каждого СтрокаОформления Из ТаблицаОформленияКолонок Цикл
		МассивПолей = СтрРазделить(СтрокаОформления.ИменаКолонок,";");
		Для Каждого МассивЗнч Из МассивПолей Цикл
			УстановитьЦветИзменения(МассивЗнч,"ИдентификаторСтрокиТЧ",СтрокаОформления.ИдентификаторСтрокиТЧ,"Контейнеры",Новый Цвет(250, 0, 0))	
		КонецЦикла;	
	КонецЦикла;
	
	УстановитьТолькоПросмотрПоСтатусуЗаказа();
	УстановитьОформлениеДляПолейНеТребуется(); 
	
	// ДИТ US 78233 ТА 78240 Сержантова А.С. Начало: 28.12.2023
	УстановитьПодсветкуСтрокПоИзменениям();
	// ДИТ US 78233 ТА 78240 Сержантова А.С. Конец: 28.12.2023 
	
	//// ДИТ US 79379 Сержантова А.С. Начало: 18.03.2024 
	//ЭлементУО = УсловноеОформление.Элементы.Добавить(); 
	//ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("КонтейнерыКонтейнерФакт");  
	//ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("КонтейнерыНаименованиеКомпанииАвтоперевозчика");
	//ОтборЭлемента = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Контейнеры.НомерЗаказаНаТС");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;  
	//ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина); 
	//// ДИТ US 79379 Сержантова А.С. Конец: 18.03.2024   
	
	// ДИТ US 82176 ТА 82559 Сержантова А.С. Начало: 27.03.2024 - группа данных из ТЛ, блокируем если заполнены
	МассивИмен = Новый Массив;	
	ИмяПодчиненногоЭлемента(Элементы.КонтейнерыГруппа8.ПодчиненныеЭлементы,МассивИмен);
	Для каждого ИмяЭлемента Из МассивИмен Цикл  
		Если СтрНайти(ИмяЭлемента, "Группа") <> 0 Тогда
			Продолжить;
		КонецЕсли;
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ИмяПоляТаблицы = Прав(ИмяЭлемента,СтрДлина(ИмяЭлемента)- 10);
		ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ИмяЭлемента);  
		ОтборЭлемента = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Контейнеры." + ИмяПоляТаблицы);
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;  
		
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	КонецЦикла;
	// ДИТ US 82176 ТА 82559 Сержантова А.С. Конец: 27.03.2024
КонецПроцедуры      

// ДИТ US 78233 ТА 78240 Сержантова А.С. 28.12.2023
&НаСервере
Процедура УстановитьПодсветкуСтрокПоИзменениям()

	МассивИмен = Новый Массив;	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();	
	ИмяПодчиненногоЭлемента(Элементы.Контейнеры.ПодчиненныеЭлементы,МассивИмен);
	Для Каждого МассивИмя Из МассивИмен Цикл
		ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(МассивИмя);
	КонецЦикла;  
	
	ГруппаОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ; 
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Контейнеры.ВерсияКлючаАналитикиОтправленоВТЛ");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Контейнеры.ОбновленыИсходныеДанные");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;  
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ЖелтоЗеленый);

КонецПроцедуры

&НаСервере
Процедура УстановитьПросмотрСтатусОтправкиЗапросаНаТерминалВыдачи(МассивКлючей=Неопределено,УстановитьТолькоПризнакПросмотра = Истина,НовоеЗначение = Неопределено) //ДИТ Шевченко А.В. US 62487 ТА 68012 04.05.2023
	
	Если МассивКлючей = Неопределено Тогда
		МассивКлючей = Объект.Контейнеры.Выгрузить(,"КлючАналитикиПеревозки").ВыгрузитьКолонку("КлючАналитикиПеревозки");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлючиАналитикиПеревозки.Контейнер КАК Контейнер,
		|	КлючиАналитикиПеревозки.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_КлючКонтейнер
		|ИЗ
		|	Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
		|ГДЕ
		|	КлючиАналитикиПеревозки.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
		|	И  КлючиАналитикиПеревозки.Ссылка В (&МассивКлючей)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КлючКонтейнер.Ссылка КАК Ссылка,
		|	ВТ_КлючКонтейнер.Контейнер КАК Контейнер,
		|	стоки_ТекущиеДанныеСрезПоследних.тек_ВидСобственности КАК тек_ВидСобственности
		|ИЗ
		|	ВТ_КлючКонтейнер КАК ВТ_КлючКонтейнер
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные.СрезПоследних КАК стоки_ТекущиеДанныеСрезПоследних
		|		ПО ВТ_КлючКонтейнер.Контейнер = стоки_ТекущиеДанныеСрезПоследних.КТК";
	
	Запрос.УстановитьПараметр("МассивКлючей",МассивКлючей);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПринадлежностьТЕ = АРМ_Сервер.ОпределитьПринадлежностьПоВидуСобственности(ВыборкаДетальныеЗаписи.тек_ВидСобственности);
		СтруктураПоискаСтроки = Новый Структура("КлючАналитикиПеревозки",ВыборкаДетальныеЗаписи.Ссылка);
		НайденнаяСтрока = Объект.Контейнеры.НайтиСтроки(СтруктураПоискаСтроки);
		
		НайденнаяСтрока[0].УсловияДоступностиСтатусаОтправкиЗапросаНаТерминалВыдачи = Объект.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля И ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТЕвросиба;
		НайденнаяСтрока[0].УсловияДоступностиСтатусаОтправкиЗапросаНаТерминалВыдачи = Объект.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля И ЗначениеЗаполнено(НайденнаяСтрока[0].Релиз) и НЕ Пользователи.РолиДоступны("ПолныеПрава",, Ложь);
		
		Если НЕ УстановитьТолькоПризнакПросмотра И НЕ НайденнаяСтрока[0].УсловияДоступностиСтатусаОтправкиЗапросаНаТерминалВыдачи Тогда
			НайденнаяСтрока[0].СтатусОтправкиЗапросаНаТерминалВыдачи = НовоеЗначение;
		КонецЕсли
		
	КонецЦикла;
КонецПроцедуры	

&НаСервере
Процедура УстановитьТолькоПросмотрПоСтатусуЗаказа()
	СписокСтатусов = Новый СписокЗначений;
	СписокСтатусов.Добавить(Перечисления.СтатусЗаказаНаТс.ВыданВРейс);
	СписокСтатусов.Добавить(Перечисления.СтатусЗаказаНаТс.Закрыт);
	МассивИмен = Новый Массив;	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();	
	ИмяПодчиненногоЭлемента(Элементы.Контейнеры.ПодчиненныеЭлементы,МассивИмен);
	Для Каждого МассивИмя Из МассивИмен Цикл
		ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(МассивИмя);
	КонецЦикла;
	ГруппаОтбора1 = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Контейнеры.СтатусЗаказаНаТС");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = СписокСтатусов;
	
	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Контейнеры.СтатусЗапросаНаАвтоперевозку");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.СтатусЗапросаНаПеревозку.Отменен;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Начало: 21.12.2023
	Если не Пользователи.РолиДоступны("ПолныеПрава") Тогда       
		ЭлементУО = УсловноеОформление.Элементы.Добавить();    
		ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("КонтейнерыСтатусЗапросаНаАвтоперевозку"); 
		ОтборЭлемента = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Контейнеры.СтатусЗапросаНаАвтоперевозку");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;  
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина); 	
	КонецЕсли;
	// ДИТ US 76935 ТА 78648 Сержантова А.С. Конец: 21.12.2023
КонецПроцедуры

&НаСервере
Процедура ИмяПодчиненногоЭлемента(ПодчиненныеЭлементы,МассивИмен)
	Для Каждого Элем Из ПодчиненныеЭлементы Цикл
		Если Элем.Имя = "КонтейнерыОтметка" Тогда
			Продолжить;
		КонецЕсли;
		МассивИмен.Добавить(Элем.Имя);
		Если ТипЗнч(Элем) = Тип("ГруппаФормы") Тогда
			ИмяПодчиненногоЭлемента(Элем.ПодчиненныеЭлементы,МассивИмен);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры	

&НаСервере
Процедура УстановитьОформлениеДляПолейНеТребуется()
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("КонтейнерыТерминалВыдачи");
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("КонтейнерыТипОперацииНаТерминалеВыдачи");
	
	ОтборЭлемента = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Контейнеры.НеТребуетсяТерминалВыдачи");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "Не требуется");
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("КонтейнерыТерминалСдачи");
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("КонтейнерыТипОперацииНаТерминалеСдачи");
	
	ОтборЭлемента = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Контейнеры.НеТребуетсяТерминалСдачи");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "Не требуется");
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	//ДИТ Шевченко А.В. US 62421 ТА 67386 18.05.2023 -Начало
	//ЭлементУО = УсловноеОформление.Элементы.Добавить();
	//ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	//Если КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.Количество() = 0 Тогда
	//	Возврат;
	//КонецЕсли;	
	//ИмяПоля = КонтактнаяИнформацияОписаниеДополнительныхРеквизитов[0].ИмяРеквизита;
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("КонтейнерыАдресКлиента");
	//ДИТ Шевченко А.В. US 62421 ТА 67386 18.05.2023 -Конец
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("КонтейнерыТипОперацииНаСкладеКлиента");
	
	ОтборЭлемента = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Контейнеры.НеТребуетсяАдрес");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "Не требуется");
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеШапки(Красный=0,Зеленый=0,Синий=0)
	ЦветПодсветки = Новый Цвет(Красный, Зеленый, Синий);
	Для Каждого СписокЗнч Из СписокРекОформленияШапки Цикл 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, СписокЗнч.Значение, "ЦветТекстаЗаголовка", ЦветПодсветки);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, СписокЗнч.Значение, "ЦветТекста", ЦветПодсветки);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, СписокЗнч.Значение, "ЦветРамки", ЦветПодсветки);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполниитьПоУпрощенномуАлгоритму(ИтоговаяТаблица,ТаблицаУслуг)
	Для Каждого СтрокаТчУслуга Из ТаблицаУслуг Цикл	
			НовСтрока = ИтоговаяТаблица.Добавить(); 
			ЗаполнитьЗначенияСвойств(НовСтрока,СтрокаТчУслуга);
			НовСтрока.ТерминалСдачи = ПолучитьТерминалСдачиПоСтокуСдачиИзРелиза(СтрокаТчУслуга.СтокСдачи); //ДИТ Шевченко А.В. 60951 11.11.2022
			НовСтрока.СтатусЗапросаНаАвтоперевозку = Перечисления.СтатусЗапросаНаПеревозку.Черновик;
			НовСтрока.СтатусОтправкиЗапросаНаТерминалВыдачи = Перечисления.СтатусОтправкиЗапросаНаТерминалВыдачи.НеОтправлен; //ДИТ Шевченко А.В. US 62487 ТА 68012 04.05.2023
	КонецЦикла;
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьСлужебныеСообщения() //ДИТ Шевченко А.В. 59965 28.11.22
	
	ЕстьНаВыполнении = Ложь;
	МассивНомеровСтрок = новый Массив;
	Для Каждого СтрокаС Из Объект.Состояния Цикл
		Если СтрокаС.Состояние = Справочники.Состояния.ПередатьКлиентуДанныеПоАвтоперевозке Тогда
			Если СтрокаС.Статус = Перечисления.СтатусыЭтапов.НаВыполнение Тогда
				ЕстьНаВыполнении = Истина;
				Прервать;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	
	Если ЕстьНаВыполнении Тогда
		МассивНомеровСтрок = ПолучитьНомераСтрокДляПередачиКлиентуДанныхПоАвтоперевозке();	
	КонецЕсли;	

	Если МассивНомеровСтрок.Количество() > 0 Тогда
		СтрСообщение = СтрШаблон("По строке %1 появились/изменились данные по автоперевозке, необходимо направить информацию клиенту, сформировав печатную форму запроса на автоперевозку",СтрСоединить(МассивНомеровСтрок,","));
		Элементы.СлужебныеСообщения.Заголовок = СтрСообщение;
		Элементы.СлужебныеСообщения.Видимость = Истина;
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьНомераСтрокДляПередачиКлиентуДанныхПоАвтоперевозке()
	
	МассивНомеровСтрок = Новый Массив;
	
	МассивКолонокДляПроверки = Новый Массив;
	МассивКолонокДляПроверки.Добавить("Перевозчик");
	МассивКолонокДляПроверки.Добавить("НомерАвто");
	МассивКолонокДляПроверки.Добавить("ПаспортныеДанные");
	МассивКолонокДляПроверки.Добавить("ФИОВодителя");
		
	СтруктураПоиска = Новый Структура("СтатусЗаказаНаТС",Перечисления.СтатусЗаказаНаТс.ГотовКВыдачеВРейс);
	НайденныеСтроки = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска);
	Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
		ОбЗапрос = РеквизитФормыВЗначение("Объект");
		ПринадлежностьТЕ = ОбЗапрос.ПолучитьПринадлежностьТЕКТКПоЗаявке(Объект.Заявка,СтрокаТЧ.КлючАналитикиПеревозки.Контейнер,СтрокаТЧ.ИдентификаторСтрокиУслуги);
		Если ПринадлежностьТЕ = Неопределено ИЛИ ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТЕвросиба Тогда
			Продолжить;
		КонецЕсли;			
		СтруктураПоиска = Новый Структура("ИдентификаторСтрокиТЧ",СтрокаТч.ИдентификаторСтрокиТЧ);
		НайденныеСтрокиОфор = ТаблицаОформленияКолонок.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтрокиОфор.Количество() > 0 Тогда
			МассивКолонок = СтрРазделить(НайденныеСтрокиОфор[0].ИменаКолонок,";");
			Для Каждого ПолеПроверки Из МассивКолонокДляПроверки Цикл
				Если МассивКолонок.Найти(ПолеПроверки) <> Неопределено Тогда
					МассивНомеровСтрок.Добавить(СтрокаТЧ.НомерСтроки);
					Прервать;
				КонецЕсли;	
			КонецЦикла;		
		КонецЕсли;				
	КонецЦикла;
	
	Возврат МассивНомеровСтрок;
	
КонецФункции	

&НаКлиенте
Функция ПолучитьМассивПроверкиКолонокТС()
	
	МассивПроверкиКолонокТС = Новый Массив;
	МассивПроверкиКолонокТС.Добавить("НомерЗаказаНаТС");
	МассивПроверкиКолонокТС.Добавить("СтатусЗаказаНаТС");
	МассивПроверкиКолонокТС.Добавить("ДатаСозданияЗаказаНаТС");
	МассивПроверкиКолонокТС.Добавить("НомерАвто");
	МассивПроверкиКолонокТС.Добавить("НомерПрицепа");
	МассивПроверкиКолонокТС.Добавить("ФИОВодителя");
	МассивПроверкиКолонокТС.Добавить("ПаспортныеДанные");
	МассивПроверкиКолонокТС.Добавить("Перевозчик");
	МассивПроверкиКолонокТС.Добавить("КонтейнерФакт");
	МассивПроверкиКолонокТС.Добавить("ДатаИВремяВывоза");
	МассивПроверкиКолонокТС.Добавить("ДатаИВремяСдачи");
	МассивПроверкиКолонокТС.Добавить("ДатаЗавершенияОперацииНаСкладеКлиента");
	МассивПроверкиКолонокТС.Добавить("ИтоговаяСтоимостьПеревозки");	
	
	Возврат МассивПроверкиКолонокТС;
	
КонецФункции	

&НаКлиенте
Процедура ПослеЗакрытияВопросаСнятииОформленияКолонокТС(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет или Результат = КодВозвратаДиалога.Таймаут Тогда
		Параметры.ПараметрыЗаписи.Вставить("ПропуститьВопросПоОформлению",Истина);
		Записать(Параметры.ПараметрыЗаписи);
	Иначе
		
		МассивПроверкиКолонокТС = ПолучитьМассивПроверкиКолонокТС();
		МассивУдлСтрокОформлени = Новый Массив;	
		Для Каждого СтрокаОф Из ТаблицаОформленияКолонок Цикл
			МассивОформленныхКолонок = СтрРазделить(СтрокаОф.ИменаКолонок,";");
			НовыйМассивОформленныхКолонок = Новый Массив;
			Для Каждого ЭлМассива Из МассивОформленныхКолонок Цикл	
				Если МассивПроверкиКолонокТС.Найти(ЭлМассива) = Неопределено Тогда
					НовыйМассивОформленныхКолонок.Добавить(ЭлМассива);	
				КонецЕсли;
			КонецЦикла;
			Если НовыйМассивОформленныхКолонок.Количество() = 0 Тогда
				МассивУдлСтрокОформлени.Добавить(СтрокаОф);
			КонецЕсли;	
			СтрокаОф.ИменаКолонок = СтрСоединить(НовыйМассивОформленныхКолонок,";");
		КонецЦикла;
		
		Для Каждого СтрУд Из МассивУдлСтрокОформлени Цикл
			ТаблицаОформленияКолонок.Удалить(СтрУд);
		КонецЦикла;	
		
		Параметры.ПараметрыЗаписи.Вставить("ПропуститьВопросПоОформлению",Истина);
		Записать(Параметры.ПараметрыЗаписи);
		УстановитьУсловноеОформлениеТЧ();
	КонецЕсли;
КонецПроцедуры	

#КонецОбласти    

#Область ОбработчикиСобытийКонтактнаяИнформация
// СтандартныеПодсистемы.КонтактнаяИнформация
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
        УправлениеКонтактнойИнформациейКлиент.ПриИзменении(ЭтотОбъект, Элемент);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриНажатии(Элемент, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.Очистка(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
    УправлениеКонтактнойИнформациейКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда.Имя);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент.Имя, СтандартнаяОбработка);
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ОбновитьКонтактнуюИнформацию(Результат)
    УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, Результат);
	//СравнитьКонтактнуюИнформациюНаИзменение(); //ДИТ Шевченко А.В. 66106 03.10.2022
КонецПроцедуры

// Конец СтандартныеПодсистемы.КонтактнаяИнформация
#КонецОбласти

#Область староеНеИспользоватьУдалить
&НаСервере
Процедура ОтправитьЗапросВИСТранспортнаяЛогистикаНаСервере(АдресФайлаВоВременномХранилище)
	Расширение = ".xml";
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайла,"UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML(); 
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Document");  
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xs", "http://www.w3.org/2001/XMLSchema");  
	
	ОписаниеСтрока=Новый ОписаниеТипов("Строка");
	
	ТЗ_XML = Новый ТаблицаЗначений; 
	ТЗ_XML.Колонки.Добавить("Inn", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("OrgName", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("Status", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("Client", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("ClientName", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("Contract", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("ContractName", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("EstimDateRailway", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("EstimDateSail", ОписаниеСтрока); 
	ТЗ_XML.Колонки.Добавить("QueryGuid", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("DocStatus", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("ContainerDateTime", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("Container", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("ContainerType", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("GateOutContainerTerminalCode", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("GateOutContainerTerminal", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("GateOutTerminalOperationType", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("ClientAddress", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("ClientOperationType", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("GateInContainerTerminal", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("GateInContainerTerminalCode", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("GateInTerminalOperationType", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("Belonging", ОписаниеСтрока); 
	ТЗ_XML.Колонки.Добавить("ShippingCode", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("ShippingName", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("NetWeight", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("PlacesCount", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("TempMode", ОписаниеСтрока);  
	ТЗ_XML.Колонки.Добавить("Forwarding", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("Info", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("RoadCost", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("Vat", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("ReleaseNumEurosib", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("ReleaseNumClient", ОписаниеСтрока);  
	ТЗ_XML.Колонки.Добавить("ReqNumber", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("ReqDate", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("DocumentOperationType", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("Author", ОписаниеСтрока);
	ТЗ_XML.Колонки.Добавить("CargoDetails", ОписаниеСтрока);
	
		ЗапросXML = Новый Запрос;
		ЗапросXML.Текст = 
			"ВЫБРАТЬ
			|	ПротоколОбменов.УИДИсточника КАК УИДИсточника
			|ИЗ
			|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
			|ГДЕ
			|	ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс)
			|	И ПротоколОбменов.Объект = &Объект";
		
		ЗапросXML.УстановитьПараметр("Объект", Объект.Организация);
		РезультатЗапросаXML = ЗапросXML.Выполнить();
		ВыборкаДетальныеЗаписиXML = РезультатЗапросаXML.Выбрать();
		ЗначениеБитФинанс_Организация="";
		Если ВыборкаДетальныеЗаписиXML.Следующий() Тогда
			ЗначениеБитФинанс_Организация=ВыборкаДетальныеЗаписиXML.УИДИсточника;
		Иначе
			Сообщить("Не найдена организация по ГУИД БитФинанс: "+Строка(Объект.Организация));
		КонецЕсли;  
		
		ЗапросXML = Новый Запрос;
		ЗапросXML.Текст = 
			"ВЫБРАТЬ
			|	ПротоколОбменов.УИДИсточника КАК УИДИсточника
			|ИЗ
			|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
			|ГДЕ
			|	ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс)
			|	И ПротоколОбменов.Объект = &Объект";
		
		ЗапросXML.УстановитьПараметр("Объект", Объект.Контрагент);
		РезультатЗапросаXML = ЗапросXML.Выполнить();
		ВыборкаДетальныеЗаписиXML = РезультатЗапросаXML.Выбрать();
		ЗначениеБитФинанс_Контрагент="";
		Если ВыборкаДетальныеЗаписиXML.Следующий() Тогда
			ЗначениеБитФинанс_Контрагент=ВыборкаДетальныеЗаписиXML.УИДИсточника;
		Иначе
			Сообщить("Не найден контрагент по ГУИД БитФинанс: "+Строка(Объект.Контрагент));
		КонецЕсли;  
		
		ЗапросXML = Новый Запрос;
		ЗапросXML.Текст = 
			"ВЫБРАТЬ
			|	ПротоколОбменов.УИДИсточника КАК УИДИсточника
			|ИЗ
			|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
			|ГДЕ
			|	ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.БитФинанс)
			|	И ПротоколОбменов.Объект = &Объект";
		
		ЗапросXML.УстановитьПараметр("Объект", Объект.Договор);
		РезультатЗапросаXML = ЗапросXML.Выполнить();
		ВыборкаДетальныеЗаписиXML = РезультатЗапросаXML.Выбрать();
		ЗначениеБитФинанс_Договор="";
		Если ВыборкаДетальныеЗаписиXML.Следующий() Тогда
			ЗначениеБитФинанс_Договор=ВыборкаДетальныеЗаписиXML.УИДИсточника;
		Иначе
			Сообщить("Не найден договор по ГУИД БитФинанс: "+Строка(Объект.Договор));
		КонецЕсли;  
		
		НомерДокумента=Объект.Номер;  
		ДатаДокумента=Объект.Дата;
		ОрганизацияНаименование=Объект.Организация.Наименование;
		КонтрагентНаименование=Объект.Контрагент.Наименование;  
		ДоговорНаименование=Объект.Договор.Наименование;  
		ОриентировочнаяДатаЖДРейса=Объект.ОриентировочнаяДатаЖДРейса;  
		ОриентировочнаяДатаМорскогоРейса=Объект.ОриентировочнаяДатаМорскогоРейса;  
		ТЧ_КонтактнаяИнформация=Объект.КонтактнаяИнформация;  
		ЭтапПеревозки=Объект.ЭтапПеревозки;   
		АвторНаименование=Объект.Автор.Наименование;
		
	Для Каждого СтрокаКонтейнеры Из Объект.Контейнеры Цикл 
		
		НоваяСтрокаТЗ_XML=ТЗ_XML.Добавить();
		
		НоваяСтрокаТЗ_XML.Inn=СокрЛП(ЗначениеБитФинанс_Организация);
		НоваяСтрокаТЗ_XML.OrgName=СокрЛП(ОрганизацияНаименование);
		НоваяСтрокаТЗ_XML.Status=СокрЛП("Новый");
		НоваяСтрокаТЗ_XML.Client=СокрЛП(ЗначениеБитФинанс_Контрагент);
		НоваяСтрокаТЗ_XML.ClientName=СокрЛП(КонтрагентНаименование);
		НоваяСтрокаТЗ_XML.Contract=СокрЛП(ЗначениеБитФинанс_Договор);
		НоваяСтрокаТЗ_XML.ContractName=СокрЛП(ДоговорНаименование);
		НоваяСтрокаТЗ_XML.EstimDateRailway=СокрЛП(ОриентировочнаяДатаЖДРейса);
		НоваяСтрокаТЗ_XML.EstimDateSail=СокрЛП(ОриентировочнаяДатаМорскогоРейса); 
		НоваяСтрокаТЗ_XML.QueryGuid=СокрЛП(СтрокаКонтейнеры.ИдентификаторСтрокиТабличнойЧасти);
		НоваяСтрокаТЗ_XML.DocStatus=СокрЛП(СтрокаКонтейнеры.СтатусЗапросаНаАвтоперевозку);
		НоваяСтрокаТЗ_XML.ContainerDateTime=СокрЛП(СтрокаКонтейнеры.ДатаВремяПодачиКТК);
		НоваяСтрокаТЗ_XML.Container=СокрЛП(СтрокаКонтейнеры.КонтейнерФакт);
		НоваяСтрокаТЗ_XML.ContainerType=СокрЛП(СтрокаКонтейнеры.ТипКТК.РазмерКТК);
		НоваяСтрокаТЗ_XML.GateOutContainerTerminalCode=СокрЛП(СтрокаКонтейнеры.ТерминалВыдачи.Код);
		НоваяСтрокаТЗ_XML.GateOutContainerTerminal=СокрЛП(СтрокаКонтейнеры.ТерминалВыдачи.Наименование);
		НоваяСтрокаТЗ_XML.GateOutTerminalOperationType=СокрЛП(СтрокаКонтейнеры.ТипОперацииНаТерминалеВыдачи);
		
			СтруктураДляПоиска = Новый Структура;
			СтруктураДляПоиска.Вставить("ИдентификаторСтрокиТабличнойЧасти",СтрокаКонтейнеры.ИдентификаторСтрокиТабличнойЧасти);
			МассивСтрокКИ = ТЧ_КонтактнаяИнформация.НайтиСтроки(СтруктураДляПоиска);
			СтрокаКонтактнаяИнформацияJSON="";
			Если МассивСтрокКИ.Количество()>0 Тогда  
				СтрокаКИ=МассивСтрокКИ[0];
				СтруктураДляJSON = Новый Структура();
				СтруктураДляJSON.Вставить("Тип",СокрЛП(СтрокаКИ.Тип));
				СтруктураДляJSON.Вставить("Вид",СокрЛП(СтрокаКИ.Вид));  
				СтруктураДляJSON.Вставить("Представление",СокрЛП(СтрокаКИ.Представление));
				СтруктураДляJSON.Вставить("Значение",СокрЛП(СтрокаКИ.Значение));
				СтруктураДляJSON.Вставить("Страна",СокрЛП(СтрокаКИ.Страна));
				СтруктураДляJSON.Вставить("Регион",СокрЛП(СтрокаКИ.Регион));
				СтруктураДляJSON.Вставить("Город",СокрЛП(СтрокаКИ.Город));
				СтруктураДляJSON.Вставить("АдресЭП",СокрЛП(СтрокаКИ.АдресЭП));  
				СтруктураДляJSON.Вставить("ДоменноеИмяСервера",СокрЛП(СтрокаКИ.ДоменноеИмяСервера));
				СтруктураДляJSON.Вставить("НомерТелефона",СокрЛП(СтрокаКИ.НомерТелефона));
				СтруктураДляJSON.Вставить("НомерТелефонаБезКодов",СокрЛП(СтрокаКИ.НомерТелефонаБезКодов));
				СтруктураДляJSON.Вставить("ЗначенияПолей",СокрЛП(СтрокаКИ.ЗначенияПолей));
				ЗаписьJSON = Новый ЗаписьJSON;			
				ЗаписьJSON.УстановитьСтроку();
				ЗаписатьJSON(ЗаписьJSON,СтруктураДляJSON);			
				СтрокаКонтактнаяИнформацияJSON = ЗаписьJSON.Закрыть();	
			Иначе
				СтрокаКонтактнаяИнформацияJSON="";
			КонецЕсли;
		
		НоваяСтрокаТЗ_XML.ClientAddress=СокрЛП(СтрокаКонтактнаяИнформацияJSON);
		НоваяСтрокаТЗ_XML.ClientOperationType=СокрЛП(СтрокаКонтейнеры.ТипОперацииНаСкладеКлиента);
		НоваяСтрокаТЗ_XML.GateInContainerTerminal=СокрЛП(СтрокаКонтейнеры.ТерминалСдачи.Наименование);
		НоваяСтрокаТЗ_XML.GateInContainerTerminalCode=СокрЛП(СтрокаКонтейнеры.ТерминалСдачи.Код);
		НоваяСтрокаТЗ_XML.GateInTerminalOperationType=СокрЛП(СтрокаКонтейнеры.ТипОперацииНаТерминалеСдачи);
		НоваяСтрокаТЗ_XML.Belonging=СокрЛП("Привлеченный");
		НоваяСтрокаТЗ_XML.ShippingCode=СокрЛП(СтрокаКонтейнеры.Груз.ЕТСНГ);
		НоваяСтрокаТЗ_XML.ShippingName=СокрЛП(СтрокаКонтейнеры.Груз.Наименование);
		НоваяСтрокаТЗ_XML.NetWeight=СокрЛП(СтрокаКонтейнеры.ВесГрузаНетто);
		НоваяСтрокаТЗ_XML.PlacesCount=СокрЛП(СтрокаКонтейнеры.КоличествоМест);
		НоваяСтрокаТЗ_XML.TempMode=СокрЛП(СтрокаКонтейнеры.ТемпературныйРежим);  
		НоваяСтрокаТЗ_XML.Forwarding=СокрЛП(СтрокаКонтейнеры.Экспедирование);
		НоваяСтрокаТЗ_XML.Info=СокрЛП(СтрокаКонтейнеры.ДополнительнаяИнформация);
		НоваяСтрокаТЗ_XML.RoadCost=СокрЛП(СтрокаКонтейнеры.СтоимостьАвтоперевозкиЗаложеннаяПриРасчете);
		НоваяСтрокаТЗ_XML.Vat=СокрЛП(СтрокаКонтейнеры.СтавкаНДС);
		НоваяСтрокаТЗ_XML.ReleaseNumEurosib=СокрЛП(СтрокаКонтейнеры.Релиз.НомерРелиза);
		НоваяСтрокаТЗ_XML.ReleaseNumClient=СокрЛП(СтрокаКонтейнеры.НомерРелизаОтКлиентаТерминала);  
		НоваяСтрокаТЗ_XML.ReqNumber=СокрЛП(НомерДокумента);
		НоваяСтрокаТЗ_XML.ReqDate=СокрЛП(ДатаДокумента);
		НоваяСтрокаТЗ_XML.DocumentOperationType=СокрЛП(ЭтапПеревозки);
		НоваяСтрокаТЗ_XML.Author=СокрЛП(АвторНаименование);
		НоваяСтрокаТЗ_XML.CargoDetails=СокрЛП(СтрокаКонтейнеры.Груз)+","+СокрЛП(СтрокаКонтейнеры.ВесГрузаНетто)+","+СокрЛП(СтрокаКонтейнеры.КоличествоМест);	
	
	КонецЦикла;
	
	РезультатXML=ОбщегоНазначения.ЗначениеВСтрокуXML(ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЗ_XML));
	ЗаписьXML.ЗаписатьТекст(РезультатXML);
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.Закрыть();
	
	Файл = Новый Файл(ИмяВременногоФайла);	
	Если Файл.Существует() Тогда		
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
		АдресФайлаВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
		УдалитьФайлы(ИмяВременногоФайла);		
	КонецЕсли;
КонецПроцедуры  
&НаКлиенте
Процедура ОтправитьЗапрос()
	Если НЕ ОтправкаВозможна() Тогда
		Возврат;
	КонецЕсли;		
	АдресФайлаВоВременномХранилище = "";
	ОтправитьЗапросВИСТранспортнаяЛогистикаНаСервере(АдресФайлаВоВременномХранилище);
	ПолучитьФайл(АдресФайлаВоВременномХранилище, "Выгрузка.xml");
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийПодключаемыеКоманды
//ДИТ Шевченко А.В. US 62492 ТА 68150 25.04.2023 -начало
&НаКлиенте 
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтаФорма,Команда,Объект);
	ЭтаФорма.Прочитать();
КонецПроцедуры  

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

//ДИТ Шевченко А.В. US 62492 ТА 68150 25.04.2023 -конец
#КонецОбласти

//БИТ Белинский Д.А. 10.04.2023 -начало
&НаСервере
Процедура УстановитьВидимостьПолейПоДирекцииКонтенерныхПеревозок()  
	
	ВидимостьЭлементов = Истина;
	Если ЭтоДирекцияКонтейнерныхПеревозок() Тогда 
		ВидимостьЭлементов = Ложь;	
	КонецЕсли;
	Элементы.КонтейнерыГруппа5.Видимость = ВидимостьЭлементов;
	Элементы.КонтейнерыГруз.Видимость = ВидимостьЭлементов;
	//Элементы.КонтейнерыГруппа17.Видимость = ВидимостьЭлементов;
	Элементы.КонтейнерыЭкспедирование.Видимость = ВидимостьЭлементов;

КонецПроцедуры

&НаСервере
Функция ЭтоДирекцияКонтейнерныхПеревозок()  
	
	Результат = Ложь;
	Если Объект.Контрагент = Константы.КонтрагентДирекцияКонтейнерныхПеревозок.Получить() Тогда 
		Результат = Истина;	
	КонецЕсли;             
	
	Возврат Результат;

КонецФункции
//БИТ Белинский Д.А. 10.04.2023 -конец

&НаКлиенте
Процедура КонтейнерыАдресКлиентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	//ПараметрыОткрытияФормы = Новый Структура;
	//ПараметрыОткрытияФормы.Вставить("Режим", "СозданиеСВыборомНаселенногоПункта");
	////ПараметрыОткрытияФормы.Вставить("Локация", Элементы.Список.ТекущаяСтрока);
	//ПараметрыОткрытияФормы.Вставить("Локация", Неопределено);
	//ПараметрыОткрытияФормы.Вставить("АдресВЛокации", ДанныеВыбора);
	////ПараметрыОткрытияФормы.Вставить("РежимВыбора", Истина);

	// ОткрытьФорму("Справочник.АдресаВНаселенныхПунктах.Форма.ФормаПодбораАдреса", ПараметрыОткрытияФормы,Элемент);
	//Евросиб - АСуслов 14.07.2023 12:31:15 #локации
	//(
	СтандартнаяОбработка = Ложь;
	ТипыЛокацийМассив = Новый Массив;
	ТипыЛокацийМассив.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.АдресВНаселенномПункте"));
	ОткрытьФорму("Справочник.Локации.ФормаВыбора", Новый Структура("МножественныйВыбор, ПоказыватьВыборАдреса, Отбор", Ложь, Истина, Новый Структура("Тип", ТипыЛокацийМассив)),Элемент,ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//)
	//Евросиб - АСуслов 14.07.2023 12:31:17 #локации

КонецПроцедуры

#Область ОбработчикиСобытийЭлементовТаблицыФормыДополнительныеАдресаКлиента   

//Евросиб Коханенко Н.А. 05.10.2023 (( US 75549 TA 75773 
&НаКлиенте
Процедура ДополнительныеАдресаКлиентаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда 
		Если Элементы.Контейнеры.ВыделенныеСтроки.Количество() > 1 Тогда
    		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаАдреса",ЭтаФорма);
			//передадим в параметре, чем заполнять тип операции в зависимости от этапа перевозки
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура("ПерваяМиля");
			ПараметрыФормы.Вставить("ПерваяМиля", Объект.ЭтапПеревозки = ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПерваяМиля")); 
    		ОткрытьФорму("Документ.ЗапросНаАвтоперевозку.Форма.ФормаДобавленияДополнительногоАдресаКлиента", ПараметрыФормы,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
        Иначе
			ТекДанные = Элементы.ДополнительныеАдресаКлиента.ТекущиеДанные; 
			ТекДанные.QueryID = Элементы.ДополнительныеАдресаКлиента.ОтборСтрок.QueryID;
			Если Объект.ЭтапПеревозки = ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПерваяМиля") Тогда
				ТекДанные.ТипОперацииНаСкладеКлиента = ПредопределенноеЗначение("Перечисление.ТипОперацииНаТерминале.ЗагрузкаПорожнегоКТК");	                                       
			ИначеЕсли Объект.ЭтапПеревозки = ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПоследняяМиля") Тогда 
				ТекДанные.ТипОперацииНаСкладеКлиента = ПредопределенноеЗначение("Перечисление.ТипОперацииНаТерминале.РазгрузкаГруженогоКТК"); 
			КонецЕсли;
			НайденныеСтроки = Объект.ДополнительныеАдресаКлиента.НайтиСтроки(Новый Структура("QueryID", ТекДанные.QueryID));
			ТекДанные.Номер = НайденныеСтроки.Количество(); 
		КонецЕсли;
		//Евросиб Коханенко Н.А. 08.12.2023 (( US 75549 TA 78231  
		//разрешаем удаление новой строки
		ПунктУдалить = Элементы.Найти("ДополнительныеАдресаКлиентаКонтекстноеМенюУдалить");
		Если ПунктУдалить <> Неопределено Тогда 
			ПунктУдалить.Доступность = Истина;
		КонецЕсли;
		КнопкаУдалитьАдрес = Элементы.Найти("УдалитьАдрес");
		Если КнопкаУдалитьАдрес <> Неопределено Тогда 
			КнопкаУдалитьАдрес.Доступность = Истина;
		КонецЕсли;
		//Евросиб Коханенко Н.А. 08.12.2023 )) US 75549 TA 78231 
	КонецЕсли; 
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВводаАдреса(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда 
		Возврат; 
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.Контейнеры.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() > 1 Тогда
		Для Каждого НомерВыделеннойСтрокиТЧКонтейнеры Из ВыделенныеСтроки Цикл
			
			ВыделеннаяСтрокаКТК = Объект.Контейнеры[НомерВыделеннойСтрокиТЧКонтейнеры];
			ВыделеннаяСтрокаКТК.ОбновленыИсходныеДанные = Истина;
			
			НайденныеСтроки = Объект.ДополнительныеАдресаКлиента.НайтиСтроки(Новый Структура("QueryID", ВыделеннаяСтрокаКТК.ИдентификаторСтрокиТЧ));
			КоличествоНайденныхСтрок = НайденныеСтроки.Количество(); 
			Если КоличествоНайденныхСтрок = 0 Тогда
				ИзменитьПервуюСтрокуВДополнительныеАдресаКлиента(ВыделеннаяСтрокаКТК.ИдентификаторСтрокиТЧ, ВыделеннаяСтрокаКТК.АдресКлиента, ВыделеннаяСтрокаКТК.ТипОперацииНаСкладеКлиента);
				КоличествоНайденныхСтрок = КоличествоНайденныхСтрок + 1;
			КонецЕсли;
			
			НоваяСтрокаТЧДопАдреса = Объект.ДополнительныеАдресаКлиента.Добавить();
			НоваяСтрокаТЧДопАдреса.ТипОперацииНаСкладеКлиента = Параметр1.ТипОперацииНаСкладеКлиента; 
			НоваяСтрокаТЧДопАдреса.QueryID = ВыделеннаяСтрокаКТК.ИдентификаторСтрокиТЧ;
			НоваяСтрокаТЧДопАдреса.АдресСкладаКлиента = Параметр1.АдресСкладаКлиента;
			НоваяСтрокаТЧДопАдреса.Регион = ПолучитьЗначениеТопонима(НоваяСтрокаТЧДопАдреса.АдресСкладаКлиента, "province");
			НоваяСтрокаТЧДопАдреса.Номер = КоличествоНайденныхСтрок + 1;
			
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеАдресаКлиентаПослеУдаления(Элемент)
	//перенумерация после удаления строки
	НайденныеСтроки = Объект.ДополнительныеАдресаКлиента.НайтиСтроки(Новый Структура("QueryID",Элементы.ДополнительныеАдресаКлиента.ОтборСтрок.QueryID));
	ТекНомер = 1; 
	Для Каждого ТекСтрока Из НайденныеСтроки Цикл
		ТекСтрока.Номер = ТекНомер;
		ТекНомер = ТекНомер + 1;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеАдресаКлиентаПередУдалением(Элемент, Отказ)
	//нельзя удалять первую строку
	Отказ = (Элемент.ТекущиеДанные.Номер = 1);
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеАдресаКлиентаАдресСкладаКлиентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//скопировано из Процедуры КонтейнерыАдресКлиентаНачалоВыбора
	СтандартнаяОбработка = Ложь;
	ТипыЛокацийМассив = Новый Массив;
	ТипыЛокацийМассив.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.АдресВНаселенномПункте"));
	ОткрытьФорму("Справочник.Локации.ФормаВыбора", Новый Структура("МножественныйВыбор, ПоказыватьВыборАдреса, Отбор", Ложь, Истина, Новый Структура("Тип", ТипыЛокацийМассив)),Элемент,ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры 

&НаКлиенте
Процедура ДополнительныеАдресаКлиентаАдресСкладаКлиентаПриИзменении(Элемент)
	ТекДанные = Элементы.ДополнительныеАдресаКлиента.ТекущиеДанные;
	ТекДанные.Регион = ПолучитьЗначениеТопонима(ТекДанные.АдресСкладаКлиента, "province");
КонецПроцедуры 

&НаКлиенте
Процедура ДополнительныеАдресаКлиентаПриИзменении(Элемент)
	//выставляем отметку об обновлении исходных данных в строки ТЧ Контейнеры, 
	//для которых были обновлены или добавлены Дополнительные адреса
	ТекСтрока = Элементы.ДополнительныеАдресаКлиента.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекСтрока.QueryID) Тогда
		НайденныеСтроки = Объект.Контейнеры.НайтиСтроки(Новый Структура("ИдентификаторСтрокиТЧ", ТекСтрока.QueryID));
		Если НайденныеСтроки.Количество() > 0 Тогда
			Для Каждого ИзмененнаяСтрока Из НайденныеСтроки Цикл
				ИзмененнаяСтрока.ОбновленыИсходныеДанные = Истина;		
			КонецЦикла;
    	КонецЕсли;
	КонецЕсли;
КонецПроцедуры
//Евросиб Коханенко Н.А. 05.10.2023 )) US 75549 TA 75773 

//Евросиб Коханенко Н.А. 21.11.2023 (( US 75549 TA 77390 
&НаКлиенте
Процедура ДополнительныеАдресаКлиентаПриАктивизацииСтроки(Элемент) 
	ТекСтрока = Элементы.ДополнительныеАдресаКлиента.ТекущиеДанные;
	//запрещаем удаление первой строки
	Если ТекСтрока <> Неопределено Тогда
		ЗапретУдаленияСтроки = (ТекСтрока.Номер > 1); 
		ПунктУдалить = Элементы.Найти("ДополнительныеАдресаКлиентаКонтекстноеМенюУдалить");
		Если ПунктУдалить <> Неопределено Тогда 
			ПунктУдалить.Доступность = ЗапретУдаленияСтроки;
		КонецЕсли;
		КнопкаУдалитьАдрес = Элементы.Найти("УдалитьАдрес");
		Если КнопкаУдалитьАдрес <> Неопределено Тогда 
			КнопкаУдалитьАдрес.Доступность = ЗапретУдаленияСтроки;
		КонецЕсли;
		//запрещаем перемещение первой строки вниз
		ПунктПеремещениеВниз = Элементы.Найти("ДополнительныеАдресаКлиентаКонтекстноеМенюПереместитьВниз");
		Если ПунктПеремещениеВниз <> Неопределено Тогда 
			ПунктПеремещениеВниз.Доступность = (ТекСтрока.Номер > 1);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеАдресаКлиентаПриАктивизацииЯчейки(Элемент)
	//запрещаем редактирование первой строки
	ТекСтрока = Элементы.ДополнительныеАдресаКлиента.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		Элемент.ТекущийЭлемент.ТолькоПросмотр = (ТекСтрока.Номер = 1); 
	КонецЕсли;
КонецПроцедуры
//Евросиб Коханенко Н.А. 21.11.2023 )) US 75549 TA 77390 

#КонецОбласти

//Евросиб Коханенко Н.А. 05.10.2023 (( US 75549 TA 75773 
&НаКлиенте
Процедура ОбновитьДоступностьКомандыДобавитьАдресКлиента()
	//ищем текущую строку с НЕ выбранным "Не требуется" адрес клиента 
	ТекДанные = Элементы.Контейнеры.ТекущиеДанные;
	ДоступностьКомандыПоТекущейСтроке = (ТекДанные <> Неопределено) И НЕ ТекДанные.НеТребуетсяАдрес;
	Элементы.КонтейнерыДобавитьАдресСкладаКлиента.Доступность = ДоступностьКомандыПоТекущейСтроке; 
	//скроем таблицу, если кнопка стала недоступной
	Элементы.ДополнительныеАдресаКлиента.Видимость = Элементы.ДополнительныеАдресаКлиента.Видимость И ДоступностьКомандыПоТекущейСтроке;
	Если Элементы.ДополнительныеАдресаКлиента.Видимость Тогда
		//если статус - Закрыт, то запретить редактирование
		Элементы.ДополнительныеАдресаКлиента.ТолькоПросмотр = (ТекДанные.СтатусЗаказаНаТС = ПредопределенноеЗначение("Перечисление.СтатусЗаказаНаТс.Закрыт"));		
		Если НЕ Элементы.ДополнительныеАдресаКлиента.ТолькоПросмотр Тогда
			ИзменитьПервуюСтрокуВДополнительныеАдресаКлиента(ТекДанные.ИдентификаторСтрокиТЧ, ТекДанные.АдресКлиента, ТекДанные.ТипОперацииНаСкладеКлиента);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПервуюСтрокуВДополнительныеАдресаКлиента(ИдентификаторСтрокиТЧ, АдресСкладаКлиента = Неопределено, ТипОперацииНаСкладеКлиента = Неопределено)
	НайденныеСтроки = Объект.ДополнительныеАдресаКлиента.НайтиСтроки(Новый Структура("QueryID", ИдентификаторСтрокиТЧ));
	Если НайденныеСтроки.Количество() = 0 Тогда
		НоваяСтрока = Объект.ДополнительныеАдресаКлиента.Добавить();
    	НоваяСтрока.Номер = 1; 
		НоваяСтрока.QueryID = ИдентификаторСтрокиТЧ;
	Иначе
		НоваяСтрока = НайденныеСтроки[0];
	КонецЕсли;
	Если АдресСкладаКлиента <> Неопределено Тогда
		НоваяСтрока.АдресСкладаКлиента = АдресСкладаКлиента; 
		НоваяСтрока.Регион = ПолучитьЗначениеТопонима(АдресСкладаКлиента, "province"); 
	КонецЕсли;
	Если ТипОперацииНаСкладеКлиента <> Неопределено	Тогда
		НоваяСтрока.ТипОперацииНаСкладеКлиента = ТипОперацииНаСкладеКлиента; 
	КонецЕсли;
КонецПроцедуры	

&НаСервереБезКонтекста 
Функция ПолучитьЗначениеТопонима(СсылкаНаАдрес, ВидТопонима) 
	Возврат Справочники.АдресаВНаселенныхПунктах.ПолучитьЗначениеТопонима(СсылкаНаАдрес, ВидТопонима);
КонецФункции
//Евросиб Коханенко Н.А. 03.10.2023 )) US 75549 TA 75773

//Евросиб Коханенко Н.А. 07.12.2023 (( US 75549 TA 77390 
&НаСервере
Процедура УстановитьВидимостьПолейВДополнительныхАдресах()  
	
	Если НЕ Пользователи.РолиДоступны("ПолныеПрава",, Ложь) Тогда
		Элементы.ДополнительныеАдресаКлиентаQueryID.Видимость = Ложь;
		Элементы.ДополнительныеАдресаКлиентаРегион.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры //Евросиб Коханенко Н.А. 07.12.2023 )) US 75549 TA 77390

//// ДИТ US 78234 ТА 78241 Сержантова А.С. 12.12.2023  //ДИТ US 76935 ТА 78648 Сержантова А.С. 21.12.2023
//&НаКлиенте
//Процедура КонтейнерыКоличествоМестПриИзменении(Элемент)
//	ТекД = Элементы.Контейнеры.ТекущиеДанные;    
//	ДобавитьЗначениеРеквизитаВКлюч(ТекД.КлючАналитикиПеревозки,ТекД.КоличествоМест,"КоличествоМест",,ДетализацияПоГрузу,ТекД.ВерсияКлюча);
//КонецПроцедуры
//  
//// ДИТ US 78234 ТА 78241 Сержантова А.С. 12.12.2023  //ДИТ US 76935 ТА 78648 Сержантова А.С. 21.12.2023
//&НаКлиенте
//Процедура КонтейнерыВесГрузаНеттоПриИзменении(Элемент)
//	ТекД = Элементы.Контейнеры.ТекущиеДанные;    
//	ДобавитьЗначениеРеквизитаВКлюч(ТекД.КлючАналитикиПеревозки,ТекД.ВесГрузаНетто,"ВесГруза",,ДетализацияПоГрузу,ТекД.ВерсияКлюча);
//КонецПроцедуры  

// ДИТ US 76935 ТА 78648 Сержантова А.С. 25.12.2023
&НаКлиенте
Процедура КонтейнерыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекСтрока = Элементы.Контейнеры.ТекущиеДанные; 
	Если ТекСтрока <> Неопределено Тогда
		ПроверитьАктуальностьКлючаАналитики(Элементы.Контейнеры.ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры    

// ДИТ US 76935 ТА 78648 Сержантова А.С. 11.12.2023     
&НаСервере
Процедура ПроверитьАктуальностьКлючаАналитики(ИдентификаторСтроки = Неопределено)   
	БылоОбновлениеКлюча = Ложь;
	Если ИдентификаторСтроки = Неопределено Тогда
		Для каждого СтрокаТЧ Из Объект.Контейнеры Цикл
			АктуальнаяВерсия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.КлючАналитикиПеревозки, "ВерсияДанных");
			Если СтрокаТЧ.ВерсияКлюча <> АктуальнаяВерсия Тогда
				БылоОбновлениеКлюча = Истина;
			КонецЕсли;
		КонецЦикла;  
		Если БылоОбновлениеКлюча Тогда
			ЗаполнитьТаблицуПоКлючамАналитики(, Истина);
		КонецЕсли;
	Иначе
	    СтрокаТЧ = Объект.Контейнеры.НайтиПоИдентификатору(ИдентификаторСтроки);
		АктуальнаяВерсия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.КлючАналитикиПеревозки, "ВерсияДанных");
		Если СтрокаТЧ.ВерсияКлюча <> АктуальнаяВерсия Тогда
			ЗаполнитьТаблицуПоКлючамАналитики(СтрокаТЧ.КлючАналитикиПеревозки, Истина); 
			БылоОбновлениеКлюча = Истина;
		КонецЕсли;
	КонецЕсли;	
	
	Если БылоОбновлениеКлюча Тогда 
		ОбщегоНазначения.СообщитьПользователю("Версия ключа аналитики перевозки устарела, подгружены актуальные данные");
	КонецЕсли; 
КонецПроцедуры

// ДИТ US 76935 ТА 77189 Сержантова А.С. 25.12.2023
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "НеобходимоОбновитьДанныеКлючейАналитикиПеревозки" Тогда	
		Если Источник <> Неопределено и Источник.УникальныйИдентификатор <> ЭтаФорма.УникальныйИдентификатор Тогда
			ПроверитьАктуальностьКлючаАналитики();
		КонецЕсли; 
	// ДИТ US 80736 ТА 81088 Сержантова А.С. Начало: 28.02.2024
	ИначеЕсли ИмяСобытия = "НеобходимоОбновитьФормуЗапросаНаАвто" Тогда
		// ДИТ US 80736 ТА 81088 Сержантова А.С. Начало: 05.03.2024
		Если Источник <> Неопределено и Источник.УникальныйИдентификатор <> ЭтаФорма.УникальныйИдентификатор Тогда
		// ДИТ US 80736 ТА 81088 Сержантова А.С. Конец: 05.03.2024
			ЭтаФорма.Прочитать();
			ОповеститьОНеобходимостиОбновленияДанных();
			ОбновитьПанельТекущегоПользователя();
			ОбновитьПанельСостояний(); 
		КонецЕсли;
	// ДИТ US 80736 ТА 81088 Сержантова А.С. Конец: 28.02.2024
	КонецЕсли
КонецПроцедуры

// ДИТ US 78233 TA 79764 Сержантова А.С. 23.01.2024
&НаСервере
Процедура ВосстановитьОтправленныеВТЛДанные()

	ДанныеКлючейОтправленныхВТЛ.Очистить();
	ДетализацияПоГрузуОтправленоВТЛ.Очистить(); 
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	СтруктураОтправленоВТЛ = ТекущийОбъект.ПолучитьОтправленныеДанныеВТЛИзХранилища();
	Если СтруктураОтправленоВТЛ.ДанныеКлюча <> Неопределено Тогда
		ДанныеКлючейОтправленныхВТЛ.Загрузить(СтруктураОтправленоВТЛ.ДанныеКлюча);
	КонецЕсли;  
	Если СтруктураОтправленоВТЛ.ДетализацияГруза <> Неопределено Тогда
		ДетализацияПоГрузуОтправленоВТЛ.Загрузить(СтруктураОтправленоВТЛ.ДетализацияГруза);
	КонецЕсли;    
	
	//ОпределитьИзменениеОтправленныхВТЛДанных();
	
КонецПроцедуры    

// ДИТ US 78233 TA 79764 Сержантова А.С. 23.01.2024
&НаСервере
Процедура ОпределитьИзменениеОтправленныхВТЛДанных(НужноУведомлениеПользователя = Ложь)
	
	НомераСтрокСИзмененнымКлючом = Новый Массив;
	
	СтруктураПоискаСтроки = Новый Структура("ИдентификаторСтрокиТЧ");  
	МассивКлючей = Объект.Контейнеры.Выгрузить(, "КлючАналитикиПеревозки").ВыгрузитьКолонку("КлючАналитикиПеревозки");
	ДанныеКлючейАналитики = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивКлючей,
							"Контейнер, Груз, ВесГруза, КоличествоМест, Мили, ИнструкцияПоСдаче");
	Для каждого СтрокаКонтейнеров Из Объект.Контейнеры Цикл     
		ЗаполнитьЗначенияСвойств(СтруктураПоискаСтроки, СтрокаКонтейнеров);
		СтрОтправленыВТЛ = ДанныеКлючейОтправленныхВТЛ.НайтиСтроки(СтруктураПоискаСтроки);
		Если СтрОтправленыВТЛ.Количество() > 0 Тогда   
			ДанныеПоКлючу = ДанныеКлючейАналитики.Получить(СтрокаКонтейнеров.КлючАналитикиПеревозки);
			ОтправленныеДанные = СтрОтправленыВТЛ[0];    
			ВыборкаМили = ДанныеПоКлючу.Мили.Выбрать();  
			ИзменилсяАдресКлиента = Ложь;
			Если ВыборкаМили.НайтиСледующий(Новый Структура("ЭтапПеревозки", Объект.ЭтапПеревозки)) Тогда
				Если ВыборкаМили.АдресКлиента <> ОтправленныеДанные.АдресКлиента Тогда
					ИзменилсяАдресКлиента = Истина;
				КонецЕсли;	
			КонецЕсли;
			Если ИзменилсяАдресКлиента или ОтправленныеДанные.Контейнер <> ДанныеПоКлючу.Контейнер
				или ОтправленныеДанные.Груз <> ДанныеПоКлючу.Груз 
				или ОтправленныеДанные.ВесГруза <> ДанныеПоКлючу.ВесГруза 
				или ОтправленныеДанные.КоличествоМест <> ДанныеПоКлючу.КоличествоМест 
				или ОтправленныеДанные.ГрузЕТСНГ <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеПоКлючу.Груз, "ЕТСНГ") 
				или ОтправленныеДанные.ИнструкцияПоСдаче <> ДанныеПоКлючу.ИнструкцияПоСдаче Тогда  
				СтрокаКонтейнеров.ОбновленыИсходныеДанные = Истина;
				НомераСтрокСИзмененнымКлючом.Добавить(СтрокаКонтейнеров.НомерСтроки);
			КонецЕсли;		
		КонецЕсли;
	КонецЦикла; 
	
	Если НужноУведомлениеПользователя и НомераСтрокСИзмененнымКлючом.Количество() > 0 Тогда
		ТекстСообщения = СтрШаблон("Произошли изменения по %1 %2, %3 необходимо отправить в ИС ""Транспортная логистика""", 
		?(НомераСтрокСИзмененнымКлючом.Количество() = 1, "строке", "строкам"),
		СтрСоединить(НомераСтрокСИзмененнымКлючом, ", "),
		?(НомераСтрокСИзмененнымКлючом.Количество() = 1, "ее", "их"));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;	

КонецПроцедуры

//Евросиб Коханенко Н.А. 07.02.2024 (( #80805
&НаСервере
Процедура УстановитьЗначенияТиповОперацийНаТерминалеПоУмолчанию()

	Если Объект.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля Тогда
		ТипОперацииНаТерминалеВыдачиПоУмолчанию = Перечисления.ТипОперацииНаТерминале.ПриемПорожнегоКТК;
		ТипОперацииНаСкладеКлиентаПоУмолчанию 	= Перечисления.ТипОперацииНаТерминале.ЗагрузкаПорожнегоКТК;
		ТипОперацииНаТерминалеСдачиПоУмолчанию 	= Перечисления.ТипОперацииНаТерминале.СдачаГруженогоКТК;
	//Евросиб Коханенко Н.А. 07.08.2024 (( #87840
	ИначеЕсли Объект.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.СредняяМиля Тогда
		ТипОперацииНаТерминалеВыдачиПоУмолчанию = Перечисления.ТипОперацииНаТерминале.ПриемГруженогоКТК;
		ТипОперацииНаСкладеКлиентаПоУмолчанию 	= Перечисления.ТипОперацииНаТерминале.ПустаяСсылка();
		ТипОперацииНаТерминалеСдачиПоУмолчанию 	= Перечисления.ТипОперацииНаТерминале.СдачаГруженогоКТК;
	//Евросиб Коханенко Н.А. 07.08.2024 )) #87840
	Иначе //последняя миля     
		ТипОперацииНаТерминалеВыдачиПоУмолчанию = Перечисления.ТипОперацииНаТерминале.ПриемГруженогоКТК;
		ТипОперацииНаСкладеКлиентаПоУмолчанию 	= Перечисления.ТипОперацииНаТерминале.РазгрузкаГруженогоКТК;
		ТипОперацииНаТерминалеСдачиПоУмолчанию 	= Перечисления.ТипОперацииНаТерминале.СдачаПорожнегоКТК;
	КонецЕсли;

КонецПроцедуры //Евросиб Коханенко Н.А. 07.02.2024 )) #80805

//Евросиб Коханенко Н.А. 19.02.2024 (( #80981 
&НаСервере
Функция ПолучитьСтоимостьИСтавкуНДС(ЗапросНаАвтоперевозку)
	тзКонтейнеры = ЗапросНаАвтоперевозку.Контейнеры.Выгрузить(,"ТипКТК, ИдентификаторСтрокиУслуги, ТерминалВыдачи, ТерминалСдачи, КлючАналитикиПеревозки, НеТребуетсяТерминалВыдачи, НеТребуетсяТерминалСдачи, НеТребуетсяАдрес"); 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контейнеры.ТипКТК КАК ТипКТК,
		|	Контейнеры.ИдентификаторСтрокиУслуги КАК ИдентификаторСтрокиУслуги,
		|	Контейнеры.ТерминалВыдачи КАК ТерминалВыдачи,
		|	Контейнеры.ТерминалСдачи КАК ТерминалСдачи,
		|	Контейнеры.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	Контейнеры.НеТребуетсяТерминалВыдачи КАК НеТребуетсяТерминалВыдачи,
		|	Контейнеры.НеТребуетсяТерминалСдачи КАК НеТребуетсяТерминалСдачи,
		|	Контейнеры.НеТребуетсяАдрес КАК НеТребуетсяАдрес
		|ПОМЕСТИТЬ вт_Контейнеры
		|ИЗ
		|	&Контейнеры КАК Контейнеры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТипоразмерыТЕ.РазмерКТК КАК РазмерКТК,
		|	вт_Контейнеры.ИдентификаторСтрокиУслуги КАК ИдентификаторСтрокиУслуги,
		|	вт_Контейнеры.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	вт_Контейнеры.НеТребуетсяТерминалВыдачи КАК НеТребуетсяТерминалВыдачи,
		|	вт_Контейнеры.НеТребуетсяТерминалСдачи КАК НеТребуетсяТерминалСдачи,
		|	вт_Контейнеры.НеТребуетсяАдрес КАК НеТребуетсяАдрес,
		|	ЕСТЬNULL(ИерархияЛокацийТерминалВыдачи.ЛокацияВышестоящегоУровня, NULL) КАК ТерминалВыдачиЛВУ,
		|	ЕСТЬNULL(ИерархияЛокацийТерминалСдачи.ЛокацияВышестоящегоУровня, NULL) КАК ТерминалСдачиЛВУ,
		|	ЕСТЬNULL(ИерархияЛокацийАдресКлиента.ЛокацияВышестоящегоУровня, NULL) КАК АдресКлиентаЛВУ
		|ПОМЕСТИТЬ вт_Запрос
		|ИЗ
		|	вт_Контейнеры КАК вт_Контейнеры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТипоразмерыТЕ КАК ТипоразмерыТЕ
		|		ПО вт_Контейнеры.ТипКТК = ТипоразмерыТЕ.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Локации КАК ЛокацииТерминалВыдачи
		|		ПО вт_Контейнеры.ТерминалВыдачи = ЛокацииТерминалВыдачи.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Локации КАК ЛокацииТерминалСдачи
		|		ПО вт_Контейнеры.ТерминалСдачи = ЛокацииТерминалСдачи.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокацийТерминалВыдачи
		|		ПО (НЕ вт_Контейнеры.НеТребуетсяТерминалВыдачи)
		|			И (ЛокацииТерминалВыдачи.ЛокацияВышестоящегоУровня = ИерархияЛокацийТерминалВыдачи.Локация)
		|			И (ИерархияЛокацийТерминалВыдачи.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.Регион))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокацийТерминалСдачи
		|		ПО (НЕ вт_Контейнеры.НеТребуетсяТерминалСдачи)
		|			И (ИерархияЛокацийТерминалСдачи.Локация = ЛокацииТерминалСдачи.ЛокацияВышестоящегоУровня)
		|			И (ИерархияЛокацийТерминалСдачи.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.Регион))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
		|		ПО вт_Контейнеры.КлючАналитикиПеревозки = КлючиАналитикиПеревозкиМили.Ссылка
		|			И (&ЭтапПеревозки = КлючиАналитикиПеревозкиМили.ЭтапПеревозки)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокацийАдресКлиента
		|		ПО (НЕ вт_Контейнеры.НеТребуетсяАдрес)
		|			И (ИерархияЛокацийАдресКлиента.Локация = КлючиАналитикиПеревозкиМили.АдресКлиента.ЛокацияВышестоящегоУровня)
		|			И (ИерархияЛокацийАдресКлиента.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.Регион))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&ЭтапПеревозки КАК ЭтапПеревозки,
		|	вт_Запрос.РазмерКТК КАК РазмерКТК,
		|	вт_Запрос.ТерминалВыдачиЛВУ КАК ТерминалВыдачиЛВУ,
		|	вт_Запрос.ТерминалСдачиЛВУ КАК ТерминалСдачиЛВУ,
		|	вт_Запрос.АдресКлиентаЛВУ КАК АдресКлиентаЛВУ,
		|	вт_Запрос.НеТребуетсяТерминалВыдачи КАК НеТребуетсяТерминалВыдачи,
		|	вт_Запрос.НеТребуетсяТерминалСдачи КАК НеТребуетсяТерминалСдачи,
		|	вт_Запрос.НеТребуетсяАдрес КАК НеТребуетсяАдрес,
		|	ЕСТЬNULL(ИерархияЛокацийПунктОтправления.ЛокацияВышестоящегоУровня, NULL) КАК ПунктОтправленияЛВУ,
		|	ЕСТЬNULL(ИерархияЛокацийПунктНазначения.ЛокацияВышестоящегоУровня, NULL) КАК ПунктНазначенияЛВУ,
		|	ВЫБОР
		|		КОГДА вт_Запрос.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К40)
		|			ТОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Итого40
		|		КОГДА вт_Запрос.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
		|			ТОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Итого20
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СтоимостьАвтоперевозкиЗаложеннаяПриРасчете,
		|	ВЫБОР
		|		КОГДА вт_Запрос.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К40)
		|				ИЛИ вт_Запрос.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
		|			ТОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СтавкаНДС
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.РазмерыКТК.ПустаяСсылка)
		|	КОНЕЦ КАК СтавкаНДС,
		|	вт_Запрос.ИдентификаторСтрокиУслуги КАК ИдентификаторСтрокиУслуги
		|ПОМЕСТИТЬ вт_Калькуляция
		|ИЗ
		|	вт_Запрос КАК вт_Запрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокацийПунктОтправления
		|				ПО (ИерархияЛокацийПунктОтправления.Локация = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПунктОтправления.ЛокацияВышестоящегоУровня)
		|					И (ИерархияЛокацийПунктОтправления.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.Регион))
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокацийПунктНазначения
		|				ПО (ИерархияЛокацийПунктНазначения.Локация = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПунктНазначения.ЛокацияВышестоящегоУровня)
		|					И (ИерархияЛокацийПунктНазначения.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.Регион))
		|			ПО ЗаявкаСоставУслуги.Калькуляция = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка
		|				И (КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга.УчитыватьСтавкуВЗапросеНаАвтоперевозку)
		|		ПО вт_Запрос.КлючАналитикиПеревозки = ЗаявкаСоставУслуги.КлючАналитикиПеревозки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Калькуляция.СтоимостьАвтоперевозкиЗаложеннаяПриРасчете КАК СтоимостьАвтоперевозкиЗаложеннаяПриРасчете,
		|	вт_Калькуляция.СтавкаНДС КАК СтавкаНДС,
		|	вт_Калькуляция.ИдентификаторСтрокиУслуги КАК ИдентификаторСтрокиУслуги
		|ИЗ
		|	вт_Калькуляция КАК вт_Калькуляция
		|ГДЕ
		|	вт_Калькуляция.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.ПерваяМиля)
		|	И ((НЕ вт_Калькуляция.НеТребуетсяТерминалВыдачи
		|				И вт_Калькуляция.ПунктОтправленияЛВУ = вт_Калькуляция.ТерминалВыдачиЛВУ)
		|			ИЛИ (НЕ вт_Калькуляция.НеТребуетсяАдрес
		|				И вт_Калькуляция.ПунктОтправленияЛВУ = вт_Калькуляция.АдресКлиентаЛВУ))
		|	И НЕ вт_Калькуляция.НеТребуетсяТерминалСдачи
		|	И вт_Калькуляция.ПунктНазначенияЛВУ = вт_Калькуляция.ТерминалСдачиЛВУ
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	вт_Калькуляция.СтоимостьАвтоперевозкиЗаложеннаяПриРасчете,
		|	вт_Калькуляция.СтавкаНДС,
		|	вт_Калькуляция.ИдентификаторСтрокиУслуги
		|ИЗ
		|	вт_Калькуляция КАК вт_Калькуляция
		|ГДЕ
		|	вт_Калькуляция.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.ПоследняяМиля)
		|	И НЕ вт_Калькуляция.НеТребуетсяТерминалВыдачи
		|	И вт_Калькуляция.ПунктОтправленияЛВУ = вт_Калькуляция.ТерминалВыдачиЛВУ
		|	И ((НЕ вт_Калькуляция.НеТребуетсяТерминалСдачи
		|				И вт_Калькуляция.ПунктНазначенияЛВУ = вт_Калькуляция.ТерминалСдачиЛВУ)
		|			ИЛИ (НЕ вт_Калькуляция.НеТребуетсяАдрес
		|				И вт_Калькуляция.ПунктНазначенияЛВУ = вт_Калькуляция.АдресКлиентаЛВУ))";
	
	Запрос.УстановитьПараметр("Контейнеры", тзКонтейнеры);
	Запрос.УстановитьПараметр("ЭтапПеревозки", ЗапросНаАвтоперевозку.ЭтапПеревозки);
	ТаблицаДанныхИзКалькуляций = Запрос.Выполнить().Выгрузить();
    Возврат ТаблицаДанныхИзКалькуляций;
	
КонецФункции //Евросиб Коханенко Н.А. 19.02.2024 )) #80981

// ДИТ US 80736 ТА 81088 Сержантова А.С. 27.02.2024  
&НаСервере
Процедура ОповеститьОНеобходимостиОбновленияДанных()
	СтруктураПоиска = Новый Структура("Состояние", Справочники.Состояния.НеобходимоОбновитьДанные);
	СтрокиСостояний = Объект.Состояния.НайтиСтроки(СтруктураПоиска);
	Если СтрокиСостояний.Количество() и СтрокиСостояний[0].Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
		// ДИТ US 81881 ТА 83581 Сержантова А.С. Начало: 08.04.2024
		// Было:
		//Если Объект.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля Тогда
		//	ОбщегоНазначения.СообщитьПользователю("Необходимо обновить данные в запросе на автоперевозку по кнопке ""Обновить из заявки"", так как в связанном Релизе клиента был изменен терминал выдачи");
		//Иначе
		//    ОбщегоНазначения.СообщитьПользователю("Необходимо обновить данные в запросе на автоперевозку по кнопке ""Обновить из заявки"", так как в связанном Релизе клиента был изменен терминал сдачи");
		//КонецЕсли; 
		//Стало:
		ОбщегоНазначения.СообщитьПользователю("Необходимо обновить данные в запросе на автоперевозку по кнопке ""Обновить из заявки""");
		// ДИТ US 81881 ТА 83581 Сержантова А.С. Конец: 08.04.2024
		БылоОбновлениеИзЗаявки = Ложь;
		ТекущийИсполнитель_Статус = Перечисления.СтатусыЭтапов.ВРаботе;  
	// ДИТ US 81881 ТА 83783 Сержантова А.С. Начало: 22.04.2024
	// Было:
	//ИначеЕсли СтрокиСостояний.Количество() и СтрокиСостояний[0].Статус = Перечисления.СтатусыЭтапов.Выполнен Тогда 
	//	ТекущийИсполнитель_Статус = Перечисления.СтатусыЭтапов.Выполнен; 
	// ДИТ US 81881 ТА 83783 Сержантова А.С. Конец: 22.04.2024
	КонецЕсли; 

	// ДИТ US 81881 ТА 83783 Сержантова А.С. Начало: 24.04.2024 
	//если активна задача "[отмена рейса] Актуализировать терминал выдачи", то сообщим что нужно сделать пользователю
	СтруктураПоиска = Новый Структура("Состояние", Справочники.Состояния.ОтменаРейсаАктуализироватьТерминал);
	СтрокиСостояний = Объект.Состояния.НайтиСтроки(СтруктураПоиска);
	Если СтрокиСостояний.Количество() и СтрокиСостояний[0].Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
		ОбщегоНазначения.СообщитьПользователю("В связи с отменой/удалением рейса в заявке, необходимо: либо подобрать новый рейс в заявку, "+
								"либо актуализировать дату, время подачи КТК и терминал выдачи, либо отменить данный запрос на автоперевозку");
		ТекущийИсполнитель_Статус = Перечисления.СтатусыЭтапов.ВРаботе;  
	КонецЕсли; 
	// ДИТ US 81881 ТА 83783 Сержантова А.С. Конец: 24.04.2024
КонецПроцедуры

//Евросиб Коханенко Н.А. 12.03.2024 (( #82185 
Процедура УстановитьОбязательностьЗаполненияПолейДляИмпортМоре()
	ЭтоИмпортМоре = (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Заявка, "ВидПеревозки") = ПредопределенноеЗначение("Справочник.ВидыПеревозок.ИмпортМоре"));
	ЭтотОбъект.Элементы.КонтейнерыТерминалСдачи.АвтоОтметкаНезаполненного 				= НЕ ЭтоИмпортМоре;
	ЭтотОбъект.Элементы.КонтейнерыТипОперацииНаТерминалеСдачи.АвтоОтметкаНезаполненного	= НЕ ЭтоИмпортМоре;
	ЭтотОбъект.Элементы.КонтейнерыАдресКлиента.АвтоОтметкаНезаполненного 				= НЕ ЭтоИмпортМоре;
	ЭтотОбъект.Элементы.КонтейнерыТипОперацииНаСкладеКлиента.АвтоОтметкаНезаполненного	= НЕ ЭтоИмпортМоре;
КонецПроцедуры	//Евросиб Коханенко Н.А. 12.03.2024 )) #82185 

// ДИТ US 81881 ТА 81882 Сержантова А.С. 04.04.2024
&НаКлиенте
Асинх Процедура ВопросВыборТерминаловВыдачи()
	
	// Евросиб(ДИТ) ТА 86904 Сержантова А.С. Начало: 19.06.2024
	// Было:
	//ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораТерминаловВыдачи", ЭтаФорма);
	//
	//ПараметрыФормы = Новый Структура("ДублиТерминалов");
	//ПараметрыФормы.Вставить("ДублиТерминалов", СписокДублейТерминаловИзРейса); 
	//ОткрытьФорму("Документ.ЗапросНаАвтоперевозку.Форма.ФормаВыбораТерминалов", ПараметрыФормы,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//Стало:
	Ответ = Ждать СписокДублейТерминаловИзРейса.ВыбратьЭлементАсинх("Выбор терминалов");
	Если Ответ <> Неопределено Тогда
		Для каждого СтрКонтейнера Из Объект.Контейнеры Цикл
			СтрКонтейнера.ТерминалВыдачи = Ответ.Значение; 
		КонецЦикла;
	КонецЕсли;
	// Евросиб(ДИТ) ТА 86904 Сержантова А.С. Конец: 19.06.2024
КонецПроцедуры  

// ДИТ US 81881 ТА 81882 Сержантова А.С. 04.04.2024  //ТА 86904 Сержантова А.С. 19.06.2024
//&НаКлиенте
//Процедура ПослеВыбораТерминаловВыдачи(Результат, ДопПараметры) Экспорт
//	
//	Если Результат <> Неопределено Тогда
//		Для каждого ЭлСоответствия Из Результат Цикл
//			СтрокиКонтейнеров = Объект.Контейнеры.НайтиСтроки(Новый Структура("Контейнер", ЭлСоответствия.Ключ));
//			Для каждого СтрКонтенера Из СтрокиКонтейнеров Цикл
//				СтрКонтенера.ТерминалВыдачи = ЭлСоответствия.Значение;	
//			КонецЦикла;
//		КонецЦикла;
//	КонецЕсли;  
//	
//	СписокДублейТерминаловИзРейса.Очистить();
//	
//КонецПроцедуры

//Евросиб Коханенко Н.А. 24.04.2024 (( #84617 
&НаСервере
Процедура ОбновитьУчетныеНаправленияИзЗаявкиНаСервере()
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ОбновитьУчетныеНаправленияИзЗаявки();
КонецПроцедуры //Евросиб Коханенко Н.А. 24.04.2024 )) #84617

//Евросиб Коханенко Н.А. 07.06.2024 (( #83866 
&НаСервере
Функция ПолучитьМассивГУИДовПеренесенныхКТК(ЗаявкаСсылка);
	//Выберем все перенесенные КТК
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаСоставУслуги.ГУИДСтроки КАК ГУИДСтроки
		|ИЗ
		|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|ГДЕ
		|	ЗаявкаСоставУслуги.Ссылка = &Ссылка
		|	И ЗаявкаСоставУслуги.ПеренесенВЗаявку <> ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Ссылка", ЗаявкаСсылка);
	МассивГУИДовПеренесенныхКТК = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ГУИДСтроки");
	Возврат МассивГУИДовПеренесенныхКТК;
КонецФункции //Евросиб Коханенко Н.А. 07.06.2024 )) #83866 

//Евросиб Коханенко Н.А. 07.08.2024 (( #87840 
&НаСервере
Процедура УстановитьСвойстваЭлементовФормыДляСреднейМили();
	
	Если Объект.ЭтапПеревозки <> Перечисления.ЭтапыПеревозки.СредняяМиля Тогда
		Возврат;
	КонецЕсли;            
	
	Элементы.ОриентировочнаяДатаЖДРейса.Видимость 			= Ложь; 
	Элементы.КонтейнерыНеТребуетсяТерминалВыдачи.Видимость 	= Ложь;
	Элементы.КонтейнерыНеТребуетсяТерминалСдачи.Видимость 	= Ложь;
	
	//даты по средней миле смотреть можно, редактировать нельзя
	Элементы.КонтейнерыГруппаПолейПоСреднейМиле.Видимость 	= Истина;
	Элементы.КонтейнерыГруппаПолейПоСреднейМиле.ТолькоПросмотр = Истина;

	Элементы.КонтейнерыТипОперацииНаТерминалеВыдачи.Доступность = Ложь;
	Элементы.КонтейнерыТипОперацииНаТерминалеСдачи.Доступность = Ложь;
	
	//адрес клиента редактировать нельзя
	Элементы.КонтейнерыГруппаСкладКлиента.Видимость = Ложь;
	
	Элементы.КонтейнерыГрузоотправительГрузопоолучательКонтакты.Видимость = Ложь;
	Элементы.КонтейнерыИнструкцияПоСдаче.Видимость = Ложь;
	Элементы.КонтейнерыЭкспедирование.Видимость = Ложь;
	Элементы.КонтейнерыГруппаРелиз.Видимость = Ложь;
	
	Для Каждого Контейнер Из Объект.Контейнеры Цикл
		Если ЗначениеЗаполнено(Объект.ОриентировочнаяДатаМорскогоРейса) Тогда
			Контейнер.ДатаВремяПодачиКТК = Объект.ОриентировочнаяДатаМорскогоРейса;
		КонецЕсли;
		Контейнер.НеТребуетсяАдрес = Истина;                                       
		Контейнер.ТипОперацииНаТерминалеВыдачи = Перечисления.ТипОперацииНаТерминале.ПриемГруженогоКТК;   
		Контейнер.ТипОперацииНаТерминалеСдачи = Перечисления.ТипОперацииНаТерминале.СдачаГруженогоКТК;
	КонецЦикла; 
	
	//Евросиб Коханенко Н.А. 26.02.2025 (( #102955
	Элементы.КонтейнерыГруз.АвтоОтметкаНезаполненного = Ложь;
	//Евросиб Коханенко Н.А. 26.02.2025 )) #102955 
	
КонецПроцедуры //Евросиб Коханенко Н.А. 07.08.2024 )) #87840

//Евросиб Коханенко Н.А. 25.12.2024 (( #97950 
&НаСервере
Функция ОбновитьЗапросПоСреднейМилеИзЗаявкиНаСервере()
	
	ОбновитьШапку(); //Договор, Контрагент из Заявки 
	
	МорскойРейсИзЗаявки = НайтиРейсЗаявки(Объект.Заявка, Истина); 
	Если ЗначениеЗаполнено(МорскойРейсИзЗаявки) Тогда
		ДанныеМорскогоРейсаИзЗаявки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(МорскойРейсИзЗаявки, "МестоРазгрузки, ДатаПрибытия");
	Иначе     
		ДанныеМорскогоРейсаИзЗаявки = Новый Структура("МестоРазгрузки, ДатаПрибытия", Справочники.РейсыМоре.ПустаяСсылка(), Дата(1,1,1));	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаСоставУслуги.ДатаГотовностиКТККВывозуИзПорта КАК ДатаГотовностиКТККВывозуИзПорта,
		|	ЗаявкаСоставУслуги.РелизТерминалаPODДействуетДо КАК РелизТерминалаPODДействуетДо,
		|	ЗаявкаСоставУслуги.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	ЗаявкаСоставУслуги.СухойТерминалОтправления КАК ТерминалСдачи,
		|	ЗаявкаСоставУслуги.УчетноеНаправление КАК УчетноеНаправление,
		|	ЗаявкаСоставУслуги.ГУИДСтроки КАК ИдентификаторСтрокиУслуги,
		|	ЗаявкаСоставУслуги.НомерКТК КАК Контейнер,
		|	ЗаявкаСоставУслуги.ТипКТК КАК ТипКТК
		|ИЗ
		|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|ГДЕ
		|	ЗаявкаСоставУслуги.Ссылка = &Ссылка
		|	И ЗаявкаСоставУслуги.ДатаГотовностиКТККВывозуИзПорта <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ЗаявкаСоставУслуги.РелизТерминалаPODДействуетДо <> ДАТАВРЕМЯ(1, 1, 1)
		|";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Заявка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	ТЧКонтейнеры = Объект.Контейнеры;
	
	Пока Выборка.Следующий() Цикл 
		ЭтоНоваяСтрока = Ложь;
		ПараметрыОтбора = Новый Структура("КлючАналитикиПеревозки", Выборка.КлючАналитикиПеревозки); 
		НайденныеСтроки = ТЧКонтейнеры.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаТЧ = НайденныеСтроки[0];
		Иначе
			ЭтоНоваяСтрока = Истина;
			СтрокаТЧ = ТЧКонтейнеры.Добавить();
			СтрокаТЧ.ИдентификаторСтрокиТЧ = Новый УникальныйИдентификатор;
			СтрокаТЧ.ИдентификаторСтрокиТабличнойЧасти = ТЧКонтейнеры.Количество() - 1;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка); 
		
		Если ЭтоНоваяСтрока Тогда
			ДанныеИзКлючаАналитики = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТЧ.КлючАналитикиПеревозки, "КоличествоМест, ВесГруза, ИнструкцияПоСдаче, РелизКлиента");
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, ДанныеИзКлючаАналитики); 
			СтрокаТЧ.Релиз = ДанныеИзКлючаАналитики.РелизКлиента;
			СтрокаТЧ.ТипОперацииНаТерминалеВыдачи = Перечисления.ТипОперацииНаТерминале.ПриемГруженогоКТК;
			СтрокаТЧ.СтатусОтправкиЗапросаНаТерминалВыдачи = Перечисления.СтатусОтправкиЗапросаНаТерминалВыдачи.НеОтправлен;
			СтрокаТЧ.ТипОперацииНаТерминалеСдачи = Перечисления.ТипОперацииНаТерминале.СдачаГруженогоКТК;
			СтрокаТЧ.НеТребуетсяАдрес = Истина;
		КонецЕсли;
		
		//Евросиб Коханенко Н.А. 19.02.2025 (( #102955 
		//СтрокаТЧ.ТерминалВыдачи = ДанныеМорскогоРейсаИзЗаявки.МестоРазгрузки;
		//получаем ТерминалВыдачи и ВесГрузаНетто из Коносамента
		ДанныеИзКоносамента = ОбменДаннымиСредняяМиляСервер.ПолучитьДанныеИзКоносамента(Объект.Заявка, СтрокаТЧ.КлючАналитикиПеревозки);
		СтрокаТЧ.ТерминалВыдачи = ДанныеИзКоносамента.ТерминалВыдачи;
		//Евросиб Коханенко Н.А. 19.02.2025 )) #102955 

		СтрокаТЧ.ДатаВремяПодачиКТК = ДанныеМорскогоРейсаИзЗаявки.ДатаПрибытия;
		СтрокаТЧ.СтатусЗапросаНаАвтоперевозку = Перечисления.СтатусЗапросаНаПеревозку.ГотовКОтправке;
		СтрокаТЧ.ОбновленыИсходныеДанные = Истина;
		
	КонецЦикла;
	
	//выставим статус "Отменен" строкам, которых нет в заявке или у которых в заявке не заполнены две даты для средней мили
	МассивКлючейАналитикиИзЗаявки = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("КлючАналитикиПеревозки");
	Для Каждого СтрокаТЧ Из ТЧКонтейнеры Цикл
		Если МассивКлючейАналитикиИзЗаявки.Найти(СтрокаТЧ.КлючАналитикиПеревозки) = Неопределено Тогда
			СтрокаТЧ.СтатусЗапросаНаАвтоперевозку = Перечисления.СтатусЗапросаНаПеревозку.Отменен;
			СтрокаТЧ.ОбновленыИсходныеДанные = Истина;	
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначения.СообщитьПользователю("Данные в запросе на автоперевозку обновлены, необходимо отправить информацию об изменениях в ИС «Транспортная логистика».");	

КонецФункции //Евросиб Коханенко Н.А. 25.12.2024 )) #97950 

//Евросиб Коханенко Н.А. 17.12.2025 (( #125251
&НаСервере
Процедура УстановитьВидимостьПолейАдресаСкладаФакт()
	
	ДатаИзКонстанты = Константы.ДатаПереходаНаСсылкиАдресовНаселенныхПунктов.Получить();
	Если ЗначениеЗаполнено(ДатаИзКонстанты) 
		И (ТекущаяДата() >= ДатаИзКонстанты) Тогда //отображение нового поля с определенной даты
		//И (Объект.Дата >= ДатаИзКонстанты) Тогда //отображение нового поля, если запрос создан с определенной даты
		Элементы.КонтейнерыУдалитьАдресСкладаФакт.Видимость = Ложь;
		Элементы.КонтейнерыАдресСкладаФакт.Видимость = Истина;
	Иначе
		Элементы.КонтейнерыУдалитьАдресСкладаФакт.Видимость = Истина;
		Элементы.КонтейнерыАдресСкладаФакт.Видимость = Ложь;
	КонецЕсли; 
	
КонецПроцедуры //Евросиб Коханенко Н.А. 17.12.2025 )) #125251 

//Евросиб Коханенко Н.А. 11.02.2026 (( BUG 130030 TA 130694 
&НаКлиенте
Процедура КонтейнерыОбновленыИсходныеДанныеПриИзменении(Элемент)
	
	МодифицированностьФормы = ЭтаФорма.Модифицированность;
	
КонецПроцедуры //Евросиб Коханенко Н.А. 11.02.2026 )) BUG 130030 TA 130694 
