
#Область ОбработчикиСобытийФормы

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Команда)
	//Евросиб Коханенко Н.А. #61705 01.12.2022 (
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
	//Евросиб Коханенко Н.А. #61705 01.12.2022 )
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьДанные(Команда)
	ПрочитатьДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
	
	Отказ = Ложь;
	
	Результат = Новый Массив;
	
	Отказ = ПроверитьУсловийПеревозкиИПлановыйОбъемTEU(Отказ);
	
	Для Каждого Строка Из ТаблицаРезультат Цикл
		//ИндексСтроки = ТаблицаРезультат.Индекс(Строка);
		//Если ЗначениеЗаполнено(Строка.ПунктОтправления) И Не ЗначениеЗаполнено(Строка.УсловияПеревозкиОтправлениеЖД) Тогда
		//	ТекстСообщения = НСтр("ru = 'Необходимо заполнить Условия перевозки по отпр. ЖД'");
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ,
		//		"ТаблицаРезультат[" + ИндексСтроки + "].УсловияПеревозкиОтправлениеЖД", , Отказ);
		//КонецЕсли;
		//Если ЗначениеЗаполнено(Строка.ПунктНазначения) И Не ЗначениеЗаполнено(Строка.УсловияПеревозкиПрибытиеЖД) Тогда
		//	ТекстСообщения = НСтр("ru = 'Необходимо заполнить Условия перевозки по приб. ЖД'");
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ,
		//		"ТаблицаРезультат[" + ИндексСтроки + "].УсловияПеревозкиПрибытиеЖД", , Отказ);
		//КонецЕсли;
		//Если ЗначениеЗаполнено(Строка.ПортОтправления) И Не ЗначениеЗаполнено(Строка.УсловияПогрузкиФрахт) Тогда
		//	ТекстСообщения = НСтр("ru = 'Необходимо заполнить Условия погрузки ФРАХТ'");
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ,
		//		"ТаблицаРезультат[" + ИндексСтроки + "].УсловияПогрузкиФрахт", , Отказ);
		//КонецЕсли;
		//Если ЗначениеЗаполнено(Строка.ПортОтгрузки) И Не ЗначениеЗаполнено(Строка.УсловияВыгрузкиФрахт) Тогда
		//	ТекстСообщения = НСтр("ru = 'Необходимо заполнить Условия выгрузки ФРАХТ'");
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ,
		//		"ТаблицаРезультат[" + ИндексСтроки + "].УсловияВыгрузкиФрахт", , Отказ);
		//КонецЕсли;
		//Если ЗначениеЗаполнено(Строка.ПортНазначения) И Не ЗначениеЗаполнено(Строка.УсловияВыгрузкиФрахт) Тогда
		//	ТекстСообщения = НСтр("ru = 'Необходимо заполнить Условия выгрузки ФРАХТ'");
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ,
		//		"ТаблицаРезультат[" + ИндексСтроки + "].УсловияВыгрузкиФрахт", , Отказ);
		//КонецЕсли;
		//Если Не ЗначениеЗаполнено(Строка.ПунктОтправления) И ЗначениеЗаполнено(Строка.УсловияПеревозкиОтправлениеЖД) Тогда
		//	ТекстСообщения = НСтр("ru = 'Необходимо заполнить Пункт отпр. ЖД'");
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ,
		//		"ТаблицаРезультат[" + ИндексСтроки + "].ПунктОтправления", , Отказ);
		//КонецЕсли;
		//Если Не ЗначениеЗаполнено(Строка.ПунктНазначения) И ЗначениеЗаполнено(Строка.УсловияПеревозкиПрибытиеЖД) Тогда
		//	ТекстСообщения = НСтр("ru = 'Необходимо заполнить Пункт назн. ЖД'");
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ,
		//		"ТаблицаРезультат[" + ИндексСтроки + "].ПунктНазначения", , Отказ);
		//КонецЕсли;
		//Если Не ЗначениеЗаполнено(Строка.ПортОтправления) И ЗначениеЗаполнено(Строка.УсловияПогрузкиФрахт) Тогда
		//	ТекстСообщения = НСтр("ru = 'Необходимо заполнить Порт отправления ФРАХТ'");
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ,
		//		"ТаблицаРезультат[" + ИндексСтроки + "].ПортОтправленияФРАХТ", , Отказ);
		//КонецЕсли;
		//Если Не ЗначениеЗаполнено(Строка.ПортОтгрузки) И ЗначениеЗаполнено(Строка.УсловияВыгрузкиФрахт) Тогда
		//	ТекстСообщения = НСтр("ru = 'Необходимо заполнить Порт отгрузки ФРАХТ'");
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ,
		//		"ТаблицаРезультат[" + ИндексСтроки + "].ПортОтгрузкиФРАХТ", , Отказ);
		//КонецЕсли;
		//Если Не ЗначениеЗаполнено(Строка.ПортНазначения) И ЗначениеЗаполнено(Строка.УсловияВыгрузкиФрахт) Тогда
		//	ТекстСообщения = НСтр("ru = 'Необходимо заполнить Порт назначения ФРАХТ'");
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ,
		//		"ТаблицаРезультат[" + ИндексСтроки + "].ПортНазначенияФРАХТ", , Отказ);
		
		Результат.Добавить(Новый Структура("Контрагент,
										|	ПунктОтправления, 
										|	ПунктНазначения, 
										|	ПортОтправленияФРАХТ, 
										|	ПортОтгрузкиФРАХТ,
										|	ПортНазначенияФРАХТ,
										|	УсловияПеревозкиОтправление,
										|	УсловияПеревозкиПрибытие,
										|	УсловияПогрузки,
										|	УсловияВыгрузки,
										|	ПлановыйОбъемTEU", 
										Строка.Контрагент, 
										Строка.ПунктОтправления, 
										Строка.ПунктНазначения,
										Строка.ПортОтправления,
										Строка.ПортОтгрузки,
										Строка.ПортНазначения,
										УсловияПеревозкиОтправление,
										УсловияПеревозкиПрибытие,
										УсловияПогрузки,
										УсловияВыгрузки,
										ПлановыйОбъемTEU));
	КонецЦикла;

	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПроверитьУсловийПеревозкиИПлановыйОбъемTEU(Отказ)
	
	ТаблицаУсловий = ТаблицаРезультат.Выгрузить(, "УсловияПеревозкиОтправление, УсловияПеревозкиПрибытие, УсловияПогрузки, УсловияВыгрузки");
		
	ТаблицаУсловий.Свернуть("УсловияПеревозкиОтправление, УсловияПеревозкиПрибытие, УсловияПогрузки, УсловияВыгрузки");
	
	Индекс = ТаблицаУсловий.Количество() - 1;
	Пока Индекс >= 0 Цикл
		Если Не ЗначениеЗаполнено(ТаблицаУсловий[Индекс].УсловияПеревозкиОтправление) 
			И Не ЗначениеЗаполнено(ТаблицаУсловий[Индекс].УсловияПеревозкиПрибытие) 
			И Не ЗначениеЗаполнено(ТаблицаУсловий[Индекс].УсловияПогрузки) 
			И Не ЗначениеЗаполнено(ТаблицаУсловий[Индекс].УсловияВыгрузки) Тогда
			ТаблицаУсловий.Удалить(Индекс);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	
	Если ТаблицаУсловий.Количество() > 1 Тогда
		ТекстСообщения = НСтр("ru = 'Условия перевозки должны быть одинаковыми во всех строках.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	ИначеЕсли ТаблицаУсловий.Количество() = 1 Тогда
		УсловияПеревозкиОтправление = ТаблицаУсловий[0]["УсловияПеревозкиОтправление"];
		УсловияПеревозкиПрибытие = ТаблицаУсловий[0]["УсловияПеревозкиПрибытие"];
		УсловияПогрузки = ТаблицаУсловий[0]["УсловияПогрузки"];
		УсловияВыгрузки = ТаблицаУсловий[0]["УсловияВыгрузки"];
	КонецЕсли;

	ПервоеЗначение = ТаблицаРезультат[0]["ПлановыйОбъемTEU"];
	
	ТаблицаПлановыйОбъемTEU = ТаблицаРезультат.Выгрузить(, "ПлановыйОбъемTEU");
	
	ТаблицаПлановыйОбъемTEU.Свернуть("ПлановыйОбъемTEU");
	
	Индекс = ТаблицаПлановыйОбъемTEU.Количество() - 1;
	Пока Индекс >= 0 Цикл
		Если Не ЗначениеЗаполнено(ТаблицаПлановыйОбъемTEU[Индекс].ПлановыйОбъемTEU) Тогда
			ТаблицаПлановыйОбъемTEU.Удалить(Индекс);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	
	Если ТаблицаПлановыйОбъемTEU.Количество() > 1 Тогда
		ТекстСообщения = НСтр("ru = 'Плановый объем TEU должен быть одинаковыми во всех строках.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	ИначеЕсли ТаблицаПлановыйОбъемTEU.Количество() = 1 Тогда
		ПлановыйОбъемTEU = ТаблицаПлановыйОбъемTEU[0]["ПлановыйОбъемTEU"];
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

&НаСервере
Процедура ПрочитатьДанныеНаСервере()
	
	Счетчик = 2;
	ТаблицаРезультат.Очистить();
	
	СчетчикЧтенияКолонок = 11;
	
	ПрочитаннаяСтрока = ТабличныйДокумент.Область("R" + Счетчик + "C1").Текст;
	
	Для Счетчик1 = 2 По 100 Цикл
	
		ВСтрокеЕстьДанные = Ложь;
		
		Для Счетчик2 = 1 По СчетчикЧтенияКолонок Цикл
			ПрочитаннаяСтрока = ТабличныйДокумент.Область("R" + Счетчик + "C" + Счетчик2).Текст;
			Если ПрочитаннаяСтрока <> "" Тогда
				ВСтрокеЕстьДанные = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ВСтрокеЕстьДанные Тогда
			Счетчик = Счетчик + 1;
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаРезультат.Добавить();
		
		Контрагент = СокрЛП(ТабличныйДокумент.Область("R" + Счетчик + "C1").Текст);
		НайденныйКлиент = КонтрагентыДоговоры_сервер.НайтиКонтрагентаПоНечеткомуУсловию(Контрагент);
		Если ЗначениеЗаполнено(НайденныйКлиент) Тогда
			НоваяСтрока.Контрагент = НайденныйКлиент;
		Иначе
			НайденныйКлиент = КонтрагентыДоговоры_сервер.НайтиКонтрагентаПоШаблону(Контрагент);
			Если ЗначениеЗаполнено(НайденныйКлиент) Тогда
				НоваяСтрока.Контрагент = НайденныйКлиент;
			КонецЕсли;
		КонецЕсли;
		
		СтрокаПунктОтправленияЖД = СокрЛП(ТабличныйДокумент.Область("R" + Счетчик + "C2").Текст);
		Если ЗначениеЗаполнено(СтрокаПунктОтправленияЖД) Тогда
			ПодобранныйПунктОтправленияЖД = НайтиЛокацию(СтрокаПунктОтправленияЖД);
			Если ПодобранныйПунктОтправленияЖД.Количество() = 1 Тогда
				НоваяСтрока.ПунктОтправления = ПодобранныйПунктОтправленияЖД[0].Ссылка;
			КонецЕсли;
		КонецЕсли;
		СтрокаПунктНазначенияЖД = СокрЛП(ТабличныйДокумент.Область("R" + Счетчик + "C3").Текст);
		Если ЗначениеЗаполнено(СтрокаПунктНазначенияЖД) Тогда
			ПодобранныйПунктНазначенияЖД = НайтиЛокацию(СтрокаПунктНазначенияЖД);
			Если ПодобранныйПунктНазначенияЖД.Количество() = 1 Тогда
				НоваяСтрока.ПунктНазначения = ПодобранныйПунктНазначенияЖД[0].Ссылка;
			КонецЕсли;
		КонецЕсли;
		СтрокаПортОтправленияФрахт = СокрЛП(ТабличныйДокумент.Область("R" + Счетчик + "C4").Текст);
		Если ЗначениеЗаполнено(СтрокаПортОтправленияФрахт) Тогда
			ПодобранныйПортОтправленияФрахт = НайтиЛокацию(СтрокаПортОтправленияФрахт, Ложь);
			Если ПодобранныйПортОтправленияФрахт.Количество() = 1 Тогда
				НоваяСтрока.ПортОтправления = ПодобранныйПортОтправленияФрахт[0].Ссылка;
			КонецЕсли;
		КонецЕсли;
		СтрокаПортОтгрузкиФРАХТ = СокрЛП(ТабличныйДокумент.Область("R" + Счетчик + "C5").Текст);
		Если ЗначениеЗаполнено(СтрокаПортОтгрузкиФРАХТ) Тогда
			ПодобранныйПортОтгрузкиФРАХТ = НайтиЛокацию(СтрокаПортОтгрузкиФРАХТ, Ложь);
			Если ПодобранныйПортОтгрузкиФРАХТ.Количество() = 1 Тогда
				НоваяСтрока.ПортОтгрузки = ПодобранныйПортОтгрузкиФРАХТ[0].Ссылка;
			КонецЕсли;
		КонецЕсли;
		СтрокаПортНазначенияФРАХТ = СокрЛП(ТабличныйДокумент.Область("R" + Счетчик + "C6").Текст);
		Если ЗначениеЗаполнено(СтрокаПортНазначенияФРАХТ) Тогда
			ПодобранныйПортНазначенияФРАХТ = НайтиЛокацию(СтрокаПортНазначенияФРАХТ, Ложь);
			Если ПодобранныйПортНазначенияФРАХТ.Количество() = 1 Тогда
				НоваяСтрока.ПортНазначения = ПодобранныйПортНазначенияФРАХТ[0].Ссылка;
			КонецЕсли;
		КонецЕсли;
		
		СтрокаУсловияПеревозкиОтправленияЖД = СокрЛП(ТабличныйДокумент.Область("R" + Счетчик + "C7").Текст);
		Если ЗначениеЗаполнено(СтрокаУсловияПеревозкиОтправленияЖД) Тогда
			ПодобранноеУсловиеПеревозки = НайтиУсловияПеревозки(СтрокаУсловияПеревозкиОтправленияЖД);
			Если ПодобранноеУсловиеПеревозки <> Неопределено Тогда
				НоваяСтрока.УсловияПеревозкиОтправление = ПодобранноеУсловиеПеревозки;
			КонецЕсли;
		КонецЕсли;
		СтрокаУсловияПеревозкиПрибытияЖД = СокрЛП(ТабличныйДокумент.Область("R" + Счетчик + "C8").Текст);
		Если ЗначениеЗаполнено(СтрокаУсловияПеревозкиПрибытияЖД) Тогда
			ПодобранноеУсловиеПеревозки = НайтиУсловияПеревозки(СтрокаУсловияПеревозкиПрибытияЖД);
			Если ПодобранноеУсловиеПеревозки <> Неопределено Тогда
				НоваяСтрока.УсловияПеревозкиПрибытие = ПодобранноеУсловиеПеревозки;
			КонецЕсли;
		КонецЕсли;
		СтрокаУсловияПеревозкиОтправленияФрахт = СокрЛП(ТабличныйДокумент.Область("R" + Счетчик + "C9").Текст);
		Если ЗначениеЗаполнено(СтрокаУсловияПеревозкиОтправленияФрахт) Тогда
			ПодобранноеУсловиеПеревозки = НайтиУсловияПеревозки(СтрокаУсловияПеревозкиОтправленияФрахт, Ложь);
			Если ПодобранноеУсловиеПеревозки <> Неопределено Тогда
				НоваяСтрока.УсловияПогрузки = ПодобранноеУсловиеПеревозки;
			КонецЕсли;
		КонецЕсли;
		СтрокаУсловияПеревозкиПрибытияФрахт = СокрЛП(ТабличныйДокумент.Область("R" + Счетчик + "C10").Текст);
		Если ЗначениеЗаполнено(СтрокаУсловияПеревозкиПрибытияФрахт) Тогда
			ПодобранноеУсловиеПеревозки = НайтиУсловияПеревозки(СтрокаУсловияПеревозкиПрибытияФрахт, Ложь);
			Если ПодобранноеУсловиеПеревозки <> Неопределено Тогда
				НоваяСтрока.УсловияВыгрузки = ПодобранноеУсловиеПеревозки;
			КонецЕсли;
		КонецЕсли;
		
		ПлановыйОбъемTEU = СокрЛП(ТабличныйДокумент.Область("R" + Счетчик + "C11").Текст);
		Если ЗначениеЗаполнено(ПлановыйОбъемTEU) Тогда
			ЭтоЧисло = ОбщегоНазначенияКлиентСервер.ЭтоЧисло(ПлановыйОбъемTEU);
			Если ЭтоЧисло Тогда
				НоваяСтрока.ПлановыйОбъемTEU = ПлановыйОбъемTEU;
			КонецЕсли;
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
		
		ПрочитаннаяСтрока = ТабличныйДокумент.Область("R" + Счетчик + "C1").Текст;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция НайтиЛокацию(Наименование, ЖД = Истина)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Локации.Ссылка КАК Ссылка,
	|	Локации.Тип КАК Тип
	|ИЗ
	|	Справочник.Локации КАК Локации
	|ГДЕ
	|	Локации.Наименование ПОДОБНО &Шаблон
	|	И Локации.Тип В(&Типы)
	|	И НЕ Локации.ПометкаУдаления";
	
	Если ЖД Тогда
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Терминал"));
		МассивТипов.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Порт"));
		МассивТипов.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.СтанцияЖД"));
		МассивТипов.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.НаселенныйПункт"));
		Запрос.УстановитьПараметр("Типы", МассивТипов);
	Иначе
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Порт"));
		Запрос.УстановитьПараметр("Типы", МассивТипов);
	КонецЕсли;

	//Запрос.УстановитьПараметр("Шаблон", "%" + ОбщегоНазначения.СформироватьСтрокуДляПоискаВЗапросе(Наименование) + "%");
	Запрос.УстановитьПараметр("Шаблон", "%" + Наименование + "%");

	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Возврат Выгрузка;
	
КонецФункции

&НаСервере
Функция НайтиУсловияПеревозки(Наименование, УсловияПеревозКТК = Истина)
	
	Ответ = Неопределено;
	
	Наименование = НРег(Наименование);
	
	Если УсловияПеревозКТК Тогда
		Если Найти(Наименование, "door") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиКТК.DOOR;
		ИначеЕсли Найти(Наименование, "cy") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиКТК.CY;
		ИначеЕсли Найти(Наименование, "for") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиКТК.FOR;
		ИначеЕсли Найти(Наименование, "lifo") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиКТК.LIFO;
		ИначеЕсли Найти(Наименование, "fi") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиКТК.Fi;
		ИначеЕсли Найти(Наименование, "fo") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиКТК.Fo;
		КонецЕсли;
	Иначе
		Если Найти(Наименование, "door") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиПоПортам.DOOR;
		ИначеЕсли Найти(Наименование, "fi") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиПоПортам.Fi;
		ИначеЕсли Найти(Наименование, "fo") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиПоПортам.Fo;
		ИначеЕсли Найти(Наименование, "li") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиПоПортам.LI;
		ИначеЕсли Найти(Наименование, "lo") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиПоПортам.LO;
		ИначеЕсли Найти(Наименование, "fios") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиПоПортам.FIOS;
		ИначеЕсли Найти(Наименование, "filo") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиПоПортам.FILO;
		ИначеЕсли Найти(Наименование, "lifo") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиПоПортам.LIFO;
		ИначеЕсли Найти(Наименование, "lilo") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиПоПортам.LILO;
		ИначеЕсли Найти(Наименование, "exw") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиПоПортам.EXW;
		ИначеЕсли Найти(Наименование, "fca") > 0 Тогда
			Ответ = Перечисления.УсловияПеревозкиПоПортам.FCA;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

