
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("УказанаСтанцияНазначения") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	АналогиЛокаций.Локация КАК Локация,
		               |	АналогиЛокаций.Аналог КАК Аналог
		               |ИЗ
		               |	РегистрСведений.АналогиЛокаций КАК АналогиЛокаций
		               |ГДЕ
		               |	АналогиЛокаций.Локация = &Локация";
		
		Запрос.УстановитьПараметр("Локация", Параметры.УказанаСтанцияНазначения);
		
		Результат = Запрос.Выполнить();
		Мас = Результат.Выгрузить().ВыгрузитьКолонку("Аналог");
		Мас.Добавить( Параметры.УказанаСтанцияНазначения );
		
		Спис = Новый СписокЗначений;
		Спис.ЗагрузитьЗначения(Мас);
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ПунктНазначения", Мас, ВидСравненияКомпоновкиДанных.ВСписке,, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ, );
		
		ПользовательскийОтбор = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Список.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
		
		ЭлементОтбора = ПользовательскийОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПунктНазначения");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = Спис;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		ЭлементОтбора.ИдентификаторПользовательскойНастройки = "ПунктНазначения";
		
	КонецЕсли; 
	
	// ДИТ ТА 70350 Сержантова А.С. Начало: 09.06.2023
	Если Параметры.Свойство("КТК") и Параметры.КТК.Количество() > 0 Тогда  
		ОтборПоКТК = Истина;
		СписокКТК.ЗагрузитьЗначения(Параметры.КТК);	
	КонецЕсли;  
	ОбновитьДинамическийСписок();
	// ДИТ ТА 70350 Сержантова А.С. Конец: 09.06.2023
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )



// ++ ДИТ, Сгонник, 2022-03-25 US 46168; TA 48699 необходимо вывести в форму "Отправки (жд-рейсы)" столбец с номером сделки
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Рейсы = Строки.ПолучитьКлючи();
	
	Если Рейсы.Количество() Тогда
		
		// Проверим, нужно ли получать дополнительные поля
		СтрокаСписка = Строки.Получить(Рейсы[0]);
		ДополнительныеПоляВыводятся = СтрокаСписка.Данные.Свойство("Сделка") ИЛИ СтрокаСписка.Данные.Свойство("Контрагент");
	
		Если НЕ ДополнительныеПоляВыводятся Тогда 
			Возврат;
		КонецЕсли;
	Иначе
		// список пустой
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СделкаРейсы.Рейс КАК Рейс,
		|	СделкаРейсы.Ссылка.Номер КАК Сделка,
		|	НЕОПРЕДЕЛЕНО КАК Контрагент
		|ИЗ
		|	Документ.Сделка.Рейсы КАК СделкаРейсы
		|ГДЕ
		|	СделкаРейсы.Рейс В(&Рейсы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаявкаПереченьРейсов.Рейс,
		|	НЕОПРЕДЕЛЕНО,
		|	ЗаявкаПереченьРейсов.Ссылка.Контрагент
		|ИЗ
		|	Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
		|ГДЕ
		|	ЗаявкаПереченьРейсов.Рейс В(&Рейсы)";
	
	Запрос.УстановитьПараметр("Рейсы", Рейсы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТаблицаДополнительныеПоля = Новый ТаблицаЗначений;
	ТаблицаДополнительныеПоля.Колонки.Добавить("Рейс", Новый ОписаниеТипов("СправочникСсылка.РейсыЖД"));
	ТаблицаДополнительныеПоля.Колонки.Добавить("Сделка", Новый ОписаниеТипов("Строка"));
	ТаблицаДополнительныеПоля.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("Строка"));
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НайденнаяСтрока = ТаблицаДополнительныеПоля.Найти(ВыборкаДетальныеЗаписи.Рейс, "Рейс");
		Если НайденнаяСтрока = Неопределено Тогда 
			НайденнаяСтрока = ТаблицаДополнительныеПоля.Добавить();
			НайденнаяСтрока.Рейс = ВыборкаДетальныеЗаписи.Рейс;
		КонецЕсли;
		НайденнаяСтрока.Сделка = НайденнаяСтрока.Сделка 
			+ ?(ЗначениеЗаполнено(НайденнаяСтрока.Сделка) И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сделка), ";", "") 
			+ ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сделка), ВыборкаДетальныеЗаписи.Сделка, ""); 
		НайденнаяСтрока.Контрагент = НайденнаяСтрока.Контрагент 
			+ ?(ЗначениеЗаполнено(НайденнаяСтрока.Контрагент) И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Контрагент), ";", "") 
			+ ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Контрагент), ВыборкаДетальныеЗаписи.Контрагент, ""); 
	КонецЦикла;
	
	Для Каждого СтрокаТаблицыДополнительныеПоля Из ТаблицаДополнительныеПоля Цикл 
		СтрокаСписка = Строки[СтрокаТаблицыДополнительныеПоля.Рейс];
		// выводим для всех полей отдельно, чтобы если первое поле не выводится, следующее поле заполнялось
		Попытка
			СтрокаСписка.Данные["Сделка"] = СтрокаТаблицыДополнительныеПоля.Сделка;            
		Исключение
			// в порции данных строки с таким ключом может и не быть
		КонецПопытки;
		Попытка
			СтрокаСписка.Данные["Контрагент"] = СтрокаТаблицыДополнительныеПоля.Контрагент;            
		Исключение
			// в порции данных строки с таким ключом может и не быть
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры
// -- ДИТ, Сгонник, 2022-03-25 US 46168; TA 48699 необходимо вывести в форму "Отправки (жд-рейсы)" столбец с номером сделки

// ДИТ ТА 70350 Сержантова А.С. Начало: 09.06.2023
&НаКлиенте
Процедура ОтборПоКТКПриИзменении(Элемент)
	ОбновитьДинамическийСписок();
КонецПроцедуры

// ДИТ ТА 70350 Сержантова А.С. Начало: 09.06.2023
&НаКлиенте
Процедура СписокКТКПриИзменении(Элемент)
	ОбновитьДинамическийСписок();
КонецПроцедуры 

// ДИТ ТА 70350 Сержантова А.С. Начало: 09.06.2023
&НаСервере
Процедура ОбновитьДинамическийСписок()
	
	Если ОтборПоКТК Тогда   
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
			Список, "ОтборПоКТК", Истина, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
			Список, "СписокКТК", СписокКТК, Истина);   
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
			Список, "ОтборПоКТК", Ложь, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
			Список, "СписокКТК", Новый СписокЗначений, Истина);	
	КонецЕсли;	 

КонецПроцедуры    

// ДИТ ТА 70350 Сержантова А.С. Начало: 09.06.2023
&НаКлиенте
Процедура ОтборПоКТКИзExcel(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВставкиКТКExcel", ЭтаФорма, Новый Структура("КТК", Истина));
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("КТК", Истина), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// ДИТ ТА 70350 Сержантова А.С. Начало: 09.06.2023
&НаКлиенте
Процедура ОбработкаВставкиКТКExcel(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 <> неопределено И Параметр2 <> неопределено И Параметр2.Свойство("КТК") Тогда
		
		СписокКТК.ЗагрузитьЗначения(Параметр1);
		ОбновитьДинамическийСписок();
		
	КонецЕсли;
	
КонецПроцедуры

