Функция НайтиСоздатьГруз(ИмяГруза) Экспорт
	
	Если ИмяГруза = "" тогда возврат неопределено; КонецЕсли;
	
	ГрузСсылка = Справочники.Грузы.НайтиПоНаименованию(ИмяГруза);
	Если НЕ ЗначениеЗаполнено(ГрузСсылка) Тогда
		
		НГруз = СПравочники.Грузы.СоздатьЭлемент();
		НГруз.Наименование = ИмяГруза;
		НГруз.Записать();
		ГрузСсылка = НГруз.Ссылка;
		
	КонецЕсли;
	
	Возврат ГрузСсылка;
	
КонецФункции

Функция НайтиВагон(НомерВагона) Экспорт 
	
	Результат = Неопределено;
	Если НомерВагона = "" Тогда Возврат Результат; КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ТС.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ТС КАК ТС
	               |ГДЕ
	               |	НЕ ТС.ПометкаУдаления
	               |	И ТС.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование", НомерВагона);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции