
Функция УдалитьСозданиеПовагоннойСделки(МассивСтруктур) ЭКСПОРТ
	
	МассивСозданныхСделок = Новый Массив;
	
	КвантВремени = Константы.ИнтервалСозданияСделокПовагонки.Получить();
	
	РезультатЗапроса = ЗапросПоискаВагоновДляСделок(МассивСтруктур);

	ТЗ = РезультатЗапроса.Выгрузить();
	
	Если ТЗ.Количество() = 0 Тогда
		Возврат МассивСозданныхСделок;
	КонецЕсли;
	
	НачальнаяДатаДиапазонов = НачальнаяДатаДиапазоновСделки(ТЗ);
	
	ПроверкаКалькуляцийНаСоответствие(ТЗ);
	
	ДополнитьИнтерваламиТаблицу(ТЗ,НачальнаяДатаДиапазонов,КвантВремени);
	
	РезультатЗапроса = ЗапросНаВыборкуСделок(ТЗ);
	
	ВыборкаСделка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	//Евросиб Каблов 12.10.2020 ( Ticket#0209868 
	//При ошибках проведения сделок (по разным причинам, например счет выставлен), они успешно записывались с рейсом.
	//После исправления ошибок, вооще невозможно создавать было формировать сделки, так как рейс уже есть в другой сделке. 
	НачатьТранзакцию();
	//Евросиб Каблов 12.10.2020 )
	
	Пока ВыборкаСделка.Следующий() Цикл
		
		ПолучОб = Неопределено;
		// будем использовать эту переменную, чтобы понять, где именно был получен объект сделки, 
		// чтобы знать на какой итерации цикла его записывать
		МоментСозданияСделки = 0;
		
		// Если у нас есть сделки для данных вагонов, то записываем в них информацию.
		// перед этим нужно проверить, что по правилам формирования документов (в договоре клиента)
		// не установлен ли 0 в кванте времени. если установлен, то 1 вагон = 1 сделка 
		Если ЗначениеЗаполнено(ВыборкаСделка.Сделка) И НЕ КвантВремени = 0 Тогда
			ПолучОб = ВыборкаСделка.Сделка.ПолучитьОбъект();
			МоментСозданияСделки = 1;
		КонецЕсли;
	
		ВыборкаДатаОтправления = ВыборкаСделка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаДатаОтправления.Следующий() Цикл
			
			// если сделку для данного кванта не нашли, то проверить, 
			// когда создавался последний диапазон, произвести расчет, когда начать текущий.
			// создать сделку.
	
			ВыборкаДетальныеЗаписи = ВыборкаДатаОтправления.Выбрать();
			
			// если квант времени не 0, тогда создаем сделку тут, если 0, то создаем ее в детальных записях
			Если НЕ КвантВремени = 0 И (МоментСозданияСделки = 0 ИЛИ МоментСозданияСделки = 2) Тогда
				ПолучОб = СоздатьКвантВремениИСделку(ВыборкаДатаОтправления.ДатаОтправления,КвантВремени);
				МоментСозданияСделки = 2;
			КонецЕсли;
	
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Если КвантВремени = 0 Тогда
					ПолучОб = СоздатьКвантВремениИСделку(ВыборкаДатаОтправления.ДатаОтправления,КвантВремени);
					МоментСозданияСделки = 3;
				КонецЕсли;
				
				
				ЗаполнениеСозданнойСделки(ПолучОб,ВыборкаДетальныеЗаписи,КвантВремени,МоментСозданияСделки,МассивСозданныхСделок);
				
				
			КонецЦикла;
			
			Если МоментСозданияСделки = 2 Тогда
				Попытка
					ПолучОб.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					//Евросиб Каблов 12.10.2020 ( Ticket#0209868
					//ПолучОб.Записать(РежимЗаписиДокумента.Запись);
					ОтменитьТранзакцию();
					//Евросиб Каблов 12.10.2020 )					
				КонецПопытки;
				
				СохраненннаяСделкаОбъект = ПолучОб.Ссылка.ПолучитьОбъект();
				//Евросиб Каблов 14.10.2020 (
				//доходы_ЗаполнитьПоЗаявкам2(СохраненннаяСделкаОбъект,МоментСозданияСделки);

				//Попытка
				//	СохраненннаяСделкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
				//Исключение
				//	//Евросиб Каблов 12.10.2020 ( Ticket#0209868
				//	//СохраненннаяСделкаОбъект.Записать(РежимЗаписиДокумента.Запись);
				//	ОтменитьТранзакцию();
				//	//Евросиб Каблов 12.10.2020 )
				//КонецПопытки;
				//Евросиб Каблов 14.10.2020 )
				МассивСозданныхСделок.Добавить(СохраненннаяСделкаОбъект);
				ЗаписатьСделкуВРегистр(СохраненннаяСделкаОбъект.Ссылка,СохраненннаяСделкаОбъект.СвязьУчетныхЕдиниц.ВыгрузитьКолонку("Вагон"));
				
			КонецЕсли;
			
			
			
		КонецЦикла;
		
		Если МоментСозданияСделки = 1 Тогда
			Попытка
				ПолучОб.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				//Евросиб Каблов 12.10.2020 ( Ticket#0209868
				//ПолучОб.Записать(РежимЗаписиДокумента.Запись);
				ОтменитьТранзакцию();
				//Евросиб Каблов 12.10.2020 )
			КонецПопытки;
			
			СохраненннаяСделкаОбъект = ПолучОб.Ссылка.ПолучитьОбъект();
			//Евросиб Каблов 14.10.2020 (
			//доходы_ЗаполнитьПоЗаявкам2(СохраненннаяСделкаОбъект,МоментСозданияСделки);

			//Попытка
			//	СохраненннаяСделкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
			//Исключение
			//	//Евросиб Каблов 12.10.2020 ( Ticket#0209868
			//	//СохраненннаяСделкаОбъект.Записать(РежимЗаписиДокумента.Запись);
			//	ОтменитьТранзакцию();
			//	//Евросиб Каблов 12.10.2020 )
			//КонецПопытки;
			//Евросиб Каблов 14.10.2020 )
			
			МассивСозданныхСделок.Добавить(СохраненннаяСделкаОбъект);
			ЗаписатьСделкуВРегистр(СохраненннаяСделкаОбъект.Ссылка,СохраненннаяСделкаОбъект.СвязьУчетныхЕдиниц.ВыгрузитьКолонку("Вагон"));
			
		КонецЕсли;
		
	КонецЦикла;
	
	//Евросиб Каблов 12.10.2020 ( Ticket#0209868
	Если ТранзакцияАктивна() Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		МассивСозданныхСделок.Очистить();
	КонецЕсли;
	//Евросиб Каблов 12.10.2020 )
	
	Возврат МассивСозданныхСделок;
	
КонецФункции

Функция СозданиеПовагоннойСделки(МассивСтруктур, Сделка = Неопределено) ЭКСПОРТ
	
	МассивСозданныхСделок = Новый Массив;
	
	РезультатЗапроса = ЗапросПоискаВагоновДляСделок(МассивСтруктур);
	ТЗ = РезультатЗапроса.Выгрузить();
	
	Если ТЗ.Количество() = 0 Тогда
		Возврат МассивСозданныхСделок;
	КонецЕсли;
	
	ПроверкаКалькуляцийНаСоответствие(ТЗ);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВремТЧ.НомерВагона КАК НомерВагона,
	|	ВремТЧ.Период КАК Период,
	|	ВремТЧ.Клиент КАК Клиент,
	|	ВремТЧ.Договор КАК Договор,
	|	ВремТЧ.СтанцияОтправления КАК СтанцияОтправления,
	|	ВремТЧ.Заявка КАК Заявка,
	|	ВремТЧ.СтанцияНазначения КАК СтанцияНазначения,
	|	ВремТЧ.ПСЦ КАК ПСЦ,
	|	ВремТЧ.Груз КАК Груз,
	|	ВремТЧ.ДатаОтправления КАК ДатаОтправления,
	|	ВремТЧ.Калькуляция КАК Калькуляция,
	|	ВремТЧ.ДатаОкончанияДвижения КАК ДатаОкончанияДвижения,
	|	ВремТЧ.ВагонВПути КАК ВагонВПути,
	|	ВремТЧ.НачалоПосуточногоДиапазона КАК НачалоПосуточногоДиапазона,
	|	ВремТЧ.ОкончаниеПосуточногоДиапазона КАК ОкончаниеПосуточногоДиапазона,
	|	ВремТЧ.ПосуточнаяОплата КАК ПосуточнаяОплата,
	|	ВремТЧ.НДС КАК НДС,
	|	ВремТЧ.Контейнер КАК Контейнер,
	|	ВремТЧ.ЖДНакладная КАК ЖДНакладная
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ВремТЧ КАК ВремТЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВагоныВОтправке.Отправка КАК Отправка,
	|	ЗаявкаПереченьРейсов.Ссылка КАК Ссылка,
	|	ВагоныВОтправке.Вагон КАК Вагон
	|ПОМЕСТИТЬ РейсыВЗаявке
	|ИЗ
	|	Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВагоныВОтправке КАК ВагоныВОтправке
	|		ПО ЗаявкаПереченьРейсов.Рейс = ВагоныВОтправке.Отправка
	|ГДЕ
	|	ЗаявкаПереченьРейсов.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ.Заявка
	|			ИЗ
	|				ВТ КАК ВТ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.НомерВагона КАК НомерВагона,
	|	ВТ.Период КАК Период,
	|	ВТ.Клиент КАК Клиент,
	|	ВТ.Договор КАК Договор,
	|	ВТ.СтанцияОтправления КАК СтанцияОтправления,
	|	ВТ.Заявка КАК Заявка,
	|	ВТ.СтанцияНазначения КАК СтанцияНазначения,
	|	ВТ.ПСЦ КАК ПСЦ,
	|	ВТ.Груз КАК Груз,
	|	ВТ.ДатаОтправления КАК ДатаОтправления,
	|	ВТ.ДатаОтправления КАК ДатаОтправленияДляРегистра,
	|	ВТ.Калькуляция КАК Калькуляция,
	|	ВТ.НДС КАК НДС,
	|	РейсыВЗаявке.Отправка КАК РейсЖД,
	|	РейсыВЗаявке.Ссылка КАК РейсСсылка,
	|	ВТ.ДатаОкончанияДвижения КАК ДатаОкончанияДвижения,
	|	ВТ.НачалоПосуточногоДиапазона КАК НачалоПосуточногоДиапазона,
	|	ВТ.ОкончаниеПосуточногоДиапазона КАК ОкончаниеПосуточногоДиапазона,
	|	ВТ.ПосуточнаяОплата КАК ПосуточнаяОплата,
	|	ВТ.ЖДНакладная КАК ЖДНакладная,
	|	ВТ.Контейнер КАК Контейнер,
	|	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Сделка,
	|	ТранспортныйДокумент.НомерТранспортногоДокумента КАК НомерЖДН,
	|	Грузы.Ссылка КАК ГрузИзНакладной,
	|	ЗаявкаСоставУслуги.ГУИДСтроки КАК ГУИДСтрокиЗаявки
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РейсыВЗаявке КАК РейсыВЗаявке
	|		ПО ВТ.НомерВагона = РейсыВЗаявке.Вагон
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|		ПО ВТ.НомерВагона = СделкаСвязьУчетныхЕдиниц.Вагон
	|			И ВТ.ЖДНакладная = СделкаСвязьУчетныхЕдиниц.ЖДН
	|			И (НЕ СделкаСвязьУчетныхЕдиниц.Ссылка.ПометкаУдаления)
	|			И (НЕ СделкаСвязьУчетныхЕдиниц.Удалена)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.ГрузыЖД КАК э_НакладнаяГрузыЖД
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Грузы КАК Грузы
	|				ПО (ПОДСТРОКА(э_НакладнаяГрузыЖД.КодЕТСНГ, 1, 5) = ПОДСТРОКА(Грузы.ЕТСНГ, 1, 5))
	|			ПО ТранспортныйДокумент.НакладнаяЭТРАН = э_НакладнаяГрузыЖД.Ссылка
	|				И (э_НакладнаяГрузыЖД.НомерСтроки = 1)
	|		ПО ВТ.ЖДНакладная = ТранспортныйДокумент.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|		ПО ВТ.Заявка = ЗаявкаСоставУслуги.Ссылка
	|			И ВТ.НомерВагона = ЗаявкаСоставУслуги.Вагон
	|			И (ВТ.Контейнер = ЗаявкаСоставУслуги.НомерКТК
	|				ИЛИ ЗаявкаСоставУслуги.НомерКТК = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка))";
	Запрос.УстановитьПараметр("ВремТЧ", ТЗ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Отказ = Ложь;
	//Евросиб Каблов 14.04.2021 ( Ticket#0227609
	//СделкаОбъект = СоздатьНовуюСделку();
	Если ЗначениеЗаполнено(Сделка) Тогда
		СделкаОбъект = Сделка.ПолучитьОбъект();
	Иначе
		СделкаОбъект = СоздатьНовуюСделку();
	КонецЕсли;
	//Евросиб Каблов 14.04.2021 ) 
	Пока Выборка.Следующий() Цикл
		//Евросиб Каблов 09.03.2021 ( Ticket#0225180 Не нужно проверять служебные сделки. Как их отличить, неизвестно. Поэтому проверку отключил.
		//Если ЗначениеЗаполнено(Выборка.Сделка) Тогда
		//	ТекстСообщения = СтрШаблон("По вагону %1 и ЖД накладной %2 уже есть сделка %3", Выборка.НомерВагона, Выборка.ЖДНакладная, Выборка.Сделка);			
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		//КонецЕсли;
		//Евросиб Каблов 09.03.2021 ) 
		ПСЦПодписан = ПроверитьСтатусПодписанияПСЦ(Выборка.Заявка, Выборка.Контейнер);
		Если НЕ ПСЦПодписан Тогда
			ТекстСообщения = СтрШаблон("По вагону %1 и заявке %2 ПСЦ не согласован.", Выборка.НомерВагона, Выборка.Заявка);			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
		ЗаполнениеСозданнойСделки(СделкаОбъект, Выборка, 1, 1, МассивСозданныхСделок);
		
		Если Не ЗначениеЗаполнено(Выборка.ГУИДСтрокиЗаявки) Тогда
			ТекстСообщения = СтрШаблон("В заявке %2 не найдена строка с вагоном %1", Выборка.НомерВагона, Выборка.Заявка);			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
	//ДИТ, Беляев СЮ, Ticket#0311227, 26-05-2023, начало
	Документы.Сделка.ЗаполнитьОтветственногоЗаУчет(СделкаОбъект);
	//ДИТ, Беляев СЮ, Ticket#0311227, 26-05-2023, конец
	
	Если Не Отказ Тогда	
		СделкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		МассивСозданныхСделок.Добавить(СделкаОбъект);
		Выборка.Сбросить();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьПолеСделкаВЗаписиПовагоннойОтправки(Выборка.НомерВагона, Выборка.Период, СделкаОбъект.Ссылка);
		КонецЦикла;
	КонецЕсли;
		
	Возврат МассивСозданныхСделок;
	
КонецФункции

Процедура ЗаполнитьПолеСделкаВЗаписиПовагоннойОтправки(Вагон, Период, Сделка) Экспорт
	
	Запись = РегистрыСведений.ПовагонныеОтправки.СоздатьМенеджерЗаписи();
	Запись.Вагон = Вагон;
	Запись.Период = Период;
	
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Запись.Сделка = Сделка;
		Запись.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьСтатусПодписанияПСЦ(Заявка, Контейнер)
	
	Результат = Ложь;
	
	//Евросиб Каблов 19.10.2020
	//Протокол должен быть согласован без замечаний или подписан
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ВЫБОР
	                |		КОГДА Заявка.ПСЦ <> ЗНАЧЕНИЕ(Документ.ПСЦ.ПустаяСсылка)
	                |			ТОГДА Заявка.ПСЦ
	                |		ИНАЧЕ Заявка.Ссылка.ПСЦ
	                |	КОНЕЦ КАК ПСЦ
	                |ПОМЕСТИТЬ НайдПСЦ
	                |ИЗ
	                |	Документ.Заявка КАК Заявка
	                |ГДЕ
	                |	Заявка.Ссылка = &Ссылка
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	НайдПСЦ.ПСЦ.СтатусДокумента В (&РазрСтатусы)
	                |		ИЛИ НайдПСЦ.ПСЦ.МаксимальнаяДатаПодписанияСДвухСторон > &ТекДата КАК УсловиеЪ
	                |ИЗ
	                |	НайдПСЦ КАК НайдПСЦ";
	Запрос.УстановитьПараметр("Ссылка", Заявка);
	Запрос.УстановитьПараметр("НомерКТК", Контейнер);
	Запрос.УстановитьПараметр("ТекДата", НачалоДня(ТекущаяДата()));
	РазрСтатусы = Новый Массив;
	РазрСтатусы.Добавить(Перечисления.СтатусыСогласования.Подписано);
	РазрСтатусы.Добавить(Перечисления.СтатусыСогласования.СогласованоБезЗамечаний);
	РазрСтатусы.Добавить(Перечисления.СтатусыСогласования.СогласованСКомментариями);
	Запрос.УстановитьПараметр("РазрСтатусы", РазрСтатусы);
	Ответ = запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Если Ответ.УсловиеЪ = Истина Тогда Результат = Истина; КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
	//"ВЫБРАТЬ
	//|	ВЫБОР
	//|		КОГДА Заявка.ПСЦ.ПодписанСДвухСторон
	//|			ТОГДА ИСТИНА
	//|		КОГДА Заявка.ПСЦ.МаксимальнаяДатаПодписанияСДвухСторон >= &ТекДата
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ КАК ПСЦПодписан
	//|ИЗ
	//|	Документ.Заявка КАК Заявка
	//|ГДЕ
	//|	Заявка.Ссылка = &Ссылка";
	//Запрос.УстановитьПараметр("Ссылка", Заявка);
	//Запрос.УстановитьПараметр("ТекДата", НачалоДня(ТекущаяДата()));
	//РезультатЗапроса = Запрос.Выполнить();
	//Возврат РезультатЗапроса.Выгрузить()[0].ПСЦПодписан;
	
КонецФункции

Функция СоздатьНовуюСделку()
	
	НоваяСделка = Документы.Сделка.СоздатьДокумент();
	НоваяСделка.Заполнить(Неопределено);
	НоваяСделка.Дата = ТекущаяДата();
	НоваяСделка.ТипЗаказа = Справочники.ТипыЗаказов.ПовагоннаяОтправка;
	НоваяСделка.Автор = Пользователи.ТекущийПользователь();
	НоваяСделка.ЦФО = НоваяСделка.Автор.ЦФО;
	НоваяСделка.Создано = ТекущаяДата();
	НоваяСделка.Организация = Константы.ОсновнаяОрганизация.Получить();
	НоваяСделка.Маршрутизировать = Константы.МаршрутизироватьСделку.Получить();
	НоваяСделка.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	НоваяСделка.ПовагонныеОтправки = Истина;
	//НоваяСделка.ДатаНачалаПериодаПовагонки = НачалоДня(ДатаОтправления);
	//НоваяСделка.ДатаОкончанияПериодаПовагонки = КонецДня(ДатаОтправления + (КвантВремени-1)*3600*24);
	
	Возврат НоваяСделка;
	
КонецФункции

Функция СоздатьСделку(ДатаОтправления, КвантВремени)
	
	НоваяСделка = Документы.Сделка.СоздатьДокумент();
	НоваяСделка.Заполнить(Неопределено);
	НоваяСделка.Дата = ТекущаяДата();
	НоваяСделка.ТипЗаказа = Справочники.ТипыЗаказов.ПовагоннаяОтправка;
	НоваяСделка.Автор = Пользователи.ТекущийПользователь();
	НоваяСделка.ЦФО = НоваяСделка.Автор.ЦФО;
	НоваяСделка.Создано = ТекущаяДата();
	НоваяСделка.Организация = Константы.ОсновнаяОрганизация.Получить();
	НоваяСделка.Маршрутизировать = Константы.МаршрутизироватьСделку.Получить();
	НоваяСделка.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	НоваяСделка.ПовагонныеОтправки = Истина;
	
	// поиск кванта времени
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Сделка.ДатаОкончанияПериодаПовагонки КАК ДатаОкончанияПериодаПовагонки
	               |ИЗ
	               |	Документ.Сделка КАК Сделка
	               |ГДЕ
	               |	НЕ Сделка.ДатаОкончанияПериодаПовагонки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |	И НЕ Сделка.ДатаНачалаПериодаПовагонки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |	И Сделка.ДатаОкончанияПериодаПовагонки < &ТекДатаОтпр
	               |	И НЕ Сделка.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаОкончанияПериодаПовагонки УБЫВ";
	Запрос.УстановитьПараметр("ТекДатаОтпр",ДатаОтправления);
	РЗ = Запрос.Выполнить();
	
	Если РЗ.Пустой() Тогда
		
		// если не нашли дат ранее текущей, то проверить, нет ли дат после нее
		Запрос2 = Новый Запрос;
		Запрос2.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		                |	Сделка.ДатаНачалаПериодаПовагонки КАК ДатаНачалаПериодаПовагонки
		                |ИЗ
		                |	Документ.Сделка КАК Сделка
		                |ГДЕ
		                |	НЕ Сделка.ДатаОкончанияПериодаПовагонки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		                |	И НЕ Сделка.ДатаНачалаПериодаПовагонки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		                |	И Сделка.ДатаНачалаПериодаПовагонки > &ТекДатаОтпр
		                |	И НЕ Сделка.ПометкаУдаления
		                |
		                |УПОРЯДОЧИТЬ ПО
		                |	Сделка.ДатаНачалаПериодаПовагонки";
		Запрос2.УстановитьПараметр("ТекДатаОтпр",ДатаОтправления);
		РЗ2 = Запрос2.Выполнить();
		
		// если и здесь пусто, то считаем эту дату начальной и от нее строим всю остальную цепочку
		Если РЗ2.Пустой() Тогда
			НоваяСделка.ДатаНачалаПериодаПовагонки = НачалоДня(ДатаОтправления);
			НоваяСделка.ДатаОкончанияПериодаПовагонки = КонецДня(ДатаОтправления + (КвантВремени-1)*3600*24);
			
		// если что-то нашли, то создаем сделку так, чтобы между найденной и текущей были равные кванту времени промежутки
		Иначе
			Ответ2 = Запрос2.Выполнить().Выбрать();
		
			Если Ответ2.Следующий() Тогда
				ДельтаДни = (Ответ2.ДатаНачалаПериодаПовагонки - ДатаОтправления)/3600/24;
				КолвоИнтервалов = Цел(ДельтаДни/КвантВремени);
				ВсегоДнейВИнтервалах = КолвоИнтервалов*КвантВремени;
				ОстатокПоДням = ДельтаДни - ВсегоДнейВИнтервалах;
				НачалоПервогоЗаИскомымПериода = Ответ2.ДатаНачалаПериодаПовагонки - ВсегоДнейВИнтервалах*3600*24;
				НачалоИскомогоПериода = НачалоПервогоЗаИскомымПериода - (КвантВремени-1)*3600*24;
				// вычитаем единицу, чтобы интервалы не пересекались
				КонецИскомогоПериода = НачалоПервогоЗаИскомымПериода - 1;
				
				НоваяСделка.ДатаНачалаПериодаПовагонки = НачалоДня(НачалоИскомогоПериода);
				НоваяСделка.ДатаОкончанияПериодаПовагонки = КонецДня(КонецИскомогоПериода);
			КонецЕсли;
		КонецЕсли;
		
	// если что-то нашли, то создаем сделку так, чтобы между найденной и текущей были равные кванту времени промежутки
	Иначе
		Ответ = Запрос.Выполнить().Выбрать();
		
		Если Ответ.Следующий() Тогда
			ДельтаДни = (ДатаОтправления - Ответ.ДатаОкончанияПериодаПовагонки)/3600/24;
			КолвоИнтервалов = Цел(ДельтаДни/КвантВремени);
			ВсегоДнейВИнтервалах = КолвоИнтервалов*КвантВремени;
			ОстатокПоДням = ДельтаДни - ВсегоДнейВИнтервалах;
			ОкончаниеПоследнегоПередИскомымПериода = Ответ.ДатаОкончанияПериодаПовагонки + ВсегоДнейВИнтервалах*3600*24;
			// добавляем единицу, чтобы интервалы не пересекались
			НачалоИскомогоПериода = ОкончаниеПоследнегоПередИскомымПериода + 1;
			КонецИскомогоПериода = НачалоИскомогоПериода + (КвантВремени-1)*3600*24;
			
			НоваяСделка.ДатаНачалаПериодаПовагонки = НачалоДня(НачалоИскомогоПериода);
			НоваяСделка.ДатаОкончанияПериодаПовагонки = КонецДня(КонецИскомогоПериода);
		КонецЕсли;
	КонецЕсли;
	
	Возврат НоваяСделка;
	
КонецФункции

Процедура ЗаполнениеСозданнойСделки(ПолучОб,ВыборкаДетальныеЗаписи,КвантВремени,МоментСозданияСделки,МассивСозданныхСделок)
	
	// если создаем сделку в режиме один вагон = одна сделка, то в реквизит СделкаДляВагона занесем номер вагона для того,
	// чтобы при подборе подходящих диапазонов сделок для други вагонов, не записывать в эту сделку ничего
	Если КвантВремени = 0 Тогда
		ПолучОб.СделкаДляВагона = ВыборкаДетальныеЗаписи.НомерВагона;
	КонецЕсли;

	
	// заполняем полученную сделку
	Заявка = ВыборкаДетальныеЗаписи.Заявка;
	
	ПолучОб.СтанцияОтправления = ?(НЕ ЗначениеЗаполнено(ПолучОб.СтанцияОтправления),ВыборкаДетальныеЗаписи.СтанцияОтправления,ПолучОб.СтанцияОтправления);
	ПолучОб.СтанцияНазначения = ?(НЕ ЗначениеЗаполнено(ПолучОб.СтанцияНазначения),ВыборкаДетальныеЗаписи.СтанцияНазначения,ПолучОб.СтанцияНазначения);
	ПолучОб.Подразделение = ?(НЕ ЗначениеЗаполнено(ПолучОб.Подразделение),Заявка.Подразделение,ПолучОб.Подразделение);
	
	// добавить рейс в сделку, проверив на уникальность
	ПараметрыОТбора = Новый Структура;
	ПараметрыОТбора.Вставить("Рейс",ВыборкаДетальныеЗаписи.РейсЖД);
	НайденныеРейсы = ПолучОб.Рейсы.НайтиСтроки(ПараметрыОТбора);
	Если НайденныеРейсы.Количество() = 0 Тогда
		ТЧРейсы = ПолучОб.Рейсы.Добавить();
		ТЧРейсы.Рейс = ВыборкаДетальныеЗаписи.РейсЖД;
	КонецЕсли;				
	// добавить заявку и калькуляцию в сделку, проверив на уникальность
	ПараметрыОТбора = Новый Структура;
	ПараметрыОТбора.Вставить("Заявка",Заявка);
	НайденныеРейсы = ПолучОб.Заявки.НайтиСтроки(ПараметрыОТбора);
	
	Если НайденныеРейсы.Количество() = 0 Тогда
		ТЧЗаявки = ПолучОб.Заявки.Добавить();
		ТЧЗаявки.Заявка = Заявка;
		ТЧЗаявки.Калькуляция = ВыборкаДетальныеЗаписи.Калькуляция;
	КонецЕсли;				

	// заполнить ТЧ СвязьУчетныхЕдиниц, проверив на уникальность.
	// !!!!! но если вагон есть, то проверить у него диапазон дат. если он совпадает, то ничего не меняем.
	// если не совпадает, то изменить даты диапазона
	ПарамОтб = Новый Структура;
	ПарамОтб.Вставить("Вагон",ВыборкаДетальныеЗаписи.НомерВагона);
	ПарамОтб.Вставить("ЖДН",ВыборкаДетальныеЗаписи.ЖДНакладная);
	ПарамОтб.Вставить("Контейнер",ВыборкаДетальныеЗаписи.Контейнер);
	НайденныйВаг = ПолучОб.СвязьУчетныхЕдиниц.НайтиСтроки(ПарамОтб);
	Для Каждого НВ ИЗ НайденныйВаг Цикл
		Если НЕ НВ.ДатаНачалаПериодаПовагонки = НачалоДня(ВыборкаДетальныеЗаписи.ДатаОтправления) Тогда
			Если НачалоДня(ВыборкаДетальныеЗаписи.ДатаОтправления) <= ПолучОб.ДатаНачалаПериодаПовагонки Тогда
				НВ.ДатаНачалаПериодаПовагонки = НачалоДня(ВыборкаДетальныеЗаписи.ДатаОтправления);
			КонецЕсли;
		КонецЕсли;
		Если НЕ НВ.ДатаОкончанияПериодаПовагонки = КонецДня(ВыборкаДетальныеЗаписи.ОкончаниеПосуточногоДиапазона) Тогда
			Если КонецДня(ВыборкаДетальныеЗаписи.ОкончаниеПосуточногоДиапазона) >= НВ.ДатаОкончанияПериодаПовагонки Тогда
				НВ.ДатаОкончанияПериодаПовагонки = КонецДня(ВыборкаДетальныеЗаписи.ОкончаниеПосуточногоДиапазона);
			КонецЕсли;
		КонецЕсли;
		НВ.ДатаОтправки = ВыборкаДетальныеЗаписи.ДатаОтправленияДляРегистра;
	КонецЦикла;
	Если НайденныйВаг.Количество() = 0 Тогда
		НСтр = ПолучОб.СвязьУчетныхЕдиниц.Добавить();
		//Евросиб Каблов 14.10.2020
		нСтр.ГотовоКВыставлению = Истина;
		//Субботин 72190 30.06.2023
		нСтр.ВидТранспортногоСообщения = Перечисления.ВидыТранспортныхСообщений.ЖД;
		//Субботин 72190 30.06.2023
		НСтр.Заявка = Заявка;
		НСтр.ГУИДСтрокиЗаявки = ВыборкаДетальныеЗаписи.ГУИДСтрокиЗаявки;
		НСтр.Клиент = ВыборкаДетальныеЗаписи.Клиент;
		НСтр.Договор = ВыборкаДетальныеЗаписи.Договор;
		НСтр.Груз = ВыборкаДетальныеЗаписи.Груз;
		Если Не ЗначениеЗаполнено(НСтр.Груз) Тогда
			НСтр.Груз = ВыборкаДетальныеЗаписи.ГрузИзНакладной;
		КонецЕсли;
		НСтр.Калькуляция = ВыборкаДетальныеЗаписи.Калькуляция;
		//Евросиб Каблов 28.06.2021 ( Ticket#0230281
		НСтр.Протокол = ВыборкаДетальныеЗаписи.ПСЦ;
		//Евросиб Каблов 28.06.2021 ) 
		НСтр.Вагон = ВыборкаДетальныеЗаписи.НомерВагона;
		НСтр.ДатаНачалаПериодаПовагонки = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.НачалоПосуточногоДиапазона),ВыборкаДетальныеЗаписи.НачалоПосуточногоДиапазона,ПолучОб.ДатаНачалаПериодаПовагонки);
		НСтр.ДатаОкончанияПериодаПовагонки = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ОкончаниеПосуточногоДиапазона),ВыборкаДетальныеЗаписи.ОкончаниеПосуточногоДиапазона,ПолучОб.ДатаОкончанияПериодаПовагонки);
		НСтр.ДатаОтправки = ВыборкаДетальныеЗаписи.ДатаОтправленияДляРегистра;
		//НСтр.ЖДН = ПолучитьЖДН(ВыборкаДетальныеЗаписи);
		НСтр.ЖДН = ВыборкаДетальныеЗаписи.ЖДНакладная;
		НСтр.НомерЖДН = ВыборкаДетальныеЗаписи.НомерЖДН;
		НСтр.Контейнер = ВыборкаДетальныеЗаписи.Контейнер;
		НСтр.Груженый = Истина;
		//НСтр.НомерВагоннойЖДН = РаботаСоСделкамиСервер.НайтиПодсылПорожнегоВагонаПоЭТРАН(
		//										ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДетальныеЗаписи.НомерВагона, "Наименование"),
		//										ВыборкаДетальныеЗаписи.ДатаОтправления, 
		//										ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДетальныеЗаписи.СтанцияОтправления,"КодЖДСтанции"),
		//										40);
		СтруктураВагоннаяЖДН = РаботаСоСделкамиСервер.НайтиПодсылПорожнегоВагонаПоЭТРАН(
												ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДетальныеЗаписи.НомерВагона, "Наименование"),
												ВыборкаДетальныеЗаписи.ДатаОтправления, 
												ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДетальныеЗаписи.СтанцияОтправления,"КодЖДСтанции"),
												40);
		нСтр.НомерВагоннойЖДН = СтруктураВагоннаяЖДН.НакладнаяПодсылаВагона;
		Если ЗначениеЗаполнено(СтруктураВагоннаяЖДН.НакладнаяПодсылаВагонаСсылка) Тогда
			нСтр.ВагоннаяЖДН = РаботаСоСделкамиСервер.ПолучитьТДПоНакладнойЭтран(СтруктураВагоннаяЖДН.НакладнаяПодсылаВагонаСсылка);
		КонецЕсли;
		НСтр.ГУИД = Новый УникальныйИдентификатор;
		
	КонецЕсли;
	
	Если МоментСозданияСделки = 3 Тогда
		Попытка
			ПолучОб.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			//ПолучОб.Записать(РежимЗаписиДокумента.Запись);
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();
			КонецЕсли;
		КонецПопытки;
		
		СохраненннаяСделкаОбъект = ПолучОб.Ссылка.ПолучитьОбъект();
		//Евросиб Каблов 14.10.2020
		//доходы_ЗаполнитьПоЗаявкам2(СохраненннаяСделкаОбъект,МоментСозданияСделки);
		//ПолучОб.ДополнитьЭкономикуДаннымиПодсыловПоЖДН();

		//Попытка
		//	СохраненннаяСделкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//Исключение
		//	СохраненннаяСделкаОбъект.Записать(РежимЗаписиДокумента.Запись);
		//КонецПопытки;
		//Евросиб Каблов 14.10.2020 )
		МассивСозданныхСделок.Добавить(СохраненннаяСделкаОбъект);
		ЗаписатьСделкуВРегистр(СохраненннаяСделкаОбъект.Ссылка,НСтр.Вагон);
		
	КонецЕсли;
	
				
КонецПроцедуры

Функция ПолучитьЖДН(ПараметрыПоиска)
	
	ЖДН = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТранспортныйДокумент.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	|		ПО э_НакладнаяВагоны.Ссылка = ТранспортныйДокумент.НакладнаяЭТРАН
	|ГДЕ
	|	э_НакладнаяВагоны.НомерВагона = &НомерВагона
	|	И ТранспортныйДокумент.Ссылка.СтанцияНазначения = &СтанцияНазначения
	|	И ТранспортныйДокумент.Ссылка.СтанцияОтправления = &СтанцияОтправления
	|	И НАЧАЛОПЕРИОДА(ТранспортныйДокумент.ДатаОтправления, ДЕНЬ) МЕЖДУ ДОБАВИТЬКДАТЕ(&ДатаОтправления, ДЕНЬ, -3) И &ДатаОтправления
	|	И (э_НакладнаяВагоны.Ссылка.ТекущееСостояниеНакладнойДействующийСтатус
	|			ИЛИ э_НакладнаяВагоны.Ссылка.ИсточникНакладной = ЗНАЧЕНИЕ(Перечисление.ИсточникЖДН.ГВЦ))";
	Запрос.УстановитьПараметр("НомерВагона", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыПоиска.НомерВагона, "Наименование"));
	//Запрос.УстановитьПараметр("СтанцияНазначения", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыПоиска.СтанцияНазначения, "КодЖДСтанции"));
	//Запрос.УстановитьПараметр("СтанцияОтправления", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыПоиска.СтанцияОтправления, "КодЖДСтанции"));
	Запрос.УстановитьПараметр("СтанцияНазначения", ПараметрыПоиска.СтанцияНазначения);
	Запрос.УстановитьПараметр("СтанцияОтправления", ПараметрыПоиска.СтанцияОтправления);
	Запрос.УстановитьПараметр("ДатаОтправления", ПараметрыПоиска.ДатаОтправленияДляРегистра);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ЖДН = РезультатЗапроса.Выгрузить()[0].Ссылка; 
	КонецЕсли; 
	Возврат ЖДН;
	
КонецФункции
 
	
Функция ЗапросНаВыборкуСделок(ТЗ)
	// проверяем, есть ли в системе сделки, созданные на этот период.
	// у таких сделок не долже быть заполнен реквизит СделкаДляВагона, т.к. его заполненность означает, 
	// что данная сделка создана в режиме один вагон = одна сделка и добавлять в нее больше ничего нельзя. 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВремТЧ.НомерВагона КАК НомерВагона,
		|	ВремТЧ.Клиент КАК Клиент,
		|	ВремТЧ.Договор КАК Договор,
		|	ВремТЧ.СтанцияОтправления КАК СтанцияОтправления,
		|	ВремТЧ.Заявка КАК Заявка,
		|	ВремТЧ.СтанцияНазначения КАК СтанцияНазначения,
		|	ВремТЧ.ПСЦ КАК ПСЦ,
		|	ВремТЧ.Груз КАК Груз,
		|	ВремТЧ.ДатаОтправления КАК ДатаОтправления,
		|	ВремТЧ.Калькуляция КАК Калькуляция,
		|	ВремТЧ.ДатаОкончанияДвижения КАК ДатаОкончанияДвижения,
		|	ВремТЧ.ВагонВПути КАК ВагонВПути,
		|	ВремТЧ.НачалоПосуточногоДиапазона КАК НачалоПосуточногоДиапазона,
		|	ВремТЧ.ОкончаниеПосуточногоДиапазона КАК ОкончаниеПосуточногоДиапазона,
		|	ВремТЧ.ПосуточнаяОплата КАК ПосуточнаяОплата,
		|	ВремТЧ.НДС КАК НДС,
		|	ВремТЧ.Контейнер КАК Контейнер,
		|	ВремТЧ.ЖДНакладная КАК ЖДНакладная
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ВремТЧ КАК ВремТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВагоныВОтправке.Отправка КАК Отправка,
		|	ЗаявкаПереченьРейсов.Ссылка КАК Ссылка,
		|	ВагоныВОтправке.Вагон КАК Вагон
		|ПОМЕСТИТЬ РейсыВЗаявке
		|ИЗ
		|	Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВагоныВОтправке КАК ВагоныВОтправке
		|		ПО ЗаявкаПереченьРейсов.Рейс = ВагоныВОтправке.Отправка
		|ГДЕ
		|	ЗаявкаПереченьРейсов.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ.Заявка
		|			ИЗ
		|				ВТ КАК ВТ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.НомерВагона КАК НомерВагона,
		|	ВТ.Клиент КАК Клиент,
		|	ВТ.Договор КАК Договор,
		|	ВТ.СтанцияОтправления КАК СтанцияОтправления,
		|	ВТ.Заявка КАК Заявка,
		|	ВТ.СтанцияНазначения КАК СтанцияНазначения,
		|	ВТ.ПСЦ КАК ПСЦ,
		|	ВТ.Груз КАК Груз,
		|	ВТ.ДатаОтправления КАК ДатаОтправления,
		|	ВТ.Калькуляция КАК Калькуляция,
		|	ВТ.НДС КАК НДС,
		|	РейсыВЗаявке.Отправка КАК РейсЖД,
		|	РейсыВЗаявке.Ссылка КАК РейсСсылка,
		|	ВТ.ДатаОкончанияДвижения КАК ДатаОкончанияДвижения,
		|	ВТ.НачалоПосуточногоДиапазона КАК НачалоПосуточногоДиапазона,
		|	ВТ.ОкончаниеПосуточногоДиапазона КАК ОкончаниеПосуточногоДиапазона,
		|	ВТ.ПосуточнаяОплата КАК ПосуточнаяОплата,
		|	ВТ.ЖДНакладная КАК ЖДНакладная,
		|	ВТ.Контейнер КАК Контейнер
		|ПОМЕСТИТЬ РейсыВТ
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РейсыВЗаявке КАК РейсыВЗаявке
		|		ПО ВТ.НомерВагона = РейсыВЗаявке.Вагон
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РейсыВТ.НомерВагона КАК НомерВагона,
		|	МАКСИМУМ(Сделка.Ссылка) КАК Сделка
		|ПОМЕСТИТЬ ВозможныеСделки
		|ИЗ
		|	РейсыВТ КАК РейсыВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Рейсы КАК Сделка
		|		ПО РейсыВТ.РейсСсылка = Сделка.Рейс
		|ГДЕ
		|	НЕ Сделка.Ссылка.ДатаНачалаПериодаПовагонки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И НЕ Сделка.Ссылка.ДатаОкончанияПериодаПовагонки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И НЕ Сделка.Ссылка.ПометкаУдаления
		|	И НЕ РейсыВТ.ПосуточнаяОплата
		|	И Сделка.Ссылка.СделкаДляВагона = ЗНАЧЕНИЕ(Справочник.ТС.ПустаяССылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	РейсыВТ.НомерВагона
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РейсыВТ.НомерВагона КАК НомерВагона,
		|	МАКСИМУМ(Сделка.Ссылка) КАК Сделка,
		|	РейсыВТ.НачалоПосуточногоДиапазона КАК НачалоПосуточногоДиапазона,
		|	РейсыВТ.ОкончаниеПосуточногоДиапазона КАК ОкончаниеПосуточногоДиапазона
		|ПОМЕСТИТЬ ВозможныеСделкиПосуточные
		|ИЗ
		|	РейсыВТ КАК РейсыВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
		|		ПО (НАЧАЛОПЕРИОДА(РейсыВТ.НачалоПосуточногоДиапазона, ДЕНЬ) МЕЖДУ НАЧАЛОПЕРИОДА(Сделка.ДатаНачалаПериодаПовагонки, ДЕНЬ) И КОНЕЦПЕРИОДА(Сделка.ДатаОкончанияПериодаПовагонки, ДЕНЬ))
		|			И (НАЧАЛОПЕРИОДА(РейсыВТ.ОкончаниеПосуточногоДиапазона, ДЕНЬ) МЕЖДУ НАЧАЛОПЕРИОДА(Сделка.ДатаНачалаПериодаПовагонки, ДЕНЬ) И КОНЕЦПЕРИОДА(Сделка.ДатаОкончанияПериодаПовагонки, ДЕНЬ))
		|ГДЕ
		|	НЕ Сделка.ДатаНачалаПериодаПовагонки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И НЕ Сделка.ДатаОкончанияПериодаПовагонки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И НЕ Сделка.ПометкаУдаления
		|	И РейсыВТ.ПосуточнаяОплата
		|	И Сделка.СделкаДляВагона = ЗНАЧЕНИЕ(Справочник.ТС.ПустаяССылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	РейсыВТ.НомерВагона,
		|	РейсыВТ.НачалоПосуточногоДиапазона,
		|	РейсыВТ.ОкончаниеПосуточногоДиапазона
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РейсыВТ.НомерВагона КАК НомерВагона,
		|	РейсыВТ.Клиент КАК Клиент,
		|	РейсыВТ.Договор КАК Договор,
		|	РейсыВТ.СтанцияОтправления КАК СтанцияОтправления,
		|	РейсыВТ.Заявка КАК Заявка,
		|	РейсыВТ.СтанцияНазначения КАК СтанцияНазначения,
		|	РейсыВТ.ПСЦ КАК ПСЦ,
		|	РейсыВТ.Груз КАК Груз,
		|	РейсыВТ.ДатаОтправления КАК ДатаОтправления,
		|	РейсыВТ.Калькуляция КАК Калькуляция,
		|	РейсыВТ.НДС КАК НДС,
		|	РейсыВТ.РейсЖД КАК РейсЖД,
		|	ВозможныеСделки.Сделка КАК Сделка,
		|	РейсыВТ.ДатаОкончанияДвижения КАК ДатаОкончанияДвижения,
		|	РейсыВТ.НачалоПосуточногоДиапазона КАК НачалоПосуточногоДиапазона,
		|	РейсыВТ.ОкончаниеПосуточногоДиапазона КАК ОкончаниеПосуточногоДиапазона,
		|	РейсыВТ.ПосуточнаяОплата КАК ПосуточнаяОплата,
		|	РейсыВТ.ДатаОтправления КАК ДатаОтправленияДляРегистра,
		|	РейсыВТ.ЖДНакладная КАК ЖДНакладная,
		|	РейсыВТ.Контейнер КАК Контейнер
		|ИЗ
		|	РейсыВТ КАК РейсыВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВозможныеСделки КАК ВозможныеСделки
		|		ПО РейсыВТ.НомерВагона = ВозможныеСделки.НомерВагона
		|ГДЕ
		|	НЕ РейсыВТ.ПосуточнаяОплата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РейсыВТ.НомерВагона,
		|	РейсыВТ.Клиент,
		|	РейсыВТ.Договор,
		|	РейсыВТ.СтанцияОтправления,
		|	РейсыВТ.Заявка,
		|	РейсыВТ.СтанцияНазначения,
		|	РейсыВТ.ПСЦ,
		|	РейсыВТ.Груз,
		|	РейсыВТ.НачалоПосуточногоДиапазона,
		|	РейсыВТ.Калькуляция,
		|	РейсыВТ.НДС,
		|	РейсыВТ.РейсЖД,
		|	ВозможныеСделкиПосуточные.Сделка,
		|	РейсыВТ.ДатаОкончанияДвижения,
		|	РейсыВТ.НачалоПосуточногоДиапазона,
		|	РейсыВТ.ОкончаниеПосуточногоДиапазона,
		|	РейсыВТ.ПосуточнаяОплата,
		|	РейсыВТ.ДатаОтправления,
		|	РейсыВТ.ЖДНакладная,
		|	РейсыВТ.Контейнер
		|ИЗ
		|	РейсыВТ КАК РейсыВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВозможныеСделкиПосуточные КАК ВозможныеСделкиПосуточные
		|		ПО РейсыВТ.НомерВагона = ВозможныеСделкиПосуточные.НомерВагона
		|			И РейсыВТ.НачалоПосуточногоДиапазона = ВозможныеСделкиПосуточные.НачалоПосуточногоДиапазона
		|			И РейсыВТ.ОкончаниеПосуточногоДиапазона = ВозможныеСделкиПосуточные.ОкончаниеПосуточногоДиапазона
		|ГДЕ
		|	РейсыВТ.ПосуточнаяОплата
		|ИТОГИ ПО
		|	Сделка,
		|	ДатаОтправления";
	
	Запрос.УстановитьПараметр("ВремТЧ",ТЗ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

Процедура ДополнитьИнтерваламиТаблицу(ТЗ,НачальнаяДатаДиапазонов,КвантВремени)
	// создадим копию таблицы ТЗ (только колонки, данные не нужны), для того, чтобы в нее добавить новые строки - 
	// это будут вагоны в посуточном режиме с другими периодами.
	ТЗ_Копия = ТЗ.СкопироватьКолонки();
	
	Для Каждого Стр ИЗ ТЗ Цикл
		
		// т.к. вагоны могут быть рассчитаны посуточно, то нужно разбить посуточный 
		// вагон на периоды сделки и добавить нужное количество строк
		Если Стр.ПосуточнаяОплата Тогда
			// проверяем, есть ли уже выставленные дни
			Если ЗначениеЗаполнено(Стр.КоличествоДнейОборот) И
				Стр.КоличествоДнейОборот>0 Тогда
				// если да, то проверить, какой промежуток времени они покрывают
				ВыставленоДоДаты = Стр.ДатаОтправления + Стр.КоличествоДнейОборот*3600*24;
			Иначе
				ВыставленоДоДаты = Стр.ДатаОтправления;
			КонецЕсли;
			// надо проверить по квантам сделки, 
			// есть ли возможность записать вагон в сделку так, чтобы ее даты начала и окончания повагонки 
			// покрывали период от ВыставленоДоДаты до ДатаОкончанияДвижения.
			СтруктураОтвета = ПолучитьДиапазоныДатПоСделкам(ВыставленоДоДаты,КонецДня(Стр.ДатаОкончанияДвижения),КвантВремени,НачальнаяДатаДиапазонов,Стр.ВагонВПути);
			
			// по количеству элементов массива добавляем во временную таблицу строки для вагона
			Для Каждого Эл Из СтруктураОтвета Цикл
				НовСтр = ТЗ_Копия.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр,Стр);
				НовСтр.НачалоПосуточногоДиапазона = Эл.ДатаНач;
				НовСтр.ОкончаниеПосуточногоДиапазона = Эл.ДатаКон;
				НовСтр.Изменена = Истина;
			КонецЦикла;
		КонецЕсли;
			
	КонецЦикла;
	
	// вносим все данные из ТЗ_Копия в основную ТЗ, при этом первую строку таблицы нужно не добавить, а
	// изменить ею существующую
	Для Каждого Стр Из ТЗ_Копия Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("НомерВагона",Стр.НомерВагона);
		ПараметрыОтбора.Вставить("ДатаОтправления",Стр.ДатаОтправления);
		ПараметрыОтбора.Вставить("Контейнер", Стр.Контейнер);
		ПараметрыОтбора.Вставить("ЖДНакладная", Стр.ЖДНакладная);
		ПараметрыОтбора.Вставить("Изменена",Ложь);
		НайденныеСтр = ТЗ.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтр.Количество()>0 Тогда
			НайденныеСтр[0].НачалоПосуточногоДиапазона = Стр.НачалоПосуточногоДиапазона;
			НайденныеСтр[0].ОкончаниеПосуточногоДиапазона = Стр.ОкончаниеПосуточногоДиапазона;
			НайденныеСтр[0].Изменена = Истина;
		Иначе
			НовСтр = ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр,Стр);
		КонецЕсли;
		
	КонецЦикла;
	
	ТЗ.Сортировать("НомерВагона,ДатаОтправления,НачалоПосуточногоДиапазона");
	
КонецПроцедуры

Процедура ПроверкаКалькуляцийНаСоответствие(ТЗ)
	// для каждой строки проверить наличие калькуляции. если ни одна калькуляция не подошла, 
	// то очистить ПСЦ в регистре и не учитывать такие строки при  создании сделки.
	// в запросе без цикл это сделать не удалось из-за необходимости проверок в ИЕРАРХИИ
	
	Для Каждого Стр Из ТЗ Цикл
		
		// проверять нужно только те строки, у которых не заполнена калькуляция или заполнена, но не подходящая
		Если ЗначениеЗаполнено(Стр.Калькуляция) И НЕ Стр.КалькуляцияНеПодходит Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыЗапроса = Новый СТруктура;
		ПараметрыЗапроса.Вставить("ПунктОтправления",Стр.СтанцияОтправления);
		ПараметрыЗапроса.Вставить("ПунктНазначения",Стр.СтанцияНазначения);
		ПараметрыЗапроса.Вставить("НДС",Стр.НДС);
		ПараметрыЗапроса.Вставить("ТипТС",Стр.ТипТС);
	
		СписокКальк = Новый СписокЗначений;
		СписокКальк.ЗагрузитьЗначения(ПолучитьСписокПодходящихКалькуляций(ПараметрыЗапроса));
		
		Если СписокКальк.Количество() = 0 Тогда
			Стр.Калькуляция = Документы.Калькуляция.ПустаяСсылка();
			
			ТекЗапись = РегистрыСведений.ПовагонныеОтправки.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(ТекЗапись,Стр);
			ТекЗапись2 = РегистрыСведений.ПовагонныеОтправки.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(ТекЗапись2, ТекЗапись);
			
			ТекЗапись.Прочитать();
			Если НЕ ТекЗапись.Выбран() Тогда
				ЗаполнитьЗначенияСвойств(ТекЗапись, ТекЗапись2);
			КонецЕсли;
			
			ТекЗапись.ПСЦ = Документы.ПСЦ.ПустаяСсылка();
			ТекЗапись.Калькуляция = Документы.Калькуляция.ПустаяСсылка();
			
			ТекЗапись.Записать();
			
		Иначе
			// калькуляцию нужно записать в регистр, но сейчас этого делать не будем - запишем вместе со сделкой.
			//ТЗ.Калькуляция = СписокКальк.Получить(0).Значение;
			Стр.Калькуляция = СписокКальк.Получить(0).Значение;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция НачальнаяДатаДиапазоновСделки(ТЗ)
	
	// если в системе пока нет ни одной повагонной сделки (т.е. такой, у которой заполнены реквизиты с 
	// датами повагонки), то нужно выбрать в данном запросе самую раннюю дату отправки и сохранить ее
	// в переменную для вычисления квантов времени для посуточной оплаты. если сделки по повагонке есть,
	// то взять самую раннюю дату, а от нее отсчитать интервалы
	НачальнаяДатаДиапазонов = Неопределено;	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Сделка.ДатаНачалаПериодаПовагонки КАК ДатаНачалаПериодаПовагонки
	               |ИЗ
	               |	Документ.Сделка КАК Сделка
	               |ГДЕ
	               |	НЕ Сделка.ДатаНачалаПериодаПовагонки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |	И НЕ Сделка.ДатаОкончанияПериодаПовагонки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |	И НЕ Сделка.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаНачалаПериодаПовагонки";
	Если Запрос.Выполнить().Пустой() Тогда
		ТЗ.Сортировать("ДатаОтправления");
		НачальнаяДатаДиапазонов = НачалоДня(ТЗ[0].ДатаОтправления);
	Иначе
		Ответ = Запрос.Выполнить().Выбрать();
		Если Ответ.Следующий() Тогда
			НачальнаяДатаДиапазонов = НачалоДня(Ответ.ДатаНачалаПериодаПовагонки);
		КонецЕсли;
	КонецЕсли;
	
	Возврат НачальнаяДатаДиапазонов;
	
КонецФункции

Функция ЗапросПоискаВагоновДляСделок(МассивСтруктур)
	
	ТблВагонов = Новый ТаблицаЗначений;
	ТблВагонов.Колонки.Добавить("ДатаПомещенияВРежимПовагонки",Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТблВагонов.Колонки.Добавить("НомерВагона",Новый ОписаниеТипов("СправочникСсылка.ТС"));
	ТблВагонов.Колонки.Добавить("ДатаОтправления",Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТблВагонов.Колонки.Добавить("ЖДНакладная", Новый ОписаниеТипов("ДокументСсылка.ТранспортныйДокумент"));
	ТблВагонов.Колонки.Добавить("Контейнер", Новый ОписаниеТипов("СправочникСсылка.ТЕ"));	
	                                                                                 
	Для Каждого Эл Из МассивСтруктур Цикл
		НовСтр = ТблВагонов.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Эл);
	КонецЦикла;
	
	// делаем запрос по регистру ПовагонныеОтправки и ДислокацияВагонов, чтобы получить для
	// каждого вагона его отправку со станции отправления.
	// интересуют только те вагоны, которые:
	// 1. находятся в повагонке
	// 2. не заполнена сделка ИЛИ заполнена, но вариант оплаты вагона - ПОСУТОЧНО или ОбщаяПоКоличествуДнейИСНП 
	//							и на либо у него не заполнены даты отправки со станции назначения или окочания пользования
	//								либо даты заполнены, но по колву выставленных дней сделок не хватает
	// 3. есть подходящая по рейсу заявка
	// 
	
	// из регистра ВыставлениеПосуточнойАренды выбираем только те записи, регистратором которых является 
	// сделка, т.к. нам нужно выяснить, на какое количество дней уже есть документы
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВремТЧ.НомерВагона КАК НомерВагона,
	|	ВремТЧ.ДатаПомещенияВРежимПовагонки КАК Период,
	|	ВремТЧ.ДатаОтправления КАК ДатаОтправления,
	|	ВремТЧ.Контейнер КАК Контейнер,
	|	ВремТЧ.ЖДНакладная КАК ЖДНакладная
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ВремТЧ КАК ВремТЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	//|	СУММА(ЕСТЬNULL(ВыставлениеПосуточнойАрендыОбороты.КоличествоДнейОборот, 0)) КАК КоличествоДнейОборот,
	|	0 КАК КоличествоДнейОборот,
	|	ВТ.НомерВагона КАК НомерВагона,
	|	ВТ.ДатаОтправления КАК ДатаОтправки,
	|	ВТ.ЖДНакладная КАК ЖДНакладная,
	|	ВТ.Контейнер КАК Контейнер,
	|	ВТ.Период КАК Период
	|ПОМЕСТИТЬ НеДОвыставленныеВагоны
	|ИЗ
	|	ВТ КАК ВТ
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыставлениеПосуточнойАренды.Обороты(, , Регистратор, ) КАК ВыставлениеПосуточнойАрендыОбороты
	//|		ПО ВТ.НомерВагона = ВыставлениеПосуточнойАрендыОбороты.НомерВагона
	//|			И ВТ.ДатаОтправления = ВыставлениеПосуточнойАрендыОбороты.Период
	//|			И (ВыставлениеПосуточнойАрендыОбороты.Регистратор ССЫЛКА Документ.Сделка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.НомерВагона,
	|	ВТ.ДатаОтправления,
	|	ВТ.ЖДНакладная,
	|	ВТ.Контейнер,
	|	ВТ.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НеДОвыставленныеВагоны.Период КАК Период,
	|	ПовагонныеОтправки.Вагон КАК НомерВагона,
	|	ПовагонныеОтправки.СтанцияОтправления КАК СтанцияОтправления,
	|	ПовагонныеОтправки.Сделка КАК Сделка,
	|	ПовагонныеОтправки.Клиент КАК Клиент,
	|	ПовагонныеОтправки.Договор КАК Договор,
	|	ПовагонныеОтправки.Груженый КАК Груженый,
	|	ПовагонныеОтправки.Заявка КАК Заявка,
	|	ПовагонныеОтправки.ПСЦ КАК ПСЦ,
	|	ПовагонныеОтправки.Комментарий КАК Комментарий,
	|	ПовагонныеОтправки.ДатаОтправления КАК ДатаОтправления,
	|	ПовагонныеОтправки.НДС КАК НДС,
	|	ПовагонныеОтправки.Калькуляция КАК Калькуляция,
	|	ПовагонныеОтправки.КалькуляцияНеПодходит КАК КалькуляцияНеПодходит,
	|	ВЫБОР
	|		КОГДА НЕ ПовагонныеОтправки.ПереводВНРП = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ПовагонныеОтправки.ПереводВНРП
	|		КОГДА НЕ ПовагонныеОтправки.ДатаОтправленияСоСтанцииНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ПовагонныеОтправки.ДатаОтправленияСоСтанцииНазначения
	|		ИНАЧЕ ПовагонныеОтправки.ДатаОкончанияПользования
	|	КОНЕЦ КАК ДатаОкончанияДвижения,
	|	НеДОвыставленныеВагоны.КоличествоДнейОборот КАК КоличествоДнейОборот,
	|	ПовагонныеОтправки.Груз КАК Груз,
	|	ПовагонныеОтправки.СтанцияНазначения КАК СтанцияНазначения,
	|	НеДОвыставленныеВагоны.ЖДНакладная КАК ЖДНакладная,
	|	НеДОвыставленныеВагоны.Контейнер КАК Контейнер
	|ПОМЕСТИТЬ Повагонка
	|ИЗ
	|	НеДОвыставленныеВагоны КАК НеДОвыставленныеВагоны
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПовагонныеОтправки КАК ПовагонныеОтправки
	|		ПО (ПовагонныеОтправки.Вагон = НеДОвыставленныеВагоны.НомерВагона)
	//Евросиб Каблов 03.11.2020 (
	|			И (ПовагонныеОтправки.Период = НеДОвыставленныеВагоны.Период)
	//Евросиб Каблов )
	|			И (ПовагонныеОтправки.ДатаОтправления = НеДОвыставленныеВагоны.ДатаОтправки)
	|ГДЕ
	|	(ЕСТЬNULL(НеДОвыставленныеВагоны.КоличествоДнейОборот, 0) = 0
	|			ИЛИ НЕ ЕСТЬNULL(НеДОвыставленныеВагоны.КоличествоДнейОборот, 0) = 0
	|				И (НЕ ПовагонныеОтправки.ДатаОтправленияСоСтанцииНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|						И РАЗНОСТЬДАТ(ПовагонныеОтправки.ДатаОтправления, ПовагонныеОтправки.ДатаОтправленияСоСтанцииНазначения, ДЕНЬ) > НеДОвыставленныеВагоны.КоличествоДнейОборот
	|					ИЛИ НЕ ПовагонныеОтправки.ПереводВНРП = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|						И РАЗНОСТЬДАТ(ПовагонныеОтправки.ДатаОтправления, ПовагонныеОтправки.ПереводВНРП, ДЕНЬ) > НеДОвыставленныеВагоны.КоличествоДнейОборот
	|					ИЛИ НЕ ПовагонныеОтправки.ДатаОкончанияПользования = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|						И РАЗНОСТЬДАТ(ПовагонныеОтправки.ДатаОтправления, ПовагонныеОтправки.ДатаОкончанияПользования, ДЕНЬ) > НеДОвыставленныеВагоны.КоличествоДнейОборот
	|					ИЛИ ПовагонныеОтправки.ДатаОтправленияСоСтанцииНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|						И ПовагонныеОтправки.ДатаОкончанияПользования = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|						И РАЗНОСТЬДАТ(ПовагонныеОтправки.ДатаОтправления, &ТекДата, ДЕНЬ) > НеДОвыставленныеВагоны.КоличествоДнейОборот)
	|				И (ПовагонныеОтправки.ПСЦ.ОплатаПользованияВагоном = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПользованияВагоном.Посуточно)
	|					ИЛИ ПовагонныеОтправки.ПСЦ.ОплатаПользованияВагоном = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПользованияВагоном.ОбщаяПоКоличествуДнейИСНП)))
	|	И НЕ ПовагонныеОтправки.ЗаявкаНеПодходит
	|	И НЕ ПовагонныеОтправки.Заявка = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Повагонка.НомерВагона КАК НомерВагона,
	|	Повагонка.Сделка КАК Сделка,
	|	Повагонка.Клиент КАК Клиент,
	|	Повагонка.Договор КАК Договор,
	|	Повагонка.СтанцияОтправления КАК СтанцияОтправления,
	|	Повагонка.Заявка КАК Заявка,
	|	Повагонка.СтанцияНазначения КАК СтанцияНазначения,
	|	Повагонка.ПСЦ КАК ПСЦ,
	|	Повагонка.Комментарий КАК Комментарий,
	|	Повагонка.Груз КАК Груз,
	|	Повагонка.ДатаОтправления КАК ДатаОтправления,
	|	Повагонка.НДС КАК НДС,
	|	Повагонка.НомерВагона.ТипТС КАК ТипТС,
	|	Повагонка.Период КАК Период,
	|	Повагонка.Калькуляция КАК Калькуляция,
	|	Повагонка.КалькуляцияНеПодходит КАК КалькуляцияНеПодходит,
	|	ВЫБОР
	|		КОГДА Повагонка.ДатаОкончанияДвижения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				И (Повагонка.ПСЦ.ОплатаПользованияВагоном = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПользованияВагоном.Посуточно)
	|					ИЛИ Повагонка.ПСЦ.ОплатаПользованияВагоном = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПользованияВагоном.ОбщаяПоКоличествуДнейИСНП))
	|			ТОГДА &ТекДата
	|		ИНАЧЕ Повагонка.ДатаОкончанияДвижения
	|	КОНЕЦ КАК ДатаОкончанияДвижения,
	|	Повагонка.КоличествоДнейОборот КАК КоличествоДнейОборот,
	|	ВЫБОР
	|		КОГДА Повагонка.ДатаОкончанияДвижения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				И (Повагонка.ПСЦ.ОплатаПользованияВагоном = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПользованияВагоном.Посуточно)
	|					ИЛИ Повагонка.ПСЦ.ОплатаПользованияВагоном = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПользованияВагоном.ОбщаяПоКоличествуДнейИСНП))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВагонВПути,
	|	Повагонка.СтанцияНазначения КАК СтанцияНазначения1,
	|	ПризнакСобственностиВагонаСрезПоследних.ПризнакСобственности КАК ПризнакСобственности,
	|	Повагонка.ЖДНакладная КАК ЖДНакладная,
	|	Повагонка.Контейнер КАК Контейнер
	|ПОМЕСТИТЬ Итоговая
	|ИЗ
	|	Повагонка КАК Повагонка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПризнакСобственностиВагона.СрезПоследних КАК ПризнакСобственностиВагонаСрезПоследних
	|		ПО Повагонка.НомерВагона = ПризнакСобственностиВагонаСрезПоследних.Вагон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итоговая.НомерВагона КАК НомерВагона,
	|	Итоговая.Клиент КАК Клиент,
	|	Итоговая.Договор КАК Договор,
	|	Итоговая.СтанцияОтправления КАК СтанцияОтправления,
	|	Итоговая.Заявка КАК Заявка,
	|	Итоговая.СтанцияНазначения КАК СтанцияНазначения,
	|	Итоговая.ПСЦ КАК ПСЦ,
	|	Итоговая.Комментарий КАК Комментарий,
	|	Итоговая.Груз КАК Груз,
	|	Итоговая.ДатаОтправления КАК ДатаОтправления,
	|	Итоговая.НДС КАК НДС,
	|	Итоговая.ТипТС КАК ТипТС,
	|	Итоговая.Период КАК Период,
	|	Итоговая.Калькуляция КАК Калькуляция,
	|	Итоговая.КалькуляцияНеПодходит КАК КалькуляцияНеПодходит,
	|	Итоговая.ДатаОкончанияДвижения КАК ДатаОкончанияДвижения,
	|	Итоговая.КоличествоДнейОборот КАК КоличествоДнейОборот,
	|	Итоговая.ВагонВПути КАК ВагонВПути,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК НачалоПосуточногоДиапазона,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ОкончаниеПосуточногоДиапазона,
	|	ВЫБОР
	|		КОГДА Итоговая.ПСЦ.ОплатаПользованияВагоном = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПользованияВагоном.Посуточно)
	|				ИЛИ Итоговая.ПСЦ.ОплатаПользованияВагоном = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПользованияВагоном.ОбщаяПоКоличествуДнейИСНП)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПосуточнаяОплата,
	|	ЛОЖЬ КАК Изменена,
	|	Итоговая.ПризнакСобственности КАК ПризнакСобственности,
	|	Итоговая.ЖДНакладная КАК ЖДНакладная,
	|	Итоговая.Контейнер КАК Контейнер
	|ИЗ
	|	Итоговая КАК Итоговая
	|ГДЕ
	|	НЕ Итоговая.ДатаОтправления = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
	
	Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
	Запрос.УстановитьПараметр("ВремТЧ",ТблВагонов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция СоздатьКвантВремениИСделку(ДатаОтправления,КвантВремени)
	
	НоваяСделка = Документы.Сделка.СоздатьДокумент();
	НоваяСделка.Заполнить(Неопределено);
	НоваяСделка.Дата = ТекущаяДата();
	НоваяСделка.ТипЗаказа = Справочники.ТипыЗаказов.ПовагоннаяОтправка;
	НоваяСделка.Автор = Пользователи.ТекущийПользователь();
	НоваяСделка.ЦФО = НоваяСделка.Автор.ЦФО;
	НоваяСделка.Создано = ТекущаяДата();
	НоваяСделка.Организация = Константы.ОсновнаяОрганизация.Получить();
	НоваяСделка.Маршрутизировать = Константы.МаршрутизироватьСделку.Получить();
	НоваяСделка.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	НоваяСделка.ПовагонныеОтправки = Истина;
	
	// поиск кванта времени
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Сделка.ДатаОкончанияПериодаПовагонки КАК ДатаОкончанияПериодаПовагонки
	               |ИЗ
	               |	Документ.Сделка КАК Сделка
	               |ГДЕ
	               |	НЕ Сделка.ДатаОкончанияПериодаПовагонки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |	И НЕ Сделка.ДатаНачалаПериодаПовагонки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |	И Сделка.ДатаОкончанияПериодаПовагонки < &ТекДатаОтпр
	               |	И НЕ Сделка.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаОкончанияПериодаПовагонки УБЫВ";
	Запрос.УстановитьПараметр("ТекДатаОтпр",ДатаОтправления);
	РЗ = Запрос.Выполнить();
	
	Если РЗ.Пустой() Тогда
		
		// если не нашли дат ранее текущей, то проверить, нет ли дат после нее
		Запрос2 = Новый Запрос;
		Запрос2.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		                |	Сделка.ДатаНачалаПериодаПовагонки КАК ДатаНачалаПериодаПовагонки
		                |ИЗ
		                |	Документ.Сделка КАК Сделка
		                |ГДЕ
		                |	НЕ Сделка.ДатаОкончанияПериодаПовагонки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		                |	И НЕ Сделка.ДатаНачалаПериодаПовагонки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		                |	И Сделка.ДатаНачалаПериодаПовагонки > &ТекДатаОтпр
		                |	И НЕ Сделка.ПометкаУдаления
		                |
		                |УПОРЯДОЧИТЬ ПО
		                |	Сделка.ДатаНачалаПериодаПовагонки";
		Запрос2.УстановитьПараметр("ТекДатаОтпр",ДатаОтправления);
		РЗ2 = Запрос2.Выполнить();
		
		// если и здесь пусто, то считаем эту дату начальной и от нее строим всю остальную цепочку
		Если РЗ2.Пустой() Тогда
			НоваяСделка.ДатаНачалаПериодаПовагонки = НачалоДня(ДатаОтправления);
			НоваяСделка.ДатаОкончанияПериодаПовагонки = КонецДня(ДатаОтправления + (КвантВремени-1)*3600*24);
			
		// если что-то нашли, то создаем сделку так, чтобы между найденной и текущей были равные кванту времени промежутки
		Иначе
			Ответ2 = Запрос2.Выполнить().Выбрать();
		
			Если Ответ2.Следующий() Тогда
				ДельтаДни = (Ответ2.ДатаНачалаПериодаПовагонки - ДатаОтправления)/3600/24;
				КолвоИнтервалов = Цел(ДельтаДни/КвантВремени);
				ВсегоДнейВИнтервалах = КолвоИнтервалов*КвантВремени;
				ОстатокПоДням = ДельтаДни - ВсегоДнейВИнтервалах;
				НачалоПервогоЗаИскомымПериода = Ответ2.ДатаНачалаПериодаПовагонки - ВсегоДнейВИнтервалах*3600*24;
				НачалоИскомогоПериода = НачалоПервогоЗаИскомымПериода - (КвантВремени-1)*3600*24;
				// вычитаем единицу, чтобы интервалы не пересекались
				КонецИскомогоПериода = НачалоПервогоЗаИскомымПериода - 1;
				
				НоваяСделка.ДатаНачалаПериодаПовагонки = НачалоДня(НачалоИскомогоПериода);
				НоваяСделка.ДатаОкончанияПериодаПовагонки = КонецДня(КонецИскомогоПериода);
			КонецЕсли;
		КонецЕсли;
		
	// если что-то нашли, то создаем сделку так, чтобы между найденной и текущей были равные кванту времени промежутки
	Иначе
		Ответ = Запрос.Выполнить().Выбрать();
		
		Если Ответ.Следующий() Тогда
			ДельтаДни = (ДатаОтправления - Ответ.ДатаОкончанияПериодаПовагонки)/3600/24;
			КолвоИнтервалов = Цел(ДельтаДни/КвантВремени);
			ВсегоДнейВИнтервалах = КолвоИнтервалов*КвантВремени;
			ОстатокПоДням = ДельтаДни - ВсегоДнейВИнтервалах;
			ОкончаниеПоследнегоПередИскомымПериода = Ответ.ДатаОкончанияПериодаПовагонки + ВсегоДнейВИнтервалах*3600*24;
			// добавляем единицу, чтобы интервалы не пересекались
			НачалоИскомогоПериода = ОкончаниеПоследнегоПередИскомымПериода + 1;
			КонецИскомогоПериода = НачалоИскомогоПериода + (КвантВремени-1)*3600*24;
			
			НоваяСделка.ДатаНачалаПериодаПовагонки = НачалоДня(НачалоИскомогоПериода);
			НоваяСделка.ДатаОкончанияПериодаПовагонки = КонецДня(КонецИскомогоПериода);
		КонецЕсли;
	КонецЕсли;
	
	Возврат НоваяСделка;
	
КонецФункции

Процедура доходы_ЗаполнитьПоЗаявкам2(НоваяСделка,МоментСозданияСделки)ЭКСПОРТ
	
	//Евросиб Каблов 09.04.2025 ( #105407
	//ГлобальныйОткрытыйПериод = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(НоваяСделка.Организация);
	ГлобальныйОткрытыйПериод = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(НоваяСделка.Организация);
	//Евросиб Каблов 09.04.2025 )
	
	РезультатЗапроса = ЗапросЭкономики(НоваяСделка);
	
	ТЗ = РезультатЗапроса.Выгрузить();
	
	МассивТиповЗнач = Новый Массив;
	МассивТиповЗнач.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
	МассивТиповЗнач.Добавить(Тип("ДокументСсылка.ОтчетКомитентуОПродажах"));
	ДопустимыеТипыЗнач = Новый ОписаниеТипов(МассивТиповЗнач);
	
	ТЗ.Колонки.Добавить("УчДокумент",ДопустимыеТипыЗнач);
	
	УслугаДляПовагонки = Константы.УслугаДляПовагоннойЗаявки.Получить();
	УслугаСНП = Константы.УслугаСНППоВагону.Получить();
	// в массив будем заносить новые ГУИДы по СНП
	МассивГУИД_СНП = Новый Массив;
	
	// проставим реализации и даты по ним для всех ранее распределенных вагонов
	РеализацииВЭкономике(НоваяСделка,ТЗ);
	
	
	// сравниваем данные в константах. если интервал на комплект документов больше, 
	// чем на сделку, берем тот интервал, который указывается в сделке
	ИнтервалСделки = Константы.ИнтервалСозданияСделокПовагонки.Получить();
	
	ДополнитьТаблицуИнтерваламиДат(НоваяСделка,ТЗ,ИнтервалСделки,МоментСозданияСделки);
	
	
	// проставим диапазоны дат для всех остальных записей, у которых нет реализаций
	//Для каждого Стр Из ТЗ Цикл
	//	Если Стр.НетУчДокумента И 
	//		НЕ ЗначениеЗаполнено(Стр.ДатаНачалаПериодаПовагонкиУчДок) И 
	//		Не ЗначениеЗаполнено(Стр.ДатаОкончанияПериодаПовагонкиУчДок) Тогда
	//		
	//		ПараметрыОтбора = Новый Структура;
	//		ПараметрыОтбора.Вставить("Клиент",Стр.Клиент);
	//		ПараметрыОтбора.Вставить("Договор",Стр.Договор);
	//		ПараметрыОтбора.Вставить("СтавкаНДС",Стр.СтавкаНДС);
	//		ПараметрыОтбора.Вставить("СуммаВключаетНДС",Стр.СуммаВключаетНДС);
	//		ПараметрыОтбора.Вставить("Валюта",Стр.Валюта);
	//		ПараметрыОтбора.Вставить("ТипВагонов",Стр.ТипВагонов);
	//		ПроверяемаяТЗ = ТЗ.Скопировать(ПараметрыОтбора);
	//		
	//		ВыставлениеВагоновПоПериоду = Стр.ДоговорВыставлениеВагоновПоПериоду;
	//		ИнтервалКомплДок = ?(ВыставлениеВагоновПоПериоду>ИнтервалСделки,ИнтервалСделки,ВыставлениеВагоновПоПериоду);
	//		
	//		СтруктураОтвета = СоздатьКвантВремениРеализации(Стр.ДатаОтправки,ИнтервалКомплДок,ПроверяемаяТЗ);
	//		
	//		Стр.ДатаНачалаПериодаПовагонкиУчДок = СтруктураОтвета.ДатаНач;
	//		Стр.ДатаОкончанияПериодаПовагонкиУчДок = СтруктураОтвета.ДатаКон;
	//		
	//	КонецЕсли;
	//КонецЦикла;
	//
	
	МассивИзмененныхДоходов = Новый Массив;
	
	Для Каждого Стр Из ТЗ Цикл
		
		ВыставлениеВагоновПоПериоду = Стр.ДоговорВыставлениеВагоновПоПериоду;
		ИнтервалКомплДок = ?(ВыставлениеВагоновПоПериоду>ИнтервалСделки,ИнтервалСделки,ВыставлениеВагоновПоПериоду);

		// т.к. при "дополнении" сделки, в ней уже могут быть данные, то вагон в таблице доходов 
		// может встречаться более 1 раза (строка с СНП погрузки, строка с СНП выгрузки, строка с основной перевозкой...)
		// и соединение с таблицей доходыВагоны даст несколько одинаковых строк.
		// поэтому для случая "дополнения" сделки добавить проверку, что данный вагон мы уже обрабатывали
		Если Стр.ВагонПроверен Тогда
			Продолжить;
		КонецЕсли;
		ПараметрыОтбора = Новый СТруктура;
		ПараметрыОтбора.Вставить("Вагон",Стр.Вагон);
		ПараметрыОтбора.Вставить("НачалоПосуточногоДиапазона",Стр.НачалоПосуточногоДиапазона);
		ПараметрыОтбора.Вставить("ОкончаниеПосуточногоДиапазона",Стр.ОкончаниеПосуточногоДиапазона);
		НайденныеСтроки = ТЗ.НайтиСтроки(ПараметрыОтбора);
		Для Каждого Ст Из НайденныеСтроки Цикл
			Ст.ВагонПроверен = Истина;
		КонецЦикла;
		
		
		// проверяем, новый это вагон или уже распределенный.
		// если новый, то смотрим, какая у него группировка. т.к. может быть выбрано несколько вариантов,
		// проверяем по очереди каждый из них. 
		// группировка, которая идет отдельно - ВыставлениеВагоновПоОдному и если необходимо разделять СНП и основную услугу.
		// при отправлении можно создать только СНП на погрузку.
		
		// если идет "дозаполнение" сделки данными по СНП прибытия, то вагоны уже могут быть распределены, поэтому
		// данную проверку не выполнять в этом случае
		
		Если НЕ МоментСозданияСделки = 4 И ЗначениеЗаполнено(Стр.РаспределенныеВагоны) И НЕ МоментСозданияСделки = Неопределено Тогда
			// проверка типа оплаты для вагона. т.к. если вагон уже был ранее распределен и у него НЕ посуточная оплата, то
			// довносить его не нужно.
			// если у вагона посуточная оплата, то надо проверить, на какие диапазоны дат уже есть распределение, а на какие нет
			Если НЕ Стр.ПосуточнаяОплата Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого Стр_Д Из НоваяСделка.Доходы Цикл
				Для Каждого Стр_ДВ Из НоваяСделка.ДоходыВагоны Цикл
					Если Стр_ДВ.ГУИД = Стр_Д.ГУИД ТОгда
						Если НЕ СтрНайти(Стр_ДВ.Вагон,Стр.Вагон.Наименование) = 0 Тогда
							// диапазоны совпали - значит вагон уже добавлен в ТЧ доходы и добавлять его не нужно
							Если Стр.НачалоПосуточногоДиапазона = Стр_Д.ДатаНачалаПериодаПовагонкиУчДок И
								Стр.ОкончаниеПосуточногоДиапазона = Стр_Д.ДатаОкончанияПериодаПовагонкиУчДок Тогда
								Продолжить;
							КонецЕсли;
							// если совпала только дата начала диапазона - значит вагон нужно расширить диапазон дат в документе
							// (т.е. ранее распределение по реализациям было на меньший период, сейчас вагон проехал еще несколько дней и
							// диапазон можно расширить), но только в том случае, если у учдока не стоит признак "Выставлено"
							Если Стр.НачалоПосуточногоДиапазона = Стр_Д.ДатаНачалаПериодаПовагонкиУчДок И
								НЕ Стр.ОкончаниеПосуточногоДиапазона = Стр_Д.ДатаОкончанияПериодаПовагонкиУчДок Тогда
								// проверка на "Высталено"
								УчДокумент2 = НайтиРеализацию(НоваяСделка.Ссылка, Стр_Д.ГУИД);
								УчДокумент2 = ?(ЗначениеЗаполнено(УчДокумент2),УчДокумент2,НайтиОтчет(НоваяСделка.Ссылка, Стр_Д.ГУИД));
								Если НЕ ЗначениеЗаполнено(УчДокумент2) ИЛИ 
									(ЗначениеЗаполнено(УчДокумент2) И НЕ УчДокумент2.Выставлен) Тогда
									Стр_Д.ДатаОкончанияПериодаПовагонкиУчДок = Стр.ОкончаниеПосуточногоДиапазона;
									// надо перенести дату окончания временного диапазона от выставленного документа на текущий
								ИначеЕсли ЗначениеЗаполнено(УчДокумент2) И УчДокумент2.Выставлен Тогда
									Стр.НачалоПосуточногоДиапазона = Стр_Д.ДатаОкончанияПериодаПовагонкиУчДок + 1;
									// нужен пересчет для всех диапазонов дат после этой
									
									
									
									Продолжить;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
		КонецЕсли;
		
		Если МоментСозданияСделки = 4 И 
			(Стр.СНПВыгрузки = 0 И Стр.СНПСледования = 0)Тогда
			Продолжить;
		КонецЕсли;
		
		///////////////////////////////////////////////////////////
		////////////////////// С Н П //////////////////////////////
		ЗаполнениеСНП(ТЗ,Стр,НоваяСделка,МоментСозданияСделки,УслугаСНП,ГлобальныйОткрытыйПериод,МассивГУИД_СНП);
		
		
		// дальнейшее для тех вагонов, по которым нужно добавить только СНП выгрузки и следования, делать не нужно
		Если МоментСозданияСделки = 4 Тогда
			Продолжить;
		КонецЕсли;
		
		Если Стр.ДоговорВыставлениеВагоновПоОдному ИЛИ ВыставлениеВагоновПоПериоду = 0 Тогда
			НСтр = НоваяСделка.Доходы.Добавить(); 
			//ДИТ, Беляев СЮ, ТА48688, 28-03-2022, начало 
			НСтр.ДатаПоявленияСтрокиЭкономики = ТекущаяДата();
			//ДИТ, Беляев СЮ, ТА48688, 28-03-2022, конец
			НСтр.Услуга = УслугаДляПовагонки;
			НСтр.Перевыставляемая = УслугаДляПовагонки.Перевыставляемая;
			НСтр.Калькуляция = Стр.Калькуляция;
			нСтр.ПСЦ = Стр.ЗаявкаПСЦ;
			НСтр.Клиент = Стр.Клиент;
			НСтр.Договор = Стр.Договор;
			НСтр.ГУИД = Строка(Новый УникальныйИдентификатор);
			
			НСтрДоходыВаг = НоваяСделка.ДоходыВагоны.Добавить();
			НСтрДоходыВаг.ГУИД = НСтр.ГУИД;
			НСтрДоходыВаг.Вагон = Стр.Вагон.Наименование;
			
			НСтр.ТипВагонов = Стр.ТипВагонов;
			НСтр.Груз = Стр.Груз;
			
			// в зависимости от указанного способа вычисления суммы, выбираем механизм расчета
			Если Стр.ЗаявкаПСЦ.ОплатаПользованияВагоном = Перечисления.ВариантыОплатыПользованияВагоном.Посуточно ИЛИ
				Стр.ЗаявкаПСЦ.ОплатаПользованияВагоном = Перечисления.ВариантыОплатыПользованияВагоном.ОбщаяПоКоличествуДнейИСНП Тогда
				ДельтаПосуточная = Окр((Стр.ОкончаниеПосуточногоДиапазона - Стр.НачалоПосуточногоДиапазона)/3600/24);
				
				НСтр.Себестоимость = ?(ЗначениеЗаполнено(Стр.НормативСледованияРуб),Стр.НормативСледованияРуб,0)*ДельтаПосуточная;//?(ЗначениеЗаполнено(Стр.ДельтаОбщегоПользования),Стр.ДельтаОбщегоПользования,Стр.НормативСледованияДни);
				НСтр.Вознаграждение = Стр.Вознаграждение;
				НСтр.Ставка = ?(ЗначениеЗаполнено(Стр.НормативСледованияРуб),Стр.НормативСледованияРуб,0)*ДельтаПосуточная;//?(ЗначениеЗаполнено(Стр.ДельтаОбщегоПользования),Стр.ДельтаОбщегоПользования,Стр.НормативСледованияДни);
			ИначеЕсли Стр.ЗаявкаПСЦ.ОплатаПользованияВагоном = Перечисления.ВариантыОплатыПользованияВагоном.ОтдельноПогрузкаПеревозкаВыгрузка Тогда
				НСтр.Себестоимость = Стр.СтавкаЗаРейс;
				НСтр.Вознаграждение = Стр.Вознаграждение;
				НСтр.Ставка = Стр.СтавкаЗаРейс;
			КонецЕсли;
			
			НСтр.Количество = Стр.Количество;
			НСтр.СтавкаНДС = Стр.СтавкаНДС;
			НСтр.НДСВключенВСтоимость = Стр.СуммаВключаетНДС;
			НСтр.ПериодВО = ГлобальныйОткрытыйПериод;
			НСтр.Валюта = Стр.Валюта;
			
			НСтр.СебестоимостьИтого = НСтр.Количество * НСтр.Себестоимость;
			НСтр.ВознаграждениеИтого = НСтр.Количество * НСтр.Вознаграждение;
			НСтр.СтавкаИтого = НСтр.Количество * НСтр.Ставка;
			НСтр.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(НСтр.СтавкаИтого, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НСтр.СтавкаНДС), Истина, НСтр.НДСВключенВСтоимость);
			НСтр.СуммаИтого = НСтр.СтавкаИтого + ?(НСтр.НДСВключенВСтоимость, 0, НСтр.СуммаНДС);
			
			МассивИзмененныхДоходов.Добавить(НСтр.ГУИД);
			
			Продолжить;	
		КонецЕсли;
		
		// проверка на кол-во дней группировки
		Если ВыставлениеВагоновПоПериоду > 0 Тогда
			
			// добавлять вагон отдельной строкой будем только в том случае, если ни одна из проверок не пройдена
			// ИЛИ когда в таблице доходов нет ни одной строки (СНП и отдельные вагоны не считаем).
			НадоДобавитьОтдельнойСтрокой = Ложь;
			
			Если НоваяСделка.Доходы.Количество() = 0 Тогда
				НадоДобавитьОтдельнойСтрокой = Истина;
			КонецЕсли;
			
			// надо найти в ЭТОМ документе реализации, которые
			// 0. заполнены (уч документ заполнен)
			// 1. подходят для данного периода
			// 2. у них не установлен флаг "Выставлен"
			Для ШагЦикла = 0 По НоваяСделка.Доходы.Количество()-1 Цикл
				// используем такую конструкцию для того, чтобы понять, когда цикл идет на последний виток.
				// если при этом не было найдено ни одной строки, которая подходит по условиям, то нужно добавить отдельную строку.
				Стр2 = НоваяСделка.Доходы[ШагЦикла];
				
				// мы не проверяем услуги по СНП и те строки, в которых не указаны даты начала и окончания периода повагонки,
				// т.к. в этих строках указаны те вагоны, которые по условиям договора должны быть отдельно.
				
				УчДокумент2 = НайтиРеализацию(НоваяСделка.Ссылка, Стр2.ГУИД);
				УчДокумент2 = ?(ЗначениеЗаполнено(УчДокумент2),УчДокумент2,НайтиОтчет(НоваяСделка.Ссылка, Стр2.ГУИД));
				Если ЗначениеЗаполнено(УчДокумент2) Тогда
					СтруктураОтвета = ПроверкаНаправления(УчДокумент2);
					Если СтруктураОтвета.Свойство("Отправление") Тогда
						ОтправлениеУчДокумента2 = СтруктураОтвета.Отправление;
						НазначениеУчДокумента2 = СтруктураОтвета.Назначение;
					КонецЕсли;
				КонецЕсли;
				
				Если Стр2.Услуга = УслугаСНП ИЛИ 
					(ЗначениеЗаполнено(УчДокумент2) И
						(НЕ ЗначениеЗаполнено(УчДокумент2.ДатаНачалаПериодаПовагонки) ИЛИ
						НЕ ЗначениеЗаполнено(УчДокумент2.ДатаОкончанияПериодаПовагонки))) Тогда
					
					НадоДобавитьОтдельнойСтрокой = Истина;
					
					Продолжить;
				КонецЕсли;
				
			// !!!!!!! группировка по умолчанию ВСЕГДА: Груз, Калькуляция, Клиент, Договор, СтавкаНДС, СуммаВключаетНДС, Валюта, ТипВагонов
			
				Если НЕ Стр.Клиент = Стр2.Клиент ИЛИ
					НЕ Стр.Договор = Стр2.Договор ИЛИ
					НЕ Стр.СтавкаНДС = Стр2.СтавкаНДС ИЛИ
					НЕ Стр.СуммаВключаетНДС = Стр2.НДСВключенВСтоимость ИЛИ
					НЕ Стр.Валюта = Стр2.Валюта ИЛИ
					НЕ Стр.ТипВагонов = Стр2.ТипВагонов ИЛИ
					(Стр.ПосуточнаяОплата И (НЕ Стр.НачалоПосуточногоДиапазона = Стр2.ДатаНачалаПериодаПовагонкиУчДок ИЛИ
					НЕ Стр.ОкончаниеПосуточногоДиапазона = Стр2.ДатаОкончанияПериодаПовагонкиУчДок)) Тогда
					
					НадоДобавитьОтдельнойСтрокой = Истина;
					Продолжить;
					
				КонецЕсли;
				
				
				Если (ЗначениеЗаполнено(УчДокумент2) И 
					НЕ УчДокумент2.Выставлен И

						((НЕ Стр.ПосуточнаяОплата 
						И Стр.ДатаОтправления >= УчДокумент2.ДатаНачалаПериодаПовагонки И
						Стр.ДатаОтправления <= УчДокумент2.ДатаОкончанияПериодаПовагонки)
						
						ИЛИ (Стр.ПосуточнаяОплата 
						И Стр.НачалоПосуточногоДиапазона >= УчДокумент2.ДатаНачалаПериодаПовагонки  И Стр.НачалоПосуточногоДиапазона <= УчДокумент2.ДатаОкончанияПериодаПовагонки И
						Стр.ОкончаниеПосуточногоДиапазона >= УчДокумент2.ДатаНачалаПериодаПовагонки И Стр.ОкончаниеПосуточногоДиапазона <= УчДокумент2.ДатаОкончанияПериодаПовагонки)))
						
					ИЛИ НЕ ЗначениеЗаполнено(УчДокумент2) Тогда
					
					// !!!!!!! проверяем, не установлен ли в договоре флаг группировки по направлению.
					// если установлен, то проверить, какое направление указано для данного уч документа.
					// если нашли, то добавляем в эту строку доходов текущий вагон (ищем по ГУИД в тч ДоходыВагоны),
					// в тч Доходы увеличиваем Количество на 1 (тоже ищем по ГУИД) и пересчитываем суммы по строке.
					// в другом случае, добавляем новую строку с этим вагоном
					
					Если Стр.ДоговорГруппировкаПоНаправлениям Тогда
						Если Стр.СтанцияОтправления = ОтправлениеУчДокумента2 И
							Стр.СтанцияНазначения = НазначениеУчДокумента2 Тогда
							// ищем ГУИД
							ПараметрыОТбора = Новый Структура;
							ПараметрыОТбора.Вставить("ГУИД",Стр2.ГУИД);
							НайденнаяСтрока = НоваяСделка.ДоходыВагоны.НайтиСтроки(ПараметрыОТбора);
							Если НайденнаяСтрока.Количество()>0 Тогда
								НайденнаяСтрока[0].Вагон = НайденнаяСтрока[0].Вагон + ";" + Стр.Вагон.Наименование;
							КонецЕсли;
							// меяем таблицу доходов (количество и суммы)
							//НайденнаяСтрока = НоваяСделка.Доходы.НайтиСтроки(ПараметрыОТбора);
							//Если НайденнаяСтрока.Количество()>0 Тогда
								Стр2.Количество = Стр2.Количество + 1;
								
								// в зависимости от указанного способа вычисления суммы, выбираем механизм расчета
								Если Стр.ЗаявкаПСЦ.ОплатаПользованияВагоном = Перечисления.ВариантыОплатыПользованияВагоном.Посуточно ИЛИ
									Стр.ЗаявкаПСЦ.ОплатаПользованияВагоном = Перечисления.ВариантыОплатыПользованияВагоном.ОбщаяПоКоличествуДнейИСНП Тогда
									ДельтаПосуточная = Окр((Стр.ОкончаниеПосуточногоДиапазона - Стр.НачалоПосуточногоДиапазона)/3600/24);
									
									ТекСебестоимость = ?(ЗначениеЗаполнено(Стр.НормативСледованияРуб),Стр.НормативСледованияРуб,0)*ДельтаПосуточная; //?(ЗначениеЗаполнено(Стр.ДельтаОбщегоПользования),Стр.ДельтаОбщегоПользования,Стр.НормативСледованияДни);
									ТекВознаграждение = ?(ЗначениеЗаполнено(Стр.Вознаграждение),Стр.Вознаграждение,0);
									ТекСтавка = ?(ЗначениеЗаполнено(Стр.НормативСледованияРуб),Стр.НормативСледованияРуб,0)*ДельтаПосуточная; //?(ЗначениеЗаполнено(Стр.ДельтаОбщегоПользования),Стр.ДельтаОбщегоПользования,Стр.НормативСледованияДни);
									
									Стр2.СебестоимостьИтого = Стр2.СебестоимостьИтого + ТекСебестоимость;
									Стр2.ВознаграждениеИтого = Стр2.ВознаграждениеИтого + ТекВознаграждение;
									Стр2.СтавкаИтого = Стр2.СтавкаИтого + ТекСтавка;
								
								Иначе	
									Стр2.СебестоимостьИтого = Стр2.Количество * Стр2.Себестоимость;
									Стр2.ВознаграждениеИтого = Стр2.Количество * Стр2.Вознаграждение;
									Стр2.СтавкаИтого = Стр2.Количество * Стр2.Ставка;
								КонецЕсли;
								
								Стр2.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Стр2.СтавкаИтого, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Стр2.СтавкаНДС), Истина, Стр2.НДСВключенВСтоимость);
								Стр2.СуммаИтого = Стр2.СтавкаИтого + ?(Стр2.НДСВключенВСтоимость, 0, Стр2.СуммаНДС);
								
								НадоДобавитьОтдельнойСтрокой = Ложь;
								
								МассивИзмененныхДоходов.Добавить(Стр2.ГУИД);
								
								Прервать;
								
							//КонецЕсли;
						Иначе
							НадоДобавитьОтдельнойСтрокой = Истина;
						КонецЕсли;
					Иначе
						// ищем ГУИД
						ПараметрыОТбора = Новый Структура;
						ПараметрыОТбора.Вставить("ГУИД",Стр2.ГУИД);
						НайденнаяСтрока = НоваяСделка.ДоходыВагоны.НайтиСтроки(ПараметрыОТбора);
						Если НайденнаяСтрока.Количество()>0 Тогда
							НайденнаяСтрока[0].Вагон = НайденнаяСтрока[0].Вагон + ";" + Стр.Вагон.Наименование;
						КонецЕсли;
						// меняем таблицу доходов (количество и суммы)
						//НайденнаяСтрока = НоваяСделка.Доходы.НайтиСтроки(ПараметрыОТбора);
						//Если НайденнаяСтрока.Количество()>0 Тогда
							Стр2.Количество = Стр2.Количество + 1;
							
							// в зависимости от указанного способа вычисления суммы, выбираем механизм расчета
							Если Стр.ЗаявкаПСЦ.ОплатаПользованияВагоном = Перечисления.ВариантыОплатыПользованияВагоном.Посуточно ИЛИ
								Стр.ЗаявкаПСЦ.ОплатаПользованияВагоном = Перечисления.ВариантыОплатыПользованияВагоном.ОбщаяПоКоличествуДнейИСНП Тогда
								ДельтаПосуточная = Окр((Стр.ОкончаниеПосуточногоДиапазона - Стр.НачалоПосуточногоДиапазона)/3600/24);
								
								ТекСебестоимость = ?(ЗначениеЗаполнено(Стр.НормативСледованияРуб),Стр.НормативСледованияРуб,0)*ДельтаПосуточная; //?(ЗначениеЗаполнено(Стр.ДельтаОбщегоПользования),Стр.ДельтаОбщегоПользования,Стр.НормативСледованияДни);
								ТекВознаграждение = ?(ЗначениеЗаполнено(Стр.Вознаграждение),Стр.Вознаграждение,0);
								ТекСтавка = ?(ЗначениеЗаполнено(Стр.НормативСледованияРуб),Стр.НормативСледованияРуб,0)*ДельтаПосуточная; //?(ЗначениеЗаполнено(Стр.ДельтаОбщегоПользования),Стр.ДельтаОбщегоПользования,Стр.НормативСледованияДни);
								
								Стр2.СебестоимостьИтого = Стр2.СебестоимостьИтого + ТекСебестоимость;
								Стр2.ВознаграждениеИтого = Стр2.ВознаграждениеИтого + ТекВознаграждение;
								Стр2.СтавкаИтого = Стр2.СтавкаИтого + ТекСтавка;
							
							Иначе	
								Стр2.СебестоимостьИтого = Стр2.Количество * Стр2.Себестоимость;
								Стр2.ВознаграждениеИтого = Стр2.Количество * Стр2.Вознаграждение;
								Стр2.СтавкаИтого = Стр2.Количество * Стр2.Ставка;
							КонецЕсли;
							
							Стр2.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Стр2.СтавкаИтого, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Стр2.СтавкаНДС), Истина, Стр2.НДСВключенВСтоимость);
							Стр2.СуммаИтого = Стр2.СтавкаИтого + ?(Стр2.НДСВключенВСтоимость, 0, Стр2.СуммаНДС);
							
							НадоДобавитьОтдельнойСтрокой = Ложь;
							
							МассивИзмененныхДоходов.Добавить(Стр2.ГУИД);
							
							Прервать;
						//	
						//КонецЕсли;
					КонецЕсли;
				Иначе
					
					НадоДобавитьОтдельнойСтрокой = Истина;
				КонецЕсли;
				
			КонецЦикла;
			
			Если НадоДобавитьОтдельнойСтрокой Тогда
				НСтр2 = НоваяСделка.Доходы.Добавить();
				//ДИТ, Беляев СЮ, ТА48688, 28-03-2022, начало 
				НСтр2.ДатаПоявленияСтрокиЭкономики = ТекущаяДата();
				//ДИТ, Беляев СЮ, ТА48688, 28-03-2022, конец
				НСтр2.Услуга = УслугаДляПовагонки;
				НСтр2.Перевыставляемая = УслугаДляПовагонки.Перевыставляемая;
				НСтр2.Калькуляция = Стр.Калькуляция;
				НСтр2.Клиент = Стр.Клиент;
				НСтр2.Договор = Стр.Договор;
				НСтр2.ГУИД = Строка(Новый УникальныйИдентификатор);
				
				НСтрДоходыВаг2 = НоваяСделка.ДоходыВагоны.Добавить();
				НСтрДоходыВаг2.ГУИД = НСтр2.ГУИД;
				НСтрДоходыВаг2.Вагон = Стр.Вагон.Наименование;
				
				НСтр2.ТипВагонов = Стр.ТипВагонов;
				НСтр2.Груз = Стр.Груз;
				
				// в зависимости от указанного способа вычисления суммы, выбираем механизм расчета
				Если Стр.ЗаявкаПСЦ.ОплатаПользованияВагоном = Перечисления.ВариантыОплатыПользованияВагоном.Посуточно ИЛИ
					Стр.ЗаявкаПСЦ.ОплатаПользованияВагоном = Перечисления.ВариантыОплатыПользованияВагоном.ОбщаяПоКоличествуДнейИСНП Тогда
					ДельтаПосуточная = Окр((Стр.ОкончаниеПосуточногоДиапазона - Стр.НачалоПосуточногоДиапазона)/3600/24);
					
					НСтр2.Себестоимость = ?(ЗначениеЗаполнено(Стр.НормативСледованияРуб),Стр.НормативСледованияРуб,0)*ДельтаПосуточная; //?(ЗначениеЗаполнено(Стр.ДельтаОбщегоПользования),Стр.ДельтаОбщегоПользования,Стр.НормативСледованияДни);
					НСтр2.Вознаграждение = Стр.Вознаграждение;
					НСтр2.Ставка = ?(ЗначениеЗаполнено(Стр.НормативСледованияРуб),Стр.НормативСледованияРуб,0)*ДельтаПосуточная; //?(ЗначениеЗаполнено(Стр.ДельтаОбщегоПользования),Стр.ДельтаОбщегоПользования,Стр.НормативСледованияДни);
				ИначеЕсли Стр.ЗаявкаПСЦ.ОплатаПользованияВагоном = Перечисления.ВариантыОплатыПользованияВагоном.ОтдельноПогрузкаПеревозкаВыгрузка Тогда
					НСтр2.Себестоимость = Стр.СтавкаЗаРейс;
					НСтр2.Вознаграждение = Стр.Вознаграждение;
					НСтр2.Ставка = Стр.СтавкаЗаРейс;
				КонецЕсли;
				
				НСтр2.Количество = Стр.Количество;
				НСтр2.СтавкаНДС = Стр.СтавкаНДС;
				НСтр2.НДСВключенВСтоимость = Стр.СуммаВключаетНДС;
				НСтр2.ПериодВО = ГлобальныйОткрытыйПериод;
				НСтр2.Валюта = Стр.Валюта;
			
				НСтр2.СебестоимостьИтого = НСтр2.Количество * НСтр2.Себестоимость;
				НСтр2.ВознаграждениеИтого = НСтр2.Количество * НСтр2.Вознаграждение;
				НСтр2.СтавкаИтого = НСтр2.Количество * НСтр2.Ставка;
				НСтр2.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(НСтр2.СтавкаИтого, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НСтр2.СтавкаНДС), Истина, НСтр2.НДСВключенВСтоимость);
				НСтр2.СуммаИтого = НСтр2.СтавкаИтого + ?(НСтр2.НДСВключенВСтоимость, 0, НСтр2.СуммаНДС);
				
				Если Стр.ПосуточнаяОплата Тогда
					НСтр2.ДатаНачалаПериодаПовагонкиУчДок = Стр.НачалоПосуточногоДиапазона;
					НСтр2.ДатаОкончанияПериодаПовагонкиУчДок = Стр.ОкончаниеПосуточногоДиапазона;
				Иначе
					НСтр2.ДатаНачалаПериодаПовагонкиУчДок = Стр.ДатаНачалаПериодаПовагонкиУчДок;
					НСтр2.ДатаОкончанияПериодаПовагонкиУчДок = Стр.ДатаОкончанияПериодаПовагонкиУчДок;
				КонецЕсли;
				
				МассивИзмененныхДоходов.Добавить(НСтр2.ГУИД);
				
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЦикла;
	// !!!!!!!!!!!!!!!!!!!!!! проверять на группировку направления нет необходимости, т.к. если группировка по периоду = 0,
	// то вагоны выставляются каждый отдельно	
	
	РасходнаяЧастьСделки(НоваяСделка,МассивИзмененныхДоходов,УслугаСНП,МассивГУИД_СНП,ГлобальныйОткрытыйПериод);
	
	
КонецПроцедуры

Процедура ЗаполнениеСНП(ТЗ,Стр,НоваяСделка,МоментСозданияСделки,УслугаСНП,ГлобальныйОткрытыйПериод,МассивГУИД_СНП)ЭКСПОРТ
	// СНП есть всегда, кроме способа расчета ПОСУТОЧНО
	Если НЕ Стр.ЗаявкаПСЦ.ОплатаПользованияВагоном = Перечисления.ВариантыОплатыПользованияВагоном.Посуточно Тогда
		// проверка, есть ли в данной отправке СНП. Для каждого СНП ОТДЕЛЬНАЯ СТРОКА!!!
		// 1. СНП ПОГРУЗКИ
		Если Стр.ДоговорРазделятьСчетаЗаОсновнуюУслугуИСчетаЗаСНП И 
			Стр.СНППогрузки >0 И
			НЕ Стр.ЗаявкаПСЦ.ОплатаПользованияВагоном = Перечисления.ВариантыОплатыПользованияВагоном.ОбщаяПоКоличествуДнейИСНП И
			НЕ МоментСозданияСделки = 4 Тогда
			
			НСтр = НоваяСделка.Доходы.Добавить();
			//ДИТ, Беляев СЮ, ТА48688, 28-03-2022, начало 
			НСтр.ДатаПоявленияСтрокиЭкономики = ТекущаяДата();
			//ДИТ, Беляев СЮ, ТА48688, 28-03-2022, конец
			НСтр.Услуга = УслугаСНП;
			НСтр.Перевыставляемая = УслугаСНП.Перевыставляемая;
			НСтр.Калькуляция = Стр.Калькуляция;
			НСтр.Клиент = Стр.Клиент;
			НСтр.Договор = Стр.Договор;
			НСтр.ГУИД = Строка(Новый УникальныйИдентификатор);
			
			НСтрДоходыВаг = НоваяСделка.ДоходыВагоны.Добавить();
			НСтрДоходыВаг.ГУИД = НСтр.ГУИД;
			НСтрДоходыВаг.Вагон = Стр.Вагон.Наименование;
			
			НСтр.ТипВагонов = Стр.ТипВагонов;
			НСтр.Груз = Стр.Груз;
			НСтр.Комментарий = "СНП погрузки";
			// получаем целые сутки СНП
			Если НЕ СтрНайти(Строка(Стр.СНППогрузки),",") = 0 Тогда
				ДнейСНП = Цел(Стр.СНППогрузки) + 1;
			Иначе
				ДнейСНП = Стр.СНППогрузки;
			КонецЕсли;
			
			НСтр.Себестоимость = Стр.СНППогрузкиРуб*ДнейСНП;
			НСтр.Вознаграждение = 0;
			НСтр.Ставка = Стр.СНППогрузкиРуб*ДнейСНП;
			НСтр.Количество = Стр.Количество;
			НСтр.СтавкаНДС = Стр.СтавкаНДС;
			НСтр.НДСВключенВСтоимость = Стр.СуммаВключаетНДС;
			НСтр.ПериодВО = ГлобальныйОткрытыйПериод;
			НСтр.Валюта = Стр.Валюта;
			
			НСтр.СебестоимостьИтого = НСтр.Количество * НСтр.Себестоимость;
			НСтр.ВознаграждениеИтого = НСтр.Количество * НСтр.Вознаграждение;
			НСтр.СтавкаИтого = НСтр.Количество * НСтр.Ставка;
			НСтр.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(НСтр.СтавкаИтого, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НСтр.СтавкаНДС), Истина, НСтр.НДСВключенВСтоимость);
			НСтр.СуммаИтого = НСтр.СтавкаИтого + ?(НСтр.НДСВключенВСтоимость, 0, НСтр.СуммаНДС);
			
			МассивГУИД_СНП.Добавить(НСтр.ГУИД);
			
			// не добавляем этот ГУИД в массив, т.к. для строк СНП отдельная строка расходов
			//МассивИзмененныхДоходов.Добавить(НСтр.ГУИД);
		КонецЕсли;
		// 2. СНП ВЫГРУЗКИ
		Если Стр.ДоговорРазделятьСчетаЗаОсновнуюУслугуИСчетаЗаСНП И 
			Стр.СНПВыгрузки >0 И
			НЕ Стр.ЗаявкаПСЦ.ОплатаПользованияВагоном = Перечисления.ВариантыОплатыПользованияВагоном.ОбщаяПоКоличествуДнейИСНП Тогда
			
			// проверим, что по данному вагону СНП выгрузки еще не вносилось
			ПараметрыОтбора = Новый СТруктура;
			ПараметрыОтбора.Вставить("Вагон",Стр.Вагон);
			ПараметрыОтбора.Вставить("Услуга",УслугаСНП);
			ПараметрыОтбора.Вставить("Комментарий","СНП выгрузки");
			НайденныеСтроки = ТЗ.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() = 0 Тогда
			
				НСтр = НоваяСделка.Доходы.Добавить();
				//ДИТ, Беляев СЮ, ТА48688, 28-03-2022, начало 
				НСтр.ДатаПоявленияСтрокиЭкономики = ТекущаяДата();
				//ДИТ, Беляев СЮ, ТА48688, 28-03-2022, конец
				НСтр.Услуга = УслугаСНП;
				НСтр.Перевыставляемая = УслугаСНП.Перевыставляемая;
				НСтр.Калькуляция = Стр.Калькуляция;
				НСтр.Клиент = Стр.Клиент;
				НСтр.Договор = Стр.Договор;
				НСтр.ГУИД = Строка(Новый УникальныйИдентификатор);
				
				НСтрДоходыВаг = НоваяСделка.ДоходыВагоны.Добавить();
				НСтрДоходыВаг.ГУИД = НСтр.ГУИД;
				НСтрДоходыВаг.Вагон = Стр.Вагон.Наименование;
				
				НСтр.ТипВагонов = Стр.ТипВагонов;
				НСтр.Груз = Стр.Груз;
				НСтр.Комментарий = "СНП выгрузки";
				// получаем целые сутки СНП
				Если НЕ СтрНайти(Строка(Стр.СНПВыгрузки),",") = 0 Тогда
					ДнейСНП = Цел(Стр.СНПВыгрузки) + 1;
				Иначе
					ДнейСНП = Стр.СНПВыгрузки;
				КонецЕсли;
				
				НСтр.Себестоимость = Стр.СНПВыгрузкиРуб*ДнейСНП;
				НСтр.Вознаграждение = 0;
				НСтр.Ставка = Стр.СНПВыгрузкиРуб*ДнейСНП;
				НСтр.Количество = Стр.Количество;
				НСтр.СтавкаНДС = Стр.СтавкаНДС;
				НСтр.НДСВключенВСтоимость = Стр.СуммаВключаетНДС;
				НСтр.ПериодВО = ГлобальныйОткрытыйПериод;
				НСтр.Валюта = Стр.Валюта;
				
				НСтр.СебестоимостьИтого = НСтр.Количество * НСтр.Себестоимость;
				НСтр.ВознаграждениеИтого = НСтр.Количество * НСтр.Вознаграждение;
				НСтр.СтавкаИтого = НСтр.Количество * НСтр.Ставка;
				НСтр.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(НСтр.СтавкаИтого, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НСтр.СтавкаНДС), Истина, НСтр.НДСВключенВСтоимость);
				НСтр.СуммаИтого = НСтр.СтавкаИтого + ?(НСтр.НДСВключенВСтоимость, 0, НСтр.СуммаНДС);
				
				МассивГУИД_СНП.Добавить(НСтр.ГУИД);
				
			КонецЕсли;
		КонецЕсли;
		// 3. СНП ПЕРЕВОЗКИ
		Если Стр.ДоговорРазделятьСчетаЗаОсновнуюУслугуИСчетаЗаСНП И Стр.СНПСледования >0 Тогда
			// проверим, что по данному вагону СНП следования еще не вносилось
			ПараметрыОтбора = Новый СТруктура;
			ПараметрыОтбора.Вставить("Вагон",Стр.Вагон);
			ПараметрыОтбора.Вставить("Услуга",УслугаСНП);
			ПараметрыОтбора.Вставить("Комментарий","СНП следования");
			НайденныеСтроки = ТЗ.НайтиСтроки(ПараметрыОтбора);
				
			Если НайденныеСтроки.Количество() = 0 Тогда
				НСтр = НоваяСделка.Доходы.Добавить();
				//ДИТ, Беляев СЮ, ТА48688, 28-03-2022, начало 
				НСтр.ДатаПоявленияСтрокиЭкономики = ТекущаяДата();
				//ДИТ, Беляев СЮ, ТА48688, 28-03-2022, конец
				НСтр.Услуга = УслугаСНП;
				НСтр.Перевыставляемая = УслугаСНП.Перевыставляемая;
				НСтр.Калькуляция = Стр.Калькуляция;
				НСтр.Клиент = Стр.Клиент;
				НСтр.Договор = Стр.Договор;
				НСтр.ГУИД = Строка(Новый УникальныйИдентификатор);
				
				НСтрДоходыВаг = НоваяСделка.ДоходыВагоны.Добавить();
				НСтрДоходыВаг.ГУИД = НСтр.ГУИД;
				НСтрДоходыВаг.Вагон = Стр.Вагон.Наименование;
				
				НСтр.ТипВагонов = Стр.ТипВагонов;
				НСтр.Груз = Стр.Груз;
				НСтр.Комментарий = "СНП следования";
				// получаем целые сутки СНП
				Если НЕ СтрНайти(Строка(Стр.СНПСледования),",") = 0 Тогда
					ДнейСНП = Цел(Стр.СНПСледования) + 1;
				Иначе
					ДнейСНП = Стр.СНПСледования;
				КонецЕсли;
				
				НСтр.Себестоимость = Стр.СНПСледованияРуб*ДнейСНП;
				НСтр.Вознаграждение = 0;
				НСтр.Ставка = Стр.СНПСледованияРуб*ДнейСНП;
				НСтр.Количество = Стр.Количество;
				НСтр.СтавкаНДС = Стр.СтавкаНДС;
				НСтр.НДСВключенВСтоимость = Стр.СуммаВключаетНДС;
				НСтр.ПериодВО = ГлобальныйОткрытыйПериод;
				НСтр.Валюта = Стр.Валюта;
				
				НСтр.СебестоимостьИтого = НСтр.Количество * НСтр.Себестоимость;
				НСтр.ВознаграждениеИтого = НСтр.Количество * НСтр.Вознаграждение;
				НСтр.СтавкаИтого = НСтр.Количество * НСтр.Ставка;
				НСтр.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(НСтр.СтавкаИтого, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НСтр.СтавкаНДС), Истина, НСтр.НДСВключенВСтоимость);
				НСтр.СуммаИтого = НСтр.СтавкаИтого + ?(НСтр.НДСВключенВСтоимость, 0, НСтр.СуммаНДС);
				
				МассивГУИД_СНП.Добавить(НСтр.ГУИД);
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Процедура РасходнаяЧастьСделки(НоваяСделка,МассивИзмененныхДоходов,УслугаСНП,МассивГУИД_СНП,ГлобальныйОткрытыйПериод)
	
	//////////////// ЗАПРОС ДЛЯ РАСХОДОВ ////////////////
	// обновляем расходную часть только у тех доходов, которые были изменены!!!!!!!!!!!!!
	// нужно очистить таблицу расходов от старых записей (от тех, где изменены доходы).
	Для Каждого Стр Из НоваяСделка.СвязьДоходовИРасходов Цикл
		Если НЕ МассивИзмененныхДоходов.Найти(Стр.Доходы) = Неопределено Тогда
			ПараметрыОтбора = Новый Структура;
			ПараметрыОТбора.Вставить("ГУИД",Стр.Расходы);
			НайденныеРасх = НоваяСделка.Расходы.НайтиСтроки(ПараметрыОТбора);
			Для Каждого НС Из НайденныеРасх Цикл
				НоваяСделка.Расходы.Удалить(НС);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	// Строки доходов, у которых услуга - СНП полностью копируются в расходы и в запросе не участвуют
	// сначала добавляем СНП
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Услуга", УслугаСНП);
	НайденныеСтроки = НоваяСделка.Доходы.НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого Стр Из НайденныеСтроки Цикл
		
		// в расходы добавляем только новые строки доходов
		Если МассивГУИД_СНП.Найти(Стр.ГУИД) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НСтр2 = НоваяСделка.Расходы.Добавить();
		ЗаполнитьЗначенияСвойств(НСтр2,Стр);
		НСтр2.ГУИД = Строка(Новый УникальныйИдентификатор);
		НСтр2.ПериодВО = ГлобальныйОткрытыйПериод;
		НСтр2.Регламентный = Истина;
		
		НСтр5 = НоваяСделка.СвязьДоходовИРасходов.Добавить();
		НСтр5.Доходы = Стр.ГУИД;
		НСтр5.Расходы = НСтр2.ГУИД;
		
		// ищем по ГУИДу в тч ДоходыВагоны доходный вагон и создаем такой же расходный
		ПараметрыОтбора2 = Новый Структура;
		ПараметрыОтбора2.Вставить("ГУИД",Стр.ГУИД);
		НайденныеСтроки2 = НоваяСделка.ДоходыВагоны.НайтиСтроки(ПараметрыОтбора2);
		Если НайденныеСтроки2.Количество()>0 Тогда
			НСтр6 = НоваяСделка.ДоходыВагоны.Добавить();
			НСтр6.ГУИД = НСтр2.ГУИД;
			НСтр6.Вагон = НайденныеСтроки2[0].Вагон;
		КонецЕсли;
			
		МассивГУИД_СНП.Добавить(Стр.ГУИД);
		
		// по СНП тоже нужно удалить измененные строки
		НайденныеРасх = НоваяСделка.Расходы.НайтиСтроки(ПараметрыОтбора2);
		Для Каждого НС Из НайденныеРасх Цикл
			НоваяСделка.Расходы.Удалить(НС);
		КонецЦикла;
		
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВыгрТЧ.Калькуляция КАК Калькуляция,
	               |	ВыгрТЧ.Количество КАК Количество,
	               |	ВыгрТЧ.РазмерКТК КАК РазмерКТК,
	               |	ВыгрТЧ.Подсыл КАК Подсыл,
	               |	ВыгрТЧ.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	               |	ВыгрТЧ.Груз КАК Груз,
	               |	ВыгрТЧ.ГУИД КАК ГУИД
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	&ВыгрТЧ КАК ВыгрТЧ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга КАК ВыставляемаяУслуга,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга КАК Услуга,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Поставщик КАК Поставщик,
	               |	ВТ.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Договор КАК Договор,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СтавкаНДС КАК СтавкаНДС,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.НДСВключенВСтоимость КАК НДСВключенВСтоимость,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка КАК Калькуляция,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Цена20 КАК Цена20,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Цена40 КАК Цена40,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СуммаВознаграждения20 КАК СуммаВознаграждения20,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СуммаВознаграждения40 КАК СуммаВознаграждения40,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Итого20 КАК Итого20,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Итого40 КАК Итого40,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Валюта КАК Валюта,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВнутренняяСебестоимость КАК ВнутренняяСебестоимость,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.море20_Контрагент КАК море20_Контрагент,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.море20_Себестоимость КАК море20_Себестоимость,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.море40_Контрагент КАК море40_Контрагент,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.море40_Себестоимость КАК море40_Себестоимость,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ММ_ВалютаФрахтовыхСтавок КАК ММ_ВалютаФрахтовыхСтавок,
	               |	ВТ.Количество КАК Количество,
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга.Перевыставляемая КАК Перевыставляемая,
	               |	ВЫБОР
	               |		КОГДА ВТ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	               |			ТОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Цена20
	               |		ИНАЧЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Цена40
	               |	КОНЕЦ КАК Себестоимость,
	               |	ВЫБОР
	               |		КОГДА ВТ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	               |			ТОГДА КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СуммаВознаграждения20
	               |		ИНАЧЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СуммаВознаграждения40
	               |	КОНЕЦ * ВТ.Количество КАК ВознаграждениеИтого,
	               |	ВТ.Груз КАК Груз,
	               |	ВТ.Подсыл КАК Подсыл,
	               |	ВТ.ГУИД КАК ГУИДДоход,
	               |	ВТ.РазмерКТК КАК РазмерКТК
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	               |		ПО ВТ.Калькуляция = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка
	               |ГДЕ
	               |	ВТ.ГУИД В (&СписокГУИД)
	               |ИТОГИ ПО
	               |	ГУИДДоход";
	
	ВыгрТЧДоходы = НоваяСделка.Доходы.Выгрузить();
	
	Запрос.УстановитьПараметр("ВыгрТЧ", ВыгрТЧДоходы);
	//Запрос.УстановитьПараметр("СписокГУИД",МассивГУИД_СНП);
	Запрос.УстановитьПараметр("СписокГУИД",МассивИзмененныхДоходов);
	
	РЗ = Запрос.Выполнить();
	ОтветГУИДДоход = РЗ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	// потом расходы 1.3

	Пока ОтветГУИДДоход.Следующий() Цикл
		
		ВыборкаДетальныеЗаписи = ОтветГУИДДоход.Выбрать();
		
		// чтобы фрахт не добавлялся несколько раз, добавим признак, что он уже добавлен в рамках данного цикла
		ФрахтДобавлен = Ложь;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			//Если Не ВыборкаДетальныеЗаписи.Подсыл Тогда
			//	Продолжить;
			//КонецЕсли; 
			НСтр2 = НоваяСделка.Расходы.Добавить();
			ЗаполнитьЗначенияСвойств(НСтр2,ВыборкаДетальныеЗаписи);
			НСтр2.ГУИД = Строка(Новый УникальныйИдентификатор);
			НСтр2.ПериодВО = ГлобальныйОткрытыйПериод;
			НСтр2.Регламентный = Истина;
			НСТр2.НоменклатурнаяГруппа = ВыборкаДетальныеЗаписи.НоменклатурнаяГруппа;
			
			НСтр2.СебестоимостьИтого = НСтр2.Количество * НСтр2.Себестоимость;
			////НСтр2.ВознаграждениеИтого = НСтр2.Калькуляция.море20_Вознаграждение * НСтр2.Количество;
			//СтавкаИтого = НСтр2.Количество * НСтр2.Ставка;
			//НСтр2.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СтавкаИтого, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НСтр2.СтавкаНДС), Истина, НСтр2.НДСВключенВСтоимость);
			//НСтр2.СуммаИтого = СтавкаИтого + ?(НСтр2.НДСВключенВСтоимость, 0, НСтр2.СуммаНДС);
			
			
			НСтр5 = НоваяСделка.СвязьДоходовИРасходов.Добавить();
			НСтр5.Доходы = ВыборкаДетальныеЗаписи.ГУИДДоход;
			НСтр5.Расходы = НСтр2.ГУИД;
			
			// ищем по ГУИДу в тч ДоходыВагоны доходный вагон и создаем такой же расходный
			ПараметрыОтбора2 = Новый Структура;
			ПараметрыОтбора2.Вставить("ГУИД",ВыборкаДетальныеЗаписи.ГУИДДоход);
			НайденныеСтроки2 = НоваяСделка.ДоходыВагоны.НайтиСтроки(ПараметрыОтбора2);
			Если НайденныеСтроки2.Количество()>0 Тогда
				НСтр6 = НоваяСделка.ДоходыВагоны.Добавить();
				НСтр6.ГУИД = НСтр2.ГУИД;
				НСтр6.Вагон = НайденныеСтроки2[0].Вагон;
			КонецЕсли;
			
			// теперь расходы фрахт
			Если ФрахтДобавлен = Ложь И 
							((ВыборкаДетальныеЗаписи.РазмерКТК = Справочники.РазмерыКТК.К20 
											И ВыборкаДетальныеЗаписи.море20_Себестоимость > 0) 
							ИЛИ (ВыборкаДетальныеЗаписи.РазмерКТК <> Справочники.РазмерыКТК.К20 
											И ВыборкаДетальныеЗаписи.море40_Себестоимость > 0)) Тогда
				
				НСтр3 = НоваяСделка.Расходы.Добавить();
				НСтр3.Регламентный = Истина;
				НСтр3.ГУИД = Строка(Новый УникальныйИдентификатор);
				НСтр3.Поставщик = ?(ВыборкаДетальныеЗаписи.РазмерКТК = Справочники.РазмерыКТК.К20, ВыборкаДетальныеЗаписи.Калькуляция.море20_Контрагент, ВыборкаДетальныеЗаписи.Калькуляция.море40_Контрагент);
				УслугаФрахта = Константы.УслугаФрахтаДляКалькуляции.Получить();
				НСтр3.Услуга = УслугаФрахта;
				НСтр3.Перевыставляемая = НСтр3.Услуга.Перевыставляемая;
				НСтр3.Калькуляция = ВыборкаДетальныеЗаписи.Калькуляция;
				НСтр3.Себестоимость = ?(ВыборкаДетальныеЗаписи.РазмерКТК = Справочники.РазмерыКТК.К20, ВыборкаДетальныеЗаписи.Калькуляция.море20_Себестоимость, ВыборкаДетальныеЗаписи.Калькуляция.море40_Себестоимость);
				НСтр3.ВознаграждениеИтого = ВыборкаДетальныеЗаписи.Калькуляция.море20_Вознаграждение * ВыборкаДетальныеЗаписи.Количество;
				НСтр3.Количество = ВыборкаДетальныеЗаписи.Количество;
				НСтр3.Груз = ВыборкаДетальныеЗаписи.Груз;
				НСтр3.СписокКТК = ВыборкаДетальныеЗаписи.СписокКТК;
				НСтр3.ПериодВО = ГлобальныйОткрытыйПериод;
				НСтр3.Валюта = ВыборкаДетальныеЗаписи.ММ_ВалютаФрахтовыхСтавок;
				
				
				НСтр3.СебестоимостьИтого = НСтр3.Количество * НСтр3.Себестоимость;
				//НСтр3.ВознаграждениеИтого = НСтр3.Количество * НСтр3.Вознаграждение;
				//СтавкаИтого = НСтр3.Количество * НСтр3.Ставка;
				//НСтр3.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(СтавкаИтого, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НСтр3.СтавкаНДС), Истина, НСтр3.НДСВключенВСтоимость);
				//НСтр3.СуммаИтого = СтавкаИтого + ?(НСтр3.НДСВключенВСтоимость, 0, НСтр3.СуммаНДС);
				
				НСтр4 = НоваяСделка.СвязьДоходовИРасходов.Добавить();
				НСтр4.Доходы = ВыборкаДетальныеЗаписи.ГУИДДоход;
				НСтр4.Расходы = НСтр3.ГУИД;
				
				// ищем по ГУИДу в тч ДоходыВагоны доходный вагон и создаем такой же расходный
				ПараметрыОтбора2 = Новый Структура;
				ПараметрыОтбора2.Вставить("ГУИД",ВыборкаДетальныеЗаписи.ГУИДДоход);
				НайденныеСтроки2 = НоваяСделка.ДоходыВагоны.НайтиСтроки(ПараметрыОтбора2);
				Если НайденныеСтроки2.Количество()>0 Тогда
					НСтр6 = НоваяСделка.ДоходыВагоны.Добавить();
					НСтр6.ГУИД = НСтр3.ГУИД;
					НСтр6.Вагон = НайденныеСтроки2[0].Вагон;
				КонецЕсли;
				
				ФрахтДобавлен = Истина;
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Процедура ДополнитьТаблицуИнтерваламиДат(НоваяСделка,ТЗ,ИнтервалСделки,МоментСозданияСделки) ЭКСПОРТ
	
	// т.к. квант времени реализации не может быть больше сделки и реализации создаются только в рамках одной сделки,
	// то начальной датой для расчета диапазонов является ДатаНачалаПериодаПовагонки сделки.
	// в том случае, если для вагона есть выставленные документы, то НачальнаяДатаДиапазонов будет равна
	// окончанию преиода выставленного документа (его строки по вагону)
	НачальнаяДатаДиапазонов = НачалоДня(НоваяСделка.Ссылка.ДатаНачалаПериодаПовагонки);
	
	ТЗ_Копия = ТЗ.СкопироватьКолонки();
	
	Для Каждого Стр ИЗ ТЗ Цикл
		
		ВыставлениеВагоновПоПериоду = Стр.ДоговорВыставлениеВагоновПоПериоду;
		ИнтервалКомплДок = ?(ВыставлениеВагоновПоПериоду>ИнтервалСделки ИЛИ Не ЗначениеЗаполнено(ВыставлениеВагоновПоПериоду),ИнтервалСделки,ВыставлениеВагоновПоПериоду);
		// т.к. вагоны могут быть рассчитаны посуточно, то нужно разбить посуточный 
		// вагон на периоды сделки и добавить нужное количество строк
		Если Стр.ПосуточнаяОплата Тогда
			// если идет обновление таблицы из формы сделки, то проверять на выставленные дни не нужно,
			// т.к. все таблицы сделки очищаются.
			// проверяем, есть ли уже выставленные дни
			Если НЕ МоментСозданияСделки = Неопределено И ЗначениеЗаполнено(Стр.КоличествоДнейОборот) И
				Стр.КоличествоДнейОборот>0 Тогда
				// если да, то проверить, какой промежуток времени они покрывают. если есть РТУ, 
				// которые уже выставлены, то считать промежуток от них
				ВыставленоДоДаты = Стр.ДатаОтправки + Стр.КоличествоДнейОборот*3600*24;
				Если ЗначениеЗаполнено(Стр.ДатаВыставленногоРТУ) Тогда
					НачальнаяДатаДиапазонов = Стр.ДатаВыставленногоРТУ + 1;
				КонецЕсли;
			Иначе
				ВыставленоДоДаты = Стр.ДатаОтправки;
			КонецЕсли;
			// надо проверить по квантам сделки, 
			// есть ли возможность записать вагон в сделку так, чтобы ее даты начала и окончания повагонки 
			// покрывали период от ВыставленоДоДаты до ДатаОкончанияПериодаПовагонки.
			// ВагонВПути здесь всегда Ложь, т.к. реализации нужно выставлять до конца периода повагонки сделки
			СтруктураОтвета = ПолучитьДиапазоныДатПоСделкам(ВыставленоДоДаты,КонецДня(Стр.ДатаОкончанияПериодаПовагонки),ИнтервалКомплДок,НачальнаяДатаДиапазонов,Ложь);
			
			// по количеству элементов массива добавляем во временную таблицу строки для вагона
			Для Каждого Эл Из СтруктураОтвета Цикл
				НовСтр = ТЗ_Копия.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр,Стр);
				НовСтр.НачалоПосуточногоДиапазона = Эл.ДатаНач;
				НовСтр.ОкончаниеПосуточногоДиапазона = Эл.ДатаКон;
				НовСтр.Изменена = Истина;
			КонецЦикла;
				
		КонецЕсли;
			
	КонецЦикла;
	
	// вносим все данные из ТЗ_Копия в основную ТЗ, при этом первую строку таблицы нужно не добавить, а
	// изменить ею существующую
	Для Каждого Стр Из ТЗ_Копия Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Вагон",Стр.Вагон);
		ПараметрыОтбора.Вставить("ДатаОтправки",Стр.ДатаОтправки);
		ПараметрыОтбора.Вставить("Изменена",Ложь);
		НайденныеСтр = ТЗ.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтр.Количество()>0 Тогда
			НайденныеСтр[0].НачалоПосуточногоДиапазона = Стр.НачалоПосуточногоДиапазона;
			НайденныеСтр[0].ОкончаниеПосуточногоДиапазона = Стр.ОкончаниеПосуточногоДиапазона;
			НайденныеСтр[0].Изменена = Истина;
		Иначе
			НовСтр = ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр,Стр);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура РеализацииВЭкономике(НоваяСделка,ТЗ) ЭКСПОРТ
	Для каждого Стр Из ТЗ Цикл
		// интересуют уже распределенные вагоны, у которых есть реализации
		Если НЕ ЗначениеЗаполнено(Стр.РаспределенныеВагоны) Тогда
			Продолжить;
		КонецЕсли;
		
		Стр.УчДокумент = НайтиРеализацию(НоваяСделка.Ссылка, Стр.ГУИД);
		Стр.УчДокумент = НайтиОтчет(НоваяСделка.Ссылка, Стр.ГУИД);
		Если НЕ Стр.УчДокумент = Неопределено Тогда
			Стр.Выставлен = Стр.УчДокумент.Выставлен;	
			Стр.ДатаНачалаПериодаПовагонкиУчДок = Стр.УчДокумент.ДатаНачалаПериодаПовагонки;	
			Стр.ДатаОкончанияПериодаПовагонкиУчДок = Стр.УчДокумент.ДатаОкончанияПериодаПовагонки;
			Стр.НетУчДокумента = Ложь;
			// заполним направление маршрута, если у всего уч документа одинаковые станция отправления и назначения
			СтруктураОтвета = ПроверкаНаправления(Стр.УчДокумент);
			Если СтруктураОтвета.Свойство("Отправление") Тогда
				Стр.ОтправлениеУчДокумента = СтруктураОтвета.Отправление;
				Стр.НазначениеУчДокумента = СтруктураОтвета.Назначение;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ЗапросЭкономики(НоваяСделка) ЭКСПОРТ

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СделкаСвязьУчетныхЕдиниц.Груз КАК Груз,
	               |	СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция,
	               |	СделкаСвязьУчетныхЕдиниц.РазмерКТК КАК РазмерКТК,
	               |	СделкаСвязьУчетныхЕдиниц.Клиент КАК Клиент,
	               |	СделкаСвязьУчетныхЕдиниц.Договор КАК Договор,
	               |	СделкаСвязьУчетныхЕдиниц.Калькуляция.СтавкаНДС КАК КалькуляцияСтавкаНДС,
	               |	СделкаСвязьУчетныхЕдиниц.Калькуляция.СуммаВключаетНДС КАК КалькуляцияСуммаВключаетНДС,
	               |	СделкаСвязьУчетныхЕдиниц.Калькуляция.Валюта КАК КалькуляцияВалюта,
	               |	СделкаСвязьУчетныхЕдиниц.Заявка.ПСЦ КАК ЗаявкаПСЦ,
	               |	СделкаСвязьУчетныхЕдиниц.Договор.ВыставлениеВагоновПоОдному КАК ДоговорВыставлениеВагоновПоОдному,
	               |	СделкаСвязьУчетныхЕдиниц.Договор.ГруппировкаПоНаправлениям КАК ДоговорГруппировкаПоНаправлениям,
	               |	СделкаСвязьУчетныхЕдиниц.Договор.РазделятьСчетаЗаОсновнуюУслугуИСчетаЗаСНП КАК ДоговорРазделятьСчетаЗаОсновнуюУслугуИСчетаЗаСНП,
	               |	СделкаСвязьУчетныхЕдиниц.Вагон КАК Вагон,
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Сделка,
	               |	СделкаСвязьУчетныхЕдиниц.Договор.ВыставлениеВагоновПоПериоду КАК ДоговорВыставлениеВагоновПоПериоду,
	               |	СделкаСвязьУчетныхЕдиниц.ДатаНачалаПериодаПовагонки КАК ДатаНачалаПериодаПовагонки,
	               |	СделкаСвязьУчетныхЕдиниц.ДатаОкончанияПериодаПовагонки КАК ДатаОкончанияПериодаПовагонки,
	               |	СделкаСвязьУчетныхЕдиниц.ДатаОтправки КАК ДатаОтправки,
	               // |	СУММА(ВыставлениеПосуточнойАрендыОбороты.КоличествоДнейОборот) КАК КоличествоДнейОборот,    
				   //ДИТ Беляев СЮ, Ticket#0248292, 03-11-2021 ++ (Убираем использование регистра <ВыставлениеПосуточнойАренды>
				   |	СУММА(0) КАК КоличествоДнейОборот,     
				   //ДИТ Беляев СЮ, Ticket#0248292, 03-11-2021 --
	               |	ПовагонныеОтправки.СтанцияОтправления КАК СтанцияОтправления,
	               |	ПовагонныеОтправки.СтанцияНазначения КАК СтанцияНазначения,
	               |	ВЫБОР
	               |		КОГДА ПовагонныеОтправки.Заявка = ЗНАЧЕНИЕ(Документ.Заявка.пустаяссылка)
	               |			ТОГДА ПовагонныеОтправки.ДатаПрибытияНаСтанцию
	               |		КОГДА ПовагонныеОтправки.ДатаПрибытияНаСтанцию = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА ПовагонныеОтправки.Заявка.Дата
	               |		КОГДА НЕ ПовагонныеОтправки.Заявка = ЗНАЧЕНИЕ(Документ.Заявка.пустаяссылка)
	               |				И НЕ ПовагонныеОтправки.ДатаПрибытияНаСтанцию = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ПовагонныеОтправки.ДатаПрибытияНаСтанцию > ПовагонныеОтправки.Заявка.Дата
	               |						ТОГДА ПовагонныеОтправки.ДатаПрибытияНаСтанцию
	               |					ИНАЧЕ ПовагонныеОтправки.Заявка.Дата
	               |				КОНЕЦ
	               |	КОНЕЦ КАК ДатаПрибытияДляСНП,
	               |	ВЫБОР
	               |		КОГДА НЕ ПовагонныеОтправки.ДатаОтправленияСоСтанцииНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |				И НЕ ПовагонныеОтправки.ДатаПрибытияНаСтанциюНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА РАЗНОСТЬДАТ(ПовагонныеОтправки.ДатаПрибытияНаСтанциюНазначения, ПовагонныеОтправки.ДатаОтправленияСоСтанцииНазначения, ДЕНЬ)
	               |		КОГДА НЕ ПовагонныеОтправки.ПереводВНРП = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |				И НЕ ПовагонныеОтправки.ДатаПрибытияНаСтанциюНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА РАЗНОСТЬДАТ(ПовагонныеОтправки.ДатаПрибытияНаСтанциюНазначения, ПовагонныеОтправки.ПереводВНРП, ДЕНЬ)
	               |		КОГДА НЕ ПовагонныеОтправки.ДатаОкончанияПользования = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |				И НЕ ПовагонныеОтправки.ДатаПрибытияНаСтанциюНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА РАЗНОСТЬДАТ(ПовагонныеОтправки.ДатаПрибытияНаСтанциюНазначения, ПовагонныеОтправки.ДатаОкончанияПользования, ДЕНЬ)
	               |	КОНЕЦ КАК ДельтаВыгрузки,
	               |	РАЗНОСТЬДАТ(ПовагонныеОтправки.ДатаПередачиВПользование, ПовагонныеОтправки.ДатаОкончанияПользования, ДЕНЬ) КАК ДельтаОбщегоПользования,
	               |	ПСЦКалькуляцииПовагонки.НормативСледованияДни КАК НормативСледованияДни,
	               |	ПСЦКалькуляцииПовагонки.НормативСледованияРуб КАК НормативСледованияРуб,
	               |	ПСЦКалькуляцииПовагонки.СНППогрузкиДни КАК СНППогрузкиДни,
	               |	ПСЦКалькуляцииПовагонки.СНППогрузкиРуб КАК СНППогрузкиРуб,
	               |	ПСЦКалькуляцииПовагонки.СНПВыгрузкиДни КАК СНПВыгрузкиДни,
	               |	ПСЦКалькуляцииПовагонки.СНПВыгрузкиРуб КАК СНПВыгрузкиРуб,
	               |	ПСЦКалькуляцииПовагонки.СНПСледованияРуб КАК СНПСледованияРуб,
	               |	ПСЦКалькуляцииПовагонки.СтавкаЗаРейс КАК СтавкаЗаРейс,
	               |	ПСЦКалькуляцииПовагонки.Вознаграждение КАК Вознаграждение,
	               |	ПовагонныеОтправки.НДС КАК НДС
	               |ПОМЕСТИТЬ СвязьУчЕд
	               |ИЗ
	               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц     
				   //ДИТ Беляев СЮ, Ticket#0248292, 03-11-2021 ++ (Убираем использование регистра <ВыставлениеПосуточнойАренды>
				   //|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыставлениеПосуточнойАренды.Обороты(, , Регистратор, ) КАК ВыставлениеПосуточнойАрендыОбороты
				   //|		ПО СделкаСвязьУчетныхЕдиниц.Вагон = ВыставлениеПосуточнойАрендыОбороты.НомерВагона
				   //|			И СделкаСвязьУчетныхЕдиниц.ДатаОтправки = ВыставлениеПосуточнойАрендыОбороты.Период
				   //|			И (ВыставлениеПосуточнойАрендыОбороты.Регистратор ССЫЛКА Документ.Сделка)  
				   //ДИТ Беляев СЮ, Ticket#0248292, 03-11-2021 --
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПовагонныеОтправки КАК ПовагонныеОтправки
	               |		ПО СделкаСвязьУчетныхЕдиниц.Вагон = ПовагонныеОтправки.Вагон
	               |			И СделкаСвязьУчетныхЕдиниц.ДатаОтправки = ПовагонныеОтправки.ДатаОтправления
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПСЦ.КалькуляцииПовагонки КАК ПСЦКалькуляцииПовагонки
	               |		ПО СделкаСвязьУчетныхЕдиниц.Заявка.ПСЦ = ПСЦКалькуляцииПовагонки.Ссылка
	               |			И СделкаСвязьУчетныхЕдиниц.Калькуляция = ПСЦКалькуляцииПовагонки.Калькуляция
	               |ГДЕ
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
	               |	И НЕ СделкаСвязьУчетныхЕдиниц.НеАктивна
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СделкаСвязьУчетныхЕдиниц.ДатаОкончанияПериодаПовагонки,
	               |	СделкаСвязьУчетныхЕдиниц.ДатаОтправки,
	               |	СделкаСвязьУчетныхЕдиниц.Заявка.ПСЦ,
	               |	СделкаСвязьУчетныхЕдиниц.Клиент,
	               |	СделкаСвязьУчетныхЕдиниц.РазмерКТК,
	               |	СделкаСвязьУчетныхЕдиниц.ДатаНачалаПериодаПовагонки,
	               |	СделкаСвязьУчетныхЕдиниц.Груз,
	               |	СделкаСвязьУчетныхЕдиниц.Договор,
	               |	СделкаСвязьУчетныхЕдиниц.Вагон,
	               |	СделкаСвязьУчетныхЕдиниц.Калькуляция,
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка,
	               |	СделкаСвязьУчетныхЕдиниц.Калькуляция.СтавкаНДС,
	               |	СделкаСвязьУчетныхЕдиниц.Калькуляция.СуммаВключаетНДС,
	               |	СделкаСвязьУчетныхЕдиниц.Калькуляция.Валюта,
	               |	СделкаСвязьУчетныхЕдиниц.Договор.ВыставлениеВагоновПоОдному,
	               |	СделкаСвязьУчетныхЕдиниц.Договор.ГруппировкаПоНаправлениям,
	               |	СделкаСвязьУчетныхЕдиниц.Договор.РазделятьСчетаЗаОсновнуюУслугуИСчетаЗаСНП,
	               |	СделкаСвязьУчетныхЕдиниц.Договор.ВыставлениеВагоновПоПериоду,
	               |	ПовагонныеОтправки.СтанцияОтправления,
	               |	ПовагонныеОтправки.СтанцияНазначения,
	               |	ПСЦКалькуляцииПовагонки.НормативСледованияДни,
	               |	ПСЦКалькуляцииПовагонки.НормативСледованияРуб,
	               |	ПСЦКалькуляцииПовагонки.СНППогрузкиДни,
	               |	ПСЦКалькуляцииПовагонки.СНППогрузкиРуб,
	               |	ПСЦКалькуляцииПовагонки.СНПВыгрузкиДни,
	               |	ПСЦКалькуляцииПовагонки.СНПВыгрузкиРуб,
	               |	ПСЦКалькуляцииПовагонки.СНПСледованияРуб,
	               |	ПСЦКалькуляцииПовагонки.СтавкаЗаРейс,
	               |	ПСЦКалькуляцииПовагонки.Вознаграждение,
	               |	ВЫБОР
	               |		КОГДА ПовагонныеОтправки.Заявка = ЗНАЧЕНИЕ(Документ.Заявка.пустаяссылка)
	               |			ТОГДА ПовагонныеОтправки.ДатаПрибытияНаСтанцию
	               |		КОГДА ПовагонныеОтправки.ДатаПрибытияНаСтанцию = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА ПовагонныеОтправки.Заявка.Дата
	               |		КОГДА НЕ ПовагонныеОтправки.Заявка = ЗНАЧЕНИЕ(Документ.Заявка.пустаяссылка)
	               |				И НЕ ПовагонныеОтправки.ДатаПрибытияНаСтанцию = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ПовагонныеОтправки.ДатаПрибытияНаСтанцию > ПовагонныеОтправки.Заявка.Дата
	               |						ТОГДА ПовагонныеОтправки.ДатаПрибытияНаСтанцию
	               |					ИНАЧЕ ПовагонныеОтправки.Заявка.Дата
	               |				КОНЕЦ
	               |	КОНЕЦ,
	               |	РАЗНОСТЬДАТ(ПовагонныеОтправки.ДатаПередачиВПользование, ПовагонныеОтправки.ДатаОкончанияПользования, ДЕНЬ),
	               |	ПовагонныеОтправки.НДС,
	               |	ВЫБОР
	               |		КОГДА НЕ ПовагонныеОтправки.ДатаОтправленияСоСтанцииНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |				И НЕ ПовагонныеОтправки.ДатаПрибытияНаСтанциюНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА РАЗНОСТЬДАТ(ПовагонныеОтправки.ДатаПрибытияНаСтанциюНазначения, ПовагонныеОтправки.ДатаОтправленияСоСтанцииНазначения, ДЕНЬ)
	               |		КОГДА НЕ ПовагонныеОтправки.ПереводВНРП = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |				И НЕ ПовагонныеОтправки.ДатаПрибытияНаСтанциюНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА РАЗНОСТЬДАТ(ПовагонныеОтправки.ДатаПрибытияНаСтанциюНазначения, ПовагонныеОтправки.ПереводВНРП, ДЕНЬ)
	               |		КОГДА НЕ ПовагонныеОтправки.ДатаОкончанияПользования = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |				И НЕ ПовагонныеОтправки.ДатаПрибытияНаСтанциюНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА РАЗНОСТЬДАТ(ПовагонныеОтправки.ДатаПрибытияНаСтанциюНазначения, ПовагонныеОтправки.ДатаОкончанияПользования, ДЕНЬ)
	               |	КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СвязьУчЕд.Вагон КАК Вагон,
	               |	СделкаДоходыВагоны.Вагон КАК РаспределенныеВагоны,
	               |	СделкаДоходыВагоны.ГУИД КАК ГУИД,
	               |	СвязьУчЕд.Сделка КАК Сделка
	               |ПОМЕСТИТЬ РаспределенныеВаг
	               |ИЗ
	               |	СвязьУчЕд КАК СвязьУчЕд
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ДоходыВагоны КАК СделкаДоходыВагоны
	               |		ПО (СделкаДоходыВагоны.Вагон ПОДОБНО ""%"" + СвязьУчЕд.Вагон.Наименование + ""%"")
	               |			И СвязьУчЕд.Сделка = СделкаДоходыВагоны.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РаспределенныеВаг.Вагон КАК Вагон,
	               |	РаспределенныеВаг.РаспределенныеВагоны КАК РаспределенныеВагоны,
	               |	РаспределенныеВаг.ГУИД КАК ГУИД,
	               |	РаспределенныеВаг.Сделка КАК Сделка,
	               |	СделкаДоходы.Услуга КАК Услуга,
	               |	СделкаДоходы.Комментарий КАК Комментарий,
				   //|	ВЫБОР
				   //|		КОГДА НЕ ЕСТЬNULL(ВыставлениеПосуточнойАренды.КоличествоДней, 0) = 0
				   //|			ТОГДА СделкаДоходы.ДатаОкончанияПериодаПовагонкиУчДок
				   //|	КОНЕЦ КАК ДатаВыставленногоРТУ      
				   //ДИТ Беляев СЮ, Ticket#0248292, 03-11-2021 ++ (Убираем использование регистра <ВыставлениеПосуточнойАренды>
				   |	СделкаДоходы.ДатаОкончанияПериодаПовагонкиУчДок КАК ДатаВыставленногоРТУ 
				   //ДИТ Беляев СЮ, Ticket#0248292, 03-11-2021 --
	               |ПОМЕСТИТЬ ВнесенныеВагоныУслуги
	               |ИЗ
	               |	РаспределенныеВаг КАК РаспределенныеВаг
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
	               |		ПО РаспределенныеВаг.ГУИД = СделкаДоходы.ГУИД
	               |			И РаспределенныеВаг.Сделка = СделкаДоходы.Ссылка  
				   //ДИТ Беляев СЮ, Ticket#0248292, 03-11-2021 ++ (Убираем использование регистра <ВыставлениеПосуточнойАренды>
				   //|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВыставлениеПосуточнойАренды КАК ВыставлениеПосуточнойАренды
				   //|		ПО РаспределенныеВаг.ГУИД = ВыставлениеПосуточнойАренды.ГУИД
				   //|			И (ВыставлениеПосуточнойАренды.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг)
				   //|			И (ВыставлениеПосуточнойАренды.Регистратор.Выставлен)   
				   //ДИТ Беляев СЮ, Ticket#0248292, 03-11-2021 --
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СвязьУчЕд.Вагон КАК Вагон,
	               |	ВЫБОР
	               |		КОГДА НЕ ЕСТЬNULL(СделкаДоходы.ДатаНачалаПериодаПовагонкиУчДок, 0) = 0
	               |			ТОГДА СделкаДоходы.ДатаНачалаПериодаПовагонкиУчДок
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |	КОНЕЦ КАК ДатаНачалаПериодаПовагонкиУчДок,
	               |	ВЫБОР
	               |		КОГДА НЕ ЕСТЬNULL(СделкаДоходы.ДатаОкончанияПериодаПовагонкиУчДок, 0) = 0
	               |			ТОГДА СделкаДоходы.ДатаОкончанияПериодаПовагонкиУчДок
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |	КОНЕЦ КАК ДатаОкончанияПериодаПовагонкиУчДок,
	               |	СвязьУчЕд.Груз КАК Груз,
	               |	СвязьУчЕд.Калькуляция КАК Калькуляция,
	               |	СвязьУчЕд.РазмерКТК КАК РазмерКТК,
	               |	СвязьУчЕд.Клиент КАК Клиент,
	               |	СвязьУчЕд.Договор КАК Договор,
	               |	СвязьУчЕд.КалькуляцияСуммаВключаетНДС КАК СуммаВключаетНДС,
	               |	СвязьУчЕд.КалькуляцияВалюта КАК Валюта,
	               |	СвязьУчЕд.ЗаявкаПСЦ КАК ЗаявкаПСЦ,
	               |	1 КАК Количество,
	               |	СвязьУчЕд.ДоговорВыставлениеВагоновПоОдному КАК ДоговорВыставлениеВагоновПоОдному,
	               |	СвязьУчЕд.ДоговорГруппировкаПоНаправлениям КАК ДоговорГруппировкаПоНаправлениям,
	               |	СвязьУчЕд.ДоговорРазделятьСчетаЗаОсновнуюУслугуИСчетаЗаСНП КАК ДоговорРазделятьСчетаЗаОсновнуюУслугуИСчетаЗаСНП,
	               |	СвязьУчЕд.Сделка КАК Сделка,
	               |	ВнесенныеВагоныУслуги.РаспределенныеВагоны КАК РаспределенныеВагоны,
	               |	ВнесенныеВагоныУслуги.ГУИД КАК ГУИД,
	               |	ВнесенныеВагоныУслуги.Услуга КАК Услуга,
	               |	ВнесенныеВагоныУслуги.Комментарий КАК Комментарий,
	               |	СвязьУчЕд.ДоговорВыставлениеВагоновПоПериоду КАК ДоговорВыставлениеВагоновПоПериоду,
	               |	СвязьУчЕд.ДатаНачалаПериодаПовагонки КАК ДатаНачалаПериодаПовагонки,
	               |	СвязьУчЕд.ДатаОкончанияПериодаПовагонки КАК ДатаОкончанияПериодаПовагонки,
	               |	СвязьУчЕд.ДатаОтправки КАК ДатаОтправки,
	               |	СвязьУчЕд.КоличествоДнейОборот КАК КоличествоДнейОборот,
	               |	СвязьУчЕд.СтанцияОтправления КАК СтанцияОтправления,
	               |	СвязьУчЕд.СтанцияНазначения КАК СтанцияНазначения,
	               |	СвязьУчЕд.ДатаПрибытияДляСНП КАК ДатаПрибытияДляСНП,
	               |	СвязьУчЕд.ДельтаВыгрузки КАК ДельтаВыгрузки,
	               |	СвязьУчЕд.ДельтаОбщегоПользования КАК ДельтаОбщегоПользования,
	               |	СвязьУчЕд.НормативСледованияДни КАК НормативСледованияДни,
	               |	СвязьУчЕд.НормативСледованияРуб КАК НормативСледованияРуб,
	               |	СвязьУчЕд.СНППогрузкиДни КАК СНППогрузкиДни,
	               |	СвязьУчЕд.СНППогрузкиРуб КАК СНППогрузкиРуб,
	               |	СвязьУчЕд.СНПВыгрузкиДни КАК СНПВыгрузкиДни,
	               |	СвязьУчЕд.СНПВыгрузкиРуб КАК СНПВыгрузкиРуб,
	               |	СвязьУчЕд.СНПСледованияРуб КАК СНПСледованияРуб,
	               |	СвязьУчЕд.СтавкаЗаРейс КАК СтавкаЗаРейс,
	               |	СвязьУчЕд.Вознаграждение КАК Вознаграждение,
	               |	ВЫБОР
	               |		КОГДА РАЗНОСТЬДАТ(СвязьУчЕд.ДатаПрибытияДляСНП, СвязьУчЕд.ДатаОтправки, ДЕНЬ) - СвязьУчЕд.СНППогрузкиДни > 0
	               |			ТОГДА РАЗНОСТЬДАТ(СвязьУчЕд.ДатаПрибытияДляСНП, СвязьУчЕд.ДатаОтправки, ДЕНЬ) - СвязьУчЕд.СНППогрузкиДни
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СНППогрузки,
	               |	ВЫБОР
	               |		КОГДА СвязьУчЕд.ДельтаВыгрузки - СвязьУчЕд.СНПВыгрузкиДни > 0
	               |			ТОГДА СвязьУчЕд.ДельтаВыгрузки - СвязьУчЕд.СНПВыгрузкиДни
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СНПВыгрузки,
	               |	ЛОЖЬ КАК Выставлен,
	               |	ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка) КАК ОтправлениеУчДокумента,
	               |	ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка) КАК НазначениеУчДокумента,
	               |	ВЫБОР
	               |		КОГДА СвязьУчЕд.НормативСледованияДни < СвязьУчЕд.ДельтаОбщегоПользования
	               |			ТОГДА СвязьУчЕд.ДельтаОбщегоПользования - СвязьУчЕд.НормативСледованияДни
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СНПСледования,
	               |	ЛОЖЬ КАК ВагонПроверен,
	               |	ВЫБОР
	               |		КОГДА СвязьУчЕд.ЗаявкаПСЦ.ОплатаПользованияВагоном = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПользованияВагоном.Посуточно)
	               |				ИЛИ СвязьУчЕд.ЗаявкаПСЦ.ОплатаПользованияВагоном = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыПользованияВагоном.ОбщаяПоКоличествуДнейИСНП)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ПосуточнаяОплата,
	               |	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК НачалоПосуточногоДиапазона,
	               |	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ОкончаниеПосуточногоДиапазона,
	               |	ЛОЖЬ КАК Изменена,
	               |	СвязьУчЕд.Вагон.ТипТС КАК ТипВагонов,
	               |	СвязьУчЕд.НДС КАК СтавкаНДС,
	               |	ВнесенныеВагоныУслуги.ДатаВыставленногоРТУ КАК ДатаВыставленногоРТУ
	               |ИЗ
	               |	СвязьУчЕд КАК СвязьУчЕд
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВнесенныеВагоныУслуги КАК ВнесенныеВагоныУслуги
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
	               |			ПО ВнесенныеВагоныУслуги.Сделка = СделкаДоходы.Ссылка
	               |				И ВнесенныеВагоныУслуги.ГУИД = СделкаДоходы.ГУИД
	               |		ПО СвязьУчЕд.Вагон = ВнесенныеВагоныУслуги.Вагон
	               |			И СвязьУчЕд.Сделка = ВнесенныеВагоныУслуги.Сделка";
	Запрос.УстановитьПараметр("Ссылка",НоваяСделка.Ссылка);
	Запрос.УстановитьПараметр("ДатаНачалаПовагонки",НоваяСделка.Ссылка.ДатаНачалаПериодаПовагонки);
	Запрос.УстановитьПараметр("ДатаОкончанияПовагонки",НоваяСделка.Ссылка.ДатаОкончанияПериодаПовагонки);
	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса;
	
КонецФункции

Функция ПолучитьДиапазоныДатПоСделкам(ВыставленоДоДаты,ДатаОкончанияДвижения,КвантВремени,НачальнаяДатаДиапазонов,ВагонВПути)
	
	МассивСтруктур = Новый Массив;
	ПоследняяДата = Неопределено;
	
	// если начальная дата диапазонов больше даты, до коорой выставлены текущие вагоны, то нужно отсчитать диапазоны ранее
	Если НачальнаяДатаДиапазонов>ВыставленоДоДаты Тогда
		КолвоДнейДельта = НачалоДня(НачальнаяДатаДиапазонов) - НачалоДня(ВыставленоДоДаты);
		Интервалы = КолвоДнейДельта/КвантВремени;
		Если НЕ СтрНайти(Интервалы,",") = 0 Тогда
			Интервалы = Цел(Интервалы) + 1;
		Иначе
			Интервалы = Цел(Интервалы);
		КонецЕсли;
		НачальнаяДатаДиапазонов = НачальнаяДатаДиапазонов - Интервалы*КвантВремени;
	КонецЕсли;
		
	
	// нас интересует окончание расчета - ДатаОкончанияДвижения. кол-во сделок надо посчитать до этой даты
	КолвоДнейДляРасчета = Окр((ДатаОкончанияДвижения - НачальнаяДатаДиапазонов)/3600/24);
	
	// если вагон в пути, то нам нужны только целые диапазоны
	//Если ВагонВПути Тогда
	//	КолвоИнтервалов = Цел(КолвоДнейДляРасчета/КвантВремени);
	//Иначе
		// если вагон уже приехал, то нужно взять "хвост" диапазона и найти для него сделку
		КолвоИнтервалов = КолвоДнейДляРасчета/КвантВремени;
		Если НЕ СтрНайти(Строка(КолвоИнтервалов),",") = 0 Тогда
			КолвоИнтервалов = Цел(КолвоДнейДляРасчета/КвантВремени) + 1;
		КонецЕсли;
		ПоследняяДата = ДатаОкончанияДвижения;
	//КонецЕсли;
	
	НачалоЗаписи = Ложь;
	ДатаКон = Неопределено;
	
	Если КолвоИнтервалов = 0 Тогда
		КолвоИнтервалов = 1;
	КонецЕсли;
	
	Для ШагЦикла = 0 По КолвоИнтервалов-1 Цикл
		// чтобы не было пересечений диапазонов, надо прибавлять 1 секунду к каждой дате начала начиная со второго цикла
		Если ДатаКон = Неопределено Тогда
			ДатаНач = НачальнаяДатаДиапазонов;
		Иначе
			ДатаНач = ДатаКон + 1;
		КонецЕсли;
		Если ШагЦикла = КолвоИнтервалов-1 Тогда
			ДатаКон = ?(ПоследняяДата = Неопределено,КонецДня(ДатаНач + (КвантВремени-1)*3600*24),КонецДня(ПоследняяДата));
		Иначе
			ДатаКон = КонецДня(ДатаНач + (КвантВремени-1)*3600*24);
		КонецЕсли;
		
		// как только дошли до интервала, в котором находятся наши даты - начинаем записывать их в массив.
		// пишем до конца цикла, т.к. он считается до ДатаОкончанияДвижения
		Если ВыставленоДоДаты >= ДатаНач И ВыставленоДоДаты <= ДатаКон Тогда
			НачалоЗаписи = Истина;
		КонецЕсли;
		
		Если НачалоЗаписи Тогда
			СтруктураРезультата = Новый СТруктура;
			СтруктураРезультата.Вставить("ДатаНач",ДатаНач);
			СтруктураРезультата.Вставить("ДатаКон",ДатаКон);
			
			МассивСтруктур.Добавить(СтруктураРезультата);
			
		КонецЕсли;
	КонецЦикла;
		
	Возврат МассивСтруктур;

КонецФункции

Функция ПроверкаНаправления(УчДокумент)
	
	СтруктураОтвета = Новый Структура;
	Для Каждого СТр Из УчДокумент.РасшифровкаУслугПоТС Цикл
		// если в структуре уже есть какие-то записи, то проверить их совпадение. 
		// если не совпало, прекращаем цикл - в реализации разные направления
		Если СтруктураОтвета.Свойство("Отправление") Тогда
			Если НЕ СтруктураОтвета.Отправление = Стр.ПунктОтправления ИЛИ
				НЕ СтруктураОтвета.Назначение = Стр.ПунктНазначения Тогда
				// очищаем все из структуры
				СтруктураОтвета = Новый Структура;
				Прервать;
			КонецЕсли;
		Иначе
			СтруктураОтвета.Вставить("Отправление",Стр.ПунктОтправления);
			СтруктураОтвета.Вставить("Назначение",Стр.ПунктНазначения);
		КонецЕсли;
	КонецЦикла;

	Возврат СтруктураОтвета;
	
КонецФункции

Функция НайтиРеализацию(ОбъектСсылка, СтрГУИД) Экспорт   //Евросиб СубботинВ #84453 02.07.2024 Начало сделал экспортной
	
	Результат = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ОбъектСсылка);
	Запрос.УстановитьПараметр("СтрокаДоходовСделки", СтрГУИД);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |ГДЕ
				   //Евросиб СубботинВ #84453 02.07.2024 Начало //
	             //|	РеализацияТоваровУслугУслуги.Ссылка.Сделка = &Ссылка 
				   |	РеализацияТоваровУслугУслуги.Сделка = &Ссылка 
				   //Евросиб СубботинВ #84453 02.07.2024 Начало //
	               |	И РеализацияТоваровУслугУслуги.СтрокаДоходовСделки = &СтрокаДоходовСделки
	               |	И НЕ РеализацияТоваровУслугУслуги.Ссылка.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РеализацияТоваровУслугУслуги.Ссылка.Дата УБЫВ";
	Ответ = запрос.Выполнить().Выбрать();
	Если ответ.Следующий() Тогда
		Результат = ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НайтиОтчет(ОбъектСсылка, СтрГУИД)
	
	Результат = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ОбъектСсылка);
	Запрос.УстановитьПараметр("СтрокаДоходовСделки", СтрГУИД);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ОтчетКомитентуОПродажахТовары.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	               |ГДЕ
	               |	ОтчетКомитентуОПродажахТовары.Ссылка.Сделка = &Ссылка
	               |	И ОтчетКомитентуОПродажахТовары.СтрокаДоходовСделки = &СтрокаДоходовСделки
	               |	И ОтчетКомитентуОПродажахТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОтчетКомитентуОПродажахТовары.Ссылка.Дата УБЫВ";
	Ответ = запрос.Выполнить().Выбрать();
	Если ответ.Следующий() Тогда
		Результат = ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ОбновлениеДанныхРегистраПовагонки() Экспорт
	
	// необходимо обновлять данные по регистру ПовагонныеОтправки для получения СНП по станциям отправления и назначения.
	// обновляем информацию только для тех вагонов, у который нет даты вывода из повагонки.
	ОбновлениеДатыОтправления();
	
	ОбновлениеДатыПрибытияНаСтанциюНазначения();
	
	ОбновлениеДатыОтправленияСоСтанцииНазначения();
	
	// еще раз, чтобы обновить новые строки, которые могли появиться в результате обновления даты прибытия на станцию назначения
	ОбновлениеДатыОтправления();
	
КонецПроцедуры

Процедура ОбновлениеДатыОтправления()
	
	// 1. СНП отправления. обновляем только те вагоны, у которых нет даты отправления со станции отправления.
	// для данного вагона в РС Дислокация вагонов взять последнюю запись. если станция отправления по повагонке НЕ
	// совпадает со станцией операции в дислокации, то значит вагон ушел со станции отправления и надо записать дату.
	// дату отправления берем как последнюю дату операции по данной станции в регистре дислокации
	// установив верхнюю границу периода - текущий период станции дислокации и нижнюю - дату прибытия на станцию.
	// запишем станцию назначения
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПовагонныеОтправкиСрезПоследних.Период КАК ДатаПомещенияВРежимПовагонки,
	               |	ПовагонныеОтправкиСрезПоследних.Вагон КАК НомерВагона,
	               |	ПовагонныеОтправкиСрезПоследних.СтанцияОтправления КАК СтанцияОтправления,
	               |	ПовагонныеОтправкиСрезПоследних.ДатаПрибытияНаСтанцию КАК ДатаПрибытияНаСтанцию
	               |ПОМЕСТИТЬ Повагонка
	               |ИЗ
	               |	РегистрСведений.ПовагонныеОтправки.СрезПоследних(, ) КАК ПовагонныеОтправкиСрезПоследних
	               |ГДЕ
	               |	ПовагонныеОтправкиСрезПоследних.ВыводИзПовагонки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |	И ПовагонныеОтправкиСрезПоследних.ДатаОтправления = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |	И НЕ ПовагонныеОтправкиСрезПоследних.ДатаПрибытияНаСтанцию = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ДислокацияВагонов.Период) КАК Период,
	               |	ДислокацияВагонов.Вагон КАК Вагон
	               |ПОМЕСТИТЬ ПериодДислокации
	               |ИЗ
	               |	Повагонка КАК Повагонка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДислокацияВагонов КАК ДислокацияВагонов
	               |		ПО Повагонка.НомерВагона = ДислокацияВагонов.Вагон
	               |			И Повагонка.СтанцияОтправления = ДислокацияВагонов.СтанцияОтправления
	               |			И Повагонка.СтанцияОтправления = ДислокацияВагонов.СтанцияОперации
	               |			И (ДислокацияВагонов.Период > Повагонка.ДатаПрибытияНаСтанцию)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДислокацияВагонов.Вагон
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ДислокацияВагонов.Период) КАК Период,
	               |	ДислокацияВагонов.Вагон КАК Вагон,
	               |	МАКСИМУМ(ДислокацияВагонов.ОперацияСВагоном) КАК ОперацияСВагоном
	               |ПОМЕСТИТЬ ВагоныОперации
	               |ИЗ
	               |	РегистрСведений.ДислокацияВагонов КАК ДислокацияВагонов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПериодДислокации КАК ПериодДислокации
	               |		ПО ДислокацияВагонов.Период = ПериодДислокации.Период
	               |			И ДислокацияВагонов.Вагон = ПериодДислокации.Вагон
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДислокацияВагонов.Вагон
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДислокацияВагонов.Период КАК Период,
	               |	ДислокацияВагонов.Вагон КАК Вагон,
	               |	ДислокацияВагонов.ОперацияСВагоном КАК ОперацияСВагоном,
	               |	ДислокацияВагонов.СтанцияОперации КАК СтанцияОперации
	               |ПОМЕСТИТЬ ДислокацияЪ
	               |ИЗ
	               |	РегистрСведений.ДислокацияВагонов КАК ДислокацияВагонов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВагоныОперации КАК ВагоныОперации
	               |		ПО ДислокацияВагонов.Период = ВагоныОперации.Период
	               |			И ДислокацияВагонов.Вагон = ВагоныОперации.Вагон
	               |			И ДислокацияВагонов.ОперацияСВагоном = ВагоныОперации.ОперацияСВагоном
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДислокацияЪ.Период КАК Период,
	               |	ДислокацияЪ.Вагон КАК Вагон,
	               |	Повагонка.СтанцияОтправления КАК СтанцияОтправления,
	               |	Повагонка.ДатаПрибытияНаСтанцию КАК ДатаПрибытияНаСтанцию
	               |ПОМЕСТИТЬ НесовпадениеСтанций
	               |ИЗ
	               |	Повагонка КАК Повагонка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДислокацияЪ КАК ДислокацияЪ
	               |		ПО Повагонка.НомерВагона = ДислокацияЪ.Вагон
	               |			И Повагонка.СтанцияОтправления = ДислокацияЪ.СтанцияОперации
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НесовпадениеСтанций.Вагон КАК Вагон,
	               |	НесовпадениеСтанций.СтанцияОтправления КАК СтанцияОтправления,
	               |	НесовпадениеСтанций.ДатаПрибытияНаСтанцию КАК ДатаПрибытияНаСтанцию,
	               |	МАКСИМУМ(ДислокацияВагонов.Период) КАК ДатаОтправленияСоСтанции,
	               |	ДислокацияВагонов.СтанцияНазначения КАК СтанцияНазначения,
	               |	ДислокацияВагонов.Груз КАК Груз,
	               |	ДислокацияВагонов.Груженый КАК Груженый
	               |ПОМЕСТИТЬ ДтОтправления
	               |ИЗ
	               |	НесовпадениеСтанций КАК НесовпадениеСтанций
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДислокацияВагонов КАК ДислокацияВагонов
	               |		ПО НесовпадениеСтанций.Вагон = ДислокацияВагонов.Вагон
	               |			И НесовпадениеСтанций.СтанцияОтправления = ДислокацияВагонов.СтанцияОперации
	               |			И (ДислокацияВагонов.Период МЕЖДУ НесовпадениеСтанций.ДатаПрибытияНаСтанцию И НесовпадениеСтанций.Период)
	               |			И (ДислокацияВагонов.ОперацияСВагоном.ОтправлениеСоСтанции)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НесовпадениеСтанций.Вагон,
	               |	НесовпадениеСтанций.СтанцияОтправления,
	               |	НесовпадениеСтанций.ДатаПрибытияНаСтанцию,
	               |	ДислокацияВагонов.СтанцияНазначения,
	               |	ДислокацияВагонов.Груз,
	               |	ДислокацияВагонов.Груженый
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Повагонка.ДатаПомещенияВРежимПовагонки КАК Период,
	               |	Повагонка.НомерВагона КАК Вагон,
	               |	ДтОтправления.ДатаОтправленияСоСтанции КАК ДатаОтправленияСоСтанции,
	               |	ДтОтправления.СтанцияНазначения КАК СтанцияНазначения,
	               |	ДтОтправления.Груз КАК Груз,
	               |	ДтОтправления.Груженый КАК Груженый
	               |ИЗ
	               |	Повагонка КАК Повагонка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДислокацияЪ КАК ДислокацияЪ
	               |		ПО Повагонка.НомерВагона = ДислокацияЪ.Вагон
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДтОтправления КАК ДтОтправления
	               |		ПО Повагонка.НомерВагона = ДтОтправления.Вагон
	               |			И Повагонка.СтанцияОтправления = ДтОтправления.СтанцияОтправления";
	Ответ = Запрос.Выполнить().Выбрать();
	МассивВагонов = Новый Массив;
	
	Пока Ответ.Следующий() Цикл
		ТекЗапись = РегистрыСведений.ПовагонныеОтправки.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ТекЗапись,Ответ,,"СтанцияНазначения");
		ТекЗапись2 = РегистрыСведений.ПовагонныеОтправки.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ТекЗапись2, ТекЗапись);
		
		ТекЗапись.Прочитать();
		Если НЕ ТекЗапись.Выбран() Тогда
			ЗаполнитьЗначенияСвойств(ТекЗапись, ТекЗапись2);
		КонецЕсли;

		ТекЗапись.ДатаОтправления = Ответ.ДатаОтправленияСоСтанции;
		ТекЗапись.ДатаПередачиВПользование = ?(ЗначениеЗаполнено(ТекЗапись.ДатаПередачиВПользование),ТекЗапись.ДатаПередачиВПользование,Ответ.ДатаОтправленияСоСтанции);
		ТекЗапись.СтанцияНазначения = Ответ.СтанцияНазначения;
		ТекЗапись.Груз = Ответ.Груз;
		ТекЗапись.Груженый = Ответ.Груженый;
		
		ТекЗапись.Записать();
		
		МассивВагонов.Добавить(Ответ.Вагон);
	КонецЦикла;
	
	// создать оповещение для группы пользователей о готовности вагона к оформлению
	ОповещениеПользователейГотовностьВагона(МассивВагонов,"Отправление");

КонецПроцедуры

Процедура ОбновлениеДатыПрибытияНаСтанциюНазначения()
	// 2.1. СНП прибытия. обновляем только те вагоны, у которых нет даты прибытия на станцию назначения.
	// для данного вагона в РС Дислокация вагонов взять последнюю запись. если станция назначения = станции операции,
	// то берем данные по прибытию на станцию 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПовагонныеОтправкиСрезПоследних.Период КАК ДатаПомещенияВРежимПовагонки,
	               |	ПовагонныеОтправкиСрезПоследних.Вагон КАК НомерВагона,
	               |	ПовагонныеОтправкиСрезПоследних.СтанцияНазначения КАК СтанцияНазначения,
	               |	ПовагонныеОтправкиСрезПоследних.ДатаПрибытияНаСтанцию КАК ДатаПрибытияНаСтанцию,
	               |	ПовагонныеОтправкиСрезПоследних.ДатаОтправления КАК ДатаОтправления
	               |ПОМЕСТИТЬ Повагонка
	               |ИЗ
	               |	РегистрСведений.ПовагонныеОтправки.СрезПоследних(, ) КАК ПовагонныеОтправкиСрезПоследних
	               |ГДЕ
	               |	ПовагонныеОтправкиСрезПоследних.ВыводИзПовагонки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			И ПовагонныеОтправкиСрезПоследних.ДатаПрибытияНаСтанциюНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			И НЕ ПовагонныеОтправкиСрезПоследних.ДатаОтправления = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Повагонка.НомерВагона КАК Вагон,
	               |	Повагонка.СтанцияНазначения КАК СтанцияНазначения,
	               |	МИНИМУМ(ДислокацияВагонов.ДатаПрибытияНаСтанцию) КАК ДатаПрибытияНаСтанцию,
	               |	Повагонка.ДатаПомещенияВРежимПовагонки КАК Период
	               |ИЗ
	               |	Повагонка КАК Повагонка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДислокацияВагонов КАК ДислокацияВагонов
	               |		ПО Повагонка.НомерВагона = ДислокацияВагонов.Вагон
	               |			И (ДислокацияВагонов.Период > Повагонка.ДатаОтправления)
	               |			И Повагонка.СтанцияНазначения = ДислокацияВагонов.СтанцияОперации
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Повагонка.СтанцияНазначения,
	               |	Повагонка.НомерВагона,
	               |	Повагонка.ДатаПомещенияВРежимПовагонки";
	Ответ = Запрос.Выполнить().Выбрать();
	
	ТаблицаНовыхНазначений = Новый ТаблицаЗначений;
	ТаблицаНовыхНазначений.Колонки.Добавить("Период");
	ТаблицаНовыхНазначений.Колонки.Добавить("Вагон");
	ТаблицаНовыхНазначений.Колонки.Добавить("СтанцияОтправления");
	ТаблицаНовыхНазначений.Колонки.Добавить("СтанцияНазначения");
	ТаблицаНовыхНазначений.Колонки.Добавить("Клиент");
	ТаблицаНовыхНазначений.Колонки.Добавить("Договор");
	ТаблицаНовыхНазначений.Колонки.Добавить("СтанцияВвода");
	ТаблицаНовыхНазначений.Колонки.Добавить("ПСЦ");
	ТаблицаНовыхНазначений.Колонки.Добавить("ОтветственныйВнесДанные");
	ТаблицаНовыхНазначений.Колонки.Добавить("СобытиеПереводаВПовагонку");
	ТаблицаНовыхНазначений.Колонки.Добавить("ДатаПередачиВПользование");
	ТаблицаНовыхНазначений.Колонки.Добавить("ДатаПрибытияНаСтанцию");
	ТаблицаНовыхНазначений.Колонки.Добавить("РегионОтправления");
	ТаблицаНовыхНазначений.Колонки.Добавить("Подход");
	ТаблицаНовыхНазначений.Колонки.Добавить("НДС");
	ТаблицаНовыхНазначений.Колонки.Добавить("Калькуляция");
	
	МассивВагонов = Новый Массив;
	
	Пока Ответ.Следующий() Цикл
		ТекЗапись = РегистрыСведений.ПовагонныеОтправки.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ТекЗапись,Ответ,,"ДатаПрибытияНаСтанцию");
		ТекЗапись2 = РегистрыСведений.ПовагонныеОтправки.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ТекЗапись2, ТекЗапись);
		
		ТекЗапись.Прочитать();
		Если НЕ ТекЗапись.Выбран() Тогда
			ЗаполнитьЗначенияСвойств(ТекЗапись, ТекЗапись2);
		КонецЕсли;

		ТекЗапись.ДатаПрибытияНаСтанциюНазначения = Ответ.ДатаПрибытияНаСтанцию;
		
		// если повилось прибытие на станцию, то проверить, не вывела ли станция вагон из повагонки
		// (проверка на наличие даты вывода из повагонки). если вывода из повагонки нет, то проверить заполнение полей
		// "... следующего назначения".
		
		Если НЕ ЗначениеЗаполнено(ТекЗапись.ВыводИзПовагонки) И ЗначениеЗаполнено(Ответ.ДатаПрибытияНаСтанцию) Тогда
			НовСтр = ТаблицаНовыхНазначений.Добавить();
			НовСтр.Период = ТекЗапись.ДатаПрибытияНаСтанциюНазначения;
			НовСтр.Вагон = ТекЗапись.Вагон;
			НовСтр.СтанцияВвода = ТекЗапись.СтанцияВвода;
			НовСтр.ОтветственныйВнесДанные = ТекЗапись.ОтветственныйВнесДанные;
			НовСтр.СобытиеПереводаВПовагонку = ТекЗапись.СобытиеПереводаВПовагонку;
			НовСтр.Клиент = ?(ЗначениеЗаполнено(ТекЗапись.КлиентСледующегоНазначения),ТекЗапись.КлиентСледующегоНазначения,ТекЗапись.Клиент);
			НовСтр.Договор = ?(ЗначениеЗаполнено(ТекЗапись.ДоговорСледующегоНазначения),ТекЗапись.ДоговорСледующегоНазначения,ТекЗапись.Договор);
			НовСтр.ПСЦ = ?(ЗначениеЗаполнено(ТекЗапись.ПСЦСледующегоНазначения),ТекЗапись.ПСЦСледующегоНазначения,ТекЗапись.ПСЦ);
			НовСтр.СтанцияНазначения = ТекЗапись.СтанцияСледующегоНазначения;
			НовСтр.СтанцияОтправления = ТекЗапись.СтанцияНазначения;
			НовСтр.ДатаПередачиВПользование = ТекЗапись.ДатаПередачиВПользование;
			НовСтр.НДС = ?(ЗначениеЗаполнено(ТекЗапись.ПСЦСледующегоНазначения),ТекЗапись.ПСЦСледующегоНазначения.СтавкаНДС,ТекЗапись.ПСЦ.СтавкаНДС);
			НовСтр.Калькуляция = АвтоПОдстановкаКалькуляции(НовСтр.НДС,НовСтр.СтанцияОтправления,НовСтр.СтанцияНазначения,НовСтр.Вагон);
			НовСтр.ДатаПрибытияНаСтанцию = ТекЗапись.ДатаПрибытияНаСтанциюНазначения;
			
			//// 1. если у вагона станция следующего назначения равна станции назначения (проверка по синонимам локации),
			//// то переместить вагон в регистр повагонки.
			//Если Локации_сервер.ПолучитьСовпадениеСтанций(ТекЗапись.СтанцияСледующегоНазначения,ТекЗапись.СтанцияНазначения) Тогда 
			//	//НовСтр.ДатаПередачиВПользование = ТекЗапись.ДатаПрибытияНаСтанциюНазначения;
			//	НовСтр.ДатаПрибытияНаСтанцию = ТекЗапись.ДатаПрибытияНаСтанциюНазначения;
			//	НовСтр.СтанцияОтправления = ТекЗапись.СтанцияНазначения;
			//	НовСтр.Подход = Ложь;
			//// 2. если у вагона станция следующего назначения НЕ равна станции назначения (проверка по синонимам локации),
			//// то переместить вагон в регистр вагонов ПЛАНИРУЕМЫХ к повагонке.
			//Иначе
			//	//НовСтр.ДатаПередачиВПользование = ТекЗапись.ДатаПрибытияНаСтанциюНазначения;
			//	НовСтр.РегионОтправления = ТекЗапись.СтанцияНазначения;
			//	НовСтр.Подход = Истина;
			//КонецЕсли;
			
		КонецЕсли;
		
		ТекЗапись.Записать();
		
		МассивВагонов.Добавить(Ответ.Вагон);
	КонецЦикла;
				   
	// цикл по таблице новых назначений
	Для Каждого Стр Из ТаблицаНовыхНазначений Цикл
		
		//Если Стр.Подход Тогда
		//	ТекЗапись = РегистрыСведений.ВагоныЗапланированныеКПовагонке.СоздатьМенеджерЗаписи();
		//Иначе
			ТекЗапись = РегистрыСведений.ПовагонныеОтправки.СоздатьМенеджерЗаписи();
		//КонецЕсли;
		ЗаполнитьЗначенияСвойств(ТекЗапись,Стр);
		ТекЗапись.Записать();
	КонецЦикла;
	
	// создать оповещение для группы пользователей о готовности вагона к оформлению
	ОповещениеПользователейГотовностьВагона(МассивВагонов,"Прибытие");

КонецПроцедуры

Процедура ОбновлениеДатыОтправленияСоСтанцииНазначения()
	// 2.2. СНП прибытия. обновляем только те вагоны, у которых нет даты отправления со станции назначения.
	// для данного вагона в РС Дислокация вагонов взять последнюю запись. если станция назначения по повагонке НЕ
	// совпадает со станцией операции в дислокации, то значит вагон ушел со станции назначения и надо записать дату.
	// дату отправления берем как последнюю дату операции по данной станции в регистре дислокации
	// установив верхнюю границу периода - текущий период станции дислокации и нижнюю границу - дату прибытия на станцию назначения.
	// запишем станцию назначения
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПовагонныеОтправкиСрезПоследних.Период КАК ДатаПомещенияВРежимПовагонки,
	               |	ПовагонныеОтправкиСрезПоследних.Вагон КАК НомерВагона,
	               |	ПовагонныеОтправкиСрезПоследних.СтанцияНазначения КАК СтанцияНазначения,
	               |	ПовагонныеОтправкиСрезПоследних.ДатаПрибытияНаСтанциюНазначения КАК ДатаПрибытияНаСтанциюНазначения
	               |ПОМЕСТИТЬ Повагонка
	               |ИЗ
	               |	РегистрСведений.ПовагонныеОтправки.СрезПоследних(
	               |			,
	               |			НЕ ДатаПрибытияНаСтанциюНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |				И НЕ ДатаОтправления = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |				И ДатаОтправленияСоСтанцииНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ПовагонныеОтправкиСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ДислокацияВагонов.Период) КАК Период,
	               |	ДислокацияВагонов.Вагон КАК Вагон
	               |ПОМЕСТИТЬ ПериодДислокации
	               |ИЗ
	               |	Повагонка КАК Повагонка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДислокацияВагонов КАК ДислокацияВагонов
	               |		ПО Повагонка.НомерВагона = ДислокацияВагонов.Вагон
	               |			И Повагонка.СтанцияНазначения = ДислокацияВагонов.СтанцияОтправления
	               |			И Повагонка.СтанцияНазначения = ДислокацияВагонов.СтанцияОперации
	               |			И (ДислокацияВагонов.Период > Повагонка.ДатаПрибытияНаСтанциюНазначения)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДислокацияВагонов.Вагон
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ДислокацияВагонов.Период) КАК Период,
	               |	ДислокацияВагонов.Вагон КАК Вагон,
	               |	МАКСИМУМ(ДислокацияВагонов.ОперацияСВагоном) КАК ОперацияСВагоном
	               |ПОМЕСТИТЬ ВагоныОперации
	               |ИЗ
	               |	РегистрСведений.ДислокацияВагонов КАК ДислокацияВагонов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПериодДислокации КАК ПериодДислокации
	               |		ПО ДислокацияВагонов.Период = ПериодДислокации.Период
	               |			И ДислокацияВагонов.Вагон = ПериодДислокации.Вагон
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДислокацияВагонов.Вагон
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДислокацияВагонов.Период КАК Период,
	               |	ДислокацияВагонов.Вагон КАК Вагон,
	               |	ДислокацияВагонов.ОперацияСВагоном КАК ОперацияСВагоном,
	               |	ДислокацияВагонов.СтанцияОперации КАК СтанцияОперации
	               |ПОМЕСТИТЬ ДислокацияЪ
	               |ИЗ
	               |	РегистрСведений.ДислокацияВагонов КАК ДислокацияВагонов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВагоныОперации КАК ВагоныОперации
	               |		ПО ДислокацияВагонов.Период = ВагоныОперации.Период
	               |			И ДислокацияВагонов.Вагон = ВагоныОперации.Вагон
	               |			И ДислокацияВагонов.ОперацияСВагоном = ВагоныОперации.ОперацияСВагоном
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДислокацияЪ.Период КАК Период,
	               |	ДислокацияЪ.Вагон КАК Вагон,
	               |	Повагонка.СтанцияНазначения КАК СтанцияНазначения,
	               |	Повагонка.ДатаПрибытияНаСтанциюНазначения КАК ДатаПрибытияНаСтанциюНазначения
	               |ПОМЕСТИТЬ НесовпадениеСтанций
	               |ИЗ
	               |	Повагонка КАК Повагонка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДислокацияЪ КАК ДислокацияЪ
	               |		ПО Повагонка.НомерВагона = ДислокацияЪ.Вагон
	               |			И (Повагонка.СтанцияНазначения = ДислокацияЪ.СтанцияОперации)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НесовпадениеСтанций.Вагон КАК Вагон,
	               |	НесовпадениеСтанций.СтанцияНазначения КАК СтанцияНазначения,
	               |	НесовпадениеСтанций.ДатаПрибытияНаСтанциюНазначения КАК ДатаПрибытияНаСтанциюНазначения,
	               |	МАКСИМУМ(ДислокацияВагонов.Период) КАК ДатаОтправленияСоСтанции,
	               |	ДислокацияВагонов.СтанцияНазначения КАК СтанцияСледующегоНазначения
	               |ПОМЕСТИТЬ ДтОтправления
	               |ИЗ
	               |	НесовпадениеСтанций КАК НесовпадениеСтанций
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДислокацияВагонов КАК ДислокацияВагонов
	               |		ПО НесовпадениеСтанций.Вагон = ДислокацияВагонов.Вагон
	               |			И НесовпадениеСтанций.СтанцияНазначения = ДислокацияВагонов.СтанцияОперации
	               |			И (ДислокацияВагонов.Период МЕЖДУ НесовпадениеСтанций.ДатаПрибытияНаСтанциюНазначения И НесовпадениеСтанций.Период)
	               |			И (ДислокацияВагонов.ОперацияСВагоном.ОтправлениеСоСтанции)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НесовпадениеСтанций.Вагон,
	               |	НесовпадениеСтанций.СтанцияНазначения,
	               |	НесовпадениеСтанций.ДатаПрибытияНаСтанциюНазначения,
	               |	ДислокацияВагонов.СтанцияНазначения
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Повагонка.ДатаПомещенияВРежимПовагонки КАК Период,
	               |	Повагонка.НомерВагона КАК Вагон,
	               |	ДтОтправления.ДатаОтправленияСоСтанции КАК ДатаОтправленияСоСтанции,
	               |	ДтОтправления.СтанцияНазначения КАК СтанцияНазначения
	               |ИЗ
	               |	Повагонка КАК Повагонка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДислокацияЪ КАК ДислокацияЪ
	               |		ПО Повагонка.НомерВагона = ДислокацияЪ.Вагон
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДтОтправления КАК ДтОтправления
	               |		ПО Повагонка.НомерВагона = ДтОтправления.Вагон
	               |			И Повагонка.СтанцияНазначения = ДтОтправления.СтанцияНазначения";
	Ответ = Запрос.Выполнить().Выбрать();
	
	Пока Ответ.Следующий() Цикл
		ТекЗапись = РегистрыСведений.ПовагонныеОтправки.СоздатьМенеджерЗаписи();
		ТекЗапись.Вагон = Ответ.Вагон;
		ТекЗапись.Период = Ответ.Период;
		
		ТекЗапись2 = РегистрыСведений.ПовагонныеОтправки.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ТекЗапись2, ТекЗапись);
		
		ТекЗапись.Прочитать();
		Если НЕ ТекЗапись.Выбран() Тогда
			ЗаполнитьЗначенияСвойств(ТекЗапись, ТекЗапись2);
		КонецЕсли;

		ТекЗапись.ДатаОтправленияСоСтанцииНазначения = Ответ.ДатаОтправленияСоСтанции;
		ТекЗапись.СтанцияСледующегоНазначения = Ответ.СтанцияНазначения;
		
		ТекЗапись.Записать();
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьСписокПодходящихКалькуляций(ПараметрыЗапроса)
	
	МассивРазмеровВагона = ПолучитьМассивРодителейТипаТС(ПараметрыЗапроса.ТипТС,Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	               |ГДЕ
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ЖД_РасчетСебестоимостиДляТипаФГП В(&РазмерВагона)
	               |	И КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПунктОтправления В ИЕРАРХИИ(&ПунктОтправления)
	               |	И КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПунктНазначения В ИЕРАРХИИ(&ПунктНазначения)
	               |	И КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СтавкаНДС = &СтавкаНДС
	               |	И КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга = &ВыставляемаяУслуга";
	Запрос.УстановитьПараметр("ПунктОтправления",ПараметрыЗапроса.ПунктОтправления);
	Запрос.УстановитьПараметр("ПунктНазначения",ПараметрыЗапроса.ПунктНазначения);
	Запрос.УстановитьПараметр("СтавкаНДС",ПараметрыЗапроса.НДС);
	Запрос.УстановитьПараметр("РазмерВагона",МассивРазмеровВагона);
	Запрос.УстановитьПараметр("ВыставляемаяУслуга",Константы.УслугаДляПовагоннойЗаявки.Получить());

	ТЗ = Запрос.Выполнить().Выгрузить();
	МассивКалькуляций = ТЗ.ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивКалькуляций;
	
КонецФункции

Функция ПолучитьМассивРодителейТипаТС(ТипТС, ВключаяТекущий) 
	
	Результат = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(ТипТС) Тогда Возврат Результат; КонецЕсли;
	
	ТекРодитель = ТипТС.Родитель;
	Пока ЗначениеЗаполнено(ТекРодитель) Цикл
		Результат.Добавить(ТекРодитель);
		ТекРодитель = ТекРодитель.Родитель;
	КонецЦикла;
	
	Если ВключаяТекущий = Истина Тогда Результат.Добавить(ТипТС); КОнецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ОповещениеПользователейИсключениеИзПовагонки() ЭКСПОРТ
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПовагонныеОтправкиСрезПоследних.Период КАК Период,
	               |	ПовагонныеОтправкиСрезПоследних.Вагон КАК Вагон,
	               |	ПовагонныеОтправкиСрезПоследних.ВыводИзПовагонки КАК ВыводИзПовагонки
	               |ИЗ
	               |	РегистрСведений.ПовагонныеОтправки.СрезПоследних(, ) КАК ПовагонныеОтправкиСрезПоследних
	               |ГДЕ
	               |	НЕ ПовагонныеОтправкиСрезПоследних.ОповещениеСоздано
	               |			И НЕ ПовагонныеОтправкиСрезПоследних.ВыводИзПовагонки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
	ТЗ = Запрос.Выполнить().Выгрузить();
	МассивВагонов = ТЗ.ВыгрузитьКолонку("Вагон");
	
	ЗВ = Документы.ЗапланированноеВзаимодействие.СоздатьДокумент();
	ЗВ.Дата = ТекущаяДата();
	ЗВ.Автор = Пользователи.ТекущийПользователь();
	ЗВ.СоздатьПроизводственнуюЗадачу = Истина;
	ЗВ.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	ЗВ.ДатаНачала = ТекущаяДата();
	СтрокаСВагонами = "";
	Для Каждого Эл Из МассивВагонов Цикл
		СтрокаСВагонами = СтрокаСВагонами + Эл + Символы.ПС;
	КонецЦикла;
	
	ЗВ.Тема = "Удаление вагонов из повагонки";
	ТЧ_Участники = ЗВ.Участники;
	НовСтр = ТЧ_Участники.Добавить();
	НовСтр.Контакт = Константы.ГруппаИнформируемыхОбИсключенииВагонаИзПовагонки.Получить();
	ЗаголовокОписания = "Из режима повагонки были исключены следующие вагоны:";
	
	ЗВ.Описание = ЗаголовокОписания + Символы.ПС + СтрокаСВагонами;
	ПОпытка
		ЗВ.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ЗВ.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;
	
	// изменить запись в РС повагонныеОтправки
	Для Каждого Стр Из ТЗ Цикл
		ТекЗапись = РегистрыСведений.ПовагонныеОтправки.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ТекЗапись,Стр);
		ТекЗапись2 = РегистрыСведений.ПовагонныеОтправки.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ТекЗапись2, Стр);
		ТекЗапись.Прочитать();
		
		Если НЕ ТекЗапись.Выбран() Тогда
			ЗаполнитьЗначенияСвойств(ТекЗапись, ТекЗапись2);
		КонецЕсли;
		
		ТекЗапись.ОповещениеСоздано = Истина;
		ТекЗапись.Записать();
	КонецЦикла;
		
КонецПроцедуры

Процедура ОповещениеПользователейГотовностьВагона(МассивВагонов,ТипОповещения) 

	ЗВ = Документы.ЗапланированноеВзаимодействие.СоздатьДокумент();
	ЗВ.Дата = ТекущаяДата();
	ЗВ.Автор = Пользователи.ТекущийПользователь();
	ЗВ.СоздатьПроизводственнуюЗадачу = Истина;
	ЗВ.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	ЗВ.ДатаНачала = ТекущаяДата();
	СтрокаСВагонами = "";
	Для Каждого Эл Из МассивВагонов Цикл
		СтрокаСВагонами = СтрокаСВагонами + Эл + Символы.ПС;
	КонецЦикла;
	
	
	ЗВ.Тема = "Оформление вагонов";
	ТЧ_Участники = ЗВ.Участники;
	НовСтр = ТЧ_Участники.Добавить();
	НовСтр.Контакт = Константы.ГруппаИнформируемыхОбИсключенииВагонаИзПовагонки.Получить();
	
	Если ТипОповещения = "Отправление" Тогда
		ЗаголовокОписания = "Список вагонов к оформлению документов по отправке:";
	Иначе
		ЗаголовокОписания = "Список вагонов к оформлению документов по прибытию:"	
	КонецЕсли;
	
	ЗВ.Описание = ЗаголовокОписания + Символы.ПС + СтрокаСВагонами;
	ПОпытка
		ЗВ.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ЗВ.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьРегионОтправления(СтанцияОперации,Вагон) ЭКСПОРТ
	
	ПрибылВРегион = Ложь;
	
	РегионОтправленияИерархМассив = Локации_сервер.ПолучитьМассивРодителей(СтанцияОперации,Истина);
	//Евросиб Каблов 25.02.2021 (
	АналогиСтанции = Локации_сервер.ПолучитьАналогиИСтанцииБлижеЧемУказано(СтанцияОперации, 0);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(РегионОтправленияИерархМассив, АналогиСтанции, Истина);
	//Евросиб Каблов 25.02.2021 ) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВагоныЗапланированныеКПовагонке.Вагон КАК Вагон,
	               |	ВагоныЗапланированныеКПовагонке.РегионОтправления КАК РегионОтправления
	               |ИЗ
	               |	РегистрСведений.ВагоныЗапланированныеКПовагонке КАК ВагоныЗапланированныеКПовагонке
	               |ГДЕ
	               |	ВагоныЗапланированныеКПовагонке.Вагон = &Вагон
	               |	И ВагоныЗапланированныеКПовагонке.РегионОтправления В(&РегионОтправления)
	               |	И НЕ ВагоныЗапланированныеКПовагонке.РегионОтправления = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Вагон", Вагон);
	Запрос.УстановитьПараметр("РегионОтправления", РегионОтправленияИерархМассив);
	
	РЗ = Запрос.Выполнить();
	
	Если НЕ РЗ.Пустой() Тогда
		ПрибылВРегион = Истина;
	КонецЕсли;
	
	Возврат ПрибылВРегион;
	
КонецФункции

Процедура ЗаписатьСделкуВРегистр(Сделка,СписокВагонов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПовагонныеОтправкиСрезПоследних.Период КАК Период,
	               |	ПовагонныеОтправкиСрезПоследних.Вагон КАК Вагон
	               |ИЗ
	               |	РегистрСведений.ПовагонныеОтправки.СрезПоследних(, Вагон В (&СписокВагонов)) КАК ПовагонныеОтправкиСрезПоследних";
				   //|ГДЕ
				   //|	ПовагонныеОтправкиСрезПоследних.Сделка = ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
				   //|			И НЕ ПовагонныеОтправкиСрезПоследних.ЗаявкаНеПодходит
				   //|			И НЕ ПовагонныеОтправкиСрезПоследних.Заявка = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка)";
	Запрос.УстановитьПараметр("СписокВагонов",СписокВагонов);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
	
		ТекЗапись = РегистрыСведений.ПовагонныеОтправки.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ТекЗапись,Ответ);
		ТекЗапись2 = РегистрыСведений.ПовагонныеОтправки.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ТекЗапись2, ТекЗапись);
		
		ТекЗапись.Прочитать();
		Если НЕ ТекЗапись.Выбран() Тогда
			ЗаполнитьЗначенияСвойств(ТекЗапись, ТекЗапись2);
		КонецЕсли;
		
		ТекЗапись.Сделка = Сделка;
		
		ТекЗапись.Записать();
	КонецЦикла;
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ПовагонныеОтправкиСрезПоследних.Период КАК Период,
	//               |	ПовагонныеОтправкиСрезПоследних.Вагон КАК Вагон,
	//               |	ПовагонныеОтправкиСрезПоследних.Заявка КАК Заявка
	//               |ИЗ
	//               |	РегистрСведений.ПовагонныеОтправки.СрезПоследних(
	//               |			,
	//               |			Вагон = &Вагон
	//               |				И Период = &Период) КАК ПовагонныеОтправкиСрезПоследних";
	//
	//Запрос.УстановитьПараметр("Вагон", СтруктураДанныхСтроки.НомерВагона);
	//Запрос.УстановитьПараметр("Период", СтруктураДанныхСтроки.ДатаПомещенияВРежимПовагонки);
	
КонецПроцедуры

Функция СоздатьКвантВремениРеализации(ДатаОтправления,КвантВремени,ТЗВспомогательная) ЭКСПОРТ
	
	ДатаНачалаПериодаПовагонкиУчДок = ДатаОтправления;
	ДатаОкончанияПериодаПовагонкиУчДок = ДатаОтправления + КвантВремени*3600;
	
	// поиск кванта времени
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВремТЧ.ДатаНачалаПериодаПовагонкиУчДок КАК ДатаНачалаПериодаПовагонки,
	               |	ВремТЧ.ДатаОкончанияПериодаПовагонкиУчДок КАК ДатаОкончанияПериодаПовагонки
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	&ВремТЧ КАК ВремТЧ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ВТ.ДатаОкончанияПериодаПовагонки КАК ДатаОкончанияПериодаПовагонки
	               |ИЗ
	               |	ВТ КАК ВТ
	               |ГДЕ
	               |	НЕ ВТ.ДатаОкончанияПериодаПовагонки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |	И НЕ ВТ.ДатаНачалаПериодаПовагонки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |	И ВТ.ДатаОкончанияПериодаПовагонки < &ТекДатаОтпр
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаОкончанияПериодаПовагонки УБЫВ";
	Запрос.УстановитьПараметр("ВремТЧ",ТЗВспомогательная);
	Запрос.УстановитьПараметр("ТекДатаОтпр",ДатаОтправления);
	РЗ = Запрос.Выполнить();
	
	Если РЗ.Пустой() Тогда
		
		// если не нашли дат ранее текущей, то проверить, нет ли дат после нее
		Запрос2 = Новый Запрос;
		Запрос2.Текст = "ВЫБРАТЬ
		                |	ВремТЧ.ДатаНачалаПериодаПовагонкиУчДок КАК ДатаНачалаПериодаПовагонки,
		                |	ВремТЧ.ДатаОкончанияПериодаПовагонкиУчДок КАК ДатаОкончанияПериодаПовагонки
		                |ПОМЕСТИТЬ ВТ
		                |ИЗ
		                |	&ВремТЧ КАК ВремТЧ
		                |;
		                |
		                |////////////////////////////////////////////////////////////////////////////////
		                |ВЫБРАТЬ ПЕРВЫЕ 1
		                |	ВТ.ДатаНачалаПериодаПовагонки КАК ДатаНачалаПериодаПовагонки
		                |ИЗ
		                |	ВТ КАК ВТ
		                |ГДЕ
		                |	НЕ ВТ.ДатаОкончанияПериодаПовагонки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		                |	И НЕ ВТ.ДатаНачалаПериодаПовагонки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		                |	И ВТ.ДатаНачалаПериодаПовагонки > &ТекДатаОтпр
		                |
		                |УПОРЯДОЧИТЬ ПО
		                |	ВТ.ДатаНачалаПериодаПовагонки";
		Запрос2.УстановитьПараметр("ВремТЧ",ТЗВспомогательная);
		Запрос2.УстановитьПараметр("ТекДатаОтпр",ДатаОтправления);
		РЗ2 = Запрос2.Выполнить();
		
		// если и здесь пусто, то считаем эту дату начальной и от нее строим всю остальную цепочку
		Если РЗ2.Пустой() Тогда
			ДатаНачалаПериодаПовагонкиУчДок = ДатаОтправления;
			ДатаОкончанияПериодаПовагонкиУчДок = ДатаОтправления + КвантВремени*3600*24;
			
		// если что-то нашли,  то выбираем диапазоны дат так, чтобы между найденной и текущей были равные кванту времени промежутки
		Иначе
			Ответ2 = Запрос2.Выполнить().Выбрать();
		
			Если Ответ2.Следующий() Тогда
				ДельтаДни = (Ответ2.ДатаНачалаПериодаПовагонки - ДатаОтправления)/3600/24;
				КолвоИнтервалов = Цел(ДельтаДни/КвантВремени);
				ВсегоДнейВИнтервалах = КолвоИнтервалов*КвантВремени;
				ОстатокПоДням = ДельтаДни - ВсегоДнейВИнтервалах;
				НачалоПервогоЗаИскомымПериода = Ответ2.ДатаНачалаПериодаПовагонки - ВсегоДнейВИнтервалах*3600*24;
				НачалоИскомогоПериода = НачалоПервогоЗаИскомымПериода - КвантВремени*3600*24;
				// вычитаем единицу, чтобы интервалы не пересекались
				КонецИскомогоПериода = НачалоПервогоЗаИскомымПериода - 1;
				
				ДатаНачалаПериодаПовагонкиУчДок = НачалоИскомогоПериода;
				ДатаОкончанияПериодаПовагонкиУчДок = КонецИскомогоПериода;
			КонецЕсли;
		КонецЕсли;
		
	// если что-то нашли, то выбираем диапазоны дат так, чтобы между найденной и текущей были равные кванту времени промежутки
	Иначе
		Ответ = Запрос.Выполнить().Выбрать();
		
		Если Ответ.Следующий() Тогда
			ДельтаДни = (ДатаОтправления - Ответ.ДатаОкончанияПериодаПовагонки)/3600/24;
			КолвоИнтервалов = Цел(ДельтаДни/КвантВремени);
			ВсегоДнейВИнтервалах = КолвоИнтервалов*КвантВремени;
			ОстатокПоДням = ДельтаДни - ВсегоДнейВИнтервалах;
			ОкончаниеПоследнегоПередИскомымПериода = Ответ.ДатаОкончанияПериодаПовагонки + ВсегоДнейВИнтервалах*3600*24;
			// вычитаем единицу, чтобы интервалы не пересекались
			НачалоИскомогоПериода = ОкончаниеПоследнегоПередИскомымПериода - 1;
			КонецИскомогоПериода = НачалоИскомогоПериода + КвантВремени*3600*24;
			
			ДатаНачалаПериодаПовагонкиУчДок = НачалоИскомогоПериода;
			ДатаОкончанияПериодаПовагонкиУчДок = КонецИскомогоПериода;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураОтвета = Новый СТруктура;
	СтруктураОтвета.Вставить("ДатаНач",ДатаНачалаПериодаПовагонкиУчДок);
	СтруктураОтвета.Вставить("ДатаКон",ДатаОкончанияПериодаПовагонкиУчДок);
	
	Возврат СтруктураОтвета;
	
КонецФункции

Процедура СНПВыгрузкиВСделки(МассивСтруктур) ЭКСПОРТ
	
	ТблВагонов = Новый ТаблицаЗначений;
	ТблВагонов.Колонки.Добавить("НомерВагона",Новый ОписаниеТипов("СправочникСсылка.ТС"));
	ТблВагонов.Колонки.Добавить("ДатаОтправления",Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	
	Для Каждого Эл Из МассивСтруктур Цикл
		НовСтр = ТблВагонов.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Эл);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВремТЧ.НомерВагона КАК НомерВагона,
		|	ВремТЧ.ДатаОтправления КАК ДатаОтправления
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ВремТЧ КАК ВремТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПовагонныеОтправки.Период КАК Период,
		|	ПовагонныеОтправки.Вагон КАК НомерВагона,
		|	ПовагонныеОтправки.СтанцияОтправления КАК СтанцияОтправления,
		|	ПовагонныеОтправки.Сделка КАК Сделка,
		|	ПовагонныеОтправки.РТУ КАК РТУ,
		|	ПовагонныеОтправки.Клиент КАК Клиент,
		|	ПовагонныеОтправки.Договор КАК Договор,
		|	ПовагонныеОтправки.Калькуляция КАК Калькуляция,
		|	ПовагонныеОтправки.Заявка КАК Заявка,
		|	ПовагонныеОтправки.ДатаОтправления КАК ДатаОтправления,
		|	ПовагонныеОтправки.ДатаПрибытияНаСтанцию КАК ДатаПрибытияНаСтанцию,
		|	ПовагонныеОтправки.ДатаОтправленияСоСтанцииНазначения КАК ДатаОтправленияСоСтанцииНазначения,
		|	ПовагонныеОтправки.ДатаПрибытияНаСтанциюНазначения КАК ДатаПрибытияНаСтанциюНазначения,
		|	ПовагонныеОтправки.СтанцияНазначения КАК СтанцияНазначения,
		|	ВЫБОР
		|		КОГДА ПовагонныеОтправки.Заявка = ЗНАЧЕНИЕ(Документ.Заявка.пустаяссылка)
		|			ТОГДА ПовагонныеОтправки.ДатаПрибытияНаСтанцию
		|		КОГДА ПовагонныеОтправки.ДатаПрибытияНаСтанцию = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ПовагонныеОтправки.Заявка.Дата
		|		КОГДА НЕ ПовагонныеОтправки.Заявка = ЗНАЧЕНИЕ(Документ.Заявка.пустаяссылка)
		|				И НЕ ПовагонныеОтправки.ДатаПрибытияНаСтанцию = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ВЫБОР
		|					КОГДА ПовагонныеОтправки.ДатаПрибытияНаСтанцию > ПовагонныеОтправки.Заявка.Дата
		|						ТОГДА ПовагонныеОтправки.ДатаПрибытияНаСтанцию
		|					ИНАЧЕ ПовагонныеОтправки.Заявка.Дата
		|				КОНЕЦ
		|	КОНЕЦ КАК ДатаПрибытияДляСНП,
		|	ПовагонныеОтправки.НДС КАК НДС,
		|	ПовагонныеОтправки.КалькуляцияНеПодходит КАК КалькуляцияНеПодходит,
		|	ВЫБОР
		|		КОГДА НЕ ПовагонныеОтправки.ДатаОтправленияСоСтанцииНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				И НЕ ПовагонныеОтправки.ДатаПрибытияНаСтанциюНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РАЗНОСТЬДАТ(ПовагонныеОтправки.ДатаПрибытияНаСтанциюНазначения, ПовагонныеОтправки.ДатаОтправленияСоСтанцииНазначения, ДЕНЬ)
		|		КОГДА НЕ ПовагонныеОтправки.ПереводВНРП = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				И НЕ ПовагонныеОтправки.ДатаПрибытияНаСтанциюНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РАЗНОСТЬДАТ(ПовагонныеОтправки.ДатаПрибытияНаСтанциюНазначения, ПовагонныеОтправки.ПереводВНРП, ДЕНЬ)
		|		КОГДА НЕ ПовагонныеОтправки.ДатаОкончанияПользования = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				И НЕ ПовагонныеОтправки.ДатаПрибытияНаСтанциюНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РАЗНОСТЬДАТ(ПовагонныеОтправки.ДатаПрибытияНаСтанциюНазначения, ПовагонныеОтправки.ДатаОкончанияПользования, ДЕНЬ)
		|	КОНЕЦ КАК ДельтаВыгрузки,
		|	РАЗНОСТЬДАТ(ПовагонныеОтправки.ДатаПередачиВПользование, ПовагонныеОтправки.ДатаОкончанияПользования, ДЕНЬ) КАК ДельтаОбщегоПользования,
		|	ПовагонныеОтправки.ПСЦ КАК ПСЦ
		|ПОМЕСТИТЬ Повагонка
		|ИЗ
		|	ВТ КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПовагонныеОтправки КАК ПовагонныеОтправки
		|		ПО ВТ.НомерВагона = ПовагонныеОтправки.Вагон
		|			И ВТ.ДатаОтправления = ПовагонныеОтправки.ДатаОтправления
		|ГДЕ
		|	НЕ ПовагонныеОтправки.ДатаПрибытияНаСтанциюНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И (НЕ ПовагонныеОтправки.ДатаОтправленияСоСтанцииНазначения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ИЛИ НЕ ПовагонныеОтправки.ДатаОкончанияПользования = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ИЛИ НЕ ПовагонныеОтправки.ПереводВНРП = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|	И (НЕ ПовагонныеОтправки.РТУСНПВыгрузки
		|			ИЛИ НЕ ПовагонныеОтправки.РТУСНППогрузки
		|			ИЛИ НЕ ПовагонныеОтправки.РТУСНППеревозки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА Повагонка.ДельтаВыгрузки > ПСЦКалькуляцииПовагонки.СНПВыгрузкиДни
		|			ТОГДА Повагонка.ДельтаВыгрузки - ПСЦКалькуляцииПовагонки.СНПВыгрузкиДни
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СНПВыгрузки,
		|	ВЫБОР
		|		КОГДА Повагонка.ДельтаОбщегоПользования > ПСЦКалькуляцииПовагонки.НормативСледованияДни
		|			ТОГДА Повагонка.ДельтаОбщегоПользования - ПСЦКалькуляцииПовагонки.НормативСледованияДни
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СНПСледования,
		|	Повагонка.НомерВагона КАК НомерВагона,
		|	Повагонка.Период КАК Период,
		|	Повагонка.СтанцияОтправления КАК СтанцияОтправления,  
		//|	ВыставлениеПосуточнойАренды.Регистратор КАК Сделка
		//ДИТ Беляев СЮ, Ticket#0248292, 03-11-2021 ++ (Убираем использование регистра <ВыставлениеПосуточнойАренды>
		|	Значение(Документ.Сделка.ПустаяСсылка) КАК Сделка
		//ДИТ Беляев СЮ, Ticket#0248292, 03-11-2021 --
		|ИЗ
		|	Повагонка КАК Повагонка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПСЦ.КалькуляцииПовагонки КАК ПСЦКалькуляцииПовагонки
		|		ПО Повагонка.ПСЦ = ПСЦКалькуляцииПовагонки.Ссылка
		|			И Повагонка.Калькуляция = ПСЦКалькуляцииПовагонки.Калькуляция       
		//ДИТ Беляев СЮ, Ticket#0248292, 03-11-2021 ++ (Убираем использование регистра <ВыставлениеПосуточнойАренды>
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыставлениеПосуточнойАренды КАК ВыставлениеПосуточнойАренды
		//|		ПО Повагонка.НомерВагона = ВыставлениеПосуточнойАренды.НомерВагона
		//|			И Повагонка.ДатаОтправления = ВыставлениеПосуточнойАренды.Период
		//|			И (ВыставлениеПосуточнойАренды.Регистратор ССЫЛКА Документ.Сделка)
		//ДИТ Беляев СЮ, Ticket#0248292, 03-11-2021 --                       
		|ГДЕ
		|	(Повагонка.ДельтаВыгрузки > ПСЦКалькуляцииПовагонки.СНПВыгрузкиДни
		|			ИЛИ Повагонка.ДельтаОбщегоПользования > ПСЦКалькуляцииПовагонки.НормативСледованияДни) 
		|ИТОГИ ПО
		|	Сделка
		|";
	
	Запрос.УстановитьПараметр("ВремТЧ",ТблВагонов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСделка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСделка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(ВыборкаСделка.Сделка) ТОгда 
			Продолжить;
		КонецЕсли;
		
		НоваяСделка = ВыборкаСделка.Сделка.ПолучитьОбъект();
		доходы_ЗаполнитьПоЗаявкам2(НоваяСделка,4);
		
		Попытка
			НоваяСделка.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			НоваяСделка.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
		
		ВыборкаДетальныеЗаписи = ВыборкаСделка.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			///////////////////////////////
		КонецЦикла;
	КонецЦикла;
	
	
	
КонецПроцедуры

Функция АвтоПОдстановкаКалькуляции(СтавкаНДС,СтанцияОтправления,СтанцияНазначения,НомерВагона);
	
	Калькуляция = Документы.Калькуляция.ПустаяСсылка();
	
	МассивРазмеровВагона = ПолучитьМассивРодителейТипаТС(НомерВагона.ТипТС,Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	               |ГДЕ
	               |	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка.ЖД_РасчетСебестоимостиДляТипаФГП В(&РазмерВагона)
	               |	И КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПунктОтправления В ИЕРАРХИИ(&ПунктОтправления)
	               |	И КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПунктНазначения В ИЕРАРХИИ(&ПунктНазначения)
	               |	И КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.СтавкаНДС = &СтавкаНДС
	               |	И КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга = &ВыставляемаяУслуга";
	Запрос.УстановитьПараметр("ПунктОтправления",СтанцияОтправления);
	Запрос.УстановитьПараметр("ПунктНазначения",СтанцияНазначения);
	Запрос.УстановитьПараметр("СтавкаНДС",СтавкаНДС);
	Запрос.УстановитьПараметр("РазмерВагона",МассивРазмеровВагона);
	Запрос.УстановитьПараметр("ВыставляемаяУслуга",Константы.УслугаДляПовагоннойЗаявки.Получить());

	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Калькуляция = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Калькуляция;
	
КонецФункции
