
&НаКлиенте
Процедура ТЗ_3_ПанельОтчетовПриИзменении(Элемент)
	
	Для каждого Стр из ТЗ_3_ПанельОтчетовКоды Цикл
		Если Стр.Код = ТЗ_3_ПанельОтчетов И ЗначениеЗаполнено(Стр.КодВызова) Тогда
			ОткрытьФорму(Стр.КодВызова);
		КонецЕсли;
	КонецЦикла;
	
	ТЗ_3_ПанельОтчетов = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДемо(Команда)
	Демо = НЕ Демо;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВсеПоказатели(Команда)
	
	ОбновитьПоказатели();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоказатели()
	
	СсылкаТекПользователя = ПолучитьСсылкуТекПользователя();
	
	// 1
	ТЗ_1_ВходящиеЗадачи.Очистить();
	ТЗ_1_ИсходящиеЗадачи.Очистить();
	Если Демо Тогда
		
		НСтр = ТЗ_1_ВходящиеЗадачи.Добавить();
		НСтр.Задача = "Укомплектовать КП на Забайкальск";
		НСтр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.ВРаботе");
		НСтр.Постановщик = ПользователиКлиент.ТекущийПользователь();
		НСтр.ДатаПостановки = текущаядата()-7*24*3600;
		НСтр.СрокИсполнения = текущаядата()+3*24*3600;
		
		НСтр = ТЗ_1_ВходящиеЗадачи.Добавить();
		НСтр.Задача = "До конца месяца реализовать 10 поездов в Находку";
		НСтр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.ВРаботе");
		НСтр.Постановщик = ПользователиКлиент.ТекущийПользователь();
		НСтр.ДатаПостановки = НачалоМесяца(текущаядата());
		НСтр.СрокИсполнения = КонецМесяца(текущаядата());
		
		НСтр = ТЗ_1_ИсходящиеЗадачи.Добавить();
		НСтр.Задача = "Продать 200 TEU направления Находка";
		НСтр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.ВРаботе");
		НСтр.Сотрудник = ПользователиКлиент.ТекущийПользователь();
		НСтр.ДатаПостановки = НачалоМесяца(текущаядата());
		НСтр.СрокИсполнения = КонецМесяца(текущаядата());
		
		НСтр = ТЗ_1_ИсходящиеЗадачи.Добавить();
		НСтр.Задача = "Заключить договор с автоперевозчиком ТрансПеревозки ДВ";
		НСтр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен");
		НСтр.Сотрудник = ПользователиКлиент.ТекущийПользователь();
		НСтр.ДатаПостановки = НачалоМесяца(текущаядата());
		НСтр.СрокИсполнения = КонецМесяца(текущаядата());
		
		НСтр = ТЗ_1_ИсходящиеЗадачи.Добавить();
		НСтр.Задача = "Заключить договор на 75 TEU перевозку в Забайкальск";
		НСтр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен");
		НСтр.Сотрудник = ПользователиКлиент.ТекущийПользователь();
		НСтр.ДатаПостановки = НачалоМесяца(текущаядата());
		НСтр.СрокИсполнения = КонецМесяца(текущаядата());
		
	Иначе
		
		РЕЗ = АРМ_Сервер.ПолучитьЗначениеПоказателя("ВходящиеЗадачи", Новый Структура("Контекст", ТЗ_1_Контекст));
		Для каждого Стр из РЕЗ Цикл
			ЗаполнитьЗначенияСвойств(ТЗ_1_ВходящиеЗадачи.Добавить(), Стр);
		КонецЦикла;
		
		РЕЗ = АРМ_Сервер.ПолучитьЗначениеПоказателя("ИсходящиеЗадачи", Новый Структура("Контекст", ТЗ_1_Контекст));
		Для каждого Стр из РЕЗ Цикл
			ЗаполнитьЗначенияСвойств(ТЗ_1_ИсходящиеЗадачи.Добавить(), Стр);
		КонецЦикла;
		
	КонецЕсли;
	
	// 2 диаграмма Ганта
	Если Демо Тогда
		ДГ.Очистить();
		ДГ.Обновление = Ложь;
		
		Сделка1 = ДГ.УстановитьТочку("КП SIBUR08 / Сделка № 2568/19 от 04.08.19 Электроугли - Иня-Восточная");
		ПоказательЦвета = ДГ.УстановитьСерию("");
		ПродЗначение = ДГ.ПолучитьЗначение(Сделка1, ПоказательЦвета);
		ПериодХ = ПродЗначение.Добавить();
		ПериодХ.Начало = ТекущаяДата()-3*24*3600;
		ПериодХ.Конец = ТекущаяДата()+7*24*3600;
		ПериодХ.Расшифровка = ПредопределенноеЗначение("Справочник.ОтчетыВ_АРМах.АРМРуководителя");
		
		Сделка2 = ДГ.УстановитьТочку("КП SIBUR07 / Сделка № 1158/19 от 20.07.19 Автово-Эксп - Электроугли");
		ПродЗначение = ДГ.ПолучитьЗначение(Сделка2, ПоказательЦвета);
		ПериодХ = ПродЗначение.Добавить();
		ПериодХ.Начало = ТекущаяДата()-13*24*3600;
		ПериодХ.Конец = ТекущаяДата()-4*24*3600;
		ПериодХ.Расшифровка = ПредопределенноеЗначение("Справочник.ОтчетыВ_АРМах.АРМРуководителя");
		
		
		ДГ.Обновление = Истина;
	Иначе
		
		ВыбратьСделкиОперации();
		
	КонецЕсли;
	
	// 3
	ТЗ_3_ПанельОтчетовКоды.Очистить();
	ТЗ_3_ПанельОтчетов = 0;
	//НСтр = ТЗ_3_ПанельОтчетовКоды.Добавить();
	//НСтр.Код = 0;
	//НСтр.Заголовок = " ";
	//НСтр.КодВызова = "";
		
	Если СсылкаТекПользователя.количество() > 0 Тогда
		Сч = 1;
		Для каждого Стр из ПолучитьСписокОтчетов(СсылкаТекПользователя[0].АРМ) Цикл
			НСтр = ТЗ_3_ПанельОтчетовКоды.Добавить();
			НСтр.Код = Сч;
			НСтр.Заголовок = Стр.НаименованиеОтчета;
			НСтр.КодВызова = "Отчет."+Стр.НаименованиеОтчетаВСистеме+".Форма";
			Сч = Сч + 1;
		КонецЦикла;
		
	КонецЕсли;

	Элементы.ТЗ_3_ПанельОтчетов.СписокВыбора.Очистить();
	Для каждого Стр из ТЗ_3_ПанельОтчетовКоды Цикл Элементы.ТЗ_3_ПанельОтчетов.СписокВыбора.Добавить(Стр.Код, Стр.Заголовок); КонецЦикла;
	
	// 5
	ТЗ_5_СписокПоказателей.Очистить();
	Если СсылкаТекПользователя.количество() > 0 Тогда
		
		ТаблицаКнопок5 = ПолучитьТаблицуКнопок5ПоПрофиль(СсылкаТекПользователя[0].АРМ);
		Для каждого Стр из ТаблицаКнопок5 Цикл
			ЗаполнитьЗначенияСвойств(ТЗ_5_СписокПоказателей.Добавить(), Стр);
		КонецЦикла;
		
		ДобавитьЭлементыНаСервере();
		
	КонецЕсли;
	
	
	// 6
	ТЗ_6_СписокПроблем.Очистить();
	Если Демо Тогда
		
		НСтр = ТЗ_6_СписокПроблем.Добавить();
		НСтр.Исполнитель = ПользователиКлиент.ТекущийПользователь();
		НСтр.Операция = неопределено;
		НСтр.Регион = ПредопределенноеЗначение("Справочник.Локации.РОССИЯ");
		НСтр.КлассНарушения = ПредопределенноеЗначение("Перечисление.КлассНарушенияАРМРуководителя.НарушениеСрока");
		НСтр.МераОтклонения = 55;
		
		НСтр = ТЗ_6_СписокПроблем.Добавить();
		НСтр.Исполнитель = ПользователиКлиент.ТекущийПользователь();
		НСтр.Операция = неопределено;
		НСтр.Регион = ПредопределенноеЗначение("Справочник.Локации.РОССИЯ");
		НСтр.КлассНарушения = ПредопределенноеЗначение("Перечисление.КлассНарушенияАРМРуководителя.ОтказИсполнения");
		НСтр.МераОтклонения = 0;
		
		НСтр = ТЗ_6_СписокПроблем.Добавить();
		НСтр.Исполнитель = ПользователиКлиент.ТекущийПользователь();
		НСтр.Операция = неопределено;
		НСтр.Регион = ПредопределенноеЗначение("Справочник.Локации.РОССИЯ");
		НСтр.КлассНарушения = ПредопределенноеЗначение("Перечисление.КлассНарушенияАРМРуководителя.ОтклонениеЦены");
		НСтр.МераОтклонения = -3500;
		
	Иначе
		
		ВыбратьСписокПроблем();
		
	КонецЕсли;
	
	Элементы.ТЗ_6_СписокПроблемИсполнитель.ТекстПодвала = Формат(ТЗ_6_СписокПроблем.Количество(), "ЧГ=");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементыНаСервере()
	
	МассивУдал = Новый Массив;
	Для каждого стр из Элементы.Группа5ОперативнаяШкала.ПодчиненныеЭлементы Цикл
		Если НЕ стр.Имя = "ПериодОтображенияПоказателей" Тогда
			МассивУдал.Добавить(стр);
		КонецЕсли;
	КонецЦикла;
	Для каждого стр из МассивУдал Цикл
		ЭтаФорма.Элементы.Удалить(стр);
	КонецЦикла;
	
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	
	СопоставлениеГрупп = Новый Соответствие;
	
	Для каждого Стр из ТЗ_5_СписокПоказателей цикл
		
		КП = СтрЗаменить(Стр.КатегорияПоказателя, " ", "");
		
		Если СопоставлениеГрупп.Получить(КП) <> неопределено Тогда Продолжить; КонецЕсли;
		
		НДеко =  ЭтаФорма.Элементы.Добавить(КП, Тип("ГруппаФормы"), Элементы.Группа5ОперативнаяШкала);
		НДеко.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НДеко.Заголовок = Стр.КатегорияПоказателя;
		НДеко.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
		НДеко.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
		СопоставлениеГрупп.Вставить(КП, НДеко);
		
	КонецЦикла;
	
	Для каждого Стр из ТЗ_5_СписокПоказателей цикл
		
		ЗначениеПеречисления = Стр.НаименованиеПоказателя;
		ИмяПеречисления = ЗначениеПеречисления.Метаданные().Имя;
		ИндексЗначенияПеречисления = Перечисления[ИмяПеречисления].Индекс(ЗначениеПеречисления);
		ИмяЗначенияПеречисления = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;
		
		НДеко =  ЭтаФорма.Элементы.Добавить(ИмяЗначенияПеречисления, Тип("ДекорацияФормы"), СопоставлениеГрупп.Получить(СтрЗаменить(Стр.КатегорияПоказателя, " ", "")));
		НДеко.Вид = ВидДекорацииФормы.Надпись;
		НДеко.Заголовок = Строка(Стр.НаименованиеПоказателя) + ": " + ПолучитьЧисловоеЗначениеПоказателя(Стр.НаименованиеПоказателя, ПериодОтображенияПоказателей);
		НДеко.УстановитьДействие("Нажатие", "ОбработкаНажатияПоказателя");
		НДеко.Гиперссылка = Истина;
		НДеко.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.Выпуклая, 2);
		НДеко.ЦветТекста = WebЦвета.Синий;
		НДеко.Шрифт = Новый Шрифт("Arial", 12, Истина, Ложь);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЧисловоеЗначениеПоказателя(КодПоказателя, ПериодОтображения)
	
	РЕЗ = АРМ_Сервер.ПолучитьЗначениеПоказателя(КодПоказателя, Новый Структура("Контекст", ПериодОтображения));
	
	Возврат РЕЗ;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТаблицуКнопок5ПоПрофиль(АРМ)
	
	Результат = Новый Массив;
	
	Для каждого Стр из АРМ.СписокПоказателейАРМРуководителя Цикл
		Результат.Добавить(Новый Структура("КатегорияПоказателя,НаименованиеПоказателя,КодВызоваОтчета", Стр.КатегорияПоказателя, Стр.НаименованиеПоказателя, Стр.КодВызоваОтчета));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


&НаКлиенте
Процедура ОбработкаНажатияПоказателя(Элемент1 = неопределено, Элемент2 = неопределено) Экспорт
	
//	ОткрытьФорму("Отчет."+Элемент1.Имя+".Форма");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокОтчетов(АРМ)
	
	Результат = Новый Массив;
	
	Для каждого Стр из АРМ.СписокОтчетов Цикл
		Результат.Добавить(Новый Структура("НаименованиеОтчета, НаименованиеОтчетаВСистеме", Стр.НаименованиеОтчета, Стр.НаименованиеОтчетаВСистеме));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


&НаКлиенте
Процедура НастройкиАРМ(Команда)
	
	СсылкаНастройкиАРМ = ПолучитьСсылкуТекПользователя();
	Если СсылкаНастройкиАРМ.Количество() > 0 Тогда
		ПоказатьЗначение(, СсылкаНастройкиАРМ[0].АРМ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСсылкуТекПользователя()
	
	Результат = Новый Массив();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОтчетыВ_АРМах.Ссылка КАК Ссылка,
	               |	ОтчетыВ_АРМах.Пользователь КАК Пользователь
	               |ИЗ
	               |	Справочник.ОтчетыВ_АРМах КАК ОтчетыВ_АРМах
	               |ГДЕ
	               |	НЕ ОтчетыВ_АРМах.ПометкаУдаления
	               |	И (ОтчетыВ_АРМах.НаименованиеАРМаВСистеме = &НаименованиеАРМаВСистеме
	               |			ИЛИ ОтчетыВ_АРМах.Ссылка = &ПредопределенныйАРМРуководителя)
	               |	И (ОтчетыВ_АРМах.Пользователь = &ТекПользователь
	               |			ИЛИ ОтчетыВ_АРМах.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Пользователь УБЫВ";
	Запрос.УстановитьПараметр("ПредопределенныйАРМРуководителя", Справочники.ОтчетыВ_АРМах.АРМРуководителя);
	Запрос.УстановитьПараметр("НаименованиеАРМаВСистеме", "АРМ_Руководителя");
	Запрос.УстановитьПараметр("ТекПользователь", Пользователи.ТекущийПользователь());
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		Результат.Добавить(Новый Структура("АРМ, Пользователь", Ответ.Ссылка, Ответ.Пользователь));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ТЗ_1_ФильтрАктивностиПриИзменении(Элемент)
	
	Если ТЗ_1_ФильтрАктивности = 0 Тогда
		Элементы.ТЗ_1_ВходящиеЗадачи.ОтборСтрок = неопределено;
		Элементы.ТЗ_1_ИсходящиеЗадачи.ОтборСтрок = неопределено;
	ИначеЕсли ТЗ_1_ФильтрАктивности = 1 Тогда
		Элементы.ТЗ_1_ВходящиеЗадачи.ОтборСтрок = Новый ФиксированнаяСтруктура("Статус", ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.ВРаботе"));
		Элементы.ТЗ_1_ИсходящиеЗадачи.ОтборСтрок = Новый ФиксированнаяСтруктура("Статус", ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.ВРаботе"));
	ИначеЕсли ТЗ_1_ФильтрАктивности = 2 Тогда
		Элементы.ТЗ_1_ВходящиеЗадачи.ОтборСтрок = Новый ФиксированнаяСтруктура("Статус", ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен"));
		Элементы.ТЗ_1_ИсходящиеЗадачи.ОтборСтрок = Новый ФиксированнаяСтруктура("Статус", ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТЗ_6_ПоИсполнителюПриИзменении(Элемент)
	
	ФильтрСтруктура = неопределено;
	
	Если ЗначениеЗаполнено(ТЗ_6_ПоИсполнителю) И НЕ ЗначениеЗаполнено(ТЗ_6_ПоРегиону) И НЕ ЗначениеЗаполнено(ТЗ_6_КлассНарушения) Тогда
		ФильтрСтруктура = Новый ФиксированнаяСтруктура("Исполнитель", ТЗ_6_ПоИсполнителю);
	ИначеЕсли НЕ ЗначениеЗаполнено(ТЗ_6_ПоИсполнителю) И ЗначениеЗаполнено(ТЗ_6_ПоРегиону) И НЕ ЗначениеЗаполнено(ТЗ_6_КлассНарушения) Тогда
		ФильтрСтруктура = Новый ФиксированнаяСтруктура("Регион", ТЗ_6_ПоРегиону);
	ИначеЕсли НЕ ЗначениеЗаполнено(ТЗ_6_ПоИсполнителю) И НЕ ЗначениеЗаполнено(ТЗ_6_ПоРегиону) И ЗначениеЗаполнено(ТЗ_6_КлассНарушения) Тогда
		ФильтрСтруктура = Новый ФиксированнаяСтруктура("КлассНарушения", ТЗ_6_КлассНарушения);
		
	ИначеЕсли ЗначениеЗаполнено(ТЗ_6_ПоИсполнителю) И ЗначениеЗаполнено(ТЗ_6_ПоРегиону) И НЕ ЗначениеЗаполнено(ТЗ_6_КлассНарушения) Тогда
		ФильтрСтруктура = Новый ФиксированнаяСтруктура("Исполнитель,Регион", ТЗ_6_ПоИсполнителю, ТЗ_6_ПоРегиону);
	ИначеЕсли ЗначениеЗаполнено(ТЗ_6_ПоИсполнителю) И НЕ ЗначениеЗаполнено(ТЗ_6_ПоРегиону) И ЗначениеЗаполнено(ТЗ_6_КлассНарушения) Тогда
		ФильтрСтруктура = Новый ФиксированнаяСтруктура("Исполнитель,КлассНарушения", ТЗ_6_ПоИсполнителю, ТЗ_6_КлассНарушения);
	ИначеЕсли НЕ ЗначениеЗаполнено(ТЗ_6_ПоИсполнителю) И ЗначениеЗаполнено(ТЗ_6_ПоРегиону) И ЗначениеЗаполнено(ТЗ_6_КлассНарушения) Тогда
		ФильтрСтруктура = Новый ФиксированнаяСтруктура("Регион,КлассНарушения", ТЗ_6_ПоРегиону, ТЗ_6_КлассНарушения);
	ИначеЕсли ЗначениеЗаполнено(ТЗ_6_ПоИсполнителю) И ЗначениеЗаполнено(ТЗ_6_ПоРегиону) И ЗначениеЗаполнено(ТЗ_6_КлассНарушения) Тогда
		ФильтрСтруктура = Новый ФиксированнаяСтруктура("Исполнитель,Регион,КлассНарушения", ТЗ_6_ПоИсполнителю, ТЗ_6_ПоРегиону, ТЗ_6_КлассНарушения);
	КонецЕсли;
	
	Элементы.ТЗ_6_СписокПроблем.ОтборСтрок = ФильтрСтруктура;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТЗ_1_Контекст = пользователи.ТекущийПользователь();
	
КонецПроцедуры

&НаКлиенте
Процедура ДГВыбор(Элемент, Значения, СтандартнаяОбработка, Дата)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(Значения) = Тип("Массив") Тогда
		Для каждого Стр из Значения Цикл
			Если ЗначениеЗаполнено(Стр.Расшифровка) Тогда
				ПоказатьЗначение(, Стр.Расшифровка);
			КонецЕсли;
		КонецЦикла;
	Иначе
		ПоказатьЗначение(,Значения.Расшифровка);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ВыбратьСделкиОперации()
	
	ПоляВыбора = "";
	СвязиТаблиц = "";
	ИмяГруппировки = "";
	
	Если ВидГруппировки = 0 Тогда
		
		ПоляВыбора = "	ЕСТЬNULL(СделкаСтратегии.Стратегия, ""Нет стратегии"") КАК Стратегия,";
		СвязиТаблиц = " ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Стратегии КАК СделкаСтратегии
		|		ПО РСОперации.Сделка = СделкаСтратегии.Ссылка";
		ПолеИтогов = "	Стратегия,";
		ИмяГруппировки = "Стратегия";
		
	ИначеЕсли ВидГруппировки = 1 Тогда
		
		ПолеИтогов = "	Проект,";
		ИмяГруппировки = "Проект";
		
	ИначеЕсли ВидГруппировки = 2 Тогда
		
		ПолеИтогов = "	Маршрут,";
		ИмяГруппировки = "Маршрут";
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОперацииВСделках.Операция КАК Операция,
		|	ОперацииВСделках.Сделка КАК Сделка,
		|	ОперацииВСделках.ДатаОтправленияФакт КАК ДатаОтправленияФакт,
		|	ОперацииВСделках.ДатаНазначенияФакт КАК ДатаНазначенияФакт,
		|	ОперацииВСделках.ДатаОтправления КАК ДатаОтправления,
		|	ОперацииВСделках.ДатаНазначения КАК ДатаНазначения
		|ПОМЕСТИТЬ РСОперации
		|ИЗ
		|	РегистрСведений.ОперацииВСделках КАК ОперацииВСделках
		|ГДЕ
		|	ОперацииВСделках.Операция.Дата МЕЖДУ &ДатаНач и &ДатаКон И НЕ ОперацииВСделках.Операция.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РСОперации.Сделка КАК ПредметТСх,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(РСОперации.Сделка.СтанцияОтправления.Наименование + "" -> "" + РСОперации.Сделка.СтанцияНазначения.Наименование КАК СТРОКА(250)), ""Нет маршрута"") КАК Маршрут,
		|	РСОперации.Операция КАК Операция,
		|	ТехнологическаяСхемаТЧ.ГУИД КАК ГУИД,
		|	ВЫБОР
		|		КОГДА ТехнологическаяСхемаТЧ.Родитель1 = """"
		|			ТОГДА РСОперации.Сделка
		|		ИНАЧЕ ТехнологическаяСхемаТЧ.Родитель1
		|	КОНЕЦ КАК Родитель1,
		|	ТехнологическаяСхемаТЧ.Родитель2 КАК Родитель2,
		|	ТехнологическаяСхемаТЧ.Родитель3 КАК Родитель3,
		|	ТехнологическаяСхемаТЧ.Родитель4 КАК Родитель4,
		|	ТехнологическаяСхемаТЧ.Родитель5 КАК Родитель5,
		|	ТехнологическаяСхемаТЧ.НомерСтроки КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА РСОперации.ДатаОтправленияФакт = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РСОперации.ДатаОтправления
		|		ИНАЧЕ РСОперации.ДатаОтправленияФакт
		|	КОНЕЦ КАК ДатаОтправления,
		|	ВЫБОР
		|		КОГДА РСОперации.ДатаНазначенияФакт = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РСОперации.ДатаНазначения
		|		ИНАЧЕ РСОперации.ДатаНазначенияФакт
		|	КОНЕЦ КАК ДатаНазначения,
		|	ВЫБОР
		|		КОГДА РСОперации.ДатаОтправленияФакт > РСОперации.ДатаОтправления
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОтправлениеСОпазданием,
		|	ВЫБОР
		|		КОГДА РСОперации.ДатаНазначенияФакт > РСОперации.ДатаНазначения
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПрибытиеСОпазданием,
		|	ТехнологическаяСхемаТЧ.Ссылка КАК ТСх,
		| " + ПоляВыбора + "
		|	ВЫБОР КОГДА РСОперации.Сделка.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка) ТОГДА ""Нет проекта"" ИНАЧЕ РСОперации.Сделка.Проект КОНЕЦ КАК Проект
		|ИЗ
		|	РСОперации КАК РСОперации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
		|		ПО РСОперации.Операция = ТехнологическаяСхемаТЧ.Операция
		|		"+ СвязиТаблиц +"
		|УПОРЯДОЧИТЬ ПО
//		|"+ ПолеИтогов +"
		|	ПредметТСх,
		|	НомерСтроки
		|ИТОГИ ПО
		|"+ ПолеИтогов +"
		|	ПредметТСх
		|	";
	
	
	
	
	Запрос.УстановитьПараметр("ДатаНач", ПериодОтображенияДГ.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", ПериодОтображенияДГ.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДГ.Обновление = Ложь;
	ДГ.Очистить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	ТЗ.Колонки.Добавить("ГУИДСтроки");
	
	ОписаниеКол = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(1));
	ТЗ.Колонки.Добавить("СозданоТочек",ОписаниеКол);
	
	// группировка выбранная пользователем. СТРАТЕГИЯ, ПРОЕКТ или МАРШУТ
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		ИдентификаторГруппировки = Новый УникальныйИдентификатор();
		
		ТекГруппировка = Выборка[ИмяГруппировки];
		ТочкаГрупп = ДГ.УстановитьТочку(Строка(ТекГруппировка)+Строка(ИдентификаторГруппировки));
		ТочкаГрупп.Текст = Строка(ТекГруппировка);
		ТочкаГрупп.Расшифровка = ТекГруппировка;
		ПоказательЦвета = ДГ.УстановитьСерию("");
		ПродЗначениеГрупп = ДГ.ПолучитьЗначение(ТочкаГрупп, ПоказательЦвета);
		
		// группировка по СДЕЛКАМ
		ВыборкаСделка = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСделка.Следующий() Цикл
			ИдентификаторСделки = Новый УникальныйИдентификатор();
			
			ТочкаСделки = ДГ.УстановитьТочку(Строка(ВыборкаСделка.ПредметТСх) + Строка(ИдентификаторСделки),Строка(ТекГруппировка)+Строка(ИдентификаторГруппировки));
			ТочкаСделки.Текст = Строка(ВыборкаСделка.ПредметТСх);
			ТочкаСделки.Расшифровка = ВыборкаСделка.ПредметТСх;
			
			ПродЗначениеСделки = ДГ.ПолучитьЗначение(ТочкаСделки, ПоказательЦвета);
			
			// детальные записи
			ВыборкаДетали = ВыборкаСделка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаДетали.Следующий() Цикл
				
				Если ВыборкаДетали.Операция <> Null И Не ВыборкаДетали.Операция.Пустая() Тогда
					
					// присвоить операции ГУИД уникальный в рамках данного запроса
					ПараметрыОтбора = Новый Структура;
					ПараметрыОтбора.Вставить("Операция",ВыборкаДетали.Операция);
					ПараметрыОтбора.Вставить("ПредметТСх",ВыборкаСделка.ПредметТСх);
					ПараметрыОтбора.Вставить(ИмяГруппировки,ТекГруппировка);
					
					НайденныеСтроки = ТЗ.НайтиСтроки(ПараметрыОтбора);
					Если НайденныеСтроки.Количество()>0 Тогда
						Если НЕ ЗначениеЗаполнено(НайденныеСтроки[0].ГУИДСтроки) Тогда
							ИдентификаторОперации = Новый УникальныйИдентификатор();
							НайденныеСтроки[0].ГУИДСтроки = ИдентификаторОперации;
						Иначе
							ИдентификаторОперации = НайденныеСтроки[0].ГУИДСтроки;
						КонецЕсли;
					КонецЕсли;
					
					// цикл по всем родителям узла
					Для i=1 По i<6 Цикл
						
						ТекИндексРод = ВыборкаДетали["Родитель" + Строка(i)];
						Если ТипЗнч(ТекИндексРод) = Тип("ДокументСсылка.Сделка") Тогда
							ТекРодитель = ТочкаСделки.Значение;
						КонецЕсли;
						Если ТипЗнч(ТекИндексРод) = Тип("Строка") И ЗначениеЗаполнено(ТекИндексРод) Тогда
							ПараметрыОтбора = Новый Структура;
							ПараметрыОтбора.Вставить("ГУИД",ТекИндексРод);
							ПараметрыОтбора.Вставить("ПредметТСх",ВыборкаСделка.ПредметТСх);
							ПараметрыОтбора.Вставить(ИмяГруппировки,ТекГруппировка);
							
							НайденныеСтроки = ТЗ.НайтиСтроки(ПараметрыОтбора);
							Если НайденныеСтроки.Количество()>0 Тогда
								Если НЕ ЗначениеЗаполнено(НайденныеСтроки[0].ГУИДСтроки) Тогда
									ГУИДСтрокиРодителя = Новый УникальныйИдентификатор();
									НайденныеСтроки[0].ГУИДСтроки = ГУИДСтрокиРодителя;
								Иначе
									ГУИДСтрокиРодителя = НайденныеСтроки[0].ГУИДСтроки;
								КонецЕсли;
								ТекРодитель = Строка(НайденныеСтроки[0].Операция) + ГУИДСтрокиРодителя;
							КонецЕсли;
						КонецЕсли;
						
						ДтНач = ?(ЗначениеЗаполнено(ВыборкаДетали.ДатаОтправления),НачалоДня(ВыборкаДетали.ДатаОтправления),ТекущаяДата()-3*24*3600);
						ДтКон = ?(ЗначениеЗаполнено(ВыборкаДетали.ДатаНазначения),НачалоДня(ВыборкаДетали.ДатаНазначения),ТекущаяДата()+7*24*3600);
						
						Точка = ДГ.УстановитьТочку(Строка(ВыборкаДетали.Операция) + Строка(ИдентификаторОперации),ТекРодитель);
						Точка.Текст = Строка(ВыборкаДетали.Операция);
						Точка.Расшифровка = ВыборкаДетали.Операция;
						
						ПродЗначение = ДГ.ПолучитьЗначение(Точка, ПоказательЦвета);
						ПериодХ = ПродЗначение.Добавить();
						// Цвет показателей в зависимости от просрочки
						Если ВыборкаДетали.ОтправлениеСОпазданием И ВыборкаДетали.ПрибытиеСОпазданием Тогда
							ЦветДГ = WebЦвета.Красный;
						ИначеЕсли НЕ ВыборкаДетали.ОтправлениеСОпазданием И НЕ ВыборкаДетали.ПрибытиеСОпазданием Тогда
							ЦветДГ = WebЦвета.Зеленый;
						Иначе
							ЦветДГ = WebЦвета.Оранжевый;
						КонецЕсли;
						ПериодХ.Цвет = ЦветДГ;
						ПериодХ.Начало = ДтНач;
						ПериодХ.Конец = ДтКон;
						ПериодХ.Расшифровка = ВыборкаДетали.Операция;
						
						//////////// даты и цвета по сделкам
						ПериодСд = ПродЗначениеСделки.Добавить();
						ПериодСд.Цвет = ЦветДГ;
						ПериодСд.Начало = ДтНач;
						ПериодСд.Конец = ДтКон;
						ПериодСд.Расшифровка = ВыборкаДетали.Операция;
						
						//////////// даты и цвета по верхней группировке
						ПериодГрупп = ПродЗначениеГрупп.Добавить();
						ПериодГрупп.Цвет = ЦветДГ;
						ПериодГрупп.Начало = ДтНач;
						ПериодГрупп.Конец = ДтКон;
						ПериодГрупп.Расшифровка = ВыборкаДетали.Операция;
							
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ДГ.Обновление = Истина;		
	
КонецПроцедуры

&НаСервере
Процедура ВыбратьСписокПроблем()
	
	//!!!! Внимание! Данный код скопирован в общий модуль Пользователи_sd_сервер. Если будете что-то менять, поменяйте, пожалуйста, и там!
	
	СписокРазрешенныхСтатусов = Новый Массив;
	СписокРазрешенныхСтатусов.Добавить(Перечисления.СтатусыЭтапов.НаВыполнение);
	СписокРазрешенныхСтатусов.Добавить(Перечисления.СтатусыЭтапов.ВРаботе);
	
	// Только операции
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОперацииВСделках.Операция КАК Операция,
	               |	ОперацииВСделках.Исполнитель КАК Исполнитель,
	               |	ОперацииВСделках.Наблюдатель КАК Наблюдатель,
	               |	ВЫБОР
	               |		КОГДА ОперацииВСделках.ДатаОтправленияФакт > ОперацииВСделках.ДатаОтправления
	               |				ИЛИ ОперацииВСделках.ДатаНазначенияФакт > ОперацииВСделках.ДатаНазначения
	               |				ИЛИ ОперацииВСделках.ДатаОтправленияФакт = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |					И ОперацииВСделках.ДатаНазначения < &ТекущаяДата
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.КлассНарушенияАРМРуководителя.НарушениеСрока)
	               |	КОНЕЦ КАК КлассНарушения,
	               |	ВЫБОР
	               |		КОГДА ОперацииВСделках.ДатаОтправленияФакт > ОперацииВСделках.ДатаОтправления
	               |			ТОГДА РАЗНОСТЬДАТ(ОперацииВСделках.ДатаОтправления, ОперацииВСделках.ДатаОтправленияФакт, ДЕНЬ)
	               |		КОГДА ОперацииВСделках.ДатаНазначенияФакт > ОперацииВСделках.ДатаНазначения
	               |			ТОГДА РАЗНОСТЬДАТ(ОперацииВСделках.ДатаНазначения, ОперацииВСделках.ДатаНазначенияФакт, ДЕНЬ)
	               |		КОГДА ОперацииВСделках.ДатаОтправленияФакт = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |				И ОперацииВСделках.ДатаНазначения < &ТекущаяДата
	               |			ТОГДА РАЗНОСТЬДАТ(ОперацииВСделках.ДатаОтправления, &ТекущаяДата, ДЕНЬ)
	               |	КОНЕЦ КАК МераОтклонения,
	               |	ОперацииВСделках.Статус КАК Статус
	               |ПОМЕСТИТЬ Операции
	               |ИЗ
	               |	РегистрСведений.ОперацииВСделках КАК ОперацииВСделках
	               |ГДЕ
	               |	(НАЧАЛОПЕРИОДА(ОперацииВСделках.ДатаОтправленияФакт, ДЕНЬ) > НАЧАЛОПЕРИОДА(ОперацииВСделках.ДатаОтправления, ДЕНЬ)
	               |			ИЛИ НАЧАЛОПЕРИОДА(ОперацииВСделках.ДатаНазначенияФакт, ДЕНЬ) > НАЧАЛОПЕРИОДА(ОперацииВСделках.ДатаНазначения, ДЕНЬ)
	               |			ИЛИ ОперацииВСделках.ДатаОтправленияФакт = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |				И ОперацииВСделках.ДатаНазначения < &ТекущаяДата)
	               |	И ОперацииВСделках.Операция.Дата >= &Дата
	               |	И НЕ ОперацииВСделках.Операция.ПометкаУдаления
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ОперацииВСделках.Операция,
	               |	ОперацииВСделках.Исполнитель,
	               |	ОперацииВСделках.Наблюдатель,
	               |	ВЫБОР
	               |		КОГДА ОперацииВСделках.СебестоимостьФакт > ОперацииВСделках.Себестоимость
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.КлассНарушенияАРМРуководителя.ОтклонениеЦены)
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ОперацииВСделках.СебестоимостьФакт > ОперацииВСделках.Себестоимость
	               |			ТОГДА ОперацииВСделках.Себестоимость - ОперацииВСделках.СебестоимостьФакт
	               |	КОНЕЦ,
	               |	ОперацииВСделках.Статус
	               |ИЗ
	               |	РегистрСведений.ОперацииВСделках КАК ОперацииВСделках
	               |ГДЕ
	               |	ОперацииВСделках.СебестоимостьФакт > ОперацииВСделках.Себестоимость
	               |	И ОперацииВСделках.Операция.Дата > &Дата
	               |	И НЕ ОперацииВСделках.Операция.ПометкаУдаления
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ОперацииВСделках.Операция,
	               |	ОперацииВСделках.Исполнитель,
	               |	ОперацииВСделках.Наблюдатель,
	               |	ВЫБОР
	               |		КОГДА ОперацииВСделках.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтапов.Отклонен)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.КлассНарушенияАРМРуководителя.ОтказИсполнения)
	               |	КОНЕЦ,
	               |	NULL,
	               |	ОперацииВСделках.Статус
	               |ИЗ
	               |	РегистрСведений.ОперацииВСделках КАК ОперацииВСделках
	               |ГДЕ
	               |	ОперацииВСделках.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтапов.Отклонен)
	               |	И ОперацииВСделках.Операция.Дата > &Дата
	               |	И НЕ ОперацииВСделках.Операция.ПометкаУдаления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ОперацияГрузы.ТС) КАК ТС,
	               |	ОперацияГрузы.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ТСОперации
	               |ИЗ
	               |	Операции КАК Операции
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Операция.Грузы КАК ОперацияГрузы
	               |		ПО Операции.Операция = ОперацияГрузы.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОперацияГрузы.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДислокацияВагоновСрезПоследних.СтанцияОперации КАК СтанцияОперации,
	               |	ДислокацияВагоновСрезПоследних.Вагон КАК Вагон
	               |ПОМЕСТИТЬ ДислокацияВагона
	               |ИЗ
	               |	РегистрСведений.ДислокацияВагонов.СрезПоследних(
	               |			,
	               |			Вагон В
	               |				(ВЫБРАТЬ
	               |					ТСОперации.ТС
	               |				ИЗ
	               |					ТСОперации КАК ТСОперации)) КАК ДислокацияВагоновСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Операции.Исполнитель КАК Исполнитель,
	               |	Операции.Наблюдатель КАК Наблюдатель,
	               |	Операции.Операция КАК Операция,
	               |	ДислокацияВагона.СтанцияОперации КАК Регион,
	               |	Операции.КлассНарушения КАК КлассНарушения,
	               |	Операции.МераОтклонения КАК МераОтклонения,
	               |	Операции.Операция.ДатаОтправления КАК ДатаОтправления,
	               |	Операции.Операция.ДатаНазначения КАК ДатаНазначения,
	               |	Операции.Статус КАК Статус
	               |ИЗ
	               |	Операции КАК Операции
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТСОперации КАК ТСОперации
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ДислокацияВагона КАК ДислокацияВагона
	               |			ПО ТСОперации.ТС = ДислокацияВагона.Вагон
	               |		ПО Операции.Операция = ТСОперации.Ссылка
	               |ГДЕ
	               |	НЕ Операции.Операция.ПометкаУдаления
	               |	И Операции.Статус В(&СписокРазрешенныхСтатусов)";
	
	Запрос.УстановитьПараметр("Дата",НачалоДня(ТекущаяДата()-10*24*3600));
	Запрос.УстановитьПараметр("СписокРазрешенныхСтатусов",СписокРазрешенныхСтатусов);
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	РезультатЗапроса = Запрос.Выполнить();
	ТЗ = РезультатЗапроса.Выгрузить();
	
	ТЗ_6_СписокПроблем.Очистить();
	
	Для Каждого Стр Из ТЗ Цикл
		Если Строка(Стр.Исполнитель) = "<Не указан>" ИЛИ НЕ ЗначениеЗаполнено(Стр.Операция) Тогда Продолжить; КонецЕсли;
		НоваяСтр = ТЗ_6_СписокПроблем.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтр,Стр);
	КонецЦикла;
	
	// Добавить все документы, кроме операций, у которых есть ТЧ Состояния
	ЗаполнениеТаблицыОбъектов();

	Для Каждого Стр Из ТЗОбъектовСостояния Цикл
		
		Запрос = Новый Запрос;
		
		Если Стр.ОбъектСостояние = "Операция" Тогда
			
			Продолжить;

		КонецЕсли;
		
		// расчет норматива исполнения. если расчет для объектов НЕ Проект И НЕ Сделка то стандартный расчет, т.к. в 
		// тч Состояния есть НормативИсполненияСМоментаСоздания
		Если Стр.ОбъектСостояние = "РейсыЖД" Тогда
			ДтОтпр = "ТЧСостояния.НачалоРаботы";
			ДтНазн = "ДОБАВИТЬКДАТЕ(ТЧСостояния.НачалоРаботы, ЧАС, ТЧСостояния.НормативИсполненияСМоментаСоздания)";
			МераОтклДата1 = "ДОБАВИТЬКДАТЕ(ТЧСостояния.НачалоРаботы, ЧАС, ТЧСостояния.НормативИсполненияСМоментаСоздания)";
		ИначеЕсли Стр.ОбъектСостояние = "Проекты" Тогда
			ДтОтпр = "ТЧСостояния.Ссылка.Дата";
			ДтНазн = "(ВЫБОР КОГДА ТЧСостояния.ВидНормативаИсполнения = ЗНАЧЕНИЕ(Перечисление.ВидыНормативовИспользования.За2ЧасаДоДедлайнаПроекта) ТОГДА ДОБАВИТЬКДАТЕ(ТЧСостояния.Ссылка.КонтрольныйСрок, ЧАС,-2) КОГДА ТЧСостояния.ВидНормативаИсполнения = ЗНАЧЕНИЕ(Перечисление.ВидыНормативовИспользования.Через2ЧасаПослеДедлайна) ТОГДА ДОБАВИТЬКДАТЕ(ТЧСостояния.Ссылка.КонтрольныйСрок, ЧАС,2) КОГДА ТЧСостояния.ВидНормативаИсполнения = ЗНАЧЕНИЕ(Перечисление.ВидыНормативовИспользования.ДедлайнПроекта) ТОГДА ТЧСостояния.Ссылка.КонтрольныйСрок КОНЕЦ)";
			МераОтклДата1 = "(ВЫБОР КОГДА ТЧСостояния.ВидНормативаИсполнения = ЗНАЧЕНИЕ(Перечисление.ВидыНормативовИспользования.За2ЧасаДоДедлайнаПроекта) ТОГДА ДОБАВИТЬКДАТЕ(ТЧСостояния.Ссылка.КонтрольныйСрок, ЧАС,-2)  КОГДА ТЧСостояния.ВидНормативаИсполнения = ЗНАЧЕНИЕ(Перечисление.ВидыНормативовИспользования.Через2ЧасаПослеДедлайна) ТОГДА ДОБАВИТЬКДАТЕ(ТЧСостояния.Ссылка.КонтрольныйСрок, ЧАС,2) КОГДА ТЧСостояния.ВидНормативаИсполнения = ЗНАЧЕНИЕ(Перечисление.ВидыНормативовИспользования.ДедлайнПроекта) ТОГДА ТЧСостояния.Ссылка.КонтрольныйСрок КОНЕЦ)";
		ИначеЕсли Стр.ОбъектСостояние = "Сделка" Тогда
			ДтОтпр = "ТЧСостояния.Ссылка.Дата";
			ДтНазн = "(ВЫБОР КОГДА ТЧСостояния.ВидНормативаИсполнения = ЗНАЧЕНИЕ(Перечисление.ВидыНормативовИспользования.ПервыйРДмесяцаПослеОкончанияПеревозки) ТОГДА ДОБАВИТЬКДАТЕ(ТЧСостояния.Ссылка.ДатаПрибытияРейса, ЧАС,ТЧСостояния.НормативИсполненияСМоментаСоздания) КОГДА ТЧСостояния.ВидНормативаИсполнения = ЗНАЧЕНИЕ(Перечисление.ВидыНормативовИспользования.ДатаОкончанияТСх) ТОГДА ТЧСостояния.Ссылка.ДатаПрибытияОтправки КОГДА ТЧСостояния.ВидНормативаИсполнения = ЗНАЧЕНИЕ(Перечисление.ВидыНормативовИспользования.ДатаОкончанияТСх72) ТОГДА ДОБАВИТЬКДАТЕ(ТЧСостояния.Ссылка.ДатаПрибытияОтправки,ЧАС,72) ИНАЧЕ ДОБАВИТЬКДАТЕ(ТЧСостояния.Ссылка.Дата, ЧАС, ТЧСостояния.НормативИсполненияСМоментаСоздания) КОНЕЦ)";
			МераОтклДата1 = "(ВЫБОР КОГДА ТЧСостояния.ВидНормативаИсполнения = ЗНАЧЕНИЕ(Перечисление.ВидыНормативовИспользования.ПервыйРДмесяцаПослеОкончанияПеревозки) ТОГДА ДОБАВИТЬКДАТЕ(ТЧСостояния.Ссылка.ДатаПрибытияРейса, ЧАС,ТЧСостояния.НормативИсполненияСМоментаСоздания) КОГДА ТЧСостояния.ВидНормативаИсполнения = ЗНАЧЕНИЕ(Перечисление.ВидыНормативовИспользования.ДатаОкончанияТСх) ТОГДА ТЧСостояния.Ссылка.ДатаПрибытияОтправки КОГДА ТЧСостояния.ВидНормативаИсполнения = ЗНАЧЕНИЕ(Перечисление.ВидыНормативовИспользования.ДатаОкончанияТСх72) ТОГДА ДОБАВИТЬКДАТЕ(ТЧСостояния.Ссылка.ДатаПрибытияОтправки,ЧАС,72) ИНАЧЕ ДОБАВИТЬКДАТЕ(ТЧСостояния.Ссылка.Дата, ЧАС, ТЧСостояния.НормативИсполненияСМоментаСоздания) КОНЕЦ)";
		Иначе
			ДтОтпр = "ТЧСостояния.Ссылка.Дата";
			ДтНазн = "ДОБАВИТЬКДАТЕ(ТЧСостояния.Ссылка.Дата, ЧАС, ТЧСостояния.НормативИсполненияСМоментаСоздания)";
			МераОтклДата1 = "ДОБАВИТЬКДАТЕ(ТЧСостояния.Ссылка.Дата, ЧАС, ТЧСостояния.НормативИсполненияСМоментаСоздания)";
		КонецЕсли;
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТЧСостояния.Ссылка КАК Операция,
					   |	" + ДтОтпр + " КАК ДатаОтправления,
					   |	" + ДтНазн + " КАК ДатаНазначения,
					   |	ТЧСостояния.Исполнитель КАК Исполнитель,
					   |	ЗНАЧЕНИЕ(Перечисление.КлассНарушенияАРМРуководителя.НарушениеСрока) КАК КлассНарушения,
					   |	РАЗНОСТЬДАТ(" + МераОтклДата1 + ", &ТекущаяДата, ЧАС)  КАК МераОтклонения
		               |ИЗ
		               |	 " + Строка(Стр.ТипМетаданных) + Строка(Стр.ОбъектСостояние) + ".Состояния КАК ТЧСостояния
		               |ГДЕ
		               |	ТЧСостояния.Статус В (&СписокРазрешенныхСтатусов) И ТЧСостояния.Ссылка.ПометкаУдаления <> ИСТИНА
					   |	И РАЗНОСТЬДАТ(" + ДтНазн + ", &ТекущаяДата, ЧАС)>0";

		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
		Запрос.УстановитьПараметр("СписокРазрешенныхСтатусов", СписокРазрешенныхСтатусов);
		Попытка
			Результат = Запрос.Выполнить().Выгрузить();
			Для каждого Рез Из Результат Цикл
				
				Если Строка(Рез.Исполнитель) = "<Не указан>" Тогда Продолжить; КонецЕсли;
				
				НоваяСтр = ТЗ_6_СписокПроблем.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтр,Рез);
				
			КонецЦикла;
		Исключение
			НетДатыУДокументов = Строка(Стр.ТипМетаданных) + Строка(Стр.ОбъектСостояние);
		КонецПопытки;
		                                                        
	КонецЦикла;
	
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеТаблицыОбъектов()
	
	ТЗОбъектовСостояния.Очистить();
	
	Для Каждого ЭлемСпр Из Метаданные.Справочники Цикл
		Если ЭлемСпр.ТабличныеЧасти.Найти("Состояния") = неопределено ИЛИ ЭлемСпр.ТабличныеЧасти.Состояния.Реквизиты.Найти("Статус") = неопределено Тогда СостоянияЭлементов = ""; Продолжить; КонецЕсли;
		
		Попытка
			СостоянияЭлементов = ЭлемСпр.ТабличныеЧасти.Состояния;
			ЕстьСтатус = СостоянияЭлементов.Реквизиты.Статус;
			ТекСтр = ТЗОбъектовСостояния.Добавить();
			ТекСтр.ОбъектСостояние = ЭлемСпр.Имя;
			ТекСтр.ТипМетаданных = "Справочник.";
		Исключение
			СостоянияЭлементов = "";
		КонецПопытки;
	КонецЦикла;
			
	Для Каждого ЭлемДок Из Метаданные.Документы Цикл
		Если ЭлемДок.ТабличныеЧасти.Найти("Состояния") = неопределено ИЛИ ЭлемДок.ТабличныеЧасти.Состояния.Реквизиты.Найти("Статус") = неопределено  Тогда СостоянияЭлементов = ""; Продолжить; КонецЕсли;
		
		Попытка
			СостоянияЭлементов = ЭлемДок.ТабличныеЧасти.Состояния;
			ЕстьСтатус = СостоянияЭлементов.Реквизиты.Статус;
			ТекСтр = ТЗОбъектовСостояния.Добавить();
			ТекСтр.ОбъектСостояние = ЭлемДок.Имя;
			ТекСтр.ТипМетаданных = "Документ.";
		Исключение
			СостоянияЭлементов = "";
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПериодОтображенияДГ.ДатаНачала = ТекущаяДата()-14*24*3600;
	ПериодОтображенияДГ.ДатаОкончания = ТекущаяДата()+14*24*3600;
	
	ПериодОтображенияПоказателей.ДатаНачала = ТекущаяДата()-14*24*3600;
	ПериодОтображенияПоказателей.ДатаОкончания = ТекущаяДата()+14*24*3600;
	
	ОбновитьПоказатели();	

КонецПроцедуры

&НаКлиенте
Процедура ПериодОтображенияДГПриИзменении(Элемент)
	
	ВыбратьСделкиОперации();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидГруппировкиПриИзменении(Элемент)
	
	ВыбратьСделкиОперации();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОтображенияПоказателейПриИзменении(Элемент)
	ДобавитьЭлементыНаСервере();
КонецПроцедуры
