
&НаКлиенте
Процедура ОтключениеСтопЛистаПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключениеСтопЛистаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	Если НЕ Копирование Тогда 
		
		НСтр = Объект.ОтключениеСтопЛиста.Добавить();
		НСтр.ответственный = ПользователиКлиент.ТекущийПользователь();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключениеСтопЛистаПриИзменении(Элемент)
	
	ТекД = Элементы.ОтключениеСтопЛиста.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		ТекД.Изменено = Текущаядата();
		ТекД.Ответственный = ПользователиКлиент.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

