

&НаКлиенте
Процедура КомандаОК(Команда)
	
	// ДИТ Поморцева Т.П. Задача 0247069 21.10.2021. начало
	//СтруктураРезультат = Новый Структура("ГлавныйБухгалтер, Руководитель, ЗаРуководителяНаОсновании,
	//									| ЗаГлавногоБухгалтераНаОсновании, ДоверенностьЗаРуководителя, ДоверенностьЗаГлБухгалтера");
	СтруктураРезультат = Новый Структура("ГлавныйБухгалтер, Руководитель, ЗаРуководителяНаОсновании,
										| ЗаГлавногоБухгалтераНаОсновании, ДоверенностьЗаРуководителя, ДоверенностьЗаГлБухгалтера,
										| ДоверенностьЗаКладовщика, ДоверенностьЗаОформление");
	// ДИТ Поморцева Т.П. Задача 0247069 21.10.2021. конец

	ЗаполнитьЗначенияСвойств(СтруктураРезультат, ЭтотОбъект);
	ОповеститьОВыборе(СтруктураРезультат);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ГлавныйБухгалтер") ТОгда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "ГлавныйБухгалтер, Руководитель, ЗаРуководителяНаОсновании,
										| ЗаГлавногоБухгалтераНаОсновании, ДоверенностьЗаРуководителя, ДоверенностьЗаГлБухгалтера");
				
		ДоверенностьЗаГлБухгалтераПриИзмененииНаСервере();	
		ДоверенностьЗаРуководителяПриИзмененииНаСервере();
	КонецЕсли;
	
	//Евросиб Коханенко Н.А. #64811 27.01.2023 (( 
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #64811 27.01.2023 )) 
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #64811 27.01.2023 (( 
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры 
//Евросиб Коханенко Н.А. #64811 27.01.2023 )) 

&НаКлиенте
Процедура НеИспользовать(Команда)
	ОповеститьОВыборе(Неопределено);
КонецПроцедуры


&НаКлиенте
Процедура БезФаксимиле(Команда)
	// ДИТ Поморцева Т.П. Задача 0247069 21.10.2021. начало
	//СтруктураРезультат = Новый Структура("ГлавныйБухгалтер,Руководитель,ЗаРуководителяНаОсновании,ЗаГлавногоБухгалтераНаОсновании,ДоверенностьЗаРуководителя,ДоверенностьЗаГлБухгалтера,БезФаксимиле");
	СтруктураРезультат = Новый Структура("ГлавныйБухгалтер,Руководитель,ЗаРуководителяНаОсновании,ЗаГлавногоБухгалтераНаОсновании,ДоверенностьЗаРуководителя,ДоверенностьЗаГлБухгалтера,БезФаксимиле,ДоверенностьЗаКладовщика,ДоверенностьЗаОформление");
	// ДИТ Поморцева Т.П. Задача 0247069 21.10.2021. конец
	ЗаполнитьЗначенияСвойств(СтруктураРезультат, ЭтотОбъект);
	ОповеститьОВыборе(СтруктураРезультат);
КонецПроцедуры


&НаСервере
Процедура ДоверенностьЗаГлБухгалтераПриИзмененииНаСервере()
ЗаГлавногоБухгалтераНаОсновании=ДоверенностьЗаГлБухгалтера.ОснованиеДляПодписанияРП;	
	
КонецПроцедуры


&НаКлиенте
Процедура ДоверенностьЗаГлБухгалтераПриИзменении(Элемент)
	ДоверенностьЗаГлБухгалтераПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ДоверенностьЗаРуководителяПриИзмененииНаСервере()
	
ЗаРуководителяНаОсновании=ДоверенностьЗаРуководителя.ОснованиеДляПодписанияРП;	
	
КонецПроцедуры


&НаКлиенте
Процедура ДоверенностьЗаРуководителяПриИзменении(Элемент)
	ДоверенностьЗаРуководителяПриИзмененииНаСервере();
КонецПроцедуры

// ДИТ Поморцева Т.П. Задача 0247069 21.10.2021. начало
&НаСервере
Процедура ДоверенностьЗаКладовщикаПриИзмененииНаСервере()
	ЗаКладовщикаНаОсновании=ДоверенностьЗаКладовщика.ОснованиеДляПодписанияРП;
КонецПроцедуры

&НаКлиенте
Процедура ДоверенностьЗаКладовщикаПриИзменении(Элемент)
	ДоверенностьЗаКладовщикаПриИзмененииНаСервере();
КонецПроцедуры
// ДИТ Поморцева Т.П. Задача 0247069 21.10.2021. конец