
&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьДанныеНаСервере(Параметры);
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаполнитьДанныеНаСервере(ИндексСтроки)
	
	МассивСтруктур = ПолучитьИзВременногоХранилища(АдресМассиваСтруктур);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДислокацияВагоновСрезПоследних.Вагон КАК НомерВагона,
	//Евросиб Каблов 12.10.2020
	//|	ДислокацияВагоновСрезПоследних.ИндексПоезда КАК НомерЖДРейса,
	|	МАКСИМУМ(ДислокацияВагоновСрезПоследних.СтанцияНазначения) КАК СтанцияНазначения,
	|	МАКСИМУМ(ДислокацияВагоновСрезПоследних.СтанцияОтправления) КАК СтанцияОтправления,
	|	МИНИМУМ(ДислокацияВагоновСрезПоследних.ДатаОтправленияСоСтанции) КАК ДатаОтправления,
	|	МАКСИМУМ(ДислокацияВагоновСрезПоследних.ДатаПрибытияНаСтанцию) КАК ДатаПрибытия,
	|	МИНИМУМ(ДислокацияВагоновСрезПоследних.Период) КАК Период
	|ПОМЕСТИТЬ Врем_Рейсы
	|ИЗ
	|	РегистрСведений.ДислокацияВагонов КАК ДислокацияВагоновСрезПоследних
	|ГДЕ
	|	ДислокацияВагоновСрезПоследних.Вагон В(&НомерВагона)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДислокацияВагоновСрезПоследних.Вагон
	//Евросиб Каблов 12.10.2020
	//|	ДислокацияВагоновСрезПоследних.ИндексПоезда
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Врем_Рейсы.НомерВагона КАК НомерВагона,
	//Евросиб Каблов 12.10.2020
	//|	Врем_Рейсы.НомерЖДРейса КАК НомерЖДРейса,
	|	Врем_Рейсы.СтанцияНазначения КАК СтанцияНазначения,
	|	ВЫБОР
	|		КОГДА Врем_Рейсы.СтанцияОтправления = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|			ТОГДА ВложенныйЗапрос.СтанцияОперации
	|		ИНАЧЕ Врем_Рейсы.СтанцияОтправления
	|	КОНЕЦ КАК СтанцияОтправления,
	|	ВЫБОР
	|		КОГДА Врем_Рейсы.ДатаОтправления = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Врем_Рейсы.Период
	|		ИНАЧЕ Врем_Рейсы.ДатаОтправления
	|	КОНЕЦ КАК ДатаОтправления,
	|	Врем_Рейсы.ДатаПрибытия КАК ДатаПрибытия,
	|	э_НакладнаяВагоны.Ссылка.Дата КАК ДатаНакладной,
	|	э_НакладнаяВагоны.Ссылка КАК Накл,
	|	НАЧАЛОПЕРИОДА(э_НакладнаяВагоны.Ссылка.ДатаИВремяОтправленияГруза, ДЕНЬ) КАК Поле1,
	|	НАЧАЛОПЕРИОДА(Врем_Рейсы.ДатаОтправления, ДЕНЬ) КАК вава,
	|	ВложенныйЗапрос.СтанцияОперации КАК СтанцияОперации
	|ИЗ
	|	Врем_Рейсы КАК Врем_Рейсы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
	|		ПО Врем_Рейсы.НомерВагона.Наименование = э_НакладнаяВагоны.НомерВагона
	|			И (НАЧАЛОПЕРИОДА(ВЫБОР
	|					КОГДА Врем_Рейсы.ДатаОтправления = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА Врем_Рейсы.Период
	|					ИНАЧЕ Врем_Рейсы.ДатаОтправления
	|				КОНЕЦ, ДЕНЬ) = НАЧАЛОПЕРИОДА(э_НакладнаяВагоны.Ссылка.ДатаИВремяОтправленияГруза, ДЕНЬ))
	|			И Врем_Рейсы.СтанцияНазначения.КодЖДСтанции = э_НакладнаяВагоны.Ссылка.СтанцияНазначенияКод
	|			И Врем_Рейсы.СтанцияОтправления.КодЖДСтанции = э_НакладнаяВагоны.Ссылка.СтанцияОтправленияКод
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ДислокацияВагонов.Вагон КАК Вагон,
	|			ДислокацияВагонов.Период КАК Период,
	|			МАКСИМУМ(ДислокацияВагонов.СтанцияОперации) КАК СтанцияОперации
	|		ИЗ
	|			РегистрСведений.ДислокацияВагонов КАК ДислокацияВагонов
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ДислокацияВагонов.Вагон,
	|			ДислокацияВагонов.Период) КАК ВложенныйЗапрос
	|		ПО Врем_Рейсы.НомерВагона = ВложенныйЗапрос.Вагон
	|			И Врем_Рейсы.Период = ВложенныйЗапрос.Период
	|ГДЕ
	|	ВЫБОР
	|			КОГДА Врем_Рейсы.ДатаОтправления = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Врем_Рейсы.Период
	|			ИНАЧЕ Врем_Рейсы.ДатаОтправления
	|		КОНЕЦ >= ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, -&СдвигМесяцев)
	|	И Врем_Рейсы.СтанцияНазначения <> Врем_Рейсы.СтанцияОтправления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОтправления";
	Запрос.УстановитьПараметр("НомерВагона", МассивСтруктур[ИндексСтроки].НомерВагона);
	//Запрос.УстановитьПараметр("СтанцияНазначения", МассивСтруктур[ИндексСтроки].Калькуляция.Суша_ПунктНазначения);
	//Запрос.УстановитьПараметр("СтанцияОтправления", МассивСтруктур[ИндексСтроки].СтанцияПодачи);
//	Запрос.УстановитьПараметр("Период", МассивСтруктур[ИндексСтроки].ДатаОтправления);
	//Запрос.УстановитьПараметр("Период", МассивСтруктур[ИндексСтроки].ДатаПередачиВПользование);
	Запрос.УстановитьПараметр("СдвигМесяцев", ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("КоличествоМесяцевПодбораРейсов"));
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Рейсы.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеНаСервере(ИндексСтроки)
	
	Запрос = Новый Запрос;
	
	МассивСтруктур = ПолучитьИзВременногоХранилища(АдресМассиваСтруктур);
	//Евросиб Каблов 31.10.2020 ( Ticket#0212217
	Если ОдинРейсДляВсехВагонов Тогда
		Вагоны = Новый Массив;
		Для Каждого СтруктураДанных Из МассивСтруктур Цикл
			Вагоны.Добавить(СтруктураДанных.НомерВагона);
		КонецЦикла;
		Запрос.УстановитьПараметр("НомерВагона", Вагоны);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДислокацияВагоновСрезПоследних.Вагон КАК НомерВагона,
		|	ДислокацияВагоновСрезПоследних.СтанцияНазначения КАК СтанцияНазначения,
		|	ДислокацияВагоновСрезПоследних.СтанцияОтправления КАК СтанцияОтправления,
		|	НАЧАЛОПЕРИОДА(ДислокацияВагоновСрезПоследних.ДатаОтправленияСоСтанции, ДЕНЬ) КАК ДатаОтправления,
		|	НАЧАЛОПЕРИОДА(ДислокацияВагоновСрезПоследних.ДатаПрибытияНаСтанцию, ДЕНЬ) КАК ДатаПрибытия,
		|	ДислокацияВагоновСрезПоследних.ОперацияСВагоном КАК ОперацияСВагоном
		|ПОМЕСТИТЬ Врем_Рейсы
		|ИЗ
		|	РегистрСведений.ДислокацияВагонов КАК ДислокацияВагоновСрезПоследних
		|ГДЕ
		|	ДислокацияВагоновСрезПоследних.Вагон В(&НомерВагона)
		|	И ДислокацияВагоновСрезПоследних.ДатаОтправленияСоСтанции >= &ДатаНачала
		|	И ДислокацияВагоновСрезПоследних.СтанцияНазначения <> ДислокацияВагоновСрезПоследних.СтанцияОтправления
		|	И ДислокацияВагоновСрезПоследних.ДатаОтправленияСоСтанции < ДислокацияВагоновСрезПоследних.ДатаПрибытияНаСтанцию
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Врем_Рейсы.СтанцияНазначения КАК СтанцияНазначения,
		|	Врем_Рейсы.СтанцияОтправления КАК СтанцияОтправления,
		|	МИНИМУМ(Врем_Рейсы.ДатаОтправления) КАК ДатаОтправления,
		|	МАКСИМУМ(Врем_Рейсы.ДатаПрибытия) КАК ДатаПрибытия,
		|	НАЧАЛОПЕРИОДА(э_НакладнаяВагоны.Ссылка.Дата, ДЕНЬ) КАК ДатаНакладной
		|ИЗ
		|	Врем_Рейсы КАК Врем_Рейсы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
		|		ПО Врем_Рейсы.НомерВагона.Наименование = э_НакладнаяВагоны.НомерВагона
		|			И (НАЧАЛОПЕРИОДА(Врем_Рейсы.ДатаОтправления, ДЕНЬ) = НАЧАЛОПЕРИОДА(э_НакладнаяВагоны.Ссылка.ДатаИВремяОтправленияГруза, ДЕНЬ))
		|			И (ПОДСТРОКА(Врем_Рейсы.СтанцияНазначения.КодЖДСтанции, 1, 5) = э_НакладнаяВагоны.Ссылка.СтанцияНазначенияКод)
		|			И (ПОДСТРОКА(Врем_Рейсы.СтанцияОтправления.КодЖДСтанции, 1, 5) = э_НакладнаяВагоны.Ссылка.СтанцияОтправленияКод)
		|ГДЕ
		|	Врем_Рейсы.ДатаОтправления >= &ДатаНачала
		|	И Врем_Рейсы.СтанцияНазначения <> Врем_Рейсы.СтанцияОтправления
		|
		|СГРУППИРОВАТЬ ПО
		|	Врем_Рейсы.СтанцияНазначения,
		|	Врем_Рейсы.СтанцияОтправления,
		|	э_НакладнаяВагоны.Ссылка.Дата,
		|	э_НакладнаяВагоны.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаОтправления";
	//Евросиб Каблов 31.10.2020 )
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДислокацияВагоновСрезПоследних.Вагон КАК НомерВагона,
		|	ДислокацияВагоновСрезПоследних.СтанцияНазначения КАК СтанцияНазначения,
		|	ДислокацияВагоновСрезПоследних.СтанцияОтправления КАК СтанцияОтправления,
		|	НАЧАЛОПЕРИОДА(ДислокацияВагоновСрезПоследних.ДатаОтправленияСоСтанции, ДЕНЬ) КАК ДатаОтправления,
		|	НАЧАЛОПЕРИОДА(ДислокацияВагоновСрезПоследних.ДатаПрибытияНаСтанцию, ДЕНЬ) КАК ДатаПрибытия,
		|	ДислокацияВагоновСрезПоследних.ОперацияСВагоном КАК ОперацияСВагоном
		|ПОМЕСТИТЬ Врем_Рейсы
		|ИЗ
		|	РегистрСведений.ДислокацияВагонов КАК ДислокацияВагоновСрезПоследних
		|ГДЕ
		|	ДислокацияВагоновСрезПоследних.Вагон В(&НомерВагона)
		|	И ДислокацияВагоновСрезПоследних.ДатаОтправленияСоСтанции >= &ДатаНачала
		|	И ДислокацияВагоновСрезПоследних.СтанцияНазначения <> ДислокацияВагоновСрезПоследних.СтанцияОтправления
		|	И ДислокацияВагоновСрезПоследних.ДатаОтправленияСоСтанции < ДислокацияВагоновСрезПоследних.ДатаПрибытияНаСтанцию
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Врем_Рейсы.НомерВагона КАК НомерВагона,
		|	Врем_Рейсы.СтанцияНазначения КАК СтанцияНазначения,
		|	Врем_Рейсы.СтанцияОтправления КАК СтанцияОтправления,
		|	МИНИМУМ(Врем_Рейсы.ДатаОтправления) КАК ДатаОтправления,
		|	МАКСИМУМ(Врем_Рейсы.ДатаПрибытия) КАК ДатаПрибытия,
		|	НАЧАЛОПЕРИОДА(э_НакладнаяВагоны.Ссылка.Дата, ДЕНЬ) КАК ДатаНакладной
		|ИЗ
		|	Врем_Рейсы КАК Врем_Рейсы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
		|		ПО Врем_Рейсы.НомерВагона.Наименование = э_НакладнаяВагоны.НомерВагона
		|			И (НАЧАЛОПЕРИОДА(Врем_Рейсы.ДатаОтправления, ДЕНЬ) = НАЧАЛОПЕРИОДА(э_НакладнаяВагоны.Ссылка.ДатаИВремяОтправленияГруза, ДЕНЬ))
		|			И (ПОДСТРОКА(Врем_Рейсы.СтанцияНазначения.КодЖДСтанции, 1, 5) = э_НакладнаяВагоны.Ссылка.СтанцияНазначенияКод)
		|			И (ПОДСТРОКА(Врем_Рейсы.СтанцияОтправления.КодЖДСтанции, 1, 5) = э_НакладнаяВагоны.Ссылка.СтанцияОтправленияКод)
		|ГДЕ
		|	Врем_Рейсы.ДатаОтправления >= &ДатаНачала
		|	И Врем_Рейсы.СтанцияНазначения <> Врем_Рейсы.СтанцияОтправления
		|
		|СГРУППИРОВАТЬ ПО
		|	Врем_Рейсы.НомерВагона,
		|	Врем_Рейсы.СтанцияНазначения,
		|	Врем_Рейсы.СтанцияОтправления,
		|	э_НакладнаяВагоны.Ссылка.Дата,
		|	э_НакладнаяВагоны.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаОтправления";
		Запрос.УстановитьПараметр("НомерВагона", МассивСтруктур[ИндексСтроки].НомерВагона);
	КонецЕсли;
	
	КоличествоМесяцевПодбора = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("КоличествоМесяцевПодбораРейсов");
	ТекДата = ТекущаяДата();
	ДатаНачалаДислокации = '20200921';
	ДатаНачала = ДобавитьМесяц(ТекДата, -КоличествоМесяцевПодбора);
	ДатаНачала = Макс(ДатаНачала, ДатаНачалаДислокации);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекДата);
	
	Рейсы.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Евросиб Каблов 31.10.2020 ( Ticket#0212217
	Параметры.Свойство("ОдинРейсДляВсехВагонов", ОдинРейсДляВсехВагонов);
	Элементы.ОдинРейсДляВсехВагонов.Пометка = ОдинРейсДляВсехВагонов;
	//Евросиб Каблов 31.10.2020 )
	
	МассивСтруктур = Параметры.МассивСтруктур;
	//Адрес = Строка(Новый УникальныйИдентификатор());
	АдресМассиваСтруктур = ПоместитьВоВременноеХранилище(МассивСтруктур,Новый УникальныйИдентификатор());
	ИндексТекСтроки = 0;
	ЗаполнитьДанныеНаСервере(ИндексТекСтроки);
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	текДанные = Элементы.Рейсы.ТекущиеДанные;
	Если текДанные = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Рейс не выбран");
		Возврат;
	КонецЕсли; 
	МассивСтруктур = ПолучитьИзВременногоХранилища(АдресМассиваСтруктур);
	
	Если ОдинРейсДляВсехВагонов Тогда
		Для Каждого СтруктураДанных Из МассивСтруктур Цикл
			ЗаполнитьЗначенияСвойств(СтруктураДанных, текДанные,, "НомерВагона");
			МассивСтруктур[ИндексТекСтроки].СтанцияПодачи = текДанные.СтанцияОтправления;
			МассивСтруктур[ИндексТекСтроки].ДатаПрибытияНаСтанциюНазначения = текДанные.ДатаПрибытия;
		КонецЦикла;
		Закрыть(МассивСтруктур);
	Иначе
		ЗаполнитьЗначенияСвойств(МассивСтруктур[ИндексТекСтроки], текДанные,,"СтанцияОтправления");
		МассивСтруктур[ИндексТекСтроки].СтанцияПодачи = текДанные.СтанцияОтправления;
		МассивСтруктур[ИндексТекСтроки].СтанцияОтправления = текДанные.СтанцияОтправления;
		МассивСтруктур[ИндексТекСтроки].СтанцияНазначения = текДанные.СтанцияНазначения;
		МассивСтруктур[ИндексТекСтроки].ДатаОтправления = текДанные.ДатаОтправления;
		МассивСтруктур[ИндексТекСтроки].ДатаПрибытияНаСтанциюНазначения = текДанные.ДатаПрибытия;
	КонецЕсли;
	
	//Евросиб Каблов 12.10.2020 (
	//МассивСтруктур[ИндексТекСтроки].ИндексПоезда = текДанные.НомерЖДРейса;
	Если ИндексТекСтроки = МассивСтруктур.Количество()-1 Тогда
		Закрыть(МассивСтруктур);
	Иначе
		АдресМассиваСтруктур = ПоместитьВоВременноеХранилище(МассивСтруктур, Новый УникальныйИдентификатор());
		ИндексТекСтроки = ИндексТекСтроки + 1;
		ЗаполнитьДанныеНаСервере(ИндексТекСтроки);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОдинРейсДляВсехВагонов(Команда)
	ОдинРейсДляВсехВагонов = Не ОдинРейсДляВсехВагонов;
	Элементы.ОдинРейсДляВсехВагонов.Пометка = ОдинРейсДляВсехВагонов;
	ЗаполнитьДанныеНаСервере(ИндексТекСтроки);
КонецПроцедуры

