
&НаКлиенте
Процедура СоздатьКонтейнеры(Команда)
	
	Сч = 2;
	НомерКТК = ТД.Область("R"+Формат(Сч, "ЧГ=")+"C1").Текст;
	
	СчРезультат = Новый Массив;
	
	Пока НомерКТК <> "" Цикл
		
		СчРезультат.Добавить(Новый Структура("НомерКТК, ТипКТК", НомерКТК, ТД.Область("R"+Формат(Сч, "ЧГ=")+"C2").Текст));
		
		Сч = Сч + 1;
		НомерКТК = ТД.Область("R"+Формат(Сч, "ЧГ=")+"C1").Текст;
		
	КонецЦикла;
	
	СоздатьКонтейнерыНаСервере(СчРезультат);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКонтейнерыНаСервере(СчРезультат)
	
	ВсеХорошо = Истина;
	СтрокаОшибочныхКТК = "";
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Автоматический);

	// Евросиб Фролов (26.10.2021 Ticket№ 41408
	МассивСозданныхКТК = Новый Массив;
	// Евросиб Фролов)
	
	Для каждого Стр из СчРезультат Цикл
		
		ТипКТК = Справочники.ТипоразмерыТЕ.НайтиПоРеквизиту("КодISO", Стр.ТипКТК);
		Если НЕ ЗначениеЗаполнено(ТипКТК) Тогда
			ВсеХорошо = Ложь;
			СтрокаОшибочныхКТК = СтрокаОшибочныхКТК + ", не найден код " + Стр.ТипКТК;
		КонецЕсли;
		
		Если НЕ СтрДлина(Стр.НомерКТК) Тогда
			ВсеХорошо = Ложь;
			СтрокаОшибочныхКТК = СтрокаОшибочныхКТК + ", номер КТК должен быть 7 символов " + Стр.ТипКТК;
		ИначеЕсли ЗначениеЗаполнено( РаботаСКонтейнерамиСервер.НайтиКТК(Стр.НомерКТК)) Тогда // Справочники.ТЕ.НайтиПоНаименованию(Стр.НомерКТК)) Тогда
			Сообщить("Контейнер " + Стр.НомерКТК + " уже существует. Пропускаем...");
		Иначе
//			НКонт = Справочники.ТЕ.СоздатьЭлемент();
////			НКонт.ВладелецТЕ = Владелец;
////			НКонт.ВЭксплуатации = Истина;
//			НКонт.КонтрольноеЧисло = Прав(Стр.НомерКТК, 1);
//			НКонт.Номер = Сред(Стр.НомерКТК, 5, 6);
//			НКонт.Префикс = Лев(Стр.НомерКТК, 4);
//			НКонт.ТипТЕ = ТипКТК;
//			НКонт.Записать();
			КонтрольноеЧисло = Прав(Стр.НомерКТК, 1);
			Номер = Сред(Стр.НомерКТК, 5, 6);
			Префикс = Лев(Стр.НомерКТК, 4);
			НомерКТК = "" + Префикс + Номер + КонтрольноеЧисло;
			ТипТЕ = ТипКТК;
			
			Контейнер = РаботаСКонтейнерамиСервер.СоздатьКТК(НомерКТК, ТипТЕ); // Евросиб Фролов 26.10.2021: добавил "Контейнер = "
			
			// Евросиб Фролов (26.10.2021 Ticket№ 41408
			МассивСозданныхКТК.Добавить(Контейнер);
			// Евросиб Фролов)
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Евросиб Фролов (26.10.2021 Ticket№ 41408
	Если МассивСозданныхКТК.Количество() > 0 Тогда
		РаботаСКонтейнерамиСервер.ДобавитьИнформациюОбИсточникеСозднияКонтейнеров(МассивСозданныхКТК, "Справочник ""Контейнеры"" - загрузка из Excel");
	КонецЕсли;	
	// Евросиб Фролов)
	
	Если ВсеХорошо Тогда
		ЗафиксироватьТранзакцию();
		Сообщить("Успешно записано " + СчРезультат.Количество() + " элементов.");
	Иначе
		ОтменитьТранзакцию();
		Сообщить("Ошибки создания КТК для: " + СтрокаОшибочныхКТК);
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )
