
&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		//ПараметрыДоговора = ;
		Объект.Валюта = КонтрагентыДоговоры_сервер.ПолучитьВалютуДоговора(Объект.Договор);
		Объект.Регламентный = ?(Истина, 1, 2);
	КонецЕсли;
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьДоступность()
	
	ДоступКПараметрамДоговора = ЗначениеЗаполнено(Объект.Договор);
	Элементы.Регламентный.ТолькоПросмотр = ДоступКПараметрамДоговора;
	Элементы.Валюта.ТолькоПросмотр = ДоступКПараметрамДоговора;
	
	ЭтоПроцессное = Объект.ТипОграничения = ПредопределенноеЗначение("Перечисление.ТипыОграничений.Процессные");
	Элементы.Контрагент.Видимость = ЭтоПроцессное;
	Элементы.Договор.Видимость = ЭтоПроцессное;
	Элементы.Валюта.Видимость = ЭтоПроцессное;
	Элементы.Регламентный.Видимость = ЭтоПроцессное;
	Элементы.ПунктНазначения.Видимость = ЭтоПроцессное;
	Элементы.ПунктНазначенияВРегионе.Видимость = ЭтоПроцессное;
	Элементы.ПунктОтправления.Заголовок = ?(ЭтоПроцессное, "Пункт отправления", "Пункт контроля");
	Элементы.ВидыОпераций.Доступность = ЭтоПроцессное;
	Элементы.РаспределениеВесаОперацииПоДням.Доступность = НЕ Объект.РаспределятьПоДням;
	Элементы.ЕдиницаИзмеренияКоличества.Видимость = (Объект.ЕдиницаТарификации = ПредопределенноеЗначение("Перечисление.ЕдиницыТарификации.КоличествоНоменклатуры"));
	
	Элементы.Коэффициенты.Доступность = (Объект.ЕдиницаТарификации = ПредопределенноеЗначение("Перечисление.ЕдиницыТарификации.ТС") ИЛИ Объект.ЕдиницаТарификации = ПредопределенноеЗначение("Перечисление.ЕдиницыТарификации.ТЕ"));
	Элементы.БазоваяЕИВеса.Видимость = (Объект.ЕдиницаТарификации = ПредопределенноеЗначение("Перечисление.ЕдиницыТарификации.ОбъемНоменклатуры") ИЛИ Объект.ЕдиницаТарификации = ПредопределенноеЗначение("Перечисление.ЕдиницыТарификации.ВесНоменклатуры"));
	Элементы.БазоваяЕИОбъема.Видимость = (Объект.ЕдиницаТарификации = ПредопределенноеЗначение("Перечисление.ЕдиницыТарификации.ОбъемНоменклатуры") ИЛИ Объект.ЕдиницаТарификации = ПредопределенноеЗначение("Перечисление.ЕдиницыТарификации.ВесНоменклатуры"));
	
	СВ = Новый Массив;
	Если ЭтоПроцессное Тогда
		СВ.Добавить(ПредопределенноеЗначение("Перечисление.ЕдиницыТарификации.Операция"));
		СВ.Добавить(ПредопределенноеЗначение("Перечисление.ЕдиницыТарификации.ТС"));
		СВ.Добавить(ПредопределенноеЗначение("Перечисление.ЕдиницыТарификации.ТЕ"));
	Иначе
		СВ.Добавить(ПредопределенноеЗначение("Перечисление.ЕдиницыТарификации.ТС"));
		СВ.Добавить(ПредопределенноеЗначение("Перечисление.ЕдиницыТарификации.ТЕ"));
	КонецЕсли;
	Элементы.ЕдиницаТарификации.СписокВыбора.ЗагрузитьЗначения(СВ);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВвестиСтроку(Объект.Комментарий, "Введите комментарий к тарифу...", , Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	   ТекущийОбъект.ТипыТС.Очистить();
	   ТекущийОбъект.ТипыТЕ.Очистить();
	   ТекущийОбъект.ВидыОпераций.Очистить();
	   Для каждого Стр из ТипыТС Цикл ТекущийОбъект.ТипыТС.Добавить().ТипТС = Стр.Значение; КонецЦикла;
	   Для каждого Стр из ТипыТЕ Цикл ТекущийОбъект.ТипыТЕ.Добавить().ТипТЕ = Стр.Значение; КонецЦикла;
	   Для каждого Стр из ВидыОпераций Цикл ТекущийОбъект.ВидыОпераций.Добавить().ВидОперации = Стр.Значение; КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипыТС.ЗагрузитьЗначения(Объект.ТипыТС.Выгрузить().ВыгрузитьКолонку("ТипТС"));
	ТипыТЕ.ЗагрузитьЗначения(Объект.ТипыТЕ.Выгрузить().ВыгрузитьКолонку("ТипТЕ"));
	ВидыОпераций.ЗагрузитьЗначения(Объект.ВидыОпераций.Выгрузить().ВыгрузитьКолонку("ВидОперации"));
	
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )



&НаКлиенте
Процедура ТипОграниченияПриИзменении(Элемент)
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределятьПоДнямПриИзменении(Элемент)
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаТарификацииПриИзменении(Элемент)
	
	Если Объект.ЕдиницаТарификации = ПредопределенноеЗначение("Перечисление.ЕдиницыТарификации.ТС") Тогда
		ВыбранныйТипРеквизита = Новый ОписаниеТипов("СправочникСсылка.ТипоразмерыТС");
	Иначе
		ВыбранныйТипРеквизита = Новый ОписаниеТипов("СправочникСсылка.ТипоразмерыТЕ");
	КонецЕсли;
	Элементы.КоэффициентыПоказатель.ОграничениеТипа = ВыбранныйТипРеквизита;
	Объект.Коэффициенты.Очистить();
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыНоменклатурыПриИзменении(Элемент)
	
	Номенклатура.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.ЕдиницаТарификации = ПредопределенноеЗначение("Перечисление.ЕдиницыТарификации.КоличествоНоменклатуры") И НЕ ЗначениеЗаполнено(Объект.ЕдиницаИзмеренияКоличества) Тогда
		СтандартнаяОбработка = Ложь;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Перед подбором номенклатуры необходимо указать единицу измерения количества!";
		Сообщение.Поле = "Объект.ЕдиницаИзмеренияКоличества";
		Сообщение.УстановитьДанные(Объект);
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	Если Объект.ЕдиницаТарификации = ПредопределенноеЗначение("Перечисление.ЕдиницыТарификации.КоличествоНоменклатуры") Тогда
		Рез = ПроверитьНоменклатуруНаЕИ(Номенклатура.ВыгрузитьЗначения(), Объект.ЕдиницаИзмеренияКоличества);
		
		Для каждого Стр из Рез Цикл
			Сообщить("Базовая е.и. для " + Стр + " не соответствует единице измерения в ограничении. Номенклатура удалена!");
			Номенклатура.Удалить(Номенклатура.НайтиПоЗначению(Стр));
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьНоменклатуруНаЕИ(Номенклатура, ЕдиницаИзмеренияКоличества)
	
	Рез = Новый Массив;
	
	Для каждого Стр из Номенклатура Цикл
		Если Стр.БазоваяЕдиницаИзмерения <> ЕдиницаИзмеренияКоличества Тогда
			Рез.Добавить(Стр);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.НижняяГраница И Объект.ЖелтыйПорог <= Объект.КрасныйПорог Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "При текущих настройках красный порог должен быть меньше, чем желтый!";
		Сообщение.Поле = "Объект.КрасныйПорог";
		Сообщение.УстановитьДанные(Объект);
		Сообщение.Сообщить();
		Отказ = Истина;
	ИначеЕсли НЕ Объект.НижняяГраница И Объект.ЖелтыйПорог >= Объект.КрасныйПорог Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "При текущих настройках красный порог должен быть больше, чем желтый!";
		Сообщение.Поле = "Объект.КрасныйПорог";
		Сообщение.УстановитьДанные(Объект);
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

