////////////////////////////////////////////////////////////////////////////////
//
// Процедура ПолучитьРасстояние
//
// Описание:
// Получает расстояние между двумя станциями
//
// Параметры (название, тип, дифференцированное значение)
//	СтанцияОтправления - Строка - Код станции отправления (6 символов)
//	СтанцияНазначения - Строка - Код станции назначения (6 символов)
// Возвращаемое значение:
//	Расстояние - число - Расстояние (км) между двумя станциям; -1 в случае ошибки
Функция ПолучитьРасстояние(СтанцияОтправления, СтанцияНазначения) Экспорт
	
	Расстояние = 0;
	Попытка
		Ком = Новый COMОбъект("TariffX.Application"); 
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при создании com-соединения Рейл-тариф");
		Возврат -1;
	КонецПопытки;
	Попытка
		Ком.Initialize("");
		Док = Ком.CreateDocument();
		Док.FromStation(СтанцияОтправления, 0);
		Док.ToStation(СтанцияНазначения, 0);
		Док.DoCalcDistance();
		Док.Result.AsTable.First();
		
		Пока НЕ Док.Result.AsTable.EOF() Цикл
			Расстояние = Расстояние + Док.Result.Value("Distance");	
			Док.Result.AsTable.Next();
		КонецЦикла; 
		Возврат Расстояние;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"Ошибка при получении данных Рейл-тариф: %1",
		ОписаниеОшибки()));
		Возврат -1;
	КонецПопытки;
	
КонецФункции //ПолучитьРасстояние

////////////////////////////////////////////////////////////////////////////////
//
// Функция ПолучитьКалькуляцию
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
// Возвращаемое значение: 
//
Функция ПолучитьКалькуляцию(ПараметрыКалькуляции) Экспорт
	
	СтруктураРезультат = Новый Структура("Ошибка, ОписаниеОшибки");
	Попытка
		Ком = Новый COMОбъект("TariffX.Application"); 
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при создании com-соединения Рейл-тариф");
		СтруктураРезультат.Ошибка = Истина;
		СтруктураРезультат.ОписаниеОшибки  = "Ошибка при создании com-соединения Рейл-тариф";
		Возврат СтруктураРезультат;
	КонецПопытки;
	Попытка
		Ком = Новый COMОбъект("TariffX.Application"); 
		Ком.Initialize("");
		Док = Ком.CreateDocument();
		
		Док.OnDate(Формат(ТекущаяДата(),"ДФ=гггг-ММ-дд"));
		Док.FromStation(ПараметрыКалькуляции.КодСтанцииОтправления, 0);
		Док.ToStation(ПараметрыКалькуляции.КодСтанцииНазначения, 0);
		
		//Выбор типа отправки
		Док.Send(ПараметрыКалькуляции.ПараметрыОтправки.КодКатегории,
				ПараметрыКалькуляции.ПараметрыОтправки.КодДетализации,
				ПараметрыКалькуляции.ПараметрыОтправки.ПризнакМаршрутнойОтправки,
				ПараметрыКалькуляции.ПараметрыОтправки.КодСкорости);
		Если ПараметрыКалькуляции.Порожний Тогда
			//Выбор груза
			Док.Freight(ПараметрыКалькуляции.ПараметрыПорожнегоВагона.КодГруза,
						10);
			//Установка параметров вагона
			//Док.EmptyWagon(ПараметрыКалькуляции.ПараметрыПорожнегоВагона.КодВагона,
			//			ПараметрыКалькуляции.ПараметрыПорожнегоВагона.ПринадлежностьВагона,
			//			ПараметрыКалькуляции.ПараметрыПорожнегоВагона.КоличествоВагонов,
			//			"391498",
			//			4,
			//			0);
			Док.Container(ПараметрыКалькуляции.ПараметрыКонтейнера.КодВагона,
						ПараметрыКалькуляции.ПараметрыКонтейнера.ПринадлежностьВагона,
						ПараметрыКалькуляции.ПараметрыКонтейнера.КоличествоВагонов);
			Док.ContainerTransport(ПараметрыКалькуляции.ПараметрыТранспортДляКонтейнера.КодВагона,
						ПараметрыКалькуляции.ПараметрыТранспортДляКонтейнера.ПринадлежностьВагона,
						ПараметрыКалькуляции.ПараметрыТранспортДляКонтейнера.КоличествоВагонов);
		Иначе
			Док.Freight(ПараметрыКалькуляции.ПараметрыГруза.КодЕТСНГ,
						ПараметрыКалькуляции.ПараметрыГруза.Вес);
			Док.Container(ПараметрыКалькуляции.ПараметрыКонтейнера.КодВагона,
						ПараметрыКалькуляции.ПараметрыКонтейнера.ПринадлежностьВагона,
						ПараметрыКалькуляции.ПараметрыКонтейнера.КоличествоВагонов);
			Док.ContainerTransport(ПараметрыКалькуляции.ПараметрыТранспортДляКонтейнера.КодВагона,
						ПараметрыКалькуляции.ПараметрыТранспортДляКонтейнера.ПринадлежностьВагона,
						ПараметрыКалькуляции.ПараметрыТранспортДляКонтейнера.КоличествоВагонов);
		КонецЕсли;
		Док.DoCalcDistance();
		Док.DoCalcTariff();
		//Док.Calculate();
		ДлительностьДней = Док.GetPeriodOfDelivery(0);
		//Док.Save("\\esxdc1\EUROSIB_TS\Общая папка\rt.trf");
		Док.Result.AsTable.First();
	Исключение
		СтруктураРезультат.Ошибка = Истина;
		ИнфОбОшибке = ИнформацияОбОшибке();
		СтруктураРезультат.ОписаниеОшибки = "МодульRT: " + ИнфОбОшибке.Описание +"
										|"+ИнфОбОшибке.Причина.Описание;
		Возврат СтруктураРезультат;
	КонецПопытки;
	Результат = Новый Массив;
	РасстояниеМеждуЛокациями = 0;
	
	Пока Не Док.Result.AsTable.EOF() Цикл
		СтрокаРезультата = Новый Структура("Страна, Стоимость, НДС, Расстояние, ДлительностьДней, ДетальноеОписание");
		СтрокаРезультата.Страна 			= Док.Result.Value("LandName");
		СтрокаРезультата.Стоимость 			= Док.Result.Value("BasePrice");
		СтрокаРезультата.НДС 				= Док.Result.Value("NDS");
		СтрокаРезультата.Расстояние 		= Док.Result.Value("Distance");
		СтрокаРезультата.ДлительностьДней 	= Док.Result.Value("PeriodOfDelivery");
		РасстояниеМеждуЛокациями 			= РасстояниеМеждуЛокациями + СтрокаРезультата.Расстояние;
		ВеткаСтраны = Док.Data.Node("LandTrf");
		ВеткаСтраны.AsTable.First();
		Пока НЕ ВеткаСтраны.AsTable.EOF() Цикл
			ВеткаТарифы = ВеткаСтраны.Node("Taxes");
			ВеткаТарифы.AsTable.First();
			ДетальноеОписание = Новый Массив;
			Пока Не ВеткаТарифы.AsTable.EOF() Цикл
				СтрокаДетальноеОписание = Новый Структура("НомерСтроки, Страна, Тип, Ставка, Описание, Значение, АББР, Документ");
				СтрокаДетальноеОписание.НомерСтроки 	= ВеткаТарифы.Value("Id");
				СтрокаДетальноеОписание.Страна 			= ВеткаТарифы.Value("State");
				СтрокаДетальноеОписание.Тип 			= ВеткаТарифы.Value("Type");
				СтрокаДетальноеОписание.Ставка 			= ВеткаТарифы.Value("Stavka");
				СтрокаДетальноеОписание.Описание 		= ВеткаТарифы.Value("Description");
				СтрокаДетальноеОписание.Значение    	= ВеткаТарифы.Value("Value");
				СтрокаДетальноеОписание.АББР			= ВеткаТарифы.Value("ABBR");
				СтрокаДетальноеОписание.Документ    	= ВеткаТарифы.Value("Document");
				ВеткаТарифы.AsTable.Next();
				ДетальноеОписание.Добавить(СтрокаДетальноеОписание);
			КонецЦикла;
			ВеткаСтраны.AsTable.Next();
			СтрокаРезультата.ДетальноеОписание = ДетальноеОписание;
		КонецЦикла;
		Док.Result.AsTable.Next();
		Результат.Добавить(СтрокаРезультата);
	КонецЦикла; 
	РейлТариф_сервер.СохранитьРасстояниеМеждуЛокациями(ПараметрыКалькуляции.КодСтанцииОтправления, ПараметрыКалькуляции.КодСтанцииНазначения, РасстояниеМеждуЛокациями);
	
	Возврат Новый Структура("Ошибка, ОписаниеОшибки, РезультатТаблица", 
							Ложь,
							"",
							Результат);
	
КонецФункции //ПолучитьКалькуляцию

////////////////////////////////////////////////////////////////////////////////
//
// Функция ПолучитьСтруктуруПараметровКалькуляции
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
// Возвращаемое значение: 
//
Функция ПолучитьСтруктуруПараметровКалькуляции() Экспорт
	
	ПараметрыКалькуляции = Новый Структура;
	
	ПараметрыКалькуляции.Вставить("КодСтанцииОтправления", "000000");
	ПараметрыКалькуляции.Вставить("КодСтанцииНазначения", "000000");
	ПараметрыКалькуляции.Вставить("Порожний", Ложь);
	
	ПараметрыОтправки = Новый Структура;
	ПараметрыОтправки.Вставить("КодКатегории", 0);
	ПараметрыОтправки.Вставить("КодДетализации", 0);
	ПараметрыОтправки.Вставить("ПризнакМаршрутнойОтправки", 0);
	ПараметрыОтправки.Вставить("КодСкорости", 0);
	ПараметрыКалькуляции.Вставить("ПараметрыОтправки", ПараметрыОтправки);
	
	ПараметрыГруза = Новый Структура;
	ПараметрыГруза.Вставить("КодЕТСНГ", "000000");
	ПараметрыГруза.Вставить("Вес", 0);
	ПараметрыКалькуляции.Вставить("ПараметрыГруза", ПараметрыГруза);
	
	ПараметрыПорожнегоВагона = Новый Структура;
	ПараметрыПорожнегоВагона.Вставить("КодВагона", 0);
	ПараметрыПорожнегоВагона.Вставить("ПринадлежностьВагона", 0);
	ПараметрыПорожнегоВагона.Вставить("КоличествоВагонов", 0);
	ПараметрыПорожнегоВагона.Вставить("КодГруза", "000000");
	ПараметрыКалькуляции.Вставить("ПараметрыПорожнегоВагона", ПараметрыПорожнегоВагона);
	
	ПараметрыКонтейнера = Новый Структура;
	ПараметрыКонтейнера.Вставить("КодВагона", 0);
	ПараметрыКонтейнера.Вставить("ПринадлежностьВагона", 0);
	ПараметрыКонтейнера.Вставить("КоличествоВагонов", 0);
	ПараметрыКалькуляции.Вставить("ПараметрыКонтейнера", ПараметрыКонтейнера);
	
	ПараметрыТранспортДляКонтейнера = Новый Структура;
	ПараметрыТранспортДляКонтейнера.Вставить("КодВагона", 0);
	ПараметрыТранспортДляКонтейнера.Вставить("ПринадлежностьВагона", 0);
	ПараметрыТранспортДляКонтейнера.Вставить("КоличествоВагонов", 0);
	ПараметрыКалькуляции.Вставить("ПараметрыТранспортДляКонтейнера", ПараметрыТранспортДляКонтейнера);
	
	Возврат ПараметрыКалькуляции;
	
КонецФункции //ПолучитьСтруктуруПараметровКалькуляции

