
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("РодительЛокации") Тогда
		РодительЛокации = Параметры.РодительЛокации;
	КонецЕсли;
	Если Параметры.Свойство("ТипЛокации") Тогда
		ТипЛокации = Параметры.ТипЛокации;
	КонецЕсли;
	Если Параметры.Свойство("Мультилокация") Тогда
		Локации.Загрузить(Параметры.Мультилокация.Локации.Выгрузить());
	КонецЕсли;
	// Евросиб Bug 93272 TA 93294 Рыбьяков К.А. 23.10.2024 ((
	Если Параметры.Свойство("Отбор") Тогда
		Если Параметры.Отбор.Свойство("СписокЛокаций") Тогда
			ПараметрыВыбора = Новый ФиксированныйМассив(Параметры.Отбор.СписокЛокаций);
		КонецЕсли;
	КонецЕсли;
	//ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
	// Евросиб Рыбьяков К.А. 23.10.2024 ))
КонецПроцедуры

&НаСервере
Функция ЗаписатьМультилокациюНаСервере()
	Локации.Сортировать("Локация Возр");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Мультилокации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Мультилокации КАК Мультилокации
		|ГДЕ
		|	НЕ Мультилокации.ПометкаУдаления
		|	И Мультилокации.Локации.Локация В(&ЛокацияСписок)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Мультилокации.Код";
	
	Запрос.УстановитьПараметр("ЛокацияСписок", Локации.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыбМультилокация = Неопределено;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Локации.Количество() = ВыборкаДетальныеЗаписи.Ссылка.Локации.Количество() Тогда
			НайденныеЛокации = 0;
			Для каждого Лок из Локации Цикл
				Если НЕ ВыборкаДетальныеЗаписи.Ссылка.Локации.Найти(Лок.Локация)=Неопределено Тогда
					НайденныеЛокации = НайденныеЛокации+1;
				Иначе
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если НайденныеЛокации = Локации.Количество() Тогда
				ВыбМультилокация = ВыборкаДетальныеЗаписи.Ссылка;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Если ВыбМультилокация = Неопределено Тогда
		ВыбМультилокация = Справочники.Мультилокации.СоздатьЭлемент();
		ВыбМультилокация.Локации.Загрузить(Локации.Выгрузить());
		ВыбМультилокация.Записать();
	КонецЕсли;
	
	Возврат ВыбМультилокация.Ссылка;
КонецФункции

&НаКлиенте
Процедура ЗаписатьМультилокацию(Команда)
	ВыбМультилокация = ЗаписатьМультилокациюНаСервере();
	//++ Зубов US 33131 TA 38910 26.10.2021
	//Оповестить("ЗакрытиеФормыМультилокации",ВыбМультилокация,Строка(ЭтаФорма.ВладелецФормы.УникальныйИдентификатор));
	Оповестить("ЗакрытиеФормыМультилокации",ВыбМультилокация,ЭтаФорма.ВладелецФормы);
	//-- Зубов US 33131 TA 38910 26.10.2021
	//Евросиб Каблов 04.04.2023 ( Ticket#0265045
	//ЭтаФорма.Закрыть();
	ЭтаФорма.Закрыть(ВыбМультилокация);
	//Евросиб Каблов 04.04.2023 )
	
КонецПроцедуры

&НаКлиенте
Процедура ЛокацииЛокацияПриИзменении(Элемент)
	ТекДанные = Элементы.Локации.ТекущиеДанные;
	Если Локации.НайтиСтроки(Новый Структура("Локация",ТекДанные.Локация)).Количество()>1 Тогда
		ТекДанные.Локация = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
		Сообщить("Данная локация уже была выбрана. Повтор запрещен.");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЛокацииЛокацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СТруктураПараметров = Новый Структура;
	Если ЗначениеЗаполнено(ТипЛокации) Тогда
		СТруктураПараметров.Вставить("ТипЛокации",ТипЛокации);
	КонецЕсли;
	Если ЗначениеЗаполнено(РодительЛокации) Тогда
		СТруктураПараметров.Вставить("РодительЛокации",РодительЛокации);
	КонецЕсли;
	ОткрытьФорму("Справочник.Локации.ФормаВыбора",СтруктураПараметров,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	ТекДанные = Элементы.Локации.ТекущиеДанные;
	Если ЗначениеЗаполнено(Параметр) И ИмяСобытия = "ЗакрытиеФормыВыбораЛокацииДляМультилокации" И ЭтаФорма.УникальныйИдентификатор = Источник Тогда
		Если Локации.НайтиСтроки(Новый Структура("Локация",Параметр)).Количество()>0 Тогда
			ТекДанные.Локация = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
			Сообщить("Данная локация уже была выбрана. Повтор запрещен.");
		Иначе
			ТекДанные.Локация = Параметр;
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛокацииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// Евросиб Bug 93272 TA 93294 Рыбьяков К.А. 22.10.2024 ((
	Отбор = Новый Структура("СписокЛокаций", ПараметрыВыбора); 
	ПараметрыФормыВыбора = Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("Справочник.Локации.ФормаВыбора", ПараметрыФормыВыбора, ЭтаФорма);
	// Евросиб Рыбьяков К.А. 22.10.2024 ))

КонецПроцедуры
