
&НаКлиенте
Процедура КомандаДобавить(Команда)
	
	ВыполнитьЗакрытие(0);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПерезаполнить(Команда)
	
	ВыполнитьЗакрытие(1);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗакрытие(Поведение)
	
	СейчасКонтейнеры = (Элементы.Группа5.ТекущаяСтраница = Элементы.Группа6);
	// ДИТ BUG 78745 ТА 78746 Сержантова А.С. Начало: 12.02.2024
	// Было:
	////++ Зубов US 33131 TA 43877 16.12.2021	
	////Если СейчасКонтейнеры И (НЕ ЗначениеЗаполнено(КоличествоБезномерныхКТК) ИЛИ НЕ ЗначениеЗаполнено(РазмерДобавляемыхКТК)) Тогда
	//Если СейчасКонтейнеры И (НЕ ЗначениеЗаполнено(КоличествоБезномерныхКТК) ИЛИ НЕ ЗначениеЗаполнено(РазмерДобавляемыхКТК) ИЛИ Не ЗначениеЗаполнено(ТипДобавляемыхКТК)) Тогда	
	//	//ПоказатьПредупреждение(, "Вы должны указать количество и размер добавляемых КТК!");
	//	ПоказатьПредупреждение(, "Вы должны указать количество, размер и тип добавляемых КТК!");
	////-- Зубов US 33131 TA 43877 16.12.2021  
	//Стало:
	Если СейчасКонтейнеры И НЕ ФормаОткрытаИзЗаявки и
		(НЕ ЗначениеЗаполнено(КоличествоБезномерныхКТК) ИЛИ НЕ ЗначениеЗаполнено(РазмерДобавляемыхКТК) ИЛИ Не ЗначениеЗаполнено(ТипДобавляемыхКТК))
		Тогда   
		ПоказатьПредупреждение(, "Вы должны указать количество, размер и тип добавляемых КТК!");  
		Возврат;
	ИначеЕсли СейчасКонтейнеры И ФормаОткрытаИзЗаявки И НЕ ЗначениеЗаполнено(КоличествоБезномерныхКТК) Тогда   
		ПоказатьПредупреждение(, "Вы должны указать количество добавляемых КТК!");
	// ДИТ BUG 78745 ТА 78746 Сержантова А.С. Конец: 12.02.2024
		Возврат;
	ИначеЕсли НЕ СейчасКонтейнеры И (НЕ ЗначениеЗаполнено(КоличествоБезномерныхКТК) ИЛИ НЕ ЗначениеЗаполнено(ТипВагонов)) Тогда
		ПоказатьПредупреждение(, "Вы должны указать количество и тип добавляемых вагонов!");
		Возврат;
	КонецЕсли;
	
	Закрыть(Новый Структура("Количество, Размер, Тип, Поведение, ТипВагонов", КоличествоБезномерныхКТК, РазмерДобавляемыхКТК, ТипДобавляемыхКТК, Поведение, ТипВагонов));
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЭтоВагоны") Тогда
		Элементы.Группа5.ТекущаяСтраница = Элементы.Группа7;
	КонецЕсли;  
	
	// ДИТ BUG 78745 ТА 78746 Сержантова А.С. Начало: 16.02.2024
	Если Параметры.Свойство("ОткрытиеИзЗаявки") Тогда
		Элементы.РазмерДобавляемыхКТК.Видимость = Ложь;
		Элементы.ТипДобавляемыхКТК.Видимость = Ложь;
		ЭтаФорма.ФормаОткрытаИзЗаявки = Истина;
	КонецЕсли;
	// ДИТ BUG 78745 ТА 78746 Сержантова А.С. Конец: 16.02.2024

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


//++ Зубов US 33131 TA 43877 16.12.2021
&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	//ДИТ Беляев СЮ, Ticket#0263826, 10-03-2022 начало
	Если ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;                              
	//ДИТ Беляев СЮ, Ticket#0263826, 10-03-2022 конец
	Если ЭтаФорма.ВладелецФормы.ИмяФормы = "Документ.РелизСобственника.Форма.ФормаДокумента" Тогда
		Элементы.КомандаПерезаполнить.Видимость = Ложь;
		Элементы.КомандаДобавить.Заголовок = "Дополнить указанным количеством";
		Элементы.ТипДобавляемыхКТК.Заголовок = "Типоразмер добавляемых КТК"; 
		Элементы.ТипДобавляемыхКТК.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
КонецПроцедуры
//-- Зубов US 33131 TA 43877 16.12.2021