
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДиапазонПоиска = 3;
	
	Параметры.Свойство("Поступление", Поступление);
	Параметры.Свойство("Акцепт", Акцепт);
	
	АктАкцепт = Документы.Акцепт.НайтиСоздатьАктуальныйАкцепт(Поступление, Истина);
	
	Если Акцепт <> АктАкцепт Тогда
	
		Отказ = Истина;
		Возврат;
	
	КонецЕсли; 
	
	ДетализацияАкцепта.Параметры.УстановитьЗначениеПараметра("Акцепт", Акцепт);
	
	ДетализацияАкцепта.Параметры.УстановитьЗначениеПараметра("УИДПоступления", Неопределено);
	ДетализацияАкцепта.Параметры.УстановитьЗначениеПараметра("УИДПоступленияЗап", Ложь);
	
	УчитыватьНДС = Поступление.УчитыватьНДС;
	СуммаВключаетНДС = Поступление.СуммаВключаетНДС;
	
	Если Не ЗначениеЗаполнено(Поступление) Тогда
	
		Отказ = Истина;
		Возврат;
	
	КонецЕсли; 
	
	//Евросиб - АСуслов 13.09.2021 10:08:18 #34198
	//(
	//ТЗ = Поступление.Услуги.Выгрузить();
	ТЗ = Акцепт.Услуги.Выгрузить(Новый Структура("ПолностьюРазнесено", Ложь));
	//)
	//Евросиб - АСуслов 13.09.2021 10:08:20 #34198
	
	Для каждого Стр Из ТЗ Цикл
		
		// ДИТ Поморцева Т.П. Задача 34197 18.02.22. начало		
		Если Стр.Неурег = Справочники.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ Тогда
			Продолжить;
		КонецЕсли;
		// ДИТ Поморцева Т.П. Задача 34197 18.02.22.		
		
		НовСтр = УслугиИзПТУ.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		//Евросиб - АСуслов 13.09.2021 10:08:54 #34198
		//(
		НовСтр.ГУИДПТУ = Стр.ИдентификаторСтрокиПоступления;
		НовСтр.Количество = Стр.ПоступлениеКоличество;
		СтрокаПТУ = Поступление.Услуги.Найти(Стр.ИдентификаторСтрокиПоступления, "ГУИДПТУ");
		//НовСтр.СписокТД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.ТранспортныйДокумент, "НомерТранспортногоДокумента");
		//НовСтр.СписокТЕ = Стр.Контейнер;
		//НовСтр.СписокТС = Стр.Вагон;
		НовСтр.СписокТД = СтрокаПТУ.СписокТД;
		НовСтр.СписокТЕ = СтрокаПТУ.СписокТЕ;
		НовСтр.СписокТС = СтрокаПТУ.СписокТС;
		НовСтр.Цена = Стр.ПоступлениеЦена;
		НовСтр.Сумма = Стр.ПоступлениеСумма;
		НовСтр.СтавкаНДС = Стр.ПоступлениеСтавкаНДС;
		НовСтр.СуммаНДС = Стр.ПоступлениеСуммаНДС;
		НовСтр.Всего = Стр.ПоступлениеСумма + ?(СуммаВключаетНДС,0,Стр.ПоступлениеСуммаНДС);
		
		//НовСтр.ТекУИДСтроки = Строка(Новый УникальныйИдентификатор);
		НовСтр.ТекУИДСтроки = Стр.ГУИД;
		//)
		//Евросиб - АСуслов 13.09.2021 10:08:57 #34198
		НовСтр.НомерСтрокиПТУ = Стр.НомерСтроки;
		
	КонецЦикла; 
	
	ПроверитьРазнесение(Истина);
	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаСервере
Процедура ПроверитьРазнесение(ДополнениеИнфоСделки=Ложь)

	Для каждого Стр Из Акцепт.Услуги Цикл
	
		Если ЗначениеЗаполнено(Стр.ИдентификаторСтрокиРасходовВСделке)
			И ЗначениеЗаполнено(Стр.Сделка) Тогда
		
			ИскМас = УслугиИзПТУ.НайтиСтроки(Новый Структура("ГУИДПТУ", Стр.ИдентификаторСтрокиПоступления) );
			
			Если ИскМас.Количество() > 0  Тогда
				
				/// сначала проверим, что ВСЕ связанные с Стр ПТУ Услуги разнесены:
				
				ИскМасСтрАкц = Акцепт.Услуги.Выгрузить(Новый Структура("ИдентификаторСтрокиПоступления", Стр.ИдентификаторСтрокиПоступления) );
				
				ВсеРазнесены = Истина;
				Для каждого СтрУслАкц Из ИскМасСтрАкц Цикл
				
					Если Не ЗначениеЗаполнено(СтрУслАкц.ИдентификаторСтрокиРасходовВСделке)
						ИЛИ НЕ ЗначениеЗаполнено(Стр.Сделка) Тогда
					
						ВсеРазнесены = Ложь;
					
					КонецЕсли; 
				
				КонецЦикла; 
				
				Если ВсеРазнесены Тогда
					
					Если ДополнениеИнфоСделки Тогда
						
						ИскМас[0].Сделка = Стр.Сделка;
						ИскМас[0].БудНомерСделки = Стр.Сделка.Номер;
					
					КонецЕсли; 
					
					ИскМас[0].ВыполненПоискЗатрат = Истина;
					ИскМас[0].УспехРазнесения = Истина;
					ИскМас[0].СпособРазнесения = "Полностью разнесено!";
					
				Иначе
					
					ИскМас[0].СпособРазнесения = "Частично разнесено!";
					
				КонецЕсли;
			
			КонецЕсли; 
		
		КонецЕсли; 
	
	КонецЦикла;

КонецПроцедуры
 

//&НаКлиенте
//Процедура ДалееДетализация(Команда)
//	
//	Элементы.ДетализацияПоиска.ТолькоПросмотр = Ложь; 
//	
//	Элементы.ОбъектУслугиРазделитьСтроки.Доступность = Ложь;
//	
//	ДалееДетализацияСервер();
//	
//КонецПроцедуры

//&НаСервере
//Процедура ДалееДетализацияСервер()

//	// Создание строк будущего поиска
//	МасПравильныхСтрок = Новый Массив;
//	
//	Для каждого Стр Из Поступление.Услуги Цикл
//		
//		Если Стр.ВыбратьДляРазнесения Тогда
//			
//			ИскМас = ДетализацияПоиска.НайтиСтроки(Новый Структура("НомерСтрокиУслуг", Стр.НомерСтроки) );
//			
//			Если ИскМас.Количество() = 0 Тогда
//			
//				НовСтр = ДетализацияПоиска.Добавить();
//				НовСтр.НомерСтрокиУслуг = Стр.НомерСтроки;
//				НовСтр.ИдентификаторСтрокиПоступления = Стр.ИдентификаторСтрокиПоступления;
//				НовСтр.УИДСтрокиДетализации = Строка(Новый УникальныйИдентификатор);
//				
//				МасПравильныхСтрок.Добавить(НовСтр.УИДСтрокиДетализации);
//				
//			Иначе
//				
//				МасПравильныхСтрок.Добавить(ИскМас[0].УИДСтрокиДетализации);
//				
//			КонецЕсли; 
//			
//		КонецЕсли; 
//		
//	КонецЦикла; 

//	// Очистка от левых строк (лишних огрызков):
//	ВсегоСтрок = ДетализацияПоиска.Количество();
//	Для Сч = 1 По ВсегоСтрок Цикл
//		
//		ТекИД = ВсегоСтрок - Сч;
//		
//		Если МасПравильныхСтрок.Найти(ДетализацияПоиска[ТекИД].УИДСтрокиДетализации) = Неопределено Тогда
//		
//			ДетализацияПоиска.Удалить(ТекИД);
//		
//		КонецЕсли; 
//	
//	КонецЦикла; 
//	
//КонецПроцедуры

&НаКлиенте
Процедура ОбъектУслугиПриАктивизацииСтроки(Элемент)
	
	ТекДан = Элементы.ОбъектУслуги.ТекущиеДанные;
	
	ОтборСтрок = Новый Структура("НомерСтрокиУслуг", ТекДан.НомерСтроки);
	
	Элементы.ДетализацияПоиска.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
	
КонецПроцедуры

&НаКлиенте
Процедура РазделитьСтроки(Команда)
	
	ТекДан = Элементы.УслугиИзПТУ.ТекущиеДанные;
	
	Если ТекДан = Неопределено Тогда
	
		Сообщить("Не выбрана строка!");
		Возврат;
	
	КонецЕсли; 
	
	ДопПарам = Новый Структура("ИД_Строки", ТекДан.ПолучитьИдентификатор());
	
	ОпОп = Новый ОписаниеОповещения("РазделитьСтроки_ПослеДополнения", ЭтаФорма, ДопПарам);
	Парам = Новый Структура("СписокТД, Номенклатура, СписокТС, СписокТЕ, Всего, БудНомерСделки, ДатаКП, СтанцияОтправления, СтанцияНазначения" ) ;
	ЗаполнитьЗначенияСвойств(Парам, ТекДан);
	ОткрытьФорму("Документ.Акцепт.Форма.ФормаРазнесенияНВ_РазделениеСтрок", Парам, ЭтаФорма, , , ,ОпОп); 
	
КонецПроцедуры

&НаКлиенте
Процедура РазделитьСтроки_ПослеДополнения(РезультатРаботы, ДопПараметры) Экспорт

	Если РезультатРаботы = Неопределено Тогда
	
		Возврат;
	
	КонецЕсли; 

	ТекСтрДоРазделения = УслугиИзПТУ.НайтиПоИдентификатору(ДопПараметры.ИД_Строки);
	
	КолСтрокВМассиве = РезультатРаботы.Количество();
	
	ОпЧисла = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2));
	ОпДата = Новый ОписаниеТипов("Дата", ,, Новый КвалификаторыДаты(ЧастиДаты.Дата) );
	
	Если КолСтрокВМассиве = 1 Тогда
	    // Дополняем текущую строку
		ТекЗагрСтр = РезультатРаботы[0];
		
		ДополнитьСтроку(ТекСтрДоРазделения, ТекЗагрСтр, ОпЧисла, ОпДата);
		
	Иначе
		
		НакоплСумм = Новый Структура("Цена, Сумма, СуммаНДС, Всего", 0, 0, 0, 0);
		СтарСумм = Новый Структура("Цена, Сумма, СуммаНДС, Всего");
		ЗаполнитьЗначенияСвойств(СтарСумм, ТекСтрДоРазделения);
		// Выполняем деление:
		СдвигПоКолСтрок = 1;
		Для каждого ТекЗагрСтр Из РезультатРаботы Цикл
		
			НовСтр = УслугиИзПТУ.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, ТекСтрДоРазделения);
			// ДИТ Поморцева Т.П. Задача 34197 06.04.2022. начало
			//НовСтр.ТекУИДСтроки = Строка(Новый УникальныйИдентификатор);
			НовСтр.ТекУИДСтроки = ?(ЗначениеЗаполнено(ТекЗагрСтр.Кол6),Строка(Новый УникальныйИдентификатор),ТекСтрДоРазделения.ТекУИДСтроки);
			// ДИТ Поморцева Т.П. Задача 34197 06.04.2022. конец
			ПереданноеВсего = 0;
			ДополнитьСтроку(НовСтр, ТекЗагрСтр, ОпЧисла, ОпДата, ПереданноеВсего);
			
			Если ПереданноеВсего = 0 Тогда
				
				НовСтр.Цена = НовСтр.Цена / РезультатРаботы.Количество();
				НовСтр.Сумма = НовСтр.Сумма / РезультатРаботы.Количество();
				НовСтр.СуммаНДС = НовСтр.СуммаНДС / РезультатРаботы.Количество();
				НовСтр.Всего = НовСтр.Сумма + НовСтр.СуммаНДС;
				
			КонецЕсли; 
			
			НакоплСумм.Цена = НакоплСумм.Цена + НовСтр.Цена; 
			НакоплСумм.Сумма = НакоплСумм.Сумма + НовСтр.Сумма; 
			НакоплСумм.СуммаНДС = НакоплСумм.СуммаНДС + НовСтр.СуммаНДС;
			НакоплСумм.Всего = НакоплСумм.Всего + НовСтр.Всего;
			
			// Сдвиг:
			НовИД = НовСтр.ПолучитьИдентификатор();
			СтарИД = ДопПараметры.ИД_Строки;
			                      
			УслугиИзПТУ.Сдвинуть( НовИД, -(НовИД-СтарИД)+СдвигПоКолСтрок );
			СдвигПоКолСтрок = СдвигПоКолСтрок + 1;
			
		КонецЦикла; 
		
		// Сравним, суммы (до разделения и после), если есть разница создаем новую строку:
		Если (СтарСумм.Цена - НакоплСумм.Цена) <> 0
			ИЛИ (СтарСумм.Сумма - НакоплСумм.Сумма) <> 0
			ИЛИ (СтарСумм.СуммаНДС - НакоплСумм.СуммаНДС) <> 0
			ИЛИ (СтарСумм.Всего - НакоплСумм.Всего <> 0) Тогда
		
			НовСтр = УслугиИзПТУ.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, ТекСтрДоРазделения);
			НовСтр.ТекУИДСтроки = Строка(Новый УникальныйИдентификатор);
			
			НовСтр.Цена = (СтарСумм.Цена - НакоплСумм.Цена);
			НовСтр.Сумма = (СтарСумм.Сумма - НакоплСумм.Сумма);
			НовСтр.СуммаНДС = (СтарСумм.СуммаНДС - НакоплСумм.СуммаНДС);
			НовСтр.Всего = (СтарСумм.Всего - НакоплСумм.Всего);
			// Подставляем параметрдля переноса остатка в акцепт
			// Иначе данная строка будет пропущена
			НовСтр.ВыполненПоискЗатрат = Истина;
			
			// Сдвиг:
			НовИД = НовСтр.ПолучитьИдентификатор();
			СтарИД = ДопПараметры.ИД_Строки;
			                      
			УслугиИзПТУ.Сдвинуть( НовИД, -(НовИД-СтарИД)+СдвигПоКолСтрок );
		
		КонецЕсли; 
		
		// Удалить строку, которая до разделения:
		УслугиИзПТУ.Удалить( ТекСтрДоРазделения );
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьСтроку(ТекСтр, ТекЗагрСтр, ОпЧисла, ОпДата, ПереданноеВсего=0)
	
	Если ТекЗагрСтр.Кол1 <> "" Тогда
		
		ТекСтр.СписокТД = ТекЗагрСтр.Кол1;
		
	КонецЕсли; 
	
	Если ТекЗагрСтр.Кол2 <> "" Тогда
		// Номенклатуру не трогаем
		
		
	КонецЕсли; 
	
	Если ТекЗагрСтр.Кол3 <> "" Тогда
		
		ТекСтр.СписокТС = ТекЗагрСтр.Кол3;
		
	КонецЕсли;
	
	Если ТекЗагрСтр.Кол4 <> "" Тогда
		// кт
		ТекСтр.СписокТЕ = ТекЗагрСтр.Кол4;
		
	КонецЕсли;
	
	Если ТекЗагрСтр.Кол5 <> "" Тогда
		//сум
		НовВсего = ОпЧисла.ПривестиЗначение(ТекЗагрСтр.Кол5);
		Если НовВсего <> 0 Тогда
			
			ПереданноеВсего = НовВсего;
			
			ТекСтр.Всего = НовВсего;
			//++ Зубов А.С., 0235390, 01.07.2021
			//ТекСтр.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(ТекСтр.Всего, БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСтавкуНДС(ТекСтр.СтавкаНДС), УчитыватьНДС, СуммаВключаетНДС);
			ТекСтр.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(ТекСтр.Всего, БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСтавкуНДС(ТекСтр.СтавкаНДС), УчитыватьНДС, Истина);
			//-- Зубов А.С., 0235390, 01.07.202
			Если СуммаВключаетНДС Тогда
				
				ТекСтр.Сумма = ТекСтр.Всего;
				
			Иначе
				
				ТекСтр.Сумма = ТекСтр.Всего - ТекСтр.СуммаНДС;
				
			КонецЕсли; 
			
			ТекСтр.Цена = ТекСтр.Сумма / ?(ТекСтр.Количество=0, 1, ТекСтр.Количество);
			
		КонецЕсли; 
		
	КонецЕсли;
	
	Если ТекЗагрСтр.Кол6 <> "" Тогда
		// буд Сделка
		ТекСтр.БудНомерСделки = ТекЗагрСтр.Кол6;
		
	КонецЕсли;
	
	Если ТекЗагрСтр.Кол7 <> "" Тогда
		// дата отпр КП
		ТекСтр.ДатаКП = ПолучитьДатуИзТекста(ТекЗагрСтр.Кол7, ОпДата);
		
	КонецЕсли;
	
	Если ТекЗагрСтр.Кол8 <> "" Тогда
		// Станц. отпр
		НовСт = Локации_сервер.ПолучитьЛокациюПоНечеткомуПоиску(ТекЗагрСтр.Кол8, Истина);
		
		Если НовСт <> ТекСтр.СтанцияОтправления И ЗначениеЗаполнено(НовСт) Тогда
			
			ТекСтр.СтанцияОтправления = НовСт;
			
		КонецЕсли; 
		
	КонецЕсли;
	
	Если ТекЗагрСтр.Кол9 <> "" Тогда
		// Станц. отпр
		НовСт = Локации_сервер.ПолучитьЛокациюПоНечеткомуПоиску(ТекЗагрСтр.Кол9, Истина);
		
		Если НовСт <> ТекСтр.СтанцияНазначения И ЗначениеЗаполнено(НовСт) Тогда
			
			ТекСтр.СтанцияНазначения = НовСт;
			
		КонецЕсли; 
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ПолучитьДатуИзТекста(Текст, ОпДата)

	Рез1 = СтрЗаменить(Текст, ".", Символы.ПС);
	Рез2 = СтрЗаменить(Рез1, "/", Символы.ПС);
	Рез3 = СтрЗаменить(Рез2, "\", Символы.ПС);
	Рез4 = СтрЗаменить(Рез3, ",", Символы.ПС);
	Рез5 = СтрЗаменить(Рез4, "-", Символы.ПС);

	Если СтрЧислоСтрок(Рез5) < 3 Тогда
	
		ТекДата = Дата(1,1,1);
	
	Иначе
		
		Д = СокрЛП(СтрПолучитьСтроку(Рез5, 1));
		М = СокрЛП(СтрПолучитьСтроку(Рез5, 2));
		Г = СокрЛП(СтрПолучитьСтроку(Рез5, 3));
		              
		ТекДата = ОпДата.ПривестиЗначение(""+Г+М+Д+"000000");
	
	КонецЕсли; 
	
	Возврат ТекДата;
	
КонецФункции

&НаКлиенте
Процедура ПолнаяОтмена(Команда)
	
	РезультатПоиска.Очистить();
	
	Элементы.ДетализацияПоиска.ТолькоПросмотр = Истина; 
	
	Элементы.ОбъектУслугиРазделитьСтроки.Доступность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискСделкиКТК(Команда)
	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьПоискСделок(Команда)
	
	Элементы.ГруппаРаботаРазнесения.ТекущаяСтраница = Элементы.ГруппаПоиск;
	РезультатПоиска.Очистить();
	
	ТекДан = Элементы.УслугиИзПТУ.ТекущиеДанные;
	
	ВыполнитьПоискСделокНаСервере(ТекДан.БудНомерСделки, ТекДан.ТекУИДСтроки, ТекДан.ДатаКП, ТекДан.СтанцияОтправления, ТекДан.СтанцияНазначения);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПоискСделокНаСервере(БудНомерСделки, УИДСтрокиДетализации, ДатаКП, СтОтпр, СтНазн)
	
	Если ЗначениеЗаполнено(БудНомерСделки) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = ЗП_ПоискСделок1();
		
		Запрос.УстановитьПараметр("Ссылка", "");
		Запрос.УстановитьПараметр("НомерЗап", Истина);
		Запрос.УстановитьПараметр("Номер", "%" + БудНомерСделки);
		Запрос.УстановитьПараметр("ДатаН", НачалоГода(Поступление.Дата));
		//Запрос.Выполнить().Выгрузить(); // Запрос.ВыполнитьПакетСПромежуточнымиДанными()[0].Выгрузить();
		Резы = Запрос.ВыполнитьПакет();
		Выборка = Резы[2].Выбрать();
		ТЗ_КТ = Резы[3].Выгрузить();
		ТЗ_ТС = Резы[4].Выгрузить();
		ТЗ_ЖДН= Резы[5].Выгрузить();
		
		Пока Выборка.Следующий() Цикл
			
			Сделка = Выборка.Ссылка;
			
			Стр_КТ = ПолучитьСтрДанные(ТЗ_КТ, Сделка, "Контейнер");
			Стр_ТС = ПолучитьСтрДанные(ТЗ_ТС, Сделка, "Вагон"); 
			Стр_ЖДН= ПолучитьСтрДанные(ТЗ_ЖДН, Сделка, "НомерЖДН"); 
			
			НовСтр = РезультатПоиска.Добавить();
			НовСтр.НомерСделки			= Выборка.НомерСделки;
			НовСтр.ДатаОтправленияКП	= Выборка.ДатаОтправленияКП;
			НовСтр.СтанцияОтправления	= Выборка.СтанцияОтправления;
			НовСтр.СтанцияНазначения	= Выборка.СтанцияНазначения;
			НовСтр.Накладная			= Стр_ЖДН;
			НовСтр.Вагон				= Стр_ТС;
			НовСтр.Контейнер			= Стр_КТ;
			НовСтр.УИДСтрокиДетализации = УИДСтрокиДетализации;
			НовСтр.Сделка				= Сделка;
		
		КонецЦикла;
	
	ИначеЕсли ЗначениеЗаполнено(ДатаКП) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = ЗП_ПоискСделок2();
		
		Запрос.УстановитьПараметр("ДатаН", НачалоГода(Поступление.Дата));
		
		Запрос.УстановитьПараметр("ДатаОтправленияКП_1", ДатаКП-(ДиапазонПоиска*24*3600) );
		Запрос.УстановитьПараметр("ДатаОтправленияКП_2", ДатаКП+(ДиапазонПоиска*24*3600) );
		Запрос.УстановитьПараметр("ИспОтпр", ЗначениеЗаполнено(СтОтпр) );
		Запрос.УстановитьПараметр("СтанцияОтправления", СтОтпр);
		Запрос.УстановитьПараметр("ИспНазн", ЗначениеЗаполнено(СтНазн) );
		Запрос.УстановитьПараметр("СтанцияНазначения", СтНазн);
		
		//Запрос.Выполнить().Выгрузить(); // Запрос.ВыполнитьПакетСПромежуточнымиДанными()[0].Выгрузить();
		Резы = Запрос.ВыполнитьПакет();
		Выборка = Резы[2].Выбрать();
		ТЗ_КТ = Резы[3].Выгрузить();
		ТЗ_ТС = Резы[4].Выгрузить();
		ТЗ_ЖДН= Резы[5].Выгрузить();
		
		Пока Выборка.Следующий() Цикл
			
			Сделка = Выборка.Ссылка;
			
			Стр_КТ = ПолучитьСтрДанные(ТЗ_КТ, Сделка, "Контейнер");
			Стр_ТС = ПолучитьСтрДанные(ТЗ_ТС, Сделка, "Вагон"); 
			Стр_ЖДН= ПолучитьСтрДанные(ТЗ_ЖДН, Сделка, "НомерЖДН"); 
			
			НовСтр = РезультатПоиска.Добавить();
			НовСтр.НомерСделки			= Выборка.НомерСделки;
			НовСтр.ДатаОтправленияКП	= Выборка.ДатаОтправленияКП;
			НовСтр.СтанцияОтправления	= Выборка.СтанцияОтправления;
			НовСтр.СтанцияНазначения	= Выборка.СтанцияНазначения;
			НовСтр.Накладная			= Стр_ЖДН;
			НовСтр.Вагон				= Стр_ТС;
			НовСтр.Контейнер			= Стр_КТ;
			НовСтр.УИДСтрокиДетализации = УИДСтрокиДетализации;
			НовСтр.Сделка				= Сделка;
		
		КонецЦикла;
		
	Иначе
		
		Сообщить("Не заданы критерии поиска (номер сделки/дата отправления КП)!");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗП_ПоискСделок1()

	Текст = "ВЫБРАТЬ ПЕРВЫЕ 20
	        |	Сделка.Ссылка КАК Ссылка,
	        |	Сделка.Номер КАК НомерСделки,
	        |	СделкаРейсы.Рейс КАК Рейс,
	        |	СделкаРейсы.Рейс.ДатаОтправления КАК ДатаОтправленияКП,
	        |	СделкаРейсы.Рейс.ПунктОтправления КАК СтанцияОтправления,
	        |	СделкаРейсы.Рейс.ПунктНазначения КАК СтанцияНазначения
	        |ПОМЕСТИТЬ Сделки
	        |ИЗ
	        |	Документ.Сделка.Рейсы КАК СделкаРейсы
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
	        |		ПО СделкаРейсы.Ссылка = Сделка.Ссылка
	        |ГДЕ
	        |	(НЕ &НомерЗап И Сделка.Ссылка = &Ссылка) ИЛИ (&НомерЗап И Сделка.Номер ПОДОБНО &Номер
	        |	И Сделка.Дата >= &ДатаН)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Сделки.Ссылка КАК Ссылка,
	        |	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	        |	СделкаСвязьУчетныхЕдиниц.Вагон КАК Вагон,
	        |	СделкаСвязьУчетныхЕдиниц.НомерЖДН КАК НомерЖДН
	        |ПОМЕСТИТЬ УчЕдСделок
	        |ИЗ
	        |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Сделки КАК Сделки
	        |		ПО СделкаСвязьУчетныхЕдиниц.Ссылка = Сделки.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Сделки.Ссылка КАК Ссылка,
	        |	Сделки.НомерСделки КАК НомерСделки,
	        |	Сделки.Рейс КАК Рейс,
	        |	Сделки.ДатаОтправленияКП КАК ДатаОтправленияКП,
	        |	Сделки.СтанцияОтправления КАК СтанцияОтправления,
	        |	Сделки.СтанцияНазначения КАК СтанцияНазначения
	        |ИЗ
	        |	Сделки КАК Сделки
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	УчЕдСделок.Ссылка КАК Ссылка,
	        |	УчЕдСделок.Контейнер КАК Контейнер
	        |ИЗ
	        |	УчЕдСделок КАК УчЕдСделок
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	УчЕдСделок.Ссылка,
	        |	УчЕдСделок.Контейнер
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	УчЕдСделок.Ссылка КАК Ссылка,
	        |	УчЕдСделок.Вагон КАК Вагон
	        |ИЗ
	        |	УчЕдСделок КАК УчЕдСделок
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	УчЕдСделок.Ссылка,
	        |	УчЕдСделок.Вагон
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	УчЕдСделок.Ссылка КАК Ссылка,
	        |	УчЕдСделок.НомерЖДН КАК НомерЖДН
	        |ИЗ
	        |	УчЕдСделок КАК УчЕдСделок
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	УчЕдСделок.Ссылка,
	        |	УчЕдСделок.НомерЖДН";
	
	Возврат Текст;

КонецФункции // ()

&НаСервере
Функция ЗП_ПоискСделок2()

	Текст = "ВЫБРАТЬ ПЕРВЫЕ 20
	        |	Сделка.Ссылка КАК Ссылка,
	        |	Сделка.Номер КАК НомерСделки,
	        |	СделкаРейсы.Рейс КАК Рейс,
	        |	СделкаРейсы.Рейс.ДатаОтправления КАК ДатаОтправленияКП,
	        |	СделкаРейсы.Рейс.ПунктОтправления КАК СтанцияОтправления,
	        |	СделкаРейсы.Рейс.ПунктНазначения КАК СтанцияНазначения
	        |ПОМЕСТИТЬ Сделки
	        |ИЗ
	        |	Документ.Сделка.Рейсы КАК СделкаРейсы
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
	        |		ПО СделкаРейсы.Ссылка = Сделка.Ссылка
	        |ГДЕ
	        |	НАЧАЛОПЕРИОДА(СделкаРейсы.Рейс.ДатаОтправления, ДЕНЬ) МЕЖДУ &ДатаОтправленияКП_1 И &ДатаОтправленияКП_2
	        |	И (&ИспОтпр
	        |				И СделкаРейсы.Рейс.ПунктОтправления = &СтанцияОтправления
	        |			ИЛИ НЕ &ИспОтпр)
	        |	И (&ИспНазн
	        |				И СделкаРейсы.Рейс.ПунктНазначения = &СтанцияНазначения
	        |			ИЛИ НЕ &ИспНазн)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Сделки.Ссылка КАК Ссылка,
	        |	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	        |	СделкаСвязьУчетныхЕдиниц.Вагон КАК Вагон,
	        |	СделкаСвязьУчетныхЕдиниц.НомерЖДН КАК НомерЖДН
	        |ПОМЕСТИТЬ УчЕдСделок
	        |ИЗ
	        |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Сделки КАК Сделки
	        |		ПО СделкаСвязьУчетныхЕдиниц.Ссылка = Сделки.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Сделки.Ссылка КАК Ссылка,
	        |	Сделки.НомерСделки КАК НомерСделки,
	        |	Сделки.Рейс КАК Рейс,
	        |	Сделки.ДатаОтправленияКП КАК ДатаОтправленияКП,
	        |	Сделки.СтанцияОтправления КАК СтанцияОтправления,
	        |	Сделки.СтанцияНазначения КАК СтанцияНазначения
	        |ИЗ
	        |	Сделки КАК Сделки
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	УчЕдСделок.Ссылка КАК Ссылка,
	        |	УчЕдСделок.Контейнер КАК Контейнер
	        |ИЗ
	        |	УчЕдСделок КАК УчЕдСделок
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	УчЕдСделок.Ссылка,
	        |	УчЕдСделок.Контейнер
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	УчЕдСделок.Ссылка КАК Ссылка,
	        |	УчЕдСделок.Вагон КАК Вагон
	        |ИЗ
	        |	УчЕдСделок КАК УчЕдСделок
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	УчЕдСделок.Ссылка,
	        |	УчЕдСделок.Вагон
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	УчЕдСделок.Ссылка КАК Ссылка,
	        |	УчЕдСделок.НомерЖДН КАК НомерЖДН
	        |ИЗ
	        |	УчЕдСделок КАК УчЕдСделок
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	УчЕдСделок.Ссылка,
	        |	УчЕдСделок.НомерЖДН";
	
	Возврат Текст;

КонецФункции // ()

&НаСервереБезКонтекста
Функция ПолучитьСтрДанные(ТЗ, Сделка, ПолеГруппировки)

	РезСтр = "";
	
	ИСК_Мас = ТЗ.НайтиСтроки(Новый Структура("Ссылка", Сделка) );

	Для каждого СтрМас Из ИСК_Мас Цикл
	
		Если РезСтр = "" Тогда
		
			РезСтр = Строка(СтрМас[ПолеГруппировки]);
		
		Иначе
		
			РезСтр = РезСтр+","+Строка(СтрМас[ПолеГруппировки]);
		
		КонецЕсли; 
	
	КонецЦикла; 
	
	Возврат РезСтр;
	
КонецФункции // ()

&НаКлиенте
Процедура ВыбратьСделку(Команда)
	
	ТекДанВыбор = Элементы.РезультатПоиска.ТекущиеДанные;
	
	ТекДан = Элементы.УслугиИзПТУ.ТекущиеДанные;
	ТекДан.Сделка = ТекДанВыбор.Сделка;
	ТекДан.СписокТС = ТекДанВыбор.Вагон;
	ТекДан.СписокТЕ = ТекДанВыбор.Контейнер;
	ТекДан.СписокТД = ТекДанВыбор.Накладная;
	ТекДан.ВыполненПоискЗатрат = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПоискаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбратьСделку("");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиИзПТУПриАктивизацииСтроки(Элемент)
	
	РезультатПоиска.Очистить();
	
	ТекДан = Элементы.УслугиИзПТУ.ТекущиеДанные;
	
	//ОтборСтрок = Новый Структура("ИдентификаторСтрокиПоступления", ТекДан.ГУИДПТУ) ;
	//Элементы.ДетализацияАкцепта.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
	Если ТекДан <> Неопределено Тогда
		
		ДетализацияАкцепта.Параметры.УстановитьЗначениеПараметра("УИДПоступления", ТекДан.ГУИДПТУ);
		ДетализацияАкцепта.Параметры.УстановитьЗначениеПараметра("УИДПоступленияЗап", Истина);
		ДетализацияАкцепта.Параметры.УстановитьЗначениеПараметра("Сделка", ТекДан.Сделка);
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьАкцепт(Команда)
	
	Отказ = Ложь; опОтказа = "";
	ПерезаполнитьАкцептСервер(Отказ, опОтказа);
	
	Если Отказ И опОтказа <> "" Тогда
	
		Сообщить( опОтказа );
	
	КонецЕсли; 
	
	Если Не Отказ Тогда
	
		АкцептАктуализирован = Истина;
	
	КонецЕсли; 
	
КонецПроцедуры

// взято из процедуры процедуры модульОбъекта Акцепт "ЗаполнитьУслуги"
&НаСервере
Процедура ПерезаполнитьАкцептСервер(Отказ, опОтказа)

	ОбАкцепт = Акцепт.ПолучитьОбъект();
	
	ТЧ_ДоОбр = ОбАкцепт.Услуги.Выгрузить(); 
	ТЗСтрокиДляУдаления = УслугиИзПТУ.Выгрузить(,"ТекУИДСтроки"); // ДИТ Поморцева Т.П. Задача 34197 18.02.22.
	
	ОбАкцепт.Услуги.Очистить();
	
	// ДИТ Шевченко А.В. Задача 54792 21.07.22. начало
	МассивГУИДОВПерезаполеныхСтрокПТУ = Новый Массив; 
	// ДИТ Шевченко А.В. Задача 54792 21.07.22. конец
	
	Для каждого Выборка Из УслугиИзПТУ Цикл	
		
		Если Выборка.ВыполненПоискЗатрат И НЕ Выборка.УспехРазнесения Тогда
			
			// ДИТ Шевченко А.В. Задача 54792 21.07.22. начало
			МассивГУИДОВПерезаполеныхСтрокПТУ.Добавить(Выборка.ГУИДПТУ);
			// ДИТ Шевченко А.В. Задача 54792 21.07.22. конец
			
			МассивТС = СтрРазделить(Выборка.СписокТС, ";", Ложь);
			МассивТЕ = СтрРазделить(Выборка.СписокТЕ, ";", Ложь);
			
			НомерНакладной = СокрЛП(Выборка.СписокТД);
			//ТранспортныйДокумент = ТранспортныеДокументы_сервер.НайтиТранспортныйДокумент(НомерНакладной, Перечисления.ВидыОперацийТранспортныхДокументов.ЖДНакладная);
			
			//Евросиб Каблов 08.11.2022 ( Ticket#0288446
			//ТЗбудСтрокиАкц = Выборка.Сделка.СвязьУчетныхЕдиниц.Выгрузить(, "Контейнер, Вагон, НомерЖДН, ЖДН");
			ТЗбудСтрокиАкц = Выборка.Сделка.СвязьУчетныхЕдиниц.Выгрузить(, "Контейнер, Вагон, НомерЖДН, ЖДН, ВидТранспортногоСообщения");
			СтрокиМоре = ТЗбудСтрокиАкц.НайтиСтроки(Новый Структура("ВидТранспортногоСообщения", Перечисления.ВидыТранспортныхСообщений.Море));
			Для Каждого СтрокаМоре Из СтрокиМоре Цикл
				ТЗбудСтрокиАкц.Удалить(СтрокаМоре);
			КонецЦикла;
			//Евросиб Каблов 08.11.2022 )
			
			КоличествоСтрок = ТЗбудСтрокиАкц.Количество();
			КоличествоСтрок = ?(КоличествоСтрок=0, 1, КоличествоСтрок);
			
			// ДИТ Поморцева Т.П. Задача 34197 18.02.22. начало
			//СуммаПоСтроке = Окр(Выборка.Всего / КоличествоСтрок, 2);
			СуммаПоСтроке = Окр(Выборка.Сумма / КоличествоСтрок, 2);
			// ДИТ Поморцева Т.П. Задача 34197 18.02.22. конец
			СуммаНДСПоСтроке = Окр(Выборка.СуммаНДС / КоличествоСтрок, 2);
			
			ЦенаПоСтроке = Окр(Выборка.Цена / КоличествоСтрок, 2);
			
			СуммаИтого = 0;
			СуммаНДСИтого = 0;
			
			Для НомерНовойСтроки = 1 По КоличествоСтрок Цикл
				
				ИндексСтроки = НомерНовойСтроки - 1;
				
				СтрокаУслуг = ОбАкцепт.Услуги.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаУслуг, Выборка, , "Сделка");
				
				СтрокаУслуг.ИдентификаторСтрокиПоступления = Выборка.ГУИДПТУ;
				
				Если ТЗбудСтрокиАкц.Количество() > 0 Тогда
					
					ТекСоотКТ_ТС = ТЗбудСтрокиАкц[ИндексСтроки];
					
					СтрокаУслуг.Контейнер 			= ТекСоотКТ_ТС.Контейнер;
					СтрокаУслуг.Вагон 				= ТекСоотКТ_ТС.Вагон;
					СтрокаУслуг.ТранспортныйДокумент= ТекСоотКТ_ТС.ЖДН;
					
				Иначе
					
					Если НомерНакладной <> "" Тогда
						
						//Евросиб - АСуслов 11.12.2021 15:19:02 #
						//(   
						ДокПоступления = БухгалтерскийУчетПереопределяемый.ПолучитьИсправляемыйДокументПоступления(ЭтотОбъект.Поступление);
						ДатаВходящегоДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокПоступления, "ДатаВходящегоДокумента");
						ТранспортныйДокумент = ТранспортныеДокументы_сервер.НайтиТранспортныйДокумент(НомерНакладной, ДатаВходящегоДокумента, Перечисления.ВидыОперацийТранспортныхДокументов.ЖДНакладная);
						//)
						//Евросиб - АСуслов 11.12.2021 15:19:03 #
						СтрокаУслуг.ТранспортныйДокумент = ТранспортныйДокумент;
						
					КонецЕсли; 
					
				КонецЕсли; 
				
				СтрокаУслуг.ПоступлениеКоличество = 1;
				СтрокаУслуг.ПоступлениеСумма 	= СуммаПоСтроке;
				СтрокаУслуг.ПоступлениеСуммаНДС = СуммаНДСПоСтроке;
				СтрокаУслуг.ПоступлениеЦена 	= ЦенаПоСтроке;
				//Евросиб Каблов 04.03.2022 ( Ticket#0247039
				СтрокаУслуг.ПоступлениеСтавкаНДС = Выборка.СтавкаНДС;
				//Евросиб Каблов 04.03.2022 )
				
				СтрокаУслуг.Количество  = 0;
				СтрокаУслуг.Цена  = 0;
				СтрокаУслуг.Сумма  = 0;
				СтрокаУслуг.СуммаНДС  = 0;
				СтрокаУслуг.ПодтвержденнаяСумма = 0;
				
				СтрокаУслуг.УказаннаяПользователемСделка = Выборка.Сделка;
				
				СуммаИтого = СуммаИтого + СуммаПоСтроке;
				СуммаНДСИтого = СуммаНДСИтого + СуммаНДСПоСтроке;
				
			КонецЦикла;
			
			//++ДИТ Гаузер А.В. Ticket#0281373 12.08.2022
			//РазницаСумм = Выборка.Всего - СуммаИтого;
			РазницаСумм = Выборка.Сумма - СуммаИтого;
			//--ДИТ Гаузер А.В. Ticket#0281373 12.08.2022
			Если РазницаСумм <> 0 Тогда
				СтрокаУслуг.ПоступлениеСумма = СтрокаУслуг.ПоступлениеСумма + РазницаСумм;
			КонецЕсли;
			
			
			РазницаСумм = Выборка.СуммаНДС - СуммаНДСИтого;  
			Если РазницаСумм <> 0 Тогда
				СтрокаУслуг.ПоступлениеСуммаНДС = СтрокаУслуг.ПоступлениеСуммаНДС + РазницаСумм;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаУслуг.ТранспортныйДокумент.НомерТранспортногоДокумента) тогда
				СтрокаУслуг.ВесПоНакладной = ПретензииИНеакцептыСервер.ПолучитьВесНеттоПоНакладной(СтрокаУслуг.ТранспортныйДокумент.НомерТранспортногоДокумента, СтрокаУслуг.Контейнер.Наименование);
			Иначе
				СтрокаУслуг.ВесПоНакладной = ПретензииИНеакцептыСервер.ПолучитьВесНеттоПоНакладной(СокрЛП(Выборка.СписокТД), СтрокаУслуг.Контейнер.Наименование);
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	// Добавляем старые строки, которые мы не обрабатывали:
	Для каждого Стр Из ТЧ_ДоОбр Цикл
		
		// ДИТ Шевченко А.В. Задача 54792 21.07.22. начало
		//ИскМас = ОбАкцепт.Услуги.НайтиСтроки(Новый Структура("ИдентификаторСтрокиПоступления", Стр.ИдентификаторСтрокиПоступления) );
		//ИскМас = ОбАкцепт.Услуги.НайтиСтроки(Новый Структура("ГУИД", Стр.ГУИД) );
		//Если ИскМас.Количество() = 0 Тогда		
		//	НовСтр = ОбАкцепт.Услуги.Добавить();
		//	ЗаполнитьЗначенияСвойств(НовСтр, Стр);	
		//КонецЕсли;
		Если МассивГУИДОВПерезаполеныхСтрокПТУ.Найти(Стр.ИдентификаторСтрокиПоступления) = Неопределено Тогда
			НовСтр = ОбАкцепт.Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		КонецЕсли;
		// ДИТ Шевченко А.В. Задача 54792 21.07.22. Конец
	КонецЦикла; 
	
	Попытка
	
		ОбАкцепт.Записать();
	
	Исключение
	    Отказ = Истина;
		опОтказа = ОписаниеОшибки();
	КонецПопытки; 
	
КонецПроцедуры

&НаКлиенте
Процедура РазнестиЗатраты(Команда)
	
	Если Не АкцептАктуализирован Тогда
	
		Сообщить("Требуется выполнить пункт № 1 перед разнесением в сделку");
		Возврат;
	
	КонецЕсли; 
	
	РазнестиЗатратыПоискПлановых();
	
КонецПроцедуры

&НаСервере
Процедура РазнестиЗатратыПоискПлановых()

	ПретензииИНеакцептыСервер.РазнестиПТУ(Поступление, Истина);
	
	ПроверитьРазнесение();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьАкцепт(Команда)
	
	Если Элементы.ГруппаРаботаРазнесения.ТекущаяСтраница = Элементы.ГруппаПоиск Тогда
	
		Элементы.ГруппаРаботаРазнесения.ТекущаяСтраница = Элементы.ГруппаДетализация;
		
	Иначе
		
		Элементы.ГруппаРаботаРазнесения.ТекущаяСтраница = Элементы.ГруппаПоиск;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияВСделку(П1 = неопределено, ДопПарам = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	
	//Евросиб Каблов 17.09.2021 ( Ticket#0237622	
	//ТекПольз = ПользователиКлиент.ТекущийПользователь();
	////
	//ОбработкаДобавленияВСделкуСерв(П1, ТекПольз, ДопПарам);
	
	ЗаписатьДанныеВСделкуИАкцептСервер(П1.Сделка, П1.АдресТаблицы);
	//Евросиб Каблов 17.09.2021 )
	
КонецПроцедуры

//Евросиб Каблов 18.09.2021 Ticket#0237622
&НаСервере
Процедура ЗаписатьДанныеВСделкуИАкцептСервер(Сделка, АдресТаблицы)
	
	НачатьТранзакцию();
	
	//Заполнение и запись Сделки
	СделкаОбъект = Сделка.ПолучитьОбъект();
	ТаблицаДанных = ПолучитьИзВременногоХранилища(АдресТаблицы);
	
	РаботаСоСделкамиСервер.ДобавитьСтрокиРасходовВСделку(СделкаОбъект, ТаблицаДанных);
	СделкаОбъект.ДополнительныеСвойства.Вставить("ЗаписьИзАкцепта");
	// ДИТ Поморцва Т.П. Задача 243097 16.09.21. начало
	//СделкаОбъект.Записать();
	УстановитьПривилегированныйРежим(Истина);
	СделкаОбъект.Записать();
	РаботаСоСделкамиСервер.СформироватьДвиженияРазнесенияЗатратПТУ(СделкаОбъект);
	СделкаОбъект.Движения.РазнесениеЗатратПТУ.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	// ДИТ Поморцва Т.П. Задача 243097 16.09.21. конец
	
	АкцептОбъект = Акцепт.ПолучитьОбъект();
	//Заполнение и запись ацепта
	Для каждого Стр из ТаблицаДанных Цикл
		
		//Евросиб Каблов 13.09.2022 ( 57446
		//Стр2 = АкцептОбъект.Услуги[Стр.ИсходныйНомерСтроки-1];
		Стр2 = АкцептОбъект.Услуги.Найти(СТр.ИдентификаторСтрокиАкцепта, "ГУИД");
		Если Стр2 = Неопределено Тогда
			ВызватьИсключение "Не удалось добавить расходы в сделку! Акцепт был изменен другим пользователем.";
		КонецЕсли;
		//Евросиб Каблов 13.09.2022 )
			
		Стр2.ИдентификаторСтрокиРасходовВСделке = Стр.ГУИДРасходов;
		Стр2.Сделка = Сделка;
		Стр2.ПолностьюРазнесено = ЗначениеЗаполнено(Сделка);
		Если ЗначениеЗаполнено(Сделка) Тогда
			Стр2.ПривязалПользователь = ПользователиКлиентСервер.ТекущийПользователь();
		Иначе
			Стр2.ПривязалПользователь = Неопределено;
		КонецЕсли;
		
		Стр2.Сумма = Стр2.ПоступлениеСумма;
		Стр2.СуммаНДС = Стр2.ПоступлениеСуммаНДС;
			
	КонецЦикла;
	
	ДополнитьДанные_Сервер(АкцептОбъект, Истина);
	
	АкцептОбъект.СуммаАкцепта = АкцептОбъект.Услуги.Итог("Сумма");
	АкцептОбъект.СуммаНДСАкцепта = АкцептОбъект.Услуги.Итог("СуммаНДС");
	
	Попытка
		АкцептОбъект.Записать(РежимЗаписиДокумента.Проведение);
		ЗафиксироватьТранзакцию();
		Сообщить("Данные сделки " + СделкаОбъект.Ссылка + " и акцепта обновлены!");
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение "Не удалось добавить данные в сделку!";
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьДанные_Сервер(Об, ИзменятьДанные=Неопределено)
	
	//Евросиб Каблов 02.09.2021 ( 	
	//Для каждого Стр из Об.Услуги Цикл
	//	
	//	//Евросиб Каблов 09.07.2021 ( Ticket#0235935
	//	//ПретензииИНеакцептыСервер.ДополнитьСтрокуАкцептаДаннымиСделки(Стр, ИзменятьДанные);
	//	ПретензииИНеакцептыСервер.ДополнитьСтрокуАкцептаДаннымиСделки(Стр, ИзменятьДанные, Об.ПериодВО);
	//	//Евросиб Каблов 09.07.2021 ) 
	//			
	//	//// Обновить данные по арм контроля списаний
	//	//Стр.СуммаРасходовИзАРМКонтроляСписанийИзРегистра  = Услуги_сервер.ПолучитьСуммуАРМКонтроляСписаний(Стр.Сделка, Стр.ИдентификаторСтрокиРасходовВСделке, Стр.СделкаКТК, Стр.Номенклатура);
	//	//Стр.РазницаАРМКСиСуммаИтого = (Стр.ПоступлениеСумма - Стр.СуммаРасходовИзАРМКонтроляСписанийИзРегистра);
	//	//Стр.ЕстьРазница = (Стр.ПоступлениеСумма > 0 И Стр.СуммаРасходовИзАРМКонтроляСписанийИзРегистра > 0 И Стр.ПоступлениеСумма <> Стр.СуммаРасходовИзАРМКонтроляСписанийИзРегистра);
	//	
	//КонецЦикла;
	ПериодАкцепта = Мин(Об.ПериодВО, Об.ПериодБУ);
	ПретензииИНеакцептыСервер.ДополнитьСтрокиАкцептовДаннымиСделки(Об, ИзменятьДанные, ПериодАкцепта);
	//Евросиб Каблов 02.09.2021 )
	
КонецПроцедуры

&НаКлиенте
Функция СобратьМассивВыделенныхСтрок()
	
	Результат = Новый Массив;
	
	ТекСтрПТУ = Элементы.УслугиИзПТУ.ТекущиеДанные;
	
	Если ТекСтрПТУ = Неопределено Тогда
	
		Сообщить("Выделите строку!");
		Возврат Результат;
	
	КонецЕсли; 
	
	РеквизитыПТУ = ОбщегоНазначенияКлиент.ЗначенияРеквизитовОбъекта(Поступление, "ВалютаДокумента, Контрагент, ДоговорКонтрагента");
	
	ЗапРезультатыНаСерв(Новый Структура("ГУИДПТУ, Сделка", ТекСтрПТУ.ГУИДПТУ, ТекСтрПТУ.Сделка) , РеквизитыПТУ, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗапРезультатыНаСерв(Парам, РеквизитыПТУ, Результат)

	МасСтр = Акцепт.Услуги.НайтиСтроки(Новый Структура("ИдентификаторСтрокиПоступления, УказаннаяПользователемСделка", Парам.ГУИДПТУ, Парам.Сделка) );
	
	Для каждого Стр из МасСтр Цикл
		
		НайдСтрока = Стр;
		
		Результат.Добавить(Новый Структура(
		//Евросиб Каблов 13.09.2022 ( 57446
		//"СодержаниеАкцепт, ПТУ, Услуга, Количество, КТК, Вагон, ТД, СтавкаНДС, НДСВключенВСтоимость, СтавкаНДСВознаграждения, ВознаграждениеВключаетНДС, Себестоимость, СебестоимостьИтого, Ставка, СтавкаИтого, СуммаНДС, СуммаИтого, Валюта, Расходы_Поставщик, Расходы_Договор, Расходы_Услуга, ПунктОтправления, ПунктНазначения, Расходы_СтавкаНДС, Расходы_НДСВключенВСтоимость, Расходы_Количество, Расходы_Валюта, ИсходныйНомерСтроки", 
		"СодержаниеАкцепт, ПТУ, Услуга, Количество, КТК, Вагон, ТД, СтавкаНДС, НДСВключенВСтоимость, СтавкаНДСВознаграждения, ВознаграждениеВключаетНДС, Себестоимость, СебестоимостьИтого, Ставка, СтавкаИтого, СуммаНДС, СуммаИтого, Валюта, Расходы_Поставщик, Расходы_Договор, Расходы_Услуга, ПунктОтправления, ПунктНазначения, Расходы_СтавкаНДС, Расходы_НДСВключенВСтоимость, Расходы_Количество, Расходы_Валюта, ИдентификаторСтрокиАкцепта",
		//Евросиб Каблов 13.09.2022 )
		НайдСтрока.Содержание, 
		Акцепт.Поступление,
		НайдСтрока.Номенклатура, 
		НайдСтрока.ПоступлениеКоличество, 
		НайдСтрока.Контейнер, 
		НайдСтрока.Вагон, 
		НайдСтрока.ТранспортныйДокумент,
		НайдСтрока.ПоступлениеСтавкаНДС,
		Акцепт.СуммаВключаетНДС,
		НайдСтрока.ПоступлениеСтавкаНДС,
		Акцепт.СуммаВключаетНДС,
		НайдСтрока.ПоступлениеЦена,
		НайдСтрока.ПоступлениеСумма,
		НайдСтрока.ПоступлениеЦена,
		НайдСтрока.ПоступлениеСумма,
		НайдСтрока.ПоступлениеСуммаНДС,
		НайдСтрока.ПоступлениеСумма,
		РеквизитыПТУ.ВалютаДокумента,
		РеквизитыПТУ.Контрагент,
		РеквизитыПТУ.ДоговорКонтрагента,
		НайдСтрока.Номенклатура,
		НайдСтрока.СтанцияОтправления,
		НайдСтрока.СтанцияНазначения,
		НайдСтрока.ПоступлениеСтавкаНДС,
		Акцепт.СуммаВключаетНДС,
		НайдСтрока.ПоступлениеКоличество, 
		РеквизитыПТУ.ВалютаДокумента,
		//Евросиб Каблов 13.09.2022 ( 57446
		//НайдСтрока.НомерСтроки		// Используем вместо "ИсходныйномерСтроки"
		НайдСтрока.ГУИД
		//Евросиб Каблов 13.09.2022 )
		));
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВСобственныеЗатраты(Команда)
	
	ТекДан_УслугиИзПТУ = Элементы.УслугиИзПТУ.ТекущиеДанные;
	
	Если ТекДан_УслугиИзПТУ = Неопределено Тогда
	
		Сообщить("Требуется выделить строку ПТУ!");
		Возврат;
	
	КонецЕсли; 
	ПарамОпОп = Новый Структура("УслугиИзПТУ_Строка", ТекДан_УслугиИзПТУ.ПолучитьИдентификатор() );
	
	МассивВыделенныхСтрок = СобратьМассивВыделенныхСтрок();
	Если МассивВыделенныхСтрок.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Выделите строки для переноса и повторите попытку!");
		Возврат;
	КонецЕсли;
	ОпОп = Новый ОписаниеОповещения("ОбработкаДобавленияВСделку", ЭтаФорма, ПарамОпОп);
	ОткрытьФорму("Документ.Сделка.Форма.ФормаДобавленияРасходовВСделку", Новый Структура("РасходыСобственныеЗатраты, СписокСтрок", Истина, МассивВыделенныхСтрок),,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДохРасходыДопУслугой(Команда)
	
	ТекДан_УслугиИзПТУ = Элементы.УслугиИзПТУ.ТекущиеДанные;
	
	Если ТекДан_УслугиИзПТУ = Неопределено Тогда
	
		Сообщить("Требуется выделить строку ПТУ!");
		Возврат;
	
	КонецЕсли; 
	ПарамОпОп = Новый Структура("УслугиИзПТУ_Строка", ТекДан_УслугиИзПТУ.ПолучитьИдентификатор() );
	
	МассивВыделенныхСтрок = СобратьМассивВыделенныхСтрок();
	Если МассивВыделенныхСтрок.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Выделите строки для переноса и повторите попытку!");
		Возврат;
	КонецЕсли;
	ОпОп = Новый ОписаниеОповещения("ОбработкаДобавленияВСделку", ЭтаФорма, ПарамОпОп);
	ОткрытьФорму("Документ.Сделка.Форма.ФормаДобавленияРасходовВСделку", Новый Структура("ДоходыРасходыОтдельнойУслугой, СписокСтрок", Истина, МассивВыделенныхСтрок),,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВозмещаемыеДоходыРасходы(Команда)
	
	ТекДан_УслугиИзПТУ = Элементы.УслугиИзПТУ.ТекущиеДанные;
	
	Если ТекДан_УслугиИзПТУ = Неопределено Тогда
	
		Сообщить("Требуется выделить строку ПТУ!");
		Возврат;
	
	КонецЕсли; 
	ПарамОпОп = Новый Структура("УслугиИзПТУ_Строка", ТекДан_УслугиИзПТУ.ПолучитьИдентификатор() );
	
	МассивВыделенныхСтрок = СобратьМассивВыделенныхСтрок();
	Если МассивВыделенныхСтрок.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Выделите строки для переноса и повторите попытку!");
		Возврат;
	КонецЕсли;
	ОпОп = Новый ОписаниеОповещения("ОбработкаДобавленияВСделку", ЭтаФорма, ПарамОпОп);
	ОткрытьФорму("Документ.Сделка.Форма.ФормаДобавленияРасходовВСделку", Новый Структура("ВозмДоходыРасходы, СписокСтрок, ИнтерактивноеОткрытия", Истина, МассивВыделенныхСтрок, Истина),,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРасходыПоКлиенту(Команда)
	
	ТекДан_УслугиИзПТУ = Элементы.УслугиИзПТУ.ТекущиеДанные;
	
	Если ТекДан_УслугиИзПТУ = Неопределено Тогда
	
		Сообщить("Требуется выделить строку ПТУ!");
		Возврат;
	
	КонецЕсли; 
	ПарамОпОп = Новый Структура("УслугиИзПТУ_Строка", ТекДан_УслугиИзПТУ.ПолучитьИдентификатор() );
	
	МассивВыделенныхСтрок = СобратьМассивВыделенныхСтрок();
	Если МассивВыделенныхСтрок.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Выделите строки для переноса и повторите попытку!");
		Возврат;
	КонецЕсли;
	ОпОп = Новый ОписаниеОповещения("ОбработкаДобавленияВСделку", ЭтаФорма, ПарамОпОп);
	ОткрытьФорму("Документ.Сделка.Форма.ФормаДобавленияРасходовВСделку", Новый Структура("РасходыПоПеревозкеКлиента, СписокСтрок", Истина, МассивВыделенныхСтрок),,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиИзПТУСделкаПриИзменении(Элемент)
	
	ТекДан = Элементы.УслугиИзПТУ.ТекущиеДанные;
	
	ДанСделки = ПолучитьДанныеСделки(ТекДан.Сделка);
	
	ЗаполнитьЗначенияСвойств(ТекДан, ДанСделки);
	
	ТекДан.ВыполненПоискЗатрат = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеСделки(Сделка)
	
	Рез = Новый Структура("Сделка, СписокТС, СписокТЕ, СписокТД");
	
	Запрос = Новый Запрос;
	Запрос.Текст = ЗП_ПоискСделок1();
	
	Запрос.УстановитьПараметр("Ссылка", Сделка);
	Запрос.УстановитьПараметр("НомерЗап", Ложь);
	Запрос.УстановитьПараметр("Номер", "");
	Запрос.УстановитьПараметр("ДатаН", "");
	
	Резы = Запрос.ВыполнитьПакет();
	
	Выборка = Резы[2].Выбрать();
	ТЗ_КТ = Резы[3].Выгрузить();
	ТЗ_ТС = Резы[4].Выгрузить();
	ТЗ_ЖДН= Резы[5].Выгрузить();
	
	Пока Выборка.Следующий() Цикл
		
		Стр_КТ = ПолучитьСтрДанные(ТЗ_КТ, Сделка, "Контейнер");
		Стр_ТС = ПолучитьСтрДанные(ТЗ_ТС, Сделка, "Вагон"); 
		Стр_ЖДН= ПолучитьСтрДанные(ТЗ_ЖДН, Сделка, "НомерЖДН"); 
		
		Рез.Сделка = Сделка;
		Рез.СписокТС = Стр_ТС;
		Рез.СписокТЕ = Стр_КТ;
		Рез.СписокТД = Стр_ЖДН;
		
	КонецЦикла;

	Возврат Рез;
	
КонецФункции

 