
&НаКлиенте
Процедура ЗапроситьДанныеПоКТКВMAERSK(Команда)
	ТЧ.Очистить();
	ЗапроситьДанныеПоКТКВMAERSKНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗапроситьДанныеПоКТКВMAERSKНаСервере()
	
	Результат = ЗагрузкаВнешнихИсточников_сервер.MAERSK_CONT_OR_BILL(Объект.НомерТранспортногоДокумента);
	ЧТДЖ = Новый ЧтениеJSON();
	ЧТДЖ.УстановитьСтроку(Результат);
	РЕЗ = ПрочитатьJSON(ЧТДЖ);
	Для каждого стр из РЕЗ.containers Цикл
		
		НСтр = ТЧ.Добавить();
		//НСтр.ПунктОтправленияКод = РЕЗ.origin.geo_site;
		//НСтр.ПунктОтправления = ЗагрузкаВнешнихИсточников_сервер.ПолучитьЛокациюПоИдентификаторуMAERSK(НСтр.ПунктОтправленияКод);
		//НСтр.ПунктНазначенияКод = РЕЗ.destination.geo_site;
		//НСтр.ПунктНазначения = ЗагрузкаВнешнихИсточников_сервер.ПолучитьЛокациюПоИдентификаторуMAERSK(НСтр.ПунктНазначенияКод);
		//НСтр.НомерКТК = стр.container_num;
		//НСтр.ТипКТК = стр.container_type;
		//НСтр.РазмерКТК = стр.container_size;
		//НСтр.ISO = стр.iso_code;
		//НСтр.ОжидаемаяДоставка = ЗагрузкаВнешнихИсточников_сервер.ПреобразоватьДатуВ1С(стр.eta_final_delivery, 2);
		//НСтр.Статус = стр.status;
		//НСтр.ПоследняяОперация = стр.latest.activity;
		//НСтр.ДатаПоследнейОперации = ЗагрузкаВнешнихИсточников_сервер.ПреобразоватьДатуВ1С(стр.latest.actual_time, 2);
		//НСтр.МестоПоследнейОперацииКод = стр.latest.geo_site;
		//НСтр.МестоПоследнейОперации = ЗагрузкаВнешнихИсточников_сервер.ПолучитьЛокациюПоИдентификаторуMAERSK(стр.latest.geo_site);
		
		Если НЕ ЗначениеЗаполнено(НСтр.МестоПоследнейОперации) Тогда
			НЭлемент = Справочники.Локации.СоздатьЭлемент();
			НЭлемент.ИдентификаторMAERSK = НСтр.МестоПоследнейОперацииКод;
			НЭлемент.Наименование = стр.latest.city;
			НЭлемент.НаименованиеАнгл = НЭлемент.Наименование;
			НЭлемент.Родитель = Справочники.Локации.Загруженные;
			НЭлемент.Страна = Справочники.СтраныМира.НайтиПоРеквизиту("КодАльфа2", стр.latest.country_code);
			НЭлемент.Записать();
			НСтр.МестоПоследнейОперации = НЭлемент.Ссылка;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НСтр.ПунктОтправления) Тогда
			НЭлемент = Справочники.Локации.СоздатьЭлемент();
			НЭлемент.ИдентификаторMAERSK = НСтр.ПунктОтправленияКод;
			НЭлемент.Наименование = РЕЗ.origin.terminal;
			НЭлемент.НаименованиеАнгл = НЭлемент.Наименование;
			НЭлемент.Родитель = Справочники.Локации.Загруженные;
			НЭлемент.Страна = Справочники.СтраныМира.НайтиПоРеквизиту("КодАльфа2", РЕЗ.origin.country_code);
			НЭлемент.Записать();
			НСтр.ПунктОтправления = НЭлемент.Ссылка;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НСтр.ПунктНазначения) Тогда
			НЭлемент = Справочники.Локации.СоздатьЭлемент();
			НЭлемент.ИдентификаторMAERSK = НСтр.ПунктНазначенияКод;
			НЭлемент.Наименование = РЕЗ.destination.terminal;
			НЭлемент.НаименованиеАнгл = НЭлемент.Наименование;
			НЭлемент.Родитель = Справочники.Локации.Загруженные;
			НЭлемент.Страна = Справочники.СтраныМира.НайтиПоРеквизиту("КодАльфа2", РЕЗ.destination.country_code);
			НЭлемент.Записать();
			НСтр.ПунктНазначения = НЭлемент.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьЗакладок()
	
	Элементы.ГруппаЖДН.Видимость = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийТранспортныхДокументов.ЖДНакладная");
	Элементы.ГруппаТН.Видимость = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийТранспортныхДокументов.ТранспортнаяНакладная");
	ЭтоКоносамент = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийТранспортныхДокументов.Коносамент");
	Элементы.ГруппаКС.Видимость = ЭтоКоносамент;
	Элементы.ГруппаКоносамент.Видимость = ЭтоКоносамент;
//Евросиб Гудкова( 02.07.2020 
	Элементы.ГруппаМоре.Видимость = ЭтоКоносамент;
//Евросиб Гудкова( 12.08.2020 Ticket№ 0202630
	КонтрагентПриИзменении(Неопределено);	
// Евросиб Гудкова)   

	// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Начало: 31.10.2024     
	Элементы.ГруппаДанныеМорскогоРейса.Видимость = ЭтоКоносамент;
	Элементы.ГруппаДанныеМорскогоРейса.ТолькоПросмотр = ЭтоКоносамент и ЗначениеЗаполнено(Объект.МорскойРейс);
	Элементы.МорскаяЛиния.ТолькоПросмотр = ЭтоКоносамент и ЗначениеЗаполнено(Объект.МорскойРейс); 
	Элементы.Группа7.Видимость = не ЭтоКоносамент; //группа с датой отправления/прибытия 
	Элементы.Группа11.Видимость = не ЭтоКоносамент; //группа с плановой датой отправления/прибытия
	Элементы.Группа6.Видимость = не ЭтоКоносамент; //группа с пункт отправления/пункт назначения 
	// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Конец: 31.10.2024  
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0375647 , 14-11-2024, начало
	//Элементы.ГруппаДанныеМорскогоРейса.Заголовок = "По данным Морского рейса"; 
	Если ЗначениеЗаполнено(Объект.МорскойРейс) Тогда
		Элементы.ГруппаДанныеМорскогоРейса.Заголовок = "По данным Морского рейса";
	Иначе
	    Элементы.ГруппаДанныеМорскогоРейса.Заголовок = "По данным коносамента";
	КонецЕсли;
	Элементы.ГруппаДанныеМорскогоРейса.ОтображатьЗаголовок = Истина;
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0375647 , 14-11-2024, конец
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимостьЗакладок();
	Если Объект.ГотовКВыставлению Тогда
		ГотовКВыставлениюПриИзменении(неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	ОбновитьВидимостьЗакладок();
	//++ Зубов 03.08.2021 35854
	ОбновитьВидимостьСибур();
	//-- Зубов 03.08.2021 35854
КонецПроцедуры

&НаСервере
Процедура НакладнаяЭТРАНПриИзмененииНаСервере()
	
	Если Объект.НомерТранспортногоДокумента <> Объект.НакладнаяЭТРАН.Номер Тогда
	    ОбъектТД = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.ТранспортныйДокумент"));
    	ОбъектТД.Заполнить(Объект.НакладнаяЭТРАН);
		ЗначениеВДанныеФормы(ОбъектТД, Объект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НакладнаяЭТРАНПриИзменении(Элемент)
	НакладнаяЭТРАНПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Обновляем панель текущего пользователя и панель состояний
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	// - Состояния
		
	ЦветКнопки_Исходный = Элементы.КоносаментыЗаполнятьПоПервойСтроке.ЦветФона;
	ЦветКнопки_Выделенный = WebЦвета.Розовый;
	
	//Евросиб Каблов 08.07.2020 (
	//Если Объект.Контрагент = ПолучитьКонтрагентаСибур() Тогда
	//	Элементы.СтатусЗаявкиСибур.Видимость = Истина;
	//Иначе
	//	Элементы.СтатусЗаявкиСибур.Видимость = Ложь;
	//КонецЕсли;
	
	МассивКонтейнеров = Новый Массив;
	Для Каждого СтрокаТЧ Из Объект.Коносаменты Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.НомерКТК) Тогда
			МассивКонтейнеров.Добавить(СтрокаТЧ.НомерКТК);
		КонецЕсли;
	КонецЦикла;
	
	Дислокации = ПолучитьДанныеПоМорскойДислокацииКонтейнеров(МассивКонтейнеров);
	Для Каждого СтрокаТЧ Из Объект.Коносаменты Цикл
		Дислокация = Дислокации.Получить(СтрокаТЧ.НомерКТК);
		Если Дислокация <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, Дислокация);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьРеквизитыРазмещенногоКоносаментаСибур();
	КонецЕсли;
	//Евросиб Каблов 08.07.2020 )
	
	//++ Зубов 03.08.2021 35854
	ОбновитьВидимостьСибур();
	
	Если ЗначениеЗаполнено(Объект.Букинг) Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Букинг.НомерБукинга) Тогда
			Сообщить("Коносамент не может быть создан, так как не указан «Номер букинга»");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//-- Зубов 03.08.2021 35854

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
	
	//Субботин 75158 13.10.2023 начало
	ИсточникиФормированияОбъекта = РегистрыСведений.ПротоколОбменов.ПолучитьУзлыОбменаОбъектаПротоколаОбмена(Объект.Ссылка, Перечисления.ДействияПриОбмене.ЗагрузкаДанных);
	Если ИсточникиФормированияОбъекта <> Неопределено Тогда
		КонтрольДоступностиДокументов_сервер.ОбработатьБлокировкуЭлементовФормы(Объект.Ссылка, Элементы);
		Если не РольДоступна("ПолныеПрава") Тогда
			Элементы.ПредупреждениеРедактирования.Видимость = Истина; 
			Элементы.ПредупреждениеРедактирования.Заголовок = "Документ частично заблокирован, поскольку был загружен из внешней системы. Редактирование документа ограничено!";
			//Субботин 80722 07.02.2024 начало
			УслОформление = Этаформа.УсловноеОформление.Элементы.Добавить();
			УслОформление.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр",Истина);
			ЭлементУсловия = УслОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ДетализацияПоГрузу.СтрокаЗагруженаИзСтороннейСистемы");
			ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементУсловия.ПравоеЗначение = Истина;
			ОформляемоеПоле = УслОформление.Поля.Элементы.Добавить();
    		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДетализацияПоГрузу");			
			Элементы.Коносаменты.КоманднаяПанель.ПодчиненныеЭлементы.КоносаментыДетализацияПоГрузу.Доступность = Истина;
			//Субботин 80722 07.02.2024 Конец
		КонецЕсли;	
	КонецЕсли;
	//Субботин 75158 13.10.2023 Конец  
	
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

//++ Зубов 03.08.2021 35854
&НаСервере
Процедура ОбновитьВидимостьСибур()
	Если Объект.ВидОперации = Перечисления.ВидыОперацийТранспортныхДокументов.Коносамент И Объект.Контрагент = Константы.СибурКонтрагент.Получить() Тогда
		Элементы.СибурОписание.Заголовок = "Описание груза";
		Элементы.ГруппаСибур.Видимость = Истина;
	Иначе
		Элементы.СибурОписание.Заголовок = "Описание";
		Элементы.ГруппаСибур.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСводно()
	Объект.СводноОГрузополучателе = ?(СибурНаименованиеГрузополучателя="","",СибурНаименованиеГрузополучателя + Символы.ПС) + ?(СибурРегНомерГрузополучателя="","",СибурРегНомерГрузополучателя + Символы.ПС) + ?(СибурАдресГрузополучателя="","",СибурАдресГрузополучателя + Символы.ПС) + ?(СибурТелефонГрузополучателя="","",СибурТелефонГрузополучателя + Символы.ПС) + СибурЭлектроннаяПочтаГрузополучателя; 
	Объект.СводноОбУведомлении = ?(СибурУведомлениеНаименование="","",СибурУведомлениеНаименование + Символы.ПС) + ?(СибурУведомлениеРегистрационныйНомер="","",СибурУведомлениеРегистрационныйНомер + Символы.ПС) + ?(СибурУведомлениеАдрес="","",СибурУведомлениеАдрес + Символы.ПС) + ?(СибурУведомлениеТелефон="","",СибурУведомлениеТелефон + Символы.ПС) + СибурУведомлениеЭлектроннаяПочта;
КонецПроцедуры
//-- Зубов 03.08.2021 35854
// + ОБЛАСТЬ СОСТОЯНИЯ

// Процедура обновляет панель текущего пользователя
&НаСервере
Процедура ОбновитьПанельТекущегоПользователя()
	
	МаршрутизацияСервер.ОбновитьПанельТекущегоПользователя(Объект, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
КонецПроцедуры

// Функция обновляет панель состояний документа для графического отражения его движения по состояниям
&НаСервере
Процедура ОбновитьПанельСостояний()
	
	МаршрутизацияСервер.ОбновитьПанельСостояний(ЭтотОбъект);
	
КонецПроцедуры

// Этот обработчик вызывается при нажатии на состояния на панели состояний
// Ссылка на него устанавливается кодом, поэтому при проверке конфигурации 1с может сказать, что эта функция не испольузется
// Не верьте 1с!
&НаКлиенте
Процедура ОбработчикНажатияПлитокСостояния(П1 = неопределено, П2 = неопределено) Экспорт
	МаршрутизацияКлиент.ОбработчикНажатияНаПлиткуОбщий(П1, П2);
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// Евросиб US 111176 TA 111178 Рыбьяков К.А. 25.06.2025 ((
	Если Объект.ВидОперации = Перечисления.ВидыОперацийТранспортныхДокументов.Коносамент Тогда
		Если Не ЗначениеЗаполнено(Объект.МорскойРейс) И Справочники.РейсыМоре.ПортНазначенияРоссийский(Объект.СтанцияНазначения) Тогда
			ТекстСообщения = НСтр("ru = 'Морской рейс не заполнен. Указание морского рейса является обязательным для коносаментов импортного направления перевозки.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "МорскойРейс", "Объект", Отказ);
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.МорскойРейс) Тогда
			МорскойРейсПомеченНаУдаление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.МорскойРейс, "ПометкаУдаления");
			Если МорскойРейсПомеченНаУдаление Тогда
				ТекстСообщения = НСтр("ru = 'Морской рейс помечен на удаление. Коносамент не проведен.'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "МорскойРейс", "Объект", Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 25.06.2025 ))
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийИсполнитель_СтатусПриИзменении(Элемент)
	
	// обновляем информацию по состоянию 
	МаршрутизацияКлиент.ТекущийИсполнитель_СтатусПриИзменении(Объект, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
	ОбновитьПанельСостояний();
	
КонецПроцедуры

&НаКлиенте
Процедура ПовторнаяМаршрутизация(Команда)
	
	Если Объект.Маршрутизировать Тогда
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыЗапроса.Вставить("Договор", Объект.ДоговорКонтрагента);
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьТД(ПараметрыЗапроса, Объект.Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			Объект.ПримененныйМаршрут = РезультатЗапроса[0].Ссылка;
			Объект.Состояния.Очистить();
			Для каждого Стр из РезультатЗапроса Цикл
				ЗаполнитьЗначенияСвойств(Объект.Состояния.Добавить(), Стр);
			КонецЦикла;
		Иначе
			Сообщить("Для документа не найден подходящий маршрут. Изменения не внесены!");
		КонецЕсли;
		
		ОбновитьПанельСостояний();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнятьПоПервойСтроке(Команда)
	
	ЗаполнятьПоПервойСтроке = НЕ ЗаполнятьПоПервойСтроке;
	Элементы.КоносаментыЗаполнятьПоПервойСтроке.ЦветФона = ?(ЗаполнятьПоПервойСтроке, ЦветКнопки_Выделенный, ЦветКнопки_Исходный);
	
КонецПроцедуры

&НаКлиенте
Процедура КоносаментыПриИзменении(Элемент)
	
	Если ЗаполнятьПоПервойСтроке Тогда
		ИмяТЧ = Элемент.Имя;
		ИмяПоля = Сред(Элемент.ТекущийЭлемент.Имя, СтрДлина(ИмяТЧ)+1);
		
		Для Сч = 1 По Объект[ИмяТЧ].Количество() - 1 Цикл
			Объект[ИмяТЧ][Сч][ИмяПоля] = Объект[ИмяТЧ][0][ИмяПоля];
		КонецЦикла;
	КонецЕсли;
	
	//Евросиб Каблов 08.07.2020 (
	Если Элемент.ТекущийЭлемент.Имя = "КоносаментыНомерКТК" Тогда
		
		МассивКонтейнеров = Новый Массив;
		Для Каждого СтрокаТЧ Из Объект.Коносаменты Цикл
			Если ЗначениеЗаполнено(СтрокаТЧ.НомерКТК) Тогда
				МассивКонтейнеров.Добавить(СтрокаТЧ.НомерКТК);
			КонецЕсли;
		КонецЦикла;
		
		Дислокации = ПолучитьДанныеПоМорскойДислокацииКонтейнеров(МассивКонтейнеров);
		Для Каждого СтрокаТЧ Из Объект.Коносаменты Цикл
			Дислокация = Дислокации.Получить(СтрокаТЧ.НомерКТК);
			Если Дислокация <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, Дислокация);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	//Евросиб Каблов 08.07.2020 )
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьИзExcel(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВставкиExcel", ЭтаФорма, Новый Структура("КТК", Истина));
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("КТК", Истина), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВставкиExcel(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	Для каждого Стр из Параметр1 Цикл
		
		Если ТипЗнч(Стр) = Тип("СправочникСсылка.ТЕ") Тогда
			
			НСтр = Объект.Коносаменты.Добавить();
			НСтр.НомерКТК = Стр;
			ТипИРазмер = РаботаСКонтейнерамиСервер.ПолучитьТипИРазмер(Стр);
			//НСтр.РазмерКТК = ТипИРазмер.Размер;
			НСтр.ТипКТК = ТипИРазмер.Тип;
			
		ИначеЕсли ТипЗнч(Стр) = Тип("Строка") Тогда
			
			КТК = РаботаСКонтейнерамиСервер.СоздатьКТК(Стр, неопределено);
			НСтр = Объект.Коносаменты.Добавить();
			НСтр.НомерКТК = КТК;
			
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	//Для Каждого Стр Из Объект.Состояния Цикл
	//	// если исполнитель пустой, то проставляем тек пользователя
	//	Если НЕ ЗначениеЗаполнено(Стр.Исполнитель) И Стр.ТребуетсяУказатьИсполнителя Тогда 
	//		Сообщить("Требуется указать исполнителя");
	//		Отказ = Истина;
	//	КонецЕсли;
	//	Если НЕ ЗначениеЗаполнено(Стр.Наблюдатель) И Стр.ТребуетсяУказатьНаблюдателя Тогда 
	//		Сообщить("Требуется указать наблюдателя");
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура БукингПриИзменении(Элемент)
	
	Объект.НомерБукинга = ПолучитьРеквизитОбъекта(Объект.Букинг, "НомерБукинга");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРеквизитОбъекта(Ссылка, Реквизит)

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, Реквизит);	

КонецФункции // ПолучитьРеквизитОбъекта()

// - ОБЛАСТЬ СОСТОЯНИЯ

&НаКлиенте
Процедура МорскойРейсПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.МорскойРейс) Тогда  
		
		ЗначенияРеквизитовРейса = ПолучитьЗначенияРеквизитовОбъекта(Объект.МорскойРейс, "Линия, Судно, ДатаОтправления, ДатаПрибытия, ПунктОтправления, ПунктНазначения, МестоПогрузки, МестоРазгрузки");  
		Объект.ДатаОтправленияПлан = ЗначенияРеквизитовРейса.ДатаОтправления;
		Объект.ДатаПрибытияПлан = ЗначенияРеквизитовРейса.ДатаПрибытия;
		Объект.СтанцияОтправления = ЗначенияРеквизитовРейса.ПунктОтправления;
		Объект.СтанцияНазначения = ЗначенияРеквизитовРейса.ПунктНазначения;
		Объект.МестоПолученияГруза = ЗначенияРеквизитовРейса.МестоПогрузки;
		Объект.МестоПоставкиГруза = ЗначенияРеквизитовРейса.МестоРазгрузки;  
		Объект.МорскаяЛиния = ЗначенияРеквизитовРейса.Линия;
		Объект.Судно = ЗначенияРеквизитовРейса.Судно;
		
		// Евросиб Фролов (15.04.2022 Task №48577
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийТранспортныхДокументов.Коносамент") Тогда
			Объект.ДатаОтправления = ЗначенияРеквизитовРейса.ДатаОтправления;
			Объект.ДатаПрибытия = ЗначенияРеквизитовРейса.ДатаПрибытия;
		КонецЕсли;	
		// Евросиб Фролов)   
	// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Начало: 19.11.2024
	Иначе
	    Объект.Судно = ПредопределенноеЗначение("Справочник.ТС.ПустаяСсылка");  
		Объект.МорскаяЛиния = ПредопределенноеЗначение("Справочник.МорскиеЛинии.ПустаяСсылка");
	// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Конец: 19.11.2024	
	КонецЕсли;    
	
	// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Начало: 14.11.2024
	ОбновитьВидимостьЗакладок();
	// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. Конец: 14.11.2024
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначенияРеквизитовОбъекта(Ссылка, Реквизиты)
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоМорскойДислокацииКонтейнеров(Контейнеры)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДислокацияКонтейнеровМореСрезПоследних.Контейнер КАК Контейнер,
		|	ДислокацияКонтейнеровМореСрезПоследних.Период КАК Период,
		|	ДислокацияКонтейнеровМореСрезПоследних.Порт КАК Порт,
		|	ДислокацияКонтейнеровМореСрезПоследних.Событие КАК Событие
		|ИЗ
		|	РегистрСведений.ДислокацияКонтейнеровМоре.СрезПоследних(, Контейнер В (&Контейнеры)) КАК ДислокацияКонтейнеровМореСрезПоследних";	
	Запрос.УстановитьПараметр("Контейнеры", Контейнеры);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Дислокации = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		Дислокации.Вставить(Выборка.Контейнер, Новый Структура("ДатаПоследнейОперации, ПоследняяОперация, МестоПоследнейОперации", Выборка.Период, Выборка.Событие, Выборка.Порт));
	КонецЦикла;
	
	Возврат Дислокации;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьРеквизитыРазмещенногоКоносаментаСибур()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.СибурРазмещенныеКоносаменты КАК СибурРазмещенныеКоносаменты
	|ГДЕ
	|	СибурРазмещенныеКоносаменты.ТранспортныйДокумент = &ТранспортныйДокумент";
	Запрос.УстановитьПараметр("ТранспортныйДокумент", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СибурМорскаяЛиния = Выборка.МорскаяЛиния;
		СибурНомерРейса = Выборка.НомерРейса;
		СибурНазваниеСудна = Выборка.НазваниеСудна;
		СибурМестоПолученияГруза = Выборка.МестоПолученияГруза;
		СибурМестоПоставкиГруза = Выборка.МестоПоставкиГруза;
		СибурМестоФормированияКоносамента = Выборка.НаименованиеМестаФормированияКоносамента;
		СибурУсловияПоставки = Выборка.УсловияПоставки;
		СибурСпособВыпуска = Выборка.СпособВыпуска;
		СибурНомерБукинга = Выборка.НомерБукинга;
		СибурДатаОтправкиИнструкции = Выборка.ДатаОтправкиИнструкции;
		СибурКоличествоВыпускаемыхКоносаментов = Выборка.КоличествоВыпускаемыхКоносаментов;
		СибурКоличествоКопийКоносаментов = Выборка.КоличествоКопийКоносаментов;
		СибурДатаСогласования = Выборка.ДатаСогласования;
		СибурДатаОформленияОригинала = Выборка.ДатаОформленияОригинала;
		СибурОтветственныйМенеджер = Выборка.ОтветственныйМенеджер;
		
		СибурНаименованиеГрузоотправителя = Выборка.НаименованиеГрузоотправителя;
		СибурНаименованиеГрузополучателя = Выборка.НаименованиеГрузополучателя;
		СибурРегНомерГрузополучателя = Выборка.РегНомерГрузополучателя;
		СибурЭлектроннаяПочтаГрузополучателя = Выборка.ЭлектроннаяПочтаГрузополучателя;
		СибурТелефонГрузополучателя = Выборка.ТелефонГрузополучателя;
		СибурАдресГрузополучателя = Выборка.АдресГрузополучателя;
		
		СибурУведомлениеНаименование = Выборка.УведомлениеНаименование;
		СибурУведомлениеРегистрационныйНомер = Выборка.УведомлениеРегистрационныйНомер;
		СибурУведомлениеАдрес = Выборка.УведомлениеАдрес;
		СибурУведомлениеТелефон = Выборка.УведомлениеТелефон;
		СибурУведомлениеЭлектроннаяПочта = Выборка.УведомлениеЭлектроннаяПочта;
		
		СибурОписание = Выборка.Описание;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
функция ПолучитьКонтрагентаСибур()
	
	Возврат Константы.СибурКонтрагент.Получить();
	
КонецФункции

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	//Евросиб Каблов 08.07.2020 (
	Если Объект.Контрагент = ПолучитьКонтрагентаСибур() Тогда
//Евросиб Гудкова( 12.08.2020 Ticket№ 0202630
		//Элементы.СтатусЗаявкиСибур.Видимость = Истина;
		Элементы.ГруппаОтображениеДанныхЗапросаСибура.Видимость = Истина;
	Иначе
//Евросиб Гудкова( 12.08.2020 Ticket№ 0202630
//		Элементы.СтатусЗаявкиСибур.Видимость = Ложь;
		Элементы.ГруппаОтображениеДанныхЗапросаСибура.Видимость = Ложь;
	КонецЕсли;
	//Евросиб Каблов 08.07.2020 )
	
	//++ Зубов 03.08.2021 35854
	ОбновитьВидимостьСибур();
	//-- Зубов 03.08.2021 35854
КонецПроцедуры

&НаКлиенте
Процедура ГотовКВыставлениюПриИзменении(Элемент)
	
	Если Объект.Коносаменты.Количество() > 0 Тогда
		
		НомерКТК = Объект.Коносаменты[0].НомерКТК;
		ДанныеСделки = ПолучитьДанныеСделки(Объект.Ссылка);
		Сделка = ДанныеСделки.Сделка;
		ОтветственныйМенеджер = ДанныеСделки.ОтветственныйМенеджер;
		Если НЕ ЗначениеЗаполнено(Сделка) Тогда
			ПоказатьПредупреждение(, "Сделка не найдена. Включите коносамент в сделку и повторите попытку.");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеСделки(ОбъектСсылка)
	
	Результат = Новый Структура("Сделка, ОтветственныйМенеджер");
	
	Запрос = Новый Запрос;
	// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 29.11.2022
	// Было:
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Сделка,
	//               |	СделкаСвязьУчетныхЕдиниц.Договор.ОтветственныйЗаУчет КАК ОтветственныйМенеджер
	//               |ИЗ
	//               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	//               |ГДЕ
	//               |	СделкаСвязьУчетныхЕдиниц.Коносамент = &Коносамент
	//               |	И НЕ СделкаСвязьУчетныхЕдиниц.Ссылка.ПометкаУдаления"; 
	//Стало:
	Запрос.Текст = "ВЫБРАТЬ
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Сделка,
	               |	Ответственные.Ответственный КАК ОтветственныйМенеджер
	               |ИЗ
	               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.Ответственные КАК Ответственные
	               |		ПО СделкаСвязьУчетныхЕдиниц.Договор = Ответственные.Ссылка
	               |			И (Ответственные.ТипОтветственного = ЗНАЧЕНИЕ(Перечисление.ТипыОтветственных.ОтветственныйЗаУчет))
	               |			И (Ответственные.ЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ОсновнойЦФО))
	               |ГДЕ
	               |	СделкаСвязьУчетныхЕдиниц.Коносамент = &Коносамент
	               |	И НЕ СделкаСвязьУчетныхЕдиниц.Ссылка.ПометкаУдаления
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка,
	               |	Ответственные.Ответственный";
	// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 29.11.2022
	
	Запрос.УстановитьПараметр("Коносамент", ОбъектСсылка);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		
		Результат.Сделка = Ответ.Сделка;
		Результат.ОтветственныйМенеджер = Ответ.ОтветственныйМенеджер;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	НайдСтрокаСостояния = неопределено;
	
	Для каждого Стр из Объект.Состояния Цикл
		Если Стр.Состояние = ПредопределенноеЗначение("Справочник.Состояния.СозданиеАвансовогоСчетаПоКоносаменту") Тогда
			НайдСтрокаСостояния = Стр;
		КонецЕсли;
	КонецЦикла;
	
	Если Объект.ГотовКВыставлению = Ложь И НайдСтрокаСостояния <> неопределено Тогда
		//НайдСтрокаСостояния.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Новый");
		//ДИТ, Беляев СЮ, Ticket#0286346, 21-09-2022, начало
		Объект.Состояния.Удалить(НайдСтрокаСостояния);
		//ДИТ, Беляев СЮ, Ticket#0286346, 21-09-2022, конец
		
		//НайдСтрокаСостояния.ПримечаниеЗадачаИсполнителю = Ложь;
	ИначеЕсли Объект.ГотовКВыставлению = Истина Тогда
		
		Если НайдСтрокаСостояния = неопределено Тогда
			
			НайдСтрокаСостояния = Объект.Состояния.Добавить();
			НайдСтрокаСостояния.Состояние = ПредопределенноеЗначение("Справочник.Состояния.СозданиеАвансовогоСчетаПоКоносаменту");
			
		КонецЕсли;
		
		Если НайдСтрокаСостояния.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен") И 
			НайдСтрокаСостояния.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Отклонен") Тогда
			НайдСтрокаСостояния.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.ВРаботе");
			НайдСтрокаСостояния.НачалоРаботы = ТекущаяДата();
			НайдСтрокаСостояния.Исполнитель = ОтветственныйМенеджер;
		КонецЕсли;
		//НайдСтрокаСостояния.ПримечаниеЗадачаИсполнителю = Истина;
		НайдСтрокаСостояния.Комментарий = "Создать авансовый счет по к/с " + Объект.НомерТранспортногоДокумента;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	КонтрагентСибур = ПолучитьКонтрагентаСибур();
	Если Объект.Контрагент = КонтрагентСибур Тогда
		ЗаписатьДанныеСибур();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеСибур()
	
	Запись = РегистрыСведений.СибурРазмещенныеКоносаменты.СоздатьМенеджерЗаписи();
	Запись.ТранспортныйДокумент = Объект.Ссылка;	
	Запись.Прочитать();
	
	Если Не Запись.Выбран() Тогда		
		Запись.ТранспортныйДокумент = Объект.Ссылка;
	КонецЕсли; 
	
	Запись.ДатаОтправкиИнструкции = СибурДатаОтправкиИнструкции;
	Запись.КоличествоВыпускаемыхКоносаментов = СибурКоличествоВыпускаемыхКоносаментов;
	Запись.КоличествоКопийКоносаментов = СибурКоличествоКопийКоносаментов;
	Запись.ДатаСогласования = СибурДатаСогласования;
	Запись.ДатаОформленияОригинала = СибурДатаОформленияОригинала;
	Запись.ОтветственныйМенеджер = СибурОтветственныйМенеджер;
	
	Запись.НаименованиеГрузоотправителя = СибурНаименованиеГрузоотправителя;
	Запись.НаименованиеГрузополучателя = СибурНаименованиеГрузополучателя;
	Запись.РегНомерГрузополучателя = СибурРегНомерГрузополучателя;
	Запись.ЭлектроннаяПочтаГрузополучателя = СибурЭлектроннаяПочтаГрузополучателя;
	Запись.ТелефонГрузополучателя = СибурТелефонГрузополучателя;
	Запись.АдресГрузополучателя = СибурАдресГрузополучателя;
	
	Запись.УведомлениеНаименование = СибурУведомлениеНаименование;
	Запись.УведомлениеРегистрационныйНомер = СибурУведомлениеРегистрационныйНомер;
	Запись.УведомлениеАдрес = СибурУведомлениеАдрес;
	Запись.УведомлениеТелефон = СибурУведомлениеТелефон;
	Запись.УведомлениеЭлектроннаяПочта = СибурУведомлениеЭлектроннаяПочта;
	
	Запись.Описание = СибурОписание;	
	
	Запись.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлДрафтаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("ВладелецФайла", Объект.Ссылка);	
	ОповещениеОВыбореФайлаДрафта = Новый ОписаниеОповещения("ОбработкаВыбораФайлаДрафта", ЭтаФорма);
	Открытьформу("Справочник.Файлы.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОВыбореФайлаДрафта);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораФайлаДрафта(Файл, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Файл) Тогда	
		Объект.ФайлДрафта = Файл;
		Модифицированность = Истина;	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлИнструкцииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("ВладелецФайла", Объект.Ссылка);	
	ОповещениеОВыбореФайлаИнструкции = Новый ОписаниеОповещения("ОбработкаВыбораФайлаИнструкции", ЭтаФорма);
	Открытьформу("Справочник.Файлы.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОВыбореФайлаИнструкции);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораФайлаИнструкции(Файл, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Файл) Тогда	
		Объект.ФайлИнструкции = Файл;
		Модифицированность = Истина;	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлОригиналаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("ВладелецФайла", Объект.Ссылка);	
	ОповещениеОВыбореФайлаОригинала = Новый ОписаниеОповещения("ОбработкаВыбораФайлаОригинала", ЭтаФорма);
	Открытьформу("Справочник.Файлы.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОВыбореФайлаОригинала);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораФайлаОригинала(Файл, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Файл) Тогда	
		Объект.ФайлОригинала = Файл;
		Модифицированность = Истина;	
	КонецЕсли; 
	
КонецПроцедуры
//++ Зубов 03.08.2021 35854
&НаКлиенте
Процедура СибурНаименованиеГрузополучателяПриИзменении(Элемент)
	ОбновитьСводно();
КонецПроцедуры

&НаКлиенте
Процедура СибурРегНомерГрузополучателяПриИзменении(Элемент)
	ОбновитьСводно();
КонецПроцедуры

&НаКлиенте
Процедура СибурАдресГрузополучателяПриИзменении(Элемент)
	ОбновитьСводно();
КонецПроцедуры

&НаКлиенте
Процедура СибурТелефонГрузополучателяПриИзменении(Элемент)
	ОбновитьСводно();
КонецПроцедуры

&НаКлиенте
Процедура ЭлектроннаяПочтаГрузополучателяПриИзменении(Элемент)
	ОбновитьСводно();
КонецПроцедуры

&НаКлиенте
Процедура СибурУведомлениеНаименованиеПриИзменении(Элемент)
	ОбновитьСводно();
КонецПроцедуры

&НаКлиенте
Процедура СибурУведомлениеРегистрационныйНомерПриИзменении(Элемент)
	ОбновитьСводно();
КонецПроцедуры

&НаКлиенте
Процедура СибурУведомлениеАдресПриИзменении(Элемент)
	ОбновитьСводно();
КонецПроцедуры

&НаКлиенте
Процедура СибурУведомлениеТелефонПриИзменении(Элемент)
	ОбновитьСводно();
КонецПроцедуры

&НаКлиенте
Процедура СибурУведомлениеЭлектроннаяПочтаПриИзменении(Элемент)
	ОбновитьСводно();
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОкнаПриложения = ПолучитьОкна();
	Для каждого ОкноПриложения Из ОкнаПриложения Цикл
		// Анализ заголовка окна
		Если ЗначениеЗаполнено(Объект.Букинг) Тогда
			Если Найти(ОкноПриложения.Заголовок, Объект.Букинг) > 0 Тогда
				// Получение формы
				Если ОкноПриложения.Содержимое.Количество()>0 Тогда
					НайденнаяФорма = ОкноПриложения.Содержимое[0];
					
					НайденнаяФорма.ЗаполнитьРеквизитКоносамент();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
//-- Зубов 03.08.2021 35854

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  

//Субботин 80722 07.02.2024 начало
&НаКлиенте
Процедура ДетализацияПоГрузу(Команда)
	
	Элементы.ДетализацияПоГрузу.Видимость = НЕ Элементы.ДетализацияПоГрузу.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура КоносаментыПриАктивизацииСтроки(Элемент) 
	
	Если Элементы.Коносаменты.ТекущиеДанные <> Неопределено Тогда
		
		ОбновитьВидимостьДетализацияПоГрузу();
		СтруктураПоиска = Новый Структура ("СтрокаКоносаментаГУИД", Элементы.Коносаменты.ТекущиеДанные.ГУИДСтроки);
		
		Если Объект.ДетализацияПоГрузу.НайтиСтроки(СтруктураПоиска).Количество() > 0 тогда
			Элементы.КоносаментыДетализацияПоГрузу.ЦветФона = Новый Цвет(9, 255, 144);
		Иначе 
			Элементы.КоносаментыДетализацияПоГрузу.ЦветФона = Новый Цвет(255, 255, 255);
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры 

&НаКлиенте
Процедура КоносаментыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.ГУИДСтроки = Новый УникальныйИдентификатор();
		ОбновитьВидимостьДетализацияПоГрузу();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДетализацияПоГрузуПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Элементы.Коносаменты.ТекущиеДанные <> Неопределено Тогда
		 Элемент.ТекущиеДанные.ГУИД  = Новый УникальныйИдентификатор();
		 Элемент.ТекущиеДанные.СтрокаКоносаментаГУИД = Элементы.Коносаменты.ТекущиеДанные.ГУИДСтроки;
	КонецЕсли;	 
 
КонецПроцедуры

&НаКлиенте
Процедура ДетализацияПоГрузуПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элементы.Коносаменты.ТекущиеДанные = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо выбрать строку в таблице ""СписокКТК""",,,,Отказ);
		Возврат
	КонецЕсли;
	 
КонецПроцедуры  
 
 &НаКлиенте
Процедура ОбновитьВидимостьДетализацияПоГрузу()
	 
		Элементы.ДетализацияПоГрузу.ОтборСтрок = Новый ФиксированнаяСтруктура("СтрокаКоносаментаГУИД", Элементы.Коносаменты.ТекущиеДанные.ГУИДСтроки);		

КонецПроцедуры	 

&НаКлиенте
Процедура ДетализацияПоГрузуПередУдалением(Элемент, Отказ)
	
	Для Каждого СтрокаТЧ из Элементы.ДетализацияПоГрузу.ВыделенныеСтроки Цикл  
		ТекущиеДанные = Элементы.ДетализацияПоГрузу.ДанныеСТроки(СтрокаТЧ);
		Отказ = ПроверитьВозможностьУдаленияСтрокиДетализации(ТекущиеДанные.СтрокаЗагруженаИзСтороннейСистемы);
		Если Отказ Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПроверитьВозможностьУдаленияСтрокиДетализации(СтрокаЗагруженаИзСтороннейСистемы) 
	Ответ = Ложь;
	Если не РольДоступна("ПолныеПрава") и СтрокаЗагруженаИзСтороннейСистемы Тогда 
		ОбщегоНазначения.СообщитьПользователю("Редактирование строк загруженных из сторонней системы запрещено");
		Ответ = Истина;
	КонецЕсли;
	Возврат Ответ	
КонецФункции
//Субботин 80722 07.02.2024 Конец 




