
&НаКлиенте
Процедура ПодобратьАдрес(Команда)  
	ПодобратьАдресНаКлиенте(Истина);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//1 ищем адрес в справочнике
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АдресаВНаселенныхПунктах.Ссылка КАК СсылкаАдрес,
	|	АдресаВНаселенныхПунктах.Владелец КАК НаселенныйПункт
	|ИЗ
	|	Справочник.АдресаВНаселенныхПунктах КАК АдресаВНаселенныхПунктах
	|ГДЕ
	|	АдресаВНаселенныхПунктах.Адрес = &Адрес
	|	И НЕ АдресаВНаселенныхПунктах.ПометкаУдаления";
	Запрос.УстановитьПараметр("Адрес", Параметры.АдресВЛокации);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		АдресВНаселенномПунктеСсылка = ОкНаСервере();
		АдресВНаселенномПункте = АдресВНаселенномПунктеСсылка; 
	КонецЕсли;
	//НаселенныйПунктСсылка = Параметры.Локация;
	//СтруктураЛокации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НаселенныйПунктСсылка, "Наименование, ЛокацияВышестоящегоУровня");
	//НаименованиеЛокации = СтруктураЛокации.Наименование;
	//ЛокацияВышестоящегоУровня = СтруктураЛокации.ЛокацияВышестоящегоУровня;
	Адрес = Параметры.АдресВЛокации;
	Если Параметры.Свойство("СписокАдресов") Тогда
		Для каждого Адрес Из Параметры.СписокАдресов Цикл
			СписокАдресов.Добавить().Адрес = Адрес;
		КонецЦикла;
	КонецЕсли;
	Если Параметры.Свойство("Адрес") Тогда
		Адрес = Параметры.Адрес;
	КонецЕсли;
	Если Параметры.Свойство("НаселенныйПункт") Тогда
		НаселенныйПункт = Параметры.НаселенныйПункт;
	Иначе
		Элементы.НаселенныйПункт.Видимость = Ложь;
	КонецЕсли;
	Если Параметры.Свойство("НаселенныйПунктРодитель") Тогда
		НаселенныйПунктРодитель = Параметры.НаселенныйПунктРодитель;
	КонецЕсли;
	Если Параметры.Свойство("ВидКонтактнойИнформации") Тогда
		ВидКонтактнойИнформации = Параметры.ВидКонтактнойИнформации;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокАдресовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Результат  = Новый Структура("ИдентификаторЗапроса, ДанныеВыбора, НаселенныйПунктСсылка, ОшибкиЗаполнения");
	Результат.ДанныеВыбора = Новый Структура;
	Результат.ДанныеВыбора.Вставить("КонтактнаяИнформация", "");
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ВыбраннаяСтрокаЗначение = СписокАдресов.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ЗаписатьJSON(ЗаписьJSON, Новый Структура("country, value",ВыбраннаяСтрокаЗначение.Страна, ВыбраннаяСтрокаЗначение.Адрес));
	Результат.ДанныеВыбора.Вставить("Значение", ЗаписьJSON.Закрыть());
	Результат.ДанныеВыбора.Вставить("Представление", ВыбраннаяСтрокаЗначение.Адрес);
	Результат.ДанныеВыбора.Вставить("Комментарий", "");
	Результат.ДанныеВыбора.Вставить("ВведеноВСвободнойФорме", Истина);
	Результат.ДанныеВыбора.Вставить("Вид", ВидКонтактнойИнформации);
	Результат.ДанныеВыбора.Вставить("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"));
	СтруктураРезультатаПоКоординатам = ГеокодированиеКлиентСервер.ПолучитьМассивНаселенныхПунктовЧерезГеокодерЯндекс(СтрШаблон("%1,%2", ВыбраннаяСтрокаЗначение.Долгота, ВыбраннаяСтрокаЗначение.Широта), Ложь);
	Если ЗначениеЗаполнено(СтруктураРезультатаПоКоординатам.ОписаниеОшибки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтруктураРезультатаПоКоординатам.ОписаниеОшибки);
		Закрыть(Неопределено);
		Возврат;
	Иначе
		ЗаписатьЛогГеокодераНаСервере(СтруктураРезультатаПоКоординатам.ИдентификаторЗапроса,СтруктураРезультатаПоКоординатам.ИдентификаторЗапроса);
	КонецЕсли;
	МассивРезультатов = СтруктураРезультатаПоКоординатам.МассивСтруктурРезультата;
	КоличествоРезультатов = МассивРезультатов.Количество();
	Если КоличествоРезультатов = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не найден населенный пункт для привязки родителя"); 
		Закрыть(Неопределено);
		Возврат;
	//Евросиб - АСуслов 01.04.2024 17:18:21 #0347127
	//(
	//ИначеЕсли КоличествоРезультатов = 1 Тогда
	Иначе 
	//)
	//Евросиб - АСуслов 01.04.2024 17:18:23 #0347127
		СтруктураПараметровСозданияЛокации = Новый Структура("Наименование, Долгота, Широта, Регион, Страна", 
																ВыбраннаяСтрокаЗначение.НаселенныйПункт,
																МассивРезультатов[0].Долгота,
																МассивРезультатов[0].Широта,
																ВыбраннаяСтрокаЗначение.ЛокацияВышестоящегоУровня,
																ВыбраннаяСтрокаЗначение.Страна);
	КонецЕсли;
	Результат.ДанныеВыбора.Вставить("НаселенныйПунктСсылка", ГеокодированиеСервер.НайтиДобавитьНаселенныйПункт(СтруктураПараметровСозданияЛокации));
	Результат.ИдентификаторЗапроса = ИдентификаторЗапроса;
	МассивКомпонентовАдреса = Новый Массив;
	Для каждого КомпонентАдреса Из ВыбраннаяСтрокаЗначение.КомпонентыАдреса Цикл
		МассивКомпонентовАдреса.Добавить(Новый Структура("ВидНайденногоТопонима, Имя", КомпонентАдреса.ВидНайденногоТопонима, КомпонентАдреса.Имя));
	КонецЦикла;
	Результат.ДанныеВыбора.Вставить("КомпонентыАдреса", МассивКомпонентовАдреса);
	Результат.ДанныеВыбора.Вставить("ИдентификаторЗапроса", ИдентификаторЗапроса);
	Результат = Результат.ДанныеВыбора;
	//ЗаписатьЛогГеокодераНаСервере(Результат);
	Адрес = ВыбраннаяСтрокаЗначение.Адрес;
	НаселенныйПунктСсылка = Результат.НаселенныйПунктСсылка;
	//Евросиб Коханенко Н.А. 17.12.2025 (( #125251
	Широта = ВыбраннаяСтрокаЗначение.Широта;
	Долгота = ВыбраннаяСтрокаЗначение.Долгота;
	//Евросиб Коханенко Н.А. 17.12.2025 )) #125251 
	Для каждого КомпонентАдреса Из ВыбраннаяСтрокаЗначение.КомпонентыАдреса Цикл
		ЗаполнитьЗначенияСвойств(КомпонентыАдреса.Добавить(), КомпонентАдреса);
	КонецЦикла;
	АдресВНаселенномПункте = ОкНаСервере();
	//ЗаписатьЛогГеокодераНаСервере(Результат);
	Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)      
	СтруктураРезультатаИмяВладельца = ПолучитьИмяВладельца(ЭтаФорма);
	ТипОбъектаИсточникаЗапроса = СтруктураРезультатаИмяВладельца.ИмяФормы;
	Если СтруктураРезультатаИмяВладельца.Объект <> Неопределено Тогда
		ОбъектИсточникЗапроса = СтруктураРезультатаИмяВладельца.Объект.Ссылка;
	КонецЕсли;
	ПодобратьАдресНаКлиенте();
КонецПроцедуры                     

&НаКлиенте
Функция ПолучитьИмяВладельца(ПараметрВладельца)
	СтруктураРезультата = Новый Структура("ИмяФормы, Объект");
	Если ТипЗнч(ПараметрВладельца) = Тип("ФормаКлиентскогоПриложения") Тогда
		Если СтруктураРезультата.Объект = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтруктураРезультата, ПараметрВладельца);
		КонецЕсли;
		Если ПараметрВладельца.ВладелецФормы <> Неопределено
			И СтруктураРезультата.Объект = Неопределено Тогда
			СтруктураРезультата = ПолучитьИмяВладельца(ПараметрВладельца.ВладелецФормы);
		КонецЕсли; 
	Иначе
		СтруктураРезультата = ПолучитьИмяВладельца(ПараметрВладельца.Родитель);
	КонецЕсли;               
	Возврат СтруктураРезультата;
КонецФункции

&НаКлиенте
Процедура ПодобратьАдресНаКлиенте(ПроверятьСтатусПоследнегоЗапроса = Ложь) 
	Если ПодборАдресаВыполнялся Тогда
		ПодборАдресаВыполнялся = Ложь;
		Возврат;
	Иначе
		ПодборАдресаВыполнялся = Истина;
	КонецЕсли;
	Если Адрес = "" Тогда
		Возврат;
	КонецЕсли;
	//МассивСтруктурАдресов = ГеокодированиеКлиентСервер.ПолучитьМассивАдресовЧерезГеокодерЯндекс(Адрес, НаселенныйПункт, НаселенныйПунктРодитель);
	Если НЕ ПроверятьСтатусПоследнегоЗапроса Тогда
		ПродолжитьПолучениеАдреса(Неопределено);
		Возврат;
	КонецЕсли;
    СтатусПоследнегоЗапроса = ГеокодированиеВызовСервера.ПроверитьГеокодПоИсторииЗапросов(Адрес);
	Если СтатусПоследнегоЗапроса = ПредопределенноеЗначение("Перечисление.СтатусыОбработкиЗапросаГеокодера.ОтветПолученНеЗаписан") Тогда
		ОписаниеОповещенияВопросаГеокодера = Новый ОписаниеОповещения("ПродолжитьПолучениеАдреса", ЭтотОбъект);
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
		СписокКнопок.Добавить(КодВозвратаДиалога.Ок, "Отправить запрос в текущем виде");
		ПоказатьВопрос(ОписаниеОповещенияВопросаГеокодера, "При предыдущей отправке аналогичного значения системе не удалось найти подходящий условиям поиска адрес в адресном классификаторе.
		|Попробуйте изменить введенное значение перед его отправкой. Отправить запрос в текущем виде?", СписокКнопок);
	Иначе
		ПродолжитьПолучениеАдреса(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьПолучениеАдреса(Параметр1, Параметр2 = Неопределено) Экспорт
	Если Параметр1 = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;  
	СтруктураРезультата = ГеокодированиеКлиентСервер.ПолучитьМассивАдресовЧерезГеокодерЯндекс(Адрес, НаселенныйПункт, НаселенныйПунктРодитель);
	Если ЗначениеЗаполнено(СтруктураРезультата.ОписаниеОшибки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтруктураРезультата.ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	ИдентификаторЗапроса = СтруктураРезультата.СтруктураРезультатаЗапроса.ИдентификаторЗапроса;
	ЗаписатьЛогГеокодераНаСервере(Неопределено);
	Если ЗначениеЗаполнено(СтруктураРезультата.ОписаниеОшибки) Тогда
		Сообщить(СтруктураРезультата.ОписаниеОшибки);
	КонецЕсли;
	МассивСтруктурАдресов = СтруктураРезультата.МассивАдресов;
	СписокАдресов.Очистить();
	Если МассивСтруктурАдресов = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	Для каждого СтруктураАдреса Из МассивСтруктурАдресов Цикл
		СтрокаАдрес = СписокАдресов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаАдрес, СтруктураАдреса,,"КомпонентыАдреса");
		Для каждого КомпонентАдреса Из СтруктураАдреса.КомпонентыАдреса Цикл
			ЗаполнитьЗначенияСвойств(СтрокаАдрес.КомпонентыАдреса.Добавить(), КомпонентАдреса);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ЗаписатьЛогГеокодераНаСервере(Результат);
	ОповеститьОВыборе(АдресВНаселенномПункте);
КонецПроцедуры

&НаКлиенте
Процедура АдресОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ПодборАдресаВыполнялся = Ложь;
	Адрес = Текст;
	ПодобратьАдресНаКлиенте(Истина);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЛогГеокодераНаСервере(Результат, ПараметрИдентификаторЗапроса = "")
	Если Результат = Неопределено Тогда
		СтатусОбработкиЗапроса = Перечисления.СтатусыОбработкиЗапросаГеокодера.ОтветПолученНеЗаписан;
	Иначе
		СтатусОбработкиЗапроса = Перечисления.СтатусыОбработкиЗапросаГеокодера.ОтветПолученЗаписан;
	КонецЕсли;
	мз = РегистрыСведений.ИсторияЗапросовКГеокодеру.СоздатьМенеджерЗаписи();
	Если ЗначениеЗаполнено(ПараметрИдентификаторЗапроса) Тогда
		мз.ИдентификаторЗапроса = ПараметрИдентификаторЗапроса
	Иначе
		мз.ИдентификаторЗапроса = ИдентификаторЗапроса;
	КонецЕсли;
	мз.Прочитать();
	Если мз.Выбран() Тогда
		мз.ТипОбъектаИсточникаЗапроса = ТипОбъектаИсточникаЗапроса;
		мз.ОбъектИсточникЗапроса = ОбъектИсточникЗапроса; 
		мз.СтатусОбработкиЗапроса = СтатусОбработкиЗапроса;
		мз.РезультатОбработкиЗапроса = АдресВНаселенномПункте;
		мз.Записать();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ОкНаСервере()
	Если АдресВНаселенномПункте.Пустая() Тогда
		//Евросиб Коханенко Н.А. 17.12.2025 (( #125251 
		//АдресВНаселенномПунктеСсылка = Справочники.АдресаВНаселенныхПунктах.НайтиСоздатьАдресВНаселенномПункте(Адрес, НаселенныйПунктСсылка, КомпонентыАдреса);
		АдресВНаселенномПунктеСсылка = Справочники.АдресаВНаселенныхПунктах.НайтиСоздатьАдресВНаселенномПункте(Адрес, НаселенныйПунктСсылка, КомпонентыАдреса, Широта, Долгота);
		//Евросиб Коханенко Н.А. 17.12.2025 )) #125251 
	КонецЕсли;
	Возврат АдресВНаселенномПунктеСсылка;
КонецФункции

