
&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры

&НаСервере
Процедура Команда1НаСервере()
	
	ТЧКопия = Объект.Контейнеры.Выгрузить();
	ТЧВыгр = Объект.Контейнеры.Выгрузить();
	ТЧВыгр.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтокКонтейнеровКонтейнеры.Контейнер КАК Контейнер,
	               |	СтокКонтейнеровКонтейнеры.Контрагент КАК Контрагент,
	               |	МАКСИМУМ(СтокКонтейнеровКонтейнеры.КоличествоБНКонтейнеров) КАК КоличествоБНКонтейнеров,
	               |	МАКСИМУМ(СтокКонтейнеровКонтейнеры.ТипКонтейнера) КАК ТипКонтейнера,
	               |	МАКСИМУМ(СтокКонтейнеровКонтейнеры.СрокВозврата) КАК СрокВозврата,
	               |	МАКСИМУМ(СтокКонтейнеровКонтейнеры.Статус) КАК Статус,
	               |	МАКСИМУМ(СтокКонтейнеровКонтейнеры.Направление) КАК Направление,
	               |	МАКСИМУМ(СтокКонтейнеровКонтейнеры.ДатаПриемаВСток) КАК ДатаПриемаВСток,
	               |	МАКСИМУМ(СтокКонтейнеровКонтейнеры.ПСЦ) КАК ПСЦ,
	               |	МАКСИМУМ(СтокКонтейнеровКонтейнеры.Ставка) КАК Ставка,
	               |	МАКСИМУМ(СтокКонтейнеровКонтейнеры.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	               |	МАКСИМУМ(СтокКонтейнеровКонтейнеры.Валюта) КАК Валюта,
	               |	МАКСИМУМ(СтокКонтейнеровКонтейнеры.СтавкаНДС) КАК СтавкаНДС,
	               |	МАКСИМУМ(СтокКонтейнеровКонтейнеры.НДСВключая) КАК НДСВключая,
	               |	МАКСИМУМ(СтокКонтейнеровКонтейнеры.СтавкаСНП) КАК СтавкаСНП,
	               |	МАКСИМУМ(СтокКонтейнеровКонтейнеры.ЗабратьДо) КАК ЗабратьДо,
	               |	МАКСИМУМ(СтокКонтейнеровКонтейнеры.СВВ) КАК СВВ,
	               |	МАКСИМУМ(СтокКонтейнеровКонтейнеры.ФактическоеНаправление) КАК ФактическоеНаправление,
	               |	МАКСИМУМ(СтокКонтейнеровКонтейнеры.ВремяПрибытияНаТерминалОтпр) КАК ВремяПрибытияНаТерминалОтпр,
	               |	МАКСИМУМ(СтокКонтейнеровКонтейнеры.ИнструкцииПоСдачеПорожнего) КАК ИнструкцииПоСдачеПорожнего,
	               |	МАКСИМУМ(СтокКонтейнеровКонтейнеры.СледующийСток) КАК СледующийСток,
	               |	МАКСИМУМ(СтокКонтейнеровКонтейнеры.КлиентПередислокация_Клиент) КАК КлиентПередислокация_Клиент,
	               |	МАКСИМУМ(СтокКонтейнеровКонтейнеры.КлиентПередислокация_Договор) КАК КлиентПередислокация_Договор,
	               |	МАКСИМУМ(СтокКонтейнеровКонтейнеры.КлиентПередислокация_ПСЦ) КАК КлиентПередислокация_ПСЦ,
	               |	МАКСИМУМ(СтокКонтейнеровКонтейнеры.НомерТСПрибытия) КАК НомерТСПрибытия,
	               |	МАКСИМУМ(СтокКонтейнеровКонтейнеры.ВодительТСПрибытия) КАК ВодительТСПрибытия,
	               |	МАКСИМУМ(СтокКонтейнеровКонтейнеры.ДатаВзятияИзСтока) КАК ДатаВзятияИзСтока,
	               |	МАКСИМУМ(СтокКонтейнеровКонтейнеры.ДатаПриемаВПользованиеПередПоставщиком) КАК ДатаПриемаВПользованиеПередПоставщиком,
	               |	МАКСИМУМ(СтокКонтейнеровКонтейнеры.ДатаСдачиКТКПоставщику) КАК ДатаСдачиКТКПоставщику,
	               |	МАКСИМУМ(СтокКонтейнеровКонтейнеры.Договор) КАК Договор
	               |ИЗ
	               |	Документ.СтокКонтейнеров.Контейнеры КАК СтокКонтейнеровКонтейнеры
	               |ГДЕ
	               |	СтокКонтейнеровКонтейнеры.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СтокКонтейнеровКонтейнеры.Контейнер,
	               |	СтокКонтейнеровКонтейнеры.Контрагент";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Ответ = запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		НСтр = ТЧВыгр.Добавить();
		ЗаполнитьЗначенияСвойств(НСТр, Ответ);
	
	КонецЦикла;
	
	Объект.Контейнеры.Загрузить(ТЧВыгр);
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )
