
Функция ПолучитьEMAILПользователя(Контрагент) 
	
	Результат = "";
	Для каждого Стр из Контрагент.КонтактнаяИнформация Цикл
		Если ЗначениеЗаполнено(Стр.АдресЭП) тогда
			Результат = Стр.Представление;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

Процедура РассылкаПоКонтейнерам() Экспорт
	
	РассылкаПоКонтейнерамПользователям();
	
КонецПроцедуры

Процедура РассылкаПоКонтейнерамПользователям() Экспорт
	
	// первичная проверка на то, что мы вообще можем что-то отправить
	УчетнаяЗаписьПоУмолчанию = РаботаСПочтовымиСообщениями.ПроверитьСистемнаяУчетнаяЗаписьДоступна();
	
	Если не УчетнаяЗаписьПоУмолчанию Тогда 
		возврат; 
	КонецЕсли;
	СистемнаяУчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	
	// получаем пользователей из константы. рассылка для каждого из нее отдельная
	ПользователиДляРассылки = Константы.ГруппаПолучателейРассылкиВозвратКТК.Получить();

	Тема = "Контейнеры к сдаче";
	ТекстПисьма = "";
	ПолучателиПисьма = Новый Массив;
	
	ПараметрыОтправкиПисьма = новый Структура;
	ПараметрыОтправкиПисьма.Вставить("Тема", Тема);
	ПараметрыОтправкиПисьма.Вставить("Тело", ТекстПисьма);
	ПараметрыОтправкиПисьма.Вставить("ТипТекста", "HTML");
	
	Если ТипЗнч(ПользователиДляРассылки) = Тип("СправочникСсылка.Пользователи") Тогда
		EMAIL = ПолучитьEMAILПользователя(ПодобратьЗамещение(ПользователиДляРассылки, ТекущаяДата()));
		Если ЗначениеЗаполнено(EMAIL) Тогда
			ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", Строка(ПользователиДляРассылки), EMAIL));
		КонецЕсли;
	Иначе
		ПользователиГруппы = Пользователи_sd_сервер.ПолучитьПользователейГруппы(ПользователиДляРассылки);
		Для каждого ПользовательЪ из ПользователиГруппы Цикл
			EMAIL = ПолучитьEMAILПользователя(ПодобратьЗамещение(ПользовательЪ, ТекущаяДата()));
			Если ЗначениеЗаполнено(EMAIL) Тогда
				ПолучателиПисьма.Добавить(Новый Структура("Представление, Адрес", Строка(ПользовательЪ), EMAIL));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// для каждого пользователя из константы будет 2 типа письма - владельцу КТК и клиенту.
	
	
	
	// запрос по Клиенту	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РассылкаПоСдачеКТК.Период КАК Период,
	|	РассылкаПоСдачеКТК.Контейнер КАК Контейнер,
	|	РассылкаПоСдачеКТК.ИнформироватьЗаКолвоДней КАК ИнформироватьЗаКолвоДней,
	|	РассылкаПоСдачеКТК.ДатаСдачи КАК ДатаСдачи,
	|	РАЗНОСТЬДАТ(&ТекДата, НАЧАЛОПЕРИОДА(РассылкаПоСдачеКТК.ДатаСдачи, ДЕНЬ), ДЕНЬ) КАК ДнейДоСдачи,
	|	РассылкаПоСдачеКТК.ОтправленоПоКлиенту КАК ОтправленоПоКлиенту,
	|	РассылкаПоСдачеКТК.ОтправленоПоВладельцу КАК ОтправленоПоВладельцу,
	|	РассылкаПоСдачеКТК.Клиент КАК Клиент,
	|	РассылкаПоСдачеКТК.ВладелецКТК КАК ВладелецКТК,
		// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 30.11.2022
		//РассылкаПоСдачеКТК.ДоговорКлиента.ОтветственныйЗаСопровождение КАК ДоговорКлиентаОтветственныйЗаСопровождение,
	|	ТЧОтветственные.Ответственный КАК ДоговорКлиентаОтветственныйЗаСопровождение,
		// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 30.11.2022
	|	РассылкаПоСдачеКТК.ДоговорКлиента КАК ДоговорКлиента,
	|	РассылкаПоСдачеКТК.ДоговорВладельца КАК ДоговорВладельца
	|ИЗ
	|	РегистрСведений.РассылкаПоСдачеКТК КАК РассылкаПоСдачеКТК
			// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 30.11.2022
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.Ответственные КАК ТЧОтветственные
	|		ПО РассылкаПоСдачеКТК.ДоговорКлиента = ТЧОтветственные.Ссылка
	|			И (ТЧОтветственные.ЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ОсновнойЦФО))
	|			И (ТЧОтветственные.ТипОтветственного = ЗНАЧЕНИЕ(Перечисление.ТипыОтветственных.ОтветственныйЗаСопровождение))
			// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 30.11.2022	
	|ГДЕ
	|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(РассылкаПоСдачеКТК.ДатаСдачи, ДЕНЬ), ДЕНЬ, -РассылкаПоСдачеКТК.ИнформироватьЗаКолвоДней) <= &ТекДата
	|	И НЕ РассылкаПоСдачеКТК.ОтправленоПоКлиенту
	|ИТОГИ ПО
	|	ДоговорКлиентаОтветственныйЗаСопровождение";
	
	Запрос.УстановитьПараметр("ТекДата",НачалоДня(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДоговорКлиента = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	//Евросиб СубботинВ #117990 20.01.2026 Начало

	//Пока ВыборкаДоговорКлиента.Следующий() Цикл
	//	
	//	Если НЕ ЗначениеЗаполнено(ВыборкаДоговорКлиента.ДоговорКлиентаОтветственныйЗаСопровождение) Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	ВыборкаДетальныеЗаписи = ВыборкаДоговорКлиента.Выбрать();
	//
	//	ОтправкаПисьмаПоГруппировкам(СистемнаяУчетнаяЗапись, ПараметрыОтправкиПисьма, ПолучателиПисьма,ВыборкаДетальныеЗаписи,ВыборкаДоговорКлиента.ДоговорКлиентаОтветственныйЗаСопровождение,1);
	//	
	//КонецЦикла;

	Пока ВыборкаДоговорКлиента.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(ВыборкаДоговорКлиента.ДоговорКлиентаОтветственныйЗаСопровождение) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если ТипЗнч(ВыборкаДоговорКлиента.ДоговорКлиентаОтветственныйЗаСопровождение) = Тип("СправочникСсылка.ГруппыПользователей") Тогда
			СоставГруппы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДоговорКлиента.ДоговорКлиентаОтветственныйЗаСопровождени, "Состав");
			Если СоставГруппы.Количество() > 0 Тогда
				Ответственный = СоставГруппы[0].Пользователь;
			КонецЕсли;
		Иначе				
			Ответственный =	ВыборкаДоговорКлиента.ДоговорКлиентаОтветственныйЗаСопровождение;
		КонецЕсли;	
				
		ВыборкаДетальныеЗаписи = ВыборкаДоговорКлиента.Выбрать();
		
		ОтправкаПисьмаПоГруппировкам(СистемнаяУчетнаяЗапись, ПараметрыОтправкиПисьма, ПолучателиПисьма,ВыборкаДетальныеЗаписи,Ответственный,1);
		
	КонецЦикла;
    //Евросиб СубботинВ #117990 20.01.2026 Конец
	
	
	
	// запрос по владельцу
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РассылкаПоСдачеКТК.Период КАК Период,
		|	РассылкаПоСдачеКТК.Контейнер КАК Контейнер,
		|	РассылкаПоСдачеКТК.ИнформироватьЗаКолвоДней КАК ИнформироватьЗаКолвоДней,
		|	РассылкаПоСдачеКТК.ДатаСдачи КАК ДатаСдачи,
		|	РАЗНОСТЬДАТ(&ТекДата, НАЧАЛОПЕРИОДА(РассылкаПоСдачеКТК.ДатаСдачи, ДЕНЬ), ДЕНЬ) КАК ДнейДоСдачи,
		|	РассылкаПоСдачеКТК.ОтправленоПоКлиенту КАК ОтправленоПоКлиенту,
		|	РассылкаПоСдачеКТК.ОтправленоПоВладельцу КАК ОтправленоПоВладельцу,
		|	РассылкаПоСдачеКТК.Клиент КАК Клиент,
		|	РассылкаПоСдачеКТК.ВладелецКТК КАК ВладелецКТК,
			// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 30.11.2022 
		|	ТЧОтветственные.Ответственный КАК ДоговорВладельцаОтветственныйЗаСопровождение,
			// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 30.11.2022
		|	РассылкаПоСдачеКТК.ДоговорКлиента КАК ДоговорКлиента,
		|	РассылкаПоСдачеКТК.ДоговорВладельца КАК ДоговорВладельца
		|ИЗ
		|	РегистрСведений.РассылкаПоСдачеКТК КАК РассылкаПоСдачеКТК
				// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 30.11.2022
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.Ответственные КАК ТЧОтветственные
		|		ПО (РассылкаПоСдачеКТК.ДоговорВладельца = ТЧОтветственные.Ссылка)
		|			И (ТЧОтветственные.ЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ОсновнойЦФО))
		|			И (ТЧОтветственные.ТипОтветственного = ЗНАЧЕНИЕ(Перечисление.ТипыОтветственных.ОтветственныйЗаСопровождение))
				// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 30.11.2022
		|ГДЕ
		|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(РассылкаПоСдачеКТК.ДатаСдачи, ДЕНЬ), ДЕНЬ, -РассылкаПоСдачеКТК.ИнформироватьЗаКолвоДней) <= &ТекДата
		|	И НЕ РассылкаПоСдачеКТК.ОтправленоПоВладельцу
		|ИТОГИ ПО
		|	ДоговорВладельцаОтветственныйЗаСопровождение";
	
	Запрос.УстановитьПараметр("ТекДата",НачалоДня(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДоговорВладельца = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	//Евросиб СубботинВ #117990 20.01.2026 Начало
	
	//	Пока ВыборкаДоговорВладельца.Следующий() Цикл
	//		Если НЕ ЗначениеЗаполнено(ВыборкаДоговорВладельца.ДоговорВладельцаОтветственныйЗаСопровождение) Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		ВыборкаДетальныеЗаписи = ВыборкаДоговорВладельца.Выбрать();
	//	
	//		ОтправкаПисьмаПоГруппировкам(СистемнаяУчетнаяЗапись, ПараметрыОтправкиПисьма, ПолучателиПисьма,ВыборкаДетальныеЗаписи,ВыборкаДоговорВладельца.ДоговорВладельцаОтветственныйЗаСопровождение,2);
	//		
	//	КонецЦикла; 
	
	Пока ВыборкаДоговорВладельца.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(ВыборкаДоговорВладельца.ДоговорКлиентаОтветственныйЗаСопровождение) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если ТипЗнч(ВыборкаДоговорВладельца.ДоговорКлиентаОтветственныйЗаСопровождение) = Тип("СправочникСсылка.ГруппыПользователей") Тогда
			СоставГруппы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДоговорВладельца.ДоговорКлиентаОтветственныйЗаСопровождени, "Состав");
			Если СоставГруппы.Количество() > 0 Тогда
				Ответственный = СоставГруппы[0].Пользователь;
			КонецЕсли;
		Иначе				
			Ответственный =	ВыборкаДоговорВладельца.ДоговорКлиентаОтветственныйЗаСопровождение;
		КонецЕсли;	
		
		ВыборкаДетальныеЗаписи = ВыборкаДоговорВладельца.Выбрать();
		
		ОтправкаПисьмаПоГруппировкам(СистемнаяУчетнаяЗапись, ПараметрыОтправкиПисьма, ПолучателиПисьма,ВыборкаДетальныеЗаписи,Ответственный,1);
		
	КонецЦикла;  	
	//Евросиб СубботинВ #117990 20.01.2026 Конец  	
	// 15.05.20
	
	
КонецПроцедуры


Процедура ОтправкаПисьмаПоГруппировкам(СистемнаяУчетнаяЗапись, ПараметрыОтправкиПисьма, ПолучателиПисьма, ВыборкаДетальныеЗаписи, ОтветственныйЗаСопровождение,ОчередностьПисем)
	
	ПолучателиПисьмаВсе = Новый Массив;
	Для Каждого Эл Из ПолучателиПисьма Цикл
		ПолучателиПисьмаВсе.Добавить(Эл);
	КонецЦикла;
	
	// дла каждого зачения из ответственного за сопросвождения проверяем наличие электронной почты 
	// (ответственный может быть группой лиц)
	// добавляем ответственного в массив получателей письма. проверяем на уникальность
	Если ТипЗнч(ОтветственныйЗаСопровождение) = Тип("СправочникСсылка.Пользователи") Тогда
		EMAIL = ПолучитьEMAILПользователя(ПодобратьЗамещение(ОтветственныйЗаСопровождение, ТекущаяДата()));
		Если ЗначениеЗаполнено(EMAIL) Тогда
			ПОлучательКонтр = Новый Структура("Представление, Адрес", Строка(ОтветственныйЗаСопровождение), EMAIL);
			Если ПолучателиПисьмаВсе.Найти(ПОлучательКонтр) = Неопределено ТОгда
				ПолучателиПисьмаВсе.Добавить(ПОлучательКонтр);
			КонецЕсли;
		КонецЕсли;
	Иначе
		ПользователиГруппы = Пользователи_sd_сервер.ПолучитьПользователейГруппы(ОтветственныйЗаСопровождение);
		Для каждого ПользовательЪ из ПользователиГруппы Цикл
			EMAIL = ПолучитьEMAILПользователя(ПодобратьЗамещение(ПользовательЪ, ТекущаяДата()));
			Если ЗначениеЗаполнено(EMAIL) Тогда
				ПолучательКонтр = Новый Структура("Представление, Адрес", Строка(ПользовательЪ), EMAIL);
				Если ПолучателиПисьмаВсе.Найти(ПОлучательКонтр) = Неопределено ТОгда
					ПолучателиПисьмаВсе.Добавить(ПОлучательКонтр);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	
	ПараметрыОтправкиПисьма.Вставить("Кому", ПолучателиПисьмаВсе);
	// для вложений
	Соответствие = Новый Соответствие();
	

	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	
	Макет = РегистрыСведений.РассылкаПоСдачеКТК.ПолучитьМакет("МакетРассылкиСдачаКТК");
	
	ТабДок.НачатьАвтогруппировкуКолонок();
	
	// заполнение таблицы макета
	Область = Макет.ПолучитьОбласть("ОбластьШапка"); 
	ТабДок.Вывести(Область);
	
	НомерСтр = 1;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Область = Макет.ПолучитьОбласть("ОбластьСтроки"); 
		Область.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		Область.Параметры.НомерПП = НомерСтр;
		ТабДок.Вывести(Область);
		
		НомерСтр = НомерСтр+1;
		
	КонецЦикла;
		
	// сформировать табличный документ
	ТабДок.ЗакончитьАвтогруппировкуКолонок();
	ТабДок.ОтображатьСетку = Истина;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;		
	ИмяФайла = ПолучитьИмяВременногоФайла("xlsx");
	ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
	
	ФайлВложения = Новый ДвоичныеДанные(ИмяФайла);
	
	Соответствие.Вставить("Контейнеры к сдаче.xlsx",ФайлВложения);

	ПараметрыОтправкиПисьма.Вставить("Вложения", Соответствие);

	РЕЗУЛЬТАТ = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(СистемнаяУчетнаяЗапись, ПараметрыОтправкиПисьма);

	// перезаписать данные регистра только в том случае, если письма ушли по КЛИЕНТУ (ОчередностьПисем = 1)
	Если ЗначениеЗаполнено(РЕЗУЛЬТАТ) И ОчередностьПисем = 1 Тогда
		ВыборкаДетальныеЗаписи.Сбросить();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			МенеджерЗаписи = РегистрыСведений.РассылкаПоСдачеКТК.СоздатьМенеджерЗаписи(); 
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи,ВыборкаДетальныеЗаписи,,"ОтправленоПоКлиенту");
			МенеджерЗаписи.ОтправленоПоКлиенту = Истина;
			МенеджерЗаписи.Записать();
		КонецЦикла;
	КонецЕсли;
	// перезаписать данные регистра только в том случае, если письма ушли по ВЛАДЕЛЬЦУ (ОчередностьПисем = 2)
	Если ЗначениеЗаполнено(РЕЗУЛЬТАТ) И ОчередностьПисем = 2 Тогда
		ВыборкаДетальныеЗаписи.Сбросить();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			МенеджерЗаписи = РегистрыСведений.РассылкаПоСдачеКТК.СоздатьМенеджерЗаписи(); 
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи,ВыборкаДетальныеЗаписи,,"ОтправленоПоВладельцу");
			МенеджерЗаписи.ОтправленоПоВладельцу = Истина;
			МенеджерЗаписи.Записать();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ПодобратьЗамещение(Пользователь, ДатаЗамещения) Экспорт
	
	Результат = Пользователь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗамещениеЪ.Замещение КАК Замещение
	               |ИЗ
	               |	Документ.Замещение КАК ЗамещениеЪ
	               |ГДЕ
	               |	ЗамещениеЪ.Проведен
	               |	И ЗамещениеЪ.РежимДокумента = 0
	               |	И ЗамещениеЪ.ИсходныйПользователь = &ИсходныйПользователь
	               |	И &ДатаДокумента МЕЖДУ ЗамещениеЪ.НачалоПериодаЗамещения И ЗамещениеЪ.КонецПериодаЗамещения";
	Запрос.УстановитьПараметр("ИсходныйПользователь", Пользователь);
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаЗамещения);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Замещение;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
