//ДИТ, Беляев СЮ, Ticket#0285135, 09-09-2022, начало
Функция ПолучитьНаименованиеДляНовогоЭлемента(вхСсылка, вхКлиент, вхПериодРеестраНачало, вхПериодРеестраОкончание) Экспорт
	Результат = СтрШаблон("%1_%2", ПолучитьДатуБезВремени(ТекущаяДата()), вхКлиент);
	Если ЗначениеЗаполнено(вхПериодРеестраНачало) И ЗначениеЗаполнено(вхПериодРеестраОкончание) Тогда
		Результат = СтрШаблон("№ %1_%2", ПолучитьДатуБезВремени(вхПериодРеестраНачало), ПолучитьДатуБезВремени(вхПериодРеестраОкончание));
	КонецЕсли;  
	Результат = Сред(Результат, 1, Метаданные.Справочники.РеестрыСогласования.ДлинаНаименования);
	Возврат Результат;
КонецФункции      
//ДИТ, Беляев СЮ, Ticket#0285135, 09-09-2022, конец

//ДИТ, Беляев СЮ, Ticket#0285135, 09-09-2022, начало
&НаСервере
Функция ПолучитьДатуБезВремени(вхДата)
	Возврат Формат(вхДата, "ДФ=dd.MM.yy");
КонецФункции
//ДИТ, Беляев СЮ, Ticket#0285135, 09-09-2022, конец

//ДИТ, Беляев СЮ, Ticket#0285135, 09-09-2022, начало
Функция ЕстьРеестрСАналогичнымНаименованием(вхСсылка, вхКлиент, вхНаименование) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РеестрыСогласования.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РеестрыСогласования КАК РеестрыСогласования
		|ГДЕ
		|	РеестрыСогласования.Клиент = &Клиент
		|	И РеестрыСогласования.Наименование = &Наименование
		|	И РеестрыСогласования.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Клиент", вхКлиент);
	Запрос.УстановитьПараметр("Наименование", вхНаименование);
	Запрос.УстановитьПараметр("Ссылка", вхСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой();
КонецФункции
//ДИТ, Беляев СЮ, Ticket#0285135, 09-09-2022, конец

//ДИТ, Беляев СЮ, Ticket#0304638, 17-03-2023, начало
//ИСПОЛЬЗУЕТСЯ ПРИ СОЗДАНИИ РЕЕСТРОВ ИЗ ОБРАБОТКИ "ЗагрузкаРеестраВСК"
Функция ПолучитьНаименованиеДляСледующейВерсииРеестра(вхРеестр, вхКлиент, вхНаименование) Экспорт

	Результат = СокрП(вхНаименование); //убраны проблемы справа
	НаименованиеСРезервомДляИтератора = Сред(Результат, 1, Метаданные.Справочники.РеестрыСогласования.ДлинаНаименования-4); //отсекаем правые 3 символа и 1 пробел для итератора ... #XX
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеестрыСогласования.Наименование КАК Наименование
		|ИЗ
		|	Справочник.РеестрыСогласования КАК РеестрыСогласования
		|ГДЕ
		|	РеестрыСогласования.Клиент = &Клиент
		|	И РеестрыСогласования.Наименование ПОДОБНО &Наименование
		|	И РеестрыСогласования.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Клиент", вхКлиент);
	Запрос.УстановитьПараметр("Наименование", СокрП(НаименованиеСРезервомДляИтератора)+"%");
	Запрос.УстановитьПараметр("Ссылка", вхРеестр);
	ТаблицаЗанятыхНаименований = Запрос.Выполнить().Выгрузить();
	
	Для счетчик = 1 По 99 Цикл //100 версий одного наименования реестра будет достаточно
		ПроверяемоеНаименование = СтрШаблон("%1 #%2", НаименованиеСРезервомДляИтератора, счетчик);
		Если ТаблицаЗанятыхНаименований.Найти(ПроверяемоеНаименование, "Наименование") = Неопределено Тогда
			Результат = ПроверяемоеНаименование;
			Прервать;
		КонецЕсли;
	КонецЦикла;   
	
	Возврат Результат;
КонецФункции
//ДИТ, Беляев СЮ, Ticket#0304638, 17-03-2023, конец