
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Маршрутизировать = Константы.МаршрутизироватьЗакрытиеПериода.Получить();
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Организация = Константы.ОсновнаяОрганизация.Получить();
	//Евросиб Каблов 09.06.2021 ( 29035
	ВключитьРассылку = Истина;
	//Евросиб Каблов 09.06.2021 )
//Евросиб Гудкова( 25.10.2021 Ticket№ САД
	//НСтр = РеглОперации.Добавить();
	//НСтр.Операция = "Снятие с мониторинга СПАРК контрагентов, по которым не было движений " + Константы.СрокМесяцевСнятияКонтрагентовСМониторинга.Получить() + " мес.";
	//НСтр.КодОперации = "01";
	//
	//НСтр = РеглОперации.Добавить();
	//НСтр.Операция = "Постановка на мониторинг СПАРК контрагентов, по которым появились движения";
	//НСтр.КодОперации = "02";
	//
	//НСтр = РеглОперации.Добавить();
	//НСтр.Операция = "Обновление индексов СПАРК по контрагентам на мониторинге";
	//НСтр.КодОперации = "03";
	//
	////НСтр = РеглОперации.Добавить();
	////НСтр.Операция = "Проверка задолженности покупателей и отнесение их в стоп-лист";
	////НСтр.КодОперации = "04";
	//
	////Евросиб Каблов 26.02.2020 ( Ticket#0182095
	//НСтр = РеглОперации.Добавить();
	//НСтр.Операция = "Расчет плановой категории контрагентов";
	//НСтр.КодОперации = "05";
	////Евросиб Каблов 26.02.2020 )
	ЗакрытиеПериодаВО = Истина;
	ФиксацияТекущегоПериода = Истина;
	ФиксацияНЗП = Истина;
// Евросиб Гудкова)	
	
	ПериодБлокировки = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Организация);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Маршрутизировать = Константы.МаршрутизироватьЗакрытиеПериода.Получить();
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Редактор = неопределено;
	Изменено = неопределено;
	Состояния.Очистить();
	//Евросиб Каблов 09.06.2021 ( 29035
	ВключитьРассылку = Истина;
	//Евросиб Каблов 09.06.2021 )
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	
	//Евросиб Коханенко Н.А. 23.11.2023 (( US #77191 TASK #77192
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
		И Проведен 
		И НЕ РольДоступна("ПолныеПрава") Тогда
		ОбщегоНазначения.СообщитьПользователю("Повторное проведение документа запрещено. Обратитесь в техническую поддержку.",,,, Отказ);
		Возврат;
	КонецЕсли;
	//Евросиб Коханенко Н.А. 23.11.2023 )) US #77191 TASK #77192  

	// + Состояния
	
	// проверяем корректность перечня состояний в ТЧ Состояния
	Для Сч = 0 По Состояния.Количество() - 2 Цикл
		ТекСостояние = Состояния[Сч].Состояние;
		Для ТекСч = Сч + 1 По Состояния.Количество() - 1 Цикл
			Если Состояния[ТекСч].Состояние = ТекСостояние Тогда
				Сообщить("Ошибка: одно состояние может встречаться в документе только один раз!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
		
	//МаршрутизацияСервер.ПараллельноеСогласование(Состояния); //ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, закомментировал (перенёс ниже)
	
	// Маршрутизация заказа
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = 
	НЕ ЗначениеЗаполнено(Ссылка) ИЛИ 
	Ссылка.Организация <> Организация ИЛИ Состояния.Количество() = 0;
	
	Если Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Организация);
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьЗакрытиеПериода(ПараметрыЗапроса, Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			УказанныеВручнуюИспНаблюдатель = Новый СписокЗначений;
			Если ДополнительныеСвойства.Свойство("ДопСвойстваОбъекта") тогда
				УказанныеВручнуюИспНаблюдатель = ДополнительныеСвойства.ДопСвойстваОбъекта;
			КонецЕсли;
			МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъект, РезультатЗапроса, Автор, УказанныеВручнуюИспНаблюдатель);			
		КонецЕсли;
	КонецЕсли;
	
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, начало
	МаршрутизацияСервер.ПараллельноеСогласование(Состояния);
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, конец
	
	// если исполнитель пустой, то проставляем тек пользователя
	Для каждого Стр из Состояния Цикл
		Если Стр.ПримечаниеЗадачаИсполнителю Тогда
			// если текст примечания изменился, то создать новое сообщение. если остался прежним, то не менять
			// т.к. состояние уникально, ищем по нему
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Состояние",Стр.Состояние);
			НайденнаяСтр = Ссылка.Состояния.НайтиСтроки(ПараметрыОтбора);
			Если НайденнаяСтр.Количество()>0 Тогда
				Если НЕ НайденнаяСтр[0].Комментарий = Стр.Комментарий Тогда
					
					// +Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					ДатаСообщения = ТекущаяДата();
					АвторСообщения = Пользователи.ТекущийПользователь();
					ТекстСообщения = Стр.Комментарий;
					ГУИДСообщения = Новый УникальныйИдентификатор();
					
					ГУИДТемы = Новый УникальныйИдентификатор;
					
					РассылкаПоЛичнымЦелям.СформироватьЛичноеСообщение(ГУИДТемы, , Ссылка, ДатаСообщения, АвторСообщения, ТекстСообщения, , ГУИДСообщения, Стр.Исполнитель);
					// -Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	МаршрутизацияСервер.ПостобработкаТЧСостояний(ЭтотОбъект, Автор);
	// при проведении установить статус Выполнено
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Для Каждого Стр Из Состояния Цикл
			Стр.Статус = Перечисления.СтатусыЭтапов.Выполнен;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#Область  переделано  //Евросиб. Гонтаренко( 06.06.2021 
	
Процедура ПерезаполнитьДвиженияСделка_ЗакрытиеПериодов(ТЗВх)

//	ТЗ_ПереносРасходов = ПолучитьВсеПереносыПоСделкам(ТЗВх.ВыгрузитьКолонку("Сделка"));
//	
//	// Процедура обхода как в Проведении Сделки (ОБЯЗАТЕЛЬНО ОБНОВЛЯТЬ)
//	
//	Для каждого Стр_ТЗСделок Из ТЗВх Цикл
//		
//		Если Не ЗначениеЗаполнено(Стр_ТЗСделок.Сделка) Тогда
//		
//			Продолжить;
//		
//		КонецЕсли; 
//		
//		Если ТипЗнч(Стр_ТЗСделок.Сделка) = Тип("ДокументСсылка.Сделка") Тогда
//		
//			НЗСделки = РегистрыНакопления.ЗакрытиеПериодов.СоздатьНаборЗаписей();
//			НЗСделки.Отбор.Регистратор.Установить(Стр_ТЗСделок.Сделка);
//			
//			Для каждого Стр из Стр_ТЗСделок.Сделка.Расходы Цикл
//				
//				Если Стр.НеВключатьВПлановыеРасходы Тогда Продолжить; КонецЕсли;
//				Если Стр.Подсыл Тогда Продолжить; КонецЕсли;
//				
//				Если Не ЗначениеЗаполнено(Стр.ПериодВО) Тогда
//				
//					Продолжить;
//				
//				КонецЕсли; 
//				
//				РезДан = ОпределитьПериодВО(ТЗ_ПереносРасходов, "Сделка", Стр_ТЗСделок.Сделка, Стр.ГУИД, Стр.ПериодВО);
//				НовПериодВО = РезДан.НовПериодВО;
//				
//				Если Стр.ОтнестиНаЗатраты Тогда
//					
//					ГУИДДоходов = "ОтнестиНаЗатраты";
//					
//				Иначе
//					
//					ГУИДДоходов = "";
//					
//					МасРезПоиска = Стр_ТЗСделок.Сделка.СвязьДоходовИРасходов.НайтиСтроки(Новый Структура("Расходы", Стр.ГУИД) );
//					Для каждого Стр2 Из МасРезПоиска Цикл
//						
//						ГУИДДоходов = Стр2.Доходы;
//						
//						// Пропускаем данную запись, если ГУИД доходов пуст (в такой ситуации запись без дохода делается ниже)
//						Если ГУИДДоходов = "" Тогда
//							Продолжить;
//						КонецЕсли; 
//						
//						Движение 					= НЗСделки.ДобавитьПриход();
//						Движение.Договор 			= Стр.Договор;
//						Движение.Контрагент 		= Стр.Поставщик;
//						Движение.Период 			= НовПериодВО;
//						Движение.ПериодВО 			= НовПериодВО;
//						Движение.ПланФакт 			= Перечисления.ПланФактСчет.План;
//						Движение.Регистратор 		= Стр_ТЗСделок.Сделка;
//						Движение.Сделка 			= Стр_ТЗСделок.Сделка;
//						Движение.СуммаРасхода 		= Стр.СуммаИтого;
//						Движение.СуммаНДСРасхода	= Стр.СуммаНДС;
//						Движение.Услуга 			= Стр.Услуга;
//						Движение.ГУИДСтроки 		= Стр.ГУИД;
//						Движение.ГУИДДоходов 		= ГУИДДоходов;
//						Движение.Организация 		= Стр_ТЗСделок.Сделка.Организация;
//						Движение.Перевыставляемая 	= Стр.Перевыставляемая;
//						Движение.ЗакрытиеПериодовДок= РезДан.ЗакрытиеПериодов;
//						
//					КонецЦикла; 
//					
//				КонецЕсли; 
//				
//				// В ситуации, когда связанный доход не найден или ОтнестиНаЗатраты
//				Если ГУИДДоходов = "" ИЛИ ГУИДДоходов = "ОтнестиНаЗатраты" Тогда
//					
//					Движение 					= НЗСделки.ДобавитьПриход();
//					Движение.Договор 			= Стр.Договор;
//					Движение.Контрагент 		= Стр.Поставщик;
//					Движение.Период 			= НовПериодВО;
//					Движение.ПериодВО 			= НовПериодВО;
//					Движение.ПланФакт 			= Перечисления.ПланФактСчет.План;
//					Движение.Регистратор 		= Стр_ТЗСделок.Сделка;
//					Движение.Сделка 			= Стр_ТЗСделок.Сделка;
//					Движение.СуммаРасхода 		= Стр.СуммаИтого;
//					Движение.СуммаНДСРасхода	= Стр.СуммаНДС;
//					Движение.Услуга 			= Стр.Услуга;
//					Движение.ГУИДСтроки 		= Стр.ГУИД;
//					Движение.ГУИДДоходов 		= ГУИДДоходов;
//					Движение.Организация 		= Стр_ТЗСделок.Сделка.Организация;
//					Движение.Перевыставляемая 	= Стр.Перевыставляемая;
//					Движение.ЗакрытиеПериодовДок= РезДан.ЗакрытиеПериодов;
//					
//				КонецЕсли; 
//				
//			КонецЦикла;
//			
//			НЗСделки.Записать();
//			
//		КонецЕсли; 
//		
//	КонецЦикла;

КонецПроцедуры

Процедура ПерезаполнитьДвиженияАкцепт_ЗакрытиеПериодов(ТЗВх)

//	ТЗ_ПереносРасходов2 = ПолучитьВсеПереносыПоАкцептам(ТЗВх.ВыгрузитьКолонку("Акцепт"));
//	
//	// Процедура обхода как в Проведении Сделки (ОБЯЗАТЕЛЬНО ОБНОВЛЯТЬ)
//	//ОбщСч = 0;
//	Для каждого Стр_ТЗСделок Из ТЗВх Цикл
//		
//		Если Не ЗначениеЗаполнено(Стр_ТЗСделок.Акцепт) Тогда
//		
//			Продолжить;
//		
//		КонецЕсли; 
//		
//		НЗАкцепта = РегистрыНакопления.ЗакрытиеПериодов.СоздатьНаборЗаписей();
//		НЗАкцепта.Отбор.Регистратор.Установить(Стр_ТЗСделок.Акцепт);
////Евросиб. Гонтаренко( 06.06.2021 #35154  ?Куда оно девалось? Девалось ли?	
//		НЗАкцепта.Записать();
////Евросиб. Гонтаренко) 06.06.2021 #35154	
//		
//		ТекАкцепт = Стр_ТЗСделок.Акцепт;
//		
//		//РеквизитыПоступления = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекАкцепт.Поступление, "Контрагент, Договорконтрагента");
//		Контрагент = ТекАкцепт.Поступление.Контрагент;
//		ДоговорКонтрагента = ТекАкцепт.Поступление.ДоговорКонтрагента;
//		
//		// Оптимизация проводки Акцепта (Шейко О.Е. 20.01.2021)
//		ТЗ_Вх = Новый ТаблицаЗначений; 
//		ТЗ_Вх.Колонки.Добавить("Сделка", Новый ОписаниеТипов("ДокументСсылка.Сделка"));
//		ТЗ_Вх.Колонки.Добавить("ГУИДСтроки", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50) ) );
//		
//		Для каждого Стр из ТекАкцепт.Услуги Цикл
//			
//			Если Не ЗначениеЗаполнено(Стр.ИдентификаторСтрокиРасходовВСделке) ИЛИ НЕ ЗначениеЗаполнено(Стр.Сделка) Тогда
//				
//				Продолжить;
//				
//			КонецЕсли; 
//			
//			НовСтр_ТЗ_Вх = ТЗ_Вх.Добавить();
//			НовСтр_ТЗ_Вх.Сделка = Стр.Сделка;
//			НовСтр_ТЗ_Вх.ГУИДСтроки = Стр.ИдентификаторСтрокиРасходовВСделке;
//		
//		КонецЦикла; 
//		
//		ДанПоЗакр = ПолучитьДанПоЗакрытиюАкцепта(ТЗ_Вх);
//		
//		ТЗ_Вх = Неопределено;
//		
//		Для каждого Стр из ТекАкцепт.Услуги Цикл
//			
//			// Строка не разнесена:
//			Если Не ЗначениеЗаполнено(Стр.ИдентификаторСтрокиРасходовВСделке) ИЛИ НЕ ЗначениеЗаполнено(Стр.Сделка) Тогда
//				
//				Продолжить;
//				
//			КонецЕсли; 
//			
//			// В отчет должны падать отдельно Сумма без НДС и Сумма НДС
//			СуммаВРамкахЭтогоДвижения = ?(ЗначениеЗаполнено(Стр.ПодтвержденнаяСумма), Стр.ПодтвержденнаяСумма, Стр.ПоступлениеСумма);
//			
//			ПодтверждСуммаНДССтроки = Стр.ПоступлениеСуммаНДС;
//			
//			РезДан = ОпределитьПериодВО(ТЗ_ПереносРасходов2, "Акцепт", ТекАкцепт, Стр.ИдентификаторСтрокиРасходовВСделке, ТекАкцепт.ПериодВО);
//			ТекПериодВО = РезДан.НовПериодВО;
//			
//			// Здесь был запрос (занимал 47 сек из 76 на 18263 записях)
//			Ответ = ДанПоЗакр.НайтиСтроки(Новый Структура("Сделка, ГУИДСтроки", Стр.Сделка, Стр.ИдентификаторСтрокиРасходовВСделке) );
//			
//			ДанВыборка = Неопределено;
//			//Если Ответ.Следующий() Тогда
//			Если Ответ.Количество() > 0 Тогда
//				ТекСтр = Ответ[0];
//				ДанВыборка = ТекСтр;
//				
//			КонецЕсли;
//			
//			//ОбщСч = ОбщСч +1;
//			//Если ОбщСч = 18263 Тогда
//			//
//			//	а = 1;
//			//
//			//КонецЕсли; 
//			
//			Если Стр.ПолностьюРазнесено Тогда
//				
//				Если ДанВыборка = Неопределено Тогда
//					// Прошлого движения не найдено
//					Движение 					= НЗАкцепта.ДобавитьРасход();
//					Движение.ГУИДСтроки 		= Стр.ИдентификаторСтрокиРасходовВСделке;
//					Движение.Договор 			= ДоговорКонтрагента;
//					Движение.Контрагент 		= Контрагент;
//					Движение.Организация 		= ТекАкцепт.Организация;
//					Движение.Период				= ТекПериодВО;
//					Движение.ПериодВО			= НачалоМесяца(ТекПериодВО);
//					Движение.ПланФакт			= Перечисления.ПланФактСчет.План;
//					Движение.Регистратор		= ТекАкцепт;
//					Движение.Сделка				= Стр.Сделка;
//					Движение.СуммаРасхода		= СуммаВРамкахЭтогоДвижения;
//					Движение.СуммаНДСРасхода	= ПодтверждСуммаНДССтроки;
//					Движение.Услуга				= Стр.НоменклатураСделки;
//					//Движение.Перевыставляемая 	= Стр.Перевыставление;
//					Движение.Перевыставляемая	= Стр.ВидРасходов = Перечисления.ВидыРасходов.Возмещаемые;
//					Движение.ЗакрытиеПериодовДок= РезДан.ЗакрытиеПериодов;
//					
//				Иначе
//					
//					ДвижениеСторно = НЗАкцепта.ДобавитьРасход();
//					ЗаполнитьЗначенияСвойств(ДвижениеСторно, ДанВыборка);
//					ДвижениеСторно.Период 		= ТекПериодВО;
//					ДвижениеСторно.ПериодВО		= НачалоМесяца(ТекПериодВО);
//					ДвижениеСторно.СуммаРасхода = ДанВыборка.СуммаРасхода;				
//					ДвижениеСторно.СуммаНДСРасхода = ДанВыборка.СуммаНДСРасхода;
//					ДвижениеСторно.ЗакрытиеПериодовДок= РезДан.ЗакрытиеПериодов;
//					
//				КонецЕсли; 
//				
//			Иначе
//				
//				// Частичное:
//				Если ДанВыборка = Неопределено Тогда
//					
//					// Прошлого движения не найдено
//					Движение 					= НЗАкцепта.ДобавитьРасход();
//					Движение.ГУИДСтроки 		= Стр.ИдентификаторСтрокиРасходовВСделке;
//					Движение.Договор 			= ДоговорКонтрагента;
//					Движение.Контрагент 		= Контрагент;
//					Движение.Организация 		= ТекАкцепт.Организация;
//					Движение.Период				= ТекПериодВО;
//					Движение.ПериодВО			= НачалоМесяца(ТекПериодВО);
//					Движение.ПланФакт			= Перечисления.ПланФактСчет.План;
//					Движение.Регистратор		= ТекАкцепт;
//					Движение.Сделка				= Стр.Сделка;
//					Движение.СуммаРасхода		= СуммаВРамкахЭтогоДвижения;
//					Движение.СуммаНДСРасхода	= ПодтверждСуммаНДССтроки;
//					Движение.Услуга				= Стр.НоменклатураСделки;
//					//Движение.Перевыставляемая 	= Стр.Перевыставление;
//					Движение.Перевыставляемая	= Стр.ВидРасходов = Перечисления.ВидыРасходов.Возмещаемые;
//					Движение.ЗакрытиеПериодовДок= РезДан.ЗакрытиеПериодов;
//					
//				Иначе
//					
//					// Прошлое движение найдено. Заполним по нему расход с учетом текущей суммы:
//					ДвижениеСторно = НЗАкцепта.ДобавитьРасход();
//					ЗаполнитьЗначенияСвойств(ДвижениеСторно, ДанВыборка);
//					ДвижениеСторно.Период 		= ТекПериодВО;
//					ДвижениеСторно.ПериодВО		= НачалоМесяца(ТекПериодВО);
//					ДвижениеСторно.СуммаРасхода = СуммаВРамкахЭтогоДвижения;
//					ДвижениеСторно.СуммаНДСРасхода = ПодтверждСуммаНДССтроки;
//					ДвижениеСторно.ЗакрытиеПериодовДок= РезДан.ЗакрытиеПериодов;
//					
//				КонецЕсли; 
//				
//			КонецЕсли; 
//			
//			// Если пришли сюда, то информация по приходу пишется всегда
//			Движение 					= НЗАкцепта.ДобавитьПриход();
//			Движение.ГУИДСтроки 		= Стр.ИдентификаторСтрокиРасходовВСделке;
//			Движение.Договор 			= ДоговорКонтрагента;
//			Движение.Контрагент 		= Контрагент;
//			Движение.Организация 		= ТекАкцепт.Организация;
//			Движение.Период				= ТекПериодВО;
//			Движение.ПериодВО			= НачалоМесяца(ТекПериодВО);
//			Движение.ПланФакт			= Перечисления.ПланФактСчет.Факт;
//			Движение.Регистратор		= ТекАкцепт;
//			Движение.Сделка				= Стр.Сделка;
//			Движение.СуммаРасхода		= СуммаВРамкахЭтогоДвижения;
//			Движение.СуммаНДСРасхода	= ПодтверждСуммаНДССтроки;
//			Движение.Услуга				= Стр.НоменклатураСделки;
//			//Движение.Перевыставляемая 	= Стр.Перевыставление;
//			Движение.Перевыставляемая	= Стр.ВидРасходов = Перечисления.ВидыРасходов.Возмещаемые;
//			Движение.ЗакрытиеПериодовДок= РезДан.ЗакрытиеПериодов;
//			
//		КонецЦикла;
//		
//		НЗАкцепта.Записать();
//		
//	КонецЦикла;

КонецПроцедуры

Функция ПолучитьДанПоЗакрытиюАкцепта(ТЗ_Вх)

//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	ТекТаб.Сделка КАК Сделка,
//	               |	ТекТаб.ГУИДСтроки КАК ГУИДСтроки
//	               |ПОМЕСТИТЬ Таб
//	               |ИЗ
//	               |	&ТЗ_Вх КАК ТекТаб
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ЗакрытиеПериодов.Период КАК Период,
//	               |	ЗакрытиеПериодов.Регистратор КАК Регистратор,
//	               |	ЗакрытиеПериодов.НомерСтроки КАК НомерСтроки,
//	               |	ЗакрытиеПериодов.Активность КАК Активность,
//	               |	ЗакрытиеПериодов.ПланФакт КАК ПланФакт,
//	               |	ЗакрытиеПериодов.ПериодВО КАК ПериодВО,
//	               |	ЗакрытиеПериодов.Корректировка КАК Корректировка,
//	               |	ЗакрытиеПериодов.Сделка КАК Сделка,
//	               |	ЗакрытиеПериодов.Услуга КАК Услуга,
//	               |	ЗакрытиеПериодов.Контрагент КАК Контрагент,
//	               |	ЗакрытиеПериодов.Договор КАК Договор,
//	               |	ЗакрытиеПериодов.ГУИДСтроки КАК ГУИДСтроки,
//	               |	ЗакрытиеПериодов.ГУИДДоходов КАК ГУИДДоходов,
//	               |	ЗакрытиеПериодов.Организация КАК Организация,
//	               |	ЗакрытиеПериодов.Перевыставляемая КАК Перевыставляемая,
//	               |	ЗакрытиеПериодов.СуммаДохода КАК СуммаДохода,
//	               |	ЗакрытиеПериодов.СуммаРасхода КАК СуммаРасхода,
//	               |	ЗакрытиеПериодов.СуммаНДСДохода КАК СуммаНДСДохода,
//	               |	ЗакрытиеПериодов.СуммаНДСРасхода КАК СуммаНДСРасхода
//	               |ИЗ
//	               |	РегистрНакопления.ЗакрытиеПериодов КАК ЗакрытиеПериодов
//	               |ГДЕ
//	               |	(ЗакрытиеПериодов.Сделка, ЗакрытиеПериодов.ГУИДСтроки) В
//	               |			(ВЫБРАТЬ
//	               |				Таб.Сделка,
//	               |				Таб.ГУИДСтроки
//	               |			ИЗ
//	               |				Таб)
//	               |	И ЗакрытиеПериодов.ПланФакт = ЗНАЧЕНИЕ(Перечисление.ПланФактСчет.План)
//	               |	И ЗакрытиеПериодов.Регистратор ССЫЛКА Документ.Сделка";
//	Запрос.УстановитьПараметр("ТЗ_Вх", 	ТЗ_Вх);
//	
//	Ответ = Запрос.Выполнить().Выгрузить();
//	
//	Ответ.Индексы.Добавить("Сделка, ГУИДСтроки");

//	Возврат Ответ;
//	
КонецФункции // ПолучитьДанПоЗакрытиюАкцепта(ТЗ_Вх)

Функция ОпределитьПериодВО(ТЗ_Переносы, НазвДок, Док, ГУИД, ТекущийПериодВО)

//	ИскМас_Перенос = ТЗ_Переносы.НайтиСтроки(Новый Структура(НазвДок+", ГУИДСтроки", Док, ГУИД) );
//	Если ИскМас_Перенос.Количество() > 0 Тогда
//		НовПериод = ИскМас_Перенос[0].НовыйПериодВО;
//		ЗакрытиеПериодов = ИскМас_Перенос[0].ДокументЗакрытия;
//	Иначе
//		НовПериод = Неопределено;
//		ЗакрытиеПериодов = Неопределено;
//	КонецЕсли; 
//	
//	НовПериодВО = ?(НовПериод=Неопределено, НачалоМесяца(ТекущийПериодВО), НачалоМесяца(НовПериод) );

//	РезДан = Новый Структура("НовПериодВО, ЗакрытиеПериодов", НовПериодВО, ЗакрытиеПериодов) ;
//	
//	Возврат РезДан; 
//	
КонецФункции // ОпределитьПериодВО(ТЗ_Переносы, ГУИД, ТекущийПериодВО)

Функция ПолучитьВсеПереносыПоСделкам(Сделки)

//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	ПереносРасходовМеждуПериодами.Сделка КАК Сделка,
//	               |	ПереносРасходовМеждуПериодами.ГУИДСтроки КАК ГУИДСтроки,
//	               |	ПереносРасходовМеждуПериодами.НовыйПериодВО КАК НовыйПериодВО,
//	               |	ПереносРасходовМеждуПериодами.ДокументЗакрытия КАК ДокументЗакрытия
//	               |ПОМЕСТИТЬ ВсеПереносы
//	               |ИЗ
//	               |	РегистрСведений.ПереносРасходовМеждуПериодами КАК ПереносРасходовМеждуПериодами
//	               |ГДЕ
//	               |	ПереносРасходовМеждуПериодами.Сделка В(&Сделки)
//	               |	И ПереносРасходовМеждуПериодами.Акцепт = ЗНАЧЕНИЕ(Документ.Акцепт.ПустаяСсылка)
//	               |	И ПереносРасходовМеждуПериодами.Сделка <> ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ВсеПереносы.Сделка КАК Сделка,
//	               |	ВсеПереносы.ГУИДСтроки КАК ГУИДСтроки,
//	               |	МАКСИМУМ(ВсеПереносы.НовыйПериодВО) КАК НовыйПериодВО
//	               |ПОМЕСТИТЬ МаксПериод
//	               |ИЗ
//	               |	ВсеПереносы КАК ВсеПереносы
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	ВсеПереносы.Сделка,
//	               |	ВсеПереносы.ГУИДСтроки
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ВсеПереносы.Сделка КАК Сделка,
//	               |	ВсеПереносы.ГУИДСтроки КАК ГУИДСтроки,
//	               |	ВсеПереносы.НовыйПериодВО КАК НовыйПериодВО,
//	               |	ВсеПереносы.ДокументЗакрытия КАК ДокументЗакрытия
//	               |ИЗ
//	               |	ВсеПереносы КАК ВсеПереносы
//	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксПериод КАК МаксПериод
//	               |		ПО ВсеПереносы.Сделка = МаксПериод.Сделка
//	               |			И ВсеПереносы.ГУИДСтроки = МаксПериод.ГУИДСтроки
//	               |			И ВсеПереносы.НовыйПериодВО = МаксПериод.НовыйПериодВО";
//	
//	Запрос.УстановитьПараметр("Сделки", Сделки);
//	
//	Результат = Запрос.Выполнить();
//	ТЗ_ПереносРасходов = Результат.Выгрузить();
//	ТЗ_ПереносРасходов.Индексы.Добавить("Сделка, ГУИДСтроки");

//	Возврат ТЗ_ПереносРасходов;
//	
КонецФункции // ()
// 
Функция ПолучитьВсеПереносыПоАкцептам(Акцепты)

//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	ПереносРасходовМеждуПериодами.Сделка КАК Сделка,
//	               |	ПереносРасходовМеждуПериодами.ГУИДСтроки КАК ГУИДСтроки,
//	               |	ПереносРасходовМеждуПериодами.НовыйПериодВО КАК НовыйПериодВО,
//	               |	ПереносРасходовМеждуПериодами.ДокументЗакрытия КАК ДокументЗакрытия,
//	               |	ПереносРасходовМеждуПериодами.Акцепт КАК Акцепт
//	               |ПОМЕСТИТЬ ВсеПереносы
//	               |ИЗ
//	               |	РегистрСведений.ПереносРасходовМеждуПериодами КАК ПереносРасходовМеждуПериодами
//	               |ГДЕ
//	               |	ПереносРасходовМеждуПериодами.Акцепт В(&Акцепты)
//	               |	И ПереносРасходовМеждуПериодами.Сделка <> ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
//	               |	И ПереносРасходовМеждуПериодами.Акцепт <> ЗНАЧЕНИЕ(Документ.Акцепт.ПустаяСсылка)
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ВсеПереносы.Сделка КАК Сделка,
//	               |	ВсеПереносы.ГУИДСтроки КАК ГУИДСтроки,
//	               |	ВсеПереносы.Акцепт КАК Акцепт,
//	               |	МАКСИМУМ(ВсеПереносы.НовыйПериодВО) КАК НовыйПериодВО
//	               |ПОМЕСТИТЬ МаксПериод
//	               |ИЗ
//	               |	ВсеПереносы КАК ВсеПереносы
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	ВсеПереносы.Сделка,
//	               |	ВсеПереносы.ГУИДСтроки,
//	               |	ВсеПереносы.Акцепт
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ВсеПереносы.Сделка КАК Сделка,
//	               |	ВсеПереносы.ГУИДСтроки КАК ГУИДСтроки,
//	               |	ВсеПереносы.НовыйПериодВО КАК НовыйПериодВО,
//	               |	ВсеПереносы.Акцепт КАК Акцепт,
//	               |	ВсеПереносы.ДокументЗакрытия КАК ДокументЗакрытия
//	               |ИЗ
//	               |	ВсеПереносы КАК ВсеПереносы
//	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксПериод КАК МаксПериод
//	               |		ПО ВсеПереносы.Сделка = МаксПериод.Сделка
//	               |			И ВсеПереносы.ГУИДСтроки = МаксПериод.ГУИДСтроки
//	               |			И ВсеПереносы.Акцепт = МаксПериод.Акцепт
//	               |			И ВсеПереносы.НовыйПериодВО = МаксПериод.НовыйПериодВО";
//	
//	Запрос.УстановитьПараметр("Акцепты", Акцепты);
//	
//	Результат = Запрос.Выполнить();
//	ТЗ_ПереносРасходов = Результат.Выгрузить();
//	ТЗ_ПереносРасходов.Индексы.Добавить("Акцепт, ГУИДСтроки");

//	Возврат ТЗ_ПереносРасходов;
//	
КонецФункции // ()
#КонецОбласти

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ЗакрытыеПериоды.Записывать = Истина;
	Движения.ЗакрытыеПериоды.Очистить();

	Движения.ФиксацияИзмененияПлановыхРасходовВО.Записывать = Истина;
	Движения.ФиксацияИзмененияПлановыхРасходовВО.Очистить();
	//Евросиб Каблов 09.06.2021 ( 29035
	Если ВключитьРассылку Тогда
		//Евросиб Каблов 09.04.2025 ( #105407
		//ЗакрытиеПериодаСервер.ОтправитьСообщениеОЗакрытииПериода(Ссылка);
		ЗакрытиеПериодаСервер.ОтправитьСообщениеОЗакрытииПериода(Ссылка, Ложь, "ВО");
		//Евросиб Каблов 09.04.2025 )
	КонецЕсли;
	//Евросиб Каблов 09.06.2021 )
	// регистр ЗакрытыеПериоды
	Если ЗакрытиеПериодаВО Тогда
		Движения.ЗакрытыеПериоды.Записывать = Истина;
		Движение = Движения.ЗакрытыеПериоды.Добавить();
		Движение.Период = ПериодБлокировки;
		Движение.Организация = Организация;
		//Евросиб Каблов 09.04.2025 ( #105407
		Движения.ЗакрытыеПериодыДоходов.Записывать = Истина;	
		Движение = Движения.ЗакрытыеПериодыДоходов.Добавить();
		Движение.Период = ПериодБлокировки;
		Движение.Организация = Организация;
		//Евросиб Каблов 09.04.2025 )
	КонецЕсли; 
	//Евросиб - АСуслов 22.08.2021 12:58:28 #33698
	//(
	Если ФиксацияТекущегоПериода Тогда
		УчетДоходовРасходовСервер.ЗП_СформироватьДвиженияФиксацииИзменения(ЭтотОбъект);
	КонецЕсли; 
	//)
	//Евросиб - АСуслов 22.08.2021 12:58:30 #33698
	//Евросиб Каблов 09.06.2021 ( 29035
	Если ВключитьРассылку Тогда
		//Евросиб Каблов 09.04.2025 ( #105407
		//ЗакрытиеПериодаСервер.ОтправитьСообщениеОЗакрытииПериода(Ссылка, Истина);
		ЗакрытиеПериодаСервер.ОтправитьСообщениеОЗакрытииПериода(Ссылка, Истина, "ВО");
		//Евросиб Каблов 09.04.2025 )
	КонецЕсли;
	//Евросиб Каблов 09.06.2021 )
	
КонецПроцедуры

