//Евросиб Коханенко Н.А. 17.12.2025 (( #125251 
//Функция НайтиСоздатьАдресВНаселенномПункте(Адрес, НаселенныйПункт, КомпонентыАдреса) Экспорт
Функция НайтиСоздатьАдресВНаселенномПункте(Адрес, НаселенныйПункт, КомпонентыАдреса, Широта = 0, Долгота = 0) Экспорт
//Евросиб Коханенко Н.А. 17.12.2025 )) #125251 
//АдресВНаселенномПункте = Справочники.АдресаВНаселенныхПунктах.НайтиПоРеквизиту("Адрес",Адрес,,НаселенныйПункт);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АдресаВНаселенныхПунктах.Ссылка КАК СсылкаАдрес,
	|	АдресаВНаселенныхПунктах.Владелец КАК НаселенныйПункт
	|ИЗ
	|	Справочник.АдресаВНаселенныхПунктах КАК АдресаВНаселенныхПунктах
	|ГДЕ
	|	АдресаВНаселенныхПунктах.Адрес = &Адрес
	|	И НЕ АдресаВНаселенныхПунктах.ПометкаУдаления
	|	И АдресаВНаселенныхПунктах.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Адрес", Адрес);
	Запрос.УстановитьПараметр("Владелец", НаселенныйПункт);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		АдресВНаселенномПункте = Результат.Выгрузить()[0].СсылкаАдрес;
	Иначе
		АдресВНаселенномПункте = Справочники.АдресаВНаселенныхПунктах.ПустаяСсылка();
	КонецЕсли;
	Если АдресВНаселенномПункте.Пустая() 
		И ЗначениеЗаполнено(НаселенныйПункт) Тогда
		обАдрес = Справочники.АдресаВНаселенныхПунктах.СоздатьЭлемент();
		обАдрес.Владелец = НаселенныйПункт;
		обАдрес.КомпонентыАдреса.Очистить();
		Для каждого КомпонентАдреса Из КомпонентыАдреса Цикл
			ЗаполнитьЗначенияСвойств(обАдрес.КомпонентыАдреса.Добавить(), КомпонентАдреса);
		КонецЦикла;
		обАдрес.Адрес = Адрес;
		//Евросиб Коханенко Н.А. 17.12.2025 (( #125251
		обАдрес.Широта = Широта;
		обАдрес.Долгота = Долгота;
		//Евросиб Коханенко Н.А. 17.12.2025 )) #125251 
		обАдрес.Записать();
		АдресВНаселенномПункте = обАдрес.Ссылка;
	КонецЕсли;                                  
	Возврат АдресВНаселенномПункте;
КонецФункции

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Представление = Данные.Адрес;
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля = Новый Массив;
	Поля.Добавить("Адрес");
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если ВидФормы = "ФормаВыбора" Тогда                                         
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "Справочник.Локации.Форма.ФормаВыбора";
	КонецЕсли;
КонецПроцедуры

//Евросиб Коханенко Н.А. 09.10.2023 (( US 75549 TA 75773
Функция ПолучитьЗначениеТопонима(СсылкаНаАдрес, ВидТопонима) Экспорт 
	Если СсылкаНаАдрес = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	АдресаВНаселенныхПунктахКомпонентыАдреса.Имя КАК Имя,
		|	АдресаВНаселенныхПунктахКомпонентыАдреса.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Справочник.АдресаВНаселенныхПунктах.КомпонентыАдреса КАК АдресаВНаселенныхПунктахКомпонентыАдреса
		|ГДЕ
		|	АдресаВНаселенныхПунктахКомпонентыАдреса.Ссылка = &Ссылка
		|	И АдресаВНаселенныхПунктахКомпонентыАдреса.ВидНайденногоТопонима = &ВидТопонима
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки УБЫВ";
	Запрос.УстановитьПараметр("ВидТопонима", ВидТопонима);
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаАдрес);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий(); 
		Результат = Выборка.Имя; 
	Иначе
		Результат = Неопределено;
	КонецЕсли; 
	Возврат Результат;
КонецФункции
//Евросиб Коханенко Н.А. 09.10.2023 )) US 75549 TA 75773
