
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АдресаВНаселенныхПунктах.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.АдресаВНаселенныхПунктах КАК АдресаВНаселенныхПунктах
	|ГДЕ
	|	АдресаВНаселенныхПунктах.Владелец = &Владелец
	|	И АдресаВНаселенныхПунктах.Адрес = &Адрес
	|	И АдресаВНаселенныхПунктах.Ссылка <> &Ссылка
	|	И НЕ АдресаВНаселенныхПунктах.ПометкаУдаления";
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Адрес", Адрес);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();    
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Адрес с таким наименованием уже добавлен. Запись отменена.",,,,Отказ);
	КонецЕсли;
	//Евросиб Коханенко Н.А. 22.02.2024 (( #80981
	Если НЕ Отказ Тогда
		ВладелецЛокацияВУ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "ЛокацияВышестоящегоУровня"); 
		Если ЛокацияВышестоящегоУровня <> ВладелецЛокацияВУ Тогда
			ЛокацияВышестоящегоУровня = ВладелецЛокацияВУ;
		КонецЕсли;
		//Евросиб Коханенко Н.А. 16.12.2025 (( #125251 
		ДополнительныеСвойства.Вставить("ЗарегистрироватьДляПередачиВТЛ", ИСТИНА);
		//Евросиб Коханенко Н.А. 16.12.2025 )) #125251 
	КонецЕсли;
	//Евросиб Коханенко Н.А. 22.02.2024 )) #80981 
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	//Евросиб - АСуслов 21.08.2023 11:52:03 #локации
	//(
	ЗаписатьДанныеИерархии();
	//)
	//Евросиб - АСуслов 21.08.2023 11:52:06 #локации 
	
	//Евросиб Коханенко Н.А. 16.12.2025 (( #125251 
	ЗарегистрироватьДляПередачиВТЛ = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "ЗарегистрироватьДляПередачиВТЛ", Ложь);
	Если Не Отказ И ЗарегистрироватьДляПередачиВТЛ Тогда 
		ПланыОбмена.ВыгрузкаДанных.ЗарегистрироватьИзмененияПоДокументу(Ссылка, Перечисления.УзлыОбмена.ТЛ);
	КонецЕсли;
	//Евросиб Коханенко Н.А. 16.12.2025 )) #125251 

КонецПроцедуры

Процедура ЗаписатьДанныеИерархии()

	нз = РегистрыСведений.ИерархияЛокаций.СоздатьНаборЗаписей();
	нз.Отбор.Локация.Установить(Ссылка);
	нз.Записать();
	
	мз = РегистрыСведений.ИерархияЛокаций.СоздатьМенеджерЗаписи();
	мз.Локация = Ссылка;
	мз.ТипИерархии = Перечисления.ТипыИерархииЛокации.Адрес; 
	мз.ЛокацияВышестоящегоУровня = Ссылка;
	мз.Записать();
	Если ЗначениеЗаполнено(Владелец) Тогда
		мз = РегистрыСведений.ИерархияЛокаций.СоздатьМенеджерЗаписи();
		мз.Локация = Ссылка;
		мз.ТипИерархии = Перечисления.ТипыИерархииЛокации.Локация; 
		мз.ЛокацияВышестоящегоУровня = Владелец;
		мз.Записать();
	КонецЕсли;
	ТипыЛокацииИерархии = Новый Массив;
	ТипыЛокацииИерархии.Добавить(Справочники.ТипыЛокаций.Регион);
	ТипыЛокацииИерархии.Добавить(Справочники.ТипыЛокаций.Страна);
	ТипыЛокацииИерархии.Добавить(Справочники.ТипыЛокаций.НаселенныйПункт);
	МассивЗначенийИерархии = Новый Массив;
	ПолучитьИерархиюЭлемента(Владелец, ТипыЛокацииИерархии, МассивЗначенийИерархии);
	Для каждого ЗначениеИерархии Из МассивЗначенийИерархии Цикл
		мз = РегистрыСведений.ИерархияЛокаций.СоздатьМенеджерЗаписи();
		мз.Локация = Ссылка;
		ЗаполнитьЗначенияСвойств(мз, ЗначениеИерархии);
		мз.Записать();
	КонецЦикла;
	
КонецПроцедуры                            

Функция ПолучитьИерархиюЭлемента(Локация, ТипыЛокацииИерархии, МассивЗначенийИерархии)
	ЗначенияРеквизитовЛокации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Локация, "Тип, ЛокацияВышестоящегоУровня");
	Если ТипыЛокацииИерархии.Найти(ЗначенияРеквизитовЛокации.Тип) <> Неопределено Тогда
		СтруктураЗначенийИерархии = Новый Структура("ТипИерархии, ЛокацияВышестоящегоУровня");
		СтруктураЗначенийИерархии.ТипИерархии = Перечисления.ТипыИерархииЛокации[ЗначенияРеквизитовЛокации.Тип.ИмяПредопределенныхДанных];
		СтруктураЗначенийИерархии.ЛокацияВышестоящегоУровня = Локация;
		МассивЗначенийИерархии.Добавить(СтруктураЗначенийИерархии);
	КонецЕсли;
	Если ЗначениеЗаполнено(ЗначенияРеквизитовЛокации.ЛокацияВышестоящегоУровня) Тогда
		ПолучитьИерархиюЭлемента(ЗначенияРеквизитовЛокации.ЛокацияВышестоящегоУровня, ТипыЛокацииИерархии, МассивЗначенийИерархии);
	КонецЕсли;
КонецФункции

