
Функция ПолучитьРасстояние(Локация1,Локация2) ЭКСПОРТ
	
	Расстояние = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	РасстоянияМеждуЛокациями.РасстояниеКМ КАК РасстояниеКМ
	               |ИЗ
	               |	РегистрСведений.РасстоянияМеждуЛокациями КАК РасстоянияМеждуЛокациями
	               |ГДЕ
	               |	(РасстоянияМеждуЛокациями.Локация1 = &Локация1
	               |				И РасстоянияМеждуЛокациями.Локация2 = &Локация2)
	               |			ИЛИ (РасстоянияМеждуЛокациями.Локация1 = &Локация2
	               |				И РасстоянияМеждуЛокациями.Локация2 = &Локация1)";
	Запрос.УстановитьПараметр("Локация1",Локация1);
	Запрос.УстановитьПараметр("Локация2",Локация2);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество()>0 Тогда
		Расстояние = ТЗ[0].РасстояниеКМ;
	КонецЕсли;
	
	Возврат Расстояние;
КонецФункции