
Функция РасчетРасстояния(Локация1,Локация2) Экспорт
	
	Расстояние = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасстоянияМеждуЛокациями.Локация1 КАК Локация1,
	               |	РасстоянияМеждуЛокациями.Локация2 КАК Локация2,
	               |	РасстоянияМеждуЛокациями.РасстояниеКМ КАК РасстояниеКМ
	               |ИЗ
	               |	РегистрСведений.РасстоянияМеждуЛокациями КАК РасстоянияМеждуЛокациями
	               |ГДЕ
	               |	РасстоянияМеждуЛокациями.Локация1 = &Локация1
	               |	И РасстоянияМеждуЛокациями.Локация2 = &Локация2";
	Запрос.УстановитьПараметр("Локация1",Локация1);
	Запрос.УстановитьПараметр("Локация2",Локация2);
	Ответ = Запрос.Выполнить().Выбрать();
	
	Если Ответ.Следующий() Тогда
		Расстояние = Ответ.РасстояниеКМ;
	КонецЕсли;
	
	Возврат Расстояние;
	
КонецФункции