#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрочитатьДанные(Команда)
	
	ПрочитатьДанныеCервер();
	
КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
	
	Отказ = Ложь;
	
	НомерСтроки = 0;
	
	Для Каждого Строка Из РаспознанныеДанные Цикл
		НомерСтроки = НомерСтроки + 1;
		Если Не ЗначениеЗаполнено(Строка.НомерКТК) Тогда
			Локации = Лев(Локации, СтрДлина(Локации) - 2);
			ТекстСообщения = НСтр("ru = 'Необходимо заполнить ""Номер КТК""'");
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РаспознанныеДанные", НомерСтроки, "НомерКТК");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, Поле, "", Отказ);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Строка.ПлановаяЛокацияСдачиКТК) Тогда
			Локации = Лев(Локации, СтрДлина(Локации) - 2);
			ТекстСообщения = НСтр("ru = 'Необходимо заполнить ""Плановую локацию сдачи КТК""'");
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РаспознанныеДанные", НомерСтроки, "ПлановаяЛокацияСдачиКТК");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, Поле, "", Отказ);
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОбработанныеСтроки = Новый Массив;
	Для Каждого Строка Из РаспознанныеДанные Цикл
		ОбработанныеСтроки.Добавить(Новый Структура("НомерКТК, ПлановаяЛокацияСдачиКТК", Строка.НомерКТК, Строка.ПлановаяЛокацияСдачиКТК));
	КонецЦикла;
	Закрыть(ОбработанныеСтроки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьДанныеCервер()
	
	Сч = 3;
	РаспознанныеДанные.Очистить();
	
	ПрочитаннаяСтрока = Excel.Область("R" + Сч + "C1").Текст;
	
	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");

	Пока ПрочитаннаяСтрока <> "" Цикл
		
		НоваяСтрока = РаспознанныеДанные.Добавить();
		
		НомерКТК = СокрЛП(Excel.Область("R" + Сч + "C1").Текст);
		
		Если ЗначениеЗаполнено(НомерКТК) Тогда
		
			Контейнер = РаботаСКонтейнерамиСервер.НайтиКТК(НомерКТК, Ложь);
			НоваяСтрока.НомерКТК = Контейнер;
			
		КонецЕсли;
		
		Если Excel.Область("R" + Сч + "C2").Текст <> "" Тогда
			ЛокацияПодходящегоТипа = НайтиЛокациюПодходящегоТипаПоШаблону(Excel.Область("R" + Сч + "C2").Текст);
			Если ЛокацияПодходящегоТипа <> Неопределено Тогда
				НоваяСтрока.ПлановаяЛокацияСдачиКТК = ЛокацияПодходящегоТипа;
			КонецЕсли;
		КонецЕсли;
		
		Сч = Сч + 1;
		ПрочитаннаяСтрока = Excel.Область("R" + Формат(Сч, "ЧГ=0") + "C1").Текст;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НайтиЛокациюПодходящегоТипаПоШаблону(Наименование)
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Локации.Ссылка КАК Ссылка,
	|	Локации.Тип КАК Тип
	|ИЗ
	|	Справочник.Локации КАК Локации
	|ГДЕ
	|	Локации.Тип В(&Типы)
	|	И Локации.Наименование ПОДОБНО &Шаблон
	|	И НЕ Локации.ПометкаУдаления";
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Терминал"));
	МассивТипов.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Порт"));
	МассивТипов.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.НаселенныйПункт"));

	Запрос.УстановитьПараметр("Типы", МассивТипов);
	Запрос.УстановитьПараметр("Шаблон", "%" + ОбщегоНазначения.СформироватьСтрокуДляПоискаВЗапросе(Наименование) + "%");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Результат = Выборка.Ссылка;
	Иначе
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.НаселенныйПункт"));
		
		Запрос.УстановитьПараметр("Типы", МассивТипов);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Количество() = 1 Тогда
			Выборка.Следующий();
			Результат = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти