//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, начало
Функция ПолучитьГруппуДКСпоДокументу(СсылкаНаДокумент) Экспорт
	Возврат ПолучитьАналитикуДокумента(СсылкаНаДокумент, ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.ГруппаДКС);
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, конец

//ДИТ Шевченко А.В. 17.01.2024 US 91366 TA 93137 -начало
Процедура ЗаписатьТранзитДляКлиентапоДокументу(СсылкаНаДокумент, ТранзитДляКлиента) Экспорт
	ЗаписатьАналитикуДокумента(СсылкаНаДокумент, ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.ТранзитДляКлиента, ТранзитДляКлиента);
КонецПроцедуры//ДИТ Шевченко А.В. 17.01.2024 US 91366 TA 93137 -конец

//Евросиб Шевченко А.В. 24.06.2025 US 104900 TA 112049 -начало
Процедура ЗаписатьНеОтслеживатьПоДокументу(СсылкаНаДокумент, НеОтслеживать) Экспорт
	ЗаписатьАналитикуДокумента(СсылкаНаДокумент, ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.НеОтслеживатьРТУвЭДО, НеОтслеживать);
КонецПроцедуры

Процедура ЗаписатьВРаботеПоСтатусуОтправкиИПодписанияПоДокументу(СсылкаНаДокумент, ВРаботеПоСтатусуОтправкиИПодписания) Экспорт
	ЗаписатьАналитикуДокумента(СсылкаНаДокумент, ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.СтатусОтправкиИПодписанияРТУ, ВРаботеПоСтатусуОтправкиИПодписания);
КонецПроцедуры

Функция ПолучитьПризнакНеОтслеживатьПоДокументу(СсылкаНаДокумент) Экспорт
	Возврат ПолучитьАналитикуДокумента(СсылкаНаДокумент, ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.НеОтслеживатьРТУвЭДО);
КонецФункции

Функция ПолучитьСтатусОтправкиИПодписанияПоДокументу(СсылкаНаДокумент) Экспорт
	Возврат ПолучитьАналитикуДокумента(СсылкаНаДокумент, ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.СтатусОтправкиИПодписанияРТУ);
КонецФункции

//Евросиб Шевченко А.В. 24.06.2025 US 104900 TA 112049 -конец

//Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
Процедура ЗаписатьНормативнуюКонтрибуциюпоДокументу(СсылкаНаДокумент, НормативнаяКонтрибуция) Экспорт
	ЗаписатьАналитикуДокумента(СсылкаНаДокумент, ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.НормативнаяКонтрибуция, НормативнаяКонтрибуция);
КонецПроцедуры

Процедура ЗаписатьРасчетнуюКонтрибуцию20поДокументу(СсылкаНаДокумент, РасчетнаяКонтрибуция20) Экспорт
	ЗаписатьАналитикуДокумента(СсылкаНаДокумент, ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.РасчетнаяКонтрибуция20, РасчетнаяКонтрибуция20);
КонецПроцедуры

Процедура ЗаписатьРасчетнуюКонтрибуцию40поДокументу(СсылкаНаДокумент, РасчетнаяКонтрибуция40) Экспорт
	ЗаписатьАналитикуДокумента(СсылкаНаДокумент, ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.РасчетнаяКонтрибуция40, РасчетнаяКонтрибуция40);
КонецПроцедуры

//Евросиб Шевченко А.В. US 110215 TA 124098 24.11.2025
Процедура ЗаписатьВидПечатнойФормыПротоколаПСЦПоставщика(СсылкаНаДокумент, ВидПечатнойФормыПротоколаПСЦПоставщика) Экспорт
	ЗаписатьАналитикуДокумента(СсылкаНаДокумент, ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.ВидПечатнойФормыПротоколаПСЦПоставщика, ВидПечатнойФормыПротоколаПСЦПоставщика);
КонецПроцедуры
//Евросиб Шевченко А.В. US 110215 TA 124098 24.11.2025

//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, начало
Процедура ЗаписатьГруппуДКСпоДокументу(СсылкаНаДокумент, ГруппаДКС) Экспорт
	ЗаписатьАналитикуДокумента(СсылкаНаДокумент, ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.ГруппаДКС, ГруппаДКС);
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, конец

Функция ПолучитьТранзитДляКлиентапоДокументу(СсылкаНаДокумент) Экспорт
	Возврат ПолучитьАналитикуДокумента(СсылкаНаДокумент, ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.ТранзитДляКлиента);
КонецФункции

Функция ПолучитьНормативнуюКонтрибуциюПоДокументу(СсылкаНаДокумент) Экспорт //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	Возврат ПолучитьАналитикуДокумента(СсылкаНаДокумент, ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.НормативнаяКонтрибуция);
КонецФункции

Функция ПолучитьРасчетнуюКонтрибуцию20ПоДокументу(СсылкаНаДокумент) Экспорт //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	Возврат ПолучитьАналитикуДокумента(СсылкаНаДокумент, ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.РасчетнаяКонтрибуция20);
КонецФункции

Функция ПолучитьРасчетнуюКонтрибуцию40ПоДокументу(СсылкаНаДокумент) Экспорт //Евросиб Шевченко А.В. 03.06.2025 US 97974 TA 111305
	Возврат ПолучитьАналитикуДокумента(СсылкаНаДокумент, ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.РасчетнаяКонтрибуция40);
КонецФункции

Функция ПолучитьВидПечатнойФормыПротоколаПСЦПоставщика(СсылкаНаДокумент) Экспорт //Евросиб Шевченко А.В. US 110215 TA 124098 24.11.2025
	Возврат ПолучитьАналитикуДокумента(СсылкаНаДокумент, ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.ВидПечатнойФормыПротоколаПСЦПоставщика);
КонецФункции

//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, начало
Функция ПолучитьАналитикуДокумента(СсылкаНаДокумент, Аналитика) Экспорт
	
	Результат = Неопределено;
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияДополнительныхАналитикДокументов.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхАналитикДокументов КАК ЗначенияДополнительныхАналитикДокументов
		|ГДЕ
		|	ЗначенияДополнительныхАналитикДокументов.Документ = &СсылкаНаДокумент
		|	И ЗначенияДополнительныхАналитикДокументов.Аналитика = &Аналитика";
	
	Запрос.УстановитьПараметр("СсылкаНаДокумент", СсылкаНаДокумент);
	Запрос.УстановитьПараметр("Аналитика", Аналитика);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Результат = ВыборкаДетальныеЗаписи.Значение;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, начало
Процедура ЗаписатьАналитикуДокумента(СсылкаНаДокумент, Аналитика, Значение) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Аналитика) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат;
	КонецЕсли;
	
	Если Аналитика = ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.ГруппаДКС
		//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, начало
		 ИЛИ Аналитика = ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.ВидЗадолженности Тогда
		//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, конец
		МассивДокументов = ПолучитьСвязанныеДокументы(СсылкаНаДокумент, Аналитика, Значение);
	ИначеЕсли Аналитика = ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.ТранзитДляКлиента Тогда //ДИТ Шевченко А.В. 17.01.2024 US 91366 TA 93137
		МассивДокументов = ПолучитьСвязанныеДокументыТранзитДляКлиента(СсылкаНаДокумент, Аналитика, Значение);
	Иначе
		МассивДокументов = Новый Массив;
		МассивДокументов.Добавить(СсылкаНаДокумент);
	КонецЕсли;
	
	//Евросиб Коханенко Н.А. 05.08.2025 (( #115687 
	Если Аналитика = ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.ВидЗадолженности 
		И Значение = Перечисления.ВидыЗадолженности.ДоплатныеПВ Тогда
		МассивДокументов.Добавить(СсылкаНаДокумент);
	КонецЕсли;
	//Евросиб Коханенко Н.А. 05.08.2025 )) #115687 
	
	Если МассивДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Для Каждого ТекДокумент Из МассивДокументов Цикл
		ЗаписьРегистра = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Документ = ТекДокумент;
		ЗаписьРегистра.Аналитика = Аналитика;
		ЗаписьРегистра.Значение = Значение;
		ЗаписьРегистра.Записать(Истина);
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, конец

//ДИТ Шевченко А.В. 17.01.2024 US 91366 TA 93137 -начало
Функция ПолучитьСвязанныеДокументыТранзитДляКлиента(СсылкаНаДокумент, Аналитика, Значение)
	МассивДокументов = Новый Массив;
	
	Если ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ПСЦ") Тогда
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПСЦ.Ссылка КАК ПСЦ
		|ПОМЕСТИТЬ ВТ_ПСЦ
		|ИЗ
		|	Документ.ПСЦ КАК ПСЦ
		|ГДЕ
		|	ПСЦ.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Калькуляции.Калькуляция КАК Калькуляция
		|ПОМЕСТИТЬ ВТ_Калькуляции
		|ИЗ
		|	Документ.ПСЦ.Калькуляции КАК Калькуляции
		|ГДЕ
		|	Калькуляции.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Заявка.Ссылка КАК Заявка
		|ПОМЕСТИТЬ ВТ_Заявки
		|ИЗ
		|	Документ.Заявка КАК Заявка
		|ГДЕ
		|	Заявка.ПСЦ В
		|			(ВЫБРАТЬ
		|				ВТ_ПСЦ.ПСЦ
		|			ИЗ
		|				ВТ_ПСЦ КАК ВТ_ПСЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СчетНаОплатуПокупателюДокументыОснования.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Счета
		|ИЗ
		|	Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
		|ГДЕ
		|	СчетНаОплатуПокупателюДокументыОснования.Документ В
		|			(ВЫБРАТЬ
		|				ВТ_Заявки.Заявка
		|			ИЗ
		|				ВТ_Заявки КАК ВТ_Заявки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_РТУ
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.СчетаНаОплатуПокупателям КАК РеализацияТоваровУслугСчетаНаОплатуПокупателям
		|ГДЕ
		|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.СчетПокупателю В
		|			(ВЫБРАТЬ
		|				ВТ_Счета.Ссылка
		|			ИЗ
		|				ВТ_Счета КАК ВТ_Счета)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РТУ.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ДокументыДляПроверки
		|ИЗ
		|	ВТ_РТУ КАК ВТ_РТУ
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_Калькуляции.Калькуляция
		|ИЗ
		|	ВТ_Калькуляции КАК ВТ_Калькуляции
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_Заявки.Заявка
		|ИЗ
		|	ВТ_Заявки КАК ВТ_Заявки
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_Счета.Ссылка
		|ИЗ
		|	ВТ_Счета КАК ВТ_Счета
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	&Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КорректировкаРеализации.Ссылка
		|ИЗ
		|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
		|ГДЕ
		|	НЕ КорректировкаРеализации.ПометкаУдаления
		|	И КорректировкаРеализации.ДокументРеализации В
		|			(ВЫБРАТЬ
		|				ВТ_РТУ.Ссылка
		|			ИЗ
		|				ВТ_РТУ КАК ВТ_РТУ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КорректировкаДолгаДебиторскаяЗадолженность.Ссылка
		|ИЗ
		|	Документ.КорректировкаДолга.ДебиторскаяЗадолженность КАК КорректировкаДолгаДебиторскаяЗадолженность
		|ГДЕ
		|	НЕ КорректировкаДолгаДебиторскаяЗадолженность.Ссылка.ПометкаУдаления
		|	И КорректировкаДолгаДебиторскаяЗадолженность.Сделка В
		|			(ВЫБРАТЬ
		|				ВТ_РТУ.Ссылка
		|			ИЗ
		|				ВТ_РТУ КАК ВТ_РТУ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДокументыДляПроверки.Ссылка КАК Ссылка
		|ИЗ
		|	ВТ_ДокументыДляПроверки КАК ВТ_ДокументыДляПроверки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхАналитикДокументов КАК ЗначенияДополнительныхАналитикДокументов
		|		ПО ВТ_ДокументыДляПроверки.Ссылка = ЗначенияДополнительныхАналитикДокументов.Документ
		|			И (ЗначенияДополнительныхАналитикДокументов.Аналитика = &Аналитика)
		|			И (ЗначенияДополнительныхАналитикДокументов.Значение = &Значение)
		|ГДЕ
		|	ЗначенияДополнительныхАналитикДокументов.Документ ЕСТЬ NULL";
	

	
	Если Значение = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "(ЗначенияДополнительныхАналитикДокументов.Значение = &Значение)", "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗначенияДополнительныхАналитикДокументов.Документ ЕСТЬ NULL", "НЕ ЗначенияДополнительныхАналитикДокументов.Документ ЕСТЬ NULL");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	Запрос.УстановитьПараметр("Аналитика", Аналитика);
	Запрос.УстановитьПараметр("Значение", Значение);
	
	МассивДокументов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	Иначе
		МассивДокументов.Добавить(СсылкаНаДокумент);	
	КонецЕсли;	
	
	Возврат МассивДокументов;
	
КонецФункции
//ДИТ Шевченко А.В. 17.01.2024 US 91366 TA 93137 -конец

//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, начало
Функция ПолучитьСвязанныеДокументы(СсылкаНаДокумент, Аналитика, Значение)
	
	МассивДокументов = Новый Массив;
	
	Если ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.Заявка") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетНаОплатуПокупателюДокументыОснования.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Счета
		|ИЗ
		|	Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
		|ГДЕ
		|	СчетНаОплатуПокупателюДокументыОснования.Документ = &Заявка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ДокументыДляПроверки
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.СчетаНаОплатуПокупателям КАК РеализацияТоваровУслугСчетаНаОплатуПокупателям
		|ГДЕ
		|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.СчетПокупателю В
		|			(ВЫБРАТЬ
		|				ВТ_Счета.Ссылка
		|			ИЗ
		|				ВТ_Счета КАК ВТ_Счета)
		|
		//Евросиб СубботинВ #112686 02.07.2025 начало
		//|ОБЪЕДИНИТЬ
		//|
		//|ВЫБРАТЬ
		//|	ОтчетКомитентуОПродажах.Ссылка
		//|ИЗ
		//|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
		//|ГДЕ
		//|	ОтчетКомитентуОПродажах.СчетНаОплатуПокупателю В
		//|			(ВЫБРАТЬ
		//|				ВТ_Счета.Ссылка
		//|			ИЗ
		//|				ВТ_Счета КАК ВТ_Счета)
		//|ОБЪЕДИНИТЬ
		//|
		//|ВЫБРАТЬ Различные
		//|	ОтчетКомитентуОПродажахТовары.Ссылка
		//|ИЗ
		//|	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
		//|ГДЕ
		//|	ОтчетКомитентуОПродажахТовары.СчетНаОплатуПокупателю В
		//|			(ВЫБРАТЬ
		//|				ВТ_Счета.Ссылка
		//|			ИЗ
		//|				ВТ_Счета КАК ВТ_Счета)
		//Евросиб Шевченко А.В. US 112687 TA 114390 18.07.2025
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ Различные
		|	ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.Ссылка
		|ИЗ
		|	Документ.ОтчетКомитентуОПродажах.СчетаНаОплатуПокупателям КАК ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям
		|ГДЕ
		|	ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.СчетПокупателю В
		|			(ВЫБРАТЬ
		|				ВТ_Счета.Ссылка
		|			ИЗ
		|				ВТ_Счета КАК ВТ_Счета)
		//Евросиб Шевченко А.В. US 112687 TA 114390 18.07.2025
		//Евросиб СубботинВ #112686 02.07.2025 Конец
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_Счета.Ссылка
		|ИЗ
		|	ВТ_Счета КАК ВТ_Счета
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	&Заявка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДокументыДляПроверки.Ссылка КАК Ссылка
		|ИЗ
		|	ВТ_ДокументыДляПроверки КАК ВТ_ДокументыДляПроверки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхАналитикДокументов КАК ЗначенияДополнительныхАналитикДокументов
		|		ПО ВТ_ДокументыДляПроверки.Ссылка = ЗначенияДополнительныхАналитикДокументов.Документ
		|			И (ЗначенияДополнительныхАналитикДокументов.Аналитика = &Аналитика)
		|			И (ЗначенияДополнительныхАналитикДокументов.Значение = &Значение)
		|ГДЕ
		|	ЗначенияДополнительныхАналитикДокументов.Документ ЕСТЬ NULL";
		
		//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, начало
		Если Значение = Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "(ЗначенияДополнительныхАналитикДокументов.Значение = &Значение)", "ИСТИНА");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗначенияДополнительныхАналитикДокументов.Документ ЕСТЬ NULL", "НЕ ЗначенияДополнительныхАналитикДокументов.Документ ЕСТЬ NULL");
		КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, конец
		
		Запрос.УстановитьПараметр("Заявка", СсылкаНаДокумент);
		Запрос.УстановитьПараметр("Аналитика", Аналитика);
		Запрос.УстановитьПараметр("Значение", Значение);
		
		МассивДокументов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетНаОплатуПокупателюДокументыОснования.Документ КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Заявки
		|ИЗ
		|	Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
		|ГДЕ
		|	СчетНаОплатуПокупателюДокументыОснования.Ссылка = &СчетПокупателю
		|	И СчетНаОплатуПокупателюДокументыОснования.Документ ССЫЛКА Документ.Заявка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ДокументыДляПроверки
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.СчетаНаОплатуПокупателям КАК РеализацияТоваровУслугСчетаНаОплатуПокупателям
		|ГДЕ
		|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.СчетПокупателю = &СчетПокупателю
		|
		|ОБЪЕДИНИТЬ
		//Евросиб СубботинВ #112686 02.07.2025 Начало
		//|
		//|ВЫБРАТЬ
		//|	ОтчетКомитентуОПродажах.Ссылка
		//|ИЗ
		//|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
		//|ГДЕ
		//|	ОтчетКомитентуОПродажах.СчетНаОплатуПокупателю = &СчетПокупателю
		//Евросиб Шевченко А.В. US 112687 TA 114390 18.07.2025
		//|
		//|ВЫБРАТЬ Различные
		//|	ОтчетКомитентуОПродажахТовары.Ссылка
		//|ИЗ
		//|	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
		//|ГДЕ
		//|	ОтчетКомитентуОПродажахТовары.СчетНаОплатуПокупателю = &СчетПокупателю
		|
		|ВЫБРАТЬ Различные
		|	ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.Ссылка
		|ИЗ
		|	Документ.ОтчетКомитентуОПродажах.СчетаНаОплатуПокупателям КАК ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям
		|ГДЕ
		|	ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.СчетПокупателю = &СчетПокупателю
		//Евросиб Шевченко А.В. US 112687 TA 114390 18.07.2025
		//Евросиб СубботинВ #112686 02.07.2025 Конец
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_Заявки.Ссылка
		|ИЗ
		|	ВТ_Заявки КАК ВТ_Заявки
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	&СчетПокупателю
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДокументыДляПроверки.Ссылка КАК Ссылка
		|ИЗ
		|	ВТ_ДокументыДляПроверки КАК ВТ_ДокументыДляПроверки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхАналитикДокументов КАК ЗначенияДополнительныхАналитикДокументов
		|		ПО ВТ_ДокументыДляПроверки.Ссылка = ЗначенияДополнительныхАналитикДокументов.Документ
		|			И (ЗначенияДополнительныхАналитикДокументов.Аналитика = &Аналитика)
		|			И (ЗначенияДополнительныхАналитикДокументов.Значение = &Значение)
		|ГДЕ
		|	ЗначенияДополнительныхАналитикДокументов.Документ ЕСТЬ NULL";
		
		//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, начало
		Если Значение = Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "(ЗначенияДополнительныхАналитикДокументов.Значение = &Значение)", "ИСТИНА");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗначенияДополнительныхАналитикДокументов.Документ ЕСТЬ NULL", "НЕ ЗначенияДополнительныхАналитикДокументов.Документ ЕСТЬ NULL");
		КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, конец
		
		Запрос.УстановитьПараметр("СчетПокупателю", СсылкаНаДокумент);
		Запрос.УстановитьПараметр("Аналитика", Аналитика);
		Запрос.УстановитьПараметр("Значение", Значение);
		
		МассивДокументов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументРеализацияТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК ДокументРеализацияТоваровУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхАналитикДокументов КАК ЗначенияДополнительныхАналитикДокументов
		|		ПО ДокументРеализацияТоваровУслуг.Ссылка = ЗначенияДополнительныхАналитикДокументов.Документ
		|			И (ЗначенияДополнительныхАналитикДокументов.Аналитика = &Аналитика)
		|			И (ЗначенияДополнительныхАналитикДокументов.Значение = &Значение)
		|ГДЕ
		|	ДокументРеализацияТоваровУслуг.Ссылка = &СсылкаНаДокумент
		|	И ЗначенияДополнительныхАналитикДокументов.Документ ЕСТЬ NULL";
		
		//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, начало
		Если Значение = Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "(ЗначенияДополнительныхАналитикДокументов.Значение = &Значение)", "ИСТИНА");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗначенияДополнительныхАналитикДокументов.Документ ЕСТЬ NULL", "НЕ ЗначенияДополнительныхАналитикДокументов.Документ ЕСТЬ NULL");
		КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, конец
		
		Запрос.УстановитьПараметр("СсылкаНаДокумент", СсылкаНаДокумент);
		Запрос.УстановитьПараметр("Аналитика", Аналитика);
		Запрос.УстановитьПараметр("Значение", Значение);
		
		МассивДокументов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, начало
	ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументКорректировкаРеализации.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.КорректировкаРеализации КАК ДокументКорректировкаРеализации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхАналитикДокументов КАК ЗначенияДополнительныхАналитикДокументов
		|		ПО ДокументКорректировкаРеализации.Ссылка = ЗначенияДополнительныхАналитикДокументов.Документ
		|			И (ЗначенияДополнительныхАналитикДокументов.Аналитика = &Аналитика)
		|			И (ЗначенияДополнительныхАналитикДокументов.Значение = &Значение)
		|ГДЕ
		|	ДокументКорректировкаРеализации.Ссылка = &СсылкаНаДокумент
		|	И ЗначенияДополнительныхАналитикДокументов.Документ ЕСТЬ NULL";
		
		Если Значение = Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "(ЗначенияДополнительныхАналитикДокументов.Значение = &Значение)", "ИСТИНА");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗначенияДополнительныхАналитикДокументов.Документ ЕСТЬ NULL", "НЕ ЗначенияДополнительныхАналитикДокументов.Документ ЕСТЬ NULL");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("СсылкаНаДокумент", СсылкаНаДокумент);
		Запрос.УстановитьПараметр("Аналитика", Аналитика);
		Запрос.УстановитьПараметр("Значение", Значение);
		
		МассивДокументов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, конец
	
	//Евросиб(ДИТ) Серебреников А.Г. US 97325 ТА 111933 16.06.25 Начало
	ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
	     МассивДокументов.Добавить(СсылкаНаДокумент);
	//Евросиб(ДИТ) Серебреников А.Г. US 97325 ТА 111933 16.06.25 Конец 
	КонецЕсли;

	Возврат МассивДокументов;
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, начало
Функция ПолучитьВидЗадолженностиПоДокументу(СсылкаНаДокумент) Экспорт
	Возврат ПолучитьАналитикуДокумента(СсылкаНаДокумент, ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.ВидЗадолженности);
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, начало
Процедура ЗаписатьВидЗадолженностиПоДокументу(СсылкаНаДокумент, ВидЗадолженности) Экспорт
	ЗаписатьАналитикуДокумента(СсылкаНаДокумент, ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.ВидЗадолженности, ВидЗадолженности);
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, начало
Процедура УстановитьВидЗадолженностиПоКалькуляциям(СссылкаНаОбъект, МассивКалькуляций) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&СссылкаНаОбъект КАК СссылкаНаОбъект,
		//Евросиб СубботинВ #112680 25.06.2025 Начало
		//|	ВЫБОР
		//|		КОГДА Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ВыдачаКТКвРынок)
		//|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ВыдачаКТКвРынок)
		//|		КОГДА Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Субсидии)
		//|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.Субсидии)
		////ДИТ Шевченко А.В. US 103646 TA 103658 06.03.2025
		//|		КОГДА Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Премии)
		//|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.Премии)
		////ДИТ Шевченко А.В. US 103646 TA 103658 06.03.2025
		//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		//|	КОНЕЦ КАК ВидыЗадолженности
		|	ВЫБОР
		|		КОГДА Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ВыдачаКТКвРынок)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.ВыдачаКТКвРынок)
		|		КОГДА Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Субсидии)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Субсидии)
		//ДИТ Шевченко А.В. US 103646 TA 103658 06.03.2025
		|		КОГДА Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Премии)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Премии)
		//ДИТ Шевченко А.В. US 103646 TA 103658 06.03.2025
		//Евросиб Коханенко Н.А. 05.08.2025 (( #115687
		|		КОГДА Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ДоплатныеПВ)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.ДоплатныеПВ)
		//Евросиб Коханенко Н.А. 05.08.2025 )) #115687
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ВидыЗадолженности
		//Евросиб СубботинВ #112680 25.06.2025 Конец 
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.Калькуляция КАК Калькуляция
		|ГДЕ
		|	Калькуляция.Ссылка В(&МассивКалькуляций)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТ.ВидыЗадолженности КАК ВидыЗадолженности
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхАналитикДокументов КАК ЗначенияДополнительныхАналитикДокументов
		|		ПО ВТ.СссылкаНаОбъект = ЗначенияДополнительныхАналитикДокументов.Документ
		|			И (ЗначенияДополнительныхАналитикДокументов.Аналитика = &Аналитика)
		|			И (ЗначенияДополнительныхАналитикДокументов.Значение = ВТ.ВидыЗадолженности)
		|ГДЕ
		|	ВТ.ВидыЗадолженности <> НЕОПРЕДЕЛЕНО
		|	И ЗначенияДополнительныхАналитикДокументов.Документ ЕСТЬ NULL
		//Евросиб(ДИТ), Беляев СЮ, BUG 109491 / TA 111190, 02-06-2025, начало
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТ.ВидыЗадолженности КАК ВидыЗадолженности
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	ВТ.ВидыЗадолженности = НЕОПРЕДЕЛЕНО";
		//Евросиб(ДИТ), Беляев СЮ, BUG 109491 / TA 111190, 02-06-2025, конец
	
	Запрос.УстановитьПараметр("МассивКалькуляций", МассивКалькуляций);
	Запрос.УстановитьПараметр("СссылкаНаОбъект", СссылкаНаОбъект);
	Запрос.УстановитьПараметр("Аналитика", ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.ВидЗадолженности);
	
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Если НЕ РезультатЗапроса.Пустой() Тогда
	//	
	//	Выборка = РезультатЗапроса.Выбрать();
	//	Выборка.Следующий();
	//	РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьВидЗадолженностиПоДокументу(СссылкаНаОбъект, Выборка.ВидыЗадолженности);
	//	
	//Иначе
	//	
	//	УдалитьАналитикуДокумента(СссылкаНаОбъект, ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.ВидЗадолженности);
	//
	//КонецЕсли;
	
	//Евросиб(ДИТ), Беляев СЮ, BUG 109491 / TA 111190, 02-06-2025, начало
	РезультатЗапросаПакет = Запрос.ВыполнитьПакет();
	//ПРОВЕРКА НА УДАЛЕНИЕ ВИДА ЗАДОЛЖЕННОСТИ
	Если НЕ РезультатЗапросаПакет[2].Пустой() Тогда
		УдалитьАналитикуДокумента(СссылкаНаОбъект, ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.ВидЗадолженности);
	//УСТАНОВКА ЗНАЧЕНИЯ, ЕСЛИ НЕ СОВПАДАЕТ С ТЕКУЩИМ ПО ДОКУМЕНТУ
	ИначеЕсли НЕ РезультатЗапросаПакет[1].Пустой() Тогда
		Выборка = РезультатЗапросаПакет[1].Выбрать();
		Выборка.Следующий();
		РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьВидЗадолженностиПоДокументу(СссылкаНаОбъект, Выборка.ВидыЗадолженности);
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, BUG 109491 / TA 111190, 02-06-2025, конец
	
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, начало
Процедура УдалитьАналитикуДокумента(СсылкаНаДокумент, Аналитика) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
		Возврат;
	КонецЕсли;
	
	Если Аналитика = ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.ВидЗадолженности Тогда
		МассивДокументов = ПолучитьСвязанныеДокументы(СсылкаНаДокумент, Аналитика, Неопределено);
	ИначеЕсли Аналитика = ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.ТранзитДляКлиента Тогда //ДИТ Шевченко А.В. 17.01.2024 US 91366 TA 93137
		МассивДокументов = ПолучитьСвязанныеДокументыТранзитДляКлиента(СсылкаНаДокумент, Аналитика, Неопределено);	
	Иначе
		МассивДокументов = Новый Массив;
		МассивДокументов.Добавить(СсылкаНаДокумент);
	КонецЕсли;
	
	Если МассивДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Для Каждого ТекДокумент Из МассивДокументов Цикл
		ЗаписьРегистра = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Документ = ТекДокумент;
		ЗаписьРегистра.Аналитика = Аналитика;
		ЗаписьРегистра.Удалить();
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, конец

//Евросиб(ДИТ) Серебреников А.Г. US 97325 ТА 111933 16.06.25 Начало
Функция ПолучитьГруппыДКССвязанныхДокументов(МассивСчетов) Экспорт 
	
	МассивРезультат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетНаОплатуПокупателю.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Счета
		|ИЗ
		|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
		|ГДЕ
		|	СчетНаОплатуПокупателю.Ссылка В(&СчетПокупателю)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ДокументыДляПроверки
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.СчетаНаОплатуПокупателям КАК РеализацияТоваровУслугСчетаНаОплатуПокупателям
		|ГДЕ
		|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.СчетПокупателю В(&СчетПокупателю)
		|
		|ОБЪЕДИНИТЬ
		//Евросиб СубботинВ #112686 02.07.2025 Начало
		//|
		//|ВЫБРАТЬ
		//|	ОтчетКомитентуОПродажах.Ссылка
		//|ИЗ
		//|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
		//|ГДЕ
		//|	ОтчетКомитентуОПродажах.СчетНаОплатуПокупателю В(&СчетПокупателю)
		//Евросиб Шевченко А.В. US 112687 TA 114390 18.07.2025
		//|
		//|ВЫБРАТЬ
		//|	ОтчетКомитентуОПродажахТовары.Ссылка
		//|ИЗ
		//|	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
		//|ГДЕ
		//|	ОтчетКомитентуОПродажахТовары.СчетНаОплатуПокупателю В(&СчетПокупателю)
		|
		|ВЫБРАТЬ Различные
		|	ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.Ссылка
		|ИЗ
		|	Документ.ОтчетКомитентуОПродажах.СчетаНаОплатуПокупателям КАК ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям
		|ГДЕ
		|	ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.СчетПокупателю В(&СчетПокупателю)
		//Евросиб Шевченко А.В. US 112687 TA 114390 18.07.2025
		//Евросиб СубботинВ #112686 02.07.2025 Конец
		|

		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_Счета.Ссылка
		|ИЗ
		|	ВТ_Счета КАК ВТ_Счета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗначенияДополнительныхАналитикДокументов.Значение КАК Значение
		|ИЗ
		|	ВТ_ДокументыДляПроверки КАК ВТ_ДокументыДляПроверки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхАналитикДокументов КАК ЗначенияДополнительныхАналитикДокументов
		|		ПО ВТ_ДокументыДляПроверки.Ссылка = ЗначенияДополнительныхАналитикДокументов.Документ
		|			И (ЗначенияДополнительныхАналитикДокументов.Аналитика = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеАналитикиДокументов.ГруппаДКС))";
	
	Запрос.УстановитьПараметр("СчетПокупателю", МассивСчетов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Значение) Тогда
			Если МассивРезультат.Найти(Выборка.Значение) = Неопределено Тогда
				МассивРезультат.Добавить(Выборка.Значение);
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	
	Возврат МассивРезультат;
	
КонецФункции	//Евросиб(ДИТ) Серебреников А.Г. US 97325 ТА 111933 16.06.25 Конец 
