
&НаКлиенте
Процедура ЛокацияОтправленияПриИзменении(Элемент)
	ОтборВДинСписке();
КонецПроцедуры

&НаКлиенте
Процедура ОтборВДинСписке()
	
	Список.Отбор.Элементы.Очистить();    
	
	Если ЗначениеЗаполнено(ЛокацияОтправления) И Не ЗначениеЗаполнено(ВРадиусеОтОтправления) Тогда
		ГруппаОтбора = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПунктОтправления");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = ЛокацияОтправления;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЛокацияОтправления) И ЗначениеЗаполнено(ВРадиусеОтОтправления) Тогда
		МассивСтанций = ПолучитьМассивСтанцийСервер(ЛокацияОтправления,ВРадиусеОтОтправления);
		ГруппаОтбора = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПунктОтправления");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = МассивСтанций;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЛокацияНазначения) И Не ЗначениеЗаполнено(ВРадиусеОтНазначения) Тогда
		ГруппаОтбора = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПунктНазначения");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = ЛокацияНазначения;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВРадиусеОтНазначения) И ЗначениеЗаполнено(ВРадиусеОтНазначения) Тогда
		МассивСтанций = ПолучитьМассивСтанцийСервер(ЛокацияНазначения,ВРадиусеОтНазначения);
		ГруппаОтбора = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПунктНазначения");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = МассивСтанций;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивСтанцийСервер(Локация,ВРадиусеОтЛокации)
	
	МассивСтн = Новый Массив;
	// выбранную локацию добавим сразу
	МассивСтн.Добавить(Локация);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТабельныеРасписанияРЖДРасписание.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВыборкаТабРасп
		|ИЗ
		|	Справочник.ТабельныеРасписанияРЖД.Расписание КАК ТабельныеРасписанияРЖДРасписание
		|ГДЕ
		|	ТабельныеРасписанияРЖДРасписание.Станция В ИЕРАРХИИ(&Станция)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабельныеРасписанияРЖДРасписание.Ссылка КАК Ссылка,
		|	ТабельныеРасписанияРЖДРасписание.НомерСтроки КАК НомерСтроки,
		|	ТабельныеРасписанияРЖДРасписание.Станция КАК Станция,
		|	ТабельныеРасписанияРЖДРасписание.ДоСледующейСтанции КАК ДоСледующейСтанции,
		|	ТабельныеРасписанияРЖДРасписание.ВремяОтправления КАК ВремяОтправления,
		|	ТабельныеРасписанияРЖДРасписание.ВремяПрибытия КАК ВремяПрибытия,
		|	ТабельныеРасписанияРЖДРасписание.РасстояниеДоСледующейСтанции КАК РасстояниеДоСледующейСтанции
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Справочник.ТабельныеРасписанияРЖД.Расписание КАК ТабельныеРасписанияРЖДРасписание
		|ГДЕ
		|	ТабельныеРасписанияРЖДРасписание.Ссылка В
		|			(ВЫБРАТЬ
		|				ВыборкаТабРасп.Ссылка
		|			ИЗ
		|				ВыборкаТабРасп КАК ВыборкаТабРасп)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Ссылка КАК Ссылка,
		|	ВТ.Станция КАК Станция,
		|	ВТ.ДоСледующейСтанции КАК ДоСледующейСтанции,
		|	ВТ.ВремяОтправления КАК ВремяОтправления,
		|	ВТ.ВремяПрибытия КАК ВремяПрибытия,
		|	ВТ.РасстояниеДоСледующейСтанции КАК РасстояниеДоСледующейСтанции,
		|	СУММА(ВТ1.РасстояниеДоСледующейСтанции) КАК РасстояниеНарастающимИтогом,
		|	ВТ.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ НарастающийИтог
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ1
		|		ПО ВТ.Ссылка = ВТ1.Ссылка
		|			И ВТ.НомерСтроки >= ВТ1.НомерСтроки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.ВремяПрибытия,
		|	ВТ.ВремяОтправления,
		|	ВТ.Станция,
		|	ВТ.Ссылка,
		|	ВТ.ДоСледующейСтанции,
		|	ВТ.РасстояниеДоСледующейСтанции,
		|	ВТ.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НарастающийИтог.Ссылка КАК Ссылка,
		|	НарастающийИтог.Станция КАК Станция,
		|	НарастающийИтог.ДоСледующейСтанции КАК ДоСледующейСтанции,
		|	НарастающийИтог.ВремяОтправления КАК ВремяОтправления,
		|	НарастающийИтог.ВремяПрибытия КАК ВремяПрибытия,
		|	НарастающийИтог.РасстояниеДоСледующейСтанции КАК РасстояниеДоСледующейСтанции,
		|	НарастающийИтог.РасстояниеНарастающимИтогом КАК РасстояниеНарастающимИтогом,
		|	НарастающийИтог.НомерСтроки КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА НарастающийИтог.Станция = &Станция
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Станция1
		|ИЗ
		|	НарастающийИтог КАК НарастающийИтог
		|
		|УПОРЯДОЧИТЬ ПО
		|	НарастающийИтог.Ссылка.Код,
		|	НомерСтроки
		|ИТОГИ ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("Станция", Локация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// получаем общую таблицу, где есть эта станция. 
	// чтобы получить расстояния в одну и другую сторону от станции (радиус) будем считать, что
	// нарастающий итог у искомой станции - "абсолютный ноль" и будем это значение вычитать из 
	// нарастающего итога всех остальных станции в пределах маршрута.
	// для станций, которые находятся в таблице ДО искомой, возьмем значение по модулю
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТаблицаСтанций = Новый ТаблицаЗначений;
	ТаблицаСтанций.Колонки.Добавить("Станция");
	ТаблицаСтанций.Колонки.Добавить("РасстояниеНарастающимИтогом");
	ТаблицаСтанций.Колонки.Добавить("НомерСтроки");
	
	Пока ВыборкаСсылка.Следующий() Цикл
		ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
		НарастИтогЭталон = 0;
		ТаблицаСтанций.Очистить();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			// заполним таблицу расстояниями и станциями в пределах одного табельного расписания
			НовСтр = ТаблицаСтанций.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр,ВыборкаДетальныеЗаписи);
			Если ВыборкаДетальныеЗаписи.Станция1 = 1 Тогда
				НарастИтогЭталон = ВыборкаДетальныеЗаписи.РасстояниеНарастающимИтогом;
			КонецЕсли;
		КонецЦикла;
		
		// создаем итоговый массив подходящих станций, но только в том случае, 
		// если mod(тек_нарастающий_итог-нарастающий_итог_иск_стн) менее значения введенного пользователем
		Для Каждого Стр Из ТаблицаСтанций Цикл
			Дельта = Стр.РасстояниеНарастающимИтогом-НарастИтогЭталон;
			МодульЧисла = Макс(-Дельта, Дельта);
			Если МодульЧисла <= ВРадиусеОтЛокации Тогда
				Если МассивСтн.Найти(Стр.Станция) = Неопределено Тогда
					МассивСтн.Добавить(Стр.Станция);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат МассивСтн;
	
КонецФункции

&НаКлиенте
Процедура ЛокацияНазначенияПриИзменении(Элемент)
	ОтборВДинСписке();
КонецПроцедуры

&НаКлиенте
Процедура ВРадиусеОтОтправленияПриИзменении(Элемент)
	ОтборВДинСписке();
КонецПроцедуры

&НаКлиенте
Процедура ВРадиусеОтНазначенияПриИзменении(Элемент)
	ОтборВДинСписке();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтборы(Команда)
	
	ЛокацияОтправления = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
	ЛокацияНазначения = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
	ВРадиусеОтНазначения = 0;
	ВРадиусеОтОтправления = 0;
	
	ОтборВДинСписке();
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )
