Процедура ДобавитьЗапись(КТК, НаборИзмененныхПолей, Знач Период = неопределено, ИспПроверкиПривязки=Истина, ЗапускЧерезВводДатыВозвратаСобственнику = Ложь) Экспорт
	
	Если Период = неопределено Тогда Период = ТекущаяДата(); КонецЕсли;
	
	МЗ = РегистрыСведений.стоки_КлиентскоеОперирование.СоздатьМенеджерЗаписи();
	
	// восстанавливаем данные предыдущией записи
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	*
	               |ИЗ
	               |	РегистрСведений.стоки_КлиентскоеОперирование.СрезПоследних(&Период, КТК = &КТК) КАК стоки_ТекущиеДанныеСрезПоследних";
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("КТК", КТК);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(МЗ, Ответ);
	КонецЕсли;
	
	МЗ.Период = Период;
	МЗ.ГУИДЗаписи = Строка(Новый УникальныйИдентификатор);
	МЗ.КТК = КТК;
	Если НЕ ЗначениеЗаполнено(МЗ.ПорядковыйНомерЦиклаАрендыКТК) Тогда МЗ.ПорядковыйНомерЦиклаАрендыКТК = 1; КонецЕсли;
	
	// ++ SIV Логика добавления новой клиентской записи, если в предыдущей был закрыт цикл пользования
	
	Если ЗначениеЗаполнено(МЗ.кл_ДатаВозврата) Тогда
		
		МЗ.ПорядковыйНомерЦиклаАрендыКТК = МЗ.ПорядковыйНомерЦиклаАрендыКТК + 1;
		МЗ.кл_Клиент = неопределено;
		МЗ.кл_Договор = неопределено;
		МЗ.кл_ДатаВыдачи = неопределено;
		МЗ.кл_СрокПользования = неопределено;
		МЗ.кл_ДатаВозврата = неопределено;
		МЗ.кл_ПСЦ = неопределено;
		МЗ.кл_НомерТСЗабор = неопределено;
		МЗ.кл_ВодительЗабор = неопределено;
		МЗ.кл_НомерТССдача = неопределено;
		МЗ.кл_ВодительСдача = неопределено;
		МЗ.кл_Рейс = неопределено;
		МЗ.кл_ДедлайнВыбораРейса = неопределено;
		
	КонецЕсли;
		
	// -- 
	
	//// Шейко О.Е. 05.05.2021 (Изменение дат для формирования Аренды КТК)
	Если ИспПроверкиПривязки Тогда
		
		ИзмДатаВыдачи 		= НаборИзмененныхПолей.Получить("кл_ДатаВыдачи");
		ИзмДатаВозврата 	= НаборИзмененныхПолей.Получить("кл_ДатаВозврата");
		Если ИзмДатаВыдачи <> Неопределено
			ИЛИ ИзмДатаВозврата <> Неопределено Тогда
			
			ТекЗнДатаВыдачи 	= МЗ.кл_ДатаВыдачи;
			ТекЗнДатаВозврата 	= МЗ.кл_ДатаВозврата;
			
			НовЗнДатаВыдачи = ?(ИзмДатаВыдачи = Неопределено, ТекЗнДатаВыдачи, ИзмДатаВыдачи);
			НовЗнДатаВозврата = ?(ИзмДатаВозврата = Неопределено, ТекЗнДатаВозврата, ИзмДатаВозврата);
			
			// ДИТ Поморцева Т.П. Задача 38715 16.09.21. начало (временно, в разрабатке)
			//Если ЗначениеЗаполнено(ТекЗнДатаВыдачи) И ЗначениеЗаполнено(ТекЗнДатаВозврата) 
			//	И (ТекЗнДатаВыдачи <> НовЗнДатаВыдачи ИЛИ ТекЗнДатаВозврата <> НовЗнДатаВозврата) Тогда
			//
			//	// Выполним поиск и фиксацию информации об изменении арендных периодов КТК
			//	ПоискПривязокПТУ_и_запускПересчетаАренды(ТекЗнДатаВыдачи, ТекЗнДатаВозврата)
			//
			//КонецЕсли; 
			
			
			
			//Если ЗначениеЗаполнено(НовЗнДатаВыдачи) И ЗначениеЗаполнено(НовЗнДатаВозврата)
			//	И (НовЗнДатаВыдачи <> ТекЗнДатаВыдачи ИЛИ НовЗнДатаВозврата <> ТекЗнДатаВозврата) Тогда
			//	
			//	// Выполним поиск и фиксацию информации об изменении арендных периодов КТК
			//	ПоискПривязокПТУ_и_запускПересчетаАренды(НовЗнДатаВыдачи, НовЗнДатаВозврата)
			//
			//КонецЕсли; 
			// ДИТ Поморцева Т.П. Задача 38715 16.09.21. конец (временно)
		КонецЕсли;
		
	КонецЕсли;
	
	ПоявиласьДатаВыдачиКлиенту = Ложь;
	
	ПоявиласьДатаЗавершенияКлиентскогоПериода = Ложь;
	
	Для каждого Поле из НаборИзмененныхПолей Цикл
		
		Если Поле.Ключ = "кл_ДатаВыдачи" ИЛИ Поле.Ключ = "кл_ДатаВозврата" Тогда
			Если Поле.Значение > ТекущаяДата() Тогда Продолжить; КонецЕсли;
		КонецЕсли;
		
		Если Поле.Ключ = "кл_ДатаВозврата" Тогда
			ПоявиласьДатаЗавершенияКлиентскогоПериода = Поле.Значение;
			Продолжить;
		КонецЕсли;

		Если Поле.Ключ = "кл_ДатаВыдачи" И ЗначениеЗаполнено(Поле.Значение) И НЕ ЗначениеЗаполнено(МЗ[Поле.Ключ]) Тогда
			ПоявиласьДатаВыдачиКлиенту = Истина;
		КонецЕсли;
		
		Если Поле.Ключ = "допл_Калькуляция" И ЗначениеЗаполнено(Поле.Значение) И МЗ[Поле.Ключ] <> Поле.Значение Тогда
			МЗ.допл_НачалоПериодаОтпр = Поле.Значение.НачалоДействия;
			МЗ.допл_ОкончаниеПериодаОтпр = Поле.Значение.ОкончаниеДействия;
			МЗ.допл_ПунктОтправления = Поле.Значение.Суша_ПунктОтправления;
			МЗ.допл_ПунктНазначения = Поле.Значение.Суша_ПунктНазначения;
		КонецЕсли;
		
		МЗ[Поле.Ключ] = Поле.Значение;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(МЗ.кл_Рейс) И НЕ ЗначениеЗаполнено(МЗ.кл_ДедлайнВыбораРейса) Тогда
		МЗ.кл_ДедлайнВыбораРейса = ТекущаяДата() + 7 * 24 * 3600;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МЗ.кл_ДатаВозврата) И НЕ ЗначениеЗаполнено(МЗ.кл_ДатаВыдачи) И ЗапускЧерезВводДатыВозвратаСобственнику = Ложь Тогда
		
		Сообщить("Внимание! Не заполнена Дата выдачи для КТК " + МЗ.КТК + "! Требуется внести в карточке КТК в клиентском блоке!", СтатусСообщения.ОченьВажное);
		
	КонецЕсли;
	
	МЗ.Записать(Истина);
	
	Если ПоявиласьДатаЗавершенияКлиентскогоПериода <> Ложь Тогда
		
		НЗ = РегистрыСведений.стоки_КлиентскоеОперирование.СоздатьНаборЗаписей();
		НЗ.Отбор.КТК.Установить(КТК);
		НЗ.Прочитать();
		
		НайдДата = Ложь;
		Для каждого Стр из НЗ Цикл
			Если НачалоДня(Стр.кл_ДатаВозврата) = НачалоДня(ПоявиласьДатаЗавершенияКлиентскогоПериода) Тогда
				НайдДата = Истина;
			КонецЕсли;
		КонецЦикла;
		
		ДатаВписалась = Ложь;
		
		Если НайдДата = Истина Тогда
			
			Сообщить("Указанная дата завершения клиентского цикла найдена в истории " + КТК + "! Данные обновлены!", СтатусСообщения.ОченьВажное);
			
		Иначе
			
			Для Сч = 0 По НЗ.Количество()-1 Цикл
				
				Стр87 = НЗ[Сч];
				Если 
					НЕ ЗначениеЗаполнено(Стр87.кл_ДатаВозврата) И 
					(Сч = НЗ.Количество()-1 ИЛИ Стр87.ПорядковыйНомерЦиклаАрендыКТК <> НЗ[Сч+1].ПорядковыйНомерЦиклаАрендыКТК) И 
					Стр87.кл_ДатаВыдачи < ПоявиласьДатаЗавершенияКлиентскогоПериода
				Тогда
					Стр87.кл_ДатаВозврата = ПоявиласьДатаЗавершенияКлиентскогоПериода;
					НЗ.Записать(Истина);
					Сообщить("Дата возврата клиентом внесена в клиентский цикл № " + Стр87.ПорядковыйНомерЦиклаАрендыКТК + " для " + КТК, СтатусСообщения.ОченьВажное);
					ДатаВписалась = Истина;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если ДатаВписалась = Ложь Тогда
				
				Сообщить("Не найден клиентский цикл, в который можно вписать дату завершения для " + КТК + ". Данные не изменены.", СтатусСообщения.ОченьВажное);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПоявиласьДатаВыдачиКлиенту Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Период", Период);
		Запрос.УстановитьПараметр("КТК", КТК);
		Запрос.Текст = "ВЫБРАТЬ
		               |	стоки_ТекущиеДанныеСрезПоследних.тек_ДатаВзятияИзСтока КАК тек_ДатаВзятияИзСтока
		               |ИЗ
		               |	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(&Период, КТК = &КТК) КАК стоки_ТекущиеДанныеСрезПоследних";
		Ответ = Запрос.Выполнить().Выбрать();
		Если Ответ.Следующий() Тогда
			
			Если НЕ ЗначениеЗаполнено(Ответ.тек_ДатаВзятияИзСтока) Тогда
				
				ДобПоля = Новый Соответствие;
				ДобПоля.Вставить("тек_ДатаВзятияИзСтока", МЗ.кл_ДатаВыдачи);
				РегистрыСведений.стоки_ТекущиеДанные.ДобавитьЗапись(КТК, ДобПоля, Период);
				
			КонецЕсли;
			
		КонецЕсли;
		
		
	КонецЕсли;
	
	// SIV Попытка закрыть кл цикл и открыть новый
	//Если ЗначениеЗаполнено(МЗ.кл_ДатаВозврата) Тогда
	//	АРМ_Сервер.СоздатьПустойЦиклАрендыКТКЕслиЗакрыт(МЗ.КТК);
	//КонецЕсли;
	
КонецПроцедуры

Процедура ПоискПривязокПТУ_и_запускПересчетаАренды(ПериодС, ПериодПо = неопределено) Экспорт

	// ДИТ Поморцева Т.П. Задача 38715 16.09.21. начало (временно)

	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	ПривязкаПоступленияКПериодуИспользованияКТК.ПТУ КАК ПТУ,
	//|	ПривязкаПоступленияКПериодуИспользованияКТК.СНП КАК СНП,
	//|	ПривязкаПоступленияКПериодуИспользованияКТК.КТК_Ссылка КАК КТК_Ссылка
	//|ПОМЕСТИТЬ ВыбИзменений
	//|ИЗ
	//|	РегистрСведений.ПривязкаПоступленияКПериодуИспользованияКТК КАК ПривязкаПоступленияКПериодуИспользованияКТК
	//|ГДЕ
	//|	(ПривязкаПоступленияКПериодуИспользованияКТК.ПериодС МЕЖДУ &КлПериодС И &КлПериодПо
	//|			ИЛИ ПривязкаПоступленияКПериодуИспользованияКТК.ПериодПо МЕЖДУ &КлПериодС И &КлПериодПо
	//|			ИЛИ &КлПериодС МЕЖДУ ПривязкаПоступленияКПериодуИспользованияКТК.ПериодС И ПривязкаПоступленияКПериодуИспользованияКТК.ПериодПо
	//|			ИЛИ &КлПериодПо МЕЖДУ ПривязкаПоступленияКПериодуИспользованияКТК.ПериодС И ПривязкаПоступленияКПериодуИспользованияКТК.ПериодПо)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ПривязкаПоступленияКПериодуИспользованияКТК.КТК_Ссылка,
	//|	ПривязкаПоступленияКПериодуИспользованияКТК.СНП,
	//|	ПривязкаПоступленияКПериодуИспользованияКТК.ПТУ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ПровестиПересчетПериода.ПТУ КАК ПТУ,
	//|	ПровестиПересчетПериода.КТК КАК КТК,
	//|	ПровестиПересчетПериода.СНП КАК СНП,
	//|	ПровестиПересчетПериода.ПересчитатьПериоды КАК ПересчитатьПериоды,
	//|	ПровестиПересчетПериода.ДобавитьЗаписиВАкцепт КАК ДобавитьЗаписиВАкцепт
	//|ИЗ
	//|	ВыбИзменений КАК ВыбИзменений
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПровестиПересчетПериода КАК ПровестиПересчетПериода
	//|		ПО ВыбИзменений.ПТУ = ПровестиПересчетПериода.ПТУ
	//|			И ВыбИзменений.КТК_Ссылка = ПровестиПересчетПериода.КТК
	//|			И ВыбИзменений.СНП = ПровестиПересчетПериода.СНП";
	//
	//Запрос.УстановитьПараметр("КлПериодС", ПериодС);
	//Запрос.УстановитьПараметр("КлПериодПо", ПериодПо);
	////Запрос.Выполнить().Выгрузить(); // Запрос.ВыполнитьПакетСПромежуточнымиДанными()[0].Выгрузить();
	//Результат = Запрос.Выполнить();
	//Выборка = Результат.Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	
	//	МЗ = РегистрыСведений.ПровестиПересчетПериода.СоздатьМенеджерЗаписи();
	//	ЗаполнитьЗначенияСвойств(МЗ, Выборка);
	//	МЗ.ПересчитатьПериоды = Истина;
	//	МЗ.Записать();
	//	
	//КонецЦикла;

	// ДИТ Поморцева Т.П. Задача 38715 16.09.21. конец (временно)
КонецПроцедуры

Функция ПолучитьСрезПоследнихПоКТК(КТК, Период = неопределено) Экспорт
	
	Результат = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	*
	               |ИЗ
	               |	РегистрСведений.стоки_КлиентскоеОперирование.СрезПоследних(&ПериодСреза, КТК = &КТК) КАК стоки_КлиентскоеОперированиеСрезПоследних";
	Запрос.УстановитьПараметр("КТК", КТК);
	Запрос.УстановитьПараметр("ПериодСреза", Период);
	ЗапросВыполнить = Запрос.Выполнить();
	Ответ = ЗапросВыполнить.Выбрать();
	Если Ответ.Следующий() Тогда
		
		Для каждого Колонка из ЗапросВыполнить.Колонки Цикл
			
			Результат.Вставить(Колонка.Имя, Ответ[Колонка.Имя]);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПопытатьсяВписатьДатуОкончанияВЦиклы(КТК, ДатаОкончания) Экспорт
	
	Результат = Ложь;
	
	НЗ = РегистрыСведений.стоки_КлиентскоеОперирование.СоздатьНаборЗаписей();
	НЗ.Отбор.КТК.Установить(КТК);
	НЗ.Прочитать();
	
	НайдДата = Ложь;
	Для каждого Стр из НЗ Цикл
		Если НачалоДня(Стр.кл_ДатаВозврата) = НачалоДня(ДатаОкончания) Тогда
			НайдДата = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если НайдДата = Истина Тогда
		Результат = Истина;
		
	ИначеЕсли НЗ.Количество() = 0 Тогда
		
		ДобавитьЗапись(КТК, Новый Структура("кл_ДатаВозврата", ДатаОкончания), ТекущаяДата(), Ложь, Истина);
		Результат = Истина;
		
	Иначе
				
		НомераОткрытыхЦиклов = Новый Массив;
		Для Сч = 0 По НЗ.Количество()-1 Цикл
			
			Стр87 = НЗ[Сч];
			Если 
				НЕ ЗначениеЗаполнено(Стр87.кл_ДатаВозврата) И 
				(Сч = НЗ.Количество()-1 ИЛИ Стр87.ПорядковыйНомерЦиклаАрендыКТК <> НЗ[Сч+1].ПорядковыйНомерЦиклаАрендыКТК) И 
				Стр87.кл_ДатаВыдачи < ДатаОкончания И 
				НомераОткрытыхЦиклов.Найти(Стр87.ПорядковыйНомерЦиклаАрендыКТК) = неопределено 
			Тогда
				НомераОткрытыхЦиклов.Добавить(Стр87.ПорядковыйНомерЦиклаАрендыКТК);
			КонецЕсли;
			
		КонецЦикла;
		
		//Для Сч = 2 По НЗ.Количество() - 1 Цикл
		//	Если НЗ[Сч].ПорядковыйНомерЦиклаАрендыКТК <> НЗ[Сч-1].ПорядковыйНомерЦиклаАрендыКТК И НЕ ЗначениеЗаполнено(НЗ[Сч-1].кл_ДатаВозврата) И НЗ[Сч-1].кл_ДатаВыдачи < ДатаОкончания Тогда
		//		НомераОткрытыхЦиклов.Добавить(НЗ[Сч-1].ПорядковыйНомерЦиклаАрендыКТК);
		//	КонецЕсли;
		//КонецЦикла;
		
		ПослЗапись = НЗ[НЗ.Количество()-1];
		
		Если НомераОткрытыхЦиклов.Количество() = 0 Тогда
			НомераОткрытыхЦиклов.Добавить(ПослЗапись.ПорядковыйНомерЦиклаАрендыКТК);
		КонецЕсли;
		
		Если НомераОткрытыхЦиклов.Количество() > 1 Тогда
			//ДИТ Шевченко А.В. 65473 07.03.2023 -начало
			//Сообщить("Невозможно определить период клиента, в рамках которого вносится дата возврата! Запись не выполнена!", СтатусСообщения.ОченьВажное);
			//ДИТ Шевченко А.В. 65473 07.03.2023 -конец
		Иначе
			
			ПослСтрокаРабочегоЦикла = неопределено;
			Для каждого Стр из НЗ Цикл
				Если Стр.ПорядковыйНомерЦиклаАрендыКТК = НомераОткрытыхЦиклов[0] Тогда
					ПослСтрокаРабочегоЦикла = Стр;
				КонецЕсли;
			КонецЦикла;
			
			Если ПослСтрокаРабочегоЦикла <> неопределено И НЕ ЗначениеЗаполнено(ПослСтрокаРабочегоЦикла.кл_ДатаВозврата) Тогда
				ПослСтрокаРабочегоЦикла.кл_ДатаВозврата = ДатаОкончания;
				НЗ.Записать(Истина);
				Результат = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//ДИТ, Беляев СЮ, BUG 72360 / TA 72948, 31-07-2023, начало
Процедура УдалитьЗаписиПоВыбранномуКТКиРелизу(КТК, РелизКлиентаСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	стоки_КлиентскоеОперирование.Период КАК Период,
		|	стоки_КлиентскоеОперирование.КТК КАК КТК,
		|	стоки_КлиентскоеОперирование.кл_Релиз КАК кл_Релиз
		|ИЗ
		|	РегистрСведений.стоки_КлиентскоеОперирование КАК стоки_КлиентскоеОперирование
		|ГДЕ
		|	стоки_КлиентскоеОперирование.КТК = &КТК
		|	И стоки_КлиентскоеОперирование.кл_Релиз = &кл_Релиз";
	
	Запрос.УстановитьПараметр("кл_Релиз", РелизКлиентаСсылка);
	Запрос.УстановитьПараметр("КТК", КТК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Запись = РегистрыСведений.стоки_КлиентскоеОперирование.СоздатьМенеджерЗаписи();
		Запись.Период = ВыборкаДетальныеЗаписи.Период;
		Запись.КТК = ВыборкаДетальныеЗаписи.КТК;
		Запись.Удалить();
	КонецЦикла;
	
КонецПроцедуры
//ДИТ, Беляев СЮ, BUG 72360 / TA 72948, 31-07-2023, конец