#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	// Евросиб Фролов (01.11.2021 Ticket№ 0246734
	// Беккер: право удалять строки в карточке КТК  должны быть доступны сотрудникам ролью "Аудитор"	
	// Удаление записей
	Если ЭтотОбъект.Количество() = 0 И ЭтотОбъект.Модифицированность() = Истина Тогда
		//ДИТ Авдеева В.С. 20.04.2022 45700 Начало 
		//было
		//РазрешитьРедактированиеИнвентаризацииКТК = Пользователи.РолиДоступны("dc_РазрешитьРедактированиеИнвентаризацииКТК"); 
		//стало
		РазрешитьРедактированиеИнвентаризацииКТК = Пользователи.РолиДоступны("dc_РазрешитьРедактированиеИнвентаризацииЦиклыАрендыКТК"); 
		//ДИТ Авдеева В.С. 20.04.2022 45700 Конец 
		
		Если НЕ РазрешитьРедактированиеИнвентаризацииКТК Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Удаление записей доступно только пользоваелям с правами аудиторов.'"),,,, Отказ);
		КонецЕсли;
		
	КонецЕсли;	
	// Евросиб Фролов)
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
