Процедура ЗапуститьСледующиеОперации(ТекОперация) Экспорт
	
	МассивДочерних = ПолучитьДочерниеОперации(ТекОперация);
	Для каждого Оп из МассивДочерних.МассивДочерних Цикл
		
		Если ВсеРодителиОперацииВыполнены(Оп, МассивДочерних.ТСх) Тогда
			ЗапуститьНаВыполнение(Оп);
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

Функция ВсеРодителиОперацииВыполнены(Операция, ТСх) Экспорт
	
	Результат = Истина;
	
	Если НЕ ЗначениеЗаполнено(ТСх) Тогда Возврат Ложь; КонецЕсли;
	
	ГУИДыРодителей = Новый Массив;
	
	Для каждого Стр из ТСх.ТЧ Цикл
		Если Стр.Операция = Операция Тогда 
			Если ЗначениеЗаполнено(Стр.Родитель1) Тогда ГУИДыРодителей.Добавить(Стр.Родитель1); КонецЕсли; 
			Если ЗначениеЗаполнено(Стр.Родитель2) Тогда ГУИДыРодителей.Добавить(Стр.Родитель2); КонецЕсли; 
			Если ЗначениеЗаполнено(Стр.Родитель3) Тогда ГУИДыРодителей.Добавить(Стр.Родитель3); КонецЕсли; 
			Если ЗначениеЗаполнено(Стр.Родитель4) Тогда ГУИДыРодителей.Добавить(Стр.Родитель4); КонецЕсли; 
			Если ЗначениеЗаполнено(Стр.Родитель5) Тогда ГУИДыРодителей.Добавить(Стр.Родитель5); КонецЕсли; 
			Прервать; 
		КонецЕсли;
	КонецЦикла;
	
	Если ГУИДыРодителей.Количество() = 0 Тогда Возврат Ложь; КонецЕсли;
	
	Для каждого Стр из ТСх.ТЧ Цикл
		Если ГУИДыРодителей.Найти(Стр.ГУИД) <> неопределено Тогда
			Результат = Результат И Стр.Операция.ОперацияВыполнена;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции

Процедура ЗапуститьНаВыполнение(Операция)
	
	ОО = Операция.ПолучитьОбъект();
	ЧтоТоИзменено = Ложь;
	Для каждого Стр из ОО.Состояния Цикл
		Если Стр.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
			Стр.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
			ЧтоТоИзменено = Истина;
		КонецЕсли;
	КонецЦикла;
	Если ЧтоТоИзменено Тогда
		ОО.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьВсеДочерниеОперации(Операция) Экспорт
	
	Результат = Новый Массив;
	
	ЗапросПоискаДочерних = Новый Запрос;
	ЗапросПоискаДочерних.Текст = "ВЫБРАТЬ
	                             |	ТехнологическаяСхемаТЧ.Операция КАК Операция,
	                             |	ТехнологическаяСхемаТЧ.ГУИД КАК ГУИД
	                             |ИЗ
	                             |	Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
	                             |ГДЕ
	                             |	ТехнологическаяСхемаТЧ.Ссылка = &ТСх
	                             |	И НЕ ТехнологическаяСхемаТЧ.ГУИД В (&НайдОперации)
	                             |	И (ТехнологическаяСхемаТЧ.Родитель1 В (&НайдОперации)
	                             |			ИЛИ ТехнологическаяСхемаТЧ.Родитель2 В (&НайдОперации)
	                             |			ИЛИ ТехнологическаяСхемаТЧ.Родитель3 В (&НайдОперации)
	                             |			ИЛИ ТехнологическаяСхемаТЧ.Родитель4 В (&НайдОперации)
	                             |			ИЛИ ТехнологическаяСхемаТЧ.Родитель5 В (&НайдОперации))";
	
	СтруктураДочерних1Уровня = ПолучитьДочерниеОперации(Операция);
	ЗапросПоискаДочерних.УстановитьПараметр("ТСх", СтруктураДочерних1Уровня.ТСх);
	Результат = СтруктураДочерних1Уровня.МассивДочерних;
	НайдОперации = СтруктураДочерних1Уровня.МассивГУИДов;
	ЧтотоНайдено = Истина;
	Пока ЧтотоНайдено = Истина Цикл
		
		ЧтотоНайдено = Ложь;
		ЗапросПоискаДочерних.УстановитьПараметр("НайдОперации", НайдОперации);
		Ответ = ЗапросПоискаДочерних.Выполнить().Выбрать();
		Пока Ответ.Следующий() Цикл
			НайдОперации.Добавить(Ответ.ГУИД);
			Результат.Добавить(Ответ.Операция);
			ЧтотоНайдено = Истина;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДочерниеОперации(Операция)
	
	МассивДочерних = Новый Массив;
	МассивГУИДов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ТехнологическаяСхемаТЧ.Ссылка КАК Ссылка,
	               |	ТехнологическаяСхемаТЧ.ГУИД КАК ГУИД
	               |ИЗ
	               |	Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
	               |ГДЕ
	               |	ТехнологическаяСхемаТЧ.Операция = &Операция";
	Запрос.УстановитьПараметр("Операция", Операция);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		
		Для каждого Оп из Ответ.Ссылка.ТЧ Цикл
			Если Оп.Родитель1 = Ответ.ГУИД ИЛИ Оп.Родитель2 = Ответ.ГУИД ИЛИ Оп.Родитель3 = Ответ.ГУИД ИЛИ Оп.Родитель4 = Ответ.ГУИД ИЛИ Оп.Родитель5 = Ответ.ГУИД Тогда
				МассивДочерних.Добавить(Оп.Операция);
				МассивГУИДов.Добавить(Оп.ГУИД);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Новый Структура("МассивДочерних, МассивГУИДов, ТСх", МассивДочерних, МассивГУИДов, Ответ.Ссылка);
	
КонецФункции

Процедура ЗапуститьВРаботуИОтметитьДатуНачала(Операция, ДатаНачалаФакт) Экспорт
	
	ОО = Операция.ПолучитьОбъект();
	
	// Евросиб Фролов (14.04.2022 Task №50195
	Попытка
		ОО.Заблокировать();
	// Евросиб Фролов)	
		
		ЧтоТоИзменено = Ложь;
		Для каждого Стр из ОО.Состояния Цикл
			Если Стр.Статус = Перечисления.СтатусыЭтапов.Новый ИЛИ Стр.Статус = Перечисления.СтатусыЭтапов.НаВыполнение Тогда
				Стр.Статус = Перечисления.СтатусыЭтапов.ВРаботе;
				ЧтоТоИзменено = Истина;
			КонецЕсли;
		КонецЦикла;
		Если НЕ ЗначениеЗаполнено(ОО.ДатаОтправленияФакт) Тогда
			ОО.ДатаОтправленияФакт = ДатаНачалаФакт;
			ЧтоТоИзменено = Истина;
		КонецЕсли;
		Если ЧтоТоИзменено Тогда
			ОО.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		
	// Евросиб Фролов (14.04.2022 Task №50195	
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Запуск в работу документа ""Операция""'", Метаданные.ОсновнойЯзык.КодЯзыка),
							УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.Операция, ОО, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
							
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Операция, "Услуга, Поставщик, Дата");					
		ПредставлениеДокумента = "" + РеквизитыДокумента.Услуга
								+ " от " + Формат(РеквизитыДокумента.Дата, "ДФ=dd.MM.yy")
								+ ?(ЗначениеЗаполнено(РеквизитыДокумента.Поставщик), " пост.: " + РеквизитыДокумента.Поставщик, "");
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось запустить в работу документ ""Операция"" - №%1.
                                         |Ошибка: %2'"),
												ПредставлениеДокумента,
												КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));				
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ОО);				
	КонецПопытки;
	// Евросиб Фролов)
	
КонецПроцедуры

Процедура ОтметитьВыполнениеОперацииИЗапуститьСледующиеЕслиОниВСтык(Операция, ДатаЗавершенияФакт) Экспорт
	
	ОО = Операция.ПолучитьОбъект();
	ЧтоТоИзменено = Ложь;
	Для каждого Стр из ОО.Состояния Цикл
		Если Стр.Статус = Перечисления.СтатусыЭтапов.ВРаботе Тогда
			Стр.Статус = Перечисления.СтатусыЭтапов.Выполнен;
			ЧтоТоИзменено = Истина;
		КонецЕсли;
	КонецЦикла;
	Если НЕ ЗначениеЗаполнено(ОО.ДатаНазначенияФакт) Тогда
		ОО.ДатаНазначенияФакт = ДатаЗавершенияФакт;
		ЧтоТоИзменено = Истина;
	КонецЕсли;
	Если ЧтоТоИзменено Тогда
		ОО.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
	СписокДочерних = ПолучитьДочерниеОперации(Операция);
	Для каждого Стр из СписокДочерних.МассивДочерних Цикл
		Если Стр.ПунктОтправления = Операция.ПунктНазначения И Стр.ДатаОтправления = ДатаЗавершенияФакт Тогда
			ЗапуститьВРаботуИОтметитьДатуНачала(Стр, ДатаЗавершенияФакт);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ТСхТекОперации(Операция) Экспорт
	
	Результат = неопределено;
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ТехнологическаяСхемаТЧ.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ТехнологическаяСхема.ТЧ КАК ТехнологическаяСхемаТЧ
	               |ГДЕ
	               |	ТехнологическаяСхемаТЧ.Операция = &Операция";
	Запрос.УстановитьПараметр("Операция", Операция);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
