// МальцевАН 83034 02.04.2024
//(
&НаКлиенте
Процедура ЛокацияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыОтбора = Новый Структура("Тип",ПредопределенноеЗначение("Справочник.ТипыЛокаций.Терминал"));
	ПараметрыФормы = Новый Структура("Отбор", ПараметрыОтбора);
	ОткрытьФорму("Справочник.Локации.ФормаВыбора",ПараметрыФормы,Элемент);	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	Если Запись.КвотаГруженые = -1 Тогда
		ГруженныеНеСогласовано = Истина;
		Элементы.КвотаГруженые.ТолькоПросмотр = Истина;
	КонецЕсли;
	Если Запись.КвотаПорожние = -1 Тогда
		ПорожниеНеСогласовано = Истина;
		Элементы.КвотаПорожние.ТолькоПросмотр = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры

&НаКлиенте
Процедура ГруженныеНеСогласованоПриИзменении(Элемент)
	Если ГруженныеНеСогласовано Тогда
		 Элементы.КвотаГруженые.ТолькоПросмотр = Истина;
		 Запись.КвотаГруженые = -1; 
	Иначе
		 Элементы.КвотаГруженые.ТолькоПросмотр = Ложь;
		 Запись.КвотаГруженые = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПорожниеНеСогласованоПриИзменении(Элемент)
	Если ПорожниеНеСогласовано Тогда
		 Элементы.КвотаПорожние.ТолькоПросмотр = Истина;
		 Запись.КвотаПорожние = -1; 
	Иначе
		 Элементы.КвотаПорожние.ТолькоПросмотр = Ложь;
		 Запись.КвотаПорожние = 0;
	КонецЕсли;

КонецПроцедуры
// МальцевАН 83034 02.04.2024

