
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщаяИнформацияПоКТК();
	
	АРМ_Сервер.СозданиеОтчетовДляАРМ(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбщаяИнформацияПоКТК()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтейнерыВСтокахОстатки.Сток КАК Сток,
	               |	КонтейнерыВСтокахОстатки.Назначение КАК Направление,
	               |	КонтейнерыВСтокахОстатки.Контрагент КАК Контрагент,
	               |	КонтейнерыВСтокахОстатки.Контейнер КАК Контейнер,
	               |	КонтейнерыВСтокахОстатки.КоличествоОстаток КАК КоличествоБНКонтейнеров
	               |ПОМЕСТИТЬ ДанныеРС
	               |ИЗ
	               |	РегистрНакопления.КонтейнерыВСтоках.Остатки(, ) КАК КонтейнерыВСтокахОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеРС.Сток КАК Сток,
	               |	ДанныеРС.Направление КАК Направление,
	               |	ДанныеРС.Контрагент КАК Контрагент,
	               |	ДанныеРС.Контейнер КАК Контейнер,
	               |	ЗНАЧЕНИЕ(Перечисление.СтатусыКТК.Свободен) КАК Статус,
	               |	ДанныеРС.КоличествоБНКонтейнеров КАК КоличествоБНКонтейнеров
	               |ПОМЕСТИТЬ СтатусыКТК
	               |ИЗ
	               |	ДанныеРС КАК ДанныеРС
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СтатусыКТКСрезПоследних.Сток,
	               |	СтатусыКТКСрезПоследних.Направление,
	               |	СтатусыКТКСрезПоследних.Контрагент,
	               |	СтатусыКТКСрезПоследних.Контейнер,
	               |	СтатусыКТКСрезПоследних.Статус,
	               |	СтатусыКТКСрезПоследних.Количество
	               |ИЗ
	               |	РегистрСведений.СтатусыКТК.СрезПоследних КАК СтатусыКТКСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеРС КАК ДанныеРС
	               |		ПО (ДанныеРС.Сток = СтатусыКТКСрезПоследних.Сток)
	               |			И (ДанныеРС.Контрагент = СтатусыКТКСрезПоследних.Контрагент)
	               |			И (ДанныеРС.Контейнер = СтатусыКТКСрезПоследних.Контейнер)
	               |			И СтатусыКТКСрезПоследних.Направление = ДанныеРС.Направление
	               |ГДЕ
	               |	СтатусыКТКСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКТК.Зарезервирован)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СтатусыКТК.Сток КАК Сток,
	               |	СтатусыКТК.Направление КАК Назначение,
	               |	СтатусыКТК.Контрагент КАК Контрагент,
	               |	СтатусыКТК.Статус КАК Статус,
	               |	СУММА(ВЫБОР
	               |			КОГДА СтатусыКТК.Контейнер ССЫЛКА Справочник.ТЕ
	               |				ТОГДА СтатусыКТК.КоличествоБНКонтейнеров
	               |		КОНЕЦ) КАК КолвоНомерныхКТК,
	               |	СУММА(ВЫБОР
	               |			КОГДА СтатусыКТК.Контейнер ССЫЛКА Справочник.ТипоразмерыТЕ
	               |				ТОГДА СтатусыКТК.КоличествоБНКонтейнеров
	               |		КОНЕЦ) КАК КолвоБНКТК,
	               |	СУММА(СтатусыКТК.КоличествоБНКонтейнеров) КАК ВсегоКТК
	               |ИЗ
	               |	СтатусыКТК КАК СтатусыКТК
	               |ГДЕ
	               |	(НЕ СтатусыКТК.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКТК.ВДвижении)
	               |			ИЛИ СтатусыКТК.Статус ЕСТЬ NULL)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СтатусыКТК.Контрагент,
	               |	СтатусыКТК.Статус,
	               |	СтатусыКТК.Сток,
	               |	СтатусыКТК.Направление
	               |ИТОГИ ПО
	               |	Сток";
	ТЗ = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);

	ЗначениеВРеквизитФормы(ТЗ, "КТКСтоки");
	
	//ВсегоКТК = ТЗ.Итог("ВсегоКТК");
	
КонецПроцедуры


&НаКлиенте
Процедура ВнестиОстатки(Команда)
 	Оповещение = Новый ОписаниеОповещения("ПослеОкончанияИзменения", ЭтотОбъект,);
	ОткрытьФорму("Документ.СтокКонтейнеров.ФормаОбъекта",,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьДанные(Команда)
	ОбщаяИнформацияПоКТК();
КонецПроцедуры

&НаКлиенте
Процедура ОтчетОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ОткрытьФорму("Отчет."+ Элемент.Имя +".Форма");
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОстатки(Команда)
	
	ТекД = Элементы.КТКСтоки.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
    ПараметрыФормы.Вставить("Сток", ТекД.Сток);

 	Оповещение = Новый ОписаниеОповещения("ПослеОкончанияИзменения", ЭтотОбъект,);
 	ОткрытьФорму("Документ.СтокКонтейнеров.ФормаОбъекта", ПараметрыФормы,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	
	//СсылкаНаДокумент = СоздатьНовыйДокумент(ТекД.Сток);
	//ОткрытьЗначение(СсылкаНаДокумент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОкончанияИзменения(Результат, Параметры) Экспорт
	
	ОбщаяИнформацияПоКТК();

КонецПроцедуры		

&НаСервере
Функция СоздатьНовыйДокумент(Сток)

   НовыйДокумент = Документы.СтокКонтейнеров.СоздатьДокумент();
   НовыйДокумент.Дата = ТекущаяДата();
   НовыйДокумент.Сток = Сток;
   НовыйДокумент.Записать();

   Возврат НовыйДокумент.Ссылка;

КонецФункции

&НаКлиенте
Процедура УстановкаДатОпераций(Команда)
	//ПараметрыФормы = Новый Структура("Отправка", Список.Отбор.Элементы[0].ПравоеЗначение);
	ОткрытьФорму("Обработка.УстановкаФактическойДатыОпераций.Форма", ,,ЭтаФорма.УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
