
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);

	ФонВыполненногоСостояния = ЦветаСтиля.ФонВыполненногоСостояния;
	ФонБудущегоСостояния = ЦветаСтиля.ФонБудущегоСостояния;
	ЦветКнопки_Исходный = Элементы.ЗаполнятьПоПервойСтроке.ЦветФона;
	ЦветКнопки_Выделенный = WebЦвета.Розовый;
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	
	НастроитьКолонкиТаблицыСпециальныхСтавок();
		
	СтатусДокументаПервичный = ТекущийИсполнитель_Статус;
	СостояниеДокументаПервичное = ТекущийИсполнитель_Состояние;
	
	Если ЗначениеЗаполнено(Объект.Применяется) 
		И ТипЗнч(Объект.Применяется) = Тип("ДокументСсылка.ПСЦ") Тогда
		ЗаполнитьКалькуляцииНотиса();
		Элементы.ВидПеревозки.ТолькоПросмотр = Истина;
		Элементы.НаправлениеПеревозки.ТолькоПросмотр = Истина;
		Элементы.РейсыРейсы.ТолькоПросмотр = Истина;
		Элементы.ДобавитьРейс.Доступность = Ложь;
	КонецЕсли;
	
	ПользовательСПолнымиПравами = РольДоступна("ПолныеПрава");
	Элементы.ГруппаПечать.Видимость = ПользовательСПолнымиПравами;
	Элементы.ГруппаОтладка.Видимость = ПользовательСПолнымиПравами;
	Элементы.ГруппаСостояния.ТолькоПросмотр = Не ПользовательСПолнымиПравами;
	
	ПользовательСПравами = РольДоступна("dc_СозданиеРедактированиеДокументовСпециальнаяСтавка");
	Если Не ПользовательСПравами И Не ПользовательСПолнымиПравами Тогда
		Элементы.ВставкаПараметровПеревозкиИзEXCEL.Доступность = Ложь;
		Элементы.ВставкаСтавокИзEXCEL.Доступность = Ложь;
		Элементы.ОчиститьПараметры.Доступность = Ложь;
		Элементы.Ставки.ТолькоПросмотр = Истина;
		Элементы.НадбавкиСкидки.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	
	ПериодДействия.ДатаНачала = Объект.НачалоДействия;
	ПериодДействия.ДатаОкончания = Объект.ОкончаниеДействия;
	
	СформироватьТаблицуФормы();
	
	ЗаполнитьКалькуляцииСтрокой();
	УпорядочитьСписокСпецСтавок();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодсвечиваниеПолейОбъектов.НастроитьПодсвечиваниеПолей(ТекущийОбъект, ИмяФормы, ЭтаФорма, УсловноеОформление);	

	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
	УпорядочитьСписокСпецСтавок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.НачалоДействия = ПериодДействия.ДатаНачала;
	Объект.ОкончаниеДействия = ПериодДействия.ДатаОкончания;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если Не ЗначениеЗаполнено(СостояниеДокументаПервичное) Тогда
		СостояниеДокументаПервичное = ТекущийИсполнитель_Состояние;
	КонецЕсли;
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("СостояниеДокументаПервичное", СостояниеДокументаПервичное);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("СтатусДокументаПервичный", СтатусДокументаПервичный);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ТекущийСтатус", ТекущийИсполнитель_Статус);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ЗаписьИзФормы", Истина);
	
	АктуализироватьКалькуляции(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	
	ПодсвечиваниеПолейОбъектов.НастроитьПодсвечиваниеПолей(ТекущийОбъект, ИмяФормы, ЭтаФорма, УсловноеОформление);
	
	СинхронизироватьКалькуляцииНаФорме();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ТипЗнч(Объект.Применяется) = Тип("ДокументСсылка.ПСЦ") Тогда
		ПроверяемыеРеквизиты.Добавить("ПериодДействия");
	Иначе
		ПроверяемыеРеквизиты.Добавить("ВидПеревозки");
	КонецЕсли;
	
	ПроверитьЗаполненностьТаблицыСпецСтавок(Отказ);
	
	ПроверитьДублиСтрок(НаименованияКолонокДляПроверки(), Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ТребуетсяПеречитатьУказанныйДокумент" И Параметр = Объект.Ссылка Тогда
		ЭтаФорма.Прочитать();
		ОбновитьПанельТекущегоПользователя();
		ОбновитьПанельСостояний();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	Если Команда.Имя = "ПодменюПечатьОбычное_СпециальноеПредложение" Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ДокументСсылка", Объект.Ссылка);
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Команда", Команда);
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораКлиента", ЭтаФорма, ДополнительныеПараметры);
	
		ОткрытьФорму("Документ.РеестрСпециальныхСтавок.Форма.ФормаВыбораКлиента", ПараметрыФормы, ЭтаФорма, , , ,
															ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыВыбораКлиента(ВыбранныеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеЗначение <> Неопределено Тогда
		ВыбранныеКонтрагенты.ЗагрузитьЗначения(ВыбранныеЗначение);
	Иначе
		Возврат;
	КонецЕсли;
	
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, ДополнительныеПараметры.Команда, Объект);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКонтрагента(Команда)
	Элементы.Контрагенты.ДобавитьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТипКлиента(Команда)
	Элементы.ТипыКлиента.ДобавитьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПунктОтправления(Команда)
	Элементы.ПунктыОтправленияЖД.ДобавитьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПунктНазначения(Команда)
	Элементы.ПунктыНазначенияЖД.ДобавитьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПортОтправления(Команда)
	Элементы.ПортыОтправления.ДобавитьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПортОтгрузки(Команда)
	Элементы.ПортыОтгрузки.ДобавитьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПортНазначения(Команда)
	Элементы.ПортыНазначения.ДобавитьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРейс(Команда)
	ПроверитьКорректностьДобавленияРейса();
КонецПроцедуры

&НаКлиенте
Процедура ВвестиСтавки(Команда)
	УдалитьПустыеСтрокиВПараметрахПеревозки();
	ВвестиСтавкиНаСервере();
	СвернутьТаблицуСпецСтавок();
	СформироватьТаблицуФормы();
	УпорядочитьСписокСпецСтавок();
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПроверитьЗаполненностьТаблицыСпецСтавок(Отказ)
	
	Для Каждого Строка Из Объект.СпециальныеСтавки Цикл
		Если Строка.ПараметрПеревозки.ВидТранспортногоСообщения = Перечисления.ВидыТранспортныхСообщений.Море 
			И (Не ЗначениеЗаполнено(Строка.УсловияВыгрузки) 
				Или Не ЗначениеЗаполнено(Строка.УсловияПогрузки)) Тогда
			Для Каждого СтрокаФормы Из СпециальныеСтавкиФорма Цикл
				НайденИдентификатор = СтрокаФормы.ИдентификаторыСтрок.НайтиПоЗначению(Строка.ИдентификаторСтроки);
				Если НайденИдентификатор <> Неопределено Тогда
					Если Не ЗначениеЗаполнено(Строка.УсловияВыгрузки) Тогда
						ТекстСообщения = НСтр("ru = 'Не заполнено условие выгрузки'");
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ,
							"СпециальныеСтавкиФорма[" + СтрокаФормы.ПолучитьИдентификатор() + "].УсловияВыгрузки", , Отказ);
					КонецЕсли;
					Если Не ЗначениеЗаполнено(Строка.УсловияПогрузки) Тогда
						ТекстСообщения = НСтр("ru = 'Не заполнено условие погрузки'");
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ,
							"СпециальныеСтавкиФорма[" + СтрокаФормы.ПолучитьИдентификатор() + "].УсловияПогрузки", , Отказ);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если Строка.ПараметрПеревозки.ВидТранспортногоСообщения = Перечисления.ВидыТранспортныхСообщений.ЖД 
			И (Не ЗначениеЗаполнено(Строка.УсловияПеревозкиОтправление) 
				Или Не ЗначениеЗаполнено(Строка.УсловияПеревозкиПрибытие)) Тогда
			Для Каждого СтрокаФормы Из СпециальныеСтавкиФорма Цикл
				НайденИдентификатор = СтрокаФормы.ИдентификаторыСтрок.НайтиПоЗначению(Строка.ИдентификаторСтроки);
				Если НайденИдентификатор <> Неопределено Тогда
					Если Не ЗначениеЗаполнено(Строка.УсловияПеревозкиОтправление) Тогда
						ТекстСообщения = НСтр("ru = 'Не заполнено условие отправления'");
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ,
							"СпециальныеСтавкиФорма[" + СтрокаФормы.ПолучитьИдентификатор() + "].УсловияПеревозкиОтправление", , Отказ);
					КонецЕсли;
					Если Не ЗначениеЗаполнено(Строка.УсловияПеревозкиПрибытие) Тогда
						ТекстСообщения = НСтр("ru = 'Не заполнено условие прибытия'");
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ,
							"СпециальныеСтавкиФорма[" + СтрокаФормы.ПолучитьИдентификатор() + "].УсловияПеревозкиПрибытие", , Отказ);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьКолонкиТаблицыСпециальныхСтавок()
	
	Для Каждого Элемент Из Элементы Цикл
		Если СтрНайти(Элемент.Имя, "СпециальныеСтавкиКалькуляции") > 0 И ТипЗнч(Элемент) = Тип("ПолеФормы") Тогда
			Элемент.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.Калькуляция");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры

&НаСервере
Процедура УпорядочитьСписокСпецСтавок()
	
	СпециальныеСтавкиФорма.Сортировать("ПунктОтправления, ПунктНазначения, ПортОтправления, ПортОтгрузки, ПортНазначения");
	ОбновитьНумерациюСтрокТаблицыСпецСтавок();

КонецПроцедуры

&НаСервере
Процедура ОбновитьНумерациюСтрокТаблицыСпецСтавок()
	
	Для Счетчик = 1 По СпециальныеСтавкиФорма.Количество() Цикл
		СпециальныеСтавкиФорма[Счетчик - 1].НомерСтроки = Счетчик;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СвернутьТаблицуСпецСтавок()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ОбщегоНазначенияКлиентСервер.СвернутьТабличнуюЧасть(ДокументОбъект, "СпециальныеСтавки", "Ставка,ПлановыйОбъемTEU,НадбавкаСкидка");
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура РейсыРейсыОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.ПСЦ") 
		И Объект.Рейсы.Количество() > 0 Тогда
		ТекстСообщения = НСтр("ru = 'В перечне рейсов может быть только один Нотис'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКорректностьДобавленияРейса()
	
	Если ВРейсахЕстьНотис() Тогда
		ТекстСообщения = НСтр("ru = 'В перечне рейсов может быть только один Нотис'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	Иначе
		Элементы.Рейсы.ДобавитьСтроку();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВРейсахЕстьНотис()
	
	Результат = Ложь;
	
	Если Объект.Рейсы.Количество() > 0 
		И ТипЗнч(Объект.Рейсы[0].Рейс) = Тип("ДокументСсылка.ПСЦ") Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ТекущийИсполнитель_СтатусПриИзменении(Элемент)

	МаршрутизацияКлиент.ТекущийИсполнитель_СтатусПриИзменении(Объект, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
	ОбновитьПанельСостояний();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПанельСостояний()
	
	МаршрутизацияСервер.ОбновитьПанельСостояний(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПанельТекущегоПользователя()
	
	МаршрутизацияСервер.ОбновитьПанельТекущегоПользователя(Объект, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикНажатияПлитокСостояния(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	МаршрутизацияКлиент.ОбработчикНажатияНаПлиткуОбщий(Параметр1, Параметр2);
КонецПроцедуры

&НаКлиенте
Процедура Делегировать(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ВыборДелегирования", ЭтаФорма);
	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаВыбора", , , ЭтаФорма.УникальныйИдентификатор, , , ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборДелегирования(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	Если Параметр1 = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Для Сч = 0 По Объект.Состояния.Количество() - 1 Цикл
		Если Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение") ИЛИ Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.ВРаботе") Тогда
			Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Новый");
			НСтр = Объект.Состояния.Вставить(Сч);
			НСтр.Состояние = ПредопределенноеЗначение("Справочник.Состояния.ДелегированноеСогласование");
			НСтр.Исполнитель = Параметр1;
			НСтр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение");
			ОбновитьПанельСостояний();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Рецензирование(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаРецензирования", ЭтаФорма);
	ПараметрыФормы = Новый Структура("РецензОбъект", Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.РецензированиеПриСогласовании", ПараметрыФормы, , ЭтаФорма.УникальныйИдентификатор, , , ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРецензирования(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	Если Параметр1 = Неопределено Тогда 
		Возврат; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СостоянияСтатусСогласованияПриИзменении(Элемент)
	
	ТекД = Элементы.Состояния.ТекущиеДанные;
	Если ТекД <> Неопределено Тогда
		ТекД.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЛистСогласования(Команда)
	
	ТабДок = МаршрутизацияСервер.ПолучитьТабдокЛистаСогласования(Объект.Ссылка);
	ТабДок.Показать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьНаСогласование(Команда)
	
	ДанныеЕсть = Ложь;
	Для Каждого Стр Из объект.Состояния Цикл
		Если ПолучитьСогласование(Стр.Состояние) Тогда
			ДанныеЕсть = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ДанныеЕсть = Ложь Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("В таблице Состояния нет ни одного согласования!");
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.Модифицированность Тогда 
		Записать(); 
	КонецЕсли;
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаСогласования", ЭтаФорма);
	
	ТекПроцессСогл = ПечатьБухгалтерскихДокументов.ПроверитьНаличиеПроцесса(Объект.Ссылка);
	Если ТекПроцессСогл = ПредопределенноеЗначение("Справочник.ПроцессСогласования.ПустаяСсылка") Тогда
		ПараметрыФормы = Новый Структура("ДокументСогласования", Объект.Ссылка);
	Иначе
		ПараметрыФормы = Новый Структура("Ключ", ТекПроцессСогл);
	КонецЕсли;
	ОткрытьФорму("Справочник.ПроцессСогласования.ФормаОбъекта", ПараметрыФормы, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор, , , ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСогласование(Сост)
	Возврат Сост.Согласование;
КонецФункции
	
&НаКлиенте
Процедура ОбработкаСогласования(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	ЭтаФорма.ОбновитьОтображениеДанных();
	ОбновитьПанельСостояний();
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьКалькуляцииНотиса()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПСЦКалькуляции.Калькуляция КАК Калькуляция
	|ИЗ
	|	Документ.ПСЦ.Калькуляции КАК ПСЦКалькуляции
	|ГДЕ
	|	ПСЦКалькуляции.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Объект.Применяется);
	
	МассивКалькуляций = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Калькуляция");
	
	ТекстЗапроса = ТекстЗапросаДанныхКалькуляцийНотиса();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("СсылкиКалькуляций", МассивКалькуляций);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = КалькуляцииНотиса.Добавить();
		НоваяСтрока.Калькуляция = Выборка.Калькуляция;
		НоваяСтрока.SOCЖД = Выборка.SOCЖД;
		НоваяСтрока.COCЖД = Выборка.COCЖД;
		НоваяСтрока.SOCФрахт = Выборка.SOCФрахт;
		НоваяСтрока.COCФрахт = Выборка.COCФрахт;
		Если Выборка.Размер20 И ЗначениеЗаполнено(Выборка.Итого20Заполнено) Тогда
			НоваяСтрока.Размер20 = Истина;
		КонецЕсли;
		Если Выборка.Размер40 И ЗначениеЗаполнено(Выборка.Итого40Заполнено) Тогда
			НоваяСтрока.Размер40 = Истина;
		КонецЕсли;
		НоваяСтрока.Выбрано20ЖД = Выборка.Выбрано20ЖД;
		НоваяСтрока.Выбрано40ЖД = Выборка.Выбрано40ЖД;
		НоваяСтрока.Выбрано20Фрахт = Выборка.Выбрано20Фрахт;
		НоваяСтрока.Выбрано40Фрахт = Выборка.Выбрано40Фрахт;
		НоваяСтрока.ПортОтправления = Выборка.ПортОтправления;
		НоваяСтрока.ПортНазначения = Выборка.ПортНазначения;
		НоваяСтрока.ПортОтгрузки = Выборка.ПортОтгрузки;
		НоваяСтрока.ПунктОтправления = Выборка.ПунктОтправления;
		НоваяСтрока.ПунктНазначения = Выборка.ПунктНазначения;
		НоваяСтрока.УсловияПеревозкиОтправление = Выборка.УсловияПеревозкиОтправление;
		НоваяСтрока.УсловияПеревозкиПрибытие = Выборка.УсловияПеревозкиПрибытие;
		НоваяСтрока.УсловияПогрузки = Выборка.УсловияПогрузки;
		НоваяСтрока.УсловияВыгрузки = Выборка.УсловияВыгрузки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПараметры(Команда)
	
	Объект.Контрагенты.Очистить();
	Объект.ТипыКлиента.Очистить();
	Объект.ПунктыОтправленияЖД.Очистить();
	Объект.ПунктыНазначенияЖД.Очистить();
	Объект.ПортыОтправленияФрахт.Очистить();
	Объект.ПортыОтгрузкиФрахт.Очистить();
	Объект.ПортыНазначенияФрахт.Очистить();
	
	Объект.ПлановыйОбъемTEU = 0;
	Объект.УсловияПеревозкиОтправление = Неопределено;
	Объект.УсловияПеревозкиПрибытие = Неопределено;
	Объект.УсловияПогрузки = Неопределено;
	Объект.УсловияВыгрузки = Неопределено;
	Объект.СтавкаНДС = Неопределено;
	Объект.СуммаВключаетНДС = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ВставкаПараметровПеревозкиИзEXCEL(Команда)
	
	ПараметрыФормы = Новый Структура;
	ДополнительныеПараметры = Новый Структура;
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПриЗакрытииФормыЗагрузкиИзExcel", ЭтаФорма, ДополнительныеПараметры);
	
	ОткрытьФорму("Документ.РеестрСпециальныхСтавок.Форма.ФормаВставкиПараметровПеревозкиИзExcel", ПараметрыФормы, ЭтаФорма, , , , 
															ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставкаСтавокИзEXCEL(Команда)
	
	ПараметрыФормы = Новый Структура;
	ДополнительныеПараметры = Новый Структура;
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПриЗакрытииФормыЗагрузкиСтавокИзExcel", ЭтаФорма, ДополнительныеПараметры);
	
	ОткрытьФорму("Документ.РеестрСпециальныхСтавок.Форма.ФормаВставкиДанныхСтавокИзExcel", ПараметрыФормы, ЭтаФорма, , , , 
															ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыЗагрузкиИзExcel(РезультатМассивСтруктур, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатМассивСтруктур) = Тип("Массив") Тогда
		ЗаполнитьПараметрыПеревозки(РезультатМассивСтруктур);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыПеревозки(Данные)
	
	Для Каждого Структура Из Данные Цикл
		
		Если ЗначениеЗаполнено(Структура.ПлановыйОбъемTEU) Тогда
			Объект.ПлановыйОбъемTEU = Структура.ПлановыйОбъемTEU;
		КонецЕсли;
		Если ЗначениеЗаполнено(Структура.УсловияПеревозкиОтправление) Тогда
			Объект.УсловияПеревозкиОтправление = Структура.УсловияПеревозкиОтправление;
		КонецЕсли;
		Если ЗначениеЗаполнено(Структура.УсловияПеревозкиПрибытие) Тогда
			Объект.УсловияПеревозкиПрибытие = Структура.УсловияПеревозкиПрибытие;
		КонецЕсли;
		Если ЗначениеЗаполнено(Структура.УсловияПогрузки) Тогда
			Объект.УсловияПогрузки = Структура.УсловияПогрузки;
		КонецЕсли;
		Если ЗначениеЗаполнено(Структура.УсловияВыгрузки) Тогда
			Объект.УсловияВыгрузки = Структура.УсловияВыгрузки;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Структура.Контрагент) Тогда
			СтрокаТаблицы = Объект.Контрагенты.Добавить();
			СтрокаТаблицы.Контрагент = Структура.Контрагент;
		КонецЕсли;
		Если ЗначениеЗаполнено(Структура.ПунктОтправления) Тогда
			СтрокаТаблицы = Объект.ПунктыОтправленияЖД.Добавить();
			СтрокаТаблицы.ПунктОтправления = Структура.ПунктОтправления;
		КонецЕсли;
		Если ЗначениеЗаполнено(Структура.ПунктНазначения) Тогда
			СтрокаТаблицы = Объект.ПунктыНазначенияЖД.Добавить();
			СтрокаТаблицы.ПунктНазначения = Структура.ПунктНазначения;
		КонецЕсли;
		Если ЗначениеЗаполнено(Структура.ПортОтправленияФРАХТ) Тогда
			СтрокаТаблицы = Объект.ПортыОтправленияФрахт.Добавить();
			СтрокаТаблицы.ПортОтправления = Структура.ПортОтправленияФРАХТ;
		КонецЕсли;
		Если ЗначениеЗаполнено(Структура.ПортОтгрузкиФРАХТ) Тогда
			СтрокаТаблицы = Объект.ПортыОтгрузкиФрахт.Добавить();
			СтрокаТаблицы.ПортОтгрузки = Структура.ПортОтгрузкиФРАХТ;
		КонецЕсли;
		Если ЗначениеЗаполнено(Структура.ПортНазначенияФРАХТ) Тогда
			СтрокаТаблицы = Объект.ПортыНазначенияФрахт.Добавить();
			СтрокаТаблицы.ПортНазначения = Структура.ПортНазначенияФРАХТ;
		КонецЕсли;
		
	КонецЦикла;
	
	ВременнаяТаблица = Объект.Контрагенты.Выгрузить();
	ВременнаяТаблица.Свернуть("Контрагент");
	Объект.Контрагенты.Загрузить(ВременнаяТаблица);
	
	ВременнаяТаблица = Объект.ПунктыОтправленияЖД.Выгрузить();
	ВременнаяТаблица.Свернуть("ПунктОтправления");
	Объект.ПунктыОтправленияЖД.Загрузить(ВременнаяТаблица);
	
	ВременнаяТаблица = Объект.ПунктыНазначенияЖД.Выгрузить();
	ВременнаяТаблица.Свернуть("ПунктНазначения");
	Объект.ПунктыНазначенияЖД.Загрузить(ВременнаяТаблица);
	
	ВременнаяТаблица = Объект.ПортыОтправленияФрахт.Выгрузить();
	ВременнаяТаблица.Свернуть("ПортОтправления");
	Объект.ПортыОтправленияФрахт.Загрузить(ВременнаяТаблица);
	
	ВременнаяТаблица = Объект.ПортыОтгрузкиФрахт.Выгрузить();
	ВременнаяТаблица.Свернуть("ПортОтгрузки");
	Объект.ПортыОтгрузкиФрахт.Загрузить(ВременнаяТаблица);
	
	ВременнаяТаблица = Объект.ПортыНазначенияФрахт.Выгрузить();
	ВременнаяТаблица.Свернуть("ПортНазначения");
	Объект.ПортыНазначенияФрахт.Загрузить(ВременнаяТаблица);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыЗагрузкиСтавокИзExcel(РезультатМассивСтруктур, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатМассивСтруктур) = Тип("Массив") Тогда
		Для Каждого Структура Из РезультатМассивСтруктур Цикл
			СтрокаТаблицыСтавки = Ставки.Добавить();
			Если Структура.РазмерностьКТК = ПредопределенноеЗначение("Справочник.РазмерыКТК.К20") Тогда
				СтрокаТаблицыСтавки.Ставка20ЖД = Структура.СтавкаЖД;
				СтрокаТаблицыСтавки.Ставка20Фрахт = Структура.СтавкаФрахт;
				ЗаполнитьЗначенияСвойств(СтрокаТаблицыСтавки, Структура);
			Иначе
				СтрокаТаблицыСтавки.Ставка40ЖД = Структура.СтавкаЖД;
				СтрокаТаблицыСтавки.Ставка40Фрахт = Структура.СтавкаФрахт;
				ЗаполнитьЗначенияСвойств(СтрокаТаблицыСтавки, Структура);
			КонецЕсли;
		КонецЦикла;
		ВвестиСтавкиНаСервере();
		СформироватьТаблицуФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЗаполненностьСтавокНадбавокСкидок()
	
	Ответ = Ложь;
	
	ТекстСообщенияВалюта = НСтр("ru = 'Не заполнена валюта.'");
	ТекстСообщенияПринадлежность = НСтр("ru = 'Не заполнена принадлежность.'");
	
	Для Каждого СтрокаСтавок Из Ставки Цикл
		Если Не ЗначениеЗаполнено(СтрокаСтавок.SOCCOC) Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияПринадлежность, , "Ставки[" + Строка(Ставки.Индекс(СтрокаСтавок)) + "].SOCCOC", , Ответ);
		КонецЕсли;
		Если (ЗначениеЗаполнено(СтрокаСтавок.Ставка20ЖД) Или ЗначениеЗаполнено(СтрокаСтавок.Ставка40ЖД)) 
			И Не ЗначениеЗаполнено(СтрокаСтавок.ВалютаЖД) Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияВалюта, , "Ставки[" + Строка(Ставки.Индекс(СтрокаСтавок)) + "].ВалютаЖД", , Ответ);
		КонецЕсли;
		Если (ЗначениеЗаполнено(СтрокаСтавок.Ставка20Фрахт) Или ЗначениеЗаполнено(СтрокаСтавок.Ставка40Фрахт)) 
			И Не ЗначениеЗаполнено(СтрокаСтавок.ВалютаФрахт) Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияВалюта, , "Ставки[" + Строка(Ставки.Индекс(СтрокаСтавок)) + "].ВалютаФрахт", , Ответ);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаСтавок.ВалютаЖД)
			И (Не ЗначениеЗаполнено(СтрокаСтавок.Ставка20ЖД) И Не ЗначениеЗаполнено(СтрокаСтавок.Ставка40ЖД)) Тогда
			ТекстСообщения = НСтр("ru = 'Заполните как минимум одну из ставок ЖД.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Ставки[" + Ставки.Индекс(СтрокаСтавок) + "].Ставка20ЖД", , Ответ);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Ставки[" + Ставки.Индекс(СтрокаСтавок) + "].Ставка40ЖД", , Ответ);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаСтавок.ВалютаФрахт)
			И (Не ЗначениеЗаполнено(СтрокаСтавок.Ставка20Фрахт) И Не ЗначениеЗаполнено(СтрокаСтавок.Ставка40Фрахт)) Тогда
			ТекстСообщения = НСтр("ru = 'Заполните как минимум одну из ставок фрахт.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Ставки[" + Ставки.Индекс(СтрокаСтавок) + "].Ставка20Фрахт", , Ответ);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Ставки[" + Ставки.Индекс(СтрокаСтавок) + "].Ставка40Фрахт", , Ответ);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаНадбавокСкидок Из НадбавкиСкидки Цикл
		Если Не ЗначениеЗаполнено(СтрокаНадбавокСкидок.SOCCOC) Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияПринадлежность, , "НадбавкиСкидки[" + Строка(НадбавкиСкидки.Индекс(СтрокаНадбавокСкидок)) + "].SOCCOC", , Ответ);
		КонецЕсли;
		Если (ЗначениеЗаполнено(СтрокаНадбавокСкидок.Ставка20ЖД) Или ЗначениеЗаполнено(СтрокаНадбавокСкидок.Ставка40ЖД)) 
			И Не ЗначениеЗаполнено(СтрокаНадбавокСкидок.ВалютаЖД) Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияВалюта, , "НадбавкиСкидки[" + Строка(НадбавкиСкидки.Индекс(СтрокаНадбавокСкидок)) + "].ВалютаЖД", , Ответ);
		КонецЕсли;
		Если (ЗначениеЗаполнено(СтрокаНадбавокСкидок.Ставка20Фрахт) Или ЗначениеЗаполнено(СтрокаНадбавокСкидок.Ставка40Фрахт)) 
			И Не ЗначениеЗаполнено(СтрокаНадбавокСкидок.ВалютаФрахт) Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияВалюта, , "НадбавкиСкидки[" + Строка(НадбавкиСкидки.Индекс(СтрокаНадбавокСкидок)) + "].ВалютаФрахт", , Ответ);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаНадбавокСкидок.ВалютаЖД)
			И (Не ЗначениеЗаполнено(СтрокаНадбавокСкидок.Ставка20ЖД) И Не ЗначениеЗаполнено(СтрокаНадбавокСкидок.Ставка40ЖД)) Тогда
			ТекстСообщения = НСтр("ru = 'Заполните как минимум одну из ставок ЖД.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "НадбавкиСкидки[" + НадбавкиСкидки.Индекс(СтрокаНадбавокСкидок) + "].Ставка20ЖД", , Ответ);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "НадбавкиСкидки[" + НадбавкиСкидки.Индекс(СтрокаНадбавокСкидок) + "].Ставка40ЖД", , Ответ);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаНадбавокСкидок.ВалютаФрахт)
			И (Не ЗначениеЗаполнено(СтрокаНадбавокСкидок.Ставка20Фрахт) И Не ЗначениеЗаполнено(СтрокаНадбавокСкидок.Ставка40Фрахт)) Тогда
			ТекстСообщения = НСтр("ru = 'Заполните как минимум одну из ставок фрахт.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "НадбавкиСкидки[" + НадбавкиСкидки.Индекс(СтрокаНадбавокСкидок) + "].Ставка20Фрахт", , Ответ);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "НадбавкиСкидки[" + НадбавкиСкидки.Индекс(СтрокаНадбавокСкидок) + "].Ставка40Фрахт", , Ответ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ответ;
	
КонецФункции

&НаСервере
Процедура СформироватьТаблицуФормы()
	
	СпециальныеСтавкиФорма.Очистить();
	
	ВыгрузкаСтавок = Объект.СпециальныеСтавки.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеестрСпециальныхСтавокСпециальныеСтавки.Контрагент КАК Контрагент,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.ПлановыйОбъемTEU КАК ПлановыйОбъемTEU,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.ТипСтавки КАК ТипСтавки,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.ПунктОтправления КАК ПунктОтправления,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.ПунктНазначения КАК ПунктНазначения,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.УсловияПеревозкиОтправление КАК УсловияПеревозкиОтправление,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.УсловияПеревозкиПрибытие КАК УсловияПеревозкиПрибытие,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.ПортОтправления КАК ПортОтправления,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.ПортОтгрузки КАК ПортОтгрузки,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.ПортНазначения КАК ПортНазначения,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.УсловияПогрузки КАК УсловияПогрузки,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.УсловияВыгрузки КАК УсловияВыгрузки,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.СтавкаНДС КАК СтавкаНДС,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(36)) КАК ВременныйИдентификаторСтроки
	|ПОМЕСТИТЬ ВТ_ВыгрузкаСтавокСИдентификатором
	|ИЗ
	|	&ТаблицаСтавок КАК РеестрСпециальныхСтавокСпециальныеСтавки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыгрузкаСтавокСИдентификатором.Контрагент КАК Контрагент,
	|	ВТ_ВыгрузкаСтавокСИдентификатором.ПлановыйОбъемTEU КАК ПлановыйОбъемTEU,
	|	ВТ_ВыгрузкаСтавокСИдентификатором.ТипСтавки КАК ТипСтавки,
	|	ВТ_ВыгрузкаСтавокСИдентификатором.ПунктОтправления КАК ПунктОтправления,
	|	ВТ_ВыгрузкаСтавокСИдентификатором.ПунктНазначения КАК ПунктНазначения,
	|	ВТ_ВыгрузкаСтавокСИдентификатором.УсловияПеревозкиОтправление КАК УсловияПеревозкиОтправление,
	|	ВТ_ВыгрузкаСтавокСИдентификатором.УсловияПеревозкиПрибытие КАК УсловияПеревозкиПрибытие,
	|	ВТ_ВыгрузкаСтавокСИдентификатором.ПортОтправления КАК ПортОтправления,
	|	ВТ_ВыгрузкаСтавокСИдентификатором.ПортОтгрузки КАК ПортОтгрузки,
	|	ВТ_ВыгрузкаСтавокСИдентификатором.ПортНазначения КАК ПортНазначения,
	|	ВТ_ВыгрузкаСтавокСИдентификатором.УсловияПогрузки КАК УсловияПогрузки,
	|	ВТ_ВыгрузкаСтавокСИдентификатором.УсловияВыгрузки КАК УсловияВыгрузки,
	|	ВТ_ВыгрузкаСтавокСИдентификатором.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_ВыгрузкаСтавокСИдентификатором.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВТ_ВыгрузкаСтавокСИдентификатором.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ВТ_ВыгрузкаСтавокСИдентификатором.ВременныйИдентификаторСтроки КАК ВременныйИдентификаторСтроки
	|ИЗ
	|	ВТ_ВыгрузкаСтавокСИдентификатором КАК ВТ_ВыгрузкаСтавокСИдентификатором";
	
	Запрос.УстановитьПараметр("ТаблицаСтавок", ВыгрузкаСтавок);
	
	ВыгрузкаСтавокСИдентификатором = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаВыгрузки Из ВыгрузкаСтавокСИдентификатором Цикл
		СтрокаВыгрузки.ВременныйИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаСтавокСИдентификатором.Контрагент КАК Контрагент,
	|	ТаблицаСтавокСИдентификатором.ПлановыйОбъемTEU КАК ПлановыйОбъемTEU,
	|	ТаблицаСтавокСИдентификатором.ТипСтавки КАК ТипСтавки,
	|	ТаблицаСтавокСИдентификатором.ПунктОтправления КАК ПунктОтправления,
	|	ТаблицаСтавокСИдентификатором.ПунктНазначения КАК ПунктНазначения,
	|	ТаблицаСтавокСИдентификатором.УсловияПеревозкиОтправление КАК УсловияПеревозкиОтправление,
	|	ТаблицаСтавокСИдентификатором.УсловияПеревозкиПрибытие КАК УсловияПеревозкиПрибытие,
	|	ТаблицаСтавокСИдентификатором.ПортОтправления КАК ПортОтправления,
	|	ТаблицаСтавокСИдентификатором.ПортОтгрузки КАК ПортОтгрузки,
	|	ТаблицаСтавокСИдентификатором.ПортНазначения КАК ПортНазначения,
	|	ТаблицаСтавокСИдентификатором.УсловияПогрузки КАК УсловияПогрузки,
	|	ТаблицаСтавокСИдентификатором.УсловияВыгрузки КАК УсловияВыгрузки,
	|	ТаблицаСтавокСИдентификатором.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаСтавокСИдентификатором.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ТаблицаСтавокСИдентификатором.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаСтавокСИдентификатором.ВременныйИдентификаторСтроки КАК ВременныйИдентификаторСтроки
	|ПОМЕСТИТЬ ВТ_СИдентификатором
	|ИЗ
	|	&ТаблицаСтавокСИдентификатором КАК ТаблицаСтавокСИдентификатором
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСтавокБезИдентификатором.Контрагент КАК Контрагент,
	|	ТаблицаСтавокБезИдентификатором.ПлановыйОбъемTEU КАК ПлановыйОбъемTEU,
	|	ТаблицаСтавокБезИдентификатором.ТипСтавки КАК ТипСтавки,
	|	ТаблицаСтавокБезИдентификатором.ПунктОтправления КАК ПунктОтправления,
	|	ТаблицаСтавокБезИдентификатором.ПунктНазначения КАК ПунктНазначения,
	|	ТаблицаСтавокБезИдентификатором.УсловияПеревозкиОтправление КАК УсловияПеревозкиОтправление,
	|	ТаблицаСтавокБезИдентификатором.УсловияПеревозкиПрибытие КАК УсловияПеревозкиПрибытие,
	|	ТаблицаСтавокБезИдентификатором.ПортОтправления КАК ПортОтправления,
	|	ТаблицаСтавокБезИдентификатором.ПортОтгрузки КАК ПортОтгрузки,
	|	ТаблицаСтавокБезИдентификатором.ПортНазначения КАК ПортНазначения,
	|	ТаблицаСтавокБезИдентификатором.УсловияПогрузки КАК УсловияПогрузки,
	|	ТаблицаСтавокБезИдентификатором.УсловияВыгрузки КАК УсловияВыгрузки,
	|	ТаблицаСтавокБезИдентификатором.ПараметрПеревозки КАК ПараметрПеревозки,
	|	ТаблицаСтавокБезИдентификатором.Ставка КАК Ставка,
	|	ТаблицаСтавокБезИдентификатором.НадбавкаСкидка КАК НадбавкаСкидка,
	|	ТаблицаСтавокБезИдентификатором.ЭтоПроцентОтСуммы КАК ЭтоПроцентОтСуммы,
	|	ТаблицаСтавокБезИдентификатором.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаСтавокБезИдентификатором.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ТаблицаСтавокБезИдентификатором.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаСтавокБезИдентификатором.ИтерацияДобавления КАК ИтерацияДобавления
	|ПОМЕСТИТЬ ВТ_БезИдентификатора
	|ИЗ
	|	&ТаблицаСтавок КАК ТаблицаСтавокБезИдентификатором
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СИдентификатором.Контрагент КАК Контрагент,
	|	ВТ_СИдентификатором.ПлановыйОбъемTEU КАК ПлановыйОбъемTEU,
	|	ВТ_СИдентификатором.ТипСтавки КАК ТипСтавки,
	|	ВТ_СИдентификатором.ПунктОтправления КАК ПунктОтправления,
	|	ВТ_СИдентификатором.ПунктНазначения КАК ПунктНазначения,
	|	ВТ_СИдентификатором.УсловияПеревозкиОтправление КАК УсловияПеревозкиОтправление,
	|	ВТ_СИдентификатором.УсловияПеревозкиПрибытие КАК УсловияПеревозкиПрибытие,
	|	ВТ_СИдентификатором.ПортОтправления КАК ПортОтправления,
	|	ВТ_СИдентификатором.ПортОтгрузки КАК ПортОтгрузки,
	|	ВТ_СИдентификатором.ПортНазначения КАК ПортНазначения,
	|	ВТ_СИдентификатором.УсловияПогрузки КАК УсловияПогрузки,
	|	ВТ_СИдентификатором.УсловияВыгрузки КАК УсловияВыгрузки,
	|	ВТ_СИдентификатором.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_СИдентификатором.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВТ_СИдентификатором.ВременныйИдентификаторСтроки КАК ВременныйИдентификаторСтроки,
	|	ВТ_БезИдентификатора.ПараметрПеревозки КАК ПараметрПеревозки,
	|	ВТ_БезИдентификатора.Ставка КАК Ставка,
	|	ВТ_БезИдентификатора.НадбавкаСкидка КАК НадбавкаСкидка,
	|	ВТ_БезИдентификатора.ЭтоПроцентОтСуммы КАК ЭтоПроцентОтСуммы,
	|	ВТ_БезИдентификатора.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ВТ_БезИдентификатора.ИтерацияДобавления КАК ИтерацияДобавления
	|ПОМЕСТИТЬ ВТ_ВременнаяТаблица
	|ИЗ
	|	ВТ_БезИдентификатора КАК ВТ_БезИдентификатора
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СИдентификатором КАК ВТ_СИдентификатором
	|		ПО ВТ_БезИдентификатора.Контрагент = ВТ_СИдентификатором.Контрагент
	|			И ВТ_БезИдентификатора.ПлановыйОбъемTEU = ВТ_СИдентификатором.ПлановыйОбъемTEU
	|			И ВТ_БезИдентификатора.ТипСтавки = ВТ_СИдентификатором.ТипСтавки
	|			И ВТ_БезИдентификатора.ПунктОтправления = ВТ_СИдентификатором.ПунктОтправления
	|			И ВТ_БезИдентификатора.ПунктНазначения = ВТ_СИдентификатором.ПунктНазначения
	|			И ВТ_БезИдентификатора.УсловияПеревозкиОтправление = ВТ_СИдентификатором.УсловияПеревозкиОтправление
	|			И ВТ_БезИдентификатора.УсловияПеревозкиПрибытие = ВТ_СИдентификатором.УсловияПеревозкиПрибытие
	|			И ВТ_БезИдентификатора.ПортОтправления = ВТ_СИдентификатором.ПортОтправления
	|			И ВТ_БезИдентификатора.ПортОтгрузки = ВТ_СИдентификатором.ПортОтгрузки
	|			И ВТ_БезИдентификатора.ПортНазначения = ВТ_СИдентификатором.ПортНазначения
	|			И ВТ_БезИдентификатора.УсловияПогрузки = ВТ_СИдентификатором.УсловияПогрузки
	|			И ВТ_БезИдентификатора.УсловияВыгрузки = ВТ_СИдентификатором.УсловияВыгрузки
	|			И ВТ_БезИдентификатора.СтавкаНДС = ВТ_СИдентификатором.СтавкаНДС
	|			И ВТ_БезИдентификатора.СуммаВключаетНДС = ВТ_СИдентификатором.СуммаВключаетНДС
	|			И ВТ_БезИдентификатора.ИдентификаторСтроки = ВТ_СИдентификатором.ИдентификаторСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВременнаяТаблица.Контрагент КАК Контрагент,
	|	ВТ_ВременнаяТаблица.ПлановыйОбъемTEU КАК ПлановыйОбъемTEU,
	|	ВТ_ВременнаяТаблица.ТипСтавки КАК ТипСтавки,
	|	ВТ_ВременнаяТаблица.ПунктОтправления КАК ПунктОтправления,
	|	ВТ_ВременнаяТаблица.ПунктНазначения КАК ПунктНазначения,
	|	ВТ_ВременнаяТаблица.УсловияПеревозкиОтправление КАК УсловияПеревозкиОтправление,
	|	ВТ_ВременнаяТаблица.УсловияПеревозкиПрибытие КАК УсловияПеревозкиПрибытие,
	|	ВТ_ВременнаяТаблица.ПортОтправления КАК ПортОтправления,
	|	ВТ_ВременнаяТаблица.ПортОтгрузки КАК ПортОтгрузки,
	|	ВТ_ВременнаяТаблица.ПортНазначения КАК ПортНазначения,
	|	ВТ_ВременнаяТаблица.УсловияПогрузки КАК УсловияПогрузки,
	|	ВТ_ВременнаяТаблица.УсловияВыгрузки КАК УсловияВыгрузки,
	|	ВТ_ВременнаяТаблица.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_ВременнаяТаблица.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВТ_ВременнаяТаблица.ВременныйИдентификаторСтроки КАК ВременныйИдентификаторСтроки,
	|	ВТ_ВременнаяТаблица.ПараметрПеревозки КАК ПараметрПеревозки,
	|	ВТ_ВременнаяТаблица.Ставка КАК Ставка,
	|	ВТ_ВременнаяТаблица.НадбавкаСкидка КАК НадбавкаСкидка,
	|	ВТ_ВременнаяТаблица.ЭтоПроцентОтСуммы КАК ЭтоПроцентОтСуммы,
	|	ВТ_ВременнаяТаблица.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ВТ_ВременнаяТаблица.ИтерацияДобавления КАК ИтерацияДобавления
	|ИЗ
	|	ВТ_ВременнаяТаблица КАК ВТ_ВременнаяТаблица
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВременныйИдентификаторСтроки,
	|	Контрагент,
	|	ПунктОтправления,
	|	ПунктНазначения,
	|	ПортОтправления,
	|	ПортОтгрузки,
	|	ПортНазначения
	|ИТОГИ ПО
	|	Контрагент,
	|	ПлановыйОбъемTEU,
	|	ТипСтавки";
	
	Запрос.УстановитьПараметр("ТаблицаСтавокСИдентификатором", ВыгрузкаСтавокСИдентификатором);
	Запрос.УстановитьПараметр("ТаблицаСтавок", ВыгрузкаСтавок);
	
	ВыборкаКонтрагент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Счетчик = 1;
	
	Пока ВыборкаКонтрагент.Следующий() Цикл
		ВыборкаПлановыйОбъемTEU = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПлановыйОбъемTEU.Следующий() Цикл
			ВыборкаТипСтавки = ВыборкаПлановыйОбъемTEU.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаТипСтавки.Следующий() Цикл
				ВыборкаДетальныеЗаписи = ВыборкаТипСтавки.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Если ВыборкаДетальныеЗаписи.ПараметрПеревозки.ВидТранспортногоСообщения = Перечисления.ВидыТранспортныхСообщений.ЖД Тогда
						ВидТранспортногоСообщения = "ЖД";
					Иначе
						ВидТранспортногоСообщения = "Фрахт";
					КонецЕсли;
					Строка = ПодобратьПодходящуюСтрокуВТаблицеФормы(ВыборкаДетальныеЗаписи, ВыборкаДетальныеЗаписи.ПараметрПеревозки, ВидТранспортногоСообщения, Истина);
					Если Строка <> Неопределено Тогда
						ЗаполнитьСтрокуРезультата(Строка, ВыборкаДетальныеЗаписи, ВидТранспортногоСообщения);
					Иначе
						НоваяСтрока = СпециальныеСтавкиФорма.Добавить();
						НоваяСтрока.НомерСтроки = Счетчик;
						НоваяСтрока.ИтерацияДобавления = ВыборкаДетальныеЗаписи.ИтерацияДобавления;
						ЗаполнитьСтрокуРезультата(НоваяСтрока, ВыборкаДетальныеЗаписи, ВидТранспортногоСообщения);
						Счетчик = Счетчик + 1;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	СинхронизироватьКалькуляцииНаФорме();
	
КонецПроцедуры

&НаСервере
Функция ПодобратьПодходящуюСтрокуВТаблицеФормы(Запись, ПараметрПеревозки, ВидТранспортногоСообщения, ПоискВТаблицеФормы = Ложь)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Контрагент", Запись.Контрагент);
	СтруктураОтбора.Вставить("ПлановыйОбъемTEU", Запись.ПлановыйОбъемTEU);
	СтруктураОтбора.Вставить("ТипСтавки", Запись.ТипСтавки);
	СтруктураОтбора.Вставить("ПунктОтправления", Запись.ПунктОтправления);
	СтруктураОтбора.Вставить("ПунктНазначения", Запись.ПунктНазначения);
	СтруктураОтбора.Вставить("ПортОтправления", Запись.ПортОтправления);
	СтруктураОтбора.Вставить("ПортНазначения", Запись.ПортНазначения);
	СтруктураОтбора.Вставить("ПортОтгрузки", Запись.ПортОтгрузки);
	
	Если ПоискВТаблицеФормы Тогда
		СтруктураОтбора.Вставить("ИтерацияДобавления", Запись.ИтерацияДобавления);	
		НайденнаяСтрока = СпециальныеСтавкиФорма.НайтиСтроки(СтруктураОтбора);
	Иначе
		СтруктураОтбора.Вставить("ПараметрПеревозки", ПараметрПеревозки);
		НайденнаяСтрока = Объект.СпециальныеСтавки.НайтиСтроки(СтруктураОтбора);
	КонецЕсли;
	
	Возврат ?(НайденнаяСтрока.Количество() > 0, НайденнаяСтрока[0], Неопределено);
	
КонецФункции

&НаСервере
Функция НайтиПоследнююИтерацию()
	
	ПоследняяИтерация = 0;
	
	Для Каждого Строка Из Объект.СпециальныеСтавки Цикл
		Если Строка.ИтерацияДобавления > ПоследняяИтерация Тогда
			ПоследняяИтерация = Строка.ИтерацияДобавления;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПоследняяИтерация;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСтрокуРезультата(СтрокаСпециальныеСтавкиФорма, Запись, ВидыТранспортныхСообщений)
	
	СтрокаСпециальныеСтавкиФорма.ИтерацияДобавления = Запись.ИтерацияДобавления;
	СтрокаСпециальныеСтавкиФорма.Контрагент = Запись.Контрагент;
	СтрокаСпециальныеСтавкиФорма.ТипСтавки = Запись.ТипСтавки;
	СтрокаСпециальныеСтавкиФорма.ПлановыйОбъемTEU = Запись.ПлановыйОбъемTEU;
	СтрокаСпециальныеСтавкиФорма.ЭтоПроцентОтСуммы = Запись.ЭтоПроцентОтСуммы;
		
	СтрокаСпециальныеСтавкиФорма.ПунктОтправления = Запись.ПунктОтправления;
	СтрокаСпециальныеСтавкиФорма.ПунктНазначения = Запись.ПунктНазначения;
	СтрокаСпециальныеСтавкиФорма.ПортОтправления = Запись.ПортОтправления;
	СтрокаСпециальныеСтавкиФорма.ПортНазначения = Запись.ПортНазначения;
	СтрокаСпециальныеСтавкиФорма.ПортОтгрузки = Запись.ПортОтгрузки;
	СтрокаСпециальныеСтавкиФорма.УсловияПогрузки = Запись.УсловияПогрузки;
	СтрокаСпециальныеСтавкиФорма.УсловияВыгрузки = Запись.УсловияВыгрузки;
	СтрокаСпециальныеСтавкиФорма.УсловияПеревозкиОтправление = Запись.УсловияПеревозкиОтправление;
	СтрокаСпециальныеСтавкиФорма.УсловияПеревозкиПрибытие = Запись.УсловияПеревозкиПрибытие;
	СтрокаСпециальныеСтавкиФорма.ИдентификаторыСтрок.Добавить(Запись.ИдентификаторСтроки);
	
	СтрокаПоиска = Запись.ПараметрПеревозки.РазмерКТК.Наименование 
		+ ВидыТранспортныхСообщений
		+ ?(Запись.ПараметрПеревозки.ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТЕвросиба, "COC", "SOC");
	
	Если СтрокаСпециальныеСтавкиФорма.ТипСтавки = Перечисления.ТипыСтавок.СпециальнаяСтавка Тогда
		СтрокаСпециальныеСтавкиФорма["Ставка" + СтрокаПоиска] = Запись.Ставка;
		СтрокаСпециальныеСтавкиФорма["СтавкаНДС" + СтрокаПоиска] = Запись.СтавкаНДС;
		СтрокаСпециальныеСтавкиФорма["СуммаВключаетНДС" + СтрокаПоиска] = Запись.СуммаВключаетНДС;
	ИначеЕсли СтрокаСпециальныеСтавкиФорма.ТипСтавки = Перечисления.ТипыСтавок.Скидка 
			Или СтрокаСпециальныеСтавкиФорма.ТипСтавки = Перечисления.ТипыСтавок.Надбавка Тогда
		СтрокаСпециальныеСтавкиФорма["НадбавкаСкидка" + СтрокаПоиска] = Запись.НадбавкаСкидка;
	КонецЕсли;
	
	Если СтрокаСпециальныеСтавкиФорма.ТипСтавки = Перечисления.ТипыСтавок.СпециальнаяСтавка Тогда
		СтрокаСпециальныеСтавкиФорма["Валюта" + ВидыТранспортныхСообщений] = Запись.ПараметрПеревозки.Валюта;
	ИначеЕсли СтрокаСпециальныеСтавкиФорма.ТипСтавки = Перечисления.ТипыСтавок.Скидка 
			Или СтрокаСпециальныеСтавкиФорма.ТипСтавки = Перечисления.ТипыСтавок.Надбавка Тогда
		СтрокаСпециальныеСтавкиФорма["ВалютаНадбавкаСкидка" + ВидыТранспортныхСообщений] = Запись.ПараметрПеревозки.Валюта;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СинхронизироватьКалькуляцииНаФорме()
	
	Для Каждого СтрокаТЧ Из СпециальныеСтавкиФорма Цикл
		СтрокаТЧ.Калькуляции20ЖДSOC.Очистить();
		СтрокаТЧ.Калькуляции20ЖДCOC.Очистить();
		СтрокаТЧ.Калькуляции40ЖДSOC.Очистить();
		СтрокаТЧ.Калькуляции40ЖДCOC.Очистить();
		СтрокаТЧ.Калькуляции20ФрахтSOC.Очистить();
		СтрокаТЧ.Калькуляции20ФрахтCOC.Очистить();
		СтрокаТЧ.Калькуляции40ФрахтSOC.Очистить();
		СтрокаТЧ.Калькуляции40ФрахтCOC.Очистить();
		
		Для Каждого Идентификатор Из СтрокаТЧ.ИдентификаторыСтрок Цикл
			Найденные = Объект.Калькуляции.НайтиСтроки(Новый Структура("ИдентификаторСтрокиСпецСтавок", Идентификатор.Значение));
			Для Каждого СтрК Из Найденные Цикл
				Если СтрК.Удалена Или Не ЗначениеЗаполнено(СтрК.ПараметрПеревозки) Тогда
					Продолжить;
				КонецЕсли;
				
				РазмерКТК = ?(СтрК.ПараметрПеревозки.РазмерКТК = Справочники.РазмерыКТК.К20, "20", "40");
				ВидТранспорта = ?(СтрК.ПараметрПеревозки.ВидТранспортногоСообщения = Перечисления.ВидыТранспортныхСообщений.ЖД, "ЖД", "Фрахт");
				Принадлежность = ?(СтрК.ПараметрПеревозки.ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТКлиента, "SOC", "COC");
				
				ИмяСписка = "Калькуляции" + РазмерКТК + ВидТранспорта + Принадлежность;
				
				Если СтрокаТЧ[ИмяСписка].НайтиПоЗначению(СтрК.Калькуляция) = Неопределено Тогда
					СтрокаТЧ[ИмяСписка].Добавить(СтрК.Калькуляция);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ЗаполнитьКалькуляцииСтрокой();
	
КонецПроцедуры

&НаСервере
Процедура АктуализироватьКалькуляции(ЦелевойОбъект = Неопределено)
	
	ТекущийОбъект = ?(ЦелевойОбъект <> Неопределено, ЦелевойОбъект, Объект);
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Применяется) И ТипЗнч(ТекущийОбъект.Применяется) = Тип("ДокументСсылка.ПСЦ") Тогда
		ЗаполнитьКалькуляцииНотиса();
	Иначе
		КалькуляцииНотиса.Очистить();
	КонецЕсли;
	
	ТаблицаВалидных = Новый ТаблицаЗначений;
	ТаблицаВалидных.Колонки.Добавить("ИдентификаторСтрокиСпецСтавок");
	ТаблицаВалидных.Колонки.Добавить("ПараметрПеревозки");
	ТаблицаВалидных.Колонки.Добавить("Калькуляция");
	
	Для Каждого Запись Из ТекущийОбъект.СпециальныеСтавки Цикл
		
		ЕстьЖД = ЗначениеЗаполнено(Запись.ПунктОтправления) Или ЗначениеЗаполнено(Запись.ПунктНазначения);
		ЕстьФрахт = ЗначениеЗаполнено(Запись.ПортОтправления) Или ЗначениеЗаполнено(Запись.ПортНазначения) Или ЗначениеЗаполнено(Запись.ПортОтгрузки);
		
		Размер20 = (Запись.ПараметрПеревозки.РазмерКТК = Справочники.РазмерыКТК.К20);
		ЭтоSOC   = (Запись.ПараметрПеревозки.ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТКлиента);
		
		СтруктураОтбора = Новый Структура;
		
		Если Размер20 Тогда
			СтруктураОтбора.Вставить("Размер20", Истина);
		Иначе
			СтруктураОтбора.Вставить("Размер40", Истина);
		КонецЕсли;
		
		СтруктураОтбора.Вставить("ПунктОтправления", Запись.ПунктОтправления);
		СтруктураОтбора.Вставить("ПунктНазначения", Запись.ПунктНазначения);
		СтруктураОтбора.Вставить("ПортНазначения", Запись.ПортНазначения);
		СтруктураОтбора.Вставить("ПортОтгрузки", Запись.ПортОтгрузки);
		СтруктураОтбора.Вставить("ПортОтправления", Запись.ПортОтправления);
		
		Если ЕстьЖД Тогда
			СтруктураОтбора.Вставить("УсловияПеревозкиОтправление", Запись.УсловияПеревозкиОтправление);
			СтруктураОтбора.Вставить("УсловияПеревозкиПрибытие", Запись.УсловияПеревозкиПрибытие);
			
			Если Размер20 Тогда
				СтруктураОтбора.Вставить("Выбрано20ЖД", Истина);
			Иначе
				СтруктураОтбора.Вставить("Выбрано40ЖД", Истина);
			КонецЕсли;
			
			Если ЭтоSOC Тогда
				СтруктураОтбора.Вставить("SOCЖД", Истина);
			Иначе
				СтруктураОтбора.Вставить("COCЖД", Истина);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЕстьФрахт Тогда
			СтруктураОтбора.Вставить("УсловияПогрузки", Запись.УсловияПогрузки);
			СтруктураОтбора.Вставить("УсловияВыгрузки", Запись.УсловияВыгрузки);
			
			Если Размер20 Тогда
				СтруктураОтбора.Вставить("Выбрано20Фрахт", Истина);
			Иначе
				СтруктураОтбора.Вставить("Выбрано40Фрахт", Истина);
			КонецЕсли;
			
			Если ЭтоSOC Тогда
				СтруктураОтбора.Вставить("SOCФрахт", Истина);
			Иначе
				СтруктураОтбора.Вставить("COCФрахт", Истина);
			КонецЕсли;
	
		КонецЕсли;
		
		НайденныеКалькуляцииНотиса = КалькуляцииНотиса.НайтиСтроки(СтруктураОтбора);
		Для Каждого СтрокаКалькуляции Из НайденныеКалькуляцииНотиса Цикл
			НоваяСтрокаВалидных = ТаблицаВалидных.Добавить();
			НоваяСтрокаВалидных.ИдентификаторСтрокиСпецСтавок = Запись.ИдентификаторСтроки;
			НоваяСтрокаВалидных.ПараметрПеревозки = Запись.ПараметрПеревозки;
			НоваяСтрокаВалидных.Калькуляция = СтрокаКалькуляции.Калькуляция;
		КонецЦикла;
		
	КонецЦикла;
	
	Индекс = ТекущийОбъект.Калькуляции.Количество() - 1;
	Пока Индекс >= 0 Цикл
		СтрокаКалькуляции = ТекущийОбъект.Калькуляции[Индекс];
		Отбор = Новый Структура("ИдентификаторСтрокиСпецСтавок, ПараметрПеревозки, Калькуляция");
		Отбор.ИдентификаторСтрокиСпецСтавок = СтрокаКалькуляции.ИдентификаторСтрокиСпецСтавок;
		Отбор.ПараметрПеревозки = СтрокаКалькуляции.ПараметрПеревозки;
		Отбор.Калькуляция = СтрокаКалькуляции.Калькуляция;
		
		Если ТаблицаВалидных.НайтиСтроки(Отбор).Количество() = 0 Тогда
			ТекущийОбъект.Калькуляции.Удалить(Индекс);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	
	Для Каждого СтрокаВалидных Из ТаблицаВалидных Цикл
		Отбор = Новый Структура("ИдентификаторСтрокиСпецСтавок, ПараметрПеревозки, Калькуляция");
		Отбор.ИдентификаторСтрокиСпецСтавок = СтрокаВалидных.ИдентификаторСтрокиСпецСтавок;
		Отбор.ПараметрПеревозки = СтрокаВалидных.ПараметрПеревозки;
		Отбор.Калькуляция = СтрокаВалидных.Калькуляция;
		
		Если ТекущийОбъект.Калькуляции.НайтиСтроки(Отбор).Количество() = 0 Тогда
			НоваяКалькуляция = ТекущийОбъект.Калькуляции.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяКалькуляция, СтрокаВалидных);
			НоваяКалькуляция.Удалена = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьКалькуляцииСтрокой();
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиНадбавкиСкидки(Команда)
	УдалитьПустыеСтрокиВПараметрахПеревозки();
	ВвестиНадбавкиСкидкиНаСервере();
	СвернутьТаблицуСпецСтавок();
	СформироватьТаблицуФормы();
	УпорядочитьСписокСпецСтавок();
КонецПроцедуры

&НаСервере
Функция СтруктураПараметровПеревозкиКЗаполнению()
	
	ЕстьКонтрагенты = Объект.Контрагенты.Количество() > 0;
	ЕстьОтправлениеЖД = Объект.ПунктыОтправленияЖД.Количество() > 0;
	ЕстьНазначениеЖД = Объект.ПунктыНазначенияЖД.Количество() > 0;
	ЕстьОтправление = Объект.ПортыОтправленияФрахт.Количество() > 0;
	ЕстьОтгрузка = Объект.ПортыОтгрузкиФрахт.Количество() > 0;
	ЕстьНазначение = Объект.ПортыНазначенияФрахт.Количество() > 0;
	
	МассивКонтрагентов = Новый Массив;
	Если ЕстьКонтрагенты Тогда
		Для Каждого СтрокаКонтрагенты Из Объект.Контрагенты Цикл
			МассивКонтрагентов.Добавить(СтрокаКонтрагенты.Контрагент);
		КонецЦикла;
	Иначе
		МассивКонтрагентов.Добавить(Справочники.Контрагенты.ПустаяСсылка());
	КонецЕсли;
	
	МассивОтправленийЖД = Новый Массив;
	Если ЕстьОтправлениеЖД Тогда
		Для Каждого СтрокаОтправленияЖД Из Объект.ПунктыОтправленияЖД Цикл
			МассивОтправленийЖД.Добавить(СтрокаОтправленияЖД.ПунктОтправления);
		КонецЦикла;
	Иначе
		МассивОтправленийЖД.Добавить(Справочники.Локации.ПустаяСсылка());
	КонецЕсли;
	
	МассивНазначенийЖД = Новый Массив;
	Если ЕстьНазначениеЖД Тогда
		Для Каждого СтрокаНазначенияЖД Из Объект.ПунктыНазначенияЖД Цикл
			МассивНазначенийЖД.Добавить(СтрокаНазначенияЖД.ПунктНазначения);
		КонецЦикла;
	Иначе
		МассивНазначенийЖД.Добавить(Справочники.Локации.ПустаяСсылка());
	КонецЕсли;
	
	МассивОтправленийФрахт = Новый Массив;
	Если ЕстьОтправление Тогда
		Для Каждого СтрокаОтправления Из Объект.ПортыОтправленияФрахт Цикл
			МассивОтправленийФрахт.Добавить(СтрокаОтправления.ПортОтправления);
		КонецЦикла;
	Иначе
		МассивОтправленийФрахт.Добавить(Справочники.Локации.ПустаяСсылка());
	КонецЕсли;
	
	МассивОтгрузокФрахт = Новый Массив;
	Если ЕстьОтгрузка Тогда
		Для Каждого СтрокаОтгрузки Из Объект.ПортыОтгрузкиФрахт Цикл
			МассивОтгрузокФрахт.Добавить(СтрокаОтгрузки.ПортОтгрузки);
		КонецЦикла;
	Иначе
		МассивОтгрузокФрахт.Добавить(Справочники.Локации.ПустаяСсылка());
	КонецЕсли;
	
	МассивНазначенийФрахт = Новый Массив;
	Если ЕстьНазначение Тогда
		Для Каждого СтрокаНазначения Из Объект.ПортыНазначенияФрахт Цикл
			МассивНазначенийФрахт.Добавить(СтрокаНазначения.ПортНазначения);
		КонецЦикла;
	Иначе
		МассивНазначенийФрахт.Добавить(Справочники.Локации.ПустаяСсылка());
	КонецЕсли;
	
	ЕстьФрахт = (ЕстьОтправление Или ЕстьНазначение Или ЕстьОтгрузка);
	ЕстьЖД = (ЕстьОтправлениеЖД Или ЕстьНазначениеЖД);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("МассивОтправленийЖД", МассивОтправленийЖД);
	СтруктураПараметров.Вставить("МассивНазначенийЖД", МассивНазначенийЖД);
	СтруктураПараметров.Вставить("МассивОтправленийФрахт", МассивОтправленийФрахт);
	СтруктураПараметров.Вставить("МассивОтгрузокФрахт", МассивОтгрузокФрахт);
	СтруктураПараметров.Вставить("МассивНазначенийФрахт", МассивНазначенийФрахт);
	СтруктураПараметров.Вставить("МассивКонтрагентов", МассивКонтрагентов);
	
	СтруктураПараметров.Вставить("ЕстьФрахт", ЕстьФрахт);
	СтруктураПараметров.Вставить("ЕстьЖД", ЕстьЖД);
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаКлиенте
Процедура ПунктыСпециальныхСтавокТекстПунктаРусНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОпОп = Новый ОписаниеОповещения("ОбработатьВводТекст", ЭтаФорма, "РУС");
	ПоказатьВводСтроки(ОпОп, Элементы.ПунктыСпециальныхСтавок.ТекущиеДанные.ТекстПунктаРус, "Введите русский текст", , Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВводТекст(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	Если Параметр1 = Неопределено Тогда 
		Возврат; 
	КонецЕсли;
	ТекД = Элементы.ПунктыСпециальныхСтавок.ТекущиеДанные;
	
	ТекД[?(Параметр2 = "РУС", "ТекстПунктаРус", "ТекстПунктаАнгл")] = Параметр1;
	ТекД.Отредактировано = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПунктыСпециальныхСтавокТекстПунктаАнглНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОпОп = Новый ОписаниеОповещения("ОбработатьВводТекст", ЭтаФорма, "АНГ");
	ПоказатьВводСтроки(ОпОп, Элементы.ПунктыСпециальныхСтавок.ТекущиеДанные.ТекстПунктаАнгл, "Введите текст на английском", , Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СпециальныеСтавкиФормаПередУдалением(Элемент, Отказ)
	
	СпециальныеСтавкиФормаПередУдалениемНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СпециальныеСтавкиФормаПередУдалениемНаСервере()
	
	МассивУдаляемыхСтрок = Элементы.СпециальныеСтавкиФорма.ВыделенныеСтроки; 
	КоличествоСтрок = МассивУдаляемыхСтрок.Количество();
	Пока КоличествоСтрок > 0 Цикл
		НайденнаяСтрока = СпециальныеСтавкиФорма.НайтиПоИдентификатору(МассивУдаляемыхСтрок[КоличествоСтрок - 1]);
		Для Каждого Идентификатор Из НайденнаяСтрока.ИдентификаторыСтрок Цикл
			
			Отбор = Новый Структура("ИдентификаторСтроки", Идентификатор.Значение);
			НайденныеСтроки = Объект.СпециальныеСтавки.НайтиСтроки(Отбор);
			Для Каждого Строка Из НайденныеСтроки Цикл
				ИндексСтроки = Объект.СпециальныеСтавки.Индекс(Строка);
				Объект.СпециальныеСтавки.Удалить(ИндексСтроки);
			КонецЦикла;
			
			ОтборКалькуляций = Новый Структура("ИдентификаторСтрокиСпецСтавок", Идентификатор.Значение);
			НайденныеКалькуляции = Объект.Калькуляции.НайтиСтроки(ОтборКалькуляций);
			Для Каждого СтрКальк Из НайденныеКалькуляции Цикл
				Объект.Калькуляции.Удалить(Объект.Калькуляции.Индекс(СтрКальк));
			КонецЦикла;
			
		КонецЦикла;
		КоличествоСтрок = КоличествоСтрок - 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПрименяетсяНотис(Значение)
	
	РеквизитыПСЦ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Значение, "ВидПеревозки, 
																		|НаправлениеНотиса, 
																		|НачалоДействия, 
																		|ПунктыПСЦ, 
																		|ОкончаниеДействия");
	Объект.ВидПеревозки = РеквизитыПСЦ.ВидПеревозки;
	Объект.НаправлениеПеревозки = РеквизитыПСЦ.НаправлениеНотиса;
	Объект.НачалоДействия = РеквизитыПСЦ.НачалоДействия;
	Объект.ОкончаниеДействия = РеквизитыПСЦ.ОкончаниеДействия;
	Объект.ПунктыПечатиСпециальныхСтавок.Загрузить(РеквизитыПСЦ.ПунктыПСЦ.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименяетсяПриИзменении(Элемент  = Неопределено)
	
	Модифицированность = Истина;
	
	Если ТипЗнч(Объект.Применяется) = Тип("ДокументСсылка.ПСЦ") Тогда
		Элементы.ВидПеревозки.ТолькоПросмотр = Истина;
		Элементы.НаправлениеПеревозки.ТолькоПросмотр = Истина;
		ПериодДействия.ДатаНачала = Объект.НачалоДействия;
		ПериодДействия.ДатаОкончания = Объект.ОкончаниеДействия;
		Элементы.РейсыРейсы.ТолькоПросмотр = Истина;
		Элементы.ДобавитьРейс.Доступность = Ложь;
		Объект.Рейсы.Очистить();
	Иначе
		Элементы.ВидПеревозки.ТолькоПросмотр = Ложь;
		Элементы.ВидПеревозки.АвтоОтметкаНезаполненного = Истина;
		Элементы.НаправлениеПеревозки.ТолькоПросмотр = Ложь;
		Элементы.РейсыРейсы.ТолькоПросмотр = Ложь;
		ДоступныеТипы = Новый Массив;
		ДоступныеТипы.Добавить(Тип("СправочникСсылка.РейсыЖД"));
		ДоступныеТипы.Добавить(Тип("СправочникСсылка.РейсыМоре"));
		Элементы.РейсыРейсы.ОграничениеТипа = Новый ОписаниеТипов(ДоступныеТипы);
		Элементы.ДобавитьРейс.Доступность = Истина;
		Объект.ПунктыПечатиСпециальныхСтавок.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СпециальныеСтавкиФормаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СпециальныеСтавкиФорма.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПоляФормы = СтрЗаменить(Элементы.СпециальныеСтавкиФорма.ТекущийЭлемент.Имя, "СпециальныеСтавкиФорма", "");
	
	ИзменениеКолонкиДоступно(ТекущиеДанные, ИмяПоляФормы);
	Если ЗаполнятьПоПервойСтрокеНевозможно Тогда
		ТекстСообщения = НСтр("ru = 'Для изменения этого поля необходимо изменить тип ставки.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ,
			"СпециальныеСтавкиФорма[" + Строка(ТекущиеДанные.НомерСтроки - 1) + "].ТипСтавки");
		ТекущиеДанные[ИмяПоляФормы] = Неопределено;
		Возврат;
	КонецЕсли;
	
	СпециальныеСтавкиФормаПриИзмененииНаСервере(ИмяПоляФормы);
	
КонецПроцедуры

&НаСервере
Процедура СпециальныеСтавкиФормаПриИзмененииНаСервере(ИмяПоляФормы)
	
	ИдентификаторСтроки = Элементы.СпециальныеСтавкиФорма.ТекущаяСтрока;
	ТекущиеДанные = СпециальныеСтавкиФорма.НайтиПоИдентификатору(ИдентификаторСтроки);
	ЗначениеДляЗаполнения = ТекущиеДанные[ИмяПоляФормы];
	
	ЭтоКолонкаСтавки = ((СтрНайти(ИмяПоляФормы, "20") > 0 Или СтрНайти(ИмяПоляФормы, "40") > 0)
					 И (СтрНайти(ИмяПоляФормы, "SOC") > 0 Или СтрНайти(ИмяПоляФормы, "COC") > 0));
	
	ИмяПоляТабличнойЧасти = ИмяПоляФормы;
	ПараметрПеревозки = Неопределено;
	
	Если ЭтоКолонкаСтавки Тогда

		Если СтрНайти(ИмяПоляФормы, "СтавкаНДС") > 0 Тогда
			ИмяПоляТабличнойЧасти = "СтавкаНДС";
		ИначеЕсли СтрНайти(ИмяПоляФормы, "Ставка") > 0 Тогда
			ИмяПоляТабличнойЧасти = "Ставка";
		ИначеЕсли СтрНайти(ИмяПоляФормы, "СуммаВключаетНДС") > 0 Тогда
			ИмяПоляТабличнойЧасти = "СуммаВключаетНДС";
		ИначеЕсли СтрНайти(ИмяПоляФормы, "НадбавкаСкидка") > 0 Тогда
			ИмяПоляТабличнойЧасти = "НадбавкаСкидка";
		ИначеЕсли СтрНайти(ИмяПоляФормы, "Калькуляции") > 0 Тогда
			ИмяПоляТабличнойЧасти = СтрЗаменить(ИмяПоляТабличнойЧасти, "Строкой", "");
		КонецЕсли;
		
		ПараметрПеревозки = РазложитьСтрокуНаПараметрПеревозки(ИмяПоляФормы, ТекущиеДанные);
		
		СтрокаНашлась = Ложь;
		Для Каждого Идентификатор Из ТекущиеДанные.ИдентификаторыСтрок Цикл
			СтруктураОтбора = Новый Структура("ИдентификаторСтроки, ПараметрПеревозки");
			СтруктураОтбора.ИдентификаторСтроки = Идентификатор.Значение;
			СтруктураОтбора.ПараметрПеревозки = ПараметрПеревозки;
			
			НайденнаяСтрока = Объект.СпециальныеСтавки.НайтиСтроки(СтруктураОтбора);
			Если НайденнаяСтрока.Количество() > 0 Тогда
				НайденнаяСтрока[0][ИмяПоляТабличнойЧасти] = ЗначениеДляЗаполнения;
				СтрокаНашлась = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если Не СтрокаНашлась И ЗначениеЗаполнено(ЗначениеДляЗаполнения) Тогда
			НоваяСтрока = Объект.СпециальныеСтавки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущиеДанные);
			НоваяСтрока[ИмяПоляТабличнойЧасти] = ЗначениеДляЗаполнения;
			НоваяСтрока.ПараметрПеревозки = ПараметрПеревозки;
			НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
			ТекущиеДанные.ИдентификаторыСтрок.Добавить(НоваяСтрока.ИдентификаторСтроки);
		КонецЕсли;
		
	Иначе

		Для Каждого Идентификатор Из ТекущиеДанные.ИдентификаторыСтрок Цикл
			НайденнаяСтрока = Объект.СпециальныеСтавки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", Идентификатор.Значение));
			Если НайденнаяСтрока.Количество() > 0 Тогда
				
				СтрБД = НайденнаяСтрока[0];
				
				Если СтрНайти(ИмяПоляФормы, "Валюта") = 1 Тогда
					СтарыйПараметр = СтрБД.ПараметрПеревозки;
					
					Если ЗначениеЗаполнено(СтарыйПараметр) Тогда
						ЭтоФрахт = (СтарыйПараметр.ВидТранспортногоСообщения = Перечисления.ВидыТранспортныхСообщений.Море);
						ЭтоЖД = (СтарыйПараметр.ВидТранспортногоСообщения = Перечисления.ВидыТранспортныхСообщений.ЖД);
						ЭтоНадбавкаСкидка = (СтрБД.ТипСтавки = Перечисления.ТипыСтавок.Надбавка Или СтрБД.ТипСтавки = Перечисления.ТипыСтавок.Скидка);
						
						ОбновлятьПараметр = Ложь;
						Если ИмяПоляФормы = "ВалютаФрахт" 
							И ЭтоФрахт 
							И Не ЭтоНадбавкаСкидка Тогда 
							ОбновлятьПараметр = Истина;
						КонецЕсли;
						Если ИмяПоляФормы = "ВалютаЖД"
							И ЭтоЖД 
							И Не ЭтоНадбавкаСкидка Тогда
							ОбновлятьПараметр = Истина;
						КонецЕсли;
						Если ИмяПоляФормы = "ВалютаНадбавкаСкидкаФрахт" 
							И ЭтоФрахт 
							И ЭтоНадбавкаСкидка Тогда
							ОбновлятьПараметр = Истина;
						КонецЕсли;
						Если ИмяПоляФормы = "ВалютаНадбавкаСкидкаЖД" 
							И ЭтоЖД 
							И ЭтоНадбавкаСкидка Тогда
							ОбновлятьПараметр = Истина;
						КонецЕсли;
						
						Если ОбновлятьПараметр Тогда
							НовыйПараметр = Справочники.ПараметрыПеревозки.НайтиПараметрПеревозки(
								СтарыйПараметр.РазмерКТК,
								СтарыйПараметр.ПринадлежностьТЕ,
								ЗначениеДляЗаполнения,
								СтарыйПараметр.ВидТранспортногоСообщения
							);
							СтрБД.ПараметрПеревозки = НовыйПараметр;
						КонецЕсли;
					КонецЕсли;
					
				Иначе
					СтрБД[ИмяПоляФормы] = ЗначениеДляЗаполнения;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ОбновитьНумерациюСтрокТаблицыСпецСтавок();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаполнениеПоПервойСтроке(Элемент = Неопределено)
	
	ТекДанные = Элементы.СпециальныеСтавкиФорма.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
	
		ИмяПоляФормы = Сред(Элемент.Имя, 23);
		
		ИзменениеКолонкиДоступно(ТекДанные, ИмяПоляФормы);
		Если ЗаполнятьПоПервойСтрокеНевозможно Тогда
			ЗаполнятьПоПервойСтрокеНевозможно = Ложь;
			Возврат;
		КонецЕсли;
		
		ИдентификаторСтроки = Элементы.СпециальныеСтавкиФорма.ТекущаяСтрока;
		ТекДанные = СпециальныеСтавкиФорма.НайтиПоИдентификатору(ИдентификаторСтроки);
		
		ВыполнитьЗаполнениеПоПервойСтрокеНаСервере(ИмяПоляФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗаполнениеПоПервойСтрокеНаСервере(ИмяПоляФормы)
	
	ИдентификаторСтроки = Элементы.СпециальныеСтавкиФорма.ТекущаяСтрока;
	ТекДанные = СпециальныеСтавкиФорма.НайтиПоИдентификатору(ИдентификаторСтроки);
	ЗначениеДляЗаполнения = ТекДанные[ИмяПоляФормы];
	
	ЭтоКолонкаСтавки = ((СтрНайти(ИмяПоляФормы, "20") > 0 Или СтрНайти(ИмяПоляФормы, "40") > 0)
					 И (СтрНайти(ИмяПоляФормы, "SOC") > 0 Или СтрНайти(ИмяПоляФормы, "COC") > 0));
	
	ИмяПоляТабличнойЧасти = ИмяПоляФормы;
	ПараметрПеревозки = Неопределено;
	
	Если ЭтоКолонкаСтавки Тогда
		Если СтрНайти(ИмяПоляФормы, "СтавкаНДС") > 0 Тогда
			ИмяПоляТабличнойЧасти = "СтавкаНДС";
		ИначеЕсли СтрНайти(ИмяПоляФормы, "Ставка") > 0 Тогда
			ИмяПоляТабличнойЧасти = "Ставка";
		ИначеЕсли СтрНайти(ИмяПоляФормы, "СуммаВключаетНДС") > 0 Тогда
			ИмяПоляТабличнойЧасти = "СуммаВключаетНДС";
		ИначеЕсли СтрНайти(ИмяПоляФормы, "НадбавкаСкидка") > 0 Тогда
			ИмяПоляТабличнойЧасти = "НадбавкаСкидка";
		КонецЕсли;
		
		ПараметрПеревозки = РазложитьСтрокуНаПараметрПеревозки(ИмяПоляФормы, ТекДанные);
	КонецЕсли;
	
	ИндексСледующейСтроки = СпециальныеСтавкиФорма.Индекс(ТекДанные) + 1;
	ИндексПоследнейСтроки = СпециальныеСтавкиФорма.Количество() - 1;
	
	ПоследняяИтерация = НайтиПоследнююИтерацию();
	
	Для ИндексСтроки = ИндексСледующейСтроки По ИндексПоследнейСтроки Цикл
		СтрокаТЧ = СпециальныеСтавкиФорма[ИндексСтроки];
		
		Если СтрокаТЧ.ТипСтавки = ТекДанные.ТипСтавки 
			Или ИмяПоляФормы = "ТипСтавки" 
			Или Не ЗначениеЗаполнено(СтрокаТЧ.ТипСтавки) Тогда
			
			Если Не ЗначениеЗаполнено(СтрокаТЧ.ТипСтавки) Тогда
				СтрокаТЧ.ТипСтавки = ТекДанные.ТипСтавки;
			КонецЕсли;
			
			СтрокаТЧ[ИмяПоляФормы] = ЗначениеДляЗаполнения;
			
			Если ЭтоКолонкаСтавки Тогда
				
				СтрокаНашлась = Ложь; 
				
				Для Каждого Идентификатор Из СтрокаТЧ.ИдентификаторыСтрок Цикл
					СтруктураОтбора = Новый Структура("ИдентификаторСтроки, ПараметрПеревозки");
					СтруктураОтбора.ИдентификаторСтроки = Идентификатор.Значение;
					СтруктураОтбора.ПараметрПеревозки = ПараметрПеревозки;
					
					НайденнаяСтрока = Объект.СпециальныеСтавки.НайтиСтроки(СтруктураОтбора);
					Если НайденнаяСтрока.Количество() > 0 Тогда
						НайденнаяСтрока[0][ИмяПоляТабличнойЧасти] = ЗначениеДляЗаполнения;
						СтрокаНашлась = Истина;
					КонецЕсли;
				КонецЦикла;
				
				Если Не СтрокаНашлась И ЗначениеЗаполнено(ЗначениеДляЗаполнения) Тогда 
					
					Если СтрокаТЧ.ИтерацияДобавления = 0 Тогда
						ПоследняяИтерация = ПоследняяИтерация + 1;
						СтрокаТЧ.ИтерацияДобавления = ПоследняяИтерация;
					КонецЕсли;
					
					НоваяСтрока = Объект.СпециальныеСтавки.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ); 
					НоваяСтрока[ИмяПоляТабличнойЧасти] = ЗначениеДляЗаполнения;
					НоваяСтрока.ПараметрПеревозки = ПараметрПеревозки;
					НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
					СтрокаТЧ.ИдентификаторыСтрок.Добавить(НоваяСтрока.ИдентификаторСтроки);
				КонецЕсли;
				
			Иначе
				
				Для Каждого Идентификатор Из СтрокаТЧ.ИдентификаторыСтрок Цикл
					НайденнаяСтрока = Объект.СпециальныеСтавки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", Идентификатор.Значение));
					Если НайденнаяСтрока.Количество() > 0 Тогда
						
						СтрБД = НайденнаяСтрока[0];
						
						Если СтрНайти(ИмяПоляФормы, "Валюта") = 1 Тогда
							СтарыйПараметр = СтрБД.ПараметрПеревозки;
							
							Если ЗначениеЗаполнено(СтарыйПараметр) Тогда
								ЭтоФрахт = (СтарыйПараметр.ВидТранспортногоСообщения = Перечисления.ВидыТранспортныхСообщений.Море);
								ЭтоЖД = (СтарыйПараметр.ВидТранспортногоСообщения = Перечисления.ВидыТранспортныхСообщений.ЖД);
								ЭтоНадбавкаСкидка = (СтрБД.ТипСтавки = Перечисления.ТипыСтавок.Надбавка Или СтрБД.ТипСтавки = Перечисления.ТипыСтавок.Скидка);
								
								ОбновлятьПараметр = Ложь;
								Если ИмяПоляФормы = "ВалютаФрахт" 
									И ЭтоФрахт 
									И Не ЭтоНадбавкаСкидка Тогда
									ОбновлятьПараметр = Истина;
								КонецЕсли;
								Если ИмяПоляФормы = "ВалютаЖД"
									И ЭтоЖД 
									И Не ЭтоНадбавкаСкидка Тогда
									ОбновлятьПараметр = Истина;
								КонецЕсли;
								Если ИмяПоляФормы = "ВалютаНадбавкаСкидкаФрахт" 
									И ЭтоФрахт 
									И ЭтоНадбавкаСкидка Тогда
									ОбновлятьПараметр = Истина;
								КонецЕсли;
								Если ИмяПоляФормы = "ВалютаНадбавкаСкидкаЖД" 
									И ЭтоЖД 
									И ЭтоНадбавкаСкидка Тогда
									ОбновлятьПараметр = Истина;
								КонецЕсли;
								
								Если ОбновлятьПараметр Тогда
									НовыйПараметр = Справочники.ПараметрыПеревозки.НайтиПараметрПеревозки(
										СтарыйПараметр.РазмерКТК,
										СтарыйПараметр.ПринадлежностьТЕ,
										ЗначениеДляЗаполнения,
										СтарыйПараметр.ВидТранспортногоСообщения
									);
									СтрБД.ПараметрПеревозки = НовыйПараметр;
								КонецЕсли;
							КонецЕсли;
							
						Иначе
							СтрБД[ИмяПоляФормы] = ЗначениеДляЗаполнения;
						КонецЕсли;
						
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеКолонкиДоступно(ТекущиеДанные, ИмяИзменяемогоПоляТЧ)
	
	Если СтрНайти(ИмяИзменяемогоПоляТЧ, "НадбавкаСкидка") > 0
		И ТекущиеДанные.ТипСтавки = ПредопределенноеЗначение("Перечисление.ТипыСтавок.СпециальнаяСтавка") Тогда
		ЗаполнятьПоПервойСтрокеНевозможно = Истина;
	ИначеЕсли СтрНайти(ИмяИзменяемогоПоляТЧ, "Ставка") > 0 И СтрНайти(ИмяИзменяемогоПоляТЧ, "СтавкаНДС") = 0 
		И (ТекущиеДанные.ТипСтавки = ПредопределенноеЗначение("Перечисление.ТипыСтавок.Надбавка")
			Или ТекущиеДанные.ТипСтавки = ПредопределенноеЗначение("Перечисление.ТипыСтавок.Скидка")) Тогда
		ЗаполнятьПоПервойСтрокеНевозможно = Истина;
	ИначеЕсли ТекущиеДанные.ТипСтавки <> ПредопределенноеЗначение("Перечисление.ТипыСтавок.СпециальнаяСтавка") 
		И (СтрНайти(ИмяИзменяемогоПоляТЧ, "СуммаВключаетНДС") > 0 Или СтрНайти(ИмяИзменяемогоПоляТЧ, "СтавкаНДС") > 0) Тогда
		ЗаполнятьПоПервойСтрокеНевозможно = Истина;
	Иначе
		ЗаполнятьПоПервойСтрокеНевозможно = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпециальныеСтавкиФормаКалькуляцииСтрокойНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Модифицированность = Истина;
	ТекДанные = Элементы.СпециальныеСтавкиФорма.ТекущиеДанные;
	ТекСтрока = Элементы.СпециальныеСтавкиФорма.ТекущаяСтрока;
	
	Если СтрНайти(Элемент.Имя, "ЖД") > 0 Тогда
		ИмяПоля = Лев(Сред(Элемент.Имя, 23), 18);
	Иначе
		ИмяПоля = Лев(Сред(Элемент.Имя, 23), 21);
	КонецЕсли;
	
	ПараметрПеревозки = РазложитьСтрокуНаПараметрПеревозки(ИмяПоля, ТекДанные);
	
	ИдентификаторыСтрок = ТекДанные.ИдентификаторыСтрок.ВыгрузитьЗначения();
	Результат = ПолучитьСписокКалькуляций(ИдентификаторыСтрок, ПараметрПеревозки);
	СписокКалькуляций = Новый СписокЗначений;
	СписокКалькуляций.ЗагрузитьЗначения(Результат.МассивКалькуляций);
	
	Для Каждого ЭлементСписка Из СписокКалькуляций Цикл
		ВыбранныйЭлемент = ТекДанные[ИмяПоля].НайтиПоЗначению(ЭлементСписка.Значение);
		Если ВыбранныйЭлемент <> Неопределено Тогда
			ЭлементСписка.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийСписок", СписокКалькуляций);
	ПараметрыФормы.Вставить("ПоказыватьПометку", Истина);
	ПараметрыФормы.Вставить("ИзменятьСоставСтрок", Ложь);
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ИдентификаторСтроки", ТекСтрока);
	ПараметрыОповещения.Вставить("ИмяПоля", ИмяПоля);
	ПараметрыОповещения.Вставить("СоответствиеКалькуляцийКИдентификаторам", Результат.СоответствиеКалькуляцийКИдентификаторам);
	
	ОповещениеОЗакрытииФормыСписка = Новый ОписаниеОповещения("ПриЗакрытииФормыРедактированияСпискаКалькуляции", ЭтаФорма, ПараметрыОповещения);	
	ОткрытьФорму("ОбщаяФорма.ФормаРедактированияСпискаЗначений", ПараметрыФормы, Этаформа, , , , ОповещениеОЗакрытииФормыСписка, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РазложитьСтрокуНаПараметрПеревозки(Строка, Данные)
	
	Если СтрНайти(Строка, "20") <> 0 Тогда
		РазмерКТК = ПредопределенноеЗначение("Справочник.РазмерыКТК.К20");
	Иначе
		РазмерКТК = ПредопределенноеЗначение("Справочник.РазмерыКТК.К40");
	КонецЕсли;
	Если СтрНайти(Строка, "ЖД") <> 0 Тогда
		ВидСообщенияТекст = "ЖД";
		ВидТранспортногоСообщения = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСообщений.ЖД");
	Иначе
		ВидСообщенияТекст = "Фрахт";
		ВидТранспортногоСообщения = ПредопределенноеЗначение("Перечисление.ВидыТранспортныхСообщений.Море");
	КонецЕсли;
	Если СтрНайти(Строка, "SOC") <> 0 Тогда
		Принадлежность = ПредопределенноеЗначение("Перечисление.ПринадлежностьТЕ.КТКлиента");
	Иначе
		Принадлежность = ПредопределенноеЗначение("Перечисление.ПринадлежностьТЕ.КТЕвросиба");
	КонецЕсли;
	Если Данные.ТипСтавки = ПредопределенноеЗначение("Перечисление.ТипыСтавок.Надбавка") 
		Или Данные.ТипСтавки = ПредопределенноеЗначение("Перечисление.ТипыСтавок.Скидка") Тогда
		Валюта = Данные["ВалютаНадбавкаСкидка" + ВидСообщенияТекст];
	Иначе
		Валюта = Данные["Валюта" + ВидСообщенияТекст];
	КонецЕсли;
	
	Возврат НайтиПараметрПеревозки(РазмерКТК, 
		Принадлежность,
		Валюта,
		ВидТранспортногоСообщения);
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиПараметрПеревозки(РазмерКТК, Принадлежность, Валюта, ВидТранспортногоСообщения)
	
	НайденныйПараметрПеревозки = Справочники.ПараметрыПеревозки.НайтиПараметрПеревозки(РазмерКТК, 
		Принадлежность,
		Валюта,
		ВидТранспортногоСообщения);
	
	Возврат НайденныйПараметрПеревозки;
	
КонецФункции

&НаКлиенте
Процедура ПриЗакрытииФормыРедактированияСпискаКалькуляции(СписокКалькуляций, ДополнительныеПараметры) Экспорт
	
	Если СписокКалькуляций <> Неопределено Тогда
		
		СоответствиеКалькуляцийКИдентификаторам = ДополнительныеПараметры.СоответствиеКалькуляцийКИдентификаторам;
		ТекСтрока = ДополнительныеПараметры.ИдентификаторСтроки;
		ТекДанные = СпециальныеСтавкиФорма.НайтиПоИдентификатору(ТекСтрока);
		ИмяПоля = ДополнительныеПараметры.ИмяПоля;
		ТекДанные[ИмяПоля].Очистить();
		
		Для Каждого ЭлементСписка Из СписокКалькуляций Цикл
			Для Каждого Соответствие Из СоответствиеКалькуляцийКИдентификаторам Цикл
				ИдентификаторСтроки = Соответствие.Получить(ЭлементСписка.Значение);
				Строка = Объект.Калькуляции.НайтиСтроки(Новый Структура("ИдентификаторСтрокиСпецСтавок", ИдентификаторСтроки));
				Если ЭлементСписка.Пометка Тогда
					Строка[0].Удалена = Ложь;
					ТекДанные[ИмяПоля].Добавить(ЭлементСписка.Значение);
				Иначе
					Строка[0].Удалена = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		СпециальныеСтавкиФормаКалькуляции20ЖДSOCПриИзменении(ТекСтрока, ИмяПоля);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокКалькуляций(ИдентификаторыСтрок, ПараметрПеревозки)
	
	Ответ = Новый Структура;
	Ответ.Вставить("МассивКалькуляций");
	Ответ.Вставить("СоответствиеКалькуляцийКИдентификаторам", Новый Массив);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ_Калькуляции.Калькуляция КАК Калькуляция,
	|	ТЗ_Калькуляции.ПараметрПеревозки КАК ПараметрПеревозки,
	|	ТЗ_Калькуляции.ИдентификаторСтрокиСпецСтавок КАК ИдентификаторСтрокиСпецСтавок
	|ПОМЕСТИТЬ ВТ_Калькуляции
	|ИЗ
	|	&ТаблицаКалькуляций КАК ТЗ_Калькуляции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Калькуляции.Калькуляция КАК Калькуляция,
	|	ВТ_Калькуляции.ИдентификаторСтрокиСпецСтавок КАК ИдентификаторСтрокиСпецСтавок
	|ИЗ
	|	ВТ_Калькуляции КАК ВТ_Калькуляции
	|ГДЕ
	|	ВТ_Калькуляции.ИдентификаторСтрокиСпецСтавок В(&ИдентификаторСтрокиСпецСтавок)
	|	И ВТ_Калькуляции.ПараметрПеревозки = &ПараметрПеревозки";
	
	Запрос.УстановитьПараметр("ТаблицаКалькуляций", Объект.Калькуляции.Выгрузить(,"Калькуляция, ПараметрПеревозки, ИдентификаторСтрокиСпецСтавок"));
	Запрос.УстановитьПараметр("ИдентификаторСтрокиСпецСтавок", ИдентификаторыСтрок);
	Запрос.УстановитьПараметр("ПараметрПеревозки", ПараметрПеревозки);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка Из Выгрузка Цикл
		Соответствие = Новый Соответствие;
		Соответствие.Вставить(Строка.Калькуляция, Строка.ИдентификаторСтрокиСпецСтавок);
		Ответ.СоответствиеКалькуляцийКИдентификаторам.Добавить(Соответствие);
	КонецЦикла;
	
	МассивКалькуляций = Выгрузка.ВыгрузитьКолонку("Калькуляция");
	МассивКалькуляций = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивКалькуляций);
	
	Ответ.МассивКалькуляций = МассивКалькуляций;
	Возврат Ответ;
	
КонецФункции

&НаКлиенте
Процедура СпециальныеСтавкиФормаКалькуляции20ЖДSOCСтрокойОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.СпециальныеСтавкиФорма.ТекущиеДанные;
	ТекСтрока = Элементы.СпециальныеСтавкиФорма.ТекущаяСтрока;
	
	Если СтрНайти(Элемент.Имя, "ЖД") > 0 Тогда
		ИмяПоля = Лев(Сред(Элемент.Имя, 23), 18);
	Иначе
		ИмяПоля = Лев(Сред(Элемент.Имя, 23), 21);
	КонецЕсли;
	
	ТекДанные[ИмяПоля].Очистить();
	
	СпециальныеСтавкиФормаКалькуляции20ЖДSOCПриИзменении(ТекСтрока, ИмяПоля);
	
КонецПроцедуры

&НаСервере
Процедура СпециальныеСтавкиФормаКалькуляции20ЖДSOCПриИзменении(ТекСтрока, ИмяПоля)
	
	ТекДанные = СпециальныеСтавкиФорма.НайтиПоИдентификатору(ТекСтрока);
	ОбработатьИзмененияКалькуляций(ТекДанные, ИмяПоля);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзмененияКалькуляций(ТекДанные, ИмяПоля)
	
	ТекДанные[ИмяПоля + "Строкой"]  = СтрСоединить(ТекДанные[ИмяПоля].ВыгрузитьЗначения(), "; " + Символы.ПС);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКалькуляцииСтрокой()
	
	Для Каждого Строка Из СпециальныеСтавкиФорма Цикл
		
		Калькуляции20ЖДSOC = Строка.Калькуляции20ЖДSOC.ВыгрузитьЗначения();
		Калькуляции20ЖДSOC = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Калькуляции20ЖДSOC);
		Строка.Калькуляции20ЖДSOCСтрокой = СтрСоединить(Калькуляции20ЖДSOC, "; " + Символы.ПС);
		
		Калькуляции20ЖДCOC = Строка.Калькуляции20ЖДCOC.ВыгрузитьЗначения();
		Калькуляции20ЖДCOC = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Калькуляции20ЖДCOC);
		Строка.Калькуляции20ЖДCOCСтрокой = СтрСоединить(Калькуляции20ЖДCOC, "; " + Символы.ПС);
		
		Калькуляции40ЖДCOC = Строка.Калькуляции40ЖДCOC.ВыгрузитьЗначения();
		Калькуляции40ЖДCOC = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Калькуляции40ЖДCOC);
		Строка.Калькуляции40ЖДCOCСтрокой = СтрСоединить(Калькуляции40ЖДCOC, "; " + Символы.ПС);
		
		Калькуляции40ЖДSOC = Строка.Калькуляции40ЖДSOC.ВыгрузитьЗначения();
		Калькуляции40ЖДSOC = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Калькуляции40ЖДSOC);
		Строка.Калькуляции40ЖДSOCСтрокой = СтрСоединить(Калькуляции40ЖДSOC, "; " + Символы.ПС);
		
		Калькуляции20ФрахтCOC = Строка.Калькуляции20ФрахтCOC.ВыгрузитьЗначения();
		Калькуляции20ФрахтCOC = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Калькуляции20ФрахтCOC);
		Строка.Калькуляции20ФрахтCOCСтрокой = СтрСоединить(Калькуляции20ФрахтCOC, "; " + Символы.ПС);
		
		Калькуляции20ФрахтSOC = Строка.Калькуляции20ФрахтSOC.ВыгрузитьЗначения();
		Калькуляции20ФрахтSOC = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Калькуляции20ФрахтSOC);
		Строка.Калькуляции20ФрахтSOCСтрокой = СтрСоединить(Калькуляции20ФрахтSOC, "; " + Символы.ПС);
		
		Калькуляции40ФрахтCOC = Строка.Калькуляции40ФрахтCOC.ВыгрузитьЗначения();
		Калькуляции40ФрахтCOC = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Калькуляции40ФрахтCOC);
		Строка.Калькуляции40ФрахтCOCСтрокой = СтрСоединить(Калькуляции40ФрахтCOC, "; " + Символы.ПС);
		
		Калькуляции40ФрахтSOC = Строка.Калькуляции40ФрахтSOC.ВыгрузитьЗначения();
		Калькуляции40ФрахтSOC = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Калькуляции40ФрахтSOC);
		Строка.Калькуляции40ФрахтSOCСтрокой = СтрСоединить(Калькуляции40ФрахтSOC, "; " + Символы.ПС);
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УдалитьПустыеСтрокиВПараметрахПеревозки()
	
	КонтрагентыКоличество = Объект.Контрагенты.Количество();
	ПунктыОтправленияЖДКоличество = Объект.ПунктыОтправленияЖД.Количество();
	ПунктыНазначенияЖДКоличество = Объект.ПунктыНазначенияЖД.Количество();
	ПортыОтправленияФрахтКоличество = Объект.ПортыОтправленияФрахт.Количество();
	ПортыОтгрузкиФрахтКоличество = Объект.ПортыОтгрузкиФрахт.Количество();
	ПортыНазначенияФрахтКоличество = Объект.ПортыНазначенияФрахт.Количество();
	
	Пока КонтрагентыКоличество > 0 Цикл
		КонтрагентыКоличество = КонтрагентыКоличество - 1;
		Строка = Объект.Контрагенты[КонтрагентыКоличество];
		Если Не ЗначениеЗаполнено(Строка.Контрагент) Тогда
			Объект.Контрагенты.Удалить(КонтрагентыКоличество);
		КонецЕсли;
	КонецЦикла;
	
	Пока ПунктыОтправленияЖДКоличество > 0 Цикл
		ПунктыОтправленияЖДКоличество = ПунктыОтправленияЖДКоличество - 1;
		Строка = Объект.ПунктыОтправленияЖД[ПунктыОтправленияЖДКоличество];
		Если Не ЗначениеЗаполнено(Строка.ПунктОтправления) Тогда
			Объект.ПунктыОтправленияЖД.Удалить(ПунктыОтправленияЖДКоличество);
		КонецЕсли;
	КонецЦикла;
	
	Пока ПунктыНазначенияЖДКоличество > 0 Цикл
		ПунктыНазначенияЖДКоличество = ПунктыНазначенияЖДКоличество - 1;
		Строка = Объект.ПунктыНазначенияЖД[ПунктыНазначенияЖДКоличество];
		Если Не ЗначениеЗаполнено(Строка.ПунктНазначения) Тогда
			Объект.ПунктыНазначенияЖД.Удалить(ПунктыНазначенияЖДКоличество);
		КонецЕсли;
	КонецЦикла;
	
	Пока ПортыОтправленияФрахтКоличество > 0 Цикл
		ПортыОтправленияФрахтКоличество = ПортыОтправленияФрахтКоличество - 1;
		Строка = Объект.ПортыОтправленияФрахт[ПортыОтправленияФрахтКоличество];
		Если Не ЗначениеЗаполнено(Строка.ПортОтправления) Тогда
			Объект.ПортыОтправленияФрахт.Удалить(ПортыОтправленияФрахтКоличество);
		КонецЕсли;
	КонецЦикла;
	
	Пока ПортыОтгрузкиФрахтКоличество > 0 Цикл
		ПортыОтгрузкиФрахтКоличество = ПортыОтгрузкиФрахтКоличество - 1;
		Строка = Объект.ПортыОтгрузкиФрахт[ПортыОтгрузкиФрахтКоличество];
		Если Не ЗначениеЗаполнено(Строка.ПортОтгрузки) Тогда
			Объект.ПортыОтгрузкиФрахт.Удалить(ПортыОтгрузкиФрахтКоличество);
		КонецЕсли;
	КонецЦикла;
	
	Пока ПортыНазначенияФрахтКоличество > 0 Цикл
		ПортыНазначенияФрахтКоличество = ПортыНазначенияФрахтКоличество - 1;
		Строка = Объект.ПортыНазначенияФрахт[ПортыНазначенияФрахтКоличество];
		Если Не ЗначениеЗаполнено(Строка.ПортНазначения) Тогда
			Объект.ПортыНазначенияФрахт.Удалить(ПортыНазначенияФрахтКоличество);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаДанныхКалькуляцийНотиса()
	
	Возврат "ВЫБРАТЬ
	|	ДокументКалькуляция.Ссылка КАК Калькуляция,
	|	ДокументКалькуляция.веб_ДляКТКЕвросиб КАК COCЖД,
	|	ДокументКалькуляция.веб_ДляКТККлиента КАК SOCЖД,
	|	ДокументКалькуляция.УсловияПеревозки_Отправление КАК УсловияПеревозки_Отправление,
	|	ДокументКалькуляция.УсловияПеревозки_Прибытие КАК УсловияПеревозки_Прибытие,
	|	ВЫБОР
	|		КОГДА ДокументКалькуляция.ТарифицируемыйРазмерКТК В (""20"", ""2040"")
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Размер20,
	|	ВЫБОР
	|		КОГДА ДокументКалькуляция.ТарифицируемыйРазмерКТК В (""40"", ""2040"")
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Размер40,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЕСТЬNULL(МультимодальнаяЦепочка.Итого20, 0) <> 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК Итого20Заполнено,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЕСТЬNULL(МультимодальнаяЦепочка.Итого40, 0) <> 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК Итого40Заполнено,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЕСТЬNULL(МультимодальнаяЦепочка.Итого20, 0) <> 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК Выбрано20ЖД,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЕСТЬNULL(МультимодальнаяЦепочка.Итого40, 0) <> 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК Выбрано40ЖД
	|ПОМЕСТИТЬ ВТ_БазовыеДанныеКалькуляции
	|ИЗ
	|	Документ.Калькуляция КАК ДокументКалькуляция
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК МультимодальнаяЦепочка
	|		ПО ДокументКалькуляция.Ссылка = МультимодальнаяЦепочка.Ссылка
	|ГДЕ
	|	ДокументКалькуляция.Ссылка В(&СсылкиКалькуляций)
	|СГРУППИРОВАТЬ ПО
	|	ДокументКалькуляция.Ссылка,
	|	ДокументКалькуляция.веб_ДляКТКЕвросиб,
	|	ДокументКалькуляция.веб_ДляКТККлиента,
	|	ДокументКалькуляция.УсловияПеревозки_Отправление,
	|	ДокументКалькуляция.УсловияПеревозки_Прибытие,
	|	ДокументКалькуляция.ТарифицируемыйРазмерКТК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка КАК Калькуляция,
	|	Суша_ПунктОтправления КАК Станция
	|ПОМЕСТИТЬ ВТ_СтанцииОтправления
	|ИЗ
	|	Документ.Калькуляция
	|ГДЕ
	|	Ссылка В(&СсылкиКалькуляций)
	|	И Суша_ПунктОтправления <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Ссылка,
	|	Станция
	|ИЗ
	|	Документ.Калькуляция.СписокСтанцийОтправления
	|ГДЕ
	|	Ссылка В(&СсылкиКалькуляций)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка КАК Калькуляция,
	|	Суша_ПунктНазначения КАК Станция
	|ПОМЕСТИТЬ ВТ_СтанцииНазначения
	|ИЗ
	|	Документ.Калькуляция
	|ГДЕ
	|	Ссылка В(&СсылкиКалькуляций)
	|	И Суша_ПунктНазначения <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Ссылка,
	|	Станция
	|ИЗ
	|	Документ.Калькуляция.СписокСтанцийНазначения
	|ГДЕ
	|	Ссылка В(&СсылкиКалькуляций)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка КАК Калькуляция,
	|	ВЫБОР
	|		КОГДА SOCCOC = ""SOC""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК SOCФрахт,
	|	ВЫБОР
	|		КОГДА SOCCOC = ""COC""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК COCФрахт,
	|	Выбрано20 КАК Выбрано20Фрахт,
	|	Выбрано40 КАК Выбрано40Фрахт,
	|	Порт КАК ПортОтправления,
	|	ПортВыгрузкиОтгрузки КАК ПортОтгрузки,
	|	Ссылка.Море_УсловияПогрузки КАК УсловияПогрузки,
	|	Ссылка.Море_УсловияВыгрузки КАК УсловияВыгрузки
	|ПОМЕСТИТЬ ВТ_ДанныеФрахта
	|ИЗ
	|	Документ.Калькуляция.НФ_ВыбранныеСтавки
	|ГДЕ
	|	Ссылка В(&СсылкиКалькуляций)
	|	И (Выбрано20 ИЛИ Выбрано40)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка КАК Калькуляция,
	|	Порт
	|ПОМЕСТИТЬ ВТ_ПортыНазначения
	|ИЗ
	|	Документ.Калькуляция.ММ_ПортыОтправленияНазначения
	|ГДЕ
	|	Ссылка В(&СсылкиКалькуляций)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Ссылка,
	|	Порт
	|ИЗ
	|	Документ.Калькуляция.НФ_ПортыОтправленияНазначения
	|ГДЕ
	|	Ссылка В(&СсылкиКалькуляций)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БазовыеДанные.Калькуляция КАК Калькуляция,
	|	БазовыеДанные.COCЖД КАК COCЖД,
	|	БазовыеДанные.SOCЖД КАК SOCЖД,
	|	ЕСТЬNULL(ДанныеФрахта.COCФрахт, ЛОЖЬ) КАК COCФрахт,
	|	ЕСТЬNULL(ДанныеФрахта.SOCФрахт, ЛОЖЬ) КАК SOCФрахт,
	|	БазовыеДанные.УсловияПеревозки_Отправление КАК УсловияПеревозкиОтправление,
	|	БазовыеДанные.УсловияПеревозки_Прибытие КАК УсловияПеревозкиПрибытие,
	|	БазовыеДанные.Размер20 КАК Размер20,
	|	БазовыеДанные.Размер40 КАК Размер40,
	|	БазовыеДанные.Итого20Заполнено КАК Итого20Заполнено,
	|	БазовыеДанные.Итого40Заполнено КАК Итого40Заполнено,
	|	БазовыеДанные.Выбрано20ЖД КАК Выбрано20ЖД,
	|	БазовыеДанные.Выбрано40ЖД КАК Выбрано40ЖД,
	|	ЕСТЬNULL(ДанныеФрахта.Выбрано20Фрахт, ЛОЖЬ) КАК Выбрано20Фрахт,
	|	ЕСТЬNULL(ДанныеФрахта.Выбрано40Фрахт, ЛОЖЬ) КАК Выбрано40Фрахт,
	|	ЕСТЬNULL(СтанцииОтправления.Станция, ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)) КАК ПунктОтправления,
	|	ЕСТЬNULL(СтанцииНазначения.Станция, ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)) КАК ПунктНазначения,
	|	ЕСТЬNULL(ДанныеФрахта.ПортОтправления, ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)) КАК ПортОтправления,
	|	ЕСТЬNULL(ДанныеФрахта.ПортОтгрузки, ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)) КАК ПортОтгрузки,
	|	ЕСТЬNULL(ПортыНазначения.Порт, ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)) КАК ПортНазначения,
	|	ЕСТЬNULL(ДанныеФрахта.УсловияПогрузки, ЗНАЧЕНИЕ(Перечисление.УсловияПеревозкиПоПортам.ПустаяСсылка)) КАК УсловияПогрузки,
	|	ЕСТЬNULL(ДанныеФрахта.УсловияВыгрузки, ЗНАЧЕНИЕ(Перечисление.УсловияПеревозкиПоПортам.ПустаяСсылка)) КАК УсловияВыгрузки
	|ИЗ
	|	ВТ_БазовыеДанныеКалькуляции КАК БазовыеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтанцииОтправления КАК СтанцииОтправления
	|		ПО БазовыеДанные.Калькуляция = СтанцииОтправления.Калькуляция
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтанцииНазначения КАК СтанцииНазначения
	|		ПО БазовыеДанные.Калькуляция = СтанцииНазначения.Калькуляция
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеФрахта КАК ДанныеФрахта
	|		ПО БазовыеДанные.Калькуляция = ДанныеФрахта.Калькуляция
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПортыНазначения КАК ПортыНазначения
	|		ПО БазовыеДанные.Калькуляция = ПортыНазначения.Калькуляция";

КонецФункции


&НаКлиенте
Процедура ОбработкаВыбораПрименяется(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	Если Параметр1 <> Неопределено Тогда
		Объект.Применяется = Параметр1;
		Если ТипЗнч(Параметр1) = Тип("ДокументСсылка.ПСЦ") Тогда
			ПрименяетсяНотис(Параметр1);
		КонецЕсли;
		ПрименяетсяПриИзменении();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименяетсяНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораПрименяется", ЭтаФорма);
	
	ПараметрыОтбора = Новый Структура;
	ОткрытьФорму("Документ.РеестрСпециальныхСтавок.Форма.ФормаВыбораПрименяется", ПараметрыОтбора, , 
							ЭтаФорма.УникальныйИдентификатор, , , ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыКонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		НайденаСтрока = Объект.Контрагенты.НайтиСтроки(Новый Структура("Контрагент", ВыбранноеЗначение));
		Если НайденаСтрока.Количество() > 0 Тогда
			ТекстСообщения = НСтр("ru = 'Контрагент уже добавлен в таблицу'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, ,
				"Контрагенты[" + Строка(НайденаСтрока[0].НомерСтроки - 1) + "].Контрагент", "Объект");
			Объект.Контрагенты.Удалить(Элементы.Контрагенты.ТекущиеДанные.НомерСтроки - 1);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыКлиентаТипКлиентаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		НайденаСтрока = Объект.ТипыКлиента.НайтиСтроки(Новый Структура("ТипКлиента", ВыбранноеЗначение));
		Если НайденаСтрока.Количество() > 0 Тогда
			ТекстСообщения = НСтр("ru = 'Тип клиента уже добавлен в таблицу'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, ,
				"ТипыКлиента[" + Строка(НайденаСтрока[0].НомерСтроки - 1) + "].ТипКлиента", "Объект");
			Объект.ТипыКлиента.Удалить(Элементы.ТипыКлиента.ТекущиеДанные.НомерСтроки - 1);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПунктыОтправленияЖДПунктОтправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		НайденаСтрока = Объект.ПунктыОтправленияЖД.НайтиСтроки(Новый Структура("ПунктОтправления", ВыбранноеЗначение));
		Если НайденаСтрока.Количество() > 0 Тогда
			ТекстСообщения = НСтр("ru = 'Локация уже добавлена в таблицу.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, ,
				"ПунктыОтправленияЖД[" + Строка(НайденаСтрока[0].НомерСтроки - 1) + "].ПунктОтправления", "Объект");
			Объект.ПунктыОтправленияЖД.Удалить(Элементы.ПунктыОтправленияЖД.ТекущиеДанные.НомерСтроки - 1);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПунктыНазначенияЖДПунктНазначенияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		НайденаСтрока = Объект.ПунктыНазначенияЖД.НайтиСтроки(Новый Структура("ПунктНазначения", ВыбранноеЗначение));
		Если НайденаСтрока.Количество() > 0 Тогда
			ТекстСообщения = НСтр("ru = 'Локация уже добавлена в таблицу.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, ,
				"ПунктыНазначенияЖД[" + Строка(НайденаСтрока[0].НомерСтроки - 1) + "].ПунктНазначения", "Объект");
			Объект.ПунктыНазначенияЖД.Удалить(Элементы.ПунктыНазначенияЖД.ТекущиеДанные.НомерСтроки - 1);
			Возврат;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПортыОтправленияПортОтправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		НайденаСтрока = Объект.ПортыОтправленияФрахт.НайтиСтроки(Новый Структура("ПортОтправления", ВыбранноеЗначение));
		Если НайденаСтрока.Количество() > 0 Тогда
			ТекстСообщения = НСтр("ru = 'Локация уже добавлена в таблицу.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, ,
				"ПортыОтправленияФрахт[" + Строка(НайденаСтрока[0].НомерСтроки - 1) + "].ПортОтправления", "Объект");
			Объект.ПортыОтправленияФрахт.Удалить(Элементы.ПортыОтправления.ТекущиеДанные.НомерСтроки - 1);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПортыОтгрузкиПортОтгрузкиОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		НайденаСтрока = Объект.ПортыОтгрузкиФрахт.НайтиСтроки(Новый Структура("ПортОтгрузки", ВыбранноеЗначение));
		Если НайденаСтрока.Количество() > 0 Тогда
			ТекстСообщения = НСтр("ru = 'Локация уже добавлена в таблицу.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, ,
				"ПортыОтгрузкиФрахт[" + Строка(НайденаСтрока[0].НомерСтроки - 1) + "].ПортОтгрузки", "Объект");
			Объект.ПортыОтгрузкиФрахт.Удалить(Элементы.ПортыОтгрузки.ТекущиеДанные.НомерСтроки - 1);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПортыНазначенияПортНазначенияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		НайденаСтрока = Объект.ПортыНазначенияФрахт.НайтиСтроки(Новый Структура("ПортНазначения", ВыбранноеЗначение));
		Если НайденаСтрока.Количество() > 0 Тогда
			ТекстСообщения = НСтр("ru = 'Локация уже добавлена в таблицу.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, ,
				"ПортыНазначенияФрахт[" + Строка(НайденаСтрока[0].НомерСтроки - 1) + "].ПортНазначения", "Объект");
			Объект.ПортыНазначенияФрахт.Удалить(Элементы.ПортыНазначения.ТекущиеДанные.НомерСтроки - 1);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьДублиСтрок(ПроверяемыеРеквизиты, Отказ)
	
	ТаблицаДокумента = СпециальныеСтавкиФорма.Выгрузить();
	
	СоответствиеКлючей = Новый Соответствие;
	
	Для Каждого СтрокаТЧ Из ТаблицаДокумента Цикл
		
		Ключ = "";
		Стр = СокрЛП(ПроверяемыеРеквизиты);
		Пока СтрНайти(Стр, ",") > 0 Цикл
			НаимРеквизита = СокрЛП(Лев(Стр, СтрНайти(Стр, ",") - 1));
			Стр = Прав(Стр, СтрДлина(Стр) - СтрНайти(Стр, ","));
			
			Значение = СтрокаТЧ[НаимРеквизита];
			Ключ = Ключ + "|" + Строка(Значение);
		КонецЦикла;
		
		ПоследнийРеквизит = СокрЛП(Стр);
		Значение = СтрокаТЧ[ПоследнийРеквизит];
		Ключ = Ключ + "|" + Строка(Значение);
		
		СписокНомеров = СоответствиеКлючей[Ключ];
		Если СписокНомеров = Неопределено Тогда
			СписокНомеров = Новый СписокЗначений;
			СоответствиеКлючей.Вставить(Ключ, СписокНомеров);
		КонецЕсли;
		
		СписокНомеров.Добавить(СтрокаТЧ.НомерСтроки);
		
	КонецЦикла;
	
	Для Каждого КлючИзСоответствия Из СоответствиеКлючей Цикл
		
		СписокНомеров = КлючИзСоответствия.Значение;
		
		Если СписокНомеров.Количество() > 1 Тогда
			
			НомераСтрок = "";
			Для Каждого Номер Из СписокНомеров Цикл
				Если НомераСтрок <> "" Тогда
					НомераСтрок = НомераСтрок + ", ";
				КонецЕсли;
				НомераСтрок = НомераСтрок + Номер.Значение;
			КонецЦикла;
			
			СтрокаДляПримера = Неопределено;
			Для Каждого СтрокаТЧ Из ТаблицаДокумента Цикл
				КлючСтроки = "";
				Стр = СокрЛП(ПроверяемыеРеквизиты);
				Пока СтрНайти(Стр, ",") > 0 Цикл
					НаимРеквизита = СокрЛП(Лев(Стр, СтрНайти(Стр, ",") - 1));
					Стр = Прав(Стр, СтрДлина(Стр) - СтрНайти(Стр, ","));
					КлючСтроки = КлючСтроки + "|" + Строка(СтрокаТЧ[НаимРеквизита]);
				КонецЦикла;
				ПоследнийРеквизит = СокрЛП(Стр);
				КлючСтроки = КлючСтроки + "|" + Строка(СтрокаТЧ[ПоследнийРеквизит]);
				
				Если КлючСтроки = КлючИзСоответствия.Ключ Тогда
					СтрокаДляПримера = СтрокаТЧ;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если СтрокаДляПримера <> Неопределено Тогда
				
				Стр = СокрЛП(ПроверяемыеРеквизиты);
				Пока СтрНайти(Стр, ",") > 0 Цикл
					НаимРеквизита = СокрЛП(Лев(Стр, СтрНайти(Стр, ",") - 1));
					Стр = Прав(Стр, СтрДлина(Стр) - СтрНайти(Стр, ","));
				КонецЦикла; 
				
				ПоследнийРеквизит = СокрЛП(Стр);
				ЗначениеПоследнего = СтрокаДляПримера[ПоследнийРеквизит];
				Если ЗначениеПоследнего = Неопределено Тогда
					ЗначениеПоследнего = "";
				КонецЕсли;
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Найдены дубли строк, повторяющиеся строки : " + НомераСтрок;
				Сообщение.Сообщить();
				
				Отказ = Истина;
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НаименованияКолонокДляПроверки()
	
	Возврат "Контрагент, 
	|ТипСтавки, 
	|ПлановыйОбъемTEU, 
	|ПунктОтправления, 
	|ПунктНазначения, 
	|УсловияПеревозкиОтправление, 
	|УсловияПеревозкиПрибытие, 
	|ВалютаЖД, 
	|Ставка20ЖДCOC, 
	|Ставка20ЖДSOC, 
	|Ставка40ЖДCOC, 
	|Ставка40ЖДSOC, 
	|ПортОтправления, 
	|ПортОтгрузки, 
	|ПортНазначения, 
	|ВалютаФрахт, 
	|УсловияПогрузки, 
	|УсловияВыгрузки, 
	|Ставка20ФрахтCOC, 
	|Ставка20ФрахтSOC, 
	|Ставка40ФрахтCOC, 
	|Ставка40ФрахтSOC, 
	|ВалютаНадбавкаСкидкаЖД, 
	|НадбавкаСкидка20ЖДCOC, 
	|НадбавкаСкидка20ЖДSOC, 
	|НадбавкаСкидка40ЖДCOC, 
	|НадбавкаСкидка40ЖДSOC, 
	|ВалютаНадбавкаСкидкаФрахт, 
	|НадбавкаСкидка20ФрахтCOC, 
	|НадбавкаСкидка20ФрахтSOC, 
	|НадбавкаСкидка40ФрахтCOC, 
	|НадбавкаСкидка40ФрахтSOC, 
	|СуммаВключаетНДС20ЖДCOC, 
	|СуммаВключаетНДС20ЖДSOC, 
	|СуммаВключаетНДС40ЖДCOC, 
	|СуммаВключаетНДС40ЖДSOC, 
	|СуммаВключаетНДС20ФрахтCOC, 
	|СуммаВключаетНДС20ФрахтSOC, 
	|СуммаВключаетНДС40ФрахтCOC, 
	|СуммаВключаетНДС40ФрахтSOC, 
	|СтавкаНДС20ЖДCOC, 
	|СтавкаНДС20ЖДSOC, 
	|СтавкаНДС40ЖДCOC, 
	|СтавкаНДС40ЖДSOC, 
	|СтавкаНДС20ФрахтCOC, 
	|СтавкаНДС20ФрахтSOC, 
	|СтавкаНДС40ФрахтCOC, 
	|СтавкаНДС40ФрахтSOC, 
	|ЭтоПроцентОтСуммы";
	
 КонецФункции

&НаКлиенте
Процедура СпециальныеСтавкиФормаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Копирование Тогда
		НоваяСтрокаФормы = Элементы.СпециальныеСтавкиФорма.ТекущиеДанные;
		ИдентификаторыСтрокиКопирования = НоваяСтрокаФормы.ИдентификаторыСтрок.ВыгрузитьЗначения();
		НоваяСтрокаФормы.ИдентификаторыСтрок.Очистить();
		Для Каждого ИдентификаторСтроки Из ИдентификаторыСтрокиКопирования Цикл
			НайденнаяСтрока = Объект.СпециальныеСтавки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
			НоваяСтрокаОбъекта = Объект.СпециальныеСтавки.Добавить();
			НоваяСтрокаОбъекта.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
			ЗаполнитьЗначенияСвойств(НоваяСтрокаОбъекта, НайденнаяСтрока[0], , "ИдентификаторСтроки");
			НоваяСтрокаФормы.ИдентификаторыСтрок.Добавить(НоваяСтрокаОбъекта.ИдентификаторСтроки);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтозватьСогласование(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОтменаСогласования", ЭтаФорма);
	ПоказатьВопрос(ОпОп, "Протокол будет возвращен на этап ввода, а информация о результатах согласования стерта. Продолжить?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменаСогласования(П1 = Неопределено, П2 = Неопределено) Экспорт
	
	Если П1 <> КодВозвратаДиалога.Да Тогда 
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапроса = ПолучитьПараметрыМаршрутизацииНаСервере(Объект);
	РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьРеестрСпециальныхСтавок(ПараметрыЗапроса, Объект.Дата); 
	
	Для Каждого Стр Из РезультатЗапроса Цикл
		Если Не ЗначениеЗаполнено(Стр.Исполнитель) Тогда
			Продолжить;
		КонецЕсли;
		Отбор = Новый Структура("Состояние", Стр.Состояние);
		НайденныеСтроки = Объект.Состояния.НайтиСтроки(Отбор);
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл 
			НайденнаяСтрока.Исполнитель = Стр.Исполнитель;
		КонецЦикла;
	КонецЦикла;
	
	Оповещение = Новый ОписаниеОповещения("ОтменаСогласованияПродолжение", ЭтаФорма);	
	ОткрытьФорму("ОбщаяФорма.ОтзывСогласования", , ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыМаршрутизацииНаСервере(Знач Объект)
	Возврат Документы.РеестрСпециальныхСтавок.ПолучитьПараметрыМаршрутизации(Объект);
КонецФункции

&НаКлиенте
Процедура ОтменаСогласованияПродолжение(Комментарий, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Комментарий) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапроса = ПолучитьПараметрыМаршрутизацииНаСервере(Объект);
	РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьРеестрСпециальныхСтавок(ПараметрыЗапроса, Объект.Дата);
	
	Для Каждого Стр Из РезультатЗапроса Цикл
		
		Если Не ЗначениеЗаполнено(Стр.Исполнитель) Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура("Состояние", Стр.Состояние);
		НайденныеСтроки = Объект.Состояния.НайтиСтроки(Отбор);
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НайденнаяСтрока.Исполнитель = Стр.Исполнитель;
		КонецЦикла;
		
	КонецЦикла;
	
	ВозвращаемыеЗадачи = Новый Массив;
	Если Объект.Состояния.Количество() > 0 Тогда
		СтрСостояния = Объект.Состояния[0];
		СтрСостояния.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.ВРаботе");
		СтрСостояния.ВыполнениеЗафиксировано = Ложь;
		ВозвращаемыеЗадачи.Добавить(СтрСостояния.Состояние);
	КонецЕсли;
	
	Для Сч = 1 По Объект.Состояния.Количество() - 1 Цикл
		
		Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Новый");
		Объект.Состояния[Сч].Комментарий = "";
		Если ЗначениеЗаполнено(Объект.Состояния[Сч].СтатусСогласования) Тогда
			Объект.Состояния[Сч].СтатусСогласования = ПредопределенноеЗначение("Перечисление.СтатусыСогласования.Планируется");
		КонецЕсли;
		
		Объект.Состояния[Сч].ВыполнениеЗафиксировано = Ложь;
		ВозвращаемыеЗадачи.Добавить(Объект.Состояния[Сч].Состояние);
		
	КонецЦикла;
	
	ПараметрыОтменыСогласования = Новый Структура;
	ПараметрыОтменыСогласования.Вставить("ВозвращаемыеЗадачи", ВозвращаемыеЗадачи);
	ПараметрыОтменыСогласования.Вставить("Комментарий", Комментарий);
	ЗаписатьОтменуСогласования(ПараметрыОтменыСогласования);
	
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОтменуСогласования(ПараметрыОтменыСогласования)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекДата = ТекущаяДатаСеанса();
	ТекПользователь = Пользователи.ТекущийПользователь();
	ДанныеПроцессаСогласования = СогласованиеСервер.ПолучитьПроцессСогласованияОбъекта(Объект.Ссылка);
	
	НачатьТранзакцию();
	
	Попытка
		ПараметрыЗаписи = Новый Структура("РежимЗаписи, ИзмененыТолькоРазрешенныеПоля", РежимЗаписиДокумента.ОтменаПроведения, Истина);	
		ПараметрыЗаписи.Вставить("ВозвращаемыеЗадачи", ПараметрыОтменыСогласования.ВозвращаемыеЗадачи);
		
		Записать(ПараметрыЗаписи);
		
		МЗ = РегистрыСведений.Рецензирование.СоздатьМенеджерЗаписи();
		МЗ.ЦиклСогласования = ДанныеПроцессаСогласования.ШагЦикла;
		МЗ.РецензОбъект = Объект.Ссылка;
		МЗ.Рецензент = ТекПользователь;
		МЗ.ТаймШтамп = ТекДата;
		МЗ.Комментарии = ПараметрыОтменыСогласования.Комментарий;
		МЗ.Действие = Перечисления.СтатусыЭтапов.Отозван;
		МЗ.СтатусОбъекта = Перечисления.СтатусыСогласования.Планируется;
		Если ТекПользователь = Объект.Автор Тогда
			МЗ.РольИсполнителя = "Автор документа";
		Иначе
			
			Для Каждого Стр Из Объект.ПримененныйМаршрут.Состояния Цикл
				Если ТипЗнч(Стр.Исполнитель) = Тип("СправочникСсылка.ГруппыПользователей") Тогда
					МассивИсполнителей = Пользователи_sd_сервер.ПолучитьПользователейГруппы(Стр.Исполнитель, ТекДата, Истина);
					Если МассивИсполнителей.Найти(ТекПользователь) <> Неопределено Тогда
						МЗ.РольИсполнителя = Стр.Исполнитель; 
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Если Не ЗначениеЗаполнено(МЗ.РольИсполнителя) Тогда
				ГруппыПользователя = Пользователи_sd_сервер.ПолучитьСписокМоихГрупп(ТекПользователь, Ложь);
				Для Каждого ГруппаПользователя Из ГруппыПользователя Цикл
					Если ТипЗнч(ГруппаПользователя) = Тип("СправочникСсылка.ГруппыПользователей")
						И ГруппаПользователя <> Справочники.ГруппыПользователей.ВсеПользователи Тогда
						МЗ.РольИсполнителя = ГруппаПользователя;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
		МЗ.Записать(Истина);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СпециальныеСтавкиФормаУниверсальныйПриИзменении(Элемент)
	Если ЗаполнятьПоПервойСтроке Тогда
		ВыполнитьЗаполнениеПоПервойСтроке(Элемент);
	КонецЕсли;
КонецПроцедуры



&НаСервере
Функция ПолучитьИтерацииДляСлияния(СтруктураПоиска, ИмяКолонкиСтавки)
	
	МассивИтераций = Новый Массив;
	НайденныеСтроки = СпециальныеСтавкиФорма.НайтиСтроки(СтруктураПоиска);
	
	Для Каждого СтрокаФормы Из НайденныеСтроки Цикл
		Если Не ЗначениеЗаполнено(СтрокаФормы[ИмяКолонкиСтавки]) Тогда
			МассивИтераций.Добавить(СтрокаФормы.ИтерацияДобавления);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивИтераций;
	
КонецФункции

&НаСервере
Процедура ВвестиСтавкиНаСервере()
	
	Отказ = ПроверитьЗаполненностьСтавокНадбавокСкидок();
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Ставки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = СтруктураПараметровПеревозкиКЗаполнению();
	
	Для Каждого СтрокаКонтрагенты Из СтруктураПараметров.МассивКонтрагентов Цикл
		Для Каждого СтрокаПунктОтправленияЖД Из СтруктураПараметров.МассивОтправленийЖД Цикл
			Для Каждого СтрокаПунктНазначенияЖД Из СтруктураПараметров.МассивНазначенийЖД Цикл
				Для Каждого СтрокаПортОтправления Из СтруктураПараметров.МассивОтправленийФрахт Цикл
					Для Каждого СтрокаПортОтгрузки Из СтруктураПараметров.МассивОтгрузокФрахт Цикл
						Для Каждого СтрокаПортНазначения Из СтруктураПараметров.МассивНазначенийФрахт Цикл
							
							ПоследняяИтерация = НайтиПоследнююИтерацию();
							
							Для Каждого СтрокаСтавок Из Ставки Цикл
								
								ЕстьСтавкиФрахт = ЗначениеЗаполнено(СтрокаСтавок.Ставка20Фрахт) Или ЗначениеЗаполнено(СтрокаСтавок.Ставка40Фрахт);
								ЕстьСтавкиЖД = ЗначениеЗаполнено(СтрокаСтавок.Ставка20ЖД) Или ЗначениеЗаполнено(СтрокаСтавок.Ставка40ЖД);
								
								Если (Не ЕстьСтавкиЖД) И (СтрокаПунктОтправленияЖД <> СтруктураПараметров.МассивОтправленийЖД[0] 
									Или СтрокаПунктНазначенияЖД <> СтруктураПараметров.МассивНазначенийЖД[0]) Тогда
									Продолжить;
								КонецЕсли;
								
								Если (Не ЕстьСтавкиФрахт) И (СтрокаПортОтправления <> СтруктураПараметров.МассивОтправленийФрахт[0] 
									Или СтрокаПортОтгрузки <> СтруктураПараметров.МассивОтгрузокФрахт[0] 
									Или СтрокаПортНазначения <> СтруктураПараметров.МассивНазначенийФрахт[0]) Тогда
									Продолжить;
								КонецЕсли;
								
								СтруктураПоиска = Новый Структура;
								СтруктураПоиска.Вставить("Контрагент", СтрокаКонтрагенты);
								СтруктураПоиска.Вставить("ПлановыйОбъемTEU", Объект.ПлановыйОбъемTEU);
								СтруктураПоиска.Вставить("ТипСтавки", Перечисления.ТипыСтавок.СпециальнаяСтавка);
								СтруктураПоиска.Вставить("ПунктОтправления", ?(ЕстьСтавкиЖД, СтрокаПунктОтправленияЖД, Справочники.Локации.ПустаяСсылка()));
								СтруктураПоиска.Вставить("ПунктНазначения", ?(ЕстьСтавкиЖД, СтрокаПунктНазначенияЖД, Справочники.Локации.ПустаяСсылка()));
								СтруктураПоиска.Вставить("ПортОтправления", ?(ЕстьСтавкиФрахт, СтрокаПортОтправления, Справочники.Локации.ПустаяСсылка()));
								СтруктураПоиска.Вставить("ПортНазначения", ?(ЕстьСтавкиФрахт, СтрокаПортНазначения, Справочники.Локации.ПустаяСсылка()));
								СтруктураПоиска.Вставить("ПортОтгрузки", ?(ЕстьСтавкиФрахт, СтрокаПортОтгрузки, Справочники.Локации.ПустаяСсылка()));
								
								ПринадлежностьСтрокой = ?(СтрокаСтавок.SOCCOC = Перечисления.ПринадлежностьТЕ.КТЕвросиба, "COC", "SOC");
								
								Если ЗначениеЗаполнено(СтрокаСтавок.Ставка20Фрахт) И СтруктураПараметров.ЕстьФрахт Тогда
									
									ИмяКолонки = "Ставка20Фрахт" + ПринадлежностьСтрокой;
									МассивИтераций = ПолучитьИтерацииДляСлияния(СтруктураПоиска, ИмяКолонки);
									Если МассивИтераций.Количество() = 0 Тогда
										МассивИтераций.Добавить(ПоследняяИтерация + 1);
									КонецЕсли;
									
									НайденныйПараметрПеревозки = Справочники.ПараметрыПеревозки.НайтиПараметрПеревозки(Справочники.РазмерыКТК.К20, СтрокаСтавок.SOCCOC, СтрокаСтавок.ВалютаФрахт, Перечисления.ВидыТранспортныхСообщений.Море);
									
									Если ЗначениеЗаполнено(НайденныйПараметрПеревозки) Тогда
										Для Каждого ТекИтерация Из МассивИтераций Цикл
											
											ОтборБД = Новый Структура;
											Для Каждого ЭлементОтбора Из СтруктураПоиска Цикл
												ОтборБД.Вставить(ЭлементОтбора.Ключ, ЭлементОтбора.Значение);
											КонецЦикла;
											ОтборБД.Вставить("ПараметрПеревозки", НайденныйПараметрПеревозки);
											ОтборБД.Вставить("ИтерацияДобавления", ТекИтерация);
											
											НайденныеВБД = Объект.СпециальныеСтавки.НайтиСтроки(ОтборБД);
											Если НайденныеВБД.Количество() > 0 Тогда
												СтрокаТаблицыСпецСтавки = НайденныеВБД[0];
											Иначе
												СтрокаТаблицыСпецСтавки = Объект.СпециальныеСтавки.Добавить();
												СтрокаТаблицыСпецСтавки.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
												СтрокаТаблицыСпецСтавки.ИтерацияДобавления = ТекИтерация;
											КонецЕсли;
											
											СтрокаТаблицыСпецСтавки.Контрагент = СтрокаКонтрагенты;
											СтрокаТаблицыСпецСтавки.ТипСтавки = Перечисления.ТипыСтавок.СпециальнаяСтавка;
											СтрокаТаблицыСпецСтавки.ПлановыйОбъемTEU = Объект.ПлановыйОбъемTEU;
											Если ЕстьСтавкиЖД Тогда
												СтрокаТаблицыСпецСтавки.ПунктОтправления = СтрокаПунктОтправленияЖД;
												СтрокаТаблицыСпецСтавки.ПунктНазначения = СтрокаПунктНазначенияЖД;
												СтрокаТаблицыСпецСтавки.УсловияПеревозкиОтправление = Объект.УсловияПеревозкиОтправление;
												СтрокаТаблицыСпецСтавки.УсловияПеревозкиПрибытие = Объект.УсловияПеревозкиПрибытие;
											КонецЕсли;
											СтрокаТаблицыСпецСтавки.ПортОтправления = СтрокаПортОтправления;
											СтрокаТаблицыСпецСтавки.ПортОтгрузки = СтрокаПортОтгрузки;
											СтрокаТаблицыСпецСтавки.ПортНазначения = СтрокаПортНазначения;
											СтрокаТаблицыСпецСтавки.Ставка = СтрокаСтавок.Ставка20Фрахт;
											СтрокаТаблицыСпецСтавки.ПараметрПеревозки = НайденныйПараметрПеревозки;
											СтрокаТаблицыСпецСтавки.УсловияПогрузки = Объект.УсловияПогрузки;
											СтрокаТаблицыСпецСтавки.УсловияВыгрузки = Объект.УсловияВыгрузки;
											СтрокаТаблицыСпецСтавки.СуммаВключаетНДС = Объект.СуммаВключаетНДС;
											СтрокаТаблицыСпецСтавки.СтавкаНДС = Объект.СтавкаНДС;
										КонецЦикла;
									КонецЕсли;
								КонецЕсли;
								
								Если ЗначениеЗаполнено(СтрокаСтавок.Ставка40Фрахт) И СтруктураПараметров.ЕстьФрахт Тогда
									
									ИмяКолонки = "Ставка40Фрахт" + ПринадлежностьСтрокой;
									МассивИтераций = ПолучитьИтерацииДляСлияния(СтруктураПоиска, ИмяКолонки);
									Если МассивИтераций.Количество() = 0 Тогда
										МассивИтераций.Добавить(ПоследняяИтерация + 1);
									КонецЕсли;
									
									НайденныйПараметрПеревозки = Справочники.ПараметрыПеревозки.НайтиПараметрПеревозки(Справочники.РазмерыКТК.К40, СтрокаСтавок.SOCCOC, СтрокаСтавок.ВалютаФрахт, Перечисления.ВидыТранспортныхСообщений.Море);
									
									Если ЗначениеЗаполнено(НайденныйПараметрПеревозки) Тогда
										Для Каждого ТекИтерация Из МассивИтераций Цикл
											
											ОтборБД = Новый Структура;
											Для Каждого ЭлементОтбора Из СтруктураПоиска Цикл
												ОтборБД.Вставить(ЭлементОтбора.Ключ, ЭлементОтбора.Значение);
											КонецЦикла;
											ОтборБД.Вставить("ПараметрПеревозки", НайденныйПараметрПеревозки);
											ОтборБД.Вставить("ИтерацияДобавления", ТекИтерация);
											
											НайденныеВБД = Объект.СпециальныеСтавки.НайтиСтроки(ОтборБД);
											Если НайденныеВБД.Количество() > 0 Тогда
												СтрокаТаблицыСпецСтавки = НайденныеВБД[0];
											Иначе
												СтрокаТаблицыСпецСтавки = Объект.СпециальныеСтавки.Добавить();
												СтрокаТаблицыСпецСтавки.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
												СтрокаТаблицыСпецСтавки.ИтерацияДобавления = ТекИтерация;
											КонецЕсли;
											
											СтрокаТаблицыСпецСтавки.Контрагент = СтрокаКонтрагенты;
											СтрокаТаблицыСпецСтавки.ТипСтавки = Перечисления.ТипыСтавок.СпециальнаяСтавка;
											СтрокаТаблицыСпецСтавки.ПлановыйОбъемTEU = Объект.ПлановыйОбъемTEU;
											Если ЕстьСтавкиЖД Тогда
												СтрокаТаблицыСпецСтавки.ПунктОтправления = СтрокаПунктОтправленияЖД;
												СтрокаТаблицыСпецСтавки.ПунктНазначения = СтрокаПунктНазначенияЖД;
												СтрокаТаблицыСпецСтавки.УсловияПеревозкиОтправление = Объект.УсловияПеревозкиОтправление;
												СтрокаТаблицыСпецСтавки.УсловияПеревозкиПрибытие = Объект.УсловияПеревозкиПрибытие;
											КонецЕсли;
											СтрокаТаблицыСпецСтавки.ПортОтправления = СтрокаПортОтправления;
											СтрокаТаблицыСпецСтавки.ПортОтгрузки = СтрокаПортОтгрузки;
											СтрокаТаблицыСпецСтавки.ПортНазначения = СтрокаПортНазначения;
											СтрокаТаблицыСпецСтавки.Ставка = СтрокаСтавок.Ставка40Фрахт;
											СтрокаТаблицыСпецСтавки.ПараметрПеревозки = НайденныйПараметрПеревозки;
											СтрокаТаблицыСпецСтавки.УсловияПогрузки = Объект.УсловияПогрузки;
											СтрокаТаблицыСпецСтавки.УсловияВыгрузки = Объект.УсловияВыгрузки;
											СтрокаТаблицыСпецСтавки.СуммаВключаетНДС = Объект.СуммаВключаетНДС;
											СтрокаТаблицыСпецСтавки.СтавкаНДС = Объект.СтавкаНДС;
										КонецЦикла;
									КонецЕсли;
								КонецЕсли;
								
								Если ЗначениеЗаполнено(СтрокаСтавок.Ставка20ЖД) И СтруктураПараметров.ЕстьЖД Тогда
									
									ИмяКолонки = "Ставка20ЖД" + ПринадлежностьСтрокой;
									МассивИтераций = ПолучитьИтерацииДляСлияния(СтруктураПоиска, ИмяКолонки);
									Если МассивИтераций.Количество() = 0 Тогда
										МассивИтераций.Добавить(ПоследняяИтерация + 1);
									КонецЕсли;
									
									НайденныйПараметрПеревозки = Справочники.ПараметрыПеревозки.НайтиПараметрПеревозки(Справочники.РазмерыКТК.К20, СтрокаСтавок.SOCCOC, СтрокаСтавок.ВалютаЖД, Перечисления.ВидыТранспортныхСообщений.ЖД);
									
									Если ЗначениеЗаполнено(НайденныйПараметрПеревозки) Тогда
										Для Каждого ТекИтерация Из МассивИтераций Цикл
											
											ОтборБД = Новый Структура;
											Для Каждого ЭлементОтбора Из СтруктураПоиска Цикл
												ОтборБД.Вставить(ЭлементОтбора.Ключ, ЭлементОтбора.Значение);
											КонецЦикла;
											ОтборБД.Вставить("ПараметрПеревозки", НайденныйПараметрПеревозки);
											ОтборБД.Вставить("ИтерацияДобавления", ТекИтерация);
											
											НайденныеВБД = Объект.СпециальныеСтавки.НайтиСтроки(ОтборБД);
											Если НайденныеВБД.Количество() > 0 Тогда
												СтрокаТаблицыСпецСтавки = НайденныеВБД[0];
											Иначе
												СтрокаТаблицыСпецСтавки = Объект.СпециальныеСтавки.Добавить();
												СтрокаТаблицыСпецСтавки.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
												СтрокаТаблицыСпецСтавки.ИтерацияДобавления = ТекИтерация;
											КонецЕсли;
											
											СтрокаТаблицыСпецСтавки.Контрагент = СтрокаКонтрагенты;
											СтрокаТаблицыСпецСтавки.ТипСтавки = Перечисления.ТипыСтавок.СпециальнаяСтавка;
											СтрокаТаблицыСпецСтавки.ПлановыйОбъемTEU = Объект.ПлановыйОбъемTEU;
											СтрокаТаблицыСпецСтавки.ПунктОтправления = СтрокаПунктОтправленияЖД;
											СтрокаТаблицыСпецСтавки.ПунктНазначения = СтрокаПунктНазначенияЖД;
											Если ЕстьСтавкиФрахт Тогда
												СтрокаТаблицыСпецСтавки.ПортОтправления = СтрокаПортОтправления;
												СтрокаТаблицыСпецСтавки.ПортОтгрузки = СтрокаПортОтгрузки;
												СтрокаТаблицыСпецСтавки.ПортНазначения = СтрокаПортНазначения;
												СтрокаТаблицыСпецСтавки.УсловияПогрузки = Объект.УсловияПогрузки;
												СтрокаТаблицыСпецСтавки.УсловияВыгрузки = Объект.УсловияВыгрузки;
											КонецЕсли;
											СтрокаТаблицыСпецСтавки.Ставка = СтрокаСтавок.Ставка20ЖД;
											СтрокаТаблицыСпецСтавки.ПараметрПеревозки = НайденныйПараметрПеревозки;
											СтрокаТаблицыСпецСтавки.УсловияПеревозкиОтправление = Объект.УсловияПеревозкиОтправление;
											СтрокаТаблицыСпецСтавки.УсловияПеревозкиПрибытие = Объект.УсловияПеревозкиПрибытие;
											СтрокаТаблицыСпецСтавки.СуммаВключаетНДС = Объект.СуммаВключаетНДС;
											СтрокаТаблицыСпецСтавки.СтавкаНДС = Объект.СтавкаНДС;
										КонецЦикла;
									КонецЕсли;
								КонецЕсли;
								
								Если ЗначениеЗаполнено(СтрокаСтавок.Ставка40ЖД) И СтруктураПараметров.ЕстьЖД Тогда
									
									ИмяКолонки = "Ставка40ЖД" + ПринадлежностьСтрокой;
									МассивИтераций = ПолучитьИтерацииДляСлияния(СтруктураПоиска, ИмяКолонки);
									Если МассивИтераций.Количество() = 0 Тогда
										МассивИтераций.Добавить(ПоследняяИтерация + 1);
									КонецЕсли;
									
									НайденныйПараметрПеревозки = Справочники.ПараметрыПеревозки.НайтиПараметрПеревозки(Справочники.РазмерыКТК.К40, СтрокаСтавок.SOCCOC, СтрокаСтавок.ВалютаЖД, Перечисления.ВидыТранспортныхСообщений.ЖД);
									
									Если ЗначениеЗаполнено(НайденныйПараметрПеревозки) Тогда
										Для Каждого ТекИтерация Из МассивИтераций Цикл
											
											ОтборБД = Новый Структура;
											Для Каждого ЭлементОтбора Из СтруктураПоиска Цикл
												ОтборБД.Вставить(ЭлементОтбора.Ключ, ЭлементОтбора.Значение);
											КонецЦикла;
											ОтборБД.Вставить("ПараметрПеревозки", НайденныйПараметрПеревозки);
											ОтборБД.Вставить("ИтерацияДобавления", ТекИтерация);
											
											НайденныеВБД = Объект.СпециальныеСтавки.НайтиСтроки(ОтборБД);
											Если НайденныеВБД.Количество() > 0 Тогда
												СтрокаТаблицыСпецСтавки = НайденныеВБД[0];
											Иначе
												СтрокаТаблицыСпецСтавки = Объект.СпециальныеСтавки.Добавить();
												СтрокаТаблицыСпецСтавки.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
												СтрокаТаблицыСпецСтавки.ИтерацияДобавления = ТекИтерация;
											КонецЕсли;
											
											СтрокаТаблицыСпецСтавки.Контрагент = СтрокаКонтрагенты;
											СтрокаТаблицыСпецСтавки.ТипСтавки = Перечисления.ТипыСтавок.СпециальнаяСтавка;
											СтрокаТаблицыСпецСтавки.ПлановыйОбъемTEU = Объект.ПлановыйОбъемTEU;
											СтрокаТаблицыСпецСтавки.ПунктОтправления = СтрокаПунктОтправленияЖД;
											СтрокаТаблицыСпецСтавки.ПунктНазначения = СтрокаПунктНазначенияЖД;
											Если ЕстьСтавкиФрахт Тогда
												СтрокаТаблицыСпецСтавки.ПортОтправления = СтрокаПортОтправления;
												СтрокаТаблицыСпецСтавки.ПортОтгрузки = СтрокаПортОтгрузки;
												СтрокаТаблицыСпецСтавки.ПортНазначения = СтрокаПортНазначения;
												СтрокаТаблицыСпецСтавки.УсловияПогрузки = Объект.УсловияПогрузки;
												СтрокаТаблицыСпецСтавки.УсловияВыгрузки = Объект.УсловияВыгрузки;
											КонецЕсли;
											СтрокаТаблицыСпецСтавки.Ставка = СтрокаСтавок.Ставка40ЖД;
											СтрокаТаблицыСпецСтавки.ПараметрПеревозки = НайденныйПараметрПеревозки;
											СтрокаТаблицыСпецСтавки.УсловияПеревозкиОтправление = Объект.УсловияПеревозкиОтправление;
											СтрокаТаблицыСпецСтавки.УсловияПеревозкиПрибытие = Объект.УсловияПеревозкиПрибытие;
											СтрокаТаблицыСпецСтавки.СуммаВключаетНДС = Объект.СуммаВключаетНДС;
											СтрокаТаблицыСпецСтавки.СтавкаНДС = Объект.СтавкаНДС;
										КонецЦикла;
									КонецЕсли;
								КонецЕсли;
								
							КонецЦикла; // Ставки
						КонецЦикла; // ПортНазначения
					КонецЦикла; // ПортОтгрузки
				КонецЦикла; // ПортОтправления
			КонецЦикла; // ПунктНазначения
		КонецЦикла; // ПунктОтправления
	КонецЦикла; // Контрагенты
	
	АктуализироватьКалькуляции();
	
КонецПроцедуры

&НаСервере
Процедура ВвестиНадбавкиСкидкиНаСервере()
	
	Отказ = ПроверитьЗаполненностьСтавокНадбавокСкидок();
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если НадбавкиСкидки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = СтруктураПараметровПеревозкиКЗаполнению();
	
	Для Каждого СтрокаКонтрагенты Из СтруктураПараметров.МассивКонтрагентов Цикл
		Для Каждого СтрокаПунктОтправленияЖД Из СтруктураПараметров.МассивОтправленийЖД Цикл
			Для Каждого СтрокаПунктНазначенияЖД Из СтруктураПараметров.МассивНазначенийЖД Цикл
				Для Каждого СтрокаПортОтправления Из СтруктураПараметров.МассивОтправленийФрахт Цикл
					Для Каждого СтрокаПортОтгрузки Из СтруктураПараметров.МассивОтгрузокФрахт Цикл
						Для Каждого СтрокаПортНазначения Из СтруктураПараметров.МассивНазначенийФрахт Цикл
							
							ПоследняяИтерация = НайтиПоследнююИтерацию();
							
							Для Каждого СтрокаНадбавкиСкидки Из НадбавкиСкидки Цикл
								
								ЕстьСтавкиФрахт = ЗначениеЗаполнено(СтрокаНадбавкиСкидки.Ставка20Фрахт) Или ЗначениеЗаполнено(СтрокаНадбавкиСкидки.Ставка40Фрахт);
								ЕстьСтавкиЖД = ЗначениеЗаполнено(СтрокаНадбавкиСкидки.Ставка20ЖД) Или ЗначениеЗаполнено(СтрокаНадбавкиСкидки.Ставка40ЖД);
								
								Если (Не ЕстьСтавкиЖД) И (СтрокаПунктОтправленияЖД <> СтруктураПараметров.МассивОтправленийЖД[0] 
									Или СтрокаПунктНазначенияЖД <> СтруктураПараметров.МассивНазначенийЖД[0]) Тогда
									Продолжить;
								КонецЕсли;
								
								Если (Не ЕстьСтавкиФрахт) И (СтрокаПортОтправления <> СтруктураПараметров.МассивОтправленийФрахт[0] 
									Или СтрокаПортОтгрузки <> СтруктураПараметров.МассивОтгрузокФрахт[0] 
									Или СтрокаПортНазначения <> СтруктураПараметров.МассивНазначенийФрахт[0]) Тогда
									Продолжить;
								КонецЕсли;
								
								СтруктураПоиска = Новый Структура;
								СтруктураПоиска.Вставить("Контрагент", СтрокаКонтрагенты);
								СтруктураПоиска.Вставить("ПлановыйОбъемTEU", Объект.ПлановыйОбъемTEU);
								СтруктураПоиска.Вставить("ПунктОтправления", ?(ЕстьСтавкиЖД, СтрокаПунктОтправленияЖД, Справочники.Локации.ПустаяСсылка()));
								СтруктураПоиска.Вставить("ПунктНазначения", ?(ЕстьСтавкиЖД, СтрокаПунктНазначенияЖД, Справочники.Локации.ПустаяСсылка()));
								СтруктураПоиска.Вставить("ПортОтправления", ?(ЕстьСтавкиФрахт, СтрокаПортОтправления, Справочники.Локации.ПустаяСсылка()));
								СтруктураПоиска.Вставить("ПортНазначения", ?(ЕстьСтавкиФрахт, СтрокаПортНазначения, Справочники.Локации.ПустаяСсылка()));
								СтруктураПоиска.Вставить("ПортОтгрузки", ?(ЕстьСтавкиФрахт, СтрокаПортОтгрузки, Справочники.Локации.ПустаяСсылка()));
								
								ПринадлежностьСтрокой = ?(СтрокаНадбавкиСкидки.SOCCOC = Перечисления.ПринадлежностьТЕ.КТЕвросиба, "COC", "SOC");
								
								Если ЗначениеЗаполнено(СтрокаНадбавкиСкидки.Ставка20Фрахт) И СтруктураПараметров.ЕстьФрахт Тогда
									
									ТекущийТипСтавки = ?(СтрокаНадбавкиСкидки.Ставка20Фрахт < 0, Перечисления.ТипыСтавок.Скидка, Перечисления.ТипыСтавок.Надбавка);
									СтруктураПоиска.Вставить("ТипСтавки", ТекущийТипСтавки);
									
									ИмяКолонки = "НадбавкаСкидка20Фрахт" + ПринадлежностьСтрокой;
									МассивИтераций = ПолучитьИтерацииДляСлияния(СтруктураПоиска, ИмяКолонки);
									Если МассивИтераций.Количество() = 0 Тогда
										МассивИтераций.Добавить(ПоследняяИтерация + 1);
									КонецЕсли;
									
									НайденныйПараметрПеревозки = Справочники.ПараметрыПеревозки.НайтиПараметрПеревозки(Справочники.РазмерыКТК.К20, СтрокаНадбавкиСкидки.SOCCOC, СтрокаНадбавкиСкидки.ВалютаФрахт, Перечисления.ВидыТранспортныхСообщений.Море);
									
									Если ЗначениеЗаполнено(НайденныйПараметрПеревозки) Тогда
										Для Каждого ТекИтерация Из МассивИтераций Цикл
											
											ОтборБД = Новый Структура;
											Для Каждого ЭлементОтбора Из СтруктураПоиска Цикл
												ОтборБД.Вставить(ЭлементОтбора.Ключ, ЭлементОтбора.Значение);
											КонецЦикла;
											ОтборБД.Вставить("ПараметрПеревозки", НайденныйПараметрПеревозки);
											ОтборБД.Вставить("ИтерацияДобавления", ТекИтерация);
											
											НайденныеВБД = Объект.СпециальныеСтавки.НайтиСтроки(ОтборБД);
											Если НайденныеВБД.Количество() > 0 Тогда
												СтрокаТаблицыСпецСтавки = НайденныеВБД[0];
											Иначе
												СтрокаТаблицыСпецСтавки = Объект.СпециальныеСтавки.Добавить();
												СтрокаТаблицыСпецСтавки.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
												СтрокаТаблицыСпецСтавки.ИтерацияДобавления = ТекИтерация;
											КонецЕсли;
											
											СтрокаТаблицыСпецСтавки.Контрагент = СтрокаКонтрагенты;
											СтрокаТаблицыСпецСтавки.ТипСтавки = ТекущийТипСтавки;
											СтрокаТаблицыСпецСтавки.ПлановыйОбъемTEU = Объект.ПлановыйОбъемTEU;
											Если ЕстьСтавкиЖД Тогда
												СтрокаТаблицыСпецСтавки.ПунктОтправления = СтрокаПунктОтправленияЖД;
												СтрокаТаблицыСпецСтавки.ПунктНазначения = СтрокаПунктНазначенияЖД;
												СтрокаТаблицыСпецСтавки.УсловияПеревозкиОтправление = Объект.УсловияПеревозкиОтправление;
												СтрокаТаблицыСпецСтавки.УсловияПеревозкиПрибытие = Объект.УсловияПеревозкиПрибытие;
											КонецЕсли;
											СтрокаТаблицыСпецСтавки.ПортОтправления = СтрокаПортОтправления;
											СтрокаТаблицыСпецСтавки.ПортОтгрузки = СтрокаПортОтгрузки;
											СтрокаТаблицыСпецСтавки.ПортНазначения = СтрокаПортНазначения;
											СтрокаТаблицыСпецСтавки.НадбавкаСкидка = СтрокаНадбавкиСкидки.Ставка20Фрахт;
											СтрокаТаблицыСпецСтавки.ПараметрПеревозки = НайденныйПараметрПеревозки;
											СтрокаТаблицыСпецСтавки.УсловияПогрузки = Объект.УсловияПогрузки;
											СтрокаТаблицыСпецСтавки.УсловияВыгрузки = Объект.УсловияВыгрузки;
											СтрокаТаблицыСпецСтавки.ЭтоПроцентОтСуммы = Объект.ФорматНадбавкиСкидки;
										КонецЦикла;
									КонецЕсли;
								КонецЕсли;
								
								Если ЗначениеЗаполнено(СтрокаНадбавкиСкидки.Ставка40Фрахт) И СтруктураПараметров.ЕстьФрахт Тогда
									
									ТекущийТипСтавки = ?(СтрокаНадбавкиСкидки.Ставка40Фрахт < 0, Перечисления.ТипыСтавок.Скидка, Перечисления.ТипыСтавок.Надбавка);
									СтруктураПоиска.Вставить("ТипСтавки", ТекущийТипСтавки);
									
									ИмяКолонки = "НадбавкаСкидка40Фрахт" + ПринадлежностьСтрокой;
									МассивИтераций = ПолучитьИтерацииДляСлияния(СтруктураПоиска, ИмяКолонки);
									Если МассивИтераций.Количество() = 0 Тогда
										МассивИтераций.Добавить(ПоследняяИтерация + 1);
									КонецЕсли;
									
									НайденныйПараметрПеревозки = Справочники.ПараметрыПеревозки.НайтиПараметрПеревозки(Справочники.РазмерыКТК.К40, СтрокаНадбавкиСкидки.SOCCOC, СтрокаНадбавкиСкидки.ВалютаФрахт, Перечисления.ВидыТранспортныхСообщений.Море);
									
									Если ЗначениеЗаполнено(НайденныйПараметрПеревозки) Тогда
										Для Каждого ТекИтерация Из МассивИтераций Цикл
											
											ОтборБД = Новый Структура;
											Для Каждого ЭлементОтбора Из СтруктураПоиска Цикл
												ОтборБД.Вставить(ЭлементОтбора.Ключ, ЭлементОтбора.Значение);
											КонецЦикла;
											ОтборБД.Вставить("ПараметрПеревозки", НайденныйПараметрПеревозки);
											ОтборБД.Вставить("ИтерацияДобавления", ТекИтерация);
											
											НайденныеВБД = Объект.СпециальныеСтавки.НайтиСтроки(ОтборБД);
											Если НайденныеВБД.Количество() > 0 Тогда
												СтрокаТаблицыСпецСтавки = НайденныеВБД[0];
											Иначе
												СтрокаТаблицыСпецСтавки = Объект.СпециальныеСтавки.Добавить();
												СтрокаТаблицыСпецСтавки.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
												СтрокаТаблицыСпецСтавки.ИтерацияДобавления = ТекИтерация;
											КонецЕсли;
											
											СтрокаТаблицыСпецСтавки.Контрагент = СтрокаКонтрагенты;
											СтрокаТаблицыСпецСтавки.ТипСтавки = ТекущийТипСтавки;
											СтрокаТаблицыСпецСтавки.ПлановыйОбъемTEU = Объект.ПлановыйОбъемTEU;
											Если ЕстьСтавкиЖД Тогда
												СтрокаТаблицыСпецСтавки.ПунктОтправления = СтрокаПунктОтправленияЖД;
												СтрокаТаблицыСпецСтавки.ПунктНазначения = СтрокаПунктНазначенияЖД;
												СтрокаТаблицыСпецСтавки.УсловияПеревозкиОтправление = Объект.УсловияПеревозкиОтправление;
												СтрокаТаблицыСпецСтавки.УсловияПеревозкиПрибытие = Объект.УсловияПеревозкиПрибытие;
											КонецЕсли;
											СтрокаТаблицыСпецСтавки.ПортОтправления = СтрокаПортОтправления;
											СтрокаТаблицыСпецСтавки.ПортОтгрузки = СтрокаПортОтгрузки;
											СтрокаТаблицыСпецСтавки.ПортНазначения = СтрокаПортНазначения;
											СтрокаТаблицыСпецСтавки.НадбавкаСкидка = СтрокаНадбавкиСкидки.Ставка40Фрахт;
											СтрокаТаблицыСпецСтавки.ПараметрПеревозки = НайденныйПараметрПеревозки;
											СтрокаТаблицыСпецСтавки.УсловияПогрузки = Объект.УсловияПогрузки;
											СтрокаТаблицыСпецСтавки.УсловияВыгрузки = Объект.УсловияВыгрузки;
											СтрокаТаблицыСпецСтавки.ЭтоПроцентОтСуммы = Объект.ФорматНадбавкиСкидки;
										КонецЦикла;
									КонецЕсли;
								КонецЕсли;
								
								Если ЗначениеЗаполнено(СтрокаНадбавкиСкидки.Ставка20ЖД) И СтруктураПараметров.ЕстьЖД Тогда
									
									ТекущийТипСтавки = ?(СтрокаНадбавкиСкидки.Ставка20ЖД < 0, Перечисления.ТипыСтавок.Скидка, Перечисления.ТипыСтавок.Надбавка);
									СтруктураПоиска.Вставить("ТипСтавки", ТекущийТипСтавки);
									
									ИмяКолонки = "НадбавкаСкидка20ЖД" + ПринадлежностьСтрокой;
									МассивИтераций = ПолучитьИтерацииДляСлияния(СтруктураПоиска, ИмяКолонки);
									Если МассивИтераций.Количество() = 0 Тогда
										МассивИтераций.Добавить(ПоследняяИтерация + 1);
									КонецЕсли;
									
									НайденныйПараметрПеревозки = Справочники.ПараметрыПеревозки.НайтиПараметрПеревозки(Справочники.РазмерыКТК.К20, СтрокаНадбавкиСкидки.SOCCOC, СтрокаНадбавкиСкидки.ВалютаЖД, Перечисления.ВидыТранспортныхСообщений.ЖД);
									
									Если ЗначениеЗаполнено(НайденныйПараметрПеревозки) Тогда
										Для Каждого ТекИтерация Из МассивИтераций Цикл
											
											ОтборБД = Новый Структура;
											Для Каждого ЭлементОтбора Из СтруктураПоиска Цикл
												ОтборБД.Вставить(ЭлементОтбора.Ключ, ЭлементОтбора.Значение);
											КонецЦикла;
											ОтборБД.Вставить("ПараметрПеревозки", НайденныйПараметрПеревозки);
											ОтборБД.Вставить("ИтерацияДобавления", ТекИтерация);
											
											НайденныеВБД = Объект.СпециальныеСтавки.НайтиСтроки(ОтборБД);
											Если НайденныеВБД.Количество() > 0 Тогда
												СтрокаТаблицыСпецСтавки = НайденныеВБД[0];
											Иначе
												СтрокаТаблицыСпецСтавки = Объект.СпециальныеСтавки.Добавить();
												СтрокаТаблицыСпецСтавки.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
												СтрокаТаблицыСпецСтавки.ИтерацияДобавления = ТекИтерация;
											КонецЕсли;
											
											СтрокаТаблицыСпецСтавки.Контрагент = СтрокаКонтрагенты;
											СтрокаТаблицыСпецСтавки.ТипСтавки = ТекущийТипСтавки;
											СтрокаТаблицыСпецСтавки.ПлановыйОбъемTEU = Объект.ПлановыйОбъемTEU;
											СтрокаТаблицыСпецСтавки.ПунктОтправления = СтрокаПунктОтправленияЖД;
											СтрокаТаблицыСпецСтавки.ПунктНазначения = СтрокаПунктНазначенияЖД;
											Если ЕстьСтавкиФрахт Тогда
												СтрокаТаблицыСпецСтавки.ПортОтправления = СтрокаПортОтправления;
												СтрокаТаблицыСпецСтавки.ПортОтгрузки = СтрокаПортОтгрузки;
												СтрокаТаблицыСпецСтавки.ПортНазначения = СтрокаПортНазначения;
												СтрокаТаблицыСпецСтавки.УсловияПогрузки = Объект.УсловияПогрузки;
												СтрокаТаблицыСпецСтавки.УсловияВыгрузки = Объект.УсловияВыгрузки;
											КонецЕсли;
											СтрокаТаблицыСпецСтавки.НадбавкаСкидка = СтрокаНадбавкиСкидки.Ставка20ЖД;
											СтрокаТаблицыСпецСтавки.ПараметрПеревозки = НайденныйПараметрПеревозки;
											СтрокаТаблицыСпецСтавки.УсловияПеревозкиОтправление = Объект.УсловияПеревозкиОтправление;
											СтрокаТаблицыСпецСтавки.УсловияПеревозкиПрибытие = Объект.УсловияПеревозкиПрибытие;
											СтрокаТаблицыСпецСтавки.ЭтоПроцентОтСуммы = Объект.ФорматНадбавкиСкидки;
										КонецЦикла;
									КонецЕсли;
								КонецЕсли;
								
								Если ЗначениеЗаполнено(СтрокаНадбавкиСкидки.Ставка40ЖД) И СтруктураПараметров.ЕстьЖД Тогда
									
									ТекущийТипСтавки = ?(СтрокаНадбавкиСкидки.Ставка40ЖД < 0, Перечисления.ТипыСтавок.Скидка, Перечисления.ТипыСтавок.Надбавка);
									СтруктураПоиска.Вставить("ТипСтавки", ТекущийТипСтавки);
									
									ИмяКолонки = "НадбавкаСкидка40ЖД" + ПринадлежностьСтрокой;
									МассивИтераций = ПолучитьИтерацииДляСлияния(СтруктураПоиска, ИмяКолонки);
									Если МассивИтераций.Количество() = 0 Тогда
										МассивИтераций.Добавить(ПоследняяИтерация + 1);
									КонецЕсли;
									
									НайденныйПараметрПеревозки = Справочники.ПараметрыПеревозки.НайтиПараметрПеревозки(Справочники.РазмерыКТК.К40, СтрокаНадбавкиСкидки.SOCCOC, СтрокаНадбавкиСкидки.ВалютаЖД, Перечисления.ВидыТранспортныхСообщений.ЖД);
									
									Если ЗначениеЗаполнено(НайденныйПараметрПеревозки) Тогда
										Для Каждого ТекИтерация Из МассивИтераций Цикл
											
											ОтборБД = Новый Структура;
											Для Каждого ЭлементОтбора Из СтруктураПоиска Цикл
												ОтборБД.Вставить(ЭлементОтбора.Ключ, ЭлементОтбора.Значение);
											КонецЦикла;
											ОтборБД.Вставить("ПараметрПеревозки", НайденныйПараметрПеревозки);
											ОтборБД.Вставить("ИтерацияДобавления", ТекИтерация);
											
											НайденныеВБД = Объект.СпециальныеСтавки.НайтиСтроки(ОтборБД);
											Если НайденныеВБД.Количество() > 0 Тогда
												СтрокаТаблицыСпецСтавки = НайденныеВБД[0];
											Иначе
												СтрокаТаблицыСпецСтавки = Объект.СпециальныеСтавки.Добавить();
												СтрокаТаблицыСпецСтавки.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
												СтрокаТаблицыСпецСтавки.ИтерацияДобавления = ТекИтерация;
											КонецЕсли;
											
											СтрокаТаблицыСпецСтавки.Контрагент = СтрокаКонтрагенты;
											СтрокаТаблицыСпецСтавки.ТипСтавки = ТекущийТипСтавки;
											СтрокаТаблицыСпецСтавки.ПлановыйОбъемTEU = Объект.ПлановыйОбъемTEU;
											СтрокаТаблицыСпецСтавки.ПунктОтправления = СтрокаПунктОтправленияЖД;
											СтрокаТаблицыСпецСтавки.ПунктНазначения = СтрокаПунктНазначенияЖД;
											Если ЕстьСтавкиФрахт Тогда
												СтрокаТаблицыСпецСтавки.ПортОтправления = СтрокаПортОтправления;
												СтрокаТаблицыСпецСтавки.ПортОтгрузки = СтрокаПортОтгрузки;
												СтрокаТаблицыСпецСтавки.ПортНазначения = СтрокаПортНазначения;
												СтрокаТаблицыСпецСтавки.УсловияПогрузки = Объект.УсловияПогрузки;
												СтрокаТаблицыСпецСтавки.УсловияВыгрузки = Объект.УсловияВыгрузки;
											КонецЕсли;
											СтрокаТаблицыСпецСтавки.НадбавкаСкидка = СтрокаНадбавкиСкидки.Ставка40ЖД;
											СтрокаТаблицыСпецСтавки.ПараметрПеревозки = НайденныйПараметрПеревозки;
											СтрокаТаблицыСпецСтавки.УсловияПеревозкиОтправление = Объект.УсловияПеревозкиОтправление;
											СтрокаТаблицыСпецСтавки.УсловияПеревозкиПрибытие = Объект.УсловияПеревозкиПрибытие;
											СтрокаТаблицыСпецСтавки.ЭтоПроцентОтСуммы = Объект.ФорматНадбавкиСкидки;
										КонецЦикла;
									КонецЕсли;
								КонецЕсли;
								
							КонецЦикла; // НадбавкиСкидки
						КонецЦикла; // ПортНазначения
					КонецЦикла; // ПортОтгрузки
				КонецЦикла; // ПортОтправления
			КонецЦикла; // ПунктНазначения
		КонецЦикла; // ПунктОтправления
	КонецЦикла; // Контрагенты
	
КонецПроцедуры

