
Процедура ПриЗаписи(Отказ, Замещение)
	
	Для каждого Стр из ЭтотОбъект Цикл
		
		Если Стр.РазрешенаКорректировка = Ложь И Стр.РазрешеноИсправление = Ложь Тогда 
			АннулироватьЗадачуНаРТУ(Стр.ОбъектКорректировки);
		Иначе
			СоздатьЗадачуНаРТУ(Стр.ОбъектКорректировки);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура АннулироватьЗадачуНаРТУ(РТУ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗапланированноеВзаимодействие.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЗапланированноеВзаимодействие КАК ЗапланированноеВзаимодействие
	               |ГДЕ
	               |	ЗапланированноеВзаимодействие.ПометкаУдаления = ЛОЖЬ
	               |	И ЗапланированноеВзаимодействие.УдалитьПредмет = &УдалитьПредмет";
	Запрос.УстановитьПараметр("УдалитьПредмет", РТУ);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		ВзаимодействиеОбъект = Ответ.Ссылка.ПолучитьОбъект();
		ВзаимодействиеОбъект.Статус = Перечисления.СтатусыЭтапов.Выполнен;
		ВзаимодействиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьЗадачуНаРТУ(РТУ)
	
	ВзО = Документы.ЗапланированноеВзаимодействие.СоздатьДокумент();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗапланированноеВзаимодействие.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЗапланированноеВзаимодействие КАК ЗапланированноеВзаимодействие
	               |ГДЕ
	               |	ЗапланированноеВзаимодействие.УдалитьПредмет = &УдалитьПредмет";
	Запрос.УстановитьПараметр("УдалитьПредмет", РТУ);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		
		ВзО = Ответ.Ссылка.ПолучитьОбъект();
		
	КонецЕсли;
	
	ВзО.ПометкаУдаления = Ложь;
	ВзО.Участники.Очистить();
	ВзО.Автор = Пользователи.ТекущийПользователь();
	ВзО.Важность = Перечисления.ВариантыВажностиВзаимодействия.Обычная;
	
	ВзО.ДатаНачала = ТекущаяДата();
	ВзО.ДатаОкончания = ТекущаяДата()+24*3600;
	
	ВзО.Описание = "Необходимо оформить корректировку РТУ по документу: " + РТУ;
	ОтвИсполнитель = РТУ.Автор;
	Если ВзО.Участники.НайтиСтроки(Новый Структура("Контакт", ОтвИсполнитель)).Количество() = 0 Тогда
		НСтр = ВзО.Участники.Добавить();
		НСтр.Контакт = ОтвИсполнитель;
		НСтр.ПредставлениеКонтакта = ОтвИсполнитель;
		НСтр.КакСвязаться = ОтвИсполнитель;
		ВзО.Ответственный = ОтвИсполнитель;
		ВзО.СписокУчастников = ОтвИсполнитель;
	КонецЕсли;
	ВзО.Тема = "Необходимо оформить корректировку РТУ по документу: " + РТУ;
	ВзО.Комментарий = "Задача обновлена " + ТекущаяДата();
	ВзО.СоздатьПроизводственнуюЗадачу = Истина;
	ВзО.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	ВзО.УдалитьПредмет = РТУ;
	ВзО.Дата = ТекущаяДата();
	ВзО.Записать(РежимЗаписиДокумента.Проведение);
	
	Для каждого Исп из ВзО.Участники Цикл
		МЗ = РегистрыСведений.УведомленияПользователейОЗадачах.СоздатьМенеджерЗаписи();
		МЗ.Документ = ВзО.Ссылка;
		МЗ.Пользователь = Исп.Контакт;
		МЗ.Состояние = Справочники.Состояния.Выполнение;
		МЗ.Период = ТекущаяДата();
		МЗ.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры
