
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Автор = Пользователи.ТекущийПользователь();
	ЦФО = Автор.ЦФО;
	Создано = ТекущаяДата();
	Маршрутизировать = Константы.МаршрутизироватьСписаниеСРС.Получить();
	Организация = Константы.ОсновнаяОрганизация.Получить();
	//удПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Организация);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Маршрутизировать = Константы.МаршрутизироватьСписаниеСРС.Получить();
	Редактор = неопределено;
	Изменено = неопределено;
	Состояния.Очистить();
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	
	// + Состояния
	
	// проверяем корректность перечня состояний в ТЧ Состояния
	Для Сч = 0 По Состояния.Количество() - 2 Цикл
		ТекСостояние = Состояния[Сч].Состояние;
		Для ТекСч = Сч + 1 По Состояния.Количество() - 1 Цикл
			Если Состояния[ТекСч].Состояние = ТекСостояние Тогда
				Сообщить("Ошибка: одно состояние может встречаться в документе только один раз!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// для состояний отражаем логику движения статусов
	//Для Сч = 0 По Состояния.Количество() - 2 Цикл
	//	Если Состояния[Сч].Статус = Перечисления.СтатусыЭтапов.Выполнен И Состояния[Сч+1].Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//		Состояния[Сч+1].Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//		Если НЕ ЗначениеЗаполнено(Состояния[Сч+1].Исполнитель) Тогда
	//			Состояния[Сч+1].Исполнитель = Пользователи.ТекущийПользователь();
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	
	//++ Зубов 35844 05.08.2021
	////Стаценко Параллельное согласование
	//Для каждого СтрТЧ из Состояния Цикл
	//	Если Не ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//		СтрТЧ.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//		ПредыдущиеЭтапы = СтрТЧ.ПредыдущиеЭтапы;
	//		Попытка
	//			МассивЭтапов = СтрРазделить(ПредыдущиеЭтапы,",",Ложь);
	//		Исключение
	//			Сообщить("Некорректная строка предыдущих этапов");
	//		КонецПопытки;
	//		ВозможноВыполнение = Истина;
	//		Если МассивЭтапов.Количество() > 0 Тогда
	//			Для каждого Эл из МассивЭтапов Цикл
	//				Попытка
	//					НомСтр = Число(Эл);
	//					СтрЭтапа = Состояния.Найти(НомСтр,"НомерСтроки");
	//					Если СтрЭтапа <> Неопределено Тогда
	//						Если СтрЭтапа.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//							ВозможноВыполнение = Ложь;
	//						КонецЕсли;
	//					КонецЕсли;
	//				Исключение
	//					Сообщить("Некорректное указание этапа состояние. Возможен только ввод цифр.");
	//				КонецПопытки
	//			КонецЦикла;
	//		КонецЕсли;
	//		Если ВозможноВыполнение Тогда
	//			СтрТЧ.Статус =  Перечисления.СтатусыЭтапов.НаВыполнение;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	////Стаценко
	//МаршрутизацияСервер.ПараллельноеСогласование(Состояния); //ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, закомментировал (перенёс ниже)
	//-- Зубов 35844 05.08.2021
	
	// проверка на заполнение у всех строк тч РасшифровкаПлатежа реквизита Сделка
	ПлатежкаРазобралась = Истина;
	Для Каждого Стр Из РасшифровкаПлатежа Цикл
		Если НЕ ЗначениеЗаполнено(Стр.Сделка) Тогда
			ПлатежкаРазобралась = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// Маршрутизация заказа
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = 
	НЕ ЗначениеЗаполнено(Ссылка) ИЛИ 
	Ссылка.Организация <> Организация ИЛИ 
	Ссылка.Контрагент <> Контрагент ИЛИ
	Ссылка.ДоговорКонтрагента <> ДоговорКонтрагента ИЛИ
	Ссылка.ПлатежкаРазобралась <> ПлатежкаРазобралась ИЛИ Состояния.Количество() = 0;
	
	Если Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Контрагент);
		ПараметрыЗапроса.Вставить("Договор", ДоговорКонтрагента);
		ПараметрыЗапроса.Вставить("ПлатежкаРазобралась", ПлатежкаРазобралась);
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьСписаниеСРС(ПараметрыЗапроса, Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			УказанныеВручнуюИспНаблюдатель = Новый СписокЗначений;
			Если ДополнительныеСвойства.Свойство("ДопСвойстваОбъекта") тогда
				УказанныеВручнуюИспНаблюдатель = ДополнительныеСвойства.ДопСвойстваОбъекта;
			КонецЕсли;
			МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъект, РезультатЗапроса, Автор, УказанныеВручнуюИспНаблюдатель);			
		КонецЕсли;
	КонецЕсли;
	
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, начало
	МаршрутизацияСервер.ПараллельноеСогласование(Состояния);
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, конец
	
	МаршрутизацияСервер.ПостобработкаТЧСостояний(ЭтотОбъект, Автор);
	
	// если исполнитель пустой, то проставляем тек пользователя
	Для каждого Стр из Состояния Цикл
		Если Стр.ПримечаниеЗадачаИсполнителю Тогда
			// если текст примечания изменился, то создать новое сообщение. если остался прежним, то не менять
			// т.к. состояние уникально, ищем по нему
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Состояние",Стр.Состояние);
			НайденнаяСтр = Ссылка.Состояния.НайтиСтроки(ПараметрыОтбора);
			Если НайденнаяСтр.Количество()>0 Тогда
				Если НЕ НайденнаяСтр[0].Комментарий = Стр.Комментарий Тогда
					
					// +Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					ДатаСообщения = ТекущаяДата();
					АвторСообщения = Пользователи.ТекущийПользователь();
					ТекстСообщения = Стр.Комментарий;
					ГУИДСообщения = Новый УникальныйИдентификатор();
					
					ГУИДТемы = Новый УникальныйИдентификатор;
					
					РассылкаПоЛичнымЦелям.СформироватьЛичноеСообщение(ГУИДТемы, , Ссылка, ДатаСообщения, АвторСообщения, ТекстСообщения, , ГУИДСообщения, Стр.Исполнитель);
					// -Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// определяем текущее состояние. для нас это первое состояние не в "выполнено"
	//Для каждого Состояние из Состояния Цикл
	//	Если Состояние.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//		ТекущееСостояние = Состояние.Состояние;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	
	// - Состояния
	
	СуммаДокумента = РасшифровкаПлатежа.Итог("СуммаВзаиморасчетов");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Евросиб Каблов М.Б. 19.11.2019 (
	ПараметрыКурсаРегл = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Константы.ВалютаРегламентированногоУчета.Получить(), Дата);
	ПараметрыКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
	
	ДвиженияДС = Движения.ДвиженияДенежныхСредств;
	ДвиженияДС.Записывать = Истина;
	
	Движения.ВзаиморасчетыСПоставщиками.Записывать = Истина;
	//Евросиб Каблов М.Б. 19.11.2019 )
	
	ВзаиморасчетыСервер.СписаниеСРасчетногоСчета_СформированитьДвиженияВзаиморасчетыСПокупателями(ЭтотОбъект);
	Если ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику Тогда
		Если РасшифровкаПлатежа.Количество() > 0 Тогда
			Для каждого Стр из РасшифровкаПлатежа Цикл
				//Евросиб Каблов М.Б. 19.11.2019 ( Добавил выше
				//Движения.ВзаиморасчетыСПоставщиками.Записывать = Истина;
				//Евросиб Каблов М.Б. 19.11.2019 )
				Движение = Движения.ВзаиморасчетыСПоставщиками.ДобавитьРасход();
				Движение.Период 		= Дата;
				Движение.Организация 	= Организация;
				Движение.ДокументВзаиморасчетов = Стр.Сделка;
				Движение.Контрагент 	= Контрагент;
				Движение.Договор 		= Стр.ДоговорКонтрагента;
				//Движение.ВалютаРасчетов = ВалютаДокумента;
				Движение.СуммаНДС 		= 0; //Евросиб Гудкова( 03.06.2021 Ticket№ 35135 Стр.СуммаНДС;
				Движение.СуммаСНДС 		= Стр.СуммаВзаиморасчетов;
				Движение.СуммаБезНДС 	= Движение.СуммаСНДС - Движение.СуммаНДС;
				Движение.ДатаРасчетов 	= Дата;
				Движение.ДопРегистратор	= Ссылка;
				
				//Евросиб Каблов М.Б. 19.11.2019 (
				//Движения денежных средств
				Движение = ДвиженияДС.Добавить();		
				//Измерения
				Движение.Период = Дата;
				Движение.ПриходРасход = Перечисления.ВидыДвиженийПриходРасход.Расход;
				Движение.Организация = Организация;
				Движение.БанковскийСчет = СчетОрганизации;
				Движение.СтатьяДвиженияДенежныхСредств = Стр.СтатьяДвиженияДенежныхСредств;
				Движение.Контрагент = Контрагент;
				Движение.ДоговорКонтрагента = Стр.ДоговорКонтрагента;
				Движение.Счет = Стр.Сделка;
				Движение.ДокументДвижения = Ссылка;				
				//Ресурсы
				Движение.СуммаВал = Стр.СуммаВзаиморасчетов;		
				Движение.Сумма = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Стр.СуммаВзаиморасчетов, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
				//Евросиб Каблов М.Б. 19.11.2019 )
				
//Евросиб Гудкова( 31.05.2021 Ticket№ 35135
				//Движения.ВзаиморасчетыСПоставщикамиПланФакт.Записывать = Истина;
				//Движение = Движения.ВзаиморасчетыСПоставщикамиПланФакт.Добавить();
				//Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				//Движение.Период = Дата;
				//Движение.Организация = Организация;
				//Движение.ДокументВзаиморасчетов = Стр.Сделка;
				//Движение.ЗаказПоставщику = Стр.Сделка;
				//Движение.Контрагент = Контрагент;
				//Движение.Договор = Стр.ДоговорКонтрагента;
				//Движение.ВалютаРасчетов = ВалютаДокумента;
				//Движение.СуммаНДСФакт = Стр.СуммаНДС;
				//Движение.СуммаСНДСФакт = Стр.СуммаВзаиморасчетов;
				//Движение.СуммаБезНДСФакт = Стр.СуммаВзаиморасчетов - Стр.СуммаНДС;
				////Евросиб Каблов 23.11.2020 (
				////ИтогоНДС = ?(Стр.Сделка.Товары.Количество()>0, Стр.Сделка.Товары.Итог("СуммаНДС"),0);
				////Движение.СуммаБезНДСПлан = ?(Стр.Сделка.СуммаВключаетНДС,Стр.Сделка.СуммаДокумента-ИтогоНДС,Стр.Сделка.СуммаДокумента);
				////Движение.СуммаНДСПлан = ИтогоНДС;
				////Движение.СуммаСНДСПлан = ?(Стр.Сделка.СуммаВключаетНДС,Стр.Сделка.СуммаДокумента,Стр.Сделка.СуммаДокумента+ИтогоНДС);
				//Если ЗначениеЗаполнено(Стр.Сделка) И (ТипЗнч(Стр.Сделка) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг")
				//		Или ЗначениеЗаполнено(Стр.Сделка) И ТипЗнч(Стр.Сделка) = Тип("ДокументСсылка.КорректировкаПоступления")
				//		Или ЗначениеЗаполнено(Стр.Сделка) И ТипЗнч(Стр.Сделка) = Тип("ДокументСсылка.СчетНаОплатуПоставщика")) Тогда
				//	ИтогоНДС = ?(Стр.Сделка.Товары.Количество()>0, Стр.Сделка.Товары.Итог("СуммаНДС"),0);
				//	Движение.СуммаБезНДСПлан = ?(Стр.Сделка.СуммаВключаетНДС,Стр.Сделка.СуммаДокумента-ИтогоНДС,Стр.Сделка.СуммаДокумента);
				//	Движение.СуммаНДСПлан = ИтогоНДС;
				//	Движение.СуммаСНДСПлан = ?(Стр.Сделка.СуммаВключаетНДС,Стр.Сделка.СуммаДокумента,Стр.Сделка.СуммаДокумента+ИтогоНДС);
				//КонецЕсли;
// Евросиб Гудкова) 		
//Евросиб Каблов 23.11.2020 )

			КонецЦикла;
			
			СумВзаим = РасшифровкаПлатежа.Итог("СуммаВзаиморасчетов");
			
			Если РасшифровкаПлатежа.Итог("СуммаВзаиморасчетов") < СуммаДокумента Тогда
				//Евросиб Каблов М.Б. 19.11.2019 ( Добавил выше
				//Движения.ВзаиморасчетыСПоставщиками.Записывать = Истина;
				//Евросиб Каблов М.Б. 19.11.2019 )
				Движение = Движения.ВзаиморасчетыСПоставщиками.ДобавитьРасход();
				Движение.Период 		= Дата;
				Движение.Организация 	= Организация;
				Движение.Контрагент 	= Контрагент;
				Движение.Договор 		= ДоговорКонтрагента;
				//Движение.ВалютаРасчетов = ВалютаДокумента;
				Движение.ДатаРасчетов 	= Дата;
				Движение.ДокументВзаиморасчетов = Ссылка;
				Движение.СуммаСНДС 		= СуммаДокумента - СумВзаим;
				Движение.СуммаНДС 		= 0; //Евросиб Гудкова( 03.06.2021 Ticket№ 35135 СуммаНДСДокумента-РасшифровкаПлатежа.Итог("СуммаНДС");
				Движение.СуммаБезНДС 	= (СуммаДокумента-СумВзаим) - (СуммаНДСДокумента-РасшифровкаПлатежа.Итог("СуммаНДС"));
				Движение.ДопРегистратор	= Ссылка;
				
				//Евросиб Каблов М.Б. 19.11.2019 (
				//Движения денежных средств
				Движение = ДвиженияДС.Добавить();		
				//Измерения
				Движение.Период = Дата;
				Движение.ПриходРасход = Перечисления.ВидыДвиженийПриходРасход.Расход;
				Движение.Организация = Организация;
				Движение.БанковскийСчет = СчетОрганизации;
				Движение.СтатьяДвиженияДенежныхСредств = РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств; //Гудкова. временно. нет ресурса переписать эту фигню
				Движение.Контрагент = Контрагент;
				Движение.ДоговорКонтрагента = ДоговорКонтрагента;
				Движение.ДокументДвижения = Ссылка;				
				//Ресурсы
				РазницаСумм = СуммаДокумента-РасшифровкаПлатежа.Итог("СуммаВзаиморасчетов");
				Движение.СуммаВал = РазницаСумм;
				Движение.Сумма = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(РазницаСумм, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
				//Евросиб Каблов М.Б. 19.11.2019 )
			КонецЕсли;
			
		Иначе
			//Евросиб Каблов М.Б. 19.11.2019 ( Добавил выше
			//Движения.ВзаиморасчетыСПоставщиками.Записывать = Истина;
			//Евросиб Каблов М.Б. 19.11.2019 )
			Движение = Движения.ВзаиморасчетыСПоставщиками.ДобавитьРасход();
			Движение.Период 		= Дата;
			Движение.Организация 	= Организация;
			Движение.ДокументВзаиморасчетов = Ссылка;
			Движение.Контрагент 	= Контрагент;
			Движение.Договор 		= ДоговорКонтрагента;
			//Движение.ВалютаРасчетов = ВалютаДокумента;
			Движение.ДатаРасчетов 	= Дата;
			Движение.СуммаНДС 		= 0; //Евросиб Гудкова( 03.06.2021 Ticket№ 35135 СуммаНДСДокумента;
			Движение.СуммаСНДС 		= СуммаДокумента;
			Движение.СуммаБезНДС 	= СуммаДокумента - СуммаНДСДокумента;
			Движение.ДопРегистратор	= Ссылка;
			
			//Евросиб Каблов М.Б. 19.11.2019 (
			//Движения денежных средств
			Движение = ДвиженияДС.Добавить();		
			//Измерения
			Движение.Период = Дата;
			Движение.ПриходРасход = Перечисления.ВидыДвиженийПриходРасход.Расход;
			Движение.Организация = Организация;
			Движение.БанковскийСчет = СчетОрганизации;
			Движение.СтатьяДвиженияДенежныхСредств = РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств; //Гудкова. временно. нет ресурса переписать эту фигню
			Движение.Контрагент = Контрагент;
			Движение.ДоговорКонтрагента = ДоговорКонтрагента;
			Движение.ДокументДвижения = Ссылка;				
			//Ресурсы
			Движение.СуммаВал = СуммаДокумента;
			Движение.Сумма = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(СуммаДокумента, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
			//Евросиб Каблов М.Б. 19.11.2019 )
		КонецЕсли;
	КонецЕсли;
	
	Движения.ЗаказПоставщику_ПП.Записывать = Истина;
	
	Если ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику Тогда
		
		Для каждого Стр Из РасшифровкаПлатежа Цикл
			
			Если ЗначениеЗаполнено(Стр.Сделка) Тогда
				
				Движение = Движения.ЗаказПоставщику_ПП.ДобавитьРасход();
				Движение.Период 		= Дата;
				Движение.Организация	= Организация;
				Движение.Контрагент		= Контрагент;
				// ДИТ Поморцева Т.П. Задача 234529 09.06.2021. начало
				//Движение.Договор		= ДоговорКонтрагента;
				Движение.Договор		= Стр.ДоговорКонтрагента;
				// ДИТ Поморцева Т.П. Задача 234529 09.06.2021. конец
				Движение.СчетПоставщика = Стр.Сделка;
				Движение.Сумма			= Стр.СуммаВзаиморасчетов;
				Движение.ДопРегистратор	= Ссылка;
				
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли;  
	
	Движения.ЗаявкиНаРасходованиеДенежныхСредств.Записывать = Истина;
	Для каждого Стр Из РасшифровкаПлатежа Цикл
		Если ЗначениеЗаполнено(Стр.ЗаявкаНаОплату) Тогда
			Движение = Движения.ЗаявкиНаРасходованиеДенежныхСредств.ДобавитьРасход();
			Движение.Период = ДатаВзаиморасчетов;
			Движение.Организация = Организация;
			Движение.Контрагент = Контрагент;
			Движение.Договор = Стр.ДоговорКонтрагента;
			Движение.Сделка = Стр.Сделка;
			Движение.ЗаявкаНаОплату = Стр.ЗаявкаНаОплату;
			Движение.Валюта = ВалютаДокумента;
			Движение.Сумма = Стр.СуммаВзаиморасчетов;
		КонецЕсли;
	КонецЦикла; 
	
	//Евросиб СубботинВ #103438 24.02.2025 Начало 
	Если ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ВозвратПокупателю Тогда
		Движения.РазнесениеВходящихПлатежейПоСчетамПокупателей.Записывать = Истина;
		Для Каждого Стр Из РасшифровкаПлатежа Цикл			
			Если ЗначениеЗаполнено(Стр.Сделка) и ТипЗнч(Стр.Сделка) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда				
				Движение = Движения.РазнесениеВходящихПлатежейПоСчетамПокупателей.ДобавитьРасход();
				Движение.Период = ДатаВзаиморасчетов;
				Движение.Контрагент = Контрагент;
				Движение.Договор = Стр.ДоговорКонтрагента;
				Движение.Поступление = Стр.Сделка;
				Движение.Валюта = ВалютаДокумента;
				Движение.Сумма = Стр.СуммаВзаиморасчетов;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
	//Евросиб СубботинВ #103438 24.02.2025 Конец

	
КонецПроцедуры
