
// ++ ДИТ_Агафонов_task 54348 14.07.2022
Процедура ПроверитьЗапись(ПроверяемаяЗапись) Экспорт
	
	    //++ДИТ Гаузер А.В. Ticket#0287030 27.09.2022
		ОшибкаПериода = Ложь;
		Период = ПроверяемаяЗапись.Период;
		ДатаВнесенияДанных = ПроверяемаяЗапись.ДатаВнесенияДанных; 
		ДатаВнесенияДанных1ДеньВперед = ДатаВнесенияДанных + 24*60*60;
		ДатаВнесенияДанных1ГодНазад = ДобавитьМесяц(ДатаВнесенияДанных, -12);
		ШаблонСообщения = "некорректная дата операции: дата операции с контейнером «"+ Формат(Период, "ДФ=dd.MM.yyyy") +"» " +
						  "не может быть %1 даты получения данных об этой операции «"+ Формат(ДатаВнесенияДанных, "ДФ=dd.MM.yyyy") +"»";
		Если Период > ДатаВнесенияДанных1ДеньВперед Тогда
			ТекстЗнакаСравнения = "больше";
			ОшибкаПериода = Истина;
		ИначеЕсли Период < ДатаВнесенияДанных1ГодНазад Тогда              
			ТекстЗнакаСравнения = "меньше";
			ОшибкаПериода = Истина;
		КонецЕсли;
		Если ОшибкаПериода Тогда
			Если СтрНайти(ВРЕГ(ПроверяемаяЗапись.КомментарийКОшибке), ВРЕГ("Некорректная дата операции: дата операции с контейнером")) = 0 Тогда
				ПроверяемаяЗапись.КомментарийКОшибке = ПроверяемаяЗапись.КомментарийКОшибке	+
													  ?(ЗначениеЗаполнено(ПроверяемаяЗапись.КомментарийКОшибке), Символы.ПС, "") + 
													  СтрШаблон(ШаблонСообщения, ТекстЗнакаСравнения);
			КонецЕсли;									   
			ПроверяемаяЗапись.Ошибка = Истина;
		КонецЕсли;
		//--ДИТ Гаузер А.В. Ticket#0287030 27.09.2022
		
		// ДИТ 65310 Давудов М.А. Начало: 16.02.2023
		Если НЕ ЗначениеЗаполнено(ПроверяемаяЗапись.Терминал)
		   И ЗначениеЗаполнено(ПроверяемаяЗапись.КодТерминала) Тогда
			Если СтрНайти(ВРег(ПроверяемаяЗапись.КомментарийКОшибке), ВРег("которого нет в справочнике ""Локации (терминал)"" DataCore")) = 0 Тогда
				ПроверяемаяЗапись.КомментарийКОшибке = ПроверяемаяЗапись.КомментарийКОшибке +
					?(ЗначениеЗаполнено(ПроверяемаяЗапись.КомментарийКОшибке), Символы.ПС, "") +
					"указан терминал с кодом <" + ПроверяемаяЗапись.КодТерминала + ">, которого нет в справочнике ""Локации (терминал)"" DataCore";
			КонецЕсли;
			ПроверяемаяЗапись.Ошибка = Истина;
		КонецЕсли;
		
		Если ПроверяемаяЗапись.Транспорт = Перечисления.ВидыТранспорта.ЖД
		   И ЗначениеЗаполнено(ПроверяемаяЗапись.НомерТранспорта)
		   И (ТипЗнч(ПроверяемаяЗапись.НомерТранспорта) <> Тип("СправочникСсылка.ТС")
				ИЛИ ПроверяемаяЗапись.НомерТранспорта = Справочники.ТС.ПустаяСсылка()) Тогда
			Если СтрНайти(ВРег(ПроверяемаяЗапись.КомментарийКОшибке), ВРег("которого нет в справочнике ""Вагоны, суда, авто"" DataCore")) = 0 Тогда
				ПроверяемаяЗапись.КомментарийКОшибке = ПроверяемаяЗапись.КомментарийКОшибке +
					?(ЗначениеЗаполнено(ПроверяемаяЗапись.КомментарийКОшибке), Символы.ПС, "") +
					"указан вагон с номером <" + ПроверяемаяЗапись.НомерТранспорта + ">, которого нет в справочнике ""Вагоны, суда, авто"" DataCore";
			КонецЕсли;
			ПроверяемаяЗапись.Ошибка = Истина;
		КонецЕсли;
		// ДИТ 65310 Давудов М.А. Конец: 16.02.2023
		
		Если не ЗначениеЗаполнено(ПроверяемаяЗапись.Контейнер) Тогда
			
			Если СтрНайти(ВРег(ПроверяемаяЗапись.КомментарийКОшибке),Врег("которого нет в справочнике DataCore"))=0 Тогда 
				ПроверяемаяЗапись.КомментарийКОшибке = ПроверяемаяЗапись.КомментарийКОшибке	+
					?(ЗначениеЗаполнено(ПроверяемаяЗапись.КомментарийКОшибке), Символы.ПС, "") + 
				"указан номер контейнера <" + ПроверяемаяЗапись.НомерКонтейнера + ">, которого нет в справочнике DataCore";
			КонецЕсли;
			Если СтрНайти(ВРег(ПроверяемаяЗапись.КомментарийКОшибке),Врег("не удалось сравнить размер КТК из поля ContSize со значением в DC: не найден контейнер"))=0 Тогда 
				ПроверяемаяЗапись.КомментарийКОшибке = ПроверяемаяЗапись.КомментарийКОшибке	+
					?(ЗначениеЗаполнено(ПроверяемаяЗапись.КомментарийКОшибке), Символы.ПС, "") + 
				"не удалось сравнить размер КТК из поля ContSize со значением в DC: не найден контейнер";
			КонецЕсли;
			Если СтрНайти(ВРег(ПроверяемаяЗапись.КомментарийКОшибке),Врег("не удалось сравнить тип КТК из поля ContType со значением в DC: не найден контейнер"))=0 Тогда 
				ПроверяемаяЗапись.КомментарийКОшибке = ПроверяемаяЗапись.КомментарийКОшибке	+
					?(ЗначениеЗаполнено(ПроверяемаяЗапись.КомментарийКОшибке), Символы.ПС, "") + 
				"не удалось сравнить тип КТК из поля ContType со значением в DC: не найден контейнер";
			КонецЕсли;
			// ДИТ 65310 Давудов М.А. Начало: 16.02.2023
			ПроверяемаяЗапись.Ошибка = Истина;
			// ДИТ 65310 Давудов М.А. Конец: 16.02.2023
			Возврат;
		КонецЕсли;
		
		//Если СтрНайти(ВРег(ПроверяемаяЗапись.КомментарийКОшибке),Врег("размер КТК из поля ContSize не совпадает со значением в DC"))<>0 
		//	или СтрНайти(ВРег(ПроверяемаяЗапись.КомментарийКОшибке),Врег("тип КТК из поля ContType не совпадает со значением в DC"))<>0  Тогда
		//	Возврат;	
		//КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТЕ.Ссылка КАК Ссылка,
		               |	ТЕ.ТипТЕ.РазмерКТК.Размер КАК РазмерКТК,
		               |	ТЕ.ТипТЕ.Наименование КАК ТипТЕ
		               |ИЗ
		               |	Справочник.ТЕ КАК ТЕ
		               |ГДЕ
		               |	ТЕ.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ПроверяемаяЗапись.Контейнер);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если не Выборка.Следующий() Тогда
			возврат;
		КонецЕсли;
		
		// РазмерКТК                    
		РазмеКТКСоответствует = Истина;
		Попытка
			ПроверяемаяЗапись_РазмерКТК = Число(ПроверяемаяЗапись.РазмерКТК);
		Исключение
			ПроверяемаяЗапись_РазмерКТК=0;
		КонецПопытки;
		Если не ПроверяемаяЗапись_РазмерКТК=0 Тогда
			Если НЕ ПроверяемаяЗапись_РазмерКТК = Выборка.РазмерКТК Тогда
				Если СтрНайти(ВРег(ПроверяемаяЗапись.КомментарийКОшибке),Врег("размер КТК из поля ContSize не совпадает со значением в DC"))=0 Тогда
				ПроверяемаяЗапись.КомментарийКОшибке = ПроверяемаяЗапись.КомментарийКОшибке	+
					?(ЗначениеЗаполнено(ПроверяемаяЗапись.КомментарийКОшибке), Символы.ПС, "") + 
					"размер КТК из поля ContSize не совпадает со значением в DC: контейнер <" + ПроверяемаяЗапись.Контейнер.Наименование + ">";
				//ПроверяемаяЗапись.Ошибка = Истина;
				РазмеКТКСоответствует = Ложь;
				КонецЕсли;
			КонецЕсли;
		Иначе	
			РазмеКТКСоответствует = Ложь;
		КонецЕсли;
	
		// ТипКТК                    
		Если РазмеКТКСоответствует Тогда
			Если НЕ СокрЛП(ПроверяемаяЗапись.РазмерКТК) + СокрЛП(ПроверяемаяЗапись.ТипКТК) = СокрЛП(Выборка.ТипТЕ) Тогда
				Если СтрНайти(ВРег(ПроверяемаяЗапись.КомментарийКОшибке),Врег("тип КТК из поля ContType не совпадает со значением в DC"))=0 Тогда
				ПроверяемаяЗапись.КомментарийКОшибке = ПроверяемаяЗапись.КомментарийКОшибке	+
					?(ЗначениеЗаполнено(ПроверяемаяЗапись.КомментарийКОшибке), Символы.ПС, "") + 
					"тип КТК из поля ContType не совпадает со значением в DC: контейнер <" + ПроверяемаяЗапись.Контейнер.Наименование + ">";
				//ПроверяемаяЗапись.Ошибка = Истина;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если СтрНайти(ВРег(ПроверяемаяЗапись.КомментарийКОшибке),Врег("не удалось сравнить тип КТК из поля ContType со значением в DC: несоответствие размера КТК"))=0 Тогда
				ПроверяемаяЗапись.КомментарийКОшибке = ПроверяемаяЗапись.КомментарийКОшибке	+
					?(ЗначениеЗаполнено(ПроверяемаяЗапись.КомментарийКОшибке), Символы.ПС, "") + 
				"не удалось сравнить тип КТК из поля ContType со значением в DC: несоответствие размера КТК";	
		
			КонецЕсли;
		КонецЕсли;

КонецПроцедуры
// -- ДИТ_Агафонов_task 54348 14.07.2022