// ДИТ Поморцева Т.П. Задача 45691 07.04.2022 начало
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УсловиеСрокаПредоставленияДоговора = 0;
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

&НаКлиенте
Процедура УсловиеСрокаПредоставленияДоговораПриИзменении(Элемент)
	
	УсловиеСрокаПредоставленияДоговораПриИзмененииНаСервере();
	
КонецПроцедуры

Процедура УсловиеСрокаПредоставленияДоговораПриИзмененииНаСервере()
	Если УсловиеСрокаПредоставленияДоговора = 1 И СтрНайти(Список.ТекстЗапроса,"ДОБАВИТЬКДАТЕ(&ТекДата, ДЕНЬ, 10)") = 0 Тогда 
		Список.ТекстЗапроса = Список.ТекстЗапроса + "	
			|ГДЕ СправочникДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
			|И НЕ СправочникДоговорыКонтрагентов.ПолученОригинал 
			|И НЕ (СправочникДоговорыКонтрагентов.Автопролонгация И СправочникДоговорыКонтрагентов.СрокПредоставленияОригиналаДата = ДАТАВРЕМЯ(1,1,1))
			|И СправочникДоговорыКонтрагентов.СрокПредоставленияОригиналаДата <= ДОБАВИТЬКДАТЕ(&ТекДата, ДЕНЬ, 10)";
        Список.Параметры.УстановитьЗначениеПараметра("ТекДата",ТекущаяДата());
		КоличествоДоговоровСИстекающимСтроком = ПолучитьКоличествоДоговоровСИстекающимСтроком();
	КонецЕсли;
	Если УсловиеСрокаПредоставленияДоговора = 0 И СтрНайти(Список.ТекстЗапроса,"ДОБАВИТЬКДАТЕ(&ТекДата, ДЕНЬ, 10)") > 0 Тогда
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса,"	
			|ГДЕ СправочникДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
			|И НЕ СправочникДоговорыКонтрагентов.ПолученОригинал 
			|И НЕ (СправочникДоговорыКонтрагентов.Автопролонгация И СправочникДоговорыКонтрагентов.СрокПредоставленияОригиналаДата = ДАТАВРЕМЯ(1,1,1))
			|И СправочникДоговорыКонтрагентов.СрокПредоставленияОригиналаДата <= ДОБАВИТЬКДАТЕ(&ТекДата, ДЕНЬ, 10)","");
		КоличествоДоговоровСИстекающимСтроком = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоДоговоровСИстекающимСтроком()
	
	Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных(); 
	Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	//Выводим динамический список в таблицу значений
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных ( ) ;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений ;
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат Результат.Количество();
КонецФункции

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
// ДИТ Поморцева Т.П. Задача 45691 07.04.2022 конец
