Функция ПолучитьТаблицуПараметровПоКатегорииХарактеристикПодрядчика(Категория) Экспорт
	
	Результат = Новый Массив;
	
	Если Категория = ПредопределенноеЗначение("Перечисление.ГруппыХарактеристикПодрядчиков.АвтомобильныеПеревозки") Тогда
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СПАРК_ИндексДолжнойОсмотрительности")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СПАРК_ИндексФинансовогоРиска")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СПАРК_ИндексПлатежнойДисциплины")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ПринятиеНашихТиповыхФорм")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.РепутацияПоложительнаяИлиНейтральная")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.НаличиеЛицензий")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.Гарантии")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УровеньСтавокСкидки")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ОтсутствиеШтрафныхСанкцийПенейВНашАдрес")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ИспользованиеЭДО")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СвоевременноеПредоставлениеДокументовИИхСоответствиеЗаконодательству")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СобственникРесурснойБазы")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УсловияПоОплатеПослеПодписанияАктовВыполненныхРабот")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ОперативнаяПодачаПодПогрузку")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.НаличиеСертификатовISO14001ISO45001")));
	ИначеЕсли Категория = ПредопределенноеЗначение("Перечисление.ГруппыХарактеристикПодрядчиков.АрендаПодвижногоСоставаКонтейнеров") Тогда
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СПАРК_ИндексДолжнойОсмотрительности")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СПАРК_ИндексФинансовогоРиска")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СПАРК_ИндексПлатежнойДисциплины")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ПринятиеНашихТиповыхФорм")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.РепутацияПоложительнаяИлиНейтральная")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.НаличиеЛицензий")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.Гарантии")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УровеньСтавокСкидки")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ОтсутствиеШтрафныхСанкцийПенейВНашАдрес")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ИспользованиеЭДО")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СвоевременноеПредоставлениеДокументовИИхСоответствиеЗаконодательству")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СобственникРесурснойБазы")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УсловиеПоОплатеВозможенОбеспечительныйПлатежДалееОплатаПослеПодписания")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ОперативнаяПодачаПодПогрузку")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ПлановыйРемонтЗаСчетСобственникаАрендныеКаникулы")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.РемонтПоВУ41ЗаСчетСобственникаТРСЗаменойДеталейЗаСчетСобственника")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.НаличиеСертификатовISO14001ISO45001")));
	ИначеЕсли Категория = ПредопределенноеЗначение("Перечисление.ГруппыХарактеристикПодрядчиков.ЗакупкаМатериаловЗапасныхЧастейСырья") Тогда
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СПАРК_ИндексДолжнойОсмотрительности")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СПАРК_ИндексФинансовогоРиска")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СПАРК_ИндексПлатежнойДисциплины")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ПринятиеНашихТиповыхФорм")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.РепутацияПоложительнаяИлиНейтральная")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.НаличиеЛицензий")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.Гарантии")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УровеньСтавокСкидки")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ОтсутствиеШтрафныхСанкцийПенейВНашАдрес")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СвоевременноеПредоставлениеДокументовИИхСоответствиеЗаконодательству")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ДостаточныеЗапасыНаСкладахПоставщика")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УсловияПоОплатеПослеПоставкиТМЦИПодписанияТоварныхНакладных")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ДоставкаТМЦНаСкладГрузополучателяЗаСчетПоставщика")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.РегионПоставщикаВНепосредственнойБлизостиОтГрузополучателя")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.НаличиеСертификатовISO14001ISO45001")));
	ИначеЕсли Категория = ПредопределенноеЗначение("Перечисление.ГруппыХарактеристикПодрядчиков.УслугиПоТранспортировкеГрузаЧерезВодноеПространство") Тогда
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СПАРК_ИндексДолжнойОсмотрительности")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СПАРК_ИндексФинансовогоРиска")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СПАРК_ИндексПлатежнойДисциплины")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ПринятиеНашихТиповыхФорм")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.РепутацияПоложительнаяИлиНейтральная")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ЛинияИлиАффилированноеСНейЛицо")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.Гарантии")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УровеньСтавокСкидки")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ОтсутствиеШтрафовПенейИлиИхНизкийУровень")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ИспользованиеЭДО")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СвоевременноеПредоставлениеДокументовИИхСоответствиеЗаконодательству")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УсловияОплатыПоФактуПослеПодписанияКопийАктовВыполненныхРабот")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.НаличиеСертификатовISO14001ISO45001")));
	ИначеЕсли Категория = ПредопределенноеЗначение("Перечисление.ГруппыХарактеристикПодрядчиков.ТранспортноЭкспедиционныеУслуги") Тогда
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СПАРК_ИндексДолжнойОсмотрительности")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СПАРК_ИндексФинансовогоРиска")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СПАРК_ИндексПлатежнойДисциплины")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ПринятиеНашихТиповыхФорм")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.РепутацияПоложительнаяИлиНейтральная")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ГрузоотправительИлиАффилированноеСНимЛицо")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.Гарантии")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УровеньСтавокСкидки")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ОтсутствиеШтрафныхСанкцийПенейВНашАдрес")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ИспользованиеЭДО")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СвоевременноеПредоставлениеДокументовИИхСоответствиеЗаконодательству")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УсловияОплатыПоФактуПослеПодписанияОригиналовАктовВыполненныхРабот")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.НаличиеСертификатовISO14001ISO45001")));
	ИначеЕсли Категория = ПредопределенноеЗначение("Перечисление.ГруппыХарактеристикПодрядчиков.ОплатаПровозныхПлатежейЗаЖелезнодорожнуюПеревозку") Тогда
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СПАРК_ИндексДолжнойОсмотрительности")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СПАРК_ИндексФинансовогоРиска")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СПАРК_ИндексПлатежнойДисциплины")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ПринятиеНашихТиповыхФорм")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.РепутацияПоложительнаяИлиНейтральная")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ГрузоотправительЖДГосударстваИлиАффилированноеСНимЛицо")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.Гарантии")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УровеньСтавокСкидки")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ОтсутствиеШтрафныхСанкцийПенейВНашАдрес")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СвоевременноеПредоставлениеДокументовИИхСоответствиеЗаконодательству")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УсловияОплатыПоФактуПослеПодписанияКопийАктовВыполненныхРабот")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.НаличиеСертификатовISO14001ISO45001")));
	ИначеЕсли Категория = ПредопределенноеЗначение("Перечисление.ГруппыХарактеристикПодрядчиков.РемонтПодвижногоСостава") Тогда
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СПАРК_ИндексДолжнойОсмотрительности")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СПАРК_ИндексФинансовогоРиска")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СПАРК_ИндексПлатежнойДисциплины")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ПринятиеНашихТиповыхФорм")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.РепутацияПоложительнаяИлиНейтральная")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ГрузоотправительРЖДИлиАффилированноеСНимЛицо")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СобственникРесурснойБазы")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ДостаточныеОбъемыЗапасныхЧастей")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УровеньСтавокНаРемонтИЗапчасти")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ОперативныеСрокиРемонтов")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УсловияПоОплатеПослеПодписанияАктовВыполненныхРабот")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УдобствоРегиональногоРасположенияДепоОптимизируетЖДТариф")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ПривлекательныеУсловияИСтоимостьХраненияЗапчастей")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ГарантииСрокГарантииПоВУ41НеМенее253летВозмещениеПоГарантийнымСлучаям")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ОтсутствиеШтрафныхСанкцийПенейВНашАдрес")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ИспользованиеЭДО")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СвоевременноеПредоставлениеДокументовИИхСоответствиеЗаконодательству")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.НаличиеСертификатовISO14001ISO45001")));
	ИначеЕсли Категория = ПредопределенноеЗначение("Перечисление.ГруппыХарактеристикПодрядчиков.ОбщехозяйственныеРасходы") Тогда
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СПАРК_ИндексДолжнойОсмотрительности")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СПАРК_ИндексФинансовогоРиска")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СПАРК_ИндексПлатежнойДисциплины")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ПринятиеНашихТиповыхФорм")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.РепутацияПоложительнаяИлиНейтральная")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ПроизводительИлиАффилированноеСНимЛицо")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СобственникРесурснойБазы")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ГарантииПоставщикаТоваровУслуг")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УровеньСтавокСкидки")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ОтсутствиеШтрафныхСанкцийПенейВНашАдрес")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ИспользованиеЭДО")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СвоевременноеПредоставлениеДокументовИИхСоответствиеЗаконодательству")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УсловияОплаты30КалендарныхДнейПослеПодписанияОригиналовАктов")));
		Результат.Добавить(Новый Структура("Характеристика", ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.НаличиеСертификатовISO14001ISO45001")));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВариантыЗначенияДляХарактеристики(Характеристика) Экспорт
	
	Результат = "Число";
	
	МассивБулево = Новый Массив;
	МассивБулево.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ПринятиеНашихТиповыхФорм"));
	МассивБулево.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.НаличиеЛицензий"));
	МассивБулево.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.Гарантии"));
	МассивБулево.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ОтсутствиеШтрафныхСанкцийПенейВНашАдрес"));
	МассивБулево.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ИспользованиеЭДО"));
	МассивБулево.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СвоевременноеПредоставлениеДокументовИИхСоответствиеЗаконодательству"));
	МассивБулево.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СобственникРесурснойБазы"));
	МассивБулево.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.НаличиеСертификатовISO14001ISO45001"));
	МассивБулево.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ОперативнаяПодачаПодПогрузку"));
	МассивБулево.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ПлановыйРемонтЗаСчетСобственникаАрендныеКаникулы"));
	МассивБулево.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.РемонтПоВУ41ЗаСчетСобственникаТРСЗаменойДеталейЗаСчетСобственника"));
	МассивБулево.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ДостаточныеЗапасыНаСкладахПоставщика"));
	МассивБулево.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ДоставкаТМЦНаСкладГрузополучателяЗаСчетПоставщика"));
	МассивБулево.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.РегионПоставщикаВНепосредственнойБлизостиОтГрузополучателя"));
	МассивБулево.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ОтсутствиеШтрафовПенейИлиИхНизкийУровень"));
	МассивБулево.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ГрузоотправительИлиАффилированноеСНимЛицо"));
	МассивБулево.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ГрузоотправительЖДГосударстваИлиАффилированноеСНимЛицо"));
	МассивБулево.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ГрузоотправительРЖДИлиАффилированноеСНимЛицо"));
	МассивБулево.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ДостаточныеОбъемыЗапасныхЧастей"));
	МассивБулево.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ОперативныеСрокиРемонтов"));
	МассивБулево.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УдобствоРегиональногоРасположенияДепоОптимизируетЖДТариф"));
	МассивБулево.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ПривлекательныеУсловияИСтоимостьХраненияЗапчастей"));
	МассивБулево.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ГарантииСрокГарантииПоВУ41НеМенее253летВозмещениеПоГарантийнымСлучаям"));
	МассивБулево.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ПроизводительИлиАффилированноеСНимЛицо"));
	МассивБулево.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ГарантииПоставщикаТоваровУслуг"));
	
	МассивПоложитНейтрОтриц = Новый массив;
	МассивПоложитНейтрОтриц.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.РепутацияПоложительнаяИлиНейтральная"));
	
	
	МассивНизкийСреднийВысокий = Новый массив;
	МассивНизкийСреднийВысокий.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УровеньСтавокСкидки"));
	МассивНизкийСреднийВысокий.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УровеньСтавокНаРемонтИЗапчасти"));
	
	
	МассивДаПредоплата = Новый Массив;
	МассивДаПредоплата.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УсловияПоОплатеПослеПодписанияАктовВыполненныхРабот"));
	МассивДаПредоплата.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УсловиеПоОплатеВозможенОбеспечительныйПлатежДалееОплатаПослеПодписания"));
	МассивДаПредоплата.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УсловияПоОплатеПослеПоставкиТМЦИПодписанияТоварныхНакладных"));
	МассивДаПредоплата.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УсловияОплатыПоФактуПослеПодписанияКопийАктовВыполненныхРабот"));
	МассивДаПредоплата.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УсловияОплатыПоФактуПослеПодписанияОригиналовАктовВыполненныхРабот"));
	МассивДаПредоплата.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УсловияОплаты30КалендарныхДнейПослеПодписанияОригиналовАктов"));
	
	МассивДаЭкспедиторПосредник = Новый Массив;
	МассивДаПредоплата.Добавить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ЛинияИлиАффилированноеСНейЛицо"));
	
	
	Если МассивБулево.Найти(Характеристика) <> неопределено Тогда
		Результат = Новый СписокЗначений;
		Результат.Добавить(0, "Да");
		Результат.Добавить(1, "Нет");
	ИначеЕсли МассивПоложитНейтрОтриц.Найти(Характеристика) <> неопределено Тогда
		Результат = Новый СписокЗначений;
		Результат.Добавить(0, "Положительный");
		Результат.Добавить(1, "Нейтральный");
		Результат.Добавить(2, "Отрицательный");
	ИначеЕсли МассивНизкийСреднийВысокий.Найти(Характеристика) <> неопределено Тогда
		Результат = Новый СписокЗначений;
		Результат.Добавить(0, "Высокий");
		Результат.Добавить(1, "Средний");
		Результат.Добавить(2, "Низкий");
	ИначеЕсли МассивДаПредоплата.Найти(Характеристика) <> неопределено Тогда
		Результат = Новый СписокЗначений;
		Результат.Добавить(0, "Да");
		Результат.Добавить(1, "Предоплата");
	ИначеЕсли МассивДаЭкспедиторПосредник.Найти(Характеристика) <> неопределено Тогда
		Результат = Новый СписокЗначений;
		Результат.Добавить(0, "Да");
		Результат.Добавить(1, "Экспедитор-посредник");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЗначениеРиска(ГруппаХарактеристик, Характеристика, ЗначениеПоказателя) Экспорт
	
	Результат = 999;
	
	ГруппыХ = Новый Соответствие;
	ГруппыХ.Вставить(ПредопределенноеЗначение("Перечисление.ГруппыХарактеристикПодрядчиков.АвтомобильныеПеревозки"), 0);
	ГруппыХ.Вставить(ПредопределенноеЗначение("Перечисление.ГруппыХарактеристикПодрядчиков.АрендаПодвижногоСоставаКонтейнеров"), 1);
	ГруппыХ.Вставить(ПредопределенноеЗначение("Перечисление.ГруппыХарактеристикПодрядчиков.ЗакупкаМатериаловЗапасныхЧастейСырья"), 2);
	ГруппыХ.Вставить(ПредопределенноеЗначение("Перечисление.ГруппыХарактеристикПодрядчиков.УслугиПоТранспортировкеГрузаЧерезВодноеПространство"), 3);
	ГруппыХ.Вставить(ПредопределенноеЗначение("Перечисление.ГруппыХарактеристикПодрядчиков.ТранспортноЭкспедиционныеУслуги"), 4);
	ГруппыХ.Вставить(ПредопределенноеЗначение("Перечисление.ГруппыХарактеристикПодрядчиков.ОплатаПровозныхПлатежейЗаЖелезнодорожнуюПеревозку"), 5);
	ГруппыХ.Вставить(ПредопределенноеЗначение("Перечисление.ГруппыХарактеристикПодрядчиков.РемонтПодвижногоСостава"), 6);
	ГруппыХ.Вставить(ПредопределенноеЗначение("Перечисление.ГруппыХарактеристикПодрядчиков.ОбщехозяйственныеРасходы"), 7);
	
	Если Характеристика = ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СПАРК_ИндексДолжнойОсмотрительности") Тогда
		
		Если ГруппыХ[ГруппаХарактеристик] = 0 Тогда
			Если ЗначениеПоказателя < 40 Тогда
				Результат = 0;
			ИначеЕсли  ЗначениеПоказателя >= 40 И ЗначениеПоказателя <= 55 Тогда
				Результат = 2;
			ИначеЕсли  ЗначениеПоказателя >= 56 И ЗначениеПоказателя <= 75 Тогда
				Результат = 4.7;
			ИначеЕсли  ЗначениеПоказателя > 75 Тогда
				Результат = 8;
			КонецЕсли;
		ИначеЕсли ГруппыХ[ГруппаХарактеристик] = 1 Тогда
			Если ЗначениеПоказателя < 40 Тогда
				Результат = 0;
			ИначеЕсли  ЗначениеПоказателя >= 40 И ЗначениеПоказателя <= 55 Тогда
				Результат = 2.75;
			ИначеЕсли  ЗначениеПоказателя >= 56 И ЗначениеПоказателя <= 75 Тогда
				Результат = 4;
			ИначеЕсли  ЗначениеПоказателя > 75 Тогда
				Результат = 7;
			КонецЕсли;
		ИначеЕсли ГруппыХ[ГруппаХарактеристик] = 2 Тогда
			Если ЗначениеПоказателя < 40 Тогда
				Результат = 0;
			ИначеЕсли  ЗначениеПоказателя >= 40 И ЗначениеПоказателя <= 55 Тогда
				Результат = 1;
			ИначеЕсли  ЗначениеПоказателя >= 56 И ЗначениеПоказателя <= 75 Тогда
				Результат = 3;
			ИначеЕсли  ЗначениеПоказателя > 75 Тогда
				Результат = 7;
			КонецЕсли;
		ИначеЕсли ГруппыХ[ГруппаХарактеристик] = 3 Тогда
			Если ЗначениеПоказателя < 40 Тогда
				Результат = 0;
			ИначеЕсли  ЗначениеПоказателя >= 40 И ЗначениеПоказателя <= 55 Тогда
				Результат = 2;
			ИначеЕсли  ЗначениеПоказателя >= 56 И ЗначениеПоказателя <= 75 Тогда
				Результат = 5;
			ИначеЕсли  ЗначениеПоказателя > 75 Тогда
				Результат = 9;
			КонецЕсли;
		ИначеЕсли ГруппыХ[ГруппаХарактеристик] = 4 Тогда
			Если ЗначениеПоказателя < 40 Тогда
				Результат = 0;
			ИначеЕсли  ЗначениеПоказателя >= 40 И ЗначениеПоказателя <= 55 Тогда
				Результат = 3.5;
			ИначеЕсли  ЗначениеПоказателя >= 56 И ЗначениеПоказателя <= 75 Тогда
				Результат = 6.5;
			ИначеЕсли  ЗначениеПоказателя > 75 Тогда
				Результат = 8;
			КонецЕсли;
		ИначеЕсли ГруппыХ[ГруппаХарактеристик] = 5 Тогда
			Если ЗначениеПоказателя < 40 Тогда
				Результат = 0;
			ИначеЕсли  ЗначениеПоказателя >= 40 И ЗначениеПоказателя <= 55 Тогда
				Результат = 1;
			ИначеЕсли  ЗначениеПоказателя >= 56 И ЗначениеПоказателя <= 75 Тогда
				Результат = 5;
			ИначеЕсли  ЗначениеПоказателя > 75 Тогда
				Результат = 11;
			КонецЕсли;
		ИначеЕсли ГруппыХ[ГруппаХарактеристик] = 6 Тогда
			Если ЗначениеПоказателя < 40 Тогда
				Результат = 0;
			ИначеЕсли  ЗначениеПоказателя >= 40 И ЗначениеПоказателя <= 55 Тогда
				Результат = 1;
			ИначеЕсли  ЗначениеПоказателя >= 56 И ЗначениеПоказателя <= 75 Тогда
				Результат = 3;
			ИначеЕсли  ЗначениеПоказателя > 75 Тогда
				Результат = 6.5;
			КонецЕсли;
		ИначеЕсли ГруппыХ[ГруппаХарактеристик] = 7 Тогда
			Если ЗначениеПоказателя < 40 Тогда
				Результат = 0;
			ИначеЕсли  ЗначениеПоказателя >= 40 И ЗначениеПоказателя <= 55 Тогда
				Результат = 2;
			ИначеЕсли  ЗначениеПоказателя >= 56 И ЗначениеПоказателя <= 75 Тогда
				Результат = 6;
			ИначеЕсли  ЗначениеПоказателя > 75 Тогда
				Результат = 8;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Характеристика = ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СПАРК_ИндексФинансовогоРиска") Тогда
		
		Если ГруппыХ[ГруппаХарактеристик] = 0 Тогда
			Если ЗначениеПоказателя < 50 Тогда
				Результат = 0;
			ИначеЕсли ЗначениеПоказателя >= 51 И ЗначениеПоказателя <= 60 Тогда
				Результат = 2;
			ИначеЕсли ЗначениеПоказателя >= 61 И ЗначениеПоказателя <= 80 Тогда
				Результат = 4.7;
			ИначеЕсли ЗначениеПоказателя > 80 Тогда
				Результат = 8;
			КонецЕсли;
		ИначеЕсли ГруппыХ[ГруппаХарактеристик] = 1 Тогда
			Если ЗначениеПоказателя < 50 Тогда
				Результат = 0;
			ИначеЕсли ЗначениеПоказателя >= 51 И ЗначениеПоказателя <= 60 Тогда
				Результат = 2.75;
			ИначеЕсли ЗначениеПоказателя >= 61 И ЗначениеПоказателя <= 80 Тогда
				Результат = 4;
			ИначеЕсли ЗначениеПоказателя > 80 Тогда
				Результат = 7;
			КонецЕсли;
		ИначеЕсли ГруппыХ[ГруппаХарактеристик] = 2 Тогда
			Если ЗначениеПоказателя < 50 Тогда
				Результат = 0;
			ИначеЕсли ЗначениеПоказателя >= 51 И ЗначениеПоказателя <= 60 Тогда
				Результат = 1;
			ИначеЕсли ЗначениеПоказателя >= 61 И ЗначениеПоказателя <= 80 Тогда
				Результат = 3;
			ИначеЕсли ЗначениеПоказателя > 80 Тогда
				Результат = 7;
			КонецЕсли;
		ИначеЕсли ГруппыХ[ГруппаХарактеристик] = 3 Тогда
			Если ЗначениеПоказателя < 50 Тогда
				Результат = 0;
			ИначеЕсли ЗначениеПоказателя >= 51 И ЗначениеПоказателя <= 60 Тогда
				Результат = 2.9;
			ИначеЕсли ЗначениеПоказателя >= 61 И ЗначениеПоказателя <= 80 Тогда
				Результат = 5;
			ИначеЕсли ЗначениеПоказателя > 80 Тогда
				Результат = 9;
			КонецЕсли;
		ИначеЕсли ГруппыХ[ГруппаХарактеристик] = 4 Тогда
			Если ЗначениеПоказателя < 50 Тогда
				Результат = 0;
			ИначеЕсли ЗначениеПоказателя >= 51 И ЗначениеПоказателя <= 60 Тогда
				Результат = 3.5;
			ИначеЕсли ЗначениеПоказателя >= 61 И ЗначениеПоказателя <= 80 Тогда
				Результат = 6.5;
			ИначеЕсли ЗначениеПоказателя > 80 Тогда
				Результат = 8;
			КонецЕсли;
		ИначеЕсли ГруппыХ[ГруппаХарактеристик] = 5 Тогда
			Если ЗначениеПоказателя < 50 Тогда
				Результат = 0;
			ИначеЕсли ЗначениеПоказателя >= 51 И ЗначениеПоказателя <= 60 Тогда
				Результат = 1;
			ИначеЕсли ЗначениеПоказателя >= 61 И ЗначениеПоказателя <= 80 Тогда
				Результат = 5;
			ИначеЕсли ЗначениеПоказателя > 80 Тогда
				Результат = 11;
			КонецЕсли;
		ИначеЕсли ГруппыХ[ГруппаХарактеристик] = 6 Тогда
			Если ЗначениеПоказателя < 50 Тогда
				Результат = 0;
			ИначеЕсли ЗначениеПоказателя >= 51 И ЗначениеПоказателя <= 60 Тогда
				Результат = 1;
			ИначеЕсли ЗначениеПоказателя >= 61 И ЗначениеПоказателя <= 80 Тогда
				Результат = 3;
			ИначеЕсли ЗначениеПоказателя > 80 Тогда
				Результат = 6.5;
			КонецЕсли;
		ИначеЕсли ГруппыХ[ГруппаХарактеристик] = 7 Тогда
			Если ЗначениеПоказателя < 50 Тогда
				Результат = 0;
			ИначеЕсли ЗначениеПоказателя >= 51 И ЗначениеПоказателя <= 60 Тогда
				Результат = 2;
			ИначеЕсли ЗначениеПоказателя >= 61 И ЗначениеПоказателя <= 80 Тогда
				Результат = 6;
			ИначеЕсли ЗначениеПоказателя > 80 Тогда
				Результат = 8;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Характеристика = ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СПАРК_ИндексПлатежнойДисциплины") Тогда
		Если ГруппыХ[ГруппаХарактеристик] = 0 Тогда
			Если ЗначениеПоказателя > 95 Тогда
				Результат = 0;
			ИначеЕсли ЗначениеПоказателя >= 85 И ЗначениеПоказателя <= 95 Тогда
				Результат = 2;
			ИначеЕсли ЗначениеПоказателя >= 75 И ЗначениеПоказателя <= 84 Тогда
				Результат = 4.7;
			ИначеЕсли ЗначениеПоказателя < 75 Тогда
				Результат = 8;
			КонецЕсли;
		ИначеЕсли ГруппыХ[ГруппаХарактеристик] = 1 Тогда
			Если ЗначениеПоказателя > 95 Тогда
				Результат = 0;
			ИначеЕсли ЗначениеПоказателя >= 85 И ЗначениеПоказателя <= 95 Тогда
				Результат = 2.75;
			ИначеЕсли ЗначениеПоказателя >= 75 И ЗначениеПоказателя <= 84 Тогда
				Результат = 4;
			ИначеЕсли ЗначениеПоказателя < 75 Тогда
				Результат = 7;
			КонецЕсли;
		ИначеЕсли ГруппыХ[ГруппаХарактеристик] = 2 Тогда
			Если ЗначениеПоказателя > 95 Тогда
				Результат = 0;
			ИначеЕсли ЗначениеПоказателя >= 85 И ЗначениеПоказателя <= 95 Тогда
				Результат = 1;
			ИначеЕсли ЗначениеПоказателя >= 75 И ЗначениеПоказателя <= 84 Тогда
				Результат = 3;
			ИначеЕсли ЗначениеПоказателя < 75 Тогда
				Результат = 7;
			КонецЕсли;
		ИначеЕсли ГруппыХ[ГруппаХарактеристик] = 3 Тогда
			Если ЗначениеПоказателя > 95 Тогда
				Результат = 0;
			ИначеЕсли ЗначениеПоказателя >= 85 И ЗначениеПоказателя <= 95 Тогда
				Результат = 3;
			ИначеЕсли ЗначениеПоказателя >= 75 И ЗначениеПоказателя <= 84 Тогда
				Результат = 5;
			ИначеЕсли ЗначениеПоказателя < 75 Тогда
				Результат = 9;
			КонецЕсли;
		ИначеЕсли ГруппыХ[ГруппаХарактеристик] = 4 Тогда
			Если ЗначениеПоказателя > 95 Тогда
				Результат = 0;
			ИначеЕсли ЗначениеПоказателя >= 85 И ЗначениеПоказателя <= 95 Тогда
				Результат = 3.5;
			ИначеЕсли ЗначениеПоказателя >= 75 И ЗначениеПоказателя <= 84 Тогда
				Результат = 6.5;
			ИначеЕсли ЗначениеПоказателя < 75 Тогда
				Результат = 8;
			КонецЕсли;
		ИначеЕсли ГруппыХ[ГруппаХарактеристик] = 5 Тогда
			Если ЗначениеПоказателя > 95 Тогда
				Результат = 0;
			ИначеЕсли ЗначениеПоказателя >= 85 И ЗначениеПоказателя <= 95 Тогда
				Результат = 1;
			ИначеЕсли ЗначениеПоказателя >= 75 И ЗначениеПоказателя <= 84 Тогда
				Результат = 5;
			ИначеЕсли ЗначениеПоказателя < 75 Тогда
				Результат = 11;
			КонецЕсли;
		ИначеЕсли ГруппыХ[ГруппаХарактеристик] = 6 Тогда
			Если ЗначениеПоказателя > 95 Тогда
				Результат = 0;
			ИначеЕсли ЗначениеПоказателя >= 85 И ЗначениеПоказателя <= 95 Тогда
				Результат = 1;
			ИначеЕсли ЗначениеПоказателя >= 75 И ЗначениеПоказателя <= 84 Тогда
				Результат = 3;
			ИначеЕсли ЗначениеПоказателя < 75 Тогда
				Результат = 6.5;
			КонецЕсли;
		ИначеЕсли ГруппыХ[ГруппаХарактеристик] = 7 Тогда
			Если ЗначениеПоказателя > 95 Тогда
				Результат = 0;
			ИначеЕсли ЗначениеПоказателя >= 85 И ЗначениеПоказателя <= 95 Тогда
				Результат = 2;
			ИначеЕсли ЗначениеПоказателя >= 75 И ЗначениеПоказателя <= 84 Тогда
				Результат = 6;
			ИначеЕсли ЗначениеПоказателя < 75 Тогда
				Результат = 9;
			КонецЕсли;
		КонецЕсли;
	Иначе
		
		// иначе используем воображение и достаем кролика из шляпы
		
		ЭлементыХ = Новый Соответствие;
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ПринятиеНашихТиповыхФорм"), 0);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.РепутацияПоложительнаяИлиНейтральная"), 1);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.НаличиеЛицензий"), 2);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.Гарантии"), 3);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УровеньСтавокСкидки"), 4);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ОтсутствиеШтрафныхСанкцийПенейВНашАдрес"), 5);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ИспользованиеЭДО"), 6);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СвоевременноеПредоставлениеДокументовИИхСоответствиеЗаконодательству"), 7);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.СобственникРесурснойБазы"), 8);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УсловияПоОплатеПослеПодписанияАктовВыполненныхРабот"), 9);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ОперативнаяПодачаПодПогрузку"), 10);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.НаличиеСертификатовISO14001ISO45001"), 11);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ГарантииОтветственностьИВозмещениеУбытковКомпанииВСлучаеСрываПер"), 12);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УсловиеПоОплатеВозможенОбеспечительныйПлатежДалееОплатаПослеПодписания"), 13);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ПлановыйРемонтЗаСчетСобственникаАрендныеКаникулы"), 14);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.РемонтПоВУ41ЗаСчетСобственникаТРСЗаменойДеталейЗаСчетСобственника"), 15);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ЛинияИлиАффилированноеСНейЛицо"), 16);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ОтсутствиеШтрафовПенейИлиИхНизкийУровень"), 17);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УсловияОплатыПоФактуПослеПодписанияКопийАктовВыполненныхРабот"), 18);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ГрузоотправительИлиАффилированноеСНимЛицо"), 19);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УсловияОплатыПоФактуПослеПодписанияОригиналовАктовВыполненныхРабот"), 20);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ГрузоотправительЖДГосударстваИлиАффилированноеСНимЛицо"), 21);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ГрузоотправительРЖДИлиАффилированноеСНимЛицо"), 22);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ДостаточныеОбъемыЗапасныхЧастей"), 23);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УровеньСтавокНаРемонтИЗапчасти"), 24);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ОперативныеСрокиРемонтов"), 25);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УдобствоРегиональногоРасположенияДепоОптимизируетЖДТариф"), 26);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ПривлекательныеУсловияИСтоимостьХраненияЗапчастей"), 27);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ГарантииСрокГарантииПоВУ41НеМенее253летВозмещениеПоГарантийнымСлучаям"), 28);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ПроизводительИлиАффилированноеСНимЛицо"), 29);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ГарантииПоставщикаТоваровУслуг"), 30);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УсловияОплаты30КалендарныхДнейПослеПодписанияОригиналовАктов"), 31);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ДостаточныеЗапасыНаСкладахПоставщика"), 32);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.УсловияПоОплатеПослеПоставкиТМЦИПодписанияТоварныхНакладных"), 33);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.ДоставкаТМЦНаСкладГрузополучателяЗаСчетПоставщика"), 34);
		ЭлементыХ.Вставить(ПредопределенноеЗначение("Перечисление.ХарактеристикиПодрядчиков.РегионПоставщикаВНепосредственнойБлизостиОтГрузополучателя"), 35);
		
		НомерСтроки = 7 + ГруппыХ[ГруппаХарактеристик] * 36 + ЭлементыХ[Характеристика];
		НомерКолонки = 3 + ЗначениеПоказателя;
		
		Результат = РейтингиИРискиКонтрагентовСервер.ПолучитьЗначениеИзМакета(НомерСтроки, НомерКолонки);

	КонецЕсли;
	
		
	Возврат Результат;
	
КонецФункции

