
&НаКлиенте
Процедура ЗаполнитьГрузамиВТаре(Команда)
	Объект.ОборотнаяТара.Очистить();
	ЗаполнитьГрузамиВТареНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГрузамиВТареНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТараВКонтейнерахОстатки.ОборотнаяТара КАК ОборотнаяТара,
	               |	ТараВКонтейнерахОстатки.Контейнер КАК Контейнер
	               |ИЗ
	               |	РегистрНакопления.ТараВКонтейнерах.Остатки(, Контейнер В (&КТК)) КАК ТараВКонтейнерахОстатки
	               |ГДЕ
	               |	ТараВКонтейнерахОстатки.ЗатареноОстаток > 0";
	Запрос.УстановитьПараметр("КТК", Объект.СписокКонтейнеров.Выгрузить().ВыгрузитьКолонку("Контейнер"));
	Ответ = запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		НСтр = Объект.ОборотнаяТара.Добавить();
		НСтр.Тара = Ответ.ОборотнаяТара;
		НСтр.Контейнер = Ответ.Контейнер;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТараПриИзменении(Элемент)
	
	Объект.ТипКонтейнера = ПолучитьТипКТК(Объект.Контейнер);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТипКТК(Контейнер)
	
	Возврат Контейнер.ТипТЕ;
	
КонецФункции


&НаКлиенте
Процедура ВставитьИзEXCEL(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВставкиExcel", ЭтаФорма, Новый Структура("КТК", Истина));
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("КТК", Истина), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВставкиExcel(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 <> неопределено  Тогда
		
		Для каждого стр из Параметр1 Цикл
			
			НСтр = Объект.СписокКонтейнеров.Добавить();
			НСтр.Контейнер = стр;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКонтейнеровПриИзменении(Элемент)
	
	МассивРазрешенныхПолей = Новый Массив;
	МассивРазрешенныхПолей.Добавить("ВыдачаПодЗатаркуРастарку");
	МассивРазрешенныхПолей.Добавить("НормативПользования");
	МассивРазрешенныхПолей.Добавить("ВозвратОтКлиента");
	
	Если ЗаполнятьПоПервойСтроке Тогда
		ИмяТЧ = Элемент.Имя;
		ИмяПоля = Сред(Элемент.ТекущийЭлемент.Имя, СтрДлина(ИмяТЧ)+1);
		
		Если МассивРазрешенныхПолей.Найти(ИмяПоля) = неопределено Тогда Возврат; КонецЕсли;
		Для Сч = 1 По Объект[ИмяТЧ].Количество() - 1 Цикл
			Объект[ИмяТЧ][Сч][ИмяПоля] = Объект[ИмяТЧ][0][ИмяПоля];
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )
