

Процедура ПриЗаписи(Отказ)  
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
    СоздатьТранспортныйДокумент();
	
	НаборЗаписей = РегистрыСведений.э_ИсторияНакладных.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(Дата);
	Запись = НаборЗаписей.Добавить();
	Запись.Период								= Дата;
	Запись.НомерНакладной						= Номер;
	Запись.ИДНакладной							= НакладнаяИД;
	Запись.ИДСостояниеНакладной					= ТекущегоСостояниеНакладнойИД;
	Запись.CостояниеНакладной					= ТекущееСостояниеНакладной;
	Запись.ДатаПоследнейОперацииНадДокументом	= ДатаПоследнейОперацииНадДокументом;
	НаборЗаписей.Записать();

КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр АктуальныеЖДН Приход
	//Движения.АктуальныеЖДН.Записывать = Истина;  
	
	//Евросиб - АСуслов 01.04.2022 11:20:04 #
	//(
	//перенес в ТД
	//)
	//Евросиб - АСуслов 01.04.2022 11:20:05 #
	//Для Каждого ТекСтрокаКонтейнеры Из Контейнеры Цикл
	//	Движение = Движения.АктуальныеЖДН.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//	Движение.Период = Дата;
	//	Движение.Контейнер = Справочники.ТЕ.НайтиПоНаименованию(ТекСтрокаКонтейнеры.НомерКонтейнера);
	//	Движение.ЖДН = Номер;
	//	ПараметрыОтбора = Новый Структура;
	//	ПараметрыОтбора.Вставить("ПорядковыйНомерВагонаВОтправке",ТекСтрокаКонтейнеры.НомерВагонаДляКонтейнерногоПоезда);
	//	НайденныеСтроки = Вагоны.НайтиСтроки(ПараметрыОтбора);
	//	Для Каждого СтрВаг Из НайденныеСтроки Цикл
	//		Движение.Вагон = Справочники.ТС.НайтиПоНаименованию(СтрВаг.НомерВагона);
	//	КонецЦикла;
	//	Движение.Наличие = 1;
	//КонецЦикла;
	
	// создаем таблицу, в которую будем заносить данные по КТК, вагонам с КТК, вагонам без КТК, 
	// чтобы для каждой позиции не делать запрос в цикле.
	// Только для груженых накладных.
	
	// SIV 16-10-20 закомментил блок ниже, т.к. процесс поменялся и теперь автоматическое прописывание накладной в сделку не нужно
	
	//////////Если ГруженаяНакладная Тогда
	//////////	ТаблицаДанныхДляСделок = Новый ТаблицаЗначений;
	//////////	
	//////////	КС = Новый КвалификаторыСтроки(20);
	//////////	Массив = Новый Массив;
	//////////	Массив.Добавить(Тип("Строка"));
	//////////	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	//////////	
	//////////	ТаблицаДанныхДляСделок.Колонки.Добавить("Контейнер",Новый ОписаниеТипов("СправочникСсылка.ТЕ"));
	//////////	ТаблицаДанныхДляСделок.Колонки.Добавить("КонтейнерСтрока",ОписаниеТиповС);
	//////////	ТаблицаДанныхДляСделок.Колонки.Добавить("Вагон",ОписаниеТиповС);
	//////////	ЖДН = Номер;
	//////////	// заполнение рагистра по разнесению накладных в сделки НакладныеИСделки
	//////////	// 1. сначала цикл по контейнерам и вагонам, которые с ними связаны
	//////////	Для Каждого ТекСтрокаКонтейнеры Из Контейнеры Цикл
	//////////		КТК = Справочники.ТЕ.НайтиПоНаименованию(ТекСтрокаКонтейнеры.НомерКонтейнера);
	//////////		ПараметрыОтбора = Новый Структура;
	//////////		ПараметрыОтбора.Вставить("ПорядковыйНомерВагонаВОтправке",ТекСтрокаКонтейнеры.НомерВагонаДляКонтейнерногоПоезда);
	//////////		НайденныеСтроки = Вагоны.НайтиСтроки(ПараметрыОтбора);
	//////////		Если НайденныеСтроки.Количество()>0 Тогда
	//////////			ВагонСКТК = НайденныеСтроки[0].НомерВагона;
	//////////		Иначе
	//////////			ВагонСКТК = "";
	//////////		КонецЕсли;
	//////////		НовСтр = ТаблицаДанныхДляСделок.Добавить();
	//////////		НовСтр.Контейнер = КТК;
	//////////		НовСтр.КонтейнерСтрока = ТекСтрокаКонтейнеры.НомерКонтейнера;
	//////////		НовСтр.Вагон = ВагонСКТК;
	//////////	КонецЦикла;
	//////////	// 2. Делаем запрос по сделкам.
	//////////	// ЖДН у них должна быть не заполнена
	//////////	Запрос = Новый Запрос;
	//////////	Запрос.Текст = "ВЫБРАТЬ
	//////////	               |	ВремТЧ.Контейнер КАК Контейнер,
	//////////	               |	ВремТЧ.КонтейнерСтрока КАК КонтейнерСтрока,
	//////////	               |	ВремТЧ.Вагон КАК Вагон
	//////////	               |ПОМЕСТИТЬ ВТ
	//////////	               |ИЗ
	//////////	               |	&ВремТЧ КАК ВремТЧ
	//////////	               |;
	//////////	               |
	//////////	               |////////////////////////////////////////////////////////////////////////////////
	//////////	               |ВЫБРАТЬ
	//////////	               |	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	//////////	               |	ВТ.КонтейнерСтрока КАК КонтейнерСтрока,
	//////////	               |	ВТ.Вагон КАК Вагон,
	//////////	               |	МАКСИМУМ(СделкаСвязьУчетныхЕдиниц.Ссылка.Дата) КАК Дата
	//////////	               |ПОМЕСТИТЬ МаксимальнаяДатаСделки
	//////////	               |ИЗ
	//////////	               |	ВТ КАК ВТ
	//////////	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	//////////	               |		ПО ВТ.Контейнер = СделкаСвязьУчетныхЕдиниц.Контейнер
	//////////	               |ГДЕ
	//////////	               |	СделкаСвязьУчетныхЕдиниц.НомерЖДН = """"
	//////////	               |
	//////////	               |СГРУППИРОВАТЬ ПО
	//////////	               |	СделкаСвязьУчетныхЕдиниц.Контейнер,
	//////////	               |	ВТ.КонтейнерСтрока,
	//////////	               |	ВТ.Вагон
	//////////	               |;
	//////////	               |
	//////////	               |////////////////////////////////////////////////////////////////////////////////
	//////////	               |ВЫБРАТЬ
	//////////	               |	МаксимальнаяДатаСделки.Контейнер КАК Контейнер,
	//////////	               |	МаксимальнаяДатаСделки.Вагон КАК Вагон,
	//////////	               |	МаксимальнаяДатаСделки.КонтейнерСтрока КАК КонтейнерСтрока,
	//////////	               |	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Сделка
	//////////	               |ПОМЕСТИТЬ СделкаВагонКТК
	//////////	               |ИЗ
	//////////	               |	МаксимальнаяДатаСделки КАК МаксимальнаяДатаСделки
	//////////	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	//////////	               |		ПО МаксимальнаяДатаСделки.Контейнер = СделкаСвязьУчетныхЕдиниц.Контейнер
	//////////	               |			И МаксимальнаяДатаСделки.Дата = СделкаСвязьУчетныхЕдиниц.Ссылка.Дата
	//////////	               |;
	//////////	               |
	//////////	               |////////////////////////////////////////////////////////////////////////////////
	//////////	               |ВЫБРАТЬ
	//////////	               |	э_НакладнаяВагоны.НомерВагона КАК НомерВагона,
	//////////	               |	МАКСИМУМ(э_НакладнаяВагоны.Ссылка.ДатаИВремяПрибытияГруза) КАК ДатаИВремяПрибытияГруза
	//////////	               |ПОМЕСТИТЬ МаксимальнаяДатаВагЖДН
	//////////	               |ИЗ
	//////////	               |	СделкаВагонКТК КАК СделкаВагонКТК
	//////////	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
	//////////	               |		ПО СделкаВагонКТК.Вагон = э_НакладнаяВагоны.НомерВагона
	//////////	               |ГДЕ
	//////////	               |	э_НакладнаяВагоны.Ссылка.ДатаИВремяПрибытияГруза МЕЖДУ &ДатаНач И &ДатаКон
	//////////	               |	И НЕ э_НакладнаяВагоны.Ссылка.ДатаИВремяПрибытияГруза = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//////////	               |
	//////////	               |СГРУППИРОВАТЬ ПО
	//////////	               |	э_НакладнаяВагоны.НомерВагона
	//////////	               |;
	//////////	               |
	//////////	               |////////////////////////////////////////////////////////////////////////////////
	//////////	               |ВЫБРАТЬ
	//////////	               |	э_НакладнаяВагоны.Ссылка КАК ЖДНВаг,
	//////////	               |	э_НакладнаяВагоны.НомерВагона КАК НомерВагона
	//////////	               |ПОМЕСТИТЬ ПорожНаклВагон
	//////////	               |ИЗ
	//////////	               |	МаксимальнаяДатаВагЖДН КАК МаксимальнаяДатаВагЖДН
	//////////	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
	//////////	               |		ПО МаксимальнаяДатаВагЖДН.ДатаИВремяПрибытияГруза = э_НакладнаяВагоны.Ссылка.ДатаИВремяПрибытияГруза
	//////////	               |			И МаксимальнаяДатаВагЖДН.НомерВагона = э_НакладнаяВагоны.НомерВагона
	//////////	               |;
	//////////	               |
	//////////	               |////////////////////////////////////////////////////////////////////////////////
	//////////	               |ВЫБРАТЬ
	//////////	               |	э_НакладнаяКонтейнеры.НомерКонтейнера КАК НомерКонтейнера,
	//////////	               |	МАКСИМУМ(э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяПрибытияГруза) КАК ДатаИВремяПрибытияГруза
	//////////	               |ПОМЕСТИТЬ МаксимальнаяДатаКТКЖДН
	//////////	               |ИЗ
	//////////	               |	СделкаВагонКТК КАК СделкаВагонКТК
	//////////	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
	//////////	               |		ПО СделкаВагонКТК.КонтейнерСтрока = э_НакладнаяКонтейнеры.НомерКонтейнера
	//////////	               |ГДЕ
	//////////	               |	э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяПрибытияГруза МЕЖДУ &ДатаНач И &ДатаКон
	//////////	               |	И НЕ э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяПрибытияГруза = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//////////	               |
	//////////	               |СГРУППИРОВАТЬ ПО
	//////////	               |	э_НакладнаяКонтейнеры.НомерКонтейнера
	//////////	               |;
	//////////	               |
	//////////	               |////////////////////////////////////////////////////////////////////////////////
	//////////	               |ВЫБРАТЬ
	//////////	               |	э_НакладнаяКонтейнеры.Ссылка КАК ЖДНКТК,
	//////////	               |	э_НакладнаяКонтейнеры.НомерКонтейнера КАК НомерКонтейнера
	//////////	               |ПОМЕСТИТЬ ПорожНаклКТК
	//////////	               |ИЗ
	//////////	               |	МаксимальнаяДатаКТКЖДН КАК МаксимальнаяДатаКТКЖДН
	//////////	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
	//////////	               |		ПО МаксимальнаяДатаКТКЖДН.ДатаИВремяПрибытияГруза = э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяПрибытияГруза
	//////////	               |			И МаксимальнаяДатаКТКЖДН.НомерКонтейнера = э_НакладнаяКонтейнеры.НомерКонтейнера
	//////////	               |;
	//////////	               |
	//////////	               |////////////////////////////////////////////////////////////////////////////////
	//////////	               |ВЫБРАТЬ
	//////////	               |	ПорожНаклВагон.ЖДНВаг.НакладнаяНомер КАК ЖДНВаг,
	//////////	               |	СделкаВагонКТК.Контейнер КАК Контейнер,
	//////////	               |	СделкаВагонКТК.КонтейнерСтрока КАК КонтейнерСтрока,
	//////////	               |	СделкаВагонКТК.Сделка КАК Сделка,
	//////////	               |	ТС.Ссылка КАК Вагон,
	//////////	               |	ПорожНаклКТК.ЖДНКТК.НакладнаяНомер КАК ЖДНКТК,
	//////////	               |	ПорожНаклВагон.ЖДНВаг.ДатаИВремяОтправленияГруза КАК ДатаИВремяОтправленияГруза
	//////////	               |ИЗ
	//////////	               |	СделкаВагонКТК КАК СделкаВагонКТК
	//////////	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПорожНаклВагон КАК ПорожНаклВагон
	//////////	               |		ПО СделкаВагонКТК.Вагон = ПорожНаклВагон.НомерВагона
	//////////	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТС КАК ТС
	//////////	               |		ПО СделкаВагонКТК.Вагон = ТС.Наименование
	//////////	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПорожНаклКТК КАК ПорожНаклКТК
	//////////	               |		ПО СделкаВагонКТК.КонтейнерСтрока = ПорожНаклКТК.НомерКонтейнера";
	//////////	Запрос.УстановитьПараметр("ВремТЧ",ТаблицаДанныхДляСделок);
	//////////	Запрос.УстановитьПараметр("ДатаНач",ДатаИВремяОтправленияГруза-20*3600*24);
	//////////	Запрос.УстановитьПараметр("ДатаКон",ДатаИВремяОтправленияГруза);
	//////////	
	//////////	ТЗ_Сделки = Запрос.Выполнить().Выгрузить();
	//////////	
	//////////	// запрос порожней вагонной накладной для подсыла
	//////////	ЗапросСовсемПорожнего = Новый Запрос;
	//////////	ЗапросСовсемПорожнего.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//////////	                        |	э_НакладнаяВагоны.Ссылка КАК ПорожняяНакладная,
	//////////	                        |	э_НакладнаяВагоны.Ссылка.Номер КАК Номер
	//////////	                        |ИЗ
	//////////	                        |	Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
	//////////	                        |ГДЕ
	//////////	                        |	э_НакладнаяВагоны.НомерВагона = &НомерВагона
	//////////	                        |	И НЕ э_НакладнаяВагоны.Ссылка.ПометкаУдаления
	//////////	                        |	И НЕ э_НакладнаяВагоны.Ссылка.ДатаИВремяПрибытияГруза = ДАТАВРЕМЯ(1,1,1,0,0,0)
	//////////	                        |	И э_НакладнаяВагоны.Ссылка.ДатаИВремяПрибытияГруза МЕЖДУ &ДатаНач И &ДатаКон
	//////////	                        |
	//////////	                        |УПОРЯДОЧИТЬ ПО
	//////////	                        |	э_НакладнаяВагоны.Ссылка.ДатаИВремяПрибытияГруза УБЫВ";
	//////////	
	//////////	Для Каждого Стр Из ТЗ_Сделки Цикл
	//////////		Если НЕ ЗначениеЗаполнено(Стр.ДатаИВремяОтправленияГруза) Тогда Продолжить; КонецЕсли;
	//////////		
	//////////		МенеджерЗаписи = РегистрыСведений.НакладныеИСделки.СоздатьМенеджерЗаписи();
	//////////		МенеджерЗаписи.Период = Дата;
	//////////		МенеджерЗаписи.Контейнер = Стр.Контейнер;
	//////////		МенеджерЗаписи.Вагон = Справочники.ТС.НайтиПоНаименованию(Стр.Вагон);
	//////////		МенеджерЗаписи.Сделка = Стр.Сделка;
	//////////		МенеджерЗаписи.ЖДНВагон = Стр.ЖДНВаг;
	//////////		МенеджерЗаписи.ЖДНКТК = Стр.ЖДНКТК;
	//////////		
	//////////		ЗапросСовсемПорожнего.УстановитьПараметр("НомерВагона", Строка(Стр.Вагон));
	//////////		ЗапросСовсемПорожнего.УстановитьПараметр("ДатаНач", Стр.ДатаИВремяОтправленияГруза-20*3600*24);
	//////////		ЗапросСовсемПорожнего.УстановитьПараметр("ДатаКон", Стр.ДатаИВремяОтправленияГруза);
	//////////		ОтветСовсемПорожнего = ЗапросСовсемПорожнего.Выполнить().Выбрать();
	//////////		Если ОтветСовсемПорожнего.Следующий() Тогда
	//////////			
	//////////			МенеджерЗаписи.ЖДНПорожнийВагон = ОтветСовсемПорожнего.Номер;
	//////////			
	//////////		КонецЕсли;
	//////////		
	//////////		МенеджерЗаписи.Накладная = Ссылка;
	//////////		МенеджерЗаписи.Записать();
	//////////	КонецЦикла;
	//////////КонецЕсли;
	
	
	Для Каждого Стр Из Вагоны Цикл
		МенеджерЗаписи = РегистрыСведений.ВагоныВНакладных.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = Дата;
		МенеджерЗаписи.ВагонСтрока = Стр.НомерВагона;
		МенеджерЗаписи.Вагон = Справочники.ТС.НайтиПоНаименованию(Стр.НомерВагона);
		МенеджерЗаписи.Накладная = Ссылка;
		МенеджерЗаписи.Грузополучатель = Грузополучатель;
		МенеджерЗаписи.ПлановаяДатаДоставки = ДатаИстеченияСрокаДоставки;
		МенеджерЗаписи.Записать();
	КонецЦикла;

	// регистр ЖДНдляРаботыАРМ
	//Движения.ЖДНдляРаботыАРМ.Записывать = Истина;
	//Если ТекущееСостояниеНакладной.ДействующийСтатус Тогда
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ
	//	               |	э_Накладная.Ссылка КАК Накладная,
	//	               |	э_НакладнаяКонтейнеры.НомерКонтейнера КАК Контейнер,
	//	               |	э_НакладнаяВагоны.НомерВагона КАК Вагон,
	//	               |	э_НакладнаяКонтейнеры.МассыВКгНетто КАК МассыВКгНетто,
	//	               |	э_НакладнаяВагоны.ГрузоподъемностьВТн КАК ГрузоподъемностьВТн,
	//	               |	э_Накладная.СтанцияОтправления КАК СтанцияОтправления,
	//	               |	э_Накладная.СтанцияОтправления.Дорога КАК СтанцияОтправленияДорога,
	//	               |	э_Накладная.СтанцияНазначения КАК СтанцияНазначения,
	//	               |	э_Накладная.СтанцияНазначения.Дорога КАК СтанцияНазначенияДорога,
	//	               |	э_НакладнаяГрузыЖД.ЕТСНГ КАК ЕТСНГ,
	//	               |	э_НакладнаяГрузыЖД.НомерГТД КАК НомерГТД,
	//	               |	э_Накладная.Дата КАК Дата,
	//	               |	э_Накладная.ПлательщикНаименование КАК ПлательщикНаименование,
	//	               |	э_НакладнаяВагоны.РодВагона КАК РодВагона,
	//	               |	э_Накладная.ГрузоотправительОКПО КАК ГрузоотправительОКПО,
	//	               |	э_Накладная.ГрузополучательОКПО КАК ГрузополучательОКПО,
	//	               |	ТЕ.Ссылка КАК КонтейнерСсылка,
	//	               |	ТС.Ссылка КАК ВагонСсылка,
	//	               |	э_НакладнаяКонтейнерыЗПУСтрока.ЗПУ КАК КонтейнерЗПУ,
	//	               |	ЕСТЬNULL(э_НакладнаяСуммаНаВагон.СуммаПоОтправлению, 0) + ЕСТЬNULL(э_НакладнаяСуммаНаКонтейнер.СуммаПоОтправлению, 0) КАК СуммаПоОтправлению,
	//	               |	ЕСТЬNULL(э_НакладнаяСуммаНаВагон.СуммаПоРаскредитации, 0) + ЕСТЬNULL(э_НакладнаяСуммаНаКонтейнер.СуммаПоРаскредитации, 0) КАК СуммаПоРаскредитации,
	//	               |	КлассыГрузов.class КАК КлассГруза
	//	               |ПОМЕСТИТЬ ВагоныКонтейнеры
	//	               |ИЗ
	//	               |	Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
	//	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТС КАК ТС
	//	               |		ПО э_НакладнаяВагоны.НомерВагона = ТС.Наименование
	//	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
	//	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
	//	               |			ПО э_НакладнаяКонтейнеры.НомерКонтейнера = ТЕ.Наименование
	//	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.КонтейнерыЗПУСтрока КАК э_НакладнаяКонтейнерыЗПУСтрока
	//	               |			ПО э_НакладнаяКонтейнеры.Ссылка = э_НакладнаяКонтейнерыЗПУСтрока.Ссылка
	//	               |				И э_НакладнаяКонтейнеры.НомерКонтейнера = э_НакладнаяКонтейнерыЗПУСтрока.НомерКонтейнера
	//	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.СуммаНаКонтейнер КАК э_НакладнаяСуммаНаКонтейнер
	//	               |			ПО э_НакладнаяКонтейнеры.НомерКонтейнера = э_НакладнаяСуммаНаКонтейнер.НомерКонтейнера
	//	               |				И э_НакладнаяКонтейнеры.Ссылка = э_НакладнаяСуммаНаКонтейнер.Ссылка
	//	               |		ПО (э_НакладнаяКонтейнеры.Ссылка = э_НакладнаяВагоны.Ссылка)
	//	               |			И (э_НакладнаяКонтейнеры.НомерВагонаДляКонтейнерногоПоезда = э_НакладнаяВагоны.ПорядковыйНомерВагонаВОтправке)
	//	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная КАК э_Накладная
	//	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.ГрузыЖД КАК э_НакладнаяГрузыЖД
	//	               |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлассыГрузов КАК КлассыГрузов
	//	               |				ПО э_НакладнаяГрузыЖД.КодЕТСНГ = КлассыГрузов.cgCode
	//	               |			ПО э_Накладная.Ссылка = э_НакладнаяГрузыЖД.Ссылка
	//	               |		ПО э_НакладнаяВагоны.Ссылка = э_Накладная.Ссылка
	//	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.СуммаНаВагон КАК э_НакладнаяСуммаНаВагон
	//	               |		ПО э_НакладнаяВагоны.НомерВагона = э_НакладнаяСуммаНаВагон.НомерВагона
	//	               |			И э_НакладнаяВагоны.Ссылка = э_НакладнаяСуммаНаВагон.Ссылка
	//	               |ГДЕ
	//	               |	э_Накладная.ТекущееСостояниеНакладной.ДействующийСтатус
	//	               |	И э_Накладная.Ссылка = &Ссылка
	//	               |;
	//	               |
	//	               |////////////////////////////////////////////////////////////////////////////////
	//	               |ВЫБРАТЬ
	//	               |	МАКСИМУМ(ПризнакСобственностиВагона.Период) КАК Период,
	//	               |	ПризнакСобственностиВагона.Вагон КАК Вагон
	//	               |ПОМЕСТИТЬ ПринадлежностьВагона
	//	               |ИЗ
	//	               |	РегистрСведений.ПризнакСобственностиВагона КАК ПризнакСобственностиВагона
	//	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВагоныКонтейнеры КАК ВагоныКонтейнеры
	//	               |		ПО ПризнакСобственностиВагона.Вагон.Наименование = ВагоныКонтейнеры.Вагон
	//	               |			И ПризнакСобственностиВагона.Период <= ВагоныКонтейнеры.Дата
	//	               |
	//	               |СГРУППИРОВАТЬ ПО
	//	               |	ПризнакСобственностиВагона.Вагон
	//	               |;
	//	               |
	//	               |////////////////////////////////////////////////////////////////////////////////
	//	               |ВЫБРАТЬ
	//	               |	ВагоныКонтейнеры.Накладная КАК Документ,
	//	               |	ВагоныКонтейнеры.Вагон КАК Вагон,
	//	               |	ВагоныКонтейнеры.Контейнер КАК Контейнер,
	//	               |	ВагоныКонтейнеры.МассыВКгНетто КАК ВесГруза,
	//	               |	ВагоныКонтейнеры.ГрузоподъемностьВТн КАК ГПВагона,
	//	               |	ВагоныКонтейнеры.НомерГТД КАК ТаможеннаяОтметка,
	//	               |	ВагоныКонтейнеры.СтанцияОтправления КАК СтанцияОтправления,
	//	               |	ВагоныКонтейнеры.СтанцияОтправленияДорога КАК ДорогаСтанцииОтправления,
	//	               |	ВагоныКонтейнеры.СтанцияНазначения КАК СтанцияНазначения,
	//	               |	ВагоныКонтейнеры.СтанцияНазначенияДорога КАК ДорогаСтанцииНазначения,
	//	               |	ВагоныКонтейнеры.ЕТСНГ КАК ГрузЕТСНГ,
	//	               |	ВагоныКонтейнеры.Дата КАК ДатаИмпорта,
	//	               |	ВагоныКонтейнеры.ПлательщикНаименование КАК Плательщик,
	//	               |	ВагоныКонтейнеры.РодВагона КАК РодВагона,
	//	               |	ВагоныКонтейнеры.ГрузоотправительОКПО КАК ОКПОГрузоотправителя,
	//	               |	ВагоныКонтейнеры.ГрузополучательОКПО КАК ОКПОГрузополучателя,
	//	               |	ВагоныКонтейнеры.КонтейнерСсылка КАК КонтейнерСсылка,
	//	               |	ВагоныКонтейнеры.ВагонСсылка КАК ВагонСсылка,
	//	               |	ВагоныКонтейнеры.КонтейнерЗПУ КАК НомерЗПУ,
	//	               |	ПринадлежностьВагона.Период КАК ПериодПринадлежностиВагона,
	//	               |	ВагоныКонтейнеры.СуммаПоОтправлению КАК СуммаПоОтправлению,
	//	               |	ВагоныКонтейнеры.СуммаПоРаскредитации КАК СуммаПоРаскредитации,
	//	               |	ВагоныКонтейнеры.КлассГруза КАК КлассГруза
	//	               |ПОМЕСТИТЬ Итоговая
	//	               |ИЗ
	//	               |	ВагоныКонтейнеры КАК ВагоныКонтейнеры
	//	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПринадлежностьВагона КАК ПринадлежностьВагона
	//	               |		ПО ВагоныКонтейнеры.Вагон = ПринадлежностьВагона.Вагон.Наименование
	//	               |;
	//	               |
	//	               |////////////////////////////////////////////////////////////////////////////////
	//	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	               |	Итоговая.Документ КАК Документ,
	//	               |	Итоговая.Вагон КАК Вагон,
	//	               |	Итоговая.Контейнер КАК Контейнер,
	//	               |	Итоговая.ВесГруза КАК ВесГруза,
	//	               |	Итоговая.ГПВагона КАК ГПВагона,
	//	               |	Итоговая.ТаможеннаяОтметка КАК ТаможеннаяОтметка,
	//	               |	Итоговая.СтанцияОтправления КАК СтанцияОтправления,
	//	               |	Итоговая.ДорогаСтанцииОтправления КАК ДорогаСтанцииОтправления,
	//	               |	Итоговая.СтанцияНазначения КАК СтанцияНазначения,
	//	               |	Итоговая.ДорогаСтанцииНазначения КАК ДорогаСтанцииНазначения,
	//	               |	Итоговая.ГрузЕТСНГ КАК ГрузЕТСНГ,
	//	               |	Итоговая.Плательщик КАК Плательщик,
	//	               |	Итоговая.РодВагона КАК РодВагона,
	//	               |	Итоговая.ОКПОГрузоотправителя КАК ОКПОГрузоотправителя,
	//	               |	Итоговая.ОКПОГрузополучателя КАК ОКПОГрузополучателя,
	//	               |	Итоговая.КонтейнерСсылка КАК КонтейнерСсылка,
	//	               |	Итоговая.ВагонСсылка КАК ВагонСсылка,
	//	               |	Итоговая.НомерЗПУ КАК НомерЗПУ,
	//	               |	ПризнакСобственностиВагонаСрезПоследних.ПризнакСобственности КАК СобственностьВагона,
	//	               |	ВЫБОР
	//	               |		КОГДА ПризнакСобственностиВагонаСрезПоследних.ПризнакСобственности = ЗНАЧЕНИЕ(Перечисление.ВариантыСобственности.Арендованный)
	//	               |			ТОГДА ИСТИНА
	//	               |		ИНАЧЕ ЛОЖЬ
	//	               |	КОНЕЦ КАК СданВАренду,
	//	               |	ВЫБОР
	//	               |		КОГДА Итоговая.Плательщик В
	//	               |				(ВЫБРАТЬ
	//	               |					орг.НаименованиеДляНакладной
	//	               |				ИЗ
	//	               |					Справочник.Организации КАК орг)
	//	               |			ТОГДА ИСТИНА
	//	               |		ИНАЧЕ ЛОЖЬ
	//	               |	КОНЕЦ КАК ПлательщикЕвросиб,
	//	               |	ПаспортаВагоновСрезПоследних.ДлинаПоОсямАвтосцепки КАК ДлинаПоОсямАвтосцепки,
	//	               |	Итоговая.СуммаПоОтправлению КАК СуммаТарифа,
	//	               |	Итоговая.СуммаПоРаскредитации КАК СуммаПоРаскредитации,
	//	               |	Итоговая.КлассГруза КАК КлассГруза
	//	               |ИЗ
	//	               |	Итоговая КАК Итоговая
	//	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПризнакСобственностиВагона.СрезПоследних(
	//	               |				,
	//	               |				(Вагон.Наименование, Период) В
	//	               |					(ВЫБРАТЬ
	//	               |						Итоговая.Вагон,
	//	               |						Итоговая.ПериодПринадлежностиВагона
	//	               |					ИЗ
	//	               |						Итоговая КАК Итоговая)) КАК ПризнакСобственностиВагонаСрезПоследних
	//	               |		ПО Итоговая.Вагон = ПризнакСобственностиВагонаСрезПоследних.Вагон.Наименование
	//	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортаВагонов.СрезПоследних КАК ПаспортаВагоновСрезПоследних
	//	               |		ПО Итоговая.Вагон = ПаспортаВагоновСрезПоследних.Вагон.Наименование
	//	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	//	               |		ПО Итоговая.Плательщик = Контрагенты.Наименование
	//	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	//	               |		ПО Итоговая.ОКПОГрузополучателя = Организации.ОКПО";
	//	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	//	
	//	ТЗ_Накладная = Запрос.Выполнить().Выгрузить();
	//	Для Каждого Стр Из ТЗ_Накладная Цикл
	//		Движение = Движения.ЖДНдляРаботыАРМ.Добавить();
	//		ЗаполнитьЗначенияСвойств(Движение,Стр);
	//		Движение.Период = Дата;
	//	КонецЦикла;
	//	
	//КонецЕсли;
	Если ЗначениеЗаполнено(ДатаИВремяПрибытияГруза) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТранспортныйДокумент.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
		               |ГДЕ
		               |	ТранспортныйДокумент.НакладнаяЭТРАН = &НакладнаяЭТРАН
		               |	И НЕ ТранспортныйДокумент.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("НакладнаяЭТРАН", Ссылка);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
		
			МЗ = РегистрыСведений.ТрДокПрибыл.СоздатьМенеджерЗаписи();
			МЗ.ТрДок = Выборка.Ссылка;
			МЗ.ДатаПрибыл = ДатаИВремяПрибытияГруза;
			МЗ.Записать();
		
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСтрокаОтметки Из СпециальныеОтметки Цикл
		Если ТекСтрокаОтметки.ОтметкаИД = 1224 ИЛИ
			ТекСтрокаОтметки.ОтметкаИД = 1212 ИЛИ
			ТекСтрокаОтметки.ОтметкаИД = 1213 Тогда
			Ремонт = ТекСтрокаОтметки.ОтметкаИД;
		ИначеЕсли ТекСтрокаОтметки.ОтметкаИД = 991 Тогда
			КонтейнерныйПоезд = Истина;
		КонецЕсли;
	КонецЦикла;
	
	КонтейнерыЗПУСтрока.Очистить();
	
	Для Каждого ТекЗПУ Из КонтейнерЗПУ Цикл
		Если ЗначениеЗаполнено(ТекЗПУ.Знаки) Тогда
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("НомерКонтейнера",ТекЗПУ.НомерКонтейнера);
			НайденныеСтроки = КонтейнерыЗПУСтрока.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() = 0 Тогда
				НовСтр = КонтейнерыЗПУСтрока.Добавить();
				НовСтр.НомерКонтейнера = ТекЗПУ.НомерКонтейнера;
				НовСтр.ЗПУ = ТекЗПУ.Знаки;
			Иначе
				ТекСтр = НайденныеСтроки[0];
				ТекСтр.ЗПУ = ТекСтр.ЗПУ + ";" + ТекЗПУ.Знаки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	СуммаНаВагон.Очистить();
	СуммаНаКонтейнер.Очистить();
	
	СуммаКРаспределению = 0;
	СуммаКРаспределениюПрибытие = 0;
	
	// платежи по отправлению
	Для Каждого Стр Из ПровозныеПлатежиИСборыПоОтправлению Цикл
		Если ЗначениеЗаполнено(Стр.НомерВагона) Тогда
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("НомерВагона",Стр.НомерВагона);
			НайденныеСтроки = СуммаНаВагон.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() = 0 Тогда
				НовСтр = СуммаНаВагон.Добавить();
				НовСтр.НомерВагона = Стр.НомерВагона;
				НовСтр.СуммаПоОтправлению = Стр.СуммаВРублях;
			Иначе
				ТекСтр = НайденныеСтроки[0];
				ТекСтр.СуммаПоОтправлению = ТекСтр.СуммаПоОтправлению + Стр.СуммаВРублях;
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(Стр.НомерКонтейнера) Тогда
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("НомерКонтейнера",Стр.НомерКонтейнера);
			НайденныеСтроки = СуммаНаКонтейнер.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() = 0 Тогда
				НовСтр = СуммаНаКонтейнер.Добавить();
				НовСтр.НомерКонтейнера = Стр.НомерКонтейнера;
				НовСтр.СуммаПоОтправлению = Стр.СуммаВРублях;
			Иначе
				ТекСтр = НайденныеСтроки[0];
				ТекСтр.СуммаПоОтправлению = ТекСтр.СуммаПоОтправлению + Стр.СуммаВРублях;
			КонецЕсли;
		// если в строке не указан ни вагон ни КТК, то сумму разделить пропорционально по вагонам в накладной
		// (если таблица вагонов не заполнена, то разнести по КТК)
		Иначе
			// сохраняем значение в переменную
			СуммаКРаспределению = СуммаКРаспределению + Стр.СуммаВРублях;
		КонецЕсли;
		
	КонецЦикла;
	
	
	// платежи по прибытию
	Для Каждого Стр Из ПровозныеПлатежиИСборыПоПрибытию Цикл
		Если ЗначениеЗаполнено(Стр.НомерВагона) Тогда
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("НомерВагона",Стр.НомерВагона);
			НайденныеСтроки = СуммаНаВагон.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() = 0 Тогда
				НовСтр = СуммаНаВагон.Добавить();
				НовСтр.НомерВагона = Стр.НомерВагона;
				НовСтр.СуммаПоРаскредитации = Стр.СуммаВРублях;
			Иначе
				ТекСтр = НайденныеСтроки[0];
				ТекСтр.СуммаПоРаскредитации = ТекСтр.СуммаПоРаскредитации + Стр.СуммаВРублях;
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(Стр.НомерКонтейнера) Тогда
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("НомерКонтейнера",Стр.НомерКонтейнера);
			НайденныеСтроки = СуммаНаКонтейнер.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() = 0 Тогда
				НовСтр = СуммаНаКонтейнер.Добавить();
				НовСтр.НомерКонтейнера = Стр.НомерКонтейнера;
				НовСтр.СуммаПоРаскредитации = Стр.СуммаВРублях;
			Иначе
				ТекСтр = НайденныеСтроки[0];
				ТекСтр.СуммаПоРаскредитации = ТекСтр.СуммаПоРаскредитации + Стр.СуммаВРублях;
			КонецЕсли;
		// если в строке не указан ни вагон ни КТК, то сумму разделить пропорционально по вагонам в накладной
		// (если таблица вагонов не заполнена, то разнести по КТК)
		Иначе
			// сохраняем значение в переменную
			СуммаКРаспределениюПрибытие = СуммаКРаспределениюПрибытие + Стр.СуммаВРублях;
		КонецЕсли;
		
	КонецЦикла;
	
	НаВагон = 0;
	НаКонтейнер = 0;
	НаВагонПрибытие = 0;
	НаКонтейнерПрибытие = 0;
	
	Если СуммаКРаспределению >0 Тогда
		// сначала попытка распределить по вагонам
		Если Вагоны.Количество()>0 Тогда
			НаВагон = Окр(СуммаКРаспределению/Вагоны.Количество(),3);
			// если сумма не делится ровно, то на последний вагон она будет больше
			СуммаНаПоследнийВагон = НаВагон + (СуммаКРаспределению-НаВагон*Вагоны.Количество());
		Иначе
			НаКонтейнер = Окр(СуммаКРаспределению/Контейнеры.Количество(),3);
			// если сумма не делится ровно, то на последний КТК она будет больше
			СуммаНаПоследнийКонтейнер = НаКонтейнер + (СуммаКРаспределению-НаКонтейнер*Контейнеры.Количество());
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ СуммаКРаспределениюПрибытие = 0 Тогда
		// сначала попытка распределить по вагонам
		Если Вагоны.Количество()>0 Тогда
			НаВагонПрибытие = Окр(СуммаКРаспределениюПрибытие/Вагоны.Количество(),3);
			// если сумма не делится ровно, то на последний вагон она будет больше
			СуммаНаПоследнийВагонПрибытие = НаВагонПрибытие + (СуммаКРаспределениюПрибытие-НаВагонПрибытие*Вагоны.Количество());
		Иначе
			НаКонтейнерПрибытие = Окр(СуммаКРаспределениюПрибытие/Контейнеры.Количество(),3);
			// если сумма не делится ровно, то на последний КТК она будет больше
			СуммаНаПоследнийКонтейнерПрибытие = НаКонтейнерПрибытие + (СуммаКРаспределениюПрибытие-НаКонтейнерПрибытие*Контейнеры.Количество());
		КонецЕсли;
	КонецЕсли;
	
	// сумма по отправлению
	Если НаВагон>0 Тогда
		Для ШагЦикла = 0 По Вагоны.Количество()-1 Цикл
			Стр = Вагоны[ШагЦикла];
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("НомерВагона",Стр.НомерВагона);
			НайденныеСтроки = СуммаНаВагон.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() = 0 Тогда
				НовСтр = СуммаНаВагон.Добавить();
				НовСтр.НомерВагона = Стр.НомерВагона;
				НовСтр.СуммаПоОтправлению = ?(ШагЦикла = Вагоны.Количество()-1,СуммаНаПоследнийВагон,НаВагон);
			Иначе
				ТекСтр = НайденныеСтроки[0];
				ТекСтр.СуммаПоОтправлению = ТекСтр.СуммаПоОтправлению + ?(ШагЦикла = Вагоны.Количество()-1,СуммаНаПоследнийВагон,НаВагон);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если НаКонтейнер>0 Тогда
		Для ШагЦикла = 0 По Контейнеры.Количество()-1 Цикл
			Стр = Контейнеры[ШагЦикла];
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("НомерКонтейнера",Стр.НомерКонтейнера);
			НайденныеСтроки = СуммаНаКонтейнер.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() = 0 Тогда
				НовСтр = СуммаНаКонтейнер.Добавить();
				НовСтр.НомерКонтейнера = Стр.НомерКонтейнера;
				НовСтр.СуммаПоОтправлению = ?(ШагЦикла = Контейнеры.Количество()-1,СуммаНаПоследнийКонтейнер,НаКонтейнер);
			Иначе
				ТекСтр = НайденныеСтроки[0];
				ТекСтр.СуммаПоОтправлению = ТекСтр.СуммаПоОтправлению + ?(ШагЦикла = Контейнеры.Количество()-1,СуммаНаПоследнийКонтейнер,НаКонтейнер);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// сумма по прибытию
	Если НаВагонПрибытие>0 Тогда
		Для ШагЦикла = 0 По Вагоны.Количество()-1 Цикл
			Стр = Вагоны[ШагЦикла];
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("НомерВагона",Стр.НомерВагона);
			НайденныеСтроки = СуммаНаВагон.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() = 0 Тогда
				НовСтр = СуммаНаВагон.Добавить();
				НовСтр.НомерВагона = Стр.НомерВагона;
				НовСтр.СуммаПоРаскредитации = ?(ШагЦикла = Вагоны.Количество()-1,СуммаНаПоследнийВагонПрибытие,НаВагонПрибытие);
			Иначе
				ТекСтр = НайденныеСтроки[0];
				ТекСтр.СуммаПоРаскредитации = ТекСтр.СуммаПоРаскредитации + ?(ШагЦикла = Вагоны.Количество()-1,СуммаНаПоследнийВагонПрибытие,НаВагонПрибытие);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если НаКонтейнерПрибытие>0 Тогда
		Для ШагЦикла = 0 По Контейнеры.Количество()-1 Цикл
			Стр = Контейнеры[ШагЦикла];
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("НомерКонтейнера",Стр.НомерКонтейнера);
			НайденныеСтроки = СуммаНаКонтейнер.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() = 0 Тогда
				НовСтр = СуммаНаКонтейнер.Добавить();
				НовСтр.НомерКонтейнера = Стр.НомерКонтейнера;
				НовСтр.СуммаПоРаскредитации = ?(ШагЦикла = Контейнеры.Количество()-1,СуммаНаПоследнийКонтейнерПрибытие,НаКонтейнерПрибытие);
			Иначе
				ТекСтр = НайденныеСтроки[0];
				ТекСтр.СуммаПоРаскредитации = ТекСтр.СуммаПоРаскредитации + ?(ШагЦикла = Контейнеры.Количество()-1,СуммаНаПоследнийКонтейнерПрибытие,НаКонтейнерПрибытие);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ГруженаяНакладная = ГрузыЖД.Итог("МассаГруза") > 0;
	
	Если Вагоны.Количество() = 0 Тогда
		НакладнаяБезВагонов = Истина;
//Евросиб Гудкова( 30.03.2022 Ticket№ 48859
	Иначе
		НакладнаяБезВагонов = Ложь;
// Евросиб Гудкова)
	КонецЕсли;
	
	ТекущееСостояниеНакладнойДействующийСтатус = ТекущееСостояниеНакладной.ДействующийСтатус;
	
	//ДИТ, Беляев СЮ, TA51481, 18-05-2022, начало
	//УнифицированныйНомерНакладной = ПолучитьУнифицированныйНомерНакладной(НакладнаяНомер);
	УнифицированныйНомерНакладной = э_ОбщиеСервер.ПолучитьУнифицированныйНомерНакладной(НакладнаяНомер);
	//ДИТ, Беляев СЮ, TA51481, 18-05-2022, конец
	
	// ДИТ BUG 67118 TA 68321 Евсенкин М.А. Начало: 10.04.2023
	ЗаполнитьРазмерКТК();	
	// ДИТ BUG 67118 TA 68321 Евсенкин М.А. Конец: 10.04.2023
КонецПроцедуры        

////ДИТ, Беляев СЮ, TA51481, 03-06-2022 перенесена в общий модуль "э_ОбщиеСервер"
////ДИТ, Беляев СЮ, TA51481, 18-05-2022, начало
//Функция ПолучитьУнифицированныйНомерНакладной(Знач вхНакладнаяНомер)
//	ЦифрыБез0 = "123456789";
//	ДлинаНомера = СтрДлина(вхНакладнаяНомер);
//	Для НомерСимвола = 1 По ДлинаНомера Цикл
//		Символ = Сред(вхНакладнаяНомер, НомерСимвола, 1);
//		Если СтрНайти(ЦифрыБез0, Символ) <> 0 Тогда
//			Прервать;
//		КонецЕсли;
//	КонецЦикла;
//	ЦифроваяЧастьНомера = Сред(вхНакладнаяНомер, НомерСимвола, ДлинаНомера); //получен номер без лидирующих нулей и символов не являющихся цифрами
//    Возврат Прав("00000000" + ЦифроваяЧастьНомера, 8); //добавлены лидирующие нули слева с обрезкой до 8 символов
//КонецФункции
////ДИТ, Беляев СЮ, TA51481, 18-05-2022, конец

Процедура СоздатьТранспортныйДокумент()
	СуществующаяЖДН = ТранспортныеДокументы_сервер.НайтиЖДНПоНомеру(Ссылка, Истина);
	Если СуществующаяЖДН = неопределено Тогда
		НовыйТД = Документы.ТранспортныйДокумент.СоздатьДокумент();
	Иначе
		НовыйТД = СуществующаяЖДН.ПолучитьОбъект();
	КонецЕсли;
	//ДИТ Давудов М.А. US 64009 12.01.2024 Начало
	Если ДополнительныеСвойства.Свойство("СтанцияНазначения") Тогда
		НовыйТД.ДополнительныеСвойства.Вставить("СтанцияНазначения", ДополнительныеСвойства.СтанцияНазначения);
	КонецЕсли;
	Если ДополнительныеСвойства.Свойство("СтанцияОтправления") Тогда
		НовыйТД.ДополнительныеСвойства.Вставить("СтанцияОтправления", ДополнительныеСвойства.СтанцияОтправления);
	КонецЕсли;
	//ДИТ Давудов М.А. US 64009 12.01.2024 Конец
	//Евросиб Гудкова( 03.01.2020  		
	НовыйТД.Заполнить(Ссылка);  	
//Евросиб - АСуслов 13.10.2022 15:28:14 #58943
//(
	//Если Проведен Тогда 
	Если Проведен И ТекущееСостояниеНакладнойДействующийСтатус Тогда
//)
//Евросиб - АСуслов 13.10.2022 15:28:15 #
		//ДИТ, Беляев СЮ, Ticket#0269962, 22-04-2022, начало
		Если НовыйТД.ПометкаУдаления Тогда        
			НовыйТД.Записать(РежимЗаписиДокумента.Запись); //т.к. документ модифицирован, надо записать перед измененим пометки удаления
			НовыйТД.УстановитьПометкуУдаления(Ложь);
		КонецЕсли; 
		//ДИТ, Беляев СЮ, Ticket#0269962, 22-04-2022, конец
		НовыйТД.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		Если НовыйТД.Проведен Тогда
			НовыйТД.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Иначе
			НовыйТД.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;                                           
		//Если ПометкаУдаления <> НовыйТД.ПометкаУдаления Тогда
			НовыйТД.УстановитьПометкуУдаления(Истина);
		//КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// ДИТ BUG 67118 TA 68321 Евсенкин М.А. Начало: 10.04.2023
Процедура ЗаполнитьРазмерКТК()
	
	//Тип20 = Справочники.ТипоразмерыТЕ.ПолучитьСсылку(Новый УникальныйИдентификатор("7a4ef4c2-cee1-11e9-b810-00155d152369")); //000000004 20DC
	//Тип40 = Справочники.ТипоразмерыТЕ.ПолучитьСсылку(Новый УникальныйИдентификатор("3f4c229e-cee1-11e9-b810-00155d152369")); //000000001 40HC
	//ДИТ, Беляев СЮ, BUG 67118 / TASK 69529, 02-05-2023, начало
	СтруктураРазмера20 = РаботаСКонтейнерамиСервер.НайтиТипПоРазмеру("20");
	Тип20 = СтруктураРазмера20.Тип;
	СтруктураРазмера40 = РаботаСКонтейнерамиСервер.НайтиТипПоРазмеру("40");
	Тип40 = СтруктураРазмера40.Тип;
	//ДИТ, Беляев СЮ, BUG 67118 / TASK 69529, 02-05-2023, конец
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("НомерКонтейнера", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(11, ДопустимаяДлина.Переменная))); 
	ТЗ.Колонки.Добавить("Футовость", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(11, 0, ДопустимыйЗнак.Любой)));
	
	Для Каждого Стр Из Контейнеры Цикл 
		Если ЗначениеЗаполнено(Стр.НомерКонтейнера) И ЗначениеЗаполнено(Стр.ФутовостьКрупнотоннажногоКонтейнера) Тогда 
			НоваяСтрока = ТЗ.Добавить();
			НоваяСтрока.НомерКонтейнера = Стр.НомерКонтейнера;
			НоваяСтрока.Футовость = Стр.ФутовостьКрупнотоннажногоКонтейнера;
		КонецЕсли;	
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.НомерКонтейнера КАК НомерКонтейнера,
		|	ТЗ.Футовость КАК Футовость
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЕ.Ссылка КАК КТК,
		|	ВЫБОР
		|		КОГДА ВТ.Футовость = 40
		|			ТОГДА &Тип40
		|		КОГДА ВТ.Футовость = 20
		|			ТОГДА &Тип20
		|	КОНЕЦ КАК ТипТЕ
		|ИЗ
		|	ВТ КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
		|		ПО ВТ.НомерКонтейнера = ТЕ.Наименование
		|			И (ТЕ.ТипТЕ = ЗНАЧЕНИЕ(Справочник.ТипоразмерыТЕ.ПустаяСсылка))
		|ГДЕ
		|	ВТ.Футовость В (20, 40)
		//ДИТ, Беляев СЮ, BUG 67118 / TASK 69529, 02-05-2023, начало (типоразмеры Тип20, Тип40 определяеюся по настройкам в справочнике, исключаем случай установки пустого значения в КТК)
		|	И ВЫБОР
		|			КОГДА ВТ.Футовость = 40
		|				ТОГДА &Тип40
		|			КОГДА ВТ.Футовость = 20
		|				ТОГДА &Тип20
		|		КОНЕЦ <> НЕОПРЕДЕЛЕНО";
		//ДИТ, Беляев СЮ, BUG 67118 / TASK 69529, 02-05-2023, конец
	
	Запрос.УстановитьПараметр("ТЗ",ТЗ);
	Запрос.УстановитьПараметр("Тип20", Тип20);
	Запрос.УстановитьПараметр("Тип40", Тип40);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КТКОбъект = ВыборкаДетальныеЗаписи.КТК.ПолучитьОбъект();                                     
		КТКОбъект.ТипТЕ = ВыборкаДетальныеЗаписи.ТипТЕ;
		КТКОбъект.УстановитьКомментарийВерсииИсторииДанных("Заполнение ""Тип ТЕ"" на основании ЖДН");
		КТКОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры	
// ДИТ BUG 67118 TA 68321 Евсенкин М.А. Конец: 10.04.2023