&НаКлиенте
Процедура ЗагрузитьИзЭТРАН(Команда)
	МассивВагонов = Новый Массив;
	Для Каждого Строка из Элементы.Список.ВыделенныеСтроки Цикл
		МассивВагонов.Добавить(Строка.Код);
	КонецЦикла;
	Если НетЗапущеныхРанееЗаданий("ЗагрузитьИзЭТРАННаСервере") Тогда
		Сообщить("Начало загрузки данных по выделенным вагонам");
		ЗагрузитьИзЭТРАННаСервере(МассивВагонов);
		Подключаемый_ПроверитьВыполнениеЗадания();
	Иначе
		Сообщить("Дождитесь завершения предыдущего вызова");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзЭТРАННаСервере(МассивВагонов)
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполненияВФоне.ЗапуститьВФоне = Истина;
	ПараметрыВыполненияВФоне.КлючФоновогоЗадания = "ЗагрузитьДанныеПоВагонамИзЭтран";
	ПараметрыВыполненияВФоне.НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузить данные по вагонам из этран.'");
	
	ПараметрыПроцедуры = Новый Структура("НомераВагонов, СписокРеквизитовОбъекта", МассивВагонов, Неопределено);
	
	РезультатДлительнойОперации = ДлительныеОперации.ВыполнитьВФоне("э_ОбщиеСервер.ЗагрузитьДанныеПоВагонуИзЭтран", ПараметрыПроцедуры, ПараметрыВыполненияВФоне);
	//РезультатДлительнойОперации = ДлительныеОперации.ВыполнитьВФоне("э_ОбщиеСервер.ОтладкаФормыФоновогоЗадания", ПараметрыПроцедуры, ПараметрыВыполненияВФоне);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания(Результат = "", ДополнительныеПараметры = "") Экспорт
	Попытка
		Если РезультатДлительнойОперации.Статус = "Выполнено" Или ЗаданиеВыполнено(РезультатДлительнойОперации.ИдентификаторЗадания) Тогда
			//РезультатВыполнения = ПолучитьИзВременногоХранилища(РезультатДлительнойОперации.АдресРезультата);
			Элементы.Список.Обновить();
			Сообщить("Загрузка данных по выделенным вагонам завершена");
		Иначе
			ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
			ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
			ПараметрыОжидания.Интервал = 3;
			ДлительныеОперацииКлиент.э_ОжидатьЗавершение(РезультатДлительнойОперации, Новый ОписаниеОповещения("Подключаемый_ПроверитьВыполнениеЗадания", ЭтотОбъект),ПараметрыОжидания);
		КонецЕсли;
	Исключение        
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)    
     Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);    
КонецФункции
 
 &НаСервере
Функция НетЗапущеныхРанееЗаданий(КлючПоискаФоновогоЗадания)
	
	Если КлючПоискаФоновогоЗадания = "ЗагрузитьИзЭТРАННаСервере" Тогда 
		КлючФоновогоЗадания = "ЗагрузитьДанныеПоВагонамИзЭтран";
		Если ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("Ключ,Состояние", КлючФоновогоЗадания, СостояниеФоновогоЗадания.Активно)).Количество() > 0 Тогда 
			Возврат Ложь;
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

