Функция ПолучитьСписокКлючевыхПолей(ИсточникПоявленияСтрокиЭкономики) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КлючиАналитикиСтрокКалькуляцииКлючевыеПоля.ИмяПоляСделка = """"
	|			ТОГДА КлючиАналитикиСтрокКалькуляцииКлючевыеПоля.ИмяПоля
	|		ИНАЧЕ КлючиАналитикиСтрокКалькуляцииКлючевыеПоля.ИмяПоляСделка
	|	КОНЕЦ КАК ИмяПоля
	|ИЗ
	|	Справочник.КлючиАналитикиСтрокКалькуляции.КлючевыеПоля КАК КлючиАналитикиСтрокКалькуляцииКлючевыеПоля
	|ГДЕ
	|	КлючиАналитикиСтрокКалькуляцииКлючевыеПоля.Ссылка.ИспользуетсяКакШаблон
	|	И КлючиАналитикиСтрокКалькуляцииКлючевыеПоля.Ссылка.РазделКалькуляции = &РазделКалькуляции
	|	И НЕ КлючиАналитикиСтрокКалькуляцииКлючевыеПоля.Ссылка.ПометкаУдаления";
	
	
	Если ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ОсновнаяУслугаАвтоматически Тогда
		РазделКалькуляции = Перечисления.РазделыКалькуляции.КалькуляцияМультимодальнойЦепочки;
	ИначеЕсли ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ФрахтИзКалькуляции Тогда
		РазделКалькуляции = Перечисления.РазделыКалькуляции.КалькуляцияСтавокПоФрахту;
	ИначеЕсли ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ДопУслугаАвтоматически Тогда
		РазделКалькуляции = Перечисления.РазделыКалькуляции.КалькуляцияУслугВнеСтавки;
	КонецЕсли;
	Запрос.УстановитьПараметр("РазделКалькуляции", РазделКалькуляции);
	РезультатЗапроса = Запрос.Выполнить();
	КлючевыеПоля = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ИмяПоля");
	Для к = 0 По КлючевыеПоля.Количество() - 1 Цикл
		КлючевыеПоля[к] = СтрЗаменить(КлючевыеПоля[к], ".", "");
	КонецЦикла;
	Возврат КлючевыеПоля;
	
КонецФункции
