

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АдрезХранилищаТЧ") Тогда
		Тч = ПолучитьИзВременногоХранилища(Параметры.АдрезХранилищаТЧ);
		Для Каждого СтрокаТч Из ТЧ Цикл
			//Евросиб Коханенко Н.А. 15.05.2024 (( #83866
			Если Параметры.Свойство("МассивГУИДыПеренесенныхКТК")
					И Параметры.МассивГУИДыПеренесенныхКТК.Найти(СтрокаТч.ИдентификаторСтрокиУслуги) <> Неопределено Тогда 
				Продолжить;
			КонецЕсли;
			//Евросиб Коханенко Н.А. 15.05.2024 )) #83866 
			НовСтрока = Контейнеры.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока,СтрокаТч);
		КонецЦикла;	
	КонецЕсли;	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )
 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКонтейнеры
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	СтруктураОтбора = Новый Структура("Отметка",Истина);
	НайденныеСтроки = Контейнеры.НайтиСтроки(СтруктураОтбора);
	МассивГуидовСтрокВосстановления = Новый Массив;
	Для Каждого СтрокаВосст Из НайденныеСтроки Цикл
		МассивГуидовСтрокВосстановления.Добавить(СтрокаВосст.ИдентификаторСтрокиТЧ);
	КонецЦикла;	
	ОповеститьОВыборе(МассивГуидовСтрокВосстановления);
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	Для Каждого СтрокаТЧ из Контейнеры Цикл 
		СтрокаТЧ.Отметка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	Для Каждого СтрокаТЧ из Контейнеры Цикл 
		СтрокаТЧ.Отметка = Ложь;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти






