
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Контрагент = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Контрагент");
	ДоговорКонтрагента = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ДоговорКонтрагента");
	Реализация = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Реализация");
	
	Если ТипЗнч(Реализация) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		Элементы.СписокДобавитьВыбранныеСчетаВРеализацию.Заголовок = "Добавить выбранные счета в корректировку реализации";	
	ИначеЕсли ТипЗнч(Реализация) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		Элементы.СписокДобавитьВыбранныеСчетаВРеализацию.Заголовок = "Добавить выбранные счета в отчет коммитенту";
	КонецЕсли;
	
	АдресХранилищаДанных = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "АдресХранилищаДанных");
	СтруктураДанных = ПолучитьИзВременногоХранилища(АдресХранилищаДанных);
	УслугиРеализации.Загрузить(СтруктураДанных.ТаблицаУслуг);
	ПодобранныеСчетаПокупателям = СтруктураДанных.ПодобранныеСчетаПокупателям;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодобранныеСчетаПокупателям.СчетПокупателю КАК СчетПокупателю,
		|	ПодобранныеСчетаПокупателям.Номенклатура КАК Номенклатура,
		|	ПодобранныеСчетаПокупателям.Сумма КАК Сумма
		|ПОМЕСТИТЬ ПодобранныеСчетаПокупателям
		|ИЗ
		|	&ПодобранныеСчетаПокупателям КАК ПодобранныеСчетаПокупателям
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СчетаПокупателейОстатки.СчетПокупателю КАК СчетПокупателю,
		|	СчетаПокупателейОстатки.Номенклатура КАК Номенклатура,
		|	СчетаПокупателейОстатки.СуммаОстаток КАК СуммаОстаток,
		|	СчетаПокупателейОстатки.СчетПокупателю.МоментВремени КАК СчетПокупателюМоментВремени,
		|	0 КАК РазнесеннаяСумма
		|ПОМЕСТИТЬ ОстаткиПоСчетам
		|ИЗ
		|	РегистрНакопления.СчетаПокупателей.Остатки КАК СчетаПокупателейОстатки
		|ГДЕ
		|	СчетаПокупателейОстатки.Контрагент = &Контрагент
		|	И СчетаПокупателейОстатки.ДоговорКонтрагента = &ДоговорКонтрагента
		|	И СчетаПокупателейОстатки.СуммаОстаток >= 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетаПокупателей.СчетПокупателю,
		|	СчетаПокупателей.Номенклатура,
		|	СчетаПокупателей.Сумма,
		|	СчетаПокупателей.СчетПокупателю.МоментВремени,
		|	0
		|ИЗ
		|	РегистрНакопления.СчетаПокупателей КАК СчетаПокупателей
		|ГДЕ
		|	СчетаПокупателей.Контрагент = &Контрагент
		|	И СчетаПокупателей.ДоговорКонтрагента = &ДоговорКонтрагента
		|	И СчетаПокупателей.Регистратор = &Реализация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПодобранныеСчетаПокупателям.СчетПокупателю,
		|	ПодобранныеСчетаПокупателям.Номенклатура,
		|	-ПодобранныеСчетаПокупателям.Сумма,
		|	СчетНаОплатуПокупателю.МоментВремени,
		|	ПодобранныеСчетаПокупателям.Сумма
		|ИЗ
		|	ПодобранныеСчетаПокупателям КАК ПодобранныеСчетаПокупателям
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
		|		ПО ПодобранныеСчетаПокупателям.СчетПокупателю = СчетНаОплатуПокупателю.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиПоСчетам.СчетПокупателю КАК СчетПокупателю,
		|	ОстаткиПоСчетам.Номенклатура КАК Номенклатура,
		|	СУММА(ОстаткиПоСчетам.СуммаОстаток) КАК НепривязаннаяСумма,
		|	ОстаткиПоСчетам.СчетПокупателю.Номер КАК СчетНомер,
		|	ОстаткиПоСчетам.СчетПокупателю.Дата КАК СчетДата,
		|	ОстаткиПоСчетам.СчетПокупателюМоментВремени КАК СчетПокупателюМоментВремени,
		|	СУММА(ОстаткиПоСчетам.РазнесеннаяСумма) КАК РазнесеннаяСумма
		|ИЗ
		|	ОстаткиПоСчетам КАК ОстаткиПоСчетам
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиПоСчетам.СчетПокупателюМоментВремени,
		|	ОстаткиПоСчетам.СчетПокупателю,
		|	ОстаткиПоСчетам.Номенклатура,
		|	ОстаткиПоСчетам.СчетПокупателю.Номер,
		|	ОстаткиПоСчетам.СчетПокупателю.Дата
		|
		|ИМЕЮЩИЕ
		|	СУММА(ОстаткиПоСчетам.СуммаОстаток) > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	СчетПокупателюМоментВремени,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиПоСчетам.СчетПокупателю КАК СчетПокупателю,
		|	ОстаткиПоСчетам.Номенклатура КАК Номенклатура,
		|	СчетаПокупателей.Регистратор КАК Регистратор,
		|	СчетаПокупателей.Регистратор.Номер КАК РегистраторНомер,
		|	СчетаПокупателей.Регистратор.Дата КАК РегистраторДата,
		|	СУММА(СчетаПокупателей.Сумма) КАК Сумма,
		|	СчетаПокупателей.Регистратор.НомерДляПечати КАК РегистраторНомерДляПечати,
		|	СчетаПокупателей.Контрагент.Наименование КАК КонтрагентНаименование
		|ИЗ
		|	ОстаткиПоСчетам КАК ОстаткиПоСчетам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СчетаПокупателей КАК СчетаПокупателей
		|		ПО ОстаткиПоСчетам.СчетПокупателю = СчетаПокупателей.СчетПокупателю
		|			И ОстаткиПоСчетам.Номенклатура = СчетаПокупателей.Номенклатура
		|ГДЕ
		|	НЕ СчетаПокупателей.Регистратор ССЫЛКА Документ.СчетНаОплатуПокупателю
		|	И СчетаПокупателей.Регистратор <> &Реализация
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиПоСчетам.Номенклатура,
		|	ОстаткиПоСчетам.СчетПокупателю,
		|	СчетаПокупателей.Регистратор,
		|	СчетаПокупателей.Регистратор.Номер,
		|	СчетаПокупателей.Регистратор.Дата,
		|	СчетаПокупателей.Регистратор.НомерДляПечати,
		|	СчетаПокупателей.Контрагент.Наименование";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Реализация", Реализация);
	Запрос.УстановитьПараметр("ПодобранныеСчетаПокупателям", ПодобранныеСчетаПокупателям);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();	
	ОстаткиПоСчетам = РезультатыЗапроса[2].Выбрать();
	РазнесенныеСуммыНаДругиеРТУ = РезультатыЗапроса[3].Выгрузить();
	
	НомерСтроки = 0;
	Пока ОстаткиПоСчетам.Следующий() Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		НоваяСтрока = Список.Добавить();		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОстаткиПоСчетам);
		НоваяСтрока.НомерСтроки = НомерСтроки;
		НоваяСтрока.СчетПредставление = СтрШаблон("Счет на оплату покупателю %1 от %2", ОстаткиПоСчетам.СчетНомер, Формат(ОстаткиПоСчетам.СчетДата, "ДФ=dd.MM.yyyy"));
		
		НайденныеРТУ = РазнесенныеСуммыНаДругиеРТУ.НайтиСтроки(Новый Структура("СчетПокупателю, Номенклатура", ОстаткиПоСчетам.СчетПокупателю, ОстаткиПоСчетам.Номенклатура));
		ПредставленияРТУ = Новый Массив;
		Для Каждого СтрокаРТУ Из НайденныеРТУ Цикл
			
			Если ТипЗнч(СтрокаРТУ.Регистратор) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				Док = "РТУ";
			ИначеЕсли ТипЗнч(СтрокаРТУ.Регистратор) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
				Док = "Корр РТУ";
			ИначеЕсли ТипЗнч(СтрокаРТУ.Регистратор) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
				Док = "Отчет комитенту";
			Иначе
				Продолжить;
			КонецЕсли;
			
			ПредставленияРТУ.Добавить(СтрШаблон("%1 %2 от %3 %4 %5", Док, СтрокаРТУ.РегистраторНомер, Формат(СтрокаРТУ.РегистраторДата, "ДФ=dd.MM.yyyy"), СтрокаРТУ.КонтрагентНаименование, СтрокаРТУ.РегистраторНомерДляПечати));
			
		КонецЦикла;
		
		НоваяСтрока.РазнесенныеСуммыНаДругиеРТУ = СтрСоединить(ПредставленияРТУ, "; ");
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПредставлениеСчетаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	ПоказатьЗначение(, ТекДанные.СчетПокупателю);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВыбранныеСчетаВРеализацию(Команда)
	
	ВыбранныеСтроки = Список.НайтиСтроки(Новый Структура("Выбрать", Истина));
	Если ЗначениеЗаполнено(ВыбранныеСтроки) Тогда
		ВыбранныеСчета = ПроверитьИПоместитьВоВременноеХранилищеВыбранныеСтроки();
		Закрыть(ВыбранныеСчета);
	Иначе
		ПоказатьПредупреждение(, "Не выбраны счета для добавления в реализацию!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьИПоместитьВоВременноеХранилищеВыбранныеСтроки()
	
	Если ЗначениеЗаполнено(АдресТаблицыУслуг) Тогда
		ТаблицаУслуг = ПолучитьИзВременногоХранилища(АдресТаблицыУслуг);
	КонецЕсли;
	//Евросиб Шевченко А.В. US 112687 TA 126873 26.12.2025
	ТаблицаСчетов = Список.Выгрузить(Новый Структура("Выбрать", Истина), "СчетПокупателю, Номенклатура, Сумма, ОшибкаНоменклатуры");
	//Евросиб Шевченко А.В. US 112687 TA 126873 26.12.2025
	Возврат ПоместитьВоВременноеХранилище(ТаблицаСчетов);
	
КонецФункции

&НаКлиенте
Процедура СписокВыбратьПриИзменении(Элемент)
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекДанные.Выбрать Тогда
		
			ТекДанные.ОшибкаНоменклатуры = Ложь;
		
		ДокИмя = "";
		Если ТипЗнч(Реализация) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			ДокИмя = "РТУ";
		ИначеЕсли ТипЗнч(Реализация) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			ДокИмя = "Корр РТУ";
		ИначеЕсли ТипЗнч(Реализация) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
			ДокИмя = "Отчета комитенту";
		КонецЕсли;
		
		СтрокиТаблицыУслуг = УслугиРеализации.НайтиСтроки(Новый Структура("Номенклатура", ТекДанные.Номенклатура));
		
		Сумма = ТекДанные.НепривязаннаяСумма + ТекДанные.РазнесеннаяСумма;
				
		Если Не ЗначениеЗаполнено(СтрокиТаблицыУслуг) Тогда			
			ТекДанные.Сумма = ТекДанные.НепривязаннаяСумма;
			ДопПараметры = Новый Структура("ИдентификаторСтроки", ТекСтрока);
			ОповещениеОВыборе = Новый ОписаниеОповещения("СписокВыбратьПродолжение", ЭтаФорма, ДопПараметры);
			ОповещениеОВыбореПредупреждение = Новый ОписаниеОповещения("СписокВыбратьПредупреждениеПродолжение", ЭтаФорма, ДопПараметры);
			ТекстСообщения = СтрШаблон("Номенклатура %1 счета не совпадает с номенклатурой РТУ. Продолжить?", ТекДанные.Номенклатура);
			//Евросиб Шевченко А.В. US 112687 TA 126873 26.12.2025
			Если ТипЗнч(Реализация) = Тип("ДокументСсылка.КорректировкаРеализации") ИЛИ ТипЗнч(Реализация) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
				ТекДанные.ОшибкаНоменклатуры = Истина;
				НоменклатураРеализации = Новый Массив;
				Для Каждого Стр Из УслугиРеализации Цикл
					Если НоменклатураРеализации.Найти(Стр.Номенклатура) = Неопределено Тогда
						НоменклатураРеализации.Добавить(Стр.Номенклатура);
					КонецЕсли;	
				КонецЦикла;	
				ТекстСообщения = СтрШаблон("Номенклатура %1 счета не совпадает с %2 %3. Продолжить?", ТекДанные.Номенклатура, СтрСоединить(НоменклатураРеализации,","), ДокИмя);
				Если ТипЗнч(Реализация) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
					ТекстСообщения = СтрШаблон("Номенклатура %1 счета не совпадает с %2 %3. Добавление отменено. Проверьте данные и повторите действие.", ТекДанные.Номенклатура, СтрСоединить(НоменклатураРеализации,","), ДокИмя);
				КонецЕсли;			
			КонецЕсли;
			//Евросиб Шевченко А.В. US 112687 TA 126873 26.12.2025
			
			Если ТипЗнч(Реализация) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
				ПоказатьПредупреждение(ОповещениеОВыбореПредупреждение,ТекстСообщения);
			Иначе
				ПоказатьВопрос(ОповещениеОВыборе, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
			КонецЕсли;
		ИначеЕсли СтрокиТаблицыУслуг[0].Сумма <> Сумма Тогда
			Если ЗначениеЗаполнено(ТекДанные.РазнесенныеСуммыНаДругиеРТУ) Тогда				
				ТекДанные.Сумма = Сумма;				
				ТекстСообщения = СтрШаблон("Счет уже привязан к %1. %2Будет добавлен непривязанный остаток. Продолжить?", ТекДанные.РазнесенныеСуммыНаДругиеРТУ, Символы.ПС);
				Если ТипЗнч(Реализация) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
					ТекстСообщения = СтрШаблон("Сумма по услуге %1 добавленного счета не совпадает с суммой по услуге %1 %2. Добавление отменено. Проверьте данные и повторите действие.", ТекДанные.Номенклатура, ДокИмя);
				КонецЕсли;
				ДопПараметры = Новый Структура("ИдентификаторСтроки", ТекСтрока);
				ОповещениеОВыборе = Новый ОписаниеОповещения("СписокВыбратьПродолжение", ЭтаФорма, ДопПараметры);
				Если ТипЗнч(Реализация) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
					ПоказатьПредупреждение(ОповещениеОВыбореПредупреждение,ТекстСообщения);
				Иначе
					ПоказатьВопрос(ОповещениеОВыборе, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
				КонецЕсли;
			Иначе
				//Евросиб Шевченко А.В. US 112687 TA 126873 26.12.2025
				ТекстСообщения = СтрШаблон("Сумма по услуге %1 добавленного счета не совпадает с суммой по услуге %1 %2. Введите данные вручную. Продолжить?", ТекДанные.Номенклатура, ДокИмя);
				Если ТипЗнч(Реализация) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
					ТекстСообщения = СтрШаблон("Сумма по услуге %1 добавленного счета не совпадает с суммой по услуге %1 %2. Добавление отменено. Проверьте данные и повторите действие.", ТекДанные.Номенклатура, ДокИмя);
				КонецЕсли;
	            //Евросиб Шевченко А.В. US 112687 TA 126873 26.12.2025
				ДопПараметры = Новый Структура("ИдентификаторСтроки", ТекСтрока);
				ОповещениеОВыборе = Новый ОписаниеОповещения("СписокВыбратьПродолжение", ЭтаФорма, ДопПараметры);
				//Евросиб Шевченко А.В. US 112687 TA 126873 26.12.2025
				Если ТипЗнч(Реализация) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
					ПоказатьПредупреждение(ОповещениеОВыбореПредупреждение,ТекстСообщения);
				Иначе
					ПоказатьВопрос(ОповещениеОВыборе, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
				КонецЕсли;
				//Евросиб Шевченко А.В. US 112687 TA 126873 26.12.2025
			КонецЕсли;
		Иначе
			ТекДанные.Сумма = Сумма;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбратьПродолжение(ОтветПользователя, ДопПараметры) Экспорт
	
	СтрокаСписка = Список.НайтиПоИдентификатору(ДопПараметры.ИдентификаторСтроки);
	
	Если ОтветПользователя <> КодВозвратаДиалога.Да Тогда
		СтрокаСписка.Выбрать = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбратьПредупреждениеПродолжение(ДопПараметры) Экспорт
	
	СтрокаСписка = Список.НайтиПоИдентификатору(ДопПараметры.ИдентификаторСтроки);
	СтрокаСписка.Выбрать = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсе(Команда)
	
	Для Каждого Стр Из Список Цикл
		Стр.Выбрать = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для Каждого Стр Из Список Цикл
		Стр.Выбрать = Ложь;
	КонецЦикла;
	
КонецПроцедуры

