Процедура УстановитьРазрешениеВводаКорректировок(ДокументЪ, Корректировка, Исправление, Аннулирование, Знач ПериодЪ = неопределено) Экспорт
	
	Если ПериодЪ = неопределено Тогда
		ПериодЪ = ТекущаяДата();
	КонецЕсли;
	
	 //ДИТ, Беляев СЮ, Ticket#0258445, 14-03-2022, начало
	ТекущееСостояниеСреза = КорректировкиРТУСервер.ПолучитьСтатусРазрешенияКорректировки(ДокументЪ);   
	Если ТекущееСостояниеСреза.Корректировка = Корректировка И
			ТекущееСостояниеСреза.Исправление = Исправление И
			ТекущееСостояниеСреза.Аннулирование = Аннулирование Тогда
		Возврат;
	КонецЕсли;
	//ДИТ, Беляев СЮ, Ticket#0258445, 14-03-2022, конец

	МЗ = РегистрыСведений.РазрешениеВводаКорректировок.СоздатьМенеджерЗаписи();
	МЗ.Период = ПериодЪ;
	МЗ.ОбъектКорректировки = ДокументЪ;
	МЗ.РазрешенаКорректировка = Корректировка;
	МЗ.РазрешеноИсправление = Исправление;
	МЗ.РазрешеноАннулирование = Аннулирование;
	МЗ.КтоРазрешил = Пользователи.ТекущийПользователь();
	МЗ.Записать(Истина);
	
	// Евросиб Фролов (24.03.2022 US №40767, Task №40768
	// При открытии РТУ на корректировку необходимо отправлять письмо ответственному за сделку сотрудника ОРК.
	Если Корректировка
		И ТипЗнч(ДокументЪ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		//И Не БлокировкаРаботыСВнешнимиРесурсами.РаботаСВнешнимиРесурсамиЗаблокирована() Тогда
		
		УчетнаяЗаписьДоступна = РаботаСПочтовымиСообщениями.ПроверитьСистемнаяУчетнаяЗаписьДоступна();
		Если УчетнаяЗаписьДоступна = Ложь Тогда
			Возврат;
		КонецЕсли;	
		//Евросиб СубботинВ #84453 16.06.2025 Начало 
		//РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументЪ, "Сделка, Контрагент, НомерДляПечати, Сделка.ЕдиныйОтветственныйОтОРК, Сделка.Номер");
		
		//Евросиб Каблов 28.11.2025 ( #111016
		//РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументЪ, "Контрагент, НомерДляПечати");
		//Сделка = ДокументЪ.СчетаНаОплатуПокупателям[0].Сделка;
		//РеквизитыСделки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Сделка, "Ссылка, ЕдиныйОтветственныйОтОРК, Номер");		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
		|	РеализацияТоваровУслуг.НомерДляПечати КАК НомерДляПечати,
		|	РеализацияТоваровУслугУслуги.Сделка КАК Сделка,
		|	ДокСделка.ЕдиныйОтветственныйОтОРК КАК ЕдиныйОтветственныйОтОРК,
		|	ДокСделка.Номер КАК Номер
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка КАК ДокСделка
		|			ПО РеализацияТоваровУслугУслуги.Сделка = ДокСделка.Ссылка
		|		ПО РеализацияТоваровУслуг.Ссылка = РеализацияТоваровУслугУслуги.Ссылка
		|			И (РеализацияТоваровУслугУслуги.НомерСтроки = 1)
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", ДокументЪ);
		
		РеквизитыДокумента = Новый Структура("Контрагент, НомерДляПечати");
		РеквизитыСделки = Новый Структура("Ссылка, ЕдиныйОтветственныйОтОРК, Номер");
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(РеквизитыДокумента, Выборка);
			ЗаполнитьЗначенияСвойств(РеквизитыСделки, Выборка);
		КонецЕсли;
		//Евросиб Каблов 28.11.2025 ) #111016

		//Евросиб СубботинВ #84453 16.06.2025 Конец
		//Если Не ЗначениеЗаполнено(РеквизитыДокумента.СделкаЕдиныйОтветственныйОтОРК) Тогда
		//	Возврат;
		//КонецЕсли;
		Если Не ЗначениеЗаполнено(РеквизитыСделки.ЕдиныйОтветственныйОтОРК) Тогда
			Возврат;
		КонецЕсли;	
		
		//ЭлАдресПользователя = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(РеквизитыДокумента.СделкаЕдиныйОтветственныйОтОРК, Справочники.ВидыКонтактнойИнформации.EmailПользователя, ";");
		ЭлАдресПользователя = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(РеквизитыСделки.ЕдиныйОтветственныйОтОРК, Справочники.ВидыКонтактнойИнформации.EmailПользователя, ";");
		//Евросиб СубботинВ #84453 16.06.2025 Конец
		Если ПустаяСтрока(ЭлАдресПользователя) Тогда
			Возврат;
		КонецЕсли;	
		
		//Евросиб СубботинВ #84453 16.06.2025 Начало
		//НомерСделки 		= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(РеквизитыДокумента.СделкаНомер);
		НомерСделки 		= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(РеквизитыСделки.Номер);
		//Евросиб СубботинВ #84453 16.06.2025 Конец
		ТемаПисьма 			= СтрШаблон("Открытие РТУ на корректировку по сделке №%1 клиента ""%2""", НомерСделки, РеквизитыДокумента.Контрагент);
		ТекстПисьма			= СтрШаблон("Реализация №%1 (Клиент: %2) по сделке №%3 открыта на корректировку. Доступно удаление заявок/исключение контейнеров из сделки.", РеквизитыДокумента.НомерДляПечати, РеквизитыДокумента.Контрагент, НомерСделки);
		
		ПараметрыОтправкиПисьма = новый Структура;
		ПараметрыОтправкиПисьма.Вставить("Тема", 		ТемаПисьма);
		ПараметрыОтправкиПисьма.Вставить("Тело", 		ТекстПисьма);
		ПараметрыОтправкиПисьма.Вставить("ТипТекста", 	Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст);
		ПараметрыОтправкиПисьма.Вставить("Кому", 		ЭлАдресПользователя);
		
		УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
		
		Результат = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыОтправкиПисьма)
	КонецЕсли;	
	// Евросиб Фролов)
	
КонецПроцедуры

Процедура УстановитьРазрешениеВводаКорректировокНесколькихДокументов(Документы, Корректировка, Исправление, Аннулирование) Экспорт
	
	Для каждого Док из Документы Цикл
		УстановитьРазрешениеВводаКорректировок(Док, Корректировка, Исправление, Аннулирование);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСтатусРазрешенияКорректировки(Документ) Экспорт
	
	Результат = Новый Структура("Корректировка, Исправление, Аннулирование, Описание", Ложь, Ложь, Ложь, "");
	
	Если НЕ ЗначениеЗаполнено(Документ) Тогда Возврат Результат; КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РазрешениеВводаКорректировокСрезПоследних.РазрешенаКорректировка КАК РазрешенаКорректировка,
	               |	РазрешениеВводаКорректировокСрезПоследних.РазрешеноИсправление КАК РазрешеноИсправление,
	               |	РазрешениеВводаКорректировокСрезПоследних.РазрешеноАннулирование КАК РазрешеноАннулирование,
	               |	РазрешениеВводаКорректировокСрезПоследних.Период КАК Период,
	               |	РазрешениеВводаКорректировокСрезПоследних.КтоРазрешил КАК КтоРазрешил
	               |ИЗ
	               |	РегистрСведений.РазрешениеВводаКорректировок.СрезПоследних(, ОбъектКорректировки = &ДокументЪ) КАК РазрешениеВводаКорректировокСрезПоследних";
	Запрос.УстановитьПараметр("ДокументЪ", Документ);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат.Корректировка = Ответ.РазрешенаКорректировка;
		Результат.Исправление = Ответ.РазрешеноИсправление;
		Результат.Аннулирование = Ответ.РазрешеноАннулирование;
		Результат.Описание = "Разрешил: " + Ответ.КтоРазрешил + " " + Ответ.Период;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСведенияКорректировок(СписокИсхДокументов)
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РазрешениеВводаКорректировокСрезПоследних.РазрешенаКорректировка КАК РазрешенаКорректировка,
	               |	РазрешениеВводаКорректировокСрезПоследних.РазрешеноИсправление КАК РазрешеноИсправление,
	               |	РазрешениеВводаКорректировокСрезПоследних.РазрешеноАннулирование КАК РазрешеноАннулирование,
	               |	РазрешениеВводаКорректировокСрезПоследних.ОбъектКорректировки КАК ОбъектКорректировки
	               |ИЗ
	               |	РегистрСведений.РазрешениеВводаКорректировок.СрезПоследних(, ОбъектКорректировки В (&ОбъектКорректировки)) КАК РазрешениеВводаКорректировокСрезПоследних";
	Запрос.УстановитьПараметр("ОбъектКорректировки", СписокИсхДокументов);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		Результат.Вставить(Ответ.ОбъектКорректировки, Новый Структура("КорректировкаРазрешена,ИсправлениеРазрешено,АннулированиеРазрешено", Ответ.РазрешенаКорректировка, Ответ.РазрешеноИсправление, Ответ.РазрешеноАннулирование));
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

Процедура УстановитьВидимостьДанныхКорректировки(ЭтаФорма) Экспорт
	
	РезультатВидимости = Ложь;
	//
	//СписокПроверяемыхДокументов = Новый Массив;
	//Для каждого Стр из ЭтаФорма.Объект.Доходы Цикл
	//	РезультатВидимости = РезультатВидимости ИЛИ ЗначениеЗаполнено(Стр.КорректировкаДокумента) ИЛИ ЗначениеЗаполнено(Стр.КорректировкаВознаграждения);
	//	Если ЗначениеЗаполнено(Стр.УчДокумент) Тогда СписокПроверяемыхДокументов.Добавить(Стр.УчДокумент); КонецЕсли;
	//КонецЦикла;
	//
	//СведенияКорректировок = ПолучитьСведенияКорректировок(СписокПроверяемыхДокументов);
	//Для каждого Стр из ЭтаФорма.Объект.Доходы Цикл
	//	НайдСоотв = СведенияКорректировок.Получить(Стр.УчДокумент);
	//	Если ЗначениеЗаполнено(Стр.УчДокумент) И НайдСоотв <> неопределено Тогда
	//		ЗаполнитьЗначенияСвойств(Стр, НайдСоотв);
	//		РезультатВидимости = Истина;
	//	КонецЕсли;
	//	
	//	Для каждого Стр2 из ЭтаФорма.Объект.Доходы Цикл
	//		Если Стр.ГУИД = Стр2.ГУИДИсправляемойСтроки Тогда
	//			//Если ЗначениеЗаполнено(Стр2.КорректировкаДокумента) И Стр2.КорректировкаДокумента.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
	//			//	Стр.КорректировкаВыполнена = Истина;
	//			//КонецЕсли;
	//			//Если ЗначениеЗаполнено(Стр2.КорректировкаДокумента) И Стр2.КорректировкаДокумента.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Тогда
	//			//	Стр.ИсправлениеВыполнено = Истина;
	//			//КонецЕсли;
	//			//Если ЗначениеЗаполнено(Стр2.КорректировкаВознаграждения) И Стр2.КорректировкаВознаграждения.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
	//			//	Стр.КорректировкаВыполнена = Истина;
	//			//КонецЕсли;
	//			//Если ЗначениеЗаполнено(Стр2.КорректировкаВознаграждения) И Стр2.КорректировкаВознаграждения.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Тогда
	//			//	Стр.ИсправлениеВыполнено = Истина;
	//			//КонецЕсли;    
	//			
	//			//ДИТ, Беляев СЮ, BUG48279, 05-04-2022, начало   
	//			ВидОперацииКорректировки = Неопределено;
	//			Если ЗначениеЗаполнено(Стр2.КорректировкаДокумента) Тогда
	//				ВидОперацииКорректировки = Стр2.КорректировкаДокумента.ВидОперации;
	//			КонецЕсли;  
	//			Если ЗначениеЗаполнено(Стр2.КорректировкаВознаграждения) Тогда
	//				ВидОперацииКорректировки = Стр2.КорректировкаВознаграждения.ВидОперации;
	//			КонецЕсли;     
	//			Стр.КорректировкаВыполнена = ВидОперацииКорректировки = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение;
	//			Стр.ИсправлениеВыполнено = ВидОперацииКорректировки = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки;					
	//			//Евросиб - АСуслов 21.02.2024 15:52:18 #81376
	//			//(
	//			//Стр.АннулированиеВыполнено = ВидОперацииКорректировки = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование;
	//			//)
	//			//Евросиб - АСуслов 21.02.2024 15:52:29 #81376
	//			//ДИТ, Беляев СЮ, BUG48279, 05-04-2022, конец				
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//	
	//КонецЦикла;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаДоходы.ГУИД КАК ГУИД,
	|	СделкаДоходы.ГУИДИсправляемойСтроки КАК ГУИДИсправляемойСтроки,
	|	СделкаДоходы.КорректировкаДокумента КАК КорректировкаДокумента,
	|	СделкаДоходы.КорректировкаВознаграждения КАК КорректировкаВознаграждения,
	|	СделкаДоходы.УчДокумент КАК УчДокумент
	|ПОМЕСТИТЬ ВТ_Доходы
	|ИЗ
	|	Документ.Сделка.Доходы КАК СделкаДоходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазрешениеВводаКорректировокСрезПоследних.ОбъектКорректировки КАК ОбъектКорректировки,
	|	РазрешениеВводаКорректировокСрезПоследних.РазрешенаКорректировка КАК РазрешенаКорректировка,
	|	РазрешениеВводаКорректировокСрезПоследних.РазрешеноИсправление КАК РазрешеноИсправление,
	|	РазрешениеВводаКорректировокСрезПоследних.РазрешеноАннулирование КАК РазрешеноАннулирование
	|ПОМЕСТИТЬ ВТ_РазрешениеКорректировок
	|ИЗ
	|	РегистрСведений.РазрешениеВводаКорректировок.СрезПоследних(
	|			,
	|			ОбъектКорректировки В
	|				(ВЫБРАТЬ
	|					СделкаДоходы.УчДокумент
	|				ИЗ
	|					ВТ_Доходы КАК СделкаДоходы
	//|				ГДЕ
	//|					СделкаДоходы.Ссылка = &Сделка)
	|  				)) КАК РазрешениеВводаКорректировокСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаДоходы.ГУИД КАК ГУИД,
	|	ЕСТЬNULL(ВТ_РазрешениеКорректировок.РазрешенаКорректировка, ЛОЖЬ) КАК РазрешенаКорректировка,
	|	ЕСТЬNULL(ВТ_РазрешениеКорректировок.РазрешеноИсправление, ЛОЖЬ) КАК РазрешеноИсправление,
	|	ЕСТЬNULL(ВТ_РазрешениеКорректировок.РазрешеноАннулирование, ЛОЖЬ) КАК РазрешеноАннулирование,
	|	ВЫБОР
	|		КОГДА СделкаДоходы1.КорректировкаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИсправлениеВыполнено,
	|	ВЫБОР
	|		КОГДА СделкаДоходы.КорректировкаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК АннулированиеВыполнено,
	|	ВЫБОР
	|		КОГДА СделкаДоходы1.КорректировкаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КорректировкаВыполнена
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 31-07-2025, начало
	|	,СделкаДоходы1.ГУИД КАК ГУИДКорректирущейСтроки
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 31-07-2025, конец
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_Доходы КАК СделкаДоходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РазрешениеКорректировок КАК ВТ_РазрешениеКорректировок
	|		ПО СделкаДоходы.УчДокумент = ВТ_РазрешениеКорректировок.ОбъектКорректировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Доходы КАК СделкаДоходы1
	|		ПО СделкаДоходы.ГУИД = СделкаДоходы1.ГУИДИсправляемойСтроки
	//|			И СделкаДоходы.Ссылка = СделкаДоходы1.Ссылка
	//|ГДЕ
	//|	СделкаДоходы.Ссылка = &Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результат.ГУИД КАК ГУИД,
	//|	ВТ_Результат.РазрешенаКорректировка КАК РазрешенаКорректировка,
	//|	ВТ_Результат.РазрешеноИсправление КАК РазрешеноИсправление,
	//|	ВТ_Результат.РазрешеноАннулирование КАК РазрешеноАннулирование,
	//ДИТ, Беляев СЮ, Ticket#0346396, 26-03-2024, начало
	|	ВТ_Результат.РазрешенаКорректировка КАК КорректировкаРазрешена,
	|	ВТ_Результат.РазрешеноИсправление КАК ИсправлениеРазрешено,
	|	ВТ_Результат.РазрешеноАннулирование КАК АннулированиеРазрешено,
	//ДИТ, Беляев СЮ, Ticket#0346396, 26-03-2024, конец
	|	ВТ_Результат.ИсправлениеВыполнено КАК ИсправлениеВыполнено,
	|	ВТ_Результат.АннулированиеВыполнено КАК АннулированиеВыполнено,
	|	ВТ_Результат.КорректировкаВыполнена КАК КорректировкаВыполнена
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 31-07-2025, начало
	|	,ВТ_Результат.ГУИДКорректирущейСтроки КАК ГУИДКорректирущейСтроки
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 31-07-2025, конец
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|ГДЕ
	|	(ВТ_Результат.РазрешенаКорректировка
	|			ИЛИ ВТ_Результат.РазрешеноИсправление
	|			ИЛИ ВТ_Результат.РазрешеноАннулирование
	|			ИЛИ ВТ_Результат.ИсправлениеВыполнено
	|			ИЛИ ВТ_Результат.АннулированиеВыполнено
	|			ИЛИ ВТ_Результат.КорректировкаВыполнена)";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Сделка.Доходы КАК СделкаДоходы", "&Доходы КАК СделкаДоходы");
	Запрос.УстановитьПараметр("Доходы", ЭтаФорма.Объект.Доходы.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаРезультатаЗапроса = РезультатЗапроса.Выбрать();
		РезультатВидимости = Истина;
		Пока ВыборкаРезультатаЗапроса.Следующий() Цикл
			СтрокиДоход = ЭтаФорма.Объект.Доходы.НайтиСтроки(Новый Структура("ГУИД", ВыборкаРезультатаЗапроса.ГУИД));
			Для каждого СтрокаДоход Из СтрокиДоход Цикл
				ЗаполнитьЗначенияСвойств(СтрокаДоход, ВыборкаРезультатаЗапроса);
			КонецЦикла;
			//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 31-07-2025, начало
			СтрокиДоход = ЭтаФорма.Объект.Доходы.НайтиСтроки(Новый Структура("ГУИД", ВыборкаРезультатаЗапроса.ГУИДКорректирущейСтроки));
			Для каждого СтрокаДоход Из СтрокиДоход Цикл
				СтрокаДоход.КорректировкаРазрешенаУсловноеОформление = ВыборкаРезультатаЗапроса.КорректировкаРазрешена;
				СтрокаДоход.ИсправлениеРазрешеноУсловноеОформление = ВыборкаРезультатаЗапроса.ИсправлениеРазрешено;
			КонецЦикла;
			//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 31-07-2025, конец
		КонецЦикла;
	КонецЕсли;
	
	
	ЭтаФорма.Элементы.ДоходыГруппаКорректировка.Видимость = РезультатВидимости;
	ЭтаФорма.Элементы.ДоходыГруппаИсправление.Видимость = РезультатВидимости;
	ЭтаФорма.Элементы.ДоходыГруппаАннулирование.Видимость = РезультатВидимости;
	ЭтаФорма.Элементы.ДоходыГруппа24.Видимость = РезультатВидимости;
	ЭтаФорма.Элементы.Доходыкорр_СоздатьДокументКорректировки.Видимость = РезультатВидимости;
	ЭтаФорма.Элементы.Доходыкорр_СоздатьКорректировкуВознаграждения.Видимость = РезультатВидимости;
	ЭтаФорма.Элементы.Доходыкорр_УдалитьДокументКорректировки.Видимость = РезультатВидимости;
	
	ЭтаФорма.Элементы.Доходыкорр_АннулироватьРеализацию.Видимость = Ложь;
	
	РольПолныеПрава = РольПолныеПраваДоступна();
	
	ЭтаФорма.Элементы.ДоходыГруппаКорректировка.ТолькоПросмотр = НЕ РольПолныеПрава;
	ЭтаФорма.Элементы.ДоходыГруппаИсправление.ТолькоПросмотр = НЕ РольПолныеПрава;
	ЭтаФорма.Элементы.ДоходыГруппаАннулирование.ТолькоПросмотр = НЕ РольПолныеПрава;
	
КонецПроцедуры

Функция ПолучитьДанныеПервичногоДокумента(ДокументОснование, ГУИДСтроки, ИскатьДанныеВознаграждения = Ложь) Экспорт
	
	Результат = Новый Структура("СписокТС,СписокТЕ,СписокТД,ПунктОтправления,ПунктНазначения,ЕдиницаИзмерения,СодержаниеДоИзменения,КлючСтроки,КоличествоДоИзменения,ЦенаДоИзменения,СуммаДоИзменения,СуммаНДСДоИзменения,СтавкаНДСДоИзменения,ВсегоДоИзменения");
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда возврат Результат; КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	Запрос.УстановитьПараметр("СтрокаДоходовСделки", ГУИДСтроки);
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	КорректировкаРеализацииУслуги.СодержаниеДоИзменения КАК СодержаниеДоИзменения,
		               |	КорректировкаРеализацииУслуги.КоличествоДоИзменения КАК КоличествоДоИзменения,
		               |	КорректировкаРеализацииУслуги.ЦенаДоИзменения КАК ЦенаДоИзменения,
		               |	КорректировкаРеализацииУслуги.СуммаДоИзменения КАК СуммаДоИзменения,
		               |	КорректировкаРеализацииУслуги.СуммаНДСДоИзменения КАК СуммаНДСДоИзменения,
		               |	КорректировкаРеализацииУслуги.СтавкаНДСДоИзменения КАК СтавкаНДСДоИзменения,
		               |	КорректировкаРеализацииУслуги.ВсегоДоИзменения КАК ВсегоДоИзменения,
		               |	КорректировкаРеализацииУслуги.СписокТС КАК СписокТС,
		               |	КорректировкаРеализацииУслуги.СписокТЕ КАК СписокТЕ,
		               |	КорректировкаРеализацииУслуги.СписокТД КАК СписокТД,
		               |	КорректировкаРеализацииУслуги.ПунктОтправления КАК ПунктОтправления,
		               |	КорректировкаРеализацииУслуги.ПунктНазначения КАК ПунктНазначения,
		               |	КорректировкаРеализацииУслуги.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		               |	КорректировкаРеализацииУслуги.КлючСтроки КАК КлючСтроки
		               |ИЗ
		               |	Документ.КорректировкаРеализации.Услуги КАК КорректировкаРеализацииУслуги
		               |ГДЕ
		               |	КорректировкаРеализацииУслуги.Ссылка = &Ссылка
		               |	И КорректировкаРеализацииУслуги.СтрокаДоходовСделки = &СтрокаДоходовСделки";
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	РеализацияТоваровУслугУслуги.Содержание КАК СодержаниеДоИзменения,
		               |	РеализацияТоваровУслугУслуги.Количество КАК КоличествоДоИзменения,
		               |	РеализацияТоваровУслугУслуги.Цена КАК ЦенаДоИзменения,
		               |	РеализацияТоваровУслугУслуги.Сумма КАК СуммаДоИзменения,
		               |	РеализацияТоваровУслугУслуги.СтавкаНДС КАК СтавкаНДСДоИзменения,
		               |	РеализацияТоваровУслугУслуги.СуммаНДС КАК СуммаНДСДоИзменения,
		               |	ВЫБОР
		               |		КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
		               |			ТОГДА РеализацияТоваровУслугУслуги.Сумма
		               |		ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма + РеализацияТоваровУслугУслуги.СуммаНДС
		               |	КОНЕЦ КАК ВсегоДоИзменения,
		               |	РеализацияТоваровУслугУслуги.ПунктОтправления КАК ПунктОтправления,
		               |	РеализацияТоваровУслугУслуги.ПунктНазначения КАК ПунктНазначения,
		               |	РеализацияТоваровУслугУслуги.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		               |	РеализацияТоваровУслугУслуги.СписокТС КАК СписокТС,
		               |	РеализацияТоваровУслугУслуги.СписокТЕ КАК СписокТЕ,
		               |	РеализацияТоваровУслугУслуги.СписокТД КАК СписокТД
		               |ИЗ
		               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
		               |ГДЕ
		               |	РеализацияТоваровУслугУслуги.Ссылка = &Ссылка
		               |	И РеализацияТоваровУслугУслуги.СтрокаДоходовСделки = &СтрокаДоходовСделки";
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОтчетКомитентуОПродажахТовары.Содержание КАК СодержаниеДоИзменения,
		               |	ОтчетКомитентуОПродажахТовары.Количество КАК КоличествоДоИзменения,
		               |	ОтчетКомитентуОПродажахТовары.Цена КАК ЦенаДоИзменения,
		               |	ОтчетКомитентуОПродажахТовары.Сумма КАК СуммаДоИзменения,
		               |	ОтчетКомитентуОПродажахТовары.СтавкаНДС КАК СтавкаНДСДоИзменения,
		               |	ОтчетКомитентуОПродажахТовары.СуммаНДС КАК СуммаНДСДоИзменения,
		               |	ВЫБОР
		               |		КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС
		               |			ТОГДА ОтчетКомитентуОПродажахТовары.Сумма
		               |		ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма + ОтчетКомитентуОПродажахТовары.СуммаНДС
		               |	КОНЕЦ КАК ВсегоДоИзменения,
		               |	ОтчетКомитентуОПродажахТовары.КлючСтроки КАК КлючСтроки,
		               |	ОтчетКомитентуОПродажахТовары.СписокТС КАК СписокТС,
		               |	ОтчетКомитентуОПродажахТовары.СписокТЕ КАК СписокТЕ,
		               |	ОтчетКомитентуОПродажахТовары.СписокТД КАК СписокТД
		               |ИЗ
		               |	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
		               |ГДЕ
		               |	ОтчетКомитентуОПродажахТовары.Ссылка = &Ссылка
		               |	И ОтчетКомитентуОПродажахТовары.СтрокаДоходовСделки = &СтрокаДоходовСделки";
		
	КонецЕсли;
	
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Ответ);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//Евросиб Дубская 01.03.2022 ( Ticket#0256935
////ДИТ Давудов М.А. Task32744 03.07.2021 Начало
////ок(
////Функция СоздатьКоррРТУПоПараметрам(ИсходныйДокумент, МассивКорректируемыхСтрок, МасУчЕдиниц, РежимКорректировки, ЭтоВознаграждение = Ложь, Трансляция = неопределено) Экспорт
//Функция СоздатьКоррРТУПоПараметрам(ИсходныйДокумент, МассивКорректируемыхСтрок, МасУчЕдиниц, РежимКорректировки, ЭтоВознаграждение = Ложь, Трансляция = неопределено, СоздатьCreditNote = Ложь, ПСЦ = Неопределено, Коносамент = Неопределено) Экспорт
////ок)
////ДИТ Давудов М.А. Task32744 03.07.2021 Конец
Функция СоздатьКоррРТУПоПараметрам(ИсходныйДокумент, МассивКорректируемыхСтрок, МасУчЕдиниц, РежимКорректировки, ЭтоВознаграждение = Ложь, Трансляция = неопределено, СоздатьCreditNote = Ложь, ПСЦ = Неопределено, Коносамент = Неопределено, Корректировка = Неопределено) Экспорт

	//Евросиб Дубская 01.03.2022 )
	Результат = неопределено;
	
	НДок = Документы.КорректировкаРеализации.СоздатьДокумент();
	НДок.Дата = ТекущаяДата();
//Евросиб Дубская 01.03.2022 ( Ticket#0256935	
	//НДок.Заполнить(ИсходныйДокумент);  
	Если ЗначениеЗаполнено(Корректировка)
		И НЕ Корректировка = Неопределено Тогда
		
		НДок.Заполнить(Корректировка);    
	Иначе
		НДок.Заполнить(ИсходныйДокумент);  
	КонецЕсли;

	
//Евросиб Дубская 01.03.2022 )
	//ДИТ Давудов М.А. Task32744 03.07.2021 Начало
	// Форматрование credit note
	Если СоздатьCreditNote
	   И ТипЗнч(ИсходныйДокумент) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
	   //Евросиб СубботинВ #Ticket#0405772 04.07.2025 Начало 
		//МассивДокументов = Документы.Сделка.СформироватьСчетНаОплатуПокупателюCreditNote(ИсходныйДокумент.Сделка, ИсходныйДокумент.Контрагент, ИсходныйДокумент.ДоговорКонтрагента, ИсходныйДокумент.СчетНаОплатуПокупателю);	
		СчетНаОплату = Документы.СчетНаОплатуПокупателю.ПустаяСсылка();
        Сделка = Документы.Сделка.ПустаяСсылка();
		
		//Евросиб Каблов 28.11.2025 ( #111016
		//Если ИсходныйДокумент.СчетаНаОплатуПокупателям.Количество() > 0 Тогда 
		//	ТчСчета = ИсходныйДокумент.СчетаНаОплатуПокупателям;
		//	Если ЗначениеЗаполнено(ТчСчета[0].Сделка) Тогда
		//		Сделка = ТчСчета[0].Сделка;
		//	КонецЕсли;
		//	
		//	Если ЗначениеЗаполнено(ТчСчета[0].СчетПокупателю) Тогда
		//		СчетНаОплату = ТчСчета[0].СчетПокупателю;
		//	КонецЕсли;
		//КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугУслуги.Сделка КАК Сделка,
		|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.СчетПокупателю КАК СчетПокупателю
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.СчетаНаОплатуПокупателям КАК РеализацияТоваровУслугСчетаНаОплатуПокупателям,
		|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
		|ГДЕ
		|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка = &Ссылка
		|	И РеализацияТоваровУслугСчетаНаОплатуПокупателям.НомерСтроки = 1
		|	И РеализацияТоваровУслугУслуги.Ссылка = &Ссылка
		|	И РеализацияТоваровУслугУслуги.НомерСтроки = 1";
		Запрос.УстановитьПараметр("Ссылка", ИсходныйДокумент);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			Если ЗначениеЗаполнено(Выборка.Сделка) Тогда
				Сделка = Выборка.Сделка;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.СчетПокупателю) Тогда
				СчетНаОплату = Выборка.СчетПокупателю;
			КонецЕсли;
			
		КонецЕсли;
		//Евросиб Каблов 28.11.2025 ) #111016
		
		МассивДокументов = Документы.Сделка.СформироватьСчетНаОплатуПокупателюCreditNote(Сделка, ИсходныйДокумент.Контрагент, ИсходныйДокумент.ДоговорКонтрагента, СчетНаОплату);	
		//Евросиб СубботинВ #Ticket#0405772 04.07.2025 Конец
		Если МассивДокументов.Количество() > 0 Тогда
			НДок.СчетНаОплатуПокупателю = МассивДокументов[0].CreditNote;
		КонецЕсли;
	КонецЕсли;
	//ДИТ Давудов М.А. Task32744 03.07.2021 Конец 	
	НДок.ВидОперации = РежимКорректировки;
	Если РежимКорректировки = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Тогда
		ЗаполнитьЗначенияСвойств(НДок, ИсходныйДокумент, "ДатаДокумента, НомерДляПечати");
	КонецЕсли;
	Если ЭтоВознаграждение Тогда
		НДок.ЭтоИзменениеВознаграждения = Истина;
		НДок.КорректировкаОтчетаКомитенту = Ложь;
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0395339, 22-04-2025, начало
		//НДок.НомерДляПечати = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсходныйДокумент, "НомерДляПечатиВознаграждение");
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0395339, 22-04-2025, конец
		//Евросиб(ДИТ), Беляев СЮ, US 115224 / TA 116161 - US 115814 / TA 115824, 08-08-2025, начало
		Если РежимКорректировки = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Тогда
			НДок.НомерДляПечати = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсходныйДокумент, "НомерДляПечатиВознаграждение");
		КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, US 115224 / TA 116161 - US 115814 / TA 115824, 08-08-2025, конец
	КонецЕсли;
	
	Если ТипЗнч(ИсходныйДокумент) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		НДок.Услуги.Очистить();
	КонецЕсли;
	
	Ндок.ПериодВО = неопределено;
	
	// Шейко О.Е. (16.03.2021) Добавление расшифровки на основании новых данных
	РасшДоИзменений = Ндок.РасшифровкаУслугПоТС.Выгрузить();
	РасшДоИзменений.Колонки.Добавить("КонтейнерСтр", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
	Для каждого Стр Из РасшДоИзменений Цикл
		Стр.КонтейнерСтр = Строка(Стр.Контейнер);
	КонецЦикла; 
	РасшДоИзменений.Индексы.Добавить("КонтейнерСтр");
	
	ТЗСтрДохСделки = РасшДоИзменений.Скопировать(, "СтрокаДоходовСделки");
	ТЗСтрДохСделки.Свернуть("СтрокаДоходовСделки");
	ТЗСтрДохСделки.Колонки.Добавить("Использован");
	
	ТЗУчЕдиниц = ПолучитьТЗУчЕдиниц(МасУчЕдиниц);
	
	РасшПослеИзменений = Ндок.РасшифровкаУслугПоТС.Выгрузить();
	РасшПослеИзменений.Очистить(); 
	
	//ДИТ Авдеева В.С. 47522 Начало 18.08.2022  
	СтруктураВалютаДокумента = Новый Структура;
	СтруктураВалютаДокумента.Вставить("Валюта",НДок.ВалютаДокумента);
	СтруктураВалютаДокумента.Вставить("Курс",НДок.КурсВзаиморасчетов);
	СтруктураВалютаДокумента.Вставить("Кратность",НДок.КратностьВзаиморасчетов);
	//ДИТ Авдеева В.С. 47522 Конец 18.08.2022
	
	//Евросиб(ДИТ), Беляев СЮ, US 115224 / TA 115264, 25-07-2025, начало
	ДатаОказанияУслугиСтрокиДоходов = Дата(1,1,1);
	//Евросиб(ДИТ), Беляев СЮ, US 115224 / TA 115264, 25-07-2025, начало
	
	//Субботин исправление бага 130097 26.02.2026 
	РегВалюта = Константы.ВалютаРегламентированногоУчета.Получить();
	//Субботин исправление бага 130097 26.02.2026 
	
	Для каждого Стр из МассивКорректируемыхСтрок Цикл 
		//Евросиб(ДИТ), Беляев СЮ, US 115224 / TA 115264, 25-07-2025, начало
		ДатаОказанияУслугиСтрокиДоходов = Стр.ДатаОказанияУслуги;
		//Евросиб(ДИТ), Беляев СЮ, US 115224 / TA 115264, 25-07-2025, начало
		//ДИТ Авдеева В.С. 47522 Начало 18.08.2022   
		Если Стр.Свойство("Валюта") 
			И ЗначениеЗаполнено(Стр.Валюта) 
			И Стр.Валюта <> НДок.ВалютаДокумента Тогда
			
			////++ДИТ Гаузер А.В. BUG 47522 07.10.2022
			////РезультатВалюта = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Стр.Валюта, НДок.ДатаДокумента);
			//РезультатВалюта = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Стр.Валюта, ИсходныйДокумент.ДатаДокумента);
			////--ДИТ Гаузер А.В. BUG 47522 07.10.2022
			//ДИТ, Беляев СЮ, BUG 57827, 26-04-2023, начало
			//Евросиб СубботинВ #126796 22.12.2025 Начало
			Если Не ЗначениеЗаполнено(Стр.КурсВалюты) Тогда
			//Евросиб СубботинВ #126796 22.12.2025 Конец				
				ДатаКурса = ?(ЗначениеЗаполнено(ИсходныйДокумент.ДатаКурса), ИсходныйДокумент.ДатаКурса, ИсходныйДокумент.ДатаДокумента);
				РезультатВалюта = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Стр.Валюта, ДатаКурса);
			//Евросиб СубботинВ #126796 22.12.2025 Начало				
			Иначе
				Если ЗначениеЗаполнено(Стр.ДатаКурсаВалюты) Тогда
					ДатаКурса = Стр.ДатаКурсаВалюты;					
				Иначе
					ДатаКурса = ?(ЗначениеЗаполнено(ИсходныйДокумент.ДатаКурса), ИсходныйДокумент.ДатаКурса, ИсходныйДокумент.ДатаДокумента);
				КонецЕсли;
				РезультатВалюта = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Стр.Валюта, ДатаКурса);
            КонецЕсли;
			//Евросиб СубботинВ #126796 22.12.2025 Конец

			//ДИТ, Беляев СЮ, BUG 57827, 26-04-2023, конец
			СтруктураВалютаСтроки = Новый Структура;
			СтруктураВалютаСтроки.Вставить("Валюта",Стр.Валюта);
			//Евросиб СубботинВ #126796 22.12.2025 Начало
			//СтруктураВалютаСтроки.Вставить("Курс",РезультатВалюта.Курс);
			СтруктураВалютаСтроки.Вставить("Курс", ?(ЗначениеЗаполнено(Стр.КурсВалюты), Стр.КурсВалюты, РезультатВалюта.Курс));
			//Евросиб СубботинВ #126796 22.12.2025 Конец
			СтруктураВалютаСтроки.Вставить("Кратность",РезультатВалюта.Кратность);  
			
			Стр.Цена = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Стр.Цена, СтруктураВалютаСтроки, СтруктураВалютаДокумента);
			Стр.Сумма = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Стр.Сумма, СтруктураВалютаСтроки, СтруктураВалютаДокумента);
			Стр.СуммаНДС = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Стр.СуммаНДС, СтруктураВалютаСтроки, СтруктураВалютаДокумента);
			Стр.Всего = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Стр.Всего, СтруктураВалютаСтроки, СтруктураВалютаДокумента);

		КонецЕсли;
		//ДИТ Авдеева В.С. 47522 Конец 18.08.2022
		
		//Евросиб Каблов 05.01.2024 ( #79370
		//Ндок.ПериодВО = Стр.ПериодВО;
		Ндок.ПериодВО = НачалоМесяца(Стр.ПериодВО);
		//Евросиб Каблов 05.01.2024 )
		
		Если ТипЗнч(ИсходныйДокумент) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
			НСтр = НДок.Услуги.Добавить();
		Иначе
			НСтр = Ндок.Услуги.Найти(Стр.СтрокаДоходовСделкиДоИзменения, "СтрокаДоходовСделки");
		КонецЕсли;         
		
		//Евросиб Дубская 01.03.2022 ( Ticket#0256935  
		//ЗаполнитьЗначенияСвойств(НСтр, Стр);
		Если НСтр = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Корректировка) Тогда
			ЗаполнитьЗначенияСвойств(НСтр, Стр, "Всего, Количество, СписокТД, СписокТЕ, 
			|СписокТС, СтавкаНДС, СтрокаДоходовСделки, СтрокаДоходовСделкиДоИзменения, Сумма, СуммаНДС, Цена"); 
		Иначе
			ЗаполнитьЗначенияСвойств(НСтр, Стр);
		КонецЕсли;		
		//Евросиб Дубская 01.03.2022 )
		
		Если Стр.Свойство("НДСВклВСтоимость") Тогда
			НДок.СуммаВключаетНДС = Стр.НДСВклВСтоимость;
		КонецЕсли;
		
		//Субботин исправление бага 130097 26.02.2026 Начало
		НСтр.СуммаБезНалога =	Валюта_сервер.ПересчитатьПоКурсу(?(НДок.СуммаВключаетНДС, нСтр.Сумма - НСтр.СуммаНДС,  НСтр.Сумма), Ндок.ВалютаДокумента, РегВалюта, Ндок.ДатаКурса);
		НСтр.СуммаНДСРуб =  	Валюта_сервер.ПересчитатьПоКурсу(НСтр.СуммаНДС, Ндок.ВалютаДокумента, РегВалюта, Ндок.ДатаКурса);
		НСтр.СтавкаНДСРуб = 	НСтр.СтавкаНДСРуб;
		НСтр.ВсегоСНДС =    	Валюта_сервер.ПересчитатьПоКурсу(НСтр.Всего, Ндок.ВалютаДокумента, РегВалюта, Ндок.ДатаКурса);
		//Субботин исправление бага 130097 26.02.2026 	
		
		МассивТС = СтрРазделить(СтрЗаменить(Стр.СписокТС, " ", ""), ";", Ложь);
		МассивТЕ = СтрРазделить(СтрЗаменить(Стр.СписокТЕ, " ", ""), ";", Ложь);
		МассивТД = СтрРазделить(СтрЗаменить(Стр.СписокТД, " ", ""), ";", Ложь);
		
		// Проверим наличие уч единиц, если больше - удалим, меньше - добавим
		Если МассивТЕ.Количество() > 0 Тогда
			
			Для каждого СтрТЕ Из МассивТЕ Цикл
				
				// Ищем уч ед ранее, если есть заполняем ей (СОХРАНЯЕМ СТАРЫЕ ДАННЫЕ)
				ИскСтрДоИзм = РасшДоИзменений.НайтиСтроки(Новый Структура("КонтейнерСтр, СтрокаДоходовСделкиДоИзменения", СтрТЕ, Стр.СтрокаДоходовСделкиДоИзменения));
				
				Если ИскСтрДоИзм.Количество() = 0 Тогда
					ИскСтрДоИзм = РасшДоИзменений.НайтиСтроки(Новый Структура("КонтейнерСтр, СтрокаДоходовСделки", СтрТЕ, Стр.СтрокаДоходовСделкиДоИзменения)) ;
				КонецЕсли;
				
				Если ИскСтрДоИзм.Количество() > 0 Тогда
					
					НовСтр_РасшПослеИзменений = РасшПослеИзменений.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр_РасшПослеИзменений, ИскСтрДоИзм[0]);
					
				Иначе
					// Если нет ищем в уч ед сделки и ДОБАВЛЯЕМ НОВУЮ ИНФОРМАЦИЮ:
					ИскСтрМасУчЕд = ТЗУчЕдиниц.НайтиСтроки(Новый Структура("КонтейнерСтр", СтрТЕ) );
					//ДИТ Шевченко А.В. TASK 53500 29.06.2022 -Начало
					Если ИскСтрМасУчЕд.Количество() = 0 Тогда
						Продолжить;
					КонецЕсли;
					//ДИТ Шевченко А.В. TASK 53500 29.06.2022 -Конец
					НовСтр_РасшПослеИзменений = РасшПослеИзменений.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр_РасшПослеИзменений, ИскСтрМасУчЕд[0]);
					НовСтр_РасшПослеИзменений.ДатаОтправки = ИскСтрМасУчЕд[0].ЖДН.НакладнаяЭТРАН.ДатаИВремяОтправленияГруза;
					НовСтр_РасшПослеИзменений.ВидПеревозки = ИскСтрМасУчЕд[0].Заявка.ВидПеревозки;
					НовСтр_РасшПослеИзменений.СтрокаДоходовСделки = Стр.СтрокаДоходовСделкиДоИзменения;
					
					ЖДН = ИскСтрМасУчЕд[0].ЖДН.НакладнаяЭТРАН;
					
					Для каждого Стр_КТ_ЖДН Из ЖДН.Контейнеры Цикл
						
						Если Стр_КТ_ЖДН.НомерКонтейнера = ИскСтрМасУчЕд[0].КонтейнерСтр Тогда
							НовСтр_РасшПослеИзменений.ФактическийВес = Стр_КТ_ЖДН.МассыВКгНетто;
							НовСтр_РасшПослеИзменений.РасчетныйВес = Стр_КТ_ЖДН.МассыВКгНетто;
							Прервать;
						КонецЕсли;
						
					КонецЦикла; 
					
					// Сумм, цены, количества нету. Не было их до изменений, строка новая
					
				КонецЕсли; 
				
			КонецЦикла;
		
		КонецЕсли; 
		Если МассивТЕ.Количество() = 0 И МассивТС.Количество() > 0 Тогда
			
			Для каждого СтрТС Из МассивТС Цикл
				
				// Ищем уч ед ранее, если есть заполняем ей (СОХРАНЯЕМ СТАРЫЕ ДАННЫЕ)
				//++ Зубов 0245244 04.10.2021 Убираем крест. Нет такой колонки "ВагонСтр", есть колонка "Вагон".
				//ИскСтрДоИзм = РасшДоИзменений.НайтиСтроки(Новый Структура("ВагонСтр, СтрокаДоходовСделки", СтрТС, Стр.СтрокаДоходовСделкиДоИзменений)) ;
				ИскСтрДоИзм = РасшДоИзменений.НайтиСтроки(Новый Структура("Вагон, СтрокаДоходовСделки", СтрТС, Стр.СтрокаДоходовСделкиДоИзменения)) ;
				//-- Зубов 0245244 04.10.2021
				Если ИскСтрДоИзм.Количество() > 0 Тогда
					
					Для каждого Стр_ИскСтрДоИзм Из ИскСтрДоИзм Цикл
					
						НовСтр_РасшПослеИзменений = РасшПослеИзменений.Добавить();
						ЗаполнитьЗначенияСвойств(НовСтр_РасшПослеИзменений, Стр_ИскСтрДоИзм);
					
					КонецЦикла; 
					
				Иначе
					// Если нет ищем в уч ед сделки и ДОБАВЛЯЕМ НОВУЮ ИНФОРМАЦИЮ:
					//++ Зубов 0245244 04.10.2021 Убираем крест. Нет такой колонки "ВагонСтр", есть колонка "Вагон".
					//ИскСтрМасУчЕд = ТЗУчЕдиниц.НайтиСтроки(Новый Структура("ВагонСтр", СтрТС) );
					ИскСтрМасУчЕд = ТЗУчЕдиниц.НайтиСтроки(Новый Структура("Вагон", СтрТС) );
					//-- Зубов 0245244 04.10.2021					
					
					Для каждого Стр_ИскСтрМасУчЕд Из ИскСтрМасУчЕд Цикл
					
						НовСтр_РасшПослеИзменений = РасшПослеИзменений.Добавить();
						ЗаполнитьЗначенияСвойств(НовСтр_РасшПослеИзменений, Стр_ИскСтрМасУчЕд);
						НовСтр_РасшПослеИзменений.ДатаОтправки = Стр_ИскСтрМасУчЕд.ЖДН.НакладнаяЭТРАН.ДатаИВремяОтправленияГруза;
						НовСтр_РасшПослеИзменений.ВидПеревозки = Стр_ИскСтрМасУчЕд.Заявка.ВидПеревозки;
						НовСтр_РасшПослеИзменений.СтрокаДоходовСделки = Стр.СтрокаДоходовСделкиДоИзменения;
						
						// Веса не заполняем, т.к. нет информации о КТ:
						//ЖДН = Стр_ИскСтрМасУчЕд.ЖДН.НакладнаяЭТРАН;
						//
						//Для каждого Стр_КТ_ЖДН Из ЖДН.Контейнеры Цикл
						//	
						//	Если Стр_КТ_ЖДН.НомерКонтейнера = Стр_ИскСтрМасУчЕд.КонтейнерСтр Тогда
						//		НовСтр_РасшПослеИзменений.ФактическийВес = Стр_КТ_ЖДН.МассыВКгНетто;
						//		НовСтр_РасшПослеИзменений.РасчетныйВес = Стр_КТ_ЖДН.МассыВКгНетто;
						//		Прервать;
						//	КонецЕсли;
						//	
						//КонецЦикла;
						
						// Сумм, цены, количества нету. Не было их до изменений, строка новая
						
					КонецЦикла; 
					
				КонецЕсли; 
				
			КонецЦикла;
		
		КонецЕсли;
		
		// Отметим строку, которую мы обходили
		ИскСтрДохСделки = ТЗСтрДохСделки.Найти(Стр.СтрокаДоходовСделкиДоИзменения);
		Если ИскСтрДохСделки <> неопределено Тогда
			ИскСтрДохСделки.Использован = Истина;
		КонецЕсли;
		
	КонецЦикла;
	// Добавим строки расшифровки, которые не корректировались:
	Для каждого Стр Из ТЗСтрДохСделки Цикл
	
		Если НЕ Стр.Использован = Истина Тогда
		
			ИскСтрДоИзм = РасшДоИзменений.НайтиСтроки(Новый Структура("СтрокаДоходовСделки", Стр.СтрокаДоходовСделки)) ;
			Для каждого Стр_ИскСтрДоИзм Из ИскСтрДоИзм Цикл
				НовСтр_РасшПослеИзменений = РасшПослеИзменений.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр_РасшПослеИзменений, Стр_ИскСтрДоИзм);
			КонецЦикла; 
		КонецЕсли; 
	
	КонецЦикла; 
	
	Ндок.РасшифровкаУслугПоТС.Загрузить(РасшПослеИзменений);
	
	
	//Если Трансляция <> неопределено Тогда
	//	Для каждого Стр из НДок.РасшифровкаУслугПоТС Цикл
	//		
	//		Стр.СтрокаДоходовСделкиДоИзменения = Стр.СтрокаДоходовСделкиДоИзменения;
	//		
	//		НовыйГУИД = Трансляция.Получить(Стр.СтрокаДоходовСделкиДоИзменения);
	//		Если НовыйГУИД <> неопределено Тогда
	//			Стр.СтрокаДоходовСделкиДоИзменения = НовыйГУИД;
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//КонецЕсли;  
	//ДИТ Беляев СЮ, Ticket#0248427, 02-11-2021 ++          (Приведено к состоянию в тестовом хранилище конфигураций)
	Если Трансляция <> неопределено Тогда
		Для каждого Стр из НДок.РасшифровкаУслугПоТС Цикл
			
			Стр.СтрокаДоходовСделки = Стр.СтрокаДоходовСделкиДоИзменения;
			
			НовыйГУИД = Трансляция.Получить(Стр.СтрокаДоходовСделкиДоИзменения);
			//++ДИТ_Коробов_Task 48097_16.03.22
			Если НовыйГУИД <> неопределено Тогда
				НовыйГУИДСтарший = Трансляция.Получить(НовыйГУИД);
				Если НовыйГУИДСтарший <> неопределено тогда
					Стр.СтрокаДоходовСделкиДоИзменения = НовыйГУИД;
					Стр.СтрокаДоходовСделки = НовыйГУИДСтарший;
				Иначе
					Стр.СтрокаДоходовСделки = НовыйГУИД
				КонецЕсли;
			КонецЕсли;
			//Если НовыйГУИД <> неопределено Тогда
			//	Стр.СтрокаДоходовСделки = НовыйГУИД;
			//КонецЕсли;
			//--ДИТ_Коробов_Task 48097_02.03.22
			
		КонецЦикла;
	КонецЕсли;
	//ДИТ Беляев СЮ, Ticket#0248427, 02-11-2021 ++
	
	Если РежимКорректировки <> Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Тогда
		//НДок.ДатаДокумента = ?(НДок.Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия, Началомесяца(НДок.ПериодВО), КонецМесяца(Ндок.ПериодВО));
		//Евросиб(ДИТ), Беляев СЮ, US 115224 / TA 115264, 25-07-2025, начало
		КонтрагентРезидент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НДок.Контрагент, "СтранаРегистрации") = Справочники.СтраныМира.Россия;
		НДок.ДатаДокумента = ?(КонтрагентРезидент, Началомесяца(НДок.ПериодВО), КонецМесяца(Ндок.ПериодВО));
		//Евросиб СубботинВ #120144 01.12.2025 Начало // убрал функционал, даты должны быть в рамках ВО 
		//Если РежимКорректировки = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение 
		//		И КонтрагентРезидент
		//		И ЗначениеЗаполнено(ДатаОказанияУслугиСтрокиДоходов) Тогда
		//	НДок.ДатаДокумента = ДатаОказанияУслугиСтрокиДоходов;
		//КонецЕсли;
		//Евросиб СубботинВ #120144 01.12.2025 Конец
		//Евросиб(ДИТ), Беляев СЮ, US 115224 / TA 115264, 25-07-2025, начало
	КонецЕсли;
	Если РежимКорректировки = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
		//НДок.ДатаДокумента = ИсходныйДокумент.ДатаДокумента;
		//НДок.НомерДляПечати = "" + ИсходныйДокумент.Номер + ?(НДок.Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия, "/Р/", "/Н/") + НДок.ПодразделениеОрганизации.ЦифровойИндексОбособленногоПодразделения;
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0395339, 22-04-2025, начало
		//ПервыйБлокЦифр = ИсходныйДокумент.Номер;
		//Если ЭтоВознаграждение Тогда
		//	СоставНомера = СтрРазделить(НДок.НомерДляПечати, "/", Ложь);
		//	Если СоставНомера.Количество()>0 Тогда
		//		ПервыйБлокЦифр = СоставНомера[0];
		//	КонецЕсли;
		//КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, US 115224 / TA 116161 - US 115814 / TA 115824, 08-08-2025, начало
		НДок.УстановитьНовыйНомер();
		ПервыйБлокЦифр = НДок.Номер;
		//Евросиб(ДИТ), Беляев СЮ, US 115224 / TA 116161 - US 115814 / TA 115824, 08-08-2025, конец
		НДок.НомерДляПечати = "" + ПервыйБлокЦифр + ?(НДок.Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия, "/Р/", "/Н/") + НДок.ПодразделениеОрганизации.ЦифровойИндексОбособленногоПодразделения;
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0395339, 22-04-2025, конец
	КонецЕсли;
	//Документы.Сделка.СкорректироватьСуммыРасшифровки(НДок);
	//ДИТ, Беляев СЮ, BUG 59400/TA 59404, 21-10-2022, начало	
	ДоходыСделкиСервер.СкорректироватьСуммыРасшифровки(НДок);
	//ДИТ, Беляев СЮ, BUG 59400/TA 59404, 21-10-2022, конец
	
	
	НДок.Записать(РежимЗаписиДокумента.Запись);
	Результат = НДок.Ссылка;
	Попытка
		НДок.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		//++ДИТ Гаузер А.В. Ticket#0286685 22.09.2022
		ОповеститьПользователяОбОшибкеИЗаписатьВЖурналРегистрации(Результат);
		//--ДИТ Гаузер А.В. Ticket#0286685 22.09.2022
	КонецПопытки;
	
	Если НДок.ВидОперации <> Перечисления.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование Тогда
		ИСФ = Документы.СчетФактураВыданный.СоздатьДокумент();
		ИСФ.Заполнить(НДок.Ссылка);
		ИСФ.ВидСчетаФактуры = ?(НДок.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки, Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию, Перечисления.ВидСчетаФактурыВыставленного.Корректировочный);
		//ИСФ.ДатаДокумента = НДок.ДатаДокумента;  //Евросиб(ДИТ), Беляев СЮ, US 115224 / TA 115264, 25-07-2025, закомментировал (заполняется в ИСФ.Заполнить(НДок.Ссылка))
		Если РежимКорректировки = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Тогда
			ИСФ.Исправление = Истина;
			ИСФ.НомерДляПечати = ИСФ.НомерИсходногоДокумента;
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0395339, 22-04-2025, начало
			Если ЭтоВознаграждение Тогда
				ИСФ.НомерДляПечати = НДок.НомерДляПечати;
				ИСФ.НомерИсходногоДокумента = НДок.НомерДляПечати;
			КонецЕсли;
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0395339, 22-04-2025, конец
			Если НДок.Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия Тогда
				ИСФ.ДатаДокумента = НачалоМесяца(Ндок.ПериодВО);
			Иначе
				ИСФ.ДатаДокумента = КонецМесяца(Ндок.ПериодВО);
			КонецЕсли;
		КонецЕсли;          
		//Евросиб Дубская 25.03.2022 ( Ticket#0256935   
		//Хотят чтобы номер исправления менялся последовательно, какая корректировка по счету - такой номер
		Если ЗначениеЗаполнено(Корректировка) Тогда
			ИСФ.НомерИсправления = МассивКорректируемыхСтрок.Количество();   
			ИСФ.ДатаИсходногоДокумента = НДок.ДатаДокумента;
		КонецЕсли;
		//Евросиб Дубская 25.03.2022 ) 
		
		//++ Зубов 38318 27.09.2021         
		//++ДИТ_Коробов_Task 46790_16.03.22	
		//БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьТЧНДС0ПоОснованию(ИСФ,НДок.РасшифровкаУслугПоТС);
		//--ДИТ_Коробов_Task 46790_16.03.22	
		//-- Зубов 38318 27.09.2021               
		//++ДИТ_Коробов_Task 46790_24.02.22	
		//БухгалтерскийУчетОбщиеПроцедурыСервер.ИСФАктуализацияВыгрузкиДляФНС(Ндок,, ИСФ);
		//БухгалтерскийУчетОбщиеПроцедурыСервер.СкопироватьТЧГТДИзСФ(НДок, ИСФ);   
		//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 112113 Начало 20.06.2025 
		ЕстьНДС0 = ЗначениеЗаполнено(НДок.Товары.Найти(Перечисления.СтавкиНДС.НДС0, "СтавкаНДС")) Или ЗначениеЗаполнено(НДок.Услуги.Найти(Перечисления.СтавкиНДС.НДС0, "СтавкаНДС"));
		Если ЕстьНДС0 Тогда
			БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьТаблицыЧастичногоПодтвержденияНДС0(ИСФ, НДок); 
		Иначе
			БухгалтерскийУчетОбщиеПроцедурыСервер.СкопироватьТЧГТДИзСФ(НДок, ИСФ);
		КонецЕсли;
		//Евросиб(ДИТ) Антонова А.С. US 90779 ТА 112113 Конец 20.06.2025
		//--ДИТ_Коробов_Task 46790_24.02.22
		
		// Евросиб(ДИТ) US 90779 ТА 99010 Сержантова А.С. Начало: 09.01.2025
		// Актуализацию реквизитов выгрузки для ФНС делаем после копирования таблиц ГТД
		БухгалтерскийУчетОбщиеПроцедурыСервер.ИСФАктуализацияВыгрузкиДляФНС(Ндок,, ИСФ);
		// Евросиб(ДИТ) US 90779 ТА 99010 Сержантова А.С. Конец: 09.01.2025
		
		ИСФ.Записать(РежимЗаписиДокумента.Запись);
		Попытка
			ИСФ.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			//++ДИТ Гаузер А.В. Ticket#0286685 22.09.2022
			ОповеститьПользователяОбОшибкеИЗаписатьВЖурналРегистрации(ИСФ.Ссылка);
			//--ДИТ Гаузер А.В. Ticket#0286685 22.09.2022
		КонецПопытки;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

//++ДИТ Гаузер А.В. Ticket#0286685 22.09.2022
Процедура ОповеститьПользователяОбОшибкеИЗаписатьВЖурналРегистрации(Ссылка)
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ " + Ссылка + " не проведен!"  + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	
	ЗаписьЖурналаРегистрации(НСтр("ru = 'Проведение документа'"),
	УровеньЖурналаРегистрации.Ошибка, Ссылка.ПолучитьОбъект().Метаданные(), Ссылка,
	НСтр("ru = 'Во время проведения документа возникла ошибка: '") + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

КонецПроцедуры //--ДИТ Гаузер А.В. Ticket#0286685 22.09.2022

Процедура УдалитьКорректировкуРТУ(Ссылка) Экспорт
    //++ДИТ_Коробов_Task 46790_24.02.22
	БухгалтерскийУчетОбщиеПроцедурыСервер.ИСФАктуализацияВыгрузкиДляФНС(Ссылка, "УдалитьИСФ");
	//--ДИТ_Коробов_Task 46790_24.02.22
	КРТУО = Ссылка.ПолучитьОбъект();
	КРТУО.ПометкаУдаления = Истина;
	КРТУО.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	
КонецПроцедуры

Функция РольБухгалтераДоступна() Экспорт
	
	Возврат РольДоступна("dc_РазрешитьНаправлятьНаКорректировкуИсправление");
	
КонецФункции

Функция РольПолныеПраваДоступна() Экспорт
	
	Возврат РольДоступна("ПолныеПрава");
	
КонецФункции

Функция ПолучитьУсловияВознагражденияОтчета(Отчет) Экспорт
	
	Результат = Новый Структура("СпособРасчетаКомиссионногоВознаграждения, ПроцентКомиссионногоВознаграждения, СтавкаНДСВознаграждения, СуммаВознагражденияВключаетНДС, УслугаПоВознаграждению, ОписаниеУслуги");
	
	Если ЗначениеЗаполнено(Отчет) Тогда
		ЗаполнитьЗначенияСвойств(Результат, Отчет);
		Результат.ОписаниеУслуги = Отчет.УслугаПоВознаграждению.НаименованиеПолное;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьНовыеДанныеПоступления(ПТУ, ИдентификаторСтрокиРасходовВСделке) Экспорт
	
	//Результат = Новый Структура("Себестоимость, Вознаграждение, Ставка, Количество, СебестоимостьИтого, ВознаграждениеИтого, СтавкаИтого, СтавкаНДС, СуммаНДС, НДСВключенВСтоимость, СуммаИтого, Поставщик");
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 04-08-2025, начало
	Результат = Новый Структура("Себестоимость, Вознаграждение, Ставка, Количество, СебестоимостьИтого, ВознаграждениеИтого, СтавкаИтого, СтавкаНДС, СуммаНДС, НДСВключенВСтоимость, СуммаИтого, Поставщик, ЕстьДанныеКоррПТУ");
	Результат.ЕстьДанныеКоррПТУ = Ложь;
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 04-08-2025, конец
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КорректировкаПоступленияУслуги.Количество КАК Количество,
	               |	КорректировкаПоступленияУслуги.Цена КАК Цена,
	               |	КорректировкаПоступленияУслуги.Сумма КАК Сумма,
	               |	КорректировкаПоступленияУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	КорректировкаПоступленияУслуги.СуммаНДС КАК СуммаНДС,
	               |	КорректировкаПоступленияУслуги.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	               |	КорректировкаПоступленияУслуги.Ссылка.Контрагент КАК Контрагент
	               |ИЗ
	               |	Документ.КорректировкаПоступления.Услуги КАК КорректировкаПоступленияУслуги
	               |ГДЕ
	               |	КорректировкаПоступленияУслуги.Ссылка.Проведен
	               |	И КорректировкаПоступленияУслуги.Ссылка.ДокументПоступления = &ДокументПоступления
	               |	И КорректировкаПоступленияУслуги.ГУИДПТУ В
	               |			(ВЫБРАТЬ
	               |				АкцептУслуги.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления
	               |			ИЗ
	               |				Документ.Акцепт.Услуги КАК АкцептУслуги
	               |			ГДЕ
	               |				АкцептУслуги.Ссылка.Поступление = &ДокументПоступления
	               |				И АкцептУслуги.ИдентификаторСтрокиРасходовВСделке = &ИдентификаторСтрокиРасходовВСделке)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КорректировкаПоступленияУслуги.Ссылка.Дата УБЫВ";
	Запрос.УстановитьПараметр("ДокументПоступления", ПТУ);
	Запрос.УстановитьПараметр("ИдентификаторСтрокиРасходовВСделке", ИдентификаторСтрокиРасходовВСделке);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат.Себестоимость = Ответ.Цена;
		Результат.Вознаграждение = 0;
		Результат.Ставка = Ответ.Цена;
		Результат.Количество = Ответ.Количество;
		Результат.СебестоимостьИтого = Ответ.Сумма;
		Результат.ВознаграждениеИтого = 0;
		Результат.СтавкаИтого = Ответ.Сумма;
		Результат.СтавкаНДС = Ответ.СтавкаНДС;
		Результат.СуммаНДС = Ответ.СуммаНДС;
		Результат.НДСВключенВСтоимость = Ответ.СуммаВключаетНДС;
		Результат.СуммаИтого = Ответ.Сумма;
		Результат.Поставщик = Ответ.Контрагент;
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 04-08-2025, начало
		Результат.ЕстьДанныеКоррПТУ = Истина;
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 04-08-2025, конец
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПредыдущееВознаграждение(ОтчетАгента) Экспорт
	
	//Результат = Новый Структура("Сумма, СтавкаНДС, СуммаНДС");
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0373648, 31-10-2024, начало
	Результат = Новый Структура("Сумма, СтавкаНДС, СуммаНДС", 0, Неопределено, 0);
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0373648, 31-10-2024, конец
	
	СчФ = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(ОтчетАгента, "СчетФактураВыданный"); 
	
	Если ЗначениеЗаполнено(СчФ) Тогда
		// Евросиб US 125402 TA 125421 Рыбьяков К.А. 01.12.2025 ((
		//Результат.Сумма = ?(ОтчетАгента.СуммаВознагражденияВключаетНДС, СчФ.СуммаДокумента - СчФ.СуммаНДСДокумента, СчФ.СуммаДокумента);
		Результат.Сумма = ?(ОтчетАгента.СуммаВознагражденияВключаетНДС, СчФ.СуммаДокумента, СчФ.СуммаДокумента - СчФ.СуммаНДСДокумента);
		// Евросиб Рыбьяков К.А. 01.12.2025 ))
		Результат.СуммаНДС = СчФ.СуммаНДСДокумента;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьАннулированиеРТУИзСписка(ДокументЪ) Экспорт
	
	// Проверим, что на указанный документ нет другого аннулирования
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КорректировкаРеализации.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	               |ГДЕ
	               |	КорректировкаРеализации.ПометкаУдаления = ЛОЖЬ
	               |	И КорректировкаРеализации.ДокументРеализации = &ДокументРеализации
	               |	И КорректировкаРеализации.ЭтоИзменениеВознаграждения = ЛОЖЬ";
	Запрос.УстановитьПараметр("ДокументРеализации", ДокументЪ);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Сообщить("На указанный документ уже введено аннулирование основной / возмещаемой части " + Ответ.Ссылка);
		Возврат неопределено;
	КонецЕсли;
	
	//Евросиб Каблов 09.04.2025 ( #105407
	//ПериодБлокировки8 = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(ДокументЪ.Организация);
	ПериодБлокировки8 = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(ДокументЪ.Организация);
	//Евросиб Каблов 09.04.2025 )
	
	МассивКорректируемыхСтрок = Новый массив;
	
	ИмяТаблицыДанных = "РеализацияТоваровУслуг.Услуги";
	Если ТипЗнч(ДокументЪ) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		ИмяТаблицыДанных = "ОтчетКомитентуОПродажах.Товары";
	ИначеЕсли ТипЗнч(ДокументЪ) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		ИмяТаблицыДанных = "КорректировкаРеализации.Услуги";
	КонецЕсли;
	
	
	//ДИТ Шевченко А.В. TASK 53499 04.07.2022 -Добавил в запрос поле "Всего" 
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслугУслуги.Номенклатура КАК Номенклатура,
	               |	РеализацияТоваровУслугУслуги.Содержание КАК Содержание,
	               |	РеализацияТоваровУслугУслуги.Количество КАК Количество,
	               |	РеализацияТоваровУслугУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	РеализацияТоваровУслугУслуги.Цена КАК Цена,
	               |	РеализацияТоваровУслугУслуги.Сумма КАК Сумма,
				   |	ВЫБОР
		           |		КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
		           |			ТОГДА РеализацияТоваровУслугУслуги.Сумма
		           |		ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма + РеализацияТоваровУслугУслуги.СуммаНДС
		           |	КОНЕЦ КАК Всего,
	               |	РеализацияТоваровУслугУслуги.СуммаНДС КАК СуммаНДС,
	               |	РеализацияТоваровУслугУслуги.СтрокаДоходовСделки КАК СтрокаДоходовСделки
	               |ИЗ
	               |	Документ."+ИмяТаблицыДанных+" КАК РеализацияТоваровУслугУслуги
	               |ГДЕ
	               |	РеализацияТоваровУслугУслуги.Ссылка = &Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка", ДокументЪ);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		//НовСтрКорр = Новый Структура("ПунктОтправления,ПунктНазначения,ЕдиницаИзмерения,КлючСтроки,СтрокаДоходовСделкиДоИзменения,Номенклатура,Содержание,Количество,Цена,Сумма,СтавкаНДС,СуммаНДС,СодержаниеДоИзменения,КоличествоДоИзменения,ЦенаДоИзменения,СуммаДоИзменения,СуммаНДСДоИзменения,СтавкаНДСДоИзменения,КоличествоДоКорректировки,ЦенаДоКорректировки,СуммаДоКорректировки,СуммаНДСДоКорректировки,СписокТС,СписокТЕ,СписокТД,СтрокаДоходовСделки,ЕстьВДокументеРеализации,ВсегоДоКорректировки,ВсегоДоИзменения,Всего,ПериодВО,СтавкаНДСДоКорректировки");
		//Евросиб(ДИТ), Беляев СЮ, US 115224 / TA 115264, 25-07-2025, начало
		НовСтрКорр = Новый Структура("ПунктОтправления,ПунктНазначения,ЕдиницаИзмерения,КлючСтроки,СтрокаДоходовСделкиДоИзменения,Номенклатура,Содержание,Количество,Цена,Сумма,СтавкаНДС,СуммаНДС,СодержаниеДоИзменения,КоличествоДоИзменения,ЦенаДоИзменения,СуммаДоИзменения,СуммаНДСДоИзменения,СтавкаНДСДоИзменения,КоличествоДоКорректировки,ЦенаДоКорректировки,СуммаДоКорректировки,СуммаНДСДоКорректировки,СписокТС,СписокТЕ,СписокТД,СтрокаДоходовСделки,ЕстьВДокументеРеализации,ВсегоДоКорректировки,ВсегоДоИзменения,Всего,ПериодВО,СтавкаНДСДоКорректировки,ДатаОказанияУслуги");
		//Евросиб(ДИТ), Беляев СЮ, US 115224 / TA 115264, 25-07-2025, конец
		ДанныеПервичногоДокумента = КорректировкиРТУСервер.ПолучитьДанныеПервичногоДокумента(ДокументЪ, Ответ.СтрокаДоходовСделки);
		ЗаполнитьЗначенияСвойств(НовСтрКорр, ДанныеПервичногоДокумента);
		
		НовСтрКорр.Номенклатура = Ответ.Номенклатура;
		НовСтрКорр.ПериодВО = ПериодБлокировки8;
		НовСтрКорр.Содержание = Ответ.Содержание;
		НовСтрКорр.КоличествоДоКорректировки = Ответ.Количество;
		НовСтрКорр.ЦенаДоКорректировки = Ответ.Цена;
		НовСтрКорр.СуммаДоКорректировки = Ответ.Сумма;
		НовСтрКорр.СуммаНДСДоКорректировки = Ответ.СуммаНДС;
		//ДИТ Шевченко А.В. TASK 53499 04.07.2022 - Начало
		НовСтрКорр.ВсегоДоКорректировки = Ответ.Всего; //Ответ.Сумма;
		//ДИТ Шевченко А.В. TASK 53499 04.07.2022 - Конец
		//ДИТ Шевченко А.В. TASK 56137 04.07.2022 - Начало
		НовСтрКорр.СтавкаНДСДоКорректировки = Ответ.СтавкаНДС;
		//ДИТ Шевченко А.В. TASK 56137 04.07.2022 - Конец
		НовСтрКорр.ЕстьВДокументеРеализации = Истина;
		НовСтрКорр.СтрокаДоходовСделкиДоИзменения = Ответ.СтрокаДоходовСделки;
		МассивКорректируемыхСтрок.Добавить(НовСтрКорр);
		
	КонецЦикла;

	МасУчЕд = Неопределено;
	Рез = КорректировкиРТУСервер.СоздатьКоррРТУПоПараметрам(ДокументЪ, МассивКорректируемыхСтрок, МасУчЕд, ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование"));

	Возврат Рез;
	
КонецФункции

Функция СоздатьАннулированиеВознагражденияИзСписка(ДокументЪ) Экспорт
	
	// Проверим, что на указанный документ нет другого аннулирования
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КорректировкаРеализации.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	               |ГДЕ
	               |	КорректировкаРеализации.ПометкаУдаления = ЛОЖЬ
	               |	И КорректировкаРеализации.ДокументРеализации = &ДокументРеализации
	               |	И КорректировкаРеализации.ЭтоИзменениеВознаграждения = ИСТИНА";
	Запрос.УстановитьПараметр("ДокументРеализации", ДокументЪ);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Сообщить("На указанный документ уже введено аннулирование вознаграждения " + Ответ.Ссылка);
		Возврат неопределено;
	КонецЕсли;
	
	//Евросиб Каблов 09.04.2025 ( #105407
	//ПериодБлокировки8 = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(ДокументЪ.Организация);
	ПериодБлокировки8 = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(ДокументЪ.Организация);
	//Евросиб Каблов 09.04.2025 )
	
	ПредыдущееВознаграждение = Новый Структура("Сумма, СтавкаНДС, СуммаНДС", 0, неопределено, 0);
	Если ТипЗнч(ДокументЪ) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		ПредыдущееВознаграждение = КорректировкиРТУСервер.ПолучитьПредыдущееВознаграждение(ДокументЪ);
	КонецЕсли;
	
	Если ПредыдущееВознаграждение.Сумма = 0 Тогда
		
		Сообщить("Не найдено предыдущее вознаграждение по отчету комитенту. Аннулировать вознаграждение невозможно.");
		Возврат неопределено;
		
	КонецЕсли;
	
	УсловияВознагражденияОтчета = КорректировкиРТУСервер.ПолучитьУсловияВознагражденияОтчета(ДокументЪ);
	
	Если НЕ ЗначениеЗаполнено(УсловияВознагражденияОтчета.СпособРасчетаКомиссионногоВознаграждения) Тогда
		Сообщить("Не удалось получить настройки Отчета агента. Обратитесь в техподдержку.");
		Возврат неопределено;
	КонецЕсли;
	
	МассивКорректируемыхСтрок = Новый массив;
	
	//НовСтрКорр = Новый Структура("НДСВклВСтоимость,СтрокаДоходовСделкиДоИзменения,Номенклатура,Содержание,Количество,Цена,Сумма,СтавкаНДС,СуммаНДС,СодержаниеДоИзменения,КоличествоДоИзменения,ЦенаДоИзменения,СуммаДоИзменения,СуммаНДСДоИзменения,СтавкаНДСДоИзменения,КоличествоДоКорректировки,ЦенаДоКорректировки,СуммаДоКорректировки,СуммаНДСДоКорректировки,СписокТС,СписокТЕ,СписокТД,СтрокаДоходовСделки,ЕстьВДокументеРеализации,ВсегоДоКорректировки,ВсегоДоИзменения,Всего,ПериодВО");
	//Евросиб(ДИТ), Беляев СЮ, US 115224 / TA 115264, 25-07-2025, начало
	НовСтрКорр = Новый Структура("НДСВклВСтоимость,СтрокаДоходовСделкиДоИзменения,Номенклатура,Содержание,Количество,Цена,Сумма,СтавкаНДС,СуммаНДС,СодержаниеДоИзменения,КоличествоДоИзменения,ЦенаДоИзменения,СуммаДоИзменения,СуммаНДСДоИзменения,СтавкаНДСДоИзменения,КоличествоДоКорректировки,ЦенаДоКорректировки,СуммаДоКорректировки,СуммаНДСДоКорректировки,СписокТС,СписокТЕ,СписокТД,СтрокаДоходовСделки,ЕстьВДокументеРеализации,ВсегоДоКорректировки,ВсегоДоИзменения,Всего,ПериодВО,ДатаОказанияУслуги");
	//Евросиб(ДИТ), Беляев СЮ, US 115224 / TA 115264, 25-07-2025, конец
	НовСтрКорр.Номенклатура = УсловияВознагражденияОтчета.УслугаПоВознаграждению;
	
	НовСтрКорр.ПериодВО = ПериодБлокировки8;
	
	НовСтрКорр.Содержание = УсловияВознагражденияОтчета.ОписаниеУслуги;
	НовСтрКорр.Количество = 0;
	НовСтрКорр.Цена = 0;
	НовСтрКорр.Сумма = НовСтрКорр.Цена;
	НовСтрКорр.СтавкаНДС = УсловияВознагражденияОтчета.СтавкаНДСВознаграждения;
	НовСтрКорр.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(НовСтрКорр.Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(НовСтрКорр.СтавкаНДС) , Истина, УсловияВознагражденияОтчета.СуммаВознагражденияВключаетНДС);
	НовСтрКорр.Всего = ?(УсловияВознагражденияОтчета.СуммаВознагражденияВключаетНДС, НовСтрКорр.Сумма, НовСтрКорр.Сумма+НовСтрКорр.СуммаНДС);
	
	НовСтрКорр.ЕстьВДокументеРеализации = Истина;
	НовСтрКорр.НДСВклВСтоимость = ДокументЪ.СуммаВознагражденияВключаетНДС;
		
	НовСтрКорр.КоличествоДоИзменения = 1; //Стр.Количество;
	НовСтрКорр.ЦенаДоИзменения = ПредыдущееВознаграждение.Сумма; //Стр.Ставка;
	НовСтрКорр.СуммаДоИзменения = ПредыдущееВознаграждение.Сумма; //Стр.СуммаИтого;
	НовСтрКорр.СуммаНДСДоИзменения = ПредыдущееВознаграждение.СуммаНДС; //Стр.СтавкаНДС;
	НовСтрКорр.ВсегоДоИзменения = ПредыдущееВознаграждение.Сумма + ?(ДокументЪ.СуммаВознагражденияВключаетНДС, 0, ПредыдущееВознаграждение.СуммаНДС); //Стр.СуммаИтого;
	НовСтрКорр.СтавкаНДСДоИзменения = УсловияВознагражденияОтчета.СтавкаНДСВознаграждения;
	
	НовСтрКорр.КоличествоДоКорректировки = 1; //Стр.Количество;
	НовСтрКорр.ЦенаДоКорректировки = ПредыдущееВознаграждение.Сумма; //Стр.Ставка;
	НовСтрКорр.СуммаДоКорректировки = ПредыдущееВознаграждение.Сумма; //Стр.СуммаИтого;
	НовСтрКорр.СуммаНДСДоКорректировки = ПредыдущееВознаграждение.СуммаНДС; //Стр.СтавкаНДС;
	НовСтрКорр.ВсегоДоКорректировки = ПредыдущееВознаграждение.Сумма; //Стр.СуммаИтого;
	
	//НовСтрКорр.Содержание = НовСтрКорр.СодержаниеДоИзменения;
	
	МассивКорректируемыхСтрок.Добавить(НовСтрКорр);
	
	МасУчЕд = Неопределено;
	Рез = КорректировкиРТУСервер.СоздатьКоррРТУПоПараметрам(ДокументЪ, МассивКорректируемыхСтрок, МасУчЕд, ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование"), Истина);

	Возврат Рез;
	
КонецФункции

Функция ПолучитьКорректировкуПоОснованию(ДокументЪ) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДокументЪ) тогда Возврат Новый Массив; КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КорректировкаРеализации.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	               |ГДЕ
	               |	КорректировкаРеализации.ПометкаУдаления = ЛОЖЬ
	               |	И КорректировкаРеализации.ИсходныйДокументРеализации = &ДокументЪ";
	Запрос.УстановитьПараметр("ДокументЪ", ДокументЪ);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ПолучитьТЗУчЕдиниц(Мас)

	ТЗ = Новый ТаблицаЗначений;                            //Тип()
	ТЗ.Колонки.Добавить("Контейнер", Новый ОписаниеТипов("СправочникСсылка.ТЕ"));
	ТЗ.Колонки.Добавить("КонтейнерСтр", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(50)));
	ТЗ.Колонки.Добавить("Вагон", Новый ОписаниеТипов("СправочникСсылка.ТС"));
	ТЗ.Колонки.Добавить("ВагонСтр", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(50)));
	ТЗ.Колонки.Добавить("Калькуляция", Новый ОписаниеТипов("ДокументСсылка.Калькуляция"));
	ТЗ.Колонки.Добавить("НомерЖДН", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(20)) );
	ТЗ.Колонки.Добавить("ЖДН", Новый ОписаниеТипов("ДокументСсылка.ТранспортныйДокумент") );
	ТЗ.Колонки.Добавить("Коносамент", Новый ОписаниеТипов("ДокументСсылка.ТранспортныйДокумент") );
	ТЗ.Колонки.Добавить("Груз", Новый ОписаниеТипов("СправочникСсылка.Грузы") );
	ТЗ.Колонки.Добавить("СтанцияОтправления", Новый ОписаниеТипов("СправочникСсылка.Локации") );
	ТЗ.Колонки.Добавить("СтанцияНазначения", Новый ОписаниеТипов("СправочникСсылка.Локации") );
	ТЗ.Колонки.Добавить("ГУИД", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(36)) );
	ТЗ.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.Сделка") );
	ТЗ.Колонки.Добавить("ВесГрузаНетто", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,3)) );
	ТЗ.Колонки.Добавить("Заявка", Новый ОписаниеТипов("ДокументСсылка.Заявка") );
	
	Если Мас <> Неопределено Тогда
		
		Для каждого Стр Из Мас Цикл
			
			НовСтр = ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
			НовСтр.КонтейнерСтр = СокрЛП(Строка(Стр.Контейнер));
			НовСтр.ВагонСтр = СокрЛП(Строка(Стр.Вагон));
			
		КонецЦикла;
		
	КонецЕсли; 
	
	ТЗ.Индексы.Добавить("КонтейнерСтр");
	ТЗ.Индексы.Добавить("ВагонСтр");
	ТЗ.Индексы.Добавить("НомерЖДН");
	
	Возврат ТЗ;
	
КонецФункции // ПолучитьТЗУчЕдиниц(Мас)

//Евросиб - АСуслов 17.03.2022 17:22:54 #
//(
Процедура СоздатьСчетПоКорректировке(ДокументКорректировка) Экспорт

	СуммаНДС 			= ДокументКорректировка.Товары.Итог("СуммаНДС") + ДокументКорректировка.Услуги.Итог("СуммаНДС") +ДокументКорректировка.АгентскиеУслуги.Итог("СуммаНДС");
	Сумма 				= ДокументКорректировка.Товары.Итог("Сумма") + ДокументКорректировка.Услуги.Итог("Сумма") + ДокументКорректировка.АгентскиеУслуги.Итог("Сумма")+СуммаНДС;
	СуммаНДСДоИзменения = ДокументКорректировка.Товары.Итог("СуммаНДСДоИзменения") + ДокументКорректировка.Услуги.Итог("СуммаНДСДоИзменения")+ДокументКорректировка.АгентскиеУслуги.Итог("СуммаНДСДоИзменения");
	СуммаДоИзменения 	= ДокументКорректировка.Товары.Итог("СуммаДоИзменения") + ДокументКорректировка.Услуги.Итог("СуммаДоИзменения")+ДокументКорректировка.АгентскиеУслуги.Итог("СуммаДоИзменения")+СуммаНДСДоИзменения;
	СуммаУвеличение 	= Макс(Сумма - СуммаДоИзменения, 0);
	Если СуммаУвеличение > 0 Тогда
		ДокСчет = Документы.СчетНаОплатуПокупателю.СоздатьДокумент();
		ДокСчет.Дата = ДокументКорректировка.Дата;
		ДокСчет.Заполнить(ДокументКорректировка);   
		НачатьТранзакцию();
		Попытка
			ДокСчет.Записать(РежимЗаписиДокумента.Проведение);
			обДокументКорректировка = ДокументКорректировка.ПолучитьОбъект();
			//обДокументКорректировка.СчетНаОплатуПокупателю = ДокСчет.Ссылка;
			//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
			обДокументКорректировка.УдалитьСчетНаОплатуПокупателю = ДокСчет.Ссылка;
			//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
			//Евросиб Шевченко А.В. US 112687 TA 123181 25.11.2025
			Для Каждого СтрокаТ Из ДокСчет.Товары Цикл
				Если ЗначениеЗаполнено(СтрокаТ.Сумма) Тогда
					НовСтрока = обДокументКорректировка.СчетаНаОплатуПокупателям.Добавить();			
					НовСтрока.СчетПокупателю = ДокСчет.Ссылка;
					НовСтрока.Номенклатура = СтрокаТ.Номенклатура;
					//Для Каждого СтрокаОс Из ДокСчет.ДокументыОснования Цикл
					//	НовСтрока.Сделка = СтрокаОс.Сделка;                               
					//КонецЦикла;
					НовСтрока.Сумма = СтрокаТ.Сумма;
				КонецЕсли;
			КонецЦикла;
			//Евросиб Шевченко А.В. US 112687 TA 123181 25.11.2025
			//Евросиб Каблов 26.08.2025 ( #111011
			обДокументКорректировка.СчетаНаОплатуПокупателям.Свернуть("СчетПокупателю,Номенклатура,Контейнер", "Сумма,Количество");
			Документы.РеализацияТоваровУслуг.ЗаполнитьВидыДоходовПоСчетам(обДокументКорректировка.СчетаНаОплатуПокупателям);
			//Евросиб Каблов 26.08.2025 ) #111011
			обДокументКорректировка.Записать(РежимЗаписиДокумента.Проведение);
			ЗафиксироватьТранзакцию();
		Исключение   
			ОО = ОписаниеОшибки();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОО);
			ОтменитьТранзакцию();
		КонецПопытки;
	КонецЕсли;
		
КонецПроцедуры
//)
//Евросиб - АСуслов 17.03.2022 17:22:55 #

//Евросиб - АСуслов 15.08.2022 14:52:27 #55906
//(
Процедура ПерезаполнитьОтгрузочнуюИнформацию(нДок) Экспорт
	
	МассивСделок = нДок.ИсходныйДокументРеализации.Услуги.ВыгрузитьКолонку("Сделка");
	// Шейко О.Е. (16.03.2021) Добавление расшифровки на основании новых данных
	РасшДоИзменений = нДок.РасшифровкаУслугПоТС.Выгрузить();
	РасшДоИзменений.Очистить();
	//ДИТ, Беляев СЮ, Ticket#0318326, 31-07-2023, начало
	ДокументНаОснованииКоррРТУ = ТипЗнч(нДок.ДокументРеализации) = Тип("ДокументСсылка.КорректировкаРеализации");
	//ДИТ, Беляев СЮ, Ticket#0318326, 31-07-2023, конец
	Для каждого СтрокаРасшифровка Из нДок.ДокументРеализации.РасшифровкаУслугПоТС Цикл
		НовСтр = РасшДоИзменений.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, СтрокаРасшифровка);
		НовСтр.ЦенаДоИзменения 					= СтрокаРасшифровка.Цена;
		НовСтр.СуммаДоИзменения 				= СтрокаРасшифровка.Сумма;
		//НовСтр.СтавкаНДСДоИзменения 			= СтрокаРасшифровка.СтавкаНДС;
		//ДИТ, Беляев СЮ, Ticket#0318326, 31-07-2023, начало
		Если НЕ ДокументНаОснованииКоррРТУ Тогда //в КоррРТУ нет поля СтавкаНДС
			НовСтр.СтавкаНДСДоИзменения 		= СтрокаРасшифровка.СтавкаНДС;
		КонецЕсли;
		//ДИТ, Беляев СЮ, Ticket#0318326, 31-07-2023, конец
		НовСтр.СуммаНДСДоИзменения 				= СтрокаРасшифровка.СуммаНДС;
		НовСтр.СтрокаДоходовСделкиДоИзменения	= СтрокаРасшифровка.СтрокаДоходовСделки;
	КонецЦикла;
	РасшДоИзменений.Колонки.Добавить("КонтейнерСтр", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
	//ДИТ, Беляев СЮ, Ticket#0294649, 16-12-2022, начало
	РасшДоИзменений.Колонки.Добавить("ВагонСтр", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(Метаданные.Справочники.ТС.ДлинаНаименования)));
	//ДИТ, Беляев СЮ, Ticket#0294649, 16-12-2022, конец
	
	Для каждого Стр Из РасшДоИзменений Цикл
		Стр.КонтейнерСтр = Строка(Стр.Контейнер);
		//ДИТ, Беляев СЮ, Ticket#0294649, 16-12-2022, начало
		Стр.ВагонСтр = Строка(Стр.Вагон);
		//ДИТ, Беляев СЮ, Ticket#0294649, 16-12-2022, конец
	КонецЦикла; 
	РасшДоИзменений.Индексы.Добавить("КонтейнерСтр");
	//ДИТ, Беляев СЮ, Ticket#0294649, 16-12-2022, начало
	РасшДоИзменений.Индексы.Добавить("ВагонСтр");
	//ДИТ, Беляев СЮ, Ticket#0294649, 16-12-2022, конец
	
	ТЗСтрДохСделки = РасшДоИзменений.Скопировать(, "СтрокаДоходовСделки");
	ТЗСтрДохСделки.Свернуть("СтрокаДоходовСделки");
	ТЗСтрДохСделки.Колонки.Добавить("Использован");
	
	//ТЗУчЕдиниц = ПолучитьТЗУчЕдиниц(МасУчЕдиниц);
	ТЗУчЕдиниц = ПолучитьТЗУчетныхЕдиницПоСделкам(МассивСделок);
	
	РасшПослеИзменений = Ндок.РасшифровкаУслугПоТС.Выгрузить();
	РасшПослеИзменений.Очистить();
	
	//Для каждого Стр из МассивКорректируемыхСтрок Цикл
	Для каждого Стр из нДок.Услуги Цикл
		
	  //Ндок.ПериодВО = Стр.ПериодВО; 
	  //  
	  //  Если ТипЗнч(ИсходныйДокумент) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
	  //  	НСтр = НДок.Услуги.Добавить();
	  //  Иначе
	  //  	НСтр = Ндок.Услуги.Найти(Стр.СтрокаДоходовСделкиДоИзменения, "СтрокаДоходовСделки");
	  //  КонецЕсли;         
	  //  
	  //  //Евросиб Дубская 01.03.2022 ( Ticket#0256935  
	  //  //ЗаполнитьЗначенияСвойств(НСтр, Стр);
	  //  Если НСтр = Неопределено Тогда
	  //  	Продолжить;
	  //  КонецЕсли;
	  //  
	  //  Если ЗначениеЗаполнено(Корректировка) Тогда
	  //  	ЗаполнитьЗначенияСвойств(НСтр, Стр, "Всего, Количество, СписокТД, СписокТЕ, 
	  //  	|СписокТС, СтавкаНДС, СтрокаДоходовСделки, СтрокаДоходовСделкиДоИзменения, Сумма, СуммаНДС, Цена"); 
	  //  Иначе
	  //  	ЗаполнитьЗначенияСвойств(НСтр, Стр);
	  //  КонецЕсли;		
	  //  //Евросиб Дубская 01.03.2022 )
	  //  
	  //  Если Стр.Свойство("НДСВклВСтоимость") Тогда
	  //  	НДок.СуммаВключаетНДС = Стр.НДСВклВСтоимость;
	  //  КонецЕсли;
		
		МассивТС = СтрРазделить(СтрЗаменить(Стр.СписокТС, " ", ""), ";", Ложь);
		МассивТЕ = СтрРазделить(СтрЗаменить(Стр.СписокТЕ, " ", ""), ";", Ложь);
		МассивТД = СтрРазделить(СтрЗаменить(Стр.СписокТД, " ", ""), ";", Ложь);
		
		// Проверим наличие уч единиц, если больше - удалим, меньше - добавим
		Если МассивТЕ.Количество() > 0 Тогда
			
			Для каждого СтрТЕ Из МассивТЕ Цикл
				
				// Ищем уч ед ранее, если есть заполняем ей (СОХРАНЯЕМ СТАРЫЕ ДАННЫЕ)
				ИскСтрДоИзм = РасшДоИзменений.НайтиСтроки(Новый Структура("КонтейнерСтр, СтрокаДоходовСделкиДоИзменения", СтрТЕ, Стр.СтрокаДоходовСделкиДоИзменения));
				
				Если ИскСтрДоИзм.Количество() = 0 Тогда
					ИскСтрДоИзм = РасшДоИзменений.НайтиСтроки(Новый Структура("КонтейнерСтр, СтрокаДоходовСделки", СтрТЕ, Стр.СтрокаДоходовСделкиДоИзменения)) ;
				КонецЕсли;
				
				Если ИскСтрДоИзм.Количество() > 0 Тогда
					
					НовСтр_РасшПослеИзменений = РасшПослеИзменений.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр_РасшПослеИзменений, ИскСтрДоИзм[0]);
					
				Иначе
					// Если нет ищем в уч ед сделки и ДОБАВЛЯЕМ НОВУЮ ИНФОРМАЦИЮ:
					ИскСтрМасУчЕд = ТЗУчЕдиниц.НайтиСтроки(Новый Структура("КонтейнерСтр", СтрТЕ) );
					//ДИТ Шевченко А.В. TASK 53500 29.06.2022 -Начало
					Если ИскСтрМасУчЕд.Количество() = 0 Тогда
						Продолжить;
					КонецЕсли;
					//ДИТ Шевченко А.В. TASK 53500 29.06.2022 -Конец
					НовСтр_РасшПослеИзменений = РасшПослеИзменений.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр_РасшПослеИзменений, ИскСтрМасУчЕд[0]);
					НовСтр_РасшПослеИзменений.ДатаОтправки = ИскСтрМасУчЕд[0].ЖДН.НакладнаяЭТРАН.ДатаИВремяОтправленияГруза;
					НовСтр_РасшПослеИзменений.ВидПеревозки = ИскСтрМасУчЕд[0].Заявка.ВидПеревозки;
					НовСтр_РасшПослеИзменений.СтрокаДоходовСделки = Стр.СтрокаДоходовСделкиДоИзменения;
					
					ЖДН = ИскСтрМасУчЕд[0].ЖДН.НакладнаяЭТРАН;
					
					Для каждого Стр_КТ_ЖДН Из ЖДН.Контейнеры Цикл
						
						Если Стр_КТ_ЖДН.НомерКонтейнера = ИскСтрМасУчЕд[0].КонтейнерСтр Тогда
							НовСтр_РасшПослеИзменений.ФактическийВес = Стр_КТ_ЖДН.МассыВКгНетто;
							НовСтр_РасшПослеИзменений.РасчетныйВес = Стр_КТ_ЖДН.МассыВКгНетто;
							Прервать;
						КонецЕсли;
						
					КонецЦикла; 
					
					// Сумм, цены, количества нету. Не было их до изменений, строка новая
					
				КонецЕсли;
				
				//Евросиб - АСуслов 15.08.2022 17:43:30 #55906
				//(
				КоличествоДляСуммы = ?(Стр.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.вагон, МассивТС.Количество(), МассивТЕ.Количество());
				НовСтр_РасшПослеИзменений.Цена = Стр.Цена;
				НовСтр_РасшПослеИзменений.СуммаНДС = Стр.СуммаНДС / ?(Стр.Количество = 0, 1, КоличествоДляСуммы);
				НовСтр_РасшПослеИзменений.Сумма = Стр.Сумма / ?(КоличествоДляСуммы = 0, 1, КоличествоДляСуммы);
				//)
				//Евросиб - АСуслов 15.08.2022 17:43:39 #55906
				
			КонецЦикла;
		
		КонецЕсли; 
		Если МассивТЕ.Количество() = 0 И МассивТС.Количество() > 0 Тогда
			
			Для каждого СтрТС Из МассивТС Цикл
				
				// Ищем уч ед ранее, если есть заполняем ей (СОХРАНЯЕМ СТАРЫЕ ДАННЫЕ)
				//++ Зубов 0245244 04.10.2021 Убираем крест. Нет такой колонки "ВагонСтр", есть колонка "Вагон".
				//ИскСтрДоИзм = РасшДоИзменений.НайтиСтроки(Новый Структура("ВагонСтр, СтрокаДоходовСделки", СтрТС, Стр.СтрокаДоходовСделкиДоИзменений)) ;
				//ИскСтрДоИзм = РасшДоИзменений.НайтиСтроки(Новый Структура("Вагон, СтрокаДоходовСделки", СтрТС, Стр.СтрокаДоходовСделкиДоИзменения)) ;
				//-- Зубов 0245244 04.10.2021
				
				//ДИТ, Беляев СЮ, Ticket#0294649, 16-12-2022, начало  (добавлено поле "ВагонСтр", в поле "Вагон" ссылочный тип)
				ИскСтрДоИзм = РасшДоИзменений.НайтиСтроки(Новый Структура("ВагонСтр, СтрокаДоходовСделки", СтрТС, Стр.СтрокаДоходовСделкиДоИзменения));
				//ДИТ, Беляев СЮ, Ticket#0294649, 16-12-2022, конец
				
				Если ИскСтрДоИзм.Количество() > 0 Тогда
					
					Для каждого Стр_ИскСтрДоИзм Из ИскСтрДоИзм Цикл
					
						НовСтр_РасшПослеИзменений = РасшПослеИзменений.Добавить();
						ЗаполнитьЗначенияСвойств(НовСтр_РасшПослеИзменений, Стр_ИскСтрДоИзм);
					
					КонецЦикла; 
					
				Иначе
					// Если нет ищем в уч ед сделки и ДОБАВЛЯЕМ НОВУЮ ИНФОРМАЦИЮ:
					//++ Зубов 0245244 04.10.2021 Убираем крест. Нет такой колонки "ВагонСтр", есть колонка "Вагон".
					//ИскСтрМасУчЕд = ТЗУчЕдиниц.НайтиСтроки(Новый Структура("ВагонСтр", СтрТС) );
					//ИскСтрМасУчЕд = ТЗУчЕдиниц.НайтиСтроки(Новый Структура("Вагон", СтрТС) );
					//-- Зубов 0245244 04.10.2021					
					
					//ДИТ, Беляев СЮ, Ticket#0294649, 16-12-2022, начало  (теперь есть такая колонка "ВагонСтр", а в поле "Вагон" ссылочный тип)
					ИскСтрМасУчЕд = ТЗУчЕдиниц.НайтиСтроки(Новый Структура("ВагонСтр", СтрТС) );
					//ДИТ, Беляев СЮ, Ticket#0294649, 16-12-2022, конец
					
					Для каждого Стр_ИскСтрМасУчЕд Из ИскСтрМасУчЕд Цикл
					
						НовСтр_РасшПослеИзменений = РасшПослеИзменений.Добавить();
						ЗаполнитьЗначенияСвойств(НовСтр_РасшПослеИзменений, Стр_ИскСтрМасУчЕд);
						НовСтр_РасшПослеИзменений.ДатаОтправки = Стр_ИскСтрМасУчЕд.ЖДН.НакладнаяЭТРАН.ДатаИВремяОтправленияГруза;
						НовСтр_РасшПослеИзменений.ВидПеревозки = Стр_ИскСтрМасУчЕд.Заявка.ВидПеревозки;
						НовСтр_РасшПослеИзменений.СтрокаДоходовСделки = Стр.СтрокаДоходовСделкиДоИзменения;
						
						// Веса не заполняем, т.к. нет информации о КТ:
						//ЖДН = Стр_ИскСтрМасУчЕд.ЖДН.НакладнаяЭТРАН;
						//
						//Для каждого Стр_КТ_ЖДН Из ЖДН.Контейнеры Цикл
						//	
						//	Если Стр_КТ_ЖДН.НомерКонтейнера = Стр_ИскСтрМасУчЕд.КонтейнерСтр Тогда
						//		НовСтр_РасшПослеИзменений.ФактическийВес = Стр_КТ_ЖДН.МассыВКгНетто;
						//		НовСтр_РасшПослеИзменений.РасчетныйВес = Стр_КТ_ЖДН.МассыВКгНетто;
						//		Прервать;
						//	КонецЕсли;
						//	
						//КонецЦикла;
						
						// Сумм, цены, количества нету. Не было их до изменений, строка новая
						
					КонецЦикла; 
					
				КонецЕсли; 
				//Евросиб - АСуслов 15.08.2022 17:49:47 #55906
				//(       
				КоличествоДляСуммы = МассивТС.Количество();
				НовСтр_РасшПослеИзменений.Цена = Стр.Цена;
				НовСтр_РасшПослеИзменений.СуммаНДС = Стр.СуммаНДС / ?(Стр.Количество = 0, 1, КоличествоДляСуммы);
				НовСтр_РасшПослеИзменений.Сумма = Стр.Сумма / ?(КоличествоДляСуммы = 0, 1, КоличествоДляСуммы);
				//)
				//Евросиб - АСуслов 15.08.2022 17:49:50 #55906

			КонецЦикла;
		
		КонецЕсли;
		
		// Отметим строку, которую мы обходили
		ИскСтрДохСделки = ТЗСтрДохСделки.Найти(Стр.СтрокаДоходовСделкиДоИзменения);
		Если ИскСтрДохСделки <> неопределено Тогда
			ИскСтрДохСделки.Использован = Истина;
		КонецЕсли;
		
	КонецЦикла;
	// Добавим строки расшифровки, которые не корректировались:
	Для каждого Стр Из ТЗСтрДохСделки Цикл
	
		Если НЕ Стр.Использован = Истина Тогда
		
			ИскСтрДоИзм = РасшДоИзменений.НайтиСтроки(Новый Структура("СтрокаДоходовСделки", Стр.СтрокаДоходовСделки)) ;
			Для каждого Стр_ИскСтрДоИзм Из ИскСтрДоИзм Цикл
				НовСтр_РасшПослеИзменений = РасшПослеИзменений.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр_РасшПослеИзменений, Стр_ИскСтрДоИзм);
			КонецЦикла; 
		КонецЕсли; 
	
	КонецЦикла; 
	
	Ндок.РасшифровкаУслугПоТС.Загрузить(РасшПослеИзменений);
		
КонецПроцедуры                                

Функция ПолучитьТЗУчетныхЕдиницПоСделкам(МассивСделок)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	|	СделкаСвязьУчетныхЕдиниц.Контейнер.Наименование КАК КонтейнерСтр,
	|	СделкаСвязьУчетныхЕдиниц.Вагон КАК Вагон,
	|	СделкаСвязьУчетныхЕдиниц.Вагон.Наименование КАК ВагонСтр,
	|	СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН.НакладнаяЭТРАН.Номер КАК НомерЖДН,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН КАК ЖДН,
	|	СделкаСвязьУчетныхЕдиниц.Коносамент КАК Коносамент,
	|	СделкаСвязьУчетныхЕдиниц.Груз КАК Груз,
	|	СделкаСвязьУчетныхЕдиниц.Ссылка.СтанцияОтправления КАК СтанцияОтправления,
	|	СделкаСвязьУчетныхЕдиниц.Ссылка.СтанцияНазначения КАК СтанцияНазначения,
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	|	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Ссылка,
	|	СделкаСвязьУчетныхЕдиниц.ВесГрузаНетто КАК ВесГрузаНетто,
	|	СделкаСвязьУчетныхЕдиниц.Заявка КАК Заявка
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|ГДЕ
	|	СделкаСвязьУчетныхЕдиниц.Ссылка В(&СписокСделок)"; 
	Запрос.УстановитьПараметр("СписокСделок", МассивСделок);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

//)
//Евросиб - АСуслов 15.08.2022 14:52:30 #55906  

//Евросиб СубботинВ #130097 13.02.2026 Начало
Функция ПолучитьДанныеКурсаВалютыФрахтСтрокиРТУПоГуиду(Документ, ГуидДохода) Экспорт
	
	КурсФрахт = Неопределено;
	СтрокаУслугУчДокумента =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ,"Услуги").Выгрузить().Найти(ГуидДохода, "СтрокаДоходовСделки");
	Если НЕ СтрокаУслугУчДокумента = Неопределено и ЗначениеЗаполнено(СтрокаУслугУчДокумента.КурсВалютыФрахт) Тогда 
		КурсФрахт = СтрокаУслугУчДокумента.КурсВалютыФрахт;
	КонецЕсли;
	Возврат КурсФрахт
	
КонецФункции	
//Евросиб СубботинВ #130097 13.02.2026 Начало
