#Область СтандартныеПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля = Новый Массив;
	Поля.Добавить("НомерДляПечати");
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	Поля.Добавить("ДатаДокумента");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НомерЪ = ?(ЗначениеЗаполнено(Данные.НомерДляПечати), Данные.НомерДляПечати, Данные.Номер);
	ДатаЪ = ?(ЗначениеЗаполнено(Данные.ДатаДокумента), Данные.ДатаДокумента, Данные.Дата);
	
	Представление = "Реализация " + НомерЪ + " от " + Формат(ДатаЪ, "ДФ='dd.MM.yy ЧЧ:мм'");
	
КонецПроцедуры

#КонецОбласти

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АктСдачиПриемки";
	КомандаПечати.Представление = НСтр("ru = 'Акт об оказании услуг'");
	КомандаПечати.Обработчик    = "ДополнительныйМодульКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	//Евросиб Каблов 09.07.2020 ( TASK 23506
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//Евросиб Каблов 09.07.2020 ) 
	//80515 Субботин 19.02.2024 начало
	КомандаПечати.ДополнительныеПараметры.Вставить("НеобходимаПроверкаРолиДляПечати", Истина);
	//80515 Субботин 19.02.2024 Конец
	// Евросиб US 89967 TA 91565 Рыбьяков К.А. 24.10.2024 ((
	КомандаПечати.ДополнительныеПараметры.Вставить("ПроверкаЗапретаПечатиДляСтавкиНДС20", Истина);
	// Евросиб Рыбьяков К.А. 24.10.2024 ))
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "УниверсальныйПередаточныйДокумент";
	КомандаПечати.Представление = НСтр("ru = 'Универсальный передаточный документ'");
	КомандаПечати.Обработчик    = "ДополнительныйМодульКлиент.ВыполнитьКомандуПечатиУПД";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	//Евросиб Каблов 09.07.2020 ( TASK 23506
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//Евросиб Каблов 09.07.2020 )
	//80515 Субботин 19.02.2024 начало
	КомандаПечати.ДополнительныеПараметры.Вставить("НеобходимаПроверкаРолиДляПечати", Истина);
	//80515 Субботин 19.02.2024 Конец
	// Евросиб US 89967 TA 91565 Рыбьяков К.А. 24.10.2024 ((
	КомандаПечати.ДополнительныеПараметры.Вставить("ПроверкаЗапретаПечатиДляСтавкиНДС20", Истина);
	// Евросиб Рыбьяков К.А. 24.10.2024 ))

КонецПроцедуры

#Область ПЕЧАТЬ

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода,Знач СтруктураПодписантов = Неопределено) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктСдачиПриемки") Тогда
		
		ПараметрыПечати.Вставить("ВидДокументаПечати",  "РеализацияТоваровУслуг");
		ПараметрыПечати.Вставить("ИмяПараметровПечати", "ПАРАМЕТРЫ_ПЕЧАТИ_РеализацияТоваровУслуг_Акт");
		ПараметрыПечати.Вставить("ИмяМакетаПечати",     "Документ.РеализацияТоваровУслуг.ПФ_MXL_АктСдачиПриемки");

		СформироватьПечатнуюФормуАкта(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, "АктСдачиПриемки", "Акт сдачи-приемки",
		ОбъектыПечати, ПараметрыВывода,СтруктураПодписантов);
		
	КонецЕсли;                                                                                      	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УниверсальныйПередаточныйДокумент981") Тогда
		
		СформироватьПечатнуюФормуУПД(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм,"УниверсальныйПередаточныйДокумент981", "Универсальный передаточный документ",
		ОбъектыПечати, ПараметрыВывода,СтруктураПодписантов);
		
	КонецЕсли;
	
КонецПроцедуры	

Процедура СформироватьПечатнуюФормуУПД (МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ИмяМакета, СинонимМакета, ОбъектыПечати, ПараметрыВывод,СтруктураПодписантов)
	
	Для каждого ЭлМассива из МассивОбъектов Цикл
		
//Евросиб Литвинов 19.08.2021 ( #35933 #36212
		Если ПечатьКомплектаДокументов.ПолучитьПечатнуюФормуИзДиадок(КоллекцияПечатныхФорм, ЭлМассива, ИмяМакета, СинонимМакета) Тогда
			Продолжить;
		КонецЕсли;
//Евросиб Литвинов 19.08.2021 ) #35933 #36212 

		ТаблицаСведенийСчетФактуры = ПолучитьТаблицуСведенийДляУПД(ЭлМассива);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета, СинонимМакета,
		ПечатьБухгалтерскихДокументов.ПечатьУПД981(ТаблицаСведенийСчетФактуры, ОбъектыПечати,ПараметрыПечати,СтруктураПодписантов),,"ОбщийМакет.ПФ_MXL_УниверсальныйПередаточныйДокумент981");
		
	КонецЦикла;	
	
КонецПроцедуры

Функция ПолучитьТаблицуСведенийДляУПД(Документ)
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаСведений = ПечатьБухгалтерскихДокументов.ПолучитьОписаниеСчетФактуры();
	ТаблицаДокумента = ПечатьБухгалтерскихДокументов.ПолучитьОписаниеТаблицыСчетФактуры();
	
	ТекстЗапроса = ПолучитьТекстЗапросаДляПечатиУПД();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	ЗАпрос.УстановитьПараметр("Документ",Документ);
	// Субботин TASK 72390 18.07.2023  Начало
	ВалютаРегУчета = Константы.ВалютаРегламентированногоУчета.Получить();	
	Запрос.УстановитьПараметр("КодВалютаДляДоговоров_в_УЕ", ВалютаРегУчета.Код);
    Запрос.УстановитьПараметр("НаименованиеВалютаДляДоговоров_в_УЕ", ВалютаРегУчета.Наименование);
	// Субботин TASK 72390 18.07.2023  Конец
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СведенияОДокументе = ТаблицаСведений.Добавить();
		ЗаполнитьЗначенияСвойств(СведенияОДокументе,Выборка);            
		//Евросиб - АСуслов 14.09.2022 11:47:17 #
		//(
		ФакторингСервер.ЗаполнитьПараметрыФакторинга(СведенияОДокументе);
		//)
		//Евросиб - АСуслов 14.09.2022 11:47:18 #
		СведенияОДокументе.ПредставлениеПоставщика = Выборка.Продавец.НаименованиеПолное;
		СведенияОДокументе.АдресПоставщика = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Продавец,
		?(ТипЗнч(Выборка.Продавец)=Тип("СправочникСсылка.Контрагенты"),Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации),Выборка.ДатаДокумента,Истина);
		СведенияОДокументе.ПредставлениеГрузоотправителя = "-";
		СведенияОДокументе.ПредставлениеГрузополучателя  = "-";
		СведенияОДокументе.ПредставлениеПокупателя = Выборка.Контрагент.НаименованиеПолное;
		СведенияОДокументе.ИННПоставщика = Выборка.ИННПоставщика+"/"+Выборка.КПППродавца;
		СведенияОДокументе.ПоДокументу = "К платежно-расчетному документу №"+?(ЗначениеЗаполнено(СведенияОДокументе.НомерПлатежноРасчетногоДокумента),СведенияОДокументе.НомерПлатежноРасчетногоДокумента,"_______")
		+"от"+?(СведенияОДокументе.ДатаПлатежноРасчетногоДокумента<>Дата('00010101'),СведенияОДокументе.ДатаПлатежноРасчетногоДокумента,"_______");
		СведенияОДокументе.АдресПокупателя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Контрагент,Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,Выборка.ДатаДокумента,Истина);
		СведенияОДокументе.ИННПокупателя =Выборка.ИННПокупателя+"/"+Выборка.КПППокупателя;
		СведенияОДокументе.ДоверенностьЗаРуководителя = Выборка.ДоверенностьЗаРуководителя;
		СведенияОДокументе.ДоверенностьЗаГлБухгалтера = Выборка.ДоверенностьЗаГлБухгалтера;
		
		ТекстЗАпроса = ПолучитьТекстЗапросаДляПечатиТаблицыУПД();
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Документ",Документ);
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл
			Строка = ТаблицаДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(Строка,РезультатЗапроса);
			Строка.Всего = ?(РезультатЗапроса.СуммаВключаетНДС,РезультатЗапроса.Сумма, РезультатЗапроса.Сумма + РезультатЗапроса.СуммаНДС);
		КонецЦикла;
		СведенияОДокументе.ТаблицаДокумента = ТаблицаДокумента;
	КонецЦикла;	
	
	Возврат ТаблицаСведений;
КонецФункции

Функция ПолучитьТекстЗапросаДляПечатиУПД()
	ТекстЗапроса = 
	"ВЫБРАТЬ
	//|	РеализацияТоваровУслуг.Номер КАК Номер,
	|	РеализацияТоваровУслуг.НомерДляПечати КАК Номер,				   
	//|	РеализацияТоваровУслуг.Дата КАК ДатаДокумента,
	|	РеализацияТоваровУслуг.ДатаДокумента КАК ДатаДокумента,
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	РеализацияТоваровУслуг.ВалютаДокумента КАК ВалютаДокумента,
	|	РеализацияТоваровУслуг.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	РеализацияТоваровУслуг.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	РеализацияТоваровУслуг.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	РеализацияТоваровУслуг.Руководитель КАК Руководитель,
	|	РеализацияТоваровУслуг.ЗаРуководителяНаОсновании КАК ЗаРуководителяНаОсновании,
	|	РеализацияТоваровУслуг.ЗаГлавногоБухгалтераНаОсновании КАК ЗаГлавногоБухгалтераНаОсновании,
	|	РеализацияТоваровУслуг.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
	|	РеализацияТоваровУслуг.Ссылка КАК Документ,
	|	ЛОЖЬ КАК Исправление,
	|	ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию) КАК ВидСчетаФактуры,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента.Номер КАК НомерДоговора,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента.Дата КАК ДатаДоговора,
	|	РеализацияТоваровУслуг.Контрагент.КПП КАК КПППокупателя,
	|	РеализацияТоваровУслуг.Организация.КПП КАК КПППродавца,
	|	РеализацияТоваровУслуг.Организация.ИНН КАК ИННПоставщика,
	|	РеализацияТоваровУслуг.Контрагент.ИНН КАК ИННПокупателя,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах
	|			ТОГДА &КодВалютаДляДоговоров_в_УЕ
	|		ИНАЧЕ РеализацияТоваровУслуг.ВалютаДокумента.Код
	|	КОНЕЦ КАК ВалютаКод,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах
	|			ТОГДА &НаименованиеВалютаДляДоговоров_в_УЕ
	|		ИНАЧЕ РеализацияТоваровУслуг.ВалютаДокумента.Наименование
	|	КОНЕЦ КАК ВалютаНаименование,
	|	РеализацияТоваровУслуг.Организация КАК Продавец,
	|	РеализацияТоваровУслуг.ДоверенностьЗаРуководителя КАК ДоверенностьЗаРуководителя,
	|	РеализацияТоваровУслуг.ДоверенностьЗаГлБухгалтера КАК ДоверенностьЗаГлБухгалтера,
	//Евросиб Каблов 02.06.2021 ( Ticket#0230677
	|	ЕСТЬNULL(ИсторияФакторинга.ДоговорКомпанииФактор.ДополнительнаяИнформацияФакторинг, """") КАК ДополнительнаяИнформацияФакторинг,
	|	ВЫБОР
	|		КОГДА ИсторияФакторинга.ДоговорКомпанииФактор ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ  КАК Факторинг
	//Евросиб Каблов 02.06.2021 )
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	//Евросиб Каблов 02.06.2021 ( Ticket#0230677
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияФакторинга КАК ИсторияФакторинга
	|		ПО РеализацияТоваровУслуг.ДоговорКонтрагента = ИсторияФакторинга.Договор
	|			И РеализацияТоваровУслуг.ДатаДокумента >= ИсторияФакторинга.НачалоФакторинга
	|			И ИсторияФакторинга.НачалоФакторинга <> ДАТАВРЕМЯ(1, 1, 1)
	|			И (ИсторияФакторинга.ОкончаниеФакторинга = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ РеализацияТоваровУслуг.ДатаДокумента <= ИсторияФакторинга.ОкончаниеФакторинга)
	//Евросиб Каблов 02.06.2021 )
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Документ";	
	Возврат ТекстЗАпроса;
КонецФункции

Функция ПолучитьТекстЗапросаДляПечатиТаблицыУПД()
	ТекстЗапроса = "ВЫБРАТЬ
	               |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |	РеализацияТоваровУслугТовары.Номенклатура.КодТНВЭД КАК НоменклатураКодТНВЭД,
	               |	РеализацияТоваровУслугТовары.Номенклатура.НаименованиеПолное КАК ТоварНаименование,
	               |	РеализацияТоваровУслугТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	РеализацияТоваровУслугТовары.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	               |	РеализацияТоваровУслугТовары.ЕдиницаИзмерения.НаименованиеПолное КАК ЕдиницаИзмеренияНаименование,
	               |	РеализацияТоваровУслугТовары.Количество КАК Количество,
	               |	РеализацияТоваровУслугТовары.Цена КАК Цена,
	               |	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
	               |	РеализацияТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
	               |	РеализацияТоваровУслугТовары.СуммаНДС КАК СуммаНДС,
	               |	ВЫБОР
	               |		КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	               |			ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
	               |		ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
	               |	КОНЕЦ КАК Стоимость,
	               |	РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.Ссылка = &Документ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугУслуги.Номенклатура,
	               |	NULL,
	               |	РеализацияТоваровУслугУслуги.Содержание,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	РеализацияТоваровУслугУслуги.Количество,
	               |	РеализацияТоваровУслугУслуги.Цена,
	               |	ВЫБОР
	               |		КОГДА ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах
	               |			ТОГДА РеализацияТоваровУслугУслуги.СуммаБезНалога
	               |		ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
	               |	КОНЕЦ,
	               |	РеализацияТоваровУслугУслуги.СтавкаНДС,
	               |	ВЫБОР
	               |		КОГДА ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах
	               |			ТОГДА РеализацияТоваровУслугУслуги.СуммаНДСРуб
	               |		ИНАЧЕ РеализацияТоваровУслугУслуги.СуммаНДС
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах
	               |			ТОГДА ВЫБОР
	               |					КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
	               |						ТОГДА РеализацияТоваровУслугУслуги.СуммаБезНалога - РеализацияТоваровУслугУслуги.СуммаНДСРуб
	               |					ИНАЧЕ РеализацияТоваровУслугУслуги.СуммаБезНалога
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
	               |					ТОГДА РеализацияТоваровУслугУслуги.Сумма - РеализацияТоваровУслугУслуги.СуммаНДС
	               |				ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |		ПО РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	               |ГДЕ
	               |	РеализацияТоваровУслугУслуги.Ссылка = &Документ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугАгентскиеУслуги.Номенклатура,
	               |	NULL,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Содержание,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Количество,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Цена,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Сумма,
	               |	РеализацияТоваровУслугАгентскиеУслуги.СтавкаНДС,
	               |	РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС,
	               |	ВЫБОР
	               |		КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС
	               |			ТОГДА РеализацияТоваровУслугАгентскиеУслуги.Сумма - РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС
	               |		ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма
	               |	КОНЕЦ,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	               |ГДЕ
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка = &Документ";
	Возврат ТекстЗАпроса;
КонецФункции

Процедура СформироватьПечатнуюФормуАкта(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ИмяМакета, СинонимМакета, ОбъектыПечати, ПараметрыВывода,СтруктураПодписантов)
	
	// Евросиб Фролов (07.10.2021 Ticket№ 40270
	
	Для Каждого ПечатаемыйДокумент из МассивОбъектов Цикл
	//Евросиб Литвинов ( 24.10.21 #40869 + #41321
		//Если НЕ ПечатьКомплектаДокументов.ПолучитьПечатнуюФормуИзДиадок(КоллекцияПечатныхФорм, ПечатаемыйДокумент, ИмяМакета, СинонимМакета) Тогда
		ПечататьПФ = Истина;
		Если НЕ ПараметрыПечати.Свойство("ФормированиеИзДиадок") Тогда
			ПечататьПФ = НЕ ПечатьКомплектаДокументов.ПолучитьПечатнуюФормуИзДиадок(КоллекцияПечатныхФорм, ПечатаемыйДокумент, ИмяМакета, СинонимМакета);
		КонецЕсли;
		//Иначе
		Если ПечататьПФ Тогда
	//Евросиб Литвинов ) 24.10.21 #40869 + #41321			
			ТаблицаСведенийАктаОбОказанииУслуг = ПолучитьТаблицуСведенийАктаОбОказанииУслуг(ПечатаемыйДокумент);
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
															КоллекцияПечатныхФорм,
															"АктСдачиПриемки",
															"Акт сдачи-приемки",
															ПечатьБухгалтерскихДокументов.ПечатьАктаОбОказанииУслуг(ТаблицаСведенийАктаОбОказанииУслуг, ОбъектыПечати, ПараметрыПечати,СтруктураПодписантов),
															,
															"Документ.РеализацияТоваровУслуг.ПФ_MXL_АктСдачиПриемки");
		КонецЕсли;
														
	КонецЦикла;	
	// Часть кода по предыдущей печати (ниже) закомментировал												
	// Евросиб Фролов)
	
//	Для каждого ЭлМассива из МассивОбъектов Цикл
////Евросиб Литвинов 19.08.2021 ( #35933 #36212
//		Запрос = Новый Запрос;
//		Запрос.Текст =
//		"ВЫБРАТЬ
//		|	Диадок_Документы.Ссылка КАК Ссылка
//		|ИЗ
//		|	Справочник.Диадок_Документы КАК Диадок_Документы
//		|ГДЕ
//		|	Диадок_Документы.Документ = &Документ
//		|	И Диадок_Документы.Метка = ""Отправлен""
//		|	И НЕ Диадок_Документы.ПометкаУдаления";		
//		Запрос.УстановитьПараметр("Документ", ЭлМассива);
//		
//		Выборка = Запрос.Выполнить().Выбрать();

//		Если Выборка.Следующий() Тогда
//			
//			ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "АктСдачиПриемки");
//			
//			ПФ = Диадок_ФоновыеЗадания.ПолучитьПечатнуюФормуДокументаПоСсылке(Выборка.Ссылка);
//			Если ЗначениеЗаполнено(ПФ) Тогда
//				АдресХранилища = ПоместитьВоВременноеХранилище(ПФ, Новый УникальныйИдентификатор);
//				
//				ПечатнаяФорма.СинонимМакета    = НСтр("ru = 'Акт сдачи-приемки'");
//				Если ПечатнаяФорма.ОфисныеДокументы = Неопределено Тогда
//					ПечатнаяФорма.ОфисныеДокументы = Новый Соответствие;
//				КонецЕсли;
//				ПечатнаяФорма.ОфисныеДокументы.Вставить(АдресХранилища, Строка(ЭлМассива) + ".pdf");
//				Продолжить;
//			КонецЕсли;
//		КонецЕсли;
////Евросиб Литвинов 19.08.2021 ) #35933 #36212 
//		ТаблицаСведенийАктаОбОказанииУслуг = ПолучитьТаблицуСведенийАктаОбОказанииУслуг(ЭлМассива);
//		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктСдачиПриемки", "Акт сдачи-приемки", 
//					ПечатьБухгалтерскихДокументов.ПечатьАктаОбОказанииУслуг(ТаблицаСведенийАктаОбОказанииУслуг, ОбъектыПечати, ПараметрыПечати,СтруктураПодписантов),, 
//							"Документ.РеализацияТоваровУслуг.ПФ_MXL_АктСдачиПриемки");
//	КонецЦикла;
				
КонецПроцедуры

Функция ПолучитьТаблицуСведенийАктаОбОказанииУслуг(Документ) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаСведений = ПечатьБухгалтерскихДокументов.ПолучитьОписаниеАктаОбОказанииУслуг();
	Запрос = Новый Запрос();
	Запрос.Текст = ПолучитьТекстЗапросаДляФормированияТаблицыСведенийАктаОбОказанииУслуг();
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("ДатаСреза",Документ.Дата); 
	// Субботин TASK 72390 18.07.2023  Начало
	ВалютаРегУчета = Константы.ВалютаРегламентированногоУчета.Получить();	
	Запрос.УстановитьПараметр("ВалютаДляДоговоров_в_УЕ", ВалютаРегУчета);  
	Запрос.УстановитьПараметр("КодВалютаДляДоговоров_в_УЕ", ВалютаРегУчета.Код);
    Запрос.УстановитьПараметр("НаименованиеВалютаДляДоговоров_в_УЕ", ВалютаРегУчета.СокращенноеНаименование);
    // Субботин TASK 72390 18.07.2023  Конец
	//Евросиб - АСуслов 17.11.2022 9:35:24 #60694
	//(
	Запрос.УстановитьПараметр("УслугаФрахта", Константы.УслугаФрахтаДляКалькуляции.Получить());
	//)
	//Евросиб - АСуслов 17.11.2022 9:35:29 #60694
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
    //Евросиб СубботинВ #84453 02.07.2024 Начало
	//Выборка = РезультатыЗапроса[0].Выбрать();
	//СтрокиДокументов = РезультатыЗапроса[1].Выгрузить();
	//СтрокиРасшифровки = РезультатыЗапроса[2].Выгрузить();
	//ВалютаРегУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	//Выборка = РезультатыЗапроса[1].Выбрать();
	//СтрокиДокументов = РезультатыЗапроса[2].Выгрузить();
	//СтрокиРасшифровки = РезультатыЗапроса[3].Выгрузить();
	//ВалютаРегУчета = Константы.ВалютаРегламентированногоУчета.Получить();
    //Евросиб СубботинВ #84453 02.07.2024 Конец
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0403604, 20-06-2025, начало
	Выборка = РезультатыЗапроса[0].Выбрать();
	СтрокиДокументов = РезультатыЗапроса[1].Выгрузить();
	СтрокиРасшифровки = РезультатыЗапроса[2].Выгрузить();
	ВалютаРегУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0403604, 20-06-2025, конец
	
	//Евросиб - АСуслов 18.12.2020 17:22:25 #
	//(
	//так нельзя делать, так как в этом случае теряется отгрузочная информация
	//в частности о количестве контейнеров.
	//отключу, если будут конфликты, тогда придется переделывать.
	
	// если это особый клиент и у него выставлена галочка "СуммироватьСтроки", 
	// то нужно просуммировать его строки (сворачиваем таблицу СтрокиДокументов)
	
	//Запрос1 = Новый Запрос;
	//Запрос1.Текст = "ВЫБРАТЬ
	//                |	ФормированиеФинДокументов.Ссылка КАК Ссылка
	//                |ИЗ
	//                |	Справочник.ФормированиеФинДокументов КАК ФормированиеФинДокументов
	//                |ГДЕ
	//                |	ФормированиеФинДокументов.Контрагент = &Контрагент
	//                |	И ФормированиеФинДокументов.СуммироватьСтроки";
	//Запрос1.УстановитьПараметр("Контрагент",Документ.Контрагент);
	//Если НЕ Запрос1.Выполнить().Пустой() Тогда
	//	СтрокиДокументов.Свернуть("Номенклатура,НоменклатураНаименование,СтавкаНДС,ЕдиницаИзмерения,ЕдиницаИзмеренияКод,ЕдиницаИзмеренияНаименование","Количество,Цена,Сумма,СуммаНДС,СуммаБезНДС,СуммаСНДС");
	//КонецЕсли;
	//)
	//Евросиб - АСуслов 18.12.2020 17:22:26 #
	
	Пока Выборка.Следующий() Цикл
		
		СведенияОДокументе = ТаблицаСведений.Добавить(); 
		ЗаполнитьЗначенияСвойств(СведенияОДокументе, Выборка);
		//Евросиб - АСуслов 13.09.2022 11:09:03 #
		//(
		ФакторингСервер.ЗаполнитьПараметрыФакторинга(СведенияОДокументе);
		//)
		//Евросиб - АСуслов 13.09.2022 11:09:03 #
//		СведенияОДокументе.ДоверенностьЗаРуководителя = Выборка.ДоверенностьЗаРуководителя;
//		СведенияОДокументе.ДоверенностьЗаГлБухгалтера = Выборка.ДоверенностьЗаГлБухгалтера;
		ТаблицаДокумента = ПечатьБухгалтерскихДокументов.ПолучитьОписаниеТаблицыАктаОбОказанииУслуг();
		ТаблицаРасшифровки = ПечатьБухгалтерскихДокументов.ПолучитьОписаниеТаблицыРасшифровки();

		Для Каждого Строка Из СтрокиДокументов Цикл
			СтрокаТаблицыДокумента = ТаблицаДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыДокумента, Строка);
		КонецЦикла;
	    СведенияОДокументе.ТаблицаДокумента = ТаблицаДокумента;
		Для каждого Строка из СТрокиРасшифровки Цикл
			СтрТаблицы = ТаблицаРасшифровки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрТаблицы, Строка);
		КонецЦикла;
		СведенияОДокументе.ТаблицаРасшифровки =  ТаблицаРасшифровки;
	КонецЦикла;
	
	Возврат ТаблицаСведений;
		
КонецФункции 

Функция ПолучитьТекстЗапросаДляФормированияТаблицыСведенийАктаОбОказанииУслуг()
	ТекстЗапроса = 
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0403604, 20-06-2025, начало (закомменитировал, данные потом не используются для печатных форм)
	//"ВЫБРАТЬ
	////Евросиб СубботинВ #84453 02.07.2024 Начало// добавил таблицу для получения сделок 
	//|	РеализацияТоваровУслугУслуги.Сделка КАК Сделка,
	//|	РеализацияТоваровУслугУслуги.Ссылка КАК СсылкаРТУ
	//|ПОМЕСТИТЬ ВТ_Сделки
	//|ИЗ
	//|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	//|ГДЕ
	//|РеализацияТоваровУслугУслуги.Ссылка = &Документ 
	//|;
	////Евросиб СубботинВ #84453 02.07.2024 Конец 
	//|////////////////////////////////////////////////////////////////////////////////
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0403604, 20-06-2025, конец
	"	ВЫБРАТЬ 
	|	РеализацияТоваровУслуг.ДатаСоставления КАК ДатаСоставления,
	|	РеализацияТоваровУслуг.Ссылка КАК Документ,
	|	РеализацияТоваровУслуг.Дата КАК ДатаДляПолученияСведений,
	|	РеализацияТоваровУслуг.НомерДляПечати КАК НомерДокумента,
	|	РеализацияТоваровУслуг.ДатаДокумента КАК ДатаДокумента,
	//Евросиб СубботинВ #84453 02.07.2024 Начало
//	|	РеализацияТоваровУслуг.Сделка КАК ДокументОснование,
    //|	ВТ_Сделки.Сделка КАК ДокументОснование, //Евросиб(ДИТ), Беляев СЮ, Ticket#0403604, 20-06-2025, (закомменитировал, данные потом не используются для печатных форм)
	//Евросиб СубботинВ #84453 02.07.2024 Конец
	|	РеализацияТоваровУслуг.Грузоотправитель КАК Поставщик,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.Контрагент.НаименованиеПолное КАК ПолноеНаименованиеКонтрагента,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	РеализацияТоваровУслуг.Грузополучатель КАК Получатель,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента.Представление КАК ПредставлениеДоговора,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента.Номер КАК НомерДоговора,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента.Дата КАК ДатаДоговора,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Организация
	|		ИНАЧЕ РеализацияТоваровУслуг.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК Организация,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Организация.НаименованиеСокращенное
	|		ИНАЧЕ РеализацияТоваровУслуг.Организация.ГоловнаяОрганизация.НаименованиеСокращенное
	|	КОНЕЦ КАК КраткоеНаименованиеОрг,
	|	РеализацияТоваровУслуг.ПодразделениеОрганизации КАК Подразделение,
	|	РеализацияТоваровУслуг.БанковскийСчетОрганизации КАК БанковскийСчетПродавца,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах
	|			ТОГДА &ВалютаДляДоговоров_в_УЕ
	|		ИНАЧЕ РеализацияТоваровУслуг.ВалютаДокумента
	|	КОНЕЦ КАК Валюта,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах
	|			ТОГДА &КодВалютаДляДоговоров_в_УЕ
	|		ИНАЧЕ РеализацияТоваровУслуг.ВалютаДокумента.Код
	|	КОНЕЦ КАК ВалютаКод,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах
	|			ТОГДА &НаименованиеВалютаДляДоговоров_в_УЕ
	|		ИНАЧЕ РеализацияТоваровУслуг.ВалютаДокумента.СокращенноеНаименование
	|	КОНЕЦ КАК ВалютаНаименование,
	|	РеализацияТоваровУслуг.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	РеализацияТоваровУслуг.Руководитель КАК РуководительОрг,
	|	РеализацияТоваровУслуг.Руководитель.Наименование КАК РуководительФИО,
	|	РеализацияТоваровУслуг.ЗаРуководителяНаОсновании КАК ЗаРуководителяНаОсновании,
	|	РеализацияТоваровУслуг.ЗаРуководителяНаОсновании КАК ЗаРуководителяНаОснованииНаименование,
	|	РеализацияТоваровУслуг.ДоверенностьЗаРуководителя КАК ДоверенностьЗаРуководителя,
	|	РеализацияТоваровУслуг.ДоверенностьЗаГлБухгалтера КАК ДоверенностьЗаГлБухгалтера,
	|	РеализацияТоваровУслуг.РуководительКонтрагента КАК РуководительКонтрагента,
	|	ЕСТЬNULL(ИсторияФакторинга.ДоговорКомпанииФактор.ДополнительнаяИнформацияФакторинг, """") КАК ДополнительнаяИнформацияФакторинг,
	|	ВЫБОР
	|		КОГДА ИсторияФакторинга.ДоговорКомпанииФактор ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Факторинг,
	|	РеализацияТоваровУслуг.ПодразделениеОрганизации.Город КАК ПодразделениеГород,
	|	РеализацияТоваровУслуг.ПравилоФормирования КАК ПравилоФормирования
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеРуководителяКонтрагентов.СрезПоследних(&ДатаСреза, ) КАК ДанныеРуководителяКонтрагентовСрезПоследних
	|		ПО РеализацияТоваровУслуг.Контрагент = ДанныеРуководителяКонтрагентовСрезПоследних.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияФакторинга КАК ИсторияФакторинга
	|		ПО РеализацияТоваровУслуг.ДоговорКонтрагента = ИсторияФакторинга.Договор
	|			И РеализацияТоваровУслуг.ДатаДокумента >= ИсторияФакторинга.НачалоФакторинга
	|			И (ИсторияФакторинга.НачалоФакторинга <> ДАТАВРЕМЯ(1, 1, 1))
	|			И (ИсторияФакторинга.ОкончаниеФакторинга = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ РеализацияТоваровУслуг.ДатаДокумента <= ИсторияФакторинга.ОкончаниеФакторинга)
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0403604, 20-06-2025, начало (закомменитировал, данные потом не используются для печатных форм)
	////Евросиб СубботинВ #84453 02.07.2024 Начало
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Сделки КАК ВТ_Сделки
	//|		ПО ВТ_Сделки.СсылкаРТУ = РеализацияТоваровУслуг.Ссылка
	////Евросиб СубботинВ #84453 02.07.2024 Конец
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0403604, 20-06-2025, конец
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""Товары"" КАК ТабличнаяЧасть,
	|	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	// Евросиб US 130809 TA 130821 Рыбьяков К.А. 26.02.2026 ((
	|	ВЫБОР
	|		КОГДА НЕ РеализацияТоваровУслугТовары.Номенклатура.НаименованиеПолное ПОДОБНО """"
	|			ТОГДА ВЫБОР
	|				КОГДА ДлинаСтроки(РеализацияТоваровУслугТовары.Номенклатура.НаименованиеПолное) > 1000
	|					ТОГДА РеализацияТоваровУслугТовары.Номенклатура.Код
	|				ИНАЧЕ РеализацияТоваровУслугТовары.Номенклатура.НаименованиеПолное
	|			КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|				КОГДА ДлинаСтроки(РеализацияТоваровУслугТовары.Номенклатура.Наименование) > 1000
	|					ТОГДА РеализацияТоваровУслугТовары.Номенклатура.Код
	|				ИНАЧЕ РеализацияТоваровУслугТовары.Номенклатура.Наименование
	|			КОНЕЦ 
	|	КОНЕЦ КАК НоменклатураНаименование,
	//|	ВЫБОР
	//|		КОГДА НЕ РеализацияТоваровУслугТовары.Номенклатура.НаименованиеПолное ПОДОБНО """"
	//|			ТОГДА РеализацияТоваровУслугТовары.Номенклатура.НаименованиеПолное
	//|		ИНАЧЕ РеализацияТоваровУслугТовары.Номенклатура.Наименование
	//|	КОНЕЦ КАК НоменклатураНаименование,
	// Евросиб Рыбьяков К.А. 26.02.2026 ))
	|	РеализацияТоваровУслугТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	РеализацияТоваровУслугТовары.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	РеализацияТоваровУслугТовары.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|	РеализацияТоваровУслугТовары.Количество КАК Количество,
	|	РеализацияТоваровУслугТовары.Цена КАК Цена,
	|	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	|			ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
	|		ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	РеализацияТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
	|	РеализацияТоваровУслугТовары.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	|			ТОГДА РеализацияТоваровУслугТовары.Сумма
	|		ИНАЧЕ РеализацияТоваровУслугТовары.Сумма + РеализацияТоваровУслугТовары.СуммаНДС
	|	КОНЕЦ КАК СуммаСНДС,
	|	NULL КАК Вагоны,
	|	NULL КАК Контейнеры,
	|	NULL КАК ПунктОтправления,
	|	NULL КАК ПунктНазначения,
	|	NULL КАК НаименованиеСтороныКлиент,
	|	NULL КАК НаименованиеСтороныКлиентРП
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Документ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Услуги"",
	|	РеализацияТоваровУслугУслуги.НомерСтроки,
	|	РеализацияТоваровУслугУслуги.Номенклатура,
	// Евросиб US 130809 TA 130821 Рыбьяков К.А. 26.02.2026 ((
	|	ВЫБОР
	|		КОГДА НЕ РеализацияТоваровУслугУслуги.Содержание ПОДОБНО """"
	|			ТОГДА ВЫБОР
	|				   	КОГДА ДлинаСтроки(РеализацияТоваровУслугУслуги.Содержание) > 1000
	|				   		ТОГДА РеализацияТоваровУслугУслуги.Номенклатура.Код
	|				   	ИНАЧЕ РеализацияТоваровУслугУслуги.Содержание
	|			КОНЕЦ
	|		КОГДА НЕ РеализацияТоваровУслугУслуги.Номенклатура.НаименованиеПолное ПОДОБНО """"
	|			ТОГДА ВЫБОР
	|				   	КОГДА ДлинаСтроки(РеализацияТоваровУслугУслуги.Номенклатура.НаименованиеПолное) > 1000
	|				   		ТОГДА РеализацияТоваровУслугУслуги.Номенклатура.Код
	|				   	ИНАЧЕ РеализацияТоваровУслугУслуги.Номенклатура.НаименованиеПолное
	|			КОНЕЦ 
	|		ИНАЧЕ 
	|			РеализацияТоваровУслугУслуги.Номенклатура.Наименование
	|	КОНЕЦ КАК НоменклатураНаименование,
	//|	ВЫБОР
	//|		КОГДА НЕ РеализацияТоваровУслугУслуги.Содержание ПОДОБНО """"
	//|			ТОГДА РеализацияТоваровУслугУслуги.Содержание
	//|		КОГДА НЕ РеализацияТоваровУслугУслуги.Номенклатура.НаименованиеПолное ПОДОБНО """"
	//|			ТОГДА РеализацияТоваровУслугУслуги.Номенклатура.НаименованиеПолное
	//|		ИНАЧЕ РеализацияТоваровУслугУслуги.Номенклатура.Наименование
	//|	КОНЕЦ,
	// Евросиб Рыбьяков К.А. 26.02.2026 ))
	|	СделкаДоходы.ЕдиницаИзмерения,
	|	СделкаДоходы.ЕдиницаИзмерения.Код,
	|	СделкаДоходы.ЕдиницаИзмерения.Наименование,
	|	РеализацияТоваровУслугУслуги.Количество,
	|	РеализацияТоваровУслугУслуги.Цена,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах
	|			ТОГДА РеализацияТоваровУслугУслуги.ВсегоСНДС
	|		ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах
	|			ТОГДА ВЫБОР
	|					КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
	|						ТОГДА РеализацияТоваровУслугУслуги.СуммаБезНалога
	|					ИНАЧЕ РеализацияТоваровУслугУслуги.СуммаБезНалога
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
	|					ТОГДА РеализацияТоваровУслугУслуги.Сумма - РеализацияТоваровУслугУслуги.СуммаНДС
	|				ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
	|			КОНЕЦ
	|	КОНЕЦ,
	|	РеализацияТоваровУслугУслуги.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах
	|			ТОГДА ВЫБОР
	|					КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
	|						ТОГДА РеализацияТоваровУслугУслуги.СуммаНДСРуб
	|					ИНАЧЕ РеализацияТоваровУслугУслуги.СуммаНДСРуб
	|				КОНЕЦ
	|		ИНАЧЕ РеализацияТоваровУслугУслуги.СуммаНДС
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах
	|			ТОГДА ВЫБОР
	|					КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
	|						ТОГДА РеализацияТоваровУслугУслуги.ВсегоСНДС
	|					ИНАЧЕ РеализацияТоваровУслугУслуги.ВсегоСНДС
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
	|					ТОГДА РеализацияТоваровУслугУслуги.Сумма
	|				ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма + РеализацияТоваровУслугУслуги.СуммаНДС
	|			КОНЕЦ
	|	КОНЕЦ,
	|	РеализацияТоваровУслугУслуги.СписокТС,
	|	РеализацияТоваровУслугУслуги.СписокТЕ,
	|	РеализацияТоваровУслугУслуги.ПунктОтправления,
	|	РеализацияТоваровУслугУслуги.ПунктНазначения,
	|	СделкаДоходы.ПСЦ.НаименованиеПодписиКлиента.Наименование,
	|	СделкаДоходы.ПСЦ.НаименованиеПодписиКлиента.НаименованиеВРодительномПадеже
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
	//Евросиб СубботинВ #84453 02.07.2024 Начало // получение сделки из тч
//	|		ПО РеализацияТоваровУслугУслуги.Ссылка.Сделка = СделкаДоходы.Ссылка
	|		ПО РеализацияТоваровУслугУслуги.Сделка = СделкаДоходы.Ссылка
	//Евросиб СубботинВ #84453 02.07.2024 Конец 
	|			И РеализацияТоваровУслугУслуги.СтрокаДоходовСделки = СделкаДоходы.ГУИД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслугУслуги.Ссылка = &Документ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""АгентскиеУслуги"",
	|	РеализацияТоваровУслугАгентскиеУслуги.НомерСтроки,
	|	РеализацияТоваровУслугАгентскиеУслуги.Номенклатура,
	|	ВЫБОР
	|		КОГДА НЕ РеализацияТоваровУслугАгентскиеУслуги.Содержание ПОДОБНО """"
	|			ТОГДА РеализацияТоваровУслугАгентскиеУслуги.Содержание
	|		КОГДА НЕ РеализацияТоваровУслугАгентскиеУслуги.Номенклатура.НаименованиеПолное ПОДОБНО """"
	|			ТОГДА РеализацияТоваровУслугАгентскиеУслуги.Номенклатура.НаименованиеПолное
	|		ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Номенклатура.Наименование
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	NULL,
	|	РеализацияТоваровУслугАгентскиеУслуги.Количество,
	|	РеализацияТоваровУслугАгентскиеУслуги.Цена,
	|	РеализацияТоваровУслугАгентскиеУслуги.Сумма,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС
	|			ТОГДА РеализацияТоваровУслугАгентскиеУслуги.Сумма - РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС
	|		ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма
	|	КОНЕЦ,
	|	РеализацияТоваровУслугАгентскиеУслуги.СтавкаНДС,
	|	РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугАгентскиеУслуги.Ссылка.СуммаВключаетНДС
	|			ТОГДА РеализацияТоваровУслугАгентскиеУслуги.Сумма
	|		ИНАЧЕ РеализацияТоваровУслугАгентскиеУслуги.Сумма + РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	|ГДЕ
	|	РеализацияТоваровУслугАгентскиеУслуги.Ссылка = &Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугРасшифровкаУслугПоТС.Услуга = &УслугаФрахта
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ЖД)
	|	КОНЕЦ КАК ВидТранспортногоСообщения,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугРасшифровкаУслугПоТС.Услуга = &УслугаФрахта
	|			ТОГДА РеализацияТоваровУслугРасшифровкаУслугПоТС.Коносамент.НомерТранспортногоДокумента
	|		ИНАЧЕ РеализацияТоваровУслугРасшифровкаУслугПоТС.НомерЖДН
	|	КОНЕЦ КАК НомерЖДН,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугРасшифровкаУслугПоТС.Услуга = &УслугаФрахта
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РеализацияТоваровУслугРасшифровкаУслугПоТС.Вагон
	|	КОНЕЦ КАК Вагон,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ПаспортаВагоновСрезПоследних.Грузоподъемность, 0) = 0
	|				И НЕ РеализацияТоваровУслугРасшифровкаУслугПоТС.Услуга = &УслугаФрахта
	|			ТОГДА ПаспортаВагоновСрезПоследних.Грузоподъемность / 10
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ГП,
	|	РеализацияТоваровУслугРасшифровкаУслугПоТС.Контейнер КАК Контейнер,
	|	РеализацияТоваровУслугРасшифровкаУслугПоТС.ДатаОтправки КАК ДатаОтправки,
	|	РеализацияТоваровУслугРасшифровкаУслугПоТС.ФактическийВес КАК ФактическийВес,
	|	РеализацияТоваровУслугРасшифровкаУслугПоТС.РасчетныйВес КАК РасчетныйВес,
	|	ПОДСТРОКА(РеализацияТоваровУслугРасшифровкаУслугПоТС.Примечание, 1, 1000) КАК Примечание,
	|	РеализацияТоваровУслугРасшифровкаУслугПоТС.Груз КАК Груз,
	|	РеализацияТоваровУслугРасшифровкаУслугПоТС.ПунктОтправления КАК ПунктОтправления,
	|	РеализацияТоваровУслугРасшифровкаУслугПоТС.ПунктНазначения КАК ПунктНазначения
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.РасшифровкаУслугПоТС КАК РеализацияТоваровУслугРасшифровкаУслугПоТС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортаВагонов.СрезПоследних КАК ПаспортаВагоновСрезПоследних
	|		ПО РеализацияТоваровУслугРасшифровкаУслугПоТС.Вагон = ПаспортаВагоновСрезПоследних.Вагон
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент.Коносаменты КАК ТранспортныйДокументКоносаменты
	|		ПО РеализацияТоваровУслугРасшифровкаУслугПоТС.Коносамент = ТранспортныйДокументКоносаменты.Ссылка
	|			И РеализацияТоваровУслугРасшифровкаУслугПоТС.Контейнер = ТранспортныйДокументКоносаменты.НомерКТК
	|ГДЕ
	|	РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка = &Документ";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Евросиб Фролов (06.05.2022 Ticket №0269237
Функция ДокументыСКорректировкойДолга(МассивДокументов) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КорректировкаДолгаДебиторскаяЗадолженность.Сделка КАК Сделка
	|ПОМЕСТИТЬ втДокументы
	|ИЗ
	|	Документ.КорректировкаДолга.ДебиторскаяЗадолженность КАК КорректировкаДолгаДебиторскаяЗадолженность
	|ГДЕ
	|	КорректировкаДолгаДебиторскаяЗадолженность.Сделка В(&МассивДокументов)
	|	И КорректировкаДолгаДебиторскаяЗадолженность.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаДолгаКредиторскаяЗадолженность.Сделка
	|ИЗ
	|	Документ.КорректировкаДолга.КредиторскаяЗадолженность КАК КорректировкаДолгаКредиторскаяЗадолженность
	|ГДЕ
	|	КорректировкаДолгаКредиторскаяЗадолженность.Сделка В(&МассивДокументов)
	|	И КорректировкаДолгаКредиторскаяЗадолженность.Ссылка.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втДокументы.Сделка КАК Сделка
	|ИЗ
	|	втДокументы КАК втДокументы";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	МассивДокументовСКорректировкой = РезультатЗапроса.ВыгрузитьКолонку("Сделка");
	
	Возврат МассивДокументовСКорректировкой;
КонецФункции
// Евросиб Фролов)

#КонецОбласти

//ДИТ, Беляев СЮ, BUG 59400/TA 59404, 21-10-2022, закомментирован (модуль перенесён в ОМ ДоходыСделкиСервер)
//Процедура ПерезаполнитьОтгрузочнуюИнформацию(ОбъектРТУ) Экспорт
//	РасшифровкаУслугПоТС_ДоЗаполнения = ОбъектРТУ.РасшифровкаУслугПоТС.Выгрузить();
//	ОбъектРТУ.РасшифровкаУслугПоТС.Очистить();
//	ТаблицаСделокПоГУИД = ПолучитьТаблицуСделокПоГУИД(ОбъектРТУ);
//	Для каждого СтрокаУслуга Из ОбъектРТУ.Услуги Цикл
//		//Сделка = НайтиСделку(СтрокаУслуга.СтрокаДоходовСделки);
//		СтрокаТаблицыСделок = ТаблицаСделокПоГУИД.Найти(СтрокаУслуга.СтрокаДоходовСделки);
//		Если СтрокаТаблицыСделок = Неопределено Тогда
//			Продолжить;
//		КонецЕсли;     
//		Сделка = СтрокаТаблицыСделок.Сделка;
//		АналогВыборки = Новый Структура("ГУИД, Услуга", СтрокаУслуга.СтрокаДоходовСделки, СтрокаУслуга.Номенклатура);
//		РасшифровкаЗаполнена = Ложь;
//		//СтрокаКТК = НайтиСтрокиКТК(Сделка, СтрокаУслуга.СтрокаДоходовСделки);
//		//СтрокаВагонов = НайтиСтрокиВагоны(Сделка, СтрокаУслуга.СтрокаДоходовСделки);
//		СтрокаКТК = СтрокаТаблицыСделок.КТК;
//		СтрокаВагонов = СтрокаТаблицыСделок.Вагон;
//		МассивВагонов = СтрРазделить(СтрокаВагонов, ";", Ложь);
//		Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(МассивВагонов);
//		//Евросиб Каблов 31.05.2022 ( Task 45436
//		ПараметрыФФД = Новый Структура("ЗаменятьСтанциюНаОсновную");
//		ЗаполнитьЗначенияСвойств(ПараметрыФФД, СтрокаТаблицыСделок);
//		//Евросиб Каблов 31.05.2022 )
//		Если ЗначениеЗаполнено(СтрокаКТК) Тогда
//			МассивКонтейнеров = СтрРазделить(СтрокаКТК, ";", Ложь);
//			Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(МассивКонтейнеров);
//			Для каждого ЭлМас Из МассивКонтейнеров Цикл
//				//Если натолкнётесь на эту строчку и у вас будет чуть больше времени чем 15 минут,
//				//то переделайте на разовый запрос
//				СтрПоезда = Документы.Сделка.НайтиСтрокуПоезда(Сделка, ЭлМас,,ОбъектРТУ.Контрагент);
//				Если ЗначениеЗаполнено(СтрПоезда) И Не СтрПоезда.НеАктивна Тогда
//					ЕдИзм = СтрПоезда.Калькуляция.ЕдиницаИзмерения;
//					НовСтрокаРасш = ОбъектРТУ.РасшифровкаУслугПоТС.Добавить();
//					//Евросиб - АСуслов 29.07.2022 17:36:53 #55029
//					//(
//					КоличествоДляСуммы = ?(ЕдИзм = Справочники.КлассификаторЕдиницИзмерения.вагон, МассивВагонов.Количество(), МассивКонтейнеров.Количество());
//					// ДИТ Поморцева Т.П. Задача 248427 29.10.21. начало -- последний параметр не используется в этой процедуре
//					//Документы.Сделка.ЗаполнитьСтрокуРасшифровкиПоСтрокеСделки(НовСтрокаРасш, СтрПоезда, АналогВыборки, СтрокаУслуга, Сделка,,КоличествоДляСуммы);
//					//Евросиб Каблов 31.05.2022 ( Task 45436
//					//Документы.Сделка.ЗаполнитьСтрокуРасшифровкиПоСтрокеСделки(НовСтрокаРасш, СтрПоезда, АналогВыборки, СтрокаУслуга, Сделка);
//					Документы.Сделка.ЗаполнитьСтрокуРасшифровкиПоСтрокеСделки(НовСтрокаРасш, СтрПоезда, АналогВыборки, СтрокаУслуга, Сделка,, ПараметрыФФД, КоличествоДляСуммы);
//					//)
//					//Евросиб - АСуслов 29.07.2022 17:36:54 #55029
//					//Евросиб Каблов 31.05.2022 )
//					// ДИТ Поморцева Т.П. Задача 248427 29.10.21. конец
//					РасшифровкаЗаполнена = Истина;
//				КонецЕсли;
//			КонецЦИкла;
//		КонецЕсли; 
//		
//		Если ЗначениеЗаполнено(СтрокаВагонов) Тогда
//			Если НЕ РасшифровкаЗаполнена Тогда
//				Для каждого ЭлМас Из МассивВагонов ЦИкл 
//					//Евросиб - АСуслов 29.07.2022 17:36:53 #
//					//(
//					КоличествоДляСуммы = МассивВагонов.Количество();
//					СтрПоезда = Документы.Сделка.НайтиСтрокуПоезда(Сделка, ЭлМас, Ложь,ОбъектРТУ.Контрагент);
//					Если СтрПоезда <> неопределено И Не СтрПоезда.НеАктивна Тогда
//						НовСтрокаРасш = ОбъектРТУ.РасшифровкаУслугПоТС.Добавить();
//						// ДИТ Поморцева Т.П. Задача 248427 29.10.21. начало
//						//Документы.Сделка.ЗаполнитьСтрокуРасшифровкиПоСтрокеСделки(НовСтрокаРасш, СтрПоезда, АналогВыборки, СтрокаУслуга,Сделка, Истина, МассивВагонов.Количество());
//						//Евросиб Каблов 31.05.2022 ( Task 45436
//						//Документы.Сделка.ЗаполнитьСтрокуРасшифровкиПоСтрокеСделки(НовСтрокаРасш, СтрПоезда, АналогВыборки, СтрокаУслуга,Сделка, Истина);
//						Документы.Сделка.ЗаполнитьСтрокуРасшифровкиПоСтрокеСделки(НовСтрокаРасш, СтрПоезда, АналогВыборки, СтрокаУслуга,Сделка, Истина, ПараметрыФФД, КоличествоДляСуммы);
//					//)
//					//Евросиб - АСуслов 29.07.2022 17:36:54 #
//						//Евросиб Каблов 31.05.2022 )
//						// ДИТ Поморцева Т.П. Задача 248427 29.10.21. конец
//					КонецЕсли;
//				КонецЦИкла;
//			КонецЕсли;
//		КонецЕсли; 
//	КонецЦикла;          
//	Если ОбъектРТУ.РасшифровкаУслугПоТС.Количество() = 0 Тогда
//		ОбъектРТУ.РасшифровкаУслугПоТС.Загрузить(РасшифровкаУслугПоТС_ДоЗаполнения);
//	КонецЕсли;
//	Документы.Сделка.СкорректироватьСуммыРасшифровки(ОбъектРТУ);
//		
//КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуСделокПоГУИД(ОбъектРТУ)
	Сделка = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Доходы.ГУИД КАК ГУИД,
	|	Доходы.Ссылка КАК Сделка,
	|	СделкаДоходыВагоны.Вагон КАК Вагон,
	|	СделкаДоходыКТК.КТК КАК КТК
	//Евросиб Каблов 31.05.2022 ( Task 45436
	|	,Доходы.ДокументФФД КАК ДокументФФД,
	|	ЕСТЬNULL(ФормированиеФинДокументов.ЗаменятьСтанциюНаОсновную, ЛОЖЬ) КАК ЗаменятьСтанциюНаОсновную
	//Евросиб Каблов 31.05.2022 )
	|ИЗ
	|	Документ.Сделка.Доходы КАК Доходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ДоходыКТК КАК СделкаДоходыКТК
	//Евросиб - АСуслов 25.07.2022 10:51:05 #
	//(
	//|		ПО Доходы.Ссылка = СделкаДоходыКТК.Ссылка
	//|			И Доходы.ГУИД = СделкаДоходыКТК.ГУИД
	//|			И Доходы.ГУИД = СделкаДоходыКТК.ГУИД
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ДоходыВагоны КАК СделкаДоходыВагоны
	//|		ПО Доходы.Ссылка = СделкаДоходыВагоны.Ссылка
	|		ПО Доходы.ГУИД = СделкаДоходыКТК.ГУИД
	|			И Доходы.Ссылка = СделкаДоходыКТК.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ДоходыВагоны КАК СделкаДоходыВагоны
	|		ПО Доходы.ГУИД = СделкаДоходыВагоны.ГУИД
	|			И Доходы.Ссылка = СделкаДоходыВагоны.Ссылка
	//)
	//Евросиб - АСуслов 25.07.2022 10:51:06 #
	//Евросиб Каблов 31.05.2022 ( Task 45436
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФормированиеФинДокументов КАК ФормированиеФинДокументов
	|		ПО Доходы.ДокументФФД = ФормированиеФинДокументов.Документ
	//Евросиб Каблов 31.05.2022 )
	|ГДЕ
	|	Доходы.ГУИД В(&ГУИД)";
	Запрос.УстановитьПараметр("ГУИД", ОбъектРТУ.Услуги.Выгрузить().ВыгрузитьКолонку("СтрокаДоходовСделки"));
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

//Евросиб Дубская 27.10.2022 ( Ticket#0287875
Функция ЕстьПривязанныеОплаты(Ссылка) Экспорт
	
	//Проверка доступности по наличию привязанных оплат
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеНаРасчетныйСчетДокументыОплаты.Ссылка КАК Ссылка,
	|	СУММА(ПоступлениеНаРасчетныйСчетДокументыОплаты.СуммаОплаты) КАК СуммаОплаты
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет.ДокументыОплаты КАК ПоступлениеНаРасчетныйСчетДокументыОплаты
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчетДокументыОплаты.ДокументРеализации = &ДокументРеализации
	|	И ПоступлениеНаРасчетныйСчетДокументыОплаты.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеНаРасчетныйСчетДокументыОплаты.Ссылка
	|
	|ИМЕЮЩИЕ
	|	СУММА(ПоступлениеНаРасчетныйСчетДокументыОплаты.СуммаОплаты) <> 0";
	Запрос.УстановитьПараметр("ДокументРеализации", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Количество() > 0;
	
КонецФункции //Евросиб Дубская 27.10.2022 )

//80515 Субботин 16.02.2024 начало 
Функция ПроверитьВозможностьПечатиРТУ(СписокРТУ, ВызовИсключения = Ложь) Экспорт
	
	//Евросиб СубботинВ #119324 07.10.2025 Начало
	НоменклатурыБлокировкиПечатиРТУ = Константы.СписокНоменклатурыБлокировкиПечатиРТУ.Получить().Получить();
	//Евросиб СубботинВ #119324 07.10.2025 Конец

	
	
	МассивШтрафныхДокументов = Новый Массив;
	Если СписокРТУ.Количество() = 1 Тогда 
		//Евросиб СубботинВ #119324 07.10.2025 Начало
		РеквизитыРТУ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СписокРТУ[0],"Штраф, Услуги, Ссылка");
		//Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СписокРТУ[0],"Штраф",) Тогда
		Если РеквизитыРТУ.Штраф Тогда	
		//Евросиб СубботинВ #119324 07.10.2025 Конец	
			Если ВызовИсключения Тогда
				ВызватьИсключение("Недостаточно прав для выполнения операции. Документ " + СписокРТУ[0].Ссылка + " имеет признак Штраф");
			Иначе МассивШтрафныхДокументов.Добавить(СписокРТУ[0].Ссылка);				
			КонецЕсли;
		КонецЕсли;
		//Евросиб СубботинВ #119324 07.10.2025 Начало
		Для Каждого СтрокаУслуг из РеквизитыРТУ.Услуги.Выгрузить() Цикл
			Если НЕ НоменклатурыБлокировкиПечатиРТУ.НайтиПоЗначению(СтрокаУслуг.Номенклатура) = Неопределено Тогда
				МассивШтрафныхДокументов.Добавить(РеквизитыРТУ.Ссылка);
				Прервать;
				//ВызватьИсключение("Печать РТУ с номенклатурой: " + СтрокаУслуг.Номенклатура + " Запрещена");
			КонецЕсли;
		КонецЦикла;
		//Евросиб СубботинВ #119324 07.10.2025 Конец
	ИначеЕсли СписокРТУ.Количество() > 1 Тогда		
		Для Каждого РТУ из СписокРТУ Цикл
			//Евросиб СубботинВ #119324 07.10.2025 Начало
			РеквизитыРТУ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РТУ,"Штраф, Услуги");
			//Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РТУ,"Штраф",) Тогда
			Для Каждого СтрокаУслуг из РеквизитыРТУ.Услуги.Выгрузить() Цикл
				Если НЕ НоменклатурыБлокировкиПечатиРТУ.НайтиПоЗначению(СтрокаУслуг.Номенклатура) = Неопределено Тогда
					МассивШтрафныхДокументов.Добавить(РТУ);
					Прервать;
					//ВызватьИсключение("Печать РТУ с номенклатурой: " + СтрокаУслуг.Номенклатура + " Запрещена");
				КонецЕсли;
			КонецЦикла;			
			Если РеквизитыРТУ.Штраф Тогда
			//Евросиб СубботинВ #119324 07.10.2025 Конец
				МассивШтрафныхДокументов.Добавить(РТУ);
			КонецЕсли;
		КонецЦикла;		
	КонецЕсли;
	Возврат МассивШтрафныхДокументов
	
КонецФункции
//80515 Субботин 16.02.2024 Конец

//Евросиб Каблов 26.08.2025 #111011
Процедура ЗаполнитьВидыДоходовПоСчетам(СчетаНаОплатуПокупателям) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.НомерСтроки КАК НомерСтроки,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.СчетПокупателю КАК СчетПокупателю,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Сумма КАК Сумма,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Количество КАК Количество,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Контейнер КАК Контейнер
	|ПОМЕСТИТЬ Счета
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.СчетаНаОплатуПокупателям КАК РеализацияТоваровУслугСчетаНаОплатуПокупателям
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Счета.НомерСтроки КАК НомерСтроки,
	|	Счета.СчетПокупателю КАК СчетПокупателю,
	|	Счета.Номенклатура КАК Номенклатура,
	|	Счета.Сумма КАК Сумма,
	|	Счета.Количество КАК Количество,
	|	Счета.Контейнер КАК Контейнер,
	|	СчетНаОплатуПокупателюТовары.Калькуляция КАК Калькуляция
	|ПОМЕСТИТЬ УслугиСчетов
	|ИЗ
	|	Счета КАК Счета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
	|		ПО Счета.СчетПокупателю = СчетНаОплатуПокупателюТовары.Ссылка
	|			И Счета.Номенклатура = СчетНаОплатуПокупателюТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Счета.НомерСтроки КАК НомерСтроки,
	|	Счета.СчетПокупателю КАК СчетПокупателю,
	|	Счета.Номенклатура КАК Номенклатура,
	|	Счета.Сумма КАК Сумма,
	|	Счета.Количество КАК Количество,
	|	Счета.Контейнер КАК Контейнер,
	|	ЗначенияДополнительныхАналитикДокументов.Значение КАК ВидДохода
	|ПОМЕСТИТЬ ВидыДоходовСчетов
	|ИЗ
	|	Счета КАК Счета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхАналитикДокументов КАК ЗначенияДополнительныхАналитикДокументов
	|		ПО Счета.СчетПокупателю = ЗначенияДополнительныхАналитикДокументов.Документ
	|			И (ЗначенияДополнительныхАналитикДокументов.Аналитика = &АналитикаВидЗадолженности)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиСчетов.НомерСтроки КАК НомерСтроки,
	|	УслугиСчетов.СчетПокупателю КАК СчетПокупателю,
	|	УслугиСчетов.Номенклатура КАК Номенклатура,
	|	УслугиСчетов.Сумма КАК Сумма,
	|	УслугиСчетов.Количество КАК Количество,
	|	УслугиСчетов.Контейнер КАК Контейнер,
	|	УслугиСчетов.Калькуляция КАК Калькуляция,
	|	УслугиСчетов.ВидДоходов КАК ВидДоходов,
	|	УслугиСчетов.Приоритет КАК Приоритет
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВидыДоходовСчетов.НомерСтроки КАК НомерСтроки,
	|		ВидыДоходовСчетов.СчетПокупателю КАК СчетПокупателю,
	|		ВидыДоходовСчетов.Номенклатура КАК Номенклатура,
	|		ВидыДоходовСчетов.Сумма КАК Сумма,
	|		ВидыДоходовСчетов.Количество КАК Количество,
	|		ВидыДоходовСчетов.Контейнер КАК Контейнер,
	|		NULL КАК Калькуляция,
	|		ВидыДоходовСчетов.ВидДохода КАК ВидДоходов,
	|		0 КАК Приоритет
	|	ИЗ
	|		ВидыДоходовСчетов КАК ВидыДоходовСчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		УслугиСчетов.НомерСтроки,
	|		УслугиСчетов.СчетПокупателю,
	|		УслугиСчетов.Номенклатура,
	|		УслугиСчетов.Сумма,
	|		УслугиСчетов.Количество,
	|		УслугиСчетов.Контейнер,
	|		УслугиСчетов.Калькуляция,
	|		ВЫБОР
	|			КОГДА ДокументКалькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Доплатные)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Доплата)
	|			КОГДА ДокументКалькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Субсидии)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Субсидии)
	|			КОГДА ДокументКалькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Премии)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Премии)
	|			КОГДА ДокументКалькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ВыдачаКткВРынок)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.ВыдачаКткВРынок)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.ОсновнойДолг)
	|		КОНЕЦ,
	|		1
	|	ИЗ
	|		УслугиСчетов КАК УслугиСчетов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция КАК ДокументКалькуляция
	|			ПО УслугиСчетов.Калькуляция = ДокументКалькуляция.Ссылка
	|				И УслугиСчетов.Номенклатура = ДокументКалькуляция.ОсновнаяУслуга
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	|			ПО УслугиСчетов.Калькуляция = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка
	|				И (КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.НомерСтроки = 1)
	|				И УслугиСчетов.Номенклатура = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга
	|	ГДЕ
	|		(НЕ ДокументКалькуляция.Ссылка ЕСТЬ NULL
	|				ИЛИ НЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга ЕСТЬ NULL
	|				ИЛИ УслугиСчетов.Номенклатура = &УслугаФрахт)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		УслугиСчетов.НомерСтроки,
	|		УслугиСчетов.СчетПокупателю,
	|		УслугиСчетов.Номенклатура,
	|		УслугиСчетов.Сумма,
	|		УслугиСчетов.Количество,
	|		УслугиСчетов.Контейнер,
	|		УслугиСчетов.Калькуляция,
	|		ВЫБОР
	|			КОГДА КалькуляцияЖД_УслугиВнеСтавки.ТипСтавки = ЗНАЧЕНИЕ(Перечисление.ТипыСтавокПротокола.Ставка)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.ДопУслуга)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.ДопУслугаВР)
	|		КОНЕЦ,
	|		2
	|	ИЗ
	|		УслугиСчетов КАК УслугиСчетов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция.ЖД_УслугиВнеСтавки КАК КалькуляцияЖД_УслугиВнеСтавки
	|			ПО УслугиСчетов.Калькуляция = КалькуляцияЖД_УслугиВнеСтавки.Ссылка
	|				И УслугиСчетов.Номенклатура = КалькуляцияЖД_УслугиВнеСтавки.Услуга) КАК УслугиСчетов
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.РеализацияТоваровУслуг.СчетаНаОплатуПокупателям", "&СчетаНаОплатуПокупателям");	
	Запрос.УстановитьПараметр("СчетаНаОплатуПокупателям", СчетаНаОплатуПокупателям);
	Запрос.УстановитьПараметр("АналитикаВидЗадолженности", ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.ВидЗадолженности);
	Запрос.УстановитьПараметр("УслугаФрахт", Константы.УслугаФрахтаДляКалькуляции.Получить());
	ТаблицаВидовДоходов = Запрос.Выполнить().Выгрузить();
	
	ПараметрыОтбора = Новый Структура("НомерСтроки");
	Для Каждого Стр Из СчетаНаОплатуПокупателям Цикл
		ЗаполнитьЗначенияСвойств(ПараметрыОтбора, Стр);
		НайденныеСтроки = ТаблицаВидовДоходов.НайтиСтроки(ПараметрыОтбора);
		Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
			Стр.ВидДоходов = НайденныеСтроки[0].ВидДоходов;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


