
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Автор = Пользователи.ТекущийПользователь();
	ЦФО = Автор.ЦФО;
	Создано = ТекущаяДата();
	Организация = Константы.ОсновнаяОрганизация.Получить();
	//БанковскийСчетОрганизации = Организация.ОсновнойБанковскийСчет; //ДИТ, Беляев СЮ, TA48059, 12-04-2022, закомментировал
	ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
	Маршрутизировать = Константы.МаршрутизироватьРТУ.Получить();

//Евросиб Гудкова( 01.11.2019 Ticket№ даты правильно определяются после того, как документ заполнен
	//УстановитьДатыДокумента();
	//ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Организация);
// Евросиб Гудкова) 	

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
		// Заполнение шапки
//Евросиб Гудкова( 01.11.2019 кому-то построчно платят
//было
		//БанковскийСчетОрганизации = ДанныеЗаполнения.БанковскийСчетОрганизации;
		//ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
		//ДоговорКонтрагента = ДанныеЗаполнения.ДоговорКонтрагента;
		//Комментарий = ДанныеЗаполнения.Комментарий;
		//Контрагент = ДанныеЗаполнения.Контрагент;
		//КратностьВзаиморасчетов = ДанныеЗаполнения.КратностьВзаиморасчетов;
		//КурсВзаиморасчетов = ДанныеЗаполнения.КурсВзаиморасчетов;
		//Организация = ДанныеЗаполнения.Организация;
		//Ответственный = ДанныеЗаполнения.Ответственный;
		//ПодразделениеОрганизации = ДанныеЗаполнения.ПодразделениеОрганизации;
		//СуммаВключаетНДС = ДанныеЗаполнения.СуммаВключаетНДС;
		//СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		//УчитыватьНДС = ДанныеЗаполнения.УчитыватьНДС;
		//СчетНаОплатуПокупателю = ДанныеЗаполнения.Ссылка;
		//Руководитель = ДанныеЗаполнения.Руководитель;
		//ГлавныйБухгалтер = ДанныеЗаполнения.ГлавныйБухгалтер;
		//ЗаРуководителяНаОсновании = ДанныеЗаполнения.ЗаРуководителяНаОсновании;
		//ЗаГлавногоБухгалтераНаОсновании = ДанныеЗаполнения.ЗаГлавногоБухгалтераНаОсновании;
		//Грузоотправитель = ДанныеЗаполнения.Грузоотправитель;
		//Грузополучатель = ДанныеЗаполнения.Грузополучатель;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
		БанковскийСчетОрганизации = ОбщегоНазначенияВызовСервера.РасчетныйСчетПоДоговору(ДоговорКонтрагента);
		
// Евросиб Гудкова) 		

		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			Если ТекСтрокаТовары.Номенклатура.Услуга Тогда
				НоваяСтрока = Услуги.Добавить();
//Евросиб Гудкова( 01.11.2019 кому-то построчно платят
//было
				//НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
				//НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
				//НоваяСтрока.Содержание = ТекСтрокаТовары.Содержание;
				//НоваяСтрока.СтавкаНДС = ТекСтрокаТовары.СтавкаНДС;
				//НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
				//НоваяСтрока.СуммаНДС = ТекСтрокаТовары.СуммаНДС;
				//НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаТовары);
// Евросиб Гудкова) 		
			Иначе		
				НоваяСтрока = Товары.Добавить();
//Евросиб Гудкова( 01.11.2019 кому-то построчно платят
//было
				НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
				НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
				НоваяСтрока.СтавкаНДС = ТекСтрокаТовары.СтавкаНДС;
				НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
				НоваяСтрока.СуммаНДС = ТекСтрокаТовары.СуммаНДС;
				НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаТовары);
// Евросиб Гудкова) 		
			КонецЕсли;
			// ДИТ US 59973 ТА 73176 Сержантова А.С. Начало: 31.07.2023
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекСтрокаТовары.Калькуляция, "ТипКалькуляции") = Перечисления.ТипыКалькуляций.Субсидии ИЛИ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекСтрокаТовары.Калькуляция, "ТипКалькуляции") = Перечисления.ТипыКалькуляций.Премии Тогда //ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
				Субсидии = Истина;	
			КонецЕсли;
			// ДИТ US 59973 ТА 73176 Сержантова А.С. Конец: 31.07.2023
		КонецЦикла;
	КонецЕсли;
	
	//УстановитьДатыДокумента(); //Гудкова
	
	///////////////////////////////// Шейкина
	//Евросиб - АСуслов 23.10.2020 15:54:34 #
	//формирование даты в сделке или в реестре
	//(
	//ДатаДокумента = ФормированиеДатДокументов.УстановкаДатыДокумента(ЭтотОбъект,
	//									ДоговорКонтрагента.ПравилоФормированияДатыУслуги,
	//									ДоговорКонтрагента.ПериодичностьВыставленияДокументов,
	//									ДоговорКонтрагента.ДатаПаспортаСделки);
	/////////////////////////////
	
	//)
	//Евросиб - АСуслов 23.10.2020 15:54:35 #
	
	РезультатВалюта = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, ДатаДокумента); //Гудкова ошибка ТекущаяДата());
	КратностьВзаиморасчетов = РезультатВалюта.Кратность;
	КурсВзаиморасчетов = РезультатВалюта.Курс;
	//УчитыватьНДС = Организация.УчитыватьНДСВДокументах;
	//	СтруктураПодписантовПоДоверенности = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиДействующиеДоверенностиНаПодпись(ТекущаяДата(),"Реализация товаров и услуг");
	//	ДоверенностьЗаРуководителя = СтруктураПодписантовПоДоверенности.ДоверенностьЗаРуководителя;
	//	ДоверенностьЗаГлБухгалтера = СтруктураПодписантовПоДоверенности.ДоверенностьЗаГБ;
	//                    
	
	//ДИТ Авдеева В.С. 43329 29.04.2022 Начало      
	СтруктураРуководитель = ОтветственныеЛица_сервер.ПолучитьРуководителя(Контрагент, ТекущаяДата());
	РуководительКонтрагента = СтруктураРуководитель.Ссылка;
	//ДИТ Авдеева В.С. 43329 29.04.2022 Конец
	
	
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Евросиб Каблов 14.08.2025 ( #111016
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.НомерСтроки КАК НомерСтроки,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.СчетПокупателю КАК СчетПокупателю
	|ПОМЕСТИТЬ СчетаНаОплатуПокупателям
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.СчетаНаОплатуПокупателям КАК РеализацияТоваровУслугСчетаНаОплатуПокупателям
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетаНаОплатуПокупателям.НомерСтроки КАК НомерСтроки,
	|	СчетаНаОплатуПокупателям.СчетПокупателю КАК СчетПокупателю,
	|	СчетНаОплатуПокупателю.Проведен КАК Проведен,
	|	СчетНаОплатуПокупателю.Представление КАК Представление
	|ИЗ
	|	СчетаНаОплатуПокупателям КАК СчетаНаОплатуПокупателям
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	|		ПО СчетаНаОплатуПокупателям.СчетПокупателю = СчетНаОплатуПокупателю.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КорректировкаРеализации.Ссылка КАК Ссылка,
	|	КорректировкаРеализации.ВидОперации КАК ВидОперации,
	|	КорректировкаРеализацииСчетаНаОплатуПокупателям.СчетПокупателю КАК СчетПокупателю,
	|	ЕСТЬNULL(КорректировкаРеализацииСчетаНаОплатуПокупателям.СчетПокупателю.Проведен, ЛОЖЬ) КАК СчетПокупателюПроведен
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.СчетаНаОплатуПокупателям КАК КорректировкаРеализацииСчетаНаОплатуПокупателям
	|		ПО КорректировкаРеализации.Ссылка = КорректировкаРеализацииСчетаНаОплатуПокупателям.Ссылка
	|ГДЕ
	|	КорректировкаРеализации.ИсходныйДокументРеализации = &Реализация";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.РеализацияТоваровУслуг.СчетаНаОплатуПокупателям", "&СчетаНаОплату");	
	Запрос.УстановитьПараметр("СчетаНаОплату", СчетаНаОплатуПокупателям.Выгрузить(, "НомерСтроки, СчетПокупателю"));
	Запрос.УстановитьПараметр("Реализация", Ссылка);
	Результаты = Запрос.ВыполнитьПакет();
	
	ВыборкаСчетов = Результаты[1].Выбрать();
	Если ВыборкаСчетов.Количество() > 0 Тогда
		Пока ВыборкаСчетов.Следующий() Цикл
			Если Не ВыборкаСчетов.Проведен Тогда
				ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СчетаНаОплатуПокупателям", ВыборкаСчетов.НомерСтроки, "СчетПокупателю");
							ТекстСообщения = СтрШаблон("В строке №%1 выбран счет, который непроведен!", ВыборкаСчетов.НомерСтроки, "");
							ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКПолюТЧ, "Объект", Отказ);
			КонецЕсли;
		КонецЦикла;
	Иначе
		//Разрешать проведение РТУ без счета при наличии связного КорРТУ с видом операции:
		//    а)  Исправление в первичных документах/Корректировка по согласованию сторон и актуального счета в в нем
		//    б)  Аннулирование - без ограничений			
		РазрешитьПроведение = Ложь;
		ВыборкаКорректировок = Результаты[2].Выбрать();
		Пока ВыборкаКорректировок.Следующий() Цикл
			Если ВыборкаКорректировок.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование
					Или ВыборкаКорректировок.СчетПокупателюПроведен Тогда
				РазрешитьПроведение = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не РазрешитьПроведение Тогда
			ОбщегоНазначения.СообщитьПользователю("На вкладке ""Счета покупателям"" не привязаны счета покупателю. Для проведения добавьте хотя - бы один счет",,,, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	//Евросиб Каблов 14.08.2025 ) #111016
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
//Евросиб Гудкова( 27.08.2020 Ticket№ перенесла из ПередЗаписью, иначе не удалить старые доки
	Если ДатаДокумента > КонецМесяца(ПериодВО)  Тогда
		Сообщить("Ошибка: Дата документа не может быть больше Периода ВО");
		Отказ = Истина;
	КонецЕсли; 
// Евросиб Гудкова)
	//Евросиб Каблов 18.03.2021 (
	////Евросиб Каблов М.Б. 18.11.2019 (
	//ПараметрыКурсаРегл = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Константы.ВалютаРегламентированногоУчета.Получить(), ТекущаяДата());
	//ПараметрыКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
	////Евросиб Каблов М.Б. 18.11.2019 )
	ДатаКурсаВалют = Макс(ДатаДокумента, ПериодВО);
	ПараметрыКурсаРегл = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Константы.ВалютаРегламентированногоУчета.Получить(), ДатаКурсаВалют);
	ПараметрыКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, ДатаКурсаВалют);
	//Евросиб Каблов 18.03.2021 )
	
	//ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, начало
	ОкруглениеКурса = Справочники.ФормированиеФинДокументов.ПолучитьЗначениеОкругленияКурсаИзПравил( ПравилоФормирования );
	//ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, конец
	
	// регистр накопления СуммыРеализацийДляОтчетовПЭО Приход
//	Движения.СуммыРеализацийДляОтчетовПЭО.Записывать = Истина;
//	Движения.ВыставлениеПосуточнойАренды.Записывать = Истина;
//	
//	Для каждого Стр из РасшифровкаУслугПоТС Цикл
//		Движение 				= Движения.СуммыРеализацийДляОтчетовПЭО.Добавить();
////Евросиб Гудкова( 05.11.2020 Ticket№ 
////		Движение.Период = Дата;
//		Движение.Период = Макс(ДатаДокумента, ПериодВО);
//// Евросиб Гудкова) 	
//		Движение.ГУИДДоходов 	= Стр.СтрокаДоходовСделки;
//		Движение.Контейнер 		= Стр.Контейнер;
//		Движение.Услуга			= Стр.Услуга;
//		Если СуммаВключаетНДС Тогда
//			Движение.ЦенаБезНДС		= Стр.Цена - Стр.СуммаНДС;
//			Движение.ЦенаСНДС 		= Стр.Цена;
//		Иначе
//			Движение.ЦенаБезНДС		= Стр.Цена;
//			Движение.ЦенаСНДС 		= Стр.Цена + Стр.СуммаНДС;
//		КонецЕсли;
//		
//		// ПОВАГОНКА
//		Если ЗначениеЗаполнено(ДатаОкончанияПериодаПовагонки) И
//			ЗначениеЗаполнено(ДатаНачалаПериодаПовагонки) Тогда
//			Движение = Движения.ВыставлениеПосуточнойАренды.Добавить();
//			Движение.Период = Стр.ДатаОтправкиПовагонки;
//			Движение.НомерВагона = Стр.Вагон;
//			Движение.ГУИД = Стр.СтрокаДоходовСделки;
//			//Движение.ДатаОтправки = Стр.ДатаОтправки;
//			// если в ТЧ заполнены даты начала и окончания повагонки, то взять по ним дельту в качестве количества дней.
//			// если даты не заполнены, по ГУИД записи найти в РС запись по этому вагону, но с регистратором СДЕЛКА
//			// и взять оттуда кол-во дней
//			Если ЗначениеЗаполнено(Стр.ДатаОкончанияПериодаПовагонки) И ЗначениеЗаполнено(Стр.ДатаНачалаПериодаПовагонки) Тогда
//				КолвоДней = Окр((Стр.ДатаОкончанияПериодаПовагонки - Стр.ДатаНачалаПериодаПовагонки)/3600/24);
//			Иначе
//				КолвоДней = 0;
//				Запрос = Новый Запрос;
//				Запрос.Текст = "ВЫБРАТЬ
//				               |	ВыставлениеПосуточнойАренды.КоличествоДней КАК КоличествоДней
//				               |ИЗ
//				               |	РегистрНакопления.ВыставлениеПосуточнойАренды КАК ВыставлениеПосуточнойАренды
//				               |ГДЕ
//				               |	ВыставлениеПосуточнойАренды.ГУИД = &ГУИД
//				               |	И ВыставлениеПосуточнойАренды.НомерВагона = &НомерВагона
//				               |	И ВыставлениеПосуточнойАренды.Регистратор ССЫЛКА Документ.Сделка";
//				Запрос.УстановитьПараметр("ГУИД",Стр.СтрокаДоходовСделки);
//				Запрос.УстановитьПараметр("НомерВагона",Стр.Вагон);
//				Ответ = Запрос.Выполнить().Выбрать();
//				Если Ответ.Следующий() Тогда
//					КолвоДней = Ответ.КоличествоДней;	
//				КонецЕсли;
//			КонецЕсли;
//			
//			Движение.КоличествоДней = КолвоДней;
//		КонецЕсли;
//		
//	КонецЦикла;
	
	// регистр ВзаиморасчетыСПокупателями Приход
//Евросиб Каблов 07.10.2022 ( 54532
//	Движения.ВзаиморасчетыСПокупателями.Записывать = Истина;
//	Движение = Движения.ВзаиморасчетыСПокупателями.Добавить();
//	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
////Евросиб Гудкова( 05.11.2020 Ticket№ 
////	Движение.Период = Дата;
//	Движение.Период = Макс(ДатаДокумента, ПериодВО);
//// Евросиб Гудкова) 	
//	Движение.Организация = Организация;
//	Движение.Контрагент = Контрагент;
//	Движение.Договор = ДоговорКонтрагента;
//	Движение.ВалютаРасчетов = ВалютаДокумента;
//	Движение.ДатаРасчетов = ДатаДокумента;
//	Движение.ДокументВзаиморасчетов = Ссылка;
//	//Движение.ДокументВзаиморасчетов = СчетНаОплатуПокупателю;
//		
//	//Евросиб Каблов М.Б. 01.11.2019 ( Исправлены ошибки: СуммаБезНДС не всегда оказывалась без НДС; Суммы пересчитывались в рубли, а должны быть в валюте расчетов (измерение ВалютаРасчетов)
//	//Было
//	//Движение.СуммаБезНДС =РублеваяСумма( Товары.Итог("Сумма"))+РублеваяСумма(Услуги.Итог("Сумма"));
//	//Движение.СуммаНДС = РублеваяСумма(Товары.Итог("СуммаНДС"))+РублеваяСумма(Услуги.Итог("СуммаНДС"));
//	//Движение.СуммаСНДС = ?(СуммаВключаетНДС,РублеваяСумма(Товары.Итог("Сумма"))+РублеваяСумма(Услуги.Итог("Сумма")),РублеваяСумма(Товары.Итог("Сумма"))+РублеваяСумма(Услуги.Итог("Сумма")) + РублеваяСумма(Товары.Итог("СуммаНДС"))+РублеваяСумма(Услуги.Итог("СуммаНДС")));
//	//	
//	//Стало
//	СуммаПоДокументу = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
//	СуммаНДСПоДокументу = Товары.Итог("СуммаНДС") + Услуги.Итог("СуммаНДС");
//	
//	Движение.СуммаБезНДС = ?(СуммаВключаетНДС, СуммаПоДокументу - СуммаНДСПоДокументу, СуммаПоДокументу);
//	Движение.СуммаНДС = СуммаНДСПоДокументу;
//	Движение.СуммаСНДС = ?(СуммаВключаетНДС, СуммаПоДокументу, СуммаПоДокументу + СуммаНДСПоДокументу);
//	//Евросиб Каблов 18.03.2021 (
//	Движение.СуммаБезНДСРуб = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СуммаБезНДС, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
//	Движение.СуммаНДСРуб = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СуммаНДС, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
//	Движение.СуммаСНДСРуб = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СуммаСНДС, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
//	//Евросиб Каблов 18.03.2021 ) 
//	//Евросиб Каблов М.Б. 01.11.2019 )
	ВзаиморасчетыСервер.РеализацияТоваровУслуг_СформироватьДвиженияВзаиморасчетыСПокупателями(ЭтотОбъект);
//Евросиб Каблов 07.10.2022 ( 54532
	
//Евросиб Каблов М.Б. 18.11.2019 (
	//Продажи 
	Продажи = Движения.Продажи;
	Продажи.Записывать = Истина;
	
//Евросиб СубботинВ #84453 02.07.2024 Начало убрал за неактуальностью 
//	Для Каждого СтрокаТЧ Из Товары Цикл
//		
//		Движение = Продажи.Добавить();
////Евросиб Гудкова( 05.11.2020 Ticket№ 
////		Движение.Период = Дата;
//		Движение.Период = Макс(ДатаДокумента, ПериодВО);
//// Евросиб Гудкова) 	
//		
//		//Измерения
//		Движение.ДокументПродажи = Ссылка;
//		Движение.Организация = Организация;
//		Движение.ЦФО = ЦФО;
//		Движение.Сделка = Сделка;
//				//Движение.Продукт = 
//		Движение.Контрагент = Контрагент;
//		Движение.ДоговорКонтрагента = ДоговорКонтрагента;
//		Движение.Номенклатура = СтрокаТЧ.Номенклатура;
//		
//		//Ресурсы
//		Движение.Количество = СтрокаТЧ.Количество;
//		Движение.СтоимостьВал = ?(СуммаВключаетНДС, СтрокаТЧ.Сумма, СтрокаТЧ.Сумма + СтрокаТЧ.СуммаНДС);			
//		//Движение.Стоимость = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СтоимостьВал, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
//		//Движение.НДС = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(СтрокаТЧ.СуммаНДС, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
//		
//		//ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, начало
//		Движение.Стоимость = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СтоимостьВал, ПараметрыКурсаДокумента, ПараметрыКурсаРегл, , ОкруглениеКурса);
//		Движение.НДС = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(СтрокаТЧ.СуммаНДС, ПараметрыКурсаДокумента, ПараметрыКурсаРегл, , ОкруглениеКурса);
//		//ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, конец
//		
//	КонецЦикла;
	//Евросиб СубботинВ #84453 02.07.2024 Конец

	
	Для Каждого СтрокаТЧ Из Услуги Цикл
		
		Движение = Продажи.Добавить();
//Евросиб Гудкова( 05.11.2020 Ticket№ 
//		Движение.Период = Дата;
		Движение.Период = Макс(ДатаДокумента, ПериодВО);
// Евросиб Гудкова) 	
		
		//Измерения
		Движение.ДокументПродажи = Ссылка;
		Движение.Организация = Организация;
		Движение.ЦФО = ЦФО;
		//Евросиб СубботинВ #84453 02.07.2024 Начало //получение сделки
		//Движение.Сделка = Сделка; 
		Движение.Сделка = СтрокаТЧ.Сделка; 
		//Евросиб СубботинВ #84453 02.07.2024 Конец

		//Движение.Продукт = 
		Движение.Контрагент = Контрагент;
		Движение.ДоговорКонтрагента = ДоговорКонтрагента;
		Движение.Номенклатура = СтрокаТЧ.Номенклатура;
		
		//Ресурсы
		Движение.Количество = СтрокаТЧ.Количество;
		Движение.СтоимостьВал = ?(СуммаВключаетНДС, СтрокаТЧ.Сумма, СтрокаТЧ.Сумма + СтрокаТЧ.СуммаНДС);			
		//Движение.Стоимость = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СтоимостьВал, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
		//Движение.НДС = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(СтрокаТЧ.СуммаНДС, ПараметрыКурсаДокумента, ПараметрыКурсаРегл);
		
		//ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, начало
		Движение.Стоимость = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Движение.СтоимостьВал, ПараметрыКурсаДокумента, ПараметрыКурсаРегл, , ОкруглениеКурса);
		Движение.НДС = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(СтрокаТЧ.СуммаНДС, ПараметрыКурсаДокумента, ПараметрыКурсаРегл, , ОкруглениеКурса);
		//ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, конец
		
	КонецЦикла;
//Евросиб Каблов М.Б. 18.11.2019 )

	//Евросиб Каблов 28.11.2025 ( #111016
	//Движения.СчетаПокупателей.Записывать = Истина;
	//Евросиб Каблов 28.11.2025 ) #111016
	ТаблицаДвижения = ПолучитьТаблицуДвиженийСчетаПокупателей();
	Для каждого СтрокаТаблицаДвижения Из ТаблицаДвижения Цикл
		Движение = Движения.СчетаПокупателей.ДобавитьРасход();
		ЗаполнитьЗначенияСвойств(Движение, СтрокаТаблицаДвижения);
	КонецЦикла;
	
	//Евросиб Каблов 28.11.2025 ( #111016
	Движения.СчетаПокупателей.Записать();
	ПроверитьОстаткиПоСчетамПокупателей(Отказ);
	//Евросиб Каблов 28.11.2025 ) #111016
	
	//Евросиб Каблов 31.08.2023 ( #68187
	Движения.СчетаПокупателейПоУчетнымЕдиницам.Записывать = Истина;
	ТаблицаДвижения = ПолучитьТаблицуДвиженийСчетаПокупателейПоУчетнымЕдиницам();
	Для каждого СтрокаТаблицаДвижения Из ТаблицаДвижения Цикл
		Движение = Движения.СчетаПокупателейПоУчетнымЕдиницам.ДобавитьРасход();
		ЗаполнитьЗначенияСвойств(Движение, СтрокаТаблицаДвижения);
	КонецЦикла;
	//Евросиб Каблов 31.08.2023 )
	
	//Евросиб - АСуслов 29.08.2021 13:23:38 #33698
	//(
	УчетДоходовРасходовСервер.РТУ_СформироватьДвиженияДоходыРасходы(ЭтотОбъект);
	//)
	//Евросиб - АСуслов 29.08.2021 13:23:44 #33698
	
	СчФ = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(Ссылка,"СчетФактураВыданный");
	Если СчФ <> Неопределено Тогда
		ОбСчФ = СчФ.ПолучитьОбъект();
		Если Не ОбСчФ.ПометкаУдаления Тогда
			ОбСчФ.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЕСли;
	
	//ДИТ Пак И.Т. Task34826 24.05.2021 Начало
	Если Не Отказ Тогда
		РегистрыСведений.ОтгрузочнаяИнформация.СоздатьДвиженияДокументаРеализацияТоваровУслуг(ЭтотОбъект.Ссылка, Движения.ОтгрузочнаяИнформация);
	КонецЕсли;
	//ДИТ Пак И.Т. Task34826 24.05.2021 Конец
	
	// ДИТ Поморцева Т.П. Задача 34586 13.07.2021
	РегистрыСведений.КонтрольПолученияДокументовНДС0.СоздатьДвиженияДокументаРеализацияТоваровУслуг(Ссылка);
	
	////Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, начало
	//Если СчетаНаОплатуПокупателям.Количество()>0 Тогда
	//	ПервыйСчетПокупателю = СчетаНаОплатуПокупателям[0].СчетПокупателю;
	//	ГруппаДКССчета = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьГруппуДКСпоДокументу(ПервыйСчетПокупателю);
	//	РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьГруппуДКСпоДокументу(ПервыйСчетПокупателю, ГруппаДКССчета);
	//	
	//	//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, начало
	//	ВидЗадолженностиСчета = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьВидЗадолженностиПоДокументу(ПервыйСчетПокупателю);
	//	РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьВидЗадолженностиПоДокументу(ПервыйСчетПокупателю, ВидЗадолженностиСчета);
	//	//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, конец
	//	
	//КонецЕсли;
	////Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, конец
	
	//ДИТ Шевченко А.В. 17.01.2024 US 91366 TA 93137 -начало
	Если СчетаНаОплатуПокупателям.Количество()>0 Тогда
		ПервыйСчетПокупателю = СчетаНаОплатуПокупателям[0].СчетПокупателю;		
		ТранзитДляКлиента = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьТранзитДляКлиентаПоДокументу(ПервыйСчетПокупателю);		
		РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьТранзитДляКлиентапоДокументу(Ссылка, ТранзитДляКлиента);		
	КонецЕсли;
	//ДИТ Шевченко А.В. 17.01.2024 US 91366 TA 93137 -конец
	
	// Евросиб US 114211 TA 118161 Рыбьяков К.А. 31.08.2025 ((
	РегистрыСведений.ЗакрывающиеДокументыПоКлючамСоставаПоезда.ОтразитьДвиженияПоЗакрывающимДокументам(ЭтотОбъект, Движения.ЗакрывающиеДокументыПоКлючамСоставаПоезда);
	// Евросиб Рыбьяков К.А. 31.08.2025 ))
КонецПроцедуры

Функция ПолучитьТаблицуДвиженийСчетаПокупателей()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателей.Ссылка.Организация КАК Организация,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателей.Ссылка.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателей.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	//Евросиб Каблов 28.11.2025 ( #111016
	//|	РеализацияТоваровУслугСчетаНаОплатуПокупателей.Сделка КАК Сделка,
	//Евросиб Каблов 28.11.2025 ) #111016
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателей.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателей.Сумма КАК Сумма,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателей.СчетПокупателю КАК СчетПокупателю,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателей.Ссылка.Дата КАК Период
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.СчетаНаОплатуПокупателям КАК РеализацияТоваровУслугСчетаНаОплатуПокупателей
	|ГДЕ
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателей.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();	
	
КонецФункции

//Евросиб Каблов 31.08.2023 #68187
Функция ПолучитьТаблицуДвиженийСчетаПокупателейПоУчетнымЕдиницам()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателей.Ссылка.Организация КАК Организация,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателей.Ссылка.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателей.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателей.Сделка КАК Сделка,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателей.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателей.Контейнер КАК Контейнер,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателей.СчетПокупателю КАК СчетПокупателю,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателей.Ссылка.Дата КАК Период,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателей.Сумма КАК Сумма,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателей.Количество КАК Количество
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.СчетаНаОплатуПокупателям КАК РеализацияТоваровУслугСчетаНаОплатуПокупателей
	|ГДЕ
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателей.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();	
	
КонецФункции

//Функция РублеваяСумма(ИсхСумма) //ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, не используется, закомментировал
//	ВалютаРег = Константы.ВалютаРегламентированногоУчета.Получить();
//	Если ВалютаДокумента <> ВалютаРег Тогда
//		СуммаРуб = РаботаСКурсамиВалют.ПересчитатьВВалюту(ИсхСумма,ВалютаДокумента,ВалютаРег,ДатаДокумента);
//		Возврат СуммаРуб;
//	Иначе
//		Возврат ИсхСумма;
//	КонецЕсли;
//КонецФункции

Процедура ПриЗаписи(Отказ)
	
	//Евросиб(ДИТ), Беляев СЮ, US 107078 / TA 107148, 11-04-2025, начало (перенес из Обработки проведения, чтобы при загрузки из РИТМ работало)
	//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, начало
	Если СчетаНаОплатуПокупателям.Количество()>0 Тогда
		ПервыйСчетПокупателю = СчетаНаОплатуПокупателям[0].СчетПокупателю;
		ГруппаДКССчета = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьГруппуДКСпоДокументу(ПервыйСчетПокупателю);
		РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьГруппуДКСпоДокументу(ПервыйСчетПокупателю, ГруппаДКССчета);
		
		//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, начало
		ВидЗадолженностиСчета = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьВидЗадолженностиПоДокументу(ПервыйСчетПокупателю);
		РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьВидЗадолженностиПоДокументу(ПервыйСчетПокупателю, ВидЗадолженностиСчета);
		//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, конец
		
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 90649 / TA 93760, 02-11-2024, конец
	//Евросиб(ДИТ), Беляев СЮ, US 107078 / TA 107148, 11-04-2025, конец
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Евросиб Каблов 18.11.2021 ( Task 41795
	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Документы.Акцепт.ПерезаполнитьВАкцептеДанныеПоУчДокументу(Ссылка);
	КонецЕсли;
	//Евросиб Каблов 18.11.2021 )
	
	//Евросиб Каблов 28.07.2020 ( При установке признака Выставлен, не нужно записывать Счет-фактуру
	ЗапретитьЗаписыватьСчетФактуру = Неопределено;
	Если Не ДополнительныеСвойства.Свойство("ЗапретитьЗаписыватьСчетФактуру", ЗапретитьЗаписыватьСчетФактуру) Тогда
		ЗапретитьЗаписыватьСчетФактуру = Ложь;
	КонецЕсли;
	
	Если Не ЗапретитьЗаписыватьСчетФактуру Тогда
		//Евросиб Каблов 08.07.2021 ( Ticket#0231661 Этот же код выполняется ниже
		//СнятьПризнакВыставленУСчетаФактуры = Неопределено;
		//Если Не ДополнительныеСвойства.Свойство("СнятьПризнакВыставленУСчетаФактуры", СнятьПризнакВыставленУСчетаФактуры) Тогда
		//	СнятьПризнакВыставленУСчетаФактуры = Ложь;
		//КонецЕсли;
		//Евросиб Каблов 08.07.2021 )
	//Евросиб Каблов 28.07.2020 )
		Счетфактура = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(ЭтотОбъект.Ссылка,"СчетФактураВыданный");
		Если СчетФактура<>Неопределено Тогда
			ОбСчФ = Счетфактура.ПолучитьОбъект();
			//Евросиб Каблов 28.07.2020 ( 
			Если ОбСчф.Выставлен Тогда
				СнятьПризнакВыставленУСчетаФактуры = Неопределено;
				Если ДополнительныеСвойства.Свойство("СнятьПризнакВыставленУСчетаФактуры", СнятьПризнакВыставленУСчетаФактуры) И СнятьПризнакВыставленУСчетаФактуры Тогда
					ОбСчф.Выставлен = Ложь;
					ОбСчф.ДатаВыставления = '00010101';
					//Евросиб Каблов 08.07.2021 ( Ticket#0231661
					Диадок_Сервер.ОтвязатьДокумент1СОтДокументовПакетовДиадок(ОбСчф.Ссылка);
					//Евросиб Каблов 08.07.2021 )
				КонецЕсли;
			КонецЕсли;
			//Евросиб Каблов 28.07.2020 )
			//Евросиб - АСуслов 22.07.2021 13:03:03 #
			//(
			БухгалтерскийУчетОбщиеПроцедурыСервер.ЗаполнитьРеквизитыСчФПоОснованию(ЭтотОбъект.Ссылка,ОбСчФ);
			//Евросиб - АСуслов 22.07.2021 13:03:05 #
			//Евросиб Каблов 28.07.2020 ( в процедуре ЗаполнитьРеквизитыСчФПоОснованию Счет-фактура записывается
			//ОбСчФ.Записать();
			//Евросиб Каблов 28.07.2020 )
		КонецЕсли;
	//Евросиб Каблов 28.07.2020 (
	КонецЕсли;

	//Евросиб Каблов 28.07.2020 )
	
	//Евросиб Каблов 29.08.2022 ( 56025
	Если ЗначениеЗаполнено(Реестр) Тогда
		
		Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда		
			
			МаршрутизацияСервер.ОтметитьВыполнениеЗадачПоСсылке(Реестр, Неопределено);
			
		ИначеЕсли ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РеестрыСогласованияСостояния.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.РеестрыСогласования.Состояния КАК РеестрыСогласованияСостояния
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК ДругаяПроведеннаяРеализация
			|		ПО РеестрыСогласованияСостояния.Ссылка = ДругаяПроведеннаяРеализация.Реестр
			|			И (ДругаяПроведеннаяРеализация.Ссылка <> &ЭтаРеализация)
			|			И (ДругаяПроведеннаяРеализация.Проведен)
			|ГДЕ
			|	РеестрыСогласованияСостояния.Ссылка = &Реестр
			|	И РеестрыСогласованияСостояния.Статус = &СтатусВыполнен
			|	И ДругаяПроведеннаяРеализация.Ссылка ЕСТЬ NULL";
			Запрос.УстановитьПараметр("Реестр", Реестр);
			Запрос.УстановитьПараметр("ЭтаРеализация", Ссылка);
			СтатусВыполнен = Перечисления.СтатусыЭтапов.Выполнен;
			Запрос.УстановитьПараметр("СтатусВыполнен", СтатусВыполнен);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если Не РезультатЗапроса.Пустой() Тогда
				РеестрОбъект = Реестр.ПолучитьОбъект();
				СтатусНовый = Перечисления.СтатусыЭтапов.Новый;
				Для Каждого Стр Из РеестрОбъект.Состояния Цикл
					Если Стр.Статус = СтатусВыполнен Тогда
						Стр.Статус = СтатусНовый;
					КонецЕсли;
				КонецЦикла;
				РеестрОбъект.Записать();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	//Евросиб Каблов 29.08.2022 )
	
	//Евросиб Шевченко А.В. 24.06.2025 US 104900 TA 112049 -начало
	Если ДополнительныеСвойства.Свойство("НеОтслеживать") Тогда
		РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьНеОтслеживатьПоДокументу(Ссылка, ДополнительныеСвойства.НеОтслеживать);
	КонецЕсли;
	Если ДополнительныеСвойства.Свойство("ВРаботеПоСтатусуОтправкиИПодписания") Тогда
		РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьВРаботеПоСтатусуОтправкиИПодписанияПоДокументу(Ссылка, ДополнительныеСвойства.ВРаботеПоСтатусуОтправкиИПодписания);
	КонецЕсли;	
	//Евросиб Шевченко А.В. 24.06.2025 US 104900 TA 112049 -конец
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Евросиб Каблов 18.11.2021 ( Task 41795
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	//Евросиб Каблов 18.11.2021 )
	
	//Евросиб Каблов 02.12.2020 ( Ticket#0215459 Проверка вызывается из обработчика ПередЗаписьюНаСервере формы документа
	////Евросиб Каблов 18.09.2020 (
	//КонтрольДоступностиДокументов_сервер.ПроверитьДоступностьПолейДляИзменения(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	//Если Отказ Тогда
	//	Возврат;
	//КонецЕсли;
	////Евросиб Каблов 18.09.2020 )
	//Евросиб Каблов 02.12.2020 )
	
	//Евросиб Каблов 05.02.2021 (
	Если Не ЭтоНовый() И ПометкаУдаления Тогда
		// Евросиб Фролов (06.05.2022 Ticket №0269237
		// Создал общую функцию, т.к. такая же проверка нужна при загрузке ИСФ
		МассивДокументов = Новый Массив;
		МассивДокументов.Добавить(Ссылка);
		ДокументыСКорректировкой = Документы.РеализацияТоваровУслуг.ДокументыСКорректировкойДолга(МассивДокументов);
		Если ДокументыСКорректировкой.Найти(Ссылка) <> Неопределено Тогда
			ТекстСообщения = СтрШаблон("По документу %1 есть проведенные корректировки долга! Пометка удаления отменена.", Ссылка);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;	
		//Запрос = Новый Запрос;
		//Запрос.Текст =
		//"ВЫБРАТЬ
		//|	КорректировкаДолгаДебиторскаяЗадолженность.Ссылка КАК Ссылка
		//|ИЗ
		//|	Документ.КорректировкаДолга.ДебиторскаяЗадолженность КАК КорректировкаДолгаДебиторскаяЗадолженность
		//|ГДЕ
		//|	КорректировкаДолгаДебиторскаяЗадолженность.Сделка = &Сделка
		//|	И КорректировкаДолгаДебиторскаяЗадолженность.Ссылка.Проведен
		//|
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		//|ВЫБРАТЬ
		//|	КорректировкаДолгаКредиторскаяЗадолженность.Ссылка
		//|ИЗ
		//|	Документ.КорректировкаДолга.КредиторскаяЗадолженность КАК КорректировкаДолгаКредиторскаяЗадолженность
		//|ГДЕ
		//|	КорректировкаДолгаКредиторскаяЗадолженность.Сделка = &Сделка
		//|	И КорректировкаДолгаКредиторскаяЗадолженность.Ссылка.Проведен";
		//Запрос.УстановитьПараметр("Сделка", Ссылка);
		//РезультатЗапроса = Запрос.Выполнить();
		//Если Не РезультатЗапроса.Пустой() Тогда
		//	ТекстСообщения = СтрШаблон("По документу %1 есть проведенные корректировки долга! Пометка удаления отменена.", Ссылка);
		//	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		//КонецЕсли;
		// Евросиб Фролов)
	КонецЕсли; 
	//Евросиб Каблов 05.02.2021 )
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	ПериодВО = НачалоМесяца(ПериодВО);
	Если Не БезДоверенностей Тогда
//Евросиб Гудкова( 15.02.2021 Ticket№ 0223421
//		СтруктураПодписантовПоДоверенности = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиДействующиеДоверенностиНаПодпись(Дата,"Реализация",ЦФО);
		СтруктураПодписантовПоДоверенности = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиДействующиеДоверенностиНаПодпись(ДатаДокумента,"Реализация",ЦФО);
// Евросиб Гудкова) 		
		ДоверенностьЗаРуководителя = СтруктураПодписантовПоДоверенности.ДоверенностьЗаРуководителя;
		ДоверенностьЗаГлБухгалтера = СтруктураПодписантовПоДоверенности.ДоверенностьЗаГБ;
	КонецЕсли;
	
	// перезапишем дату, т.к. могли быть добавлены новые документы
	//Если НЕ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
	//	ДатаДокумента = ФормированиеДатДокументов.УстановкаДатыДокумента(ЭтотОбъект,ДоговорКонтрагента.ПравилоФормированияДатыУслуги);
	//КонецЕсли;
	// + Состояния
	
	// проверяем корректность перечня состояний в ТЧ Состояния
	Для Сч = 0 По Состояния.Количество() - 2 Цикл
		ТекСостояние = Состояния[Сч].Состояние;
		Для ТекСч = Сч + 1 По Состояния.Количество() - 1 Цикл
			Если Состояния[ТекСч].Состояние = ТекСостояние Тогда
				Сообщить("Ошибка: одно состояние может встречаться в документе только один раз!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
		
	// для состояний отражаем логику движения статусов
	//Для Сч = 0 По Состояния.Количество() - 2 Цикл
	//	Если Состояния[Сч].Статус = Перечисления.СтатусыЭтапов.Выполнен И Состояния[Сч+1].Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//		Состояния[Сч+1].Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//		Если НЕ ЗначениеЗаполнено(Состояния[Сч+1].Исполнитель) Тогда
	//			Состояния[Сч+1].Исполнитель = Пользователи.ТекущийПользователь();
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	
	//++ Зубов 35844 05.08.2021
	////Стаценко Параллельное согласование
	//Для каждого СтрТЧ из Состояния Цикл
	//	Если Не ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//		СтрТЧ.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(СтрТЧ.ПредыдущиеЭтапы) и СтрТЧ.Статус = Перечисления.СтатусыЭтапов.Новый Тогда
	//        ПредыдущиеЭтапы = СтрТЧ.ПредыдущиеЭтапы;
	//		Попытка
	//			МассивЭтапов = СтрРазделить(ПредыдущиеЭтапы,",",Ложь);
	//		Исключение
	//			Сообщить("Некорректная строка предыдущих этапов");
	//		КонецПопытки;
	//		ВозможноВыполнение = Истина;
	//		Если МассивЭтапов.Количество() > 0 Тогда
	//			Для каждого Эл из МассивЭтапов Цикл
	//				Попытка
	//					НомСтр = Число(Эл);
	//					СтрЭтапа = Состояния.Найти(НомСтр,"НомерСтроки");
	//					Если СтрЭтапа <> Неопределено Тогда
	//						Если СтрЭтапа.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//							ВозможноВыполнение = Ложь;
	//						КонецЕсли;
	//					КонецЕсли;
	//				Исключение
	//					Сообщить("Некорректное указание этапа состояние. Возможен только ввод цифр.");
	//				КонецПопытки
	//			КонецЦикла;
	//		КонецЕсли;
	//		Если ВозможноВыполнение Тогда
	//			СтрТЧ.Статус =  Перечисления.СтатусыЭтапов.НаВыполнение;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	////Стаценко
	//МаршрутизацияСервер.ПараллельноеСогласование(Состояния); //ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, закомментировал (перенёс ниже)
	//-- Зубов 35844 05.08.2021
	
	// Маршрутизация заказа
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = 
	НЕ ЗначениеЗаполнено(Ссылка) ИЛИ 
	Ссылка.Организация <> Организация ИЛИ 
	Ссылка.Контрагент <> Контрагент ИЛИ
	Ссылка.ДоговорКонтрагента <> ДоговорКонтрагента ИЛИ Состояния.Количество() = 0;
	
	//++ Зубов 36879 12.08.2021
	Если ЗначениеЗаполнено(Ссылка) И ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,"ДатаДокумента").ДатаДокумента<>ДатаДокумента Тогда
		ДатаДокументаИзменена = Истина;
		ДляДанногоОбъектаТребуетсяПеремаршрутизация = Истина;
		// Евросиб US 89967 TA 91565 Рыбьяков К.А. 02.11.2024 ((
		Если ЗначениеЗаполнено(ДатаЗапретаПечатиИОтправкиПоЭДО) 
			И ДатаЗапретаПечатиИОтправкиПоЭДО > ТекущаяДатаСеанса() Тогда
			ДатаДокументаИзмененаСЗапретомНаПечать = Истина;
		КонецЕсли;
		// Евросиб Рыбьяков К.А. 02.11.2024 ))
	Иначе
		ДатаДокументаИзменена = Ложь;
		// Евросиб US 89967 TA 91565 Рыбьяков К.А. 08.11.2024 ((
		ДатаДокументаИзмененаСЗапретомНаПечать = Ложь;
		// Евросиб Рыбьяков К.А. 08.11.2024 ))
	КонецЕсли;
	//-- Зубов 36879 12.08.2021
	
	//Евросиб СубботинВ #117888 09.09.2025 Начало
	//Если Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
	Если Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация и РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда	
	//Евросиб СубботинВ #117888 09.09.2025 Начало

		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Контрагент);
		ПараметрыЗапроса.Вставить("Договор", ДоговорКонтрагента);
//Евросиб Гудкова( 12.09.2020 Ticket№ 0206196
		ПараметрыЗапроса.Вставить("ЭДО", Обработки.ДД_подключаемыйМодуль.ЕстьЭДОСКонтрагентом(Контрагент));
		ПараметрыЗапроса.Вставить("ЦФО", ЦФО);
// Евросиб Гудкова) 
//Евросиб Максимова
        ПараметрыЗапроса.Вставить("ОплатаОригинал",ДоговорКонтрагента.ОплатаПоОригиналу);
//Евросиб Максимова
		//++ Зубов 36879 12.08.2021
		ПараметрыЗапроса.Вставить("ДатаДокументаИзменена",ДатаДокументаИзменена);
		//-- Зубов 36879 12.08.2021
		// Евросиб US 89967 TA 91565 Рыбьяков К.А. 02.11.2024 ((
		ПараметрыЗапроса.Вставить("ДатаДокументаИзмененаСЗапретомНаПечать", ДатаДокументаИзмененаСЗапретомНаПечать);
		// Евросиб Рыбьяков К.А. 02.11.2024 ))
РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьРТУ(ПараметрыЗапроса, Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			УказанныеВручнуюИспНаблюдатель = Новый СписокЗначений;
			Если ДополнительныеСвойства.Свойство("ДопСвойстваОбъекта") тогда
				УказанныеВручнуюИспНаблюдатель = ДополнительныеСвойства.ДопСвойстваОбъекта;
			КонецЕсли;
			МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъект, РезультатЗапроса, Автор, УказанныеВручнуюИспНаблюдатель);			
		КонецЕсли;
	КонецЕсли;
	
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, начало
	МаршрутизацияСервер.ПараллельноеСогласование(Состояния);
	//ДИТ, Беляев СЮ, Ticket#0344187, 06-03-2024, конец
	
	МаршрутизацияСервер.ПостобработкаТЧСостояний(ЭтотОбъект, Автор);
	
	// если исполнитель пустой, то проставляем тек пользователя
	Для каждого Стр из Состояния Цикл
		Если Стр.ПримечаниеЗадачаИсполнителю Тогда
			// если текст примечания изменился, то создать новое сообщение. если остался прежним, то не менять
			// т.к. состояние уникально, ищем по нему
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Состояние",Стр.Состояние);
			НайденнаяСтр = Ссылка.Состояния.НайтиСтроки(ПараметрыОтбора);
			Если НайденнаяСтр.Количество()>0 Тогда
				Если НЕ НайденнаяСтр[0].Комментарий = Стр.Комментарий Тогда
					
					// +Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					ДатаСообщения = ТекущаяДата();
					АвторСообщения = Пользователи.ТекущийПользователь();
					ТекстСообщения = Стр.Комментарий;
					ГУИДСообщения = Новый УникальныйИдентификатор();
					
					ГУИДТемы = Новый УникальныйИдентификатор;
					
					РассылкаПоЛичнымЦелям.СформироватьЛичноеСообщение(ГУИДТемы, , Ссылка, ДатаСообщения, АвторСообщения, ТекстСообщения, , ГУИДСообщения, Стр.Исполнитель);
					// -Шейко ОЕ [Ticket#0204385] Личные сообщения пользователям
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// определяем текущее состояние. для нас это первое состояние не в "выполнено"
	//Для каждого Состояние из Состояния Цикл
	//	Если Состояние.Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
	//		ТекущееСостояние = Состояние.Состояние;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	
	
	
	// - Состояния
	
	// в регистре повагонных отправко для всех вагонов, которые есть в данной реализации снять/установить флаги создания РТУ
	// в зависимости от услуги
	Если ПометкаУдаления <> Ссылка.ПометкаУдаления Тогда
		УслугаПовагонки = Константы.УслугаДляПовагоннойЗаявки.Получить();
		УслугаСНП = Константы.УслугаСНППоВагону.Получить();
		
		Запрос = Новый Запрос;
		//Евросиб СубботинВ #84453 02.07.2024 Начало // поменял запрос на получени сделок из тч услуг
		//Запрос.Текст = "ВЫБРАТЬ
		//       |	ПовагонныеОтправкиСрезПоследних.Период КАК Период,
		//       |	ПовагонныеОтправкиСрезПоследних.Вагон КАК Вагон
		//       |ИЗ
		//       |	РегистрСведений.ПовагонныеОтправки.СрезПоследних(
		//       |			,
		//       |			Сделка = &Сделка
		//       |				И (рту ИЛИ РТУСНППогрузки ИЛИ РТУСНПВыгрузки ИЛИ РТУСНППеревозки)) КАК ПовагонныеОтправкиСрезПоследних";
       		
		Запрос.Текст = "ВЫБРАТЬ
		               |	вт_Сделки.Сделка КАК Сделка
		               |ПОМЕСТИТЬ ВТ_Сделка
		               |ИЗ
		               |	&вт_Сделки КАК вт_Сделки
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ПовагонныеОтправкиСрезПоследних.Период КАК Период,
		               |	ПовагонныеОтправкиСрезПоследних.Вагон КАК Вагон
		               |ИЗ
		               |	РегистрСведений.ПовагонныеОтправки.СрезПоследних(
		               |			,
		               |			Сделка В
		               |					(ВЫБРАТЬ
		               |						ВТ_Сделка.Сделка КАК Сделка
		               |					ИЗ
		               |						ВТ_Сделка КАК ВТ_Сделка)
		               |				И (рту
		               |					ИЛИ РТУСНППогрузки
		               |					ИЛИ РТУСНПВыгрузки
		               |					ИЛИ РТУСНППеревозки)) КАК ПовагонныеОтправкиСрезПоследних";
		
		//Запрос.УстановитьПараметр("Сделка",Сделка);
		 ТчУслуг = Услуги.ВыгрузитьКолонки("Сделка");
		 ТчУслуг.Свернуть("Сделка");
		 Запрос.УстановитьПараметр("вт_Сделки", ТчУслуг);
		//Евросиб СубботинВ #84453 02.07.2024 Конец		Ответ = Запрос.Выполнить().Выбрать();
		Ответ = Запрос.Выполнить().Выбрать();

		Пока Ответ.Следующий() Цикл
			// для каждой записи регистра проверяем, что именно заполнено в документе РТУ (таблица РасшифровкаПоТС)
			// для того, чтобы проставить флаги выставленных документов
			
			ТекЗапись = РегистрыСведений.ПовагонныеОтправки.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(ТекЗапись,Ответ);
			ТекЗапись2 = РегистрыСведений.ПовагонныеОтправки.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(ТекЗапись2, ТекЗапись);
			
			ТекЗапись.Прочитать();
			Если НЕ ТекЗапись.Выбран() Тогда
				ЗаполнитьЗначенияСвойств(ТекЗапись, ТекЗапись2);
			КонецЕсли;
			
			Для Каждого Стр Из РасшифровкаУслугПоТС Цикл
				Если Стр.Вагон = ТекЗапись.Вагон Тогда
					Если Стр.Услуга = УслугаПовагонки Тогда
						ТекЗапись.РТУ = НЕ ПометкаУдаления;
					ИначеЕсли Стр.Услуга = УслугаСНП И Стр.Комментарий = "СНП погрузки" Тогда
						ТекЗапись.РТУСНППогрузки = НЕ ПометкаУдаления;	
					ИначеЕсли Стр.Услуга = УслугаСНП И Стр.Комментарий = "СНП выгрузки" Тогда
						ТекЗапись.РТУСНПВыгрузки = НЕ ПометкаУдаления;	
					ИначеЕсли Стр.Услуга = УслугаСНП И Стр.Комментарий = "СНП следования" Тогда
						ТекЗапись.РТУСНППеревозки = НЕ ПометкаУдаления;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
				
			ТекЗапись.Записать();
		КонецЦикла;
	
		
		
	КонецЕсли;
	
	СформироватьНомерДляПечати();
	
	// Евросиб Фролов (15.03.2022 Task №40571
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		РаботаСТабличнымиЧастями.ПроверитьКоличествоВТабличнойЧасти(Услуги, "Услуги", Отказ,, ЭтотОбъект);
		// Евросиб BUG 85420 TA 86264 Рыбьяков К.А. 09.07.2024 ((
		ОтложенноеИзменениеСервер.ПоставитьСвязанныеОбъектыВОчередьИзменения(ЭтотОбъект);
		// Евросиб Рыбьяков К.А. 09.07.2024 ))
	КонецЕсли;	
	// Евросиб Фролов)
	
	//80515 Субботин 14.02.2024 начало
	ШтрафнаяРТУ = Ложь;
	НеШтрафнаяГруппа = Неопределено ;
	Для Каждого СтрокаУслуг Из Услуги  Цикл
		ГруппаНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаУслуг.Номенклатура,"Родитель");
		ГруппаШтрафов = Константы.ГруппаНоменклатурыШтраф.Получить();
		Если ГруппаНоменклатуры = ГруппаШтрафов Тогда 
			ШтрафнаяРТУ = Истина;
		Иначе 
			НеШтрафнаяГруппа = ?(ЗначениеЗаполнено(ГруппаНоменклатуры), ГруппаНоменклатуры,Справочники.Номенклатура.ПустаяСсылка());
		КонецЕсли;
	КонецЦикла;
	
	Если ШтрафнаяРТУ и НЕ НеШтрафнаяГруппа = Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю("В штрафной РТУ допускается только номенклатура из группы Штрафы, Претензии, Убытки, Сборы",,,,Отказ);				
			Возврат
	КонецЕсли;
		
	Если ЭтоНовый() Тогда 
		Штраф = ШтрафнаяРТУ;
	КонецЕсли;
	//80515 Субботин 14.02.2024 Конец
	
	//Евросиб СубботинВ #88804 12.08.2024 Начало
	МассивЗаказов = Новый Массив;
	Для каждого СтрокаТЧ из ЗаказыРитм Цикл 
		МассивЗаказов.Добавить("" + СтрокаТЧ.Номер + "/" + Формат(СтрокаТЧ.ГодЗаказа,"ДФ=yyyy"));
	КонецЦикла;	
	ЗаказРитм = СтрСоединить(МассивЗаказов,";");
	//Евросиб СубботинВ #88804 12.08.2024 Начало
	
	//Евросиб Шевченко А.В. 24.06.2025 US 104900 TA 112049 -начало
	Если ЭтоНовый() Тогда
		Если НЕ ДополнительныеСвойства.Свойство("НеОтслеживать") Тогда
			Если ЗначениеЗаполнено(ДатаЗапретаПечатиИОтправкиПоЭДО) Тогда
				ДополнительныеСвойства.Вставить("НеОтслеживать",Истина);
				ДополнительныеСвойства.Вставить("ВРаботеПоСтатусуОтправкиИПодписания",Перечисления.СтатусыОтправкиИПодписанияРТУ.ДокументНеВРаботеИНеТребуетНачалаРаботы);
			ИначеЕсли Штраф Тогда
				ДополнительныеСвойства.Вставить("НеОтслеживать",Истина);
				ДополнительныеСвойства.Вставить("ВРаботеПоСтатусуОтправкиИПодписания",Перечисления.СтатусыОтправкиИПодписанияРТУ.ДокументНеВРаботеИНеТребуетНачалаРаботы);
			ИначеЕсли ДоговорКонтрагента.ПричинаОтказаОтЭДО = Перечисления.ПричинаОтказаОтЭДО.ИндивидуальнаяОтправкаРТУВДругиеСистемыЭДОКАПоДаннымОРК Тогда
				ДополнительныеСвойства.Вставить("НеОтслеживать",Истина);
				ДополнительныеСвойства.Вставить("ВРаботеПоСтатусуОтправкиИПодписания",Перечисления.СтатусыОтправкиИПодписанияРТУ.ДокументНеВРаботеИНеТребуетНачалаРаботы);
			Иначе
				ДополнительныеСвойства.Вставить("НеОтслеживать",Ложь);
			КонецЕсли;
		КонецЕсли;			
	КонецЕсли;
	Если НЕ ДополнительныеСвойства.Свойство("ВРаботеПоСтатусуОтправкиИПодписания") Тогда
		ДополнительныеСвойства.Вставить("ВРаботеПоСтатусуОтправкиИПодписания",Перечисления.СтатусыОтправкиИПодписанияРТУ.ДокументНеВРаботеИНеТребуетНачалаРаботы);
	КонецЕсли;
	Если НЕ ДополнительныеСвойства.Свойство("НеОтслеживать") Тогда
		Если ЗначениеЗаполнено(ДатаЗапретаПечатиИОтправкиПоЭДО) Тогда
			ДополнительныеСвойства.Вставить("НеОтслеживать",Истина);
			ДополнительныеСвойства.Вставить("ВРаботеПоСтатусуОтправкиИПодписания",Перечисления.СтатусыОтправкиИПодписанияРТУ.ДокументНеВРаботеИНеТребуетНачалаРаботы);
		ИначеЕсли Штраф Тогда
			ДополнительныеСвойства.Вставить("НеОтслеживать",Истина);
			ДополнительныеСвойства.Вставить("ВРаботеПоСтатусуОтправкиИПодписания",Перечисления.СтатусыОтправкиИПодписанияРТУ.ДокументНеВРаботеИНеТребуетНачалаРаботы);
		ИначеЕсли ДоговорКонтрагента.ПричинаОтказаОтЭДО = Перечисления.ПричинаОтказаОтЭДО.ИндивидуальнаяОтправкаРТУВДругиеСистемыЭДОКАПоДаннымОРК Тогда
			ДополнительныеСвойства.Вставить("НеОтслеживать",Истина);
			ДополнительныеСвойства.Вставить("ВРаботеПоСтатусуОтправкиИПодписания",Перечисления.СтатусыОтправкиИПодписанияРТУ.ДокументНеВРаботеИНеТребуетНачалаРаботы);
		Иначе
			ДополнительныеСвойства.Вставить("НеОтслеживать",Ложь);
		КонецЕсли;	
	КонецЕсли;
	//Евросиб Шевченко А.В. 24.06.2025 US 104900 TA 112049 -конец
	
	//Евросиб Каблов 09.12.2025 ( #111016
	СчетаНаОплатуПокупателям.Свернуть("СчетПокупателю,Номенклатура,Контейнер,ВидДоходов", "Сумма,Количество");
	//Евросиб Каблов 09.12.2025 ) #111016
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
//Евросиб - АСуслов 08.01.2021 11:41:09 #
//(
	//НомерСчФ = НайтиСтаршийНомерСчетаФактуры();
	//
	//Если НомерСчФ = "" Тогда
	//	Возврат;
	//Иначе
	//	СтандартнаяОбработка = Ложь;
	//	Попытка
	//		ЧислоНомера = Число(НомерСчФ);
	//		СледНомер  = ЧислоНомера + 1;
	//		Номер = ПреобразоватьНомерВСтроку(СледНомер);
	//	Исключение
	//		Ош = ОписаниеОшибки();
	//		Сообщить("Произошла ошибка при установке нового номера, так как некорректный номер счета-фактуры выданного. Проверьте номера счетов-фактур за текущий год, системный номер счет-фактуры должен состоять только из цифр!");
	//	КонецПопытки;
		//СформироватьНомерДляПечати
		//СформироватьНомерДляПечати();

	//КонецЕсли;	
//)
//Евросиб - АСуслов 08.01.2021 11:41:09 #
КонецПроцедуры

Функция НайтиАвансовыйСчет(ДокСделка,Контрагент,Договор)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СчетНаОплатуПокупателюТовары.Ссылка КАК Ссылка,
	                      |	СчетНаОплатуПокупателюТовары.Сумма КАК Сумма,
	                      |	СчетНаОплатуПокупателюТовары.СтрокаДоходовСделки КАК СтрокаДоходовСделки
	                      |ИЗ
	                      |	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
	                      |ГДЕ
	                      |	СчетНаОплатуПокупателюТовары.Ссылка.Контрагент = &Контрагент
	                      |	И СчетНаОплатуПокупателюТовары.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	                      |	И СчетНаОплатуПокупателюТовары.Ссылка.Сделка = &Сделка
	                      |	И СчетНаОплатуПокупателюТовары.Ссылка.АвансовыйСчет = ИСТИНА
	                      |	И СчетНаОплатуПокупателюТовары.Ссылка.ПометкаУдаления = ЛОЖЬ");	
	Запрос.УстановитьПараметр("Сделка", ДокСделка);
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Договор);
	
	Выборка = Запрос.Выполнить().Выгрузить();
	Если Выборка.Количество() > 0 Тогда
		Возврат Выборка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции

Функция НайтиСтаршийНомерСчетаФактуры()
	НомерСФ = "";
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	МАКСИМУМ(СчетФактураВыданный.Номер) КАК Номер
	                      |ПОМЕСТИТЬ МаксНомерСФАкта
	                      |ИЗ
	                      |	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	                      |ГДЕ
	                      |	ГОД(СчетФактураВыданный.Дата) = &ТекущийГод
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	МАКСИМУМ(РеализацияТоваровУслуг.Номер)
	                      |ИЗ
	                      |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	                      |ГДЕ
	                      |	ГОД(РеализацияТоваровУслуг.Дата) = &ТекущийГод
						  //Евросиб Каблов 05.01.2020 ( Ticket#0218901
						  |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	МАКСИМУМ(КорректировкаРеализации.Номер)
	                      |ИЗ
	                      |	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	                      |ГДЕ
	                      |	ГОД(КорректировкаРеализации.Дата) = &ТекущийГод
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	МАКСИМУМ(ОтчетКомитентуОПродажах.Номер)
	                      |ИЗ
	                      |	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	                      |ГДЕ
	                      |	ГОД(ОтчетКомитентуОПродажах.Дата) = &ТекущийГод
						  //Евросиб Каблов 05.01.2020 )
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МАКСИМУМ(МаксНомерСФАкта.Номер) КАК Номер
	                      |ИЗ
	                      |	МаксНомерСФАкта КАК МаксНомерСФАкта");
	Запрос.УстановитьПараметр("ТекущийГод",Год(Дата));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НомерСФ = Выборка.Номер;
	КонецЦикла;
	Возврат НомерСФ;
	
	
КонецФункции

Функция ПреобразоватьНомерВСтроку(СлНомер)
	СтрокаНомера = Формат(СлНомер, "ЧГ=");
	Пока СтрДлина(СтрокаНомера)< 9 Цикл
		СтрокаНомера = "0"+СтрокаНомера;
	КонецЦикла;
	
	Возврат СтрокаНомера;
КонецФункции

Процедура ПриКопировании(ОбъектКопирования)
	
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Маршрутизировать = Константы.МаршрутизироватьРТУ.Получить();
	//Евросиб СубботинВ #84453 02.07.2024 Начало убрал заполнение реквизита
	//СчетНаОплатуПокупателю = Документы.СчетНаОплатуПокупателю.ПустаяСсылка();
	//Евросиб СубботинВ #84453 02.07.2024 Конец
	НомерДляПечати = "";
	Редактор = неопределено;
	Изменено = неопределено;
	Состояния.Очистить();
	ПериодВО = '00010101';
	
	//Евросиб Каблов 22.07.2020 ( TASK 23506
	Выставлен = Ложь;
	ДатаВыставления = '00010101';
	//Евросиб Каблов 11.07.2020 ) TASK 23506
	
КонецПроцедуры

//Для заполнения даты документа
Процедура УстановитьДатыДокумента() Экспорт //Гудкова
//Евросиб Гудкова( 30.10.2019 для нерезидента упрощенные правила + исправление ошибок
//и мне не платят за количество строк в коде

	//Евросиб Каблов 09.04.2025 ( #105407
	//ДатаОткрытогоПериода = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Организация);
	ДатаОткрытогоПериода = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(Организация);
	//Евросиб Каблов 09.04.2025 )
	ПериодВО = Макс(НачалоМесяца(ПериодВО), ДатаОткрытогоПериода);
	
	
	
	Если Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия Тогда
		// Евросиб Гудкова)
		//Установка даты оказания услуги
		Если ЗначениеЗаполнено(ДоговорКонтрагента.ПравилоФормированияДатыУслуги) Тогда
			Если ДоговорКонтрагента.ПравилоФормированияДатыУслуги = Перечисления.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеОтправления тогда
				МаксДатаОтправки = НайтиМаксимальнуюДатуТД("Дата");
				ДатаДокумента = МаксДатаОтправки;
				//ПериодВО = НачалоМесяца(МаксДатаОтправки);
				
			ИначеЕсли ДоговорКонтрагента.ПравилоФормированияДатыУслуги = Перечисления.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеРаскредитации Тогда
				МаксДатаОтправки = НайтиМаксимальнуюДатуТД("ДатаРаскредитации");
				ДатаДокумента = МаксДатаОтправки;
				//ПериодВО = НачалоМесяца(МаксДатаОтправки);
			ИначеЕсли ДоговорКонтрагента.ПравилоФормированияДатыУслуги = Перечисления.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеПрибытия Тогда
				МаксДатаОтправки = НайтиМаксимальнуюДатуТД("ДатаПрибытия");
				ДатаДокумента = МаксДатаОтправки;
				//ПериодВО = НачалоМесяца(МаксДатаОтправки);
			ИначеЕсли ДоговорКонтрагента.ПравилоФормированияДатыУслуги = Перечисления.СпособыОпределенияДатыДокументаДляДоговора.ПоПятидневке Тогда
				МаксДатаОтправки = НайтиМаксимальнуюДатуТД("Дата");
				Если День(МаксДатаОтправки) <= 5 Тогда
					ДатаДокумента = Дата(Год(МаксДатаОтправки),Месяц(МаксДатаОтправки),5);
				ИначеЕсли День(МаксДатаОтправки) <= 10 и День(МаксДатаОтправки) > 5 Тогда
					ДатаДокумента = Дата(Год(МаксДатаОтправки),Месяц(МаксДатаОтправки),10);
				ИначеЕсли День(МаксДатаОтправки) <= 15 и День(МаксДатаОтправки) > 10 Тогда
					ДатаДокумента = Дата(Год(МаксДатаОтправки),Месяц(МаксДатаОтправки),15);
				ИначеЕсли День(МаксДатаОтправки) <= 20 и День(МаксДатаОтправки) > 15 Тогда
					ДатаДокумента = Дата(Год(МаксДатаОтправки),Месяц(МаксДатаОтправки),20);
				ИначеЕсли День(МаксДатаОтправки) <= 25 и День(МаксДатаОтправки) > 20 Тогда
					ДатаДокумента = Дата(Год(МаксДатаОтправки),Месяц(МаксДатаОтправки),25);
				ИначеЕсли День(МаксДатаОтправки) > 25 Тогда
					ДатаДокумента = КонецМесяца(МаксДатаОтправки);
				КонецЕсли;
				//ПериодВО = НачалоМесяца(МаксДатаОтправки);
			ИначеЕсли ДоговорКонтрагента.ПравилоФормированияДатыУслуги = Перечисления.СпособыОпределенияДатыДокументаДляДоговора.ПоДекаде Тогда	
				МаксДатаОтправки = НайтиМаксимальнуюДатуТД("Дата");
				Если День(МаксДатаОтправки) <= 10 Тогда
					ДатаДокумента = Дата(Год(МаксДатаОтправки),Месяц(МаксДатаОтправки),10);
				ИначеЕсли День(МаксДатаОтправки) <= 20 и День(МаксДатаОтправки) > 10 Тогда
					ДатаДокумента = Дата(Год(МаксДатаОтправки),Месяц(МаксДатаОтправки),20);
				ИначеЕсли День(МаксДатаОтправки) > 20 Тогда
					ДатаДокумента = КонецМесяца(МаксДатаОтправки);
				КонецЕСли;
				//ПериодВО = НачалоМесяца(МаксДатаОтправки);
				
			ИначеЕсли ДоговорКонтрагента.ПравилоФормированияДатыУслуги = Перечисления.СпособыОпределенияДатыДокументаДляДоговора.ДваРазаВМесяц Тогда				
				МаксДатаОтправки = НайтиМаксимальнуюДатуТД("Дата");
				Если День(МаксДатаОтправки) <= 15 Тогда
					ДатаДокумента = Дата(Год(МаксДатаОтправки),Месяц(МаксДатаОтправки),15);
				ИначеЕсли День(МаксДатаОтправки) > 15 Тогда
					ДатаДокумента = КонецМесяца(МаксДатаОтправки);
				КонецЕСли;
				//ПериодВО = НачалоМесяца(МаксДатаОтправки);
			ИначеЕсли ДоговорКонтрагента.ПравилоФормированияДатыУслуги = Перечисления.СпособыОпределенияДатыДокументаДляДоговора.РазВМесяц Тогда	
				МаксДатаОтправки = НайтиМаксимальнуюДатуТД("Дата");
				ДатаДокумента = КонецМесяца(МаксДатаОтправки);
				//Гудкова: в ТЗ этого нет: ПериодВО = НачалоМесяца(МаксДатаОтправки);
				
			КонецЕсли;
			//Проверка на закрытый период
			//Евросиб Гудкова( 31.10.2019 для нерезидента упрощенные правила
			ДатаДокумента = Макс(ДатаДокумента, ДатаОткрытогоПериода);
			//было			
			//Если Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия Тогда
			//	Если ДатаДокумента < ОткрытыйПериод() Тогда
			//		ДатаДокумента = ОткрытыйПериод();
			//		//ПериодВО = НачалоМесяца(ДатаДокумента);
			//	КонецЕсли;
			//Иначе
			//	Если ДатаДокумента >= ОткрытыйПериод() Тогда
			//		СледующийПериодЗаОткрытым = НачалоМесяца(ДобавитьМесяц(ОткрытыйПериод(),1));
			//		Если ДатаДокумента <= СледующийПериодЗаОткрытым Тогда
			//			ДатаДокумента = КонецМесяца(ДатаОткрытогоПериода); //Гудкова ОткрытыйПериод());
			//			//ПериодВО = НачалоМесяца(ДатаДокумента);
			//		КонецЕсли;
			//	Иначе
			//		ДатаДокумента = ОткрытыйПериод();
			//		//ПериодВО = НачалоМесяца(ДатаДокумента);
			//	КонецЕсли;
			//КонецЕсли;	
			
			// Евросиб Гудкова) 		
		Иначе 
			МаксДата = Дата('00010101');
			Для каждого Стр из Услуги Цикл
				Если Стр.Номенклатура.ВидУслуги = Перечисления.ВидыУслуг.ПредоставлениеВагонов Тогда 
					МассивНомеровТД = СтрРазделить(Стр.СписокТД,";",Ложь);
					ДатаМаксПоСтроке = ЗапросПоТД(МассивНомеровТД,"Дата");
					МаксДата = ?(МаксДата > ДатаМаксПоСтроке, МаксДата, ДатаМаксПоСтроке);
				ИначеЕсли Стр.Номенклатура.ВидУслуги = Перечисления.ВидыУслуг.ТранспортноЭкспедиторские Тогда
					МассивНомеровТД = СтрРазделить(Стр.СписокТД,";",Ложь);
					ДатаМаксПоСтроке = ЗапросПоТД(МассивНомеровТД,"ДатаПрибытия");
					МаксДата = ?(МаксДата > ДатаМаксПоСтроке, МаксДата, ДатаМаксПоСтроке);
				ИначеЕсли Стр.Номенклатура.ВидУслуги = Перечисления.ВидыУслуг.АгентскиеУслуги Тогда
					//ДатаМаксПоСтроке = 
				ИначеЕсли Стр.Номенклатура.ВидУслуги = Перечисления.ВидыУслуг.ТерминальнаяОбработкаГрузов Тогда
					//ДатаМаксПоСтроке = 
				ИначеЕсли Стр.Номенклатура.ВидУслуги = Перечисления.ВидыУслуг.Аренда Тогда
					//
				ИначеЕсли Стр.Номенклатура.ВидУслуги = Перечисления.ВидыУслуг.Комплексные Тогда	
					//
				КонецЕсли;
			КонецЦикла;
			//Евросиб Гудкова( 31.10.2019 для нерезидента упрощенные правила + исправление ошибок 
			ДатаДокумента = Макс(МаксДата, ДатаОткрытогоПериода);
			//было
			//		Если Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия Тогда
			//Если МаксДата < ОткрытыйПериод() Тогда
			//	ДатаДокумента = ОткрытыйПериод();
			//	//ПериодВО = НачалоМесяца(ДатаДокумента);
			//Иначе
			//	ДатаДокумента = МаксДата;
			//	//ПериодВО = НачалоМесяца(МаксДата);
			//	
			//КонецЕсли;
			//Иначе
			//	ДатаПаспортаСделки = ДоговорКонтрагента.ДатаПаспортаСделки;
			//Если МаксДата >= ОткрытыйПериод() Тогда
			//	СледующийПериодЗаОткрытым = НачалоМесяца(ДобавитьМесяц(ОткрытыйПериод(),1));
			//	Если ДатаДокумента < СледующийПериодЗаОткрытым Тогда
			//		ДатаДокумента = КонецМесяца(ОткрытыйПериод());
			//		ПериодВО = НачалоМесяца(ДатаДокумента);
			//	Иначе
			//		Если ДатаПаспортаСделки> МаксДата Тогда
			//			ДатаДокумента  = ДатаПаспортаСделки;
			//			//ПериодВО = НачалоМесяца(ДатаДокумента);
			//		Иначе
			//			ДатаДокумента = Дата;
			//			//ПериодВО = НачалоМесяца(Дата);
			//		КонецЕСли;
			//	КонецЕсли;
			//Иначе
			//		
			//	ДатаДокумента = ОткрытыйПериод();
			//	//ПериодВО = НачалоМесяца(ДатаДокумента);
			//КонецЕсли;
			//Если НачалоМесяца(ПериодВО) > НачалоМесяца(Дата) Тогда
			//	ДатаДокумента = КонецМесяца(ПериодВО);
			//Иначе	
			//	ДатаДокумента = Макс(ДатаПаспортаСделки, Дата);
			//КонецЕсли; 
			// Евросиб Гудкова) 			
		КонецЕсли;	
//Евросиб Гудкова( 31.10.2019 
	Иначе //нерезидент
		Если ПериодВО > ДатаОткрытогоПериода Тогда
			ДатаДокумента = ТекущаяДата();
		Иначе	
			ДатаДокумента = Мин(КонецМесяца(ПериодВО), ТекущаяДата());
		КонецЕсли; 
// Евросиб Гудкова) 		
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаДокумента) Тогда
		Сообщить("Определить дату Акта не удалось. Установлена текущая дата.");
		ДатаДокумента = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры

Функция НайтиМаксимальнуюДатуТД(Реквизит);
	СтрокаТД = "";
	Для каждого Стр из Услуги Цикл
		СтрокаТД = СтрокаТД+?(СтрокаТД = "","",";")+Стр.СписокТД;
	КонецЦикла;
	МассивНомеровТД = СтрРазделить(СтрокаТД,";",Ложь);
	ДатаМакс = ЗапросПоТД(МассивНомеровТД,Реквизит);	
	
	Возврат ДатаМакс;
КонецФункции

Функция ЗапросПоТД(МассивТД,Реквизит)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	МАКСИМУМ(ТранспортныйДокумент."+Реквизит+") КАК Дата
	                      |ИЗ
	                      |	Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
	                      |ГДЕ
	                      |	ТранспортныйДокумент.Номер В(&МассивНомеров) ИЛИ ТранспортныйДокумент.НомерТранспортногоДокумента В(&МассивНомеров)");
	Запрос.УстановитьПараметр("МассивНомеров",МассивТД);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат ?(Выборка.Дата = NULL, Дата('00010101'), Выборка.Дата);
	КонецЕсли;
	Возврат Дата('00010101');

КонецФункции

//Евросиб Гудкова( 30.10.2019
#Область плохо
//	Функция ОткрытыйПериод()
//	ДатаЗП = Дата('00010101');
//	Запрос = Новый Запрос("ВЫБРАТЬ
//	                      |	ЗакрытыеПериодыСрезПоследних.Период КАК Период
//	                      |ИЗ
//	                      |	РегистрСведений.ЗакрытыеПериоды.СрезПоследних(, Организация = &Организация) КАК ЗакрытыеПериодыСрезПоследних");
//	Запрос.УстановитьПараметр("Организация", Организация);
//	Выборка = Запрос.Выполнить().Выбрать();
//	Если Выборка.Следующий() Тогда
//		ДатаЗП = Выборка.Период;
//	КонецЕсли;
//	Если ДатаЗП <> Дата('00010101') Тогда
//		СледующийОткрытыйМесяц = НачалоМесяца(ДобавитьМесяц(ДатаЗП,1));
//	Иначе
//		СледующийОткрытыйМесяц = Дата('00010101');
//	КонецЕсли;
//	
//	Возврат СледующийОткрытыйМесяц;
//	
//КонецФункции
#КонецОбласти
// Евросиб Гудкова) 

Процедура ОбработкаУдаленияПроведения(Отказ)
		СчФ = БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиПодчиненныйСчетФактуру(Ссылка,"СчетФактураВыданный");
	Если СчФ <> Неопределено Тогда
		ОбСчФ = СчФ.ПолучитьОбъект();
		Если Не ОбСчФ.ПометкаУдаления Тогда
			ОбСчФ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
	КонецЕСли;

	// ДИТ Поморцева Т.П. Задача 34586 13.07.2021
	РегистрыСведений.КонтрольПолученияДокументовНДС0.УдалениеДвиженияДокументаРеализацияТоваровУслуг(РасшифровкаУслугПоТС);
	
	//Евросиб СубботинВ #117888 10.09.2025 Начало 
	МаршрутизацияСервер.ОчиститьТаблицуСостоянийОбъекта(ЭтотОбъект);
    //Евросиб СубботинВ #117888 10.09.2025 Начало
	
КонецПроцедуры

//Евросиб(ДИТ), Беляев СЮ, BUG 112789 / TA 112793, 25-06-2025, начало (закомментировал старую процедуру)
//Процедура СформироватьНомерДляПечати()
//	
//	//++ДИТ Кузнецов Е.Е. Ticket#0268985 24.10.2022
//	//Если год даты документа не изменился, формировать номер для печати не нужно
//	//Если Не ЭтоНовый() Тогда 
//	//ДИТ, Беляев СЮ, Ticket#0329766, 26-10-2023, начало (исправление для случая формирования РТУ из Сделки с использованием ранее созданных РТУ, номер очищался)
//	Если Не ЭтоНовый() И ЗначениеЗаполнено(НомерДляПечати) Тогда
//	//ДИТ, Беляев СЮ, Ticket#0329766, 26-10-2023, конец
//		ДатаДокументаИБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ДатаДокумента");
//		ГодаРавны = Год(ДатаДокументаИБ) = Год(ДатаДокумента);
//		Если ГодаРавны Тогда
//			Возврат;
//		КонецЕсли;
//		//ДИТ, Беляев СЮ, Ticket#0316040, 04-07-2023, начало
//		Номер = "";
//		НомерДляПечати = "";
//		//ДИТ, Беляев СЮ, Ticket#0316040, 04-07-2023, конец
//	КонецЕсли;
//	//--ДИТ Кузнецов Е.Е. Ticket#0268985 24.10.2022
//	
////Евросиб Гудкова( 22.10.2020 Ticket№ 0211390
//	//АС = НайтиАвансовыйСчет(Сделка,Контрагент,ДоговорКонтрагента);
//	//Если АС <> Неопределено Тогда
//	//	СчетАв = АС[0].Ссылка;
//	//Иначе
//// Евросиб Гудкова)

//	//Евросиб СубботинВ #84453 02.07.2024 Начало // в связи с удаление реквизита, переделал фомирование номера для печати на 1 строку тч счетов
//	//СчетАв = СчетНаОплатуПокупателю;
//	ПервоначальныйНомерСчета = "";
//	Если СчетаНаОплатуПокупателям.Количество()>0 Тогда
//	ПервоначальныйНомерСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетаНаОплатуПокупателям[0].СчетПокупателю, "ПервоначальныйНомер");
//	КонецЕсли;
//    //Евросиб СубботинВ #84453 02.07.2024 Конец	
//// Евросиб Гудкова	КонецЕСли; 
//	//Евросиб - АСуслов 24.01.2022 17:37:15 #0258238 
//	//(
//	Если НЕ ЗначениеЗаполнено(Номер) Тогда
//		УстановитьНовыйНомер();
//	КонецЕсли;
//	НомерДляПечатиДоИзменения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "НомерДляПечати");
//	//)
//	//Евросиб - АСуслов 24.01.2022 17:38:06 #0258238

//	//Евросиб Коханенко Н.А. 11.03.2024 (( #82079
//	//требуется не текущий номер, а его первоначальное значение из счета на оплату
//	//НомерДляПечати = Номер+"/"+?(СчетАв.Номер<>"",СчетАв.Номер+"/","")+?(Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия,"Р","Н");
//	
//	//Евросиб СубботинВ #84453 02.07.2024 Начало // в связи с удаление реквизита, переделал фомирование номера для печати на 1 строку тч счетов
//	//НомерДляПечати = Номер + "/" + ?(СчетАв.ПервоначальныйНомер <> "", СчетАв.ПервоначальныйНомер+"/", "") + ?(Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия, "Р", "Н");
//	НомерДляПечати = Номер + "/" + ?(ПервоначальныйНомерСчета <> "", ПервоначальныйНомерСчета+"/", "") + ?(Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия, "Р", "Н");
//	//Евросиб СубботинВ #84453 02.07.2024 Конец	
//	//Евросиб Коханенко Н.А. 11.03.2024 )) #82079 

//	// ДИТ BUG 51375 TA 63910 Евсенкин М.А. Начало: 16.01.2023 // перенес код из конца процедуры, что бы в сообщении так же отображался верный номер для печати
//	
//	//Евросиб - АСуслов 09.09.2022 11:12:50 #56897
//	//(
//	Если ЗначениеЗаполнено(ПравилоФормирования) Тогда
//		РазделительЭлементовНомераДляПечати = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПравилоФормирования, "РазделительЭлементовНомераДляПечати");
//		Если ЗначениеЗаполнено(РазделительЭлементовНомераДляПечати) Тогда
//			НомерДляПечати = СтрЗаменить(НомерДляПечати, "/", РазделительЭлементовНомераДляПечати)
//		КонецЕсли;
//	КонецЕсли;
//	//)
//	//Евросиб - АСуслов 09.09.2022 11:13:57 #56897
//	// ДИТ BUG 51375 TA 63910 Евсенкин М.А. Конец: 16.01.2023

//	Если ЗначениеЗаполнено(Ссылка) И НомерДляПечати <> НомерДляПечатиДоИзменения Тогда
//		ДокументВЗакрытомПериоде = КонтрольДоступностиДокументов_сервер.ПроверкаДоступностиПоПериоду(Ссылка);
//		Если НЕ ДокументВЗакрытомПериоде Тогда
//			//Удаление признака выгрузки
//			ЗаписьПротоколаОбмена = РегистрыСведений.ПротоколОбменов.СоздатьМенеджерЗаписи();
//			ЗаписьПротоколаОбмена.УзелОбмена = Перечисления.УзлыОбмена.УПП;
//			ЗаписьПротоколаОбмена.Объект = Ссылка;
//			ЗаписьПротоколаОбмена.ДействиеПриОбмене = Перечисления.ДействияПриОбмене.ВыгрузкаДанных;
//			ЗаписьПротоколаОбмена.Удалить();
//			ОбщегоНазначения.СообщитьПользователю("Изменился номер для печати, признак выгрузки снят. Был номер " + НомерДляПечатиДоИзменения + " стал " + НомерДляПечати);
//		Иначе
//			НомерДляПечати = НомерДляПечатиДоИзменения;
//			ОбщегоНазначения.СообщитьПользователю("Документ выгружен во внешнюю систему, номер для печати не будет изменен");
//		КонецЕсли; 
//	КонецЕсли;
//		
//	
//КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, BUG 112789 / TA 112793, 25-06-2025, конец

//Евросиб(ДИТ), Беляев СЮ, BUG 112789 / TA 112793, 25-06-2025, начало
Процедура СформироватьНомерДляПечати()
	
	Если ЭтоНовый() Тогда
		Если НЕ ЗначениеЗаполнено(Номер) Тогда
			УстановитьНовыйНомер();
		КонецЕсли;
		УстановитьНовыйНомерДляПечати();
		Возврат;
	КонецЕсли;
	
	ТребуетсяУстановитьНовыйНомерДляПечати = НЕ ЗначениеЗаполнено(НомерДляПечати);
	РеквизитыДокументаБыло = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ДатаДокумента, НомерДляПечати, СчетаНаОплатуПокупателям.СчетПокупателю");
	
	Если ЗначениеЗаполнено(НомерДляПечати) Тогда
		
		//контроль смены года
		ГодаРавны = Год(РеквизитыДокументаБыло.ДатаДокумента) = Год(ДатаДокумента);
		Если НЕ ГодаРавны Тогда
			Номер = "";
			НомерДляПечати = "";
			ТребуетсяУстановитьНовыйНомерДляПечати = Истина;
		КонецЕсли;
		
		//проверка ограничений (закрытые период, выгружен в УПП)
		ЕстьОграничения = КонтрольДоступностиДокументов_сервер.ДатаПопадаетВЗакрытыйПериодДоходов(ПериодВО, Организация);
		Если НЕ ЕстьОграничения Тогда
			РезультатПроверки = РегистрыСведений.ПротоколОбменов.ПроверитьВыгрузку(Ссылка, Перечисления.УзлыОбмена.УПП, Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
			ЕстьОграничения = ЕстьОграничения ИЛИ ЗначениеЗаполнено(РезультатПроверки.Ссылка);
		КонецЕсли;
		
		//проверка изменения списка счетов
		Если НЕ ЕстьОграничения И НЕ ТребуетсяУстановитьНовыйНомерДляПечати Тогда
			МассивСчетовБыло = РеквизитыДокументаБыло.СчетаНаОплатуПокупателямСчетПокупателю.Выгрузить().ВыгрузитьКолонку("СчетПокупателю");
			Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(МассивСчетовБыло, Истина);
			МассивСчетов = СчетаНаОплатуПокупателям.ВыгрузитьКолонку("СчетПокупателю");
			Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(МассивСчетов, Истина);
			ИзменилсяСоставСчетов = Не ОбщегоНазначения.КоллекцииИдентичны(МассивСчетовБыло, МассивСчетов);
			ТребуетсяУстановитьНовыйНомерДляПечати = ТребуетсяУстановитьНовыйНомерДляПечати ИЛИ ИзменилсяСоставСчетов;
		КонецЕсли;
			
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Номер) Тогда
		УстановитьНовыйНомер();
		ТребуетсяУстановитьНовыйНомерДляПечати = Истина;
	КонецЕсли;
	
	Если ТребуетсяУстановитьНовыйНомерДляПечати Тогда
		УстановитьНовыйНомерДляПечати();
	КонецЕсли;
	
	НомерДляПечатиДоИзменения = РеквизитыДокументаБыло.НомерДляПечати;
	Если НомерДляПечати <> НомерДляПечатиДоИзменения Тогда
		ДокументВЗакрытомПериоде = КонтрольДоступностиДокументов_сервер.ДатаПопадаетВЗакрытыйПериодДоходов(ПериодВО, Организация);
		Если НЕ ДокументВЗакрытомПериоде Тогда
			//Удаление признака выгрузки
			ЗаписьПротоколаОбмена = РегистрыСведений.ПротоколОбменов.СоздатьМенеджерЗаписи();
			ЗаписьПротоколаОбмена.УзелОбмена = Перечисления.УзлыОбмена.УПП;
			ЗаписьПротоколаОбмена.Объект = Ссылка;
			ЗаписьПротоколаОбмена.ДействиеПриОбмене = Перечисления.ДействияПриОбмене.ВыгрузкаДанных;
			ЗаписьПротоколаОбмена.Удалить();
			ОбщегоНазначения.СообщитьПользователю("Изменился номер для печати, признак выгрузки снят. Был номер " + НомерДляПечатиДоИзменения + " стал " + НомерДляПечати);
		Иначе
			НомерДляПечати = НомерДляПечатиДоИзменения;
			ОбщегоНазначения.СообщитьПользователю("Документ выгружен во внешнюю систему, номер для печати не будет изменен");
		КонецЕсли; 
	КонецЕсли;
		
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, BUG 112789 / TA 112793, 25-06-2025, конец

//Евросиб(ДИТ), Беляев СЮ, BUG 112789 / TA 112793, 25-06-2025, начало
Процедура УстановитьНовыйНомерДляПечати()
	
	ПервоначальныйНомерСчета = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетаНаОплатуПокупателям.СчетПокупателю КАК СчетПокупателю
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&СчетаНаОплатуПокупателям КАК СчетаНаОплатуПокупателям
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДокументСчетНаОплатуПокупателю.ПервоначальныйНомер КАК ПервоначальныйНомер,
	|	ДокументСчетНаОплатуПокупателю.СуммаДокумента КАК СуммаДокумента,
	|	1 КАК Приоритет,
	|	ДокументСчетНаОплатуПокупателю.АвансовыйСчет КАК АвансовыйСчет,
	|	ДокументСчетНаОплатуПокупателю.ДатаДокумента КАК ДатаДокумента
	|ИЗ
	|	ВТ КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК ДокументСчетНаОплатуПокупателю
	|		ПО (ДокументСчетНаОплатуПокупателю.Ссылка = ВТ.СчетПокупателю)
	|			И (ДокументСчетНаОплатуПокупателю.АвансовыйСчет)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументСчетНаОплатуПокупателю.ПервоначальныйНомер,
	|	ДокументСчетНаОплатуПокупателю.СуммаДокумента,
	|	2,
	|	ДокументСчетНаОплатуПокупателю.АвансовыйСчет,
	|	ДокументСчетНаОплатуПокупателю.ДатаДокумента
	|ИЗ
	|	ВТ КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК ДокументСчетНаОплатуПокупателю
	|		ПО (ДокументСчетНаОплатуПокупателю.Ссылка = ВТ.СчетПокупателю)
	|			И (НЕ ДокументСчетНаОплатуПокупателю.АвансовыйСчет)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет,
	|	СуммаДокумента УБЫВ,
	|	ДатаДокумента";
	
	Запрос.УстановитьПараметр("СчетаНаОплатуПокупателям", СчетаНаОплатуПокупателям.Выгрузить(,"СчетПокупателю"));
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ПервоначальныйНомерСчета = Выборка.ПервоначальныйНомер;
	КонецЕсли;
	
	КонтрагентСтранаРегистрации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "СтранаРегистрации");
	НомерДляПечати = Номер + "/" + ?(ПервоначальныйНомерСчета <> "", ПервоначальныйНомерСчета+"/", "") + ?(КонтрагентСтранаРегистрации = Справочники.СтраныМира.Россия, "Р", "Н");
	
	Если ЗначениеЗаполнено(ПравилоФормирования) Тогда
		РазделительЭлементовНомераДляПечати = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПравилоФормирования, "РазделительЭлементовНомераДляПечати");
		Если ЗначениеЗаполнено(РазделительЭлементовНомераДляПечати) Тогда
			НомерДляПечати = СтрЗаменить(НомерДляПечати, "/", РазделительЭлементовНомераДляПечати)
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, BUG 112789 / TA 112793, 25-06-2025, конец

//Евросиб Каблов 15.09.2020 ( TASK 23506
Процедура СнятьПризнакВыставлен() Экспорт
	
	Если Выставлен Тогда
		НачатьТранзакцию();
		Выставлен = Ложь;
		ДатаВыставления = '00010101';
		ДополнительныеСвойства.Вставить("СнятьПризнакВыставленУСчетаФактуры", Истина);
		Записать();
		//Евросиб Каблов 08.07.2021 ( Ticket#0231661
		Диадок_Сервер.ОтвязатьДокумент1СОтДокументовПакетовДиадок(Ссылка);
		//Евросиб Каблов 08.07.2021 )
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Каблов 28.11.2025 #111016
Процедура ПроверитьОстаткиПоСчетамПокупателей(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.НомерСтроки КАК НомерСтроки,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.СчетПокупателю КАК СчетПокупателю,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.СчетаНаОплатуПокупателям КАК РеализацияТоваровУслугСчетаНаОплатуПокупателям
	|ГДЕ
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетаПокупателейОстатки.СчетПокупателю КАК СчетПокупателю,
	|	СчетаПокупателейОстатки.Номенклатура КАК Номенклатура,
	|	-СчетаПокупателейОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ВТ.НомерСтроки КАК НомерСтроки,
	|	СчетаПокупателейОстатки.СчетПокупателю.НомерДляПечати КАК СчетПокупателюНомерДляПечати,
	|	СчетаПокупателейОстатки.СчетПокупателю.Номер КАК СчетПокупателюНомер,
	|	СчетаПокупателейОстатки.СчетПокупателю.Дата КАК СчетПокупателюДата
	|ИЗ
	|	РегистрНакопления.СчетаПокупателей.Остатки(
	|			,
	|			(СчетПокупателю, Номенклатура) В
	|				(ВЫБРАТЬ
	|					ВТ.СчетПокупателю КАК СчетПокупателю,
	|					ВТ.Номенклатура КАК Номенклатура
	|				ИЗ
	|					ВТ КАК ВТ)) КАК СчетаПокупателейОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	|		ПО СчетаПокупателейОстатки.СчетПокупателю = ВТ.СчетПокупателю
	|			И СчетаПокупателейОстатки.Номенклатура = ВТ.Номенклатура
	|ГДЕ
	|	СчетаПокупателейОстатки.СуммаОстаток < 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	СчетПокупателю,
	|	Номенклатура,
	|	НомерСтроки";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.СледующийПоЗначениюПоля("СчетПокупателю") Цикл
		Пока Выборка.СледующийПоЗначениюПоля("Номенклатура") Цикл
			ТекстСообщения = СтрШаблон("Сумма превышает остаток по счету %1 (%2 от %3). Превышение суммы: %4", Выборка.СчетПокупателюНомерДляПечати, Выборка.СчетПокупателюНомер, Выборка.СчетПокупателюДата, Выборка.СуммаОстаток);
			ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СчетаНаОплатуПокупателям", Выборка.НомерСтроки, "Сумма");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКПолюТЧ, "Объект", Отказ);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

