// ДИТ US 57674 ТА 79279 Сержантова А.С. 25.03.2024
Функция ПолучитьТаблицуДвиженийСчетаПокупателейПоУчетнымЕдиницам(ДокОбъект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&ПериодДвижений КАК Период,
	|	СчетаПокупателейПоУчетнымЕдиницамОбороты.Организация КАК Организация,
	|	СчетаПокупателейПоУчетнымЕдиницамОбороты.Сделка КАК Сделка,
	|	СчетаПокупателейПоУчетнымЕдиницамОбороты.Контрагент КАК Контрагент,
	|	СчетаПокупателейПоУчетнымЕдиницамОбороты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СчетаПокупателейПоУчетнымЕдиницамОбороты.СчетПокупателю КАК СчетПокупателю,
	|	СчетаПокупателейПоУчетнымЕдиницамОбороты.Номенклатура КАК Номенклатура,
	|	-СчетаПокупателейПоУчетнымЕдиницамОбороты.СуммаРасход КАК Сумма
	|ИЗ
	|	РегистрНакопления.СчетаПокупателейПоУчетнымЕдиницам.Обороты(, , Регистратор, ) КАК СчетаПокупателейПоУчетнымЕдиницамОбороты
	|ГДЕ
	|	СчетаПокупателейПоУчетнымЕдиницамОбороты.Регистратор = &Регистратор"; 
	ИсходныйРТУ = ДокОбъект.ДокументРеализации;
	Пока Истина Цикл
		Если ТипЗнч(ИсходныйРТУ) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда 
			ИсходныйРТУ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсходныйРТУ, "ДокументРеализации");
		Иначе	
		    Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ПериодДвижений", ДокОбъект.Дата);
	Запрос.УстановитьПараметр("Регистратор", ИсходныйРТУ);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();	
	
КонецФункции