#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	//Субботин 77659 15.12.2023 Начало // перенес в при создании на сервере из при чтении
	ЗаполнитьТаблицуПоКлючамАналитики();	
	//Субботин 77659 15.12.2023 Конец
	УстановитьУсловноеОформление();	
	
	Если Не ПустаяСтрока(Объект.КонтактТерминала) Тогда
		Адреса = СтрРазделить(Объект.КонтактТерминала, ";", Ложь);
		КонтактыТерминалаВыдачи.ЗагрузитьЗначения(Адреса);
	КонецЕсли;
	
	СозданиеРелизаИзЗаявки = Параметры.СозданиеРелизаИзЗаявки;
	СозданиеРелизаИзАРМ = Параметры.СозданиеРелизаИзАРМ;
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 13.12.2022
	Если СозданиеРелизаИзАРМ Или СозданиеРелизаИзЗаявки Тогда 
		Объект.ДатаОтправленияПоЖДПлан 	= Параметры.ЗначенияЗаполнения.ДатаОтправленияПоЖДПлан;
		Объект.СтанцияНазначенияПоЖД 	= Параметры.ЗначенияЗаполнения.СтанцияНазначенияПоЖД;
	КонецЕсли;	
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 13.12.2022
	Если Параметры.Ключ.Пустая() Тогда
		// Если открывается новая формы, то пытаемся прочитать идентификатор из параметров,
		// т.к. форма может создаваться из заявки, откуда передается этот параметр.
		ИдентификаторСтрокиЗаявки = Параметры.ИдентификаторСтрокиЗаявки; // используется для обновления данных из запроса на КТК (заявки) - это идентификатор строки запроса на КТК заявки
	Иначе
		// Если открывается форма существующего документа, то ищем идентификатор в регистре
		ОпределитьИдентификаторРелиза();
	КонецЕсли;
	
	// Евросиб Фролов (28.03.2022 Task №49126
	МассивПодстоковВыдачи = Объект.ПодстокиВыдачи.Выгрузить().ВыгрузитьКолонку("НаименованиеПодстока");
	ПодстокиВыдачи.ЗагрузитьЗначения(МассивПодстоковВыдачи);  
	
	МассивПодстоковСдачи = Объект.ПодстокиСдачи.Выгрузить().ВыгрузитьКолонку("НаименованиеПодстока");
	ПодстокиСдачи.ЗагрузитьЗначения(МассивПодстоковСдачи);
	// Евросиб Фролов)
	
	// Евросиб Фролов (28.04.2022 Task №50233
	УправлениеФормой();
	// Евросиб Фролов)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//ДИТ Шевченко А.В. 51340 14.10.2022 -начало
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.СтатусОтправкиПолученияОтветаТерминала = Справочники.СибурСтатусыЗаявок.НеОтправлен;
	КонецЕсли;                                  
	//ДИТ Шевченко А.В. 51340 14.10.2022 -конец

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОпределитьСтатусРелиза();
	
	НастроитьТекстКнопкиПечати();
	НастроитьЗависимыеОтАвтоперевозкиЭлементы();	
	НастроитьДоступностьЭлементовШапки();
	НастроитьВидимостьПодстокаВыдачи();
	НастроитьВидимостьПодстокаСдачи();
	
	Для Каждого ТекущаяСтрока Из Объект.Контейнеры Цикл
		
		// Если текст инструкции в АРМ и в документе отличается, то уведомим об этом пользователя
		Если ЗначениеЗаполнено(ТекущаяСтрока.ИнструкцияПоСдачеИзАРМ)
			//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -начало
			И СокрЛП(ТекущаяСтрока.ИнструкцияПоСдачеИзАРМ) <> СокрЛП(ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.КлючАналитикиПеревозки,"ИнструкцияПоСдаче")) Тогда
			//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -конец
				ТекстСообщения = СтрШаблон("Инструкции по сдаче в строке %1 отличаются от указанных в АРМ КТК", ТекущаяСтрока.НомерСтроки);
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	КонецЦикла;	
	
	НастроитьВидимостьКолонкиИнструкцииАРМ(); 
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СброситьТипы(); //ДИТ Шевченко А.В. 63318 07.03.2023  
	
	//ДИТ, Беляев СЮ, US 83045 / TA 85275, 16-05-2024, начало
	МассивТиповЛокаций = Новый Массив;
	МассивТиповЛокаций.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.НаселенныйПункт"));
	МассивТиповЛокаций.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Регион"));
	МассивТиповЛокаций.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Страна"));
	
	МассивПараметровВыбора = Новый Массив;
	МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.Тип", Новый ФиксированныйМассив(МассивТиповЛокаций)));

	Элементы.ЛокацияСдачи.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	//ДИТ, Беляев СЮ, US 83045 / TA 85275, 16-05-2024, конец
	
КонецПроцедуры     

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если СозданиеРелизаИзЗаявки
		ИЛИ СозданиеРелизаИзАРМ Тогда
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("Релиз", 						Объект.Ссылка);
		ПараметрыОповещения.Вставить("ИдентификаторСтрокиЗаявки", 	ИдентификаторСтрокиЗаявки);
		//ДИТ Шевченко А.В. BUG 75898 TA 75908 10.10.2023
		ПараметрыОповещения.Вставить("Автоперевозка", 	Объект.Автоперевозка);
		ПараметрыОповещения.Вставить("АвтоперевозкаПоследняяМиля", 	Объект.АвтоперевозкаПоследняяМиля);
		//ДИТ Шевченко А.В. BUG 75898 TA 75908 10.10.2023        
		// ДИТ BUG 76435  Сержантова А.С. Начало: 23.11.2023
		ПараметрыОповещения.Вставить("НормативноеИспользование", 	Объект.СрокИспользованияКТК);
		// ДИТ BUG 76435  Сержантова А.С. Конец: 23.11.2023
		
		// ДИТ US 79950 ТА 79951 Сержантова А.С. Начало: 12.02.2024
		ПараметрыОповещения.Вставить("ТипКТК", 	Объект.ТипоразмерКТК);
		ПараметрыОповещения.Вставить("РазмерКТК", ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Объект.ТипоразмерКТК, "РазмерКТК"));
		// ДИТ US 79950 ТА 79951 Сержантова А.С. Конец: 12.02.2024                               
		
		//ДИТ Шевченко А.В. US 62482 ТА 68277 17.04.2023 -Начало
		МассивСтруктур = Новый Массив;
		Для Каждого СтрокаК Из Объект.Контейнеры Цикл
			СтруктураОтвет = Новый Структура("Ключ,ИдентификаторСтроки",СтрокаК.КлючАналитикиПеревозки,СтрокаК.ИдентификаторСтроки);
			МассивСтруктур.Добавить(СтруктураОтвет);
		КонецЦикла;	
		ПараметрыОповещения.Вставить("МассивКлючей",МассивСтруктур);
		//ДИТ Шевченко А.В. US 62482 ТА 68277 17.04.2023 -Конец
		
		Оповестить("СозданиеРелизаКлиентаИзЗаявки", ПараметрыОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
    Если ИсточникВыбора.ИмяФормы = "Справочник.ТЕ.Форма.ФормаВыбора" Тогда
		
		Если ВыбранноеЗначение <> Неопределено Тогда
			НоваяСтрока = Объект.Контейнеры.Добавить();
			//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 –начало
			//НоваяСтрока.Контейнер = ВыбранноеЗначение;
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.КлючАналитикиПеревозки) Тогда
				Ответ = СоздатьКлючАналитики(Объект.Заявка,ВыбранноеЗначение);
				НоваяСтрока.КлючАналитикиПеревозки  = Ответ.КлючАналитикиПеревозки;
				НоваяСтрока.ВерсияКлюча 			= Ответ.ВерсияДанных;
				ЭтаФорма.Модифицированность = Истина;
			КонецЕсли;
			НоваяСтрока.Контейнер = ВыбранноеЗначение;
			//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 –конец
			НоваяСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор;
			ЗаполнитьИнструкциюПоСдачеТекущегоКонтейнера(НоваяСтрока);
		КонецЕсли;
		
		Модифицированность = Истина;
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Документ.РелизКлиента.Форма.СвязкаТабличныхЧастей" Тогда
		
		Если ВыбранноеЗначение <> Неопределено Тогда
			ЗаполнитьКонтейнерыПослеСвязки(ВыбранноеЗначение);
		КонецЕсли;
		
		Модифицированность = Истина;
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Документ.РелизКлиента.Форма.ФормаПодбораКонтейнеровВТС" Тогда
		
		Если ВыбранноеЗначение <> Неопределено Тогда
			ЗаполнитьКонтейнерыВодителейПослеСвязки(ВыбранноеЗначение);
		КонецЕсли;
		
		Модифицированность = Истина;
					
	КонецЕсли;
	
	ОтключитьОтметкуНезаполненного();
	
	Если Окно <> Неопределено Тогда
		Окно.Активизировать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ЭлектронноеПисьмоИсходящее" Тогда
		// Из формы отправки электронного письма отправлено оповещение о записи
		ЭтаФорма.Прочитать();  
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 25.12.2023
	ИначеЕсли ИмяСобытия = "НеобходимоОбновитьДанныеКлючейАналитикиПеревозки" Тогда	
		Если Источник <> Неопределено и Источник.УникальныйИдентификатор <> ЭтаФорма.УникальныйИдентификатор Тогда
			ПроверитьАктуальностьКлючаАналитики();
		КонецЕсли;
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 25.12.2023
	КонецЕсли;  
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)	
	// Заполняем в табличной части только текст иннструкции из АРМ Управление КТК
	ЗаполнитьДобавленныеКолонки("ИнструкцияПоСдачеИзАРМ, ВидСобственности, СобственникКТК");

	// Евросиб Фролов (28.02.2022 Task №46354
	ПодсвечиваниеПолейОбъектов.НастроитьПодсвечиваниеПолей(ТекущийОбъект, ИмяФормы, ЭтаФорма, УсловноеОформление);	
	// Евросиб Фролов)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -начало
	ЗаполнитьТаблицуПоКлючамАналитики();
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -конец
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//ДИТ Шевченко А.В. 51340 12.10.2022 - Начало
	Если ПараметрыЗаписи.Свойство("ПропуститьПроверку") 
		И ПараметрыЗаписи.ПропуститьПроверку Тогда
		Возврат;
	КонецЕсли;
	
	//ДИТ Шевченко А.В. US 62421 TA 64347 16.03.2023 -начало
	Если ИзмененияВодителя И НЕ ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		МассивНомеровСтрок = Новый Массив;
		Для Каждого СтрокаТЧ из Объект.Контейнеры Цикл
			Если СтрокаТЧ.ВерсияКлюча <> ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(СтрокаТЧ.КлючАналитикиПеревозки,"ВерсияДанных") Тогда 
				ЗаполнитьТаблицуПоКлючамАналитики(СтрокаТЧ.КлючАналитикиПеревозки);
				МассивНомеровСтрок.Добавить(СтрокаТЧ.НомерСтроки);	
			КонецЕсли;
		КонецЦикла;
		ИзмененияВодителя = Ложь;
		Если МассивНомеровСтрок.Количество() Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Версия ключа аналитики перевозки в строках № %1 устарела, подгружены актуальные данные по строке.",СтрСоединить(МассивНомеровСтрок,",")),,,,Отказ);
		КонецЕсли;	
	КонецЕсли;	
	//ДИТ Шевченко А.В. US 62421 TA 64347 16.03.2023 -конец
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения ИЛИ (Объект.Проведен И Объект.ПометкаУдаления) Тогда
		Если Объект.СтатусОтправкиПолученияОтветаТерминала <> ПредопределенноеЗначение("Справочник.СибурСтатусыЗаявок.НеОтправлен") Тогда
			Отказ = ПроверитьДатуВывоза();
			Если Отказ Тогда
				ТекстОшибки = СтрШаблон("По документу Релиз клиента %1 осуществлена выдача КТК. Отмена проведения или удаление документа невозможно",Объект.НомерРелиза);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки,
				// ++ ДИТ_Агафонов_task 51340 24.10.2022
				//ЭтотОбъект,
				Объект.Ссылка,
				// -- ДИТ_Агафонов_task 51340 24.10.2022
				,
				,
				Отказ);
			Иначе
				Отказ = Истина;
				ТекстВопроса = НСтр("ru = 'На терминал будет отправлен запрос об отмене выдачи по РК?'");	
				СписокКнопок = Новый СписокЗначений;
				СписокКнопок.Добавить(КодВозвратаДиалога.Да, "Да, отправить и отменить проведение");
				СписокКнопок.Добавить(КодВозвратаДиалога.Нет, "Нет, оставить проведение");
				ДополнительныеПараметры = Новый Структура; 
				ДополнительныеПараметры.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);
				ДополнительныеПараметры.Вставить("ЗначениеЕслиДа", Ложь);
				ДополнительныеПараметры.Вставить("ЗначениеЕслиНет", Истина);
				Оповещение = Новый ОписаниеОповещения("ВопросОбОтменеПроведения", ЭтотОбъект, ДополнительныеПараметры);
				ПоказатьВопрос(Оповещение, ТекстВопроса, СписокКнопок);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//ДИТ Шевченко А.В. 51340 12.10.2022 - Конец
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		// Если запрос терминалу был отправлен (заполнена дата отправки) и изменены поля, которые
		// указываются в запросе, то выдвдим предупреждение.
		Если Объект.ИзмененыКлючевыеПоля И ЗначениеЗаполнено(Объект.ДатаОтправкиЗапросаТерминалу) Тогда
			ПоказатьПредупреждение(, "Данные в релизе изменены после отправки запроса на релиз терминалу. Необходимо направить терминалу скорректированный запрос на выдачу контейнеров по релизу.");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(Объект.ТерминалВыдачи)
			//Евросиб Шевченко А.В. US 73357 TA 115689 04.08.2025
			И КонтактыТерминалаВыдачи.Количество() = 0  И НЕ Объект.ВыдачаОтСобственника Тогда  
			// ДИТ US 76995 ТА 76997 Сержантова А.С. Начало: 07.11.2023
			// Было:
			//ОбщегоНазначенияКлиент.СообщитьПользователю(
			//"Не заполнены контакты терминала выдачи",
			//,
			//"КонтактыТерминалаВыдачи",, Отказ);    
			// ДИТ US 76995 ТА 76997 Сержантова А.С. Конец: 07.11.2023
			ОбщегоНазначенияКлиент.СообщитьПользователю(
			"Не заполнены контакты терминала выдачи",
			,
			"КонтактыТерминалаВыдачи",, Отказ);
			//Евросиб Шевченко А.В. US 73357 TA 115689 04.08.2025
		Иначе
			СохранитьКонтактыТерминалаВыдачи();					
		КонецЕсли;
		
	КонецЕсли;	
	
	// Евросиб Фролов (28.03.2022 Task №49126
	Объект.ПодстокиВыдачи.Очистить();
	Для Каждого ТекущийПодстокВыдачи Из ПодстокиВыдачи Цикл
		НоваяСтрока = Объект.ПодстокиВыдачи.Добавить();	
		НоваяСтрока.НаименованиеПодстока = ТекущийПодстокВыдачи.Значение;
	КонецЦикла;	
	
	Объект.ПодстокиСдачи.Очистить();
	Для Каждого ТекущийПодстокСдачи Из ПодстокиСдачи Цикл
		НоваяСтрока = Объект.ПодстокиСдачи.Добавить();	
		НоваяСтрока.НаименованиеПодстока = ТекущийПодстокСдачи.Значение;
	КонецЦикла;
	// Евросиб Фролов) 
	
	// ДИТ US 83041 ТА 83043 Сержантова А.С. Начало: 02.05.2024
	Если (ЭтаФорма.Модифицированность или ЭтаФорма.МодифицированностьФлаг) 
		и ЗначениеЗаполнено(Объект.Заявка) и не ПараметрыЗаписи.Свойство("ВопросВыставленныеСчетаЗадан") Тогда 
		МассивВыставленныхСчетов = ПроверитьВыставленныеПоЗаявкеСчета(Объект.Заявка);  
		Если МассивВыставленныхСчетов.Количество() Тогда
			Отказ = Истина;
			Оповещение = Новый ОписаниеОповещения("ПоказатьВопросПродолжениеЗаписиЗавершение", ЭтаФорма, ПараметрыЗаписи);	
			СчетаСтрока = СтрСоединить(МассивВыставленныхСчетов, ", ");
			ТекстВопроса = "Внимание, вы изменяете данные по заявке, на которую имеются выставленные счета: " + СчетаСтрока;
			СписокКнопок = Новый СписокЗначений;
			СписокКнопок.Добавить(КодВозвратаДиалога.Да, "Продолжить");
			СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
			ПоказатьВопрос(Оповещение, ТекстВопроса, СписокКнопок,,КодВозвратаДиалога.Да);   
			Возврат;
		КонецЕсли;
	КонецЕсли;
	// ДИТ US 83041 ТА 83043 Сержантова А.С. Конец: 02.05.2024
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ИдентификаторСтрокиЗаявки", ИдентификаторСтрокиЗаявки); 
	
	// ДИТ US 83041 ТА 83043 Сержантова А.С. Начало: 25.04.2024       
	ТЗдляПроверки = Объект.Контейнеры.Выгрузить().Скопировать(,"Контейнер, КлючАналитикиПеревозки");
	КлючиАналитикиПеревозкиСервер.ПроверитьСоответствиеКонтейнераФутовостиВКалькуляции(ТЗдляПроверки, Отказ); 
	
	ТЗДляПроверки.Колонки.Добавить("Заявка", Новый ОписаниеТипов("ДокументСсылка.Заявка"));
	Для каждого Стр Из ТЗДляПроверки Цикл
		Стр.Заявка = Объект.Заявка;
	КонецЦикла;
	КТКЕстьВДругойЗаявке = КлючиАналитикиПеревозкиСервер.ПроверитьКТКвДругойЗаявке(ТЗдляПроверки);
	Для каждого Ответ Из КТКЕстьВДругойЗаявке Цикл
		Сообщить("!!! КТК № " + Ответ.НомерКТК + " встречается также в заявке " + Ответ.Заявка + ". Проверьте, не ошибка ли это!", СтатусСообщения.Внимание);
	КонецЦикла;
	// ДИТ US 83041 ТА 83043 Сержантова А.С. Конец: 25.04.2024
	
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 05.12.2023    
	//Проверяем изменились ли ключи аналитики
	//Есть обработчик оповещения и обновления данных ключей на форме, но мало ли... вдруг за 5 секунд кто то поменял ключ
	БылоОбновлениеКлюча = Ложь;
	Для каждого СтрокаТЧ Из Объект.Контейнеры Цикл
		АктуальнаяВерсия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.КлючАналитикиПеревозки, "ВерсияДанных");
		Если СтрокаТЧ.ВерсияКлюча <> "" и СтрокаТЧ.ВерсияКлюча <> АктуальнаяВерсия Тогда
			ЗаполнитьТаблицуПоКлючамАналитики(СтрокаТЧ.КлючАналитикиПеревозки); 
			БылоОбновлениеКлюча = Истина;
		КонецЕсли;
	КонецЦикла;	
	Если БылоОбновлениеКлюча Тогда 
		ОбщегоНазначения.СообщитьПользователю("Перед записью релиза обнаружено, что ключи аналитики перевозки изменились. Данные перезаполнены, внесите необходимые корректировки");		
		Отказ = Истина;
	КонецЕсли;  
	
	Если не Отказ Тогда 
		ЗаблокироватьКлючиАналитикиПеревозкиДляРедактирования();
		ДанныеОбновленияКлючей = ЗаполнитьДанныеДляОбновленияКлючейАналитикиПеревозки();
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ДанныеДляОбновленияКлючейАналитики", ДанныеОбновленияКлючей); 
	КонецЕсли; 
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 05.12.2023
КонецПроцедуры 

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// Заполняем в табличной части только текст иннструкции из АРМ Управление КТК
	ЗаполнитьДобавленныеКолонки("ИнструкцияПоСдачеИзАРМ");
	
	// Евросиб Фролов (28.02.2022 Task №46354
	ПодсвечиваниеПолейОбъектов.НастроитьПодсвечиваниеПолей(ТекущийОбъект, ИмяФормы, ЭтаФорма, УсловноеОформление);	
	// Евросиб Фролов)
	
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -начало
	ЗаполнитьТаблицуПоКлючамАналитики();
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -конец
	
	
	//ДИТ Шевченко А.В. US 62421 ТА 70357 24.05.2023 -Начало
	Если НЕ СозданиеРелизаИзЗаявки
		И НЕ СозданиеРелизаИзАРМ Тогда
		МассивСтруктур = Новый Массив;
		Для Каждого СтрокаК Из Объект.Контейнеры Цикл
			СтруктураОтвет = Новый Структура("Ключ,ИдентификаторСтроки",СтрокаК.КлючАналитикиПеревозки,СтрокаК.ИдентификаторСтроки);
			МассивСтруктур.Добавить(СтруктураОтвет);
		КонецЦикла;  
		Документы.РелизКлиента.ОбновитьКлючиВУслугахЗаявки(Объект.Заявка,МассивСтруктур,Объект.Ссылка); 
	КонецЕсли;	
	//ДИТ Шевченко А.В. US 62421 ТА 70357 24.05.2023 -Конец  
	
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 08.12.2023
	СнятьБлокировкуКлючейАналитикиПеревозкиДляРедактирования();
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 08.12.2023
	
КонецПроцедуры  

// ДИТ US 83041 ТА 83043 Сержантова А.С. 02.05.2024    
&НаСервере
Функция ПроверитьВыставленныеПоЗаявкеСчета(СсылкаЗаявки)

	МассивСчетов = Новый Массив;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеНаФорме.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
		|	ДанныеНаФорме.Контейнер КАК Контейнер
		|ПОМЕСТИТЬ ВТ_ДанныеСФормы
		|ИЗ
		|	&ДанныеНаФорме КАК ДанныеНаФорме
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КлючиАналитикиПеревозки.Ссылка КАК Ссылка,
		|	КлючиАналитикиПеревозки.Контейнер КАК Контейнер
		|ИЗ
		|	ВТ_ДанныеСФормы КАК ВТ_ДанныеСФормы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
		|		ПО ВТ_ДанныеСФормы.КлючАналитикиПеревозки = КлючиАналитикиПеревозки.Ссылка
		|ГДЕ
		|	КлючиАналитикиПеревозки.Контейнер <> ВТ_ДанныеСФормы.Контейнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СчетНаОплатуПокупателюДокументыОснования.Ссылка КАК Ссылка,
		|	СчетНаОплатуПокупателюДокументыОснования.Ссылка.Представление КАК ПредставлениеСчета
		|ИЗ
		|	Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
		|ГДЕ
		|	СчетНаОплатуПокупателюДокументыОснования.Документ = &Документ
		|	И НЕ СчетНаОплатуПокупателюДокументыОснования.Ссылка.ПометкаУдаления
		|	И СчетНаОплатуПокупателюДокументыОснования.Ссылка.Проведен";
	
	Запрос.УстановитьПараметр("Документ", СсылкаЗаявки);
	запрос.УстановитьПараметр("ДанныеНаФорме", Объект.Контейнеры.Выгрузить(, "Контейнер, КЛючАналитикиПеревозки"));
	
	Результат = Запрос.ВыполнитьПакет();   
	РезультатИзменениеКТК = Результат[1];
	Если РезультатИзменениеКТК.Пустой() Тогда
		Возврат МассивСчетов;
	КонецЕсли; 
	
	РезультатЗапроса = Результат[2];
	Если не РезультатЗапроса.Пустой() Тогда
		ВыборкаСчетов = РезультатЗапроса.Выбрать();
		Пока ВыборкаСчетов.Следующий() Цикл
			МассивСчетов.Добавить(ВыборкаСчетов.ПредставлениеСчета);
		КонецЦикла;
	КонецЕсли;

	Возврат МассивСчетов;
КонецФункции 

// ДИТ US 83041 ТА 83043 Сержантова А.С. 02.05.2024
&НаКлиенте
Процедура ПоказатьВопросПродолжениеЗаписиЗавершение(Результат, ПараметрыЗаписи) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ПараметрыЗаписи.Вставить("ВопросВыставленныеСчетаЗадан", Истина);
	    Записать(ПараметрыЗаписи);
	КонецЕсли;	

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ИзмененыКлючевыеПоля(); //ДИТ Шевченко А.В. 51340 18.10.2022
КонецПроцедуры

&НаКлиенте
Процедура ВыдачаОтСобственникаПриИзменении(Элемент)
	
	// Евросиб Фролов (28.03.2022 Task №49126
	Если Не ИзменениеВидаРелизаВозможно() Тогда
		Объект.ВыдачаОтСобственника = Не Объект.ВыдачаОтСобственника;
		Возврат;
	КонецЕсли;	
	// Евросиб Фролов)
	
	// Евросиб Фролов (30.05.2022 Task №49741
	// Закомментировал, т.к. необходимо разрешить одновременную установку галок в полях "Выдача от собственника" и "Номерная выдача"
	//Если Объект.ВыдачаОтСобственника И Объект.НомернаяВыдача Тогда
	//	Объект.НомернаяВыдача = Ложь;
	//КонецЕсли;
	// Евросиб Фролов)
	
	ПриИзмененииВидаРелиза(); // Евросиб Фролов (14.02.2022 Ticket№ 46606
		
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииВидаРелиза()
	НастроитьДоступностьЭлементовШапки();
	НастроитьВидимостьПодстокаВыдачи();
	Если НЕ Объект.ВыдачаОтСобственника Тогда
		// ++ ДИТ_Агафонов_task 56709 11.09.2022
		Если ЗначениеЗаполнено(Объект.РелизСобственника) и Объект.Контейнеры.Количество()>0 Тогда
			УдалитьСтрокиИзРелизаСобственника();
		КонецЕсли;
		// -- ДИТ_Агафонов_task 56709 11.09.2022
		Объект.РелизСобственника = ПредопределенноеЗначение("Документ.РелизСобственника.ПустаяСсылка");
		// ++ ДИТ_Агафонов_task 56709 11.09.2022
		//Объект.Контейнеры.Очистить();
		// -- ДИТ_Агафонов_task 56709 11.09.2022
		// Евросиб Фролов (14.02.2022 Ticket№ 46606
		Если Не ЗначениеЗаполнено(Объект.СтатусСогласованияСпискаКТК) Тогда
			Объект.СтатусСогласованияСпискаКТК = ПредопределенноеЗначение("Перечисление.СтатусыСогласованияСпискаКТКСТерминалами.НеСогласован");
		КонецЕсли;
		// Евросиб Фролов)
	КонецЕсли;
	// Евросиб Фролов (28.03.2022 Task №49126
	ЗаполнитьНомерРелиза();
	// Евросиб Фролов)
	
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -начало
	ЗаполнитьТаблицуПоКлючамАналитики();
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -конец
	ЗаполнитьДобавленныеКолонки("ИнструкцияПоСдачеИзАРМ");
КонецПроцедуры

&НаКлиенте
Процедура НомернаяВыдачаПриИзменении(Элемент)
	
	// Евросиб Фролов (28.03.2022 Task №49126
	Если Не ИзменениеВидаРелизаВозможно() Тогда
		Объект.НомернаяВыдача = Не Объект.НомернаяВыдача;
		Возврат;
	КонецЕсли;	
	// Евросиб Фролов)
	
	// Евросиб Фролов (30.05.2022 Task №49741
	// Закомментировал, т.к. необходимо разрешить одновременную установку галок в полях "Выдача от собственника" и "Номерная выдача"
	//Если Объект.ВыдачаОтСобственника И Объект.НомернаяВыдача Тогда
	//	Объект.ВыдачаОтСобственника = Ложь;
	//КонецЕсли;
	// Евросиб Фролов)
	
	ПриИзмененииВидаРелиза(); // Евросиб Фролов (14.02.2022 Ticket№ 46606
	
КонецПроцедуры

&НаКлиенте
Процедура ТерминалВыдачиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	// При выборе терминала необходимо установить фильтр для отображения только тех терминалов,
	// родителем которых является выбранная локация выдачи.
	Если ЗначениеЗаполнено(Объект.ЛокацияВыдачи) Тогда
		СтандартнаяОбработка = Ложь;
		//Евросиб - АСуслов 09.08.2023 14:57:35 #локации 67499 62583
		//(
		СписокТерминаловДляВыбора = ПолучитьСписокЛокацийДляВыбора(Объект.ЛокацияВыдачи, ПредопределенноеЗначение("Справочник.ТипыЛокаций.Терминал"));
		
		//РодительЛокации = Новый СписокЗначений;
		//РодительЛокации.Добавить(Объект.ЛокацияВыдачи);
		//
		//ТипЛокации = Новый СписокЗначений;
		//ТипЛокации.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Терминал"));
		
		ЗначениеОтбора = Новый Структура;
		//ПараметрыФормыВыбора.Вставить("РодительЛокации", 	РодительЛокации);
		//ПараметрыФормыВыбора.Вставить("ТипЛокации", 		ТипЛокации);
		ЗначениеОтбора.Вставить("СписокЛокаций", 		СписокТерминаловДляВыбора);
		ПараметрыФормыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
		//)
		//Евросиб - АСуслов 09.08.2023 14:58:58 #локации 67499 62583
		
		ОткрытьФорму("Справочник.Локации.ФормаВыбора", ПараметрыФормыВыбора, Элемент);
	КонецЕсли;	
КонецПроцедуры 

//Евросиб - АСуслов 09.08.2023 14:59:24 #локации 67499 62583
//(
&НаСервереБезКонтекста
Функция ПолучитьСписокЛокацийДляВыбора(ЛокацияПодбора, ТипЛокации)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Локации.Ссылка КАК Локация
	|ПОМЕСТИТЬ ВТ_Локации
	|ИЗ
	|	Справочник.Локации КАК Локации
	|ГДЕ
	|	Локации.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АналогиЛокаций.Локация
	|ИЗ
	|	РегистрСведений.АналогиЛокаций КАК АналогиЛокаций
	|ГДЕ
	|	АналогиЛокаций.Аналог = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АналогиЛокаций.Аналог
	|ИЗ
	|	РегистрСведений.АналогиЛокаций КАК АналогиЛокаций
	|ГДЕ
	|	АналогиЛокаций.Локация = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АналогиЛокаций.Аналог
	|ИЗ
	|	Справочник.Локации КАК Локации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналогиЛокаций КАК АналогиЛокаций
	|			ПО ИерархияЛокаций.ЛокацияВышестоящегоУровня = АналогиЛокаций.Локация
	|		ПО Локации.Ссылка = ИерархияЛокаций.Локация
	|			И (ИерархияЛокаций.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.Регион))
	|ГДЕ
	|	Локации.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АналогиЛокаций.Локация
	|ИЗ
	|	Справочник.Локации КАК Локации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналогиЛокаций КАК АналогиЛокаций
	|			ПО ИерархияЛокаций.ЛокацияВышестоящегоУровня = АналогиЛокаций.Аналог
	|		ПО Локации.Ссылка = ИерархияЛокаций.Локация
	|			И (ИерархияЛокаций.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.Регион))
	|ГДЕ
	|	Локации.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИерархияЛокаций1.Локация КАК Локация,
	|	ИерархияЛокаций.ЛокацияВышестоящегоУровня КАК ЛокацияВышестоящегоУровня,
	|	ИерархияЛокаций1.ЛокацияВышестоящегоУровня КАК ЛокацияВышестоящегоУровня1
	|ИЗ
	|	ВТ_Локации КАК ВТ_Локации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций1
	|			ПО ИерархияЛокаций.ЛокацияВышестоящегоУровня = ИерархияЛокаций1.ЛокацияВышестоящегоУровня
	|				И (ИерархияЛокаций1.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.Страна))
	|				И (ИерархияЛокаций1.Локация.Тип = &ТипЛокации)
	|		ПО ВТ_Локации.Локация = ИерархияЛокаций.Локация
	|			И (ИерархияЛокаций.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.Страна))
	|			И (ВТ_Локации.Локация.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Страна))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИерархияЛокаций1.Локация,
	|	ИерархияЛокаций.ЛокацияВышестоящегоУровня,
	|	ИерархияЛокаций1.ЛокацияВышестоящегоУровня
	|ИЗ
	|	ВТ_Локации КАК ВТ_Локации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций1
	|			ПО ИерархияЛокаций.ЛокацияВышестоящегоУровня = ИерархияЛокаций1.ЛокацияВышестоящегоУровня
	|				И (ИерархияЛокаций.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.Регион))
	|				И (ИерархияЛокаций1.Локация.Тип = &ТипЛокации)
	|		ПО ВТ_Локации.Локация = ИерархияЛокаций.Локация
	|			И (ИерархияЛокаций.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.Регион))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИерархияЛокаций1.Локация,
	|	NULL,
	|	NULL
	|ИЗ
	|	ВТ_Локации КАК ВТ_Локации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций1
	|			ПО ИерархияЛокаций.ЛокацияВышестоящегоУровня = ИерархияЛокаций1.ЛокацияВышестоящегоУровня
	|				И (ИерархияЛокаций.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.НаселенныйПункт))
	|				И (ИерархияЛокаций1.Локация.Тип = &ТипЛокации)
	|		ПО ВТ_Локации.Локация = ИерархияЛокаций.Локация
	|			И (ИерархияЛокаций.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.НаселенныйПункт))";
	Запрос.УстановитьПараметр("Ссылка", ЛокацияПодбора);
	Запрос.УстановитьПараметр("ТипЛокации", ТипЛокации);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Локация");
	
КонецФункции
//)
//Евросиб - АСуслов 09.08.2023 14:59:25 #локации 67499 62583

//Евросиб - АСуслов 09.08.2023 14:59:52 #локации 67500 62583
//(
//&НаСервереБезКонтекста
//Функция ПолучитьСписокСтоковДляВыбора(ЛокацияПодбораТерминала)

//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	Локации.Ссылка КАК Локация
//	|ПОМЕСТИТЬ ВТ_Локации
//	|ИЗ
//	|	Справочник.Локации КАК Локации
//	|ГДЕ
//	|	Локации.Ссылка = &Ссылка
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	АналогиЛокаций.Локация
//	|ИЗ
//	|	РегистрСведений.АналогиЛокаций КАК АналогиЛокаций
//	|ГДЕ
//	|	АналогиЛокаций.Аналог = &Ссылка
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	АналогиЛокаций.Аналог
//	|ИЗ
//	|	РегистрСведений.АналогиЛокаций КАК АналогиЛокаций
//	|ГДЕ
//	|	АналогиЛокаций.Локация = &Ссылка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ИерархияЛокаций1.Локация КАК Сток
//	|ИЗ
//	|	ВТ_Локации КАК ВТ_Локации
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций1
//	|			ПО ИерархияЛокаций.ЛокацияВышестоящегоУровня = ИерархияЛокаций1.ЛокацияВышестоящегоУровня
//	|				И (ИерархияЛокаций1.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.Страна))
//	|				И (ИерархияЛокаций1.Локация.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Сток))
//	|		ПО ВТ_Локации.Локация = ИерархияЛокаций.Локация
//	|			И (ИерархияЛокаций.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.Страна))
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ИерархияЛокаций1.Локация
//	|ИЗ
//	|	ВТ_Локации КАК ВТ_Локации
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций1
//	|			ПО ИерархияЛокаций.ЛокацияВышестоящегоУровня = ИерархияЛокаций1.ЛокацияВышестоящегоУровня
//	|				И (ИерархияЛокаций.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.Регион))
//	|				И (ИерархияЛокаций1.Локация.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Сток))
//	|				И ИерархияЛокаций.ЛокацияВышестоящегоУровня = ИерархияЛокаций1.ЛокацияВышестоящегоУровня
//	|		ПО (ИерархияЛокаций.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.Регион))
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ИерархияЛокаций1.Локация
//	|ИЗ
//	|	ВТ_Локации КАК ВТ_Локации
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций1
//	|			ПО ИерархияЛокаций.ЛокацияВышестоящегоУровня = ИерархияЛокаций1.ЛокацияВышестоящегоУровня
//	|				И (ИерархияЛокаций.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.НаселенныйПункт))
//	|				И (ИерархияЛокаций1.Локация.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Сток))
//	|				И ИерархияЛокаций.ЛокацияВышестоящегоУровня = ИерархияЛокаций1.ЛокацияВышестоящегоУровня
//	|		ПО (ИерархияЛокаций.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.НаселенныйПункт))
//	|";
//	Запрос.УстановитьПараметр("Ссылка", ЛокацияПодбораТерминала);
//	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сток");
//	
//КонецФункции
//)
//Евросиб - АСуслов 09.08.2023 14:59:58 #локации 67500 62583

&НаКлиенте
Процедура СтокВыдачиПриИзменении(Элемент)
	ИзмененыКлючевыеПоля(); //ДИТ Шевченко А.В. 51340 12.10.2022
	НастроитьТекстКнопкиПечати();
	НастроитьВидимостьПодстокаВыдачи();
КонецПроцедуры

&НаКлиенте
Процедура СтокВыдачиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Запретить выбор стока выдачи при незаполненном терминале выдачи.
	Если Не ЗначениеЗаполнено(Объект.ТерминалВыдачи) Тогда
		ПоказатьПредупреждение(, "Для выбора стока выдачи необходимо сначала выбрать терминал выдачи");
		СтандартнаяОбработка = Ложь;
	Иначе		
		// При выборе стока выдачи необходимо установить фильтр для отображения только тех стоков,
		// родителем которых является выбранный терминал выдачи.
		Если ЗначениеЗаполнено(Объект.ЛокацияВыдачи) Тогда
			СтандартнаяОбработка = Ложь;
			
			СписокСтоковДляВыбора = ПолучитьСписокЛокацийДляВыбора(Объект.ЛокацияВыдачи, ПредопределенноеЗначение("Справочник.ТипыЛокаций.Сток"));
		//	РодительЛокации = Новый СписокЗначений;
		//	РодительЛокации.Добавить(Объект.ТерминалВыдачи);
		//	
		//	ТипЛокации = Новый СписокЗначений;
		//	ТипЛокации.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Сток"));
		//
		//	ПараметрыФормыВыбора = Новый Структура;
		//	ПараметрыФормыВыбора.Вставить("РодительЛокации", 	РодительЛокации);
		//	ПараметрыФормыВыбора.Вставить("ТипЛокации", 		ТипЛокации);
			ЗначениеОтбора = Новый Структура;
			ЗначениеОтбора.Вставить("СписокЛокаций", 		СписокСтоковДляВыбора);
			ПараметрыФормыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
		
			ОткрытьФорму("Справочник.Локации.ФормаВыбора", ПараметрыФормыВыбора, Элемент);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтокВыдачиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ИзмененыКлючевыеПоля(); //ДИТ Шевченко А.В. 51340 12.10.2022
	НастроитьТекстКнопкиПечати();
	НастроитьВидимостьПодстокаВыдачи();
КонецПроцедуры

&НаКлиенте
Процедура ПодстокиВыдачиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Евросиб Фролов (28.03.2022 Task №49126
	СтандартнаяОбработка = Ложь;
	
	Терминалы = Новый СписокЗначений;
	Терминалы.Добавить(Объект.ТерминалВыдачи);
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("Заголовок", "Выбор подстоков выдачи");
	ПараметрыФормыВыбора.Вставить("СписокЛокаций", Терминалы);
	ПараметрыФормыВыбора.Вставить("ВыбранныеПодстоки", ПодстокиВыдачи.ВыгрузитьЗначения());
	
	ОткрытьФорму("Документ.РелизКлиента.Форма.ВыборПодстока", ПараметрыФормыВыбора, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	// Евросиб Фролов)
КонецПроцедуры

&НаКлиенте
Процедура ПодстокиВыдачиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Евросиб Фролов (28.03.2022 Task №49126
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		ПодстокиВыдачи.ЗагрузитьЗначения(ВыбранноеЗначение);
	КонецЕсли;	
	// Евросиб Фролов)
КонецПроцедуры

&НаКлиенте
Процедура СтокСдачиПриИзменении(Элемент)
	НастроитьВидимостьПодстокаСдачи();
	// Евросиб Фролов (28.03.2022 Task №49126
	ПодстокиСдачи.Очистить();
	Объект.ПодстокиСдачи.Очистить();
	// Евросиб Фролов)
КонецПроцедуры

&НаКлиенте
Процедура СтокСдачиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Евросиб Фролов (16.02.2022 Task №46605
	// Для выбора необходимо отобразить только те мультилокации, в списке локаций которых указаны только стоки
	// родителями которых являются локации, указанные в локации сдачи.
	//ДИТ Шевченко А.В. 63318 07.03.2023 -начало
	СтандартнаяОбработка = ЛОЖЬ;
	
	Если НЕ ЗначениеЗаполнено(Объект.СтокСдачи) И ВыборТипа Тогда
		сзТипы = Новый СписокЗначений();
		сзТипы.Добавить(0,"Мультилокации");
		сзТипы.Добавить(1,"Локации");
		ооВыборЗначенияТипа = Новый ОписаниеОповещения("ВыборЗначенияТипа",ЭтотОбъект);
		сзТипы.ПоказатьВыборЭлемента(
			ооВыборЗначенияТипа,	//Вызов процедуры оповещения
			"Выберите справочник",	//Заголовок диалогового окна выбора типа
			сзТипы[1]				//Первоначально позиционирование на значение выбора
			);
		ВыборТипа = ЛОЖЬ;
	Иначе
		Если ТипЗнч(Объект.СтокСдачи) = Тип("СправочникСсылка.Мультилокации") Тогда
			
			Если ЗначениеЗаполнено(Объект.ЛокацияСдачи) Тогда
				СписокТиповЛокаций = Новый Массив;
				СписокТиповЛокаций.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Сток"));
				
				ПараметрыОткрытияФормы = Новый Структура();
				ПараметрыОткрытияФормы.Вставить("МультилокацияРодителей", 	Объект.ЛокацияСдачи);
				// Евросиб Bug 93272 TA 93294 Рыбьяков К.А. 22.10.2024 ((
				//ПараметрыОткрытияФормы.Вставить("СписокТиповЛокаций", 		СписокТиповЛокаций);
				ПараметрыОткрытияФормы.Вставить("ТипыЛокаций", 		СписокТиповЛокаций);
				
				СписокСтоков =  Локации_сервер.ЛокацииПоЛокацииВышестоящегоУровняИТипу(Объект.ЛокацияСдачи, СписокТиповЛокаций);
				ПараметрыОткрытияФормы.Вставить("Локации", СписокСтоков);
				// Евросиб Рыбьяков К.А. 22.10.2024 ))
				
				ОткрытьФорму("Справочник.Мультилокации.ФормаВыбора", ПараметрыОткрытияФормы,Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				
			Иначе
				ПоказатьПредупреждение(, "Для выбора стока сдачи сначала нужно выбрать локацию сдачи.");
			КонецЕсли; 
			
		Иначе
			Если ЗначениеЗаполнено(Объект.ЛокацияСдачи) Тогда	
				РодительЛокации = Новый СписокЗначений;
				РодительЛокации.Добавить(Объект.ЛокацияСдачи);
				
				ТипЛокации = Новый СписокЗначений;
				ТипЛокации.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Сток"));
				
				// Евросиб(ДИТ) US 83045 ТА 85915 Сержантова А.С. Начало: 07.06.2024
				// Было:
				//МассивЛокаций = Новый СписокЗначений;
				//ПолучитьСписокДляОтбораРодителей(Объект.ЛокацияСдачи,МассивЛокаций);
				//
				//ПараметрыФормыВыбора = Новый Структура;
				//ПараметрыФормыВыбора.Вставить("РодительЛокации", 	МассивЛокаций);
				//ПараметрыФормыВыбора.Вставить("ТипЛокации", 		ТипЛокации);
				// Стало: 
				ПараметрыФормыВыбора = Новый Структура;
				ПараметрыФормыВыбора.Вставить("ТипЛокации", 		ТипЛокации);
				Если ТипЗнч(Объект.ЛокацияСдачи) = Тип("СправочникСсылка.Мультилокации") Тогда
					МассивЛокаций = Новый СписокЗначений;
					ПолучитьСписокДляОтбораРодителей(Объект.ЛокацияСдачи,МассивЛокаций);	
					ПараметрыФормыВыбора.Вставить("РодительЛокации", 	МассивЛокаций);
				КонецЕсли;
				// Евросиб(ДИТ) US 83045 ТА 85915 Сержантова А.С. Конец: 07.06.2024
				
				// Евросиб Bug 93272 TA 93294 Рыбьяков К.А. 22.10.2024 ((
				СписокСтоков =  Локации_сервер.ЛокацииПоЛокацииВышестоящегоУровняИТипу(Объект.ЛокацияСдачи, ТипЛокации);
				Отбор = Новый Структура("СписокЛокаций", СписокСтоков); 
				ПараметрыФормыВыбора = Новый Структура("Отбор", Отбор);
				// Евросиб Рыбьяков К.А. 22.10.2024 ))
				
				ОткрытьФорму("Справочник.Локации.ФормаВыбора", ПараметрыФормыВыбора, Элементы.СтокСдачи);
			Иначе
				ПоказатьПредупреждение(, "Для выбора стока сдачи сначала нужно выбрать локацию сдачи.");	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(Объект.ЛокацияСдачи) Тогда
	//	СписокТиповЛокаций = Новый СписокЗначений;
	//	СписокТиповЛокаций.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Сток"));
	//	
	//	ПараметрыОткрытияФормы = Новый Структура();
	//	ПараметрыОткрытияФормы.Вставить("МультилокацияРодителей", 	Объект.ЛокацияСдачи);
	//	ПараметрыОткрытияФормы.Вставить("СписокТиповЛокаций", 		СписокТиповЛокаций);
	//	
	//	ОткрытьФорму("Справочник.Мультилокации.ФормаВыбора", ПараметрыОткрытияФормы, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//	
	//	//Если ЗначениеЗаполнено(Объект.ЛокацияСдачи) Тогда
	//	//	СтандартнаяОбработка = Ложь;
	//	//	
	//	//	РодительЛокации = Новый СписокЗначений;
	//	//	РодительЛокации.Добавить(Объект.ЛокацияСдачи);
	//	//	
	//	//	ТипЛокации = Новый СписокЗначений;
	//	//	ТипЛокации.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Сток"));
	//	//		
	//	//	ПараметрыФормыВыбора = Новый Структура;
	//	//	ПараметрыФормыВыбора.Вставить("РодительЛокации", 	РодительЛокации);
	//	//	ПараметрыФормыВыбора.Вставить("ТипЛокации", 		ТипЛокации);
	//	//	
	//	//	ОткрытьФорму("Справочник.Локации.ФормаВыбора", ПараметрыФормыВыбора, Элемент);
	//Иначе
	//	ПоказатьПредупреждение(, "Для выбора стока сдачи сначала нужно выбрать локацию сдачи.");
	//КонецЕсли;
	//// Евросиб Фролов)
		//ДИТ Шевченко А.В. 63318 07.03.2023 -конец	
КонецПроцедуры	

&НаКлиенте
Процедура СтокСдачиОткрытие(Элемент, СтандартнаяОбработка)
	// Евросиб Фролов (16.02.2022 Task №46605
	Если Не ЗначениеЗаполнено(Объект.СтокСдачи) Тогда
		ПоказатьПредупреждение(, "Не заполнен сток сдачи");
		Возврат;
	КонецЕсли;	
	СтандартнаяОбработка = Ложь;
	//ДИТ Шевченко А.В. 63318 07.03.2023 -начало
	//РодительЛокации = Новый СписокЗначений;
	//РодительЛокации.ЗагрузитьЗначения(СоставМультилокации(Объект.ЛокацияСдачи));
	//
	//СписокТиповЛокаций = Новый СписокЗначений;
	//СписокТиповЛокаций.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Сток"));
	//
	//ПараметрыФормыФормы = Новый Структура;
	//ПараметрыФормыФормы.Вставить("РодительЛокации", РодительЛокации);
	//ПараметрыФормыФормы.Вставить("ТипЛокации", 		СписокТиповЛокаций);
	//ПараметрыФормыФормы.Вставить("Ключ", 			Объект.СтокСдачи);
	//
	//ОткрытьФорму("Справочник.Мультилокации.ФормаОбъекта", ПараметрыФормыФормы);
	
	Если ТипЗнч(Объект.СтокСдачи) = Тип("СправочникСсылка.Мультилокации") Тогда
		РодительЛокации = Новый СписокЗначений;
		//Евросиб Каблов 02.11.2024 (
		//РодительЛокации.ЗагрузитьЗначения(СоставМультилокации(Объект.ЛокацияСдачи));
		РодительЛокации.ЗагрузитьЗначения(СоставМультилокации(Объект.СтокСдачи));
		//Евросиб Каблов 02.11.2024 )		
		
		СписокТиповЛокаций = Новый СписокЗначений;
		СписокТиповЛокаций.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Сток"));
		
		ПараметрыФормыФормы = Новый Структура;
		ПараметрыФормыФормы.Вставить("РодительЛокации", РодительЛокации);
		ПараметрыФормыФормы.Вставить("ТипЛокации", 		СписокТиповЛокаций);
		ПараметрыФормыФормы.Вставить("Ключ", 			Объект.СтокСдачи);
		
		ОткрытьФорму("Справочник.Мультилокации.ФормаОбъекта", ПараметрыФормыФормы);
	Иначе
		ПараметрыФормыФормы = Новый Структура;
		ПараметрыФормыФормы.Вставить("Ключ", 			Объект.СтокСдачи);
		
		ОткрытьФорму("Справочник.Локации.ФормаОбъекта", ПараметрыФормыФормы);
	КонецЕсли;
	// Евросиб Фролов) 
		//ДИТ Шевченко А.В. 63318 07.03.2023 -конец
КонецПроцедуры

&НаКлиенте
Процедура СтокСдачиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	НастроитьВидимостьПодстокаСдачи();
	// Евросиб Фролов (28.03.2022 Task №49126
	ПодстокиСдачи.Очистить();
	Объект.ПодстокиСдачи.Очистить();
	// Евросиб Фролов)
КонецПроцедуры

&НаКлиенте
Процедура ВыборЗначенияТипа(Результат, ДополнительныеПараметры) Экспорт //ДИТ Шевченко А.В. 63318 07.03.2023
	
	Если Результат = Неопределено Тогда Возврат КонецЕсли;
	
	Если Результат.Значение = 0 Тогда	
		Элементы.СтокСдачи.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Мультилокации");
	ИначеЕсли Результат.Значение = 1 Тогда
		Элементы.СтокСдачи.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Локации");
	КонецЕсли;	
	
	Если Результат.Значение = 0 Тогда
		
		Если ЗначениеЗаполнено(Объект.ЛокацияСдачи) Тогда
			СписокТиповЛокаций = Новый Массив;
			СписокТиповЛокаций.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Сток"));
			
			ПараметрыОткрытияФормы = Новый Структура();
			ПараметрыОткрытияФормы.Вставить("МультилокацияРодителей", 	Объект.ЛокацияСдачи);
			// Евросиб Bug 93272 TA 93294 Рыбьяков К.А. 22.10.2024 ((
			//ПараметрыОткрытияФормы.Вставить("СписокТиповЛокаций", 		СписокТиповЛокаций);
			ПараметрыОткрытияФормы.Вставить("ТипыЛокаций", 		СписокТиповЛокаций);
			
			СписокСтоков =  Локации_сервер.ЛокацииПоЛокацииВышестоящегоУровняИТипу(Объект.ЛокацияСдачи, СписокТиповЛокаций);
			ПараметрыОткрытияФормы.Вставить("Локации", СписокСтоков);
			// Евросиб Рыбьяков К.А. 22.10.2024 ))
			
			ОткрытьФорму("Справочник.Мультилокации.ФормаВыбора", ПараметрыОткрытияФормы, Элементы.СтокСдачи, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		Иначе
			ПоказатьПредупреждение(, "Для выбора стока сдачи сначала нужно выбрать локацию сдачи.");
		КонецЕсли; 
		
	Иначе
		Если ЗначениеЗаполнено(Объект.ЛокацияСдачи) Тогда	
			РодительЛокации = Новый СписокЗначений;
			РодительЛокации.Добавить(Объект.ЛокацияСдачи);
			
			ТипЛокации = Новый СписокЗначений;
			ТипЛокации.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Сток"));
			
			// Евросиб(ДИТ) US 83045 ТА 85915 Сержантова А.С. Начало: 07.06.2024
			// Было:
			//МассивЛокаций = Новый СписокЗначений;
			//ПолучитьСписокДляОтбораРодителей(Объект.ЛокацияСдачи,МассивЛокаций);
			//
			//ПараметрыФормыВыбора = Новый Структура;
			//ПараметрыФормыВыбора.Вставить("РодительЛокации", 	МассивЛокаций);
			//ПараметрыФормыВыбора.Вставить("ТипЛокации", 		ТипЛокации);
			// Стало: 
			ПараметрыФормыВыбора = Новый Структура;
			ПараметрыФормыВыбора.Вставить("ТипЛокации", 		ТипЛокации);
			Если ТипЗнч(Объект.ЛокацияСдачи) = Тип("СправочникСсылка.Мультилокации") Тогда
				МассивЛокаций = Новый СписокЗначений;
				ПолучитьСписокДляОтбораРодителей(Объект.ЛокацияСдачи,МассивЛокаций);	
				ПараметрыФормыВыбора.Вставить("РодительЛокации", 	МассивЛокаций);
			КонецЕсли;
			// Евросиб(ДИТ) US 83045 ТА 85915 Сержантова А.С. Конец: 07.06.2024
			
			// Евросиб Bug 93272 TA 93294 Рыбьяков К.А. 22.10.2024 ((
			СписокСтоков = Локации_сервер.ЛокацииПоЛокацииВышестоящегоУровняИТипу(Объект.ЛокацияСдачи, ТипЛокации);
			Отбор = Новый Структура("СписокЛокаций", СписокСтоков); 
			ПараметрыФормыВыбора = Новый Структура("Отбор", Отбор);
			// Евросиб Рыбьяков К.А. 22.10.2024 ))
			
			ОткрытьФорму("Справочник.Локации.ФормаВыбора", ПараметрыФормыВыбора, Элементы.СтокСдачи);
		Иначе
			ПоказатьПредупреждение(, "Для выбора стока сдачи сначала нужно выбрать локацию сдачи.");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтокСдачиОчистка(Элемент, СтандартнаяОбработка) //ДИТ Шевченко А.В. 63318 07.03.2023
	СброситьТипы();
КонецПроцедуры

&НаКлиенте
Процедура СброситьТипы() //ДИТ Шевченко А.В. 63318 07.03.2023 
	ВыборТипа = ИСТИНА;
	ДоступныеТипы = Новый Массив;
	ДоступныеТипы.Добавить("СправочникСсылка.Мультилокации");
	ДоступныеТипы.Добавить("СправочникСсылка.Локации");
	Элементы.СтокСдачи.ОграничениеТипа = Новый ОписаниеТипов(ДоступныеТипы);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьСписокДляОтбораРодителей(ЛокацияСдачи,МассивЛокаций)
	МассивМультилокации = Справочники.Мультилокации.СоставМультилокации(ЛокацияСдачи);
	
	МассивСубъектов = Новый Массив;
	
	Для Каждого ЗнчМульти Из МассивМультилокации Цикл 
		//Евросиб - АСуслов 05.05.2023 11:40:43 #67492
		//(
		//Если ЗнчМульти.Тип = Справочники.ТипыЛокаций.Субъект Тогда
		Если ЗнчМульти.Тип = Справочники.ТипыЛокаций.НаселенныйПункт Тогда
		//)
		//Евросиб - АСуслов 05.05.2023 11:40:45 #67492
			Если МассивСубъектов.Найти(ЗнчМульти) = неопределено Тогда
				МассивСубъектов.Добавить(ЗнчМульти);
			КонецЕсли;
		КонецЕсли;
		
		Если ЗнчМульти.Тип = Справочники.ТипыЛокаций.Терминал Тогда
			Если МассивЛокаций.НайтиПоЗначению(ЗнчМульти) = неопределено Тогда
				МассивЛокаций.Добавить(ЗнчМульти);
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Локации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Локации КАК Локации
		|ГДЕ
		|	Локации.Родитель В(&Родитель)
		|	И НЕ Локации.ПометкаУдаления
		|	И Локации.Тип = &Тип";
	
	Запрос.УстановитьПараметр("Родитель", МассивСубъектов);
	Запрос.УстановитьПараметр("Тип", Справочники.ТипыЛокаций.Терминал);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если МассивЛокаций.НайтиПоЗначению(ВыборкаДетальныеЗаписи.Ссылка) = неопределено Тогда
			МассивЛокаций.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		КонецЕсли;	
	КонецЦикла;

КонецПроцедуры	

&НаКлиенте
Процедура ПодстокиСдачиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Евросиб Фролов (28.03.2022 Task №49126
	// Для выбора подстоков предлагаем только те терминалы, которые являются родителями выбранных стоков сдачи.
	СтандартнаяОбработка = Ложь;
	
	СтокиСдачи = ПолучитьТерминалыСтоковСдачи(Объект.СтокСдачи);
	
	Если СтокиСдачи.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Нет доступных для выбора подстоков для указанных локаций сдачи.");
		Возврат;
	КонецЕсли;	
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("Заголовок", "Выбор подстоков сдачи");
	ПараметрыФормыВыбора.Вставить("СписокЛокаций", СтокиСдачи);
	ПараметрыФормыВыбора.Вставить("ВыбранныеПодстоки", ПодстокиСдачи.ВыгрузитьЗначения());
	
	ОткрытьФорму("Документ.РелизКлиента.Форма.ВыборПодстока", ПараметрыФормыВыбора, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	// Евросиб Фролов)
КонецПроцедуры

&НаКлиенте
Процедура ПодстокиСдачиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Евросиб Фролов (28.03.2022 Task №49126
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		ПодстокиСдачи.ЗагрузитьЗначения(ВыбранноеЗначение);
	КонецЕсли;
	// Евросиб Фролов)
КонецПроцедуры

&НаКлиенте
Процедура ТерминалВыдачиПриИзменении(Элемент)	
	// Обновим контакты терминала
	
	Если НЕ ЗначениеЗаполнено(Объект.ТерминалВыдачи) Тогда
		КонтактыТерминалаВыдачи.Очистить();
	Иначе
		ПредставлениеКИ = АдресаЭлектроннойПочтыТерминала(Объект.ТерминалВыдачи);
		Адреса = СтрРазделить(ПредставлениеКИ, ";", Ложь);
		КонтактыТерминалаВыдачи.ЗагрузитьЗначения(Адреса);
	КонецЕсли;
	
	// Евросиб Фролов (28.03.2022 Task №49126
	Объект.СтокВыдачи = Неопределено;
	ПодстокиВыдачи.Очистить();
	Объект.ПодстокиВыдачи.Очистить();
	// Евросиб Фролов)
	
	ИзмененыКлючевыеПоля(); //ДИТ Шевченко А.В. 51340 12.10.2022
	НастроитьТекстКнопкиПечати();
КонецПроцедуры

&НаКлиенте
Процедура РелизСобственникаПриИзменении(Элемент)
	
	// Евросиб Фролов (30.05.2022 Task №49741
	// Контейнеры теперь не заполняем по релизу собственника.
	// Заполнем только локацию выдачи.
	ОпределитьИдентификаторРелиза();
	
	Если Не ЗначениеЗаполнено(ИдентификаторСтрокиЗаявки) Тогда
		ПоказатьПредупреждение(, "Не определена строка запроса на КТК, по которой был создан данный релиз.
									|Обновить данные невозможно.");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Заявка) Тогда
		ПоказатьПредупреждение(, "Не указана заявка.
									|Обновить данные невозможно.");
		Возврат;
	КонецЕсли;
	
	ОбновитьЛокациюВыдачиИзЗапросаНаСервере();
	//ВыполнитьЗаполнениеПоРелизуСобственника(); закомментировал
	// Евросиб Фролов)
	
	ИзмененыКлючевыеПоля(); //ДИТ Шевченко А.В. 51340 12.10.2022
	НастроитьТекстКнопкиПечати();
	// Евросиб Фролов (28.03.2022 Task №49126
	ЗаполнитьНомерРелиза();
	// Евросиб Фролов)
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -начало
	ЗаполнитьТаблицуПоКлючамАналитики();
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -конец
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеКТКПриИзменении(Элемент)
	ИзмененыКлючевыеПоля(); //ДИТ Шевченко А.В. 51340 12.10.2022
	НастроитьТекстКнопкиПечати();
КонецПроцедуры

&НаКлиенте
Процедура ЛокацияСдачиПриИзменении(Элемент)
	// Евросиб Фролов (28.03.2022 Task №49126
	//// Евросиб Фролов (16.02.2022 Task №46605
	//Если Не ЗначениеЗаполнено(Объект.ЛокацияСдачи) Тогда
	//	Объект.СтокСдачи = Неопределено;
	//КонецЕсли;	
	//// Евросиб Фролов)
	Объект.СтокСдачи = Неопределено;
	ПодстокиСдачи.Очистить();
	Объект.ПодстокиСдачи.Очистить();
	// Евросиб Фролов)
КонецПроцедуры

&НаКлиенте
Процедура ЛокацияСдачиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//ДИТ, Беляев СЮ, US 83045 / TA 85275, 16-05-2024, начало (закомментировал блок)
	//// Евросиб Фролов (16.02.2022 Task №46605
	//// Для выбора необходимо отобразить только те мультилокации, в списке локаций которых отсутствуют стоки.
	//СтандартнаяОбработка = Ложь;
	//
	//СписокТиповЛокаций = Новый СписокЗначений;
	//СписокТиповЛокаций.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Порт"));
	//СписокТиповЛокаций.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.СтанцияЖД"));
	//СписокТиповЛокаций.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Страна"));
	////Евросиб - АСуслов 05.05.2023 11:41:07 #67492
	////(
	////СписокТиповЛокаций.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Субъект"));
	//СписокТиповЛокаций.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.НаселенныйПункт"));
	////)
	////Евросиб - АСуслов 05.05.2023 11:41:09 #67492
	//СписокТиповЛокаций.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Терминал"));
	//СписокТиповЛокаций.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Улица"));
	//СписокТиповЛокаций.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.ПустаяСсылка"));	
	//
	//ПараметрыОткрытияФормы = Новый Структура();
	//ПараметрыОткрытияФормы.Вставить("СписокТиповЛокаций", СписокТиповЛокаций);
	//ОткрытьФорму("Справочник.Мультилокации.ФормаВыбора", ПараметрыОткрытияФормы, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//// Евросиб Фролов)
	//ДИТ, Беляев СЮ, US 83045 / TA 85275, 16-05-2024, конец
КонецПроцедуры

&НаКлиенте
Процедура ЛокацияСдачиОчистка(Элемент, СтандартнаяОбработка)
	// Евросиб Фролов (16.02.2022 Task №46605
	Объект.СтокСдачи = Неопределено;
	// Евросиб Фролов)
КонецПроцедуры

&НаКлиенте
Процедура ЛокацияСдачиОткрытие(Элемент, СтандартнаяОбработка)
	//ДИТ, Беляев СЮ, US 83045 / TA 85275, 16-05-2024, начало (закомментировал блок)
	//// Евросиб Фролов (16.02.2022 Task №46605
	//СтандартнаяОбработка = Ложь;
	//
	//СписокТиповЛокаций = Новый СписокЗначений;
	//СписокТиповЛокаций.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Порт"));
	//СписокТиповЛокаций.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.СтанцияЖД"));
	//СписокТиповЛокаций.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Страна"));
	////Евросиб - АСуслов 05.05.2023 11:41:40 #67492
	////(
	////СписокТиповЛокаций.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Субъект"));
	//СписокТиповЛокаций.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.НаселенныйПункт"));
	////)
	////Евросиб - АСуслов 05.05.2023 11:41:42 #67492
	//СписокТиповЛокаций.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Терминал"));
	//СписокТиповЛокаций.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Улица"));
	//СписокТиповЛокаций.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.ПустаяСсылка"));
	//
	//ПараметрыФормыФормы = Новый Структура;
	//ПараметрыФормыФормы.Вставить("ТипЛокации", 		СписокТиповЛокаций);
	//ПараметрыФормыФормы.Вставить("Ключ", 			Объект.ЛокацияСдачи);
	//
	//ОткрытьФорму("Справочник.Мультилокации.ФормаОбъекта", ПараметрыФормыФормы);
	//// Евросиб Фролов)
	//ДИТ, Беляев СЮ, US 83045 / TA 85275, 16-05-2024, конец
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыКонтейнеры

&НаКлиенте
Процедура КонтейнерыПриИзменении(Элемент)
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 08.12.2023
	ЭтаФорма.Модифицированность = Истина;
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 08.12.2023
	ОбновитьИтоги();
	ОпределитьСтатусРелиза();
	НастроитьТекстКнопкиПечати();	
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// ДИТ US 76619 ТА 76735 Сержантова А.С. Начало: 15.11.2023 -баг при выделении строк SHift + ↓ 
	Если Элементы.Контейнеры.ВыделенныеСтроки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	// ДИТ US 76619 ТА 76735 Сержантова А.С. Конец: 15.11.2023
	
	Отказ = Истина;
	
	// Евросиб Фролов (30.05.2022 Task №49741
	// Закомментировал: разрешить добавлять строки если выдача от собственника.
	//Если Объект.ВыдачаОтСобственника Тогда
	//	ПоказатьПредупреждение(, "Запрещено добавлять строки при выдаче от собственника");
	//	Возврат;
	//КонецЕсли;
	// Евросиб Фролов)
	
	МассивВариантовСобственности = Новый Массив;
	МассивВариантовСобственности.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСобственности.Собственный"));
	// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
	//Было:
	//МассивВариантовСобственности.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСобственности.Арендованный"));
	//Стало:
	МассивВариантовСобственности.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСобственности.АрендаДлительная"));
	// ДИТ 65580 Давудов М.А. Конец: 23.02.2023
	МассивВариантовСобственности.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСобственности.Спот"));
	// ДИТ 65580 Давудов М.А. Начало: 23.02.2023
	//Было:
	//МассивВариантовСобственности.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСобственности.Море"));
	//МассивВариантовСобственности.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСобственности.Доплатные"));
	//МассивВариантовСобственности.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСобственности.Неизвестно"));
	//Стало:
	МассивВариантовСобственности.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСобственности.СпотМорской"));
	МассивВариантовСобственности.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыСобственности.СпотДоплатный"));
	// ДИТ 65580 Давудов М.А. Конец: 23.02.2023
	
	ПараметрыОтбор = Новый Структура;
	ПараметрыОтбор.Вставить("ВариантСобственности", МассивВариантовСобственности);
	ПараметрыОтбор.Вставить("Статус", ПредопределенноеЗначение("Перечисление.СтатусыКТК.Свободен"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбор);
	
	ОткрытьФорму("Справочник.ТЕ.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыПередУдалением(Элемент, Отказ)
	
	//ДИТ Шевченко А.В. BUG 75898 TA 75908 10.10.2023
	//ТекущиеДанные = Элементы.Контейнеры.ТекущиеДанные;
	////ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -начало
	//ТекКонтейнер = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ТекущиеДанные.КлючАналитикиПеревозки,"Контейнер");
	//
	//Если ЗначениеЗаполнено(ТекущиеДанные.ДобавленВЗаявку) Тогда
	//	ШаблонСообщения = "Контейнер %1 добавлен в заявку %2.
	//					|Необходимо удалить контейнер из заявки перед его удалением из документа.";
	//	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -начало
	//	//ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекущиеДанные.Контейнер, ТекущиеДанные.ДобавленВЗаявку);
	//	ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекКонтейнер, ТекущиеДанные.ДобавленВЗаявку);
	//	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -конец
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
	//					ТекстСообщения,
	//					Объект.Ссылка,
	//					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Контейнеры", ТекущиеДанные.НомерСтроки, "Контейнер"),, Отказ);				
	//КонецЕсли;
	Отказ = Истина;
	//ДИТ Шевченко А.В. BUG 75898 TA 75908 10.10.2023
	
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
	//Если ЗначениеЗаполнено(ТекущиеДанные.Контейнер) Тогда
	//Если ЗначениеЗаполнено(ТекКонтейнер) Тогда
	////ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -конец
	//	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -начало
	//	СтруктураПоискаКонт = Новый Структура("Контейнер",ТекКонтейнер);
	//	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -конец
	//	НайденныеСтроки = Объект.ТранспортныеСредства.НайтиСтроки(СтруктураПоискаКонт);
	//	Если НайденныеСтроки.Количество() > 0 Тогда
	//		Отказ = Истина;
	//		ТекстВопроса = СтрШаблон("Контейнер %1 был привязан в ТЧ «Водители, транспортные средства и компании автоперевозчики. При удалении связь будет очищена?",ТекущиеДанные.Контейнер);	
	//		СписокКнопок = Новый СписокЗначений;
	//		СписокКнопок.Добавить(КодВозвратаДиалога.Да, "Да");
	//		СписокКнопок.Добавить(КодВозвратаДиалога.Нет, "Нет");
	//		ДополнительныеПараметры = Новый Структура;
	//		//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -начало
	//		ДополнительныеПараметры.Вставить("Контейнер", ТекКонтейнер);
	//		//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -конец
	//		ДополнительныеПараметры.Вставить("ИдентификаторСтроки", ТекущиеДанные.ПолучитьИдентификатор());
	//		Оповещение = Новый ОписаниеОповещения("ВопросОбУдаленииСтроки", ЭтотОбъект, ДополнительныеПараметры);
	//		ПоказатьВопрос(Оповещение, ТекстВопроса, СписокКнопок);	
	//	КонецЕсли;	
	//КонецЕсли;
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Конец
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	// Евросиб Фролов (14.02.2022 Ticket№ 46606
	
	Если НоваяСтрока И ЗаполнятьПоПервойСтроке Тогда
		Если Объект.Контейнеры.Количество() > 0 Тогда
			ПерваяСтрока = Объект.Контейнеры[0];
			//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 –начало
			//Если ЗначениеЗаполнено(ПерваяСтрока.ИнструкцияПоСдаче) Тогда
			//	ТекущиеДанные = Элементы.Контейнеры.ТекущиеДанные;
			//	ТекущиеДанные.ИнструкцияПоСдаче = ПерваяСтрока.ИнструкцияПоСдаче;
			//КонецЕсли;
			ИнструкцияПоСдачеТек = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ПерваяСтрока.КлючАналитикиПеревозки,"ИнструкцияПоСдаче");
			Если ЗначениеЗаполнено(ИнструкцияПоСдачеТек) Тогда
				ТекущиеДанные = Элементы.Контейнеры.ТекущиеДанные;  
				// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 05.12.2023
				//ДобавитьЗначениеРеквизитаВКлюч(ТекущиеДанные.КлючАналитикиПеревозки,ИнструкцияПоСдачеТек,"ИнструкцияПоСдаче",,,ТекущиеДанные.ВерсияКлюча); 
				// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 05.12.2023
			КонецЕсли;
			//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 –конец
		КонецЕсли;		
	КонецЕсли;
	
	// Евросиб Фролов)
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НоваяСтрока И ОтменаРедактирования Тогда
		ОбновитьИтоги();
		ОпределитьСтатусРелиза();
	КонецЕсли;
	
	МассивЭлементовКлюча = Новый Массив;
	МассивЭлементовКлюча.Добавить("КонтейнерыКонтейнер");
	МассивЭлементовКлюча.Добавить("КонтейнерыТипоразмерКТК");
	МассивЭлементовКлюча.Добавить("КонтейнерыДатаВывоза");
	МассивЭлементовКлюча.Добавить("КонтейнерыДатаВозвратаКлиентом");
	МассивЭлементовКлюча.Добавить("КонтейнерыИнструкцияПоСдаче");
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 –начало
	Если МассивЭлементовКлюча.Найти(Элемент.ТекущийЭлемент.Имя) <> Неопределено Тогда
		ЭтаФорма.Модифицированность = МодифицированностьФлаг;	
	КонецЕсли;	
	МодифицированностьФлаг = Ложь;
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 –Конец
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыКонтейнерПриИзменении(Элемент)	
	// Заполним инструкцию по сдаче
	ТекущиеДанные = Элементы.Контейнеры.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Контейнер) Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьИнструкциюПоСдачеТекущегоКонтейнера(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыКонтейнер1ПриИзменении(Элемент) //ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23
	// Заполним инструкцию по сдаче
	ТекущиеДанные = Элементы.Контейнеры.ТекущиеДанные;   
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 05.12.2023
	//ДобавитьЗначениеРеквизитаВКлюч(ТекущиеДанные.КлючАналитикиПеревозки,ТекущиеДанные.Контейнер,"Контейнер",,,ТекущиеДанные.ВерсияКлюча);  
	//
	//// ДИТ US 76619 ТА 76735 Сержантова А.С. Начало: 22.11.2023
	//ОповеститьОбИзменении(Тип("СправочникСсылка.КлючиАналитикиПеревозки"));
	//// ДИТ US 76619 ТА 76735 Сержантова А.С. Конец: 22.11.2023 
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 05.12.2023   
	
	// ДИТ US 83041 ТА 84614 Сержантова А.С. Начало: 06.05.2024
	ЭтаФорма.МодифицированностьФлаг = Истина;
	// ДИТ US 83041 ТА 84614 Сержантова А.С. Конец: 06.05.2024

	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Контейнер) Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьИнструкциюПоСдачеТекущегоКонтейнера(ТекущиеДанные);    
	//Евросиб(ДИТ) Сержантова А.С. US 77172 ТА 83838 Начало 05.02.2025
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ДатаДобавленияВРелиз) Тогда
		ТекущиеДанные.ДатаДобавленияВРелиз = ТекущаяДата();
	КонецЕсли;
	//Евросиб(ДИТ) Сержантова А.С. US 77172 ТА 83838 Конец 05.02.2025
КонецПроцедуры


&НаКлиенте
Процедура КонтейнерыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Контейнеры.ТекущиеДанные;
	Если Поле = Элементы.КонтейнерыКонтейнер Тогда
		//СтандартнаяОбработка = Ложь;
		////ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 –начало
		////Если ЗначениеЗаполнено(ТекущиеДанные.Контейнер) Тогда
		////	ПоказатьЗначение(, ТекущиеДанные.Контейнер);
		////КонецЕсли;
		//КонтЗнч = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ТекущиеДанные.КлючАналитикиПеревозки,"Контейнер");
		//Если ЗначениеЗаполнено(КонтЗнч) Тогда
		//	ПоказатьЗначение(,КонтЗнч);
		//КонецЕсли;
		////ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 –конец
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыИнструкцияПоСдачеПриИзменении(Элемент)
	
    // Евросиб Фролов (14.02.2022 Ticket№ 46606
	// Если менеется текст инструкции в первой строке и установлена галка
	// заполнения по первой строке, то нужно перезаполнить инструкцию во всех строках.
	ТекущиеДанные = Элементы.Контейнеры.ТекущиеДанные;
	Если ТекущиеДанные.НомерСтроки = 1 И Объект.Контейнеры.Количество() > 1 И ЗаполнятьПоПервойСтроке Тогда
	
		Если ЗначениеЗаполнено(ТекущиеДанные.ИнструкцияПоСдаче) Тогда
			ИнструкцияПоСдаче = ТекущиеДанные.ИнструкцияПоСдаче;
			Для Каждого ТекущаяСтрока Из Объект.Контейнеры Цикл
				ТекущаяСтрока.ИнструкцияПоСдаче = ИнструкцияПоСдаче;
			КонецЦикла;
		КонецЕсли;	
				
	КонецЕсли;	
	// Евросиб Фролов)
	
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыВывозКонтейнераФИОВодителяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
	//ВыбратьВодителя(Элементы.Контейнеры.ТекущиеДанные);
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Конец
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыСдачаКонтейнераФИОВодителяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
	//++ДИТ Моисеенко Ю.В. task#60109 09.11.2022
	//ВыбратьВодителя(Элементы.Контейнеры.ТекущиеДанные, Ложь);
	//--ДИТ Моисеенко Ю.В. task#60109 09.11.2022
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Конец
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыВывозКонтейнераРегНомерТСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
	//ВыбратьВодителя(Элементы.Контейнеры.ТекущиеДанные);
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Конец
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыСдачаКонтейнераРегНомерТСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//++ДИТ Моисеенко Ю.В. task#60109 09.11.2022
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
	//ВыбратьВодителя(Элементы.Контейнеры.ТекущиеДанные, Ложь);
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Конец
	//--ДИТ Моисеенко Ю.В. task#60109 09.11.2022
КонецПроцедуры

//ДИТ Шевченко А.В. TASK 51973 03.06.2022 -Начало
&НаКлиенте
Процедура КонтейнерыАвтоперевозчикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь; //ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Начало

КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыАвтоперевозчикПоследняяМиляНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь; //ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Начало

КонецПроцедуры
//ДИТ Шевченко А.В. TASK 51973 03.06.2022 -Конец


// Процедура - Показать список перевозчиков
//
// Параметры:
//  ТЧМили	 - Строка - Имя табличной части автоперевозчиков первой или последней мили
//
&НаКлиенте
Процедура ПоказатьСписокПеревозчиков(ТЧМили)
	СписокПеревозчиков = Новый СписокЗначений;
	
	Для Каждого ТекущийПеревозчик Из Объект[ТЧМили] Цикл
		Если ЗначениеЗаполнено(ТекущийПеревозчик.Перевозчик) Тогда
			СписокПеревозчиков.Добавить(ТекущийПеревозчик.ИдентификаторСтроки, ТекущийПеревозчик.Перевозчик);
		КонецЕсли;	
	КонецЦикла;	
	
	Если СписокПеревозчиков.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Нет перевозчиков для выбора");
		Возврат;
	КонецЕсли;	
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораПеревозчика", ЭтотОбъект, Элементы.Контейнеры.ТекущиеДанные);
	СписокПеревозчиков.ПоказатьВыборЭлемента(Оповещение, "Выберите перевозчика.");
КонецПроцедуры	

&НаКлиенте
Процедура КонтейнерыАвтоперевозчикОчистка(Элемент, СтандартнаяОбработка)
	// Евросиб Фролов (12.04.2022 Ticket №0268463
	ТекущиеДанные = Элементы.Контейнеры.ТекущиеДанные;
	ТекущиеДанные.ИдентификаторСтрокиПеревозчика = "";
	ТекущиеДанные.Автоперевозчик = "";	
	// Евросиб Фролов)
	//++ДИТ Моисеенко Ю.В. task#60109 21.11.2022
	ТекущиеДанные.ВывозКонтейнераФИОВодителя 	= "";
	ТекущиеДанные.ВывозКонтейнераРегНомерТС 	= "";
	//--ДИТ Моисеенко Ю.В. task#60109 21.11.2022
КонецПроцедуры

//ДИТ Шевченко А.В. TASK 51973 03.06.2022 -Начало
&НаКлиенте
Процедура КонтейнерыАвтоперевозчикПоследняяМиляОчистка(Элемент, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Контейнеры.ТекущиеДанные;
	ТекущиеДанные.ИдентификаторСтрокиПеревозчикаПоследняяМиля = "";
	ТекущиеДанные.АвтоперевозчикПоследняяМиля = "";
	//++ДИТ Моисеенко Ю.В. task#60109 21.11.2022
	ТекущиеДанные.СдачаКонтейнераФИОВодителя 	= "";
	ТекущиеДанные.СдачаКонтейнераРегНомерТС 	= "";
	//--ДИТ Моисеенко Ю.В. task#60109 21.11.2022
КонецПроцедуры
//ДИТ Шевченко А.В. TASK 51973 03.06.2022 -Конец

&НаКлиенте
Процедура КонтейнерыВывозКонтейнераФИОВодителяОчистка(Элемент, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Контейнеры.ТекущиеДанные;
	ТекущиеДанные.ВывозКонтейнераРегНомерТС = "";
	ТекущиеДанные.ИдентификаторСтрокиТС = "";
	//++ДИТ Моисеенко Ю.В. task#60109 09.11.2022
	ТекущиеДанные.Автоперевозчик = "";
	//--ДИТ Моисеенко Ю.В. task#60109 09.11.2022
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыСдачаКонтейнераФИОВодителяОчистка(Элемент, СтандартнаяОбработка)
	//++ДИТ Моисеенко Ю.В. task#60109 09.11.2022
	ТекущиеДанные = Элементы.Контейнеры.ТекущиеДанные;
	ТекущиеДанные.СдачаКонтейнераРегНомерТС 			= "";
	ТекущиеДанные.ИдентификаторСтрокиТСПоследняяМиля 	= "";
	ТекущиеДанные.АвтоперевозчикПоследняяМиля 			= "";
	//--ДИТ Моисеенко Ю.В. task#60109 09.11.2022
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыВывозКонтейнераРегНомерТСОчистка(Элемент, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Контейнеры.ТекущиеДанные;
	ТекущиеДанные.ВывозКонтейнераФИОВодителя = "";
	ТекущиеДанные.ИдентификаторСтрокиТС = "";
	//++ДИТ Моисеенко Ю.В. task#60109 09.11.2022
	ТекущиеДанные.Автоперевозчик 		= "";
	//--ДИТ Моисеенко Ю.В. task#60109 09.11.2022
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыСдачаКонтейнераРегНомерТСОчистка(Элемент, СтандартнаяОбработка)
	//++ДИТ Моисеенко Ю.В. task#60109 09.11.2022
	ТекущиеДанные = Элементы.Контейнеры.ТекущиеДанные;
	ТекущиеДанные.СдачаКонтейнераФИОВодителя 			= "";
	ТекущиеДанные.ИдентификаторСтрокиТСПоследняяМиля 	= "";
	ТекущиеДанные.АвтоперевозчикПоследняяМиля 			= "";
	//--ДИТ Моисеенко Ю.В. task#60109 09.11.2022
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыВывозКонтейнераФИОВодителяПриИзменении(Элемент) //ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023
	ТекущиеДанные = Элементы.Контейнеры.ТекущиеДанные;
	СтруктураТЧМили = Новый Структура;
	СтруктураТЧМили.Вставить("ФИОВодителя",ТекущиеДанные.ВывозКонтейнераФИОВодителя);   
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 05.12.2023
	//ДобавитьЗначениеРеквизитаВКлюч(ТекущиеДанные.КлючАналитикиПеревозки,ТекущиеДанные.ВывозКонтейнераФИОВодителя,"ФИОВодителя",ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПерваяМиля"),СтруктураТЧМили,ТекущиеДанные.ВерсияКлюча);
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 05.12.2023
	МодифицированностьФлаг = ЭтаФорма.Модифицированность;
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыСдачаКонтейнераФИОВодителяПриИзменении(Элемент) //ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023
	ТекущиеДанные = Элементы.Контейнеры.ТекущиеДанные;
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 05.12.2023
	//СтруктураТЧМили = Новый Структура;
	//СтруктураТЧМили.Вставить("ФИОВодителя",ТекущиеДанные.СдачаКонтейнераФИОВодителя); 
	//ДобавитьЗначениеРеквизитаВКлюч(ТекущиеДанные.КлючАналитикиПеревозки,ТекущиеДанные.СдачаКонтейнераФИОВодителя,"ФИОВодителя",ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПоследняяМиля"),СтруктураТЧМили,ТекущиеДанные.ВерсияКлюча);
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 05.12.2023
	МодифицированностьФлаг = ЭтаФорма.Модифицированность;
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыВывозКонтейнераРегНомерТСПриИзменении(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Контейнеры.ТекущиеДанные;  
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 05.12.2023
	//СтруктураТЧМили = Новый Структура;
	//СтруктураТЧМили.Вставить("РегНомерТС",ТекущиеДанные.ВывозКонтейнераРегНомерТС);
	//ДобавитьЗначениеРеквизитаВКлюч(ТекущиеДанные.КлючАналитикиПеревозки,ТекущиеДанные.ВывозКонтейнераРегНомерТС,"РегНомерТС",ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПерваяМиля"),СтруктураТЧМили,ТекущиеДанные.ВерсияКлюча);
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 05.12.2023	
	МодифицированностьФлаг = ЭтаФорма.Модифицированность;
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыСдачаКонтейнераРегНомерТСПриИзменении(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Контейнеры.ТекущиеДанные;  
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 05.12.2023	
	//СтруктураТЧМили = Новый Структура;
	//СтруктураТЧМили.Вставить("РегНомерТС",ТекущиеДанные.СдачаКонтейнераРегНомерТС);
	//ДобавитьЗначениеРеквизитаВКлюч(ТекущиеДанные.КлючАналитикиПеревозки,ТекущиеДанные.СдачаКонтейнераРегНомерТС,"РегНомерТС",ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПоследняяМиля"),СтруктураТЧМили,ТекущиеДанные.ВерсияКлюча);
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 05.12.2023
	МодифицированностьФлаг = ЭтаФорма.Модифицированность;
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыАвтоперевозчикПриИзменении(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Контейнеры.ТекущиеДанные;  
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 05.12.2023
	//СтруктураТЧМили = Новый Структура;
	//СтруктураТЧМили.Вставить("Автоперевозчик",ТекущиеДанные.Автоперевозчик);
	//Если ТипЗнч(ТекущиеДанные.Автоперевозчик) = Тип("СправочникСсылка.Контрагенты") Тогда
	//	СтруктураТЧМили.Вставить("ИНН",ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Автоперевозчик,"ИНН"));
	//	СтруктураТЧМили.Вставить("КПП",ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Автоперевозчик,"КПП"));
	//Иначе
	//	СтруктураТЧМили.Вставить("ИНН","");
	//	СтруктураТЧМили.Вставить("КПП","");
	//КонецЕсли;	
	//ДобавитьЗначениеРеквизитаВКлюч(ТекущиеДанные.КлючАналитикиПеревозки,ТекущиеДанные.Автоперевозчик,"Автоперевозчик",ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПерваяМиля"),СтруктураТЧМили,ТекущиеДанные.ВерсияКлюча);
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 05.12.2023	
	МодифицированностьФлаг = ЭтаФорма.Модифицированность;

КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыАвтоперевозчикПоследняяМиляПриИзменении(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Контейнеры.ТекущиеДанные;
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 05.12.2023
	//СтруктураТЧМили = Новый Структура;
	//СтруктураТЧМили.Вставить("Автоперевозчик",ТекущиеДанные.АвтоперевозчикПоследняяМиля);
	//Если ТипЗнч(ТекущиеДанные.АвтоперевозчикПоследняяМиля) = Тип("СправочникСсылка.Контрагенты") Тогда
	//	СтруктураТЧМили.Вставить("ИНН",ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ТекущиеДанные.АвтоперевозчикПоследняяМиля,"ИНН"));
	//	СтруктураТЧМили.Вставить("КПП",ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ТекущиеДанные.АвтоперевозчикПоследняяМиля,"КПП"));
	//Иначе
	//	СтруктураТЧМили.Вставить("ИНН","");
	//	СтруктураТЧМили.Вставить("КПП","");
	//КонецЕсли;
	//ДобавитьЗначениеРеквизитаВКлюч(ТекущиеДанные.КлючАналитикиПеревозки,ТекущиеДанные.АвтоперевозчикПоследняяМиля,"Автоперевозчик",ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПоследняяМиля"),СтруктураТЧМили,ТекущиеДанные.ВерсияКлюча);
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 05.12.2023
	МодифицированностьФлаг = ЭтаФорма.Модифицированность;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыТранспортныеСредства

&НаКлиенте
Процедура ТранспортныеСредстваПриИзменении(Элемент)
	ИзмененыКлючевыеПоля(); //ДИТ Шевченко А.В. 51340 12.10.2022
	НастроитьТекстКнопкиПечати();
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеСредстваПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)	
	Если Не РазрешеноДобавлятьВодителей() Тогда
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеСредстваПередУдалением(Элемент, Отказ)
	
	Если Объект.Автоперевозка <> ПредопределенноеЗначение("Перечисление.ВариантыАвтоперевозки.СиламиЕвросиб") Тогда
		ПоказатьПредупреждение(, "Нельзя удалять сведения о водителях, если в поле ""Автоперевозка на первой миле"" установлено ""Силами клиента"" или ""Не требуется""");
		Отказ = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеСредстваПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда		
		Элемент.ТекущиеДанные.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	КонецЕсли;
КонецПроцедуры

//ДИТ Шевченко А.В. TASK 51973 01.06.2022 -Начало
&НаКлиенте
Процедура ТранспортныеСредстваПоследняяМиляПриИзменении(Элемент)
	ИзмененыКлючевыеПоля(); //ДИТ Шевченко А.В. 51340 12.10.2022
	НастроитьТекстКнопкиПечати();
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеСредстваПоследняяМиляПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	//Если Не РазрешеноДобавлятьВодителей() Тогда
	//	Отказ = Истина;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеСредстваПоследняяМиляПередУдалением(Элемент, Отказ)
	Если Объект.АвтоперевозкаПоследняяМиля <> ПредопределенноеЗначение("Перечисление.ВариантыАвтоперевозки.СиламиЕвросиб") Тогда
		ПоказатьПредупреждение(, "Нельзя удалять сведения о водителях, если в поле ""Автоперевозка на последней миле"" установлено ""Силами клиента"" или ""Не требуется""");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеСредстваПоследняяМиляПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда		
		Элемент.ТекущиеДанные.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	КонецЕсли;
КонецПроцедуры
//ДИТ Шевченко А.В. TASK 51973 01.06.2022 -Конец

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПривязатьКонтейнерыКВодителюАвто(Команда) //ДИТ Шевченко А.В. 51340 14.10.2022
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
	//Для Каждого СтрокаОсновынеДанные Из Объект.Контейнеры Цикл
	//	    СтруктураОтбора = Новый Структура("Контейнер",СтрокаОсновынеДанные.Контейнер);
	//	    НайденСтроки = Объект.ТранспортныеСредства.НайтиСтроки(СтруктураОтбора);
	//		Если НайденСтроки.Количество() > 0 Тогда
	//			Продолжить;
	//		КонецЕсли;	
	//		СтруктураОтбора = Новый Структура("Контейнер",ПредопределенноеЗначение("Справочник.ТЕ.ПустаяСсылка"));
	//		НайденСтроки = Объект.ТранспортныеСредства.НайтиСтроки(СтруктураОтбора);
	//		Если НайденСтроки.Количество() > 0 Тогда
	//			НайденСтроки[0].Контейнер = СтрокаОсновынеДанные.Контейнер;
	//		КонецЕсли;	
	//КонецЦикла;
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Конец	
КонецПроцедуры

&НаКлиенте
Процедура ПривязатьКонтейнерыКВодителюРуч(Команда) //ДИТ Шевченко А.В. 51340 14.10.2022
//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
//Если Объект.ТранспортныеСредства.Количество() = 0 Тогда
//		ПоказатьПредупреждение(, "Не заполнен список водителей и автоперевозчиков.
//								|Невозможно выполнить связь контейнеров");
//		Возврат;
//	ИначеЕсли Объект.ТранспортныеСредства.Количество() > 0 Тогда
//		ОткрытьФорму("Документ.РелизКлиента.Форма.ФормаПодбораКонтейнеровВТС",
//	             Новый Структура("ДокументОбъект", 
//				 					Объект),ЭтаФорма);		 
//КонецЕсли;
//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Конец								
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзExcel(Команда)
	
	// Евросиб Фролов (30.05.2022 Task №49741
	// Закомментировал: разрешить загрузку из Excel если выдача от собственника.
	//Если Объект.ВыдачаОтСобственника Тогда
	//	ПоказатьПредупреждение(, "Запрещено добавлять строки при выдаче от собственника");
	//	Возврат;
	//КонецЕсли;
	// Евросиб Фролов)
	//ДИТ Шевченко А.В. BUG 75898 TA 75908 10.10.2023
	//ДоступноеКоличество = Объект.ОбщееКоличествоКТКВРелизе - Объект.Контейнеры.Количество();

	//Если ДоступноеКоличество <= 0 Тогда
	//	ПоказатьПредупреждение(, "В документе уже заполнено максимально возмозможное количество КТК.");
	//	Возврат;
	//КонецЕсли;
		
	МассивКлючей = Новый Массив;
	Для Каждого СтрокаТЧ Из Объект.Контейнеры Цикл
		МассивКлючей.Добавить(СтрокаТЧ.КлючАналитикиПеревозки);
	КонецЦикла;
	КлючиСПустымКонтейнером = ПолучитьМассивКлючейСПустымКонтейнером(МассивКлючей);
	
	ПараметрыЧтения = Новый Структура;
	//ПараметрыЧтения.Вставить("КоличествоСтрок", ДоступноеКоличество);
	ПараметрыЧтения.Вставить("КоличествоСтрок", КлючиСПустымКонтейнером.Количество());
	//ДИТ Шевченко А.В. BUG 75898 TA 75908 10.10.2023
	ПараметрыЧтения.Вставить("ТипоразмерКТК", 	Объект.ТипоразмерКТК);
	ПараметрыЧтения.Вставить("СтокВыдачи", 		Объект.СтокВыдачи);
	
	ОповещениеДляЗагрузкиКТК = Новый ОписаниеОповещения("РезультатЧтенияКТКИзТабДокумента", ЭтаФорма);
	ОткрытьФорму("Документ.РелизКлиента.Форма.ДобавлениеКонтейнеров", ПараметрыЧтения, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,ОповещениеДляЗагрузкиКТК, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// ++ ДИТ_Агафонов_task 56709 11.09.2022
//Также на форму добавлена команда и кнопка ПодобратьИзРелизаСобственника
&НаКлиенте
Процедура ПодобратьИзРелизаСобственника(Команда)
	ДоступноеКоличество = Объект.ОбщееКоличествоКТКВРелизе - Объект.Контейнеры.Количество();

	Если ДоступноеКоличество <= 0 Тогда
		ПоказатьПредупреждение(, "В документе уже заполнено максимально возмозможное количество КТК.");
		Возврат;
	КонецЕсли;
	
	ПараметрыЧтения = Новый Структура;
	ПараметрыЧтения.Вставить("КоличествоСтрок", ДоступноеКоличество);
	ПараметрыЧтения.Вставить("ТипоразмерКТК", 	Объект.ТипоразмерКТК);
	ПараметрыЧтения.Вставить("СтокВыдачи", 		Объект.СтокВыдачи);
	ПараметрыЧтения.Вставить("РелизКлиента", 	Объект.Ссылка);
	ПараметрыЧтения.Вставить("РелизСобственника",Объект.РелизСобственника);
	ПараметрыЧтения.Вставить("МассивКТК", 		ПолучитьМассивКТК());
	
	ОповещениеДляЗагрузкиКТК = Новый ОписаниеОповещения("РезультатЧтенияКТКИзТабДокумента", ЭтаФорма);
	ОткрытьФорму("Документ.РелизКлиента.Форма.ДобавлениеКонтейнеровРелизаСобственника", ПараметрыЧтения, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,ОповещениеДляЗагрузкиКТК, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивКТК()
	
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 –начало
	//Возврат Объект.Контейнеры.Выгрузить().ВыгрузитьКолонку("Контейнер");
	ДокОб = РеквизитФормыВЗначение("Объект");
	ТЗКТК = ДокОб.ПолучитьТаблицуКТКИзКлючейАналитикиТЧ();
	Возврат ТЗКТК.ВыгрузитьКолонку("Контейнер");
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 –конец

КонецФункции // ()

// -- ДИТ_Агафонов_task 56709 11.09.2022

&НаКлиенте
Процедура ВставитьВодителейИзExcel(Команда)
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
	//ДоступноеКоличество = Объект.ОбщееКоличествоКТКВРелизе - Объект.ТранспортныеСредства.Количество();
	//
	//Если Не РазрешеноДобавлятьВодителей(ДоступноеКоличество) Тогда
	//	Возврат;
	//КонецЕсли;	
	//	
	//ПараметрыЧтения = Новый Структура;
	//ПараметрыЧтения.Вставить("КоличествоСтрок", ДоступноеКоличество);
	//ДопПараметры = Новый Структура;
	//ДопПараметры.Вставить("ИмяТЧ","ТранспортныеСредства");
	//
	//ОповещениеЧтениеТранспортныхСредств = Новый ОписаниеОповещения("РезультатЧтенияТранспортныхСредств", ЭтаФорма,ДопПараметры);
	//ОткрытьФорму("Документ.Заявка.Форма.ДобавлениеТранспортныхСредств", ПараметрыЧтения,ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,ОповещениеЧтениеТранспортныхСредств, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    //ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -конец
КонецПроцедуры

//ДИТ Шевченко А.В. TASK 51973 03.06.2022 -Начало
&НаКлиенте
Процедура ВставитьВодителейИзExcelПоследняяМиля(Команда)
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
	//ДоступноеКоличество = Объект.ОбщееКоличествоКТКВРелизе - Объект.ТранспортныеСредства.Количество();
	//
	////Если Не РазрешеноДобавлятьВодителей(ДоступноеКоличество) Тогда
	////	Возврат;
	////КонецЕсли;	
	//	
	//ПараметрыЧтения = Новый Структура;
	////ПараметрыЧтения.Вставить("КоличествоСтрок", ДоступноеКоличество);
	//ДопПараметры = Новый Структура;
	//ДопПараметры.Вставить("ИмяТЧ","ТранспортныеСредстваПоследняяМиля");
	//	
	//ОповещениеЧтениеТранспортныхСредств = Новый ОписаниеОповещения("РезультатЧтенияТранспортныхСредств", ЭтаФорма,ДопПараметры);
	//ОткрытьФорму("Документ.Заявка.Форма.ДобавлениеТранспортныхСредств", ПараметрыЧтения,ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,ОповещениеЧтениеТранспортныхСредств, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    //ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Конец
КонецПроцедуры
//ДИТ Шевченко А.В. TASK 51973 03.06.2022 -Конец

&НаКлиенте
Процедура СвязатьСАвтоперевозкой(Команда)
	//ДИТ Шевченко А.В. TASK 51973 06.06.2022 -Начало
	//ДИТ Шевченко А.В. TASK 59945 06.10.2022 -Начало
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
	//ОткрытьФормуСвязиСАвтоперевозкой("ТранспортныеСредства","ИдентификаторСтрокиТС");
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Конец
	//ДИТ Шевченко А.В. TASK 59545 06.10.2022 -конец
	//ДИТ Шевченко А.В. TASK 51973 06.06.2022 -Конец
КонецПроцедуры

&НаКлиенте
Процедура СвязатьСАвтоперевозкойПоследняяМиля(Команда)
	//ДИТ Шевченко А.В. TASK 51973 06.06.2022 -Начало
	//ДИТ Шевченко А.В. TASK 59545 06.10.2022 -Начало
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
	//ОткрытьФормуСвязиСАвтоперевозкой("ТранспортныеСредстваПоследняяМиля","ИдентификаторСтрокиТСПоследняяМиля");		
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Конец
	//ДИТ Шевченко А.В. TASK 59545 06.10.2022 -конец
	//ДИТ Шевченко А.В. TASK 51973 06.06.2022 -Конец
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьФормуСвязиСАвтоперевозкой(ТранспортныеСредстваИмяТЧ,ИдентификаторСтрокиТСИмя)
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
	//ДИТ Шевченко А.В. TASK 59545 06.10.2022 -Начало
	//Если Объект.ТранспортныеСредства.Количество() = 0 Тогда
	//	// Не с чем связывать
	//	ПоказатьПредупреждение(, "Не заполнен список водителей и автоперевозчиков.
	//							|Невозможно выполнить связь контейнеров");
	//	Возврат;
	//ИначеЕсли Объект[ТранспортныеСредстваИмяТЧ].Количество() > 0 Тогда
	//	// Есть только список водителей - привязываем к водителям
	//	ОткрытьФорму("Документ.РелизКлиента.Форма.СвязкаТабличныхЧастей",
	//             Новый Структура("ДокументОбъект, ПривязкаКВодителям, ТранспортныеСредстваИмяТЧ, ИдентификаторСтрокиТСИмя", 
	//			 					Объект, 
	//								Истина, 
	//								ТранспортныеСредстваИмяТЧ,
	//			 					ИдентификаторСтрокиТСИмя),ЭтаФорма);		 
	//КонецЕсли;
	//ДИТ Шевченко А.В. TASK 59545 06.10.2022 -конец
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Конец
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьДанныеИзЗапроса(Команда)

	// Сначала обновляем идентификатор строки заявке, т.к. при
	// открытой форме могли выбрать этот релиз в заявке и сохранить данные.
	ОпределитьИдентификаторРелиза();
	
	Если Не ЗначениеЗаполнено(ИдентификаторСтрокиЗаявки) Тогда
		ПоказатьПредупреждение(, "Не определена строка запроса на КТК, по которой был создан данный релиз.
									|Обновить данные невозможно.");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Заявка) Тогда
		ПоказатьПредупреждение(, "Не указана заявка.
									|Обновить данные невозможно.");
		Возврат;
	КонецЕсли;
	
	ЕстьУдаленныеДанные = Ложь;
	//ПроверитьУдаленныеДанныеВЗапросе(ЕстьУдаленныеДанные);
	
	Если ЕстьУдаленныеДанные Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОПерезаполненииПоЗапросу", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение, "При обновлении будет произведена очистка связки номера контейнера с водителем и/или перевозчикау по отсутствующим в запросе на КТК водителям. Продолжить?", Режим, 0);
	Иначе	
		ОбновитьДанныеИзЗапросаНаСервере();
		// ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 21.12.2022
		НастроитьДоступностьЭлементовШапки();
		// ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 21.12.2022
	КонецЕсли;   
	
	// ДИТ US 79950 ТА 79951 Сержантова А.С. Начало: 21.02.2024
	Оповестить("НеобходимоОбновитьФормуЗаявкиДляРаботыСЗапросомКТК", , ЭтаФорма);
	ЗаполнитьТаблицуПоКлючамАналитики();
	// ДИТ  US 79950 ТА 79951 Сержантова А.С. Конец: 21.02.2024
	
КонецПроцедуры

//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, начало
&НаСервере
Функция ПоВыбранномуТерминалуТребуетсяОтправкаXML(ПараметрыТерминала = неопределено)
	//ДИТ Шевченко А.В. 03.10.2022 57967 -начало
	Если ПараметрыТерминала <> Неопределено И Объект.ТерминалВыдачи.EDIОбменСТерминалами Тогда
		ПараметрыТерминала.ЭлектронныйАдресТерминала = Объект.ТерминалВыдачи.EmailОбменаСТерминалами;
		ПараметрыТерминала.XmlВерсияРелизаКлиента = Объект.ТерминалВыдачи.XmlВерсияРелизаКлиента;
		Если Не ЗначениеЗаполнено(Объект.ТерминалВыдачи.XmlВерсияРелизаКлиента) Тогда
			ПараметрыТерминала.XmlВерсияРелизаКлиента = Перечисления.XmlВерсияРелизаКлиента.ЕдиныйФайлXml;
		КонецЕсли;
		// ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 22.12.2022
		ПараметрыТерминала.ВариантыАвтоперевозкиНеТребуется = Объект.Автоперевозка = Перечисления.ВариантыАвтоперевозки.НеТребуется;
		// ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 22.12.2022
	КонецЕсли;
	Возврат Объект.ТерминалВыдачи.EDIОбменСТерминалами;	
	//ДИТ Шевченко А.В. 03.10.2022 57967 -конец
КонецФункции   
//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, конец 

//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, начало 
&НаСервереБезКонтекста
Функция УжеЕстьОтправленныеПисьма(вхСсылка)
	Возврат РегистрыСведений.ОтправленныеПоПочтеДокументы.УжеЕстьЗаписиПоДокументу(вхСсылка)	
КонецФункции
//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, конец 

//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, начало
&НаКлиенте
Процедура ПоказатьДиалогОтправкиПоПочте(ПараметрыТерминала)
	
	ТекущаяДатаВНужномФормате = Формат(ТекущаяДата(),"ДФ='dd.MM.yyyy ЧЧ.мм.сс'");
	ДатаДокументаВНужномФормате = Формат(Объект.Дата,"ДФ='dd.MM.yyyy ЧЧ.мм.сс'"); 
	//ДИТ Шевченко А.В. 03.10.2022 57967 -начало
	МассивВлож = Новый Массив;
	Если ПараметрыТерминала.XmlВерсияРелизаКлиента = ПредопределенноеЗначение("Перечисление.XmlВерсияРелизаКлиента.НесколькоФайловXml") Тогда
		// ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 22.12.2022
		// Было:
		// СтрокиКВыгрузке = ПолучитьСтрокиКВыгрузке(Объект.НомернаяВыдача); 
		//Стало:
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("НомернаяВыдача",Объект.НомернаяВыдача);
		СтруктураПараметров.Вставить("ВариантыАвтоперевозкиНеТребуется",ПараметрыТерминала.ВариантыАвтоперевозкиНеТребуется);
		
		СтрокиКВыгрузке = ПолучитьСтрокиКВыгрузке(СтруктураПараметров);
		// ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 22.12.2022
		Если УжеЕстьОтправленныеПисьма(Объект.Ссылка) Тогда
			ПризнакОбновления = Истина;
		Иначе
			ПризнакОбновления = Ложь;
		КонецЕсли;	
		
		Если СтрокиКВыгрузке.Количество() > 0 Тогда
			// ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 22.12.2022
			// Было:
			//ПараметрыВыгрузки = Новый Структура("СсылкаРелизКлиента, СтрокиКВыгрузке, НомернаяВыдача,ОбовлениеРелиза,УдалениеРелиза", Объект.Ссылка, СтрокиКВыгрузке, Объект.НомернаяВыдача,ПризнакОбновления,ПараметрыТерминала.Свойство("УдалениеРелиза"));	 
			//Стало:
			ПараметрыВыгрузки = Новый Структура;
			ПараметрыВыгрузки.Вставить("СсылкаРелизКлиента",				Объект.Ссылка);
			ПараметрыВыгрузки.Вставить("СтрокиКВыгрузке",					СтрокиКВыгрузке);
			ПараметрыВыгрузки.Вставить("НомернаяВыдача",					Объект.НомернаяВыдача);
			ПараметрыВыгрузки.Вставить("ОбовлениеРелиза",					ПризнакОбновления);
			ПараметрыВыгрузки.Вставить("УдалениеРелиза",					ПараметрыТерминала.Свойство("УдалениеРелиза"));
			ПараметрыВыгрузки.Вставить("ВариантыАвтоперевозкиНеТребуется",	ПараметрыТерминала.ВариантыАвтоперевозкиНеТребуется);
			// ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 22.12.2022
			ЕСОбменСервер.ВыгрузитьXMLНаТерминал(МассивВлож,ПараметрыВыгрузки);   
		КонецЕсли;
	ИначеЕсли ПараметрыТерминала.XmlВерсияРелизаКлиента = ПредопределенноеЗначение("Перечисление.XmlВерсияРелизаКлиента.ЕдиныйФайлXml") Тогда	
		Адрес = ВыгрузитьВXMLНаСервере(ПараметрыТерминала.Свойство("УдалениеРелиза"));
		ИмяФайла = Строка(Объект.НомерРелиза)+"_"+Строка(ДатаДокументаВНужномФормате)+".xml";
		СтруктураВложения = Новый Структура("Представление,АдресВоВременномХранилище",ИмяФайла,Адрес);
		МассивВлож.Добавить(СтруктураВложения);
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыТерминала.ЭлектронныйАдресТерминала) = Тип("Строка") Тогда
		Получатели = СокрЛП(ПараметрыТерминала.ЭлектронныйАдресТерминала);
	Иначе
		Получатели = ПараметрыТерминала.ЭлектронныйАдресТерминала;
	КонецЕсли;	
	
	СписокВложений = МассивВлож;      
	//ДИТ Шевченко А.В. 03.10.2022 57967 -конец
	
	ТекстПисьма = "";   
	Если УжеЕстьОтправленныеПисьма(Объект.Ссылка) Тогда
		ШаблонТемы = "Корректировка запроса от %1 на выдачу контейнеров по релизу Евросиб: %2 в xml формате";
	Иначе
		ШаблонТемы = "Запрос от %1 на выдачу контейнеров по релизу Евросиб: %2 в xml формате";
	КонецЕсли;
	
	Если ПараметрыТерминала.Свойство("ЗапросНаОтмену") 
		И ПараметрыТерминала.ЗапросНаОтмену Тогда
		ШаблонТемы = "Отмена. Запрос от %1 на выдачу контейнеров по релизу Евросиб: %2";
		
		Если ПараметрыТерминала.Свойство("ТекстПисьма") 
			И ЗначениеЗаполнено(ПараметрыТерминала.ТекстПисьма) Тогда
			ТекстПисьма = ПараметрыТерминала.ТекстПисьма;	
		КонецЕсли;
	КонецЕсли;
	
	ТемаПисьма = СтрШаблон(ШаблонТемы, ТекущаяДатаВНужномФормате, Объект.НомерРелиза);
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСПочтовымиСообщениями") Тогда
		МодульРаботаСПочтовымиСообщениямиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСПочтовымиСообщениямиКлиент");
		ПараметрыОтправки = МодульРаботаСПочтовымиСообщениямиКлиент.ПараметрыОтправкиПисьма();
		ПараметрыОтправки.Тема = ТемаПисьма;   
		ПараметрыОтправки.Текст = ТекстПисьма;
		ПараметрыОтправки.Получатель = Получатели;
		ПараметрыОтправки.Вложения = СписокВложений; 
		ПараметрыОтправки.Предмет = Объект.Ссылка;
		МодульРаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо(ПараметрыОтправки);
	КонецЕсли;
КонецПроцедуры
//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, конец   

&НаКлиенте
Процедура ЗапросНаТерминал(Команда)
    // ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 22.12.2022
	ОчиститьСообщения();	
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 22.12.2022
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ ЭтаФорма.Модифицированность ИЛИ НЕ Объект.Проведен Тогда
		
		Сообщить("Перед печатью нужно провести релиз клиента!");
		Возврат;
		
	КонецЕсли;
	//ДИТ Шевченко А.В. US 62482 ТА 68277 17.04.2023 -Начало
	//СтрокиБезКонтейнера = Объект.Контейнеры.НайтиСтроки(Новый Структура("Контейнер", ПредопределенноеЗначение("Справочник.ТЕ.ПустаяСсылка")));
	//Если СтрокиБезКонтейнера.Количество() > 0 Тогда
	//	ПоказатьПредупреждение(, "Не заполнены обязательные поля для отправки формы запроса на релиз КТК: ""Контейнер"" в списке контейнеров.");
	//	Возврат;
	//КонецЕсли;
	//ДИТ Шевченко А.В. US 62482 ТА 68277 17.04.2023 -Конец
	//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, начало    
	
	// ДИТ US 76995 ТА 76997 Сержантова А.С. Начало: 07.11.2023 
	//Евросиб Шевченко А.В. US 73357 TA 115689 04.08.2025
	//Если ЗначениеЗаполнено(Объект.ТерминалВыдачи) И не ЗначениеЗаполнено(Объект.КонтактТерминала) Тогда
	Если ЗначениеЗаполнено(Объект.ТерминалВыдачи) И не ЗначениеЗаполнено(Объект.КонтактТерминала) И НЕ Объект.ВыдачаОтСобственника Тогда
	//Евросиб Шевченко А.В. US 73357 TA 115689 04.08.2025	
		ОбщегоНазначенияКлиент.СообщитьПользователю(
		"Не заполнены контакты терминала выдачи",
		,
		"КонтактыТерминалаВыдачи",,);  
		Возврат;
	КонецЕсли;
	// ДИТ US 76995 ТА 76997 Сержантова А.С. Конец: 07.11.2023
	
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 22.12.2022
	// Было:
	//ПараметрыТерминала = Новый Структура("ЭлектронныйАдресТерминала,XmlВерсияРелизаКлиента"); 
	//Стало:
	ПараметрыТерминала = Новый Структура("ЭлектронныйАдресТерминала,XmlВерсияРелизаКлиента,ВариантыАвтоперевозкиНеТребуется");
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 22.12.2022
	
	Если ПоВыбранномуТерминалуТребуетсяОтправкаXML(ПараметрыТерминала) Тогда
				
		// ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 21.12.2022 
		Ошибки = Неопределено;
		Отказ = Ложь;
		Если ПараметрыТерминала.XmlВерсияРелизаКлиента = ПредопределенноеЗначение("Перечисление.XmlВерсияРелизаКлиента.ЕдиныйФайлXml") Тогда
			//Рез = ПроверитьСтрокиПоВодителям();
			//Если НЕ рез Тогда
			//	ПоказатьПредупреждение(,"Запрос не может быть отправлен на терминал, т.к. не заполнена ни одна строка в данных по автоперевозке на первой миле");
			//	Возврат;
			//КонецЕсли;
		ИначеЕсли ПараметрыТерминала.XmlВерсияРелизаКлиента = ПредопределенноеЗначение("Перечисление.XmlВерсияРелизаКлиента.НесколькоФайловXml")
			И Не ПараметрыТерминала.ВариантыАвтоперевозкиНеТребуется Тогда 
			//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
			//ДИТ Шевченко А.В. 51340 14.10.2022 -начало
			//Если Объект.ТранспортныеСредства.Количество() = 0 Тогда
			//	ПоказатьПредупреждение(, "Данные не могут быть отправлены на терминал, не заполнена ни одна строка ТЧ «Водители, транспортные средства и компании автоперевозчики");
			//	Возврат;                                                                                 
			//КонецЕсли;
			
			МассивКлючей = Новый Массив;
			Для Каждого СтрокаТЧ Из Объект.Контейнеры Цикл
				МассивКлючей.Добавить(СтрокаТЧ.КлючАналитикиПеревозки);
			КонецЦикла;	
			
			//Если ЗаполненостьТСПустая(МассивКлючей) Тогда
			//	ПоказатьПредупреждение(, "Данные не могут быть отправлены на терминал, не заполнена ни одна строка ТЧ «Водители, транспортные средства и компании автоперевозчики");
			//	Возврат;
			//КонецЕсли;	
			
			//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
			//ДИТ Шевченко А.В. 51340 14.10.2022 -конец
			//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -конец
	//		Для Каждого Стр Из Объект.ТранспортныеСредства Цикл 
	//			ИндексСтроки = Объект.ТранспортныеСредства.Индекс(Стр);
	//			Если Объект.НомернаяВыдача И Не ЗначениеЗаполнено(Стр.Контейнер) Тогда
	//				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,"Объект.ТранспортныеСредства[%1].Контейнер","Отсутствует контейнер","Контейнер",ИндексСтроки,"Отсутствует контейнер в строке %1");
	//			КонецЕсли;
	//			Если Не ЗначениеЗаполнено(Стр.Автоперевозчик) Тогда
	//				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,"Объект.ТранспортныеСредства[%1].Автоперевозчик","Отсутствует автоперевозчик","Автоперевозчик",ИндексСтроки,"Отсутствует автоперевозчик в строке %1");
	//			КонецЕсли;
	//			Если Не ЗначениеЗаполнено(Стр.ИНН) Тогда
	//				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,"Объект.ТранспортныеСредства[%1].ИНН","Отсутствует ИНН автоперевозчика","ИНН",ИндексСтроки,"Отсутствует ИНН автоперевозчика в строке %1");
	//			КонецЕсли;
	//
	//		КонецЦикла;
			
			СтруктураОтвет = ВыполнитьПроверкуПередОтправкой(МассивКлючей,Объект.НомернаяВыдача);
			
			Для Каждого ЗнчМассив ИЗ СтруктураОтвет.МассивПустыхКонтейнеров Цикл
				Стр = Объект.Контейнеры.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки",ЗнчМассив));
				ИндексСтроки = Объект.Контейнеры.Индекс(Стр[0]);
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,"Объект.Контейнеры[%1].Контейнер","Отсутствует контейнер","Контейнер",ИндексСтроки,"Отсутствует контейнер в строке %1");
			КонецЦикла;	
			Для Каждого ЗнчМассив ИЗ СтруктураОтвет.МассивПустыхАвтоперевозчиков Цикл
				Стр = Объект.Контейнеры.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки",ЗнчМассив));
				ИндексСтроки = Объект.Контейнеры.Индекс(Стр[0]);
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,"Объект.Контейнеры[%1].Автоперевозчик","Отсутствует автоперевозчик","Автоперевозчик",ИндексСтроки,"Отсутствует автоперевозчик в строке %1");
			КонецЦикла;
			Для Каждого ЗнчМассив ИЗ СтруктураОтвет.МассивПустыхИНН Цикл
				Стр = Объект.Контейнеры.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки",ЗнчМассив));
				ИндексСтроки = Объект.Контейнеры.Индекс(Стр[0]);
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,"Объект.Контейнеры[%1].ИНН","Отсутствует ИНН автоперевозчика","ИНН",ИндексСтроки,"Отсутствует ИНН автоперевозчика в строке %1");
			КонецЦикла;
			//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Конец
			ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки,Отказ);
			
			Если Не Ошибки = Неопределено Тогда 
				МассивСтрок = Новый Массив;
				МассивОшибокДляПредупреждения = Новый Массив;
				Для Каждого СтрОшибка Из Ошибки.СписокОшибок Цикл 
					МассивОшибокДляПредупреждения.Добавить(СтрШаблон(СтрОшибка.ТекстДляНесколькихОшибок,СтрОшибка.НомерСтроки+1));
					Если МассивСтрок.Найти(СтрОшибка.НомерСтроки) = Неопределено Тогда 
						МассивСтрок.Добавить(СтрОшибка.НомерСтроки);                
					КонецЕсли;
				КонецЦикла;	
			КонецЕсли;	
			
			Если Отказ
				И МассивСтрок.Количество() <> 0
				//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
				//И (МассивСтрок.Количество() <> Объект.ТранспортныеСредства.Количество()) Тогда
				И (МассивСтрок.Количество() <> СтруктураОтвет.КоличествоПроверяемыхСтрок) Тогда
				//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Конец
				ОписаниеОповещения = новый ОписаниеОповещения("ПослеЗакрытияПредупреждение",ЭтотОбъект,ПараметрыТерминала);
				СписокКнопок = Новый СписокЗначений;
				СписокКнопок.Добавить("ПродолжитьОтправку","Продолжить отправку");
				СписокКнопок.Добавить("Отмена","Отмена");
				ПоказатьВопрос(ОписаниеОповещения,СтрСоединить(МассивОшибокДляПредупреждения, Символы.ПС),СписокКнопок,60,"Отмена","Данные на терминал не будут отправлены по причине","Отмена");
			КонецЕсли;	
			
			Если Отказ Тогда 
				Возврат;	
			КонецЕсли; 
			
		КонецЕсли;
		// ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 21.12.2022 
		
		ПоказатьДиалогОтправкиПоПочте(ПараметрыТерминала);	
		Возврат
		
		// ДИТ US 61614 TA 65194 Евсенкин М.А. Начало: 02.03.2023
	Иначе 
		//Рез = ПроверитьСтрокиПоВодителям();
		//Если НЕ рез Тогда
		//	ПоказатьПредупреждение(,"Запрос не может быть отправлен на терминал, т.к. не заполнена ни одна строка в данных по автоперевозке на первой миле");
		//	Возврат;
		//КонецЕсли; 
		// ДИТ US 61614 TA 65194 Евсенкин М.А. Конец: 02.03.2023
	КонецЕсли;
	//ДИТ Шевченко А.В. 03.10.2022 57967 -конец
	//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, конец
	ОписаниеКоманды_Идентификатор = "ЗапросНаТерминал";
	
	ОписаниеКоманды_ОбъектыПечати = Новый Массив;
	ОписаниеКоманды_ОбъектыПечати.Добавить(Объект.Ссылка);
	
	ДополнительныеПараметрыПечати = Новый Структура;
	ДополнительныеПараметрыПечати.Вставить("ДатаПечати", ТекущаяДата());
	//ДИТ Шевченко А.В. US 62479 ТА 59963 24.04.2023 -Начало
	ДополнительныеПараметрыПечати.Вставить("ПечатьДляПисьма", Истина);
	//ДИТ Шевченко А.В. US 62479 ТА 59963 24.04.2023 -Конец
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.РелизКлиента", ОписаниеКоманды_Идентификатор, ОписаниеКоманды_ОбъектыПечати,
		ЭтаФорма, ДополнительныеПараметрыПечати);
		
	ЭтаФорма.Прочитать(); //ДИТ Шевченко А.В. US 62479 ТА 59963 24.04.2023	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупреждение(Ответ,ПараметрыТерминала) Экспорт 
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 21.12.2022
	Если Ответ = "ПродолжитьОтправку" Тогда  
		ПоказатьДиалогОтправкиПоПочте(ПараметрыТерминала);
	КонецЕсли;
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 21.12.2022
КонецПроцедуры	

&НаКлиенте
Функция ПолучитьСтрокиКВыгрузке(мПараметры)
	СтрокиКвыгрузке = Новый Массив;
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 22.12.2022
	Если Не мПараметры.ВариантыАвтоперевозкиНеТребуется Тогда 
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 22.12.2022
	Если мПараметры.НомернаяВыдача Тогда
		
		    //ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
			//Для Каждого СтрокаТЗ из Объект.ТранспортныеСредства Цикл
			//	Если ЗначениеЗаполнено(СтрокаТЗ.Автоперевозчик) И ЗначениеЗаполнено(СтрокаТЗ.ИНН) И ЗначениеЗаполнено(СтрокаТЗ.Контейнер) Тогда
			//		СтрокиКвыгрузке.Добавить(СтрокаТЗ.ИдентификаторСтроки);
			//	КонецЕсли;		
			//КонецЦикла;
			МассивПроверяемыхКолонок = Новый массив;
			МассивПроверяемыхКолонок.Добавить("Автоперевозчик");
			МассивПроверяемыхКолонок.Добавить("ИНН");
			МассивПроверяемыхКолонок.Добавить("Контейнер");
			МассивКлючейИзТЧ = Новый Массив;
			Для Каждого Стр Из Объект.Контейнеры Цикл
				Если ЗначениеЗаполнено(Стр.КлючАналитикиПеревозки) Тогда
					МассивКлючейИзТЧ.Добавить(Стр.КлючАналитикиПеревозки);
				КонецЕсли;
			КонецЦикла;	
			МассивКлючей = ПроверитьСтрокиКлючейНаМиле(МассивКлючейИзТЧ,ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПерваяМиля"),МассивПроверяемыхКолонок);
			
			Для Каждого МассивЗнч Из МассивКлючей Цикл
				СтрокаТЧ = Объект.Контейнеры.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки",МассивЗнч));
				СтрокиКвыгрузке.Добавить(СтрокаТЧ[0].ИдентификаторСтроки);
			КонецЦикла;
			//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Конец
		Иначе
			//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
			//Для Каждого СтрокаТЗ из Объект.ТранспортныеСредства Цикл
			//	Если ЗначениеЗаполнено(СтрокаТЗ.Автоперевозчик) И ЗначениеЗаполнено(СтрокаТЗ.ИНН) Тогда
			//		СтрокиКвыгрузке.Добавить(СтрокаТЗ.ИдентификаторСтроки);
			//	КонецЕсли;		
			//КонецЦикла;
			МассивПроверяемыхКолонок = Новый массив;
			МассивПроверяемыхКолонок.Добавить("Автоперевозчик");
			МассивПроверяемыхКолонок.Добавить("ИНН");
			МассивКлючейИзТЧ = Новый Массив;
			Для Каждого Стр Из Объект.Контейнеры Цикл
				Если ЗначениеЗаполнено(Стр.КлючАналитикиПеревозки) Тогда
					МассивКлючейИзТЧ.Добавить(Стр.КлючАналитикиПеревозки);
				КонецЕсли;
			КонецЦикла;
			МассивКлючей = ПроверитьСтрокиКлючейНаМиле(МассивКлючейИзТЧ,ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПерваяМиля"),МассивПроверяемыхКолонок);
			
			Для Каждого МассивЗнч Из МассивКлючей Цикл
				СтрокаТЧ = Объект.Контейнеры.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки",МассивЗнч));
				СтрокиКвыгрузке.Добавить(СтрокаТЧ[0].ИдентификаторСтроки);
			КонецЦикла;
			//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Конец
		КонецЕсли;
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 22.12.2022
	Иначе 
		Если мПараметры.НомернаяВыдача Тогда
			Для Каждого СтрокаТЗ из Объект.Контейнеры Цикл
				СтрокиКвыгрузке.Добавить(СтрокаТЗ.ИдентификаторСтроки);
			КонецЦикла;	
		Иначе 
			Для Каждого СтрокаТЗ из Объект.Контейнеры Цикл
				СтрокиКвыгрузке.Добавить(СтрокаТЗ.ИдентификаторСтроки);
			КонецЦикла;	
		КонецЕсли;	
	КонецЕсли;
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 22.12.2022
	Возврат СтрокиКВыгрузке; 
КонецФункции	

&НаКлиенте
Функция ПроверитьСтрокиПоВодителям()
	
	СтрокиКвыгрузке = Новый Массив;
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
	//Для Каждого СтрокаТЗ из Объект.ТранспортныеСредства Цикл
	//	Если ЗначениеЗаполнено(СтрокаТЗ.ФИОВодителя) И ЗначениеЗаполнено(СтрокаТЗ.РегНомерТС) Тогда
	//		СтрокиКвыгрузке.Добавить(СтрокаТЗ.ИдентификаторСтроки);
	//	КонецЕсли;		
	//КонецЦикла;
	
	МассивПроверяемыхКолонок = Новый массив;
	МассивПроверяемыхКолонок.Добавить("ФИОВодителя");
	МассивПроверяемыхКолонок.Добавить("РегНомерТС");
	МассивКлючейП = Новый Массив;
	Для Каждого Стр Из Объект.Контейнеры Цикл
		МассивКлючейП.Добавить(Стр.КлючАналитикиПеревозки);
	КонецЦикла;	
	МассивКлючей = ПроверитьСтрокиКлючейНаМиле(МассивКлючейП,ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПерваяМиля"),МассивПроверяемыхКолонок);
	
	Для Каждого МассивЗнч Из МассивКлючей Цикл
		СтрокаТЧ = Объект.Контейнеры.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки",МассивЗнч));
		СтрокиКвыгрузке.Добавить(СтрокаТЧ[0].ИдентификаторСтроки);
	КонецЦикла;
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Конец	
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 19.12.2022
	// Было:
	//Возврат СтрокиКвыгрузке.Количество() > 0;
	//Стало:
	Если Не Объект.Автоперевозка = ПредопределенноеЗначение("Перечисление.ВариантыАвтоперевозки.НеТребуется") Тогда 
		Ответ = СтрокиКвыгрузке.Количество() > 0;                                                                                                           
	Иначе 
		Ответ = Истина;
	КонецЕсли;
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 19.12.2022
	Возврат Ответ;	
КонецФункции	

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыполнитьПроверкуПередОтправкой(ТаблицаКлючей,НомернаяВыдача)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КлючиАналитикиПеревозкиМили.Ссылка КАК КлючАналитикиПеревозки,
	               |	КлючиАналитикиПеревозкиМили.Автоперевозчик КАК Автоперевозчик,
	               |	КлючиАналитикиПеревозкиМили.ИНН КАК ИНН,
	               |	КлючиАналитикиПеревозкиМили.Ссылка.Контейнер КАК Контейнер
	               |ПОМЕСТИТЬ ВТ_Ключи
	               |ИЗ
	               |	Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
	               |ГДЕ
	               |	КлючиАналитикиПеревозкиМили.Ссылка В(&МассивКлючей)
	               |	И (КлючиАналитикиПеревозкиМили.Ссылка.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	               |			ИЛИ КлючиАналитикиПеревозкиМили.ФИОВодителя <> """"
	               |			ИЛИ (КлючиАналитикиПеревозкиМили.Автоперевозчик <> """"
	               |				И КлючиАналитикиПеревозкиМили.Автоперевозчик <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) И КлючиАналитикиПеревозкиМили.Автоперевозчик <> Неопределено))
	               |	И КлючиАналитикиПеревозкиМили.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.ПерваяМиля)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Ключи.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки
	               |ИЗ
	               |	ВТ_Ключи КАК ВТ_Ключи
	               |ГДЕ
	               |	ВТ_Ключи.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	               |	И &НомернаяВыдача
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Ключи.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки
	               |ИЗ
	               |	ВТ_Ключи КАК ВТ_Ключи
	               |ГДЕ
	               |	(ВТ_Ключи.Автоперевозчик = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |			ИЛИ ВТ_Ключи.Автоперевозчик = """")
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Ключи.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки
	               |ИЗ
	               |	ВТ_Ключи КАК ВТ_Ключи
	               |ГДЕ
	               |	ВТ_Ключи.ИНН = """"
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Ключи.КлючАналитикиПеревозки) КАК КлючАналитикиПеревозки
	               |ИЗ
	               |	ВТ_Ключи КАК ВТ_Ключи";
	
	Запрос.УстановитьПараметр("МассивКлючей",ТаблицаКлючей);
	Запрос.УстановитьПараметр("НомернаяВыдача",НомернаяВыдача);
	
	Результат = Запрос.ВыполнитьПакет();
	
	МассивПустыхКонтейнеров = Результат[1].Выгрузить().ВыгрузитьКолонку("КлючАналитикиПеревозки");
	МассивПустыхАвтоперевозчиков = Результат[2].Выгрузить().ВыгрузитьКолонку("КлючАналитикиПеревозки");
	МассивПустыхИНН = Результат[3].Выгрузить().ВыгрузитьКолонку("КлючАналитикиПеревозки");
	КоличествоПроверяемыхСтрок = Результат[4].Выгрузить().Количество();
	
	
	Возврат Новый Структура("МассивПустыхКонтейнеров,МассивПустыхАвтоперевозчиков,МассивПустыхИНН,КоличествоПроверяемыхСтрок",МассивПустыхКонтейнеров,МассивПустыхАвтоперевозчиков,МассивПустыхИНН,КоличествоПроверяемыхСтрок); 
	
КонецФункции	

&НаСервереБезКонтекста
Функция ЗаполненостьТСПустая(ТаблицаКлючей)
Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	КлючиАналитикиПеревозкиМили.Ссылка КАК КлючАналитикиПеревозки
			               |ИЗ
			               |	Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
			               |ГДЕ
			               |	КлючиАналитикиПеревозкиМили.Ссылка В(&МассивКлючей)
			               |	И (КлючиАналитикиПеревозкиМили.Ссылка.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
			               |			ИЛИ КлючиАналитикиПеревозкиМили.ФИОВодителя <> """"
			               |			ИЛИ (КлючиАналитикиПеревозкиМили.Автоперевозчик <> """"
			               |				И КлючиАналитикиПеревозкиМили.Автоперевозчик <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)И КлючиАналитикиПеревозкиМили.Автоперевозчик <> Неопределено))
			               |	И КлючиАналитикиПеревозкиМили.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.ПерваяМиля)";
			
			Запрос.УстановитьПараметр("МассивКлючей",ТаблицаКлючей.ВыгрузитьКолонку("КлючАналитикиПеревозки"));
			Возврат Запрос.Выполнить().Пустой();	
КонецФункции	

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ДИТ US 76935 ТА 77189 Сержантова А.С. 05.12.2023  
&НаСервере
Функция ЗаполнитьДанныеДляОбновленияКлючейАналитикиПеревозки() 
	
	ДанныеОбновленияКлючейАналитики = Новый ТаблицаЗначений;   
	ДанныеОбновленияКлючейАналитики.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ДанныеОбновленияКлючейАналитики.Колонки.Добавить("КлючАналитикиПеревозки", Новый ОписаниеТипов("СправочникСсылка.КлючиАналитикиПеревозки"));  
	ДанныеОбновленияКлючейАналитики.Колонки.Добавить("Контейнер", Новый ОписаниеТипов("СправочникСсылка.ТЕ"));
	ДанныеОбновленияКлючейАналитики.Колонки.Добавить("ДанныеКлюча"); 
	
	//Евросиб(ДИТ) Сержантова А.С. US 77172 ТА 83838 Начало 06.02.2025  
	МассивКлючей = Объект.Контейнеры.Выгрузить().ВыгрузитьКолонку("КлючАналитикиПеревозки");
	ДанныеКлючейПоПервойМиле = Справочники.КлючиАналитикиПеревозки.КлючиАналитикиЗначенияПолейПоЭтапуПеревозки(МассивКлючей, Перечисления.ЭтапыПеревозки.ПерваяМиля);
	//Евросиб(ДИТ) Сержантова А.С. US 77172 ТА 83838 Конец 06.02.2025
	
	Для каждого СтрокаТЧ Из Объект.Контейнеры Цикл
		СтруктураКлючаАналитикиПеревозки = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки(); 
		
		МилиКлючаПервая = Новый Структура;
		МилиКлючаПервая.Вставить("ДатаВыдачиКТКСТерминала", СтрокаТЧ.ДатаВывоза);
		//МилиКлючаПервая.ДатаСдачиКТКНаТерминал = ;
		МилиКлючаПервая.Вставить("ФИОВодителя", СтрокаТЧ.ВывозКонтейнераФИОВодителя);
		МилиКлючаПервая.Вставить("РегНомерТС", СтрокаТЧ.ВывозКонтейнераРегНомерТС); 
		МилиКлючаПервая.Вставить("Автоперевозчик", СтрокаТЧ.Автоперевозчик);
		Если ЗначениеЗаполнено(СтрокаТЧ.Автоперевозчик) 
			и ТипЗнч(СтрокаТЧ.Автоперевозчик) = Тип("СправочникСсылка.Контрагенты") Тогда
			МилиКлючаПервая.Вставить("ИНН",ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.Автоперевозчик,"ИНН"));
			МилиКлючаПервая.Вставить("КПП",ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.Автоперевозчик,"КПП"));
		КонецЕсли;
		
		МилиКлючаПоследняя = Новый Структура;
		МилиКлючаПоследняя.Вставить("ДатаСдачиКТКНаТерминал", СтрокаТЧ.ДатаВозвратаКлиентом);
		МилиКлючаПоследняя.Вставить("ФИОВодителя", СтрокаТЧ.СдачаКонтейнераФИОВодителя);
		МилиКлючаПоследняя.Вставить("РегНомерТС", СтрокаТЧ.СдачаКонтейнераРегНомерТС);
		МилиКлючаПоследняя.Вставить("Автоперевозчик", СтрокаТЧ.АвтоперевозчикПоследняяМиля);
		Если ЗначениеЗаполнено(СтрокаТЧ.АвтоперевозчикПоследняяМиля) 
			и ТипЗнч(СтрокаТЧ.АвтоперевозчикПоследняяМиля) = Тип("СправочникСсылка.Контрагенты")Тогда
			МилиКлючаПоследняя.Вставить("ИНН",ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.АвтоперевозчикПоследняяМиля,"ИНН"));
			МилиКлючаПоследняя.Вставить("КПП",ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.АвтоперевозчикПоследняяМиля,"КПП"));	
		КонецЕсли;
		
		СтруктураКлючаАналитикиПеревозки.КлючАналитики = СтрокаТЧ.КлючАналитикиПеревозки;
		//Евросиб Коханенко Н.А. 30.07.2024 (( #88606
		//не нужно обновлять поле Заявка в ключе из Релиза. Это делает сама Заявка
		//СтруктураКлючаАналитикиПеревозки.Заявка = Объект.Заявка;
		//Евросиб Коханенко Н.А. 30.07.2024 )) #88606
		СтруктураКлючаАналитикиПеревозки.Контейнер = СтрокаТЧ.Контейнер;
		СтруктураКлючаАналитикиПеревозки.ИнструкцияПоСдаче = СтрокаТЧ.ИнструкцияПоСдаче;
		//Евросиб(ДИТ) Сержантова А.С. US 77172 ТА 83838 Начало 05.02.2025
		СтруктураКлючаАналитикиПеревозки.ДатаДобавленияВРелиз = СтрокаТЧ.ДатаДобавленияВРелиз; 
		//Евросиб(ДИТ) Антонова А.С. US 77172 ТА 110410 Начало 26.05.2025
		СтруктураКлючаАналитикиПеревозки.ИсточникЗаписи = Объект.Ссылка;
		//Евросиб(ДИТ) Антонова А.С. US 77172 ТА 110410 Конец 26.05.2025
		Если РаботаСЗаявкамиВызовСервера.Проверка_ДатаВозвратаИзПервойМили(СтрокаТЧ.Контейнер, Объект.Заявка) Тогда 
			СтрПервойМили = ДанныеКлючейПоПервойМиле.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки", СтрокаТЧ.КлючАналитикиПеревозки));  
			Если СтрПервойМили.Количество() = 1 Тогда
				СтруктураКлючаАналитикиПеревозки.ДатаСдачиКТКНаТерминал = СтрПервойМили.ДатаСдачиКТКНаТерминал;
			КонецЕсли;
		Иначе
			СтруктураКлючаАналитикиПеревозки.ДатаСдачиКТКНаТерминал = СтрокаТЧ.ДатаВозвратаКлиентом;
		КонецЕсли;
		//Евросиб(ДИТ) Сержантова А.С. US 77172 ТА 83838 Конец 05.02.2025
		ЗаполнитьЗначенияСвойств(СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПерваяМиляКлючаАналитики, МилиКлючаПервая);
		ЗаполнитьЗначенияСвойств(СтруктураКлючаАналитикиПеревозки.СтруктураТЧМилиПоследняяМиляКлючаАналитики, МилиКлючаПоследняя);  
		
		НС = ДанныеОбновленияКлючейАналитики.Добавить(); 
		НС.НомерСтроки 				= СтрокаТЧ.НомерСтроки;
		НС.КлючАналитикиПеревозки 	= СтрокаТЧ.КлючАналитикиПеревозки;  
		НС.Контейнер 				= СтрокаТЧ.Контейнер;
		НС.ДанныеКлюча 				= СтруктураКлючаАналитикиПеревозки;
	КонецЦикла;    
	
	Возврат ДанныеОбновленияКлючейАналитики;
	
КонецФункции

// ДИТ US 76935 ТА 77189 Сержантова А.С. 05.12.2023  
&НаСервере 
Процедура ЗаблокироватьКлючиАналитикиПеревозкиДляРедактирования()

	Для каждого СтрКлюча Из Объект.Контейнеры Цикл
		ЗаблокироватьДанныеДляРедактирования(СтрКлюча.КлючАналитикиПеревозки); 	
	КонецЦикла;	

КонецПроцедуры 

// ДИТ US 76935 ТА 77189 Сержантова А.С. 05.12.2023  
&НаСервере 
Процедура СнятьБлокировкуКлючейАналитикиПеревозкиДляРедактирования()

	Для каждого СтрКлюча Из Объект.Контейнеры Цикл
		РазблокироватьДанныеДляРедактирования(СтрКлюча.КлючАналитикиПеревозки); 	
	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗаполнениеСтроки(СтрокаТЧ) //ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23
		
		СтрокаТЧ.Контейнер = СтрокаТЧ.КлючАналитикиПеревозки.Контейнер;
		СтрокаТЧ.ТипоразмерКТК = СтрокаТЧ.КлючАналитикиПеревозки.Контейнер.ТипТЕ; 
		СтрокаТЧ.ИнструкцияПоСдаче = СтрокаТЧ.КлючАналитикиПеревозки.ИнструкцияПоСдаче;  
		//Евросиб(ДИТ) Сержантова А.С. US 77172 ТА 83838 Начало 05.02.2025
		СтрокаТЧ.ДатаДобавленияВРелиз = СтрокаТЧ.КлючАналитикиПеревозки.ДатаДобавленияВРелиз;   
		СтрокаТЧ.ДатаВозвратаКлиентом = СтрокаТЧ.КлючАналитикиПеревозки.ДатаСдачиКТКНаТерминал;
		//Евросиб(ДИТ) Сержантова А.С. US 77172 ТА 83838 Конец 05.02.2025
		СтрокаТЧ.ВерсияКлюча = СтрокаТЧ.КлючАналитикиПеревозки.ВерсияДанных; 
		ТЧ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.КлючАналитикиПеревозки,"Мили");
		Если ТЧ <> Неопределено Тогда
			Выборка = ТЧ.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если Выборка.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля Тогда  
					
					// Евросиб(ДИТ) BUG 95213 ТА 95214 Сержантова А.С. Начало: 12.12.2024
					// Было:
					////БИТ Белинский Д.А. -начало
					//Если РаботаСЗаявкамиВызовСервера.ЭтоЗаявкаНаАвтоРейс(Объект.Заявка) Тогда
					//	СтрокаТЧ.ДатаВозвратаКлиентом = Выборка.ДатаСдачиКТКНаТерминал;
					//Иначе
					//	СтрокаТЧ.ДатаВывоза = Выборка.ДатаВыдачиКТКСТерминала;
					//КонецЕсли; 
					//Стало:
					СтрокаТЧ.ДатаВывоза = Выборка.ДатаВыдачиКТКСТерминала;  
					//Евросиб(ДИТ) Сержантова А.С. US 77172 ТА 83838 Начало 06.02.2025
					//перенесено вне цикла обхода миль, берем значение из реквизита шапки. Если не заполнилось из шапки, оставляем заполнение из миль
					Если не ЗначениеЗаполнено(СтрокаТЧ.ДатаВозвратаКлиентом) 
					    и РаботаСЗаявкамиВызовСервера.Проверка_ДатаВозвратаИзПервойМили(СтрокаТЧ.Контейнер, Объект.Заявка) Тогда
						СтрокаТЧ.ДатаВозвратаКлиентом = Выборка.ДатаСдачиКТКНаТерминал;
					КонецЕсли;
					//// Евросиб(ДИТ) BUG 95213 ТА 95214 Сержантова А.С. Конец: 12.12.2024 
					//Евросиб(ДИТ) Сержантова А.С. US 77172 ТА 83838 Конец 06.02.2025
					СтрокаТЧ.ВывозКонтейнераФИОВодителя = Выборка.ФИОВодителя;
					СтрокаТЧ.ВывозКонтейнераРегНомерТС = Выборка.РегНомерТС;
					СтрокаТЧ.Автоперевозчик = Выборка.Автоперевозчик;
				//Евросиб Коханенко Н.А. 24.01.2025 (( #91409 
				//Иначе
				ИначеЕсли Выборка.ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПоследняяМиля Тогда  
                //Евросиб Коханенко Н.А. 24.01.2025 )) #91409 
				
					//Евросиб(ДИТ) Сержантова А.С. US 77172 ТА 83838 Начало 06.02.2025
					//перенесено вне цикла обхода миль, берем значение из реквизита шапки
					// Евросиб(ДИТ) BUG 95213 ТА 95214 Сержантова А.С. Начало: 12.12.2024
					// Было:
					//СтрокаТЧ.ДатаВозвратаКлиентом = Выборка.ДатаСдачиКТКНаТерминал; 
					//Стало:
					Если не ЗначениеЗаполнено(СтрокаТЧ.ДатаВозвратаКлиентом) Тогда
						Если РаботаСЗаявкамиВызовСервера.Проверка_ДатаВозвратаИзПервойМили(СтрокаТЧ.Контейнер, Объект.Заявка) Тогда
						Иначе
							СтрокаТЧ.ДатаВозвратаКлиентом = Выборка.ДатаСдачиКТКНаТерминал;	
						КонецЕсли;
					КонецЕсли;
					// Евросиб(ДИТ) BUG 95213 ТА 95214 Сержантова А.С. Конец: 12.12.2024  
					//Евросиб(ДИТ) Сержантова А.С. US 77172 ТА 83838 Конец 06.02.2025
					СтрокаТЧ.СдачаКонтейнераФИОВодителя = Выборка.ФИОВодителя;
					СтрокаТЧ.СдачаКонтейнераРегНомерТС = Выборка.РегНомерТС;
					СтрокаТЧ.АвтоперевозчикПоследняяМиля = Выборка.Автоперевозчик;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьТаблицуПоКлючамАналитики(Ключ = Неопределено) //ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23
	Если ЗначениеЗаполнено(Ключ) Тогда
		СтруктураПоиска = Новый Структура("КлючАналитикиПеревозки",Ключ);
		МассивСтрок = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска);
		Если МассивСтрок.Количество() > 0 Тогда
			ВыполнитьЗаполнениеСтроки(МассивСтрок[0]);
		КонецЕсли;	
	Иначе	
	Для Каждого СтрокаТЧ Из Объект.Контейнеры Цикл
		ВыполнитьЗаполнениеСтроки(СтрокаТЧ);		
	КонецЦикла;
	КонецЕсли;		
КонецПроцедуры	

&НаСервере
Процедура ДобавитьЗначениеРеквизитаВКлюч(Ключ,ЗначениеПоля,ИмяПоля,ЭтапПеревозки = Неопределено,СтруктураПолейТЧМили = Неопределено,ВерсияДанных = Неопределено) //ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23
	
	Если ВерсияДанных <> Ключ.ВерсияДанных Тогда 
		ЗаполнитьТаблицуПоКлючамАналитики(Ключ);
		ОбщегоНазначения.СообщитьПользователю("Версия ключа аналитики перевозки устарела, подгружены актуальные данные по строке.");	
	КонецЕсли;
	
	СтруктураКлюча  = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();	
	СтруктураКлюча.Вставить("КлючАналитики",Ключ);
	
	Если ЭтапПеревозки = Неопределено Тогда
		СтруктураКлюча.Вставить(ИмяПоля,ЗначениеПоля);
		ВерсияДанных = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлюча).ВерсияДанных;
	КонецЕсли;
	
	Если ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПерваяМиля Тогда
		ЗаполнитьЗначенияСвойств(СтруктураКлюча.СтруктураТЧМилиПерваяМиляКлючаАналитики,СтруктураПолейТЧМили);
		ВерсияДанных = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлюча).ВерсияДанных;
	КонецЕсли;
	
	Если ЭтапПеревозки = Перечисления.ЭтапыПеревозки.ПоследняяМиля Тогда
		ЗаполнитьЗначенияСвойств(СтруктураКлюча.СтруктураТЧМилиПоследняяМиляКлючаАналитики,СтруктураПолейТЧМили); 
		ВерсияДанных = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлюча).ВерсияДанных;
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Функция ОбновитьДанныеКлючаАналитикиПеревозки(ТекСтр)
	Структура = Новый Структура("КлючАналитикиПеревозки,ВерсияКлюча");	
	НайденоУслуги = Объект.СоставУслуги.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки",ТекСтр.КлючАналитикиПеревозки));
	
	Если НайденоУслуги.Количество() Тогда  
		Стр = НайденоУслуги[0]; 
		Стр.Груз = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекСтр.КлючАналитикиПеревозки,"Груз");
		Стр.ВерсияКлюча = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекСтр.КлючАналитикиПеревозки,"ВерсияДанных");
		Стр.ИнструкцииПоСдачеПорожнего = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекСтр.КлючАналитикиПеревозки,"ИнструкцияПоСдаче");
		Структура = Новый Структура("КлючАналитикиПеревозки,ВерсияДанных",Стр.КлючАналитикиПеревозки,Стр.ВерсияКлюча);
	КонецЕсли;
	мДетализацияПоГрузу = РеквизитФормыВЗначение("ДетализацияПоГрузу",Тип("ТаблицаЗначений"));
	НайденоГруз = мДетализацияПоГрузу.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки",ТекСтр.КлючАналитикиПеревозки));
	Для Каждого СтрНайденоГруз Из НайденоГруз Цикл 
		мДетализацияПоГрузу.Удалить(СтрНайденоГруз);	
	КонецЦикла;
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Справочники.КлючиАналитикиПеревозки.ПолучитьДетализациюПоГрузу(ТекСтр.КлючАналитикиПеревозки),мДетализацияПоГрузу);
	ЗначениеВРеквизитФормы(мДетализацияПоГрузу,"ДетализацияПоГрузу");
	
	Возврат Структура;
КонецФункции

&НаСервереБезКонтекста
Функция СоздатьКлючАналитики(Заявка,Контейнер) //ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23
	
	СтруктураКлюча  = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки(); 
	СтруктураКлюча.Вставить("Заявка",Заявка);
	СтруктураКлюча.Вставить("Контейнер",Контейнер);
	Возврат Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлюча);
		
КонецФункции
	
&НаКлиенте
Процедура ВопросОбОтменеПроведения(Результат, ДополнительныеПараметры) Экспорт //ДИТ Шевченко А.В. 51340 14.10.2022
	Если Результат = КодВозвратаДиалога.Да Тогда

		ПараметрыТерминала = Новый Структура("ЭлектронныйАдресТерминала,XmlВерсияРелизаКлиента,ЗапросНаОтмену,ТекстПисьма,УдалениеРелиза,ВариантыАвтоперевозкиНеТребуется","","",Истина,"",Истина,Ложь);
		Если ПоВыбранномуТерминалуТребуетсяОтправкаXML(ПараметрыТерминала) Тогда
			ПоказатьДиалогОтправкиПоПочте(ПараметрыТерминала);
		Иначе
			ПараметрыТерминала.ТекстПисьма = "Запрос на выдачу контейнеров отменен. Просьба удалить резервирование контейнеров для выдачи по данному релизу";
			МассивПолучателей = СтрРазделить(Объект.КонтактТерминала, ";", Ложь);
			СписокПолучателей = Новый СписокЗначений;
			Для Каждого ЗнчПолучатель Из МассивПолучателей Цикл
				СписокПолучателей.Добавить(ЗнчПолучатель,ЗнчПолучатель);
			КонецЦикла;	
			ПараметрыТерминала.ЭлектронныйАдресТерминала = СписокПолучателей;
			ПоказатьДиалогОтправкиПоПочте(ПараметрыТерминала);
		КонецЕсли;
		
		
		ПараметрыЗаписи = ДополнительныеПараметры.ПараметрыЗаписи;
		ПараметрыЗаписи.Вставить("ПропуститьПроверку", Истина);
		ЭтотОбъект.Прочитать();
		Записать(ПараметрыЗаписи);
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВопросОбУдаленииСтроки(Результат, ДополнительныеПараметры) Экспорт //ДИТ Шевченко А.В. 51340 14.10.2022
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
	//Если Результат = КодВозвратаДиалога.Да Тогда
	//	СтруктураПоискаКонт = Новый Структура("Контейнер",ДополнительныеПараметры.Контейнер);
	//	НайденныеСтроки = Объект.ТранспортныеСредства.НайтиСтроки(СтруктураПоискаКонт);
	//	Если НайденныеСтроки.Количество() > 0 Тогда
	//		НайденныеСтроки[0].Контейнер = ПредопределенноеЗначение("Справочник.ТЕ.ПустаяСсылка");
	//		НайденаяСтрокаКонт = Объект.Контейнеры.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
	//		Объект.Контейнеры.Удалить(НайденаяСтрокаКонт);
	//	КонецЕсли;	
	//Иначе
	//	Возврат;
	//КонецЕсли; 
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Конец
КонецПроцедуры	

&НаСервере
Функция ПроверитьДатуВывоза() //ДИТ Шевченко А.В. 51340 12.10.2022
	Возврат Документы.РелизКлиента.ПроверитьДатуВывоза(Объект);
КонецФункции	

&НаСервере
Процедура ИзмененыКлючевыеПоля() //ДИТ Шевченко А.В. 51340 12.10.2022
		
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Справочники.СибурСтатусыЗаявок.Отправлен);
	МассивСтатусов.Добавить(Справочники.СибурСтатусыЗаявок.ЧастичноОтправлен);
	МассивСтатусов.Добавить(Справочники.СибурСтатусыЗаявок.ОтправленБезОтвета);
	МассивСтатусов.Добавить(Справочники.СибурСтатусыЗаявок.ЧастичноОтправленБезОтвета);
	МассивСтатусов.Добавить(Справочники.СибурСтатусыЗаявок.ЧастичноПринят);
	МассивСтатусов.Добавить(Справочники.СибурСтатусыЗаявок.Принят);
	МассивСтатусов.Добавить(Справочники.СибурСтатусыЗаявок.ВерсияОтправкиУстарела);
	МассивСтатусов.Добавить(Справочники.СибурСтатусыЗаявок.НеПринят); 
	
	Если МассивСтатусов.Найти(Объект.СтатусОтправкиПолученияОтветаТерминала) <> Неопределено Тогда
		Объект.ИзмененыКлючевыеПоля = Истина;
		Объект.СтатусОтправкиПолученияОтветаТерминала = Справочники.СибурСтатусыЗаявок.ВерсияОтправкиУстарела;
		Объект.ПисьмоНаЗапрос = Документы.ЭлектронноеПисьмоИсходящее.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры	

&НаСервере
Процедура УправлениеФормой()
	// Евросиб Фролов (28.04.2022 Task №50233
	// Колонки с идентификаторами строк отображаем только администратору.
	ПользовательСПолнымиПравами = Пользователи.ЭтоПолноправныйПользователь();
    //Элементы.ТранспортныеСредстваИдентификаторСтроки.Видимость = ПользовательСПолнымиПравами;
	// Евросиб Фролов)
	
	//++ДИТ Моисеенко Ю.В. task#60109 09.11.2022
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Начало
	//Элементы.КонтейнерыСдачаКонтейнераФИОВодителя.РедактированиеТекста 	= Ложь;
	//Элементы.КонтейнерыСдачаКонтейнераРегНомерТС.РедактированиеТекста 	= Ложь;
	//Элементы.КонтейнерыАвтоперевозчикПоследняяМиля.РедактированиеТекста = Ложь;
	//ДИТ Шевченко А.В. US 62421 TA 68371 11.04.2023 -Конец
	//--ДИТ Моисеенко Ю.В. task#60109 09.11.2022
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНомерРелиза()
	// Евросиб Фролов (28.03.2022 Task №49126
	Объект.НомерРелиза = "";
	
	// Преобразуем данные формы в объект, чтобы при необходимости присвоить номер документа.
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	// Евросиб Фролов (29.04.2022 Ticket №0270765
	//Объект.НомерРелиза = Документы.РелизКлиента.ПолучитьНомерРелиза(ОбъектНаСервере, Объект.ВыдачаОтСобственника, Объект.РелизСобственника, Объект.Номер);
    ПолученныйНомерРелиза = Документы.РелизКлиента.ПолучитьНомерРелиза(ОбъектНаСервере, Объект.ВыдачаОтСобственника, Объект.РелизСобственника);
	ЗначениеВРеквизитФормы(ОбъектНаСервере, "Объект");
	Объект.НомерРелиза = ПолученныйНомерРелиза;
	// Евросиб Фролов)
КонецПроцедуры
	
&НаКлиенте
Процедура ПослеВыбораРежимаСвязки(Результат, Параметры) Экспорт 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтейнерыПослеСвязки(ВыбранноеЗначение)
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
	//// Заполнение табличной части "Контейнеры" после закрытия формы связки КТК с водителями и перевозчиками
	//
	////Объект.Контейнеры.Загрузить(ВыбранноеЗначение.Контейнеры.Выгрузить());
	////ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -начало
	//Для Каждого СтрокаВыбранноеЗначение ИЗ ВыбранноеЗначение.Контейнеры Цикл
	//	Если ЗначениеЗаполнено(СтрокаВыбранноеЗначение.ИдентификаторСтрокиТС) Тогда
	//		
	//		СтруктураПоиска = Новый Структура("КлючАналитикиПеревозки",СтрокаВыбранноеЗначение.КлючАналитикиПеревозки);
	//		НайденСтр = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска);
	//		НайденСтр[0].ИдентификаторСтрокиТС = СтрокаВыбранноеЗначение.ИдентификаторСтрокиТС;
	//		
	//		СтруктураКлюча = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
	//		СтруктураКлюча.КлючАналитики = СтрокаВыбранноеЗначение.КлючАналитикиПеревозки;
	//		
	//		СтруктураОтбора = Новый Структура("ИдентификаторСтроки",СтрокаВыбранноеЗначение.ИдентификаторСтрокиТС);
	//		СтрокиТС = Объект.ТранспортныеСредства.НайтиСтроки(СтруктураОтбора);
	//		СтруктураКлюча.СтруктураТЧМилиПерваяМиляКлючаАналитики.ФИОВодителя 		= СтрокиТС[0].ФИОВодителя;
	//		СтруктураКлюча.СтруктураТЧМилиПерваяМиляКлючаАналитики.РегНомерТС 		= СтрокиТС[0].РегНомерТС;
	//		СтруктураКлюча.СтруктураТЧМилиПерваяМиляКлючаАналитики.ПаспортныеДанные	= СтрокиТС[0].ПаспортныеДанные;
	//		СтруктураКлюча.СтруктураТЧМилиПерваяМиляКлючаАналитики.Автоперевозчик 	= СтрокиТС[0].Автоперевозчик;
	//		Если ЗначениеЗаполнено(СтруктураКлюча.СтруктураТЧМилиПерваяМиляКлючаАналитики.Автоперевозчик) И ТипЗнч(СтруктураКлюча.СтруктураТЧМилиПерваяМиляКлючаАналитики.Автоперевозчик) = Тип("СправочникСсылка.Контрагенты") Тогда
	//			СтруктураКлюча.СтруктураТЧМилиПерваяМиляКлючаАналитики.ИНН = СтрокиТС[0].Автоперевозчик.ИНН;
	//			СтруктураКлюча.СтруктураТЧМилиПерваяМиляКлючаАналитики.КПП = СтрокиТС[0].Автоперевозчик.КПП;
	//		Иначе
	//			СтруктураКлюча.СтруктураТЧМилиПерваяМиляКлючаАналитики.ИНН = СтрокиТС[0].ИНН;
	//			СтруктураКлюча.СтруктураТЧМилиПерваяМиляКлючаАналитики.КПП = СтрокиТС[0].КПП;
	//		КонецЕсли;	
	//		Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлюча);
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(СтрокаВыбранноеЗначение.ИдентификаторСтрокиТСПоследняяМиля) Тогда
	//		
	//		СтруктураПоиска = Новый Структура("КлючАналитикиПеревозки",СтрокаВыбранноеЗначение.КлючАналитикиПеревозки);
	//		НайденСтр = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска);
	//		НайденСтр[0].ИдентификаторСтрокиТСПоследняяМиля = СтрокаВыбранноеЗначение.ИдентификаторСтрокиТСПоследняяМиля;
	//		
	//		СтруктураКлюча = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки();
	//		СтруктураКлюча.КлючАналитики = СтрокаВыбранноеЗначение.КлючАналитикиПеревозки;
	//		
	//		СтруктураОтбора = Новый Структура("ИдентификаторСтроки",СтрокаВыбранноеЗначение.ИдентификаторСтрокиТСПоследняяМиля);
	//		СтрокиТС = Объект.ТранспортныеСредстваПоследняяМиля.НайтиСтроки(СтруктураОтбора);
	//		СтруктураКлюча.СтруктураТЧМилиПоследняяМиляКлючаАналитики.ФИОВодителя 		= СтрокиТС[0].ФИОВодителя;
	//		СтруктураКлюча.СтруктураТЧМилиПоследняяМиляКлючаАналитики.РегНомерТС 		= СтрокиТС[0].РегНомерТС;
	//		СтруктураКлюча.СтруктураТЧМилиПоследняяМиляКлючаАналитики.ПаспортныеДанные	= СтрокиТС[0].ПаспортныеДанные;
	//		СтруктураКлюча.СтруктураТЧМилиПоследняяМиляКлючаАналитики.Автоперевозчик 	= СтрокиТС[0].Автоперевозчик;
	//		Если ЗначениеЗаполнено(СтруктураКлюча.СтруктураТЧМилиПоследняяМиляКлючаАналитики.Автоперевозчик) И ТипЗнч(СтруктураКлюча.СтруктураТЧМилиПоследняяМиляКлючаАналитики.Автоперевозчик) = Тип("СправочникСсылка.Контрагенты") Тогда
	//			СтруктураКлюча.СтруктураТЧМилиПоследняяМиляКлючаАналитики.ИНН = СтрокиТС[0].Автоперевозчик.ИНН;
	//			СтруктураКлюча.СтруктураТЧМилиПоследняяМиляКлючаАналитики.КПП = СтрокиТС[0].Автоперевозчик.КПП;
	//		Иначе
	//			СтруктураКлюча.СтруктураТЧМилиПоследняяМиляКлючаАналитики.ИНН = СтрокиТС[0].ИНН;
	//			СтруктураКлюча.СтруктураТЧМилиПоследняяМиляКлючаАналитики.КПП = СтрокиТС[0].КПП;
	//		КонецЕсли;
	//		Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлюча);
	//	КонецЕсли;
	//КонецЦикла;	
	//
	//// Заполняем в табличной части только текст инструкции из АРМ Управление КТК
	//ЗаполнитьДобавленныеКолонки("ИнструкцияПоСдачеИзАРМ");
	//
	//
	//ЗаполнитьТаблицуПоКлючамАналитики();
	////ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -конец
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Конец
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтейнерыВодителейПослеСвязки(ВыбранноеЗначение) //ДИТ Шевченко А.В. 51340 12.10.2022
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
	//Объект.ТранспортныеСредства.Загрузить(ВыбранноеЗначение.ТранспортныеСредства.Выгрузить());
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Конец
КонецПроцедуры


&НаСервереБезКонтекста
Функция АдресаЭлектроннойПочтыТерминала(ВладелецКИ)
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("БезПробелов", Истина);
	Возврат  УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(ВладелецКИ, Справочники.ВидыКонтактнойИнформации.EmailТерминала, ";", , ДополнительныеПараметры)	
КонецФункции	

&НаКлиенте
Процедура РезультатЧтенияТранспортныхСредств(ДанныеДляЗагрузки, ДополнительныеПараметры) Экспорт
	
	Если ДанныеДляЗагрузки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивСведений = ДанныеДляЗагрузки.Результат;
	
	Для Каждого ТекущаяЗапись Из МассивСведений Цикл
		
		НоваяСтрока = Объект[ДополнительныеПараметры.ИмяТЧ].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяЗапись);
		НоваяСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатЧтенияКТКИзТабДокумента(ДанныеДляЗагрузки, ДополнительныеПараметры) Экспорт
	// Заполнение табличной части Контейнеры в результате загрузки из Excel
	
	Если ДанныеДляЗагрузки = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	// Евросиб Фролов (14.02.2022 Ticket№ 46606
	ИнструкцияПоСдаче = Неопределено;
	Если ЗаполнятьПоПервойСтроке Тогда
		Если Объект.Контейнеры.Количество() > 0 Тогда
			ПерваяСтрока = Объект.Контейнеры[0];
			//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -начало
			ИнструкцияПоСдачеПерваяСтрока = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ПерваяСтрока.КлючАналитикиПеревозки,"ИнструкцияПоСдаче");
			//Если ЗначениеЗаполнено(ПерваяСтрока.ИнструкцияПоСдаче) Тогда
			//	ИнструкцияПоСдаче = ПерваяСтрока.ИнструкцияПоСдаче;
			Если ЗначениеЗаполнено(ПерваяСтрока.ИнструкцияПоСдаче) Тогда
				ИнструкцияПоСдаче = ИнструкцияПоСдачеПерваяСтрока;
			КонецЕсли;
			//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -конец
		КонецЕсли;		
	КонецЕсли;
	// Евросиб Фролов)
	
	МассивСведений = ДанныеДляЗагрузки.Результат;   
	
	// ДИТ US 76619 ТА 76735 Сержантова А.С. Начало: 13.11.2023
	Если ДанныеДляЗагрузки.Свойство("ТипЗаполнения") и ДанныеДляЗагрузки.ТипЗаполнения = 1 Тогда
		//Сначала посчитаем сколько строк нужно заполнить, если нет выделенных строк или всего одна выделенная   
		МассивИдентификаторов = Новый Массив;  
		КоличествоВыделенныхСтрок = Элементы.Контейнеры.ВыделенныеСтроки.Количество();  
		КоличествоВставляемыхКТК = МассивСведений.Количество();
		Если КоличествоВыделенныхСтрок <= 1 Тогда
			НачальныйНомерЗаполнения = 0;	
			Если КоличествоВыделенныхСтрок = 1 Тогда
				НачальныйНомерЗаполнения = Элементы.Контейнеры.ВыделенныеСтроки[0];
			КонецЕсли;  
			Пока НачальныйНомерЗаполнения <= (Объект.Контейнеры.Количество() - 1) Цикл  
				МассивИдентификаторов.Добавить(НачальныйНомерЗаполнения);
				НачальныйНомерЗаполнения = НачальныйНомерЗаполнения + 1;	
			КонецЦикла;
		КонецЕсли;   
		КоличествоСтрокЕслиНеВыделены = МассивИдентификаторов.Количество();    
		СтрокиКЗаполнению = ?(КоличествоСтрокЕслиНеВыделены = 0, Элементы.Контейнеры.ВыделенныеСтроки, МассивИдентификаторов);
		
		//Если ввели больше строк КТК, чем выделено или чем есть в документе, то предупреждаем, что перенесем не все 
		Если (КоличествоВыделенныхСтрок > 1 
			и КоличествоВыделенныхСтрок < КоличествоВставляемыхКТК)
			или (КоличествоСтрокЕслиНеВыделены > 0 и КоличествоСтрокЕслиНеВыделены < КоличествоВставляемыхКТК) Тогда
			НеПеренесемКоличество = ?(КоличествоСтрокЕслиНеВыделены = 0,
									КоличествоВставляемыхКТК - КоличествоВыделенныхСтрок,
									КоличествоВставляемыхКТК - КоличествоСтрокЕслиНеВыделены);  
			ПараметрыПереноса = Новый Структура("СтрокиКЗаполнению, ДанныеБуфера"); 
			ПараметрыПереноса.СтрокиКЗаполнению = СтрокиКЗаполнению;
			ПараметрыПереноса.ДанныеБуфера = МассивСведений;
			ОповещениеПослеВопроса = Новый ОписаниеОповещения("ПослеВопросаОПереносе_ЗаполнениеПустыхСтрокКТК", ЭтаФорма, ПараметрыПереноса); 	
			ТекстВопроса = СтрШаблон("Количество выделенных в документе строк для вставки меньше количества добавленных из буфера обмена контейнеров, 
			| %1 последних по списку контейнеров не будут перенесены в табличную часть документа.", НеПеренесемКоличество); 
			ПоказатьВопрос(ОповещениеПослеВопроса, ТекстВопроса,РежимДиалогаВопрос.ОКОтмена);  
			Возврат;
		КонецЕсли;
		
		ЗаполнитьПустыеСтрокиНомерамиКТКИзБуфера(СтрокиКЗаполнению, МассивСведений);
		Возврат;
	Иначе
	// ДИТ US 76619 ТА 76735 Сержантова А.С. Конец: 13.11.2023
	
	//ДИТ Шевченко А.В. BUG 75898 TA 75908 10.10.2023   
	Если МассивСведений.Количество() Тогда
		МассивКлючей = Новый Массив;
		Для Каждого СтрокаТЧ Из Объект.Контейнеры Цикл
			МассивКлючей.Добавить(СтрокаТЧ.КлючАналитикиПеревозки);
		КонецЦикла;
		МассивКлючейСПустымКонтейнером = ПолучитьМассивКлючейСПустымКонтейнером(МассивКлючей);
	КонецЕсли; 
	ОбработанныеКлючи = Новый Массив;
	//ДИТ Шевченко А.В. BUG 75898 TA 75908 10.10.2023
	
	Для Каждого ТекущаяЗапись Из МассивСведений Цикл
		//ДИТ Шевченко А.В. BUG 75898 TA 75908 10.10.2023
		//НоваяСтрока = Объект.Контейнеры.Добавить();
		////ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -начало
		//Ответ = СоздатьКлючАналитики(Объект.Заявка,ТекущаяЗапись.Контейнер);
		//НоваяСтрока.КлючАналитикиПеревозки = Ответ.КлючАналитикиПеревозки;
		//НоваяСтрока.ВерсияКлюча 		   = Ответ.ВерсияДанных;
		//ЭтаФорма.Модифицированность = Истина;
		//ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяЗапись);
		//НоваяСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		//// Евросиб Фролов (14.02.2022 Ticket№ 46606
		//Если ИнструкцияПоСдаче <> Неопределено Тогда
		//	НоваяСтрока.ИнструкцияПоСдаче = ИнструкцияПоСдаче;
		//	ДобавитьЗначениеРеквизитаВКлюч(НоваяСтрока.КлючАналитикиПеревозки,ИнструкцияПоСдаче,"ИнструкцияПоСдаче",,,НоваяСтрока.ВерсияКлюча);
		//КонецЕсли;
		
		Для Каждого КлючСсылка Из МассивКлючейСПустымКонтейнером Цикл
			Если ОбработанныеКлючи.Найти(КлючСсылка) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;	
			
			СтруктураОтбора = Новый Структура("КлючАналитикиПеревозки",КлючСсылка);
			СтрокиТЧКонтейнеры = Объект.Контейнеры.НайтиСтроки(СтруктураОтбора);
			
			Для Каждого СтрокаТЧ Из СтрокиТЧКонтейнеры Цикл
				ЭтаФорма.Модифицированность = Истина;
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, ТекущаяЗапись); 
				// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 05.12.2023
				//ДобавитьЗначениеРеквизитаВКлюч(КлючСсылка,ТекущаяЗапись.Контейнер,"Контейнер",,,СтрокаТЧ.ВерсияКлюча); 
				// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 05.12.2023
				Если ИнструкцияПоСдаче <> Неопределено Тогда
					СтрокаТЧ.ИнструкцияПоСдаче = ИнструкцияПоСдаче;  
					// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 05.12.2023
					//ДобавитьЗначениеРеквизитаВКлюч(КлючСсылка,ИнструкцияПоСдаче,"ИнструкцияПоСдаче",,,СтрокаТЧ.ВерсияКлюча); 
					// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 05.12.2023
				КонецЕсли;
			КонецЦикла;	
			
			ОбработанныеКлючи.Добавить(КлючСсылка);
			Прервать;
		КонецЦикла;	
		
		//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -конец
		// Евросиб Фролов)
		//ДИТ Шевченко А.В. BUG 75898 TA 75908 10.10.2023
	КонецЦикла;    

	// ДИТ US 76619 ТА 76735 Сержантова А.С. Начало: 13.11.2023
	КонецЕсли; 
    // ДИТ US 76619 ТА 76735 Сержантова А.С. Конец: 13.11.2023
	
	ЗаполнитьДобавленныеКолонки("ВидСобственности, СобственникКТК, ИнструкцияПоСдачеИзАРМ");
	
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -начало  
	//ЗаполнитьТаблицуПоКлючамАналитики();                // ДИТ US 76935 ТА 77189 Сержантова А.С. 08.12.2023 Закомментировала
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -конец
	
КонецПроцедуры  

// ДИТ US 76619 ТА 76735 Сержантова А.С. 07.11.2023 
&НаКлиенте
Процедура ПослеВопросаОПереносе_ЗаполнениеПустыхСтрокКТК(Результат, Параметры) Экспорт

	Если Результат = КодВозвратаДиалога.ОК Тогда
		ЗаполнитьПустыеСтрокиНомерамиКТКИзБуфера(Параметры.СтрокиКЗаполнению, Параметры.ДанныеБуфера);
	КонецЕсли;	

КонецПроцедуры   

// ДИТ US 76619 ТА 76735 Сержантова А.С. 07.11.2023  
&НаКлиенте
Асинх Процедура ЗаполнитьПустыеСтрокиНомерамиКТКИзБуфера(МассивИдентификаторов, ДанныеВставки)   
	
	ИменаЗаполненныхПолей = "";
	
	ИнструкцияПоСдаче = Неопределено;
	КоличествоВставляемыхКТК = ДанныеВставки.Количество();
	Если ЗаполнятьПоПервойСтроке Тогда
		Если Объект.Контейнеры.Количество() > 0 Тогда
			ПерваяСтрока = Объект.Контейнеры[0];
			ИнструкцияПоСдачеПерваяСтрока = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ПерваяСтрока.КлючАналитикиПеревозки,"ИнструкцияПоСдаче");
			Если ЗначениеЗаполнено(ПерваяСтрока.ИнструкцияПоСдаче) Тогда
				ИнструкцияПоСдаче = ИнструкцияПоСдачеПерваяСтрока;
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
	
    НомерСтроки = 0;
	ОтветПользователя_Перезаполнить = Неопределено;
	МассивИдентификаторовДляСортировки = Новый СписокЗначений;
	МассивИдентификаторовДляСортировки.ЗагрузитьЗначения(МассивИдентификаторов);
	МассивИдентификаторовДляСортировки.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	МассивИдентификаторов = МассивИдентификаторовДляСортировки.ВыгрузитьЗначения();
	
	Для каждого ИдентификаторСтроки Из МассивИдентификаторов Цикл 
		Если КоличествоВставляемыхКТК = НомерСтроки Тогда // больше нет контейнеров для вставки
			Прервать;
		КонецЕсли; 
		
		СтрокаУслуги = Объект.Контейнеры.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если ЗначениеЗаполнено(СтрокаУслуги.Контейнер) Тогда            
			//не задавали вопрос
			Если ОтветПользователя_Перезаполнить = Неопределено Тогда
				// здесь надо спросить у пользователя перезаполнить или пропустить?  
				КнопкиВопроса = Новый СписокЗначений();
				КнопкиВопроса.Добавить(КодВозвратаДиалога.Нет, "Пропустить");
				КнопкиВопроса.Добавить(КодВозвратаДиалога.Да, "Перезаполнить");
				КнопкиВопроса.Добавить(КодВозвратаДиалога.ОК, "Перезаполнить все" + Символы.ПС + "выделенные строки");
				КнопкиВопроса.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
				ТекстВопроса = СтрШаблон("Поле ""Номер КТК"" заполнено в строке № %1." +
							Символы.ПС+ "Перезаполнить номер контейнера в указанной строке" +
							Символы.ПС+ "или пропустить её?",
				ИдентификаторСтроки + 1);    
				Обещание = Ждать ВопросАсинх(ТекстВопроса, КнопкиВопроса,,,"В строке уже заполнен КТК"); 
				Если Обещание = КодВозвратаДиалога.Нет Тогда      //Пропускаем одну строку
					Продолжить;
				ИначеЕсли Обещание = КодВозвратаДиалога.Да Тогда  //Перезаполнить одну строку
					СтрокаВставки = ДанныеВставки[НомерСтроки];
					ЗаполнитьСтрокуДаннымиВставкиИзБуфера(ИдентификаторСтроки, СтрокаВставки, ИнструкцияПоСдаче);
					НомерСтроки = НомерСтроки + 1;
					Продолжить;
				ИначеЕсли Обещание = КодВозвратаДиалога.Отмена Тогда  //Прерываем последующее исполнение	
					Прервать; 
				ИначеЕсли Обещание = КодВозвратаДиалога.ОК Тогда  //Перезаполнить все выделенные строки
					СтрокаВставки = ДанныеВставки[НомерСтроки];
					ЗаполнитьСтрокуДаннымиВставкиИзБуфера(ИдентификаторСтроки, СтрокаВставки, ИнструкцияПоСдаче);
					НомерСтроки = НомерСтроки + 1;  
					ОтветПользователя_Перезаполнить = КодВозвратаДиалога.ОК;
					Продолжить;
				КонецЕсли;    
			//был получен ответ по всем строкам	
			Иначе
				Если ОтветПользователя_Перезаполнить = КодВозвратаДиалога.ОК Тогда
					СтрокаВставки = ДанныеВставки[НомерСтроки];
					ЗаполнитьСтрокуДаннымиВставкиИзБуфера(ИдентификаторСтроки, СтрокаВставки, ИнструкцияПоСдаче); 
					НомерСтроки = НомерСтроки + 1; 
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		Иначе	
			СтрокаВставки = ДанныеВставки[НомерСтроки];	
			ЗаполнитьСтрокуДаннымиВставкиИзБуфера(ИдентификаторСтроки, СтрокаВставки, ИнструкцияПоСдаче); 
			НомерСтроки = НомерСтроки + 1;
		КонецЕсли;
	КонецЦикла; 
	
	ОповеститьОбИзменении(Тип("СправочникСсылка.КлючиАналитикиПеревозки")); 
	ЗаполнитьДобавленныеКолонки("ВидСобственности, СобственникКТК, ИнструкцияПоСдачеИзАРМ"); 
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 08.12.2023
	//ЗаполнитьТаблицуПоКлючамАналитики();
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 08.12.2023
	
КонецПроцедуры  

// ДИТ US 76619 ТА 76735 Сержантова А.С. 07.11.2023 
&НаКлиенте
Процедура ЗаполнитьСтрокуДаннымиВставкиИзБуфера(ИдентификаторСтроки, СтрокаВставки, ИнструкцияПоСдаче) 
	
	ЭтаФорма.Модифицированность = Истина;
	СтрокаКТК = Объект.Контейнеры.НайтиПоИдентификатору(ИдентификаторСтроки);
	КлючСсылка = СтрокаКТК.КлючАналитикиПеревозки;
	
	ЗаполнитьЗначенияСвойств(СтрокаКТК, СтрокаВставки);  
	//Евросиб(ДИТ) Сержантова А.С. US 77172 ТА 83838 Начало 05.02.2025
	СтрокаКТК.ДатаДобавленияВРелиз = ТекущаяДата();
	//Евросиб(ДИТ) Сержантова А.С. US 77172 ТА 83838 Конец 05.02.2025  
	
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 05.12.2023
	//ДобавитьЗначениеРеквизитаВКлюч(КлючСсылка,СтрокаВставки.Контейнер,"Контейнер",,,СтрокаКТК.ВерсияКлюча);  
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 05.12.2023
	Если ИнструкцияПоСдаче <> Неопределено Тогда
		СтрокаКТК.ИнструкцияПоСдаче = ИнструкцияПоСдаче;    
		// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 05.12.2023
		//ДобавитьЗначениеРеквизитаВКлюч(КлючСсылка,ИнструкцияПоСдаче,"ИнструкцияПоСдаче",,,СтрокаКТК.ВерсияКлюча);
		// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 05.12.2023
	КонецЕсли;   
	
	ОповеститьОбИзменении(Тип("СправочникСсылка.КлючиАналитикиПеревозки"));

КонецПроцедуры

&НаСервере
Функция ПолучитьМассивКлючейСПустымКонтейнером(МассивКлючей) //ДИТ Шевченко А.В. BUG 75898 TA 75908 10.10.2023
	
	МассивОтвет = Новый Массив;
	
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 08.12.2023 - все изменения в форме, изменила дерективу компиляции с контекстом формы 
	// Было:
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	КлючиАналитикиПеревозки.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
	//	|ГДЕ
	//	|	КлючиАналитикиПеревозки.Ссылка В(&МассивКлючей)
	//	|	И КлючиАналитикиПеревозки.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)";
	//
	//Запрос.УстановитьПараметр("МассивКлючей", МассивКлючей);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	МассивОтвет.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	//КонецЦикла;	 
	//Стало:   
	ОтборПустыхКТК = Новый структура("Контейнер", Справочники.ТЕ.ПустаяСсылка()); 
	ТЗПустыеКТК = Объект.Контейнеры.Выгрузить(ОтборПустыхКТК, "КлючАналитикиПеревозки"); 
	МассивОтвет = ТЗПустыеКТК.ВыгрузитьКолонку("КлючАналитикиПеревозки");
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 08.12.2023
	
	Возврат МассивОтвет;
	
КонецФункции

&НаКлиенте
Процедура НастроитьДоступностьЭлементовШапки()

	// Евросиб Фролов (30.05.2022 Task №49741
	// Закомментировал
	//Элементы.СтокВыдачи.ТолькоПросмотр = Объект.ВыдачаОтСобственника;
	// Евросиб Фролов)

	// ++ ДИТ_Агафонов_task 50388 25.06.2022
	//Заменяем на постоянную доступность
	Элементы.НомерРелиза.ТолькоПросмотр = Не Объект.ВыдачаОтСобственника;
	Элементы.НомерРелиза.АвтоОтметкаНезаполненного = Истина;
	// -- ДИТ_Агафонов_task 50388 25.06.2022 
	
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 13.12.2022  
   	Элементы.СтанцияНазначенияПоЖД.Видимость = (Объект.Автоперевозка = ПредопределенноеЗначение("Перечисление.ВариантыАвтоперевозки.НеТребуется"));
	Элементы.ДатаОтправленияПоЖДПлан.Видимость = (Объект.Автоперевозка = ПредопределенноеЗначение("Перечисление.ВариантыАвтоперевозки.НеТребуется"));
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 13.12.2022
	
	Элементы.СобственникКТК.Видимость 				 = Объект.ВыдачаОтСобственника;
	Элементы.СобственникКТК.ОтметкаНезаполненного 	 = Объект.ВыдачаОтСобственника И Не ЗначениеЗаполнено(Объект.СобственникКТК);
	
	Элементы.РелизСобственника.Видимость 			 = Объект.ВыдачаОтСобственника;
	Элементы.РелизСобственника.ОтметкаНезаполненного = Объект.ВыдачаОтСобственника И Не ЗначениеЗаполнено(Объект.РелизСобственника);
	
	Элементы.СтатусСогласованияСпискаКТК.Видимость	 = Объект.НомернаяВыдача;
	//Евросиб Шевченко А.В. US 73357 TA 115689 04.08.2025
	Элементы.КонтактыТерминалаВыдачи.Видимость		 = НЕ Объект.ВыдачаОтСобственника;
	//Евросиб Шевченко А.В. US 73357 TA 115689 04.08.2025
	НастроитьДоступностьКнопокДобавленияТС(); 
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Если установлен признак "Выдача от собственника", то поле "Контейнер"
	// в табличной части только для просмотра, т.к. заполняестя из релиза собственника.
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КонтейнерыКонтейнер.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыдачаОтСобственника");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Если установлен признак "Выдача от собственника", то поле "Собственник КТК" в табличной части не отображается.
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КонтейнерыСобственникКТК.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыдачаОтСобственника");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// ++ ДИТ_Агафонов_task 50388 28.06.2022
	//Убираем в коммент
	//// Если установлен признак "Выдача от собственника", то поле "Дата вывоза" в табличной части не доступна для редактирования.
	//Элемент = УсловноеОформление.Элементы.Добавить();

	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КонтейнерыДатаВывоза.Имя);

	//ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыдачаОтСобственника");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение = Истина;
	//
	//Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	//
	//// Если установлен признак "Выдача от собственника", то поле "Дата вывоза"
	//// в табличной части только для просмотра, т.к. заполняестя из релиза собственника.
	//Элемент = УсловноеОформление.Элементы.Добавить();

	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КонтейнерыДатаВывоза.Имя);

	//ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыдачаОтСобственника");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение = Истина;
	//
	//Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	// -- ДИТ_Агафонов_task 50388 28.06.2022
	
	// Если текст инстркукции по сдаче в документе и в АРМ отличается, то выделим эти ячейки
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КонтейнерыИнструкцияПоСдаче.Имя);
	
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Контейнеры.ИнструкцияПоСдачеИзАРМ");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -начало
	//ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Контейнеры.ИнструкцияПоСдаче");
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Контейнеры.ИнструкцияПоСдаче");
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -конец
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Контейнеры.ИнструкцияПоСдачеИзАРМ");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);	
	
КонецПроцедуры	

&НаКлиенте
Процедура СохранитьКонтактыТерминалаВыдачи()
	
	// Перенесем адреса из списка значений на форме в реквизит объекта
	МассивАдресов = КонтактыТерминалаВыдачи.ВыгрузитьЗначения();
	Объект.КонтактТерминала = СтрСоединить(МассивАдресов, ";")
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьДобавленныеКолонки(ОбновляемыеПоля, ТолькоПеревозчиков = Ложь)
	
	ТабличнаяЧасть 			= Объект.Контейнеры.Выгрузить();
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 –начало
	//МассивКонтейнеров 		= ТабличнаяЧасть.ВыгрузитьКолонку("Контейнер");	
	МассивКонтейнеров 		= Новый Массив;
	Для Каждого СтрокаТЧ из ТабличнаяЧасть Цикл
		Если ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.КлючАналитикиПеревозки,"Контейнер")) Тогда
			МассивКонтейнеров.Добавить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.КлючАналитикиПеревозки,"Контейнер"));
		КонецЕсли;	
	КонецЦикла;	
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 –Конец
	МассивИдентификаторов 	= ТабличнаяЧасть.ВыгрузитьКолонку("ИдентификаторСтроки"); 
	
	ДанныеКТК 	= ПолучитьИнструкции(МассивКонтейнеров);
	//Евросиб Коханенко Н.А. 08.05.2024 (( #83866 
	//Заявки 		= Документы.РелизКлиента.ПолучитьЗаявки(МассивИдентификаторов);
	//не берем в расчет строки, ктк из которых уже перенесены в другую заявку
	Заявки = Документы.РелизКлиента.ПолучитьЗаявки(МассивИдентификаторов, Истина);
	//Евросиб Коханенко Н.А. 08.05.2024 )) #83866 
	
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
	//ДИТ Шевченко А.В. TASK 51973 03.06.2022 -Начало
	//Водители 			  		= Новый Соответствие;
	//ВодителиПоследняяМиля 		= Новый Соответствие;
	//ДИТ Шевченко А.В. TASK  06.10.2022 -Начало
	//Перевозчики 		  		= Новый Соответствие;
	//ПеревозчикиПоследняяМиля	= Новый Соответствие;
	//ДИТ Шевченко А.В. TASK  06.10.2022 -конец
	
	//ПолучитьСоответствияПеревозчиковИВодителей(Водители,"ТранспортныеСредства");
	//ПолучитьСоответствияПеревозчиковИВодителей(ВодителиПоследняяМиля,"ТранспортныеСредстваПоследняяМиля");
	//ДИТ Шевченко А.В. TASK 51973 03.06.2022 -Конец
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Конец
	Для Каждого ТекущаяСтрока Из Объект.Контейнеры Цикл
		//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
		// Обновим колонки ФИО и ТС
		//ТекущаяСтрока.ВывозКонтейнераФИОВодителя = "";
		//ТекущаяСтрока.ВывозКонтейнераРегНомерТС = "";
		//Если ЗначениеЗаполнено(ТекущаяСтрока.ИдентификаторСтрокиТС) Тогда
		//	СведенияОВодителе = Водители.Получить(ТекущаяСтрока.ИдентификаторСтрокиТС);
		//	Если СведенияОВодителе <> Неопределено Тогда
		//		ТекущаяСтрока.ВывозКонтейнераФИОВодителя = СведенияОВодителе.ФИОВодителя;
		//		ТекущаяСтрока.ВывозКонтейнераРегНомерТС = СведенияОВодителе.РегНомерТС;
		//		ТекущаяСтрока.Автоперевозчик = СведенияОВодителе.Автоперевозчик;
		//	КонецЕсли;
		//КонецЕсли;
		//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Конец
		// Обновим колонку автоперевозчика
		//ДИТ Шевченко А.В. TASK  06.10.2022 -Начало
		//ТекущаяСтрока.Автоперевозчик = Справочники.Контрагенты.ПустаяСсылка();
		//Если ЗначениеЗаполнено(ТекущаяСтрока.ИдентификаторСтрокиТС) Тогда
		//	СведенияОПеревозчике = Водители.Получить(ТекущаяСтрока.ИдентификаторСтрокиТС);
		//	Если СведенияОПеревозчике <> Неопределено Тогда
		//		ТекущаяСтрока.Автоперевозчик = СведенияОПеревозчике;
		//	КонецЕсли;	
		//КонецЕсли;
		
		//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
		//ТекущаяСтрока.СдачаКонтейнераФИОВодителя = "";
		//ТекущаяСтрока.СдачаКонтейнераРегНомерТС = "";
		//Если ЗначениеЗаполнено(ТекущаяСтрока.ИдентификаторСтрокиТСПоследняяМиля) Тогда
		//	СведенияОВодителе = ВодителиПоследняяМиля.Получить(ТекущаяСтрока.ИдентификаторСтрокиТСПоследняяМиля);
		//	Если СведенияОВодителе <> Неопределено Тогда
		//		ТекущаяСтрока.СдачаКонтейнераФИОВодителя = СведенияОВодителе.ФИОВодителя;
		//		ТекущаяСтрока.СдачаКонтейнераРегНомерТС = СведенияОВодителе.РегНомерТС;
		//		ТекущаяСтрока.АвтоперевозчикПоследняяМиля = СведенияОВодителе.Автоперевозчик;
		//	КонецЕсли;
		//КонецЕсли;
		//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Конец
		//ТекущаяСтрока.АвтоперевозчикПоследняяМиля = Справочники.Контрагенты.ПустаяСсылка();
		//Если ЗначениеЗаполнено(ТекущаяСтрока.ИдентификаторСтрокиТСПоследняяМиля) Тогда
		//	СведенияОПеревозчике = ВодителиПоследняяМиля.Получить(ТекущаяСтрока.ИдентификаторСтрокиТСПоследняяМиля);
		//	Если СведенияОПеревозчике <> Неопределено Тогда
		//		ТекущаяСтрока.АвтоперевозчикПоследняяМиля = СведенияОПеревозчике;
		//	КонецЕсли;	
		//КонецЕсли;
		//ДИТ Шевченко А.В. TASK  06.10.2022 -конец
		Если ТолькоПеревозчиков Тогда
			// Остальные колонки не обновляем.
			// Для случая, когда обновляются данные по релизу клиента 
			// (нажата кнопка "Обновить данные в релизе из запроса") - в этом случае нужно
			// обновить только водителей и перевозчиков.
			Продолжить;
		КонецЕсли;
		
		//Если ЗначениеЗаполнено(ТекущаяСтрока.Контейнер) Тогда
		//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 –начало
		Если ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.КлючАналитикиПеревозки,"Контейнер")) Тогда
			//ДанныеТекущегоКТК = ДанныеКТК.Получить(ТекущаяСтрока.Контейнер);
			ДанныеТекущегоКТК = ДанныеКТК.Получить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.КлючАналитикиПеревозки,"Контейнер"));
			Если ДанныеТекущегоКТК <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ТекущаяСтрока, ДанныеТекущегоКТК, ОбновляемыеПоля); 
			Иначе
				ТекущаяСтрока.СобственникКТК 	= Справочники.Контрагенты.ПустаяСсылка();
				ТекущаяСтрока.ВидСобственности	= ПредопределенноеЗначение("Перечисление.ВариантыСобственности.ПустаяСсылка");
			КонецЕсли;
		Иначе
			ТекущаяСтрока.СобственникКТК 	= Справочники.Контрагенты.ПустаяСсылка();
			ТекущаяСтрока.ВидСобственности	= ПредопределенноеЗначение("Перечисление.ВариантыСобственности.ПустаяСсылка");
		КонецЕсли;
		//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 –конец		
		ЗаявкаКонтейнера = Заявки.Получить(ТекущаяСтрока.ИдентификаторСтроки);
		ТекущаяСтрока.ДобавленВЗаявку = ЗаявкаКонтейнера;	
		
	КонецЦикла; 
	
КонецПроцедуры	

// Процедура - Получить соответствия перевозчиков и водителей
//
// Параметры:
//  Водители			 - Соответствие	 - Соответсвие водителей и индентификаторов строк
//  Перевозчики			 - Соответствие	 - Соответсвие перевозчиков и индентификаторов строк 
//  ИмяТчТС				 - Строка	 - Имя табличной части "Транспортные средства" или "Транспортные средства поледняя миля"
//
&НаСервере
Процедура ПолучитьСоответствияПеревозчиковИВодителей(Водители,ИмяТчТС)
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
	//Для Каждого ТекущаяСтрока Из Объект[ИмяТчТС] Цикл
	//	ДанныеВодителя = Новый Структура;
	//	ДанныеВодителя.Вставить("ФИОВодителя", ТекущаяСтрока.ФИОВодителя);
	//	ДанныеВодителя.Вставить("РегНомерТС", ТекущаяСтрока.РегНомерТС);
	//	ДанныеВодителя.Вставить("Автоперевозчик", ТекущаяСтрока.Автоперевозчик);
	//	Водители.Вставить(ТекущаяСтрока.ИдентификаторСтроки, ДанныеВодителя);
	//КонецЦикла;	
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Конец
КонецПроцедуры	

&НаСервере
Процедура ОбновитьИтоги()
	Документы.РелизКлиента.ОбновитьИтоги(Объект);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИнструкции(МассивКонтейнеров)
	Возврат Документы.РелизКлиента.ПолучитьИнструкции(МассивКонтейнеров);	
КонецФункции

&НаСервере
Процедура ОпределитьСтатусРелиза()
	
	ТекущаяДата = НачалоДня(ТекущаяДатаСеанса()); // Евросиб Фролов (14.03.2022 Ticket №0263596, привел к началу дня
	
	Если Объект.ДействиеРелизаОкончание >= ТекущаяДата // Евросиб Фролов (14.03.2022 Ticket №0263596, ">=" вместо ">" 
		И Объект.ВыданоКТКПоРелизу < Объект.ОбщееКоличествоКТКВРелизе Тогда
		СтатусРелиза = СтрШаблон("%1: %2/%3", "Активен", Объект.ВыданоКТКПоРелизу, Объект.ОбщееКоличествоКТКВРелизе);		
	КонецЕсли;
	
	Если Объект.ДействиеРелизаОкончание < ТекущаяДата И Объект.ВыданоКТКПоРелизу > 1
		ИЛИ Объект.ДействиеРелизаОкончание > ТекущаяДата И Объект.ВыданоКТКПоРелизу = Объект.ОбщееКоличествоКТКВРелизе Тогда
		СтатусРелиза = СтрШаблон("%1: %2/%3", "Реализован", Объект.ВыданоКТКПоРелизу, Объект.ОбщееКоличествоКТКВРелизе);		
	КонецЕсли;
	
	Если Объект.ДействиеРелизаОкончание < ТекущаяДата
		И Объект.ВыданоКТКПоРелизу = 0 Тогда
		СтатусРелиза = СтрШаблон("%1: %2/%3", "Аннулирован", Объект.ВыданоКТКПоРелизу, Объект.ОбщееКоличествоКТКВРелизе);		
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьИнструкциюПоСдачеТекущегоКонтейнера(ТекущиеДанные)
	
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 –начало 
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 07.12.2023
	// Было:
	//ТекущиеДанныеКонтейнер = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ТекущиеДанные.КлючАналитикиПеревозки,"Контейнер"); 
	//Стало:
	ТекущиеДанныеКонтейнер = ТекущиеДанные.Контейнер;
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 07.12.2023
	
	МассивКонтейнеров = Новый Массив;
	МассивКонтейнеров.Добавить(ТекущиеДанныеКонтейнер);
	ДанныеПоКТК = ПолучитьИнструкции(МассивКонтейнеров);
	
	ДанныеТекущегоКТК = ДанныеПоКТК.Получить(ТекущиеДанныеКонтейнер);
	Если ДанныеТекущегоКТК <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДанныеТекущегоКТК); // заполняем все поля, т.к. сюда попадаем после выбора КТК в строке или при его добавлении в табличную часть
		// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 05.12.2023
		//ДобавитьЗначениеРеквизитаВКлюч(ТекущиеДанные.КлючАналитикиПеревозки,ДанныеТекущегоКТК.ИнструкцияПоСдачеИзАРМ,"ИнструкцияПоСдаче",,,ТекущиеДанные.ВерсияКлюча);
		// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 05.12.2023
	Иначе
		ТекущиеДанные.СобственникКТК 	= ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		ТекущиеДанные.ВидСобственности	= ПредопределенноеЗначение("Перечисление.ВариантыСобственности.ПустаяСсылка");
	КонецЕсли;
	
	// Евросиб Фролов (14.02.2022 Ticket№ 46606
	Если ЗаполнятьПоПервойСтроке Тогда
		Если Объект.Контейнеры.Количество() > 1 Тогда
			ПерваяСтрока = Объект.Контейнеры[0];
			Если ЗначениеЗаполнено(ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ПерваяСтрока.КлючАналитикиПеревозки,"ИнструкцияПоСдаче")) Тогда
				//ТекущиеДанные.ИнструкцияПоСдаче = ПерваяСтрока.ИнструкцияПоСдаче;  
				// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 05.12.2023
				//ДобавитьЗначениеРеквизитаВКлюч(ТекущиеДанные.КлючАналитикиПеревозки,ПерваяСтрока.ИнструкцияПоСдаче,"ИнструкцияПоСдаче",,,ТекущиеДанные.ВерсияКлюча);
				// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 05.12.2023
			КонецЕсли;	
		КонецЕсли;		
	КонецЕсли;
	// Евросиб Фролов)
	
	// Если текст инструкции в АРМ и в документе отличается, то уведомим об этом пользователя
	Если ЗначениеЗаполнено(ТекущиеДанные.ИнструкцияПоСдачеИзАРМ)
		//И СокрЛП(ТекущиеДанные.ИнструкцияПоСдачеИзАРМ) <> СокрЛП(ТекущиеДанные.ИнструкцияПоСдаче) Тогда
		И СокрЛП(ТекущиеДанные.ИнструкцияПоСдачеИзАРМ) <> СокрЛП(ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ТекущиеДанные.КлючАналитикиПеревозки,"ИнструкцияПоСдаче")) Тогда
		ТекстСообщения = СтрШаблон("Инструкции по сдаче в строке %1 отличаются от указанных в АРМ КТК", ТекущиеДанные.НомерСтроки);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	НастроитьВидимостьКолонкиИнструкцииАРМ();
	
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 07.12.2023
	// Было:
	//ТекущиеДанные.ТипоразмерКТК = ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ТекущиеДанные.КлючАналитикиПеревозки, "Контейнер.ТипТЕ"); 
	//Стало:
	ТекущиеДанные.ТипоразмерКТК = ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Контейнер, "ТипТЕ");
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 07.12.2023
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 –конец
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьКолонкиИнструкцииАРМ()
	
	СтрокиСПустойИнструкцией = Объект.Контейнеры.НайтиСтроки(Новый Структура("ИнструкцияПоСдачеИзАРМ", ""));
	ЕстьЗаполненныеИнструкции = СтрокиСПустойИнструкцией.Количество() <> Объект.Контейнеры.Количество();
		
	Элементы.КонтейнерыИнструкцияПоСдачеИзАРМ.Видимость = ЕстьЗаполненныеИнструкции;	
	
КонецПроцедуры	

&НаСервере
Процедура НастроитьЗависимыеОтАвтоперевозкиЭлементы()
	//ДИТ Шевченко А.В. TASK 51973 03.06.2022 -Начало	
	//Элементы.СтраницаДанныеПоАвтоперевозке.Видимость = (Объект.Автоперевозка = Перечисления.ВариантыАвтоперевозки.СиламиЕвросиб ИЛИ Объект.Автоперевозка = Перечисления.ВариантыАвтоперевозки.СиламиКлиента) 
	//													ИЛИ 
	//													(Объект.АвтоперевозкаПоследняяМиля = Перечисления.ВариантыАвтоперевозки.СиламиЕвросиб ИЛИ Объект.АвтоперевозкаПоследняяМиля = Перечисления.ВариантыАвтоперевозки.СиламиКлиента);
														
	Элементы.ГруппаПерваяМиля.Видимость    = Объект.Автоперевозка              = Перечисления.ВариантыАвтоперевозки.СиламиЕвросиб ИЛИ Объект.Автоперевозка              = Перечисления.ВариантыАвтоперевозки.СиламиКлиента;													
	Элементы.ГруппаПоследняяМиля.Видимость = Объект.АвтоперевозкаПоследняяМиля = Перечисления.ВариантыАвтоперевозки.СиламиЕвросиб ИЛИ Объект.АвтоперевозкаПоследняяМиля = Перечисления.ВариантыАвтоперевозки.СиламиКлиента;													
														
	НастроитьДоступностьКнопокДобавленияТС();
	//ДИТ Шевченко А.В. TASK 51973 03.06.2022 -Конец
КонецПроцедуры

&НаСервере
Процедура НастроитьДоступностьКнопокДобавленияТС()
	// Беккер Р.: кнопки в ТЧ релиза на закладке Данные по автоперевозке должны быть доступны, если автоперевозка "Силами Евросиб"
	ПеревозкаСиламиЕвросиб = Объект.Автоперевозка = Перечисления.ВариантыАвтоперевозки.СиламиЕвросиб;
	
	// Евросиб Фролов (30.05.2022 Task №49741
	// Закомментировал: разрешить загрузку из Excel если выдача от собственника.
	//Элементы.КонтейнерыЗагрузитьИзExcel.Доступность	= Объект.ВыдачаОтСобственника = Ложь;
	// Евросиб Фролов)
	// ++ ДИТ_Агафонов_task 56709 11.09.2022
	Элементы.КонтейнерыЗагрузитьИзExcel.Видимость = Не Объект.ВыдачаОтСобственника;
	Элементы.КонтейнерыПодобратьИзРелизаСобственника.Видимость = Объект.ВыдачаОтСобственника;
	// -- ДИТ_Агафонов_task 56709 11.09.2022
	
	//ДИТ Шевченко А.В. TASK  06.10.2022 -начало
	//Элементы.ТранспортныеСредстваКнопкаДобавить.Доступность = ПеревозкаСиламиЕвросиб;
	//Элементы.ТранспортныеСредстваВставитьВодителейИзExcel.Доступность = ПеревозкаСиламиЕвросиб;
	//ДИТ Шевченко А.В. TASK  06.10.2022 -конец
	
	//ДИТ Шевченко А.В. TASK 51973 03.06.2022 -Начало
	ПеревозкаСиламиЕвросибПоследняяМиля = Объект.АвтоперевозкаПоследняяМиля = Перечисления.ВариантыАвтоперевозки.СиламиЕвросиб;
	//ДИТ Шевченко А.В. TASK  06.10.2022 -начало
	//Элементы.ТранспортныеСредстваПоследняяМиляКнопкаДобавить.Доступность = ПеревозкаСиламиЕвросибПоследняяМиля;
	//Элементы.ТранспортныеСредстваПоследняяМиляВставитьВодителейИзExcelПоследняяМиля.Доступность = ПеревозкаСиламиЕвросибПоследняяМиля;
	//ДИТ Шевченко А.В. TASK  06.10.2022 -конец
	//ДИТ Шевченко А.В. TASK 51973 03.06.2022 -Конец
КонецПроцедуры	

&НаКлиенте
//++ДИТ Моисеенко Ю.В. task#60109 09.11.2022
//Процедура ВыбратьВодителя(ТекущиеДанные)
Процедура ВыбратьВодителя(ТекущиеДанные, ВывозКонтейнера = Истина)
    //ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
	////--ДИТ Моисеенко Ю.В. task#60109 09.11.2022

	////++ДИТ Моисеенко Ю.В. task#60109 09.11.2022
	//МассивПривязанныхВодителей = ПолучитьМассивЗанятыхВодителей(ВывозКонтейнера);
	////--ДИТ Моисеенко Ю.В. task#60109 09.11.2022
	//
	//СписокСвободныхВодителей = Новый СписокЗначений;
	//
	////++ДИТ Моисеенко Ю.В. task#60109 09.11.2022
	////Для Каждого ТекущийВодитель Из Объект.ТранспортныеСредства Цикл
	//ИмяТЧ = ?(ВывозКонтейнера, "ТранспортныеСредства", "ТранспортныеСредстваПоследняяМиля");
	//Для Каждого ТекущийВодитель Из Объект[ИмяТЧ] Цикл
	////--ДИТ Моисеенко Ю.В. task#60109 09.11.2022
	//	
	//	Если МассивПривязанныхВодителей.Найти(ТекущийВодитель.ИдентификаторСтроки) = Неопределено Тогда
	//		//++ДИТ Моисеенко Ю.В. task#60109 09.11.2022
	//		//СписокСвободныхВодителей.Добавить(ТекущийВодитель.ИдентификаторСтроки, ТекущийВодитель.ФИОВодителя + ", ТС " + ТекущийВодитель.РегНомерТС);
	//		СписокСвободныхВодителей.Добавить(ТекущийВодитель.ИдентификаторСтроки, ТекущийВодитель.ФИОВодителя + ", ТС " + ТекущийВодитель.РегНомерТС
	//											+ ", " + ТекущийВодитель.Автоперевозчик);
	//		//--ДИТ Моисеенко Ю.В. task#60109 09.11.2022
	//	КонецЕсли;
	//	
	//КонецЦикла;	
	//
	//Если СписокСвободныхВодителей.Количество() = 0 Тогда
	//	ПоказатьПредупреждение(, "Нет свободных водителей для выбора");
	//	Возврат;
	//КонецЕсли;	
	//
	////++ДИТ Моисеенко Ю.В. task#60109 09.11.2022
	////Оповещение = Новый ОписаниеОповещения("ПослеВыбораВодителя", ЭтотОбъект, ТекущиеДанные);
	//ДополнительныеПараметры = Новый Структура("ТекущиеДанные, ВывозКонтейнера", ТекущиеДанные, ВывозКонтейнера);
	//Оповещение = Новый ОписаниеОповещения("ПослеВыбораВодителя", ЭтотОбъект, ДополнительныеПараметры);
	////--ДИТ Моисеенко Ю.В. task#60109 09.11.2022
	//
	//СписокСвободныхВодителей.ПоказатьВыборЭлемента(Оповещение, "Выберите водителя.");
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Конец
КонецПроцедуры	

&НаСервере
//++ДИТ Моисеенко Ю.В. task#60109 09.11.2022
//Функция ПолучитьМассивЗанятыхВодителей()
Функция ПолучитьМассивЗанятыхВодителей(ВывозКонтейнера)
//--ДИТ Моисеенко Ю.В. task#60109 09.11.2022

	//++ДИТ Моисеенко Ю.В. task#60109 09.11.2022
	//Возврат Объект.Контейнеры.Выгрузить(, "ИдентификаторСтрокиТС").ВыгрузитьКолонку("ИдентификаторСтрокиТС");
	Если ВывозКонтейнера Тогда
		МассивИдентификаторов = Объект.Контейнеры.Выгрузить(, "ИдентификаторСтрокиТС").ВыгрузитьКолонку("ИдентификаторСтрокиТС");
	Иначе
		МассивИдентификаторов = Объект.Контейнеры.Выгрузить(, "ИдентификаторСтрокиТСПоследняяМиля").ВыгрузитьКолонку("ИдентификаторСтрокиТСПоследняяМиля");
	КонецЕсли;
	Возврат МассивИдентификаторов;
	//--ДИТ Моисеенко Ю.В. task#60109 09.11.2022
	
КонецФункции	

&НаКлиенте
//++ДИТ Моисеенко Ю.В. task#60109 09.11.2022
//Процедура ПослеВыбораВодителя(ВыбранныйВодитель, ТекущиеДанные) Экспорт
Процедура ПослеВыбораВодителя(ВыбранныйВодитель, ДополнительныеПараметры) Экспорт
//--ДИТ Моисеенко Ю.В. task#60109 09.11.2022

    Если ВыбранныйВодитель = Неопределено Тогда
        ПоказатьПредупреждение(, "Водитель не выбран.");
    Иначе
		//++ДИТ Моисеенко Ю.В. task#60109 09.11.2022
		//ЧастиПредставления = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВыбранныйВодитель.Представление, ", ТС ");
	    ЧастиПредставления = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВыбранныйВодитель.Представление, ",");
		//--ДИТ Моисеенко Ю.В. task#60109 09.11.2022
		
		//++ДИТ Моисеенко Ю.В. task#60109 09.11.2022
	    ТекущиеДанные 	= ДополнительныеПараметры.ТекущиеДанные;
		ВывозКонтейнера = ДополнительныеПараметры.ВывозКонтейнера;

		Если ВывозКонтейнера Тогда
		//--ДИТ Моисеенко Ю.В. task#60109 09.11.2022
			ТекущиеДанные.ИдентификаторСтрокиТС = ВыбранныйВодитель.Значение;
			ТекущиеДанные.ВывозКонтейнераФИОВодителя = ЧастиПредставления[0];
			//++ДИТ Моисеенко Ю.В. task#60109 09.11.2022
			//ТекущиеДанные.ВывозКонтейнераРегНомерТС = ЧастиПредставления[1];
			ТекущиеДанные.ВывозКонтейнераРегНомерТС = СтрЗаменить(ЧастиПредставления[1], " ТС ", "");
		    ТекущиеДанные.Автоперевозчик 			= СтрЗаменить(ЧастиПредставления[2], " ", "");
			//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 начало
			СтруктураТЧМили = Новый Структура;
			СтруктураТЧМили.Вставить("ФИОВодителя",ЧастиПредставления[0]);
			СтруктураТЧМили.Вставить("РегНомерТС",СтрЗаменить(ЧастиПредставления[1], " ТС ", ""));
			СтруктураТЧМили.Вставить("Автоперевозчик",СтрЗаменить(ЧастиПредставления[2], " ", ""));  
			// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 05.12.2023
			//ДобавитьЗначениеРеквизитаВКлюч(ТекущиеДанные.КлючАналитикиПеревозки,ЧастиПредставления[0],"ФИОВодителя",ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПерваяМиля"),СтруктураТЧМили,ТекущиеДанные.ВерсияКлюча);
			// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 05.12.2023
			//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 конец
		Иначе
			ТекущиеДанные.ИдентификаторСтрокиТСПоследняяМиля = ВыбранныйВодитель.Значение;
			ТекущиеДанные.СдачаКонтейнераФИОВодителя 	= ЧастиПредставления[0];
			ТекущиеДанные.СдачаКонтейнераРегНомерТС 	= СтрЗаменить(ЧастиПредставления[1], " ТС ", "");
		    ТекущиеДанные.АвтоперевозчикПоследняяМиля 	= СтрЗаменить(ЧастиПредставления[2], " ", "");
			//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 начало
			СтруктураТЧМили = Новый Структура;
			СтруктураТЧМили.Вставить("ФИОВодителя",ЧастиПредставления[0]);
			СтруктураТЧМили.Вставить("РегНомерТС",СтрЗаменить(ЧастиПредставления[1], " ТС ", ""));
			СтруктураТЧМили.Вставить("Автоперевозчик",СтрЗаменить(ЧастиПредставления[2], " ", ""));
			// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 05.12.2023
			//ДобавитьЗначениеРеквизитаВКлюч(ТекущиеДанные.КлючАналитикиПеревозки,"","",ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПоследняяМиля"),СтруктураТЧМили,ТекущиеДанные.ВерсияКлюча);
			// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 05.12.2023
			//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 конец
		КонецЕсли;
		Модифицированность = Истина;
		ИзмененияВодителя = Истина;
		//--ДИТ Моисеенко Ю.В. task#60109 09.11.2022
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПеревозчика(ВыбранныйПеревозчик, ТекущиеДанные) Экспорт
    Если ВыбранныйПеревозчик = Неопределено Тогда
        ПоказатьПредупреждение(, "Перевозчик не выбран.");
    Иначе
		ТекущиеДанные.ИдентификаторСтрокиПеревозчика = ВыбранныйПеревозчик.Значение;
		ТекущиеДанные.Автоперевозчик = ВыбранныйПеревозчик.Представление;
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗаполнениеПоРелизуСобственника()
	Документы.РелизКлиента.ЗаполнитьРелизКлиентаПоРелизуСобственника(Объект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеИзЗапросаНаСервере()
	
	Если Не ЗначениеЗаполнено(ИдентификаторСтрокиЗаявки)
		ИЛИ Не ЗначениеЗаполнено(Объект.Заявка) Тогда
		Возврат;
	КонецЕсли;
	//ДИТ Шевченко А.В. TASK 59545 06.10.2022 -Начало
	//ДИТ Шевченко А.В. TASK 51973 03.06.2022 //Добавил в запрос поле АвтоперевозкаПоследняяМиля
	                                          //Добавил в запрос получение даных из таблиц относящихся к последней миле
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗаявкаСписокЗапросНаКТК.КоличествоКТК КАК ОбщееКоличествоКТКВРелизе,
	//Субботин 77659 15.12.2023 Начало
	|	ЗаявкаСписокЗапросНаКТК.СписокКТК КАК СписокКТК,
	//Субботин 77659 15.12.2023 Конец
	|	ЗаявкаСписокЗапросНаКТК.ТипКТК КАК ТипоразмерКТК,
	|	ЗаявкаСписокЗапросНаКТК.ЛокацияВыдачи КАК ЛокацияВыдачи,
	|	ЗаявкаСписокЗапросНаКТК.ДействиеРелизаНачало КАК ДействиеРелизаНачало,
	|	ЗаявкаСписокЗапросНаКТК.ДействиеРелизаОкончание КАК ДействиеРелизаОкончание,
	|	ЗаявкаСписокЗапросНаКТК.Автоперевозка КАК Автоперевозка,
	|	ЗаявкаСписокЗапросНаКТК.ПоследняяМиля КАК АвтоперевозкаПоследняяМиля,
	|	ЗаявкаСписокЗапросНаКТК.СрокИспользованияКТК КАК СрокИспользованияКТК,
	|	ЗаявкаСписокЗапросНаКТК.Ставка КАК Ставка,
	|	ЗаявкаСписокЗапросНаКТК.СНП КАК СНП,
	|	ЗаявкаСписокЗапросНаКТК.ВалютаПоДоговору КАК Валюта,
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 13.12.2022
	//Стало:
	|	ЗаявкаСписокЗапросНаКТК.ДатаОтправленияПоЖДПлан КАК ДатаОтправленияПоЖДПлан,
	|	ЗаявкаСписокЗапросНаКТК.СтанцияНазначенияПоЖД КАК СтанцияНазначенияПоЖД
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 13.12.2022
	|ИЗ
	|	Документ.Заявка.СписокЗапросНаКТК КАК ЗаявкаСписокЗапросНаКТК
	|ГДЕ
	|	ЗаявкаСписокЗапросНаКТК.Ссылка = &Заявка
	|	И ЗаявкаСписокЗапросНаКТК.ИдентификаторСтроки = &ИдентификаторСтроки
	//ДИТ Шевченко А.В. US 62421 ТА 70357 24.05.2023
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	КлючиМили.ФИОВодителя КАК ФИОВодителя,
	//|	КлючиМили.РегНомерТС КАК РегНомерТС,
	//|	КлючиМили.ПаспортныеДанные КАК ПаспортныеДанные,
	//|	ЗаявкаТранспортныеСредства.КлючАналитикиПеревозки КАК ИдентификаторСтроки,
	//|	КлючиМили.Автоперевозчик КАК Автоперевозчик,
	//|	КлючиМили.ИНН КАК ИНН,
	//|	КлючиМили.КПП КАК КПП
	//|ИЗ
	//|	Документ.Заявка.ТранспортныеСредства КАК ЗаявкаТранспортныеСредства
	////ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
	//|   ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиМили
	//|		ПО КлючиМили.Ссылка = ЗаявкаТранспортныеСредства.КлючАналитикиПеревозки
	//|			И КлючиМили.ЭтапПеревозки = Значение(Перечисление.ЭтапыПеревозки.ПерваяМиля)
	////ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Конец
	//|ГДЕ
	//|	ЗаявкаТранспортныеСредства.Ссылка = &Заявка
	//|	И ЗаявкаТранспортныеСредства.ИдентификаторСтрокиЗапроса = &ИдентификаторСтроки
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	КлючиМили.ФИОВодителя КАК ФИОВодителя,
	//|	КлючиМили.РегНомерТС КАК РегНомерТС,
	//|	КлючиМили.ПаспортныеДанные КАК ПаспортныеДанные,
	//|	ЗаявкаТранспортныеСредстваПоследняяМиля.КлючАналитикиПеревозки КАК ИдентификаторСтроки,
	//|	КлючиМили.Автоперевозчик КАК Автоперевозчик,
	//|	КлючиМили.ИНН КАК ИНН,
	//|	КлючиМили.КПП КАК КПП,
	//|	КлючиМили.Ссылка.Контейнер КАК Контейнер
	//|ИЗ
	//|	Документ.Заявка.ТранспортныеСредстваПоследняяМиля КАК ЗаявкаТранспортныеСредстваПоследняяМиля 
	////ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
	//|   ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиМили
	//|		ПО КлючиМили.Ссылка = ЗаявкаТранспортныеСредстваПоследняяМиля.КлючАналитикиПеревозки
	//|			И КлючиМили.ЭтапПеревозки = Значение(Перечисление.ЭтапыПеревозки.ПоследняяМиля)
	////ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Конец
	//|ГДЕ
	//|	ЗаявкаТранспортныеСредстваПоследняяМиля.Ссылка = &Заявка
	//|	И ЗаявкаТранспортныеСредстваПоследняяМиля.ИдентификаторСтрокиЗапроса = &ИдентификаторСтроки";
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкаТранспортныеСредства.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки
	|ИЗ
	|	Документ.Заявка.ТранспортныеСредства КАК ЗаявкаТранспортныеСредства
	|ГДЕ
	|	ЗаявкаТранспортныеСредства.Ссылка = &Заявка
	|	И ЗаявкаТранспортныеСредства.ИдентификаторСтрокиЗапроса = &ИдентификаторСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкаТранспортныеСредстваПоследняяМиля.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки
	|ИЗ
	|	Документ.Заявка.ТранспортныеСредстваПоследняяМиля КАК ЗаявкаТранспортныеСредстваПоследняяМиля 
	|ГДЕ
	|	ЗаявкаТранспортныеСредстваПоследняяМиля.Ссылка = &Заявка
	|	И ЗаявкаТранспортныеСредстваПоследняяМиля.ИдентификаторСтрокиЗапроса = &ИдентификаторСтроки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	//Субботин 77659 18.12.2023 Начало
	|ВЫБРАТЬ
	|ЗаявкаСоставУслуги.НомерКТК КАК НомерКТК,
	|ЗаявкаСоставУслуги.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки
	|ИЗ
	|Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|ГДЕ
	|ЗаявкаСоставУслуги.Ссылка = &Заявка
	//Субботин 77659 18.12.2023 Конец 
	// ДИТ US 79950 ТА 79951 Сержантова А.С. Начало: 21.02.2024  
	|;
	|ВЫБРАТЬ
	|	ЗаявкаСоставУслуги.НомерКТК КАК НомерКТК,  
    //Евросиб Коханенко Н.А. 20.08.2024 (( #88606
	|	ЗаявкаСоставУслуги.ПеренесенВЗаявку КАК ПеренесенВЗаявку,
	//Евросиб Коханенко Н.А. 20.08.2024 )) #88606
	|	ЗаявкаСоставУслуги.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки
	|ИЗ
	|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|ГДЕ
	|	ЗаявкаСоставУслуги.Ссылка = &Заявка
	|	и ЗаявкаСоставУслуги.Релиз = &Релиз";
	// ДИТ US 79950 ТА 79951 Сержантова А.С. Конец: 21.02.2024
	
	//ДИТ Шевченко А.В. US 62421 ТА 70357 24.05.2023
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("Заявка", Объект.Заявка);
	Запрос.УстановитьПараметр("ИдентификаторСтроки", ИдентификаторСтрокиЗаявки); 
	// ДИТ US 79950 ТА 79951 Сержантова А.С. Начало: 21.02.2024
	Запрос.УстановитьПараметр("Релиз", Объект.Ссылка);
	// ДИТ US 79950 ТА 79951 Сержантова А.С. Конец: 21.02.2024
	
	РезультаЗапроса = Запрос.ВыполнитьПакет();
	
	// Евросиб Фролов (28.02.2022 Task №46354
	ПодсвечиваемыеПоляДоИзменения = Новый Структура;
	ПодсвечиваемыеПоляПослеИзменения = Новый Структура;
	ТаблицаШапки = РезультаЗапроса[0].Выгрузить();
	Для Каждого ТекКолонка Из ТаблицаШапки.Колонки Цикл
		ПодсвечиваемыеПоляДоИзменения.Вставить(ТекКолонка.Имя, Неопределено);
		ПодсвечиваемыеПоляПослеИзменения.Вставить(ТекКолонка.Имя, Неопределено)
	КонецЦикла;	
	// Евросиб Фролов)
	
	Шапка 							  = РезультаЗапроса[0];	
	ВыборкаШапка = Шапка.Выбрать();
	Если ВыборкаШапка.Следующий() Тогда
		
		ЛокацияВыдачиДоИзменения = Объект.ЛокацияВыдачи;
		// ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 13.12.2022
		СтанцияНазначенияПоЖДДоИзменения = Объект.СтанцияНазначенияПоЖД; 
		ДатаОтправленияПоЖДПланДоИзменения = Объект.ДатаОтправленияПоЖДПлан;		
		// ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 13.12.2022
		
		// Евросиб Фролов (28.02.2022 Task №46354
		ЗаполнитьЗначенияСвойств(ПодсвечиваемыеПоляДоИзменения, Объект);
		// Евросиб Фролов)
		
		ЗаполнитьЗначенияСвойств(Объект, ВыборкаШапка);
		
		// Евросиб Фролов (28.02.2022 Task №46354
		ЗаполнитьЗначенияСвойств(ПодсвечиваемыеПоляПослеИзменения, Объект);
		// Евросиб Фролов)
		
		// Если локация выдачи изменилась, то сток и терминал выдачи необходимо очистить.
		Если ЛокацияВыдачиДоИзменения <> Объект.ЛокацияВыдачи Тогда
			Объект.СтокВыдачи = Справочники.Локации.ПустаяСсылка();
			Объект.ТерминалВыдачи = Справочники.Локации.ПустаяСсылка();
		КонецЕсли;	
		// ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 13.12.2022
		Если СтанцияНазначенияПоЖДДоИзменения <> Объект.СтанцияНазначенияПоЖД Или ДатаОтправленияПоЖДПланДоИзменения <> Объект.ДатаОтправленияПоЖДПлан Тогда 
			Объект.ИзмененыКлючевыеПоля = Истина;
			Объект.СтатусОтправкиПолученияОтветаТерминала = Справочники.СибурСтатусыЗаявок.ВерсияОтправкиУстарела;
			Объект.ПисьмоНаЗапрос = Документы.ЭлектронноеПисьмоИсходящее.ПустаяСсылка();
		КонецЕсли;
		//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
		// ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 13.12.2022
		//Если Объект.Автоперевозка <> Перечисления.ВариантыАвтоперевозки.СиламиЕвросиб Тогда
		//	ПерезаполнитьТаблицуИзЗапроса("ТранспортныеСредства", ТранспортныеСредства, "ИдентификаторСтрокиТС");
		//КонецЕсли;
		//
		////ДИТ Шевченко А.В. TASK 51973 03.06.2022 -Начало
		//Если Объект.АвтоперевозкаПоследняяМиля <> Перечисления.ВариантыАвтоперевозки.СиламиЕвросиб Тогда
		//	ПерезаполнитьТаблицуИзЗапроса("ТранспортныеСредстваПоследняяМиля", ТранспортныеСредстваПоследняяМиля, "ИдентификаторСтрокиТСПоследняяМиля");
		//КонецЕсли;
		//ДИТ Шевченко А.В. TASK 51973 03.06.2022 -Конец
		//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Конец
		ИзмененыКлючевыеПоля(); //ДИТ Шевченко А.В. 51340 12.10.2022
		НастроитьТекстКнопкиПечати();
		
		ЗаполнитьДобавленныеКолонки("", Истина);
		
		Модифицированность = Истина;
		//Субботин 77659 18.12.2023 Начало
		МассивКтк = Новый Массив();
		МассивТЕ = СтрРазделить(ОбщегоНазначенияВызовСервера.ПривестиСтрокуУчетныхЕдиницКТребуемомуФормату(ВыборкаШапка.СписокКТК), ";", Ложь);
		Для Каждого ЭлемМассива Из МассивТЕ Цикл
			Если ТипЗнч(ЭлемМассива) = Тип("Строка") Тогда
				МассивКтк.Добавить(РаботаСКонтейнерамиСервер.НайтиКТК(ЭлемМассива)); 
			Иначе
				МассивКтк.Добавить(ЭлемМассива);
			КонецЕсли;
		КонецЦикла;	
		//Субботин 77659 18.12.2023 Конец	
	КонецЕсли;
	//Субботин 77659 18.12.2023 Начало
	Если НЕ МассивКтк.Количество() <> 0 Тогда
		
		//ДИТ Шевченко А.В. US 62421 ТА 70357 24.05.2023 -Начало
		ТранспортныеСредства 			  = РезультаЗапроса[1].Выгрузить();
		ТранспортныеСредстваПоследняяМиля = РезультаЗапроса[2].Выгрузить();
		
		МассивКлючейИтог = Новый Массив;
		Для Каждого Стр Из ТранспортныеСредства Цикл
			МассивКлючейИтог.Добавить(Стр.КлючАналитикиПеревозки);
		КонецЦикла;	
		Для Каждого Стр Из ТранспортныеСредстваПоследняяМиля Цикл
			МассивКлючейИтог.Добавить(Стр.КлючАналитикиПеревозки);
		КонецЦикла;
		ДокОб = РеквизитФормыВЗначение("Объект");
		МассивКлючей = ДокОб.ПолучитьКлючиИзЗапросаНаАвтоперевозку(Объект.Заявка,ИдентификаторСтрокиЗаявки);
		Для Каждого КлючМ Из МассивКлючей Цикл
			МассивКлючейИтог.Добавить(КлючМ);
		КонецЦикла;     
		// ДИТ US 79950 ТА 79951 Сержантова А.С. Начало: 16.02.2024 
		СоставУслугИзЗаявки = РезультаЗапроса[4].Выбрать();
		Пока СоставУслугИзЗаявки.Следующий() Цикл 
			//Евросиб Коханенко Н.А. 20.08.2024 (( #88606
			Если ЗначениеЗаполнено(СоставУслугИзЗаявки.ПеренесенВЗаявку) Тогда
				Продолжить;
			КонецЕсли;	
			//Евросиб Коханенко Н.А. 20.08.2024 )) #88606
			МассивКлючейИтог.Добавить(СоставУслугИзЗаявки.КлючАналитикиПеревозки);	
		КонецЦикла;   
		МассивКлючейИтог = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивКлючейИтог);
		// ДИТ US 79950 ТА 79951 Сержантова А.С. Конец: 16.02.2024

		Для Каждого КлючМ Из МассивКлючейИтог Цикл
			Если НЕ Объект.Контейнеры.НайтиСтроки(Новый Структура("КлючАналитикиПеревозки",КлючМ)).Количество() Тогда
				Если Объект.Контейнеры.Количество() < Объект.ОбщееКоличествоКТКВРелизе Тогда
					НовСтрока = Объект.Контейнеры.Добавить();
					НовСтрока.КлючАналитикиПеревозки = КлючМ;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;   
		
		//Евросиб Коханенко Н.А. 20.08.2024 (( #88606
		//если количество ктк в запросе ив ТЧ совпадает, то ничего не удаляем
		Если Объект.Контейнеры.Количество() <> Объект.ОбщееКоличествоКТКВРелизе Тогда  
		//Евросиб Коханенко Н.А. 20.08.2024 )) #88606 
		
		// ДИТ US 79950 ТА 79951 Сержантова А.С. Начало: 22.02.2024 - проверим есть ли в Контейнерах ключи, которых нет в МассивКлючейИтог 
		ИндексСтроки = Объект.Контейнеры.Количество() - 1;   
		Пока ИндексСтроки >= 0 Цикл
			КлючВСтроке = Объект.Контейнеры[ИндексСтроки].КлючАналитикиПеревозки; 
			
			Если МассивКлючейИтог.Найти(КлючВСтроке) = Неопределено Тогда 
				
				//Евросиб Коханенко Н.А. 21.08.2024 (( #88606
				//Объект.Контейнеры.Удалить(ИндексСтроки);
				//если ктк в ключе привязан к заявке (любой), то такую строку не удалять
				//если ктк удален из заявки (пусто и в ДобавленВЗаявку и в Заявке в ключе, то такую строку не удалять 
				ЗаявкаВКлюче = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КлючВСтроке, "Заявка");
				Если Не ЗначениеЗаполнено(ЗаявкаВКлюче) 
					И ЗначениеЗаполнено(Объект.Контейнеры[ИндексСтроки].ДобавленВЗаявку) Тогда 
					Объект.Контейнеры.Удалить(ИндексСтроки);
				КонецЕсли; 
				//Евросиб Коханенко Н.А. 21.08.2024 )) #88606
			КонецЕсли; 
			
			ИндексСтроки = ИндексСтроки - 1;
		КонецЦикла;
		// ДИТ US 79950 ТА 79951 Сержантова А.С. Конец: 22.02.2024 
		
		//Евросиб Коханенко Н.А. 20.08.2024 (( #88606
		КонецЕсли; 
		//Евросиб Коханенко Н.А. 20.08.2024 )) #88606 

		КолДобавляемыхСтрок = Объект.ОбщееКоличествоКТКВРелизе - МассивКлючейИтог.Количество();
		Для Инд = 1 По КолДобавляемыхСтрок Цикл  
			НовСтрока = Объект.Контейнеры.Добавить();
			СтруктураКлюча  = Справочники.КлючиАналитикиПеревозки.СтруктураКлючаАналитикиПеревозки(); 
			СтруктураКлюча.Вставить("Заявка",Объект.Заявка);
			СтрОтвет = Справочники.КлючиАналитикиПеревозки.НайтиСоздатьКлючАналитикиПеревозки(СтруктураКлюча);
			НовСтрока.КлючАналитикиПеревозки = СтрОтвет.КлючАналитикиПеревозки; 
		КонецЦикла;
		
		Если Объект.ОбщееКоличествоКТКВРелизе < Объект.Контейнеры.Количество() Тогда
			МассивКлючейП = Новый Массив;
			Для Каждого СтрокаТЧ Из Объект.Контейнеры Цикл
				МассивКлючейП.Добавить(СтрокаТЧ.КлючАналитикиПеревозки);
			КонецЦикла;	
			
			КлючиПустыхСтрок = ВернутьСтрокиСПустымиКлючами(МассивКлючейП);  
			// ДИТ US 79950 ТА 79951 Сержантова А.С. Начало: 21.02.2024 - сначала убираем ключи без контейнеров
			КлючиПустыхСтрокБезКонтейнеров = Новый Массив;
			Для каждого ПустойКлюч Из КлючиПустыхСтрок Цикл
				Если не ЗначениеЗаполнено(ПустойКлюч.Контейнер) Тогда
					КлючиПустыхСтрокБезКонтейнеров.Добавить(ПустойКлюч);
				КонецЕсли;
			КонецЦикла;
			// ДИТ US 79950 ТА 79951 Сержантова А.С. Конец: 21.02.2024
			МассивУдаляемыхСтрок = Новый Массив; 
			КолУдаляемых = Объект.Контейнеры.Количество() - Объект.ОбщееКоличествоКТКВРелизе;  
			
			// ДИТ US 79950 ТА 79951 Сержантова А.С. Начало: 21.02.2024   
			Для Каждого СтрокаТч Из Объект.Контейнеры Цикл
				Если КолУдаляемых = 0 Тогда
					Прервать;
				КонецЕсли;
				Если КлючиПустыхСтрокБезКонтейнеров.Найти(СтрокаТч.КлючАналитикиПеревозки) <> Неопределено Тогда
					МассивУдаляемыхСтрок.Добавить(СтрокаТч);
					КолУдаляемых = КолУдаляемых - 1;  
				КонецЕсли;
			КонецЦикла;
			// ДИТ US 79950 ТА 79951 Сержантова А.С. Конец: 21.02.2024
				
			Для Каждого СтрокаТч Из Объект.Контейнеры Цикл
				Если КолУдаляемых = 0 Тогда 
					// ДИТ US 79950 ТА 79951 Сержантова А.С. Начало: 21.02.2024
					// Было:
					//Продолжить; 
					//Стало:
					Прервать;
					// ДИТ US 79950 ТА 79951 Сержантова А.С. Конец: 21.02.2024
				КонецЕсли;	    
				Если КлючиПустыхСтрок.Найти(СтрокаТч.КлючАналитикиПеревозки) <> Неопределено   
				// ДИТ US 79950 ТА 79951 Сержантова А.С. Начало: 21.02.2024
				    и МассивУдаляемыхСтрок.Найти(СтрокаТч) = Неопределено Тогда
				// ДИТ US 79950 ТА 79951 Сержантова А.С. Конец: 21.02.2024
					МассивУдаляемыхСтрок.Добавить(СтрокаТч);
					КолУдаляемых = КолУдаляемых - 1;
				КонецЕсли;	
			КонецЦикла;	
			
			Для Каждого ЗнчМ Из МассивУдаляемыхСтрок Цикл
				Объект.Контейнеры.Удалить(ЗнчМ);
			КонецЦикла;	
			
		КонецЕсли;	
		//ДИТ Шевченко А.В. US 62421 ТА 70357 24.05.2023 -Конец
	//Субботин 77659 18.12.2023 	
	Иначе
		ТаблицаКлючейАналитики = РезультаЗапроса[3].Выгрузить();
		Для Каждого КТК из МассивКтк Цикл
			СтруктураПоиска = Новый Структура ("Контейнер", КТК);
			РезПоиска = Объект.Контейнеры.НайтиСтроки(СтруктураПоиска);
			Если РезПоиска.Количество() = 0 Тогда 
				НовСтрока = Объект.Контейнеры.Добавить();
				НайденныйКлюч = ТаблицаКлючейАналитики.Найти(КТК,"НомерКТК");
				Если НЕ НайденныйКлюч = Неопределено Тогда 
					НовСтрока.КлючАналитикиПеревозки = НайденныйКлюч.КлючАналитикиПеревозки;
				КонецЕсли; 
				НовСтрока.Контейнер = КТК;
				НовСтрока.ТипоразмерКТК = Объект.ТипоразмерКТК;
			КонецЕсли;
		КонецЦикла;
		МассивКТКОбъекта = Новый Массив;
		ТЧКонтейнеры = Объект.Контейнеры;
		Для Каждого СтрокаТЧ из ТЧКонтейнеры Цикл
			Если ЗначениеЗаполнено(СтрокаТЧ.Контейнер) Тогда
				МассивКТКОбъекта.Добавить(СтрокаТЧ.Контейнер);
			КонецЕсли;
		КонецЦикла;
		ЛишниеСтроки = ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивКТКОбъекта, МассивКтк);
		Для Каждого ЛишнийКТК Из ЛишниеСтроки Цикл
			СтруктураПоиска = Новый Структура ("Контейнер", ЛишнийКТК);
			НайденныеСтроки = ТЧКонтейнеры.НайтиСтроки(СтруктураПоиска);
			Для Каждого НайденнаяСтрока из НайденныеСтроки Цикл
				ТЧКонтейнеры.Удалить(НайденнаяСтрока);
			КонецЦикла;
		КонецЦикла;	
	КонецЕсли;
	//Субботин 77659 18.12.2023 Конец   
	
	НастроитьЗависимыеОтАвтоперевозкиЭлементы();
	
	// Евросиб Фролов (28.02.2022 Task №46354
	Для Каждого ТекПоле Из ПодсвечиваемыеПоляДоИзменения Цикл
		Если ТекПоле.Значение <> ПодсвечиваемыеПоляПослеИзменения[ТекПоле.Ключ] Тогда
			ЦветПодсветки = Новый Цвет(255, 0, 0);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ТекПоле.Ключ, "ЦветТекстаЗаголовка", ЦветПодсветки);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ТекПоле.Ключ, "ЦветТекста", ЦветПодсветки);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ТекПоле.Ключ, "ЦветРамки", ЦветПодсветки);
		КонецЕсли;	
	КонецЦикла;	
	// Евросиб Фролов)
	
	// Евросиб Фролов (14.03.2022 Ticket №0263596
	// Обновлять статус релиза при обновлении сведений из заявки
	ОпределитьСтатусРелиза();
	// Евросиб Фролов)
	//ДИТ Шевченко А.В. TASK 59945 06.10.2022 -конец
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьТаблицуИзЗапроса(ИмяТабличнойЧасти, ТаблицаЗапроса, ИмяРеквизитаСвязи)
	
	// Евросиб Фролов (28.02.2022 Task №46354
	ТаблицаДоИзменения = Объект[ИмяТабличнойЧасти].Выгрузить();	
	// Евросиб Фролов)
	
	УдаляемыеСтроки = Новый Массив;
	Для Каждого СтрокаТабличнойЧасти Из Объект[ИмяТабличнойЧасти] Цикл
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ИдентификаторСтроки) Тогда
			// строка добавлена вручную
			Продолжить;
		КонецЕсли;
		
		НайденнаяСтрокаЗапроса = ТаблицаЗапроса.Найти(СтрокаТабличнойЧасти.ИдентификаторСтроки, "ИдентификаторСтроки");
		Если НайденнаяСтрокаЗапроса <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, НайденнаяСтрокаЗапроса);
		Иначе
			// Если строка не привязана к КТК, то удаляем строку.
			НайденнаяСтрокаКТК = Объект.Контейнеры.НайтиСтроки(Новый Структура(ИмяРеквизитаСвязи, СтрокаТабличнойЧасти.ИдентификаторСтроки));
			Если НайденнаяСтрокаКТК.Количество() > 0 Тогда
				Для Каждого ТекущийКТК Из НайденнаяСтрокаКТК Цикл
					//ДИТ Шевченко А.В. TASK 51973 03.06.2022 -Начал
					ТекущийКТК[ИмяРеквизитаСвязи] = "";
					//ДИТ Шевченко А.В. TASK 51973 03.06.2022 -Конец
				КонецЦикла;	
			КонецЕсли;
			УдаляемыеСтроки.Добавить(СтрокаТабличнойЧасти.ИдентификаторСтроки);
			
			Если ИмяТабличнойЧасти = "ТранспортныеСредства" Тогда
				ОбщегоНазначения.СообщитьПользователю("Удалено транспортное средство первой мили: водитель - " + СтрокаТабличнойЧасти.ФИОВодителя + ", рег. № ТС " + СтрокаТабличнойЧасти.РегНомерТС + ", паспорт " + СтрокаТабличнойЧасти.ПаспортныеДанные);	
			ИначеЕсли ИмяТабличнойЧасти = "ТранспортныеСредстваПоследняяМиля" Тогда
				ОбщегоНазначения.СообщитьПользователю("Удалено транспортное средство последней мили: водитель - " + СтрокаТабличнойЧасти.ФИОВодителя + ", рег. № ТС " + СтрокаТабличнойЧасти.РегНомерТС + ", паспорт " + СтрокаТабличнойЧасти.ПаспортныеДанные);	
			КонецЕсли;
			// Евросиб Фролов) 

		КонецЕсли;	
		
	КонецЦикла;	
	
	// Удаляем строки
	Если УдаляемыеСтроки.Количество() > 0 Тогда
		Индекс = Объект[ИмяТабличнойЧасти].Количество() - 1;
		Пока Индекс >= 0 Цикл
			Если УдаляемыеСтроки.Найти(Объект[ИмяТабличнойЧасти][Индекс].ИдентификаторСтроки) <> Неопределено Тогда
				Объект[ИмяТабличнойЧасти].Удалить(Индекс);
			КонецЕсли;
			Индекс = Индекс - 1;
		КонецЦикла;
	КонецЕсли;
	
	// Добавляем новые строки
	Для Каждого СтрокаПолученнойТаблицы Из ТаблицаЗапроса Цикл
		НайденныеСтроки = Объект[ИмяТабличнойЧасти].НайтиСтроки(Новый Структура("ИдентификаторСтроки", СтрокаПолученнойТаблицы.ИдентификаторСтроки));
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = Объект[ИмяТабличнойЧасти].Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПолученнойТаблицы);
		КонецЕсли;	
	КонецЦикла;
	
	ПоляДляОформления = Новый Соответствие;
	КолонкиТабличнойЧасти = ТаблицаДоИзменения.Колонки;
	Для Каждого ТекСтрока Из Объект[ИмяТабличнойЧасти] Цикл
		
		СтрокаДоИзменений = ТаблицаДоИзменения.Найти(ТекСтрока.ИдентификаторСтроки, "ИдентификаторСтроки");
		
		Если СтрокаДоИзменений = Неопределено Тогда
			Продолжить;
		КонецЕсли;	
				
		Для Каждого ТекКолонка Из КолонкиТабличнойЧасти Цикл
			Если ТекКолонка.Имя = "НомерСтроки" Или ТекКолонка.Имя = "ИдентификаторСтроки" Или ТекКолонка.Имя = "ИсходныйНомерСтроки"Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТекСтрока[ТекКолонка.Имя] <> СтрокаДоИзменений[ТекКолонка.Имя] Тогда
				
				Поле = ПоляДляОформления.Получить(ТекКолонка.Имя);
				
				Если Поле = Неопределено Тогда
					СписокИдентификаторовСтрок = Новый СписокЗначений;
					СписокИдентификаторовСтрок.Добавить(ТекСтрока.ИдентификаторСтроки);
					ПоляДляОформления.Вставить(ТекКолонка.Имя, СписокИдентификаторовСтрок);
				Иначе
					Поле.Вставить(ТекСтрока.ИдентификаторСтроки);
				КонецЕсли;	
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого ТекПоле Из ПоляДляОформления Цикл
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ИмяТабличнойЧасти + ТекПоле.Ключ); 
		
		ОтборЭлемента = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТабличнойЧасти + ".ИдентификаторСтроки");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ОтборЭлемента.ПравоеЗначение = ТекПоле.Значение;
		
		ЦветПодсветки = Новый Цвет(250, 0, 0);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветПодсветки);
	КонецЦикла;
	// Евросиб Фролов)
	
КонецПроцедуры	

&НаСервере
Процедура ОпределитьИдентификаторРелиза()

	Если НЕ ЗначениеЗаполнено(Объект.Заявка) 
		//ДИТ Авдеева В.С. 0282363 18.08.2022 Начало 
		Или Не ЗначениеЗаполнено(Объект.Ссылка)
		//ДИТ Авдеева В.С. 0282363 18.08.2022 Конец
		Тогда
		Возврат;
	КонецЕсли;	
		
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РелизыКлиентовЗапросовНаКТК.ИдентификаторСтрокиЗаявки КАК ИдентификаторСтрокиЗаявки
	|ИЗ
	|	РегистрСведений.РелизыКлиентовЗапросовНаКТК КАК РелизыКлиентовЗапросовНаКТК
	|ГДЕ
	|	РелизыКлиентовЗапросовНаКТК.РелизКлиента = &РелизКлиента
	|	И РелизыКлиентовЗапросовНаКТК.Заявка = &Заявка";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("РелизКлиента", 	Объект.Ссылка);
	Запрос.УстановитьПараметр("Заявка", 		Объект.Заявка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ИдентификаторСтрокиЗаявки = Выборка.ИдентификаторСтрокиЗаявки;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура НастроитьТекстКнопкиПечати()
	
	ЗаголовокКнопки = "Запрос на терминал";
	
	Если Объект.ИзмененыКлючевыеПоля И ЗначениеЗаполнено(Объект.ДатаОтправкиЗапросаТерминалу) Тогда
		ЗаголовокКнопки = "Отправить скорректированный запрос на терминал";
	КонецЕсли;	
	
	Элементы.ФормаЗапросНаТерминал.Заголовок = ЗаголовокКнопки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОПерезаполненииПоЗапросу(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    ОбновитьДанныеИзЗапросаНаСервере();

КонецПроцедуры

//ДИТ, Беляев СЮ, Ticket#0330059, 30-10-2023, закомменитровал неиспользуемую процедуру ПроверитьУдаленныеДанныеВЗапросе()
//&НаСервере
//Процедура ПроверитьУдаленныеДанныеВЗапросе(ЕстьУдаленныеДанные)
//	
//	//ДИТ Шевченко А.В. TASK 59945 06.10.2022 -Начало
//	
//	//ДИТ Шевченко А.В. TASK 51973 03.06.2022 -Начало
//	Если Объект.Автоперевозка <> Перечисления.ВариантыАвтоперевозки.СиламиКлиента И Объект.АвтоперевозкаПоследняяМиля <> Перечисления.ВариантыАвтоперевозки.СиламиКлиента Тогда
//		Возврат;
//	КонецЕсли;	
//	//ДИТ Шевченко А.В. TASK 51973 03.06.2022 -Конец
//	
//	//ДИТ Шевченко А.В. TASK 51973 03.06.2022 -//Добавил в запрос получение данных по табличным частям относящимся к последней миле
//	
//	// Получим список КТК, по которым была выполнена связь с водителями или перевозчиками,
//	// и эти водители или перевозчики удалены из запроса на КТК
//	ТекстЗапроса =
//	"ВЫБРАТЬ
//	|	РелизКлиентаКонтейнеры.НомерСтроки КАК НомерСтроки,
//	|	РелизКлиентаКонтейнеры.Контейнер КАК Контейнер,
//	|	РелизКлиентаКонтейнеры.ИдентификаторСтрокиТС КАК ИдентификаторСтрокиТС
//	|ПОМЕСТИТЬ втКТК
//	|ИЗ
//	|	&Контейнеры КАК РелизКлиентаКонтейнеры
//	|ГДЕ
//	|	(РелизКлиентаКонтейнеры.ИдентификаторСтрокиТС <> """")
//	|;
//	|
//	|ВЫБРАТЬ
//	|	РелизКлиентаКонтейнеры.НомерСтроки КАК НомерСтроки,
//	|	РелизКлиентаКонтейнеры.Контейнер КАК Контейнер,
//	|	РелизКлиентаКонтейнеры.ИдентификаторСтрокиТСПоследняяМиля КАК ИдентификаторСтрокиТС	
//	|ПОМЕСТИТЬ втКТК_ПМ
//	|ИЗ
//	|	&Контейнеры КАК РелизКлиентаКонтейнеры
//	|ГДЕ
//	|	(РелизКлиентаКонтейнеры.ИдентификаторСтрокиТСПоследняяМиля <> """")
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ЗаявкаТранспортныеСредства.ИдентификаторСтроки КАК ИдентификаторСтроки
//	|ПОМЕСТИТЬ втТСЗаявки
//	|ИЗ
//	|	Документ.Заявка.ТранспортныеСредства КАК ЗаявкаТранспортныеСредства
//	|ГДЕ
//	|	ЗаявкаТранспортныеСредства.Ссылка = &Заявка
//	|	И ЗаявкаТранспортныеСредства.ИдентификаторСтрокиЗапроса = &ИдентификаторСтрокиЗапроса
//	|;
//	|
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ЗаявкаТранспортныеСредства.ИдентификаторСтроки КАК ИдентификаторСтроки
//	|ПОМЕСТИТЬ втТСЗаявкиПМ
//	|ИЗ
//	|	Документ.Заявка.ТранспортныеСредстваПоследняяМиля КАК ЗаявкаТранспортныеСредства
//	|ГДЕ
//	|	ЗаявкаТранспортныеСредства.Ссылка = &Заявка
//	|	И ЗаявкаТранспортныеСредства.ИдентификаторСтрокиЗапроса = &ИдентификаторСтрокиЗапроса
//	|;
//	|
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	втКТК.НомерСтроки КАК НомерСтроки,
//	|	втКТК.Контейнер КАК Контейнер
//	|ИЗ
//	|	втКТК КАК втКТК
//	|		ЛЕВОЕ СОЕДИНЕНИЕ втТСЗаявки КАК втТСЗаявки
//	|		ПО втКТК.ИдентификаторСтрокиТС = втТСЗаявки.ИдентификаторСтроки
//	|ГДЕ
//	|	втКТК.ИдентификаторСтрокиТС <> """"
//	|	И втТСЗаявки.ИдентификаторСтроки ЕСТЬ NULL
//	|;
//	|
//	|
//	|ВЫБРАТЬ
//	|	втКТК_ПМ.НомерСтроки КАК НомерСтроки,
//	|	втКТК_ПМ.Контейнер КАК Контейнер
//	|ИЗ
//	|	втКТК_ПМ КАК втКТК_ПМ
//	|		ЛЕВОЕ СОЕДИНЕНИЕ втТСЗаявкиПМ КАК втТСЗаявкиПМ
//	|		ПО втКТК_ПМ.ИдентификаторСтрокиТС = втТСЗаявкиПМ.ИдентификаторСтроки
//	|ГДЕ
//	|	втКТК_ПМ.ИдентификаторСтрокиТС <> """"
//	|	И втТСЗаявкиПМ.ИдентификаторСтроки ЕСТЬ NULL";
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = ТекстЗапроса;
//	
//	Запрос.УстановитьПараметр("Контейнеры", Объект.Контейнеры.Выгрузить());
//	Запрос.УстановитьПараметр("Заявка", Объект.Заявка);
//	Запрос.УстановитьПараметр("ИдентификаторСтрокиЗапроса", ИдентификаторСтрокиЗаявки);
//	
//	РезультаЗапроса = Запрос.ВыполнитьПакет();
//	
//	ТаблицаПоВодителям 					= РезультаЗапроса[4].Выгрузить();
//	ТаблицаПоВодителямПоследняяМиля 	= РезультаЗапроса[5].Выгрузить();
//	
//	Для Каждого ТекущаяСтрока Из ТаблицаПоВодителям Цикл
//		ТекстСообщения = СтрШаблон("Для контейнера %1 будет удалена связь с водителем на первой мили.", ТекущаяСтрока.Контейнер);
//		ОбщегоНазначения.СообщитьПользователю(
//						ТекстСообщения,
//						,
//						ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Контейнеры", ТекущаяСтрока.НомерСтроки, "Контейнер"),
//						"Объект");
//		ЕстьУдаленныеДанные = Истина;			
//	КонецЦикла;	
//		
//	Для Каждого ТекущаяСтрока Из ТаблицаПоВодителямПоследняяМиля Цикл
//		ТекстСообщения = СтрШаблон("Для контейнера %1 будет удалена связь с водителем на последней мили.", ТекущаяСтрока.Контейнер);
//		ОбщегоНазначения.СообщитьПользователю(
//						ТекстСообщения,
//						,
//						ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Контейнеры", ТекущаяСтрока.НомерСтроки, "Контейнер"),
//						"Объект");
//		ЕстьУдаленныеДанные = Истина;			
//	КонецЦикла;	
//	
//    //ДИТ Шевченко А.В. TASK 59945 06.10.2022 -конец
//КонецПроцедуры

&НаКлиенте
Функция РазрешеноДобавлятьВодителей(ДоступноеКоличество = Неопределено)
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
	//Если Объект.Автоперевозка = ПредопределенноеЗначение("Перечисление.ВариантыАвтоперевозки.СиламиКлиента") Тогда
	//	ПоказатьПредупреждение(, "Запрещено добавлять сведения если
	//							|автоперевозка осущестляется силами клиента");
	//	Возврат Ложь;
	//КонецЕсли;
	//
	//Если ДоступноеКоличество = Неопределено Тогда
	//	ДоступноеКоличество = Объект.ОбщееКоличествоКТКВРелизе - Объект.ТранспортныеСредства.Количество();
	//КонецЕсли;	

	//Если ДоступноеКоличество <= 0 Тогда
	//	ПоказатьПредупреждение(, "В документе уже заполнено макимально возмозможное количество водителей.");
	//	Возврат Ложь;
	//КонецЕсли;

	//Возврат Истина;
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Конец
КонецФункции

&НаСервере
Процедура НастроитьВидимостьПодстокаВыдачи()
	
	// Евросиб Фролов (28.03.2022 Task №49126
	//Элементы.ПодстокВыдачи.Видимость = Ложь;
	Элементы.ПодстокиВыдачи.Видимость = Ложь;
	// Евросиб Фролов)
	
	Если Не ЗначениеЗаполнено(Объект.СтокВыдачи)
		ИЛИ Объект.ВыдачаОтСобственника Тогда
		Возврат;
	КонецЕсли;
	
	СобственныйСток = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СтокВыдачи, "СобственныйСток");
	
	Если СобственныйСток = Истина Тогда
		// Евросиб Фролов (28.03.2022 Task №49126
		//Элементы.ПодстокВыдачи.Видимость = Истина;
		Элементы.ПодстокиВыдачи.Видимость = Истина;
		// Евросиб Фролов)
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьПодстокаСдачи()
	
	// Евросиб Фролов (28.03.2022 Task №49126
	//Элементы.ПодстокСдачи.Видимость = Ложь;
	Элементы.ПодстокиСдачи.Видимость = Ложь;
	// Евросиб Фролов)
	
	Если Не ЗначениеЗаполнено(Объект.СтокСдачи) Тогда
		Возврат;
	КонецЕсли;
	
	// Евросиб Фролов (16.02.2022 Task №46605
	// Подсток сдачи отображаем в случае, если в составе мультилокации есть собственный сток.
	//ДИТ Шевченко А.В. 63318 19.01.2023 - начало
	Если ТипЗнч(Объект.СтокСдачи) = Тип("СправочникСсылка.Мультилокации") Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	МультилокацииЛокации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Мультилокации.Локации КАК МультилокацииЛокации
		|ГДЕ
		|	МультилокацииЛокации.Ссылка = &СтокСдачи
		|	И МультилокацииЛокации.Локация.СобственныйСток";
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("СтокСдачи", Объект.СтокСдачи);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			// Евросиб Фролов (28.03.2022 Task №49126
			//Элементы.ПодстокСдачи.Видимость = Истина;
			Элементы.ПодстокиСдачи.Видимость = Истина;
			// Евросиб Фролов)
		КонецЕсли;
	ИначеЕсли ТипЗнч(Объект.СтокСдачи) = Тип("СправочникСсылка.Локации") Тогда
		Элементы.ПодстокиСдачи.Видимость = Объект.СтокСдачи.СобственныйСток;
	КонецЕсли;
	//ДИТ Шевченко А.В. 63318 19.01.2023 - конец
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоставМультилокации(Мультилокация)
	// Евросиб Фролов (16.02.2022 Task №46605
	Возврат Справочники.Мультилокации.СоставМультилокации(Мультилокация);
	// Евросиб Фролов)
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТерминалыСтоковСдачи(Мультилокация)
	// Евросиб Фролов (28.03.2022 Task №49126
	//ДИТ Шевченко А.В. 63318 19.01.2023 - начало
	Если ТипЗнч(Мультилокация) = Тип("СправочникСсылка.Мультилокации") Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МультилокацииЛокации.Локация.Родитель КАК Терминал
		|ИЗ
		|	Справочник.Мультилокации.Локации КАК МультилокацииЛокации
		|ГДЕ
		|	МультилокацииЛокации.Ссылка = &Мультилокация
		|	И МультилокацииЛокации.Локация.Родитель.Тип = &ТипТерминал";
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Мультилокация", Мультилокация);
		Запрос.УстановитьПараметр("ТипТерминал", Справочники.ТипыЛокаций.Терминал);
		
		Результат = Запрос.Выполнить();
		
		МассивТерминалов = Результат.Выгрузить().ВыгрузитьКолонку("Терминал");
		
		СписокТерминалов = Новый СписокЗначений;
		СписокТерминалов.ЗагрузитьЗначения(МассивТерминалов);
		Возврат СписокТерминалов;
	ИначеЕсли ТипЗнч(Мультилокация) = Тип("СправочникСсылка.Локации") Тогда
		Если Мультилокация.Родитель.Тип = Справочники.ТипыЛокаций.Терминал Тогда
			СписокТерминалов = Новый СписокЗначений;
			СписокТерминалов.Добавить(Мультилокация.Родитель);
			Возврат СписокТерминалов;
		КонецЕсли;	
	КонецЕсли;
	Возврат СписокТерминалов;
	// Евросиб Фролов)
КонецФункции

&НаКлиенте
Функция ИзменениеВидаРелизаВозможно()
	// Евросиб Фролов (28.03.2022 Task №49126
	// Запретить смену состояния галок "Выдача от собственника" и "Номерная выдача" при наличии в табличной части
	// релиза клиента хотя бы одной строки с заполненным значением в поле "Дата вывоза".
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 –начало
	МассивКлючей = Новый Массив;
	Для Каждого СтрокаТЧ Из Объект.Контейнеры Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.КлючАналитикиПеревозки) Тогда
			МассивКлючей.Добавить(СтрокаТЧ.КлючАналитикиПеревозки);
		КонецЕсли;
	КонецЦикла;	
	
	КоличествоСтрокБезДат = ПолучитьКоличествоСтрокСЗаполненойДатойВывоза(МассивКлючей);
	//ПараметрыПоиска = Новый Структура;
	//ПараметрыПоиска.Вставить("ДатаВывоза", Дата(1, 1, 1));
	//СтрокиБезДаты = Объект.Контейнеры.НайтиСтроки(ПараметрыПоиска);
	//Если СтрокиБезДаты.Количество() <> Объект.Контейнеры.Количество() Тогда
	Если КоличествоСтрокБезДат <> Объект.Контейнеры.Количество() Тогда
		ПоказатьПредупреждение(, "В списке контейнеров есть строки с заполненной датой вывоза. Изменение галок ""Выдача от собственника"" и ""Номерная выдача"" запрещено.");
		Возврат Ложь;
	КонецЕсли;
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 –конец
	Возврат Истина;
	// Евросиб Фролов)
КонецФункции	

&НаСервереБезКонтекста
Функция ПолучитьКоличествоСтрокСЗаполненойДатойВывоза(МассивКлючей)
		
	Возврат Документы.РелизКлиента.ПолучитьКоличествоСтрокСЗаполненойДатойВывоза(МассивКлючей);
	
КонецФункции	

//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, начало
&НаКлиенте
Процедура МакетРК(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ ЭтаФорма.Модифицированность ИЛИ НЕ Объект.Проведен Тогда
		
		Сообщить("Перед печатью нужно провести релиз клиента!");
		Возврат;
		
	КонецЕсли;
	//ДИТ Шевченко А.В. US 62482 ТА 68277 17.04.2023 -Начало
	//СтрокиБезКонтейнера = Объект.Контейнеры.НайтиСтроки(Новый Структура("Контейнер", ПредопределенноеЗначение("Справочник.ТЕ.ПустаяСсылка")));
	//Если СтрокиБезКонтейнера.Количество() > 0 Тогда
	//	ПоказатьПредупреждение(, "Не заполнены обязательные поля для отправки формы запроса на релиз КТК: ""Контейнер"" в списке контейнеров.");
	//	Возврат;
	//КонецЕсли;	
	//ДИТ Шевченко А.В. US 62482 ТА 68277 17.04.2023 -Конец
	ОписаниеКоманды_Идентификатор = "ЗапросНаТерминал";
	
	ОписаниеКоманды_ОбъектыПечати = Новый Массив;
	ОписаниеКоманды_ОбъектыПечати.Добавить(Объект.Ссылка);
	
	ДополнительныеПараметрыПечати = Новый Структура;
	ДополнительныеПараметрыПечати.Вставить("ДатаПечати", ТекущаяДата());
	ДополнительныеПараметрыПечати.Вставить("БлокироватьОтправкуПоПочте", Истина);
	//ДИТ Шевченко А.В. US 62479 ТА 59963 24.04.2023 -Начало
	ДополнительныеПараметрыПечати.Вставить("ПечатьДляПисьма", Ложь);
	//ДИТ Шевченко А.В. US 62479 ТА 59963 24.04.2023 -Конец
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.РелизКлиента", ОписаниеКоманды_Идентификатор, ОписаниеКоманды_ОбъектыПечати,
		ЭтаФорма, ДополнительныеПараметрыПечати);
		
	ЭтаФорма.Прочитать(); //ДИТ Шевченко А.В. US 62479 ТА 59963 24.04.2023	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЛокациюВыдачиИзЗапросаНаСервере()
	// Евросиб Фролов (30.05.2022 Task №49741
	
	Если ЗначениеЗаполнено(Объект.РелизСобственника) Тогда
		Объект.СобственникКТК = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РелизСобственника, "Контрагент");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИдентификаторСтрокиЗаявки)
		ИЛИ Не ЗначениеЗаполнено(Объект.Заявка) Тогда
		Возврат;
	КонецЕсли;

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗаявкаСписокЗапросНаКТК.ЛокацияВыдачи КАК ЛокацияВыдачи
	|ИЗ
	|	Документ.Заявка.СписокЗапросНаКТК КАК ЗаявкаСписокЗапросНаКТК
	|ГДЕ
	|	ЗаявкаСписокЗапросНаКТК.Ссылка = &Заявка
	|	И ЗаявкаСписокЗапросНаКТК.ИдентификаторСтроки = &ИдентификаторСтроки";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("Заявка", Объект.Заявка);
	Запрос.УстановитьПараметр("ИдентификаторСтроки", ИдентификаторСтрокиЗаявки);
	
	РезультаЗапроса = Запрос.Выполнить();
		
	ВыборкаШапка = РезультаЗапроса.Выбрать();
	Если ВыборкаШапка.Следующий() Тогда
		
		ЛокацияВыдачиДоИзменения = Объект.ЛокацияВыдачи;
		Объект.ЛокацияВыдачи = ВыборкаШапка.ЛокацияВыдачи;
		
		// Если локация выдачи изменилась, то сток и терминал выдачи необходимо очистить.
		Если ЛокацияВыдачиДоИзменения <> Объект.ЛокацияВыдачи Тогда
			Объект.СтокВыдачи = Справочники.Локации.ПустаяСсылка();
			Объект.ТерминалВыдачи = Справочники.Локации.ПустаяСсылка();
			
			ЦветПодсветки = Новый Цвет(255, 0, 0);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЛокацияВыдачи", "ЦветТекстаЗаголовка", ЦветПодсветки);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЛокацияВыдачи", "ЦветТекста", ЦветПодсветки);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЛокацияВыдачи", "ЦветРамки", ЦветПодсветки);
			
			ИзмененыКлючевыеПоля(); //ДИТ Шевченко А.В. 51340 12.10.2022
			НастроитьТекстКнопкиПечати();
		КонецЕсли;	
		
	КонецЕсли;

	// Евросиб Фролов)
КонецПроцедуры
//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, конец

// ++ ДИТ_Агафонов_task 56709 11.09.2022
&НаСервере
Процедура УдалитьСтрокиИзРелизаСобственника()
	Запрос = Новый Запрос;
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -начало
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	ВЫРАЗИТЬ(РелизКлиентаКонтейнеры.Контейнер КАК СПравочник.ТЕ)  КАК Контейнер,
	//               |	РелизКлиентаКонтейнеры.НомерСтроки КАК НомерСтроки
	//               |ПОМЕСТИТЬ ТаблицаКТК
	//               |ИЗ
	//               |	&РелизКлиентаКонтейнеры КАК РелизКлиентаКонтейнеры
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ТаблицаКТК.НомерСтроки КАК НомерСтроки,
	//               |	ТаблицаКТК.Контейнер КАК Контейнер
	//               |ИЗ
	//               |	ТаблицаКТК КАК ТаблицаКТК
	//			   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
	//               |		ПО ТаблицаКТК.Контейнер = РелизСобственникаНоминации.Контейнер
	//			   |			И РелизСобственникаНоминации.Ссылка = &РелизСобственника
	//			   |			И РелизСобственникаНоминации.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	НомерСтроки УБЫВ";
	//ДИТ, Беляев СЮ, Ticket#0330059, 30-10-2023, начало
	Запрос.Текст = "ВЫБРАТЬ
	               |	РелизКлиентаКонтейнеры.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
	               |	РелизКлиентаКонтейнеры.НомерСтроки КАК НомерСтроки
	               |ПОМЕСТИТЬ ТаблицаКТК
	               |ИЗ
	               |	&РелизКлиентаКонтейнеры КАК РелизКлиентаКонтейнеры
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаКТК.НомерСтроки КАК НомерСтроки,
	               |	КлючиАналитикиПеревозки.Контейнер КАК Контейнер
	               |ИЗ
	               |	ТаблицаКТК КАК ТаблицаКТК
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
	               |		ПО (КлючиАналитикиПеревозки.Ссылка = ТаблицаКТК.КлючАналитикиПеревозки)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
	               |		ПО (КлючиАналитикиПеревозки.Контейнер = РелизСобственникаНоминации.Контейнер)
	               |			И (РелизСобственникаНоминации.Ссылка = &РелизСобственника)
	               |			И (РелизСобственникаНоминации.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка))
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки УБЫВ";
	//ДИТ, Беляев СЮ, Ticket#0330059, 30-10-2023, конец
	
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -начало
	//Запрос.УстановитьПараметр("РелизКлиентаКонтейнеры", Объект.Контейнеры.Выгрузить(,"Контейнер,НомерСтроки"));
	Запрос.УстановитьПараметр("РелизКлиентаКонтейнеры", Объект.Контейнеры.Выгрузить(,"КлючАналитикиПеревозки,НомерСтроки"));
	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 -конец
	Запрос.УстановитьПараметр("РелизСобственника", Объект.РелизСобственника);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Объект.Контейнеры.Удалить(Выборка.НомерСтроки-1);	
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьСтрокиКлючейНаМиле(МассивКлючейП,ЭтапПеревозки,МассивПроверяемыхКолонок) //ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КлючиАналитикиПеревозкиМили.Ссылка КАК КлючАналитикиПеревозки,
	               |	КлючиАналитикиПеревозкиМили.ФИОВодителя КАК ФИОВодителя,
	               |	КлючиАналитикиПеревозкиМили.РегНомерТС КАК РегНомерТС,
	               |	КлючиАналитикиПеревозкиМили.Автоперевозчик КАК Автоперевозчик,
	               |	КлючиАналитикиПеревозкиМили.ИНН КАК ИНН,
	               |	КлючиАналитикиПеревозкиМили.Ссылка.Контейнер КАК Контейнер
	               |ИЗ
	               |	Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
	               |ГДЕ
	               |	КлючиАналитикиПеревозкиМили.Ссылка В(&МассивКлючей)
	               |	И (КлючиАналитикиПеревозкиМили.Ссылка.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	               |			ИЛИ КлючиАналитикиПеревозкиМили.ФИОВодителя <> """"
	               |			ИЛИ (КлючиАналитикиПеревозкиМили.Автоперевозчик <> """"
	               |				И КлючиАналитикиПеревозкиМили.Автоперевозчик <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) И КлючиАналитикиПеревозкиМили.Автоперевозчик <> Неопределено))
	               |	И КлючиАналитикиПеревозкиМили.ЭтапПеревозки = &ЭтапПеревозки";

	Запрос.УстановитьПараметр("ЭтапПеревозки",ЭтапПеревозки);
	Запрос.УстановитьПараметр("МассивКлючей",МассивКлючейП);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	МассивКлючей = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		ДобавитьКлюч = Истина;
		Для Каждого ЗнчМассив Из МассивПроверяемыхКолонок Цикл
			Если НЕ ЗначениеЗаполнено(Выборка[ЗнчМассив]) Тогда
				ДобавитьКлюч = Ложь;
				Продолжить;
			КонецЕсли;	
		КонецЦикла;
		Если ДобавитьКлюч Тогда
			МассивКлючей.Добавить(Выборка.КлючАналитикиПеревозки);
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат МассивКлючей;
	
КонецФункции

&НаСервереБезКонтекста
Функция ВернутьСтрокиСПустымиКлючами(МассивКлючейП) //ДИТ Шевченко А.В. US 62421 ТА 70357 24.05.2023	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КлючиАналитикиПеревозки.Ссылка КАК КлючАналитикиПеревозки,
	               |	1 КАК Признак
	               |ПОМЕСТИТЬ ВТ_Итог
	               |ИЗ
	               |	Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
	               |		ПО КлючиАналитикиПеревозки.Ссылка = КлючиАналитикиПеревозкиМили.Ссылка
	               |			И (КлючиАналитикиПеревозкиМили.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.ПерваяМиля))
	               |ГДЕ
	               |	КлючиАналитикиПеревозки.Ссылка В(&МассивКлючей)  
				   // ДИТ US 79950 ТА 79951 Сержантова А.С. Начало: 21.02.2024
				   // Было:
				   //|	И КлючиАналитикиПеревозки.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
				   //|	И ЕСТЬNULL(КлючиАналитикиПеревозкиМили.ФИОВодителя, """") = """"
				   //|	И ЕСТЬNULL(КлючиАналитикиПеревозкиМили.РегНомерТС, """") = """"
				   //|	И ЕСТЬNULL(КлючиАналитикиПеревозкиМили.ПаспортныеДанные, """") = """"
				   //|	И (ЕСТЬNULL(КлючиАналитикиПеревозкиМили.АдресКлиента, """") = """"
				   //|			ИЛИ ЕСТЬNULL(КлючиАналитикиПеревозкиМили.АдресКлиента, """") = ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка))
				   //|	И ЕСТЬNULL(КлючиАналитикиПеревозкиМили.ДатаВыдачиКТКСТерминала, &ПустаяДата) = &ПустаяДата
				   //|	И ЕСТЬNULL(КлючиАналитикиПеревозкиМили.ДатаСдачиКТКНаТерминал, &ПустаяДата) = &ПустаяДата
				   //|	И ЕСТЬNULL(КлючиАналитикиПеревозкиМили.ДатаВыездаКТКСоСклада, &ПустаяДата) = &ПустаяДата
				   //|	И ЕСТЬNULL(КлючиАналитикиПеревозкиМили.ИНН, """") = """"
				   //|	И ЕСТЬNULL(КлючиАналитикиПеревозкиМили.КПП, """") = """"
				   //|	И (ЕСТЬNULL(КлючиАналитикиПеревозкиМили.Автоперевозчик, """") = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|			ИЛИ ЕСТЬNULL(КлючиАналитикиПеревозкиМили.Автоперевозчик, """") = """"
				   //|			ИЛИ ЕСТЬNULL(КлючиАналитикиПеревозкиМили.Автоперевозчик, """") = НЕОПРЕДЕЛЕНО)
				   //|	И ЕСТЬNULL(КлючиАналитикиПеревозки.ИнструкцияПоСдаче, """") = """"  
				   //Стало:
				   |	И (КлючиАналитикиПеревозки.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
				   |	ИЛИ ЕСТЬNULL(КлючиАналитикиПеревозкиМили.ДатаВыдачиКТКСТерминала, &ПустаяДата) = &ПустаяДата)
				   // ДИТ US 79950 ТА 79951 Сержантова А.С. Конец: 21.02.2024
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КлючиАналитикиПеревозки.Ссылка,
	               |	1
	               |ИЗ
	               |	Справочник.КлючиАналитикиПеревозки КАК КлючиАналитикиПеревозки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
	               |		ПО КлючиАналитикиПеревозки.Ссылка = КлючиАналитикиПеревозкиМили.Ссылка
	               |			И (КлючиАналитикиПеревозкиМили.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.ПоследняяМиля))
	               |ГДЕ
	               |	КлючиАналитикиПеревозки.Ссылка В(&МассивКлючей)
				   // ДИТ US 79950 ТА 79951 Сержантова А.С. Начало: 21.02.2024
				   // Было: 
				   //|	И КлючиАналитикиПеревозки.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
				   //|	И ЕСТЬNULL(КлючиАналитикиПеревозкиМили.ФИОВодителя, """") = """"
				   //|	И ЕСТЬNULL(КлючиАналитикиПеревозкиМили.РегНомерТС, """") = """"
				   //|	И ЕСТЬNULL(КлючиАналитикиПеревозкиМили.ПаспортныеДанные, """") = """"
				   //|	И (ЕСТЬNULL(КлючиАналитикиПеревозкиМили.АдресКлиента, """") = """"
				   //|			ИЛИ ЕСТЬNULL(КлючиАналитикиПеревозкиМили.АдресКлиента, """") = ЗНАЧЕНИЕ(Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка))
				   //|	И ЕСТЬNULL(КлючиАналитикиПеревозкиМили.ДатаВыдачиКТКСТерминала, &ПустаяДата) = &ПустаяДата
				   //|	И ЕСТЬNULL(КлючиАналитикиПеревозкиМили.ДатаСдачиКТКНаТерминал, &ПустаяДата) = &ПустаяДата
				   //|	И ЕСТЬNULL(КлючиАналитикиПеревозкиМили.ДатаВыездаКТКСоСклада, &ПустаяДата) = &ПустаяДата
				   //|	И ЕСТЬNULL(КлючиАналитикиПеревозкиМили.ИНН, """") = """"
				   //|	И ЕСТЬNULL(КлючиАналитикиПеревозкиМили.КПП, """") = """"
				   //|	И (ЕСТЬNULL(КлючиАналитикиПеревозкиМили.Автоперевозчик, """") = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
				   //|			ИЛИ ЕСТЬNULL(КлючиАналитикиПеревозкиМили.Автоперевозчик, """") = """"
				   //|			ИЛИ ЕСТЬNULL(КлючиАналитикиПеревозкиМили.Автоперевозчик, """") = НЕОПРЕДЕЛЕНО)
				   //|	И ЕСТЬNULL(КлючиАналитикиПеревозки.ИнструкцияПоСдаче, """") = """" 
				   //Стало:
				   |	И (КлючиАналитикиПеревозки.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка) 
				   |	ИЛИ ЕСТЬNULL(КлючиАналитикиПеревозкиМили.ДатаВыдачиКТКСТерминала, &ПустаяДата) = &ПустаяДата)
				   // ДИТ US 79950 ТА 79951 Сержантова А.С. Конец: 21.02.2024
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Итог.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
	               |	СУММА(ВТ_Итог.Признак) КАК Признак
	               |ИЗ
	               |	ВТ_Итог КАК ВТ_Итог
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Итог.КлючАналитикиПеревозки
	               |
	               |ИМЕЮЩИЕ     
				   |	СУММА(ВТ_Итог.Признак) = 2"; 

	Запрос.УстановитьПараметр("МассивКлючей",МассивКлючейП);
	Запрос.УстановитьПараметр("ПустаяДата",Дата(1,1,1));
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	МассивКлючей = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивКлючей.Добавить(Выборка.КлючАналитикиПеревозки);	
	КонецЦикла;	
	
	Возврат МассивКлючей;
	
КонецФункции

// -- ДИТ_Агафонов_task 56709 11.09.2022
#КонецОбласти

#Область ФормированиеXML   
 //ДИТ, Беляев СЮ, ТА49361, 30-03-2022, начало
&НаСервере
Функция ПривестиДатуКФормату(вхДата)
	Возврат Формат(вхДата,"ДФ=гггг-ММ-ддTЧЧ:мм:сс");	
КонецФункции 
//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, конец

//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, начало
&НаСервереБезКонтекста
Процедура ДобавитьТегПриНаличииЗначения(Запись, ИмяТега, ЗначениеТега)
	Если ЗначениеЗаполнено(ЗначениеТега) Тогда
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, ИмяТега, Строка(ЗначениеТега)); 	
	КонецЕсли; 		
КонецПроцедуры
//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, конец

//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, начало
&НаСервере
Функция ВыгрузитьВXMLНаСервере(ЭтоУдаление)
    ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml"); // получаем имя временного файла на сервере
	
	ЗначениеМодификацииДокумента = "Original";
	Если Объект.ЗапросОтправленТерминалу И ЗначениеЗаполнено(Объект.ДатаОтправкиЗапросаТерминалу) Тогда
		ЗначениеМодификацииДокумента = "Update";
	КонецЕсли;	             
	
	Если ЭтоУдаление Тогда
		ЗначениеМодификацииДокумента = "Delete";
	КонецЕсли;	
	
	ОтправительПочтовогоСообщения = ПараметрыСеанса.ТекущийПользователь;
	
	ПочтаОтправителяПочтовогоСообщения = "";
	КонтактнаяИнформация = ПараметрыСеанса.ТекущийПользователь.КонтактнаяИнформация.Найти(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, "Тип");
	Если КонтактнаяИнформация <> Неопределено Тогда
		 ПочтаОтправителяПочтовогоСообщения = КонтактнаяИнформация.Представление;
	КонецЕсли;
	
	Запись = Новый ЗаписьXML;
	
	Запись.ОткрытьФайл(ИмяВременногоФайла, "windows-1251");    
	Запись.ЗаписатьОбъявлениеXML();
    Запись.ЗаписатьНачалоЭлемента("MultiRelease");
	
	//ШАПКА
	Запись.ЗаписатьНачалоЭлемента("DocHead");  
	ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "CustomerCompany", Строка(Объект.Организация));   
	ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "DocNumber", Строка(Объект.НомерРелиза));
	ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "DocDate", ПривестиДатуКФормату(Объект.Дата));
	ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "Modification", Строка(ЗначениеМодификацииДокумента));
	ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ActionType", Строка("Release"));
	ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "CustomerName", Строка(ОтправительПочтовогоСообщения));
	ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "CustomerEmail", Строка(ПочтаОтправителяПочтовогоСообщения));
	ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "Comments", Строка(Объект.Комментарий));
	ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "StartDate", ПривестиДатуКФормату(НачалоДня(Объект.ДействиеРелизаНачало)));
	ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ExpireDate", ПривестиДатуКФормату(КонецДня(Объект.ДействиеРелизаОкончание)));				
	Запись.ЗаписатьКонецЭлемента(); //DocHead

	//ТЕРМИНАЛЫ       
	МассивПодстоков = Объект.ПодстокиВыдачи.Выгрузить().ВыгрузитьКолонку("НаименованиеПодстока");
	СтрокаПодстоков = СтрСоединить(МассивПодстоков,";");
	Запись.ЗаписатьНачалоЭлемента("Terminal");  
	ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "LocationName", Строка(Объект.ЛокацияВыдачи.Наименование)); 
	ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "LocationCode", Строка(Объект.ЛокацияВыдачи.Код));
	//Евросиб Коханенко Н.А. 18.07.2023 (( #72668
	//лишние слова, типа: (станция), (сток) - не отправляем
	//ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "TerminalName", Строка(Объект.ТерминалВыдачи));
	ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "TerminalName", Строка(Объект.ТерминалВыдачи.Наименование));
	//Евросиб Коханенко Н.А. 18.07.2023 )) #72668 
	ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "TerminalCode", Строка(Объект.ТерминалВыдачи.Код));
	ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "StockName", Строка(Объект.СтокВыдачи));
	ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "StockCode", Строка(Объект.СтокВыдачи.Код));
	ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "SubStockName", Строка(СтрокаПодстоков));
	Запись.ЗаписатьКонецЭлемента(); //Terminal
	
	//КОНТЕЙНЕРЫ     
	СостояниеКТК = 0;
	Если Объект.СостояниеКТК = Перечисления.СостоянияКТК.Груженый Тогда
		СостояниеКТК = 1;
	КонецЕсли;
	Запись.ЗаписатьНачалоЭлемента("Containers");
    ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ContainerQuantity", Строка(Объект.ОбщееКоличествоКТКВРелизе));
	ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ContTypeSize", Строка(Объект.ТипоразмерКТК));
	ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ContTypeSizeISO", Строка(Объект.ТипоразмерКТК.КодISO));
	ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "IsRef", Строка(?(Объект.ТипоразмерКТК.Рефрижераторный,1,0)));
	ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "IsState", Строка(СостояниеКТК));   
	ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "IsNumbered", Строка(?(Объект.НомернаяВыдача,1,0)));
	Запись.ЗаписатьКонецЭлемента(); //Containers
	Запись.ЗаписатьНачалоЭлемента("ContainerList");
	
	// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 03.02.2023
	МассивКлючей = РеквизитФормыВЗначение("Объект").Контейнеры.ВыгрузитьКолонку("КлючАналитикиПеревозки");
	ТЗПерваяМиляКлючиАналитики 	= Справочники.КлючиАналитикиПеревозки.КлючиАналитикиЗначенияПолейПоЭтапуПеревозки(МассивКлючей,Перечисления.ЭтапыПеревозки.ПерваяМиля);
	// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 03.02.2023
	
	Для Каждого СтрДокумента Из Объект.Контейнеры Цикл
		//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 –начало
		ДатаВывозаП = Дата(1,1,1);
		Если ЗначениеЗаполнено(СтрДокумента.КлючАналитикиПеревозки) Тогда
			НайденнаяСтрокаТЗПерваяМиля 	= ТЗПерваяМиляКлючиАналитики.Найти(СтрДокумента.КлючАналитикиПеревозки);
			Если НайденнаяСтрокаТЗПерваяМиля <> Неопределено Тогда
				ДатаВывозаП = НайденнаяСтрокаТЗПерваяМиля.ДатаВыдачиКТКСТерминала;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ Объект.НомернаяВыдача И НЕ ЗначениеЗаполнено(ДатаВывозаП) Тогда
			Продолжить;
		КонецЕсли;
		Атрибуты = Неопределено;
		Если ЗначениеЗаполнено(ДатаВывозаП) Тогда
			Атрибуты = Новый Структура("ReleaseDate", ПривестиДатуКФормату(ДатаВывозаП));
		КонецЕсли;   
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ContainerName", Строка(СтрДокумента.КлючАналитикиПеревозки.Контейнер), Атрибуты); 
	КонецЦикла;
	Запись.ЗаписатьКонецЭлемента(); //ContainerList
       	//ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 –конец
	//ПЕРЕВОЗЧИКИ   
	
	ТипТранспорта = 1;
	Если Объект.Автоперевозка = Перечисления.ВариантыАвтоперевозки.НеТребуется Тогда
		ТипТранспорта = 2;
	КонецЕсли; 
	
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Начало: 19.12.2022
	Если ТипТранспорта = 2 Тогда 
		// Дата отправления и Станция назначения
		Запись.ЗаписатьНачалоЭлемента("Railway");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "DestinationStation", Строка(Объект.СтанцияНазначенияПоЖД));
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "DepartureDate", ПривестиДатуКФормату(Объект.ДатаОтправленияПоЖДПлан));
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "OutputTransport", Строка(ТипТранспорта));
		Запись.ЗаписатьКонецЭлемента();
	КонецЕсли;
	// ДИТ US 58592 TA 60724 Евсенкин М.А. Конец: 19.12.2022

	Запись.ЗаписатьНачалоЭлемента("ForwarderList");
		
	//ДИТ Шевченко А.В. 58552 05.10.2022 -начало
	ВыборкаТранспортныхСредствНеПривязанныхККонтейнерам = ПолучитьТранспортныхСредствНеПривязанныхККонтейнерам(Объект.Ссылка);
	Пока ВыборкаТранспортныхСредствНеПривязанныхККонтейнерам.Следующий() Цикл       
		Запись.ЗаписатьНачалоЭлемента("Forwarder");
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "OutputTransport", Строка(ТипТранспорта)); 
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "TransportCompleted", 0);
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "DriverName", Строка(ВыборкаТранспортныхСредствНеПривязанныхККонтейнерам.ФИОВодителя)); 	
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "TransportNum", Строка(ВыборкаТранспортныхСредствНеПривязанныхККонтейнерам.РегНомерТС)); 	
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "PassportNumber", Строка(ВыборкаТранспортныхСредствНеПривязанныхККонтейнерам.ПаспортныеДанные));
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ForwarderName", Строка(ВыборкаТранспортныхСредствНеПривязанныхККонтейнерам.Автоперевозчик));
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ForwarderINN", Строка(ВыборкаТранспортныхСредствНеПривязанныхККонтейнерам.ИНН));
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ForwarderKPP", Строка(ВыборкаТранспортныхСредствНеПривязанныхККонтейнерам.КПП));
		Запись.ЗаписатьКонецЭлемента();
	КонецЦикла;	 
	ВыборкаТСиПеревозчиковПривязанныхККонтейнерам = ПолучитьТСиПеревозчиковПривязанныхККонтейнерам(Объект.Ссылка);
	Пока ВыборкаТСиПеревозчиковПривязанныхККонтейнерам.Следующий() Цикл  
		Запись.ЗаписатьНачалоЭлемента("Forwarder");	
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "OutputTransport", Строка(ТипТранспорта)); 		    
		TransportCompleted = ?(ВыборкаТСиПеревозчиковПривязанныхККонтейнерам.Вывезен,1,0); //общий случай для транспортных средств
		//Если ЗначениеЗаполнено(ВыборкаТСиПеревозчиковПривязанныхККонтейнерам.ИдентификаторСтрокиПеревозчика) Тогда
		//	//TransportCompleted = 1, если указан Перевозчик и все Контейнеры по этому перевозчику доставлены
		//	Если ВыборкаТСиПеревозчиковПривязанныхККонтейнерам.КоличествоНеВывезенныхКонтейнеров>0 Тогда
		//		TransportCompleted = 0;
		//	КонецЕсли;
		//КонецЕсли;
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "TransportCompleted", TransportCompleted);
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "DriverName", Строка(ВыборкаТСиПеревозчиковПривязанныхККонтейнерам.ФИОВодителя)); 	
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "TransportNum", Строка(ВыборкаТСиПеревозчиковПривязанныхККонтейнерам.РегНомерТС)); 	
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "PassportNumber", Строка(ВыборкаТСиПеревозчиковПривязанныхККонтейнерам.ПаспортныеДанные));		
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ForwarderName", Строка(ВыборкаТСиПеревозчиковПривязанныхККонтейнерам.Перевозчик)); 	    
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ForwarderINN", Строка(ВыборкаТСиПеревозчиковПривязанныхККонтейнерам.ИНН)); 
		ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "ForwarderKPP", Строка(ВыборкаТСиПеревозчиковПривязанныхККонтейнерам.КПП));
		Запись.ЗаписатьКонецЭлемента();
	КонецЦикла;
	//ДИТ Шевченко А.В. 58552 05.10.2022 -конец

	Запись.ЗаписатьКонецЭлемента(); //ForwarderList
	
	Запись.ЗаписатьКонецЭлемента(); //MultiRelease
	Запись.Закрыть();
	
	// передаем заполненный на сервере файлик назад на клиент через временноехранилище:    
    Двоичное=Новый ДвоичныеДанные(ИмяВременногоФайла);  // получаем двоичные данные из файла
    Адрес = ПоместитьВоВременноеХранилище(Двоичное, ЭтаФорма.УникальныйИдентификатор); // кидаем двоичные данные во врем. хранилище
    Возврат Адрес;
КонецФункции 
//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, конец

//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, начало
&НаСервере
Функция ПолучитьТранспортныхСредствНеПривязанныхККонтейнерам(вхДокумент)
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
	//ДИТ Шевченко А.В. 58552 05.10.2022 -начало добавил условие на пустого водителя и номерТС
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	РелизКлиентаКонтейнеры.ИдентификаторСтрокиТС КАК ИдентификаторСтрокиТС
	//	|ПОМЕСТИТЬ ВТСвязьВКонтейнерах
	//	|ИЗ
	//	|	Документ.РелизКлиента.Контейнеры КАК РелизКлиентаКонтейнеры
	//	|ГДЕ
	//	|	РелизКлиентаКонтейнеры.Ссылка = &Ссылка
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	РелизКлиентаТранспортныеСредства.Ссылка КАК Ссылка,
	//	|	РелизКлиентаТранспортныеСредства.НомерСтроки КАК НомерСтроки,
	//	|	РелизКлиентаТранспортныеСредства.ФИОВодителя КАК ФИОВодителя,
	//	|	РелизКлиентаТранспортныеСредства.РегНомерТС КАК РегНомерТС,
	//	|	РелизКлиентаТранспортныеСредства.ПаспортныеДанные КАК ПаспортныеДанные,
	//	|	РелизКлиентаТранспортныеСредства.ИдентификаторСтроки КАК ИдентификаторСтроки,
	//	|	РелизКлиентаТранспортныеСредства.ИНН КАК ИНН,
	//	|	РелизКлиентаТранспортныеСредства.КПП КАК КПП,
	//	|	РелизКлиентаТранспортныеСредства.Автоперевозчик КАК Автоперевозчик
	//	|ИЗ
	//	|	Документ.РелизКлиента.ТранспортныеСредства КАК РелизКлиентаТранспортныеСредства
	//	|ГДЕ
	//	|	РелизКлиентаТранспортныеСредства.Ссылка = &Ссылка
	//	|	И НЕ РелизКлиентаТранспортныеСредства.ИдентификаторСтроки В
	//	|				(ВЫБРАТЬ
	//	|					ВТСвязьВКонтейнерах.ИдентификаторСтрокиТС
	//	|				ИЗ
	//	|					ВТСвязьВКонтейнерах КАК ВТСвязьВКонтейнерах)
	//	|	И НЕ РелизКлиентаТранспортныеСредства.ФИОВодителя = """"
	//	|	И НЕ РелизКлиентаТранспортныеСредства.РегНомерТС = """"";
	//
	//Запрос.УстановитьПараметр("Ссылка", вхДокумент);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Возврат ВыборкаДетальныеЗаписи;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РелизКлиентаКонтейнеры.Ссылка КАК Ссылка,
	               |	РелизКлиентаКонтейнеры.НомерСтроки КАК НомерСтроки,
	               |	КлючиАналитикиПеревозкиМили.ФИОВодителя КАК ФИОВодителя,
	               |	КлючиАналитикиПеревозкиМили.РегНомерТС КАК РегНомерТС,
	               |	КлючиАналитикиПеревозкиМили.ПаспортныеДанные КАК ПаспортныеДанные,
	               |	РелизКлиентаКонтейнеры.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	КлючиАналитикиПеревозкиМили.ИНН КАК ИНН,
	               |	КлючиАналитикиПеревозкиМили.КПП КАК КПП,
	               |	КлючиАналитикиПеревозкиМили.Автоперевозчик КАК Автоперевозчик
	               |ИЗ
	               |	Документ.РелизКлиента.Контейнеры КАК РелизКлиентаКонтейнеры
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
	               |		ПО (КлючиАналитикиПеревозкиМили.Ссылка = РелизКлиентаКонтейнеры.КлючАналитикиПеревозки)
	               |			И (КлючиАналитикиПеревозкиМили.Ссылка.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	               |				ИЛИ КлючиАналитикиПеревозкиМили.ФИОВодителя <> """"
	               |				ИЛИ (КлючиАналитикиПеревозкиМили.Автоперевозчик <> """"
	               |					И КлючиАналитикиПеревозкиМили.Автоперевозчик <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) И КлючиАналитикиПеревозкиМили.Автоперевозчик <> Неопределено))
	               |			И (КлючиАналитикиПеревозкиМили.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.ПерваяМиля))
	               |ГДЕ
	               |	РелизКлиентаКонтейнеры.Ссылка = &Ссылка
	               |	И НЕ КлючиАналитикиПеревозкиМили.ФИОВодителя = """"
	               |	И НЕ КлючиАналитикиПеревозкиМили.РегНомерТС = """"
	               |	И КлючиАналитикиПеревозкиМили.Ссылка.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)";

	Запрос.УстановитьПараметр("Ссылка",вхДокумент);
	
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Возврат ВыборкаДетальныеЗаписи;
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Конец
КонецФункции  
//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, конец

//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, начало
&НаСервере
Функция ПолучитьАвтоПеревозчиковНеПривязанныхККонтейнерам(вхДокумент)
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
	//ДИТ Шевченко А.В. 59945 06.10.2022 -изменил запрос после удаления тч Автоперевозчики
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	РелизКлиентаКонтейнеры.ИдентификаторСтрокиТС КАК ИдентификаторСтрокиТС
	//	|ПОМЕСТИТЬ ВТСвязьВКонтейнерах
	//	|ИЗ
	//	|	Документ.РелизКлиента.Контейнеры КАК РелизКлиентаКонтейнеры
	//	|ГДЕ
	//	|	РелизКлиентаКонтейнеры.Ссылка = &Ссылка
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	РелизКлиентаАвтоперевозчики.Ссылка КАК Ссылка,
	//	|	РелизКлиентаАвтоперевозчики.НомерСтроки КАК НомерСтроки,
	//	|	РелизКлиентаАвтоперевозчики.Автоперевозчик КАК Перевозчик,
	//	|	РелизКлиентаАвтоперевозчики.ИНН КАК ИНН,
	//	|	РелизКлиентаАвтоперевозчики.КПП КАК КПП,
	//	|	РелизКлиентаАвтоперевозчики.ИдентификаторСтроки КАК ИдентификаторСтроки
	//	|ИЗ
	//	|	Документ.РелизКлиента.ТранспортныеСредства КАК РелизКлиентаАвтоперевозчики
	//	|ГДЕ
	//	|	РелизКлиентаАвтоперевозчики.Ссылка = &Ссылка
	//	|	И РелизКлиентаАвтоперевозчики.ФИОВодителя = """"
	//	|	И РелизКлиентаАвтоперевозчики.РегНомерТС = """"
	//	|	И НЕ РелизКлиентаАвтоперевозчики.ИдентификаторСтроки В
	//	|				(ВЫБРАТЬ
	//	|					ВТСвязьВКонтейнерах.ИдентификаторСтрокиТС
	//	|				ИЗ
	//	|					ВТСвязьВКонтейнерах КАК ВТСвязьВКонтейнерах)";
	//
	//Запрос.УстановитьПараметр("Ссылка", вхДокумент);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Возврат ВыборкаДетальныеЗаписи;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РелизКлиентаКонтейнеры.Ссылка КАК Ссылка,
	               |	РелизКлиентаКонтейнеры.НомерСтроки КАК НомерСтроки,
	               |	КлючиАналитикиПеревозкиМили.ФИОВодителя КАК ФИОВодителя,
	               |	КлючиАналитикиПеревозкиМили.РегНомерТС КАК РегНомерТС,
	               |	КлючиАналитикиПеревозкиМили.ПаспортныеДанные КАК ПаспортныеДанные,
	               |	РелизКлиентаКонтейнеры.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	КлючиАналитикиПеревозкиМили.ИНН КАК ИНН,
	               |	КлючиАналитикиПеревозкиМили.КПП КАК КПП,
	               |	КлючиАналитикиПеревозкиМили.Автоперевозчик КАК Перевозчик
	               |ИЗ
	               |	Документ.РелизКлиента.Контейнеры КАК РелизКлиентаКонтейнеры
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
	               |		ПО (КлючиАналитикиПеревозкиМили.Ссылка = РелизКлиентаКонтейнеры.КлючАналитикиПеревозки)
	               |			И (КлючиАналитикиПеревозкиМили.Ссылка.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	               |				ИЛИ КлючиАналитикиПеревозкиМили.ФИОВодителя <> """"
	               |				ИЛИ (КлючиАналитикиПеревозкиМили.Автоперевозчик <> """"
	               |					И КлючиАналитикиПеревозкиМили.Автоперевозчик <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) И КлючиАналитикиПеревозкиМили.Автоперевозчик <> Неопределено))
	               |			И (КлючиАналитикиПеревозкиМили.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.ПерваяМиля))
	               |ГДЕ
	               |	РелизКлиентаКонтейнеры.Ссылка = &Ссылка
	               |	И КлючиАналитикиПеревозкиМили.ФИОВодителя = """"
	               |	И КлючиАналитикиПеревозкиМили.РегНомерТС = """"
	               |	И КлючиАналитикиПеревозкиМили.Ссылка.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)";

	Запрос.УстановитьПараметр("Ссылка",вхДокумент);
	
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Возврат ВыборкаДетальныеЗаписи;
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -конец
КонецФункции   
//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, конец

//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, начало
&НаСервере
Функция ПолучитьТСиПеревозчиковПривязанныхККонтейнерам(вхДокумент)
    //ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
	////ДИТ Шевченко А.В. 59945 06.10.2022 -изменил запрос после удаления тч Автоперевозчики
	//#Область СтарыйЗапрос
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВЫБОР
	//// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 02.02.2023
	//// Было:
	////КОГДА РелизКлиентаКонтейнеры.ДатаВывоза = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	////Стало:
	//|		КОГДА КлючиАналитикиПеревозкиМили.ДатаВыдачиКТКСТерминала = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 02.02.2023
	//|			ТОГДА ЛОЖЬ
	//|		ИНАЧЕ ИСТИНА
	//|	КОНЕЦ КАК Вывезен,
	//|	РелизКлиентаКонтейнеры.ИдентификаторСтрокиТС КАК ИдентификаторСтрокиТС,
	//|	РелизКлиентаКонтейнеры.Ссылка КАК Ссылка,
	////ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 –начало
	////|	РелизКлиентаТранспортныеСредства.ФИОВодителя) КАК ФИОВодителя,
	////|	РелизКлиентаТранспортныеСредства.РегНомерТС КАК РегНомерТС
	//|	ВЫБОР КОГДА ЕстьNULL(КлючиАналитикиПеревозкиМили.ФИОВодителя,РелизКлиентаТранспортныеСредства.ФИОВодителя) = """" ТОГДА РелизКлиентаТранспортныеСредства.ФИОВодителя ИНАЧЕ ЕстьNULL(КлючиАналитикиПеревозкиМили.ФИОВодителя,РелизКлиентаТранспортныеСредства.ФИОВодителя) КОНЕЦ КАК ФИОВодителя,
	//|	ВЫБОР КОГДА ЕстьNULL(КлючиАналитикиПеревозкиМили.РегНомерТС,РелизКлиентаТранспортныеСредства.РегНомерТС) = """" ТОГДА РелизКлиентаТранспортныеСредства.РегНомерТС ИНАЧЕ ЕстьNULL(КлючиАналитикиПеревозкиМили.РегНомерТС,РелизКлиентаТранспортныеСредства.РегНомерТС) КОНЕЦ КАК РегНомерТС
	////ДИТ Шевченко А.В. US 62421 TA 64347 24.01.23 –конец
	//|ПОМЕСТИТЬ ВТСвязьВКонтейнерах
	//|ИЗ
	//|	Документ.РелизКлиента.Контейнеры КАК РелизКлиентаКонтейнеры
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизКлиента.ТранспортныеСредства КАК РелизКлиентаТранспортныеСредства
	//|		ПО (РелизКлиентаКонтейнеры.Ссылка = РелизКлиентаТранспортныеСредства.Ссылка)
	//|			И (РелизКлиентаКонтейнеры.ИдентификаторСтрокиТС = РелизКлиентаТранспортныеСредства.ИдентификаторСтроки)
	//// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 02.02.2023
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
	//|		ПО (РелизКлиентаКонтейнеры.КлючАналитикиПеревозки = КлючиАналитикиПеревозкиМили.Ссылка)
	//|			И (КлючиАналитикиПеревозкиМили.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.ПерваяМиля))
	//// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 02.02.2023
	//|ГДЕ
	//|	РелизКлиентаКонтейнеры.Ссылка = &Ссылка
	//|	И РелизКлиентаКонтейнеры.ИдентификаторСтрокиТС <> """"
	//|	И НЕ РелизКлиентаТранспортныеСредства.ФИОВодителя = """"
	//|	И НЕ РелизКлиентаТранспортныеСредства.РегНомерТС = """"
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТСвязьВКонтейнерах.ИдентификаторСтрокиТС КАК ИдентификаторСтрокиТС,
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РелизКлиентаКонтейнеры.ИдентификаторСтроки) КАК КоличествоНеВывезенныхКонтейнеров
	//|ПОМЕСТИТЬ НевывезенныеКонтейнерыПоПеревозчикам
	//|ИЗ
	//|	ВТСвязьВКонтейнерах КАК ВТСвязьВКонтейнерах
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизКлиента.Контейнеры КАК РелизКлиентаКонтейнеры
	//|		ПО (РелизКлиентаКонтейнеры.Ссылка = ВТСвязьВКонтейнерах.Ссылка)
	//|			И (РелизКлиентаКонтейнеры.ИдентификаторСтрокиПеревозчика = ВТСвязьВКонтейнерах.ИдентификаторСтрокиТС)
	//|ГДЕ
	//|	ВТСвязьВКонтейнерах.ИдентификаторСтрокиТС <> """"
	//|	И ВТСвязьВКонтейнерах.ФИОВодителя = """"
	//|	И ВТСвязьВКонтейнерах.РегНомерТС = """"
	//|	И НЕ ВТСвязьВКонтейнерах.Вывезен
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТСвязьВКонтейнерах.ИдентификаторСтрокиТС
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	РелизКлиентаТранспортныеСредства.ФИОВодителя КАК ФИОВодителя,
	//|	РелизКлиентаТранспортныеСредства.РегНомерТС КАК РегНомерТС,
	//|	РелизКлиентаТранспортныеСредства.ПаспортныеДанные КАК ПаспортныеДанные,
	//|	ВТСвязьВКонтейнерах.Вывезен КАК Вывезен,
	//|	ВТСвязьВКонтейнерах.ИдентификаторСтрокиТС КАК ИдентификаторСтрокиТС,
	//|	РелизКлиентаТранспортныеСредства.ИНН КАК ИНН,
	//|	РелизКлиентаТранспортныеСредства.КПП КАК КПП,
	//|	РелизКлиентаТранспортныеСредства.Автоперевозчик КАК Перевозчик,
	//|	СУММА(ЕСТЬNULL(НевывезенныеКонтейнерыПоПеревозчикам.КоличествоНеВывезенныхКонтейнеров, 0)) КАК КоличествоНеВывезенныхКонтейнеров
	//|ИЗ
	//|	ВТСвязьВКонтейнерах КАК ВТСвязьВКонтейнерах
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизКлиента.ТранспортныеСредства КАК РелизКлиентаТранспортныеСредства
	//|		ПО ВТСвязьВКонтейнерах.Ссылка = РелизКлиентаТранспортныеСредства.Ссылка
	//|			И ВТСвязьВКонтейнерах.ИдентификаторСтрокиТС = РелизКлиентаТранспортныеСредства.ИдентификаторСтроки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ НевывезенныеКонтейнерыПоПеревозчикам КАК НевывезенныеКонтейнерыПоПеревозчикам
	//|		ПО (НевывезенныеКонтейнерыПоПеревозчикам.ИдентификаторСтрокиТС = ВТСвязьВКонтейнерах.ИдентификаторСтрокиТС)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	РелизКлиентаТранспортныеСредства.ФИОВодителя,
	//|	РелизКлиентаТранспортныеСредства.РегНомерТС,
	//|	РелизКлиентаТранспортныеСредства.ПаспортныеДанные,
	//|	РелизКлиентаТранспортныеСредства.ИНН,
	//|	РелизКлиентаТранспортныеСредства.КПП,
	//|	ВТСвязьВКонтейнерах.Вывезен,
	//|	ВТСвязьВКонтейнерах.ИдентификаторСтрокиТС,
	//|	РелизКлиентаТранспортныеСредства.Автоперевозчик";
	//#КонецОбласти
	//
	//Запрос.УстановитьПараметр("Ссылка", вхДокумент);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Возврат ВыборкаДетальныеЗаписи;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	КлючиАналитикиПеревозкиМили.Ссылка КАК КлючАналитикиПеревозки,
	               |	ВЫБОР
	               |		КОГДА КлючиАналитикиПеревозкиМили.ДатаВыдачиКТКСТерминала = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК Вывезен,
	               |	РелизКлиентаКонтейнеры.ИдентификаторСтрокиТС КАК ИдентификаторСтрокиТС,
	               |	РелизКлиентаКонтейнеры.Ссылка КАК Ссылка,
	               |	КлючиАналитикиПеревозкиМили.ФИОВодителя КАК ФИОВодителя,
	               |	КлючиАналитикиПеревозкиМили.РегНомерТС КАК РегНомерТС,
	               |	КлючиАналитикиПеревозкиМили.Ссылка.Контейнер КАК Контейнер,
	               |	КлючиАналитикиПеревозкиМили.ПаспортныеДанные КАК ПаспортныеДанные,
	               |	КлючиАналитикиПеревозкиМили.ИНН КАК ИНН,
	               |	КлючиАналитикиПеревозкиМили.КПП КАК КПП,
	               |	КлючиАналитикиПеревозкиМили.Автоперевозчик КАК Автоперевозчик
	               |ПОМЕСТИТЬ ВТСвязьВКонтейнерах
	               |ИЗ
	               |	Документ.РелизКлиента.Контейнеры КАК РелизКлиентаКонтейнеры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиПеревозки.Мили КАК КлючиАналитикиПеревозкиМили
	               |		ПО РелизКлиентаКонтейнеры.КлючАналитикиПеревозки = КлючиАналитикиПеревозкиМили.Ссылка
	               |			И (КлючиАналитикиПеревозкиМили.ЭтапПеревозки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПеревозки.ПерваяМиля))
	               |ГДЕ
	               |	РелизКлиентаКонтейнеры.Ссылка = &Ссылка
	               |	И КлючиАналитикиПеревозкиМили.Ссылка.Контейнер <> ЗНАЧЕНИЕ(Справочник.Те.ПустаяСсылка)
	               |	И НЕ КлючиАналитикиПеревозкиМили.ФИОВодителя = """"
	               |	И НЕ КлючиАналитикиПеревозкиМили.РегНомерТС = """"
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТСвязьВКонтейнерах.КлючАналитикиПеревозки КАК КлючАналитикиПеревозки,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РелизКлиентаКонтейнеры.ИдентификаторСтроки) КАК КоличествоНеВывезенныхКонтейнеров
	               |ПОМЕСТИТЬ НевывезенныеКонтейнерыПоПеревозчикам
	               |ИЗ
	               |	ВТСвязьВКонтейнерах КАК ВТСвязьВКонтейнерах
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизКлиента.Контейнеры КАК РелизКлиентаКонтейнеры
	               |		ПО (РелизКлиентаКонтейнеры.Ссылка = ВТСвязьВКонтейнерах.Ссылка)
	               |			И (РелизКлиентаКонтейнеры.КлючАналитикиПеревозки = ВТСвязьВКонтейнерах.КлючАналитикиПеревозки)
	               |ГДЕ
	               |	ВТСвязьВКонтейнерах.Контейнер <> ЗНАЧЕНИЕ(Справочник.Те.ПустаяСсылка)
	               |	И ВТСвязьВКонтейнерах.ФИОВодителя = """"
	               |	И ВТСвязьВКонтейнерах.РегНомерТС = """"
	               |	И НЕ ВТСвязьВКонтейнерах.Вывезен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТСвязьВКонтейнерах.КлючАналитикиПеревозки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТСвязьВКонтейнерах.ФИОВодителя КАК ФИОВодителя,
	               |	ВТСвязьВКонтейнерах.РегНомерТС КАК РегНомерТС,
	               |	ВТСвязьВКонтейнерах.ПаспортныеДанные КАК ПаспортныеДанные,
	               |	ВТСвязьВКонтейнерах.Вывезен КАК Вывезен,
	               |	ВТСвязьВКонтейнерах.ИНН КАК ИНН,
	               |	ВТСвязьВКонтейнерах.КПП КАК КПП,
	               |	ВТСвязьВКонтейнерах.Автоперевозчик КАК Перевозчик,
	               |	СУММА(ЕСТЬNULL(НевывезенныеКонтейнерыПоПеревозчикам.КоличествоНеВывезенныхКонтейнеров, 0)) КАК КоличествоНеВывезенныхКонтейнеров
	               |ИЗ
	               |	ВТСвязьВКонтейнерах КАК ВТСвязьВКонтейнерах
	               |		ЛЕВОЕ СОЕДИНЕНИЕ НевывезенныеКонтейнерыПоПеревозчикам КАК НевывезенныеКонтейнерыПоПеревозчикам
	               |		ПО (НевывезенныеКонтейнерыПоПеревозчикам.КлючАналитикиПеревозки = ВТСвязьВКонтейнерах.КлючАналитикиПеревозки)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТСвязьВКонтейнерах.ФИОВодителя,
	               |	ВТСвязьВКонтейнерах.РегНомерТС,
	               |	ВТСвязьВКонтейнерах.ПаспортныеДанные,
	               |	ВТСвязьВКонтейнерах.ИНН,
	               |	ВТСвязьВКонтейнерах.КПП,
	               |	ВТСвязьВКонтейнерах.Вывезен,
	               |	ВТСвязьВКонтейнерах.Автоперевозчик";
	
    Запрос.УстановитьПараметр("Ссылка", вхДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи;
	//ДИТ Шевченко А.В. US 62421 TA 68370 10.04.2023 -Начало
	
КонецФункции

&НаКлиенте
Процедура КонтейнерыИнструкцияПоСдаче1ПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Контейнеры.ТекущиеДанные;  
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 05.12.2023
	//ДобавитьЗначениеРеквизитаВКлюч(ТекущиеДанные.КлючАналитикиПеревозки,ТекущиеДанные.ИнструкцияПоСдаче,"ИнструкцияПоСдаче",,,ТекущиеДанные.ВерсияКлюча);
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 05.12.2023	
	Если ТекущиеДанные.НомерСтроки = 1 И Объект.Контейнеры.Количество() > 1 И ЗаполнятьПоПервойСтроке Тогда
	
		Если ЗначениеЗаполнено(ТекущиеДанные.ИнструкцияПоСдаче) Тогда
			ИнструкцияПоСдаче = ТекущиеДанные.ИнструкцияПоСдаче;
			Для Каждого ТекущаяСтрока Из Объект.Контейнеры Цикл
				ТекущаяСтрока.ИнструкцияПоСдаче = ИнструкцияПоСдаче; 
				// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 05.12.2023
				//ДобавитьЗначениеРеквизитаВКлюч(ТекущаяСтрока.КлючАналитикиПеревозки,ТекущиеДанные.ИнструкцияПоСдаче,"ИнструкцияПоСдаче",,,ТекущаяСтрока.ВерсияКлюча);
				// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 05.12.2023
			КонецЦикла;
		КонецЕсли;			
	КонецЕсли;
	МодифицированностьФлаг = ЭтаФорма.Модифицированность;
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыДатаВывоза1ПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Контейнеры.ТекущиеДанные;  
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 05.12.2023
	//СтруктураТЧМили = Новый Структура;
	//СтруктураТЧМили.Вставить("ДатаВыдачиКТКСТерминала",ТекущиеДанные.ДатаВывоза);    
	//ДобавитьЗначениеРеквизитаВКлюч(ТекущиеДанные.КлючАналитикиПеревозки,ТекущиеДанные.ДатаВывоза,"ДатаВыдачиКТКСТерминала",ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПерваяМиля"),СтруктураТЧМили,ТекущиеДанные.ВерсияКлюча);
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 05.12.2023
	МодифицированностьФлаг = ЭтаФорма.Модифицированность;
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыДатаВозвратаКлиентомПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Контейнеры.ТекущиеДанные;  
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Начало: 05.12.2023
	//СтруктураТЧМили = Новый Структура;
	//СтруктураТЧМили.Вставить("ДатаСдачиКТКНаТерминал",ТекущиеДанные.ДатаВозвратаКлиентом);	
	//ДобавитьЗначениеРеквизитаВКлюч(ТекущиеДанные.КлючАналитикиПеревозки,"","",ПредопределенноеЗначение("Перечисление.ЭтапыПеревозки.ПоследняяМиля"),СтруктураТЧМили,ТекущиеДанные.ВерсияКлюча);
	// ДИТ US 76935 ТА 77189 Сержантова А.С. Конец: 05.12.2023	
	МодифицированностьФлаг = ЭтаФорма.Модифицированность;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтейнерыПоИнформацииОтТерминаловНаСервере()
	ОбъектРелиз = РеквизитФормыВЗначение("Объект");
	//Евросиб - АСуслов 27.09.2023 14:16:02 #75435
	//(
	Модифицированность = ОбъектРелиз.ЗаполнитьКонтейнерыПоИнформацииОтТерминалов();
	//)
	//Евросиб - АСуслов 27.09.2023 14:16:03 #75435	
	ЗначениеВРеквизитФормы(ОбъектРелиз, "Объект");
	ЗаполнитьТаблицуПоКлючамАналитики();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКонтейнерыПоИнформацииОтТерминалов(Команда)
	ЗаполнитьКонтейнерыПоИнформацииОтТерминаловНаСервере();
КонецПроцедуры
//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, конец

// ДИТ US 76995 ТА 76997 Сержантова А.С. 08.11.2023
&НаКлиенте
Процедура КонтактыТерминалаВыдачиПриИзменении(Элемент)
	ЭтаФорма.Модифицированность = Истина;    
	СохранитьКонтактыТерминалаВыдачи();
КонецПроцедуры

// ДИТ US 76935 ТА 77189 Сержантова А.С. 08.12.2023
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОповеститьОбИзменении(Тип("СправочникСсылка.КлючиАналитикиПеревозки")); 
	Оповестить("НеобходимоОбновитьДанныеКлючейАналитикиПеревозки", , ЭтаФорма);  
	// ДИТ US 79950 ТА 79951 Сержантова А.С. Начало: 21.02.2024
	Оповестить("НеобходимоОбновитьФормуЗаявкиДляРаботыСЗапросомКТК", , ЭтаФорма);
	// ДИТ US 79950 ТА 79951 Сержантова А.С. Конец: 21.02.2024  
	// ДИТ US 80736 ТА 81088 Сержантова А.С. Начало: 28.02.2024
	Оповестить("НеобходимоОбновитьФормуЗапросаНаАвто", , ЭтаФорма);
	// ДИТ US 80736 ТА 81088 Сержантова А.С. Конец: 28.02.2024
КонецПроцедуры

// ДИТ US 76935 ТА 77189 Сержантова А.С. 08.12.2023
&НаКлиенте
Процедура КонтейнерыПередНачаломИзменения(Элемент, Отказ)    
	ТекСтрока = Элементы.Контейнеры.ТекущиеДанные; 
	Если ТекСтрока <> Неопределено Тогда
		ПроверитьАктуальностьКлючаАналитики(Элементы.Контейнеры.ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры     

// ДИТ US 76935 ТА 77189 Сержантова А.С. 08.12.2023     
&НаСервере
Процедура ПроверитьАктуальностьКлючаАналитики(ИдентификаторСтроки = Неопределено)   
	
	СтрокиДляОбновления = Новый Массив;
	Если ИдентификаторСтроки = Неопределено Тогда
		СтрокиДляОбновления = Объект.Контейнеры;	
	Иначе
	    СтрокиДляОбновления.Добавить(Объект.Контейнеры.НайтиПоИдентификатору(ИдентификаторСтроки));
	КонецЕсли;	
	
	БылоОбновлениеКлюча = Ложь;
	Для каждого СтрокаТЧ Из СтрокиДляОбновления Цикл
		АктуальнаяВерсия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.КлючАналитикиПеревозки, "ВерсияДанных");
		Если СтрокаТЧ.ВерсияКлюча <> АктуальнаяВерсия Тогда
			ЗаполнитьТаблицуПоКлючамАналитики(СтрокаТЧ.КлючАналитикиПеревозки); 
			БылоОбновлениеКлюча = Истина;
		КонецЕсли;
	КонецЦикла;	
	Если БылоОбновлениеКлюча Тогда 
		ОбщегоНазначения.СообщитьПользователю("Версия ключа аналитики перевозки устарела, подгружены актуальные данные");		
	КонецЕсли; 
	
КонецПроцедуры
// Евросиб Рыбьяков К.А. 22.10.2024 ))

	
#КонецОбласти