
&НаСервере
Процедура ЗаполнитьПоАкцептуНаСервере()
	
	СтрокиСписка = ПолныйСписок.ПолучитьЭлементы();
	СтрокиСписка.Очистить();
	
	Если ЗначениеЗаполнено(АдресТаблицыАкцепта) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АкцептУслуги.НомерСтроки КАК НомерСтроки,
		|	АкцептУслуги.Контейнер КАК Контейнер,
		|	АкцептУслуги.Вагон КАК Вагон,
		|	АкцептУслуги.ТранспортныйДокумент КАК ТранспортныйДокумент,
		|	АкцептУслуги.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
		|	АкцептУслуги.Сделка КАК СделкаВАкцепте
		|ПОМЕСТИТЬ ВТУслугиАкцепта
		|ИЗ
		|	&ТаблицаАкцепта КАК АкцептУслуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТУслугиАкцепта.НомерСтроки КАК НомерСтроки,
		|	ВТУслугиАкцепта.Контейнер КАК Контейнер,
		|	ВТУслугиАкцепта.Вагон КАК Вагон,
		|	ВТУслугиАкцепта.ТранспортныйДокумент КАК Накладная,
		|	ВТУслугиАкцепта.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
		|	ТЕ.Наименование КАК НомерКонтейнера,
		|	ТС.Наименование КАК НомерВагона,
		|	ДокТранспортныйДокумент.НомерТранспортногоДокумента КАК НомерНакладной,
		|	ДокТранспортныйДокумент.ДатаТранспортногоДокумента КАК ДатаНакладной,
		|	ВТУслугиАкцепта.СделкаВАкцепте КАК СделкаВАкцепте
		|ПОМЕСТИТЬ ВТТаблицаАкцепта
		|ИЗ
		|	ВТУслугиАкцепта КАК ВТУслугиАкцепта
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
		|		ПО ВТУслугиАкцепта.Контейнер = ТЕ.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТС КАК ТС
		|		ПО ВТУслугиАкцепта.Вагон = ТС.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортныйДокумент КАК ДокТранспортныйДокумент
		|		ПО ВТУслугиАкцепта.ТранспортныйДокумент = ДокТранспортныйДокумент.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТаблицаАкцепта.НомерСтроки КАК НомерСтроки,
		|	ВТТаблицаАкцепта.Контейнер КАК Контейнер,
		|	ВТТаблицаАкцепта.Вагон КАК Вагон,
		|	ВТТаблицаАкцепта.Накладная КАК Накладная,
		|	ВТТаблицаАкцепта.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
		|	ВТТаблицаАкцепта.НомерКонтейнера КАК НомерКонтейнера,
		|	ВТТаблицаАкцепта.НомерВагона КАК НомерВагона,
		|	ВТТаблицаАкцепта.НомерНакладной КАК НомерНакладной,
		|	ВТТаблицаАкцепта.ДатаНакладной КАК ДатаНакладной,
		|	ВТТаблицаАкцепта.СделкаВАкцепте КАК СделкаВАкцепте
		|ИЗ
		|	ВТТаблицаАкцепта КАК ВТТаблицаАкцепта
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(ВТТаблицаАкцепта.ДатаНакладной) КАК ДатаНачала,
		|	МАКСИМУМ(ВТТаблицаАкцепта.ДатаНакладной) КАК ДатаОкончания
		|ИЗ
		|	ВТТаблицаАкцепта КАК ВТТаблицаАкцепта";
		ТаблицаАкцепта = ПолучитьИзВременногоХранилища(АдресТаблицыАкцепта);
		Запрос.УстановитьПараметр("ТаблицаАкцепта", ТаблицаАкцепта);
		
	Иначе
		
		Возврат;
	
	КонецЕсли;
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	Выборка = РезультатыЗапроса[2].Выбрать();
	Пока Выборка.Следующий() Цикл	
		НоваяСтрока = СтрокиСписка.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);	
	КонецЦикла;
	
	Выборка = РезультатыЗапроса[3].Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.ДатаНачала) Тогда
			Период.ДатаНачала = Выборка.ДатаНачала;
			Период.ДатаОкончания = Выборка.ДатаОкончания;
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокСУчетомОтборов()

	СтрокиПолногоСписка = ПолныйСписок.ПолучитьЭлементы();
	СтрокиСписка = Список.ПолучитьЭлементы();
	СтрокиСписка.Очистить();
	Для каждого СтрокаПолногоСписка Из СтрокиПолногоСписка Цикл
		
		Если ОтборСтрокСписка = "ПоказыватьНеразнесенные" Тогда
			//"Показывать неразнесенные" - в результат выводить строки, у которых нет связи в акцепте со сделкой + строки у которых нет связей ни со сделками, ни с заказами)
			Если ЗначениеЗаполнено(СтрокаПолногоСписка.СделкаВАкцепте) Или СтрокаПолногоСписка.КоличествоСделок <> 0 Или СтрокаПолногоСписка.НакладныхВЗаказахВРитме <> 0 Тогда
				Продолжить;
			КонецЕсли;
		ИначеЕсли ОтборСтрокСписка = "ПоказыватьДубли" Тогда
			//"Показывать дубли" - в результат выводить строки, к которым подобраны и сделки, и заказы.
			Если СтрокаПолногоСписка.КоличествоСделок = 0 Или СтрокаПолногоСписка.НакладныхВЗаказахВРитме = 0 Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
	
		СтрокаСписка = СтрокиСписка.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСписка, СтрокаПолногоСписка);
		
		ДочерниеСтрокиПолногоСписка = СтрокаПолногоСписка.ПолучитьЭлементы();
		ДочерниеСтрокиСписка = СтрокаСписка.ПолучитьЭлементы();
		Для каждого ДочерняяСтрокаПолногоСписка Из ДочерниеСтрокиПолногоСписка Цикл
		
			ДочерняяСтрокаСписка = ДочерниеСтрокиСписка.Добавить();
			ЗаполнитьЗначенияСвойств(ДочерняяСтрокаСписка, ДочерняяСтрокаПолногоСписка);
		
		КонецЦикла; 
	
	КонецЦикла; 

КонецПроцедуры // ЗаполнитьСписокСУчетомОтборов() 

&НаКлиенте
Процедура ЗаполнитьПоАкцепту(Команда)
	ЗаполнитьПоАкцептуНаСервере();
КонецПроцедуры

&НаСервере
Процедура НайтиСделкиЗаказыНаСервере()
	
	СтрокиАкцепта = ПолныйСписок.ПолучитьЭлементы();
	Для каждого СтрокаСписка Из СтрокиАкцепта Цикл
				
		ДочерниеСтроки = СтрокаСписка.ПолучитьЭлементы();
		ДочерниеСтроки.Очистить();
		
	КонецЦикла;
	
	НайтиСделки();
	НайтиЗаказыРитм();
	
КонецПроцедуры

&НаСервере
Процедура НайтиСделки()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Список.Контейнер КАК Контейнер,
	|	Список.Вагон КАК Вагон,
	|	Список.Накладная КАК Накладная
	|ПОМЕСТИТЬ ВТСписок
	|ИЗ
	|	&Список КАК Список
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСписок.Контейнер КАК Контейнер,
	|	ВТСписок.Вагон КАК Вагон,
	|	ВТСписок.Накладная КАК Накладная,
	|	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Сделка,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН.ДатаТранспортногоДокумента КАК ДатаНакладнойВСделке,
	|	СделкаСвязьУчетныхЕдиниц.Клиент КАК КлиентВСделке,
	|	СделкаСвязьУчетныхЕдиниц.Договор КАК ДоговорВСделке,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН КАК НакладнаяВСделке,
	|	СделкаСвязьУчетныхЕдиниц.Вагон КАК ВагонВСделке,
	|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК КонтейнерВСделке
	|ИЗ
	|	ВТСписок КАК ВТСписок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|		ПО (СделкаСвязьУчетныхЕдиниц.ЖДН.ДатаТранспортногоДокумента МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|			И ВТСписок.Контейнер = СделкаСвязьУчетныхЕдиниц.Контейнер
	|			И ВТСписок.Вагон = СделкаСвязьУчетныхЕдиниц.Вагон
	|			И ВТСписок.Накладная = СделкаСвязьУчетныхЕдиниц.ЖДН";
	
	Если Не ПоискПоКонтейнеру Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И ВТСписок.Контейнер = СделкаСвязьУчетныхЕдиниц.Контейнер", "");
	КонецЕсли;
	
	Если Не ПоискПоВагону Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И ВТСписок.Вагон = СделкаСвязьУчетныхЕдиниц.Вагон", "");
	КонецЕсли;
	
	Если Не ПоискПоНакладной Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И ВТСписок.Накладная = СделкаСвязьУчетныхЕдиниц.ЖДН", "");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
		
	ТаблицаАкцепта = Новый ТаблицаЗначений;
	ТаблицаАкцепта.Колонки.Добавить("Контейнер", Новый ОписаниеТипов("СправочникСсылка.ТЕ"));
	ТаблицаАкцепта.Колонки.Добавить("Вагон", Новый ОписаниеТипов("СправочникСсылка.ТС"));
	ТаблицаАкцепта.Колонки.Добавить("Накладная", Новый ОписаниеТипов("ДокументСсылка.ТранспортныйДокумент"));
	
	СтрокиАкцепта = ПолныйСписок.ПолучитьЭлементы();
	Для каждого СтрокаСписка Из СтрокиАкцепта Цикл	
		НоваяСтрока = ТаблицаАкцепта.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСписка);
	КонецЦикла;
	
	ТаблицаАкцепта.Свернуть("Контейнер, Вагон, Накладная");
	
	Запрос.УстановитьПараметр("Список", ТаблицаАкцепта);
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	
	ТаблицаСделок = Запрос.Выполнить().Выгрузить();
	ТаблицаСделок.Индексы.Добавить("Контейнер, Вагон, Накладная");
	
	ПараметрыОтбора = Новый Структура("Контейнер, Вагон, Накладная");
	
	Для Каждого СтрокаСписка Из СтрокиАкцепта Цикл
		
		ЗаполнитьЗначенияСвойств(ПараметрыОтбора, СтрокаСписка);
		СтрокиПоСделкам = ТаблицаСделок.НайтиСтроки(ПараметрыОтбора);
		
		КоличествоСтрокПоСделкам = СтрокиПоСделкам.Количество();
		СтрокаСписка.КоличествоСделок = КоличествоСтрокПоСделкам;
		
		СтрокаСписка.Сделка = Неопределено;
		СтрокаСписка.КлиентВСделке = Неопределено;
		СтрокаСписка.ДоговорВСделке = Неопределено;
		СтрокаСписка.НакладнаяВСделке = Неопределено;
		СтрокаСписка.ВагонВСделке = Неопределено;
		СтрокаСписка.КонтейнерВсделке = Неопределено;
		
		Если КоличествоСтрокПоСделкам = 1 Тогда
			ЗаполнитьЗначенияСвойств(СтрокаСписка, СтрокиПоСделкам[0]);
		ИначеЕсли КоличествоСтрокПоСделкам > 1 Тогда
			ДочерниеСтроки = СтрокаСписка.ПолучитьЭлементы();
			Для Каждого СтрокаПоСделке Из СтрокиПоСделкам Цикл
				НоваяСтрока = ДочерниеСтроки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПоСделке);
				НоваяСтрока.КоличествоСделок = 1;
			КонецЦикла;
		КонецЕсли;		
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НайтиЗаказыРитм()
	
	ТаблицаПараметров = Новый ТаблицаЗначений;
	ТаблицаПараметров.Колонки.Добавить("ИмяПараметра", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(20, ДопустимаяДлина.Переменная)));
	ТаблицаПараметров.Колонки.Добавить("ЗначениеПараметра", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(20, ДопустимаяДлина.Переменная)));
	
	СтрокиАкцепта = ПолныйСписок.ПолучитьЭлементы();
	Для каждого СтрокаСписка Из СтрокиАкцепта Цикл
		
		Если ЗначениеЗаполнено(СтрокаСписка.НомерКонтейнера) Тогда
			НоваяСтрока = ТаблицаПараметров.Добавить();
			НоваяСтрока.ИмяПараметра = "contNum";
			НоваяСтрока.ЗначениеПараметра = СтрокаСписка.НомерКонтейнера;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаСписка.НомерВагона) Тогда
			НоваяСтрока = ТаблицаПараметров.Добавить();
			НоваяСтрока.ИмяПараметра = "carNum";
			НоваяСтрока.ЗначениеПараметра = СтрокаСписка.НомерВагона;
		КонецЕсли;
		
		//Если ЗначениеЗаполнено(СтрокаСписка.НомерНакладной) Тогда
		//	НоваяСтрока = ТаблицаПараметров.Добавить();
		//	НоваяСтрока.ИмяПараметра = "?";
		//	НоваяСтрока.ЗначениеПараметра = СтрокаСписка.НомерНакладной;
		//КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаПараметров.Свернуть("ИмяПараметра, ЗначениеПараметра");
	
	НоваяСтрока = ТаблицаПараметров.Вставить(0);
	НоваяСтрока.ИмяПараметра = "trSndDateBegin";
	НоваяСтрока.ЗначениеПараметра = XMLСтрока(Период.ДатаНачала);
			
	НоваяСтрока = ТаблицаПараметров.Вставить(1);
	НоваяСтрока.ИмяПараметра = "trSndDateEnd";
	НоваяСтрока.ЗначениеПараметра = XMLСтрока(Период.ДатаОкончания);

	ТекстЗапроса = ПолучитьТекстЗапросаВебСервису(ТаблицаПараметров);
	ОтветXML = ВебСервисы_сервер.ЗапроситьРИТМ("DCCargo608Select", ТекстЗапроса);
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(ОтветXML);
	ОбъектДанных = ФабрикаXDTO.ПрочитатьXML(Чтение);
	СвойстваОбъекта = ОбъектДанных.Свойства();
	СвойствоОшибка = СвойстваОбъекта.Получить("error");
	
	Если СвойствоОшибка <> Неопределено Тогда
		
		Ошибка = ОбъектДанных.error;
		
		Если ТипЗнч(Ошибка) = Тип("Строка") Тогда
			КодОшибки = "";
			Описание = Ошибка;
		Иначе
			КодОшибки = Ошибка.ErrorCode;
			Описание = Ошибка.ErrorMessage;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("При запросе данных из РИТМа, произошла ошибка(%1): %2", КодОшибки, Описание));
		Возврат;
		
	КонецЕсли;
	
	ТаблицаЗаказов = ВебСервисы_сервер.УниверсальныйПарсерXML(ОтветXML, "row");
	
	Если ТаблицаЗаказов.Колонки.Найти("контроль") = Неопределено Тогда
		ЕстьПолеКонтроль = Ложь;
	Иначе
		ЕстьПолеКонтроль = Истина;
	КонецЕсли;
	
	Если ТаблицаЗаказов.Колонки.Найти("комментарий_по_контролю") = Неопределено Тогда
		ЕстьПолеКомментарийПоКонтролю = Ложь;
	Иначе
		ЕстьПолеКомментарийПоКонтролю = Истина;
	КонецЕсли;
	
	Если ТаблицаЗаказов.Колонки.Найти("кто_установил_контрольное_значение") = Неопределено Тогда
		ЕстьПолеУстановилКонтрольноеЗначение = Ложь;
	Иначе
		ЕстьПолеУстановилКонтрольноеЗначение = Истина;
	КонецЕсли;
	
	Для каждого СтрокаСписка Из СтрокиАкцепта Цикл
	
		ПараметрыОтбора = Новый Структура();
		
		Если ПоискПоВагону И ЗначениеЗаполнено(СтрокаСписка.НомерВагона) Тогда
			ПараметрыОтбора.Вставить("вагон", СтрокаСписка.НомерВагона);
		КонецЕсли;
		
		Если ПоискПоКонтейнеру И ЗначениеЗаполнено(СтрокаСписка.НомерКонтейнера) Тогда
			ПараметрыОтбора.Вставить("контейнер", СтрокаСписка.НомерКонтейнера);
		КонецЕсли;
		
		Если ПоискПоНакладной И ЗначениеЗаполнено(СтрокаСписка.НомерНакладной) Тогда
			ПараметрыОтбора.Вставить("номер_накладной", СтрокаСписка.НомерНакладной);
		КонецЕсли;
		
		СтрокиПоНакладным = ТаблицаЗаказов.НайтиСтроки(ПараметрыОтбора);
		
		КоличествоСтрок = СтрокиПоНакладным.Количество();
		СтрокаСписка.ВсегоНакладныхВРитме = КоличествоСтрок;
		
		СтрокаСписка.НакладныхВЗаказахВРитме = 0;
		СтрокаСписка.НакладныхБезЗаказовВРитме = 0;
		
		СтрокаСписка.НомерНакладнойВРитме = "";
		СтрокаСписка.ДатаНакладнойВРитме = "";
		СтрокаСписка.НомерКонтейнераВРитме = "";
		СтрокаСписка.НомерВагонаВРитме = "";
		СтрокаСписка.ВесВРитме = 0;
		СтрокаСписка.СтанцияОтправленияВРитме = "";
		СтрокаСписка.СтанцияНазначенияВРитме = "";
		//СтрокаСписка.ПунктОтправленияВРитме = "";
		//СтрокаСписка.ПунктНазначенияВРитме = "";
		СтрокаСписка.ОхранаВРитме = "";
		СтрокаСписка.ГрузПоЕТСНГВРитме = "";
		СтрокаСписка.ИсточникНакладнойВРитме = "";
		СтрокаСписка.ДатаОтправленияГрузаВРитме = Неопределено;
		СтрокаСписка.ДатаРаскредитацииВРитме = Неопределено;
		СтрокаСписка.ОсновнойЗаказВРитме = "";
		СтрокаСписка.ОтветственныйПоОсновномуЗаказуВРитме = "";
		СтрокаСписка.ДополнительныеЗаказыВРитме = "";
		СтрокаСписка.КлиентВЗаказеВРитме = "";
		
		СтрокаСписка.Контроль = "";
		СтрокаСписка.КомментарийПоКонтролю = "";
		СтрокаСписка.УстановилКонтрольноеЗначение = "";
			
		Если КоличествоСтрок = 1 Тогда
			
			СтрокаПоНакладной = СтрокиПоНакладным[0];
			
			Если ЗначениеЗаполнено(СтрокаПоНакладной.основной_заказ) Тогда
				СтрокаСписка.НакладныхВЗаказахВРитме = 1;
				СтрокаСписка.НакладныхБезЗаказовВРитме = 0;
			Иначе
				СтрокаСписка.НакладныхВЗаказахВРитме = 0;
				СтрокаСписка.НакладныхБезЗаказовВРитме = 1;
			КонецЕсли;
			
			СтрокаСписка.НомерНакладнойВРитме = СтрокаПоНакладной.номер_накладной;
			СтрокаСписка.ДатаНакладнойВРитме = СтрокаПоНакладной.дата_накладной;
			СтрокаСписка.НомерКонтейнераВРитме = СтрокаПоНакладной.контейнер;
			СтрокаСписка.НомерВагонаВРитме = СтрокаПоНакладной.вагон;
			СтрокаСписка.ВесВРитме = СтрокаПоНакладной.вес;
			СтрокаСписка.СтанцияОтправленияВРитме = СтрокаПоНакладной.станция_отправления;
			СтрокаСписка.СтанцияНазначенияВРитме = СтрокаПоНакладной.станция_назначения;
			//СтрокаСписка.ПунктОтправленияВРитме = СтрокаПоНакладной.пункт_отправления;
			//СтрокаСписка.ПунктНазначенияВРитме = СтрокаПоНакладной.пункт_назначения;
			СтрокаСписка.ОхранаВРитме = СтрокаПоНакладной.охрана;
			СтрокаСписка.ГрузПоЕТСНГВРитме = СтрокаПоНакладной.груз_по_ЕТСНГ;
			СтрокаСписка.ИсточникНакладнойВРитме = СтрокаПоНакладной.источник_накладной;
			СтрокаСписка.ДатаОтправленияГрузаВРитме = СтрокаПоНакладной.дата_отправления_груза;
			СтрокаСписка.ДатаРаскредитацииВРитме = СтрокаПоНакладной.дата_раскредитации;
			СтрокаСписка.ОсновнойЗаказВРитме = СтрокаПоНакладной.основной_заказ;
			СтрокаСписка.ОтветственныйПоОсновномуЗаказуВРитме = СтрокаПоНакладной.ответственный_по_основному_заказу;
			СтрокаСписка.ДополнительныеЗаказыВРитме = СтрокаПоНакладной.дополнительные_заказы;
			СтрокаСписка.КлиентВЗаказеВРитме = СтрокаПоНакладной.клиент_в_заказе;
			Если ЕстьПолеКонтроль Тогда
				СтрокаСписка.Контроль = СтрокаПоНакладной.контроль;					
			Иначе
				СтрокаСписка.Контроль = "";					
			КонецЕсли;
			
			Если ЕстьПолеКомментарийПоКонтролю Тогда
			    СтрокаСписка.КомментарийПоКонтролю = СтрокаПоНакладной.комментарий_по_контролю;				
			Иначе
			    СтрокаСписка.КомментарийПоКонтролю = "";				
			КонецЕсли;
			
			Если  ЕстьПолеУстановилКонтрольноеЗначение Тогда
				СтрокаСписка.УстановилКонтрольноеЗначение = СтрокаПоНакладной.кто_установил_контрольное_значение;
			Иначе
				СтрокаСписка.УстановилКонтрольноеЗначение = "";
			КонецЕсли;
			
		ИначеЕсли КоличествоСтрок > 1 Тогда
			
			ДочерниеСтроки = СтрокаСписка.ПолучитьЭлементы();
			Для Каждого СтрокаПоНакладной Из СтрокиПоНакладным Цикл
				
				НоваяСтрока = ДочерниеСтроки.Добавить();
				НоваяСтрока.ВсегоНакладныхВРитме = 1;
				
				Если ЗначениеЗаполнено(СтрокаПоНакладной.основной_заказ) Тогда
					НоваяСтрока.НакладныхВЗаказахВРитме = 1;
					НоваяСтрока.НакладныхБезЗаказовВРитме = 0;
				Иначе
					НоваяСтрока.НакладныхВЗаказахВРитме = 0;
					НоваяСтрока.НакладныхБезЗаказовВРитме = 1;
				КонецЕсли;
				
				НоваяСтрока.НомерНакладнойВРитме = СтрокаПоНакладной.номер_накладной;
				НоваяСтрока.ДатаНакладнойВРитме = СтрокаПоНакладной.дата_накладной;
				НоваяСтрока.НомерКонтейнераВРитме = СтрокаПоНакладной.контейнер;
				НоваяСтрока.НомерВагонаВРитме = СтрокаПоНакладной.вагон;
				НоваяСтрока.ВесВРитме = СтрокаПоНакладной.вес;
				НоваяСтрока.СтанцияОтправленияВРитме = СтрокаПоНакладной.станция_отправления;
				НоваяСтрока.СтанцияНазначенияВРитме = СтрокаПоНакладной.станция_назначения;
				//НоваяСтрока.ПунктОтправленияВРитме = СтрокаПоНакладной.пункт_отправления;
				//НоваяСтрока.ПунктНазначенияВРитме = СтрокаПоНакладной.пункт_назначения;
				НоваяСтрока.ОхранаВРитме = СтрокаПоНакладной.охрана;
				НоваяСтрока.ГрузПоЕТСНГВРитме = СтрокаПоНакладной.груз_по_ЕТСНГ;
				НоваяСтрока.ИсточникНакладнойВРитме = СтрокаПоНакладной.источник_накладной;
				НоваяСтрока.ДатаОтправленияГрузаВРитме = СтрокаПоНакладной.дата_отправления_груза;
				НоваяСтрока.ДатаРаскредитацииВРитме = СтрокаПоНакладной.дата_раскредитации;
				НоваяСтрока.ОсновнойЗаказВРитме = СтрокаПоНакладной.основной_заказ;
				НоваяСтрока.ОтветственныйПоОсновномуЗаказуВРитме = СтрокаПоНакладной.ответственный_по_основному_заказу;
				НоваяСтрока.ДополнительныеЗаказыВРитме = СтрокаПоНакладной.дополнительные_заказы;
				НоваяСтрока.КлиентВЗаказеВРитме = СтрокаПоНакладной.клиент_в_заказе;
				
				Если ЕстьПолеКонтроль Тогда
					НоваяСтрока.Контроль = СтрокаПоНакладной.контроль;					
				Иначе
					НоваяСтрока.Контроль = "";					
				КонецЕсли;
				
				Если ЕстьПолеКомментарийПоКонтролю Тогда
				    НоваяСтрока.КомментарийПоКонтролю = СтрокаПоНакладной.комментарий_по_контролю;				
				Иначе
				    НоваяСтрока.КомментарийПоКонтролю = "";				
				КонецЕсли;
				
				Если  ЕстьПолеУстановилКонтрольноеЗначение Тогда
					НоваяСтрока.УстановилКонтрольноеЗначение = СтрокаПоНакладной.кто_установил_контрольное_значение;
				Иначе
					НоваяСтрока.УстановилКонтрольноеЗначение = "";
				КонецЕсли;
			
			КонецЦикла;
			
		КонецЕсли;
	
	КонецЦикла; 

КонецПроцедуры // НайтиЗаказыРитм()

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьТекстЗапросаВебСервису(ПараметрыЗапроса = Неопределено)
	
	Запись = Новый ЗаписьXML;
		
	Запись.УстановитьСтроку("windows-1251"); 
	Запись.ЗаписатьОбъявлениеXML();
	
	Запись.ЗаписатьНачалоЭлемента("root");
	
	Если ПараметрыЗапроса <> Неопределено Тогда
		Для Каждого Параметр Из ПараметрыЗапроса Цикл
			ЕСОбменСервер.ДобавитьЭлементВФайл(Запись, "R", "", Новый Структура("nmParams, valueParams", Параметр.ИмяПараметра, Параметр.ЗначениеПараметра));
		КонецЦикла;
	КонецЕсли;
	
	Запись.ЗаписатьКонецЭлемента();
	
	Возврат Запись.Закрыть();
	
КонецФункции

&НаКлиенте
Процедура НайтиСделкиЗаказы(Команда)
	
	НайтиСделкиЗаказыНаСервере();
	ЗаполнитьСписокСУчетомОтборов();
	
КонецПроцедуры

&НаКлиенте
Процедура АкцептПриИзменении(Элемент)
	ЗаполнитьПоАкцептуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("АдресТаблицыАкцепта", АдресТаблицыАкцепта);
	Параметры.Свойство("Акцепт", Акцепт);
	
	Если ЗначениеЗаполнено(АдресТаблицыАкцепта) Тогда	
		ЗаполнитьПоАкцептуНаСервере();	
	КонецЕсли;
	
	ОтборСтрокСписка = "ПоказыватьВсе";	
	ПоискПоКонтейнеру = Истина;
	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	СтрокиАкцепта = Список.ПолучитьЭлементы();
	Для Каждого СтрокаСписка Из СтрокиАкцепта Цикл
		СтрокаСписка.Отметка = Истина;
		ЗаполнитьСтрокуПолногоСписка(СтрокаСписка, "Отметка");
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеОтметки(Команда)
	
	СтрокиАкцепта = Список.ПолучитьЭлементы();
	Для Каждого СтрокаСписка Из СтрокиАкцепта Цикл
		СтрокаСписка.Отметка = Ложь;
		ЗаполнитьСтрокуПолногоСписка(СтрокаСписка, "Отметка");
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьСтрокиСЗаказамиВРитме(Команда)
	
	СтрокиАкцепта = Список.ПолучитьЭлементы();
	Для Каждого СтрокаСписка Из СтрокиАкцепта Цикл
		Если СтрокаСписка.НакладныхВЗаказахВРитме > 0 Тогда
			СтрокаСписка.Отметка = Истина;
			ЗаполнитьСтрокуПолногоСписка(СтрокаСписка, "Отметка");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкиСоСтрокБезЗаказовВРитме(Команда)
	
	СтрокиАкцепта = Список.ПолучитьЭлементы();
	Для Каждого СтрокаСписка Из СтрокиАкцепта Цикл
		Если СтрокаСписка.НакладныхВЗаказахВРитме = 0 И СтрокаСписка.КоличествоСделок > 0 Тогда
			СтрокаСписка.Отметка = Ложь;
			ЗаполнитьСтрокуПолногоСписка(СтрокаСписка, "Отметка");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресТаблицыАкцепта()
	
	ТаблицаАкцепта = Новый ТаблицаЗначений;
	ТаблицаАкцепта.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ТаблицаАкцепта.Колонки.Добавить("Отметка", Новый ОписаниеТипов("Число"));
	ТаблицаАкцепта.Колонки.Добавить("Контейнер", Новый ОписаниеТипов("СправочникСсылка.ТЕ"));
	ТаблицаАкцепта.Колонки.Добавить("Вагон", Новый ОписаниеТипов("СправочникСсылка.ТС"));
	ТаблицаАкцепта.Колонки.Добавить("Накладная", Новый ОписаниеТипов("ДокументСсылка.ТранспортныйДокумент"));
	
	СтрокиАкцепта = ПолныйСписок.ПолучитьЭлементы();
	Для каждого СтрокаСписка Из СтрокиАкцепта Цикл	
		НоваяСтрока = ТаблицаАкцепта.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСписка);
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаАкцепта, Новый УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ПеренестиВАкцепт(Команда)
	
	Закрыть(ПолучитьАдресТаблицыАкцепта());
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
	
		ЗаполнитьСтрокуПолногоСписка(ТекДанные);
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтрокуПолногоСписка(СтрокаСписка, Поля = Неопределено)

	Если Поля = Неопределено Тогда
		ИсключаемыеПоля = "НомерСтроки";
	Иначе
		ИсключаемыеПоля = Неопределено;
	КонецЕсли;
	
	СтрокиПолногоСписка = ПолныйСписок.ПолучитьЭлементы();
	Для каждого СтрокаПолногоСписка Из СтрокиПолногоСписка Цикл
	    Если СтрокаПолногоСписка.НомерСтроки = СтрокаСписка.НомерСтроки Тогда		
			ЗаполнитьЗначенияСвойств(СтрокаПолногоСписка, СтрокаСписка, Поля, ИсключаемыеПоля);		
		КонецЕсли; 	
	КонецЦикла; 

КонецПроцедуры
 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьСписокСУчетомОтборов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтрокСпискаПриИзменении(Элемент)
	
	ЗаполнитьСписокСУчетомОтборов();
	
КонецПроцедуры



