
//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	
	//Субботин 74357 13.10.2023 начало
	ИсточникиФормированияОбъекта = РегистрыСведений.ПротоколОбменов.ПолучитьУзлыОбменаОбъектаПротоколаОбмена(Объект.Ссылка, Перечисления.ДействияПриОбмене.ЗагрузкаДанных);
	Если ИсточникиФормированияОбъекта <> Неопределено тогда
		Если не РольДоступна("ПолныеПрава") Тогда 
			Этаформа.Доступность = Ложь;
			Элементы.ПредупреждениеРедактирования.Видимость = Истина; 
			Элементы.ПредупреждениеРедактирования.Заголовок = "Рейс заблокирован, поскольку был загружен из внешней системы. Редактирование документа ограничено!";
		КонецЕсли;	
	КонецЕсли;
	//Субботин 74357 13.10.2023 Конец	  
	
	// Евросиб US 111176 TA 111178 Рыбьяков К.А. 25.06.2025 ((
	Если Справочники.РейсыМоре.ПортНазначенияРоссийский(Объект.ПунктНазначения) Тогда
		Элементы.МорскойТерминалНазначения.ОтметкаНезаполненного = Истина;
		Элементы.МорскойТерминалНазначения.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 25.06.2025 ))
	
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

// Евросиб US 111176 TA 111178 Рыбьяков К.А. 25.06.2025 ((
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(Объект.МестоРазгрузки) И Справочники.РейсыМоре.ПортНазначенияРоссийский(Объект.ПунктНазначения) Тогда
		ТекстСообщения = НСтр("ru = 'В импортных рейсах необходимо заполнять терминал назначения.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "МестоРазгрузки", "Объект", Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Евросиб US 111176 TA 111178 Рыбьяков К.А. 30.07.2025 ((
	Результат = Справочники.РейсыМоре.ПроверитьПунктыНаПометкуУдаления(ТекущийОбъект.Ссылка);
	
	Если Результат.ПунктНазначенияПометкаУдаления Тогда
		ТекстСообщения = НСтр("ru = 'Порт назначения помечен на удаление. Элемент справочника не записан.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "ПунктНазначения", "Объект", Отказ);
	КонецЕсли;
	Если Результат.МестоРазгрузкиПометкаУдаления Тогда
		ТекстСообщения = НСтр("ru = 'Морской терминал помечен на удаление. Элемент справочника не записан.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "МестоРазгрузки", "Объект", Отказ);
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 30.07.2025 ))
КонецПроцедуры

// ДИТ US 81881 ТА 83783 Сержантова А.С. 19.04.2024
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("НеобходимоОбновитьФормуЗапросаНаАвто", , ЭтаФорма);	
КонецПроцедуры

// ДИТ US 84968 ТА 85270 Сержантова А.С. 20.05.2024
&НаКлиенте
Процедура СудноОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ВыбранноеЗначение) и ЭтоНеСудно(ВыбранноеЗначение) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выбранное транспортное средство не является судном!");
		ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.ТС.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

// ДИТ US 84968 ТА 85270 Сержантова А.С. 20.05.2024
Функция ЭтоНеСудно(ТранспортноеСредствоСсылка)   
	
	РезультатПроверки = Истина;

	ТипТС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТранспортноеСредствоСсылка, "ТипТС");
	Если ЗначениеЗаполнено(ТипТС) Тогда
		ЭтоТипоразмерСудна = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТипТС, "Судно");	
		РезультатПроверки = не ЭтоТипоразмерСудна;
	КонецЕсли;   
	Возврат РезультатПроверки;

КонецФункции 

// Евросиб(ДИТ) US 84968 ТА 85932 Сержантова А.С. 06.06.2024
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект) 
	//#Судно #НомерРейса #ПортОтправления (#МорскойТерминалОтправления) – #ПортНазначения (#МорскойТерминалНазначения) (Морской рейс)
	ЭтаФорма.Заголовок = "" + Объект.Судно + " " + Объект.НомерРейса + " " + Объект.МестоПогрузки + " (" + Объект.ПунктОтправления + ") - " 
							+ Объект.МестоРазгрузки + " (" + Объект.ПунктНазначения + ") (Морской рейс)"; 
	ЭтаФОрма.АвтоЗаголовок = Ложь;  
	
	// Евросиб(ДИТ) US 84968 ТА 85932 Сержантова А.С. Начало: 19.06.2024
	УстановитьУсловноеОформление();
	// Евросиб(ДИТ) US 84968 ТА 85932 Сержантова А.С. Конец: 19.06.2024
КонецПроцедуры 

// Евросиб(ДИТ) US 84968 ТА 85932 Сержантова А.С. 19.06.2024
&НаСервере
Процедура УстановитьУсловноеОформление()

	Если не ЗначениеЗаполнено(Объект.ПунктОтправления) Тогда
		Элементы.МорскойТерминалОтправления.Доступность = Ложь;
	Иначе
		Элементы.МорскойТерминалОтправления.Доступность = Истина;
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(Объект.ПунктНазначения) Тогда
		Элементы.МорскойТерминалНазначения.Доступность = Ложь;
	Иначе
		Элементы.МорскойТерминалНазначения.Доступность = Истина;
	КонецЕсли;

КонецПроцедуры

// Евросиб(ДИТ) US 84968 ТА 85932 Сержантова А.С. 19.06.2024
&НаКлиенте
Процедура СудноНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТипоразмерыСудна = ПолучитьВсеТипоразмерыСудна(); 
	ОткрытьФорму("Справочник.ТС.ФормаВыбора", Новый Структура("ТипТС, РежимВыбора", ТипоразмерыСудна, Истина),Элемент,); 
КонецПроцедуры  

// Евросиб(ДИТ) US 84968 ТА 85932 Сержантова А.С. 19.06.2024
&НаСервере
Функция ПолучитьВсеТипоразмерыСудна()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТипоразмерыТС.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТипоразмерыТС КАК ТипоразмерыТС
		|ГДЕ
		|	ТипоразмерыТС.Судно";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Результат = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;   
	
	Возврат Результат;

КонецФункции 

// Евросиб(ДИТ) US 84968 ТА 85932 Сержантова А.С. 19.06.2024
&НаКлиенте
Процедура ПунктОтправленияПриИзменении(Элемент)
	Если не ЗначениеЗаполнено(Объект.ПунктОтправления) Тогда
		Объект.МестоПогрузки = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");  
	ИначеЕсли ЗначениеЗаполнено(Объект.МестоПогрузки) и
		не ПолучитьПроверитьТерминалыПорта(Объект.ПунктОтправления, Объект.МестоПогрузки) Тогда
		Сообщить("Морской терминал отправления не соответствует порту отправления");
		Объект.МестоПогрузки = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка"); 
	КонецЕсли;   
	УстановитьУсловноеОформление();
КонецПроцедуры

// Евросиб(ДИТ) US 84968 ТА 85932 Сержантова А.С. 19.06.2024
&НаКлиенте
Процедура ПунктНазначенияПриИзменении(Элемент)
	Если не ЗначениеЗаполнено(Объект.ПунктНазначения) Тогда
		Объект.МестоРазгрузки = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
	ИначеЕсли ЗначениеЗаполнено(Объект.МестоРазгрузки) и
		не ПолучитьПроверитьТерминалыПорта(Объект.ПунктНазначения, Объект.МестоРазгрузки) Тогда
		Сообщить("Морской терминал назначения не соответствует порту назначения");
		Объект.МестоРазгрузки = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
	КонецЕсли;
	УстановитьУсловноеОформление();
КонецПроцедуры

// Евросиб(ДИТ) US 84968 ТА 85932 Сержантова А.С. 19.06.2024
&НаКлиенте
Процедура ТерминалНазначенияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Объект.ПунктНазначения) Тогда 
		Отбор = Новый Структура("СписокЛокаций", ПолучитьПроверитьТерминалыПорта(Объект.ПунктНазначения)); 
		ОтборЛокаций = Новый Структура("Отбор", Отбор);
		ОткрытьФорму("Справочник.Локации.ФормаВыбора", ОтборЛокаций, Элемент);  
	КонецЕсли;
КонецПроцедуры

// Евросиб(ДИТ) US 84968 ТА 85932 Сержантова А.С. 19.06.2024
&НаКлиенте
Процедура ТерминалОтправленияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Объект.ПунктОтправления) Тогда 
		Отбор = Новый Структура("СписокЛокаций", ПолучитьПроверитьТерминалыПорта(Объект.ПунктОтправления)); 
		ОтборЛокаций = Новый Структура("Отбор", Отбор);
		ОткрытьФорму("Справочник.Локации.ФормаВыбора", ОтборЛокаций, Элемент);  
	КонецЕсли;
КонецПроцедуры  

// Евросиб(ДИТ) US 84968 ТА 85932 Сержантова А.С. 19.06.2024
Функция ПолучитьПроверитьТерминалыПорта(Порт, Терминал = Неопределено)  
	
	Результат = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГоризонтальныеСвязиЛокаций.Терминал КАК Терминал
		|ИЗ
		|	РегистрСведений.ГоризонтальныеСвязиЛокаций КАК ГоризонтальныеСвязиЛокаций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Локации КАК Локации
		|		ПО ГоризонтальныеСвязиЛокаций.Терминал = Локации.Ссылка
		|ГДЕ
		|	ГоризонтальныеСвязиЛокаций.Порт = &Порт 
		|	И Локации.Ссылка = &Терминал
		|	И Локации.ТипПодрядчика = &ТипПодрядчика
		|	И Локации.Тип = &Тип";
	
	Запрос.УстановитьПараметр("Порт", Порт);
	Запрос.УстановитьПараметр("Тип", Справочники.ТипыЛокаций.Терминал);
	Запрос.УстановитьПараметр("ТипПодрядчика", Перечисления.ТипПодрядчикаТерминал.Порт); 
	
	Если Терминал <> Неопределено Тогда
	    Запрос.УстановитьПараметр("Терминал", Терминал); 
	Иначе	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Локации.Ссылка = &Терминал", ""); 
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Если Терминал <> Неопределено Тогда
		Если РезультатЗапроса.Пустой() Тогда
			Возврат Ложь;
		Иначе	
			Возврат Истина;
		КонецЕсли;
	Иначе
		Если не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				Результат.Добавить(Выборка.Терминал);
			КонецЦикла;
		КонецЕсли;   
		Возврат Результат;
	КонецЕсли;
	
КонецФункции 

// Евросиб(ДИТ) US 84968 ТА 85932 Сержантова А.С. 19.06.2024
&НаКлиенте
Процедура ТерминалОтправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ВыбранноеЗначение) и не ПолучитьПроверитьТерминалыПорта(Объект.ПунктОтправления,ВыбранноеЗначение) Тогда
		СтандартнаяОбработка = Ложь;
		Сообщить("Выбранный терминал не подходит по условиям подбора (не связан с портом отправления, не имеет тип терминал и тип подрядчика порт)");  
		ВыбранноеЗначение = Неопределено;
	КонецЕсли;
КонецПроцедуры

// Евросиб(ДИТ) US 84968 ТА 85932 Сержантова А.С. 19.06.2024
&НаКлиенте
Процедура ТерминалНазначенияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ВыбранноеЗначение) и не ПолучитьПроверитьТерминалыПорта(Объект.ПунктНазначения,ВыбранноеЗначение) Тогда
		СтандартнаяОбработка = Ложь;
		Сообщить("Выбранный терминал не подходит по условиям подбора (не связан с портом назначения, не имеет тип терминал и тип подрядчика порт)");  
		ВыбранноеЗначение = Неопределено;
	КонецЕсли;
КонецПроцедуры

// Евросиб US 111176 TA 111178 Рыбьяков К.А. 25.06.2025 ((
Функция ПортНазначенияРоссийский(ПортНазначения)
	
	Результат = Ложь;
	
	Если ЗначениеЗаполнено(ПортНазначения) Тогда
		Страна = Неопределено;
		ЛокацияВышестоящегоУровня = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПортНазначения, "ЛокацияВышестоящегоУровня");
		ТипЛокацииВышестоящегоУровня = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЛокацияВышестоящегоУровня, "Тип");
		Пока ЗначениеЗаполнено(ЛокацияВышестоящегоУровня) Цикл
			Если ТипЛокацииВышестоящегоУровня = Справочники.ТипыЛокаций.Страна И Страна = Неопределено Тогда
				Страна = ЛокацияВышестоящегоУровня;
			КонецЕсли;
			ЛокацияВышестоящегоУровня = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЛокацияВышестоящегоУровня, "ЛокацияВышестоящегоУровня");
			ТипЛокацииВышестоящегоУровня = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЛокацияВышестоящегоУровня, "Тип");
		КонецЦикла;
		Если Страна = Справочники.Локации.РОССИЯ Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // Евросиб Рыбьяков К.А. 25.06.2025 ))

