
&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ИзменитьРССервер();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ИзменитьРССервер()

    НаборЗаписей = РегистрыСведений.ОшибкиЗагрузкиЭТРАН.СоздатьНаборЗаписей();    
    НаборЗаписей.Отбор.Ознакомлен.Установить(Ложь);
    НаборЗаписей.Прочитать();
    МенеджерЗаписи = РегистрыСведений.ОшибкиЗагрузкиЭТРАН.СоздатьМенеджерЗаписи();
    
    Для Каждого ТекЗапись Из НаборЗаписей Цикл
        ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ТекЗапись);
        МенеджерЗаписи.Прочитать();
        МенеджерЗаписи.Ознакомлен = Истина;
        МенеджерЗаписи.ОзнакомленПользователь = ПараметрыСеанса.ТекущийПользователь;
        МенеджерЗаписи.Записать();
    КонецЦикла;	
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )
