
&НаСервере
Функция ПолучитьМассивПФ_Описи(ВыделенныеСтр)
	МассивПФ = Новый Массив;
	Счетчик = 0;
	Для каждого Стр Из ВыделенныеСтр Цикл
		Счетчик = Счетчик + 1;
	    ИмяПФ = ""+Счетчик+".1. Почтовая опись: "+Стр.Наименование;
		ТабДок = Справочники.ПакетыДокументов.ПечатьПочтоваяОпись(Стр);	
		СтруктураПФ = Новый Структура;
		СтруктураПФ.Вставить("ИмяПФ",ИмяПФ);
		СтруктураПФ.Вставить("ТабДок",ТабДок);
		СтруктураПФ.Вставить("Ссылка",Стр);
		МассивПФ.Добавить(СтруктураПФ);

		Счетчик = Счетчик + 1;
	    ИмяПФ = ""+Счетчик+".2. Сопроводительное письмо: "+Стр.Наименование;
		ТабДок = Справочники.ПакетыДокументов.ПечатьСопроводительноеПисьмо(Стр);	
		СтруктураПФ = Новый Структура;
		СтруктураПФ.Вставить("ИмяПФ",ИмяПФ);
		СтруктураПФ.Вставить("ТабДок",ТабДок);
		СтруктураПФ.Вставить("Ссылка",Стр);
		МассивПФ.Добавить(СтруктураПФ);
	КонецЦикла;
	
	Возврат МассивПФ;
КонецФункции

&НаКлиенте
Процедура ГрупповаяПечатьОписи(Команда)
	// Вставить содержимое обработчика.
	ВыделенныеСтр = Элементы.Список.ВыделенныеСтроки;
	МассивПФ = ПолучитьМассивПФ_Описи(ВыделенныеСтр); 
	
	ПараметрКоманды = Новый Массив;
	//Для Каждого Строка Из ВыделенныеСтр Цикл
	//	ПараметрКоманды.Добавить(Строка.Ссылка);
	//КонецЦикла;
	ОбластиОбъектов = Новый СписокЗначений;
		
	КоллекцияПечатныхФорм = Новый Массив;
	Поля = УправлениеПечатьюКлиентСервер.ИменаПолейКоллекцииПечатныхФорм();
	ДобавленныеПечатныеФормы = Новый Соответствие;
	
	Для Каждого СтруктураПФ Из МассивПФ Цикл
		ПараметрКоманды.Добавить(СтруктураПФ.Ссылка);
		ДобавленныеПечатныеФормы = Новый Соответствие;
		ПечатнаяФорма = Новый Структура(СтрСоединить(Поля, ","));
		ПечатнаяФорма.ИмяМакета = СтруктураПФ.ИмяПФ;
		ПечатнаяФорма.ИмяВРЕГ = ВРег(СтруктураПФ.ИмяПФ);
		ПечатнаяФорма.СинонимМакета = СтруктураПФ.ИмяПФ;
		ПечатнаяФорма.ТабличныйДокумент = СтруктураПФ.ТабДок;
		ПечатнаяФорма.ИмяФайлаПечатнойФормы = СтруктураПФ.ИмяПФ;
		ПечатнаяФорма.Экземпляров = 1;
		ПечатнаяФорма.ЭкземпляровПредустановленное = 2;
		//ПечатнаяФорма.СсылкаДок = СтруктураПФ.СсылкаДок;
		ДобавленныеПечатныеФормы.Вставить(СтруктураПФ.ИмяПФ, ПечатнаяФорма);
		КоллекцияПечатныхФорм.Добавить(ПечатнаяФорма);
	КонецЦикла;
	
	Если КоллекцияПечатныхФорм.Количество() <> 0 Тогда
		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияпечатныхФорм,ОбластиОбъектов,,ПараметрКоманды);
	КонецЕсли;
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

