
//БСП создание письма не использовал, т.к по результату выполнения нужна ссылка
//Функция СоздатьПисьмоУведомление(Получатель = Неопределено, ПочтаПолучателя = Неопределено, Тема, ТипТекста, Текст = Неопределено,
//									ПолучательКопии = Неопределено, ПочтаПолучателяКопии = Неопределено,) Экспорт
Функция СоздатьПисьмоУведомление(МассивПолучателей, Тема, ТипТекста, Текст = Неопределено, МассивПолучателейКопии = Неопределено, ВыполнениеЗадач = Ложь) Экспорт
	
	НовоеПисьмо = Документы.ЭлектронноеПисьмоИсходящее.СоздатьДокумент();
		//Евросиб СубботинВ #104841 07.05.2025 Начало
	Если ВыполнениеЗадач Тогда
		УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.УчетнаяЗаписьДляРассылкиЗадач;
	Иначе
		УчетнаяЗапись = УправлениеЭлектроннойПочтой.ПолучитьУчетнуюЗаписьДляОтправкиПоУмолчанию();		
	КонецЕсли;
	//Евросиб СубботинВ #104841 07.05.2025 Конец
	
		
	НовоеПисьмо.ТипТекста = ТипТекста;
	
	Если ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст Тогда
		НовоеПисьмо.Текст = Текст;
	Иначе
		НовоеПисьмо.ТекстHTML = Текст;
	КонецЕсли;
	
	НовоеПисьмо.Тема = Тема; 
	НовоеПисьмо.СтатусПисьма = Перечисления.СтатусыИсходящегоЭлектронногоПисьма.Исходящее;
	НовоеПисьмо.УчетнаяЗапись = УчетнаяЗапись;
	НовоеПисьмо.Дата = ТекущаяДата();
	НовоеПисьмо.ДатаОтправления = ТекущаяДата();
	НовоеПисьмо.ОтправительПредставление =  УчетнаяЗапись.ИмяПользователя;
	НовоеПисьмо.УдалятьПослеОтправки = Ложь;
	
	//Евросиб СубботинВ #104841 07.05.2025 Конец
	Если ТипЗнч(МассивПолучателей) = Тип("Массив") Тогда
		
		//Евросиб СубботинВ #104218 13.03.2025 Начало
		ВидыСправочнойИнформации = Новый Массив;
		ВидыСправочнойИнформации.Добавить(Справочники.ВидыКонтактнойИнформации.EmailПользователя);
		
		ПочтыПолучателейПисьма = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(МассивПолучателей,, ВидыСправочнойИнформации);
		
		//Евросиб СубботинВ #105221 19.03.2025 Начало
		
		//ДобавитьПолучатель = НовоеПисьмо.ПолучателиПисьма.Добавить();
		//ДобавитьПолучатель.Адрес = ПочтаПолучателя;
		//ДобавитьПолучатель.Представление = Получатель;
		Для Каждого ПолучательПисьма из ПочтыПолучателейПисьма Цикл 
			ДобавитьПолучателя = НовоеПисьмо.ПолучателиПисьма.Добавить();
			ДобавитьПолучателя.Адрес = ПолучательПисьма.Представление;
			ДобавитьПолучателя.Представление = ПолучательПисьма.Объект;
		КонецЦикла;
	ИначеЕсли ТипЗнч(МассивПолучателей) = Тип("Строка") Тогда
		МассивФИОПочтаПоПользователю = СтрРазделить(МассивПолучателей," ");
		Почта = МассивФИОПочтаПоПользователю[МассивФИОПочтаПоПользователю.Количество()-1];
		Почта = СтрЗаменить(Почта,"<","");
		Почта = СтрЗаменить(Почта,">","");
		ДобавитьПолучателя = НовоеПисьмо.ПолучателиПисьма.Добавить();
		ДобавитьПолучателя.Адрес = Почта;
	КонецЕсли;	
		
	//Евросиб СубботинВ #104841 07.05.2025 Конец

	
	//Если ЗначениеЗаполнено(ПолучательКопии) и ЗначениеЗаполнено(ПочтаПолучателяКопии) Тогда
	//	ДобавитьПолучателяКопии = НовоеПисьмо.ПолучателиКопий.Добавить();
	//	ДобавитьПолучателяКопии.Адрес = ПочтаПолучателяКопии; 
	//	ДобавитьПолучателяКопии.Представление = ПолучательКопии;
	//КонецЕсли;
	Если НЕ МассивПолучателейКопии = Неопределено и МассивПолучателейКопии.Количество()>0 Тогда 
		ПочтыПолучателейКопииПисьма = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(МассивПолучателейКопии,, ВидыСправочнойИнформации);
		Для Каждого ПолучательКопии из ПочтыПолучателейКопииПисьма Цикл 
			ДобавитьПолучателяКопии = НовоеПисьмо.ПолучателиКопий.Добавить();
			ДобавитьПолучателяКопии.Адрес = ПолучательКопии.Представление;
			ДобавитьПолучателяКопии.Представление = ПолучательКопии.Объект;
		КонецЦикла;
	КонецЕсли; 
	//Евросиб СубботинВ #104218 13.03.2025 Конец
	
	Попытка	
		НовоеПисьмо.Записать();
	Исключение
		ТекстОшибки = ОписаниеОшибки(); 
		//Евросиб СубботинВ #104218 13.03.2025 Начало //перевел на универсальный формат
		//ЗаписьЖурналаРегистрации("Ошибка отправки уведомлений о выставлении РТУ по доп. услугам", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ЗаписьЖурналаРегистрации("Ошибка отправки уведомления: " + Тема, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		//Евросиб СубботинВ #104218 13.03.2025 Конец
		Возврат Документы.ЭлектронноеПисьмоИсходящее.ПустаяСсылка();
	КонецПопытки;
	
	Возврат НовоеПисьмо.Ссылка;

КонецФункции 

Функция СформироватьТекстШапкиСообщенияУведомленияСозданиеРТУ(ДанныеЗаполнения)
		 
	ТекстПисьма = СтрШаблон("<p>Обращаем Ваше внимание, что %1 клиенту %2 по договору %3 оформлены документы по дополнительным услугам</p>",
				  ДанныеЗаполнения.Документ.Создано, ДанныеЗаполнения.Контрагент, ДанныеЗаполнения.Договор);
	
	ТекстПисьма = ТекстПисьма + Символы.ПС + "<table border=""1""><tbody><th>Сделка/Заказ</th><th>Номер/Дата документа</th>
	|<th>Сумма </th><th>Валюта</th><th>Услуга</th>";
	
	Возврат ТекстПисьма	
	
КонецФункции

//Евросиб(ДИТ), Беляев СЮ, US 111184 / TA 111245, 11-06-2025, начало
Функция СформироватьТекстШапкиСообщенияУведомленияСозданиеРТУ_Премия(ДанныеЗаполнения)
	
	ТекстПисьма = СтрШаблон("<p>Обращаем Ваше внимание, что %1 клиенту %2 по договору %3 оформлены документы по премиям</p>",
				  ДанныеЗаполнения.Документ.Создано, ДанныеЗаполнения.Контрагент, ДанныеЗаполнения.Договор);
	
	ТекстПисьма = ТекстПисьма + Символы.ПС + "<table border=""1""><tbody><th>Сделка/Заказ</th><th>Номер/Дата документа</th>
	|<th>Сумма </th><th>Валюта</th><th>Услуга</th>";
	
	Возврат ТекстПисьма
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 111184 / TA 111245, 11-06-2025, конец

Функция СформироватьТекстСтрокиСообщенияУведомленияРТУ(ДанныеЗаполнения)
		 
	ТекстПисьма = Символы.ПС + "<tr>";
	ТекстПисьма = ТекстПисьма + "<td>" + ДанныеЗаполнения.Сделка.Номер + "/" + СтрЗаменить(Год(ДанныеЗаполнения.Сделка.Дата),Символы.НПП,"") +"г"+ "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + ДанныеЗаполнения.Документ.Номер + "/" + Формат(ДанныеЗаполнения.Документ.ДатаДокумента,"ДФ=dd.MM.yyyy") + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + ДанныеЗаполнения.Документ.СуммаДокумента + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + ДанныеЗаполнения.Документ.ВалютаДокумента + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + ДанныеЗаполнения.Услуга + "</td>";
	ТекстПисьма = ТекстПисьма + "</tr>";    
		
	Возврат ТекстПисьма	
	
КонецФункции	

Процедура ДобавитьЗаписьПоРассылкеДокументов(Источник, Письмо) Экспорт
	
	РегистрыСведений.РассылкаПоДокументам.ДобавитьЗапись(Источник, Письмо);
		
КонецПроцедуры

//Функция СформироватьЗаписиСобытийИзменений(Документ, Событие, ДатаДокумента, ОтправкаПисьма = Ложь) Экспорт
//Евросиб(ДИТ), Беляев СЮ, BUG 92593 / TA 92595, 07-10-2024, добавил параметр "Подписант"
Функция СформироватьЗаписиСобытийИзменений(Документ, Событие, ДатаДокумента = Неопределено, ОтправкаПисьма = Ложь, Подписант = Неопределено, ЦиклРаботы = Неопределено) Экспорт
	
	НовоеСобытие = Справочники.КлючевыеПоляСобытийОтправкиДокументов.СоздатьЭлемент();
	//Евросиб СубботинВ #102687 20.02.2025 Начало
	Гуид = Новый УникальныйИдентификатор();
	НоваяСсылка = Справочники.КлючевыеПоляСобытийОтправкиДокументов.ПолучитьСсылку(Гуид);
	НовоеСобытие.УстановитьСсылкуНового(НоваяСсылка);
	НовоеСобытие.Наименование = Гуид;
	//Евросиб СубботинВ #102687 20.02.2025 Конец
    НовоеСобытие.Документ = Документ;
	НовоеСобытие.ДатаДокумента = ДатаДокумента;
	НовоеСобытие.НеОтравлятьПисьмо = ОтправкаПисьма;
	НовоеСобытие.Событие = Событие; 
	//Евросиб(ДИТ), Беляев СЮ, BUG 92593 / TA 92595, 07-10-2024, начало
	НовоеСобытие.Подписант = Подписант;
	//Евросиб(ДИТ), Беляев СЮ, BUG 92593 / TA 92595, 07-10-2024, конец
	//Евросиб СубботинВ #102687 14.02.2025 Начало// 
	Если НЕ ЦиклРаботы = Неопределено тогда
		НовоеСобытие.Цикл = ЦиклРаботы;
	КонецЕсли;	
	//Евросиб СубботинВ #102687 14.02.2025 Конец// 
	НовоеСобытие.Записать(); 
	Возврат НовоеСобытие.Ссылка;
	
КонецФункции

Процедура ОтправитьУведомленияПоНеотправленнымДокументам() Экспорт
	
	
	СпискиДокументовИСобытий = ПолучитьСписокДокументов(); 
	
	СоздатьКлючевыеПоляСобытийОтправкиДокументов(СпискиДокументовИСобытий);
	
	СозданиеНеотправленныхПисем();
	
	//Евросиб СубботинВ #102687 14.02.2025 Начало
	//СформироватьПисьмаПоВыводуИзОперирования();
    //Евросиб СубботинВ #102687 14.02.2025 Конец

	
КонецПроцедуры	

Функция ПолучитьСписокДокументов() Экспорт 
	
	Запрос = Новый Запрос; 
	Запрос.Текст = ""; 
	
	//Евросиб СубботинВ #129659 04.02.2026 Начало//
	
	//		В рамках задачи начал оптимизацию кода, каждый запрос перенесен в отдельную процедуру,
	//		вместе с параметрами, которые необходимы для основного собранного запроса
	
	//Евросиб СубботинВ #129659 04.02.2026 Конец//

	
	МассивТекстовЗапросов = новый Массив;
	
	Если Справочники.СобытияОтправкиДокументов.СозданиеДокумента.ОтправкаПисемПоСобытию Тогда		
		ДобавитьТекстЗапросаСозданиеДокументов(МассивТекстовЗапросов, Запрос);	   
	КонецЕсли; 
	
	//Если Справочники.СобытияОтправкиДокументов.ИзменениеДатыРТУ.ОтправкаПисемПоСобытию Тогда
    	//ДобавитьТекстЗапросаИзменениеДатыРТУ(МассивТекстовЗапросов, Запрос)
    //КонецЕсли;
	
	Если Справочники.СобытияОтправкиДокументов.ОтказаноВПодписиДиадок.ОтправкаПисемПоСобытию Тогда		
		ДобавитьТекстЗапросаОтказаноВПодписиДиадок(МассивТекстовЗапросов, Запрос);
	КонецЕсли;
	
	//Евросиб СубботинВ #89527 30.10.2024 Начало// рассылка уведомлений по отклонению заявок
	Если Справочники.СобытияОтправкиДокументов.ОтклонениеЗаявкиНаОплатуВУПП.ОтправкаПисемПоСобытию Тогда		
		ДобавитьТекстЗапросаОтклонениеЗаявкиНаОплатуВУПП(МассивТекстовЗапросов, Запрос);
	КонецЕсли;
	
	// рассылка уведомлений по не согласованию реестра
	Если Справочники.СобытияОтправкиДокументов.НеСогласованРеестрПлатежей.ОтправкаПисемПоСобытию Тогда		
		ДобавитьТекстЗапросаНеСогласованРеестрПлатежей(МассивТекстовЗапросов, Запрос);
	КонецЕсли;
	
	// рассылка уведомлений по не утверждению реестра	
	Если Справочники.СобытияОтправкиДокументов.НеУтвержденРеестрПлатежей.ОтправкаПисемПоСобытию Тогда 		
		ДобавитьТекстЗапросаНеУтвержденРеестрПлатежей(МассивТекстовЗапросов, Запрос);		
	КонецЕсли;
	
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0382126, 15-01-2025, начало
	Если Справочники.СобытияОтправкиДокументов.ТребуетсяАннулирование.ОтправкаПисемПоСобытию Тогда 
		ДобавитьТекстЗапросаТребуетсяАннулирование(МассивТекстовЗапросов, Запрос);
	КонецЕсли; 
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0382126, 15-01-2025, конец

	//Евросиб СубботинВ #89527 30.10.2024 Конец
	
	//Евросиб СубботинВ #102687 14.02.2025 Начало // рассылка по выводу ктк из оперирования
	Если Справочники.СобытияОтправкиДокументов.ВыводКткИзОперирования.ОтправкаПисемПоСобытию Тогда
	    ДобавитьТекстЗапросаВыводКткИзОперирования(МассивТекстовЗапросов, Запрос);
	КонецЕсли;
	//Евросиб СубботинВ #102687 14.02.2025 Конец
	
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0389212, 30-06-2025, начало
	Если Справочники.СобытияОтправкиДокументов.ТребуетсяУточнениеДиадок.ОтправкаПисемПоСобытию Тогда 
		ДобавитьТекстЗапросаТребуетсяУточнениеДиадок(МассивТекстовЗапросов, Запрос);
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0389212, 30-06-2025, конец
	
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0389212, 30-06-2025, начало
	Если Справочники.СобытияОтправкиДокументов.ОтказаноВАннулированииДиадок.ОтправкаПисемПоСобытию Тогда 
		ДобавитьТекстЗапросаОтказаноВАннулированииДиадок(МассивТекстовЗапросов, Запрос);
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0389212, 30-06-2025, конец

	Если МассивТекстовЗапросов.Количество()> 0 Тогда
		Запрос.Текст = СтрСоединить(МассивТекстовЗапросов, " ОБЪЕДИНИТЬ ВСЕ ");
		Возврат Запрос.Выполнить().Выгрузить();		
	ИначеЕсли МассивТекстовЗапросов.Количество()= 0
		и (Справочники.СобытияОтправкиДокументов.ВыводКткИзОперирования.ОтправкаПисемПоСобытию
		или Справочники.СобытияОтправкиДокументов.ОшибкаПередачиЗаявкиВУПП.ОтправкаПисемПоСобытию) Тогда
		ТЗ = Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("Алгоритм");
		Возврат ТЗ
	Иначе ВызватьИсключение("Нет включенных для обработки событий");	
	КонецЕсли;
	
	
КонецФункции

Процедура СоздатьКлючевыеПоляСобытийОтправкиДокументов(СпискиДокументовИСобытий, НеОтправлятьПисьма = Ложь) Экспорт  
	
	ТЗСтрокДокументов = СпискиДокументовИСобытий;
	Отбор = Новый Структура();
	Отбор.Вставить("Алгоритм", Справочники.СобытияОтправкиДокументов.СозданиеДокумента);
	СпискиДокументовСоздание = ТЗСтрокДокументов.Скопировать(Отбор);	
	Если СпискиДокументовСоздание.Количество() >0 Тогда 	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ 
		|	РтуСобытиеСоздания.Ссылка КАК РТУ,
		|	РтуСобытиеСоздания.ДатаДокумента КАК ДатаДокумента,
		|	РтуСобытиеСоздания.Алгоритм КАК Событие
		//Евросиб СубботинВ #102687 14.02.2025 Начало//
		|	,РтуСобытиеСоздания.ЦиклРаботыСДокументом КАК Цикл
		//Евросиб СубботинВ #102687 14.02.2025 Конец// 
		|ПОМЕСТИТЬ ВТ_СозданиеРТУ
		|ИЗ
		|	&РтуСобытиеСоздания КАК РтуСобытиеСоздания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СозданиеРТУ.РТУ КАК РТУ,
		|	ВТ_СозданиеРТУ.ДатаДокумента КАК ДатаДокумента,
		|	ВТ_СозданиеРТУ.Событие КАК Событие
		|ИЗ
		|	ВТ_СозданиеРТУ КАК ВТ_СозданиеРТУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючевыеПоляСобытийОтправкиДокументов КАК КлючевыеПоляСобытийОтправкиДокументов
		|		ПО ВТ_СозданиеРТУ.РТУ = КлючевыеПоляСобытийОтправкиДокументов.Документ
		|			И ВТ_СозданиеРТУ.Событие = КлючевыеПоляСобытийОтправкиДокументов.Событие 
		//Евросиб СубботинВ #102687 14.02.2025 Начало//
		|           И ВТ_СозданиеРТУ.Цикл = КлючевыеПоляСобытийОтправкиДокументов.Цикл
		//Евросиб СубботинВ #102687 14.02.2025 Конец//
		|			И (НЕ КлючевыеПоляСобытийОтправкиДокументов.ПометкаУдаления)
		|ГДЕ
		|	КлючевыеПоляСобытийОтправкиДокументов.Ссылка ЕСТЬ NULL";
		Запрос.УстановитьПараметр("РтуСобытиеСоздания", СпискиДокументовСоздание);	
		РезультатЗапроса = Запрос.Выполнить();
		ОтправкаДокументовПоСобытиюСоздания = РезультатЗапроса.Выгрузить(); 
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СформироватьЗаписиСобытийИзменений(ВыборкаДетальныеЗаписи.РТУ, ВыборкаДетальныеЗаписи.Событие, ВыборкаДетальныеЗаписи.ДатаДокумента, НеОтправлятьПисьма);
		КонецЦикла;
	КонецЕсли;
	
	//Отбор = Новый Структура();
	//Отбор.Вставить("Алгоритм", Справочники.СобытияОтправкиДокументов.ИзменениеДатыРТУ);
	//СпискиДокументовИзменениеДаты = ТЗСтрокДокументов.Скопировать(Отбор);	
	//
	//Если СпискиДокументовИзменениеДаты.Количество() > 0 Тогда 		
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	РтуСобытиеИзменениеДаты.Ссылка КАК РТУ,
	//	|	РтуСобытиеИзменениеДаты.ДатаДокумента КАК ДатаДокумента,
	//	|	РтуСобытиеИзменениеДаты.Алгоритм КАК Событие
	//	|ПОМЕСТИТЬ ВТ_ИзменениеДаты
	//	|ИЗ
	//	|	&РтуСобытиеИзменениеДаты КАК РтуСобытиеИзменениеДаты
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ВТ_ИзменениеДаты.РТУ КАК РТУ,
	//	|	ВТ_ИзменениеДаты.ДатаДокумента КАК ДатаДокумента,
	//	|	ВТ_ИзменениеДаты.Событие КАК Событие
	//	|ИЗ
	//	|	ВТ_ИзменениеДаты КАК ВТ_ИзменениеДаты
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючевыеПоляСобытийОтправкиДокументов КАК КлючевыеПоляСобытийОтправкиДокументов
	//	|		ПО ВТ_ИзменениеДаты.РТУ = КлючевыеПоляСобытийОтправкиДокументов.Документ
	//	|			И ВТ_ИзменениеДаты.ДатаДокумента = КлючевыеПоляСобытийОтправкиДокументов.ДатаДокумента
	//	|			И ВТ_ИзменениеДаты.Событие = КлючевыеПоляСобытийОтправкиДокументов.Событие
	//	|			И (НЕ КлючевыеПоляСобытийОтправкиДокументов.ПометкаУдаления)
	//	|ГДЕ
	//	|	КлючевыеПоляСобытийОтправкиДокументов.Ссылка ЕСТЬ NULL";
	//	Запрос.УстановитьПараметр("РтуСобытиеИзменениеДаты", СпискиДокументовИзменениеДаты);	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
	//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//		СформироватьЗаписиСобытийИзменений(ВыборкаДетальныеЗаписи.РТУ, ВыборкаДетальныеЗаписи.Событие, ВыборкаДетальныеЗаписи.ДатаДокумента);	
	//	КонецЦикла;
	//КонецЕсли;
	
	Отбор = Новый Структура();
	Отбор.Вставить("Алгоритм", Справочники.СобытияОтправкиДокументов.ОтказаноВПодписиДиадок);
	СпискиДокументовОтказПодписиДиадок = ТЗСтрокДокументов.Скопировать(Отбор);	
	
	Если СпискиДокументовОтказПодписиДиадок.Количество() > 0 Тогда 		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыОтказВПодписи.Ссылка КАК ДокументДиадок,
		|	ДокументыОтказВПодписи.ДатаДокумента КАК ДатаДокумента,
		|	ДокументыОтказВПодписи.Алгоритм КАК Событие
		//Евросиб(ДИТ), Беляев СЮ, BUG 92593 / TA 92595, 07-10-2024, начало
		|	,ДокументыОтказВПодписи.Подписант КАК Подписант
		//Евросиб(ДИТ), Беляев СЮ, BUG 92593 / TA 92595, 07-10-2024, конец
		//Евросиб СубботинВ #102687 14.02.2025 Начало//
		|	,ДокументыОтказВПодписи.ЦиклРаботыСДокументом КАК Цикл
		//Евросиб СубботинВ #102687 14.02.2025 Конец//
		|ПОМЕСТИТЬ ВТ_ОтказВПодписи
		|ИЗ
		|	&СпискиДокументовОтказПодписиДиадок КАК ДокументыОтказВПодписи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ОтказВПодписи.ДокументДиадок КАК Документ,
		|	ВТ_ОтказВПодписи.ДатаДокумента КАК ДатаДокумента,
		|	ВТ_ОтказВПодписи.Событие КАК Событие
		//Евросиб(ДИТ), Беляев СЮ, BUG 92593 / TA 92595, 07-10-2024, начало
		|	,ВТ_ОтказВПодписи.Подписант КАК Подписант
		//Евросиб(ДИТ), Беляев СЮ, BUG 92593 / TA 92595, 07-10-2024, конец
		|ИЗ
		|	ВТ_ОтказВПодписи КАК ВТ_ОтказВПодписи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючевыеПоляСобытийОтправкиДокументов КАК КлючевыеПоляСобытийОтправкиДокументов
		|		ПО ВТ_ОтказВПодписи.ДокументДиадок = КлючевыеПоляСобытийОтправкиДокументов.Документ
		|			И ВТ_ОтказВПодписи.ДатаДокумента = КлючевыеПоляСобытийОтправкиДокументов.ДатаДокумента
		|			И ВТ_ОтказВПодписи.Событие = КлючевыеПоляСобытийОтправкиДокументов.Событие
		//Евросиб СубботинВ #102687 14.02.2025 Начало//
		|           И ВТ_ОтказВПодписи.Цикл = КлючевыеПоляСобытийОтправкиДокументов.Цикл
		//Евросиб СубботинВ #102687 14.02.2025 Конец//
		|			И (НЕ КлючевыеПоляСобытийОтправкиДокументов.ПометкаУдаления)
		|ГДЕ
		|	КлючевыеПоляСобытийОтправкиДокументов.Ссылка ЕСТЬ NULL";
		Запрос.УстановитьПараметр("СпискиДокументовОтказПодписиДиадок", СпискиДокументовОтказПодписиДиадок);	
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//СформироватьЗаписиСобытийИзменений(ВыборкаДетальныеЗаписи.Документ, ВыборкаДетальныеЗаписи.Событие, ВыборкаДетальныеЗаписи.ДатаДокумента, НеОтправлятьПисьма);	
			//Евросиб(ДИТ), Беляев СЮ, BUG 92593 / TA 92595, 07-10-2024, начало
			СформироватьЗаписиСобытийИзменений(ВыборкаДетальныеЗаписи.Документ, ВыборкаДетальныеЗаписи.Событие, ВыборкаДетальныеЗаписи.ДатаДокумента, НеОтправлятьПисьма, ВыборкаДетальныеЗаписи.Подписант);
			//Евросиб(ДИТ), Беляев СЮ, BUG 92593 / TA 92595, 07-10-2024, конец
		КонецЦикла;
	КонецЕсли;
	
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0382126, 15-01-2025, начало
	Отбор = Новый Структура();
	Отбор.Вставить("Алгоритм", Справочники.СобытияОтправкиДокументов.ТребуетсяАннулирование);
	СпискиДокументовТребуетсяАннулирование = ТЗСтрокДокументов.Скопировать(Отбор);

	Если СпискиДокументовТребуетсяАннулирование.Количество() > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыТребуетсяАннулирование.Ссылка КАК ДокументДиадок,
		|	ДокументыТребуетсяАннулирование.ДатаДокумента КАК ДатаДокумента,
		|	ДокументыТребуетсяАннулирование.Алгоритм КАК Событие,
		|	ДокументыТребуетсяАннулирование.Подписант КАК Подписант
		//Евросиб СубботинВ #102687 14.02.2025 Начало//
		|	,ДокументыТребуетсяАннулирование.ЦиклРаботыСДокументом КАК Цикл
		//Евросиб СубботинВ #102687 14.02.2025 Конец//
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&СпискиДокументовТребуетсяАннулирование КАК ДокументыТребуетсяАннулирование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ.ДокументДиадок КАК Документ,
		|	ВТ.ДатаДокумента КАК ДатаДокумента,
		|	ВТ.Событие КАК Событие,
		|	ВТ.Подписант КАК Подписант
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючевыеПоляСобытийОтправкиДокументов КАК КлючевыеПоляСобытийОтправкиДокументов
		|		ПО ВТ.ДокументДиадок = КлючевыеПоляСобытийОтправкиДокументов.Документ
		|			И ВТ.ДатаДокумента = КлючевыеПоляСобытийОтправкиДокументов.ДатаДокумента
		|			И ВТ.Событие = КлючевыеПоляСобытийОтправкиДокументов.Событие
				//Евросиб СубботинВ #102687 14.02.2025 Начало//
		|           И ВТ.Цикл = КлючевыеПоляСобытийОтправкиДокументов.Цикл
				//Евросиб СубботинВ #102687 14.02.2025 Конец//
		|			И (НЕ КлючевыеПоляСобытийОтправкиДокументов.ПометкаУдаления)
		|ГДЕ
		|	КлючевыеПоляСобытийОтправкиДокументов.Ссылка ЕСТЬ NULL";
		Запрос.УстановитьПараметр("СпискиДокументовТребуетсяАннулирование", СпискиДокументовТребуетсяАннулирование);	
		РезультатЗапроса = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СформироватьЗаписиСобытийИзменений(ВыборкаДетальныеЗаписи.Документ, ВыборкаДетальныеЗаписи.Событие, ВыборкаДетальныеЗаписи.ДатаДокумента, НеОтправлятьПисьма, ВыборкаДетальныеЗаписи.Подписант);
		КонецЦикла;
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0382126, 15-01-2025, конец
	
	//Евросиб СубботинВ #89527 30.10.2024 Начало// рассылка уведом по отклонению заявок

	Отбор = Новый Структура();
	Отбор.Вставить("Алгоритм", Справочники.СобытияОтправкиДокументов.ОтклонениеЗаявкиНаОплатуВУПП);
	СпискиДокументовОтклонениеЗаявкиНаОплатуВУПП = ТЗСтрокДокументов.Скопировать(Отбор);	
	
	Запрос = Новый Запрос; 
	МассивТекстовЗапроса = Новый Массив;
	Если СпискиДокументовОтклонениеЗаявкиНаОплатуВУПП.Количество() > 0 Тогда 		

		ТекстЗапроса = "ВЫБРАТЬ
		|	ОтклонениеЗаявкиНаОплатуВУПП.Ссылка КАК Объект,
		|	ОтклонениеЗаявкиНаОплатуВУПП.ДатаДокумента КАК ДатаДокумента,
		|	ОтклонениеЗаявкиНаОплатуВУПП.Алгоритм КАК Событие,
		|	ОтклонениеЗаявкиНаОплатуВУПП.Подписант КАК Подписант
		//Евросиб СубботинВ #102687 14.02.2025 Начало//
		|	,ОтклонениеЗаявкиНаОплатуВУПП.ЦиклРаботыСДокументом КАК Цикл
		//Евросиб СубботинВ #102687 14.02.2025 Конец//
		|ПОМЕСТИТЬ ВТ_ОтклонениеЗаявкиНаОплатуВУПП
		|ИЗ
		|	&СпискиДокументовОтклонениеЗаявкиНаОплатуВУПП КАК ОтклонениеЗаявкиНаОплатуВУПП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОтклонениеЗаявкиНаОплатуВУПП.Объект КАК Документ,
		|	ОтклонениеЗаявкиНаОплатуВУПП.ДатаДокумента КАК ДатаДокумента,
		|	ОтклонениеЗаявкиНаОплатуВУПП.Событие КАК Событие,
		|	ОтклонениеЗаявкиНаОплатуВУПП.Подписант КАК Подписант
		//Евросиб СубботинВ #102687 14.02.2025 Начало//
		|	,ОтклонениеЗаявкиНаОплатуВУПП.Цикл КАК Цикл
		//Евросиб СубботинВ #102687 14.02.2025 Конец//

		|ИЗ
		|	ВТ_ОтклонениеЗаявкиНаОплатуВУПП КАК ОтклонениеЗаявкиНаОплатуВУПП
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючевыеПоляСобытийОтправкиДокументов КАК КлючевыеПоляСобытийОтправкиДокументов
		|		ПО ОтклонениеЗаявкиНаОплатуВУПП.Объект = КлючевыеПоляСобытийОтправкиДокументов.Документ
		|			И ОтклонениеЗаявкиНаОплатуВУПП.ДатаДокумента = КлючевыеПоляСобытийОтправкиДокументов.ДатаДокумента
		|			И ОтклонениеЗаявкиНаОплатуВУПП.Событие = КлючевыеПоляСобытийОтправкиДокументов.Событие
		//Евросиб СубботинВ #102687 14.02.2025 Начало//
		|           И ОтклонениеЗаявкиНаОплатуВУПП.Цикл = КлючевыеПоляСобытийОтправкиДокументов.Цикл
		//Евросиб СубботинВ #102687 14.02.2025 Конец//
		|			И (НЕ КлючевыеПоляСобытийОтправкиДокументов.ПометкаУдаления)
		|ГДЕ
		|	КлючевыеПоляСобытийОтправкиДокументов.Ссылка ЕСТЬ NULL"; 
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
		Запрос.УстановитьПараметр("СпискиДокументовОтклонениеЗаявкиНаОплатуВУПП", СпискиДокументовОтклонениеЗаявкиНаОплатуВУПП);	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
	//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//		СформироватьЗаписиСобытийИзменений(ВыборкаДетальныеЗаписи.Документ, ВыборкаДетальныеЗаписи.Событие, ВыборкаДетальныеЗаписи.ДатаДокумента, НеОтправлятьПисьма, ВыборкаДетальныеЗаписи.Подписант);
	//	КонецЦикла;
	КонецЕсли;
	//
	// обход по  событию НеСогласованРеестрПлатежей
	Отбор = Новый Структура();
	Отбор.Вставить("Алгоритм", Справочники.СобытияОтправкиДокументов.НеСогласованРеестрПлатежей);
	СпискиДокументовНеСогласованРеестрПлатежей = ТЗСтрокДокументов.Скопировать(Отбор);	
	
	Если СпискиДокументовНеСогласованРеестрПлатежей.Количество() > 0 Тогда 		
		ТекстЗапроса =	"ВЫБРАТЬ
		|	НеСогласованРеестрПлатежей.Ссылка КАК Объект,
		|	НеСогласованРеестрПлатежей.ДатаДокумента КАК ДатаДокумента,
		|	НеСогласованРеестрПлатежей.Алгоритм КАК Событие,
		|	НеСогласованРеестрПлатежей.Подписант КАК Подписант
		//Евросиб СубботинВ #102687 14.02.2025 Начало//
		|	,НеСогласованРеестрПлатежей.ЦиклРаботыСДокументом КАК Цикл
		//Евросиб СубботинВ #102687 14.02.2025 Конец//
		|ПОМЕСТИТЬ ВТ_НеСогласованРеестрПлатежей
		|ИЗ
		|	&СпискиДокументовНеСогласованРеестрПлатежей КАК НеСогласованРеестрПлатежей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НеСогласованРеестрПлатежей.Объект КАК Документ,
		|	НеСогласованРеестрПлатежей.ДатаДокумента КАК ДатаДокумента,
		|	НеСогласованРеестрПлатежей.Событие КАК Событие,
		|	НеСогласованРеестрПлатежей.Подписант КАК Подписант
		//Евросиб СубботинВ #102687 14.02.2025 Начало//
		|	,НеСогласованРеестрПлатежей.Цикл КАК Цикл
		//Евросиб СубботинВ #102687 14.02.2025 Конец//
		|ИЗ
		|	ВТ_НеСогласованРеестрПлатежей КАК НеСогласованРеестрПлатежей
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючевыеПоляСобытийОтправкиДокументов КАК КлючевыеПоляСобытийОтправкиДокументов
		|		ПО НеСогласованРеестрПлатежей.Объект = КлючевыеПоляСобытийОтправкиДокументов.Документ
		|			И НеСогласованРеестрПлатежей.ДатаДокумента = КлючевыеПоляСобытийОтправкиДокументов.ДатаДокумента
		|			И НеСогласованРеестрПлатежей.Событие = КлючевыеПоляСобытийОтправкиДокументов.Событие
		//Евросиб СубботинВ #102687 14.02.2025 Начало//
		|           И НеСогласованРеестрПлатежей.Цикл = КлючевыеПоляСобытийОтправкиДокументов.Цикл
		//Евросиб СубботинВ #102687 14.02.2025 Конец/
		|			И (НЕ КлючевыеПоляСобытийОтправкиДокументов.ПометкаУдаления)
		|ГДЕ
		|	КлючевыеПоляСобытийОтправкиДокументов.Ссылка ЕСТЬ NULL";
		
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
		Запрос.УстановитьПараметр("СпискиДокументовНеСогласованРеестрПлатежей", СпискиДокументовНеСогласованРеестрПлатежей);	
		
		//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
		//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//	СформироватьЗаписиСобытийИзменений(ВыборкаДетальныеЗаписи.Документ, ВыборкаДетальныеЗаписи.Событие, ВыборкаДетальныеЗаписи.ДатаДокумента, НеОтправлятьПисьма, ВыборкаДетальныеЗаписи.Подписант);
		//КонецЦикла;
	КонецЕсли;
	
	
	//Обход по событию НеУтвержденРеестрПлатежей
	Отбор = Новый Структура();
	Отбор.Вставить("Алгоритм", Справочники.СобытияОтправкиДокументов.НеУтвержденРеестрПлатежей);
	СпискиДокументовНеУтвержденРеестрПлатежей = ТЗСтрокДокументов.Скопировать(Отбор);	
	
	Если СпискиДокументовНеУтвержденРеестрПлатежей.Количество() > 0 Тогда 		
		ТекстЗапроса =	"ВЫБРАТЬ
		|	НеУтвержденРеестрПлатежей.Ссылка КАК Объект,
		|	НеУтвержденРеестрПлатежей.ДатаДокумента КАК ДатаДокумента,
		|	НеУтвержденРеестрПлатежей.Алгоритм КАК Событие,
		|	НеУтвержденРеестрПлатежей.Подписант КАК Подписант
		//Евросиб СубботинВ #102687 14.02.2025 Начало//
		|	,НеУтвержденРеестрПлатежей.ЦиклРаботыСДокументом КАК Цикл
		//Евросиб СубботинВ #102687 14.02.2025 Конец//
		|ПОМЕСТИТЬ ВТ_НеУтвержденРеестрПлатежей
		|ИЗ
		|	&СпискиДокументовНеУтвержденРеестрПлатежей КАК НеУтвержденРеестрПлатежей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НеУтвержденРеестрПлатежей.Объект КАК Документ,
		|	НеУтвержденРеестрПлатежей.ДатаДокумента КАК ДатаДокумента,
		|	НеУтвержденРеестрПлатежей.Событие КАК Событие,
		|	НеУтвержденРеестрПлатежей.Подписант КАК Подписант
		//Евросиб СубботинВ #102687 14.02.2025 Начало//
		|	,НеУтвержденРеестрПлатежей.Цикл КАК Цикл
		//Евросиб СубботинВ #102687 14.02.2025 Конец//
		|ИЗ
		|	ВТ_НеУтвержденРеестрПлатежей КАК НеУтвержденРеестрПлатежей
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючевыеПоляСобытийОтправкиДокументов КАК КлючевыеПоляСобытийОтправкиДокументов
		|		ПО НеУтвержденРеестрПлатежей.Объект = КлючевыеПоляСобытийОтправкиДокументов.Документ
		|			И НеУтвержденРеестрПлатежей.ДатаДокумента = КлючевыеПоляСобытийОтправкиДокументов.ДатаДокумента
		|			И НеУтвержденРеестрПлатежей.Событие = КлючевыеПоляСобытийОтправкиДокументов.Событие
		//Евросиб СубботинВ #102687 14.02.2025 Начало//
		|           И НеУтвержденРеестрПлатежей.Цикл = КлючевыеПоляСобытийОтправкиДокументов.Цикл
		//Евросиб СубботинВ #102687 14.02.2025 Конец/
		|			И (НЕ КлючевыеПоляСобытийОтправкиДокументов.ПометкаУдаления)
		|ГДЕ
		|	КлючевыеПоляСобытийОтправкиДокументов.Ссылка ЕСТЬ NULL";
		
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
		Запрос.УстановитьПараметр("СпискиДокументовНеУтвержденРеестрПлатежей", СпискиДокументовНеУтвержденРеестрПлатежей);		
	КонецЕсли; 
	
	//Евросиб СубботинВ #102687 14.02.2025 Начало // рассылка по выводу ктк из оперирования
	
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0389212, 30-06-2025, начало
	Отбор = Новый Структура();
	Отбор.Вставить("Алгоритм", Справочники.СобытияОтправкиДокументов.ТребуетсяУточнениеДиадок);
	СпискиДокументовТребуетсяУточнениеДиадок = ТЗСтрокДокументов.Скопировать(Отбор);

	Если СпискиДокументовТребуетсяУточнениеДиадок.Количество() > 0 Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ДокументыТребуетсяУточнениеДиадок.Ссылка КАК ДокументДиадок,
		|	ДокументыТребуетсяУточнениеДиадок.ДатаДокумента КАК ДатаДокумента,
		|	ДокументыТребуетсяУточнениеДиадок.Алгоритм КАК Событие,
		|	ДокументыТребуетсяУточнениеДиадок.Подписант КАК Подписант
		|	,ДокументыТребуетсяУточнениеДиадок.ЦиклРаботыСДокументом КАК Цикл
		|ПОМЕСТИТЬ ВТ_ДокументыТребуетсяУточнениеДиадок
		|ИЗ
		|	&СпискиДокументовТребуетсяУточнениеДиадок КАК ДокументыТребуетсяУточнениеДиадок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ДокументыТребуетсяУточнениеДиадок.ДокументДиадок КАК Документ,
		|	ВТ_ДокументыТребуетсяУточнениеДиадок.ДатаДокумента КАК ДатаДокумента,
		|	ВТ_ДокументыТребуетсяУточнениеДиадок.Событие КАК Событие,
		|	ВТ_ДокументыТребуетсяУточнениеДиадок.Подписант КАК Подписант,
		|	ВТ_ДокументыТребуетсяУточнениеДиадок.Цикл КАК Цикл
		|ИЗ
		|	ВТ_ДокументыТребуетсяУточнениеДиадок КАК ВТ_ДокументыТребуетсяУточнениеДиадок
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючевыеПоляСобытийОтправкиДокументов КАК КлючевыеПоляСобытийОтправкиДокументов
		|		ПО ВТ_ДокументыТребуетсяУточнениеДиадок.ДокументДиадок = КлючевыеПоляСобытийОтправкиДокументов.Документ
		|			И ВТ_ДокументыТребуетсяУточнениеДиадок.ДатаДокумента = КлючевыеПоляСобытийОтправкиДокументов.ДатаДокумента
		|			И ВТ_ДокументыТребуетсяУточнениеДиадок.Событие = КлючевыеПоляСобытийОтправкиДокументов.Событие
		|           И ВТ_ДокументыТребуетсяУточнениеДиадок.Цикл = КлючевыеПоляСобытийОтправкиДокументов.Цикл
		|			И (НЕ КлючевыеПоляСобытийОтправкиДокументов.ПометкаУдаления)
		|ГДЕ
		|	КлючевыеПоляСобытийОтправкиДокументов.Ссылка ЕСТЬ NULL";
		
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
		Запрос.УстановитьПараметр("СпискиДокументовТребуетсяУточнениеДиадок", СпискиДокументовТребуетсяУточнениеДиадок);
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0389212, 30-06-2025, конец
	
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0389212, 30-06-2025, начало
	Отбор = Новый Структура();
	Отбор.Вставить("Алгоритм", Справочники.СобытияОтправкиДокументов.ОтказаноВАннулированииДиадок);
	СпискиДокументовОтказаноВАннулированииДиадок = ТЗСтрокДокументов.Скопировать(Отбор);

	Если СпискиДокументовОтказаноВАннулированииДиадок.Количество() > 0 Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ДокументыОтказаноВАннулированииДиадок.Ссылка КАК ДокументДиадок,
		|	ДокументыОтказаноВАннулированииДиадок.ДатаДокумента КАК ДатаДокумента,
		|	ДокументыОтказаноВАннулированииДиадок.Алгоритм КАК Событие,
		|	ДокументыОтказаноВАннулированииДиадок.Подписант КАК Подписант,
		|	ДокументыОтказаноВАннулированииДиадок.ЦиклРаботыСДокументом КАК Цикл
		|ПОМЕСТИТЬ ВТ_ДокументыОтказаноВАннулированииДиадок
		|ИЗ
		|	&СпискиДокументовОтказаноВАннулированииДиадок КАК ДокументыОтказаноВАннулированииДиадок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ДокументыОтказаноВАннулированииДиадок.ДокументДиадок КАК Документ,
		|	ВТ_ДокументыОтказаноВАннулированииДиадок.ДатаДокумента КАК ДатаДокумента,
		|	ВТ_ДокументыОтказаноВАннулированииДиадок.Событие КАК Событие,
		|	ВТ_ДокументыОтказаноВАннулированииДиадок.Подписант КАК Подписант,
		|	ВТ_ДокументыОтказаноВАннулированииДиадок.Цикл КАК Цикл
		|ИЗ
		|	ВТ_ДокументыОтказаноВАннулированииДиадок КАК ВТ_ДокументыОтказаноВАннулированииДиадок
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючевыеПоляСобытийОтправкиДокументов КАК КлючевыеПоляСобытийОтправкиДокументов
		|		ПО ВТ_ДокументыОтказаноВАннулированииДиадок.ДокументДиадок = КлючевыеПоляСобытийОтправкиДокументов.Документ
		|			И ВТ_ДокументыОтказаноВАннулированииДиадок.ДатаДокумента = КлючевыеПоляСобытийОтправкиДокументов.ДатаДокумента
		|			И ВТ_ДокументыОтказаноВАннулированииДиадок.Событие = КлючевыеПоляСобытийОтправкиДокументов.Событие
		|			И ВТ_ДокументыОтказаноВАннулированииДиадок.Цикл = КлючевыеПоляСобытийОтправкиДокументов.Цикл
		|			И (НЕ КлючевыеПоляСобытийОтправкиДокументов.ПометкаУдаления)
		|ГДЕ
		|	КлючевыеПоляСобытийОтправкиДокументов.Ссылка ЕСТЬ NULL";
		
		МассивТекстовЗапроса.Добавить(ТекстЗапроса);
		Запрос.УстановитьПараметр("СпискиДокументовОтказаноВАннулированииДиадок", СпискиДокументовОтказаноВАннулированииДиадок);
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0389212, 30-06-2025, конец
	
	Если МассивТекстовЗапроса.Количество() > 0 Тогда
		Запрос.Текст = СтрСоединить(МассивТекстовЗапроса,";");
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		Сч = 1;
			Пока сч <= РезультатЗапроса.Количество()-1 Цикл
				Если не РезультатЗапроса[сч].Пустой() Тогда
					ВыборкаДетальныеЗаписи = РезультатЗапроса[сч].Выбрать();		
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						СформироватьЗаписиСобытийИзменений(ВыборкаДетальныеЗаписи.Документ, ВыборкаДетальныеЗаписи.Событие,
						ВыборкаДетальныеЗаписи.ДатаДокумента, НеОтправлятьПисьма, ВыборкаДетальныеЗаписи.Подписант, ВыборкаДетальныеЗаписи.Цикл );
					КонецЦикла;
				КонецЕсли;
				Сч = сч +2;
			КонецЦикла;
	КонецЕсли;	
	
   //Евросиб СубботинВ #89527 30.10.2024 Конец 
   
   //Евросиб СубботинВ #102687 14.02.2025 Начало // рассылка по выводу ктк из оперирования
   
   Отбор = Новый Структура();
   Отбор.Вставить("Алгоритм", Справочники.СобытияОтправкиДокументов.ВыводКткИзОперирования);
   СпискиДокументовВыводИзОперирования = ТЗСтрокДокументов.Скопировать(Отбор);	
   Если СпискиДокументовВыводИзОперирования.Количество() > 0 Тогда 
	   
	   Запрос = Новый Запрос;
	   Запрос.Текст = 
	   "ВЫБРАТЬ
	   |	ДокументыВыводИзОперирования.Ссылка КАК Документ,
	   |	ДокументыВыводИзОперирования.ДатаДокумента КАК ДатаДокумента,
	   |	ДокументыВыводИзОперирования.Алгоритм КАК Событие,
	   |	ДокументыВыводИзОперирования.Подписант КАК Подписант
	   	//Евросиб СубботинВ #102687 14.02.2025 Начало//
	   |	,ДокументыВыводИзОперирования.ЦиклРаботыСДокументом КАК Цикл
		//Евросиб СубботинВ #102687 14.02.2025 Конец//
	   |ПОМЕСТИТЬ ВТ
	   |ИЗ
	   |	&СпискиДокументовВыводИзОперирования КАК ДокументыВыводИзОперирования
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ 
	   |	ВТ.Документ КАК Документ,
	   |	ВТ.ДатаДокумента КАК ДатаДокумента,
	   |	ВТ.Событие КАК Событие,
	   |	ВТ.Подписант КАК Подписант
	   |ИЗ
	   |	ВТ КАК ВТ
	   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючевыеПоляСобытийОтправкиДокументов КАК КлючевыеПоляСобытийОтправкиДокументов
	   |		ПО ВТ.Документ = КлючевыеПоляСобытийОтправкиДокументов.Документ
	   |			И ВТ.ДатаДокумента = КлючевыеПоляСобытийОтправкиДокументов.ДатаДокумента
	   |			И ВТ.Событие = КлючевыеПоляСобытийОтправкиДокументов.Событие
	   //Евросиб СубботинВ #102687 14.02.2025 Начало//
	   |           И ВТ.Цикл = КлючевыеПоляСобытийОтправкиДокументов.Цикл
	   //Евросиб СубботинВ #102687 14.02.2025 Конец/
	   |			И (НЕ КлючевыеПоляСобытийОтправкиДокументов.ПометкаУдаления)
	   |ГДЕ
	   |	КлючевыеПоляСобытийОтправкиДокументов.Ссылка ЕСТЬ NULL";
	   Запрос.УстановитьПараметр("СпискиДокументовВыводИзОперирования", СпискиДокументовВыводИзОперирования);	   
	   
	   РезультатЗапроса = Запрос.Выполнить();
	   ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
	   Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		   СформироватьЗаписиСобытийИзменений(ВыборкаДетальныеЗаписи.Документ, ВыборкаДетальныеЗаписи.Событие, ВыборкаДетальныеЗаписи.ДатаДокумента, НеОтправлятьПисьма, ВыборкаДетальныеЗаписи.Подписант);
	   КонецЦикла;
   КонецЕсли;

	//Евросиб СубботинВ #102687 14.02.2025 Конец

   

		
КонецПроцедуры	

Процедура СозданиеНеотправленныхПисем() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	КлючевыеПоляСобытийОтправкиДокументов.Ссылка КАК Ссылка,
		//|	КлючевыеПоляСобытийОтправкиДокументов.Событие КАК Событие,
		//|	КлючевыеПоляСобытийОтправкиДокументов.Документ КАК Документ,
		//|	КлючевыеПоляСобытийОтправкиДокументов.Подписант КАК Подписант
		//|ПОМЕСТИТЬ ВТ_СобытияБезПисем
		//|ИЗ
		//|	Справочник.КлючевыеПоляСобытийОтправкиДокументов КАК КлючевыеПоляСобытийОтправкиДокументов
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РассылкаПоДокументам КАК РассылкаПоДокументам
		//|		ПО (РассылкаПоДокументам.ИсточникиИзменения = КлючевыеПоляСобытийОтправкиДокументов.Ссылка)
		//|ГДЕ
		//|	НЕ КлючевыеПоляСобытийОтправкиДокументов.НеОтравлятьПисьмо
		//|	И РассылкаПоДокументам.Письмо ЕСТЬ NULL
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	ВТ_СобытияБезПисем.Ссылка КАК КлючевыеПоляСобытийОтправкиДокументов,
		//|	МИНИМУМ(СделкаДоходы.УслугаВнеСтавки) КАК УслугаВнеСтавки
		//|ПОМЕСТИТЬ ВТ_ПроверкаРТУ
		//|ИЗ
		//|	ВТ_СобытияБезПисем КАК ВТ_СобытияБезПисем
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
		//|		ПО ВТ_СобытияБезПисем.Документ = СделкаДоходы.УчДокумент
		//|			И (СделкаДоходы.Ссылка.Проведен)
		//|			И (ТИПЗНАЧЕНИЯ(ВТ_СобытияБезПисем.Документ) = ТИП(Документ.РеализацияТоваровУслуг))
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ВТ_СобытияБезПисем.Ссылка
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	ВТ_СобытияБезПисем.Ссылка КАК КлючевыеПоляСобытийОтправкиДокументов,
		//|	СделкаДоходы.Услуга КАК Услуга,
		//|	СделкаДоходы.Ссылка КАК Сделка,
		//|	ВТ_СобытияБезПисем.Подписант КАК Подписант
		//|ИЗ
		//|	ВТ_СобытияБезПисем КАК ВТ_СобытияБезПисем
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
		//|		ПО ВТ_СобытияБезПисем.Документ = СделкаДоходы.УчДокумент
		//|			И (СделкаДоходы.Ссылка.Проведен)
		//|			И (ТИПЗНАЧЕНИЯ(ВТ_СобытияБезПисем.Документ) = ТИП(Документ.РеализацияТоваровУслуг))
		//|			И (СделкаДоходы.УслугаВнеСтавки)
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПроверкаРТУ КАК ВТ_ПроверкаРТУ
		//|		ПО (ВТ_ПроверкаРТУ.КлючевыеПоляСобытийОтправкиДокументов = ВТ_СобытияБезПисем.Ссылка)
		//|			И (ВТ_ПроверкаРТУ.УслугаВнеСтавки)
		//|
		//|ОБЪЕДИНИТЬ
		//|
		//|ВЫБРАТЬ
		//|	ВТ_СобытияБезПисем.Ссылка,
		//|	NULL,
		//|	NULL,
		//|	ВТ_СобытияБезПисем.Подписант
		//|ИЗ
		//|	ВТ_СобытияБезПисем КАК ВТ_СобытияБезПисем
		//|ГДЕ
		//|	ВТ_СобытияБезПисем.Ссылка.Событие В(&СобытияДиадок)
		//|
		//|ОБЪЕДИНИТЬ
		//|
		//|ВЫБРАТЬ
		//|	ВТ_СобытияБезПисем.Ссылка,
		//|	NULL,
		//|	NULL,
		//|	ВТ_СобытияБезПисем.Подписант
		//|ИЗ
		//|	ВТ_СобытияБезПисем КАК ВТ_СобытияБезПисем
		//|ГДЕ
		//|	ВТ_СобытияБезПисем.Ссылка.Событие = &СобытиеОтклонениеЗаявкиНаОплатуВУПП
		//|
		//|ОБЪЕДИНИТЬ
		//|
		//|ВЫБРАТЬ
		//|	ВТ_СобытияБезПисем.Ссылка,
		//|	NULL,
		//|	NULL,
		//|	ВТ_СобытияБезПисем.Подписант
		//|ИЗ
		//|	ВТ_СобытияБезПисем КАК ВТ_СобытияБезПисем
		//|ГДЕ
		//|	ВТ_СобытияБезПисем.Ссылка.Событие = &СобытиеНеСогласованРеестрПлатежей
		//|
		//|ОБЪЕДИНИТЬ
		//|
		//|ВЫБРАТЬ
		//|	ВТ_СобытияБезПисем.Ссылка,
		//|	NULL,
		//|	NULL,
		//|	ВТ_СобытияБезПисем.Подписант
		//|ИЗ
		//|	ВТ_СобытияБезПисем КАК ВТ_СобытияБезПисем
		//|ГДЕ
		//|	ВТ_СобытияБезПисем.Ссылка.Событие = &СобытиеНеУтвержденРеестрПлатежей
		//|
		//|ОБЪЕДИНИТЬ
		//|
		//|ВЫБРАТЬ
		//|	ВТ_СобытияБезПисем.Ссылка,
		//|	NULL,
		//|	NULL,
		//|	ВТ_СобытияБезПисем.Подписант
		//|ИЗ
		//|	ВТ_СобытияБезПисем КАК ВТ_СобытияБезПисем
		//|ГДЕ
		//|	ВТ_СобытияБезПисем.Ссылка.Событие = &СобытиеУтверждениеЗаявкиНаОплатуУПП
		//|ИТОГИ ПО
		//|	КлючевыеПоляСобытийОтправкиДокументов
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ ПЕРВЫЕ 5
		//|	ВТ_СобытияБезПисем.Событие КАК Событие,
		//|	ВТ_СобытияБезПисем.Документ КАК Документ,
		//|	ВТ_СобытияБезПисем.Подписант КАК Подписант,
		//|	ВТ_СобытияБезПисем.Ссылка КАК Ссылка
		//|ПОМЕСТИТЬ ВТ_СобытиеВыводИзОперирования
		//|ИЗ
		//|	ВТ_СобытияБезПисем КАК ВТ_СобытияБезПисем
		//|ГДЕ
		//|	ВТ_СобытияБезПисем.Событие = &СобытиеВыводКткИзОперирования
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_СобытиеВыводИзОперирования.Событие КАК Событие,
		//|	ВТ_СобытиеВыводИзОперирования.Документ КАК РелизСобственника,
		//|	ВТ_СобытиеВыводИзОперирования.Подписант КАК Автор,
		//|	РелизСобственникаНоминации.Контейнер КАК Контейнер,
		//|	РелизСобственникаНоминации.Ссылка.ОбщееКоличествоВРелизе КАК ОбщееКоличествоВРелизе,
		//|	РелизСобственникаНоминации.Ссылка.ОсталосьКВыдаче КАК ОсталосьКВыдаче,
		//|	РелизСобственникаНоминации.Ссылка.Номер КАК Номер,
		//|	РелизСобственникаНоминации.Ссылка.Дата КАК Дата,
		//|	РелизСобственникаНоминации.Ссылка.НомерДокумента КАК НомерДокумента,
		//|	ВТ_СобытиеВыводИзОперирования.Ссылка КАК КлючевыеПоляСобытийОтправкиДокументов
		//|ИЗ
		//|	ВТ_СобытиеВыводИзОперирования КАК ВТ_СобытиеВыводИзОперирования
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
		//|		ПО ВТ_СобытиеВыводИзОперирования.Документ = РелизСобственникаНоминации.Ссылка
		//|ГДЕ
		//|	(РелизСобственникаНоминации.ДатаВозвратаСобственнику = ДАТАВРЕМЯ(1, 1, 1)
		//|			ИЛИ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(РелизСобственникаНоминации.ДатаВзятия, ДЕНЬ), ДЕНЬ, РелизСобственникаНоминации.НормативВозврата) > НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ))
		//|	И НЕ РелизСобственникаНоминации.Контейнер = ЗНАЧЕНИЕ(Справочник.Те.ПустаяСсылка)
		//|ИТОГИ ПО
		//|	Автор,
		//|	РелизСобственника";
		
		"ВЫБРАТЬ
		|	КлючевыеПоляСобытийОтправкиДокументов.Ссылка КАК Ссылка,
		|	КлючевыеПоляСобытийОтправкиДокументов.Событие КАК Событие,
		|	КлючевыеПоляСобытийОтправкиДокументов.Документ КАК Документ,
		|	КлючевыеПоляСобытийОтправкиДокументов.Подписант КАК Подписант
		|ПОМЕСТИТЬ ВТ_СобытияБезПисем
		|ИЗ
		|	Справочник.КлючевыеПоляСобытийОтправкиДокументов КАК КлючевыеПоляСобытийОтправкиДокументов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РассылкаПоДокументам КАК РассылкаПоДокументам
		|		ПО (РассылкаПоДокументам.ИсточникиИзменения = КлючевыеПоляСобытийОтправкиДокументов.Ссылка)
		|ГДЕ
		|	НЕ КлючевыеПоляСобытийОтправкиДокументов.НеОтравлятьПисьмо
		|	И РассылкаПоДокументам.Письмо ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_СобытияБезПисем.Ссылка КАК КлючевыеПоляСобытийОтправкиДокументов,
		|	МИНИМУМ(СделкаДоходы.УслугаВнеСтавки) КАК УслугаВнеСтавки
		//Евросиб(ДИТ), Беляев СЮ, US 111184 / TA 111245, 11-06-2025, начало
		|	,МАКСИМУМ(ВЫБОР КОГДА СделкаДоходы.Услуга = ЗНАЧЕНИЕ(Справочник.Номенклатура.Премия) ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК Премия
		//Евросиб(ДИТ), Беляев СЮ, US 111184 / TA 111245, 11-06-2025, конец
		|ПОМЕСТИТЬ ВТ_ПроверкаРТУ
		|ИЗ
		|	ВТ_СобытияБезПисем КАК ВТ_СобытияБезПисем
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
		|		ПО ВТ_СобытияБезПисем.Документ = СделкаДоходы.УчДокумент
		|			И (СделкаДоходы.Ссылка.Проведен)
		|			И (ТИПЗНАЧЕНИЯ(ВТ_СобытияБезПисем.Документ) = ТИП(Документ.РеализацияТоваровУслуг))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СобытияБезПисем.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_СобытияБезПисем.Ссылка КАК КлючевыеПоляСобытийОтправкиДокументов
		|ИЗ
		|	ВТ_СобытияБезПисем КАК ВТ_СобытияБезПисем
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
		|		ПО ВТ_СобытияБезПисем.Документ = СделкаДоходы.УчДокумент
		|			И (СделкаДоходы.Ссылка.Проведен)
		|			И (ТИПЗНАЧЕНИЯ(ВТ_СобытияБезПисем.Документ) = ТИП(Документ.РеализацияТоваровУслуг))
		//|			И (СделкаДоходы.УслугаВнеСтавки)
		//Евросиб(ДИТ), Беляев СЮ, US 111184 / TA 111245, 11-06-2025, начало
		|			И (СделкаДоходы.УслугаВнеСтавки ИЛИ СделкаДоходы.Услуга = ЗНАЧЕНИЕ(Справочник.Номенклатура.Премия))
		//Евросиб(ДИТ), Беляев СЮ, US 111184 / TA 111245, 11-06-2025, конец
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПроверкаРТУ КАК ВТ_ПроверкаРТУ
		|		ПО (ВТ_ПроверкаРТУ.КлючевыеПоляСобытийОтправкиДокументов = ВТ_СобытияБезПисем.Ссылка)
		//|			И (ВТ_ПроверкаРТУ.УслугаВнеСтавки)
		//Евросиб(ДИТ), Беляев СЮ, US 111184 / TA 111245, 11-06-2025, начало
		|			И (ВТ_ПроверкаРТУ.УслугаВнеСтавки ИЛИ ВТ_ПроверкаРТУ.Премия)
		//Евросиб(ДИТ), Беляев СЮ, US 111184 / TA 111245, 11-06-2025, конец
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТ_СобытияБезПисем.Ссылка
		|ИЗ
		|	ВТ_СобытияБезПисем КАК ВТ_СобытияБезПисем
		|ГДЕ
		|	ВТ_СобытияБезПисем.Ссылка.Событие В(&МассивСобытий)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СобытияБезПисем.Событие КАК Событие,
		|	ВЫРАЗИТЬ(ВТ_СобытияБезПисем.Документ КАК Справочник.КлючиАналитикиНоминацийРелиза) КАК Документ,
		|	ВТ_СобытияБезПисем.Подписант КАК Подписант,
		|	ВТ_СобытияБезПисем.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_СобытиеВыводИзОперирования
		|ИЗ
		|	ВТ_СобытияБезПисем КАК ВТ_СобытияБезПисем
		|ГДЕ
		|	ВТ_СобытияБезПисем.Событие = &СобытиеВыводКткИзОперирования
		|	И НЕ ВЫРАЗИТЬ(ВТ_СобытияБезПисем.Документ КАК Справочник.КлючиАналитикиНоминацийРелиза).Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПУстаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РелизСобственникаНоминации.Ссылка КАК Ссылка,
		|	КОЛИЧЕСТВО(РелизСобственникаНоминации.ДатаВозвратаСобственнику) КАК ДатаВозвратаСобственнику
		|ПОМЕСТИТЬ ВТ_КткК_Возврату
		|ИЗ
		|	Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
		|ГДЕ
		|	РелизСобственникаНоминации.Ссылка В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ВТ_СобытиеВыводИзОперирования.Документ.РелизСобственника КАК ДокументРелизСобственника
		|			ИЗ
		|				ВТ_СобытиеВыводИзОперирования КАК ВТ_СобытиеВыводИзОперирования)
		|	И РелизСобственникаНоминации.ДатаВозвратаСобственнику = ДАТАВРЕМЯ(1, 1, 1)
		|
		|СГРУППИРОВАТЬ ПО
		|	РелизСобственникаНоминации.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СобытиеВыводИзОперирования.Событие КАК Событие,
		|	ВТ_СобытиеВыводИзОперирования.Документ КАК КлючАналитикиКТК,
		|	ВТ_СобытиеВыводИзОперирования.Подписант КАК Автор,
		|	ВТ_СобытиеВыводИзОперирования.Документ.Контейнер КАК Контейнер,
		|	РелизСобственника.ОбщееКоличествоВРелизе КАК ОбщееКоличествоВРелизе,
		|	ВТ_КткК_Возврату.ДатаВозвратаСобственнику КАК ОсталосьКВыдаче,
		|	РелизСобственника.Номер КАК Номер,
		|	РелизСобственника.Дата КАК Дата,
		|	РелизСобственника.НомерДокумента КАК НомерДокумента,
		|	ВТ_СобытиеВыводИзОперирования.Ссылка КАК КлючевыеПоляСобытийОтправкиДокументов
		|ИЗ
		|	ВТ_СобытиеВыводИзОперирования КАК ВТ_СобытиеВыводИзОперирования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РелизСобственника КАК РелизСобственника
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КткК_Возврату КАК ВТ_КткК_Возврату
		|			ПО РелизСобственника.Ссылка = ВТ_КткК_Возврату.Ссылка
		|		ПО ВТ_СобытиеВыводИзОперирования.Документ.РелизСобственника = РелизСобственника.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Автор,
		|	НомерДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_СобытияБезПисем.Ссылка КАК КлючевыеПоляСобытийОтправкиДокументов,
		|	СделкаДоходы.Услуга КАК Услуга,
		|	СделкаДоходы.Ссылка КАК Сделка,
		|	ВТ_СобытияБезПисем.Подписант КАК Подписант
		|ИЗ
		|	ВТ_СобытияБезПисем КАК ВТ_СобытияБезПисем
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
		|		ПО ВТ_СобытияБезПисем.Документ = СделкаДоходы.УчДокумент
		|			И (СделкаДоходы.Ссылка.Проведен)
		|			И (ТИПЗНАЧЕНИЯ(ВТ_СобытияБезПисем.Документ) = ТИП(Документ.РеализацияТоваровУслуг))
		//|			И (СделкаДоходы.УслугаВнеСтавки)
		//Евросиб(ДИТ), Беляев СЮ, US 111184 / TA 111245, 11-06-2025, начало
		|			И (СделкаДоходы.УслугаВнеСтавки ИЛИ СделкаДоходы.Услуга = ЗНАЧЕНИЕ(Справочник.Номенклатура.Премия))
		//Евросиб(ДИТ), Беляев СЮ, US 111184 / TA 111245, 11-06-2025, конец
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПроверкаРТУ КАК ВТ_ПроверкаРТУ
		|		ПО (ВТ_ПроверкаРТУ.КлючевыеПоляСобытийОтправкиДокументов = ВТ_СобытияБезПисем.Ссылка)
		//|			И (ВТ_ПроверкаРТУ.УслугаВнеСтавки)
		//Евросиб(ДИТ), Беляев СЮ, US 111184 / TA 111245, 11-06-2025, начало
		|			И (ВТ_ПроверкаРТУ.УслугаВнеСтавки ИЛИ ВТ_ПроверкаРТУ.Премия)
		//Евросиб(ДИТ), Беляев СЮ, US 111184 / TA 111245, 11-06-2025, конец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(РеестрПлатежейЗаявки.Ссылка) КАК Реестр,
		|	ВТ_СобытияБезПисем.Ссылка КАК КлючСобытиеОтправки
		|ПОМЕСТИТЬ ВТ_ПолучениеПоследнегоРеестра
		|ИЗ
		|	ВТ_СобытияБезПисем КАК ВТ_СобытияБезПисем
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеестрПлатежей.Заявки КАК РеестрПлатежейЗаявки 
		//Евросиб СубботинВ #128538 23.01.2026 Начало
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗаявкиВключенныеВРеестр КАК ЗаявкиВключенныеВРеестр
		|				ПО РеестрПлатежейЗаявки.Ссылка = ЗаявкиВключенныеВРеестр.РеестрПлатежей
		|				И РеестрПлатежейЗаявки.ЗаявкаНаОплату = ЗаявкиВключенныеВРеестр.ЗаявкаНаОплату
		|				И (ЗаявкиВключенныеВРеестр.Отключена)
		//Евросиб СубботинВ #128538 23.01.2026 Конец
		|		ПО ВТ_СобытияБезПисем.Документ = РеестрПлатежейЗаявки.ЗаявкаНаОплату
		|			И (РеестрПлатежейЗаявки.Ссылка.Проведен)
		//Евросиб СубботинВ #128538 23.01.2026 Начало 
		//|			И (РеестрПлатежейЗаявки.Отключена) 
		//Евросиб СубботинВ #128538 23.01.2026 Конец
		|			И (ВТ_СобытияБезПисем.Событие = &СобытиеОшибкаПередачиЗаявкиВУПП)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СобытияБезПисем.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПолучениеПоследнегоРеестра.Реестр КАК Реестр,
		|	ВТ_ПолучениеПоследнегоРеестра.Реестр.Автор КАК АвторРеестра,
		|	ДокЗаявкаНаОплату.Автор КАК Автор,
		|	ДокЗаявкаНаОплату.ОтветственныйЗаОплату КАК ОтветственныйЗаОплату,
		|	ДокЗаявкаНаОплату.Ссылка КАК Заявка,
		|	ВТ_СобытияБезПисем.Ссылка КАК КлючевыеПоляСобытийОтправкиДокументов,
		|	ОшибкиПриОбменах.ТекстОшибки КАК ТекстОшибки
		|ИЗ
		|	ВТ_СобытияБезПисем КАК ВТ_СобытияБезПисем
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаОплату КАК ДокЗаявкаНаОплату
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОшибкиПриОбменах КАК ОшибкиПриОбменах
		|			ПО ДокЗаявкаНаОплату.Ссылка = ОшибкиПриОбменах.Объект
		|				И (ОшибкиПриОбменах.Узел = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
		|		ПО ВТ_СобытияБезПисем.Документ = ДокЗаявкаНаОплату.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПолучениеПоследнегоРеестра КАК ВТ_ПолучениеПоследнегоРеестра
		|		ПО ВТ_СобытияБезПисем.Ссылка = ВТ_ПолучениеПоследнегоРеестра.КлючСобытиеОтправки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Реестр
		|;
		//Евросиб СубботинВ #107464 05.06.2025 Начало 
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтатусыОбъектовСрезПоследних.Комментарий КАК Комментарий,
		|	СтатусыОбъектовСрезПоследних.Объект КАК Объект
		|ИЗ
		|	РегистрСведений.СтатусыОбъектов.СрезПоследних(
		|			,
		|			Объект В (ВЫБРАТЬ
		|						ВТ_СобытияБезПисем.Документ КАК Документ
		|							ИЗ
		|						ВТ_СобытияБезПисем КАК ВТ_СобытияБезПисем)
		|		И Статус В (&МассивСтатусовДляПолученияКомментария)) КАК СтатусыОбъектовСрезПоследних;
		//Евросиб СубботинВ #107464 05.06.2025 Конец
		//Евросиб СубботинВ #111466 09.06.2025 Начало
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПротоколОбменов.Объект КАК Объект,
		|	ПротоколОбменов.ДатаПланируемойОплаты КАК ДатаПланируемойОплатыУПП
		|ИЗ
		|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		|ГДЕ
		|	ПротоколОбменов.Объект В
		|				(ВЫБРАТЬ
		|					ВТ_СобытияБезПисем.Документ КАК Документ
		|				ИЗ
		|					ВТ_СобытияБезПисем КАК ВТ_СобытияБезПисем)
		|			И ПротоколОбменов.УзелОбмена=Значение(Перечисление.УзлыОбмена.Упп)";
		//Евросиб СубботинВ #111466 09.06.2025 Конец
		
		
		//		|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	РеестрПлатежейЗаявки.Ссылка КАК Реестр,
		//|	РеестрПлатежейЗаявки.Ссылка.Автор КАК АвторРеестра,
		//|	ДокЗаявкаНаОплату.Автор КАК Автор,
		//|	ДокЗаявкаНаОплату.ОтветственныйЗаОплату КАК ОтветственныйЗаОплату,
		//|	ДокЗаявкаНаОплату.Ссылка КАК Заявка,
		//|	ВТ_СобытияБезПисем.Ссылка КАК КлючевыеПоляСобытийОтправкиДокументов,
		//|	ОшибкиПриОбменах.ТекстОшибки КАК ТекстОшибки
		//|ИЗ
		//|	ВТ_СобытияБезПисем КАК ВТ_СобытияБезПисем
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеестрПлатежей.Заявки КАК РеестрПлатежейЗаявки
		//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПолучениеПоследнегоРеестра КАК ВТ_ПолучениеПоследнегоРеестра
		//|			ПО РеестрПлатежейЗаявки.Ссылка = ВТ_ПолучениеПоследнегоРеестра.Реестр
		//|		ПО ВТ_СобытияБезПисем.Документ = РеестрПлатежейЗаявки.ЗаявкаНаОплату
		////|			И (РеестрПлатежейЗаявки.Ссылка.Проведен)
		////|			И (РеестрПлатежейЗаявки.Отключена)
		//|			И (ВТ_СобытияБезПисем.Событие = &СобытиеОшибкаПередачиЗаявкиВУПП)
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаОплату КАК ДокЗаявкаНаОплату
		//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОшибкиПриОбменах КАК ОшибкиПриОбменах
		//|			ПО ДокЗаявкаНаОплату.Ссылка = ОшибкиПриОбменах.Объект
		//|				И (ОшибкиПриОбменах.Узел = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.УПП))
		//|		ПО ВТ_СобытияБезПисем.Документ = ДокЗаявкаНаОплату.Ссылка
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	Реестр";	

	//Евросиб СубботинВ #102687 14.02.2025 Конец
	
	//Евросиб СубботинВ #102687 14.02.2025 Начало// переделал запрос и т.к структура данных по пакету совпала, отбираем события по массиву, а не каждому значению
	
	////Запрос.УстановитьПараметр("СобытиеОтказПодписи",Справочники.СобытияОтправкиДокументов.ОтказаноВПодписиДиадок);
	////Евросиб(ДИТ), Беляев СЮ, Ticket#0382126, 15-01-2025, начало
	//СобытияДиадок = Новый Массив;
	//СобытияДиадок.Добавить(Справочники.СобытияОтправкиДокументов.ОтказаноВПодписиДиадок);
	//СобытияДиадок.Добавить(Справочники.СобытияОтправкиДокументов.ТребуетсяАннулирование);
	//Запрос.УстановитьПараметр("СобытияДиадок", СобытияДиадок);
	////Евросиб(ДИТ), Беляев СЮ, Ticket#0382126, 15-01-2025, конец
	////Евросиб СубботинВ #89527 30.10.2024 Начало 
	//Запрос.УстановитьПараметр("СобытиеОтклонениеЗаявкиНаОплатуВУПП",Справочники.СобытияОтправкиДокументов.ОтклонениеЗаявкиНаОплатуВУПП);
	//Запрос.УстановитьПараметр("СобытиеНеСогласованРеестрПлатежей",Справочники.СобытияОтправкиДокументов.НеСогласованРеестрПлатежей);
	//Запрос.УстановитьПараметр("СобытиеНеУтвержденРеестрПлатежей",Справочники.СобытияОтправкиДокументов.НеУтвержденРеестрПлатежей);
	////Евросиб СубботинВ #89527 30.10.2024 Конец
	////Евросиб СубботинВ #97103 16.12.2024 Начало
	//Запрос.УстановитьПараметр("СобытиеУтверждениеЗаявкиНаОплатуУПП",Справочники.СобытияОтправкиДокументов.УтверждениеЗаявкиНаОплатуУПП);
	////Евросиб СубботинВ #97103 16.12.2024 Конец
	
	//Евросиб СубботинВ #102687 14.02.2025 Конец 
	
	//Евросиб СубботинВ #102687 14.02.2025 Начало// добавил часть по выводу ктк из оперирования + переделал на пакеты
	Запрос.УстановитьПараметр("СобытиеВыводКткИзОперирования", Справочники.СобытияОтправкиДокументов.ВыводКткИзОперирования);
	
	МассивСобытий = Новый Массив;
	МассивСобытий.Добавить(Справочники.СобытияОтправкиДокументов.ОтказаноВПодписиДиадок);
	МассивСобытий.Добавить(Справочники.СобытияОтправкиДокументов.ТребуетсяАннулирование);
	МассивСобытий.Добавить(Справочники.СобытияОтправкиДокументов.ОтклонениеЗаявкиНаОплатуВУПП);
	МассивСобытий.Добавить(Справочники.СобытияОтправкиДокументов.НеСогласованРеестрПлатежей);
	МассивСобытий.Добавить(Справочники.СобытияОтправкиДокументов.УтверждениеЗаявкиНаОплатуУПП);
	МассивСобытий.Добавить(Справочники.СобытияОтправкиДокументов.НеУтвержденРеестрПлатежей);	
	//Евросиб СубботинВ #107464 05.06.2025 Начало 
    МассивСобытий.Добавить(Справочники.СобытияОтправкиДокументов.ОтклонениеЗаявкиВDC);
	//Евросиб СубботинВ #107464 05.06.2025 Конец 
	//Евросиб СубботинВ #111466 09.06.2025 Начало
	МассивСобытий.Добавить(Справочники.СобытияОтправкиДокументов.ИзмененаДатаОплатыВУПП);
	//Евросиб СубботинВ #111466 09.06.2025 Конец
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0389212, 30-06-2025, начало
	МассивСобытий.Добавить(Справочники.СобытияОтправкиДокументов.ТребуетсяУточнениеДиадок);
	МассивСобытий.Добавить(Справочники.СобытияОтправкиДокументов.ОтказаноВАннулированииДиадок);
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0389212, 30-06-2025, конец	
	//Евросиб СубботинВ #114616 20.08.2025 Начало
	МассивСобытий.Добавить(Справочники.СобытияОтправкиДокументов.ОшибкаЗагрузкиППБитФинанс);
	//Евросиб СубботинВ #114616 20.08.2025 Конец

	Запрос.УстановитьПараметр("МассивСобытий", МассивСобытий);
	
	//Евросиб СубботинВ #107464 05.06.2025 Начало 
	МассивСтатусовДляПолученияКомментария = Новый Массив;
	МассивСтатусовДляПолученияКомментария.Добавить(Справочники.СтатусыДокументов.ОтклоненаВУПП);
	МассивСтатусовДляПолученияКомментария.Добавить(Справочники.СтатусыДокументов.НеСогласована);	
	Запрос.УстановитьПараметр("МассивСтатусовДляПолученияКомментария",МассивСтатусовДляПолученияКомментария);
	//Евросиб СубботинВ #107464 05.06.2025 Конец	
	
	//Евросиб СубботинВ # 19.03.2025 Начало 
	Запрос.УстановитьПараметр("СобытиеОшибкаПередачиЗаявкиВУПП",Справочники.СобытияОтправкиДокументов.ОшибкаПередачиЗаявкиВУПП);
	//Евросиб СубботинВ # 19.03.2025 Конец

	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	//РезультатЗапроса = Запрос.Выполнить();
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	//Евросиб СубботинВ #102687 14.02.2025 Конец
	
	//Евросиб СубботинВ #102687 14.02.2025 Начало// переделал на пакеты
	//ВыборкаСобытие = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "КлючевыеПоляСобытийОтправкиДокументов"); //выставленные РТУ
	ВыборкаСобытие = РезультатЗапроса[2].Выбрать(); //выставленные РТУ	
	ВыборкаПоУслугамВнеСтавки = РезультатЗапроса[6].Выгрузить();
	//Евросиб СубботинВ #102687 14.02.2025 Конец
	//Евросиб СубботинВ #107464 05.06.2025 Начало 
	ВыборкаПоПоследнимСтатусамЗаявок = РезультатЗапроса[9].Выгрузить(); 
	//Евросиб СубботинВ #107464 05.06.2025 Конец 
	//Евросиб СубботинВ #111466 09.06.2025 Начало
	ВыборкаПоПротоколамОбмена = РезультатЗапроса[10].Выгрузить();
	//Евросиб СубботинВ #111466 09.06.2025 Конец
	
	//Евросиб(ДИТ), Беляев СЮ, US 111184 / TA 111245, 11-06-2025, начало
	ПолучателиУведомленийРТУнаПремии = ПолучитьПолучателейУведомленийРТУнаПремии();
	//Евросиб(ДИТ), Беляев СЮ, US 111184 / TA 111245, 11-06-2025, конец
		
	Пока ВыборкаСобытие.Следующий() Цикл
		//Евросиб(ДИТ), Беляев СЮ, US 111184 / TA 111245, 11-06-2025, начало
		УслугаПремия = Ложь;
		//Евросиб(ДИТ), Беляев СЮ, US 111184 / TA 111245, 11-06-2025, конец
		Если ТИПЗНЧ(ВыборкаСобытие.КлючевыеПоляСобытийОтправкиДокументов.Документ) = ТИП("СправочникСсылка.Диадок_Документы") Тогда 
			ДокументСобытия = ВыборкаСобытие.КлючевыеПоляСобытийОтправкиДокументов.Документ.Документ;
        Иначе
			ДокументСобытия = ВыборкаСобытие.КлючевыеПоляСобытийОтправкиДокументов.Документ;
		КонецЕсли;
		Событие = ВыборкаСобытие.КлючевыеПоляСобытийОтправкиДокументов.Событие;
		ПолучательКопии = Неопределено;
		ПочтаПолучателяКопии = Неопределено;
		ТипТекстаЭлектронногоПисьма = Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст;
		Если ТипЗнч(ДокументСобытия) = ТИП("ДокументСсылка.РеализацияТоваровУслуг") 
			или ТипЗнч(ДокументСобытия) = ТИП("ДокументСсылка.ОтчетКомитентуОПродажах")
			или ТипЗнч(ДокументСобытия) = ТИП("ДокументСсылка.КорректировкаРеализации") Тогда		

			РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСобытия,"ДоговорКонтрагента, Контрагент, ДатаДокумента, НомерДляПечати");
			//Определение Получателя в зависимости от события
			Если Событие = Справочники.СобытияОтправкиДокументов.СозданиеДокумента Тогда  
				Получатель = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственного(Новый Структура("Договор, ЦФО, ТипОтветственного",
																				РеквизитыДокумента.ДоговорКонтрагента,
																				Справочники.ЦентрыФинансовойОтветственности.ОсновнойЦФО,
																				Перечисления.ТипыОтветственных.ОтветственныйЗаСопровождение));
																				
			ИначеЕсли Событие = Справочники.СобытияОтправкиДокументов.ОтказаноВПодписиДиадок Тогда
				Получатель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСобытия, "Автор");
				//ПолучательКопии = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаСобытие.КлючевыеПоляСобытийОтправкиДокументов.Документ,"Подписант"); 
				//Евросиб(ДИТ), Беляев СЮ, BUG 92593 / TA 92595, 07-10-2024, начало
				ПолучательКопии =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаСобытие.КлючевыеПоляСобытийОтправкиДокументов, "Подписант");
				//Евросиб(ДИТ), Беляев СЮ, BUG 92593 / TA 92595, 07-10-2024, конец
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0382126, 15-01-2025, начало
			ИначеЕсли Событие = Справочники.СобытияОтправкиДокументов.ТребуетсяАннулирование Тогда
				Получатель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСобытия, "Автор");
				ПолучательКопии =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаСобытие.КлючевыеПоляСобытийОтправкиДокументов, "Подписант");
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0382126, 15-01-2025, конец
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0389212, 30-06-2025, начало
			ИначеЕсли Событие = Справочники.СобытияОтправкиДокументов.ТребуетсяУточнениеДиадок Тогда
				Получатель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСобытия, "Автор");
				ПолучательКопии =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаСобытие.КлючевыеПоляСобытийОтправкиДокументов, "Подписант");
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0389212, 30-06-2025, конец
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0389212, 30-06-2025, начало
			ИначеЕсли Событие = Справочники.СобытияОтправкиДокументов.ОтказаноВАннулированииДиадок Тогда
				Получатель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСобытия, "Автор");
				ПолучательКопии =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаСобытие.КлючевыеПоляСобытийОтправкиДокументов, "Подписант");
			//Евросиб(ДИТ), Беляев СЮ, Ticket#0389212, 30-06-2025, конец
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Получатель) Тогда 
				//Евросиб СубботинВ #104218 13.03.2025 Начало 
				//ПочтаПолучателя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Получатель, Справочники.ВидыКонтактнойИнформации.EmailПользователя);				
				//Евросиб СубботинВ #104218 13.03.2025 Конец 
				//Выбор Алгоритма в зависимости от события 
				Если Событие = Справочники.СобытияОтправкиДокументов.СозданиеДокумента Тогда  //создание дока			
					ДанныеЗаполненияШапки = Новый Структура("Документ, Контрагент, Договор", ДокументСобытия, РеквизитыДокумента.Контрагент, РеквизитыДокумента.ДоговорКонтрагента);
					ТемаПисьма = "Уведомление о выставлении РТУ по доп. услугам";
					ТипТекстаЭлектронногоПисьма = Перечисления.ТипыТекстовЭлектронныхПисем.HTML;
										
					//ТекстСообщения = СформироватьТекстШапкиСообщенияУведомленияСозданиеРТУ(ДанныеЗаполненияШапки);
					
					//Евросиб(ДИТ), Беляев СЮ, US 111184 / TA 111245, 11-06-2025, начало
					СтруктураПоиска = Новый Структура("КлючевыеПоляСобытийОтправкиДокументов",ВыборкаСобытие.КлючевыеПоляСобытийОтправкиДокументов);
					ВыборкаПоСобытию = ВыборкаПоУслугамВнеСтавки.НайтиСтроки(СтруктураПоиска);
					Для Каждого СтрокаУслуг из ВыборкаПоСобытию Цикл
						Если СтрокаУслуг.Услуга = Справочники.Номенклатура.Премия Тогда
							УслугаПремия = Истина;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если УслугаПремия Тогда
						ТемаПисьма = "Уведомление о выставлении РТУ по премиям";
						ТекстСообщения = СформироватьТекстШапкиСообщенияУведомленияСозданиеРТУ_Премия(ДанныеЗаполненияШапки);
					Иначе
						ТекстСообщения = СформироватьТекстШапкиСообщенияУведомленияСозданиеРТУ(ДанныеЗаполненияШапки);
					КонецЕсли;
					//Евросиб(ДИТ), Беляев СЮ, US 111184 / TA 111245, 11-06-2025, конец
						
					//Евросиб СубботинВ #102687 14.02.2025 Начало //случилась оптимизация и подвел под единый алгоритм, где события идут через объединение,а доп инфа в пакетах
					//ВыборкаДетальныеЗаписи = ВыборкаСобытие.Выбрать();
					//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  //формирование строк таблицы в сообщении					
					//	ДанныеЗаполнения = Новый Структура("Документ, Услуга, Сделка", ДокументСобытия, ВыборкаДетальныеЗаписи.Услуга, ВыборкаДетальныеЗаписи.Сделка);
					//	ТекстСообщения = ТекстСообщения + СформироватьТекстСтрокиСообщенияУведомленияРТУ(ДанныеЗаполнения);					
					//КонецЦикла;
					//Евросиб(ДИТ), Беляев СЮ, US 111184 / TA 111245, 11-06-2025, начало (перенес блок кода выше)
					//СтруктураПоиска = Новый Структура("КлючевыеПоляСобытийОтправкиДокументов",ВыборкаСобытие.КлючевыеПоляСобытийОтправкиДокументов);
					//ВыборкаПоСобытию = ВыборкаПоУслугамВнеСтавки.НайтиСтроки(СтруктураПоиска);
					//Евросиб(ДИТ), Беляев СЮ, US 111184 / TA 111245, 11-06-2025, конец
					Для Каждого СтрокаУслуг из ВыборкаПоСобытию Цикл				
						ДанныеЗаполнения = Новый Структура("Документ, Услуга, Сделка", ДокументСобытия, СтрокаУслуг.Услуга, СтрокаУслуг.Сделка);
						ТекстСообщения = ТекстСообщения + СформироватьТекстСтрокиСообщенияУведомленияРТУ(ДанныеЗаполнения);					
					КонецЦикла;				
					//Евросиб СубботинВ #102687 14.02.2025 Конец

					ТекстСообщения = ТекстСообщения  + "</tbody></table>";
				//	
				//ИначеЕсли Событие = Справочники.СобытияОтправкиДокументов.ИзменениеДатыРТУ Тогда //изменение даты 
				//	ТемаПисьма = "Уведомлении об изменении даты РТУ по доп Услугам";
				//	ТекстСообщения = "По документу " +  ДокументСобытия + " необходима повторная отправку документов клиенту (изменена дата)"; 
					
				ИначеЕсли Событие = Справочники.СобытияОтправкиДокументов.ОтказаноВПодписиДиадок Тогда //ОтказПодписи	
					ТемаПисьма = "Контрагент отказал в подписи";
					ТекстСообщения = СтрШаблон("Контрагент %1, договор %2 отказал в подписи %3 с номером %4 от %5 ",
												РеквизитыДокумента.Контрагент, РеквизитыДокумента.ДоговорКонтрагента, 
												ТипЗнч(ДокументСобытия), РеквизитыДокумента.НомерДляПечати, РеквизитыДокумента.ДатаДокумента)
												+ Символы.ПС + Символы.ПС + "Данное письмо сформировано автоматически! Не отвечайте на это письмо!"; 
												
				//Евросиб(ДИТ), Беляев СЮ, Ticket#0382126, 15-01-2025, начало
				ИначеЕсли Событие = Справочники.СобытияОтправкиДокументов.ТребуетсяАннулирование Тогда
					ТемаПисьма = "Требуется аннулирование";
					ТекстСообщения = СтрШаблон("Контрагент %1, договор %2 требует аннулирования %3 с номером %4 от %5 ",
					РеквизитыДокумента.Контрагент, РеквизитыДокумента.ДоговорКонтрагента, 
					ТипЗнч(ДокументСобытия), РеквизитыДокумента.НомерДляПечати, РеквизитыДокумента.ДатаДокумента)
					+ Символы.ПС + Символы.ПС + "Данное письмо сформировано автоматически! Не отвечайте на это письмо!"; 
				//Евросиб(ДИТ), Беляев СЮ, Ticket#0382126, 15-01-2025, конец
				//Евросиб(ДИТ), Беляев СЮ, Ticket#0389212, 30-06-2025, начало
				ИначеЕсли Событие = Справочники.СобытияОтправкиДокументов.ТребуетсяУточнениеДиадок Тогда
					ТемаПисьма = "Требуется уточнение";
					ТекстСообщения = СтрШаблон("Контрагент %1, договор %2 требует уточнения по %3 с номером %4 от %5 ",
					РеквизитыДокумента.Контрагент, РеквизитыДокумента.ДоговорКонтрагента, 
					ТипЗнч(ДокументСобытия), РеквизитыДокумента.НомерДляПечати, РеквизитыДокумента.ДатаДокумента)
					+ Символы.ПС + Символы.ПС + "Данное письмо сформировано автоматически! Не отвечайте на это письмо!"; 
				//Евросиб(ДИТ), Беляев СЮ, Ticket#0389212, 30-06-2025, конец
				//Евросиб(ДИТ), Беляев СЮ, Ticket#0389212, 30-06-2025, начало
				ИначеЕсли Событие = Справочники.СобытияОтправкиДокументов.ОтказаноВАннулированииДиадок Тогда
					ТемаПисьма = "Отказано в аннулировании";
					ТекстСообщения = СтрШаблон("Контрагент %1, договор %2 отказано в аннулировании по %3 с номером %4 от %5 ",
					РеквизитыДокумента.Контрагент, РеквизитыДокумента.ДоговорКонтрагента, 
					ТипЗнч(ДокументСобытия), РеквизитыДокумента.НомерДляПечати, РеквизитыДокумента.ДатаДокумента)
					+ Символы.ПС + Символы.ПС + "Данное письмо сформировано автоматически! Не отвечайте на это письмо!"; 
				//Евросиб(ДИТ), Беляев СЮ, Ticket#0389212, 30-06-2025, конец
			КонецЕсли;
			//Евросиб СубботинВ #104218 13.03.2025 Начало 
			//Если ЗначениеЗаполнено(ПолучательКопии) Тогда
			//	ПочтаПолучателяКопии = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПолучательКопии, Справочники.ВидыКонтактнойИнформации.EmailПользователя);	
			//КонецЕсли;
			//Евросиб СубботинВ #104218 13.03.2025 Конец 
				
				//Евросиб СубботинВ #104218 13.03.2025 Начало //добавил возможность работы с массивом получателей
				МассивПолучателей = Новый Массив;
				МассивПолучателей.Добавить(Получатель);
				МассивПолучателейКопии = Новый Массив;
				Если ЗначениеЗаполнено(ПолучательКопии) Тогда
					МассивПолучателейКопии.Добавить(ПолучательКопии);
				КонецЕсли;
				//Евросиб(ДИТ), Беляев СЮ, US 111184 / TA 111245, 11-06-2025, начало
				Если УслугаПремия Тогда
					МассивПолучателей.Очистить();
					МассивПолучателейКопии.Очистить();
					ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивПолучателей, ПолучателиУведомленийРТУнаПремии, Истина);
					Если МассивПолучателей.Количество() = 0 Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				//Евросиб(ДИТ), Беляев СЮ, US 111184 / TA 111245, 11-06-2025, конец
											
				//Письмо = СоздатьПисьмоУведомление(Получатель, ПочтаПолучателя, ТемаПисьма,
				//								 ТипТекстаЭлектронногоПисьма,  ТекстСообщения, ПолучательКопии, ПочтаПолучателяКопии);
				
				Письмо = СоздатьПисьмоУведомление(МассивПолучателей, ТемаПисьма,
												 ТипТекстаЭлектронногоПисьма,  ТекстСообщения, МассивПолучателейКопии); 				
				//Евросиб СубботинВ #104218 13.03.2025 Конец 

				ДобавитьЗаписьПоРассылкеДокументов(ВыборкаСобытие.КлючевыеПоляСобытийОтправкиДокументов, Письмо);
			Иначе 
				Продолжить	
			КонецЕсли;
			
			//Евросиб СубботинВ #89527 30.10.2024 Начало 
		ИначеЕсли ТипЗнч(ДокументСобытия) = ТИП("ДокументСсылка.ЗаявкаНаОплату") Тогда //заявка на оплату
			//Евросиб СубботинВ #107464 05.06.2025 Начало 
			//РеквизитыЗаявки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСобытия, "ОтветственныйЗаОплату,Состояния, ДоговорКонтрагента, Автор"); 
			РеквизитыЗаявки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСобытия, "ОтветственныйЗаОплату, Состояния, ДоговорКонтрагента, Автор,
																							|Номер, ДатаПланируемойОплаты, Дата"); 
			
			ПоследнийСтатусТекущейзадачи = ВыборкаПоПоследнимСтатусамЗаявок.Найти(ДокументСобытия, "Объект");
			Если ПоследнийСтатусТекущейзадачи = Неопределено Тогда
				Комментарий = "";
			Иначе
				Комментарий = ПоследнийСтатусТекущейзадачи.Комментарий;	
			КонецЕсли;
			//Евросиб СубботинВ #107464 05.06.2025 Конец
			
			//Евросиб СубботинВ #111466 09.06.2025 Начало
			ПротоколОбменаПоДокументу = ВыборкаПоПротоколамОбмена.Найти(ДокументСобытия, "Объект");
			Если ПротоколОбменаПоДокументу = Неопределено Тогда
				ДатаПланируемойОплатыУПП = "";
			Иначе
				ДатаПланируемойОплатыУПП = ПротоколОбменаПоДокументу.ДатаПланируемойОплатыУПП;	
			КонецЕсли;
			//Евросиб СубботинВ #111466 09.06.2025 Конец

			 //Евросиб СубботинВ #97103 16.12.2024 Начало// вынес общую инфу до определения события
			ТипТекстаЭлектронногоПисьма = Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст;
			//Евросиб СубботинВ #105221 19.03.2025 Начало
			//ВидыСправочнойИнформации = Новый Массив;
			//ВидыСправочнойИнформации.Добавить(Справочники.ВидыКонтактнойИнформации.EmailПользователя);
			//Евросиб СубботинВ #105221 19.03.2025 Конец
			
			МассивПолучателей = Новый Массив;			
			//Евросиб СубботинВ #105221 19.03.2025 Начало
			МассивПолучателейКопии = Новый Массив;
			Подписант = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаСобытие.КлючевыеПоляСобытийОтправкиДокументов, "Подписант"); 
			//Евросиб СубботинВ #105221 19.03.2025 Конец
			МассивПолучателей.Добавить(РеквизитыЗаявки.ОтветственныйЗаОплату);				
			//Евросиб СубботинВ #89527 30.10.2024 Начало добавил автора реестра
			Если ЗначениеЗаполнено(Подписант) Тогда
				МассивПолучателей.Добавить(Подписант); 
			КонецЕсли;
			//Евросиб СубботинВ #89527 30.10.2024 Конец
			//Евросиб СубботинВ #105221 19.03.2025 Начало
			ТаблицаСогласования = РеквизитыЗаявки.Состояния.выгрузить();
			Для Каждого Согласовант из ТаблицаСогласования Цикл
				Если ТипЗнч(Согласовант.Исполнитель) = Тип("СправочникСсылка.Пользователи") Тогда
					МассивПолучателей.Добавить(Согласовант.Исполнитель);
				КонецЕсли;
			КонецЦикла;
			//Евросиб СубботинВ #97103 16.12.2024 Конец
			//Евросиб СубботинВ #97103 16.12.2024 Начало
			Если Событие = Справочники.СобытияОтправкиДокументов.ОтклонениеЗаявкиНаОплатуВУПП Тогда
				//Евросиб СубботинВ #97103 16.12.2024 Начало					
				ТемаПисьма = "Заявка на оплату (" + ДокументСобытия + ") отклонена";
				//Евросиб СубботинВ #107464 05.06.2025 Начало
				//Евросиб СубботинВ #129659 05.02.2026 Начало
				МассивПолучателей.Добавить(РеквизитыЗаявки.Автор);
				//Евросиб СубботинВ #129659 05.02.2026 Конец
				//ТекстСообщения = СтрШаблон("Заявка на оплату (" + ДокументСобытия + ") отклонена")
				//+ Символы.ПС + Символы.ПС + "Данное письмо сформировано автоматически! Не отвечайте на это письмо!";
				ТекстСообщения = СтрШаблон("%1  с датой планируемой оплаты %2 отклонена в УПП по причине ""%3.""",
											ДокументСобытия, РеквизитыЗаявки.ДатаПланируемойОплаты, Комментарий)			
											+ Символы.ПС + Символы.ПС + "Данное письмо сформировано автоматически! Не отвечайте на это письмо!";			
				//Евросиб СубботинВ #107464 05.06.2025 Конец 
				
				//Евросиб СубботинВ #97103 16.12.2024 Начало	
			ИначеЕсли Событие = Справочники.СобытияОтправкиДокументов.УтверждениеЗаявкиНаОплатуУПП Тогда
				МассивПолучателей.Добавить(РеквизитыЗаявки.Автор);
				ТемаПисьма = "Заявка на оплату (" + ДокументСобытия + ") Утверждена";
				ТекстСообщения = СтрШаблон("Заявка на оплату (" + ДокументСобытия + ") сменила статус в УПП с «Отклонена» на «Утверждена»")
				+ Символы.ПС + Символы.ПС + "Данное письмо сформировано автоматически! Не отвечайте на это письмо!";
				
				//Евросиб СубботинВ #107464 05.06.2025 Начало 
			ИначеЕсли Событие = Справочники.СобытияОтправкиДокументов.ОтклонениеЗаявкиВDC Тогда
				//систим получаетелей, т.к получить письмо должен только ответственный
				МассивПолучателей.Очистить();
				МассивПолучателей.Добавить(РеквизитыЗаявки.ОтветственныйЗаОплату);
				//Евросиб СубботинВ #129659 05.02.2026 Начало
				МассивПолучателей.Добавить(РеквизитыЗаявки.Автор);
				//Евросиб СубботинВ #129659 05.02.2026 Конец
				ТемаПисьма = "Заявка на оплату (" + ДокументСобытия + ") Не согласована в DC";
				ТекстСообщения = СтрШаблон("%1  с датой планируемой оплаты %2 не согласована в DC по причине ""%3.""",
											ДокументСобытия, РеквизитыЗаявки.ДатаПланируемойОплаты, Комментарий)			
											+ Символы.ПС + Символы.ПС + "Данное письмо сформировано автоматически! Не отвечайте на это письмо!";				
				//Евросиб СубботинВ #107464 05.06.2025 Конец
				
			//Евросиб СубботинВ #111466 09.06.2025 Начало
			ИначеЕсли Событие = Справочники.СобытияОтправкиДокументов.ИзмененаДатаОплатыВУПП Тогда					
				МассивПолучателей.Очистить();
				МассивПолучателей.Добавить(РеквизитыЗаявки.ОтветственныйЗаОплату);
				МассивПолучателей.Добавить(РеквизитыЗаявки.Автор);
				ТемаПисьма = "Изменена дата оплаты в УПП  по документу: " + ДокументСобытия;
				ТекстСообщения = СтрШаблон("Изменена дата планируемой оплаты документа %1 с %2 на %3",	ДокументСобытия, РеквизитыЗаявки.ДатаПланируемойОплаты, ДатаПланируемойОплатыУПП)			
				+ Символы.ПС + Символы.ПС + "Данное письмо сформировано автоматически! Не отвечайте на это письмо!";				
			//Евросиб СубботинВ #111466 09.06.2025 Конец
			
			//Евросиб СубботинВ #114616 20.08.2025 Начало
			ИначеЕсли Событие = Справочники.СобытияОтправкиДокументов.ОшибкаЗагрузкиППБитФинанс Тогда
				
				МассивПолучателей.Очистить();
				МассивПолучателей.Добавить(РеквизитыЗаявки.ОтветственныйЗаОплату);
				
				ПолучателиУведомлений = Константы.ПолучателиУведомленийОРегЗаданиях.Получить(); 
				
				Если ЗначениеЗаполнено(ПолучателиУведомлений) Тогда					
					Если  ТипЗнч(ПолучателиУведомлений) = Тип("СправочникСсылка.Пользователи") Тогда
						МассивПолучателей.Добавить(ПолучателиУведомлений);
					Иначе	
						Для Каждого ТекущийПользователь Из ПолучателиУведомлений.Состав Цикл								
							МассивПолучателей.Добавить(ТекущийПользователь.Пользователь);
						КонецЦикла;
					КонецЕсли;
				Иначе
					Продолжить;
				КонецЕсли;	
				
                ТемаПисьма = "По документу: " + ДокументСобытия + " не удалось загрузить ПП из Бит финанса";
				ТекстСообщения = СтрШаблон("По документу %1 не удалось загрузить ПП из Бит финанса. Подробности в Регистре сведений ""История Обменов""", ДокументСобытия)			
											+ Символы.ПС + Символы.ПС + "Данное письмо сформировано автоматически! Не отвечайте на это письмо!";				
			//Евросиб СубботинВ #114616 20.08.2025 Конец
			
			КонецЕсли;
			//Евросиб СубботинВ #97103 16.12.2024 Конец
			//Евросиб СубботинВ #105221 19.03.2025 Начало
			
			
			//ПочтыПолучателейПисьма = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(МассивПолучателей,, ВидыСправочнойИнформации);
			
			//Евросиб СубботинВ #105221 19.03.2025 Начало
			//Если МассивПолучателейКопии.Количество() >0 Тогда 				
			//	ПочтыПолучателейКопииПисьма = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(МассивПолучателейКопии,, ВидыСправочнойИнформации);
			//Иначе
			//	ПочтыПолучателейКопииПисьма = Неопределено;
			//КонецЕсли;
			//Евросиб СубботинВ #105221 19.03.2025 Конец

			//Евросиб СубботинВ #104218 13.03.2025 Начало //добавил возможность работы с массивом получателей 
			//Для Каждого Получатель из ПочтыПолучателейПисьма Цикл
			//	Письмо = СоздатьПисьмоУведомление(Получатель.Объект, Получатель.Представление, ТемаПисьма,
			//	ТипТекстаЭлектронногоПисьма,  ТекстСообщения); 				
			//	ДобавитьЗаписьПоРассылкеДокументов(ВыборкаСобытие.КлючевыеПоляСобытийОтправкиДокументов, Письмо);
			//КонецЦикла;
			Письмо = СоздатьПисьмоУведомление(МассивПолучателей, ТемаПисьма,
											  ТипТекстаЭлектронногоПисьма, ТекстСообщения, МассивПолучателейКопии); 				
			ДобавитьЗаписьПоРассылкеДокументов(ВыборкаСобытие.КлючевыеПоляСобытийОтправкиДокументов, Письмо);
			//Евросиб СубботинВ #104218 13.03.2025 Конец
				
		ИначеЕсли ТипЗнч(ДокументСобытия) = ТИП("ДокументСсылка.РеестрПлатежей") Тогда // реестр платежей
			
			Получатель =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаСобытие.КлючевыеПоляСобытийОтправкиДокументов, "Подписант");
			//ПочтаПолучателя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Получатель, Справочники.ВидыКонтактнойИнформации.EmailПользователя);				
			
			ТипТекстаЭлектронногоПисьма = Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст;
			Если Событие = Справочники.СобытияОтправкиДокументов.НеСогласованРеестрПлатежей Тогда //тема и текст не согласования
				ПараметрШаблона = "не согласован";
			ИначеЕсли Событие = Справочники.СобытияОтправкиДокументов.НеУтвержденРеестрПлатежей Тогда   //тема и текст не утверждения 
				ПараметрШаблона = "не утвержден"; 
			КонецЕсли;
			
			ТемаПисьма = СтрШаблон("Реестр платежей(" + ДокументСобытия + ") %1", ПараметрШаблона);
			ТекстСообщения = СтрШаблон("Реестр платежей( " + ДокументСобытия + ") %1"
						+ Символы.ПС + Символы.ПС + "Данное письмо сформировано автоматически! Не отвечайте на это письмо!",
						ПараметрШаблона);
						 //Евросиб СубботинВ #104218 13.03.2025 Начало //добавил возможность работы с массивом получателей
			
			 МассивПолучателей = Новый Массив;
			// МассивПолучателей.Добавить(Новый Структура("Объект, Представление", Получатель, ПочтаПолучателя));			
			 МассивПолучателей.Добавить(Получатель);
			//Письмо = СоздатьПисьмоУведомление(Получатель, ПочтаПолучателя, ТемаПисьма,
			//ТипТекстаЭлектронногоПисьма,  ТекстСообщения);
			Письмо = СоздатьПисьмоУведомление(МассивПолучателей, ТемаПисьма,
											  ТипТекстаЭлектронногоПисьма, ТекстСообщения);
			//Евросиб СубботинВ #104218 13.03.2025 Конец

			ДобавитьЗаписьПоРассылкеДокументов(ВыборкаСобытие.КлючевыеПоляСобытийОтправкиДокументов, Письмо);
		КонецЕсли;
		      
	КонецЦикла;	
    //Евросиб СубботинВ #89527 30.10.2024 Конец	
	
	//Евросиб СубботинВ #102687 14.02.2025 Начало
	 ВыборкаПоВыводуИзОперированния = РезультатЗапроса[5].Выбрать(); 	 
	 Пока ВыборкаПоВыводуИзОперированния.СледующийПоЗначениюПоля("Автор") Цикл //формируем письма по авторам
		 МассивОтработанныхКлючевыхСобытийПоАвтору = Новый Массив;
		 Автор = ВыборкаПоВыводуИзОперированния.Автор;
		 Если ЗначениеЗаполнено(Автор) Тогда
			 //ПочтаПолучателя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Автор, Справочники.ВидыКонтактнойИнформации.EmailПользователя);		 
			 ТипТекстаЭлектронногоПисьма = Перечисления.ТипыТекстовЭлектронныхПисем.HTML;
			 ТемаПисьма = "Контроль вывода КТК из оперирования";
			 ТекстСообщения = СформироватьТекстШапкиСообщенияВыводИзОперирования(Автор);			 
			 Пока ВыборкаПоВыводуИзОперированния.Следующий() Цикл  //обход ключей (ключ = ктк)
				 ТекстСообщения = ТекстСообщения + СформироватьТекстСтрокиСообщенияВыводИзОперирования(ВыборкаПоВыводуИзОперированния);
				 МассивОтработанныхКлючевыхСобытийПоАвтору.Добавить(ВыборкаПоВыводуИзОперированния.КлючевыеПоляСобытийОтправкиДокументов);
			 КонецЦикла;
			 ТекстСообщения = ТекстСообщения  + "</tbody></table>";
			 
			 //Евросиб СубботинВ #104218 13.03.2025 Начало //добавил возможность работы с массивом получателей
			 МассивПолучателей = Новый Массив;
			 МассивПолучателей.Добавить(Автор);			 
			 //Письмо = СоздатьПисьмоУведомление(Автор, ПочтаПолучателя, ТемаПисьма,
			 //ТипТекстаЭлектронногоПисьма, ТекстСообщения);
			 Письмо = СоздатьПисьмоУведомление(МассивПолучателей, ТемаПисьма,
			 ТипТекстаЭлектронногоПисьма, ТекстСообщения);			 
			 //Евросиб СубботинВ #104218 13.03.2025 Конец
			 
			 //фиксация ключей и Эл Письма, в которое они включены
			 Для каждого ОбработанноеКлючевоеСобытие из МассивОтработанныхКлючевыхСобытийПоАвтору Цикл
			 	ДобавитьЗаписьПоРассылкеДокументов(ОбработанноеКлючевоеСобытие, Письмо);
			КонецЦикла;
			
		 КонецЕсли; 
	 КонецЦикла;
	 //Евросиб СубботинВ #102687 14.02.2025 Конец 
	 
	 //Евросиб СубботинВ #105221 19.03.2025 Начало
	 ВыборкаПоОшибкамПередачиЗаявкиВУПП = РезультатЗапроса[8].Выбрать(); 	 
	 Пока ВыборкаПоОшибкамПередачиЗаявкиВУПП.СледующийПоЗначениюПоля("Реестр") Цикл //формируем письма по Реестрам
		 МассивПолучателей = Новый Массив;
		 МассивОтработанныхКлючевыхСобытий = Новый Массив; 
		 МассивПолучателейКопии = Новый Массив;			
		 АвторРеестра = ВыборкаПоОшибкамПередачиЗаявкиВУПП.АвторРеестра;
		 МассивПолучателейКопии.Добавить(АвторРеестра);			
		 ТипТекстаЭлектронногоПисьма = Перечисления.ТипыТекстовЭлектронныхПисем.HTML;
		 ТемаПисьма = "Ошибки по выгрузке заявок включенных в " + ВыборкаПоОшибкамПередачиЗаявкиВУПП.Реестр;
		 ТекстСообщения = СформироватьТекстШапкиСообщенияПоОшибкамПередачиЗаявкиВУПП();			 
		 Пока ВыборкаПоОшибкамПередачиЗаявкиВУПП.Следующий() Цикл  //обход заявок
			 ТекстСообщения = ТекстСообщения + СформироватьТекстСтрокиСообщенияПоОшибкамПередачиЗаявкиВУПП(ВыборкаПоОшибкамПередачиЗаявкиВУПП); 
			 МассивПолучателейКопии.Добавить(ВыборкаПоОшибкамПередачиЗаявкиВУПП.Автор);
			 МассивПолучателейКопии.Добавить(ВыборкаПоОшибкамПередачиЗаявкиВУПП.ОтветственныйЗаОплату);
			 МассивОтработанныхКлючевыхСобытий.Добавить(ВыборкаПоОшибкамПередачиЗаявкиВУПП.КлючевыеПоляСобытийОтправкиДокументов);
		 КонецЦикла;
		 ТекстСообщения = ТекстСообщения  + "</tbody></table>";
		 
		 Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(МассивПолучателейКопии);
		 
		 ПолучателиУведомлений = Константы.ПолучателиУведомленийОРегЗаданиях.Получить();
		 Если Не ЗначениеЗаполнено(ПолучателиУведомлений) Тогда  //если основных получателей нет, отпраяляем получателем копии как основным
			 МассивПолучателей = ОбщегоНазначения.СкопироватьРекурсивно(МассивПолучателейКопии);
			 МассивПолучателейКопии.Очистить();					
		 ИначеЕсли ТипЗнч(ПолучателиУведомлений) = Тип("СправочникСсылка.Пользователи") Тогда
			 МассивПолучателей.Добавить(ПолучателиУведомлений);
		 Иначе	
			 Для Каждого ТекущийПользователь Из ПолучателиУведомлений.Состав Цикл								
				 МассивПолучателей.Добавить(ТекущийПользователь.Пользователь);
			 КонецЦикла;
		 КонецЕсли;			
		 
		 Письмо = СоздатьПисьмоУведомление(МассивПолучателей, ТемаПисьма,
		 ТипТекстаЭлектронногоПисьма, ТекстСообщения, МассивПолучателейКопии);
		 Для каждого КлючевоеСобытие из МассивОтработанныхКлючевыхСобытий Цикл
			 ДобавитьЗаписьПоРассылкеДокументов(КлючевоеСобытие, Письмо);
		 КонецЦикла;
		 
	 КонецЦикла;
	//Евросиб СубботинВ #105221 19.03.2025 Конец
 

КонецПроцедуры	

//Евросиб(ДИТ), Беляев СЮ, US 111184 / TA 111245, 11-06-2025, начало
Функция ПолучитьПолучателейУведомленийРТУнаПремии()
	
	Участники = Константы.ГруппаПолучателейПоРассылкеРТУнаПремии.Получить();
	ПолучателиПисьма = Новый Массив;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.EmailПользователя);
	
	Если ТипЗнч(Участники) = Тип("СправочникСсылка.Пользователи") Тогда
		ПолучателиПисьма.Добавить(Участники);
	Иначе
		Участники = Пользователи_sd_сервер.ПолучитьПользователейГруппы(Участники);
		Для Каждого Участник из Участники Цикл
			ПолучателиПисьма.Добавить(Участник);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ПолучателиПисьма;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 111184 / TA 111245, 11-06-2025, конец
  
Функция СформироватьТекстШапкиСообщенияВыводИзОперирования(Автор)
		 
	ТекстПисьма = СтрШаблон("Уважаемый %1, на сегодня в системе присутствуют контейнеры, которые не выведены из оперирования.
		 					|По данным контейнерам начался период СНП. Прошу закрыть цикл пользования контейнера", Автор);
	
	ТекстПисьма = ТекстПисьма + Символы.ПС + "<table border=""1""><tbody><th>Контейнер</th><th>Номер 1С Релиза</th>
	|<th>Дата релиза </th><th>НомерДокумента</th><th>Итого</th><th>Осталось к возврату</th><th>Автор</th>";
	
	Возврат ТекстПисьма	
	
КонецФункции
 
Функция СформироватьТекстСтрокиСообщенияВыводИзОперирования(ДанныеЗаполнения)
		 
	ТекстПисьма = Символы.ПС + "<tr>";
	ТекстПисьма = ТекстПисьма + "<td>" + ДанныеЗаполнения.Контейнер + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + ДанныеЗаполнения.Номер + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + ДанныеЗаполнения.Дата + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + ДанныеЗаполнения.НомерДокумента + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + ДанныеЗаполнения.ОбщееКоличествоВРелизе + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + ДанныеЗаполнения.ОсталосьКВыдаче + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + ДанныеЗаполнения.Автор + "</td>";
	ТекстПисьма = ТекстПисьма + "</tr>";    
		
	Возврат ТекстПисьма	
	
КонецФункции 

//Евросиб СубботинВ #102687 14.02.2025 Конец

//Евросиб СубботинВ #105221 19.03.2025 Начало
Функция СформироватьТекстШапкиСообщенияПоОшибкамПередачиЗаявкиВУПП()
	
	ТекстПисьма = СтрШаблон("Заявки не удалось выгрузить в УПП. Создан запрос в службу поддержки.");

    ТекстПисьма = ТекстПисьма + Символы.ПС + "<table border=""1""><tbody><th>Заявка</th><th>Информация об ошибке</th>";
	Возврат ТекстПисьма
    
КонецФункции

Функция СформироватьТекстСтрокиСообщенияПоОшибкамПередачиЗаявкиВУПП(ДанныеЗаполнения)
		 
	ТекстПисьма = Символы.ПС + "<tr>";
	ТекстПисьма = ТекстПисьма + "<td>" + ДанныеЗаполнения.Заявка + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + ДанныеЗаполнения.ТекстОшибки + "</td>"; 
	ТекстПисьма = ТекстПисьма + "</tr>";    
		
	Возврат ТекстПисьма	
	
КонецФункции
//Евросиб СубботинВ #105221 19.03.2025 Конец

// Евросиб US 90342 Рыбьяков К.А. 14.12.2025 ((
Функция СформироватьТаблицу(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеестрСпециальныхСтавокСпециальныеСтавки.Контрагент КАК Контрагент,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.ПлановыйОбъемTEU КАК ПлановыйОбъемTEU,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.ТипСтавки КАК ТипСтавки,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.ПунктОтправления КАК ПунктОтправления,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.ПунктНазначения КАК ПунктНазначения,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.УсловияПеревозкиОтправление КАК УсловияПеревозкиОтправление,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.УсловияПеревозкиПрибытие КАК УсловияПеревозкиПрибытие,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.ПортОтправления КАК ПортОтправления,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.ПортОтгрузки КАК ПортОтгрузки,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.ПортНазначения КАК ПортНазначения,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.УсловияПогрузки КАК УсловияПогрузки,
	|	РеестрСпециальныхСтавокСпециальныеСтавки.УсловияВыгрузки КАК УсловияВыгрузки,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(36)) КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ВТ_ВыгрузкаСтавокСИдентификатором
	|ИЗ
	|	Документ.РеестрСпециальныхСтавок.СпециальныеСтавки КАК РеестрСпециальныхСтавокСпециальныеСтавки
	|ГДЕ
	|	РеестрСпециальныхСтавокСпециальныеСтавки.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыгрузкаСтавокСИдентификатором.Контрагент КАК Контрагент,
	|	ВТ_ВыгрузкаСтавокСИдентификатором.ПлановыйОбъемTEU КАК ПлановыйОбъемTEU,
	|	ВТ_ВыгрузкаСтавокСИдентификатором.ТипСтавки КАК ТипСтавки,
	|	ВТ_ВыгрузкаСтавокСИдентификатором.ПунктОтправления КАК ПунктОтправления,
	|	ВТ_ВыгрузкаСтавокСИдентификатором.ПунктНазначения КАК ПунктНазначения,
	|	ВТ_ВыгрузкаСтавокСИдентификатором.УсловияПеревозкиОтправление КАК УсловияПеревозкиОтправление,
	|	ВТ_ВыгрузкаСтавокСИдентификатором.УсловияПеревозкиПрибытие КАК УсловияПеревозкиПрибытие,
	|	ВТ_ВыгрузкаСтавокСИдентификатором.ПортОтправления КАК ПортОтправления,
	|	ВТ_ВыгрузкаСтавокСИдентификатором.ПортОтгрузки КАК ПортОтгрузки,
	|	ВТ_ВыгрузкаСтавокСИдентификатором.ПортНазначения КАК ПортНазначения,
	|	ВТ_ВыгрузкаСтавокСИдентификатором.УсловияПогрузки КАК УсловияПогрузки,
	|	ВТ_ВыгрузкаСтавокСИдентификатором.УсловияВыгрузки КАК УсловияВыгрузки,
	|	ВТ_ВыгрузкаСтавокСИдентификатором.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	ВТ_ВыгрузкаСтавокСИдентификатором КАК ВТ_ВыгрузкаСтавокСИдентификатором";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	ВыгрузкаСтавокСИдентификатором = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаВыгрузки Из ВыгрузкаСтавокСИдентификатором Цикл
		СтрокаВыгрузки.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаСтавокСИдентификатором.Контрагент КАК Контрагент,
	|	ТаблицаСтавокСИдентификатором.ПлановыйОбъемTEU КАК ПлановыйОбъемTEU,
	|	ТаблицаСтавокСИдентификатором.ТипСтавки КАК ТипСтавки,
	|	ТаблицаСтавокСИдентификатором.ПунктОтправления КАК ПунктОтправления,
	|	ТаблицаСтавокСИдентификатором.ПунктНазначения КАК ПунктНазначения,
	|	ТаблицаСтавокСИдентификатором.УсловияПеревозкиОтправление КАК УсловияПеревозкиОтправление,
	|	ТаблицаСтавокСИдентификатором.УсловияПеревозкиПрибытие КАК УсловияПеревозкиПрибытие,
	|	ТаблицаСтавокСИдентификатором.ПортОтправления КАК ПортОтправления,
	|	ТаблицаСтавокСИдентификатором.ПортОтгрузки КАК ПортОтгрузки,
	|	ТаблицаСтавокСИдентификатором.ПортНазначения КАК ПортНазначения,
	|	ТаблицаСтавокСИдентификатором.УсловияПогрузки КАК УсловияПогрузки,
	|	ТаблицаСтавокСИдентификатором.УсловияВыгрузки КАК УсловияВыгрузки,
	|	ТаблицаСтавокСИдентификатором.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ВТ_СИдентификатором
	|ИЗ
	|	&ТаблицаСтавокСИдентификатором КАК ТаблицаСтавокСИдентификатором
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСтавокБезИдентификатором.Контрагент КАК Контрагент,
	|	ТаблицаСтавокБезИдентификатором.ПлановыйОбъемTEU КАК ПлановыйОбъемTEU,
	|	ТаблицаСтавокБезИдентификатором.ТипСтавки КАК ТипСтавки,
	|	ТаблицаСтавокБезИдентификатором.ПунктОтправления КАК ПунктОтправления,
	|	ТаблицаСтавокБезИдентификатором.ПунктНазначения КАК ПунктНазначения,
	|	ТаблицаСтавокБезИдентификатором.УсловияПеревозкиОтправление КАК УсловияПеревозкиОтправление,
	|	ТаблицаСтавокБезИдентификатором.УсловияПеревозкиПрибытие КАК УсловияПеревозкиПрибытие,
	|	ТаблицаСтавокБезИдентификатором.ПортОтправления КАК ПортОтправления,
	|	ТаблицаСтавокБезИдентификатором.ПортОтгрузки КАК ПортОтгрузки,
	|	ТаблицаСтавокБезИдентификатором.ПортНазначения КАК ПортНазначения,
	|	ТаблицаСтавокБезИдентификатором.УсловияПогрузки КАК УсловияПогрузки,
	|	ТаблицаСтавокБезИдентификатором.УсловияВыгрузки КАК УсловияВыгрузки,
	|	ТаблицаСтавокБезИдентификатором.ПараметрПеревозки КАК ПараметрПеревозки,
	|	ТаблицаСтавокБезИдентификатором.Ставка КАК Ставка,
	|	ТаблицаСтавокБезИдентификатором.ЭтоПроцентОтСуммы КАК ЭтоПроцентОтСуммы
	|ПОМЕСТИТЬ ВТ_БезИдентификатора
	|ИЗ
	|	Документ.РеестрСпециальныхСтавок.СпециальныеСтавки КАК ТаблицаСтавокБезИдентификатором
	|ГДЕ
	|	ТаблицаСтавокБезИдентификатором.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СИдентификатором.Контрагент КАК Контрагент,
	|	ВТ_СИдентификатором.ПлановыйОбъемTEU КАК ПлановыйОбъемTEU,
	|	ВТ_СИдентификатором.ТипСтавки КАК ТипСтавки,
	|	ВТ_СИдентификатором.ПунктОтправления КАК ПунктОтправления,
	|	ВТ_СИдентификатором.ПунктНазначения КАК ПунктНазначения,
	|	ВТ_СИдентификатором.УсловияПеревозкиОтправление КАК УсловияПеревозкиОтправление,
	|	ВТ_СИдентификатором.УсловияПеревозкиПрибытие КАК УсловияПеревозкиПрибытие,
	|	ВТ_СИдентификатором.ПортОтправления КАК ПортОтправления,
	|	ВТ_СИдентификатором.ПортОтгрузки КАК ПортОтгрузки,
	|	ВТ_СИдентификатором.ПортНазначения КАК ПортНазначения,
	|	ВТ_СИдентификатором.УсловияПогрузки КАК УсловияПогрузки,
	|	ВТ_СИдентификатором.УсловияВыгрузки КАК УсловияВыгрузки,
	|	ВТ_СИдентификатором.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ВТ_БезИдентификатора.ПараметрПеревозки КАК ПараметрПеревозки,
	|	ВТ_БезИдентификатора.Ставка КАК Ставка,
	|	ВТ_БезИдентификатора.ЭтоПроцентОтСуммы КАК ЭтоПроцентОтСуммы
	|ПОМЕСТИТЬ ВТ_ВременнаяТаблица
	|ИЗ
	|	ВТ_БезИдентификатора КАК ВТ_БезИдентификатора
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СИдентификатором КАК ВТ_СИдентификатором
	|		ПО ВТ_БезИдентификатора.Контрагент = ВТ_СИдентификатором.Контрагент
	|			И ВТ_БезИдентификатора.ПлановыйОбъемTEU = ВТ_СИдентификатором.ПлановыйОбъемTEU
	|			И ВТ_БезИдентификатора.ТипСтавки = ВТ_СИдентификатором.ТипСтавки
	|			И ВТ_БезИдентификатора.ПунктОтправления = ВТ_СИдентификатором.ПунктОтправления
	|			И ВТ_БезИдентификатора.ПунктНазначения = ВТ_СИдентификатором.ПунктНазначения
	|			И ВТ_БезИдентификатора.УсловияПеревозкиОтправление = ВТ_СИдентификатором.УсловияПеревозкиОтправление
	|			И ВТ_БезИдентификатора.УсловияПеревозкиПрибытие = ВТ_СИдентификатором.УсловияПеревозкиПрибытие
	|			И ВТ_БезИдентификатора.ПортОтправления = ВТ_СИдентификатором.ПортОтправления
	|			И ВТ_БезИдентификатора.ПортОтгрузки = ВТ_СИдентификатором.ПортОтгрузки
	|			И ВТ_БезИдентификатора.ПортНазначения = ВТ_СИдентификатором.ПортНазначения
	|			И ВТ_БезИдентификатора.УсловияПогрузки = ВТ_СИдентификатором.УсловияПогрузки
	|			И ВТ_БезИдентификатора.УсловияВыгрузки = ВТ_СИдентификатором.УсловияВыгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВременнаяТаблица.Контрагент КАК Контрагент,
	|	ВТ_ВременнаяТаблица.ПлановыйОбъемTEU КАК ПлановыйОбъемTEU,
	|	ВТ_ВременнаяТаблица.ТипСтавки КАК ТипСтавки,
	|	ВТ_ВременнаяТаблица.ПунктОтправления КАК ПунктОтправления,
	|	ВТ_ВременнаяТаблица.ПунктНазначения КАК ПунктНазначения,
	|	ВТ_ВременнаяТаблица.УсловияПеревозкиОтправление КАК УсловияПеревозкиОтправление,
	|	ВТ_ВременнаяТаблица.УсловияПеревозкиПрибытие КАК УсловияПеревозкиПрибытие,
	|	ВТ_ВременнаяТаблица.ПортОтправления КАК ПортОтправления,
	|	ВТ_ВременнаяТаблица.ПортОтгрузки КАК ПортОтгрузки,
	|	ВТ_ВременнаяТаблица.ПортНазначения КАК ПортНазначения,
	|	ВТ_ВременнаяТаблица.УсловияПогрузки КАК УсловияПогрузки,
	|	ВТ_ВременнаяТаблица.УсловияВыгрузки КАК УсловияВыгрузки,
	|	ВТ_ВременнаяТаблица.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ВТ_ВременнаяТаблица.ПараметрПеревозки КАК ПараметрПеревозки,
	|	ВЫБОР 
	|		КОГДА ВТ_ВременнаяТаблица.ЭтоПроцентОтСуммы
	|			ТОГДА СТРОКА(ВТ_ВременнаяТаблица.Ставка) + ""%""
	|		ИНАЧЕ ВТ_ВременнаяТаблица.Ставка
	|	КОНЕЦ КАК Ставка,
	//|	ВТ_ВременнаяТаблица.Ставка КАК Ставка,
	|	ВТ_ВременнаяТаблица.ЭтоПроцентОтСуммы КАК ЭтоПроцентОтСуммы
	|ИЗ
	|	ВТ_ВременнаяТаблица КАК ВТ_ВременнаяТаблица
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИдентификаторСтроки
	|ИТОГИ ПО
	|	Контрагент,
	|	ПлановыйОбъемTEU,
	|	ТипСтавки";
	
	Запрос.УстановитьПараметр("ТаблицаСтавокСИдентификатором", ВыгрузкаСтавокСИдентификатором);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	ВыборкаКонтрагент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТаблицаРезультат = ПолучитьТаблицуСпециальныхСтавок();
	
	Пока ВыборкаКонтрагент.Следующий() Цикл
		ВыборкаПлановыйОбъемTEU = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПлановыйОбъемTEU.Следующий() Цикл
			ВыборкаТипСтавки = ВыборкаПлановыйОбъемTEU.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаТипСтавки.Следующий() Цикл
				ВыборкаДетальныеЗаписи = ВыборкаТипСтавки.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Строка = ПодобратьПодходящуюСтроку(ВыборкаДетальныеЗаписи, ТаблицаРезультат);
					Если Строка <> Неопределено Тогда
						Если ВыборкаДетальныеЗаписи.ПараметрПеревозки.ВидТранспортногоСообщения = Перечисления.ВидыТранспортныхСообщений.ЖД Тогда
							ЗаполнитьСтрокуРезультатаЖД(Строка, ВыборкаДетальныеЗаписи);
						Иначе
							ЗаполнитьСтрокуРезультатаФрахт(Строка, ВыборкаДетальныеЗаписи);
						КонецЕсли;
					Иначе
						НоваяСтрока = ТаблицаРезультат.Добавить();
						Если ВыборкаДетальныеЗаписи.ПараметрПеревозки.ВидТранспортногоСообщения = Перечисления.ВидыТранспортныхСообщений.ЖД Тогда
							ЗаполнитьСтрокуРезультатаЖД(НоваяСтрока, ВыборкаДетальныеЗаписи);
						Иначе
							ЗаполнитьСтрокуРезультатаФрахт(НоваяСтрока, ВыборкаДетальныеЗаписи);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
	
КонецФункции // Евросиб Рыбьяков К.А. 14.12.2025 ))

// Евросиб US 90342 Рыбьяков К.А. 14.12.2025 ((
Функция ПолучитьТаблицуСпециальныхСтавок()
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Число"));
	МассивТипов.Добавить(Тип("Строка"));
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	Таблица.Колонки.Добавить("ПлановыйОбъемTEU", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 0)));
	Таблица.Колонки.Добавить("ТипСтавки");
	Таблица.Колонки.Добавить("ПунктОтправления", Новый ОписаниеТипов("СправочникСсылка.Локации"));
	Таблица.Колонки.Добавить("ПунктНазначения", Новый ОписаниеТипов("СправочникСсылка.Локации"));
	Таблица.Колонки.Добавить("УсловияПеревозкиОтправление");
	Таблица.Колонки.Добавить("УсловияПеревозкиПрибытие");
	Таблица.Колонки.Добавить("ВалютаЖД", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	Таблица.Колонки.Добавить("Ставка20ЖДCOC", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
	Таблица.Колонки.Добавить("Ставка20ЖДSOC", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
	Таблица.Колонки.Добавить("Ставка40ЖДCOC", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
	Таблица.Колонки.Добавить("Ставка40ЖДSOC", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
	Таблица.Колонки.Добавить("ПортОтправления", Новый ОписаниеТипов("СправочникСсылка.Локации"));
	Таблица.Колонки.Добавить("ПортОтгрузки", Новый ОписаниеТипов("СправочникСсылка.Локации"));
	Таблица.Колонки.Добавить("ПортНазначения", Новый ОписаниеТипов("СправочникСсылка.Локации"));
	Таблица.Колонки.Добавить("ВалютаФрахт", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	Таблица.Колонки.Добавить("УсловияПогрузки");
	Таблица.Колонки.Добавить("УсловияВыгрузки");
	Таблица.Колонки.Добавить("Ставка20ФрахтCOC", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
	Таблица.Колонки.Добавить("Ставка20ФрахтSOC", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
	Таблица.Колонки.Добавить("Ставка40ФрахтCOC", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
	Таблица.Колонки.Добавить("Ставка40ФрахтSOC", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
	Таблица.Колонки.Добавить("ВалютаНадбавкиСкидкиЖД", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	Таблица.Колонки.Добавить("НадбавкаСкидка20ЖДCOC", Новый ОписаниеТипов(МассивТипов));
	Таблица.Колонки.Добавить("НадбавкаСкидка20ЖДSOC", Новый ОписаниеТипов(МассивТипов));
	Таблица.Колонки.Добавить("НадбавкаСкидка40ЖДCOC", Новый ОписаниеТипов(МассивТипов));
	Таблица.Колонки.Добавить("НадбавкаСкидка40ЖДSOC", Новый ОписаниеТипов(МассивТипов));
	Таблица.Колонки.Добавить("ВалютаНадбавкиСкидкиФрахт", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	Таблица.Колонки.Добавить("НадбавкаСкидка20ФрахтCOC", Новый ОписаниеТипов(МассивТипов));
	Таблица.Колонки.Добавить("НадбавкаСкидка20ФрахтSOC", Новый ОписаниеТипов(МассивТипов));
	Таблица.Колонки.Добавить("НадбавкаСкидка40ФрахтCOC", Новый ОписаниеТипов(МассивТипов));
	Таблица.Колонки.Добавить("НадбавкаСкидка40ФрахтSOC", Новый ОписаниеТипов(МассивТипов));
	Таблица.Колонки.Добавить("ЭтоПроцентОтСуммы", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("Калькуляции20ЖДCOC", Новый ОписаниеТипов("ДокументСсылка.Калькуляция"));
	Таблица.Колонки.Добавить("Калькуляции20ЖДSOC", Новый ОписаниеТипов("ДокументСсылка.Калькуляция"));
	Таблица.Колонки.Добавить("Калькуляции40ЖДCOC", Новый ОписаниеТипов("ДокументСсылка.Калькуляция"));
	Таблица.Колонки.Добавить("Калькуляции40ЖДSOC", Новый ОписаниеТипов("ДокументСсылка.Калькуляция"));
	Таблица.Колонки.Добавить("Калькуляции20ФрахтCOC", Новый ОписаниеТипов("ДокументСсылка.Калькуляция"));
	Таблица.Колонки.Добавить("Калькуляции20ФрахтSOC", Новый ОписаниеТипов("ДокументСсылка.Калькуляция"));
	Таблица.Колонки.Добавить("Калькуляции40ФрахтCOC", Новый ОписаниеТипов("ДокументСсылка.Калькуляция"));
	Таблица.Колонки.Добавить("Калькуляции40ФрахтSOC", Новый ОписаниеТипов("ДокументСсылка.Калькуляция"));
	
	Возврат Таблица;
	
КонецФункции // Евросиб Рыбьяков К.А. 14.12.2025 ))

// Евросиб US 90342 Рыбьяков К.А. 14.12.2025 ((
Функция ПодобратьПодходящуюСтроку(Запись, ТаблицаРезультат)
	
	СтрокаПоиска = Запись.ПараметрПеревозки.РазмерКТК.Наименование 
		+ ?(Запись.ПараметрПеревозки.ВидТранспортногоСообщения = Перечисления.ВидыТранспортныхСообщений.ЖД, "ЖД", "Фрахт")
		+ ?(Запись.ПараметрПеревозки.ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТЕвросиба, "COC", "SOC");
		
	Ставка = "";
	
	Если Запись.ТипСтавки = Перечисления.ТипыСтавок.СпециальнаяСтавка Тогда
		Ставка = "Ставка" + СтрокаПоиска
	ИначеЕсли Запись.ТипСтавки = Перечисления.ТипыСтавок.Скидка 
			Или Запись.ТипСтавки = Перечисления.ТипыСтавок.Надбавка Тогда
		Ставка = "НадбавкаСкидка" + СтрокаПоиска;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Контрагент", Запись.Контрагент);
	СтруктураОтбора.Вставить("ПлановыйОбъемTEU", Запись.ПлановыйОбъемTEU);
	СтруктураОтбора.Вставить("ТипСтавки", Запись.ТипСтавки);
	СтруктураОтбора.Вставить(Ставка, 0);
	
	НайденнаяСтрока = ТаблицаРезультат.НайтиСтроки(СтруктураОтбора);
	
	Возврат ?(НайденнаяСтрока.Количество() > 0, НайденнаяСтрока[0], Неопределено);
	
КонецФункции // Евросиб Рыбьяков К.А. 14.12.2025 ))

// Евросиб US 90342 Рыбьяков К.А. 14.12.2025 ((
Процедура ЗаполнитьСтрокуРезультатаЖД(СтрокаРезультат, ЗаписьЖД)
	
	СтрокаРезультат.Контрагент = ЗаписьЖД.Контрагент;
	СтрокаРезультат.ТипСтавки = ЗаписьЖД.ТипСтавки;
	СтрокаРезультат.ПлановыйОбъемTEU = ЗаписьЖД.ПлановыйОбъемTEU;
	СтрокаРезультат.ЭтоПроцентОтСуммы = ЗаписьЖД.ЭтоПроцентОтСуммы;
		
	СтрокаРезультат.ПунктОтправления = ЗаписьЖД.ПунктОтправления;
	СтрокаРезультат.ПунктНазначения = ЗаписьЖД.ПунктНазначения;
	СтрокаРезультат.УсловияПеревозкиОтправление = ЗаписьЖД.УсловияПеревозкиОтправление;
	СтрокаРезультат.УсловияПеревозкиПрибытие = ЗаписьЖД.УсловияПеревозкиПрибытие;
	
	СтрокаПоиска = ЗаписьЖД.ПараметрПеревозки.РазмерКТК.Наименование 
		+ "ЖД"
		+ ?(ЗаписьЖД.ПараметрПеревозки.ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТЕвросиба, "COC", "SOC");
	
	Если СтрокаРезультат.ТипСтавки = Перечисления.ТипыСтавок.СпециальнаяСтавка Тогда
		СтрокаРезультат["Ставка" + СтрокаПоиска] = ЗаписьЖД.Ставка;
	ИначеЕсли СтрокаРезультат.ТипСтавки = Перечисления.ТипыСтавок.Скидка 
			Или СтрокаРезультат.ТипСтавки = Перечисления.ТипыСтавок.Надбавка Тогда
		СтрокаРезультат["НадбавкаСкидка" + СтрокаПоиска] = ЗаписьЖД.Ставка;
	КонецЕсли;
	
	Если СтрокаРезультат.ТипСтавки = Перечисления.ТипыСтавок.СпециальнаяСтавка Тогда
		СтрокаРезультат["ВалютаЖД"] = ЗаписьЖД.ПараметрПеревозки.Валюта;
	ИначеЕсли СтрокаРезультат.ТипСтавки = Перечисления.ТипыСтавок.Скидка 
			Или СтрокаРезультат.ТипСтавки = Перечисления.ТипыСтавок.Надбавка Тогда
		СтрокаРезультат["ВалютаНадбавкиСкидкиЖД"] = ЗаписьЖД.ПараметрПеревозки.Валюта;
	КонецЕсли;
	
КонецПроцедуры // Евросиб Рыбьяков К.А. 14.12.2025 ))

// Евросиб US 90342 Рыбьяков К.А. 14.12.2025 ((
Процедура ЗаполнитьСтрокуРезультатаФрахт(СтрокаРезультат, ЗаписьФрахт)
	
	СтрокаРезультат.Контрагент = ЗаписьФрахт.Контрагент;
	СтрокаРезультат.ТипСтавки = ЗаписьФрахт.ТипСтавки;
	СтрокаРезультат.ПлановыйОбъемTEU = ЗаписьФрахт.ПлановыйОбъемTEU;
	СтрокаРезультат.ЭтоПроцентОтСуммы = ЗаписьФрахт.ЭтоПроцентОтСуммы;
	
	СтрокаРезультат.ПортОтправления = ЗаписьФрахт.ПортОтправления;
	СтрокаРезультат.ПортНазначения = ЗаписьФрахт.ПортНазначения;
	СтрокаРезультат.ПортОтгрузки = ЗаписьФрахт.ПортОтгрузки;
	СтрокаРезультат.УсловияПогрузки = ЗаписьФрахт.УсловияПогрузки;
	СтрокаРезультат.УсловияВыгрузки = ЗаписьФрахт.УсловияВыгрузки;
	
	СтрокаПоиска = ЗаписьФрахт.ПараметрПеревозки.РазмерКТК.Наименование 
		+ "Фрахт"
		+ ?(ЗаписьФрахт.ПараметрПеревозки.ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТЕвросиба, "COC", "SOC");
	
	Если СтрокаРезультат.ТипСтавки = Перечисления.ТипыСтавок.СпециальнаяСтавка Тогда
		СтрокаРезультат["Ставка" + СтрокаПоиска] = ЗаписьФрахт.Ставка;
	ИначеЕсли СтрокаРезультат.ТипСтавки = Перечисления.ТипыСтавок.Скидка 
			Или СтрокаРезультат.ТипСтавки = Перечисления.ТипыСтавок.Надбавка Тогда
		СтрокаРезультат["НадбавкаСкидка" + СтрокаПоиска] = ЗаписьФрахт.Ставка;
	КонецЕсли;
		
	Если СтрокаРезультат.ТипСтавки = Перечисления.ТипыСтавок.СпециальнаяСтавка Тогда
		СтрокаРезультат["ВалютаФрахт"] = ЗаписьФрахт.ПараметрПеревозки.Валюта;
	ИначеЕсли СтрокаРезультат.ТипСтавки = Перечисления.ТипыСтавок.Скидка 
			Или СтрокаРезультат.ТипСтавки = Перечисления.ТипыСтавок.Надбавка Тогда
		СтрокаРезультат["ВалютаНадбавкиСкидкиФрахт"] = ЗаписьФрахт.ПараметрПеревозки.Валюта;
	КонецЕсли;
	
КонецПроцедуры // Евросиб Рыбьяков К.А. 14.12.2025 ))

//Евросиб СубботинВ #129659 04.02.2026 Начало// частичное приведение в порядок кода

#Область ДобавлениеТекстовЗапросов

Процедура ДобавитьТекстЗапросаСозданиеДокументов(МассивТекстовЗапросов, Запрос)
	
		МассивТекстовЗапросов.Добавить("ВЫБРАТЬ РАЗЛИЧНЫЕ
	       |	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	       |	РеализацияТоваровУслуг.ДатаДокумента КАК ДатаДокумента,
	       |	ЗНАЧЕНИЕ(Справочник.СобытияОтправкиДокументов.СозданиеДокумента) КАК Алгоритм
		   //Евросиб(ДИТ), Беляев СЮ, BUG 92593 / TA 92595, 07-10-2024, начало
		   |	,Значение(Справочник.Пользователи.ПустаяСсылка) КАК Подписант
		   //Евросиб(ДИТ), Беляев СЮ, BUG 92593 / TA 92595, 07-10-2024, конец
		   //Евросиб СубботинВ #102687 14.02.2025 Начало// 
	   	   |	,0 КАК ЦиклРаботыСДокументом
	   	   //Евросиб СубботинВ #102687 14.02.2025 Конец//
	       |ИЗ
	       |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	       |ГДЕ
	       |	РеализацияТоваровУслуг.Проведен
	       |	И РеализацияТоваровУслуг.ЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ОсновнойЦФО)
	       |	И НЕ РеализацияТоваровУслуг.УслугиПрошлыхПериодов");
	
КонецПроцедуры    

Процедура ДобавитьТекстЗапросаОтказаноВПодписиДиадок(МассивТекстовЗапросов, Запрос)
	
	СписокТиповДокументов = Новый СписокЗначений;
	СписокТиповДокументов.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
	СписокТиповДокументов.Добавить(Тип("ДокументСсылка.ОтчетКомитентуОПродажах"));
	СписокТиповДокументов.Добавить(Тип("ДокументСсылка.КорректировкаРеализации"));
	
	
	//МассивТекстовЗапросов.Добавить("ВЫБРАТЬ РАЗЛИЧНЫЕ
	//		|	Диадок_Документы.Ссылка КАК Ссылка,
	//		|	Диадок_Документы.ДатаДокумента КАК ДатаДокумента,
	//		|	ЗНАЧЕНИЕ(Справочник.СобытияОтправкиДокументов.ОтказаноВПодписиДиадок) КАК Алгоритм
	//		|ИЗ
	//		|	Справочник.Диадок_Документы КАК Диадок_Документы
	//		|ГДЕ
	//		|	ТИПЗНАЧЕНИЯ(Диадок_Документы.Документ) В (&ТипДокумента)
	//		|	И НЕ Диадок_Документы.ПометкаУдаления
	//		|	И Диадок_Документы.Статус = ""Контрагент отказал в подписи""");
	
	//Евросиб(ДИТ), Беляев СЮ, BUG 92593 / TA 92595, 07-10-2024, начало
	//события отказа в подписи берем из регистра СостоянияДокументовВДиадоке, в нем более полные данные
	//для документа ОтчетКомитентуОПродажах оставляем пока справочник Диадок_Документы, т.к. в регистр СостоянияДокументовВДиадоке некорректно фиксируются данные по нему, нужно продумать алгоритм
	МассивТекстовЗапросов.Добавить("ВЫБРАТЬ
	|	Диадок_Документы.Ссылка КАК Ссылка,
	|	Диадок_Документы.ДатаДокумента КАК ДатаДокумента,
	|	ЗНАЧЕНИЕ(Справочник.СобытияОтправкиДокументов.ОтказаноВПодписиДиадок) КАК Алгоритм,
	|	Диадок_Документы.Подписант КАК Подписант
	//Евросиб СубботинВ #102687 14.02.2025 Начало// 
	|	,0 КАК ЦиклРаботыСДокументом
	//Евросиб СубботинВ #102687 14.02.2025 Конец//
	|ИЗ
	|	Справочник.Диадок_Документы КАК Диадок_Документы
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(Диадок_Документы.Документ) = ТИП(Документ.ОтчетКомитентуОПродажах)
	|	И НЕ Диадок_Документы.ПометкаУдаления
	|	И Диадок_Документы.Статус = ""Контрагент отказал в подписи""
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СостоянияДокументовВДиадоке.Документ,
	|	СостоянияДокументовВДиадоке.ДатаДокумента,
	|	ЗНАЧЕНИЕ(Справочник.СобытияОтправкиДокументов.ОтказаноВПодписиДиадок),
	|	СостоянияДокументовВДиадоке.Подписант
	//Евросиб СубботинВ #102687 14.02.2025 Начало// 
	|	,0 КАК ЦиклРаботыСДокументом
	//Евросиб СубботинВ #102687 14.02.2025 Конец//
	|ИЗ
	|	РегистрСведений.СостоянияДокументовВДиадоке КАК СостоянияДокументовВДиадоке
	|ГДЕ
	|	СостоянияДокументовВДиадоке.ДатаДокумента >= &ДатаНачалаИспользованияИзРегистра
	|	И ТИПЗНАЧЕНИЯ(СостоянияДокументовВДиадоке.Документ) В (&ТипДокумента)
	|	И СостоянияДокументовВДиадоке.СостояниеДокументооборота = ""Контрагент отказал в подписи""");
	//Евросиб(ДИТ), Беляев СЮ, BUG 92593 / TA 92595, 07-10-2024, конец 
	
	Запрос.УстановитьПараметр("ДатаНачалаИспользованияИзРегистра", Дата(2024, 10, 1)); //чтобы за предыдущие периоды не насыпало уведомлений пользователям
	Запрос.УстановитьПараметр("ТипДокумента", СписокТиповДокументов);

		
КонецПроцедуры

Процедура ДобавитьТекстЗапросаНеСогласованРеестрПлатежей(МассивТекстовЗапросов, Запрос)
	
		//МассивТекстовЗапросов.Добавить("ВЫБРАТЬ
		//|	СтатусыОбъектовСрезПоследних.Объект КАК Ссылка,
		//|	НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(СтатусыОбъектовСрезПоследних.Объект КАК Документ.РеестрПлатежей).Создано, ДЕНЬ) КАК ДатаДокумента,
		//|	ЗНАЧЕНИЕ(Справочник.СобытияОтправкиДокументов.НеСогласованРеестрПлатежей) КАК Алгоритм,
		//|	ВЫРАЗИТЬ(СтатусыОбъектовСрезПоследних.Объект КАК Документ.РеестрПлатежей).Автор КАК Подписант,
		//|	МАКСИМУМ(ПроцессСогласованияСостояния.ШагЦикла) КАК ШагЦикла
		//|ИЗ
		//|	РегистрСведений.СтатусыОбъектов.СрезПоследних КАК СтатусыОбъектовСрезПоследних
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПроцессСогласования.Состояния КАК ПроцессСогласованияСостояния
		//|		ПО СтатусыОбъектовСрезПоследних.Объект = ПроцессСогласованияСостояния.Ссылка.ДокументСогласования
		//|			И (НЕ ПроцессСогласованияСостояния.Ссылка.ПометкаУдаления)
		//|ГДЕ
		//|	СтатусыОбъектовСрезПоследних.Статус = &СтатусНеСогласован
		//|	И СтатусыОбъектовСрезПоследних.Объект ССЫЛКА Документ.РеестрПлатежей
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	СтатусыОбъектовСрезПоследних.Объект,
		//|	ВЫРАЗИТЬ(СтатусыОбъектовСрезПоследних.Объект КАК Документ.РеестрПлатежей).Автор,
		//|	НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(СтатусыОбъектовСрезПоследних.Объект КАК Документ.РеестрПлатежей).Создано, ДЕНЬ)");
		
		МассивТекстовЗапросов.Добавить("ВЫБРАТЬ
		                               |	ВложенныйЗапрос.Ссылка КАК Ссылка,
		                               |	ВложенныйЗапрос.ДатаДокумента КАК ДатаДокумента,
		                               |	ВложенныйЗапрос.Алгоритм КАК Алгоритм,
		                               |	ВложенныйЗапрос.Подписант КАК Подписант,
		                               |	МАКСИМУМ(ПроцессСогласованияСостояния.ШагЦикла) КАК ШагЦикла
		                               |ИЗ
		                               |	(ВЫБРАТЬ
		                               |		СтатусыОбъектовСрезПоследних.Объект КАК Ссылка,
		                               |		НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(СтатусыОбъектовСрезПоследних.Объект КАК Документ.РеестрПлатежей).Создано, ДЕНЬ) КАК ДатаДокумента,
		                               |		ЗНАЧЕНИЕ(Справочник.СобытияОтправкиДокументов.НеСогласованРеестрПлатежей) КАК Алгоритм,
		                               |		ВЫРАЗИТЬ(СтатусыОбъектовСрезПоследних.Объект КАК Документ.РеестрПлатежей).Автор КАК Подписант
		                               |	ИЗ
		                               |		РегистрСведений.СтатусыОбъектов.СрезПоследних(
		                               |				,
		                               |				Объект ССЫЛКА Документ.РеестрПлатежей
		                               |					И ВЫРАЗИТЬ(Объект КАК Документ.РеестрПлатежей).Проведен) КАК СтатусыОбъектовСрезПоследних
		                               |	ГДЕ
		                               |		СтатусыОбъектовСрезПоследних.Статус = &СтатусНеСогласован) КАК ВложенныйЗапрос,
		                               |	Справочник.ПроцессСогласования.Состояния КАК ПроцессСогласованияСостояния
		                               |
		                               |СГРУППИРОВАТЬ ПО
		                               |	ВложенныйЗапрос.Ссылка,
		                               |	ВложенныйЗапрос.ДатаДокумента,
		                               |	ВложенныйЗапрос.Подписант,
		                               |	ВложенныйЗапрос.Алгоритм");
		
		
		Запрос.УстановитьПараметр("СтатусНеСогласован", Справочники.СтатусыДокументов.РеестрНеСогласован);

КонецПроцедуры 
   
Процедура ДобавитьТекстЗапросаОтклонениеЗаявкиНаОплатуВУПП(МассивТекстовЗапросов, Запрос)
  
	   // МассивТекстовЗапросов.Добавить("ВЫБРАТЬ
	   //|	СтатусыОбъектовСрезПоследних.Объект КАК Ссылка,
	   //|	НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(СтатусыОбъектовСрезПоследних.Объект КАК Документ.ЗаявкаНаОплату).Создано, ДЕНЬ) КАК ДатаДокумента,
	   //|	ЗНАЧЕНИЕ(Справочник.СобытияОтправкиДокументов.ОтклонениеЗаявкиНаОплатуВУПП) КАК Алгоритм,
	   //|	ЕСТЬNULL(РеестрПлатежейЗаявки.Ссылка.Автор, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК Подписант,
	   ////Евросиб СубботинВ #102687 14.02.2025 Начало// 
	   //|	СтатусыОбъектовСрезПоследних.ЦиклРаботыСДокументом КАК ЦиклРаботыСДокументом
	   ////Евросиб СубботинВ #102687 14.02.2025 Конец// 
	   //|ИЗ
	   //|	РегистрСведений.СтатусыОбъектов.СрезПоследних КАК СтатусыОбъектовСрезПоследних
	   //|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеестрПлатежей.Заявки КАК РеестрПлатежейЗаявки
	   //|		ПО (РеестрПлатежейЗаявки.ЗаявкаНаОплату = СтатусыОбъектовСрезПоследних.Объект)
	   //|			И РеестрПлатежейЗаявки.Ссылка.Проведен
	   //|			И (РеестрПлатежейЗаявки.ЗаявкаНаОплату.Проведен)
	   //|			И НЕ РеестрПлатежейЗаявки.Отключена	   
	   //|ГДЕ
	   //|	СтатусыОбъектовСрезПоследних.Статус = &СтатусОтклонен
	   //|	И СтатусыОбъектовСрезПоследних.Объект ССЫЛКА Документ.ЗаявкаНаОплату");
	   
	   МассивТекстовЗапросов.Добавить("ВЫБРАТЬ
	                                  |	ВложенныйЗапрос.Ссылка КАК Ссылка,
	                                  |	ВложенныйЗапрос.ДатаДокумента КАК ДатаДокумента,
	                                  |	ВложенныйЗапрос.Алгоритм КАК Алгоритм,
	                                  |	ЕСТЬNULL(РеестрПлатежейЗаявки.Ссылка.Автор, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК Подписант,
	                                  |	ВложенныйЗапрос.ЦиклРаботыСДокументом КАК ШагЦикла
	                                  |ИЗ
	                                  |	(ВЫБРАТЬ
	                                  |		СтатусыОбъектовСрезПоследних.Объект КАК Ссылка,
	                                  |		НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(СтатусыОбъектовСрезПоследних.Объект КАК Документ.ЗаявкаНаОплату).Создано, ДЕНЬ) КАК ДатаДокумента,
	                                  |		ЗНАЧЕНИЕ(Справочник.СобытияОтправкиДокументов.ОтклонениеЗаявкиНаОплатуВУПП) КАК Алгоритм,
	                                  |		СтатусыОбъектовСрезПоследних.ЦиклРаботыСДокументом КАК ЦиклРаботыСДокументом
	                                  |	ИЗ
	                                  |		РегистрСведений.СтатусыОбъектов.СрезПоследних(
	                                  |				,
	                                  |				Объект ССЫЛКА Документ.ЗаявкаНаОплату
	                                  |					И ВЫРАЗИТЬ(Объект КАК Документ.ЗаявкаНаОплату).Проведен) КАК СтатусыОбъектовСрезПоследних
	                                  |	ГДЕ
	                                  |		СтатусыОбъектовСрезПоследних.Статус = &СтатусОтклонен) КАК ВложенныйЗапрос
	                                  |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеестрПлатежей.Заявки КАК РеестрПлатежейЗаявки
	                                  |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗаявкиВключенныеВРеестр КАК ЗаявкиВключенныеВРеестр
	                                  |			ПО РеестрПлатежейЗаявки.Ссылка = ЗаявкиВключенныеВРеестр.РеестрПлатежей
	                                  |				И РеестрПлатежейЗаявки.ЗаявкаНаОплату = ЗаявкиВключенныеВРеестр.ЗаявкаНаОплату
	                                  |				И (НЕ ЗаявкиВключенныеВРеестр.Отключена)
	                                  |		ПО (РеестрПлатежейЗаявки.Ссылка.Проведен)
	                                  |			И ВложенныйЗапрос.Ссылка = РеестрПлатежейЗаявки.ЗаявкаНаОплату");	   
	   
	   Запрос.УстановитьПараметр("СтатусОтклонен", Справочники.СтатусыДокументов.ОтклоненаВУПП);
	   
	   
КонецПроцедуры

Процедура ДобавитьТекстЗапросаНеУтвержденРеестрПлатежей(МассивТекстовЗапросов, Запрос)
	
	//МассивТекстовЗапросов.Добавить("ВЫБРАТЬ
	//	|	СтатусыОбъектовСрезПоследних.Объект КАК Ссылка,
	//	|	НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(СтатусыОбъектовСрезПоследних.Объект КАК Документ.РеестрПлатежей).Создано, ДЕНЬ) КАК ДатаДокумента,
	//	|	ЗНАЧЕНИЕ(Справочник.СобытияОтправкиДокументов.НеУтвержденРеестрПлатежей) КАК Алгоритм,
	//	|	ВЫРАЗИТЬ(СтатусыОбъектовСрезПоследних.Объект КАК Документ.РеестрПлатежей).Автор КАК Подписант,
	//	|	МАКСИМУМ(ПроцессСогласованияСостояния.ШагЦикла) КАК ШагЦикла
	//	|ИЗ
	//	|	РегистрСведений.СтатусыОбъектов.СрезПоследних КАК СтатусыОбъектовСрезПоследних
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПроцессСогласования.Состояния КАК ПроцессСогласованияСостояния
	//	|		ПО СтатусыОбъектовСрезПоследних.Объект.Ссылка = ПроцессСогласованияСостояния.Ссылка.ДокументСогласования
	//	|			И (НЕ ПроцессСогласованияСостояния.Ссылка.ПометкаУдаления)
	//	|ГДЕ
	//	|	СтатусыОбъектовСрезПоследних.Статус = &СтатусНеУтвержден
	//	|	И СтатусыОбъектовСрезПоследних.Объект ССЫЛКА Документ.РеестрПлатежей
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	СтатусыОбъектовСрезПоследних.Объект,
	//	|	НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(СтатусыОбъектовСрезПоследних.Объект КАК Документ.РеестрПлатежей).Создано, ДЕНЬ),
	//	|	ВЫРАЗИТЬ(СтатусыОбъектовСрезПоследних.Объект КАК Документ.РеестрПлатежей).Автор");
	
	МассивТекстовЗапросов.Добавить("ВЫБРАТЬ
	                               |	ВложенныйЗапрос.Ссылка КАК Ссылка,
	                               |	ВложенныйЗапрос.ДатаДокумента КАК ДатаДокумента,
	                               |	ВложенныйЗапрос.Алгоритм КАК Алгоритм,
	                               |	ВложенныйЗапрос.Подписант КАК Подписант,
	                               |	МАКСИМУМ(ПроцессСогласованияСостояния.ШагЦикла) КАК ШагЦикла
	                               |ИЗ
	                               |	(ВЫБРАТЬ
	                               |		СтатусыОбъектовСрезПоследних.Объект КАК Ссылка,
	                               |		НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(СтатусыОбъектовСрезПоследних.Объект КАК Документ.РеестрПлатежей).Создано, ДЕНЬ) КАК ДатаДокумента,
	                               |		ЗНАЧЕНИЕ(Справочник.СобытияОтправкиДокументов.НеУтвержденРеестрПлатежей) КАК Алгоритм,
	                               |		ВЫРАЗИТЬ(СтатусыОбъектовСрезПоследних.Объект КАК Документ.РеестрПлатежей).Автор КАК Подписант
	                               |	ИЗ
	                               |		РегистрСведений.СтатусыОбъектов.СрезПоследних(, Объект ССЫЛКА Документ.РеестрПлатежей) КАК СтатусыОбъектовСрезПоследних
	                               |	ГДЕ
	                               |		СтатусыОбъектовСрезПоследних.Статус = &СтатусНеУтвержден
	                               |		И СтатусыОбъектовСрезПоследних.Объект ССЫЛКА Документ.РеестрПлатежей) КАК ВложенныйЗапрос,
	                               |	Справочник.ПроцессСогласования.Состояния КАК ПроцессСогласованияСостояния
	                               |
	                               |СГРУППИРОВАТЬ ПО
	                               |	ВложенныйЗапрос.Ссылка,
	                               |	ВложенныйЗапрос.ДатаДокумента,
	                               |	ВложенныйЗапрос.Алгоритм,
	                               |	ВложенныйЗапрос.Подписант");
	
	Запрос.УстановитьПараметр("СтатусНеУтвержден", Справочники.СтатусыДокументов.РеестрНеУтвержден); 


КонецПроцедуры 

Процедура ДобавитьТекстЗапросаТребуетсяАннулирование(МассивТекстовЗапросов, Запрос)
	
	    СписокТиповДокументов = Новый СписокЗначений;
		СписокТиповДокументов.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
		СписокТиповДокументов.Добавить(Тип("ДокументСсылка.ОтчетКомитентуОПродажах"));
		СписокТиповДокументов.Добавить(Тип("ДокументСсылка.КорректировкаРеализации"));

	
		МассивТекстовЗапросов.Добавить("ВЫБРАТЬ
		|	Диадок_Документы.Ссылка КАК Ссылка,
		|	Диадок_Документы.ДатаДокумента КАК ДатаДокумента,
		|	ЗНАЧЕНИЕ(Справочник.СобытияОтправкиДокументов.ТребуетсяАннулирование) КАК Алгоритм,
		|	Диадок_Документы.Подписант КАК Подписант
		 //Евросиб СубботинВ #102687 14.02.2025 Начало// 
	   	|	,0 КАК ЦиклРаботыСДокументом
	   	//Евросиб СубботинВ #102687 14.02.2025 Конец//
		|ИЗ
		|	Справочник.Диадок_Документы КАК Диадок_Документы
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(Диадок_Документы.Документ) = ТИП(Документ.ОтчетКомитентуОПродажах)
		|	И НЕ Диадок_Документы.ПометкаУдаления
		|	И Диадок_Документы.Статус = ""Требуется аннулирование""
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СостоянияДокументовВДиадоке.Документ,
		|	СостоянияДокументовВДиадоке.ДатаДокумента,
		|	ЗНАЧЕНИЕ(Справочник.СобытияОтправкиДокументов.ТребуетсяАннулирование),
		|	СостоянияДокументовВДиадоке.Подписант
		//Евросиб СубботинВ #102687 14.02.2025 Начало// 
	   	|	,0 КАК ЦиклРаботыСДокументом
	   	//Евросиб СубботинВ #102687 14.02.2025 Конец//
		|ИЗ
		|	РегистрСведений.СостоянияДокументовВДиадоке КАК СостоянияДокументовВДиадоке
		|ГДЕ
		|	СостоянияДокументовВДиадоке.ДатаДокумента >= &ДатаНачалаИспользованияИзРегистра
		|	И ТИПЗНАЧЕНИЯ(СостоянияДокументовВДиадоке.Документ) В (&ТипДокумента)
		|	И СостоянияДокументовВДиадоке.СостояниеДокументооборота = ""Требуется аннулирование""");
		
		Запрос.УстановитьПараметр("ДатаНачалаИспользованияИзРегистра", Дата(2024, 10, 1)); //чтобы за предыдущие периоды не насыпало уведомлений пользователям
		Запрос.УстановитьПараметр("ТипДокумента", СписокТиповДокументов);
		
КонецПроцедуры		

Процедура ДобавитьТекстЗапросаВыводКткИзОперирования(МассивТекстовЗапросов, Запрос)

	МассивТекстовЗапросов.Добавить("ВЫБРАТЬ РАЗЛИЧНЫЕ
       |	РелизСобственникаНоминации.КлючАналитики КАК Ссылка,
       |	НАЧАЛОПЕРИОДА(РелизСобственникаНоминации.Ссылка.Дата, ДЕНЬ) КАК ДатаДокумента,
       |	ЗНАЧЕНИЕ(Справочник.СобытияОтправкиДокументов.ВыводКткИзОперирования) КАК Алгоритм,
       |	РелизСобственникаНоминации.Ссылка.Автор КАК Подписант
	   	//Евросиб СубботинВ #102687 14.02.2025 Начало// 
	   |	,0 КАК ЦиклРаботыСДокументом
	   //Евросиб СубботинВ #102687 14.02.2025 Конец//
       |ИЗ
       |	Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
       |ГДЕ
       |	РелизСобственникаНоминации.Ссылка.Проведен
       |	И РелизСобственникаНоминации.тек_СобственностьКТК В(&тек_СобственностьКТК)
       |	И РелизСобственникаНоминации.ДатаВозвратаСобственнику = ДАТАВРЕМЯ(1, 1, 1)
       |	И ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(РелизСобственникаНоминации.ДатаВзятия, ДЕНЬ), ДЕНЬ, РелизСобственникаНоминации.НормативВозврата) <= НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
       |	И НЕ РелизСобственникаНоминации.Контейнер = ЗНАЧЕНИЕ(Справочник.Те.ПустаяСсылка)");
	   
	   	ВидыСобственности = Новый СписокЗначений;
		ВидыСобственности.Добавить(Перечисления.ВариантыСобственности.Спот);
		ВидыСобственности.Добавить(Перечисления.ВариантыСобственности.СпотДоплатный);
		
		Запрос.УстановитьПараметр("тек_СобственностьКТК", ВидыСобственности);
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());


КонецПроцедуры 
   
Процедура ДобавитьТекстЗапросаТребуетсяУточнениеДиадок(МассивТекстовЗапросов, Запрос)
	
	    СписокТиповДокументов = Новый СписокЗначений;
		СписокТиповДокументов.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
		СписокТиповДокументов.Добавить(Тип("ДокументСсылка.ОтчетКомитентуОПродажах"));
		СписокТиповДокументов.Добавить(Тип("ДокументСсылка.КорректировкаРеализации"));

	
   		МассивТекстовЗапросов.Добавить("ВЫБРАТЬ
		|	Диадок_Документы.Ссылка КАК Ссылка,
		|	Диадок_Документы.ДатаДокумента КАК ДатаДокумента,
		|	ЗНАЧЕНИЕ(Справочник.СобытияОтправкиДокументов.ТребуетсяУточнениеДиадок) КАК Алгоритм,
		|	Диадок_Документы.Подписант КАК Подписант
	   	|	,0 КАК ЦиклРаботыСДокументом
		|ИЗ
		|	Справочник.Диадок_Документы КАК Диадок_Документы
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(Диадок_Документы.Документ) = ТИП(Документ.ОтчетКомитентуОПродажах)
		|	И НЕ Диадок_Документы.ПометкаУдаления
		|	И Диадок_Документы.Статус = ""Требуется уточнение""
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СостоянияДокументовВДиадоке.Документ,
		|	СостоянияДокументовВДиадоке.ДатаДокумента,
		|	ЗНАЧЕНИЕ(Справочник.СобытияОтправкиДокументов.ТребуетсяУточнениеДиадок),
		|	СостоянияДокументовВДиадоке.Подписант
	   	|	,0 КАК ЦиклРаботыСДокументом
		|ИЗ
		|	РегистрСведений.СостоянияДокументовВДиадоке КАК СостоянияДокументовВДиадоке
		|ГДЕ
		|	СостоянияДокументовВДиадоке.ДатаОбновленияСостояния >= &ДатаНачалаИспользованияИзРегистра202506
		|	И ТИПЗНАЧЕНИЯ(СостоянияДокументовВДиадоке.Документ) В (&ТипДокумента)
		|	И СостоянияДокументовВДиадоке.СостояниеДокументооборота = ""Требуется уточнение""");
		
		Запрос.УстановитьПараметр("ДатаНачалаИспользованияИзРегистра202506", Дата(2025, 6, 1)); //чтобы за предыдущие периоды не насыпало уведомлений пользователям
		Запрос.УстановитьПараметр("ТипДокумента", СписокТиповДокументов);

КонецПроцедуры 	
	
Процедура ДобавитьТекстЗапросаОтказаноВАннулированииДиадок(МассивТекстовЗапросов, Запрос)	
	
		СписокТиповДокументов = Новый СписокЗначений;
		СписокТиповДокументов.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
		СписокТиповДокументов.Добавить(Тип("ДокументСсылка.ОтчетКомитентуОПродажах"));
		СписокТиповДокументов.Добавить(Тип("ДокументСсылка.КорректировкаРеализации"));
		
		ЗапросСтатусы = Новый Запрос;
		ЗапросСтатусы.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|Диадок_Документы.Статус КАК Статус
			|ИЗ
			|		Справочник.Диадок_Документы КАК Диадок_Документы
			|ГДЕ  Диадок_Документы.Статус ПОДОБНО ""%Отказано в аннулировании%""";
		МассивСтатусов = ЗапросСтатусы.Выполнить().Выгрузить().ВыгрузитьКолонку("Статус");
		
		
		МассивТекстовЗапросов.Добавить("ВЫБРАТЬ
		                               |	Диадок_Документы.Ссылка КАК Ссылка,
		                               |	Диадок_Документы.ДатаДокумента КАК ДатаДокумента,
		                               |	ЗНАЧЕНИЕ(Справочник.СобытияОтправкиДокументов.ОтказаноВАннулированииДиадок) КАК Алгоритм,
		                               |	Диадок_Документы.Подписант КАК Подписант,
		                               |	0 КАК ЦиклРаботыСДокументом
		                               |ИЗ
		                               |	Справочник.Диадок_Документы КАК Диадок_Документы
		                               |ГДЕ
		                               |	ТИПЗНАЧЕНИЯ(Диадок_Документы.Документ) = ТИП(Документ.ОтчетКомитентуОПродажах)
		                               |	И НЕ Диадок_Документы.ПометкаУдаления
		                               |	И Диадок_Документы.Статус В(&МассивСтатусов)
		                               |
		                               |ОБЪЕДИНИТЬ
		                               |
		                               |ВЫБРАТЬ
		                               |	СостоянияДокументовВДиадоке.Документ,
		                               |	СостоянияДокументовВДиадоке.ДатаДокумента,
		                               |	ЗНАЧЕНИЕ(Справочник.СобытияОтправкиДокументов.ОтказаноВАннулированииДиадок),
		                               |	СостоянияДокументовВДиадоке.Подписант,
		                               |	0
		                               |ИЗ
		                               |	РегистрСведений.СостоянияДокументовВДиадоке КАК СостоянияДокументовВДиадоке
		                               |ГДЕ
		                               |	СостоянияДокументовВДиадоке.ДатаОбновленияСостояния >= &ДатаНачалаИспользованияИзРегистра202506
		                               |	И ТИПЗНАЧЕНИЯ(СостоянияДокументовВДиадоке.Документ) В (&ТипДокумента)
		                               |	И СостоянияДокументовВДиадоке.СостояниеДокументооборота В(&МассивСтатусов)");

		//Запрос.УстановитьПараметр("ДатаНачалаИспользованияИзРегистра", Дата(2025, 6, 1)); //чтобы за предыдущие периоды не насыпало уведомлений пользователям
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0406825, 14-07-2025, начало
		Запрос.УстановитьПараметр("ДатаНачалаИспользованияИзРегистра202506", Дата(2025, 6, 1)); //чтобы за предыдущие периоды не насыпало уведомлений пользователям
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0406825, 14-07-2025, конец
		Запрос.УстановитьПараметр("ТипДокумента", СписокТиповДокументов);
		Запрос.УстановитьПараметр("МассивСтатусов", МассивСтатусов);
		
КонецПроцедуры


// была закоментирована, перенес, вдруг вернется в работу
//Процедура ДобавитьТекстЗапросаИзменениеДатыРТУ(МассивТекстовЗапросов, Запрос)
	//Если Справочники.СобытияОтправкиДокументов.ИзменениеДатыРТУ.ОтправкаПисемПоСобытию Тогда

	//	МассивТекстовЗапросов.Добавить("ВЫБРАТЬ
	//	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	//	|	РеализацияТоваровУслуг.ДатаДокумента КАК ДатаДокумента,
	//	|   Значение(Справочник.СобытияОтправкиДокументов.ИзменениеДатыРТУ)Как Алгоритм 
	//	|ИЗ
	//	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	//	|		ПО РеализацияТоваровУслуг.Контрагент = Контрагенты.Ссылка
	//	|			И (Контрагенты.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия))
	//	|ГДЕ
	//	|	РеализацияТоваровУслуг.Проведен
	//	|	И РеализацияТоваровУслуг.ЦФО = ЗНАЧЕНИЕ(Справочник.ЦентрыФинансовойОтветственности.ОсновнойЦФО)
	//	|	И РеализацияТоваровУслуг.Создано > &Создано");
	//КонецЕсли;
	
//КонецПроцедуры

#КонецОбласти
//Евросиб СубботинВ #129659 04.02.2026 Конец

//Евросиб СубботинВ #104841 07.05.2025 Начало //
#Область ОтправлениеПисемЗадачи

Функция ПолучитьСписокВариантовВыполненияЗадачи(Состояние, Документ)
	
	ВозможныеВариантыВыполнения = Новый Структура;
	ВозможныеВариантыВыполнения.Вставить("ИспользоватьКомментарий", Ложь);  
	
	СписокВариантовОтветов = Новый СписокЗначений;
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.РеестрПлатежей") Тогда
		Если Состояние = Справочники.Состояния.Согласование Тогда
			СписокВариантовОтветов.Добавить(Перечисления.СтатусыСогласования.СогласованоБезЗамечаний, "Согласовать");
			СписокВариантовОтветов.Добавить(Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний, "Отклонить");
		ИначеЕсли Состояние = Справочники.Состояния.Утверждение Тогда
			СписокВариантовОтветов.Добавить(Перечисления.СтатусыСогласования.СогласованоБезЗамечаний, "Утвердить");
			СписокВариантовОтветов.Добавить(Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний, "Отклонить");
		КонецЕсли;
		// Евросиб US 90342 Рыбьяков К.А. 14.12.2025 ((
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.РеестрСпециальныхСтавок") Тогда
		СписокВариантовОтветов.Добавить(Перечисления.СтатусыСогласования.СогласованоБезЗамечаний, "Согласован");
		//СписокВариантовОтветов.Добавить(Перечисления.СтатусыСогласования.СогласованоСЗамечаниями, "Согласован с замечаниями");
		//СписокВариантовОтветов.Добавить(Перечисления.СтатусыСогласования.СогласованСКомментариями, "Согласован с комментариями");
		СписокВариантовОтветов.Добавить(Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний, "Не согласован");
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 14.12.2025 ))
	
	ВозможныеВариантыВыполнения.Вставить("СписокВариантовОтветов", СписокВариантовОтветов);
	
	Возврат ВозможныеВариантыВыполнения;
	
КонецФункции

Функция ПолучитьОтветыВВидеСсылокMailto(Задача, Документ) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Текст", "");
	Результат.Вставить("КоличествоОтветов", 0);
	
	ВариантыОтветовДляВыполненияЗадачи = ПолучитьСписокВариантовВыполненияЗадачи(Задача.Состояние, Документ);
	
	ВозможныеВариантыВыполнения = ВариантыОтветовДляВыполненияЗадачи.СписокВариантовОтветов;
	
	Результат.КоличествоОтветов = ВозможныеВариантыВыполнения.Количество();
		
	АдресЭлектроннойПочты = АдресЭлектроннойПочтыОтправителя();
	
	КодЯзыкаПолучателя = ТекущийКодЛокализации();
	
	ТекстОтвета = "";
	Разделитель = "";
	
	Для Каждого ВариантОтвета Из ВозможныеВариантыВыполнения Цикл
		
		ТемаПисьма = ТемаСообщенияДляССылкиMailTo(
			Задача,ВариантОтвета.Значение, ВариантОтвета.Представление);
		ТекстОтветаДляРезультата = ТекстОтвета; 
		
		Если ВариантОтвета.Представление = "Отклонить" Тогда
			ТекстОтветаДляРезультата = "Причина отказа:";
		// Евросиб US 90342 Рыбьяков К.А. 15.12.2025 ((
		ИначеЕсли ВариантОтвета.Представление = "Согласован с замечаниями"
				Или ВариантОтвета.Представление = "Согласован с комментариями" 
				Или ВариантОтвета.Представление = "Не согласован" Тогда
			ТекстОтветаДляРезультата = "Причина отклонения:";
		// Евросиб Рыбьяков К.А. 15.12.2025 ))
		КонецЕсли;
		
		СсылкаНаОтвет = СформироватьСсылкуMailto(
			АдресЭлектроннойПочты,,,
			ТемаПисьма,
			ТекстОтветаДляРезультата,
			ПредопределенноеЗначение("Перечисление.ТипыТекстовЭлектронныхПисем.HTML"),
			ВариантОтвета.Представление + "...");
			
		Результат.Текст = Результат.Текст + Разделитель + СсылкаНаОтвет;
		
		Разделитель = " / ";
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции  

Функция ТемаСообщенияДляССылкиMailTo(Задача, ВариантВыполнения, ПредставлениеВариантаВыполнения)

	// Формируем служебную информацию.
	СлужебнаяИнформация = Строка("$" + Задача.УникальныйИдентификатор()
		+ "$" + ЧисловойИдентификаторВариантаВыполнения(ВариантВыполнения) + "$" + СтрокаСоединенияИнформационнойБазы());
    // Формируем служебную информацию.

	ТемаПисьма = ПредставлениеВариантаВыполнения + ": " + Строка(Задача.ОбъектЗадачи);    
	Если ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована  Тогда
		ТемаПисьма = "ТЕСТИРОВАНИЕ - " + ТемаПисьма;
	КонецЕсли;
	
	Возврат ТемаПисьма + СлужебнаяИнформация;
	
КонецФункции  

Функция СформироватьТекстУведомления(Задача, Документ, Тема)
	
	//ОбъектУведомления = Задача
	
	СсылкиОтветов = ПолучитьОтветыВВидеСсылокMailto(Задача, Документ);
	
	Если СсылкиОтветов.КоличествоОтветов > 1 Тогда
		Комментарий = НСтр("ru = 'Не отвечайте на это письмо. Для выполнения задачи нажмите на одну из ссылок.'");
	ИначеЕсли СсылкиОтветов.КоличествоОтветов = 1 Тогда
		Комментарий = НСтр("ru = 'Не отвечайте на это письмо. Для выполнения задачи нажмите на ссылку.'");
	КонецЕсли;
	
	ТекстПисьма = "";	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.РеестрПлатежей") Тогда
		СформироватьТекстУведомленияРеестрПлатежей(ТекстПисьма, Задача, Документ, Комментарий, СсылкиОтветов, Тема);
	// Евросиб US 90342 Рыбьяков К.А. 14.12.2025 ((
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.РеестрСпециальныхСтавок") Тогда
		СформироватьТекстУведомленияРеестрСпециальныхСтавок(ТекстПисьма, Задача, Документ, Комментарий, СсылкиОтветов, Тема);
	// Евросиб Рыбьяков К.А. 14.12.2025 ))
	КонецЕсли;
	
	Возврат ТекстПисьма;
	
КонецФункции      

Процедура ДобавитьУведомлениеПоЗадаче(ОбъектУведомления, ПолучательУведомления, СформированныеУведомления, Документ) Экспорт
	

	АдресПолучателя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПолучательУведомления, Справочники.ВидыКонтактнойИнформации.EmailПользователя);	
  
	Если АдресПолучателя = "" Тогда 
		ТекстОшибки = СтрШаблон(
		НСтр("ru = 'Уведомление не отправлено, так как не указан почтовый адрес у пользователя %1.'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				Строка(ПолучательУведомления)); 
		ЗаписьЖурналаРегистрации(
				"Отправка уведомлений о согласовании заявки по почте",
				УровеньЖурналаРегистрации.Предупреждение,,,
				ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ДанныеУведомления = ДанныеУведомления();
	
	//ДанныеУведомления.ТемаУведомления = Строка(ОбъектУведомления.Состояние) + " реестра платежей";
	
	ДанныеУведомления.ТекстУведомления = СформироватьТекстУведомления(ОбъектУведомления, Документ, ДанныеУведомления.ТемаУведомления);
	
	ИнформацияОбОшибке = ИнформацияОбОшибке();
	ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	КомментарийЖурналаРегистрации = СтрШаблон(
		"%1:
		|%2",
		НСтр("ru = 'Не удалось сформировать файлы для уведомления'",
		ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
		ПодробноеПредставлениеОшибки);
	
	ЗаписьЖурналаРегистрации(
		"Отправка уведомлений о согласовании заявки по почте",
		УровеньЖурналаРегистрации.Ошибка,,,
		КомментарийЖурналаРегистрации);
	

	СформированноеУведомление = СформированныеУведомления.Добавить(); 
	СформированноеУведомление.АдресОтправки = АдресПолучателя;
	ЗаполнитьЗначенияСвойств(СформированноеУведомление, ДанныеУведомления);
	СформированноеУведомление.Пользователь = ПолучательУведомления;
	СформированноеУведомление.ОбъектУведомления = ОбъектУведомления;
	
КонецПроцедуры 

Функция СформироватьТекстШапкиСообщенияВыполненияЗадачиПоРеестрам(ТекстПисьма, Задача)
	
	ТекстПисьма = ТекстПисьма + Символы.ПС + "<table border=""1""><tbody><th>Контрагент</th><th>Ответственный за оплату</th>
	|<th>Договор контрагента</th><th>Услуги ПТУ/Счет</th><th>Сумма платежа Руб</th>";
	
	Возврат  ТекстПисьма 	
	
КонецФункции 

Функция ЧисловойИдентификаторВариантаВыполнения(ВариантВыполнения)
	
	ЧисловойИдентификатор = "0";	
	Если ВариантВыполнения = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний Тогда		
		ЧисловойИдентификатор = "1";
		
	ИначеЕсли ВариантВыполнения = Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний Тогда		
		ЧисловойИдентификатор = "2";
	// Евросиб US 90342 Рыбьяков К.А. 05.03.2026 ((
	ИначеЕсли ВариантВыполнения = Перечисления.СтатусыСогласования.СогласованоСЗамечаниями Тогда
		ЧисловойИдентификатор = "3";
	// Евросиб Рыбьяков К.А. 05.03.2026 ))
	КонецЕсли;
	
	Возврат ЧисловойИдентификатор;
	
КонецФункции

Функция СформироватьТекстСтрокиСообщенияВыполненияЗадачиПоРеестрам(СтрокаПоЗаявке)
		 
	ТекстПисьма = Символы.ПС + "<tr>";
	ТекстПисьма = ТекстПисьма + "<td>" + СтрокаПоЗаявке.Контрагент + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + СтрокаПоЗаявке.ОтветственныйЗаОплату + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + СтрокаПоЗаявке.ДоговорКонтрагента + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + СтрокаПоЗаявке.УслугиПТУСчет + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + СтрокаПоЗаявке.СуммаПлатежаРуб + "</td>"; 
	ТекстПисьма = ТекстПисьма + "</tr>";    
		
	Возврат ТекстПисьма	
	
КонецФункции

Функция ДанныеУведомления() Экспорт
	
	ДанныеУведомления = Новый Структура("ТемаУведомления, ТекстУведомления, Файлы, ТекстОповещения, ПояснениеОповещения");
	
	Возврат ДанныеУведомления;
	
КонецФункции

// Формирует ссылку mailto
Функция СформироватьСсылкуMailto(Кому = "", Копия = "",	СкрытаяКопия = "", ТемаПисьма = "", ТекстПисьма = "", ТипТекста = Неопределено,	Представление = "") Экспорт
	
	Если ТипТекста = Неопределено Тогда
		ТипТекста = ПредопределенноеЗначение("Перечисление.ВидыТекстовЭлектронныхПисем.HTML");
	КонецЕсли;
	
	СсылкаMailto = "";
	НачатоЗаполнениеПараметров = Ложь;
	
	ДобавитьПараметрКСсылкеMailto(СсылкаMailto, "to", Кому, НачатоЗаполнениеПараметров);
	ДобавитьПараметрКСсылкеMailto(СсылкаMailto, "cc", Копия, НачатоЗаполнениеПараметров);
	ДобавитьПараметрКСсылкеMailto(СсылкаMailto, "bcc", СкрытаяКопия, НачатоЗаполнениеПараметров);
	ДобавитьПараметрКСсылкеMailto(СсылкаMailto, "subject", ТемаПисьма, НачатоЗаполнениеПараметров);
	ДобавитьПараметрКСсылкеMailto(СсылкаMailto, "body", ТекстПисьма, НачатоЗаполнениеПараметров);
	
	Если Не ПустаяСтрока(СсылкаMailto) Тогда
		
		Если ТипТекста = ПредопределенноеЗначение("Перечисление.ТипыТекстовЭлектронныхПисем.HTML") Тогда
			
			Если ПустаяСтрока(Представление) Тогда
				Представление = СсылкаMailto;
			КонецЕсли;
			
			СсылкаMailto = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"<a href=""mailto:%1"">%2</a>", 
				СсылкаMailto,
				Представление);
			
		Иначе
			
			СсылкаMailto = "mailto:" + СсылкаMailto;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СсылкаMailto;
	
КонецФункции 

// Дописывает в ссылку новый параметр, если значение параметра заполнено
Процедура ДобавитьПараметрКСсылкеMailto(СсылкаMailto, НазваниеПараметра, ЗначениеПараметра, НачатоЗаполнениеПараметров)
	
	Если ПустаяСтрока(ЗначениеПараметра) Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеПараметра = КодироватьСтроку(ЗначениеПараметра, СпособКодированияСтроки.URLВКодировкеURL);
	
	Если НазваниеПараметра = "to" Тогда
		
		СсылкаMailto = СсылкаMailto + ЗначениеПараметра;
		Возврат;
		
	КонецЕсли;
	
	Если НачатоЗаполнениеПараметров Тогда
		
		СимволРазделитель = "&";
		
	Иначе
		
		СимволРазделитель = "?";
		НачатоЗаполнениеПараметров = Истина;
		
	КонецЕсли;
	
	СсылкаMailto = СсылкаMailto + СимволРазделитель + НазваниеПараметра + "=" + ЗначениеПараметра;
	
	Возврат;
	
КонецПроцедуры  

Функция СформироватьУведомленияДляОтправки(Задача, ПолучателиУведомлений, Документ)
	
	СформированныеУведомления = Новый ТаблицаЗначений;
	СформированныеУведомления.Колонки.Добавить("Пользователь",
		Новый ОписаниеТипов("СправочникСсылка.Пользователи")); 
	СформированныеУведомления.Колонки.Добавить("АдресОтправки",
		Новый ОписаниеТипов("Строка"));
	СформированныеУведомления.Колонки.Добавить("ТемаУведомления",
		Новый ОписаниеТипов("Строка"));
	СформированныеУведомления.Колонки.Добавить("ТекстУведомления",
		Новый ОписаниеТипов("Строка"));
	СформированныеУведомления.Колонки.Добавить("Уведомления",
		Новый ОписаниеТипов("Массив"));
	СформированныеУведомления.Колонки.Добавить("Файлы",
		Новый ОписаниеТипов("Массив"));
	СформированныеУведомления.Колонки.Добавить("ОбъектУведомления",
		Новый ОписаниеТипов("ЗадачаСсылка.ЗадачаИсполнителя"));
	
	Для Каждого ПолучательУведомления Из ПолучателиУведомлений Цикл
			
		// Евросиб US 90342 Рыбьяков К.А. 05.03.2026 ((
		Если ТипЗнч(Задача) = Тип("Массив") Тогда
			Для Каждого СтрокаЗадача Из Задача Цикл
				ДобавитьУведомлениеПоЗадаче(
					СтрокаЗадача,
					ПолучательУведомления,
					СформированныеУведомления,
					Документ);
			КонецЦикла;
		Иначе
		// Формируем тексты уведомлений по задаче.
			ДобавитьУведомлениеПоЗадаче(
				Задача,
				ПолучательУведомления,
				СформированныеУведомления,
				Документ);
		КонецЕсли;
		// Евросиб Рыбьяков К.А. 05.03.2026 ))
			
	КонецЦикла;
	
	Возврат СформированныеУведомления;
	
КонецФункции  

Функция ОтправитьУведомленияПоПочте(Задача, ПолучателиУведомления, Документ) Экспорт
	
	СформированныеУведомления = СформироватьУведомленияДляОтправки(Задача, ПолучателиУведомления, Документ);
	СообщенияОтправлены = ОтправитьУведомления(СформированныеУведомления, ПолучателиУведомления.Количество());
	
	Возврат СообщенияОтправлены;
	
КонецФункции 

Функция ОтправитьУведомления(СформированныеУведомления, КоличествоУведомлений)   
	
	КоличествоОтправленныхУведомлений = 0;
	
	Для Каждого СформированноеУведомление Из СформированныеУведомления Цикл
		
		АдресПолучателя = СформированноеУведомление.АдресОтправки;
		
		// Формирование массива вложений.
		Вложения = Новый Массив();
		Если ЗначениеЗаполнено(СформированноеУведомление.Файлы) Тогда
			Для Каждого Вложение Из СформированноеУведомление.Файлы Цикл
				
				СтруктураВложения = Новый Структура;
				СтруктураВложения.Вставить("Данные", Вложение.ДвоичныеДанные);
				СтруктураВложения.Вставить("Имя", Вложение.ИмяФайла);
				СтруктураВложения.Вставить("Идентификатор", Неопределено);
				Вложения.Добавить(СтруктураВложения);
				
			КонецЦикла;
		КонецЕсли;
		
		Попытка
			
			ПараметрыПисьма = Новый Структура;
			ПараметрыПисьма.Вставить("Тема", СформированноеУведомление.ТемаУведомления);
			ПараметрыПисьма.Вставить("Тело", ТекстУведомленияВHTML(СформированноеУведомление.ТекстУведомления));
			МассивПолучателей = Новый Массив;
			МассивПолучателей.Добавить(СформированноеУведомление.Пользователь);
			ПараметрыПисьма.Вставить("Кому", МассивПолучателей);
			ПараметрыПисьма.Вставить("ТипТекста", "HTML");
			
			Если ЗначениеЗаполнено(Вложения) Тогда
				ПараметрыПисьма.Вставить("Вложения", Новый Массив);
				Для каждого Вложение Из Вложения Цикл
					СтруктураВложения = Новый Структура("Адрес, ИмяФайла");
					СтруктураВложения.Адрес = Вложение.Данные;
					СтруктураВложения.ИмяФайла = Вложение.Имя;
					ПараметрыПисьма.Вложения.Добавить(СтруктураВложения);
				КонецЦикла;
			КонецЕсли;
			
			ИдентификаторОтправленногоСообщения = ОтправитьСообщение(АдресЭлектроннойПочтыОтправителя(), ПараметрыПисьма);
				
		Исключение
			ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Ошибка при отправке уведомления по почте: %1'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 
			Сообщить(ТекстОшибки);
			ЗаписьЖурналаРегистрации(
				"Отправка уведомлений о согласовании заявки по почте",
				УровеньЖурналаРегистрации.Ошибка,,,
				ТекстОшибки);
			Продолжить;
		КонецПопытки;
		
		ЗаписьЖурналаРегистрации(
			"Отправка уведомлений о согласовании заявки по почте",
			УровеньЖурналаРегистрации.Информация,,,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Уведомление успешно отправлено на адрес %1 (вид маршрутизации - %2).'",
			ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			АдресПолучателя,));
			
		КоличествоОтправленныхУведомлений = КоличествоОтправленныхУведомлений + 1;
		
	КонецЦикла;  
	
	Если КоличествоОтправленныхУведомлений = 0 Тогда
		Возврат Ложь;
	Иначе
	    Возврат Истина;
	КонецЕсли;
		
КонецФункции     

 Функция ТекстУведомленияВHTML(Знач ТекстУведомления)
	
	ТекстУведомления = СтрЗаменить(ТекстУведомления, Символы.ПС, "<br>");
	
	ТекстУведомления = СтрШаблон(
		"<html>
		|<body>
		|<div style=""font-family:Arial;font-size:10pt;"">
		|%1
		|</div>
		|</body>
		|</html>",
		ТекстУведомления);
	
	Возврат ТекстУведомления;
	
КонецФункции 

Функция ОтправитьСообщение(знач АдресЭлектроннойПочтыОтправителя,
	                       знач ПараметрыПисьма) Экспорт
						   
	Перем Тема, ТекстСообщения, Вложения, АдресОтвета, ТипТекста;
					   
						   
	Если Не ПараметрыПисьма.Свойство("Тема", Тема) Тогда
		Тема = "";
	КонецЕсли;
	
	Если Не ПараметрыПисьма.Свойство("Тело", ТекстСообщения) Тогда
		ТекстСообщения = "";
	КонецЕсли;
	
	//Кому = Новый Массив;	
	//Кому.Добавить(ПараметрыПисьма.Кому);
	//
		
	// добавляем текст
	Если ПараметрыПисьма.Свойство("ТипТекста", ТипТекста) Тогда
		Если ТипЗнч(ТипТекста) = Тип("Строка") Тогда
			Если ТипТекста = "HTML" Тогда
				ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML;
			Иначе
				ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст;
			КонецЕсли;
		Иначе
			ТипТекста = ТипТекста;
		КонецЕсли;
	Иначе
		ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
	КонецЕсли;
		
	Письмо = РассылкаУведомленийПользователям.СоздатьПисьмоУведомление(ПараметрыПисьма.Кому, Тема,
												 ТипТекста, ТекстСообщения,, Истина); 				
	
КонецФункции

Функция АдресЭлектроннойПочтыОтправителя() Экспорт
	
	//Адрес почты - ts_upp_tasks@eurosib.biz
	//Сервер - esxexch.eurosib
	//Порт входящей почты 110
	//Порт исходящей почты 25
	//Не использовать SSL и авторизацию.
	//
	//Имя пользователя - ts_upp_tasks@eurosib
	//Пароль - atGwD3YV
	
	Возврат "dc_task@eurosib.biz";  	
	
КонецФункции   

#КонецОбласти


#Область ПринятиеПисемСОтветами

Функция ПринятьДанныеВходящихПисем(ДанныеВходящихПисем) Экспорт 
	
	РезультатОбработки = Новый Массив;
	
	Для каждого ДанныеПисьма Из ДанныеВходящихПисем Цикл  
		
		Если не ЗначениеЗаполнено(ДанныеПисьма.ИдентификаторПисьма) Тогда
			Продолжить;
		КонецЕсли;     
		
		Сообщение = Новый Структура("ИдентификаторПисьма, ТемаПисьма, ТекстПисьма, ДатаОтправки, Отправитель"); 
		ЗаполнитьЗначенияСвойств(Сообщение, ДанныеПисьма); 
		
		РегистрыСведений.ПротоколВыполненияЗадачПоПочте.ЗаписатьРезультатВыполненияПоСообщению(
				Сообщение, 
				Перечисления.РезультатыВыполненияЗадачПоПочте.КОбработке, 
				Задачи.ЗадачаИсполнителя.ПустаяСсылка());
		РезультатОбработки.Добавить(Сообщение.ИдентификаторПисьма);
	КонецЦикла;
	
	//Запуск обработки задач из почтовых сообщений     
	ИдентификаторФоновогоЗадания = Новый УникальныйИдентификатор;
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФоновогоЗадания);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Выполнение задач из почтовых сообщений'");

	ДлительныеОперации.ВыполнитьВФоне(, "РассылкаУведомленийПользователям.ВыполнитьЗадачиПоПочте",ПараметрыВыполнения);

    Возврат РезультатОбработки;

КонецФункции  

// Считывает записи с РС ПротоколВыполненияЗадачПоПочте, которые еще не были обработаны и выполняет задачи по ним, если это возможно
Процедура ВыполнитьЗадачиПоПочте(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	МАКСИМУМ(ПротоколВыполненияЗадачПоПочтеСрезПоследних.Период) КАК Период,
	|	ПротоколВыполненияЗадачПоПочтеСрезПоследних.ИдентификаторПисьма КАК ИдентификаторПисьма
	|ПОМЕСТИТЬ ВТ_ПоследниеЗаписиПоПисьмам
	|ИЗ
	|	РегистрСведений.ПротоколВыполненияЗадачПоПочте.СрезПоследних КАК ПротоколВыполненияЗадачПоПочтеСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ПротоколВыполненияЗадачПоПочтеСрезПоследних.ИдентификаторПисьма
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПротоколВыполненияЗадачПоПочтеСрезПоследних.Период КАК Период,
	|	ПротоколВыполненияЗадачПоПочтеСрезПоследних.ИдентификаторПисьма КАК ИдентификаторПисьма,
	|	ПротоколВыполненияЗадачПоПочтеСрезПоследних.РезультатВыполнения КАК РезультатВыполнения,
	|	ПротоколВыполненияЗадачПоПочтеСрезПоследних.Задача КАК Задача,
	|	ПротоколВыполненияЗадачПоПочтеСрезПоследних.ДатаОтправки КАК ДатаОтправки,
	|	ПротоколВыполненияЗадачПоПочтеСрезПоследних.Отправитель КАК Отправитель,
	|	ПротоколВыполненияЗадачПоПочтеСрезПоследних.ТемаПисьма КАК ТемаПисьма,
	|	ПротоколВыполненияЗадачПоПочтеСрезПоследних.ТекстПисьма КАК ТекстПисьма,
	|	ПротоколВыполненияЗадачПоПочтеСрезПоследних.ОписаниеОшибки КАК ОписаниеОшибки
	|ИЗ
	|	ВТ_ПоследниеЗаписиПоПисьмам КАК ВТ_ПоследниеЗаписиПоПисьмам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколВыполненияЗадачПоПочте.СрезПоследних(
	|				,
	|				ИдентификаторПисьма В
	|					(ВЫБРАТЬ
	|						Т.ИдентификаторПисьма
	|					ИЗ
	|						ВТ_ПоследниеЗаписиПоПисьмам КАК Т)) КАК ПротоколВыполненияЗадачПоПочтеСрезПоследних
	|		ПО ВТ_ПоследниеЗаписиПоПисьмам.Период = ПротоколВыполненияЗадачПоПочтеСрезПоследних.Период
	|			И ВТ_ПоследниеЗаписиПоПисьмам.ИдентификаторПисьма = ПротоколВыполненияЗадачПоПочтеСрезПоследних.ИдентификаторПисьма
	|			И (ПротоколВыполненияЗадачПоПочтеСрезПоследних.РезультатВыполнения = ЗНАЧЕНИЕ(Перечисление.РезультатыВыполненияЗадачПоПочте.КОбработке))";
	
	
	РезультатЗапроса = Запрос.Выполнить();

	Сообщение = РезультатЗапроса.Выбрать();
	
	Пока Сообщение.Следующий() Цикл
		
		НачатьТранзакцию();
		
		ЗадачаСсылка = ПредопределенноеЗначение("Задача.ЗадачаИсполнителя.ПустаяСсылка");
		
		Попытка
			
			КодЯзыкаИсполнителя = ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка();
			
			// Определяем задачу и вариант ее исполнения по теме и тексту сообщения.
			ЗадачаИВариантВыполнения = ЗадачаИВариантВыполненияПоТемеСообщения(Сообщение.ТемаПисьма);   
			ЗадачаСсылка = ЗадачаИВариантВыполнения.Задача;
			ВариантВыполненияЗадачи = ЗадачаИВариантВыполнения.ВариантВыполнения; 
			
			Если Не ЗначениеЗаполнено(ЗадачаИВариантВыполнения.Задача) Тогда
				
				
				РегистрыСведений.ПротоколВыполненияЗадачПоПочте.ЗаписатьРезультатВыполненияПоСообщению(
					Сообщение,
					Перечисления.РезультатыВыполненияЗадачПоПочте.ВСообщенииНеУказанИдентификаторЗадачи,
					ЗадачаСсылка);
				
				ОтправитьУведомлениеОбОшибке(
					Сообщение,
					Перечисления.РезультатыВыполненияЗадачПоПочте.ВСообщенииНеУказанИдентификаторЗадачи,
					ЗадачаСсылка,
					КодЯзыкаИсполнителя);
				
				ЗафиксироватьТранзакцию();
				Продолжить;
				
			КонецЕсли;
			
			Если Не ОбщегоНазначения.СсылкаСуществует(ЗадачаИВариантВыполнения.Задача) Тогда
				
				РегистрыСведений.ПротоколВыполненияЗадачПоПочте.ЗаписатьРезультатВыполненияПоСообщению(
					Сообщение, Перечисления.РезультатыВыполненияЗадачПоПочте.ЗадачаНеНайдена,
					ЗадачаСсылка);
				
				ОтправитьУведомлениеОбОшибке(
					Сообщение,
					Перечисления.РезультатыВыполненияЗадачПоПочте.ЗадачаНеНайдена,
					ЗадачаСсылка,
					КодЯзыкаИсполнителя);
				
				ЗафиксироватьТранзакцию();
				Продолжить;
				
			КонецЕсли;
			
			Если ЗадачаИВариантВыполнения.ВариантВыполнения = Неопределено Тогда
				
				РегистрыСведений.ПротоколВыполненияЗадачПоПочте.ЗаписатьРезультатВыполненияПоСообщению(
					Сообщение,
					Перечисления.РезультатыВыполненияЗадачПоПочте.ВСообщенииНеУказанИдентификаторОтвета,
					ЗадачаСсылка);
				
				ОтправитьУведомлениеОбОшибке(
					Сообщение,
					Перечисления.РезультатыВыполненияЗадачПоПочте.ВСообщенииНеУказанИдентификаторОтвета,
					ЗадачаСсылка,
					КодЯзыкаИсполнителя);
				
				ЗафиксироватьТранзакцию();
				Продолжить;
				
			КонецЕсли;    
			
			// Получаем реквизиты задачи в базе.
			РеквизитыЗадачи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗадачаСсылка, "Выполнена, ПометкаУдаления, ОбъектЗадачи, Состояние");
			
			//Проверяем активна ли задача         
			Если РеквизитыЗадачи.Выполнена или РеквизитыЗадачи.ПометкаУдаления Тогда
				
				РегистрыСведений.ПротоколВыполненияЗадачПоПочте.ЗаписатьРезультатВыполненияПоСообщению(
					Сообщение,
					Перечисления.РезультатыВыполненияЗадачПоПочте.ЗадачаНеАктивна,
					ЗадачаСсылка);
				
				ОтправитьУведомлениеОбОшибке(
					Сообщение,
					Перечисления.РезультатыВыполненияЗадачПоПочте.ЗадачаНеАктивна,
					ЗадачаСсылка,
					КодЯзыкаИсполнителя);
				
				ЗафиксироватьТранзакцию();
				Продолжить;
			
			КонецЕсли;
			
			// Проверяем соответствие результата выполнения и задачи.
			Если Не ПроверитьСоответствиеРезультатВыполненияИЗадачи(
				РеквизитыЗадачи.Состояние,
				ВариантВыполненияЗадачи, РеквизитыЗадачи.ОбъектЗадачи) Тогда
				
				РегистрыСведений.ПротоколВыполненияЗадачПоПочте.ЗаписатьРезультатВыполненияПоСообщению(
					Сообщение,
					Перечисления.РезультатыВыполненияЗадачПоПочте.ЗадачеНеСоответствуетЗначениеОтвета,
					ЗадачаСсылка);
				
				ОтправитьУведомлениеОбОшибке(
					Сообщение,
					Перечисления.РезультатыВыполненияЗадачПоПочте.ЗадачеНеСоответствуетЗначениеОтвета,
					ЗадачаСсылка,
					КодЯзыкаИсполнителя);
				
				ЗафиксироватьТранзакцию();
				Продолжить;
				
			КонецЕсли;
			
			// Определяем исполнителя задачи по отправителю сообщения.
			ПараметрыОтправителя = РазложитьПредставлениеАдресаЭлектроннойПочты(Сообщение.Отправитель);   
			
			ЗапросОтправитель = Новый Запрос;
			ЗапросОтправитель.Текст =			
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ПользователиКонтактнаяИнформация.Ссылка КАК Пользователь
			|ИЗ
			|	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация 
			| ГДЕ
			|	ПользователиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
			|	И ПользователиКонтактнаяИнформация.Представление ПОДОБНО &АдресЭП
			|	И НЕ ПользователиКонтактнаяИнформация.Ссылка.ПометкаУдаления";
	
			ЗапросОтправитель.УстановитьПараметр("АдресЭП", ПараметрыОтправителя.Адрес);
			ВыборкаОтправитель = ЗапросОтправитель.Выполнить().Выбрать();
			
			Если ВыборкаОтправитель.Следующий() Тогда
				ИсполнительЗадачиПоЭлАдресу = ВыборкаОтправитель.Пользователь;
			Иначе
				ИсполнительЗадачиПоЭлАдресу = Неопределено;
			КонецЕсли;
			
			Если ВыборкаОтправитель.Количество() > 1 Тогда
				
				РегистрыСведений.ПротоколВыполненияЗадачПоПочте.ЗаписатьРезультатВыполненияПоСообщению(
					Сообщение,
					Перечисления.РезультатыВыполненияЗадачПоПочте.ПоАдресуОтправителяНайденоНесколькоИсполнителей,
					ЗадачаСсылка);
				
				ОтправитьУведомлениеОбОшибке(
					Сообщение,
					Перечисления.РезультатыВыполненияЗадачПоПочте.ПоАдресуОтправителяНайденоНесколькоИсполнителей,
					ЗадачаСсылка,
					КодЯзыкаИсполнителя);
				
				ЗафиксироватьТранзакцию();
				Продолжить;
				
			ИначеЕсли ВыборкаОтправитель.Количество() = 0 Тогда
				
				РегистрыСведений.ПротоколВыполненияЗадачПоПочте.ЗаписатьРезультатВыполненияПоСообщению(
					Сообщение,
					Перечисления.РезультатыВыполненияЗадачПоПочте.ПоАдресуОтправителяНеНайденИсполнительЗадачи,
					ЗадачаСсылка);
				
				ОтправитьУведомлениеОбОшибке(
					Сообщение,
					Перечисления.РезультатыВыполненияЗадачПоПочте.ПоАдресуОтправителяНеНайденИсполнительЗадачи,
					ЗадачаСсылка,
					КодЯзыкаИсполнителя);
				
				ЗафиксироватьТранзакцию();
				Продолжить;
				
			КонецЕсли;
			
			//Если новое состояние - отклонен, то должна быть заполнена причина 
			Комментарий = "";
			// Евросиб US 90342 Рыбьяков К.А. 06.03.2026 ((
			Если ЗадачаИВариантВыполнения.ВариантВыполнения = Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний
				Или ЗадачаИВариантВыполнения.ВариантВыполнения = Перечисления.СтатусыСогласования.СогласованоСЗамечаниями Тогда
			//Если ЗадачаИВариантВыполнения.ВариантВыполнения = Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний Тогда
			// Евросиб Рыбьяков К.А. 06.03.2026 ))
				
				ТекстОшибкиРазбораПричины = "";
				МассивПодстрок = СтрРазделить(Сообщение.ТекстПисьма, ":");
				// Евросиб US 90342 Рыбьяков К.А. 05.03.2026 ((
				Если МассивПодстрок.Количество() >= 2 и (МассивПодстрок[0] = "Причина отказа" Или МассивПодстрок[0] = "Причина отклонения") Тогда
				//Если МассивПодстрок.Количество() >= 2 и МассивПодстрок[0] = "Причина отказа" Тогда
				// Евросиб Рыбьяков К.А. 05.03.2026 ))
				    МассивСтрок = СтрРазделить(СокрЛП(МассивПодстрок[1]), Символы.ПС);
					Если МассивСтрок.Количество() > 0 и НЕ МассивСтрок[0] = "" Тогда
					    Комментарий = МассивСтрок[0];
					Иначе
						Комментарий = "Согласование отклонено в Outlook. Причина отказа не указана. Обратитесь к согласующему";
						
					//	ТекстОшибкиРазбораПричины = "Не найдена причина отказа в ответном сообщении.
					//								|Необходимо повторить действия и указать причину отказа";
					КонецЕсли;
				Иначе	
					ТекстОшибкиРазбораПричины = "Не найдена причина отказа в ответном сообщении.
												|Необходимо повторить действия и указать причину отказа";	
				КонецЕсли;
				
				Если ТекстОшибкиРазбораПричины <> "" Тогда
					РегистрыСведений.ПротоколВыполненияЗадачПоПочте.ЗаписатьРезультатВыполненияПоСообщению(
						Сообщение,
						Перечисления.РезультатыВыполненияЗадачПоПочте.НеЗаполненаПричинаОтказа,
						ЗадачаСсылка);
					
					ОтправитьУведомлениеОбОшибке(
						Сообщение,
						Перечисления.РезультатыВыполненияЗадачПоПочте.НеЗаполненаПричинаОтказа,
						ЗадачаСсылка,
						КодЯзыкаИсполнителя,
						ТекстОшибкиРазбораПричины);
					
					ЗафиксироватьТранзакцию();
					Продолжить;
				КонецЕсли; 
			Иначе
				Комментарий = "Согласовано по эл. почте"; 			
			КонецЕсли;
			
			РеквизитыЗадачи.Вставить("Комментарий", Комментарий);
			// определеяем по типу документа
			ЗаполнитьЗначенияПараметровСогласованияЗаявки(РеквизитыЗадачи);
			
			//структура результата универсальная 
			РезультатПроверки = ПровериьВозможностьВыполнения(РеквизитыЗадачи);			
			
			Если РезультатПроверки.ЗакрытиеЗадачиНевозможно Тогда							
				РегистрыСведений.ПротоколВыполненияЗадачПоПочте.ЗаписатьРезультатВыполненияПоСообщению(
					Сообщение,
					Перечисления.РезультатыВыполненияЗадачПоПочте.Ошибка,
					ЗадачаСсылка,
					РезультатПроверки.Описание);    
					
				ОтправитьУведомлениеОбОшибке(
					Сообщение,
					Перечисления.РезультатыВыполненияЗадачПоПочте.Ошибка,
					ЗадачаСсылка,
					КодЯзыкаИсполнителя, 
					РезультатПроверки.Описание);
				
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;	
				
			Если РеквизитыЗадачи.ПометкаНаУдалениеОбъектаЗадачи Тогда
				
				РегистрыСведений.ПротоколВыполненияЗадачПоПочте.ЗаписатьРезультатВыполненияПоСообщению(
					Сообщение,
					Перечисления.РезультатыВыполненияЗадачПоПочте.Ошибка,
					ЗадачаСсылка,
					"Документ помечен на удаление");    
					
				ОтправитьУведомлениеОбОшибке(
					Сообщение,
					Перечисления.РезультатыВыполненияЗадачПоПочте.Ошибка,
					ЗадачаСсылка,
					КодЯзыкаИсполнителя, 
					"Документ помечен на удаление");
                ЗафиксироватьТранзакцию();
				Продолжить;

			Иначе   
				ЗадачаВыполнена = Ложь; 
				ОтметитьВыполнениеЗадачПоСсылке(РеквизитыЗадачи.ОбъектЗадачи, РеквизитыЗадачи.Состояние, ИсполнительЗадачиПоЭлАдресу, Комментарий, ВариантВыполненияЗадачи); 
				ЗадачаВыполнена = Истина;
				
			КонецЕсли;
				
				Если ЗадачаВыполнена Тогда
					РегистрыСведений.ПротоколВыполненияЗадачПоПочте.ЗаписатьРезультатВыполненияПоСообщению(
						Сообщение, 
						Перечисления.РезультатыВыполненияЗадачПоПочте.Выполнена,
						ЗадачаСсылка,
						Строка(ВариантВыполненияЗадачи)); 
						
				Иначе
				    РегистрыСведений.ПротоколВыполненияЗадачПоПочте.ЗаписатьРезультатВыполненияПоСообщению(
						Сообщение, 
						Перечисления.РезультатыВыполненияЗадачПоПочте.Ошибка,
						ЗадачаСсылка,
						"Произошла ошибка при согласовании заявки (реестра)"); 
						
					ОтправитьУведомлениеОбОшибке(
					Сообщение,
					Перечисления.РезультатыВыполненияЗадачПоПочте.Ошибка,
					ЗадачаСсылка,
					КодЯзыкаИсполнителя, 
					"Произошла ошибка при согласовании заявки (реестра)");
					
					Если ТранзакцияАктивна() Тогда
						ОтменитьТранзакцию();
					КонецЕсли;
					
					Продолжить;						
				КонецЕсли;							
			ЗафиксироватьТранзакцию();
			
		Исключение
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();
			КонецЕсли;

			РегистрыСведений.ПротоколВыполненияЗадачПоПочте.ЗаписатьРезультатВыполненияПоСообщению(
				Сообщение, 
				Перечисления.РезультатыВыполненияЗадачПоПочте.Ошибка,
				ЗадачаСсылка,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));  
				
			ОтправитьУведомлениеОбОшибке(
					Сообщение,
					Перечисления.РезультатыВыполненияЗадачПоПочте.Ошибка,
					ЗадачаСсылка,
					КодЯзыкаИсполнителя, 
					"Не удалось выполнить " + РеквизитыЗадачи.Состояние + ". Подробности в журнале регистрации.");
			Продолжить;
		КонецПопытки;
	
	КонецЦикла; 
	
	РегистрыСведений.ПротоколВыполненияЗадачПоПочте.ОчиститьРегистрОтУстаревшихЗаписей();

КонецПроцедуры 

// Заполняет текущие значения согласования заявки или реестра (объекта задачи)
//
// Параметры:
//  РеквизитыЗадачи  - Структура - структура, содержащая реквизиты задачи к выполнению
//
Процедура ЗаполнитьЗначенияПараметровСогласованияЗаявки(РеквизитыЗадачи)
	
	Состояние = РеквизитыЗадачи.Состояние;	
	ПометкаНаУдаление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыЗадачи.ОбъектЗадачи, "ПометкаУдаления");
	РеквизитыЗадачи.Вставить("ПометкаНаУдалениеОбъектаЗадачи", ПометкаНаУдаление);
	
	Если ТипЗнч(РеквизитыЗадачи.ОбъектЗадачи) = Тип("ДокументСсылка.РеестрПлатежей") Тогда 
		ТаблицаСостояний = РеквизитыЗадачи.ОбъектЗадачи.Состояния;
		СтруктураПоиска = Новый Структура("Состояние",Состояние);
		НайденнаяСтрока = ТаблицаСостояний.НайтиСтроки(СтруктураПоиска);
		
		Если НайденнаяСтрока.Количество()>0 Тогда
			ТекущееСостояние = НайденнаяСтрока[0].Состояние;
			ТекущийСтатусСогласования = НайденнаяСтрока[0].СтатусСогласования;
			СостояниеДокумента = РегистрыСведений.СтатусыОбъектов.ПолучитьПоследнее(ТекущаяДата(), Новый Структура("Объект", РеквизитыЗадачи.ОбъектЗадачи));
			РеквизитыЗадачи.Вставить("ТекущееСостояние", ТекущееСостояние);
			РеквизитыЗадачи.Вставить("ТекущийСтатусСогласования", ТекущийСтатусСогласования); 
			СостояниеДокумента = СостояниеДокумента.Статус;
			РезультатВыполненияСостояния = НайденнаяСтрока[0].Статус;
			//РегистрыСведений.СтатусыОбъектов.ПолучитьПоследнееЗначениеСтатуса(РеквизитыЗадачи.ОбъектЗадачи).Статус;
			РеквизитыЗадачи.Вставить("СостояниеДокумента", СостояниеДокумента);
			РеквизитыЗадачи.Вставить("РезультатВыполненияСостояния", РезультатВыполненияСостояния);
		Иначе	
			РеквизитыЗадачи.Вставить("ТекущееСостояние", Неопределено);
			РеквизитыЗадачи.Вставить("ТекущийСтатусСогласования", Неопределено);
			РеквизитыЗадачи.Вставить("СостояниеДокумента", Неопределено);
			РеквизитыЗадачи.Вставить("РезультатВыполненияСостояния", Неопределено);
		КонецЕсли;
	// Евросиб US 90342 TA 90342 Рыбьяков К.А. 13.02.2026 ((
	ИначеЕсли ТипЗнч(РеквизитыЗадачи.ОбъектЗадачи) = Тип("ДокументСсылка.РеестрСпециальныхСтавок") Тогда
		ТаблицаСостояний = РеквизитыЗадачи.ОбъектЗадачи.Состояния;
		СтруктураПоиска = Новый Структура("Состояние",Состояние);
		НайденнаяСтрока = ТаблицаСостояний.НайтиСтроки(СтруктураПоиска);
		
		Если НайденнаяСтрока.Количество()>0 Тогда
			ТекущееСостояние = НайденнаяСтрока[0].Состояние;
			ТекущийСтатусСогласования = НайденнаяСтрока[0].СтатусСогласования;
			СостояниеДокумента = РегистрыСведений.СтатусыОбъектов.ПолучитьПоследнее(ТекущаяДата(), Новый Структура("Объект", РеквизитыЗадачи.ОбъектЗадачи));
			РеквизитыЗадачи.Вставить("ТекущееСостояние", ТекущееСостояние);
			РеквизитыЗадачи.Вставить("ТекущийСтатусСогласования", ТекущийСтатусСогласования); 
			СостояниеДокумента = СостояниеДокумента.Статус;
			РезультатВыполненияСостояния = НайденнаяСтрока[0].Статус;
			РеквизитыЗадачи.Вставить("СостояниеДокумента", СостояниеДокумента);
			РеквизитыЗадачи.Вставить("РезультатВыполненияСостояния", РезультатВыполненияСостояния);
		Иначе	
			РеквизитыЗадачи.Вставить("ТекущееСостояние", Неопределено);
			РеквизитыЗадачи.Вставить("ТекущийСтатусСогласования", Неопределено);
			РеквизитыЗадачи.Вставить("СостояниеДокумента", Неопределено);
			РеквизитыЗадачи.Вставить("РезультатВыполненияСостояния", Неопределено);
		КонецЕсли;
	// Евросиб Рыбьяков К.А. 13.02.2026 ))
	Иначе	
		РеквизитыЗадачи.Вставить("ТекущееСостояние", Неопределено);
		РеквизитыЗадачи.Вставить("ТекущийСтатусСогласования", Неопределено);
		РеквизитыЗадачи.Вставить("СостояниеДокумента", Неопределено);		
		РеквизитыЗадачи.Вставить("РезультатВыполненияСостояния", Неопределено);
	КонецЕсли;
	
КонецПроцедуры 


// Принимает строку почтового адреса в виде
// "name <addr@dom>"
// Возвращает:
// Результат (Структура)
// - Адрес (Строка) - addr@dom
// - ОтображаемоеИмя (Строка) - name
// - Пользователь (Строка)-  addr
// - Домен (Строка) - dom
//
Функция РазложитьПредставлениеАдресаЭлектроннойПочты(Знач АдресЭлектроннойПочтыСтр) Экспорт
	
	Результат = Новый Структура("Адрес, ОтображаемоеИмя, Пользователь, Домен, ФИО", "", "", "", "", "");
	
	АдресЭлектроннойПочтыСтр = СокрЛП(АдресЭлектроннойПочтыСтр);
	
	Поз = Найти(АдресЭлектроннойПочтыСтр, "@");
	Если Поз = 0 Тогда
		Результат.ФИО = АдресЭлектроннойПочтыСтр;
		Возврат Результат;
	КонецЕсли;
	
	СтрокаАдреса = "";
	ПозицияПервогоСимволаАдреса = 0;
	ПозицияПоследнегоСимволаАдреса = 0;
	
	// Идем влево от @
	Для Индекс = 0 По Поз - 1 Цикл
		
		ИндексВСтроке = Поз - Индекс;
		СтрокаАдресаПроверка = Сред(АдресЭлектроннойПочтыСтр, ИндексВСтроке, 1) + СтрокаАдреса;
		
		Если СтрокаСодержитТолькоДопустимыеСимволы(СтрокаАдресаПроверка) Тогда
			СтрокаАдреса = СтрокаАдресаПроверка;
			ПозицияПервогоСимволаАдреса = ИндексВСтроке;
		Иначе
			Прервать;
		КонецЕсли;	
		
	КонецЦикла;	
	
	// Идем вправо от @
	Для ИндексВСтроке = Поз + 1 По СтрДлина(АдресЭлектроннойПочтыСтр) Цикл
		
		СтрокаАдресаПроверка = СтрокаАдреса + Сред(АдресЭлектроннойПочтыСтр, ИндексВСтроке, 1);
		
		Если СтрокаСодержитТолькоДопустимыеСимволы(СтрокаАдресаПроверка) Тогда
			СтрокаАдреса = СтрокаАдресаПроверка;
			ПозицияПоследнегоСимволаАдреса = ИндексВСтроке;
		Иначе
			Прервать;
		КонецЕсли;	
		
	КонецЦикла;	
	
	Результат.Адрес = СтрокаАдреса;
	// слева от адреса берем представление
	Результат.ОтображаемоеИмя = Лев(АдресЭлектроннойПочтыСтр, ПозицияПервогоСимволаАдреса - 2);
	Результат.ОтображаемоеИмя = СокрЛП(Результат.ОтображаемоеИмя);
	
	Если Не ЭтоАдресЭлектроннойПочты(Результат.Адрес) Тогда
		Результат.Адрес = "";
	Иначе
		Поз = Найти(Результат.Адрес, "@");
		Результат.Пользователь = Лев(Результат.Адрес, Поз - 1);
		Результат.Домен = Сред(Результат.Адрес, Поз + 1);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает задачу и вариант выполнения по теме сообщения.
//
// Параметры:
//  ТемаСообщения - Строка - тема сообщения.
//
// Возвращаемое значение:
//  Струкутра:
//   * Задача - ЗадачаСсылка.ЗадачаИсполнителя
//   * ВариантВыполнения - ПеречисленияСсылка.ВариантыВыполненияПроцессовИЗадач
//
Функция ЗадачаИВариантВыполненияПоТемеСообщения(ТемаСообщения)
	
	Результат = Новый Структура("Задача, ВариантВыполнения");
	
	Если Не ЗначениеЗаполнено(ТемаСообщения) Тогда
		Возврат Результат;
	КонецЕсли;
	
	//СлужебнаяИнформацияСтрокой = Прав(ТемаСообщения, 39);
	
	СлужебнаяИнформация = СтрРазделить(ТемаСообщения, "$", Ложь);
	
	КоличествоСлужебнойИнформации = СлужебнаяИнформация.Количество();
	Если КоличествоСлужебнойИнформации < 4 Тогда
		Возврат Результат;
	КонецЕсли;
	
	ИдентификаторЗадачиСтрокой = СлужебнаяИнформация[СлужебнаяИнформация.Количество() - 3];
	НомерОтвета = СлужебнаяИнформация[СлужебнаяИнформация.Количество() - 2];
	
	ИдентификаторЗадачи = Неопределено;
	Попытка
		ИдентификаторЗадачи = Новый УникальныйИдентификатор(ИдентификаторЗадачиСтрокой);
	Исключение
		// Ничего не делаем.
		// Считаем, что не удалось определить ссылку на задачу по теме сообщения.
		// При необходимости этот факт будет зафиксирован отдельно в протоколе
		// выполнения задач по почте в вызывающем коде.
	КонецПопытки;
	Если ЗначениеЗаполнено(ИдентификаторЗадачи) Тогда
		Результат.Задача = Задачи.ЗадачаИсполнителя.ПолучитьСсылку(ИдентификаторЗадачи);
	КонецЕсли;
	
	Результат.ВариантВыполнения = ВариантВыполненияПоПоЧисловомуИдентификатору(НомерОтвета);
	
	Возврат Результат;
	
КонецФункции

// Отправляем уведомление об ошибке, возникшей при обработке сообщения.
//
// Параметры:
//  Сообщение - Структура - см. ЛегкаяПочтаКлиентСервер.СформироватьСтруктуруСообщения
//  РезультатВыполненияЗадачиПоПочте - ПеречислениеСсылка.РезультатВыполненияЗадачиПоПочте - результат обработки сообщения.
//  КодЯзыка - Строка - код языки для формирования текстов уведомления.
//  Описание - Строка - дополнительное описание ошибки.
//
Процедура ОтправитьУведомлениеОбОшибке(Сообщение,
	РезультатВыполненияЗадачиПоПочте,
	Задача,
	КодЯзыка,
	Описание = "")
	
	Если ТипЗнч(РезультатВыполненияЗадачиПоПочте) <>
		Тип("ПеречислениеСсылка.РезультатыВыполненияЗадачПоПочте") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Сообщение.Отправитель) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ТипЗнч(Задача) <> Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
		Возврат;
	КонецЕсли;

	ТемаУведомления = НСтр("ru = 'Ошибка исполнения задачи по почте: '", КодЯзыка);

	Если ЗначениеЗаполнено(Задача) и ЗначениеЗаполнено(Задача.Состояние) Тогда
		ТемаУведомления = ТемаУведомления + Строка(Задача.Состояние);
	Иначе
		ТемаУведомления = ТемаУведомления + Строка(Сообщение.ТемаПисьма);
	КонецЕсли;
	
	Если РезультатВыполненияЗадачиПоПочте =
		Перечисления.РезультатыВыполненияЗадачПоПочте.ЗадачаНеНайдена Тогда
		
		ТекстУведомления = 
			НСтр("ru = 'При обработке письма об исполнении задачи возникла ошибка.
			|Не найдена задача в базе данных.
			|Обратитесь к автору задачи или администратору.'", КодЯзыка);
			
	ИначеЕсли РезультатВыполненияЗадачиПоПочте =
			Перечисления.РезультатыВыполненияЗадачПоПочте.ПоАдресуОтправителяНайденоНесколькоИсполнителей
		ИЛИ РезультатВыполненияЗадачиПоПочте =
			Перечисления.РезультатыВыполненияЗадачПоПочте.ПоАдресуОтправителяНеНайденИсполнительЗадачи Тогда
		
		ТекстУведомления = 
			НСтр("ru = 'При обработке письма об исполнении задачи возникла ошибка.
			|По вашему адресу не удалось определить исполнителя задачи.
			|Обратитесь к администратору.'", КодЯзыка);
			
	ИначеЕсли РезультатВыполненияЗадачиПоПочте =
			Перечисления.РезультатыВыполненияЗадачПоПочте.ДляЗадачиОпределенДругойИсполнитель Тогда
			
		ТекстУведомления = 
			НСтр("ru = 'При обработке письма об исполнении задачи возникла ошибка.
			|Для задачи определен другой исполнитель.
			|Обратитесь к автору задачи.'", КодЯзыка);
		
	ИначеЕсли РезультатВыполненияЗадачиПоПочте =
			Перечисления.РезультатыВыполненияЗадачПоПочте.ЗадачаНеАктивна Тогда
			
		ТекстУведомления = 
			НСтр("ru = 'При обработке письма об исполнении задачи возникла ошибка.
			|Задача не активна и могла быть выполнена другим исполнителем.'", КодЯзыка);
		
	ИначеЕсли Описание <> "" Тогда 
		
		ТекстУведомления = Описание;
		
	Иначе
		
		ТекстУведомления = 
			НСтр("ru = 'При обработке письма об исполнении задачи возникла ошибка.
			|Возможно в вашем письме (ответе) отсутствовал текст служебной информации
			|или ответное письмо было сформировано не по ссылкам в уведомлении.
			|Попробуйте исполнить задачу еще раз.'", КодЯзыка);
		
	КонецЕсли; 
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Тема", ТемаУведомления);
	ПараметрыПисьма.Вставить("Тело", ТекстУведомления);
	ПараметрыПисьма.Вставить("Кому", Сообщение.Отправитель);
	ПараметрыПисьма.Вставить("ТипТекста", "ПростойТекст");     
	ПараметрыПисьма.Вставить("ТипТекста", "HTML");
//	ПараметрыПисьма.Вставить("ПоляЗаголовка", ПоляЗаголовка);
	
	ОтправитьСообщение(АдресЭлектроннойПочтыОтправителя(), ПараметрыПисьма);
	
КонецПроцедуры

Функция СтрокаСодержитТолькоДопустимыеСимволы(АдресЭлектроннойПочты)
	
	ДопустимыеСимволы = "-.0123456789@ABCDEFGHIJKLMNOPQRSTUVWXYZ_abcdefghijklmnopqrstuvwxyz";
	Для НомерСимвола = 1 По СтрДлина(АдресЭлектроннойПочты) Цикл
		Если Найти(ДопустимыеСимволы, Сред(АдресЭлектроннойПочты, НомерСимвола, 1)) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла; 
	
	Возврат Истина;
	
КонецФункции

// Проверяет строку на формат адреса электронной почты
// проверка не точная но основные элементы на месте
//
Функция ЭтоАдресЭлектроннойПочты(АдресЭлектроннойПочты) Экспорт
	
	Поз = Найти(АдресЭлектроннойПочты, "@");
	Если Поз = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	Если СтрЧислоВхождений(АдресЭлектроннойПочты, "@") <> 1 Тогда
		Возврат Ложь;
	КонецЕсли;
	Если Прав(АдресЭлектроннойПочты, 1) = "."
		Или Лев(АдресЭлектроннойПочты, 1) = "." Тогда
		Возврат Ложь;
	КонецЕсли;
	Если Найти(АдресЭлектроннойПочты, "..") > 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДопустимыеСимволы = "-.0123456789@ABCDEFGHIJKLMNOPQRSTUVWXYZ_abcdefghijklmnopqrstuvwxyz";
	Для НомерСимвола = 1 По СтрДлина(АдресЭлектроннойПочты) Цикл
		Если Найти(ДопустимыеСимволы, Сред(АдресЭлектроннойПочты, НомерСимвола, 1)) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Пользователь = Лев(АдресЭлектроннойПочты, Поз - 1);
	Если СтрДлина(Пользователь) = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Сервер = Сред(АдресЭлектроннойПочты, Поз + 1);
	Если СтрДлина(Сервер) = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Поз = Найти(Сервер, ".");
	Если Поз = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Проверяет соответствие результата выполнения и задачи.
//
// Параметры:
//  ЗадачаСсылка - ЗадачаСсылка.ЗадачаИсполнителя - ссылка на задачу.
//  РезультатВыполнения - ПеречислениеСсылка.ВариантыВыполненияПроцессовИЗадач - результат выполнения задачи.
//
// Возвращаемое значение:
//  Булево:
//   * Истина - если результат допустим для задачи.
//   * Ложь - если результат не допустим.
//
Функция ПроверитьСоответствиеРезультатВыполненияИЗадачи(ЗадачаСсылка, РезультатВыполнения, Документ)
	
	Результат = Истина;
	
	ВозможныеВариантыВыполнения = ПолучитьСписокВариантовВыполненияЗадачи(ЗадачаСсылка, Документ);
	
	Если ВозможныеВариантыВыполнения.СписокВариантовОтветов.НайтиПоЗначению(
			РезультатВыполнения) = Неопределено Тогда
			
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции  

 Функция ВариантВыполненияПоПоЧисловомуИдентификатору(ИдентификаторОтвета)
	
	Если ИдентификаторОтвета = "" Тогда
		ВариантВыполнения = Неопределено;
	ИначеЕсли ИдентификаторОтвета = "1" Тогда
		ВариантВыполнения = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний;
	ИначеЕсли ИдентификаторОтвета = "2" Тогда
		ВариантВыполнения = Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний;
	// Евросиб US 90342 Рыбьяков К.А. 05.03.2026 ((
	ИначеЕсли ИдентификаторОтвета = "3" Тогда
		ВариантВыполнения = Перечисления.СтатусыСогласования.СогласованоСЗамечаниями;
	// Евросиб Рыбьяков К.А. 05.03.2026 ))
	Иначе
		ВариантВыполнения = Перечисления.СтатусыСогласования.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ВариантВыполнения;
	
КонецФункции

Функция ПровериьВозможностьВыполнения(РеквизитыЗадачи)

	РезультатВыполнения = Новый Структура("ЗакрытиеЗадачиНевозможно, Описание");	
	Если ТипЗнч(РеквизитыЗадачи.ОбъектЗадачи) =	Тип("ДокументСсылка.РеестрПлатежей") Тогда		
		ЗакрытиеЗадачиНевозможно = Ложь;
		Описание = "";
		Если РеквизитыЗадачи.РезультатВыполненияСостояния = Перечисления.СтатусыЭтапов.Выполнен Тогда
			ЗакрытиеЗадачиНевозможно = Истина;
			Описание = "Задача уже выполнена.";
		ИначеЕсли РеквизитыЗадачи.СостояниеДокумента = Справочники.СтатусыДокументов.РеестрУтвержден
			и РеквизитыЗадачи.Состояние = Справочники.Состояния.Согласование Тогда 
			ЗакрытиеЗадачиНевозможно = Истина;
			Описание = "Реестр уже был утвержден, повторное согласование невозможно."; 
		ИначеЕсли (РеквизитыЗадачи.СостояниеДокумента = Справочники.СтатусыДокументов.РеестрНеСогласован
			или РеквизитыЗадачи.СостояниеДокумента = Справочники.СтатусыДокументов.РеестрНеУтвержден) Тогда 
			ЗакрытиеЗадачиНевозможно = Истина;
			Описание = "Реестр был не утвержден или не согласован, выполнение согласования/утверждения невозможно.";
			
		ИначеЕсли РеквизитыЗадачи.СостояниеДокумента = Справочники.СтатусыДокументов.РеестрПодготовлен Тогда 
			ЗакрытиеЗадачиНевозможно = Истина;
			Описание = "Реестр находится в статусе ""подготовлен"", выполнение согласования/утверждения невозможно.";

		КонецЕсли;
	// Евросиб US 90342 TA 90342 Рыбьяков К.А. 13.02.2026 ((
	ИначеЕсли ТипЗнч(РеквизитыЗадачи.ОбъектЗадачи) =Тип("ДокументСсылка.РеестрСпециальныхСтавок") Тогда
		ЗакрытиеЗадачиНевозможно = Ложь;
		Описание = "";
		Если РеквизитыЗадачи.РезультатВыполненияСостояния = Перечисления.СтатусыЭтапов.Выполнен Тогда
			ЗакрытиеЗадачиНевозможно = Истина;
			Описание = "Задача уже выполнена.";
		ИначеЕсли (РеквизитыЗадачи.СостояниеДокумента = Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний
			Или РеквизитыЗадачи.СостояниеДокумента = Перечисления.СтатусыСогласования.ОтклоненоСЗамечаниями) Тогда
			ЗакрытиеЗадачиНевозможно = Истина;
			Описание = "Документ специальные ставки был не отклонен, выполнение согласования/утверждения невозможно.";
		ИначеЕсли РеквизитыЗадачи.СостояниеДокумента = Перечисления.СтатусыСогласования.Планируется Тогда
			ЗакрытиеЗадачиНевозможно = Истина;
			Описание = "Документ специальные ставки находится в статусе ""Планируется"", выполнение согласования/утверждения невозможно.";
		КонецЕсли;
	// Евросиб Рыбьяков К.А. 13.02.2026 ))
	КонецЕсли;
	РезультатВыполнения.ЗакрытиеЗадачиНевозможно = ЗакрытиеЗадачиНевозможно;
	РезультатВыполнения.Описание = Описание;
		
	Возврат РезультатВыполнения;
	
КонецФункции 

Процедура ОтметитьВыполнениеЗадачПоСсылке(Ссылка, Состояние, Исполнитель, Комментарий, СтатусСогласования) Экспорт
	
	Объект = Ссылка.ПолучитьОбъект();
	СтатусВыполнен = Перечисления.СтатусыЭтапов.Выполнен;
	СтатусОтклонен = Перечисления.СтатусыЭтапов.Отклонен;
	
	ДатаВыполнения = ТекущаяДата();
	Для Каждого СтрокаТЧ Из Объект.Состояния Цикл
		Если Состояние = СтрокаТЧ.Состояние Тогда
			СтрокаТЧ.Статус = СтатусВыполнен;
			СтрокаТЧ.СтатусСогласования = СтатусСогласования ;
			СтрокаТЧ.Исполнитель = Исполнитель;
			СтрокаТЧ.ЗавершениеРаботы = ДатаВыполнения;
			СтрокаТЧ.Комментарий = Комментарий;
		КонецЕсли;
	КонецЦикла; 
	
	// Евросиб US 90342 TA 90342 Рыбьяков К.А. 13.02.2026 ((
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.РеестрСпециальныхСтавок") Тогда
		// для этого документа не заполняем
	Иначе
		Объект.Комментарий = Комментарий;
	КонецЕсли;
	//Объект.Комментарий = Комментарий;
	// Евросиб Рыбьяков К.А. 24.03.2026 ))
	
	Если Объект.Модифицированность() Тогда
		Объект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьТекстУведомленияРеестрПлатежей(ТекстПисьма, Задача, Документ, Комментарий, СсылкиОтветов, Тема);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеестрПлатежейЗаявки.Контрагент КАК Контрагент,
	|	РеестрПлатежейЗаявки.ОтветственныйЗаОплату КАК ОтветственныйЗаОплату,
	|	РеестрПлатежейЗаявки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	РеестрПлатежейЗаявки.УслугиПТУСчет КАК УслугиПТУСчет,
	|	РеестрПлатежейЗаявки.СуммаПлатежаРуб КАК СуммаПлатежаРуб,
	//Евросиб СубботинВ #128538 23.01.2026 Начало
	|	РеестрПлатежейЗаявки.Ссылка КАК Реестр
	//Евросиб СубботинВ #128538 23.01.2026 Конец
	|ИЗ
	|	Документ.РеестрПлатежей.Заявки КАК РеестрПлатежейЗаявки
	//Евросиб СубботинВ #128538 23.01.2026 Начало
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗаявкиВключенныеВРеестр КАК ЗаявкиВключенныеВРеестр
	|	ПО РеестрПлатежейЗаявки.Ссылка = ЗаявкиВключенныеВРеестр.РеестрПлатежей
	|		И РеестрПлатежейЗаявки.ЗаявкаНаОплату = ЗаявкиВключенныеВРеестр.ЗаявкаНаОплату
	|		И (НЕ ЗаявкиВключенныеВРеестр.Отключена) 
	//Евросиб СубботинВ #128538 23.01.2026 Конец
	|ГДЕ
	|	РеестрПлатежейЗаявки.Ссылка = &Ссылка
	|ИТОГИ
	|	СУММА(СуммаПлатежаРуб)
	|ПО
	|	Реестр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(РеестрПлатежейВыбранныеДаты.Дата, ДЕНЬ) КАК Дата,
	|	РеестрПлатежейВыбранныеДаты.Ссылка КАК Ссылка,
	|	РеестрПлатежейВыбранныеДаты.Ссылка.ТипРеестраПлатежей КАК ТипРеестраПлатежей,
	//Евросиб СубботинВ #128538 23.01.2026 Начало
	//|	РеестрПлатежейВыбранныеДаты.Ссылка.СуммаИтогоВРублях КАК СуммаИтогоВРублях,	
	//Евросиб СубботинВ #128538 23.01.2026 Конец
	|	ВЫРАЗИТЬ(РеестрПлатежейВыбранныеДаты.Ссылка.КомментарийИнициатора КАК СТРОКА(250)) КАК КомментарийИнициатора
	|ИЗ
	|	Документ.РеестрПлатежей.ВыбранныеДаты КАК РеестрПлатежейВыбранныеДаты
	|ГДЕ
	|	РеестрПлатежейВыбранныеДаты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	//Евросиб СубботинВ #128538 23.01.2026 Начало
	//ВыборкаДетальныеЗаписи = РезультатЗапроса[0].Выбрать();
	ВыборкаДетальныеЗаписиИтоги = РезультатЗапроса[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//Евросиб СубботинВ #128538 23.01.2026 Конец
	ВыборкаДаты = РезультатЗапроса[1].выгрузить();
	
	//Евросиб СубботинВ #128538 23.01.2026 Начало 
	ВыборкаДетальныеЗаписиИтоги.Следующий(); 
	ИтоговаяСуммаРубли =  ВыборкаДетальныеЗаписиИтоги.СуммаПлатежаРуб;
	
	//Евросиб СубботинВ #128538 23.01.2026 Конец
	
	МассивДат = Новый Массив; 
	Для Каждого СтрокаДат из ВыборкаДаты Цикл
		 МассивДат.Добавить(Формат(СтрокаДат.Дата,"ДФ=dd.MM.yyyy"));
	КонецЦикла;	 
	ДатыРеестра = СтрСоединить(МассивДат, ", ");
	
	//Евросиб СубботинВ #128538 23.01.2026 Начало
	//Тема = СтрШаблон("%4 %5 %1 на %2, сумму %3 руб.", ВыборкаДаты[0].ТипРеестраПлатежей, ДатыРеестра, ВыборкаДаты[0].СуммаИтогоВРублях, Задача.Состояние, ТипЗнч(Документ)) ; 
    Тема = СтрШаблон("%4 %5 %1 на %2, сумму %3 руб.", ВыборкаДаты[0].ТипРеестраПлатежей, ДатыРеестра, ИтоговаяСуммаРубли, Задача.Состояние, ТипЗнч(Документ)) ; 
	//ТекстПисьма = СтрШаблон("%4 %5 %1 на %2, сумму %3 руб.", ВыборкаДаты[0].ТипРеестраПлатежей, ДатыРеестра, ВыборкаДаты[0].СуммаИтогоВРублях, Задача.Состояние, ТипЗнч(Документ)) ; 
	ТекстПисьма = СтрШаблон("%4 %5 %1 на %2, сумму %3 руб.", ВыборкаДаты[0].ТипРеестраПлатежей, ДатыРеестра, ИтоговаяСуммаРубли, Задача.Состояние, ТипЗнч(Документ)) ; 
    //Евросиб СубботинВ #128538 23.01.2026 Конец

	ТекстПисьма = СформироватьТекстШапкиСообщенияВыполненияЗадачиПоРеестрам(ТекстПисьма, Задача);
	
	//Евросиб СубботинВ #128538 23.01.2026 Начало
	ВыборкаДетальныеЗаписи = ВыборкаДетальныеЗаписиИтоги.Выбрать();
	//Евросиб СубботинВ #128538 23.01.2026 Конец	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекстПисьма = ТекстПисьма + СформироватьТекстСтрокиСообщенияВыполненияЗадачиПоРеестрам(ВыборкаДетальныеЗаписи); 
	КонецЦикла;
	
	ТекстПисьма = ТекстПисьма  + "</tbody></table>";
	
	ТекстПисьма = ТекстПисьма + ?(ЗначениеЗаполнено(ВыборкаДаты[0].КомментарийИнициатора), Символы.ПС + "Комментарий инициатора: " + ВыборкаДаты[0].КомментарийИнициатора, "")
					+ Символы.ПС + Комментарий + Символы.ПС +	СсылкиОтветов.Текст;
	
КонецПроцедуры

// Евросиб US 90342 Рыбьяков К.А. 14.12.2025 ((
Процедура СформироватьТекстУведомленияРеестрСпециальныхСтавок(ТекстПисьма, Задача, Документ, Комментарий, СсылкиОтветов, Тема);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеестрСпециальныхСтавок.Дата КАК Дата,
	|	РеестрСпециальныхСтавок.Номер КАК Номер,
	|	РеестрСпециальныхСтавок.Наименование КАК Наименование,
	|	ПРЕДСТАВЛЕНИЕ(РеестрСпециальныхСтавок.Ссылка) КАК ПредставлениеСсылки,
	|	РеестрСпециальныхСтавок.НачалоДействия КАК НачалоДействия,
	|	РеестрСпециальныхСтавок.ОкончаниеДействия КАК ОкончаниеДействия,
	|	ПРЕДСТАВЛЕНИЕ(РеестрСпециальныхСтавок.Применяется) КАК ПредставлениеПрименяется,
	|	РеестрСпециальныхСтавок.ВидПеревозки.Наименование КАК ВидПеревозки,
	|	РеестрСпециальныхСтавок.НаправлениеПеревозки КАК НаправлениеПеревозки,
	|	РеестрСпециальныхСтавок.Применяется КАК Применяется
	|ИЗ
	|	Документ.РеестрСпециальныхСтавок КАК РеестрСпециальныхСтавок
	|ГДЕ
	|	РеестрСпециальныхСтавок.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	ВыгрузкаШапка = Запрос.Выполнить().Выгрузить();
	
	Тема = СтрШаблон("Согласовать %1", ВыгрузкаШапка[0].ПредставлениеСсылки);
	ТекстПисьма = "Прошу согласовать спец. ставки тарифов в отношении " + ВыгрузкаШапка[0].ПредставлениеПрименяется 
				+ " действующих на период " + Формат(ВыгрузкаШапка[0].НачалоДействия, "ДФ = дд.ММ.гггг")+ " - " 
				+ ?(ЗначениеЗаполнено(ВыгрузкаШапка[0].ОкончаниеДействия), Формат(ВыгрузкаШапка[0].ОкончаниеДействия, "ДФ = дд.ММ.гггг"), "до утверждения новых условий")
				+ ?(ЗначениеЗаполнено(ВыгрузкаШапка[0].НаправлениеПеревозки), " Направление перевозки - " + Строка(ВыгрузкаШапка[0].НаправлениеПеревозки) + ",", "")
				+ " Вид перевозки - " + ВыгрузкаШапка[0].ВидПеревозки + ", Наименование - " + ВыгрузкаШапка[0].Наименование;
				
	
	Если ТипЗнч(ВыгрузкаШапка[0].Применяется) <> Тип("ДокументСсылка.РеестрСпециальныхСтавок") Тогда
		ДобавитьВТекстПисьмаПереченьРейса(Документ, ТекстПисьма);
	КонецЕсли;
	
	ТекстПисьма = СформироватьТекстШапкиСообщенияВыполненияЗадачиПоСпецСтавкам(ТекстПисьма, Задача);
	
	ТаблицаСтавок = СформироватьТаблицу(Документ);
	
	Для Каждого СтрокаСтавок Из ТаблицаСтавок Цикл
		ТекстПисьма = ТекстПисьма + СформироватьТекстСтрокиСообщенияВыполненияЗадачиПоСпецСтавкам(СтрокаСтавок);
	КонецЦикла;
	
	ТекстПисьма = ТекстПисьма + "</tbody></table>";
	
	ТекстПисьма = ТекстПисьма + Символы.ПС + СсылкиОтветов.Текст;
	
КонецПроцедуры // Евросиб Рыбьяков К.А. 14.12.2025 ))

// Евросиб US 90342 Рыбьяков К.А. 14.12.2025 ((
Функция СформироватьТекстСтрокиСообщенияВыполненияЗадачиПоСпецСтавкам(Строка)
		 
	ТекстПисьма = Символы.ПС + "<tr>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.Контрагент + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.ПлановыйОбъемTEU + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.ТипСтавки + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.ПунктОтправления + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.ПунктНазначения + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.УсловияПеревозкиОтправление + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.УсловияПеревозкиПрибытие + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.ВалютаЖД + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.Ставка20ЖДCOC + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.Ставка20ЖДSOC + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.Ставка40ЖДCOC + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.Ставка40ЖДSOC + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.ПортОтправления + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.ПортНазначения + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.ПортОтгрузки + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.ВалютаФрахт + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.УсловияПогрузки + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.УсловияВыгрузки + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.Ставка20ФрахтCOC + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.Ставка20ФрахтSOC + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.Ставка40ФрахтCOC + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.Ставка40ФрахтSOC + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.ВалютаНадбавкиСкидкиЖД + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.НадбавкаСкидка20ЖДCOC + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.НадбавкаСкидка20ЖДSOC + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.НадбавкаСкидка40ЖДCOC + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.НадбавкаСкидка40ЖДSOC + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.ВалютаНадбавкиСкидкиФрахт + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.НадбавкаСкидка20ФрахтCOC + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.НадбавкаСкидка20ФрахтSOC + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.НадбавкаСкидка40ФрахтCOC + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.НадбавкаСкидка40ФрахтSOC + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.Калькуляции20ЖДCOC + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.Калькуляции20ЖДSOC + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.Калькуляции40ЖДCOC + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.Калькуляции40ЖДSOC + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.Калькуляции20ФрахтCOC + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.Калькуляции20ФрахтSOC + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.Калькуляции40ФрахтCOC + "</td>";
	ТекстПисьма = ТекстПисьма + "<td>" + Строка.Калькуляции40ФрахтSOC + "</td>";
	ТекстПисьма = ТекстПисьма + "</tr>";
		
	Возврат ТекстПисьма;
	
КонецФункции

// Евросиб US 90342 Рыбьяков К.А. 14.12.2025 ((
Функция СформироватьТекстШапкиСообщенияВыполненияЗадачиПоСпецСтавкам(ТекстПисьма, Задача)
	
	ТекстПисьма = ТекстПисьма + Символы.ПС +
	"<table border=""1""; style=""font-size:7pt"";>
	|<tbody><th>Контрагент</th>
	|<th>Тип ставки</th>
	|<th>План. объем, TEU</th>
	|<th>Пункт отпр. (ЖД)</th>
	|<th>Пункт назн. (ЖД)</th>
	|<th>Условия перевозки по отпр. ЖД</th>
	|<th>Условия перевозки по приб. ЖД</th>
	|<th>Валюта ставки (ЖД)</th>
	|<th>Ставка 20' (ЖД) COC</th>
	|<th>Ставка 20' (ЖД) SOC</th>
	|<th>Ставка 40' (ЖД) COC</th>
	|<th>Ставка 40' (ЖД) SOC</th>
	|<th>Порт отправления (фрахт)</th>
	|<th>Порт отгрузки (фрахт)</th>
	|<th>Порт назначения (фрахт)</th>
	|<th>Валюта (фрахт)</th>
	|<th>Условия погрузки (фрахт)</th>
	|<th>Условия выгрузки (фрахт)</th>
	|<th>Ставка 20' (фрахт) COC</th>
	|<th>Ставка 20' (фрахт) SOC</th>
	|<th>Ставка 40' (фрахт) COC</th>
	|<th>Ставка 40' (фрахт) SOC</th>
	|<th>Валюта надбавки/скидки (ЖД)</th>
	|<th>Надбавка/Скидка 20' (ЖД) COC</th>
	|<th>Надбавка/Скидка 20' (ЖД) SOC</th>
	|<th>Надбавка/Скидка 40' (ЖД) COC</th>
	|<th>Надбавка/Скидка 40' (ЖД) SOC</th>
	|<th>Валюта надбавки/скидки (фрахт)</th>
	|<th>Надбавка/Скидка 20' (фрахт) COC</th>
	|<th>Надбавка/Скидка 20' (фрахт) SOC</th>
	|<th>Надбавка/Скидка 40' (фрахт) COC</th>
	|<th>Надбавка/Скидка 40' (фрахт) SOC</th>
	|<th>Калькуляция 20' (ЖД) COC</th>
	|<th>Калькуляция 20' (ЖД) SOC</th>
	|<th>Калькуляция 40' (ЖД) COC</th>
	|<th>Калькуляция 40' (ЖД) SOC</th>
	|<th>Калькуляция 20' (фрахт) COC</th>
	|<th>Калькуляция 20' (фрахт) SOC</th>
	|<th>Калькуляция 40' (фрахт) COC</th>
	|<th>Калькуляция 40' (фрахт) SOC</th>";
	
	Возврат ТекстПисьма
	
КонецФункции 

// Евросиб US 90342 Рыбьяков К.А. 14.12.2025 ((
Процедура ДобавитьВТекстПисьмаПереченьРейса(Документ, ТекстПисьма)
	
	ТекстПисьма = ТекстПисьма + Символы.ПС + "Перечень рейсов:" + Символы.ПС ;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АВТОНОМЕРЗАПИСИ() КАК НомерСтроки,
	|	ПРЕДСТАВЛЕНИЕ(РеестрСпециальныхСтавокРейсы.Рейс) КАК Рейс
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.РеестрСпециальныхСтавок.Рейсы КАК РеестрСпециальныхСтавокРейсы
	|ГДЕ
	|	РеестрСпециальныхСтавокРейсы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.НомерСтроки КАК НомерСтроки,
	|	ВТ.Рейс КАК Рейс
	|ИЗ
	|	ВТ КАК ВТ";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
		
	Выборка = РезультатЗапроса.Выбрать();
	
	НомерСтроки = 1;
	
	Пока Выборка.Следующий() Цикл
		ТекстПисьма = ТекстПисьма + Строка(Выборка.НомерСтроки) + ". " + Выборка.Рейс + Символы.ПС;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти 
//Евросиб СубботинВ #104841 07.05.2025 Конец

