
&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	Результат = Новый Массив;
	Для каждого Стр из ТЧ Цикл
		Результат.Добавить(Новый Структура("ВремяОтправления, ВремяПрибытия, Станция", Стр.Отправление, Стр.Прибытие, Стр.Станция));
	КонецЦикла;
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьТаблицу(Команда)
	
	ТЧ.Очистить();
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаВертикальная Тогда
		
		Сч = 2;
		ПрочСтрока = ВариантВертикальный.Область("R"+Сч+"C3").Текст;
		Пока ПрочСтрока <> "" Цикл
			НСтр = ТЧ.Добавить();
			
			НСтр.Отправление = ПреобразоватьВремяВ1С(ВариантВертикальный.Область("R"+Сч+"C2").Текст);
			НСтр.Прибытие = ПреобразоватьВремяВ1С(ВариантВертикальный.Область("R"+Сч+"C1").Текст);
			НСтр.Станция = Локации_сервер.ПолучитьЛокациюПоНечеткомуПоиску(ВариантВертикальный.Область("R"+Сч+"C3").Текст);
			Попытка
				НСтр.РасстояниеДоСледующейСтанции = Число(ВариантВертикальный.Область("R"+Сч+"C4").Текст);
			Исключение
			КонецПопытки;
			
			Сч = Сч + 1;
			ПрочСтрока = ВариантВертикальный.Область("R"+Сч+"C3").Текст;
		КонецЦикла;

		
	Иначе
		
		Сч = 2;
		ПрочСтрока = ВариантГоризонтальный.Область("R1C"+Сч).Текст;
		Пока ПрочСтрока <> "" Цикл
			НСтр = ТЧ.Добавить();
			
			НСтр.Отправление = ПреобразоватьВремяВ1С(ВариантГоризонтальный.Область("R2C"+Сч).Текст);
			НСтр.Прибытие = ПреобразоватьВремяВ1С(ВариантГоризонтальный.Область("R3C"+Сч).Текст);
			НСтр.Станция = Локации_сервер.ПолучитьЛокациюПоНечеткомуПоиску(ВариантГоризонтальный.Область("R1C"+Сч).Текст);
			Попытка
				НСтр.РасстояниеДоСледующейСтанции = Число(ВариантВертикальный.Область("R4C"+Сч).Текст);
			Исключение
			КонецПопытки;
			
			Сч = Сч + 1;
			ПрочСтрока = ВариантГоризонтальный.Область("R1C"+Сч).Текст;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПреобразоватьВремяВ1С(ВремяТекстом)
	
	МРС = Новый Массив; // Массив Разрешенных Символов
	МРС.Добавить("0");МРС.Добавить("1");МРС.Добавить("2");МРС.Добавить("3");МРС.Добавить("4");МРС.Добавить("5");МРС.Добавить("6");МРС.Добавить("7");МРС.Добавить("8");МРС.Добавить("9");
	ФинСтрока = "";
	Для Сч = 1 По СтрДлина(ВремяТекстом) Цикл
		КСимвол = Сред(ВремяТекстом, Сч, 1);
		Если МРС.Найти(КСимвол) <> неопределено Тогда ФинСтрока = ФинСтрока + КСимвол; КонецЕсли;
	КонецЦикла;
	Если СтрДлина(ФинСтрока) = 3 Тогда ФинСтрока = "0"+ФинСтрока; КонецЕсли;
	
	Результат = Дата("00010101");
	Попытка
		Результат = Дата("00010101" + ФинСтрока + "00");
	Исключение
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )
