
Процедура ПередЗаписью(Отказ)
		
	Наименование = Справочники.ШкалыЦен.ПолучитьПредставлениеШкалы(Шкала);
	
	// + ДИТ Кузнецов Е.Е. 88785 13.09.2024
	РасчетНарастающегоИтога();
	// - ДИТ Кузнецов Е.Е. 88785 13.09.2024
	
КонецПроцедуры

Процедура РасчетНарастающегоИтога()
	НарастающийИтогПоПредыдущимДелениям = 0;
	КоличествоДнейПоПредыдущемуДелениюШкалы = 0;
	Для Каждого СтрокаТЧ Из Шкала Цикл
		СтрокаТЧ.НарастающийИтогПоПредыдущимДелениям = НарастающийИтогПоПредыдущимДелениям + СтрокаТЧ.Цена * КоличествоДнейПоПредыдущемуДелениюШкалы;
		НарастающийИтогПоПредыдущимДелениям = НарастающийИтогПоПредыдущимДелениям + СтрокаТЧ.НарастающийИтогПоПредыдущимДелениям;
		КоличествоДнейПоПредыдущемуДелениюШкалы = СтрокаТЧ.До - СтрокаТЧ.От;
	КонецЦикла;
КонецПроцедуры