&НаКлиенте
Процедура КомандаДобавить(Команда)
	
	Если ПроверкаДанных() Тогда ВыполнитьЗакрытие(0); КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверкаДанных()
	
	Результат = Истина;
	ТаблицаОбработанных.Очистить();
	
	Сч = 2;
	ПрочСтрока = ТаблицаEXCEL.Область("R"+Сч+"C1").Текст;
	Пока ПрочСтрока <> "" Цикл
		
		НСтр = ТаблицаОбработанных.Добавить();
		НСтр.НомерКТК = ТаблицаEXCEL.Область("R"+Сч+"C1").Текст;
		НСтр.Размер = ТаблицаEXCEL.Область("R"+Сч+"C2").Текст;
		НСтр.ИсоТип = ТаблицаEXCEL.Область("R"+Сч+"C3").Текст;
		
		Сч = Сч + 1;
		ПрочСтрока = ТаблицаEXCEL.Область("R"+Сч+"C1").Текст;
	КонецЦикла;
	
	ВсеВПорядке = Истина;
	Для каждого Стр из ТаблицаОбработанных Цикл
		
		Если РаботаСКонтейнерамиСервер.НайтиКТК(Стр.НомерКТК) = неопределено И НЕ ЗначениеЗаполнено(Стр.Размер) И НЕ ЗначениеЗаполнено(Стр.ИсоТип) Тогда
			Сообщить("Для контейнера " + Стр.номерКТК + " не указан тип и не найдена запись в программе. Требуется указать тип или размер!");
			ВсеВПорядке = ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Сч = 2;
	ПрочСтрока = ТаблицаEXCEL1.Область("R"+Сч+"C1").Текст;
	Пока ПрочСтрока <> "" Цикл
		
		НСтр = ТаблицаОбработанных.Добавить();
		НСтр.НомерВагона = ТаблицаEXCEL1.Область("R"+Сч+"C1").Текст;
		
		Сч = Сч + 1;
		ПрочСтрока = ТаблицаEXCEL1.Область("R"+Сч+"C1").Текст;
	КонецЦикла;

	Возврат ВсеВПорядке;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьЗакрытие(Поведение)
	
	СтруктураКТК = Новый Массив;
	
	Для каждого Стр из ТаблицаОбработанных Цикл
		СтруктураКТК.Добавить(Новый Структура("КТК, Тип, Размер, НомерВагона", Стр.НомерКТК, Стр.ИсоТип, Стр.Размер, Стр.НомерВагона));
	КонецЦикла;
	
	Закрыть(Новый Структура("СтруктураКТК, Поведение", СтруктураКТК, Поведение));
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПерезаполнить(Команда)
	
	Если ПроверкаДанных() Тогда ВыполнитьЗакрытие(1); КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЭтоВагоны") Тогда
		Элементы.Группа5.ТекущаяСтраница = Элементы.Группа7; 
		// ДИТ US 76619 ТА 76735 Сержантова А.С. Начало: 16.11.2023
		Элементы.ЗаполнитьПустыеСтроки.Видимость = Ложь;  
		Элементы.ЗаполнитьПустыеСтрокиРасширенный.Видимость = Ложь;  
		Элементы.КомандаДобавитьИДополнить.КнопкаПоУмолчанию = Истина;
		// ДИТ US 76619 ТА 76735 Сержантова А.С. Конец: 16.11.2023
	КонецЕсли;
	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаСервереБезКонтекста
Функция ПолучитьГрузПоЕТСНГ(ЕТСНГ)
	
	Возврат Справочники.Грузы.НайтиПоРеквизиту("ЕТСНГ", ЕТСНГ);
	
КонецФункции

Функция ПолучитьЗначениеПоВсейСтроке(сч)
	ПрочСтрока = "";
	Для Инд = 1 ПО 18 Цикл
		ПрочСтрока = ПрочСтрока + ExcelПрямыеКлиенты.Область("R"+Сч+"C" + Инд).Текст;
	КонецЦикла;
	
	Возврат ПрочСтрока; 
	
КонецФункции	

&НаСервереБезКонтекста
Функция НайтиТипТЕПоНаименованию(Размер,ТипКТК)

Рез = Справочники.ТипоразмерыТЕ.НайтиПоНаименованию(СтроковыеФункцииКлиентСервер.УдалитьПрочиеСимволыИзСтроки(Размер), Истина);

ТипКТК.Тип = Рез;
ТипКТК.Размер = Рез.РазмерКТК;

КонецФункции

&НаКлиенте
Процедура ПроверитьИПеренести(Команда)
	// ДИТ US 76619 ТА 76735 Сержантова А.С. Начало: 08.11.2023 - проверка перенесена в процедуру ПроверитьРасширенныйСписокПередПереносом
	// Было:
	//МассивРефрижераторныехТиповТЕ = ПолучитьРефрижераторныеТипыТЕ();
	//
	//Отказ = Ложь;
	//
	//Результат = Новый Массив;
	//
	//НомераСтрокЗаполненРазмерПустойКонтейнер	= Новый Массив;
	//НомераСтрокНеСоответствуетТипоразмер 		= Новый Массив;
	//НомераСтрокПустойТипВТЕИИсточнике 			= Новый Массив;
	//НомераСтрокСНарушениемФормата 				= Новый Массив;
	//
	//Сч = 3;
	//ПрочСтрока = ПолучитьЗначениеПоВсейСтроке(Сч);
	//
	//Если ПрочСтрока = "" Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Пока ПрочСтрока <> "" Цикл
	//	
	//	ВесьСписокОшибок = "";
	//	
	//	НомерКТК 			= ExcelПрямыеКлиенты.Область("R"+Сч+"C1").Текст;
	//	НомерРелиза 		= ExcelПрямыеКлиенты.Область("R"+Сч+"C2").Текст;
	//	ДатаПодачиМашины 	= ExcelПрямыеКлиенты.Область("R"+Сч+"C3").Текст;
	//	НормаПользования 	= ExcelПрямыеКлиенты.Область("R"+Сч+"C4").Текст;
	//	Размер 				= ExcelПрямыеКлиенты.Область("R"+Сч+"C5").Текст;
	//	Пломбы 				= ExcelПрямыеКлиенты.Область("R"+Сч+"C6").Текст;
	//	ФИОВодителя 		= ExcelПрямыеКлиенты.Область("R"+Сч+"C7").Текст;
	//	НомерАвто 			= ExcelПрямыеКлиенты.Область("R"+Сч+"C8").Текст;
	//	СтанцияОтпр 		= ExcelПрямыеКлиенты.Область("R"+Сч+"C9").Текст;
	//	ПунктНазн 			= ExcelПрямыеКлиенты.Область("R"+Сч+"C10").Текст;
	//	СтанцияНазн 		= ExcelПрямыеКлиенты.Область("R"+Сч+"C11").Текст;
	//	ЕТСНГ 				= ExcelПрямыеКлиенты.Область("R"+Сч+"C12").Текст;
	//	Груз 				= ?(ЗначениеЗаполнено(ЕТСНГ), ПолучитьГрузПоЕТСНГ(ЕТСНГ), неопределено);
	//	Грузополучатель 	= ExcelПрямыеКлиенты.Область("R"+Сч+"C13").Текст;
	//	КоличествоМест 		= ExcelПрямыеКлиенты.Область("R"+Сч+"C14").Текст;
	//	ВесГруза 			= ExcelПрямыеКлиенты.Область("R"+Сч+"C15").Текст;
	//	ОсобыеОтметки 		= ExcelПрямыеКлиенты.Область("R"+Сч+"C16").Текст;
	//	Инструкция 			= ExcelПрямыеКлиенты.Область("R"+Сч+"C17").Текст;
	//	НомерРеестра 		= ExcelПрямыеКлиенты.Область("R"+Сч+"C18").Текст;
	//	
	//	Груженый = Истина;
	//	УсловияПеревозкиНазначение = ПредопределенноеЗначение("Перечисление.УсловияПеревозкиКТК.CY");
	//	УсловияПеревозки = ПредопределенноеЗначение("Перечисление.УсловияПеревозкиКТК.CY");	
	//	
	//	Если НЕ ЗначениеЗаполнено(НомерКТК) И ЗначениеЗаполнено(Размер) Тогда
	//		НомерТекущейСтроки = Сч-2;
	//		НомераСтрокЗаполненРазмерПустойКонтейнер.Добавить(НомерТекущейСтроки);
	//		Отказ = Истина;
	//	КонецЕсли;
	//	
	//	НомерКТКСсылка = РаботаСКонтейнерамиСервер.НайтиКТК(НомерКТК);
	//	
	//	Если НЕ ЗначениеЗаполнено(НомерКТКСсылка) Тогда
	//		НомерКТКСсылка = ПредопределенноеЗначение("Справочник.ТЕ.ПустаяСсылка");
	//	КонецЕсли;	
	//	
	//	ТипКТК = РаботаСКонтейнерамиСервер.ПолучитьТипИРазмер(НомерКТКСсылка);
	//	
	//	Если НЕ ЗначениеЗаполнено(ТипКТК.Тип) Тогда
	//		НайтиТипТЕПоНаименованию(Размер,ТипКТК);
	//	КонецЕсли;
	//	
	//	ПустойКонтейнерИЛИТипТЕ = (НомерКТКСсылка = ПредопределенноеЗначение("Справочник.ТЕ.ПустаяСсылка") ИЛИ ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(НомерКТКСсылка,"ТипТЕ") = ПредопределенноеЗначение("Справочник.ТипоразмерыТЕ.ПустаяСсылка"));
	//	
	//	Если РефрижераторныйКТК И ПустойКонтейнерИЛИТипТЕ И СтрДлина(Размер) > 2 И МассивРефрижераторныехТиповТЕ.Найти(ТипКТК.Тип) = Неопределено Тогда
	//		Размер = ПредопределенноеЗначение("Справочник.ТипоразмерыТЕ.ПустаяСсылка");
	//		НомерТекущейСтроки = Сч-2;					
	//		Сообщить("Указанный в строке " + СокрЛП(НомерТекущейСтроки) + " тип не соответствует типу рефрижераторного контейнера. Измените/удалите тип в поле «Размер КТК» либо снимите признак «Рефрижераторный КТК».");		
	//		Отказ = Истина;
	//	КонецЕсли;
	//	
	//	Если НЕ РефрижераторныйКТК И ПустойКонтейнерИЛИТипТЕ И ЭтоРефрижераторныйКТК(Лев(НомерКТК,4)) Тогда
	//		НомерТекущейСтроки = Сч-2;					
	//		Сообщить("Возможно, контейнер " + СокрЛП(НомерКТК) + " в строке " + СокрЛП(НомерТекущейСтроки) + " является рефрижераторным. Если это так, установите признак «Рефрижераторный КТК» при добавлении этого КТК в заявку.");		
	//		Отказ = Истина;	
	//	КонецЕсли;
	//	
	//	Если НЕ ЗначениеЗаполнено(ТипКТК.Тип) И ЗначениеЗаполнено(Размер) Тогда
	//		ТипКТК = РаботаСКонтейнерамиСервер.НайтиТипПоРазмеру(Размер,РефрижераторныйКТК,НомерКТК);	
	//	КонецЕсли;	
	//	
	//	Если НЕ ЗначениеЗаполнено(ТипКТК.Тип) И ЗначениеЗаполнено(НомерКТК) Тогда
	//		Отказ = Истина;
	//	КонецЕсли;	
	//	
	//	Если ЗначениеЗаполнено(ТипКТК.Тип) И НЕ ЗначениеЗаполнено(НомерКТКСсылка) И ЗначениеЗаполнено(НомерКТК) И НЕ Отказ Тогда
	//		ЧислаМ = Новый Массив;
	//		Для ИндМ = 0 По 9 Цикл 
	//			ЧислаМ.Добавить(Строка(ИндМ)); 
	//		КонецЦикла;
	//		КонтрольныйЗнак = РаботаСКонтейнерамиСервер.ПолучитьКонтрольноеЧисло(Лев(НомерКТК,4), Сред(НомерКТК,5,6));	
	//		Если СтрДлина(НомерКТК) <> 11 
	//			ИЛИ КонтрольныйЗнак = "Неверно" ИЛИ ЧислаМ.Найти(Прав(НомерКТК,1)) = неопределено  
	//			ИЛИ (СтрДлина(НомерКТК) = 11 И НЕ Число(Прав(НомерКТК,1)) = КонтрольныйЗнак) Тогда
	//			
	//			Если НомерКТКСсылка = ПредопределенноеЗначение("Справочник.ТЕ.ПустаяСсылка") И ЗначениеЗаполнено(НомерКТК) Тогда
	//				Сообщить(НомерКТК + "Не удалось распознать номер КТК! Исправьте номер КТК в источнике");
	//				Отказ = Истина;
	//			КонецЕсли;
	//			
	//		Иначе
	//			НомерКТКСсылка = РаботаСКонтейнерамиСервер.СоздатьКТК(ВРег(НомерКТК), ТипКТК.Тип);	
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//	
	//	
	//	Если (ЗначениеЗаполнено(НомерКТКСсылка) ИЛИ ЗначениеЗаполнено(НомерКТК)) И НЕ ЗначениеЗаполнено(ТипКТК.Тип) И НЕ ЗначениеЗаполнено(Размер) Тогда
	//		НомерТекущейСтроки = Сч-2;
	//		НомераСтрокПустойТипВТЕИИсточнике.Добавить(НомерТекущейСтроки);
	//		Отказ = Истина;
	//	КонецЕсли;
	//	
	//	ДатаВ1С_ПодачаМашины = ЗагрузкаВнешнихИсточников_сервер.ПреобразоватьДатуВ1С(ДатаПодачиМашины, 5);
	//	ДатаВ1С = Дата(1,1,1);
	//	Если ЗначениеЗаполнено(ДатаВ1С_ПодачаМашины) Тогда
	//		ДатаВ1С = ДатаВ1С_ПодачаМашины - 24*3600;
	//	КонецЕсли;
	//	
	//	СтанцияОтпрСсылка = Локации_сервер.ПолучитьЛокациюПоНечеткомуПоиску(СтанцияОтпр);		
	//	ПунктНазнСсылка = Локации_сервер.ПолучитьЛокациюПоНечеткомуПоиску(ПунктНазн, Истина);
	//	СтанцияНазнСсылка = Локации_сервер.ПолучитьЛокациюПоНечеткомуПоиску(СтанцияНазн);
	//	ГрузополучательСсылка = КонтрагентыДоговоры_сервер.НайтиКонтрагентаПоНечеткомуУсловию(Грузополучатель);
	//	Если НЕ ЗначениеЗаполнено(ГрузополучательСсылка) Тогда
	//		ВесьСписокОшибок = ВесьСписокОшибок + "Контрагент не найден: " + Грузополучатель + Символы.ПС;
	//	КонецЕсли;
	//	
	//	Если НЕ РефрижераторныйКТК И ЗначениеЗаполнено(НомерКТКСсылка) И ЗначениеЗаполнено(ТипКТК.Тип) Тогда					
	//		ТипТЕИзКарточкиКонтейнера = РаботаСКонтейнерамиСервер.ПолучитьТипТЕ(НомерКТКСсылка);
	//		Если ТипТЕИзКарточкиКонтейнера <> Неопределено Тогда
	//			ТипКТК.Тип = ТипТЕИзКарточкиКонтейнера.ТипТЕ;
	//			ТипКТК.Размер = ТипТЕИзКарточкиКонтейнера.Размер; 
	//			ВведенРазмер = СтрДлина(Размер) = 2;
	//			ВведенТипоРаземер = СтрДлина(Размер) > 2;					
	//			Если (ВведенРазмер И Число(Размер) <> ТипТЕИзКарточкиКонтейнера.РазмерКТКЧисло)  ИЛИ (ВведенТипоРаземер И Размер <> ТипТЕИзКарточкиКонтейнера.ТипТЕНаименование) Тогда
	//				НомерТекущейСтроки = Сч-2;
	//				НомераСтрокНеСоответствуетТипоразмер.Добавить(НомерТекущейСтроки);					
	//			КонецЕсли;						
	//		КонецЕсли;					
	//	КонецЕсли;
	//	
	//	Если РефрижераторныйКТК И ЗначениеЗаполнено(НомерКТКСсылка) И ЗначениеЗаполнено(ТипКТК.Тип) Тогда				
	//		ТипТЕИзКТК = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(НомерКТКСсылка,"ТипТЕ");	
	//		Если ТипТЕИзКТК <> ПредопределенноеЗначение("Справочник.ТипоразмерыТЕ.ПустаяСсылка") Тогда
	//			Если НЕ ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ТипТЕИзКТК,"Рефрижераторный") Тогда
	//				НомерТекущейСтроки = Сч-2;
	//				НомераСтрокНеСоответствуетТипоразмер.Добавить(НомерТекущейСтроки);			
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;	
	//	
	//	//ДИТ Шевченко А.В. 60130 15.11.22 //Убрал из структуры принадлежность КТК, добавил ВесНетто
	//	СтруктураДляРезультатаИПроверки = Новый Структура("НомерКТК,ТипКТК,Пломбы,ФИОВодителя,СтанцияОтправления,СтанцияНазначения,ПунктНазначения,Грузополучатель,КоличествоМест,ОсобыеОтметки,ИнструкцииПоСдачеПорожнего,ДатаПодачиАвтоПодПогрузку,РазмерКТК,НормативноеИспользование,УсловияПеревозки,УсловияПеревозкиНазначение,Груженый,НомерАвто,КодГруза,Груз,ДатаПодачиАвтоПодПогрузку,РеестрКлиента,НомерРелиза,ВесГрузаНетто",
	//	НомерКТКСсылка, ТипКТК.Тип, Пломбы, ФИОВодителя, СтанцияОтпрСсылка, СтанцияНазнСсылка, ПунктНазнСсылка, ГрузополучательСсылка, КоличествоМест, ОсобыеОтметки, Инструкция, ДатаВ1С, ТипКТК.Размер, НормаПользования, УсловияПеревозки, УсловияПеревозкиНазначение, Груженый, НомерАвто, ЕТСНГ, Груз, ДатаВ1С_ПодачаМашины, НомерРеестра, НомерРелиза, ВесГруза);
	//		
	//	Нарушение = ПроверитьФорматВВеденныхДанных(СтруктураДляРезультатаИПроверки,Сч-2);
	//	Если НЕ Нарушение Тогда
	//		Результат.Добавить(СтруктураДляРезультатаИПроверки);
	//	Иначе
	//		НомераСтрокСНарушениемФормата.Добавить(Сч-2);
	//	КонецЕсли;	
	//
	//	Сч = Сч + 1;
	//	ПрочСтрока = ПолучитьЗначениеПоВсейСтроке(Сч);
	//КонецЦикла;
	//
	//Если НомераСтрокЗаполненРазмерПустойКонтейнер.Количество() > 0 Тогда
	//	Сообщить(СтрШаблон("Не заполнен номер контейнера для указанного размера КТК в строке %1",СтрСоединить(НомераСтрокЗаполненРазмерПустойКонтейнер,",")));	
	//КонецЕсли;
	//
	//Если НомераСтрокПустойТипВТЕИИсточнике.Количество() > 0 Тогда
	//	Сообщить(СтрШаблон("Не заполнен размер контейнера в строке %1",СтрСоединить(НомераСтрокПустойТипВТЕИИсточнике,",")));
	//КонецЕсли;	
	//
	//Если Отказ Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Если НомераСтрокНеСоответствуетТипоразмер.Количество() > 0 Тогда
	//	Структура = Новый Структура("Отказ,НомераСтрокСНарушениемФормата,Результат",Отказ,НомераСтрокСНарушениемФормата,Результат);
	//	ОпОп = Новый ОписаниеОповещения("ОбработкаВопросаЗакрытияНеСоответствуетТипоразмер", ЭтаФорма, Структура);
	//	Если НЕ РефрижераторныйКТК Тогда
	//		СообщениеВопроса = СтрШаблон("Введенные данные о типоразмере контейнера в строке %1 не соответствуют имеющимся в карточке контейнера. Будет перенесен типоразмер из карточки КТК.",СтрСоединить(НомераСтрокНеСоответствуетТипоразмер,","));
	//	Иначе
	//		СообщениеВопроса = СтрШаблон("Установленный признак Рефрижераторный КТК не соответствует типоразмеру из карточки КТК в строке %1. Будет перенесен типоразмер из карточки КТК.",СтрСоединить(НомераСтрокНеСоответствуетТипоразмер,","));
	//	КонецЕсли;
	//	СписокКнопок = Новый СписокЗначений;
	//	СписокКнопок.Добавить(КодВозвратаДиалога.Да,"Продолжить");
	//	СписокКнопок.Добавить(КодВозвратаДиалога.Нет,"Отмена");
	//	ПоказатьВопрос(ОпОп, СообщениеВопроса,СписокКнопок);
	//	Возврат;
	//КонецЕсли;	 
	//Стало:
	Отказ = Ложь;
	РезультатПроверки = ПроверитьРасширенныйСписокПередПереносом(Отказ, 3);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;  
	НомераСтрокСНарушениемФормата = РезультатПроверки.НомераСтрокСНарушениемФормата;
	Результат = РезультатПроверки.Результат;
	// ДИТ US 76619 ТА 76735 Сержантова А.С. Конец: 08.11.2023
	
	Если ЗначениеЗаполнено(НомераСтрокСНарушениемФормата) Тогда
		ЗадатьВопросОбОшибкахВСтроках(НомераСтрокСНарушениемФормата,Результат, 3);
	Иначе
		// ДИТ US 76619 ТА 76735 Сержантова А.С. Начало: 08.11.2023 - добавлено ПоведениеПриЗаполнении "3"
		// Было:
		//ОбработкаВопросаЗакрытия(КодВозвратаДиалога.Да, Результат);   
		// Стало:     
		РезультатПроверки.Вставить("ПоведениеПриЗаполнении", 3);
		ОбработкаВопросаЗакрытия(КодВозвратаДиалога.Да, РезультатПроверки);
		// ДИТ US 76619 ТА 76735 Сержантова А.С. Конец: 08.11.2023	
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьФорматВВеденныхДанных(СтруктураДляРезультатаИПроверки,сч)
	
	Нарушение = Ложь;
	НаименованиеПолейСНарушениями = Новый Массив;
	
	
	Если ЗначениеЗаполнено(СтруктураДляРезультатаИПроверки.КоличествоМест) Тогда
		Попытка
			Знч = Число(СтруктураДляРезультатаИПроверки.КоличествоМест);
			Если НЕ СтруктураДляРезультатаИПроверки.КоличествоМест = Формат(Знч,"ЧЦ=10; ЧДЦ=0; ЧГ=0") Тогда
				Нарушение = Истина;
				НаименованиеПолейСНарушениями.Добавить("Количество мест");
			КонецЕсли;	
		Исключение
			Нарушение = Истина;
			НаименованиеПолейСНарушениями.Добавить("Количество мест");			
		КонецПопытки;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураДляРезультатаИПроверки.НормативноеИспользование) Тогда
		Попытка
			Знч = Число(СтруктураДляРезультатаИПроверки.НормативноеИспользование);
			Если НЕ СтруктураДляРезультатаИПроверки.НормативноеИспользование = Формат(Знч,"ЧЦ=3; ЧДЦ=0; ЧГ=0") Тогда
				Нарушение = Истина;
				НаименованиеПолейСНарушениями.Добавить("Норма исп., дней");
			КонецЕсли;	
		Исключение
			Нарушение = Истина;
			НаименованиеПолейСНарушениями.Добавить("Норма исп., дней");
		КонецПопытки;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураДляРезультатаИПроверки.ВесГрузаНетто) Тогда
		Попытка
			Знч = Число(СтруктураДляРезультатаИПроверки.ВесГрузаНетто);			
			Если Знч > 9999999.999 Тогда
				Нарушение = Истина;
				НаименованиеПолейСНарушениями.Добавить("Вес груза нетто, кг");
			КонецЕсли;	
			Если Знч < 0 Тогда
				Нарушение = Истина;
				НаименованиеПолейСНарушениями.Добавить("Вес груза нетто, кг");
			КонецЕсли;		
		Исключение
			Нарушение = Истина;
			НаименованиеПолейСНарушениями.Добавить("Вес груза нетто, кг");
		КонецПопытки;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураДляРезультатаИПроверки.НомерАвто) Тогда	
		Если СтрДлина(СтруктураДляРезультатаИПроверки.НомерАвто) > 20 Тогда
			Нарушение = Истина;
			НаименованиеПолейСНарушениями.Добавить("Номер авто на погрузке");
	    КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураДляРезультатаИПроверки.ФИОВодителя) Тогда	
		Если СтрДлина(СтруктураДляРезультатаИПроверки.ФИОВодителя) > 150 Тогда
			Нарушение = Истина;
			НаименованиеПолейСНарушениями.Добавить("ФИО водителя на погрузке");
		КонецЕсли;
		Если НЕ СтроковыеФункцииКлиентСерверРФ.ТолькоКириллицаВСтроке(СтруктураДляРезультатаИПроверки.ФИОВодителя,," .") Тогда
			Нарушение = Истина;
			НаименованиеПолейСНарушениями.Добавить("ФИО водителя на погрузке");
		КонецЕсли;	
	КонецЕсли;
	
	Для Каждого ЗнчМс Из НаименованиеПолейСНарушениями Цикл
		Сообщить("Несоответствие формата введенных данных в поле "+ЗнчМс+" в строке " + сч);
	КонецЦикла;
	
	Возврат Нарушение;
	
КонецФункции	

&НаКлиенте
Функция ЭтоРефрижераторныйКТК(Префикс) 
	
	МассивПерификсов = Новый Массив;
	
	МассивПерификсов.Добавить("YMLU");
	МассивПерификсов.Добавить("KKFU");
	МассивПерификсов.Добавить("AKLU"); 
	МассивПерификсов.Добавить("EISU");
	МассивПерификсов.Добавить("CBMU");
	МассивПерификсов.Добавить("LCLU");
	МассивПерификсов.Добавить("BTCU");
	МассивПерификсов.Добавить("NSRU");
	МассивПерификсов.Добавить("KZEU");
	МассивПерификсов.Добавить("RFUU");
	МассивПерификсов.Добавить("IRSU");
	МассивПерификсов.Добавить("SEBU");
	МассивПерификсов.Добавить("IIIU");
	МассивПерификсов.Добавить("YMLU");
	МассивПерификсов.Добавить("MORU");
	МассивПерификсов.Добавить("TTSU");
	МассивПерификсов.Добавить("GCEU");
	МассивПерификсов.Добавить("VEZU");
	МассивПерификсов.Добавить("FRIU");
	МассивПерификсов.Добавить("CRLU");
	МассивПерификсов.Добавить("MWCU");
	МассивПерификсов.Добавить("MSWU");
	МассивПерификсов.Добавить("MMAU");
	МассивПерификсов.Добавить("RSVU");
	МассивПерификсов.Добавить("RRSU");
	МассивПерификсов.Добавить("MNBU");
	МассивПерификсов.Добавить("APRU");
	МассивПерификсов.Добавить("TTUU");
	МассивПерификсов.Добавить("AVGU");
	МассивПерификсов.Добавить("NARU");
	МассивПерификсов.Добавить("SSUU");
	МассивПерификсов.Добавить("SSSU");
	МассивПерификсов.Добавить("MPBU");
	МассивПерификсов.Добавить("MCUU");
	МассивПерификсов.Добавить("MNFU");
	
	Если МассивПерификсов.Найти(Префикс) <> Неопределено Тогда
		Возврат Истина
	Иначе
		Возврат Ложь
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВопросаЗакрытияНеСоответствуетТипоразмер(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = КодВозвратаДиалога.Да Тогда
		Если Параметр2.НомераСтрокСНарушениемФормата.Количество() > 0 Тогда
			ЗадатьВопросОбОшибкахВСтроках(Параметр2.НомераСтрокСНарушениемФормата,Параметр2.Результат,Параметр2.ПоведениеПриЗаполнении);
		Иначе
			ВыполнитьЗакрытиеРасширенный(Параметр2.Результат, Параметр2.ПоведениеПриЗаполнении);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросОбОшибкахВСтроках(НомераСтрокСНарушениемФормата,Результат, ПоведениеПриЗаполнении)
	
	// ДИТ US 76619 ТА 76735 Сержантова А.С. Начало: 08.11.2023 - добавлено ПоведениеПриЗаполнении
	// Было:
	//ОпОп = Новый ОписаниеОповещения("ОбработкаВопросаЗакрытия", ЭтаФорма, Результат); 
	// Стало:
	Параметры = Новый Структура("Результат, ПоведениеПриЗаполнении", Результат, ПоведениеПриЗаполнении); 
	ОпОп = Новый ОписаниеОповещения("ОбработкаВопросаЗакрытия", ЭтаФорма, Параметры);	
	// ДИТ US 76619 ТА 76735 Сержантова А.С. Конец: 08.11.2023
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить(КодВозвратаДиалога.Да,"Перенести строки без ошибок");
		СписокКнопок.Добавить(КодВозвратаДиалога.Нет,"Отмена");
		ПоказатьВопрос(ОпОп, СтрШаблон("При чтении данных обнаружены ошибки в строке %1",СтрСоединить(НомераСтрокСНарушениемФормата,",")), СписокКнопок,,,"Перенести строки без ошибок ?");
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаВопросаЗакрытия(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = КодВозвратаДиалога.Да Тогда
			
		// ДИТ US 76619 ТА 76735 Сержантова А.С. Начало: 08.11.2023 - добавлено ПоведениеПриЗаполнении
		// Было:	
		//ВыполнитьЗакрытиеРасширенный(Параметр2);
		// Стало:
		ВыполнитьЗакрытиеРасширенный(Параметр2.Результат, Параметр2.ПоведениеПриЗаполнении);
		// ДИТ US 76619 ТА 76735 Сержантова А.С. Конец: 08.11.2023
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗакрытиеРасширенный(Параметр2, ПоведениеПриЗаполнении) // ДИТ US 76619 ТА 76735 Сержантова А.С. 08.11.2023 - добавлено ПоведениеПриЗаполнении
	Для Каждого ЗнчМассив Из Параметр2 Цикл
		ЗаписатьТипТЕВКТК(ЗнчМассив.НомерКТК,ЗнчМассив.ТипКТК);
	КонецЦикла;
	Закрыть(Новый Структура("СтруктураКТК, Поведение", Параметр2, ПоведениеПриЗаполнении));
КонецПроцедуры

&НаСервереБезКонтекста 
Процедура ЗаписатьТипТЕВКТК(НомерКТК,ТипКТК)
	Если ЗначениеЗаполнено(НомерКТК) Тогда
		Если НЕ ЗначениеЗаполнено(НомерКТК.ТипТЕ) Тогда 
			КТК = НомерКТК.ПолучитьОбъект();
			КТК.ТипТЕ = ТипКТК;
			КТК.Записать();
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ЭТРАН_Найти(Команда)
	
	ТаблицаЭТРАН.Очистить();
	ЭТРАН_Найти_Сервер();
	
КонецПроцедуры

&НаСервере
Процедура ЭТРАН_Найти_Сервер()
	
	МассивАналоговОтправления = Локации_сервер.ПолучитьАналогиИСтанцииБлижеЧемУказано(СтанцияОтправления, -1);
	МассивАналоговОтправления.Добавить(СтанцияОтправления);
	МассивАналоговНазначения = Новый Массив;
	Если ЗначениеЗаполнено(СтанцияНазначения) Тогда
		МассивАналоговНазначения = Локации_сервер.ПолучитьАналогиИСтанцииБлижеЧемУказано(СтанцияНазначения, -1);
		МассивАналоговНазначения.Добавить(СтанцияНазначения);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	э_НакладнаяКонтейнеры.НомерКонтейнера КАК НомерКонтейнера,
	               |	э_НакладнаяКонтейнеры.Ссылка КАК Накладная,
	               |	э_НакладнаяКонтейнеры.Ссылка.ЗаявкаГУ12 КАК ЗаявкаГУ12,
	               |	э_НакладнаяКонтейнеры.Ссылка.СтанцияОтправленияКод КАК СтанцияОтправленияКод,
	               |	э_НакладнаяКонтейнеры.Ссылка.СтанцияНазначенияКод КАК СтанцияНазначенияКод,
	               |	э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяРаскредитованияГруза КАК ДатаРаскредитации,
	               |	э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяПрибытияГруза КАК ДатаПрибытия,
	               |	э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяОтправленияГруза КАК ДатаОтправления,
	               |	э_НакладнаяКонтейнеры.Ссылка.НакладнаяНомер КАК НакладнаяНомер,
	               |	э_НакладнаяКонтейнеры.Ссылка.ИсточникНакладной КАК ИсточникНакладной,
	               |	э_НакладнаяВагоны.НомерВагона КАК Вагон,
	               |	э_НакладнаяКонтейнеры.Ссылка.ТекущееСостояниеНакладной КАК ТекущееСостояниеНакладной,
	               |	ТЕ.Ссылка КАК КТК,
	               |	ЛокОтправления.Ссылка КАК СтанцияОтправления,
	               |	ЛокПрибытия.Ссылка КАК СтанцияНазначения
	               |ИЗ
	               |	Документ.э_Накладная.Контейнеры КАК э_НакладнаяКонтейнеры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.э_Накладная.Вагоны КАК э_НакладнаяВагоны
	               |		ПО э_НакладнаяКонтейнеры.Ссылка = э_НакладнаяВагоны.Ссылка
	               |			И (э_НакладнаяКонтейнеры.НомерВагонаДляКонтейнерногоПоезда = э_НакладнаяВагоны.ПорядковыйНомерВагонаВОтправке
	               |				ИЛИ э_НакладнаяКонтейнеры.НомерВагонаДляКонтейнерногоПоезда = 0)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
	               |		ПО э_НакладнаяКонтейнеры.НомерКонтейнера = ТЕ.Наименование
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Локации КАК ЛокОтправления
	               |		ПО э_НакладнаяКонтейнеры.Ссылка.СтанцияОтправленияКод = ЛокОтправления.КодЖДСтанции
	               |			И (НЕ ЛокОтправления.ПометкаУдаления)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Локации КАК ЛокПрибытия
	               |		ПО э_НакладнаяКонтейнеры.Ссылка.СтанцияНазначенияКод = ЛокПрибытия.КодЖДСтанции
	               |			И (НЕ ЛокПрибытия.ПометкаУдаления)
	               |ГДЕ
	               |	НЕ э_НакладнаяКонтейнеры.Ссылка.ПометкаУдаления
	               |	И ЛокОтправления.Ссылка В(&СписокЛокацийОтправления)
	               |	И (ЛокПрибытия.Ссылка В (&СписокЛокацийПрибытия)
	               |			ИЛИ &СписокЛокацийПрибытияПуст)
	               |	И э_НакладнаяКонтейнеры.Ссылка.ДатаИВремяПринятияГрузаКПеревозке МЕЖДУ &Дата1 И &Дата2
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	э_НакладнаяКонтейнеры.Ссылка.Дата";
	
	Запрос.УстановитьПараметр("Дата1", ЭТРАН_НачалоПериода);
	Запрос.УстановитьПараметр("Дата2", ЭТРАН_КонецПериода);
	Запрос.УстановитьПараметр("СписокЛокацийОтправления", МассивАналоговОтправления);
	Запрос.УстановитьПараметр("СписокЛокацийПрибытия", МассивАналоговНазначения);
	Запрос.УстановитьПараметр("СписокЛокацийПрибытияПуст", НЕ ЗначениеЗаполнено(СтанцияНазначения));
	
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		НСтр = ТаблицаЭТРАН.Добавить();
		ЗаполнитьЗначенияСвойств(НСтр, Ответ);
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ExcelПрямыеКлиентыПриИзмененииСодержимогоОбласти(Элемент, Область)
	ЧислаМ = Новый Массив;
	Для Сч = 0 По 9 Цикл ЧислаМ.Добавить(Строка(Сч)); КонецЦикла;
	
	СохраненныйБелый = ExcelПрямыеКлиенты.Область("R3C50").ЦветФона;
	
	Для Сч = 3 По ExcelПрямыеКлиенты.ВысотаТаблицы Цикл
		ПрочСтрока = ExcelПрямыеКлиенты.Область("R"+Формат(Сч, "ЧГ=0")+"C1").Текст;
		КонтрольныйЗнак = Неопределено;
		Если СтрДлина(ПрочСтрока) = 11 Тогда
			КонтрольныйЗнак = РаботаСКонтейнерамиСервер.ПолучитьКонтрольноеЧисло(Лев(ПрочСтрока,4), Сред(ПрочСтрока,5,6));
		КонецЕсли;
		Если ЗначениеЗаполнено(ПрочСтрока) И (СтрДлина(ПрочСтрока) <> 11 //////   \/ добавил вот это 
			ИЛИ КонтрольныйЗнак = "Неверно" ИЛИ ЧислаМ.Найти(Прав(ПрочСтрока,1)) = неопределено  
			ИЛИ (СтрДлина(ПрочСтрока) = 11 И НЕ Число(Прав(ПрочСтрока,1)) = КонтрольныйЗнак)) Тогда
			ExcelПрямыеКлиенты.Область("R"+Формат(Сч, "ЧГ=0")+"C1").ЦветФона = WebЦвета.Розовый;
		Иначе
			ExcelПрямыеКлиенты.Область("R"+Формат(Сч, "ЧГ=0")+"C1").ЦветФона = СохраненныйБелый;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТипТЕ(ПрочитаннаяСсылка)
	
	Результат = Новый Структура;	
	Если ЗначениеЗаполнено(ПрочитаннаяСсылка.ТипТЕ) Тогда
		Результат.Вставить("СсылкаТипТЕ", ПрочитаннаяСсылка.ТипТЕ);
		Результат.Вставить("СсылкаРазмер", ПрочитаннаяСсылка.ТипТЕ.РазмерКТК);
		Результат.Вставить("Размер", Лев(ПрочитаннаяСсылка.ТипТЕ.Наименование,2)); 
		Результат.Вставить("ТипТЕ", ПрочитаннаяСсылка.ТипТЕ.Наименование);
		Возврат Результат; 
	Иначе
		Возврат Неопределено; 	
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРефрижераторныеТипыТЕ()	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТипоразмерыТЕ.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТипоразмерыТЕ КАК ТипоразмерыТЕ
		|ГДЕ
		|	ТипоразмерыТЕ.Рефрижераторный
		|	И НЕ ТипоразмерыТЕ.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");	
КонецФункции

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  

// ДИТ US 76619 ТА 76735 Сержантова А.С. 07.11.2023
&НаКлиенте
Процедура ЗаполнитьПустыеСтроки(Команда)
	Если ПроверкаДанных() Тогда ВыполнитьЗакрытие(4); КонецЕсли;
КонецПроцедуры

// ДИТ US 76619 ТА 76735 Сержантова А.С. 08.11.2023
&НаКлиенте
Процедура ЗаполнитьПустыеСтрокиРасширенный(Команда)
	
	Отказ = Ложь;
	РезультатПроверки = ПроверитьРасширенныйСписокПередПереносом(Отказ, 4);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(РезультатПроверки.НомераСтрокСНарушениемФормата) Тогда
		ЗадатьВопросОбОшибкахВСтроках(РезультатПроверки.НомераСтрокСНарушениемФормата,РезультатПроверки.Результат, 4);
	Иначе    
		РезультатПроверки.Вставить("ПоведениеПриЗаполнении", 4);
		ОбработкаВопросаЗакрытия(КодВозвратаДиалога.Да, РезультатПроверки);
	КонецЕсли;
	
КонецПроцедуры  

// ДИТ US 76619 ТА 76735 Сержантова А.С. 08.11.2023 - перенесено из команды ПроверитьИПеренести 
&НаКлиенте
Функция ПроверитьРасширенныйСписокПередПереносом(Отказ, ПоведениеПриЗаполнении)
	
	Ответ = Новый Структура("Результат, НомераСтрокСНарушениемФормата");
	
	МассивРефрижераторныехТиповТЕ = ПолучитьРефрижераторныеТипыТЕ();
	
	Результат = Новый Массив;
	
	НомераСтрокЗаполненРазмерПустойКонтейнер	= Новый Массив;
	НомераСтрокНеСоответствуетТипоразмер 		= Новый Массив;
	НомераСтрокПустойТипВТЕИИсточнике 			= Новый Массив;
	НомераСтрокСНарушениемФормата 				= Новый Массив;
	
	Сч = 3;
	ПрочСтрока = ПолучитьЗначениеПоВсейСтроке(Сч);
	
	Если ПрочСтрока = "" Тогда
		Отказ = Истина;
		Возврат Ответ;
	КонецЕсли;
	
	Пока ПрочСтрока <> "" Цикл
		
		ВесьСписокОшибок = "";
		
		НомерКТК 			= ExcelПрямыеКлиенты.Область("R"+Сч+"C1").Текст;
		НомерРелиза 		= ExcelПрямыеКлиенты.Область("R"+Сч+"C2").Текст;
		ДатаПодачиМашины 	= ExcelПрямыеКлиенты.Область("R"+Сч+"C3").Текст;
		НормаПользования 	= ExcelПрямыеКлиенты.Область("R"+Сч+"C4").Текст;
		Размер 				= ExcelПрямыеКлиенты.Область("R"+Сч+"C5").Текст;
		Пломбы 				= ExcelПрямыеКлиенты.Область("R"+Сч+"C6").Текст;
		ФИОВодителя 		= ExcelПрямыеКлиенты.Область("R"+Сч+"C7").Текст;
		НомерАвто 			= ExcelПрямыеКлиенты.Область("R"+Сч+"C8").Текст;
		СтанцияОтпр 		= ExcelПрямыеКлиенты.Область("R"+Сч+"C9").Текст;
		ПунктНазн 			= ExcelПрямыеКлиенты.Область("R"+Сч+"C10").Текст;
		СтанцияНазн 		= ExcelПрямыеКлиенты.Область("R"+Сч+"C11").Текст;
		ЕТСНГ 				= ExcelПрямыеКлиенты.Область("R"+Сч+"C12").Текст;
		Груз 				= ?(ЗначениеЗаполнено(ЕТСНГ), ПолучитьГрузПоЕТСНГ(ЕТСНГ), неопределено);
		Грузополучатель 	= ExcelПрямыеКлиенты.Область("R"+Сч+"C13").Текст;
		КоличествоМест 		= ExcelПрямыеКлиенты.Область("R"+Сч+"C14").Текст;
		ВесГруза 			= ExcelПрямыеКлиенты.Область("R"+Сч+"C15").Текст;
		ОсобыеОтметки 		= ExcelПрямыеКлиенты.Область("R"+Сч+"C16").Текст;
		Инструкция 			= ExcelПрямыеКлиенты.Область("R"+Сч+"C17").Текст;
		НомерРеестра 		= ExcelПрямыеКлиенты.Область("R"+Сч+"C18").Текст;
		
		Груженый = Истина;
		УсловияПеревозкиНазначение = ПредопределенноеЗначение("Перечисление.УсловияПеревозкиКТК.CY");
		УсловияПеревозки = ПредопределенноеЗначение("Перечисление.УсловияПеревозкиКТК.CY");	
		
		Если НЕ ЗначениеЗаполнено(НомерКТК) И ЗначениеЗаполнено(Размер) Тогда
			НомерТекущейСтроки = Сч-2;
			НомераСтрокЗаполненРазмерПустойКонтейнер.Добавить(НомерТекущейСтроки);
			Отказ = Истина;
		КонецЕсли;
		
		НомерКТКСсылка = РаботаСКонтейнерамиСервер.НайтиКТК(НомерКТК);
		
		Если НЕ ЗначениеЗаполнено(НомерКТКСсылка) Тогда
			НомерКТКСсылка = ПредопределенноеЗначение("Справочник.ТЕ.ПустаяСсылка");
		КонецЕсли;	
		
		ТипКТК = РаботаСКонтейнерамиСервер.ПолучитьТипИРазмер(НомерКТКСсылка);
		
		Если НЕ ЗначениеЗаполнено(ТипКТК.Тип) Тогда
			НайтиТипТЕПоНаименованию(Размер,ТипКТК);
		КонецЕсли;
		
		ПустойКонтейнерИЛИТипТЕ = (НомерКТКСсылка = ПредопределенноеЗначение("Справочник.ТЕ.ПустаяСсылка") ИЛИ ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(НомерКТКСсылка,"ТипТЕ") = ПредопределенноеЗначение("Справочник.ТипоразмерыТЕ.ПустаяСсылка"));
		
		Если РефрижераторныйКТК И ПустойКонтейнерИЛИТипТЕ И СтрДлина(Размер) > 2 И МассивРефрижераторныехТиповТЕ.Найти(ТипКТК.Тип) = Неопределено Тогда
			Размер = ПредопределенноеЗначение("Справочник.ТипоразмерыТЕ.ПустаяСсылка");
			НомерТекущейСтроки = Сч-2;					
			Сообщить("Указанный в строке " + СокрЛП(НомерТекущейСтроки) + " тип не соответствует типу рефрижераторного контейнера. Измените/удалите тип в поле «Размер КТК» либо снимите признак «Рефрижераторный КТК».");		
			Отказ = Истина;
		КонецЕсли;
		
		Если НЕ РефрижераторныйКТК И ПустойКонтейнерИЛИТипТЕ И ЭтоРефрижераторныйКТК(Лев(НомерКТК,4)) Тогда
			НомерТекущейСтроки = Сч-2;					
			Сообщить("Возможно, контейнер " + СокрЛП(НомерКТК) + " в строке " + СокрЛП(НомерТекущейСтроки) + " является рефрижераторным. Если это так, установите признак «Рефрижераторный КТК» при добавлении этого КТК в заявку.");		
			Отказ = Истина;	
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТипКТК.Тип) И ЗначениеЗаполнено(Размер) Тогда
			ТипКТК = РаботаСКонтейнерамиСервер.НайтиТипПоРазмеру(Размер,РефрижераторныйКТК,НомерКТК);	
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(ТипКТК.Тип) И ЗначениеЗаполнено(НомерКТК) Тогда
			Отказ = Истина;
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ТипКТК.Тип) И НЕ ЗначениеЗаполнено(НомерКТКСсылка) И ЗначениеЗаполнено(НомерКТК) И НЕ Отказ Тогда
			ЧислаМ = Новый Массив;
			Для ИндМ = 0 По 9 Цикл 
				ЧислаМ.Добавить(Строка(ИндМ)); 
			КонецЦикла;
			КонтрольныйЗнак = РаботаСКонтейнерамиСервер.ПолучитьКонтрольноеЧисло(Лев(НомерКТК,4), Сред(НомерКТК,5,6));	
			Если СтрДлина(НомерКТК) <> 11 
				ИЛИ КонтрольныйЗнак = "Неверно" ИЛИ ЧислаМ.Найти(Прав(НомерКТК,1)) = неопределено  
				ИЛИ (СтрДлина(НомерКТК) = 11 И НЕ Число(Прав(НомерКТК,1)) = КонтрольныйЗнак) Тогда
				
				Если НомерКТКСсылка = ПредопределенноеЗначение("Справочник.ТЕ.ПустаяСсылка") И ЗначениеЗаполнено(НомерКТК) Тогда
					Сообщить(НомерКТК + "Не удалось распознать номер КТК! Исправьте номер КТК в источнике");
					Отказ = Истина;
				КонецЕсли;
				
			Иначе
				НомерКТКСсылка = РаботаСКонтейнерамиСервер.СоздатьКТК(ВРег(НомерКТК), ТипКТК.Тип);	
			КонецЕсли;
		КонецЕсли;
		
		
		
		Если (ЗначениеЗаполнено(НомерКТКСсылка) ИЛИ ЗначениеЗаполнено(НомерКТК)) И НЕ ЗначениеЗаполнено(ТипКТК.Тип) И НЕ ЗначениеЗаполнено(Размер) Тогда
			НомерТекущейСтроки = Сч-2;
			НомераСтрокПустойТипВТЕИИсточнике.Добавить(НомерТекущейСтроки);
			Отказ = Истина;
		КонецЕсли;
		
		ДатаВ1С_ПодачаМашины = ЗагрузкаВнешнихИсточников_сервер.ПреобразоватьДатуВ1С(ДатаПодачиМашины, 5);
		ДатаВ1С = Дата(1,1,1);
		Если ЗначениеЗаполнено(ДатаВ1С_ПодачаМашины) Тогда
			ДатаВ1С = ДатаВ1С_ПодачаМашины - 24*3600;
		КонецЕсли;
		
		СтанцияОтпрСсылка = Локации_сервер.ПолучитьЛокациюПоНечеткомуПоиску(СтанцияОтпр);		
		ПунктНазнСсылка = Локации_сервер.ПолучитьЛокациюПоНечеткомуПоиску(ПунктНазн, Истина);
		СтанцияНазнСсылка = Локации_сервер.ПолучитьЛокациюПоНечеткомуПоиску(СтанцияНазн);
		ГрузополучательСсылка = КонтрагентыДоговоры_сервер.НайтиКонтрагентаПоНечеткомуУсловию(Грузополучатель);
		Если НЕ ЗначениеЗаполнено(ГрузополучательСсылка) Тогда
			ВесьСписокОшибок = ВесьСписокОшибок + "Контрагент не найден: " + Грузополучатель + Символы.ПС;
		КонецЕсли;
		
		Если НЕ РефрижераторныйКТК И ЗначениеЗаполнено(НомерКТКСсылка) И ЗначениеЗаполнено(ТипКТК.Тип) Тогда					
			ТипТЕИзКарточкиКонтейнера = РаботаСКонтейнерамиСервер.ПолучитьТипТЕ(НомерКТКСсылка);
			Если ТипТЕИзКарточкиКонтейнера <> Неопределено Тогда
				ТипКТК.Тип = ТипТЕИзКарточкиКонтейнера.ТипТЕ;
				ТипКТК.Размер = ТипТЕИзКарточкиКонтейнера.Размер; 
				ВведенРазмер = СтрДлина(Размер) = 2;
				ВведенТипоРаземер = СтрДлина(Размер) > 2;					
				Если (ВведенРазмер И Число(Размер) <> ТипТЕИзКарточкиКонтейнера.РазмерКТКЧисло)  ИЛИ (ВведенТипоРаземер И Размер <> ТипТЕИзКарточкиКонтейнера.ТипТЕНаименование) Тогда
					НомерТекущейСтроки = Сч-2;
					НомераСтрокНеСоответствуетТипоразмер.Добавить(НомерТекущейСтроки);					
				КонецЕсли;						
			КонецЕсли;					
		КонецЕсли;
		
		Если РефрижераторныйКТК И ЗначениеЗаполнено(НомерКТКСсылка) И ЗначениеЗаполнено(ТипКТК.Тип) Тогда				
			ТипТЕИзКТК = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(НомерКТКСсылка,"ТипТЕ");	
			Если ТипТЕИзКТК <> ПредопределенноеЗначение("Справочник.ТипоразмерыТЕ.ПустаяСсылка") Тогда
				Если НЕ ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ТипТЕИзКТК,"Рефрижераторный") Тогда
					НомерТекущейСтроки = Сч-2;
					НомераСтрокНеСоответствуетТипоразмер.Добавить(НомерТекущейСтроки);			
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		
		//ДИТ Шевченко А.В. 60130 15.11.22 //Убрал из структуры принадлежность КТК, добавил ВесНетто
		СтруктураДляРезультатаИПроверки = Новый Структура("НомерКТК,ТипКТК,Пломбы,ФИОВодителя,СтанцияОтправления,СтанцияНазначения,ПунктНазначения,Грузополучатель,КоличествоМест,ОсобыеОтметки,ИнструкцииПоСдачеПорожнего,ДатаПодачиАвтоПодПогрузку,РазмерКТК,НормативноеИспользование,УсловияПеревозки,УсловияПеревозкиНазначение,Груженый,НомерАвто,КодГруза,Груз,ДатаПодачиАвтоПодПогрузку,РеестрКлиента,НомерРелиза,ВесГрузаНетто",
		НомерКТКСсылка, ТипКТК.Тип, Пломбы, ФИОВодителя, СтанцияОтпрСсылка, СтанцияНазнСсылка, ПунктНазнСсылка, ГрузополучательСсылка, КоличествоМест, ОсобыеОтметки, Инструкция, ДатаВ1С, ТипКТК.Размер, НормаПользования, УсловияПеревозки, УсловияПеревозкиНазначение, Груженый, НомерАвто, ЕТСНГ, Груз, ДатаВ1С_ПодачаМашины, НомерРеестра, НомерРелиза, ВесГруза);
			
		Нарушение = ПроверитьФорматВВеденныхДанных(СтруктураДляРезультатаИПроверки,Сч-2);
		Если НЕ Нарушение Тогда
			Результат.Добавить(СтруктураДляРезультатаИПроверки);
		Иначе
			НомераСтрокСНарушениемФормата.Добавить(Сч-2);
		КонецЕсли;	
	
		Сч = Сч + 1;
		ПрочСтрока = ПолучитьЗначениеПоВсейСтроке(Сч);
	КонецЦикла;
	
	Если НомераСтрокЗаполненРазмерПустойКонтейнер.Количество() > 0 Тогда
		Сообщить(СтрШаблон("Не заполнен номер контейнера для указанного размера КТК в строке %1",СтрСоединить(НомераСтрокЗаполненРазмерПустойКонтейнер,",")));	
	КонецЕсли;
	
	Если НомераСтрокПустойТипВТЕИИсточнике.Количество() > 0 Тогда
		Сообщить(СтрШаблон("Не заполнен размер контейнера в строке %1",СтрСоединить(НомераСтрокПустойТипВТЕИИсточнике,",")));
	КонецЕсли;	
	
	Если Отказ Тогда
		Возврат Ответ;
	КонецЕсли;
	
	Если НомераСтрокНеСоответствуетТипоразмер.Количество() > 0 Тогда
		Структура = Новый Структура("Отказ,НомераСтрокСНарушениемФормата,Результат,ПоведениеПриЗаполнении",Отказ,НомераСтрокСНарушениемФормата,Результат, ПоведениеПриЗаполнении);
		ОпОп = Новый ОписаниеОповещения("ОбработкаВопросаЗакрытияНеСоответствуетТипоразмер", ЭтаФорма, Структура);
		Если НЕ РефрижераторныйКТК Тогда
			СообщениеВопроса = СтрШаблон("Введенные данные о типоразмере контейнера в строке %1 не соответствуют имеющимся в карточке контейнера. Будет перенесен типоразмер из карточки КТК.",СтрСоединить(НомераСтрокНеСоответствуетТипоразмер,","));
		Иначе
			СообщениеВопроса = СтрШаблон("Установленный признак Рефрижераторный КТК не соответствует типоразмеру из карточки КТК в строке %1. Будет перенесен типоразмер из карточки КТК.",СтрСоединить(НомераСтрокНеСоответствуетТипоразмер,","));
		КонецЕсли;
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить(КодВозвратаДиалога.Да,"Продолжить");
		СписокКнопок.Добавить(КодВозвратаДиалога.Нет,"Отмена");
		ПоказатьВопрос(ОпОп, СообщениеВопроса,СписокКнопок);   
		Отказ = Истина;
		Возврат Ответ;
	КонецЕсли; 
	
	Ответ.Результат = Результат;
	Ответ.НомераСтрокСНарушениемФормата = НомераСтрокСНарушениемФормата;
	
	Возврат Ответ;

КонецФункции 

