
&НаКлиенте
Процедура ЗаполнитьПоступления(Команда)
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Объект.Поступления.Очистить();
		Таб = ПланыПродажПоступленийВыбытийСервер.ЗаполнитьПоступленияПоПлануПродаж(Объект.ДокументОснование, Объект.ПоступлениеСДопУслугами);
		Для каждого Стр из Таб Цикл
			ЗаполнитьЗначенияСвойств(Объект.Поступления.Добавить(), Стр);
		КонецЦикла;
	Иначе
		СП = Новый СообщениеПользователю;
		СП.Поле = "ДокументОснование";
		СП.УстановитьДанные(Объект);
		СП.Текст = "Сначала укажите план продаж!";
		СП.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписания(Команда)
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Объект.Списания.Очистить();
		Таб = ПланыПродажПоступленийВыбытийСервер.ЗаполнитьСписанияПоПлануПродаж(Объект.ДокументОснование);
		Для каждого Стр из Таб Цикл
			ЗаполнитьЗначенияСвойств(Объект.Списания.Добавить(), Стр);
		КонецЦикла;
	Иначе
		СП = Новый СообщениеПользователю;
		СП.Поле = "ДокументОснование";
		СП.УстановитьДанные(Объект);
		СП.Текст = "Сначала укажите план продаж!";
		СП.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВУПП(Команда)
	
	ОповещениеОтветаВопроса = Новый ОписаниеОповещения("ОбработкаВопросаЗаписи", ЭтаФорма);
	Если ЭтаФорма.Модифицированность Или (Не Объект.Проведен) Тогда
		ПоказатьВопрос(ОповещениеОтветаВопроса, "Перед выгрузкой Плана его необходимо провести. Продолжить?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет);
	Иначе
		ОбработкаВопросаЗаписи(КодВозвратаДиалога.Да, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаЗаписи(Ответ = неопределено, Записан = неопределено) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда Возврат; КонецЕсли;
	
	Если Записан = неопределено Тогда
		ЗаписатьДокумент();
	КонецЕсли;
	ВыгрузитьВУППНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаписатьДокумент()
	
	СтруктураЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	ЭтотОбъект.Записать(СтруктураЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьВУППНаСервере()

	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(Объект.Ссылка);
	ЕСОбменСервер.ПередатьПланыДДСВУПП(МассивСсылок);

КонецПроцедуры


&НаКлиенте
Процедура ПоступленияДоговорПриИзменении(Элемент)
	
	ТД= Элементы.Поступления.ТекущиеДанные;
	ТД.Валюта = ПолучитьВалютуНаСервере(ТД.ДоговорКонтрагента);

КонецПроцедуры

&НаКлиенте
Процедура СписанияДоговорПриИзменении(Элемент)
	
	ТД= Элементы.Списания.ТекущиеДанные;
	ТД.Валюта = ПолучитьВалютуНаСервере(ТД.ДоговорКонтрагента);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВалютуНаСервере(ДоговорКонтрагента)
	Возврат ДоговорКонтрагента.ВалютаВзаиморасчетов;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ПредупреждениеРедактирования.Видимость = КонтрольДоступностиДокументов_сервер.ДокументЗаблокирован(Объект.Ссылка);
	Элементы.ПредупреждениеРедактирования.Заголовок = КонтрольДоступностиДокументов_сервер.ПолучитьОписаниеБлокировки();


	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.ДокументОснование) тогда
		ЗаполнитьПоступления(неопределено);
		ЗаполнитьСписания(неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеСДопУслугамиПриИзменении(Элемент)
	ЗаполнитьПоступления(неопределено);
КонецПроцедуры

&НаКлиенте
Процедура СводныйОтчет(Команда)
	
	ПараметрыОтчета = Новый Структура();
	ПараметрыОтчета.Вставить("СформироватьПриОткрытии", Истина);
	
	ПараметрыОтчета.Вставить("Параметры", Новый Структура("Организация, НачалоПериода, КонецПериода", Объект.Организация, Объект.ДатаНачала, Объект.ДатаОкончания));
	
	ОткрытьФорму("Отчет.ОтчетПоДоходамИРасходам.Форма", ПараметрыОтчета);
	
КонецПроцедуры
