
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	РаботаСМенеджерамиОбъектов.ОбработкаПолученияДанныхВыбораПолучитьДанныеВыбораБезПомеченныхНаУдаление("РейсыМоре", ДанныеВыбора, Параметры, СтандартнаяОбработка);
КонецПроцедуры

//Евросиб Коханенко Н.А. 15.12.2023 (( #78841 
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля = Новый Массив;
	Поля.Добавить("Наименование");
	Поля.Добавить("ПунктОтправления");
	Поля.Добавить("ПунктНазначения");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = СтрШаблон("%1 (%2 - %3)", Данные.Наименование, Данные.ПунктОтправления, Данные.ПунктНазначения);
	
КонецПроцедуры
//Евросиб Коханенко Н.А. 15.12.2023 )) #78841 

//Евросиб(ДИТ), Беляев СЮ, US 104074 / TA 104682, 11-03-2025, начало
Функция ВыполнитьПроверкуНаДубли(Параметры, ТаблицаДублейИзDX = Неопределено) Экспорт
	
	РазницаДней = 10;
	ПроверкаТолькоНаДублиИзDX = ТипЗнч(ТаблицаДублейИзDX) = Тип("ТаблицаЗначений");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РейсыМоре.Код КАК Код,
		|	РейсыМоре.Ссылка КАК Ссылка,
		|	РейсыМоре.Наименование КАК Наименование,
		|	РейсыМоре.ПунктОтправления КАК ПунктОтправления,
		|	РейсыМоре.ПунктНазначения КАК ПунктНазначения,
		|	РейсыМоре.ДатаОтправления МЕЖДУ &ДатаОтправленияМинРазница И &ДатаОтправленияПлюсРазница КАК ДатаОтправления,
		|	РейсыМоре.ДатаПрибытия МЕЖДУ &ДатаПрибытияМинРазница И &ДатаПрибытияПлюсРазница КАК ДатаПрибытия,
		|	РейсыМоре.Судно КАК Судно,
		|	ПротоколОбменов.УИДИсточника КАК УИДИсточника
		|ИЗ
		|	Справочник.РейсыМоре КАК РейсыМоре
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		|		ПО РейсыМоре.Ссылка = ПротоколОбменов.Объект
		|			И (ПротоколОбменов.ДействиеПриОбмене = ЗНАЧЕНИЕ(Перечисление.ДействияПриОбмене.ЗагрузкаДанных))
		|			И (ПротоколОбменов.УзелОбмена = ЗНАЧЕНИЕ(Перечисление.УзлыОбмена.DX))
		|ГДЕ
		|	РейсыМоре.Ссылка <> &Ссылка
		|	И НЕ ПротоколОбменов.Объект ЕСТЬ NULL";
	
	Если НЕ ПроверкаТолькоНаДублиИзDX Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "НЕ ПротоколОбменов.Объект ЕСТЬ NULL", "Истина");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", Параметры.Ссылка);
	
	Если ЗначениеЗаполнено(Параметры.Судно) 
		И ЗначениеЗаполнено(Параметры.ПунктОтправления) 
		И ЗначениеЗаполнено(Параметры.ПунктНазначения)
		И ЗначениеЗаполнено(Параметры.ДатаОтправления)
		И ЗначениеЗаполнено(Параметры.ДатаПрибытия) Тогда
		
		ТекстУсловий = " И РейсыМоре.Судно = &Судно
						|	И РейсыМоре.ПунктОтправления = &ПунктОтправления
						|	И РейсыМоре.ПунктНазначения = &ПунктНазначения
						|	И (РейсыМоре.ДатаОтправления МЕЖДУ &ДатаОтправленияМинРазница И &ДатаОтправленияПлюсРазница
						|	ИЛИ РейсыМоре.ДатаПрибытия МЕЖДУ &ДатаПрибытияМинРазница И &ДатаПрибытияПлюсРазница)";
		
		Запрос.Текст = Запрос.Текст + ТекстУсловий;
		
		Запрос.УстановитьПараметр("ДатаОтправленияМинРазница", Параметры.ДатаОтправления-86400*РазницаДней);
		Запрос.УстановитьПараметр("ДатаОтправленияПлюсРазница", Параметры.ДатаОтправления+86400*РазницаДней);
		Запрос.УстановитьПараметр("ДатаПрибытияМинРазница", Параметры.ДатаПрибытия-86400*РазницаДней);
		Запрос.УстановитьПараметр("ДатаПрибытияПлюсРазница", Параметры.ДатаПрибытия+86400*РазницаДней);
		
		Запрос.УстановитьПараметр("ПунктНазначения", Параметры.ПунктНазначения);
		Запрос.УстановитьПараметр("ПунктОтправления", Параметры.ПунктОтправления);
		Запрос.УстановитьПараметр("Судно", Параметры.Судно);
		
	ИначеЕсли ЗначениеЗаполнено(Параметры.Судно) 
		И ЗначениеЗаполнено(Параметры.ПунктОтправления) 
		И ЗначениеЗаполнено(Параметры.ПунктНазначения)
		И (ЗначениеЗаполнено(Параметры.ДатаОтправления)
		ИЛИ ЗначениеЗаполнено(Параметры.ДатаПрибытия)) Тогда
		
		ТекстУсловий = " И РейсыМоре.Судно = &Судно
						|	И РейсыМоре.ПунктОтправления = &ПунктОтправления
						|	И РейсыМоре.ПунктНазначения = &ПунктНазначения
						|	И (&НеукДатаОтправления ИЛИ РейсыМоре.ДатаОтправления МЕЖДУ &ДатаОтправленияМинРазница И &ДатаОтправленияПлюсРазница)
						|	? (&НеукДатаПрибытия ИЛИ РейсыМоре.ДатаПрибытия МЕЖДУ &ДатаПрибытияМинРазница И &ДатаПрибытияПлюсРазница)";
		
		Запрос.Текст = Запрос.Текст + ТекстУсловий;
		
		Запрос.УстановитьПараметр("НеукДатаОтправления", НЕ ЗначениеЗаполнено(Параметры.ДатаОтправления));
		Запрос.УстановитьПараметр("НеукДатаПрибытия", НЕ ЗначениеЗаполнено(Параметры.ДатаПрибытия));
		
		Если ЗначениеЗаполнено(Параметры.ДатаОтправления) И ЗначениеЗаполнено(Параметры.ДатаПрибытия) Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"?","ИЛИ");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"?","И");
		КонецЕсли;	
		
		Запрос.УстановитьПараметр("ДатаОтправленияМинРазница", Параметры.ДатаОтправления-86400*РазницаДней);
		Запрос.УстановитьПараметр("ДатаОтправленияПлюсРазница", Параметры.ДатаОтправления+86400*РазницаДней);
		Запрос.УстановитьПараметр("ДатаПрибытияМинРазница", Параметры.ДатаПрибытия-86400*РазницаДней);
		Запрос.УстановитьПараметр("ДатаПрибытияПлюсРазница", Параметры.ДатаПрибытия+86400*РазницаДней);
		
		Запрос.УстановитьПараметр("ПунктНазначения", Параметры.ПунктНазначения);
		Запрос.УстановитьПараметр("ПунктОтправления", Параметры.ПунктОтправления);
		Запрос.УстановитьПараметр("Судно", Параметры.Судно);
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Параметры.Судно) 
		И ЗначениеЗаполнено(Параметры.ПунктОтправления) 
		И ЗначениеЗаполнено(Параметры.ПунктНазначения)
		И ЗначениеЗаполнено(Параметры.ДатаОтправления)
		И ЗначениеЗаполнено(Параметры.ДатаПрибытия) Тогда
		
		ТекстУсловий = " И РейсыМоре.ПунктОтправления = &ПунктОтправления
						|	И РейсыМоре.ПунктНазначения = &ПунктНазначения
						|	И (РейсыМоре.ДатаОтправления МЕЖДУ &ДатаОтправленияМинРазница И &ДатаОтправленияПлюсРазница
						|	ИЛИ РейсыМоре.ДатаПрибытия МЕЖДУ &ДатаПрибытияМинРазница И &ДатаПрибытияПлюсРазница)";
		
		Запрос.Текст = Запрос.Текст + ТекстУсловий;
		
		Запрос.УстановитьПараметр("ДатаОтправленияМинРазница", Параметры.ДатаОтправления-86400*РазницаДней);
		Запрос.УстановитьПараметр("ДатаОтправленияПлюсРазница", Параметры.ДатаОтправления+86400*РазницаДней);
		Запрос.УстановитьПараметр("ДатаПрибытияМинРазница", Параметры.ДатаПрибытия-86400*РазницаДней);
		Запрос.УстановитьПараметр("ДатаПрибытияПлюсРазница", Параметры.ДатаПрибытия+86400*РазницаДней);
		
		Запрос.УстановитьПараметр("ПунктНазначения", Параметры.ПунктНазначения);
		Запрос.УстановитьПараметр("ПунктОтправления", Параметры.ПунктОтправления);
		
	ИначеЕсли ЗначениеЗаполнено(Параметры.Судно) 
		И (ЗначениеЗаполнено(Параметры.ПунктОтправления) 
		ИЛИ ЗначениеЗаполнено(Параметры.ПунктНазначения))
		И ЗначениеЗаполнено(Параметры.ДатаОтправления)
		И ЗначениеЗаполнено(Параметры.ДатаПрибытия) Тогда
		
		ТекстУсловий = " И РейсыМоре.Судно = &Судно
						|	И (&ПунктОтправленияНеУказан ИЛИ РейсыМоре.ПунктОтправления = &ПунктОтправления)
						|	И (&ПунктНазначенияНеУказан ИЛИ РейсыМоре.ПунктНазначения = &ПунктНазначения)
						|	И (&ПунктОтправленияНеУказан ИЛИ РейсыМоре.ДатаОтправления МЕЖДУ &ДатаОтправленияМинРазница И &ДатаОтправленияПлюсРазница)
						|	? (&ПунктНазначенияНеУказан ИЛИ РейсыМоре.ДатаПрибытия МЕЖДУ &ДатаПрибытияМинРазница И &ДатаПрибытияПлюсРазница)";
		
		Запрос.Текст = Запрос.Текст + ТекстУсловий;
		
		Если ЗначениеЗаполнено(Параметры.ПунктНазначения) И ЗначениеЗаполнено(Параметры.ПунктОтправления) Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"?","ИЛИ");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"?","И");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Судно", Параметры.Судно);
		Запрос.УстановитьПараметр("ПунктНазначенияНеУказан", НЕ ЗначениеЗаполнено(Параметры.ПунктНазначения));
		Запрос.УстановитьПараметр("ПунктОтправленияНеУказан", НЕ ЗначениеЗаполнено(Параметры.ПунктОтправления));
		
		Запрос.УстановитьПараметр("ДатаОтправленияМинРазница", Параметры.ДатаОтправления-86400*РазницаДней);
		Запрос.УстановитьПараметр("ДатаОтправленияПлюсРазница", Параметры.ДатаОтправления+86400*РазницаДней);
		Запрос.УстановитьПараметр("ДатаПрибытияМинРазница", Параметры.ДатаПрибытия-86400*РазницаДней);
		Запрос.УстановитьПараметр("ДатаПрибытияПлюсРазница", Параметры.ДатаПрибытия+86400*РазницаДней);
		
		Запрос.УстановитьПараметр("ПунктНазначения", Параметры.ПунктНазначения);
		Запрос.УстановитьПараметр("ПунктОтправления", Параметры.ПунктОтправления);
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;	
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если ПроверкаТолькоНаДублиИзDX Тогда
		ТаблицаДублейИзDX = РезультатЗапроса.Выгрузить();
		Возврат ТаблицаДублейИзDX.Количество() > 0;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ОбщегоНазначения.СообщитьПользователю("Редактируемый рейс является дублем рейса "+ВыборкаДетальныеЗаписи.Наименование + " ("+ВыборкаДетальныеЗаписи.Код+")");
		
		ОбщегоНазначения.СообщитьПользователю("Следующие реквизиты совпадают:");
		
		СтрокаСообщенийПорты = Новый Массив;
		СтрокаСообщенийДаты = Новый Массив;
		
		Если ВыборкаДетальныеЗаписи.Судно = Параметры.Судно Тогда
			ОбщегоНазначения.СообщитьПользователю("Судно");
		КонецЕсли;
		Если ВыборкаДетальныеЗаписи.ПунктОтправления = Параметры.ПунктОтправления Тогда 
			СтрокаСообщенийПорты.Добавить("Порт отправления");
		КонецЕсли;
		Если ВыборкаДетальныеЗаписи.ДатаОтправления Тогда
			СтрокаСообщенийДаты.Добавить("Дата отправления");
		КонецЕсли;
		Если ВыборкаДетальныеЗаписи.ДатаПрибытия Тогда
			СтрокаСообщенийДаты.Добавить("Дата прибытия");
		КонецЕсли;
		Если ВыборкаДетальныеЗаписи.ПунктНазначения = Параметры.ПунктНазначения Тогда
			СтрокаСообщенийПорты.Добавить("Порт назначения");
		КонецЕсли;
		
		Если СтрокаСообщенийПорты.Количество() Тогда 
			ОбщегоНазначения.СообщитьПользователю(СтрСоединить(СтрокаСообщенийПорты,", "));
		КонецЕсли;
		Если СтрокаСообщенийДаты.Количество() Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрСоединить(СтрокаСообщенийДаты,", "));
		КонецЕсли;
		Возврат Истина;
	КонецЦикла;
	
	Возврат ложь;
	
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 104074 / TA 104682, 11-03-2025, конец

// Евросиб US 111176 TA 111178 Рыбьяков К.А. 25.06.2025 ((
Функция ПортНазначенияРоссийский(ПортНазначения) Экспорт
	
	Результат = Ложь;
	
	Если ЗначениеЗаполнено(ПортНазначения) Тогда
		Страна = Неопределено;
		ЛокацияВышестоящегоУровня = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПортНазначения, "ЛокацияВышестоящегоУровня");
		ТипЛокацииВышестоящегоУровня = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЛокацияВышестоящегоУровня, "Тип");
		Пока ЗначениеЗаполнено(ЛокацияВышестоящегоУровня) Цикл
			Если ТипЛокацииВышестоящегоУровня = Справочники.ТипыЛокаций.Страна И Страна = Неопределено Тогда
				Страна = ЛокацияВышестоящегоУровня;
			КонецЕсли;
			ЛокацияВышестоящегоУровня = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЛокацияВышестоящегоУровня, "ЛокацияВышестоящегоУровня");
			ТипЛокацииВышестоящегоУровня = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЛокацияВышестоящегоУровня, "Тип");
		КонецЦикла;
		Если Страна = Справочники.Локации.РОССИЯ Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // Евросиб Рыбьяков К.А. 25.06.2025 ))

// Евросиб US 111176 TA 111178 Рыбьяков К.А. 30.07.2025 ((
Функция ПроверитьПунктыНаПометкуУдаления(МорскойРейс) Экспорт
	Ответ = Новый Структура;
	Ответ.Вставить("ПунктНазначенияПометкаУдаления", Ложь);
	Ответ.Вставить("МестоРазгрузкиПометкаУдаления", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(РейсыМоре.ПунктНазначения.ПометкаУдаления, Ложь) КАК ПунктНазначенияПометкаУдаления,
	|	ЕСТЬNULL(РейсыМоре.МестоРазгрузки.ПометкаУдаления, Ложь) КАК МестоРазгрузкиПометкаУдаления
	|ИЗ
	|	Справочник.РейсыМоре КАК РейсыМоре
	|ГДЕ
	|	РейсыМоре.Ссылка = &МорскойРейс";
	
	Запрос.УстановитьПараметр("МорскойРейс", МорскойРейс);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ПунктНазначенияПометкаУдаления Тогда
			Ответ.ПунктНазначенияПометкаУдаления = Истина;
		КонецЕсли;
		Если Выборка.МестоРазгрузкиПометкаУдаления Тогда
			Ответ.МестоРазгрузкиПометкаУдаления = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ответ;
КонецФункции// Евросиб Рыбьяков К.А. 30.07.2025 ))

