// ДИТ US 81881 ТА 83581 Сержантова А.С. 08.04.2024
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ОбменДанными.Загрузка = Истина Тогда //Евросиб(ДИТ), Беляев СЮ, US 102934 / TA 103591, 06-03-2025, начало
		//ДИТ Шевченко А.В. US 96893 TA 98138 15.01.2025
		КлючевыеРеквизиты = "ПунктОтправления, ПунктНазначения, МестоПогрузки, ДатаОтправления, ДатаПрибытия, Судно";
		РеквизитыДоЗаписи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, КлючевыеРеквизиты);
		Если  ПунктОтправления <> РеквизитыДоЗаписи.ПунктОтправления
			или ПунктНазначения <> РеквизитыДоЗаписи.ПунктНазначения
			или Судно <> РеквизитыДоЗаписи.Судно
			или ДатаОтправления <> РеквизитыДоЗаписи.ДатаОтправления
			или ДатаПрибытия <> РеквизитыДоЗаписи.ДатаПрибытия Тогда
			//Отказ = ВыполнитьПроверкуНаДубли();
			//Евросиб(ДИТ), Беляев СЮ, US 104074 / TA 104682, 11-03-2025, начало
			ПараметрыПроверки = Новый Структура;
			ПараметрыПроверки.Вставить("Судно", Судно);
			ПараметрыПроверки.Вставить("ПунктОтправления", ПунктОтправления);
			ПараметрыПроверки.Вставить("ПунктНазначения", ПунктНазначения);
			ПараметрыПроверки.Вставить("ДатаОтправления", ДатаОтправления);
			ПараметрыПроверки.Вставить("ДатаПрибытия", ДатаПрибытия);
			ПараметрыПроверки.Вставить("Ссылка", Ссылка);
			Отказ = Справочники.РейсыМоре.ВыполнитьПроверкуНаДубли(ПараметрыПроверки);
			//Евросиб(ДИТ), Беляев СЮ, US 104074 / TA 104682, 11-03-2025, конец
		КонецЕсли;
		//ДИТ Шевченко А.В. US 96893 TA 98138 15.01.2025
	КонецЕсли;
	
	Если не Отказ и (ДатаПрибытия <> Ссылка.ДатаПрибытия или ПунктНазначения <> Ссылка.ПунктНазначения
		или ПометкаУдаления <> Ссылка.ПометкаУдаления) Тогда
		ПроверитьЗапросНаАвтоСоздатьЗадачуНаОбновление(); 
	КонецЕсли; 
	
	// Евросиб(ДИТ) US 84968 ТА 85632 / BUG 95403 ТА 95433 Сержантова А.С. Начало: 12.09.2024 
	Если не Отказ и ЗначениеЗаполнено(Ссылка) Тогда
		КлючевыеРеквизиты = "ПометкаУдаления, ПунктОтправления, ПунктНазначения, МестоПогрузки, МестоРазгрузки, ДатаОтправления, ДатаПрибытия";
		РеквизитыДоЗаписи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, КлючевыеРеквизиты);     
		Если (ПометкаУдаления и ПометкаУдаления <> РеквизитыДоЗаписи.ПометкаУдаления)
			или ПунктОтправления <> РеквизитыДоЗаписи.ПунктОтправления
			или ПунктНазначения <> РеквизитыДоЗаписи.ПунктНазначения
			или МестоПогрузки <> РеквизитыДоЗаписи.МестоПогрузки
			или МестоРазгрузки <> РеквизитыДоЗаписи.МестоРазгрузки
			или ДатаОтправления <> РеквизитыДоЗаписи.ДатаОтправления
			или ДатаПрибытия <> РеквизитыДоЗаписи.ДатаПрибытия Тогда
		    ОтложенноеИзменениеСервер.ПоставитьСвязанныеОбъектыВОчередьИзменения(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	// Евросиб(ДИТ) US 84968 ТА 85632 Сержантова А.С. Конец: 12.09.2024  
	
КонецПроцедуры        

// ДИТ US 81881 ТА 83581 Сержантова А.С. 08.04.2024
Процедура ПроверитьЗапросНаАвтоСоздатьЗадачуНаОбновление()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаПереченьРейсов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ЗаявкиСРейсом
	|ИЗ
	|	Документ.Заявка.ПереченьРейсов КАК ЗаявкаПереченьРейсов
	|ГДЕ
	|	ЗаявкаПереченьРейсов.Рейс = &Рейс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗапросНаАвтоперевозку.Ссылка КАК ЗапросНаАвто
	|ИЗ
	|	ВТ_ЗаявкиСРейсом КАК ВТ_ЗаявкиСРейсом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗапросНаАвтоперевозку КАК ЗапросНаАвтоперевозку
	|		ПО ВТ_ЗаявкиСРейсом.Ссылка = ЗапросНаАвтоперевозку.Заявка
	|ГДЕ
	|	НЕ ЗапросНаАвтоперевозку.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗапросНаАвтоперевозкуКонтейнеры.Ссылка КАК ЗапросНаАвто
	|ИЗ
	|	ВТ_ЗаявкиСРейсом КАК ВТ_ЗаявкиСРейсом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗапросНаАвтоперевозку.Контейнеры КАК ЗапросНаАвтоперевозкуКонтейнеры
	|		ПО ВТ_ЗаявкиСРейсом.Ссылка = ЗапросНаАвтоперевозкуКонтейнеры.Ссылка.Заявка
	|ГДЕ
	|	ЗапросНаАвтоперевозкуКонтейнеры.ТерминалВыдачи <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|	И НЕ ЗапросНаАвтоперевозкуКонтейнеры.Ссылка.ПометкаУдаления";
	Запрос.УстановитьПараметр("Рейс", Ссылка);
	
	Результаты = Запрос.ВыполнитьПакет();
	РезультатПриИзменении = Результаты[1];
	РезультатПриУдалении = Результаты[2];   
	// при изменении открываем в запросе на авто задачу по обновлению данных
	Если не РезультатПриИзменении.Пустой() и не ПометкаУдаления Тогда
		Выборка = РезультатПриИзменении.Выбрать();  
		СостояниеДляЗадачиОбновления = Справочники.Состояния.НеобходимоОбновитьДанные;
		Пока Выборка.Следующий() Цикл
			ОбъектЗапросаНаАвто = Выборка.ЗапросНаАвто.ПолучитьОбъект();
			ЗадачаОбновленияДобавлена = Ложь;
			Для каждого СтрСостояния Из ОбъектЗапросаНаАвто.Состояния Цикл
				Если СтрСостояния.Состояние = СостояниеДляЗадачиОбновления Тогда
					СтрСостояния.Статус = Перечисления.СтатусыЭтапов.ВРаботе;
					СтрСостояния.НачалоРаботы = ТекущаяДата(); 
					ЗадачаОбновленияДобавлена = Истина; 
					Прервать;
				КонецЕсли;
			КонецЦикла;  
			Если не ЗадачаОбновленияДобавлена Тогда
				//Применить к запросу на авто маршрут
				ПараметрыЗапроса = Новый Соответствие;
				РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьЗапросНаАвто(ПараметрыЗапроса, ОбъектЗапросаНаАвто.Дата);
				Если РезультатЗапроса.Количество() > 0 Тогда
					Если РезультатЗапроса.Количество() > 0 Тогда
						МаршрутизацияСервер.ПрименитьМаршрут(ОбъектЗапросаНаАвто, РезультатЗапроса, ОбъектЗапросаНаАвто.Автор, Новый СписокЗначений); 
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;
			ОбъектЗапросаНаАвто.Записать();
		КонецЦикла;  
	// при удалении или отмене рейса открываем задачу по актуализации терминала выдачи 
	ИначеЕсли не РезультатПриУдалении.Пустой() и Ссылка.ПометкаУдаления <> ПометкаУдаления Тогда    
		Выборка = РезультатПриУдалении.Выбрать();
        СостояниеДляЗадачиОбновления = Справочники.Состояния.НеобходимоОбновитьДанные;
		СостояниеДляЗадачиПриУдалении = Справочники.Состояния.ОтменаРейсаАктуализироватьТерминал;
		Пока Выборка.Следующий() Цикл
			ОбъектЗапросаНаАвто = Выборка.ЗапросНаАвто.ПолучитьОбъект();
			ЗадачаОбновленияДобавлена = Ложь;  
			ЗадачаОбновленияПриУдаленииДобавлена = Ложь; 
			Для каждого СтрСостояния Из ОбъектЗапросаНаАвто.Состояния Цикл
				Если СтрСостояния.Состояние = СостояниеДляЗадачиОбновления Тогда
					СтрСостояния.Статус = Перечисления.СтатусыЭтапов.ВРаботе;
					СтрСостояния.НачалоРаботы = ТекущаяДата(); 
					ЗадачаОбновленияДобавлена = Истина;
				КонецЕсли; 
				Если СтрСостояния.Состояние = СостояниеДляЗадачиПриУдалении Тогда
					СтрСостояния.Статус = Перечисления.СтатусыЭтапов.ВРаботе;
					СтрСостояния.НачалоРаботы = ТекущаяДата();
					СтрСостояния.ПредыдущиеЭтапы = "1";      
					ЗадачаОбновленияПриУдаленииДобавлена = Истина;
				КонецЕсли;
			КонецЦикла; 
			Если не ЗадачаОбновленияДобавлена Тогда
				ПараметрыЗапроса = Новый Соответствие;
				РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьЗапросНаАвто(ПараметрыЗапроса, ОбъектЗапросаНаАвто.Дата);
				Если РезультатЗапроса.Количество() > 0 Тогда
					Если РезультатЗапроса.Количество() > 0 Тогда
						МаршрутизацияСервер.ПрименитьМаршрут(ОбъектЗапросаНаАвто, РезультатЗапроса, ОбъектЗапросаНаАвто.Автор, Новый СписокЗначений); 
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Если не ЗадачаОбновленияПриУдаленииДобавлена Тогда
				НС = ОбъектЗапросаНаАвто.Состояния.Добавить();	
				НС.Состояние = СостояниеДляЗадачиПриУдалении;
				НС.Статус = Перечисления.СтатусыЭтапов.ВРаботе; 
				НС.Исполнитель = ОбъектЗапросаНаАвто.Автор;  
				НС.Наблюдатель = ОбъектЗапросаНаАвто.Автор;
				НС.ПредыдущиеЭтапы = "1";  
				НС.НачалоРаботы = ТекущаяДата();
			КонецЕсли; 
			ОбъектЗапросаНаАвто.Записать();
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

// Евросиб(ДИТ) BUG 93771 ТА 93793 Сержантова А.С. 07.11.2024
Процедура ПриЗаписи(Отказ)
	
	Если не Отказ Тогда
		//РегистрыСведений.ДанныеМорскихРейсов.ДобавитьОбновитьЗаписьДанныхМорскогоРейса(Ссылка); 
	КонецЕсли;

КонецПроцедуры

//Евросиб(ДИТ), Беляев СЮ, US 104074 / TA 104682, 11-03-2025, начало (перенес функцию в модуль менеджера)
//Функция ВыполнитьПроверкуНаДубли() //ДИТ Шевченко А.В. US 96893 TA 98138 15.01.2025
//	
//	РазницаДней = 10;
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	РейсыМоре.Код КАК Код,
//		|	РейсыМоре.Наименование КАК Наименование,
//		|	РейсыМоре.ПунктОтправления КАК ПунктОтправления,
//		|	РейсыМоре.ПунктНазначения КАК ПунктНазначения,
//		|	РейсыМоре.ДатаОтправления МЕЖДУ &ДатаОтправленияМинРазница И &ДатаОтправленияПлюсРазница КАК ДатаОтправления,
//		|	РейсыМоре.ДатаПрибытия МЕЖДУ &ДатаПрибытияМинРазница И &ДатаПрибытияПлюсРазница КАК ДатаПрибытия,
//		|	РейсыМоре.Судно КАК Судно
//		|ИЗ
//		|	Справочник.РейсыМоре КАК РейсыМоре
//		|ГДЕ
//		|	РейсыМоре.Ссылка <> &Ссылка";	
//	
//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
//	
//	Если ЗначениеЗаполнено(Судно) 
//		И ЗначениеЗаполнено(ПунктОтправления) 
//		И ЗначениеЗаполнено(ПунктНазначения)
//		И ЗначениеЗаполнено(ДатаОтправления)
//		И ЗначениеЗаполнено(ДатаПрибытия) Тогда
//		
//		ТекстУсловий = " И РейсыМоре.Судно = &Судно
//						|	И РейсыМоре.ПунктОтправления = &ПунктОтправления
//						|	И РейсыМоре.ПунктНазначения = &ПунктНазначения
//						|	И (РейсыМоре.ДатаОтправления МЕЖДУ &ДатаОтправленияМинРазница И &ДатаОтправленияПлюсРазница
//						|	ИЛИ РейсыМоре.ДатаПрибытия МЕЖДУ &ДатаПрибытияМинРазница И &ДатаПрибытияПлюсРазница)";
//		
//		Запрос.Текст = Запрос.Текст + ТекстУсловий;
//		
//		Запрос.УстановитьПараметр("ДатаОтправленияМинРазница", ДатаОтправления-86400*РазницаДней);
//		Запрос.УстановитьПараметр("ДатаОтправленияПлюсРазница", ДатаОтправления+86400*РазницаДней);
//		Запрос.УстановитьПараметр("ДатаПрибытияМинРазница", ДатаПрибытия-86400*РазницаДней);
//		Запрос.УстановитьПараметр("ДатаПрибытияПлюсРазница", ДатаПрибытия+86400*РазницаДней);
//		
//		Запрос.УстановитьПараметр("ПунктНазначения", ПунктНазначения);
//		Запрос.УстановитьПараметр("ПунктОтправления", ПунктОтправления);
//		Запрос.УстановитьПараметр("Судно", Судно);
//		
//	ИначеЕсли ЗначениеЗаполнено(Судно) 
//		И ЗначениеЗаполнено(ПунктОтправления) 
//		И ЗначениеЗаполнено(ПунктНазначения)
//		И (ЗначениеЗаполнено(ДатаОтправления)
//		ИЛИ ЗначениеЗаполнено(ДатаПрибытия)) Тогда
//		
//		ТекстУсловий = " И РейсыМоре.Судно = &Судно
//						|	И РейсыМоре.ПунктОтправления = &ПунктОтправления
//						|	И РейсыМоре.ПунктНазначения = &ПунктНазначения
//						|	И (&НеукДатаОтправления ИЛИ РейсыМоре.ДатаОтправления МЕЖДУ &ДатаОтправленияМинРазница И &ДатаОтправленияПлюсРазница)
//						|	? (&НеукДатаПрибытия ИЛИ РейсыМоре.ДатаПрибытия МЕЖДУ &ДатаПрибытияМинРазница И &ДатаПрибытияПлюсРазница)";
//		
//		Запрос.Текст = Запрос.Текст + ТекстУсловий;
//		
//		Запрос.УстановитьПараметр("НеукДатаОтправления", НЕ ЗначениеЗаполнено(ДатаОтправления));
//		Запрос.УстановитьПараметр("НеукДатаПрибытия", НЕ ЗначениеЗаполнено(ДатаПрибытия));
//		
//		Если ЗначениеЗаполнено(ДатаОтправления) И ЗначениеЗаполнено(ДатаПрибытия) Тогда
//			Запрос.Текст = СтрЗаменить(Запрос.Текст,"?","ИЛИ");
//		Иначе
//			Запрос.Текст = СтрЗаменить(Запрос.Текст,"?","И");
//		КонецЕсли;	
//		
//		Запрос.УстановитьПараметр("ДатаОтправленияМинРазница", ДатаОтправления-86400*РазницаДней);
//		Запрос.УстановитьПараметр("ДатаОтправленияПлюсРазница", ДатаОтправления+86400*РазницаДней);
//		Запрос.УстановитьПараметр("ДатаПрибытияМинРазница", ДатаПрибытия-86400*РазницаДней);
//		Запрос.УстановитьПараметр("ДатаПрибытияПлюсРазница", ДатаПрибытия+86400*РазницаДней);
//		
//		Запрос.УстановитьПараметр("ПунктНазначения", ПунктНазначения);
//		Запрос.УстановитьПараметр("ПунктОтправления", ПунктОтправления);
//		Запрос.УстановитьПараметр("Судно", Судно);
//		
//	ИначеЕсли НЕ ЗначениеЗаполнено(Судно) 
//		И ЗначениеЗаполнено(ПунктОтправления) 
//		И ЗначениеЗаполнено(ПунктНазначения)
//		И ЗначениеЗаполнено(ДатаОтправления)
//		И ЗначениеЗаполнено(ДатаПрибытия) Тогда
//		
//		ТекстУсловий = " И РейсыМоре.ПунктОтправления = &ПунктОтправления
//						|	И РейсыМоре.ПунктНазначения = &ПунктНазначения
//						|	И (РейсыМоре.ДатаОтправления МЕЖДУ &ДатаОтправленияМинРазница И &ДатаОтправленияПлюсРазница
//						|	ИЛИ РейсыМоре.ДатаПрибытия МЕЖДУ &ДатаПрибытияМинРазница И &ДатаПрибытияПлюсРазница)";
//		
//		Запрос.Текст = Запрос.Текст + ТекстУсловий;
//		
//		Запрос.УстановитьПараметр("ДатаОтправленияМинРазница", ДатаОтправления-86400*РазницаДней);
//		Запрос.УстановитьПараметр("ДатаОтправленияПлюсРазница", ДатаОтправления+86400*РазницаДней);
//		Запрос.УстановитьПараметр("ДатаПрибытияМинРазница", ДатаПрибытия-86400*РазницаДней);
//		Запрос.УстановитьПараметр("ДатаПрибытияПлюсРазница", ДатаПрибытия+86400*РазницаДней);
//		
//		Запрос.УстановитьПараметр("ПунктНазначения", ПунктНазначения);
//		Запрос.УстановитьПараметр("ПунктОтправления", ПунктОтправления);
//		
//	ИначеЕсли ЗначениеЗаполнено(Судно) 
//		И (ЗначениеЗаполнено(ПунктОтправления) 
//		ИЛИ ЗначениеЗаполнено(ПунктНазначения))
//		И ЗначениеЗаполнено(ДатаОтправления)
//		И ЗначениеЗаполнено(ДатаПрибытия) Тогда
//		
//		ТекстУсловий = " И РейсыМоре.Судно = &Судно
//						|	И (&ПунктОтправленияНеУказан ИЛИ РейсыМоре.ПунктОтправления = &ПунктОтправления)
//						|	И (&ПунктНазначенияНеУказан ИЛИ РейсыМоре.ПунктНазначения = &ПунктНазначения)
//						|	И (&ПунктОтправленияНеУказан ИЛИ РейсыМоре.ДатаОтправления МЕЖДУ &ДатаОтправленияМинРазница И &ДатаОтправленияПлюсРазница)
//						|	? (&ПунктНазначенияНеУказан ИЛИ РейсыМоре.ДатаПрибытия МЕЖДУ &ДатаПрибытияМинРазница И &ДатаПрибытияПлюсРазница)";
//		
//		Запрос.Текст = Запрос.Текст + ТекстУсловий;
//		
//		Если ЗначениеЗаполнено(ПунктНазначения) И ЗначениеЗаполнено(ПунктОтправления) Тогда
//			Запрос.Текст = СтрЗаменить(Запрос.Текст,"?","ИЛИ");
//		Иначе
//			Запрос.Текст = СтрЗаменить(Запрос.Текст,"?","И");
//		КонецЕсли;
//		
//		Запрос.УстановитьПараметр("Судно", Судно);
//		Запрос.УстановитьПараметр("ПунктНазначенияНеУказан", НЕ ЗначениеЗаполнено(ПунктНазначения));
//		Запрос.УстановитьПараметр("ПунктОтправленияНеУказан", НЕ ЗначениеЗаполнено(ПунктОтправления));
//		
//		Запрос.УстановитьПараметр("ДатаОтправленияМинРазница", ДатаОтправления-86400*РазницаДней);
//		Запрос.УстановитьПараметр("ДатаОтправленияПлюсРазница", ДатаОтправления+86400*РазницаДней);
//		Запрос.УстановитьПараметр("ДатаПрибытияМинРазница", ДатаПрибытия-86400*РазницаДней);
//		Запрос.УстановитьПараметр("ДатаПрибытияПлюсРазница", ДатаПрибытия+86400*РазницаДней);
//		
//		Запрос.УстановитьПараметр("ПунктНазначения", ПунктНазначения);
//		Запрос.УстановитьПараметр("ПунктОтправления", ПунктОтправления);
//		
//	Иначе
//		
//		Возврат Ложь;
//		
//	КонецЕсли;	
//		
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		
//		Сообщить("Редактируемый рейс является дублем рейса "+ВыборкаДетальныеЗаписи.Наименование + " ("+ВыборкаДетальныеЗаписи.Код+")");
//		
//		Сообщить("Следующие реквизиты совпадают:");
//		
//		СтрокаСообщенийПорты = Новый Массив;
//		СтрокаСообщенийДаты = Новый Массив;
//		
//		Если ВыборкаДетальныеЗаписи.Судно = Судно Тогда
//			Сообщить("Судно");
//		КонецЕсли;
//		Если ВыборкаДетальныеЗаписи.ПунктОтправления = ПунктОтправления Тогда 
//			СтрокаСообщенийПорты.Добавить("Порт отправления");
//		КонецЕсли;
//		Если ВыборкаДетальныеЗаписи.ДатаОтправления Тогда
//			СтрокаСообщенийДаты.Добавить("Дата отправления");
//		КонецЕсли;
//		Если ВыборкаДетальныеЗаписи.ДатаПрибытия Тогда
//			СтрокаСообщенийДаты.Добавить("Дата прибытия");
//		КонецЕсли;
//		Если ВыборкаДетальныеЗаписи.ПунктНазначения = ПунктНазначения Тогда
//			СтрокаСообщенийПорты.Добавить("Порт назначения");
//		КонецЕсли;
//		
//		Если СтрокаСообщенийПорты.Количество() Тогда 
//			Сообщить(СтрСоединить(СтрокаСообщенийПорты,", "));
//		КонецЕсли;
//		Если СтрокаСообщенийДаты.Количество() Тогда
//			Сообщить(СтрСоединить(СтрокаСообщенийДаты,", "));
//		КонецЕсли;
//		Возврат Истина;
//	КонецЦикла;
//	
//	Возврат ложь;
//	
//	
//КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 104074 / TA 104682, 11-03-2025, конец