
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Сделка = Параметры.Сделка;
	Для каждого Стр из Параметры.МассивТСх Цикл
		Если ЗначениеЗаполнено(Стр.ЭлементТСх) Тогда
			НСтр = СхемаИсточник.Добавить();
			НСтр.Вариант = Стр.Вариант;
			НСтр.ЭлементТСх = Стр.ЭлементТСх;
		КонецЕсли;
		НСтр2 = СхемаПриемник.Добавить();
		НСтр2.Вариант = Стр.Вариант;
		НСтр2.ЭлементТСх = Стр.ЭлементТСх;
	КонецЦикла;
	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура СкопироватьЪ(Команда)
	
	Если Элементы.СхемаИсточник.ТекущиеДанные = неопределено ИЛИ Элементы.СхемаПриемник.ТекущиеДанные = неопределено Тогда Возврат; КонецЕсли;
	
	ТекИ = Элементы.СхемаИсточник.ТекущиеДанные;
	ТекП = Элементы.СхемаПриемник.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекП.ЭлементТСх) Тогда
		ПостроительТСх_сервер.Удалить_ТСх(ТекП.ЭлементТСх);
	КонецЕсли;
	
	НовСхема = ПостроительТСх_сервер.СкопироватьТСх(ТекИ.ЭлементТСх);
	
	Закрыть(Новый Структура("Вариант, ЭлементТСх", ?(ЗначениеЗаполнено(ПриемникНовый), ПриемникНовый, ТекП.Вариант), НовСхема));
	
КонецПроцедуры
