

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПроверитьОбязательныеПоля(Отказ);
	КонецЕсли;	
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Автор = Пользователи.ТекущийПользователь();
	ДатаНачалаПериодаДействия 		= Дата(1,1,1);
	ДатаОкончанияПериодаДействия  	= Дата(1,1,1);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ЭтоНовый() Тогда
		Автор  = Пользователи.ТекущийПользователь();
		Создано = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроверитьПересечениеСтавок(Отказ);
	
	Документы.НормативКонтрибуции.ИнициализироватьДанныеДокумента(Ссылка,ДополнительныеСвойства);
	
	СформироватьЗаписиРегистраСведенийСтавкиНормативовКонтрибуции();
	
	ОтложенноеИзменениеСервер.ПоставитьСвязанныеОбъектыВОчередьИзменения(Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ПроверитьОбязательныеПоля(Отказ)
	Если НЕ ЗначениеЗаполнено(ДатаНачалаПериодаДействия) ИЛИ НЕ ЗначениеЗаполнено(ДатаОкончанияПериодаДействия) Тогда
		ОбщегоНазначения.СообщитьПользователю("Перед проведением необходимо заполнить Период действия." , ЭтотОбъект, ,"Объект.ДатаНачалаПериодаДействия" , Отказ);
	КонецЕсли;	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТабЧасть.Продукт КАК Продукт,
		|	ТабЧасть.ОфисПродаж КАК ОфисПродаж,
		|	ТабЧасть.УчетноеНаправление КАК УчетноеНаправление,
		|	ТабЧасть.ПунктОтправления КАК ПунктОтправления,
		|	ТабЧасть.ПунктНазначения КАК ПунктНазначения,
		|	ТабЧасть.НомерСтроки КАК НомерСтроки,
		|	ТабЧасть.ГУИД КАК ГУИД
		|ПОМЕСТИТЬ ВТ_ТабЧастьНормативы
		|ИЗ
		|	&ТЗ КАК ТабЧасть
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабЧастьКлиенты.Клиент КАК Клиент,
		|	ТабЧастьКлиенты.ГУИД КАК ГУИД
		|ПОМЕСТИТЬ ВТ_ТабЧастьКлиенты
		|ИЗ
		|	&ТЗКлиенты КАК ТабЧастьКлиенты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабЧасть.Продукт КАК Продукт,
		|	ТабЧасть.ОфисПродаж КАК ОфисПродаж,
		|	ТабЧасть.УчетноеНаправление КАК УчетноеНаправление,
		|	ТабЧасть.ПунктОтправления КАК ПунктОтправления,
		|	ТабЧасть.ПунктНазначения КАК ПунктНазначения,
		|	ТабЧасть.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(ВТ_ТабЧастьКлиенты.Клиент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Клиент,
		|	ТабЧасть.ГУИД КАК ГУИД
		|ПОМЕСТИТЬ ТабЧасть
		|ИЗ
		|	ВТ_ТабЧастьНормативы КАК ТабЧасть
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТабЧастьКлиенты КАК ВТ_ТабЧастьКлиенты
		|		ПО ТабЧасть.ГУИД = ВТ_ТабЧастьКлиенты.ГУИД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТабЧасть.Продукт КАК Продукт,
		|	ТабЧасть.ОфисПродаж КАК ОфисПродаж,
		|	ТабЧасть.УчетноеНаправление КАК УчетноеНаправление,
		|	ТабЧасть.ПунктОтправления КАК ПунктОтправления,
		|	ТабЧасть.ПунктНазначения КАК ПунктНазначения,
		|	ТабЧасть.Клиент КАК Клиент,
		|	АВТОНОМЕРЗАПИСИ() КАК НомерГруппировки
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	ТабЧасть КАК ТабЧасть
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабЧасть КАК ТабЧасть1
		|		ПО ТабЧасть.Продукт = ТабЧасть1.Продукт
		|			И ТабЧасть.ОфисПродаж = ТабЧасть1.ОфисПродаж
		|			И ТабЧасть.УчетноеНаправление = ТабЧасть1.УчетноеНаправление
		|			И ТабЧасть.ПунктОтправления = ТабЧасть1.ПунктОтправления
		|			И ТабЧасть.ПунктНазначения = ТабЧасть1.ПунктНазначения
		|			И ТабЧасть.Клиент = ТабЧасть1.Клиент
		|			И ТабЧасть.ГУИД <> ТабЧасть1.ГУИД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабЧасть1.НомерСтроки КАК НомерСтроки,
		|	ВТ_Итог.НомерГруппировки КАК НомерГруппировки
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТабЧасть КАК ТабЧасть1
		|		ПО ВТ_Итог.Продукт = ТабЧасть1.Продукт
		|			И ВТ_Итог.ОфисПродаж = ТабЧасть1.ОфисПродаж
		|			И ВТ_Итог.УчетноеНаправление = ТабЧасть1.УчетноеНаправление
		|			И ВТ_Итог.ПунктОтправления = ТабЧасть1.ПунктОтправления
		|			И ВТ_Итог.ПунктНазначения = ТабЧасть1.ПунктНазначения
		|			И ВТ_Итог.Клиент = ТабЧасть1.Клиент
		|ИТОГИ ПО
		|	НомерГруппировки";
	
	Запрос.УстановитьПараметр("ТЗ", ЭтотОбъект.Нормативы.Выгрузить());
	Запрос.УстановитьПараметр("ТЗКлиенты", ЭтотОбъект.Клиенты.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНомерГруппировки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНомерГруппировки.Следующий() Цикл
	
		ВыборкаДетальныеЗаписи = ВыборкаНомерГруппировки.Выбрать();
	    МассивНомеровСтрок = Новый Массив;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			МассивНомеровСтрок.Добавить(ВыборкаДетальныеЗаписи.НомерСтроки);
		КонецЦикла;
		
		ТекстСообщения = "В строке " + СтрСоединить(МассивНомеровСтрок,",") + " обнаружена совпадающая ставка. Уточните параметры ставки или удалите лишнюю строку.";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		
	КонецЦикла;
	
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//Запрос.УстановитьПараметр("ТЗ", ЭтотОбъект.Нормативы.Выгрузить());
	//Запрос.УстановитьПараметр("ТЗКлиенты", ЭтотОбъект.Клиенты.Выгрузить());
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	ТабЧасть.Продукт КАК Продукт,
	//|	ТабЧасть.ОфисПродаж КАК ОфисПродаж,
	//|	ТабЧасть.УчетноеНаправление КАК УчетноеНаправление,
	//|	ТабЧасть.ПунктОтправления КАК ПунктОтправления,
	//|	ТабЧасть.ПунктНазначения КАК ПунктНазначения,
	//|	ТабЧасть.НомерСтроки КАК НомерСтроки,
	//|	ТабЧасть.ГУИД КАК ГУИД
	//|ПОМЕСТИТЬ ВТ_ТабЧастьНормативы
	//|ИЗ
	//|	&ТЗ КАК ТабЧасть
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТабЧастьКлиенты.Клиент КАК Клиент,
	//|	ТабЧастьКлиенты.ГУИД КАК ГУИД
	//|ПОМЕСТИТЬ ВТ_ТабЧастьКлиенты
	//|ИЗ
	//|	&ТЗКлиенты КАК ТабЧастьКлиенты
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТабЧасть.Продукт КАК Продукт,
	//|	ТабЧасть.ОфисПродаж КАК ОфисПродаж,
	//|	ТабЧасть.УчетноеНаправление КАК УчетноеНаправление,
	//|	ТабЧасть.ПунктОтправления КАК ПунктОтправления,
	//|	ТабЧасть.ПунктНазначения КАК ПунктНазначения,
	//|	ТабЧасть.НомерСтроки КАК НомерСтроки,
	//|	ЕСТЬNULL(ВТ_ТабЧастьКлиенты.Клиент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Клиент
	//|ПОМЕСТИТЬ ТабЧасть
	//|ИЗ
	//|	ВТ_ТабЧастьНормативы КАК ТабЧасть
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТабЧастьКлиенты КАК ВТ_ТабЧастьКлиенты
	//|		ПО ТабЧасть.ГУИД = ВТ_ТабЧастьКлиенты.ГУИД
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТабЧасть.Продукт КАК Продукт,
	//|	ТабЧасть.ОфисПродаж КАК ОфисПродаж,
	//|	ТабЧасть.УчетноеНаправление КАК УчетноеНаправление,
	//|	ТабЧасть.ПунктОтправления КАК ПунктОтправления,
	//|	ТабЧасть.ПунктНазначения КАК ПунктНазначения,
	//|	ЕСТЬNULL(ВТ_ТабЧастьКлиенты.Клиент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Клиент,
	//|	ТабЧасть.НомерСтроки КАК НомерСтроки
	//|ИЗ
	//|	Документ.НормативКонтрибуции.Нормативы КАК ТабЧасть
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НормативКонтрибуции.Клиенты КАК ВТ_ТабЧастьКлиенты
	//|		ПО ТабЧасть.ГУИД = ВТ_ТабЧастьКлиенты.ГУИД
	//|			И (ВТ_ТабЧастьКлиенты.Ссылка = &Ссылка)
	//|ГДЕ
	//|	ТабЧасть.Ссылка = &Ссылка
	//|	И (ТабЧасть.Продукт, ТабЧасть.ОфисПродаж, ТабЧасть.УчетноеНаправление, ТабЧасть.ПунктОтправления, ТабЧасть.ПунктНазначения, ЕСТЬNULL(ВТ_ТабЧастьКлиенты.Клиент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))) В
	//|			(ВЫБРАТЬ
	//|				ВТ.Продукт,
	//|				ВТ.ОфисПродаж,
	//|				ВТ.УчетноеНаправление,
	//|				ВТ.ПунктОтправления,
	//|				ВТ.ПунктНазначения,
	//|				ВТ.Клиент
	//|			ИЗ
	//|				ТабЧасть КАК ВТ
	//|			СГРУППИРОВАТЬ ПО
	//|				ВТ.Продукт,
	//|				ВТ.ОфисПродаж,
	//|				ВТ.УчетноеНаправление,
	//|				ВТ.ПунктОтправления,
	//|				ВТ.ПунктНазначения,
	//|				ВТ.Клиент
	//|			ИМЕЮЩИЕ
	//|				КОЛИЧЕСТВО(ВТ.НомерСтроки) > 1)
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	НомерСтроки
	//|ИТОГИ ПО
	//|	Продукт,
	//|	ОфисПродаж,
	//|	УчетноеНаправление,
	//|	ПунктОтправления,
	//|	ПунктНазначения,
	//|	Клиент";
	//РезЗапроса = Запрос.Выполнить();
	//Если Не РезЗапроса.Пустой() Тогда
	//	Выб_Продукт = РезЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//	Пока Выб_Продукт.Следующий() Цикл
	//		Выб_ОфисПродаж = Выб_Продукт.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//		Пока Выб_ОфисПродаж.Следующий() Цикл
	//			Выб_УчетноеНаправление = Выб_ОфисПродаж.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//			Пока Выб_УчетноеНаправление.Следующий() Цикл
	//				Выб_ПунктОтправления = Выб_УчетноеНаправление.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//				Пока Выб_ПунктОтправления.Следующий() Цикл
	//					Выб_ПунктНазначения = Выб_ПунктОтправления.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//					Пока Выб_ПунктНазначения.Следующий() Цикл
	//						Выб_Клиент = Выб_ПунктНазначения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//						Пока Выб_Клиент.Следующий()  Цикл
	//							ТекстСообщения = "";
	//							
	//							Выборка = Выб_Клиент.Выбрать();
	//							Пока Выборка.Следующий() Цикл
	//								ТекстСообщения = ТекстСообщения + ?(ПустаяСтрока(ТекстСообщения), "", ", ") + Выборка.НомерСтроки;
	//							КонецЦикла;
	//							
	//							ТекстСообщения = "В строке " + ТекстСообщения + " обнаружена совпадающая ставка. Уточните параметры ставки или удалите лишнюю строку.";
	//							ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	//						КонецЦикла;
	//					КонецЦикла;
	//				КонецЦикла;
	//			КонецЦикла;
	//		КонецЦикла;
	//	КонецЦикла;
	//КонецЕсли;
КонецПроцедуры

Процедура СформироватьЗаписиРегистраСведенийСтавкиНормативовКонтрибуции()
	
	Если НЕ ДополнительныеСвойства.Свойство("ТаблицаДляДвижения") Тогда
		Возврат;
	КонецЕсли;	
	
	Движения.СтавкиНормативовКонтрибуции.Записывать = Истина;
	Движения.СтавкиНормативовКонтрибуции.Загрузить(ДополнительныеСвойства.ТаблицаДляДвижения);
	Движения.Записать();
	
КонецПроцедуры	

Процедура ОбработкаУдаленияПроведения(Отказ)
	Движения.СтавкиНормативовКонтрибуции.Записывать = Истина;
	Движения.СтавкиНормативовКонтрибуции.Очистить();
	Движения.Записать();
КонецПроцедуры

Процедура ПроверитьПересечениеСтавок(Отказ)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НормативКонтрибуции.Ссылка КАК Ссылка,
		|	НормативКонтрибуции.ДатаНачалаПериодаДействия КАК ДатаНачалаПериодаДействия,
		|	НормативКонтрибуции.ДатаОкончанияПериодаДействия КАК ДатаОкончанияПериодаДействия
		|ПОМЕСТИТЬ ВТ_Документ
		|ИЗ
		|	Документ.НормативКонтрибуции КАК НормативКонтрибуции
		|ГДЕ
		|	НормативКонтрибуции.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НормативКонтрибуцииНормативы.Продукт КАК Продукт,
		|	НормативКонтрибуцииНормативы.ОфисПродаж КАК ОфисПродаж,
		|	НормативКонтрибуцииНормативы.УчетноеНаправление КАК УчетноеНаправление,
		|	НормативКонтрибуцииНормативы.ПунктОтправления КАК ПунктОтправления,
		|	НормативКонтрибуцииНормативы.ПунктНазначения КАК ПунктНазначения,
		|	ЕСТЬNULL(ВТ_ТабЧастьКлиенты.Клиент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Клиент,
		|	НормативКонтрибуцииНормативы.Ссылка КАК Ссылка,
		|	НормативКонтрибуцииНормативы.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_ДокументТЧ
		|ИЗ
		|	Документ.НормативКонтрибуции.Нормативы КАК НормативКонтрибуцииНормативы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НормативКонтрибуции.Клиенты КАК ВТ_ТабЧастьКлиенты
		|		ПО НормативКонтрибуцииНормативы.ГУИД = ВТ_ТабЧастьКлиенты.ГУИД
		|			И (ВТ_ТабЧастьКлиенты.Ссылка = &Ссылка)
		|ГДЕ
		|	НормативКонтрибуцииНормативы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтавкиНормативовКонтрибуции.Регистратор КАК Регистратор,
		|	СтавкиНормативовКонтрибуции.ДатаНачалаПериодаДействия КАК ДатаНачалаПериодаДействия,
		|	СтавкиНормативовКонтрибуции.ДатаОкончанияПериодаДействия КАК ДатаОкончанияПериодаДействия,
		|	ВТ_ДокументТЧ.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_ДокументыРегистра
		|ИЗ
		|	РегистрСведений.СтавкиНормативовКонтрибуции КАК СтавкиНормативовКонтрибуции
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДокументТЧ КАК ВТ_ДокументТЧ
		|		ПО СтавкиНормативовКонтрибуции.Продукт = ВТ_ДокументТЧ.Продукт
		|			И СтавкиНормативовКонтрибуции.ОфисПродаж = ВТ_ДокументТЧ.ОфисПродаж
		|			И СтавкиНормативовКонтрибуции.УчетноеНаправление = ВТ_ДокументТЧ.УчетноеНаправление
		|			И СтавкиНормативовКонтрибуции.ПунктОтправления = ВТ_ДокументТЧ.ПунктОтправления
		|			И СтавкиНормативовКонтрибуции.ПунктНазначения = ВТ_ДокументТЧ.ПунктНазначения
		|			И СтавкиНормативовКонтрибуции.Клиент = ВТ_ДокументТЧ.Клиент
		|ГДЕ
		|	НЕ СтавкиНормативовКонтрибуции.Регистратор = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДокументыРегистра.Регистратор КАК Регистратор,
		|	ВТ_ДокументыРегистра.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	ВТ_Документ КАК ВТ_Документ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДокументыРегистра КАК ВТ_ДокументыРегистра
		|		ПО ВТ_Документ.ДатаНачалаПериодаДействия >= ВТ_ДокументыРегистра.ДатаНачалаПериодаДействия
		|			И ВТ_Документ.ДатаНачалаПериодаДействия <= ВТ_ДокументыРегистра.ДатаОкончанияПериодаДействия
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ДокументыРегистра.Регистратор,
		|	ВТ_ДокументыРегистра.НомерСтроки
		|ИЗ
		|	ВТ_Документ КАК ВТ_Документ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДокументыРегистра КАК ВТ_ДокументыРегистра
		|		ПО ВТ_Документ.ДатаОкончанияПериодаДействия >= ВТ_ДокументыРегистра.ДатаНачалаПериодаДействия
		|			И ВТ_Документ.ДатаОкончанияПериодаДействия <= ВТ_ДокументыРегистра.ДатаОкончанияПериодаДействия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Итог.Регистратор КАК Регистратор,
		|	ВТ_Итог.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбщегоНазначения.СообщитьПользователю("В строке "+ВыборкаДетальныеЗаписи.НомерСтроки+" обнаружена совпадающая ставка с "+ВыборкаДетальныеЗаписи.Регистратор+". Уточните параметры ставки или замените период действия",,,,Отказ);
	КонецЦикла;	
	
КонецПроцедуры	

#КонецОбласти

#Область Инициализация

#КонецОбласти