
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("Сегодня", ТекущаяДата());
	Если Параметры.Свойство("МножественныйВыбор") И Параметры.МножественныйВыбор = Истина Тогда
		Элементы.Список.МножественныйВыбор = Истина;
	КонецЕсли;
	
	// Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента
	Если Параметры.Свойство("Отбор") Тогда
		
		Если Параметры.Отбор.Свойство("ВариантСобственности")
			И Параметры.Отбор.Свойство("Статус") Тогда
		    // По наличию в отборе полей "Вариант собственности" и "Статус" понимаем, что
			// пришли сюда из формы доккумента "Релиз клиента".
			ЗаполнитьТекстЗапросаДинамическогоСписка();
		КонецЕсли;
	КонецЕсли;
	// Евросиб Фролов)
	
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )
 	//Евросиб - АСуслов 04.07.2023 17:55:09 #67501 локации
	//(
	РаботаСФормамиСервер.УстановитьОграничениеНаВыборПомеченныхНаУдалениеЭлементов(Список);
	//)
	//Евросиб - АСуслов 04.07.2023 17:55:09 #67501 локации

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )




&НаСервере
Процедура ЗаполнитьТекстЗапросаДинамическогоСписка()
    // Евросиб Фролов (06.12.2021 TASK№ №42618, РелизКлиента

	// Меняем текст запроса списка, чтобы в полях выборки появились нужные для отбора поля.
	// В запрос через свойства изменения не стал вносить чтобы не замедлять отрытие формы выбора
	// (т.к. не всегда нужны эти поля).
	ТексЗапроса = Список.ТекстЗапроса;
	
	ТексЗапроса = СтрЗаменить(ТексЗапроса, "ИЗ", "%1 ИЗ");
	ТексЗапроса = ТексЗапроса + "%2";
	
	ПоляВЗапрос = "";
	ТаблицыВЗапрос = "";
	
	ПоляВЗапрос = ПоляВЗапрос + ",
		|	
		|	ЕСТЬNULL(стоки_ТекущиеДанныеСрезПоследних.тек_ВидСобственности, ЗНАЧЕНИЕ(Перечисление.ВариантыСобственности.ПустаяСсылка)) КАК ВариантСобственности,
		|	ЕСТЬNULL(стоки_ТекущиеДанныеСрезПоследних.тек_Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыКТК.ПустаяСсылка)) КАК Состояние";
		
	ТаблицыВЗапрос = ТаблицыВЗапрос + "
		|	
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные.СрезПоследних() КАК стоки_ТекущиеДанныеСрезПоследних
		|		ПО СправочникТЕ.Ссылка = стоки_ТекущиеДанныеСрезПоследних.КТК";

	Список.ТекстЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ТексЗапроса,
		ПоляВЗапрос,
		ТаблицыВЗапрос);
	// Евросиб Фролов)
КонецПроцедуры	
