
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если НЕ (Объект.ВидыСравненияДопУсловий = ПредопределенноеЗначение("Перечисление.ВидыСравненияДопУсловий.ВСписке") И
		НЕ Объект.ВидыСравненияДопУсловий = ПредопределенноеЗначение("Перечисление.ВидыСравненияДопУсловий.НеВСписке")) И
		ЗначениеЗаполнено(ЗначениеУсловия) Тогда
		ТекущийОбъект.ДанныеДляОтборов.Очистить();
		НовСтр = ТекущийОбъект.ДанныеДляОтборов.Добавить();
		НовСтр.ЗначениеДляОтбора = ЗначениеУсловия;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВидСравненияПриИзменении(Элемент)
	
	ВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьЭлементовФормы()

	Если ЗначениеЗаполнено(Объект.ВидыСравненияДопУсловий) И
		(Объект.ВидыСравненияДопУсловий = ПредопределенноеЗначение("Перечисление.ВидыСравненияДопУсловий.ВСписке") ИЛИ
		Объект.ВидыСравненияДопУсловий = ПредопределенноеЗначение("Перечисление.ВидыСравненияДопУсловий.НеВСписке")) Тогда
		Элементы.ДанныеДляОтборов.Видимость = Истина;
		Элементы.ЗначениеУсловия.Видимость = Ложь;
	Иначе
		Элементы.ДанныеДляОтборов.Видимость = Ложь;
		Элементы.ЗначениеУсловия.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеДляОтборовЗначениеДляОтбораНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекД = Элементы.ДанныеДляОтборов.ТекущиеДанные;
	Если Текд = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ТипДополнительногоУсловия) Тогда
		ТипЗначенияУсловия = ПолучитьТипЗнч(Объект.ТипДополнительногоУсловия);
		ТипЗначенияУсловия = СтрЗаменить(ТипЗначенияУсловия,"Справочник","СправочникСсылка");
		ТипЗначенияУсловия = СтрЗаменить(ТипЗначенияУсловия,"Документ","ДокументСсылка");
		ТипЗначенияУсловия = СтрЗаменить(ТипЗначенияУсловия,"Перечисление","ПеречислениеСсылка");
		Элемент.ОграничениеТипа = Новый ОписаниеТипов(ТипЗначенияУсловия);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.ВидыСравненияДопУсловий) И
		НЕ (Объект.ВидыСравненияДопУсловий = ПредопределенноеЗначение("Перечисление.ВидыСравненияДопУсловий.ВСписке") И
		НЕ Объект.ВидыСравненияДопУсловий = ПредопределенноеЗначение("Перечисление.ВидыСравненияДопУсловий.НеВСписке")) И
		Объект.ДанныеДляОтборов.Количество()>0 Тогда
		ЗначениеУсловия = Объект.ДанныеДляОтборов[0].ЗначениеДляОтбора;
	КонецЕсли;
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

&НаКлиенте
Процедура ЗначениеУсловияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.ТипДополнительногоУсловия) Тогда
		ТипЗначенияУсловия = ПолучитьТипЗнч(Объект.ТипДополнительногоУсловия);
		ТипЗначенияУсловия = СтрЗаменить(ТипЗначенияУсловия,"Справочник","СправочникСсылка");
		ТипЗначенияУсловия = СтрЗаменить(ТипЗначенияУсловия,"Документ","ДокументСсылка");
		ТипЗначенияУсловия = СтрЗаменить(ТипЗначенияУсловия,"Перечисление","ПеречислениеСсылка");
		Элементы.ЗначениеУсловия.ОграничениеТипа = Новый ОписаниеТипов(ТипЗначенияУсловия);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТипЗнч(ТипДУ)
	Возврат ТипДУ.ТипЗначенияДУСтрока;
КонецФункции