//Функция возвращает данные морских рейсов по коносаментам или по рейсам  
//
//Параметры:
//	Коносаменты - Массив, Документ.ТранспортныйДокумент - Массив, содержащий ссылки на документы коносаментов или один коносамент 
//  МорскиеРейсы - Массив, Справочник.РейсыМоре - Массив, содержащий ссылки на морские рейсы или один морской рейс  
//	Может быть передано одно из значений выше
//
//Возвращаемое значение:
//	- Соответствие вида "Коносамент" - Структура реквизитов рейса по ресурсам регистра (Если ранее был передан коносамент)
//  - Соответствие вида "МорскойРейс" - Структура реквизитов рейса по ресурсам регистра (Если ранее был передан рейс)
Функция ПолучитьДанныеДляКоносаментов(Коносаменты = Неопределено, МорскиеРейсы = Неопределено) Экспорт 
	
	Если Коносаменты = Неопределено или ТипЗнч(Коносаменты) <> Тип("Массив") Тогда
		МассивКоносаментов = Новый Массив;
		Если Коносаменты <> Неопределено Тогда
			МассивКоносаментов.Добавить(Коносаменты);
		КонецЕсли;
	Иначе
		МассивКоносаментов = Коносаменты;
	КонецЕсли;	
	
	Если МорскиеРейсы = Неопределено или ТипЗнч(МорскиеРейсы) <> Тип("Массив") Тогда
		МассивРейсов = Новый Массив;
		Если МорскиеРейсы <> Неопределено Тогда
			МассивРейсов.Добавить(МорскиеРейсы);
		КонецЕсли;
	Иначе
		МассивРейсов = МорскиеРейсы;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТранспортныйДокумент.МорскойРейс КАК МорскойРейс,
		|	ТранспортныйДокумент.Ссылка КАК Коносамент
		|ПОМЕСТИТЬ ВТ_МорскиеРейсы
		|ИЗ
		|	Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
		|ГДЕ
		|	ТранспортныйДокумент.Ссылка В(&Коносаменты)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	МорскойРейс
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_МорскиеРейсы.Коносамент КАК Коносамент,
		|	ВТ_МорскиеРейсы.МорскойРейс КАК МорскойРейс,
		|	ДанныеМорскихРейсов.ПортОтправления КАК ПортОтправления,
		|	ДанныеМорскихРейсов.МорскойТерминалОтправления КАК МорскойТерминалОтправления,
		|	ДанныеМорскихРейсов.ДатаОтправления КАК ДатаОтправления,
		|	ДанныеМорскихРейсов.ПортНазначения КАК ПортНазначения,
		|	ДанныеМорскихРейсов.МорскойТерминалНазначения КАК МорскойТерминалНазначения,
		|	ДанныеМорскихРейсов.ДатаПрибытия КАК ДатаПрибытия,
		|	ДанныеМорскихРейсов.ДанныеОтличаютсяОтДанныхРейса КАК ДанныеОтличаютсяОтДанныхРейса
		|ИЗ
		|	ВТ_МорскиеРейсы КАК ВТ_МорскиеРейсы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеМорскихРейсов КАК ДанныеМорскихРейсов
		|		ПО ВТ_МорскиеРейсы.МорскойРейс = ДанныеМорскихРейсов.МорскойРейс
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	ДанныеМорскихРейсов.МорскойРейс,
		|	ДанныеМорскихРейсов.ПортОтправления,
		|	ДанныеМорскихРейсов.МорскойТерминалОтправления,
		|	ДанныеМорскихРейсов.ДатаОтправления,
		|	ДанныеМорскихРейсов.ПортНазначения,
		|	ДанныеМорскихРейсов.МорскойТерминалНазначения,
		|	ДанныеМорскихРейсов.ДатаПрибытия,
		|	ДанныеМорскихРейсов.ДанныеОтличаютсяОтДанныхРейса
		|ИЗ
		|	РегистрСведений.ДанныеМорскихРейсов КАК ДанныеМорскихРейсов
		|ГДЕ
		|	ДанныеМорскихРейсов.МорскойРейс В(&МорскиеРейсы)";
	
	Запрос.УстановитьПараметр("Коносаменты", МассивКоносаментов);
	Запрос.УстановитьПараметр("МорскиеРейсы", МорскиеРейсы);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если не РезультатЗапроса.Пустой() Тогда  
		
		Результат = Новый Соответствие;  
		 
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Коносаменты <> Неопределено Тогда
				ДанныеРейса = Новый Структура("МорскойРейс, ПортОтправления, МорскойТерминалОтправления, ДатаОтправления,
									  			    |ПортНазначения, МорскойТерминалНазначения, ДатаОтправления, ДанныеОтличаютсяОтДанныхРейса");
				Ключ = Выборка.Коносамент;
			Иначе
				ДанныеРейса	= Новый Структура("ПортОтправления, МорскойТерминалОтправления, ДатаОтправления,
									  	  	  |ПортНазначения, МорскойТерминалНазначения, ДатаОтправления, ДанныеОтличаютсяОтДанныхРейса");
				Ключ = Выборка.МорскойРейс;
			КонецЕсли; 
			ЗаполнитьЗначенияСвойств(ДанныеРейса,Выборка); 
			Результат.Вставить(Ключ, ДанныеРейса);
		КонецЦикла; 
		Возврат Результат;  
	Иначе	
		Возврат Новый Соответствие;
	КонецЕсли;
	
КонецФункции 

Процедура ДобавитьОбновитьЗаписьДанныхМорскогоРейса(ДанныеРейса) Экспорт
	
    НаборЗаписей = РегистрыСведений.УдалитьДанныеМорскихРейсов.СоздатьНаборЗаписей();   
	НаборЗаписей.Отбор.МорскойРейс.Установить(ДанныеРейса.Ссылка);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() Тогда
		Запись = НаборЗаписей[0];
		Если Запись.ДанныеОтличаютсяОтДанныхРейса Тогда
			Возврат;
		КонецЕсли;
	Иначе	
	    Запись = НаборЗаписей.Добавить();
	КонецЕсли; 
	
	Запись.МорскойРейс					= ДанныеРейса.Ссылка;
	Запись.ПортОтправления				= ДанныеРейса.ПунктОтправления;
	Запись.МорскойТерминалОтправления 	= ДанныеРейса.МестоПогрузки;
	Запись.ДатаОтправления 				= ДанныеРейса.ДатаОтправления;
	Запись.ПортНазначения 				= ДанныеРейса.ПунктНазначения;
	Запись.МорскойТерминалНазначения 	= ДанныеРейса.МестоРазгрузки;
	Запись.ДатаПрибытия 				= ДанныеРейса.ДатаПрибытия;   
	
	НаборЗаписей.Записать();  
	
КонецПроцедуры
