
&НаКлиенте
Процедура ВставитьИзEXCEL(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВводаРасписания", Этаформа);
	ОткрытьФорму("Справочник.ТабельныеРасписанияРЖД.Форма.ФормаВставкиРасписанияИзEXCEL",,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВводаРасписания(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	Для каждого Стр из Параметр1 Цикл
		
		НСтр = Объект.Расписание.Добавить();
		НСтр.Станция = Стр.Станция;
		НСтр.ВремяОтправления = Стр.ВремяОтправления;
		НСтр.ВремяПрибытия = Стр.ВремяПрибытия;
		
	КонецЦикла;
	
	Для Сч = 0 По Объект.Расписание.Количество()-2 Цикл
		
		Отпр = Объект.Расписание[Сч].ВремяОтправления;
		Приб = Объект.Расписание[Сч+1].ВремяПрибытия;
		Объект.Расписание[Сч].ДоСледующейСтанции = (?(Приб < Отпр, Приб+24*3600, Приб) - Отпр) / 3600;
		
	КонецЦикла;
	
	ОбновитьИтогоВремя();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтогоВремя()
	
	Объект.ВсегоВПутиЧ = 0;
	Для каждого Стр из Объект.Расписание Цикл
		Объект.ВсегоВПутиЧ = Объект.ВсегоВПутиЧ + Стр.ДоСледующейСтанции;
		Если ЗначениеЗаполнено(Стр.ВремяПрибытия) И ЗначениеЗаполнено(Стр.ВремяОтправления) И Стр.ВремяПрибытия <> Стр.ВремяОтправления Тогда
			Отпр = Стр.ВремяПрибытия;
			Приб = Стр.ВремяОтправления;
			Объект.ВсегоВПутиЧ = Объект.ВсегоВПутиЧ + (?(Приб < Отпр, Приб+24*3600, Приб) - Отпр) / 3600;
		КонецЕсли;
	КонецЦикла;
	Элементы.РасписаниеДоСледующейСтанции.ТекстПодвала = Формат(Объект.ВсегоВПутиЧ, "ЧДЦ=2");
	
КонецПроцедуры


&НаКлиенте
Процедура РасписаниеПриИзменении(Элемент)
	
	Если Объект.Расписание.Количество() = 0 Тогда
		Объект.ПунктОтправления = неопределено;
		Объект.ПунктНазначения = неопределено;
	Иначе
		Объект.ПунктОтправления = Объект.Расписание[0].Станция;
		Объект.ПунктНазначения = Объект.Расписание[Объект.Расписание.Количество()-1].Станция;
	КонецЕсли;
	ОбновитьИтогоВремя();
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.РасписаниеДоСледующейСтанции.ТекстПодвала = Формат(Объект.ВсегоВПутиЧ, "ЧДЦ=2");
	
КонецПроцедуры


&НаКлиенте
Процедура РасписаниеВремяЛЮБОЕПриИзменении(Элемент)
	
	Для Сч = 0 По Объект.Расписание.Количество()-2 Цикл
		
		Отпр = Объект.Расписание[Сч].ВремяОтправления;
		Приб = Объект.Расписание[Сч+1].ВремяПрибытия;
		Объект.Расписание[Сч].ДоСледующейСтанции = (?(Приб < Отпр, Приб+24*3600, Приб) - Отпр) / 3600;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПосчитатьПробегиЧерезRailTariff(Команда)
	
	СоответствиеСтанцийКодам = Новый Соответствие;
	Для каждого Стр из Объект.Расписание Цикл
		Если СоответствиеСтанцийКодам.Получить(Стр.Станция) = неопределено Тогда СоответствиеСтанцийКодам.Вставить(Стр.Станция,1); КонецЕсли;
	КонецЦикла;
	
	СоответствиеСтанцийКодам = СоответствиеСтанцийКодам_сервер(СоответствиеСтанцийКодам);
	
	Для Сч = 0 по Объект.Расписание.Количество()-2 Цикл
		
		Объект.Расписание[сч].РасстояниеДоСледующейСтанции = РейлТариф_клиент.ПолучитьРасстояние(СоответствиеСтанцийКодам[Объект.Расписание[сч].Станция], СоответствиеСтанцийКодам[Объект.Расписание[сч+1].Станция]);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоответствиеСтанцийКодам_сервер(СоответствиеСтанцийКодам)
	
	Результат = Новый Соответствие;
	
	Для каждого Стр из СоответствиеСтанцийКодам Цикл
		Результат.Вставить(Стр.Ключ, Локации_сервер.ПолучитьКодСтанции(Стр.Ключ, 6));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

