&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДанныеКлассификатора = ПолучитьДанныеКлассификатора();
	Для каждого СтрКлассиф Из  ДанныеКлассификатора Цикл
		НовСтр = Классификатор.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,СтрКлассиф); 				
	КонецЦикла; 
	
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

 

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	Для каждого Элемент Из Классификатор  Цикл
		 Элемент.Выбран = Истина;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура СтятьФлажки(Команда)
	Для каждого Элемент Из Классификатор  Цикл
		 Элемент.Выбран = Ложь;
	КонецЦикла; 
КонецПроцедуры    

&НаСервере
Функция  ПолучитьДанныеКлассификатора()

	МакетНастроек =  Справочники.э_ТипыКонтейнеров.ПолучитьМакет("КлассификаторТиповКонтейнеров");
	
	ДанныеКлассификатора	= Новый ТаблицаЗначений;
	ИндексКолонок	= 1;
	ИндексСтрок		= 1; 	
	
	//Добавляем колонки
	ТекущаяОбласть	= МакетНастроек.Область(ИндексСтрок, ИндексКолонок);
	Пока  ЗначениеЗаполнено(ТекущаяОбласть.Текст) Цикл  		
		ДанныеКлассификатора.Колонки.Добавить(ТекущаяОбласть.Текст);                                                                   			
		
		ИндексКолонок 	= ИндексКолонок + 1;
		ТекущаяОбласть 	= МакетНастроек.Область(ИндексСтрок, ИндексКолонок); 		
	КонецЦикла;
	
	//Добавляем строки
	ИндексСтрок = 2;
	ТекущаяОбласть 	= МакетНастроек.Область(ИндексСтрок, 1);
	Пока ЗначениеЗаполнено(ТекущаяОбласть.Текст) Цикл		
		
		НовыяСтрока = ДанныеКлассификатора.Добавить();
		
		j = 1;
		Для каждого Колонка Из ДанныеКлассификатора.Колонки Цикл
			НовыяСтрока[Колонка.Имя] = МакетНастроек.Область(ИндексСтрок, j).Текст;
			j = j + 1;
		КонецЦикла;     		  			
		                                                                       			
		ИндексСтрок 	= ИндексСтрок + 1;  
		ТекущаяОбласть 	= МакетНастроек.Область(ИндексСтрок, 1); 		
	КонецЦикла;
	
	Возврат ДанныеКлассификатора;  	
	
КонецФункции

&НаКлиенте
Процедура Отмена(Команда)  	
	Закрыть();  	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ОбработкаПодбораВыполнена = Истина;
	РезультатПодбора = ОбработатьРезультатыПодбораНаСервере(ОбработкаПодбораВыполнена);
	
	Если ОбработкаПодбораВыполнена Тогда
		Закрыть(РезультатПодбора);
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбработатьРезультатыПодбораНаСервере(ОбработкаПодбораВыполнена)
	
	КоличествоНовыхЭлементов = 0;
	МассивНовыхЭлементов     = Новый Массив;
	
	НачатьТранзакцию();
	
	Попытка
		
		Для каждого Строка Из Классификатор Цикл  					
			
			Если Строка.Выбран Тогда
				
				НовыйТипКонтейнера   	= Ложь;
				ТипКонтейнераСсылка  	= Справочники.э_ТипыКонтейнеров.НайтиПоРеквизиту("ISO", Строка.ISO);
				
				Если ЗначениеЗаполнено(ТипКонтейнераСсылка) Тогда
					СправочникОбъект 	= ТипКонтейнераСсылка.ПолучитьОбъект();
				Иначе
					НовыйТипКонтейнера 	= Истина;
					СправочникОбъект 	= Справочники.э_ТипыКонтейнеров.СоздатьЭлемент();  					
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(СправочникОбъект, Строка);
				СправочникОбъект.Наименование = Строка.Тип;
											
				СправочникОбъект.Записать();
				
				Если НовыйТипКонтейнера Тогда
					КоличествоНовыхЭлементов = КоличествоНовыхЭлементов + 1;  					
					МассивНовыхЭлементов.Добавить(СправочникОбъект.Ссылка);
				КонецЕсли;
				
			КонецЕсли; 			
						
		КонецЦикла;	
		
		Если КоличествоНовыхЭлементов = 0 Тогда
			ОбработкаПодбораВыполнена = Ложь;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		КоличествоНовыхЭлементов  = 0;
		ОбработкаПодбораВыполнена = Ложь;
		
		ТекстСообщения = НСтр("ru = 'Не удалось подобрать контейнер из классификатора.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		КодОсновногоЯзыка = ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка(); // Для записи события в журнал регистрации.
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Подбор контейнер из классификатора.'", КодОсновногоЯзыка),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
	РезультатПодбора = Новый Структура("КоличествоНовыхЭлементов, НовыеЭлементы", КоличествоНовыхЭлементов,
		МассивНовыхЭлементов);
	
	Возврат РезультатПодбора;
	
КонецФункции
