Функция ПолучитьПараметрыФормированияФинансовыхДокументов(Контрагент, ВидПеревозки = Неопределено, ПовагонныеОтправки = Ложь, Документ = Неопределено, ОбязательноеЗаполнениеРеестра = Неопределено) Экспорт
	Результат = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФормированиеФинДокументов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Правило
	|ИЗ
	|	Справочник.ФормированиеФинДокументов КАК ФормированиеФинДокументов
	|ГДЕ
	|	ФормированиеФинДокументов.Контрагент = &Контрагент
	|	И ВЫБОР КОГДА &ПравилоДляПовагонныхОтправок ТОГДА ИСТИНА ИНАЧЕ ФормированиеФинДокументов.ВидПеревозки = &ВидПеревозки КОНЕЦ  
	////Евросиб - АСуслов 06.04.2022 10:20:19 #40618
	////(
	////ДИТ, Беляев СЮ, Ticket#0257828, 24-01-2022, начало 	
	//|	И ВЫБОР КОГДА &ОбязательноеЗаполнениеРеестра <> НЕОПРЕДЕЛЕНО ТОГДА ФормированиеФинДокументов.ОбязательноеЗаполнениеРеестра = &ОбязательноеЗаполнениеРеестра ИНАЧЕ ИСТИНА КОНЕЦ
	////ДИТ, Беляев СЮ, Ticket#0257828, 24-01-2022, конец 
	////)
	////Евросиб - АСуслов 06.04.2022 10:20:28 #40618
	|	И ФормированиеФинДокументов.ПравилоДляПовагонныхОтправок = &ПравилоДляПовагонныхОтправок
	|	И НЕ ФормированиеФинДокументов.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	*,1 КАК Приоритет,
	|   ВЫБОР КОГДА ФормированиеФинДокументов.ИспользоватьРасширенныеПараметры ТОГДА ФормированиеФинДокументов.ОкруглениеКурса ИНАЧЕ Неопределено КОНЕЦ КАК ОкруглениеКурса
	|ПОМЕСТИТЬ ВТ_Общий
	|ИЗ
	|	РегистрСведений.ФормированиеФинДокументов КАК ФормированиеФинДокументов
	|ГДЕ
	|	ФормированиеФинДокументов.Документ = &Документ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	*,2,
	|   ВЫБОР КОГДА ФормированиеФинДокументов.ИспользоватьРасширенныеПараметры ТОГДА ФормированиеФинДокументов.ОкруглениеКурса ИНАЧЕ Неопределено КОНЕЦ
	|ИЗ
	|	РегистрСведений.ФормированиеФинДокументов КАК ФормированиеФинДокументов
	|ГДЕ
	|	ФормированиеФинДокументов.Документ В
	|			(ВЫБРАТЬ
	|				т.Ссылка
	|			ИЗ
	|				ВТ_Правило КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	*
	|ИЗ
	|	ВТ_Общий КАК ВТ_Общий
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Общий.Приоритет";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	//Евросиб - АСуслов 03.01.2022 15:48:58 #0255988
	//(
	Запрос.УстановитьПараметр("ВидПеревозки", ?(ВидПеревозки = Неопределено, Справочники.ВидыПеревозок.ПустаяСсылка(), ВидПеревозки));
	//)
	//Евросиб - АСуслов 03.01.2022 15:48:59 #0255988
	Запрос.УстановитьПараметр("ПравилоДляПовагонныхОтправок", ПовагонныеОтправки);
	Запрос.УстановитьПараметр("Документ", Документ); 
	////Евросиб - АСуслов 06.04.2022 10:20:44 #40618
	////(
	////ДИТ, Беляев СЮ, Ticket#0257828, 24-01-2022, начало 
	//Запрос.УстановитьПараметр("ОбязательноеЗаполнениеРеестра", ОбязательноеЗаполнениеРеестра);
	////ДИТ, Беляев СЮ, Ticket#0257828, 24-01-2022, конец 
	////)
	////Евросиб - АСуслов 06.04.2022 10:20:50 #40618
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выгрузить()[0];
	КонецЕсли; 
	Возврат Результат;
	
КонецФункции     

//ДИТ, Беляев СЮ, Ticket#0288734, 11-10-2022, начало
Процедура ДобавитьПараметрыФормированияФинансовыхДокументовВТаблицу(ТаблицаСвязьУчетныхЕдиниц) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ ВТ_ТаблицаСвязьУчетныхЕдиниц
	|ИЗ
	|	&ТаблицаСвязьУчетныхЕдиниц КАК ТаблицаСвязьУчетныхЕдиниц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСвязьУчетныхЕдиниц.*,
	|	РСФормированиеФинДокументов.ВидСтавки КАК ДокументФФД_ВидСтавки
	|ИЗ
	|	ВТ_ТаблицаСвязьУчетныхЕдиниц КАК ВТ_ТаблицаСвязьУчетныхЕдиниц
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФормированиеФинДокументов КАК РСФормированиеФинДокументов
	|			ПО РСФормированиеФинДокументов.Документ = ВТ_ТаблицаСвязьУчетныхЕдиниц.ДокументФФД
	//Евросиб - АСуслов 22.05.2023 17:22:10 #0318556
	//(
	|УПОРЯДОЧИТЬ ПО НомерСтроки
	//)
	//Евросиб - АСуслов 22.05.2023 17:22:12 #0318556
	|";
	
	Запрос.УстановитьПараметр("ТаблицаСвязьУчетныхЕдиниц", ТаблицаСвязьУчетныхЕдиниц);
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаСвязьУчетныхЕдиниц = РезультатЗапроса.Выгрузить();
	
КонецПроцедуры
//ДИТ, Беляев СЮ, Ticket#0288734, 11-10-2022, конец

//Евросиб(ДИТ), Беляев СЮ, US 111815 / TA 111816, 23-06-2025, начало
Функция ПолучитьТаблицуФормированияПравилДляНабора(ТаблицаКлиентВидПеревозки, ПовагонныеОтправки = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаКлиентВидПеревозки.Клиент КАК Клиент,
	|	ТаблицаКлиентВидПеревозки.ВидПеревозки КАК ВидПеревозки
	|ПОМЕСТИТЬ ВТ_КлиентВидПеревозки
	|ИЗ
	|	&ТаблицаКлиентВидПеревозки КАК ТаблицаКлиентВидПеревозки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФормированиеФинДокументов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Правило
	|ИЗ
	|	ВТ_КлиентВидПеревозки КАК ВТ_КлиентВидПеревозки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФормированиеФинДокументов КАК ФормированиеФинДокументов
	|		ПО (ФормированиеФинДокументов.Контрагент = ВТ_КлиентВидПеревозки.Клиент)
	|			И (ФормированиеФинДокументов.ПравилоДляПовагонныхОтправок = &ПравилоДляПовагонныхОтправок)
	|			И (ВЫБОР
	|				КОГДА &ПравилоДляПовагонныхОтправок
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ФормированиеФинДокументов.ВидПеревозки = ВТ_КлиентВидПеревозки.ВидПеревозки
	|			КОНЕЦ)
	|			И (НЕ ФормированиеФинДокументов.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	*,
	|	ВЫБОР
	|		КОГДА ФормированиеФинДокументов.ИспользоватьРасширенныеПараметры
	|			ТОГДА ФормированиеФинДокументов.ОкруглениеКурса
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ОкруглениеКурса
	|ИЗ
	|	РегистрСведений.ФормированиеФинДокументов КАК ФормированиеФинДокументов
	|ГДЕ
	|	ФормированиеФинДокументов.Документ В
	|			(ВЫБРАТЬ
	|				т.Ссылка
	|			ИЗ
	|				ВТ_Правило КАК т)";
	
	Запрос.УстановитьПараметр("ТаблицаКлиентВидПеревозки", ТаблицаКлиентВидПеревозки);
	Запрос.УстановитьПараметр("ПравилоДляПовагонныхОтправок", ПовагонныеОтправки);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 111815 / TA 111816, 23-06-2025, конец

#Область ОбработчикиСобытий

//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля = Новый Массив;
	Поля.Добавить("Наименование");
	Поля.Добавить("Код");
	
КонецПроцедуры 
//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --

//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 ++
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = "" + Данные.Наименование + " (код " + Данные.Код + ")";
	
КонецПроцедуры    
//ДИТ, Беляев СЮ, Ticket#0252121, 22-12-2021 --

//ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, начало
//Функция предназначена для получения значения реквизита ОкруглениеКурса с учетом реквизита ИспользоватьРасширенныеПараметры
//Используется когда ссылка на Правило есть, например в документе Счет на оплату или РТУ
Функция ПолучитьЗначениеОкругленияКурсаИзПравил( ПравилоФормирования ) Экспорт
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ФормированиеФинДокументов.ИспользоватьРасширенныеПараметры
		|			ТОГДА ФормированиеФинДокументов.ОкруглениеКурса
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ОкруглениеКурса
		|ИЗ
		|	Справочник.ФормированиеФинДокументов КАК ФормированиеФинДокументов
		|ГДЕ
		|	ФормированиеФинДокументов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ПравилоФормирования);
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ОкруглениеКурса;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
//ДИТ, Беляев СЮ, BUG 76518 / TA 76823, 03-11-2023, конец

#КонецОбласти