
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	Владелец = Контрагент;
	Если Не ПометкаУдаления Тогда
		ПроверитьДублиПравил(Отказ);
	КонецЕсли;
	
	// Евросиб Фролов (09.03.2022 Task №44927
	Если ИспользоватьРасширенныеПараметры
		И ВидСтавки = Перечисления.ФрахтФинДокументы_ВидСтавки.ОтдельныеСтавки
		И Не ЗначениеЗаполнено(ВидГруппировкиФрахта) Тогда
		ОбщегоНазначения.СообщитьПользователю(
					"Не заполнен вид группировки фрахта (обязательно к заполнению если используются расширенные параметры и вид ставки указан ""Отдельно документ на всю сушу, отдельно на фрахт по группировке"")",
					,
					"ВидГруппировкиФрахта",
					"Объект", Отказ);
	КонецЕсли;	
	// Евросиб Фролов)
	
КонецПроцедуры

Процедура ПроверитьДублиПравил(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФормированиеФинДокументов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ФормированиеФинДокументов КАК ФормированиеФинДокументов
	|ГДЕ
	|	ФормированиеФинДокументов.Контрагент = &Контрагент
	|	И ФормированиеФинДокументов.ВидПеревозки = &ВидПеревозки
	|	И ФормированиеФинДокументов.ПравилоДляПовагонныхОтправок = &ПравилоДляПовагонныхОтправок
	|	И НЕ ФормированиеФинДокументов.Ссылка = &Ссылка
	|	И НЕ ФормированиеФинДокументов.ПометкаУдаления";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ВидПеревозки", ВидПеревозки);
	Запрос.УстановитьПараметр("ПравилоДляПовагонныхОтправок", ПравилоДляПовагонныхОтправок);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Существует правило с параметрами Клиент «%1», Вид перевозки «%2», Правило для повагонных отправок = «%3»",
															Контрагент, ВидПеревозки, ПравилоДляПовагонныхОтправок));
	КонецЕсли;
	
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	//Евросиб - АСуслов 26.11.2021 16:36:23 #35693
	//(
	РегистрыСведений.ФормированиеФинДокументов.ЗаписатьПараметрыФормированияФинДокументов(Ссылка);
	//)
	//Евросиб - АСуслов 26.11.2021 16:36:24 #35693
КонецПроцедуры

