
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Автор 		= Пользователи.ТекущийПользователь();
	ЦФО 		= Автор.ЦФО;
	Создано 	= ТекущаяДата();
	Организация = Константы.ОсновнаяОрганизация.Получить();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПланПродаж") Тогда
		// Заполнение шапки
		ВариантПланаПродаж 	= ДанныеЗаполнения.ВариантПланаПродаж;
		Организация 		= ДанныеЗаполнения.Организация;
		ДокументОснование 	= ДанныеЗаполнения.Ссылка;
		ДатаНачала 			= ДанныеЗаполнения.ДатаНачала;
		ДатаОкончания 		= ДанныеЗаполнения.ДатаОкончания;
		Подразделение		= ДанныеЗаполнения.Подразделение;
		ЦФО					= ДанныеЗаполнения.ЦФО;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	
	Для каждого Стр из Поступления Цикл
		Стр.КлючСтроки = "";
	КонецЦикла;

	Для каждого Стр из Списания Цикл
		Стр.КлючСтроки = "";
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Редактор 	= Пользователи.ТекущийПользователь();
	Изменено 	= ТекущаяДата();
	
	Для каждого Стр из Поступления Цикл
		Если НЕ ЗначениеЗаполнено(Стр.КлючСтроки) Тогда
			Стр.КлючСтроки = Строка(Новый УникальныйИдентификатор);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Стр из Списания Цикл
		Если НЕ ЗначениеЗаполнено(Стр.КлючСтроки) Тогда
			Стр.КлючСтроки = Строка(Новый УникальныйИдентификатор);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
