Процедура ИсключитьКТКИзСделкиV2_Сделка_Нажатие(ЭтаФорма) Экспорт
	
	Для каждого Стр из ЭтаФорма.Объект.СвязьУчетныхЕдиниц Цикл
		Стр.БезЖДН = Ложь;
	КонецЦикла;
	
	Элемент_КнопкаОК = ЭтаФорма.Элементы.СвязьУчетныхЕдиницИсключениеКТКИзСделкиОК;
	Элемент_КнопкаИсключить = ЭтаФорма.Элементы.СвязьУчетныхЕдиницИсключениеКТКИзСделки;
	
	Если Элемент_КнопкаОК.Видимость = Истина Тогда
		
		ЭтаФорма.Элементы.СвязьУчетныхЕдиницБезЖДН.Видимость = Ложь;
		Элемент_КнопкаОК.Видимость = Ложь;
		Элемент_КнопкаИсключить.Заголовок = "Исключить КТК из сделки";
		
		ЭтаФорма.Элементы.СвязьУчетныхЕдиницИсключениеКТКУстановитьВсе.Видимость = Ложь;
		ЭтаФорма.Элементы.СвязьУчетныхЕдиницИсключениеКТКСнятьВсе.Видимость = Ложь;
		
	Иначе
		
		ЭтаФорма.Элементы.СвязьУчетныхЕдиницБезЖДН.Видимость = Истина;
		Элемент_КнопкаОК.Видимость = Истина;
		Элемент_КнопкаИсключить.Заголовок = "Исключить КТК из сделки (отмена)";
		
		
		ЭтаФорма.Элементы.СвязьУчетныхЕдиницИсключениеКТКУстановитьВсе.Видимость = Истина;
		ЭтаФорма.Элементы.СвязьУчетныхЕдиницИсключениеКТКСнятьВсе.Видимость = Истина;
		
	КонецЕсли;
	////Евросиб - АСуслов 21.10.2021 12:00:02 #37750
	////(
	//ЭтаФорма.Записать();
	////)
	////Евросиб - АСуслов 21.10.2021 12:00:16 #37750
КонецПроцедуры

Процедура ИсключитьКТКИзСделкиV2_ок_Сделка_Нажатие(ЭтаФорма) Экспорт
	
	Договор = неопределено;
	МассивУникальныхЗаявок = Новый Массив;
	//МассивИдентификаторовДляПроверкиПривязанныхПТУ = Новый Массив; //ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, закомментировал (не используется)
	
	// Евросиб Фролов (15.04.2022 Task №48577
	//МассивГУИДЗаявокДляЗапретаПереноса = Новый Массив; //ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, закомментировал (не используется)
	Для Каждого Стр из ЭтаФорма.Объект.СвязьУчетныхЕдиниц Цикл
		Если Стр.БезЖДН = Истина И Стр.ГотовоКВыставлению Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Ошибка: для КТК %1 в строке %2 установлен признак ""Готово к выставлению"". Нельзя переносить КТК, которые отмечены как готовые к выставлению", Стр.Контейнер, Стр.НомерСтроки));
			Стр.БезЖДН = Ложь;
			//МассивГУИДЗаявокДляЗапретаПереноса.Добавить(Стр.ГУИДСтрокиЗаявки); //ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, закомментировал (не используется)
		КонецЕсли;	
	КонецЦикла;
	// Евросиб Фролов)
	
	Для каждого Стр из ЭтаФорма.Объект.СвязьУчетныхЕдиниц Цикл
		//Если Стр.БезЖДН = Истина И МассивУникальныхЗаявок.Найти(Стр.Заявка) = неопределено Тогда
		//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, начало
		Если Стр.БезЖДН = Истина Тогда
		//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, конец
			//Если Стр.ДокументыСформированы Тогда
			//ДИТ, Беляев СЮ, BUG 57430/TA 57684, 28-09-2022, начало (реквизит СформированыЗакрывающиеДокументы учитывает корректировки в Доходах)
			Если Стр.СформированыЗакрывающиеДокументы Тогда
			//ДИТ, Беляев СЮ, BUG 57430/TA 57684, 28-09-2022, начало
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Ошибка: для исключения КТК %1 по строке %2 требуется скорректировать сформированный учетный документ", Стр.Контейнер, Стр.НомерСтроки));
				Стр.БезЖДН = Ложь;
				//МассивГУИДЗаявокДляЗапретаПереноса.Добавить(Стр.ГУИДСтрокиЗаявки); //ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, закомментировал (не используется)
				Продолжить;
			КонецЕсли; 
			Если НЕ ЗначениеЗаполнено(Стр.Заявка) Тогда
				//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, начало
				Стр.БезЖДН = Ложь;
				//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, конец
				Сообщить("Ошибка: в строке " + Стр.НомерСтроки + " по КТК " + Стр.Контейнер + " отсутствует заявка!");
				Продолжить;
			КонецЕсли;
			//МассивИдентификаторовДляПроверкиПривязанныхПТУ.Добавить(Стр.ГУИД);
			//МассивУникальныхЗаявок.Добавить(Стр.Заявка);
			//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, начало
			Если МассивУникальныхЗаявок.Найти(Стр.Заявка) = неопределено Тогда
				МассивУникальныхЗаявок.Добавить(Стр.Заявка);
			КонецЕсли;
			//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, конец
			Договор = Стр.Договор;
		КонецЕсли;
	КонецЦикла;
	//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, начало
	Если МассивУникальныхЗаявок.Количество() > 1 Тогда
		ПоказатьПредупреждение(, "Разрешено выбирать КТК только из одной заявки!");
		Возврат;
	КонецЕсли;
	//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, конец
	
	// Евросиб Фролов (15.04.2022 Task №48577, отключена эта проверка
	//ИдентификаторыСУЕ = УдалениеКТКИзСделки_Сервер.ПолучитьСтрокиРасходовПоСУЕСПривязаннымиУчДокументами(МассивИдентификаторовДляПроверкиПривязанныхПТУ, ЭтаФорма.Объект); //ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, закомментировал (не используется)
	//Для каждого Стр из ЭтаФорма.Объект.СвязьУчетныхЕдиниц Цикл
	//	Если ИдентификаторыСУЕ.Найти(Стр.ГУИД) <> Неопределено Тогда
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Ошибка: К исключаемому контейнеру %1 по строке %2 привязаны расходы.
	//																	|Необходимо обратиться в бэк-офис за удалением строк расходов", Стр.Контейнер, Стр.НомерСтроки));
	//		Стр.БезЖДН = Ложь;
	//	КонецЕсли; 
	//КонецЦикла;
	// Евросиб Фролов)
	
	////Евросиб - АСуслов 13.12.2022 17:08:41 #62448
	////(
	//// Евросиб Фролов (24.03.2022 US №40767, Task №40768
	//// Запретить исключение КТК из состава поезда, если у них заполнено поле
	//// "Перенесенная сделка" и поле "Строка расходов в перенесенной сделке" в расходной части экономики сделки.
	//ИдентификаторыКТК = УдалениеКТКИзСделки_Сервер.ПолучитьКТКСРасходамиИзДругойСделки(МассивИдентификаторовДляПроверкиПривязанныхПТУ, ЭтаФорма.Объект);
	//КоличествоКТК = ИдентификаторыКТК.Количество(); 
	//ОтключитьКнопкиКромеПереносаВДругуюСделку = Ложь;
	//Если КоличествоКТК > 0 Тогда
	//	//ШаблонСообщения = "Исключение контейнеров %1 невозможно. К контейнерам привязаны расходы, перенесенные из другой сделки. Обратитесь в бэк-офис для удаления/переноса строк расходов.";
	//	ШаблонСообщения = "К контейнерам %1 привязаны расходы, перенесенные из другой сделки. Доступен только режим переноса КТК в другую сделку.";
	//	ОтключитьКнопкиКромеПереносаВДругуюСделку = Истина;
	//	Если КоличествоКТК = 1 Тогда
	//		ШаблонСообщения = СтрЗаменить(ШаблонСообщения, "контейнеров", "контейнера");
	//		ШаблонСообщения = СтрЗаменить(ШаблонСообщения, "контейнерам", "контейнеру");
	//	КонецЕсли;	
	//	ПредставлениеКонтейнеров = "";
	//	Для Каждого Стр из ЭтаФорма.Объект.СвязьУчетныхЕдиниц Цикл
	//		Если ИдентификаторыКТК.Найти(Стр.ГУИД) <> Неопределено Тогда
	//			ПредставлениеКонтейнеров = ПредставлениеКонтейнеров + ?(ПустаяСтрока(ПредставлениеКонтейнеров), "", ", ") + Стр.Контейнер;
	//			//Евросиб - АСуслов 13.01.2023 12:21:50 #64069
	//			//(
	//			//Стр.БезЖДН = Ложь; 
	//			//МассивГУИДЗаявокДляЗапретаПереноса.Добавить(Стр.ГУИДСтрокиЗаявки);
	//			//)
	//			//Евросиб - АСуслов 13.01.2023 12:21:52 #64069
	//		КонецЕсли; 
	//	КонецЦикла;
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(ШаблонСообщения, ПредставлениеКонтейнеров));
	//КонецЕсли;
	//// Евросиб Фролов)  
	////Для каждого Стр из ЭтаФорма.Объект.СвязьУчетныхЕдиниц Цикл
	////	Если МассивГУИДЗаявокДляЗапретаПереноса.Найти(Стр.ГУИДСтрокиЗаявки) <> Неопределено Тогда
	////		Стр.БезЖДН = Ложь;
	////	КонецЕсли;	
	////КонецЦикла;
	////)
	////Евросиб - АСуслов 13.12.2022 17:08:42 #62448
	
	//МассивСтрокИсключаемыхКТК = ЭтаФорма.Объект.СвязьУчетныхЕдиниц.НайтиСтроки(Новый Структура("БезЖДН", Истина));
	//Если МассивУникальныхЗаявок.Количество() = 0 
	//	//ИЛИ ИдентификаторыСУЕ.Количество() = МассивИдентификаторовДляПроверкиПривязанныхПТУ.Количество() // Евросиб Фролов (15.04.2022 Task №48577, отключена эта проверка
	//	ИЛИ МассивСтрокИсключаемыхКТК.Количество() = 0 Тогда
	//	ПоказатьПредупреждение(, "Не выбраны строки для исключения КТК из заявок!");
	//ИначеЕсли МассивУникальныхЗаявок.Количество() > 1 Тогда
	//	ПоказатьПредупреждение(, "Разрешено выбирать КТК только из одной заявки!");
	//Иначе                                                                       
	//	ДополнительныеПараметры = Новый Структура;
	//	ДополнительныеПараметры.Вставить("МассивСтрокИсключаемыхКТК", МассивСтрокИсключаемыхКТК);
	//	//Евросиб - АСуслов 15.12.2022 16:52:26 #62448
	//	//(
	//	//ДополнительныеПараметры.Вставить("ОтключитьКнопкиКромеПереносаВДругуюСделку", ОтключитьКнопкиКромеПереносаВДругуюСделку);
	//	//)
	//	//Евросиб - АСуслов 15.12.2022 16:52:27 #
	//	ДополнительныеПараметры.Вставить("ЭтаФорма", ЭтаФорма);
	//	ДополнительныеПараметры.Вставить("Договор", Договор);
	//	ОпОп = Новый ОписаниеОповещения("ПодтверждениеИсключенияКТКИзСделки", УдалениеКТКИзСделки_Клиент, ДополнительныеПараметры);
	//	ПоказатьВопрос(ОпОп, "Выбранные контейнеры будут исключены из сделки. Сделка будет автоматически записана. Продолжить?", РежимДиалогаВопрос.ДаНет);
	//	
	//КонецЕсли;
	
	//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, начало
	МассивСтрокИсключаемыхКТК = ЭтаФорма.Объект.СвязьУчетныхЕдиниц.НайтиСтроки(Новый Структура("БезЖДН", Истина));
	Если МассивУникальныхЗаявок.Количество() = 0 
		ИЛИ МассивСтрокИсключаемыхКТК.Количество() = 0 Тогда
			ПоказатьПредупреждение(, "Не выбраны строки для исключения КТК из заявок!");
	   	Возврат;
	КонецЕсли;
																													
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("МассивСтрокИсключаемыхКТК", МассивСтрокИсключаемыхКТК);
	ДополнительныеПараметры.Вставить("ЭтаФорма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("Договор", Договор);
	ДополнительныеПараметры.Вставить("МассивУникальныхЗаявок", МассивУникальныхЗаявок);
	ОпОп = Новый ОписаниеОповещения("ПодтверждениеИсключенияКТКИзСделки", УдалениеКТКИзСделки_Клиент, ДополнительныеПараметры);
	ПоказатьВопрос(ОпОп, "Выбранные контейнеры будут исключены из сделки. Сделка будет автоматически записана. Продолжить?", РежимДиалогаВопрос.ДаНет);
	//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, конец
	
КонецПроцедуры  

Процедура ПодтверждениеИсключенияКТКИзСделки(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 <> КодВозвратаДиалога.Да тогда
		Возврат;
	КонецЕсли;
	МассивДляСпискаКТК = Новый Массив;
	Для каждого СтрокаИсключаемыхКТК Из П2.МассивСтрокИсключаемыхКТК Цикл
		МассивДляСпискаКТК.Добавить(СтрокаИсключаемыхКТК.Контейнер);
	КонецЦикла;
	СписокКТК = СтрСоединить(МассивДляСпискаКТК, "; ");
	ТекстВопроса = СтрШаблон("Указанные КТК будут удалены из сделки (%1). Выберите способ удаления:",СписокКТК);
	//ОпОп = Новый ОписаниеОповещения("РешениеОМетодеИсключенияКТКИзСделки_Сделка_ФормаИсключенияКТКИзСделки_Нажатие", УдалениеКТКИзСделки_Клиент);
	//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, начало
	ОпОп = Новый ОписаниеОповещения("РешениеОМетодеИсключенияКТКИзСделки_Сделка_ФормаИсключенияКТКИзСделки_Нажатие", УдалениеКТКИзСделки_Клиент, П2);
	//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, конец
	
	//Евросиб - АСуслов 15.12.2022 16:54:17 #62448
	//(
	//ОткрытьФорму("Документ.Сделка.Форма.ФормаИсключенияКТКИзСделки", Новый Структура("ТекстВопроса, ЭтаФормаЪ, Договор, ОтключитьКнопкиКромеПереносаВДругуюСделку", ТекстВопроса, П2.ЭтаФорма.УникальныйИдентификатор, П2.Договор, П2.ОтключитьКнопкиКромеПереносаВДругуюСделку),П2.ЭтаФорма,П2.ЭтаФорма.УникальныйИдентификатор,,, ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//)
	//Евросиб - АСуслов 15.12.2022 16:54:19 #62448
	//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, начало
	ОткрытьФорму("Документ.Сделка.Форма.ФормаИсключенияКТКИзСделки", Новый Структура("ТекстВопроса, ЭтаФормаЪ, Договор", ТекстВопроса, П2.ЭтаФорма.УникальныйИдентификатор, П2.Договор),П2.ЭтаФорма,П2.ЭтаФорма.УникальныйИдентификатор,,, ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, конец
	
КонецПроцедуры

Процедура РешениеОМетодеИсключенияКТКИзСделки_Сделка_ФормаИсключенияКТКИзСделки_Нажатие(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено ИЛИ П1.ВыбраннаяЗаявка = Ложь Тогда 
		Возврат;
	Иначе
		
		//Оповестить("ОповещениеОбИсключенииКТКИзСделки", П1.ВыбраннаяЗаявка, П1.ЭтаФормаЪ);
		//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, начало
		СтруктураДанныеПоЗапрещеннымДляПересчета = УдалениеКТКИзСделки_Сервер.ПолучитьДанныеПоЗапрещеннымДляПереноса(П2.ЭтаФорма.Объект, 
																													 П2.МассивУникальныхЗаявок);
		МассивДобавленоИзАкцепта = СтруктураДанныеПоЗапрещеннымДляПересчета.МассивДобавленоИзАкцепта;
		МассивОбъединениеПорожнейИГруженойСделок = СтруктураДанныеПоЗапрещеннымДляПересчета.МассивОбъединениеПорожнейИГруженойСделок;
		Если МассивДобавленоИзАкцепта.Количество()>0 ИЛИ МассивОбъединениеПорожнейИГруженойСделок.Количество()>0 Тогда
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("МассивОбъединениеПорожнейИГруженойСделок",МассивОбъединениеПорожнейИГруженойСделок);
			ДополнительныеПараметры.Вставить("МассивДобавленоИзАкцепта",МассивДобавленоИзАкцепта);
			ДополнительныеПараметры.Вставить("МассивСтрокИсключаемыхКТК",П2.МассивСтрокИсключаемыхКТК);
			ДополнительныеПараметры.Вставить("ЭтаФорма",П2.ЭтаФорма);
			ДополнительныеПараметры.Вставить("Договор",П2.Договор);
			ДополнительныеПараметры.Вставить("ВыбраннаяЗаявка",П1.ВыбраннаяЗаявка);
			ОписаниеОповещения = Новый ОписаниеОповещения("ПодтверждениеОтвязкиОбъединенныхСделокИОтключенияРасходовДляИсключенияКТК", УдалениеКТКИзСделки_Клиент, ДополнительныеПараметры);
			//ТекстВопроса = "Будут отвязаны акцепты и разъединены порожние/груженые сделки, при их наличии, продолжить?";
			//Если ТипЗнч(П1.ВыбраннаяЗаявка) = Тип("ДокументСсылка.Сделка") Тогда
			//	ТекстВопроса = "Будут отвязаны акцепты, при их наличии, продолжить?";
			//КонецЕсли;
			ТекстВопроса = "Будут разъединены порожние/груженые сделки, продолжить?";
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Иначе	
			Оповестить("ОповещениеОбИсключенииКТКИзСделки", П1.ВыбраннаяЗаявка, П1.ЭтаФормаЪ);
		КонецЕсли;
		//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, конец
	КонецЕсли;
	
КонецПроцедуры

//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, начало
Процедура ПодтверждениеОтвязкиОбъединенныхСделокИОтключенияРасходовДляИсключенияКТК(П1 = неопределено, П2 = неопределено) Экспорт
	Если П1 <> КодВозвратаДиалога.Да тогда Возврат; КонецЕсли;
	
	ДополнительныеПараметры = П2;
	ЭтаФорма = ДополнительныеПараметры.ЭтаФорма;
	
	//ОТВЯЗКА РАСХОДОВ ИЗ АКЦЕПТОВ И РАЗЪЕДИНЕНИЕ СДЕЛОК
	ДополнительныеПараметрыДляОбработки = Новый Структура;
	ДополнительныеПараметрыДляОбработки.Вставить("МассивДобавленоИзАкцепта", ДополнительныеПараметры.МассивДобавленоИзАкцепта);
	ДополнительныеПараметрыДляОбработки.Вставить("МассивОбъединениеПорожнейИГруженойСделок", Новый Массив);
	//для случая переноса КТК в другую Сделку разъединять Сделки не нужно, расходы будут перенесены в другую сделку
	Если НЕ ТипЗнч(ДополнительныеПараметры.ВыбраннаяЗаявка) = Тип("ДокументСсылка.Сделка") Тогда
		ДополнительныеПараметрыДляОбработки.Вставить("МассивОбъединениеПорожнейИГруженойСделок", ДополнительныеПараметры.МассивОбъединениеПорожнейИГруженойСделок);
	КонецЕсли;
	СтруктураРезультата = УдалениеКТКИзСделки_Сервер.ВыполнитьОтключениеРасходовИзАкцептаИВыполнитьРазъединение(ЭтаФорма.Объект, ДополнительныеПараметрыДляОбработки);
	ТребуетсяПеречитатьФормуСделки = Ложь;
	
	ОчиститьСообщения();
	//Если СтруктураРезультата.ЕстьРезультатОтключенияРасходов <> Неопределено Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураРезультата.РезультатОтключения);
	//	ТребуетсяПеречитатьФормуСделки = Истина;
	//КонецЕсли;
	
	Если СтруктураРезультата.ЕстьРезультатРазъединенияСделок <> Неопределено Тогда
		Если СтруктураРезультата.ЕстьРезультатРазъединенияСделок Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Операция разъединения выполнена. Список разъединенных сделок:");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураРезультата.СписокСделок); 
			ТребуетсяПеречитатьФормуСделки = Истина;
		ИначеЕсли НЕ СтруктураРезультата.ЕстьРезультатРазъединенияСделок Тогда
			ПоказатьПредупреждение(,"Не удалось выполнить разъединение: "+СтруктураРезультата.РезультатРазъединения);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ТребуетсяПеречитатьФормуСделки Тогда
		Оповестить("ПеречитатьФормуСделки", Истина, ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	
	Оповестить("ОповещениеОбИсключенииКТКИзСделки", ДополнительныеПараметры.ВыбраннаяЗаявка, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры
//ДИТ, Беляев СЮ, US 66796 / TA 72732, 20-07-2023, конец

Процедура ОбработкаОповещенияОбИсключенииКТКИзСделки_Сделка_ФормаОбъекта_Оповещение(ЭтаФорма, ПараметрОповещения) Экспорт
	
	ПредыдущаяЗаявка = неопределено;
	МассивОтрабатываемыхКТК = Новый Массив;
	Для каждого Стр из ЭтаФорма.Объект.СвязьУчетныхЕдиниц Цикл
		Если Стр.БезЖДН = Истина Тогда
			ПредыдущаяЗаявка = Стр.Заявка;
			МассивОтрабатываемыхКТК.Добавить(Стр.Контейнер);
		КонецЕсли;
	КонецЦикла;
	
	РезЗаявка = неопределено;
	
	Если ПараметрОповещения = Истина Тогда
		// Перенести КТК в новую заявку
		РезЗаявка = УдалениеКТКИзСделки_Сервер.ПеренестиКТКВДругуюЗаявку(МассивОтрабатываемыхКТК, ПредыдущаяЗаявка, ПараметрОповещения);
	ИначеЕсли ТипЗнч(ПараметрОповещения) = Тип("ДокументСсылка.Заявка") Тогда
		// Перенести КТК в существующую заявку
		РезЗаявка = УдалениеКТКИзСделки_Сервер.ПеренестиКТКВДругуюЗаявку(МассивОтрабатываемыхКТК, ПредыдущаяЗаявка, ПараметрОповещения);
	КонецЕсли;
	
	Для каждого Стр из ЭтаФорма.Объект.СвязьУчетныхЕдиниц Цикл
		Если Стр.БезЖДН = Истина Тогда
			Стр.Удалена = Истина;
		КонецЕсли;
	КонецЦикла;
	
	//ЭтаФорма.Модифицированность = Истина;
	ЭтаФорма.Записать();
	
	ПоказатьЗначение(, РезЗаявка);
	
КонецПроцедуры

// Евросиб Фролов (15.04.2022 Task №48577
// Алгоритм процедуры перенесен из процедуры ИсключитьКТКИзСделкиV2_ок_Сделка_Нажатие этого модуля,
// т.к. проверка на наличие расходов нужна не всегда (если КТК переносится в сделку, то такая проверка не нужна).

Процедура ПроверитьИсключаемыеКТКНаНаличиеРасходов(ЭтаФорма, ЕстьРасходы) Экспорт
	
	МассивИдентификаторовДляПроверкиПривязанныхПТУ = Новый Массив;
	
	Для каждого Стр из ЭтаФорма.Объект.СвязьУчетныхЕдиниц Цикл
		Если Стр.БезЖДН = Истина Тогда
			МассивИдентификаторовДляПроверкиПривязанныхПТУ.Добавить(Стр.ГУИД);
		КонецЕсли;
	КонецЦикла;
	
	ИдентификаторыСУЕ = УдалениеКТКИзСделки_Сервер.ПолучитьСтрокиРасходовПоСУЕСПривязаннымиУчДокументами(МассивИдентификаторовДляПроверкиПривязанныхПТУ, ЭтаФорма.Объект);
	Для каждого Стр из ЭтаФорма.Объект.СвязьУчетныхЕдиниц Цикл
		Если ИдентификаторыСУЕ.Найти(Стр.ГУИД) <> Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Внимание: К исключаемому контейнеру %1 по строке %2 привязаны расходы.
																		|Необходимо обратиться в бэк-офис за удалением строк расходов", Стр.Контейнер, Стр.НомерСтроки));
			Стр.БезЖДН = Ложь;
			ЕстьРасходы = Истина;
		КонецЕсли; 
	КонецЦикла;
		
КонецПроцедуры
// Евросиб Фролов)