
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокСчетов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "СписокСчетов");
	Если ЗначениеЗаполнено(СписокСчетов) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СчетНаОплатуПокупателю.Ссылка КАК Ссылка,
		|	СчетНаОплатуПокупателю.Номер КАК Номер,
		|	СчетНаОплатуПокупателю.НомерДляПечати КАК НомерДляПечати,
		|	СчетНаОплатуПокупателю.Контрагент КАК Контрагент,
		|	СчетНаОплатуПокупателю.ПодразделениеОрганизации.ЦифровойИндексОбособленногоПодразделения КАК ПодразделениеОрганизацииЦифровойИндексОбособленногоПодразделения,
		|	ЛОЖЬ КАК Пройден
		|ИЗ
		|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
		|ГДЕ
		|	СчетНаОплатуПокупателю.Ссылка В(&Счета)";		
		Запрос.УстановитьПараметр("Счета", СписокСчетов);
		ТаблицаСчетов = Запрос.Выполнить().Выгрузить();		
		
		НомерДляПечати = "";
		НомерСчетаВСписке = 0;
		Для Каждого Счет Из СписокСчетов Цикл
			
			Если Не ЗначениеЗаполнено(Счет) Тогда
				Продолжить;
			КонецЕсли;
			
			РеквизитыСчета = ТаблицаСчетов.Найти(Счет, "Ссылка");
			Если РеквизитыСчета = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если РеквизитыСчета.Пройден Тогда
				Продолжить;
			КонецЕсли;
			РеквизитыСчета.Пройден = Истина;
			
			СтрокаСписка = Список.Добавить();
			СтрокаСписка.Счет = Счет;
			СтрокаСписка.УстановитьНовыйНомер = Истина;
			СтрокаСписка.ТекущийНомер = РеквизитыСчета.НомерДляПечати;
			
			Если НомерСчетаВСписке = 0 Тогда
				
				РеквизитыСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаСписка.Счет, "Номер, Контрагент, ПодразделениеОрганизации.ЦифровойИндексОбособленногоПодразделения");
				НомерПервогоСчета = РеквизитыСчета.Номер;
				Контрагент = РеквизитыСчета.Контрагент;
				ЦифровойИндексПодразделения = РеквизитыСчета.ПодразделениеОрганизацииЦифровойИндексОбособленногоПодразделения;
				
				НомерДляПечати = СтрШаблон("%1/%2/%3",
				НомерПервогоСчета,
				?(Справочники.Контрагенты.КонтрагентНерезидент(Контрагент),"Н","Р"),
				ЦифровойИндексПодразделения);
				СтрокаСписка.НовыйНомер = НомерДляПечати;
				
			Иначе
			
				Если Не ЗначениеЗаполнено(СтрокаСписка.НовыйНомер) Тогда
					Если ЗначениеЗаполнено(НомерДляПечати) Тогда
						СтрокаСписка.НовыйНомер = СтрШаблон("%1/%2", НомерДляПечати, НомерСчетаВСписке);
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
			НомерСчетаВСписке = НомерСчетаВСписке + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	ПронумероватьСтрокиСписка(Список);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого Стр Из Список Цикл
		Стр.УстановитьНовыйНомер = Ложь; 
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для Каждого Стр Из Список Цикл
		Стр.УстановитьНовыйНомер = Истина; 
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНовыеНомера(Команда)
	
	Отказ = Ложь;
	
	ВыбраныСтроки = Ложь;
	ИспользованныеНомера = Новый Соответствие;	
	Для Каждого Стр Из Список Цикл
		Если Стр.УстановитьНовыйНомер Тогда
			ВыбраныСтроки = Истина;
			Стр.НовыйНомер = СокрЛП(Стр.НовыйНомер);
			Если Не ЗначениеЗаполнено(Стр.НовыйНомер) Тогда
				ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Список", Стр.НомерСтроки, "НовыйНомер");
				ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен Новый номер",, ПутьКПолюТЧ, "", Отказ);
			Иначе
				НомерСтроки = ИспользованныеНомера.Получить(Стр.НовыйНомер);
				Если ЗначениеЗаполнено(НомерСтроки) Тогда
					ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Список", Стр.НомерСтроки, "НовыйНомер");		
					ТекстСообщения = СтрШаблон("Новый номер %1 уже указан в строке №%2. Через слеш добавьте следующий порядковый номер счета или измените нумерацию.", Стр.НовыйНомер, НомерСтроки);
					ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, ПутьКПолюТЧ, "", Отказ);
				Иначе
					ИспользованныеНомера.Вставить(Стр.НовыйНомер, Стр.НомерСтроки);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ВыбраныСтроки Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран ни один счет для установки номера!",,,, Отказ);
	КонецЕсли;
	
	Если Не Отказ Тогда
		УстановитьНовыеНомераСервер(Отказ);
	КонецЕсли;
	
	Если Не Отказ Тогда
		ПоказатьПредупреждение(, "Новые номера счетов установлены!");
		ОповеститьОбИзменении(Тип("ДокументСсылка.СчетНаОплатуПокупателю"));
		Оповестить("УстановленНовыйНомерСчета");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНовыеНомераСервер(Отказ = Ложь)
	
	СтрокиКОбработке = Список.НайтиСтроки(Новый Структура("УстановитьНовыйНомер", Истина));
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НовыеНомера.Счет КАК Счет,
	|	НовыеНомера.НовыйНомер КАК НовыйНомер,
	|	НовыеНомера.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&НовыеНомера КАК НовыеНомера
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Счет КАК Счет,
	|	ВТ.НовыйНомер КАК НовыйНомер,
	|	ВТ.НомерСтроки КАК НомерСтроки,
	|	СчетНаОплатуПокупателю.Дата КАК Дата
	|ПОМЕСТИТЬ Счета
	|ИЗ
	|	ВТ КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	|		ПО ВТ.Счет = СчетНаОплатуПокупателю.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Счета.НомерСтроки КАК НомерСтроки,
	|	Счета.НовыйНомер КАК НовыйНомер
	|ИЗ
	|	Счета КАК Счета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	|		ПО Счета.НовыйНомер = СчетНаОплатуПокупателю.НомерДляПечати
	|			И (ГОД(Счета.Дата) = ГОД(СчетНаОплатуПокупателю.Дата))
	|ГДЕ
	|	НЕ СчетНаОплатуПокупателю.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ.Счет КАК Счет
	|				ИЗ
	|					ВТ КАК ВТ)
	|	И НЕ СчетНаОплатуПокупателю.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Запрос.УстановитьПараметр("НовыеНомера", Список.Выгрузить(СтрокиКОбработке));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("НомерСтроки") Цикл
		
		ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Список", Выборка.НомерСтроки, "НовыйНомер");		
		ТекстСообщения = СтрШаблон("Номер для печати %1 уже существует. Через слеш добавьте следующий порядковый номер счета или измените нумерацию.", Выборка.НовыйНомер);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ПутьКПолюТЧ, "", Отказ);
		
	КонецЦикла;
	
	Если Не Отказ Тогда
		
		Для Каждого Стр Из СтрокиКОбработке Цикл
			
			СчетОбъект = Стр.Счет.ПолучитьОбъект();
			СчетОбъект.НомерДляПечати = Стр.НовыйНомер;
			СчетОбъект.Записать();
			
			Стр.ТекущийНомер = Стр.НовыйНомер;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
	ПронумероватьСтрокиСписка(Список);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПронумероватьСтрокиСписка(Список)
	
	НомерСтроки = 1;
	Для Каждого Стр Из Список Цикл
		Стр.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
КонецПроцедуры

