
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьЦветовоеОформление();
	УправлениеДоступностьюЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦветовоеОформление()
	ЦветЗеленый = Новый Цвет(0,255,0);
	ЦветЖелтый = Новый Цвет(255,255,0);
	ЦветКрасный = Новый Цвет(255,0,0);
	Если Объект.ИндексИДО >=1 и Объект.ИндексИДО <= 40 Тогда
		Элементы.ИндексИДО.ЦветФона = ЦветЗеленый;
	ИначеЕсли Объект.ИндексИДО > 40 и Объект.ИндексИДО <= 70 Тогда
		Элементы.ИндексИДО.ЦветФона = ЦветЖелтый;
	ИначеЕсли Объект.ИндексИДО > 70 и Объект.ИндексИДО <= 99 Тогда
		Элементы.ИндексИДО.ЦветФона = ЦветКрасный;
	КонецЕсли;
	Если Объект.ИндексИПД >=80 и Объект.ИндексИПД <= 100 Тогда
		Элементы.ИндексИПД.ЦветФона = ЦветЗеленый;
	ИначеЕсли Объект.ИндексИПД >= 50 и Объект.ИндексИПД <= 79 Тогда
		Элементы.ИндексИПД.ЦветФона = ЦветЖелтый;
	ИначеЕсли Объект.ИндексИПД >= 0 и Объект.ИндексИПД <= 49 Тогда
		Элементы.ИндексИПД.ЦветФона = ЦветКрасный;
	КонецЕсли;
	Если Объект.ИндексИФР >=1 и Объект.ИндексИФР <= 14 Тогда
		Элементы.ИндексИФР.ЦветФона = ЦветЗеленый;
	ИначеЕсли Объект.ИндексИФР >= 15 и Объект.ИндексИФР <= 85 Тогда
		Элементы.ИндексИФР.ЦветФона = ЦветЖелтый;
	ИначеЕсли Объект.ИндексИФР >= 86 и Объект.ИндексИФР <= 99 Тогда
		Элементы.ИндексИФР.ЦветФона = ЦветКрасный;
	КонецЕсли;
	
	Если Объект.ЛимитДЗ_Факт <= Объект.ЛимитДЗ_План Тогда
		Элементы.ЛимитДЗ_Факт.ЦветФона = ЦветЗеленый;
	Иначе
		Элементы.ЛимитДЗ_Факт.ЦветФона = ЦветКрасный;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УправлениеДоступностьюЭлементов()
	//Если Объект.СтатусДокумента <> ПредопределенноеЗначение("Перечисление.СтатусыСогласования.Планируется")
	//	или Объект.СтатусДокумента <> ПредопределенноеЗначение("Перечисление.СтатусыСогласования.СогласованоСЗамечаниями")
	//	или Объект.СтатусДокумента <> ПредопределенноеЗначение("Перечисление.СтатусыСогласования.СогласованоСЗамечаниями")
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// + Состояния
	ФонТекущегоСостояния = ЦветаСтиля.ФонТекущегоСостояния;
	ФонВыполненногоСостояния = ЦветаСтиля.ФонВыполненногоСостояния;
	ФонБудущегоСостояния = ЦветаСтиля.ФонБудущегоСостояния;
	ЦветКнопки_Исходный = Элементы.ПениПоДоговору.ЦветФона;
	ЦветКнопки_Выделенный = WebЦвета.Розовый;
	// Обновляем панель текущего пользователя и панель состояний
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	// - Состояния
	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры


&НаКлиенте
Процедура СреднемесячнаяВыручкаПланируемаяПриИзменении(Элемент)
	Объект.ЛимитДЗ_План = Объект.СреднемесячнаяВыручкаПланируемая *Объект.ОтсрочкаПоДоговору_Факт/30; 
КонецПроцедуры


&НаКлиенте
Процедура ОтсрочкаПоДоговору_ФактПриИзменении(Элемент)
	
	Объект.ЛимитДЗ_План = Объект.СреднемесячнаяВыручкаПланируемая *Объект.ОтсрочкаПоДоговору_Факт/30; 

КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// + ОБЛАСТЬ СОСТОЯНИЯ

// Процедура обновляет панель текущего пользователя
&НаСервере
Процедура ОбновитьПанельТекущегоПользователя()
	
	МаршрутизацияСервер.ОбновитьПанельТекущегоПользователя(Объект, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
КонецПроцедуры

// Функция обновляет панель состояний документа для графического отражения его движения по состояниям
&НаСервере
Процедура ОбновитьПанельСостояний()
	
	МаршрутизацияСервер.ОбновитьПанельСостояний(ЭтотОбъект);
	// +Шейко ОЕ [Ticket#0204619] Блокировка завершенных калькуляций
	КолСостоянийЗавершено = 0;
	
	Для каждого Стр из Объект.Ссылка.Состояния Цикл //Гудкова добавила ссылку
		
		Если Стр.Статус = Перечисления.СтатусыЭтапов.Выполнен Тогда
		
			КолСостоянийЗавершено = КолСостоянийЗавершено + 1;
		
		КонецЕсли;
		
	КонецЦикла;
	
	//РамкаПроцессная = Новый Рамка(ТипРамкиЭлементаУправления.Одинарная, 2);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И КолСостоянийЗавершено = Объект.Ссылка.Состояния.Количество() Тогда
		Элементы.ГруппаИнформацияОДокументе.Видимость = Истина;
		
		Элементы.ПредупреждениеРедактирования.Заголовок = "Документ полностью отработан. Запись заблокирована";
	Иначе	
		Элементы.ГруппаИнформацияОДокументе.Видимость = Ложь;
	КонецЕсли;
	// -Шейко ОЕ [Ticket#0204619] Блокировка завершенных калькуляций
	
КонецПроцедуры

// Этот обработчик вызывается при нажатии на состояния на панели состояний
// Ссылка на него устанавливается кодом, поэтому при проверке конфигурации 1с может сказать, что эта функция не испольузется
// Не верьте 1с!
&НаКлиенте
Процедура ОбработчикНажатияПлитокСостояния(П1 = неопределено, П2 = неопределено) Экспорт
	МаршрутизацияКлиент.ОбработчикНажатияНаПлиткуОбщий(П1, П2);
КонецПроцедуры

&НаКлиенте
Процедура ТекущийИсполнитель_СтатусПриИзменении(Элемент)
	
	// обновляем информацию по состоянию 
	МаршрутизацияКлиент.ТекущийИсполнитель_СтатусПриИзменении(Объект, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
	ОбновитьПанельСостояний();
	
КонецПроцедуры

&НаКлиенте
Процедура ПовторнаяМаршрутизация(Команда)
	
	Если Объект.Маршрутизировать Тогда
		ПараметрыЗапроса = Новый Соответствие;
		
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыЗапроса.Вставить("ДоговорКонтрагента", Объект.ДоговорКонтрагента);
		ПараметрыЗапроса.Вставить("ЦФО", Объект.ЦФО);
		ПараметрыЗапроса.Вставить("ЛимитДЗ_Факт", Объект.ЛимитДЗ_Факт);
		
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьКредитнуюЗаявку(ПараметрыЗапроса, Объект.Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			Отказ = ПроверитьУказатьОтветственных(РезультатЗапроса, Ложь);
		Иначе
			Сообщить("Для документа не найден подходящий маршрут. Изменения не внесены!");
		КонецЕсли;
		
		ОбновитьПанельСостояний();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = ПроверитьНеобходимостьМаршрутизации();
	Если Объект.Маршрутизировать И ДопСвойстваОбъекта.Количество() = 0 И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		
		ПараметрыЗапроса = Новый Соответствие;
		ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
		ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыЗапроса.Вставить("ДоговорКонтрагента", Объект.ДоговорКонтрагента);
		ПараметрыЗапроса.Вставить("ЦФО", Объект.ЦФО);
		ПараметрыЗапроса.Вставить("ЛимитДЗ_Факт", Объект.ЛимитДЗ_Факт);
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьКредитнуюЗаявку(ПараметрыЗапроса, Объект.Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			Отказ = ПроверитьУказатьОтветственных(РезультатЗапроса, Истина);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьНеобходимостьМаршрутизации()

	ДляДанногоОбъектаТребуетсяПеремаршрутизация = НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ 
		Объект.Ссылка.Организация <> Объект.Организация ИЛИ 
		Объект.Ссылка.Контрагент <> Объект.Контрагент ИЛИ
		Объект.Ссылка.ДоговорКонтрагента <> Объект.ДоговорКонтрагента ИЛИ
		Объект.Ссылка.ЦФО <> Объект.ЦФО ИЛИ
		Объект.Ссылка.ЛимитДЗ_Факт <> Объект.ЛимитДЗ_Факт;
	
	Возврат ДляДанногоОбъектаТребуетсяПеремаршрутизация;
	
КонецФункции

// +++ БЛОК НОВОЙ МАРШРУТИЗАЦИИ

&НаКлиенте
Функция ПроверитьУказатьОтветственных(РезультатЗапроса, СобытиеПередЗаписью)
	
	ДопСвойстваОбъекта.Очистить();
	ЧтоНужноУказатьВручную = Новый Массив;
	Для каждого Стр из  РезультатЗапроса Цикл
		Исполнитель = Стр.Исполнитель;
		Если НЕ Стр.ТребуетсяУказатьИсполнителя И НЕ ЗначениеЗаполнено(Исполнитель) Тогда Исполнитель = Объект.Автор; КонецЕсли;
		Наблюдатель = Стр.Наблюдатель;
		Если НЕ Стр.ТребуетсяУказатьНаблюдателя И НЕ ЗначениеЗаполнено(Наблюдатель) Тогда Наблюдатель = Объект.Автор; КонецЕсли;
		
		Если Стр.ТребуетсяУказатьИсполнителя ИЛИ Стр.ТребуетсяУказатьНаблюдателя Тогда 
			ЧтоНужноУказатьВручную.Добавить(Новый Структура("Состояние, Исполнитель, Наблюдатель", Стр.Состояние, Исполнитель, Наблюдатель)); 
		КонецЕсли;
	КонецЦикла;
	Если ЧтоНужноУказатьВручную.Количество() > 0 Тогда
		ОпОп = Новый ОписаниеОповещения("ОбработкаУказанияОтветственных", ЭтаФорма, Новый Структура("РезультатЗапроса, СобытиеПередЗаписью", РезультатЗапроса, СобытиеПередЗаписью));
		ПараметрыОтбора = Новый СТруктура;
		ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация", ЧтоНужноУказатьВручную);
		ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Если НЕ СобытиеПередЗаписью Тогда ПовторнаяМаршрутизация_сервер(РезультатЗапроса); КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаУказанияОтветственных(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	ДопСвойстваОбъекта.ЗагрузитьЗначения(П1);
	Если П2.СобытиеПередЗаписью Тогда
		Записать();
	Иначе
		ПовторнаяМаршрутизация_сервер(П2.РезультатЗапроса);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПовторнаяМаршрутизация_сервер(РезультатЗапроса)
	
	ЭтотОбъектЪ = РеквизитФормыВЗначение("Объект");
	МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъектЪ, РезультатЗапроса, Объект.Автор, ДопСвойстваОбъекта);
	ЗначениеВРеквизитФормы(ЭтотОбъектЪ, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ДопСвойстваОбъекта", ДопСвойстваОбъекта);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ДопСвойстваОбъекта.Очистить();
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоКонтрагенту(Команда)
	ЗаполнитьПоДоговоруНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДоговоруНаСервере()
	
	КЗОбъект = РеквизитФормыВЗначение("Объект");
	КЗОбъект.Заполнить(Объект.ДоговорКонтрагента);
	ЗначениеВРеквизитФормы(КЗОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьНаСогласование(Команда)
	
	Если ЭтаФорма.Модифицированность Тогда 
		Записать(); 
	КонецЕсли;
		
	// проверим наличие согласований в таблице. если нет, то не запускать процесс
	ДанныеЕсть = Ложь;
	Для Каждого Стр Из объект.Состояния Цикл
		Если ПолучитьСогласование(Стр.Состояние) Тогда
			ДанныеЕсть = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ДанныеЕсть = Ложь Тогда
		Сообщить("В таблице Состояния нет ни одного согласования!");
		Возврат;
	КонецЕсли;
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаСогласования", ЭтаФорма);
	
	ТекПроцессСогл = ПечатьБухгалтерскихДокументов.ПроверитьНаличиеПроцесса(Объект.Ссылка);
	Если ТекПроцессСогл = ПредопределенноеЗначение("Справочник.ПроцессСогласования.ПустаяСсылка") Тогда
		ПараметрыФормы = Новый Структура("ДокументСогласования", Объект.Ссылка);
	Иначе
		ПараметрыФормы = Новый Структура("Ключ", ТекПроцессСогл);
	КонецЕсли;
	ОткрытьФорму("Справочник.ПроцессСогласования.ФормаОбъекта", ПараметрыФормы,ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСогласования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	ЭтаФорма.ОбновитьОтображениеДанных();
	//ПолучитьДанныеИзБазы();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСогласование(Сост)
	Возврат Сост.Согласование;
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ТребуетсяПеречитатьУказанныйДокумент" И Параметр = Объект.Ссылка Тогда
		ЭтаФорма.Прочитать();
		ОбновитьПанельТекущегоПользователя();
		ОбновитьПанельСостояний();
	КонецЕсли;
	
КонецПроцедуры

// --- БЛОК НОВОЙ МАРШРУТИЗАЦИИ