
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ТрундуковСА 24.06.2025 #112557 Востановлен множественный выбор
	//МальцевАН 09.04.2024 #83697 Отключен множественный выбор в ТЧ
	//(
	//Элементы.ТЧ.МножественныйВыбор = Ложь;
	//Элементы.ТЧ.РежимВыделения = РежимВыделенияТаблицы.Одиночный;
	//) 
	//МальцевАН 09.04.2024 #83697 Отключен множественный выбор в ТЧ
	//ТрундуковСА 24.06.2025 #112557
	
	//Евросиб Каблов 09.04.2025 ( #105407
	//ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Константы.ОсновнаяОрганизация.Получить());
	ПериодВО = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(Константы.ОсновнаяОрганизация.Получить());
	//Евросиб Каблов 09.04.2025 )
	
	//Евросиб - АСуслов 22.09.2021 10:58:39 #33698
	//(
	Параметры.Свойство("ПериодУУ", ПериодУУ);
	//)
	//Евросиб - АСуслов 22.09.2021 10:58:42 #33698
	ТипЗаказа = Справочники.ТипыЗаказов.КонтейнерныйПоезд;   
	
	Элементы.ТЧСписокКТК.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ТЕ");
	
	Если Параметры.Свойство("ИнтерактивноеОткрытие") Тогда
		ИнтерактивнаяРабота = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("Сделка") Тогда
		Сделка = Параметры.Сделка;
	КонецЕсли;
	
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 04-08-2025, начало
	Элементы.РежимДобавленияВозмещаемых.Видимость = Ложь;
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 04-08-2025, конец
	
	Если Параметры.Свойство("ВозмДоходыРасходы") Тогда
		
		//ДИТ Шевченко А.В. US 68330 ТА 69907 16.05.2023 -Начало
		ДанныеИзСП = Истина;
		Элементы.ТЧУказатьСтрокуДоходов.Заголовок = "Указать строку состава поезда";
		
		Элементы.ТЧТребуетсяУказатьСтрокуДоходов.Заголовок = "Укажите строку состава поезда";
		Элементы.ТЧГруппаДоходы.Заголовок = "Состав поезда";
		Элементы.ТЧГруппа31.Видимость = Истина;
		//ДИТ Шевченко А.В. US 68330 ТА 69907 16.05.2023 -Конец 
		
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 04-08-2025, начало
		РежимДобавленияВозмещаемых = 1;
		Элементы.РежимДобавленияВозмещаемых.Видимость = Истина;
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 04-08-2025, конец
		
		// ДИТ US 83693 ТА 83970 Сержантова А.С. Начало: 26.04.2024
		Элементы.СвязатьПоВидуТранспортногоСообщения.Видимость = Истина;
		// ДИТ US 83693 ТА 83970 Сержантова А.С. Конец: 26.04.2024
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
		Если Параметры.Свойство("СвязатьПоВидуТранспортногоСообщения") Тогда
			СвязатьПоВидуТранспортногоСообщения = Параметры.СвязатьПоВидуТранспортногоСообщения;
		КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
		
		ЭтаФорма.АвтоЗаголовок = Ложь;
		ЭтаФорма.Заголовок = "Добавление возмещаемых доходов и расходов | Добавление расходов в сделку";
		РежимРаботыФормы = 1;
		
		Для каждого Стр из Параметры.СписокСтрок Цикл
			
			НСтр = ТЧ.Добавить();
			ЗаполнитьЗначенияСвойств(НСтр, Стр);
			//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
			Если ЗначениеЗаполнено(Стр.ИдентификаторСтрокиДоходовВСделкеКорректируемый) Тогда
				НСтр.ГУИДРасходов = Стр.ИдентификаторСтрокиРасходовВСделке;
			КонецЕсли;
			//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
			НСтр.УслугаРасхода = Стр.Услуга;
			Если ЗначениеЗаполнено(Стр.КТК) Тогда
				НСтр.СписокКТК.Добавить(Стр.КТК);
				НСтр.РазмерКТК = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.КТК,"ТипТЕ.РазмерКТК");
				//Евросиб - АСуслов 22.09.2021 11:16:53 #33698
				//(
				НСтр.Контейнер = Стр.КТК;
				//)
				//Евросиб - АСуслов 22.09.2021 11:16:56 #33698
			КонецЕсли;
			Если ЗначениеЗаполнено(Стр.Вагон) Тогда
				НСтр.СписокВагонов.Добавить(Стр.Вагон);
				//Евросиб - АСуслов 22.09.2021 11:16:53 #33698
				//(
				НСтр.Вагон = Стр.Вагон;
				//)
				//Евросиб - АСуслов 22.09.2021 11:16:56 #33698
			КонецЕсли;
			Если ЗначениеЗаполнено(Стр.ТД) Тогда
				НСтр.СписокТД.Добавить(Стр.ТД);
				
				Если Стр.ТД.НакладнаяЭТРАН.ГрузыЖД.Количество() > 0 Тогда
					НСтр.Груз = Справочники.Грузы.НайтиСоздатьГруз(Стр.ТД.НакладнаяЭТРАН.ГрузыЖД[0].НаименованиеГруза, Стр.ТД.НакладнаяЭТРАН.ГрузыЖД[0].КодЕТСНГ, Стр.ТД.НакладнаяЭТРАН.ГрузыЖД[0].КодГНГ);
				КонецЕсли;
				
				НСтр.ТранспортныйДокумент = Стр.ТД; //ДИТ Шевченко А.В. US 68330 ТА 69907 16.05.2023  
				// ДИТ ТА 71560 Сержантова А.С. Начало: 20.06.2023
				Если Стр.ТД.ВидОперации = Перечисления.ВидыОперацийТранспортныхДокументов.Коносамент Тогда
					НСтр.Коносамент 	  = Стр.ТД;
				КонецЕсли;
				// ДИТ ТА 71560 Сержантова А.С. Конец: 20.06.2023
				
			КонецЕсли;
			
			НСтр.Перевыставляемая = Истина;
			НСтр.УслугаВнеСтавки = Истина;
			НСтр.ЕдиницаИзмерения = НСтр.Услуга.ЕдиницаИзмерения;
			НСтр.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта;
			НСтр.Доходы = Истина;
			НСтр.Расходы = Истина;
			//нСтр.НДСВключенВСтоимость = Истина; //Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 06-08-2025, закомментировал
			НСтр.ТребуетсяУказатьСтрокуДоходов = Истина; //ДИТ Шевченко А.В. US 68330 ТА 69907 16.05.2023
			ОбновитьМатематикуСтроки_Сервер(НСтр);
			
		КонецЦикла;
		
	ИначеЕсли Параметры.Свойство("ДоходыРасходыОтдельнойУслугой") Тогда
		
		//ДИТ Шевченко А.В. US 68330 ТА 69907 16.05.2023 -Начало
		ДанныеИзСП = Истина;
		Элементы.ТЧУказатьСтрокуДоходов.Заголовок = "Указать строку состава поезда";
		
		Элементы.ТЧТребуетсяУказатьСтрокуДоходов.Заголовок = "Укажите строку состава поезда";
		Элементы.ТЧГруппаДоходы.Заголовок = "Состав поезда";
		Элементы.ТЧГруппа31.Видимость = Истина;
		//ДИТ Шевченко А.В. US 68330 ТА 69907 16.05.2023 -Конец
		
		// ДИТ US 83693 ТА 83970 Сержантова А.С. Начало: 26.04.2024
		Элементы.СвязатьПоВидуТранспортногоСообщения.Видимость = Истина;
		// ДИТ US 83693 ТА 83970 Сержантова А.С. Конец: 26.04.2024
		
		ЭтаФорма.АвтоЗаголовок = Ложь;
		ЭтаФорма.Заголовок = "Добавление доходов и расходов доп. услугой | Добавление расходов в сделку";
		РежимРаботыФормы = 2;
		
		Для каждого Стр из Параметры.СписокСтрок Цикл
			
			НСтр = ТЧ.Добавить();
			ЗаполнитьЗначенияСвойств(НСтр, Стр);
			НСтр.УслугаРасхода = Стр.Услуга;
			Если ЗначениеЗаполнено(Стр.КТК) Тогда
				НСтр.СписокКТК.Добавить(Стр.КТК);
				НСтр.Контейнер = Стр.КТК; //ДИТ Шевченко А.В. US 68330 ТА 69907 16.05.2023
				НСтр.РазмерКТК = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.КТК,"ТипТЕ.РазмерКТК");
			КонецЕсли;
			Если ЗначениеЗаполнено(Стр.Вагон) Тогда
				НСтр.СписокВагонов.Добавить(Стр.Вагон);
				НСтр.Вагон = Стр.Вагон; //ДИТ Шевченко А.В. US 68330 ТА 69907 16.05.2023
			КонецЕсли;
			Если ЗначениеЗаполнено(Стр.ТД) Тогда
				НСтр.СписокТД.Добавить(Стр.ТД);
				Если Стр.ТД.НакладнаяЭТРАН.ГрузыЖД.Количество() > 0 Тогда
					НСтр.Груз = Справочники.Грузы.НайтиСоздатьГруз(Стр.ТД.НакладнаяЭТРАН.ГрузыЖД[0].НаименованиеГруза, Стр.ТД.НакладнаяЭТРАН.ГрузыЖД[0].КодЕТСНГ, Стр.ТД.НакладнаяЭТРАН.ГрузыЖД[0].КодГНГ);
				КонецЕсли;
				//Евросиб - АСуслов 22.09.2021 11:17:27 #33698
				//(
				НСтр.ТранспортныйДокумент = Стр.ТД;
				//)
				//Евросиб - АСуслов 22.09.2021 11:17:29 #33698
				// ДИТ ТА 71560 Сержантова А.С. Начало: 20.06.2023
				Если Стр.ТД.ВидОперации = Перечисления.ВидыОперацийТранспортныхДокументов.Коносамент Тогда
					НСтр.Коносамент 	  = Стр.ТД;
				КонецЕсли;
				// ДИТ ТА 71560 Сержантова А.С. Конец: 20.06.2023
			КонецЕсли;
			
			//НСтр.Перевыставляемая = Истина;
			НСтр.УслугаВнеСтавки = Истина;
			НСтр.ЕдиницаИзмерения = НСтр.Услуга.ЕдиницаИзмерения;
			НСтр.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта;
			НСтр.Доходы = Истина;
			НСтр.Расходы = Истина;
			НСтр.ТребуетсяУказатьСтрокуДоходов = Истина; //ДИТ Шевченко А.В. US 68330 ТА 69907 16.05.2023
			ОбновитьМатематикуСтроки_Сервер(НСтр);
			
		КонецЦикла;
		
	ИначеЕсли Параметры.Свойство("РасходыПоПеревозкеКлиента") Тогда
		
		// ДИТ US 47112 TA 62979 Евсенкин М.А. Начало: 26.12.2022
        ДанныеИзСП = Истина;
		Элементы.ТЧУказатьСтрокуДоходов.Заголовок = "Указать строку состава поезда";
		
		Элементы.ТЧТребуетсяУказатьСтрокуДоходов.Заголовок = "Укажите строку состава поезда";
		Элементы.ТЧГруппаДоходы.Заголовок = "Состав поезда"; 
		Элементы.ТЧГруппа31.Видимость = Истина;
		// ДИТ US 47112 TA 62979 Евсенкин М.А. Конец: 26.12.2022   
		
		// ДИТ US 83693 ТА 83970 Сержантова А.С. Начало: 26.04.2024
		Элементы.СвязатьПоВидуТранспортногоСообщения.Видимость = Истина;
		// ДИТ US 83693 ТА 83970 Сержантова А.С. Конец: 26.04.2024
		
		ЭтаФорма.АвтоЗаголовок = Ложь;
		ЭтаФорма.Заголовок = "Доп. расходы по перевозке клиента | Добавление расходов в сделку";
		РежимРаботыФормы = 3;
		
		Для каждого Стр из Параметры.СписокСтрок Цикл
			
			НСтр = ТЧ.Добавить();
			ЗаполнитьЗначенияСвойств(НСтр, Стр);
			НСтр.УслугаРасхода = Стр.Услуга;
			Если ЗначениеЗаполнено(Стр.КТК) Тогда
				НСтр.СписокКТК.Добавить(Стр.КТК);
				НСтр.РазмерКТК = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.КТК,"ТипТЕ.РазмерКТК");
				//Евросиб - АСуслов 22.09.2021 11:16:53 #33698
				//(
				НСтр.Контейнер = Стр.КТК;
				//)
				//Евросиб - АСуслов 22.09.2021 11:16:56 #33698
			КонецЕсли;
			Если ЗначениеЗаполнено(Стр.Вагон) Тогда
				НСтр.СписокВагонов.Добавить(Стр.Вагон);
				//Евросиб - АСуслов 22.09.2021 11:17:11 #33698
				//(
				НСтр.Вагон = Стр.Вагон;
				//)
				//Евросиб - АСуслов 22.09.2021 11:17:14 #33698
			КонецЕсли;
			Если ЗначениеЗаполнено(Стр.ТД) Тогда
				НСтр.СписокТД.Добавить(Стр.ТД);
				Если Стр.ТД.НакладнаяЭТРАН.ГрузыЖД.Количество() > 0 Тогда
					НСтр.Груз = Справочники.Грузы.НайтиСоздатьГруз(Стр.ТД.НакладнаяЭТРАН.ГрузыЖД[0].НаименованиеГруза, Стр.ТД.НакладнаяЭТРАН.ГрузыЖД[0].КодЕТСНГ, Стр.ТД.НакладнаяЭТРАН.ГрузыЖД[0].КодГНГ);
				КонецЕсли;
				//Евросиб - АСуслов 22.09.2021 11:17:27 #33698
				//(
				НСтр.ТранспортныйДокумент = Стр.ТД;
				//)
				//Евросиб - АСуслов 22.09.2021 11:17:29 #33698
				// ДИТ ТА 71560 Сержантова А.С. Начало: 20.06.2023
				Если Стр.ТД.ВидОперации = Перечисления.ВидыОперацийТранспортныхДокументов.Коносамент Тогда
					НСтр.Коносамент 	  = Стр.ТД;
				КонецЕсли;
				// ДИТ ТА 71560 Сержантова А.С. Конец: 20.06.2023
			КонецЕсли;
			
			//НСтр.Перевыставляемая = Истина;
			НСтр.УслугаВнеСтавки = Истина;
			НСтр.ЕдиницаИзмерения = НСтр.Услуга.ЕдиницаИзмерения;
			НСтр.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта;
			НСтр.Доходы = Ложь;
			НСтр.Расходы = Истина;
			НСтр.ТребуетсяУказатьСтрокуДоходов = Истина;
			//Евросиб - АСуслов 24.05.2023 16:52:35 #
			//(
			нСтр.АвтоматическиПривязыватьРасходКДоходу = Истина;
			//)
			//Евросиб - АСуслов 24.05.2023 16:52:35 #
			
			ОбновитьМатематикуСтроки_Сервер(НСтр);
			
		КонецЦикла;
		
	ИначеЕсли Параметры.Свойство("РасходыСобственныеЗатраты") Тогда
		
		ЭтаФорма.АвтоЗаголовок = Ложь;
		ЭтаФорма.Заголовок = "Добавить собственные затраты | Добавление расходов в сделку";
		РежимРаботыФормы = 4;
		
		Для каждого Стр из Параметры.СписокСтрок Цикл
			
			НСтр = ТЧ.Добавить();
			ЗаполнитьЗначенияСвойств(НСтр, Стр);
			НСтр.УслугаРасхода = Стр.Услуга;
			Если ЗначениеЗаполнено(Стр.КТК) Тогда
				НСтр.СписокКТК.Добавить(Стр.КТК);
				НСтр.РазмерКТК = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.КТК,"ТипТЕ.РазмерКТК");
				//Евросиб - АСуслов 22.09.2021 11:16:53 #33698
				//(
				НСтр.Контейнер = Стр.КТК;
				//)
				//Евросиб - АСуслов 22.09.2021 11:16:56 #33698
			КонецЕсли;
			Если ЗначениеЗаполнено(Стр.Вагон) Тогда
				НСтр.СписокВагонов.Добавить(Стр.Вагон);
				//Евросиб - АСуслов 22.09.2021 11:17:11 #33698
				//(
				НСтр.Вагон = Стр.Вагон;
				//)
				//Евросиб - АСуслов 22.09.2021 11:17:14 #33698
			КонецЕсли;
			Если ЗначениеЗаполнено(Стр.ТД) Тогда
				НСтр.СписокТД.Добавить(Стр.ТД);
				Если Стр.ТД.НакладнаяЭТРАН.ГрузыЖД.Количество() > 0 Тогда
					НСтр.Груз = Справочники.Грузы.НайтиСоздатьГруз(Стр.ТД.НакладнаяЭТРАН.ГрузыЖД[0].НаименованиеГруза, Стр.ТД.НакладнаяЭТРАН.ГрузыЖД[0].КодЕТСНГ, Стр.ТД.НакладнаяЭТРАН.ГрузыЖД[0].КодГНГ);
				КонецЕсли;
				//Евросиб - АСуслов 22.09.2021 11:17:27 #33698
				//(
				НСтр.ТранспортныйДокумент = Стр.ТД;
				//)
				//Евросиб - АСуслов 22.09.2021 11:17:29 #33698 
				// ДИТ ТА 71560 Сержантова А.С. Начало: 20.06.2023
				Если Стр.ТД.ВидОперации = Перечисления.ВидыОперацийТранспортныхДокументов.Коносамент Тогда
					НСтр.Коносамент 	  = Стр.ТД;
				КонецЕсли;
				// ДИТ ТА 71560 Сержантова А.С. Конец: 20.06.2023
			КонецЕсли;
			
			//НСтр.Перевыставляемая = Истина;
			НСтр.УслугаВнеСтавки = Истина;
			НСтр.ЕдиницаИзмерения = НСтр.Услуга.ЕдиницаИзмерения;
			НСтр.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта;
			НСтр.Доходы = Ложь;
			НСтр.Расходы = Истина;
			НСтр.ОтнестиНаЗатраты = Истина;
			//Евросиб - АСуслов 22.09.2021 11:17:46 #33698
			//(
			НСтр.ПериодВО = ПериодВО;
			НСтр.ПериодУУ = ПериодУУ;
			//)
			//Евросиб - АСуслов 22.09.2021 11:17:46 #33698
			
			ОбновитьМатематикуСтроки_Сервер(НСтр);
			
			
		КонецЦикла;	
	// ДИТ US 71603 ТА 72312 Сержантова А.С. Начало: 14.07.2023
	ИначеЕсли Параметры.Свойство("УслугиЗаСчетЧистойПрибыли") Тогда
		
		ЭтаФорма.АвтоЗаголовок = Ложь;
		ЭтаФорма.Заголовок = "Добавить собственные затраты | Добавление расходов в сделку";
		РежимРаботыФормы = 4;
		
		Для каждого Стр из Параметры.СписокСтрок Цикл
			
			НСтр = ТЧ.Добавить();
			ЗаполнитьЗначенияСвойств(НСтр, Стр);
			НСтр.УслугаРасхода = Стр.Услуга;
			Если ЗначениеЗаполнено(Стр.КТК) Тогда
				НСтр.СписокКТК.Добавить(Стр.КТК);
				НСтр.РазмерКТК = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.КТК,"ТипТЕ.РазмерКТК");
				НСтр.Контейнер = Стр.КТК;
			КонецЕсли;
			Если ЗначениеЗаполнено(Стр.Вагон) Тогда
				НСтр.СписокВагонов.Добавить(Стр.Вагон);
				НСтр.Вагон = Стр.Вагон;
			КонецЕсли;
			Если ЗначениеЗаполнено(Стр.ТД) Тогда
				НСтр.СписокТД.Добавить(Стр.ТД);
				Если Стр.ТД.НакладнаяЭТРАН.ГрузыЖД.Количество() > 0 Тогда
					НСтр.Груз = Справочники.Грузы.НайтиСоздатьГруз(Стр.ТД.НакладнаяЭТРАН.ГрузыЖД[0].НаименованиеГруза, Стр.ТД.НакладнаяЭТРАН.ГрузыЖД[0].КодЕТСНГ, Стр.ТД.НакладнаяЭТРАН.ГрузыЖД[0].КодГНГ);
				КонецЕсли;
				НСтр.ТранспортныйДокумент = Стр.ТД;
				Если Стр.ТД.ВидОперации = Перечисления.ВидыОперацийТранспортныхДокументов.Коносамент Тогда
					НСтр.Коносамент 	  = Стр.ТД;
				КонецЕсли;
			КонецЕсли;
			НСтр.РасходыЗаСчетЧП = Истина;
			НСтр.УслугаВнеСтавки = Истина;
			НСтр.ЕдиницаИзмерения = НСтр.Услуга.ЕдиницаИзмерения;
			НСтр.ИсточникПоявленияСтрокиЭкономики = Перечисления.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта;
			НСтр.Доходы = Ложь;
			НСтр.Расходы = Истина;
			НСтр.ОтнестиНаЗатраты = Истина;
			НСтр.ПериодВО = ПериодВО;
			НСтр.ПериодУУ = ПериодУУ;
			
			ОбновитьМатематикуСтроки_Сервер(НСтр);
		КонецЦикла;	
	// ДИТ US 71603 ТА 72312 Сержантова А.С. Конец: 14.07.2023	
	КонецЕсли;
	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура ТЧПриИзменении(Элемент)
	
	ИмяТекПоля = Сред(Элементы.ТЧ.ТекущийЭлемент.Имя, 3);
	
	Если Элементы.ТЧ.ТекущиеДанные = неопределено Тогда Возврат; КонецЕсли;
	
	Расходы_КоличествоИзменено = Ложь;
	Если ЗначениеЗаполнено(Элементы.ТЧ.ТекущиеДанные.Количество) И НЕ ЗначениеЗаполнено(Элементы.ТЧ.ТекущиеДанные.Расходы_Количество) Тогда Элементы.ТЧ.ТекущиеДанные.Расходы_Количество = Элементы.ТЧ.ТекущиеДанные.Количество; Расходы_КоличествоИзменено = Истина; КонецЕсли;
	Расходы_СтавкаНДСИзменено = Ложь;
	Если ЗначениеЗаполнено(Элементы.ТЧ.ТекущиеДанные.СтавкаНДС) И НЕ ЗначениеЗаполнено(Элементы.ТЧ.ТекущиеДанные.Расходы_СтавкаНДС) Тогда Элементы.ТЧ.ТекущиеДанные.Расходы_СтавкаНДС = Элементы.ТЧ.ТекущиеДанные.СтавкаНДС; Расходы_СтавкаНДСИзменено = Истина; КонецЕсли;
	Расходы_ВалютаИзменено = Ложь;
	Если ЗначениеЗаполнено(Элементы.ТЧ.ТекущиеДанные.Валюта) И НЕ ЗначениеЗаполнено(Элементы.ТЧ.ТекущиеДанные.Расходы_Валюта) Тогда Элементы.ТЧ.ТекущиеДанные.Расходы_Валюта = Элементы.ТЧ.ТекущиеДанные.Валюта; Расходы_ВалютаИзменено = Истина; КонецЕсли;
	Расходы_УслугаИзменено = Ложь;
	Если ЗначениеЗаполнено(Элементы.ТЧ.ТекущиеДанные.Услуга) И НЕ ЗначениеЗаполнено(Элементы.ТЧ.ТекущиеДанные.Расходы_Услуга) Тогда Элементы.ТЧ.ТекущиеДанные.Расходы_Услуга = Элементы.ТЧ.ТекущиеДанные.Услуга; Расходы_УслугаИзменено = Истина; КонецЕсли;
	
	ОбновитьМатематикуСтроки(Элементы.ТЧ.ТекущиеДанные);
	
	Если Элементы.ТЧ.ТекущиеДанные.ГрупповоеИзменение = Истина И ИмяТекПоля <> "ГрупповоеИзменение" Тогда
		
		Для каждого Стр из ТЧ Цикл
			
			Если Стр.ГрупповоеИзменение = Истина Тогда 
				
				Стр[ИмяТекПоля] = Элементы.ТЧ.ТекущиеДанные[ИмяТекПоля];
				
				Если Расходы_КоличествоИзменено Тогда Стр["Расходы_Количество"] = Элементы.ТЧ.ТекущиеДанные["Расходы_Количество"]; КонецЕсли;
				Если Расходы_СтавкаНДСИзменено Тогда Стр["Расходы_СтавкаНДС"] = Элементы.ТЧ.ТекущиеДанные["Расходы_СтавкаНДС"]; КонецЕсли;
				Если Расходы_ВалютаИзменено Тогда Стр["Расходы_Валюта"] = Элементы.ТЧ.ТекущиеДанные["Расходы_Валюта"]; КонецЕсли;
				Если Расходы_УслугаИзменено Тогда Стр["Расходы_Услуга"] = Элементы.ТЧ.ТекущиеДанные["Расходы_Услуга"]; КонецЕсли;
				
				ОбновитьМатематикуСтроки(Стр);
				
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ЗаполнятьПоПервойСтроке Тогда
		
		Для Сч = 1 По ТЧ.Количество()-1 Цикл
			
			ТЧ[Сч][ИмяТекПоля] = ТЧ[0][ИмяТекПоля];
			ОбновитьМатематикуСтроки(ТЧ[Сч]);
			
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьМатематикуСтроки(ТекД)
	
	ТекД.Ставка 				= ТекД.Себестоимость + ТекД.Вознаграждение;
	ТекД.Рентабельность 		= ТекД.Вознаграждение / ?(ТекД.Ставка = 0, 1, ТекД.Ставка);
	
	ТекД.СебестоимостьИтого 	= ТекД.Количество * ТекД.Себестоимость;
	ТекД.ВознаграждениеИтого 	= ТекД.Количество * ТекД.Вознаграждение;
	ТекД.СтавкаИтого 			= ТекД.Количество * ТекД.Ставка;
	
	ТекД.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиент.ПолучитьСуммуНДС(ТекД.СтавкаИтого, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ТекД.СтавкаНДС), Истина, ТекД.НДСВключенВСтоимость);
	
	ТекД.СуммаИтого = ТекД.СтавкаИтого + ?(ТекД.НДСВключенВСтоимость, 0, ТекД.СуммаНДС);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьМатематикуСтроки_Сервер(ТекД)
	
	ТекД.Ставка 				= ТекД.Себестоимость + ТекД.Вознаграждение;
	ТекД.Рентабельность 		= ТекД.Вознаграждение / ?(ТекД.Ставка = 0, 1, ТекД.Ставка);
	
	ТекД.СебестоимостьИтого 	= ТекД.Количество * ТекД.Себестоимость;
	ТекД.ВознаграждениеИтого 	= ТекД.Количество * ТекД.Вознаграждение;
	ТекД.СтавкаИтого 			= ТекД.Количество * ТекД.Ставка;
	
	ТекД.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(ТекД.СтавкаИтого, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ТекД.СтавкаНДС), Истина, ТекД.НДСВключенВСтоимость);
	
	ТекД.СуммаИтого = ТекД.СтавкаИтого + ?(ТекД.НДСВключенВСтоимость, 0, ТекД.СуммаНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСлужебнуюСделку(Команда)
	
	Если НЕ ЗначениеЗаполнено(ТипЗаказа) Тогда
		
		ПоказатьПредупреждение(, "Перед продолжением укажите тип создаваемого заказа!");
		Возврат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Сделка) Тогда
		
		ПоказатьПредупреждение(, "Нельзя создать служебную сделку, если заполнено поле ""Сделка"".");
		Возврат;
		
	КонецЕсли;
	
	Сделка = РаботаСоСделкамиСервер.СоздатьСлужебнуюСделкуДляНакладных(ТипЗаказа);
	
КонецПроцедуры

&НаКлиенте
Процедура УказатьСтрокуДоходов(Команда)
	//ТрундуковСА 24.06.2025 #112557 Реализованна проверка на выбор множества строк
	Если Элементы.ТЧ.ВыделенныеСтроки.Количество() > 1 тогда
		ПоказатьПредупреждение(, "Необходимо выбрать только одну строку.");
		Возврат;
	КонецЕсли;
	//ТрундуковСА 24.06.2025 #112557
	
	ТекД = Элементы.ТЧ.ТекущиеДанные;
	//МальцевАН 09.04.2024 #83697 Неиспользуемый функционал
	//(
	//Если Элементы.ТЧ.ВыделенныеСтроки.Количество() > 1 Тогда
	//	// вариант: выбор строки доходов сразу для нескольких строк таблицы
	//	// ДИТ US 47112 TA 62979 Евсенкин М.А. Начало: 28.12.2022
	//	//МальцевАН 09.04.2024 #83697 
	//	//(
	//	мПараметры = Новый Структура("Сделка, РежимРаботыФормы", Сделка, РежимРаботыФормы);
	//	мТекст = "доходов";
	//	Если ДанныеИзСП Тогда 
	//		мТекст = "состава поезда";
	//		
	//		мПараметры.Вставить("ДанныеИзСП",ДанныеИзСП); 
	//		мПараметры.Вставить("Фильтр",Новый Структура("СписокКТК,СписокВагонов,СписокТД",ТекД.СписокКТК,ТекД.СписокВагонов,ТекД.СписокТД));
	//		//)
	//		//МальцевАН 09.04.2024 #83697
	//	КонецЕсли;
	//	// ДИТ US 47112 TA 62979 Евсенкин М.А. Конец: 28.12.2022
	//			
	//	ТребуетсяСтрокаДоходов = Истина;
	//	Для каждого Стр из Элементы.ТЧ.ВыделенныеСтроки Цикл
	//		ТребуетсяСтрокаДоходов = ТЧ.НайтиПоИдентификатору(Стр).ТребуетсяУказатьСтрокуДоходов И ТребуетсяСтрокаДоходов;
	//	КонецЦикла;
	//	Если ТребуетсяСтрокаДоходов = Ложь Тогда
	//		ПоказатьПредупреждение(, СтрШаблон("Не все выбранные строки требуют указания строки %1.",мТекст)); // ДИТ US 47112 TA 62979 Евсенкин М.А. 28.12.2022
	//	Иначе
	//		ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораСтрокиДоходовСделкиНесколькоСтрок", ЭтаФорма);
	//		//Евросиб - АСуслов 12.01.2023 13:36:51 #63368
	//		//(
	//		//ОткрытьФорму("Документ.Сделка.Форма.ФормаВыбораСтрокиДоходовДляСвязи", Новый Структура("Сделка", Сделка),, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//		ОткрытьФорму("Документ.Сделка.Форма.ФормаВыбораСтрокиДоходовДляСвязи", мПараметры,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//		//)
	//		//Евросиб - АСуслов 12.01.2023 13:37:22 #63368
	//	КонецЕсли;
	//
	//)
	//МальцевАН 09.04.2024 #83697
	Если ТекД <> неопределено И ТекД.ТребуетсяУказатьСтрокуДоходов = Истина И ЗначениеЗаполнено(Сделка) Тогда
		// вариант: выбор строки доходов для одной строки таблицы
		
		ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораСтрокиДоходовСделки", ЭтаФорма);
		// ДИТ US 47112 TA 62979 Евсенкин М.А. Начало: 28.12.2022
		мПараметры = Новый Структура;
		мПараметры.Вставить("Сделка", Сделка);
		//Евросиб - АСуслов 12.01.2023 13:39:57 #63368
		//(
		мПараметры.Вставить("РежимРаботыФормы", РежимРаботыФормы);
		//)
		//Евросиб - АСуслов 12.01.2023 13:40:00 #63368
		Если ДанныеИзСП Тогда 
			мПараметры.Вставить("ДанныеИзСП",ДанныеИзСП); 
			мПараметры.Вставить("Фильтр",Новый Структура("СписокКТК,СписокВагонов,СписокТД",ТекД.СписокКТК,ТекД.СписокВагонов,ТекД.СписокТД));
		КонецЕсли;
		// ДИТ US 47112 TA 62979 Евсенкин М.А. Конец: 28.12.2022
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 04-08-2025, начало
		мПараметры.Вставить("РежимДобавленияВозмещаемых", РежимДобавленияВозмещаемых);
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 04-08-2025, конец
		ОткрытьФорму("Документ.Сделка.Форма.ФормаВыбораСтрокиДоходовДляСвязи", мПараметры,, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ПоказатьПредупреждение(, "Необходимо выбрать сделку и строчку, для которой требуется указать строку состава поезда"); // ДИТ US 47112 TA 62979 Евсенкин М.А. 28.12.2022
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораСтрокиДоходовСделки(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 <> неопределено Тогда
		
		ТекД = Элементы.ТЧ.ТекущиеДанные;
		ТекД.ТребуетсяУказатьСтрокуДоходов = Ложь;
		//ДИТ Шевченко А.В. US 47112 ТА 69407 21.06.2023 -Начало
		Если НЕ ДанныеИзСП Тогда
			//ЗаполнитьЗначенияСвойств(ТекД, П1);
			//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 06-08-2025, начало
			Если РежимДобавленияВозмещаемых = 2 Тогда
				ЗаполнитьЗначенияСвойств(ТекД, П1, ,"Себестоимость,СуммаИтого");
			Иначе 
				ЗаполнитьЗначенияСвойств(ТекД, П1);
			КонецЕсли;
			//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 06-08-2025, конец
		Иначе
			ЗаполнитьЗначенияСвойств(ТекД, П1,,"СписокКТК,СписокВагонов,СписокТД");
		КонецЕсли;
		ТекД.ГУИДСтрокиДоходов = П1.ГУИДСтрокиДоходов;
		
		Если НЕ ДанныеИзСП Тогда
			МассивКТК = СтрРазделить(П1.СписокКТК, ";", Ложь);
			Для каждого Стр из МассивКТК Цикл
				КТК = РаботаСКонтейнерамиСервер.Нормализовать_и_НайтиКТК(Стр, неопределено);
				ТекД.СписокКТК.Добавить(КТК);
			КонецЦикла;
			
			МассивВагонов = СтрРазделить(П1.СписокВагонов, ";", Ложь);
			Для каждого Стр из МассивВагонов Цикл
				КТК = РаботаСКонтейнерамиСервер.ПолучитьВагонПоНомеру(Стр, Ложь);
				ТекД.СписокВагонов.Добавить(КТК);
			КонецЦикла;
		КонецЕсли;
		//ДИТ Шевченко А.В. US 47112 ТА 69407 21.06.2023 -Конец
	КонецЕсли;
	
КонецПроцедуры

//МальцевАН 09.04.2024 #83697 Неиспользуемый функционал
//(
//&НаКлиенте
//Процедура ОбработкаВыбораСтрокиДоходовСделкиНесколькоСтрок(П1 = неопределено, П2 = неопределено) Экспорт
//	
//	Если П1 <> неопределено Тогда
//		
//		Для каждого Стр из Элементы.ТЧ.ВыделенныеСтроки Цикл
//			
//			ТекД = ТЧ.НайтиПоИдентификатору(Стр);
//			
//			ТекД.ТребуетсяУказатьСтрокуДоходов = Ложь;
//			
//			ЗаполнитьЗначенияСвойств(ТекД, П1);
//			ТекД.ГУИДСтрокиДоходов = П1.ГУИДСтрокиДоходов;
//			
//			МассивКТК = СтрРазделить(П1.СписокКТК, ";", Ложь);
//			Для каждого Стр из МассивКТК Цикл
//				КТК = РаботаСКонтейнерамиСервер.Нормализовать_и_НайтиКТК(Стр, неопределено);
//				ТекД.СписокКТК.Добавить(КТК);
//			КонецЦикла;
//			
//			МассивВагонов = СтрРазделить(П1.СписокВагонов, ";", Ложь);
//			Для каждого Стр из МассивВагонов Цикл
//				КТК = РаботаСКонтейнерамиСервер.ПолучитьВагонПоНомеру(Стр, Ложь);
//				ТекД.СписокВагонов.Добавить(КТК);
//			КонецЦикла;
//			
//		КонецЦикла;
//		
//	КонецЕсли;
//	
//КонецПроцедуры
//)
//МальцевАН 09.04.2024 #83697 Неиспользуемый функционал
&НаКлиенте
Процедура ТЧПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	НСтр = ТЧ.Добавить();
	НСтр.УслугаВнеСтавки = Истина;
	НСтр.ИсточникПоявленияСтрокиЭкономики = ПредопределенноеЗначение("Перечисление.ИсточникПоявленияСтрокиЭкономики.ПроизвольнаяУслугаВручную");
	НСтр.Доходы = Истина;
	НСтр.Расходы = Истина;
	НСтр.РазмерКТК = ПредопределенноеЗначение("Справочник.РазмерыКТК.К40");  
	
	// ДИТ US 71603 ТА 72312 Сержантова А.С. Начало: 14.07.2023
	Если Параметры.Свойство("УслугиЗаСчетЧистойПрибыли") Тогда
		НСтр.РасходыЗаСчетЧП = Истина;
	КонецЕсли;
	// ДИТ US 71603 ТА 72312 Сержантова А.С. Конец: 14.07.2023 
	
	ОпределитьНоменклатурнуюГруппу();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьНоменклатурнуюГруппу()
	
	Для каждого Стр из ТЧ Цикл
		
		Если НЕ ЗначениеЗаполнено(Стр.НоменклатурнаяГруппа) И ЗначениеЗаполнено(ТипЗаказа) Тогда
			
			Стр.НоменклатурнаяГруппа = РазнесениеЗатратСервер.ПодобратьНоменклатурнуюГруппуПоНаборуПараметров(ТипЗаказа, СтрСоединить(Стр.СписокВагонов.ВыгрузитьЗначения(), ";"));
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьИзКалькуляции(Команда)
	
	ТекД = Элементы.ТЧ.ТекущиеДанные;
	Если ТекД <> неопределено И ЗначениеЗаполнено(ТекД.Калькуляция) Тогда
		ПродолжитьОткрытиеВыбораУслуги(ТекД.Калькуляция);
	Иначе
		ОпОп = Новый ОписаниеОповещения("ПродолжитьОткрытиеВыбораУслуги", ЭтаФорма);
		ОткрытьФорму("Документ.Калькуляция.ФормаВыбора",,, ЭтаФорма.УникальныйИдентификатор,,, ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОткрытиеВыбораУслуги(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 <> неопределено Тогда
		ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораУслугиИзКалькуляции", ЭтаФорма);
		ОткрытьФорму("Документ.Сделка.Форма.ФормаДобавленияУслугиИзКалькуляции", Новый Структура("Калькуляция, РазмерКТК", П1, ?(Элементы.тч.ТекущиеДанные = неопределено, ПредопределенноеЗначение("Справочник.РазмерыКТК.К40"), Элементы.тч.ТекущиеДанные.РазмерКТК)),,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораУслугиИзКалькуляции(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	
	УслугаЕИ = ОбщегоНазначенияКлиент.ЗначенияРеквизитовОбъекта(П1.Услуга, "ЕдиницаИзмерения");
	
	НСтр = ТЧ.Добавить();
	ЗаполнитьЗначенияСвойств(НСтр, П1);
	НСтр.Перевыставляемая = П1.ТипСтавки <> ПредопределенноеЗначение("Перечисление.ТипыСтавокПротокола.Ставка");
	НСтр.УслугаВнеСтавки = Истина;
	НСтр.ЕдиницаИзмерения = УслугаЕИ.ЕдиницаИзмерения;
	НСтр.ИсточникПоявленияСтрокиЭкономики = ПредопределенноеЗначение("Перечисление.ИсточникПоявленияСтрокиЭкономики.ДопИзКалькуляцииВручную");
	НСтр.Доходы = Истина;
	НСтр.Расходы = Истина;
	
	ОпределитьНоменклатурнуюГруппу();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВСделку(Команда)
	
	МассивСтрокиБезСП = Новый Массив;
	Отказ = Ложь;
	Сч = 0; //ДИТ Шевченко А.В. US 73827 ТА 74051 23.08.2023
	Для каждого Стр из ТЧ Цикл
		Сч = Сч + 1; //ДИТ Шевченко А.В. US 73827 ТА 74051 23.08.2023
		
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0382938, 17-01-2025, начало
		Если ДанныеИзСП И НЕ ЗначениеЗаполнено(Стр.ГУИДСП) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо указать строку состава поезда", ,ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТЧ", Сч, "ТребуетсяУказатьСтрокуДоходов"));
			Отказ = Истина;
			Продолжить;
		КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, Ticket#0382938, 17-01-2025, конец
		
		Если НЕ ЗначениеЗаполнено(Стр.ГУИДСП) Тогда Стр.ГУИДСП = Строка(Новый УникальныйИдентификатор); КонецЕсли; //ДИТ Шевченко А.В. US 68330 ТА 69907 16.05.2023 
		//Евросиб - АСуслов 08.11.2023 13:03:32 #77057
		//(
		//Если НЕ ЗначениеЗаполнено(Стр.ГУИДСтрокиДоходов) Тогда Стр.ГУИДСтрокиДоходов = Строка(Новый УникальныйИдентификатор); КонецЕсли;
		//)
		//Евросиб - АСуслов 08.11.2023 13:03:34 #77057
		Если НЕ ЗначениеЗаполнено(Стр.ГУИДРасходов) Тогда Стр.ГУИДРасходов = Строка(Новый УникальныйИдентификатор); КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Стр.НоменклатурнаяГруппа) Тогда
			Сообщить("Перед продолжением необходимо заполнить номенклатурную группу!", СтатусСообщения.ОченьВажное);
			Отказ = Истина;
		КонецЕсли;
		//Евросиб - АСуслов 25.03.2021 11:44:13 #0225426 
		//(
		//Если Стр.Доходы = Истина И НЕ ЗначениеЗаполнено(Стр.РазмерКТК) Тогда
		//	Сообщить("Перед продолжением необходимо заполнить размер КТК!", СтатусСообщения.ОченьВажное);
		//	Отказ = Истина;
		//КонецЕсли;
		//)
		//Евросиб - АСуслов 25.03.2021 11:44:14 #0225426 
		Если Стр.Доходы = Истина И НЕ ЗначениеЗаполнено(Стр.ПСЦ) Тогда
			Сообщить("Перед продолжением необходимо заполнить ПСЦ!", СтатусСообщения.ОченьВажное);
			Отказ = Истина;
		КонецЕсли;
		Если Стр.Доходы = Истина И (НЕ ЗначениеЗаполнено(Стр.Клиент) ИЛИ НЕ ЗначениеЗаполнено(Стр.Клиент)) Тогда
			Сообщить("Перед продолжением необходимо заполнить клиента и договор!", СтатусСообщения.ОченьВажное);
			Отказ = Истина;
		КонецЕсли;
		//ДИТ Шевченко А.В. US 73827 ТА 74051 23.08.2023 -начало
		Если ДанныеИзСП Тогда
			Если Стр.ТребуетсяУказатьСтрокуДоходов Тогда
				МассивСтрокиБезСП.Добавить(Сч);
				Отказ = Истина;
			КонецЕсли;	
		КонецЕсли;
		//ДИТ Шевченко А.В. US 73827 ТА 74051 23.08.2023 -конец
		
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 04-08-2025, начало
		Если РежимДобавленияВозмещаемых = 2 Тогда
			Стр.ПривязкаКорректировкаОтчетаКомитенту = Истина;
		КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 04-08-2025, конец
			
	КонецЦикла;
	//ДИТ Шевченко А.В. US 73827 ТА 74051 23.08.2023 -начало
	Если МассивСтрокиБезСП.Количество() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Укажите строку состава поезда для строки № %1",СтрСоединить(МассивСтрокиБезСП,",")));
	КонецЕсли;	
	//ДИТ Шевченко А.В. US 73827 ТА 74051 23.08.2023 -конец
		
	// Евросиб US 83437 TA 83438 Рыбьяков К.А. 11.06.2024 ((
	Если ЗначениеЗаполнено(Сделка) Тогда
		СделкаПометкаУдаления = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Сделка, "ПометкаУдаления");
		Если СделкаПометкаУдаления Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru = '""%1"" помечена на удаление. Добавление расходов в сделку запрещено.'"), Сделка), ,"Сделка");
			Отказ = Истина;
		КонецЕсли;	
	ИначеЕсли Не ЗначениеЗаполнено(Сделка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Сделка не заполнена.'"), ,"Сделка");
		Отказ = Истина;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 11.06.2024 ))
	
	Если Отказ Тогда Возврат; КонецЕсли;
	
	Если ИнтерактивнаяРабота Тогда
		
		Результат = Новый Массив;
		Для каждого Стр из ТЧ Цикл
			//Евросиб Каблов 13.09.2022 ( 57446
			//НСтрока = Новый Структура("УслугаРасхода,Клиент,Договор,Услуга,Калькуляция,ПСЦ,Количество,СписокКТК,СписокВагонов,СписокТД,СтавкаНДС,НДСВключенВСтоимость,Груз,РазмерКТК,Валюта,Перевыставляемая,НоменклатурнаяГруппа,НомерРеестра,Подсыл,Комментарий,НеВыставлятьКлиенту,УслугаВнеСтавки,ПроцентВознаграждения,СтавкаНДСВознаграждения,ВознаграждениеВключаетНДС,ЕдиницаИзмерения,Коносамент,ИсточникПоявленияСтрокиЭкономики,Себестоимость,СебестоимостьИтого,Вознаграждение,ВознаграждениеИтого,Ставка,СтавкаИтого,Рентабельность,СуммаНДС,СуммаИтого,Расходы_Поставщик,Расходы_Договор,Расходы_Услуга,ВнутренняяСебестоимость,НеВключатьВПлановыеРасходы,ПунктОтправления,ПунктНазначения,ОтнестиНаЗатраты,Доходы,Расходы,Расходы_СтавкаНДС,Расходы_НДСВключенВСтоимость,Расходы_Количество,Расходы_Валюта,ИсходныйНомерСтроки,ГУИДСтрокиДоходов, ПериодВО, ПТУ, ГУИДРасходов",
			//Стр.УслугаРасхода,Стр.Клиент,Стр.Договор,Стр.Услуга,Стр.Калькуляция,Стр.ПСЦ,Стр.Количество,Стр.СписокКТК,Стр.СписокВагонов,Стр.СписокТД,Стр.СтавкаНДС,Стр.НДСВключенВСтоимость,Стр.Груз,Стр.РазмерКТК,Стр.Валюта,Стр.Перевыставляемая,Стр.НоменклатурнаяГруппа,Стр.НомерРеестра,Стр.Подсыл,Стр.Комментарий,Стр.НеВыставлятьКлиенту,Стр.УслугаВнеСтавки,Стр.ПроцентВознаграждения,Стр.СтавкаНДСВознаграждения,Стр.ВознаграждениеВключаетНДС,Стр.ЕдиницаИзмерения,Стр.Коносамент,Стр.ИсточникПоявленияСтрокиЭкономики,Стр.Себестоимость,Стр.СебестоимостьИтого,Стр.Вознаграждение,Стр.ВознаграждениеИтого,Стр.Ставка,Стр.СтавкаИтого,Стр.Рентабельность,Стр.СуммаНДС,Стр.СуммаИтого,Стр.Расходы_Поставщик,Стр.Расходы_Договор,Стр.Расходы_Услуга,Стр.ВнутренняяСебестоимость,Стр.НеВключатьВПлановыеРасходы,Стр.ПунктОтправления,Стр.ПунктНазначения,Стр.ОтнестиНаЗатраты,Стр.Доходы,Стр.Расходы,Стр.Расходы_СтавкаНДС,Стр.Расходы_НДСВключенВСтоимость,Стр.Расходы_Количество,Стр.Расходы_Валюта,Стр.ИсходныйНомерСтроки,Стр.ГУИДСтрокиДоходов, ПериодВО, Стр.ПТУ, Стр.ГУИДРасходов);
			НСтрока = Новый Структура("УслугаРасхода,Клиент,Договор,Услуга,Калькуляция,ПСЦ,Количество,СписокКТК,СписокВагонов,СписокТД,СтавкаНДС,НДСВключенВСтоимость,Груз,РазмерКТК,Валюта,Перевыставляемая,НоменклатурнаяГруппа,НомерРеестра,Подсыл,Комментарий,НеВыставлятьКлиенту,УслугаВнеСтавки,ПроцентВознаграждения,СтавкаНДСВознаграждения,ВознаграждениеВключаетНДС,ЕдиницаИзмерения,Коносамент,ИсточникПоявленияСтрокиЭкономики,Себестоимость,СебестоимостьИтого,Вознаграждение,ВознаграждениеИтого,Ставка,СтавкаИтого,Рентабельность,СуммаНДС,СуммаИтого,Расходы_Поставщик,Расходы_Договор,Расходы_Услуга,ВнутренняяСебестоимость,НеВключатьВПлановыеРасходы,ПунктОтправления,ПунктНазначения,ОтнестиНаЗатраты,Доходы,Расходы,Расходы_СтавкаНДС,Расходы_НДСВключенВСтоимость,Расходы_Количество,Расходы_Валюта,ГУИДСтрокиДоходов, ПериодВО, ПТУ, ГУИДРасходов, Гуид, АвтоматическиПривязыватьРасходКДоходу",
			Стр.УслугаРасхода,Стр.Клиент,Стр.Договор,Стр.Услуга,Стр.Калькуляция,Стр.ПСЦ,Стр.Количество,Стр.СписокКТК,Стр.СписокВагонов,Стр.СписокТД,Стр.СтавкаНДС,Стр.НДСВключенВСтоимость,Стр.Груз,Стр.РазмерКТК,Стр.Валюта,Стр.Перевыставляемая,Стр.НоменклатурнаяГруппа,Стр.НомерРеестра,Стр.Подсыл,Стр.Комментарий,Стр.НеВыставлятьКлиенту,Стр.УслугаВнеСтавки,Стр.ПроцентВознаграждения,Стр.СтавкаНДСВознаграждения,Стр.ВознаграждениеВключаетНДС,Стр.ЕдиницаИзмерения,Стр.Коносамент,Стр.ИсточникПоявленияСтрокиЭкономики,Стр.Себестоимость,Стр.СебестоимостьИтого,Стр.Вознаграждение,Стр.ВознаграждениеИтого,Стр.Ставка,Стр.СтавкаИтого,Стр.Рентабельность,Стр.СуммаНДС,Стр.СуммаИтого,Стр.Расходы_Поставщик,Стр.Расходы_Договор,Стр.Расходы_Услуга,Стр.ВнутренняяСебестоимость,Стр.НеВключатьВПлановыеРасходы,Стр.ПунктОтправления,Стр.ПунктНазначения,Стр.ОтнестиНаЗатраты,Стр.Доходы,Стр.Расходы,Стр.Расходы_СтавкаНДС,Стр.Расходы_НДСВключенВСтоимость,Стр.Расходы_Количество,Стр.Расходы_Валюта,Стр.ГУИДСтрокиДоходов, ПериодВО, Стр.ПТУ, Стр.ГУИДРасходов, Стр.Гуид, Стр.АвтоматическиПривязыватьРасходКДоходу);
			//Евросиб Каблов 13.09.2022 )
			НСтрока.Вставить("СписокКТК", Стр.СписокКТК.ВыгрузитьЗначения());
			НСтрока.Вставить("СписокВагонов", Стр.СписокВагонов.ВыгрузитьЗначения());
			НСтрока.Вставить("СписокТД", Стр.СписокТД.ВыгрузитьЗначения());
			Результат.Добавить(НСтрока);
		КонецЦикла;
		Закрыть(Результат);
		
	ИначеЕсли ЗначениеЗаполнено(Сделка) Тогда
		
		//Евросиб Каблов 06.09.2021 ( Ticket#0237622
		//ЗаписатьДанныеСервер();
		//Данные = Новый Массив;
		//Для каждого СтрокаТЧ Из ТЧ Цикл
		//	СтрДанные = Новый Структура("ГУИДРасходов, ИсходныйНомерСтроки", СтрокаТЧ.ГУИДРасходов, СтрокаТЧ.ИсходныйНомерСтроки);
		//	Данные.Добавить(СтрДанные);
		//КонецЦикла; 
		//Закрыть(Новый Структура("Сделка, ТаблицаДанных", Сделка, Данные));
		АдресТаблицы = ПоместитьТаблицуУслугВоВременноеХранилище();
		Результат = Новый Структура;
		Результат.Вставить("АдресТаблицы", АдресТаблицы);
		Результат.Вставить("Сделка", Сделка);
		Результат.Вставить("ДанныеИзСП", ДанныеИзСП); //ДИТ Шевченко А.В. US 68330 ТА 69907 16.05.2023
		Закрыть(Результат);
		//Евросиб Каблов 06.09.2021 )
		
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Каблов 06.09.2021 Ticket#0237622
&НаСервере
Функция ПоместитьТаблицуУслугВоВременноеХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(ТЧ.Выгрузить(), Новый УникальныйИдентификатор);
	
КонецФункции

&НаСервере
//Евросиб Каблов 06.09.2021 ( Ticket#0237622
//Процедура ЗаписатьДанныеСервер()
Процедура Удалить_ЗаписатьДанныеСервер()
//Евросиб Каблов 06.09.2021 )
	
	СделкаОбъект = Сделка.ПолучитьОбъект();
	
	Для каждого Стр из ТЧ Цикл
		
		Если Стр.Доходы = Истина Тогда
			
			НДоходы = неопределено;
			Для каждого ДСтр из СделкаОбъект.Доходы Цикл
				Если ДСтр.ГУИД = Стр.ГУИДСтрокиДоходов Тогда НДоходы = ДСтр; Прервать; КонецЕсли;
			КонецЦикла;
			
			Если НДоходы = неопределено Тогда
				НДоходы = СделкаОбъект.Доходы.Добавить();
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(НДоходы, Стр, "Клиент, Договор, Услуга, Калькуляция, Себестоимость, Вознаграждение, Ставка, Количество, СебестоимостьИтого, ВознаграждениеИтого, СтавкаИтого, Рентабельность, СтавкаНДС, СуммаНДС, НДСВключенВСтоимость, СуммаИтого, Груз, РазмерКТК, Валюта, Перевыставляемая, НоменклатурнаяГруппа, ПСЦ, Подсыл, Комментарий, НеВыставлятьКлиенту, УслугаВнеСтавки, ПроцентВознаграждения, СтавкаНДСВознаграждения, ВознаграждениеВключаетНДС, ЕдиницаИзмерения, ИсточникПоявленияСтрокиЭкономики");
			нДоходы.ГотовоКВыставлению = Истина;
			
			Если СделкаОбъект.СтанцияОтправления = Справочники.Локации.ВСЕ Тогда
				СделкаОбъект.СтанцияОтправления = Стр.ПунктОтправления;
				СделкаОбъект.СтанцияНазначения = Стр.ПунктНазначения;
			КонецЕсли;
			
			НДоходы.ГУИД = Стр.ГУИДСтрокиДоходов;
			НДоходыСписокКТК = СтрСоединить(Стр.СписокКТК.ВыгрузитьЗначения(), ";");
			Если ЗначениеЗаполнено(НДоходыСписокКТК) Тогда
				НДоходыКТКСтр = СделкаОбъект.ДоходыКТК.Добавить();
				НДоходыКТКСтр.ГУИД = НДоходы.ГУИД;
				НДоходыКТКСтр.КТК = НДоходыСписокКТК;
			КонецЕсли;
			НДоходыСписокВагонов = СтрСоединить(Стр.СписокВагонов.ВыгрузитьЗначения(), ";");
			Если ЗначениеЗаполнено(НДоходыСписокВагонов) Тогда
				НДоходыКТКСтр = СделкаОбъект.ДоходыВагоны.Добавить();
				НДоходыКТКСтр.ГУИД = НДоходы.ГУИД;
				НДоходыКТКСтр.Вагон = НДоходыСписокВагонов;
			КонецЕсли;
			НДоходыСписокТД = СтрСоединить(Стр.СписокТД.ВыгрузитьЗначения(), ";");
			Если ЗначениеЗаполнено(НДоходыСписокТД) Тогда
				НДоходыКТКСтр = СделкаОбъект.ДоходыТД.Добавить();
				НДоходыКТКСтр.ГУИД = НДоходы.ГУИД;
				НДоходыКТКСтр.ТД = НДоходыСписокТД;
			КонецЕсли;
			НДоходы.РеестрКлиента = Стр.НомерРеестра;
			НДоходы.ПериодВО = неопределено;
			
			ДоходыПриИзменении(неопределено, НДоходы);
			
		КонецЕсли;
		
		Если Стр.Расходы = Истина Тогда
			
			НРасходы = неопределено;
			Для каждого ДСтр из СделкаОбъект.Расходы Цикл
				Если ДСтр.ГУИД = Стр.ГУИДРасходов Тогда НРасходы = ДСтр; Прервать; КонецЕсли;
			КонецЦикла;
			
			Если НРасходы = неопределено Тогда
				НРасходы = СделкаОбъект.Расходы.Добавить();
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(НРасходы, Стр, "Услуга, Калькуляция, Себестоимость, Количество, СебестоимостьИтого, Груз, ВознаграждениеИтого, ВнутренняяСебестоимость, Валюта, Перевыставляемая, НоменклатурнаяГруппа, Подсыл, Комментарий, НеВключатьВПлановыеРасходы, ПунктОтправления, ПунктНазначения, ИсточникПоявленияСтрокиЭкономики, ЕдиницаИзмерения, ОтнестиНаЗатраты");
			НРасходы.Услуга = Стр.УслугаРасхода;
			
			НРасходы.Поставщик = Стр.Расходы_Поставщик;
			НРасходы.Договор = Стр.Расходы_Договор;
			НРасходы.СтавкаНДС = Стр.Расходы_СтавкаНДС;
			НРасходы.НДСВключенВСтоимость = Стр.Расходы_НДСВключенВСтоимость;
			НРасходы.ГУИД = Стр.ГУИДРасходов;
			НРасходы.Регламентный = Истина;
			НРасходы.ПериодВО = неопределено;
			//Евросиб Каблов 02.07.2021 ( Ticket#0234010
			//НРасходы.УчДокумент = Стр.ПТУ;
			Если ТипЗнч(Стр.ПТУ) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
				//Евросиб - АСуслов 22.03.2023 10:37:22 #0304998
				//(
				//НРасходы.УчДокумент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.ПТУ, "ДокументПоступления");
				НРасходы.УчДокумент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.ПТУ, "ИсходныйДокументПоступления");
				//)
				//Евросиб - АСуслов 22.03.2023 10:37:24 #0304998
			Иначе
				НРасходы.УчДокумент = Стр.ПТУ;
			КонецЕсли;
			//Евросиб Каблов 02.07.2021 )			
			
			НДоходыСписокКТК = СтрСоединить(Стр.СписокКТК.ВыгрузитьЗначения(), ";");
			Если ЗначениеЗаполнено(НДоходыСписокКТК) Тогда
				НДоходыКТКСтр = СделкаОбъект.ДоходыКТК.Добавить();
				НДоходыКТКСтр.ГУИД = НРасходы.ГУИД;
				НДоходыКТКСтр.КТК = НДоходыСписокКТК;
			КонецЕсли;
			НДоходыСписокВагонов = СтрСоединить(Стр.СписокВагонов.ВыгрузитьЗначения(), ";");
			Если ЗначениеЗаполнено(НДоходыСписокВагонов) Тогда
				НДоходыКТКСтр = СделкаОбъект.ДоходыВагоны.Добавить();
				НДоходыКТКСтр.ГУИД = НРасходы.ГУИД;
				НДоходыКТКСтр.Вагон = НДоходыСписокВагонов;
			КонецЕсли;
			НДоходыСписокТД = СтрСоединить(Стр.СписокТД.ВыгрузитьЗначения(), ";");
			Если ЗначениеЗаполнено(НДоходыСписокТД) Тогда
				НДоходыКТКСтр = СделкаОбъект.ДоходыТД.Добавить();
				НДоходыКТКСтр.ГУИД = НРасходы.ГУИД;
				НДоходыКТКСтр.ТД = НДоходыСписокТД;
			КонецЕсли;
			
			СтруктураПоиска = Новый Структура();
			
			Если Стр.СписокКТК.Количество() > 0 Тогда
				СтруктураПоиска.Вставить("Контейнер", Стр.СписокКТК[0].Значение);
			ИначеЕсли Стр.СписокВагонов.Количество() > 0 Тогда
				СтруктураПоиска.Вставить("Вагон", Стр.СписокВагонов[0].Значение);
			ИначеЕсли Стр.СписокТД.Количество() > 0 Тогда
				СтруктураПоиска.Вставить("ЖДН", Стр.СписокТД[0].Значение);
			КонецЕсли;
			
			Если СтруктураПоиска.Количество() > 0 Тогда
				НайдСтроки = СделкаОбъект.СвязьУчетныхЕдиниц.НайтиСтроки(СтруктураПоиска);
				Если НайдСтроки.Количество() > 0 Тогда
					НРасходы.СтрокаСвязьУчетныхЕдиниц = НайдСтроки[0].ГУИД;
				Иначе
					НСтрСвязи = СделкаОбъект.СвязьУчетныхЕдиниц.Добавить();
					НСтрСвязи.ГУИД = Строка(Новый УникальныйИдентификатор);
					НРасходы.СтрокаСвязьУчетныхЕдиниц = НСтрСвязи.ГУИД;
					ЗаполнитьЗначенияСвойств(НСтрСвязи, СтруктураПоиска);
					Если Стр.СписокКТК.Количество() > 0 Тогда
						НСтрСвязи.Контейнер = Стр.СписокКТК[0].Значение;
					КонецЕсли;
					Если Стр.СписокВагонов.Количество() > 0 Тогда
						НСтрСвязи.Вагон = Стр.СписокВагонов[0].Значение;
					КонецЕсли;
					Если Стр.СписокТД.Количество() > 0 Тогда
						НСтрСвязи.ЖДН = Стр.СписокТД[0].Значение;
						НСтрСвязи.НомерЖДН = Стр.СписокТД[0].Значение.НомерТранспортногоДокумента;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			РасходыПриИзменении(неопределено, НРасходы);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.ГУИДСтрокиДоходов) И Стр.Расходы = Истина Тогда
			
			НСвязь = СделкаОбъект.СвязьДоходовИРасходов.Добавить();
			НСвязь.Доходы = Стр.ГУИДСтрокиДоходов;
			НСвязь.Расходы = НРасходы.ГУИД;
			НСвязь.Услуга = Стр.Услуга;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// SIV 31-05-21 Исправление по периодамВО доплатной услуги
	ПересчитатьПериодыНаСервере(СделкаОбъект, Истина);
	
	//Евросиб Каблов 13.04.2021 (
	СделкаОбъект.ДополнительныеСвойства.Вставить("ЗаписьИзАкцепта");
	//Евросиб Каблов 13.04.2021 ) 
	
	СделкаОбъект.Записать();
	Сообщить("Данные сделки " + СделкаОбъект.Ссылка + " обновлены!");
	
КонецПроцедуры

// SIV 31-02-21 скопировано из сделки, т.к. процедура не самостоятельная и нужно реализовать в ней проброс объекта
&НаСервереБезКонтекста
Процедура ПересчитатьПериодыНаСервере(СделкаО, СохранитьИмеющиеся)
	
	//Евросиб Каблов 09.04.2025 ( #105407
	//ДатаОткрытогоПериода = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(СделкаО.Организация);
	ДатаОткрытогоПериода = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериодДоходов(СделкаО.Организация);
	//Евросиб Каблов 09.04.2025 )
	Для каждого Стр из СделкаО.Доходы Цикл
		Если (ЗначениеЗаполнено(Стр.ПериодВО) 
			И СохранитьИмеющиеся = Истина)
			ИЛИ ЗначениеЗаполнено(Стр.УчДокумент)
			Тогда Продолжить; КонецЕсли;
		РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Стр.Договор, "ПравилоФормированияДатыУслуги, ПериодичностьВыставленияДокументов, ДатаПаспортаСделки");
		СтруктураПараметров = Новый Структура("ПериодВО, Клиент, Дата, Номенклатура, СтрокаДоходовСделки, СписокТД, СписокТЕ, НомерСтроки, Коносамент");
		СтруктураПараметров.ПериодВО = ДатаОткрытогоПериода;
		СтруктураПараметров.Клиент = Стр.Клиент;
		СтруктураПараметров.Дата = ТекущаяДата();
		СтруктураПараметров.Номенклатура = Стр.Услуга;
		СтруктураПараметров.СтрокаДоходовСделки = Стр.ГУИД;
		СтруктураПараметров.СписокТД = ПолучитьЗначениеСписочнойТаблицы(СделкаО, "ДоходыТД", Стр.ГУИД);// Стр.СписокТД;
		СтруктураПараметров.СписокТЕ = ПолучитьЗначениеСписочнойТаблицы(СделкаО, "ДоходыКТК", Стр.ГУИД);//Стр.СписокКТК;
		СтруктураПараметров.НомерСтроки = Стр.НомерСтроки;
		СтруктураПараметров.Коносамент = Стр.Коносамент;
		Стр.ПериодВО = ФормированиеДатДокументов.УстановкаДатыДокумента(СделкаО.Ссылка,
														 РеквизитыДоговора.ПравилоФормированияДатыУслуги,
														 РеквизитыДоговора.ПериодичностьВыставленияДокументов,
														 РеквизитыДоговора.ДатаПаспортаСделки,
														 СтруктураПараметров);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеСписочнойТаблицы(СделкаОбъект, ИмяТаблицы, ИскомыйГУИД)
	
	Результат = "";
	
	НайдСтр = СделкаОбъект[ИмяТаблицы].Найти(ИскомыйГУИД, "ГУИД");
	
	Если НайдСтр <> неопределено Тогда
		Если ИмяТаблицы = "ДоходыВагоны" Тогда
			Результат = НайдСтр.Вагон;
		ИначеЕсли ИмяТаблицы = "ДоходыКТК" Тогда
			Результат = НайдСтр.КТК;
		ИначеЕсли ИмяТаблицы = "ДоходыТД" Тогда
			Результат = НайдСтр.ТД;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


&НаСервереБезКонтекста
Процедура ДоходыПриИзменении(Элемент, Знач ТекД = неопределено)
	
	Если ТекД <> неопределено Тогда
		
		ТекД.Ставка 				= ТекД.Себестоимость + ТекД.Вознаграждение;
		ТекД.Рентабельность 		= ТекД.Вознаграждение / ?(ТекД.Ставка = 0, 1, ТекД.Ставка);
		
		ТекД.СебестоимостьИтого 	= ТекД.Количество * ТекД.Себестоимость;
		ТекД.ВознаграждениеИтого 	= ТекД.Количество * ТекД.Вознаграждение;
		ТекД.СтавкаИтого 			= ТекД.Количество * ТекД.Ставка;
		
		ТекД.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(ТекД.СтавкаИтого, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ТекД.СтавкаНДС), Истина, ТекД.НДСВключенВСтоимость);
		
		ТекД.СуммаИтого = ТекД.СтавкаИтого + ?(ТекД.НДСВключенВСтоимость, 0, ТекД.СуммаНДС);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура РасходыПриИзменении(Элемент, Знач ТекД = неопределено)
	
	Если ТекД <> неопределено Тогда
		
		ТекД.СебестоимостьИтого		= ТекД.Себестоимость * ТекД.Количество;
		ТекД.СуммаНДС 				= БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(ТекД.СебестоимостьИтого, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ТекД.СтавкаНДС), Истина, ТекД.НДСВключенВСтоимость);
		ТекД.СуммаИтого 			= ТекД.СебестоимостьИтого + ?(ТекД.НДСВключенВСтоимость, 0, ТекД.СуммаНДС);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗаказаПриИзменении(Элемент)
	
	ОпределитьНоменклатурнуюГруппу();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОпределитьНоменклатурнуюГруппу();
	Если ТЧ.Количество() > 0 Тогда
		УстановитьДоступностьКолонок(Истина, Истина);
		
	КонецЕсли;
	
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, начало
	Если ЗначениеЗаполнено(СвязатьПоВидуТранспортногоСообщения) Тогда
		СвязатьПоВидуТранспортногоСообщенияПриИзменении(Неопределено);
	КонецЕсли;
	//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 113659, 03-07-2025, конец
	
КонецПроцедуры

&НаКлиенте
Процедура СделкаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Сделка) Тогда
		
		// Евросиб US 83437 TA 83438 Рыбьяков К.А. 11.06.2024 ((
		СделкаПометкаУдаления = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Сделка, "ПометкаУдаления");
		Если СделкаПометкаУдаления Тогда 
			Сообщение = Новый СообщениеПользователю;
			ТекстСообщения = СтрШаблон(НСтр("ru = '""%1"" помечена на удаление. Добавление расходов в сделку запрещено.'"), Сделка);
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Поле = "Сделка";
			Сообщение.Сообщить(); 
		КонецЕсли;
		// Евросиб Рыбьяков К.А. 11.06.2024 ))
		
		ДанныеСделки = ОбщегоНазначенияКлиент.ЗначенияРеквизитовОбъекта(Сделка, "ТипЗаказа", Истина);
		ТипЗаказа = ДанныеСделки.ТипЗаказа;
		
		ДанныеСделкиДоходы = ПолучитьСведенияДоходовСделки(Сделка);
		
		// SIV 15-02-21 30340 Реализация задачи по разнесению доп.расходов из акцепта в сделку (постановка А. Новиков, ТФС)
		Если РежимРаботыФормы = 1 ИЛИ РежимРаботыФормы = 2 Тогда
			
			//ДИТ Шевченко А.В. US 68330 ТА 69907 16.05.2023 -Начало
			Автоподбор();

			Сч = 0;
			Для Каждого Стр Из ТЧ Цикл 
				Сч = Сч + 1;
				Если Стр.ТребуетсяУказатьСтрокуДоходов Тогда 
					ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Не удалось однозначно определить строку состава поезда для строки № %1",Сч));
				КонецЕсли;
			КонецЦикла;	
			//ДИТ Шевченко А.В. US 68330 ТА 69907 16.05.2023 -Конец
			
			//Сч = 0;
			//Для каждого Стр из ТЧ Цикл
			//	Сч = Сч + 1;
			//	
			//	Если ЗначениеЗаполнено(Стр.Клиент) Тогда Продолжить; КонецЕсли;
			//	
			//	КлиентыПоФильтруКТК = Новый Массив;
			//	КлиентыПоФильтруВагонов = Новый Массив;
			//	
			//	Для каждого СтрНашКТК Из Стр.СписокКТК Цикл
			//		Для каждого Стр8 из ДанныеСделкиДоходы Цикл
			//			СписокКТКДоходов = СтрРазделить(Стр8.СписокКТК, ";", Ложь);
			//			Если СписокКТКДоходов.Найти(Строка(СтрНашКТК)) <> неопределено Тогда
			//				Если КлиентыПоФильтруКТК.Найти(Стр8.Договор) = неопределено Тогда КлиентыПоФильтруКТК.Добавить(Стр8.Договор); КонецЕсли;
			//			КонецЕсли;
			//		КонецЦикла;
			//	КонецЦикла;
			//	
			//	Для каждого СтрНашВагон Из Стр.СписокВагонов Цикл
			//		Для каждого Стр8 из ДанныеСделкиДоходы Цикл
			//			СписокВагоновДоходов = СтрРазделить(Стр8.СписокВагонов, ";", Ложь);
			//			Если СписокВагоновДоходов.Найти(Строка(СтрНашВагон)) <> неопределено Тогда
			//				Если КлиентыПоФильтруВагонов.Найти(Стр8.Договор) = неопределено Тогда КлиентыПоФильтруВагонов.Добавить(Стр8.Договор); КонецЕсли;
			//			КонецЕсли;
			//		КонецЦикла;
			//	КонецЦикла;
			//	
			//	Если КлиентыПоФильтруКТК.Количество() = 1 Тогда
			//		
			//		Стр.Договор = КлиентыПоФильтруКТК[0];
			//		Стр.Клиент = ПолучитьКлиента(Стр.Договор);
			//		
			//	//ИначеЕсли КлиентыПоФильтруКТК.Количество() = 0 И КлиентыПоФильтруВагонов.Количество() = 1 Тогда
			//	//ДИТ, Беляев СЮ, Ticket#0309557, 12-05-2023, начало  (определяем по вагону, если не нашли по КТК и КТК не заполнены)
			//	ИначеЕсли КлиентыПоФильтруКТК.Количество() = 0 
			//		И КлиентыПоФильтруВагонов.Количество() = 1 
			//		И НЕ ЗначениеЗаполнено(Стр.СписокКТК) Тогда
			//	//ДИТ, Беляев СЮ, Ticket#0309557, 12-05-2023, конец
			//		
			//		Стр.Договор = КлиентыПоФильтруВагонов[0];
			//		Стр.Клиент = ПолучитьКлиента(Стр.Договор);
			//		
			//	Иначе
			//		
			//		Сообщить("Не удалось однозначно определить клиента и договор для строки № " + Сч);
			//		
			//	КонецЕсли;
			//	
			//КонецЦикла;
			
		КонецЕсли;
		
		Если РежимРаботыФормы = 3 Тогда
			// ДИТ US 47112 TA 62979 Евсенкин М.А. Начало: 27.12.2022
			Автоподбор();

			Сч = 0;
			Для Каждого Стр Из ТЧ Цикл 
				Сч = Сч + 1;
				Если Стр.ТребуетсяУказатьСтрокуДоходов Тогда 
					ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Не удалось однозначно определить строку состава поезда для строки № %1",Сч));
				КонецЕсли;
			КонецЦикла;	
			// ДИТ US 47112 TA 62979 Евсенкин М.А. Конец: 27.12.2022

			//Сч = 0;
			//Для каждого Стр из ТЧ Цикл
			//	
			//	Сч = Сч + 1;
			//	Если Стр.ТребуетсяУказатьСтрокуДоходов = Ложь Тогда Продолжить; КонецЕсли;
				
				//КлиентыПоФильтруКТК = Новый Массив;
				//КлиентыПоФильтруВагонов = Новый Массив;
				//
				////Евросиб Каблов 29.06.2021 ( Ticket#0234670
				//СтрокаПоКТК = Неопределено;
				//СтрокаПоВагону = Неопределено;
				////Евросиб Каблов 29.06.2021 )
				//// ДИТ US 47112 TA 62979 Евсенкин М.А. Начало: 27.12.2022
				//// Было:
				////Для каждого СтрНашКТК Из Стр.СписокКТК Цикл
				////	Для каждого Стр8 из ДанныеСделкиДоходы Цикл
				////		Если Стр8.УслугаВнеСтавки = Истина Тогда Продолжить; КонецЕсли;
				////		СписокКТКДоходов = СтрРазделить(Стр8.СписокКТК, ";", Ложь);
				////		Если СписокКТКДоходов.Найти(Строка(СтрНашКТК)) <> неопределено Тогда
				////			Если КлиентыПоФильтруКТК.Найти(Стр8.Договор) = неопределено Тогда КлиентыПоФильтруКТК.Добавить(Стр8.Договор); КонецЕсли;
				////			//Евросиб Каблов 29.06.2021 ( Ticket#0234670							
				////			Если СтрокаПоКТК = неопределено Тогда
				////				СтрокаПоКТК = Стр8;
				////			КонецЕсли;
				////			//Евросиб Каблов 29.06.2021 )
				////		КонецЕсли;
				////	КонецЦикла;
				////КонецЦикла; 
				//
				////Для каждого СтрНашВагон Из Стр.СписокВагонов Цикл
				////	Для каждого Стр8 из ДанныеСделкиДоходы Цикл
				////		Если Стр8.УслугаВнеСтавки = Истина Тогда Продолжить; КонецЕсли;
				////		СписокВагоновДоходов = СтрРазделить(Стр8.СписокВагонов, ";", Ложь);
				////		Если СписокВагоновДоходов.Найти(Строка(СтрНашВагон)) <> неопределено Тогда
				////			Если КлиентыПоФильтруВагонов.Найти(Стр8.Договор) = неопределено Тогда КлиентыПоФильтруВагонов.Добавить(Стр8.Договор); КонецЕсли;
				////			//Евросиб Каблов 29.06.2021 ( Ticket#0234670							
				////			Если СтрокаПоВагону = неопределено Тогда
				////				СтрокаПоВагону = Стр8;
				////			КонецЕсли;
				////			//Евросиб Каблов 29.06.2021 )
				////		КонецЕсли;
				////	КонецЦикла;
				////КонецЦикла;
				////Стало:
				//КлиентыПоФильтруЖДН = Новый Массив;
				//СтрокаПоЖДН = Неопределено; 
				//
				//Для Каждого СтрНашКТК Из Стр.СписокКТК Цикл
				//	Для Каждого Стр8 из ДанныеСвязиУчетныхЕдиниц Цикл
				//		Если СтрНашКТК.Значение = Стр8.Контейнер Тогда
				//			Если КлиентыПоФильтруКТК.Найти(Стр8.Договор) = Неопределено Тогда 
				//				КлиентыПоФильтруКТК.Добавить(Стр8.Договор); 
				//			Иначе 
				//				КлиентыПоФильтруКТК.Очистить();
				//			КонецЕсли;
				//			Если СтрокаПоКТК = Неопределено Тогда
				//				СтрокаПоКТК = Стр8;
				//			КонецЕсли;
				//		КонецЕсли;
				//	КонецЦикла;
				//КонецЦикла;
				//
				//Для Каждого СтрНашВагон Из Стр.СписокВагонов Цикл
				//	Для Каждого Стр8 из ДанныеСвязиУчетныхЕдиниц Цикл
				//		Если СтрНашВагон.Значение = Стр8.СписокВагонов Тогда
				//			Если КлиентыПоФильтруВагонов.Найти(Стр8.Договор) = Неопределено Тогда 
				//				КлиентыПоФильтруВагонов.Добавить(Стр8.Договор); 
				//			Иначе 
				//				КлиентыПоФильтруВагонов.Очистить();
				//			КонецЕсли;
				//			Если СтрокаПоВагону = Неопределено Тогда
				//				СтрокаПоВагону = Стр8;
				//			КонецЕсли;
				//		КонецЕсли;
				//	КонецЦикла;
				//КонецЦикла;
				//
				//Для Каждого СтрНашаЖДН Из Стр.СписокТД Цикл
				//	Для Каждого Стр8 из ДанныеСвязиУчетныхЕдиниц Цикл
				//		Если СтрНашаЖДН.Значение = Стр8.ЖДН Тогда
				//			Если КлиентыПоФильтруЖДН.Найти(Стр8.Договор) = Неопределено Тогда 
				//				КлиентыПоФильтруЖДН.Добавить(Стр8.Договор);
				//			Иначе 
				//				КлиентыПоФильтруЖДН.Очистить();
				//			КонецЕсли;	
				//			Если СтрокаПоЖДН = Неопределено Тогда
				//				СтрокаПоЖДН = Стр8;
				//			КонецЕсли;
				//		КонецЕсли;
				//	КонецЦикла;
				//КонецЦикла;
				//// ДИТ US 47112 TA 62979 Евсенкин М.А. Конец: 27.12.2022

				//Если КлиентыПоФильтруКТК.Количество() = 1 Тогда
				//	
				//	//Евросиб Каблов 29.06.2021 ( Ticket#0234670
				//	//Для каждого Стр8 из ДанныеСделкиДоходы Цикл
				//	//	Если Стр8.УслугаВнеСтавки = Истина Тогда Продолжить; КонецЕсли;
				//	//	Если Стр8.Договор = КлиентыПоФильтруКТК[0] Тогда
				//	//		Стр.ТребуетсяУказатьСтрокуДоходов = Ложь;
				//	//		Стр.Договор = Стр8.Договор;
				//	//		Стр.Клиент = Стр8.Клиент;
				//	//		Стр.ГУИДСтрокиДоходов = Стр8.ГУИДСтрокиДоходов;
				//	//	КонецЕсли;
				//	//КонецЦикла;
				//	Стр.ТребуетсяУказатьСтрокуДоходов = Ложь;
				//	// ДИТ US 47112 TA 62979 Евсенкин М.А. Начало: 11.04.2023
				//	// Было
				//	//Стр.Договор = СтрокаПоКТК.Договор;
				//	//Стр.Клиент = СтрокаПоКТК.Клиент;
				//	//Стр.ГУИДСтрокиДоходов = СтрокаПоКТК.ГУИДСтрокиДоходов; 
				//	//Стр.ВидТранспортногоСообщения = СтрокаПоКТК.ВидТранспортногоСообщения;
				//	//Стр.ТипКалькуляции = СтрокаПоКТК.ТипКалькуляции;
				//	//Стало
				//	ЗаполнитьЗначенияСвойств(Стр,СтрокаПоКТК);
				//	// ДИТ US 47112 TA 62979 Евсенкин М.А. Конец: 11.04.2023
				//	//Евросиб Каблов 29.06.2021 )
				//	
				////ИначеЕсли КлиентыПоФильтруКТК.Количество() = 0 И КлиентыПоФильтруВагонов.Количество() = 1 Тогда
				////ДИТ, Беляев СЮ, Ticket#0309557, 12-05-2023, начало (определяем по вагону, если не нашли по КТК и КТК не заполнены)
				//ИначеЕсли КлиентыПоФильтруКТК.Количество() = 0 
				//	И КлиентыПоФильтруВагонов.Количество() = 1 
				//	И НЕ ЗначениеЗаполнено(Стр.СписокКТК) Тогда
				////ДИТ, Беляев СЮ, Ticket#0309557, 12-05-2023, конец
				//	
				//	//Евросиб Каблов 29.06.2021 ( Ticket#0234670
				//	//Для каждого Стр8 из ДанныеСделкиДоходы Цикл
				//	//	Если Стр8.УслугаВнеСтавки = Истина Тогда Продолжить; КонецЕсли;
				//	//	Если Стр8.Договор = КлиентыПоФильтруВагонов[0] Тогда
				//	//		Стр.ТребуетсяУказатьСтрокуДоходов = Ложь;
				//	//		Стр.Договор = Стр8.Договор;
				//	//		Стр.Клиент = Стр8.Клиент;
				//	//		Стр.ГУИДСтрокиДоходов = Стр8.ГУИДСтрокиДоходов;
				//	//	КонецЕсли;
				//	//КонецЦикла;
				//	Стр.ТребуетсяУказатьСтрокуДоходов = Ложь;
				//	// ДИТ US 47112 TA 62979 Евсенкин М.А. Начало: 11.04.2023
				//	// Было:
				//	//Стр.Договор = СтрокаПоВагону.Договор;
				//	//Стр.Клиент = СтрокаПоВагону.Клиент;
				//	//Стр.ГУИДСтрокиДоходов = СтрокаПоВагону.ГУИДСтрокиДоходов;
				//	//Стало:
				//	ЗаполнитьЗначенияСвойств(Стр,СтрокаПоВагону);

				//	// ДИТ US 47112 TA 62979 Евсенкин М.А. Конец: 11.04.2023
				//	//Евросиб Каблов 29.06.2021 )
				//// ДИТ US 47112 TA 62979 Евсенкин М.А. Начало: 28.12.2022
				//ИначеЕсли КлиентыПоФильтруКТК.Количество() = 0 И КлиентыПоФильтруВагонов.Количество() = 0 И КлиентыПоФильтруЖДН.Количество() = 1 Тогда			
				//	Стр.ТребуетсяУказатьСтрокуДоходов = Ложь;
				//	ЗаполнитьЗначенияСвойств(Стр,СтрокаПоЖДН);
				//// ДИТ US 47112 TA 62979 Евсенкин М.А. Конец: 28.12.2022	
				//Иначе
				//	// ДИТ US 47112 TA 62979 Евсенкин М.А. Начало: 28.12.2022
				//	// Было:
				//	//Сообщить("Не удалось однозначно определить строку доходов сделки для строки № " + Сч); 
				//	//Стало:
				//	ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Не удалось однозначно определить строку состава поезда для строки № %1",Сч)); 
				//	// ДИТ US 47112 TA 62979 Евсенкин М.А. Конец: 28.12.2022
				//КонецЕсли;
			//КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
// ДИТ ДИТ US 47112 TA 62979 Евсенкин М.А. Начало: 25.04.2023
&НаСервере
Процедура Автоподбор()
		
	УслугаФрахта = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("УслугаФрахтаДляКалькуляции");
	ДанныеСвязиУчетныхЕдиниц = ПолучитьСведенияСвязиУчетныхЕдиниц(Сделка); 
	
	ТЗ = Новый ТаблицаЗначений;
	
	Для Каждого Стр Из ДанныеСвязиУчетныхЕдиниц Цикл 
		
		Если ТЗ.Колонки.Количество() = 0 Тогда 
			Для Каждого СтрСтруктура Из Стр Цикл 
				ТЗ.Колонки.Добавить(СтрСтруктура.Ключ);
			КонецЦикла;
		КонецЕсли;	                          
		ЗаполнитьЗначенияСвойств(ТЗ.Добавить(),Стр);
	КонецЦикла;
	
	Если ТЗ.Колонки.Количество() Тогда 
		Для Каждого Стр Из ТЧ Цикл 
			Если Стр.ТребуетсяУказатьСтрокуДоходов Тогда 
				Отбор = Новый Структура;
				Если ЗначениеЗаполнено(Стр.Вагон) Тогда 
					Отбор.Вставить("СписокВагонов",Стр.Вагон);		
				КонецЕсли;	                                  
				Если ЗначениеЗаполнено(Стр.Контейнер) Тогда 
					Отбор.Вставить("Контейнер",Стр.Контейнер);		
				КонецЕсли;	
				// ДИТ ТА 71560 Сержантова А.С. Начало: 19.06.2023  
				// Было:
				//Если ЗначениеЗаполнено(Стр.ТранспортныйДокумент) Тогда 
				//	Отбор.Вставить("ЖДН",Стр.ТранспортныйДокумент);		
				//КонецЕсли;
				// Стало: 
				Если Стр.ТранспортныйДокумент.ВидОперации = Перечисления.ВидыОперацийТранспортныхДокументов.Коносамент Тогда
					 Отбор.Вставить("Коносамент",Стр.ТранспортныйДокумент);
				ИначеЕсли ЗначениеЗаполнено(Стр.ТранспортныйДокумент) Тогда 
					 Отбор.Вставить("ЖДН",Стр.ТранспортныйДокумент);
				КонецЕсли;
				// ДИТ ТА 71560 Сержантова А.С. Конец: 19.06.2023
				Если Стр.Услуга = УслугаФрахта Тогда 
					Отбор.Вставить("ВидТранспортногоСообщения",Перечисления.ВидыТранспортныхСообщений.Море); 
				// ДИТ US 83693 ТА 83970 Сержантова А.С. Начало: 26.04.2024
				ИначеЕсли ЗначениеЗаполнено(СвязатьПоВидуТранспортногоСообщения) Тогда	
					Отбор.Вставить("ВидТранспортногоСообщения", СвязатьПоВидуТранспортногоСообщения);	
				// ДИТ US 83693 ТА 83970 Сержантова А.С. Конец: 26.04.2024
				Иначе      
					Отбор.Вставить("ВидТранспортногоСообщения",Перечисления.ВидыТранспортныхСообщений.ЖД);	
				КонецЕсли;     
				
				МассивСтрок = ТЗ.НайтиСтроки(Отбор);
				Если МассивСтрок.Количество() = 1 Тогда 
					Стр.ТребуетсяУказатьСтрокуДоходов = Ложь;
					ЗаполнитьЗначенияСвойств(Стр,МассивСтрок[0],,"Контейнер,СписокВагонов"); 
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;	
    КонецЕсли;
КонецПроцедуры
// ДИТ ДИТ US 47112 TA 62979 Евсенкин М.А. Конец: 25.04.2023

&НаСервереБезКонтекста
Функция ПолучитьКлиента(Договор)
	Возврат Договор.Владелец;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСведенияДоходовСделки(Сделка)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	СделкаДоходы.Клиент КАК Клиент,
	               |	СделкаДоходы.Договор КАК Договор,
	               |	СделкаДоходы.Услуга КАК Услуга,
	               |	СделкаДоходы.Калькуляция КАК Калькуляция,
	               |	СделкаДоходы.ПСЦ КАК ПСЦ,
	               |	СделкаДоходы.РазмерКТК КАК РазмерКТК,
	               |	СделкаДоходы.ГУИД КАК ГУИД,
	               |	СделкаДоходы.УчДокумент КАК УчДокумент,
	               |	СделкаДоходы.СуммаИтого КАК СуммаИтого,
	               |	ВЫРАЗИТЬ(СделкаДоходыВагоны.Вагон КАК СТРОКА(1000)) КАК СписокВагонов,
	               |	ВЫРАЗИТЬ(СделкаДоходыКТК.КТК КАК СТРОКА(1000)) КАК СписокКТК,
	               |	ВЫРАЗИТЬ(СделкаДоходыТД.ТД КАК СТРОКА(1000)) КАК СписокТД,
	               |	СделкаДоходы.Количество КАК Количество,
	               |	СделкаДоходы.СтавкаНДС КАК СтавкаНДС,
	               |	СделкаДоходы.УслугаВнеСтавки КАК УслугаВнеСтавки,
	               |	СделкаДоходы.ГУИД КАК ГУИДСтрокиДоходов
	               |ИЗ
	               |	Документ.Сделка.Доходы КАК СделкаДоходы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ДоходыВагоны КАК СделкаДоходыВагоны
	               |		ПО СделкаДоходы.Ссылка = СделкаДоходыВагоны.Ссылка
	               |			И СделкаДоходы.ГУИД = СделкаДоходыВагоны.ГУИД
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ДоходыКТК КАК СделкаДоходыКТК
	               |		ПО СделкаДоходы.Ссылка = СделкаДоходыКТК.Ссылка
	               |			И СделкаДоходы.ГУИД = СделкаДоходыКТК.ГУИД
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ДоходыТД КАК СделкаДоходыТД
	               |		ПО СделкаДоходы.Ссылка = СделкаДоходыТД.Ссылка
	               |			И СделкаДоходы.ГУИД = СделкаДоходыТД.ГУИД
	               |ГДЕ
	               |	СделкаДоходы.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Сделка);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		НСтрук = Новый Структура("ГУИДСтрокиДоходов, УслугаВнеСтавки, Клиент, Договор, Услуга, Калькуляция, ПСЦ, РазмерКТК, ГУИД, УчДокумент, СуммаИтого, СписокВагонов, СписокКТК, СписокТД, Количество, СтавкаНДС");
		ЗаполнитьЗначенияСвойств(НСтрук, Ответ);
		Результат.Добавить(НСтрук);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// ДИТ US 47112 TA 62979 Евсенкин М.А. Начало: 27.12.2022
&НаСервереБезКонтекста
Функция ПолучитьСведенияСвязиУчетныхЕдиниц(Сделка)
	
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	СделкаСвязьУчетныхЕдиниц.Клиент КАК Клиент,
	               |	СделкаСвязьУчетныхЕдиниц.Договор КАК Договор,
	               |	СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция,
	               |	СделкаСвязьУчетныхЕдиниц.РазмерКТК КАК РазмерКТК,
				   //ДИТ Шевченко А.В. US 68330 ТА 69907 16.05.2023 -начало
	               //|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИДСтрокиДоходов,
				   |	"""" КАК ГУИДСтрокиДоходов,
				   //ДИТ Шевченко А.В. US 68330 ТА 69907 16.05.2023 -конец
				   // ДИТ ТА 71560 Сержантова А.С. Начало: 19.06.2023
				   |	СделкаСвязьУчетныхЕдиниц.Коносамент КАК Коносамент,
				   // ДИТ ТА 71560 Сержантова А.С. Конец: 19.06.2023
				   |	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИДСП,
	               |	СделкаСвязьУчетныхЕдиниц.ЖДН КАК ЖДН,
	               |	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	               |	СделкаСвязьУчетныхЕдиниц.Вагон КАК СписокВагонов,
	               |	СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения,
	               |	СделкаСвязьУчетныхЕдиниц.Калькуляция.ТипКалькуляции КАК ТипКалькуляции,
	               |	СделкаСвязьУчетныхЕдиниц.Протокол КАК ПСЦ
	               |ИЗ
	               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |ГДЕ
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
	               |	И НЕ СделкаСвязьУчетныхЕдиниц.ОтключитьРасходы
	               |	И НЕ СделкаСвязьУчетныхЕдиниц.НеАктивна";
				   
	Запрос.УстановитьПараметр("Ссылка", Сделка); 
	
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл  
		// ДИТ ТА 71560 Сержантова А.С. Начало: 19.06.2023
		// Было:
		//НСтрук = Новый Структура("СписокВагонов, Контейнер, Клиент, Договор, Калькуляция, РазмерКТК, ГУИДСтрокиДоходов, ЖДН, ВидТранспортногоСообщения, ТипКалькуляции, ПСЦ"); 
		//Стало:
		НСтрук = Новый Структура("СписокВагонов, Контейнер, Клиент, Договор, Калькуляция, РазмерКТК, ГУИДСтрокиДоходов, Коносамент, ЖДН, ВидТранспортногоСообщения, ТипКалькуляции, ПСЦ, ГУИДСП");
		// ДИТ ТА 71560 Сержантова А.С. Конец: 19.06.2023
		ЗаполнитьЗначенияСвойств(НСтрук, Ответ);
		Результат.Добавить(НСтрук);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции	
// ДИТ US 47112 TA 62979 Евсенкин М.А. Конец: 27.12.2022

&НаКлиенте
Процедура ТЧСписокВагоновПриИзменении(Элемент)
	
	ТекД = Элементы.ТЧ.ТекущиеДанные;
	Если ТекД <> неопределено Тогда
		
		ТекД.НоменклатурнаяГруппа = неопределено;
		ОпределитьНоменклатурнуюГруппу();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактированиеКолонок(Команда)
	
	УстановитьДоступностьКолонок(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКолонок(ТолькоПросмотр, ОбновитьВидимостьКолонок = Ложь)
	
	
	// ДОСТУПНОСТЬ
	
	Элементы.ТЧГрупповоеИзменение.ТолькоПросмотр = ТолькоПросмотр;
	//Элементы.ТЧКлиент.ТолькоПросмотр = ТолькоПросмотр;
	//Элементы.ТЧДоговор.ТолькоПросмотр = ТолькоПросмотр;
	//Элементы.ТЧПСЦ.ТолькоПросмотр = ТолькоПросмотр;
	//Элементы.ТЧКалькуляция.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.ТЧУслуга.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.ТЧСписокКТК.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.ТЧСписокВагонов.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.ТЧСписокТД.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.ТЧГруз.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.ТЧВалюта.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.ТЧСтавкаНДС.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.ТЧНДСВключенВСтоимость.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.ТЧПроцентВознаграждения.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.ТЧСтавкаНДСВознаграждения.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.ТЧЕдиницаИзмерения.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.ТЧИсточникПоявленияСтрокиЭкономики.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.ТЧВознаграждениеВключаетНДС.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.ТЧРасходы_Поставщик.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.ТЧРасходы_Договор.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.ТЧРасходы_Валюта.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.ТЧРасходы_СтавкаНДС.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.ТЧРасходы_НДСВключенВСтоимость.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.ТЧРасходы_Услуга.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.ТЧПунктОтправления.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.ТЧПунктНазначения.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.ТЧПТУ.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.ТЧНоменклатурнаяГруппа.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.ТЧСодержаниеАкцепт.ТолькоПросмотр = ТолькоПросмотр;
	//Евросиб - АСуслов 28.10.2024 17:03:39 #93829
	//(
	Элементы.ТЧРасходы.ТолькоПросмотр = Истина;
	Элементы.ТЧДоходы.ТолькоПросмотр = Истина;
	//)
	//Евросиб - АСуслов 28.10.2024 17:32:48 #93829
	
	// ВИДИМОСТЬ
	
	Если ОбновитьВидимостьКолонок Тогда
		
		Элементы.ТЧСодержаниеАкцепт.Видимость = НЕ ИнтерактивнаяРабота;
		Элементы.ТЧГруппа4.Видимость = ИнтерактивнаяРабота;
		
		//Элементы.ТЧСписокКТК.Видимость = ИнтерактивнаяРабота;
		//Элементы.ТЧГруппа5.Видимость = ИнтерактивнаяРабота;
		Элементы.ТЧГруппа6.Видимость = ИнтерактивнаяРабота;
		Элементы.ТЧГруппа7.Видимость = ИнтерактивнаяРабота;
		Элементы.ТЧГруппа8.Видимость = ИнтерактивнаяРабота;
		Элементы.ТЧГруппа9.Видимость = ИнтерактивнаяРабота;
		
		Элементы.ТЧГруппа10.Видимость = ИнтерактивнаяРабота;
		Элементы.ТЧГруппа11.Видимость = ИнтерактивнаяРабота;
		Элементы.ТЧГруппа12.Видимость = ИнтерактивнаяРабота;
		Элементы.ТЧГруппа20.Видимость = ИнтерактивнаяРабота;
		Элементы.ТЧГруппа21.Видимость = ИнтерактивнаяРабота;
		Элементы.ТЧГруппа13.Видимость = ИнтерактивнаяРабота;
		Элементы.ТЧГруппа14.Видимость = ИнтерактивнаяРабота;
		
		Элементы.ТЧГруппа22.Видимость = ИнтерактивнаяРабота;
		Элементы.ТЧГруппа15.Видимость = ИнтерактивнаяРабота;
		Элементы.ТЧГруппаРасходы.Видимость = ИнтерактивнаяРабота;
		Элементы.ТЧУслугаРасхода.Видимость = ИнтерактивнаяРабота;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьИзExcel(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВставкиExcel", ЭтаФорма);
	ОткрытьФорму("Документ.Сделка.Форма.ФормаВставкиЭкономикиИзExcel",,,ЭтаФорма.УникальныйИдентификатор,,,ОпОП,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВставкиExcel(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	Для каждого Стр из П1 Цикл
		
		НСтр = ТЧ.Добавить();
		ЗаполнитьЗначенияСвойств(НСтр, Стр);
		
		НСтр.СписокКТК.ЗагрузитьЗначения(Стр.СписокКТК);
		
		Если НСтр.СписокКТК.Количество() > 0 Тогда
			
			НСтр.РазмерКТК = ПолучитьРазмерКТК(НСтр.СписокКТК[0].Значение);
			
		КонецЕсли;
		
		НСтр.СписокВагонов.ЗагрузитьЗначения(Стр.СписокВагонов);
		
		НСтр.УслугаВнеСтавки = Истина;
		НСтр.ИсточникПоявленияСтрокиЭкономики = ПредопределенноеЗначение("Перечисление.ИсточникПоявленияСтрокиЭкономики.ПроизвольнаяУслугаВручную");
		НСтр.Доходы = Истина;
		НСтр.Расходы = Истина;
		
		ОбновитьМатематикуСтроки(НСтр);
		
	КонецЦикла;

	ОпределитьНоменклатурнуюГруппу();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРазмерКТК(КТК)
	Возврат КТК.ТипТЕ.РазмерКТК;
КонецФункции

&НаКлиенте
Процедура ТЧСписокКТКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораУчЕдиницы", ЭтаФорма, Новый Структура("ТЕ", Истина));
	ОткрытьФорму("ОбщаяФорма.ОкноРедактированияСоставаУчетныхЕдиниц", Новый Структура("ТЕ, СоставТЕ", Истина, СтрСоединить(Элементы.ТЧ.ТекущиеДанные.СписокКТК.ВыгрузитьЗначения(), ";")),, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаКлиенте
Процедура ТЧСписокВагоновНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораУчЕдиницы", ЭтаФорма, Новый Структура("ТС", Истина));
	ОткрытьФорму("ОбщаяФорма.ОкноРедактированияСоставаУчетныхЕдиниц", Новый Структура("ТС, СоставТС", Истина, СтрСоединить(Элементы.ТЧ.ТекущиеДанные.СписокВагонов.ВыгрузитьЗначения(), ";")),, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаКлиенте
Процедура ТЧСписокТДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораУчЕдиницы", ЭтаФорма, Новый Структура("ТД", Истина));
	СписокТД = Новый Массив;
	Для каждого ТД из Элементы.ТЧ.ТекущиеДанные.СписокТД Цикл
		СписокТД.Добавить(ПолучитьКодТД(ТД.Значение));
	КонецЦикла;
	//ОткрытьФорму("ОбщаяФорма.ОкноРедактированияСоставаУчетныхЕдиниц", Новый Структура("ТД, СоставТД", Истина, СтрСоединить(СписокТД, ";")),, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, начало	        
	ДатаПоискаТранпортныхДокументов = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Сделка, "Дата");
	ОткрытьФорму("ОбщаяФорма.ОкноРедактированияСоставаУчетныхЕдиниц", Новый Структура("ТД, СоставТД, ДатаПоискаТранпортныхДокументов", Истина, СтрСоединить(СписокТД, ";"), ДатаПоискаТранпортныхДокументов),, ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, конец	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораУчЕдиницы(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	Если Параметр2.Свойство("ТС") Тогда
		
		Элементы.ТЧ.ТекущиеДанные.СписокВагонов.ЗагрузитьЗначения(Параметр1);
		ТЧСписокВагоновПриИзменении(неопределено);
		
	ИначеЕсли Параметр2.Свойство("ТЕ") Тогда
		
		Элементы.ТЧ.ТекущиеДанные.СписокКТК.ЗагрузитьЗначения(Параметр1);
		
	ИначеЕсли Параметр2.Свойство("ТД") Тогда
		
		Элементы.ТЧ.ТекущиеДанные.СписокТД.ЗагрузитьЗначения(Параметр1);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКодТД(ТД)
	//Возврат ТД.Номер;
	//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, начало 
	Результат = "";
	Если ТипЗнч(ТД) = Тип("ДокументСсылка.ТранспортныйДокумент") Тогда
		Результат = ТД.НомерТранспортногоДокумента;
	КонецЕсли;
	Возврат Результат;
	//ДИТ, Беляев СЮ, Ticket#0270884, 12-05-2022, конец
КонецФункции

&НаКлиенте
Процедура ВставитьКТКИзExcel(Команда)
	
	Если Элементы.ТЧ.ТекущиеДанные = неопределено Тогда Возврат; КонецЕсли;
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВставкиExcel2", ЭтаФорма, Новый Структура("КТК", Истина));
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("КТК", Истина), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВставкиExcel2(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	ТекД = Элементы.ТЧ.ТекущиеДанные;
	
	Если Параметр1 <> неопределено И Параметр2 <> неопределено И Параметр2.Свойство("Вагоны") Тогда
		
		ТекД.СписокВагонов.ЗагрузитьЗначения(Параметр1);
		
	ИначеЕсли Параметр1 <> неопределено И Параметр2 <> неопределено И Параметр2.Свойство("КТК") Тогда
		
		ТекД.СписокКТК.ЗагрузитьЗначения(Параметр1);
		
	ИначеЕсли Параметр1 <> неопределено И Параметр2 <> неопределено И Параметр2.Свойство("ТД") Тогда
		
		ТекД.СписокТД.ЗагрузитьЗначения(Параметр1);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьВагоныИзExcel(Команда)
	
	Если Элементы.ТЧ.ТекущиеДанные = неопределено Тогда Возврат; КонецЕсли;
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВставкиExcel2", ЭтаФорма, Новый Структура("Вагоны", Истина));
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("Вагоны", Истина), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьНакладныеИзExcel(Команда)
	
	Если Элементы.ТЧ.ТекущиеДанные = неопределено Тогда Возврат; КонецЕсли;
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВставкиExcel2", ЭтаФорма, Новый Структура("ТД", Истина));
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("ТД", Истина), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры

// ДИТ US 83693 ТА 83970 Сержантова А.С. 06.05.2024
&НаКлиенте
Процедура СвязатьПоВидуТранспортногоСообщенияПриИзменении(Элемент)     
	Для каждого Строка Из ТЧ Цикл
		Если Строка.ВидТранспортногоСообщения <> СвязатьПоВидуТранспортногоСообщения Тогда
			Строка.ТребуетсяУказатьСтрокуДоходов = Истина;
		КонецЕсли;
	КонецЦикла;
	СделкаПриИзменении(Неопределено);	
КонецПроцедуры

//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 04-08-2025, начало
&НаКлиенте
Процедура РежимДобавленияВозмещаемыхПриИзменении(Элемент)
	Если РежимДобавленияВозмещаемых = 1 Тогда
		ДанныеИзСП = Истина;
		Элементы.ТЧУказатьСтрокуДоходов.Заголовок = "Указать строку состава поезда";
		Элементы.ТЧТребуетсяУказатьСтрокуДоходов.Заголовок = "Укажите строку состава поезда";
		Элементы.ТЧГруппаДоходы.Заголовок = "Состав поезда";
		Элементы.ТЧГруппа31.Видимость = Истина;
	Иначе
		ДанныеИзСП = Ложь;
		Элементы.ТЧУказатьСтрокуДоходов.Заголовок = "Указать строку доходов";
		Элементы.ТЧТребуетсяУказатьСтрокуДоходов.Заголовок = "Укажите строку доходов";
		Элементы.ТЧГруппаДоходы.Заголовок = "Доходы сделки";
		Элементы.ТЧГруппа31.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 113658 / TA 114152, 04-08-2025, конец