// ДИТ Поморцева Т.П. Задача 46996 17.02.22. начало
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
    ДанныеВыбора = Новый СписокЗначений;
    ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.Мультимодальная")); 
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.КонтейнерныйПоезд"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого"));
    ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.ПредоставлениеПССТарифом"));
	//БИТ Белинский Д.А. 06.04.2023 -начало
    //ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.Передислокация"));
    ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.Доплатные"));
    ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.МежсервисныеРасходы"));
    ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.МежсервисныеРасходыРеф"));
	//БИТ Белинский Д.А. 06.04.2023 -конец
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.РефрижераторныеПеревозки"));
	//Евросиб Каблов 12.04.2023 ( Временно, для тестирования
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.Субсидии"));
	//Евросиб Каблов 12.04.2023 )
	//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, начало
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.ВыдачаКТКвРынок"));
	//Евросиб(ДИТ), Беляев СЮ, US 93144 / TA 95492, 29-11-2024, конец
	//ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.Премии"));
	//ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025 
	//Евросиб Коханенко Н.А. 01.08.2025 (( #115687 
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКалькуляций.ДоплатныеПВ"));
	//Евросиб Коханенко Н.А. 01.08.2025 )) #115687   
	
КонецПроцедуры
// ДИТ Поморцева Т.П. Задача 46996 17.02.22. конец
