
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПСЦ") Тогда
		ИсходныйПСЦ = Параметры.ПСЦ;
	КонецЕсли;
	
	ИсходныйПСЦПриИзмененииНаСервере();
	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )



&НаСервере
Процедура ИсходныйПСЦПриИзмененииНаСервере()
	
	МассивКалькуляций = ИсходныйПСЦ.Калькуляции.Выгрузить().ВыгрузитьКолонку("Калькуляция");
	СписокКалькуляций.ЗагрузитьЗначения(МассивКалькуляций);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(ТехнологическаяСхема.ТСх) КАК ТСх
	               |ИЗ
	               |	РегистрСведений.ТехнологическаяСхема КАК ТехнологическаяСхема
	               |ГДЕ
	               |	ТехнологическаяСхема.ПредметТСх В(&КалькуляцииМассив)";
	Запрос.УстановитьПараметр("КалькуляцииМассив", МассивКалькуляций);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		КоличествоТехнологическихСхем = Ответ.ТСх;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ИсходныйПСЦПриИзменении(Элемент)
	ИсходныйПСЦПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура СкопироватьЪ(Команда)
	СкопироватьЪНаСервере();
КонецПроцедуры


&НаСервере
Процедура СкопироватьЪНаСервере()

	ЗапросСхемыКалькуляций = Новый Запрос;
	ЗапросСхемыКалькуляций.Текст = "ВЫБРАТЬ
	                               |	ТехнологическаяСхема.ПредметТСх КАК ПредметТСх,
	                               |	ТехнологическаяСхема.Вариант КАК Вариант,
	                               |	ТехнологическаяСхема.ТСх КАК ТСх
	                               |ИЗ
	                               |	РегистрСведений.ТехнологическаяСхема КАК ТехнологическаяСхема
	                               |ГДЕ
	                               |	ТехнологическаяСхема.ПредметТСх = &ПредметТСх";
	
	Для каждого Клиент из НовыеКопии Цикл
		
		Если ЗначениеЗаполнено(Клиент.НовыйПСЦ) ИЛИ НЕ ЗначениеЗаполнено(Клиент.НовыйКлиент) ИЛИ НЕ ЗначениеЗаполнено(Клиент.НовыйДоговор) Тогда
			Сообщить("В строке " + Клиент.НовыйКлиент + " указан ПСЦ или не указан контрагент. Строка пропущена.");
			Продолжить; 
		КонецЕсли;
		
		НовыйПСЦ = ИсходныйПСЦ.Скопировать();
		НовыйПСЦ.Контрагент = Клиент.НовыйКлиент;
		НовыйПСЦ.Договор = Клиент.НовыйДоговор;
		НовыйПСЦ.дата = ТекущаяДата();
		НовыйПСЦ.Состояния.Очистить();
		
		НовыйПСЦ.Калькуляции.Очистить();
		НовыйПСЦ.КалькуляцииПовагонки.Очистить();
		
		Для каждого Кальк из СписокКалькуляций Цикл
			
			НовКальк = Кальк.Значение.Скопировать();
			НовКальк.Автор = Пользователи.ТекущийПользователь();
			НовКальк.Дата = ТекущаяДата();
			НовКальк.Контрагент = Клиент.НовыйКлиент;
			НовКальк.Договор = Клиент.НовыйДоговор;
			НовКальк.Состояния.Очистить();
			НовКальк.Записать(РежимЗаписиДокумента.Проведение);
			
			ЗапросСхемыКалькуляций.УстановитьПараметр("ПредметТСх", Кальк.Значение);
			ОтветСхемы = ЗапросСхемыКалькуляций.Выполнить().Выбрать();
			Пока ОтветСхемы.Следующий() Цикл
				ТСхКопия = ПостроительТСх_сервер.СкопироватьТСх(ОтветСхемы.ТСх);
				
				МЗ = РегистрыСведений.ТехнологическаяСхема.СоздатьМенеджерЗаписи();
				МЗ.Вариант = ОтветСхемы.Вариант+"_"+Прав(ТСхКопия.Код, 7);
				МЗ.ПредметТСх = НовКальк.ссылка;
				МЗ.ТСх = ТСхКопия;
				МЗ.Записать(Истина);
				
				НовыйПСЦ.Калькуляции.Добавить().Калькуляция = НовКальк.ссылка;
				
			КонецЦикла;
			
		КонецЦикла;
		
		НовыйПСЦ.Записать(РежимЗаписиДокумента.Проведение);
		Клиент.НовыйПСЦ = НовыйПСЦ.Ссылка;
		
	КонецЦикла;
	
КонецПроцедуры

