
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВагоныНаСлежении.Период КАК Период,
		               |	ВагоныНаСлежении.Вагон КАК Вагон,
		               |	ВагоныНаСлежении.НаСлежении КАК НаСлежении,
		               |	ВагоныНаСлежении.ДокументРегистратор КАК ДокументРегистратор
		               |ИЗ
		               |	РегистрСведений.ВагоныНаСлежении КАК ВагоныНаСлежении
		               |ГДЕ
		               |	ВагоныНаСлежении.ДокументРегистратор = &ДокументРегистратор";
		Запрос.УстановитьПараметр("ДокументРегистратор", Ссылка);
		Ответ = Запрос.Выполнить().Выбрать();
		Пока Ответ.Следующий() Цикл
			МЗ = РегистрыСведений.ВагоныНаСлежении.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ, Ответ);
			МЗ.Удалить();
		КонецЦикла;
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	КонтейнерыНаСлежении.Период КАК Период,
		               |	КонтейнерыНаСлежении.Контейнер КАК Контейнер,
		               |	КонтейнерыНаСлежении.НаСлежении КАК НаСлежении,
		               |	КонтейнерыНаСлежении.ДокументРегистратор КАК ДокументРегистратор
		               |ИЗ
		               |	РегистрСведений.КонтейнерыНаСлежении КАК КонтейнерыНаСлежении
		               |ГДЕ
		               |	КонтейнерыНаСлежении.ДокументРегистратор = &ДокументРегистратор";
		Запрос.УстановитьПараметр("ДокументРегистратор", Ссылка);
		Ответ = Запрос.Выполнить().Выбрать();
		Пока Ответ.Следующий() Цикл
			МЗ = РегистрыСведений.КонтейнерыНаСлежении.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ, Ответ);
			МЗ.Удалить();
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АктПостановкиСнятияСУчета") Тогда
		// Заполнение шапки
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		ЦФО = ДанныеЗаполнения.ЦФО;
		Для Каждого ТекСтрокаРегистрацияНовыхВагонов Из ДанныеЗаполнения.РегистрацияНовыхВагонов Цикл
			НоваяСтрока = РегистрацияНовыхВагонов.Добавить();
			НоваяСтрока.ВагонСсылка = ТекСтрокаРегистрацияНовыхВагонов.ВагонСсылка;
		КонецЦикла;
		Для Каждого ТекСтрокаРегистрацияНовыхКонтейнеров Из ДанныеЗаполнения.РегистрацияНовыхКонтейнеров Цикл
			НоваяСтрока = РегистрацияНовыхКонтейнеров.Добавить();
			НоваяСтрока.КонтейнерСсылка = ТекСтрокаРегистрацияНовыхКонтейнеров.КонтейнерСсылка;
		КонецЦикла;
		Для Каждого ТекСтрокаСнятиеСУчетаВагона Из ДанныеЗаполнения.СнятиеСУчетаВагона Цикл
			НоваяСтрока = СнятиеСУчетаВагона.Добавить();
			НоваяСтрока.ВагонСсылка = ТекСтрокаСнятиеСУчетаВагона.ВагонСсылка;
		КонецЦикла;
		Для Каждого ТекСтрокаСнятиеСУчетаКонтейнеров Из ДанныеЗаполнения.СнятиеСУчетаКонтейнеров Цикл
			НоваяСтрока = СнятиеСУчетаКонтейнеров.Добавить();
			НоваяСтрока.КонтейнерСсылка = ТекСтрокаСнятиеСУчетаКонтейнеров.КонтейнерСсылка;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЭтотОбъект.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Для каждого Стр из РегистрацияНовыхВагонов Цикл
			
			МЗ = РегистрыСведений.ВагоныНаСлежении.СоздатьМенеджерЗаписи();
			Мз.Вагон = Стр.ВагонСсылка;
			МЗ.НаСлежении = Истина;
			МЗ.ДокументРегистратор = Ссылка;
			МЗ.Период = Стр.ДатаПостановкиНаСлежение;
			МЗ.Регистратор = Ссылка;
			МЗ.Записать(Истина);
			
		КонецЦикла;
		
		Для каждого Стр из РегистрацияНовыхКонтейнеров Цикл
			
			МЗ = РегистрыСведений.КонтейнерыНаСлежении.СоздатьМенеджерЗаписи();
			Мз.Контейнер = Стр.КонтейнерСсылка;
			МЗ.НаСлежении = Истина;
			МЗ.ДокументРегистратор = Ссылка;
			МЗ.Период = Стр.ДатаПостановкиНаСлежение;
			МЗ.Регистратор = Ссылка;
			МЗ.Записать(Истина);
			
		КонецЦикла;
		
		Для каждого Стр из СнятиеСУчетаВагона Цикл
			
			МЗ = РегистрыСведений.ВагоныНаСлежении.СоздатьМенеджерЗаписи();
			Мз.Вагон = Стр.ВагонСсылка;
			МЗ.НаСлежении = Ложь;
			МЗ.ДокументРегистратор = Ссылка;
			МЗ.Период = Стр.ДатаСнятияСоСлежения;
			МЗ.Регистратор = Ссылка;
			МЗ.Записать(Истина);
			
		КонецЦикла;
		
		Для каждого Стр из СнятиеСУчетаКонтейнеров Цикл
			
			МЗ = РегистрыСведений.КонтейнерыНаСлежении.СоздатьМенеджерЗаписи();
			Мз.Контейнер = Стр.КонтейнерСсылка;
			МЗ.НаСлежении = Ложь;
			МЗ.ДокументРегистратор = Ссылка;
			МЗ.Период = Стр.ДатаСнятияСоСлежения;
			МЗ.Регистратор = Ссылка;
			МЗ.Записать(Истина);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
