Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода,Знач СтруктураПодписантов = Неопределено) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетЗаказ") Тогда
		Если ПараметрыПечати.Свойство("ФормированиеИзДиадок") Тогда
			СтруктураПодписантов = Новый Структура("БезФаксимиле", Истина);
		КонецЕсли; 
		СформироватьПечатнуюФорму(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, "СчетЗаказ", "Счет покупателю", ОбъектыПечати, ПараметрыВывода,СтруктураПодписантов);		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетНаОплатуАнгл") Тогда
		//Евросиб Каблов 03.09.2020 (
		//Для каждого ЭлМассива из МассивОбъектов Цикл		
		//Евросиб Каблов 03.09.2020 )
		
		//Евросиб Каблов 28.03.2022 ( Ticket#0266241
		//УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СчетНаОплатуАнгл", "INVOICE", НапечататьСчетНаОплатуАнгл(МассивОбъектов, ОбъектыПечати),,"Документы.СчетНаОплатуПокупателю.ПФ_MXL_СчетИнЯз");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СчетНаОплатуАнгл", "INVOICE", НапечататьСчетНаОплатуАнгл(МассивОбъектов, ОбъектыПечати, СтруктураПодписантов),,"Документы.СчетНаОплатуПокупателю.ПФ_MXL_СчетИнЯз");
		//Евросиб Каблов 28.03.2022 )
		
		//Евросиб Каблов 03.09.2020 (
		//КонецЦикла;
		//Евросиб Каблов 03.09.2020 )		
	//Евросиб(ДИТ), Беляев СЮ, US 85562/TA 85564, 13-06-2024, начало	
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетНаОплатуАнглВРублях") Тогда
		ТабличныйДокумент = НапечататьСчетНаОплатуАнгл(МассивОбъектов, ОбъектыПечати, СтруктураПодписантов, "СчетНаОплатуАнглВРублях");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СчетНаОплатуАнглВРублях", "INVOICE", ТабличныйДокумент,,"Документы.СчетНаОплатуПокупателю.ПФ_MXL_СчетИнЯз");
	//Евросиб(ДИТ), Беляев СЮ, US 85562/TA 85564, 13-06-2024, конец
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Каблов 28.03.2022 ( Ticket#0266241
////Функция НапечататьСчетНаОплатуАнгл(МассивОбъектов, ОбъектыПечати)
//Функция НапечататьСчетНаОплатуАнгл(МассивОбъектов, ОбъектыПечати, СтруктураПодписантов)
//Евросиб Каблов 28.03.2022 )
//Евросиб(ДИТ), Беляев СЮ, US 85562/TA 85564, 13-06-2024, начало
Функция НапечататьСчетНаОплатуАнгл(МассивОбъектов, ОбъектыПечати, СтруктураПодписантов, ИдентификаторКомандыПечати = Неопределено)
//Евросиб(ДИТ), Беляев СЮ, US 85562/TA 85564, 13-06-2024, конец
	
	Результат = Новый ТабличныйДокумент;
	Результат.АвтоМасштаб = Истина;   
	
	//Евросиб(ДИТ) Антонова А.С. US 103646  Начало 21.03.2025
	ДатаВнедренияНовыхФорматов = Дата(2025,3,25,0,0,0);
	//Евросиб(ДИТ) Антонова А.С. US 103646  Конец 21.03.2025
	
	Первый = Истина;
	Для каждого Док из МассивОбъектов Цикл  
		//ДИТ Шевченко А.В. US 103646 TA 103658 06.03.2025   
		ЭтоСчетПоПремииСубсидии = Ложь;
		Если Док.ДокументыОснования.Количество() > 0 и ТипЗнч(Док.ДокументыОснования[0].Документ) = Тип("ДокументСсылка.Заявка") Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА Заявка.ПСЦ.ТипКалькуляции В (ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Премии), ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Субсидии))
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ЭтоСчетПоПремиямСубсидиям
			|ИЗ
			|	Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка КАК Заявка
			|		ПО СчетНаОплатуПокупателюДокументыОснования.Документ = Заявка.Ссылка
			|ГДЕ
			|	СчетНаОплатуПокупателюДокументыОснования.Ссылка = &Ссылка";
			Запрос.УстановитьПараметр("Ссылка", Док.Ссылка);	
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Выборка.Следующий();
			ЭтоСчетПоПремииСубсидии = Выборка.ЭтоСчетПоПремиямСубсидиям;
		КонецЕсли;
		СтарыйФормат = (Док.Выставлен И НачалоДня(Док.Создано) <= ДатаВнедренияНовыхФорматов) или не ЭтоСчетПоПремииСубсидии;//НачалоДня(ТекущаяДата());
		//ДИТ Шевченко А.В. US 103646 TA 103658 06.03.2025
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.СчетНаОплатуПокупателю.ПФ_MXL_СчетИнЯз", Док.Контрагент, Док.ДоговорКонтрагента);

		Если НЕ Первый Тогда Результат.ВывестиГоризонтальныйРазделительСтраниц(); КонецЕсли;
		
		НомерСтрокиНачало = Результат.ВысотаТаблицы + 1; // Для задания области печати
		
		ОбластьМакета = Макет.ПолучитьОбласть("Логотип");
		// ДИТ 56017 Давудов М.А. Начало: 13.07.2023
		//ок(
		//Если ЗначениеЗаполнено(Док.Организация.ФайлЛоготип) Тогда
		//	ДанныеКартинкиЛоготип = РаботаСФайлами.ДанныеФайла(Док.Организация.ФайлЛоготип);
		//ок)
		Если ЗначениеЗаполнено(Док.Организация.ФайлЛоготипАнгл) Тогда
			ДанныеКартинкиЛоготип = РаботаСФайлами.ДанныеФайла(Док.Организация.ФайлЛоготипАнгл);
		// ДИТ 56017 Давудов М.А. Конец: 13.07.2023
			ДвоичныеДанныеЛоготип = ПолучитьИзВременногоХранилища(ДанныеКартинкиЛоготип.СсылкаНаДвоичныеДанныеФайла);
			Если ЗначениеЗаполнено(ДвоичныеДанныеЛоготип) Тогда
				ОбластьМакета.Рисунки.ЛоготипОрганизации.Картинка = Новый Картинка(ДвоичныеДанныеЛоготип);
			КонецЕсли;
		КонецЕсли;
		Результат.Вывести(ОбластьМакета);

		РуководительКонтрагента = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Контрагент, Док.Дата);
		НашРуководитель = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Организация, Док.Дата);
		
		//ДИТ Давудов М.А. Task32744 03.07.2021 Начало
		ЭтоCreditNote = Док.CreditNote;
		//ДИТ Давудов М.А. Task32744 03.07.2021 Конец
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		
		//ДИТ Шевченко А.В. US 103646 TA 103658 06.03.2025
		Если СтарыйФормат Тогда
			ОбластьШапка.Параметры.Customer = "Supplier";
			ОбластьШапка.Параметры.Supplier = "Customer";
			ОбластьШапка.Параметры.InnCustomer = "Supplier";
		Иначе
			ОбластьШапка.Параметры.Customer = "Customer";
			ОбластьШапка.Параметры.Supplier = "Supplier";
			ОбластьШапка.Параметры.InnCustomer = "Сustomer";
		КонецЕсли;	
		//ДИТ Шевченко А.В. US 103646 TA 103658 06.03.2025
//Евросиб ( Литвинов 21.01.2021 #30025
		//СведенияОбОрганизации    = ПечатьБухгалтерскихДокументов.СведенияОЮрФизЛице(Док.Организация);
		СведенияОбОрганизации    = ПечатьБухгалтерскихДокументов.СведенияОЮрФизЛице(Док.Организация, Док.Дата);
//Евросиб ) Литвинов 21.01.2021 #30025
		СведенияОКОнтрагенте  = ПечатьБухгалтерскихДокументов.СведенияОЮрФизЛице(Док.Контрагент);
		//ДИТ Давудов М.А. Task32744 03.07.2021 Начало
		Если Не ЭтоCreditNote Тогда
			//ок(
			ОбластьШапка.Параметры.НомерСчета = Док.НомерДляПечати;
			ОбластьШапка.Параметры.ДатаСчета = Формат(Док.ДатаДокумента, "ДФ=dd.MM.yyyy");
			//ок)
			ОбластьШапка.Параметры.CreditNote = "";
		Иначе
			ОбластьШапка.Параметры.CreditNote = 
				"CREDIT NOTE " + 
				Док.НомерДляПечати + 
				" date " + 
				Формат(Док.ДатаДокумента, "ДФ=dd.MM.yyyy") +
				" "; 
			РеквизитыОснований = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Док.СчетНаОплатуCreditNote, "НомерДляПечати, ДатаДокумента");
			ОбластьШапка.Параметры.НомерСчета = РеквизитыОснований.НомерДляПечати;
			ОбластьШапка.Параметры.ДатаСчета = Формат(РеквизитыОснований.ДатаДокумента, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		//ДИТ Давудов М.А. Task32744 03.07.2021 Конец
//Евросиб ( Литвинов 21.01.2021 #30025
		//ОбластьШапка.Параметры.НаименованиеОрганизацииАнгл = Док.Организация.НаименованиеПолноеАнгл;
		//ДИТ Шевченко А.В. US 103646 TA 103658 06.03.2025
		Если СтарыйФормат Тогда
			ОбластьШапка.Параметры.НаименованиеОрганизацииАнгл = СведенияОбОрганизации.ПолноеНаименованиеАнгл;
		Иначе
			ОбластьШапка.Параметры.НаименованиеОрганизацииАнгл = СведенияОбОрганизации.ПолноеНаименованиеАнгл + " (Branch office: Container transportation directorate)";
		КонецЕсли;
		//ДИТ Шевченко А.В. US 103646 TA 103658 06.03.2025
//Евросиб ) Литвинов 21.01.2021 #30025
//Евросиб Каблов 06.10.2020 ( Ticket#0209122
		//ОбластьШапка.Параметры.АдресОрганизацииАнгл = СведенияОбОрганизации.ЮридическийАдрес;
		ЮридическийАдресАнгл = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Док.Организация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизацииАнгл, Док.Дата);
		ОбластьШапка.Параметры.АдресОрганизацииАнгл = ЮридическийАдресАнгл;
//Евросиб Каблов 06.10.2020 )
		ОбластьШапка.Параметры.ТелефонОрганизации = СведенияОбОрганизации.Телефоны;
//Евросиб Гудкова( 16.09.2020 Ticket№ 0206338 этот код писал дебил (с)И.С.
		//ОбластьШапка.Параметры.НомерСчетаОрганизации = Док.Организация.ОсновнойБанковскийСчет.НомерСчета;
		//ОбластьШапка.Параметры.Банк = Док.Организация.ОсновнойБанковскийСчет.Банк.МеждународноеНаименование + ", "+Док.Организация.ОсновнойБанковскийСчет.Банк.АдресМеждународный;
//Евросиб Гудкова( 15.10.2020 Ticket№ 0209986
//		ОбластьШапка.Параметры.Банк = ?(ЗначениеЗаполнено(Док.БанковскийСчетОрганизации.Банк.МеждународноеНаименование), Док.БанковскийСчетОрганизации.Банк.МеждународноеНаименование, Док.БанковскийСчетОрганизации.Банк.Наименование)
//				 + ", " + ?(ЗначениеЗаполнено(Док.БанковскийСчетОрганизации.Банк.АдресМеждународный), Док.БанковскийСчетОрганизации.Банк.АдресМеждународный, Док.БанковскийСчетОрганизации.Банк.Адрес);
//		ОбластьШапка.Параметры.НомерСчетаОрганизации = Док.БанковскийСчетОрганизации.НомерСчета;
		РеквизитыСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Док.БанковскийСчетОрганизации, "НомерСчета, Банк, БанкДляРасчетов");
		РеквизитыБанка = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыСчета.Банк, "СВИФТБИК, МеждународноеНаименование");
		КоррСчет = "";
		Если ЗначениеЗаполнено(РеквизитыСчета.БанкДляРасчетов) Тогда
			РеквизитыКоррБанка = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыСчета.БанкДляРасчетов, "СВИФТБИК, МеждународноеНаименование");
			КоррСчет = ",c/bank:" + РеквизитыКоррБанка.МеждународноеНаименование + ",SWIFT:" + РеквизитыКоррБанка.СВИФТБИК;
		КонецЕсли; 
		ОбластьШапка.Параметры.НомерСчетаОрганизации = РеквизитыСчета.НомерСчета;
		ОбластьШапка.Параметры.Банк = СтрШаблон("%1,SWIFT:%2 %3",РеквизитыБанка.МеждународноеНаименование,
															   РеквизитыБанка.СВИФТБИК,
															   КоррСчет);
// Евросиб Гудкова) 		

		//Евросиб(ДИТ), Беляев СЮ, US 85562/TA 85564, 13-06-2024, начало
		Если ИдентификаторКомандыПечати = "СчетНаОплатуАнглВРублях" Тогда
			РеквизитыБанкаДополнительные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыСчета.Банк, "КоррСчет, Код");
			ОбластьШапка.Параметры.Банк = СтрШаблон("cor.acc %1, %2, BIC %3 SWIFT:%4", РеквизитыБанкаДополнительные.КоррСчет, 
																					РеквизитыБанка.МеждународноеНаименование,
																					РеквизитыБанкаДополнительные.Код,
															   						РеквизитыБанка.СВИФТБИК);
			
			//ОбластьШапка.Параметры.Банк + СтрШаблон(", BIC %1, cor.acc %2", РеквизитыБанкаДополнительные.Код, РеквизитыБанкаДополнительные.КоррСчет);
		КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, US 85562/TA 85564, 13-06-2024, конец
		
		ОбластьШапка.Параметры.ИННОрганизации = Док.Организация.ИНН;
		ОбластьШапка.Параметры.НаименованиеКонтрагентаАнгл = ?(ЗначениеЗаполнено(Док.Контрагент.НаименованиеПолноеАнгл),Док.Контрагент.НаименованиеПолноеАнгл,Док.Контрагент.НаименованиеПолное);
		ОбластьШапка.Параметры.АдресКонтрагентаАнгл = СведенияОКОнтрагенте.ЮридическийАдрес;
		ОбластьШапка.Параметры.ТелефонКонтрагента = СведенияОКОнтрагенте.Телефоны;
		
		ОбластьШапка.Параметры.БанкСчет = ""+СведенияОКОнтрагенте.НомерСчета+", "+СведенияОКОнтрагенте.Банк+", "+Док.Контрагент.ОсновнойБанковскийСчет.ВалютаДенежныхСредств;
		ОбластьШапка.Параметры.КлиетСвифт = Док.Контрагент.ОсновнойБанковскийСчет.Банк.СВИФТБИК;
		ОбластьШапка.Параметры.РегистрационныйКод = Док.Контрагент.ИНН;
		ОбластьШапка.Параметры.РегистрационныйНомер = Док.Контрагент.НалоговыйНомер;
		ОбластьШапка.Параметры.КодНДС = Док.Контрагент.КодНДСДляИнвойсов;;
		Если ЗначениеЗаполнено(Док.Грузополучатель) Тогда
			СведенияОГрузополучателе  = ПечатьБухгалтерскихДокументов.СведенияОЮрФизЛице(Док.Грузополучатель);
			ГрузополучательИЕгоАдрес = Док.Грузополучатель.НаименованиеПолноеАнгл; //Нужно добавить адрес на английском
			ОбластьШапка.Параметры.Грузополучатель = ГрузополучательИЕгоАдрес;
			ОбластьШапка.Параметры.ТелефонГрузополучателя = СведенияОГрузополучателе.Телефоны;
		КонецЕсли;
		Если ЗначениеЗаполнено(Док.Грузоотправитель) Тогда
			СведенияОГрузоотправителе  = ПечатьБухгалтерскихДокументов.СведенияОЮрФизЛице(Док.Грузоотправитель);
//Евросиб ( Литвинов 21.01.2021 #30025
			//ГрузоотправительИЕгоАдрес = Док.Грузоотправитель.НаименованиеПолноеАнгл ;
			ГрузоотправительИЕгоАдрес = СведенияОГрузоотправителе.ПолноеНаименованиеАнгл;
//Евросиб ) Литвинов 21.01.2021 #30025
			ОбластьШапка.Параметры.Грузоотправитель =ГрузоотправительИЕгоАдрес; 
			ОбластьШапка.Параметры.ТелефонГрузоотправителя = СведенияОГрузоотправителе.Телефоны;
		КонецЕсли;
		ОбластьШапка.Параметры.НомерДоговора =  Док.ДоговорКонтрагента.Номер;
		ОбластьШапка.Параметры.ДатаДоговора = Док.ДоговорКонтрагента.Дата;
		ОбластьШапка.Параметры.НомерЗаказа = Док.УдалитьСделка.Номер;
		//ДИТ Шевченко А.В. US 103646 TA 103658 06.03.2025
		Если СтарыйФормат Тогда
			ОбластьШапка.Параметры.Протокол = "";
		Иначе
			ТекстПотокола = "";
			ЗаполнитьПСЦДляОснования(Док,Истина,ТекстПотокола);
			ОбластьШапка.Параметры.Протокол = ТекстПотокола;
		КонецЕсли;
		//ДИТ Шевченко А.В. US 103646 TA 103658 06.03.2025
		Результат.Вывести(ОбластьШапка);
		
		//Если Док.Товары.Количество() > 0 И СтрДлина(Док.Товары[0].Содержание) > 180 Тогда
		//	
		//	Результат.ВывестиГоризонтальныйРазделительСтраниц();
		//	
		//КонецЕсли;
		
		// Евросиб Фролов (02.03.2022 Ticket №48083
		ДанныеЗаполнения = Новый Структура;
		ДанныеЗаполнения.Вставить("СтавкаНДС", ПолучитьСтавкуНДС(Док));		
		// Евросиб Фролов)
		
		ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ОбластьМакета.Параметры.Заполнить(ДанныеЗаполнения); // Евросиб Фролов (02.03.2022 Ticket №48083
		Результат.Вывести(ОбластьМакета);
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		
		//Евросиб(ДИТ), Беляев СЮ, US 85562/TA 85564, 13-06-2024, начало
		ВалютаРубль = Справочники.Валюты.Рубль;
		ИтогоВРублях = 0;
		//Евросиб(ДИТ), Беляев СЮ, US 85562/TA 85564, 13-06-2024, конец
		
		//Евросиб(ДИТ), Беляев СЮ, BUG 109491 / TA 111190, 02-06-2025, начало
		ВидЗадолженностиЗаявки = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьВидЗадолженностиПоДокументу(Док);
		Заявка = ПолучитьЗаявкуСчета(Док);
		//Евросиб(ДИТ), Беляев СЮ, BUG 109491 / TA 111190, 02-06-2025, конец
		
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		Для каждого Стр из Док.Товары Цикл
			АнглСодержание = Стр.Номенклатура.НаименованиеПолноеАнгл;
			ПодробноеОписание = Прав(Стр.Содержание,СтрДлина(Стр.Содержание)-(СтрНайти(Стр.Содержание,"по направлению")-1));
			//ДИТ Шевченко А.В. US 103646 TA 103658 06.03.2025
			Если СтарыйФормат Тогда
				АнглСодержание = АнглСодержание + Символы.ПС + ПодробноеОписание;
			Иначе
				//Если СтрНайти(АнглСодержание,"in view of state subsidizing") > 0 Тогда
				//	АнглСодержание = СтрЗаменить(АнглСодержание,"in view of state subsidizing","");	
				//КонецЕсли;
				//Евросиб(ДИТ), Беляев СЮ, BUG 109491 / TA 111190, 02-06-2025, начало
					//Евросиб СубботинВ #112680 25.06.2025 Начало 
                    //Если ВидЗадолженностиЗаявки = Справочники.ВидыЗадолженности.Премии И Заявка <> Неопределено Тогда
					Если ВидЗадолженностиЗаявки = Перечисления.ВидыЗадолженности.Премии И Заявка <> Неопределено Тогда
					//Евросиб СубботинВ #112680 25.06.2025 Конец
					АнглСодержание = АнглСодержание + Документы.СчетНаОплатуПокупателю.ПолучитьОписаниеДляСодержанияПремии( Заявка, Стр.Калькуляция, Истина);
				КонецЕсли;
				//Евросиб(ДИТ), Беляев СЮ, BUG 109491 / TA 111190, 02-06-2025, конец
				АнглСодержание = АнглСодержание + Символы.ПС + ПодробноеОписание;
			КонецЕсли;
			//ДИТ Шевченко А.В. US 103646 TA 103658 06.03.2025
			ОбластьСтрока.Параметры.НаименованиеУслугиАнгл = АнглСодержание;//Англ наименование
			ОбластьСтрока.Параметры.ЕдИзмАнгл = ?(ЗначениеЗаполнено(Стр.ЕдиницаИзмерения),Стр.ЕдиницаИзмерения.МеждународноеСокращение,Стр.Номенклатура.ЕдиницаИзмерения.МеждународноеСокращение);
			ОбластьСтрока.Параметры.КолВо = Стр.Количество;
			//ДИТ Давудов М.А. Task32744 03.07.2021 Начало
			Если Не ЭтоCreditNote Тогда
				//ок(
				ОбластьСтрока.Параметры.Цена = Стр.Цена
				//ок
			Иначе
				ОбластьСтрока.Параметры.Цена = Стр.Цена * (-1);
			КонецЕсли;
			//ДИТ Давудов М.А. Task32744 03.07.2021 Конец
			ОбластьСтрока.Параметры.Валюта = Док.ВалютаДокумента.Наименование;
			//ДИТ Давудов М.А. Task32744 03.07.2021 Начало
			Если Не ЭтоCreditNote Тогда
				//ок(
				ОбластьСтрока.Параметры.Сумма = ?(Док.СуммаВключаетНДС,Стр.Сумма,Стр.Сумма + Стр.СуммаНДС);
				//ок
			Иначе
				ОбластьСтрока.Параметры.Сумма = ?(Док.СуммаВключаетНДС,Стр.Сумма,Стр.Сумма + Стр.СуммаНДС) * (-1);
			КонецЕсли;
			//ДИТ Давудов М.А. Task32744 03.07.2021 Конец
			
			//Евросиб(ДИТ), Беляев СЮ, US 85562/TA 85564, 13-06-2024, начало
			Если ИдентификаторКомандыПечати = "СчетНаОплатуАнглВРублях" Тогда
				ЦенаВРублях = РаботаСКурсамиВалют.ПересчитатьВВалюту(Стр.ЦенаВВалюте, Стр.ИсходнаяВалюта, ВалютаРубль, Док.ДатаДокумента);
				Сумма = Стр.Количество * ЦенаВРублях;
				СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(Сумма, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(Стр.СтавкаНДС), Истина, Док.СуммаВключаетНДС);
				
				ОбластьСтрока.Параметры.Цена = ЦенаВРублях;
				ОбластьСтрока.Параметры.Валюта = ВалютаРубль;
				ОбластьСтрока.Параметры.Сумма = ?(Док.СуммаВключаетНДС, Сумма, Сумма + СуммаНДС);
				
				ИтогоВРублях = ИтогоВРублях + ОбластьСтрока.Параметры.Сумма;
			КонецЕсли;
			//Евросиб(ДИТ), Беляев СЮ, US 85562/TA 85564, 13-06-2024, конец
			
			ПроверяемаяОбласть = Новый Массив;
			ПроверяемаяОбласть.Добавить(ОбластьСтрока);
			ПроверяемаяОбласть.Добавить(ОбластьПодвал);
			ВыводНаСтраницу = ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(Результат, ПроверяемаяОбласть);
			Если Не ВыводНаСтраницу Тогда
				Результат.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли; 
			//Результат.Вывести(ОбластьСтрока);
			//ДИТ, Беляев СЮ, Ticket#0329728, 30-10-2023, начало
			ВыводНаСтраницу = ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(Результат, ПроверяемаяОбласть);
			Если Не ВыводНаСтраницу Тогда
				ПечатьБухгалтерскихДокументов.ВывестиСтрокуЧастями(Результат, ПроверяемаяОбласть, ОбластьСтрока, АнглСодержание, "НаименованиеУслугиАнгл");
			Иначе
				Результат.Вывести(ОбластьСтрока);
			КонецЕсли;
			//ДИТ, Беляев СЮ, Ticket#0329728, 30-10-2023, конец
		КонецЦИкла;
		
		//ДИТ Давудов М.А. Task32744 03.07.2021 Начало
		Если Не ЭтоCreditNote Тогда
			//ок(
			ОбластьПодвал.Параметры.ИтогоПоСчету = Док.СуммаДокумента;
			//ок
		Иначе
			ОбластьПодвал.Параметры.ИтогоПоСчету = Док.СуммаДокумента * (-1);
		КонецЕсли;
		//ДИТ Давудов М.А. Task32744 03.07.2021 Конец
		ОбластьПодвал.Параметры.Валюта = Док.ВалютаДокумента.Наименование;
		
		//Евросиб(ДИТ), Беляев СЮ, US 85562/TA 85564, 13-06-2024, начало
		Если ИдентификаторКомандыПечати = "СчетНаОплатуАнглВРублях" Тогда
			ОбластьПодвал.Параметры.ИтогоПоСчету = ИтогоВРублях;
			ОбластьПодвал.Параметры.Валюта = ВалютаРубль;
		КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, US 85562/TA 85564, 13-06-2024, конец
		
		ОбластьПодвал.Параметры.СрокПоставки =  Док.ДатаОплаты; //или Док.ДатаОтгрузки
		//Евросиб Каблов 28.03.2022 ( Ticket#0266241
		Если СтруктураПодписантов <> Неопределено Тогда
			ВыводитьФаксимиле = НЕ СтруктураПодписантов.Свойство("БезФаксимиле");
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ДоверенностьЗаРуководителя.Физлицо.ФамилияИнициалыАнгл КАК РуководительФамилияИнициалыАнгл,
			               |	ДоверенностьЗаРуководителя.ДолжностьАнгл КАК РуководительДолжностьАнгл,
			               |	ДоверенностьЗаРуководителя.ФайлФаксимиль КАК РуководительФайлПодпись,
			               |	ДоверенностьЗаРуководителя.ФайлПечать КАК РуководительФайлПечать
			               |ИЗ
			               |	Справочник.Доверенности КАК ДоверенностьЗаРуководителя
			               |ГДЕ
			               |	ДоверенностьЗаРуководителя.Ссылка = &Ссылка";
			Запрос.УстановитьПараметр("Ссылка", СтруктураПодписантов.ДоверенностьЗаРуководителя);
			Выборка = Запрос.Выполнить().Выбрать();
		Иначе
			ВыводитьФаксимиле = Истина;
		//Евросиб Каблов 28.03.2022 )		
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	СчетНаОплатуПокупателю.ДоверенностьЗаРуководителя.Физлицо.ФамилияИнициалыАнгл КАК РуководительФамилияИнициалыАнгл,
			               |	СчетНаОплатуПокупателю.ДоверенностьЗаРуководителя.ДолжностьАнгл КАК РуководительДолжностьАнгл,
			               |	СчетНаОплатуПокупателю.ДоверенностьЗаРуководителя.ФайлФаксимиль КАК РуководительФайлПодпись,
			               |	СчетНаОплатуПокупателю.ДоверенностьЗаРуководителя.ФайлПечать КАК РуководительФайлПечать
			               |ИЗ
			               |	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
			               |ГДЕ
			               |	СчетНаОплатуПокупателю.Ссылка = &Ссылка";
			Запрос.УстановитьПараметр("Ссылка", Док);
			Выборка = Запрос.Выполнить().Выбрать();
		КонецЕсли;
		
		Если Выборка.Следующий() Тогда
			
			ОбластьПодвал.Параметры.ДолжностьАнгл = Выборка.РуководительДолжностьАнгл;
			ОбластьПодвал.Параметры.ФамилияИнициалыАнгл = Выборка.РуководительФамилияИнициалыАнгл;
			
			//Евросиб Каблов 28.03.2022 ( Ticket#0266241
			Если ВыводитьФаксимиле Тогда
			//Евросиб Каблов 28.03.2022 )			
				Если ЗначениеЗаполнено(Выборка.РуководительФайлПодпись) Тогда
					ДанныеКартинкиПодпись = РаботаСФайлами.ДанныеФайла(Выборка.РуководительФайлПодпись);
					ДвоичныеДанныеПодпись = ПолучитьИзВременногоХранилища(ДанныеКартинкиПодпись.СсылкаНаДвоичныеДанныеФайла);
					Если ЗначениеЗаполнено(ДвоичныеДанныеПодпись) Тогда
						ОбластьПодвал.Рисунки.ФаксимилеРуководитель.Картинка = Новый Картинка(ДвоичныеДанныеПодпись);
					КонецЕсли;
				КонецЕсли;
				Если ЗначениеЗаполнено(Выборка.РуководительФайлПечать) тогда
					ДанныеКартинкиПечать = РаботаСФайлами.ДанныеФайла(Выборка.РуководительФайлПечать);
					ДвоичныеДанныеПечать = ПолучитьИзВременногоХранилища(ДанныеКартинкиПечать.СсылкаНаДвоичныеДанныеФайла);
					Если ЗначениеЗаполнено(ДвоичныеДанныеПечать) Тогда
						ОбластьПодвал.Рисунки.ФаксимилеПечать.Картинка = Новый Картинка(ДвоичныеДанныеПечать);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;  
		
		//Евросиб(ДИТ) Антонова А.С. US 103645 ТА 105974 Начало 31.03.2025
		Если не Результат.ПроверитьВывод(ОбластьПодвал) Тогда
			Результат.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		//Евросиб(ДИТ) Антонова А.С. US 103645 ТА 105974 Конец 31.03.2025

		Результат.Вывести(ОбластьПодвал);
		
//Евросиб ( Литвинов 19.05.2021 #34516
		//НижнийКолонтитул = "CJSC  «Eurosib SPb-Transportation Systems», 4, Michurinskaya str., St.-Petersburg, 197046, Russia
		//|Tel.  7(812) 326-8116, 7(812) 380-3681, fax: 7(812) 326-8110, 7 (812) 326-8128, 
		//|E-mail: transport@eurosib.biz, URL: http://www.eurosib.biz" +Символы.ПС+" "+Символы.ПС+" "+Символы.ПС;
		НижнийКолонтитул = ""+СведенияОбОрганизации.ПолноеНаименованиеАнгл+", 4, Michurinskaya str., St.-Petersburg, 197046, Russia
		|Tel.  7(812) 326-8116, 7(812) 380-3681, fax: 7(812) 326-8110, 7 (812) 326-8128, 
		|E-mail: transport@eurosib.biz, URL: http://www.eurosib.biz" +Символы.ПС+" "+Символы.ПС+" "+Символы.ПС;
//Евросиб ) Литвинов 19.05.2021 #34516
		
		Результат.НижнийКолонтитул.Выводить = Истина;
		Результат.НижнийКолонтитул.ТекстВЦентре = НижнийКолонтитул;
		Результат.НижнийКолонтитул.ТекстСправа = "Page [&НомерСтраницы] of [&СтраницВсего]"; 
		Результат.НижнийКолонтитул.Шрифт = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,8);
		
		Первый = Ложь;
		
		// Для задания области печати
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(Результат, 
			НомерСтрокиНачало, ОбъектыПечати, Док);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура СформироватьПечатнуюФорму(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ИмяМакета, СинонимМакета, ОбъектыПечати, ПараметрыВывода,СтруктураПодписантов)
	//Евросиб Каблов 03.09.2020 (
	//Для каждого ЭлМассива из МассивОбъектов Цикл
	//	ТаблицаСведенийСчетНаОплату = ПолучитьТаблицуСведенийСчетаНаОплату(ЭлМассива);

	//	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета, СинонимМакета, 
	//			ПечатьБухгалтерскихДокументов.ПечатьСчетаНаОплату(ТаблицаСведенийСчетНаОплату, ОбъектыПечати, ПараметрыПечати,СтруктураПодписантов),,"ОбщийМакет.ПФ_MXL_СчетЗаказ");
	//КонецЦикла;
//Евросиб Литвинов 19.08.2021 ( #35933 #36212
//Евросиб Литвинов ( 24.10.21 #40869
	Если НЕ ПараметрыПечати.Свойство("ФормированиеИзДиадок") Тогда
//Евросиб Литвинов ) 24.10.21 #40869			
		ЕстьДокументИзЭДО = ЛОЖЬ;
		Для каждого ЭлМассива из МассивОбъектов Цикл
			Если ПечатьКомплектаДокументов.ПолучитьПечатнуюФормуИзДиадок(КоллекцияПечатныхФорм, ЭлМассива, ИмяМакета, СинонимМакета) Тогда
				ЕстьДокументИзЭДО = Истина;
				Продолжить;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьДокументИзЭДО = Истина Тогда
			Возврат;
		КонецЕсли;
//Евросиб Литвинов ( 24.10.21 #40869
	КонецЕсли; 
//Евросиб Литвинов ) 24.10.21 #40869			
//Евросиб Литвинов 19.08.2021 ) #35933 #36212 
	ТаблицаСведенийСчетНаОплату = ПолучитьТаблицуСведенийСчетаНаОплату(МассивОбъектов);
	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета, СинонимМакета,
		ПечатьБухгалтерскихДокументов.ПечатьСчетаНаОплату(ТаблицаСведенийСчетНаОплату, ОбъектыПечати, ПараметрыПечати,СтруктураПодписантов),,"ОбщийМакет.ПФ_MXL_СчетЗаказ");
	//Евросиб Каблов 03.09.2020 )
КонецПроцедуры
		
Функция ПолучитьТаблицуСведенийСчетаНаОплату(ДокументСчетНаОплату) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаСведений = ПечатьБухгалтерскихДокументов.ПолучитьОписаниеСчетаНаОплату();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документ", ДокументСчетНаОплату);
	
	Запрос.Текст = ПолучитьТекстЗапросаДляФормированияТаблицыСведенийСчетаНаОплату();
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	//Евросиб(ДИТ) Антонова А.С. US 103646 ТА 105495 25.03.2025 Сдвиг нумерации. Было 1, 2
	Выборка = РезультатЗапроса[РезультатЗапроса.Количество() - 3].Выбрать();
	СтрокиДокументов = РезультатЗапроса[РезультатЗапроса.Количество() - 2].Выгрузить();
	СтрокиДокументов.Индексы.Добавить("Документ");
	//Евросиб Каблов 02.06.2022 ( Task 45436
	УчетныеЕдиницы = РезультатЗапроса[РезультатЗапроса.Количество() - 1].Выгрузить();
	УчетныеЕдиницы.Индексы.Добавить("Документ");
	//Евросиб Каблов 02.06.2022 )
	
	
	Пока Выборка.Следующий() Цикл
		
		СведенияОДокументе = ТаблицаСведений.Добавить();
		ЗаполнитьЗначенияСвойств(СведенияОДокументе, Выборка);
		//Евросиб - АСуслов 13.09.2022 11:18:26 #
		//(
		ФакторингСервер.ЗаполнитьПараметрыФакторинга(СведенияОДокументе);
		//)
		//Евросиб - АСуслов 13.09.2022 11:18:26 #     
		
		//ДИТ Шевченко А.В. US 103646 TA 103658 06.03.2025
		ЗаполнитьПСЦДляОснования(СведенияОДокументе.Документ,Ложь,СведенияОДокументе.ПСЦДляОснования);
		//ДИТ Шевченко А.В. US 103646 TA 103658 06.03.2025
		
		СведенияОДокументе.ЗаРуководителяНаОснованииНаименование = Выборка.ЗаРуководителяНаОсновании;
		СведенияОДокументе.ЗаГлавногоБухгалтераНаОснованииНаименование = Выборка.ЗаГлавногоБухгалтераНаОсновании;
		СведенияОДокументе.ЗаРуководителяНаОсновании = Выборка.ДоверенностьЗаРуководителя;
		СведенияОДокументе.ЗаГлавногоБухгалтераНаОсновании = Выборка.ДоверенностьЗаГлБухгалтера;
		
		ТаблицаДокумента = ПечатьБухгалтерскихДокументов.ПолучитьОписаниеТаблицыСчетаНаОплату();
		
		Отбор = Новый Структура("Документ", Выборка.Документ);
		СтрокиДокумента = СтрокиДокументов.НайтиСтроки(Отбор);
		
		Для Каждого Строка Из СтрокиДокумента Цикл
			
			СтрокаТаблицыДокумента = ТаблицаДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыДокумента, Строка);
			СтрокаТаблицыДокумента.НоменклатураНаименование  = ?(ЗначениеЗаполнено(Строка.Содержание),Строка.Содержание,Строка.Номенклатура.НаименованиеПолное);
		КонецЦикла;
		
		СведенияОДокументе.ТаблицаДокумента = ТаблицаДокумента;
		
		//Евросиб Каблов 02.06.2022 ( Task 45436
		ТаблицаУчетныхЕдиниц = УчетныеЕдиницы.СкопироватьКолонки();
		СтрокиДокумента = УчетныеЕдиницы.НайтиСтроки(Отбор);
		
		Для Каждого Строка Из СтрокиДокумента Цикл
			СтрокаТаблицыДокумента = ТаблицаУчетныхЕдиниц.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицыДокумента, Строка);
		КонецЦикла;
		
		СведенияОДокументе.ТаблицаУчетныхЕдиниц = ТаблицаУчетныхЕдиниц;
		//Евросиб Каблов 02.06.2022 )
		
		//ПорядокЗаполнения = Новый Структура("ЗаполнятьРуководителя, ЗаполнятьГлавногоБухгалтера");
		////ПечатьТорговыхДокументов.ЗаполнитьДанныеОтветственныхЛиц(СведенияОДокументе, ПорядокЗаполнения);
		//
		//Если НЕ ЗначениеЗаполнено(СведенияОДокументе.РуководительДолжностьНаименование) Тогда
		//	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СведенияОДокументе.Получатель, "ЮридическоеФизическоеЛицо")
		//		= Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		//		СведенияОДокументе.РуководительДолжностьНаименование = "Индивидуальный предприниматель";
		//	КонецЕсли;
		//КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаСведений;
	
КонецФункции    

Процедура ЗаполнитьПСЦДляОснования(Документ,Англ = Ложь,ПСЦДляОснования) //ДИТ Шевченко А.В. US 103646 TA 103658 06.03.2025
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СчетНаОплатуПокупателюДокументыОснования.Документ КАК Документ,
		|	ЗаявкаСоставУслуги.ПСЦ КАК ПСЦ,
		|	ЗаявкаСоставУслуги.Ссылка.ПСЦ.НомерПСЦ КАК ПСЦНомерПСЦ,
		|	ЗаявкаСоставУслуги.Ссылка.ПСЦ.ДатаПСЦ КАК ПСЦДатаПСЦ
		|ИЗ
		|	Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|		ПО СчетНаОплатуПокупателюДокументыОснования.Документ = ЗаявкаСоставУслуги.Ссылка
		|ГДЕ
		|	СчетНаОплатуПокупателюДокументыОснования.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивПСЦ = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Англ Тогда
			МассивПСЦ.Добавить("Appendix " + (ВыборкаДетальныеЗаписи.ПСЦНомерПСЦ) +" dated "+ (Формат(ВыборкаДетальныеЗаписи.ПСЦДатаПСЦ,"ДФ=dd.MM.yyyy")));
		Иначе	
			МассивПСЦ.Добавить(ВыборкаДетальныеЗаписи.ПСЦ);
		КонецЕсли;
	КонецЦикла;
	
	ПСЦДляОснования = СтрСоединить(МассивПСЦ,",");
	
КонецПроцедуры	

Функция ПолучитьТекстЗапросаДляФормированияТаблицыСведенийСчетаНаОплату()
	//Евросиб - АСуслов 13.09.2023 15:00:52 #74705
	//(
	//изменен запрос
	//)
	//Евросиб - АСуслов 13.09.2023 15:00:54 #74705
	ТекстЗапроса = "ВЫБРАТЬ
	               |	МАКСИМУМ(ПодразделенияИсторияРеквизитов.Период) КАК Период,
	               |	СчетНаОплатуПокупателю.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_ПериодыРеквизитов
	               |ИЗ
	               |	Справочник.Подразделения.ИсторияРеквизитов КАК ПодразделенияИсторияРеквизитов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	               |		ПО ПодразделенияИсторияРеквизитов.Период <= СчетНаОплатуПокупателю.ДатаДокумента
	               |			И ПодразделенияИсторияРеквизитов.Ссылка = СчетНаОплатуПокупателю.ПодразделениеОрганизации
	               |			И (СчетНаОплатуПокупателю.Ссылка В (&Документ))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СчетНаОплатуПокупателю.Ссылка
	               |; 
				   //Евросиб(ДИТ) Антонова А.С. US 103646 ТА 105495 Начало 25.03.2025
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	ВЫБОР
				   |		КОГДА Заявка.ПСЦ.ТипКалькуляции В (ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Премии), ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Субсидии))
				   |			ТОГДА ИСТИНА
				   |		ИНАЧЕ ЛОЖЬ
				   |	КОНЕЦ КАК ЭтоПремииСубсидии,
				   |	СчетНаОплатуПокупателюДокументыОснования.Ссылка КАК СчетНаОплату
				   |ПОМЕСТИТЬ ВТ_ТипРасходаПоСчету
				   |ИЗ
				   |	Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка КАК Заявка
				   |		ПО СчетНаОплатуПокупателюДокументыОснования.Документ = Заявка.Ссылка
				   |ГДЕ
				   |	СчетНаОплатуПокупателюДокументыОснования.Ссылка В(&Документ)
				   |;
				   //Евросиб(ДИТ) Антонова А.С. US 103646 ТА 105495 Конец 25.03.2025
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СчетНаОплатуПокупателю.Ссылка КАК Документ,
	               |	СчетНаОплатуПокупателю.НомерДляПечати КАК НомерДокумента,
	               |	СчетНаОплатуПокупателю.ДатаДокумента КАК ДатаДокумента,
	               |	ВЫБОР
	               |		КОГДА СчетНаОплатуПокупателю.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах
	               |			ТОГДА Валюты.Ссылка
	               |		ИНАЧЕ СчетНаОплатуПокупателю.ВалютаДокумента
	               |	КОНЕЦ КАК Валюта,
	               |	ВЫБОР
	               |		КОГДА СчетНаОплатуПокупателю.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах
	               |			ТОГДА Валюты.Код
	               |		ИНАЧЕ СчетНаОплатуПокупателю.ВалютаДокумента.Код
	               |	КОНЕЦ КАК ВалютаКод,
	               |	ВЫБОР
	               |		КОГДА СчетНаОплатуПокупателю.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах
	               |			ТОГДА Валюты.Наименование
	               |		ИНАЧЕ СчетНаОплатуПокупателю.ВалютаДокумента.Наименование
	               |	КОНЕЦ КАК ВалютаНаименование,
	               |	СчетНаОплатуПокупателю.СуммаДокумента КАК СуммаДокумента,
	               |	СчетНаОплатуПокупателю.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	               |	СчетНаОплатуПокупателю.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	               |	СчетНаОплатуПокупателю.СуммаВключаетНДС КАК СуммаВключаетНДС,
	               |	СчетНаОплатуПокупателю.Организация КАК Организация,
	               |	СчетНаОплатуПокупателю.Организация КАК Получатель,
	               |	СчетНаОплатуПокупателю.ПодразделениеОрганизации КАК Подразделение,
	               |	ВЫБОР
	               |		КОГДА СчетНаОплатуПокупателю.Организация.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |			ТОГДА СчетНаОплатуПокупателю.Организация.ГоловнаяОрганизация
	               |		ИНАЧЕ СчетНаОплатуПокупателю.Организация
	               |	КОНЕЦ КАК Поставщик,
	               |	ЕСТЬNULL(СчетНаОплатуПокупателю.ПодразделениеОрганизации.НаименованиеПолное, """") КАК ПодразделениеНаименованиеПолное,
				   //Евросиб - АСуслов 13.09.2023 15:00:26 #74705
				   //(
	               |	ЕСТЬNULL(ПодразделенияИсторияРеквизитов.ФактическийАдрес, """") КАК ПодразделениеФактическийАдрес,
	               |	ЕСТЬNULL(СчетНаОплатуПокупателю.ПодразделениеОрганизации.ЦифровойИндексОбособленногоПодразделения, 0) КАК ПодразделениеЦифровойИндекс,
	               |	ЕСТЬNULL(ПодразделенияИсторияРеквизитов.КПП, """") КАК ПодразделениеКПП,
				   //)
				   //Евросиб - АСуслов 13.09.2023 15:00:28 #74705
	               |	СчетНаОплатуПокупателю.Контрагент КАК Покупатель,
	               |	СчетНаОплатуПокупателю.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	СчетНаОплатуПокупателю.ДоговорКонтрагента.Номер КАК НомерДоговора,
	               |	СчетНаОплатуПокупателю.ДоговорКонтрагента.Дата КАК ДатаДоговора,
	               |	СчетНаОплатуПокупателю.БанковскийСчетОрганизации КАК БанковскийСчетПродавца,
	               |	СчетНаОплатуПокупателю.БанковскийСчетОрганизации.Банк КАК БанкПолучателя,
	               |	СчетНаОплатуПокупателю.Руководитель КАК Руководитель,
	               |	СчетНаОплатуПокупателю.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
	               |	СчетНаОплатуПокупателю.ЗаРуководителяНаОсновании КАК ЗаРуководителяНаОсновании,
	               |	СчетНаОплатуПокупателю.ЗаГлавногоБухгалтераНаОсновании КАК ЗаГлавногоБухгалтераНаОсновании,
	               |	ВЫБОР
	               |		КОГДА СчетНаОплатуПокупателю.ВалютаДокумента = ЗНАЧЕНИЕ(Справочник.Валюты.Рубль)
	               |			ТОГДА СчетНаОплатуПокупателю.БанковскийСчетОрганизации.Банк.Наименование
	               |		ИНАЧЕ СчетНаОплатуПокупателю.БанковскийСчетОрганизации.Банк.МеждународноеНаименование
	               |	КОНЕЦ КАК НаименованиеБанкаПолучателя,
	               |	ВЫБОР
	               |		КОГДА СчетНаОплатуПокупателю.ВалютаДокумента = ЗНАЧЕНИЕ(Справочник.Валюты.Рубль)
	               |			ТОГДА СчетНаОплатуПокупателю.БанковскийСчетОрганизации.Банк.Код
	               |		ИНАЧЕ СчетНаОплатуПокупателю.БанковскийСчетОрганизации.Банк.СВИФТБИК
	               |	КОНЕЦ КАК БикБанкаПолучателя,
	               |	СчетНаОплатуПокупателю.БанковскийСчетОрганизации.Банк.КоррСчет КАК СчетБанкаПолучателя,
	               |	СчетНаОплатуПокупателю.БанковскийСчетОрганизации.НомерСчета КАК НомерСчета,
	               |	СчетНаОплатуПокупателю.БанковскийСчетОрганизации.НомерСчета КАК НомерСчетаПолучателя,
	               |	СчетНаОплатуПокупателю.Грузоотправитель КАК Грузоотправитель,
	               |	СчетНаОплатуПокупателю.Грузополучатель КАК Грузополучатель,
	               |	СчетНаОплатуПокупателю.Ответственный.ФизическоеЛицо КАК ОтветственныйФизическоеЛицо,
	               |	СчетНаОплатуПокупателю.ДоверенностьЗаРуководителя КАК ДоверенностьЗаРуководителя,
	               |	СчетНаОплатуПокупателю.ДоверенностьЗаГлБухгалтера КАК ДоверенностьЗаГлБухгалтера,
	               |	ЕСТЬNULL(ИсторияФакторинга.ДоговорКомпанииФактор.ДополнительнаяИнформацияФакторинг, """") КАК ДополнительнаяИнформацияФакторинг,
	               |	ВЫБОР
	               |		КОГДА ИсторияФакторинга.ДоговорКомпанииФактор ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК Факторинг,
	               |	СчетНаОплатуПокупателю.ТекстОснование КАК ТекстОснование,
	               |	СчетНаОплатуПокупателю.УдалитьСделка КАК Сделка,
	               |	ВЫБОР
	               |		КОГДА СчетНаОплатуПокупателю.ВалютаДокумента = ЗНАЧЕНИЕ(Справочник.Валюты.Рубль)
	               |			ТОГДА ""БИК""
	               |		ИНАЧЕ ""SWIFT""
	               |	КОНЕЦ КАК БИКНаименование,  
				   //Евросиб(ДИТ) Антонова А.С. US 103646 ТА 105495 Начало 25.03.2025
				   |	ВТ_ТипРасходаПоСчету.ЭтоПремииСубсидии КАК ЭтоПремииСубсидии,
				   //Евросиб(ДИТ) Антонова А.С. US 103646 ТА 105495 Конец 25.03.2025
	               |	СчетНаОплатуПокупателю.ПравилоФормирования КАК ПравилоФормирования
	               |ИЗ
	               |	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПериодыРеквизитов КАК ВТ_ПериодыРеквизитов
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Подразделения.ИсторияРеквизитов КАК ПодразделенияИсторияРеквизитов
	               |			ПО ВТ_ПериодыРеквизитов.Период = ПодразделенияИсторияРеквизитов.Период
	               |				И ВТ_ПериодыРеквизитов.Ссылка.ПодразделениеОрганизации = ПодразделенияИсторияРеквизитов.Ссылка
	               |		ПО СчетНаОплатуПокупателю.Ссылка = ВТ_ПериодыРеквизитов.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияФакторинга КАК ИсторияФакторинга
	               |		ПО СчетНаОплатуПокупателю.ДоговорКонтрагента = ИсторияФакторинга.Договор
	               |			И СчетНаОплатуПокупателю.ДатаДокумента >= ИсторияФакторинга.НачалоФакторинга
	               |			И (ИсторияФакторинга.НачалоФакторинга <> ДАТАВРЕМЯ(1, 1, 1))
	               |			И (ИсторияФакторинга.ОкончаниеФакторинга = ДАТАВРЕМЯ(1, 1, 1)
	               |				ИЛИ СчетНаОплатуПокупателю.ДатаДокумента <= ИсторияФакторинга.ОкончаниеФакторинга)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	               |		ПО СчетНаОплатуПокупателю.ДоговорКонтрагента.ВалютаВзаиморасчетов = Валюты.Ссылка    
				   //Евросиб(ДИТ) Антонова А.С. US 103646 ТА 105495 Начало 25.03.2025
				   |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТипРасходаПоСчету КАК ВТ_ТипРасходаПоСчету
				   |		ПО (ВТ_ТипРасходаПоСчету.СчетНаОплату = СчетНаОплатуПокупателю.Ссылка)
				   //Евросиб(ДИТ) Антонова А.С. US 103646 ТА 105495 Конец 25.03.2025
	               |ГДЕ
	               |	СчетНаОплатуПокупателю.Ссылка В(&Документ)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	""Товары"" КАК ТабличнаяЧасть,
	               |	СчетНаОплатуПокупателюТовары.Ссылка КАК Документ,
	               |	СчетНаОплатуПокупателюТовары.НомерСтроки КАК НомерСтроки,
	               |	СчетНаОплатуПокупателюТовары.Номенклатура КАК Номенклатура,
				   // Евросиб US 130809 TA 130821 Рыбьяков К.А. 12.02.2026 ((
				   |	ВЫБОР
				   |		КОГДА ДлинаСтроки(СчетНаОплатуПокупателюТовары.Содержание) > 1000
				   |			ТОГДА СчетНаОплатуПокупателюТовары.Номенклатура.Код
				   |		ИНАЧЕ СчетНаОплатуПокупателюТовары.Содержание
				   |	КОНЕЦ КАК Содержание,
	               //|	СчетНаОплатуПокупателюТовары.Содержание КАК Содержание,
				   // Евросиб Рыбьяков К.А. 12.02.2026 ))
	               |	СчетНаОплатуПокупателюТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	СчетНаОплатуПокупателюТовары.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
	               |	СчетНаОплатуПокупателюТовары.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	               |	СчетНаОплатуПокупателюТовары.Количество КАК Количество,
	               |	СчетНаОплатуПокупателюТовары.Цена КАК Цена,
	               |	СчетНаОплатуПокупателюТовары.Сумма КАК Сумма,
	               |	СчетНаОплатуПокупателюТовары.СтавкаНДС КАК СтавкаНДС,
	               |	СчетНаОплатуПокупателюТовары.СуммаНДС КАК СуммаНДС,
	               |	СчетНаОплатуПокупателюТовары.Номенклатура.Услуга КАК ЭтоУслуга,
	               |	СчетНаОплатуПокупателюТовары.Идентификатор КАК Идентификатор
	               |ИЗ
	               |	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
	               |ГДЕ
	               |	СчетНаОплатуПокупателюТовары.Ссылка В(&Документ)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СчетНаОплатуПокупателюУчетныеЕдиницы.Ссылка КАК Документ,
	               |	СчетНаОплатуПокупателюУчетныеЕдиницы.НомерСтроки КАК НомерСтроки,
	               |	СчетНаОплатуПокупателюУчетныеЕдиницы.УчетнаяЕдиница КАК УчетнаяЕдиница,
	               |	СчетНаОплатуПокупателюУчетныеЕдиницы.УчетнаяЕдиница.Наименование КАК НаименованиеУчетнойЕдиницы,
	               |	СчетНаОплатуПокупателюУчетныеЕдиницы.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	               |	ВЫБОР
	               |		КОГДА СчетНаОплатуПокупателюУчетныеЕдиницы.УчетнаяЕдиница ССЫЛКА Справочник.ТЕ
	               |			ТОГДА ""Контейнер""
	               |		КОГДА СчетНаОплатуПокупателюУчетныеЕдиницы.УчетнаяЕдиница ССЫЛКА Справочник.ТС
	               |			ТОГДА ""Вагон""
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК ТипУчетнойЕдиницы
	               |ИЗ
	               |	Документ.СчетНаОплатуПокупателю.УчетныеЕдиницы КАК СчетНаОплатуПокупателюУчетныеЕдиницы
	               |ГДЕ
	               |	СчетНаОплатуПокупателюУчетныеЕдиницы.Ссылка В(&Документ)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки";
				   //Евросиб Каблов 02.06.2022 )
				   
				   //|
				   //|ОБЪЕДИНИТЬ ВСЕ
				   //|
				   //|ВЫБРАТЬ
				   //|	""Услуги"",
				   //|	СчетНаОплатуПокупателюУслуги.НомерСтроки,
				   //|	СчетНаОплатуПокупателюУслуги.Номенклатура,
				   //|	СчетНаОплатуПокупателюУслуги.Содержание,
				   //|	NULL,
				   //|	NULL,
				   //|	NULL,
				   //|	СчетНаОплатуПокупателюУслуги.Количество,
				   //|	СчетНаОплатуПокупателюУслуги.Цена,
				   //|	СчетНаОплатуПокупателюУслуги.Сумма,
				   //|	СчетНаОплатуПокупателюУслуги.СтавкаНДС,
				   //|	СчетНаОплатуПокупателюУслуги.СуммаНДС,
				   //|	СчетНаОплатуПокупателюУслуги.Номенклатура.Услуга
				   //|ИЗ
				   //|	Документ.СчетНаОплатуПокупателю.Услуги КАК СчетНаОплатуПокупателюУслуги
				   //|ГДЕ
				   //|	СчетНаОплатуПокупателюУслуги.Ссылка = &Документ";	
	
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт 

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СчетЗаказ";
	КомандаПечати.Представление = "Счет на оплату";
	КомандаПечати.Обработчик    = "ДополнительныйМодульКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	//Евросиб Каблов 28.07.2020 ( TASK 23506
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//Евросиб Каблов 28.07.2020 )
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СчетНаОплатуАнгл";
	КомандаПечати.Представление = "Счет на оплату английский";
	КомандаПечати.Обработчик    = "ДополнительныйМодульКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	//Евросиб Каблов 28.07.2020 ( TASK 23506
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//Евросиб Каблов 28.07.2020 )
	
	//Евросиб(ДИТ), Беляев СЮ, US 85562/TA 85564, 13-06-2024, начало
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СчетНаОплатуАнглВРублях";
	КомандаПечати.Представление = "Счет на оплату английский в рублях";
	КомандаПечати.Обработчик    = "ДополнительныйМодульКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//Евросиб(ДИТ), Беляев СЮ, US 85562/TA 85564, 13-06-2024, конец

КонецПроцедуры

//ДИТ Давудов М.А. Task32744 25.09.2021 Начало
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если Данные.Ссылка.CreditNote Тогда
		СтандартнаяОбработка = Ложь;
		
		Представление = 
			Метаданные.Документы.СчетНаОплатуПокупателю.Синоним +
			" (CREDIT NOTE) " + 
			Данные.Номер + 
			" от " +
			Данные.Дата;
	КонецЕсли;
	
КонецПроцедуры //ДИТ Давудов М.А. Task32744 25.09.2021 Конец

//++ Коробов Task 43981 28.12.2021 
Функция НеЗаполненыОбязательныеПоля(РежимЗаписи, Объект) Экспорт 
	Отказ = Ложь;
	Если ( (РежимЗаписи = РежимЗаписиДокумента.Проведение ИЛИ Объект.Проведен ) И НЕ(РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) ) Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле ""Организация""!",,,"Объект.Организация",Отказ);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.ЦФО) Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле ""ЦФО""!",,,"Объект.ЦФО",Отказ);	
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда 			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле ""Контрагент""!",,,"Объект.Контрагент",Отказ);		
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле ""Договор контрагента""!",,,"Объект.ДоговорКонтрагента",Отказ);		
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.ПодразделениеОрганизации) Тогда 			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле ""Подразделение организации""!",,,"Объект.ПодразделениеОрганизации",Отказ);	
		КонецЕсли;
	КонецЕсли;
	Возврат Отказ;
КонецФункции
//-- Коробов Task 43981 28.12.2021

// Евросиб Фролов (02.03.2022 Ticket №48083
Функция ПолучитьСтавкуНДС(Документ)
	
	СтавкаНДС = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетНаОплатуПокупателюТовары.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
	|ГДЕ
	|	СчетНаОплатуПокупателюТовары.Ссылка В(&Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетНаОплатуПокупателюУслуги.СтавкаНДС
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю.Услуги КАК СчетНаОплатуПокупателюУслуги
	|ГДЕ
	|	СчетНаОплатуПокупателюУслуги.Ссылка = &Ссылка" ;
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтавкаНДС = Выборка.СтавкаНДС;
	КонецЕсли;
	
	Возврат СтавкаНДС;
	
КонецФункции
// Евросиб Фролов)   

//Евросиб - АСуслов 02.02.2023 10:56:45 #64514
//(
Функция ПолучитьXMLСчетаДМ(СчетНаОплату) Экспорт
	
	РезультатыЗапроса = ПолучитьСтруктуруЗначенийДляВыгрузкиСчетаДМ(СчетНаОплату);
	КоличествоРезультатов = РезультатыЗапроса.Количество();
	ШапкаСчета = РезультатыЗапроса[КоличествоРезультатов - 2].Выбрать();
	МассивОшибок = Новый Массив;
	ЕстьОшибки = Ложь;

	ЕстьДанныеШапки = ШапкаСчета.Следующий();
	Если НЕ ЕстьДанныеШапки Тогда
		МассивОшибок.Добавить("Не удалось сформировать шапку документа при формировании XML счета");
		ЕстьОшибки = Истина;
		СтруктураРезультата = Новый Структура("ЕстьОшибки, МассивОшибок, АдресХранилища", ЕстьОшибки, МассивОшибок, Неопределено);
		Возврат СтруктураРезультата;
	КонецЕсли;
	НаименованиеДляRAIL_ALL = Константы.НаименованиеДляRail_ALL.Получить();
	
	ТаблицаТоварыСчета = РезультатыЗапроса[КоличествоРезультатов - 1].Выгрузить();
	
	Запись = Новый ЗаписьXML();
	ИмяВременногоФайлаXML = ПолучитьИмяВременногоФайла("xml");
	Запись.ОткрытьФайл(ИмяВременногоФайлаXML);
	ПакетСчетаДМ = ФабрикаXDTO.Пакеты.Получить("urn:sap_bill_foreign");
	СвойствоСчет = ПакетСчетаДМ.КорневыеСвойства.Получить("СчетНаОплату"); 
	ОбъектСчет = ФабрикаXDTO.Создать(СвойствоСчет.Тип);
	ОбъектСчет.НомерСчета = ШапкаСчета.НомерДляПечати;
	ОбъектСчет.ДатаСчета = ШапкаСчета.ДатаДокумента;  
	//орг
	ОбъектСчетОрганизация = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("urn:sap_bill_foreign","УчастникТип"));
	НаименованияНаДату = Справочники.Организации.НаименованияНаДату(ШапкаСчета.Организация, ШапкаСчета.ДатаДокумента);
	ОбъектСчетОрганизация.ИНН = ШапкаСчета.ОрганизацияИНН;
	//ОбъектСчетОрганизация.КПП = ШапкаСчета.ОрганизацияКПП;
	ОбъектСчетОрганизация.КПП = НаименованияНаДату.КПП;
	ОбъектСчетОрганизация.НаимОрг = ШапкаСчета.ОрганизацияНаименование;
	ОбъектСчет.Поставщик = ОбъектСчетОрганизация;
	//контрагент
	ОбъектСчетКонтрагент = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("urn:sap_bill_foreign","УчастникТип"));
	ОбъектСчетКонтрагент.ИНН = ШапкаСчета.КонтрагентИНН;
	ОбъектСчетКонтрагент.КПП = ШапкаСчета.КонтрагентКПП;
	ОбъектСчетКонтрагент.НаимОрг = ШапкаСчета.КонтрагентНаименование;
	ОбъектСчет.Получатель = ОбъектСчетКонтрагент;
	//договор
	ОбъектСчетДоговор = ФабрикаXDTO.Создать(ОбъектСчет.Свойства().Получить("Договор").Тип);
	ОбъектСчетДоговор.НомерДоговора = ШапкаСчета.ДоговорКонтрагентаНомер;
	ОбъектСчетДоговор.ДатаДоговора = ШапкаСчета.ДоговорКонтрагентаДата;
	ОбъектСчет.Договор = ОбъектСчетДоговор;
	//валюта
	ОбъектСчетВалюта = ФабрикаXDTO.Создать(ОбъектСчет.Свойства().Получить("Валюта").Тип);
	ОбъектСчетВалюта.КодОКВ = ШапкаСчета.ВалютаДокументаКод;
	ОбъектСчетВалюта.НаимОКВ = ШапкаСчета.ВалютаДокументаНаименование;
	ОбъектСчет.Валюта = ОбъектСчетВалюта;
	//код лота                                     
	Если Не ЗначениеЗаполнено(ШапкаСчета.УчетнаяЕдиница) Тогда
		МассивОшибок.Добавить("Не заполнена учетная единица на вкладке «Учетные единицы»");
		ЕстьОшибки = Истина;
	Иначе
		ОбъектСчет.КодЛота = ШапкаСчета.УчетнаяЕдиница;
	КонецЕсли;
	//табличная часть счета
	ОбъектСчетТабличнаяЧасть = ФабрикаXDTO.Создать(ОбъектСчет.Свойства().Получить("ТаблСчета").Тип);
	Для каждого СтрокаТоварыСчета Из ТаблицаТоварыСчета Цикл
		
		ОбъектСчетТабличнаяЧастьСтрока = ФабрикаXDTO.Создать(ОбъектСчетТабличнаяЧасть.Строка.ВладеющееСвойство.Тип);
		Если НЕ ЗначениеЗаполнено(СтрокаТоварыСчета.ПунктОтправления) Тогда
			МассивОшибок.Добавить(СтрШаблон("В строке %1 не заполнен пункт отправления", СтрокаТоварыСчета.Поз));
			ЕстьОшибки = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТоварыСчета.ПунктНазначения) Тогда
			МассивОшибок.Добавить(СтрШаблон("В строке %1 не заполнен пункт назначения", СтрокаТоварыСчета.Поз));
			ЕстьОшибки = Истина;
		КонецЕсли;
		Если СтрокаТоварыСчета.КодУслуги = "" Тогда
			МассивОшибок.Добавить(СтрШаблон("Не настроено соответствие номенклатуры ДК: «%1» коду ДМ", СтрокаТоварыСчета.Номенклатура));
			ЕстьОшибки = Истина;
		КонецЕсли;
		Если СтрокаТоварыСчета.НаименованиеУслуги = "" Тогда
			МассивОшибок.Добавить(СтрШаблон("Не настроено соответствие номенклатуры ДК: «%1» наименованию ДМ", СтрокаТоварыСчета.Номенклатура));
			ЕстьОшибки = Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТоварыСчета.ПунктОтправления) И СтрокаТоварыСчета.КодТочкиОтпр = "" Тогда
			МассивОшибок.Добавить(СтрШаблон("Не настроено соответствие локации ДК: «%1» локации ДМ", СтрокаТоварыСчета.ПунктОтправления));
			ЕстьОшибки = Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТоварыСчета.ПунктНазначения) И СтрокаТоварыСчета.КодТочкиПолуч = "" Тогда
			МассивОшибок.Добавить(СтрШаблон("Не настроено соответствие локации ДК: «%1» локации ДМ", СтрокаТоварыСчета.ПунктНазначения));
			ЕстьОшибки = Истина;
		КонецЕсли;
		ОбъектСчетТабличнаяЧастьСтрока.Поз = СтрокаТоварыСчета.Поз;
		Если СтрокаТоварыСчета.КодУслуги = "RAIL" И СтрокаТоварыСчета.ЕстьRAIL_ALL Тогда
			ОбъектСчетТабличнаяЧастьСтрока.КодУслуги = "RAIL_ALL";
			Если НЕ ЗначениеЗаполнено(НаименованиеДляRAIL_ALL) Тогда
				МассивОшибок.Добавить("Не настроено наименование для RAIL_ALL");
				ЕстьОшибки = Истина;
            КонецЕсли;
			ОбъектСчетТабличнаяЧастьСтрока.Наименование = НаименованиеДляRAIL_ALL;
		Иначе	
			ОбъектСчетТабличнаяЧастьСтрока.КодУслуги = СтрокаТоварыСчета.КодУслуги;
			ОбъектСчетТабличнаяЧастьСтрока.Наименование = СтрокаТоварыСчета.НаименованиеУслуги;
		КонецЕсли;
		ОбъектСчетТабличнаяЧастьСтрока.КодТочкиОтпр = СтрокаТоварыСчета.КодТочкиОтпр;
		ОбъектСчетТабличнаяЧастьСтрока.КодТочкиПолуч = СтрокаТоварыСчета.КодТочкиПолуч;
		ОбъектСчетТабличнаяЧастьСтрока.ЦенаБезНДС = СтрокаТоварыСчета.ЦенаБезНДС;
		ОбъектСчетТабличнаяЧастьСтрока.Количество = СтрокаТоварыСчета.Количество; 
		Если СтрокаТоварыСчета.СтавкаНДС = Неопределено Тогда
			//Евросиб СубботинВ #125845 09.12.2025 Начало
			//МассивОшибок.Добавить(СтрШаблон("В строке %1 указана некорректная ставка НДС. Доступные варианты %2.", СтрокаТоварыСчета.Поз, "0%, 10%, 20%, Без НДС"));
			МассивОшибок.Добавить(СтрШаблон("В строке %1 указана некорректная ставка НДС. Доступные варианты %2.", СтрокаТоварыСчета.Поз, "0%, 10%, 20%, 22%, Без НДС"));
            //Евросиб СубботинВ #125845 09.12.2025 Конец
			ЕстьОшибки = Истина;
		Иначе
			ОбъектСчетТабличнаяЧастьСтрока.СтавкаНДС = СтрокаТоварыСчета.СтавкаНДС;
		КонецЕсли;
		ОбъектСчетТабличнаяЧастьСтрока.СуммаБезНДС = СтрокаТоварыСчета.СуммаБезНДС;
		ОбъектСчетТабличнаяЧастьСтрока.СуммаНДС = СтрокаТоварыСчета.СуммаНДС;
		ОбъектСчетТабличнаяЧастьСтрока.СуммаСНДС = СтрокаТоварыСчета.СуммаСНДС;
		ОбъектСчетТабличнаяЧасть.Строка.Добавить(ОбъектСчетТабличнаяЧастьСтрока);
		
	КонецЦикла;
	ОбъектСчет.ТаблСчета = ОбъектСчетТабличнаяЧасть;
	
	Если ЕстьОшибки = Ложь Тогда
		ОбъектСчет.Проверить();
	КонецЕсли;
	ФабрикаXDTO.ЗаписатьXML(Запись, ОбъектСчет, "СчетНаОплату", "urn:sap_bill_foreign");
	Запись.Закрыть();
	Файл = Новый ДвоичныеДанные(ИмяВременногоФайлаXML);
	АдресХранилища = ПоместитьВоВременноеХранилище(Файл);
	МассивОшибок = Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(МассивОшибок);
	СтруктураРезультата = Новый Структура("ЕстьОшибки, МассивОшибок, АдресХранилища", ЕстьОшибки, МассивОшибок, АдресХранилища);
	Возврат СтруктураРезультата;
		
КонецФункции

Функция ПолучитьСтруктуруЗначенийДляВыгрузкиСчетаДМ(СчетНаОплату) 
	НоменклатурыДляRAIL_ALL_ХЗ = Константы.НоменклатурыДляRAIL_ALL.Получить();
	МассивНоменклатурДляRAIL_ALL = НоменклатурыДляRAIL_ALL_ХЗ.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПротоколОбменов.Объект КАК Объект,
	|	ПротоколОбменов.УИДИсточника КАК УИДИсточника,
	|	ПротоколОбменов.ДопИнфо1 КАК ДопИнфо1
	|ПОМЕСТИТЬ ВТ_СоответствияОбъектовДМ
	|ИЗ
	|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|ГДЕ
	|	ПротоколОбменов.ДействиеПриОбмене = &ДействиеПриОбмене
	|	И ПротоколОбменов.УзелОбмена = &УзелОбмена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка КАК Ссылка,
	|	ИСТИНА КАК ЕСТЬRAIL_ALL
	|ПОМЕСТИТЬ ВТ_КалькуляцииRAIL_ALL
	|ИЗ
	|	Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	|ГДЕ
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка В(&СписокКалькуляций)
	|	И КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Услуга В(&УслугиДляRAIL_ALL)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетНаОплатуПокупателю.НомерДляПечати КАК НомерДляПечати,
	|	СчетНаОплатуПокупателю.ДатаДокумента КАК ДатаДокумента,
	|	СчетНаОплатуПокупателю.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	СчетНаОплатуПокупателю.ВалютаДокумента.Наименование КАК ВалютаДокументаНаименование,
	|	СчетНаОплатуПокупателю.Контрагент.ИНН КАК КонтрагентИНН,
	|	СчетНаОплатуПокупателю.Контрагент.КПП КАК КонтрагентКПП,
	|	СчетНаОплатуПокупателю.Контрагент.Наименование КАК КонтрагентНаименование,
	|	СчетНаОплатуПокупателю.Организация КАК Организация,
	|	СчетНаОплатуПокупателю.Организация.ИНН КАК ОрганизацияИНН,
	|	СчетНаОплатуПокупателю.Организация.КПП КАК ОрганизацияКПП,
	|	СчетНаОплатуПокупателю.Организация.Наименование КАК ОрганизацияНаименование,
	|	СчетНаОплатуПокупателю.ДоговорКонтрагента.Номер КАК ДоговорКонтрагентаНомер,
	|	СчетНаОплатуПокупателю.ДоговорКонтрагента.Дата КАК ДоговорКонтрагентаДата,
	|	СчетНаОплатуПокупателюУчетныеЕдиницы.УчетнаяЕдиница.Наименование КАК УчетнаяЕдиница
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю.УчетныеЕдиницы КАК СчетНаОплатуПокупателюУчетныеЕдиницы
	|		ПО СчетНаОплатуПокупателюУчетныеЕдиницы.Ссылка = СчетНаОплатуПокупателю.Ссылка
	|ГДЕ
	|	СчетНаОплатуПокупателю.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетНаОплатуПокупателюТовары.НомерСтроки КАК Поз,
	|	СчетНаОплатуПокупателюТовары.Номенклатура КАК Номенклатура,
	|	СчетНаОплатуПокупателюТовары.ПунктОтправления КАК ПунктОтправления,
	|	СчетНаОплатуПокупателюТовары.ПунктНазначения КАК ПунктНазначения,
	|	ЕСТЬNULL(ВТ_СоответствияОбъектовДМ_Номенклатура.УИДИсточника, """") КАК КодУслуги,
	|	ЕСТЬNULL(ВТ_СоответствияОбъектовДМ_Номенклатура.ДопИнфо1, """") КАК НаименованиеУслуги,
	|	ЕСТЬNULL(ВТ_СоответствияОбъектовДМ_ПунктыОтправления.УИДИсточника, """") КАК КодТочкиОтпр,
	|	ЕСТЬNULL(ВТ_СоответствияОбъектовДМ_ПунктыНазначения.УИДИсточника, """") КАК КодТочкиПолуч,
	|	СчетНаОплатуПокупателюТовары.Содержание КАК Наименование,
	|	СчетНаОплатуПокупателюТовары.Цена КАК ЦенаБезНДС,
	|	СчетНаОплатуПокупателюТовары.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА СчетНаОплатуПокупателюТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|			ТОГДА ""0%""
	|		КОГДА СчетНаОплатуПокупателюТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|			ТОГДА ""10%""
	|		КОГДА СчетНаОплатуПокупателюТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|			ТОГДА ""20%""  
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Начало: 25.12.2024
	|		КОГДА СчетНаОплатуПокупателюТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС5)
	|			ТОГДА ""5%"" 
	|		КОГДА СчетНаОплатуПокупателюТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
	|			ТОГДА ""7%"" 
	// Евросиб(ДИТ) US 96051 ТА 96052 Сержантова А.С. Конец: 25.12.2024
	|		КОГДА СчетНаОплатуПокупателюТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БЕЗНДС)
	|			ТОГДА ""без НДС""
	//Евросиб СубботинВ #125845 09.12.2025 Начало
	|		КОГДА СчетНаОплатуПокупателюТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
	|			ТОГДА ""22%""
	//Евросиб СубботинВ #125845 09.12.2025 Конец
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СтавкаНДС,
	|	СчетНаОплатуПокупателюТовары.Сумма КАК СуммаБезНДС,
	|	СчетНаОплатуПокупателюТовары.СуммаНДС КАК СуммаНДС,
	|	СчетНаОплатуПокупателюТовары.Сумма КАК СуммаСНДС,
	|	ЕСТЬNULL(ВТ_КалькуляцииRAIL_ALL.ЕСТЬRAIL_ALL, ЛОЖЬ) КАК ЕстьRAIL_ALL
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоответствияОбъектовДМ КАК ВТ_СоответствияОбъектовДМ_Номенклатура
	|		ПО СчетНаОплатуПокупателюТовары.Номенклатура = ВТ_СоответствияОбъектовДМ_Номенклатура.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоответствияОбъектовДМ КАК ВТ_СоответствияОбъектовДМ_ПунктыОтправления
	|		ПО СчетНаОплатуПокупателюТовары.ПунктОтправления = ВТ_СоответствияОбъектовДМ_ПунктыОтправления.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоответствияОбъектовДМ КАК ВТ_СоответствияОбъектовДМ_ПунктыНазначения
	|		ПО СчетНаОплатуПокупателюТовары.ПунктНазначения = ВТ_СоответствияОбъектовДМ_ПунктыНазначения.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КалькуляцииRAIL_ALL КАК ВТ_КалькуляцииRAIL_ALL
	|		ПО СчетНаОплатуПокупателюТовары.Калькуляция = ВТ_КалькуляцииRAIL_ALL.Ссылка
	|ГДЕ
	|	СчетНаОплатуПокупателюТовары.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", СчетНаОплату);
	Запрос.УстановитьПараметр("ДействиеПриОбмене", Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
	Запрос.УстановитьПараметр("УзелОбмена", Перечисления.УзлыОбмена.ДМ);
	Запрос.УстановитьПараметр("СписокКалькуляций", СчетНаОплату.Товары.ВыгрузитьКолонку("Калькуляция"));
	Запрос.УстановитьПараметр("УслугиДляRAIL_ALL", МассивНоменклатурДляRAIL_ALL.ВыгрузитьЗначения());
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	Возврат РезультатыЗапроса;
			
КонецФункции

Функция ПолучитьОписаниеДляСодержанияКитай(ДокументЗаявкаОснование)
	
	Ответ = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаявкаСоставУслуги.ПСЦ КАК ПСЦ,
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПунктОтправления КАК ПунктОтправления,
		|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ПунктНазначения КАК ПунктНазначения,
		|	ЗаявкаСоставУслуги.ПСЦ.ДатаПСЦ КАК ПСЦДатаПСЦ,
		|	ЗаявкаСоставУслуги.ПСЦ.НомерПСЦ КАК ПСЦНомерПСЦ
		|ИЗ
		|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
		|		ПО ЗаявкаСоставУслуги.Калькуляция = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка
		|ГДЕ
		|	ЗаявкаСоставУслуги.Ссылка = &Ссылка
		|ИТОГИ ПО
		|	ПСЦ";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументЗаявкаОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПСЦ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	МассивПСЦ = Новый Массив;
	
	Текст = "";
	
	Пока ВыборкаПСЦ.Следующий() Цикл
		
		Текст = "根据  " + Строка(Год(ВыборкаПСЦ.ПСЦДатаПСЦ)) + " 年 " +  Строка(Месяц(ВыборкаПСЦ.ПСЦДатаПСЦ)) + " 月 " + Строка(День(ВыборкаПСЦ.ПСЦДатаПСЦ)) + " 日第 " + "中国境内运费返还";
	
		ВыборкаДетальныеЗаписи = ВыборкаПСЦ.Выбрать();
		
		МассивМаршрутов = Новый Массив;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПунктОтправления) и ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПунктНазначения) Тогда
			
				МассивМаршрутов.Добавить(" 路线 " +Строка(ВыборкаДетальныеЗаписи.ПунктОтправления.НаименованиеКИТ) + " - " + Строка(ВыборкаДетальныеЗаписи.ПунктНазначения.НаименованиеКИТ));
			
			КонецЕсли;
				
		КонецЦикла;
		
		Текст = Текст + " " + СтрСоединить(МассивМаршрутов,",");
		
		МассивПСЦ.Добавить(Текст);
		
	КонецЦикла;	
	
	Если МассивПСЦ.Количество() Тогда
		Ответ = СтрСоединить(МассивПСЦ,";");                         
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции
//)
//Евросиб - АСуслов 02.02.2023 10:56:46 #64514

// ДИТ US 59973 ТА 68125 Сержантова А.С. Начало: 28.07.2023    
Функция ПрикрепитьРасчетСубсидии(Док, ФорматРасчета) Экспорт
    //ДИТ Шевченко А.В. US 103646 TA 103658 06.03.2025
	
	ЗапросОсн = Новый Запрос;
	ЗапросОсн.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СчетНаОплатуПокупателюДокументыОснования.Документ КАК Документ.Заявка) КАК Заявка
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
	|ГДЕ
	|	СчетНаОплатуПокупателюДокументыОснования.Ссылка = &Ссылка
	|	И ТИПЗНАЧЕНИЯ(СчетНаОплатуПокупателюДокументыОснования.Документ) = ТИП(Документ.Заявка)";
	
	ЗапросОсн.УстановитьПараметр("Ссылка", Док);
	
	РезультатЗапросаОсн = ЗапросОсн.Выполнить();
	ВыборкаОсн = РезультатЗапросаОсн.Выбрать();
	Пока ВыборкаОсн.Следующий() Цикл
		ДокОснования = ВыборкаОсн.Заявка;
	КонецЦикла;
	
	ВидЗадолженностиЗаявки = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьВидЗадолженностиПоДокументу(ДокОснования);
	
	ДатаВнедренияНовыхФорматов = Дата(2025,3,25,0,0,0);
	СтарыйФормат = Док.Выставлен И НачалоДня(Док.Создано) <= ДатаВнедренияНовыхФорматов;//НачалоДня(ТекущаяДата());
	//ДИТ Шевченко А.В. US 103646 TA 103658 06.03.2025
	СтруктураВозврата = Новый Структура("Результат, СообщениеПользователю, ПФ");   
	Результат = Новый ТабличныйДокумент;  
	Результат.АвтоМасштаб = Истина;
	
	Если не ЗначениеЗаполнено(Док) Тогда  
		СтруктураВозврата.Результат = Ложь;
		СтруктураВозврата.СообщениеПользователю = "Не определен счет на оплату клиенту для прикрепления формы расчета";
	    Возврат СтруктураВозврата;
	КонецЕсли; 
	
	ВалютаДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Док.ДоговорКонтрагента, "ВалютаВзаиморасчетов");
	
	ЗаполнятьАнглийскиеНаименования = Ложь; 
	ЗаполнятьНаименованияПоВалюте = Ложь;
	//Евросиб(ДИТ), Беляев СЮ, US 103645 / TA 106776, 07-04-2025, начало
	ЗначениеКолонки_ЕдиницаИзмерения = "";
	ЗначениеКолонки_СтавкаНДС = "";
	//Евросиб(ДИТ), Беляев СЮ, US 103645 / TA 106776, 07-04-2025, конец
	Если ФорматРасчета = Перечисления.ФорматПротокола.ПротоколОдноязычныйУниверсальный Тогда   
		//Протокол одноязычный (русский)
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.СчетНаОплатуПокупателю.ПФ_MXL_РасчетСубсидииОдноязычный", Док.Контрагент, Док.ДоговорКонтрагента);
		//Евросиб(ДИТ), Беляев СЮ, US 103645 / TA 106776, 07-04-2025, начало
		ЗначениеКолонки_ЕдиницаИзмерения = "конт.";
		ЗначениеКолонки_СтавкаНДС = "Без НДС";
		//Евросиб(ДИТ), Беляев СЮ, US 103645 / TA 106776, 07-04-2025, конец
	ИначеЕсли ФорматРасчета = Перечисления.ФорматПротокола.ПротоколОдноязычныйКомпл Тогда 
		//Протокол двуязычный (язык расчета в соответствии с договором)	
		Если ВалютаДоговора <> Справочники.Валюты.Юань Тогда
			СтруктураВозврата.Результат = Ложь;
			СтруктураВозврата.СообщениеПользователю = "Так как валюта договора контрагента не Юань, данная печатная форма не доступна! (язык ПФ расчета отличается от валюты договора)";
			Возврат СтруктураВозврата;
		КонецЕсли;
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.СчетНаОплатуПокупателю.ПФ_MXL_РасчетСубсидииДвуязычныйКит", Док.Контрагент, Док.ДоговорКонтрагента);
		ЗаполнятьНаименованияПоВалюте = Истина;	
		//Евросиб(ДИТ), Беляев СЮ, US 103645 / TA 106776, 07-04-2025, начало
		ЗначениеКолонки_ЕдиницаИзмерения = "конт./"+Символы.ПС+"cont";
		ЗначениеКолонки_СтавкаНДС = "без НДС/"+Символы.ПС+"不含增值税";
		//Евросиб(ДИТ), Беляев СЮ, US 103645 / TA 106776, 07-04-2025, конец
	Иначе
		//Протокол двуязычный (английский) 
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.СчетНаОплатуПокупателю.ПФ_MXL_РасчетСубсидииДвуязычныйАнгл", Док.Контрагент, Док.ДоговорКонтрагента);
		ЗаполнятьАнглийскиеНаименования = Истина; 
		//Евросиб(ДИТ), Беляев СЮ, US 103645 / TA 106776, 07-04-2025, начало
		ЗначениеКолонки_ЕдиницаИзмерения = "конт./"+Символы.ПС+"cont";
		ЗначениеКолонки_СтавкаНДС = "без НДС/"+Символы.ПС+"Without VAT";
		//Евросиб(ДИТ), Беляев СЮ, US 103645 / TA 106776, 07-04-2025, конец
	КонецЕсли;	   
	
	ОбластьШапка 	= Макет.ПолучитьОбласть("ОбластьШапка");  
	ОбластьШапкаТаблицы	= Макет.ПолучитьОбласть("ОбластьШапкаТаблицы"); 
	ОбластьСтрокаТаблицы	= Макет.ПолучитьОбласть("ОбластьСтрокаТаблицы"); 
	ОбластьПодвалТаблицы	= Макет.ПолучитьОбласть("ОбластьПодвалТаблицы"); 
	//ДИТ Шевченко А.В. US 103646 TA 103658 06.03.2025
	Если СтарыйФормат Тогда
		ОбластьПодписи 	= Макет.ПолучитьОбласть("ОбластьПодписи");
	Иначе
		ОбластьПодписи 	= Макет.ПолучитьОбласть("ОбластьПодписи1");
	КонецЕсли;
	//ДИТ Шевченко А.В. US 103646 TA 103658 06.03.2025 
	
	РуководительКонтрагента = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Контрагент, Док.Дата, ,ВалютаДоговора);
	НашРуководитель = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Организация, Док.Дата, ,ВалютаДоговора);     
	
	///////////////////// ШАПКА /////////////////////  
	РеквизитыБанка = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Док.БанковскийСчетОрганизации.Банк, "СВИФТБИК, МеждународноеНаименование");
	КоррСчет = "";
	ОбластьШапка.Параметры.БанкПолучателя = СтрШаблон("%1,SWIFT:%2 %3",РеквизитыБанка.МеждународноеНаименование,
															   РеквизитыБанка.СВИФТБИК,
															   КоррСчет);
	ОбластьШапка.Параметры.ИНН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Док.Организация, "ИНН");
	ОбластьШапка.Параметры.КПП = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Док.Организация, "КПП");
	ОбластьШапка.Параметры.ДатаСоставления = Формат(Док.ДатаДокумента,"ДФ=d.MM.yyyy"); 
	
	//ДИТ Шевченко А.В. US 103646 TA 103658 06.03.2025
	Если СтарыйФормат Тогда
		ОбластьШапка.Параметры.субсидийПремии = "субсидий";
		Если ФорматРасчета = Перечисления.ФорматПротокола.ПротоколОдноязычныйКомпл Тогда
			ОбластьШапка.Параметры.субсидийПремииКит = "补贴的计算";
		КонецЕсли;
		Если НЕ ФорматРасчета = Перечисления.ФорматПротокола.ПротоколОдноязычныйКомпл И НЕ ФорматРасчета = Перечисления.ФорматПротокола.ПротоколОдноязычныйУниверсальный Тогда
			ОбластьШапка.Параметры.ПремииАнгл = "Calculation of subsidies";
			ОбластьШапка.Параметры.ФилиалАнгл  = "(Branch Container Transportation Directorate in Moscow, 4 bldg. 2, Olkhovskaya ulitsa, premises 554, 556-558, Moscow, 105066, KPP " + ОбластьШапка.Параметры.КПП;
			ОбластьШапка.Параметры.ИсполнительЗ = "Исполнитель/" +Символы.ПС+ "Contractor";	
		КонецЕсли;
		ОбластьШапка.Параметры.НомерСчета = "";
		Если ФорматРасчета = Перечисления.ФорматПротокола.ПротоколОдноязычныйУниверсальный Тогда
			ОбластьШапка.Параметры.Получатель = "Получатель";
			ОбластьШапка.Параметры.Плательщик = "Плательщик";
		КонецЕсли;
		Если ФорматРасчета = Перечисления.ФорматПротокола.ПротоколОдноязычныйКомпл Тогда
			ОбластьШапка.Параметры.ИсполнительЗ = "Исполнитель/" + Символы.ПС + "执行者";
		КонецЕсли;
		ОбластьШапка.Параметры.Филиал = "(Филиал Дирекция контейнерных перевозок в г. Москва. 105066, город Москва, улица Ольховская, дом 4, корпус 2, помещения 554, 556-559, КПП "+ОбластьШапка.Параметры.КПП+")";
		Если ФорматРасчета = Перечисления.ФорматПротокола.ПротоколОдноязычныйКомпл Тогда
			ОбластьШапка.Параметры.Филиал = "(Филиал Дирекция контейнерных перевозок в г. Москва. 105066, город Москва, улица Ольховская, дом 4, корпус 2, помещения 554, 556-559, "+ОбластьШапка.Параметры.КПП+")";
			ОбластьШапка.Параметры.ФилиалКит = "《俄罗斯欧西(EUROSIB)（圣彼得堡）- 运输系统》封闭式股份公司 ，集装箱管理处，纳税人识别号 ，纳税人登记原因代码，197046，圣彼得堡市，米丘林斯基街， 4号。电话：(7-812) 326-81-11。分公司：集装箱管理处，莫斯科市。  105066,  莫斯科市  城市内巴斯曼尼市辖区,    奥尔霍夫斯卡娅街4号2栋  房间 554, 556-559。 纳税人登记原因代码";
		КонецЕсли;
	Иначе
		Если НЕ ФорматРасчета = Перечисления.ФорматПротокола.ПротоколОдноязычныйКомпл И НЕ ФорматРасчета = Перечисления.ФорматПротокола.ПротоколОдноязычныйУниверсальный Тогда
			ОбластьШапка.Параметры.ПремииАнгл = "bonus calculation";
			ОбластьШапка.Параметры.ФилиалАнгл  = "«(Branch office: Container transportation directorate, 4 A Michurinskaya St., room 21-N., St. Petersburg, 197046, Russia, КPP " + ОбластьШапка.Параметры.КПП;
			ОбластьШапка.Параметры.ИсполнительЗ = "Экспедитор / Forwarder";
		КонецЕсли;
		ОбластьШапка.Параметры.субсидийПремии = "премии";
		Если ФорматРасчета = Перечисления.ФорматПротокола.ПротоколОдноязычныйКомпл Тогда
			ОбластьШапка.Параметры.субсидийПремииКит = "酬金的结算";
		КонецЕсли;
		ОбластьШапка.Параметры.НомерСчета = Док.НомерДляПечати;
		Если ФорматРасчета = Перечисления.ФорматПротокола.ПротоколОдноязычныйУниверсальный Тогда
			ОбластьШапка.Параметры.Получатель = "Клиент";
			ОбластьШапка.Параметры.Плательщик = "Экспедитор";
		КонецЕсли;
		Если ФорматРасчета = Перечисления.ФорматПротокола.ПротоколОдноязычныйКомпл Тогда
			ОбластьШапка.Параметры.ИсполнительЗ = "Экспедитор / " + Символы.ПС + "货运代理";
		КонецЕсли;
		ОбластьШапка.Параметры.Филиал = "(Филиал Дирекция контейнерных перевозок 197046, г. Санкт-Петербург, вн.тер.г. муниципальный округ Посадский, ул. Мичуринская, д. 4 литера А, помещ. 21-Н., КПП "+ОбластьШапка.Параметры.КПП+")";
		Если ФорматРасчета = Перечисления.ФорматПротокола.ПротоколОдноязычныйКомпл Тогда
			ОбластьШапка.Параметры.Филиал = "«(Филиал Дирекция контейнерных перевозок 197046, г. Санкт-Петербург, вн.тер.г. муниципальный округ Посадский, ул. Мичуринская, д. 4 литера А, помещ. 21-Н., КПП 781343001)";
			ОбластьШапка.Параметры.ФилиалКит = "《俄罗斯欧西(EUROSIB)（圣彼得堡）- 运输系统》封闭式股份公司 ，集装箱管理处，纳税人识别号 7813151859，纳税人登记原因代码 785150001，197046，圣彼得堡市，米丘林斯基街， 4号。电话：(7-812) 326-81-11。分公司：集装箱运输局，米丘林斯卡娅街 4 A 号，21-N 室，圣彼得堡，197046，俄罗斯，纳税人登记原因代码 781343001";	
		КонецЕсли;
	КонецЕсли;	
	//ДИТ Шевченко А.В. US 103646 TA 103658 06.03.2025
	
	ОбластьШапка.Параметры.Исполнитель = Док.Контрагент.НаименованиеПолное;
	ОбластьШапка.Параметры.Валюта = Док.ВалютаДокумента;
	ОбластьШапка.Параметры.КодВалюты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Док.ВалютаДокумента, "Код");
	
	Если ЗаполнятьАнглийскиеНаименования Тогда   
		ОбластьШапка.Параметры.Исполнитель = Док.Контрагент.НаименованиеПолное + " / " + Док.Контрагент.НаименованиеПолноеАнгл;
	КонецЕсли;
		
	Результат.Вывести(ОбластьШапка);
	
	///////////////////// ТАБЛИЦА /////////////////////  
	Результат.Вывести(ОбластьШапкаТаблицы); 
	
	КТКМассив = Новый Массив; 	
	Для каждого Стр из Док.УчетныеЕдиницы Цикл
		Если ЗначениеЗаполнено(Стр.УчетнаяЕдиница) 
			И КТКМассив.Найти(Стр.УчетнаяЕдиница) = неопределено Тогда 
			КТКМассив.Добавить(Стр.УчетнаяЕдиница); 
		КонецЕсли;
	КонецЦикла;
	КТКСписок = СтрСоединить(КТКМассив,"; ");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетНаОплатуПокупателюТовары.НомерСтроки КАК НомерСтроки,
		|	СчетНаОплатуПокупателюТовары.Номенклатура КАК Номенклатура,
		|	СпрНоменклатура.НаименованиеПолноеАнгл КАК НаименованиеАнгл,
		|	ЕСТЬNULL(НоменклатураПереводыНаименований.НаименованиеНаЯзыкеСтраны, """") КАК НаименованиеНаЯзыкеСтраны,
		|	СчетНаОплатуПокупателюТовары.Количество КАК Количество,
		|	СчетНаОплатуПокупателюТовары.Сумма КАК Сумма,
		|	СчетНаОплатуПокупателюТовары.СуммаНДС КАК СуммаНДС,
		|	СчетНаОплатуПокупателюТовары.Калькуляция КАК Калькуляция,
		|	СчетНаОплатуПокупателюТовары.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	СчетНаОплатуПокупателюТовары.СтавкаНДС КАК СтавкаНДС,
		|	СчетНаОплатуПокупателюТовары.РазмерКТК КАК РазмерКТК,
		|	СпрНоменклатура.НаименованиеПолное КАК НаименованиеРус,
		|	СчетНаОплатуПокупателюТовары.Содержание КАК Содержание
		|ИЗ
		|	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ПереводыНаименований КАК НоменклатураПереводыНаименований
		|		ПО СчетНаОплатуПокупателюТовары.Номенклатура = НоменклатураПереводыНаименований.Ссылка
		|			И (НоменклатураПереводыНаименований.Валюта = &ВалютаДоговора)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО СчетНаОплатуПокупателюТовары.Номенклатура = СпрНоменклатура.Ссылка
		|ГДЕ
		|	СчетНаОплатуПокупателюТовары.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Док);   
	Запрос.УстановитьПараметр("ВалютаДоговора", ВалютаДоговора);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	//Евросиб(ДИТ), Беляев СЮ, BUG 109491 / TA 111190, 02-06-2025, начало
	ВидЗадолженностиЗаявки = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьВидЗадолженностиПоДокументу(Док);
	Заявка = ПолучитьЗаявкуСчета(Док);
	//Евросиб(ДИТ), Беляев СЮ, BUG 109491 / TA 111190, 02-06-2025, конец
	
	ОбщаяСумма = 0;
	ОбщаяСуммаНДС = 0; 
	КоличествоСтрок = 0;
	Пока Выборка.Следующий() Цикл
		ОбластьСтрокаТаблицы.Параметры.Номер = Выборка.НомерСтроки;    
		//ДИТ Шевченко А.В. US 103646 TA 103658 06.03.2025
		Если ФорматРасчета = Перечисления.ФорматПротокола.ПротоколОдноязычныйУниверсальный Тогда
			Если СтарыйФормат Тогда
				ОбластьСтрокаТаблицы.Параметры.Услуга = Выборка.НаименованиеРус + Символы.ПС+"Список контейнеров: "+КТКСписок;
			Иначе
				Если СтрНайти(Выборка.Содержание,"Список контейнеров") > 0 Тогда
					Содержание = Лев(Выборка.Содержание,СтрНайти(Выборка.Содержание,"Список контейнеров")-1);	
					ОбластьСтрокаТаблицы.Параметры.Услуга = "" + Содержание + Символы.ПС+"Список контейнеров: "+КТКСписок;
				Иначе
					ОбластьСтрокаТаблицы.Параметры.Услуга = "" + Выборка.Содержание + Символы.ПС + "Список контейнеров: " + КТКСписок;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ФорматРасчета = Перечисления.ФорматПротокола.ПротоколОдноязычныйКомпл Тогда
			Если СтарыйФормат Тогда
				ОбластьСтрокаТаблицы.Параметры.Услуга = Выборка.НаименованиеРус + Символы.ПС + "Список контейнеров: " + КТКСписок + " / " 
				+ Символы.ПС + Выборка.НаименованиеНаЯзыкеСтраны + Символы.ПС + "集装箱清单" + КТКСписок;
			Иначе  
				СодержаниеКит = ПолучитьОписаниеДляСодержанияКитай(ДокОснования);
				Если СтрНайти(Выборка.Содержание,"Список контейнеров") > 0 Тогда	
					Содержание = Лев(Выборка.Содержание,СтрНайти(Выборка.Содержание,"Список контейнеров")-1);	
					ОбластьСтрокаТаблицы.Параметры.Услуга = "" + Содержание + Символы.ПС + "Список контейнеров: " + КТКСписок + " / " 
					+ Символы.ПС + СодержаниеКит + Символы.ПС + "集装箱清单" + КТКСписок; 
				Иначе
					ОбластьСтрокаТаблицы.Параметры.Услуга = "" + Выборка.Содержание + Символы.ПС + "Список контейнеров: " + КТКСписок + " / " 
					+ Символы.ПС + СодержаниеКит + Символы.ПС + "集装箱清单" + КТКСписок;
				КонецЕсли;
			КонецЕсли;		 
		Иначе
			
			Если СтарыйФормат Тогда				
				АнглСодержание = Выборка.НаименованиеАнгл;
				ОбластьСтрокаТаблицы.Параметры.Услуга = Выборка.НаименованиеРус + Символы.ПС + "Список контейнеров: " + КТКСписок + " / " 
				+ Символы.ПС + АнглСодержание + Символы.ПС + "List of containers: " + КТКСписок;
			Иначе
				Если СтрНайти(Выборка.Содержание,"Список контейнеров") > 0 Тогда
					Содержание = Лев(Выборка.Содержание,СтрНайти(Выборка.Содержание,"Список контейнеров")-1);	
				Иначе
					Содержание = Выборка.Содержание;
				КонецЕсли;
				//Если СтрНайти(Выборка.НаименованиеАнгл,"in view of state subsidizing") > 0 Тогда
				//	АнглСодержание = СтрЗаменить(Выборка.НаименованиеАнгл,"in view of state subsidizing",""); 
				//Иначе
				//	АнглСодержание = Выборка.НаименованиеАнгл;
				//КонецЕсли;
				//Евросиб(ДИТ), Беляев СЮ, BUG 109491 / TA 111190, 02-06-2025, начало
				АнглСодержание = Выборка.НаименованиеАнгл;
				//Евросиб СубботинВ #112680 25.06.2025 Начало 
				//Если ВидЗадолженностиЗаявки = Справочники.ВидыЗадолженности.Премии И Заявка <> Неопределено Тогда
				Если ВидЗадолженностиЗаявки = Перечисления.ВидыЗадолженности.Премии И Заявка <> Неопределено Тогда
				//Евросиб СубботинВ #112680 25.06.2025 Конец					
					АнглСодержание = АнглСодержание + Документы.СчетНаОплатуПокупателю.ПолучитьОписаниеДляСодержанияПремии( Заявка, Выборка.Калькуляция, Истина);
				КонецЕсли;
				//Евросиб(ДИТ), Беляев СЮ, BUG 109491 / TA 111190, 02-06-2025, конец
				ОбластьСтрокаТаблицы.Параметры.Услуга = "" + Содержание + Символы.ПС + "Список контейнеров: " + КТКСписок + " / " 
					+ Символы.ПС + АнглСодержание + Символы.ПС + "List of containers: " + КТКСписок;
			КонецЕсли;
			
			 
		КонецЕсли;
		//ДИТ Шевченко А.В. US 103646 TA 103658 06.03.2025  
		ОбластьСтрокаТаблицы.Параметры.Количество = Выборка.Количество; 
		КоличествоСтрок = КоличествоСтрок + 1;
		
		СтруктураСтавок = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Выборка.Калькуляция, "ММ_ИтогоСтавка20, ММ_ИтогоСтавка");  
		ОбластьСтрокаТаблицы.Параметры.Ставка = ?(Выборка.РазмерКТК = Справочники.РазмерыКТК.К20, СтруктураСтавок.ММ_ИтогоСтавка20, СтруктураСтавок.ММ_ИтогоСтавка);
				
		ОбластьСтрокаТаблицы.Параметры.Сумма = ?(Выборка.СуммаВключаетНДС, Выборка.Сумма, Выборка.Сумма + Выборка.СуммаНДС);	
		//Результат.Вывести(ОбластьСтрокаТаблицы); 
		
		//Евросиб(ДИТ), Беляев СЮ, US 103645 / TA 106776, 07-04-2025, начало
		ОбластьСтрокаТаблицы.Параметры.ЕдиницаИзмерения = ЗначениеКолонки_ЕдиницаИзмерения;
		ОбластьСтрокаТаблицы.Параметры.СтавкаНДС = ЗначениеКолонки_СтавкаНДС;
		
		ОбщаяСумма = ОбщаяСумма + ОбластьСтрокаТаблицы.Параметры.Сумма;
		ОбщаяСуммаНДС = ОбщаяСуммаНДС + Выборка.СуммаНДС;
		
		ПроверяемаяОбласть = Новый Массив;
		ПроверяемаяОбласть.Добавить(ОбластьСтрокаТаблицы);
		ПроверяемаяОбласть.Добавить(ОбластьПодвалТаблицы);
		ВыводНаСтраницу = ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(Результат, ПроверяемаяОбласть);
		Если Не ВыводНаСтраницу Тогда
		//Евросиб(ДИТ) Антонова А.С. US 103645 ТА 107208 Начало 14.04.2025
		//Было:
			//Результат.ВывестиГоризонтальныйРазделительСтраниц(); 
		//Стало:
			ПроверяемаяОбласть.Удалить(1);
			
			ПроверяемаяОбластьПоследнегоЛиста = Новый Массив;
			ПроверяемаяОбластьПоследнегоЛиста.Добавить(ОбластьСтрокаТаблицы);  
			ПроверяемаяОбластьПоследнегоЛиста.Добавить(ОбластьПодвалТаблицы); 
			
			ПечатьБухгалтерскихДокументов.ВывестиСтрокуЧастями(Результат, ПроверяемаяОбласть, ОбластьСтрокаТаблицы, ОбластьСтрокаТаблицы.Параметры.Услуга, "Услуга",,,ПроверяемаяОбластьПоследнегоЛиста);
		Иначе
			Результат.Вывести(ОбластьСтрокаТаблицы); 
		//Евросиб(ДИТ) Антонова А.С. US 103645 ТА 107208 Конец 14.04.2025   
		КонецЕсли;
		//Евросиб(ДИТ) Антонова А.С. US 103645 ТА 107208 Начало 14.04.2025
		//Было:  
		//ВыводНаСтраницу = ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(Результат, ПроверяемаяОбласть);
		//Если Не ВыводНаСтраницу Тогда
		//	ПечатьБухгалтерскихДокументов.ВывестиСтрокуЧастями(Результат, ПроверяемаяОбласть, ОбластьСтрокаТаблицы, ОбластьСтрокаТаблицы.Параметры.Услуга, "Услуга");
		//Иначе
		//	Результат.Вывести(ОбластьСтрокаТаблицы);
		//КонецЕсли;               
		//Евросиб(ДИТ) Антонова А.С. US 103645 ТА 107208 Конец 14.04.2025
		//Евросиб(ДИТ), Беляев СЮ, US 103645 / TA 106776, 07-04-2025, конец
		
	КонецЦикла;         
	ОбластьПодвалТаблицы.Параметры.СуммаИтого = Формат(ОбщаяСумма, "ЧДЦ=2") + " "+ Док.ВалютаДокумента;
	ОбластьПодвалТаблицы.Параметры.СуммаНДСИтого = Формат(ОбщаяСуммаНДС, "ЧДЦ=2") +" "+ Док.ВалютаДокумента;
	ОбластьПодвалТаблицы.Параметры.КолНаименований = КоличествоСтрок;  
	ОбластьПодвалТаблицы.Параметры.НомерДоговора = Док.ДоговорКонтрагента.Номер; 
	//ДИТ Шевченко А.В. US 103646 TA 103658 06.03.2025
	Если СтарыйФормат Тогда
		ОбластьПодвалТаблицы.Параметры.ДатаДоговора = "";
	Иначе
		
		От = " ";
		Если ФорматРасчета = Перечисления.ФорматПротокола.ПротоколОдноязычныйУниверсальный Тогда
			От = " от ";
		КонецЕсли;
		
		ОбластьПодвалТаблицы.Параметры.ДатаДоговора = От + Формат(Док.ДоговорКонтрагента.Дата,"ДФ=dd.MM.yyyy");
	КонецЕсли;	
	//ДИТ Шевченко А.В. US 103646 TA 103658 06.03.2025
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СчетНаОплатуПокупателюДокументыОснования.Документ КАК Документ.Заявка).ПСЦ КАК ПСЦ
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
	|ГДЕ
	|	СчетНаОплатуПокупателюДокументыОснования.Ссылка = &Ссылка
	|	И ТИПЗНАЧЕНИЯ(СчетНаОплатуПокупателюДокументыОснования.Документ) = ТИП(Документ.Заявка)";
	
	Запрос.УстановитьПараметр("Ссылка", Док);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		НомерПСЦ = "";
		Пока Выборка.Следующий() Цикл
			//ДИТ Шевченко А.В. US 103646 TA 103658 06.03.2025
			Если СтарыйФормат Тогда
				НомерПСЦ = НомерПСЦ + ?(НомерПСЦ<>"", ", ", "") + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.ПСЦ, "НомерПСЦ");
			Иначе
				От = " ";
				Если ФорматРасчета = Перечисления.ФорматПротокола.ПротоколОдноязычныйУниверсальный Тогда
					От = " от ";
				КонецЕсли;
				НомерПСЦ = НомерПСЦ + ?(НомерПСЦ<>"", ", ", "") + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.ПСЦ, "НомерПСЦ") + От + Формат(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.ПСЦ, "ДатаПСЦ"),"ДФ=dd.MM.yyyy");
			КонецЕсли;
			//ДИТ Шевченко А.В. US 103646 TA 103658 06.03.2025
		КонецЦикла;
		ОбластьПодвалТаблицы.Параметры.НомерПСЦ = НомерПСЦ;
	КонецЕсли;

	Попытка
		Если ВалютаДоговора = Справочники.Валюты.Рубль Тогда
			ПараметрыПредметаИсчисления = "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
		ИначеЕсли ВалютаДоговора = Справочники.Валюты.Юань Тогда
			ПараметрыПредметаИсчисления = "юань, юаня, юаней, м, фэнь, фэня, фэней, м, 2";
		Иначе
			ПараметрыПредметаИсчисления = "доллар, долларов, цент, центов, 2";
		КонецЕсли;
		ОбластьПодвалТаблицы.Параметры.СуммаТекстом = ЧислоПрописью(ОбщаяСумма,, ПараметрыПредметаИсчисления); 
	Исключение
	КонецПопытки;    
	//Евросиб(ДИТ) Антонова А.С. US 103645 ТА 105974 Начало 31.03.2025
	Если не Результат.ПроверитьВывод(ОбластьПодвалТаблицы) Тогда
		Результат.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	//Евросиб(ДИТ) Антонова А.С. US 103645 ТА 105974 Конец 31.03.2025
	Результат.Вывести(ОбластьПодвалТаблицы);
	
	///////////////////// ПОДПИСИ ///////////////////// 
	НаименованияНаДату = Справочники.Организации.НаименованияНаДату(?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация, Док.Организация), Док.Дата);
	
	СтруктураГлБух = Новый Структура("ФИО, ФИОАнгл, Факсимиль, Основание, ОснованиеАнгл, ФИОВал, ОснованиеВал");
	Если не ЗначениеЗаполнено(Док.ДоверенностьЗаГлБухгалтера) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Доверенности.ФИОПодписанта КАК ФИО,
		|	Доверенности.ФайлФаксимиль КАК Факсимиль,
		|	Доверенности.ОснованиеДляПодписания КАК Основание,
		|	Доверенности.ОснованиеДляПодписанияАнгл КАК ОснованиеАнгл,
		|	Доверенности.Физлицо.ФамилияИнициалыАнгл КАК ФИОАнгл,
		|	ЕСТЬNULL(ФизическиеЛицаПереводыНаименований.ФИО, """") КАК ФИО1,
		|	ЕСТЬNULL(ФизическиеЛицаПереводыНаименований.Основание, """") КАК Основание1
		|ИЗ
		|	Справочник.Доверенности КАК Доверенности
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.ПереводыНаименований КАК ФизическиеЛицаПереводыНаименований
		|		ПО Доверенности.Физлицо = ФизическиеЛицаПереводыНаименований.Ссылка
		|			И (ФизическиеЛицаПереводыНаименований.Валюта = &Валюта)
		|ГДЕ
		|	Доверенности.ДатаНачалаДействия <= &ДатаДокумента
		|	И Доверенности.ДатаОкончанияДейставия >= &ДатаДокумента
		|	И (Доверенности.ФИОПодписанта = &ФИОПодписанта
		|			ИЛИ Доверенности.Физлицо = &Физлицо)
		|	И Доверенности.ДоверенностьДляПодписанта = &Должность";
		
		Запрос.УстановитьПараметр("ДатаДокумента", Док.ДатаДокумента);
		Запрос.УстановитьПараметр("Должность", Перечисления.ОтветственныеЛицаОрганизации.ГлавныйБухгалтер);
		Запрос.УстановитьПараметр("Физлицо", Док.Организация.ГлавныйБухгалтер);
		Запрос.УстановитьПараметр("ФИОПодписанта", Строка(Док.Организация.ГлавныйБухгалтер));
		Запрос.УстановитьПараметр("Валюта", ВалютаДоговора);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда   
			ЗаполнитьЗначенияСвойств(СтруктураГлБух, Выборка);	
		КонецЕсли;
	Иначе
		СтруктураГлБух.ФИО = Док.Организация.ГлавныйБухгалтер;
		СтруктураГлБух.ФИОАнгл = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Док.Организация.ГлавныйБухгалтер, "ФамилияИнициалыАнгл");
		СтруктураГлБух.Факсимиль = Док.ДоверенностьЗаГлБухгалтера.ФайлФаксимиль; 
		СтруктураГлБух.Основание = Док.ДоверенностьЗаГлБухгалтера.ОснованиеДляПодписания;
		СтруктураГлБух.ОснованиеАнгл = Док.ДоверенностьЗаГлБухгалтера.ОснованиеДляПодписанияАнгл; 
		
		ПереводыНаименований = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Док.Организация.ГлавныйБухгалтер, "ПереводыНаименований");
		ВыборкаПереводов = ПереводыНаименований.Выбрать();
		СтруктураОтбораВалюты = Новый Структура("Валюта", ВалютаДоговора);
		Если ВыборкаПереводов.НайтиСледующий(СтруктураОтбораВалюты) Тогда
			СтруктураГлБух.ФИОВал = ВыборкаПереводов.ФИО;
			СтруктураГлБух.ОснованиеВал = ВыборкаПереводов.Основание;	
		КонецЕсли;
	КонецЕсли;
	
	ОбластьПодписи.Параметры.ФИОРуководитель	= НашРуководитель.Ссылка.Фамилия + " " + Лев(НашРуководитель.Ссылка.Имя, 1) + "." + Лев(НашРуководитель.Ссылка.Отчество, 1) + ".";   
	//ДИТ Шевченко А.В. US 103646 TA 103658 06.03.2025
	Если СтарыйФормат Тогда
		ОбластьПодписи.Параметры.ФИОБухгалтер		= СтруктураГлБух.ФИО;    
		ОбластьПодписи.Параметры.ДоверенностьБух 	= СтруктураГлБух.Основание;
	КонецЕсли;
	ОбластьПодписи.Параметры.ФИОКонтрагент		= РуководительКонтрагента.ФИОРус;
	
	Если ЗаполнятьАнглийскиеНаименования Тогда
		Если СтарыйФормат Тогда
			ОбластьПодписи.Параметры.ФИОРуководительАнгл 	= НашРуководитель.ФИОАнгл;
			ОбластьПодписи.Параметры.ФИОБухгалтерАнгл 		= СтруктураГлБух.ФИОАнгл;
			ОбластьПодписи.Параметры.ДоверенностьБухАнгл 	= СтруктураГлБух.ОснованиеАнгл;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗаполнятьНаименованияПоВалюте Тогда
		ОбластьПодписи.Параметры.ФИОРуководительКит 	= НашРуководитель.ФИОВал;
		Если СтарыйФормат Тогда
			ОбластьПодписи.Параметры.ФИОБухгалтерКит 		= СтруктураГлБух.ФИОВал;
			ОбластьПодписи.Параметры.ДоверенностьБухКит		= СтруктураГлБух.ОснованиеВал;
		КонецЕсли;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя.ФайлФаксимиль) Тогда
		ДанныеКартинкиПодпись = РаботаСФайлами.ДанныеФайла(Док.ДоверенностьЗаРуководителя.ФайлФаксимиль);
		ДвоичныеДанныеПодпись = ПолучитьИзВременногоХранилища(ДанныеКартинкиПодпись.СсылкаНаДвоичныеДанныеФайла);
		Если ЗначениеЗаполнено(ДвоичныеДанныеПодпись) Тогда
			Если СтарыйФормат Тогда
				ОбластьПодписи.Рисунки.ПодписьРуководителя.Картинка = Новый Картинка(ДвоичныеДанныеПодпись);
			Иначе
				ОбластьПодписи.Рисунки.ПодписьРуководителя1.Картинка = Новый Картинка(ДвоичныеДанныеПодпись);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя.ФайлПечать) тогда
		ДанныеКартинкиПечать = РаботаСФайлами.ДанныеФайла(Док.ДоверенностьЗаРуководителя.ФайлПечать);
		ДвоичныеДанныеПечать = ПолучитьИзВременногоХранилища(ДанныеКартинкиПечать.СсылкаНаДвоичныеДанныеФайла);
		Если ЗначениеЗаполнено(ДвоичныеДанныеПечать) Тогда
			Если СтарыйФормат Тогда
				ОбластьПодписи.Рисунки.Печать.Картинка = Новый Картинка(ДвоичныеДанныеПечать);
			Иначе
				ОбластьПодписи.Рисунки.Печать1.Картинка = Новый Картинка(ДвоичныеДанныеПечать);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	Если ЗначениеЗаполнено(СтруктураГлБух.Факсимиль) Тогда
		ДанныеКартинкиПодпись = РаботаСФайлами.ДанныеФайла(СтруктураГлБух.Факсимиль);
		ДвоичныеДанныеПодпись = ПолучитьИзВременногоХранилища(ДанныеКартинкиПодпись.СсылкаНаДвоичныеДанныеФайла);
		Если ЗначениеЗаполнено(ДвоичныеДанныеПодпись) Тогда
			Если СтарыйФормат Тогда
				ОбластьПодписи.Рисунки.ПодписьБухгалтера.Картинка = Новый Картинка(ДвоичныеДанныеПодпись);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//ДИТ Шевченко А.В. US 103646 TA 103658 06.03.2025
	
	//Евросиб(ДИТ) Антонова А.С. US 103645 ТА 105974 Начало 31.03.2025
	Если не Результат.ПроверитьВывод(ОбластьПодписи) Тогда
		Результат.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	//Евросиб(ДИТ) Антонова А.С. US 103645 ТА 105974 Конец 31.03.2025
	
	Результат.Вывести(ОбластьПодписи); 
	
	//Евросиб(ДИТ) Антонова А.С. US 103645 ТА 107208 Начало 14.04.2025
	Результат.НижнийКолонтитул.ТекстСправа = "Страница [&НомерСтраницы] из [&СтраницВсего]";
    Результат.НижнийКолонтитул.Выводить = Истина;         
	
	НомерСчета = Док.НомерДляПечати;   
	ДатаСоставления = Формат(Док.ДатаДокумента,"ДФ=d.MM.yyyy");
	Если ФорматРасчета = Перечисления.ФорматПротокола.ПротоколОдноязычныйКомпл Тогда
		ТекстКолонтитулаСверху = СтрШаблон("Расчет %1 %2 от %3/ %3 %4",
									"премии", НомерСчета, ДатаСоставления, "酬金的结算"); 
	ИначеЕсли ФорматРасчета = Перечисления.ФорматПротокола.ПротоколОдноязычныйУниверсальный Тогда
		ТекстКолонтитулаСверху = СтрШаблон("Расчет %1 %2 от %3",
									"премии", НомерСчета, ДатаСоставления);
	Иначе  
		ПремииАнгл = "bonus calculation";
		ТекстКолонтитулаСверху = СтрШаблон("Расчет %1 %2 от %3/ %4 %2 of %3",
									"премии", НомерСчета, ДатаСоставления, "bonus calculation");
	КонецЕсли;
	Результат.ВерхнийКолонтитул.ТекстСлева = ТекстКолонтитулаСверху;
    Результат.ВерхнийКолонтитул.Выводить = Истина;
	//Евросиб(ДИТ) Антонова А.С. US 103645 ТА 107208 Конец 14.04.2025
	
	///////////////////// ПРИКРЕПЛЕНИЕ ВЛОЖЕННОГО ФАЙЛА /////////////////////
	СтруктураВозврата.ПФ = Результат;   
	
	ИмяФайлаПФ = "Расчет премии по счету №" + СтрЗаменить(Док.Номер, "/", "-") + ?(ЗаполнятьАнглийскиеНаименования, " (двуязычный англ)", "")
						+ ?(ФорматРасчета = Перечисления.ФорматПротокола.ПротоколОдноязычныйКомпл, " (двуязычный китайский)", ""); 
	ИмяФайла = КаталогВременныхФайлов() + ИмяФайлаПФ + ".DOCX";

	Результат.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.DOCX); 
	ПрисоединенныйФайл = РаботаСФайлами.ДобавитьФайлСДиска(Док.Ссылка, ИмяФайла);  
	
	Попытка
		УдалитьФайлы(КаталогВременныхФайлов(), ИмяФайлаПФ + ".DOCX");
	Исключение
	КонецПопытки;

	СтруктураВозврата.Результат = Истина;
	
	Возврат СтруктураВозврата;

КонецФункции  

//ДИТ, Беляев СЮ, Ticket#0326555, 10-10-2023, начало
Функция ПолучитьТекстОснования(Объект) Экспорт
	ШаблонТекстОснования = "%НомерДоговора% от %ДатаДоговора%";
	Если ЗначениеЗаполнено(Объект.ПравилоФормирования) Тогда
		ШаблонТекстОснованияИзПравила = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ПравилоФормирования, "ШаблонТекстаОснованияВСчете");
		Если ЗначениеЗаполнено(ШаблонТекстОснованияИзПравила) Тогда
			ШаблонТекстОснования = ШаблонТекстОснованияИзПравила;
		КонецЕсли;
	КонецЕсли;
	РеквизитыДляПолучения = Новый Массив;
	Если СтрНайти(ШаблонТекстОснования, "%НомерДоговора%") Тогда
		РеквизитыДляПолучения.Добавить("Номер");
	КонецЕсли;
	Если СтрНайти(ШаблонТекстОснования, "%ДатаДоговора%") Тогда
		РеквизитыДляПолучения.Добавить("Дата");
	КонецЕсли;                                         
	Если ЗначениеЗаполнено(РеквизитыДляПолучения) Тогда
		РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ДоговорКонтрагента, РеквизитыДляПолучения);
	КонецЕсли;         
	Если РеквизитыДляПолучения.Найти("Номер") <> Неопределено Тогда
		ШаблонТекстОснования = СтрЗаменить(ШаблонТекстОснования, "%НомерДоговора%", РеквизитыДоговора.Номер);
	КонецЕсли;
	Если РеквизитыДляПолучения.Найти("Дата") <> Неопределено Тогда
		ШаблонТекстОснования = СтрЗаменить(ШаблонТекстОснования, "%ДатаДоговора%", Формат(РеквизитыДоговора.Дата, "ДФ=dd.MM.yyyy"));
	КонецЕсли;
	Возврат ШаблонТекстОснования;
КонецФункции
//ДИТ, Беляев СЮ, Ticket#0326555, 10-10-2023, конец

 // Субботин 79718 17.01.2024 начало 
&НаСервере
Процедура ОтвязатьПоступления(МассивПоступлений, Счет) Экспорт
	
	Для каждого Поступление из МассивПоступлений Цикл 
		ОбПоступление = Поступление.ПолучитьОбъект();			
		СтруктураПоиска = Новый Структура("СчетПокупателю", Счет);
		НайденныеСтроки = ОбПоступление.РазнесениеНаСчетаПокупателям.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() >0 тогда
			ОбПоступление.ВыполненаПопыткаРазнесения = Ложь;
			Для Каждого Строка из НайденныеСтроки Цикл
				ОбПоступление.РазнесениеНаСчетаПокупателям.Удалить(Строка);
			КонецЦикла;
		КонецЕсли;
		ОбПоступление.Записать(РежимЗаписиДокумента.Проведение); 
	КонецЦикла;
	ОбщегоНазначения.СообщитьПользователю("Поступления на расчетный счет отвязаны.");
	
КонецПроцедуры     
	

&НаСервере
Функция ПроверитьВозможностьИзмененияДокумента(Счет, УзелОбмена = Неопределено) Экспорт
	
	ДопПакет = "";
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеНаРасчетныйСчетРазнесениеНаСчетаПокупателям.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет.РазнесениеНаСчетаПокупателям КАК ПоступлениеНаРасчетныйСчетРазнесениеНаСчетаПокупателям
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчетРазнесениеНаСчетаПокупателям.Ссылка.Проведен
	|	И ПоступлениеНаРасчетныйСчетРазнесениеНаСчетаПокупателям.СчетПокупателю = &Счет
	//Евросиб Каблов 15.10.2025 ( #111016
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КорректировкаДолгаРасшифровкаДебиторскойЗадолженности.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КорректировкаДолга.РасшифровкаДебиторскойЗадолженности КАК КорректировкаДолгаРасшифровкаДебиторскойЗадолженности
	|ГДЕ
	|	КорректировкаДолгаРасшифровкаДебиторскойЗадолженности.ДокументРасшифровки = &Счет
	|	И КорректировкаДолгаРасшифровкаДебиторскойЗадолженности.Ссылка.Проведен
	//Евросиб Каблов 15.10.2025 ) #111016
	|";
		
	Если НЕ УзелОбмена  = Неопределено Тогда		
		Запрос.Текст = Запрос.Текст + 
		"
		|;
		|/////////////////////////////////////////////////////////////
		|";
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	ПротоколОбменов.Объект КАК Объект
		|ИЗ
		|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		|ГДЕ
		|	ПротоколОбменов.Объект = &Счет
		|	И ПротоколОбменов.УзелОбмена = &УзелОбмена";
		
		Запрос.УстановитьПараметр("УзелОбмена",УзелОбмена);// Перечисления.УзлыОбмена.РИТМ);
	КонецЕсли;
	Запрос.УстановитьПараметр("Счет", Счет);
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции
// Субботин 79718 17.01.2024 Конец

//Евросиб Каблов 15.10.2025 #111016
Функция ПолучитьСвязанныеДокументы(Счет, УзелОбмена = Неопределено) Экспорт
	
	ДопПакет = "";
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеНаРасчетныйСчетРазнесениеНаСчетаПокупателям.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет.РазнесениеНаСчетаПокупателям КАК ПоступлениеНаРасчетныйСчетРазнесениеНаСчетаПокупателям
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчетРазнесениеНаСчетаПокупателям.Ссылка.Проведен
	|	И ПоступлениеНаРасчетныйСчетРазнесениеНаСчетаПокупателям.СчетПокупателю = &Счет
	|;
	|/////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КорректировкаДолгаРасшифровкаДебиторскойЗадолженности.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КорректировкаДолга.РасшифровкаДебиторскойЗадолженности КАК КорректировкаДолгаРасшифровкаДебиторскойЗадолженности
	|ГДЕ
	|	КорректировкаДолгаРасшифровкаДебиторскойЗадолженности.ДокументРасшифровки = &Счет
	|	И КорректировкаДолгаРасшифровкаДебиторскойЗадолженности.Ссылка.Проведен
	|";
		
	Если НЕ УзелОбмена  = Неопределено Тогда		
		Запрос.Текст = Запрос.Текст + 
		"
		|;
		|/////////////////////////////////////////////////////////////
		|";
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	ПротоколОбменов.Объект КАК Объект
		|ИЗ
		|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
		|ГДЕ
		|	ПротоколОбменов.Объект = &Счет
		|	И ПротоколОбменов.УзелОбмена = &УзелОбмена";
		
		Запрос.УстановитьПараметр("УзелОбмена",УзелОбмена);// Перечисления.УзлыОбмена.РИТМ);
	КонецЕсли;
	Запрос.УстановитьПараметр("Счет", Счет);
	
	Результаты = Запрос.ВыполнитьПакет();
	
	ПоступленияНаРС = Результаты[0].Выгрузить().ВыгрузитьКолонку("Ссылка");
	КорректировкиДолга = Результаты[1].Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ЕстьЗаписьВПротоколеОбменов = Ложь;
	Если Результаты.Количество() > 2 Тогда
		ЕстьЗаписьВПротоколеОбменов = Не Результаты[2].Пустой();
	КонецЕсли;
		
		
	СвязанныеДокументы = Новый Структура;
	СвязанныеДокументы.Вставить("ПоступленияНаРасчетныйСчет", ПоступленияНаРС);
	СвязанныеДокументы.Вставить("КорректировкиДолга", КорректировкиДолга);
	СвязанныеДокументы.Вставить("ЕстьЗаписьВПротоколеОбменов", ЕстьЗаписьВПротоколеОбменов);
	
	Возврат СвязанныеДокументы;
	
КонецФункции

//Евросиб Каблов 15.10.2025 #111016
&НаСервере
Функция ПроверитьИзмененияКлючевыхРеквизитов(Объект) Экспорт

	ИзмененияКлюченвыхРеквизитов = 
	Объект.Контрагент <> Объект.Ссылка.Контрагент
	или Объект.ДоговорКонтрагента <> Объект.Ссылка.ДоговорКонтрагента	
	или Объект.Товары.Итог("Сумма") <>  Объект.Ссылка.Товары.Итог("Сумма")
	или	Объект.Товары.Итог("СуммаНДС") <>  Объект.Ссылка.Товары.Итог("СуммаНДС");	 
	
	// ДИТ US 57674 ТА 79279 Сержантова А.С. Начало: 27.03.2024 - если есть задача на удаление счета, то считаем, что было изменение ключевых реквизитов
	ЗадачаПоУдалению = Объект.Состояния.НайтиСтроки(Новый Структура("Состояние", Справочники.Состояния.УдалениеСчета));
	Если ЗадачаПоУдалению.Количество() и ЗадачаПоУдалению[0].Статус <> Перечисления.СтатусыЭтапов.Выполнен Тогда
		ИзмененияКлюченвыхРеквизитов = Истина;	
	КонецЕсли;
	// ДИТ US 57674 ТА 79279 Сержантова А.С. Конец: 27.03.2024
	
	//Евросиб Каблов 15.10.2025 ( #111016
	//Возврат ИзмененияКлюченвыхРеквизитов
	
	Если ИзмененияКлюченвыхРеквизитов Тогда
		ИзмененияКлючевыхРеквизитовДляКД = Истина;
	Иначе
		ТаблицаТоварыТекущая = Объект.Товары.Выгрузить(, "Номенклатура, Сумма, СуммаНДС");
		ТаблицаТоварыПредыдущая = Объект.Ссылка.Товары.Выгрузить(, "Номенклатура, Сумма, СуммаНДС");	
		ИзмененияКлючевыхРеквизитовДляКД = Не ОбщегоНазначения.КоллекцииИдентичны(ТаблицаТоварыПредыдущая, ТаблицаТоварыТекущая);
	КонецЕсли;
	
	РезультатПроверки = Новый Структура;
	РезультатПроверки.Вставить("ИзмененыКлючевыеРеквизитыДляПоступленияНаРасчетныйСчет", ИзмененияКлюченвыхРеквизитов);
	РезультатПроверки.Вставить("ИзмененыКлючевыеРеквизитыДляКорректировкиДолга", ИзмененияКлючевыхРеквизитовДляКД);
	
	Возврат РезультатПроверки;
	//Евросиб Каблов 15.10.2025 ) #111016
	
КонецФункции

//МальцевАН #77303 20.05.2024
//(
Функция ПерезаполнитьАктуальныеДокументыОснованияПоСчету(СчетОбъект) Экспорт
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	СчетНаОплатуПокупателюТовары.Идентификатор КАК Идентификатор,
	//	|	СчетНаОплатуПокупателюТовары.СтрокаДоходовСделки КАК СтрокаДоходовСделки
	//	|ПОМЕСТИТЬ ВТ_Товары
	//	|ИЗ
	//	|	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
	//	|ГДЕ
	//	|	НЕ СчетНаОплатуПокупателюТовары.СтрокаДоходовСделки = """"
	//	//|	И СчетНаОплатуПокупателюТовары.Ссылка = &Ссылка
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	СделкаСвязьУчетныхЕдиниц.Заявка КАК Документ,
	//	|	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Сделка,
	//	|	-1 КАК Поле1
	//	|ПОМЕСТИТЬ ВТ_ДокументыОснованияПоСоставПоезда
	//	|ИЗ
	//	|	ВТ_Товары КАК ВТ_Товары
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	//	|			ПО СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц = СделкаСвязьУчетныхЕдиниц.ГУИД
	//	|				И СделкаСвязьДоходовИРасходов.Ссылка = СделкаСвязьУчетныхЕдиниц.Ссылка
	//	|		ПО ВТ_Товары.СтрокаДоходовСделки = СделкаСвязьДоходовИРасходов.Доходы
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	СчетНаОплатуПокупателюДокументыОснования.Документ КАК Документ,
	//	|	СчетНаОплатуПокупателюДокументыОснования.Сделка КАК Сделка,
	//	|	1 КАК Поле1
	//	|ПОМЕСТИТЬ ВТ_ДокументОснования
	//	|ИЗ
	//	|	Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
	//	//|ГДЕ
	//	//|	СчетНаОплатуПокупателюДокументыОснования.Ссылка = &Ссылка
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_ДокументОснования.Документ КАК Документ,
	//	|	ВТ_ДокументОснования.Сделка КАК Сделка,
	//	|	ВТ_ДокументОснования.Поле1 КАК Поле1
	//	|ПОМЕСТИТЬ ВТ_Сравнение
	//	|ИЗ
	//	|	ВТ_ДокументОснования КАК ВТ_ДокументОснования
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ВТ_ДокументыОснованияПоСоставПоезда.Документ,
	//	|	ВТ_ДокументыОснованияПоСоставПоезда.Сделка,
	//	|	ВТ_ДокументыОснованияПоСоставПоезда.Поле1
	//	|ИЗ
	//	|	ВТ_ДокументыОснованияПоСоставПоезда КАК ВТ_ДокументыОснованияПоСоставПоезда
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_Сравнение.Документ КАК Документ,
	//	|	ВЫБОР
	//	|		КОГДА СУММА(ВТ_Сравнение.Поле1) = 1
	//	|			ТОГДА ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
	//	|		ИНАЧЕ ВТ_Сравнение.Сделка
	//	|	КОНЕЦ КАК Сделка,
	//	|	СУММА(ВТ_Сравнение.Поле1) КАК Поле1
	//	|ИЗ
	//	|	ВТ_Сравнение КАК ВТ_Сравнение
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВТ_Сравнение.Документ,
	//	|	ВТ_Сравнение.Сделка
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_Сравнение.Документ КАК Документ,
	//	|	ВТ_Сравнение.Сделка КАК Сделка,
	//	|	СУММА(ВТ_Сравнение.Поле1) КАК Поле1
	//	|ИЗ
	//	|	ВТ_Сравнение КАК ВТ_Сравнение
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВТ_Сравнение.Документ,
	//	|	ВТ_Сравнение.Сделка
	//	|
	//	|ИМЕЮЩИЕ
	//	|	СУММА(ВТ_Сравнение.Поле1) <> 0";
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	СчетНаОплатуПокупателюДокументыОснования.Документ КАК Документ,
	//|	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Сделка,
	//|	1 КАК Сравнение
	//|ПОМЕСТИТЬ ВТ_АктуальныеИТекущие
	//|ИЗ
	//|	Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	//|		ПО СчетНаОплатуПокупателюДокументыОснования.Документ = СделкаСвязьУчетныхЕдиниц.Заявка
	//|			И (СделкаСвязьУчетныхЕдиниц.Ссылка.Проведен)
	//|ГДЕ
	//|	СчетНаОплатуПокупателюДокументыОснования.Ссылка = &СчетСсылка
	//|   И НЕ СчетНаОплатуПокупателюДокументыОснования.Документ.Ссылка ЕСТЬ NULL
	//|
	//|ОБЪЕДИНИТЬ
	//|
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	СчетНаОплатуПокупателюДокументыОснования.Документ,
	//|	СчетНаОплатуПокупателюДокументыОснования.Сделка,
	//|	-1
	//|ИЗ
	//|	Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
	//|ГДЕ
	//|	СчетНаОплатуПокупателюДокументыОснования.Ссылка = &СчетСсылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Сравнение.Документ КАК Документ,
	//|	ВТ_Сравнение.Сделка КАК Сделка,
	//|	СУММА(ВТ_Сравнение.Сравнение) КАК Сравнение
	//|ПОМЕСТИТЬ ВТ_Сравнение
	//|ИЗ
	//|	ВТ_АктуальныеИТекущие КАК ВТ_Сравнение
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_Сравнение.Документ,
	//|	ВТ_Сравнение.Сделка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Сравнение.Документ КАК Документ,
	//|	ВТ_Сравнение.Сделка КАК Сделка,
	//|	ВТ_Сравнение.Сравнение КАК Сравнение
	//|ИЗ
	//|	ВТ_Сравнение КАК ВТ_Сравнение
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_Сравнение.Документ,
	//|	ВТ_Сравнение.Сделка,
	//|	ВТ_Сравнение.Сравнение
	//|
	//|ИМЕЮЩИЕ
	//|	СУММА(ВТ_Сравнение.Сравнение) <> 0
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Сравнение.Документ КАК Документ,
	//|	ВТ_Сравнение.Сделка КАК Сделка
	//|ИЗ
	//|	ВТ_Сравнение КАК ВТ_Сравнение
	//|ГДЕ
	//|	ВТ_Сравнение.Сравнение = 1";
	//Запрос.УстановитьПараметр("СчетСсылка", СчетОбъект.Ссылка);
	//МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
	//КоличествоРезультатов = МассивРезультатовЗапроса.Количество();
	//
	//Если МассивРезультатовЗапроса[КоличествоРезультатов-2].Пустой() Тогда
	//	НеобходимаЗапись = Ложь;
	//Иначе
	//	АктуальныеДанные = МассивРезультатовЗапроса[КоличествоРезультатов-1].Выгрузить();
	//	СчетОбъект.ДокументыОснования.Загрузить(АктуальныеДанные);
	//	НеобходимаЗапись = Истина;	
	//КонецЕсли;
	
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0403303, 19-06-2025, начало
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетНаОплатуПокупателюДокументыОснования.Документ КАК Документ,
	|	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Сделка
	|ПОМЕСТИТЬ ВТ_Актуальные
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|		ПО СчетНаОплатуПокупателюДокументыОснования.Документ = СделкаСвязьУчетныхЕдиниц.Заявка
	|			И (СделкаСвязьУчетныхЕдиниц.Ссылка.Проведен)
	|ГДЕ
	|	СчетНаОплатуПокупателюДокументыОснования.Ссылка = &СчетСсылка
	|	И НЕ СчетНаОплатуПокупателюДокументыОснования.Документ.Ссылка ЕСТЬ NULL
	|	И НЕ СделкаСвязьУчетныхЕдиниц.Заявка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетНаОплатуПокупателюДокументыОснования.Документ КАК Документ,
	|	СчетНаОплатуПокупателюДокументыОснования.Сделка КАК Сделка
	|ПОМЕСТИТЬ ВТ_Текущие
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
	|ГДЕ
	|	СчетНаОплатуПокупателюДокументыОснования.Ссылка = &СчетСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Актуальные.Документ КАК Документ,
	|	ВТ_Актуальные.Сделка КАК Сделка
	|ИЗ
	|	ВТ_Актуальные КАК ВТ_Актуальные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Текущие КАК ВТ_Текущие
	|		ПО ВТ_Актуальные.Документ = ВТ_Текущие.Документ
	|			И ВТ_Актуальные.Сделка = ВТ_Текущие.Сделка
	|ГДЕ
	|	ВТ_Текущие.Документ ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Текущие.Документ КАК Документ,
	|	ВТ_Текущие.Сделка КАК Сделка
	|ИЗ
	|	ВТ_Текущие КАК ВТ_Текущие
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Актуальные КАК ВТ_Актуальные
	|		ПО ВТ_Текущие.Документ = ВТ_Актуальные.Документ
	|			И ВТ_Текущие.Сделка = ВТ_Актуальные.Сделка
	|ГДЕ
	|	ВТ_Актуальные.Документ ЕСТЬ NULL
	|	И НЕ ВТ_Текущие.Сделка = ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("СчетСсылка", СчетОбъект.Ссылка);
	МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
	КоличествоРезультатов = МассивРезультатовЗапроса.Количество();
	
	НеобходимаЗапись = Ложь;
	
	//ДОБАВЛЕНИЕ СДЕЛКИ И ЗАЯВКИ В СЧЕТ
	ВыборкаДобавитьСделку = МассивРезультатовЗапроса[КоличествоРезультатов-2].Выбрать();
	Пока ВыборкаДобавитьСделку.Следующий() Цикл
		СтрокиДляИзменения = СчетОбъект.ДокументыОснования.НайтиСтроки(Новый Структура("Документ", ВыборкаДобавитьСделку.Документ));
		Для Каждого СтрокаДляИзменения Из СтрокиДляИзменения Цикл
			СтрокаДляИзменения.Сделка = ВыборкаДобавитьСделку.Сделка;
		КонецЦикла;
		НеобходимаЗапись = Истина;
	КонецЦикла;
	
	//УДАЛЕНИЕ СДЕЛКИ ИЗ СЧЕТА
	ВыборкаУдалитььСделку = МассивРезультатовЗапроса[КоличествоРезультатов-1].Выбрать();
	Пока ВыборкаУдалитььСделку.Следующий() Цикл
		СтрокиДляИзменения = СчетОбъект.ДокументыОснования.НайтиСтроки(Новый Структура("Документ", ВыборкаУдалитььСделку.Документ));
		Для Каждого СтрокаДляИзменения Из СтрокиДляИзменения Цикл
			СтрокаДляИзменения.Сделка = Неопределено;
		КонецЦикла;
		НеобходимаЗапись = Истина;
	КонецЦикла;
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0403303, 19-06-2025, конец
	
	Возврат НеобходимаЗапись;
	
КонецФункции
//)
//МальцевАН #77303 20.05.2024 

//Евросиб СубботинВ #89675 16.08.2024 Начало 
Функция ПолучитьИнформациюВалютыПлатежа(ДоговорКонтрагента) Экспорт 
	
	Ответ = Новый Структура("МультивалютныйДоговор, ВалютаОплаты, ВалютаВзаиморасчетов", Ложь, Справочники.Валюты.ПустаяСсылка());
	
	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда		
		ИнформацияПоДоговору = Справочники.ДоговорыКонтрагентов.ПолучитьЗначенияРеквизитовДоговораПоУмолчанию(ДоговорКонтрагента);
		ЗаполнитьЗначенияСвойств(Ответ,ИнформацияПоДоговору);
	КонецЕсли;
	
	Возврат Ответ 
	
КонецФункции
//Евросиб СубботинВ #89675 16.08.2024 Конец

//Евросиб(ДИТ), Беляев СЮ, Ticket#0372241, 01-11-2024, начало (перенес функцию из Формы Сделки)
Функция НайтиСчетНаОплатуПоРеализации(УчДокумент, ИскатьАвансовый = Ложь, Сделка = Неопределено, Параметры = Неопределено) Экспорт

	Счет = Неопределено;	
	Если ЗначениеЗаполнено(УчДокумент) Тогда		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.СчетПокупателю КАК СчетПокупателю,
		|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.СчетаНаОплатуПокупателям КАК РеализацияТоваровУслугСчетаНаОплатуПокупателям
		|ГДЕ
		|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка = &Ссылка
		|
		//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, начало
		//Евросиб Шевченко А.В. US 112687 TA 114390 18.07.2025
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		//|ВЫБРАТЬ
		//|	ОтчетКомитентуОПродажах.СчетНаОплатуПокупателю,
		//|	1
		//|ИЗ
		//|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
		//|ГДЕ
		//|	ОтчетКомитентуОПродажах.Ссылка = &Ссылка
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.СчетПокупателю,
		|	1
		|ИЗ
		|	Документ.ОтчетКомитентуОПродажах.СчетаНаОплатуПокупателям КАК ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям
		|ГДЕ
		|	ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.Ссылка = &Ссылка
		//Евросиб Шевченко А.В. US 112687 TA 114390 18.07.2025
		//Евросиб(ДИТ), Беляев СЮ, US 89710/TA 89712, 27-08-2024, конец
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки УБЫВ";
		
		Запрос.УстановитьПараметр("Ссылка", УчДокумент);	
		Счет = Запрос.Выполнить().Выгрузить()[0].СчетПокупателю;
		//Евросиб СубботинВ #84453 02.07.2024 узнать нужно ли выводить только первый

	ИначеЕсли ИскатьАвансовый Тогда 
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СчетНаОплатуПокупателюТовары.Ссылка КАК Ссылка,
		|	СчетНаОплатуПокупателюТовары.Сумма КАК Сумма,
		|	СчетНаОплатуПокупателюТовары.СтрокаДоходовСделки КАК СтрокаДоходовСделки,
		|	СчетНаОплатуПокупателюТовары.СуммаНДС КАК СуммаНДС,
		|	СчетНаОплатуПокупателюТовары.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС
		|ИЗ
		|	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
		|ГДЕ
		|	СчетНаОплатуПокупателюТовары.Ссылка.Контрагент = &Контрагент
		|	И СчетНаОплатуПокупателюТовары.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
		|	И СчетНаОплатуПокупателюТовары.Ссылка.УдалитьСделка = &Сделка
		|	И СчетНаОплатуПокупателюТовары.Ссылка.АвансовыйСчет = ИСТИНА
		|	И СчетНаОплатуПокупателюТовары.Ссылка.ПометкаУдаления = ЛОЖЬ");	
		Запрос.УстановитьПараметр("Сделка", Сделка);
		Запрос.УстановитьПараметр("Контрагент",Параметры.Клиент);
		Запрос.УстановитьПараметр("ДоговорКонтрагента",Параметры.Договор);
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Счет = Результат.Выгрузить()[0].Ссылка;
		КонецЕсли;
	КонецЕсли;
	Возврат Счет; 
	//Евросиб СубботинВ #84453 02.07.2024 Начало //Поменял запрос на работу только с ТЧ СчетаНаОплатуПокупателям 

КонецФункции
//Евросиб СубботинВ #89675 16.08.2024 Конец

//Евросиб(ДИТ), Беляев СЮ, BUG 109491 / TA 111190, 02-06-2025, начало
Функция ПолучитьОписаниеДляСодержанияПремии(ДокументЗаявкаОснование, Калькуляция, Английский = Ложь) Экспорт
	
	Ответ = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПРЕДСТАВЛЕНИЕ(ЗаявкаСоставУслуги.ПСЦ) КАК ПСЦ,
		|	ПРЕДСТАВЛЕНИЕ(ЗаявкаСоставУслуги.Калькуляция.Суша_ПунктОтправления) КАК КалькуляцияСуша_ПунктОтправления,
		|	ПРЕДСТАВЛЕНИЕ(ЗаявкаСоставУслуги.Калькуляция.Суша_ПунктНазначения) КАК КалькуляцияСуша_ПунктНазначения,
		|	ВЫРАЗИТЬ(ЗаявкаСоставУслуги.Калькуляция.Суша_ПунктОтправления КАК Справочник.Локации).НаименованиеАнгл КАК ПунктОтправленияАнгл,
		|	ВЫРАЗИТЬ(ЗаявкаСоставУслуги.Калькуляция.Суша_ПунктНазначения КАК Справочник.Локации).НаименованиеАнгл КАК ПунктНазначенияАнгл
		|ИЗ
		|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
		|ГДЕ
		|	ЗаявкаСоставУслуги.Ссылка = &Ссылка
		|	И ЗаявкаСоставУслуги.Калькуляция = &Калькуляция";

	Запрос.УстановитьПараметр("Ссылка", ДокументЗаявкаОснование);
	Запрос.УстановитьПараметр("Калькуляция", Калькуляция);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Если Английский Тогда
			//Premium for carriage within China according to the PAP ………….. on the route …………..
			МаршрутСтрока = ?(ЗначениеЗаполнено(Выборка.КалькуляцияСуша_ПунктОтправления) И ЗначениеЗаполнено(Выборка.КалькуляцияСуша_ПунктНазначения), 
									" on the route " + Выборка.ПунктОтправленияАнгл + " - " + Выборка.ПунктНазначенияАнгл, "");
			Ответ = " to the PAP " + Выборка.ПСЦ + МаршрутСтрока;
		Иначе
			МаршрутСтрока = ?(ЗначениеЗаполнено(Выборка.КалькуляцияСуша_ПунктОтправления) И ЗначениеЗаполнено(Выборка.КалькуляцияСуша_ПунктНазначения), 
									" по маршруту " + Выборка.КалькуляцияСуша_ПунктОтправления + " - " + Выборка.КалькуляцияСуша_ПунктНазначения, "");
			Ответ = " согласно " + Выборка.ПСЦ + МаршрутСтрока;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, BUG 109491 / TA 111190, 02-06-2025, конец

//Евросиб(ДИТ), Беляев СЮ, BUG 109491 / TA 111190, 02-06-2025, начало
Функция ПолучитьЗаявкуСчета(СчетСсылка)
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СчетНаОплатуПокупателюДокументыОснования.Документ КАК Документ
		|ИЗ
		|	Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
		|ГДЕ
		|	СчетНаОплатуПокупателюДокументыОснования.Ссылка = &СчетСсылка
		|	И СчетНаОплатуПокупателюДокументыОснования.Документ ССЫЛКА Документ.Заявка";
	
	Запрос.УстановитьПараметр("СчетСсылка", СчетСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Результат = ВыборкаДетальныеЗаписи.Документ
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, BUG 109491 / TA 111190, 02-06-2025, конец

//Евросиб(ДИТ), Беляев СЮ, US 109628 / TA 112362, 18-06-2025, начало
Функция СтрокаРазделителейУчетныхЕдиницВСодержанииУслуи() Экспорт 
	
	Возврат "; ,:" + Символы.ПС + Символы.Таб;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 109628 / TA 112362, 18-06-2025, конец

Функция ЭтоСчетИзРИТМ(СчетСсылка) Экспорт //Евросиб Шевченко А.В. US 114791 TA 115034 25.07.2025
	Если НЕ ЗначениеЗаполнено(СчетСсылка) Тогда
		Возврат ложь;
	КонецЕсли;	
	
	ОтветСтруктура = РегистрыСведений.ПротоколОбменов.ПроверитьВыгрузку(СчетСсылка,Перечисления.УзлыОбмена.РИТМ,Перечисления.ДействияПриОбмене.ЗагрузкаДанных);
	
	Возврат ЗначениеЗаполнено(ОтветСтруктура.Ссылка);
	
КонецФункции	

Процедура ПроверитьНаличиеПроведенныхРеализаций(Ссылка,Отказ = Ложь) Экспорт
	
	Запрос = новый Запрос;
	//Евросиб СубботинВ #84453 02.07.2024 Начало // получение РТУ по счетам
//	Запрос.Текст = "ВЫБРАТЬ
					//// ДИТ US 57674 ТА 79279 Сержантова А.С. Начало: 25.03.2024
					//|	РеализацияТоваровУслуг.Ссылка КАК СсылкаИСФ
					//|ПОМЕСТИТЬ ВТ_РеализацииПоСчету
					//|ИЗ
					//|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
					//|ГДЕ
					//|	РеализацияТоваровУслуг.Проведен
					//|	И РеализацияТоваровУслуг.СчетНаОплатуПокупателю = &Счет
					//|
					//|ОБЪЕДИНИТЬ
					//|
					//|ВЫБРАТЬ
					//|	РеализацияТоваровУслуг.Ссылка
					//|ИЗ
					//|	Документ.РеализацияТоваровУслуг.СчетаНаОплатуПокупателям КАК РеализацияТоваровУслугСчетаНаОплатуПокупателям
					//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
					//|		ПО РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка = РеализацияТоваровУслуг.Ссылка
					//|ГДЕ
					//|	РеализацияТоваровУслуг.Проведен
					//|	И РеализацияТоваровУслугСчетаНаОплатуПокупателям.СчетПокупателю = &Счет
					//|;
					//|
		//Поменял запрос на работу только с ТЧ СчетаНаОплатуПокупателям
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка КАК СсылкаИСФ
					|ПОМЕСТИТЬ ВТ_РеализацииПоСчету
					|ИЗ
					|	Документ.РеализацияТоваровУслуг.СчетаНаОплатуПокупателям КАК РеализацияТоваровУслугСчетаНаОплатуПокупателям
					|ГДЕ
					|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.СчетПокупателю = &Счет
					|	И РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.Проведен
					|
					//Евросиб СубботинВ #112686 02.07.2025 Начало
					////Евросиб(ДИТ), Беляев СЮ, Ticket#0374198, 02-11-2024, начало
					//|ОБЪЕДИНИТЬ
					//|
					//|ВЫБРАТЬ
					//|	ОтчетКомитентуОПродажах.Ссылка
					//|ИЗ
					//|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
					//|ГДЕ
					//|	ОтчетКомитентуОПродажах.Проведен
					//|	И ОтчетКомитентуОПродажах.СчетНаОплатуПокупателю = &Счет
					////Евросиб(ДИТ), Беляев СЮ, Ticket#0374198, 02-11-2024, конец
					//|ОБЪЕДИНИТЬ
					//|
					//|ВЫБРАТЬ РАЗЛИЧНЫЕ
					//|	ОтчетКомитентуОПродажахТовары.Ссылка
					//|ИЗ
					//|	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
					//|ГДЕ
					//|	ОтчетКомитентуОПродажахТовары.Ссылка.Проведен
					//|	И ОтчетКомитентуОПродажахТовары.СчетНаОплатуПокупателю = &Счет
					//Евросиб Шевченко А.В. US 112687 TA 114390 18.07.2025
					|ОБЪЕДИНИТЬ
					|
					|ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.Ссылка
					|ИЗ
					|	Документ.ОтчетКомитентуОПродажах.СчетаНаОплатуПокупателям КАК ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям
					|ГДЕ
					|	ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.Ссылка.Проведен
					|	И ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.СчетПокупателю = &Счет
					//Евросиб Шевченко А.В. US 112687 TA 114390 18.07.2025
					//Евросиб СубботинВ #112686 02.07.2025 Конец 
					|;
					|
		//Евросиб СубботинВ #84453 02.07.2024 Конец
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	КорректировкаРеализации.ИсправляемыйДокументРеализации КАК ИсправляемыйДокументРеализации,
					|	КорректировкаРеализации.Ссылка КАК Ссылка
					|ПОМЕСТИТЬ ВТ_КорректировкиКРеализациям
					|ИЗ
					|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РеализацииПоСчету КАК ВТ_РеализацииПоСчету
					|		ПО (ВТ_РеализацииПоСчету.СсылкаИСФ = КорректировкаРеализации.ИсправляемыйДокументРеализации)
					|ГДЕ
					|	КорректировкаРеализации.ВидОперации = &ВидОперацииАннулирование
					|	И КорректировкаРеализации.Проведен
					|
					|ОБЪЕДИНИТЬ
					|
					|ВЫБРАТЬ
					|	ВТ_РеализацииПоСчету.СсылкаИСФ,
					|	ИсторияКорректировокРеализацийСрезПоследних.Регистратор
					|ИЗ
					|	РегистрСведений.ИсторияКорректировокРеализаций.СрезПоследних(
					|			,
					|			ПервичныйДокумент В
					|				(ВЫБРАТЬ
					|					Т.СсылкаИСФ
					|				ИЗ
					|					ВТ_РеализацииПоСчету КАК Т)) КАК ИсторияКорректировокРеализацийСрезПоследних
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РеализацииПоСчету КАК ВТ_РеализацииПоСчету
					|		ПО (ИсторияКорректировокРеализацийСрезПоследних.ПервичныйДокумент = ВТ_РеализацииПоСчету.СсылкаИСФ)
					|ГДЕ
					|	ИсторияКорректировокРеализацийСрезПоследних.ВидОперации = &ВидОперацииАннулирование
					|;
	               	|
	               	|////////////////////////////////////////////////////////////////////////////////
				   //|ВЫБРАТЬ
				   //// ДИТ US 57674 ТА 79279 Сержантова А.С. Конец: 25.03.2024
				   //|	РеализацияТоваровУслуг.Ссылка КАК СсылкаИСФ
				   //|ИЗ
				   //|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
				   //|ГДЕ
				   //|	РеализацияТоваровУслуг.Проведен
				   //|	И РеализацияТоваровУслуг.СчетНаОплатуПокупателю = &Счет     
				   //// ДИТ US 57674 ТА 79279 Сержантова А.С. Начало: 25.03.2024
				   //|	И НЕ РеализацияТоваровУслуг.Ссылка В
				   //|		(ВЫБРАТЬ
				   //|			Т.ИсправляемыйДокументРеализации
				   //|		ИЗ
				   //|			ВТ_КорректировкиКРеализациям КАК Т)
				   //// ДИТ US 57674 ТА 79279 Сержантова А.С. Конец: 25.03.2024
				   
		 //Евросиб СубботинВ #84453 02.07.2024 Начало // Поменял запрос на работу только с ТЧ СчетаНаОплатуПокупателям
		 		   |ВЫБРАТЬ
	               |	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка КАК СсылкаИСФ
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.СчетаНаОплатуПокупателям КАК РеализацияТоваровУслугСчетаНаОплатуПокупателям
	               |ГДЕ
	               |	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.Проведен
	               |	И РеализацияТоваровУслугСчетаНаОплатуПокупателям.СчетПокупателю = &Счет     
				   |	И НЕ РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка В
				   |		(ВЫБРАТЬ
				   |			Т.ИсправляемыйДокументРеализации
				   |		ИЗ
				   |			ВТ_КорректировкиКРеализациям КАК Т)
		 //Евросиб СубботинВ #84453 02.07.2024 Конец 
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
				   //Евросиб СубботинВ #112686 02.07.2025 Начало
				   //|
				   //|ВЫБРАТЬ
				   //|	ОтчетКомитентуОПродажах.Ссылка
				   //|ИЗ
				   //|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
				   //|ГДЕ
				   //|	ОтчетКомитентуОПродажах.Проведен
				   //|	И ОтчетКомитентуОПродажах.СчетНаОплатуПокупателю = &Счет
				   // //Евросиб(ДИТ), Беляев СЮ, Ticket#0374198, 02-11-2024, начало	
				   | 
				   //Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
				   |ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	ОтчетКомитентуОПродажахТовары.Ссылка
				   |ИЗ
				   |	Документ.ОтчетКомитентуОПродажах.СчетаНаОплатуПокупателям КАК ОтчетКомитентуОПродажахТовары
				   |ГДЕ
				   |	ОтчетКомитентуОПродажахТовары.Ссылка.Проведен
				   |	И ОтчетКомитентуОПродажахТовары.СчетПокупателю = &Счет
					//Евросиб СубботинВ #112686 02.07.2025 Конец
				   |	И НЕ ОтчетКомитентуОПродажахТовары.Ссылка В
				   |		(ВЫБРАТЬ
				   |			Т.ИсправляемыйДокументРеализации
				   |		ИЗ
				   |			ВТ_КорректировкиКРеализациям КАК Т)";
                   //Евросиб Шевченко А.В. US 112685 TA 114398 22.07.2025
				   //Евросиб(ДИТ), Беляев СЮ, Ticket#0374198, 02-11-2024, конец
	Запрос.УстановитьПараметр("Счет", Ссылка);  
	// ДИТ US 57674 ТА 79279 Сержантова А.С. Начало: 25.03.2024
	Запрос.УстановитьПараметр("ВидОперацииАннулирование", Перечисления.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование);   
	// ДИТ US 57674 ТА 79279 Сержантова А.С. Конец: 25.03.2024
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		СписокРТУ = "";
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокРТУ = СписокРТУ + Выборка.СсылкаИСФ + "
			|";
		КонецЦикла;
		ОбщегоНазначения.СообщитьПользователю("Счет нельзя отменить, т.к. к нему есть проведенные реализации: " + СписокРТУ,,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры	

Процедура ПроверитьНаличиеПроведенныхКорРту(Ссылка,Отказ = Ложь) Экспорт //Евросиб Шевченко А.В. US 112687 TA 120184 22.10.2025
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КорректировкаРеализацииСчетаНаОплатуПокупателям.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.КорректировкаРеализации.СчетаНаОплатуПокупателям КАК КорректировкаРеализацииСчетаНаОплатуПокупателям
		|ГДЕ
		|	КорректировкаРеализацииСчетаНаОплатуПокупателям.Ссылка.Проведен
		|	И КорректировкаРеализацииСчетаНаОплатуПокупателям.СчетПокупателю = &СчетПокупателю";	
	
	Запрос.УстановитьПараметр("СчетПокупателю", Ссылка);  
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		СписокКорРТУ = "";
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокКорРТУ = СписокКорРТУ + Выборка.Ссылка + "
			|";
		КонецЦикла;
		ОбщегоНазначения.СообщитьПользователю("Счет нельзя отменить, т.к. к нему есть проведенные корректировок реализации: " + СписокКорРТУ,,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьНаличиеПроведенныхОК(Ссылка,Отказ = Ложь) Экспорт //Евросиб Шевченко А.В. US 112685 05.11.2025
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОтчетКомитентуОПродажах.СчетаНаОплатуПокупателям КАК ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям
		|ГДЕ
		|	ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.Ссылка.Проведен
		|	И ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.СчетПокупателю = &СчетПокупателю";	
	
	Запрос.УстановитьПараметр("СчетПокупателю", Ссылка);  
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		СписокОК = "";
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокОК = СписокОК + Выборка.Ссылка + "
			|";
		КонецЦикла;
		ОбщегоНазначения.СообщитьПользователю("Счет нельзя отменить, т.к. к нему есть проведенные Отчет комитенту: " + СписокОК,,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Каблов 14.08.2025 #111016
Функция ПолучитьТаблицуСвязанныхРеализаций(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.Дата КАК Дата,
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.Номер КАК Номер
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.СчетаНаОплатуПокупателям КАК РеализацияТоваровУслугСчетаНаОплатуПокупателям
	|ГДЕ
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.СчетПокупателю = &СчетПокупателю
	|	И РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	Запрос.УстановитьПараметр("СчетПокупателю", Ссылка);
	ТаблицаРеализаций = Запрос.Выполнить().Выгрузить();
				
	Возврат ТаблицаРеализаций;
			
КонецФункции

Функция ПроверитьНоменклатуруДляУдаленияСчета(мНоменкалтура) Экспорт
	НоменклатураДляПроверки = Новый Массив;
	НоменклатураДляПроверки.Добавить(Справочники.Номенклатура.ТЭУ);
	НоменклатураДляПроверки.Добавить(Справочники.Номенклатура.Фрахт);
	НоменклатураДляПроверки.Добавить(Справочники.Номенклатура.ПредоставлениеКТК);
	НоменклатураДляПроверки.Добавить(Справочники.Номенклатура.ПредоставлениеПлатформ);
	
	Для Каждого СтрНом Из мНоменкалтура Цикл
		Если НоменклатураДляПроверки.Найти(СтрНом) <> Неопределено Тогда
			Возврат Истина;
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат Ложь;
	
КонецФункции	
