&НаКлиенте
Перем ВопросЗадан; // ДИТ US 74929 ТА 74933 Сержантова А.С. 05.10.2023
 
&НаКлиенте
Процедура ОпределитьКоординаты(Команда)
	
	ОткрытьФорму("Справочник.Локации.Форма.ПодборМестоположения", Новый Структура("НазваниеМеста, ЭтаФормаГУИД", Объект.Наименование, Строка(ЭтаФорма.УникальныйИдентификатор)));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыбраныКоординаты" И Источник = Строка(ЭтаФорма.УникальныйИдентификатор) Тогда
		
		Объект.Широта = Параметр.Широта;
		Объект.Долгота = Параметр.Долгота;
		Объект.Адрес = Параметр.Адрес;
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.НадписьИерархияЭлемента.Заголовок = Справочники.Локации.ПолучитьТекстИерархииЭлемента(Объект.Ссылка);
	КонецЕсли;
	Аналоги.Параметры.УстановитьЗначениеПараметра("Л1", Объект.Ссылка);
	РасстоянияМеждуЛокациями.Параметры.УстановитьЗначениеПараметра("Локация", Объект.Ссылка);
	
	Если Параметры.Свойство("НовыйСток") тогда
		Объект.Родитель = Параметры.Родитель;
		Объект.Тип = Справочники.ТипыЛокаций.Сток;
	КонецЕсли;
	
	// Евросиб Фролов (06.12.2021 Task №42618
	// СтандартныеПодсистемы.КонтактнаяИнформация
    ДополнительныеПараметры = УправлениеКонтактнойИнформацией.ПараметрыКонтактнойИнформации();
    ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаКонтактнаяИнформация");
    УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, Объект, ДополнительныеПараметры);
    // Конец СтандартныеПодсистемы.КонтактнаяИнформация
	// Евросиб Фролов)
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )
	//Евросиб - АСуслов 02.02.2023 9:32:16 #64514
	//(                          
	РаботаСДМРазрешена = Пользователи.РолиДоступны("ПолныеПрава, dc_РаботаСДетскийМир");
	Если РаботаСДМРазрешена Тогда
		КонтрагентДетскийМир = Константы.КонтрагентДетскийМир.Получить();
		РаботаСДМРазрешена = ЗначениеЗаполнено(КонтрагентДетскийМир);
	КонецЕсли;
	Элементы.ГруппаКодДетскийМир.Видимость = РаботаСДМРазрешена;
	//)
	//Евросиб - АСуслов 02.02.2023 9:32:18 #64514
	//Евросиб - АСуслов 03.07.2023 15:09:18 #67519
	//(
	ЭлементОтбора = ГоризонтальныеСвязиЛокаций.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Если Объект.Тип = Справочники.ТипыЛокаций.СтанцияЖД Тогда
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЖДСтанция");
	ИначеЕсли Объект.Тип = Справочники.ТипыЛокаций.Терминал Тогда	
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Терминал"); 
		//Евросиб Коханенко Н.А. 27.05.2025 (( #106848
		Элементы.КластерНаселенногоПунктаДляЧистогоСтока.Видимость = Истина;
		//Евросиб Коханенко Н.А. 27.05.2025 )) #106848 
	ИначеЕсли Объект.Тип = Справочники.ТипыЛокаций.Порт Тогда	
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Порт"); 
	Иначе
		Элементы.ГруппаГоризонтальныеСвязиЛокаций.Видимость = Ложь;
	КонецЕсли;
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;   
	//)
	//Евросиб - АСуслов 03.07.2023 15:09:46 #67519 
	ПользовательСПолнымиПравами = РольДоступна("ПолныеПрава");
	
	//ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
	Элементы.НаименованиеКИТ.Доступность = ПользовательСПолнымиПравами;
	//ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
	
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Евросиб Фролов (06.12.2021 Task №42618
	// СтандартныеПодсистемы.КонтактнаяИнформация
    УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
    // Конец СтандартныеПодсистемы.КонтактнаяИнформация
	// Евросиб Фролов) 
	//Евросиб - АСуслов 02.02.2023 10:15:57 #64514
	//(
	КодДетскийМир = РегистрыСведений.ПротоколОбменов.ПолучитьЗначенияЗаписей(Перечисления.ДействияПриОбмене.ВыгрузкаДанных, Перечисления.УзлыОбмена.ДМ, ТекущийОбъект.Ссылка, 0).УИДИсточника;
	//)
	//Евросиб - АСуслов 02.02.2023 10:15:59 #64514
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Евросиб US 90359  TA 91563 Рыбьяков К.А. 30.10.2024 (( закомментировал
	//Если Не ЗначениеЗаполнено(Объект.Родитель) Тогда
	//	ОбщегоНазначенияКлиент.СообщитьПользователю("Нужно заполнить родителя.",,"Объект.Родитель",,Отказ); 
	//КонецЕсли; 
	// Евросиб Рыбьяков К.А. 30.10.2024 ))
	Если Не ЗначениеЗаполнено(Объект.Страна) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нужно заполнить родителя.",,"Объект.Страна",,Отказ); 
	КонецЕсли; 
//Евросиб Гудкова( 01.06.2021 Ticket№ 
	Если Объект.Недоступен и Не ЗначениеЗаполнено(Объект.НедоступенС) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нужно заполнить дату начала недоступности.",,"Объект.НедоступенС",,Отказ); 
	КонецЕсли; 
// Евросиб Гудкова) 	

	//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, начало  
	Если Объект.EDIОбменСТерминалами и Не ЗначениеЗаполнено(Объект.EmailОбменаСТерминалами) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нужно заполнить электронный адрес обмена с Терминалами.",,"Объект.EmailОбменаСТерминалами",,Отказ); 
	КонецЕсли; 	
	//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, конец    
	//Евросиб - АСуслов 15.05.2023 12:48:45 #67494
	//(
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка)
		И Не ПользовательСПолнымиПравами
		И Объект.Тип = ПредопределенноеЗначение("Справочник.ТипыЛокаций.СтанцияЖД") Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Запрещен ручной ввод локаций с типом «жд станция». Воспользуйтесь обработкой «Загрузка железных дорог, локаций»");
	КонецЕсли;
	//)
	//Евросиб - АСуслов 15.05.2023 12:48:46 #67494 
	
	// ДИТ US 74929 ТА 74933 Сержантова А.С. Начало: 05.10.2023
	Если не ВопросЗадан и Объект.Тип = ПредопределенноеЗначение("Справочник.ТипыЛокаций.Терминал") 
		и не КодCodecoУникален() Тогда
		Отказ = Истина;
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗаписьюЗавершение", ЭтаФорма,),
					"Установленное представление в Codeco или синонимы представлений содержатся в карточке другой локации! 
					|Вы уверены, что хотите записать не уникальное значение кода Codeco?", РежимДиалогаВопрос.ДаНет); 
	КонецЕсли;
	// ДИТ US 74929 ТА 74933 Сержантова А.С. Конец: 05.10.2023
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Евросиб Фролов (06.12.2021 Task №42618
	// СтандартныеПодсистемы.КонтактнаяИнформация
    УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
    // Конец СтандартныеПодсистемы.КонтактнаяИнформация
	// Евросиб Фролов)
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// Евросиб Фролов (06.12.2021 Task №42618
	// СтандартныеПодсистемы.КонтактнаяИнформация
    УправлениеКонтактнойИнформацией.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект);
    // Конец СтандартныеПодсистемы.КонтактнаяИнформация
	// Евросиб Фролов)
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// Евросиб Фролов (06.12.2021 Task №42618
	// СтандартныеПодсистемы.КонтактнаяИнформация
    УправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Объект, Отказ);
    // Конец СтандартныеПодсистемы.КонтактнаяИнформация
	// Евросиб Фролов)
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьОтображение();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображение()
	
	Элементы.ГруппаЖД.Видимость = Ложь;
	//Евросиб - АСуслов 01.06.2023 13:08:53 #67492
	//(
	Элементы.ГруппаРегион.Видимость = Ложь;
	//)
	//Евросиб - АСуслов 01.06.2023 13:08:55 #67492
	Элементы.ГруппаПорт.Видимость = Ложь;
	Элементы.ГруппаТерминал.Видимость = Ложь;
	Элементы.ГруппаСток.Видимость = Ложь;
	Элементы.ГруппаЖДСтанции.Видимость = Ложь;
	Элементы.ГруппаРасстояния.Видимость = Ложь;
	Элементы.ГруппаНедоступности.Видимость = Истина;
	
	Если Объект.Тип = ПредопределенноеЗначение("Справочник.ТипыЛокаций.СтанцияЖД") Тогда
		Элементы.ГруппаЖД.Видимость = Истина;
		Элементы.ГруппаРасстояния.Видимость = Истина;
	ИначеЕсли Объект.Тип = ПредопределенноеЗначение("Справочник.ТипыЛокаций.Порт") Тогда
		Элементы.ГруппаПорт.Видимость = Истина;
		// ДИТ Поморцва Т.П. Задача 0234798 15.06.21. начало
		//Евросиб - АСуслов 04.07.2023 12:54:34 #локации 67519
		//(
		//Элементы.ГруппаЖДСтанции.Видимость = Истина;
		//)
		//Евросиб - АСуслов 04.07.2023 12:54:37 #локации
		// ДИТ Поморцва Т.П. Задача 0234798 15.06.21. конец
	ИначеЕсли Объект.Тип = ПредопределенноеЗначение("Справочник.ТипыЛокаций.Сток") Тогда
		Элементы.ГруппаСток.Видимость = Истина;
		//Евросиб - АСуслов 04.07.2023 12:54:34 #локации 67519
		//(
		//Элементы.ГруппаЖДСтанции.Видимость = Истина;
		//)
		//Евросиб - АСуслов 04.07.2023 12:54:37 #локации
	ИначеЕсли Объект.Тип = ПредопределенноеЗначение("Справочник.ТипыЛокаций.Терминал") Тогда
		Элементы.ГруппаТерминал.Видимость = Истина;
		// МальцевАН 83034 01.04.2024
		//(
		ЗначенияКвот = ЗаполнитьЗначенияКвот(Объект.Ссылка);
		КвотаГруженые = ЗначенияКвот.КвотаГруженые;
		КвотаПорожние = ЗначенияКвот.КвотаПорожние;
		
		//) 
		//МальцевАН 83034 01.04.2024
		// ДИТ Поморцва Т.П. Задача 0234798 15.06.21. начало
		//Евросиб - АСуслов 04.07.2023 12:54:34 #локации 67519
		//(
		//Элементы.ГруппаЖДСтанции.Видимость = Истина;
		//)
		//Евросиб - АСуслов 04.07.2023 12:54:37 #локации
		// ДИТ Поморцва Т.П. Задача 0234798 15.06.21. конец
	//Евросиб - АСуслов 01.06.2023 13:09:24 #67492
	//(
	ИначеЕсли Объект.Тип = ПредопределенноеЗначение("Справочник.ТипыЛокаций.Регион") Тогда
		Элементы.ГруппаРегион.Видимость = Истина;
	//)
	//Евросиб - АСуслов 01.06.2023 13:09:27 #67492
	Иначе
		Элементы.ГруппаНедоступности.Видимость = Ложь;
	КонецЕсли; 
	
	// Евросиб Фролов (06.12.2021 Task №42618
	//ДИТ Шевченко А.В. US 62515 ТА 69139 25.04.2023 -Начало
	МассивВидимостиКонтактов = Новый Массив;
	МассивВидимостиКонтактов.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Терминал"));
	МассивВидимостиКонтактов.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.СтанцияЖД"));
	МассивВидимостиКонтактов.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.Порт"));
	Элементы.ГруппаКонтактнаяИнформация.Видимость = МассивВидимостиКонтактов.Найти(Объект.Тип) <> Неопределено;
	//ДИТ Шевченко А.В. US 62515 ТА 69139 25.04.2023 -Конец
	//Элементы.ГруппаКонтактнаяИнформация.Видимость = Объект.Тип = ПредопределенноеЗначение("Справочник.ТипыЛокаций.Терминал");
	// Евросиб Фролов)
	
	//ДИТ, Беляев СЮ, ТА69423, 01-06-2023, начало (закомментировано, перенесено в УправлениеДоступностьюCodeco())
	//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, начало
	//Элементы.EmailОбменаСТерминалами.Доступность = Объект.EDIОбменСТерминалами;
	//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, конец      
	
	//ДИТ Шевченко А.В. 51341 27.09.2022 -начало	
	//Элементы.ОбрабатыватьОтветыEDIОтТерминала.Доступность = Объект.EDIОбменСТерминалами И ЗначениеЗаполнено(Объект.EmailОбменаСТерминалами);
	//Элементы.ГруппаEDIОбменаСТерминалами.Доступность = Объект.Тип = ПредопределенноеЗначение("Справочник.ТипыЛокаций.Терминал");
	//ДИТ Шевченко А.В. 51341 27.09.2022 -конец
	
	//ДИТ Авдеева В.С. 51020 10.06.2022 Начало                  
	//ЭтоТерминал = Объект.Тип = ПредопределенноеЗначение("Справочник.ТипыЛокаций.Терминал");
	//Элементы.ТипПодрядчика.Видимость = ЭтоТерминал;
	//Элементы.РучнаяЗагрузкаСтоков.Видимость = ЭтоТерминал;
	//ДИТ Авдеева В.С. 51020 10.06.2022 Конец
	//ДИТ, Беляев СЮ, ТА69423, 01-06-2023, конец (закомментировано, перенесено в УправлениеДоступностьюCodeco())
	
	// ДИТ BUG 67625 TA 67944 Евсенкин М.А. Начало: 27.04.2023
	УправлениеДоступностьюCodeco();	
	// ДИТ BUG 67625 TA 67944 Евсенкин М.А. Конец: 27.04.2023
	
КонецПроцедуры

// МальцевАН 83034 01.04.2024
//(
&НаСервереБезКонтекста
Функция ЗаполнитьЗначенияКвот(Ссылка)
	СтруктураКвоты = Новый Структура("КвотаПорожние, КвотаГруженые", "Не согласовано", "Не согласовано");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КвотыХраненияКТКНаТерминалах.КвотаГруженые КАК КвотаГруженые,
		|	КвотыХраненияКТКНаТерминалах.КвотаПорожние КАК КвотаПорожние
		|ИЗ
		|	РегистрСведений.КвотыХраненияКТКНаТерминалах КАК КвотыХраненияКТКНаТерминалах
		|ГДЕ
		|	КвотыХраненияКТКНаТерминалах.Терминал = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ТаблицаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
		СтруктураКвоты.Вставить("КвотаПорожние", ?(ТаблицаДетальныеЗаписи[0].КвотаПорожние = -1, "Не согласовано", ТаблицаДетальныеЗаписи[0].КвотаПорожние));
		СтруктураКвоты.Вставить("КвотаГруженые", ?(ТаблицаДетальныеЗаписи[0].КвотаГруженые = -1, "Не согласовано", ТаблицаДетальныеЗаписи[0].КвотаГруженые));
	КонецЕсли;
	Возврат СтруктураКвоты;	
КонецФункции
//)

// ДИТ BUG 67625 TA 67944 Евсенкин М.А. Начало: 27.04.2023
&НаКлиенте
Процедура УправлениеДоступностьюCodeco()
	Если Объект.Тип = ПредопределенноеЗначение("Справочник.ТипыЛокаций.Терминал") Тогда  
		//Если Не Объект.РучнаяЗагрузкаСтоков
		//	И Не Объект.ИспользоватьПредставлениеВCodeco Тогда
		//	Элементы.РучнаяЗагрузкаСтоков.ТолькоПросмотр = Ложь;
		//	Элементы.ИспользоватьПредставлениеВCodeco.ТолькоПросмотр = Ложь;
		//	Элементы.ПредставлениеВCodeco.Доступность = Ложь;
		//ИначеЕсли Не Объект.РучнаяЗагрузкаСтоков
		//	И Объект.ИспользоватьПредставлениеВCodeco Тогда
		//	Элементы.РучнаяЗагрузкаСтоков.ТолькоПросмотр = Истина;
		//	Элементы.ИспользоватьПредставлениеВCodeco.ТолькоПросмотр = Ложь;
		//	Элементы.ПредставлениеВCodeco.Доступность = Истина; 
		//ИначеЕсли Объект.РучнаяЗагрузкаСтоков
		//	И Не Объект.ИспользоватьПредставлениеВCodeco Тогда
		//	Элементы.РучнаяЗагрузкаСтоков.ТолькоПросмотр = Ложь;
		//	Элементы.ИспользоватьПредставлениеВCodeco.ТолькоПросмотр = Истина;
		//	Элементы.ПредставлениеВCodeco.Доступность = Ложь;
		//КонецЕсли;
		//ДИТ, Беляев СЮ, ТА69423, 01-06-2023, начало
		Элементы.ГруппаCodeco.Доступность = Ложь;
		Элементы.ГруппаПолейРучнойЗагрузкиСтоков.Доступность = Ложь;
		Если Объект.EDIОбменСТерминалами Тогда
			Элементы.ГруппаCodeco.Доступность = Истина;
			Элементы.ОбрабатыватьОтветыEDIОтТерминала.Доступность = ЗначениеЗаполнено(Объект.EmailОбменаСТерминалами);
		ИначеЕсли Объект.РучнаяЗагрузкаСтоков Тогда 
			Элементы.ГруппаПолейРучнойЗагрузкиСтоков.Доступность = Истина;
		КонецЕсли;
		//ДИТ, Беляев СЮ, ТА69423, 01-06-2023, конец
	КонецЕсли;	
КонецПроцедуры
// ДИТ BUG 67625 TA 67944 Евсенкин М.А. Конец: 27.04.2023


&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	
	//Евросиб - АСуслов 17.08.2021 12:46:24 #
	//(
	//т.к. эти поля скрываются для не жд станций, то очистим их
	ТипЖД = ПредопределенноеЗначение("Справочник.ТипыЛокаций.СтанцияЖД");
	Если НЕ Объект.Тип = ТипЖД Тогда
		Объект.КодЖДСтанции = "";
		Объект.ЖелезнаяДорога = Неопределено;
		Объект.Погранпереход = Ложь;
	КонецЕсли; 
	//)
	//Евросиб - АСуслов 17.08.2021 12:46:34 # 
	
	//Евросиб Коханенко Н.А. 13.11.2024 (( #94615 
	ТипТерминал = ПредопределенноеЗначение("Справочник.ТипыЛокаций.Терминал"); 
	ТипПорт = ПредопределенноеЗначение("Справочник.ТипыЛокаций.Порт"); 
	Если Объект.Тип <> ТипДоИзменения Тогда //если значение изменилось
		//Евросиб Коханенко Н.А. 03.01.2025 (( #99349 
		//Если ТипДоИзменения = ТипТерминал Тогда
		
		//Евросиб Коханенко Н.А. 27.05.2025 (( #106848 
		Если Объект.Тип = ТипТерминал Тогда
			Элементы.КластерНаселенногоПунктаДляЧистогоСтока.Видимость = Истина;
		Иначе
			Элементы.КластерНаселенногоПунктаДляЧистогоСтока.Видимость = Ложь;
		КонецЕсли;
		//Евросиб Коханенко Н.А. 27.05.2025 )) #106848 
		
		Если Объект.Тип = ТипТерминал 
				ИЛИ Объект.Тип = ТипПорт Тогда //очистим поля, которые относятся к терминалу и порту	
		//Евросиб Коханенко Н.А. 03.01.2025 )) #99349 	
			Объект.НаТерминалеИспользуютсяУслугиВнСебестоимости = Ложь;
			Объект.Контрагент = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
			КвотаПорожние = "";
			КвотаГруженые = "";
			Объект.EDIОбменСТерминалами = Ложь;
			Объект.ПредставлениеВCodeco = "";
			Объект.EmailОбменаСТерминалами = "";
			Объект.XmlВерсияРелизаКлиента = Неопределено;
			Объект.ОбрабатыватьОтветыEDIОтТерминала = Ложь;
			Объект.РучнаяЗагрузкаСтоков = Ложь;
			Объект.ТипПодрядчика = Неопределено; 
		//Евросиб Коханенко Н.А. 03.01.2025 (( #99349 
		//ИначеЕсли ТипДоИзменения = ТипПорт Тогда //очистим поля, которые относятся только к порту   
		//Евросиб Коханенко Н.А. 03.01.2025 )) #99349 	
			Объект.КодПортаUNLOCODE = ""; 
			Объект.КодПорта = ""; 
			Объект.ИдентификаторMAERSK = ""; 
			Объект.ИспользованиеПортаВКалькуляции = Неопределено; 
			Объект.ИспользуетсяВМаршрутизации = Ложь;
		КонецЕсли;
	КонецЕсли;
	//Евросиб Коханенко Н.А. 13.11.2024 )) #94615 
	
	ОбновитьОтображение();  
	
	//ДИТ, Беляев СЮ, ТА69423, 01-06-2023, начало (закомментировано, перенесено в УправлениеДоступностьюCodeco()) 
	//ДИТ Авдеева В.С. 51020 10.06.2022 Начало                  
	//ЭтоТерминал = Объект.Тип = ПредопределенноеЗначение("Справочник.ТипыЛокаций.Терминал");
	//Если Не ЭтоТерминал Тогда 
	//	Объект.ТипПодрядчика = Неопределено;
	//КонецЕсли;
	//ДИТ Авдеева В.С. 51020 10.06.2022 Конец
	//ДИТ, Беляев СЮ, ТА69423, 01-06-2023, конец (закомментировано, перенесено в УправлениеДоступностьюCodeco())
	
КонецПроцедуры

//Евросиб Гудкова( 18.05.2021 Ticket№ 0232519
&НаКлиенте
Процедура НедоступенПриИзменении(Элемент)
	
	Если Объект.Недоступен = Ложь Тогда
		Объект.НедоступенС = Неопределено;
		Объект.НедоступенПо = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры
// Евросиб Гудкова) 

// Евросиб Фролов (06.12.2021 Task №42618
// СтандартныеПодсистемы.КонтактнаяИнформация
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
        УправлениеКонтактнойИнформациейКлиент.ПриИзменении(ЭтотОбъект, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриНажатии(Элемент, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.Очистка(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
    УправлениеКонтактнойИнформациейКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент.Имя, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОбновитьКонтактнуюИнформацию(Результат)
    УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, Результат);
КонецПроцедуры

//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, начало
&НаКлиенте
Процедура EDIОбменСТерминаламиПриИзменении(Элемент)
	//ДИТ, Беляев СЮ, ТА69423, 01-06-2023, начало
	Если Объект.EDIОбменСТерминалами Тогда
		Объект.РучнаяЗагрузкаСтоков = ЛОЖЬ;
	КонецЕсли;
	//ДИТ, Беляев СЮ, ТА69423, 01-06-2023, конец
	ОбновитьОтображение();
КонецПроцедуры  

&НаКлиенте
Процедура EmailОбменаСТерминаламиПриИзменении(Элемент) //ДИТ Шевченко А.В. 51340 17.10.2022
	ОбновитьОтображение();
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  

//Евросиб - АСуслов 02.02.2023 9:31:52 #64514
//(
&НаКлиенте
Асинх Процедура ИзменитьКодДетскийМир(Команда)
	КодДетскийМир = Ждать ВвестиСтрокуАсинх(КодДетскийМир);
	ЗаписатьДанныеДМНаСервере(КодДетскийМир, Объект.Ссылка);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьДанныеДМНаСервере(КодДетскийМир, Номенклатура)
	РегистрыСведений.ПротоколОбменов.ЗаписатьУИДИсточника(КодДетскийМир, Перечисления.ДействияПриОбмене.ВыгрузкаДанных, Перечисления.УзлыОбмена.ДМ, Номенклатура, 0);		
КонецПроцедуры

&НаКлиенте
Процедура АдресНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//Евросиб - АСуслов 27.06.2023 13:45:45 #локации
	//(
	СтандартнаяОбработка = Ложь;
	//ТипыЛокаций = Новый Массив;
	//ТипыЛокаций.Добавить(ПредопределенноеЗначение("Справочник.ТипыЛокаций.АдресВНаселенномПункте"));
	//ОткрытьФорму("Справочник.Локации.ФормаВыбора", Новый Структура("МножественныйВыбор, ПоказыватьВыборАдреса, Отбор", Ложь, Истина, Новый Структура("Тип", ТипыЛокаций)),Элемент,ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Режим", "СозданиеСВыборомНаселенногоПункта");
	//ПараметрыОткрытияФормы.Вставить("Локация", Элементы.Список.ТекущаяСтрока);
	ПараметрыОткрытияФормы.Вставить("Локация", Неопределено);
	ПараметрыОткрытияФормы.Вставить("АдресВЛокации", ДанныеВыбора);
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораАдресаПоГеокодеруЯндекс", ПараметрыОткрытияФормы,Элемент);
	//)
	//Евросиб - АСуслов 27.06.2023 13:45:47 #локации
КонецПроцедуры
//)
//Евросиб - АСуслов 02.02.2023 9:31:54 #64514
//ДИТ, Беляев СЮ, ТА49361, 30-03-2022, конец

// Конец СтандартныеПодсистемы.КонтактнаяИнформация
// Евросиб Фролов)

// ДИТ BUG 67625 TA 67944 Евсенкин М.А. Начало: 27.04.2023
&НаКлиенте
Процедура РучнаяЗагрузкаСтоковПриИзменении(Элемент)
	//ДИТ, Беляев СЮ, ТА69423, 01-06-2023, начало
	Если Объект.РучнаяЗагрузкаСтоков Тогда
		Объект.EDIОбменСТерминалами = ЛОЖЬ;
	КонецЕсли;
	//ДИТ, Беляев СЮ, ТА69423, 01-06-2023, конец
	ОбновитьОтображение();
КонецПроцедуры


&НаКлиенте
Процедура ГоризонтальныеСвязиЛокацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	текД = Элементы.ГоризонтальныеСвязиЛокаций.ТекущиеДанные;
	СтруктураЗаписи = Новый Структура("ЖДСтанция, Терминал, Порт", текД.ЖДСтанция, текД.Терминал, текД.Порт);
	МассивСтруктураЗаписи = Новый Массив;
	МассивСтруктураЗаписи.Добавить(СтруктураЗаписи);
	КлючЗаписи = Новый ("РегистрСведенийКлючЗаписи.ГоризонтальныеСвязиЛокаций", МассивСтруктураЗаписи);
	
	Если Объект.Тип = ПредопределенноеЗначение("Справочник.ТипыЛокаций.СтанцияЖД") Тогда
		ЗаблокированноеПоле = "ЖДСтанция";	
	ИначеЕсли Объект.Тип = ПредопределенноеЗначение("Справочник.ТипыЛокаций.Терминал") Тогда
		ЗаблокированноеПоле = "Терминал";	
	ИначеЕсли Объект.Тип = ПредопределенноеЗначение("Справочник.ТипыЛокаций.Порт") Тогда
		ЗаблокированноеПоле = "Порт";	
	КонецЕсли;
	Параметрыформы = Новый Структура("Ключ, ЗаблокированноеПоле", КлючЗаписи, ЗаблокированноеПоле);                            
	ОткрытьФорму("РегистрСведений.ГоризонтальныеСвязиЛокаций.ФормаЗаписи", Параметрыформы);
КонецПроцедуры
// ДИТ BUG 67625 TA 67944 Евсенкин М.А. Конец: 27.04.2023

// ДИТ US 74929 ТА 74933 Сержантова А.С. 05.10.2023
&НаКлиенте
Процедура СписокПредставленийCodecoНажатие(Элемент)
	ПредставленияCodeco = ПолучитьМассивПредставлений(); 
	ПараметрыОткрытия = Новый Структура("ПредставленияCodeco, ЗаголовокФормы", ПредставленияCodeco, "Список синонимов представлений в Codeco");
	Оповещение = Новый ОписаниеОповещения("ПриИзмененииПредставленийCodeco", ЭтаФорма); 
	
	ОткрытьФорму("ОбщаяФорма.ФормаВводаСпискаЗначений", 
		ПараметрыОткрытия, ЭтаФорма, , , ,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры  

// ДИТ US 74929 ТА 74933 Сержантова А.С. 05.10.2023
&НаСервере
Функция ПолучитьМассивПредставлений()
	ПредставленияCodeco = Объект.СписокПредставлений.Выгрузить().ВыгрузитьКолонку("Представление");
	Возврат ПредставленияCodeco;
КонецФункции  

// ДИТ US 74929 ТА 74933 Сержантова А.С. 05.10.2023
&НаКлиенте
Процедура ПриИзмененииПредставленийCodeco(Результат, ДопПараметры) Экспорт    
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		ЗаполнитьПредставленияCodeco(Результат);
	КонецЕсли;
КонецПроцедуры

// ДИТ US 74929 ТА 74933 Сержантова А.С. 05.10.2023
&НаСервере
Процедура ЗаполнитьПредставленияCodeco(ПредставленияCodeco)
	Объект.СписокПредставлений.Очистить();
	Для каждого Представление Из ПредставленияCodeco Цикл
		НС = Объект.СписокПредставлений.Добавить();
		НС.Представление = Представление;
	КонецЦикла;    
	Если не ЗначениеЗаполнено(Объект.ПредставлениеВCodeco) и ПредставленияCodeco.Количество() Тогда
		Объект.ПредставлениеВCodeco = ПредставленияCodeco[0];
	КонецЕсли;
КонецПроцедуры  

// ДИТ US 74929 ТА 74933 Сержантова А.С. 05.10.2023
&НаСервере
Функция КодCodecoУникален()   
	
	ПредставленияВCodeco = Объект.СписокПредставлений.Выгрузить().ВыгрузитьКолонку("Представление"); 
	ПредставленияВCodeco.Добавить(Объект.ПредставлениеВCodeco);
	Взаимодействия.УдалитьПовторяющиесяЭлементыМассива(ПредставленияВCodeco);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Локации.Ссылка КАК ДругойТерминал
		|ИЗ
		|	Справочник.Локации КАК Локации
		|ГДЕ
		|	Локации.Ссылка <> &ТекущаяСсылка
		|	И Локации.Тип = &ТипТерминал
		|	И Локации.ПредставлениеВCodeco В (&ПредставленияВCodeco)
		|	И Локации.ПредставлениеВCodeco <> """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛокацииСписокПредставлений.Ссылка
		|ИЗ
		|	Справочник.Локации.СписокПредставлений КАК ЛокацииСписокПредставлений
		|ГДЕ
		|	ЛокацииСписокПредставлений.Ссылка <> &ТекущаяСсылка
		|	И ЛокацииСписокПредставлений.Ссылка.Тип = &ТипТерминал
		|	И ЛокацииСписокПредставлений.Представление В (&ПредставленияВCodeco)
		|	И ЛокацииСписокПредставлений.Представление <> """"";
	
	Запрос.УстановитьПараметр("ПредставленияВCodeco", ПредставленияВCodeco);
	Запрос.УстановитьПараметр("ТекущаяСсылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ТипТерминал", Справочники.ТипыЛокаций.Терминал);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	КонецЕсли; 
	
	Возврат Ложь;
	
КонецФункции 

// ДИТ US 74929 ТА 74933 Сержантова А.С. 05.10.2023
&НаКлиенте
Процедура ПередЗаписьюЗавершение(РезультатВопроса, ПараметрыЗаписи) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ВопросЗадан = Истина;
		ЭтаФорма.Записать();
	КонецЕсли;
КонецПроцедуры

//Евросиб Коханенко Н.А. 13.11.2024 (( #94615 
&НаКлиенте
Процедура ТипНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ТипДоИзменения = Объект.Тип;
КонецПроцедуры //Евросиб Коханенко Н.А. 13.11.2024 )) #94615

ВопросЗадан = Ложь; // ДИТ US 74929 ТА 74933 Сержантова А.С. 05.10.2023
