#Область Сделка

Процедура Сделка_СформироватьДвиженияДоходыРасходы(ОбъектСделка) Экспорт
	Сделка_СформироватьДвиженияПлановыеДоходыВО(ОбъектСделка);
	Сделка_СформироватьДвиженияПлановыеРасходыВО(ОбъектСделка);
	Сделка_СформироватьДвиженияПлановыеРасходыУУ(ОбъектСделка);
	
	//Евросиб Каблов 06.11.2025 ( #107942
	Сделка_СформироватьДвиженияПлановыеРасходыВОПолныйФакт(ОбъектСделка);
	//Евросиб Каблов 06.11.2025 ) #107942
	
	//Субботин 74442 11.09.2023 начало
	//Сделка_СформироватьДвиженияДанныеПоОтправлениям(ОбъектСделка);
	Сделка_ДобавитьВОчередьСформироватьДвиженияДанныеПоОтправлениям(ОбъектСделка.ссылка);
	//Субботин 74442 11.09.2023 конец 
КонецПроцедуры

//Сделка. Плановые расходы ВО.
Процедура Сделка_СформироватьДвиженияПлановыеРасходыВО(ОбъектСделка) Экспорт
	
	//ОбъектСделка.Движения.ПлановыеРасходыВО.Записывать = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = Сделка_ПолучитьТекстЗапросаПлановыеРасходы("ВО");
	Сделка_УстановитьПараметрыЗапросаПлановыеРасходы(Запрос, ОбъектСделка);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ОбъектСделка.Движения.ПлановыеРасходыВО.Загрузить(РезультатЗапроса.Выгрузить());
		//Евросиб Каблов 17.03.2026 ( #126784
		//ОбъектСделка.Движения.ПлановыеРасходыВО.Записать();
		//Евросиб Каблов 17.03.2026 ) #126784
	КонецЕсли; 
	//Евросиб Каблов 17.03.2026 ( #126784
	ОбъектСделка.Движения.ПлановыеРасходыВО.Записать();
	//Евросиб Каблов 17.03.2026 ) #126784
	
КонецПроцедуры

//Сделка. Плановые расходы УУ.
Процедура Сделка_СформироватьДвиженияПлановыеРасходыУУ(ОбъектСделка) Экспорт
	
	//ОбъектСделка.Движения.ПлановыеРасходыУУ.Записывать = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = Сделка_ПолучитьТекстЗапросаПлановыеРасходы("УУ");
	Сделка_УстановитьПараметрыЗапросаПлановыеРасходы(Запрос, ОбъектСделка);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ОбъектСделка.Движения.ПлановыеРасходыУУ.Загрузить(РезультатЗапроса.Выгрузить());
		//Евросиб Каблов 17.03.2026 ( #126784
		//ОбъектСделка.Движения.ПлановыеРасходыУУ.Записать();
		//Евросиб Каблов 17.03.2026 ) #126784
	КонецЕсли;
	//Евросиб Каблов 17.03.2026 ( #126784
	ОбъектСделка.Движения.ПлановыеРасходыУУ.Записать();
	//Евросиб Каблов 17.03.2026 ) #126784
	
КонецПроцедуры

//Сделка. ТекстЗапроса плановых расходов.
Функция Сделка_ПолучитьТекстЗапросаПлановыеРасходы(ВидУчета)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СделкаДоходы.УчДокумент ЕСТЬ NULL
	|				ИЛИ СделкаДоходы.УчДокумент = НЕОПРЕДЕЛЕНО
	|				ИЛИ СделкаДоходы.Ссылка ЕСТЬ NULL
	|			ТОГДА ДАТАВРЕМЯ(3999, 1, 1)
	//Евросиб - АСуслов 18.01.2022 10:58:39 #
	//(
	//|		ИНАЧЕ СделкаРасходы.ПериодВО
	|  		ИНАЧЕ СделкаДоходы.ПериодВО
	//)
	//Евросиб - АСуслов 18.01.2022 10:58:40 #
	|	КОНЕЦ КАК Период,
	|   СделкаДоходы.ДатаОказанияУслуги КАК ДатаОказанияУслуги,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	СделкаРасходы.Ссылка.Организация КАК Организация,
	|	СделкаРасходы.Ссылка КАК Сделка,
	|	СделкаРасходы.Ссылка.ЦФО КАК ЦФО,
	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК ИдентификаторСУЕ,
	|	СделкаРасходы.Поставщик КАК Поставщик,
	|	СделкаРасходы.Договор КАК Договор,
	|	СделкаРасходы.Услуга КАК Услуга,
	|	СделкаРасходы.Валюта КАК Валюта,
	|	СделкаРасходы.Вагон КАК Вагон,
	|	СделкаРасходы.Контейнер КАК Контейнер,
	|	СделкаРасходы.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ВЫБОР
	|		КОГДА СделкаРасходы.Перевыставляемая
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРасходов.Возмещаемые)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыРасходов.Себестоимость)
	|	КОНЕЦ КАК ТипОперации,
	|	СделкаРасходы.СуммаИтого КАК Сумма,
	|	СделкаРасходы.СуммаНДС КАК СуммаНДС,
	|	СделкаРасходы.СтавкаНДС КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА НЕ(СделкаДоходы.УчДокумент ЕСТЬ NULL
	|					ИЛИ СделкаДоходы.УчДокумент = НЕОПРЕДЕЛЕНО)
	|			ТОГДА СделкаДоходы.УчДокумент.ДатаДокумента
	|		КОГДА НЕ СделкаДоходы.ДатаОказанияУслуги ЕСТЬ NULL
	|			ТОГДА СделкаДоходы.ДатаОказанияУслуги
	|		ИНАЧЕ СделкаРасходы.Калькуляция.ДатаКурса
	|	КОНЕЦ КАК ДатаКурса,
	|	СделкаРасходы.ГУИД КАК ГУИД,
	|	ВЫБОР
	|		КОГДА СделкаРасходы.ОтнестиНаЗатраты
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидОперацииРасходов.СобственныеЗатраты)
	|		КОГДА СделкаРасходы.ВнутренняяСебестоимость
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидОперацииРасходов.ВнутренняяСебестоимость)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидОперацииРасходов.ПрямыеРасходы)
	|	КОНЕЦ КАК ВидОперации,
	|	ВЫБОР
	|		КОГДА СделкаРасходы.ИсточникПоявленияСтрокиЭкономики В (ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ПорожняяЖДН), ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДНПерестановкиВагонов))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПлановыеРасходыПоЖДН,
	|	СделкаДоходы.Клиент КАК Клиент,
	|	СделкаДоходы.Договор КАК ДоговорКлиента,
	|	СделкаДоходы.УчДокумент КАК УчДокумент
	|ПОМЕСТИТЬ ИсходныеДанные
	|ИЗ
	|	Документ.Сделка.Расходы КАК СделкаРасходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
	|			ПО СделкаСвязьДоходовИРасходов.Ссылка = СделкаДоходы.Ссылка
	|				И СделкаСвязьДоходовИРасходов.Доходы = СделкаДоходы.ГУИД
	|		ПО СделкаРасходы.Ссылка = СделкаСвязьДоходовИРасходов.Ссылка
	|			И СделкаРасходы.ГУИД = СделкаСвязьДоходовИРасходов.Расходы
	|ГДЕ
	|	СделкаРасходы.Ссылка = &Ссылка
	|	И НЕ СделкаРасходы.УслугаОтключена
	|	И СделкаРасходы.СуммаИтого > 0
	|	И НЕ СделкаРасходы.НеВключатьВПлановыеРасходы
	//Евросиб Каблов 27.06.2024 ( #87513	
	//|	И (СделкаРасходы.ИсточникПоявленияСтрокиЭкономики В (ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ОсновнаяУслугаАвтоматически), ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ПорожняяЖДН), ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДНПерестановкиВагонов))
	//|			ИЛИ (СделкаРасходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ДопУслугаАвтоматически)
	//|				И СделкаРасходы.Услуга = &УслугаФрахт)
	|	И (СделкаРасходы.ИсточникПоявленияСтрокиЭкономики В (ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ОсновнаяУслугаАвтоматически), ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ПорожняяЖДН), ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДНПерестановкиВагонов), ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ФрахтИзКалькуляции))
	//Евросиб Каблов 27.06.2024 )
	|			ИЛИ СделкаРасходы.ВнутренняяСебестоимость)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(КурсыВалют.Период) КАК Период,
	|	КурсыВалют.Валюта КАК Валюта,
	|	ИсходныеДанные.ДатаКурса КАК ДатаКурса,
	|	ИсходныеДанные.Валюта КАК Валюта1
	|ПОМЕСТИТЬ ВТ_Курсы
	|ИЗ
	|	ИсходныеДанные КАК ИсходныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО ИсходныеДанные.ДатаКурса >= КурсыВалют.Период
	|			И ИсходныеДанные.Валюта = КурсыВалют.Валюта
	|
	|СГРУППИРОВАТЬ ПО
	|	КурсыВалют.Валюта,
	|	ИсходныеДанные.ДатаКурса,
	|	ИсходныеДанные.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ИсходныеДанные.Период, МЕСЯЦ) КАК Период, 
	|	ИсходныеДанные.ДатаОказанияУслуги КАК ДатаОказанияУслуги, 
	|	ИсходныеДанные.ВидДвижения КАК ВидДвижения,
	|	ИсходныеДанные.Организация КАК Организация,
	|	ИсходныеДанные.Сделка КАК Сделка,
	|	ИсходныеДанные.ЦФО КАК ЦФО,
	|	ИсходныеДанные.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ИсходныеДанные.Поставщик КАК Поставщик,
	|	ИсходныеДанные.Договор КАК Договор,
	|	ИсходныеДанные.Услуга КАК Услуга,
	|	ИсходныеДанные.Валюта КАК Валюта,
	|	ИсходныеДанные.Вагон КАК Вагон,
	|	ИсходныеДанные.Контейнер КАК Контейнер,
	|	ИсходныеДанные.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ИсходныеДанные.ТипОперации КАК ТипОперации,
	|	ИсходныеДанные.Сумма КАК Сумма,
	|	ИсходныеДанные.СуммаНДС КАК СуммаНДС,
	|	ИсходныеДанные.СтавкаНДС КАК СтавкаНДС,
	|	ИсходныеДанные.ДатаКурса КАК ДатаКурса,
	|	КурсыВалют.Курс КАК КурсВалюты,
	|	КурсыВалют.Кратность КАК КратностьВалюты,
	|	ИсходныеДанные.ДатаКурса КАК ДатаКурсаВалюты,
	|	ИсходныеДанные.Сумма * ЕСТЬNULL(КурсыВалют.Курс, 1) / ЕСТЬNULL(КурсыВалют.Кратность, 1) КАК СуммаРуб,
	|	ИсходныеДанные.СуммаНДС * ЕСТЬNULL(КурсыВалют.Курс, 1) / ЕСТЬNULL(КурсыВалют.Кратность, 1) КАК СуммаНДСРуб,
	|	ИсходныеДанные.ГУИД КАК ИдентификаторСтрокиРасходов,
	|	ИсходныеДанные.ВидОперации КАК ВидОперации,
	|	ИсходныеДанные.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	ИсходныеДанные.Клиент КАК Клиент,
	|	ИсходныеДанные.ДоговорКлиента КАК ДоговорКлиента,
	|	ИсходныеДанные.УчДокумент КАК Реализация
	|ИЗ
	|	ИсходныеДанные КАК ИсходныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Курсы КАК ВТ_Курсы
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|			ПО ВТ_Курсы.Период = КурсыВалют.Период
	|				И ВТ_Курсы.Валюта = КурсыВалют.Валюта
	|		ПО ИсходныеДанные.ДатаКурса = ВТ_Курсы.ДатаКурса
	|			И ИсходныеДанные.Валюта = ВТ_Курсы.Валюта";
	Если ВидУчета = "УУ" Тогда
		//ВРЕМЕННО ДЛЯ АД (исправить период уу)                
		//Евросиб - АСуслов 18.01.2022 10:59:39 #
		//(
		//ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СделкаРасходы.ПериодВО", "ВЫБОР КОГДА СделкаРасходы.ПериодУУ = ДатаВремя(1,1,1) ИЛИ СделкаРасходы.ПериодУУ > СделкаРасходы.ПериодВО ТОГДА СделкаРасходы.ПериодВО ИНАЧЕ СделкаРасходы.ПериодУУ КОНЕЦ");
		//Евросиб - АСуслов 29.04.2022 13:06:39 #
		//(
		//ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СделкаДоходы.ПериодВО", "ВЫБОР КОГДА СделкаРасходы.ПериодУУ = ДатаВремя(1,1,1) ИЛИ СделкаРасходы.ПериодУУ > СделкаДоходы.ПериодВО ТОГДА СделкаДоходы.ПериодВО ИНАЧЕ СделкаРасходы.ПериодУУ КОНЕЦ");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СделкаДоходы.ПериодВО", "СделкаДоходы.ДатаОказанияУслуги");
		//)
		//Евросиб - АСуслов 29.04.2022 13:06:40 #
		//)
		//Евросиб - АСуслов 18.01.2022 10:59:39 #
	КонецЕсли; 
 	Возврат ТекстЗапроса;
	
КонецФункции

Процедура Сделка_УстановитьПараметрыЗапросаПлановыеРасходы(Запрос, ОбъектСделка)
	
	Запрос.УстановитьПараметр("Ссылка", ОбъектСделка.Ссылка);
	//Евросиб Каблов 09.04.2025 ( #105407 Не используется
	//Запрос.УстановитьПараметр("Период", КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(ОбъектСделка.Организация)); 
	//Евросиб Каблов 09.04.2025 )
	Запрос.УстановитьПараметр("УслугаФрахт", Константы.УслугаФрахтаДляКалькуляции.Получить());
	
КонецПроцедуры 

//Евросиб Каблов 06.11.2025 #107942
Процедура Сделка_СформироватьДвиженияПлановыеРасходыВОПолныйФакт(ОбъектСделка) Экспорт
	
	//ОбъектСделка.Движения.ПлановыеРасходыВО.Записывать = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = Сделка_ПолучитьТекстЗапросаПлановыеРасходыПолныйФакт("ВО");
	Сделка_УстановитьПараметрыЗапросаПлановыеРасходыПолныйФакт(Запрос, ОбъектСделка);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ОбъектСделка.Движения.ПлановыеРасходыВОПолныйФакт.Загрузить(РезультатЗапроса.Выгрузить());
	КонецЕсли;
	ОбъектСделка.Движения.ПлановыеРасходыВОПолныйФакт.Записать();
	
КонецПроцедуры

//Евросиб Каблов 06.11.2025 #107942
Функция Сделка_ПолучитьТекстЗапросаПлановыеРасходыПолныйФакт(ВидУчета)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СделкаДоходы.ПериодВО КАК Период,
	|   СделкаДоходы.ДатаОказанияУслуги КАК ДатаОказанияУслуги,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	СделкаРасходы.Ссылка.Организация КАК Организация,
	|	СделкаРасходы.Ссылка КАК Сделка,
	|	СделкаРасходы.Ссылка.ЦФО КАК ЦФО,
	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК ИдентификаторСУЕ,
	|	СделкаРасходы.Поставщик КАК Поставщик,
	|	СделкаРасходы.Договор КАК Договор,
	|	СделкаРасходы.Услуга КАК Услуга,
	|	СделкаРасходы.Валюта КАК Валюта,
	|	СделкаРасходы.Вагон КАК Вагон,
	|	СделкаРасходы.Контейнер КАК Контейнер,
	|	СделкаРасходы.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ВЫБОР
	|		КОГДА СделкаРасходы.Перевыставляемая
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРасходов.Возмещаемые)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыРасходов.Себестоимость)
	|	КОНЕЦ КАК ТипОперации,
	|	СделкаРасходы.СуммаИтого КАК Сумма,
	|	СделкаРасходы.СуммаНДС КАК СуммаНДС,
	|	СделкаРасходы.СтавкаНДС КАК СтавкаНДС,
	|	СделкаДоходы.УчДокумент.ДатаДокумента КАК ДатаКурса,
	|	СделкаРасходы.ГУИД КАК ГУИД,
	|	ВЫБОР
	|		КОГДА СделкаРасходы.ОтнестиНаЗатраты
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидОперацииРасходов.СобственныеЗатраты)
	|		КОГДА СделкаРасходы.ВнутренняяСебестоимость
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидОперацииРасходов.ВнутренняяСебестоимость)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидОперацииРасходов.ПрямыеРасходы)
	|	КОНЕЦ КАК ВидОперации,
	|	ВЫБОР
	// + ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДН)
	|		КОГДА СделкаРасходы.ИсточникПоявленияСтрокиЭкономики В (ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ПорожняяЖДН), ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДНПерестановкиВагонов), ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДН))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПлановыеРасходыПоЖДН,
	|	СделкаДоходы.Клиент КАК Клиент,
	|	СделкаДоходы.Договор КАК ДоговорКлиента,
	|	СделкаДоходы.УчДокумент КАК УчДокумент,
	//Евросиб Каблов 05.03.2026 ( #126776
	|	ВЫБОР
	|		КОГДА СделкаРасходы.ИсточникПоявленияСтрокиЭкономики = &ИсточникПоявленияСтрокиЭкономикиЖДН
	|				И НЕ СделкаРасходы.ТранспортныйДокумент.НакладнаяЭТРАН.ПлательщикКод В(&КодыПлательщика)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИсключатьИзУФД
	//Евросиб Каблов 05.03.2026 )
	|ПОМЕСТИТЬ ИсходныеДанные
	|ИЗ
	|	Документ.Сделка.Расходы КАК СделкаРасходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
	|			ПО СделкаСвязьДоходовИРасходов.Ссылка = СделкаДоходы.Ссылка
	|				И СделкаСвязьДоходовИРасходов.Доходы = СделкаДоходы.ГУИД
	|		ПО СделкаРасходы.Ссылка = СделкаСвязьДоходовИРасходов.Ссылка
	|			И СделкаРасходы.ГУИД = СделкаСвязьДоходовИРасходов.Расходы
	|ГДЕ
	|	СделкаРасходы.Ссылка = &Ссылка
	|	И НЕ СделкаРасходы.УслугаОтключена
	|	И СделкаРасходы.СуммаИтого > 0
	|	И НЕ СделкаРасходы.НеВключатьВПлановыеРасходы
	|	И НЕ СделкаДоходы.УчДокумент.Ссылка ЕСТЬ NULL
	|	И ЕСТЬNULL(СделкаДоходы.УчДокумент.Проведен, ЛОЖЬ)	
	|	И (СделкаРасходы.ИсточникПоявленияСтрокиЭкономики В (ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ОсновнаяУслугаАвтоматически), ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ПорожняяЖДН), ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДНПерестановкиВагонов), ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ФрахтИзКалькуляции))
	// + ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДН) с Даты начала учета плановых расходов (полный факт)
	|			ИЛИ СделкаРасходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ЖДН)
	|				И ВЫБОР
	|					КОГДА СделкаДоходы.УчДокумент.Ссылка ЕСТЬ NULL
	|							ИЛИ СделкаДоходы.УчДокумент = НЕОПРЕДЕЛЕНО
	|							ИЛИ СделкаДоходы.Ссылка ЕСТЬ NULL
	|						ТОГДА &ПустаяДата
	|					ИНАЧЕ СделкаДоходы.ПериодВО
	|				КОНЕЦ >= &ДатаНачалаУчетаПлановыхРасходовПолныйФакт
	|			ИЛИ СделкаРасходы.ВнутренняяСебестоимость)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(КурсыВалют.Период) КАК Период,
	|	КурсыВалют.Валюта КАК Валюта,
	|	ИсходныеДанные.ДатаКурса КАК ДатаКурса,
	|	ИсходныеДанные.Валюта КАК Валюта1
	|ПОМЕСТИТЬ ВТ_Курсы
	|ИЗ
	|	ИсходныеДанные КАК ИсходныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО ИсходныеДанные.ДатаКурса >= КурсыВалют.Период
	|			И ИсходныеДанные.Валюта = КурсыВалют.Валюта
	|
	|СГРУППИРОВАТЬ ПО
	|	КурсыВалют.Валюта,
	|	ИсходныеДанные.ДатаКурса,
	|	ИсходныеДанные.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ИсходныеДанные.Период, МЕСЯЦ) КАК Период, 
	|	ИсходныеДанные.ДатаОказанияУслуги КАК ДатаОказанияУслуги, 
	|	ИсходныеДанные.ВидДвижения КАК ВидДвижения,
	|	ИсходныеДанные.Организация КАК Организация,
	|	ИсходныеДанные.Сделка КАК Сделка,
	|	ИсходныеДанные.ЦФО КАК ЦФО,
	|	ИсходныеДанные.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ИсходныеДанные.Поставщик КАК Поставщик,
	|	ИсходныеДанные.Договор КАК Договор,
	|	ИсходныеДанные.Услуга КАК Услуга,
	|	ИсходныеДанные.Валюта КАК Валюта,
	|	ИсходныеДанные.Вагон КАК Вагон,
	|	ИсходныеДанные.Контейнер КАК Контейнер,
	|	ИсходныеДанные.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ИсходныеДанные.ТипОперации КАК ТипОперации,
	|	ИсходныеДанные.Сумма КАК Сумма,
	|	ИсходныеДанные.СуммаНДС КАК СуммаНДС,
	|	ИсходныеДанные.СтавкаНДС КАК СтавкаНДС,
	|	ИсходныеДанные.ДатаКурса КАК ДатаКурса,
	|	КурсыВалют.Курс КАК КурсВалюты,
	|	КурсыВалют.Кратность КАК КратностьВалюты,
	|	ИсходныеДанные.ДатаКурса КАК ДатаКурсаВалюты,
	|	ИсходныеДанные.Сумма * ЕСТЬNULL(КурсыВалют.Курс, 1) / ЕСТЬNULL(КурсыВалют.Кратность, 1) КАК СуммаРуб,
	|	ИсходныеДанные.СуммаНДС * ЕСТЬNULL(КурсыВалют.Курс, 1) / ЕСТЬNULL(КурсыВалют.Кратность, 1) КАК СуммаНДСРуб,
	|	ИсходныеДанные.ГУИД КАК ИдентификаторСтрокиРасходов,
	|	ИсходныеДанные.ВидОперации КАК ВидОперации,
	|	ИсходныеДанные.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	ИсходныеДанные.Клиент КАК Клиент,
	|	ИсходныеДанные.ДоговорКлиента КАК ДоговорКлиента,
	|	ИсходныеДанные.УчДокумент КАК Реализация,
	//Евросиб Каблов 05.03.2026 ( #126776
	|	ИсходныеДанные.ИсключатьИзУФД КАК ИсключатьИзУФД
	//Евросиб Каблов 05.03.2026 )
	|ИЗ
	|	ИсходныеДанные КАК ИсходныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Курсы КАК ВТ_Курсы
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|			ПО ВТ_Курсы.Период = КурсыВалют.Период
	|				И ВТ_Курсы.Валюта = КурсыВалют.Валюта
	|		ПО ИсходныеДанные.ДатаКурса = ВТ_Курсы.ДатаКурса
	|			И ИсходныеДанные.Валюта = ВТ_Курсы.Валюта";
	
	Если ВидУчета = "УУ" Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СделкаДоходы.ПериодВО", "СделкаДоходы.ДатаОказанияУслуги");
		
	КонецЕсли;
	
 	Возврат ТекстЗапроса;
	
КонецФункции

//Евросиб Каблов 06.11.2025 #107942
Процедура Сделка_УстановитьПараметрыЗапросаПлановыеРасходыПолныйФакт(Запрос, ОбъектСделка)
	
	Запрос.УстановитьПараметр("Ссылка", ОбъектСделка.Ссылка);
	Запрос.УстановитьПараметр("УслугаФрахт", Константы.УслугаФрахтаДляКалькуляции.Получить());
	Запрос.УстановитьПараметр("ДатаНачалаУчетаПлановыхРасходовПолныйФакт", Константы.ДатаНачалаУчетаПлановыхРасходовПолныйФакт.Получить());
	//Евросиб Каблов 05.03.2026 ( #126776
	Запрос.УстановитьПараметр("ИсточникПоявленияСтрокиЭкономикиЖДН", Перечисления.ИсточникПоявленияСтрокиЭкономики.ЖДН);
	//Запрос.УстановитьПараметр("КодПлательщика", "1000082317"); //Константа?
	КодыПлательщикаСтрокой = РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ПолучитьАналитикуДокумента(ОбъектСделка.Организация, ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.КодыПлательщикаДляУчетаПлановыхРасходовВУФД);
	Если ЗначениеЗаполнено(КодыПлательщикаСтрокой) Тогда
		КодыПлательщика = СтрРазделить(КодыПлательщикаСтрокой, ",", Ложь);
		Для Инд = 0 По КодыПлательщика.Количество() - 1 Цикл
			КодыПлательщика[Инд] = СокрЛП(КодыПлательщика[Инд]);
		КонецЦикла;
	Иначе
		КодыПлательщика = Новый Массив;
	КонецЕсли;
	Запрос.УстановитьПараметр("КодыПлательщика", КодыПлательщика);
	//Евросиб Каблов 05.03.2026 ) #126776
	ПустаяДата = '00010101';
	Запрос.УстановитьПараметр("ПустаяДата", ПустаяДата);
	
КонецПроцедуры

//Евросиб Каблов 27.10.2021
//Сделка. Данные по отправлениям.
Процедура УдалитьСделка_СформироватьДвиженияДанныеПоОтправлениям(ОбъектСделка) Экспорт
	
	//Субботин 74442 11.09.2023 Начало
//	ОбъектСделка.Движения.ДанныеПоОтправлениям.Записывать = Истина;
	//Субботин 74442 11.09.2023 Конец

	Запрос = Новый Запрос;
	Запрос.Текст = Сделка_ПолучитьТекстЗапросаДанныеПоОтправлениям();
	Сделка_УстановитьПараметрыЗапросаДанныеПоОтправлениям(Запрос, ОбъектСделка);
	
	//Евросиб Каблов 17.03.2023 (
	//ВремяНачалаЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	//Евросиб Каблов 17.03.2023 )
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//Субботин 74442 11.09.2023 Начало
	//Если НЕ РезультатЗапроса.Пустой() Тогда
		
		
	//	ОбъектСделка.Движения.ДанныеПоОтправлениям.Загрузить(РезультатЗапроса.Выгрузить());
	//КонецЕсли;
	

	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		НаборЗаписей = РегистрыСведений.ДанныеПоОтправлениям.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ОбъектСделка);
		
		Движения = РезультатЗапроса.Выгрузить();
		НаборЗаписей.Загрузить(Движения);
		НаборЗаписей.Записать();
	КонецЕсли;
		
	//Евросиб Каблов 17.03.2023 (
	//ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Сделка.Номер) + "/" + Формат(Сделка.Дата, "ДФ=yyyy")
	//Комментарий = СтрШаблон("Сделка %1/%2 Вес = кол-во строк ""Данные по отправлениям""", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ОбъектСделка.Номер), Формат(ОбъектСделка.Дата, "ДФ=yyyy"));
	//ОценкаПроизводительности.ЗакончитьЗамерВремени("ВыполнениеЗапросаДанныеПоОтправлениям",ВремяНачалаЗамера, , Комментарий);
	//Евросиб Каблов 17.03.2023 ) 
	//Субботин 74442 11.09.2023 Конец

	
КонецПроцедуры

//Евросиб Каблов 27.10.2021
Функция Удалить_Сделка_ПолучитьТекстЗапросаДанныеПоОтправлениям()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаДоходы.Ссылка КАК Сделка,
	// Евросиб US 82073 TA 114490 Рыбьяков К.А. 24.07.2025 ((
	//|	РеализацияТоваровУслугРасшифровкаУслугПоТС.УдалитьСтрокаСвязьУчетныхЕдиниц КАК ИдентификаторСУЕ,
	|	РеализацияТоваровУслугРасшифровкаУслугПоТС.КлючАналитикиСоставаПоезда.ИдентификаторКлюча КАК ИдентификаторСУЕ,
	// Евросиб Рыбьяков К.А. 24.07.2025 ))
	|	СделкаДоходы.Услуга КАК Услуга,
	|	СделкаДоходы.Клиент КАК Клиент,
	|	СделкаДоходы.ГУИД КАК Доходы,
	|	НАЧАЛОПЕРИОДА(СделкаДоходы.ПериодВО, МЕСЯЦ) КАК ПериодВО,
	|	РеализацияТоваровУслугРасшифровкаУслугПоТС.Вагон КАК Вагон,
	|	РеализацияТоваровУслугРасшифровкаУслугПоТС.Контейнер КАК Контейнер,
	|	СделкаДоходы.ПСЦ КАК Протокол,
	|	СделкаДоходы.Калькуляция КАК Калькуляция,
	|	СделкаДоходы.Договор.ПравилоФормированияДатыУслуги КАК ПризнакПризнанияВыручки,
	|	СделкаДоходы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СделкаДоходы.ДатаОказанияУслуги КАК ДатаОказанияУслугиКлиенту,
	|	СделкаДоходы.Договор КАК Договор,
	|	СделкаДоходы.Коносамент КАК Коносамент,
	|	СделкаДоходы.ПравилоОпределенияДатыОказанияУслуги КАК ПравилоОпределенияДатыОказанияУслуги,
	|	0 КАК Приоритет,
	|	СделкаДоходы.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ УслугиДоходовСПорядком
	|ИЗ
	|	Документ.Сделка.Доходы КАК СделкаДоходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.РасшифровкаУслугПоТС КАК РеализацияТоваровУслугРасшифровкаУслугПоТС
	|		ПО СделкаДоходы.УчДокумент = РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка
	|			И СделкаДоходы.ГУИД = РеализацияТоваровУслугРасшифровкаУслугПоТС.СтрокаДоходовСделки
	|ГДЕ
	|	СделкаДоходы.Ссылка = &Ссылка
	|	И РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаДоходы.Ссылка,
	// Евросиб US 82073 TA 114490 Рыбьяков К.А. 24.07.2025 ((
	//|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.УдалитьСтрокаСвязьУчетныхЕдиниц,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.КлючАналитикиСоставаПоезда.ИдентификаторКлюча,
	// Евросиб Рыбьяков К.А. 24.07.2025 ))
	|	СделкаДоходы.Услуга,
	|	СделкаДоходы.Клиент,
	|	СделкаДоходы.ГУИД,
	|	НАЧАЛОПЕРИОДА(СделкаДоходы.ПериодВО, МЕСЯЦ),
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Вагон,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Контейнер,
	|	СделкаДоходы.ПСЦ,
	|	СделкаДоходы.Калькуляция,
	|	СделкаДоходы.Договор.ПравилоФормированияДатыУслуги,
	|	СделкаДоходы.ЕдиницаИзмерения,
	|	СделкаДоходы.ДатаОказанияУслуги,
	|	СделкаДоходы.Договор,
	|	СделкаДоходы.Коносамент,
	|	СделкаДоходы.ПравилоОпределенияДатыОказанияУслуги,
	|	1,
	|	СделкаДоходы.НомерСтроки
	|ИЗ
	|	Документ.Сделка.Доходы КАК СделкаДоходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.РасшифровкаУслугПоТС КАК ОтчетКомитентуОПродажахРасшифровкаУслугПоТС
	|		ПО СделкаДоходы.УчДокумент = ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка
	|			И СделкаДоходы.ГУИД = ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СтрокаДоходовСделки
	|ГДЕ
	|	СделкаДоходы.Ссылка = &Ссылка
	|	И ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаДоходы.Ссылка,
	// Евросиб US 82073 TA 114490 Рыбьяков К.А. 24.07.2025 ((
	//|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.УдалитьСтрокаСвязьУчетныхЕдиниц,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.КлючАналитикиСоставаПоезда.ИдентификаторКлюча,
	// Евросиб Рыбьяков К.А. 24.07.2025 ))
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.Вознаграждение),
	|	СделкаДоходы.Клиент,
	|	СделкаДоходы.ГУИД,
	|	НАЧАЛОПЕРИОДА(СделкаДоходы.ПериодВО, МЕСЯЦ),
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Вагон,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Контейнер,
	|	СделкаДоходы.ПСЦ,
	|	СделкаДоходы.Калькуляция,
	|	СделкаДоходы.Договор.ПравилоФормированияДатыУслуги,
	|	СделкаДоходы.ЕдиницаИзмерения,
	|	СделкаДоходы.ДатаОказанияУслуги,
	|	СделкаДоходы.Договор,
	|	СделкаДоходы.Коносамент,
	|	СделкаДоходы.ПравилоОпределенияДатыОказанияУслуги,
	|	1,
	|	СделкаДоходы.НомерСтроки
	|ИЗ
	|	Документ.Сделка.Доходы КАК СделкаДоходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.РасшифровкаУслугПоТС КАК ОтчетКомитентуОПродажахРасшифровкаУслугПоТС
	|		ПО СделкаДоходы.УчДокумент = ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка
	|			И СделкаДоходы.ГУИД = ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СтрокаДоходовСделки
	|ГДЕ
	|	СделкаДоходы.Ссылка = &Ссылка
	|	И СделкаДоходы.Перевыставляемая
	|	И ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаДоходы.Ссылка,
	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц,
	|	СделкаДоходы.Услуга,
	|	СделкаДоходы.Клиент,
	|	СделкаДоходы.ГУИД,
	|	НАЧАЛОПЕРИОДА(СделкаДоходы.ПериодВО, МЕСЯЦ),
	|	ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка),
	|	СделкаДоходы.ПСЦ,
	|	СделкаДоходы.Калькуляция,
	|	СделкаДоходы.Договор.ПравилоФормированияДатыУслуги,
	|	СделкаДоходы.ЕдиницаИзмерения,
	|	СделкаДоходы.ДатаОказанияУслуги,
	|	СделкаДоходы.Договор,
	|	СделкаДоходы.Коносамент,
	|	СделкаДоходы.ПравилоОпределенияДатыОказанияУслуги,
	|	2 + ВЫБОР
	|		КОГДА СделкаСвязьДоходовИРасходов.Услуга = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ 2
	|	КОНЕЦ + ВЫБОР
	|		КОГДА СделкаСвязьДоходовИРасходов.Расходы = """"
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	СделкаДоходы.НомерСтроки
	|ИЗ
	|	Документ.Сделка.Доходы КАК СделкаДоходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|		ПО СделкаДоходы.Ссылка = СделкаСвязьДоходовИРасходов.Ссылка
	|			И СделкаДоходы.ГУИД = СделкаСвязьДоходовИРасходов.Доходы
	|ГДЕ
	|	СделкаДоходы.Ссылка = &Ссылка
	|	И СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц <> """"
	|	И СделкаСвязьДоходовИРасходов.Доходы <> """"
	|	И НЕ ЕСТЬNULL(СделкаДоходы.УчДокумент.Проведен, ЛОЖЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаДоходы.Ссылка,
	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.Вознаграждение),
	|	СделкаДоходы.Клиент,
	|	СделкаДоходы.ГУИД,
	|	НАЧАЛОПЕРИОДА(СделкаДоходы.ПериодВО, МЕСЯЦ),
	|	ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка),
	|	СделкаДоходы.ПСЦ,
	|	СделкаДоходы.Калькуляция,
	|	СделкаДоходы.Договор.ПравилоФормированияДатыУслуги,
	|	СделкаДоходы.ЕдиницаИзмерения,
	|	СделкаДоходы.ДатаОказанияУслуги,
	|	СделкаДоходы.Договор,
	|	СделкаДоходы.Коносамент,
	|	СделкаДоходы.ПравилоОпределенияДатыОказанияУслуги,
	|	2 + ВЫБОР
	|		КОГДА СделкаСвязьДоходовИРасходов.Услуга = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ 2
	|	КОНЕЦ + ВЫБОР
	|		КОГДА СделкаСвязьДоходовИРасходов.Расходы = """"
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	СделкаДоходы.НомерСтроки
	|ИЗ
	|	Документ.Сделка.Доходы КАК СделкаДоходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|		ПО СделкаДоходы.Ссылка = СделкаСвязьДоходовИРасходов.Ссылка
	|			И СделкаДоходы.ГУИД = СделкаСвязьДоходовИРасходов.Доходы
	|ГДЕ
	|	СделкаДоходы.Ссылка = &Ссылка
	|	И СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц <> """"
	|	И СделкаСвязьДоходовИРасходов.Доходы <> """"
	|	И СделкаДоходы.Перевыставляемая
	|	И НЕ ЕСТЬNULL(СделкаДоходы.УчДокумент.Проведен, ЛОЖЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УслугиДоходовСПорядком.Сделка КАК Сделка,
	|	УслугиДоходовСПорядком.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	УслугиДоходовСПорядком.Услуга КАК Услуга,
	|	УслугиДоходовСПорядком.Клиент КАК Клиент,
	|	УслугиДоходовСПорядком.Доходы КАК Доходы,
	|	УслугиДоходовСПорядком.ПериодВО КАК ПериодВО,
	|	УслугиДоходовСПорядком.Вагон КАК Вагон,
	|	УслугиДоходовСПорядком.Контейнер КАК Контейнер,
	|	УслугиДоходовСПорядком.Протокол КАК Протокол,
	|	УслугиДоходовСПорядком.Калькуляция КАК Калькуляция,
	|	УслугиДоходовСПорядком.Договор.ПравилоФормированияДатыУслуги КАК ПризнакПризнанияВыручки,
	|	УслугиДоходовСПорядком.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	УслугиДоходовСПорядком.ДатаОказанияУслугиКлиенту КАК ДатаОказанияУслугиКлиенту,
	|	УслугиДоходовСПорядком.Договор КАК Договор,
	|	УслугиДоходовСПорядком.Коносамент КАК Коносамент,
	|	УслугиДоходовСПорядком.ПравилоОпределенияДатыОказанияУслуги КАК ПравилоОпределенияДатыОказанияУслуги
	|ПОМЕСТИТЬ УслугиДоходов
	|ИЗ
	|	(ВЫБРАТЬ
	|		УслугиДоходовСПорядком.Сделка КАК Сделка,
	|		УслугиДоходовСПорядком.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|		УслугиДоходовСПорядком.Услуга КАК Услуга,
	|		УслугиДоходовСПорядком.Клиент КАК Клиент,
	|		УслугиДоходовСПорядком.ПериодВО КАК ПериодВО,
	|		УслугиДоходовСПорядком.Вагон КАК Вагон,
	|		УслугиДоходовСПорядком.Контейнер КАК Контейнер,
	|		МИНИМУМ(УслугиДоходовСПорядком.НомерСтроки) КАК НомерСтроки
	|	ИЗ
	|		(ВЫБРАТЬ
	|			УслугиДоходовСПорядком.Сделка КАК Сделка,
	|			УслугиДоходовСПорядком.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|			УслугиДоходовСПорядком.Услуга КАК Услуга,
	|			УслугиДоходовСПорядком.Клиент КАК Клиент,
	|			УслугиДоходовСПорядком.ПериодВО КАК ПериодВО,
	|			МИНИМУМ(УслугиДоходовСПорядком.Приоритет) КАК Приоритет,
	|			УслугиДоходовСПорядком.Вагон КАК Вагон,
	|			УслугиДоходовСПорядком.Контейнер КАК Контейнер
	|		ИЗ
	|			УслугиДоходовСПорядком КАК УслугиДоходовСПорядком
	|		
	|		СГРУППИРОВАТЬ ПО
	|			УслугиДоходовСПорядком.ИдентификаторСУЕ,
	|			УслугиДоходовСПорядком.Услуга,
	|			УслугиДоходовСПорядком.Сделка,
	|			УслугиДоходовСПорядком.ПериодВО,
	|			УслугиДоходовСПорядком.Клиент,
	|			УслугиДоходовСПорядком.Вагон,
	|			УслугиДоходовСПорядком.Контейнер) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиДоходовСПорядком КАК УслугиДоходовСПорядком
	|			ПО ВложенныйЗапрос.Сделка = УслугиДоходовСПорядком.Сделка
	|				И ВложенныйЗапрос.ИдентификаторСУЕ = УслугиДоходовСПорядком.ИдентификаторСУЕ
	|				И ВложенныйЗапрос.Услуга = УслугиДоходовСПорядком.Услуга
	|				И ВложенныйЗапрос.Клиент = УслугиДоходовСПорядком.Клиент
	|				И ВложенныйЗапрос.ПериодВО = УслугиДоходовСПорядком.ПериодВО
	|				И ВложенныйЗапрос.Вагон = УслугиДоходовСПорядком.Вагон
	|				И ВложенныйЗапрос.Контейнер = УслугиДоходовСПорядком.Контейнер
	|				И ВложенныйЗапрос.Приоритет = УслугиДоходовСПорядком.Приоритет
	|	
	|	СГРУППИРОВАТЬ ПО
	|		УслугиДоходовСПорядком.ИдентификаторСУЕ,
	|		УслугиДоходовСПорядком.Услуга,
	|		УслугиДоходовСПорядком.Сделка,
	|		УслугиДоходовСПорядком.ПериодВО,
	|		УслугиДоходовСПорядком.Клиент,
	|		УслугиДоходовСПорядком.Вагон,
	|		УслугиДоходовСПорядком.Контейнер) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиДоходовСПорядком КАК УслугиДоходовСПорядком
	|		ПО ВложенныйЗапрос.Сделка = УслугиДоходовСПорядком.Сделка
	|			И ВложенныйЗапрос.ИдентификаторСУЕ = УслугиДоходовСПорядком.ИдентификаторСУЕ
	|			И ВложенныйЗапрос.Услуга = УслугиДоходовСПорядком.Услуга
	|			И ВложенныйЗапрос.ПериодВО = УслугиДоходовСПорядком.ПериодВО
	|			И ВложенныйЗапрос.Клиент = УслугиДоходовСПорядком.Клиент
	|			И ВложенныйЗапрос.Вагон = УслугиДоходовСПорядком.Вагон
	|			И ВложенныйЗапрос.Контейнер = УслугиДоходовСПорядком.Контейнер
	|			И ВложенныйЗапрос.НомерСтроки = УслугиДоходовСПорядком.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УслугиДоходовСПорядком.Сделка КАК Сделка,
	|	УслугиДоходовСПорядком.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	УслугиДоходовСПорядком.Услуга КАК Услуга,
	|	УслугиДоходовСПорядком.Клиент КАК Клиент,
	|	УслугиДоходовСПорядком.Доходы КАК Доходы,
	|	УслугиДоходовСПорядком.ПериодВО КАК ПериодВО,
	|	УслугиДоходовСПорядком.Вагон КАК Вагон,
	|	УслугиДоходовСПорядком.Контейнер КАК Контейнер,
	|	УслугиДоходовСПорядком.Протокол КАК Протокол,
	|	УслугиДоходовСПорядком.Калькуляция КАК Калькуляция,
	|	УслугиДоходовСПорядком.Договор.ПравилоФормированияДатыУслуги КАК ПризнакПризнанияВыручки,
	|	УслугиДоходовСПорядком.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	УслугиДоходовСПорядком.ДатаОказанияУслугиКлиенту КАК ДатаОказанияУслугиКлиенту,
	|	УслугиДоходовСПорядком.Договор КАК Договор,
	|	УслугиДоходовСПорядком.Коносамент КАК Коносамент,
	|	УслугиДоходовСПорядком.ПравилоОпределенияДатыОказанияУслуги КАК ПравилоОпределенияДатыОказанияУслуги
	|ПОМЕСТИТЬ СтрокиДоходовСделки
	|ИЗ
	|	(ВЫБРАТЬ
	|		УслугиДоходовСПорядком.Сделка КАК Сделка,
	|		УслугиДоходовСПорядком.Доходы КАК Доходы,
	|		МИНИМУМ(УслугиДоходовСПорядком.НомерСтроки) КАК НомерСтроки
	|	ИЗ
	|		(ВЫБРАТЬ
	|			УслугиДоходовСПорядком.Сделка КАК Сделка,
	|			УслугиДоходовСПорядком.Доходы КАК Доходы,
	|			МИНИМУМ(УслугиДоходовСПорядком.Приоритет) КАК Приоритет
	|		ИЗ
	|			УслугиДоходовСПорядком КАК УслугиДоходовСПорядком
	|		
	|		СГРУППИРОВАТЬ ПО
	|			УслугиДоходовСПорядком.Сделка,
	|			УслугиДоходовСПорядком.Доходы) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиДоходовСПорядком КАК УслугиДоходовСПорядком
	|			ПО ВложенныйЗапрос.Сделка = УслугиДоходовСПорядком.Сделка
	|				И ВложенныйЗапрос.Приоритет = УслугиДоходовСПорядком.Приоритет
	|				И ВложенныйЗапрос.Доходы = УслугиДоходовСПорядком.Доходы
	|	
	|	СГРУППИРОВАТЬ ПО
	|		УслугиДоходовСПорядком.Сделка,
	|		УслугиДоходовСПорядком.Доходы) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиДоходовСПорядком КАК УслугиДоходовСПорядком
	|		ПО ВложенныйЗапрос.Сделка = УслугиДоходовСПорядком.Сделка
	|			И ВложенныйЗапрос.НомерСтроки = УслугиДоходовСПорядком.НомерСтроки
	|			И ВложенныйЗапрос.Доходы = УслугиДоходовСПорядком.Доходы
	|ГДЕ
	|	УслугиДоходовСПорядком.Услуга <> ЗНАЧЕНИЕ(Справочник.Номенклатура.Вознаграждение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаРасходы.Ссылка КАК Ссылка,
	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
	|	СделкаРасходы.Услуга КАК Услуга,
	|	ЕСТЬNULL(СделкаДоходы.Клиент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Клиент,
	|	СделкаРасходы.ВнутренняяСебестоимость КАК ВнутренняяСебестоимость,
	//|	ВЫБОР
	//|		КОГДА СделкаРасходы.ПериодВО = &ПустаяДата
	//|			ТОГДА &Дата3999
	//|		ИНАЧЕ НАЧАЛОПЕРИОДА(СделкаРасходы.ПериодВО, МЕСЯЦ)
	//|	КОНЕЦ КАК ПериодВО,
	|	ВЫБОР
	|		КОГДА СделкаДоходы.УчДокумент ЕСТЬ NULL
	|				ИЛИ СделкаДоходы.УчДокумент = НЕОПРЕДЕЛЕНО
	|				ИЛИ СделкаДоходы.Ссылка ЕСТЬ NULL
	|			ТОГДА ДАТАВРЕМЯ(3999, 1, 1)
	//Евросиб - АСуслов 18.01.2022 10:58:39 #
	//(
	//|		ИНАЧЕ СделкаРасходы.ПериодВО
	|  		ИНАЧЕ НАЧАЛОПЕРИОДА(СделкаДоходы.ПериодВО, МЕСЯЦ)
	//)
	//Евросиб - АСуслов 18.01.2022 10:58:40 #
	|	КОНЕЦ КАК ПериодВО,
	|	ВЫБОР
	|		КОГДА СделкаДоходы.ГУИД ЕСТЬ NULL
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ + ВЫБОР
	|		КОГДА НЕ СделкаРасходы.ОсновнаяУслугаГруппы
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ + ВЫБОР
	|		КОГДА СделкаРасходы.УслугаОтключена
	|			ТОГДА 2
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПриоритетСтроки,
	|	СделкаРасходы.НомерСтроки КАК НомерСтроки,
	|	СделкаРасходы.Вагон КАК Вагон,
	|	СделкаРасходы.Контейнер КАК Контейнер
	|ПОМЕСТИТЬ РасходыСПриоритетами
	|ИЗ
	|	Документ.Сделка.Расходы КАК СделкаРасходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
	|			ПО СделкаСвязьДоходовИРасходов.Ссылка = СделкаДоходы.Ссылка
	|				И СделкаСвязьДоходовИРасходов.Доходы = СделкаДоходы.ГУИД
	|		ПО СделкаРасходы.Ссылка = СделкаСвязьДоходовИРасходов.Ссылка
	|			И СделкаРасходы.ГУИД = СделкаСвязьДоходовИРасходов.Расходы
	|ГДЕ
	|	СделкаРасходы.Ссылка = &Ссылка
	|	И СделкаРасходы.ГУИД <> """"
	//|	И НЕ (СделкаРасходы.Услуга, СделкаРасходы.СтрокаСвязьУчетныхЕдиниц, НАЧАЛОПЕРИОДА(СделкаРасходы.ПериодВО, МЕСЯЦ), ЕСТЬNULL(СделкаДоходы.Клиент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))) В
	|	И НЕ (СделкаРасходы.Услуга, СделкаРасходы.СтрокаСвязьУчетныхЕдиниц, НАЧАЛОПЕРИОДА(ЕстьNULL(СделкаДоходы.ПериодВО, ДатаВремя(3999,1,1)), МЕСЯЦ), ЕСТЬNULL(СделкаДоходы.Клиент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))) В
	|				(ВЫБРАТЬ
	|					УслугиДоходов.Услуга,
	|					УслугиДоходов.ИдентификаторСУЕ,
	|					УслугиДоходов.ПериодВО,
	|					УслугиДоходов.Клиент
	|				ИЗ
	|					УслугиДоходов КАК УслугиДоходов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	ВложенныйЗапрос.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.Клиент КАК Клиент,
	|	ВложенныйЗапрос.ВнутренняяСебестоимость КАК ВнутренняяСебестоимость,
	|	ВложенныйЗапрос.ПериодВО КАК ПериодВО,
	|	СделкаРасходы.ГУИД КАК ГУИД,
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК ИдентификаторСУЕ,
	|	СделкаРасходы.ПунктОтправления КАК ПунктОтправления,
	|	СделкаРасходы.ПунктНазначения КАК ПунктНазначения,
	|	СделкаРасходы.Вагон КАК Вагон,
	|	СделкаРасходы.Контейнер КАК Контейнер
	|ПОМЕСТИТЬ РасходыСделки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Ссылка КАК Ссылка,
	|		ВложенныйЗапрос.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
	|		ВложенныйЗапрос.Услуга КАК Услуга,
	|		ВложенныйЗапрос.Клиент КАК Клиент,
	|		ВложенныйЗапрос.ВнутренняяСебестоимость КАК ВнутренняяСебестоимость,
	|		ВложенныйЗапрос.ПериодВО КАК ПериодВО,
	|		ВложенныйЗапрос.ПриоритетСтроки КАК ПриоритетСтроки,
	|		ВложенныйЗапрос.Вагон КАК Вагон,
	|		ВложенныйЗапрос.Контейнер КАК Контейнер,
	|		МИНИМУМ(РасходыСПриоритетами.НомерСтроки) КАК НомерСтроки
	|	ИЗ
	|		(ВЫБРАТЬ
	|			РасходыСПриоритетами.Ссылка КАК Ссылка,
	|			РасходыСПриоритетами.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц,
	|			РасходыСПриоритетами.Услуга КАК Услуга,
	|			РасходыСПриоритетами.Клиент КАК Клиент,
	|			РасходыСПриоритетами.ВнутренняяСебестоимость КАК ВнутренняяСебестоимость,
	|			РасходыСПриоритетами.ПериодВО КАК ПериодВО,
	|			РасходыСПриоритетами.Вагон КАК Вагон,
	|			РасходыСПриоритетами.Контейнер КАК Контейнер,
	|			МИНИМУМ(РасходыСПриоритетами.ПриоритетСтроки) КАК ПриоритетСтроки
	|		ИЗ
	|			РасходыСПриоритетами КАК РасходыСПриоритетами
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РасходыСПриоритетами.ПериодВО,
	|			РасходыСПриоритетами.Ссылка,
	|			РасходыСПриоритетами.ВнутренняяСебестоимость,
	|			РасходыСПриоритетами.Услуга,
	|			РасходыСПриоритетами.СвязьУчетныхЕдиниц,
	|			РасходыСПриоритетами.Вагон,
	|			РасходыСПриоритетами.Контейнер,
	|			РасходыСПриоритетами.Клиент) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасходыСПриоритетами КАК РасходыСПриоритетами
	|			ПО ВложенныйЗапрос.Ссылка = РасходыСПриоритетами.Ссылка
	|				И ВложенныйЗапрос.СвязьУчетныхЕдиниц = РасходыСПриоритетами.СвязьУчетныхЕдиниц
	|				И ВложенныйЗапрос.Услуга = РасходыСПриоритетами.Услуга
	|				И ВложенныйЗапрос.ВнутренняяСебестоимость = РасходыСПриоритетами.ВнутренняяСебестоимость
	|				И ВложенныйЗапрос.ПериодВО = РасходыСПриоритетами.ПериодВО
	|				И ВложенныйЗапрос.Вагон = РасходыСПриоритетами.Вагон
	|				И ВложенныйЗапрос.Контейнер = РасходыСПриоритетами.Контейнер
	|				И ВложенныйЗапрос.ПриоритетСтроки = РасходыСПриоритетами.ПриоритетСтроки
	|				И ВложенныйЗапрос.Клиент = РасходыСПриоритетами.Клиент
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.ВнутренняяСебестоимость,
	|		ВложенныйЗапрос.Услуга,
	|		ВложенныйЗапрос.СвязьУчетныхЕдиниц,
	|		ВложенныйЗапрос.Ссылка,
	|		ВложенныйЗапрос.ПериодВО,
	|		ВложенныйЗапрос.Вагон,
	|		ВложенныйЗапрос.Контейнер,
	|		ВложенныйЗапрос.ПриоритетСтроки,
	|		ВложенныйЗапрос.Клиент) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы
	|		ПО ВложенныйЗапрос.Ссылка = СделкаРасходы.Ссылка
	|			И ВложенныйЗапрос.НомерСтроки = СделкаРасходы.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходыСделки.Ссылка КАК Ссылка,
	|	РасходыСделки.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	РасходыСделки.Услуга КАК Услуга,
	|	РасходыСделки.Клиент КАК Клиент,
	|	ЕСТЬNULL(СделкаДоходы.ГУИД, """") КАК ГУИД,
	|	ЕСТЬNULL(СделкаДоходы.НомерСтроки, 100000) КАК НомерСтроки,
	|	РасходыСделки.ВнутренняяСебестоимость КАК ВнутренняяСебестоимость,
	|	РасходыСделки.ПунктОтправления КАК ПунктОтправления,
	|	РасходыСделки.ПунктНазначения КАК ПунктНазначения,
	|	РасходыСделки.ПериодВО КАК ПериодВО,
	|	РасходыСделки.Вагон КАК Вагон,
	|	РасходыСделки.Контейнер КАК Контейнер
	|ПОМЕСТИТЬ РасходыСделкиГУИДДоходов
	|ИЗ
	|	РасходыСделки КАК РасходыСделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
	|			ПО СделкаДоходы.Ссылка = &Ссылка
	|				И СделкаСвязьДоходовИРасходов.Доходы = СделкаДоходы.ГУИД
	|		ПО СделкаСвязьДоходовИРасходов.Ссылка = &Ссылка
	|			И РасходыСделки.ГУИД = СделкаСвязьДоходовИРасходов.Расходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходыСделкиГУИДДоходов.Ссылка КАК Ссылка,
	|	РасходыСделкиГУИДДоходов.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	РасходыСделкиГУИДДоходов.Услуга КАК Услуга,
	|	РасходыСделкиГУИДДоходов.Клиент КАК Клиент,
	|	РасходыСделкиГУИДДоходов.ГУИД КАК ГУИД,
	|	РасходыСделкиГУИДДоходов.ВнутренняяСебестоимость КАК ВнутренняяСебестоимость,
	|	РасходыСделкиГУИДДоходов.ПунктОтправления КАК ПунктОтправления,
	|	РасходыСделкиГУИДДоходов.ПунктНазначения КАК ПунктНазначения,
	|	РасходыСделкиГУИДДоходов.ПериодВО КАК ПериодВО,
	|	РасходыСделкиГУИДДоходов.Вагон КАК Вагон,
	|	РасходыСделкиГУИДДоходов.Контейнер КАК Контейнер
	|ПОМЕСТИТЬ РасходыСделкиСГУИДамиДоходов
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасходыСделкиГУИДДоходов.Ссылка КАК Ссылка,
	|		РасходыСделкиГУИДДоходов.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|		РасходыСделкиГУИДДоходов.Услуга КАК Услуга,
	|		РасходыСделкиГУИДДоходов.Клиент КАК Клиент,
	|		РасходыСделкиГУИДДоходов.ВнутренняяСебестоимость КАК ВнутренняяСебестоимость,
	|		РасходыСделкиГУИДДоходов.ПериодВО КАК ПериодВО,
	|		РасходыСделкиГУИДДоходов.Вагон КАК Вагон,
	|		РасходыСделкиГУИДДоходов.Контейнер КАК Контейнер,
	|		МИНИМУМ(РасходыСделкиГУИДДоходов.НомерСтроки) КАК НомерСтроки
	|	ИЗ
	|		РасходыСделкиГУИДДоходов КАК РасходыСделкиГУИДДоходов
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РасходыСделкиГУИДДоходов.Услуга,
	|		РасходыСделкиГУИДДоходов.Ссылка,
	|		РасходыСделкиГУИДДоходов.ИдентификаторСУЕ,
	|		РасходыСделкиГУИДДоходов.ПериодВО,
	|		РасходыСделкиГУИДДоходов.Клиент,
	|		РасходыСделкиГУИДДоходов.Вагон,
	|		РасходыСделкиГУИДДоходов.Контейнер,
	|		РасходыСделкиГУИДДоходов.ВнутренняяСебестоимость) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасходыСделкиГУИДДоходов КАК РасходыСделкиГУИДДоходов
	|		ПО ВложенныйЗапрос.Ссылка = РасходыСделкиГУИДДоходов.Ссылка
	|			И ВложенныйЗапрос.ИдентификаторСУЕ = РасходыСделкиГУИДДоходов.ИдентификаторСУЕ
	|			И ВложенныйЗапрос.Услуга = РасходыСделкиГУИДДоходов.Услуга
	|			И ВложенныйЗапрос.Клиент = РасходыСделкиГУИДДоходов.Клиент
	|			И ВложенныйЗапрос.ВнутренняяСебестоимость = РасходыСделкиГУИДДоходов.ВнутренняяСебестоимость
	|			И ВложенныйЗапрос.ПериодВО = РасходыСделкиГУИДДоходов.ПериодВО
	|			И ВложенныйЗапрос.Вагон = РасходыСделкиГУИДДоходов.Вагон
	|			И ВложенныйЗапрос.Контейнер = РасходыСделкиГУИДДоходов.Контейнер
	|			И ВложенныйЗапрос.НомерСтроки = РасходыСделкиГУИДДоходов.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиДоходов.Сделка КАК Сделка,
	|	УслугиДоходов.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	УслугиДоходов.Услуга КАК Услуга,
	|	УслугиДоходов.Клиент КАК Клиент,
	|	УслугиДоходов.Доходы КАК Доходы,
	|	ЛОЖЬ КАК ВнутренняяСебестоимость,
	|	NULL КАК ПунктОтправления,
	|	NULL КАК ПунктНазначения,
	|	УслугиДоходов.ПериодВО КАК ПериодВО,
	|	УслугиДоходов.Вагон КАК Вагон,
	|	УслугиДоходов.Контейнер КАК Контейнер
	|ПОМЕСТИТЬ УслугиДоходовИРасходов
	|ИЗ
	|	УслугиДоходов КАК УслугиДоходов
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасходыСделки.Ссылка,
	|	РасходыСделки.ИдентификаторСУЕ,
	|	РасходыСделки.Услуга,
	|	РасходыСделки.Клиент,
	|	РасходыСделки.ГУИД,
	|	РасходыСделки.ВнутренняяСебестоимость,
	|	РасходыСделки.ПунктОтправления,
	|	РасходыСделки.ПунктНазначения,
	|	РасходыСделки.ПериодВО,
	|	РасходыСделки.Вагон,
	|	РасходыСделки.Контейнер
	|ИЗ
	|	РасходыСделкиСГУИДамиДоходов КАК РасходыСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиДоходовИРасходов.Сделка КАК Сделка,
	|	УслугиДоходовИРасходов.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	УслугиДоходовИРасходов.Услуга КАК Услуга,
	|	УслугиДоходовИРасходов.Клиент КАК Клиент,
	|	УслугиДоходовИРасходов.ВнутренняяСебестоимость КАК ВнутренняяСебестоимость,
	|	УслугиДоходовИРасходов.ПунктОтправления КАК ПунктОтправления,
	|	УслугиДоходовИРасходов.ПунктНазначения КАК ПунктНазначения,
	|	УслугиДоходовИРасходов.Вагон КАК Вагон,
	|	УслугиДоходовИРасходов.Контейнер КАК Контейнер,
	|	ВЫБОР
	|		КОГДА УслугиДоходовИРасходов.ПериодВО = &ПустаяДата
	|			ТОГДА &Дата3999
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(УслугиДоходовИРасходов.ПериодВО, МЕСЯЦ)
	|	КОНЕЦ КАК ПериодВО,
	|	СделкаДоходы.Протокол КАК Протокол,
	|	СделкаДоходы.Калькуляция КАК Калькуляция,
	|	СделкаДоходы.Договор.ПравилоФормированияДатыУслуги КАК ПризнакПризнанияВыручки,
	|	СделкаДоходы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СделкаДоходы.ДатаОказанияУслугиКлиенту КАК ДатаОказанияУслугиКлиенту,
	|	СделкаДоходы.Договор КАК Договор,
	|	СделкаДоходы.Коносамент КАК Коносамент,
	|	СделкаДоходы.ПравилоОпределенияДатыОказанияУслуги КАК ПравилоОпределенияДатыОказанияУслуги
	|ПОМЕСТИТЬ УслугиСделки
	|ИЗ
	|	УслугиДоходовИРасходов КАК УслугиДоходовИРасходов
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтрокиДоходовСделки КАК СделкаДоходы
	|		ПО УслугиДоходовИРасходов.Сделка = СделкаДоходы.Сделка
	|			И УслугиДоходовИРасходов.ИдентификаторСУЕ = СделкаДоходы.ИдентификаторСУЕ
	|			И УслугиДоходовИРасходов.Доходы = СделкаДоходы.Доходы
	//ДИТ, Беляев СЮ, US 73693 / TA 74258, 29-08-2023, начало (закомментировал условия соединения по вагону и контейнеру, достаточно условий по ГУИД)
	//|			И УслугиДоходовИРасходов.Контейнер = СделкаДоходы.Контейнер
	//|			И УслугиДоходовИРасходов.Вагон = СделкаДоходы.Вагон
	//ДИТ, Беляев СЮ, US 73693 / TA 74258, 29-08-2023, конец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиСделки.Сделка КАК Сделка,
	|	УслугиСделки.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	УслугиСделки.Вагон КАК Вагон,
	|	УслугиСделки.Контейнер КАК Контейнер,
	|	ВЫБОР
	|		КОГДА УслугиСделки.Контейнер <> СделкаСвязьУчетныхЕдиниц.Контейнер
	|			ТОГДА 2
	|		ИНАЧЕ 0
	|	КОНЕЦ + ВЫБОР
	|		КОГДА УслугиСделки.Вагон <> СделкаСвязьУчетныхЕдиниц.Вагон
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПриоритетСтрокиСУЕ,
	|	СделкаСвязьУчетныхЕдиниц.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ПриоритетыСтрокСоставаПоезда
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиСделки КАК УслугиСделки
	|		ПО СделкаСвязьУчетныхЕдиниц.Ссылка = УслугиСделки.Сделка
	|			И СделкаСвязьУчетныхЕдиниц.ГУИД = УслугиСделки.ИдентификаторСУЕ
	|			И (ВЫБОР
	|				КОГДА УслугиСделки.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ УслугиСделки.Контейнер = СделкаСвязьУчетныхЕдиниц.Контейнер
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Сделка КАК Сделка,
	|	ВложенныйЗапрос.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ВложенныйЗапрос.Вагон КАК Вагон,
	|	ВложенныйЗапрос.Контейнер КАК Контейнер,
	|	МИНИМУМ(ПриоритетыСтрокСоставаПоезда.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ НомераСтрокСоставаПоезда
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПриоритетыСтрокСоставаПоезда.Сделка КАК Сделка,
	|		ПриоритетыСтрокСоставаПоезда.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|		ПриоритетыСтрокСоставаПоезда.Вагон КАК Вагон,
	|		ПриоритетыСтрокСоставаПоезда.Контейнер КАК Контейнер,
	|		МИНИМУМ(ПриоритетыСтрокСоставаПоезда.ПриоритетСтрокиСУЕ) КАК ПриоритетСтрокиСУЕ
	|	ИЗ
	|		ПриоритетыСтрокСоставаПоезда КАК ПриоритетыСтрокСоставаПоезда
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПриоритетыСтрокСоставаПоезда.ИдентификаторСУЕ,
	|		ПриоритетыСтрокСоставаПоезда.Сделка,
	|		ПриоритетыСтрокСоставаПоезда.Контейнер,
	|		ПриоритетыСтрокСоставаПоезда.Вагон) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриоритетыСтрокСоставаПоезда КАК ПриоритетыСтрокСоставаПоезда
	|		ПО ВложенныйЗапрос.ИдентификаторСУЕ = ПриоритетыСтрокСоставаПоезда.ИдентификаторСУЕ
	|			И ВложенныйЗапрос.ПриоритетСтрокиСУЕ = ПриоритетыСтрокСоставаПоезда.ПриоритетСтрокиСУЕ
	|			И ВложенныйЗапрос.Вагон = ПриоритетыСтрокСоставаПоезда.Вагон
	|			И ВложенныйЗапрос.Контейнер = ПриоритетыСтрокСоставаПоезда.Контейнер
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ИдентификаторСУЕ,
	|	ВложенныйЗапрос.Сделка,
	|	ВложенныйЗапрос.Контейнер,
	|	ВложенныйЗапрос.Вагон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Сделка,
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ИдентификаторСУЕ,
	|	СделкаСвязьУчетныхЕдиниц.Заявка КАК Заявка,
	|	УслугиСделки.Вагон КАК Вагон,
	|	УслугиСделки.Контейнер КАК Контейнер,
	|	СделкаСвязьУчетныхЕдиниц.Груженый КАК Груженый,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН КАК ЖДН,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН.ДатаОтправления КАК ЖДНДатаОтправления,
	|	СделкаСвязьУчетныхЕдиниц.Ссылка.ТипЗаказа КАК ТипЗаказа,
	|	СделкаСвязьУчетныхЕдиниц.Протокол КАК СоставПоездаПротокол,
	|	СделкаСвязьУчетныхЕдиниц.Калькуляция КАК СоставПоездаКалькуляция,
	|	СделкаСвязьУчетныхЕдиниц.Груз КАК Груз,
	|	СделкаСвязьУчетныхЕдиниц.Груз.ЕТСНГ КАК КодГруза,
	|	СделкаСвязьУчетныхЕдиниц.ВесГрузаНетто КАК ВесГрузаНетто,
	|	УслугиСделки.ПериодВО КАК ПериодВО,
	|	УслугиСделки.Протокол КАК Протокол,
	|	УслугиСделки.Калькуляция КАК Калькуляция,
	|	УслугиСделки.ПризнакПризнанияВыручки КАК ПризнакПризнанияВыручки,
	|	УслугиСделки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	УслугиСделки.ДатаОказанияУслугиКлиенту КАК ДатаОказанияУслугиКлиенту,
	|	ЕСТЬNULL(УслугиСделки.Клиент, СделкаСвязьУчетныхЕдиниц.Клиент) КАК Клиент,
	|	ЕСТЬNULL(УслугиСделки.Договор, СделкаСвязьУчетныхЕдиниц.Договор) КАК Договор,
	|	УслугиСделки.Услуга КАК Услуга,
	|	ВЫБОР
	|		КОГДА СделкаСвязьУчетныхЕдиниц.НомерВагоннойЖДН <> """"
	|				И СделкаСвязьУчетныхЕдиниц.НомерПорожнейВагоннойЖДН <> """"
	|				И СделкаСвязьУчетныхЕдиниц.ЖДНПерестановкиДоГружКТК <> ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|				И СделкаСвязьУчетныхЕдиниц.ЖДНПерестановкиДоПорКТК <> ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПорожнихРейсов.ПодПогрузку)
	|		КОГДА СделкаСвязьУчетныхЕдиниц.НакладнаяПослеГруженогоПлеча <> ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПорожнихРейсов.ПослеВыгрузки)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыПорожнихРейсов.ПустаяСсылка)
	|	КОНЕЦ КАК ВидПорожнегоРейса,
	|	УслугиСделки.Коносамент КАК Коносамент,
	|	УслугиСделки.ПравилоОпределенияДатыОказанияУслуги КАК ПравилоОпределенияДатыОказанияУслуги,
	|	УслугиСделки.ВнутренняяСебестоимость КАК ВнутренняяСебестоимость,
	|	УслугиСделки.ПунктОтправления КАК ПунктОтправления,
	|	УслугиСделки.ПунктНазначения КАК ПунктНазначения,
	|	СделкаСвязьУчетныхЕдиниц.УсловияПеревозки КАК УсловияПеревозкиОтправление,
	|	СделкаСвязьУчетныхЕдиниц.УсловияПеревозкиНазначение КАК УсловияПеревозкиНазначение,
	//ДИТ Шевченко А.В. US 66360 ТА 73009 01.08.2023
	|	СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения
	//ДИТ Шевченко А.В. US 66360 ТА 73009 01.08.2023
	|ПОМЕСТИТЬ СоставПоездаИДоходы
	|ИЗ
	|	УслугиСделки КАК УслугиСделки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НомераСтрокСоставаПоезда КАК НомераСтрокСоставаПоезда
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|			ПО НомераСтрокСоставаПоезда.Сделка = СделкаСвязьУчетныхЕдиниц.Ссылка
	|				И НомераСтрокСоставаПоезда.НомерСтроки = СделкаСвязьУчетныхЕдиниц.НомерСтроки
	|		ПО УслугиСделки.Сделка = НомераСтрокСоставаПоезда.Сделка
	|			И УслугиСделки.ИдентификаторСУЕ = НомераСтрокСоставаПоезда.ИдентификаторСУЕ
	|			И УслугиСделки.Вагон = НомераСтрокСоставаПоезда.Вагон
	|			И УслугиСделки.Контейнер = НомераСтрокСоставаПоезда.Контейнер
	|ГДЕ
	|	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Вагон КАК Вагон,
	|	ВложенныйЗапрос.ЖДНДатаОтправления КАК ЖДНДатаОтправления,
	|	ПризнакСобственностиВагона.ПризнакСобственности КАК ПризнакСобственностиВагона
	|ПОМЕСТИТЬ ПризнакиСобственностиВагонов
	|ИЗ
	|	(ВЫБРАТЬ
	|		СоставПоезда.Вагон КАК Вагон,
	|		СоставПоезда.ЖДНДатаОтправления КАК ЖДНДатаОтправления,
	|		МАКСИМУМ(ПризнакСобственностиВагона.Период) КАК Период
	|	ИЗ
	|		СоставПоездаИДоходы КАК СоставПоезда
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПризнакСобственностиВагона КАК ПризнакСобственностиВагона
	|			ПО СоставПоезда.Вагон = ПризнакСобственностиВагона.Вагон
	|				И СоставПоезда.ЖДНДатаОтправления >= ПризнакСобственностиВагона.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СоставПоезда.Вагон,
	|		СоставПоезда.ЖДНДатаОтправления) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПризнакСобственностиВагона КАК ПризнакСобственностиВагона
	|		ПО ВложенныйЗапрос.Вагон = ПризнакСобственностиВагона.Вагон
	|			И ВложенныйЗапрос.Период = ПризнакСобственностиВагона.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Вагон КАК Вагон,
	|	ВложенныйЗапрос.ЖДНДатаОтправления КАК ЖДНДатаОтправления,
	|	ПаспортаВагонов.Собственник КАК СобственникВагона,
	|	ПаспортаВагонов.Арендатор КАК АрендаторВагона
	|ПОМЕСТИТЬ ПаспортаВагонов
	|ИЗ
	|	(ВЫБРАТЬ
	|		СоставПоезда.Вагон КАК Вагон,
	|		СоставПоезда.ЖДНДатаОтправления КАК ЖДНДатаОтправления,
	|		МАКСИМУМ(ПаспортаВагонов.Период) КАК Период
	|	ИЗ
	|		СоставПоездаИДоходы КАК СоставПоезда
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортаВагонов КАК ПаспортаВагонов
	|			ПО СоставПоезда.Вагон = ПаспортаВагонов.Вагон
	|				И СоставПоезда.ЖДНДатаОтправления >= ПаспортаВагонов.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СоставПоезда.Вагон,
	|		СоставПоезда.ЖДНДатаОтправления) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортаВагонов КАК ПаспортаВагонов
	|		ПО ВложенныйЗапрос.Вагон = ПаспортаВагонов.Вагон
	|			И ВложенныйЗапрос.Период = ПаспортаВагонов.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Контейнер КАК КТК,
	|	ВложенныйЗапрос.ЖДНДатаОтправления КАК ЖДНДатаОтправления,
	|	стоки_ТекущиеДанные.тек_ВидСобственности КАК ВидСобственностиКонтейнера,
	|	стоки_ТекущиеДанные.тек_Собственник КАК СобственникКонтейнера
	|ПОМЕСТИТЬ ДанныеПоКонтейнерам
	|ИЗ
	|	(ВЫБРАТЬ
	|		СоставПоезда.Контейнер КАК Контейнер,
	|		СоставПоезда.ЖДНДатаОтправления КАК ЖДНДатаОтправления,
	|		МАКСИМУМ(стоки_ТекущиеДанные.Период) КАК Период
	|	ИЗ
	|		СоставПоездаИДоходы КАК СоставПоезда
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные КАК стоки_ТекущиеДанные
	|			ПО СоставПоезда.Контейнер = стоки_ТекущиеДанные.КТК
	|				И СоставПоезда.ЖДНДатаОтправления >= стоки_ТекущиеДанные.Период
	|	ГДЕ
	|		СоставПоезда.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СоставПоезда.Контейнер,
	|		СоставПоезда.ЖДНДатаОтправления) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные КАК стоки_ТекущиеДанные
	|		ПО ВложенныйЗапрос.Контейнер = стоки_ТекущиеДанные.КТК
	|			И ВложенныйЗапрос.Период = стоки_ТекущиеДанные.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоставПоездаИДоходы.Клиент КАК Клиент,
	|	СоставПоездаИДоходы.СоставПоездаКалькуляция КАК СоставПоездаКалькуляция,
	|	СоставПоездаИДоходы.СоставПоездаПротокол КАК СоставПоездаПротокол,
	|	СоставПоездаИДоходы.Заявка КАК Заявка,
	|	СоставПоездаИДоходы.Вагон КАК Вагон,
	|	СоставПоездаИДоходы.Контейнер КАК Контейнер,
	|	ЗаявкаСоставУслуги.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ЗаявкаСоставУслуги.НомерКТК = ЗНАЧЕНИЕ(справочник.те.пустаяссылка)
	|			ТОГДА 500
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СоставПоездаИДоходы.Контейнер = ЗаявкаСоставУслуги.НомерКТК
	|					ТОГДА 0
	|				ИНАЧЕ 1000
	|			КОНЕЦ
	|	КОНЕЦ + ВЫБОР
	|		КОГДА ЗаявкаСоставУслуги.Вагон = ЗНАЧЕНИЕ(справочник.тс.пустаяссылка)
	|			ТОГДА 50
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СоставПоездаИДоходы.Вагон = ЗаявкаСоставУслуги.Вагон
	|					ТОГДА 0
	|				ИНАЧЕ 100
	|			КОНЕЦ
	|	КОНЕЦ + ВЫБОР
	|		КОГДА СоставПоездаИДоходы.СоставПоездаКалькуляция = ЗаявкаСоставУслуги.Калькуляция
	|			ТОГДА 0
	|		ИНАЧЕ 10
	|	КОНЕЦ + ВЫБОР
	|		КОГДА СоставПоездаИДоходы.СоставПоездаПротокол = ЗаявкаСоставУслуги.ПСЦ
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Приоритет
	|ПОМЕСТИТЬ ПриоритетыСтрокЗаявки
	|ИЗ
	|	СоставПоездаИДоходы КАК СоставПоездаИДоходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|		ПО СоставПоездаИДоходы.Заявка = ЗаявкаСоставУслуги.Ссылка
	|			И (ВЫБОР
	|				КОГДА ЗаявкаСоставУслуги.НомерКТК <> ЗНАЧЕНИЕ(справочник.те.пустаяссылка)
	|					ТОГДА СоставПоездаИДоходы.Контейнер = ЗаявкаСоставУслуги.НомерКТК
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ЗаявкаСоставУслуги.Вагон <> ЗНАЧЕНИЕ(справочник.тс.пустаяссылка)
	|					ТОГДА СоставПоездаИДоходы.Вагон = ЗаявкаСоставУслуги.Вагон
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПервыеПодходящиеСтрокиЗаявки.Клиент КАК Клиент,
	|	ПервыеПодходящиеСтрокиЗаявки.СоставПоездаКалькуляция КАК СоставПоездаКалькуляция,
	|	ПервыеПодходящиеСтрокиЗаявки.СоставПоездаПротокол КАК СоставПоездаПротокол,
	|	ПервыеПодходящиеСтрокиЗаявки.Заявка КАК Заявка,
	|	ПервыеПодходящиеСтрокиЗаявки.Вагон КАК Вагон,
	|	ПервыеПодходящиеСтрокиЗаявки.Контейнер КАК Контейнер,
	|	ЗаявкаСоставУслуги.ДатаВыдачи КАК ДатаВыдачиКонтейнераКлиенту,
	|	ЗаявкаСоставУслуги.ДатаВозвратаКлиентом КАК ДатаСдачиКонтейнераКлиентом,
	|	ЗаявкаСоставУслуги.УсловияПеревозки КАК УсловияПеревозкиВПунктеОтправления,
	|	ЗаявкаСоставУслуги.УсловияПеревозкиНазначение КАК УсловияПеревозкиВПунктеНазначения,
	// ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 06.02.2023
	// Было:
	//|	ЗаявкаСоставУслуги.Груз КАК Груз, 
	//Стало:
	|	ЗаявкаСоставУслуги.КлючАналитикиПеревозки.Груз КАК Груз,
	// ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 06.02.2023
	|	ЗаявкаСоставУслуги.КодГруза КАК КодГруза,
	|	ЗаявкаСоставУслуги.ВесГрузаНетто КАК ВесГрузаНетто,
	|	ЗаявкаСоставУслуги.Коносамент КАК Коносамент,
	|	ЗаявкаСоставУслуги.ПунктОтправления КАК ПунктОтправления,
	|	ЗаявкаСоставУслуги.ПунктНазначения КАК ПунктНазначения
	|ПОМЕСТИТЬ СоставУслугЗаявки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПриоритетыСтрокЗаявки.Клиент КАК Клиент,
	|		ПриоритетыСтрокЗаявки.СоставПоездаКалькуляция КАК СоставПоездаКалькуляция,
	|		ПриоритетыСтрокЗаявки.СоставПоездаПротокол КАК СоставПоездаПротокол,
	|		ПриоритетыСтрокЗаявки.Заявка КАК Заявка,
	|		ПриоритетыСтрокЗаявки.Вагон КАК Вагон,
	|		ПриоритетыСтрокЗаявки.Контейнер КАК Контейнер,
	|		МИНИМУМ(ПриоритетыСтрокЗаявки.НомерСтроки) КАК НомерСтроки
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ПриоритетыСтрокЗаявки.Клиент КАК Клиент,
	|			ПриоритетыСтрокЗаявки.СоставПоездаКалькуляция КАК СоставПоездаКалькуляция,
	|			ПриоритетыСтрокЗаявки.СоставПоездаПротокол КАК СоставПоездаПротокол,
	|			ПриоритетыСтрокЗаявки.Заявка КАК Заявка,
	|			ПриоритетыСтрокЗаявки.Вагон КАК Вагон,
	|			ПриоритетыСтрокЗаявки.Контейнер КАК Контейнер,
	|			МИНИМУМ(ПриоритетыСтрокЗаявки.Приоритет) КАК Приоритет
	|		ИЗ
	|			ПриоритетыСтрокЗаявки КАК ПриоритетыСтрокЗаявки
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПриоритетыСтрокЗаявки.Клиент,
	|			ПриоритетыСтрокЗаявки.Контейнер,
	|			ПриоритетыСтрокЗаявки.Вагон,
	|			ПриоритетыСтрокЗаявки.Заявка,
	|			ПриоритетыСтрокЗаявки.СоставПоездаКалькуляция,
	|			ПриоритетыСтрокЗаявки.СоставПоездаПротокол) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриоритетыСтрокЗаявки КАК ПриоритетыСтрокЗаявки
	|			ПО ВложенныйЗапрос.Клиент = ПриоритетыСтрокЗаявки.Клиент
	|				И ВложенныйЗапрос.СоставПоездаКалькуляция = ПриоритетыСтрокЗаявки.СоставПоездаКалькуляция
	|				И ВложенныйЗапрос.СоставПоездаПротокол = ПриоритетыСтрокЗаявки.СоставПоездаПротокол
	|				И ВложенныйЗапрос.Заявка = ПриоритетыСтрокЗаявки.Заявка
	|				И ВложенныйЗапрос.Вагон = ПриоритетыСтрокЗаявки.Вагон
	|				И ВложенныйЗапрос.Контейнер = ПриоритетыСтрокЗаявки.Контейнер
	|				И ВложенныйЗапрос.Приоритет = ПриоритетыСтрокЗаявки.Приоритет
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПриоритетыСтрокЗаявки.Заявка,
	|		ПриоритетыСтрокЗаявки.Клиент,
	|		ПриоритетыСтрокЗаявки.СоставПоездаКалькуляция,
	|		ПриоритетыСтрокЗаявки.СоставПоездаПротокол,
	|		ПриоритетыСтрокЗаявки.Вагон,
	|		ПриоритетыСтрокЗаявки.Контейнер) КАК ПервыеПодходящиеСтрокиЗаявки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|		ПО ПервыеПодходящиеСтрокиЗаявки.Заявка = ЗаявкаСоставУслуги.Ссылка
	|			И ПервыеПодходящиеСтрокиЗаявки.НомерСтроки = ЗаявкаСоставУслуги.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//ДИТ Шевченко А.В. US 66360 ТА 73009 01.08.2023
	|ВЫБРАТЬ
	|	СделкаРейсы.Рейс КАК Рейс,
	|	СделкаРейсы.Рейс.ТехРейс КАК РейсТехРейс,
	|	СделкаРейсы.Рейс.РейсОтменен КАК РейсРейсОтменен,
	|	СделкаРейсы.Рейс.СхемаПеревозки КАК РейсСхемаПеревозки,
	|	СделкаРейсы.Рейс.ОтрезокСхемыПеревозки КАК РейсОтрезокСхемыПеревозки
	|ПОМЕСТИТЬ ВТРейсы
	|ИЗ
	|	Документ.Сделка.Рейсы КАК СделкаРейсы
	|ГДЕ
	|	СделкаРейсы.Ссылка = &Ссылка
	|	И СделкаРейсы.НомерСтроки = 1
	|;
	//ДИТ Шевченко А.В. US 66360 ТА 73009 01.08.2023
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоставПоездаИДоходы.Сделка КАК Сделка,
	|	СоставПоездаИДоходы.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	СоставПоездаИДоходы.ПериодВО КАК Период,
	|	СоставПоездаИДоходы.Клиент КАК Клиент,
	|	СоставПоездаИДоходы.Услуга КАК Услуга,
	|	СоставПоездаИДоходы.Заявка КАК Заявка,
	|	СоставПоездаИДоходы.ПризнакПризнанияВыручки КАК ПризнакПризнанияВыручки,
	|	СоставПоездаИДоходы.Калькуляция КАК Калькуляция,
	|	СоставПоездаИДоходы.Протокол КАК Протокол,
	|	СоставПоездаИДоходы.ТипЗаказа КАК ТипЗаказа,
	|	СоставПоездаИДоходы.Вагон КАК Вагон,
	|	СоставПоездаИДоходы.Контейнер КАК Контейнер,
	|	СоставПоездаИДоходы.Груженый КАК Груженый,
	|	СоставПоездаИДоходы.ЖДНДатаОтправления КАК ЖДНДатаОтправления,
	|	ПризнакиСобственностиВагонов.ПризнакСобственностиВагона КАК ПризнакСобственностиВагона,
	|	ПаспортаВагонов.СобственникВагона КАК СобственникВагона,
	|	ПаспортаВагонов.АрендаторВагона КАК АрендаторВагона,
	|	ДанныеПоКонтейнерам.ВидСобственностиКонтейнера КАК ВидСобственностиКонтейнера,
	|	ДанныеПоКонтейнерам.СобственникКонтейнера КАК СобственникКонтейнера,
	|	СоставПоездаИДоходы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СоставПоездаИДоходы.Договор КАК Договор,
	|	СоставПоездаИДоходы.ДатаОказанияУслугиКлиенту КАК ДатаОказанияУслугиКлиенту,
	|	СоставПоездаИДоходы.ЖДН КАК ЖДН,
	|	СоставУслугЗаявки.ДатаВыдачиКонтейнераКлиенту КАК ЗаявкаДатаВыдачиКонтейнераКлиенту,
	|	СоставУслугЗаявки.ДатаСдачиКонтейнераКлиентом КАК ЗаявкаДатаСдачиКонтейнераКлиентом,
	|	СоставПоездаИДоходы.УсловияПеревозкиОтправление КАК ЗаявкаУсловияПеревозкиВПунктеОтправления,
	|	СоставПоездаИДоходы.УсловияПеревозкиНазначение КАК ЗаявкаУсловияПеревозкиВПунктеНазначения,
	|	СоставПоездаИДоходы.Груз КАК ЗаявкаГруз,
	|	СоставПоездаИДоходы.КодГруза КАК ЗаявкаКодГруза,       
	//ДИТ Авдеева В.С. 0280397 Начало 25.08.2022
	//|	СоставПоездаИДоходы.ВесГрузаНетто * 1000 КАК ЗаявкаВесГрузаНетто,
	|	СоставПоездаИДоходы.ВесГрузаНетто КАК ЗаявкаВесГрузаНетто,
	//ДИТ Авдеева В.С. 0280397 Конец 25.08.2022
	|	СоставУслугЗаявки.Коносамент КАК ЗаявкаКоносамент,
	|	ВТРейсы.Рейс КАК Рейс,
	|	ВТРейсы.Рейс.Продукт КАК Продукт,
	|	СоставПоездаИДоходы.ВидПорожнегоРейса КАК ВидПорожнегоРейса,
	|	ВЫБОР
	|		КОГДА СоставПоездаИДоходы.Услуга = &УслугаФрахт
	|			ТОГДА СоставПоездаИДоходы.Коносамент.СтанцияОтправления
	|		КОГДА НЕ СоставПоездаИДоходы.ПунктОтправления ЕСТЬ NULL
	|			ТОГДА СоставПоездаИДоходы.ПунктОтправления
	|		ИНАЧЕ СоставУслугЗаявки.ПунктОтправления
	|	КОНЕЦ КАК ПунктОтправления,
	|	ВЫБОР
	|		КОГДА СоставПоездаИДоходы.Услуга = &УслугаФрахт
	|			ТОГДА СоставПоездаИДоходы.Коносамент.СтанцияНазначения
	|		КОГДА НЕ СоставПоездаИДоходы.ПунктНазначения ЕСТЬ NULL
	|			ТОГДА СоставПоездаИДоходы.ПунктНазначения
	|		ИНАЧЕ СоставУслугЗаявки.ПунктНазначения
	|	КОНЕЦ КАК ПунктНазначения,
	|	ВЫБОР
	|		КОГДА СоставПоездаИДоходы.Услуга = &УслугаФрахт
	|			ТОГДА СоставПоездаИДоходы.Коносамент.СтанцияОтправления.Тип
	|		КОГДА НЕ СоставПоездаИДоходы.ПунктОтправления ЕСТЬ NULL
	|			ТОГДА СоставПоездаИДоходы.ПунктОтправления.Тип
	|		ИНАЧЕ СоставУслугЗаявки.ПунктОтправления.Тип
	|	КОНЕЦ КАК ТипПунктаОтправления,
	|	ВЫБОР
	|		КОГДА СоставПоездаИДоходы.Услуга = &УслугаФрахт
	|			ТОГДА СоставПоездаИДоходы.Коносамент.СтанцияНазначения.Тип
	|		КОГДА НЕ СоставПоездаИДоходы.ПунктНазначения ЕСТЬ NULL
	|			ТОГДА СоставПоездаИДоходы.ПунктНазначения.Тип
	|		ИНАЧЕ СоставУслугЗаявки.ПунктНазначения.Тип
	|	КОНЕЦ КАК ТипПунктаНазначения,
	|	СоставПоездаИДоходы.ПравилоОпределенияДатыОказанияУслуги КАК ПравилоОпределенияДатыОказанияУслуги,
	|	СоставПоездаИДоходы.ВнутренняяСебестоимость КАК ВнутренняяСебестоимость,
	//ДИТ Шевченко А.В. US 66360 ТА 73009 01.08.2023
	|	ВЫБОР
	|		КОГДА НЕ ВТРейсы.РейсТехРейс
	|				И НЕ ВТРейсы.РейсРейсОтменен
	|			ТОГДА ВЫБОР
	|					КОГДА СоставПоездаИДоходы.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ЖД)
	|						ТОГДА ВТРейсы.РейсСхемаПеревозки
	|					ИНАЧЕ ВЫБОР
	|							КОГДА СоставПоездаИДоходы.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.МОРЕ)
	|									И СоставПоездаИДоходы.СоставПоездаКалькуляция.ПС_ВидПеревозки = ЗНАЧЕНИЕ(СПравочник.ВидыПеревозок.ИмпортМоре)
	|								ТОГДА ЗНАЧЕНИЕ(Справочник.СхемыПеревозки.МскСибирьПриморьеМск)
	|							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СхемыПеревозки.ПУстаяСсылка)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СхемыПеревозки.Другое)
	|	КОНЕЦ КАК СхемаПеревозки,
	|	ВЫБОР
	|		КОГДА НЕ ВТРейсы.РейсТехРейс
	|				И НЕ ВТРейсы.РейсРейсОтменен
	|			ТОГДА ВЫБОР
	|					КОГДА СоставПоездаИДоходы.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ЖД)
	|						ТОГДА ВТРейсы.РейсОтрезокСхемыПеревозки
	|					ИНАЧЕ ВЫБОР
	|							КОГДА СоставПоездаИДоходы.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.МОРЕ)
	|									И СоставПоездаИДоходы.СоставПоездаКалькуляция.ПС_ВидПеревозки = ЗНАЧЕНИЕ(СПравочник.ВидыПеревозок.ИмпортМоре)
	|								ТОГДА ЗНАЧЕНИЕ(Справочник.ОтрезкиСхемПеревозок.ПриморьеМскСЗ)
	|							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОтрезкиСхемПеревозок.ПУстаяСсылка)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОтрезкиСхемПеревозок.Другое)
	|	КОНЕЦ КАК ОтрезокСхемыПеревозки
	//ДИТ Шевченко А.В. US 66360 ТА 73009 01.08.2023
	|ИЗ
	|	СоставПоездаИДоходы КАК СоставПоездаИДоходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПризнакиСобственностиВагонов КАК ПризнакиСобственностиВагонов
	|		ПО СоставПоездаИДоходы.Вагон = ПризнакиСобственностиВагонов.Вагон
	|			И СоставПоездаИДоходы.ЖДНДатаОтправления = ПризнакиСобственностиВагонов.ЖДНДатаОтправления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПаспортаВагонов КАК ПаспортаВагонов
	|		ПО СоставПоездаИДоходы.Вагон = ПаспортаВагонов.Вагон
	|			И СоставПоездаИДоходы.ЖДНДатаОтправления = ПаспортаВагонов.ЖДНДатаОтправления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоКонтейнерам КАК ДанныеПоКонтейнерам
	|		ПО СоставПоездаИДоходы.Контейнер = ДанныеПоКонтейнерам.КТК
	|			И СоставПоездаИДоходы.ЖДНДатаОтправления = ДанныеПоКонтейнерам.ЖДНДатаОтправления
	|		ЛЕВОЕ СОЕДИНЕНИЕ СоставУслугЗаявки КАК СоставУслугЗаявки
	|		ПО СоставПоездаИДоходы.Заявка = СоставУслугЗаявки.Заявка
	|			И СоставПоездаИДоходы.Вагон = СоставУслугЗаявки.Вагон
	|			И СоставПоездаИДоходы.Контейнер = СоставУслугЗаявки.Контейнер
	|			И СоставПоездаИДоходы.Клиент = СоставУслугЗаявки.Клиент
	|			И СоставПоездаИДоходы.СоставПоездаКалькуляция = СоставУслугЗаявки.СоставПоездаКалькуляция
	|			И СоставПоездаИДоходы.СоставПоездаПротокол = СоставУслугЗаявки.СоставПоездаПротокол
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРейсы КАК ВТРейсы
	|		ПО (ИСТИНА)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

//Евросиб Каблов 22.12.2023
Процедура Сделка_СформироватьДвиженияДанныеПоОтправлениям(ОбъектСделка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = Сделка_ПолучитьТекстЗапросаДанныеПоОтправлениям();
	Сделка_УстановитьПараметрыЗапросаДанныеПоОтправлениям(Запрос, ОбъектСделка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	НаборЗаписей = РегистрыСведений.ДанныеПоОтправлениям.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ОбъектСделка);
		
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("ИдентификаторСУЕ") Цикл
		Пока Выборка.СледующийПоЗначениюПоля("Период") Цикл
			Пока Выборка.СледующийПоЗначениюПоля("Клиент") Цикл
				Пока Выборка.СледующийПоЗначениюПоля("Услуга") Цикл
					Пока Выборка.СледующийПоЗначениюПоля("ВнутренняяСебестоимость") Цикл
						Выборка.СледующийПоЗначениюПоля("Калькуляция");
						НоваяЗапись = НаборЗаписей.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

//Евросиб Каблов 22.12.2023
Функция Сделка_ПолучитьТекстЗапросаДанныеПоОтправлениям()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаДоходы.Ссылка КАК Ссылка,
	|	СделкаДоходы.Услуга КАК Услуга,
	|	СделкаДоходы.Клиент КАК Клиент,
	|	СделкаДоходы.ГУИД КАК ГУИД,
	|	НАЧАЛОПЕРИОДА(СделкаДоходы.ПериодВО, МЕСЯЦ) КАК ПериодВО,
	|	СделкаДоходы.ПСЦ КАК ПСЦ,
	|	СделкаДоходы.Калькуляция КАК Калькуляция,
	|	СделкаДоходы.Договор.ПравилоФормированияДатыУслуги КАК ПризнакПризнанияВыручки,
	|	СделкаДоходы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СделкаДоходы.ДатаОказанияУслуги КАК ДатаОказанияУслуги,
	|	СделкаДоходы.Договор КАК Договор,
	|	СделкаДоходы.Коносамент КАК Коносамент,
	|	СделкаДоходы.ПравилоОпределенияДатыОказанияУслуги КАК ПравилоОпределенияДатыОказанияУслуги,
	|	СделкаДоходы.УчДокумент КАК УчДокумент,
	|	СделкаДоходы.Перевыставляемая КАК Перевыставляемая,
	|	СделкаДоходы.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ СделкаДоходы
	|ИЗ
	|	Документ.Сделка.Доходы КАК СделкаДоходы
	|ГДЕ
	|	СделкаДоходы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаДоходы.Ссылка КАК Сделка,
	// Евросиб US 82073 TA 114490 Рыбьяков К.А. 24.07.2025 ((
	//|	РеализацияТоваровУслугРасшифровкаУслугПоТС.УдалитьСтрокаСвязьУчетныхЕдиниц КАК ИдентификаторСУЕ,
	|	РеализацияТоваровУслугРасшифровкаУслугПоТС.КлючАналитикиСоставаПоезда.ИдентификаторКлюча КАК ИдентификаторСУЕ,
	// Евросиб Рыбьяков К.А. 24.07.2025 ))
	|	СделкаДоходы.Услуга КАК Услуга,
	|	СделкаДоходы.Клиент КАК Клиент,
	|	СделкаДоходы.ГУИД КАК Доходы,
	|	НАЧАЛОПЕРИОДА(СделкаДоходы.ПериодВО, МЕСЯЦ) КАК ПериодВО,
	|	СделкаДоходы.ПСЦ КАК Протокол,
	|	СделкаДоходы.Калькуляция КАК Калькуляция,
	|	СделкаДоходы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СделкаДоходы.ДатаОказанияУслуги КАК ДатаОказанияУслугиКлиенту,
	|	СделкаДоходы.Договор КАК Договор,
	|	СделкаДоходы.ПризнакПризнанияВыручки КАК ПризнакПризнанияВыручки,
	|	СделкаДоходы.Коносамент КАК Коносамент,
	|	СделкаДоходы.ПравилоОпределенияДатыОказанияУслуги КАК ПравилоОпределенияДатыОказанияУслуги,
	|	0 КАК Приоритет,
	|	СделкаДоходы.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ УслугиДоходов
	|ИЗ
	|	СделкаДоходы КАК СделкаДоходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.РасшифровкаУслугПоТС КАК РеализацияТоваровУслугРасшифровкаУслугПоТС
	|		ПО СделкаДоходы.УчДокумент = РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка
	|			И СделкаДоходы.ГУИД = РеализацияТоваровУслугРасшифровкаУслугПоТС.СтрокаДоходовСделки
	|ГДЕ
	|	РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаДоходы.Ссылка,
	// Евросиб US 82073 TA 114490 Рыбьяков К.А. 24.07.2025 ((
	//|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.УдалитьСтрокаСвязьУчетныхЕдиниц,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.КлючАналитикиСоставаПоезда.ИдентификаторКлюча,
	// Евросиб Рыбьяков К.А. 24.07.2025 ))
	|	СделкаДоходы.Услуга,
	|	СделкаДоходы.Клиент,
	|	СделкаДоходы.ГУИД,
	|	НАЧАЛОПЕРИОДА(СделкаДоходы.ПериодВО, МЕСЯЦ),
	|	СделкаДоходы.ПСЦ,
	|	СделкаДоходы.Калькуляция,
	|	СделкаДоходы.ЕдиницаИзмерения,
	|	СделкаДоходы.ДатаОказанияУслуги,
	|	СделкаДоходы.Договор,
	|	СделкаДоходы.ПризнакПризнанияВыручки,
	|	СделкаДоходы.Коносамент,
	|	СделкаДоходы.ПравилоОпределенияДатыОказанияУслуги,
	|	1,
	|	СделкаДоходы.НомерСтроки
	|ИЗ
	|	СделкаДоходы КАК СделкаДоходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.РасшифровкаУслугПоТС КАК ОтчетКомитентуОПродажахРасшифровкаУслугПоТС
	|		ПО СделкаДоходы.УчДокумент = ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка
	|			И СделкаДоходы.ГУИД = ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СтрокаДоходовСделки
	|ГДЕ
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаДоходы.Ссылка,
	// Евросиб US 82073 TA 114490 Рыбьяков К.А. 24.07.2025 ((
	//|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.УдалитьСтрокаСвязьУчетныхЕдиниц,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.КлючАналитикиСоставаПоезда.ИдентификаторКлюча,
	// Евросиб Рыбьяков К.А. 24.07.2025 ))
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.Вознаграждение),
	|	СделкаДоходы.Клиент,
	|	СделкаДоходы.ГУИД,
	|	НАЧАЛОПЕРИОДА(СделкаДоходы.ПериодВО, МЕСЯЦ),
	|	СделкаДоходы.ПСЦ,
	|	СделкаДоходы.Калькуляция,
	|	СделкаДоходы.ЕдиницаИзмерения,
	|	СделкаДоходы.ДатаОказанияУслуги,
	|	СделкаДоходы.Договор,
	|	СделкаДоходы.ПризнакПризнанияВыручки,
	|	СделкаДоходы.Коносамент,
	|	СделкаДоходы.ПравилоОпределенияДатыОказанияУслуги,
	|	1,
	|	СделкаДоходы.НомерСтроки
	|ИЗ
	|	СделкаДоходы КАК СделкаДоходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.РасшифровкаУслугПоТС КАК ОтчетКомитентуОПродажахРасшифровкаУслугПоТС
	|		ПО СделкаДоходы.УчДокумент = ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка
	|			И СделкаДоходы.ГУИД = ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СтрокаДоходовСделки
	|ГДЕ
	|	СделкаДоходы.Перевыставляемая
	|	И ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаДоходы.Ссылка,
	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц,
	|	СделкаДоходы.Услуга,
	|	СделкаДоходы.Клиент,
	|	СделкаДоходы.ГУИД,
	|	НАЧАЛОПЕРИОДА(СделкаДоходы.ПериодВО, МЕСЯЦ),
	|	СделкаДоходы.ПСЦ,
	|	СделкаДоходы.Калькуляция,
	|	СделкаДоходы.ЕдиницаИзмерения,
	|	СделкаДоходы.ДатаОказанияУслуги,
	|	СделкаДоходы.Договор,
	|	СделкаДоходы.ПризнакПризнанияВыручки,
	|	СделкаДоходы.Коносамент,
	|	СделкаДоходы.ПравилоОпределенияДатыОказанияУслуги,
	|	2 + ВЫБОР
	|		КОГДА СделкаСвязьДоходовИРасходов.Услуга = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ 2
	|	КОНЕЦ + ВЫБОР
	|		КОГДА СделкаСвязьДоходовИРасходов.Расходы = """"
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	СделкаДоходы.НомерСтроки
	|ИЗ
	|	СделкаДоходы КАК СделкаДоходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|		ПО СделкаДоходы.Ссылка = СделкаСвязьДоходовИРасходов.Ссылка
	|			И СделкаДоходы.ГУИД = СделкаСвязьДоходовИРасходов.Доходы
	|ГДЕ
	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц <> """"
	|	И СделкаСвязьДоходовИРасходов.Доходы <> """"
	|	И НЕ ЕСТЬNULL(СделкаДоходы.УчДокумент.Проведен, ЛОЖЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаДоходы.Ссылка,
	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.Вознаграждение),
	|	СделкаДоходы.Клиент,
	|	СделкаДоходы.ГУИД,
	|	НАЧАЛОПЕРИОДА(СделкаДоходы.ПериодВО, МЕСЯЦ),
	|	СделкаДоходы.ПСЦ,
	|	СделкаДоходы.Калькуляция,
	|	СделкаДоходы.ЕдиницаИзмерения,
	|	СделкаДоходы.ДатаОказанияУслуги,
	|	СделкаДоходы.Договор,
	|	СделкаДоходы.ПризнакПризнанияВыручки,
	|	СделкаДоходы.Коносамент,
	|	СделкаДоходы.ПравилоОпределенияДатыОказанияУслуги,
	|	2 + ВЫБОР
	|		КОГДА СделкаСвязьДоходовИРасходов.Услуга = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ 2
	|	КОНЕЦ + ВЫБОР
	|		КОГДА СделкаСвязьДоходовИРасходов.Расходы = """"
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	СделкаДоходы.НомерСтроки
	|ИЗ
	|	СделкаДоходы КАК СделкаДоходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|		ПО СделкаДоходы.Ссылка = СделкаСвязьДоходовИРасходов.Ссылка
	|			И СделкаДоходы.ГУИД = СделкаСвязьДоходовИРасходов.Доходы
	|ГДЕ
	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц <> """"
	|	И СделкаСвязьДоходовИРасходов.Доходы <> """"
	|	И СделкаДоходы.Перевыставляемая
	|	И НЕ ЕСТЬNULL(СделкаДоходы.УчДокумент.Проведен, ЛОЖЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходыСделки.Ссылка КАК Ссылка,
	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК ИдентификаторСУЕ,
	|	РасходыСделки.Услуга КАК Услуга,
	|	ВЫБОР
	|		КОГДА СделкаДоходы.УчДокумент ЕСТЬ NULL
	|				ИЛИ СделкаДоходы.УчДокумент = НЕОПРЕДЕЛЕНО
	|				ИЛИ СделкаДоходы.Ссылка ЕСТЬ NULL
	|			ТОГДА ДАТАВРЕМЯ(3999, 1, 1)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(СделкаДоходы.ПериодВО, МЕСЯЦ)
	|	КОНЕЦ КАК ПериодВО,
	|	РасходыСделки.ГУИД КАК ГУИД,
	|	РасходыСделки.ВнутренняяСебестоимость КАК ВнутренняяСебестоимость,
	|	РасходыСделки.ПунктОтправления КАК ПунктОтправления,
	|	РасходыСделки.ПунктНазначения КАК ПунктНазначения
	//Евросиб Коханенко Н.А. 15.05.2025 (( #78722 
	|	,РасходыСделки.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	|	РасходыСделки.ОтнестиНаЗатраты КАК ОтнестиНаЗатраты
	//Евросиб Коханенко Н.А. 15.05.2025 )) #78722 
	|ПОМЕСТИТЬ РасходыСделки
	|ИЗ
	|	Документ.Сделка.Расходы КАК РасходыСделки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|			ЛЕВОЕ СОЕДИНЕНИЕ СделкаДоходы КАК СделкаДоходы
	|			ПО СделкаСвязьДоходовИРасходов.Доходы = СделкаДоходы.ГУИД
	|		ПО (СделкаСвязьДоходовИРасходов.Ссылка = &Ссылка)
	|			И РасходыСделки.ГУИД = СделкаСвязьДоходовИРасходов.Расходы
	|ГДЕ
	|	РасходыСделки.Ссылка = &Ссылка
	|	И РасходыСделки.ГУИД <> """"
	|	И СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходыСделки.Ссылка КАК Ссылка,
	|	РасходыСделки.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	РасходыСделки.Услуга КАК Услуга,
	|	ЕСТЬNULL(СделкаДоходы.Клиент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Клиент,
	|	РасходыСделки.ПериодВО КАК ПериодВО,
	|	ЕСТЬNULL(СделкаДоходы.ГУИД, """") КАК ГУИД,
	|	РасходыСделки.ВнутренняяСебестоимость КАК ВнутренняяСебестоимость,
	|	РасходыСделки.ПунктОтправления КАК ПунктОтправления,
	|	РасходыСделки.ПунктНазначения КАК ПунктНазначения
	//Евросиб Коханенко Н.А. 15.05.2025 (( #78722 
	|	,РасходыСделки.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	|	РасходыСделки.ОтнестиНаЗатраты КАК ОтнестиНаЗатраты
	//Евросиб Коханенко Н.А. 15.05.2025 )) #78722 
	|ПОМЕСТИТЬ РасходыСделкиГУИДДоходов
	|ИЗ
	|	РасходыСделки КАК РасходыСделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ СделкаДоходы КАК СделкаДоходы
	|			ПО СделкаСвязьДоходовИРасходов.Доходы = СделкаДоходы.ГУИД
	|		ПО (СделкаСвязьДоходовИРасходов.Ссылка = &Ссылка)
	|			И РасходыСделки.ГУИД = СделкаСвязьДоходовИРасходов.Расходы
	|ГДЕ
	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиДоходов.Сделка КАК Сделка,
	|	УслугиДоходов.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	УслугиДоходов.Услуга КАК Услуга,
	|	УслугиДоходов.Клиент КАК Клиент,
	|	УслугиДоходов.Доходы КАК Доходы,
	|	ЛОЖЬ КАК ВнутренняяСебестоимость,
	|	NULL КАК ПунктОтправления,
	|	NULL КАК ПунктНазначения,
	|	УслугиДоходов.ПериодВО КАК ПериодВО
	//Евросиб Коханенко Н.А. 15.05.2025 (( #78722 
	|	,NULL КАК ИсточникПоявленияСтрокиЭкономики,
	|	NULL КАК ОтнестиНаЗатраты
	//Евросиб Коханенко Н.А. 15.05.2025 )) #78722 
	|ПОМЕСТИТЬ УслугиДоходовИРасходов
	|ИЗ
	|	УслугиДоходов КАК УслугиДоходов
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасходыСделки.Ссылка,
	|	РасходыСделки.ИдентификаторСУЕ,
	|	РасходыСделки.Услуга,
	|	РасходыСделки.Клиент,
	|	РасходыСделки.ГУИД,
	|	РасходыСделки.ВнутренняяСебестоимость,
	|	РасходыСделки.ПунктОтправления,
	|	РасходыСделки.ПунктНазначения,
	|	РасходыСделки.ПериодВО
	//Евросиб Коханенко Н.А. 15.05.2025 (( #78722 
	|	,РасходыСделки.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	|	РасходыСделки.ОтнестиНаЗатраты КАК ОтнестиНаЗатраты
	//Евросиб Коханенко Н.А. 15.05.2025 )) #78722 
	|ИЗ
	|	РасходыСделкиГУИДДоходов КАК РасходыСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиДоходовИРасходов.Сделка КАК Сделка,
	|	УслугиДоходовИРасходов.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	УслугиДоходовИРасходов.Услуга КАК Услуга,
	|	УслугиДоходовИРасходов.Клиент КАК Клиент,
	|	УслугиДоходовИРасходов.ВнутренняяСебестоимость КАК ВнутренняяСебестоимость,
	|	УслугиДоходовИРасходов.ПунктОтправления КАК ПунктОтправления,
	|	УслугиДоходовИРасходов.ПунктНазначения КАК ПунктНазначения,
	|	ВЫБОР
	|		КОГДА УслугиДоходовИРасходов.ПериодВО = &ПустаяДата
	|			ТОГДА &Дата3999
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(УслугиДоходовИРасходов.ПериодВО, МЕСЯЦ)
	|	КОНЕЦ КАК ПериодВО,
	|	СделкаДоходы.ПСЦ КАК Протокол,
	|	СделкаДоходы.Калькуляция КАК Калькуляция,
	|	СделкаДоходы.Договор.ПравилоФормированияДатыУслуги КАК ПризнакПризнанияВыручки,
	|	СделкаДоходы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СделкаДоходы.ДатаОказанияУслуги КАК ДатаОказанияУслугиКлиенту,
	|	СделкаДоходы.Договор КАК Договор,
	|	СделкаДоходы.Коносамент КАК Коносамент,
	|	СделкаДоходы.ПравилоОпределенияДатыОказанияУслуги КАК ПравилоОпределенияДатыОказанияУслуги
	//Евросиб Коханенко Н.А. 15.05.2025 (( #78722 
	|	,УслугиДоходовИРасходов.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	|	УслугиДоходовИРасходов.ОтнестиНаЗатраты КАК ОтнестиНаЗатраты
	//Евросиб Коханенко Н.А. 15.05.2025 )) #78722 
	|ПОМЕСТИТЬ УслугиСделки
	|ИЗ
	|	УслугиДоходовИРасходов КАК УслугиДоходовИРасходов
	|		ЛЕВОЕ СОЕДИНЕНИЕ СделкаДоходы КАК СделкаДоходы
	|		ПО УслугиДоходовИРасходов.Доходы = СделкаДоходы.ГУИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиСделки.Сделка КАК Сделка,
	|	УслугиСделки.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	МИНИМУМ(СделкаСвязьУчетныхЕдиниц.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ НомераСтрокСоставаПоезда
	|ИЗ
	|	УслугиСделки КАК УслугиСделки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|		ПО (СделкаСвязьУчетныхЕдиниц.Ссылка = УслугиСделки.Сделка)
	|			И (СделкаСвязьУчетныхЕдиниц.ГУИД = УслугиСделки.ИдентификаторСУЕ)
	|
	|СГРУППИРОВАТЬ ПО
	|	УслугиСделки.ИдентификаторСУЕ,
	|	УслугиСделки.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Сделка,
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ИдентификаторСУЕ,
	|	СделкаСвязьУчетныхЕдиниц.Заявка КАК Заявка,
	|	СделкаСвязьУчетныхЕдиниц.Вагон КАК Вагон,
	|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	|	СделкаСвязьУчетныхЕдиниц.Груженый КАК Груженый,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН КАК ЖДН,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН.ДатаОтправления КАК ЖДНДатаОтправления,
	|	СделкаСвязьУчетныхЕдиниц.Ссылка.ТипЗаказа КАК ТипЗаказа,
	|	СделкаСвязьУчетныхЕдиниц.Протокол КАК СоставПоездаПротокол,
	|	СделкаСвязьУчетныхЕдиниц.Калькуляция КАК СоставПоездаКалькуляция,
	|	СделкаСвязьУчетныхЕдиниц.Груз КАК Груз,
	|	СделкаСвязьУчетныхЕдиниц.Груз.ЕТСНГ КАК КодГруза,
	|	СделкаСвязьУчетныхЕдиниц.ВесГрузаНетто КАК ВесГрузаНетто,
	|	УслугиСделки.ПериодВО КАК ПериодВО,
	|	УслугиСделки.Протокол КАК Протокол,
	|	УслугиСделки.Калькуляция КАК Калькуляция,
	|	УслугиСделки.ПризнакПризнанияВыручки КАК ПризнакПризнанияВыручки,
	|	УслугиСделки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	УслугиСделки.ДатаОказанияУслугиКлиенту КАК ДатаОказанияУслугиКлиенту,
	|	ЕСТЬNULL(УслугиСделки.Клиент, СделкаСвязьУчетныхЕдиниц.Клиент) КАК Клиент,
	|	ЕСТЬNULL(УслугиСделки.Договор, СделкаСвязьУчетныхЕдиниц.Договор) КАК Договор,
	|	УслугиСделки.Услуга КАК Услуга,
	|	ВЫБОР
	|		КОГДА СделкаСвязьУчетныхЕдиниц.НомерВагоннойЖДН <> """"
	|				И СделкаСвязьУчетныхЕдиниц.НомерПорожнейВагоннойЖДН <> """"
	|				И СделкаСвязьУчетныхЕдиниц.ЖДНПерестановкиДоГружКТК <> ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|				И СделкаСвязьУчетныхЕдиниц.ЖДНПерестановкиДоПорКТК <> ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПорожнихРейсов.ПодПогрузку)
	|		КОГДА СделкаСвязьУчетныхЕдиниц.НакладнаяПослеГруженогоПлеча <> ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПорожнихРейсов.ПослеВыгрузки)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыПорожнихРейсов.ПустаяСсылка)
	|	КОНЕЦ КАК ВидПорожнегоРейса,
	|	УслугиСделки.Коносамент КАК Коносамент,
	|	УслугиСделки.ПравилоОпределенияДатыОказанияУслуги КАК ПравилоОпределенияДатыОказанияУслуги,
	|	УслугиСделки.ВнутренняяСебестоимость КАК ВнутренняяСебестоимость,
	|	УслугиСделки.ПунктОтправления КАК ПунктОтправления,
	|	УслугиСделки.ПунктНазначения КАК ПунктНазначения,
	|	СделкаСвязьУчетныхЕдиниц.УсловияПеревозки КАК УсловияПеревозкиОтправление,
	|	СделкаСвязьУчетныхЕдиниц.УсловияПеревозкиНазначение КАК УсловияПеревозкиНазначение,
	|	СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения,
	|	СделкаСвязьУчетныхЕдиниц.ЖДРейс КАК ЖДРейс,
	//Евросиб Каблов 18.06.2025 ( #111741
	|	СделкаСвязьУчетныхЕдиниц.МорскойРейс КАК МорскойРейс
	//Евросиб Каблов 18.06.2025 )
	//Евросиб Коханенко Н.А. 15.05.2025 (( #78722 
	|	,УслугиСделки.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики,
	|	УслугиСделки.ОтнестиНаЗатраты КАК ОтнестиНаЗатраты
	//Евросиб Коханенко Н.А. 15.05.2025 )) #78722 
	|ПОМЕСТИТЬ СоставПоездаИДоходы
	|ИЗ
	|	УслугиСделки КАК УслугиСделки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НомераСтрокСоставаПоезда КАК НомераСтрокСоставаПоезда
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|			ПО НомераСтрокСоставаПоезда.Сделка = СделкаСвязьУчетныхЕдиниц.Ссылка
	|				И НомераСтрокСоставаПоезда.НомерСтроки = СделкаСвязьУчетныхЕдиниц.НомерСтроки
	|		ПО УслугиСделки.Сделка = НомераСтрокСоставаПоезда.Сделка
	|			И УслугиСделки.ИдентификаторСУЕ = НомераСтрокСоставаПоезда.ИдентификаторСУЕ
	|ГДЕ
	|	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Вагон КАК Вагон,
	|	ВложенныйЗапрос.ЖДНДатаОтправления КАК ЖДНДатаОтправления,
	|	ПризнакСобственностиВагона.ПризнакСобственности КАК ПризнакСобственностиВагона
	|ПОМЕСТИТЬ ПризнакиСобственностиВагонов
	|ИЗ
	|	(ВЫБРАТЬ
	|		СоставПоезда.Вагон КАК Вагон,
	|		СоставПоезда.ЖДНДатаОтправления КАК ЖДНДатаОтправления,
	|		МАКСИМУМ(ПризнакСобственностиВагона.Период) КАК Период
	|	ИЗ
	|		СоставПоездаИДоходы КАК СоставПоезда
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПризнакСобственностиВагона КАК ПризнакСобственностиВагона
	|			ПО СоставПоезда.Вагон = ПризнакСобственностиВагона.Вагон
	|				И СоставПоезда.ЖДНДатаОтправления >= ПризнакСобственностиВагона.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СоставПоезда.Вагон,
	|		СоставПоезда.ЖДНДатаОтправления) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПризнакСобственностиВагона КАК ПризнакСобственностиВагона
	|		ПО ВложенныйЗапрос.Вагон = ПризнакСобственностиВагона.Вагон
	|			И ВложенныйЗапрос.Период = ПризнакСобственностиВагона.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Вагон КАК Вагон,
	|	ВложенныйЗапрос.ЖДНДатаОтправления КАК ЖДНДатаОтправления,
	|	ПаспортаВагонов.Собственник КАК СобственникВагона,
	|	ПаспортаВагонов.Арендатор КАК АрендаторВагона
	|ПОМЕСТИТЬ ПаспортаВагонов
	|ИЗ
	|	(ВЫБРАТЬ
	|		СоставПоезда.Вагон КАК Вагон,
	|		СоставПоезда.ЖДНДатаОтправления КАК ЖДНДатаОтправления,
	|		МАКСИМУМ(ПаспортаВагонов.Период) КАК Период
	|	ИЗ
	|		СоставПоездаИДоходы КАК СоставПоезда
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортаВагонов КАК ПаспортаВагонов
	|			ПО СоставПоезда.Вагон = ПаспортаВагонов.Вагон
	|				И СоставПоезда.ЖДНДатаОтправления >= ПаспортаВагонов.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СоставПоезда.Вагон,
	|		СоставПоезда.ЖДНДатаОтправления) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортаВагонов КАК ПаспортаВагонов
	|		ПО ВложенныйЗапрос.Вагон = ПаспортаВагонов.Вагон
	|			И ВложенныйЗапрос.Период = ПаспортаВагонов.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Контейнер КАК КТК,
	|	ВложенныйЗапрос.ЖДНДатаОтправления КАК ЖДНДатаОтправления,
	|	стоки_ТекущиеДанные.тек_ВидСобственности КАК ВидСобственностиКонтейнера,
	|	стоки_ТекущиеДанные.тек_Собственник КАК СобственникКонтейнера
	|ПОМЕСТИТЬ ДанныеПоКонтейнерам
	|ИЗ
	|	(ВЫБРАТЬ
	|		СоставПоезда.Контейнер КАК Контейнер,
	|		СоставПоезда.ЖДНДатаОтправления КАК ЖДНДатаОтправления,
	|		МАКСИМУМ(стоки_ТекущиеДанные.Период) КАК Период
	|	ИЗ
	|		СоставПоездаИДоходы КАК СоставПоезда
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные КАК стоки_ТекущиеДанные
	|			ПО СоставПоезда.Контейнер = стоки_ТекущиеДанные.КТК
	|				И СоставПоезда.ЖДНДатаОтправления >= стоки_ТекущиеДанные.Период
	|	ГДЕ
	|		СоставПоезда.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СоставПоезда.Контейнер,
	|		СоставПоезда.ЖДНДатаОтправления) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.стоки_ТекущиеДанные КАК стоки_ТекущиеДанные
	|		ПО ВложенныйЗапрос.Контейнер = стоки_ТекущиеДанные.КТК
	|			И ВложенныйЗапрос.Период = стоки_ТекущиеДанные.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоставПоездаИДоходы.Клиент КАК Клиент,
	|	СоставПоездаИДоходы.СоставПоездаКалькуляция КАК СоставПоездаКалькуляция,
	|	СоставПоездаИДоходы.СоставПоездаПротокол КАК СоставПоездаПротокол,
	|	СоставПоездаИДоходы.Заявка КАК Заявка,
	|	СоставПоездаИДоходы.Вагон КАК Вагон,
	|	СоставПоездаИДоходы.Контейнер КАК Контейнер,
	|	ЗаявкаСоставУслуги.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ЗаявкаСоставУслуги.НомерКТК = ЗНАЧЕНИЕ(справочник.те.пустаяссылка)
	|			ТОГДА 500
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СоставПоездаИДоходы.Контейнер = ЗаявкаСоставУслуги.НомерКТК
	|					ТОГДА 0
	|				ИНАЧЕ 1000
	|			КОНЕЦ
	|	КОНЕЦ + ВЫБОР
	|		КОГДА ЗаявкаСоставУслуги.Вагон = ЗНАЧЕНИЕ(справочник.тс.пустаяссылка)
	|			ТОГДА 50
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СоставПоездаИДоходы.Вагон = ЗаявкаСоставУслуги.Вагон
	|					ТОГДА 0
	|				ИНАЧЕ 100
	|			КОНЕЦ
	|	КОНЕЦ + ВЫБОР
	|		КОГДА СоставПоездаИДоходы.СоставПоездаКалькуляция = ЗаявкаСоставУслуги.Калькуляция
	|			ТОГДА 0
	|		ИНАЧЕ 10
	|	КОНЕЦ + ВЫБОР
	|		КОГДА СоставПоездаИДоходы.СоставПоездаПротокол = ЗаявкаСоставУслуги.ПСЦ
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Приоритет
	|ПОМЕСТИТЬ ПриоритетыСтрокЗаявки
	|ИЗ
	|	СоставПоездаИДоходы КАК СоставПоездаИДоходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|		ПО СоставПоездаИДоходы.Заявка = ЗаявкаСоставУслуги.Ссылка
	|			И (ВЫБОР
	|				КОГДА ЗаявкаСоставУслуги.НомерКТК <> ЗНАЧЕНИЕ(справочник.те.пустаяссылка)
	|					ТОГДА СоставПоездаИДоходы.Контейнер = ЗаявкаСоставУслуги.НомерКТК
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ЗаявкаСоставУслуги.Вагон <> ЗНАЧЕНИЕ(справочник.тс.пустаяссылка)
	|					ТОГДА СоставПоездаИДоходы.Вагон = ЗаявкаСоставУслуги.Вагон
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПервыеПодходящиеСтрокиЗаявки.Клиент КАК Клиент,
	|	ПервыеПодходящиеСтрокиЗаявки.СоставПоездаКалькуляция КАК СоставПоездаКалькуляция,
	|	ПервыеПодходящиеСтрокиЗаявки.СоставПоездаПротокол КАК СоставПоездаПротокол,
	|	ПервыеПодходящиеСтрокиЗаявки.Заявка КАК Заявка,
	|	ПервыеПодходящиеСтрокиЗаявки.Вагон КАК Вагон,
	|	ПервыеПодходящиеСтрокиЗаявки.Контейнер КАК Контейнер,
	|	ЗаявкаСоставУслуги.ДатаВыдачи КАК ДатаВыдачиКонтейнераКлиенту,
	|	ЗаявкаСоставУслуги.ДатаВозвратаКлиентом КАК ДатаСдачиКонтейнераКлиентом,
	|	ЗаявкаСоставУслуги.УсловияПеревозки КАК УсловияПеревозкиВПунктеОтправления,
	|	ЗаявкаСоставУслуги.УсловияПеревозкиНазначение КАК УсловияПеревозкиВПунктеНазначения,
	|	ЗаявкаСоставУслуги.КлючАналитикиПеревозки.Груз КАК Груз,
	|	ЗаявкаСоставУслуги.КодГруза КАК КодГруза,
	|	ЗаявкаСоставУслуги.ВесГрузаНетто КАК ВесГрузаНетто,
	|	ЗаявкаСоставУслуги.Коносамент КАК Коносамент,
	|	ЗаявкаСоставУслуги.ПунктОтправления КАК ПунктОтправления,
	|	ЗаявкаСоставУслуги.ПунктНазначения КАК ПунктНазначения 
	//Евросиб Коханенко Н.А. 25.04.2025 (( #78722 
	|	,ЗаявкаСоставУслуги.ОфисПродаж КАК ОфисПродаж
	//Евросиб Коханенко Н.А. 25.04.2025 )) #78722 
	|ПОМЕСТИТЬ СоставУслугЗаявки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПриоритетыСтрокЗаявки.Клиент КАК Клиент,
	|		ПриоритетыСтрокЗаявки.СоставПоездаКалькуляция КАК СоставПоездаКалькуляция,
	|		ПриоритетыСтрокЗаявки.СоставПоездаПротокол КАК СоставПоездаПротокол,
	|		ПриоритетыСтрокЗаявки.Заявка КАК Заявка,
	|		ПриоритетыСтрокЗаявки.Вагон КАК Вагон,
	|		ПриоритетыСтрокЗаявки.Контейнер КАК Контейнер,
	|		МИНИМУМ(ПриоритетыСтрокЗаявки.НомерСтроки) КАК НомерСтроки
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ПриоритетыСтрокЗаявки.Клиент КАК Клиент,
	|			ПриоритетыСтрокЗаявки.СоставПоездаКалькуляция КАК СоставПоездаКалькуляция,
	|			ПриоритетыСтрокЗаявки.СоставПоездаПротокол КАК СоставПоездаПротокол,
	|			ПриоритетыСтрокЗаявки.Заявка КАК Заявка,
	|			ПриоритетыСтрокЗаявки.Вагон КАК Вагон,
	|			ПриоритетыСтрокЗаявки.Контейнер КАК Контейнер,
	|			МИНИМУМ(ПриоритетыСтрокЗаявки.Приоритет) КАК Приоритет
	|		ИЗ
	|			ПриоритетыСтрокЗаявки КАК ПриоритетыСтрокЗаявки
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПриоритетыСтрокЗаявки.Клиент,
	|			ПриоритетыСтрокЗаявки.Контейнер,
	|			ПриоритетыСтрокЗаявки.Вагон,
	|			ПриоритетыСтрокЗаявки.Заявка,
	|			ПриоритетыСтрокЗаявки.СоставПоездаКалькуляция,
	|			ПриоритетыСтрокЗаявки.СоставПоездаПротокол) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПриоритетыСтрокЗаявки КАК ПриоритетыСтрокЗаявки
	|			ПО ВложенныйЗапрос.Клиент = ПриоритетыСтрокЗаявки.Клиент
	|				И ВложенныйЗапрос.СоставПоездаКалькуляция = ПриоритетыСтрокЗаявки.СоставПоездаКалькуляция
	|				И ВложенныйЗапрос.СоставПоездаПротокол = ПриоритетыСтрокЗаявки.СоставПоездаПротокол
	|				И ВложенныйЗапрос.Заявка = ПриоритетыСтрокЗаявки.Заявка
	|				И ВложенныйЗапрос.Вагон = ПриоритетыСтрокЗаявки.Вагон
	|				И ВложенныйЗапрос.Контейнер = ПриоритетыСтрокЗаявки.Контейнер
	|				И ВложенныйЗапрос.Приоритет = ПриоритетыСтрокЗаявки.Приоритет
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПриоритетыСтрокЗаявки.Заявка,
	|		ПриоритетыСтрокЗаявки.Клиент,
	|		ПриоритетыСтрокЗаявки.СоставПоездаКалькуляция,
	|		ПриоритетыСтрокЗаявки.СоставПоездаПротокол,
	|		ПриоритетыСтрокЗаявки.Вагон,
	|		ПриоритетыСтрокЗаявки.Контейнер) КАК ПервыеПодходящиеСтрокиЗаявки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|		ПО ПервыеПодходящиеСтрокиЗаявки.Заявка = ЗаявкаСоставУслуги.Ссылка
	|			И ПервыеПодходящиеСтрокиЗаявки.НомерСтроки = ЗаявкаСоставУслуги.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаРейсы.Рейс КАК Рейс,
	|	СделкаРейсы.Рейс.ТехРейс КАК РейсТехРейс,
	|	СделкаРейсы.Рейс.РейсОтменен КАК РейсРейсОтменен,
	|	СделкаРейсы.Рейс.СхемаПеревозки КАК РейсСхемаПеревозки,
	|	СделкаРейсы.Рейс.ОтрезокСхемыПеревозки КАК РейсОтрезокСхемыПеревозки
	|ПОМЕСТИТЬ ВТРейсы
	|ИЗ
	|	Документ.Сделка.Рейсы КАК СделкаРейсы
	|ГДЕ
	|	СделкаРейсы.Ссылка = &Ссылка
	|;
	//Евросиб Коханенко Н.А. 25.04.2025 (( #78722 
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаДок.Ссылка КАК Ссылка,
	|	СделкаДок.Служебная КАК Служебная
	|ПОМЕСТИТЬ ВТСделка
	|ИЗ
	|	Документ.Сделка КАК СделкаДок
	|ГДЕ
	|	СделкаДок.Ссылка = &Ссылка
	|;
	//Евросиб Коханенко Н.А. 25.04.2025 )) #78722 
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоставПоездаИДоходы.Сделка КАК Сделка,
	|	СоставПоездаИДоходы.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	СоставПоездаИДоходы.ПериодВО КАК Период,
	|	СоставПоездаИДоходы.Клиент КАК Клиент,
	|	СоставПоездаИДоходы.Услуга КАК Услуга,
	|	СоставПоездаИДоходы.Заявка КАК Заявка,
	|	СоставПоездаИДоходы.ПризнакПризнанияВыручки КАК ПризнакПризнанияВыручки,
	|	СоставПоездаИДоходы.Калькуляция КАК Калькуляция,
	|	СоставПоездаИДоходы.Протокол КАК Протокол,
	|	СоставПоездаИДоходы.ТипЗаказа КАК ТипЗаказа,
	|	СоставПоездаИДоходы.Вагон КАК Вагон,
	|	СоставПоездаИДоходы.Контейнер КАК Контейнер,
	|	СоставПоездаИДоходы.Груженый КАК Груженый,
	|	СоставПоездаИДоходы.ЖДНДатаОтправления КАК ЖДНДатаОтправления,
	|	ПризнакиСобственностиВагонов.ПризнакСобственностиВагона КАК ПризнакСобственностиВагона,
	|	ПаспортаВагонов.СобственникВагона КАК СобственникВагона,
	|	ПаспортаВагонов.АрендаторВагона КАК АрендаторВагона,
	|	ДанныеПоКонтейнерам.ВидСобственностиКонтейнера КАК ВидСобственностиКонтейнера,
	|	ДанныеПоКонтейнерам.СобственникКонтейнера КАК СобственникКонтейнера,
	|	СоставПоездаИДоходы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СоставПоездаИДоходы.Договор КАК Договор,
	|	СоставПоездаИДоходы.ДатаОказанияУслугиКлиенту КАК ДатаОказанияУслугиКлиенту,
	|	СоставПоездаИДоходы.ЖДН КАК ЖДН,
	|	СоставУслугЗаявки.ДатаВыдачиКонтейнераКлиенту КАК ЗаявкаДатаВыдачиКонтейнераКлиенту,
	|	СоставУслугЗаявки.ДатаСдачиКонтейнераКлиентом КАК ЗаявкаДатаСдачиКонтейнераКлиентом,
	|	СоставПоездаИДоходы.УсловияПеревозкиОтправление КАК ЗаявкаУсловияПеревозкиВПунктеОтправления,
	|	СоставПоездаИДоходы.УсловияПеревозкиНазначение КАК ЗаявкаУсловияПеревозкиВПунктеНазначения,
	|	СоставПоездаИДоходы.Груз КАК ЗаявкаГруз,
	|	СоставПоездаИДоходы.КодГруза КАК ЗаявкаКодГруза,
	|	СоставПоездаИДоходы.ВесГрузаНетто КАК ЗаявкаВесГрузаНетто,
	|	СоставУслугЗаявки.Коносамент КАК ЗаявкаКоносамент,
	//Евросиб Каблов 18.06.2025 ( #111741
	//|	ВТРейсы.Рейс КАК Рейс,
	//|	ВТРейсы.Рейс.Продукт КАК Продукт,
	|	ВЫБОР
	|		КОГДА СоставПоездаИДоходы.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ЖД)
	|			ТОГДА СоставПоездаИДоходы.ЖДРейс
	|		КОГДА СоставПоездаИДоходы.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.МОРЕ)
	|			ТОГДА СоставПоездаИДоходы.МорскойРейс
	|		КОГДА НЕ СоставПоездаИДоходы.ЖДРейс.Ссылка ЕСТЬ NULL
	|			ТОГДА СоставПоездаИДоходы.ЖДРейс
	|		КОГДА НЕ СоставПоездаИДоходы.МорскойРейс.Ссылка ЕСТЬ NULL
	|			ТОГДА СоставПоездаИДоходы.МорскойРейс
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Рейс,
	|	ВЫБОР
	|		КОГДА СоставПоездаИДоходы.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ЖД)
	|			ТОГДА СоставПоездаИДоходы.ЖДРейс.Продукт
	|		КОГДА СоставПоездаИДоходы.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.МОРЕ)
	|			ТОГДА СоставПоездаИДоходы.МорскойРейс.Продукт
	|		КОГДА НЕ СоставПоездаИДоходы.ЖДРейс.Ссылка ЕСТЬ NULL
	|			ТОГДА СоставПоездаИДоходы.ЖДРейс.Продукт
	|		КОГДА НЕ СоставПоездаИДоходы.МорскойРейс.Ссылка ЕСТЬ NULL
	|			ТОГДА СоставПоездаИДоходы.МорскойРейс.Продукт
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Продукт,
	//Евросиб Каблов 18.06.2025 )
	|	СоставПоездаИДоходы.ВидПорожнегоРейса КАК ВидПорожнегоРейса,
	|	ВЫБОР
	|		КОГДА СоставПоездаИДоходы.Услуга = &УслугаФрахт
	|			ТОГДА СоставПоездаИДоходы.Коносамент.СтанцияОтправления
	|		КОГДА НЕ СоставПоездаИДоходы.ПунктОтправления ЕСТЬ NULL
	|			ТОГДА СоставПоездаИДоходы.ПунктОтправления
	|		ИНАЧЕ СоставУслугЗаявки.ПунктОтправления
	|	КОНЕЦ КАК ПунктОтправления,
	|	ВЫБОР
	|		КОГДА СоставПоездаИДоходы.Услуга = &УслугаФрахт
	|			ТОГДА СоставПоездаИДоходы.Коносамент.СтанцияНазначения
	|		КОГДА НЕ СоставПоездаИДоходы.ПунктНазначения ЕСТЬ NULL
	|			ТОГДА СоставПоездаИДоходы.ПунктНазначения
	|		ИНАЧЕ СоставУслугЗаявки.ПунктНазначения
	|	КОНЕЦ КАК ПунктНазначения,
	|	ВЫБОР
	|		КОГДА СоставПоездаИДоходы.Услуга = &УслугаФрахт
	|			ТОГДА СоставПоездаИДоходы.Коносамент.СтанцияОтправления.Тип
	|		КОГДА НЕ СоставПоездаИДоходы.ПунктОтправления ЕСТЬ NULL
	|			ТОГДА СоставПоездаИДоходы.ПунктОтправления.Тип
	|		ИНАЧЕ СоставУслугЗаявки.ПунктОтправления.Тип
	|	КОНЕЦ КАК ТипПунктаОтправления,
	|	ВЫБОР
	|		КОГДА СоставПоездаИДоходы.Услуга = &УслугаФрахт
	|			ТОГДА СоставПоездаИДоходы.Коносамент.СтанцияНазначения.Тип
	|		КОГДА НЕ СоставПоездаИДоходы.ПунктНазначения ЕСТЬ NULL
	|			ТОГДА СоставПоездаИДоходы.ПунктНазначения.Тип
	|		ИНАЧЕ СоставУслугЗаявки.ПунктНазначения.Тип
	|	КОНЕЦ КАК ТипПунктаНазначения,
	|	СоставПоездаИДоходы.ПравилоОпределенияДатыОказанияУслуги КАК ПравилоОпределенияДатыОказанияУслуги,
	|	СоставПоездаИДоходы.ВнутренняяСебестоимость КАК ВнутренняяСебестоимость,
	|	ВЫБОР
	|		КОГДА НЕ ВТРейсы.РейсТехРейс
	|				И НЕ ВТРейсы.РейсРейсОтменен
	|			ТОГДА ВЫБОР
	|					КОГДА СоставПоездаИДоходы.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ЖД)
	|						ТОГДА ВТРейсы.РейсСхемаПеревозки
	|					ИНАЧЕ ВЫБОР
	|							КОГДА СоставПоездаИДоходы.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.МОРЕ)
	|									И СоставПоездаИДоходы.СоставПоездаКалькуляция.ПС_ВидПеревозки = ЗНАЧЕНИЕ(СПравочник.ВидыПеревозок.ИмпортМоре)
	|								ТОГДА ЗНАЧЕНИЕ(Справочник.СхемыПеревозки.МскСибирьПриморьеМск)
	|							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СхемыПеревозки.ПУстаяСсылка)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СхемыПеревозки.Другое)
	|	КОНЕЦ КАК СхемаПеревозки,
	|	ВЫБОР
	|		КОГДА НЕ ВТРейсы.РейсТехРейс
	|				И НЕ ВТРейсы.РейсРейсОтменен
	|			ТОГДА ВЫБОР
	|					КОГДА СоставПоездаИДоходы.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ЖД)
	|						ТОГДА ВТРейсы.РейсОтрезокСхемыПеревозки
	|					ИНАЧЕ ВЫБОР
	|							КОГДА СоставПоездаИДоходы.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.МОРЕ)
	|									И СоставПоездаИДоходы.СоставПоездаКалькуляция.ПС_ВидПеревозки = ЗНАЧЕНИЕ(СПравочник.ВидыПеревозок.ИмпортМоре)
	|								ТОГДА ЗНАЧЕНИЕ(Справочник.ОтрезкиСхемПеревозок.ПриморьеМскСЗ)
	|							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОтрезкиСхемПеревозок.ПУстаяСсылка)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОтрезкиСхемПеревозок.Другое)
	|	КОНЕЦ КАК ОтрезокСхемыПеревозки
	//Евросиб Коханенко Н.А. 25.04.2025 (( #78722 
	|	,ВЫБОР
	|		КОГДА ВТСделка.Служебная
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ОфисыПродаж.РасходыДКП)
	|		КОГДА (СоставПоездаИДоходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта)
	|			И СоставПоездаИДоходы.ОтнестиНаЗатраты)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ОфисыПродаж.РасходыДКП)
	|		ИНАЧЕ СоставУслугЗаявки.ОфисПродаж
	|	КОНЕЦ КАК ОфисПродаж
	//Евросиб Коханенко Н.А. 25.04.2025 )) #78722 
	|ИЗ
	|	СоставПоездаИДоходы КАК СоставПоездаИДоходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПризнакиСобственностиВагонов КАК ПризнакиСобственностиВагонов
	|		ПО СоставПоездаИДоходы.Вагон = ПризнакиСобственностиВагонов.Вагон
	|			И СоставПоездаИДоходы.ЖДНДатаОтправления = ПризнакиСобственностиВагонов.ЖДНДатаОтправления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПаспортаВагонов КАК ПаспортаВагонов
	|		ПО СоставПоездаИДоходы.Вагон = ПаспортаВагонов.Вагон
	|			И СоставПоездаИДоходы.ЖДНДатаОтправления = ПаспортаВагонов.ЖДНДатаОтправления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоКонтейнерам КАК ДанныеПоКонтейнерам
	|		ПО СоставПоездаИДоходы.Контейнер = ДанныеПоКонтейнерам.КТК
	|			И СоставПоездаИДоходы.ЖДНДатаОтправления = ДанныеПоКонтейнерам.ЖДНДатаОтправления
	|		ЛЕВОЕ СОЕДИНЕНИЕ СоставУслугЗаявки КАК СоставУслугЗаявки
	|		ПО СоставПоездаИДоходы.Заявка = СоставУслугЗаявки.Заявка
	|			И СоставПоездаИДоходы.Вагон = СоставУслугЗаявки.Вагон
	|			И СоставПоездаИДоходы.Контейнер = СоставУслугЗаявки.Контейнер
	|			И СоставПоездаИДоходы.Клиент = СоставУслугЗаявки.Клиент
	|			И СоставПоездаИДоходы.СоставПоездаКалькуляция = СоставУслугЗаявки.СоставПоездаКалькуляция
	|			И СоставПоездаИДоходы.СоставПоездаПротокол = СоставУслугЗаявки.СоставПоездаПротокол
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРейсы КАК ВТРейсы
	|		ПО СоставПоездаИДоходы.ЖДРейс = ВТРейсы.Рейс
	//Евросиб Коханенко Н.А. 25.04.2025 (( #78722 
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТСделка КАК ВТСделка
	|	ПО (ВТСделка.Ссылка = &Ссылка)
	//Евросиб Коханенко Н.А. 25.04.2025 )) #78722 
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИдентификаторСУЕ,
	|	Период,
	|	Клиент,
	|	Услуга,
	|	ВнутренняяСебестоимость,
	|	Калькуляция УБЫВ";
	
	Возврат ТекстЗапроса;
	
КонецФункции

//Евросиб Каблов 27.10.2021
Процедура Сделка_УстановитьПараметрыЗапросаДанныеПоОтправлениям(Запрос, ОбъектСделка)
	
	Запрос.УстановитьПараметр("Ссылка", ОбъектСделка);
	Запрос.УстановитьПараметр("УслугаФрахт", Константы.УслугаФрахтаДляКалькуляции.Получить());
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	Запрос.УстановитьПараметр("Дата3999", '39990101');
	
КонецПроцедуры

//Евросиб Каблов 24.11.2022
Процедура Сделка_СформироватьДвиженияПлановыеДоходыВО(ОбъектСделка) Экспорт
	
	//1. убрал объединение, переделал на ключи
	//2. убрал соединение с заявками, переделал на ключ
	//3. убрал получение реквизитов ссылок во временных таблицах
	//4. уменьшил количество строк во временной таблице "ВТ"
	//5. поменял соединение доходы - расходы на связьдоходовирасходов - расходы
	//старый запрос в процедуры ПолучитьТекстСтарыйЗапрос();
	Запрос = Новый Запрос;
	Запрос.Текст = Сделка_ПолучитьТекстЗапросаПлановыеДоходыВО();
	
	Запрос.УстановитьПараметр("Ссылка", ОбъектСделка.Ссылка);
	Запрос.УстановитьПараметр("DOOR", Перечисления.УсловияПеревозкиКТК.DOOR);
	Запрос.УстановитьПараметр("ВалютаРубль", Справочники.Валюты.Рубль);
	//Евросиб Каблов 04.10.2023 ( Ticket#0327047
	КонтрагентДКП = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("КонтрагентДирекцияКонтейнерныхПеревозок");
	Запрос.УстановитьПараметр("КонтрагентДКП", КонтрагентДКП);
	//Евросиб Каблов 04.10.2023 )
	//Запрос.УстановитьПараметр("УслугаФрахта", Константы.УслугаФрахтаДляКалькуляции.Получить());
	//Запрос.УстановитьПараметр("УслугаДоплаты", Константы.УслугаВыставленияДоплатныхКТК.Получить());
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	Запрос.УстановитьПараметр("КонтрагентПустаяСсылка", Справочники.Контрагенты.ПустаяСсылка());
	//Евросиб Каблов 18.10.2023 (
	Запрос.УстановитьПараметр("ТипЗаказа", ОбъектСделка.ТипЗаказа); 
	Запрос.УстановитьПараметр("Дата", ОбъектСделка.Дата);
	//Евросиб Каблов 18.10.2023 )
	
	ВидыПеревозкиЭкспорт = Новый Массив;
	ВидыПеревозкиЭкспорт.Добавить(Справочники.ВидыПеревозок.Экспорт);
	ВидыПеревозкиЭкспорт.Добавить(Справочники.ВидыПеревозок.ЭкспортМоре);
	Запрос.УстановитьПараметр("ВидыПеревозкиЭкспорт", ВидыПеревозкиЭкспорт);
	
	Запрос.УстановитьПараметр("МорскойИмпорт", Справочники.ВидыПеревозок.ИмпортМоре);
	
	УслугаВыставленияДоплатныхКТК = Константы.УслугаВыставленияДоплатныхКТК.Получить();
	Если Не ЗначениеЗаполнено(УслугаВыставленияДоплатныхКТК) Тогда
		УслугаВыставленияДоплатныхКТК = Null;
	КонецЕсли;
	Запрос.УстановитьПараметр("УслугаДоплаты", УслугаВыставленияДоплатныхКТК);
	Запрос.УстановитьПараметр("УслугаФрахта", Константы.УслугаФрахтаДляКалькуляции.Получить());
	
	ТаблицаПлановыхДоходов = Запрос.Выполнить().Выгрузить();
	
	ТипЧисло_15_2 = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2));
	//Евросиб Каблов 18.10.2023 (
	//ТаблицаПлановыхДоходов.Колонки.Добавить("НоменклатурнаяГруппа", Новый ОписаниеТипов("СправочникСсылка.НоменклатурныеГруппы"));
	//Евросиб Каблов 18.10.2023 )
	ТаблицаПлановыхДоходов.Колонки.Добавить("Сумма", ТипЧисло_15_2);
	ТаблицаПлановыхДоходов.Колонки.Добавить("СуммаРуб", ТипЧисло_15_2);
	
	Для Каждого ТекД Из ТаблицаПлановыхДоходов Цикл
		
		//Евросиб Каблов 18.10.2023 (
		//ТекД.НоменклатурнаяГруппа = РазнесениеЗатратСервер.ПодобратьНоменклатурнуюГруппуПоНаборуПараметров(ОбъектСделка.ТипЗаказа, ТекД.Вагон);
		//Евросиб Каблов 18.10.2023 )
		
		Если Не ЗначениеЗаполнено(ТекД.СуммаНДС) Тогда
			ТекД.СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСуммуНДС(ТекД.Ставка, БухгалтерскийУчетОбщиеПроцедурыСервер.ПолучитьСтавкуНДС(ТекД.СтавкаНДС), Истина, ТекД.СуммаВключаетНДС);
			ТекД.СуммаНДСРуб = ТекД.СуммаНДС * ТекД.Курс / ТекД.Кратность;
		КонецЕсли;
		ТекД.Сумма = ТекД.Ставка + ?(ТекД.СуммаВключаетНДС, 0, ТекД.СуммаНДС);
		ТекД.СуммаРуб = ТекД.СтавкаРуб + ?(ТекД.СуммаВключаетНДС, 0, ТекД.СуммаНДСРуб);
		
	КонецЦикла;
	//Евросиб - АСуслов 21.03.2024 17:24:55 #
	//(
	//изменен запрос
	//)
	//Евросиб - АСуслов 21.03.2024 17:24:56 #	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИтоговаяТаблица.ВидУслуги КАК ВидУслуги,
	|	ИтоговаяТаблица.Период КАК Период,
	|	ИтоговаяТаблица.Сделка КАК Сделка,
	|	ИтоговаяТаблица.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ИтоговаяТаблица.ГотовоКВыставлению КАК ГотовоКВыставлению,
	|	ИтоговаяТаблица.Клиент КАК Клиент,
	|	ИтоговаяТаблица.Договор КАК Договор,
	|	ИтоговаяТаблица.Ссылка КАК Ссылка,
	|	ИтоговаяТаблица.Протокол КАК Протокол,
	|	ИтоговаяТаблица.Счет КАК Счет,
	|	ИтоговаяТаблица.Калькуляция КАК Калькуляция,
	|	ИтоговаяТаблица.Организация КАК Организация,
	|	ИтоговаяТаблица.Контейнер КАК Контейнер,
	|	ИтоговаяТаблица.Вагон КАК Вагон,
	|	ИтоговаяТаблица.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения,
	|	ИтоговаяТаблица.ИсточникСтроки КАК ИсточникСтроки,
	|	ИтоговаяТаблица.Ставка КАК Ставка,
	|	ИтоговаяТаблица.СтавкаНДС КАК СтавкаНДС,
	|	ИтоговаяТаблица.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ИтоговаяТаблица.ТипОперации КАК ТипОперации,
	|	ИтоговаяТаблица.Услуга КАК Услуга,
	|	ИтоговаяТаблица.ЦФО КАК ЦФО,
	|	ИтоговаяТаблица.Валюта КАК Валюта,
	|	ИтоговаяТаблица.ДатаОтправления КАК ДатаОтправления,
	|	ИтоговаяТаблица.ДатаПрибытия КАК ДатаПрибытия,
	|	ИтоговаяТаблица.Рейс КАК Рейс,
	|	ИтоговаяТаблица.СуммаНДС КАК СуммаНДС,
	|	ИтоговаяТаблица.ЕстьЭкономика КАК ЕстьЭкономика,
	|	ИтоговаяТаблица.ОжидаемыйДокумент КАК ОжидаемыйДокумент,
	|	ИтоговаяТаблица.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ИтоговаяТаблица.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ИтоговаяТаблица.ИсточникПолученияДатыОказанияУслуги КАК ИсточникПолученияДатыОказанияУслуги,
	|	ИтоговаяТаблица.Сумма КАК Сумма,
	|	ИтоговаяТаблица.СуммаРуб КАК СуммаРуб,
	|	ИтоговаяТаблица.СтавкаРуб КАК СтавкаРуб,
	|	ИтоговаяТаблица.СуммаНДСРуб КАК СуммаНДСРуб,
	|	ИтоговаяТаблица.Курс КАК Курс,
	|	ИтоговаяТаблица.Кратность КАК Кратность,
	|	ИтоговаяТаблица.РасчетнаяДатаЗавершенияПеревозки КАК РасчетнаяДатаЗавершенияПеревозки,
	|	ИтоговаяТаблица.ИсточникПолученияДатыЗавершенияПеревозки КАК ИсточникПолученияДатыЗавершенияПеревозки,
	|	ИтоговаяТаблица.ВидПеревозки КАК ВидПеревозки,
	|	ИтоговаяТаблица.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ИтоговаяТаблица.ПравилоФормированияДокументов КАК ПравилоФормированияДокументов,
	|	ИтоговаяТаблица.ВыставленыЗакрывающиеДокументы КАК ВыставленыЗакрывающиеДокументы,
	|	ИтоговаяТаблица.ИдентификаторСтрокиДохода КАК ИдентификаторСтрокиДохода,
	|	ИтоговаяТаблица.НеВыставлятьКлиенту КАК НеВыставлятьКлиенту,
	|	ИтоговаяТаблица.ВыставленныйДокумент КАК ВыставленныйДокумент,
	|	ИтоговаяТаблица.ЖелтаяДоплата КАК ЖелтаяДоплата,
	|	ИтоговаяТаблица.Заявка КАК Заявка,
	|	ИтоговаяТаблица.ДоходыИсточникПоявленияСтрокиЭкономики КАК ДоходыИсточникПоявленияСтрокиЭкономики
	|ПОМЕСТИТЬ ВТ_ИтоговаяТаблица
	|ИЗ
	|	&ИтоговаяТаблица КАК ИтоговаяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИтоговаяТаблица.ВидУслуги КАК ВидУслуги,
	|	ВТ_ИтоговаяТаблица.Период КАК Период,
	|	ВТ_ИтоговаяТаблица.Сделка КАК Сделка,
	|	ВТ_ИтоговаяТаблица.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ВТ_ИтоговаяТаблица.ГотовоКВыставлению КАК ГотовоКВыставлению,
	|	ВТ_ИтоговаяТаблица.Клиент КАК Клиент,
	|	ВТ_ИтоговаяТаблица.Договор КАК Договор,
	|	ВТ_ИтоговаяТаблица.Ссылка КАК Ссылка,
	|	ВТ_ИтоговаяТаблица.Протокол КАК Протокол,
	|	ВТ_ИтоговаяТаблица.Счет КАК Счет,
	|	ВТ_ИтоговаяТаблица.Калькуляция КАК Калькуляция,
	|	ВТ_ИтоговаяТаблица.Организация КАК Организация,
	|	ВТ_ИтоговаяТаблица.Контейнер КАК Контейнер,
	|	ВТ_ИтоговаяТаблица.Вагон КАК Вагон,
	|	ВТ_ИтоговаяТаблица.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения,
	|	ВТ_ИтоговаяТаблица.ИсточникСтроки КАК ИсточникСтроки,
	|	ВТ_ИтоговаяТаблица.Ставка КАК Ставка,
	|	ВТ_ИтоговаяТаблица.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_ИтоговаяТаблица.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВТ_ИтоговаяТаблица.ТипОперации КАК ТипОперации,
	|	ВТ_ИтоговаяТаблица.Услуга КАК Услуга,
	|	ВТ_ИтоговаяТаблица.ЦФО КАК ЦФО,
	|	ВТ_ИтоговаяТаблица.Валюта КАК Валюта,
	|	ВТ_ИтоговаяТаблица.ДатаОтправления КАК ДатаОтправления,
	|	ВТ_ИтоговаяТаблица.ДатаПрибытия КАК ДатаПрибытия,
	|	ВТ_ИтоговаяТаблица.Рейс КАК Рейс,
	|	ВТ_ИтоговаяТаблица.СуммаНДС КАК СуммаНДС,
	|	ВТ_ИтоговаяТаблица.ЕстьЭкономика КАК ЕстьЭкономика,
	|	ВТ_ИтоговаяТаблица.ОжидаемыйДокумент КАК ОжидаемыйДокумент,
	|	ВТ_ИтоговаяТаблица.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_ИтоговаяТаблица.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ВТ_ИтоговаяТаблица.ИсточникПолученияДатыОказанияУслуги КАК ИсточникПолученияДатыОказанияУслуги,
	|	ВТ_ИтоговаяТаблица.Сумма КАК Сумма,
	|	ВТ_ИтоговаяТаблица.СуммаРуб КАК СуммаРуб,
	|	ВТ_ИтоговаяТаблица.СтавкаРуб КАК СтавкаРуб,
	|	ВТ_ИтоговаяТаблица.СуммаНДСРуб КАК СуммаНДСРуб,
	|	ВТ_ИтоговаяТаблица.Курс КАК Курс,
	|	ВТ_ИтоговаяТаблица.Кратность КАК Кратность,
	|	ВТ_ИтоговаяТаблица.РасчетнаяДатаЗавершенияПеревозки КАК РасчетнаяДатаЗавершенияПеревозки,
	|	ВТ_ИтоговаяТаблица.ИсточникПолученияДатыЗавершенияПеревозки КАК ИсточникПолученияДатыЗавершенияПеревозки,
	|	ВТ_ИтоговаяТаблица.ВидПеревозки КАК ВидПеревозки,
	|	ВТ_ИтоговаяТаблица.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ВТ_ИтоговаяТаблица.ПравилоФормированияДокументов КАК ПравилоФормированияДокументов,
	|	ВТ_ИтоговаяТаблица.Заявка КАК Заявка,
	|	ВТ_ИтоговаяТаблица.ВыставленыЗакрывающиеДокументы КАК ВыставленыЗакрывающиеДокументы
	|ИЗ
	|	ВТ_ИтоговаяТаблица КАК ВТ_ИтоговаяТаблица
	|ГДЕ
	|	ВТ_ИтоговаяТаблица.ВыставленыЗакрывающиеДокументы = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ИтоговаяТаблица.ВидУслуги КАК ВидДоходов,
	|	ВТ_ИтоговаяТаблица.РасчетнаяДатаЗавершенияПеревозки КАК РасчетнаяДатаЗавершенияПеревозки,
	|	ВТ_ИтоговаяТаблица.ИдентификаторСтрокиДохода КАК ИдентификаторСтрокиДохода,
	|	СделкаСвязьДоходовИРасходов.Расходы КАК ИдентификаторСтрокиРасхода,
	|	ВТ_ИтоговаяТаблица.ИдентификаторСУЕ КАК ИдентификаторСтрокиСУЕ,
	|	ВТ_ИтоговаяТаблица.ЕстьЭкономика КАК ЕстьЭкономика,
	|	ВТ_ИтоговаяТаблица.ГотовоКВыставлению КАК ГотовоКВыставлению,
	|	ВТ_ИтоговаяТаблица.Услуга КАК Услуга,
	|	ВТ_ИтоговаяТаблица.ВыставленныйДокумент КАК ВыставленныйДокумент,
	|	ВТ_ИтоговаяТаблица.НеВыставлятьКлиенту КАК НеВыставлятьКлиенту,
	|	ВТ_ИтоговаяТаблица.Сделка КАК Сделка,
	|	СделкаРасходы.Услуга КАК Услуга1,
	|	СделкаРасходы.УчДокумент КАК УчДокументРасход,
	|	ВТ_ИтоговаяТаблица.ДоходыИсточникПоявленияСтрокиЭкономики КАК ДоходыИсточникПоявленияСтрокиЭкономики
	//ДИТ, Беляев СЮ, US 84896/ TA 85068, 13-05-2024, начало
	|	,СделкаРасходы.УслугаОтключена КАК РасходыУслугаОтключена
	|	,СделкаРасходы.ПричинаОтключенияСтроки КАК РасходыПричинаОтключенияСтроки
	//ДИТ, Беляев СЮ, US 84896/ TA 85068, 13-05-2024, конец
	|ПОМЕСТИТЬ ВТ_ИтоговаяДоходыРасходы
	|ИЗ
	|	ВТ_ИтоговаяТаблица КАК ВТ_ИтоговаяТаблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы
	|			ПО СделкаСвязьДоходовИРасходов.Расходы = СделкаРасходы.ГУИД
	|				И СделкаСвязьДоходовИРасходов.Ссылка = СделкаРасходы.Ссылка
	|		ПО ВТ_ИтоговаяТаблица.ИдентификаторСтрокиДохода = СделкаСвязьДоходовИРасходов.Доходы
	|			И ВТ_ИтоговаяТаблица.ИдентификаторСУЕ = СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц
	|			И ВТ_ИтоговаяТаблица.Ссылка = СделкаСвязьДоходовИРасходов.Ссылка
	|			И (СделкаСвязьДоходовИРасходов.Услуга <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|			И (СделкаСвязьДоходовИРасходов.Расходы <> """")
	|			И (НЕ ВТ_ИтоговаяТаблица.ЖелтаяДоплата)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ИтоговаяТаблица.ВидУслуги,
	|	ВТ_ИтоговаяТаблица.РасчетнаяДатаЗавершенияПеревозки,
	|	ВТ_ИтоговаяТаблица.ИдентификаторСтрокиДохода,
	|	СделкаСвязьДоходовИРасходов.Расходы,
	|	ВТ_ИтоговаяТаблица.ИдентификаторСУЕ,
	|	ВТ_ИтоговаяТаблица.ЕстьЭкономика,
	|	ВТ_ИтоговаяТаблица.ГотовоКВыставлению,
	|	ВТ_ИтоговаяТаблица.Услуга,
	|	ВТ_ИтоговаяТаблица.ВыставленныйДокумент,
	|	ВТ_ИтоговаяТаблица.НеВыставлятьКлиенту,
	|	ВТ_ИтоговаяТаблица.Сделка,
	|	СделкаРасходы.Услуга,
	|	СделкаРасходы.УчДокумент,
	|	ВТ_ИтоговаяТаблица.ДоходыИсточникПоявленияСтрокиЭкономики
	//ДИТ, Беляев СЮ, US 84896/ TA 85068, 13-05-2024, начало
	|	,СделкаРасходы.УслугаОтключена
	|	,СделкаРасходы.ПричинаОтключенияСтроки
	//ДИТ, Беляев СЮ, US 84896/ TA 85068, 13-05-2024, конец
	|ИЗ
	|	ВТ_ИтоговаяТаблица КАК ВТ_ИтоговаяТаблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы
	|			ПО СделкаСвязьДоходовИРасходов.Расходы = СделкаРасходы.ГУИД
	|				И СделкаСвязьДоходовИРасходов.Ссылка = СделкаРасходы.Ссылка
	|		ПО ВТ_ИтоговаяТаблица.ИдентификаторСУЕ = СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц
	|			И (ВЫБОР
	|				КОГДА ВТ_ИтоговаяТаблица.ИдентификаторСтрокиДохода = """"
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВТ_ИтоговаяТаблица.ИдентификаторСтрокиДохода = СделкаСвязьДоходовИРасходов.Доходы
	|			КОНЕЦ)
	|			И (ВТ_ИтоговаяТаблица.ВидУслуги = ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.ОсновнойДолг))
	|			И (СделкаСвязьДоходовИРасходов.Услуга = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|			И (СделкаСвязьДоходовИРасходов.Расходы <> """")
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ИтоговаяТаблица.ВидУслуги,
	|	ВТ_ИтоговаяТаблица.РасчетнаяДатаЗавершенияПеревозки,
	|	ВТ_ИтоговаяТаблица.ИдентификаторСтрокиДохода,
	|	СделкаСвязьДоходовИРасходов.Расходы,
	|	ВТ_ИтоговаяТаблица.ИдентификаторСУЕ,
	|	ВТ_ИтоговаяТаблица.ЕстьЭкономика,
	|	ВТ_ИтоговаяТаблица.ГотовоКВыставлению,
	|	ВТ_ИтоговаяТаблица.Услуга,
	|	ВТ_ИтоговаяТаблица.ВыставленныйДокумент,
	|	ВТ_ИтоговаяТаблица.НеВыставлятьКлиенту,
	|	ВТ_ИтоговаяТаблица.Сделка,
	|	СделкаРасходы.Услуга,
	|	СделкаРасходы.УчДокумент,
	|	ВТ_ИтоговаяТаблица.ДоходыИсточникПоявленияСтрокиЭкономики
	//ДИТ, Беляев СЮ, US 84896/ TA 85068, 13-05-2024, начало
	|	,СделкаРасходы.УслугаОтключена
	|	,СделкаРасходы.ПричинаОтключенияСтроки
	//ДИТ, Беляев СЮ, US 84896/ TA 85068, 13-05-2024, конец
	|ИЗ
	|	ВТ_ИтоговаяТаблица КАК ВТ_ИтоговаяТаблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы
	|			ПО СделкаСвязьДоходовИРасходов.Расходы = СделкаРасходы.ГУИД
	|				И СделкаСвязьДоходовИРасходов.Ссылка = СделкаРасходы.Ссылка
	|		ПО ВТ_ИтоговаяТаблица.ИдентификаторСУЕ = СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц
	|			И (ВЫБОР
	|				КОГДА ВТ_ИтоговаяТаблица.ИдентификаторСтрокиДохода = """"
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВТ_ИтоговаяТаблица.ИдентификаторСтрокиДохода = СделкаСвязьДоходовИРасходов.Доходы
	|			КОНЕЦ)
	|			И ВТ_ИтоговаяТаблица.Услуга = СделкаСвязьДоходовИРасходов.Услуга
	|			И ВТ_ИтоговаяТаблица.Ссылка = СделкаСвязьДоходовИРасходов.Ссылка
	|			И (СделкаСвязьДоходовИРасходов.Расходы <> """")
	|			И (НЕ ВТ_ИтоговаяТаблица.ВидУслуги = ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.ОсновнойДолг))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИтоговаяДоходыРасходы.ВидДоходов КАК ВидДоходов,
	|	ВТ_ИтоговаяДоходыРасходы.РасчетнаяДатаЗавершенияПеревозки КАК РасчетнаяДатаЗавершенияПеревозки,
	|	ВТ_ИтоговаяДоходыРасходы.ИдентификаторСтрокиДохода КАК ИдентификаторСтрокиДохода,
	|	ВТ_ИтоговаяДоходыРасходы.ИдентификаторСтрокиРасхода КАК ИдентификаторСтрокиРасхода,
	|	ВТ_ИтоговаяДоходыРасходы.ИдентификаторСтрокиСУЕ КАК ИдентификаторСтрокиСУЕ,
	|	ВТ_ИтоговаяДоходыРасходы.ЕстьЭкономика КАК ЕстьЭкономика,
	|	ВТ_ИтоговаяДоходыРасходы.ГотовоКВыставлению КАК ГотовоКВыставлению,
	|	ВТ_ИтоговаяДоходыРасходы.Услуга КАК Услуга,
	|	ВТ_ИтоговаяДоходыРасходы.ВыставленныйДокумент КАК ВыставленныйДокумент,
	|	ВТ_ИтоговаяДоходыРасходы.НеВыставлятьКлиенту КАК НеВыставлятьКлиенту,
	|	ВТ_ИтоговаяДоходыРасходы.Услуга1 КАК Услуга1,
	|	ВТ_ИтоговаяДоходыРасходы.УчДокументРасход КАК УчДокументРасход,
	//|	ВЫБОР
	//|		КОГДА ВТ_ИтоговаяДоходыРасходы.НеВыставлятьКлиенту
	//|				И НЕ ВТ_ИтоговаяДоходыРасходы.УчДокументРасход.Ссылка ЕСТЬ NULL
	//|				И ВТ_ИтоговаяДоходыРасходы.ДоходыИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ПроизвольнаяУслугаВручную)
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ КАК НеобходимоОтвязатьАкцептыОтСделки
	//ДИТ, Беляев СЮ, US 84896/ TA 85068, 13-05-2024, начало
	//1) в случае проставления признака «Не выст.кл.» у строк созданных вручную расходы НЕ отвязывались автоматически. 
	//	Такие расходы будут фигурировать в отчёт по причинам НЗП с причиной «Вручную выключена доходная строка», в зоне ответственности Отдела по формированию первичной документации. 
	//	Комментарий - требует доработки, т.к. сейчас расходы отвязываются в неуреги. 
	//2) в случае удаления дох.строки, с привязанными факт.расходами - отвязка расходов в неуреги происходит автоматически. 
	//	Причина отключения в отчёте по неурегам будет «Удаление доходной строки». Комментарий . - требуется доп. проверить, т.к. по рез-там эксперимента с админ. правами работает как и ожидается. 
	|	ВЫБОР
	|		КОГДА ВТ_ИтоговаяДоходыРасходы.ИдентификаторСтрокиДохода = """"
	//|				И НЕ ВТ_ИтоговаяДоходыРасходы.УчДокументРасход.Ссылка ЕСТЬ NULL
	|				И ВТ_ИтоговаяДоходыРасходы.РасходыУслугаОтключена
	|				И ВТ_ИтоговаяДоходыРасходы.РасходыПричинаОтключенияСтроки = ЗНАЧЕНИЕ(Перечисление.ПричиныОтключенияСтрокиРасходовСделки.УдалениеДоходнойСтроки)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НеобходимоОтвязатьАкцептыОтСделки
	//ДИТ, Беляев СЮ, US 84896/ TA 85068, 13-05-2024, конец
	|ПОМЕСТИТЬ ВТ_ИтоговаяДоходыРасходы_Расш
	|ИЗ
	|	ВТ_ИтоговаяДоходыРасходы КАК ВТ_ИтоговаяДоходыРасходы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СделкаДоходы.УслугаВнеСтавки, ЛОЖЬ) = ЛОЖЬ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.ОсновнойДолг)
	|		КОГДА ЕСТЬNULL(СделкаРасходы.Перевыставляемая, ЛОЖЬ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.ДопУслугаВР)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.ДопУслуга)
	|	КОНЕЦ,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	СделкаСвязьДоходовИРасходов.Доходы,
	|	СделкаСвязьДоходовИРасходов.Расходы,
	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц,
	|	ВЫБОР
	|		КОГДА СделкаСвязьДоходовИРасходов.Доходы = """"
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	СделкаСвязьУчетныхЕдиниц.ГотовоКВыставлению,
	|	ЕСТЬNULL(СделкаДоходы.Услуга, СделкаРасходы.Услуга),
	|	ВЫБОР
	|		КОГДА ИсторияКорректировокРеализаций.КорректируемыйДокумент ЕСТЬ NULL
	|			ТОГДА СделкаДоходы.УчДокумент
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	СделкаДоходы.НеВыставлятьКлиенту,
	|	СделкаРасходы.Услуга,
	|	NULL,
	//|	ВЫБОР
	//|		КОГДА СделкаДоходы.НеВыставлятьКлиенту
	//|				И НЕ СделкаРасходы.УчДокумент.Ссылка ЕСТЬ NULL
	//|				И СделкаДоходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ПроизвольнаяУслугаВручную)
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ
	//ДИТ, Беляев СЮ, US 84896/ TA 85068, 13-05-2024, начало
	//1) в случае проставления признака «Не выст.кл.» у строк созданных вручную расходы НЕ отвязывались автоматически. 
	//	Такие расходы будут фигурировать в отчёт по причинам НЗП с причиной «Вручную выключена доходная строка», в зоне ответственности Отдела по формированию первичной документации. 
	//	Комментарий - требует доработки, т.к. сейчас расходы отвязываются в неуреги. 
	//2) в случае удаления дох.строки, с привязанными факт.расходами - отвязка расходов в неуреги происходит автоматически. 
	//	Причина отключения в отчёте по неурегам будет «Удаление доходной строки». Комментарий . - требуется доп. проверить, т.к. по рез-там эксперимента с админ. правами работает как и ожидается. 
	|	ЛОЖЬ
	//ДИТ, Беляев СЮ, US 84896/ TA 85068, 13-05-2024, конец
	|ИЗ
	|	Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговаяДоходыРасходы КАК ВТ_ИтоговаяДоходыРасходы
	|		ПО СделкаСвязьДоходовИРасходов.Ссылка = ВТ_ИтоговаяДоходыРасходы.Сделка
	|			И СделкаСвязьДоходовИРасходов.Расходы = ВТ_ИтоговаяДоходыРасходы.ИдентификаторСтрокиРасхода
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|		ПО СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц = СделкаСвязьУчетныхЕдиниц.ГУИД
	|			И СделкаСвязьДоходовИРасходов.Ссылка = СделкаСвязьУчетныхЕдиниц.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы
	|		ПО СделкаСвязьДоходовИРасходов.Расходы = СделкаРасходы.ГУИД
	|			И СделкаСвязьДоходовИРасходов.Ссылка = СделкаРасходы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияКорректировокРеализаций КАК ИсторияКорректировокРеализаций
	|			ПО СделкаДоходы.УчДокумент = ИсторияКорректировокРеализаций.КорректируемыйДокумент
	|				И (ИсторияКорректировокРеализаций.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование))
	|		ПО СделкаСвязьДоходовИРасходов.Доходы = СделкаДоходы.ГУИД
	|			И СделкаСвязьДоходовИРасходов.Ссылка = СделкаДоходы.Ссылка
	|ГДЕ
	|	СделкаСвязьДоходовИРасходов.Ссылка = &Ссылка
	|	И ВТ_ИтоговаяДоходыРасходы.ИдентификаторСтрокиРасхода ЕСТЬ NULL
	|	И НЕ СделкаСвязьДоходовИРасходов.Доходы = """"
	|	И НЕ СделкаСвязьДоходовИРасходов.Расходы = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ИтоговаяДоходыРасходы_Расш.ИдентификаторСтрокиСУЕ КАК ИдентификаторСтрокиСУЕ,
	|	ВТ_ИтоговаяДоходыРасходы_Расш.ИдентификаторСтрокиДохода КАК ИдентификаторСтрокиДохода
	|ПОМЕСТИТЬ ВТ_СУЕ_С_ДублямиУслуг
	|ИЗ
	|	ВТ_ИтоговаяДоходыРасходы_Расш КАК ВТ_ИтоговаяДоходыРасходы_Расш
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИтоговаяДоходыРасходы_Расш КАК ВТ_ИтоговаяДоходыРасходы_Расш1
	|		ПО ВТ_ИтоговаяДоходыРасходы_Расш.Услуга = ВТ_ИтоговаяДоходыРасходы_Расш1.Услуга
	|			И ВТ_ИтоговаяДоходыРасходы_Расш.ИдентификаторСтрокиСУЕ = ВТ_ИтоговаяДоходыРасходы_Расш1.ИдентификаторСтрокиСУЕ
	|			И ВТ_ИтоговаяДоходыРасходы_Расш.ИдентификаторСтрокиДохода <> ВТ_ИтоговаяДоходыРасходы_Расш1.ИдентификаторСтрокиДохода
	|			И (ВТ_ИтоговаяДоходыРасходы_Расш.ИдентификаторСтрокиДохода <> """")
	|			И (ВТ_ИтоговаяДоходыРасходы_Расш1.ИдентификаторСтрокиДохода <> """")
	|			И (ВТ_ИтоговаяДоходыРасходы_Расш1.ВыставленныйДокумент <> ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка))
	|ГДЕ
	|	ВТ_ИтоговаяДоходыРасходы_Расш.Услуга = ВТ_ИтоговаяДоходыРасходы_Расш.Услуга1
	|	И ВТ_ИтоговаяДоходыРасходы_Расш.НеВыставлятьКлиенту
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ИтоговаяДоходыРасходы_Расш.ВидДоходов КАК ВидДоходов,
	|	МАКСИМУМ(ВТ_ИтоговаяДоходыРасходы_Расш.РасчетнаяДатаЗавершенияПеревозки) КАК РасчетнаяДатаЗавершенияПеревозки,
	|	ВТ_ИтоговаяДоходыРасходы_Расш.ИдентификаторСтрокиДохода КАК ИдентификаторСтрокиДохода,
	|	ВТ_ИтоговаяДоходыРасходы_Расш.ИдентификаторСтрокиРасхода КАК ИдентификаторСтрокиРасхода,
	|	ВТ_ИтоговаяДоходыРасходы_Расш.ИдентификаторСтрокиСУЕ КАК ИдентификаторСтрокиСУЕ,
	|	ВТ_ИтоговаяДоходыРасходы_Расш.ЕстьЭкономика КАК ЕстьЭкономика,
	|	ВТ_ИтоговаяДоходыРасходы_Расш.ГотовоКВыставлению КАК ГотовоКВыставлению,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СУЕ_С_ДублямиУслуг.ИдентификаторСтрокиСУЕ, """") = """"
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ДубльДоходнойСтроки,
	|	ВТ_ИтоговаяДоходыРасходы_Расш.ВыставленныйДокумент КАК ВыставленныйДокумент,
	|	ВТ_ИтоговаяДоходыРасходы_Расш.НеВыставлятьКлиенту КАК НеВыставлятьКлиенту,
	|	ВТ_ИтоговаяДоходыРасходы_Расш.НеобходимоОтвязатьАкцептыОтСделки КАК НеобходимоОтвязатьАкцептыОтСделки
	|ИЗ
	|	ВТ_ИтоговаяДоходыРасходы_Расш КАК ВТ_ИтоговаяДоходыРасходы_Расш
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СУЕ_С_ДублямиУслуг КАК ВТ_СУЕ_С_ДублямиУслуг
	|		ПО ВТ_ИтоговаяДоходыРасходы_Расш.ИдентификаторСтрокиСУЕ = ВТ_СУЕ_С_ДублямиУслуг.ИдентификаторСтрокиСУЕ
	|			И ВТ_ИтоговаяДоходыРасходы_Расш.ИдентификаторСтрокиДохода = ВТ_СУЕ_С_ДублямиУслуг.ИдентификаторСтрокиДохода
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИтоговаяДоходыРасходы_Расш.ИдентификаторСтрокиДохода,
	|	ВТ_ИтоговаяДоходыРасходы_Расш.ИдентификаторСтрокиРасхода,
	|	ВТ_ИтоговаяДоходыРасходы_Расш.ИдентификаторСтрокиСУЕ,
	|	ВТ_ИтоговаяДоходыРасходы_Расш.ВидДоходов,
	|	ВТ_ИтоговаяДоходыРасходы_Расш.ЕстьЭкономика,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СУЕ_С_ДублямиУслуг.ИдентификаторСтрокиСУЕ, """") = """"
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ВТ_ИтоговаяДоходыРасходы_Расш.ВыставленныйДокумент,
	|	ВТ_ИтоговаяДоходыРасходы_Расш.ГотовоКВыставлению,
	|	ВТ_ИтоговаяДоходыРасходы_Расш.НеВыставлятьКлиенту,
	|	ВТ_ИтоговаяДоходыРасходы_Расш.НеобходимоОтвязатьАкцептыОтСделки";
	Запрос.УстановитьПараметр("ИтоговаяТаблица", ТаблицаПлановыхДоходов);
	Запрос.УстановитьПараметр("Ссылка", ОбъектСделка.Ссылка);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ПлановыеДоходы = ОбъектСделка.Движения.ПлановыеДоходыВО;
	ПлановыеДоходы.Записывать = Истина;		
	
	ПлановыеДоходы.Загрузить(РезультатыЗапроса[1].Выгрузить());
	
	ДоходыРасходы = ОбъектСделка.Движения.ДоходыРасходы;
	ДоходыРасходы.Записывать = Истина;
	ДоходыРасходы.Загрузить(РезультатыЗапроса[РезультатыЗапроса.Количество()-1].Выгрузить());
	
КонецПроцедуры

Функция Сделка_ПолучитьТекстЗапросаПлановыеДоходыВО()
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	|	КлючиАналитикиСоставаПоезда.ДатаОтправления КАК ДатаОтправления,
	|	КлючиАналитикиСоставаПоезда.ДатаПрибытия КАК ДатаПрибытия,
	|	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТДатыОтправленияПрибытия
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиСоставаПоезда КАК КлючиАналитикиСоставаПоезда
	|		ПО СделкаСвязьУчетныхЕдиниц.КлючАналитикиСоставаПоезда = КлючиАналитикиСоставаПоезда.Ссылка
	|			И (СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка)
	|			И (НЕ СделкаСвязьУчетныхЕдиниц.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка))
	|			И (НЕ СделкаСвязьУчетныхЕдиниц.ОтключитьРасходы)
	|			И (НЕ СделкаСвязьУчетныхЕдиниц.Удалена)
	|			И (НЕ СделкаСвязьУчетныхЕдиниц.НеАктивна)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаРейсы.Ссылка КАК Ссылка,
	|	МИНИМУМ(СделкаРейсы.Рейс.ДатаОтправления) КАК ДатаОтправления,
	|	МАКСИМУМ(СделкаРейсы.Рейс.ДатаПрибытия) КАК ДатаПрибытия,
	|	МИНИМУМ(СделкаРейсы.Рейс.ДатаПрибытия) КАК МинимальнаяДатаПрибытия,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА СделкаРейсы.Рейс ССЫЛКА Справочник.РейсыЖД
	|				ТОГДА СделкаРейсы.Рейс.ДатаОтправления
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК ДатаОтправленияЖД,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СделкаРейсы.Рейс ССЫЛКА Справочник.РейсыЖД
	|				ТОГДА СделкаРейсы.Рейс.ДатаПрибытия
	|			ИНАЧЕ &ПустаяДата
	|		КОНЕЦ) КАК ДатаПрибытияЖД,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА СделкаРейсы.Рейс ССЫЛКА Справочник.РейсыМоре
	|				ТОГДА СделкаРейсы.Рейс.ДатаОтправления
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК ДатаОтправленияМоре,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СделкаРейсы.Рейс ССЫЛКА Справочник.РейсыМоре
	|				ТОГДА СделкаРейсы.Рейс.ДатаПрибытия
	|			ИНАЧЕ &ПустаяДата
	|		КОНЕЦ) КАК ДатаПрибытияМоре,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СделкаРейсы.Рейс) КАК КоличествоРейсовВСделке,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	|			КОГДА СделкаРейсы.Рейс ССЫЛКА Справочник.РейсыЖД
	|				ТОГДА СделкаРейсы.Рейс
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК КоличествоЖДРейсовВСделке,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	|			КОГДА СделкаРейсы.Рейс ССЫЛКА Справочник.РейсыМоре
	|				ТОГДА СделкаРейсы.Рейс
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК КоличествоМорскихРейсовВСделке,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СделкаРейсы.Рейс ССЫЛКА Справочник.РейсыЖД
	|				ТОГДА СделкаРейсы.Рейс
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК ЖДРейс,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СделкаРейсы.Рейс ССЫЛКА Справочник.РейсыМоре
	|				ТОГДА СделкаРейсы.Рейс
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК МорскойРейс
	|ПОМЕСТИТЬ ПлановыеДатыРейсов
	|ИЗ
	|	Документ.Сделка.Рейсы КАК СделкаРейсы
	|ГДЕ
	|	СделкаРейсы.Ссылка = &Ссылка
	|	И НЕ СделкаРейсы.Рейс.ДатаОтправления ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	СделкаРейсы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СделкаСвязьДоходовИРасходов.Доходы КАК Доходы,
	|	СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц
	|ПОМЕСТИТЬ ВТ_СвязьДоходовИРасходов
	|ИЗ
	|	Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|ГДЕ
	|	СделкаСвязьДоходовИРасходов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СвязьДоходовИРасходов.СвязьУчетныхЕдиниц КАК ГУИД_СУЕ,
	|	СделкаДоходы.Услуга КАК Услуга,
	|	СделкаДоходы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СделкаДоходы.ГУИД КАК ГУИД_Доходы,
	|	ВЫБОР
	|		КОГДА ИсторияКорректировокРеализаций.КорректируемыйДокумент ЕСТЬ NULL
	|			ТОГДА СделкаДоходы.УчДокумент
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК УчетныйДокумент,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СделкаДоходы.УчДокумент.Проведен, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(СделкаДоходы.КорректировкаДокумента.Проведен, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(СделкаДоходы.КорректировкаВознаграждения.Проведен, ЛОЖЬ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК УчетныйДокументПроведен,
	|	СделкаДоходы.Клиент КАК Клиент,
	|	СделкаДоходы.Договор КАК Договор,
	|	СделкаДоходы.ПСЦ КАК ПСЦ,
	|	СделкаДоходы.Калькуляция КАК Калькуляция,
	|	СделкаДоходы.ДоплатныеКТК КАК ДоплатныеКТК,
	|	СделкаДоходы.НеВыставлятьКлиенту КАК НеВыставлятьКлиенту,
	|	СделкаДоходы.ДатаОказанияУслуги КАК ДатаОказанияУслуги,
	|	СделкаДоходы.Ссылка КАК Ссылка,
	|	СделкаДоходы.УслугаВнеСтавки КАК УслугаВнеСтавки,
	|	СделкаДоходы.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики
	|ПОМЕСТИТЬ ВТ_Доходы_СУЕ
	|ИЗ
	|	Документ.Сделка.Доходы КАК СделкаДоходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвязьДоходовИРасходов КАК ВТ_СвязьДоходовИРасходов
	|		ПО СделкаДоходы.ГУИД = ВТ_СвязьДоходовИРасходов.Доходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияКорректировокРеализаций КАК ИсторияКорректировокРеализаций
	|		ПО СделкаДоходы.УчДокумент = ИсторияКорректировокРеализаций.КорректируемыйДокумент
	|			И (ИсторияКорректировокРеализаций.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование))
	|ГДЕ
	|	СделкаДоходы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Доходы_СУЕ.УчетныйДокумент КАК УчетныйДокумент,
	|	ЕСТЬNULL(РазрешениеВводаКорректировокСрезПоследних.РазрешенаКорректировка, ЛОЖЬ)
	|		ИЛИ ЕСТЬNULL(РазрешениеВводаКорректировокСрезПоследних.РазрешеноИсправление, ЛОЖЬ)
	|		ИЛИ ЕСТЬNULL(РазрешениеВводаКорректировокСрезПоследних.РазрешеноАннулирование, ЛОЖЬ) КАК ИзмененияРазрешены,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РазрешениеВводаКорректировокСрезПоследних.РазрешенаКорректировка, ЛОЖЬ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)
	|		КОГДА ЕСТЬNULL(РазрешениеВводаКорректировокСрезПоследних.РазрешеноИсправление, ЛОЖЬ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки)
	|		КОГДА ЕСТЬNULL(РазрешениеВводаКорректировокСрезПоследних.РазрешеноАннулирование, ЛОЖЬ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ПустаяСсылка)
	|	КОНЕЦ КАК ОжидаемыйДокумент
	|ПОМЕСТИТЬ втРазрешениеИзменений
	|ИЗ
	|	ВТ_Доходы_СУЕ КАК ВТ_Доходы_СУЕ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазрешениеВводаКорректировок.СрезПоследних(, ) КАК РазрешениеВводаКорректировокСрезПоследних
	|		ПО ВТ_Доходы_СУЕ.УчетныйДокумент = РазрешениеВводаКорректировокСрезПоследних.ОбъектКорректировки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.ГотовоКВыставлению КАК ГотовоКВыставлению,
	|	СделкаСвязьУчетныхЕдиниц.Клиент КАК Клиент,
	|	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Ссылка,
	|	СделкаСвязьУчетныхЕдиниц.Протокол КАК Протокол,
	|	СделкаСвязьУчетныхЕдиниц.Ссылка.Организация КАК Организация,
	|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	|	СделкаСвязьУчетныхЕдиниц.Вагон КАК Вагон,
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	|	СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения,
	|	СделкаСвязьУчетныхЕдиниц.Контейнер.ТипТЕ.РазмерКТК КАК РазмерКТК,
	|	СделкаСвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция,
	|	СделкаСвязьУчетныхЕдиниц.Калькуляция.ФрахтИмпорт КАК КалькуляцияФрахтИмпорт,
	|	ВЫБОР
	|		КОГДА СделкаСвязьУчетныхЕдиниц.Калькуляция.ПС_ВидПеревозки В (&ВидыПеревозкиЭкспорт)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Экспорт,
	|	СделкаСвязьУчетныхЕдиниц.Калькуляция.ПС_ВидПеревозки КАК ВидПеревозки,
	|	СделкаСвязьУчетныхЕдиниц.СчетЖД КАК СчетЖД,
	|	СделкаСвязьУчетныхЕдиниц.СчетФрахт КАК СчетФрахт,
	|	СделкаСвязьУчетныхЕдиниц.Коносамент КАК Коносамент,
	|	СделкаСвязьУчетныхЕдиниц.Коносамент.СтанцияОтправления КАК КоносаментСтанцияОтправления,
	|	СделкаСвязьУчетныхЕдиниц.Коносамент.СтанцияНазначения КАК КоносаментСтанцияНазначения,
	|	СделкаСвязьУчетныхЕдиниц.ПортОтправления КАК ПортОтправления,
	|	СделкаСвязьУчетныхЕдиниц.ПортНазначения КАК ПортНазначения,
	|	СделкаСвязьУчетныхЕдиниц.Коносамент.ДоговорКонтрагента КАК КоносаментДоговор,
	|	ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.Коносамент.ДатаТранспортногоДокумента, &ПустаяДата) КАК КоносаментДатаТранспортногоДокумента,
	|	ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.Коносамент.ДатаОтправления, &ПустаяДата) КАК ДатаОтправленияКоносамент,
	|	СделкаСвязьУчетныхЕдиниц.Коносамент.ДатаПрибытия КАК ДатаПрибытияКоносамент,
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|	СделкаСвязьУчетныхЕдиниц.СобственностьПеревозимогоКТК КАК СобственностьПеревозимогоКТК,
	//ок)
	|	СделкаСвязьУчетныхЕдиниц.УдалитьСобственностьПеревозимогоКТК КАК УдалитьСобственностьПеревозимогоКТК,
	|	СделкаСвязьУчетныхЕдиниц.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|	ВЫБОР
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|		КОГДА СделкаСвязьУчетныхЕдиниц.СобственностьПеревозимогоКТК = ЗНАЧЕНИЕ(Перечисление.СобственностьПеревозимогоКонтейнера.SOC)
	//ок)
	|		КОГДА СделкаСвязьУчетныхЕдиниц.ПринадлежностьТЕ = ЗНАЧЕНИЕ(Перечисление.ПринадлежностьТЕ.КТКлиента)
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|			ТОГДА ""SOC""
	|		ИНАЧЕ ""COC""
	|	КОНЕЦ КАК СобственностьПеревозимогоКТКСтрокой,
	|	ВЫБОР
	|		КОГДА СделкаСвязьУчетныхЕдиниц.Калькуляция.ФрахтИмпорт
	|			ТОГДА СделкаСвязьУчетныхЕдиниц.Коносамент.СтанцияОтправления
	|		ИНАЧЕ СделкаСвязьУчетныхЕдиниц.Коносамент.СтанцияНазначения
	|	КОНЕЦ КАК ПортДляКалькуляции,
	|	СделкаСвязьУчетныхЕдиниц.Ссылка.ЦФО КАК ЦФО,
	|	СделкаСвязьУчетныхЕдиниц.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море)
	|			ТОГДА ЕСТЬNULL(СделкаСвязьУчетныхЕдиницЖД.ЖДН.ДатаОтправления, ДАТАВРЕМЯ(1, 1, 1))
	|		ИНАЧЕ ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.ЖДН.ДатаОтправления, ДАТАВРЕМЯ(1, 1, 1))
	|	КОНЕЦ КАК ДатаОтправленияЖД,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН.ДатаРаскредитации КАК ДатаРаскредитацииЖД,
	|	СделкаСвязьУчетныхЕдиниц.ДатаФактическогоПредоставленияПС КАК ДатаФактическогоПредоставленияПС,
	|	СделкаСвязьУчетныхЕдиниц.Ссылка.ПовагонныеОтправки КАК ПовагонныеОтправки,
	|	КлючиАналитикиСоставаПоезда.ДатаПодачиАвтоПодВыгрузку КАК ДатаПодачиАвтоПодВыгрузку,
	|	КлючиАналитикиСоставаПоезда.ДатаПрибытия КАК ДатаПрибытия,
	|	КлючиАналитикиСоставаПоезда.ДатаОтправления КАК ДатаОтправления,
	|	СделкаСвязьУчетныхЕдиниц.УсловияПеревозкиНазначение КАК УсловияПеревозкиНазначение,
	|	СделкаСвязьУчетныхЕдиниц.Заявка.Отправка КАК ДатаОтправленияЗаявки,
	|	СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки,
	|	ВЫБОР
	|		КОГДА СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море)
	|			ТОГДА СделкаСвязьУчетныхЕдиницЖД.ЖДН
	|		ИНАЧЕ СделкаСвязьУчетныхЕдиниц.ЖДН
	|	КОНЕЦ КАК ЖДН,
	|	ВЫБОР
	|		КОГДА НЕ СделкаСвязьУчетныхЕдиницЖД.ВидТранспортногоСообщения ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьЖД,
	|	ЕСТЬNULL(ФФД_СчетФрахт.Документ, ЕСТЬNULL(ФФД_СчетЖД.Документ, ФФД_Правило.Документ)) КАК ДокументФФД,
	|	ВЫБОР
	|		КОГДА СделкаСвязьУчетныхЕдиниц.Клиент = &КонтрагентДКП
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КонтрагентДКП,
	|	СделкаСвязьУчетныхЕдиниц.МорскойРейс КАК МорскойРейс,
	|	СделкаСвязьУчетныхЕдиниц.МорскойРейс.ДатаОтправления КАК МорскойРейсДатаОтправления,
	|	СделкаСвязьУчетныхЕдиниц.МорскойРейс.ДатаПрибытия КАК МорскойРейсДатаПрибытия,
	|	ЕСТЬNULL(СделкаСвязьУчетныхЕдиницЖД.ЖДРейс, СделкаСвязьУчетныхЕдиниц.ЖДРейс) КАК ЖДРейс,
	|	ЕСТЬNULL(СделкаСвязьУчетныхЕдиницЖД.ЖДРейс.ДатаОтправления, СделкаСвязьУчетныхЕдиниц.ЖДРейс.ДатаОтправления) КАК ЖДРейсДатаОтправления,
	|	ЕСТЬNULL(СделкаСвязьУчетныхЕдиницЖД.ЖДРейс.ДатаПрибытия, СделкаСвязьУчетныхЕдиниц.ЖДРейс.ДатаПрибытия) КАК ЖДРейсДатаПрибытия,
	|	СделкаСвязьУчетныхЕдиниц.Заявка КАК Заявка,
	|	ВЫБОР
	|		КОГДА СделкаСостояния.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтапов.Выполнен)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОсновнаяУслугаВыставлена
	|ПОМЕСТИТЬ ВТ_СвязьУчетныхЕдиниц
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиницЖД
	|		ПО (СделкаСвязьУчетныхЕдиницЖД.Ссылка = &Ссылка)
	|			И СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки = СделкаСвязьУчетныхЕдиницЖД.ГУИДСтрокиЗаявки
	|			И СделкаСвязьУчетныхЕдиниц.Контейнер = СделкаСвязьУчетныхЕдиницЖД.Контейнер
	|			И (ВЫБОР
	|				КОГДА СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ЖД)
	|					ТОГДА СделкаСвязьУчетныхЕдиниц.Вагон = СделкаСвязьУчетныхЕдиницЖД.Вагон
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (СделкаСвязьУчетныхЕдиницЖД.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ЖД))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиСоставаПоезда КАК КлючиАналитикиСоставаПоезда
	|		ПО СделкаСвязьУчетныхЕдиниц.КлючАналитикиСоставаПоезда = КлючиАналитикиСоставаПоезда.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФормированиеФинДокументов КАК ФормированиеФинДокументов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФормированиеФинДокументов КАК ФФД_Правило
	|			ПО ФормированиеФинДокументов.Ссылка = ФФД_Правило.Документ
	|		ПО СделкаСвязьУчетныхЕдиниц.Клиент = ФормированиеФинДокументов.Контрагент
	|			И (ВЫБОР
	|				КОГДА СделкаСвязьУчетныхЕдиниц.Ссылка.ПовагонныеОтправки
	|					ТОГДА ФормированиеФинДокументов.ПравилоДляПовагонныхОтправок
	|				ИНАЧЕ ФормированиеФинДокументов.ВидПеревозки = СделкаСвязьУчетныхЕдиниц.Калькуляция.ПС_ВидПеревозки
	|						И НЕ ФормированиеФинДокументов.ПравилоДляПовагонныхОтправок
	|			КОНЕЦ)
	|			И (ФормированиеФинДокументов.ПометкаУдаления = ЛОЖЬ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФормированиеФинДокументов КАК ФФД_СчетЖД
	|		ПО СделкаСвязьУчетныхЕдиниц.СчетЖД = ФФД_СчетЖД.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФормированиеФинДокументов КАК ФФД_СчетФрахт
	|		ПО СделкаСвязьУчетныхЕдиниц.СчетФрахт = ФФД_СчетФрахт.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Состояния КАК СделкаСостояния
	|		ПО СделкаСвязьУчетныхЕдиниц.Ссылка = СделкаСостояния.Ссылка
	|			И СделкаСвязьУчетныхЕдиниц.ЗадачаГотовностиКВыставлению = СделкаСостояния.Состояние
	|ГДЕ
	|	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
	|	И НЕ СделкаСвязьУчетныхЕдиниц.ОтключитьКонтрольВыполненияЗадачи
	|	И НЕ СделкаСвязьУчетныхЕдиниц.Удалена
	|	И НЕ СделкаСвязьУчетныхЕдиниц.НеАктивна
	|	И НЕ СделкаСвязьУчетныхЕдиниц.ОтключитьРасходы
	|	И СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Доходы_СУЕ.ГУИД_СУЕ КАК ГУИД_СУЕ,
	|	ВТ_Доходы_СУЕ.Услуга КАК Услуга,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВТ_Доходы_СУЕ.УчетныйДокументПроведен
	|						И втРазрешениеИзменений.ИзмененияРазрешены = ЛОЖЬ
	|					ИЛИ ВЫБОР
	|						КОГДА НЕ СделкаДоходы.КорректировкаДокумента ЕСТЬ NULL
	|							ТОГДА ЕСТЬNULL(СделкаДоходы.КорректировкаДокумента.Проведен, ЛОЖЬ)
	|									ИЛИ ЕСТЬNULL(СделкаДоходы.КорректировкаВознаграждения.Проведен, ЛОЖЬ)
	|						ИНАЧЕ ЛОЖЬ
	|					КОНЕЦ
	|					ИЛИ ВТ_Доходы_СУЕ.НеВыставлятьКлиенту
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК СформированыЗакрывающиеДокументы,
	|	МАКСИМУМ(втРазрешениеИзменений.ОжидаемыйДокумент) КАК ОжидаемыйДокумент,
	|	ВТ_Доходы_СУЕ.Клиент КАК Клиент,
	|	ВТ_Доходы_СУЕ.Договор КАК Договор,
	|	СвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	|	ВТ_Доходы_СУЕ.Калькуляция КАК Калькуляция,
	|	ВТ_Доходы_СУЕ.ПСЦ КАК Протокол,
	|	ВТ_Доходы_СУЕ.ГУИД_Доходы КАК ГУИД_Доходы,
	|	ВТ_Доходы_СУЕ.УчетныйДокумент КАК УчДокумент,
	|	ВТ_Доходы_СУЕ.УслугаВнеСтавки КАК УслугаВнеСтавки,
	|	ВТ_Доходы_СУЕ.НеВыставлятьКлиенту КАК НеВыставлятьКлиенту,
	|	ВТ_Доходы_СУЕ.ИсточникПоявленияСтрокиЭкономики КАК ИсточникПоявленияСтрокиЭкономики
	|ПОМЕСТИТЬ ВыставленныеУслуги
	|ИЗ
	|	ВТ_Доходы_СУЕ КАК ВТ_Доходы_СУЕ
	|		ЛЕВОЕ СОЕДИНЕНИЕ втРазрешениеИзменений КАК втРазрешениеИзменений
	|		ПО ВТ_Доходы_СУЕ.УчетныйДокумент = втРазрешениеИзменений.УчетныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
	|		ПО ВТ_Доходы_СУЕ.ГУИД_Доходы = СделкаДоходы.ГУИДИсправляемойСтроки
	|			И ВТ_Доходы_СУЕ.Ссылка = СделкаДоходы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СвязьУчетныхЕдиниц
	|		ПО (СвязьУчетныхЕдиниц.Ссылка = &Ссылка)
	|			И ВТ_Доходы_СУЕ.ГУИД_СУЕ = СвязьУчетныхЕдиниц.ГУИД
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Доходы_СУЕ.ГУИД_СУЕ,
	|	ВТ_Доходы_СУЕ.Услуга,
	|	ВТ_Доходы_СУЕ.Клиент,
	|	ВТ_Доходы_СУЕ.Договор,
	|	СвязьУчетныхЕдиниц.Контейнер,
	|	ВТ_Доходы_СУЕ.Калькуляция,
	|	ВТ_Доходы_СУЕ.ПСЦ,
	|	ВТ_Доходы_СУЕ.ГУИД_Доходы,
	|	ВТ_Доходы_СУЕ.УчетныйДокумент,
	|	ВТ_Доходы_СУЕ.УслугаВнеСтавки,
	|	ВТ_Доходы_СУЕ.НеВыставлятьКлиенту,
	|	ВТ_Доходы_СУЕ.ИсточникПоявленияСтрокиЭкономики
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Доходы_СУЕ.ГУИД_Доходы КАК ГУИД_Доходы,
	|	ВТ_Доходы_СУЕ.Услуга КАК Услуга,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВТ_Доходы_СУЕ.УчетныйДокументПроведен
	|						И втРазрешениеИзменений.ИзмененияРазрешены = ЛОЖЬ
	|					ИЛИ ВЫБОР
	|						КОГДА НЕ СделкаДоходы.КорректировкаДокумента ЕСТЬ NULL
	|							ТОГДА ЕСТЬNULL(СделкаДоходы.КорректировкаДокумента.Проведен, ЛОЖЬ)
	|									ИЛИ ЕСТЬNULL(СделкаДоходы.КорректировкаВознаграждения.Проведен, ЛОЖЬ)
	|						ИНАЧЕ ЛОЖЬ
	|					КОНЕЦ
	|					ИЛИ ВТ_Доходы_СУЕ.НеВыставлятьКлиенту
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК СформированыЗакрывающиеДокументы,
	|	МАКСИМУМ(втРазрешениеИзменений.ОжидаемыйДокумент) КАК ОжидаемыйДокумент,
	|	ВТ_Доходы_СУЕ.Клиент КАК Клиент,
	|	ВТ_Доходы_СУЕ.Договор КАК Договор
	|ПОМЕСТИТЬ ВыставленныеУслугиВнеСтавки
	|ИЗ
	|	ВТ_Доходы_СУЕ КАК ВТ_Доходы_СУЕ
	|		ЛЕВОЕ СОЕДИНЕНИЕ втРазрешениеИзменений КАК втРазрешениеИзменений
	|		ПО ВТ_Доходы_СУЕ.УчетныйДокумент = втРазрешениеИзменений.УчетныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
	|		ПО ВТ_Доходы_СУЕ.ГУИД_Доходы = СделкаДоходы.ГУИДИсправляемойСтроки
	|			И ВТ_Доходы_СУЕ.Ссылка = СделкаДоходы.Ссылка
	|ГДЕ
	|	ВТ_Доходы_СУЕ.УслугаВнеСтавки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Доходы_СУЕ.ГУИД_Доходы,
	|	ВТ_Доходы_СУЕ.Услуга,
	|	ВТ_Доходы_СУЕ.Клиент,
	|	ВТ_Доходы_СУЕ.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.КоносаментСтанцияОтправления КАК КоносаментСтанцияОтправления,
	|	СделкаСвязьУчетныхЕдиниц.КоносаментСтанцияНазначения КАК КоносаментСтанцияНазначения,
	|	СделкаСвязьУчетныхЕдиниц.КоносаментДоговор КАК КоносаментДоговор,
	|	МАКСИМУМ(СделкаСвязьУчетныхЕдиниц.КоносаментДатаТранспортногоДокумента) КАК ДатаДокументаКоносаментаПоНаправлению,
	|	МАКСИМУМ(СделкаСвязьУчетныхЕдиниц.ДатаОтправленияКоносамент) КАК ДатаОтправленияКоносаментаПоНаправлению,
	|	МАКСИМУМ(СделкаСвязьУчетныхЕдиниц.ДатаПрибытияКоносамент) КАК ДатаПрибытияКоносаментаПоНаправлению
	|ПОМЕСТИТЬ ВТ_ДатыПоНаправлениям
	|ИЗ
	|	ВТ_СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|
	|СГРУППИРОВАТЬ ПО
	|	СделкаСвязьУчетныхЕдиниц.КоносаментСтанцияОтправления,
	|	СделкаСвязьУчетныхЕдиниц.КоносаментСтанцияНазначения,
	|	СделкаСвязьУчетныхЕдиниц.КоносаментДоговор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СделкаСвязьУчетныхЕдиниц.ГотовоКВыставлению КАК ГотовоКВыставлению,
	|	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Ссылка,
	|	СделкаСвязьУчетныхЕдиниц.Протокол КАК Протокол,
	|	СделкаСвязьУчетныхЕдиниц.Ссылка.Организация КАК Организация,
	|	СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	|	СделкаСвязьУчетныхЕдиниц.Вагон КАК Вагон,
	|	СделкаСвязьУчетныхЕдиниц.ГУИД КАК ГУИД,
	|	СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения,
	|	СделкаСвязьУчетныхЕдиниц.СчетЖД КАК СчетЖД,
	|	СделкаСвязьУчетныхЕдиниц.ЖДН КАК ЖДН,
	|	СделкаСвязьУчетныхЕдиниц.Калькуляция.ФрахтИмпорт КАК КалькуляцияФрахтИмпорт,
	|	СделкаСвязьУчетныхЕдиниц.Коносамент КАК Коносамент,
	|	СделкаСвязьУчетныхЕдиниц.Коносамент.СтанцияНазначения КАК КоносаментСтанцияНазначения,
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|	СделкаСвязьУчетныхЕдиниц.СобственностьПеревозимогоКТК КАК СобственностьПеревозимогоКТК,
	//ок)
	|	СделкаСвязьУчетныхЕдиниц.УдалитьСобственностьПеревозимогоКТК КАК УдалитьСобственностьПеревозимогоКТК,
	|	СделкаСвязьУчетныхЕдиниц.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|	ВЫБОР
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|		КОГДА СделкаСвязьУчетныхЕдиниц.СобственностьПеревозимогоКТК = ЗНАЧЕНИЕ(Перечисление.СобственностьПеревозимогоКонтейнера.SOC)
	//ок)
	|		КОГДА СделкаСвязьУчетныхЕдиниц.ПринадлежностьТЕ = ЗНАЧЕНИЕ(Перечисление.ПринадлежностьТЕ.КТКлиента)
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|			ТОГДА ""SOC""
	|		ИНАЧЕ ""COC""
	|	КОНЕЦ КАК СобственностьПеревозимогоКТКСтрокой,
	|	ВЫБОР
	|		КОГДА СделкаСвязьУчетныхЕдиниц.Калькуляция.ФрахтИмпорт
	|			ТОГДА СделкаСвязьУчетныхЕдиниц.Коносамент.СтанцияОтправления
	|		ИНАЧЕ СделкаСвязьУчетныхЕдиниц.Коносамент.СтанцияНазначения
	|	КОНЕЦ КАК ПортДляКалькуляции,
	|	СделкаСвязьУчетныхЕдиниц.РазмерКТК КАК Доплата_РазмерКТК,
	|	СделкаСвязьУчетныхЕдиниц.Доплата_Клиент КАК Доплата_Клиент,
	|	СделкаСвязьУчетныхЕдиниц.Доплата_Договор КАК Доплата_Договор,
	|	СделкаСвязьУчетныхЕдиниц.Доплата_ПСЦ КАК Доплата_ПСЦ,
	|	СделкаСвязьУчетныхЕдиниц.Доплата_Калькуляция КАК Доплата_Калькуляция,
	|	СделкаСвязьУчетныхЕдиниц.Доплата_Доплата КАК Доплата_Доплата,
	|	СделкаСвязьУчетныхЕдиниц.Доплата_Валюта КАК Доплата_Валюта,
	|	ВТ_Доходы_СУЕ.ГУИД_Доходы КАК ГУИД_Доходы,
	|	&УслугаДоплаты КАК Услуга,
	|	ВТ_Доходы_СУЕ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СделкаСвязьУчетныхЕдиниц.Ссылка.ЦФО КАК ЦФО,
	|	СделкаСвязьУчетныхЕдиниц.Договор КАК Договор,
	|	СделкаСвязьУчетныхЕдиниц.Доплата_Калькуляция.ПС_ВидПеревозки КАК ВидПеревозки,
	|	ВЫБОР
	|		КОГДА СделкаСвязьУчетныхЕдиниц.Доплата_Калькуляция = ЗНАЧЕНИЕ(Документ.Калькуляция.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЖелтаяДоплата,
	|	СделкаСвязьУчетныхЕдиниц.Заявка КАК Заявка
	|ПОМЕСТИТЬ ВТ_СУЕ_Доплатные
	|ИЗ
	|	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Доходы_СУЕ КАК ВТ_Доходы_СУЕ
	|		ПО СделкаСвязьУчетныхЕдиниц.ГУИД = ВТ_Доходы_СУЕ.ГУИД_СУЕ
	|			И СделкаСвязьУчетныхЕдиниц.Доплата_Калькуляция = ВТ_Доходы_СУЕ.Калькуляция
	|			И СделкаСвязьУчетныхЕдиниц.Доплата_ПСЦ = ВТ_Доходы_СУЕ.ПСЦ
	|			И (ВТ_Доходы_СУЕ.ДоплатныеКТК)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|		ПО СделкаСвязьУчетныхЕдиниц.Заявка = ЗаявкаСоставУслуги.Ссылка
	|			И СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки = ЗаявкаСоставУслуги.ГУИДСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВыставленныеУслуги КАК ВыставленныеУслуги
	|		ПО СделкаСвязьУчетныхЕдиниц.Контейнер = ВыставленныеУслуги.Контейнер
	|			И СделкаСвязьУчетныхЕдиниц.Доплата_Калькуляция = ВыставленныеУслуги.Калькуляция
	|			И СделкаСвязьУчетныхЕдиниц.Доплата_ПСЦ = ВыставленныеУслуги.Протокол
	|ГДЕ
	|	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
	|	И НЕ СделкаСвязьУчетныхЕдиниц.ОтключитьКонтрольВыполненияЗадачи
	|	И НЕ СделкаСвязьУчетныхЕдиниц.Удалена
	|	И НЕ СделкаСвязьУчетныхЕдиниц.НеАктивна
	|	И НЕ СделкаСвязьУчетныхЕдиниц.ОтключитьРасходы
	|	И СделкаСвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки <> """"
	|	И СделкаСвязьУчетныхЕдиниц.Доплата_Доплата <> 0
	|	И СделкаСвязьУчетныхЕдиниц.Доплата_Клиент <> &КонтрагентПустаяСсылка
	|	И НЕ ЕСТЬNULL(ВыставленныеУслуги.СформированыЗакрывающиеДокументы, ЛОЖЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_СвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция,
	//|	МАКСИМУМ(КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга) КАК ВыставляемаяУслуга
	//|ПОМЕСТИТЬ ВТ_ОсновныеУслугиКалькуляций
	//|ИЗ
	//|	ВТ_СвязьУчетныхЕдиниц КАК ВТ_СвязьУчетныхЕдиниц
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	//|		ПО ВТ_СвязьУчетныхЕдиниц.Калькуляция = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_СвязьУчетныхЕдиниц.Калькуляция
	//Евросиб(ДИТ), Беляев СЮ, BUG 92677 / TA 92679, 10-10-2024, начало
	|ВЫБРАТЬ
	|	ВТ_СвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция,
	|	МАКСИМУМ(
	|			ВЫБОР 
	|				КОГДА ДокументКалькуляция.ОсновнаяУслуга <> Значение(Справочник.Номенклатура.ПустаяСсылка) 
	|					ТОГДА ДокументКалькуляция.ОсновнаяУслуга
	|				 ИНАЧЕ 
	|					ЕстьNULL(КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга, Значение(Справочник.Номенклатура.ПустаяСсылка))
	|			КОНЕЦ
	|			) КАК ВыставляемаяУслуга
	|ПОМЕСТИТЬ ВТ_ОсновныеУслугиКалькуляций
	|ИЗ
	|	ВТ_СвязьУчетныхЕдиниц КАК ВТ_СвязьУчетныхЕдиниц
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция КАК ДокументКалькуляция
	|		ПО ВТ_СвязьУчетныхЕдиниц.Калькуляция = ДокументКалькуляция.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	|		ПО ВТ_СвязьУчетныхЕдиниц.Калькуляция = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СвязьУчетныхЕдиниц.Калькуляция
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(
	|			ВЫБОР КОГДА ДокументКалькуляция.ОсновнаяУслуга <> Значение(Справочник.Номенклатура.ПустаяСсылка) 
	|					ТОГДА ДокументКалькуляция.ОсновнаяУслуга
	|				  ИНАЧЕ 
	|					ЕстьNULL(КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга, Значение(Справочник.Номенклатура.ПустаяСсылка))
	|			КОНЕЦ
	|			) <> Значение(Справочник.Номенклатура.ПустаяСсылка)
	//Евросиб(ДИТ), Беляев СЮ, BUG 92677 / TA 92679, 10-10-2024, конец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Фрахт.РазмерКТК КАК РазмерКТК,
	|	ВЫБОР
	|		КОГДА ВТ_Фрахт.Контейнер.ТипТЕ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|			ТОГДА КалькуляцияНФ_ВыбранныеСтавки.Фрахт20
	|		ИНАЧЕ КалькуляцияНФ_ВыбранныеСтавки.Фрахт40
	|	КОНЕЦ КАК Ставка,
	|	ВЫБОР
	|		КОГДА ВТ_Фрахт.Контейнер.ТипТЕ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|			ТОГДА КалькуляцияНФ_ВыбранныеСтавки.Вознаграждение20
	|		ИНАЧЕ КалькуляцияНФ_ВыбранныеСтавки.Вознаграждение40
	|	КОНЕЦ КАК Вознаграждение,
	|	ВЫБОР
	|		КОГДА ВТ_Фрахт.Контейнер.ТипТЕ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|			ТОГДА КалькуляцияНФ_ВыбранныеСтавки.Итого20
	|		ИНАЧЕ КалькуляцияНФ_ВыбранныеСтавки.Итого40
	|	КОНЕЦ КАК Итого,
	|	КалькуляцияНФ_ВыбранныеСтавки.Ссылка КАК КалькуляцияФрахта,
	|	КалькуляцияНФ_ВыбранныеСтавки.Контрагент.Контрагент КАК Контрагент,
	|	КалькуляцияНФ_ВыбранныеСтавки.Валюта КАК Валюта,
	|	КалькуляцияНФ_ВыбранныеСтавки.Порт КАК Порт,
	|	ВТ_Фрахт.Коносамент КАК Коносамент,
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|	ВТ_Фрахт.СобственностьПеревозимогоКТК КАК СобственностьПеревозимогоКТК,
	//ок)
	|	ВТ_Фрахт.УдалитьСобственностьПеревозимогоКТК КАК УдалитьСобственностьПеревозимогоКТК,
	|	ВТ_Фрахт.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|	ВТ_Фрахт.ГУИД КАК ГУИД,
	|	ВТ_Фрахт.ГУИДСтрокиЗаявки КАК ГУИДСтрокиЗаявки
	|ПОМЕСТИТЬ ФрахтПоКалькуляции
	|ИЗ
	|	ВТ_СвязьУчетныхЕдиниц КАК ВТ_Фрахт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция.НФ_ВыбранныеСтавки КАК КалькуляцияНФ_ВыбранныеСтавки
	|		ПО ВТ_Фрахт.Калькуляция = КалькуляцияНФ_ВыбранныеСтавки.Ссылка
	|			И (ВЫБОР
	|				КОГДА ВТ_Фрахт.Калькуляция.ФрахтИмпорт
	|					ТОГДА ВТ_Фрахт.Коносамент.СтанцияОтправления = КалькуляцияНФ_ВыбранныеСтавки.Порт
	|				ИНАЧЕ ВТ_Фрахт.ПортНазначения = КалькуляцияНФ_ВыбранныеСтавки.Порт
	|						ИЛИ ВТ_Фрахт.Коносамент.СтанцияНазначения = КалькуляцияНФ_ВыбранныеСтавки.Порт
	|			КОНЕЦ)
	|			И (ВЫБОР
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|				КОГДА ВТ_Фрахт.СобственностьПеревозимогоКТК = ЗНАЧЕНИЕ(Перечисление.СобственностьПеревозимогоКонтейнера.SOC)
	//ок)
	|				КОГДА ВТ_Фрахт.ПринадлежностьТЕ = ЗНАЧЕНИЕ(Перечисление.ПринадлежностьТЕ.КТКлиента)
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|					ТОГДА ""SOC""
	|				ИНАЧЕ ""COC""
	|			КОНЕЦ = КалькуляцияНФ_ВыбранныеСтавки.SOCCOC)
	|ГДЕ
	|	(ВТ_Фрахт.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море)
	|			ИЛИ ВТ_Фрахт.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ПустаяСсылка))
	|	И (КалькуляцияНФ_ВыбранныеСтавки.Выбрано20
	|			ИЛИ КалькуляцияНФ_ВыбранныеСтавки.Выбрано40)
	|	И ВЫБОР
	|			КОГДА ВТ_Фрахт.Контейнер.ТипТЕ.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|				ТОГДА КалькуляцияНФ_ВыбранныеСтавки.Фрахт20
	|			ИНАЧЕ КалькуляцияНФ_ВыбранныеСтавки.Фрахт40
	|		КОНЕЦ > 0
	|	И НЕ ВТ_Фрахт.Коносамент = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СвязьУчетныхЕдиниц.ГУИД КАК ГУИД
	|ПОМЕСТИТЬ СУЕ_ДляУслугВнеСтавки
	|ИЗ
	|	ВТ_СвязьУчетныхЕдиниц КАК ВТ_СвязьУчетныхЕдиниц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СвязьУчетныхЕдиниц КАК ВТ_СвязьУчетныхЕдиниц1
	|		ПО ВТ_СвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки = ВТ_СвязьУчетныхЕдиниц1.ГУИДСтрокиЗаявки
	|			И (ВТ_СвязьУчетныхЕдиниц1.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ЖД))
	|ГДЕ
	|	(ВТ_СвязьУчетныхЕдиниц.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ПустаяСсылка)
	|			ИЛИ ВТ_СвязьУчетныхЕдиниц.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ЖД)
	|			ИЛИ ВТ_СвязьУчетныхЕдиниц1.ГУИД ЕСТЬ NULL)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""Основная услуга по калькуляции"" КАК ИсточникСтроки,
	|	ЛОЖЬ КАК УслугаВнеСтавки,
	|	ВЫБОР
	|		КОГДА КалькуляцияДокумент.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Доплатные)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДоплатныеКТК,
	|	ВТ_СвязьУчетныхЕдиниц.Ссылка.Дата КАК ДатаСделки,
	|	ВТ_СвязьУчетныхЕдиниц.ГотовоКВыставлению КАК ГотовоКВыставлению,
	|	ВТ_СвязьУчетныхЕдиниц.Клиент КАК Клиент,
	|	ВТ_СвязьУчетныхЕдиниц.Договор КАК Договор,
	|	ВТ_СвязьУчетныхЕдиниц.Договор.ПравилоФормированияДатыУслуги КАК ПравилоФормированияДатыУслуги,
	|	ВТ_СвязьУчетныхЕдиниц.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ВТ_СвязьУчетныхЕдиниц.СчетЖД.Проведен
	|			ТОГДА ВТ_СвязьУчетныхЕдиниц.СчетЖД
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК Счет,
	|	ВТ_СвязьУчетныхЕдиниц.Протокол КАК Протокол,
	|	ВТ_СвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция,
	|	ВТ_СвязьУчетныхЕдиниц.Организация КАК Организация,
	|	ВТ_СвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	|	ВТ_СвязьУчетныхЕдиниц.Вагон КАК Вагон,
	|	ВТ_СвязьУчетныхЕдиниц.ГУИД КАК ИдентификаторСУЕ,
	|	ВТ_СвязьУчетныхЕдиниц.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения,
	|	ВЫБОР
	|		КОГДА КалькуляцияДокумент.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Доплатные)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Доплата)
	|		КОГДА КалькуляцияДокумент.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Субсидии)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Субсидии)  
	//ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
	|		КОГДА КалькуляцияДокумент.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Премии)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Премии)
	//ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.ОсновнойДолг)
	|	КОНЕЦ КАК ВидУслуги,
	|	ВЫБОР
	|		КОГДА ВТ_СвязьУчетныхЕдиниц.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|			ТОГДА КалькуляцияДокумент.ММ_ИтогоСтавка20
	|		ИНАЧЕ КалькуляцияДокумент.ММ_ИтогоСтавка
	|	КОНЕЦ + ВЫБОР
	|		КОГДА ЕСТЬNULL(ПравилоФФД.ВидСтавки, ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидСтавки.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидСтавки.СквознаяСтавкаСушаФрахт1Строка)
	|			ТОГДА ЕСТЬNULL(ФрахтПоКалькуляции.Итого, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Ставка,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДоходов.Выручка) КАК ТипОперации,
	|	ВТ_ОсновныеУслугиКалькуляций.ВыставляемаяУслуга КАК Услуга,
	|	ВТ_СвязьУчетныхЕдиниц.ЦФО КАК ЦФО,
	|	КалькуляцияДокумент.Валюта КАК Валюта,
	|	КалькуляцияДокумент.СтавкаНДС КАК СтавкаНДС,
	|	КалькуляцияДокумент.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	NULL КАК ДатаОказанияУслуги,
	|	0 КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА КалькуляцияДокумент.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого)
	|				ИЛИ КалькуляцияДокумент.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПССТарифом)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.Вагон)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.Ктк)
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	КалькуляцияДокумент.ТипКалькуляции КАК ТипКалькуляции,
	|	ВТ_СвязьУчетныхЕдиниц.ВидПеревозки КАК ВидПеревозки,
	|	"""" КАК ГУИД_Доходы,
	|	ЛОЖЬ КАК ЖелтаяДоплата,
	|	ВТ_СвязьУчетныхЕдиниц.Заявка КАК Заявка,
	|	ВТ_СвязьУчетныхЕдиниц.ОсновнаяУслугаВыставлена КАК УслугаВыставлена
	|ПОМЕСТИТЬ Доходы
	|ИЗ
	|	ВТ_СвязьУчетныхЕдиниц КАК ВТ_СвязьУчетныхЕдиниц
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция КАК КалькуляцияДокумент
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОсновныеУслугиКалькуляций КАК ВТ_ОсновныеУслугиКалькуляций
	|			ПО КалькуляцияДокумент.Ссылка = ВТ_ОсновныеУслугиКалькуляций.Калькуляция
	|		ПО ВТ_СвязьУчетныхЕдиниц.Калькуляция = КалькуляцияДокумент.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ФрахтПоКалькуляции КАК ФрахтПоКалькуляции
	|		ПО ВТ_СвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки = ФрахтПоКалькуляции.ГУИДСтрокиЗаявки
	|			И (ВЫБОР
	|				КОГДА ВТ_СвязьУчетныхЕдиниц.ВидТранспортногоСообщения <> ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВТ_СвязьУчетныхЕдиниц.ГУИД = ФрахтПоКалькуляции.ГУИД
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(ФормированиеФинДокументов.ДатаРеализации) КАК ДатаРеализации,
	|			ФормированиеФинДокументов.Контрагент КАК Контрагент,
	|			ФормированиеФинДокументов.ВидСтавки КАК ВидСтавки,
	|			ФормированиеФинДокументов.ВидПеревозки КАК ВидПеревозки,
	|			МАКСИМУМ(ФормированиеФинДокументов.РазделятьСтрокиПоСтанциямНазначения) КАК РазделятьСтрокиПоСтанциямНазначения,
	|			ФормированиеФинДокументов.ПравилоДляПовагонныхОтправок КАК ПравилоДляПовагонныхОтправок,
	|			ФормированиеФинДокументов.Документ КАК Документ,
	|			ФормированиеФинДокументов.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно КАК ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно
	|		ИЗ
	|			РегистрСведений.ФормированиеФинДокументов КАК ФормированиеФинДокументов
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ФормированиеФинДокументов.Контрагент,
	|			ФормированиеФинДокументов.ВидСтавки,
	|			ФормированиеФинДокументов.ВидПеревозки,
	|			ФормированиеФинДокументов.ПравилоДляПовагонныхОтправок,
	|			ФормированиеФинДокументов.Документ,
	|			ФормированиеФинДокументов.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно) КАК ПравилоФФД
	|		ПО ВТ_СвязьУчетныхЕдиниц.ДокументФФД = ПравилоФФД.Документ
	|ГДЕ
	|	ВТ_СвязьУчетныхЕдиниц.Клиент <> &КонтрагентПустаяСсылка
	|	И НЕ ВТ_СвязьУчетныхЕдиниц.КонтрагентДКП
	|	И (ВТ_СвязьУчетныхЕдиниц.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ЖД)
	|			ИЛИ ВТ_СвязьУчетныхЕдиниц.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ПустаяСсылка))
	|	И ВТ_ОсновныеУслугиКалькуляций.ВыставляемаяУслуга <> &УслугаФрахта
	|	И ВЫБОР
	|			КОГДА ВТ_СвязьУчетныхЕдиниц.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|				ТОГДА КалькуляцияДокумент.ММ_ИтогоСтавка20
	|			ИНАЧЕ КалькуляцияДокумент.ММ_ИтогоСтавка
	|		КОНЕЦ + ВЫБОР
	|			КОГДА ЕСТЬNULL(ПравилоФФД.ВидСтавки, ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидСтавки.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидСтавки.СквознаяСтавкаСушаФрахт1Строка)
	|				ТОГДА ЕСТЬNULL(ФрахтПоКалькуляции.Итого, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Фрахт"",
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ВТ_СвязьУчетныхЕдиниц.Ссылка.Дата,
	|	ВТ_СвязьУчетныхЕдиниц.ГотовоКВыставлению,
	|	ВТ_СвязьУчетныхЕдиниц.Клиент,
	|	ВТ_СвязьУчетныхЕдиниц.Договор,
	|	ВТ_СвязьУчетныхЕдиниц.Договор.ПравилоФормированияДатыУслуги,
	|	ВТ_СвязьУчетныхЕдиниц.Ссылка,
	|	ВЫБОР
	|		КОГДА ВТ_СвязьУчетныхЕдиниц.СчетФрахт.Проведен
	|			ТОГДА ВТ_СвязьУчетныхЕдиниц.СчетФрахт
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ВТ_СвязьУчетныхЕдиниц.Протокол,
	|	ВТ_СвязьУчетныхЕдиниц.Калькуляция,
	|	ВТ_СвязьУчетныхЕдиниц.Организация,
	|	ВТ_СвязьУчетныхЕдиниц.Контейнер,
	|	ВТ_СвязьУчетныхЕдиниц.Вагон,
	|	ВТ_СвязьУчетныхЕдиниц.ГУИД,
	|	ВТ_СвязьУчетныхЕдиниц.ВидТранспортногоСообщения,
	|	ВЫБОР
	|		КОГДА КалькуляцияДокумент.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Доплатные)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Доплата)
	|		КОГДА КалькуляцияДокумент.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Субсидии)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Субсидии) 
	//ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
	|		КОГДА КалькуляцияДокумент.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Премии)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Премии)
	//ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.ОсновнойДолг)
	|	КОНЕЦ,
	|	ФрахтПоКалькуляции.Итого,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДоходов.Выручка),
	|	&УслугаФрахта,
	|	ВТ_СвязьУчетныхЕдиниц.ЦФО,
	|	КалькуляцияНФ_ВыбранныеСтавки.Валюта,
	//|	КалькуляцияДокумент.СтавкаНДС,
	//|	КалькуляцияДокумент.СуммаВключаетНДС,
	//Евросиб(ДИТ), Беляев СЮ, US 98066 / TA 98869, 26-12-2024, начало
	|	КалькуляцияДокумент.НДСФрахт,
	|	КалькуляцияДокумент.СуммаВключаетНДСФрахт,
	//Евросиб(ДИТ), Беляев СЮ, US 98066 / TA 98869, 26-12-2024, конец
	|	NULL,
	|	0,
	|	ВЫБОР
	|		КОГДА КалькуляцияДокумент.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого)
	|				ИЛИ КалькуляцияДокумент.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПССТарифом)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.Вагон)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.Ктк)
	|	КОНЕЦ,
	|	КалькуляцияДокумент.ТипКалькуляции,
	|	ВТ_СвязьУчетныхЕдиниц.ВидПеревозки,
	|	"""",
	|	ЛОЖЬ,
	|	ВТ_СвязьУчетныхЕдиниц.Заявка,
	|	ВТ_СвязьУчетныхЕдиниц.ОсновнаяУслугаВыставлена
	|ИЗ
	|	ВТ_СвязьУчетныхЕдиниц КАК ВТ_СвязьУчетныхЕдиниц
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция КАК КалькуляцияДокумент
	|		ПО ВТ_СвязьУчетныхЕдиниц.Калькуляция = КалькуляцияДокумент.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция.НФ_ВыбранныеСтавки КАК КалькуляцияНФ_ВыбранныеСтавки
	|		ПО ВТ_СвязьУчетныхЕдиниц.Калькуляция = КалькуляцияНФ_ВыбранныеСтавки.Ссылка
	|			И ВТ_СвязьУчетныхЕдиниц.ПортДляКалькуляции = КалькуляцияНФ_ВыбранныеСтавки.Порт
	|			И ВТ_СвязьУчетныхЕдиниц.СобственностьПеревозимогоКТКСтрокой = КалькуляцияНФ_ВыбранныеСтавки.SOCCOC
	|			И (ВЫБОР
	|				КОГДА ВТ_СвязьУчетныхЕдиниц.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|					ТОГДА КалькуляцияНФ_ВыбранныеСтавки.Выбрано20
	|				ИНАЧЕ КалькуляцияНФ_ВыбранныеСтавки.Выбрано40
	|			КОНЕЦ)
	|			И (НЕ ВТ_СвязьУчетныхЕдиниц.Коносамент = ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ФрахтПоКалькуляции КАК ФрахтПоКалькуляции
	|		ПО ВТ_СвязьУчетныхЕдиниц.ГУИД = ФрахтПоКалькуляции.ГУИД
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(ФормированиеФинДокументов.ДатаРеализации) КАК ДатаРеализации,
	|			ФормированиеФинДокументов.Контрагент КАК Контрагент,
	|			ФормированиеФинДокументов.ВидСтавки КАК ВидСтавки,
	|			ФормированиеФинДокументов.ВидПеревозки КАК ВидПеревозки,
	|			МАКСИМУМ(ФормированиеФинДокументов.РазделятьСтрокиПоСтанциямНазначения) КАК РазделятьСтрокиПоСтанциямНазначения,
	|			ФормированиеФинДокументов.ПравилоДляПовагонныхОтправок КАК ПравилоДляПовагонныхОтправок,
	|			ФормированиеФинДокументов.Документ КАК Документ,
	|			ФормированиеФинДокументов.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно КАК ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно
	|		ИЗ
	|			РегистрСведений.ФормированиеФинДокументов КАК ФормированиеФинДокументов
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ФормированиеФинДокументов.Контрагент,
	|			ФормированиеФинДокументов.ВидСтавки,
	|			ФормированиеФинДокументов.ВидПеревозки,
	|			ФормированиеФинДокументов.ПравилоДляПовагонныхОтправок,
	|			ФормированиеФинДокументов.Документ,
	|			ФормированиеФинДокументов.ФормироватьСтрокиДокументовНаКаждыйКонтейнерОтдельно) КАК ПравилоФФД
	|		ПО ВТ_СвязьУчетныхЕдиниц.ДокументФФД = ПравилоФФД.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СвязьУчетныхЕдиниц КАК ВТ
	|		ПО ВТ_СвязьУчетныхЕдиниц.ГУИДСтрокиЗаявки = ВТ.ГУИДСтрокиЗаявки
	|			И (ВЫБОР
	|				КОГДА ВТ_СвязьУчетныхЕдиниц.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ПустаяСсылка)
	|					ТОГДА ВТ_СвязьУчетныхЕдиниц.ГУИД = ВТ.ГУИД
	|				ИНАЧЕ ВТ.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море)
	|			КОНЕЦ)
	|ГДЕ
	|	ВТ_СвязьУчетныхЕдиниц.Клиент <> &КонтрагентПустаяСсылка
	|	И НЕ ВТ_СвязьУчетныхЕдиниц.КонтрагентДКП
	|	И ВЫБОР
	|			КОГДА ВТ_СвязьУчетныхЕдиниц.РазмерКТК = ЗНАЧЕНИЕ(Справочник.РазмерыКТК.К20)
	|				ТОГДА КалькуляцияНФ_ВыбранныеСтавки.Итого20
	|			ИНАЧЕ КалькуляцияНФ_ВыбранныеСтавки.Итого40
	|		КОНЕЦ <> 0
	|	И (ВТ.ГУИД ЕСТЬ NULL
	|			ИЛИ НЕ ЕСТЬNULL(ПравилоФФД.ВидСтавки, ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидСтавки.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидСтавки.СквознаяСтавкаСушаФрахт1Строка))
	|	И ВТ_СвязьУчетныхЕдиниц.Коносамент <> ЗНАЧЕНИЕ(Документ.ТранспортныйДокумент.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Доплатные"",
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	ВТ_СвязьУчетныхЕдиниц.Ссылка.Дата,
	|	ВТ_СвязьУчетныхЕдиниц.ГотовоКВыставлению,
	|	ВТ_СвязьУчетныхЕдиниц.Доплата_Клиент,
	|	ВТ_СвязьУчетныхЕдиниц.Доплата_Договор,
	|	ВТ_СвязьУчетныхЕдиниц.Доплата_Договор.ПравилоФормированияДатыУслуги,
	|	ВТ_СвязьУчетныхЕдиниц.Ссылка,
	|	NULL,
	|	ВТ_СвязьУчетныхЕдиниц.Доплата_ПСЦ,
	|	ВТ_СвязьУчетныхЕдиниц.Доплата_Калькуляция,
	|	ВТ_СвязьУчетныхЕдиниц.Организация,
	|	ВТ_СвязьУчетныхЕдиниц.Контейнер,
	|	ВТ_СвязьУчетныхЕдиниц.Вагон,
	|	ВТ_СвязьУчетныхЕдиниц.ГУИД,
	|	ВТ_СвязьУчетныхЕдиниц.ВидТранспортногоСообщения,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Доплата),
	|	ВТ_СвязьУчетныхЕдиниц.Доплата_Доплата,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДоходов.Выручка),
	|	ЕСТЬNULL(ВТ_СвязьУчетныхЕдиниц.Услуга, ВТ_ОсновныеУслугиКалькуляций.ВыставляемаяУслуга),
	|	ВТ_СвязьУчетныхЕдиниц.ЦФО,
	|	ВТ_СвязьУчетныхЕдиниц.Доплата_Валюта,
	|	КалькуляцияДокумент.СтавкаНДС,
	|	КалькуляцияДокумент.СуммаВключаетНДС,
	|	NULL,
	|	0,
	|	ВЫБОР
	|		КОГДА КалькуляцияДокумент.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого)
	|				ИЛИ КалькуляцияДокумент.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПССТарифом)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.Вагон)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.Ктк)
	|	КОНЕЦ,
	|	КалькуляцияДокумент.ТипКалькуляции,
	|	ВТ_СвязьУчетныхЕдиниц.ВидПеревозки,
	|	"""",
	|	ВТ_Доплатные2.ЖелтаяДоплата,
	|	ВТ_СвязьУчетныхЕдиниц.Заявка,
	|	ЛОЖЬ
	|ИЗ
	|	ВТ_СУЕ_Доплатные КАК ВТ_СвязьУчетныхЕдиниц
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция КАК КалькуляцияДокумент
	|		ПО ВТ_СвязьУчетныхЕдиниц.Доплата_Калькуляция = КалькуляцияДокумент.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновныеУслугиКалькуляций КАК ВТ_ОсновныеУслугиКалькуляций
	|		ПО (КалькуляцияДокумент.Ссылка = ВТ_ОсновныеУслугиКалькуляций.Калькуляция)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СУЕ_Доплатные КАК ВТ_Доплатные2
	|		ПО ВТ_СвязьУчетныхЕдиниц.Контейнер = ВТ_Доплатные2.Контейнер
	|			И ВТ_СвязьУчетныхЕдиниц.Доплата_ПСЦ = ВТ_Доплатные2.Доплата_ПСЦ
	|			И ВТ_СвязьУчетныхЕдиниц.Доплата_Калькуляция = ВТ_Доплатные2.Доплата_Калькуляция
	|			И ВТ_СвязьУчетныхЕдиниц.ВидТранспортногоСообщения <> ВТ_Доплатные2.ВидТранспортногоСообщения
	|			И (ВТ_Доплатные2.ВидТранспортногоСообщения <> ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ЖД))
	|ГДЕ
	|	ВТ_Доплатные2.ВидТранспортногоСообщения ЕСТЬ NULL
	|	И ВТ_СвязьУчетныхЕдиниц.Доплата_Доплата <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Услуги вне ставки в доходах"",
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ВТ_СвязьУчетныхЕдиниц.Ссылка.Дата,
	|	ИСТИНА,
	|	СделкаДоходы.Клиент,
	|	СделкаДоходы.Договор,
	|	СделкаДоходы.Договор.ПравилоФормированияДатыУслуги,
	|	СделкаДоходы.Ссылка,
	|	ВЫБОР
	|		КОГДА ВТ_СвязьУчетныхЕдиниц.СчетЖД.Проведен
	|			ТОГДА ВТ_СвязьУчетныхЕдиниц.СчетЖД
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	СделкаДоходы.ПСЦ,
	|	СделкаДоходы.Калькуляция,
	|	ВТ_СвязьУчетныхЕдиниц.Организация,
	|	ВТ_СвязьУчетныхЕдиниц.Контейнер,
	|	ВТ_СвязьУчетныхЕдиниц.Вагон,
	|	ВТ_СвязьУчетныхЕдиниц.ГУИД,
	|	ВТ_СвязьУчетныхЕдиниц.ВидТранспортногоСообщения,
	|	ВЫБОР
	|		КОГДА СделкаДоходы.Перевыставляемая
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.ДопУслугаВР)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.ДопУслуга)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СделкаДоходы.Количество <> 0
	|			ТОГДА СделкаДоходы.СтавкаИтого / СделкаДоходы.Количество
	|		ИНАЧЕ СделкаДоходы.СтавкаИтого
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СделкаДоходы.Перевыставляемая
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДоходов.Возмещаемые)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоходов.Выручка)
	|	КОНЕЦ,
	|	СделкаДоходы.Услуга,
	|	ВТ_СвязьУчетныхЕдиниц.ЦФО,
	|	СделкаДоходы.Валюта,
	|	СделкаДоходы.СтавкаНДС,
	|	СделкаДоходы.НДСВключенВСтоимость,
	|	СделкаДоходы.ДатаОказанияУслуги,
	|	ВЫБОР
	|		КОГДА СделкаДоходы.Количество <> 0
	|			ТОГДА СделкаДоходы.СуммаНДС / СделкаДоходы.Количество
	|		ИНАЧЕ СделкаДоходы.СуммаНДС
	|	КОНЕЦ,
	|	СделкаДоходы.ЕдиницаИзмерения,
	|	КалькуляцияДокумент.ТипКалькуляции,
	|	ВТ_СвязьУчетныхЕдиниц.ВидПеревозки,
	|	СделкаДоходы.ГУИД,
	|	ЛОЖЬ,
	|	ВТ_СвязьУчетныхЕдиниц.Заявка,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.Сделка.Доходы КАК СделкаДоходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвязьДоходовИРасходов КАК ВТ_СвязьДоходовИРасходов
	|		ПО СделкаДоходы.ГУИД = ВТ_СвязьДоходовИРасходов.Доходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвязьУчетныхЕдиниц КАК ВТ_СвязьУчетныхЕдиниц
	|		ПО (ВТ_СвязьДоходовИРасходов.СвязьУчетныхЕдиниц = ВТ_СвязьУчетныхЕдиниц.ГУИД)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция КАК КалькуляцияДокумент
	|		ПО (ВТ_СвязьУчетныхЕдиниц.Калькуляция = КалькуляцияДокумент.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВыставленныеУслугиВнеСтавки КАК ВыставленныеУслугиВнеСтавки
	|		ПО СделкаДоходы.ГУИД = ВыставленныеУслугиВнеСтавки.ГУИД_Доходы
	|ГДЕ
	|	СделкаДоходы.Ссылка = &Ссылка
	|	И СделкаДоходы.УслугаВнеСтавки
	|	И НЕ СделкаДоходы.ДоплатныеКТК
	|	И (СделкаДоходы.ИсточникПоявленияСтрокиЭкономики = ЗНАЧЕНИЕ(Перечисление.ИсточникПоявленияСтрокиЭкономики.ДобавленоИзАкцепта)
	|			ИЛИ НЕ СделкаДоходы.НеВыставлятьКлиенту)
	|	И СделкаДоходы.СтавкаИтого <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Доходы1.УслугаВнеСтавки КАК УслугаВнеСтавки,
	|	Доходы1.Услуга КАК Услуга,
	|	Доходы1.Валюта КАК Валюта,
	|	Доходы1.ДоплатныеКТК КАК ДоплатныеКТК,
	|	Доходы1.ДатаСделки КАК ДатаСделки,
	|	Доходы1.Договор КАК Договор,
	|	Доходы1.Договор.КатегорияДоговора КАК ДоговорКатегорияДоговора,
	|	Доходы1.Клиент КАК Клиент,
	|	Доходы1.Ссылка КАК Ссылка,
	|	Доходы1.Протокол КАК Протокол,
	|	Доходы1.Контейнер КАК Контейнер,
	|	Доходы1.Вагон КАК Вагон,
	|	Доходы1.Организация КАК Организация,
	|	Доходы1.ЦФО КАК ЦФО,
	|	Доходы1.ВидУслуги КАК ВидУслуги,
	|	ВТ_СвязьУчетныхЕдиниц.ГотовоКВыставлению КАК ГотовоКВыставлению,
	|	ВТ_СвязьУчетныхЕдиниц.ГУИД КАК ИдентификаторСУЕ,
	|	ВТ_СвязьУчетныхЕдиниц.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения,
	|	ВТ_СвязьУчетныхЕдиниц.РазмерКТК КАК РазмерКТК,
	|	ВТ_СвязьУчетныхЕдиниц.Калькуляция КАК Калькуляция,
	|	ВТ_СвязьУчетныхЕдиниц.КалькуляцияФрахтИмпорт КАК КалькуляцияФрахтИмпорт,
	|	ВТ_СвязьУчетныхЕдиниц.Коносамент КАК Коносамент,
	|	ВТ_СвязьУчетныхЕдиниц.КоносаментСтанцияНазначения КАК КоносаментСтанцияНазначения,
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|	ВТ_СвязьУчетныхЕдиниц.СобственностьПеревозимогоКТК КАК СобственностьПеревозимогоКТК,
	//ок)
	|	ВТ_СвязьУчетныхЕдиниц.УдалитьСобственностьПеревозимогоКТК КАК УдалитьСобственностьПеревозимогоКТК,
	|	ВТ_СвязьУчетныхЕдиниц.ПринадлежностьТЕ КАК ПринадлежностьТЕ,
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|	ВТ_СвязьУчетныхЕдиниц.СобственностьПеревозимогоКТКСтрокой КАК СобственностьПеревозимогоКТКСтрокой,
	|	ВТ_СвязьУчетныхЕдиниц.ПортДляКалькуляции КАК ПортДляКалькуляции,
	|	ВЫБОР
	|		КОГДА Доходы1.ДоплатныеКТК
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_СвязьУчетныхЕдиниц.УсловияПеревозкиНазначение = &DOOR
	|							И ВТ_СвязьУчетныхЕдиниц.ДатаПодачиАвтоПодВыгрузку <> ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ВТ_СвязьУчетныхЕдиниц.ДатаПодачиАвтоПодВыгрузку
	|					ИНАЧЕ ВТ_СвязьУчетныхЕдиниц.ДатаРаскредитацииЖД
	|				КОНЕЦ
	|		КОГДА ВТ_СвязьУчетныхЕдиниц.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ИмпортМоре)
	|				И ФормированиеФинДокументов.ИспользоватьРасширенныеПараметры
	|				И ФормированиеФинДокументов.ВидСтавки <> ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидСтавки.ОтдельныеСтавки)
	|				И ВТ_СвязьУчетныхЕдиниц.ЕстьЖД
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_СвязьУчетныхЕдиниц.ДатаРаскредитацииЖД >= ЕСТЬNULL(ВТ_СвязьУчетныхЕдиниц.ДатаПодачиАвтоПодВыгрузку, ДАТАВРЕМЯ(1, 1, 1))
	|						ТОГДА ВТ_СвязьУчетныхЕдиниц.ДатаРаскредитацииЖД
	|					ИНАЧЕ ВТ_СвязьУчетныхЕдиниц.ДатаПодачиАвтоПодВыгрузку
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_СвязьУчетныхЕдиниц.ДатаПрибытия
	|	КОНЕЦ КАК ДатаПрибытия,
	|	ВЫБОР
	|		КОГДА ВТ_СвязьУчетныхЕдиниц.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ИмпортМоре)
	|				И ФормированиеФинДокументов.ИспользоватьРасширенныеПараметры
	|				И ФормированиеФинДокументов.ВидСтавки <> ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидСтавки.ОтдельныеСтавки)
	|				И ВТ_СвязьУчетныхЕдиниц.ЕстьЖД
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК УчитыватьПрибытиеПоЖД,
	|	ВТ_СвязьУчетныхЕдиниц.ЖДН.ДатаРаскредитации КАК ДатаРаскредитацииЖД,
	|	ВТ_СвязьУчетныхЕдиниц.ДатаФактическогоПредоставленияПС КАК ДатаФактическогоПредоставленияПС,
	|	ВТ_СвязьУчетныхЕдиниц.Коносамент.ДатаТранспортногоДокумента КАК ДатаКоносамента,
	|	ФормированиеФинДокументов.Ссылка КАК ПравилоФормирования,
	|	ФормированиеФинДокументов.ВидГруппировкиФрахта КАК ПравилоФормированияВидГруппировкиФрахта,
	|	ФормированиеФинДокументов.ГруппироватьВыставляемыеРеализацииПосуточно КАК ПравилоФормированияГруппироватьВыставляемыеРеализацииПосуточно,
	|	ФормированиеФинДокументов.ВидСтавки КАК ПравилоФормированияВидСтавки,
	|	ВТ_СвязьУчетныхЕдиниц.ПовагонныеОтправки КАК ПовагонныеОтправки,
	|	ВТ_Доходы_СУЕ.ДатаОказанияУслуги КАК ДатаОказанияУслугиСтрокиИсправления,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВходящегоДокументаПодрядчика,
	|	ВЫБОР
	|		КОГДА ФормированиеФинДокументов.ИспользоватьРасширенныеПараметры
	|			ТОГДА ВЫБОР
	|					КОГДА Доходы1.Услуга = &УслугаФрахта
	|							И ФормированиеФинДокументов.ВидСтавки = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидСтавки.ОтдельныеСтавки)
	|							И НЕ ФормированиеФинДокументов.ДатаРеализацииФрахт = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ПустаяСсылка)
	|						ТОГДА ФормированиеФинДокументов.ДатаРеализацииФрахт
	|					ИНАЧЕ ФормированиеФинДокументов.ДатаРеализации
	|				КОНЕЦ
	|		КОГДА НЕ Доходы1.ПравилоФормированияДатыУслуги = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПустаяСсылка)
	|			ТОГДА Доходы1.ПравилоФормированияДатыУслуги
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ДатаРеализации,
	|	ВТ_ДатыПоНаправлениям.ДатаДокументаКоносаментаПоНаправлению КАК ДатаДокументаКоносаментаПоНаправлению,
	|	ВТ_ДатыПоНаправлениям.ДатаОтправленияКоносаментаПоНаправлению КАК ДатаОтправленияКоносаментаПоНаправлению,
	|	ВТ_ДатыПоНаправлениям.ДатаПрибытияКоносаментаПоНаправлению КАК ДатаПрибытияКоносаментаПоНаправлению,
	|	ВТ_СвязьУчетныхЕдиниц.ДатаОтправленияЖД КАК ДатаОтправленияЖД,
	|	ВТ_СвязьУчетныхЕдиниц.ДатаОтправленияКоносамент КАК ДатаОтправленияКоносамент,
	|	ВТ_СвязьУчетныхЕдиниц.ДатаПрибытияКоносамент КАК ДатаПрибытияКоносамент,
	|	ВТ_СвязьУчетныхЕдиниц.ДатаОтправленияЗаявки КАК ДатаОтправленияЗаявки,
	|	Доходы1.ДатаОказанияУслуги КАК ДатаОказанияУслуги,
	|	ВТ_СвязьУчетныхЕдиниц.Экспорт КАК Экспорт,
	|	ВТ_СвязьУчетныхЕдиниц.ВидПеревозки КАК ВидПеревозки,
	|	ВТ_СвязьУчетныхЕдиниц.ДатаПодачиАвтоПодВыгрузку КАК ДатаПодачиАвтоПодВыгрузку,
	|	ВТ_СвязьУчетныхЕдиниц.УсловияПеревозкиНазначение КАК УсловияПеревозкиНазначение,
	|	ВТ_СвязьУчетныхЕдиниц.МорскойРейс КАК МорскойРейс,
	|	ВТ_СвязьУчетныхЕдиниц.МорскойРейсДатаОтправления КАК МорскойРейсДатаОтправления,
	|	ВТ_СвязьУчетныхЕдиниц.МорскойРейсДатаПрибытия КАК МорскойРейсДатаПрибытия,
	|	ВТ_СвязьУчетныхЕдиниц.ЖДРейс КАК ЖДРейс,
	|	ВТ_СвязьУчетныхЕдиниц.ЖДРейсДатаОтправления КАК ЖДРейсДатаОтправления,
	|	ВТ_СвязьУчетныхЕдиниц.ЖДРейсДатаПрибытия КАК ЖДРейсДатаПрибытия,
	|	Доходы1.ЖелтаяДоплата КАК ЖелтаяДоплата
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Доходы КАК Доходы1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвязьУчетныхЕдиниц КАК ВТ_СвязьУчетныхЕдиниц
	|		ПО Доходы1.ИдентификаторСУЕ = ВТ_СвязьУчетныхЕдиниц.ГУИД
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Доходы_СУЕ КАК ВТ_Доходы_СУЕ
	|		ПО Доходы1.ИдентификаторСУЕ = ВТ_Доходы_СУЕ.ГУИД_СУЕ
	|			И Доходы1.Услуга = ВТ_Доходы_СУЕ.Услуга
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы
	|			ПО СделкаСвязьДоходовИРасходов.Расходы = СделкаРасходы.ГУИД
	|				И СделкаСвязьДоходовИРасходов.Ссылка = СделкаРасходы.Ссылка
	|				И (ВЫБОР
	|					КОГДА НЕ СделкаСвязьДоходовИРасходов.Услуга = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|						ТОГДА СделкаСвязьДоходовИРасходов.Услуга = СделкаРасходы.Услуга
	|					ИНАЧЕ НЕ СделкаРасходы.Услуга = &УслугаФрахта
	|				КОНЕЦ)
	|		ПО (ВТ_Доходы_СУЕ.ГУИД_Доходы = СделкаСвязьДоходовИРасходов.Доходы)
	|			И (СделкаСвязьДоходовИРасходов.Ссылка = ВТ_Доходы_СУЕ.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФормированиеФинДокументов КАК ФормированиеФинДокументов
	|		ПО (ВТ_СвязьУчетныхЕдиниц.Калькуляция.ПС_ВидПеревозки = ФормированиеФинДокументов.ВидПеревозки)
	|			И (ВТ_СвязьУчетныхЕдиниц.Калькуляция.Контрагент = ФормированиеФинДокументов.Контрагент)
	|			И (ВТ_СвязьУчетныхЕдиниц.ПовагонныеОтправки = ФормированиеФинДокументов.ПравилоДляПовагонныхОтправок)
	|			И (НЕ ФормированиеФинДокументов.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатыПоНаправлениям КАК ВТ_ДатыПоНаправлениям
	|		ПО (ВТ_СвязьУчетныхЕдиниц.КоносаментСтанцияОтправления = ВТ_ДатыПоНаправлениям.КоносаментСтанцияОтправления)
	|			И (ВТ_СвязьУчетныхЕдиниц.КоносаментСтанцияНазначения = ВТ_ДатыПоНаправлениям.КоносаментСтанцияНазначения)
	|			И (ВТ_СвязьУчетныхЕдиниц.КоносаментДоговор = ВТ_ДатыПоНаправлениям.КоносаментДоговор)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Услуга КАК Услуга,
	|	ВТ.Клиент КАК Клиент,
	|	ВТ.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ВТ.Договор КАК Договор,
	|	ВТ.Валюта КАК Валюта,
	|	ВТ.ВидУслуги КАК ВидУслуги,
	|	ВТ.ДатаСделки КАК ДатаСделки,
	|	ВТ.ПравилоФормирования КАК ПравилоФормирования,
	|	ВЫБОР
	|		КОГДА ВТ.ДоплатныеКТК
	|			ТОГДА ""(Доплатные КТК. Дата прибытия)""
	|		КОГДА ВТ.ДоговорКатегорияДоговора = ЗНАЧЕНИЕ(Справочник.КатегорииДоговоров.ПредоставлениеВагонов)
	|				И ВТ.ДатаФактическогоПредоставленияПС > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ""ДатаФактическогоПредоставленияПС""
	|		КОГДА ВТ.УслугаВнеСтавки
	|			ТОГДА ""ДатаВходящегоДокументаПодрядчика""
	|		КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаКоносамента)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ.ПравилоФормированияВидГруппировкиФрахта = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки)
	|							И НЕ ВТ.ПравилоФормированияГруппироватьВыставляемыеРеализацииПосуточно
	|						ТОГДА ""(Дата коносамента по направлению перевозки)""
	|					ИНАЧЕ ""(Дата коносамента)""
	|				КОНЕЦ
	|		КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаОтправленияЖД)
	|			ТОГДА ""(Дата отправления ЖД)""
	|		КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаУходаСуднаКС)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ.ПравилоФормированияВидГруппировкиФрахта = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки)
	|							И НЕ ВТ.ПравилоФормированияГруппироватьВыставляемыеРеализацииПосуточно
	|						ТОГДА ""(Дата ухода судна из коносамента по направлению)""
	|					ИНАЧЕ ""(Дата ухода судна из коносамента)""
	|				КОНЕЦ
	|		КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаПрибытияЖД)
	|			ТОГДА ""(Дата прибытия ЖД)""
	|		КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаПрибытияСуднаКС)
	|				И ВТ.ДатаПрибытияКоносамент > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ.ПравилоФормированияВидГруппировкиФрахта = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки)
	|							И НЕ ВТ.ПравилоФормированияГруппироватьВыставляемыеРеализацииПосуточно
	|						ТОГДА ""(Дата прибытия судна из коносамента по направлению)""
	|					ИНАЧЕ ""(Дата прибытия судна из коносамента)""
	|				КОНЕЦ
	|		КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаДоставкиГрузаИзСделки)
	|			ТОГДА ""(Дата доставки груза)""
	|		КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеРаскредитации)
	|			ТОГДА ""(Дата раскредитации ЖД)""
	|		КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеПрибытия)
	|				И ВТ.ДатаПрибытия > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ""(Дата прибытия ЖД)""
	|		КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеОтправления)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ.ДатаОтправленияЖД > ДАТАВРЕМЯ(1, 1, 1)
	|							И (ВТ.ДатаОтправленияЖД < ВТ.ДатаОтправленияКоносамент
	|								ИЛИ ВТ.ДатаОтправленияКоносамент = ДАТАВРЕМЯ(1, 1, 1))
	|						ТОГДА ""(Дата отправления ЖД)""
	|					ИНАЧЕ ""(Дата отправления из коносамента)""
	|				КОНЕЦ
	|		КОГДА ВТ.ПовагонныеОтправки
	|			ТОГДА """"
	|		ИНАЧЕ ""(Дата раскредитации ЖД)""
	|	КОНЕЦ КАК ИсточникПолученияДатыОказанияУслуги,
	|	НАЧАЛОПЕРИОДА(МАКСИМУМ(ВЫБОР
	|				КОГДА ВТ.ДоплатныеКТК
	|					ТОГДА ЕСТЬNULL(ВТ.ДатаПрибытия, ДАТАВРЕМЯ(1, 1, 1))
	|				КОГДА ВТ.ДоговорКатегорияДоговора = ЗНАЧЕНИЕ(Справочник.КатегорииДоговоров.ПредоставлениеВагонов)
	|						И ВТ.ДатаФактическогоПредоставленияПС > ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ВТ.ДатаФактическогоПредоставленияПС
	|				КОГДА ВТ.УслугаВнеСтавки
	|					ТОГДА ЕСТЬNULL(ВТ.ДатаВходящегоДокументаПодрядчика, ДАТАВРЕМЯ(1, 1, 1))
	|				КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаКоносамента)
	|					ТОГДА ВЫБОР
	|							КОГДА ВТ.ПравилоФормированияВидГруппировкиФрахта = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки)
	|									И НЕ ВТ.ПравилоФормированияГруппироватьВыставляемыеРеализацииПосуточно
	|								ТОГДА ЕСТЬNULL(ВТ.ДатаДокументаКоносаментаПоНаправлению, ДАТАВРЕМЯ(1, 1, 1))
	|							ИНАЧЕ ЕСТЬNULL(ВТ.ДатаКоносамента, ДАТАВРЕМЯ(1, 1, 1))
	|						КОНЕЦ
	|				КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаОтправленияЖД)
	|					ТОГДА ЕСТЬNULL(ВТ.ДатаОтправленияЖД, ДАТАВРЕМЯ(1, 1, 1))
	|				КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаУходаСуднаКС)
	|					ТОГДА ВЫБОР
	|							КОГДА ВТ.ПравилоФормированияВидГруппировкиФрахта = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки)
	|									И НЕ ВТ.ПравилоФормированияГруппироватьВыставляемыеРеализацииПосуточно
	|								ТОГДА ЕСТЬNULL(ВТ.ДатаОтправленияКоносаментаПоНаправлению, ДАТАВРЕМЯ(1, 1, 1))
	|							ИНАЧЕ ЕСТЬNULL(ВТ.ДатаОтправленияКоносамент, ДАТАВРЕМЯ(1, 1, 1))
	|						КОНЕЦ
	|				КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаПрибытияЖД)
	|					ТОГДА ЕСТЬNULL(ВТ.ДатаРаскредитацииЖД, ДАТАВРЕМЯ(1, 1, 1))
	|				КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаПрибытияСуднаКС)
	|						И ВТ.ДатаПрибытияКоносамент > ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ВЫБОР
	|							КОГДА ВТ.ПравилоФормированияВидГруппировкиФрахта = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки)
	|									И НЕ ВТ.ПравилоФормированияГруппироватьВыставляемыеРеализацииПосуточно
	|								ТОГДА ЕСТЬNULL(ВТ.ДатаПрибытияКоносаментаПоНаправлению, ДАТАВРЕМЯ(1, 1, 1))
	|							ИНАЧЕ ЕСТЬNULL(ВТ.ДатаПрибытияКоносамент, ДАТАВРЕМЯ(1, 1, 1))
	|						КОНЕЦ
	|				КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаДоставкиГрузаИзСделки)
	|					ТОГДА ЕСТЬNULL(ВТ.ДатаПрибытия, ДАТАВРЕМЯ(1, 1, 1))
	|				КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеРаскредитации)
	|					ТОГДА ЕСТЬNULL(ВТ.ДатаРаскредитацииЖД, ДАТАВРЕМЯ(1, 1, 1))
	|				КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеПрибытия)
	|						И ВТ.ДатаПрибытия > ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ЕСТЬNULL(ВТ.ДатаПрибытия, ДАТАВРЕМЯ(1, 1, 1))
	|				КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеОтправления)
	|					ТОГДА ВЫБОР
	|							КОГДА ВТ.ДатаОтправленияЖД > ДАТАВРЕМЯ(1, 1, 1)
	|									И (ВТ.ДатаОтправленияЖД < ВТ.ДатаОтправленияКоносамент
	|										ИЛИ ВТ.ДатаОтправленияКоносамент = ДАТАВРЕМЯ(1, 1, 1))
	|								ТОГДА ЕСТЬNULL(ВТ.ДатаОтправленияЖД, ДАТАВРЕМЯ(1, 1, 1))
	|							ИНАЧЕ ЕСТЬNULL(ВТ.ДатаОтправленияКоносамент, ДАТАВРЕМЯ(1, 1, 1))
	|						КОНЕЦ
	|				КОГДА ВТ.ПовагонныеОтправки
	|					ТОГДА ЕСТЬNULL(ВТ.ДатаОтправленияЖД, ДАТАВРЕМЯ(1, 1, 1))
	|				ИНАЧЕ ЕСТЬNULL(ВТ.ДатаРаскредитацииЖД, ДАТАВРЕМЯ(1, 1, 1))
	|			КОНЕЦ), ДЕНЬ) КАК ДатаОказанияУслуги,
	|	МИНИМУМ(ВТДатыОтправленияПрибытия.ДатаОтправления) КАК ДатаОтправленияПоКТК,
	|	МАКСИМУМ(ВТДатыОтправленияПрибытия.ДатаПрибытия) КАК ДатаПрибытияПоКТК,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ПлановыеДатыРейсов.КоличествоРейсовВСделке = 1
	|				ТОГДА ПлановыеДатыРейсов.ДатаОтправления
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВТ.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море)
	|						ТОГДА ВТ.МорскойРейсДатаОтправления
	|					ИНАЧЕ ВТ.ЖДРейсДатаОтправления
	|				КОНЕЦ
	|		КОНЕЦ) КАК РейсДатаОтправления,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПлановыеДатыРейсов.КоличествоРейсовВСделке = 1
	|				ТОГДА ПлановыеДатыРейсов.ДатаПрибытия
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВТ.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море)
	|						ТОГДА ВТ.МорскойРейсДатаПрибытия
	|					ИНАЧЕ ВТ.ЖДРейсДатаПрибытия
	|				КОНЕЦ
	|		КОНЕЦ) КАК РейсДатаПрибытия,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ВТ.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море)
	|					ИЛИ ВТ.Услуга = &УслугаФрахта
	|				ТОГДА ВЫБОР
	|						КОГДА ЕСТЬNULL(ВТ.ДатаОтправленияКоносамент, &ПустаяДата) <> &ПустаяДата
	|							ТОГДА ВТ.ДатаОтправленияКоносамент
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ПлановыеДатыРейсов.КоличествоМорскихРейсовВСделке = 1
	|									ТОГДА ПлановыеДатыРейсов.ДатаОтправленияМоре
	|								ИНАЧЕ ВТ.МорскойРейсДатаОтправления
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЕСТЬNULL(ВТ.ДатаОтправленияЖД, &ПустаяДата) <> &ПустаяДата
	|						ТОГДА ВТ.ДатаОтправленияЖД
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ПлановыеДатыРейсов.КоличествоЖДРейсовВСделке = 1
	|								ТОГДА ПлановыеДатыРейсов.ДатаОтправленияЖД
	|							ИНАЧЕ ВТ.ЖДРейсДатаОтправления
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК ДатаОтправленияПоСтрокеСП,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВТ.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море)
	|					ИЛИ ВТ.Услуга = &УслугаФрахта
	|				ТОГДА ВЫБОР
	|						КОГДА ЕСТЬNULL(ВТ.ДатаПрибытияКоносамент, &ПустаяДата) <> &ПустаяДата
	|							ТОГДА ВТ.ДатаПрибытияКоносамент
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ПлановыеДатыРейсов.КоличествоМорскихРейсовВСделке = 1
	|									ТОГДА ПлановыеДатыРейсов.ДатаПрибытияМоре
	|								ИНАЧЕ ВТ.МорскойРейсДатаПрибытия
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЕСТЬNULL(ВТ.ДатаРаскредитацииЖД, &ПустаяДата) <> &ПустаяДата
	|						ТОГДА ВТ.ДатаРаскредитацииЖД
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ПлановыеДатыРейсов.КоличествоЖДРейсовВСделке = 1
	|								ТОГДА ПлановыеДатыРейсов.ДатаПрибытияЖД
	|							ИНАЧЕ ВТ.ЖДРейсДатаПрибытия
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК ДатаПрибытияПоСтрокеСП,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВТ.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море)
	|					ИЛИ ВТ.Услуга = &УслугаФрахта
	|				ТОГДА ВЫБОР
	|						КОГДА ПлановыеДатыРейсов.КоличествоМорскихРейсовВСделке = 1
	|							ТОГДА ПлановыеДатыРейсов.МорскойРейс
	|						ИНАЧЕ ВТ.МорскойРейс
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ПлановыеДатыРейсов.КоличествоЖДРейсовВСделке = 1
	|						ТОГДА ПлановыеДатыРейсов.ЖДРейс
	|					ИНАЧЕ ВТ.ЖДРейс
	|				КОНЕЦ
	|		КОНЕЦ) КАК Рейс,
	|	МИНИМУМ(ВТ.ДатаОтправленияЖД) КАК ДатаОтправленияЖД,
	|	МИНИМУМ(ВТ.ДатаОтправленияЗаявки) КАК ДатаОтправленияЗаявки,
	|	НАЧАЛОПЕРИОДА(МАКСИМУМ(ВЫБОР
	|				КОГДА ВТ.ДоплатныеКТК
	|					ТОГДА ВЫБОР
	|							КОГДА ВТ.ДатаПодачиАвтоПодВыгрузку <> &ПустаяДата
	|								ТОГДА ВТ.ДатаПодачиАвтоПодВыгрузку
	|							КОГДА ВТ.ДатаРаскредитацииЖД <> &ПустаяДата
	|								ТОГДА ДОБАВИТЬКДАТЕ(ВТ.ДатаРаскредитацииЖД, ДЕНЬ, 5)
	|							КОГДА ВТ.УчитыватьПрибытиеПоЖД
	|								ТОГДА ВЫБОР
	|										КОГДА ПлановыеДатыРейсов.ДатаПрибытияЖД <> &ПустаяДата
	|											ТОГДА ДОБАВИТЬКДАТЕ(ПлановыеДатыРейсов.ДатаПрибытияЖД, ДЕНЬ, 5)
	|										ИНАЧЕ &ПустаяДата
	|									КОНЕЦ
	|							КОГДА ПлановыеДатыРейсов.ДатаПрибытия <> &ПустаяДата
	|								ТОГДА ДОБАВИТЬКДАТЕ(ПлановыеДатыРейсов.ДатаПрибытия, ДЕНЬ, 5)
	|							ИНАЧЕ &ПустаяДата
	|						КОНЕЦ
	|				КОГДА ВТ.УслугаВнеСтавки
	|					ТОГДА ЕСТЬNULL(ВТ.ДатаОказанияУслуги, ДАТАВРЕМЯ(1, 1, 1))
	//|				КОГДА ВТ.ВидУслуги = ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Субсидии)
	//ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
	|				КОГДА ВТ.ВидУслуги = ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Субсидии) ИЛИ ВТ.ВидУслуги = ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Премии)
	//ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
	|					ТОГДА ВЫБОР
	|							КОГДА ВТ.ДатаПодачиАвтоПодВыгрузку <> &ПустаяДата
	|								ТОГДА ВТ.ДатаПодачиАвтоПодВыгрузку
	|							КОГДА ВТ.Экспорт
	|								ТОГДА ВЫБОР
	|										КОГДА ВТ.ДатаРаскредитацииЖД <> &ПустаяДата
	|											ТОГДА ДОБАВИТЬКДАТЕ(ВТ.ДатаРаскредитацииЖД, ДЕНЬ, 14)
	|										КОГДА ПлановыеДатыРейсов.МинимальнаяДатаПрибытия <> &ПустаяДата
	|											ТОГДА ДОБАВИТЬКДАТЕ(ПлановыеДатыРейсов.ДатаПрибытия, ДЕНЬ, 14)
	|										ИНАЧЕ &ПустаяДата
	|									КОНЕЦ
	|							ИНАЧЕ ВЫБОР
	|									КОГДА ВТ.ДатаОтправленияЖД <> &ПустаяДата
	|										ТОГДА ВТ.ДатаОтправленияЖД
	|									КОГДА ПлановыеДатыРейсов.МинимальнаяДатаПрибытия <> &ПустаяДата
	|										ТОГДА ПлановыеДатыРейсов.ДатаПрибытия
	|									ИНАЧЕ &ПустаяДата
	|								КОНЕЦ
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВТ.Услуга = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПредоставлениеКТК)
	|							ТОГДА ВЫБОР
	|									КОГДА ВТ.ДатаПодачиАвтоПодВыгрузку <> &ПустаяДата
	|										ТОГДА ВТ.ДатаПодачиАвтоПодВыгрузку
	|									КОГДА ВТ.ДатаОтправленияЖД <> &ПустаяДата
	|										ТОГДА ВТ.ДатаОтправленияЖД
	|									КОГДА ПлановыеДатыРейсов.ДатаОтправления <> &ПустаяДата
	|										ТОГДА ДОБАВИТЬКДАТЕ(ПлановыеДатыРейсов.ДатаОтправления, ДЕНЬ, 14)
	|									ИНАЧЕ &ПустаяДата
	|								КОНЕЦ
	|						КОГДА ВТ.Услуга = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПредоставлениеПлатформ)
	|							ТОГДА ВЫБОР
	|									КОГДА ВТ.Договор.КатегорияДоговора = ЗНАЧЕНИЕ(Справочник.КатегорииДоговоров.ПредоставлениеВагонов)
	|										ТОГДА ВЫБОР
	|												КОГДА ВТ.ДатаФактическогоПредоставленияПС <> &ПустаяДата
	|													ТОГДА ВТ.ДатаФактическогоПредоставленияПС
	|												КОГДА ВТ.ДатаОтправленияЖД <> &ПустаяДата
	|													ТОГДА ВТ.ДатаОтправленияЖД
	|												ИНАЧЕ &ПустаяДата
	|											КОНЕЦ
	|									ИНАЧЕ ВЫБОР
	|											КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаКоносамента)
	|												ТОГДА ВЫБОР
	|														КОГДА ВТ.ПравилоФормирования.ВидГруппировкиФрахта = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки)
	|																И НЕ ВТ.ПравилоФормирования.ГруппироватьВыставляемыеРеализацииПосуточно
	|															ТОГДА ЕСТЬNULL(ВТ.ДатаДокументаКоносаментаПоНаправлению, &ПустаяДата)
	|														ИНАЧЕ ЕСТЬNULL(ВТ.ДатаКоносамента, &ПустаяДата)
	|													КОНЕЦ
	|											КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаОтправленияЖД)
	|												ТОГДА ЕСТЬNULL(ВТ.ДатаОтправленияЖД, ДАТАВРЕМЯ(1, 1, 1))
	|											КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаУходаСуднаКС)
	|												ТОГДА ВЫБОР
	|														КОГДА ВТ.ПравилоФормирования.ВидГруппировкиФрахта = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки)
	|																И НЕ ВТ.ПравилоФормирования.ГруппироватьВыставляемыеРеализацииПосуточно
	|															ТОГДА ЕСТЬNULL(ВТ.ДатаОтправленияКоносаментаПоНаправлению, ДАТАВРЕМЯ(1, 1, 1))
	|														ИНАЧЕ ЕСТЬNULL(ВТ.ДатаОтправленияКоносамент, ДАТАВРЕМЯ(1, 1, 1))
	|													КОНЕЦ
	|											КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаПрибытияЖД)
	|												ТОГДА ЕСТЬNULL(ВТ.ДатаРаскредитацииЖД, ДАТАВРЕМЯ(1, 1, 1))
	|											КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаПрибытияСуднаКС)
	|												ТОГДА ВЫБОР
	|														КОГДА ВТ.ПравилоФормирования.ВидГруппировкиФрахта = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки)
	|																И НЕ ВТ.ПравилоФормирования.ГруппироватьВыставляемыеРеализацииПосуточно
	|															ТОГДА ЕСТЬNULL(ВТ.ДатаПрибытияКоносаментаПоНаправлению, ДАТАВРЕМЯ(1, 1, 1))
	|														ИНАЧЕ ЕСТЬNULL(ВТ.ДатаПрибытияКоносамент, ДАТАВРЕМЯ(1, 1, 1))
	|													КОНЕЦ
	|											КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаДоставкиГрузаИзСделки)
	|												ТОГДА ЕСТЬNULL(ВТ.ДатаПрибытия, ДАТАВРЕМЯ(1, 1, 1))
	|											КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеРаскредитации)
	|												ТОГДА ЕСТЬNULL(ВТ.ДатаРаскредитацииЖД, ДАТАВРЕМЯ(1, 1, 1))
	|											КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеПрибытия)
	|													И ВТ.ДатаПрибытия > ДАТАВРЕМЯ(1, 1, 1)
	|												ТОГДА ЕСТЬNULL(ВТ.ДатаПрибытия, ДАТАВРЕМЯ(1, 1, 1))
	|											КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеОтправления)
	|												ТОГДА ВЫБОР
	|														КОГДА ВТ.ДатаОтправленияЖД > ДАТАВРЕМЯ(1, 1, 1)
	|																И (ВТ.ДатаОтправленияЖД < ВТ.ДатаОтправленияКоносамент
	|																	ИЛИ ВТ.ДатаОтправленияКоносамент = ДАТАВРЕМЯ(1, 1, 1))
	|															ТОГДА ЕСТЬNULL(ВТ.ДатаОтправленияЖД, ДАТАВРЕМЯ(1, 1, 1))
	|														ИНАЧЕ ЕСТЬNULL(ВТ.ДатаОтправленияКоносамент, ДАТАВРЕМЯ(1, 1, 1))
	|													КОНЕЦ
	|											ИНАЧЕ ЕСТЬNULL(ВТ.ДатаРаскредитацииЖД, ДАТАВРЕМЯ(1, 1, 1))
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОГДА ВТ.УсловияПеревозкиНазначение = &DOOR
	|								И ВТ.Экспорт
	|							ТОГДА ВЫБОР
	|									КОГДА ВТ.ДатаПодачиАвтоПодВыгрузку <> &ПустаяДата
	|										ТОГДА ВТ.ДатаПодачиАвтоПодВыгрузку
	|									КОГДА ВТ.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ЭкспортМоре)
	|											И ВТ.ДатаПрибытияКоносамент <> &ПустаяДата
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ.ДатаПрибытияКоносамент, ДЕНЬ, 5)
	|									КОГДА ВТ.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.Экспорт)
	|											И ВТ.ДатаРаскредитацииЖД <> &ПустаяДата
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ.ДатаРаскредитацииЖД, ДЕНЬ, 5)
	|									ИНАЧЕ ВЫБОР
	|											КОГДА ВТ.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ЭкспортМоре)
	|												ТОГДА ВЫБОР
	|														КОГДА ПлановыеДатыРейсов.КоличествоМорскихРейсовВСделке = 1
	|															ТОГДА ВЫБОР
	|																	КОГДА ПлановыеДатыРейсов.ДатаПрибытияМоре <> &ПустаяДата
	|																		ТОГДА ДОБАВИТЬКДАТЕ(ПлановыеДатыРейсов.ДатаПрибытияМоре, ДЕНЬ, 5)
	|																	ИНАЧЕ &ПустаяДата
	|																КОНЕЦ
	|														ИНАЧЕ ВЫБОР
	|																КОГДА ВТ.МорскойРейсДатаПрибытия <> &ПустаяДата
	|																	ТОГДА ДОБАВИТЬКДАТЕ(ВТ.МорскойРейсДатаПрибытия, ДЕНЬ, 5)
	|																ИНАЧЕ &ПустаяДата
	|															КОНЕЦ
	|													КОНЕЦ
	|											ИНАЧЕ ВЫБОР
	|													КОГДА ПлановыеДатыРейсов.КоличествоЖДРейсовВСделке = 1
	|														ТОГДА ВЫБОР
	|																КОГДА ПлановыеДатыРейсов.ДатаПрибытияЖД <> &ПустаяДата
	|																	ТОГДА ДОБАВИТЬКДАТЕ(ПлановыеДатыРейсов.ДатаПрибытияЖД, ДЕНЬ, 5)
	|																ИНАЧЕ &ПустаяДата
	|															КОНЕЦ
	|													ИНАЧЕ ВЫБОР
	|															КОГДА ВТ.ЖДРейсДатаПрибытия <> &ПустаяДата
	|																ТОГДА ДОБАВИТЬКДАТЕ(ВТ.ЖДРейсДатаПрибытия, ДЕНЬ, 5)
	|															ИНАЧЕ &ПустаяДата
	|														КОНЕЦ
	|												КОНЕЦ
	|										КОНЕЦ
	|								КОНЕЦ
	|						КОГДА ВТ.УсловияПеревозкиНазначение = &DOOR
	|								И НЕ ВТ.Экспорт
	|								И ВТ.ВидПеревозки <> &МорскойИмпорт
	|							ТОГДА ВЫБОР
	|									КОГДА ВТ.ДатаПодачиАвтоПодВыгрузку <> &ПустаяДата
	|										ТОГДА ВТ.ДатаПодачиАвтоПодВыгрузку
	|									КОГДА ВТ.ДатаРаскредитацииЖД <> &ПустаяДата
	|										ТОГДА ДОБАВИТЬКДАТЕ(ВТ.ДатаРаскредитацииЖД, ДЕНЬ, 5)
	|									ИНАЧЕ ВЫБОР
	|											КОГДА ВТ.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море)
	|												ТОГДА ВЫБОР
	|														КОГДА ПлановыеДатыРейсов.КоличествоМорскихРейсовВСделке = 1
	|															ТОГДА ВЫБОР
	|																	КОГДА ПлановыеДатыРейсов.ДатаПрибытияМоре <> &ПустаяДата
	|																		ТОГДА ДОБАВИТЬКДАТЕ(ПлановыеДатыРейсов.ДатаПрибытияМоре, ДЕНЬ, 5)
	|																	ИНАЧЕ &ПустаяДата
	|																КОНЕЦ
	|														ИНАЧЕ ВЫБОР
	|																КОГДА ВТ.МорскойРейсДатаПрибытия <> &ПустаяДата
	|																	ТОГДА ДОБАВИТЬКДАТЕ(ВТ.МорскойРейсДатаПрибытия, ДЕНЬ, 5)
	|																ИНАЧЕ &ПустаяДата
	|															КОНЕЦ
	|													КОНЕЦ
	|											ИНАЧЕ ВЫБОР
	|													КОГДА ПлановыеДатыРейсов.КоличествоЖДРейсовВСделке = 1
	|														ТОГДА ВЫБОР
	|																КОГДА ПлановыеДатыРейсов.ДатаПрибытияЖД <> &ПустаяДата
	|																	ТОГДА ДОБАВИТЬКДАТЕ(ПлановыеДатыРейсов.ДатаПрибытияЖД, ДЕНЬ, 5)
	|																ИНАЧЕ &ПустаяДата
	|															КОНЕЦ
	|													ИНАЧЕ ВЫБОР
	|															КОГДА ВТ.ЖДРейсДатаПрибытия <> &ПустаяДата
	|																ТОГДА ДОБАВИТЬКДАТЕ(ВТ.ЖДРейсДатаПрибытия, ДЕНЬ, 5)
	|															ИНАЧЕ &ПустаяДата
	|														КОНЕЦ
	|												КОНЕЦ
	|										КОНЕЦ
	|								КОНЕЦ
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаКоносамента)
	|										И ВТ.ПравилоФормирования.ВидГруппировкиФрахта = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки)
	|										И НЕ ВТ.ПравилоФормирования.ГруппироватьВыставляемыеРеализацииПосуточно
	|										И ЕСТЬNULL(ВТ.ДатаДокументаКоносаментаПоНаправлению, &ПустаяДата) <> &ПустаяДата
	|									ТОГДА ЕСТЬNULL(ВТ.ДатаДокументаКоносаментаПоНаправлению, &ПустаяДата)
	|								КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаКоносамента)
	|										И ЕСТЬNULL(ВТ.ДатаКоносамента, &ПустаяДата) <> &ПустаяДата
	|									ТОГДА ЕСТЬNULL(ВТ.ДатаКоносамента, &ПустаяДата)
	|								КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаОтправленияЖД)
	|										И ЕСТЬNULL(ВТ.ДатаОтправленияЖД, &ПустаяДата) <> &ПустаяДата
	|									ТОГДА ЕСТЬNULL(ВТ.ДатаОтправленияЖД, &ПустаяДата)
	|								КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаУходаСуднаКС)
	|										И ВТ.ПравилоФормирования.ВидГруппировкиФрахта = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки)
	|										И НЕ ВТ.ПравилоФормирования.ГруппироватьВыставляемыеРеализацииПосуточно
	|										И ЕСТЬNULL(ВТ.ДатаОтправленияКоносаментаПоНаправлению, &ПустаяДата) <> &ПустаяДата
	|									ТОГДА ЕСТЬNULL(ВТ.ДатаОтправленияКоносаментаПоНаправлению, &ПустаяДата)
	|								КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаУходаСуднаКС)
	|										И ЕСТЬNULL(ВТ.ДатаОтправленияКоносамент, &ПустаяДата) <> &ПустаяДата
	|									ТОГДА ЕСТЬNULL(ВТ.ДатаОтправленияКоносамент, &ПустаяДата)
	|								КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаПрибытияЖД)
	|										И ЕСТЬNULL(ВТ.ДатаРаскредитацииЖД, &ПустаяДата) <> &ПустаяДата
	|									ТОГДА ЕСТЬNULL(ВТ.ДатаРаскредитацииЖД, &ПустаяДата)
	|								КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаПрибытияСуднаКС)
	|										И ВТ.ПравилоФормирования.ВидГруппировкиФрахта = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки)
	|										И НЕ ВТ.ПравилоФормирования.ГруппироватьВыставляемыеРеализацииПосуточно
	|										И ЕСТЬNULL(ВТ.ДатаПрибытияКоносаментаПоНаправлению, &ПустаяДата) <> &ПустаяДата
	|									ТОГДА ЕСТЬNULL(ВТ.ДатаПрибытияКоносаментаПоНаправлению, &ПустаяДата)
	|								КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаПрибытияСуднаКС)
	|										И ЕСТЬNULL(ВТ.ДатаПрибытияКоносамент, &ПустаяДата) <> &ПустаяДата
	|									ТОГДА ЕСТЬNULL(ВТ.ДатаПрибытияКоносамент, &ПустаяДата)
	|								КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаДоставкиГрузаИзСделки)
	|										И ВТ.УчитыватьПрибытиеПоЖД
	|										И ВТ.ДатаПодачиАвтоПодВыгрузку <> &ПустаяДата
	|									ТОГДА ВТ.ДатаПодачиАвтоПодВыгрузку
	|								КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаДоставкиГрузаИзСделки)
	|										И ВТ.УчитыватьПрибытиеПоЖД
	|										И ВТ.ДатаРаскредитацииЖД <> &ПустаяДата
	|									ТОГДА ВТ.ДатаРаскредитацииЖД
	|								КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаДоставкиГрузаИзСделки)
	|										И НЕ ВТ.УчитыватьПрибытиеПоЖД
	|										И (ВТ.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море)
	|											ИЛИ ВТ.Услуга = &УслугаФрахта)
	|										И ЕСТЬNULL(ВТ.ДатаПрибытияКоносамент, &ПустаяДата) <> &ПустаяДата
	|									ТОГДА ЕСТЬNULL(ВТ.ДатаПрибытияКоносамент, &ПустаяДата)
	|								КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаДоставкиГрузаИзСделки)
	|										И ВТ.ДатаПодачиАвтоПодВыгрузку <> &ПустаяДата
	|									ТОГДА ВТ.ДатаПодачиАвтоПодВыгрузку
	|								КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаДоставкиГрузаИзСделки)
	|										И ВТ.ДатаРаскредитацииЖД <> &ПустаяДата
	|									ТОГДА ВТ.ДатаРаскредитацииЖД
	|								КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеРаскредитации)
	|										И ЕСТЬNULL(ВТ.ДатаРаскредитацииЖД, &ПустаяДата) <> &ПустаяДата
	|									ТОГДА ЕСТЬNULL(ВТ.ДатаРаскредитацииЖД, &ПустаяДата)
	|								КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеПрибытия)
	|										И ВТ.ДатаПрибытия <> &ПустаяДата
	|									ТОГДА ЕСТЬNULL(ВТ.ДатаПрибытия, &ПустаяДата)
	|								КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеОтправления)
	|										И ВТ.ДатаОтправленияЖД > &ПустаяДата
	|										И (ВТ.ДатаОтправленияЖД < ВТ.ДатаОтправленияКоносамент
	|											ИЛИ ВТ.ДатаОтправленияКоносамент = &ПустаяДата)
	|									ТОГДА ЕСТЬNULL(ВТ.ДатаОтправленияЖД, &ПустаяДата)
	|								КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеОтправления)
	|										И ВТ.ДатаОтправленияКоносамент <> &ПустаяДата
	|									ТОГДА ЕСТЬNULL(ВТ.ДатаОтправленияКоносамент, &ПустаяДата)
	|								КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеОтправкиСудна)
	|										И ЕСТЬNULL(ВТ.ДатаОтправленияКоносамент, &ПустаяДата) <> &ПустаяДата
	|									ТОГДА ЕСТЬNULL(ВТ.ДатаОтправленияКоносамент, &ПустаяДата)
	|								КОГДА ВТ.УсловияПеревозкиНазначение = &DOOR
	|									ТОГДА ВЫБОР
	|											КОГДА ЕСТЬNULL(ВТ.ДатаРаскредитацииЖД, &ПустаяДата) <> &ПустаяДата
	|												ТОГДА ВТ.ДатаРаскредитацииЖД
	|											ИНАЧЕ ВЫБОР
	|													КОГДА ВТ.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море)
	|															И НЕ ВТ.УчитыватьПрибытиеПоЖД
	|														ТОГДА ВЫБОР
	|																КОГДА ПлановыеДатыРейсов.КоличествоМорскихРейсовВСделке = 1
	|																	ТОГДА ВЫБОР
	|																			КОГДА ПлановыеДатыРейсов.ДатаПрибытияМоре <> &ПустаяДата
	|																				ТОГДА ДОБАВИТЬКДАТЕ(ПлановыеДатыРейсов.ДатаПрибытияМоре, ДЕНЬ, 5)
	|																			ИНАЧЕ &ПустаяДата
	|																		КОНЕЦ
	|																ИНАЧЕ ВЫБОР
	|																		КОГДА ВТ.МорскойРейсДатаПрибытия <> &ПустаяДата
	|																			ТОГДА ДОБАВИТЬКДАТЕ(ВТ.МорскойРейсДатаПрибытия, ДЕНЬ, 5)
	|																		ИНАЧЕ &ПустаяДата
	|																	КОНЕЦ
	|															КОНЕЦ
	|													ИНАЧЕ ВЫБОР
	|															КОГДА ПлановыеДатыРейсов.КоличествоЖДРейсовВСделке = 1
	|																ТОГДА ВЫБОР
	|																		КОГДА ПлановыеДатыРейсов.ДатаПрибытияЖД <> &ПустаяДата
	|																			ТОГДА ДОБАВИТЬКДАТЕ(ПлановыеДатыРейсов.ДатаПрибытияЖД, ДЕНЬ, 5)
	|																		ИНАЧЕ &ПустаяДата
	|																	КОНЕЦ
	|															ИНАЧЕ ВЫБОР
	|																	КОГДА ВТ.ЖДРейсДатаПрибытия <> &ПустаяДата
	|																		ТОГДА ДОБАВИТЬКДАТЕ(ВТ.ЖДРейсДатаПрибытия, ДЕНЬ, 5)
	|																	ИНАЧЕ &ПустаяДата
	|																КОНЕЦ
	|														КОНЕЦ
	|												КОНЕЦ
	|										КОНЕЦ
	|								ИНАЧЕ ВЫБОР
	|										КОГДА НЕ ВТ.УчитыватьПрибытиеПоЖД
	|												И ВТ.ВидПеревозки <> ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.Экспорт)
	|												И ВТ.Услуга = &УслугаФрахта
	|											ТОГДА ЕСТЬNULL(ВТ.ДатаПрибытияКоносамент, &ПустаяДата)
	|										КОГДА НЕ ВТ.УчитыватьПрибытиеПоЖД
	|												И ВТ.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ЭкспортМоре)
	|											ТОГДА ВТ.ДатаПрибытияКоносамент
	|										КОГДА ЕСТЬNULL(ВТ.ДатаРаскредитацииЖД, &ПустаяДата) <> &ПустаяДата
	|											ТОГДА ВТ.ДатаРаскредитацииЖД
	|										ИНАЧЕ &ПустаяДата
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ), ДЕНЬ) КАК РасчетнаяДатаЗавершенияПеревозки,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВТ.ДоплатныеКТК
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ.ДатаПодачиАвтоПодВыгрузку <> &ПустаяДата
	|							ТОГДА ""Доплата, Дата выдачи груза (авто/инЖД)""
	|						КОГДА ВТ.ДатаРаскредитацииЖД <> &ПустаяДата
	|							ТОГДА ""Доплата, ДатаРаскредитацииЖД + 5""
	|						КОГДА ВТ.УчитыватьПрибытиеПоЖД
	|							ТОГДА ВЫБОР
	|									КОГДА ПлановыеДатыРейсов.ДатаПрибытияЖД <> &ПустаяДата
	|										ТОГДА ""Доплата, РейсЖДДатаПрибытия + 5""
	|									ИНАЧЕ ""Доплата, ПустаяДата""
	|								КОНЕЦ
	|						КОГДА ПлановыеДатыРейсов.ДатаПрибытия <> &ПустаяДата
	|							ТОГДА ""Доплата, РейсДатаПрибытия + 5""
	|						ИНАЧЕ ""Доплата ПустаяДата""
	|					КОНЕЦ
	|			КОГДА ВТ.УслугаВнеСтавки
	|				ТОГДА ""УслугаВнеСтавки, ДатаОказанияУслуги""
	//|			КОГДА ВТ.ВидУслуги = ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Субсидии)
	//ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
	|			КОГДА ВТ.ВидУслуги = ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Субсидии) ИЛИ ВТ.ВидУслуги = ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Премии)
	//ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ.ДатаПодачиАвтоПодВыгрузку <> &ПустаяДата
	|							ТОГДА ""Субсидии, Дата выдачи груза (авто/инЖД)""
	|						КОГДА ВТ.Экспорт
	|							ТОГДА ВЫБОР
	|									КОГДА ВТ.ДатаРаскредитацииЖД <> &ПустаяДата
	|										ТОГДА ""Субсидии, Экспорт, ДатаРаскредитацииЖД + 14""
	|									КОГДА ПлановыеДатыРейсов.ДатаПрибытия <> &ПустаяДата
	|										ТОГДА ""Субсидии, Экспорт, РейсДатаПрибытия + 14""
	|									ИНАЧЕ ""Субсидии, Экспорт, ПустаяДата""
	|								КОНЕЦ
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ВТ.ДатаОтправленияЖД <> &ПустаяДата
	|									ТОГДА ""Субсидии, Импорт, ДатаОтправленияЖД""
	|								КОГДА ПлановыеДатыРейсов.ДатаПрибытия <> &ПустаяДата
	|									ТОГДА ""Субсидии, Импорт, РейсДатаПрибытия""
	|								ИНАЧЕ ""Субсидии, Импорт, ПустаяДата""
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВТ.Услуга = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПредоставлениеКТК)
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ.ДатаПодачиАвтоПодВыгрузку <> &ПустаяДата
	|									ТОГДА ""ПредоставлениеКТК, Дата выдачи груза (авто/инЖД)""
	|								КОГДА ВТ.ДатаОтправленияЖД <> &ПустаяДата
	|									ТОГДА ""ПредоставлениеКТК, ДатаОтправленияЖД""
	|								КОГДА ПлановыеДатыРейсов.ДатаОтправления <> &ПустаяДата
	|									ТОГДА ""ПредоставлениеКТК, РейсДатаОтправления""
	|								ИНАЧЕ ""ПредоставлениеКТК, ПустаяДата""
	|							КОНЕЦ
	|					КОГДА ВТ.Услуга = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПредоставлениеПлатформ)
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ.Договор.КатегорияДоговора = ЗНАЧЕНИЕ(Справочник.КатегорииДоговоров.ПредоставлениеВагонов)
	|									ТОГДА ВЫБОР
	|											КОГДА ВТ.ДатаФактическогоПредоставленияПС <> &ПустаяДата
	|												ТОГДА ""ПредоставлениеПлатформ, Категория договора ПредоставлениеВагонов, ДатаФактическогоПредоставленияПС""
	|											КОГДА ВТ.ДатаОтправленияЖД <> &ПустаяДата
	|												ТОГДА ""ПредоставлениеПлатформ, Категория договора ПредоставлениеВагонов, ДатаОтправленияЖД""
	|											ИНАЧЕ ""ПредоставлениеПлатформ, Категория договора ПредоставлениеВагонов, ПустаяДата""
	|										КОНЕЦ
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаКоносамента)
	|											ТОГДА ВЫБОР
	|													КОГДА ВТ.ПравилоФормирования.ВидГруппировкиФрахта = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки)
	|															И НЕ ВТ.ПравилоФормирования.ГруппироватьВыставляемыеРеализацииПосуточно
	|														ТОГДА ""ПредоставлениеПлатформ, ДатаДокументаКоносаментаПоНаправлению""
	|													ИНАЧЕ ""ПредоставлениеПлатформ, ДатаКоносамента""
	|												КОНЕЦ
	|										КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаОтправленияЖД)
	|											ТОГДА ""ПредоставлениеПлатформ, ДатаОтправленияЖД""
	|										КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаУходаСуднаКС)
	|											ТОГДА ВЫБОР
	|													КОГДА ВТ.ПравилоФормирования.ВидГруппировкиФрахта = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки)
	|															И НЕ ВТ.ПравилоФормирования.ГруппироватьВыставляемыеРеализацииПосуточно
	|														ТОГДА ""ПредоставлениеПлатформ, ДатаОтправленияКоносаментаПоНаправлению""
	|													ИНАЧЕ ""ПредоставлениеПлатформ, ДатаОтправленияКоносамент""
	|												КОНЕЦ
	|										КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаПрибытияЖД)
	|											ТОГДА ""ПредоставлениеПлатформ, ДатаРаскредитацииЖД""
	|										КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаПрибытияСуднаКС)
	|											ТОГДА ВЫБОР
	|													КОГДА ВТ.ПравилоФормирования.ВидГруппировкиФрахта = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки)
	|															И НЕ ВТ.ПравилоФормирования.ГруппироватьВыставляемыеРеализацииПосуточно
	|														ТОГДА ""ПредоставлениеПлатформ, ДатаПрибытияКоносаментаПоНаправлению""
	|													ИНАЧЕ ""ПредоставлениеПлатформ, ДатаПрибытияКоносамент""
	|												КОНЕЦ
	|										КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаДоставкиГрузаИзСделки)
	|											ТОГДА ""ПредоставлениеПлатформ, ДатаДоставкиГрузаИзСделки""
	|										КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеРаскредитации)
	|											ТОГДА ""ПредоставлениеПлатформ, ДатаРаскредитацииЖД""
	|										КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеПрибытия)
	|												И ВТ.ДатаПрибытия > ДАТАВРЕМЯ(1, 1, 1)
	|											ТОГДА ""ПредоставлениеПлатформ, ДатаПрибытия""
	|										КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеОтправления)
	|											ТОГДА ВЫБОР
	|													КОГДА ВТ.ДатаОтправленияЖД > ДАТАВРЕМЯ(1, 1, 1)
	|															И (ВТ.ДатаОтправленияЖД < ВТ.ДатаОтправленияКоносамент
	|																ИЛИ ВТ.ДатаОтправленияКоносамент = ДАТАВРЕМЯ(1, 1, 1))
	|														ТОГДА ""ПредоставлениеПлатформ, ДатаОтправленияЖД""
	|													ИНАЧЕ ""ПредоставлениеПлатформ, ДатаОтправленияКоносамент""
	|												КОНЕЦ
	|										ИНАЧЕ ""ПредоставлениеПлатформ, ДатаРаскредитацииЖД""
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОГДА ВТ.УсловияПеревозкиНазначение = &DOOR
	|							И ВТ.Экспорт
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ.ДатаПодачиАвтоПодВыгрузку <> &ПустаяДата
	|									ТОГДА ""DOOR, Экспорт, Дата выдачи груза (авто/инЖД)""
	|								КОГДА ВТ.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ЭкспортМоре)
	|										И ВТ.ДатаПрибытияКоносамент <> &ПустаяДата
	|									ТОГДА ""DOOR, Морской экспорт, ДатаПрибытияКоносамент + 5""
	|								КОГДА ВТ.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.Экспорт)
	|										И ВТ.ДатаРаскредитацииЖД <> &ПустаяДата
	|									ТОГДА ""DOOR, Сухопутнй экспорт, ДатаРаскредитацииЖД + 5""
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ВТ.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ЭкспортМоре)
	|											ТОГДА ВЫБОР
	|													КОГДА ПлановыеДатыРейсов.КоличествоМорскихРейсовВСделке = 1
	|														ТОГДА ВЫБОР
	|																КОГДА ПлановыеДатыРейсов.ДатаПрибытияМоре <> &ПустаяДата
	|																	ТОГДА ""DOOR, Морской рейс в сделке + 5""
	|																ИНАЧЕ ""DOOR, Пустая дата""
	|															КОНЕЦ
	|													ИНАЧЕ ВЫБОР
	|															КОГДА ВТ.МорскойРейсДатаПрибытия <> &ПустаяДата
	|																ТОГДА ""DOOR, Морской рейс в СП + 5""
	|															ИНАЧЕ ""DOOR, Пустая дата""
	|														КОНЕЦ
	|												КОНЕЦ
	|										ИНАЧЕ ВЫБОР
	|												КОГДА ПлановыеДатыРейсов.КоличествоЖДРейсовВСделке = 1
	|													ТОГДА ВЫБОР
	|															КОГДА ПлановыеДатыРейсов.ДатаПрибытияЖД <> &ПустаяДата
	|																ТОГДА ""DOOR, ЖД рейс в сделке + 5""
	|															ИНАЧЕ ""DOOR, Пустая дата""
	|														КОНЕЦ
	|												ИНАЧЕ ВЫБОР
	|														КОГДА ВТ.ЖДРейсДатаПрибытия <> &ПустаяДата
	|															ТОГДА ""DOOR, ЖД рейс в СП + 5""
	|														ИНАЧЕ ""DOOR, Пустая дата""
	|													КОНЕЦ
	|											КОНЕЦ
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОГДА ВТ.УсловияПеревозкиНазначение = &DOOR
	|							И НЕ ВТ.Экспорт
	|							И ВТ.ВидПеревозки <> &МорскойИмпорт
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ.ДатаПодачиАвтоПодВыгрузку <> &ПустаяДата
	|									ТОГДА ""DOOR, Дата выдачи груза (авто/инЖД)""
	|								КОГДА ВТ.ДатаРаскредитацииЖД <> &ПустаяДата
	|									ТОГДА ""DOOR, ДатаРаскредитацииЖД + 5""
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ВТ.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море)
	|											ТОГДА ВЫБОР
	|													КОГДА ПлановыеДатыРейсов.КоличествоМорскихРейсовВСделке = 1
	|														ТОГДА ВЫБОР
	|																КОГДА ПлановыеДатыРейсов.ДатаПрибытияМоре <> &ПустаяДата
	|																	ТОГДА ""DOOR, Морской рейс в сделке + 5""
	|																ИНАЧЕ ""DOOR, Пустая дата""
	|															КОНЕЦ
	|													ИНАЧЕ ВЫБОР
	|															КОГДА ВТ.МорскойРейсДатаПрибытия <> &ПустаяДата
	|																ТОГДА ""DOOR, Морской рейс в СП + 5""
	|															ИНАЧЕ ""DOOR, Пустая дата""
	|														КОНЕЦ
	|												КОНЕЦ
	|										ИНАЧЕ ВЫБОР
	|												КОГДА ПлановыеДатыРейсов.КоличествоЖДРейсовВСделке = 1
	|													ТОГДА ВЫБОР
	|															КОГДА ПлановыеДатыРейсов.ДатаПрибытияЖД <> &ПустаяДата
	|																ТОГДА ""DOOR, ЖД рейс в сделке + 5""
	|															ИНАЧЕ ""DOOR, Пустая дата""
	|														КОНЕЦ
	|												ИНАЧЕ ВЫБОР
	|														КОГДА ВТ.ЖДРейсДатаПрибытия <> &ПустаяДата
	|															ТОГДА ""DOOR, ЖД рейс в СП + 5""
	|														ИНАЧЕ ""DOOR, Пустая дата""
	|													КОНЕЦ
	|											КОНЕЦ
	|									КОНЕЦ
	|							КОНЕЦ
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаКоносамента)
	|									И ВТ.ПравилоФормирования.ВидГруппировкиФрахта = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки)
	|									И НЕ ВТ.ПравилоФормирования.ГруппироватьВыставляемыеРеализацииПосуточно
	|									И ЕСТЬNULL(ВТ.ДатаДокументаКоносаментаПоНаправлению, &ПустаяДата) <> &ПустаяДата
	|								ТОГДА ""ДатаДокументаКоносаментаПоНаправлению""
	|							КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаКоносамента)
	|									И ЕСТЬNULL(ВТ.ДатаКоносамента, &ПустаяДата) <> &ПустаяДата
	|								ТОГДА ""ДатаКоносамента""
	|							КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаОтправленияЖД)
	|									И ЕСТЬNULL(ВТ.ДатаОтправленияЖД, &ПустаяДата) <> &ПустаяДата
	|								ТОГДА ""ДатаОтправленияЖД""
	|							КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаУходаСуднаКС)
	|									И ВТ.ПравилоФормирования.ВидГруппировкиФрахта = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки)
	|									И НЕ ВТ.ПравилоФормирования.ГруппироватьВыставляемыеРеализацииПосуточно
	|									И ЕСТЬNULL(ВТ.ДатаОтправленияКоносаментаПоНаправлению, &ПустаяДата) <> &ПустаяДата
	|								ТОГДА ""ДатаОтправленияКоносаментаПоНаправлению""
	|							КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаУходаСуднаКС)
	|									И ЕСТЬNULL(ВТ.ДатаОтправленияКоносамент, &ПустаяДата) <> &ПустаяДата
	|								ТОГДА ""ДатаОтправленияКоносамент""
	|							КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаПрибытияЖД)
	|									И ЕСТЬNULL(ВТ.ДатаРаскредитацииЖД, &ПустаяДата) <> &ПустаяДата
	|								ТОГДА ""ДатаРаскредитацииЖД""
	|							КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаПрибытияСуднаКС)
	|									И ВТ.ПравилоФормирования.ВидГруппировкиФрахта = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки)
	|									И НЕ ВТ.ПравилоФормирования.ГруппироватьВыставляемыеРеализацииПосуточно
	|									И ЕСТЬNULL(ВТ.ДатаПрибытияКоносаментаПоНаправлению, &ПустаяДата) <> &ПустаяДата
	|								ТОГДА ""ДатаПрибытияКоносаментаПоНаправлению""
	|							КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаПрибытияСуднаКС)
	|									И ЕСТЬNULL(ВТ.ДатаПрибытияКоносамент, &ПустаяДата) <> &ПустаяДата
	|								ТОГДА ""ДатаПрибытияКоносамент""
	|							КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаДоставкиГрузаИзСделки)
	|									И ВТ.УчитыватьПрибытиеПоЖД
	|									И ВТ.ДатаПодачиАвтоПодВыгрузку <> &ПустаяДата
	|								ТОГДА ""ДатаДоставкиГрузаИзСделки, Дата выдачи груза (авто/инЖД)""
	|							КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаДоставкиГрузаИзСделки)
	|									И ВТ.УчитыватьПрибытиеПоЖД
	|									И ВТ.ДатаРаскредитацииЖД <> &ПустаяДата
	|								ТОГДА ""ДатаДоставкиГрузаИзСделки, ДатаРаскредитацииЖД""
	|							КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаДоставкиГрузаИзСделки)
	|									И НЕ ВТ.УчитыватьПрибытиеПоЖД
	|									И (ВТ.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море)
	|										ИЛИ ВТ.Услуга = &УслугаФрахта)
	|									И ЕСТЬNULL(ВТ.ДатаПрибытияКоносамент, &ПустаяДата) <> &ПустаяДата
	|								ТОГДА ""ДатаДоставкиГрузаИзСделки, ДатаПрибытияКоносамент""
	|							КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаДоставкиГрузаИзСделки)
	|									И ВТ.ДатаПодачиАвтоПодВыгрузку <> &ПустаяДата
	|								ТОГДА ""ДатаДоставкиГрузаИзСделки, Дата выдачи груза (авто/инЖД)""
	|							КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаДоставкиГрузаИзСделки)
	|									И ВТ.ДатаРаскредитацииЖД <> &ПустаяДата
	|								ТОГДА ""ДатаДоставкиГрузаИзСделки, ДатаРаскредитацииЖД""
	|							КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеРаскредитации)
	|									И ЕСТЬNULL(ВТ.ДатаРаскредитацииЖД, &ПустаяДата) <> &ПустаяДата
	|								ТОГДА ""ДатаРаскредитацииЖД""
	|							КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеПрибытия)
	|									И ВТ.ДатаПрибытия > ДАТАВРЕМЯ(1, 1, 1)
	|								ТОГДА ""ДатаПрибытия""
	|							КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеОтправления)
	|									И ВТ.ДатаОтправленияЖД > &ПустаяДата
	|									И (ВТ.ДатаОтправленияЖД < ВТ.ДатаОтправленияКоносамент
	|										ИЛИ ВТ.ДатаОтправленияКоносамент = &ПустаяДата)
	|								ТОГДА ""ДатаОтправленияЖД""
	|							КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеОтправления)
	|									И ВТ.ДатаОтправленияКоносамент <> &ПустаяДата
	|								ТОГДА ""ДатаОтправленияКоносамент""
	|							КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеОтправкиСудна)
	|									И ЕСТЬNULL(ВТ.ДатаОтправленияКоносамент, &ПустаяДата) <> &ПустаяДата
	|								ТОГДА ""ДатаОтправленияКоносамент""
	|							КОГДА ВТ.УсловияПеревозкиНазначение = &DOOR
	|								ТОГДА ВЫБОР
	|										КОГДА ЕСТЬNULL(ВТ.ДатаРаскредитацииЖД, &ПустаяДата) <> &ПустаяДата
	|											ТОГДА ""ДатаРаскредитацииЖД""
	|										ИНАЧЕ ВЫБОР
	|												КОГДА ВТ.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море)
	|														И НЕ ВТ.УчитыватьПрибытиеПоЖД
	|													ТОГДА ВЫБОР
	|															КОГДА ПлановыеДатыРейсов.КоличествоМорскихРейсовВСделке = 1
	|																ТОГДА ВЫБОР
	|																		КОГДА ПлановыеДатыРейсов.ДатаПрибытияМоре <> &ПустаяДата
	|																			ТОГДА ""DOOR, Морской рейс в сделке + 5""
	|																		ИНАЧЕ ""DOOR, Пустая дата""
	|																	КОНЕЦ
	|															ИНАЧЕ ВЫБОР
	|																	КОГДА ВТ.МорскойРейсДатаПрибытия <> &ПустаяДата
	|																		ТОГДА ""DOOR, Морской рейс в СП + 5""
	|																	ИНАЧЕ ""DOOR, Пустая дата""
	|																КОНЕЦ
	|														КОНЕЦ
	|												ИНАЧЕ ВЫБОР
	|														КОГДА ПлановыеДатыРейсов.КоличествоЖДРейсовВСделке = 1
	|															ТОГДА ВЫБОР
	|																	КОГДА ПлановыеДатыРейсов.ДатаПрибытияЖД <> &ПустаяДата
	|																		ТОГДА ""DOOR, ЖД рейс в сделке + 5""
	|																	ИНАЧЕ ""DOOR, Пустая дата""
	|																КОНЕЦ
	|														ИНАЧЕ ВЫБОР
	|																КОГДА ВТ.ЖДРейсДатаПрибытия <> &ПустаяДата
	|																	ТОГДА ""DOOR, ЖД рейс в СП + 5""
	|																ИНАЧЕ ""DOOR, Пустая дата""
	|															КОНЕЦ
	|													КОНЕЦ
	|											КОНЕЦ
	|									КОНЕЦ
	|							ИНАЧЕ ВЫБОР
	|									КОГДА НЕ ВТ.УчитыватьПрибытиеПоЖД
	|											И ВТ.ВидПеревозки <> ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.Экспорт)
	|											И ВТ.Услуга = &УслугаФрахта
	|										ТОГДА ""ДатаПрибытияКоносамент""
	|									КОГДА НЕ ВТ.УчитыватьПрибытиеПоЖД
	|											И ВТ.ВидПеревозки = ЗНАЧЕНИЕ(Справочник.ВидыПеревозок.ЭкспортМоре)
	|										ТОГДА ""Морской экспорт, ДатаПрибытияКоносамент""
	|									КОГДА ЕСТЬNULL(ВТ.ДатаРаскредитацииЖД, &ПустаяДата) <> &ПустаяДата
	|										ТОГДА ""ДатаРаскредитацииЖД""
	|									ИНАЧЕ """"
	|								КОНЕЦ
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ) КАК ИсточникПолученияДатыЗавершенияПеревозки
	|ПОМЕСТИТЬ ДатыОказанияУслуг
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДатыОтправленияПрибытия КАК ВТДатыОтправленияПрибытия
	|		ПО ВТ.Контейнер = ВТДатыОтправленияПрибытия.Контейнер
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПлановыеДатыРейсов КАК ПлановыеДатыРейсов
	|		ПО ВТ.Ссылка = ПлановыеДатыРейсов.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Услуга,
	|	ВТ.Клиент,
	|	ВТ.ИдентификаторСУЕ,
	|	ВТ.Договор,
	|	ВТ.Валюта,
	|	ВТ.ВидУслуги,
	|	ВТ.ДатаСделки,
	|	ВЫБОР
	|		КОГДА ВТ.ДоплатныеКТК
	|			ТОГДА ""(Доплатные КТК. Дата прибытия)""
	|		КОГДА ВТ.ДоговорКатегорияДоговора = ЗНАЧЕНИЕ(Справочник.КатегорииДоговоров.ПредоставлениеВагонов)
	|				И ВТ.ДатаФактическогоПредоставленияПС > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ""ДатаФактическогоПредоставленияПС""
	|		КОГДА ВТ.УслугаВнеСтавки
	|			ТОГДА ""ДатаВходящегоДокументаПодрядчика""
	|		КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаКоносамента)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ.ПравилоФормированияВидГруппировкиФрахта = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки)
	|							И НЕ ВТ.ПравилоФормированияГруппироватьВыставляемыеРеализацииПосуточно
	|						ТОГДА ""(Дата коносамента по направлению перевозки)""
	|					ИНАЧЕ ""(Дата коносамента)""
	|				КОНЕЦ
	|		КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаОтправленияЖД)
	|			ТОГДА ""(Дата отправления ЖД)""
	|		КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаУходаСуднаКС)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ.ПравилоФормированияВидГруппировкиФрахта = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки)
	|							И НЕ ВТ.ПравилоФормированияГруппироватьВыставляемыеРеализацииПосуточно
	|						ТОГДА ""(Дата ухода судна из коносамента по направлению)""
	|					ИНАЧЕ ""(Дата ухода судна из коносамента)""
	|				КОНЕЦ
	|		КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаПрибытияЖД)
	|			ТОГДА ""(Дата прибытия ЖД)""
	|		КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаПрибытияСуднаКС)
	|				И ВТ.ДатаПрибытияКоносамент > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ.ПравилоФормированияВидГруппировкиФрахта = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ВидГруппировкиФрахта.ПоНаправлениямПеревозки)
	|							И НЕ ВТ.ПравилоФормированияГруппироватьВыставляемыеРеализацииПосуточно
	|						ТОГДА ""(Дата прибытия судна из коносамента по направлению)""
	|					ИНАЧЕ ""(Дата прибытия судна из коносамента)""
	|				КОНЕЦ
	|		КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.ФрахтФинДокументы_ДатаРеализации.ДатаДоставкиГрузаИзСделки)
	|			ТОГДА ""(Дата доставки груза)""
	|		КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеРаскредитации)
	|			ТОГДА ""(Дата раскредитации ЖД)""
	|		КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеПрибытия)
	|				И ВТ.ДатаПрибытия > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ""(Дата прибытия ЖД)""
	|		КОГДА ВТ.ДатаРеализации = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияДатыДокументаДляДоговора.ПоДатеОтправления)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ.ДатаОтправленияЖД > ДАТАВРЕМЯ(1, 1, 1)
	|							И (ВТ.ДатаОтправленияЖД < ВТ.ДатаОтправленияКоносамент
	|								ИЛИ ВТ.ДатаОтправленияКоносамент = ДАТАВРЕМЯ(1, 1, 1))
	|						ТОГДА ""(Дата отправления ЖД)""
	|					ИНАЧЕ ""(Дата отправления из коносамента)""
	|				КОНЕЦ
	|		КОГДА ВТ.ПовагонныеОтправки
	|			ТОГДА """"
	|		ИНАЧЕ ""(Дата раскредитации ЖД)""
	|	КОНЕЦ,
	|	ВТ.ПравилоФормирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Доходы.УслугаВнеСтавки КАК УслугаВнеСтавки,
	|	Доходы.ДоплатныеКТК КАК ДоплатныеКТК,
	|	Доходы.Услуга КАК Услуга,
	|	Доходы.Клиент КАК Клиент,
	|	Доходы.Договор КАК Договор,
	|	Доходы.Ссылка КАК Ссылка,
	|	Доходы.Протокол КАК Протокол,
	|	Доходы.Калькуляция КАК Калькуляция,
	|	Доходы.Организация КАК Организация,
	|	Доходы.ТипОперации КАК ТипОперации,
	|	Доходы.Валюта КАК Валюта,
	|	Доходы.Вагон КАК Вагон,
	|	ВЫБОР
	|		КОГДА (Доходы.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПСБезТарифаГруженого)
	|				ИЛИ Доходы.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.ПредоставлениеПССТарифом))
	|				И КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Доходы.Контейнер) <> 0
	|			ТОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Доходы.Контейнер)
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Количество,
	|	Доходы.ЖелтаяДоплата КАК ЖелтаяДоплата
	|ПОМЕСТИТЬ КоличествоКонтейнеров
	|ИЗ
	|	Доходы КАК Доходы
	|
	|СГРУППИРОВАТЬ ПО
	|	Доходы.Протокол,
	|	Доходы.ДоплатныеКТК,
	|	Доходы.УслугаВнеСтавки,
	|	Доходы.Клиент,
	|	Доходы.Договор,
	|	Доходы.Калькуляция,
	|	Доходы.Ссылка,
	|	Доходы.Организация,
	|	Доходы.Услуга,
	|	Доходы.ТипОперации,
	|	Доходы.Валюта,
	|	Доходы.ТипКалькуляции,
	|	Доходы.Вагон,
	|	Доходы.ЖелтаяДоплата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыОказанияУслуг.Услуга КАК Услуга,
	|	ДатыОказанияУслуг.Клиент КАК Клиент,
	|	ДатыОказанияУслуг.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ДатыОказанияУслуг.Договор КАК Договор,
	|	ДатыОказанияУслуг.Валюта КАК Валюта,
	|	ДатыОказанияУслуг.ВидУслуги КАК ВидУслуги,
	|	ДатыОказанияУслуг.ДатаКурсаВалют КАК ДатаКурсаВалюты,
	|	КурсыВалют.Курс КАК Курс,
	|	КурсыВалют.Кратность КАК Кратность
	|ПОМЕСТИТЬ КурсыВалютПоДатамОказанияУслуг
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДатыОказанияУслуг.Услуга КАК Услуга,
	|		ДатыОказанияУслуг.Клиент КАК Клиент,
	|		ДатыОказанияУслуг.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|		ДатыОказанияУслуг.Договор КАК Договор,
	|		ДатыОказанияУслуг.Валюта КАК Валюта,
	|		ДатыОказанияУслуг.ВидУслуги КАК ВидУслуги,
	|		ДатыОказанияУслуг.ДатаОказанияУслуги КАК ДатаОказанияУслуги,
	|		ВЫБОР
	|			КОГДА ДатыОказанияУслуг.ДатаОказанияУслуги <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА НАЧАЛОПЕРИОДА(ДатыОказанияУслуг.ДатаОказанияУслуги, ДЕНЬ)
	|			КОГДА ДатыОказанияУслуг.ДатаОтправленияЖД <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА НАЧАЛОПЕРИОДА(ДатыОказанияУслуг.ДатаОтправленияЖД, ДЕНЬ)
	|			КОГДА ДатыОказанияУслуг.РейсДатаОтправления <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА НАЧАЛОПЕРИОДА(ДатыОказанияУслуг.РейсДатаОтправления, ДЕНЬ)
	|			КОГДА ДатыОказанияУслуг.ДатаОтправленияЗаявки <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА НАЧАЛОПЕРИОДА(ДатыОказанияУслуг.ДатаОтправленияЗаявки, ДЕНЬ)
	|			ИНАЧЕ NULL
	|		КОНЕЦ КАК ДатаКурсаВалют
	|	ИЗ
	|		ДатыОказанияУслуг КАК ДатыОказанияУслуг) КАК ДатыОказанияУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО ДатыОказанияУслуг.Валюта = КурсыВалют.Валюта
	|			И ДатыОказанияУслуг.ДатаКурсаВалют = КурсыВалют.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	т.Вагон КАК Вагон
	|ПОМЕСТИТЬ Вагоны
	|ИЗ
	|	Доходы КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПризнакСобственностиВагонаСрезПоследних.Вагон КАК Вагон,
	|	ПризнакСобственностиВагонаСрезПоследних.ПризнакСобственности КАК ПризнакСобственности
	|ПОМЕСТИТЬ ВТ_ПризнакиСобственностиВагонов
	|ИЗ
	|	РегистрСведений.ПризнакСобственностиВагона.СрезПоследних(
	|			&Дата,
	|			Вагон В
	|				(ВЫБРАТЬ
	|					т.Вагон
	|				ИЗ
	|					Вагоны КАК т)) КАК ПризнакСобственностиВагонаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Вагон КАК Вагон,
	|	ОпределениеНоменклатурнойГруппы.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	1 КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ОпределениеНоменклатурнойГруппыСПриоритетами
	|ИЗ
	|	Вагоны КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПризнакиСобственностиВагонов КАК ПризнакиСобственностиВагонов
	|		ПО ВТ.Вагон = ПризнакиСобственностиВагонов.Вагон
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОпределениеНоменклатурнойГруппы КАК ОпределениеНоменклатурнойГруппы
	|		ПО (ОпределениеНоменклатурнойГруппы.ТипЗаказа = &ТипЗаказа)
	|			И (ЕСТЬNULL(ПризнакиСобственностиВагонов.ПризнакСобственности, ЗНАЧЕНИЕ(Перечисление.ВариантыСобственности.ПустаяСсылка)) = ОпределениеНоменклатурнойГруппы.ВидСобственности)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ.Вагон,
	|	ОпределениеНоменклатурнойГруппы.НоменклатурнаяГруппа,
	|	2
	|ИЗ
	|	Вагоны КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОпределениеНоменклатурнойГруппы КАК ОпределениеНоменклатурнойГруппы
	|		ПО (ОпределениеНоменклатурнойГруппы.ТипЗаказа = &ТипЗаказа)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОпределениеНоменклатурнойГруппыСПриоритетами.Вагон КАК Вагон,
	|	МИНИМУМ(ВТ_ОпределениеНоменклатурнойГруппыСПриоритетами.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ПриоритетыНоменклатурныхГрупп
	|ИЗ
	|	ВТ_ОпределениеНоменклатурнойГруппыСПриоритетами КАК ВТ_ОпределениеНоменклатурнойГруппыСПриоритетами
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОпределениеНоменклатурнойГруппыСПриоритетами.Вагон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОпределениеНоменклатурнойГруппыСПриоритетами.Вагон КАК Вагон,
	|	ВТ_ОпределениеНоменклатурнойГруппыСПриоритетами.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
	|ПОМЕСТИТЬ ВТ_ОпределениеНоменклатурнойГруппы
	|ИЗ
	|	ВТ_ОпределениеНоменклатурнойГруппыСПриоритетами КАК ВТ_ОпределениеНоменклатурнойГруппыСПриоритетами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПриоритетыНоменклатурныхГрупп КАК ВТ_ПриоритетыНоменклатурныхГрупп
	|		ПО ВТ_ОпределениеНоменклатурнойГруппыСПриоритетами.Вагон = ВТ_ПриоритетыНоменклатурныхГрупп.Вагон
	|			И ВТ_ОпределениеНоменклатурнойГруппыСПриоритетами.Приоритет = ВТ_ПриоритетыНоменклатурныхГрупп.Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Доходы.ВидУслуги КАК ВидУслуги,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДатыОказанияУслуг.ДатаОтправленияПоКТК, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДатыОказанияУслуг.ДатаОтправленияПоКТК
	|		КОГДА ЕСТЬNULL(ДатыОказанияУслуг.РейсДатаОтправления, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДатыОказанияУслуг.РейсДатаОтправления
	|		ИНАЧЕ ДатыОказанияУслуг.ДатаСделки
	|	КОНЕЦ КАК Период,
	|	Доходы.Ссылка КАК Сделка,
	|	Доходы.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	Доходы.ГотовоКВыставлению КАК ГотовоКВыставлению,
	|	Доходы.Клиент КАК Клиент,
	|	Доходы.Договор КАК Договор,
	|	Доходы.Ссылка КАК Ссылка,
	|	Доходы.Протокол КАК Протокол,
	|	Доходы.Счет КАК Счет,
	|	Доходы.Калькуляция КАК Калькуляция,
	|	Доходы.Организация КАК Организация,
	|	Доходы.Контейнер КАК Контейнер,
	|	Доходы.Вагон КАК Вагон,
	|	Доходы.ВидТранспортногоСообщения КАК ВидТранспортногоСообщения,
	|	Доходы.ИсточникСтроки КАК ИсточникСтроки,
	|	Доходы.Ставка / КоличествоКонтейнеров.Количество КАК Ставка,
	|	Доходы.СтавкаНДС КАК СтавкаНДС,
	|	Доходы.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Доходы.ТипОперации КАК ТипОперации,
	|	Доходы.Услуга КАК Услуга,
	|	Доходы.ЦФО КАК ЦФО,
	|	Доходы.Валюта КАК Валюта,
	|	ДатыОказанияУслуг.ДатаОтправленияПоСтрокеСП КАК ДатаОтправления,
	|	ДатыОказанияУслуг.ДатаПрибытияПоСтрокеСП КАК ДатаПрибытия,
	|	ДатыОказанияУслуг.Рейс КАК Рейс,
	|	Доходы.СуммаНДС / КоличествоКонтейнеров.Количество КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ВыставленныеУслуги.ГУИД_СУЕ ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьЭкономика,
	|	ВыставленныеУслуги.ОжидаемыйДокумент КАК ОжидаемыйДокумент,
	|	Доходы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА Доходы.Валюта = &ВалютаРубль
	|			ТОГДА &ПустаяДата
	|		ИНАЧЕ КурсыВалютПоДатамОказанияУслуг.ДатаКурсаВалюты
	|	КОНЕЦ КАК ДатаКурсаВалюты,
	|	ДатыОказанияУслуг.ИсточникПолученияДатыОказанияУслуги КАК ИсточникПолученияДатыОказанияУслуги,
	|	Доходы.Ставка / КоличествоКонтейнеров.Количество * ВЫБОР
	|		КОГДА Доходы.Валюта = &ВалютаРубль
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(КурсыВалютПоДатамОказанияУслуг.Курс, 0) / ЕСТЬNULL(КурсыВалютПоДатамОказанияУслуг.Кратность, 1)
	|	КОНЕЦ КАК СтавкаРуб,
	|	Доходы.СуммаНДС / КоличествоКонтейнеров.Количество * ВЫБОР
	|		КОГДА Доходы.Валюта = &ВалютаРубль
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(КурсыВалютПоДатамОказанияУслуг.Курс, 0) / ЕСТЬNULL(КурсыВалютПоДатамОказанияУслуг.Кратность, 1)
	|	КОНЕЦ КАК СуммаНДСРуб,
	|	ВЫБОР
	|		КОГДА Доходы.Валюта = &ВалютаРубль
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(КурсыВалютПоДатамОказанияУслуг.Курс, 0)
	|	КОНЕЦ КАК Курс,
	|	ВЫБОР
	|		КОГДА Доходы.Валюта = &ВалютаРубль
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(КурсыВалютПоДатамОказанияУслуг.Кратность, 1)
	|	КОНЕЦ КАК Кратность,
	|	ДатыОказанияУслуг.РасчетнаяДатаЗавершенияПеревозки КАК РасчетнаяДатаЗавершенияПеревозки,
	|	ДатыОказанияУслуг.ИсточникПолученияДатыЗавершенияПеревозки КАК ИсточникПолученияДатыЗавершенияПеревозки,
	|	Доходы.ВидПеревозки КАК ВидПеревозки,
	|	ВТ_ОпределениеНоменклатурнойГруппы.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ДатыОказанияУслуг.ПравилоФормирования КАК ПравилоФормированияДокументов,
	|	ЕСТЬNULL(ВыставленныеУслуги.СформированыЗакрывающиеДокументы, Доходы.УслугаВыставлена) КАК ВыставленыЗакрывающиеДокументы,
	|	ЕСТЬNULL(ВыставленныеУслуги.ГУИД_Доходы, """") КАК ИдентификаторСтрокиДохода,
	|	ЕСТЬNULL(ВыставленныеУслуги.УчДокумент, НЕОПРЕДЕЛЕНО) КАК ВыставленныйДокумент,
	|	ВыставленныеУслуги.НеВыставлятьКлиенту КАК НеВыставлятьКлиенту,
	|	Доходы.ЖелтаяДоплата КАК ЖелтаяДоплата,
	|	ВыставленныеУслуги.ИсточникПоявленияСтрокиЭкономики КАК ДоходыИсточникПоявленияСтрокиЭкономики,
	|	Доходы.Заявка КАК Заявка
	|ИЗ
	|	Доходы КАК Доходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВыставленныеУслуги КАК ВыставленныеУслуги
	|		ПО Доходы.ИдентификаторСУЕ = ВыставленныеУслуги.ГУИД_СУЕ
	|			И Доходы.Клиент = ВыставленныеУслуги.Клиент
	|			И Доходы.Услуга = ВыставленныеУслуги.Услуга
	|			И (НЕ Доходы.УслугаВнеСтавки)
	|			И Доходы.УслугаВнеСтавки = ВыставленныеУслуги.УслугаВнеСтавки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДатыОказанияУслуг КАК ДатыОказанияУслуг
	|		ПО Доходы.ИдентификаторСУЕ = ДатыОказанияУслуг.ИдентификаторСУЕ
	|			И Доходы.Услуга = ДатыОказанияУслуг.Услуга
	|			И Доходы.Клиент = ДатыОказанияУслуг.Клиент
	|			И Доходы.Валюта = ДатыОказанияУслуг.Валюта
	|			И Доходы.ВидУслуги = ДатыОказанияУслуг.ВидУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КоличествоКонтейнеров КАК КоличествоКонтейнеров
	|		ПО Доходы.УслугаВнеСтавки = КоличествоКонтейнеров.УслугаВнеСтавки
	|			И Доходы.ДоплатныеКТК = КоличествоКонтейнеров.ДоплатныеКТК
	|			И Доходы.Услуга = КоличествоКонтейнеров.Услуга
	|			И Доходы.Клиент = КоличествоКонтейнеров.Клиент
	|			И Доходы.Договор = КоличествоКонтейнеров.Договор
	|			И Доходы.Ссылка = КоличествоКонтейнеров.Ссылка
	|			И Доходы.Протокол = КоличествоКонтейнеров.Протокол
	|			И Доходы.Калькуляция = КоличествоКонтейнеров.Калькуляция
	|			И Доходы.Организация = КоличествоКонтейнеров.Организация
	|			И Доходы.ТипОперации = КоличествоКонтейнеров.ТипОперации
	|			И Доходы.Валюта = КоличествоКонтейнеров.Валюта
	|			И Доходы.Вагон = КоличествоКонтейнеров.Вагон
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалютПоДатамОказанияУслуг КАК КурсыВалютПоДатамОказанияУслуг
	|		ПО Доходы.Услуга = КурсыВалютПоДатамОказанияУслуг.Услуга
	|			И Доходы.Клиент = КурсыВалютПоДатамОказанияУслуг.Клиент
	|			И Доходы.ИдентификаторСУЕ = КурсыВалютПоДатамОказанияУслуг.ИдентификаторСУЕ
	|			И Доходы.Договор = КурсыВалютПоДатамОказанияУслуг.Договор
	|			И Доходы.Валюта = КурсыВалютПоДатамОказанияУслуг.Валюта
	|			И Доходы.ВидУслуги = КурсыВалютПоДатамОказанияУслуг.ВидУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОпределениеНоменклатурнойГруппы КАК ВТ_ОпределениеНоменклатурнойГруппы
	|		ПО Доходы.Вагон = ВТ_ОпределениеНоменклатурнойГруппы.Вагон
	|ГДЕ
	|	Доходы.УслугаВнеСтавки = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Доходы.ВидУслуги,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДатыОказанияУслуг.ДатаОтправленияПоКТК, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДатыОказанияУслуг.ДатаОтправленияПоКТК
	|		КОГДА ЕСТЬNULL(ДатыОказанияУслуг.РейсДатаОтправления, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДатыОказанияУслуг.РейсДатаОтправления
	|		ИНАЧЕ ДатыОказанияУслуг.ДатаСделки
	|	КОНЕЦ,
	|	Доходы.Ссылка,
	|	Доходы.ИдентификаторСУЕ,
	|	Доходы.ГотовоКВыставлению,
	|	Доходы.Клиент,
	|	Доходы.Договор,
	|	Доходы.Ссылка,
	|	Доходы.Протокол,
	|	Доходы.Счет,
	|	Доходы.Калькуляция,
	|	Доходы.Организация,
	|	Доходы.Контейнер,
	|	Доходы.Вагон,
	|	Доходы.ВидТранспортногоСообщения,
	|	Доходы.ИсточникСтроки,
	|	Доходы.Ставка / КоличествоКонтейнеров.Количество,
	|	Доходы.СтавкаНДС,
	|	Доходы.СуммаВключаетНДС,
	|	Доходы.ТипОперации,
	|	Доходы.Услуга,
	|	Доходы.ЦФО,
	|	Доходы.Валюта,
	|	ДатыОказанияУслуг.ДатаОтправленияПоСтрокеСП,
	|	ДатыОказанияУслуг.ДатаПрибытияПоСтрокеСП,
	|	ДатыОказанияУслуг.Рейс,
	|	Доходы.СуммаНДС / КоличествоКонтейнеров.Количество,
	|	ВЫБОР
	|		КОГДА ВыставленныеУслуги.ГУИД_СУЕ ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ВыставленныеУслуги.ОжидаемыйДокумент,
	|	Доходы.ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА Доходы.Валюта = &ВалютаРубль
	|			ТОГДА &ПустаяДата
	|		ИНАЧЕ КурсыВалютПоДатамОказанияУслуг.ДатаКурсаВалюты
	|	КОНЕЦ,
	|	ДатыОказанияУслуг.ИсточникПолученияДатыОказанияУслуги,
	|	Доходы.Ставка / КоличествоКонтейнеров.Количество * ВЫБОР
	|		КОГДА Доходы.Валюта = &ВалютаРубль
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(КурсыВалютПоДатамОказанияУслуг.Курс, 0) / ЕСТЬNULL(КурсыВалютПоДатамОказанияУслуг.Кратность, 1)
	|	КОНЕЦ,
	|	Доходы.СуммаНДС / КоличествоКонтейнеров.Количество * ВЫБОР
	|		КОГДА Доходы.Валюта = &ВалютаРубль
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(КурсыВалютПоДатамОказанияУслуг.Курс, 0) / ЕСТЬNULL(КурсыВалютПоДатамОказанияУслуг.Кратность, 1)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Доходы.Валюта = &ВалютаРубль
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(КурсыВалютПоДатамОказанияУслуг.Курс, 0)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Доходы.Валюта = &ВалютаРубль
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(КурсыВалютПоДатамОказанияУслуг.Кратность, 1)
	|	КОНЕЦ,
	|	ДатыОказанияУслуг.РасчетнаяДатаЗавершенияПеревозки,
	|	ДатыОказанияУслуг.ИсточникПолученияДатыЗавершенияПеревозки,
	|	Доходы.ВидПеревозки,
	|	ВТ_ОпределениеНоменклатурнойГруппы.НоменклатурнаяГруппа,
	|	ДатыОказанияУслуг.ПравилоФормирования,
	|	ЕСТЬNULL(ВыставленныеУслуги.СформированыЗакрывающиеДокументы, ЛОЖЬ),
	|	ЕСТЬNULL(ВыставленныеУслуги.ГУИД_Доходы, """"),
	|	ЕСТЬNULL(ВыставленныеУслуги.УчДокумент, НЕОПРЕДЕЛЕНО),
	|	ВыставленныеУслуги.НеВыставлятьКлиенту,
	|	NULL,
	|	ВыставленныеУслуги.ИсточникПоявленияСтрокиЭкономики,
	|	Доходы.Заявка
	|ИЗ
	|	Доходы КАК Доходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВыставленныеУслуги КАК ВыставленныеУслуги
	|		ПО Доходы.ИдентификаторСУЕ = ВыставленныеУслуги.ГУИД_СУЕ
	|			И Доходы.ГУИД_Доходы = ВыставленныеУслуги.ГУИД_Доходы
	|			И Доходы.Услуга = ВыставленныеУслуги.Услуга
	|			И Доходы.Клиент = ВыставленныеУслуги.Клиент
	|			И (Доходы.УслугаВнеСтавки)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыОказанияУслуг КАК ДатыОказанияУслуг
	|		ПО Доходы.ИдентификаторСУЕ = ДатыОказанияУслуг.ИдентификаторСУЕ
	|			И Доходы.Услуга = ДатыОказанияУслуг.Услуга
	|			И Доходы.Клиент = ДатыОказанияУслуг.Клиент
	|			И Доходы.Валюта = ДатыОказанияУслуг.Валюта
	|			И Доходы.ВидУслуги = ДатыОказанияУслуг.ВидУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КоличествоКонтейнеров КАК КоличествоКонтейнеров
	|		ПО Доходы.УслугаВнеСтавки = КоличествоКонтейнеров.УслугаВнеСтавки
	|			И Доходы.ДоплатныеКТК = КоличествоКонтейнеров.ДоплатныеКТК
	|			И Доходы.Услуга = КоличествоКонтейнеров.Услуга
	|			И Доходы.Клиент = КоличествоКонтейнеров.Клиент
	|			И Доходы.Договор = КоличествоКонтейнеров.Договор
	|			И Доходы.Ссылка = КоличествоКонтейнеров.Ссылка
	|			И Доходы.Протокол = КоличествоКонтейнеров.Протокол
	|			И Доходы.Калькуляция = КоличествоКонтейнеров.Калькуляция
	|			И Доходы.Организация = КоличествоКонтейнеров.Организация
	|			И Доходы.ТипОперации = КоличествоКонтейнеров.ТипОперации
	|			И Доходы.Валюта = КоличествоКонтейнеров.Валюта
	|			И Доходы.Вагон = КоличествоКонтейнеров.Вагон
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалютПоДатамОказанияУслуг КАК КурсыВалютПоДатамОказанияУслуг
	|		ПО Доходы.Услуга = КурсыВалютПоДатамОказанияУслуг.Услуга
	|			И Доходы.Клиент = КурсыВалютПоДатамОказанияУслуг.Клиент
	|			И Доходы.ИдентификаторСУЕ = КурсыВалютПоДатамОказанияУслуг.ИдентификаторСУЕ
	|			И Доходы.Договор = КурсыВалютПоДатамОказанияУслуг.Договор
	|			И Доходы.Валюта = КурсыВалютПоДатамОказанияУслуг.Валюта
	|			И Доходы.ВидУслуги = КурсыВалютПоДатамОказанияУслуг.ВидУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОпределениеНоменклатурнойГруппы КАК ВТ_ОпределениеНоменклатурнойГруппы
	|		ПО Доходы.Вагон = ВТ_ОпределениеНоменклатурнойГруппы.Вагон
	|ГДЕ
	|	Доходы.УслугаВнеСтавки = ИСТИНА";
	Возврат ТекстЗапроса;
КонецФункции

//Субботин 74442 11.09.2023 начало
Процедура Сделка_ДобавитьВОчередьСформироватьДвиженияДанныеПоОтправлениям(СделкаСсылка)
 	мз = РегистрыСведений.ОчередьЗаписиДанныхПоОтправлениям.СоздатьМенеджерЗаписи();
	мз.ОбрабатываемыйОбъект = СделкаСсылка;
	мз.ДатаЗаписи = ТекущаяДата();
	мз.Пользователь = Пользователи.ТекущийПользователь();
	мз.Записать();

	
КонецПроцедуры	
//Субботин 74442 11.09.2023 Конец

Процедура Сделка_СформироватьДвиженияДоходыРасходыСделки(ОбъектСделка)
		
КонецПроцедуры


#КонецОбласти

#Область РеализацияТоваровУслуг

Процедура РТУ_СформироватьДвиженияДоходыРасходы(ОбъектРТУ) Экспорт
	//Евросиб - АСуслов 09.11.2022 16:47:27 #59240
	//(
	//РТУ_СформироватьДвиженияПлановыеДоходыВО(ОбъектРТУ);
	//)
	//Евросиб - АСуслов 09.11.2022 16:47:30 #59240
	РТУ_СформироватьДвиженияФактическиеДоходыВО(ОбъектРТУ);
	РТУ_СформироватьДвиженияФактическиеДоходыУУ(ОбъектРТУ);
КонецПроцедуры

//РТУ. Фактические доходы ВО.
Процедура РТУ_СформироватьДвиженияФактическиеДоходыВО(ОбъектРТУ) Экспорт
	
	ОбъектРТУ.Движения.ФактическиеДоходыВО.Записывать = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = РТУ_ПолучитьТекстЗапросаФактическиеДоходы("ВО");
	РТУ_УстановитьПараметрыЗапросаФактическиеДоходы(Запрос, ОбъектРТУ);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	ОбъектРТУ.Движения.ФактическиеДоходыВО.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры //СформироватьДвиженияФактическиеДоходыВО

//РТУ. Фактические доходы УУ.
Процедура РТУ_СформироватьДвиженияФактическиеДоходыУУ(ОбъектРТУ) Экспорт
	
	ОбъектРТУ.Движения.ФактическиеДоходыУУ.Записывать = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = РТУ_ПолучитьТекстЗапросаФактическиеДоходы("УУ");
	РТУ_УстановитьПараметрыЗапросаФактическиеДоходы(Запрос, ОбъектРТУ);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	ОбъектРТУ.Движения.ФактическиеДоходыУУ.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры //СформироватьДвиженияФактическиеДоходыВО

//РТУ. Текст запроса фактические доходы.
Функция РТУ_ПолучитьТекстЗапросаФактическиеДоходы(ВидУчета)
	
	//ДИТ Шевченко А.В. 31.10.2022 60146 Добавил поле "ДокументРеализации" в запрос
	
	ТекстЗапроса = 	
	"ВЫБРАТЬ
	|	РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.ПериодВО КАК Период,
	|	РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.Организация КАК Организация,
	// Евросиб US 82073 TA 114490 Рыбьяков К.А. 24.07.2025 ((
	//|	РеализацияТоваровУслугРасшифровкаУслугПоТС.УдалитьСделка КАК Сделка,
	//|	РеализацияТоваровУслугРасшифровкаУслугПоТС.УдалитьСтрокаСвязьУчетныхЕдиниц КАК ИдентификаторСУЕ,
	|	РеализацияТоваровУслугРасшифровкаУслугПоТС.КлючАналитикиСоставаПоезда.Сделка КАК Сделка,
	|	РеализацияТоваровУслугРасшифровкаУслугПоТС.КлючАналитикиСоставаПоезда.ИдентификаторКлюча КАК ИдентификаторСУЕ,
	// Евросиб Рыбьяков К.А. 24.07.2025 ))
	|	РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.ЦФО КАК ЦФО,
	|	РеализацияТоваровУслугУслуги.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.Контрагент КАК Клиент,
	|	РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.ДоговорКонтрагента КАК Договор,
	|	РеализацияТоваровУслугРасшифровкаУслугПоТС.Услуга КАК Услуга,
	|	РеализацияТоваровУслугРасшифровкаУслугПоТС.Вагон КАК Вагон,
	|	РеализацияТоваровУслугРасшифровкаУслугПоТС.Контейнер КАК Контейнер,
	//Евросиб Каблов 14.10.2025 ( #107942	
	|	РеализацияТоваровУслугРасшифровкаУслугПоТС.СтрокаДоходовСделки КАК СтрокаДоходовСделки,
	//Евросиб Каблов 14.10.2025 ) #107942
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.СуммаВключаетНДС
	|			ТОГДА 0
	|		ИНАЧЕ РеализацияТоваровУслугРасшифровкаУслугПоТС.СуммаНДС
	|	КОНЕЦ + РеализацияТоваровУслугРасшифровкаУслугПоТС.Сумма КАК Сумма,
	|	РеализацияТоваровУслугРасшифровкаУслугПоТС.СуммаНДС КАК СуммаНДС,
	|	РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК Валюта,
	|	РеализацияТоваровУслугРасшифровкаУслугПоТС.СтавкаНДС КАК СтавкаНДС,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДоходов.Выручка) КАК ТипОперации,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов <> &ВалютаРегл
	|			ТОГДА КурсыВалютСрезПоследних.Курс
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КурсВалюты,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов <> &ВалютаРегл
	|			ТОГДА КурсыВалютСрезПоследних.Кратность
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КратностьВалюты,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов <> &ВалютаРегл
	|			ТОГДА КурсыВалютСрезПоследних.Период
	|		ИНАЧЕ РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.ДатаДокумента
	|	КОНЕЦ КАК ДатаКурсаВалюты,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов <> &ВалютаРегл
	|			ТОГДА (ВЫБОР
	|					КОГДА РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.СуммаВключаетНДС
	|						ТОГДА 0
	|					ИНАЧЕ РеализацияТоваровУслугРасшифровкаУслугПоТС.СуммаНДС
	|				КОНЕЦ + РеализацияТоваровУслугРасшифровкаУслугПоТС.Сумма) * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.СуммаВключаетНДС
	|					ТОГДА 0
	|				ИНАЧЕ РеализацияТоваровУслугРасшифровкаУслугПоТС.СуммаНДС
	|			КОНЕЦ + РеализацияТоваровУслугРасшифровкаУслугПоТС.Сумма
	|	КОНЕЦ КАК СуммаРуб,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов <> &ВалютаРегл
	|			ТОГДА РеализацияТоваровУслугРасшифровкаУслугПоТС.СуммаНДС * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность
	|		ИНАЧЕ РеализацияТоваровУслугРасшифровкаУслугПоТС.СуммаНДС
	|	КОНЕЦ КАК СуммаНДСРуб,
	|	РеализацияТоваровУслугУслуги.Ссылка КАК ДокументРеализации
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.РасшифровкаУслугПоТС КАК РеализацияТоваровУслугРасшифровкаУслугПоТС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|		ПО РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка = РеализацияТоваровУслугУслуги.Ссылка
	|			И РеализацияТоваровУслугРасшифровкаУслугПоТС.СтрокаДоходовСделки = РеализацияТоваровУслугУслуги.СтрокаДоходовСделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКурса, ) КАК КурсыВалютСрезПоследних
	|		ПО РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов = КурсыВалютСрезПоследних.Валюта
	|ГДЕ
	|	РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка = &Ссылка";
	Если ВидУчета = "УУ" Тогда
		//ВРЕМЕННО ДЛЯ АД
		//ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.ПериодВО", "РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.ДатаОказанияУслуги");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.ПериодВО", "ВЫБОР КОГДА РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.ДатаОказанияУслуги = ДатаВремя(1,1,1) ИЛИ РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.ДатаОказанияУслуги > РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.ДатаДокумента ТОГДА РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.ДатаДокумента ИНАЧЕ РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка.ДатаОказанияУслуги КОНЕЦ");
	КонецЕсли; 
	Возврат ТекстЗапроса;
		
КонецФункции

Процедура РТУ_УстановитьПараметрыЗапросаФактическиеДоходы(Запрос, ОбъектРТУ)
	
	Запрос.УстановитьПараметр("Ссылка", ОбъектРТУ.Ссылка);
	Запрос.УстановитьПараметр("ВалютаРегл", Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("ДатаКурса", ОбъектРТУ.ДатаДокумента);
		
КонецПроцедуры
	
#КонецОбласти

#Область КорректировкаРеализации
Процедура КРТУ_СформироватьДвиженияДоходыРасходы(ОбъектКРТУ) Экспорт
 
	СформироватьДвиженияФактическиеДоходыВО(ОбъектКРТУ);
	СформироватьДвиженияФактическиеДоходыУУ(ОбъектКРТУ);
		
КонецПроцедуры

//Корректировка реализации. Фактические доходы ВО.
Процедура СформироватьДвиженияФактическиеДоходыВО(ОбъектКРТУ) Экспорт
	
	ОбъектКРТУ.Движения.ФактическиеДоходыВО.Записывать = Истина;
	Запрос = Новый Запрос;
	//ДИТ Шевченко А.В. 31.10.2022 60146 -начало
	Если ТипЗнч(ОбъектКРТУ) = Тип("ДокументОбъект.КорректировкаРеализации") Тогда
		Если ОбъектКРТУ.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование Тогда
			Запрос.Текст = КРТУ_ПолучитьТекстЗапросаФактическиеДоходыАннулирование("ВО");
			КРТУ_УстановитьПараметрыЗапросаФактическиеДоходыАннулирование(Запрос, ОбъектКРТУ, "ВО");	
		КонецЕсли;	
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Запрос.Текст) Тогда
		Запрос.Текст = КРТУ_ПолучитьТекстЗапросаФактическиеДоходы("ВО");
		КРТУ_УстановитьПараметрыЗапросаФактическиеДоходы(Запрос, ОбъектКРТУ, "ВО")
	КонецЕсли;
	//ДИТ Шевченко А.В. 31.10.2022 60146 -конец
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	ОбъектКРТУ.Движения.ФактическиеДоходыВО.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры //СформироватьДвиженияФактическиеДоходыВО

//Корректировка реализации. Фактические доходы УУ.
Процедура СформироватьДвиженияФактическиеДоходыУУ(ОбъектКРТУ) Экспорт
	
	ОбъектКРТУ.Движения.ФактическиеДоходыУУ.Записывать = Истина;
	Запрос = Новый Запрос;
	//ДИТ Шевченко А.В. 31.10.2022 60146 -начало
	Если ТипЗнч(ОбъектКРТУ) = Тип("ДокументОбъект.КорректировкаРеализации") Тогда
		Если ОбъектКРТУ.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование Тогда
			Запрос.Текст = КРТУ_ПолучитьТекстЗапросаФактическиеДоходыАннулирование("УУ");
			КРТУ_УстановитьПараметрыЗапросаФактическиеДоходыАннулирование(Запрос, ОбъектКРТУ, "УУ");	
		КонецЕсли;	
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Запрос.Текст) Тогда
		Запрос.Текст = КРТУ_ПолучитьТекстЗапросаФактическиеДоходы("УУ");
		КРТУ_УстановитьПараметрыЗапросаФактическиеДоходы(Запрос, ОбъектКРТУ, "УУ");
	КонецЕсли;
	//ДИТ Шевченко А.В. 31.10.2022 60146 -конец
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	ОбъектКРТУ.Движения.ФактическиеДоходыУУ.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры //СформироватьДвиженияФактическиеДоходыВО

Функция КРТУ_ПолучитьТекстЗапросаФактическиеДоходыАннулирование(ВидУчета)
	ТекстЗапроса = "ВЫБРАТЬ
	|	&ПериодВО КАК Период,
	|	ФактическиеДоходыВО.Организация КАК Организация,
	|	ФактическиеДоходыВО.ЦФО КАК ЦФО,
	|	ФактическиеДоходыВО.Сделка КАК Сделка,
	|	ФактическиеДоходыВО.Услуга КАК Услуга,
	|	ФактическиеДоходыВО.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ФактическиеДоходыВО.Вагон КАК Вагон,
	|	ФактическиеДоходыВО.Контейнер КАК Контейнер,
	|	СУММА(-ФактическиеДоходыВО.Сумма) КАК Сумма,
	|	СУММА(-ФактическиеДоходыВО.СуммаНДС) КАК СуммаНДС,
	|	ФактическиеДоходыВО.Клиент КАК Клиент,
	|	ФактическиеДоходыВО.Договор КАК Договор,
	|	ФактическиеДоходыВО.Валюта КАК Валюта,
	|	ФактическиеДоходыВО.СтавкаНДС КАК СтавкаНДС,
	|	ФактическиеДоходыВО.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ФактическиеДоходыВО.ТипОперации КАК ТипОперации,
	|	МАКСИМУМ(ФактическиеДоходыВО.ДатаКурсаВалюты) КАК ДатаКурсаВалюты,
	|	СУММА(-ФактическиеДоходыВО.СуммаРуб) КАК СуммаРуб,
	|	СУММА(-ФактическиеДоходыВО.СуммаНДСРуб) КАК СуммаНДСРуб,
	|	ФактическиеДоходыВО.ДокументРеализации КАК ДокументРеализации
	|ИЗ
	|	РегистрНакопления.ФактическиеДоходыВО КАК ФактическиеДоходыВО
	|ГДЕ
	|	ФактическиеДоходыВО.ДокументРеализации = &ИсправляемыйДокумент
	|	И НЕ ФактическиеДоходыВО.Регистратор = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ФактическиеДоходыВО.Сделка,
	|	ФактическиеДоходыВО.НоменклатурнаяГруппа,
	|	ФактическиеДоходыВО.Вагон,
	|	ФактическиеДоходыВО.ТипОперации,
	|	ФактическиеДоходыВО.Клиент,
	|	ФактическиеДоходыВО.Договор,
	|	ФактическиеДоходыВО.ИдентификаторСУЕ,
	|	ФактическиеДоходыВО.СтавкаНДС,
	|	ФактическиеДоходыВО.ЦФО,
	|	ФактическиеДоходыВО.Валюта,
	|	ФактическиеДоходыВО.Организация,
	|	ФактическиеДоходыВО.Контейнер,
	|	ФактическиеДоходыВО.Услуга,
	|	ФактическиеДоходыВО.ДокументРеализации";
	
	Если ВидУчета = "УУ" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПериодВО", "&ПериодУУ");
	КонецЕсли; 
	Возврат ТекстЗапроса;
	
КонецФункции	

Процедура КРТУ_УстановитьПараметрыЗапросаФактическиеДоходыАннулирование(Запрос, ОбъектКРТУ, ВидУчета)
	
	Запрос.УстановитьПараметр("ИсправляемыйДокумент", ОбъектКРТУ.ИсходныйДокументРеализации);
	Если ТипЗнч(ОбъектКРТУ.ДокументРеализации) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		Если ОбъектКРТУ.ДокументРеализации.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда 
			Запрос.УстановитьПараметр("ИсправляемыйДокумент", ОбъектКРТУ.ДокументРеализации); 
		КонецЕсли;
	КонецЕсли;	
	Запрос.УстановитьПараметр("Ссылка", ОбъектКРТУ.Ссылка);
	Если ВидУчета = "УУ" Тогда
		ПервоначальныйРТУ = БухгалтерскийУчетПереопределяемый.ПолучитьИсправляемыйДокументРеализации(ОбъектКРТУ.Ссылка, Истина);
		ДатаДокументаПервоначальногоПТУ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПервоначальныйРТУ, "ДатаДокумента");
		Запрос.УстановитьПараметр("ПериодУУ", ДатаДокументаПервоначальногоПТУ);
	ИначеЕсли ВидУчета = "ВО" Тогда
		//Евросиб Каблов 05.01.2024 ( #79370
		//Запрос.УстановитьПараметр("ПериодВО", ОбъектКРТУ.Ссылка.ПериодВО);
		Запрос.УстановитьПараметр("ПериодВО", НачалоМесяца(ОбъектКРТУ.ПериодВО));
		//Евросиб Каблов 05.01.2024 )
	КонецЕсли;
КонецПроцедуры	

//Текст запроса фактические доходы
Функция КРТУ_ПолучитьТекстЗапросаФактическиеДоходы(ВидУчета)
	
	//ДИТ Шевченко А.В. 31.10.2022 60146 Добавил поле "ДокументРеализации" в запрос
	
	ТекстЗапроса =
	//Евросиб Каблов 22.07.2025 ( #114890
	"ВЫБРАТЬ
	|	ИсторияКорректировокРеализаций.КорректируемыйДокумент КАК КорректируемыйДокумент
	|ПОМЕСТИТЬ КорректируемыеДокументы
	|ИЗ
	|	РегистрСведений.ИсторияКорректировокРеализаций КАК ИсторияКорректировокРеализаций
	|ГДЕ
	|	ИсторияКорректировокРеализаций.Регистратор = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//Евросиб Каблов 22.07.2025 )
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ЦФО КАК ЦФО,
	|	ВложенныйЗапрос.Сделка КАК Сделка,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ВложенныйЗапрос.Вагон КАК Вагон,
	|	ВложенныйЗапрос.Контейнер КАК Контейнер,
	//Евросиб Каблов 14.10.2025 ( #107942	
	|	ВложенныйЗапрос.СтрокаДоходовСделки,
	//Евросиб Каблов 14.10.2025 ) #107942
	|	ВложенныйЗапрос.Клиент КАК Клиент,
	|	ВложенныйЗапрос.Договор КАК Договор,
	|	ВложенныйЗапрос.Валюта КАК Валюта,
	|	ВложенныйЗапрос.СтавкаНДС КАК СтавкаНДС,
	|	ВложенныйЗапрос.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ВложенныйЗапрос.ТипОперации КАК ТипОперации,
	|	МАКСИМУМ(ВложенныйЗапрос.ДатаКурсаВалюты) КАК ДатаКурсаВалюты,
	|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
	|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ВложенныйЗапрос.СуммаРуб) КАК СуммаРуб,
	|	СУММА(ВложенныйЗапрос.СуммаНДСРуб) КАК СуммаНДСРуб,
	|	&ДокументРеализации КАК ДокументРЕализации
	|ИЗ
	|	(ВЫБРАТЬ
	|		&ПериодВО КАК Период,
	|		ФактическиеДоходыВО.Организация КАК Организация,
	|		ФактическиеДоходыВО.ЦФО КАК ЦФО,
	|		ФактическиеДоходыВО.Сделка КАК Сделка,
	|		ФактическиеДоходыВО.Услуга КАК Услуга,
	|		ФактическиеДоходыВО.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|		ФактическиеДоходыВО.Вагон КАК Вагон,
	|		ФактическиеДоходыВО.Контейнер КАК Контейнер,
	//Евросиб Каблов 14.10.2025 ( #107942	
	|		ФактическиеДоходыВО.СтрокаДоходовСделки КАК СтрокаДоходовСделки,
	//Евросиб Каблов 14.10.2025 ) #107942
	|		-ФактическиеДоходыВО.Сумма КАК Сумма,
	|		-ФактическиеДоходыВО.СуммаНДС КАК СуммаНДС,
	|		ФактическиеДоходыВО.Клиент КАК Клиент,
	|		ФактическиеДоходыВО.Договор КАК Договор,
	|		ФактическиеДоходыВО.Валюта КАК Валюта,
	|		ФактическиеДоходыВО.СтавкаНДС КАК СтавкаНДС,
	|		ФактическиеДоходыВО.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|		ФактическиеДоходыВО.ТипОперации КАК ТипОперации,
	|		ФактическиеДоходыВО.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|		-ФактическиеДоходыВО.СуммаРуб КАК СуммаРуб,
	|		-ФактическиеДоходыВО.СуммаНДСРуб КАК СуммаНДСРуб
	|	ИЗ
	|		РегистрНакопления.ФактическиеДоходыВО КАК ФактическиеДоходыВО
	|	ГДЕ
	//Евросиб Каблов 22.07.2025 ( #114890
	//|		ФактическиеДоходыВО.Регистратор = &ИсправляемыйДокумент
	|		ФактическиеДоходыВО.Регистратор В
	|				(ВЫБРАТЬ
	|					КорректируемыеДокументы.КорректируемыйДокумент КАК КорректируемыйДокумент
	|				ИЗ
	|					КорректируемыеДокументы КАК КорректируемыеДокументы)
	//Евросиб Каблов 22.07.2025 ( #114890
	//Евросиб Каблов 08.06.2022 ( Task 52863
	|		И ВЫБОР
	|				КОГДА ФактическиеДоходыВО.Регистратор ССЫЛКА Документ.ОтчетКомитентуОПродажах
	|					ТОГДА ВЫБОР
	|							КОГДА &КорректировкаОтчетаКомитенту
	|								ТОГДА ФактическиеДоходыВО.Услуга <> &НоменклатураВознаграждение
	|							ИНАЧЕ ФактическиеДоходыВО.Услуга = &НоменклатураВознаграждение
	|						КОНЕЦ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	//Евросиб Каблов 08.06.2022 )
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		&ПериодВО,
	|		КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка.Организация,
	|		КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка.ЦФО,
	// Евросиб US 82073 TA 114490 Рыбьяков К.А. 24.07.2025 ((
	//|		КорректировкаРеализацииРасшифровкаУслугПоТС.УдалитьСделка,
	|		КорректировкаРеализацииРасшифровкаУслугПоТС.КлючАналитикиСоставаПоезда.Сделка,
	// Евросиб Рыбьяков К.А. 24.07.2025 ))
	|		КорректировкаРеализацииРасшифровкаУслугПоТС.Услуга,
	// Евросиб US 82073 TA 114490 Рыбьяков К.А. 24.07.2025 ((
	//|		КорректировкаРеализацииРасшифровкаУслугПоТС.УдалитьСтрокаСвязьУчетныхЕдиниц,
	|		КорректировкаРеализацииРасшифровкаУслугПоТС.КлючАналитикиСоставаПоезда.ИдентификаторКлюча,
	// Евросиб Рыбьяков К.А. 24.07.2025 ))
	|		КорректировкаРеализацииРасшифровкаУслугПоТС.Вагон,
	|		КорректировкаРеализацииРасшифровкаУслугПоТС.Контейнер,
	//Евросиб Каблов 14.10.2025 ( #107942	
	|		КорректировкаРеализацииРасшифровкаУслугПоТС.СтрокаДоходовСделки,
	//Евросиб Каблов 14.10.2025 ) #107942
	//Евросиб Каблов 26.08.2025 ( #114890
	//|		ВЫБОР
	//|			КОГДА КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка.СуммаВключаетНДС
	//|				ТОГДА 0
	//|			ИНАЧЕ КорректировкаРеализацииРасшифровкаУслугПоТС.СуммаНДС
	//|		КОНЕЦ + КорректировкаРеализацииРасшифровкаУслугПоТС.Сумма,
	//|		КорректировкаРеализацииРасшифровкаУслугПоТС.СуммаНДС,
	|		(ВЫБОР
	|			КОГДА КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка.СуммаВключаетНДС
	|				ТОГДА 0
	|			ИНАЧЕ КорректировкаРеализацииРасшифровкаУслугПоТС.СуммаНДС
	|		КОНЕЦ + КорректировкаРеализацииРасшифровкаУслугПоТС.Сумма - ВЫБОР
	|			КОГДА КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)
	|				ТОГДА ВЫБОР
	|						КОГДА КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка.СуммаВключаетНДС
	|							ТОГДА 0
	|						ИНАЧЕ КорректировкаРеализацииРасшифровкаУслугПоТС.СуммаНДСДоИзменения
	|					КОНЕЦ + КорректировкаРеализацииРасшифровкаУслугПоТС.СуммаДоИзменения
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|		(КорректировкаРеализацииРасшифровкаУслугПоТС.СуммаНДС - ВЫБОР
	|			КОГДА КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)
	|				ТОГДА КорректировкаРеализацииРасшифровкаУслугПоТС.СуммаНДСДоИзменения
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	//Евросиб Каблов 26.08.2025 ) #114890
	|		КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка.Контрагент,
	|		КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка.ДоговорКонтрагента,
	|		КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов,
	|		КорректировкаРеализацииРасшифровкаУслугПоТС.СтавкаНДСДоИзменения,
	|		СделкаДоходы.НоменклатурнаяГруппа,
	|		ВЫБОР
	|			КОГДА КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка.КорректировкаОтчетаКомитенту
	|						И КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка.ЭтоИзменениеВознаграждения
	|					ИЛИ НЕ КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка.КорректировкаОтчетаКомитенту
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДоходов.Выручка)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоходов.Возмещаемые)
	|		КОНЕЦ,
	|		КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка.ДатаДокумента,
	//Евросиб Каблов 26.08.2025 ( #114890
	//|		ВЫБОР
	//|			КОГДА КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов <> &ВалютаРегл
	//|				ТОГДА (ВЫБОР
	//|						КОГДА КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка.СуммаВключаетНДС
	//|							ТОГДА 0
	//|						ИНАЧЕ КорректировкаРеализацииРасшифровкаУслугПоТС.СуммаНДС
	//|					КОНЕЦ + КорректировкаРеализацииРасшифровкаУслугПоТС.Сумма) * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность
	//|			ИНАЧЕ ВЫБОР
	//|					КОГДА КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка.СуммаВключаетНДС
	//|						ТОГДА 0
	//|					ИНАЧЕ ВЫБОР
	//|							КОГДА КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка.СуммаВключаетНДС
	//|								ТОГДА 0
	//|							ИНАЧЕ КорректировкаРеализацииРасшифровкаУслугПоТС.СуммаНДС
	//|						КОНЕЦ
	//|				КОНЕЦ + КорректировкаРеализацииРасшифровкаУслугПоТС.Сумма
	//|		КОНЕЦ,
	//|		ВЫБОР
	//|			КОГДА КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов <> &ВалютаРегл
	//|				ТОГДА КорректировкаРеализацииРасшифровкаУслугПоТС.СуммаНДС * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность
	//|			ИНАЧЕ КорректировкаРеализацииРасшифровкаУслугПоТС.СуммаНДС
	//|		КОНЕЦ	
	|		(ВЫБОР
	|			КОГДА КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка.СуммаВключаетНДС
	|				ТОГДА 0
	|			ИНАЧЕ КорректировкаРеализацииРасшифровкаУслугПоТС.СуммаНДС
	|		КОНЕЦ + КорректировкаРеализацииРасшифровкаУслугПоТС.Сумма - ВЫБОР
	|			КОГДА КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)
	|				ТОГДА ВЫБОР
	|						КОГДА КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка.СуммаВключаетНДС
	|							ТОГДА 0
	|						ИНАЧЕ КорректировкаРеализацииРасшифровкаУслугПоТС.СуммаНДСДоИзменения
	|					КОНЕЦ + КорректировкаРеализацииРасшифровкаУслугПоТС.СуммаДоИзменения
	|			ИНАЧЕ 0
	|		КОНЕЦ) * ВЫБОР
	|			КОГДА КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов <> &ВалютаРегл
	|				ТОГДА КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность
	|			ИНАЧЕ 1
	|		КОНЕЦ,
	|		(КорректировкаРеализацииРасшифровкаУслугПоТС.СуммаНДС - ВЫБОР
	|			КОГДА КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)
	|				ТОГДА КорректировкаРеализацииРасшифровкаУслугПоТС.СуммаНДСДоИзменения
	|			ИНАЧЕ 0
	|		КОНЕЦ) * ВЫБОР
	|			КОГДА КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов <> &ВалютаРегл
	|				ТОГДА КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность
	|			ИНАЧЕ 1
	|		КОНЕЦ
	//Евросиб Каблов 26.08.2025 ) #114890
	|	ИЗ
	|		Документ.КорректировкаРеализации.РасшифровкаУслугПоТС КАК КорректировкаРеализацииРасшифровкаУслугПоТС
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
	|			ПО КорректировкаРеализацииРасшифровкаУслугПоТС.СтрокаДоходовСделки = СделкаДоходы.ГУИД
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКурса, ) КАК КурсыВалютСрезПоследних
	|			ПО КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов = КурсыВалютСрезПоследних.Валюта
	|	ГДЕ
	|		КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка = &Ссылка
	|		И НЕ &ЭтоАннулирование) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ЦФО,
	|	ВложенныйЗапрос.Сделка,
	|	ВложенныйЗапрос.Услуга,
	|	ВложенныйЗапрос.ИдентификаторСУЕ,
	|	ВложенныйЗапрос.Вагон,
	|	ВложенныйЗапрос.Контейнер,
	//Евросиб Каблов 14.10.2025 ( #107942	
	|	ВложенныйЗапрос.СтрокаДоходовСделки,
	//Евросиб Каблов 14.10.2025 ) #107942
	|	ВложенныйЗапрос.Клиент,
	|	ВложенныйЗапрос.Договор,
	|	ВложенныйЗапрос.Валюта,
	|	ВложенныйЗапрос.СтавкаНДС,
	|	ВложенныйЗапрос.НоменклатурнаяГруппа,
	|	ВложенныйЗапрос.ТипОперации
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ВложенныйЗапрос.Сумма) <> 0
	|		ИЛИ СУММА(ВложенныйЗапрос.СуммаНДС) <> 0
	|		ИЛИ СУММА(ВложенныйЗапрос.СуммаРуб) <> 0
	|		ИЛИ СУММА(ВложенныйЗапрос.СуммаНДСРуб) <> 0)";
	Если ВидУчета = "УУ" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПериодВО", "&ПериодУУ");
	КонецЕсли; 
	Возврат ТекстЗапроса;

КонецФункции

Процедура КРТУ_УстановитьПараметрыЗапросаФактическиеДоходы(Запрос, ОбъектКРТУ, ВидУчета)
	Запрос.УстановитьПараметр("Ссылка", ОбъектКРТУ.Ссылка);
	Запрос.УстановитьПараметр("ЭтоАннулирование", ОбъектКРТУ.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование);
	Запрос.УстановитьПараметр("ИсправляемыйДокумент", ОбъектКРТУ.ДокументРеализации);
	Запрос.УстановитьПараметр("ВалютаРегл", Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("ДатаКурса", ОбъектКРТУ.ДатаДокумента);
	//Евросиб Каблов 08.06.2022 ( Task 52863 
	Запрос.УстановитьПараметр("КорректировкаОтчетаКомитенту", ОбъектКРТУ.КорректировкаОтчетаКомитенту);
	Запрос.УстановитьПараметр("НоменклатураВознаграждение", Справочники.Номенклатура.Вознаграждение);
	//ДИТ Шевченко А.В. 31.10.2022 60146 -начало
	ДокументРеализации = ОбъектКРТУ.Ссылка;
	Если ТипЗнч(ОбъектКРТУ.Ссылка) = Тип("ДокументСсылка.КорректировкаРеализации") И ОбъектКРТУ.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Тогда
		ДокументРеализации = ОбъектКРТУ.ИсходныйДокументРеализации;
	КонецЕсли;
	Запрос.УстановитьПараметр("ДокументРеализации", ДокументРеализации);
	//ДИТ Шевченко А.В. 31.10.2022 60146 -конец
	//Евросиб Каблов 08.06.2022 )
	Если ВидУчета = "УУ" Тогда
		ПервоначальныйРТУ = БухгалтерскийУчетПереопределяемый.ПолучитьИсправляемыйДокументРеализации(ОбъектКРТУ.Ссылка, Истина);
		ДатаДокументаПервоначальногоПТУ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПервоначальныйРТУ, "ДатаДокумента");
		Запрос.УстановитьПараметр("ПериодУУ", ДатаДокументаПервоначальногоПТУ);
	ИначеЕсли ВидУчета = "ВО" Тогда
		//Евросиб Каблов 05.01.2024 ( #79370
		//Запрос.УстановитьПараметр("ПериодВО", ОбъектКРТУ.Ссылка.ПериодВО);
		Запрос.УстановитьПараметр("ПериодВО", НачалоМесяца(ОбъектКРТУ.ПериодВО));
		//Евросиб Каблов 05.01.2024 )		
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти

#Область ОтчетКомитенту

Процедура ОК_СформироватьДвиженияДоходыРасходы(ОбъектОК) Экспорт
	ОК_СформироватьДвиженияФактическиеДоходыВО(ОбъектОК);
	ОК_СформироватьДвиженияФактическиеДоходыУУ(ОбъектОК);
	//Евросиб - АСуслов 09.11.2022 16:48:29 #59240
	//(
	//ОК_СформироватьДвиженияПлановыеДоходыВО(ОбъектОК);
	//)
	//Евросиб - АСуслов 09.11.2022 16:48:34 #59240
КонецПроцедуры

//Отчет комитенту. Фактические доходы ВО.
Процедура ОК_СформироватьДвиженияФактическиеДоходыВО(ОбъектОК) Экспорт
	
	ОбъектОК.Движения.ФактическиеДоходыВО.Записывать = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = ОК_ПолучитьТекстЗапросаФактическиеДоходы("ВО");
	ОК_УстановитьПараметрыЗапросаФактическиеДоходы(Запрос, ОбъектОК);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	ОбъектОК.Движения.ФактическиеДоходыВО.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры //СформироватьДвиженияФактическиеДоходыВО

//Отчет комитенту. Фактические доходы УУ.
Процедура ОК_СформироватьДвиженияФактическиеДоходыУУ(ОбъектОК) Экспорт
	
	ОбъектОК.Движения.ФактическиеДоходыУУ.Записывать = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = ОК_ПолучитьТекстЗапросаФактическиеДоходы("УУ");
	ОК_УстановитьПараметрыЗапросаФактическиеДоходы(Запрос, ОбъектОК);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	ОбъектОК.Движения.ФактическиеДоходыУУ.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры //СформироватьДвиженияФактическиеДоходыВО

//Отчет комитенту. Текст запроса фактических доходов
Функция ОК_ПолучитьТекстЗапросаФактическиеДоходы(ВидУчета)
	
	//ДИТ Шевченко А.В. 31.10.2022 60146 Добавил поле "ДокументРеализации" в запрос
	
	ТекстЗапроса = 
	//Евросиб Каблов 01.07.2022 ( Task 53389
	"ВЫБРАТЬ
	|	ДанныеДокумента.ДатаКурсаВалют КАК ДатаКурсаВалюты,
	|	ДанныеДокумента.ВалютаДокумента КАК ВалютаДокумента,
	|	ЕСТЬNULL(КурсыВалютДокумента.Курс, 1) КАК КурсВалюты,
	|	ЕСТЬNULL(КурсыВалютДокумента.Кратность, 1) КАК КратностьВалюты,
	|	ДанныеДокумента.СсылкаОК КАК СсылкаОК
	|ПОМЕСТИТЬ ОтчетКомитенту
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПоступлениеТоваровУслуг.ДатаВходящегоДокумента КАК ДатаКурсаВалют,
	|		ОтчетКомитенту.ВалютаДокумента КАК ВалютаДокумента,
	|		ОтчетКомитенту.Ссылка КАК СсылкаОК
	|	ИЗ
	|		Документ.ОтчетКомитентуОПродажах.Поставщики КАК ОтчетКомитентуОПродажахПоставщики
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитенту
	|			ПО ОтчетКомитентуОПродажахПоставщики.Ссылка = ОтчетКомитенту.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|			ПО ОтчетКомитентуОПродажахПоставщики.Партия = ПоступлениеТоваровУслуг.Ссылка
	|	ГДЕ
	|		ОтчетКомитентуОПродажахПоставщики.Ссылка = &Ссылка) КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютДокумента
	|		ПО ДанныеДокумента.ВалютаДокумента = КурсыВалютДокумента.Валюта
	|			И ДанныеДокумента.ДатаКурсаВалют = КурсыВалютДокумента.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//Евросиб Каблов 01.07.2022 )
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтчетКомитентуОПродажахТовары.Ссылка КАК Ссылка,
	|	ОтчетКомитентуОПродажахТовары.СтрокаДоходовСделки КАК СтрокаДоходовСделки,
	|	ОтчетКомитентуОПродажахТовары.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
	|ПОМЕСТИТЬ ВТ_ОтчетКомитентуТовары
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	|ГДЕ	
	|	ОтчетКомитентуОПродажахТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.ПериодВО КАК Период,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.Организация КАК Организация,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.Сделка КАК Сделка,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.ЦФО КАК ЦФО,
	// Евросиб US 82073 TA 114490 Рыбьяков К.А. 24.07.2025 ((
	//|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.УдалитьСтрокаСвязьУчетныхЕдиниц КАК ИдентификаторСУЕ,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.КлючАналитикиСоставаПоезда.ИдентификаторКлюча КАК ИдентификаторСУЕ,
	// Евросиб Рыбьяков К.А. 24.07.2025 ))
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.Контрагент КАК Клиент,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.ДоговорКонтрагента КАК Договор,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Услуга КАК Услуга,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.ВалютаДокумента КАК Валюта,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СтавкаНДС КАК СтавкаНДС,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Вагон КАК Вагон,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Контейнер КАК Контейнер,
	//Евросиб Каблов 14.10.2025 ( #107942
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СтрокаДоходовСделки КАК СтрокаДоходовСделки,
	//Евросиб Каблов 14.10.2025 ) #107942
	|	ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.СуммаВключаетНДС
	|			ТОГДА 0
	|		ИНАЧЕ ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СуммаНДС
	|	КОНЕЦ + ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Сумма КАК Сумма,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СуммаНДС КАК СуммаНДС,
	//Евросиб Каблов 01.07.2022 ( Task 53389
	//|	ВЫБОР
	//|		КОГДА ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.ВалютаДокумента <> &ВалютаРегл
	//|			ТОГДА &ДатаКурса
	//|		ИНАЧЕ ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.ДатаДокумента
	//|	КОНЕЦ КАК ДатаКурсаВалюты,
	//|	ВЫБОР
	//|		КОГДА ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.ВалютаДокумента <> &ВалютаРегл
	//|			ТОГДА ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.КурсВзаиморасчетов
	//|		ИНАЧЕ 1
	//|	КОНЕЦ КАК КурсВалюты,
	//|	ВЫБОР
	//|		КОГДА ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.ВалютаДокумента <> &ВалютаРегл
	//|			ТОГДА ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.КратностьВзаиморасчетов
	//|		ИНАЧЕ 1
	//|	КОНЕЦ КАК КратностьВалюты,
	//|	ВЫБОР
	//|		КОГДА ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.ВалютаДокумента <> &ВалютаРегл
	//|			ТОГДА (ВЫБОР
	//|					КОГДА ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.СуммаВключаетНДС
	//|						ТОГДА 0
	//|					ИНАЧЕ ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СуммаНДС
	//|				КОНЕЦ + ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Сумма) * ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.КурсВзаиморасчетов / ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.КратностьВзаиморасчетов
	//|		ИНАЧЕ ВЫБОР
	//|				КОГДА ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.СуммаВключаетНДС
	//|					ТОГДА 0
	//|				ИНАЧЕ ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СуммаНДС
	//|			КОНЕЦ + ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Сумма
	//|	КОНЕЦ КАК СуммаРуб,
	//|	ВЫБОР
	//|		КОГДА ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.ВалютаДокумента <> &ВалютаРегл
	//|			ТОГДА ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СуммаНДС * ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.КурсВзаиморасчетов / ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.КратностьВзаиморасчетов
	//|		ИНАЧЕ ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СуммаНДС
	//|	КОНЕЦ КАК СуммаНДСРуб,	
	|	ОтчетКомитенту.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ОтчетКомитенту.КурсВалюты КАК КурсВалюты,
	|	ОтчетКомитенту.КратностьВалюты КАК КратностьВалюты,
	|	выразить((ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.СуммаВключаетНДС
	|			ТОГДА 0
	|		ИНАЧЕ ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СуммаНДС
	|	КОНЕЦ + ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Сумма) * ОтчетКомитенту.КурсВалюты / ОтчетКомитенту.КратностьВалюты
	|	как число(15,2)) КАК СуммаРуб,
	|	выразить(ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СуммаНДС * ОтчетКомитенту.КурсВалюты / ОтчетКомитенту.КратностьВалюты как число(15,2)) КАК СуммаНДСРуб,	
	//Евросиб Каблов 01.07.2022 )
	|	ОтчетКомитентуОПродажахТовары.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДоходов.Возмещаемые) КАК ТипОперации,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка КАК ДокументРеализации
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.РасшифровкаУслугПоТС КАК ОтчетКомитентуОПродажахРасшифровкаУслугПоТС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтчетКомитентуТовары КАК ОтчетКомитентуОПродажахТовары
	|		ПО ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка = ОтчетКомитентуОПродажахТовары.Ссылка
	|			И ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СтрокаДоходовСделки = ОтчетКомитентуОПродажахТовары.СтрокаДоходовСделки
	//Евросиб Каблов 01.07.2022 ( Task 53389
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКурса, ) КАК КурсыВалютСрезПоследних
//	|		ПО ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.ВалютаДокумента = КурсыВалютСрезПоследних.Валюта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтчетКомитенту КАК ОтчетКомитенту
	|		ПО ОтчетКомитенту.СсылкаОК = ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка
	//Евросиб Каблов 01.07.2022 )
	|ГДЕ
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.ПериодВО,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.Организация,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.Сделка,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.ЦФО,
	// Евросиб US 82073 TA 114490 Рыбьяков К.А. 24.07.2025 ((
	//|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.УдалитьСтрокаСвязьУчетныхЕдиниц,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.КлючАналитикиСоставаПоезда.ИдентификаторКлюча,
	// Евросиб Рыбьяков К.А. 24.07.2025 ))
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.Контрагент,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.ДоговорКонтрагента,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.Вознаграждение),
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.ВалютаДокумента,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.СтавкаНДСВознаграждения,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Вагон,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Контейнер,
	//Евросиб Каблов 14.10.2025 ( #107942
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СтрокаДоходовСделки КАК СтрокаДоходовСделки,
	//Евросиб Каблов 14.10.2025 ) #107942
	|	ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.СуммаВознагражденияВключаетНДС
	|			ТОГДА 0
	|		ИНАЧЕ ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СуммаНДСВознаграждения
	|	КОНЕЦ + ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СуммаВознаграждения,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СуммаНДСВознаграждения,
	//Евросиб Каблов 01.07.2022 ( Task 53389
	//|	ВЫБОР
	//|		КОГДА ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.ВалютаДокумента <> &ВалютаРегл
	//|			ТОГДА &ДатаКурса
	//|		ИНАЧЕ ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.ДатаДокумента
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.ВалютаДокумента <> &ВалютаРегл
	//|			ТОГДА ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.КурсВзаиморасчетов
	//|		ИНАЧЕ 1
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.ВалютаДокумента <> &ВалютаРегл
	//|			ТОГДА ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.КратностьВзаиморасчетов
	//|		ИНАЧЕ 1
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.ВалютаДокумента <> &ВалютаРегл
	//|			ТОГДА (ВЫБОР
	//|					КОГДА ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.СуммаВознагражденияВключаетНДС
	//|						ТОГДА 0
	//|					ИНАЧЕ ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СуммаНДСВознаграждения
	//|				КОНЕЦ + ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СуммаВознаграждения) * ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.КурсВзаиморасчетов / ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.КратностьВзаиморасчетов
	//|		ИНАЧЕ ВЫБОР
	//|				КОГДА ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.СуммаВознагражденияВключаетНДС
	//|					ТОГДА 0
	//|				ИНАЧЕ ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СуммаНДСВознаграждения
	//|			КОНЕЦ + ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СуммаВознаграждения
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.ВалютаДокумента <> &ВалютаРегл
	//|			ТОГДА ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СуммаНДСВознаграждения * ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.КурсВзаиморасчетов / ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.КратностьВзаиморасчетов
	//|		ИНАЧЕ ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СуммаНДСВознаграждения
	//|	КОНЕЦ,
	|	ОтчетКомитенту.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ОтчетКомитенту.КурсВалюты КАК КурсВалюты,
	|	ОтчетКомитенту.КратностьВалюты КАК КратностьВалюты,
	|	ВЫРАЗИТЬ((ВЫБОР
	|					КОГДА ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.СуммаВознагражденияВключаетНДС
	|						ТОГДА 0
	|					ИНАЧЕ ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СуммаНДСВознаграждения
	|				КОНЕЦ + ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СуммаВознаграждения) * ОтчетКомитенту.КурсВалюты / ОтчетКомитенту.КратностьВалюты
	|	КАК ЧИСЛО(15,2)),
	|	ВЫРАЗИТЬ(ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СуммаНДСВознаграждения  * ОтчетКомитенту.КурсВалюты / ОтчетКомитенту.КратностьВалюты КАК ЧИСЛО(15,2)),
	//Евросиб Каблов 01.07.2022 )
	|	ОтчетКомитентуОПродажахТовары.НоменклатурнаяГруппа,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДоходов.Выручка),
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка КАК ДокументРеализации
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.РасшифровкаУслугПоТС КАК ОтчетКомитентуОПродажахРасшифровкаУслугПоТС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтчетКомитентуТовары КАК ОтчетКомитентуОПродажахТовары
	|		ПО ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка = ОтчетКомитентуОПродажахТовары.Ссылка
	|			И ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СтрокаДоходовСделки = ОтчетКомитентуОПродажахТовары.СтрокаДоходовСделки
	//Евросиб Каблов 01.07.2022 ( Task 53389
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКурса, ) КАК КурсыВалютСрезПоследних
//	|		ПО ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.ВалютаДокумента = КурсыВалютСрезПоследних.Валюта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтчетКомитенту КАК ОтчетКомитенту
	|		ПО ОтчетКомитенту.СсылкаОК = ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка 
	//Евросиб Каблов 01.07.2022 )
	|ГДЕ
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка = &Ссылка
	|	И ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.СуммаВознаграждения > 0";
	Если ВидУчета = "УУ" Тогда
		//ВРЕМЕННО ДЛЯ АД
		//ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.ПериодВО", "ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.ДатаОказанияУслуги");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.ПериодВО", "ВЫБОР КОГДА ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.ДатаОказанияУслуги = ДатаВремя(1,1,1) ИЛИ ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.ДатаОказанияУслуги > ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.ДатаДокумента ТОГДА ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.ДатаДокумента ИНАЧЕ ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.ДатаОказанияУслуги КОНЕЦ");
	КонецЕсли; 
	Возврат ТекстЗапроса;
		
КонецФункции

Процедура ОК_УстановитьПараметрыЗапросаФактическиеДоходы(Запрос, ОбъектОК)
	
	Запрос.УстановитьПараметр("Ссылка", ОбъектОК.Ссылка);
	Запрос.УстановитьПараметр("ВалютаРегл", Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("ДатаКурса", ОбъектОК.ДатаДокумента);
		
КонецПроцедуры
 
Процедура ОК_СформироватьДвиженияПлановыеДоходыВО(ОбъектОК)
	
	ОбъектОК.Движения.ПлановыеДоходыВО.Очистить();
	ОбъектОК.Движения.ПлановыеДоходыВО.Записать();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Услуга КАК Услуга,
	// Евросиб US 82073 TA 114490 Рыбьяков К.А. 24.07.2025 ((
	//|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.УдалитьСтрокаСвязьУчетныхЕдиниц КАК СтрокаСвязьУчетныхЕдиниц,
	//|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.УдалитьСделка КАК Сделка,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.КлючАналитикиСоставаПоезда.ИдентификаторКлюча КАК СтрокаСвязьУчетныхЕдиниц,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.КлючАналитикиСоставаПоезда.Сделка КАК Сделка,
	// Евросиб Рыбьяков К.А. 24.07.2025 ))
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка.ДатаДокумента КАК ДатаДокумента
	|ПОМЕСТИТЬ ВТ_Услуги
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах.РасшифровкаУслугПоТС КАК ОтчетКомитентуОПродажахРасшифровкаУслугПоТС
	|ГДЕ
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|   ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВТ_Услуги.ДатаДокумента КАК Период,
	|	ПлановыеДоходыВО.Организация КАК Организация,
	|	ПлановыеДоходыВО.Сделка КАК Сделка,
	|	ПлановыеДоходыВО.ЦФО КАК ЦФО,
	|	ПлановыеДоходыВО.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ПлановыеДоходыВО.Клиент КАК Клиент,
	|	ПлановыеДоходыВО.Договор КАК Договор,
	|	ПлановыеДоходыВО.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ПлановыеДоходыВО.ТипОперации КАК ТипОперации,
	|	ПлановыеДоходыВО.Услуга КАК Услуга,
	|	ПлановыеДоходыВО.Валюта КАК Валюта,
	|	ПлановыеДоходыВО.СтавкаНДС КАК СтавкаНДС,
	|	ПлановыеДоходыВО.Вагон КАК Вагон,
	|	ПлановыеДоходыВО.Контейнер КАК Контейнер,
	|	ПлановыеДоходыВО.Сумма КАК Сумма,
	|	ПлановыеДоходыВО.СуммаНДС КАК СуммаНДС,
	|	ПлановыеДоходыВО.СуммаРуб КАК СуммаРуб,
	|	ПлановыеДоходыВО.СуммаНДСРуб КАК СуммаНДСРуб,
	|	ПлановыеДоходыВО.ДатаКурсаВалюты КАК ДатаКурсаВалюты
	|ИЗ
	|	ВТ_Услуги КАК ВТ_Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПлановыеДоходыВО КАК ПлановыеДоходыВО
	|		ПО ВТ_Услуги.Услуга = ПлановыеДоходыВО.Услуга
	|			И ВТ_Услуги.Сделка = ПлановыеДоходыВО.Сделка
	|			И ВТ_Услуги.СтрокаСвязьУчетныхЕдиниц = ПлановыеДоходыВО.ИдентификаторСУЕ";
	Запрос.УстановитьПараметр("Ссылка", ОбъектОК.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	ОбъектОК.Движения.ПлановыеДоходыВО.Записывать = Истина;
	ОбъектОК.Движения.ПлановыеДоходыВО.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#Область Акцепт

Процедура Акцепт_СформироватьДвиженияДоходыРасходы(ОбъектАкцепт, ПланУУ = Истина, ПланВО = Истина, ФактУУ = Истина, ФактВО = Истина, ФактБУ = Истина) Экспорт
	
	
//Евросиб Гудкова( 04.07.2022 Ticket№ 54131  добавила возможность не записывать лишние движения
	Если ПланУУ Тогда
		Акцепт_СформироватьДвиженияПлановыеРасходыУУ(ОбъектАкцепт);
	КонецЕсли;
	Если ПланВО Тогда
		Акцепт_СформироватьДвиженияПлановыеРасходыВО(ОбъектАкцепт);
	КонецЕсли;
	Если ФактВО Тогда
		Акцепт_СформироватьДвиженияФактическиеРасходыВО(ОбъектАкцепт);
	КонецЕсли;
	Если ФактУУ тогда
		Акцепт_СформироватьДвиженияФактическиеРасходыУУ(ОбъектАкцепт);
	КонецЕсли;
	Если ФактБУ тогда
		Акцепт_СформироватьДвиженияФактическиеРасходыБУ(ОбъектАкцепт);
	КонецЕсли;
//Евросиб Гудкова

КонецПроцедуры

//Акцепт. Плановые расходы ВО.
Процедура Акцепт_СформироватьДвиженияПлановыеРасходыВО(ОбъектАкцепт) Экспорт
	
	ОбъектАкцепт.Движения.ПлановыеРасходыВО.Очистить();
	ОбъектАкцепт.Движения.ПлановыеРасходыВО.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = Акцепт_ПолучитьТекстЗапросаПлановыеРасходы("ВО");
	Акцепт_УстановитьПараметрыЗапросаРасходы(Запрос, ОбъектАкцепт);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ОбъектАкцепт.Движения.ПлановыеРасходыВО.Записывать = Истина;
		ОбъектАкцепт.Движения.ПлановыеРасходыВО.Загрузить(РезультатЗапроса.Выгрузить());
	КонецЕсли; 
		
КонецПроцедуры

//Акцепт. Плановые расходы УУ.
Процедура Акцепт_СформироватьДвиженияПлановыеРасходыУУ(ОбъектАкцепт) Экспорт
	
	ОбъектАкцепт.Движения.ПлановыеРасходыУУ.Очистить();
	ОбъектАкцепт.Движения.ПлановыеРасходыУУ.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = Акцепт_ПолучитьТекстЗапросаПлановыеРасходы("УУ");
	Акцепт_УстановитьПараметрыЗапросаРасходы(Запрос, ОбъектАкцепт);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ОбъектАкцепт.Движения.ПлановыеРасходыУУ.Записывать = Истина;
		ОбъектАкцепт.Движения.ПлановыеРасходыУУ.Загрузить(РезультатЗапроса.Выгрузить());
	КонецЕсли; 
		
КонецПроцедуры

//Евросиб Каблов 06.11.2025 #107942
Процедура Акцепт_СформироватьДвиженияПлановыеРасходыВОПолныйФакт(ДанныеАкцепта, ПлановыеРасходыВОПолныйФакт) Экспорт
	
	ПлановыеРасходыВОПолныйФакт.Очистить();
	ПлановыеРасходыВОПолныйФакт.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = Акцепт_ПолучитьТекстЗапросаПлановыеРасходыПолныйФакт();
	Акцепт_УстановитьПараметрыЗапросаРасходы(Запрос, ДанныеАкцепта);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаУслугАкцепта = РезультатыЗапроса[4].Выбрать();
	ТаблицаПлановыхПоСтрокеРасходов = РезультатыЗапроса[5].Выгрузить();
	ТаблицаПлановыхПоСтрокеСУЕиУслуге = РезультатыЗапроса[6].Выгрузить();
	
	СтруктураПоискаПоСтрокеРасходов = Новый Структура("Сделка, ИдентификаторСтрокиРасходов");
	СтруктураПоискаПоСУЕиУслуге = Новый Структура("Сделка, ИдентификаторСУЕ, Услуга");
	Пока ВыборкаУслугАкцепта.Следующий() Цикл
		
		Сумма = ВыборкаУслугАкцепта.Сумма;
		СуммаНДС = ВыборкаУслугАкцепта.СуммаНДС;
		
		ЗаполнитьЗначенияСвойств(СтруктураПоискаПоСтрокеРасходов, ВыборкаУслугАкцепта);
		ПлановыеРасходы = ТаблицаПлановыхПоСтрокеРасходов.НайтиСтроки(СтруктураПоискаПоСтрокеРасходов);
		Для Каждого ПлановыйРасход Из ПлановыеРасходы Цикл
			
			Если Сумма <= 0 Тогда
				Прервать;
			КонецЕсли;
			
			Запись = ПлановыеРасходыВОПолныйФакт.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, ПлановыйРасход);
			
			СуммаВВалютеПлановых = ПлановыйРасход.Сумма;
			СуммаВВалютеАкцепта = Окр(СуммаВВалютеПлановых / ПлановыйРасход.КоэффициентПересчетаВВалютуПлановых, 2);
			Сумма = Сумма - СуммаВВалютеАкцепта;
			
			СуммаНДСВВалютеПлановых = ПлановыйРасход.СуммаНДС;
			СуммаНДСВВалютеАкцепта = Окр(СуммаНДСВВалютеПлановых / ПлановыйРасход.КоэффициентПересчетаВВалютуПлановых, 2);
			СуммаНДС = СуммаНДС - СуммаНДСВВалютеАкцепта;
			
		КонецЦикла;
		
		Если Сумма <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтруктураПоискаПоСУЕиУслуге, ВыборкаУслугАкцепта);
		ПлановыеРасходы = ТаблицаПлановыхПоСтрокеСУЕиУслуге.НайтиСтроки(СтруктураПоискаПоСУЕиУслуге);
		Для Каждого ПлановыйРасход Из ПлановыеРасходы Цикл
			
			Если Сумма <= 0 Тогда
				Прервать;
			КонецЕсли;
			
			Запись = ПлановыеРасходыВОПолныйФакт.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, ПлановыйРасход,, "Сумма, СуммаНДС");
			
			СуммаВВалютеПлановых = Окр(Сумма * ПлановыйРасход.КоэффициентПересчетаВВалютуПлановых, 2);
			СуммаСписания = Мин(СуммаВВалютеПлановых, ПлановыйРасход.СуммаОстаток);
			Запись.Сумма = СуммаСписания;
			
			СуммаСписанияВРублях = Окр(СуммаСписания * ПлановыйРасход.КоэффициентПересчетаПлановыхРасходовВРубли, 2);
			Запись.СуммаРуб = СуммаСписанияВРублях;
			
			СуммаВВалютеАкцепта = Окр(СуммаСписания / ПлановыйРасход.КоэффициентПересчетаВВалютуПлановых, 2);
			Сумма = Сумма - СуммаВВалютеАкцепта;
			
			СуммаНДСВВалютеПлановых = Окр(СуммаНДС * ПлановыйРасход.КоэффициентПересчетаВВалютуПлановых, 2);
			СуммаНДССписания = Мин(СуммаНДСВВалютеПлановых, ПлановыйРасход.СуммаНДСОстаток);
			Запись.СуммаНДС = СуммаНДССписания;
			
			СуммаНДССписанияВРублях = Окр(СуммаНДССписания * ПлановыйРасход.КоэффициентПересчетаПлановыхРасходовВРубли, 2);
			Запись.СуммаНДСРуб = СуммаНДССписанияВРублях;
			
			СуммаНДСВВалютеАкцепта = Окр(СуммаНДССписания / ПлановыйРасход.КоэффициентПересчетаВВалютуПлановых, 2);
			СуммаНДС = СуммаНДС - СуммаНДСВВалютеАкцепта;
			
		КонецЦикла
		
	КонецЦикла;
	
КонецПроцедуры

//Евросиб Каблов 06.11.2025 #107942
Процедура Акцепт_СформироватьДвиженияСторноПлановыеРасходыВОПолныйФакт(ДанныеАкцепта, ПлановыеРасходыВОПолныйФакт) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Ссылка КАК Регистратор,
	|	ПлановыеРасходыВО.НомерСтроки КАК НомерСтроки,
	|	ПлановыеРасходыВО.ВидДвижения КАК ВидДвижения,
	|	ПлановыеРасходыВО.Организация КАК Организация,
	|	ПлановыеРасходыВО.ЦФО КАК ЦФО,
	|	ПлановыеРасходыВО.Сделка КАК Сделка,
	|	ПлановыеРасходыВО.Услуга КАК Услуга,
	|	ПлановыеРасходыВО.Поставщик КАК Поставщик,
	|	ПлановыеРасходыВО.Договор КАК Договор,
	|	ПлановыеРасходыВО.Вагон КАК Вагон,
	|	ПлановыеРасходыВО.Контейнер КАК Контейнер,
	|	ПлановыеРасходыВО.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ПлановыеРасходыВО.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ПлановыеРасходыВО.ВидОперации КАК ВидОперации,
	|	ПлановыеРасходыВО.ТипОперации КАК ТипОперации,
	|	ПлановыеРасходыВО.СтавкаНДС КАК СтавкаНДС,
	|	ПлановыеРасходыВО.Валюта КАК Валюта,
	|	ПлановыеРасходыВО.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	//Евросиб Каблов 05.03.2026 ( #126776
	|	ПлановыеРасходыВО.ИсключатьИзУФД КАК ИсключатьИзУФД,
	//Евросиб Каблов 05.03.2026 )
	|	-ПлановыеРасходыВО.Сумма КАК Сумма,
	|	-ПлановыеРасходыВО.СуммаНДС КАК СуммаНДС,
	|	-ПлановыеРасходыВО.СуммаРуб КАК СуммаРуб,
	|	-ПлановыеРасходыВО.СуммаНДСРуб КАК СуммаНДСРуб,
	|	ПлановыеРасходыВО.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ВЫБОР
	|		КОГДА ПлановыеРасходыВО.Период = ДАТАВРЕМЯ(3999, 1, 1)
	|			ТОГДА ПлановыеРасходыВО.Период
	|		ИНАЧЕ &Период
	|	КОНЕЦ КАК Период,
	|	ПлановыеРасходыВО.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	ПлановыеРасходыВО.Клиент КАК Клиент,
	|	ПлановыеРасходыВО.ДоговорКлиента КАК ДоговорКлиента,
	|	ПлановыеРасходыВО.Реализация КАК Реализация
	|ИЗ
	|	РегистрНакопления.ПлановыеРасходыВОПолныйФакт КАК ПлановыеРасходыВО
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПлановыеРасходыВОПолныйФакт КАК ПлановыеРасходыВО1
	|		ПО ПлановыеРасходыВО.ИдентификаторСтрокиРасходов = ПлановыеРасходыВО1.ИдентификаторСтрокиРасходов
	|			И (ПлановыеРасходыВО1.Списание = ИСТИНА)
	|ГДЕ
	|	ПлановыеРасходыВО.Регистратор = &Акцепт
	|	И ПлановыеРасходыВО1.ИдентификаторСтрокиРасходов ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПлановыеРасходыВО.НомерСтроки";
	
	Запрос.УстановитьПараметр("Акцепт", ДанныеАкцепта.СторнируемыйАкцепт);
	Запрос.УстановитьПараметр("Ссылка", ДанныеАкцепта.Ссылка);
	Запрос.УстановитьПараметр("Период", ДанныеАкцепта.ПериодВО);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ПлановыеРасходыВОПолныйФакт.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

//Евросиб Каблов 06.11.2025 #107942
Функция Акцепт_ПолучитьТекстЗапросаПлановыеРасходыПолныйФакт()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АкцептУслуги.Сделка КАК Сделка,
	|	АкцептУслуги.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходов,
	|	ВЫБОР
	|		КОГДА АкцептУслуги.Ссылка.ПериодВО >= НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(&ДокументПоступление КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента, МЕСЯЦ)
	|			ТОГДА АкцептУслуги.Ссылка.ПериодВО
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(&ДокументПоступление КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента, МЕСЯЦ)
	|	КОНЕЦ КАК Период,
	|	СУММА(АкцептУслуги.Сумма) КАК Сумма,
	|	СУММА(АкцептУслуги.СуммаНДС) КАК СуммаНДС,
	|	АкцептУслуги.Ссылка.Поступление.ВалютаДокумента КАК АкцептВалюта
	|ПОМЕСТИТЬ ВТ_УслугиАкцепт
	|ИЗ
	|	Документ.Акцепт.Услуги КАК АкцептУслуги
	|ГДЕ
	|	АкцептУслуги.Ссылка = &Ссылка
	|	И АкцептУслуги.Сделка <> ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
	|	И АкцептУслуги.ВидЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыЗатрат.НезавершенноеПроизводство)
	|	И ВЫБОР
	|			КОГДА ЕСТЬNULL(АкцептУслуги.УчДокумент.Проведен, ЛОЖЬ)
	|				ТОГДА ИСТИНА
	|			КОГДА АкцептУслуги.ВидЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыЗатрат.КосвенныеЗатраты)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И НЕ АкцептУслуги.Сделка.Служебная
	|
	|СГРУППИРОВАТЬ ПО
	|	АкцептУслуги.Сделка,
	|	ВЫБОР
	|		КОГДА АкцептУслуги.Ссылка.ПериодВО >= НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(&ДокументПоступление КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента, МЕСЯЦ)
	|			ТОГДА АкцептУслуги.Ссылка.ПериодВО
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(&ДокументПоступление КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента, МЕСЯЦ)
	|	КОНЕЦ,
	|	АкцептУслуги.ИдентификаторСтрокиРасходовВСделке,
	|	АкцептУслуги.Ссылка.Поступление.ВалютаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВТ_УслугиАкцепт.Период КАК Период,
	|	ПлановыеРасходыОстатки.Организация КАК Организация,
	|	ПлановыеРасходыОстатки.Сделка КАК Сделка,
	|	ПлановыеРасходыОстатки.ЦФО КАК ЦФО,
	|	ПлановыеРасходыОстатки.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ПлановыеРасходыОстатки.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	|	ПлановыеРасходыОстатки.Поставщик КАК Поставщик,
	|	ПлановыеРасходыОстатки.Договор КАК Договор,
	|	ПлановыеРасходыОстатки.Услуга КАК Услуга,
	|	ПлановыеРасходыОстатки.Вагон КАК Вагон,
	|	ПлановыеРасходыОстатки.Контейнер КАК Контейнер,
	|	ПлановыеРасходыОстатки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ПлановыеРасходыОстатки.ВидОперации КАК ВидОперации,
	|	ПлановыеРасходыОстатки.ТипОперации КАК ТипОперации,
	|	ПлановыеРасходыОстатки.СтавкаНДС КАК СтавкаНДС,
	|	ПлановыеРасходыОстатки.Валюта КАК Валюта,
	|	ПлановыеРасходыОстатки.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	ПлановыеРасходыОстатки.Клиент КАК Клиент,
	|	ПлановыеРасходыОстатки.ДоговорКлиента КАК ДоговорКлиента,
	|	ПлановыеРасходыОстатки.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ПлановыеРасходыОстатки.Реализация КАК Реализация,
	|	ПлановыеРасходыОстатки.ИсключатьИзУФД КАК ИсключатьИзУФД,
	|	ВТ_УслугиАкцепт.Сумма КАК Сумма,
	|	ВТ_УслугиАкцепт.СуммаНДС КАК СуммаНДС,
	|	ПлановыеРасходыОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток,
	|	ПлановыеРасходыОстатки.СуммаРубОстаток КАК СуммаРубОстаток,
	|	ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаНДСРубОстаток,
	|	ВТ_УслугиАкцепт.АкцептВалюта КАК АкцептВалюта
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТ_УслугиАкцепт КАК ВТ_УслугиАкцепт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПлановыеРасходыВОПолныйФакт.Остатки(
	|				,
	|				(ИдентификаторСтрокиРасходов, Сделка) В
	|					(ВЫБРАТЬ
	|						т.ИдентификаторСтрокиРасходов,
	|						т.Сделка
	|					ИЗ
	|						ВТ_УслугиАкцепт КАК т)) КАК ПлановыеРасходыОстатки
	|		ПО ВТ_УслугиАкцепт.ИдентификаторСтрокиРасходов = ПлановыеРасходыОстатки.ИдентификаторСтрокиРасходов
	|			И ВТ_УслугиАкцепт.Сделка = ПлановыеРасходыОстатки.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УслугиАкцепт.Сделка КАК Сделка,
	|	ВТ_УслугиАкцепт.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	|	ВТ_УслугиАкцепт.Период КАК Период,
	|	ВТ_УслугиАкцепт.Сумма КАК Сумма,
	|	ВТ_УслугиАкцепт.СуммаНДС КАК СуммаНДС,
	|	ВТ_УслугиАкцепт.АкцептВалюта КАК АкцептВалюта,
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК ИдентификаторСУЕ,
	|	СделкаРасходы.Услуга КАК Услуга,
	|	ВЫБОР
	|		КОГДА СделкаРасходы.ОтнестиНаЗатраты
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидОперацииРасходов.СобственныеЗатраты)
	|		КОГДА СделкаРасходы.ВнутренняяСебестоимость
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидОперацииРасходов.ВнутренняяСебестоимость)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидОперацииРасходов.ПрямыеРасходы)
	|	КОНЕЦ КАК ВидОперации
	|ПОМЕСТИТЬ УслугиАкцепта
	|ИЗ
	|	ВТ_УслугиАкцепт КАК ВТ_УслугиАкцепт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы
	|		ПО ВТ_УслугиАкцепт.Сделка = СделкаРасходы.Ссылка
	|			И ВТ_УслугиАкцепт.ИдентификаторСтрокиРасходов = СделкаРасходы.ГУИД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	УслугиАкцепта.Период КАК Период,
	|	ПлановыеРасходыОстатки.Организация КАК Организация,
	|	ПлановыеРасходыОстатки.Сделка КАК Сделка,
	|	ПлановыеРасходыОстатки.ЦФО КАК ЦФО,
	|	ПлановыеРасходыОстатки.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ПлановыеРасходыОстатки.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	|	ПлановыеРасходыОстатки.Поставщик КАК Поставщик,
	|	ПлановыеРасходыОстатки.Договор КАК Договор,
	|	ПлановыеРасходыОстатки.Услуга КАК Услуга,
	|	ПлановыеРасходыОстатки.Вагон КАК Вагон,
	|	ПлановыеРасходыОстатки.Контейнер КАК Контейнер,
	|	ПлановыеРасходыОстатки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ПлановыеРасходыОстатки.ВидОперации КАК ВидОперации,
	|	ПлановыеРасходыОстатки.ТипОперации КАК ТипОперации,
	|	ПлановыеРасходыОстатки.СтавкаНДС КАК СтавкаНДС,
	|	ПлановыеРасходыОстатки.Валюта КАК Валюта,
	|	ПлановыеРасходыОстатки.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	ПлановыеРасходыОстатки.Клиент КАК Клиент,
	|	ПлановыеРасходыОстатки.ДоговорКлиента КАК ДоговорКлиента,
	|	ПлановыеРасходыОстатки.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ПлановыеРасходыОстатки.Реализация КАК Реализация,
	|	ПлановыеРасходыОстатки.ИсключатьИзУФД КАК ИсключатьИзУФД,
	|	УслугиАкцепта.Сумма КАК Сумма,
	|	УслугиАкцепта.СуммаНДС КАК СуммаНДС,
	|	ПлановыеРасходыОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток,
	|	ПлановыеРасходыОстатки.СуммаРубОстаток КАК СуммаРубОстаток,
	|	ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаНДСРубОстаток,
	|	УслугиАкцепта.АкцептВалюта КАК АкцептВалюта
	|ПОМЕСТИТЬ ОстаткиПоСУЕиУслуге
	|ИЗ
	|	УслугиАкцепта КАК УслугиАкцепта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПлановыеРасходыВОПолныйФакт.Остатки(
	|				,
	|				(Сделка, ИдентификаторСУЕ, Услуга) В
	|					(ВЫБРАТЬ
	|						УслугиАкцепта.Сделка КАК Сделка,
	|						УслугиАкцепта.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|						УслугиАкцепта.Услуга КАК Услуга
	|					ИЗ
	|						УслугиАкцепта КАК УслугиАкцепта)) КАК ПлановыеРасходыОстатки
	|		ПО УслугиАкцепта.Сделка = ПлановыеРасходыОстатки.Сделка
	|			И УслугиАкцепта.ИдентификаторСУЕ = ПлановыеРасходыОстатки.ИдентификаторСУЕ
	|			И УслугиАкцепта.Услуга = ПлановыеРасходыОстатки.Услуга
	|			И УслугиАкцепта.ВидОперации = ПлановыеРасходыОстатки.ВидОперации
	|			И УслугиАкцепта.ИдентификаторСтрокиРасходов <> ПлановыеРасходыОстатки.ИдентификаторСтрокиРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиАкцепта.Сделка КАК Сделка,
	|	УслугиАкцепта.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	|	УслугиАкцепта.Период КАК Период,
	|	УслугиАкцепта.Сумма КАК Сумма,
	|	УслугиАкцепта.СуммаНДС КАК СуммаНДС,
	|	УслугиАкцепта.АкцептВалюта КАК АкцептВалюта,
	|	УслугиАкцепта.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	УслугиАкцепта.Услуга КАК Услуга
	|ИЗ
	|	УслугиАкцепта КАК УслугиАкцепта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ВидДвижения КАК ВидДвижения,
	|	НАЧАЛОПЕРИОДА(ВТ.Период, МЕСЯЦ) КАК Период,
	|	ВТ.Организация КАК Организация,
	|	ВТ.Сделка КАК Сделка,
	|	ВТ.ЦФО КАК ЦФО,
	|	ВТ.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ВТ.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	|	ВТ.Поставщик КАК Поставщик,
	|	ВТ.Договор КАК Договор,
	|	ВТ.Услуга КАК Услуга,
	|	ВТ.Вагон КАК Вагон,
	|	ВТ.Контейнер КАК Контейнер,
	|	ВТ.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ВТ.ВидОперации КАК ВидОперации,
	|	ВТ.ТипОперации КАК ТипОперации,
	|	ВТ.СтавкаНДС КАК СтавкаНДС,
	|	ВТ.Валюта КАК Валюта,
	|	ВТ.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	ВТ.Клиент КАК Клиент,
	|	ВТ.ДоговорКлиента КАК ДоговорКлиента,
	|	ВТ.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ВТ.Реализация КАК Реализация,
	|	ВТ.ИсключатьИзУФД КАК ИсключатьИзУФД,
	|	ВТ.АкцептВалюта КАК АкцептВалюта,
	|	ВЫБОР
	|		КОГДА ВТ.Валюта <> ВТ.АкцептВалюта
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ.СуммаОстаток > (ВЫРАЗИТЬ(ВТ.Сумма * ЕСТЬNULL(КурсыВалютАкцепт.Курс, 1) * ЕСТЬNULL(КурсыВалютПлан.Кратность, 1) / (ЕСТЬNULL(КурсыВалютПлан.Курс, 1) * ЕСТЬNULL(КурсыВалютАкцепт.Кратность, 1)) КАК ЧИСЛО(15, 2)))
	|						ТОГДА ВЫРАЗИТЬ(ВТ.Сумма * ЕСТЬNULL(КурсыВалютАкцепт.Курс, 1) * ЕСТЬNULL(КурсыВалютПлан.Кратность, 1) / (ЕСТЬNULL(КурсыВалютПлан.Курс, 1) * ЕСТЬNULL(КурсыВалютАкцепт.Кратность, 1)) КАК ЧИСЛО(15, 2))
	|					ИНАЧЕ ВТ.СуммаОстаток
	|				КОНЕЦ
	|		КОГДА ВТ.СуммаОстаток > ВТ.Сумма
	|			ТОГДА ВТ.Сумма
	|		ИНАЧЕ ВТ.СуммаОстаток
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ВТ.Валюта <> ВТ.АкцептВалюта
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ.СуммаНДСОстаток > (ВЫРАЗИТЬ(ВТ.СуммаНДС * ЕСТЬNULL(КурсыВалютАкцепт.Курс, 1) * ЕСТЬNULL(КурсыВалютПлан.Кратность, 1) / (ЕСТЬNULL(КурсыВалютПлан.Курс, 1) * ЕСТЬNULL(КурсыВалютАкцепт.Кратность, 1)) КАК ЧИСЛО(15, 2)))
	|						ТОГДА ВЫРАЗИТЬ(ВТ.СуммаНДС * ЕСТЬNULL(КурсыВалютАкцепт.Курс, 1) * ЕСТЬNULL(КурсыВалютПлан.Кратность, 1) / (ЕСТЬNULL(КурсыВалютПлан.Курс, 1) * ЕСТЬNULL(КурсыВалютАкцепт.Кратность, 1)) КАК ЧИСЛО(15, 2))
	|					ИНАЧЕ ВТ.СуммаНДСОстаток
	|				КОНЕЦ
	|		КОГДА ВТ.СуммаНДСОстаток > ВТ.СуммаНДС
	|			ТОГДА ВТ.СуммаНДС
	|		ИНАЧЕ ВТ.СуммаНДСОстаток
	|	КОНЕЦ КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ВТ.СуммаРубОстаток > (ВЫРАЗИТЬ(ВТ.Сумма * ЕСТЬNULL(КурсыВалютАкцепт.Курс, 1) / ЕСТЬNULL(КурсыВалютАкцепт.Кратность, 1) КАК ЧИСЛО(15, 2)))
	|			ТОГДА ВЫРАЗИТЬ(ВТ.Сумма * ЕСТЬNULL(КурсыВалютАкцепт.Курс, 1) / ЕСТЬNULL(КурсыВалютАкцепт.Кратность, 1) КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ ВТ.СуммаРубОстаток
	|	КОНЕЦ КАК СуммаРуб,
	|	ВЫБОР
	|		КОГДА ВТ.СуммаНДСРубОстаток > (ВЫРАЗИТЬ(ВТ.СуммаНДС * ЕСТЬNULL(КурсыВалютАкцепт.Курс, 1) / ЕСТЬNULL(КурсыВалютАкцепт.Кратность, 1) КАК ЧИСЛО(15, 2)))
	|			ТОГДА ВЫРАЗИТЬ(ВТ.СуммаНДС * ЕСТЬNULL(КурсыВалютАкцепт.Курс, 1) / ЕСТЬNULL(КурсыВалютАкцепт.Кратность, 1) КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ ВТ.СуммаНДСРубОстаток
	|	КОНЕЦ КАК СуммаНДСРуб,
	|	ЕСТЬNULL(КурсыВалютАкцепт.Курс, 1) * ЕСТЬNULL(КурсыВалютПлан.Кратность, 1) / (ЕСТЬNULL(КурсыВалютПлан.Курс, 1) * ЕСТЬNULL(КурсыВалютАкцепт.Кратность, 1)) КАК КоэффициентПересчетаВВалютуПлановых,
	|	ЕСТЬNULL(КурсыВалютАкцепт.Курс, 1) / ЕСТЬNULL(КурсыВалютАкцепт.Кратность, 1) КАК КоэффициентПересчетаСуммыАкцептаВРубли,
	|	ЕСТЬNULL(КурсыВалютПлан.Курс, 1) / ЕСТЬNULL(КурсыВалютПлан.Кратность, 1) КАК КоэффициентПересчетаПлановыхРасходовВРубли
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютПлан
	|		ПО ВТ.Валюта = КурсыВалютПлан.Валюта
	|			И ВТ.ДатаКурсаВалюты = КурсыВалютПлан.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютАкцепт
	|		ПО ВТ.АкцептВалюта = КурсыВалютАкцепт.Валюта
	|			И ВТ.ДатаКурсаВалюты = КурсыВалютАкцепт.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиПоСУЕиУслуге.ВидДвижения КАК ВидДвижения,
	|	ОстаткиПоСУЕиУслуге.Период КАК Период,
	|	ОстаткиПоСУЕиУслуге.Организация КАК Организация,
	|	ОстаткиПоСУЕиУслуге.Сделка КАК Сделка,
	|	ОстаткиПоСУЕиУслуге.ЦФО КАК ЦФО,
	|	ОстаткиПоСУЕиУслуге.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ОстаткиПоСУЕиУслуге.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	|	ОстаткиПоСУЕиУслуге.Поставщик КАК Поставщик,
	|	ОстаткиПоСУЕиУслуге.Договор КАК Договор,
	|	ОстаткиПоСУЕиУслуге.Услуга КАК Услуга,
	|	ОстаткиПоСУЕиУслуге.Вагон КАК Вагон,
	|	ОстаткиПоСУЕиУслуге.Контейнер КАК Контейнер,
	|	ОстаткиПоСУЕиУслуге.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ОстаткиПоСУЕиУслуге.ВидОперации КАК ВидОперации,
	|	ОстаткиПоСУЕиУслуге.ТипОперации КАК ТипОперации,
	|	ОстаткиПоСУЕиУслуге.СтавкаНДС КАК СтавкаНДС,
	|	ОстаткиПоСУЕиУслуге.Валюта КАК Валюта,
	|	ОстаткиПоСУЕиУслуге.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	ОстаткиПоСУЕиУслуге.Клиент КАК Клиент,
	|	ОстаткиПоСУЕиУслуге.ДоговорКлиента КАК ДоговорКлиента,
	|	ОстаткиПоСУЕиУслуге.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ОстаткиПоСУЕиУслуге.Реализация КАК Реализация,
	|	ОстаткиПоСУЕиУслуге.ИсключатьИзУФД КАК ИсключатьИзУФД,
	|	ОстаткиПоСУЕиУслуге.Сумма КАК Сумма,
	|	ОстаткиПоСУЕиУслуге.СуммаНДС КАК СуммаНДС,
	|	ОстаткиПоСУЕиУслуге.СуммаОстаток КАК СуммаОстаток,
	|	ОстаткиПоСУЕиУслуге.СуммаНДСОстаток КАК СуммаНДСОстаток,
	|	ОстаткиПоСУЕиУслуге.СуммаРубОстаток КАК СуммаРубОстаток,
	|	ОстаткиПоСУЕиУслуге.СуммаНДСРубОстаток КАК СуммаНДСРубОстаток,
	|	ОстаткиПоСУЕиУслуге.АкцептВалюта КАК АкцептВалюта,
	|	ЕСТЬNULL(КурсыВалютАкцепт.Курс, 1) * ЕСТЬNULL(КурсыВалютПлан.Кратность, 1) / (ЕСТЬNULL(КурсыВалютПлан.Курс, 1) * ЕСТЬNULL(КурсыВалютАкцепт.Кратность, 1)) КАК КоэффициентПересчетаВВалютуПлановых,
	|	ЕСТЬNULL(КурсыВалютАкцепт.Курс, 1) / ЕСТЬNULL(КурсыВалютАкцепт.Кратность, 1) КАК КоэффициентПересчетаСуммыАкцептаВРубли,
	|	ЕСТЬNULL(КурсыВалютПлан.Курс, 1) / ЕСТЬNULL(КурсыВалютПлан.Кратность, 1) КАК КоэффициентПересчетаПлановыхРасходовВРубли
	|ИЗ
	|	ОстаткиПоСУЕиУслуге КАК ОстаткиПоСУЕиУслуге
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютПлан
	|		ПО ОстаткиПоСУЕиУслуге.Валюта = КурсыВалютПлан.Валюта
	|			И ОстаткиПоСУЕиУслуге.ДатаКурсаВалюты = КурсыВалютПлан.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютАкцепт
	|		ПО ОстаткиПоСУЕиУслуге.АкцептВалюта = КурсыВалютАкцепт.Валюта
	|			И ОстаткиПоСУЕиУслуге.ДатаКурсаВалюты = КурсыВалютАкцепт.Период";
	
	Возврат ТекстЗапроса;
		
КонецФункции


//Акцепт. Фактические расходы ВО.
Процедура Акцепт_СформироватьДвиженияФактическиеРасходыВО(ОбъектАкцепт)
	
	ОбъектАкцепт.Движения.ФактическиеРасходыВО.Записывать = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = Акцепт_ПолучитьТекстЗапросаФактическиеРасходы("ВО");
	Акцепт_УстановитьПараметрыЗапросаРасходы(Запрос, ОбъектАкцепт);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ОбъектАкцепт.Движения.ФактическиеРасходыВО.Загрузить(РезультатЗапроса.Выгрузить());
	КонецЕсли; 
		
КонецПроцедуры

//Акцепт. Фактические расходы БУ.
Процедура Акцепт_СформироватьДвиженияФактическиеРасходыБУ(ОбъектАкцепт)
	
	ОбъектАкцепт.Движения.ФактическиеРасходыБУ.Записывать = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = Акцепт_ПолучитьТекстЗапросаФактическиеРасходы("БУ");
	Акцепт_УстановитьПараметрыЗапросаРасходы(Запрос, ОбъектАкцепт);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ОбъектАкцепт.Движения.ФактическиеРасходыБУ.Загрузить(РезультатЗапроса.Выгрузить());
	КонецЕсли; 
		
КонецПроцедуры

//Акцепт. Фактические расходы УУ.
Процедура Акцепт_СформироватьДвиженияФактическиеРасходыУУ(ОбъектАкцепт) Экспорт
	
	ОбъектАкцепт.Движения.ФактическиеРасходыУУ.Записывать = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = Акцепт_ПолучитьТекстЗапросаФактическиеРасходы("УУ");
	Акцепт_УстановитьПараметрыЗапросаРасходы(Запрос, ОбъектАкцепт);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ОбъектАкцепт.Движения.ФактическиеРасходыУУ.Загрузить(РезультатЗапроса.Выгрузить());
	КонецЕсли; 
		
КонецПроцедуры

Процедура Акцепт_СформироватьДвиженияСторно(ОбъектАкцепт, ПланВО = Истина, ПланУУ = Истина, ФактВО = Истина, ФактУУ = Истина, ФактБУ = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	РазнесениеЗатратПТУ.ВидДвижения КАК ВидДвижения,
	|	РазнесениеЗатратПТУ.Сделка КАК Сделка,
	|	РазнесениеЗатратПТУ.ГУИДРасходов КАК ГУИДРасходов,
	|	РазнесениеЗатратПТУ.ДокументПТУ КАК ДокументПТУ,
	|	РазнесениеЗатратПТУ.ДокументКорректировки КАК ДокументКорректировки,
	|	РазнесениеЗатратПТУ.ГУИДПТУ КАК ГУИДПТУ,
	|	РазнесениеЗатратПТУ.Регламентный КАК Регламентный,
	|	РазнесениеЗатратПТУ.КТК КАК КТК,
	|	-РазнесениеЗатратПТУ.ПодлежащаяРазнесению КАК ПодлежащаяРазнесению,
	|	-РазнесениеЗатратПТУ.Разнесенная КАК Разнесенная,
	|	-РазнесениеЗатратПТУ.КоличествоРазнесенныхКонтейнеров КАК КоличествоРазнесенныхКонтейнеров,
	|	-РазнесениеЗатратПТУ.ПолностьюРазнесено КАК ПолностьюРазнесено
	//Евросиб - АСуслов 29.04.2022 15:08:52 #
	//(
	//|	РазнесениеЗатратПТУ.ПериодВО КАК ПериодВО
	//)
	//Евросиб - АСуслов 29.04.2022 15:08:52 #
	|ИЗ
	|	РегистрНакопления.РазнесениеЗатратПТУ КАК РазнесениеЗатратПТУ
	|ГДЕ
	|	РазнесениеЗатратПТУ.Регистратор = &Акцепт
	|
	|УПОРЯДОЧИТЬ ПО
	|	РазнесениеЗатратПТУ.НомерСтроки
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 
	//Евросиб - АСуслов 12.10.2023 12:39:54 #
	//(
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ПлановыеРасходыВО.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов
	//|ПОМЕСТИТЬ СписанныеПлановыеРасходы
	//|ИЗ
	//|	РегистрНакопления.ПлановыеРасходыВО КАК ПлановыеРасходыВО
	//|ГДЕ
	//|	ПлановыеРасходыВО.Списание = ИСТИНА
	//|;
	//|
	//)
	//Евросиб - АСуслов 12.10.2023 12:39:58 #
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлановыеРасходыВО.НомерСтроки КАК НомерСтроки,
	|	ПлановыеРасходыВО.ВидДвижения КАК ВидДвижения,
	|	ПлановыеРасходыВО.Организация КАК Организация,
	|	ПлановыеРасходыВО.ЦФО КАК ЦФО,
	|	ПлановыеРасходыВО.Сделка КАК Сделка,
	|	ПлановыеРасходыВО.Услуга КАК Услуга,
	|	ПлановыеРасходыВО.Поставщик КАК Поставщик,
	|	ПлановыеРасходыВО.Договор КАК Договор,
	|	ПлановыеРасходыВО.Вагон КАК Вагон,
	|	ПлановыеРасходыВО.Контейнер КАК Контейнер,
	|	ПлановыеРасходыВО.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ПлановыеРасходыВО.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ПлановыеРасходыВО.ВидОперации КАК ВидОперации,
	|	ПлановыеРасходыВО.ТипОперации КАК ТипОперации,
	|	ПлановыеРасходыВО.СтавкаНДС КАК СтавкаНДС,
	|	ПлановыеРасходыВО.Валюта КАК Валюта,
	|	ПлановыеРасходыВО.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	|	-ПлановыеРасходыВО.Сумма КАК Сумма,
	|	-ПлановыеРасходыВО.СуммаНДС КАК СуммаНДС,
	|	-ПлановыеРасходыВО.СуммаРуб КАК СуммаРуб,
	|	-ПлановыеРасходыВО.СуммаНДСРуб КАК СуммаНДСРуб,
	|	ПлановыеРасходыВО.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ВЫБОР
	|		КОГДА ПлановыеРасходыВО.Период = ДАТАВРЕМЯ(3999, 1, 1)
	|			ТОГДА ПлановыеРасходыВО.Период
	|		ИНАЧЕ &Период
	|	КОНЕЦ КАК Период,
	|	ПлановыеРасходыВО.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	ПлановыеРасходыВО.Клиент КАК Клиент,
	|	ПлановыеРасходыВО.ДоговорКлиента КАК ДоговорКлиента,
	|	ПлановыеРасходыВО.Реализация КАК Реализация
	|ИЗ
	|	РегистрНакопления.ПлановыеРасходыВО КАК ПлановыеРасходыВО
	//Евросиб - АСуслов 12.10.2023 12:40:09 #
	//(
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПлановыеРасходыВО КАК ПлановыеРасходыВО1
	|	ПО (ПлановыеРасходыВО.ИдентификаторСтрокиРасходов = ПлановыеРасходыВО1.ИдентификаторСтрокиРасходов
	|			И ПлановыеРасходыВО1.Списание = ИСТИНА)
	//)
	//Евросиб - АСуслов 12.10.2023 12:40:12 #
	|ГДЕ
	|	ПлановыеРасходыВО.Регистратор = &Акцепт
	//Евросиб - АСуслов 12.10.2023 12:40:34 #
	//(
	//|	И НЕ ПлановыеРасходыВО.ИдентификаторСтрокиРасходов В
	//|				(ВЫБРАТЬ
	//|					т.ИдентификаторСтрокиРасходов
	//|				ИЗ
	//|					СписанныеПлановыеРасходы КАК т)
	|  	И ПлановыеРасходыВО1.ИдентификаторСтрокиРасходов ЕСТЬ NULL
	//)
	//Евросиб - АСуслов 12.10.2023 12:40:35 #
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПлановыеРасходыВО.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ФактическиеРасходыВО.Период = ДАТАВРЕМЯ(3999, 1, 1)
	|			ТОГДА ФактическиеРасходыВО.Период
	|		ИНАЧЕ &Период
	|	КОНЕЦ КАК Период,
	|	ФактическиеРасходыВО.Организация КАК Организация,
	|	ФактическиеРасходыВО.Сделка КАК Сделка,
	|	ФактическиеРасходыВО.ЦФО КАК ЦФО,
	|	ФактическиеРасходыВО.Поставщик КАК Поставщик,
	|	ФактическиеРасходыВО.Договор КАК Договор,
	|	ФактическиеРасходыВО.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ФактическиеРасходыВО.Услуга КАК Услуга,
	|	ФактическиеРасходыВО.УслугаФакт КАК УслугаФакт,
	|	ФактическиеРасходыВО.Вагон КАК Вагон,
	|	ФактическиеРасходыВО.Контейнер КАК Контейнер,
	|	ФактическиеРасходыВО.Поступление КАК Поступление,
	|	ФактическиеРасходыВО.Валюта КАК Валюта,
	|	ФактическиеРасходыВО.СтавкаНДС КАК СтавкаНДС,
	|	ФактическиеРасходыВО.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ФактическиеРасходыВО.ВидОперации КАК ВидОперации,
	|	ФактическиеРасходыВО.ТипОперации КАК ТипОперации,
	|	-ФактическиеРасходыВО.Сумма КАК Сумма,
	|	-ФактическиеРасходыВО.СуммаНДС КАК СуммаНДС,
	|	-ФактическиеРасходыВО.СуммаРуб КАК СуммаРуб,
	|	-ФактическиеРасходыВО.СуммаНДСРуб КАК СуммаНДСРуб,
	|	ФактическиеРасходыВО.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ФактическиеРасходыВО.Клиент КАК Клиент,
	|	ФактическиеРасходыВО.ДоговорКлиента КАК ДоговорКлиента,
	|	ФактическиеРасходыВО.Реализация КАК Реализация
	//Евросиб Каблов 14.10.2025 ( #107942
	|	,ФактическиеРасходыВО.СтрокаРасходовСделки КАК СтрокаРасходовСделки,
	|	ФактическиеРасходыВО.ПериодУУ КАК ПериодУУ
	//Евросиб Каблов 14.10.2025 ) #107942
	|ИЗ
	|	РегистрНакопления.ФактическиеРасходыВО КАК ФактическиеРасходыВО
	|ГДЕ
	|	ФактическиеРасходыВО.Регистратор = &Акцепт
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФактическиеРасходыВО.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПериодБУ КАК Период,
	|	ФактическиеРасходыБУ.Организация КАК Организация,
	|	ФактическиеРасходыБУ.Сделка КАК Сделка,
	|	ФактическиеРасходыБУ.ЦФО КАК ЦФО,
	|	ФактическиеРасходыБУ.Поставщик КАК Поставщик,
	|	ФактическиеРасходыБУ.Договор КАК Договор,
	|	ФактическиеРасходыБУ.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ФактическиеРасходыБУ.Услуга КАК Услуга,
	|	ФактическиеРасходыБУ.УслугаФакт КАК УслугаФакт,
	|	ФактическиеРасходыБУ.Вагон КАК Вагон,
	|	ФактическиеРасходыБУ.Контейнер КАК Контейнер,
	|	ФактическиеРасходыБУ.Поступление КАК Поступление,
	|	ФактическиеРасходыБУ.Валюта КАК Валюта,
	|	ФактическиеРасходыБУ.СтавкаНДС КАК СтавкаНДС,
	|	ФактическиеРасходыБУ.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ФактическиеРасходыБУ.ВидОперации КАК ВидОперации,
	|	ФактическиеРасходыБУ.ТипОперации КАК ТипОперации,
	|	-ФактическиеРасходыБУ.Сумма КАК Сумма,
	|	-ФактическиеРасходыБУ.СуммаНДС КАК СуммаНДС,
	|	-ФактическиеРасходыБУ.СуммаРуб КАК СуммаРуб,
	|	-ФактическиеРасходыБУ.СуммаНДСРуб КАК СуммаНДСРуб,
	|	ФактическиеРасходыБУ.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ФактическиеРасходыБУ.Клиент КАК Клиент,
	|	ФактическиеРасходыБУ.ДоговорКлиента КАК ДоговорКлиента,
	|	ФактическиеРасходыБУ.Реализация КАК Реализация
	//Евросиб Каблов 14.10.2025 ( #107942
	|	,ФактическиеРасходыБУ.СтрокаРасходовСделки КАК СтрокаРасходовСделки
	//Евросиб Каблов 14.10.2025 ) #107942
	|ИЗ
	|	РегистрНакопления.ФактическиеРасходыБУ КАК ФактическиеРасходыБУ
	|ГДЕ
	|	ФактическиеРасходыБУ.Регистратор = &Акцепт
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФактическиеРасходыБУ.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФактическиеРасходыУУ.Период КАК Период,
	|	ФактическиеРасходыУУ.Организация КАК Организация,
	|	ФактическиеРасходыУУ.Сделка КАК Сделка,
	|	ФактическиеРасходыУУ.ЦФО КАК ЦФО,
	|	ФактическиеРасходыУУ.Поставщик КАК Поставщик,
	|	ФактическиеРасходыУУ.Договор КАК Договор,
	|	ФактическиеРасходыУУ.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ФактическиеРасходыУУ.Услуга КАК Услуга,
	|	ФактическиеРасходыУУ.УслугаФакт КАК УслугаФакт,
	|	ФактическиеРасходыУУ.Вагон КАК Вагон,
	|	ФактическиеРасходыУУ.Контейнер КАК Контейнер,
	|	ФактическиеРасходыУУ.Поступление КАК Поступление,
	|	ФактическиеРасходыУУ.Валюта КАК Валюта,
	|	ФактическиеРасходыУУ.СтавкаНДС КАК СтавкаНДС,
	|	ФактическиеРасходыУУ.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ФактическиеРасходыУУ.ВидОперации КАК ВидОперации,
	|	ФактическиеРасходыУУ.ТипОперации КАК ТипОперации,
	|	-ФактическиеРасходыУУ.Сумма КАК Сумма,
	|	-ФактическиеРасходыУУ.СуммаНДС КАК СуммаНДС,
	|	-ФактическиеРасходыУУ.СуммаРуб КАК СуммаРуб,
	|	-ФактическиеРасходыУУ.СуммаНДСРуб КАК СуммаНДСРуб,
	|	ФактическиеРасходыУУ.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ФактическиеРасходыУУ.Клиент КАК Клиент,
	|	ФактическиеРасходыУУ.ДоговорКлиента КАК ДоговорКлиента,
	|	ФактическиеРасходыУУ.Реализация КАК Реализация
	//Евросиб Каблов 14.10.2025 ( #107942
	|	,ФактическиеРасходыУУ.СтрокаРасходовСделки КАК СтрокаРасходовСделки
	//Евросиб Каблов 14.10.2025 ) #107942
	|ИЗ
	|	РегистрНакопления.ФактическиеРасходыУУ КАК ФактическиеРасходыУУ
	|ГДЕ
	|	ФактическиеРасходыУУ.Регистратор = &Акцепт
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФактическиеРасходыУУ.НомерСтроки
//Евросиб Гудкова( 03.07.2022 Ticket№ 54131
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ПлановыеРасходыУУ.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов
	//|ПОМЕСТИТЬ СписанныеПлановыеРасходыУУ
	//|ИЗ
	//|	РегистрНакопления.ПлановыеРасходыУУ КАК ПлановыеРасходыУУ
	//|ГДЕ
	//|	ПлановыеРасходыУУ.Списание = ИСТИНА
	//|;
	//|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлановыеРасходыУУ.НомерСтроки КАК НомерСтроки,
	|	ПлановыеРасходыУУ.ВидДвижения КАК ВидДвижения,
	|	ПлановыеРасходыУУ.Организация КАК Организация,
	|	ПлановыеРасходыУУ.ЦФО КАК ЦФО,
	|	ПлановыеРасходыУУ.Сделка КАК Сделка,
	|	ПлановыеРасходыУУ.Услуга КАК Услуга,
	|	ПлановыеРасходыУУ.Поставщик КАК Поставщик,
	|	ПлановыеРасходыУУ.Договор КАК Договор,
	|	ПлановыеРасходыУУ.Вагон КАК Вагон,
	|	ПлановыеРасходыУУ.Контейнер КАК Контейнер,
	|	ПлановыеРасходыУУ.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ПлановыеРасходыУУ.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ПлановыеРасходыУУ.ВидОперации КАК ВидОперации,
	|	ПлановыеРасходыУУ.ТипОперации КАК ТипОперации,
	|	ПлановыеРасходыУУ.СтавкаНДС КАК СтавкаНДС,
	|	ПлановыеРасходыУУ.Валюта КАК Валюта,
	|	ПлановыеРасходыУУ.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	|	-ПлановыеРасходыУУ.Сумма КАК Сумма,
	|	-ПлановыеРасходыУУ.СуммаНДС КАК СуммаНДС,
	|	-ПлановыеРасходыУУ.СуммаРуб КАК СуммаРуб,
	|	-ПлановыеРасходыУУ.СуммаНДСРуб КАК СуммаНДСРуб,
	|	ПлановыеРасходыУУ.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ПлановыеРасходыУУ.Период КАК Период,
	|	ПлановыеРасходыУУ.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	ПлановыеРасходыУУ.Клиент КАК Клиент,
	|	ПлановыеРасходыУУ.ДоговорКлиента КАК ДоговорКлиента,
	|	ПлановыеРасходыУУ.Реализация КАК Реализация
	|ИЗ
	|	РегистрНакопления.ПлановыеРасходыУУ КАК ПлановыеРасходыУУ
	//Евросиб - АСуслов 12.10.2023 12:40:09 #
	//(
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПлановыеРасходыУУ КАК ПлановыеРасходыУУ1
	|	ПО (ПлановыеРасходыУУ.ИдентификаторСтрокиРасходов = ПлановыеРасходыУУ1.ИдентификаторСтрокиРасходов
	|			И ПлановыеРасходыУУ1.Списание = ИСТИНА)
	//)
	//Евросиб - АСуслов 12.10.2023 12:40:12 #
	|ГДЕ
	|	ПлановыеРасходыУУ.Регистратор = &Акцепт
	//Евросиб - АСуслов 12.10.2023 12:42:16 #
	//(
	//|	И НЕ ПлановыеРасходыУУ.ИдентификаторСтрокиРасходов В
	//|				(ВЫБРАТЬ
	//|					т.ИдентификаторСтрокиРасходов
	//|				ИЗ
	//|					СписанныеПлановыеРасходыУУ КАК т)
	|  	И ПлановыеРасходыУУ1.ИдентификаторСтрокиРасходов ЕСТЬ NULL
	//)
	//Евросиб - АСуслов 12.10.2023 12:42:17 #
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПлановыеРасходыУУ.НомерСтроки
	|;
	//Евросиб - АСуслов 17.08.2022 15:44:47 #55129
	//(
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	РазнесениеРасходов.ВидДвижения КАК ВидДвижения,
	|	РазнесениеРасходов.Сделка КАК Сделка,
	|	РазнесениеРасходов.ГУИДРасходов КАК ГУИДРасходов,
	|	-РазнесениеРасходов.НеРазнесено КАК НеРазнесено
	|ИЗ
	|	РегистрНакопления.РазнесениеРасходов КАК РазнесениеРасходов
	|ГДЕ
	|	РазнесениеРасходов.Регистратор = &Акцепт
	|
	|УПОРЯДОЧИТЬ ПО
	|	РазнесениеРасходов.НомерСтроки
	|;
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	&Период КАК Период,
	//|	РазнесениеАкцептовВСделки.Сделка КАК Сделка,
	//|	РазнесениеАкцептовВСделки.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	//|	РазнесениеАкцептовВСделки.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
	//|	-РазнесениеАкцептовВСделки.Сумма КАК Сумма
	//|ИЗ
	//|	РегистрНакопления.РазнесениеАкцептовВСделки КАК РазнесениеАкцептовВСделки
	//|ГДЕ
	//|	РазнесениеАкцептовВСделки.Регистратор = &Акцепт
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	РазнесениеАкцептовВСделки.НомерСтроки
	//|;
	//)
	//Евросиб - АСуслов 17.08.2022 15:44:56 #55129
	
	//Евросиб Каблов 07.09.2022 ( US49022
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	НеурегулированныеРасходы.ИдентификаторСтрокиАкцепта КАК ИдентификаторСтрокиАкцепта,
	|	НеурегулированныеРасходы.Поступление КАК Поступление,
	|	НеурегулированныеРасходы.Сумма КАК Сумма,
	|	НеурегулированныеРасходы.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	РегистрНакопления.НеурегулированныеРасходы КАК НеурегулированныеРасходы
	|ГДЕ
	|	НеурегулированныеРасходы.Регистратор = &Акцепт
	|
	|УПОРЯДОЧИТЬ ПО
	|	НеурегулированныеРасходы.НомерСтроки
	//Евросиб Каблов 07.09.2022 )
	|;
	|//////////////////////////////////////////////////////////////////////////////// 
	//Субботин 81701  28.02.2024  начало //пакет 8
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	РазнесениеСуммРасходов.Сделка КАК Сделка,
	|	РазнесениеСуммРасходов.ГУИДРасходов КАК ГУИДРасходов,
	|	РазнесениеСуммРасходов.Валюта КАК Валюта,
	|	РазнесениеСуммРасходов.СтавкаНДС КАК СтавкаНДС,
	|	РазнесениеСуммРасходов.Номенклатура КАК Номенклатура,
	|	-РазнесениеСуммРасходов.Сумма КАК Сумма,
	|	-РазнесениеСуммРасходов.СуммаНДС КАК СуммаНДС,
	|	-РазнесениеСуммРасходов.СуммаВсего КАК СуммаВсего
	|ИЗ
	|	РегистрНакопления.РазнесениеСуммРасходов КАК РазнесениеСуммРасходов
	|ГДЕ
	|	РазнесениеСуммРасходов.Регистратор = &Акцепт
	|
	|УПОРЯДОЧИТЬ ПО
	|	РазнесениеСуммРасходов.НомерСтроки
	//Субботин 81701  28.02.2024  Конец
	|"; 
	
// Евросиб Гудкова)
	//)
	//Евросиб - АСуслов 21.08.2021 16:22:00 #33698
	Запрос.УстановитьПараметр("Акцепт", ОбъектАкцепт.СторнируемыйАкцепт);
	Запрос.УстановитьПараметр("Период", НачалоМесяца(ОбъектАкцепт.ПериодВО));
	Запрос.УстановитьПараметр("ПериодБУ", НачалоМесяца(ОбъектАкцепт.ПериодБУ));
	Запрос.УстановитьПараметр("ПериодУУ", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектАкцепт.Ссылка, "Поступление.ДатаВходящегоДокумента"));
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ТаблицаРазнесениеЗатратПТУ = РезультатыЗапроса[0].Выгрузить();
	//Евросиб - АСуслов 21.08.2021 16:22:12 #33698
	//(
	ТаблицаПлановыеРасходыВО = РезультатыЗапроса[1].Выгрузить();
	ТаблицаФактическиеРасходыВО = РезультатыЗапроса[2].Выгрузить();
	ТаблицаФактическиеРасходыБУ = РезультатыЗапроса[3].Выгрузить();
	ТаблицаФактическиеРасходыУУ = РезультатыЗапроса[4].Выгрузить();
//Евросиб Гудкова( 03.07.2022 Ticket№ 54131
	ТаблицаПлановыеРасходыУУ = РезультатыЗапроса[5].Выгрузить();
// Евросиб Гудкова)                      
	//Евросиб - АСуслов 17.08.2022 15:48:37 #55129
	//(
	ТаблицаРазнесениеРасходов = РезультатыЗапроса[6].Выгрузить();
	//ТаблицаРазнесениеАкцептовВСделки = РезультатыЗапроса[9].Выгрузить();
	//)
	//Евросиб - АСуслов 17.08.2022 15:48:41 #55129
	//)
	//Евросиб - АСуслов 21.08.2021 16:22:16 #33698
	
	//Евросиб - АСуслов 14.12.2022 9:30:00 #62448
	//(
	//РазнесениеЗатратПТУ = ОбъектАкцепт.Движения.РазнесениеЗатратПТУ;
	//РазнесениеЗатратПТУ.Записывать = Истина;
	//РазнесениеЗатратПТУ.Загрузить(ТаблицаРазнесениеЗатратПТУ); 
	//Евросиб - АСуслов 17.08.2022 15:49:11 #55129
	//(
	//)
	//Евросиб - АСуслов 14.12.2022 9:30:04 #62448
	РазнесениеРасходов = ОбъектАкцепт.Движения.РазнесениеРасходов;
	РазнесениеРасходов.Записывать = Истина;
	РазнесениеРасходов.Загрузить(ТаблицаРазнесениеРасходов); 

	//РазнесениеАкцептовВСделки = ОбъектАкцепт.Движения.РазнесениеАкцептовВСделки;
	//РазнесениеАкцептовВСделки.Записывать = Истина;
	//РазнесениеАкцептовВСделки.Загрузить(ТаблицаРазнесениеАкцептовВСделки); 
	//)
	//Евросиб - АСуслов 17.08.2022 15:49:13 #55129
	
	//Евросиб - АСуслов 21.08.2021 16:22:40 #33698
	//(
//Евросиб Гудкова( 03.07.2022 Ticket№ 54131 добавила возможность не записывать лишние регистры
	Если ПланВО Тогда
		ПлановыеРасходыВО = ОбъектАкцепт.Движения.ПлановыеРасходыВО;
		ПлановыеРасходыВО.Записывать = Истина;
		ПлановыеРасходыВО.Загрузить(ТаблицаПлановыеРасходыВО);
	КонецЕсли;
    Если ФактВО Тогда
		ФактическиеРасходыВО = ОбъектАкцепт.Движения.ФактическиеРасходыВО;
		ФактическиеРасходыВО.Записывать = Истина;
		ФактическиеРасходыВО.Загрузить(ТаблицаФактическиеРасходыВО);
	КонецЕсли;
	Если ФактБУ Тогда
		ФактическиеРасходыБУ = ОбъектАкцепт.Движения.ФактическиеРасходыБУ;
		ФактическиеРасходыБУ.Записывать = Истина;
		ФактическиеРасходыБУ.Загрузить(ТаблицаФактическиеРасходыБУ);
	КонецЕсли;
    Если ФактУУ Тогда
		ФактическиеРасходыУУ = ОбъектАкцепт.Движения.ФактическиеРасходыУУ;
		ФактическиеРасходыУУ.Записывать = Истина;
		ФактическиеРасходыУУ.Загрузить(ТаблицаФактическиеРасходыУУ);
	КонецЕсли;
//Евросиб Гудкова( 03.07.2022 Ticket№ 54131
    Если ПланУУ Тогда
		ПлановыеРасходыУУ = ОбъектАкцепт.Движения.ПлановыеРасходыУУ;
		ПлановыеРасходыУУ.Записывать = Истина;
		ПлановыеРасходыУУ.Загрузить(ТаблицаПлановыеРасходыУУ);
	КонецЕсли;
// Евросиб Гудкова)
	//)
	//Евросиб - АСуслов 21.08.2021 16:22:42 #33698
	
	//Евросиб Каблов 18.07.2022 ( Task 54465
	Акцепт_СформироватьДвиженияСторноНезавершенноеПроизводство(ОбъектАкцепт);
	Акцепт_СформироватьДвиженияСторноНезавершенноеПроизводствоПоПериодуПроведенияВБУ(ОбъектАкцепт);
	//Евросиб Каблов 18.07.2022 )
	
	//Евросиб Каблов 20.11.2025 ( #104968
	УчетДоходовРасходовСервер.Акцепт_СформироватьДвиженияСторноНезавершенноеПроизводствоРасширенный(ОбъектАкцепт);
	//Евросиб Каблов 20.11.2025 ) #104968
	
	//Евросиб Каблов 07.09.2022 ( US49022
	НеурегулированныеРасходы = ОбъектАкцепт.Движения.НеурегулированныеРасходы;
	НеурегулированныеРасходы.Записывать = Истина;
	НеурегулированныеРасходы.Загрузить(РезультатыЗапроса[7].Выгрузить());
	//Евросиб Каблов 07.09.2022 )
	
	//Субботин 81701  28.02.2024  начало //пакет 8
	РазнесениеСуммРасходов = ОбъектАкцепт.Движения.РазнесениеСуммРасходов;
	РазнесениеСуммРасходов.Записывать = Истина;
	РазнесениеСуммРасходов.Загрузить(РезультатыЗапроса[8].Выгрузить());
	//Субботин 81701  28.02.2024  конец
	
КонецПроцедуры

//Евросиб Каблов 18.07.2022 Task 54465
Процедура Акцепт_СформироватьДвиженияНезавершенноеПроизводство(ОбъектАкцепт) Экспорт
	
	ДвиженияНЗП = ОбъектАкцепт.Движения.НезавершенноеПроизводство;
	ДвиженияНЗП.Очистить();
	ДвиженияНЗП.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ПоступлениеТоваровУслуг.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслуг.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.РЖД)
	|			ТОГДА ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента, ДАТАВРЕМЯ(1, 1, 1))
	|		ИНАЧЕ ПоступлениеТоваровУслуг.ДатаВходящегоДокумента
	|	КОНЕЦ КАК ДатаВходящегоДокумента,
	|	ПоступлениеТоваровУслуг.Штраф КАК Штраф
	//Евросиб Каблов 02.09.2025 ( #114613
	|	,ПоступлениеТоваровУслуг.Претензия КАК Претензия
	//Евросиб Каблов 02.09.2025 ) #114613
	//Евросиб Каблов 30.09.2025 ( #104972
	|	,ПоступлениеТоваровУслуг.ВалютаДокумента КАК ВалютаДокумента
	//Евросиб Каблов 30.09.2025 )
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	|		ПО ПоступлениеТоваровУслуг.Ссылка = СчетФактураПолученныйДокументыОснования.ДокументОснование
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Ссылка = &Поступление";
	
	ИсходноеПоступление = БухгалтерскийУчетПереопределяемый.ПолучитьИсправляемыйДокументПоступления(ОбъектАкцепт.Поступление, Истина);
	Запрос.УстановитьПараметр("Поступление", ИсходноеПоступление);
	
	РеквизитыПТУ = Запрос.Выполнить().Выбрать();
	
	Если Не РеквизитыПТУ.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	//Евросиб Каблов 02.09.2025 ( #114613
	//Если РеквизитыПТУ.ДатаВходящегоДокумента < '20210101' Или РеквизитыПТУ.Штраф Тогда
	Если РеквизитыПТУ.ДатаВходящегоДокумента < '20210101' Или РеквизитыПТУ.Штраф Или РеквизитыПТУ.Претензия Тогда
	//Евросиб Каблов 02.09.2025 ) #114613
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АкцептУслуги.НомерСтроки КАК НомерСтроки,
	|	АкцептУслуги.НоменклатураСделки КАК Номенклатура,
	|	АкцептУслуги.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	АкцептУслуги.Сделка КАК Сделка,
	|	АкцептУслуги.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке,
	|	АкцептУслуги.Сделка.Подразделение КАК Подразделение,
	|	АкцептУслуги.ВидРасходов КАК ВидРасходов,
	|	АкцептУслуги.Сумма КАК Сумма,
	|	АкцептУслуги.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	Документ.Акцепт.Услуги КАК АкцептУслуги
	|ГДЕ
	|	АкцептУслуги.Ссылка = &Ссылка
	|	И АкцептУслуги.ВидЗатрат = &ВидЗатрат
	|	И АкцептУслуги.Сделка <> ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
	|	И АкцептУслуги.Сумма <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", ОбъектАкцепт.Ссылка);
	Запрос.УстановитьПараметр("ВидЗатрат", Перечисления.ВидыЗатрат.НезавершенноеПроизводство);
	
	ВыборкаСтрок = Запрос.Выполнить().Выбрать();	
	Пока ВыборкаСтрок.Следующий() Цикл
		
		Запись = ДвиженияНЗП.ДобавитьПриход();
		Запись.Акцепт = ОбъектАкцепт.Ссылка;
		Запись.Период = ОбъектАкцепт.ПериодБУ;
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаСтрок);
		Запись.СтатьяЗатрат = ВыборкаСтрок.Номенклатура;
		Запись.Поступление = ОбъектАкцепт.Поступление;
		Запись.СтрокаРасходовСделки = ВыборкаСтрок.ИдентификаторСтрокиРасходовВСделке;
		//Евросиб Каблов 30.09.2025 ( #104972
		Запись.Валюта = РеквизитыПТУ.ВалютаДокумента;
		//Евросиб Каблов 30.09.2025 )
		Запись.Сумма = ВыборкаСтрок.Сумма;
		Запись.СуммаНДС = ВыборкаСтрок.СуммаНДС;
		Запись.СуммаРуб = ВыборкаСтрок.Сумма / РеквизитыПТУ.КратностьВзаиморасчетов * РеквизитыПТУ.КурсВзаиморасчетов;
		Запись.СуммаНДСРуб = ВыборкаСтрок.СуммаНДС / РеквизитыПТУ.КратностьВзаиморасчетов * РеквизитыПТУ.КурсВзаиморасчетов;
		
	КонецЦикла;
	
КонецПроцедуры

//Евросиб Каблов 20.11.2025 #104968
Процедура Акцепт_СформироватьДвиженияНезавершенноеПроизводствоРасширенный(ОбъектАкцепт) Экспорт
	
	ДвиженияНЗП = ОбъектАкцепт.Движения.НезавершенноеПроизводствоРасширенный;
	ДвиженияНЗП.Очистить();
	ДвиженияНЗП.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ПоступлениеТоваровУслуг.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслуг.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.РЖД)
	|			ТОГДА ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента, ДАТАВРЕМЯ(1, 1, 1))
	|		ИНАЧЕ ПоступлениеТоваровУслуг.ДатаВходящегоДокумента
	|	КОНЕЦ КАК ДатаВходящегоДокумента,
	|	ПоступлениеТоваровУслуг.Штраф КАК Штраф,
	|	ПоступлениеТоваровУслуг.Претензия КАК Претензия,
	|	ПоступлениеТоваровУслуг.ВалютаДокумента КАК ВалютаДокумента
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	|		ПО ПоступлениеТоваровУслуг.Ссылка = СчетФактураПолученныйДокументыОснования.ДокументОснование
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Ссылка = &Поступление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПротоколОбменов.ПроведенВБУ КАК ПроведенВБУ,
	|	ПротоколОбменов.ДатаДокументаВнешнейИС КАК ДатаДокументаВнешнейИС
	|ИЗ
	|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|ГДЕ
	|	ПротоколОбменов.Объект = &Акцепт
	|	И ПротоколОбменов.УзелОбмена = &УзелОбменаУПП
	|	И ПротоколОбменов.ДействиеПриОбмене = &ДействиеПриОбменеВыгрузкаДанных";
	
	ИсходноеПоступление = БухгалтерскийУчетПереопределяемый.ПолучитьИсправляемыйДокументПоступления(ОбъектАкцепт.Поступление, Истина);
	Запрос.УстановитьПараметр("Поступление", ИсходноеПоступление);
	
	Запрос.УстановитьПараметр("Акцепт", ОбъектАкцепт.Ссылка);
	Запрос.УстановитьПараметр("УзелОбменаУПП", Перечисления.УзлыОбмена.УПП);
	Запрос.УстановитьПараметр("ДействиеПриОбменеВыгрузкаДанных", Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	РеквизитыПТУ = РезультатыЗапроса[0].Выбрать();
	
	РезультатЗапросаПротокола = РезультатыЗапроса[1];
	Выгружен = Не РезультатЗапросаПротокола.Пустой();
	
	Если Не РеквизитыПТУ.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	Если РеквизитыПТУ.ДатаВходящегоДокумента < '20210101' Или РеквизитыПТУ.Штраф Или РеквизитыПТУ.Претензия Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АкцептУслуги.НомерСтроки КАК НомерСтроки,
	|	АкцептУслуги.НоменклатураСделки КАК СтатьяЗатрат,
	|	АкцептУслуги.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	АкцептУслуги.Сделка КАК Сделка,
	|	АкцептУслуги.ИдентификаторСтрокиРасходовВСделке КАК СтрокаРасходовСделки,
	|	АкцептУслуги.Сделка.Подразделение КАК Подразделение,
	|	АкцептУслуги.ВидРасходов КАК ВидРасходов,
	|	АкцептУслуги.Сумма КАК Сумма,
	|	АкцептУслуги.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	Документ.Акцепт.Услуги КАК АкцептУслуги
	|ГДЕ
	|	АкцептУслуги.Ссылка = &Ссылка
	|	И АкцептУслуги.ВидЗатрат = &ВидЗатрат
	|	И АкцептУслуги.Сделка <> ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
	|	И АкцептУслуги.Сумма <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", ОбъектАкцепт.Ссылка);
	Запрос.УстановитьПараметр("ВидЗатрат", Перечисления.ВидыЗатрат.НезавершенноеПроизводство);
	
	ВыборкаСтрок = Запрос.Выполнить().Выбрать();	
	Пока ВыборкаСтрок.Следующий() Цикл
		
		Запись = ДвиженияНЗП.ДобавитьПриход();
		Запись.Акцепт = ОбъектАкцепт.Ссылка;
		Запись.Период = ОбъектАкцепт.ПериодБУ;
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаСтрок);
		Запись.Поступление = ОбъектАкцепт.Поступление;
		Запись.Валюта = РеквизитыПТУ.ВалютаДокумента;
		Запись.Выгружен = Выгружен;
		Запись.СуммаРуб = ВыборкаСтрок.Сумма / РеквизитыПТУ.КратностьВзаиморасчетов * РеквизитыПТУ.КурсВзаиморасчетов;
		Запись.СуммаНДСРуб = ВыборкаСтрок.СуммаНДС / РеквизитыПТУ.КратностьВзаиморасчетов * РеквизитыПТУ.КурсВзаиморасчетов;
		
	КонецЦикла;
	
КонецПроцедуры

//Евросиб Каблов 18.07.2022 Task 54465
Процедура Акцепт_СформироватьДвиженияСторноНезавершенноеПроизводство(ОбъектАкцепт) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&ПериодБУ КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	НезавершенноеПроизводство.Подразделение КАК Подразделение,
	|	НезавершенноеПроизводство.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	НезавершенноеПроизводство.СтатьяЗатрат КАК СтатьяЗатрат,
	|	НезавершенноеПроизводство.Поступление КАК Поступление,
	|	НезавершенноеПроизводство.Акцепт КАК Акцепт,
	|	НезавершенноеПроизводство.Сделка КАК Сделка,
	|	НезавершенноеПроизводство.СтрокаРасходовСделки КАК СтрокаРасходовСделки,
	|	НезавершенноеПроизводство.ВидРасходов КАК ВидРасходов,
	//Евросиб Каблов 30.09.2025 ( #104972
	|	НезавершенноеПроизводство.Валюта КАК Валюта,
	//Евросиб Каблов 30.09.2025 )
	|	НезавершенноеПроизводство.Сумма КАК Сумма,
	|	НезавершенноеПроизводство.СуммаРуб КАК СуммаРуб,
	|	НезавершенноеПроизводство.СуммаНДС КАК СуммаНДС,
	|	НезавершенноеПроизводство.СуммаНДСРуб КАК СуммаНДСРуб
	|ИЗ
	|	РегистрНакопления.НезавершенноеПроизводство КАК НезавершенноеПроизводство
	|ГДЕ
	|	НезавершенноеПроизводство.Регистратор = &Акцепт";
	
	Запрос.УстановитьПараметр("Акцепт", ОбъектАкцепт.СторнируемыйАкцепт);
	Запрос.УстановитьПараметр("ПериодБУ", НачалоМесяца(ОбъектАкцепт.ПериодБУ));
	
	ТаблицаНезавершенноеПроизводство = Запрос.Выполнить().Выгрузить();
	ДвиженияНезавершенноеПроизводство = ОбъектАкцепт.Движения.НезавершенноеПроизводство;
	ДвиженияНезавершенноеПроизводство.Записывать = Истина;
	ДвиженияНезавершенноеПроизводство.Загрузить(ТаблицаНезавершенноеПроизводство);
	
КонецПроцедуры

//Евросиб Каблов 20.11.2025 #104968
Процедура Акцепт_СформироватьДвиженияСторноНезавершенноеПроизводствоРасширенный(ОбъектАкцепт) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПротоколОбменов.ПроведенВБУ КАК ПроведенВБУ,
	|	ПротоколОбменов.ДатаДокументаВнешнейИС КАК ДатаДокументаВнешнейИС
	|ПОМЕСТИТЬ ПротоколОбмена
	|ИЗ
	|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|ГДЕ
	|	ПротоколОбменов.Объект = &Акцепт
	|	И ПротоколОбменов.УзелОбмена = &УзелОбменаУПП
	|	И ПротоколОбменов.ДействиеПриОбмене = &ДействиеПриОбменеВыгрузкаДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПериодБУ КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	НезавершенноеПроизводство.Подразделение КАК Подразделение,
	|	НезавершенноеПроизводство.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	НезавершенноеПроизводство.СтатьяЗатрат КАК СтатьяЗатрат,
	|	НезавершенноеПроизводство.Поступление КАК Поступление,
	|	НезавершенноеПроизводство.Акцепт КАК Акцепт,
	|	НезавершенноеПроизводство.Сделка КАК Сделка,
	|	НезавершенноеПроизводство.СтрокаРасходовСделки КАК СтрокаРасходовСделки,
	|	НезавершенноеПроизводство.ВидРасходов КАК ВидРасходов,
	|	НезавершенноеПроизводство.Валюта КАК Валюта,
	|	НезавершенноеПроизводство.Сумма КАК Сумма,
	|	НезавершенноеПроизводство.СуммаРуб КАК СуммаРуб,
	|	НезавершенноеПроизводство.СуммаНДС КАК СуммаНДС,
	|	НезавершенноеПроизводство.СуммаНДСРуб КАК СуммаНДСРуб,
	|	ВЫБОР
	|		КОГДА ПротоколОбмена.ПроведенВБУ ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Выгружен
	|ИЗ
	|	РегистрНакопления.НезавершенноеПроизводствоРасширенный КАК НезавершенноеПроизводство
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПротоколОбмена КАК ПротоколОбмена
	|		ПО (ИСТИНА)
	|ГДЕ
	|	НезавершенноеПроизводство.Регистратор = &СторнируемыйАкцепт";
	
	Запрос.УстановитьПараметр("СторнируемыйАкцепт", ОбъектАкцепт.СторнируемыйАкцепт);
	Запрос.УстановитьПараметр("ПериодБУ", НачалоМесяца(ОбъектАкцепт.ПериодБУ));
	
	Запрос.УстановитьПараметр("Акцепт", ОбъектАкцепт.Ссылка);
	Запрос.УстановитьПараметр("УзелОбменаУПП", Перечисления.УзлыОбмена.УПП);
	Запрос.УстановитьПараметр("ДействиеПриОбменеВыгрузкаДанных", Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
	
	НезавершенноеПроизводствоРасширенный = ОбъектАкцепт.Движения.НезавершенноеПроизводствоРасширенный;
	НезавершенноеПроизводствоРасширенный.Записывать = Истина;
	НезавершенноеПроизводствоРасширенный.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

//Евросиб Каблов 18.07.2022 Task 54465
Процедура Акцепт_СформироватьДвиженияНезавершенноеПроизводствоПоПериодуПроведенияВБУ(ОбъектАкцепт) Экспорт
	
	ДвиженияНЗППоПериодуПроведенияВБУ = ОбъектАкцепт.Движения.НезавершенноеПроизводствоПоПериодуПроведенияВБУ;
	ДвиженияНЗППоПериодуПроведенияВБУ.Очистить();
	ДвиженияНЗППоПериодуПроведенияВБУ.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ПоступлениеТоваровУслуг.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслуг.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.РЖД)
	|			ТОГДА ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента, ДАТАВРЕМЯ(1, 1, 1))
	|		ИНАЧЕ ПоступлениеТоваровУслуг.ДатаВходящегоДокумента
	|	КОНЕЦ КАК ДатаВходящегоДокумента,
	|	ПоступлениеТоваровУслуг.Штраф КАК Штраф
	//Евросиб Каблов 02.09.2025 ( #114613
	|	,ПоступлениеТоваровУслуг.Претензия КАК Претензия
	//Евросиб Каблов 02.09.2025 ) #114613	
	//Евросиб Каблов 30.09.2025 ( #104972
	|	,ПоступлениеТоваровУслуг.ВалютаДокумента КАК ВалютаДокумента
	//Евросиб Каблов 30.09.2025 )
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	|		ПО ПоступлениеТоваровУслуг.Ссылка = СчетФактураПолученныйДокументыОснования.ДокументОснование
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Ссылка = &Поступление";
	
	ИсходноеПоступление = БухгалтерскийУчетПереопределяемый.ПолучитьИсправляемыйДокументПоступления(ОбъектАкцепт.Поступление, Истина);
	Запрос.УстановитьПараметр("Поступление", ИсходноеПоступление);
	
	РеквизитыПТУ = Запрос.Выполнить().Выбрать();
	Если Не РеквизитыПТУ.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	//Евросиб Каблов 02.09.2025 ( #114613
	//Если РеквизитыПТУ.ДатаВходящегоДокумента < '20210101' Или РеквизитыПТУ.Штраф Тогда
	Если РеквизитыПТУ.ДатаВходящегоДокумента < '20210101' Или РеквизитыПТУ.Штраф Или РеквизитыПТУ.Претензия Тогда
	//Евросиб Каблов 02.09.2025 ) #114613
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПротоколОбменов.ПроведенВБУ КАК ПроведенВБУ,
	|	ПротоколОбменов.ДатаДокументаВнешнейИС КАК ДатаДокументаВнешнейИС
	|ИЗ
	|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|ГДЕ
	|	ПротоколОбменов.Объект = &Акцепт
	|	И ПротоколОбменов.УзелОбмена = &УзелОбменаУПП
	|	И ПротоколОбменов.ДействиеПриОбмене = &ДействиеПриОбменеВыгрузкаДанных";
	Запрос.УстановитьПараметр("Акцепт", ОбъектАкцепт.Ссылка);
	Запрос.УстановитьПараметр("УзелОбменаУПП", Перечисления.УзлыОбмена.УПП);
	Запрос.УстановитьПараметр("ДействиеПриОбменеВыгрузкаДанных", Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() И Выборка.ПроведенВБУ И ЗначениеЗаполнено(Выборка.ДатаДокументаВнешнейИС) Тогда		
		
		МесяцДокументаВнешнейИС = НачалоМесяца(Выборка.ДатаДокументаВнешнейИС);
		Поступление = ОбъектАкцепт.Поступление;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	АкцептУслуги.НомерСтроки КАК НомерСтроки,
		|	АкцептУслуги.НоменклатураСделки КАК Номенклатура,
		|	АкцептУслуги.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
		|	АкцептУслуги.Сделка КАК Сделка,
		|	АкцептУслуги.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке,
		|	АкцептУслуги.Сделка.Подразделение КАК Подразделение,
		|	АкцептУслуги.ВидРасходов КАК ВидРасходов,
		|	АкцептУслуги.Сумма КАК Сумма,
		|	АкцептУслуги.СуммаНДС КАК СуммаНДС
		|ИЗ
		|	Документ.Акцепт.Услуги КАК АкцептУслуги
		|ГДЕ
		|	АкцептУслуги.Ссылка = &Ссылка
		|	И АкцептУслуги.ВидЗатрат = &ВидЗатрат
		|	И АкцептУслуги.Сделка <> ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
		|	И АкцептУслуги.Сумма <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
		Запрос.УстановитьПараметр("Ссылка", ОбъектАкцепт.Ссылка);
		Запрос.УстановитьПараметр("ВидЗатрат", Перечисления.ВидыЗатрат.НезавершенноеПроизводство);
		Запрос.УстановитьПараметр("ВидРасходовВозмещаемые", Перечисления.ВидыРасходов.Возмещаемые);
		
		ВыборкаСтрок = Запрос.Выполнить().Выбрать();
		Пока ВыборкаСтрок.Следующий() Цикл
			
			Запись = ДвиженияНЗППоПериодуПроведенияВБУ.ДобавитьПриход();
			Запись.Период = МесяцДокументаВнешнейИС;
			ЗаполнитьЗначенияСвойств(Запись, ВыборкаСтрок);
			Запись.СтатьяЗатрат = ВыборкаСтрок.Номенклатура;
			Запись.Поступление = Поступление;
			//Евросиб Каблов 30.09.2025 ( #104972
			Запись.Акцепт = ОбъектАкцепт.Ссылка;
			Запись.Валюта = РеквизитыПТУ.ВалютаДокумента;
			//Евросиб Каблов 30.09.2025 )
			Запись.СтрокаРасходовСделки = ВыборкаСтрок.ИдентификаторСтрокиРасходовВСделке;
			Запись.Сумма = ВыборкаСтрок.Сумма;
			Запись.СуммаНДС = ВыборкаСтрок.СуммаНДС;
			Запись.СуммаРуб = ВыборкаСтрок.Сумма / РеквизитыПТУ.КратностьВзаиморасчетов * РеквизитыПТУ.КурсВзаиморасчетов;
			Запись.СуммаНДСРуб = ВыборкаСтрок.СуммаНДС / РеквизитыПТУ.КратностьВзаиморасчетов * РеквизитыПТУ.КурсВзаиморасчетов;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Каблов 18.07.2022 Task 54465
Процедура Акцепт_СформироватьДвиженияСторноНезавершенноеПроизводствоПоПериодуПроведенияВБУ(ОбъектАкцепт) Экспорт
	
	//Евросиб Каблов 30.09.2025 ( #104972
	ДвиженияНезавершенноеПроизводствоПоПериодуПроведенияВБУ = ОбъектАкцепт.Движения.НезавершенноеПроизводствоПоПериодуПроведенияВБУ;
	ДвиженияНезавершенноеПроизводствоПоПериодуПроведенияВБУ.Очистить();
	ДвиженияНезавершенноеПроизводствоПоПериодуПроведенияВБУ.Записывать = Истина;
	//Евросиб Каблов 30.09.2025 ) #104972
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПротоколОбменов.ПроведенВБУ КАК ПроведенВБУ,
	|	ПротоколОбменов.ДатаДокументаВнешнейИС КАК ДатаДокументаВнешнейИС
	|ИЗ
	|	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	|ГДЕ
	|	ПротоколОбменов.Объект = &Акцепт
	|	И ПротоколОбменов.УзелОбмена = &УзелОбменаУПП
	|	И ПротоколОбменов.ДействиеПриОбмене = &ДействиеПриОбменеВыгрузкаДанных";
	Запрос.УстановитьПараметр("Акцепт", ОбъектАкцепт.Ссылка);
	Запрос.УстановитьПараметр("УзелОбменаУПП", Перечисления.УзлыОбмена.УПП);
	Запрос.УстановитьПараметр("ДействиеПриОбменеВыгрузкаДанных", Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() И Выборка.ПроведенВБУ И ЗначениеЗаполнено(Выборка.ДатаДокументаВнешнейИС) Тогда		
		
		МесяцДокументаВнешнейИС = НачалоМесяца(Выборка.ДатаДокументаВнешнейИС);
	
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	&МесяцДокументаВнешнейИС КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	НезавершенноеПроизводствоПоПериодуПроведенияВБУ.Подразделение КАК Подразделение,
		|	НезавершенноеПроизводствоПоПериодуПроведенияВБУ.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
		|	НезавершенноеПроизводствоПоПериодуПроведенияВБУ.СтатьяЗатрат КАК СтатьяЗатрат,
		|	НезавершенноеПроизводствоПоПериодуПроведенияВБУ.Поступление КАК Поступление,
		//Евросиб Каблов 30.09.2025 ( #104972		
		|	НезавершенноеПроизводствоПоПериодуПроведенияВБУ.Акцепт КАК Акцепт,
		//Евросиб Каблов 30.09.2025 )
		|	НезавершенноеПроизводствоПоПериодуПроведенияВБУ.Сделка КАК Сделка,
		|	НезавершенноеПроизводствоПоПериодуПроведенияВБУ.СтрокаРасходовСделки КАК СтрокаРасходовСделки,
		|	НезавершенноеПроизводствоПоПериодуПроведенияВБУ.ВидРасходов КАК ВидРасходов,
		//Евросиб Каблов 30.09.2025 ( #104972
		|	НезавершенноеПроизводствоПоПериодуПроведенияВБУ.Валюта КАК Валюта,
		//Евросиб Каблов 30.09.2025 )
		|	НезавершенноеПроизводствоПоПериодуПроведенияВБУ.Сумма КАК Сумма,
		|	НезавершенноеПроизводствоПоПериодуПроведенияВБУ.СуммаРуб КАК СуммаРуб,
		|	НезавершенноеПроизводствоПоПериодуПроведенияВБУ.СуммаНДС КАК СуммаНДС,
		|	НезавершенноеПроизводствоПоПериодуПроведенияВБУ.СуммаНДСРуб КАК СуммаНДСРуб
		|ИЗ
		|	РегистрНакопления.НезавершенноеПроизводствоПоПериодуПроведенияВБУ КАК НезавершенноеПроизводствоПоПериодуПроведенияВБУ
		|ГДЕ
		|	НезавершенноеПроизводствоПоПериодуПроведенияВБУ.Регистратор = &СторнируемыйАкцепт";
		
		Запрос.УстановитьПараметр("СторнируемыйАкцепт", ОбъектАкцепт.СторнируемыйАкцепт);
		Запрос.УстановитьПараметр("МесяцДокументаВнешнейИС", МесяцДокументаВнешнейИС);
		
		ТаблицаНезавершенноеПроизводствоПоПериодуПроведенияВБУ = Запрос.Выполнить().Выгрузить();
		//Евросиб Каблов 30.09.2025 ( #104972
		//ДвиженияНезавершенноеПроизводствоПоПериодуПроведенияВБУ = ОбъектАкцепт.Движения.НезавершенноеПроизводствоПоПериодуПроведенияВБУ;
		//ДвиженияНезавершенноеПроизводствоПоПериодуПроведенияВБУ.Записывать = Истина;
		//Евросиб Каблов 30.09.2025 ) #104972
		ДвиженияНезавершенноеПроизводствоПоПериодуПроведенияВБУ.Загрузить(ТаблицаНезавершенноеПроизводствоПоПериодуПроведенияВБУ);
		
	КонецЕсли;
	
КонецПроцедуры

//Акцепт. Запрос фактических расходов.
Функция Акцепт_ПолучитьТекстЗапросаФактическиеРасходы(ВидУчета)
	ТекстЗапроса =	
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Ссылка КАК ПТУ,
	|	ПоступлениеТоваровУслуг.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	ПоступлениеТоваровУслуг.ВалютаДокумента КАК ВалютаДокумента,
	|	ЕСТЬNULL(КурсыВалютПоступления.Курс, 1) КАК КурсВалюты,
	|	ЕСТЬNULL(КурсыВалютПоступления.Кратность, 1) КАК КратностьВалюты
	|ПОМЕСТИТЬ ПоступлениеТоваровУслуг
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютПоступления
	|		ПО ПоступлениеТоваровУслуг.ВалютаДокумента = КурсыВалютПоступления.Валюта
	|			И ПоступлениеТоваровУслуг.ДатаВходящегоДокумента = КурсыВалютПоступления.Период
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Ссылка = &ДокументПоступление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА АкцептУслуги.ВидЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыЗатрат.НезавершенноеПроизводство)
	|				ИЛИ НЕ ЕСТЬNULL(АкцептУслуги.УчДокумент.Проведен, ЛОЖЬ)
	|					И АкцептУслуги.ВидЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыЗатрат.КосвенныеЗатраты)
	|				ИЛИ АкцептУслуги.Сделка.Служебная
	|			ТОГДА ДАТАВРЕМЯ(3999, 1, 1)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА АкцептУслуги.Ссылка.ПериодВО >= НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(&ДокументПоступление КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента, МЕСЯЦ)
	|					ТОГДА АкцептУслуги.Ссылка.ПериодВО
	|				ИНАЧЕ НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(&ДокументПоступление КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента, МЕСЯЦ)
	|			КОНЕЦ
	|	КОНЕЦ КАК Период,
	|	АкцептУслуги.Ссылка.Организация КАК Организация,
	//Евросиб Каблов 05.09.2024 ( Ticket#0355763
	//|	АкцептУслуги.Ссылка.Поступление.ЦФО КАК ЦФО,
	|	ВЫБОР
	|		КОГДА НЕ СделкаДоходы.УчДокумент.Ссылка ЕСТЬ NULL
	|			ТОГДА СделкаДоходы.УчДокумент.ЦФО
	|		КОГДА НЕ СделкаСвязьУчетныхЕдиниц.Калькуляция.ЦФО ЕСТЬ NULL
	|			ТОГДА СделкаСвязьУчетныхЕдиниц.Калькуляция.ЦФО
	|		ИНАЧЕ АкцептУслуги.Сделка.ЦФО
	|	КОНЕЦ КАК ЦФО,
	//Евросиб Каблов 05.09.2024 )
	|	АкцептУслуги.Сделка КАК Сделка,
	|	СделкаРасходы.СтрокаСвязьУчетныхЕдиниц КАК ИдентификаторСУЕ,
	//Евросиб Каблов 14.10.2025 ( #107942
	|	АкцептУслуги.ИдентификаторСтрокиРасходовВСделке КАК СтрокаРасходовСделки,
	|	АкцептУслуги.ПериодУУ КАК ПериодУУ,
	//Евросиб Каблов 14.10.2025 ) #107942
	|	АкцептУслуги.Ссылка.Поступление.Контрагент КАК Поставщик,
	|	АкцептУслуги.Ссылка.Поступление.ДоговорКонтрагента КАК Договор,
	|	АкцептУслуги.НоменклатураСделки КАК Услуга,
	|	АкцептУслуги.Номенклатура КАК УслугаФакт,
	|	ЕСТЬNULL(СделкаРасходы.Вагон, АкцептУслуги.Вагон) КАК Вагон,
	|	ЕСТЬNULL(СделкаРасходы.Контейнер, АкцептУслуги.Контейнер) КАК Контейнер,
	|	АкцептУслуги.Сумма КАК Сумма,
	|	АкцептУслуги.СуммаНДС КАК СуммаНДС,
	|	АкцептУслуги.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	АкцептУслуги.ПоступлениеСтавкаНДС КАК СтавкаНДС,
	|	Поступление.ВалютаДокумента КАК Валюта,
	|	Поступление.КурсВалюты КАК КурсВалюты,
	|	Поступление.КратностьВалюты КАК КратностьВалюты,
	|	Поступление.ДатаВходящегоДокумента КАК ДатаКурсаВалюты,
	|	ВЫРАЗИТЬ(АкцептУслуги.Сумма * Поступление.КурсВалюты / Поступление.КратностьВалюты КАК ЧИСЛО(15, 2)) КАК СуммаРуб,
	|	ВЫРАЗИТЬ(АкцептУслуги.СуммаНДС * Поступление.КурсВалюты / Поступление.КратностьВалюты КАК ЧИСЛО(15, 2)) КАК СуммаНДСРуб,
	|	Поступление.ПТУ КАК Поступление,
	|	ВЫБОР
	|		КОГДА АкцептУслуги.ВидЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыЗатрат.КосвенныеЗатраты)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидОперацииРасходов.СобственныеЗатраты)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидОперацииРасходов.ПрямыеРасходы)
	|	КОНЕЦ КАК ВидОперации,
	|	АкцептУслуги.ВидРасходов КАК ТипОперации,
	|	ЕСТЬNULL(АкцептУслуги.УчДокумент.Контрагент, СделкаСвязьУчетныхЕдиниц.Клиент) КАК Клиент,
	|	ЕСТЬNULL(АкцептУслуги.УчДокумент.ДоговорКонтрагента, СделкаСвязьУчетныхЕдиниц.Договор) КАК ДоговорКлиента,
	|	АкцептУслуги.УчДокумент КАК Реализация
	|ИЗ
	|	Документ.Акцепт.Услуги КАК АкцептУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|			ПО СделкаРасходы.СтрокаСвязьУчетныхЕдиниц = СделкаСвязьУчетныхЕдиниц.ГУИД
	|				И СделкаРасходы.Ссылка = СделкаСвязьУчетныхЕдиниц.Ссылка
	|				И (НЕ СделкаСвязьУчетныхЕдиниц.НеАктивна)
	//Евросиб Каблов 05.09.2024 ( Ticket#0355763
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
	|			ПО СделкаСвязьДоходовИРасходов.Ссылка = СделкаДоходы.Ссылка
	|				И СделкаСвязьДоходовИРасходов.Доходы = СделкаДоходы.ГУИД
	|		ПО СделкаРасходы.Ссылка = СделкаСвязьДоходовИРасходов.Ссылка
	|			И СделкаРасходы.ГУИД = СделкаСвязьДоходовИРасходов.Расходы
	//Евросиб Каблов 05.09.2024 )
	|		ПО АкцептУслуги.Сделка = СделкаРасходы.Ссылка
	|			И АкцептУслуги.ИдентификаторСтрокиРасходовВСделке = СделкаРасходы.ГУИД,
	|	ПоступлениеТоваровУслуг КАК Поступление
	|ГДЕ
	|	АкцептУслуги.Ссылка = &Ссылка
	|	И НЕ АкцептУслуги.Сделка = ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)";
	
	ПодстрокаПоиска = 
	"ВЫБОР
	|		КОГДА АкцептУслуги.ВидЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыЗатрат.НезавершенноеПроизводство)
	|				ИЛИ НЕ ЕСТЬNULL(АкцептУслуги.УчДокумент.Проведен, ЛОЖЬ)
	|					И АкцептУслуги.ВидЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыЗатрат.КосвенныеЗатраты)
	|				ИЛИ АкцептУслуги.Сделка.Служебная
	|			ТОГДА ДАТАВРЕМЯ(3999, 1, 1)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА АкцептУслуги.Ссылка.ПериодВО >= НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(&ДокументПоступление КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента, МЕСЯЦ)
	|					ТОГДА АкцептУслуги.Ссылка.ПериодВО
	|				ИНАЧЕ НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(&ДокументПоступление КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента, МЕСЯЦ)
	|			КОНЕЦ
	|	КОНЕЦ";
	Если ВидУчета = "УУ" Тогда                                  
		ПодстрокаЗамены = 	
		"ВЫБОР
		|		КОГДА АкцептУслуги.ВидЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыЗатрат.НезавершенноеПроизводство)
		|				ИЛИ НЕ ЕСТЬNULL(АкцептУслуги.УчДокумент.Проведен, ЛОЖЬ)
		|					И АкцептУслуги.ВидЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыЗатрат.КосвенныеЗатраты)
		|				ИЛИ АкцептУслуги.Сделка.Служебная
		|			ТОГДА ДАТАВРЕМЯ(3999, 1, 1)
		|		КОГДА АкцептУслуги.ПериодУУ > АкцептУслуги.Ссылка.ПериодВО
		|			ТОГДА ВЫБОР
		|					КОГДА АкцептУслуги.Ссылка.ПериодВО >= НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(&ДокументПоступление КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента, МЕСЯЦ)
		|						ТОГДА АкцептУслуги.Ссылка.ПериодВО
		|					ИНАЧЕ НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(&ДокументПоступление КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента, МЕСЯЦ)
		|				КОНЕЦ
		|		КОГДА АкцептУслуги.ПериодУУ = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ВЫБОР
		|					КОГДА АкцептУслуги.ВидЗатрат = ЗНАЧЕНИЕ(перечисление.видыЗатрат.КосвенныеЗатраты)
		|						ТОГДА НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(&ДокументПоступление КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента, МЕСЯЦ)
		|					КОГДА АкцептУслуги.УчДокумент.Проведен
		|						ТОГДА АкцептУслуги.УчДокумент.ДатаОказанияУслуги
		|					ИНАЧЕ ДАТАВРЕМЯ(3999, 1, 1)
		|				КОНЕЦ
		|		ИНАЧЕ АкцептУслуги.ПериодУУ
		|	КОНЕЦ";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ПодстрокаПоиска, ПодстрокаЗамены);
	ИначеЕсли ВидУчета = "БУ" Тогда 
//Евросиб Гудкова( 18.02.2022 Ticket№ периоды акцепта могут быть меньше даты ВСФ. костыль для перепроведения прошлых периодов
//было		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ПодстрокаПоиска, "АкцептУслуги.Ссылка.ПериодБУ");	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ПодстрокаПоиска, "ВЫБОР
		|		КОГДА АкцептУслуги.Ссылка.ПериодБУ >= НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(&ДокументПоступление КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента, МЕСЯЦ)
		|			ТОГДА АкцептУслуги.Ссылка.ПериодБУ
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(&ДокументПоступление КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента, МЕСЯЦ)
		|	КОНЕЦ");
// Евросиб Гудкова)
	КонецЕсли;
	Возврат ТекстЗапроса;
КонецФункции

Процедура Акцепт_УстановитьПараметрыЗапросаРасходы(Запрос, ОбъектАкцепт)
	
	Запрос.УстановитьПараметр("Ссылка", ОбъектАкцепт.Ссылка);
	Если ТипЗнч(ОбъектАкцепт.Поступление) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
		Поступление = БухгалтерскийУчетПереопределяемый.ПолучитьИсправляемыйДокументПоступления(ОбъектАкцепт.Поступление, Истина);
	Иначе
		Поступление = ОбъектАкцепт.Поступление;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДокументПоступление", Поступление);
	
КонецПроцедуры

//Акцепт. Запрос плановых расходов.
Функция Акцепт_ПолучитьТекстЗапросаПлановыеРасходы(ВидУчета)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АкцептУслуги.Сделка КАК Сделка,
	|	АкцептУслуги.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке,
	|	ВЫБОР
	|		КОГДА АкцептУслуги.ВидЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыЗатрат.НезавершенноеПроизводство)
	|				ИЛИ НЕ ЕСТЬNULL(АкцептУслуги.УчДокумент.Проведен, ЛОЖЬ)
	|					И АкцептУслуги.ВидЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыЗатрат.КосвенныеЗатраты)
	|				ИЛИ АкцептУслуги.Сделка.Служебная
	|			ТОГДА ДАТАВРЕМЯ(3999, 1, 1)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА АкцептУслуги.Ссылка.ПериодВО >= НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(&ДокументПоступление КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента, МЕСЯЦ)
	|					ТОГДА АкцептУслуги.Ссылка.ПериодВО
	|				ИНАЧЕ НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(&ДокументПоступление КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента, МЕСЯЦ)
	|			КОНЕЦ
	|	КОНЕЦ КАК Период,
	|	МАКСИМУМ(АкцептУслуги.ПолностьюРазнесено) КАК ПолностьюРазнесено,
	|	СУММА(АкцептУслуги.Сумма) КАК Сумма,
	|	СУММА(АкцептУслуги.СуммаНДС) КАК СуммаНДС,
	|	АкцептУслуги.Ссылка.Поступление.ВалютаДокумента КАК АкцептВалюта
	|ПОМЕСТИТЬ ВТ_УслугиАкцепт
	|ИЗ
	|	Документ.Акцепт.Услуги КАК АкцептУслуги
	|ГДЕ
	|	АкцептУслуги.Ссылка = &Ссылка
	|	И НЕ АкцептУслуги.Сделка = ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	АкцептУслуги.Сделка,
	|	АкцептУслуги.ИдентификаторСтрокиРасходовВСделке,
	|	ВЫБОР
	|		КОГДА АкцептУслуги.ВидЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыЗатрат.НезавершенноеПроизводство)
	|				ИЛИ НЕ ЕСТЬNULL(АкцептУслуги.УчДокумент.Проведен, ЛОЖЬ)
	|					И АкцептУслуги.ВидЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыЗатрат.КосвенныеЗатраты)
	|				ИЛИ АкцептУслуги.Сделка.Служебная
	|			ТОГДА ДАТАВРЕМЯ(3999, 1, 1)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА АкцептУслуги.Ссылка.ПериодВО >= НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(&ДокументПоступление КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента, МЕСЯЦ)
	|					ТОГДА АкцептУслуги.Ссылка.ПериодВО
	|				ИНАЧЕ НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(&ДокументПоступление КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента, МЕСЯЦ)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	АкцептУслуги.Ссылка.Поступление.ВалютаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВТ_УслугиАкцепт.Период КАК Период,
	|	ПлановыеРасходыОстатки.Организация КАК Организация,
	|	ПлановыеРасходыОстатки.Сделка КАК Сделка,
	|	ПлановыеРасходыОстатки.ЦФО КАК ЦФО,
	|	ПлановыеРасходыОстатки.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ПлановыеРасходыОстатки.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	|	ПлановыеРасходыОстатки.Поставщик КАК Поставщик,
	|	ПлановыеРасходыОстатки.Договор КАК Договор,
	|	ПлановыеРасходыОстатки.Услуга КАК Услуга,
	|	ПлановыеРасходыОстатки.Вагон КАК Вагон,
	|	ПлановыеРасходыОстатки.Контейнер КАК Контейнер,
	|	ПлановыеРасходыОстатки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ПлановыеРасходыОстатки.ВидОперации КАК ВидОперации,
	|	ПлановыеРасходыОстатки.ТипОперации КАК ТипОперации,
	|	ПлановыеРасходыОстатки.СтавкаНДС КАК СтавкаНДС,
	|	ПлановыеРасходыОстатки.Валюта КАК Валюта,
	|	ПлановыеРасходыОстатки.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	ПлановыеРасходыОстатки.Клиент КАК Клиент,
	|	ПлановыеРасходыОстатки.ДоговорКлиента КАК ДоговорКлиента,
	|	ПлановыеРасходыОстатки.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ПлановыеРасходыОстатки.Реализация КАК Реализация,
	|	ВТ_УслугиАкцепт.Сумма КАК Сумма,
	|	ВТ_УслугиАкцепт.СуммаНДС КАК СуммаНДС,
	|	ПлановыеРасходыОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток,
	|	ПлановыеРасходыОстатки.СуммаРубОстаток КАК СуммаРубОстаток,
	|	ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаНДСРубОстаток,
	|	ВТ_УслугиАкцепт.АкцептВалюта КАК АкцептВалюта,
	|	ВТ_УслугиАкцепт.ПолностьюРазнесено КАК ПолностьюРазнесено
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ВТ_УслугиАкцепт КАК ВТ_УслугиАкцепт
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПлановыеРасходыВО.Остатки(
	//Евросиб - АСуслов 06.02.2026 11:46:20 #
	//( добавил отбор в параметры вирт. таблицы
	|				,
	|				(ИдентификаторСтрокиРасходов, Сделка) В
	|					(ВЫБРАТЬ
	|						т.ИдентификаторСтрокиРасходовВСделке,
	|						т.Сделка
	|					ИЗ
	|						ВТ_УслугиАкцепт КАК т)) КАК ПлановыеРасходыОстатки
	//)
	//Евросиб - АСуслов 06.02.2026 11:46:22 #
	|		ПО ВТ_УслугиАкцепт.ИдентификаторСтрокиРасходовВСделке = ПлановыеРасходыОстатки.ИдентификаторСтрокиРасходов
	|			И ВТ_УслугиАкцепт.Сделка = ПлановыеРасходыОстатки.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ВидДвижения КАК ВидДвижения,
	|	НАЧАЛОПЕРИОДА(ВТ.Период, МЕСЯЦ) КАК Период,
	|	ВТ.Организация КАК Организация,
	|	ВТ.Сделка КАК Сделка,
	|	ВТ.ЦФО КАК ЦФО,
	|	ВТ.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ВТ.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	|	ВТ.Поставщик КАК Поставщик,
	|	ВТ.Договор КАК Договор,
	|	ВТ.Услуга КАК Услуга,
	|	ВТ.Вагон КАК Вагон,
	|	ВТ.Контейнер КАК Контейнер,
	|	ВТ.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ВТ.ВидОперации КАК ВидОперации,
	|	ВТ.ТипОперации КАК ТипОперации,
	|	ВТ.СтавкаНДС КАК СтавкаНДС,
	|	ВТ.Валюта КАК Валюта,
	|	ВТ.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	ВТ.Клиент КАК Клиент,
	|	ВТ.ДоговорКлиента КАК ДоговорКлиента,
	|	ВТ.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ВТ.Реализация КАК Реализация,
	|	ВТ.АкцептВалюта КАК АкцептВалюта,
	|	ВЫБОР
	|		КОГДА ВТ.ПолностьюРазнесено
	|			ТОГДА ВТ.СуммаОстаток
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ.Валюта <> ВТ.АкцептВалюта
	|					ТОГДА ВЫБОР
	|							КОГДА ВТ.СуммаОстаток > (ВЫРАЗИТЬ(ВТ.Сумма * ЕСТЬNULL(КурсыВалютАкцепт.Курс, 1) * ЕСТЬNULL(КурсыВалютПлан.Кратность, 1) / (ЕСТЬNULL(КурсыВалютПлан.Курс, 1) * ЕСТЬNULL(КурсыВалютАкцепт.Кратность, 1)) КАК ЧИСЛО(15, 2)))
	|								ТОГДА ВЫРАЗИТЬ(ВТ.Сумма * ЕСТЬNULL(КурсыВалютАкцепт.Курс, 1) * ЕСТЬNULL(КурсыВалютПлан.Кратность, 1) / (ЕСТЬNULL(КурсыВалютПлан.Курс, 1) * ЕСТЬNULL(КурсыВалютАкцепт.Кратность, 1)) КАК ЧИСЛО(15, 2))
	|							ИНАЧЕ ВТ.СуммаОстаток
	|						КОНЕЦ
	|				КОГДА ВТ.СуммаОстаток > ВТ.Сумма
	|					ТОГДА ВТ.Сумма
	|				ИНАЧЕ ВТ.СуммаОстаток
	|			КОНЕЦ
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ВТ.ПолностьюРазнесено
	|			ТОГДА ВТ.СуммаНДСОстаток
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ.Валюта <> ВТ.АкцептВалюта
	|					ТОГДА ВЫБОР
	|							КОГДА ВТ.СуммаНДСОстаток > (ВЫРАЗИТЬ(ВТ.СуммаНДС * ЕСТЬNULL(КурсыВалютАкцепт.Курс, 1) * ЕСТЬNULL(КурсыВалютПлан.Кратность, 1) / (ЕСТЬNULL(КурсыВалютПлан.Курс, 1) * ЕСТЬNULL(КурсыВалютАкцепт.Кратность, 1)) КАК ЧИСЛО(15, 2)))
	|								ТОГДА ВЫРАЗИТЬ(ВТ.СуммаНДС * ЕСТЬNULL(КурсыВалютАкцепт.Курс, 1) * ЕСТЬNULL(КурсыВалютПлан.Кратность, 1) / (ЕСТЬNULL(КурсыВалютПлан.Курс, 1) * ЕСТЬNULL(КурсыВалютАкцепт.Кратность, 1)) КАК ЧИСЛО(15, 2))
	|							ИНАЧЕ ВТ.СуммаНДСОстаток
	|						КОНЕЦ
	|				КОГДА ВТ.СуммаНДСОстаток > ВТ.СуммаНДС
	|					ТОГДА ВТ.СуммаНДС
	|				ИНАЧЕ ВТ.СуммаНДСОстаток
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ВТ.ПолностьюРазнесено
	|			ТОГДА ВТ.СуммаРубОстаток
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ.СуммаРубОстаток > (ВЫРАЗИТЬ(ВТ.Сумма * ЕСТЬNULL(КурсыВалютАкцепт.Курс, 1) / ЕСТЬNULL(КурсыВалютАкцепт.Кратность, 1) КАК ЧИСЛО(15, 2)))
	|					ТОГДА ВЫРАЗИТЬ(ВТ.Сумма * ЕСТЬNULL(КурсыВалютАкцепт.Курс, 1) / ЕСТЬNULL(КурсыВалютАкцепт.Кратность, 1) КАК ЧИСЛО(15, 2))
	|				ИНАЧЕ ВТ.СуммаРубОстаток
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаРуб,
	|	ВЫБОР
	|		КОГДА ВТ.ПолностьюРазнесено
	|			ТОГДА ВТ.СуммаНДСРубОстаток
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ.СуммаНДСРубОстаток > (ВЫРАЗИТЬ(ВТ.СуммаНДС * ЕСТЬNULL(КурсыВалютАкцепт.Курс, 1) / ЕСТЬNULL(КурсыВалютАкцепт.Кратность, 1) КАК ЧИСЛО(15, 2)))
	|					ТОГДА ВЫРАЗИТЬ(ВТ.СуммаНДС * ЕСТЬNULL(КурсыВалютАкцепт.Курс, 1) / ЕСТЬNULL(КурсыВалютАкцепт.Кратность, 1) КАК ЧИСЛО(15, 2))
	|				ИНАЧЕ ВТ.СуммаНДСРубОстаток
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаНДСРуб
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютПлан
	|		ПО ВТ.Валюта = КурсыВалютПлан.Валюта
	|			И ВТ.ДатаКурсаВалюты = КурсыВалютПлан.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютАкцепт
	|		ПО ВТ.АкцептВалюта = КурсыВалютАкцепт.Валюта
	|			И ВТ.ДатаКурсаВалюты = КурсыВалютАкцепт.Период";
	
	Если ВидУчета = "УУ" Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПлановыеРасходыВО", "ПлановыеРасходыУУ");

		ПодстрокаПоиска = 
		"ВЫБОР
		|		КОГДА АкцептУслуги.ВидЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыЗатрат.НезавершенноеПроизводство)
		|				ИЛИ НЕ ЕСТЬNULL(АкцептУслуги.УчДокумент.Проведен, ЛОЖЬ)
		|					И АкцептУслуги.ВидЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыЗатрат.КосвенныеЗатраты)
		|				ИЛИ АкцептУслуги.Сделка.Служебная
		|			ТОГДА ДАТАВРЕМЯ(3999, 1, 1)
		|		ИНАЧЕ ВЫБОР
		|				КОГДА АкцептУслуги.Ссылка.ПериодВО >= НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(&ДокументПоступление КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента, МЕСЯЦ)
		|					ТОГДА АкцептУслуги.Ссылка.ПериодВО
		|				ИНАЧЕ НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(&ДокументПоступление КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента, МЕСЯЦ)

		|			КОНЕЦ
		|	КОНЕЦ";
		              
		ПодстрокаЗамены = 	
		"ВЫБОР
		|		КОГДА АкцептУслуги.ВидЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыЗатрат.НезавершенноеПроизводство)
		|				ИЛИ НЕ ЕСТЬNULL(АкцептУслуги.УчДокумент.Проведен, ЛОЖЬ)
		|					И АкцептУслуги.ВидЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыЗатрат.КосвенныеЗатраты)
		|				ИЛИ АкцептУслуги.Сделка.Служебная
		|			ТОГДА ДАТАВРЕМЯ(3999, 1, 1)
		|		КОГДА АкцептУслуги.ПериодУУ > АкцептУслуги.Ссылка.ПериодВО
		|			ТОГДА ВЫБОР
		|					КОГДА АкцептУслуги.Ссылка.ПериодВО >= НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(&ДокументПоступление КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента, МЕСЯЦ)
		|						ТОГДА АкцептУслуги.Ссылка.ПериодВО
		|					ИНАЧЕ НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(&ДокументПоступление КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента, МЕСЯЦ)
		|				КОНЕЦ
		|		КОГДА АкцептУслуги.ПериодУУ = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ВЫБОР
		|					КОГДА АкцептУслуги.ВидЗатрат = ЗНАЧЕНИЕ(перечисление.видыЗатрат.КосвенныеЗатраты)
		|						ТОГДА НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(&ДокументПоступление КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента, МЕСЯЦ)
		|					КОГДА АкцептУслуги.УчДокумент.Проведен
		|						ТОГДА АкцептУслуги.УчДокумент.ДатаОказанияУслуги
		|					ИНАЧЕ ДАТАВРЕМЯ(3999, 1, 1)
		|				КОНЕЦ
		|		ИНАЧЕ АкцептУслуги.ПериодУУ
		|	КОНЕЦ";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ПодстрокаПоиска, ПодстрокаЗамены);
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
		
КонецФункции

//Евросиб - АСуслов 17.08.2022 15:55:19 #55129
//(
Процедура Акцепт_СформироватьДвиженияРазнесениеРасходов(ОбъектАкцепт, Отказ) Экспорт
	
	ОбъектАкцепт.Движения.РазнесениеРасходов.Записывать = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	АкцептУслуги.Ссылка КАК Регистратор,
	|	АкцептУслуги.Ссылка.Дата КАК Период,
	|	АкцептУслуги.Сделка КАК Сделка,
	|	АкцептУслуги.ИдентификаторСтрокиРасходовВСделке КАК ГУИДРасходов,
	|	ВЫБОР
	|		КОГДА АкцептУслуги.ПолностьюРазнесено
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НеРазнесено
	|ИЗ
	|	Документ.Акцепт.Услуги КАК АкцептУслуги
	|ГДЕ
	|	АкцептУслуги.Ссылка = &Ссылка
	|	И НЕ АкцептУслуги.Сделка = Значение(Документ.Сделка.ПустаяСсылка)
	|	И НЕ АкцептУслуги.ИдентификаторСтрокиРасходовВСделке = """"";
	Запрос.УстановитьПараметр("Ссылка", ОбъектАкцепт.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;  
	ОбъектАкцепт.Движения.РазнесениеРасходов.Загрузить(РезультатЗапроса.Выгрузить()); 
	Если ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("КонтролироватьОтрицательныеОстаткиРегистраРазнесениеРасходов") Тогда
		ОбъектАкцепт.Движения.РазнесениеРасходов.Записать();
		//проверим остаток привязок
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АкцептУслуги.Сделка КАК Сделка,
		|	АкцептУслуги.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке,
		|	АкцептУслуги.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_Услуги
		|ИЗ
		|	Документ.Акцепт.Услуги КАК АкцептУслуги
		|ГДЕ
		|	НЕ АкцептУслуги.Сделка = ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РазнесениеРасходовОстатки.Сделка КАК Сделка,
		|	РазнесениеРасходовОстатки.ГУИДРасходов КАК ГУИДРасходов,
		|	ВТ_Услуги.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	РегистрНакопления.РазнесениеРасходов.Остатки(
		|			,
		|			(Сделка, ГУИДРасходов) В
		|				(ВЫБРАТЬ
		|					т.Сделка,
		|					т.ИдентификаторСтрокиРасходовВСделке
		|				ИЗ
		|					ВТ_Услуги КАК т)) КАК РазнесениеРасходовОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Услуги КАК ВТ_Услуги
		|		ПО РазнесениеРасходовОстатки.ГУИДРасходов = ВТ_Услуги.ИдентификаторСтрокиРасходовВСделке
		|			И РазнесениеРасходовОстатки.Сделка = ВТ_Услуги.Сделка
		|ГДЕ
		|	РазнесениеРасходовОстатки.НеРазнесеноОстаток < 0";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Акцепт.Услуги", "&АкцептУслуги");
		Запрос.УстановитьПараметр("АкцептУслуги", ОбъектАкцепт.Услуги.Выгрузить());
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Возврат;
		КонецЕсли;  
		ВыборкаРезультата = РезультатЗапроса.Выбрать();
		Пока ВыборкаРезультата.Следующий() Цикл   
			ТекстСообщения = СтрШаблон("По строке %1 нет остатка для разнесения: %2; %3", ВыборкаРезультата.НомерСтроки, ВыборкаРезультата.Сделка, ВыборкаРезультата.ГУИДРасходов); 
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

//Процедура Акцепт_СформироватьДвиженияРазнесениеАкцептовВСделки(ОбъектАкцепт) Экспорт
//	
//	ОбъектАкцепт.Движения.РазнесениеАкцептовВСделки.Записывать = Истина;
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	АкцептУслуги.Ссылка КАК Регистратор,
//	|	АкцептУслуги.Ссылка.Дата КАК Период,
//	|	АкцептУслуги.Сделка КАК Сделка,
//	|	АкцептУслуги.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходов,
//	|	АкцептУслуги.ИдентификаторСтрокиПоступления КАК ИдентификаторСтрокиПоступления,
//	|	ВЫБОР
//	|		КОГДА АкцептУслуги.ПодтвержденнаяСумма = 0
//	|			ТОГДА АкцептУслуги.ПоступлениеСумма
//	|		ИНАЧЕ АкцептУслуги.ПодтвержденнаяСумма
//	|	КОНЕЦ КАК Сумма
//	|ИЗ
//	|	Документ.Акцепт.Услуги КАК АкцептУслуги
//	|ГДЕ
//	|	АкцептУслуги.Ссылка = &Ссылка
//	|	И НЕ АкцептУслуги.Сделка = ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
//	|	И НЕ АкцептУслуги.ИдентификаторСтрокиРасходовВСделке = """"";
//	Запрос.УстановитьПараметр("Ссылка", ОбъектАкцепт.Ссылка);
//	РезультатЗапроса = Запрос.Выполнить();
//	Если РезультатЗапроса.Пустой() Тогда
//		Возврат;
//	КонецЕсли;  
//	ОбъектАкцепт.Движения.РазнесениеАкцептовВСделки.Загрузить(РезультатЗапроса.Выгрузить());
//	
//КонецПроцедуры

//)
//Евросиб - АСуслов 17.08.2022 15:55:23 #55129

//Евросиб - АСуслов 12.10.2023 11:30:47 #
//(
Процедура Акцепт_СформироватьДвиженияАктуальныеПривязкиАкцептовВСделки(ОбъектАкцепт) Экспорт
	 	
	//АктуальныйАкцепт = Документы.Акцепт.ПолучитьАктуальныйАкцепт(ОбъектАкцепт.Поступление);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АктуальныеАкцептыСрезПоследних.Акцепт КАК Акцепт
	|ИЗ
	|	РегистрСведений.АктуальныеАкцепты.СрезПоследних(, Поступление = &Поступление) КАК АктуальныеАкцептыСрезПоследних
	|ГДЕ
	|	НЕ АктуальныеАкцептыСрезПоследних.Акцепт = Значение(Документ.Акцепт.ПустаяСсылка)
	|";
	Запрос.УстановитьПараметр("Поступление", ОбъектАкцепт.Поступление);
	АктуальныйАкцепт = Неопределено;
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		АктуальныйАкцепт = РезультатЗапроса.Выгрузить()[0].Акцепт;
	КонецЕсли;
	//Если ЗначениеЗаполнено(ОбъектАкцепт.СторнируемыйАкцепт)
	//	И АктуальныйАкцепт = Неопределено Тогда
	Если АктуальныйАкцепт = Неопределено 
		ИЛИ (ЗначениеЗаполнено(ОбъектАкцепт.СторнируемыйАкцепт) 
			И АктуальныйАкцепт = ОбъектАкцепт.СторнируемыйАкцепт
			И ОбъектАкцепт.Проведен) Тогда
		НЗ = РегистрыСведений.АктуальныеПривязкиАкцептовВСделки.СоздатьНаборЗаписей();
		НЗ.Отбор.Поступление.Установить(ОбъектАкцепт.Поступление);
		НЗ.Записать();
	//	Возврат;
	//КонецЕсли;  
	//Если ОбъектАкцепт.Ссылка = АктуальныйАкцепт Тогда
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АкцептУслуги.Ссылка.Поступление КАК Поступление,
		|	АкцептУслуги.Ссылка.Ссылка КАК Акцепт,
		|	АкцептУслуги.Сделка КАК Сделка,
		|	АкцептУслуги.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке,
		|	АкцептУслуги.ГУИД КАК ИдентификаторСтрокиАкцепта,
		|	1 КАК Расхождение
		|ПОМЕСТИТЬ ВТ_ДанныеАкцепта
		|ИЗ
		|	Документ.Акцепт.Услуги КАК АкцептУслуги
		|ГДЕ
		|	АкцептУслуги.Ссылка = &Ссылка
		|	И НЕ АкцептУслуги.Сделка = ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеАкцепта.Поступление КАК Поступление,
		|	ВТ_ДанныеАкцепта.Акцепт КАК Акцепт,
		|	ВТ_ДанныеАкцепта.Сделка КАК Сделка,
		|	ВТ_ДанныеАкцепта.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке,
		|	ВТ_ДанныеАкцепта.ИдентификаторСтрокиАкцепта КАК ИдентификаторСтрокиАкцепта,
		|	ВТ_ДанныеАкцепта.Расхождение КАК Расхождение
		|ПОМЕСТИТЬ ВТ_Расхождение
		|ИЗ
		|	ВТ_ДанныеАкцепта КАК ВТ_ДанныеАкцепта
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АктуальныеПривязкиАкцептовВСделки.Поступление,
		|	АктуальныеПривязкиАкцептовВСделки.Акцепт,
		|	АктуальныеПривязкиАкцептовВСделки.Сделка,
		|	АктуальныеПривязкиАкцептовВСделки.ИдентификаторСтрокиРасходовВСделке,
		|	АктуальныеПривязкиАкцептовВСделки.ИдентификаторСтрокиАкцепта,
		|	-1
		|ИЗ
		|	РегистрСведений.АктуальныеПривязкиАкцептовВСделки КАК АктуальныеПривязкиАкцептовВСделки
		|ГДЕ
		|	АктуальныеПривязкиАкцептовВСделки.Акцепт = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Расхождение.Поступление КАК Поступление,
		|	ВТ_Расхождение.Акцепт КАК Акцепт,
		|	ВТ_Расхождение.Сделка КАК Сделка,
		|	ВТ_Расхождение.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке,
		|	ВТ_Расхождение.ИдентификаторСтрокиАкцепта КАК ИдентификаторСтрокиАкцепта,
		|	СУММА(ВТ_Расхождение.Расхождение) КАК Расхождение
		|ИЗ
		|	ВТ_Расхождение КАК ВТ_Расхождение
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Расхождение.Поступление,
		|	ВТ_Расхождение.Акцепт,
		|	ВТ_Расхождение.Сделка,
		|	ВТ_Расхождение.ИдентификаторСтрокиРасходовВСделке,
		|	ВТ_Расхождение.ИдентификаторСтрокиАкцепта
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВТ_Расхождение.Расхождение) <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеАкцепта.Поступление КАК Поступление,
		|	ВТ_ДанныеАкцепта.Акцепт КАК Акцепт,
		|	ВТ_ДанныеАкцепта.Сделка КАК Сделка,
		|	ВТ_ДанныеАкцепта.ИдентификаторСтрокиРасходовВСделке КАК ИдентификаторСтрокиРасходовВСделке,
		|	ВТ_ДанныеАкцепта.ИдентификаторСтрокиАкцепта КАК ИдентификаторСтрокиАкцепта,
		|	ВТ_ДанныеАкцепта.Расхождение КАК Расхождение
		|ИЗ
		|	ВТ_ДанныеАкцепта КАК ВТ_ДанныеАкцепта";
		Запрос.УстановитьПараметр("Ссылка", АктуальныйАкцепт);
		МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
		Если МассивРезультатовЗапроса[2].Пустой() Тогда
			Возврат;
		КонецЕсли;
		НЗ = РегистрыСведений.АктуальныеПривязкиАкцептовВСделки.СоздатьНаборЗаписей();
		НЗ.Отбор.Поступление.Установить(ОбъектАкцепт.Поступление);
		НЗ.Загрузить(МассивРезультатовЗапроса[3].Выгрузить());
		НЗ.Записать();
	КонецЕсли;
	
КонецПроцедуры
//)
//Евросиб - АСуслов 12.10.2023 11:30:48 #

//Евросиб Каблов 07.09.2022 US49022
Процедура Акцепт_СформироватьДвиженияНеурегулированныеРасходы(ОбъектАкцепт) Экспорт

	НеурегулированныеРасходы = ОбъектАкцепт.Движения.НеурегулированныеРасходы;
	НеурегулированныеРасходы.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Поступление КАК Поступление,
	|	АкцептУслуги.ГУИД КАК ИдентификаторСтрокиАкцепта,
	|	АкцептУслуги.ПоступлениеСумма КАК Сумма,
	|	АкцептУслуги.ПоступлениеСуммаНДС КАК СуммаНДС,
	|	АкцептУслуги.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ НеурегулированныеРасходыАкцепта
	|ИЗ
	|	Документ.Акцепт.Услуги КАК АкцептУслуги
	|ГДЕ
	|	АкцептУслуги.Ссылка = &Ссылка
	|	И АкцептУслуги.Сделка = ЗНАЧЕНИЕ(Документ.Сделка.ПустаяСсылка)
	|	И АкцептУслуги.ПричинаНеакцепта = ЗНАЧЕНИЕ(Справочник.Претензии.ПустаяСсылка)
	|	И АкцептУслуги.СуммаПретензии = 0
	|	И НЕ АкцептУслуги.ВыгруженаВРИТМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НеурегулированныеРасходыАкцепта.Период КАК Период,
	|	НеурегулированныеРасходыАкцепта.ВидДвижения КАК ВидДвижения,
	|	НеурегулированныеРасходыАкцепта.Поступление КАК Поступление,
	|	НеурегулированныеРасходыАкцепта.ИдентификаторСтрокиАкцепта КАК ИдентификаторСтрокиАкцепта,
	|	НеурегулированныеРасходыАкцепта.Сумма КАК Сумма,
	|	НеурегулированныеРасходыАкцепта.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	НеурегулированныеРасходыАкцепта КАК НеурегулированныеРасходыАкцепта
	|
	|УПОРЯДОЧИТЬ ПО
	|	НеурегулированныеРасходыАкцепта.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДиалогиЗаголовки.ГУИДТемы КАК ГУИДТемы
	|ИЗ
	|	РегистрСведений.ДиалогиПричиныНеурегулированныхРасходов КАК ДиалогиПричиныНеурегулированныхРасходов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДиалогиЗаголовки КАК ДиалогиЗаголовки
	|		ПО ДиалогиПричиныНеурегулированныхРасходов.ГУИДТемы = ДиалогиЗаголовки.ГУИДТемы
	|		ЛЕВОЕ СОЕДИНЕНИЕ НеурегулированныеРасходыАкцепта КАК НеурегулированныеРасходыАкцепта
	|		ПО ДиалогиПричиныНеурегулированныхРасходов.ИдентификаторСтрокиАкцепта = НеурегулированныеРасходыАкцепта.ИдентификаторСтрокиАкцепта
	|ГДЕ
	|	ДиалогиПричиныНеурегулированныхРасходов.Поступление = &Поступление
	|	И НЕ ДиалогиЗаголовки.ВопросЗакрыт
	|	И НеурегулированныеРасходыАкцепта.НомерСтроки ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Ссылка", ОбъектАкцепт.Ссылка);
	Запрос.УстановитьПараметр("ОтработкаВРИТМ", Справочники.ПричиныНеурегулированныхРасходов.ОтработкаВРИТМ);
	Запрос.УстановитьПараметр("Период", ОбъектАкцепт.Дата);
	Запрос.УстановитьПараметр("Поступление", ОбъектАкцепт.Поступление);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	НеурегРасходыАкцепта = РезультатыЗапроса[1].Выгрузить();
	НеурегулированныеРасходы.Загрузить(НеурегРасходыАкцепта);
	
	ДиалогиКЗакрытию = РезультатыЗапроса[2].Выбрать();
	
	Пока ДиалогиКЗакрытию.Следующий() Цикл
		
		Запись = РегистрыСведений.ДиалогиЗаголовки.СоздатьМенеджерЗаписи();
		Запись.ГУИДТемы = ДиалогиКЗакрытию.ГУИДТемы;
		
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Запись.ВопросЗакрыт = Истина;
			Запись.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗакрытиеПериода
Процедура ЗП_СформироватьДвиженияФиксацииИзменения(Объект) Экспорт
	ЗП_СформироватьДвиженияФиксацияИзмененияПлановыхРасходовВО(Объект);
	ЗП_СформироватьДвиженияЗакрытиеОстатковПлановыхРасходовВО(Объект);
КонецПроцедуры

Процедура ЗП_СформироватьДвиженияФиксацияИзмененияПлановыхРасходовВО(Объект)
	
	Объект.Движения.ФиксацияИзмененияПлановыхРасходовВО.Очистить();
	Объект.Движения.ФиксацияИзмененияПлановыхРасходовВО.Записать();
	Запрос = Новый Запрос;
	Запрос.Текст = ЗП_ПолучитьТекстЗапросаФиксацииИзменения("ПлановыеРасходыВО");
	ЗП_УстановитьПараметрыЗапросаФиксацииИзменений(Запрос, Объект);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	Объект.Движения.ФиксацияИзмененияПлановыхРасходовВО.Записывать = Истина;
	Объект.Движения.ФиксацияИзмененияПлановыхРасходовВО.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

#Область СтараяВерсияЗапроса
//Функция ПолучитьТекстЗапросаФиксацииИзменения(ТипДвижений)
//	ТекстЗапроса = 
//	"ВЫБРАТЬ
//	|	ВложенныйЗапрос.Организация КАК Организация,
//	|	ВложенныйЗапрос.Сделка КАК Сделка,
//	|	ВложенныйЗапрос.ЦФО КАК ЦФО,
//	|	ВложенныйЗапрос.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
//	|	ВложенныйЗапрос.Поставщик КАК Поставщик,
//	|	ВложенныйЗапрос.Договор КАК Договор,
//	|	ВложенныйЗапрос.Услуга КАК Услуга,
//	|	ВложенныйЗапрос.Вагон КАК Вагон,
//	|	ВложенныйЗапрос.Контейнер КАК Контейнер,
//	|	ВложенныйЗапрос.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
//	|	ВложенныйЗапрос.ВидОперации КАК ВидОперации,
//	|	ВложенныйЗапрос.ТипОперации КАК ТипОперации,
//	|	ВложенныйЗапрос.СтавкаНДС КАК СтавкаНДС,
//	|	ВложенныйЗапрос.Валюта КАК Валюта,
//	|	ВложенныйЗапрос.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
//	|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
//	|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС,
//	|	СУММА(ВложенныйЗапрос.СуммаРуб) КАК СуммаРуб,
//	|	СУММА(ВложенныйЗапрос.СуммаНДСРуб) КАК СуммаНДСРуб,
//	|	ВложенныйЗапрос.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН
//	|ПОМЕСТИТЬ ВТ_ИзменившиесяРасходы
//	|ИЗ
//	|	(ВЫБРАТЬ
//	|		ПлановыеРасходыОбороты.Организация КАК Организация,
//	|		ПлановыеРасходыОбороты.Сделка КАК Сделка,
//	|		ПлановыеРасходыОбороты.ЦФО КАК ЦФО,
//	|		ПлановыеРасходыОбороты.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
//	|		ПлановыеРасходыОбороты.Поставщик КАК Поставщик,
//	|		ПлановыеРасходыОбороты.Договор КАК Договор,
//	|		ПлановыеРасходыОбороты.Услуга КАК Услуга,
//	|		ПлановыеРасходыОбороты.Вагон КАК Вагон,
//	|		ПлановыеРасходыОбороты.Контейнер КАК Контейнер,
//	|		ПлановыеРасходыОбороты.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
//	|		ПлановыеРасходыОбороты.ВидОперации КАК ВидОперации,
//	|		ПлановыеРасходыОбороты.ТипОперации КАК ТипОперации,
//	|		ПлановыеРасходыОбороты.СтавкаНДС КАК СтавкаНДС,
//	|		ПлановыеРасходыОбороты.Валюта КАК Валюта,
//	|		ПлановыеРасходыОбороты.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
//	|		ПлановыеРасходыОбороты.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
//	|		ПлановыеРасходыОбороты.СуммаОборот КАК Сумма,
//	|		ПлановыеРасходыОбороты.СуммаНДСОборот КАК СуммаНДС,
//	|		ПлановыеРасходыОбороты.СуммаРубОборот КАК СуммаРуб,
//	|		ПлановыеРасходыОбороты.СуммаНДСРубОборот КАК СуммаНДСРуб
//	|	ИЗ
//	|		РегистрНакопления.ПлановыеРасходыВО.Обороты(, &КонецПериодаПлановыхРасходов, , ) КАК ПлановыеРасходыОбороты
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		ФиксацияИзмененияПлановыхРасходовОбороты.Организация,
//	|		ФиксацияИзмененияПлановыхРасходовОбороты.Сделка,
//	|		ФиксацияИзмененияПлановыхРасходовОбороты.ЦФО,
//	|		ФиксацияИзмененияПлановыхРасходовОбороты.ИдентификаторСУЕ,
//	|		ФиксацияИзмененияПлановыхРасходовОбороты.Поставщик,
//	|		ФиксацияИзмененияПлановыхРасходовОбороты.Договор,
//	|		ФиксацияИзмененияПлановыхРасходовОбороты.Услуга,
//	|		ФиксацияИзмененияПлановыхРасходовОбороты.Вагон,
//	|		ФиксацияИзмененияПлановыхРасходовОбороты.Контейнер,
//	|		ФиксацияИзмененияПлановыхРасходовОбороты.НоменклатурнаяГруппа,
//	|		ФиксацияИзмененияПлановыхРасходовОбороты.ВидОперации,
//	|		ФиксацияИзмененияПлановыхРасходовОбороты.ТипОперации,
//	|		ФиксацияИзмененияПлановыхРасходовОбороты.СтавкаНДС,
//	|		ФиксацияИзмененияПлановыхРасходовОбороты.Валюта,
//	|		ФиксацияИзмененияПлановыхРасходовОбороты.ИдентификаторСтрокиРасходов,
//	|		ФиксацияИзмененияПлановыхРасходовОбороты.ПлановыеРасходыПоЖДН,
//	|		-ФиксацияИзмененияПлановыхРасходовОбороты.СуммаОборот,
//	|		-ФиксацияИзмененияПлановыхРасходовОбороты.СуммаНДСОборот,
//	|		-ФиксацияИзмененияПлановыхРасходовОбороты.СуммаРубОборот,
//	|		-ФиксацияИзмененияПлановыхРасходовОбороты.СуммаНДСРубОборот
//	|	ИЗ
//	|		РегистрНакопления.ФиксацияИзмененияПлановыхРасходовВО.Обороты(, &КонецПериодаЗафиксированныхРасходов, , ) КАК ФиксацияИзмененияПлановыхРасходовОбороты) КАК ВложенныйЗапрос
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ВложенныйЗапрос.Сделка,
//	|	ВложенныйЗапрос.Услуга,
//	|	ВложенныйЗапрос.Вагон,
//	|	ВложенныйЗапрос.Контейнер,
//	|	ВложенныйЗапрос.Организация,
//	|	ВложенныйЗапрос.ЦФО,
//	|	ВложенныйЗапрос.ИдентификаторСУЕ,
//	|	ВложенныйЗапрос.Поставщик,
//	|	ВложенныйЗапрос.Договор,
//	|	ВложенныйЗапрос.НоменклатурнаяГруппа,
//	|	ВложенныйЗапрос.ВидОперации,
//	|	ВложенныйЗапрос.ТипОперации,
//	|	ВложенныйЗапрос.СтавкаНДС,
//	|	ВложенныйЗапрос.Валюта,
//	|	ВложенныйЗапрос.ИдентификаторСтрокиРасходов,
//	|	ВложенныйЗапрос.ПлановыеРасходыПоЖДН
//	|
//	|ИМЕЮЩИЕ
//	|	(СУММА(ВложенныйЗапрос.Сумма) <> 0
//	|		ИЛИ СУММА(ВложенныйЗапрос.СуммаНДС) <> 0
//	|		ИЛИ СУММА(ВложенныйЗапрос.СуммаРуб) <> 0
//	|		ИЛИ СУММА(ВложенныйЗапрос.СуммаНДСРуб) <> 0)
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Сделка,
//	|	ИдентификаторСУЕ,
//	|	ИдентификаторСтрокиРасходов
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	&ПериодФиксации КАК Период,
//	|	ФиксацияИзмененияПлановыхРасходовОбороты.Организация КАК Организация,
//	|	ФиксацияИзмененияПлановыхРасходовОбороты.Сделка КАК Сделка,
//	|	ФиксацияИзмененияПлановыхРасходовОбороты.ЦФО КАК ЦФО,
//	|	ФиксацияИзмененияПлановыхРасходовОбороты.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
//	|	ФиксацияИзмененияПлановыхРасходовОбороты.Поставщик КАК Поставщик,
//	|	ФиксацияИзмененияПлановыхРасходовОбороты.Договор КАК Договор,
//	|	ФиксацияИзмененияПлановыхРасходовОбороты.Услуга КАК Услуга,
//	|	ФиксацияИзмененияПлановыхРасходовОбороты.Вагон КАК Вагон,
//	|	ФиксацияИзмененияПлановыхРасходовОбороты.Контейнер КАК Контейнер,
//	|	ФиксацияИзмененияПлановыхРасходовОбороты.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
//	|	ФиксацияИзмененияПлановыхРасходовОбороты.ВидОперации КАК ВидОперации,
//	|	ФиксацияИзмененияПлановыхРасходовОбороты.ТипОперации КАК ТипОперации,
//	|	ФиксацияИзмененияПлановыхРасходовОбороты.СтавкаНДС КАК СтавкаНДС,
//	|	ФиксацияИзмененияПлановыхРасходовОбороты.Валюта КАК Валюта,
//	|	ФиксацияИзмененияПлановыхРасходовОбороты.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
//	|	ФиксацияИзмененияПлановыхРасходовОбороты.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
//	|	-ФиксацияИзмененияПлановыхРасходовОбороты.СуммаОборот КАК Сумма,
//	|	-ФиксацияИзмененияПлановыхРасходовОбороты.СуммаНДСОборот КАК СуммаНДС,
//	|	-ФиксацияИзмененияПлановыхРасходовОбороты.СуммаРубОборот КАК СуммаРуб,
//	|	-ФиксацияИзмененияПлановыхРасходовОбороты.СуммаНДСРубОборот КАК СуммаНДСРуб
//	|ИЗ
//	|	РегистрНакопления.ФиксацияИзмененияПлановыхРасходовВО.Обороты(
//	|			,
//	|			,
//	|			Запись,
//	|			(Сделка, ИдентификаторСУЕ, ИдентификаторСтрокиРасходов) В
//	|				(ВЫБРАТЬ
//	|					т.Сделка,
//	|					т.ИдентификаторСУЕ,
//	|					т.ИдентификаторСтрокиРасходов
//	|				ИЗ
//	|					ВТ_ИзменившиесяРасходы КАК т)) КАК ФиксацияИзмененияПлановыхРасходовОбороты
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	&ПериодФиксации,
//	|	ПлановыеРасходыОбороты.Организация,
//	|	ПлановыеРасходыОбороты.Сделка,
//	|	ПлановыеРасходыОбороты.ЦФО,
//	|	ПлановыеРасходыОбороты.ИдентификаторСУЕ,
//	|	ПлановыеРасходыОбороты.Поставщик,
//	|	ПлановыеРасходыОбороты.Договор,
//	|	ПлановыеРасходыОбороты.Услуга,
//	|	ПлановыеРасходыОбороты.Вагон,
//	|	ПлановыеРасходыОбороты.Контейнер,
//	|	ПлановыеРасходыОбороты.НоменклатурнаяГруппа,
//	|	ПлановыеРасходыОбороты.ВидОперации,
//	|	ПлановыеРасходыОбороты.ТипОперации,
//	|	ПлановыеРасходыОбороты.СтавкаНДС,
//	|	ПлановыеРасходыОбороты.Валюта,
//	|	ПлановыеРасходыОбороты.ИдентификаторСтрокиРасходов,
//	|	ПлановыеРасходыОбороты.ПлановыеРасходыПоЖДН,
//	|	ПлановыеРасходыОбороты.СуммаОборот,
//	|	ПлановыеРасходыОбороты.СуммаНДСОборот,
//	|	ПлановыеРасходыОбороты.СуммаРубОборот,
//	|	ПлановыеРасходыОбороты.СуммаНДСРубОборот
//	|ИЗ
//	|	РегистрНакопления.ПлановыеРасходыВО.Обороты(
//	|			,
//	|			&КонецПериодаПлановыхРасходов,
//	|			Запись,
//	|			(Сделка, ИдентификаторСУЕ, ИдентификаторСтрокиРасходов) В
//	|				(ВЫБРАТЬ
//	|					т.Сделка,
//	|					т.ИдентификаторСУЕ,
//	|					т.ИдентификаторСтрокиРасходов
//	|				ИЗ
//	|					ВТ_ИзменившиесяРасходы КАК т)) КАК ПлановыеРасходыОбороты";
//	Если ТипДвижений = "ПлановыеРасходыУУ" Тогда
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПлановыеРасходыВО", "ПлановыеРасходыУУ");
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ФиксацияИзмененияПлановыхРасходовВО", "ФиксацияИзмененияПлановыхРасходовУУ");
//	ИначеЕсли ТипДвижений = "ПлановыеДоходыВО" Тогда   
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПлановыеРасходыВО", "ПлановыеДоходыВО");
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПлановыеРасходыОбороты.ВидОперации", "Неопределено");
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПлановыеРасходыОбороты.ИдентификаторСтрокиРасходов", "Неопределено");
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПлановыеРасходыОбороты.ПлановыеРасходыПоЖДН", "Неопределено");
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ФиксацияИзмененияПлановыхРасходовВО", "ФиксацияИзмененияПлановыхДоходовВО");
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ФиксацияИзмененияПлановыхРасходовОбороты.ВидОперации", "Неопределено");
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ФиксацияИзмененияПлановыхРасходовОбороты.ИдентификаторСтрокиРасходов", "Неопределено");
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ФиксацияИзмененияПлановыхРасходовОбороты.ПлановыеРасходыПоЖДН", "Неопределено");
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Сделка, ИдентификаторСУЕ, ИдентификаторСтрокиРасходов", "Сделка, ИдентификаторСУЕ, ИдентификаторСУЕ");
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "т.ИдентификаторСтрокиРасходов", "т.ИдентификаторСУЕ");
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Поставщик", "Клиент");
//	КонецЕсли; 
//	Возврат ТекстЗапроса;
//		
//КонецФункции
#КонецОбласти

Функция ЗП_ПолучитьТекстЗапросаФиксацииИзменения(ТипДвижений)
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПлановыеРасходыВО.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	|	ИСТИНА КАК ЕстьСписание
	|ПОМЕСТИТЬ ВТ_СписанныеПлановыеРасходы
	|ИЗ
	|	РегистрНакопления.ПлановыеРасходыВО КАК ПлановыеРасходыВО
	|ГДЕ
	|	ПлановыеРасходыВО.Списание
	|	И ПлановыеРасходыВО.Период <= &КонецПериодаПлановыхРасходов
	|;
	//Евросиб Каблов 05.12.2023 ( #77692
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлановыеРасходыВО.Период КАК Период,
	|	ПлановыеРасходыВО.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	|	ПлановыеРасходыВО.Сделка КАК Сделка,
	|	ПлановыеРасходыВО.Организация КАК Организация,
	|	ПлановыеРасходыВО.ЦФО КАК ЦФО,
	|	ПлановыеРасходыВО.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ПлановыеРасходыВО.Поставщик КАК Поставщик,
	|	ПлановыеРасходыВО.Договор КАК Договор,
	|	ПлановыеРасходыВО.Услуга КАК Услуга,
	|	ПлановыеРасходыВО.Вагон КАК Вагон,
	|	ПлановыеРасходыВО.Контейнер КАК Контейнер,
	|	ПлановыеРасходыВО.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ПлановыеРасходыВО.ВидОперации КАК ВидОперации,
	|	ПлановыеРасходыВО.ТипОперации КАК ТипОперации,
	|	ПлановыеРасходыВО.СтавкаНДС КАК СтавкаНДС,
	|	ПлановыеРасходыВО.Валюта КАК Валюта,
	|	ПлановыеРасходыВО.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	ПлановыеРасходыВО.Клиент КАК Клиент,
	|	ПлановыеРасходыВО.ДоговорКлиента КАК ДоговорКлиента,
	|	ПлановыеРасходыВО.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ПлановыеРасходыВО.Реализация КАК Реализация,
	|	ПлановыеРасходыВО.Сумма КАК Сумма,
	|	ПлановыеРасходыВО.СуммаНДС КАК СуммаНДС,
	|	ПлановыеРасходыВО.СуммаРуб КАК СуммаРуб,
	|	ПлановыеРасходыВО.СуммаНДСРуб КАК СуммаНДСРуб
	|ПОМЕСТИТЬ СторноПлановыхРасходов
	|ИЗ
	|	РегистрНакопления.ПлановыеРасходыВО КАК ПлановыеРасходыВО
	|ГДЕ
	|	ПлановыеРасходыВО.Период МЕЖДУ &ПериодФиксации И &КонецПериодаПлановыхРасходов
	|	И ПлановыеРасходыВО.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СторноПлановыхРасходов.Период КАК Период,
	|	СторноПлановыхРасходов.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	|	СторноПлановыхРасходов.Сделка КАК Сделка,
	|	СторноПлановыхРасходов.Организация КАК Организация,
	|	СторноПлановыхРасходов.ЦФО КАК ЦФО,
	|	СторноПлановыхРасходов.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	СторноПлановыхРасходов.Поставщик КАК Поставщик,
	|	СторноПлановыхРасходов.Договор КАК Договор,
	|	СторноПлановыхРасходов.Услуга КАК Услуга,
	|	СторноПлановыхРасходов.Вагон КАК Вагон,
	|	СторноПлановыхРасходов.Контейнер КАК Контейнер,
	|	СторноПлановыхРасходов.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	СторноПлановыхРасходов.ВидОперации КАК ВидОперации,
	|	СторноПлановыхРасходов.ТипОперации КАК ТипОперации,
	|	СторноПлановыхРасходов.СтавкаНДС КАК СтавкаНДС,
	|	СторноПлановыхРасходов.Валюта КАК Валюта,
	|	СторноПлановыхРасходов.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	СторноПлановыхРасходов.Клиент КАК Клиент,
	|	СторноПлановыхРасходов.ДоговорКлиента КАК ДоговорКлиента,
	|	СторноПлановыхРасходов.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	СторноПлановыхРасходов.Реализация КАК Реализация,
	|	СторноПлановыхРасходов.Сумма КАК Сумма,
	|	СторноПлановыхРасходов.СуммаНДС КАК СуммаНДС,
	|	СторноПлановыхРасходов.СуммаРуб КАК СуммаРуб,
	|	СторноПлановыхРасходов.СуммаНДСРуб КАК СуммаНДСРуб
	|ПОМЕСТИТЬ СторноСРасходамиВОдномПериоде
	|ИЗ
	|	СторноПлановыхРасходов КАК СторноПлановыхРасходов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПлановыеРасходыВО КАК ПлановыеРасходыВО
	|		ПО СторноПлановыхРасходов.Период = ПлановыеРасходыВО.Период
	|			И СторноПлановыхРасходов.ИдентификаторСтрокиРасходов = ПлановыеРасходыВО.ИдентификаторСтрокиРасходов
	|			И СторноПлановыхРасходов.Сделка = ПлановыеРасходыВО.Сделка
	|			И (ПлановыеРасходыВО.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|			И СторноПлановыхРасходов.Организация = ПлановыеРасходыВО.Организация
	|			И СторноПлановыхРасходов.ЦФО = ПлановыеРасходыВО.ЦФО
	|			И СторноПлановыхРасходов.ИдентификаторСУЕ = ПлановыеРасходыВО.ИдентификаторСУЕ
	|			И СторноПлановыхРасходов.Поставщик = ПлановыеРасходыВО.Поставщик
	|			И СторноПлановыхРасходов.Договор = ПлановыеРасходыВО.Договор
	|			И СторноПлановыхРасходов.Услуга = ПлановыеРасходыВО.Услуга
	|			И СторноПлановыхРасходов.Вагон = ПлановыеРасходыВО.Вагон
	|			И СторноПлановыхРасходов.Контейнер = ПлановыеРасходыВО.Контейнер
	|			И СторноПлановыхРасходов.НоменклатурнаяГруппа = ПлановыеРасходыВО.НоменклатурнаяГруппа
	|			И СторноПлановыхРасходов.ВидОперации = ПлановыеРасходыВО.ВидОперации
	|			И СторноПлановыхРасходов.ТипОперации = ПлановыеРасходыВО.ТипОперации
	|			И СторноПлановыхРасходов.СтавкаНДС = ПлановыеРасходыВО.СтавкаНДС
	|			И СторноПлановыхРасходов.Валюта = ПлановыеРасходыВО.Валюта
	|			И СторноПлановыхРасходов.ПлановыеРасходыПоЖДН = ПлановыеРасходыВО.ПлановыеРасходыПоЖДН
	|			И СторноПлановыхРасходов.Клиент = ПлановыеРасходыВО.Клиент
	|			И СторноПлановыхРасходов.ДоговорКлиента = ПлановыеРасходыВО.ДоговорКлиента
	|			И СторноПлановыхРасходов.ДатаКурсаВалюты = ПлановыеРасходыВО.ДатаКурсаВалюты
	|			И СторноПлановыхРасходов.Реализация = ПлановыеРасходыВО.Реализация
	|;
	//Евросиб Каблов 05.12.2023 )
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлановыеРасходыВООстатки.Организация КАК Организация,
	|	ПлановыеРасходыВООстатки.Сделка КАК Сделка,
	|	ПлановыеРасходыВООстатки.ЦФО КАК ЦФО,
	|	ПлановыеРасходыВООстатки.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ПлановыеРасходыВООстатки.Поставщик КАК Поставщик,
	|	ПлановыеРасходыВООстатки.Договор КАК Договор,
	|	ПлановыеРасходыВООстатки.Услуга КАК Услуга,
	|	ПлановыеРасходыВООстатки.Вагон КАК Вагон,
	|	ПлановыеРасходыВООстатки.Контейнер КАК Контейнер,
	|	ПлановыеРасходыВООстатки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ПлановыеРасходыВООстатки.ВидОперации КАК ВидОперации,
	|	ПлановыеРасходыВООстатки.ТипОперации КАК ТипОперации,
	|	ПлановыеРасходыВООстатки.СтавкаНДС КАК СтавкаНДС,
	|	ПлановыеРасходыВООстатки.Валюта КАК Валюта,
	|	ПлановыеРасходыВООстатки.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	ПлановыеРасходыВООстатки.СуммаОстаток КАК СуммаОстаток,
	|	ПлановыеРасходыВООстатки.СуммаНДСОстаток КАК СуммаНДСОстаток,
	|	ПлановыеРасходыВООстатки.СуммаРубОстаток КАК СуммаРубОстаток,
	|	ПлановыеРасходыВООстатки.СуммаНДСРубОстаток КАК СуммаНДСРубОстаток,
	|	ПлановыеРасходыВООстатки.Клиент КАК Клиент,
	|	ПлановыеРасходыВООстатки.ДоговорКлиента КАК ДоговорКлиента,
	|	ПлановыеРасходыВООстатки.Реализация КАК Реализация,
	|	ПлановыеРасходыВООстатки.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ЕСТЬNULL(ВТ_СписанныеПлановыеРасходы.ЕстьСписание, ЛОЖЬ) КАК ЕстьСписание
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрНакопления.ПлановыеРасходыВО.Остатки(&КонецПериодаПлановыхРасходов, ) КАК ПлановыеРасходыВООстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СписанныеПлановыеРасходы КАК ВТ_СписанныеПлановыеРасходы
	|		ПО ПлановыеРасходыВООстатки.ИдентификаторСтрокиРасходов = ВТ_СписанныеПлановыеРасходы.ИдентификаторСтрокиРасходов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.Организация,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.Сделка,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.ЦФО,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.ИдентификаторСУЕ,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.Поставщик,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.Договор,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.Услуга,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.Вагон,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.Контейнер,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.НоменклатурнаяГруппа,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.ВидОперации,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.ТипОперации,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.СтавкаНДС,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.Валюта,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.ПлановыеРасходыПоЖДН,
	|	-ФиксацияИзмененияПлановыхРасходовВООбороты.СуммаОборот,
	|	-ФиксацияИзмененияПлановыхРасходовВООбороты.СуммаНДСОборот,
	|	-ФиксацияИзмененияПлановыхРасходовВООбороты.СуммаРубОборот,
	|	-ФиксацияИзмененияПлановыхРасходовВООбороты.СуммаНДСРубОборот,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.Клиент,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.ДоговорКлиента,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.Реализация,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.ДатаКурсаВалюты,
	|	ЛОЖЬ
	|ИЗ
	|	РегистрНакопления.ФиксацияИзмененияПлановыхРасходовВО.Обороты(, &КонецПериодаЗафиксированныхРасходов, , ) КАК ФиксацияИзмененияПлановыхРасходовВООбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ФиксацияИзмененияПлановыхРасходовВО КАК ФиксацияИзмененияПлановыхРасходовВО
	|		ПО (ФиксацияИзмененияПлановыхРасходовВО.ИдентификаторСУЕ = ФиксацияИзмененияПлановыхРасходовВООбороты.ИдентификаторСУЕ)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Организация = ФиксацияИзмененияПлановыхРасходовВООбороты.Организация)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Сделка = ФиксацияИзмененияПлановыхРасходовВООбороты.Сделка)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.ЦФО = ФиксацияИзмененияПлановыхРасходовВООбороты.ЦФО)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Поставщик = ФиксацияИзмененияПлановыхРасходовВООбороты.Поставщик)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Договор = ФиксацияИзмененияПлановыхРасходовВООбороты.Договор)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Услуга = ФиксацияИзмененияПлановыхРасходовВООбороты.Услуга)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Вагон = ФиксацияИзмененияПлановыхРасходовВООбороты.Вагон)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Контейнер = ФиксацияИзмененияПлановыхРасходовВООбороты.Контейнер)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.НоменклатурнаяГруппа = ФиксацияИзмененияПлановыхРасходовВООбороты.НоменклатурнаяГруппа)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.ВидОперации = ФиксацияИзмененияПлановыхРасходовВООбороты.ВидОперации)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.ТипОперации = ФиксацияИзмененияПлановыхРасходовВООбороты.ТипОперации)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.СтавкаНДС = ФиксацияИзмененияПлановыхРасходовВООбороты.СтавкаНДС)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Валюта = ФиксацияИзмененияПлановыхРасходовВООбороты.Валюта)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.ПлановыеРасходыПоЖДН = ФиксацияИзмененияПлановыхРасходовВООбороты.ПлановыеРасходыПоЖДН)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Клиент = ФиксацияИзмененияПлановыхРасходовВООбороты.Клиент)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.ДоговорКлиента = ФиксацияИзмененияПлановыхРасходовВООбороты.ДоговорКлиента)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.ДатаКурсаВалюты = ФиксацияИзмененияПлановыхРасходовВООбороты.ДатаКурсаВалюты)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Реализация = ФиксацияИзмененияПлановыхРасходовВООбороты.Реализация)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Регистратор ССЫЛКА Документ.СписаниеПлановыхРасходов)
	|ГДЕ
	|	ФиксацияИзмененияПлановыхРасходовВО.ИдентификаторСУЕ ЕСТЬ NULL
	//Евросиб Каблов 05.12.2023 ( #77692
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СторноСРасходамиВОдномПериоде.Организация КАК Организация,
	|	СторноСРасходамиВОдномПериоде.Сделка КАК Сделка,
	|	СторноСРасходамиВОдномПериоде.ЦФО КАК ЦФО,
	|	СторноСРасходамиВОдномПериоде.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	СторноСРасходамиВОдномПериоде.Поставщик КАК Поставщик,
	|	СторноСРасходамиВОдномПериоде.Договор КАК Договор,
	|	СторноСРасходамиВОдномПериоде.Услуга КАК Услуга,
	|	СторноСРасходамиВОдномПериоде.Вагон КАК Вагон,
	|	СторноСРасходамиВОдномПериоде.Контейнер КАК Контейнер,
	|	СторноСРасходамиВОдномПериоде.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	СторноСРасходамиВОдномПериоде.ВидОперации КАК ВидОперации,
	|	СторноСРасходамиВОдномПериоде.ТипОперации КАК ТипОперации,
	|	СторноСРасходамиВОдномПериоде.СтавкаНДС КАК СтавкаНДС,
	|	СторноСРасходамиВОдномПериоде.Валюта КАК Валюта,
	|	СторноСРасходамиВОдномПериоде.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	СторноСРасходамиВОдномПериоде.Сумма КАК СуммаОстаток,
	|	СторноСРасходамиВОдномПериоде.СуммаНДС КАК СуммаНДСОстаток,
	|	СторноСРасходамиВОдномПериоде.СуммаРуб КАК СуммаРубОстаток,
	|	СторноСРасходамиВОдномПериоде.СуммаНДСРуб КАК СуммаНДСРубОстаток,
	|	СторноСРасходамиВОдномПериоде.Клиент КАК Клиент,
	|	СторноСРасходамиВОдномПериоде.ДоговорКлиента КАК ДоговорКлиента,
	|	СторноСРасходамиВОдномПериоде.Реализация КАК Реализация,
	|	СторноСРасходамиВОдномПериоде.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ЕСТЬNULL(ВТ_СписанныеПлановыеРасходы.ЕстьСписание, ЛОЖЬ) КАК ЕстьСписание
	|ПОМЕСТИТЬ ПлановыйРасходИСторноВПериоде
	|ИЗ
	|	СторноСРасходамиВОдномПериоде КАК СторноСРасходамиВОдномПериоде
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СписанныеПлановыеРасходы КАК ВТ_СписанныеПлановыеРасходы
	|		ПО СторноСРасходамиВОдномПериоде.ИдентификаторСтрокиРасходов = ВТ_СписанныеПлановыеРасходы.ИдентификаторСтрокиРасходов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СторноСРасходамиВОдномПериоде.Организация,
	|	СторноСРасходамиВОдномПериоде.Сделка,
	|	СторноСРасходамиВОдномПериоде.ЦФО,
	|	СторноСРасходамиВОдномПериоде.ИдентификаторСУЕ,
	|	СторноСРасходамиВОдномПериоде.Поставщик,
	|	СторноСРасходамиВОдномПериоде.Договор,
	|	СторноСРасходамиВОдномПериоде.Услуга,
	|	СторноСРасходамиВОдномПериоде.Вагон,
	|	СторноСРасходамиВОдномПериоде.Контейнер,
	|	СторноСРасходамиВОдномПериоде.НоменклатурнаяГруппа,
	|	СторноСРасходамиВОдномПериоде.ВидОперации,
	|	СторноСРасходамиВОдномПериоде.ТипОперации,
	|	СторноСРасходамиВОдномПериоде.СтавкаНДС,
	|	СторноСРасходамиВОдномПериоде.Валюта,
	|	СторноСРасходамиВОдномПериоде.ПлановыеРасходыПоЖДН,
	|	-СторноСРасходамиВОдномПериоде.Сумма,
	|	-СторноСРасходамиВОдномПериоде.СуммаНДС,
	|	-СторноСРасходамиВОдномПериоде.СуммаРуб,
	|	-СторноСРасходамиВОдномПериоде.СуммаНДСРуб,
	|	СторноСРасходамиВОдномПериоде.Клиент,
	|	СторноСРасходамиВОдномПериоде.ДоговорКлиента,
	|	СторноСРасходамиВОдномПериоде.Реализация,
	|	СторноСРасходамиВОдномПериоде.ДатаКурсаВалюты,
	|	ЕСТЬNULL(ВТ_СписанныеПлановыеРасходы.ЕстьСписание, ЛОЖЬ)
	|ИЗ
	|	СторноСРасходамиВОдномПериоде КАК СторноСРасходамиВОдномПериоде
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СписанныеПлановыеРасходы КАК ВТ_СписанныеПлановыеРасходы
	|		ПО СторноСРасходамиВОдномПериоде.ИдентификаторСтрокиРасходов = ВТ_СписанныеПлановыеРасходы.ИдентификаторСтрокиРасходов
	//Евросиб Каблов 05.12.2023 )
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПериодФиксации КАК Период,
	|	ВТ.Организация КАК Организация,
	|	ВТ.Сделка КАК Сделка,
	|	ВТ.ЦФО КАК ЦФО,
	|	ВТ.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ВТ.Поставщик КАК Поставщик,
	|	ВТ.Договор КАК Договор,
	|	ВТ.Услуга КАК Услуга,
	|	ВТ.Вагон КАК Вагон,
	|	ВТ.Контейнер КАК Контейнер,
	|	ВТ.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ВТ.ВидОперации КАК ВидОперации,
	|	ВТ.ТипОперации КАК ТипОперации,
	|	ВТ.СтавкаНДС КАК СтавкаНДС,
	|	ВТ.Валюта КАК Валюта,
	|	ВТ.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	СУММА(ВТ.СуммаОстаток) КАК Сумма,
	|	СУММА(ВТ.СуммаНДСОстаток) КАК СуммаНДС,
	|	СУММА(ВТ.СуммаРубОстаток) КАК СуммаРуб,
	|	СУММА(ВТ.СуммаНДСРубОстаток) КАК СуммаНДСРуб,
	|	ВТ.Клиент КАК Клиент,
	|	ВТ.ДоговорКлиента КАК ДоговорКлиента,
	|	ВТ.Реализация КАК Реализация,
	|	ВТ.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ЛОЖЬ КАК ПланФактВПериоде,
	|	МАКСИМУМ(ВТ.ЕстьСписание) КАК ЕстьСписание
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ТипОперации,
	|	ВТ.ВидОперации,
	|	ВТ.Услуга,
	|	ВТ.Договор,
	|	ВТ.Контейнер,
	|	ВТ.ПлановыеРасходыПоЖДН,
	|	ВТ.СтавкаНДС,
	|	ВТ.Поставщик,
	|	ВТ.НоменклатурнаяГруппа,
	|	ВТ.Вагон,
	|	ВТ.Валюта,
	|	ВТ.ЦФО,
	|	ВТ.ИдентификаторСУЕ,
	|	ВТ.Организация,
	|	ВТ.Сделка,
	|	ВТ.Клиент,
	|	ВТ.ДоговорКлиента,
	|	ВТ.Реализация,
	|	ВТ.ДатаКурсаВалюты
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ВТ.ЕстьСписание) = ЛОЖЬ И
	|	НЕ(СУММА(ВТ.СуммаОстаток) = 0
	|			И СУММА(ВТ.СуммаНДСОстаток) = 0
	|			И СУММА(ВТ.СуммаРубОстаток) = 0
	|			И СУММА(ВТ.СуммаНДСРубОстаток) = 0)
	//Евросиб Каблов 05.12.2023 ( #77692
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ПериодФиксации,
	|	ПлановыйРасходИСторноВПериоде.Организация,
	|	ПлановыйРасходИСторноВПериоде.Сделка,
	|	ПлановыйРасходИСторноВПериоде.ЦФО,
	|	ПлановыйРасходИСторноВПериоде.ИдентификаторСУЕ,
	|	ПлановыйРасходИСторноВПериоде.Поставщик,
	|	ПлановыйРасходИСторноВПериоде.Договор,
	|	ПлановыйРасходИСторноВПериоде.Услуга,
	|	ПлановыйРасходИСторноВПериоде.Вагон,
	|	ПлановыйРасходИСторноВПериоде.Контейнер,
	|	ПлановыйРасходИСторноВПериоде.НоменклатурнаяГруппа,
	|	ПлановыйРасходИСторноВПериоде.ВидОперации,
	|	ПлановыйРасходИСторноВПериоде.ТипОперации,
	|	ПлановыйРасходИСторноВПериоде.СтавкаНДС,
	|	ПлановыйРасходИСторноВПериоде.Валюта,
	|	ПлановыйРасходИСторноВПериоде.ПлановыеРасходыПоЖДН,
	|	ПлановыйРасходИСторноВПериоде.СуммаОстаток,
	|	ПлановыйРасходИСторноВПериоде.СуммаНДСОстаток,
	|	ПлановыйРасходИСторноВПериоде.СуммаРубОстаток,
	|	ПлановыйРасходИСторноВПериоде.СуммаНДСРубОстаток,
	|	ПлановыйРасходИСторноВПериоде.Клиент,
	|	ПлановыйРасходИСторноВПериоде.ДоговорКлиента,
	|	ПлановыйРасходИСторноВПериоде.Реализация,
	|	ПлановыйРасходИСторноВПериоде.ДатаКурсаВалюты,
	|	ИСТИНА,
	|	МАКСИМУМ(ПлановыйРасходИСторноВПериоде.ЕстьСписание)
	|ИЗ
	|	ПлановыйРасходИСторноВПериоде КАК ПлановыйРасходИСторноВПериоде
	|
	|СГРУППИРОВАТЬ ПО
	|	ПлановыйРасходИСторноВПериоде.ТипОперации,
	|	ПлановыйРасходИСторноВПериоде.ВидОперации,
	|	ПлановыйРасходИСторноВПериоде.Услуга,
	|	ПлановыйРасходИСторноВПериоде.Договор,
	|	ПлановыйРасходИСторноВПериоде.Контейнер,
	|	ПлановыйРасходИСторноВПериоде.ПлановыеРасходыПоЖДН,
	|	ПлановыйРасходИСторноВПериоде.СтавкаНДС,
	|	ПлановыйРасходИСторноВПериоде.Поставщик,
	|	ПлановыйРасходИСторноВПериоде.НоменклатурнаяГруппа,
	|	ПлановыйРасходИСторноВПериоде.Вагон,
	|	ПлановыйРасходИСторноВПериоде.Валюта,
	|	ПлановыйРасходИСторноВПериоде.ЦФО,
	|	ПлановыйРасходИСторноВПериоде.ИдентификаторСУЕ,
	|	ПлановыйРасходИСторноВПериоде.Организация,
	|	ПлановыйРасходИСторноВПериоде.Сделка,
	|	ПлановыйРасходИСторноВПериоде.Клиент,
	|	ПлановыйРасходИСторноВПериоде.ДоговорКлиента,
	|	ПлановыйРасходИСторноВПериоде.Реализация,
	|	ПлановыйРасходИСторноВПериоде.ДатаКурсаВалюты,
	|	ПлановыйРасходИСторноВПериоде.СуммаНДСОстаток,
	|	ПлановыйРасходИСторноВПериоде.СуммаНДСРубОстаток,
	|	ПлановыйРасходИСторноВПериоде.СуммаОстаток,
	|	ПлановыйРасходИСторноВПериоде.СуммаРубОстаток
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ПлановыйРасходИСторноВПериоде.ЕстьСписание) = ЛОЖЬ";
	//Евросиб Каблов 05.12.2023 )
	Возврат ТекстЗапроса;
		
КонецФункции

Процедура ЗП_УстановитьПараметрыЗапросаФиксацииИзменений(Запрос, Объект)
	Запрос.УстановитьПараметр("КонецПериодаПлановыхРасходов", КонецМесяца(Объект.ПериодБлокировки));
	Запрос.УстановитьПараметр("КонецПериодаЗафиксированныхРасходов", Объект.ПериодБлокировки-1);
	Запрос.УстановитьПараметр("ПериодФиксации", Объект.ПериодБлокировки);
КонецПроцедуры

Процедура ЗП_СформироватьДвиженияЗакрытиеОстатковПлановыхРасходовВО(Объект)
	
	Объект.Движения.ПлановыеРасходыВО.Очистить();
	Объект.Движения.ПлановыеРасходыВО.Записать();
	Запрос = Новый Запрос;
	//Евросиб - АСуслов 17.08.2022 17:33:41 #55129
	//(
	ИспользоватьРегистрРазнесениеРасходовДляРазнесенияАкцептов = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьРегистрРазнесениеРасходовДляРазнесенияАкцептов");
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПериодОстатков", КонецМесяца(Объект.ПериодБлокировки));
	Если ИспользоватьРегистрРазнесениеРасходовДляРазнесенияАкцептов Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазнесениеРасходов.Сделка КАК Сделка,
		|	РазнесениеРасходов.ГУИДРасходов КАК ГУИДРасходов,
		|	РазнесениеРасходов.НеРазнесеноОстаток КАК НеРазнесено
		|ПОМЕСТИТЬ ВТ_ПолностьюРазнесенные
		|ИЗ
		|	РегистрНакопления.РазнесениеРасходов.Остатки(&ПериодОстатков, ) КАК РазнесениеРасходов
		|ГДЕ
		|	РазнесениеРасходов.НеРазнесеноОстаток = 0
		|";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазнесениеЗатратПТУОстатки.Сделка КАК Сделка,
		|	РазнесениеЗатратПТУОстатки.ГУИДРасходов КАК ГУИДРасходов,
		|	РазнесениеЗатратПТУОстатки.ПолностьюРазнесеноОстаток КАК ПолностьюРазнесеноОстаток
		|ПОМЕСТИТЬ ВТ_ПолностьюРазнесенные
		|ИЗ
		|	РегистрНакопления.РазнесениеЗатратПТУ.Остатки(&ПериодОстатков, ) КАК РазнесениеЗатратПТУОстатки
		|ГДЕ
		|	РазнесениеЗатратПТУОстатки.ПолностьюРазнесеноОстаток = 0
		|;";
	КонецЕсли;
	Запрос.Выполнить();
	Запрос.Текст = " 
	//"ВЫБРАТЬ
	//|	РазнесениеЗатратПТУОстатки.Сделка КАК Сделка,
	//|	РазнесениеЗатратПТУОстатки.ГУИДРасходов КАК ГУИДРасходов,
	//|	РазнесениеЗатратПТУОстатки.ПолностьюРазнесеноОстаток КАК ПолностьюРазнесеноОстаток
	//|ПОМЕСТИТЬ ВТ_ПолностьюРазнесенные
	//|ИЗ
	//|	РегистрНакопления.РазнесениеЗатратПТУ.Остатки(&ПериодОстатков, ) КАК РазнесениеЗатратПТУОстатки
	//|ГДЕ
	//|	РазнесениеЗатратПТУОстатки.ПолностьюРазнесеноОстаток = 0
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//)
	//Евросиб - АСуслов 17.08.2022 17:33:41 #55129
	|ВЫБРАТЬ
	|   &ПериодФиксации КАК Период, 
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ПлановыеРасходыВООстатки.Организация КАК Организация,
	|	ПлановыеРасходыВООстатки.Сделка КАК Сделка,
	|	ПлановыеРасходыВООстатки.ЦФО КАК ЦФО,
	|	ПлановыеРасходыВООстатки.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ПлановыеРасходыВООстатки.Поставщик КАК Поставщик,
	|	ПлановыеРасходыВООстатки.Договор КАК Договор,
	|	ПлановыеРасходыВООстатки.Услуга КАК Услуга,
	|	ПлановыеРасходыВООстатки.Вагон КАК Вагон,
	|	ПлановыеРасходыВООстатки.Контейнер КАК Контейнер,
	|	ПлановыеРасходыВООстатки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ПлановыеРасходыВООстатки.ВидОперации КАК ВидОперации,
	|	ПлановыеРасходыВООстатки.ТипОперации КАК ТипОперации,
	|	ПлановыеРасходыВООстатки.СтавкаНДС КАК СтавкаНДС,
	|	ПлановыеРасходыВООстатки.Валюта КАК Валюта,
	|	ПлановыеРасходыВООстатки.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	|	ПлановыеРасходыВООстатки.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	ПлановыеРасходыВООстатки.СуммаОстаток КАК СуммаОстаток,
	|	ПлановыеРасходыВООстатки.СуммаНДСОстаток КАК СуммаНДСОстаток,
	|	ПлановыеРасходыВООстатки.СуммаРубОстаток КАК СуммаРубОстаток,
	|	ПлановыеРасходыВООстатки.СуммаНДСРубОстаток КАК СуммаНДСРубОстаток
	|ИЗ
	|	РегистрНакопления.ПлановыеРасходыВО.Остатки(
	|			&ПериодОстатков,
	|			(ИдентификаторСтрокиРасходов, Сделка) В
	|				(ВЫБРАТЬ
	|					т.ГУИДРасходов,
	|  					т.Сделка
	|				ИЗ
	|					ВТ_ПолностьюРазнесенные КАК т)) КАК ПлановыеРасходыВООстатки";
	Запрос.УстановитьПараметр("ПериодФиксации", Объект.ПериодБлокировки);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	Объект.Движения.ПлановыеРасходыВО.Записывать = Истина;
	Объект.Движения.ПлановыеРасходыВО.Загрузить(РезультатЗапроса.Выгрузить());
		
КонецПроцедуры

//Евросиб Каблов 06.11.2025 #107942
Процедура ЗП_СформироватьДвиженияФиксацияИзмененияПлановыхРасходовВОПолныйФакт(Объект) Экспорт
	
	Объект.Движения.ФиксацияИзмененияПлановыхРасходовВОПолныйФакт.Очистить();
	Объект.Движения.ФиксацияИзмененияПлановыхРасходовВОПолныйФакт.Записать();
	Запрос = Новый Запрос;
	Запрос.Текст = ЗП_ПолучитьТекстЗапросаФиксацииИзмененияПолныйФакт();
	ЗП_УстановитьПараметрыЗапросаФиксацииИзменений(Запрос, Объект);
	РезультатЗапроса = Запрос.Выполнить();
	//Если РезультатЗапроса.Пустой() Тогда
	//	Возврат;
	//КонецЕсли; 
	Объект.Движения.ФиксацияИзмененияПлановыхРасходовВОПолныйФакт.Записывать = Истина;
	Объект.Движения.ФиксацияИзмененияПлановыхРасходовВОПолныйФакт.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

//Евросиб Каблов 06.11.2025 #107942
Функция ЗП_ПолучитьТекстЗапросаФиксацииИзмененияПолныйФакт()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПлановыеРасходыВО.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	|	ИСТИНА КАК ЕстьСписание
	|ПОМЕСТИТЬ ВТ_СписанныеПлановыеРасходы
	|ИЗ
	|	РегистрНакопления.ПлановыеРасходыВОПолныйФакт КАК ПлановыеРасходыВО
	|ГДЕ
	|	ПлановыеРасходыВО.Списание
	|	И ПлановыеРасходыВО.Период <= &КонецПериодаПлановыхРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлановыеРасходыВО.Период КАК Период,
	|	ПлановыеРасходыВО.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	|	ПлановыеРасходыВО.Сделка КАК Сделка,
	|	ПлановыеРасходыВО.Организация КАК Организация,
	|	ПлановыеРасходыВО.ЦФО КАК ЦФО,
	|	ПлановыеРасходыВО.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ПлановыеРасходыВО.Поставщик КАК Поставщик,
	|	ПлановыеРасходыВО.Договор КАК Договор,
	|	ПлановыеРасходыВО.Услуга КАК Услуга,
	|	ПлановыеРасходыВО.Вагон КАК Вагон,
	|	ПлановыеРасходыВО.Контейнер КАК Контейнер,
	|	ПлановыеРасходыВО.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ПлановыеРасходыВО.ВидОперации КАК ВидОперации,
	|	ПлановыеРасходыВО.ТипОперации КАК ТипОперации,
	|	ПлановыеРасходыВО.СтавкаНДС КАК СтавкаНДС,
	|	ПлановыеРасходыВО.Валюта КАК Валюта,
	|	ПлановыеРасходыВО.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	ПлановыеРасходыВО.Клиент КАК Клиент,
	|	ПлановыеРасходыВО.ДоговорКлиента КАК ДоговорКлиента,
	|	ПлановыеРасходыВО.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ПлановыеРасходыВО.Реализация КАК Реализация,
	//Евросиб Каблов 05.03.2026 ( #126776
	|	ПлановыеРасходыВО.ИсключатьИзУФД КАК ИсключатьИзУФД,
	//Евросиб Каблов 05.03.2026 
	|	ПлановыеРасходыВО.Сумма КАК Сумма,
	|	ПлановыеРасходыВО.СуммаНДС КАК СуммаНДС,
	|	ПлановыеРасходыВО.СуммаРуб КАК СуммаРуб,
	|	ПлановыеРасходыВО.СуммаНДСРуб КАК СуммаНДСРуб
	|ПОМЕСТИТЬ СторноПлановыхРасходов
	|ИЗ
	|	РегистрНакопления.ПлановыеРасходыВОПолныйФакт КАК ПлановыеРасходыВО
	|ГДЕ
	|	ПлановыеРасходыВО.Период МЕЖДУ &ПериодФиксации И &КонецПериодаПлановыхРасходов
	|	И ПлановыеРасходыВО.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СторноПлановыхРасходов.Период КАК Период,
	|	СторноПлановыхРасходов.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	|	СторноПлановыхРасходов.Сделка КАК Сделка,
	|	СторноПлановыхРасходов.Организация КАК Организация,
	|	СторноПлановыхРасходов.ЦФО КАК ЦФО,
	|	СторноПлановыхРасходов.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	СторноПлановыхРасходов.Поставщик КАК Поставщик,
	|	СторноПлановыхРасходов.Договор КАК Договор,
	|	СторноПлановыхРасходов.Услуга КАК Услуга,
	|	СторноПлановыхРасходов.Вагон КАК Вагон,
	|	СторноПлановыхРасходов.Контейнер КАК Контейнер,
	|	СторноПлановыхРасходов.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	СторноПлановыхРасходов.ВидОперации КАК ВидОперации,
	|	СторноПлановыхРасходов.ТипОперации КАК ТипОперации,
	|	СторноПлановыхРасходов.СтавкаНДС КАК СтавкаНДС,
	|	СторноПлановыхРасходов.Валюта КАК Валюта,
	|	СторноПлановыхРасходов.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	СторноПлановыхРасходов.Клиент КАК Клиент,
	|	СторноПлановыхРасходов.ДоговорКлиента КАК ДоговорКлиента,
	|	СторноПлановыхРасходов.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	СторноПлановыхРасходов.Реализация КАК Реализация,
	//Евросиб Каблов 05.03.2026 ( #126776
	|	СторноПлановыхРасходов.ИсключатьИзУФД КАК ИсключатьИзУФД,
	//Евросиб Каблов 05.03.2026 
	|	СторноПлановыхРасходов.Сумма КАК Сумма,
	|	СторноПлановыхРасходов.СуммаНДС КАК СуммаНДС,
	|	СторноПлановыхРасходов.СуммаРуб КАК СуммаРуб,
	|	СторноПлановыхРасходов.СуммаНДСРуб КАК СуммаНДСРуб
	|ПОМЕСТИТЬ СторноСРасходамиВОдномПериоде
	|ИЗ
	|	СторноПлановыхРасходов КАК СторноПлановыхРасходов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПлановыеРасходыВОПолныйФакт КАК ПлановыеРасходыВО
	|		ПО СторноПлановыхРасходов.Период = ПлановыеРасходыВО.Период
	|			И СторноПлановыхРасходов.ИдентификаторСтрокиРасходов = ПлановыеРасходыВО.ИдентификаторСтрокиРасходов
	|			И СторноПлановыхРасходов.Сделка = ПлановыеРасходыВО.Сделка
	|			И (ПлановыеРасходыВО.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|			И СторноПлановыхРасходов.Организация = ПлановыеРасходыВО.Организация
	|			И СторноПлановыхРасходов.ЦФО = ПлановыеРасходыВО.ЦФО
	|			И СторноПлановыхРасходов.ИдентификаторСУЕ = ПлановыеРасходыВО.ИдентификаторСУЕ
	|			И СторноПлановыхРасходов.Поставщик = ПлановыеРасходыВО.Поставщик
	|			И СторноПлановыхРасходов.Договор = ПлановыеРасходыВО.Договор
	|			И СторноПлановыхРасходов.Услуга = ПлановыеРасходыВО.Услуга
	|			И СторноПлановыхРасходов.Вагон = ПлановыеРасходыВО.Вагон
	|			И СторноПлановыхРасходов.Контейнер = ПлановыеРасходыВО.Контейнер
	|			И СторноПлановыхРасходов.НоменклатурнаяГруппа = ПлановыеРасходыВО.НоменклатурнаяГруппа
	|			И СторноПлановыхРасходов.ВидОперации = ПлановыеРасходыВО.ВидОперации
	|			И СторноПлановыхРасходов.ТипОперации = ПлановыеРасходыВО.ТипОперации
	|			И СторноПлановыхРасходов.СтавкаНДС = ПлановыеРасходыВО.СтавкаНДС
	|			И СторноПлановыхРасходов.Валюта = ПлановыеРасходыВО.Валюта
	|			И СторноПлановыхРасходов.ПлановыеРасходыПоЖДН = ПлановыеРасходыВО.ПлановыеРасходыПоЖДН
	|			И СторноПлановыхРасходов.Клиент = ПлановыеРасходыВО.Клиент
	|			И СторноПлановыхРасходов.ДоговорКлиента = ПлановыеРасходыВО.ДоговорКлиента
	|			И СторноПлановыхРасходов.ДатаКурсаВалюты = ПлановыеРасходыВО.ДатаКурсаВалюты
	|			И СторноПлановыхРасходов.Реализация = ПлановыеРасходыВО.Реализация
	//Евросиб Каблов 05.03.2026 ( #126776
	|			И СторноПлановыхРасходов.ИсключатьИзУФД = ПлановыеРасходыВО.ИсключатьИзУФД
	//Евросиб Каблов 05.03.2026
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлановыеРасходыВООстатки.Организация КАК Организация,
	|	ПлановыеРасходыВООстатки.Сделка КАК Сделка,
	|	ПлановыеРасходыВООстатки.ЦФО КАК ЦФО,
	|	ПлановыеРасходыВООстатки.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ПлановыеРасходыВООстатки.Поставщик КАК Поставщик,
	|	ПлановыеРасходыВООстатки.Договор КАК Договор,
	|	ПлановыеРасходыВООстатки.Услуга КАК Услуга,
	|	ПлановыеРасходыВООстатки.Вагон КАК Вагон,
	|	ПлановыеРасходыВООстатки.Контейнер КАК Контейнер,
	|	ПлановыеРасходыВООстатки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ПлановыеРасходыВООстатки.ВидОперации КАК ВидОперации,
	|	ПлановыеРасходыВООстатки.ТипОперации КАК ТипОперации,
	|	ПлановыеРасходыВООстатки.СтавкаНДС КАК СтавкаНДС,
	|	ПлановыеРасходыВООстатки.Валюта КАК Валюта,
	|	ПлановыеРасходыВООстатки.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	ПлановыеРасходыВООстатки.СуммаОстаток КАК СуммаОстаток,
	|	ПлановыеРасходыВООстатки.СуммаНДСОстаток КАК СуммаНДСОстаток,
	|	ПлановыеРасходыВООстатки.СуммаРубОстаток КАК СуммаРубОстаток,
	|	ПлановыеРасходыВООстатки.СуммаНДСРубОстаток КАК СуммаНДСРубОстаток,
	|	ПлановыеРасходыВООстатки.Клиент КАК Клиент,
	|	ПлановыеРасходыВООстатки.ДоговорКлиента КАК ДоговорКлиента,
	|	ПлановыеРасходыВООстатки.Реализация КАК Реализация,
	//Евросиб Каблов 05.03.2026 ( #126776
	|	ПлановыеРасходыВООстатки.ИсключатьИзУФД КАК ИсключатьИзУФД,
	//Евросиб Каблов 05.03.2026
	|	ПлановыеРасходыВООстатки.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ЕСТЬNULL(ВТ_СписанныеПлановыеРасходы.ЕстьСписание, ЛОЖЬ) КАК ЕстьСписание
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрНакопления.ПлановыеРасходыВОПолныйФакт.Остатки(&КонецПериодаПлановыхРасходов, ) КАК ПлановыеРасходыВООстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СписанныеПлановыеРасходы КАК ВТ_СписанныеПлановыеРасходы
	|		ПО ПлановыеРасходыВООстатки.ИдентификаторСтрокиРасходов = ВТ_СписанныеПлановыеРасходы.ИдентификаторСтрокиРасходов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.Организация,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.Сделка,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.ЦФО,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.ИдентификаторСУЕ,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.Поставщик,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.Договор,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.Услуга,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.Вагон,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.Контейнер,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.НоменклатурнаяГруппа,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.ВидОперации,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.ТипОперации,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.СтавкаНДС,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.Валюта,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.ПлановыеРасходыПоЖДН,
	|	-ФиксацияИзмененияПлановыхРасходовВООбороты.СуммаОборот,
	|	-ФиксацияИзмененияПлановыхРасходовВООбороты.СуммаНДСОборот,
	|	-ФиксацияИзмененияПлановыхРасходовВООбороты.СуммаРубОборот,
	|	-ФиксацияИзмененияПлановыхРасходовВООбороты.СуммаНДСРубОборот,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.Клиент,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.ДоговорКлиента,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.Реализация,
	//Евросиб Каблов 05.03.2026 ( #126776
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.ИсключатьИзУФД КАК ИсключатьИзУФД,
	//Евросиб Каблов 05.03.2026
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.ДатаКурсаВалюты,
	|	ЛОЖЬ
	|ИЗ
	|	РегистрНакопления.ФиксацияИзмененияПлановыхРасходовВОПолныйФакт.Обороты(, &КонецПериодаЗафиксированныхРасходов, , ) КАК ФиксацияИзмененияПлановыхРасходовВООбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ФиксацияИзмененияПлановыхРасходовВОПолныйФакт КАК ФиксацияИзмененияПлановыхРасходовВО
	|		ПО (ФиксацияИзмененияПлановыхРасходовВО.ИдентификаторСУЕ = ФиксацияИзмененияПлановыхРасходовВООбороты.ИдентификаторСУЕ)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Организация = ФиксацияИзмененияПлановыхРасходовВООбороты.Организация)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Сделка = ФиксацияИзмененияПлановыхРасходовВООбороты.Сделка)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.ЦФО = ФиксацияИзмененияПлановыхРасходовВООбороты.ЦФО)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Поставщик = ФиксацияИзмененияПлановыхРасходовВООбороты.Поставщик)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Договор = ФиксацияИзмененияПлановыхРасходовВООбороты.Договор)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Услуга = ФиксацияИзмененияПлановыхРасходовВООбороты.Услуга)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Вагон = ФиксацияИзмененияПлановыхРасходовВООбороты.Вагон)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Контейнер = ФиксацияИзмененияПлановыхРасходовВООбороты.Контейнер)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.НоменклатурнаяГруппа = ФиксацияИзмененияПлановыхРасходовВООбороты.НоменклатурнаяГруппа)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.ВидОперации = ФиксацияИзмененияПлановыхРасходовВООбороты.ВидОперации)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.ТипОперации = ФиксацияИзмененияПлановыхРасходовВООбороты.ТипОперации)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.СтавкаНДС = ФиксацияИзмененияПлановыхРасходовВООбороты.СтавкаНДС)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Валюта = ФиксацияИзмененияПлановыхРасходовВООбороты.Валюта)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.ПлановыеРасходыПоЖДН = ФиксацияИзмененияПлановыхРасходовВООбороты.ПлановыеРасходыПоЖДН)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Клиент = ФиксацияИзмененияПлановыхРасходовВООбороты.Клиент)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.ДоговорКлиента = ФиксацияИзмененияПлановыхРасходовВООбороты.ДоговорКлиента)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.ДатаКурсаВалюты = ФиксацияИзмененияПлановыхРасходовВООбороты.ДатаКурсаВалюты)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Реализация = ФиксацияИзмененияПлановыхРасходовВООбороты.Реализация)
	//Евросиб Каблов 05.03.2026 ( #126776
	|			И (ФиксацияИзмененияПлановыхРасходовВО.ИсключатьИзУФД = ФиксацияИзмененияПлановыхРасходовВООбороты.ИсключатьИзУФД)
	//Евросиб Каблов 05.03.2026
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Регистратор ССЫЛКА Документ.СписаниеПлановыхРасходов)
	|ГДЕ
	|	ФиксацияИзмененияПлановыхРасходовВО.ИдентификаторСУЕ ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СторноСРасходамиВОдномПериоде.Организация КАК Организация,
	|	СторноСРасходамиВОдномПериоде.Сделка КАК Сделка,
	|	СторноСРасходамиВОдномПериоде.ЦФО КАК ЦФО,
	|	СторноСРасходамиВОдномПериоде.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	СторноСРасходамиВОдномПериоде.Поставщик КАК Поставщик,
	|	СторноСРасходамиВОдномПериоде.Договор КАК Договор,
	|	СторноСРасходамиВОдномПериоде.Услуга КАК Услуга,
	|	СторноСРасходамиВОдномПериоде.Вагон КАК Вагон,
	|	СторноСРасходамиВОдномПериоде.Контейнер КАК Контейнер,
	|	СторноСРасходамиВОдномПериоде.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	СторноСРасходамиВОдномПериоде.ВидОперации КАК ВидОперации,
	|	СторноСРасходамиВОдномПериоде.ТипОперации КАК ТипОперации,
	|	СторноСРасходамиВОдномПериоде.СтавкаНДС КАК СтавкаНДС,
	|	СторноСРасходамиВОдномПериоде.Валюта КАК Валюта,
	|	СторноСРасходамиВОдномПериоде.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	СторноСРасходамиВОдномПериоде.Сумма КАК СуммаОстаток,
	|	СторноСРасходамиВОдномПериоде.СуммаНДС КАК СуммаНДСОстаток,
	|	СторноСРасходамиВОдномПериоде.СуммаРуб КАК СуммаРубОстаток,
	|	СторноСРасходамиВОдномПериоде.СуммаНДСРуб КАК СуммаНДСРубОстаток,
	|	СторноСРасходамиВОдномПериоде.Клиент КАК Клиент,
	|	СторноСРасходамиВОдномПериоде.ДоговорКлиента КАК ДоговорКлиента,
	|	СторноСРасходамиВОдномПериоде.Реализация КАК Реализация,
	//Евросиб Каблов 05.03.2026 ( #126776
	|	СторноСРасходамиВОдномПериоде.ИсключатьИзУФД КАК ИсключатьИзУФД,
	//Евросиб Каблов 05.03.2026 
	|	СторноСРасходамиВОдномПериоде.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ЕСТЬNULL(ВТ_СписанныеПлановыеРасходы.ЕстьСписание, ЛОЖЬ) КАК ЕстьСписание
	|ПОМЕСТИТЬ ПлановыйРасходИСторноВПериоде
	|ИЗ
	|	СторноСРасходамиВОдномПериоде КАК СторноСРасходамиВОдномПериоде
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СписанныеПлановыеРасходы КАК ВТ_СписанныеПлановыеРасходы
	|		ПО СторноСРасходамиВОдномПериоде.ИдентификаторСтрокиРасходов = ВТ_СписанныеПлановыеРасходы.ИдентификаторСтрокиРасходов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СторноСРасходамиВОдномПериоде.Организация,
	|	СторноСРасходамиВОдномПериоде.Сделка,
	|	СторноСРасходамиВОдномПериоде.ЦФО,
	|	СторноСРасходамиВОдномПериоде.ИдентификаторСУЕ,
	|	СторноСРасходамиВОдномПериоде.Поставщик,
	|	СторноСРасходамиВОдномПериоде.Договор,
	|	СторноСРасходамиВОдномПериоде.Услуга,
	|	СторноСРасходамиВОдномПериоде.Вагон,
	|	СторноСРасходамиВОдномПериоде.Контейнер,
	|	СторноСРасходамиВОдномПериоде.НоменклатурнаяГруппа,
	|	СторноСРасходамиВОдномПериоде.ВидОперации,
	|	СторноСРасходамиВОдномПериоде.ТипОперации,
	|	СторноСРасходамиВОдномПериоде.СтавкаНДС,
	|	СторноСРасходамиВОдномПериоде.Валюта,
	|	СторноСРасходамиВОдномПериоде.ПлановыеРасходыПоЖДН,
	|	-СторноСРасходамиВОдномПериоде.Сумма,
	|	-СторноСРасходамиВОдномПериоде.СуммаНДС,
	|	-СторноСРасходамиВОдномПериоде.СуммаРуб,
	|	-СторноСРасходамиВОдномПериоде.СуммаНДСРуб,
	|	СторноСРасходамиВОдномПериоде.Клиент,
	|	СторноСРасходамиВОдномПериоде.ДоговорКлиента,
	|	СторноСРасходамиВОдномПериоде.Реализация,
	//Евросиб Каблов 05.03.2026 ( #126776
	|	СторноСРасходамиВОдномПериоде.ИсключатьИзУФД КАК ИсключатьИзУФД,
	//Евросиб Каблов 05.03.2026
	|	СторноСРасходамиВОдномПериоде.ДатаКурсаВалюты,
	|	ЕСТЬNULL(ВТ_СписанныеПлановыеРасходы.ЕстьСписание, ЛОЖЬ)
	|ИЗ
	|	СторноСРасходамиВОдномПериоде КАК СторноСРасходамиВОдномПериоде
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СписанныеПлановыеРасходы КАК ВТ_СписанныеПлановыеРасходы
	|		ПО СторноСРасходамиВОдномПериоде.ИдентификаторСтрокиРасходов = ВТ_СписанныеПлановыеРасходы.ИдентификаторСтрокиРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПериодФиксации КАК Период,
	|	ВТ.Организация КАК Организация,
	|	ВТ.Сделка КАК Сделка,
	|	ВТ.ЦФО КАК ЦФО,
	|	ВТ.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ВТ.Поставщик КАК Поставщик,
	|	ВТ.Договор КАК Договор,
	|	ВТ.Услуга КАК Услуга,
	|	ВТ.Вагон КАК Вагон,
	|	ВТ.Контейнер КАК Контейнер,
	|	ВТ.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ВТ.ВидОперации КАК ВидОперации,
	|	ВТ.ТипОперации КАК ТипОперации,
	|	ВТ.СтавкаНДС КАК СтавкаНДС,
	|	ВТ.Валюта КАК Валюта,
	|	ВТ.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	СУММА(ВТ.СуммаОстаток) КАК Сумма,
	|	СУММА(ВТ.СуммаНДСОстаток) КАК СуммаНДС,
	|	СУММА(ВТ.СуммаРубОстаток) КАК СуммаРуб,
	|	СУММА(ВТ.СуммаНДСРубОстаток) КАК СуммаНДСРуб,
	|	ВТ.Клиент КАК Клиент,
	|	ВТ.ДоговорКлиента КАК ДоговорКлиента,
	|	ВТ.Реализация КАК Реализация,
	//Евросиб Каблов 05.03.2026 ( #126776
	|	ВТ.ИсключатьИзУФД КАК ИсключатьИзУФД,
	//Евросиб Каблов 05.03.2026
	|	ВТ.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ЛОЖЬ КАК ПланФактВПериоде,
	|	МАКСИМУМ(ВТ.ЕстьСписание) КАК ЕстьСписание
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ТипОперации,
	|	ВТ.ВидОперации,
	|	ВТ.Услуга,
	|	ВТ.Договор,
	|	ВТ.Контейнер,
	|	ВТ.ПлановыеРасходыПоЖДН,
	|	ВТ.СтавкаНДС,
	|	ВТ.Поставщик,
	|	ВТ.НоменклатурнаяГруппа,
	|	ВТ.Вагон,
	|	ВТ.Валюта,
	|	ВТ.ЦФО,
	|	ВТ.ИдентификаторСУЕ,
	|	ВТ.Организация,
	|	ВТ.Сделка,
	|	ВТ.Клиент,
	|	ВТ.ДоговорКлиента,
	|	ВТ.Реализация,
	//Евросиб Каблов 05.03.2026 ( #126776
	|	ВТ.ИсключатьИзУФД,
	//Евросиб Каблов 05.03.2026
	|	ВТ.ДатаКурсаВалюты
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ВТ.ЕстьСписание) = ЛОЖЬ И
	|	НЕ(СУММА(ВТ.СуммаОстаток) = 0
	|			И СУММА(ВТ.СуммаНДСОстаток) = 0
	|			И СУММА(ВТ.СуммаРубОстаток) = 0
	|			И СУММА(ВТ.СуммаНДСРубОстаток) = 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ПериодФиксации,
	|	ПлановыйРасходИСторноВПериоде.Организация,
	|	ПлановыйРасходИСторноВПериоде.Сделка,
	|	ПлановыйРасходИСторноВПериоде.ЦФО,
	|	ПлановыйРасходИСторноВПериоде.ИдентификаторСУЕ,
	|	ПлановыйРасходИСторноВПериоде.Поставщик,
	|	ПлановыйРасходИСторноВПериоде.Договор,
	|	ПлановыйРасходИСторноВПериоде.Услуга,
	|	ПлановыйРасходИСторноВПериоде.Вагон,
	|	ПлановыйРасходИСторноВПериоде.Контейнер,
	|	ПлановыйРасходИСторноВПериоде.НоменклатурнаяГруппа,
	|	ПлановыйРасходИСторноВПериоде.ВидОперации,
	|	ПлановыйРасходИСторноВПериоде.ТипОперации,
	|	ПлановыйРасходИСторноВПериоде.СтавкаНДС,
	|	ПлановыйРасходИСторноВПериоде.Валюта,
	|	ПлановыйРасходИСторноВПериоде.ПлановыеРасходыПоЖДН,
	|	ПлановыйРасходИСторноВПериоде.СуммаОстаток,
	|	ПлановыйРасходИСторноВПериоде.СуммаНДСОстаток,
	|	ПлановыйРасходИСторноВПериоде.СуммаРубОстаток,
	|	ПлановыйРасходИСторноВПериоде.СуммаНДСРубОстаток,
	|	ПлановыйРасходИСторноВПериоде.Клиент,
	|	ПлановыйРасходИСторноВПериоде.ДоговорКлиента,
	|	ПлановыйРасходИСторноВПериоде.Реализация,
	//Евросиб Каблов 05.03.2026 ( #126776
	|	ПлановыйРасходИСторноВПериоде.ИсключатьИзУФД КАК ИсключатьИзУФД,
	//Евросиб Каблов 05.03.2026
	|	ПлановыйРасходИСторноВПериоде.ДатаКурсаВалюты,
	|	ИСТИНА,
	|	МАКСИМУМ(ПлановыйРасходИСторноВПериоде.ЕстьСписание)
	|ИЗ
	|	ПлановыйРасходИСторноВПериоде КАК ПлановыйРасходИСторноВПериоде
	|
	|СГРУППИРОВАТЬ ПО
	|	ПлановыйРасходИСторноВПериоде.ТипОперации,
	|	ПлановыйРасходИСторноВПериоде.ВидОперации,
	|	ПлановыйРасходИСторноВПериоде.Услуга,
	|	ПлановыйРасходИСторноВПериоде.Договор,
	|	ПлановыйРасходИСторноВПериоде.Контейнер,
	|	ПлановыйРасходИСторноВПериоде.ПлановыеРасходыПоЖДН,
	|	ПлановыйРасходИСторноВПериоде.СтавкаНДС,
	|	ПлановыйРасходИСторноВПериоде.Поставщик,
	|	ПлановыйРасходИСторноВПериоде.НоменклатурнаяГруппа,
	|	ПлановыйРасходИСторноВПериоде.Вагон,
	|	ПлановыйРасходИСторноВПериоде.Валюта,
	|	ПлановыйРасходИСторноВПериоде.ЦФО,
	|	ПлановыйРасходИСторноВПериоде.ИдентификаторСУЕ,
	|	ПлановыйРасходИСторноВПериоде.Организация,
	|	ПлановыйРасходИСторноВПериоде.Сделка,
	|	ПлановыйРасходИСторноВПериоде.Клиент,
	|	ПлановыйРасходИСторноВПериоде.ДоговорКлиента,
	|	ПлановыйРасходИСторноВПериоде.Реализация,
	//Евросиб Каблов 05.03.2026 ( #126776
	|	ПлановыйРасходИСторноВПериоде.ИсключатьИзУФД,
	//Евросиб Каблов 05.03.2026
	|	ПлановыйРасходИСторноВПериоде.ДатаКурсаВалюты,
	|	ПлановыйРасходИСторноВПериоде.СуммаНДСОстаток,
	|	ПлановыйРасходИСторноВПериоде.СуммаНДСРубОстаток,
	|	ПлановыйРасходИСторноВПериоде.СуммаОстаток,
	|	ПлановыйРасходИСторноВПериоде.СуммаРубОстаток
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ПлановыйРасходИСторноВПериоде.ЕстьСписание) = ЛОЖЬ";
	
	Возврат ТекстЗапроса;
		
КонецФункции


#КонецОбласти

#Область ПереносИСФВЗакрытыйПериод
	
Процедура ПереносИСФ_СформироватьДвиженияПереносаДанных(Объект) Экспорт

	Объект.Движения.ПлановыеРасходыВО.Очистить();
	Объект.Движения.ФиксацияИзмененияПлановыхРасходовВО.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = ПереносИСФ_ПолучитьТекстЗапросаПереносаДанных();
	ПереносИСФ_УстановитьПараметрыЗапросаПереносаДанных(Запрос, Объект);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	//Евросиб Каблов 29.07.2025 ( #111324
	//Объект.Движения.ПлановыеРасходыВО.Записывать = Истина;
	//Объект.Движения.ПлановыеРасходыВО.Загрузить(РезультатЗапроса[1].Выгрузить());
	//Объект.Движения.ФиксацияИзмененияПлановыхРасходовВО.Записывать = Истина;
	//Объект.Движения.ФиксацияИзмененияПлановыхРасходовВО.Загрузить(РезультатЗапроса[2].Выгрузить());
	Объект.Движения.ФиксацияИзмененияПлановыхРасходовВО.Записывать = Истина;
	Объект.Движения.ФиксацияИзмененияПлановыхРасходовВО.Загрузить(РезультатЗапроса[1].Выгрузить());
	//Евросиб Каблов 29.07.2025 )
	
КонецПроцедуры   

Функция ПереносИСФ_ПолучитьТекстЗапросаПереносаДанных()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПлановыеРасходыВООбороты.Период КАК Период,
	|	ПлановыеРасходыВООбороты.Организация КАК Организация,
	|	ПлановыеРасходыВООбороты.Сделка КАК Сделка,
	|	ПлановыеРасходыВООбороты.ЦФО КАК ЦФО,
	|	ПлановыеРасходыВООбороты.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ПлановыеРасходыВООбороты.Поставщик КАК Поставщик,
	|	ПлановыеРасходыВООбороты.Договор КАК Договор,
	|	ПлановыеРасходыВООбороты.Услуга КАК Услуга,
	|	ПлановыеРасходыВООбороты.Вагон КАК Вагон,
	|	ПлановыеРасходыВООбороты.Контейнер КАК Контейнер,
	|	ПлановыеРасходыВООбороты.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ПлановыеРасходыВООбороты.ВидОперации КАК ВидОперации,
	|	ПлановыеРасходыВООбороты.ТипОперации КАК ТипОперации,
	|	ПлановыеРасходыВООбороты.СтавкаНДС КАК СтавкаНДС,
	|	ПлановыеРасходыВООбороты.Валюта КАК Валюта,
	|	ПлановыеРасходыВООбороты.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	|	ПлановыеРасходыВООбороты.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	ПлановыеРасходыВООбороты.Клиент КАК Клиент,
	|	ПлановыеРасходыВООбороты.ДоговорКлиента КАК ДоговорКлиента,
	|	ПлановыеРасходыВООбороты.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ПлановыеРасходыВООбороты.Реализация КАК Реализация,
	|	ПлановыеРасходыВООбороты.СуммаПриход КАК СуммаПриход,
	|	ПлановыеРасходыВООбороты.СуммаНДСПриход КАК СуммаНДСПриход,
	|	ПлановыеРасходыВООбороты.СуммаРубПриход КАК СуммаРубПриход,
	|	ПлановыеРасходыВООбороты.СуммаНДСРубПриход КАК СуммаНДСРубПриход
	|ПОМЕСТИТЬ ВТ_ДанныеДляПереноса
	|ИЗ
	|	РегистрНакопления.ПлановыеРасходыВО.Обороты(
	|			,
	|			,
	|			Запись,
	|			Организация = &Организация
	|				И Реализация В (&СписокИСФ)) КАК ПлановыеРасходыВООбороты
	|;
	//Евросиб Каблов 29.07.2025 ( #111324
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_ДанныеДляПереноса.Период КАК Период,
	//|	ВТ_ДанныеДляПереноса.Организация КАК Организация,
	//|	ВТ_ДанныеДляПереноса.Сделка КАК Сделка,
	//|	ВТ_ДанныеДляПереноса.ЦФО КАК ЦФО,
	//|	ВТ_ДанныеДляПереноса.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	//|	ВТ_ДанныеДляПереноса.Поставщик КАК Поставщик,
	//|	ВТ_ДанныеДляПереноса.Договор КАК Договор,
	//|	ВТ_ДанныеДляПереноса.Услуга КАК Услуга,
	//|	ВТ_ДанныеДляПереноса.Вагон КАК Вагон,
	//|	ВТ_ДанныеДляПереноса.Контейнер КАК Контейнер,
	//|	ВТ_ДанныеДляПереноса.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	//|	ВТ_ДанныеДляПереноса.ВидОперации КАК ВидОперации,
	//|	ВТ_ДанныеДляПереноса.ТипОперации КАК ТипОперации,
	//|	ВТ_ДанныеДляПереноса.СтавкаНДС КАК СтавкаНДС,
	//|	ВТ_ДанныеДляПереноса.Валюта КАК Валюта,
	//|	ВТ_ДанныеДляПереноса.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	//|	ВТ_ДанныеДляПереноса.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	//|	ВТ_ДанныеДляПереноса.Клиент КАК Клиент,
	//|	ВТ_ДанныеДляПереноса.ДоговорКлиента КАК ДоговорКлиента,
	//|	ВТ_ДанныеДляПереноса.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	//|	ВТ_ДанныеДляПереноса.Реализация КАК Реализация,
	//|	-ВТ_ДанныеДляПереноса.СуммаПриход КАК Сумма,
	//|	-ВТ_ДанныеДляПереноса.СуммаНДСПриход КАК СуммаНДС,
	//|	-ВТ_ДанныеДляПереноса.СуммаРубПриход КАК СуммаРуб,
	//|	-ВТ_ДанныеДляПереноса.СуммаНДСРубПриход КАК СуммаНДСРуб
	//|ИЗ
	//|	ВТ_ДанныеДляПереноса КАК ВТ_ДанныеДляПереноса
	//|;
	//Евросиб Каблов 29.07.2025 ) #111324
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПериодПереноса КАК Период,
	|	ВТ_ДанныеДляПереноса.Организация КАК Организация,
	|	ВТ_ДанныеДляПереноса.Сделка КАК Сделка,
	|	ВТ_ДанныеДляПереноса.ЦФО КАК ЦФО,
	|	ВТ_ДанныеДляПереноса.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ВТ_ДанныеДляПереноса.Поставщик КАК Поставщик,
	|	ВТ_ДанныеДляПереноса.Договор КАК Договор,
	|	ВТ_ДанныеДляПереноса.Услуга КАК Услуга,
	|	ВТ_ДанныеДляПереноса.Вагон КАК Вагон,
	|	ВТ_ДанныеДляПереноса.Контейнер КАК Контейнер,
	|	ВТ_ДанныеДляПереноса.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ВТ_ДанныеДляПереноса.ВидОперации КАК ВидОперации,
	|	ВТ_ДанныеДляПереноса.ТипОперации КАК ТипОперации,
	|	ВТ_ДанныеДляПереноса.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_ДанныеДляПереноса.Валюта КАК Валюта,
	|	ВТ_ДанныеДляПереноса.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	|	ВТ_ДанныеДляПереноса.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	ВТ_ДанныеДляПереноса.Клиент КАК Клиент,
	|	ВТ_ДанныеДляПереноса.ДоговорКлиента КАК ДоговорКлиента,
	|	ВТ_ДанныеДляПереноса.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ВТ_ДанныеДляПереноса.Реализация КАК Реализация,
	|	ВТ_ДанныеДляПереноса.СуммаПриход КАК Сумма,
	|	ВТ_ДанныеДляПереноса.СуммаНДСПриход КАК СуммаНДС,
	|	ВТ_ДанныеДляПереноса.СуммаРубПриход КАК СуммаРуб,
	|	ВТ_ДанныеДляПереноса.СуммаНДСРубПриход КАК СуммаНДСРуб
	|ИЗ
	|	ВТ_ДанныеДляПереноса КАК ВТ_ДанныеДляПереноса";
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ПереносИСФ_УстановитьПараметрыЗапросаПереносаДанных(Запрос, Объект)
	Запрос.УстановитьПараметр("СписокИСФ", Объект.ДокументыДляПереноса.Выгрузить().ВыгрузитьКолонку("ДокументДляПереноса"));
	Запрос.УстановитьПараметр("ПериодПереноса", Объект.НовыйПериодВО);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
КонецПроцедуры

#КонецОбласти

#Область СписаниеПлановыхРасходов
Функция ПолучитьТаблицуСписанияПлановыхРасходов(Параметры, АдресРезультата = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	ТекстШаблонаВТ_ВО = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПлановыеРасходы.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	|	ПлановыеРасходы.Сделка КАК Сделка,
	|	СУММА(ПлановыеРасходы.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТ_ПлановыеРасходыВО
	|ИЗ
	|	РегистрНакопления.ПлановыеРасходыВО КАК ПлановыеРасходы
	|ГДЕ
	|	ПлановыеРасходы.Период <= &ПериодСписания
	|	И ПлановыеРасходы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПлановыеРасходы.ИдентификаторСтрокиРасходов,
	|	ПлановыеРасходы.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПлановыеРасходыПриход.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	|	ПлановыеРасходыПриход.Сделка КАК сделка
	|ПОМЕСТИТЬ ВТ_ПлановыеРасходыПриходВО
	|ИЗ
	|	РегистрНакопления.ПлановыеРасходыВО КАК ПлановыеРасходыПриход
	|ГДЕ
	|	ПлановыеРасходыПриход.Период >= &НачалоПериодаВозникновенияОстатков
	|	И ПлановыеРасходыПриход.Период <= &КонецПериодаВозникновенияОстатков
	|	И ПлановыеРасходыПриход.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|;";
	ТекстШаблонаВТ_УУ = СтрЗаменить(ТекстШаблонаВТ_ВО, "ПлановыеРасходыВО", "ПлановыеРасходыУУ");
	ТекстШаблонаВТ_УУ = СтрЗаменить(ТекстШаблонаВТ_УУ, "ВТ_ПлановыеРасходыВО", "ВТ_ПлановыеРасходыУУ");
	ТекстШаблонаВТ_УУ = СтрЗаменить(ТекстШаблонаВТ_УУ, "ВТ_ПлановыеРасходыПриходВО", "ВТ_ПлановыеРасходыПриходУУ");
	
	ТекстШаблонаБезФакта = 
	"ВЫБРАТЬ
	|	ПлановыеРасходыОстатки.Организация КАК Организация,
	|	ПлановыеРасходыОстатки.Сделка КАК Сделка,
	|	ПлановыеРасходыОстатки.ЦФО КАК ЦФО,
	|	ПлановыеРасходыОстатки.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ПлановыеРасходыОстатки.Поставщик КАК Поставщик,
	|	ПлановыеРасходыОстатки.Договор КАК Договор,
	|	ПлановыеРасходыОстатки.Услуга КАК Услуга,
	|	ПлановыеРасходыОстатки.Вагон КАК Вагон,
	|	ПлановыеРасходыОстатки.Контейнер КАК Контейнер,
	|	ПлановыеРасходыОстатки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ПлановыеРасходыОстатки.ВидОперации КАК ВидОперации,
	|	ПлановыеРасходыОстатки.ТипОперации КАК ТипОперации,
	|	ПлановыеРасходыОстатки.СтавкаНДС КАК СтавкаНДС,
	|	ПлановыеРасходыОстатки.Валюта КАК Валюта,
	|	ПлановыеРасходыОстатки.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	|	ПлановыеРасходыОстатки.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	ПлановыеРасходыОстатки.Клиент КАК Клиент,
	|	ПлановыеРасходыОстатки.ДоговорКлиента КАК ДоговорКлиента,
	|	ПлановыеРасходыОстатки.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ПлановыеРасходыОстатки.Реализация КАК Реализация,
	|	ПлановыеРасходыОстатки.СуммаОстаток - ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаВО,
	|	ПлановыеРасходыОстатки.СуммаРубОстаток - ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаВОРуб,
	|	ПлановыеРасходыОстатки.СуммаОстаток - ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаУУ,
	|	ПлановыеРасходыОстатки.СуммаРубОстаток - ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаУУРуб,
	|	ПлановыеРасходыОстатки.СуммаОстаток КАК СуммаОстатокВО,
	|	ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаНДСОстатокВО,
	|	ПлановыеРасходыОстатки.СуммаРубОстаток КАК СуммаРубОстатокВО,
	|	ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаНДСРубОстатокВО,
	|	ПлановыеРасходыОстатки.СуммаОстаток КАК СуммаОстатокУУ,
	|	ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаНДСОстатокУУ,
	|	ПлановыеРасходыОстатки.СуммаРубОстаток КАК СуммаРубОстатокУУ,
	|	ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаНДСРубОстатокУУ
	|ПОМЕСТИТЬ ВТ_ТаблицыСписания
	|ИЗ
	|	РегистрНакопления.ПлановыеРасходыВО.Остатки(
	|			&ПериодСписания,
	|			Организация = &Организация
	// МальцевАН #84000 06.05.2024 Ticket#0348728
	//(
	|				И Услуга.НеСторнироватьПриСписанииПлановыхРасходов = ЛОЖЬ
	//) МальцевАН #84000 06.05.2024 Ticket#0348728 
	//МальцевАН #85313 15.05.2024 Ticket#0348728
	//(
	|				И НЕ ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидОперацииРасходов.ВнутренняяСебестоимость)) КАК ПлановыеРасходыОстатки
	//)
	//МальцевАН #85313 15.05.2024 Ticket#0348728
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлановыеРасходыВО КАК ПлановыеРасходы
	|		ПО ПлановыеРасходыОстатки.ИдентификаторСтрокиРасходов = ПлановыеРасходы.ИдентификаторСтрокиРасходов
	|			И ПлановыеРасходыОстатки.Сделка = ПлановыеРасходы.Сделка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПлановыеРасходыПриходВО КАК ПлановыеРасходыПриход
	|		ПО ПлановыеРасходыОстатки.ИдентификаторСтрокиРасходов = ПлановыеРасходыПриход.ИдентификаторСтрокиРасходов
	|			И ПлановыеРасходыОстатки.Сделка = ПлановыеРасходыПриход.Сделка
	|ГДЕ
	|	ПлановыеРасходы.ИдентификаторСтрокиРасходов ЕСТЬ NULL
	|	И ПлановыеРасходыОстатки.СуммаОстаток <> 0";
	
	ТекстШаблонаСЧастичнымФактом = 
	"ВЫБРАТЬ
	|	ПлановыеРасходыОстатки.Организация КАК Организация,
	|	ПлановыеРасходыОстатки.Сделка КАК Сделка,
	|	ПлановыеРасходыОстатки.ЦФО КАК ЦФО,
	|	ПлановыеРасходыОстатки.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ПлановыеРасходыОстатки.Поставщик КАК Поставщик,
	|	ПлановыеРасходыОстатки.Договор КАК Договор,
	|	ПлановыеРасходыОстатки.Услуга КАК Услуга,
	|	ПлановыеРасходыОстатки.Вагон КАК Вагон,
	|	ПлановыеРасходыОстатки.Контейнер КАК Контейнер,
	|	ПлановыеРасходыОстатки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ПлановыеРасходыОстатки.ВидОперации КАК ВидОперации,
	|	ПлановыеРасходыОстатки.ТипОперации КАК ТипОперации,
	|	ПлановыеРасходыОстатки.СтавкаНДС КАК СтавкаНДС,
	|	ПлановыеРасходыОстатки.Валюта КАК Валюта,
	|	ПлановыеРасходыОстатки.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	|	ПлановыеРасходыОстатки.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	ПлановыеРасходыОстатки.Клиент КАК Клиент,
	|	ПлановыеРасходыОстатки.ДоговорКлиента КАК ДоговорКлиента,
	|	ПлановыеРасходыОстатки.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ПлановыеРасходыОстатки.Реализация КАК Реализация,
	|	ПлановыеРасходыОстатки.СуммаОстаток - ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаВО,
	|	ПлановыеРасходыОстатки.СуммаРубОстаток - ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаВОРуб,
	|	ПлановыеРасходыОстатки.СуммаОстаток - ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаУУ,
	|	ПлановыеРасходыОстатки.СуммаРубОстаток - ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаУУРуб,
	|	ПлановыеРасходыОстатки.СуммаОстаток КАК СуммаОстатокВО,
	|	ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаНДСОстатокВО,
	|	ПлановыеРасходыОстатки.СуммаРубОстаток КАК СуммаРубОстатокВО,
	|	ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаНДСРубОстатокВО,
	|	ПлановыеРасходыОстатки.СуммаОстаток КАК СуммаОстатокУУ,
	|	ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаНДСОстатокУУ,
	|	ПлановыеРасходыОстатки.СуммаРубОстаток КАК СуммаРубОстатокУУ,
	|	ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаНДСРубОстатокУУ
	|ПОМЕСТИТЬ ВТ_ТаблицыСписания
	|ИЗ
	|	РегистрНакопления.ПлановыеРасходыВО.Остатки(
	|			&ПериодСписания,
	|			Организация = &Организация
	// МальцевАН #84000 06.05.2024 Ticket#0348728
	//(
	|				И Услуга.НеСторнироватьПриСписанииПлановыхРасходов = ЛОЖЬ
	//) МальцевАН #84000 06.05.2024 Ticket#0348728 
	//МальцевАН #85313 15.05.2024 Ticket#0348728
	//(
	|				И НЕ ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидОперацииРасходов.ВнутренняяСебестоимость)) КАК ПлановыеРасходыОстатки
	//)
	//МальцевАН #85313 15.05.2024 Ticket#0348728
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПлановыеРасходыВО КАК ПлановыеРасходы
	|		ПО ПлановыеРасходыОстатки.ИдентификаторСтрокиРасходов = ПлановыеРасходы.ИдентификаторСтрокиРасходов
	|			И ПлановыеРасходыОстатки.Сделка = ПлановыеРасходы.Сделка
	|			И (ПлановыеРасходы.Сумма <> 0)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПлановыеРасходыПриходВО КАК ПлановыеРасходыПриход
	|		ПО ПлановыеРасходыОстатки.ИдентификаторСтрокиРасходов = ПлановыеРасходыПриход.ИдентификаторСтрокиРасходов
	|			И ПлановыеРасходыОстатки.Сделка = ПлановыеРасходыПриход.Сделка
	|ГДЕ
	|	ПлановыеРасходыОстатки.СуммаОстаток <> 0";
		
	ТекстЗапроса = "";
	ЕстьОбъединение = Ложь;
	Если Параметры.ВО Тогда            
		Если Параметры.СторноПланаБезФакта Тогда 
			ТекстЗапроса = СтрЗаменить(ТекстШаблонаБезФакта, "ПлановыеРасходыОстатки.СуммаОстаток - ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаУУ", "0 КАК СуммаУУ");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПлановыеРасходыОстатки.СуммаРубОстаток - ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаУУРуб", "0 КАК СуммаУУРуб");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПлановыеРасходыОстатки.СуммаОстаток КАК СуммаОстатокУУ", "0 КАК СуммаОстатокУУ");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаНДСОстатокУУ", "0 КАК СуммаНДСОстатокУУ");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПлановыеРасходыОстатки.СуммаРубОстаток КАК СуммаРубОстатокУУ", "0 КАК СуммаРубОстатокУУ");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаНДСРубОстатокУУ", "0 КАК СуммаНДСРубОстатокУУ");
		КонецЕсли;
		Если Параметры.СторноПланаБезФакта И Параметры.СторноПланаСЧастичнымФактом Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|  ОБЪЕДИНИТЬ ВСЕ"; 
			ЕстьОбъединение = Истина;
		КонецЕсли;
		Если Параметры.СторноПланаСЧастичнымФактом Тогда
			ТекстЗапросаСторноПланаСЧастичнымФактом = СтрЗаменить(ТекстШаблонаСЧастичнымФактом, "ПлановыеРасходыОстатки.СуммаОстаток - ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаУУ", "0 КАК СуммаУУ");
			ТекстЗапросаСторноПланаСЧастичнымФактом = СтрЗаменить(ТекстЗапросаСторноПланаСЧастичнымФактом, "ПлановыеРасходыОстатки.СуммаРубОстаток - ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаУУРуб", "0 КАК СуммаУУРуб");
			ТекстЗапросаСторноПланаСЧастичнымФактом = СтрЗаменить(ТекстЗапросаСторноПланаСЧастичнымФактом, "ПлановыеРасходыОстатки.СуммаОстаток КАК СуммаОстатокУУ", "0 КАК СуммаОстатокУУ");
			ТекстЗапросаСторноПланаСЧастичнымФактом = СтрЗаменить(ТекстЗапросаСторноПланаСЧастичнымФактом, "ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаНДСОстатокУУ", "0 КАК СуммаНДСОстатокУУ");
			ТекстЗапросаСторноПланаСЧастичнымФактом = СтрЗаменить(ТекстЗапросаСторноПланаСЧастичнымФактом, "ПлановыеРасходыОстатки.СуммаРубОстаток КАК СуммаРубОстатокУУ", "0 КАК СуммаРубОстатокУУ");
			ТекстЗапросаСторноПланаСЧастичнымФактом = СтрЗаменить(ТекстЗапросаСторноПланаСЧастичнымФактом, "ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаНДСРубОстатокУУ", "0 КАК СуммаНДСРубОстатокУУ");
		КонецЕсли;
		Если ЕстьОбъединение Тогда
			ТекстЗапросаСторноПланаСЧастичнымФактом = СтрЗаменить(ТекстЗапросаСторноПланаСЧастичнымФактом, "ПОМЕСТИТЬ ВТ_ТаблицыСписания", "");
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|"+ТекстЗапросаСторноПланаСЧастичнымФактом;
	КонецЕсли;
	Если Параметры.ВО И Параметры.УУ Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|  ОБЪЕДИНИТЬ ВСЕ";  
		ЕстьОбъединение = Истина;
	КонецЕсли;
	Если Параметры.УУ Тогда
		ТекстШаблонаУУБезФакта = ТекстШаблонаБезФакта;
		Если Параметры.СторноПланаБезФакта Тогда
			ТекстЗапросаУУБезФакта = СтрЗаменить(ТекстШаблонаУУБезФакта, "ПлановыеРасходыВО", "ПлановыеРасходыУУ");
			ТекстЗапросаУУБезФакта = СтрЗаменить(ТекстЗапросаУУБезФакта, "ПлановыеРасходыОстатки.СуммаОстаток - ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаВО", "0 КАК СуммаВО");
			ТекстЗапросаУУБезФакта = СтрЗаменить(ТекстЗапросаУУБезФакта, "ПлановыеРасходыОстатки.СуммаРубОстаток - ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаВОРуб", "0 КАК СуммаВОРуб");
			ТекстЗапросаУУБезФакта = СтрЗаменить(ТекстЗапросаУУБезФакта, "ПлановыеРасходыОстатки.СуммаОстаток КАК СуммаОстатокВО", "0 КАК СуммаОстатокВО");
			ТекстЗапросаУУБезФакта = СтрЗаменить(ТекстЗапросаУУБезФакта, "ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаНДСОстатокВО", "0 КАК СуммаНДСОстатокВО");
			ТекстЗапросаУУБезФакта = СтрЗаменить(ТекстЗапросаУУБезФакта, "ПлановыеРасходыОстатки.СуммаРубОстаток КАК СуммаРубОстатокВО", "0 КАК СуммаРубОстатокВО");
			ТекстЗапросаУУБезФакта = СтрЗаменить(ТекстЗапросаУУБезФакта, "ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаНДСРубОстатокВО", "0 КАК СуммаНДСРубОстатокВО");
			Если ЕстьОбъединение Тогда
				ТекстЗапросаУУБезФакта = СтрЗаменить(ТекстЗапросаУУБезФакта, "ПОМЕСТИТЬ ВТ_ТаблицыСписания", "");
			КонецЕсли;
			ТекстЗапроса = ТекстЗапроса + "
			|"+ТекстЗапросаУУБезФакта;
		КонецЕсли;
		Если Параметры.СторноПланаБезФакта И Параметры.СторноПланаСЧастичнымФактом Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|  ОБЪЕДИНИТЬ ВСЕ";  
			ЕстьОбъединение = Истина;
		КонецЕсли;
		Если Параметры.СторноПланаСЧастичнымФактом Тогда
			ТекстЗапросаУУСЧастичнымФактом = СтрЗаменить(ТекстШаблонаСЧастичнымФактом, "ПлановыеРасходыВО", "ПлановыеРасходыУУ");
			ТекстЗапросаУУСЧастичнымФактом = СтрЗаменить(ТекстЗапросаУУСЧастичнымФактом, "ВТ_ПлановыеРасходыВО", "ВТ_ПлановыеРасходыУУ");
			ТекстЗапросаУУСЧастичнымФактом = СтрЗаменить(ТекстЗапросаУУСЧастичнымФактом, "ВТ_ПлановыеРасходыПриходВО", "ВТ_ПлановыеРасходыПриходУУ");
			ТекстЗапросаУУСЧастичнымФактом = СтрЗаменить(ТекстЗапросаУУСЧастичнымФактом, "ПлановыеРасходыОстатки.СуммаОстаток - ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаВО", "0 КАК СуммаВО");
			ТекстЗапросаУУСЧастичнымФактом = СтрЗаменить(ТекстЗапросаУУСЧастичнымФактом, "ПлановыеРасходыОстатки.СуммаРубОстаток - ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаВОРуб", "0 КАК СуммаВОРуб");
			ТекстЗапросаУУСЧастичнымФактом = СтрЗаменить(ТекстЗапросаУУСЧастичнымФактом, "ПлановыеРасходыОстатки.СуммаОстаток КАК СуммаОстатокВО", "0 КАК СуммаОстатокВО");
			ТекстЗапросаУУСЧастичнымФактом = СтрЗаменить(ТекстЗапросаУУСЧастичнымФактом, "ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаНДСОстатокВО", "0 КАК СуммаНДСОстатокВО");
			ТекстЗапросаУУСЧастичнымФактом = СтрЗаменить(ТекстЗапросаУУСЧастичнымФактом, "ПлановыеРасходыОстатки.СуммаРубОстаток КАК СуммаРубОстатокВО", "0 КАК СуммаРубОстатокВО");
			ТекстЗапросаУУСЧастичнымФактом = СтрЗаменить(ТекстЗапросаУУСЧастичнымФактом, "ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаНДСРубОстатокВО", "0 КАК СуммаНДСРубОстатокВО");
			Если ЕстьОбъединение Тогда
				ТекстЗапросаУУСЧастичнымФактом = СтрЗаменить(ТекстЗапросаУУСЧастичнымФактом, "ПОМЕСТИТЬ ВТ_ТаблицыСписания", "");
			КонецЕсли;
			ТекстЗапроса = ТекстЗапроса + "
			|"+ТекстЗапросаУУСЧастичнымФактом;
		КонецЕсли;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + ";
	|////////////////////////////////////////////////////////////////////////////////";
	ТекстЗапроса = ТекстЗапроса + 
	"
	|ВЫБРАТЬ
	|	ВТ_ТаблицыСписания.Организация КАК Организация,
	|	ВТ_ТаблицыСписания.Сделка КАК Сделка,
	|	ВТ_ТаблицыСписания.ЦФО КАК ЦФО,
	|	ВТ_ТаблицыСписания.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ВТ_ТаблицыСписания.Поставщик КАК Поставщик,
	|	ВТ_ТаблицыСписания.Договор КАК Договор,
	|	ВТ_ТаблицыСписания.Услуга КАК Услуга,
	|	ВТ_ТаблицыСписания.Вагон КАК Вагон,
	|	ВТ_ТаблицыСписания.Контейнер КАК Контейнер,
	|	ВТ_ТаблицыСписания.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ВТ_ТаблицыСписания.ВидОперации КАК ВидОперации,
	|	ВТ_ТаблицыСписания.ТипОперации КАК ТипОперации,
	|	ВТ_ТаблицыСписания.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_ТаблицыСписания.Валюта КАК Валюта,
	|	ВТ_ТаблицыСписания.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	|	ВТ_ТаблицыСписания.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	ВТ_ТаблицыСписания.Клиент КАК Клиент,
	|	ВТ_ТаблицыСписания.ДоговорКлиента КАК ДоговорКлиента,
	|	ВТ_ТаблицыСписания.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ВТ_ТаблицыСписания.Реализация КАК Реализация,
	|	ВТ_ТаблицыСписания.СуммаВО КАК СуммаВО,
	|	ВТ_ТаблицыСписания.СуммаВОРуб КАК СуммаВОРуб,
	|	ВТ_ТаблицыСписания.СуммаУУ КАК СуммаУУ,
	|	ВТ_ТаблицыСписания.СуммаУУРуб КАК СуммаУУРуб,
	|	ВТ_ТаблицыСписания.СуммаОстатокВО КАК СуммаОстатокВО,
	|	ВТ_ТаблицыСписания.СуммаНДСОстатокВО КАК СуммаНДСОстатокВО,
	|	ВТ_ТаблицыСписания.СуммаРубОстатокВО КАК СуммаРубОстатокВО,
	|	ВТ_ТаблицыСписания.СуммаНДСРубОстатокВО КАК СуммаНДСРубОстатокВО,
	|	ВТ_ТаблицыСписания.СуммаОстатокУУ КАК СуммаОстатокУУ,
	|	ВТ_ТаблицыСписания.СуммаНДСОстатокУУ КАК СуммаНДСОстатокУУ,
	|	ВТ_ТаблицыСписания.СуммаРубОстатокУУ КАК СуммаРубОстатокУУ,
	|	ВТ_ТаблицыСписания.СуммаНДСРубОстатокУУ КАК СуммаНДСРубОстатокУУ
	|ИЗ
	|	ВТ_ТаблицыСписания КАК ВТ_ТаблицыСписания"; 
	Если Параметры.ВО Тогда
		ТекстЗапроса = ТекстШаблонаВТ_ВО + ТекстЗапроса;
	КонецЕсли;
	Если Параметры.УУ Тогда
		ТекстЗапроса = ТекстШаблонаВТ_УУ + ТекстЗапроса;
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("НачалоПериодаВозникновенияОстатков", НачалоДня(Параметры.НачалоПериодаВозникновенияОстатков));
	Запрос.УстановитьПараметр("КонецПериодаВозникновенияОстатков", КонецДня(Параметры.ОкончаниеПериодаВозникновенияОстатков));
	Запрос.УстановитьПараметр("ПериодСписания", КонецМесяца(Параметры.ПериодСписания));
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ТаблицаСписания = Неопределено;
	Иначе
		ТаблицаСписания = РезультатЗапроса.Выгрузить();
	КонецЕсли;                                         
	ПоместитьВоВременноеХранилище(ТаблицаСписания, АдресРезультата);
	
КонецФункции

Процедура Списание_СформироватьДвиженияРасходы(Объект) Экспорт

	АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено);
	ПолучитьТаблицуСписанияПлановыхРасходов(Объект, АдресРезультата);
	ТаблицаСписания = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Списание_СформироватьДвиженияПлановыеРасходы(Объект, ТаблицаСписания);
	//Списание_СформироватьДвиженияФиксацияИзмененияПлановыхРасходовВО(Объект);
	
КонецПроцедуры

Процедура Списание_СформироватьДвиженияПлановыеРасходы(Объект, ТаблицаСписания)
	
	Объект.Движения.ПлановыеРасходыВО.Очистить();
	Объект.Движения.ПлановыеРасходыВО.Записать();
	Объект.Движения.ПлановыеРасходыУУ.Очистить();
	Объект.Движения.ПлановыеРасходыУУ.Записать();
	Если Объект.ВО Тогда
		Объект.Движения.ПлановыеРасходыВО.Записывать = Истина;
	КонецЕсли;
	Если Объект.УУ Тогда
		Объект.Движения.ПлановыеРасходыУУ.Записывать = Истина;
	КонецЕсли;                                                
	Для каждого СтрокаСписания Из ТаблицаСписания Цикл

		Если Объект.ВО 
			И СтрокаСписания.СуммаОстатокВО <> 0 Тогда
			ДвижениеВО = Объект.Движения.ПлановыеРасходыВО.ДобавитьРасход();
			ЗаполнитьЗначенияСвойств(ДвижениеВО, СтрокаСписания);
			ДвижениеВО.Период = НачалоМесяца(Объект.ПериодСписания);
			ДвижениеВО.Сумма = СтрокаСписания.СуммаОстатокВО;
			ДвижениеВО.СуммаНДС = СтрокаСписания.СуммаНДСОстатокВО;
			ДвижениеВО.СуммаРуб = СтрокаСписания.СуммаРубОстатокВО;
			ДвижениеВО.СуммаНДСРуб = СтрокаСписания.СуммаНДСРубОстатокВО;
			ДвижениеВО.Списание = Истина;
		КонецЕсли;

		Если Объект.УУ 
			И СтрокаСписания.СуммаОстатокУУ <> 0 Тогда
			ДвижениеУУ = Объект.Движения.ПлановыеРасходыУУ.ДобавитьРасход();
			ЗаполнитьЗначенияСвойств(ДвижениеУУ, СтрокаСписания);
			ДвижениеУУ.Период = НачалоМесяца(Объект.ПериодСписания);
			ДвижениеУУ.Сумма = СтрокаСписания.СуммаОстатокУУ;
			ДвижениеУУ.СуммаНДС = СтрокаСписания.СуммаНДСОстатокУУ;
			ДвижениеУУ.СуммаРуб = СтрокаСписания.СуммаРубОстатокУУ;
			ДвижениеУУ.СуммаНДСРуб = СтрокаСписания.СуммаНДСРубОстатокУУ;
			ДвижениеУУ.Списание = Истина;
		КонецЕсли;
		
	КонецЦикла;
	Если Объект.ВО Тогда
		Объект.Движения.ПлановыеРасходыВО.Записать();
	КонецЕсли;
	Если Объект.УУ Тогда
		Объект.Движения.ПлановыеРасходыУУ.Записать();
	КонецЕсли;                                                
	
КонецПроцедуры

Процедура Списание_СформироватьДвиженияФиксацияИзмененияПлановыхРасходовВО(Объект)
	
	Объект.Движения.ФиксацияИзмененияПлановыхРасходовВО.Очистить();
	Объект.Движения.ФиксацияИзмененияПлановыхРасходовВО.Записать();
	Запрос = Новый Запрос;
	Запрос.Текст = Списание_ПолучитьТекстЗапросаФиксацииИзменения("ПлановыеРасходыВО");
	Списание_УстановитьПараметрыЗапросаФиксацииИзменений(Запрос, Объект);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	Объект.Движения.ФиксацияИзмененияПлановыхРасходовВО.Записывать = Истина;
	Объект.Движения.ФиксацияИзмененияПлановыхРасходовВО.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

Функция Списание_ПолучитьТекстЗапросаФиксацииИзменения(ТипДвижений)
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПлановыеРасходыВО.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	|	ИСТИНА КАК ЕстьСписание
	|ПОМЕСТИТЬ ВТ_СписанныеПлановыеРасходы
	|ИЗ
	|	РегистрНакопления.ПлановыеРасходыВО КАК ПлановыеРасходыВО
	|ГДЕ
	|	ПлановыеРасходыВО.Списание
	|	И ПлановыеРасходыВО.Период <= &КонецПериодаПлановыхРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлановыеРасходыВООстатки.Организация КАК Организация,
	|	ПлановыеРасходыВООстатки.Сделка КАК Сделка,
	|	ПлановыеРасходыВООстатки.ЦФО КАК ЦФО,
	|	ПлановыеРасходыВООстатки.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ПлановыеРасходыВООстатки.Поставщик КАК Поставщик,
	|	ПлановыеРасходыВООстатки.Договор КАК Договор,
	|	ПлановыеРасходыВООстатки.Услуга КАК Услуга,
	|	ПлановыеРасходыВООстатки.Вагон КАК Вагон,
	|	ПлановыеРасходыВООстатки.Контейнер КАК Контейнер,
	|	ПлановыеРасходыВООстатки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ПлановыеРасходыВООстатки.ВидОперации КАК ВидОперации,
	|	ПлановыеРасходыВООстатки.ТипОперации КАК ТипОперации,
	|	ПлановыеРасходыВООстатки.СтавкаНДС КАК СтавкаНДС,
	|	ПлановыеРасходыВООстатки.Валюта КАК Валюта,
	|	ПлановыеРасходыВООстатки.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	ПлановыеРасходыВООстатки.СуммаОстаток КАК СуммаОстаток,
	|	ПлановыеРасходыВООстатки.СуммаНДСОстаток КАК СуммаНДСОстаток,
	|	ПлановыеРасходыВООстатки.СуммаРубОстаток КАК СуммаРубОстаток,
	|	ПлановыеРасходыВООстатки.СуммаНДСРубОстаток КАК СуммаНДСРубОстаток,
	|	ПлановыеРасходыВООстатки.Клиент КАК Клиент,
	|	ПлановыеРасходыВООстатки.ДоговорКлиента КАК ДоговорКлиента,
	|	ПлановыеРасходыВООстатки.Реализация КАК Реализация,
	|	ПлановыеРасходыВООстатки.ДатаКурсаВалюты КАК ДатаКурсаВалюты
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрНакопления.ПлановыеРасходыВО.Остатки(
	|			&КонецПериодаПлановыхРасходов,
	// МальцевАН #84000 06.05.2024 Ticket#0348728
	//(
	|			Услуга.НеСторнироватьПриСписанииПлановыхРасходов = ЛОЖЬ
	//) МальцевАН #84000 06.05.2024 Ticket#0348728
	//МальцевАН #85313 15.05.2024 Ticket#0348728
	//(
	|				И НЕ ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидОперацииРасходов.ВнутренняяСебестоимость)) КАК ПлановыеРасходыВООстатки
	//)
	//МальцевАН #85313 15.05.2024 Ticket#0348728
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СписанныеПлановыеРасходы КАК ВТ_СписанныеПлановыеРасходы
	|		ПО ПлановыеРасходыВООстатки.ИдентификаторСтрокиРасходов = ВТ_СписанныеПлановыеРасходы.ИдентификаторСтрокиРасходов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.Организация,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.Сделка,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.ЦФО,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.ИдентификаторСУЕ,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.Поставщик,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.Договор,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.Услуга,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.Вагон,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.Контейнер,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.НоменклатурнаяГруппа,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.ВидОперации,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.ТипОперации,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.СтавкаНДС,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.Валюта,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.ПлановыеРасходыПоЖДН,
	|	-ФиксацияИзмененияПлановыхРасходовВООбороты.СуммаОборот,
	|	-ФиксацияИзмененияПлановыхРасходовВООбороты.СуммаНДСОборот,
	|	-ФиксацияИзмененияПлановыхРасходовВООбороты.СуммаРубОборот,
	|	-ФиксацияИзмененияПлановыхРасходовВООбороты.СуммаНДСРубОборот,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.Клиент,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.ДоговорКлиента,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.Реализация,
	|	ФиксацияИзмененияПлановыхРасходовВООбороты.ДатаКурсаВалюты
	|ИЗ
	|	РегистрНакопления.ФиксацияИзмененияПлановыхРасходовВО.Обороты(
	|			,
	|			&КонецПериодаЗафиксированныхРасходов,
	|			,
	// МальцевАН #84000 06.05.2024 Ticket#0348728
	//(
	|			Услуга.НеСторнироватьПриСписанииПлановыхРасходов = ЛОЖЬ
	//) МальцевАН #84000 06.05.2024 Ticket#0348728
	//МальцевАН #85313 15.05.2024 Ticket#0348728
	//(
	|				И НЕ ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидОперацииРасходов.ВнутренняяСебестоимость)) КАК ФиксацияИзмененияПлановыхРасходовВООбороты
	//)
	//МальцевАН #85313 15.05.2024 Ticket#0348728
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ФиксацияИзмененияПлановыхРасходовВО КАК ФиксацияИзмененияПлановыхРасходовВО
	|		ПО (ФиксацияИзмененияПлановыхРасходовВО.ИдентификаторСУЕ = ФиксацияИзмененияПлановыхРасходовВООбороты.ИдентификаторСУЕ)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Организация = ФиксацияИзмененияПлановыхРасходовВООбороты.Организация)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Сделка = ФиксацияИзмененияПлановыхРасходовВООбороты.Сделка)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.ЦФО = ФиксацияИзмененияПлановыхРасходовВООбороты.ЦФО)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Поставщик = ФиксацияИзмененияПлановыхРасходовВООбороты.Поставщик)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Договор = ФиксацияИзмененияПлановыхРасходовВООбороты.Договор)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Услуга = ФиксацияИзмененияПлановыхРасходовВООбороты.Услуга)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Вагон = ФиксацияИзмененияПлановыхРасходовВООбороты.Вагон)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Контейнер = ФиксацияИзмененияПлановыхРасходовВООбороты.Контейнер)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.НоменклатурнаяГруппа = ФиксацияИзмененияПлановыхРасходовВООбороты.НоменклатурнаяГруппа)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.ВидОперации = ФиксацияИзмененияПлановыхРасходовВООбороты.ВидОперации)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.ТипОперации = ФиксацияИзмененияПлановыхРасходовВООбороты.ТипОперации)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.СтавкаНДС = ФиксацияИзмененияПлановыхРасходовВООбороты.СтавкаНДС)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Валюта = ФиксацияИзмененияПлановыхРасходовВООбороты.Валюта)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.ПлановыеРасходыПоЖДН = ФиксацияИзмененияПлановыхРасходовВООбороты.ПлановыеРасходыПоЖДН)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Клиент = ФиксацияИзмененияПлановыхРасходовВООбороты.Клиент)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.ДоговорКлиента = ФиксацияИзмененияПлановыхРасходовВООбороты.ДоговорКлиента)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.ДатаКурсаВалюты = ФиксацияИзмененияПлановыхРасходовВООбороты.ДатаКурсаВалюты)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Реализация = ФиксацияИзмененияПлановыхРасходовВООбороты.Реализация)
	|			И (ФиксацияИзмененияПлановыхРасходовВО.Регистратор ССЫЛКА Документ.СписаниеПлановыхРасходов)
	|ГДЕ
	//Евросиб Каблов 04.03.2024 ( #81836
	//|	НЕ ФиксацияИзмененияПлановыхРасходовВО.ИдентификаторСУЕ ЕСТЬ NULL
	|	ФиксацияИзмененияПлановыхРасходовВО.ИдентификаторСУЕ ЕСТЬ NULL
	//Евросиб Каблов 04.03.2024 )
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПериодФиксации КАК Период,
	|	ВТ.Организация КАК Организация,
	|	ВТ.Сделка КАК Сделка,
	|	ВТ.ЦФО КАК ЦФО,
	|	ВТ.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ВТ.Поставщик КАК Поставщик,
	|	ВТ.Договор КАК Договор,
	|	ВТ.Услуга КАК Услуга,
	|	ВТ.Вагон КАК Вагон,
	|	ВТ.Контейнер КАК Контейнер,
	|	ВТ.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ВТ.ВидОперации КАК ВидОперации,
	|	ВТ.ТипОперации КАК ТипОперации,
	|	ВТ.СтавкаНДС КАК СтавкаНДС,
	|	ВТ.Валюта КАК Валюта,
	|	ВТ.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	СУММА(ВТ.СуммаОстаток) КАК Сумма,
	|	СУММА(ВТ.СуммаНДСОстаток) КАК СуммаНДС,
	|	СУММА(ВТ.СуммаРубОстаток) КАК СуммаРуб,
	|	СУММА(ВТ.СуммаНДСРубОстаток) КАК СуммаНДСРуб,
	|	ВТ.Клиент КАК Клиент,
	|	ВТ.ДоговорКлиента КАК ДоговорКлиента,
	|	ВТ.Реализация КАК Реализация,
	|	ВТ.ДатаКурсаВалюты КАК ДатаКурсаВалюты
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ТипОперации,
	|	ВТ.ВидОперации,
	|	ВТ.Услуга,
	|	ВТ.Договор,
	|	ВТ.Контейнер,
	|	ВТ.ПлановыеРасходыПоЖДН,
	|	ВТ.СтавкаНДС,
	|	ВТ.Поставщик,
	|	ВТ.НоменклатурнаяГруппа,
	|	ВТ.Вагон,
	|	ВТ.Валюта,
	|	ВТ.ЦФО,
	|	ВТ.ИдентификаторСУЕ,
	|	ВТ.Организация,
	|	ВТ.Сделка,
	|	ВТ.Клиент,
	|	ВТ.ДоговорКлиента,
	|	ВТ.Реализация,
	|	ВТ.ДатаКурсаВалюты
	|
	|ИМЕЮЩИЕ
	|	НЕ(СУММА(ВТ.СуммаОстаток) = 0
	|			И СУММА(ВТ.СуммаНДСОстаток) = 0
	|			И СУММА(ВТ.СуммаРубОстаток) = 0
	|			И СУММА(ВТ.СуммаНДСРубОстаток) = 0)";
	Возврат ТекстЗапроса;
		
КонецФункции

//Евросиб Каблов 06.11.2025 #107942
Функция ПолучитьТаблицуСписанияПлановыхРасходовПолныйФакт(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	
	ТекстШаблонаВТ_ВО = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПлановыеРасходы.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	|	ПлановыеРасходы.Сделка КАК Сделка,
	|	СУММА(ПлановыеРасходы.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТ_ПлановыеРасходы
	|ИЗ
	|	РегистрНакопления.ПлановыеРасходыВОПолныйФакт КАК ПлановыеРасходы
	|ГДЕ
	|	ПлановыеРасходы.Период <= &ПериодСписания
	|	И ПлановыеРасходы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПлановыеРасходы.ИдентификаторСтрокиРасходов,
	|	ПлановыеРасходы.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПлановыеРасходыПриход.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	|	ПлановыеРасходыПриход.Сделка КАК сделка
	|ПОМЕСТИТЬ ВТ_ПлановыеРасходыПриход
	|ИЗ
	|	РегистрНакопления.ПлановыеРасходыВОПолныйФакт КАК ПлановыеРасходыПриход
	|ГДЕ
	|	ПлановыеРасходыПриход.Период >= &НачалоПериодаВозникновенияОстатков
	|	И ПлановыеРасходыПриход.Период <= &КонецПериодаВозникновенияОстатков
	|	И ПлановыеРасходыПриход.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|;";
	ТекстШаблонаВТ_УУ = СтрЗаменить(ТекстШаблонаВТ_ВО, "ПлановыеРасходыВО", "ПлановыеРасходыУУ");
	ТекстШаблонаВТ_УУ = СтрЗаменить(ТекстШаблонаВТ_УУ, "ВТ_ПлановыеРасходы", "ВТ_ПлановыеРасходыУУ");
	ТекстШаблонаВТ_УУ = СтрЗаменить(ТекстШаблонаВТ_УУ, "ВТ_ПлановыеРасходыПриход", "ВТ_ПлановыеРасходыПриходУУ");
	
	ТекстШаблонаВТ_ВО = СтрЗаменить(ТекстШаблонаВТ_ВО, "ПлановыеРасходыВО", "ПлановыеРасходыВОПолныйФакт");
	ТекстШаблонаВТ_ВО = СтрЗаменить(ТекстШаблонаВТ_ВО, "ВТ_ПлановыеРасходы", "ВТ_ПлановыеРасходыВОПолныйФакт");
	ТекстШаблонаВТ_ВО = СтрЗаменить(ТекстШаблонаВТ_ВО, "ВТ_ПлановыеРасходыПриход", "ВТ_ПлановыеРасходыВОПолныйФакт");	
	
	ТекстШаблонаБезФакта = 
	"ВЫБРАТЬ
	|	ПлановыеРасходыОстатки.Организация КАК Организация,
	|	ПлановыеРасходыОстатки.Сделка КАК Сделка,
	|	ПлановыеРасходыОстатки.ЦФО КАК ЦФО,
	|	ПлановыеРасходыОстатки.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ПлановыеРасходыОстатки.Поставщик КАК Поставщик,
	|	ПлановыеРасходыОстатки.Договор КАК Договор,
	|	ПлановыеРасходыОстатки.Услуга КАК Услуга,
	|	ПлановыеРасходыОстатки.Вагон КАК Вагон,
	|	ПлановыеРасходыОстатки.Контейнер КАК Контейнер,
	|	ПлановыеРасходыОстатки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ПлановыеРасходыОстатки.ВидОперации КАК ВидОперации,
	|	ПлановыеРасходыОстатки.ТипОперации КАК ТипОперации,
	|	ПлановыеРасходыОстатки.СтавкаНДС КАК СтавкаНДС,
	|	ПлановыеРасходыОстатки.Валюта КАК Валюта,
	|	ПлановыеРасходыОстатки.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	|	ПлановыеРасходыОстатки.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	ПлановыеРасходыОстатки.Клиент КАК Клиент,
	|	ПлановыеРасходыОстатки.ДоговорКлиента КАК ДоговорКлиента,
	|	ПлановыеРасходыОстатки.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ПлановыеРасходыОстатки.Реализация КАК Реализация,
	//Евросиб Каблов 05.03.2026 ( #126776
	|	ПлановыеРасходыОстатки.ИсключатьИзУФД КАК ИсключатьИзУФД,
	//Евросиб Каблов 05.03.2026
	|	ПлановыеРасходыОстатки.СуммаОстаток - ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаВО,
	|	ПлановыеРасходыОстатки.СуммаРубОстаток - ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаВОРуб,
	|	ПлановыеРасходыОстатки.СуммаОстаток - ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаУУ,
	|	ПлановыеРасходыОстатки.СуммаРубОстаток - ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаУУРуб,
	|	ПлановыеРасходыОстатки.СуммаОстаток КАК СуммаОстатокВО,
	|	ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаНДСОстатокВО,
	|	ПлановыеРасходыОстатки.СуммаРубОстаток КАК СуммаРубОстатокВО,
	|	ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаНДСРубОстатокВО,
	|	ПлановыеРасходыОстатки.СуммаОстаток КАК СуммаОстатокУУ,
	|	ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаНДСОстатокУУ,
	|	ПлановыеРасходыОстатки.СуммаРубОстаток КАК СуммаРубОстатокУУ,
	|	ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаНДСРубОстатокУУ
	|ПОМЕСТИТЬ ВТ_ТаблицыСписания
	|ИЗ
	|	РегистрНакопления.ПлановыеРасходыВОПолныйФакт.Остатки(
	|			&ПериодСписания,
	|			Организация = &Организация
	|				И Услуга.НеСторнироватьПриСписанииПлановыхРасходов = ЛОЖЬ
	|				И НЕ ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидОперацииРасходов.ВнутренняяСебестоимость)) КАК ПлановыеРасходыОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлановыеРасходы КАК ПлановыеРасходы
	|		ПО ПлановыеРасходыОстатки.ИдентификаторСтрокиРасходов = ПлановыеРасходы.ИдентификаторСтрокиРасходов
	|			И ПлановыеРасходыОстатки.Сделка = ПлановыеРасходы.Сделка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПлановыеРасходыПриход КАК ПлановыеРасходыПриход
	|		ПО ПлановыеРасходыОстатки.ИдентификаторСтрокиРасходов = ПлановыеРасходыПриход.ИдентификаторСтрокиРасходов
	|			И ПлановыеРасходыОстатки.Сделка = ПлановыеРасходыПриход.Сделка
	|ГДЕ
	|	ПлановыеРасходы.ИдентификаторСтрокиРасходов ЕСТЬ NULL
	|	И ПлановыеРасходыОстатки.СуммаОстаток <> 0";
	
	ТекстШаблонаСЧастичнымФактом = 
	"ВЫБРАТЬ
	|	ПлановыеРасходыОстатки.Организация КАК Организация,
	|	ПлановыеРасходыОстатки.Сделка КАК Сделка,
	|	ПлановыеРасходыОстатки.ЦФО КАК ЦФО,
	|	ПлановыеРасходыОстатки.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ПлановыеРасходыОстатки.Поставщик КАК Поставщик,
	|	ПлановыеРасходыОстатки.Договор КАК Договор,
	|	ПлановыеРасходыОстатки.Услуга КАК Услуга,
	|	ПлановыеРасходыОстатки.Вагон КАК Вагон,
	|	ПлановыеРасходыОстатки.Контейнер КАК Контейнер,
	|	ПлановыеРасходыОстатки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ПлановыеРасходыОстатки.ВидОперации КАК ВидОперации,
	|	ПлановыеРасходыОстатки.ТипОперации КАК ТипОперации,
	|	ПлановыеРасходыОстатки.СтавкаНДС КАК СтавкаНДС,
	|	ПлановыеРасходыОстатки.Валюта КАК Валюта,
	|	ПлановыеРасходыОстатки.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	|	ПлановыеРасходыОстатки.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	ПлановыеРасходыОстатки.Клиент КАК Клиент,
	|	ПлановыеРасходыОстатки.ДоговорКлиента КАК ДоговорКлиента,
	|	ПлановыеРасходыОстатки.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ПлановыеРасходыОстатки.Реализация КАК Реализация,
	//Евросиб Каблов 05.03.2026 ( #126776
	|	ПлановыеРасходыОстатки.ИсключатьИзУФД КАК ИсключатьИзУФД,
	//Евросиб Каблов 05.03.2026
	|	ПлановыеРасходыОстатки.СуммаОстаток - ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаВО,
	|	ПлановыеРасходыОстатки.СуммаРубОстаток - ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаВОРуб,
	|	ПлановыеРасходыОстатки.СуммаОстаток - ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаУУ,
	|	ПлановыеРасходыОстатки.СуммаРубОстаток - ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаУУРуб,
	|	ПлановыеРасходыОстатки.СуммаОстаток КАК СуммаОстатокВО,
	|	ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаНДСОстатокВО,
	|	ПлановыеРасходыОстатки.СуммаРубОстаток КАК СуммаРубОстатокВО,
	|	ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаНДСРубОстатокВО,
	|	ПлановыеРасходыОстатки.СуммаОстаток КАК СуммаОстатокУУ,
	|	ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаНДСОстатокУУ,
	|	ПлановыеРасходыОстатки.СуммаРубОстаток КАК СуммаРубОстатокУУ,
	|	ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаНДСРубОстатокУУ
	|ПОМЕСТИТЬ ВТ_ТаблицыСписания
	|ИЗ
	|	РегистрНакопления.ПлановыеРасходыВОПолныйФакт.Остатки(
	|			&ПериодСписания,
	|			Организация = &Организация
	|				И Услуга.НеСторнироватьПриСписанииПлановыхРасходов = ЛОЖЬ
	|				И НЕ ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидОперацииРасходов.ВнутренняяСебестоимость)) КАК ПлановыеРасходыОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПлановыеРасходы КАК ПлановыеРасходы
	|		ПО ПлановыеРасходыОстатки.ИдентификаторСтрокиРасходов = ПлановыеРасходы.ИдентификаторСтрокиРасходов
	|			И ПлановыеРасходыОстатки.Сделка = ПлановыеРасходы.Сделка
	|			И (ПлановыеРасходы.Сумма <> 0)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПлановыеРасходыПриход КАК ПлановыеРасходыПриход
	|		ПО ПлановыеРасходыОстатки.ИдентификаторСтрокиРасходов = ПлановыеРасходыПриход.ИдентификаторСтрокиРасходов
	|			И ПлановыеРасходыОстатки.Сделка = ПлановыеРасходыПриход.Сделка
	|ГДЕ
	|	ПлановыеРасходыОстатки.СуммаОстаток <> 0";
		
	ТекстЗапроса = "";
	ЕстьОбъединение = Ложь;
	Если Параметры.ВО Тогда            
		Если Параметры.СторноПланаБезФакта Тогда
			ТекстЗапроса = СтрЗаменить(ТекстШаблонаБезФакта, "ПлановыеРасходыВО", "ПлановыеРасходыВОПолныйФакт");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВТ_ПлановыеРасходы", "ВТ_ПлановыеРасходыВОПолныйФакт");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВТ_ПлановыеРасходыПриход", "ВТ_ПлановыеРасходыПриходВОПолныйФакт");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПлановыеРасходыОстатки.СуммаОстаток - ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаУУ", "0 КАК СуммаУУ");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПлановыеРасходыОстатки.СуммаРубОстаток - ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаУУРуб", "0 КАК СуммаУУРуб");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПлановыеРасходыОстатки.СуммаОстаток КАК СуммаОстатокУУ", "0 КАК СуммаОстатокУУ");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаНДСОстатокУУ", "0 КАК СуммаНДСОстатокУУ");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПлановыеРасходыОстатки.СуммаРубОстаток КАК СуммаРубОстатокУУ", "0 КАК СуммаРубОстатокУУ");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаНДСРубОстатокУУ", "0 КАК СуммаНДСРубОстатокУУ");
		КонецЕсли;
		Если Параметры.СторноПланаБезФакта И Параметры.СторноПланаСЧастичнымФактом Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|  ОБЪЕДИНИТЬ ВСЕ"; 
			ЕстьОбъединение = Истина;
		КонецЕсли;
		Если Параметры.СторноПланаСЧастичнымФактом Тогда
			ТекстЗапросаСторноПланаСЧастичнымФактом = СтрЗаменить(ТекстШаблонаСЧастичнымФактом, "ПлановыеРасходыВО", "ПлановыеРасходыВОПолныйФакт");
			ТекстЗапросаСторноПланаСЧастичнымФактом = СтрЗаменить(ТекстЗапросаСторноПланаСЧастичнымФактом, "ВТ_ПлановыеРасходы", "ВТ_ПлановыеРасходыВОПолныйФакт");
			ТекстЗапросаСторноПланаСЧастичнымФактом = СтрЗаменить(ТекстЗапросаСторноПланаСЧастичнымФактом, "ВТ_ПлановыеРасходыПриход", "ВТ_ПлановыеРасходыПриходВОПолныйФакт");
			ТекстЗапросаСторноПланаСЧастичнымФактом = СтрЗаменить(ТекстЗапросаСторноПланаСЧастичнымФактом, "ПлановыеРасходыОстатки.СуммаОстаток - ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаУУ", "0 КАК СуммаУУ");
			ТекстЗапросаСторноПланаСЧастичнымФактом = СтрЗаменить(ТекстЗапросаСторноПланаСЧастичнымФактом, "ПлановыеРасходыОстатки.СуммаРубОстаток - ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаУУРуб", "0 КАК СуммаУУРуб");
			ТекстЗапросаСторноПланаСЧастичнымФактом = СтрЗаменить(ТекстЗапросаСторноПланаСЧастичнымФактом, "ПлановыеРасходыОстатки.СуммаОстаток КАК СуммаОстатокУУ", "0 КАК СуммаОстатокУУ");
			ТекстЗапросаСторноПланаСЧастичнымФактом = СтрЗаменить(ТекстЗапросаСторноПланаСЧастичнымФактом, "ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаНДСОстатокУУ", "0 КАК СуммаНДСОстатокУУ");
			ТекстЗапросаСторноПланаСЧастичнымФактом = СтрЗаменить(ТекстЗапросаСторноПланаСЧастичнымФактом, "ПлановыеРасходыОстатки.СуммаРубОстаток КАК СуммаРубОстатокУУ", "0 КАК СуммаРубОстатокУУ");
			ТекстЗапросаСторноПланаСЧастичнымФактом = СтрЗаменить(ТекстЗапросаСторноПланаСЧастичнымФактом, "ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаНДСРубОстатокУУ", "0 КАК СуммаНДСРубОстатокУУ");
		КонецЕсли;
		Если ЕстьОбъединение Тогда
			ТекстЗапросаСторноПланаСЧастичнымФактом = СтрЗаменить(ТекстЗапросаСторноПланаСЧастичнымФактом, "ПОМЕСТИТЬ ВТ_ТаблицыСписания", "");
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|"+ТекстЗапросаСторноПланаСЧастичнымФактом;
	КонецЕсли;
	Если Параметры.ВО И Параметры.УУ Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|  ОБЪЕДИНИТЬ ВСЕ";  
		ЕстьОбъединение = Истина;
	КонецЕсли;
	Если Параметры.УУ Тогда
		ТекстШаблонаУУБезФакта = ТекстШаблонаБезФакта;
		Если Параметры.СторноПланаБезФакта Тогда
			ТекстЗапросаУУБезФакта = СтрЗаменить(ТекстШаблонаУУБезФакта, "ПлановыеРасходыВО", "ПлановыеРасходыУУ");
			ТекстЗапросаУУБезФакта = СтрЗаменить(ТекстЗапросаУУБезФакта, "ВТ_ПлановыеРасходы", "ВТ_ПлановыеРасходыУУ");
			ТекстЗапросаУУБезФакта = СтрЗаменить(ТекстЗапросаУУБезФакта, "ВТ_ПлановыеРасходыПриход", "ВТ_ПлановыеРасходыПриходУУ");
			ТекстЗапросаУУБезФакта = СтрЗаменить(ТекстЗапросаУУБезФакта, "ПлановыеРасходыОстатки.СуммаОстаток - ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаВО", "0 КАК СуммаВО");
			ТекстЗапросаУУБезФакта = СтрЗаменить(ТекстЗапросаУУБезФакта, "ПлановыеРасходыОстатки.СуммаРубОстаток - ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаВОРуб", "0 КАК СуммаВОРуб");
			ТекстЗапросаУУБезФакта = СтрЗаменить(ТекстЗапросаУУБезФакта, "ПлановыеРасходыОстатки.СуммаОстаток КАК СуммаОстатокВО", "0 КАК СуммаОстатокВО");
			ТекстЗапросаУУБезФакта = СтрЗаменить(ТекстЗапросаУУБезФакта, "ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаНДСОстатокВО", "0 КАК СуммаНДСОстатокВО");
			ТекстЗапросаУУБезФакта = СтрЗаменить(ТекстЗапросаУУБезФакта, "ПлановыеРасходыОстатки.СуммаРубОстаток КАК СуммаРубОстатокВО", "0 КАК СуммаРубОстатокВО");
			ТекстЗапросаУУБезФакта = СтрЗаменить(ТекстЗапросаУУБезФакта, "ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаНДСРубОстатокВО", "0 КАК СуммаНДСРубОстатокВО");
			Если ЕстьОбъединение Тогда
				ТекстЗапросаУУБезФакта = СтрЗаменить(ТекстЗапросаУУБезФакта, "ПОМЕСТИТЬ ВТ_ТаблицыСписания", "");
			КонецЕсли;
			ТекстЗапроса = ТекстЗапроса + "
			|"+ТекстЗапросаУУБезФакта;
		КонецЕсли;
		Если Параметры.СторноПланаБезФакта И Параметры.СторноПланаСЧастичнымФактом Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|  ОБЪЕДИНИТЬ ВСЕ";  
			ЕстьОбъединение = Истина;
		КонецЕсли;
		Если Параметры.СторноПланаСЧастичнымФактом Тогда
			ТекстЗапросаУУСЧастичнымФактом = СтрЗаменить(ТекстШаблонаСЧастичнымФактом, "ПлановыеРасходыВО", "ПлановыеРасходыУУ");
			ТекстЗапросаУУСЧастичнымФактом = СтрЗаменить(ТекстЗапросаУУСЧастичнымФактом, "ВТ_ПлановыеРасходы", "ВТ_ПлановыеРасходыУУ");
			ТекстЗапросаУУСЧастичнымФактом = СтрЗаменить(ТекстЗапросаУУСЧастичнымФактом, "ВТ_ПлановыеРасходыПриход", "ВТ_ПлановыеРасходыПриходУУ");
			ТекстЗапросаУУСЧастичнымФактом = СтрЗаменить(ТекстЗапросаУУСЧастичнымФактом, "ПлановыеРасходыОстатки.СуммаОстаток - ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаВО", "0 КАК СуммаВО");
			ТекстЗапросаУУСЧастичнымФактом = СтрЗаменить(ТекстЗапросаУУСЧастичнымФактом, "ПлановыеРасходыОстатки.СуммаРубОстаток - ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаВОРуб", "0 КАК СуммаВОРуб");
			ТекстЗапросаУУСЧастичнымФактом = СтрЗаменить(ТекстЗапросаУУСЧастичнымФактом, "ПлановыеРасходыОстатки.СуммаОстаток КАК СуммаОстатокВО", "0 КАК СуммаОстатокВО");
			ТекстЗапросаУУСЧастичнымФактом = СтрЗаменить(ТекстЗапросаУУСЧастичнымФактом, "ПлановыеРасходыОстатки.СуммаНДСОстаток КАК СуммаНДСОстатокВО", "0 КАК СуммаНДСОстатокВО");
			ТекстЗапросаУУСЧастичнымФактом = СтрЗаменить(ТекстЗапросаУУСЧастичнымФактом, "ПлановыеРасходыОстатки.СуммаРубОстаток КАК СуммаРубОстатокВО", "0 КАК СуммаРубОстатокВО");
			ТекстЗапросаУУСЧастичнымФактом = СтрЗаменить(ТекстЗапросаУУСЧастичнымФактом, "ПлановыеРасходыОстатки.СуммаНДСРубОстаток КАК СуммаНДСРубОстатокВО", "0 КАК СуммаНДСРубОстатокВО");
			Если ЕстьОбъединение Тогда
				ТекстЗапросаУУСЧастичнымФактом = СтрЗаменить(ТекстЗапросаУУСЧастичнымФактом, "ПОМЕСТИТЬ ВТ_ТаблицыСписания", "");
			КонецЕсли;
			ТекстЗапроса = ТекстЗапроса + "
			|"+ТекстЗапросаУУСЧастичнымФактом;
		КонецЕсли;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + ";
	|////////////////////////////////////////////////////////////////////////////////";
	ТекстЗапроса = ТекстЗапроса + 
	"
	|ВЫБРАТЬ
	|	ВТ_ТаблицыСписания.Организация КАК Организация,
	|	ВТ_ТаблицыСписания.Сделка КАК Сделка,
	|	ВТ_ТаблицыСписания.ЦФО КАК ЦФО,
	|	ВТ_ТаблицыСписания.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ВТ_ТаблицыСписания.Поставщик КАК Поставщик,
	|	ВТ_ТаблицыСписания.Договор КАК Договор,
	|	ВТ_ТаблицыСписания.Услуга КАК Услуга,
	|	ВТ_ТаблицыСписания.Вагон КАК Вагон,
	|	ВТ_ТаблицыСписания.Контейнер КАК Контейнер,
	|	ВТ_ТаблицыСписания.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ВТ_ТаблицыСписания.ВидОперации КАК ВидОперации,
	|	ВТ_ТаблицыСписания.ТипОперации КАК ТипОперации,
	|	ВТ_ТаблицыСписания.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_ТаблицыСписания.Валюта КАК Валюта,
	|	ВТ_ТаблицыСписания.ИдентификаторСтрокиРасходов КАК ИдентификаторСтрокиРасходов,
	|	ВТ_ТаблицыСписания.ПлановыеРасходыПоЖДН КАК ПлановыеРасходыПоЖДН,
	|	ВТ_ТаблицыСписания.Клиент КАК Клиент,
	|	ВТ_ТаблицыСписания.ДоговорКлиента КАК ДоговорКлиента,
	|	ВТ_ТаблицыСписания.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ВТ_ТаблицыСписания.Реализация КАК Реализация,
	//Евросиб Каблов 05.03.2026 ( #126776
	|	ВТ_ТаблицыСписания.ИсключатьИзУФД КАК ИсключатьИзУФД,
	//Евросиб Каблов 05.03.2026
	|	ВТ_ТаблицыСписания.СуммаВО КАК СуммаВО,
	|	ВТ_ТаблицыСписания.СуммаВОРуб КАК СуммаВОРуб,
	|	ВТ_ТаблицыСписания.СуммаУУ КАК СуммаУУ,
	|	ВТ_ТаблицыСписания.СуммаУУРуб КАК СуммаУУРуб,
	|	ВТ_ТаблицыСписания.СуммаОстатокВО КАК СуммаОстатокВО,
	|	ВТ_ТаблицыСписания.СуммаНДСОстатокВО КАК СуммаНДСОстатокВО,
	|	ВТ_ТаблицыСписания.СуммаРубОстатокВО КАК СуммаРубОстатокВО,
	|	ВТ_ТаблицыСписания.СуммаНДСРубОстатокВО КАК СуммаНДСРубОстатокВО,
	|	ВТ_ТаблицыСписания.СуммаОстатокУУ КАК СуммаОстатокУУ,
	|	ВТ_ТаблицыСписания.СуммаНДСОстатокУУ КАК СуммаНДСОстатокУУ,
	|	ВТ_ТаблицыСписания.СуммаРубОстатокУУ КАК СуммаРубОстатокУУ,
	|	ВТ_ТаблицыСписания.СуммаНДСРубОстатокУУ КАК СуммаНДСРубОстатокУУ
	|ИЗ
	|	ВТ_ТаблицыСписания КАК ВТ_ТаблицыСписания"; 
	Если Параметры.ВО Тогда
		ТекстЗапроса = ТекстШаблонаВТ_ВО + ТекстЗапроса;
	КонецЕсли;
	Если Параметры.УУ Тогда
		ТекстЗапроса = ТекстШаблонаВТ_УУ + ТекстЗапроса;
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("НачалоПериодаВозникновенияОстатков", НачалоДня(Параметры.НачалоПериодаВозникновенияОстатков));
	Запрос.УстановитьПараметр("КонецПериодаВозникновенияОстатков", КонецДня(Параметры.ОкончаниеПериодаВозникновенияОстатков));
	Запрос.УстановитьПараметр("ПериодСписания", КонецМесяца(Параметры.ПериодСписания));
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	ТаблицаСписания = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаСписания;
	
КонецФункции

//Евросиб Каблов 06.11.2025 #107942
Процедура Списание_СформироватьДвиженияПлановыеРасходыПолныйФакт(Объект, ТаблицаСписания) Экспорт
	
	Для каждого СтрокаСписания Из ТаблицаСписания Цикл

		Если Объект.ВО И СтрокаСписания.СуммаОстатокВО <> 0 Тогда
			ДвижениеВО = Объект.Движения.ПлановыеРасходыВОПолныйФакт.ДобавитьРасход();
			ЗаполнитьЗначенияСвойств(ДвижениеВО, СтрокаСписания);
			ДвижениеВО.Период = НачалоМесяца(Объект.ПериодСписания);
			ДвижениеВО.Сумма = СтрокаСписания.СуммаОстатокВО;
			ДвижениеВО.СуммаНДС = СтрокаСписания.СуммаНДСОстатокВО;
			ДвижениеВО.СуммаРуб = СтрокаСписания.СуммаРубОстатокВО;
			ДвижениеВО.СуммаНДСРуб = СтрокаСписания.СуммаНДСРубОстатокВО;
			ДвижениеВО.Списание = Истина;
		КонецЕсли;
		
	КонецЦикла;
	Если Объект.ВО Тогда
		Объект.Движения.ПлановыеРасходыВОПолныйФакт.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура Списание_УстановитьПараметрыЗапросаФиксацииИзменений(Запрос, Объект)
	Запрос.УстановитьПараметр("КонецПериодаПлановыхРасходов", КонецМесяца(Объект.ПериодСписания));
	//Евросиб Каблов 04.03.2024 ( #81836
	//Запрос.УстановитьПараметр("КонецПериодаЗафиксированныхРасходов", Объект.ПериодСписания - 1);
	//Запрос.УстановитьПараметр("ПериодФиксации", КонецМесяца(Объект.ПериодСписания));
	Запрос.УстановитьПараметр("КонецПериодаЗафиксированныхРасходов", КонецМесяца(Объект.ПериодСписания));
	Запрос.УстановитьПараметр("ПериодФиксации", НачалоМесяца(Объект.ПериодСписания));
	//Евросиб Каблов 04.03.2024 )
	
КонецПроцедуры

#КонецОбласти

#Область СчетНаОплатуПокупателю

//Евросиб Каблов 02.05.2023 67617
Процедура Счет_СформироватьДвиженияПлановыеДоходыПоСчетамНаОплату(ОбъектСчет) Экспорт
	
	ПлановыеДоходыПоАвансовымСчетам = ОбъектСчет.Движения.ПлановыеДоходыПоАвансовымСчетам;
	ПлановыеДоходыПоАвансовымСчетам.Записывать = Истина;
	
	Если Не ЗначениеЗаполнено(ОбъектСчет.Контрагент) Или РегистрыСведений.СобственныеКонтрагенты.ЭтоСобственныйКонтрагент(ОбъектСчет.Контрагент) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетНаОплатуПокупателюТовары.Ссылка КАК Ссылка,
	|	СчетНаОплатуПокупателюТовары.НомерСтроки КАК НомерСтроки,
	|	СчетНаОплатуПокупателюТовары.Номенклатура КАК Номенклатура,
	|	СчетНаОплатуПокупателюТовары.Содержание КАК Содержание,
	|	СчетНаОплатуПокупателюТовары.Количество КАК Количество,
	|	СчетНаОплатуПокупателюТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СчетНаОплатуПокупателюТовары.Цена КАК Цена,
	|	СчетНаОплатуПокупателюТовары.Сумма КАК Сумма,
	|	СчетНаОплатуПокупателюТовары.СтавкаНДС КАК СтавкаНДС,
	|	СчетНаОплатуПокупателюТовары.СуммаНДС КАК СуммаНДС,
	|	СчетНаОплатуПокупателюТовары.СтрокаДоходовСделки КАК СтрокаДоходовСделки,
	|	СчетНаОплатуПокупателюТовары.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	СчетНаОплатуПокупателюТовары.Калькуляция КАК Калькуляция,
	|	СчетНаОплатуПокупателюТовары.ЦенаВВалюте КАК ЦенаВВалюте,
	|	СчетНаОплатуПокупателюТовары.ИсходнаяВалюта КАК ИсходнаяВалюта,
	|	СчетНаОплатуПокупателюТовары.РазмерКТК КАК РазмерКТК,
	|	СчетНаОплатуПокупателюТовары.НомерКТК КАК НомерКТК,
	|	СчетНаОплатуПокупателюТовары.Вагон КАК Вагон,
	|	СчетНаОплатуПокупателюТовары.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ Услуги
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
	|ГДЕ
	|	СчетНаОплатуПокупателюТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетНаОплатуПокупателюУчетныеЕдиницы.Ссылка КАК Ссылка,
	|	СчетНаОплатуПокупателюУчетныеЕдиницы.НомерСтроки КАК НомерСтроки,
	|	СчетНаОплатуПокупателюУчетныеЕдиницы.УчетнаяЕдиница КАК УчетнаяЕдиница,
	|	СчетНаОплатуПокупателюУчетныеЕдиницы.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг
	|ПОМЕСТИТЬ УчетныеЕдиницы
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю.УчетныеЕдиницы КАК СчетНаОплатуПокупателюУчетныеЕдиницы
	|ГДЕ
	|	СчетНаОплатуПокупателюУчетныеЕдиницы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетНаОплатуПокупателюДокументыОснования.Ссылка КАК Ссылка,
	|	СчетНаОплатуПокупателюДокументыОснования.НомерСтроки КАК НомерСтроки,
	|	СчетНаОплатуПокупателюДокументыОснования.Документ КАК Документ,
	|	СчетНаОплатуПокупателюДокументыОснования.Сделка КАК Сделка,
	|	СчетНаОплатуПокупателюДокументыОснования.УдалитьОтнесеннаяНаДокументСуммаСНДС КАК УдалитьОтнесеннаяНаДокументСуммаСНДС,
	|	СчетНаОплатуПокупателюДокументыОснования.Коносамент КАК Коносамент
	|ПОМЕСТИТЬ ДокументыОснования
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю.ДокументыОснования КАК СчетНаОплатуПокупателюДокументыОснования
	|ГДЕ
	|	СчетНаОплатуПокупателюДокументыОснования.Ссылка = &Ссылка
	|	И СчетНаОплатуПокупателюДокументыОснования.Документ ССЫЛКА Документ.Заявка
	|	И СчетНаОплатуПокупателюДокументыОснования.Документ <> ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка)
	|	И ВЫРАЗИТЬ(СчетНаОплатуПокупателюДокументыОснования.Документ КАК Документ.Заявка).Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	Услуги.Калькуляция КАК Калькуляция,
	//|	Услуги.Номенклатура КАК Номенклатура,
	//|	ВЫБОР
	////БелинскийДА начало
	////|		КОГДА Услуги.Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Передислокация)
	//|		КОГДА Услуги.Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Доплатные)
	////БелинскийДА Конец
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Доплата)
	//|		КОГДА Услуги.Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Субсидии)
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Субсидии)
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.ОсновнойДолг)
	//|	КОНЕЦ КАК ВидДоходов
	//|ПОМЕСТИТЬ Калькуляции
	//|ИЗ
	//|	Услуги КАК Услуги
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	//|		ПО Услуги.Калькуляция = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка
	//|			И (КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.НомерСтроки = 1)
	//|			И Услуги.Номенклатура = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга
	//|ГДЕ
	//|	(НЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга ЕСТЬ NULL
	//|			ИЛИ Услуги.Номенклатура = &УслугаФрахт)
	//Евросиб(ДИТ), Беляев СЮ, BUG 92677 / TA 92679, 10-10-2024, начало
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Услуги.Калькуляция КАК Калькуляция,
	|	ВЫБОР 
	|		КОГДА ДокументКалькуляция.ОсновнаяУслуга <> Значение(Справочник.Номенклатура.ПустаяСсылка) 
	|			ТОГДА ДокументКалькуляция.ОсновнаяУслуга
	|		ИНАЧЕ 
	|			ЕстьNULL(КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга, Значение(Справочник.Номенклатура.ПустаяСсылка))
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА Услуги.Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Доплатные)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Доплата)
	|		КОГДА Услуги.Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Субсидии)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Субсидии) 
	//ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
	|		КОГДА Услуги.Калькуляция.ТипКалькуляции = ЗНАЧЕНИЕ(Перечисление.ТипыКалькуляций.Премии)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Премии)
	//ДИТ Шевченко А.В. US 103646 TA 103658 10.03.2025
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.ОсновнойДолг)
	|	КОНЕЦ КАК ВидДоходов
	|ПОМЕСТИТЬ Калькуляции
	|ИЗ
	|	Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция КАК ДокументКалькуляция
	|		ПО Услуги.Калькуляция = ДокументКалькуляция.Ссылка
	|			И ДокументКалькуляция.ОсновнаяУслуга = Услуги.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	|		ПО Услуги.Калькуляция = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка
	|			И (КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.НомерСтроки = 1)
	|			И Услуги.Номенклатура = КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга
	|ГДЕ
	|	(НЕ ДокументКалькуляция.Ссылка ЕСТЬ NULL
	|			ИЛИ НЕ КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.ВыставляемаяУслуга ЕСТЬ NULL
	|			ИЛИ Услуги.Номенклатура = &УслугаФрахт)
	//Евросиб(ДИТ), Беляев СЮ, BUG 92677 / TA 92679, 10-10-2024, конец
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Услуги.Калькуляция,
	|	Услуги.Номенклатура,
	|	ВЫБОР
	|		КОГДА КалькуляцияЖД_УслугиВнеСтавки.ТипСтавки = ЗНАЧЕНИЕ(Перечисление.ТипыСтавокПротокола.Ставка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.ДопУслуга)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.ДопУслугаВР)
	|	КОНЕЦ
	|ИЗ
	|	Услуги КАК Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Калькуляция.ЖД_УслугиВнеСтавки КАК КалькуляцияЖД_УслугиВнеСтавки
	|		ПО Услуги.Калькуляция = КалькуляцияЖД_УслугиВнеСтавки.Ссылка
	|			И Услуги.Номенклатура = КалькуляцияЖД_УслугиВнеСтавки.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Услуги.Ссылка КАК Ссылка,
	|	Услуги.Номенклатура КАК Номенклатура,
	|	Услуги.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Услуги.СтавкаНДС КАК СтавкаНДС,
	|	ЕСТЬNULL(Вагоны.УчетнаяЕдиница, ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)) КАК Вагон,
	|	ЕСТЬNULL(Контейнеры.УчетнаяЕдиница, ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)) КАК Контейнер,
	|	Услуги.Идентификатор КАК Идентификатор,
	|	Услуги.Калькуляция КАК Калькуляция,
	|	ЕСТЬNULL(Калькуляции.ВидДоходов, ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.ПустаяСсылка)) КАК ВидДоходов,
	|	Услуги.Сумма КАК Сумма,
	|	Услуги.СуммаНДС КАК СуммаНДС
	|ПОМЕСТИТЬ УслугиПоУчетнымЕдиницам
	|ИЗ
	|	Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ УчетныеЕдиницы КАК Вагоны
	|		ПО Услуги.Идентификатор = Вагоны.ИдентификаторСтрокиУслуг
	|			И (Вагоны.УчетнаяЕдиница ССЫЛКА Справочник.ТС)
	|		ЛЕВОЕ СОЕДИНЕНИЕ УчетныеЕдиницы КАК Контейнеры
	|		ПО Услуги.Идентификатор = Контейнеры.ИдентификаторСтрокиУслуг
	|			И (Контейнеры.УчетнаяЕдиница ССЫЛКА Справочник.ТЕ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Калькуляции КАК Калькуляции
	|		ПО Услуги.Калькуляция = Калькуляции.Калькуляция
	|			И Услуги.Номенклатура = Калькуляции.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиПоУчетнымЕдиницам.Ссылка КАК Ссылка,
	|	УслугиПоУчетнымЕдиницам.Номенклатура КАК Номенклатура,
	|	УслугиПоУчетнымЕдиницам.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	УслугиПоУчетнымЕдиницам.СтавкаНДС КАК СтавкаНДС,
	|	УслугиПоУчетнымЕдиницам.Вагон КАК Вагон,
	|	УслугиПоУчетнымЕдиницам.Контейнер КАК Контейнер,
	|	УслугиПоУчетнымЕдиницам.Идентификатор КАК Идентификатор,
	|	УслугиПоУчетнымЕдиницам.ВидДоходов КАК ВидДоходов,
	|	УслугиПоУчетнымЕдиницам.Калькуляция КАК Калькуляция,
	|	ДокументыОснования.Документ КАК ДокументОснование
	|ПОМЕСТИТЬ УслугиПоДокументамОснованиям
	|ИЗ
	|	УслугиПоУчетнымЕдиницам КАК УслугиПоУчетнымЕдиницам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыОснования КАК ДокументыОснования
	|		ПО УслугиПоУчетнымЕдиницам.Ссылка = ДокументыОснования.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиПоУчетнымЕдиницам.Идентификатор КАК Идентификатор,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ УслугиПоУчетнымЕдиницам.Контейнер) КАК КоличествоКонтейнеров,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ УслугиПоУчетнымЕдиницам.Вагон) КАК КоличествоВагонов,
	|	УслугиПоУчетнымЕдиницам.Ссылка КАК СсылкаНаСчет
	|ПОМЕСТИТЬ КоличествоУчетныхЕдиниц
	|ИЗ
	|	УслугиПоУчетнымЕдиницам КАК УслугиПоУчетнымЕдиницам
	|
	|СГРУППИРОВАТЬ ПО
	|	УслугиПоУчетнымЕдиницам.Идентификатор,
	|	УслугиПоУчетнымЕдиницам.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УслугиПоДокументамОснованиям.Ссылка КАК Ссылка,
	|	УслугиПоДокументамОснованиям.Номенклатура КАК Номенклатура,
	|	УслугиПоДокументамОснованиям.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	УслугиПоДокументамОснованиям.СтавкаНДС КАК СтавкаНДС,
	|	УслугиПоДокументамОснованиям.Вагон КАК Вагон,
	|	ВЫБОР
	|		КОГДА УслугиПоДокументамОснованиям.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.вагон)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	|		ИНАЧЕ УслугиПоДокументамОснованиям.Контейнер
	|	КОНЕЦ КАК Контейнер,
	|	УслугиПоДокументамОснованиям.Идентификатор КАК Идентификатор,
	|	УслугиПоДокументамОснованиям.ВидДоходов КАК ВидДоходов,
	|	ЕСТЬNULL(ЗаявкаСоставУслуги.Ссылка, УслугиПоДокументамОснованиям.ДокументОснование) КАК Заявка,
	|	ВЫБОР
	|		КОГДА ЗаявкаСоставУслуги.Ссылка ЕСТЬ NULL
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приоритет,
	|	ЕСТЬNULL(ЗаявкаСоставУслуги.Ссылка.Дата, УслугиПоДокументамОснованиям.ДокументОснование.Дата) КАК ДатаЗаявки
	|ПОМЕСТИТЬ УслугиПоЗаявкамПриоритеты
	|ИЗ
	|	УслугиПоДокументамОснованиям КАК УслугиПоДокументамОснованиям
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|		ПО УслугиПоДокументамОснованиям.ДокументОснование = ЗаявкаСоставУслуги.Ссылка
	|			И (ВЫБОР
	|				КОГДА УслугиПоДокументамОснованиям.Контейнер = ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ УслугиПоДокументамОснованиям.Контейнер = ЗаявкаСоставУслуги.НомерКТК
	|			КОНЕЦ)
	|ГДЕ
	|	ЕСТЬNULL(ЗаявкаСоставУслуги.ПеренесенВЗаявку, ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка)) = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиПоЗаявкам.Ссылка КАК Ссылка,
	|	УслугиПоЗаявкам.Номенклатура КАК Номенклатура,
	|	УслугиПоЗаявкам.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	УслугиПоЗаявкам.СтавкаНДС КАК СтавкаНДС,
	|	УслугиПоЗаявкам.Вагон КАК Вагон,
	|	УслугиПоЗаявкам.Контейнер КАК Контейнер,
	|	УслугиПоЗаявкам.Идентификатор КАК Идентификатор,
	|	УслугиПоЗаявкам.ВидДоходов КАК ВидДоходов,
	|	УслугиПоЗаявкам.Заявка КАК Заявка
	|ПОМЕСТИТЬ УслугиПоЗаявкам
	|ИЗ
	|	(ВЫБРАТЬ
	|		УслугиПоЗаявкам.Ссылка КАК Ссылка,
	|		УслугиПоЗаявкам.Номенклатура КАК Номенклатура,
	|		УслугиПоЗаявкам.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		УслугиПоЗаявкам.СтавкаНДС КАК СтавкаНДС,
	|		УслугиПоЗаявкам.Вагон КАК Вагон,
	|		УслугиПоЗаявкам.Контейнер КАК Контейнер,
	|		УслугиПоЗаявкам.Идентификатор КАК Идентификатор,
	|		УслугиПоЗаявкам.ВидДоходов КАК ВидДоходов,
	|		УслугиПоЗаявкам.Приоритет КАК Приоритет,
	|		МАКСИМУМ(УслугиПоЗаявкам.ДатаЗаявки) КАК ДатаЗаявки
	|	ИЗ
	|		(ВЫБРАТЬ
	|			УслугиПоЗаявкам.Ссылка КАК Ссылка,
	|			УслугиПоЗаявкам.Номенклатура КАК Номенклатура,
	|			УслугиПоЗаявкам.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|			УслугиПоЗаявкам.СтавкаНДС КАК СтавкаНДС,
	|			УслугиПоЗаявкам.Вагон КАК Вагон,
	|			УслугиПоЗаявкам.Контейнер КАК Контейнер,
	|			УслугиПоЗаявкам.Идентификатор КАК Идентификатор,
	|			УслугиПоЗаявкам.ВидДоходов КАК ВидДоходов,
	|			МИНИМУМ(УслугиПоЗаявкам.Приоритет) КАК Приоритет
	|		ИЗ
	|			УслугиПоЗаявкамПриоритеты КАК УслугиПоЗаявкам
	|		
	|		СГРУППИРОВАТЬ ПО
	|			УслугиПоЗаявкам.Номенклатура,
	|			УслугиПоЗаявкам.Ссылка,
	|			УслугиПоЗаявкам.ЕдиницаИзмерения,
	|			УслугиПоЗаявкам.СтавкаНДС,
	|			УслугиПоЗаявкам.Вагон,
	|			УслугиПоЗаявкам.Контейнер,
	|			УслугиПоЗаявкам.Идентификатор,
	|			УслугиПоЗаявкам.ВидДоходов) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиПоЗаявкамПриоритеты КАК УслугиПоЗаявкам
	|			ПО ВложенныйЗапрос.Ссылка = УслугиПоЗаявкам.Ссылка
	|				И ВложенныйЗапрос.Номенклатура = УслугиПоЗаявкам.Номенклатура
	|				И ВложенныйЗапрос.ЕдиницаИзмерения = УслугиПоЗаявкам.ЕдиницаИзмерения
	|				И ВложенныйЗапрос.СтавкаНДС = УслугиПоЗаявкам.СтавкаНДС
	|				И ВложенныйЗапрос.Вагон = УслугиПоЗаявкам.Вагон
	|				И ВложенныйЗапрос.Контейнер = УслугиПоЗаявкам.Контейнер
	|				И ВложенныйЗапрос.Идентификатор = УслугиПоЗаявкам.Идентификатор
	|				И ВложенныйЗапрос.ВидДоходов = УслугиПоЗаявкам.ВидДоходов
	|				И ВложенныйЗапрос.Приоритет = УслугиПоЗаявкам.Приоритет
	|	
	|	СГРУППИРОВАТЬ ПО
	|		УслугиПоЗаявкам.ВидДоходов,
	|		УслугиПоЗаявкам.Идентификатор,
	|		УслугиПоЗаявкам.Контейнер,
	|		УслугиПоЗаявкам.Вагон,
	|		УслугиПоЗаявкам.СтавкаНДС,
	|		УслугиПоЗаявкам.ЕдиницаИзмерения,
	|		УслугиПоЗаявкам.Номенклатура,
	|		УслугиПоЗаявкам.Ссылка,
	|		УслугиПоЗаявкам.Приоритет) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УслугиПоЗаявкамПриоритеты КАК УслугиПоЗаявкам
	|		ПО ВложенныйЗапрос.Ссылка = УслугиПоЗаявкам.Ссылка
	|			И ВложенныйЗапрос.Номенклатура = УслугиПоЗаявкам.Номенклатура
	|			И ВложенныйЗапрос.ЕдиницаИзмерения = УслугиПоЗаявкам.ЕдиницаИзмерения
	|			И ВложенныйЗапрос.СтавкаНДС = УслугиПоЗаявкам.СтавкаНДС
	|			И ВложенныйЗапрос.Вагон = УслугиПоЗаявкам.Вагон
	|			И ВложенныйЗапрос.Контейнер = УслугиПоЗаявкам.Контейнер
	|			И ВложенныйЗапрос.Идентификатор = УслугиПоЗаявкам.Идентификатор
	|			И ВложенныйЗапрос.ВидДоходов = УслугиПоЗаявкам.ВидДоходов
	|			И ВложенныйЗапрос.Приоритет = УслугиПоЗаявкам.Приоритет
	|			И ВложенныйЗапрос.ДатаЗаявки = УслугиПоЗаявкам.ДатаЗаявки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Услуги.НомерСтроки КАК НомерСтроки,
	|	Услуги.Идентификатор КАК Идентификатор,
	|	Услуги.Номенклатура КАК Номенклатура,
	|	Услуги.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Услуги.Количество КАК Количество,
	|	Услуги.Сумма КАК Сумма,
	|	Услуги.СуммаНДС КАК СуммаНДС,
	|	КоличествоУчетныхЕдиниц.КоличествоКонтейнеров КАК КоличествоКонтейнеров,
	|	КоличествоУчетныхЕдиниц.КоличествоВагонов КАК КоличествоВагонов,
	|	ЕСТЬNULL(Калькуляции.ВидДоходов, ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.ПустаяСсылка)) КАК ВидДоходов
	|ИЗ
	|	Услуги КАК Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КоличествоУчетныхЕдиниц КАК КоличествоУчетныхЕдиниц
	|		ПО Услуги.Идентификатор = КоличествоУчетныхЕдиниц.Идентификатор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Калькуляции КАК Калькуляции
	|		ПО Услуги.Калькуляция = Калькуляции.Калькуляция
	|			И Услуги.Номенклатура = Калькуляции.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиПоЗаявкам.Ссылка КАК Ссылка,
	|	УслугиПоЗаявкам.Номенклатура КАК Номенклатура,
	|	УслугиПоЗаявкам.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	УслугиПоЗаявкам.СтавкаНДС КАК СтавкаНДС,
	|	УслугиПоЗаявкам.Вагон КАК Вагон,
	|	УслугиПоЗаявкам.Контейнер КАК Контейнер,
	|	УслугиПоЗаявкам.Идентификатор КАК Идентификатор,
	|	УслугиПоЗаявкам.ВидДоходов КАК ВидДоходов,
	|	УслугиПоЗаявкам.Заявка КАК Заявка
	|ИЗ
	|	УслугиПоЗаявкам КАК УслугиПоЗаявкам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УслугиПоЗаявкам.Заявка КАК Заявка,
	|	УслугиПоЗаявкам.Номенклатура КАК Номенклатура,
	|	УслугиПоЗаявкам.Вагон КАК Вагон,
	|	УслугиПоЗаявкам.Контейнер КАК Контейнер,
	|	СделкаДоходы.Услуга КАК Услуга,
	|	СделкаСвязьУчетныхЕдиниц.ГотовоКВыставлению КАК ГотовоКВыставлению
	|ИЗ
	|	УслугиПоЗаявкам КАК УслугиПоЗаявкам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьДоходовИРасходов КАК СделкаСвязьДоходовИРасходов
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
	|				ПО СделкаСвязьДоходовИРасходов.Ссылка = СделкаДоходы.Ссылка
	|					И СделкаСвязьДоходовИРасходов.Доходы = СделкаДоходы.ГУИД
	|			ПО СделкаСвязьУчетныхЕдиниц.Ссылка = СделкаСвязьДоходовИРасходов.Ссылка
	|				И СделкаСвязьУчетныхЕдиниц.ГУИД = СделкаСвязьДоходовИРасходов.СвязьУчетныхЕдиниц
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СобственныеКонтрагенты КАК СобственныеКонтрагенты
	|			ПО СделкаСвязьУчетныхЕдиниц.Клиент = СобственныеКонтрагенты.Контрагент
	|		ПО УслугиПоЗаявкам.Заявка = СделкаСвязьУчетныхЕдиниц.Заявка
	|			И (ВЫБОР
	|				КОГДА УслугиПоЗаявкам.Контейнер <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	|					ТОГДА УслугиПоЗаявкам.Контейнер = СделкаСвязьУчетныхЕдиниц.Контейнер
	|				КОГДА УслугиПоЗаявкам.Вагон <> ЗНАЧЕНИЕ(Справочник.ТС.ПустаяСсылка)
	|					ТОГДА УслугиПоЗаявкам.Вагон = СделкаСвязьУчетныхЕдиниц.Вагон
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				КОГДА УслугиПоЗаявкам.Номенклатура = &УслугаФрахт
	|					ТОГДА СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.Море)
	|				ИНАЧЕ СделкаСвязьУчетныхЕдиниц.ВидТранспортногоСообщения = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортныхСообщений.ЖД)
	|			КОНЕЦ)
	|ГДЕ
	|	НЕ СделкаСвязьУчетныхЕдиниц.Ссылка.Служебная
	|	И СделкаСвязьУчетныхЕдиниц.Клиент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	И СобственныеКонтрагенты.Контрагент ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка КАК СсылкаНаРеализацию,
	|	Услуги.Ссылка КАК СсылкаНаСчет,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ УчетныеЕдиницы.УчетнаяЕдиница) КАК ОбщееЧислоУЕ
	|ПОМЕСТИТЬ ВТ_РеализацииПоСчетам
	|ИЗ
	|	Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ УчетныеЕдиницы КАК УчетныеЕдиницы
	|		ПО Услуги.Ссылка = УчетныеЕдиницы.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.СчетаНаОплатуПокупателям КАК РеализацияТоваровУслугСчетаНаОплатуПокупателям
	|		ПО Услуги.Ссылка = РеализацияТоваровУслугСчетаНаОплатуПокупателям.СчетПокупателю
	|			И (РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка.Проведен)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугСчетаНаОплатуПокупателям.Ссылка,
	|	Услуги.Ссылка
	
	//Евросиб Каблов 16.10.2025 ( #121694
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.Ссылка,
	|	Услуги1.Ссылка,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ УчетныеЕдиницы.УчетнаяЕдиница)
	|ИЗ
	|	Услуги КАК Услуги1
	|		ЛЕВОЕ СОЕДИНЕНИЕ УчетныеЕдиницы КАК УчетныеЕдиницы
	|		ПО Услуги1.Ссылка = УчетныеЕдиницы.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.СчетаНаОплатуПокупателям КАК ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям
	|		ПО Услуги1.Ссылка = ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.СчетПокупателю
	|			И (ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.Ссылка.Проведен)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетКомитентуОПродажахСчетаНаОплатуПокупателям.Ссылка,
	|	Услуги1.Ссылка
	 //Евросиб Каблов 16.10.2025 )
	
	//Евросиб СубботинВ #84453 02.07.2024 Начало //Поменял запрос на работу только с ТЧ СчетаНаОплатуПокупателям
	//|ОБЪЕДИНИТЬ
	//|
	//|ВЫБРАТЬ
	//|	РеализацияТоваровУслуг.Ссылка,
	//|	Услуги1.Ссылка,
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ УчетныеЕдиницы.УчетнаяЕдиница)
	//|ИЗ
	//|	Услуги КАК Услуги1
	//|		ЛЕВОЕ СОЕДИНЕНИЕ УчетныеЕдиницы КАК УчетныеЕдиницы
	//|		ПО Услуги1.Ссылка = УчетныеЕдиницы.Ссылка
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	//|		ПО Услуги1.Ссылка = РеализацияТоваровУслуг.СчетНаОплатуПокупателю
	//|			И (РеализацияТоваровУслуг.Ссылка.Проведен)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	РеализацияТоваровУслуг.Ссылка,
	//|	Услуги1.Ссылка 
	//Евросиб СубботинВ #84453 02.07.2024 Конец 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсторияКорректировокРеализацийСрезПоследних.Регистратор КАК Регистратор,
	|	ИсторияКорректировокРеализацийСрезПоследних.ПервичныйДокумент КАК ПервичныйДокумент,
	|	ИсторияКорректировокРеализацийСрезПоследних.ВидОперации КАК ВидОперации
	|ПОМЕСТИТЬ ВТ_СрезКорректировок
	|ИЗ
	|	РегистрСведений.ИсторияКорректировокРеализаций.СрезПоследних(
	|			,
	|			ПервичныйДокумент В
	|				(ВЫБРАТЬ
	|					ВТ_РеализацииПоСчетам.СсылкаНаРеализацию КАК СсылкаНаРеализацию
	|				ИЗ
	|					ВТ_РеализацииПоСчетам КАК ВТ_РеализацииПоСчетам)) КАК ИсторияКорректировокРеализацийСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(ВТ_СрезКорректировок.Регистратор, ВТ_РеализацииПоСчетам.СсылкаНаРеализацию) КАК АктуальнаяРеализация,
	|	ВТ_РеализацииПоСчетам.СсылкаНаСчет КАК СсылкаНаСчет,
	|	ВТ_РеализацииПоСчетам.ОбщееЧислоУЕ КАК ОбщееЧислоУЕ,
	|	ЕСТЬNULL(ВТ_СрезКорректировок.ВидОперации, ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.ПустаяСсылка)) КАК ВидОперации
	|ПОМЕСТИТЬ ВТ_Документы
	|ИЗ
	|	ВТ_РеализацииПоСчетам КАК ВТ_РеализацииПоСчетам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрезКорректировок КАК ВТ_СрезКорректировок
	|		ПО ВТ_РеализацииПоСчетам.СсылкаНаРеализацию = ВТ_СрезКорректировок.ПервичныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслугРасшифровкаУслугПоТС.Контейнер КАК Контейнер,
	|	РеализацияТоваровУслугРасшифровкаУслугПоТС.Вагон КАК Вагон,
	//Евросиб Каблов 16.10.2025 ( #121694
	|	NULL КАК Услуга,
	//Евросиб Каблов 16.10.2025 ) #121694
	|	ВТ_Документы.ОбщееЧислоУЕ КАК ОбщееЧислоУЕ,
	|	ВТ_Документы.АктуальнаяРеализация КАК АктуальнаяРеализация
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.РасшифровкаУслугПоТС КАК РеализацияТоваровУслугРасшифровкаУслугПоТС
	|		ПО ВТ_Документы.АктуальнаяРеализация = РеализацияТоваровУслугРасшифровкаУслугПоТС.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	//Евросиб Каблов 16.10.2025 ( #121694
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Контейнер КАК Контейнер,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Вагон КАК Вагон,
	|	NULL КАК Услуга,
	|	ВТ_Документы.ОбщееЧислоУЕ КАК ОбщееЧислоУЕ,
	|	ВТ_Документы.АктуальнаяРеализация КАК АктуальнаяРеализация
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.РасшифровкаУслугПоТС КАК ОтчетКомитентуОПродажахРасшифровкаУслугПоТС
	|		ПО ВТ_Документы.АктуальнаяРеализация = ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Контейнер КАК Контейнер,
	|	ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Вагон КАК Вагон,
	|	ОтчетКомитентуОПродажах.УслугаПоВознаграждению,
	|	ВТ_Документы.ОбщееЧислоУЕ КАК ОбщееЧислоУЕ,
	|	ВТ_Документы.АктуальнаяРеализация КАК АктуальнаяРеализация
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах.РасшифровкаУслугПоТС КАК ОтчетКомитентуОПродажахРасшифровкаУслугПоТС
	|		ПО ВТ_Документы.АктуальнаяРеализация = ОтчетКомитентуОПродажахРасшифровкаУслугПоТС.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	|		ПО ВТ_Документы.АктуальнаяРеализация = ОтчетКомитентуОПродажах.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	//Евросиб Каблов 16.10.2025 ) #121694
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КорректировкаРеализацииРасшифровкаУслугПоТС.Контейнер,
	|	КорректировкаРеализацииРасшифровкаУслугПоТС.Вагон,
	//Евросиб Каблов 16.10.2025 ( #121694
	|	NULL,
	//Евросиб Каблов 16.10.2025 ) #121694
	|	ВТ_Документы.ОбщееЧислоУЕ,
	|	ВТ_Документы.АктуальнаяРеализация
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.РасшифровкаУслугПоТС КАК КорректировкаРеализацииРасшифровкаУслугПоТС
	|		ПО ВТ_Документы.АктуальнаяРеализация = КорректировкаРеализацииРасшифровкаУслугПоТС.Ссылка
	|			И (НЕ ВТ_Документы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.Аннулирование))";
	
	Запрос.УстановитьПараметр("Ссылка", ОбъектСчет.Ссылка);
	Запрос.УстановитьПараметр("УслугаФрахт", Константы.УслугаФрахтаДляКалькуляции.Получить());
	
	//Евросиб Каблов 16.05.2023 (
	ВремяНачалаЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	//Евросиб Каблов 16.05.2023 )
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	//Евросиб Каблов 16.05.2023 (
	Комментарий = СтрШаблон("Счет %1/%2 Вес = кол-во строк ""ДокументыОснования""", ОбъектСчет.Номер, Формат(ОбъектСчет.Дата, "ДФ=yyyy"));
	ОценкаПроизводительности.ЗакончитьЗамерВремени("ВыполнениеЗапросаПлановыеДоходыПоСчетам", ВремяНачалаЗамера, ОбъектСчет.ДокументыОснования.Количество(), Комментарий);
	//Евросиб Каблов 16.05.2023 )
	
	ТаблицаУслуг = РезультатыЗапроса[9].Выгрузить();
	ТаблицаУчетныхЕдиниц = РезультатыЗапроса[10].Выгрузить();
	ТаблицаВСделках = РезультатыЗапроса[11].Выгрузить();
	//Субботин 72177 11.08.2023 Начало
	УчЕд_РеализацийПоСделке = РезультатыЗапроса[15].Выгрузить();
	//Субботин 72177 11.08.2023 Конец
	
	Если ЗначениеЗаполнено(ОбъектСчет.ДатаДокумента) Тогда
		ДатаДокумента = ОбъектСчет.ДатаДокумента;
	Иначе
		ДатаДокумента = ОбъектСчет.Дата;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбъектСчет.ДатаКурса) Тогда
		ДатаКурса = ОбъектСчет.ДатаКурса;
	Иначе
		ДатаКурса = ДатаДокумента;
	КонецЕсли;
	
	ВалютаДокумента = ОбъектСчет.ВалютаДокумента;
	
	ВидДоходовДопУслуга = Перечисления.ВидыЗадолженности.ДопУслуга;
	ВидДоходовДопУслугаВР = Перечисления.ВидыЗадолженности.ДопУслугаВР;
	//Субботин 72177 18.08.2023 Начало
	ВидДоходаПустой  =	Перечисления.ВидыЗадолженности.ПустаяСсылка();
	//Субботин 72177 18.08.2023 Конец
	
	ПараметрыПоискаВСделке = Новый Структура("Заявка, Вагон, Контейнер");
	
	//Субботин 72177 11.08.2023 Начало
	Если УчЕд_РеализацийПоСделке.Количество() >0 Тогда
		Если УчЕд_РеализацийПоСделке[0].ОбщееЧислоУЕ = 0 тогда
			Возврат
		КонецЕсли;
	КонецЕсли;
	//Субботин 72177 11.08.2023 Конец
	
	Для Каждого СтрокаПоУслуге Из ТаблицаУслуг Цикл
		
		СтрокиПоУчетнымЕдиницам = ТаблицаУчетныхЕдиниц.НайтиСтроки(Новый Структура("Идентификатор", СтрокаПоУслуге.Идентификатор));		
		КоличествоУчетныхЕдиниц = СтрокиПоУчетнымЕдиницам.Количество();
		
		Если КоличествоУчетныхЕдиниц = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СуммаСНДС = ?(ОбъектСчет.СуммаВключаетНДС, СтрокаПоУслуге.Сумма, СтрокаПоУслуге.Сумма + СтрокаПоУслуге.СуммаНДС); 
		
		Количество = Окр(СтрокаПоУслуге.Количество / КоличествоУчетныхЕдиниц, 3);
		Сумма = Окр(СуммаСНДС / КоличествоУчетныхЕдиниц, 2);
		СуммаНДС = Окр(СтрокаПоУслуге.СуммаНДС / КоличествоУчетныхЕдиниц, 2);
		
		КоличествоОстаток = СтрокаПоУслуге.Количество;
		СуммаОстаток = СуммаСНДС;
		СуммаНДСОстаток = СтрокаПоУслуге.СуммаНДС;
		
		
		
		Если СтрокаПоУслуге.ВидДоходов = ВидДоходовДопУслуга Или СтрокаПоУслуге.ВидДоходов = ВидДоходовДопУслугаВР или СтрокаПоУслуге.ВидДоходов = ВидДоходаПустой Тогда
			ПараметрыПоискаВСделке.Вставить("Услуга", СтрокаПоУслуге.Номенклатура);
		Иначе
			ПараметрыПоискаВСделке.Удалить("Услуга");
		КонецЕсли;
		
		Запись = Неопределено;
		Для Каждого СтрокаПоУчетнойЕдинице Из СтрокиПоУчетнымЕдиницам Цикл
			
			КоличествоОстаток = КоличествоОстаток - Количество;
			СуммаОстаток = СуммаОстаток - Сумма;
			СуммаНДСОстаток = СуммаНДСОстаток - СуммаНДС;
			//Субботин 72177 Начало
			Готовность = Неопределено;
			ПараметрыПоискаУЕ = Новый Структура;
			Если ЗначениеЗаполнено(СтрокаПоУчетнойЕдинице.Вагон) тогда
				ПараметрыПоискаУЕ.Вставить("Вагон", СтрокаПоУчетнойЕдинице.Вагон); 
			ИначеЕсли ЗначениеЗаполнено(СтрокаПоУчетнойЕдинице.Контейнер) тогда
				ПараметрыПоискаУЕ.Вставить("Контейнер", СтрокаПоУчетнойЕдинице.Контейнер);
			//Евросиб Каблов 16.10.2025 ( #121694
			ИначеЕсли ЗначениеЗаполнено(СтрокаПоУчетнойЕдинице.Номенклатура) Тогда
				ПараметрыПоискаУЕ.Вставить("Услуга", СтрокаПоУчетнойЕдинице.Номенклатура);
			//Евросиб Каблов 16.10.2025 ) #121694
			КонецЕсли;
			
			ОтфактурованныеУЕ = УчЕд_РеализацийПоСделке.НайтиСтроки(ПараметрыПоискаУЕ);
			Если ОтфактурованныеУЕ.Количество() <> 0 Тогда 
				Продолжить;
			КонецЕсли;
			//Субботин 72177 11.08.2023 Конец
			
		    ЗаполнитьЗначенияСвойств(ПараметрыПоискаВСделке, СтрокаПоУчетнойЕдинице, "Заявка, Контейнер, Вагон");
			СтрокиВСделках = ТаблицаВСделках.НайтиСтроки(ПараметрыПоискаВСделке);
			Если СтрокиВСделках.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			
			//Субботин 72177 04.08.2023 Начало
			Если ПараметрыПоискаВСделке.Свойство("Услуга") тогда
				СтруктураПоискаГотовности  = Новый Структура("Номенклатура,Заявка, Контейнер, Вагон");
				ЗаполнитьЗначенияСвойств(СтруктураПоискаГотовности, СтрокаПоУчетнойЕдинице, "Номенклатура, Заявка, Контейнер, Вагон");
				ГотовностьВСделках = ТаблицаВСделках.НайтиСтроки(СтруктураПоискаГотовности);
				Если ГотовностьВСделках.Количество() <> 0 Тогда
					Готовность = ГотовностьВСделках[0].ГотовоКВыставлению;
				КонецЕсли;
			КонецЕсли;
			//Субботин 72177 04.08.2023 Конец
			
			Запись = ПлановыеДоходыПоАвансовымСчетам.Добавить();
			Запись.Период = ДатаДокумента;
			Запись.Услуга = СтрокаПоУчетнойЕдинице.Номенклатура;
			Запись.Счет = СтрокаПоУчетнойЕдинице.Ссылка;
			Запись.Заявка = СтрокаПоУчетнойЕдинице.Заявка;
			Запись.ЕдиницаИзмерения = СтрокаПоУчетнойЕдинице.ЕдиницаИзмерения;
			Запись.ВидДоходов = СтрокаПоУчетнойЕдинице.ВидДоходов;
			Запись.Валюта = ВалютаДокумента;
			Запись.ДатаКурсаВалюты = ДатаКурса;
			Запись.СтавкаНДС = СтрокаПоУчетнойЕдинице.СтавкаНДС;
			Запись.Вагон = СтрокаПоУчетнойЕдинице.Вагон;
			Запись.Контейнер = СтрокаПоУчетнойЕдинице.Контейнер;
			//Субботин 72177 04.08.2023 Начало
			Запись.ГотовоКВыставлению = Готовность;
			//Субботин 72177 04.08.2023 Конец
			
			Запись.Количество = Количество;
			Запись.Сумма = Сумма;
			Запись.СуммаНДС = СуммаНДС;			
			
		КонецЦикла;
		
		Если Запись <> Неопределено Тогда
			
			Если КоличествоОстаток <> 0 Тогда
				Запись.Количество = Количество + КоличествоОстаток;
			КонецЕсли;
			
			Если СуммаОстаток <> 0 Тогда
				Запись.Сумма = Сумма + СуммаОстаток;
			КонецЕсли;
			
			Если СуммаНДСОстаток <> 0 Тогда
				Запись.СуммаНДС = СуммаНДС + СуммаОстаток;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область УФД

Процедура УФД_СформироватьЗаписиПоЗакрытиюПериода() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ФормированиеЗаписейУФД);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗакрытыеПериодыСрезПоследних.Период КАК Период,
	|	ЗакрытыеПериодыСрезПоследних.Регистратор КАК Регистратор,
	|	ЗакрытыеПериодыСрезПоследних.Организация КАК Организация
	|ПОМЕСТИТЬ ЗакрытыеПериоды
	|ИЗ
	|	РегистрСведений.ЗакрытыеПериоды.СрезПоследних(, ) КАК ЗакрытыеПериодыСрезПоследних
	|ГДЕ
	|	ЗакрытыеПериодыСрезПоследних.Период >= &ДатаНачалаУчетаПлановыхРасходовПолныйФакт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗакрытыеПериоды.Период КАК Период,
	|	ЗакрытыеПериоды.Регистратор КАК Регистратор,
	|	ЗакрытыеПериоды.Организация КАК Организация,
	|	ЕСТЬNULL(СформированыПлановыеРасходыПолныйФакт.Значение, ЛОЖЬ) КАК СформированыПлановыеРасходыПолныйФакт,
	|	ЕСТЬNULL(ЗафиксированыПлановыеРасходыВОПолныйФакт.Значение, ЛОЖЬ) КАК ЗафиксированыПлановыеРасходыПолныйФакт,
	|	ЕСТЬNULL(СформированыЗаписиУФД.Значение, ЛОЖЬ) КАК СформированыЗаписиУФД
	|ИЗ
	|	ЗакрытыеПериоды КАК ЗакрытыеПериоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхАналитикДокументов КАК СформированыПлановыеРасходыПолныйФакт
	|		ПО ЗакрытыеПериоды.Регистратор = СформированыПлановыеРасходыПолныйФакт.Документ
	|			И (СформированыПлановыеРасходыПолныйФакт.Аналитика = &АналитикаСформированыПлановыеРасходыВОПолныйФакт)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхАналитикДокументов КАК ЗафиксированыПлановыеРасходыВОПолныйФакт
	|		ПО ЗакрытыеПериоды.Регистратор = ЗафиксированыПлановыеРасходыВОПолныйФакт.Документ
	|			И (ЗафиксированыПлановыеРасходыВОПолныйФакт.Аналитика = &АналитикаЗафиксированыПлановыеРасходыВОПолныйФакт)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхАналитикДокументов КАК СформированыЗаписиУФД
	|		ПО ЗакрытыеПериоды.Регистратор = СформированыЗаписиУФД.Документ
	|			И (СформированыЗаписиУФД.Аналитика = &АналитикаСформированыЗаписиУФД)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Организация,
	|	Регистратор";
	
	АналитикаСформированыПлановыеРасходыВОПолныйФакт = ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.СформированыПлановыеРасходыВОПолныйФакт;
	АналитикаЗафиксированыПлановыеРасходыВОПолныйФакт = ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.ЗафиксированыПлановыеРасходыВОПолныйФакт;
	АналитикаСформированыЗаписиУФД = ПланыВидовХарактеристик.ДополнительныеАналитикиДокументов.СформированыЗаписиУФД;
	
	Запрос.УстановитьПараметр("АналитикаСформированыПлановыеРасходыВОПолныйФакт", АналитикаСформированыПлановыеРасходыВОПолныйФакт);
	Запрос.УстановитьПараметр("АналитикаЗафиксированыПлановыеРасходыВОПолныйФакт", АналитикаЗафиксированыПлановыеРасходыВОПолныйФакт);
	Запрос.УстановитьПараметр("АналитикаСформированыЗаписиУФД", АналитикаСформированыЗаписиУФД);
	
	Запрос.УстановитьПараметр("ДатаНачалаУчетаПлановыхРасходовПолныйФакт", Константы.ДатаНачалаУчетаПлановыхРасходовПолныйФакт.Получить());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.СформированыПлановыеРасходыПолныйФакт <> Истина Тогда
			СформироватьПлановыеРасходыВОПолныйФакт(Выборка.Период, Выборка.Организация);			
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьАналитикуДокумента(Выборка.Регистратор, АналитикаСформированыПлановыеРасходыВОПолныйФакт, Истина);
		КонецЕсли;
		
		Если Выборка.ЗафиксированыПлановыеРасходыПолныйФакт <> Истина Тогда			
			СформироватьФиксациюИзмененийПлановыхРасходовВОПолныйФакт(Выборка.Регистратор);			
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьАналитикуДокумента(Выборка.Регистратор, АналитикаЗафиксированыПлановыеРасходыВОПолныйФакт, Истина);			
		КонецЕсли;
		
		Если Выборка.СформированыЗаписиУФД <> Истина Тогда
			
			НаборЗаписей = РегистрыСведений.УчетФактическихУправленческихДанных.СоздатьНаборЗаписей();
			ОтборПоПериоду = НаборЗаписей.Отбор.ПериодВО;
			ОтборПоПериоду.Установить(Выборка.Период, Истина);
			НаборЗаписей.Записать();
			
			УФД_СформироватьЗаписиПоФактическимДоходамЗаПериод(Выборка.Период);
			УФД_СформироватьЗаписиПоФактическимРасходамЗаПериод(Выборка.Период);
			УФД_СформироватьЗаписиПоПлановымРасходамЗаПериод(Выборка.Период);
			РегистрыСведений.ЗначенияДополнительныхАналитикДокументов.ЗаписатьАналитикуДокумента(Выборка.Регистратор, АналитикаСформированыЗаписиУФД, Истина);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьПлановыеРасходыВОПолныйФакт(ПериодВО, Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокАкцепт.Ссылка КАК Ссылка,
	|	ДокАкцепт.МоментВремени КАК МоментВремени,
	|	ДокАкцепт.СторнируемыйАкцепт КАК СторнируемыйАкцепт,
	|	ДокАкцепт.ПериодВО КАК ПериодВО,
	|	ДокАкцепт.Поступление КАК Поступление
	|ИЗ
	|	Документ.Акцепт КАК ДокАкцепт
	|ГДЕ
	|	ДокАкцепт.ПериодВО МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ДокАкцепт.Организация = &Организация
	|	И ДокАкцепт.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	МоментВремени";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ПериодВО));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ПериодВО));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ПлановыеРасходыПолныйФакт = РегистрыНакопления.ПлановыеРасходыВОПолныйФакт.СоздатьНаборЗаписей();
		ПлановыеРасходыПолныйФакт.Отбор.Регистратор.Значение = Выборка.Ссылка;
		ПлановыеРасходыПолныйФакт.Отбор.Регистратор.Использование = Истина;
			
		Если ЗначениеЗаполнено(Выборка.СторнируемыйАкцепт) Тогда
			Акцепт_СформироватьДвиженияСторноПлановыеРасходыВОПолныйФакт(Выборка, ПлановыеРасходыПолныйФакт);
		Иначе
			Акцепт_СформироватьДвиженияПлановыеРасходыВОПолныйФакт(Выборка, ПлановыеРасходыПолныйФакт);
		КонецЕсли;
		
		ПлановыеРасходыПолныйФакт.Записать();
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписаниеПлановыхРасходов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СписаниеПлановыхРасходов КАК СписаниеПлановыхРасходов
	|ГДЕ
	|	СписаниеПлановыхРасходов.ПериодСписания = &ПериодСписания
	|	И СписаниеПлановыхРасходов.Организация = &Организация
	|	И СписаниеПлановыхРасходов.Проведен
	|	И СписаниеПлановыхРасходов.ВО
	|
	|УПОРЯДОЧИТЬ ПО
	|	СписаниеПлановыхРасходов.Дата";
	
	Запрос.УстановитьПараметр("ПериодСписания", ПериодВО);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	ВыборкаДокументовСписания = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДокументовСписания.Следующий() Цикл
		СписаниеОбъект = ВыборкаДокументовСписания.Ссылка.ПолучитьОбъект();		
		ТаблицаСписания = ПолучитьТаблицуСписанияПлановыхРасходовПолныйФакт(СписаниеОбъект);
		Списание_СформироватьДвиженияПлановыеРасходыПолныйФакт(СписаниеОбъект, ТаблицаСписания);
		//Если ЗначениеЗаполнено(ТаблицаСписания) Тогда						
		//	ТаблицаСписания.Свернуть("Сделка, Валюта", "СуммаВО, СуммаВОРуб, СуммаУУ, СуммаУУРуб");
		//	СписаниеОбъект.РасходыКСписанию.Загрузить(ТаблицаСписания);
		//	СписаниеОбъект.ОбменДанными.Загрузка = Истина;
		//	СписаниеОбъект.Записать(РежимЗаписиДокумента.Запись);			
		//КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьФиксациюИзмененийПлановыхРасходовВОПолныйФакт(ЗакрытиеПериодаСсылка) Экспорт
	
	ДокОбъект = ЗакрытиеПериодаСсылка.ПолучитьОбъект();
	УчетДоходовРасходовСервер.ЗП_СформироватьДвиженияФиксацияИзмененияПлановыхРасходовВОПолныйФакт(ДокОбъект);
	ДокОбъект.Движения.Записать();
	
КонецПроцедуры

Процедура УФД_СформироватьЗаписиПоФактическимДоходамЗаПериод(ПериодВО)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФактическиеДоходыВО.Период КАК ПериодВО,
	|	ВЫБОР
	|		КОГДА ГОД(ФактическиеДоходыВО.Регистратор.ДатаДокумента) < ГОД(ФактическиеДоходыВО.Период)
	|			ТОГДА &БлокУФДДоходыПрошлыхЛет
	|		ИНАЧЕ &БлокУФДДоходы
	|	КОНЕЦ КАК БлокУФД,
	|	ФактическиеДоходыВО.Регистратор КАК Регистратор,
	|	ФактическиеДоходыВО.Сделка КАК Сделка,
	|	ФактическиеДоходыВО.Услуга КАК Услуга,
	|	ФактическиеДоходыВО.Клиент КАК Клиент,
	|	ФактическиеДоходыВО.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ФактическиеДоходыВО.Вагон КАК Вагон,
	|	ФактическиеДоходыВО.Контейнер КАК Контейнер,
	|	ФактическиеДоходыВО.СтрокаДоходовСделки КАК СтрокаДоходовСделки,
	|	ФактическиеДоходыВО.СуммаРуб - ФактическиеДоходыВО.СуммаНДСРуб КАК СуммаБезНДСРуб,
	|	ФактическиеДоходыВО.МоментВремени КАК МоментВремени,
	|	ФактическиеДоходыВО.Договор КАК Договор
	|ПОМЕСТИТЬ ФактическиеДоходыВО
	|ИЗ
	|	РегистрНакопления.ФактическиеДоходыВО КАК ФактическиеДоходыВО
	|ГДЕ
	|	ФактическиеДоходыВО.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ФактическиеДоходыВО.ТипОперации = &ТипОперацииВыручка
	|	И НЕ ФактическиеДоходыВО.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ФактическиеДоходыВО.Период,
	|	ВЫБОР
	|		КОГДА ГОД(КорректировкаРеализации.ИсходныйДокументРеализации.ДатаДокумента) < ГОД(ФактическиеДоходыВО.Период)
	|			ТОГДА &БлокУФДДоходыПрошлыхЛет
	|		ИНАЧЕ &БлокУФДДоходы
	|	КОНЕЦ,
	|	КорректировкаРеализации.ИсходныйДокументРеализации,
	|	ФактическиеДоходыВО.Сделка,
	|	ФактическиеДоходыВО.Услуга,
	|	ФактическиеДоходыВО.Клиент,
	|	ФактическиеДоходыВО.ИдентификаторСУЕ,
	|	ФактическиеДоходыВО.Вагон,
	|	ФактическиеДоходыВО.Контейнер,
	|	ФактическиеДоходыВО.СтрокаДоходовСделки,
	|	ФактическиеДоходыВО.СуммаРуб - ФактическиеДоходыВО.СуммаНДСРуб,
	|	ФактическиеДоходыВО.МоментВремени,
	|	ФактическиеДоходыВО.Договор
	|ИЗ
	|	РегистрНакопления.ФактическиеДоходыВО КАК ФактическиеДоходыВО
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|		ПО ФактическиеДоходыВО.Регистратор = КорректировкаРеализации.Ссылка
	|ГДЕ
	|	ФактическиеДоходыВО.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ФактическиеДоходыВО.ТипОперации = &ТипОперацииВыручка
	|	И ФактическиеДоходыВО.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблица.ПериодВО КАК ПериодВО,
	|	ВременнаяТаблица.БлокУФД КАК БлокУФД,
	|	ВременнаяТаблица.Регистратор КАК ДокументРегистратор,
	|	ВременнаяТаблица.Сделка КАК Сделка,
	|	ВременнаяТаблица.Услуга КАК Услуга,
	|	ВременнаяТаблица.Клиент КАК Клиент,
	|	ВременнаяТаблица.Договор КАК Договор,
	|	ВременнаяТаблица.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ВременнаяТаблица.Вагон КАК Вагон,
	|	ВременнаяТаблица.Контейнер КАК Контейнер,
	|	СУММА(ВременнаяТаблица.СуммаБезНДСРуб) КАК СуммаБезНДСРуб,
	|	ДокКалькуляция.УчетноеНаправление КАК УчетноеНаправление,
	|	ДокЗаявка.ВидПеревозки КАК ВидПеревозки,
	|	&ВидОперацииДоходы КАК ВидОперации,
	|	ТЕ.ТипТЕ.Рефрижераторный КАК КонтейнерТипТЕРефрижераторный,
	|	ВременнаяТаблица.СтрокаДоходовСделки КАК ГУИДСтрокиДоходов,
	|	СделкаСвязьУчетныхЕдиниц.КлючАналитикиСоставаПоезда КАК СУЕ,
	|	ВременнаяТаблица.МоментВремени КАК МоментВремени
	|ИЗ
	|	ФактическиеДоходыВО КАК ВременнаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция КАК ДокКалькуляция
	|			ПО СделкаСвязьУчетныхЕдиниц.Калькуляция = ДокКалькуляция.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка КАК ДокЗаявка
	|			ПО СделкаСвязьУчетныхЕдиниц.Заявка = ДокЗаявка.Ссылка
	|		ПО ВременнаяТаблица.Сделка = СделкаСвязьУчетныхЕдиниц.Ссылка
	|			И ВременнаяТаблица.ИдентификаторСУЕ = СделкаСвязьУчетныхЕдиниц.ГУИД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТЕ КАК ТЕ
	|		ПО ВременнаяТаблица.Контейнер = ТЕ.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЕ.ТипТЕ.Рефрижераторный,
	|	ВременнаяТаблица.Услуга,
	|	ВременнаяТаблица.ПериодВО,
	|	ВременнаяТаблица.Регистратор,
	|	ДокКалькуляция.УчетноеНаправление,
	|	ВременнаяТаблица.Сделка,
	|	ВременнаяТаблица.СтрокаДоходовСделки,
	|	ВременнаяТаблица.Вагон,
	|	ВременнаяТаблица.ИдентификаторСУЕ,
	|	ВременнаяТаблица.БлокУФД,
	|	ДокЗаявка.ВидПеревозки,
	|	ВременнаяТаблица.Контейнер,
	|	ВременнаяТаблица.Клиент,
	|	СделкаСвязьУчетныхЕдиниц.КлючАналитикиСоставаПоезда,
	|	ВременнаяТаблица.МоментВремени,
	|	ВременнаяТаблица.Договор
	|
	|УПОРЯДОЧИТЬ ПО
	|	БлокУФД,
	|	МоментВремени";
	
	Запрос.УстановитьПараметр("ДатаНачала", ПериодВО);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ПериодВО));
	Запрос.УстановитьПараметр("БлокУФДПустаяСсылка", Справочники.БлокиУФД.ПустаяСсылка());
	Запрос.УстановитьПараметр("БлокУФДДоходыПрошлыхЛет", Справочники.БлокиУФД.ДоходыПрошлыхЛет);
	Запрос.УстановитьПараметр("БлокУФДДоходы", Справочники.БлокиУФД.Доходы);
	Запрос.УстановитьПараметр("ТипОперацииВыручка", Перечисления.ВидыДоходов.Выручка);
	Запрос.УстановитьПараметр("ВидОперацииДоходы", "Доходы");
	
	Выборка = Запрос.Выполнить().Выбрать();
	НомерСтроки = УФД_ПолучитьНомерПоследнейСтрокиПериода(ПериодВО);
	
	КоличествоЗаписейВПорцииДанных = УФД_ПолучитьКоличествоЗаписейВПорцииДанных();
	
	Пока Выборка.СледующийПоЗначениюПоля("БлокУФД") Цикл
		
		НаборЗаписей = РегистрыСведений.УчетФактическихУправленческихДанных.СоздатьНаборЗаписей();	
		ОтборПоПолю = НаборЗаписей.Отбор.ПериодВО;
		ОтборПоПолю.Установить(ПериодВО, Истина);
		ОтборПоПолю = НаборЗаписей.Отбор.БлокУФД;
		ОтборПоПолю.Установить(Выборка.БлокУФД, Истина);
		
		Пока Выборка.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
			НоваяЗапись.НомерСтрокиПериода = НомерСтроки;
			
			ИдентификаторПорции = Цел(НомерСтроки / КоличествоЗаписейВПорцииДанных);
			НоваяЗапись.ИдентификаторПорцииДанных = ИдентификаторПорции;
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура УФД_СформироватьЗаписиПоФактическимРасходамЗаПериод(ПериодВО)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФактическиеРасходыВООбороты.Период КАК Период,
	|	ФактическиеРасходыВООбороты.Сделка КАК Сделка,
	|	ФактическиеРасходыВООбороты.Услуга КАК Услуга,
	|	ФактическиеРасходыВООбороты.Поставщик КАК Поставщик,
	|	ФактическиеРасходыВООбороты.УслугаФакт КАК УслугаФакт,
	|	ФактическиеРасходыВООбороты.Вагон КАК Вагон,
	|	ФактическиеРасходыВООбороты.Контейнер КАК Контейнер,
	|	ФактическиеРасходыВООбороты.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ФактическиеРасходыВООбороты.ВидОперации КАК ВидОперации,
	|	ФактическиеРасходыВООбороты.Клиент КАК Клиент,
	|	ФактическиеРасходыВООбороты.ДоговорКлиента КАК ДоговорКлиента,
	|	ФактическиеРасходыВООбороты.ДатаКурсаВалюты КАК ДатаКурсаВалюты,
	|	ФактическиеРасходыВООбороты.Реализация КАК Реализация,
	|	ФактическиеРасходыВООбороты.Поступление КАК Поступление,
	|	ФактическиеРасходыВООбороты.СуммаРубОборот - ФактическиеРасходыВООбороты.СуммаНДСРубОборот КАК Сумма
	|ПОМЕСТИТЬ ОборотыЗаМесяц
	|ИЗ
	|	РегистрНакопления.ФактическиеРасходыВО.Обороты(&ДатаНачала, &ДатаОкончания, Месяц, ) КАК ФактическиеРасходыВООбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФактическиеРасходыВО.Период КАК Период,
	|	ФактическиеРасходыВО.Регистратор КАК Регистратор,
	|	ФактическиеРасходыВО.Сделка КАК Сделка,
	|	ФактическиеРасходыВО.УслугаФакт КАК Услуга,
	|	ФактическиеРасходыВО.Клиент КАК Клиент,
	|	ФактическиеРасходыВО.ДоговорКлиента КАК ДоговорКлиента,
	|	ФактическиеРасходыВО.Поставщик КАК ПоступлениеКонтрагент,
	|	ФактическиеРасходыВО.СуммаРуб - ФактическиеРасходыВО.СуммаНДСРуб КАК СуммаБезНДСРуб,
	|	ФактическиеРасходыВО.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ФактическиеРасходыВО.Вагон КАК Вагон,
	|	ФактическиеРасходыВО.Контейнер КАК Контейнер,
	|	ФактическиеРасходыВО.ВидОперации КАК ВидОперации,
	|	ФактическиеРасходыВО.СтрокаРасходовСделки КАК СтрокаРасходовСделки,
	|	ФактическиеРасходыВО.ПериодУУ КАК ПериодУУ,
	|	ФактическиеРасходыВО.Поступление.ДоговорКонтрагента КАК ПоступлениеДоговорКонтрагента,
	|	ФактическиеРасходыВО.Реализация.ДатаДокумента КАК РеализацияДатаДокумента,
	|	ФактическиеРасходыВО.МоментВремени КАК МоментВремени,
	|	ФактическиеРасходыВО.НомерСтроки КАК НомерСтроки,
	|	ФактическиеРасходыВО.УслугаФакт.УФД_ИсключаемыеСобственныеРасходыУпр КАК УФД_ИсключаемыеСобственныеРасходыУпр
	|ПОМЕСТИТЬ ФактическиеРасходы
	|ИЗ
	|	ОборотыЗаМесяц КАК ОборотыЗаМесяц
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ФактическиеРасходыВО КАК ФактическиеРасходыВО
	|		ПО ОборотыЗаМесяц.Период = ФактическиеРасходыВО.Период
	|			И ОборотыЗаМесяц.Сделка = ФактическиеРасходыВО.Сделка
	|			И ОборотыЗаМесяц.Услуга = ФактическиеРасходыВО.Услуга
	|			И ОборотыЗаМесяц.Поставщик = ФактическиеРасходыВО.Поставщик
	|			И ОборотыЗаМесяц.Вагон = ФактическиеРасходыВО.Вагон
	|			И ОборотыЗаМесяц.Контейнер = ФактическиеРасходыВО.Контейнер
	|			И ОборотыЗаМесяц.УслугаФакт = ФактическиеРасходыВО.УслугаФакт
	|			И ОборотыЗаМесяц.ИдентификаторСУЕ = ФактическиеРасходыВО.ИдентификаторСУЕ
	|			И ОборотыЗаМесяц.ВидОперации = ФактическиеРасходыВО.ВидОперации
	|			И ОборотыЗаМесяц.Клиент = ФактическиеРасходыВО.Клиент
	|			И ОборотыЗаМесяц.ДоговорКлиента = ФактическиеРасходыВО.ДоговорКлиента
	|			И ОборотыЗаМесяц.ДатаКурсаВалюты = ФактическиеРасходыВО.ДатаКурсаВалюты
	|			И ОборотыЗаМесяц.Реализация = ФактическиеРасходыВО.Реализация
	|			И ОборотыЗаМесяц.Поступление = ФактическиеРасходыВО.Поступление
	|ГДЕ
	|	ФактическиеРасходыВО.ТипОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыРасходов.Возмещаемые)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФактическиеРасходы.Период КАК ПериодВО,
	|	ВЫБОР
	|		КОГДА ФактическиеРасходы.ВидОперации = &ВидОперацииСобственныеЗатраты
	|			ТОГДА ФактическиеРасходы.ПериодУУ
	|		ИНАЧЕ &ПустаяДата
	|	КОНЕЦ КАК ПериодУУ,
	|	ФактическиеРасходы.Регистратор КАК ДокументРегистратор,
	|	ВЫБОР
	|		КОГДА ФактическиеРасходы.ВидОперации = &ВидОперацииСобственныеЗатраты
	|				И ГОД(ФактическиеРасходы.ПериодУУ) < ГОД(ФактическиеРасходы.Период)
	|			ТОГДА &БлокУФДРасходыПрошлыхЛет
	|		КОГДА ФактическиеРасходы.ВидОперации <> &ВидОперацииСобственныеЗатраты
	|				И ГОД(ФактическиеРасходы.РеализацияДатаДокумента) < ГОД(ФактическиеРасходы.Период)
	|			ТОГДА &БлокУФДРасходыПрошлыхЛет
	|		КОГДА Номенклатура.УФД_НижеКонтрибуции
	|			ТОГДА &БлокУФДРасходыПрочиеПрямые
	|		ИНАЧЕ &БлокУФДРасходыФакт
	|	КОНЕЦ КАК БлокУФД,
	|	ФактическиеРасходы.Сделка КАК Сделка,
	|	ФактическиеРасходы.Услуга КАК Услуга,
	|	ФактическиеРасходы.Клиент КАК Клиент,
	|	ФактическиеРасходы.ПоступлениеКонтрагент КАК ПоступлениеКонтрагент,
	|	ФактическиеРасходы.ПоступлениеДоговорКонтрагента КАК Договор,
	|	-ФактическиеРасходы.СуммаБезНДСРуб КАК СуммаБезНДСРуб,
	|	ФактическиеРасходы.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ФактическиеРасходы.Вагон КАК Вагон,
	|	ФактическиеРасходы.Контейнер КАК Контейнер,
	|	ПРЕДСТАВЛЕНИЕ(ФактическиеРасходы.ВидОперации) КАК ВидОперации,
	|	ДокКалькуляция.УчетноеНаправление КАК УчетноеНаправление,
	|	ДокЗаявка.ВидПеревозки КАК ВидПеревозки,
	|	ФактическиеРасходы.СтрокаРасходовСделки КАК ГУИДСтрокиРасходов,
	|	СделкаСвязьУчетныхЕдиниц.КлючАналитикиСоставаПоезда КАК СУЕ,
	|	ФактическиеРасходы.МоментВремени КАК МоментВремени,
	|	ФактическиеРасходы.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ФактическиеРасходы КАК ФактическиеРасходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка КАК ДокЗаявка
	|			ПО СделкаСвязьУчетныхЕдиниц.Заявка = ДокЗаявка.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция КАК ДокКалькуляция
	|			ПО СделкаСвязьУчетныхЕдиниц.Калькуляция = ДокКалькуляция.Ссылка
	|		ПО ФактическиеРасходы.Сделка = СделкаСвязьУчетныхЕдиниц.Ссылка
	|			И ФактическиеРасходы.ИдентификаторСУЕ = СделкаСвязьУчетныхЕдиниц.ГУИД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ФактическиеРасходы.Услуга = Номенклатура.Ссылка
	|ГДЕ
	|	НЕ(ФактическиеРасходы.ВидОперации = &ВидОперацииСобственныеЗатраты
	|				И ФактическиеРасходы.УФД_ИсключаемыеСобственныеРасходыУпр
	|				И ГОД(ФактическиеРасходы.ПериодУУ) >= ГОД(ФактическиеРасходы.Период))
	|
	|УПОРЯДОЧИТЬ ПО
	|	БлокУФД,
	|	МоментВремени,
	|	НомерСтроки
	|ИТОГИ ПО
	|	БлокУФД";
	
	Запрос.УстановитьПараметр("ДатаНачала", ПериодВО);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ПериодВО));
	
	ПустаяДата = '00010101';
	Запрос.УстановитьПараметр("ПустаяДата", ПустаяДата);
	
	Запрос.УстановитьПараметр("БлокУФДПустаяСсылка", Справочники.БлокиУФД.ПустаяСсылка());
	Запрос.УстановитьПараметр("БлокУФДРасходыПрошлыхЛет", Справочники.БлокиУФД.РасходыПрошлыхЛет);
	Запрос.УстановитьПараметр("БлокУФДРасходыПрочиеПрямые", Справочники.БлокиУФД.РасходыПрочиеПрямые);
	Запрос.УстановитьПараметр("БлокУФДРасходыФакт", Справочники.БлокиУФД.РасходыФакт);
	
	Запрос.УстановитьПараметр("ВидОперацииСобственныеЗатраты", Перечисления.ВидОперацииРасходов.СобственныеЗатраты);	
	
	ВыборкаПоБлокамУФД = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	НомерСтроки = УФД_ПолучитьНомерПоследнейСтрокиПериода(ПериодВО);
	
	КоличествоЗаписейВПорцииДанных = УФД_ПолучитьКоличествоЗаписейВПорцииДанных();
	
	Пока ВыборкаПоБлокамУФД.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.УчетФактическихУправленческихДанных.СоздатьНаборЗаписей();	
		ОтборПоПолю = НаборЗаписей.Отбор.ПериодВО;
		ОтборПоПолю.Установить(ПериодВО, Истина);
		ОтборПоПолю = НаборЗаписей.Отбор.БлокУФД;
		ОтборПоПолю.Установить(ВыборкаПоБлокамУФД.БлокУФД, Истина);
		
		Выборка = ВыборкаПоБлокамУФД.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
			НоваяЗапись.НомерСтрокиПериода = НомерСтроки;
			
			ИдентификаторПорции = Цел(НомерСтроки / КоличествоЗаписейВПорцииДанных);
			НоваяЗапись.ИдентификаторПорцииДанных = ИдентификаторПорции;
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
	////////////////////////////
	//Неурегулированные расходы
	
	БлокУФД_РасходыРезервы = Справочники.БлокиУФД.РасходыРезервы;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка,
	|	ПоступлениеТоваровУслугУслуги.Номенклатура КАК Номенклатура,
	|	ПоступлениеТоваровУслуг.Контрагент КАК Контрагент,
	|	ПоступлениеТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ПоступлениеТоваровУслугУслуги.Всего КАК Сумма,
	|	ПоступлениеТоваровУслугУслуги.Всего - ПоступлениеТоваровУслугУслуги.СуммаНДС КАК СуммаБезНДС,
	|	ПоступлениеТоваровУслугУслуги.ГУИДПТУ КАК ГУИДПТУ,
	|	ПоступлениеТоваровУслуг.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	ПоступлениеТоваровУслуг.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслуг.КратностьВзаиморасчетов <> 0
	|			ТОГДА ПоступлениеТоваровУслуг.КурсВзаиморасчетов / ПоступлениеТоваровУслуг.КратностьВзаиморасчетов
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоэффициентПересчетаВРубли,
	|	ПоступлениеТоваровУслуг.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	ПоступлениеТоваровУслугУслуги.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ Поступления
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	|		ПО ПоступлениеТоваровУслуг.Ссылка = ПоступлениеТоваровУслугУслуги.Ссылка
	|ГДЕ
	|	ПоступлениеТоваровУслуг.ДатаВходящегоДокумента МЕЖДУ &ДатаНачалаГода И &ДатаОкончанияПериода
	|	И ПоступлениеТоваровУслуг.Проведен
	|	И НЕ ПоступлениеТоваровУслугУслуги.Номенклатура.УФД_ИсключаемыеИзНеурегулированныхРасходов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаПоступления.Ссылка,
	|	КорректировкаПоступленияУслуги.Номенклатура,
	|	КорректировкаПоступления.Контрагент,
	|	КорректировкаПоступления.ДоговорКонтрагента,
	|	КорректировкаПоступленияУслуги.Всего - (ВЫБОР
	|		КОГДА КорректировкаПоступленияУслуги.ВсегоДоКорректировки = 0
	|			ТОГДА КорректировкаПоступленияУслуги.ВсегоДоИзменения
	|		ИНАЧЕ КорректировкаПоступленияУслуги.ВсегоДоКорректировки
	|	КОНЕЦ),
	|	КорректировкаПоступленияУслуги.Всего - КорректировкаПоступленияУслуги.СуммаНДС - (ВЫБОР
	|		КОГДА КорректировкаПоступленияУслуги.ВсегоДоКорректировки = 0
	|			ТОГДА КорректировкаПоступленияУслуги.ВсегоДоИзменения
	|		ИНАЧЕ КорректировкаПоступленияУслуги.ВсегоДоКорректировки
	|	КОНЕЦ - ВЫБОР
	|		КОГДА КорректировкаПоступленияУслуги.СуммаНДСДоКорректировки = 0
	|			ТОГДА КорректировкаПоступленияУслуги.СуммаНДСДоИзменения
	|		ИНАЧЕ КорректировкаПоступленияУслуги.СуммаНДСДоКорректировки
	|	КОНЕЦ),
	|	КорректировкаПоступленияУслуги.ГУИДПТУ,
	|	КорректировкаПоступления.КратностьВзаиморасчетов,
	|	КорректировкаПоступления.КурсВзаиморасчетов,
	|	ВЫБОР
	|		КОГДА КорректировкаПоступления.КратностьВзаиморасчетов <> 0
	|			ТОГДА КорректировкаПоступления.КурсВзаиморасчетов / КорректировкаПоступления.КратностьВзаиморасчетов
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	КорректировкаПоступления.ДатаВходящегоДокумента,
	|	КорректировкаПоступленияУслуги.НомерСтроки
	|ИЗ
	|	Документ.КорректировкаПоступления КАК КорректировкаПоступления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления.Услуги КАК КорректировкаПоступленияУслуги
	|		ПО КорректировкаПоступления.Ссылка = КорректировкаПоступленияУслуги.Ссылка
	|ГДЕ
	|	КорректировкаПоступления.ДатаВходящегоДокумента МЕЖДУ &ДатаНачалаГода И &ДатаОкончанияПериода
	|	И КорректировкаПоступления.Проведен
	|	И НЕ КорректировкаПоступленияУслуги.Номенклатура.УФД_ИсключаемыеИзНеурегулированныхРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Поступления.Ссылка КАК Ссылка,
	|	Поступления.ГУИДПТУ КАК ГУИДПТУ,
	|	Поступления.Номенклатура КАК Номенклатура,
	|	Поступления.Контрагент КАК Контрагент,
	|	Поступления.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Поступления.Сумма КАК Сумма,
	|	Поступления.СуммаБезНДС КАК СуммаБезНДС,
	|	ЕСТЬNULL(АктуальныеАкцептыСрезПоследних.Акцепт, &АкцептПустаяСсылка) КАК Акцепт,
	|	Поступления.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	Поступления.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	Поступления.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	Поступления.НомерСтроки КАК НомерСтроки,
	|	Поступления.КоэффициентПересчетаВРубли КАК КоэффициентПересчетаВРубли
	|ПОМЕСТИТЬ ПоступленияАкцепты
	|ИЗ
	|	Поступления КАК Поступления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктуальныеАкцепты.СрезПоследних(
	|				,
	|				Поступление В
	|						(ВЫБРАТЬ
	|							Поступления.Ссылка
	|						ИЗ
	|							Поступления)
	|					И Акцепт.ПериодВО <= &ДатаОкончанияПериода) КАК АктуальныеАкцептыСрезПоследних
	|		ПО Поступления.Ссылка = АктуальныеАкцептыСрезПоследних.Поступление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступленияАкцепты.Ссылка КАК Ссылка,
	|	ПоступленияАкцепты.Номенклатура КАК Номенклатура,
	|	ПоступленияАкцепты.Контрагент КАК ПоступлениеКонтрагент,
	|	ПоступленияАкцепты.ДоговорКонтрагента КАК Договор,
	|	ЕСТЬNULL(АкцептУслуги.Ссылка, ПоступленияАкцепты.Ссылка) КАК ДокументРегистратор,
	|	ЕСТЬNULL(АкцептУслуги.Номенклатура, ПоступленияАкцепты.Номенклатура) КАК Услуга,
	|	АкцептУслуги.Контейнер КАК Контейнер,
	|	АкцептУслуги.Вагон КАК Вагон,
	|	СУММА(-ЕСТЬNULL(АкцептУслуги.ПоступлениеСумма, ПоступленияАкцепты.Сумма) - ЕСТЬNULL(АкцептУслуги.Сумма, 0)) КАК Сумма,
	|	СУММА((-ЕСТЬNULL(АкцептУслуги.ПоступлениеСумма - АкцептУслуги.ПоступлениеСуммаНДС, ПоступленияАкцепты.СуммаБезНДС) - ЕСТЬNULL(АкцептУслуги.Сумма - АкцептУслуги.СуммаНДС, 0)) * ПоступленияАкцепты.КоэффициентПересчетаВРубли) КАК СуммаБезНДСРуб,
	|	ПоступленияАкцепты.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента
	|ИЗ
	|	ПоступленияАкцепты КАК ПоступленияАкцепты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Акцепт.Услуги КАК АкцептУслуги
	|		ПО ПоступленияАкцепты.Акцепт = АкцептУслуги.Ссылка
	|			И ПоступленияАкцепты.ГУИДПТУ = АкцептУслуги.ИдентификаторСтрокиПоступления
	|ГДЕ
	|	ЕСТЬNULL(АкцептУслуги.ПоступлениеСумма, ПоступленияАкцепты.Сумма) - ЕСТЬNULL(АкцептУслуги.Сумма, 0) <> 0
	|	И ЕСТЬNULL(АкцептУслуги.Неурег, ЗНАЧЕНИЕ(Справочник.ПричиныНеурегулированныхРасходов.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ПричиныНеурегулированныхРасходов.ОтработкаВРитм)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступленияАкцепты.ДатаВходящегоДокумента,
	|	ПоступленияАкцепты.Ссылка,
	|	ПоступленияАкцепты.Номенклатура,
	|	ЕСТЬNULL(АкцептУслуги.Ссылка, ПоступленияАкцепты.Ссылка),
	|	ПоступленияАкцепты.ДоговорКонтрагента,
	|	АкцептУслуги.Вагон,
	|	ЕСТЬNULL(АкцептУслуги.Номенклатура, ПоступленияАкцепты.Номенклатура),
	|	АкцептУслуги.Контейнер,
	|	ПоступленияАкцепты.Контрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЕСТЬNULL(АкцептУслуги.ПоступлениеСумма, ПоступленияАкцепты.Сумма) - ЕСТЬNULL(АкцептУслуги.Сумма, 0)) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВходящегоДокумента,
	|	Ссылка";
	Запрос.УстановитьПараметр("ДатаНачалаГода", НачалоГода(ПериодВО));
	Запрос.УстановитьПараметр("ДатаОкончанияПериода", КонецМесяца(ПериодВО));
	Запрос.УстановитьПараметр("АкцептПустаяСсылка", Документы.Акцепт.ПустаяСсылка());
	Запрос.УстановитьПараметр("СделкаПустаяСсылка", Документы.Сделка.ПустаяСсылка());
	
	Выборка = Запрос.Выполнить().Выбрать();
	НомерСтроки = УФД_ПолучитьНомерПоследнейСтрокиПериода(ПериодВО);
		
	НаборЗаписей = РегистрыСведений.УчетФактическихУправленческихДанных.СоздатьНаборЗаписей();	
	ОтборПоПолю = НаборЗаписей.Отбор.ПериодВО;
	ОтборПоПолю.Установить(ПериодВО, Истина);
	ОтборПоПолю = НаборЗаписей.Отбор.БлокУФД;
	ОтборПоПолю.Установить(БлокУФД_РасходыРезервы, Истина);
		
	Пока Выборка.Следующий() Цикл
		
		НомерСтроки = НомерСтроки + 1;
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.БлокУФД = БлокУФД_РасходыРезервы;
		НоваяЗапись.ПериодВО = ПериодВО;
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);		
		НоваяЗапись.НомерСтрокиПериода = НомерСтроки;
		
		ИдентификаторПорции = Цел(НомерСтроки / КоличествоЗаписейВПорцииДанных);
		НоваяЗапись.ИдентификаторПорцииДанных = ИдентификаторПорции;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
		
КонецПроцедуры

Процедура УФД_СформироватьЗаписиПоПлановымРасходамЗаПериод(ПериодВО)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФиксацияИзмененияПлановыхРасходовВО.Период КАК Период,
	|	ФиксацияИзмененияПлановыхРасходовВО.Регистратор КАК Регистратор,
	|	ФиксацияИзмененияПлановыхРасходовВО.Сделка КАК Сделка,
	|	ФиксацияИзмененияПлановыхРасходовВО.Услуга КАК Услуга,
	|	ФиксацияИзмененияПлановыхРасходовВО.Поставщик КАК Поставщик,
	|	ФиксацияИзмененияПлановыхРасходовВО.Вагон КАК Вагон,
	|	ФиксацияИзмененияПлановыхРасходовВО.Контейнер КАК Контейнер,
	|	ФиксацияИзмененияПлановыхРасходовВО.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ФиксацияИзмененияПлановыхРасходовВО.ВидОперации КАК ВидОперации,
	|	ФиксацияИзмененияПлановыхРасходовВО.Клиент КАК Клиент,
	|	ФиксацияИзмененияПлановыхРасходовВО.ДоговорКлиента КАК Договор,
	|	ФиксацияИзмененияПлановыхРасходовВО.Реализация КАК Реализация,
	|	ФиксацияИзмененияПлановыхРасходовВО.СуммаРуб - ФиксацияИзмененияПлановыхРасходовВО.СуммаНДСРуб КАК СуммаБезНДСРуб,
	|	ФиксацияИзмененияПлановыхРасходовВО.Услуга.УФД_РасходыПоФакту КАК УслугаУФД_РасходыПоФакту,
	|	ФиксацияИзмененияПлановыхРасходовВО.Услуга.УФД_ИсключаемыеРасходыУпр КАК УФД_ИсключаемыеРасходыУпр,
	|	ФиксацияИзмененияПлановыхРасходовВО.Услуга.УФД_РасходыЕТН_ВГО КАК УслугаУФД_РасходыЕТН_ВГО
	|ПОМЕСТИТЬ ПлановыеРасходы
	|ИЗ
	|	РегистрНакопления.ФиксацияИзмененияПлановыхРасходовВОПолныйФакт КАК ФиксацияИзмененияПлановыхРасходовВО
	|ГДЕ
	|	ФиксацияИзмененияПлановыхРасходовВО.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	//Евросиб Каблов 05.03.2026 ( #126776
	|	И НЕ ФиксацияИзмененияПлановыхРасходовВО.ИсключатьИзУФД
	//Евросиб Каблов 05.03.2026
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлановыеРасходы.Период КАК Период,
	|	ПлановыеРасходы.Регистратор КАК Регистратор,
	|	&БлокУФД_РасходыУПР КАК БлокУФД,
	|	ПлановыеРасходы.Сделка КАК Сделка,
	|	ПлановыеРасходы.Услуга КАК Услуга,
	|	ПлановыеРасходы.Поставщик КАК Поставщик,
	|	ПлановыеРасходы.Вагон КАК Вагон,
	|	ПлановыеРасходы.Контейнер КАК Контейнер,
	|	ПлановыеРасходы.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ПлановыеРасходы.ВидОперации КАК ВидОперации,
	|	ПлановыеРасходы.Клиент КАК Клиент,
	|	ПлановыеРасходы.Договор КАК Договор,
	|	ПлановыеРасходы.Реализация КАК Реализация,
	|	-ПлановыеРасходы.СуммаБезНДСРуб КАК СуммаБезНДСРуб
	|ПОМЕСТИТЬ ПлановыеРасходыПоБлокамУФД
	|ИЗ
	|	ПлановыеРасходы КАК ПлановыеРасходы
	|ГДЕ
	|	ПлановыеРасходы.ВидОперации <> &ВидОперацииВнутренняяСебестоимость
	|	И НЕ ПлановыеРасходы.УФД_ИсключаемыеРасходыУпр
	|	И НЕ ПлановыеРасходы.УслугаУФД_РасходыПоФакту
	|	И НЕ ПлановыеРасходы.УслугаУФД_РасходыЕТН_ВГО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПлановыеРасходы.Период,
	|	ПлановыеРасходы.Регистратор,
	|	&БлокУФД_РасходыВГО,
	|	ПлановыеРасходы.Сделка,
	|	ПлановыеРасходы.Услуга,
	|	ПлановыеРасходы.Поставщик,
	|	ПлановыеРасходы.Вагон,
	|	ПлановыеРасходы.Контейнер,
	|	ПлановыеРасходы.ИдентификаторСУЕ,
	|	ПлановыеРасходы.ВидОперации,
	|	ПлановыеРасходы.Клиент,
	|	ПлановыеРасходы.Договор,
	|	ПлановыеРасходы.Реализация,
	|	-ПлановыеРасходы.СуммаБезНДСРуб
	|ИЗ
	|	ПлановыеРасходы КАК ПлановыеРасходы
	|ГДЕ
	|	ПлановыеРасходы.ВидОперации = &ВидОперацииВнутренняяСебестоимость
	|	И ПлановыеРасходы.УслугаУФД_РасходыЕТН_ВГО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПлановыеРасходы.Период,
	|	ПлановыеРасходы.Регистратор,
	|	&БлокУФД_ДоходыЕТНКоммерческийОтдел,
	|	ПлановыеРасходы.Сделка,
	|	ПлановыеРасходы.Услуга,
	|	ПлановыеРасходы.Поставщик,
	|	ПлановыеРасходы.Вагон,
	|	ПлановыеРасходы.Контейнер,
	|	ПлановыеРасходы.ИдентификаторСУЕ,
	|	ПлановыеРасходы.ВидОперации,
	|	ПлановыеРасходы.Клиент,
	|	ПлановыеРасходы.Договор,
	|	ПлановыеРасходы.Реализация,
	|	ПлановыеРасходы.СуммаБезНДСРуб
	|ИЗ
	|	ПлановыеРасходы КАК ПлановыеРасходы
	|ГДЕ
	|	ПлановыеРасходы.ВидОперации = &ВидОперацииВнутренняяСебестоимость
	|	И ПлановыеРасходы.УслугаУФД_РасходыЕТН_ВГО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПлановыеРасходы.Период,
	|	ПлановыеРасходы.Регистратор,
	|	&БлокУФД_РасходыЕТН_ВГО,
	|	ПлановыеРасходы.Сделка,
	|	ПлановыеРасходы.Услуга,
	|	ПлановыеРасходы.Поставщик,
	|	ПлановыеРасходы.Вагон,
	|	ПлановыеРасходы.Контейнер,
	|	ПлановыеРасходы.ИдентификаторСУЕ,
	|	ПлановыеРасходы.ВидОперации,
	|	ПлановыеРасходы.Клиент,
	|	ПлановыеРасходы.Договор,
	|	ПлановыеРасходы.Реализация,
	|	-ПлановыеРасходы.СуммаБезНДСРуб
	|ИЗ
	|	ПлановыеРасходы КАК ПлановыеРасходы
	|ГДЕ
	|	ПлановыеРасходы.ВидОперации = &ВидОперацииВнутренняяСебестоимость
	|	И ПлановыеРасходы.УслугаУФД_РасходыЕТН_ВГО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПлановыеРасходы.Период,
	|	ПлановыеРасходы.Регистратор,
	|	&БлокУФД_ВыручкаДКП_ВГО,
	|	ПлановыеРасходы.Сделка,
	|	ПлановыеРасходы.Услуга,
	|	ПлановыеРасходы.Поставщик,
	|	ПлановыеРасходы.Вагон,
	|	ПлановыеРасходы.Контейнер,
	|	ПлановыеРасходы.ИдентификаторСУЕ,
	|	ПлановыеРасходы.ВидОперации,
	|	ПлановыеРасходы.Клиент,
	|	ПлановыеРасходы.Договор,
	|	ПлановыеРасходы.Реализация,
	|	ПлановыеРасходы.СуммаБезНДСРуб
	|ИЗ
	|	ПлановыеРасходы КАК ПлановыеРасходы
	|ГДЕ
	|	ПлановыеРасходы.ВидОперации = &ВидОперацииВнутренняяСебестоимость
	|	И ПлановыеРасходы.УслугаУФД_РасходыЕТН_ВГО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлановыеРасходыПоБлокамУФД.Период КАК Период,
	|	ПлановыеРасходыПоБлокамУФД.БлокУФД КАК БлокУФД,
	|	ПлановыеРасходыПоБлокамУФД.Регистратор КАК ДокументРегистратор,
	|	ПлановыеРасходыПоБлокамУФД.Сделка КАК Сделка,
	|	ПлановыеРасходыПоБлокамУФД.Услуга КАК Услуга,
	|	ПлановыеРасходыПоБлокамУФД.Поставщик КАК Поставщик,
	|	ПлановыеРасходыПоБлокамУФД.Вагон КАК Вагон,
	|	ПлановыеРасходыПоБлокамУФД.Контейнер КАК Контейнер,
	|	ПлановыеРасходыПоБлокамУФД.ИдентификаторСУЕ КАК ИдентификаторСУЕ,
	|	ПлановыеРасходыПоБлокамУФД.Клиент КАК Клиент,
	|	ПлановыеРасходыПоБлокамУФД.Договор КАК Договор,
	|	ПлановыеРасходыПоБлокамУФД.Реализация КАК Реализация,
	|	ПРЕДСТАВЛЕНИЕ(ПлановыеРасходыПоБлокамУФД.ВидОперации) КАК ВидОперации,
	|	СделкаСвязьУчетныхЕдиниц.КлючАналитикиСоставаПоезда КАК СУЕ,
	|	ДокКалькуляция.УчетноеНаправление КАК УчетноеНаправление,
	|	ДокЗаявка.ВидПеревозки КАК ВидПеревозки,
	|	ПлановыеРасходыПоБлокамУФД.СуммаБезНДСРуб КАК СуммаБезНДСРуб
	|ИЗ
	|	ПлановыеРасходыПоБлокамУФД КАК ПлановыеРасходыПоБлокамУФД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка КАК ДокЗаявка
	|			ПО СделкаСвязьУчетныхЕдиниц.Заявка = ДокЗаявка.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция КАК ДокКалькуляция
	|			ПО СделкаСвязьУчетныхЕдиниц.Калькуляция = ДокКалькуляция.Ссылка
	|		ПО ПлановыеРасходыПоБлокамУФД.Сделка = СделкаСвязьУчетныхЕдиниц.Ссылка
	|			И ПлановыеРасходыПоБлокамУФД.ИдентификаторСУЕ = СделкаСвязьУчетныхЕдиниц.ГУИД
	|ИТОГИ ПО
	|	БлокУФД";
	
	Запрос.УстановитьПараметр("ДатаНачала", ПериодВО);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ПериодВО));
	
	ПустаяДата = '00010101';
	Запрос.УстановитьПараметр("ПустаяДата", ПустаяДата);
	
	БлокУФДПустаяСсылка = Справочники.БлокиУФД.ПустаяСсылка();
	БлокУФД_РасходыУПР = Справочники.БлокиУФД.РасходыУПР;
	БлокУФД_РасходыВГО = Справочники.БлокиУФД.РасходыВГО;
	БлокУФД_ДоходыЕТНКоммерческийОтдел = Справочники.БлокиУФД.ДоходыЕТНКоммерческийОтдел;
	БлокУФД_РасходыЕТН_ВГО = Справочники.БлокиУФД.РасходыЕТН_ВГО;
	БлокУФД_ВыручкаДКП_ВГО = Справочники.БлокиУФД.ВыручкаДКП_ВГО;	
	
	//СписокНоменклатурыРасходыПоФакту = ПолучитьСписокИсключаемойНоменклатуры("УФД_РасходыПоФакту");
	//Запрос.УстановитьПараметр("СписокНоменклатурыРасходыПоФакту", СписокНоменклатурыРасходыПоФакту);
	
	Запрос.УстановитьПараметр("БлокУФДПустаяСсылка", БлокУФДПустаяСсылка);
	Запрос.УстановитьПараметр("БлокУФД_РасходыУПР", БлокУФД_РасходыУПР);
	Запрос.УстановитьПараметр("БлокУФД_РасходыВГО", БлокУФД_РасходыВГО);
	Запрос.УстановитьПараметр("БлокУФД_ДоходыЕТНКоммерческийОтдел", БлокУФД_ДоходыЕТНКоммерческийОтдел);
	Запрос.УстановитьПараметр("БлокУФД_РасходыЕТН_ВГО", БлокУФД_РасходыЕТН_ВГО);
	Запрос.УстановитьПараметр("БлокУФД_ВыручкаДКП_ВГО", БлокУФД_ВыручкаДКП_ВГО);
	
	Запрос.УстановитьПараметр("ВидОперацииВнутренняяСебестоимость", Перечисления.ВидОперацииРасходов.ВнутренняяСебестоимость);
	Запрос.УстановитьПараметр("ВидОперацииСобственныеЗатраты", Перечисления.ВидОперацииРасходов.СобственныеЗатраты);	
	
	ВыборкаПоБлокам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	НомерСтроки = УФД_ПолучитьНомерПоследнейСтрокиПериода(ПериодВО);
	
	КоличествоЗаписейВПорцииДанных = УФД_ПолучитьКоличествоЗаписейВПорцииДанных();
	
	Пока ВыборкаПоБлокам.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.УчетФактическихУправленческихДанных.СоздатьНаборЗаписей();	
		ОтборПоПолю = НаборЗаписей.Отбор.ПериодВО;
		ОтборПоПолю.Установить(ПериодВО, Истина);
		ОтборПоПолю = НаборЗаписей.Отбор.БлокУФД;
		ОтборПоПолю.Установить(ВыборкаПоБлокам.БлокУФД, Истина);
		
		Выборка = ВыборкаПоБлокам.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			НомерСтроки = НомерСтроки + 1;
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
			НоваяЗапись.ПериодВО = ПериодВО;
			НоваяЗапись.НомерСтрокиПериода = НомерСтроки;
			
			ИдентификаторПорции = Цел(НомерСтроки / КоличествоЗаписейВПорцииДанных);
			НоваяЗапись.ИдентификаторПорцииДанных = ИдентификаторПорции;
			
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция УФД_ПолучитьНомерПоследнейСтрокиПериода(Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(УчетФактическихУправленческихДанных.НомерСтрокиПериода) КАК НомерСтрокиПериода
	|ИЗ
	|	РегистрСведений.УчетФактическихУправленческихДанных КАК УчетФактическихУправленческихДанных
	|ГДЕ
	|	УчетФактическихУправленческихДанных.ПериодВО = &ПериодВО";
	Запрос.УстановитьПараметр("ПериодВО", Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НомерПоследнейСтроки = Неопределено;
	Если Выборка.Следующий() Тогда
		НомерПоследнейСтроки = Выборка.НомерСтрокиПериода;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НомерПоследнейСтроки) Тогда
		НомерПоследнейСтроки = 0;
	КонецЕсли;
	
	Возврат НомерПоследнейСтроки;
	
КонецФункции

Функция УФД_ПолучитьКоличествоЗаписейВПорцииДанных()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиОбменов.КоличествоЗаписейВПорцииДанных КАК КоличествоЗаписейВПорцииДанных
	|ИЗ
	|	Справочник.НастройкиОбменов КАК НастройкиОбменов
	|ГДЕ
	|	НастройкиОбменов.УзелОбмена = &УзелОбмена
	|	И НастройкиОбменов.ИмяМетода = &ИмяМетода";
	Запрос.УстановитьПараметр("УзелОбмена", Перечисления.УзлыОбмена.УПП);
	Запрос.УстановитьПараметр("ИмяМетода", "УФД");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.КоличествоЗаписейВПорцииДанных > 0 Тогда
		КоличествоЗаписейВПорцииДанных = Выборка.КоличествоЗаписейВПорцииДанных;
	Иначе
		КоличествоЗаписейВПорцииДанных = 1000;
	КонецЕсли;
	
	Возврат КоличествоЗаписейВПорцииДанных;
	
КонецФункции

#КонецОбласти

#Область СистемныеПроцедуры

Процедура ПриЗаписиРегистровДоходыРасходыПередЗаписью(Источник, Отказ, Замещение) Экспорт
	//Для каждого Запись Из Источник Цикл
	//	Запись.Период = НачалоМесяца(Запись.Период);
	//КонецЦикла; 
КонецПроцедуры

#КонецОбласти 