
&НаКлиенте
Процедура ЗаполнитьГрузамиВТаре(Команда)
	Объект.Грузы.Очистить();
	ЗаполнитьГрузамиВТареНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГрузамиВТареНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УпаковочныеЛистыОстатки.Груз КАК Груз
	               |ИЗ
	               |	РегистрНакопления.УпаковочныеЛисты.Остатки(, ОборотнаяТара = &ОТ) КАК УпаковочныеЛистыОстатки
	               |ГДЕ
	               |	УпаковочныеЛистыОстатки.ПривязаноОстаток > 0";
	Запрос.УстановитьПараметр("ОТ", Объект.Тара);
	Ответ = запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		Объект.Грузы.Добавить().Груз = Ответ.Груз;
	КонецЦикла;
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )
