Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Организация =  ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("ОсновнаяОрганизация");
	
    НачалоПериодаВозникновенияОстатков = НачалоГода(НачалоГода(ТекущаяДата())-1);
	ОкончаниеПериодаВозникновенияОстатков = НачалоГода(ТекущаяДата())-1;
	//Евросиб - АСуслов 13.03.2024 15:17:35 #82315
	//(
	//ПериодСписания = НачалоГода(ТекущаяДата())-1;
	ПериодСписания = КонтрольДоступностиДокументов_сервер.ПолучитьОткрытыйПериод(Организация);
	//)
	//Евросиб - АСуслов 13.03.2024 15:17:39 #82315
	
	СторноПланаБезФакта = Истина;
	СторноПланаСЧастичнымФактом = Истина;
	УУ = Истина;
	ВО = Истина;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Редактор = неопределено;
	Изменено = неопределено;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если Проведен 
		И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Повторная запись проведенного документа запрещена!");
		Возврат;
	КонецЕсли;
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УчетДоходовРасходовСервер.Списание_СформироватьДвиженияРасходы(ЭтотОбъект);
КонецПроцедуры
