
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Ключ.Пустая() Тогда
		ЗаполнитьТаблицуНаФорме(Параметры.Ключ);
	КонецЕсли;
	
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьВсе(Команда)
	Для Каждого Строка Из ТаблицаДанных Цикл
		Строка.Выбрать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	Для Каждого Строка Из ТаблицаДанных Цикл
		Строка.Выбрать = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВТаблицу(Команда)

	Результат = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.РезультатПодбораКалькуляцияПослеИзменения) Тогда
			Структура = Новый Структура;
			Структура.Вставить("НомерКТК", СтрокаТаблицы.НомерКТК);
			Структура.Вставить("Калькуляция", СтрокаТаблицы.РезультатПодбораКалькуляцияПослеИзменения);
			Результат.Добавить(Структура);
		КонецЕсли;
	КонецЦикла;
	
	Закрыть(Результат);

КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗаполнитьТаблицуНаФорме(ЗаявкаСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаявкаСоставУслуги.НомерСтроки КАК НомерСтроки,
	|	ЗаявкаСоставУслуги.НомерКТК КАК НомерКТК,
	|	ЗаявкаСоставУслуги.Калькуляция КАК ТекущиеДанныеКалькуляцияДоИзменения,
	|	ЗаявкаСоставУслуги.Калькуляция.Номер КАК ТекущиеДанныеНомерКалькуляции,
	|	ЗаявкаСоставУслуги.ПунктОтправления КАК ТекущиеДанныеПунктОтправления,
	|	ЗаявкаСоставУслуги.ПунктНазначения КАК ТекущиеДанныеПунктНазначения,
	|	ЗаявкаСоставУслуги.ПлановаяЛокацияСдачиКТК КАК ПлановаяЛокацияСдачиКТК,
	|	ЗаявкаСоставУслуги.ПСЦ КАК ТекущиеДанныеПротокол,
	|	ЗаявкаСоставУслуги.НомерКТК.ТипТЕ.РазмерКТК КАК НомерКТКТипТЕРазмерКТК
	|ПОМЕСТИТЬ ВТ_ТекущиеДанные
	|ИЗ
	|	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	|ГДЕ
	|	ЗаявкаСоставУслуги.Ссылка = &Ссылка
	|	И ЗаявкаСоставУслуги.НомерКТК <> ЗНАЧЕНИЕ(Справочник.ТЕ.ПустаяСсылка)
	|	И ЗаявкаСоставУслуги.ПСЦ <> ЗНАЧЕНИЕ(Документ.ПСЦ.ПустаяСсылка)
	|	И ЗаявкаСоставУслуги.ПеренесенВЗаявку = ЗНАЧЕНИЕ(Документ.Заявка.ПустаяСсылка)
	|	И ЗаявкаСоставУслуги.ПлановаяЛокацияСдачиКТК <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТекущиеДанные.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТекущиеДанные.НомерКТК КАК НомерКТК,
	|	ВТ_ТекущиеДанные.НомерКТКТипТЕРазмерКТК КАК ТекущиеДанныеРазмерКТК,
	|	ВТ_ТекущиеДанные.ТекущиеДанныеКалькуляцияДоИзменения КАК ТекущиеДанныеКалькуляцияДоИзменения,
	|	ВТ_ТекущиеДанные.ТекущиеДанныеНомерКалькуляции КАК ТекущиеДанныеНомерКалькуляции,
	|	ВТ_ТекущиеДанные.ТекущиеДанныеПунктОтправления КАК ТекущиеДанныеПунктОтправления,
	|	ВТ_ТекущиеДанные.ТекущиеДанныеПунктНазначения КАК ТекущиеДанныеПунктНазначения,
	|	ВТ_ТекущиеДанные.ПлановаяЛокацияСдачиКТК КАК ПлановаяЛокацияСдачиКТК,
	|	ВТ_ТекущиеДанные.ТекущиеДанныеПротокол КАК ТекущиеДанныеПротокол
	|ИЗ
	|	ВТ_ТекущиеДанные КАК ВТ_ТекущиеДанные
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТекущиеДанные.НомерСтроки КАК НомерСтроки,
	|	ДокументКалькуляция.Ссылка КАК ПодобраннаяКалькуляция,
	|	КалькуляцияСписокСтанцийНазначения.Станция КАК Станция
	|ИЗ
	|	ВТ_ТекущиеДанные КАК ВТ_ТекущиеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПСЦ.Калькуляции КАК ПСЦКалькуляции
	|		ПО ВТ_ТекущиеДанные.ТекущиеДанныеПротокол = ПСЦКалькуляции.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция КАК ДокументКалькуляция
	|		ПО (ПСЦКалькуляции.Калькуляция = ДокументКалькуляция.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Калькуляция.СписокСтанцийНазначения КАК КалькуляцияСписокСтанцийНазначения
	|		ПО (ПСЦКалькуляции.Калькуляция = КалькуляцияСписокСтанцийНазначения.Ссылка)
	|ГДЕ
	|	(ВТ_ТекущиеДанные.ПлановаяЛокацияСдачиКТК = КалькуляцияСписокСтанцийНазначения.Станция
	|			ИЛИ ВТ_ТекущиеДанные.ПлановаяЛокацияСдачиКТК = ДокументКалькуляция.Суша_ПунктНазначения)";
	
	Запрос.УстановитьПараметр("Ссылка", ЗаявкаСсылка);
	
	РезультатПакет = Запрос.ВыполнитьПакет();
	
	ПодобранныеКалькуляции = РезультатПакет[РезультатПакет.Количество()-1].Выгрузить();
	
	ТаблицаДанных.Загрузить(РезультатПакет[РезультатПакет.Количество()-2].Выгрузить());
	
	Для Каждого Строка Из ПодобранныеКалькуляции Цикл
		Отбор = Новый Структура("НомерСтроки", Строка.НомерСтроки);
		НайденныеСтроки = ПодобранныеКалькуляции.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() = 1 Тогда
			ДанныеКалькуляции = ПолучитьДанныеКалькуляции(Строка.ПодобраннаяКалькуляция);
			СтрокиТаблицыДанных = ТаблицаДанных.НайтиСтроки(Отбор);
			ЗаполнитьЗначенияСвойств(СтрокиТаблицыДанных[0], ДанныеКалькуляции);
			СтрокиТаблицыДанных[0].Выбрать = Истина;
			СтрокиТаблицыДанных[0].РезультатПодбораПунктНазначенияСписком.ЗагрузитьЗначения(ДанныеКалькуляции.ПунктыНазначения);
			Если СтрокиТаблицыДанных[0].ТекущиеДанныеРазмерКТК = ПредопределенноеЗначение("Справочник.РазмерыКТК.К40") Тогда
				СтрокиТаблицыДанных[0].РезультатПодбораСтавка = ДанныеКалькуляции.Ставка40;
			Иначе
				СтрокиТаблицыДанных[0].РезультатПодбораСтавка = ДанныеКалькуляции.Ставка20;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДанныхРезультатПодбораКалькуляцияПослеИзмененияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаДанных.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПротоколСсылка = ТекущиеДанные.ТекущиеДанныеПротокол;
	Калькуляции = ПолучитьКалькуляцииИзПротокола(ПротоколСсылка);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДоступныеКалькуляции", Калькуляции);
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораКалькуляции", ЭтаФорма, ПараметрыФормы);
	ОткрытьФорму("Документ.Калькуляция.ФормаВыбора", ПараметрыФормы, ,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыВыбораКалькуляции(ВыбраннаяКалькуляция, ДополнительныеПараметры) Экспорт 
	
	ТекущиеДанные = Элементы.ТаблицаДанных.ТекущиеДанные;
	
	Если ВыбраннаяКалькуляция = Неопределено Тогда
		Возврат;
	Иначе
		ДанныеКалькуляции = ПолучитьДанныеКалькуляции(ВыбраннаяКалькуляция);
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДанныеКалькуляции);
		ТекущиеДанные.Выбрать = Истина;
		ТекущиеДанные.РезультатПодбораПунктНазначенияСписком.ЗагрузитьЗначения(ДанныеКалькуляции.ПунктыНазначения);
		Если ТекущиеДанные.ТекущиеДанныеРазмерКТК = ПредопределенноеЗначение("Справочник.РазмерыКТК.К40") Тогда
			ТекущиеДанные.РезультатПодбораСтавка = ДанныеКалькуляции.Ставка40;
		Иначе
			ТекущиеДанные.РезультатПодбораСтавка = ДанныеКалькуляции.Ставка20;
		КонецЕсли;
		Если ЗаполнитьПоПервойСтроке Тогда
			ЗаполнитьПоПервойСтроке(ВыбраннаяКалькуляция);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКалькуляцииИзПротокола(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПСЦКалькуляции.Калькуляция КАК Калькуляция
		|ИЗ
		|	Документ.ПСЦ.Калькуляции КАК ПСЦКалькуляции
		|ГДЕ
		|	ПСЦКалькуляции.Ссылка = &Ссылка
		|	И ПСЦКалькуляции.Калькуляция.Проведен";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СписокКалькуляций = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		СписокКалькуляций.Добавить(Выборка.Калькуляция);
	КонецЦикла;
	
	Возврат СписокКалькуляций;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеКалькуляции(ДокументСсылка)
	
	ДанныеКалькуляции = Новый Структура;
	ДанныеКалькуляции.Вставить("РезультатПодбораНомерКалькуляции", Неопределено);
	ДанныеКалькуляции.Вставить("РезультатПодбораДата", Неопределено);
	ДанныеКалькуляции.Вставить("РезультатПодбораПунктНазначения", Неопределено);
	ДанныеКалькуляции.Вставить("Ставка40", 0);
	ДанныеКалькуляции.Вставить("Ставка20", 0);
	ДанныеКалькуляции.Вставить("РезультатПодбораВалюта", Неопределено);
	ДанныеКалькуляции.Вставить("РезультатПодбораКомментарий", Неопределено);
	ДанныеКалькуляции.Вставить("РезультатПодбораКалькуляцияПослеИзменения", Неопределено);
	ДанныеКалькуляции.Вставить("ПунктыНазначения", Новый Массив);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Калькуляция.Ссылка КАК РезультатПодбораКалькуляцияПослеИзменения,
	|	Калькуляция.Номер КАК РезультатПодбораНомерКалькуляции,
	|	Калькуляция.Дата КАК РезультатПодбораДата,
	|	Калькуляция.Суша_ПунктНазначения КАК РезультатПодбораПунктНазначения,
	|	Калькуляция.ММ_ИтогоВознаграждение КАК Ставка40,
	|	Калькуляция.ММ_ИтогоВознаграждение20 КАК Ставка20,
	|	Калькуляция.Валюта КАК РезультатПодбораВалюта,
	|	Калькуляция.Комментарий КАК РезультатПодбораКомментарий
	|ИЗ
	|	Документ.Калькуляция КАК Калькуляция
	|ГДЕ
	|	Калькуляция.Ссылка = &Калькуляция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Цена20 КАК Себестоимость20,
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Цена40 КАК Себестоимость40
	|ИЗ
	|	Документ.Калькуляция.ММ_КалькуляцияМультимодальнойЦепочки КАК КалькуляцияММ_КалькуляцияМультимодальнойЦепочки
	|ГДЕ
	|	КалькуляцияММ_КалькуляцияМультимодальнойЦепочки.Ссылка = &Калькуляция
	|ИТОГИ
	|	СУММА(Себестоимость20),
	|	СУММА(Себестоимость40)
	|ПО
	|	ОБЩИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КалькуляцияСписокСтанцийНазначения.Станция КАК Станция
	|ИЗ
	|	Документ.Калькуляция.СписокСтанцийНазначения КАК КалькуляцияСписокСтанцийНазначения
	|ГДЕ
	|	КалькуляцияСписокСтанцийНазначения.Ссылка = &Калькуляция";
	
	Запрос.УстановитьПараметр("Калькуляция", ДокументСсылка);
	
	РезультатПакет = Запрос.ВыполнитьПакет();
	
	ТаблицаДанныхКалькуляции = РезультатПакет[РезультатПакет.Количество()-3].Выгрузить();
	СебестоимостьВКалькуляции = РезультатПакет[РезультатПакет.Количество()-2].Выбрать();
	СебестоимостьВКалькуляции.Следующий();
	
	Если ТаблицаДанныхКалькуляции.Количество() > 0 Тогда
		ТаблицаДанныхКалькуляции[0].Ставка20 = ТаблицаДанныхКалькуляции[0].Ставка20 + ?(СебестоимостьВКалькуляции.Себестоимость20 = Неопределено, 0, СебестоимостьВКалькуляции.Себестоимость40);
		ТаблицаДанныхКалькуляции[0].Ставка40 = ТаблицаДанныхКалькуляции[0].Ставка40 + ?(СебестоимостьВКалькуляции.Себестоимость40 = Неопределено, 0, СебестоимостьВКалькуляции.Себестоимость40);
		
		ЗаполнитьЗначенияСвойств(ДанныеКалькуляции, ТаблицаДанныхКалькуляции[0]);
		
		ПунктыНазначения = РезультатПакет[РезультатПакет.Количество()-1].Выгрузить().ВыгрузитьКолонку("Станция");
		
		ДанныеКалькуляции.Вставить("ПунктыНазначения", ПунктыНазначения);
	КонецЕсли;
	
	Возврат ДанныеКалькуляции;
	
КонецФункции

&НаКлиенте
Процедура ТаблицаДанныхРезультатПодбораКалькуляцияПослеИзмененияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаДанных.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		Если Не ЗначениеЗаполнено(ТекущиеДанные.РезультатПодбораКалькуляцияПослеИзменения) Тогда
			ТекущиеДанные.Выбрать = Ложь;
		КонецЕсли;
		Если ЗаполнитьПоПервойСтроке Тогда
			ЗаполнитьПоПервойСтроке(ТекущиеДанные.РезультатПодбораКалькуляцияПослеИзменения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПервойСтроке(ЗначениеПервойСтроки)
	
	СтрокаТабличнойЧасти = Элементы.ТаблицаДанных.ТекущиеДанные;
	
	НомерПервойСтроки = СтрокаТабличнойЧасти.НомерСтроки;
	
	Для Каждого Строка Из ТаблицаДанных Цикл
		Если Строка.НомерСтроки = НомерПервойСтроки Тогда
			ДанныеКалькуляции = ПолучитьДанныеКалькуляции(ЗначениеПервойСтроки);
			Если ЗначениеЗаполнено(ЗначениеПервойСтроки) Тогда
				Строка.Выбрать = Истина;
			Иначе
				Строка.Выбрать = Ложь;
				Строка.РезультатПодбораСтавка = 0;
				Строка.РезультатПодбораПунктНазначенияСписком.Очистить();
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(Строка, ДанныеКалькуляции);
			Строка.РезультатПодбораПунктНазначенияСписком.ЗагрузитьЗначения(ДанныеКалькуляции.ПунктыНазначения);
			НомерПервойСтроки = НомерПервойСтроки + 1;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДанныхРезультатПодбораКалькуляцияПослеИзмененияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Возврат;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДанныхРезультатПодбораКалькуляцияПослеИзмененияОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Текст) Тогда		
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры
