
&НаКлиенте
Процедура ГрупповаяПечать(Команда)
	
//Евросиб Литвинов 05.02.21 task 28203 (
	//ВыделенныеСтр = Элементы.Список.ВыделенныеСтроки;
	//
	//НетПовторов = ПроверитьОдинаковыеДанные(ВыделенныеСтр);
	НетПовторов = э_ОбщиеСервер.ГрупповаяПечать(Элементы.Список.ВыделенныеСтроки);
//Евросиб Литвинов 05.02.21 task 28203 )
	
	Если ТипЗнч(НетПовторов) = Тип("Структура") Тогда
		ОткрытьФорму("ОбщаяФорма.ВыборПодписантов",НетПовторов, ЭтотОбъект);
	Иначе
		ОткрытьФорму("ОбщаяФорма.ВыборПодписантов",, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

 &НаСервереБезКонтекста
Функция СозданиеТаблицыДокументов(ВыделенныеСтроки,СтруктураПодписантов)
	 
	МассивДокументов = ПечатьКомплектаДокументов.СозданиеТаблицыДокументов(ВыделенныеСтроки,СтруктураПодписантов);
	Возврат МассивДокументов;
	 
КонецФункции

//Евросиб Литвинов 05.02.21 task 28203 (
// Функция ПроверитьОдинаковыеДанные(ВыделенныеСтр) - перенесена в ОМ ПечатьКомплектаДокументов
//Евросиб Литвинов 05.02.21 task 28203 )

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ВыделенныеСтр = Элементы.Список.ВыделенныеСтроки;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		МассивДокументов = СозданиеТаблицыДокументов(ВыделенныеСтр,ВыбранноеЗначение);
		
	Иначе
		МассивДокументов = СозданиеТаблицыДокументов(ВыделенныеСтр,Неопределено);
		
	КонецЕсли;
	
	ПараметрКоманды = Новый Массив;
	Для Каждого Элем Из ВыделенныеСтр Цикл
		ПараметрКоманды.Добавить(Элем);
	КонецЦикла;
		
	ПечатьКомплектаДокументов.НапечататьКомплект(МассивДокументов,ПараметрКоманды);

КонецПроцедуры


&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	Попытка //++ Зубов 0243138 14.09.2021 Добавили попытку из-за непонятного исчезновения Ставки НДС 
		Запрос=Новый Запрос;
		Запрос.Текст= "ВЫБРАТЬ
		              |	СчетНаОплатуПокупателюТовары.СтавкаНДС КАК СтавкаНДС,
		              |	СчетНаОплатуПокупателюТовары.Ссылка КАК Ссылка
		              |ИЗ
		              |	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
		              |ГДЕ
		              |	СчетНаОплатуПокупателюТовары.Ссылка В(&Ссылка)
		              |
		              |ОБЪЕДИНИТЬ ВСЕ
		              |
		              |ВЫБРАТЬ
		              |	СчетНаОплатуПокупателюУслуги.СтавкаНДС,
		              |	СчетНаОплатуПокупателюУслуги.Ссылка
		              |ИЗ
		              |	Документ.СчетНаОплатуПокупателю.Услуги КАК СчетНаОплатуПокупателюУслуги
		              |ГДЕ
		              |	СчетНаОплатуПокупателюУслуги.Ссылка В(&Ссылка)" ;
		Запрос.УстановитьПараметр("Ссылка",Строки.ПолучитьКлючи());
		Результат=Запрос.Выполнить().Выгрузить();
		СтавкаНДС="";
		Для каждого Строка из Результат Цикл
			СтавкаНДС=Строка.СтавкаНДС;
			СтрокаСписка= Строки[Строка.Ссылка];
			СтрокаСписка.Данные.СтавкаНДС=СтавкаНДС;
		КонецЦикла;
	Исключение
	КонецПопытки; //-- Зубов 0243138 14.09.2021 Добавили попытку из-за непонятного исчезновения Ставки НДС

КонецПроцедуры


//ДИТ, Беляев СЮ, BUG48279, 05-04-2022, начало
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	КонтрольДоступностиДокументов_сервер.ОбработатьБлокировкуЭлементовФормыСписка(Элементы);

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )  
	
	// Евросиб(ДИТ) BUG 93109 ТА 93110  Сержантова А.С. Начало: 16.10.2024
	Если Элементы.Найти("ФормаДокументРеализацияТоваровУслугСоздатьНаОсновании") <> Неопределено 
		и Элементы.Найти("СписокКонтекстноеМенюДокументРеализацияТоваровУслугСоздатьНаОсновании") <> Неопределено Тогда
		Элементы.ФормаДокументРеализацияТоваровУслугСоздатьНаОсновании.Видимость = Ложь; 
		Элементы.СписокКонтекстноеМенюДокументРеализацияТоваровУслугСоздатьНаОсновании.Видимость = Ложь;
	КонецЕсли;
	// Евросиб(ДИТ) BUG 93109 ТА 93110  Сержантова А.С. Конец: 16.10.2024
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )

//ДИТ, Беляев СЮ, BUG48279, 05-04-2022, конец

