Перем ОбновлениеОперацийПоТСх Экспорт;

Процедура ПередЗаписью(Отказ)
	
	СоответствиеПолей = Новый Соответствие;
	СоответствиеПолей.Вставить("ПунктОтправления", "ПунктОтправления");
	СоответствиеПолей.Вставить("ПунктНазначения", "ПунктНазначения");
	СоответствиеПолей.Вставить("ДатаОтправления", "ДатаОтправления");
	СоответствиеПолей.Вставить("ДатаНазначения", "ДатаНазначения");
	СоответствиеПолей.Вставить("ТипДлительности", "ТипДлительности");
	СоответствиеПолей.Вставить("Срок", "Срок");
	СоответствиеПолей.Вставить("ДатаОтправленияФакт", "ДатаОтправленияФакт");
	СоответствиеПолей.Вставить("ДатаНазначенияФакт", "ДатаНазначенияФакт");
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		
		Для каждого Стр из Ссылка.ТЧ Цикл
			
			Если ЗначениеЗаполнено(Стр.Операция) Тогда
				
				Если ТЧ.НайтиСтроки(Новый Структура("Операция", Стр.Операция)).Количество() = 0 Тогда
					ООбъект = Стр.Операция.ПолучитьОбъект();
					ООбъект.ПометкаУдаления = Истина;
					ООбъект.ПроисходитЗаписьОперацииИзТСх = Истина;
					ООбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ОбновлениеОперацийПоТСх Тогда
		
		Для каждого Стр из ТЧ Цикл
			
			Если ЗначениеЗаполнено(Стр.Операция) И НЕ Стр.Операция.ПометкаУдаления Тогда
				
				НадоОбновлять = Ложь;
				Для каждого Стр2 из СоответствиеПолей Цикл
					НадоОбновлять = НадоОбновлять ИЛИ Стр.Операция[Стр2.Значение] <> Стр[Стр2.Ключ];
				КонецЦикла;
				
				Если НадоОбновлять Тогда
					ООбъект = Стр.Операция.ПолучитьОбъект();
					
					Для каждого Стр2 из СоответствиеПолей Цикл
						ООбъект[Стр2.Значение] = Стр[Стр2.Ключ];
					КонецЦикла;
					ООбъект.ПроисходитЗаписьОперацииИзТСх = Истина;
					ООбъект.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

ОбновлениеОперацийПоТСх = Ложь;