
Процедура ПередЗаписью(Отказ) 
	
	//Евросиб - АСуслов 17.03.2023 17:06:58 #
	//(
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	//)
	//Евросиб - АСуслов 17.03.2023 17:06:59 #
	
	Если Тип = Справочники.ТипыЛокаций.Сток И НЕ РольДоступна("dc_РазрешитьСозданиеСтоков") 
		//Евросиб Гудкова( 09.06.2021 Ticket№ 0234574
		И Не РольДоступна("ПолныеПрава")
		// Евросиб Гудкова)
			Тогда
		Отказ = Истина;
		Сообщить("Установлен запрет на редактирование стоков. Для выдачи разрешения обратитесь к руководителю отдела по работе с подрядчиками.");
		Возврат;
	КонецЕсли;
	
	Если ТаблицаСинонимов.Количество() = 0 Тогда
		Если ЗначениеЗаполнено(Наименование) тогда ТаблицаСинонимов.Добавить().СинонимЛокации = Наименование; КонецЕсли;
		Если ЗначениеЗаполнено(НаименованиеАнгл) тогда ТаблицаСинонимов.Добавить().СинонимЛокации = НаименованиеАнгл; КонецЕсли;
	КонецЕсли;
	//Евросиб Дубская( 12.07.2022 №54432  
	//проверяем - нужно ли передавать в ТЛ
	ДополнительныеСвойства.Вставить("ПередатьВТЛ", Ложь);
	//ДИТ Шевченко А.В. US 62515 ТА 69139 25.04.2023 -Начало
	//Терминал = Справочники.ТипыЛокаций.Терминал;
	МассивТиповДляОтправки = Новый Массив;
	МассивТиповДляОтправки.Добавить(Справочники.ТипыЛокаций.Терминал);
	МассивТиповДляОтправки.Добавить(Справочники.ТипыЛокаций.СтанцияЖД);
	МассивТиповДляОтправки.Добавить(Справочники.ТипыЛокаций.Порт);
	//Если Тип = Терминал 
	//	ИЛИ (Ссылка.Тип = Терминал) Тогда
	
	//КонтактнаяИнфИдентична = ОбщегоНазначения.КоллекцииИдентичны(КонтактнаяИнформация,Ссылка.КонтактнаяИнформация,"Значение"); //ДИТ Шевченко А.В. US 71471 ТА 72952 02.08.2023
	
	Если МассивТиповДляОтправки.Найти(Тип) <> Неопределено 
		ИЛИ (МассивТиповДляОтправки.Найти(Ссылка.Тип) <> Неопределено) Тогда
	//ДИТ Шевченко А.В. US 62515 ТА 69139 25.04.2023 -Конец	
		Если НЕ ЗначениеЗаполнено(Ссылка)
			ИЛИ Ссылка.Тип <> Тип 
			ИЛИ Ссылка.Наименование <> Наименование
			ИЛИ Ссылка.Страна <> Страна
			ИЛИ Ссылка.Адрес <> Адрес 
			ИЛИ Ссылка.ПометкаУдаления <> ПометкаУдаления
			ИЛИ НЕ КонтактнаяИнформацияИдентична() //ДИТ Шевченко А.В. US 71471 ТА 72952 02.08.2023 //Суслов
			Тогда
			
			ДополнительныеСвойства.Вставить("ПередатьВТЛ", Истина); 
		КонецЕсли;
	КонецЕсли;
	//Евросиб Дубская)
	//Евросиб - АСуслов 15.05.2023 12:45:43 #67494
	//(                         
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ТипЛокацииСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Тип");
		Если Тип <> ТипЛокацииСсылка 
			И (Тип = Справочники.ТипыЛокаций.СтанцияЖД 
				ИЛИ ТипЛокацииСсылка = Справочники.ТипыЛокаций.СтанцияЖД) Тогда
			Отказ = Истина;
			Если Тип = Справочники.ТипыЛокаций.СтанцияЖД  Тогда
				ОбщегоНазначения.СообщитьПользователю("Запрещено устанавливать тип локации «Станция ЖД»");
			Иначе	
				ОбщегоНазначения.СообщитьПользователю("Запрещено изменять тип локации «Станция ЖД»");
			КонецЕсли;
		КонецЕсли;                                                                    
	КонецЕсли;
	//)
	//Евросиб - АСуслов 15.05.2023 12:45:49 #67494 
	//Евросиб - АСуслов 04.07.2023 12:09:32 #локации
	//(                               
	//Евросиб - АСуслов 22.09.2023 13:24:12 #74778
	//(
	Если Не Отказ Тогда
		Если Тип = Справочники.ТипыЛокаций.СтанцияЖД Тогда
			Наименование = ВРЕГ(Наименование);
		КонецЕсли;
		Наименование = СтрЗаменить(Наименование, "ё", "е");
		Наименование = СтрЗаменить(Наименование, "Ё", "Е");
	КонецЕсли;
	//)
	//Евросиб - АСуслов 22.09.2023 13:24:19 #74778
	//)
	//Евросиб - АСуслов 04.07.2023 12:09:35 #локации
	//Евросиб - АСуслов 30.10.2023 14:59:23 #76794
	//(
	Если Не ЗначениеЗаполнено(Родитель)
		И ЗначениеЗаполнено(ЛокацияВышестоящегоУровня) Тогда
		Родитель = ЛокацияВышестоящегоУровня;
	КонецЕсли;
	//)
	//Евросиб - АСуслов 30.10.2023 14:59:31 #76794
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ТаблицаСинонимов.Очистить();
	КодЖДСтанции = "";
	ЖелезнаяДорога = Неопределено;
	Погранпереход = Ложь; 
	
	//Евросиб Коханенко Н.А. 03.01.2025 (( #99349 
	Если Тип = ПредопределенноеЗначение("Справочник.ТипыЛокаций.Порт")
			ИЛИ Тип = ПредопределенноеЗначение("Справочник.ТипыЛокаций.Терминал") Тогда
		НаТерминалеИспользуютсяУслугиВнСебестоимости = Ложь;
		Контрагент = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		КвотаПорожние = "";
		КвотаГруженые = "";
		EDIОбменСТерминалами = Ложь;
		ПредставлениеВCodeco = "";
		EmailОбменаСТерминалами = "";
		XmlВерсияРелизаКлиента = Неопределено;
		ОбрабатыватьОтветыEDIОтТерминала = Ложь;
		РучнаяЗагрузкаСтоков = Ложь;
		ТипПодрядчика = Неопределено; 
		КодПортаUNLOCODE = ""; 
		КодПорта = ""; 
		ИдентификаторMAERSK = ""; 
		ИспользованиеПортаВКалькуляции = Неопределено; 
		ИспользуетсяВМаршрутизации = Ложь;
    КонецЕсли;
	//Евросиб Коханенко Н.А. 03.01.2025 )) #99349 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ) 
	
	//Евросиб - АСуслов 14.03.2023 15:30:06 #
	//(
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	//)
	//Евросиб - АСуслов 14.03.2023 15:30:16 #
	
	//Евросиб Коханенко Н.А. 07.05.2025 (( #108950 
	ЗаписатьДанныеИерархии();
	//Евросиб Коханенко Н.А. 07.05.2025 )) #108950 
	
	//Евросиб Дубская( 12.07.2022 №54432  
	//передача                   
	Если ДополнительныеСвойства.ПередатьВТЛ Тогда
		ДанныеТерминала = Новый Структура; 
		ДанныеТерминала.Вставить("Код", Код);
		ДанныеТерминала.Вставить("Наименование", Наименование);
		ДанныеТерминала.Вставить("Страна", Страна.Код);
		ДанныеТерминала.Вставить("Адрес", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Адрес, "Адрес"));   
		ДанныеТерминала.Вставить("Тип", Строка(Тип));

		//Евросиб Коханенко Н.А. 01.02.2024 (( #80535 
		ДанныеТерминала.Вставить("Широта", Число(Широта));
		ДанныеТерминала.Вставить("Долгота", Число(Долгота));
		//Евросиб Коханенко Н.А. 01.02.2024 )) #80535 
		
		//Евросиб Коханенко Н.А. 07.05.2025 (( #108950 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИерархияЛокаций.ЛокацияВышестоящегоУровня.Наименование КАК Регион
			|ИЗ
			|	РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
			|ГДЕ
			|	ИерархияЛокаций.Локация = &Локация
			|	И ИерархияЛокаций.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.Регион)";
		
		Запрос.УстановитьПараметр("Локация", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Регион = Выборка.Регион;
		Иначе
			Регион = "";
		КонецЕсли;
		ДанныеТерминала.Вставить("Регион", Регион);
		//Евросиб Коханенко Н.А. 07.05.2025 )) #108950 
		
		//ДИТ Шевченко А.В. US 62515 ТА 69139 25.04.2023 -Начало
		КонтактыДанные = КонтактнаяИнформация.ВыгрузитьКолонки("Значение,ЗначенияПолей,НомерТелефона,НомерТелефонаБезКодов,Представление");
		МассивОтбораВидов = Новый Массив;
		МассивОтбораВидов.Добавить(Справочники.ВидыКонтактнойИнформации.EmailТерминала);
		МассивОтбораВидов.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефоныЛокации);
		Для Каждого СтрокаКонтакты Из КонтактнаяИнформация Цикл
			Если МассивОтбораВидов.Найти(СтрокаКонтакты.Вид) <> Неопределено Тогда
				НовСтр = КонтактыДанные.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр,СтрокаКонтакты);
			КонецЕсли;	
		КонецЦикла;		
		ДанныеТерминала.Вставить("Телефоны", КонтактыДанные);
		//ДИТ Шевченко А.В. US 62515 ТА 69139 25.04.2023 -Конец
		ДанныеXML = ОбщегоНазначения.ЗначениеВСтрокуXML(ДанныеТерминала);
		Прокси = ВебСервисы_сервер.ПолучитьПрокси("ВебСервисОбменТЛ");
		Попытка
			Ответ = Прокси.UploadLocation(ДанныеXML); 
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Ошибка при выгрузке локации в ТЛ. " + ОписаниеОшибки());
		КонецПопытки;
		Если Ответ <> "" Тогда
			Сообщить(Ответ);
		КонецЕсли;
	КонецЕсли;
	//Евросиб Дубская)
	
	// ДИТ 65310 Давудов М.А. Начало: 16.02.2023
	Если НЕ ПометкаУдаления 
	   И НЕ Отказ
	   И ЗначениеЗаполнено(ПредставлениеВCodeco)
	   И Тип = Справочники.ТипыЛокаций.Терминал Тогда
		ОбновитьДанныеРегистраИнформацияОтТерминалов();
	КонецЕсли;
	// ДИТ 65310 Давудов М.А. Конец: 16.02.2023  
	//Евросиб - АСуслов 21.08.2023 11:52:03 #локации
	//(
	//Евросиб Коханенко Н.А. 07.05.2025 (( #108950 
	//ЗаписатьДанныеИерархии();
	//перенесено в начало процедуры, так как данные регистра нужны для передачи в ТЛ
	//Евросиб Коханенко Н.А. 07.05.2025 )) #108950 
	//)
	//Евросиб - АСуслов 21.08.2023 11:52:06 #локации

КонецПроцедуры   

Процедура ЗаписатьДанныеИерархии()

	нз = РегистрыСведений.ИерархияЛокаций.СоздатьНаборЗаписей();
	нз.Отбор.Локация.Установить(Ссылка);
	нз.Записать();
	
	
	мз = РегистрыСведений.ИерархияЛокаций.СоздатьМенеджерЗаписи();
	мз.Локация = Ссылка;
	мз.ТипИерархии = Перечисления.ТипыИерархииЛокации.Локация; 
	мз.ЛокацияВышестоящегоУровня = Ссылка;
	мз.Записать();
	Если ЗначениеЗаполнено(ЛокацияВышестоящегоУровня) Тогда
		мз = РегистрыСведений.ИерархияЛокаций.СоздатьМенеджерЗаписи();
		мз.Локация = Ссылка;
		мз.ТипИерархии = Перечисления.ТипыИерархииЛокации.Родитель; 
		мз.ЛокацияВышестоящегоУровня = ЛокацияВышестоящегоУровня;
		мз.Записать();
	КонецЕсли;
	

	ТипыЛокацииИерархии = Новый Массив;
	ТипыЛокацииИерархии.Добавить(Справочники.ТипыЛокаций.Регион);
	ТипыЛокацииИерархии.Добавить(Справочники.ТипыЛокаций.Страна);
	ТипыЛокацииИерархии.Добавить(Справочники.ТипыЛокаций.НаселенныйПункт);
	МассивЗначенийИерархии = Новый Массив;
	ПолучитьИерархиюЭлемента(Ссылка, ТипыЛокацииИерархии, МассивЗначенийИерархии);
	Для каждого ЗначениеИерархии Из МассивЗначенийИерархии Цикл
		мз = РегистрыСведений.ИерархияЛокаций.СоздатьМенеджерЗаписи();
		мз.Локация = Ссылка;
		ЗаполнитьЗначенияСвойств(мз, ЗначениеИерархии);
		мз.Записать();
	КонецЦикла;
	
КонецПроцедуры                            

Функция ПолучитьИерархиюЭлемента(Локация, ТипыЛокацииИерархии, МассивЗначенийИерархии)
	ЗначенияРеквизитовЛокации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Локация, "Тип, ЛокацияВышестоящегоУровня");
	Если ТипыЛокацииИерархии.Найти(ЗначенияРеквизитовЛокации.Тип) <> Неопределено Тогда
		СтруктураЗначенийИерархии = Новый Структура("ТипИерархии, ЛокацияВышестоящегоУровня");
		СтруктураЗначенийИерархии.ТипИерархии = Перечисления.ТипыИерархииЛокации[ЗначенияРеквизитовЛокации.Тип.ИмяПредопределенныхДанных];
		СтруктураЗначенийИерархии.ЛокацияВышестоящегоУровня = Локация;
		МассивЗначенийИерархии.Добавить(СтруктураЗначенийИерархии);
	КонецЕсли;
	Если ЗначениеЗаполнено(ЗначенияРеквизитовЛокации.ЛокацияВышестоящегоУровня) Тогда
		ПолучитьИерархиюЭлемента(ЗначенияРеквизитовЛокации.ЛокацияВышестоящегоУровня, ТипыЛокацииИерархии, МассивЗначенийИерархии);
	КонецЕсли;
КонецФункции


Процедура ОбновитьДанныеРегистраИнформацияОтТерминалов()
	// ДИТ 65310 Давудов М.А. Начало: 16.02.2023
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПредставлениеВCodeco", ПредставлениеВCodeco);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИнформацияОтТерминалов.Период КАК Период,
	|	ИнформацияОтТерминалов.Контейнер КАК Контейнер,
	|	ИнформацияОтТерминалов.НомерКонтейнера КАК НомерКонтейнера
	//|	ИнформацияОтТерминалов.КодТерминала КАК КодТерминала  //ДИТ, Беляев СЮ, BUG 67625/TA 72362, 07-07-2023, закомментировал
	|ИЗ
	|	РегистрСведений.ИнформацияОтТерминалов КАК ИнформацияОтТерминалов
	|ГДЕ
	|	ИнформацияОтТерминалов.КодТерминала = &ПредставлениеВCodeco
	|	И ИнформацияОтТерминалов.Терминал = Значение(Справочник.Локации.ПустаяСсылка)";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Попытка
			МенеджерЗаписи = РегистрыСведений.ИнформацияОтТерминалов.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = Выборка.Период;
			МенеджерЗаписи.Контейнер = Выборка.Контейнер;
			МенеджерЗаписи.НомерКонтейнера = Выборка.НомерКонтейнера;
			//МенеджерЗаписи.КодТерминала = Выборка.КодТерминала;  //ДИТ, Беляев СЮ, BUG 67625/TA 72362, 07-07-2023, закомментировал
			МенеджерЗаписи.Прочитать();
			МенеджерЗаписи.Терминал = Ссылка;
			МенеджерЗаписи.Ошибка = Ложь;
			
			МассивСообщений = СтрРазделить(МенеджерЗаписи.КомментарийКОшибке, Символы.ПС, Ложь);
			НовыйМассивСообщений = Новый Массив;
			Для Каждого СообщениеМассива Из МассивСообщений Цикл
				Если СтрНайти(СообщениеМассива,"которого нет в справочнике ""Локации (терминал)"" DataCore") > 0 Тогда
					СообщениеМассива = "";
				Иначе
					НовыйМассивСообщений.Добавить(СообщениеМассива);
				КонецЕсли;
			КонецЦикла;
			МенеджерЗаписи.КомментарийКОшибке = СтрСоединить(НовыйМассивСообщений, Символы.ПС);
			
			РегистрыСведений.ИнформацияОтТерминалов.ПроверитьЗапись(МенеджерЗаписи);
			МенеджерЗаписи.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось обновить терминал в записях регистра: "+ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	// ДИТ 65310 Давудов М.А. Конец: 16.02.2023
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УровеньТипаЛокации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Тип, "Уровень");
	Если УровеньТипаЛокации > 0 
		И НЕ ЗначениеЗаполнено(ЛокацияВышестоящегоУровня) Тогда
		ОбщегоНазначения.СообщитьПользователю("Необходимо заполнить локацию вышестоящего уровня", ЭтотОбъект, "ЛокацияВышестоящегоУровня",,Отказ);
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(ЛокацияВышестоящегоУровня) Тогда
		УровеньТипаЛокацииВышестоящегоУровня = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЛокацияВышестоящегоУровня, "Тип.Уровень");
		УровеньТипаЛокацииВышестоящегоУровня = ?(УровеньТипаЛокацииВышестоящегоУровня = Неопределено, 0, УровеньТипаЛокацииВышестоящегоУровня);
		Если УровеньТипаЛокации <= УровеньТипаЛокацииВышестоящегоУровня Тогда
			ОбщегоНазначения.СообщитьПользователю("Нельзя выбирать локацию вышестоящего уровня с уровнем типа равным или меньше уровню типа текущей локации", ЭтотОбъект, "ЛокацияВышестоящегоУровня",,Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция КонтактнаяИнформацияИдентична()
	Возврат ОбщегоНазначения.КоллекцииИдентичны(КонтактнаяИнформация,Ссылка.КонтактнаяИнформация,"Значение"); //ДИТ Шевченко А.В. US 71471 ТА 72952 02.08.2023
КонецФункции
