
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля = Новый Массив;
	Поля.Добавить("ДатаНачала");
	Поля.Добавить("ДатаОкончания");
	Поля.Добавить("Организация");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = "" + Данные.Организация + " с " + Формат(Данные.ДатаНачала,"ДЛФ=Д") + " по " + Формат(Данные.ДатаОкончания,"ДЛФ=Д");
	
КонецПроцедуры
