
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВалютаРубль = Константы.ВалютаРегламентированногоУчета.Получить();
	
	РаскраситьСтроку = Истина;
	
	ПунктНазначенияПоЗапросу = неопределено;
	
	//Евросиб Каблов 17.11.2023 ( #75269
	Период = НачалоДня(ТекущаяДата());
	Услуга = Параметры.Услуга;
	ПунктОтправления = Параметры.ПунктОтправления;
	ПунктНазначения = Параметры.ПунктНазначения;
	
	Если Параметры.ДляКТКЕвросиб Тогда
		// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
		//ок(
		//СобственностьПеревозимогоКТК = Перечисления.СобственностьПеревозимогоКонтейнера.COC;
		//ок)
		УдалитьСобственностьПеревозимогоКТК = Перечисления.УдалитьСобственностьПеревозимогоКонтейнера.COC;
		ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТЕвросиба;
		// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	ИначеЕсли Параметры.ДляКТККлиента Тогда
		// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
		//ок(
		//СобственностьПеревозимогоКТК = Перечисления.СобственностьПеревозимогоКонтейнера.SOC;
		//ок)
		УдалитьСобственностьПеревозимогоКТК = Перечисления.УдалитьСобственностьПеревозимогоКонтейнера.SOC;
		ПринадлежностьТЕ = Перечисления.ПринадлежностьТЕ.КТКлиента;
		// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	КонецЕсли;
	
	Если Параметры.ТипГруза = Перечисления.ТипыГрузов.КонтейнерыСГрузом Тогда
		СостояниеКТК = Перечисления.СостоянияКТК.Груженый;
	ИначеЕсли Параметры.ТипГруза = Перечисления.ТипыГрузов.КонтейнерыПорожние Тогда
		СостояниеКТК = Перечисления.СостоянияКТК.Порожний;
	КонецЕсли;
	
	Если СостояниеКТК = Перечисления.СостоянияКТК.Груженый Тогда
		Элементы.ГруппаПараметрыГруза.Видимость = Истина;
	Иначе
		Элементы.ГруппаПараметрыГруза.Видимость = Ложь;
	КонецЕсли;
	
	УсловияПеревозки_Отправление = Параметры.УсловияПеревозки_Отправление;
	УсловияПеревозки_Прибытие = Параметры.УсловияПеревозки_Прибытие;
	//Евросиб Каблов 17.11.2023 )	

	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  


&НаКлиенте
Процедура ТЧВыборПриИзменении(Элемент)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВКалькуляцию(Команда)
	
	Поля = "Размер, Валюта, Стоимость, СтавкаНДС, НДСВключенВСтоимость";
	Результат = Новый Массив;
	Для каждого Стр из ТЧ Цикл
		Если Стр.Выбор Тогда
			ДанныеСтроки = Новый Структура(Поля);
			ЗаполнитьЗначенияСвойств(ДанныеСтроки, Стр);
			ДанныеСтроки.Стоимость = ?(Стр.НДСВключенВСтоимость, Стр.СтоимостьСНДС, Стр.СтоимостьБезНДС);
			Результат.Добавить(ДанныеСтроки);
		КонецЕсли;
	КонецЦикла;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	
	ПустаяДата = '00010101';
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТарифыПоставщиковСрезПоследних.Период КАК Период,
	|	ТарифыПоставщиковСрезПоследних.Регистратор КАК Регистратор,
	|	ТарифыПоставщиковСрезПоследних.Критерий КАК Критерий,
	|	ТарифыПоставщиковСрезПоследних.СтоимостьСНДС КАК СтоимостьСНДС,
	|	ТарифыПоставщиковСрезПоследних.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	ТарифыПоставщиковСрезПоследних.Статус КАК Статус,
	|	ТарифыПоставщиковСрезПоследних.ОкончаниеДействия КАК ОкончаниеДействия,
	|	КритерииУслугПоставщиков.Номенклатура КАК Номенклатура,
	|	КритерииУслугПоставщиков.Поставщик КАК Поставщик,
	|	КритерииУслугПоставщиков.ТипоразмерКТК КАК ТипоразмерКТК,
	|	КритерииУслугПоставщиков.БазоваяСтавкаНадбавка КАК БазоваяСтавкаНадбавка,
	|	КритерииУслугПоставщиков.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КритерииУслугПоставщиков.Валюта КАК Валюта,
	|	КритерииУслугПоставщиков.СтавкаНДС КАК СтавкаНДС,
	|	КритерииУслугПоставщиков.ОпасныйГруз КАК ОпасныйГруз,
	|	КритерииУслугПоставщиков.СтандартОпасностиГруза КАК СтандартОпасностиГруза,
	|	КритерииУслугПоставщиков.КлассОпасностиГруза КАК КлассОпасностиГруза,
	|	КритерииУслугПоставщиков.ВидСобственности КАК ВидСобственности,
	|	КритерииУслугПоставщиков.Комментарий КАК Комментарий,
	|	КритерииУслугПоставщиков.ТипоразмерВагона КАК ТипоразмерВагона,
	|	КритерииУслугПоставщиков.СтанцииПогранпереходов КАК СтанцииПогранпереходов,
	|	КритерииУслугПоставщиков.НормаПользования КАК НормаПользования,
	|	КритерииУслугПоставщиков.НормативНахожденияНаПогрузке КАК НормативНахожденияНаПогрузке,
	|	КритерииУслугПоставщиков.НормативНахожденияНаВыгрузке КАК НормативНахожденияНаВыгрузке,
	|	КритерииУслугПоставщиков.СпецГруз КАК СпецГруз,
	|	КритерииУслугПоставщиков.Груз КАК Груз,
	|	КритерииУслугПоставщиков.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	КритерииУслугПоставщиков.КТКВагонОпределенногоСобственника КАК КТКВагонОпределенногоСобственника,
	|	КритерииУслугПоставщиков.ВесГруза КАК ВесГруза,
	|	КритерииУслугПоставщиков.ВидОтправки КАК ВидОтправки,
	|	КритерииУслугПоставщиков.СвободныйПериодХраненияПриОтправке КАК СвободныйПериодХраненияПриОтправке,
	|	КритерииУслугПоставщиков.СвободныйПериодХраненияПриПриеме КАК СвободныйПериодХраненияПриПриеме,
	|	КритерииУслугПоставщиков.СвободныйПериодХраненияУслугиДепо КАК СвободныйПериодХраненияУслугиДепо,
	|	КритерииУслугПоставщиков.СвободныйПериодХранения КАК СвободныйПериодХранения,
	|	КритерииУслугПоставщиков.ТребуетсяДетализацияКомплекснойСтавки КАК ТребуетсяДетализацияКомплекснойСтавки,
	|	КритерииУслугПоставщиков.ГрузРастаможен КАК ГрузРастаможен,
	|	КритерииУслугПоставщиков.ОсобыйТемпературныйРежим КАК ОсобыйТемпературныйРежим,
	|	КритерииУслугПоставщиков.ОсобыйТемпературныйРежимЗначение КАК ОсобыйТемпературныйРежимЗначение,
	|	КритерииУслугПоставщиков.ЭкспортИмпорт КАК ЭкспортИмпорт,
	|	КритерииУслугПоставщиков.ГрузТНВЭД КАК ГрузТНВЭД,
	|	КритерииУслугПоставщиков.КодТНВЭД КАК КодТНВЭД,
	|	КритерииУслугПоставщиков.ВесГрузаКГ КАК ВесГрузаКГ,
	|	КритерииУслугПоставщиков.Грузоотправитель КАК Грузоотправитель,
	|	КритерииУслугПоставщиков.Грузополучатель КАК Грузополучатель,
	|	КритерииУслугПоставщиков.Коносамент КАК Коносамент,
	|	КритерииУслугПоставщиков.Организация КАК Организация,
	|	КритерииУслугПоставщиков.Договор КАК Договор,
	|	КритерииУслугПоставщиков.ТипоразмерКТК.РазмерКТК КАК Размер
	|ИЗ
	|	РегистрСведений.ТарифыПоставщиков.СрезПоследних(&Период, Критерий = &УсловияПоКритерию) КАК ТарифыПоставщиковСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КритерииУслугПоставщиков КАК КритерииУслугПоставщиков
	|		ПО ТарифыПоставщиковСрезПоследних.Критерий = КритерииУслугПоставщиков.Ссылка
	|ГДЕ
	|	(ТарифыПоставщиковСрезПоследних.ОкончаниеДействия >= &Период
	|			ИЛИ ТарифыПоставщиковСрезПоследних.ОкончаниеДействия = &ПустаяДата)";
	
	Запрос.УстановитьПараметр("ПустаяДата", ПустаяДата);
	Запрос.УстановитьПараметр("Период", Период);	
	
	УсловияПоКритерию = Новый Массив;
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		УсловияПоКритерию.Добавить("Критерий.Номенклатура = &Номенклатура");
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Поставщик) Тогда
		УсловияПоКритерию.Добавить("Критерий.Поставщик = &Поставщик");
		Запрос.УстановитьПараметр("Поставщик", Поставщик);		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипоразмерКТК) Тогда
		УсловияПоКритерию.Добавить("Критерий.ТипоразмерКТК = &ТипоразмерКТК");
		Запрос.УстановитьПараметр("ТипоразмерКТК", ТипоразмерКТК);		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПунктОтправления) Тогда
		УсловияПоКритерию.Добавить("Критерий.ПунктОтправления = &ПунктОтправления");
		Запрос.УстановитьПараметр("ПунктОтправления", ПунктОтправления);		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПунктНазначения) Тогда
		УсловияПоКритерию.Добавить("Критерий.ПунктНазначения = &ПунктНазначения");
		Запрос.УстановитьПараметр("ПунктНазначения", ПунктНазначения);		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КлассОпасностиГруза) Тогда
		УсловияПоКритерию.Добавить("Критерий.КлассОпасностиГруза = &КлассОпасностиГруза");
		Запрос.УстановитьПараметр("КлассОпасностиГруза", КлассОпасностиГруза);		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Груз) Тогда
		УсловияПоКритерию.Добавить("Критерий.Груз = &Груз");
		Запрос.УстановитьПараметр("Груз", Груз);		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УсловияПоНДСДляТарифа) Тогда
		УсловияПоКритерию.Добавить("Критерий.СуммаВключаетНДС = &СуммаВключаетНДС");
		Если УсловияПоНДСДляТарифа = Перечисления.ВариантВключенияНДСвСумму.СуммаВключаетНДС Тогда
			Запрос.УстановитьПараметр("СуммаВключаетНДС", Истина);
		Иначе
			Запрос.УстановитьПараметр("СуммаВключаетНДС", Ложь);
		КонецЕсли;
	КонецЕсли;
	
	//Если ЗначениеЗаполнено() Тогда
	//	УсловияПоКритерию.Добавить(" = &");
	//	Запрос.УстановитьПараметр("", );		
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено() Тогда
	//	УсловияПоКритерию.Добавить(" = &");
	//	Запрос.УстановитьПараметр("", );		
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено() Тогда
	//	УсловияПоКритерию.Добавить(" = &");
	//	Запрос.УстановитьПараметр("", );		
	//КонецЕсли;
	
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//Если ЗначениеЗаполнено(СобственностьПеревозимогоКТК) Тогда
	//	Запрос.УстановитьПараметр("СобственностьПеревозимогоКТК", СобственностьПеревозимогоКТК);
	//Иначе
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТарифыПоставщиков.СобственностьПеревозимогоКТК = &СобственностьПеревозимогоКТК", "");
	//КонецЕсли;
	//ок)
	Если ЗначениеЗаполнено(ПринадлежностьТЕ) Тогда
		Запрос.УстановитьПараметр("ПринадлежностьТЕ", ПринадлежностьТЕ);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТарифыПоставщиков.ПринадлежностьТЕ = &ПринадлежностьТЕ", "");
	КонецЕсли;
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	
	Если СостояниеКТК = Перечисления.СостоянияКТК.Груженый Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТарифыПоставщиков.ДляПорожних", "");
	ИначеЕсли СостояниеКТК = Перечисления.СостоянияКТК.Порожний Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТарифыПоставщиков.ДляГруженых", "");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТарифыПоставщиков.ДляПорожних", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТарифыПоставщиков.ДляГруженых", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УсловияПеревозки_Отправление) Тогда
		Запрос.УстановитьПараметр("ПунктОтправленияУсловия", УсловияПеревозки_Отправление);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТарифыПоставщиков.ПунктОтправленияУсловия = &ПунктОтправленияУсловия", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УсловияПеревозки_Прибытие) Тогда
		Запрос.УстановитьПараметр("ПунктНазначенияУсловия", УсловияПеревозки_Прибытие);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТарифыПоставщиков.ПунктНазначенияУсловия = &ПунктНазначенияУсловия", "");
	КонецЕсли;
		
	Если Не БондоваяЗона Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТарифыПоставщиков.БондоваяЗона", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПогранПереход) Тогда
		Запрос.УстановитьПараметр("ПогранПереход", ПогранПереход);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТарифыПоставщиков.ПогранПереход = &ПогранПереход", "");
	КонецЕсли;
	
	Если Не ТарифЗаконтрактован Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТарифыПоставщиков.Законтрактован", "");
	КонецЕсли;
	
	ТекстУсловияПоКритерию = СтрСоединить(УсловияПоКритерию, " И ");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Критерий = &УсловияПоКритерию", ТекстУсловияПоКритерию);
	
	ТЧ.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СостояниеКТКПриИзменении(Элемент)
	
	//Евросиб Каблов 17.11.2023 ( #75269
	//Если СостояниеКТК = ПредопределенноеЗначение("Перечисление.СостоянияКТК.Груженый") Тогда
	//	Элементы.ГруппаПараметрыГруза.Видимость = Истина;
	//Иначе
	//	Элементы.ГруппаПараметрыГруза.Видимость = Ложь;
	//КонецЕсли;
	//Евросиб Каблов 17.11.2023 )
	
КонецПроцедуры
