
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеестрСпециальныхСтавокКонтрагенты.Контрагент КАК Контрагент
		|ИЗ
		|	Документ.РеестрСпециальныхСтавок.Контрагенты КАК РеестрСпециальныхСтавокКонтрагенты
		|ГДЕ
		|	РеестрСпециальныхСтавокКонтрагенты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Параметры.ДокументСсылка);
	
	Контрагенты.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыбранныеКонтрагенты = ПолучитьВыбранныхКонтрагентов();
	
	Закрыть(ВыбранныеКонтрагенты);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВыбранныхКонтрагентов()
	
	Отбор = Новый Структура;
	Отбор.Вставить("Выбрать", Истина);
	ВыбранныйКонтрагенты = Контрагенты.Выгрузить(Отбор, "Контрагент").ВыгрузитьКолонку("Контрагент");
	
	Возврат ВыбранныйКонтрагенты;
	
КонецФункции