&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
// Евросиб (Гонтаренко 28.04.2021 #33906
	//ПретензииИНеакцептыСервер.РазнестиСписокПТУ(ПараметрКоманды);
	//Сообщить("Задача выполнена!");
//Евросиб Гудкова( 02.12.2021 Ticket№ 42922
	УИДЗамера = ОценкаПроизводительностиКлиент.ЗамерВремени("АвторазнесениеКлиент",,Ложь);
// Евросиб Гудкова)
	
	//++ Глеков Д.В. Ticket#0247297 27.01.2022  
	//Если Не ПроверитьВозможностьВыполненияКоманды(ПараметрКоманды) Тогда
	//
	//	ПоказатьПредупреждение(, "Выбраны документы, по которым введена корректировка поступления. Выполнение команды невозможно");
	//	Возврат;
	//
	//КонецЕсли;
	//-- Глеков Д.В. Ticket#0247297 27.01.2022
	ВыполнениеКомандКлиент.ВыполнитьКомандуОднократноеРазнесениеНовыйАлгоритм(ПараметрКоманды, ПараметрыВыполненияКоманды, УИДЗамера);
	//РезультатДлительнойОперации = ЗапуститьФоновоеЗадание(ПараметрКоманды);
	//ДопПараметры = Новый Структура;
	//ДопПараметры.Вставить("РезультатДлительнойОперации", РезультатДлительнойОперации);
	//ДопПараметры.Вставить("Источник", ПараметрыВыполненияКоманды.Источник);
	//
	//Подключаемый_ПроверитьВыполнениеЗадания(, ДопПараметры);
	//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Задача выполнена!");
// Евросиб )Гонтаренко 28.04.2021 #33906
	
КонецПроцедуры

// Евросиб (Гонтаренко 28.04.2021 #33906
&НаСервере
Функция ПроверитьВозможностьВыполненияКоманды(МассивПоступлений)

	//Возврат Документы.Акцепт.ЕстьВозможностьВвестиАкцепт(МассивПоступлений);	

КонецФункции // ПроверитьВозможностьВыполненияКоманды()

//&НаКлиенте
//Процедура Подключаемый_ПроверитьВыполнениеЗадания(Результат = "", ДопПараметры = "")
//	Попытка
//		РезультатДлительнойОперации = ДопПараметры.РезультатДлительнойОперации;
//		Если РезультатДлительнойОперации.Статус = "Выполнено" 
//			Или ЗаданиеВыполнено(РезультатДлительнойОперации.ИдентификаторЗадания) Тогда
//			//РезультатВыполнения = ПолучитьИзВременногоХранилища(РезультатДлительнойОперации.АдресРезультата);
//			//Если РезультатВыполнения = Неопределено Тогда 
//			//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Однократное разнесение ПТУ завершено");
//			//	ПоказатьПредупреждение(, "Разнесение ПТУ не выполнено");
//			//Иначе

//				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Однократное разнесение ПТУ завершено");
//			//КонецЕсли;
//		Иначе
//			ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ДопПараметры.Источник);
//			ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
//			ПараметрыОжидания.Интервал = 1;
//			ОписаниеОповещения = Новый ОписаниеОповещения("Подключаемый_ПроверитьВыполнениеЗадания", ЭтотОбъект, ДопПараметры);
//			ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатДлительнойОперации, ОписаниеОповещения, ПараметрыОжидания);
//		КонецЕсли;
//	Исключение        
//		ВызватьИсключение;
//	КонецПопытки;
//КонецПроцедуры

//&НаСервере
//Функция ЗаданиеВыполнено(ИдентификаторЗадания)    
//     Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);    
// КонецФункции
// 
// &НаСервере
//Функция ЗапуститьФоновоеЗадание(ПараметрКоманды)    
//	УникальныйИдентификаторФЗ = Новый УникальныйИдентификатор;
//	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
//	ПараметрыВыполненияВФоне.ЗапуститьВФоне = Истина;
//	ПараметрыВыполненияВФоне.КлючФоновогоЗадания = "ВыполнитьОднократноеРазнесение" + УникальныйИдентификаторФЗ;
//	ПараметрыВыполненияВФоне.НаименованиеФоновогоЗадания = НСтр("ru = 'Однократное разнесение ПТУ'");

//	//ПретензииИНеакцептыСервер.РазнестиСписокПТУ(ПараметрКоманды);
//	РезультатДлительнойОперации = ДлительныеОперации.ВыполнитьВФоне("ПретензииИНеакцептыСервер.РазнестиСписокПТУ", ПараметрКоманды, ПараметрыВыполненияВФоне);
//	Возврат РезультатДлительнойОперации;
// КонецФункции
//// Евросиб )Гонтаренко 28.04.2021 #33906

