
Процедура ПередЗаписью(Отказ, Замещение)
	Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
		ПроверитьЗаполнитьДатуРесурсаБлокировки(СтрокаНабора,"Поврежден","ДатаПоврежден");
		ПроверитьЗаполнитьДатуРесурсаБлокировки(СтрокаНабора,"ПросроченСВВ","ДатаПросроченСВВ");
		ПроверитьЗаполнитьДатуРесурсаБлокировки(СтрокаНабора,"Другое","ДатаДругое");
		РегистрыСведений.СостояниеБлокировкиКТКАктуальный.СформироватьЗаписьАктуального(СтрокаНабора);
	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьЗаполнитьДатуРесурсаБлокировки(СтрокаНабора, Ресурс, РесурсДаты)
	ЗначениеПризнака = СтрокаНабора[Ресурс];
	ЗначениеДатыПризнака = СтрокаНабора[РесурсДаты];
	Если Не ЗначениеПризнака Тогда
		СтрокаНабора[РесурсДаты] = Неопределено;
	ИначеЕсли Не ЗначениеЗаполнено(ЗначениеДатыПризнака) Тогда
		СтрокаНабора[РесурсДаты] = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры
