// Функция получает название места и возвращает массив наборов координат для него.
// М.б. несколько мест с одним названием
//
// Параметры:
//  Наименование  - Строка - Название локации
//
// Возвращаемое значение:
//   Массив   - Массив структур координат для переданного названия
//
Функция ПолучитьКоординатыПоНаименованию(Наименование) Экспорт

	// основные переменные
	Ключ = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
	
	// готовим файл с данными для отправки
	Тмп = ПолучитьИмяВременногоФайла();
	ВыходнойФайл = ПолучитьИмяВременногоФайла();
	
	ТФайл = Новый ЗаписьТекста(Тмп, КодировкаТекста.ANSI, Символы.ПС, Ложь);
	ТФайл.ЗаписатьСтроку("--" + Ключ + "--");
	ТФайл.Закрыть();
	
	// формируем заголовок запроса
	ФайлРезультат = Новый Файл(Тмп);
	ЗаголовокHTTP = Новый Соответствие();
    ЗаголовокHTTP.Вставить("Content-Type", "multipart/form-data; boundary=" + Ключ);
    
    РазмерФайлаОтправки = XMLСтрока(ФайлРезультат.Размер());
    ЗаголовокHTTP.Вставить("Content-Length", РазмерФайлаОтправки);

	// осуществляем запрос
	ЗС = Новый ЗащищенноеСоединениеOpenSSL;
	НТТР = Новый HTTPСоединение("nominatim.openstreetmap.org",,,,,, ЗС, Ложь);

	РезультатыРазбора = Новый Массив;
	Попытка 
        НТТР.ОтправитьДляОбработки(Тмп, "/search?q=" + Наименование + "&format=xml", ВыходнойФайл, ЗаголовокHTTP);
		ЧХ = Новый ЧтениеXML();
		ЧХ.ОткрытьФайл(ВыходнойФайл);
		ФО = ФабрикаXDTO.ПрочитатьXML(ЧХ);
		Попытка
			Если ТипЗнч(ФО.place) = Тип("ОбъектXDTO") Тогда
				РезультатыРазбора.Добавить(Новый Структура("Наименование, Широта, Долгота", ФО.place.display_name, ФО.place.lat, ФО.place.lon));
			ИначеЕсли ТипЗнч(ФО.place) = Тип("СписокXDTO") Тогда
				Для каждого Стр из ФО.place Цикл
					РезультатыРазбора.Добавить(Новый Структура("Наименование, Широта, Долгота", Стр.display_name, Стр.lat, Стр.lon));
				КонецЦикла;
			КонецЕсли;
		Исключение
			Сообщить("Ничего не найдено. Попробуйте задать название иначе...");
		КонецПопытки;
		ЧХ.Закрыть();
    Исключение 
        Сообщить("Неудачная попытка соединения: " + ОписаниеОшибки()); 
    КонецПопытки; 
	
	УдалитьФайлы(Тмп);

	Возврат РезультатыРазбора;

КонецФункции // ПолучитьКоординатыПоНаименованию()

Функция СоздатьХТМЛ(КаталогГеосервиса, Широта, Долгота, Масштаб = "4", Знач МассивМаркеров = неопределено, Знач МассивЛиний = неопределено, СтруктураПараметров = неопределено) Экспорт
	
	Если МассивМаркеров = неопределено Тогда МассивМаркеров = Новый Массив; КонецЕсли; 
	Если МассивЛиний = неопределено Тогда МассивЛиний = Новый Массив; КонецЕсли;
	
	Результат = "";
	КартографическийДвижок = Константы.КартографическийДвижок.Получить();
	
	Если КартографическийДвижок = Перечисления.КартографическиеДвижки.MapBoxLeafletOSM Тогда
		
		СоздатьЗаголовок(Результат, Широта, Долгота, Масштаб, КаталогГеосервиса);
		Если СтруктураПараметров <> неопределено Тогда // если есть параметры, то переданные маркеры и линии игнорируем
			СформироватьПоПараметрам(Результат, СтруктураПараметров, КаталогГеосервиса);
		Иначе // иначе рисуем то, что нам передали
			Для каждого Стр из МассивМаркеров Цикл
				ДобавитьМаркер(Результат, Стр.Широта, Стр.Долгота, Стр.Подсказка);
			КонецЦикла;
			Для каждого Стр из МассивЛиний Цикл
				ДобавитьЛинию(Результат, Стр.ШиротаНачало, Стр.ДолготаНачало, Стр.ШиротаКонец, Стр.ДолготаКонец, Стр.Цвет, Стр.Пунктиром);
			КонецЦикла;
		КонецЕсли; // конецЕсли
		ДобавитьПодвал(Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура НайтиДобавитьДанныеМестоположения(МассивЛокаций, Местоположение, Графа = неопределено, Аналитика = неопределено, Значение = неопределено, Операция = неопределено)
	
	Если Местоположение.Широта = 0 И Местоположение.Долгота = 0 Тогда Возврат; КонецЕсли;
	
	СтруктураПоиска = Новый Структура("Широта, Долгота, Графа, Аналитика", Местоположение.Широта, Местоположение.Долгота, Графа, Аналитика);
	МассивНайденныхСтрок = МассивЛокаций.НайтиСтроки(СтруктураПоиска);
	
	Если МассивНайденныхСтрок.Количество() = 0 Тогда
		
		НСтр = МассивЛокаций.Добавить();
		НСтр.Местоположение = Местоположение.Местоположение;
		НСтр.Широта = Местоположение.Широта;
		НСтр.Долгота = Местоположение.Долгота;
		НСтр.Графа = Графа;
		НСтр.Аналитика = Аналитика;
		НСтр.Значение = Значение;
		НСтр.Операция = Операция;
		
	Иначе
		
		МассивНайденныхСтрок[0].Значение = МассивНайденныхСтрок[0].Значение + Значение;
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура НайтиДобавитьДанныеЛинии(МассивЛиний, Отправление, Назначение, Пунктиром, Цвет = "")
	
	
	ЛинияНайдена = Ложь;
	
	Для каждого Стр из МассивЛиний Цикл
		
		СтруктураПоиска = Новый Структура("ОтправлениеШирота, ОтправлениеДолгота, НазначениеШирота, НазначениеДолгота", Отправление.Широта, Отправление.Долгота, Назначение.Широта, Назначение.Долгота);
		РезПоиска = МассивЛиний.НайтиСтроки(СтруктураПоиска);
		Если РезПоиска.Количество() > 0 Тогда ЛинияНайдена = Истина; КонецЕсли;
		
		СтруктураПоиска = Новый Структура("ОтправлениеШирота, ОтправлениеДолгота, НазначениеШирота, НазначениеДолгота", Назначение.Широта, Назначение.Долгота, Отправление.Широта, Отправление.Долгота);
		РезПоиска = МассивЛиний.НайтиСтроки(СтруктураПоиска);
		Если РезПоиска.Количество() > 0 Тогда ЛинияНайдена = Истина; КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ЛинияНайдена Тогда
		НСтр = МассивЛиний.Добавить();
		НСтр.ОтправлениеШирота = Отправление.Широта;
		НСтр.ОтправлениеДолгота = Отправление.Долгота;
		НСтр.НазначениеШирота = Назначение.Широта;
		НСтр.НазначениеДолгота = Назначение.Долгота;
		НСтр.Пунктиром = Пунктиром;
		НСтр.Цвет = Цвет;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьМассивОпорныхПунктовПоЗаказу(Заказ, ОтображатьТрек, ТС)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Операция.Ссылка КАК Операция
	               |ИЗ
	               |	Документ.Операция КАК Операция
	               |ГДЕ
	               |	Операция.ПланФакт = ЗНАЧЕНИЕ(Перечисление.ПланФактСчет.Факт)
	               |	И ВЫБОР
	               |			КОГДА &ОтображатьТрек
	               |				ТОГДА Операция.Ссылка В
	               |						(ВЫБРАТЬ
	               |							ОперацияГрузы.Ссылка КАК Ссылка
	               |						ИЗ
	               |							Документ.Операция.Грузы КАК ОперацияГрузы
	               |						ГДЕ
	               |							ОперацияГрузы.ТС В (&ТС))
	               |			ИНАЧЕ Операция.Сделка В (&Заказ)
	               |		КОНЕЦ
	               |	И Операция.Услуга.ОперацияОтображаетсяВГеосервисе";
	
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	СвязиОпераций.Операция
	//               |ИЗ
	//               |	РегистрСведений.СвязиОпераций КАК СвязиОпераций
	//               |ГДЕ
	//               |	СвязиОпераций.ПланФакт = ЗНАЧЕНИЕ(Перечисление.ПланФактСчет.Факт)
	//               |	И ВЫБОР
	//               |			КОГДА &ОтображатьТрек
	//               |				ТОГДА СвязиОпераций.Операция В
	//               |						(ВЫБРАТЬ
	//               |							ГрузыВОперациях.Операция
	//               |						ИЗ
	//               |							РегистрНакопления.ГрузыВОперациях КАК ГрузыВОперациях
	//               |						ГДЕ
	//               |							ГрузыВОперациях.ТС В (&ТС))
	//               |			ИНАЧЕ СвязиОпераций.Заказ = &Заказ
	//               |		КОНЕЦ";
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("ОтображатьТрек", ОтображатьТрек);
	Запрос.УстановитьПараметр("ТС", ТС);
	МассивОпераций = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Операция");
	
	// Результат складывается из 3 составляющих: плановый старт + плановый финиш + пройденные места
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Операция.ДатаОтправления КАК Дата,
	               |	Операция.Ссылка КАК Операция,
	               |	Операция.ПунктОтправления КАК Местоположение,
	               |	Операция.ПунктОтправления.Широта КАК Широта,
	               |	Операция.ПунктОтправления.Долгота КАК Долгота
	               |ПОМЕСТИТЬ Т1
	               |ИЗ
	               |	Документ.Операция КАК Операция
	               |ГДЕ
	               |	Операция.ДатаОтправленияФакт = ДАТАВРЕМЯ(1, 1, 1)
	               |	И Операция.Ссылка В(&Операция)
	               |	И Операция.Услуга.ОперацияОтображаетсяВГеосервисе
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Операция.ДатаНазначения,
	               |	Операция.Ссылка,
	               |	Операция.ПунктНазначения,
	               |	Операция.ПунктНазначения.Широта,
	               |	Операция.ПунктНазначения.Долгота
	               |ИЗ
	               |	Документ.Операция КАК Операция
	               |ГДЕ
	               |	Операция.ДатаНазначенияФакт = ДАТАВРЕМЯ(1, 1, 1)
	               |	И Операция.Ссылка В(&Операция)
	               |	И Операция.Услуга.ОперацияОтображаетсяВГеосервисе
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТректингТранспорта.Период,
	               |	ТректингТранспорта.Операция,
	               |	ТректингТранспорта.Местоположение,
	               |	ВЫБОР
	               |		КОГДА ТректингТранспорта.Широта = 0
	               |			ТОГДА ТректингТранспорта.Местоположение.Широта
	               |		ИНАЧЕ ТректингТранспорта.Широта
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ТректингТранспорта.Долгота = 0
	               |			ТОГДА ТректингТранспорта.Местоположение.Долгота
	               |		ИНАЧЕ ТректингТранспорта.Долгота
	               |	КОНЕЦ
	               |ИЗ
	               |	РегистрСведений.ТректингТранспорта КАК ТректингТранспорта
	               |ГДЕ
	               |	ТректингТранспорта.Операция В(&Операция)
	               |	И ТректингТранспорта.Операция.Услуга.ОперацияОтображаетсяВГеосервисе
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Т1.Дата КАК Дата,
	               |	Т1.Операция КАК Операция,
	               |	Т1.Местоположение КАК Местоположение,
	               |	Т1.Широта КАК Широта,
	               |	Т1.Долгота КАК Долгота
	               |ИЗ
	               |	Т1 КАК Т1
	               |ГДЕ
	               |	(Т1.Широта <> 0
	               |			ИЛИ Т1.Долгота <> 0)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата
	               |ИТОГИ ПО
	               |	Широта,
	               |	Долгота";
	
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ДатыОпераций.ПлановаяДатаНачала КАК Дата,
	//               |	ДатыОпераций.Операция,
	//               |	ДатыОпераций.Операция.ПунктОтправления КАК Местоположение,
	//               |	ДатыОпераций.Операция.ПунктОтправления.Широта КАК Широта,
	//               |	ДатыОпераций.Операция.ПунктОтправления.Долгота КАК Долгота
	//               |ПОМЕСТИТЬ ТЗ1
	//               |ИЗ
	//               |	РегистрСведений.ДатыОпераций КАК ДатыОпераций
	//               |ГДЕ
	//               |	ДатыОпераций.ФактическаяДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	//               |	И ДатыОпераций.Операция В(&Операция)
	//               |
	//               |ОБЪЕДИНИТЬ ВСЕ
	//               |
	//               |ВЫБРАТЬ
	//               |	ДатыОпераций.ПлановаяДатаОкончания,
	//               |	ДатыОпераций.Операция,
	//               |	ДатыОпераций.Операция.ПунктНазначения,
	//               |	ДатыОпераций.Операция.ПунктНазначения.Широта,
	//               |	ДатыОпераций.Операция.ПунктНазначения.Долгота
	//               |ИЗ
	//               |	РегистрСведений.ДатыОпераций КАК ДатыОпераций
	//               |ГДЕ
	//               |	ДатыОпераций.ФактическаяДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	//               |	И ДатыОпераций.Операция В(&Операция)
	//               |
	//               |ОБЪЕДИНИТЬ ВСЕ
	//               |
	//               |ВЫБРАТЬ
	//               |	ТректингТранспорта.Период,
	//               |	ТректингТранспорта.Операция,
	//               |	ТректингТранспорта.Местоположение,
	//               |	ВЫБОР
	//               |		КОГДА ТректингТранспорта.Широта = 0
	//               |			ТОГДА ТректингТранспорта.Местоположение.Широта
	//               |		ИНАЧЕ ТректингТранспорта.Широта
	//               |	КОНЕЦ,
	//               |	ВЫБОР
	//               |		КОГДА ТректингТранспорта.Долгота = 0
	//               |			ТОГДА ТректингТранспорта.Местоположение.Долгота
	//               |		ИНАЧЕ ТректингТранспорта.Долгота
	//               |	КОНЕЦ
	//               |ИЗ
	//               |	РегистрСведений.ТректингТранспорта КАК ТректингТранспорта
	//               |ГДЕ
	//               |	ТректингТранспорта.Операция В(&Операция)
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ТЗ1.Дата КАК Дата,
	//               |	ТЗ1.Операция,
	//               |	ТЗ1.Местоположение,
	//               |	ТЗ1.Широта КАК Широта,
	//               |	ТЗ1.Долгота КАК Долгота
	//               |ИЗ
	//               |	ТЗ1 КАК ТЗ1
	//               |ГДЕ
	//               |	(ТЗ1.Широта <> 0
	//               |			ИЛИ ТЗ1.Долгота <> 0)
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	Дата
	//               |ИТОГИ ПО
	//               |	Широта,
	//               |	Долгота";
	Запрос.УстановитьПараметр("Операция", МассивОпераций);
	ОтветШирота = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ОтветШирота.Следующий() Цикл
		ОтветДолгота = ОтветШирота.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ОтветДолгота.Следующий() Цикл
			
			// местоположение общее
			Местоположение = Справочники.Локации.ПустаяСсылка();
			Подсказка = "";
			
			Ответ = ОтветДолгота.Выбрать();
			Пока Ответ.Следующий() Цикл
				
				Подсказка = Подсказка + "<tr><td style='font-family: verdana; font-size:10px; border-bottom: 1px solid black;'>"+Формат(Ответ.Дата, "ДФ='HH:mm dd.MM.yy'")+"</td><td style='font-family: verdana; font-size:10px; border-bottom: 1px solid black;'><a href='javascript:void(document.getElementById(\""openoperation\"").value = \"""+Ответ.Операция.Номер+"_"+Год(Ответ.Операция.Дата)+"\"");'>"+Ответ.Операция.Услуга + " " + Ответ.Операция.Номер +"</a></td></tr>";
				Местоположение = Ответ.Местоположение;
				
			КонецЦикла;
			
			Подсказка = "<table width='300px'><tr><td colspan='2' style='font-family: verdana; font-size:12px;'><a href='javascript:void(document.getElementById(\""openreport\"").value = \"""+Местоположение.Код+"\"");'>"+Местоположение+" &rArr;</a></td></tr>" + Подсказка;
			
			Результат.Добавить(Новый Структура("Местоположение, Широта, Долгота, Подсказка", Местоположение, ОтветДолгота.Широта, ОтветДолгота.Долгота, Подсказка));
			
		КонецЦикла;
	КонецЦикла;
	
	Возврат Результат;	
	
КонецФункции

Функция ПолучитьНепривязанныеЛинии(СтруктураПараметров)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ "+СтрЗаменить(СтруктураПараметров.КоличествоОтрезков, Символы.НПП, "")+"
	               |	ВЫБОР
	               |		КОГДА ТректингТранспорта.Широта = 0
	               |				И ТректингТранспорта.Долгота = 0
	               |			ТОГДА ТректингТранспорта.Местоположение.Широта
	               |		ИНАЧЕ ТректингТранспорта.Широта
	               |	КОНЕЦ КАК Широта,
	               |	ВЫБОР
	               |		КОГДА ТректингТранспорта.Широта = 0
	               |				И ТректингТранспорта.Долгота = 0
	               |			ТОГДА ТректингТранспорта.Местоположение.Долгота
	               |		ИНАЧЕ ТректингТранспорта.Долгота
	               |	КОНЕЦ КАК Долгота,
	               |	ТректингТранспорта.Операция
	               |ИЗ
	               |	РегистрСведений.ТректингТранспорта КАК ТректингТранспорта
	               |ГДЕ
	               |	ТректингТранспорта.ТС = &ТС
	               |	И (ТректингТранспорта.Широта <> 0
	               |			ИЛИ ТректингТранспорта.Долгота <> 0
	               |			ИЛИ ТректингТранспорта.Местоположение <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка))
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТректингТранспорта.Период УБЫВ";
				   
				   Для каждого ПодТС из СтруктураПараметров.ТС Цикл
					   
					   Запрос.УстановитьПараметр("ТС", ПодТС);
					   Ответ = Запрос.Выполнить().Выгрузить();
					   Если Ответ.Количество() < 3 Тогда Возврат Результат; КонецЕсли;
					   Для Сч = 1 По Ответ.Количество()-2 Цикл
						   Если НЕ ЗначениеЗаполнено(Ответ[Сч].Операция) Тогда
							   Результат.Добавить(Новый Структура("Отправление, Назначение", Новый Структура("Широта, Долгота", Ответ[Сч-1].Широта, Ответ[Сч-1].Долгота), Новый Структура("Широта, Долгота", Ответ[Сч].Широта, Ответ[Сч].Долгота)));
							   Результат.Добавить(Новый Структура("Отправление, Назначение", Новый Структура("Широта, Долгота", Ответ[Сч+1].Широта, Ответ[Сч+1].Долгота), Новый Структура("Широта, Долгота", Ответ[Сч].Широта, Ответ[Сч].Долгота)));
						   КонецЕсли;
					   КонецЦикла;
					   Если НЕ ЗначениеЗаполнено(Ответ[Ответ.Количество()-1].Операция) Тогда
						   Результат.Добавить(Новый Структура("Отправление, Назначение", Новый Структура("Широта, Долгота", Ответ[Ответ.Количество()-1].Широта, Ответ[Ответ.Количество()-1].Долгота), Новый Структура("Широта, Долгота", Ответ[Ответ.Количество()-2].Широта, Ответ[Ответ.Количество()-2].Долгота)));
					   КонецЕсли;
					   Если НЕ ЗначениеЗаполнено(Ответ[0].Операция) Тогда
						   Результат.Добавить(Новый Структура("Отправление, Назначение", Новый Структура("Широта, Долгота", Ответ[0].Широта, Ответ[0].Долгота), Новый Структура("Широта, Долгота", Ответ[1].Широта, Ответ[1].Долгота)));
					   КонецЕсли;
					   
				   КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура СформироватьПоПараметрам(Результат, СтруктураПараметров, КаталогГеосервиса)
	
	ЦветРисуемыхЛиний = "red";
	
	КвалификаторыШиротыДолготы = Новый КвалификаторыЧисла(9, 6, ДопустимыйЗнак.Неотрицательный);
	ОТ_ШД = Новый ОписаниеТипов("Число",,,КвалификаторыШиротыДолготы);
	КС = Новый КвалификаторыСтроки(25, ДопустимаяДлина.Переменная);
	
	МассивЛокаций = Новый ТаблицаЗначений;
	МассивЛокаций.Колонки.Добавить("Местоположение", Новый ОписаниеТипов("СправочникСсылка.Локации"));
	МассивЛокаций.Колонки.Добавить("Широта", ОТ_ШД);
	МассивЛокаций.Колонки.Добавить("Долгота", ОТ_ШД);
	
	МассивЛокаций.Колонки.Добавить("Графа", Новый ОписаниеТипов("Строка",,,,КС));
	
	АналитикаМассив = Новый Массив;
	АналитикаМассив.Добавить(Тип("СправочникСсылка.ТипоразмерыТЕ"));
	АналитикаМассив.Добавить(Тип("СправочникСсылка.ТипоразмерыТС"));
	
	МассивЛокаций.Колонки.Добавить("Аналитика", Новый ОписаниеТипов(АналитикаМассив));
	МассивЛокаций.Колонки.Добавить("Значение", Новый ОписаниеТипов("Число"));
	МассивЛокаций.Колонки.Добавить("Операция", Новый ОписаниеТипов("ДокументСсылка.Операция"));
	МассивЛокаций.Индексы.Добавить("Широта, Долгота, Графа, Аналитика");
	
	МассивЛиний = Новый ТаблицаЗначений;
	МассивЛиний.Колонки.Добавить("ОтправлениеШирота", ОТ_ШД);
	МассивЛиний.Колонки.Добавить("ОтправлениеДолгота", ОТ_ШД);	
	МассивЛиний.Колонки.Добавить("НазначениеШирота", ОТ_ШД);
	МассивЛиний.Колонки.Добавить("НазначениеДолгота", ОТ_ШД);
	МассивЛиний.Колонки.Добавить("Пунктиром", Новый ОписаниеТипов("Булево"));
	МассивЛиний.Колонки.Добавить("Цвет", Новый ОписаниеТипов("Строка"));
	МассивЛиний.Индексы.Добавить("ОтправлениеШирота, ОтправлениеДолгота, НазначениеШирота, НазначениеДолгота");
	
	Если ЗначениеЗаполнено(СтруктураПараметров.Заказ) ИЛИ СтруктураПараметров.ОтобразитьТрек Тогда
		
		СтруктураТрекингаЛиний = ПолучитьДанныеМаршрутовПоТрекингу(СтруктураПараметров);
		Для каждого Стр из СтруктураТрекингаЛиний Цикл
			НайтиДобавитьДанныеЛинии(МассивЛиний, Стр.Отправление, Стр.Назначение, Стр.Пунктиром);
		КонецЦикла;
		
		СтруктураНепривязанныхДвижений = ПолучитьНепривязанныеЛинии(СтруктураПараметров);
		Для каждого Стр из СтруктураНепривязанныхДвижений Цикл
			НайтиДобавитьДанныеЛинии(МассивЛиний, Стр.Отправление, Стр.Назначение, Ложь, "green");
		КонецЦикла;
		
		СчЛиний = 1;
		Для каждого Стр из МассивЛиний Цикл
			Если СчЛиний > СтруктураПараметров.КоличествоОтрезков Тогда Прервать; КонецЕсли;
			ДобавитьЛинию(Результат, Стр.ОтправлениеШирота, Стр.ОтправлениеДолгота, Стр.НазначениеШирота, Стр.НазначениеДолгота, ?(ЗначениеЗаполнено(Стр.Цвет), Стр.Цвет, ЦветРисуемыхЛиний), Стр.Пунктиром);
			СчЛиний = СчЛиний + 1;
		КонецЦикла;
		
		Если НЕ СтруктураПараметров.ОтображатьПрогноз Тогда
			МассивОпорныхПунктов = ПолучитьМассивОпорныхПунктовПоЗаказу(СтруктураПараметров.Заказ, СтруктураПараметров.ОтобразитьТрек, СтруктураПараметров.ТС);
			Для каждого Стр из МассивОпорныхПунктов Цикл
				ДобавитьМаркер(Результат, Стр.Широта, Стр.Долгота, Стр.Подсказка, "tourism");
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	// Если это не прогноз, то надо отобразить текущее местоположение грузов по операциям и маршруты по трекингу
	Если НЕ СтруктураПараметров.ОтображатьПрогноз Тогда
		
		СтруктураТрекингаТранспорта = ПолучитьДанныеТрекингаНаДату(СтруктураПараметров);
		Для каждого Стр из СтруктураТрекингаТранспорта Цикл
			НайтиДобавитьДанныеМестоположения(МассивЛокаций, Стр.Местоположение,,,,Стр.Операция);
		КонецЦикла;
		
	Иначе
		
		// -------------------- ОСТАТКИ -------------------- //
		Запрос = Новый Запрос;
		
		Если СтруктураПараметров.РежимОтображенияТСТЕ = 0 Тогда
			
			Запрос.Текст = "ВЫБРАТЬ
			               |	ПозицияВагоновФактОстатки.ТипВагона КАК Тип,
			               |	ПозицияВагоновФактОстатки.ФактОстаток КАК Количество,
			               |	ПозицияВагоновФактОстатки.Локация КАК Местоположение,
			               |	ПозицияВагоновФактОстатки.Локация.Долгота КАК Долгота,
			               |	ПозицияВагоновФактОстатки.Локация.Широта КАК Широта
			               |ИЗ
			               |	РегистрНакопления.ПозицияВагоновФакт.Остатки(&ДатаФактОстатков, ) КАК ПозицияВагоновФактОстатки
			               |ГДЕ
			               |	(ПозицияВагоновФактОстатки.Локация В ИЕРАРХИИ (&Местоположение)
			               |			ИЛИ &Местоположение = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка))
						   //|	И (ПозицияВагоновФактОстатки.Сделка В (&Заказ)
						   //|			ИЛИ &ЗаказПустой)
			               |	И ПозицияВагоновФактОстатки.ФактОстаток <> 0
						   //|	И ВЫБОР
						   //|			КОГДА &ОтображатьТС = 1
						   //|				ТОГДА ПозицияВагоновФактОстатки.Груженое
						   //|			КОГДА &ОтображатьТС = 2
						   //|				ТОГДА НЕ ПозицияВагоновФактОстатки.Груженое
						   //|			ИНАЧЕ ИСТИНА
						   //|		КОНЕЦ
			               |	И ВЫБОР
			               |			КОГДА &ТипТСЗаполнено
			               |				ТОГДА ПозицияВагоновФактОстатки.ТипВагона В (&ТипТС)
			               |			ИНАЧЕ ИСТИНА
			               |		КОНЕЦ
			               |	И ВЫБОР
			               |			КОГДА &ТСЗаполнено
			               |				ТОГДА ПозицияВагоновФактОстатки.Вагон В (&ТС)
			               |			ИНАЧЕ ИСТИНА
			               |		КОНЕЦ
			               |	И ВЫБОР
			               |			КОГДА &ВладелецТСЗаполнено
			               |				ТОГДА ПозицияВагоновФактОстатки.Вагон.ВладелецТС В (&ВладелецТС)
			               |			ИНАЧЕ ИСТИНА
			               |		КОНЕЦ";
			
		Иначе
			
			Запрос.Текст = "ВЫБРАТЬ
			               |	ПозицияКонтейнеровФактОстатки.ФактОстаток КАК Количество,
			               |	ПозицияКонтейнеровФактОстатки.Локация КАК Местоположение,
			               |	ПозицияКонтейнеровФактОстатки.Локация.Долгота КАК Долгота,
			               |	ПозицияКонтейнеровФактОстатки.Локация.Широта КАК Широта,
			               |	ПозицияКонтейнеровФактОстатки.ТипКТК КАК Тип,
			               |	ПозицияКонтейнеровФактОстатки.Контейнер КАК Контейнер
			               |ПОМЕСТИТЬ ВТ
			               |ИЗ
			               |	РегистрНакопления.ПозицияКонтейнеровФакт.Остатки(&ДатаФактОстатков, ) КАК ПозицияКонтейнеровФактОстатки
			               |ГДЕ
			               |	(ПозицияКонтейнеровФактОстатки.Локация В ИЕРАРХИИ (&Местоположение)
			               |			ИЛИ &Местоположение = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка))
						   //|	И (ПозицияКонтейнеровФактОстатки.Сделка В (&Заказ)
						   //|			ИЛИ &ЗаказПустой)
			               |	И ПозицияКонтейнеровФактОстатки.ФактОстаток <> 0
						   //|	И ВЫБОР
						   //|			КОГДА &ОтображатьТЕ = 1
						   //|				ТОГДА ПозицияКонтейнеровФактОстатки.Груженое
						   //|			КОГДА &ОтображатьТЕ = 2
						   //|				ТОГДА НЕ ПозицияКонтейнеровФактОстатки.Груженое
						   //|			ИНАЧЕ ИСТИНА
						   //|		КОНЕЦ
			               |	И ВЫБОР
			               |			КОГДА &ТипТЕЗаполнено
			               |				ТОГДА ПозицияКонтейнеровФактОстатки.ТипКТК В (&ТипТЕ)
			               |			ИНАЧЕ ИСТИНА
			               |		КОНЕЦ
			               |	И ВЫБОР
			               |			КОГДА &ТЕЗаполнено
			               |				ТОГДА ПозицияКонтейнеровФактОстатки.Контейнер В (&ТЕ)
			               |			ИНАЧЕ ИСТИНА
			               |		КОНЕЦ
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВТ.Количество КАК Количество,
			               |	ВТ.Местоположение КАК Местоположение,
			               |	ВТ.Долгота КАК Долгота,
			               |	ВТ.Широта КАК Широта,
			               |	ВТ.Тип КАК Тип,
			               |	ПризнакСобственностиКонтейнераСрезПоследних.ВладелецКТК КАК ВладелецТЕ
			               |ИЗ
			               |	ВТ КАК ВТ
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПризнакСобственностиКонтейнера.СрезПоследних(
			               |				&ДатаФактОстатков,
			               |				Контейнер В
			               |					(ВЫБРАТЬ
			               |						ВТ.Контейнер
			               |					ИЗ
			               |						Вт КАК ВТ)) КАК ПризнакСобственностиКонтейнераСрезПоследних
			               |		ПО ВТ.Контейнер = ПризнакСобственностиКонтейнераСрезПоследних.Контейнер
			               |ГДЕ
			               |	ВЫБОР
			               |			КОГДА &ВладелецТЕЗаполнено
			               |				ТОГДА ПризнакСобственностиКонтейнераСрезПоследних.ВладелецКТК В (&ВладелецТЕ)
			               |			ИНАЧЕ ИСТИНА
			               |		КОНЕЦ";
			
		КонецЕсли;
		
		//Запрос.Текст = "ВЫБРАТЬ
		//               |	ВЫБОР
		//               |		КОГДА &ТипТСТЕ = 0
		//               |			ТОГДА ОстаткиТСТЕОстатки.ТипТС
		//               |		КОГДА &ТипТСТЕ = 1
		//               |			ТОГДА ОстаткиТСТЕОстатки.ТипТЕ
		//               |	КОНЕЦ КАК Тип,
		//               |	ВЫБОР
		//               |		КОГДА &ТипТСТЕ = 0
		//               |			ТОГДА ОстаткиТСТЕОстатки.КоличествоТСОстаток
		//               |		КОГДА &ТипТСТЕ = 1
		//               |			ТОГДА ОстаткиТСТЕОстатки.КоличествоТЕОстаток
		//               |	КОНЕЦ КАК Количество,
		//               |	ОстаткиТСТЕОстатки.Местоположение,
		//               |	ОстаткиТСТЕОстатки.Местоположение.Широта КАК Широта,
		//               |	ОстаткиТСТЕОстатки.Местоположение.Долгота КАК Долгота
		//               |ИЗ
		//               |	РегистрНакопления.ОстаткиТСТЕ.Остатки(&ДатаФактОстатков, ) КАК ОстаткиТСТЕОстатки
		//               |ГДЕ
		//               |	(ОстаткиТСТЕОстатки.Организация = &Организация
		//               |			ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
		//               |	И (ОстаткиТСТЕОстатки.Местоположение В ИЕРАРХИИ (&Местоположение)
		//               |			ИЛИ &Местоположение = ЗНАЧЕНИЕ(Справочник.Местоположения.ПустаяСсылка))
		//               |	И (ОстаткиТСТЕОстатки.Заказ = &Заказ
		//               |			ИЛИ &Заказ = ЗНАЧЕНИЕ(Документ.Заказ.ПустаяСсылка))
		//               |	И (ОстаткиТСТЕОстатки.ПланФакт = ЗНАЧЕНИЕ(Перечисление.ПланФактСчет.Факт)
		//               |			ИЛИ ОстаткиТСТЕОстатки.Заказ.ФактическаяТРСХПустая)
		//               |	И ВЫБОР
		//               |			КОГДА &ТипТСТЕ = 0
		//               |				ТОГДА ОстаткиТСТЕОстатки.КоличествоТСОстаток <> 0
		//               |			КОГДА &ТипТСТЕ = 1
		//               |				ТОГДА ОстаткиТСТЕОстатки.КоличествоТЕОстаток <> 0
		//               |		КОНЕЦ
		//               |	И ВЫБОР
		//               |				КОГДА &ОтображатьТС = 1
		//               |					ТОГДА ОстаткиТСТЕОстатки.ГруженоеТС
		//               |				КОГДА &ОтображатьТС = 2
		//               |					ТОГДА НЕ ОстаткиТСТЕОстатки.ГруженоеТС
		//               |				ИНАЧЕ ИСТИНА
		//               |			КОНЕЦ
		//               |			И ВЫБОР
		//               |				КОГДА &ОтображатьТЕ = 1
		//               |					ТОГДА ОстаткиТСТЕОстатки.ГруженоеТЕ
		//               |				КОГДА &ОтображатьТЕ = 2
		//               |					ТОГДА НЕ ОстаткиТСТЕОстатки.ГруженоеТЕ
		//               |				ИНАЧЕ ИСТИНА
		//               |			КОНЕЦ
		//               |	И ВЫБОР
		//               |				КОГДА &ТипТСЗаполнено
		//               |					ТОГДА ОстаткиТСТЕОстатки.ТипТС В (&ТипТС)
		//               |				ИНАЧЕ ИСТИНА
		//               |			КОНЕЦ
		//               |			И ВЫБОР
		//               |				КОГДА &ТипТЕЗаполнено
		//               |					ТОГДА ОстаткиТСТЕОстатки.ТипТЕ В (&ТипТЕ)
		//               |				ИНАЧЕ ИСТИНА
		//               |			КОНЕЦ
		//               |	И ВЫБОР
		//               |				КОГДА &ТСЗаполнено
		//               |					ТОГДА ОстаткиТСТЕОстатки.ТС В (&ТС)
		//               |				ИНАЧЕ ИСТИНА
		//               |			КОНЕЦ
		//               |			И ВЫБОР
		//               |				КОГДА &ТЕЗаполнено
		//               |					ТОГДА ОстаткиТСТЕОстатки.ТЕ В (&ТЕ)
		//               |				ИНАЧЕ ИСТИНА
		//               |			КОНЕЦ
		//               |	И ВЫБОР
		//               |			КОГДА &ТипТСТЕ = 0
		//               |				ТОГДА ОстаткиТСТЕОстатки.ТипТС <> ЗНАЧЕНИЕ(Справочник.ТипыТранспортныхСредств.Неизвестно)
		//               |			КОГДА &ТипТСТЕ = 1
		//               |				ТОГДА ОстаткиТСТЕОстатки.ТипТЕ <> ЗНАЧЕНИЕ(Справочник.ТипыТранспортныхЕдиниц.Неизвестно)
		//               |		КОНЕЦ
		//               |	И ВЫБОР
		//               |				КОГДА &ВладелецТСЗаполнено
		//               |					ТОГДА ОстаткиТСТЕОстатки.ТС.ВладелецТС В (&ВладелецТС)
		//               |				ИНАЧЕ ИСТИНА
		//               |			КОНЕЦ
		//               |			И ВЫБОР
		//               |				КОГДА &ВладелецТЕЗаполнено
		//               |					ТОГДА ОстаткиТСТЕОстатки.ТЕ.ВладелецТЕ В (&ВладелецТЕ)
		//               |				ИНАЧЕ ИСТИНА
		//               |			КОНЕЦ
		//               |	И НЕ ОстаткиТСТЕОстатки.Заказ.Шаблон";
		Запрос.УстановитьПараметр("ДатаФактОстатков", СтруктураПараметров.ОстаткиНаДату);
		Запрос.УстановитьПараметр("ТипТСТЕ", СтруктураПараметров.РежимОтображенияТСТЕ);
		Запрос.УстановитьПараметр("Организация", СтруктураПараметров.ОтборОрганизация);
		Запрос.УстановитьПараметр("Местоположение", СтруктураПараметров.ОтборРегион);
		Запрос.УстановитьПараметр("Заказ", СтруктураПараметров.Заказ);
		Запрос.УстановитьПараметр("ЗаказПустой", СтруктураПараметров.Заказ.Количество() = 0);
		Запрос.УстановитьПараметр("ОтображатьТС", СтруктураПараметров.ОтображатьТС);
		Запрос.УстановитьПараметр("ОтображатьТЕ", СтруктураПараметров.ОтображатьТЕ);
		Запрос.УстановитьПараметр("ТипТСЗаполнено", СтруктураПараметров.ТипТС.Количество() > 0);
		Запрос.УстановитьПараметр("ТипТС", СтруктураПараметров.ТипТС);
		Запрос.УстановитьПараметр("ТипТЕЗаполнено", СтруктураПараметров.ТипТЕ.Количество() > 0);
		Запрос.УстановитьПараметр("ТипТЕ", СтруктураПараметров.ТипТЕ);
		Запрос.УстановитьПараметр("ТСЗаполнено", СтруктураПараметров.ТС.Количество() > 0);
		Запрос.УстановитьПараметр("ТС", СтруктураПараметров.ТС);
		Запрос.УстановитьПараметр("ТЕЗаполнено", СтруктураПараметров.ТЕ.Количество() > 0);
		Запрос.УстановитьПараметр("ТЕ", СтруктураПараметров.ТЕ);
		Запрос.УстановитьПараметр("ВладелецТСЗаполнено", СтруктураПараметров.ВладелецТС.Количество() > 0);
		Запрос.УстановитьПараметр("ВладелецТС", СтруктураПараметров.ВладелецТС);
		Запрос.УстановитьПараметр("ВладелецТЕЗаполнено", СтруктураПараметров.ВладелецТЕ.Количество() > 0);
		Запрос.УстановитьПараметр("ВладелецТЕ", СтруктураПараметров.ВладелецТЕ);
		
		Ответ = Запрос.Выполнить().Выбрать();
		Пока Ответ.Следующий() Цикл
			НайтиДобавитьДанныеМестоположения(МассивЛокаций, Новый Структура("Широта, Долгота, Местоположение", Ответ.Широта, Ответ.Долгота, Ответ.Местоположение), "Факт", Ответ.Тип, Ответ.Количество);
		КонецЦикла;
		
		// -------------------- ПРОГНОЗ -------------------- //
		Если СтруктураПараметров.ОтображатьПрогноз Тогда
			
			Запрос = Новый Запрос;
			
			Если СтруктураПараметров.РежимОтображенияТСТЕ = 0 Тогда
				
				Запрос.Текст = "ВЫБРАТЬ
				               |	ПозицияВагоновПланОстатки.ТипВагона КАК Тип,
				               |	ПозицияВагоновПланОстатки.Локация КАК Местоположение,
				               |	ПозицияВагоновПланОстатки.Локация.Долгота КАК Долгота,
				               |	ПозицияВагоновПланОстатки.Локация.Широта КАК Широта,
				               |	ПозицияВагоновПланОстатки.ПланОстаток КАК Количество
				               |ИЗ
				               |	РегистрНакопления.ПозицияВагоновПлан.Остатки(&ДатаПрогнозОстатков, ) КАК ПозицияВагоновПланОстатки
				               |ГДЕ
				               |	(ПозицияВагоновПланОстатки.Локация В ИЕРАРХИИ (&Местоположение)
				               |			ИЛИ &Местоположение = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка))
							   //|	И (ПозицияВагоновПланОстатки.Сделка В (&Заказ)
							   //|			ИЛИ &ЗаказПустой)
							   //|	И ВЫБОР
							   //|			КОГДА &ОтображатьТС = 1
							   //|				ТОГДА ПозицияВагоновПланОстатки.Груженое
							   //|			КОГДА &ОтображатьТС = 2
							   //|				ТОГДА НЕ ПозицияВагоновПланОстатки.Груженое
							   //|			ИНАЧЕ ИСТИНА
							   //|		КОНЕЦ
				               |	И ВЫБОР
				               |			КОГДА &ТипТСЗаполнено
				               |				ТОГДА ПозицияВагоновПланОстатки.ТипВагона В (&ТипТС)
				               |			ИНАЧЕ ИСТИНА
				               |		КОНЕЦ
				               |	И ВЫБОР
				               |			КОГДА &ТСЗаполнено
				               |				ТОГДА ПозицияВагоновПланОстатки.Вагон В (&ТС)
				               |			ИНАЧЕ ИСТИНА
				               |		КОНЕЦ
				               |	И ВЫБОР
				               |			КОГДА &ВладелецТСЗаполнено
				               |				ТОГДА ПозицияВагоновПланОстатки.Вагон.ВладелецТС В (&ВладелецТС)
				               |			ИНАЧЕ ИСТИНА
				               |		КОНЕЦ
				               |	И ПозицияВагоновПланОстатки.ПланОстаток <> 0";
				
			Иначе
				
				Запрос.Текст = "ВЫБРАТЬ
				               |	ПозицияКонтейнеровПланОстатки.Локация КАК Местоположение,
				               |	ПозицияКонтейнеровПланОстатки.Локация.Долгота КАК Долгота,
				               |	ПозицияКонтейнеровПланОстатки.Локация.Широта КАК Широта,
				               |	ПозицияКонтейнеровПланОстатки.ПланОстаток КАК Количество,
				               |	ПозицияКонтейнеровПланОстатки.ТипКТК КАК Тип,
				               |	ПозицияКонтейнеровПланОстатки.Контейнер КАК Контейнер
				               |ПОМЕСТИТЬ ВТ
				               |ИЗ
				               |	РегистрНакопления.ПозицияКонтейнеровПлан.Остатки(&ДатаПрогнозОстатков, ) КАК ПозицияКонтейнеровПланОстатки
				               |ГДЕ
				               |	(ПозицияКонтейнеровПланОстатки.Локация В ИЕРАРХИИ (&Местоположение)
				               |			ИЛИ &Местоположение = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка))
							   //|	И (ПозицияКонтейнеровПланОстатки.Сделка В (&Заказ)
							   //|			ИЛИ &ЗаказПустой)
							   //|	И ВЫБОР
							   //|			КОГДА &ОтображатьТЕ = 1
							   //|				ТОГДА ПозицияКонтейнеровПланОстатки.Груженое
							   //|			КОГДА &ОтображатьТЕ = 2
							   //|				ТОГДА НЕ ПозицияКонтейнеровПланОстатки.Груженое
							   //|			ИНАЧЕ ИСТИНА
							   //|		КОНЕЦ
				               |	И ВЫБОР
				               |			КОГДА &ТипТЕЗаполнено
				               |				ТОГДА ПозицияКонтейнеровПланОстатки.ТипКТК В (&ТипТЕ)
				               |			ИНАЧЕ ИСТИНА
				               |		КОНЕЦ
				               |	И ВЫБОР
				               |			КОГДА &ТЕЗаполнено
				               |				ТОГДА ПозицияКонтейнеровПланОстатки.Контейнер В (&ТЕ)
				               |			ИНАЧЕ ИСТИНА
				               |		КОНЕЦ
				               |	И ПозицияКонтейнеровПланОстатки.ПланОстаток <> 0
				               |;
				               |
				               |////////////////////////////////////////////////////////////////////////////////
				               |ВЫБРАТЬ
				               |	ВТ.Местоположение КАК Местоположение,
				               |	ВТ.Долгота КАК Долгота,
				               |	ВТ.Широта КАК Широта,
				               |	ВТ.Количество КАК Количество,
				               |	ВТ.Тип КАК Тип,
				               |	ПризнакСобственностиКонтейнераСрезПоследних.ВладелецКТК КАК ВладелецТЕ
				               |ИЗ
				               |	ВТ КАК ВТ
				               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПризнакСобственностиКонтейнера.СрезПоследних(
				               |				&ДатаПрогнозОстатков,
				               |				Контейнер В
				               |					(ВЫБРАТЬ
				               |						ВТ.Контейнер
				               |					ИЗ
				               |						ВТ КАК ВТ)) КАК ПризнакСобственностиКонтейнераСрезПоследних
				               |		ПО ВТ.Контейнер = ПризнакСобственностиКонтейнераСрезПоследних.Контейнер
				               |ГДЕ
				               |	ВЫБОР
				               |			КОГДА &ВладелецТЕЗаполнено
				               |				ТОГДА ПризнакСобственностиКонтейнераСрезПоследних.ВладелецКТК В (&ВладелецТЕ)
				               |			ИНАЧЕ ИСТИНА
				               |		КОНЕЦ";
				
			КонецЕсли;

			
			//Запрос.Текст = "ВЫБРАТЬ
			//               |	ВЫБОР
			//               |		КОГДА &ТипТСТЕ = 0
			//               |			ТОГДА ПрогнозДвиженияТСТЕОстатки.ТипТС
			//               |		КОГДА &ТипТСТЕ = 1
			//               |			ТОГДА ПрогнозДвиженияТСТЕОстатки.ТипТЕ
			//               |	КОНЕЦ КАК Тип,
			//               |	ВЫБОР
			//               |		КОГДА &ТипТСТЕ = 0
			//               |			ТОГДА ПрогнозДвиженияТСТЕОстатки.КоличествоТСОстаток
			//               |		КОГДА &ТипТСТЕ = 1
			//               |			ТОГДА ПрогнозДвиженияТСТЕОстатки.КоличествоТЕОстаток
			//               |	КОНЕЦ КАК Количество,
			//               |	ПрогнозДвиженияТСТЕОстатки.Местоположение,
			//               |	ПрогнозДвиженияТСТЕОстатки.ТипТС.КатегорияТС КАК КатегорияТС,
			//               |	ПрогнозДвиженияТСТЕОстатки.ПланФакт,
			//               |	ПрогнозДвиженияТСТЕОстатки.Местоположение.Широта КАК Широта,
			//               |	ПрогнозДвиженияТСТЕОстатки.Местоположение.Долгота КАК Долгота
			//               |ИЗ
			//               |	РегистрНакопления.ПрогнозДвиженияТСТЕ.Остатки(&ДатаПрогнозОстатков, ) КАК ПрогнозДвиженияТСТЕОстатки
			//               |ГДЕ
			//               |	(ПрогнозДвиженияТСТЕОстатки.Организация = &Организация
			//               |			ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
			//               |	И (ПрогнозДвиженияТСТЕОстатки.Местоположение В ИЕРАРХИИ (&Местоположение)
			//               |			ИЛИ &Местоположение = ЗНАЧЕНИЕ(Справочник.Местоположения.ПустаяСсылка))
			//               |	И (ПрогнозДвиженияТСТЕОстатки.Заказ = &Заказ
			//               |			ИЛИ &Заказ = ЗНАЧЕНИЕ(Документ.Заказ.ПустаяСсылка))
			//               |	И (ПрогнозДвиженияТСТЕОстатки.ПланФакт = ЗНАЧЕНИЕ(Перечисление.ПланФактСчет.Факт)
			//               |			ИЛИ ПрогнозДвиженияТСТЕОстатки.Заказ.ФактическаяТРСХПустая)
			//               |	И ВЫБОР
			//               |			КОГДА &ТипТСТЕ = 0
			//               |				ТОГДА ПрогнозДвиженияТСТЕОстатки.КоличествоТСОстаток <> 0
			//               |			КОГДА &ТипТСТЕ = 1
			//               |				ТОГДА ПрогнозДвиженияТСТЕОстатки.КоличествоТЕОстаток <> 0
			//               |		КОНЕЦ
			//               |	И ВЫБОР
			//               |				КОГДА &ОтображатьТС = 1
			//               |					ТОГДА ПрогнозДвиженияТСТЕОстатки.ГруженоеТС
			//               |				КОГДА &ОтображатьТС = 2
			//               |					ТОГДА НЕ ПрогнозДвиженияТСТЕОстатки.ГруженоеТС
			//               |				ИНАЧЕ ИСТИНА
			//               |			КОНЕЦ
			//               |			И ВЫБОР
			//               |				КОГДА &ОтображатьТЕ = 1
			//               |					ТОГДА ПрогнозДвиженияТСТЕОстатки.ГруженоеТЕ
			//               |				КОГДА &ОтображатьТЕ = 2
			//               |					ТОГДА НЕ ПрогнозДвиженияТСТЕОстатки.ГруженоеТЕ
			//               |				ИНАЧЕ ИСТИНА
			//               |			КОНЕЦ
			//               |	И ВЫБОР
			//               |				КОГДА &ТипТСЗаполнено
			//               |					ТОГДА ПрогнозДвиженияТСТЕОстатки.ТипТС В (&ТипТС)
			//               |				ИНАЧЕ ИСТИНА
			//               |			КОНЕЦ
			//               |			И ВЫБОР
			//               |				КОГДА &ТипТЕЗаполнено
			//               |					ТОГДА ПрогнозДвиженияТСТЕОстатки.ТипТЕ В (&ТипТЕ)
			//               |				ИНАЧЕ ИСТИНА
			//               |			КОНЕЦ
			//               |	И ВЫБОР
			//               |				КОГДА &ТСЗаполнено
			//               |					ТОГДА ПрогнозДвиженияТСТЕОстатки.ТС В (&ТС)
			//               |				ИНАЧЕ ИСТИНА
			//               |			КОНЕЦ
			//               |			И ВЫБОР
			//               |				КОГДА &ТЕЗаполнено
			//               |					ТОГДА ПрогнозДвиженияТСТЕОстатки.ТЕ В (&ТЕ)
			//               |				ИНАЧЕ ИСТИНА
			//               |			КОНЕЦ
			//               |	И ВЫБОР
			//               |			КОГДА &ТипТСТЕ = 0
			//               |				ТОГДА ПрогнозДвиженияТСТЕОстатки.ТипТС <> ЗНАЧЕНИЕ(Справочник.ТипыТранспортныхСредств.Неизвестно)
			//               |			КОГДА &ТипТСТЕ = 1
			//               |				ТОГДА ПрогнозДвиженияТСТЕОстатки.ТипТЕ <> ЗНАЧЕНИЕ(Справочник.ТипыТранспортныхЕдиниц.Неизвестно)
			//               |		КОНЕЦ
			//               |	И ВЫБОР
			//               |				КОГДА &ВладелецТСЗаполнено
			//               |					ТОГДА ПрогнозДвиженияТСТЕОстатки.ТС.ВладелецТС В (&ВладелецТС)
			//               |				ИНАЧЕ ИСТИНА
			//               |			КОНЕЦ
			//               |			И ВЫБОР
			//               |				КОГДА &ВладелецТЕЗаполнено
			//               |					ТОГДА ПрогнозДвиженияТСТЕОстатки.ТЕ.ВладелецТЕ В (&ВладелецТЕ)
			//               |				ИНАЧЕ ИСТИНА
			//               |			КОНЕЦ
			//               |	И НЕ ПрогнозДвиженияТСТЕОстатки.Заказ.Шаблон";
			Запрос.УстановитьПараметр("ДатаПрогнозОстатков", СтруктураПараметров.ПрогнозНаДату);
			Запрос.УстановитьПараметр("ТипТСТЕ", СтруктураПараметров.РежимОтображенияТСТЕ);
			Запрос.УстановитьПараметр("Организация", СтруктураПараметров.ОтборОрганизация);
			Запрос.УстановитьПараметр("Местоположение", СтруктураПараметров.ОтборРегион);
			Запрос.УстановитьПараметр("Заказ", СтруктураПараметров.Заказ);
			Запрос.УстановитьПараметр("ЗаказПустой", СтруктураПараметров.Заказ.Количество() = 0);
			Запрос.УстановитьПараметр("ОтображатьТС", СтруктураПараметров.ОтображатьТС);
			Запрос.УстановитьПараметр("ОтображатьТЕ", СтруктураПараметров.ОтображатьТЕ);
			Запрос.УстановитьПараметр("ТипТСЗаполнено", СтруктураПараметров.ТипТС.Количество() > 0);
			Запрос.УстановитьПараметр("ТипТС", СтруктураПараметров.ТипТС);
			Запрос.УстановитьПараметр("ТипТЕЗаполнено", СтруктураПараметров.ТипТЕ.Количество() > 0);
			Запрос.УстановитьПараметр("ТипТЕ", СтруктураПараметров.ТипТЕ);
			Запрос.УстановитьПараметр("ТСЗаполнено", СтруктураПараметров.ТС.Количество() > 0);
			Запрос.УстановитьПараметр("ТС", СтруктураПараметров.ТС);
			Запрос.УстановитьПараметр("ТЕЗаполнено", СтруктураПараметров.ТЕ.Количество() > 0);
			Запрос.УстановитьПараметр("ТЕ", СтруктураПараметров.ТЕ);
			Запрос.УстановитьПараметр("ВладелецТСЗаполнено", СтруктураПараметров.ВладелецТС.Количество() > 0);
			Запрос.УстановитьПараметр("ВладелецТС", СтруктураПараметров.ВладелецТС);
			Запрос.УстановитьПараметр("ВладелецТЕЗаполнено", СтруктураПараметров.ВладелецТЕ.Количество() > 0);
			Запрос.УстановитьПараметр("ВладелецТЕ", СтруктураПараметров.ВладелецТЕ);
			
			Ответ = Запрос.Выполнить().Выбрать();
			Пока Ответ.Следующий() Цикл
				НайтиДобавитьДанныеМестоположения(МассивЛокаций, Новый Структура("Широта, Долгота, Местоположение", Ответ.Широта, Ответ.Долгота, Ответ.Местоположение), "ПрогнозПлан", Ответ.Тип, Ответ.Количество);
			КонецЦикла;
			
		КонецЕсли;

	КонецЕсли;
	
	// Преобразуем таблицу локаций в нормальный вид и выводим данные

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЧ.Местоположение,
	               |	ТЧ.Широта,
	               |	ТЧ.Долгота,
	               |	ТЧ.Графа,
	               |	ТЧ.Аналитика,
	               |	ТЧ.Значение,
	               |	ТЧ.Операция
	               |ПОМЕСТИТЬ Таб1
	               |ИЗ
	               |	&ТЧ КАК ТЧ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Таб1.Местоположение КАК Местоположение,
	               |	Таб1.Широта КАК Широта,
	               |	Таб1.Долгота КАК Долгота,
	               |	Таб1.Графа,
	               |	Таб1.Аналитика КАК Аналитика,
	               |	СУММА(Таб1.Значение) КАК Значение,
	               |	МАКСИМУМ(Таб1.Операция) КАК Операция
	               |ИЗ
	               |	Таб1 КАК Таб1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Таб1.Местоположение,
	               |	Таб1.Широта,
	               |	Таб1.Долгота,
	               |	Таб1.Графа,
	               |	Таб1.Аналитика
	               |ИТОГИ
	               |	МАКСИМУМ(Широта),
	               |	МАКСИМУМ(Долгота)
	               |ПО
	               |	Местоположение,
	               |	Аналитика";
	Запрос.УстановитьПараметр("ТЧ", МассивЛокаций);
	ОтветМестоположение = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ОтветМестоположение.Следующий() Цикл
		
		// уровень всего местоположения
		Если ЗначениеЗаполнено(ОтветМестоположение.Местоположение) Тогда
			ТекстПодсказки = "<table width='300px'><tr><td " + ?(СтруктураПараметров.ОтображатьПрогноз, "colspan='5'", "") + " style='font-family: verdana; font-size:12px;'><a href='javascript:void(document.getElementById(\""openreport\"").value = \"""+ОтветМестоположение.Местоположение.Код+"\"");'>"+ОтветМестоположение.Местоположение+" &rArr;</a></td></tr>";
		Иначе
			ТекстПодсказки = "<table width='300px'><tr><td " + ?(СтруктураПараметров.ОтображатьПрогноз, "colspan='5'", "") + " style='font-family: verdana; font-size:12px;'>("+ОтветМестоположение.Широта+"; "+ОтветМестоположение.Долгота+")</td></tr>";
		КонецЕсли;
		
		Если СтруктураПараметров.ОтображатьПрогноз Тогда
			ТекстПодсказки = ТекстПодсказки + "<tr><td style='font-family: verdana; font-size:10px; border-bottom: 1px solid black;'>Тип</td><td style='font-family: verdana; font-size:10px; border-bottom: 1px solid black;'>Факт</td><td style='font-family: verdana; font-size:10px; border-bottom: 1px solid black;'>Прогноз (неутв.)</td><td style='font-family: verdana; font-size:10px; border-bottom: 1px solid black;'>Прогноз (утв.)</td><td style='font-family: verdana; font-size:10px; border-bottom: 1px solid black;'>Итого</td></tr>";
		КонецЕсли;
		
		МаркерОтправки = "tp";
		
		ОтветАналитика = ОтветМестоположение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ОтветАналитика.Следующий() Цикл
			
			// уровень аналитик
			ГрафаФакт = 0;
			ГрафаПрогнозПлан = 0;
			ГрафаПрогнозФакт = 0;
			
			Если ТипЗнч(ОтветАналитика.Аналитика) = Тип("СправочникСсылка.ТипоразмерыТС") Тогда
				
				Значок = "";
				
				Если ОтветАналитика.Аналитика.Авто Тогда
					Значок = "truck";
				ИначеЕсли ОтветАналитика.Аналитика.Авиа Тогда
					Значок = "airport";
				ИначеЕсли ОтветАналитика.Аналитика.Вагон Тогда
					Значок = "train";
				ИначеЕсли ОтветАналитика.Аналитика.Судно Тогда
					Значок = "boat";
				КонецЕсли;
				
				Если МаркерОтправки = "tp" ИЛИ МаркерОтправки = Значок Тогда
					МаркерОтправки = Значок;
				Иначе
					МаркерОтправки = "";
				КонецЕсли;
				
			КонецЕсли;
			
			Ответ = ОтветАналитика.Выбрать();
			Пока Ответ.Следующий() Цикл
				
				Если НЕ СтруктураПараметров.ОтображатьПрогноз Тогда
					// вариант с операцией
					ТекстПодсказки = ТекстПодсказки + "<tr><td style='font-family: verdana; font-size:10px; border-bottom: 1px solid black;'><a href='javascript:void(document.getElementById(\""openoperation\"").value = \"""+Ответ.Операция.Номер+"_"+Год(Ответ.Операция.Дата)+"\"");'>"+Ответ.Операция.ГрузовыеПартии+"</a></td></tr>";
					МаркерОтправки = ОпределитьМаркерПоОперации(Ответ.Операция);
				Иначе
					// вариант с балансом
					Если Ответ.Графа = "Факт" Тогда
						ГрафаФакт = ГрафаФакт + Ответ.Значение;
					ИначеЕсли Ответ.Графа = "ПрогнозПлан" Тогда
						ГрафаПрогнозПлан = ГрафаПрогнозПлан + Ответ.Значение;
					ИначеЕсли Ответ.Графа = "ПрогнозФакт" Тогда
						ГрафаПрогнозФакт = ГрафаПрогнозФакт + Ответ.Значение;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
			Если СтруктураПараметров.ОтображатьПрогноз Тогда
				ТекстПодсказки = ТекстПодсказки + "<tr><td style='font-family: verdana; font-size:10px;'>"+ОтветАналитика.Аналитика+"</td><td style='font-family: verdana; font-size:10px; text-align: center;'>"+ГрафаФакт+"</td><td style='font-family: verdana; font-size:10px; text-align: center;'>"+ГрафаПрогнозПлан+"</td><td style='font-family: verdana; font-size:10px; text-align: center;'>"+ГрафаПрогнозФакт+"</td><td style='font-family: verdana; font-size:10px; text-align: center;'>"+(ГрафаФакт+ГрафаПрогнозПлан+ГрафаПрогнозФакт)+"</td></tr>";
				
				ЕстьСерыеДвижения = ПоТекущемуМестоположениюЕстьПлановыеПрошедшиеДвиженияПрогноза(ОтветМестоположение.Местоположение);
				
				Если (ГрафаФакт+ГрафаПрогнозПлан+ГрафаПрогнозФакт) > 0 Тогда
					МаркерОтправки = ?(ЕстьСерыеДвижения = 0, "plus", "plus_n");
				ИначеЕсли (ГрафаФакт+ГрафаПрогнозПлан+ГрафаПрогнозФакт) < 0 Тогда
					МаркерОтправки = ?(ЕстьСерыеДвижения = 0, "minus", "minus_n");
				Иначе
					МаркерОтправки = ?(ЕстьСерыеДвижения = 0, "ravno", "ravno_n");
				КонецЕсли;
				
				Если ЕстьСерыеДвижения > 0 Тогда
					ТекстПодсказки = ТекстПодсказки + "<tr><td colspan='5' style='font-family: verdana; font-size:10px;'><a style='color: red' href='javascript:void(document.getElementById(\""openmismatch\"").value = \"""+ОтветМестоположение.Местоположение.Код+"\"");'>Имеются недостоверные движения: "+ЕстьСерыеДвижения+"</a></td></tr>";
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ДобавитьМаркер(Результат, ОтветМестоположение.Широта, ОтветМестоположение.Долгота, ТекстПодсказки+"</table>", МаркерОтправки);
		
	КонецЦикла;
	
КонецПроцедуры

// Функция из тарификатора. Позволяет определить, есть ли просроченные операции в указанном местоположении
Функция ПоТекущемуМестоположениюЕстьПлановыеПрошедшиеДвиженияПрогноза(Местоположение) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПозицияВагоновПлан.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ Т1
	               |ИЗ
	               |	РегистрНакопления.ПозицияВагоновПлан КАК ПозицияВагоновПлан
	               |ГДЕ
	               |	ПозицияВагоновПлан.Период < &ТекДата
	               |	И (ПозицияВагоновПлан.Локация = &Местоположение
	               |			ИЛИ &Местоположение = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка))
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПозицияКонтейнеровПлан.Регистратор
	               |ИЗ
	               |	РегистрНакопления.ПозицияКонтейнеровПлан КАК ПозицияКонтейнеровПлан
	               |ГДЕ
	               |	ПозицияКонтейнеровПлан.Период < &ТекДата
	               |	И (ПозицияКонтейнеровПлан.Локация = &Местоположение
	               |			ИЛИ &Местоположение = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Т1.Регистратор) КАК Регистратор
	               |ИЗ
	               |	Т1 КАК Т1";
	
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПрогнозДвиженияТСТЕ.Регистратор) КАК Регистратор
	//               |ИЗ
	//               |	РегистрНакопления.ПрогнозДвиженияТСТЕ КАК ПрогнозДвиженияТСТЕ
	//               |ГДЕ
	//               |	ПрогнозДвиженияТСТЕ.Период < &ТекДата
	//               |	И (ПрогнозДвиженияТСТЕ.Местоположение = &Местоположение
	//               |			ИЛИ &Местоположение = ЗНАЧЕНИЕ(Справочник.Местоположения.ПустаяСсылка))
	//               |	И ПрогнозДвиженияТСТЕ.Заказ.ФактическаяТРСХПустая";
	Запрос.УстановитьПараметр("Местоположение", Местоположение);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Возврат ?(Ответ.Регистратор = NULL, 0, Ответ.Регистратор);
	КонецЕсли;
	Возврат 0;	
	
КонецФункции

Функция ПолучитьДанныеМаршрутовПоТрекингу(СтруктураПараметров)
	
	МассивЛиний = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Операция.Ссылка КАК Операция,
	               |	Операция.Сделка КАК Сделка
	               |ИЗ
	               |	Документ.Операция КАК Операция
	               |ГДЕ
	               |	Операция.ПланФакт = ЗНАЧЕНИЕ(Перечисление.ПланФактСчет.Факт)
	               |	И ВЫБОР
	               |			КОГДА &ОтображатьТрек
	               |				ТОГДА Операция.Ссылка В
	               |						(ВЫБРАТЬ
	               |							ОперацияГрузы.Ссылка КАК Ссылка
	               |						ИЗ
	               |							Документ.Операция.Грузы КАК ОперацияГрузы
	               |						ГДЕ
	               |							ОперацияГрузы.ТС В (&ТС))
	               |			ИНАЧЕ Операция.Сделка В (&Заказ)
	               |		КОНЕЦ
	               |	И Операция.Услуга.ОперацияОтображаетсяВГеосервисе
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Операция.Дата УБЫВ";
	
	//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	//               |	СвязиОпераций.Операция,
	//               |	СвязиОпераций.Заказ
	//               |ИЗ
	//               |	РегистрСведений.СвязиОпераций КАК СвязиОпераций
	//               |ГДЕ
	//               |	СвязиОпераций.ПланФакт = ЗНАЧЕНИЕ(Перечисление.ПланФактСчет.Факт)
	//               |	И ВЫБОР
	//               |			КОГДА &ОтображатьТрек
	//               |				ТОГДА СвязиОпераций.Операция В
	//               |						(ВЫБРАТЬ
	//               |							ГрузыВОперациях.Операция
	//               |						ИЗ
	//               |							РегистрНакопления.ГрузыВОперациях КАК ГрузыВОперациях
	//               |						ГДЕ
	//               |							ГрузыВОперациях.ТС В (&ТС))
	//               |			ИНАЧЕ СвязиОпераций.Заказ = &Заказ
	//               |		КОНЕЦ
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	СвязиОпераций.Операция.Дата УБЫВ";
	Запрос.УстановитьПараметр("Заказ", СтруктураПараметров.Заказ);
	Запрос.УстановитьПараметр("ТС", СтруктураПараметров.ТС);
	Запрос.УстановитьПараметр("ОтображатьТрек", СтруктураПараметров.ОтобразитьТрек);
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		ВесьМаршрут = ПолучитьТрекингПоОперации(Ответ.Операция, СтруктураПараметров.ОтобразитьТрек, СтруктураПараметров.ТС);
		Для каждого Стр из ВесьМаршрут Цикл
			МассивЛиний.Добавить(Новый Структура("Отправление, Назначение, Цвет, Пунктиром", Стр.Отправление, Стр.Назначение, "red", Стр.Пунктиром));
		КонецЦикла;
		Если ВесьМаршрут.Количество() = 0 Тогда
			МассивЛиний.Добавить(Новый Структура("Отправление, Назначение, Цвет, Пунктиром", Новый Структура("Долгота, Широта", Ответ.Операция.ПунктОтправления.Долгота, Ответ.Операция.ПунктОтправления.Широта), Новый Структура("Долгота, Широта", Ответ.Операция.ПунктНазначения.Долгота, Ответ.Операция.ПунктНазначения.Широта), "red", Истина));
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивЛиний;
	
КонецФункции

Функция ПолучитьДанныеТрекингаНаДату(СтруктураПараметров)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТректингТранспортаСрезПоследних.Местоположение КАК Местоположение,
	               |	ТректингТранспортаСрезПоследних.Состав КАК Состав,
	               |	ТректингТранспортаСрезПоследних.Операция КАК Операция,
	               |	ВЫБОР
	               |		КОГДА ТректингТранспортаСрезПоследних.Широта = 0
	               |			ТОГДА ТректингТранспортаСрезПоследних.Местоположение.Широта
	               |		ИНАЧЕ ТректингТранспортаСрезПоследних.Широта
	               |	КОНЕЦ КАК Широта,
	               |	ВЫБОР
	               |		КОГДА ТректингТранспортаСрезПоследних.Долгота = 0
	               |			ТОГДА ТректингТранспортаСрезПоследних.Местоположение.Долгота
	               |		ИНАЧЕ ТректингТранспортаСрезПоследних.Долгота
	               |	КОНЕЦ КАК Долгота,
	               |	ОперацияГрузы.ТЕ КАК ТЕ
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	РегистрСведений.ТректингТранспорта.СрезПоследних(&Период, ) КАК ТректингТранспортаСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Операция.Грузы КАК ОперацияГрузы
	               |		ПО ТректингТранспортаСрезПоследних.Операция = ОперацияГрузы.Ссылка
	               |ГДЕ
	               |	(ТректингТранспортаСрезПоследних.Местоположение <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	               |			ИЛИ ТректингТранспортаСрезПоследних.Широта <> 0
	               |			ИЛИ ТректингТранспортаСрезПоследних.Долгота <> 0)
	               |	И (ТректингТранспортаСрезПоследних.Операция.Организация = &Организация
	               |			ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	               |	И (ТректингТранспортаСрезПоследних.Местоположение В ИЕРАРХИИ (&Местоположение)
	               |			ИЛИ &Местоположение = ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка))
	               |	И (ОперацияГрузы.Ссылка.Сделка В (&Заказ)
	               |			ИЛИ &ЗаказПустой)
	               |	И ВЫБОР
	               |			КОГДА &ТипТСЗаполнено
	               |				ТОГДА ОперацияГрузы.ТипТС В (&ТипТС)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &ТипТЕЗаполнено
	               |				ТОГДА ОперацияГрузы.ТипТЕ В (&ТипТЕ)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &ТСЗаполнено
	               |				ТОГДА ОперацияГрузы.ТС В (&ТС)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &ТЕЗаполнено
	               |				ТОГДА ОперацияГрузы.ТЕ В (&ТЕ)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &ВладелецТСЗаполнено
	               |				ТОГДА ОперацияГрузы.ТС.ВладелецТС В (&ВладелецТС)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.Местоположение КАК Местоположение,
	               |	ВТ.Состав КАК Состав,
	               |	ВТ.Операция КАК Операция,
	               |	ВТ.Широта КАК Широта,
	               |	ВТ.Долгота КАК Долгота,
	               |	ПризнакСобственностиКонтейнераСрезПоследних.ВладелецКТК КАК ВладелецКТК
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПризнакСобственностиКонтейнера.СрезПоследних(
	               |				&Период,
	               |				Контейнер В
	               |					(ВЫБРАТЬ
	               |						ВТ.ТЕ
	               |					ИЗ
	               |						ВТ КАК ВТ)) КАК ПризнакСобственностиКонтейнераСрезПоследних
	               |		ПО ВТ.ТЕ = ПризнакСобственностиКонтейнераСрезПоследних.Контейнер
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &ВладелецТЕЗаполнено
	               |				ТОГДА ПризнакСобственностиКонтейнераСрезПоследних.ВладелецКТК В (&ВладелецТЕ)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |ИТОГИ
	               |	МАКСИМУМ(Широта),
	               |	МАКСИМУМ(Долгота)
	               |ПО
	               |	Местоположение";
	
	//Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	//               |	ТректингТранспортаСрезПоследних.Местоположение КАК Местоположение,
	//               |	ТректингТранспортаСрезПоследних.Состав,
	//               |	ТректингТранспортаСрезПоследних.Операция,
	//               |	ВЫБОР
	//               |		КОГДА ТректингТранспортаСрезПоследних.Широта = 0
	//               |			ТОГДА ТректингТранспортаСрезПоследних.Местоположение.Широта
	//               |		ИНАЧЕ ТректингТранспортаСрезПоследних.Широта
	//               |	КОНЕЦ КАК Широта,
	//               |	ВЫБОР
	//               |		КОГДА ТректингТранспортаСрезПоследних.Долгота = 0
	//               |			ТОГДА ТректингТранспортаСрезПоследних.Местоположение.Долгота
	//               |		ИНАЧЕ ТректингТранспортаСрезПоследних.Долгота
	//               |	КОНЕЦ КАК Долгота
	//               |ИЗ
	//               |	РегистрСведений.ТректингТранспорта.СрезПоследних(&Период, ) КАК ТректингТранспортаСрезПоследних
	//               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ГрузыВОперациях КАК ГрузыВОперациях
	//               |		ПО ТректингТранспортаСрезПоследних.Операция = ГрузыВОперациях.Операция
	//               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиОпераций КАК СвязиОпераций
	//               |		ПО ТректингТранспортаСрезПоследних.Операция = СвязиОпераций.Операция
	//               |ГДЕ
	//               |	(ТректингТранспортаСрезПоследних.Местоположение <> ЗНАЧЕНИЕ(Справочник.Местоположения.ПустаяСсылка)
	//               |			ИЛИ ТректингТранспортаСрезПоследних.Широта <> 0
	//               |			ИЛИ ТректингТранспортаСрезПоследних.Долгота <> 0)
	//               |	И (ТректингТранспортаСрезПоследних.Операция.Организация = &Организация
	//               |			ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	//               |	И (ТректингТранспортаСрезПоследних.Местоположение В ИЕРАРХИИ (&Местоположение)
	//               |			ИЛИ &Местоположение = ЗНАЧЕНИЕ(Справочник.Местоположения.ПустаяСсылка))
	//               |	И (СвязиОпераций.Заказ = &Заказ
	//               |			ИЛИ &Заказ = ЗНАЧЕНИЕ(Документ.Заказ.ПустаяСсылка))
	//               |	И ВЫБОР
	//               |			КОГДА &ТипТСЗаполнено
	//               |				ТОГДА ГрузыВОперациях.ТипТС В (&ТипТС)
	//               |			ИНАЧЕ ИСТИНА
	//               |		КОНЕЦ
	//               |	И ВЫБОР
	//               |			КОГДА &ТипТЕЗаполнено
	//               |				ТОГДА ГрузыВОперациях.ТипТЕ В (&ТипТЕ)
	//               |			ИНАЧЕ ИСТИНА
	//               |		КОНЕЦ
	//               |	И ВЫБОР
	//               |			КОГДА &ТСЗаполнено
	//               |				ТОГДА ГрузыВОперациях.ТС В (&ТС)
	//               |			ИНАЧЕ ИСТИНА
	//               |		КОНЕЦ
	//               |	И ВЫБОР
	//               |			КОГДА &ТЕЗаполнено
	//               |				ТОГДА ГрузыВОперациях.ТЕ В (&ТЕ)
	//               |			ИНАЧЕ ИСТИНА
	//               |		КОНЕЦ
	//               |	И ВЫБОР
	//               |			КОГДА &ВладелецТСЗаполнено
	//               |				ТОГДА ГрузыВОперациях.ТС.ВладелецТС В (&ВладелецТС)
	//               |			ИНАЧЕ ИСТИНА
	//               |		КОНЕЦ
	//               |	И ВЫБОР
	//               |			КОГДА &ВладелецТЕЗаполнено
	//               |				ТОГДА ГрузыВОперациях.ТЕ.ВладелецТЕ В (&ВладелецТЕ)
	//               |			ИНАЧЕ ИСТИНА
	//               |		КОНЕЦ
	//               |ИТОГИ
	//               |	МАКСИМУМ(Широта),
	//               |	МАКСИМУМ(Долгота)
	//               |ПО
	//               |	Местоположение";
	
	Запрос.УстановитьПараметр("Период", СтруктураПараметров.ОстаткиНаДату);
	Запрос.УстановитьПараметр("Организация", СтруктураПараметров.ОтборОрганизация);
	Запрос.УстановитьПараметр("Местоположение", СтруктураПараметров.ОтборРегион);
	Запрос.УстановитьПараметр("Заказ", СтруктураПараметров.Заказ);
	Запрос.УстановитьПараметр("ЗаказПустой", СтруктураПараметров.Заказ.Количество() = 0);
	Запрос.УстановитьПараметр("ТипТСЗаполнено", СтруктураПараметров.ТипТС.Количество() > 0);
	Запрос.УстановитьПараметр("ТипТС", СтруктураПараметров.ТипТС);
	Запрос.УстановитьПараметр("ТипТЕЗаполнено", СтруктураПараметров.ТипТЕ.Количество() > 0);
	Запрос.УстановитьПараметр("ТипТЕ", СтруктураПараметров.ТипТЕ);
	Запрос.УстановитьПараметр("ТСЗаполнено", СтруктураПараметров.ТС.Количество() > 0);
	Запрос.УстановитьПараметр("ТС", СтруктураПараметров.ТС);
	Запрос.УстановитьПараметр("ТЕЗаполнено", СтруктураПараметров.ТЕ.Количество() > 0);
	Запрос.УстановитьПараметр("ТЕ", СтруктураПараметров.ТЕ);
	Запрос.УстановитьПараметр("ВладелецТСЗаполнено", СтруктураПараметров.ВладелецТС.Количество() > 0);
	Запрос.УстановитьПараметр("ВладелецТС", СтруктураПараметров.ВладелецТС);
	Запрос.УстановитьПараметр("ВладелецТЕЗаполнено", СтруктураПараметров.ВладелецТЕ.Количество() > 0);
	Запрос.УстановитьПараметр("ВладелецТЕ", СтруктураПараметров.ВладелецТЕ);
	ВыборкаМестоположение = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаМестоположение.Следующий() Цикл
		
		ВыборкаДетальныеЗаписи = ВыборкаМестоположение.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если СтруктураПараметров.ОтображатьТС <> 0 Тогда
				ВЭтойОперацииГруженыеТС = ВЭтойОперацииГруженыеТС(ВыборкаДетальныеЗаписи.Операция);
				Если (СтруктураПараметров.ОтображатьТС = 1 И НЕ ВЭтойОперацииГруженыеТС) ИЛИ (СтруктураПараметров.ОтображатьТС = 2 И ВЭтойОперацииГруженыеТС) Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			Если СтруктураПараметров.ОтображатьТЕ <> 0 Тогда
				ВЭтойОперацииГруженыеТЕ = ВЭтойОперацииГруженыеТЕ(ВыборкаДетальныеЗаписи.Операция);
				Если (СтруктураПараметров.ОтображатьТЕ = 1 И НЕ ВЭтойОперацииГруженыеТЕ) ИЛИ (СтруктураПараметров.ОтображатьТЕ = 2 И ВЭтойОперацииГруженыеТЕ) Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Результат.Добавить(Новый Структура("Местоположение, Операция", Новый Структура("Широта, Долгота, Местоположение", ВыборкаДетальныеЗаписи.Широта, ВыборкаДетальныеЗаписи.Долгота, ВыборкаДетальныеЗаписи.Местоположение), ВыборкаДетальныеЗаписи.Операция));
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ВЭтойОперацииГруженыеТС(Операция)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(ОперацияГрузы.ГруженоеТС) КАК ГруженоеТС
	               |ИЗ
	               |	Документ.Операция.Грузы КАК ОперацияГрузы
	               |ГДЕ
	               |	ОперацияГрузы.Ссылка = &Операция";
	Запрос.УстановитьПараметр("Операция", Операция);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Возврат Ответ.ГруженоеТС;
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции

Функция ВЭтойОперацииГруженыеТЕ(Операция)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(ОперацияГрузы.ГруженоеТЕ) КАК ГруженоеТЕ
	               |ИЗ
	               |	Документ.Операция.Грузы КАК ОперацияГрузы
	               |ГДЕ
	               |	ОперацияГрузы.Ссылка = &Операция";
	Запрос.УстановитьПараметр("Операция", Операция);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Возврат Ответ.ГруженоеТЕ;
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьТрекингПоОперации(Операция,  ОтобразитьТрек, ТС)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТректингТранспорта.Местоположение КАК Местоположение,
	               |	ТректингТранспорта.Операция.ПунктНазначения КАК ПунктНазначения,
	               |	МАКСИМУМ(ТректингТранспорта.Период) КАК Период,
	               |	ВЫБОР
	               |		КОГДА ТректингТранспорта.Широта = 0
	               |			ТОГДА ТректингТранспорта.Местоположение.Широта
	               |		ИНАЧЕ ТректингТранспорта.Широта
	               |	КОНЕЦ КАК Широта,
	               |	ВЫБОР
	               |		КОГДА ТректингТранспорта.Долгота = 0
	               |			ТОГДА ТректингТранспорта.Местоположение.Долгота
	               |		ИНАЧЕ ТректингТранспорта.Долгота
	               |	КОНЕЦ КАК Долгота
	               |ИЗ
	               |	РегистрСведений.ТректингТранспорта КАК ТректингТранспорта
	               |ГДЕ
	               |	(ТректингТранспорта.Местоположение <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	               |			ИЛИ ТректингТранспорта.Широта <> 0
	               |			ИЛИ ТректингТранспорта.Долгота <> 0)
	               |	И ТректингТранспорта.Операция = &Операция
	               |	И ВЫБОР
	               |			КОГДА &ТрекТранспорта
	               |				ТОГДА ТректингТранспорта.ТС В (&СписокТС)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТректингТранспорта.Операция.ПунктНазначения,
	               |	ТректингТранспорта.Местоположение,
	               |	ВЫБОР
	               |		КОГДА ТректингТранспорта.Широта = 0
	               |			ТОГДА ТректингТранспорта.Местоположение.Широта
	               |		ИНАЧЕ ТректингТранспорта.Широта
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ТректингТранспорта.Долгота = 0
	               |			ТОГДА ТректингТранспорта.Местоположение.Долгота
	               |		ИНАЧЕ ТректингТранспорта.Долгота
	               |	КОНЕЦ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";
	Запрос.УстановитьПараметр("Операция", Операция);
	Запрос.УстановитьПараметр("ТрекТранспорта", ОтобразитьТрек);
	Запрос.УстановитьПараметр("СписокТС", ТС);
	Ответ = Запрос.Выполнить().Выбрать();
	ПредПунктШирота = неопределено;
	ПредПунктДолгота = неопределено;
	Пока Ответ.Следующий() Цикл
		Если ПредПунктШирота <> неопределено И ПредПунктШирота <> Ответ.Широта И ПредПунктДолгота <> Ответ.Долгота Тогда
			Результат.Добавить(Новый Структура("Отправление, Назначение, Пунктиром", Новый Структура("Широта, Долгота", ПредПунктШирота, ПредПунктДолгота), Новый Структура("Широта, Долгота", Ответ.Широта, Ответ.Долгота), Ложь));
		КонецЕсли;
		ПредПунктШирота = Ответ.Широта;
		ПредПунктДолгота = Ответ.Долгота;
	КонецЦикла;
	
	Если Ответ.Местоположение <> Ответ.ПунктНазначения Тогда
		Результат.Добавить(Новый Структура("Отправление, Назначение, Пунктиром", Новый Структура("Широта, Долгота", ПредПунктШирота, ПредПунктДолгота), Новый Структура("Широта, Долгота", Ответ.ПунктНазначения.Широта, Ответ.ПунктНазначения.Долгота), Истина));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОпределитьМаркерПоОперации(Операция)
	
	ВыбранныйТипТС = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОперацияГрузы.ТипТС КАК ТипТС
	               |ИЗ
	               |	Документ.Операция.Грузы КАК ОперацияГрузы
	               |ГДЕ
	               |	ОперацияГрузы.Ссылка = &Операция";
	Запрос.УстановитьПараметр("Операция", Операция);			   
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		Если ВыбранныйТипТС = неопределено ИЛИ ВыбранныйТипТС = Ответ.ТипТС Тогда
			ВыбранныйТипТС = Ответ.ТипТС;
		Иначе
			ВыбранныйТипТС = "";
		КонецЕсли;
	КонецЦикла;
	
	Если ВыбранныйТипТС <> неопределено И ВыбранныйТипТС <> "" Тогда
		Если ВыбранныйТипТС.Авто Тогда
			Возврат "truck";
		ИначеЕсли ВыбранныйТипТС.Авиа Тогда
			Возврат "airport";
		ИначеЕсли ВыбранныйТипТС.Вагон Тогда
			Возврат "train";
		ИначеЕсли ВыбранныйТипТС.Судно Тогда
			Возврат "boat";
		КонецЕсли;
	КонецЕсли;
	
	Возврат "tp";
	
КонецФункции

Процедура СоздатьЗаголовок(Результат, Знач Широта, Знач Долгота, Зум, КаталогГеосервиса)
	
	Широта = СтрЗаменить(Широта, ",", "."); Долгота = СтрЗаменить(Долгота, ",", ".");
	Результат = "<html>
	|<head>
	|<link rel=""stylesheet"" href="""+ПреобразоватьПуть(КаталогГеосервиса)+"\\leaflet.css"" />
	|</head>
	|<body>
	|<div id=""map"" style=""width: 100%; height: 100%""></div>
	|<script src="""+ПреобразоватьПуть(КаталогГеосервиса)+"\\leaflet.js""></script>
	|<script>
	|var map = L.map('map').setView(["+Широта+", "+Долгота+"], "+Зум+");
	|L.tileLayer('https://{s}.tiles.mapbox.com/v3/{id}/{z}/{x}/{y}.png', {maxZoom: 18,attribution: 'Map data &copy; <a href=""http://openstreetmap.org"">OpenStreetMap</a> contributors, <a href=""http://creativecommons.org/licenses/by-sa/2.0/"">CC-BY-SA</a>, Imagery © <a href=""http://mapbox.com"">Mapbox</a>',id: '"+Константы.КлючMapBox.Получить()+"'}).addTo(map);
	|var tp = L.icon({ iconUrl: """+ПреобразоватьПуть(КаталогГеосервиса)+"\\images\\tp.png"", iconSize: [32, 74] });
	|var airport = L.icon({ iconUrl: """+ПреобразоватьПуть(КаталогГеосервиса)+"\\images\\airport.png"", iconSize: [32, 74] });
	|var boat = L.icon({ iconUrl: """+ПреобразоватьПуть(КаталогГеосервиса)+"\\images\\boat.png"", iconSize: [32, 74] });
	|var train = L.icon({ iconUrl: """+ПреобразоватьПуть(КаталогГеосервиса)+"\\images\\train.png"", iconSize: [32, 74] });
	|var truck = L.icon({ iconUrl: """+ПреобразоватьПуть(КаталогГеосервиса)+"\\images\\truck3.png"", iconSize: [32, 74] });
	|var minus = L.icon({ iconUrl: """+ПреобразоватьПуть(КаталогГеосервиса)+"\\images\\minus.png"", iconSize: [16, 16], popupAnchor: [5, 0] });
	|var minus_n = L.icon({ iconUrl: """+ПреобразоватьПуть(КаталогГеосервиса)+"\\images\\minus_n.png"", iconSize: [16, 16], popupAnchor: [5, 0] });
	|var plus = L.icon({ iconUrl: """+ПреобразоватьПуть(КаталогГеосервиса)+"\\images\\plus.png"", iconSize: [16, 16], popupAnchor: [5, 0] });
	|var plus_n = L.icon({ iconUrl: """+ПреобразоватьПуть(КаталогГеосервиса)+"\\images\\plus_n.png"", iconSize: [16, 16], popupAnchor: [5, 0] });
	|var ravno = L.icon({ iconUrl: """+ПреобразоватьПуть(КаталогГеосервиса)+"\\images\\ravno.png"", iconSize: [16, 16], popupAnchor: [5, 0] });
	|var ravno_n = L.icon({ iconUrl: """+ПреобразоватьПуть(КаталогГеосервиса)+"\\images\\ravno_n.png"", iconSize: [16, 16], popupAnchor: [5, 0] });
	|var tourism = L.icon({ iconUrl: """+ПреобразоватьПуть(КаталогГеосервиса)+"\\images\\tourism.png"", iconSize: [18, 18], popupAnchor: [5, 0] });
	|";
	
КонецПроцедуры

Процедура ДобавитьПодвал(Результат)
	
	Результат = Результат + "</script><input type=""hidden"" id=""openmismatch"" name=""openmismatch"" value=""none""><input type=""hidden"" id=""openoperation"" name=""openoperation"" value=""none""><input type=""hidden"" id=""openreport"" name=""openreport"" value=""none""></body></html>";
	
КонецПроцедуры

Процедура ДобавитьМаркер(Результат, Знач Широта, Знач Долгота, Текст, Маркер = "tp")
	
	Широта = СтрЗаменить(Широта, ",", "."); Долгота = СтрЗаменить(Долгота, ",", ".");
	Результат = Результат + "L.marker(["+Широта+", "+Долгота+"], {icon: "+Маркер+", iconSize: [20, 20]}).addTo(map).bindPopup("""+Текст+""");";
	
КонецПроцедуры

Функция ПреобразоватьПуть(Путь)
	
	Возврат "file:///" + СтрЗаменить(Путь, "\", "\\");
	
КонецФункции

Процедура ДобавитьЛинию(Результат, Знач ШиротаНачало, Знач ДолготаНачало, Знач ШиротаКонец, Знач ДолготаКонец, Цвет, Пунктиром)
	
	ШиротаНачало = СтрЗаменить(ШиротаНачало, ",", "."); ДолготаНачало = СтрЗаменить(ДолготаНачало, ",", "."); ШиротаКонец = СтрЗаменить(ШиротаКонец, ",", "."); ДолготаКонец = СтрЗаменить(ДолготаКонец, ",", ".");
	Результат = Результат + "var mpl = new L.Polyline([new L.LatLng(" + ШиротаНачало + ", " + ДолготаНачало + "), new L.LatLng(" + ШиротаКонец + ", " + ДолготаКонец + ")], { color: '" + Цвет + "', weight: 2, opacity: 0.5, smoothFactor: 1" + ?(Пунктиром, ", dashArray: '5, 5'", "") + " }); mpl.addTo(map);";
	
КонецПроцедуры

// Функция вызывается из самого DC
Функция ПолучитьАналитикиОперации(Операция, Аналитика) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ОперацияГрузы."+Аналитика+"
	               |ИЗ
	               |	Документ.Операция.Грузы КАК ОперацияГрузы
	               |ГДЕ
	               |	ОперацияГрузы.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Операция", Операция);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(Аналитика);
	
КонецФункции

