
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого Стр из Параметры.СписокГруженыхКТК Цикл
		ТЧКТК.Добавить().Контейнер = Стр;
	КонецЦикла;
	СделкаГруженая = Параметры.СделкаГруженая;
	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура НайтиЗаявкиПодсыла(Команда)
	
	СписокКТК = Новый Массив;
	Для каждого Стр из ТЧКТК Цикл СписокКТК.Добавить(Стр.Контейнер); КонецЦикла;
	
	Результат = ВернутьПараметрыЗаявкиПодсыла(СписокКТК, СделкаГруженая);
	Для каждого Стр из ТЧКТК Цикл
		
		РезСтр = Результат.Получить(Стр.Контейнер);
		ЗаполнитьЗначенияСвойств(Стр, РезСтр);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьПараметрыЗаявкиПодсыла(СписокКТК, СделкаГруженая)
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкаСоставУслуги.Ссылка КАК Заявка,
	               |	ЗаявкаСоставУслуги.НомерКТК КАК НомерКТК,
	               |	ЗапросНахожденияКТКВсделках.Сделка КАК Сделка,
	               |	ЗаявкаСоставУслуги.Ссылка.Контрагент КАК Клиент,
	               |	ЗаявкаСоставУслуги.Ссылка.Договор КАК Договор,
	               |	ЗаявкаСоставУслуги.УсловияПеревозкиНазначение КАК УсловияПеревозкиНазначение,
	               |	ЗаявкаСоставУслуги.УсловияПеревозки КАК УсловияПеревозки,
				   // ДИТ US 62421 TA 64346 Евсенкин М.А. Начало: 07.02.2023
				   // Было:
				   //|	ЗаявкаСоставУслуги.Груз КАК Груз, 
				   //Стало:
				   |	ЗаявкаСоставУслуги.КлючАналитикиПеревозки.Груз КАК Груз,
				   // ДИТ US 62421 TA 64346 Евсенкин М.А. Конец: 07.02.2023
	               |	ЗаявкаСоставУслуги.Калькуляция КАК Калькуляция,
	               |	ЗаявкаСоставУслуги.РазмерКТК КАК РазмерКТК,
				   // Евросиб Фролов (26.12.2021 TASK №44663
				   |	ЗаявкаСоставУслуги.ГУИДСтроки КАК ГУИДСтрокиЗаявки
				   // Евросиб Фролов)
	               |ИЗ
	               |	Документ.Заявка.СоставУслуги КАК ЗаявкаСоставУслуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			СделкаСвязьУчетныхЕдиниц.Контейнер КАК Контейнер,
	               |			СделкаСвязьУчетныхЕдиниц.Заявка КАК Заявка,
	               |			СделкаСвязьУчетныхЕдиниц.Ссылка КАК Сделка,
	               |			СделкаСвязьУчетныхЕдиниц.УчастокПеревозки КАК УчастокПеревозки
	               |		ИЗ
	               |			Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |		ГДЕ
	               |			СделкаСвязьУчетныхЕдиниц.Контейнер В(&СписокКТК)
	               |			И НЕ СделкаСвязьУчетныхЕдиниц.Ссылка.ПометкаУдаления) КАК ЗапросНахожденияКТКВсделках
	               |		ПО ЗаявкаСоставУслуги.НомерКТК = ЗапросНахожденияКТКВсделках.Контейнер
	               |			И ЗаявкаСоставУслуги.Ссылка = ЗапросНахожденияКТКВсделках.Заявка
	               |ГДЕ
	               |	ЗаявкаСоставУслуги.НомерКТК В(&СписокКТК)
	               |	И НЕ ЗаявкаСоставУслуги.Ссылка.ПометкаУдаления
	               |	И (ЗапросНахожденияКТКВсделках.Сделка ЕСТЬ NULL
	               |			ИЛИ ЗапросНахожденияКТКВсделках.УчастокПеревозки = ЗНАЧЕНИЕ(Перечисление.УчастокПеревозки.ПодсылКонтейнеров))
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЗаявкаСоставУслуги.Ссылка.Дата УБЫВ";
	Запрос.УстановитьПараметр("СписокКТК", СписокКТК);
	//Запрос.УстановитьПараметр("ГруженаяСделка", СделкаГруженая);
	ТЧОтвет = Запрос.Выполнить().Выгрузить();
	
	Для каждого КТК из СписокКТК Цикл
		
		СтруктураСоответствия = Новый Структура();
		Для каждого СтрТЧ из ТЧОтвет Цикл
			Если КТК = СтрТЧ.НомерКТК Тогда
				// Евросиб Фролов (26.12.2021 TASK №44663: добавил в структуру ГУИДСтрокиЗаявки
				СтруктураСоответствия = Новый Структура("Заявка,Клиент,Договор,УсловияПеревозки,УсловияПеревозкиНазначение,Груз,Калькуляция,РазмерКТК,ГУИДСтрокиЗаявки");
				ЗаполнитьЗначенияСвойств(СтруктураСоответствия, СтрТЧ);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Результат.Вставить(КТК, СтруктураСоответствия);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


&НаКлиенте
Процедура ТЧКТКЗаявкаПриИзменении(Элемент)
	
	ТекД = Элементы.ТЧКТК.ТекущиеДанные;
	ТекД.Клиент = неопределено; ТекД.Договор = неопределено;
	ТекД.УсловияПеревозки = неопределено; ТекД.УсловияПеревозкиНазначение = неопределено;
	ТекД.Груз = неопределено; ТекД.Калькуляция = неопределено;
	ТекД.РазмерКТК = неопределено;
	
	СписокКТК = Новый Массив; СписокКТК.Добавить(ТекД.Контейнер);
	Результат = ВернутьПараметрыЗаявкиПодсыла(СписокКТК, СделкаГруженая);
	РезСтр = Результат.Получить(ТекД.Контейнер);
	ЗаполнитьЗначенияСвойств(ТекД, РезСтр);
	
КонецПроцедуры


&НаКлиенте
Процедура ВключитьПодсылВСделку(Команда)
	
	Результат = Новый Массив;
	Для каждого Стр из ТЧКТК Цикл
		// Евросиб Фролов (26.12.2021 TASK №44663: добавил в структуру ГУИДСтрокиЗаявки
		Результат.Добавить(Новый Структура("Контейнер,Заявка,Клиент,Договор,УсловияПеревозки,УсловияПеревозкиНазначение,Груз,Калькуляция,РазмерКТК,ГУИДСтрокиЗаявки",Стр.Контейнер,Стр.Заявка,Стр.Клиент,Стр.Договор,Стр.УсловияПеревозки,Стр.УсловияПеревозкиНазначение,Стр.Груз,Стр.Калькуляция,Стр.РазмерКТК,Стр.ГУИДСтрокиЗаявки));
	КонецЦикла;
	
	Закрыть(Результат);
	
КонецПроцедуры

