
&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для каждого Стр из ТЧ Цикл Стр.Связать = Истина; КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыбор(Команда)
	Для каждого Стр из ТЧ Цикл Стр.Связать = Ложь; КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоиск(Команда)
	ТЧ.Очистить();
	ОбновитьПоискНаСервере();
	СопостТЧПриАктивизацииСтроки(неопределено);
	//Евросиб Каблов 04.02.2021 (
	//Для каждого Стр из СопостТЧ Цикл
	//	
	//	УдовлетворяетОтбору = Истина;
	//	
	//	Если поискКТК И поискКТК1.НайтиПоЗначению(Стр.Контейнер) = Неопределено Тогда
	//		УдовлетворяетОтбору = Ложь;
	//	КонецЕсли;
	//	
	//	Если поискВагоны И поискВагоны1.НайтиПоЗначению(Стр.Вагон) = Неопределено Тогда
	//		УдовлетворяетОтбору = Ложь;
	//	КонецЕсли;
	//	
	//	Если поискТД И поискТД1.НайтиПоЗначению(Стр.ТранспортныйДокумент) = Неопределено Тогда
	//		УдовлетворяетОтбору = Ложь;
	//	КонецЕсли;
	//	
	//	Если поискНоменклатура И поискНоменклатура1.НайтиПоЗначению(Стр.Номенклатура) = Неопределено Тогда
	//		УдовлетворяетОтбору = Ложь;
	//	КонецЕсли;
	//	
	//	Если поискСтанцияНазначения И поискСтанцияНазначения1.НайтиПоЗначению(Стр.СтанцияНазначения) = Неопределено Тогда
	//		УдовлетворяетОтбору = Ложь;
	//	КонецЕсли;
	//	
	//	Если поискСтанцияОтправления И поискСтанцияОтправления1.НайтиПоЗначению(Стр.СтанцияОтправления) = Неопределено Тогда
	//		УдовлетворяетОтбору = Ложь;
	//	КонецЕсли;
	//	
	//	Стр.ПоказатьВОтборе = УдовлетворяетОтбору;
	//	
	//КонецЦикла;
	//Евросиб Каблов 04.02.2021 )
	
	УстановитьОтборТаблицыСопоставления();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоискНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПоискПоКТК", поискКТК);
	Запрос.УстановитьПараметр("ПоискПоВагонам", поискВагоны);
	Запрос.УстановитьПараметр("ПоискПоТД", поискТД);
	//Евросиб - АСуслов 28.11.2021 16:10:47 #42886
	//(
	//СделкиСЭтимиОтборами = ОтработатьОтборСделокПоГрузу(поискКТК1.ВыгрузитьЗначения(), поискВагоны1.ВыгрузитьЗначения(), поискТД1.ВыгрузитьЗначения(), поискКТК, поискВагоны, поискТД);
	//Запрос.УстановитьПараметр("СделкиСЭтимиОтборами", СделкиСЭтимиОтборами);
	//)
	//Евросиб - АСуслов 28.11.2021 16:10:55 #42886
	Запрос.УстановитьПараметр("ОтборПоУслуге", поискНоменклатура);
	Запрос.УстановитьПараметр("ОтборПоУслуге1", поискНоменклатура1.ВыгрузитьЗначения());
	
	Запрос.УстановитьПараметр("ОтборСтОтправления", поискСтанцияОтправления);
	Запрос.УстановитьПараметр("СтОтправления", поискСтанцияОтправления1);
	Запрос.УстановитьПараметр("ОтборСтНазначения", поискСтанцияНазначения);
	Запрос.УстановитьПараметр("СтНазначения", поискСтанцияНазначения1);
	
	Запрос.УстановитьПараметр("ОтборПоставщик", поискПоставщик);
	Запрос.УстановитьПараметр("Поставщики", поискПоставщик1.ВыгрузитьЗначения());
	
	Запрос.УстановитьПараметр("ОтборДоговор", поискДоговор);
	Запрос.УстановитьПараметр("Договоры", поискДоговор1.ВыгрузитьЗначения());
	
	Запрос.УстановитьПараметр("ОтборПоУслуге", поискНоменклатура);
	Запрос.УстановитьПараметр("УслугиОтбор", поискНоменклатура1.ВыгрузитьЗначения());
	
	Запрос.УстановитьПараметр("ОтборПОтправления", поискПериодОтправления);
	Запрос.УстановитьПараметр("ПО1", поискПериодОтправления1.ДатаНачала);
	Запрос.УстановитьПараметр("ПО2", поискПериодОтправления1.ДатаОкончания);
	
	Запрос.УстановитьПараметр("ОтборППрибытия", поискПериодПрибытия);
	Запрос.УстановитьПараметр("ПП1", поискПериодПрибытия1.ДатаНачала);
	Запрос.УстановитьПараметр("ПП2", поискПериодПрибытия1.ДатаОкончания);
	
	Запрос.УстановитьПараметр("ОтборПоставщик", поискПоставщик);
	Запрос.УстановитьПараметр("Поставщики", поискПоставщик1.ВыгрузитьЗначения()); 
	
	//Евросиб - АСуслов 28.11.2021 16:19:34 #42886
	//(
	Запрос.УстановитьПараметр("СписокКТК", поискКТК1.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("СписокВагонов",поискВагоны1.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("СписокТД", поискТД1.ВыгрузитьЗначения());
	//)
	//Евросиб - АСуслов 28.11.2021 16:19:37 #42886
	
	//Евросиб - АСуслов 18.08.2022 13:15:20 #55129
	//(
	Запрос.Текст = ПолучитьТекстЗапросаАвторазнесениеПоПараметрам();
	//)
	//Евросиб - АСуслов 18.08.2022 13:15:21 #55129
	Ответ = Запрос.Выполнить().Выбрать();
	СтруктураНакладных = Новый Соответствие;
	Пока Ответ.Следующий() Цикл
		НСтр = ТЧ.Добавить();
		НСтр.Связать = Истина;
		ЗаполнитьЗначенияСвойств(НСтр, Ответ);
		//Евросиб - АСуслов 08.09.2022 16:00:55 #56540
		//( 
		Если ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьРегистрРазнесениеРасходовДляРазнесенияАкцептов") Тогда
			Если ЗначениеЗаполнено(Ответ.ДатаОтправленияЖД)
				И ЗначениеЗаполнено(Ответ.ДатаОтправленияМоре) Тогда
				ДатаОтправления = Мин(Ответ.ДатаОтправленияЖД, Ответ.ДатаОтправленияМоре);
			Иначе
				ДатаОтправления = Макс(Ответ.ДатаОтправленияЖД, Ответ.ДатаОтправленияМоре);
			КонецЕсли;
			нСтр.ДатаОтправления = ДатаОтправления;
			нСтр.ДатаПрибытия = Макс(Ответ.ДатаРаскредитацииЖД, Ответ.ДатаПрибытияМоре, Ответ.ДатаВыдачи);
		КонецЕсли;
		//)
		//Евросиб - АСуслов 08.09.2022 16:00:57 #56540
		Если НСтр.Количество > 0 Тогда
			НСтр.Цена = НСтр.СуммаИтого / НСтр.Количество;
		КонецЕсли;                                                      
//Евросиб Гудкова( 25.04.2022 Ticket№ 50626
		//СписокНакладных = СтруктураНакладных.Получить(НСтр.Сделка);
		//Если СписокНакладных = Неопределено Тогда
		//	СписокНакладных = ПолучитьСписокНакладныхСделки(НСтр.Сделка);	
		//	СтруктураНакладных.Вставить(НСтр.Сделка, СписокНакладных);
		//КонецЕсли;
		//НСтр.СписокТД = СписокНакладных;
// Евросиб Гудкова)
		
	КонецЦикла;		
	
КонецПроцедуры    

//Евросиб - АСуслов 18.08.2022 13:15:51 #55129
//(
&НаСервере
Функция ПолучитьТекстЗапросаАвторазнесениеПоПараметрам();
	ИспользоватьРегистрРазнесениеРасходовДляРазнесенияАкцептов = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("ИспользоватьРегистрРазнесениеРасходовДляРазнесенияАкцептов");
	Если ИспользоватьРегистрРазнесениеРасходовДляРазнесенияАкцептов Тогда
		Возврат ПолучитьТекстЗапросаАвторазнесениеПоПараметрам_РегистрРазнесениеРасходов();
	Иначе
		Возврат ПолучитьТекстЗапросаАвторазнесениеПоПараметрам_РегистрРазнесениеЗатратПТУ();
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьТекстЗапросаАвторазнесениеПоПараметрам_РегистрРазнесениеЗатратПТУ()
	Возврат "ВЫБРАТЬ
	|	СделкаРасходы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_СделкиПоОтборам
	|ИЗ
	|	Документ.Сделка.Расходы КАК СделкаРасходы
	|ГДЕ
	|   СделкаРасходы.УслугаОтключена = Ложь И
	|	ВЫБОР
	|			КОГДА &ПоискПоКТК
	|				ТОГДА СделкаРасходы.Контейнер В (&СписокКТК)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ПоискПоВагонам
	|				ТОГДА СделкаРасходы.Вагон В (&СписокВагонов)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ПоискПоТД
	|				ТОГДА СделкаРасходы.ТранспортныйДокумент В (&СписокТД)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазнесениеЗатратПТУОстатки.Сделка КАК Сделка,
	|	РазнесениеЗатратПТУОстатки.ГУИДРасходов КАК ГУИДРасходов,
	|	РазнесениеЗатратПТУОстатки.ПодлежащаяРазнесениюОстаток КАК НеРазнесено,
	|	СделкаРасходы.Поставщик КАК Поставщик,
	|	СделкаРасходы.Договор КАК Договор,
	|	СделкаРасходы.Услуга КАК Услуга,
	|	СделкаРасходы.Количество КАК Количество,
	|	СделкаРасходы.СуммаИтого КАК СуммаИтого,
	|	СделкаРасходы.СуммаНДС КАК СуммаНДС,
	|	СделкаРасходы.Груз КАК Груз,
	|	СделкаРасходы.Операция КАК Операция,
	//|	СделкаСвязьУчетныхЕдиниц.Контейнер.Наименование КАК СписокКТК,
	//|	СделкаСвязьУчетныхЕдиниц.НомерЖДН КАК СписокТД,
	//|	СделкаСвязьУчетныхЕдиниц.Вагон.Наименование КАК СписокВагонов,
	|	СделкаРасходы.Контейнер.Наименование КАК СписокКТК,
	|	СделкаРасходы.ТранспортныйДокумент.НомерТранспортногоДокумента КАК СписокТД,
	|	СделкаРасходы.Вагон.Наименование КАК СписокВагонов,
	|	СделкаДоходы.УчДокумент КАК ДоходыСделкиУчДокумент,
	|	СрокиРейсыЖД.РейсДатаОтправления КАК ОтправлениеРейса,
	|	СрокиРейсыЖД.РейсДатаПрибытия КАК ПрибытиеРейса,
	|	СделкаРасходы.Валюта КАК Валюта,
	|	СделкаРасходы.ПунктОтправления КАК ПунктОтправления,
	|	СделкаРасходы.ПунктНазначения КАК ПунктНазначения
	|ИЗ
	|	РегистрНакопления.РазнесениеЗатратПТУ.Остатки КАК РазнесениеЗатратПТУОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.Доходы КАК СделкаДоходы
	|			ПО СделкаРасходы.Ссылка = СделкаДоходы.Ссылка
	|				И СделкаРасходы.ГУИД = СделкаДоходы.ГУИД
	//|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	//|			ПО СделкаРасходы.Ссылка = СделкаСвязьУчетныхЕдиниц.Ссылка
	//|				И СделкаРасходы.СтрокаСвязьУчетныхЕдиниц = СделкаСвязьУчетныхЕдиниц.ГУИД
	|		ПО РазнесениеЗатратПТУОстатки.Сделка = СделкаРасходы.Ссылка
	|			И РазнесениеЗатратПТУОстатки.ГУИДРасходов = СделкаРасходы.ГУИД
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МИНИМУМ(СделкаРейсы.Рейс.ДатаОтправления) КАК РейсДатаОтправления,
	|			МАКСИМУМ(СделкаРейсы.Рейс.ДатаПрибытия) КАК РейсДатаПрибытия,
	|			СделкаРейсы.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.Сделка.Рейсы КАК СделкаРейсы
	|		ГДЕ
	|			ТИПЗНАЧЕНИЯ(СделкаРейсы.Рейс) = ТИП(Справочник.РейсыЖД)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СделкаРейсы.Ссылка) КАК СрокиРейсыЖД
	|		ПО РазнесениеЗатратПТУОстатки.Сделка = СрокиРейсыЖД.Ссылка
	|ГДЕ
	|	РазнесениеЗатратПТУОстатки.ПолностьюРазнесеноОстаток <> 0
	|	И ВЫБОР
	|			КОГДА &ПоискПоКТК
	|					ИЛИ &ПоискПоВагонам
	|					ИЛИ &ПоискПоТД
	//|				ТОГДА РазнесениеЗатратПТУОстатки.Сделка В (&СделкиСЭтимиОтборами)
	|				ТОГДА РазнесениеЗатратПТУОстатки.Сделка В (ВЫБРАТЬ т.Ссылка ИЗ ВТ_СделкиПоОтборам Как т)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборПоУслуге
	|				ТОГДА СделкаРасходы.Услуга В (&УслугиОтбор)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборСтОтправления
	|				ТОГДА РазнесениеЗатратПТУОстатки.Сделка.СтанцияОтправления В ИЕРАРХИИ (&СтОтправления)
	|						ИЛИ РазнесениеЗатратПТУОстатки.Сделка.ПогранпереходИзСтраныОтправления В ИЕРАРХИИ (&СтОтправления)
	|						ИЛИ СделкаРасходы.ПунктОтправления В ИЕРАРХИИ (&СтОтправления)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборСтНазначения
	|				ТОГДА РазнесениеЗатратПТУОстатки.Сделка.СтанцияНазначения В ИЕРАРХИИ (&СтНазначения)
	|						ИЛИ РазнесениеЗатратПТУОстатки.Сделка.ПогранпереходВСтрануНазначения В ИЕРАРХИИ (&СтНазначения)
	|						ИЛИ СделкаРасходы.ПунктНазначения В ИЕРАРХИИ (&СтНазначения)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборПоставщик
	|				ТОГДА СделкаРасходы.Поставщик В (&Поставщики)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборДоговор
	|				ТОГДА СделкаРасходы.Договор В (&Договоры)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборПОтправления
	|				ТОГДА СрокиРейсыЖД.РейсДатаОтправления МЕЖДУ &ПО1 И &ПО2
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборППрибытия
	|				ТОГДА СрокиРейсыЖД.РейсДатаПрибытия МЕЖДУ &ПП1 И &ПП2
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НЕ СделкаРасходы.ВнутренняяСебестоимость
	//Евросиб Каблов 09.07.2021 ( Ticket#0236476
	|	И НЕ СделкаРасходы.Ссылка.Служебная
	//Евросиб Каблов 09.07.2021 )
	// Евросиб US 97856 TA 105372 Рыбьяков К.А. 27.03.2025 ((
	|	И НЕ СделкаРасходы.Услуга.НоменклатураДляКалькуляций";
	// Евросиб Рыбьяков К.А. 27.03.2025 ))
КонецФункции

&НаСервере
Функция ПолучитьТекстЗапросаАвторазнесениеПоПараметрам_РегистрРазнесениеРасходов()
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РазнесениеРасходовОстатки.Сделка КАК Сделка,
	|	РазнесениеРасходовОстатки.ГУИДРасходов КАК ГУИДРасходов,
	|	СделкаРасходы.Поставщик КАК Поставщик,
	|	СделкаРасходы.Договор КАК Договор,
	|	СделкаРасходы.Услуга КАК Услуга,
	|	СделкаРасходы.Количество КАК Количество,
	|	СделкаРасходы.СуммаИтого КАК СуммаИтого,
	|	СделкаРасходы.СуммаНДС КАК СуммаНДС,
	|	СделкаРасходы.Груз КАК Груз,
	|	СделкаРасходы.Операция КАК Операция,
	|	СделкаРасходы.Контейнер.Наименование КАК СписокКТК,
	|	СделкаРасходы.ТранспортныйДокумент.НомерТранспортногоДокумента КАК СписокТД,
	|	СделкаРасходы.Вагон.Наименование КАК СписокВагонов,
	|	СрокиРейсыЖД.РейсДатаОтправления КАК ОтправлениеРейса,
	|	СрокиРейсыЖД.РейсДатаПрибытия КАК ПрибытиеРейса,
	|	СделкаРасходы.Валюта КАК Валюта,
	|	СделкаРасходы.ПунктОтправления КАК ПунктОтправления,
	|	СделкаРасходы.ПунктНазначения КАК ПунктНазначения,
	|	ЕСТЬNULL(ДатыПодачАвтоПодВыгрузку.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВыдачи,
	|	ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.ЖДН.ДатаОтправления, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОтправленияЖД,
	|	ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.Коносамент.ДатаОтправления, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОтправленияМоре,
	|	ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.Коносамент.ДатаПрибытия, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПрибытияМоре,
	|	ЕСТЬNULL(СделкаСвязьУчетныхЕдиниц.ЖДН.ДатаРаскредитации, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРаскредитацииЖД
	|ИЗ
	|	РегистрНакопления.РазнесениеРасходов.Остатки(, ) КАК РазнесениеРасходовОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сделка.Расходы КАК СделкаРасходы
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПодачАвтоПодВыгрузку КАК ДатыПодачАвтоПодВыгрузку
	|			ПО СделкаРасходы.СтрокаСвязьУчетныхЕдиниц = ДатыПодачАвтоПодВыгрузку.ИдентификаторСвязьУчетныхЕдиниц
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	|			ПО СделкаРасходы.СтрокаСвязьУчетныхЕдиниц = СделкаСвязьУчетныхЕдиниц.ГУИД
	|		ПО РазнесениеРасходовОстатки.Сделка = СделкаРасходы.Ссылка
	|			И РазнесениеРасходовОстатки.ГУИДРасходов = СделкаРасходы.ГУИД
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МИНИМУМ(СделкаРейсы.Рейс.ДатаОтправления) КАК РейсДатаОтправления,
	|			МАКСИМУМ(СделкаРейсы.Рейс.ДатаПрибытия) КАК РейсДатаПрибытия,
	|			СделкаРейсы.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.Сделка.Рейсы КАК СделкаРейсы
	|		ГДЕ
	|			ТИПЗНАЧЕНИЯ(СделкаРейсы.Рейс) = ТИП(Справочник.РейсыЖД)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СделкаРейсы.Ссылка) КАК СрокиРейсыЖД
	|		ПО РазнесениеРасходовОстатки.Сделка = СрокиРейсыЖД.Ссылка
	|ГДЕ
	|	РазнесениеРасходовОстатки.НеРазнесеноОстаток > 0
	|	И &ОтборПоКТК
	|	И &ОтборПоВагонам
	|	И &ОтборПоТД
	|	И &ОтборПоУслуге
	|	И &ОтборСтОтправления
	|	И &ОтборСтНазначения
	|	И &ОтборПоставщик
	|	И &ОтборДоговор
	|	И &ОтборПОтправления
	|	И &ОтборППрибытия
	|	И СделкаРасходы.УслугаОтключена = ЛОЖЬ
	// Евросиб US 97856 TA 105372 Рыбьяков К.А. 27.03.2025 ((
	|	И НЕ СделкаРасходы.Услуга.НоменклатураДляКалькуляций";
	// Евросиб Рыбьяков К.А. 27.03.2025 ))
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &ОтборПоКТК", 		 ?(поискКТК, 			 	"И СделкаРасходы.Контейнер В (&СписокКТК)", 									""));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &ОтборПоВагонам", 	 ?(поискВагоны, 		 	"И СделкаРасходы.Вагон В (&СписокВагонов)", 									""));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &ОтборПоТД", 		 ?(поискТД, 				"И СделкаРасходы.ТранспортныйДокумент В (&СписокТД)",							""));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &ОтборПоУслуге", 	 ?(поискНоменклатура, 	 	"И СделкаРасходы.Услуга В (&УслугиОтбор)", 										""));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &ОтборПоставщик",  	 ?(поискПоставщик, 		 	"И СделкаРасходы.Поставщик В (&Поставщики)", 									""));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &ОтборДоговор", 	 ?(поискДоговор, 		 	"И СделкаРасходы.Договор В (&Договоры)", 										""));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &ОтборПОтправления", ?(поискПериодОтправления,	"И СрокиРейсыЖД.РейсДатаОтправления МЕЖДУ &ПО1 И &ПО2", 						""));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &ОтборППрибытия", 	 ?(поискПериодПрибытия,	 	"И СрокиРейсыЖД.РейсДатаПрибытия МЕЖДУ &ПП1 И &ПП2", 							""));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &ОтборСтОтправления",?(поискСтанцияОтправления,	"И (РазнесениеРасходовОстатки.Сделка.СтанцияОтправления В ИЕРАРХИИ (&СтОтправления)
																								|ИЛИ РазнесениеРасходовОстатки.Сделка.ПогранпереходИзСтраныОтправления В ИЕРАРХИИ (&СтОтправления)
																								|ИЛИ СделкаРасходы.ПунктОтправления В ИЕРАРХИИ (&СтОтправления))", 			""));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &ОтборСтНазначения", ?(поискСтанцияНазначения,	"И (РазнесениеРасходовОстатки.Сделка.СтанцияНазначения В ИЕРАРХИИ (&СтНазначения)
																								|ИЛИ РазнесениеРасходовОстатки.Сделка.ПогранпереходВСтрануНазначения В ИЕРАРХИИ (&СтНазначения)
																								|ИЛИ СделкаРасходы.ПунктНазначения В ИЕРАРХИИ (&СтНазначения))", 			""));
	Возврат ТекстЗапроса;
	
КонецФункции
//)
//Евросиб - АСуслов 18.08.2022 13:15:53 #55129


&НаСервере
Функция ПолучитьСписокНакладныхСделки(Сделка)
	
	НайдС = СделкаНакладные.НайтиСтроки(Новый Структура("Сделка", Сделка));
	Если НайдС.Количество() > 0 Тогда Возврат НайдС[0].Накладные; КонецЕсли;
	
	//Для каждого Стр из СделкаНакладные Цикл
	//	Если Стр.Сделка = Сделка Тогда Возврат Стр.Накладные; КонецЕсли;
	//КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               //|	СделкаСвязьУчетныхЕдиниц.НомерЖДН КАК НомерЖДН
	               |	СделкаСвязьУчетныхЕдиниц.ЖДН.НомерТранспортногоДокумента КАК НомерЖДН
	               |ПОМЕСТИТЬ Т1
	               |ИЗ
	               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |ГДЕ
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               //|	СделкаСвязьУчетныхЕдиниц.НомерВагоннойЖДН
	               |	СделкаСвязьУчетныхЕдиниц.ВагоннаяЖДН.НомерТранспортногоДокумента
	               |ИЗ
	               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |ГДЕ
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
				   //|	СделкаСвязьУчетныхЕдиниц.НомерПорожнейЖДНКТК
				   |	СделкаСвязьУчетныхЕдиниц.ПорожняяЖДНКТК.НомерТранспортногоДокумента
	               |ИЗ
	               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |ГДЕ
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
				   |	СделкаСвязьУчетныхЕдиниц.НакладнаяПослеГруженогоПлеча.НомерТранспортногоДокумента
	               |ИЗ
	               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |ГДЕ
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
				   |	СделкаСвязьУчетныхЕдиниц.НакладнаяПослеГружКТК.НомерТранспортногоДокумента
	               |ИЗ
	               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |ГДЕ
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
				   |	СделкаСвязьУчетныхЕдиниц.ЖДНПерестановкиДоГружКТК.НомерТранспортногоДокумента
	               |ИЗ
	               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |ГДЕ
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
				   |	СделкаСвязьУчетныхЕдиниц.ЖДНПерестановкиДоПорКТК.НомерТранспортногоДокумента
	               |ИЗ
	               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |ГДЕ
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               //|	СделкаСвязьУчетныхЕдиниц.НомерПорожнейВагоннойЖДН
	               |	СделкаСвязьУчетныхЕдиниц.ПорожняяВагоннаяЖДН.НомерТранспортногоДокумента
	               |ИЗ
	               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |ГДЕ
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Т1.НомерЖДН КАК НомерЖДН
	               |ИЗ
	               |	Т1 КАК Т1
	               |ГДЕ
	               |	Т1.НомерЖДН <> """"";
	Запрос.УстановитьПараметр("Ссылка", Сделка);
	Результат = СтрСоединить(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерЖДН"), ";");
	
	НСтр = СделкаНакладные.Добавить();
	НСтр.Сделка = Сделка;
	НСтр.Накладные = Результат;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОтработатьОтборСделокПоГрузу(поискКТК1ВыгрузитьЗначения, поискВагоны1ВыгрузитьЗначения, поискТД1ВыгрузитьЗначения, поискКТК, поискВагоны, поискТД)
	
	Результат = Новый Массив;
	
	Если НЕ поискКТК И НЕ поискВагоны И НЕ поискТД Тогда Возврат Результат; КонецЕсли;
	
	СписокТД2 = Новый Массив;
	Для каждого Стр из поискТД1ВыгрузитьЗначения Цикл СписокТД2.Добавить(Стр.НомерТранспортногоДокумента); КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СделкаСвязьУчетныхЕдиниц.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Сделка.СвязьУчетныхЕдиниц КАК СделкаСвязьУчетныхЕдиниц
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &ОтборКТКУстановлен
	               |				ТОГДА СделкаСвязьУчетныхЕдиниц.Контейнер В (&ОтборКТК)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &ОтборВагонУстановлен
	               |				ТОГДА СделкаСвязьУчетныхЕдиниц.Вагон В (&ОтборВагон)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &ОтборТДУстановлен
	               |				ТОГДА СделкаСвязьУчетныхЕдиниц.НомерЖДН В (&ОтборТД)
	               |						ИЛИ СделкаСвязьУчетныхЕдиниц.НомерВагоннойЖДН В (&ОтборТД)
	               |						ИЛИ СделкаСвязьУчетныхЕдиниц.НомерПорожнейЖДНКТК В (&ОтборТД)
	               |						ИЛИ СделкаСвязьУчетныхЕдиниц.НомерПорожнейВагоннойЖДН В (&ОтборТД)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("ОтборКТКУстановлен", поискКТК);
	Запрос.УстановитьПараметр("ОтборКТК", поискКТК1ВыгрузитьЗначения);
	Запрос.УстановитьПараметр("ОтборВагонУстановлен", поискВагоны);
	Запрос.УстановитьПараметр("ОтборВагон", поискВагоны1ВыгрузитьЗначения);
	Запрос.УстановитьПараметр("ОтборТДУстановлен", поискТД);
	Запрос.УстановитьПараметр("ОтборТД", СписокТД2);
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ссылка");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
  //Евросиб Гудкова( 29.11.2021 Ticket№ 42922
  	УИДЗамера = Параметры.УИДЗамера; 
  // Евросиб Гудкова)
	//ОбновитьПоискНаСервере();
	ПоказыватьТолькоНепривязанныеСтроки = Истина;
	
	поискВагоны1.ЗагрузитьЗначения(Параметры.массивВагонов);
	поискКТК1.ЗагрузитьЗначения(Параметры.массивКТК);
	поискТД1.ЗагрузитьЗначения(Параметры.массивЖДН);
	
	поискНоменклатура1.ЗагрузитьЗначения(Параметры.массивУслуг);
	
	поискПериодОтправления1.ДатаНачала = Параметры.ДатаОтправленияМин;
	поискПериодОтправления1.ДатаОкончания = Параметры.ДатаОтправленияМакс;
	
	поискПериодПрибытия1.ДатаНачала = Параметры.ДатаПрибытияМин;
	поискПериодПрибытия1.ДатаОкончания = Параметры.ДатаПрибытияМакс;
	
	поискСтанцияОтправления1.ЗагрузитьЗначения(Параметры.массивСтОтправления);
	поискСтанцияНазначения1.ЗагрузитьЗначения(Параметры.массивСтНазначения);
	
	поискПоставщик1.ЗагрузитьЗначения(Параметры.массивПоставщиков);
	поискДоговор1.ЗагрузитьЗначения(Параметры.массивДоговоров);
	ПоставщикАкцепта = Параметры.массивПоставщиков[0];
	ДоговорАкцепта = Параметры.массивДоговоров[0];
	
	Для каждого Стр из Параметры.массивСтрок Цикл
		Нстр = СопостТЧ.Добавить();
		НСтр.Связать = Истина;
		ЗаполнитьЗначенияСвойств(НСтр, Стр);
		НСтр.НомерТД = Стр.ТранспортныйДокумент.НомерТранспортногоДокумента;
		//НСтр.ВесПоНакладной = ПретензииИНеакцептыСервер.ПолучитьВесНеттоПоНакладной(НСтр.НомерТД, НСтр.Контейнер);
		НСтр.НоменклатураИмеетНесколькоСопоставлений = ?(ПретензииИНеакцептыСервер.НоменклатуруРазрешеноСопоставлятьС(НСтр.Номенклатура, НСтр.ВесПоНакладной).Количество() > 1, 0, 1);
	КонецЦикла; 
	
	КоличествоСтрокВсего = СопостТЧ.Количество();
	СуммаСтрокВсего = СопостТЧ.Итог("ПоступлениеСумма");
	
	поискВагоны = поискВагоны1.Количество() > 0;
	поискКТК = поискКТК1.Количество() > 0;
	поискТД = поискТД1.Количество() > 0;
	поискНоменклатура = поискНоменклатура1.Количество() > 0;

	СвязыватьПоКТК = поискКТК;
	СвязыватьПоВагонам = поискВагоны;
	СвязыватьПоТранспДокументам = поискТД;
	СвязыватьПоНоменклатуре = поискНоменклатура;   
	//Евросиб - АСуслов 14.10.2022 16:33:14 #
	//(
	СвязыватьПоПериодуОказанияУслуги = ЗначениеЗаполнено(поискПериодОтправления1) ИЛИ ЗначениеЗаполнено(поискПериодПрибытия1);
	//)
	//Евросиб - АСуслов 14.10.2022 16:33:15 #
	
	Если поискВагоны = Ложь И поискКТК = Ложь И поискТД = Ложь И поискНоменклатура = Ложь Тогда поискКТК = Истина; КонецЕсли;
	
//Евросиб Гудкова( 05.03.2021 Ticket№ 0225392
	ЭтаФорма.Заголовок = "Акцепт № " + Параметры.НомерАкцепта + " от " + Формат(Параметры.ДатаАкцепта, "ДЛФ=Д");
// Евросиб Гудкова) 	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура СвязатьВыбранные(Команда)
	
	Для каждого Стр1 из СопостТЧ Цикл
		Если НЕ Стр1.Связать Тогда Продолжить; КонецЕсли;
		
		Для каждого Стр2 из ТЧ Цикл
			Если НЕ Стр2.Связать Тогда Продолжить; КонецЕсли;
			
			ОбнаруженОтказ = Ложь;
			Если СвязыватьПоКТК И Найти(Стр2.СписокКТК, Стр1.Контейнер) = 0 Тогда ОбнаруженОтказ = Истина; КонецЕсли;
			Если СвязыватьПоВагонам И Найти(Стр2.СписокВагонов, Стр1.Вагон) = 0 Тогда ОбнаруженОтказ = Истина; КонецЕсли;
			
			Если СвязыватьПоТранспДокументам И Найти(Стр2.СписокТД, Стр1.НомерТД) = 0 Тогда ОбнаруженОтказ = Истина; КонецЕсли;
			
			Если СвязыватьПоНоменклатуре И Стр2.Услуга <> Стр1.Номенклатура Тогда ОбнаруженОтказ = Истина; КонецЕсли;
			
			Если СвязыватьПоПоставщикам И Стр2.Поставщик <> ПоставщикАкцепта Тогда ОбнаруженОтказ = Истина; КонецЕсли;
			Если СвязыватьПоДоговору И Стр2.Договор <> ДоговорАкцепта Тогда ОбнаруженОтказ = Истина; КонецЕсли;
			
			Если НЕ СвязыватьПоКТК И НЕ СвязыватьПоВагонам И НЕ СвязыватьПоТранспДокументам И НЕ СвязыватьПоПоставщикам И НЕ СвязыватьПоДоговору И НЕ СвязыватьПоНоменклатуре Тогда ОбнаруженОтказ = Истина; КонецЕсли;
			
			Если НЕ ОбнаруженОтказ Тогда
				
				Стр1.ИдентификаторСтрокиРасходовВСделке = Стр2.ГУИДРасходов;
				Стр1.Сделка = Стр2.Сделка;
				Стр1.ПолностьюРазнесено = Истина;
				Стр1.Связать = Ложь;
				
				Стр1.сопостНоменклатура = Стр2.Услуга;
				Стр1.сопостКТК = Стр2.СписокКТК;
				Стр1.сопостВагоны = Стр2.СписокВагонов;
				Стр1.сопостТД = Стр2.СписокТД;
				Стр1.сопостСумма = Стр2.НеРазнесено;
				Стр1.сопостСделка = Стр2.Сделка;
				
				Прервать;
				
			КонецЕсли;
			
			
		КонецЦикла;
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе1(Команда)
	Для каждого Стр из СопостТЧ Цикл Стр.Связать = Истина; КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыбор1(Команда)
	Для каждого Стр из СопостТЧ Цикл Стр.Связать = Ложь; КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьНеразнесенные(Команда)
	Для каждого Стр из СопостТЧ Цикл Стр.Связать = НЕ Стр.ПолностьюРазнесено; КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВАкцепт(Команда)
	
	Результат = Новый Массив;
	
	Для каждого Стр из СопостТЧ Цикл
		
		СтруктураРезультата = Новый Структура("ИдентификаторСтрокиПоступления,
											|Контейнер,
											|Вагон,
											|ТранспортныйДокумент,
											|Сделка,
											|ИдентификаторСтрокиРасходовВСделке,
											//Евросиб - АСуслов 08.09.2022 13:35:07 #56540
											//(
											|НачалоОказанияУслуги,
											|ОкончаниеОказанияУслуги,
											|ГУИД");
		ЗаполнитьЗначенияСвойств(СтруктураРезультата, Стр);
		Результат.Добавить(СтруктураРезультата);
		//)
		//Евросиб - АСуслов 08.09.2022 13:40:06 #56540
		
	КонецЦикла;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура СопостТЧПриАктивизацииСтроки(Элемент)
	
	ПересчитатьОтборВыделеннойСтроки();
	Элементы.ТЧ.ОтборСтрок = Новый ФиксированнаяСтруктура("ПоказатьВОтборе", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьОтборВыделеннойСтроки()
	
	РТД = Элементы.СопостТЧ.ТекущиеДанные;
	Если РТД = неопределено
		Или Не (СвязыватьПоКТК Или СвязыватьПоВагонам Или СвязыватьПоТранспДокументам Или СвязыватьПоНоменклатуре Или СвязыватьПоПоставщикам Или СвязыватьПоДоговору Или СвязыватьПоПериодуОказанияУслуги) Тогда
		Для Каждого Стр из ТЧ Цикл
			Стр.ПоказатьВОтборе = Ложь;
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	Для каждого Стр из ТЧ Цикл
		
		НадеемсяЧтоСовпадет = Истина; 
		
		//Евросиб - АСуслов 08.09.2022 11:27:39 #56540
		//(
		Если СвязыватьПоПериодуОказанияУслуги И ЗначениеЗаполнено(РТД.НачалоОказанияУслуги) И РТД.НачалоОказанияУслуги < Стр.ДатаОтправления Тогда
			НадеемсяЧтоСовпадет = Ложь;
		КонецЕсли;
		Если СвязыватьПоПериодуОказанияУслуги И ЗначениеЗаполнено(РТД.ОкончаниеОказанияУслуги) И РТД.ОкончаниеОказанияУслуги > Стр.ДатаПрибытия Тогда
			НадеемсяЧтоСовпадет = Ложь;
		КонецЕсли;
		//)
		//Евросиб - АСуслов 08.09.2022 11:28:55 #56540
		
		Если СвязыватьПоКТК И Найти(Стр.СписокКТК, РТД.Контейнер) = 0 Тогда НадеемсяЧтоСовпадет = Ложь; КонецЕсли;
		Если СвязыватьПоВагонам И Найти(Стр.СписокВагонов, РТД.Вагон) = 0 Тогда НадеемсяЧтоСовпадет = Ложь; КонецЕсли;
		Если СвязыватьПоТранспДокументам И Найти(Стр.СписокТД, РТД.НомерТД) = 0 Тогда НадеемсяЧтоСовпадет = Ложь; КонецЕсли;
		Если СвязыватьПоНоменклатуре Тогда
			
			НайдСтрокиКэша = КэшСопоставителяКлиент.НайтиСтроки(Новый Структура("Номенклатура, Вес", РТД.Номенклатура, РТД.ВесПоНакладной));
			
			Если НайдСтрокиКэша.Количество() = 0 Тогда
				
				МассивРазрНоменклатуры = МассивРазрНоменклатуры(РТД.Номенклатура, РТД.ВесПоНакладной);
				НСтр = КэшСопоставителяКлиент.Добавить();
				НСтр.Номенклатура = РТД.Номенклатура;
				НСтр.Вес = РТД.ВесПоНакладной;
				НСтр.СопоставляемаяНоменклатура.ЗагрузитьЗначения(МассивРазрНоменклатуры);
				
			Иначе
				
				МассивРазрНоменклатуры = НайдСтрокиКэша[0].СопоставляемаяНоменклатура.ВыгрузитьЗначения();
				
			КонецЕсли;
			
			Если МассивРазрНоменклатуры.Найти(Стр.Услуга) = неопределено Тогда 
				НадеемсяЧтоСовпадет = Ложь; 
			КонецЕсли;
			
		КонецЕсли;
		Если СвязыватьПоПоставщикам И Стр.Поставщик <> ПоставщикАкцепта Тогда НадеемсяЧтоСовпадет = Ложь; КонецЕсли;
		Если СвязыватьПоДоговору И Стр.Договор <> ДоговорАкцепта Тогда НадеемсяЧтоСовпадет = Ложь; КонецЕсли;
		
		Стр.ПоказатьВОтборе = НадеемсяЧтоСовпадет;
		
	КонецЦикла;
			
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция МассивРазрНоменклатуры(Номенклатура, ВесПоНакладной)
	
	РазрНоменклатура = ПретензииИНеакцептыСервер.НоменклатуруРазрешеноСопоставлятьС(Номенклатура, ВесПоНакладной);
	РазрНоменклатура.Добавить(Номенклатура);
	Возврат РазрНоменклатура;
	
КонецФункции
	
&НаКлиенте
Процедура СвязыватьПоКТКПриИзменении(Элемент)
	СопостТЧПриАктивизацииСтроки(неопределено);
КонецПроцедуры

&НаКлиенте
Процедура СвязыватьПоВагонамПриИзменении(Элемент)
	СопостТЧПриАктивизацииСтроки(неопределено);
КонецПроцедуры

&НаКлиенте
Процедура СвязыватьПоТранспДокументамПриИзменении(Элемент)
	СопостТЧПриАктивизацииСтроки(неопределено);
КонецПроцедуры

&НаКлиенте
Процедура СвязыватьПоНоменклатуреПриИзменении(Элемент)
	СопостТЧПриАктивизацииСтроки(неопределено);
КонецПроцедуры

&НаКлиенте
Процедура СвязыватьПоПоставщикамПриИзменении(Элемент)
	СопостТЧПриАктивизацииСтроки(неопределено);
КонецПроцедуры

&НаКлиенте
Процедура СвязыватьПоДоговоруПриИзменении(Элемент)
	СопостТЧПриАктивизацииСтроки(неопределено);
КонецПроцедуры

&НаКлиенте
Процедура СвязатьБезПроверок(Команда)
	
	ТекЛ = Элементы.СопостТЧ.ТекущиеДанные;
	ТекП = Элементы.ТЧ.ТекущиеДанные;
	
	Если ТекЛ = неопределено ИЛИ ТекП = неопределено Тогда
		ПоказатьПредупреждение(, "Выберите строки для связи!");
		Возврат;
	КонецЕсли;
	
	ТекЛ.ИдентификаторСтрокиРасходовВСделке = ТекП.ГУИДРасходов;
	ТекЛ.Сделка = ТекП.Сделка;
	ТекЛ.ПолностьюРазнесено = Истина;
	ТекЛ.Связать = Ложь;
	
	ТекЛ.сопостНоменклатура = ТекП.Услуга;
	ТекЛ.сопостКТК = ТекП.СписокКТК;
	ТекЛ.сопостВагоны = ТекП.СписокВагонов;
	ТекЛ.сопостТД = ТекП.СписокТД;
	ТекЛ.сопостСумма = ТекП.НеРазнесено;
	ТекЛ.сопостСделка = ТекП.Сделка;
	
	ТекП.Связать = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоНепривязанные(Команда)
	
	ПоказыватьТолькоНепривязанныеСтроки = Не ПоказыватьТолькоНепривязанныеСтроки;
	УстановитьОтборТаблицыСопоставления();
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборТаблицыСопоставления()
	
	Элементы.СопостТЧТолькоНепривязанные.Пометка = ПоказыватьТолькоНепривязанныеСтроки;
	
	//Евросиб Каблов 04.02.2021 (
	//Если ПоказыватьТолькоНепривязанныеСтроки Тогда
	//	СтруктураОтбора = Новый Структура("ПолностьюРазнесено", Ложь);
	//Иначе
	//	СтруктураОтбора = Новый Структура();
	//КонецЕсли;
	
	ПроверятьВагоны = ЗначениеЗаполнено(Вагон);
	ПроверятьКонтейнеры = ЗначениеЗаполнено(Контейнер);
	ПроверятьНакладные = ЗначениеЗаполнено(Накладная);
	Для каждого Стр из СопостТЧ Цикл
		
		Если ПроверятьВагоны И Вагоны.НайтиПоЗначению(Стр.Вагон) = Неопределено Тогда
			Стр.ПоказатьВОтборе = Ложь;
			Продолжить;
		КонецЕсли;
		
		Если ПроверятьКонтейнеры И Контейнеры.НайтиПоЗначению(Стр.Контейнер) = Неопределено Тогда
			Стр.ПоказатьВОтборе = Ложь;
			Продолжить;
		КонецЕсли;
		
		Если ПроверятьНакладные И Накладные.НайтиПоЗначению(Стр.ТранспортныйДокумент) = Неопределено Тогда
			Стр.ПоказатьВОтборе = Ложь;
			Продолжить;
		КонецЕсли;
		
		Стр.ПоказатьВОтборе = Истина;
		
	КонецЦикла;
	
	Если ПоказыватьТолькоНепривязанныеСтроки Тогда
		СтруктураОтбора = Новый Структура("ПоказатьВОтборе, Сделка", Истина, ПредопределенноеЗначение("Документ.Сделка.ПустаяСсылка"));
	Иначе
		СтруктураОтбора = Новый Структура("ПоказатьВОтборе", Истина);
	КонецЕсли;
	//Евросиб Каблов 04.02.2021 )
	
	Элементы.СопостТЧ.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура РазбитьСтрокуНаСоставляющие(Команда)
	
	ТекД = Элементы.СопостТЧ.ТекущиеДанные;
	Если ТекД = неопределено ИЛИ ТекД.НоменклатураИмеетНесколькоСопоставлений <> 0 ИЛИ ЗначениеЗаполнено(ТекД.Сделка) Тогда ПоказатьПредупреждение(, "Сначала необходимо выбрать подходящую строку в таблице слева"); Возврат; КонецЕсли;
	
	СопостНоменклатура = ПретензииИНеакцептыСервер.НоменклатуруРазрешеноСопоставлятьС(ТекД.Номенклатура, ТекД.ВесПоНакладной);
	
	ИндексДляВставки = СопостТЧ.Индекс(ТекД);
	
	Для каждого Ном из СопостНоменклатура Цикл
		
		НСтр = СопостТЧ.Вставить(ИндексДляВставки);
		ЗаполнитьЗначенияСвойств(НСтр, ТекД);
		НСтр.Номенклатура = Ном;
		НСтр.ПоступлениеЦена = НСтр.ПоступлениеЦена/2;
		НСтр.ПоступлениеСумма = НСтр.ПоступлениеСумма/2;
		НСтр.НоменклатураИмеетНесколькоСопоставлений = ?(ПретензииИНеакцептыСервер.НоменклатуруРазрешеноСопоставлятьС(НСтр.Номенклатура, НСтр.ВесПоНакладной).Количество() > 1, 0, 1);
		НСтр.ПолностьюРазнесено = ЗначениеЗаполнено(НСтр.Сделка);
		
	КонецЦикла;
	
	СопостТЧ.Удалить(ТекД);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьПоиск(Неопределено);
	
//Евросиб Гудкова( 29.11.2021 Ticket№ 42922
	ОценкаПроизводительностиКлиент.ЗавершитьЗамерВремени(Новый УникальныйИдентификатор(УИДЗамера));
// Евросиб Гудкова)	
	//УстановитьОтборТаблицыСопоставления();
КонецПроцедуры

&НаКлиенте
Процедура ДиагностикаПривязок(Команда)
	
	МассивКТК = Новый Массив;
	Для каждого Стр2 из Элементы.СопостТЧ.ВыделенныеСтроки Цикл
		
		Стр = СопостТЧ.НайтиПоИдентификатору(Стр2);
		Если Стр <> неопределено И Стр.ПолностьюРазнесено =  Ложь Тогда
			МассивКТК.Добавить(Стр.Контейнер);
		КонецЕсли;
		
	КонецЦикла;
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаИсправленияАкцептов", ЭтаФорма);
	ОткрытьФорму("Документ.Акцепт.Форма.ФормаДиагностикиПривязок", Новый Структура("КТКДляАнализа", МассивКТК),,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИсправленияАкцептов(П1 = неопределено, П2 = неопределено) Экспорт
	
	ОбновитьПоиск(неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура excel_ВставкаНомеровНакладных(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВставкиExcel", ЭтаФорма, Новый Структура("ИмяРеквизитаОтбора", "Накладные"));
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("ПередаватьИсходныеНомера, Накладные", Истина, Истина), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура excel_ВставкаНомеровВагонов(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВставкиExcel", ЭтаФорма, Новый Структура("ИмяРеквизитаОтбора", "Вагоны"));
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("ПередаватьИсходныеНомера, Вагоны", Истина, Истина), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура excel_ВставкаНомеровКТК(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВставкиExcel", ЭтаФорма, Новый Структура("ИмяРеквизитаОтбора", "Контейнеры"));
	ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("ПередаватьИсходныеНомера, КТК", Истина, Истина), , ЭтаФорма.УникальныйИдентификатор, ,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВставкиExcel(Список, ДополнительныеПараметры) Экспорт
	
	Если Список <> Неопределено И ДополнительныеПараметры <> неопределено Тогда
		ИмяРеквизитаОтбора = Неопределено;
		Если ДополнительныеПараметры.Свойство("ИмяРеквизитаОтбора", ИмяРеквизитаОтбора) Тогда
			Если ИмяРеквизитаОтбора = "Вагоны" Тогда
				Вагон = СтрСоединить(Список, ";");
				Вагоны.ЗагрузитьЗначения(ПолучитьСписокВагонов(Список));
			ИначеЕсли ИмяРеквизитаОтбора = "Контейнеры" Тогда
				Контейнер = СтрСоединить(Список, ";");
				Контейнеры.ЗагрузитьЗначения(ПолучитьСписокКонтейнеров(Список));
			ИначеЕсли ИмяРеквизитаОтбора = "Накладные" Тогда
				Накладная = СтрСоединить(Список, ";");
				Накладные.ЗагрузитьЗначения(ПолучитьСписокНакладных(Список));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьОтборТаблицыСопоставления();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокВагонов(Номера)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТС.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТС КАК ТС
		|ГДЕ
		|	ТС.Наименование В (&Номера)";
	
	Запрос.УстановитьПараметр("Номера", Номера);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокКонтейнеров(Наименования)
	
	ТаблицаНомеров = Новый ТаблицаЗначений;
	ТаблицаНомеров.Колонки.Добавить("Префикс", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(4, ДопустимаяДлина.Переменная)));
	ТаблицаНомеров.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(6, ДопустимаяДлина.Переменная)));
	ТаблицаНомеров.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(11, ДопустимаяДлина.Переменная)));
	
	Для каждого Наименование Из Наименования Цикл	
		СтрокаТаблицы = ТаблицаНомеров.Добавить();
		СтрокаТаблицы.Префикс = Лев(ВРег(Наименование), 4);
		СтрокаТаблицы.Номер = Сред(Наименование, 5, 6);
		СтрокаТаблицы.Наименование = Наименование;
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаНомеров.Префикс КАК Префикс,
		|	ТаблицаНомеров.Номер КАК Номер
		|ПОМЕСТИТЬ ВТНомера
		|ИЗ
		|	&ТаблицаНомеров КАК ТаблицаНомеров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЕ.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТЕ КАК ТЕ
		|ГДЕ
		|	(ТЕ.Префикс, ТЕ.Номер) В
		|			(ВЫБРАТЬ
		|				ВТНомера.Префикс КАК Префикс,
		|				ВТНомера.Номер КАК Номер
		|			ИЗ
		|				ВТНомера КАК ВТНомера)";
	
	Запрос.УстановитьПараметр("ТаблицаНомеров", ТаблицаНомеров);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокНакладных(Номера)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТранспортныйДокумент.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ТранспортныйДокумент КАК ТранспортныйДокумент
		|ГДЕ
		|	ТранспортныйДокумент.НомерТранспортногоДокумента В(&Номера)
		|	И ТранспортныйДокумент.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийТранспортныхДокументов.ЖДНакладная)";
	
	Запрос.УстановитьПараметр("Номера", Номера);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
Процедура НакладнаяПриИзменении(Элемент)
	
	Накладная = СокрЛП(Накладная);
	Если ЗначениеЗаполнено(Накладная) Тогда
		Список = СтрРазделить(Накладная, ";", Ложь);
		Накладные.ЗагрузитьЗначения(ПолучитьСписокНакладных(Список));
	Иначе
		Накладные.Очистить();
	КонецЕсли;
	
	УстановитьОтборТаблицыСопоставления();
	
КонецПроцедуры

&НаКлиенте
Процедура ВагонПриИзменении(Элемент)
	
	Вагон = СокрЛП(Вагон);
	Если ЗначениеЗаполнено(Вагон) Тогда
		Список = СтрРазделить(Вагон, ";", Ложь);
		Вагоны.ЗагрузитьЗначения(ПолучитьСписокВагонов(Список));
	Иначе
		Вагоны.Очистить();
	КонецЕсли;
	
	УстановитьОтборТаблицыСопоставления();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерПриИзменении(Элемент)
	
	Контейнер = СокрЛП(Контейнер);
	Если ЗначениеЗаполнено(Контейнер) Тогда
		Список = СтрРазделить(Контейнер, ";", Ложь);
		Контейнеры.ЗагрузитьЗначения(ПолучитьСписокКонтейнеров(Список));
	Иначе
		Контейнеры.Очистить();
	КонецЕсли;
	
	УстановитьОтборТаблицыСопоставления();
	
КонецПроцедуры

//Евросиб - АСуслов 08.09.2022 11:43:15 #56540
//(
&НаКлиенте
Процедура СопостТЧПриИзменении(Элемент)
	ПересчитатьОтборВыделеннойСтроки();
КонецПроцедуры

&НаКлиенте
Процедура СвязыватьПоПериодуОказанияУслугиПриИзменении(Элемент)
	СопостТЧПриИзменении(Неопределено);
КонецПроцедуры
//)
//Евросиб - АСуслов 08.09.2022 11:43:27 #56540
