&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Этаформа.Заголовок = Параметры.Заголовок;
	
	Если Параметры.Список.Количество() > 0 Тогда
		//Евросиб Коханенко Н.А. 09.04.2024 (( #83236
		//было:
		//Для Каждого Элемент ИЗ Параметры.Список Цикл
		//	Строка = Таблица.Добавить();
		//	Строка.Ссылка = Элемент.Значение;
		//стало:
		Для Каждого ЭлементСтруктуры Из Параметры.Список[0].Значение Цикл 
			Если ЭлементСтруктуры.Ключ = "Ссылка" Тогда
				Продолжить;
			КонецЕсли;
			//добавляем реквизит в Таблицу
			нРеквизиты = Новый Массив;
 			нРеквизиты.Добавить(Новый РеквизитФормы(ЭлементСтруктуры.Ключ, 
													Новый ОписаниеТипов(ОбщегоНазначения.СтроковоеПредставлениеТипа(ТипЗнч(ЭлементСтруктуры.Значение))), 
													"Таблица", 
													ЭлементСтруктуры.Ключ, Истина));
 			ИзменитьРеквизиты(нРеквизиты);
			//добавляем колонку в ТЧ формы
			нЭлемент = Элементы.Добавить("Таблица" + ЭлементСтруктуры.Ключ, Тип("ПолеФормы"), Элементы.Таблица); 
 			нЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
			нЭлемент.ТолькоПросмотр = Истина;
 			нЭлемент.ПутьКДанным = "Таблица." + ЭлементСтруктуры.Ключ;
		КонецЦикла;
		Для Каждого Элемент ИЗ Параметры.Список Цикл
			Строка = Таблица.Добавить();
			Для Каждого ЭлементСтруктуры Из Параметры.Список[0].Значение Цикл 
				Строка[ЭлементСтруктуры.Ключ] = Элемент.Значение[ЭлементСтруктуры.Ключ];
			КонецЦикла;
		//Евросиб Коханенко Н.А. 09.04.2024 )) #83236 
			// ДИТ Поморцева Т.П. Задача 37207 27.09.21. начало 
			Строка.КлючСтроки = Элемент.Представление;
			// ДИТ Поморцева Т.П. Задача 37207 27.09.21. конец
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	СписокВыбора = Новый СписокЗначений;
	Для Каждого Строка ИЗ Таблица Цикл
		Если Строка.Выбор Тогда
			СписокВыбора.Добавить(Строка.Ссылка,Строка(Строка.КлючСтроки));
			СписокВыбора.ЗаполнитьПометки(Истина);
		КонецЕсли;
	КонецЦикла;	
	ЭтаФорма.Закрыть(СписокВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	ИзменитьОтметку(Истина);		
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	ИзменитьОтметку(Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОтметку(Выбрать)
	Для Каждого Строка ИЗ Таблица Цикл
		Строка.Выбор = Выбрать;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УпорядочитьПо(Команда)
	Таблица.Сортировать("Ссылка");
КонецПроцедуры 