
#Область ОписаниеПеременных

&НаКлиенте
Перем ИдентификаторКопируемойСтрокиУслуг;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СНПКонтейнеровШтраф = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор, "СНПКонтейнеровШтраф");
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		//Евросиб Каблов 19.02.2025 ( #101080
		ЗаполнитьСтавкуНДСВСрокахУслугСНПКонтейнеров();
		//Евросиб Каблов 19.02.2025 )
	КонецЕсли;
	
	//Евросиб Коханенко Н.А. 29.04.2025 (( #102319 
	//ОбновитьБлокировкуЭлементов();
	//Евросиб Коханенко Н.А. 29.04.2025 )) #102319 
	
	Если НЕ Пользователи.РолиДоступны("ПолныеПрава",, Ложь) Тогда
		РазрешитьРедактированиеСостояния = Пользователи.РолиДоступны("dc_РазрешитьРедактированиеСостоянияПСЦПоставщика",, Ложь);
		РегистрыСведений.СостоянияДокументов.УстановитьДоступностьТаблицыСостояния(Элементы.ГруппаСостояния, "Состояния", "СостоянияИсполнитель", РазрешитьРедактированиеСостояния);
	КонецЕсли;
	
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	
	//Евросиб Коханенко Н.А. 29.04.2025 (( #102319 
	ОбновитьБлокировкуЭлементов();
	//Евросиб Коханенко Н.А. 29.04.2025 )) #102319 
	
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	
	Элементы.ГруппаВкладкаДетализацияКомплекснойСтавки.Видимость = Ложь;
	Элементы.ГруппаВкладкаДетализацияПоУчетнымЕдиницам.Видимость = Ложь;
	Элементы.СписокУчетныхЕдиницУчетнаяЕдиницаСсылка.Заголовок = "Учетная единица";
	
	Если ПараметрыВидаУслуг = Неопределено Тогда
		НастроитьКолонкиТаблицыУслугПоВидуУслугПоставщика();
		ОбновитьДинамическиеПоляТаблицыУслуг(, Истина);
		ОбновитьГруппуПротоколовНормативныхСтавок();
		УстановитьВидимостьГруппПоНормативам();
		УстановитьВидимостьГруппыПоЗначениюПоля(Объект.Услуги, Элементы.УслугиГруппаОпасностьГруза, "ОпасныйСпецГруз");
		УстановитьВидимостьГруппыПоЗначениюПоля(Объект.Услуги, Элементы.УслугиОсобыйТемпературныйРежимЗначение, "ОсобыйТемпературныйРежим");
		ЗаполнитьСписокВыбораВалютыОплаты();
		УстановитьДоступностьПризнакаТиповой();
	КонецЕсли;
	
	ЗаполнятьНормативы = ПараметрыВидаУслуг.ЗаполнятьНормативы;
	
	УстановитьЗаголовокГруппыСторонаОрганизации();
	
	Элементы.ОкончаниеДействия.АвтоОтметкаНезаполненного = Не Объект.ДействуетДоСогласованияНовыхУсловий;
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Элементы.РуководительКонтрагента.СписокВыбора.ЗагрузитьЗначения(ПолучитьВсехРуководителейКонтрагента(Объект.Контрагент));
	КонецЕсли;
	
	Если Объект.КатегорияУслуг = ПредопределенноеЗначение("Справочник.КатегорииУслуг.ПерваяПоследняяМиля") Тогда
		Элементы.МестоОказанияУслуг.Видимость = Истина;
	Иначе
		Элементы.МестоОказанияУслуг.Видимость = Ложь;
	КонецЕсли;
	
	//ДоговорТиповой = ПолучитьЗначениеРеквизитТиповойДоговор(Объект.Договор);
	//Элементы.Типовой.Доступность = ДоговорТиповой;
	Элементы.МакетПечатнойФормыПротокола.Видимость = Объект.Типовой;	
	УстановитьВидимостьДобавленияРуководителя();
	Элементы.ДоверенностьЗаРуководителя.ТолькоПросмотр = Не Объект.ДоверенностьУказываетсяВручную;
	
	Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Контейнеры Тогда
		Элементы.ВидПеревозки.Видимость = Истина;
		//Евросиб Коханенко Н.А. 09.06.2025 (( #109338 
		Элементы.ФорматПротокола.Доступность = Ложь;
		Объект.ФорматПротокола = Неопределено; 
		//Евросиб Коханенко Н.А. 09.06.2025 )) #109338 
	Иначе
		Элементы.ВидПеревозки.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.СтавкаНДС.ТолькоПросмотр = ЗначениеЗаполнено(Объект.ВидПеревозки);
	
	//Евросиб Коханенко Н.А. 27.03.2025 (( #102319
	УстановитьВидимостьКомандПечати();
	//Евросиб Коханенко Н.А. 27.03.2025 )) #102319 
	
	УстановитьВидимостьКлиентЕвросиба(); //Евросиб Шевченко А.В. US 112958 TA 112963 01.07.2025
	
	ЭтоПолноправныйПользователь = РольДоступна("ПолныеПрава");
	
	//Евросиб Шевченко А.В. BUG 131579 TA 132300 17.03.2026
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Если Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
			Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22");
			СоответствиеРеквизитовНоменклатуры = ПолучитьЗначенияРеквизитовНоменклатурыУслуг();
			Для Каждого СтрокаТЧ Из Объект.Услуги Цикл
				РеквизитыНоменклатуры = СоответствиеРеквизитовНоменклатуры.Получить(СтрокаТЧ.Номенклатура);
				Если ЗначениеЗаполнено(РеквизитыНоменклатуры) Тогда
					СтавкаНДСПоставщика = РеквизитыНоменклатуры.СтавкаНДСПоставщика;
				Иначе
					СтавкаНДСПоставщика = Неопределено;
				КонецЕсли;
				Если СтрокаТЧ.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
					СтрокаТЧ.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка");   
				КонецЕсли;
				ЗаполнитьСтавкуНДСВСтрокеУслуг(СтрокаТЧ, СтавкаНДСПоставщика);
				ПересчитатьСтоимостьСУчетомСтавкиНДС(СтрокаТЧ);
			КонецЦикла;	
		КонецЕсли;	
		ЗаполнитьСтавкиНДС();
	КонецЕсли;	
	//Евросиб Шевченко А.В. BUG 131579 TA 132300 17.03.2026
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДобавленияРуководителя()
	
	КонтрагентРезидент = Ложь;
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		СтранаРегистрации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Контрагент, "СтранаРегистрации");
		Если СтранаРегистрации = Справочники.СтраныМира.Россия Тогда
			КонтрагентРезидент = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ДобавитьРуководителяКонтрагента.Видимость = Не КонтрагентРезидент;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеРеквизитТиповойДоговор(Договор)
	
	Если ЗначениеЗаполнено(Договор) Тогда
		ДоговорТиповой = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "Типовой");
	Иначе
		ДоговорТиповой = Ложь;
	КонецЕсли;
	
	Возврат ДоговорТиповой;
	
КонецФункции

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, ТекущийОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СНПКонтейнеровШтраф = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор, "СНПКонтейнеровШтраф");
	
	НастроитьКолонкиТаблицыУслугПоВидуУслугПоставщика();
	ОбновитьДинамическиеПоляТаблицыУслуг(, Истина);
	ОбновитьГруппуПротоколовНормативныхСтавок();
	УстановитьВидимостьГруппПоНормативам();
	УстановитьВидимостьГруппыПоЗначениюПоля(Объект.Услуги, Элементы.УслугиГруппаОпасностьГруза, "ОпасныйСпецГруз");
	УстановитьВидимостьГруппыПоЗначениюПоля(Объект.Услуги, Элементы.УслугиОсобыйТемпературныйРежимЗначение, "ОсобыйТемпературныйРежим");
	ЗаполнитьСписокВыбораВалютыОплаты();	
	УстановитьДоступностьПризнакаТиповой();
	
	Элементы.СсылкаНаПротоколВДО.Видимость = ЗначениеЗаполнено(Объект.СсылкаНаВнутреннийДокументДО);  
	Если ПроверкаГруппыДоступа("Менеджер сопровождения") и ЗначениеЗаполнено(Объект.СсылкаНаВнутреннийДокументДО) Тогда
		Элементы.ПередатьПСЦВДО.Видимость = Истина;	
	КонецЕсли;
	
	Если Объект.КатегорияУслуг = ПредопределенноеЗначение("Справочник.КатегорииУслуг.ПерваяПоследняяМиля") Тогда
		Элементы.МестоОказанияУслуг.Видимость = Истина;
	Иначе
		Элементы.МестоОказанияУслуг.Видимость = Ложь;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
	Элементы.ДатаПереводаВСтатусПодписан.Доступность = Объект.ПодписанСДвухСторон;
	
	ЗаполнитьПолеСрокДействияДоверенностиНаПодписантаКонтрагента();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ТребуетсяПеречитатьУказанныйДокумент" И Параметр = Объект.Ссылка Тогда
		ЭтаФорма.Прочитать();
		ОбновитьПанельТекущегоПользователя();
		ОбновитьПанельСостояний();
	ИначеЕсли ИмяСобытия = "СозданРуководительКонтрагента" Тогда
		Объект.РуководительКонтрагента = Параметр;
		Элементы.РуководительКонтрагента.СписокВыбора.ЗагрузитьЗначения(ПолучитьВсехРуководителейКонтрагента(Объект.Контрагент));
	ИначеЕсли ИмяСобытия = "СозданПодписантКонтрагента" Тогда
		ЗаполнитьДанныеПодписантаКонтрагента(Параметр);
		Модифицированность = Истина;
	//Евросиб Коханенко Н.А. 28.03.2025 (( #102319 
	ИначеЕсли ИмяСобытия = "СписокПрисоединенныхФайловПСЦПоставщикаИзменен" 
		И Параметр.ВладелецФайлов = Объект.Ссылка Тогда
    	//произошло сохранение ПФ ПСЦ Поставшика в PDF формате и сохранение в Присоединенных файлах 
		//п.1.3 - блокируем все поля кроме разрешенных из списка
		ОбновитьБлокировкуЭлементов();
		//ЗаблокироватьПоляФормы();
	//Евросиб Коханенко Н.А. 28.03.2025 )) #102319
	//Евросиб Шевченко А.В. US 110215 TA 122847 10.11.2025
	ИначеЕсли ИмяСобытия = "Запись_Файл" Тогда
		
		ТекущийИсполнитель_Статус = "";
		ТекущийИсполнитель_Состояние = "";
		ТекущийИсполнитель_Исполнитель = "";
		ТекущийИсполнитель_Наблюдатель = "";
	
		ЭтаФорма.Прочитать();
		ОбновитьПанельСостояний();
		ОбновитьПанельТекущегоПользователя();
		
		ПроверитьЗадачуПроверкаСогласования();
		
	//Евросиб Шевченко А.В. US 110215 TA 122847 10.11.2025	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗадачуПроверкаСогласования() //Евросиб Шевченко А.В. US 110215 TA 122847 10.11.2025
	
	СтрокаСостояния = Объект.Состояния.НайтиСтроки(Новый Структура("Состояние", Справочники.Состояния.ПроверкаСогласованияОтправкаПодкреплениеПодписанногоПСЦ));
	Если СтрокаСостояния.Количество() <> 0 Тогда
		НС = СтрокаСостояния[0];
	Иначе
		НС = Объект.Состояния.Добавить();	
	КонецЕсли;
	
	Если НС.Статус = Перечисления.СтатусыЭтапов.Выполнен Тогда
		
		Если НЕ ЕстьСканКопияВПрисоедененныхФайлах(Объект.Ссылка) Тогда
			НС.Исполнитель = Объект.Автор;
			Если Объект.Состояния.Количество() Тогда
				НС.Наблюдатель = Объект.Автор;
			КонецЕсли;
			НС.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
			НС.Состояние = Справочники.Состояния.ПроверкаСогласованияОтправкаПодкреплениеПодписанногоПСЦ; 
			НС.НачалоРаботы = ТекущаяДата();
			ЭтотОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Евросиб US 89887 TA 89889 Рыбьяков К.А. 21.11.2024 ((
	Если ОбщегоНазначенияВызовСервера.ЕстьРелизСобственника(Объект.Ссылка) И НЕ Объект.Типовой Тогда
		Текст = НСтр("ru = 'На основании протокола созданы релизы собственника, нельзя изменить тип протокола.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(Текст,,,, Отказ);
		ЭтаФорма.Прочитать();
	Иначе
		ПроверитьНеобходимостьИзмененийСозданныхРелизов(Отказ, ПараметрыЗаписи);
	КонецЕсли;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 21.11.2024 ))
	
	ПередЗаписьюСервер();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Евросиб Трундуков СА # 119893 22.09.2025 Проверка перенесена в модуль объекта
	//Если ЗначениеЗаполнено(ТекущийОбъект.НомерПСЦ) Тогда
	//	НомерПСЦУникален = Документы.ПСЦПоставщика.ПроверитьУникальностьНомераПСЦ(ТекущийОбъект);
	//	Если Не НомерПСЦУникален Тогда
	//		ОбщегоНазначения.СообщитьПользователю("Уже есть проведенный ПСЦ поставщика с таким Номером ПСЦ!",, "НомерПСЦ", "Объект", Отказ);
	//	КонецЕсли;
	//КонецЕсли;
	
	// если документ НЕ типовой, то, если изменился статус состояния (перешел в "Выполнено"), то проверить, что есть прикрепленные файлы.
	// если файлов нет, то запретить сохранение со статусом "Выполнено".
	// проверяем текущее состояние. если оно предшествует состоянию с флагом Согласование, то проверяем смену статуса.
	Для ШагЦикла = 0 По Объект.Состояния.Количество()-1 Цикл
		ТекСтрока = Объект.Состояния[ШагЦикла];
		Если ШагЦикла < Объект.Состояния.Количество()-1 Тогда
			СледСтрока = Объект.Состояния[ШагЦикла+1];
		Иначе 
			СледСтрока = Неопределено;
		КонецЕсли;
		
		Если ТекСтрока.Состояние = Объект.ТекущееСостояние И ТекСтрока.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен") Тогда
			Если СледСтрока <> неопределено И ЭтоСогласование(СледСтрока.Состояние) Тогда
				Если Не Объект.Типовой И НЕ ПроверкаНаПрикрепленные(Объект.Ссылка) Тогда
					ОбщегоНазначения.СообщитьПользователю("Протокол является нетиповым! Прикрепите файлы! Невозможна установка статуса ""Выполнено"" для состояния """ + ТекСтрока.Состояние + """",,,, Отказ);
				КонецЕсли;
			Иначе
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	СогласованиеСервер.ОбработатьОтменуСогласованияДокументаПередЗаписью(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	//ОбновитьБлокировкуЭлементов();
	
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	
	//ОбновитьПредставлениеУчетныхЕдиницСтрокУслуг();
	ОбновитьДинамическиеПоляТаблицыУслуг(, Истина);
	ОбновитьГруппуПротоколовНормативныхСтавок();
	
	Элементы.СсылкаНаПротоколВДО.Видимость = ЗначениеЗаполнено(Объект.СсылкаНаВнутреннийДокументДО);  
	Если ПроверкаГруппыДоступа("Менеджер сопровождения") и ЗначениеЗаполнено(Объект.СсылкаНаВнутреннийДокументДО) Тогда
		Элементы.ПередатьПСЦВДО.Видимость = Истина;	
	КонецЕсли;
	
	Элементы.ДатаПереводаВСтатусПодписан.Доступность = Объект.ПодписанСДвухСторон;
	
	// Евросиб US 89887 TA 89889 Рыбьяков К.А. 18.11.2024 ((
	Документы.РелизСобственника.ЗаполнитьРелизСобственникаНаОснованииПСЦПоставщика(Объект.Ссылка, ?(ПараметрыЗаписи.Свойство("ВопросУжеБылЗадан"), Истина, Ложь));
	// Евросиб Рыбьяков К.А. 18.11.2024 ))
	
	//Евросиб Шевченко А.В. US 112958 TA 112962 07.07.2025
	УстановитьВидимостьКомандПечати();
	//Евросиб Шевченко А.В. US 112958 TA 112962 07.07.2025
	
	//Евросиб Ситников К.А. 09.07.2025 Task 113813
	ОбновитьБлокировкуЭлементов();
	//Евросиб Ситников К.А. 09.07.2025 Task 113813
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УстановитьЗаголовокГруппыСторонаОрганизации();
	
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииСервер()
	
	Документы.ПСЦПоставщика.ЗаполнитьРеквизитыИзДоговора(Объект, Объект.Договор);
	
	ЗаполнитьСписокВыбораВалютыОплаты();
	
	СНПКонтейнеровШтраф = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор, "СНПКонтейнеровШтраф");
	
	ЗаполнитьСтавкиНДС(); //Евросиб Шевченко А.В. BUG 131579 TA 132300 17.03.2026
	
	ЗаполнитьСтавкуНДСВСрокахУслугСНПКонтейнеров();
	ПроверитьИУстановитьПризнакТиповой();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтавкуНДСВСрокахУслугСНПКонтейнеров()
	
	СНПКонтейнеров = Справочники.Номенклатура.СНПКонтейнеров;
	СтрокиСНПКонтейнеров = Объект.Услуги.НайтиСтроки(Новый Структура("Номенклатура", СНПКонтейнеров));
	Если ЗначениеЗаполнено(СтрокиСНПКонтейнеров) Тогда
		БезНДС = Перечисления.СтавкиНДС.БезНДС;
		Для Каждого СтрокаТЧ Из СтрокиСНПКонтейнеров Цикл
			Если СНПКонтейнеровШтраф Тогда
				СтрокаТЧ.СтавкаНДС = БезНДС;
			Иначе
				СтрокаТЧ.СтавкаНДС = Объект.СтавкаНДС;
			КонецЕсли;
			ПересчитатьСтоимостьСУчетомСтавкиНДС(СтрокаТЧ);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ДоговорПриИзмененииСервер(); 
	
	//Евросиб Коханенко Н.А. 27.03.2025 (( #102319
	УстановитьВидимостьКомандПечати();
	//Евросиб Коханенко Н.А. 27.03.2025 )) #102319 

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораВалютыОплаты()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДоговорыКонтрагентов1.ВалютаВзаиморасчетов КАК Валюта
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.ДоговорыОплаты КАК ДоговорыКонтрагентовДоговорыОплаты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов1
	|			ПО ДоговорыКонтрагентовДоговорыОплаты.Договор = ДоговорыКонтрагентов1.Ссылка
	|		ПО ДоговорыКонтрагентов.Ссылка = ДоговорыКонтрагентовДоговорыОплаты.Ссылка
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка = &Договор
	|	И ДоговорыКонтрагентов.МультивалютныйДоговор";
	
	Запрос.УстановитьПараметр("Договор", Объект.Договор);
	
	Валюты = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Валюта");
	
	ЭлементВалютаОплаты = Элементы.ВалютаОплаты;
	ПараметрыВыбораВалюты = Новый Массив;
	ПараметрыВыбораВалюты.Добавить(Новый ПараметрВыбора("Отбор.ОсновнаяВалюта", Справочники.Валюты.ПустаяСсылка()));
	Если ЗначениеЗаполнено(Валюты) Тогда
		ПараметрыВыбораВалюты.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(Валюты)));
	КонецЕсли;
	ЭлементВалютаОплаты.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораВалюты);
	
КонецПроцедуры

&НаКлиенте
Процедура ДействуетДоСогласованияНовыхУсловийПриИзменении(Элемент)
	
	Элементы.ОкончаниеДействия.АвтоОтметкаНезаполненного = Не Объект.ДействуетДоСогласованияНовыхУсловий;
	Если Не Элементы.ОкончаниеДействия.АвтоОтметкаНезаполненного Тогда
		Элементы.ОкончаниеДействия.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
	Если Объект.ДействуетДоСогласованияНовыхУсловий И ЗначениеЗаполнено(Объект.ОкончаниеДействия) Тогда
		ПустаяДата = '00010101';
		Объект.ОкончаниеДействия = ПустаяДата;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРуководителяКонтрагента(Команда)
	
	ОткрытьФорму("РегистрСведений.ДанныеРуководителяКонтрагентов.ФормаЗаписи", Новый Структура("ВызывающаяФорма, Контрагент", ЭтаФорма.УникальныйИдентификатор, Объект.Контрагент),,ЭтаФорма.УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПодписантаКонтрагента(Команда)
	
	ПараметрыФормы = Новый Структура("ВызывающаяФорма, Контрагент", ЭтаФорма.УникальныйИдентификатор, Объект.Контрагент);
	ОткрытьФорму("РегистрСведений.ДанныеПодписантовКонтрагентов.ФормаЗаписи", ПараметрыФормы, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьИсполнителя(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) тогда
		ПоказатьПредупреждение(, "Сначала необходимо сохранить Протокол");
		Возврат;
	КонецЕсли;
	
	ИсходныйПользователь = неопределено;
	Для каждого Стр из Объект.Состояния Цикл
		Если Стр.Состояние = ПредопределенноеЗначение("Справочник.Состояния.ПроверкаРезультатовСогласования") Тогда ИсходныйПользователь = Стр.Исполнитель; КонецЕсли;
	КонецЦикла;
	
	ОпОп = Новый ОписаниеОповещения("ОбработкаВыбораЗаменыСогласующего", ЭтаФорма);
	
	ОткрытьФорму("Документ.ПСЦ.Форма.ФормаЗаменыИсполнителяВПротоколе", Новый Структура("ИсходныйПользователь", ИсходныйПользователь),,ЭтаФорма.УникальныйИдентификатор,,, ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораЗаменыСогласующего(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 = неопределено Тогда Возврат; КонецЕсли;
	
	ИсхП = П1.ИсходныйПользователь;
	КонП = П1.КонечныйПользователь;
	
	ЗаменятьИсполнителя = П1.ЗаменятьИсполнителя;
	ЗаменятьНаблюдателя = П1.ЗаменятьНаблюдателя;
	
	ЗаменяемыеСтатусы = П1.ЗаменяемыеСтатусы;
	
	Для каждого Стр из Объект.Состояния Цикл
		
		Если ЗаменяемыеСтатусы.Найти(Стр.Статус) <> неопределено Тогда
			Если Стр.Исполнитель = ИсхП И ЗаменятьИсполнителя Тогда Стр.Исполнитель = КонП; КонецЕсли;
			Если Стр.Наблюдатель = ИсхП И ЗаменятьНаблюдателя Тогда Стр.Наблюдатель = КонП; КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ТакжеЗаменитьВКарточкеСогласования(П1, Объект.Ссылка);
	
	ОбновитьПанельСостояний();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТакжеЗаменитьВКарточкеСогласования(П1, Ссылка)
	
	ТекПроцессСогл = ПечатьБухгалтерскихДокументов.ПроверитьНаличиеПроцесса(Ссылка);
	Если НЕ ЗначениеЗаполнено(ТекПроцессСогл) Тогда Возврат; КонецЕсли;
	
	ПроцессО = ТекПроцессСогл.ПолучитьОбъект();
	
	ИсхП = П1.ИсходныйПользователь;
	КонП = П1.КонечныйПользователь;
	
	ЗаменятьИсполнителя = П1.ЗаменятьИсполнителя;
	ЗаменятьНаблюдателя = П1.ЗаменятьНаблюдателя;
	
	ЗаменяемыеСтатусы = П1.ЗаменяемыеСтатусы;
	
	Для каждого Стр из ПроцессО.Состояния Цикл
		
		Если ЗаменяемыеСтатусы.Найти(Стр.Статус) <> неопределено Тогда
			Если Стр.Исполнитель = ИсхП И ЗаменятьИсполнителя Тогда Стр.Исполнитель = КонП; КонецЕсли;
			Если Стр.Наблюдатель = ИсхП И ЗаменятьНаблюдателя Тогда Стр.Наблюдатель = КонП; КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ПроцессО.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьНаСогласование(Команда)
	
	Если ЭтаФорма.Модифицированность Тогда 
		Записать(); 
	КонецЕсли;
		  
	ЕстьСогласованиеВСтатусеОтличнымОтПланируется = Ложь;
	
	ДанныеЕсть = Ложь;
	Для Каждого Стр Из объект.Состояния Цикл
		Если ЭтоСогласование(Стр.Состояние) Тогда
			ДанныеЕсть = Истина;
	
			Если Стр.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Новый") Тогда
				ЕстьСогласованиеВСтатусеОтличнымОтПланируется = Истина;
			КонецЕсли;
	
		КонецЕсли;
	КонецЦикла;
	Если ДанныеЕсть = Ложь Тогда
		Сообщить("В таблице Состояния нет ни одного согласования!");
		Возврат;
	КонецЕсли;
    
	Если Не ЕстьСогласованиеВСтатусеОтличнымОтПланируется Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ПСЦ не передан на согласование, необходимо выполнить предшествующие этапы");
		Возврат;
	КонецЕсли;
	
	Если Не Объект.Типовой И НЕ ПроверкаНаПрикрепленные(Объект.Ссылка) Тогда
		Сообщить("Протокол является нетиповым! Прикрепите файлы!");
		Возврат;
	КонецЕсли;

	ОповещениеОСогласовании = Новый ОписаниеОповещения("ОбработкаСогласования", ЭтаФорма);
	
	ТекПроцессСогл = ПечатьБухгалтерскихДокументов.ПроверитьНаличиеПроцесса(Объект.Ссылка);
	Если ТекПроцессСогл = ПредопределенноеЗначение("Справочник.ПроцессСогласования.ПустаяСсылка") Тогда
		ПараметрыФормы = Новый Структура("ДокументСогласования", Объект.Ссылка);
		ЗначенияЗаполнения = Новый Структура("ДокументСогласования", Объект.Ссылка);
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	Иначе
		ПараметрыФормы = Новый Структура("Ключ", ТекПроцессСогл);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ПроцессСогласования.ФормаОбъекта", ПараметрыФормы,ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,ОповещениеОСогласовании, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСогласования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	ЭтаФорма.ОбновитьОтображениеДанных();
	ОбновитьБлокировкуЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтозватьСогласование(Команда)

	// Евросиб US 89887 TA 89889 Рыбьяков К.А. 18.11.2024 ((
	ЕстьСозданныеНаОснованииРелизы = ОбщегоНазначенияВызовСервера.НаОснованииДокументаСозданыРелизы(Объект.Ссылка);
	Если ЕстьСозданныеНаОснованииРелизы Тогда
		ТекстСообщения = НСтр("ru = 'К ПСЦ есть Релиз собственника, требуется отменить его проведение.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 18.11.2024 ))
	
	ОпОп = Новый ОписаниеОповещения("ОтменаСогласования", ЭтаФорма);
	ПоказатьВопрос(ОпОп, "Протокол будет возвращен на этап ввода, а информация о результатах согласования стерта. Продолжить?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменаСогласования(П1 = неопределено, П2 = неопределено) Экспорт
	
	Если П1 <> КодВозвратаДиалога.Да Тогда Возврат; КонецЕсли;  
	
	ПараметрыЗапроса = ПолучитьПараметрыМаршрутизацииНаСервере(Объект);
	РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьПСЦ(ПараметрыЗапроса, объект.Дата); 
	
	Для Каждого Стр Из РезультатЗапроса Цикл  
		Если Не ЗначениеЗаполнено(Стр.Исполнитель) Тогда
			Продолжить;
		КонецЕсли;
		Отбор = Новый Структура("Состояние", Стр.Состояние);
		НайденныеСтроки = Объект.Состояния.НайтиСтроки(Отбор);
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл 
			НайденнаяСтрока.Исполнитель = Стр.Исполнитель;
		КонецЦикла;
	КонецЦикла;
	
	Оповещение = Новый ОписаниеОповещения("ОтменаСогласованияПродолжение", ЭтаФорма);	
	ОткрытьФорму("ОбщаяФорма.ОтзывСогласования",, ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтрокиСогласования()
	
	ПоляСтрокиСогласования = "Состояние, Исполнитель, Наблюдатель, НомерСтроки, Статус";
	ОтзываемыеСогласования = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Состояния.НомерСтроки КАК НомерСтроки,
	|	Состояния.Состояние КАК Состояние,
	|	Состояния.Исполнитель КАК Исполнитель,
	|	Состояния.Наблюдатель КАК Наблюдатель,
	|	Состояния.Статус КАК Статус
	|ПОМЕСТИТЬ Состояния
	|ИЗ
	|	&Состояния КАК Состояния
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Состояния.НомерСтроки КАК НомерСтроки,
	|	Состояния.Состояние КАК Состояние,
	|	Состояния.Исполнитель КАК Исполнитель,
	|	Состояния.Наблюдатель КАК Наблюдатель,
	|	Состояния.Статус КАК Статус
	|ИЗ
	|	Состояния КАК Состояния
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Состояния КАК Состояния1
	|		ПО Состояния.Состояние = Состояния1.Ссылка
	|ГДЕ
	|	Состояния1.Согласование
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Состояния", Объект.Состояния.Выгрузить());
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		Согласование = Новый Структура(ПоляСтрокиСогласования);
		ЗаполнитьЗначенияСвойств(Согласование, Выборка);
		ОтзываемыеСогласования.Добавить(Согласование);
	КонецЦикла;
	
	Возврат ОтзываемыеСогласования;
	
КонецФункции

&НаКлиенте
Процедура ОтменаСогласованияПродолжение(Комментарий, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Комментарий) Тогда		
		Возврат;
	КонецЕсли;  
	
	ПараметрыЗапроса = ПолучитьПараметрыМаршрутизацииНаСервере(Объект);
	РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьПСЦПоставщика(ПараметрыЗапроса, объект.Дата); 
	
	Для Каждого Стр Из РезультатЗапроса Цикл  
		
		Если Не ЗначениеЗаполнено(Стр.Исполнитель) Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура("Состояние", Стр.Состояние);
		НайденныеСтроки = Объект.Состояния.НайтиСтроки(Отбор);
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл 
			НайденнаяСтрока.Исполнитель = Стр.Исполнитель;
		КонецЦикла;
		
	КонецЦикла;
	
	ВозвращаемыеЗадачи = Новый Массив;
	Если Объект.Состояния.Количество() > 0 Тогда
		СтрСостояния = Объект.Состояния[0];
		СтрСостояния.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.ВРаботе");
		СтрСостояния.ВыполнениеЗафиксировано = Ложь;
		ВозвращаемыеЗадачи.Добавить(СтрСостояния.Состояние);
	КонецЕсли;
	
	Для Сч = 1 По Объект.Состояния.Количество()-1 Цикл
		
		Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Новый");
		Если ЗначениеЗаполнено(Объект.Состояния[Сч].СтатусСогласования) Тогда
			Объект.Состояния[Сч].СтатусСогласования = ПредопределенноеЗначение("Перечисление.СтатусыСогласования.Планируется");
			//Объект.Состояния[Сч].Комментарий = Комментарий;
			Объект.Состояния[Сч].АвтоматическоеСогласование = Ложь;
		КонецЕсли;
		
		Объект.Состояния[Сч].ВыполнениеЗафиксировано = Ложь;
		ВозвращаемыеЗадачи.Добавить(Объект.Состояния[Сч].Состояние);
		
	КонецЦикла;
	
	Объект.ДатаСогласования=Дата(1,1,1);	
	Объект.ПодписанСДвухСторон = Ложь;
	
	ПараметрыОтменыСогласования = Новый Структура;
	ПараметрыОтменыСогласования.Вставить("ВозвращаемыеЗадачи", ВозвращаемыеЗадачи);
	ПараметрыОтменыСогласования.Вставить("Комментарий", Комментарий);	
	ЗаписатьОтменуСогласования(ПараметрыОтменыСогласования);
	
	ОбновитьПанельТекущегоПользователя();
	ОбновитьПанельСостояний();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОтменуСогласования(ПараметрыОтменыСогласования)
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Евросиб Каблов 08.01.2025 ( #97984
	ТекДата = ТекущаяДата();
	ТекПользователь = Пользователи.ТекущийПользователь();
	ДанныеПроцессаСогласования = СогласованиеСервер.ПолучитьПроцессСогласованияОбъекта(Объект.Ссылка);	
	//Евросиб Каблов 08.01.2025 )
	
    НачатьТранзакцию();
	
	ПараметрыЗаписи = Новый Структура("РежимЗаписи, ИзмененыТолькоРазрешенныеПоля", РежимЗаписиДокумента.ОтменаПроведения, Истина);
	ПараметрыЗаписи.Вставить("ВозвращаемыеЗадачи", ПараметрыОтменыСогласования.ВозвращаемыеЗадачи);
	
	Записать(ПараметрыЗаписи);
	
	//Евросиб Каблов 08.01.2025 ( #97984
	МЗ = РегистрыСведений.Рецензирование.СоздатьМенеджерЗаписи();
	МЗ.ЦиклСогласования = ДанныеПроцессаСогласования.ШагЦикла;
	МЗ.РецензОбъект = Объект.Ссылка;
	МЗ.Рецензент = ТекПользователь;
	МЗ.ТаймШтамп = ТекДата;
	МЗ.Комментарии = ПараметрыОтменыСогласования.Комментарий;
	МЗ.Действие = Перечисления.СтатусыЭтапов.Отозван;
	//МЗ.СтатусОбъекта = ДанныеПроцессаСогласования.СтатусДокумента;
	МЗ.СтатусОбъекта = Перечисления.СтатусыСогласования.Планируется;
	Если ТекПользователь = Объект.Автор Тогда
		МЗ.РольИсполнителя = "Автор  документа";
	Иначе
		
		Для Каждого Стр Из Объект.ПримененныйМаршрут.Состояния Цикл
			Если ТипЗнч(Стр.Исполнитель) = Тип("СправочникСсылка.ГруппыПользователей") Тогда
				МассивИсполнителей = Пользователи_sd_сервер.ПолучитьПользователейГруппы(Стр.Исполнитель, ТекДата, Истина);
				Если МассивИсполнителей.Найти(ТекПользователь) <> Неопределено Тогда
					МЗ.РольИсполнителя = Стр.Исполнитель; 
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ЗначениеЗаполнено(МЗ.РольИсполнителя) Тогда
			ГруппыПользователя = Пользователи_sd_сервер.ПолучитьСписокМоихГрупп(ТекПользователь, Ложь);
			Для Каждого ГруппаПользователя Из ГруппыПользователя Цикл
				Если ТипЗнч(ГруппаПользователя) = Тип("СправочникСсылка.ГруппыПользователей") И ГруппаПользователя <> Справочники.ГруппыПользователей.ВсеПользователи Тогда
					МЗ.РольИсполнителя = ГруппаПользователя;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	МЗ.Записать(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Файлы.Ссылка КАК Ссылка,
	|	Файлы.Наименование КАК Наименование,
	|	Файлы.Расширение КАК Расширение,
	|	Файлы.ФайлХранилище КАК ФайлХранилище,
	|	Файлы.ПутьКФайлу КАК ПутьКФайлу
	|ИЗ
	|	Справочник.Файлы КАК Файлы
	|ГДЕ
	|	Файлы.ВладелецФайла = &ВладелецФайла
	|	И НЕ Файлы.ПометкаУдаления
	|	И Файлы.Наименование ПОДОБНО &Наименование";
	Запрос.УстановитьПараметр("ВладелецФайла", Объект.Ссылка);
	Запрос.УстановитьПараметр("Наименование", "%Лист согласования%");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ФайлОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ФайлОбъект.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
	//Евросиб Каблов 08.01.2025 )
	
	ЗафиксироватьТранзакцию();
	//Евросиб Шевченко А.В. US 131501 TA 131502 18.03.2026
	ПараметрыЗаписи = Новый Структура("РежимЗаписи, ИзмененыТолькоРазрешенныеПоля", РежимЗаписиДокумента.Запись, Истина);	
	Записать(ПараметрыЗаписи);
	//Евросиб Шевченко А.В. US 131501 TA 131502 18.03.2026
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Рецензирование(Команда)
	
	ПараметрыФормы = Новый Структура("РецензОбъект", Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.РецензированиеПриСогласовании", ПараметрыФормы,, ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛистСогласования(Команда)
	
	ТабДок = МаршрутизацияСервер.ПолучитьТабдокЛистаСогласования(Объект.Ссылка);
	ТабДок.Показать();
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	
	ЗаполнитьСтавкуНДСВСтрокаУслугСервер();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтавкуНДСВСтрокаУслугСервер()
	
	СоответствиеРеквизитовНоменклатуры = ПолучитьЗначенияРеквизитовНоменклатурыУслуг();
	СтавкаНДСПустаяСсылка = Перечисления.СтавкиНДС.ПустаяСсылка();
	
	Для Каждого СтрокаТЧ Из Объект.Услуги Цикл
		
		СтрокаТЧ.СтавкаНДС = СтавкаНДСПустаяСсылка;
		РеквизитыНоменклатуры = СоответствиеРеквизитовНоменклатуры.Получить(СтрокаТЧ.Номенклатура);
		Если ЗначениеЗаполнено(РеквизитыНоменклатуры) И ЗначениеЗаполнено(РеквизитыНоменклатуры.СтавкаНДСПоставщика) Тогда
			СтавкаНДСПоставщика = РеквизитыНоменклатуры.СтавкаНДСПоставщика;
		Иначе
			СтавкаНДСПоставщика = Неопределено;
		КонецЕсли;
		ЗаполнитьСтавкуНДСВСтрокеУслуг(СтрокаТЧ, СтавкаНДСПоставщика);
		
		ПересчитатьСтоимостьСУчетомСтавкиНДС(СтрокаТЧ);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ТекДанные = Элементы.Услуги.ТекущиеДанные;
		ТекДанные.ИдентификаторСтрокиУслуг = Строка(Новый УникальныйИдентификатор);
		
		Если Копирование Тогда
			
			ТекДанные.Критерий = Неопределено;
			ТекДанные.Критерии.Очистить();
			
			Если ЗначениеЗаполнено(ИдентификаторКопируемойСтрокиУслуг) Тогда
				
				КопируемаяДетализация = Объект.ДетализацияКомплекснойСтавки.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", ИдентификаторКопируемойСтрокиУслуг));
				Для Каждого Стр Из КопируемаяДетализация Цикл
					НовСтр = Объект.ДетализацияКомплекснойСтавки.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, Стр,, "ИдентификаторСтрокиУслуг");
					НовСтр.ИдентификаторСтрокиУслуг = ТекДанные.ИдентификаторСтрокиУслуг;
				КонецЦикла;
				
				КопируемаяДетализация = Объект.ШкалаСтавок.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", ИдентификаторКопируемойСтрокиУслуг));
				Для Каждого Стр Из КопируемаяДетализация Цикл
					НовСтр = Объект.ШкалаСтавок.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, Стр,, "ИдентификаторСтрокиУслуг");
					НовСтр.ИдентификаторСтрокиУслуг = ТекДанные.ИдентификаторСтрокиУслуг;
				КонецЦикла;
				
				КопируемаяДетализация = Объект.УчетныеЕдиницы.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", ИдентификаторКопируемойСтрокиУслуг));
				Для Каждого Стр Из КопируемаяДетализация Цикл
					НовСтр = Объект.УчетныеЕдиницы.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, Стр,, "ИдентификаторСтрокиУслуг");
					НовСтр.ИдентификаторСтрокиУслуг = ТекДанные.ИдентификаторСтрокиУслуг;
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе
		
			Если Не ЗначениеЗаполнено(ТекДанные.СтавкаНДС) Тогда
				
				Если ЗначениеЗаполнено(ТекДанные.Номенклатура) Тогда
					СтавкаНДСПоставщика = ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ТекДанные.Номенклатура, "СтавкаНДСПоставщика");
					Если ЗначениеЗаполнено(СтавкаНДСПоставщика) Тогда
						ТекДанные.СтавкаНДС = СтавкаНДСПоставщика;
					КонецЕсли;
				КонецЕсли;
				
			    Если Не ЗначениеЗаполнено(ТекДанные.СтавкаНДС) Тогда
					ТекДанные.СтавкаНДС = Объект.СтавкаНДС;
				КонецЕсли;
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ТекДанные.Валюта) Тогда
				Если ЗначениеЗаполнено(ПараметрыВидаУслуг.ВалютаПоУмолчанию) Тогда
					ТекДанные.Валюта = ПараметрыВидаУслуг.ВалютаПоУмолчанию;
				Иначе
					ТекДанные.Валюта = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Объект.Договор, "ВалютаВзаиморасчетов");
				КонецЕсли;
			КонецЕсли;
			
			ОписаниеПоля = ПараметрыВидаУслуг.ПоляТаблицыУслуг.Получить("ВариантОпределенияДатыКурсаВалют");
			Если ОписаниеПоля <> Неопределено И Не ЗначениеЗаполнено(ТекДанные.ВариантОпределенияДатыКурсаВалют) Тогда
				ТекДанные.ВариантОпределенияДатыКурсаВалют = Объект.ВариантОпределенияДатыКурсаВалют;
			КонецЕсли;
			
			Для Каждого Элемент Из ПараметрыВидаУслуг.ЗначенияПолейПоУмолчанию Цикл
				ТекДанные[Элемент.Ключ] = Элемент.Значение;
			КонецЦикла;
			
			//Приоритет локаций при выборе. Возможность выбора мультилокаций после очисти поля.
			ЛокацияПустаяСсылка = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
			ТекДанные.ПунктОтправления = ЛокацияПустаяСсылка;
			ТекДанные.ПунктНазначения = ЛокацияПустаяСсылка;
			ТекДанные.СтанцииПогранпереходов = ЛокацияПустаяСсылка;
			ТекДанные.ПунктОтправленияГород = ЛокацияПустаяСсылка;
			ТекДанные.ПунктНазначенияГород = ЛокацияПустаяСсылка;
			ТекДанные.ПунктОтправленияСтрана = ЛокацияПустаяСсылка;
			Текданные.ПунктНазначенияСтрана = ЛокацияПустаяСсылка;
			Текданные.ЛокацияОказанияУслуги = ЛокацияПустаяСсылка; //Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
			АдресПустаяСсылка = ПредопределенноеЗначение("Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка");
			ТекДанные.АдресСкладаПогрузкиВыгрузки = АдресПустаяСсылка;
			
		КонецЕсли;
		
		ТекДанные.ПроверкаСтавок = ПредопределенноеЗначение("Перечисление.РезультатыПроверки.НеОсуществлялась");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("Подключаемый_ОбработатьАктивизациюСтрокиУслуг", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьАктивизациюСтрокиУслуг() Экспорт
	
	ТекДанныеУслуги = Элементы.Услуги.ТекущиеДанные;
	
	Если ТекДанныеУслуги <> Неопределено Тогда
		ИдентификаторСтрокиУслуг = ТекДанныеУслуги.ИдентификаторСтрокиУслуг;
		
		Если ЗначениеЗаполнено(ПараметрыВидаУслуг.ТипУчетныхЕдиницДетализации) Тогда
			Элементы.СписокУчетныхЕдиницУчетнаяЕдиницаСсылка.ОграничениеТипа = Новый ОписаниеТипов(ПараметрыВидаУслуг.ТипУчетныхЕдиницДетализации);
		ИначеЕсли ТекДанныеУслуги.ТипУчетныхЕдиниц = "СправочникСсылка.ТЕ" Тогда
			Элементы.СписокУчетныхЕдиницУчетнаяЕдиницаСсылка.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ТЕ");
		ИначеЕсли ТекДанныеУслуги.ТипУчетныхЕдиниц = "СправочникСсылка.ТС" Тогда
			Элементы.СписокУчетныхЕдиницУчетнаяЕдиницаСсылка.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ТС");
		Иначе
			Элементы.СписокУчетныхЕдиницУчетнаяЕдиницаСсылка.ОграничениеТипа = Новый ОписаниеТипов();
		КонецЕсли;
	
	Иначе
		ИдентификаторСтрокиУслуг = -1;
	КонецЕсли;
	СтруктураОтбора = Новый Структура("ИдентификаторСтрокиУслуг", ИдентификаторСтрокиУслуг);
	
	Элементы.ДетализацияКомплекснойСтавки.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураОтбора);
	Элементы.УчетныеЕдиницы.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураОтбора);
	Элементы.СписокУчетныхЕдиниц.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураОтбора);
	
	УстановитьВидимостьДоступностьЭлементовДетализацииПоУчетнымЕдиницам(ТекДанныеУслуги);
	УстановитьВидимостьДоступностьЭлементовДетализацииКомплекснойСтавки(ТекДанныеУслуги);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	Если Поле = Элементы.УслугиКритерии Или Поле = Элементы.УслугиКритерииСтрокой Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СписокКритериев = Новый СписокЗначений;
		Для Каждого ЭлементСписка Из ТекДанные.Критерии Цикл
			СписокКритериев.Добавить(ЭлементСписка.Значение,,, БиблиотекаКартинок.ПолеВводаОткрыть);
		КонецЦикла;
		
		ОповещениеОВыборе = Новый ОписаниеОповещения("ОбработкаВыбораКритерия", ЭтаФорма);
		ПоказатьВыборИзСписка(ОповещениеОВыборе, СписокКритериев, Элемент);
		
	ИначеЕсли Поле = Элементы.УслугиКлючиНормативныхСтавок Или Поле = Элементы.УслугиКлючиНормативныхСтавокСтрокой Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СписокКлючейНормативныхСтавок = Новый СписокЗначений;
		Для Каждого ЭлементСписка Из ТекДанные.КлючиНормативныхСтавок Цикл
			СписокКлючейНормативныхСтавок.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление,, БиблиотекаКартинок.ПолеВводаОткрыть);
		КонецЦикла;
		
		Для Каждого ЭлементСписка Из ТекДанные.КлючиНеподошедшихНормативныхСтавок Цикл
			СписокКлючейНормативныхСтавок.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление,, БиблиотекаКартинок.ПолеВводаОткрыть);
		КонецЦикла;
		
		ОповещениеОВыборе = Новый ОписаниеОповещения("ОбработкаВыбораКлючаНормативнойСтавки", ЭтаФорма);
		ПоказатьВыборИзСписка(ОповещениеОВыборе, СписокКлючейНормативныхСтавок, Элемент);
		
	ИначеЕсли Поле = Элементы.УслугиПунктОтправления Тогда
		
		Если Элементы.УслугиПунктОтправления.ТолькоПросмотр Тогда
			СтандартнаяОбработка = Ложь;
			Если ЗначениеЗаполнено(ТекДанные.ПунктОтправления) Тогда
				ПоказатьЗначение(, ТекДанные.ПунктОтправления);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Поле = Элементы.УслугиПунктОтправленияГород Тогда
		
		Если Элементы.УслугиПунктОтправленияГород.ТолькоПросмотр Тогда
			СтандартнаяОбработка = Ложь;
			Если ЗначениеЗаполнено(ТекДанные.ПунктОтправленияГород) Тогда
				ПоказатьЗначение(, ТекДанные.ПунктОтправленияГород);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Поле = Элементы.УслугиПунктОтправленияСтрана Тогда
		
		Если Элементы.УслугиПунктОтправленияСтрана.ТолькоПросмотр Тогда
			СтандартнаяОбработка = Ложь;
			Если ЗначениеЗаполнено(ТекДанные.ПунктОтправленияСтрана) Тогда
				ПоказатьЗначение(, ТекДанные.ПунктОтправленияСтрана);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Поле = Элементы.УслугиПунктНазначения Тогда
		
		Если Элементы.УслугиПунктНазначения.ТолькоПросмотр Тогда
			СтандартнаяОбработка = Ложь;
			Если ЗначениеЗаполнено(ТекДанные.ПунктНазначения) Тогда
				ПоказатьЗначение(, ТекДанные.ПунктНазначения);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Поле = Элементы.УслугиПунктНазначенияГород Тогда
		
		Если Элементы.УслугиПунктНазначенияГород.ТолькоПросмотр Тогда
			СтандартнаяОбработка = Ложь;
			Если ЗначениеЗаполнено(ТекДанные.ПунктНазначенияГород) Тогда
				ПоказатьЗначение(, ТекДанные.ПунктНазначенияГород);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Поле = Элементы.УслугиПунктНазначенияСтрана Тогда
		
		Если Элементы.УслугиПунктНазначенияСтрана.ТолькоПросмотр Тогда
			СтандартнаяОбработка = Ложь;
			Если ЗначениеЗаполнено(ТекДанные.ПунктНазначенияСтрана) Тогда
				ПоказатьЗначение(, ТекДанные.ПунктНазначенияСтрана);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступностьЭлементовДетализацииПоУчетнымЕдиницам(ТекДанныеУслуги)
	
	Если ТекДанныеУслуги <> Неопределено Тогда 
		
		Если ТекДанныеУслуги.СпособВводаУчетныхЕдиниц = ПредопределенноеЗначение("Перечисление.СпособыВводаУчетныхЕдиниц.Построчно") Тогда
			
			Элементы.СписокУчетныхЕдиницУчетнаяЕдиницаСсылка.Видимость = Истина;
			Элементы.СписокУчетныхЕдиницУчетнаяЕдиница.Видимость = Ложь;
			ДоступностьВставкиУчетныхЕдиниц = Истина;
			
		ИначеЕсли ТекДанныеУслуги.СпособВводаУчетныхЕдиниц = ПредопределенноеЗначение("Перечисление.СпособыВводаУчетныхЕдиниц.Списком") Тогда
			Элементы.СписокУчетныхЕдиницУчетнаяЕдиницаСсылка.Видимость = Ложь;
			Элементы.СписокУчетныхЕдиницУчетнаяЕдиница.Видимость = Истина;
			ДоступностьВставкиУчетныхЕдиниц = Истина;
		Иначе
			Элементы.СписокУчетныхЕдиницУчетнаяЕдиницаСсылка.Видимость = Истина;
			Элементы.СписокУчетныхЕдиницУчетнаяЕдиница.Видимость = Ложь;
			ДоступностьВставкиУчетныхЕдиниц = Ложь;
		КонецЕсли;
		
		ДоступенВводКонтейнеров = Ложь;
		ДоступенВводВагонов = Ложь;
		Если ЗначениеЗаполнено(ПараметрыВидаУслуг.ТипУчетныхЕдиницДетализации) Тогда
			Если СтрНайти(ПараметрыВидаУслуг.ТипУчетныхЕдиницДетализации, "СправочникСсылка.ТЕ") Тогда
				ДоступенВводКонтейнеров = Истина;			
			КонецЕсли;
			Если СтрНайти(ПараметрыВидаУслуг.ТипУчетныхЕдиницДетализации, "СправочникСсылка.ТС") Тогда
				ДоступенВводВагонов = Истина;			
			КонецЕсли;
		ИначеЕсли ТекДанныеУслуги.ТипУчетныхЕдиниц = "СправочникСсылка.ТЕ" Тогда
			ДоступенВводКонтейнеров = Истина;
		ИначеЕсли ТекДанныеУслуги.ТипУчетныхЕдиниц = "СправочникСсылка.ТС" Тогда
			ДоступенВводВагонов = Истина;
		Иначе
			ДоступенВводКонтейнеров = Истина;
			ДоступенВводВагонов = Истина;
		КонецЕсли;
		
	Иначе
		
		ДоступностьВставкиУчетныхЕдиниц = Ложь;
		
	КонецЕсли;
	
	Элементы.СписокУчетныхЕдиниц.Доступность = ДоступностьВставкиУчетныхЕдиниц;
	Элементы.УслугиВставитьСписокВагоновИзExcel.Доступность = ДоступностьВставкиУчетныхЕдиниц И ДоступенВводВагонов;
	Элементы.УслугиВставитьСписокКТКИзExcel.Доступность = ДоступностьВставкиУчетныхЕдиниц И ДоступенВводКонтейнеров;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступностьЭлементовДетализацииКомплекснойСтавки(ТекДанныеУслуги)
	
	Если ТекДанныеУслуги <> Неопределено Тогда 
		ДоступностьДетализацииКомплекснойСтавки = ТекДанныеУслуги.ТребуетсяДетализацияКомплекснойСтавки;
	Иначе
		ДоступностьДетализацииКомплекснойСтавки = Ложь;
	КонецЕсли;
	
	Элементы.ДетализацияКомплекснойСтавки.Доступность = ДоступностьДетализацииКомплекснойСтавки;
	
	РассчитатьСуммуПоСтрокамДетализацииКомплекснойСтавки(ТекДанныеУслуги);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиНоменклатураПоставщикаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекДанные.НоменклатураПоставщика) Тогда		
		УслугиНоменклатураПоставщикаПриИзмененииСервер(ТекДанные.ПолучитьИдентификатор());				
	КонецЕсли;
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиНоменклатураПоставщикаПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	
	ДанныеНоменклатурыПоставщика = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекДанные.НоменклатураПоставщика, "Номенклатура, Наименование");
	Если ЗначениеЗаполнено(ДанныеНоменклатурыПоставщика.Номенклатура) Тогда
		ТекДанные.Номенклатура = ДанныеНоменклатурыПоставщика.Номенклатура;
		ОбработатьИзменениеНоменклатурыВСтроке(ТекДанные);
		ПроверитьИУстановитьПризнакТиповой();
	КонецЕсли;
	
	ТекДанные.НаименованиеНоменклатурыПоставщика = ДанныеНоменклатурыПоставщика.Наименование;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиНоменклатураПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиНоменклатураПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиНоменклатураПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ОбработатьИзменениеНоменклатурыВСтроке(ТекДанные);
	ЗначенияПолей = ОпредилитьОбязательностьЗаполненияПолейПоДопУсловиям(ТекДанные); //Евросиб Шевченко А.В. US 83101 TA 122833 07.11.2025
	Для Каждого ОбязательноеПоле Из ЗначенияПолей Цикл
		ТекДанные[ОбязательноеПоле.ИмяРек] = ОбязательноеПоле.Значение;
	КонецЦикла;
	ПроверитьИУстановитьПризнакТиповой();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьИУстановитьПризнакТиповой()
	
	ТолькоПросмотрТипаПротокола = Ложь;
	
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Договор, "ФормаПротокола, Типовой");
	Если ЗначениеЗаполнено(РеквизитыДоговора.ФормаПротокола) Тогда
		ТолькоПросмотрТипаПротокола = Истина;
		Если РеквизитыДоговора.ФормаПротокола = Перечисления.ФормыДокументов.Типовая Тогда
			Объект.Типовой = Истина;
		Иначе
			Объект.Типовой = Ложь;
		КонецЕсли;
	Иначе
		ВидУслугФормаПротокола = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВидУслугПоставщика, "ФормаПротокола");
		Если ВидУслугФормаПротокола = Перечисления.ФормыДокументов.Нетиповая Тогда
			Объект.Типовой = Ложь;
		ИначеЕсли ВидУслугФормаПротокола = Перечисления.ФормыДокументов.Типовая Тогда
			Объект.Типовой = Истина;
		Иначе
			Объект.Типовой = РеквизитыДоговора.Типовой;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Контейнеры Тогда
		
		НоменклатураТиповогоПротокола = Новый Соответствие;
		НоменклатураТиповогоПротокола.Вставить(Справочники.Номенклатура.ПредоставлениеКТК, 1);
		НоменклатураТиповогоПротокола.Вставить(Справочники.Номенклатура.СНПКонтейнеров, 1);
		
		ТаблицаНоменклатуры = Объект.Услуги.Выгрузить(, "Номенклатура");
		ТаблицаНоменклатуры.Свернуть("Номенклатура");
		ДоступенТиповойПротокол = Истина;
		Для Каждого Стр Из ТаблицаНоменклатуры Цикл
			Если ЗначениеЗаполнено(Стр.Номенклатура) И НоменклатураТиповогоПротокола.Получить(Стр.Номенклатура) = Неопределено Тогда
				ДоступенТиповойПротокол = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ДоступенТиповойПротокол Тогда
			ТолькоПросмотрТипаПротокола = Истина;
			Объект.Типовой = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.Типовой.ТолькоПросмотр = ТолькоПросмотрТипаПротокола;
	
	Элементы.МакетПечатнойФормыПротокола.Видимость = Объект.Типовой;	
	Если Не Объект.Типовой Тогда
		Объект.МакетПечатнойФормыПротокола = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьПризнакаТиповой()
	
	ТолькоПросмотрТипаПротокола = Ложь;
	
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Договор, "ФормаПротокола, Типовой");
	Если ЗначениеЗаполнено(РеквизитыДоговора.ФормаПротокола) Тогда
		ТолькоПросмотрТипаПротокола = Истина;		
	КонецЕсли;
	
	Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Контейнеры Тогда
		
		НоменклатураТиповогоПротокола = Новый Соответствие;
		НоменклатураТиповогоПротокола.Вставить(Справочники.Номенклатура.ПредоставлениеКТК, 1);
		НоменклатураТиповогоПротокола.Вставить(Справочники.Номенклатура.СНПКонтейнеров, 1);
		
		ТаблицаНоменклатуры = Объект.Услуги.Выгрузить(, "Номенклатура");
		ТаблицаНоменклатуры.Свернуть("Номенклатура");
		ДоступенТиповойПротокол = Истина;
		Для Каждого Стр Из ТаблицаНоменклатуры Цикл
			Если ЗначениеЗаполнено(Стр.Номенклатура) И НоменклатураТиповогоПротокола.Получить(Стр.Номенклатура) = Неопределено Тогда
				ДоступенТиповойПротокол = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ДоступенТиповойПротокол Тогда
			ТолькоПросмотрТипаПротокола = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.Типовой.ТолькоПросмотр = ТолькоПросмотрТипаПротокола;
		
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеНоменклатурыВСтроке(ТекДанные)
	
	ЭлементыТабличногоПоляУслуги = Элементы.Услуги.ПодчиненныеЭлементы;
	ЭлементУслугиНоменклатураПоставщика = ЭлементыТабличногоПоляУслуги.Найти("УслугиНоменклатураПоставщика");
	Если ЭлементУслугиНоменклатураПоставщика <> Неопределено Тогда
		Номенклатура = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекДанные.НоменклатураПоставщика, "Номенклатура");
		Если ЗначениеЗаполнено(Номенклатура) И Номенклатура <> ТекДанные.Номенклатура Тогда
			НоменклатураПоставщика = НайтиНоменклатуруПоставщика(ТекДанные.НаименованиеНоменклатурыПоставщика, ТекДанные.Номенклатура);
			ТекДанные.НоменклатураПоставщика = НоменклатураПоставщика;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекДанные.Номенклатура) Тогда
		
		СНПКонтейнеров = ПредопределенноеЗначение("Справочник.Номенклатура.СНПКонтейнеров");
		ЗначенияРеквизитовНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекДанные.Номенклатура, "СтавкаНДСПоставщика, ЕдиницаИзмерения");
		
		ЗаполнитьСтавкуНДСВСтрокеУслуг(ТекДанные, ЗначенияРеквизитовНоменклатуры.СтавкаНДСПоставщика);
		ПересчитатьСтоимостьСУчетомСтавкиНДС(ТекДанные);
		
		Если ЗначениеЗаполнено(ЗначенияРеквизитовНоменклатуры.ЕдиницаИзмерения) Тогда
			ТекДанные.ЕдиницаИзмерения = ЗначенияРеквизитовНоменклатуры.ЕдиницаИзмерения;
		КонецЕсли;
		
		ОписаниеПоляВидСобственности = ПараметрыВидаУслуг.ПоляТаблицыУслуг.Получить("ВидСобственности");
		Если ОписаниеПоляВидСобственности <> Неопределено Тогда
			Если ТекДанные.Номенклатура = Справочники.Номенклатура.АрендаКонтейнеров Тогда
				ТекДанные.ВидСобственности = Перечисления.ВариантыСобственности.АрендаДлительная;
			КонецЕсли;
		КонецЕсли;
		
		УстановитьЗначениеПоляСостояниеГруженыйПорожний(ТекДанные);
		
	КонецЕсли;
	
	УдалитьПризнакиПроверкиСтавкиПоСтрокеУслуг(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтавкуНДСВСтрокеУслуг(СтрокаТЧ, НоменклатураСтавкаНДСПоставщика = Неопределено)
	
	Если СНПКонтейнеровШтраф И СтрокаТЧ.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.СНПКонтейнеров") Тогда
		СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
	//ИначеЕсли СтрокаТЧ.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.СНПКонтейнеров") Тогда
	//	СтрокаТЧ.СтавкаНДС = Объект.СтавкаНДС;
	//Евросиб Шевченко А.В. US 114885 TA 114911 22.07.2025
	ИначеЕсли СтрокаТЧ.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ШтрафыПрочие") И Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Контейнеры Тогда
		СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
	//Евросиб Шевченко А.В. US 114885 TA 114911 22.07.2025	
	ИначеЕсли ЗначениеЗаполнено(Объект.ВидПеревозки) Тогда
		СтрокаТЧ.СтавкаНДС = Объект.СтавкаНДС;
	ИначеЕсли Не ЗначениеЗаполнено(СтрокаТЧ.СтавкаНДС) Тогда
		Если ЗначениеЗаполнено(НоменклатураСтавкаНДСПоставщика) Тогда
			СтрокаТЧ.СтавкаНДС = НоменклатураСтавкаНДСПоставщика;		
		Иначе
			СтрокаТЧ.СтавкаНДС = Объект.СтавкаНДС;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтоимостьСНДСПриИзменении(Элемент)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	ЗначениеСтавкиНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСтавкуНДС(ТекДанные.СтавкаНДС);	
	СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(ТекДанные.СтоимостьСНДС, ЗначениеСтавкиНДС, Истина, Истина);
	ТекДанные.СтоимостьБезНДС = ТекДанные.СтоимостьСНДС - СуммаНДС;
	
	УслугиСтоимостьСНДСПриИзмененииСервер(Элементы.Услуги.ТекущаяСтрока);
	
	ПересчетСтавкиПСвСутки(Элементы.Услуги.ТекущаяСтрока,"СтоимостьСНДС"); //Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтавкаЗаПСВСутСНДСПриИзменении(Элемент) //Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	ЗначениеСтавкиНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСтавкуНДС(ТекДанные.СтавкаНДС);	
	СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(ТекДанные.СтавкаЗаПСВСутСНДС, ЗначениеСтавкиНДС, Истина, Истина);
	ТекДанные.СтавкаЗаПСВСутБезНДС = ТекДанные.СтавкаЗаПСВСутСНДС - СуммаНДС;
	
	УслугиСтавкаЗаПСВСутСНДСПриИзмененииСервер(Элементы.Услуги.ТекущаяСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиСтоимостьСНДСПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	УдалитьПризнакиПроверкиСтавкиПоСтрокеУслуг(ТекДанные);
	
	ЗначенияПолей = ОпредилитьОбязательностьЗаполненияПолейПоДопУсловиям(ТекДанные);
	Для Каждого ОбязательноеПоле Из ЗначенияПолей Цикл
		ТекДанные[ОбязательноеПоле.ИмяРек] = ОбязательноеПоле.Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтоимостьБезНДСПриИзменении(Элемент)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	ЗначениеСтавкиНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСтавкуНДС(ТекДанные.СтавкаНДС);	
	СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(ТекДанные.СтоимостьБезНДС, ЗначениеСтавкиНДС, Истина, Ложь);
	ТекДанные.СтоимостьСНДС = ТекДанные.СтоимостьБезНДС + СуммаНДС;
	
	УслугиСтоимостьБезНДСПриИзмененииСервер(Элементы.Услуги.ТекущаяСтрока);
	
	ПересчетСтавкиПСвСутки(Элементы.Услуги.ТекущаяСтрока,"СтоимостьБезНДС"); //Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтавкаЗаПСВСутБезНДСПриИзменении(Элемент) //Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	ЗначениеСтавкиНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСтавкуНДС(ТекДанные.СтавкаНДС);	
	СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(ТекДанные.СтавкаЗаПСВСутБезНДС, ЗначениеСтавкиНДС, Истина, Ложь);
	ТекДанные.СтавкаЗаПСВСутСНДС = ТекДанные.СтавкаЗаПСВСутБезНДС + СуммаНДС;
	
	УслугиСтавкаЗаПСВСутБезНДСПриИзмененииСервер(Элементы.Услуги.ТекущаяСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиСтоимостьБезНДСПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	УдалитьПризнакиПроверкиСтавкиПоСтрокеУслуг(ТекДанные);
	
	ЗначенияПолей = ОпредилитьОбязательностьЗаполненияПолейПоДопУсловиям(ТекДанные);
	Для Каждого ОбязательноеПоле Из ЗначенияПолей Цикл
		ТекДанные[ОбязательноеПоле.ИмяРек] = ОбязательноеПоле.Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УслугиСтавкаЗаПСВСутСНДСПриИзмененииСервер(ТекСтрока) //Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	
	ЗначенияПолей = ОпредилитьОбязательностьЗаполненияПолейПоДопУсловиям(ТекДанные);
	Для Каждого ОбязательноеПоле Из ЗначенияПолей Цикл
		ТекДанные[ОбязательноеПоле.ИмяРек] = ОбязательноеПоле.Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УслугиСтавкаЗаПСВСутБезНДСПриИзмененииСервер(ТекСтрока) //Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	
	ЗначенияПолей = ОпредилитьОбязательностьЗаполненияПолейПоДопУсловиям(ТекДанные);
	Для Каждого ОбязательноеПоле Из ЗначенияПолей Цикл
		ТекДанные[ОбязательноеПоле.ИмяРек] = ОбязательноеПоле.Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтавкаНДСПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиСтавкаНДСПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиСтавкаНДСПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ПересчитатьСтоимостьСУчетомСтавкиНДС(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСтоимостьСУчетомСтавкиНДС(СтрокаУслуг)
	
	Если СтрокаУслуг.СтавкаПрогрессивная Тогда
		ПересчитатьСтоимостьПоШкалеСУчетомСтавкиНДС(СтрокаУслуг, "СтоимостьБезНДС");	
	Иначе
		ЗначениеСтавкиНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСтавкуНДС(СтрокаУслуг.СтавкаНДС);		
		Если ЗначениеЗаполнено(СтрокаУслуг.СтоимостьБезНДС) Тогда
			СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(СтрокаУслуг.СтоимостьБезНДС, ЗначениеСтавкиНДС, Истина, Ложь);
			СтрокаУслуг.СтоимостьСНДС = СтрокаУслуг.СтоимостьБезНДС + СуммаНДС;
		ИначеЕсли ЗначениеЗаполнено(СтрокаУслуг.СтоимостьСНДС) Тогда
			СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(СтрокаУслуг.СтоимостьСНДС, ЗначениеСтавкиНДС, Истина, Истина);
			СтрокаУслуг.СтоимостьБезНДС = СтрокаУслуг.СтоимостьСНДС - СуммаНДС;
		КонецЕсли;
		//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
		Если ЗначениеЗаполнено(СтрокаУслуг.СтавкаЗаПСВСутБезНДС) Тогда
			СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(СтрокаУслуг.СтавкаЗаПСВСутБезНДС, ЗначениеСтавкиНДС, Истина, Ложь);
			СтрокаУслуг.СтавкаЗаПСВСутСНДС = СтрокаУслуг.СтавкаЗаПСВСутБезНДС + СуммаНДС;
		ИначеЕсли ЗначениеЗаполнено(СтрокаУслуг.СтавкаЗаПСВСутСНДС) Тогда
			СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(СтрокаУслуг.СтавкаЗаПСВСутСНДС, ЗначениеСтавкиНДС, Истина, Истина);
			СтрокаУслуг.СтавкаЗаПСВСутБезНДС = СтрокаУслуг.СтавкаЗаПСВСутСНДС - СуммаНДС;
		КонецЕсли;
		//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры

&НаКлиенте
Процедура ВыдатьНомерПСЦ(Команда)

	Если ЗначениеЗаполнено(Объект.НомерПСЦ) Тогда
		Сообщить("Перед выдачей нового номера ПСЦ, нужно очистить поле ""Номер ПСЦ""!");
		Возврат;
	//ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	Сообщить("Перед выдачей номера ПСЦ необходимо записать документ!");
	//	Возврат;
	КонецЕсли;  
	
	Отказ = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.ДатаПСЦ) Тогда Сообщить("Укажите дату ПСЦ!"); Отказ = Истина; КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Договор) Тогда Сообщить("Укажите договор с номером!"); Отказ = Истина; КонецЕсли;
	Если Отказ = Истина Тогда Возврат; КонецЕсли;
	
	ОчереднойНомер = ПолучитьОчереднойНомерПСЦ(Объект.Договор, Объект.Ссылка);
	Объект.НомерПСЦ = ОчереднойНомер;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОчереднойНомерПСЦ(Договор, Ссылка)
	
	Возврат Документы.ПСЦПоставщика.ПолучитьОчереднойНомерПСЦ(Договор, Ссылка);
	
КонецФункции

&НаКлиенте
Процедура СсылкаНаПротоколВДОНажатие(Элемент)
	ПерейтиПоНавигационнойСсылке(Объект.СсылкаНаВнутреннийДокументДО);
КонецПроцедуры

&НаКлиенте
Процедура ПередатьПСЦВДО(Команда)
	СоздатьКарточкуПСЦвДОНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРелизСобственникаНаОснованииПСЦ(Команда)
	// Евросиб US 89887 TA 89889 Рыбьяков К.А. 19.11.2024 ((
	Если ЭтаФорма.Модифицированность Тогда
		ЭтотОбъект.Записать();
	КонецЕсли;
	
	ДокументОбъект = Объект;
	
	Если ЕстьОшибкиВСтрокахПСЦ(ДокументОбъект) Тогда
		Возврат;
	Иначе
		ЗаполнитьРелизыСобственника(Объект.Ссылка, Истина);
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 19.11.2024 ))
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьБлокировкуЭлементов()
	
	КонтрольДоступностиДокументов_сервер.ОбработатьБлокировкуЭлементовФормы(Объект.Ссылка, Элементы, Объект);
	//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
	Если Объект.ВидУслугПоставщика <> Справочники.ВидыУслугПоставщиков.ТЭО Тогда
		УстановитьДоступностьГруппыНормативы();
	КонецЕсли;
	//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
	//Евросиб Коханенко Н.А. 29.04.2025 (( #102319
	Если ЗначениеЗаполнено(Объект.Ссылка) 
		И ЗначениеЗаполнено(Элементы.ПредупреждениеРедактирования.Заголовок) Тогда
		Элементы.ГруппаИнформацияОДокументе.Видимость = Истина;
	КонецЕсли;
	//Евросиб Коханенко Н.А. 29.04.2025 )) #102319 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьГруппыНормативы() Экспорт
	
	ДоступностьИзмененияНормативов = РольДоступна("ПолныеПрава");
	СтрокиВводПСЦ = Объект.Состояния.НайтиСтроки(Новый Структура("Состояние", Справочники.Состояния.ВводПСЦ));
	Если ЗначениеЗаполнено(СтрокиВводПСЦ) Тогда
		ИсполнительВводаПСЦ = СтрокиВводПСЦ[0].Исполнитель;
		Если ИсполнительВводаПСЦ = Пользователи.ТекущийПользователь() Тогда
			ДоступностьИзмененияНормативов = Истина;
		КонецЕсли;
	Иначе
		Если Объект.Автор = Пользователи.ТекущийПользователь() Тогда
			ДоступностьИзмененияНормативов = Истина;
		КонецЕсли;
	КонецЕсли;
		
	Элементы.УслугиГруппаНормативы.Доступность = Элементы.УслугиНоменклатура.Доступность;
	Элементы.УслугиГруппаНормативы.ТолькоПросмотр = Не ДоступностьИзмененияНормативов;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыМаршрутизацииНаСервере(Знач Объект)
	Возврат Документы.ПСЦПоставщика.ПолучитьПараметрыМаршрутизации(Объект);
КонецФункции

&НаСервере
Процедура СоздатьКарточкуПСЦвДОНаСервере()  
	
	ДанныеДляОтправки = ЕСОбменСервер.ПодготовитьТаблицуПСЦдляОтправкиДО(Объект.Ссылка);
	ЕСОбменСервер.СоздатьКарточкуПСЦвДО(ДанныеДляОтправки);  
	
	Если СтрНайти(ДанныеДляОтправки[0].Сообщение, "ОК") <> 0 Тогда 
		Объект.СсылкаНаВнутреннийДокументДО = ДанныеДляОтправки[0].Ссылка_В_ДО; 
		ЭтаФорма.Записать();
	КонецЕсли;	
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоместитьОписаниеПолейВоВременноеХранилище(ВидУслугПоставщика, Адрес)
	
	НастройкаВидаУслуг = Справочники.ВидыУслугПоставщиков.ПолучитьНастройкиВидаУслуг(ВидУслугПоставщика, "ПСЦПоставщика.Услуги");
	ТаблицаПолей = НастройкаВидаУслуг.ПоляТаблицыУслуг;
	
	АдресХранилища = ПоместитьВоВременноеХранилище(ТаблицаПолей, Адрес);
	
	Возврат АдресХранилища;
		
КонецФункции

&НаСервере
Процедура НастроитьКолонкиТаблицыУслугПоВидуУслугПоставщика()
		
	НастройкиВидаУслуг = Справочники.ВидыУслугПоставщиков.ПолучитьНастройкиВидаУслуг(Объект.ВидУслугПоставщика, "ПСЦПоставщика.Услуги");	
	//АдресНастроекВидаУслуг = ПоместитьВоВременноеХранилище(НастройкиВидаУслуг, УникальныйИдентификатор);
	
	Если ЗначениеЗаполнено(АдресКэшаНастроекПолейПоУмолчанию) Тогда
		НастройкиПолейПоУмолчанию = ПолучитьИзВременногоХранилища(АдресКэшаНастроекПолейПоУмолчанию);
	Иначе
		НастройкиПолейПоУмолчанию = Новый Соответствие;
	КонецЕсли;
	
	ПоляТаблицыУслуг = НастройкиВидаУслуг.ПоляТаблицыУслуг;
	ДопУсловия       = НастройкиВидаУслуг.ДопУсловия;
	ДопУсловияОтборов.Очистить();
	Для Каждого Условие Из ДопУсловия Цикл
		НовСтрока = ДопУсловияОтборов.Добавить();
		НовСтрока.Имя = Условие.Имя;
		НовСтрока.Настройка = Условие.Условие.Получить();
	КонецЦикла;	
	
	ПараметрыВидаУслуг = Новый Структура;
	ПараметрыВидаУслуг.Вставить("ВалютаПоУмолчанию", НастройкиВидаУслуг.ВалютаПоУмолчанию);
	ПараметрыВидаУслуг.Вставить("ТипУчетныхЕдиницДетализации", НастройкиВидаУслуг.ТипУчетныхЕдиницДетализации);
	ПараметрыВидаУслуг.Вставить("ИспользоватьЗаполнениеНормативов", НастройкиВидаУслуг.ИспользоватьЗаполнениеНормативов);
	
	Если НастройкиВидаУслуг.ИспользоватьЗаполнениеНормативов = Неопределено Тогда
		НастройкиВидаУслуг.ИспользоватьЗаполнениеНормативов = Ложь;
	КонецЕсли;
	
	Если НастройкиВидаУслуг.ИспользоватьЗаполнениеНормативов Тогда
		ПараметрыВидаУслуг.Вставить("ЗаполнятьНормативы", НастройкиВидаУслуг.ЗаполнятьНормативы);
	Иначе
		ПараметрыВидаУслуг.Вставить("ЗаполнятьНормативы", Ложь);
	КонецЕсли;
	ПараметрыВидаУслуг.Вставить("СуммаВключаетНДС", НастройкиВидаУслуг.СуммаВключаетНДС);
	
	СписокИменКолонок = Новый Массив;
	Для Каждого Колонка Из ПоляТаблицыУслуг.Колонки Цикл
		СписокИменКолонок.Добавить(Колонка.Имя);		
	КонецЦикла;
	ИменаКолонок = СтрСоединить(СписокИменКолонок, ",");
	
	ОписанияПолейТаблицыУслуг = Новый Соответствие;
	ЗначенияПолейПоУмолчанию = Новый Соответствие;
	Для Каждого СтрокаТаблицыПолей Из ПоляТаблицыУслуг Цикл
		ОписаниеПоля = Новый Структура(ИменаКолонок);
		ЗаполнитьЗначенияСвойств(ОписаниеПоля, СтрокаТаблицыПолей);
		ОписанияПолейТаблицыУслуг.Вставить(СтрокаТаблицыПолей.Имя, ОписаниеПоля);
		Если СтрокаТаблицыПолей.ЗначениеПоУмолчанию <> Неопределено Тогда
			ЗначенияПолейПоУмолчанию.Вставить(СтрокаТаблицыПолей.Имя, СтрокаТаблицыПолей.ЗначениеПоУмолчанию);
		КонецЕсли;
	КонецЦикла;
	ПараметрыВидаУслуг.Вставить("ПоляТаблицыУслуг", ОписанияПолейТаблицыУслуг);
	ПараметрыВидаУслуг.Вставить("ЗначенияПолейПоУмолчанию", ЗначенияПолейПоУмолчанию);
	
	Элементы.ЗаполнятьНормативы.Видимость = НастройкиВидаУслуг.ИспользоватьЗаполнениеНормативов;
	Элементы.УслугиЗаполнитьНормативы.Видимость = НастройкиВидаУслуг.ИспользоватьЗаполнениеНормативов;
	
	ТипГруппаФормы = Тип("ГруппаФормы");
	ТабличноеПолеУслуги = Элементы.Услуги;
	
	ЭлементыИсключения = Новый Массив;
	ЭлементыИсключения.Добавить("УслугиГруппаСтоимостьСНДС");
	ЭлементыИсключения.Добавить("УслугиГруппаСтоимостьБезНДС");
	ЭлементыИсключения.Добавить("УслугиНомерСтроки");
	УстановитьВидимостьЭлементовГруппы(ТабличноеПолеУслуги, Ложь, ЭлементыИсключения);
		
	Элементы.УслугиПоказыватьНормативы.Доступность = Ложь;
	Элементы.УслугиПоказыватьОпасныйГруз.Доступность = Ложь;
	Элементы.УслугиПоказыватьОсобыйТемпературныйРежим.Доступность = Ложь;
	Элементы.УслугиПоказыватьДанныеПоКонтейнерамВагонам.Доступность = Ложь;
	
	Элементы.УслугиПоказыватьДанныеЛинии.Доступность = Ложь;
	Элементы.УслугиПоказыватьУсловияПеревозки.Доступность = Ложь;
	
	ГруппыПолей = Новый Соответствие;
	ГруппыПолей.Вставить("", Элементы.Услуги);
	Для Каждого ОписаниеПоля Из ПоляТаблицыУслуг Цикл
		
		ГруппаЭлементовРодитель = ГруппыПолей.Получить(ОписаниеПоля.Родитель);
		Если ОписаниеПоля.ЭтоГруппаЭлементов Тогда
			ГруппаЭлементов = Элементы.Найти("Услуги" + ОписаниеПоля.Имя);
			Если ГруппаЭлементов = Неопределено Тогда
				ГруппаЭлементов = Элементы.Добавить("Услуги" + ОписаниеПоля.Имя, Тип("ГруппаФормы"), ГруппаЭлементовРодитель);
			Иначе
				Элементы.Переместить(ГруппаЭлементов, ГруппаЭлементовРодитель);
			КонецЕсли;
			ГруппаЭлементов.Видимость = ОписаниеПоля.Выводить;
			ГруппаЭлементов.Заголовок = ОписаниеПоля.Представление;
			ГруппаЭлементов.ОтображатьВШапке = ОписаниеПоля.ОтображатьВШапке;
			ГруппаЭлементов.Группировка = ГруппировкаКолонок[ОписаниеПоля.Группировка];
			ГруппыПолей.Вставить(ОписаниеПоля.Имя, ГруппаЭлементов);
			
			Если ОписаниеПоля.Имя = "ГруппаДанныеПоКонтейнерамВагонам" Тогда
				Если ОписаниеПоля.Выводить Тогда
					ГруппаДанныеПоКонтейнерамВагонам = Элементы.УслугиГруппаДанныеПоКонтейнерамВагонам;
					ГруппаДанныеПоКонтейнерамВагонам.Видимость = Элементы.УслугиПоказыватьДанныеПоКонтейнерамВагонам.Пометка;
					Элементы.УслугиПоказыватьДанныеПоКонтейнерамВагонам.Доступность = Истина;				
				КонецЕсли;
			КонецЕсли;
			
			Продолжить;
		Иначе
			Элемент = Элементы.Найти("Услуги" + ОписаниеПоля.Имя);
			//Элемент = ТабличноеПолеУслуги.ПодчиненныеЭлементы.Найти("Услуги" + ОписаниеПоля.Имя);
		КонецЕсли;
	
		Если Элемент <> Неопределено Тогда
			
			Если ОписаниеПоля.Имя = "Нормативы" Тогда
				Если ОписаниеПоля.Выводить Тогда
					УслугиГруппаНормативы = Элементы.УслугиГруппаНормативы;
					УслугиГруппаНормативы.Видимость = Элементы.УслугиПоказыватьНормативы.Пометка;
					Элементы.УслугиПоказыватьНормативы.Доступность = Истина;				
				КонецЕсли;
			//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
			ИначеЕсли Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.ТЭО И ОписаниеПоля.Имя = "НормаПользования" Тогда 
				Если ОписаниеПоля.Выводить Тогда
					УслугиГруппаНормативы = Элементы.УслугиГруппаНормативы;
					УслугиГруппаНормативы.Видимость = Элементы.УслугиПоказыватьНормативы.Пометка;
					Элементы.УслугиПоказыватьНормативы.Доступность = Истина;				
				КонецЕсли;
			//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
			ИначеЕсли ОписаниеПоля.Имя = "ОсобыйТемпературныйРежим" Тогда
				Если ОписаниеПоля.Выводить Тогда
					УслугиГруппаОсобыйТемпературныйРежим = Элементы.УслугиГруппаОсобыйТемпературныйРежим;
					УслугиГруппаОсобыйТемпературныйРежим.Видимость = Элементы.УслугиПоказыватьОсобыйТемпературныйРежим.Пометка;
					Элементы.УслугиПоказыватьОсобыйТемпературныйРежим.Доступность = Истина;
				КонецЕсли;
			ИначеЕсли ОписаниеПоля.Имя = "ОпасныйСпецГруз" Тогда
				Если ОписаниеПоля.Выводить Тогда
					УслугиГруппаОпасныйГруз = Элементы.УслугиГруппаОпасныйГруз;
					УслугиГруппаОпасныйГруз.Видимость = Элементы.УслугиПоказыватьОпасныйГруз.Пометка;
					Элементы.УслугиПоказыватьОпасныйГруз.Доступность = Истина;				
				КонецЕсли;
			//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
			ИначеЕсли Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.ТЭО И ОписаниеПоля.Имя = "Линия" Тогда
				Если ОписаниеПоля.Выводить Тогда
					УслугиГруппаДанныеЛинии = Элементы.УслугиГруппаДанныеЛинии;
					УслугиГруппаДанныеЛинии.Видимость = Элементы.УслугиПоказыватьДанныеЛинии.Пометка;
					Элементы.УслугиПоказыватьДанныеЛинии.Доступность = Истина;				
				КонецЕсли;
			//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025	
			ИначеЕсли Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.ТЭО И ОписаниеПоля.Имя = "УсловияИнкотермс" Тогда
				Если ОписаниеПоля.Выводить Тогда
					ГруппаУсловияПеревозкиОсновная = Элементы.УслугиГруппаУсловияПеревозкиОсновная;
					ГруппаУсловияПеревозкиОсновная.Видимость = Элементы.УслугиПоказыватьУсловияПеревозки.Пометка;
					Элементы.УслугиПоказыватьУсловияПеревозки.Доступность = Истина;				
				КонецЕсли;	
			КонецЕсли;
			//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
			Если ОписаниеПоля.Имя = "СтоимостьСНДС" Тогда
				//Поле включено в группу, поэтому перемещается и устанавливается видимость всей группы
				УслугиГруппаСтоимостьСНДС = Элементы.УслугиГруппаСтоимостьСНДС;
				Элементы.Переместить(УслугиГруппаСтоимостьСНДС, ГруппаЭлементовРодитель);
				УслугиГруппаСтоимостьСНДС.Заголовок = ОписаниеПоля.Представление;
				Если ОписаниеПоля.Выводить Тогда
					УслугиГруппаСтоимостьСНДС.Видимость = Истина;					
				КонецЕсли;
			ИначеЕсли ОписаниеПоля.Имя = "СтоимостьБезНДС" Тогда
				//Поле включено в группу, поэтому перемещается и устанавливается видимость всей группы
				УслугиГруппаСтоимостьБезНДС = Элементы.УслугиГруппаСтоимостьБезНДС;
				Элементы.Переместить(УслугиГруппаСтоимостьБезНДС, ГруппаЭлементовРодитель);
				УслугиГруппаСтоимостьБезНДС.Заголовок = ОписаниеПоля.Представление;
				Если ОписаниеПоля.Выводить Тогда
					УслугиГруппаСтоимостьБезНДС.Видимость = Истина;					
				КонецЕсли;	
			Иначе
				Элементы.Переместить(Элемент, ГруппаЭлементовРодитель);
			КонецЕсли;
			
			Элемент.Заголовок = ОписаниеПоля.Представление;
			Элемент.Видимость = ОписаниеПоля.Выводить;
			Элемент.ТолькоПросмотр = ОписаниеПоля.ТолькоПросмотр;
			
			Если Элемент.Вид = ВидПоляФормы.ПолеВвода Тогда
				
				Если ЗначениеЗаполнено(ОписаниеПоля.СписокВыбора) Тогда
					
					НастройкаПоля = НастройкиПолейПоУмолчанию.Получить(Элемент.Имя);
					Если НастройкаПоля = Неопределено Тогда
						НастройкиПолейПоУмолчанию.Вставить(Элемент.Имя, Новый Структура("СписокВыбора,ИсторияВыбораПриВводе,РедактированиеТекста,КнопкаВыбора,КнопкаСоздания",
								Элемент.СписокВыбора.ВыгрузитьЗначения(),
								Элемент.ИсторияВыбораПриВводе,
								Элемент.РедактированиеТекста,
								Элемент.КнопкаВыбора,
								Элемент.КнопкаСоздания));
					КонецЕсли;
					
					//Элемент.СписокВыбора.ЗагрузитьЗначения(ОписаниеПоля.СписокВыбора.ВыгрузитьЗначения());
					Элемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
					//Элемент.РедактированиеТекста = Ложь;
					//Элемент.КнопкаВыбора = Ложь;
					//Элемент.КнопкаСоздания = Ложь;
				Иначе
					
					НастройкаПоля = НастройкиПолейПоУмолчанию.Получить(Элемент.Имя);
					Если НастройкаПоля <> Неопределено Тогда
						Элемент.СписокВыбора.ЗагрузитьЗначения(НастройкаПоля.СписокВыбора);
						Элемент.ИсторияВыбораПриВводе = НастройкаПоля.ИсторияВыбораПриВводе;
						//Элемент.РедактированиеТекста = НастройкаПоля.РедактированиеТекста;
						//Элемент.КнопкаВыбора = НастройкаПоля.КнопкаВыбора;
						//Элемент.КнопкаСоздания = НастройкаПоля.КнопкаСоздания;
					КонецЕсли;
					
				КонецЕсли;
					
				Если ЗначениеЗаполнено(ОписаниеПоля.ОграничениеТипа) Тогда
					СтрокаТипы = СтрСоединить(ОписаниеПоля.ОграничениеТипа, ",");
					Элемент.ОграничениеТипа = Новый ОписаниеТипов(СтрокаТипы);
				Иначе
					Элемент.ОграничениеТипа = Новый ОписаниеТипов;
				КонецЕсли;
				
				ПараметрыВыбораПоля = Новый Массив;
				Если ЗначениеЗаполнено(ОписаниеПоля.ПараметрыВыбора) Тогда
					Для Каждого ПараметрВыбора Из ОписаниеПоля.ПараметрыВыбора Цикл
						НовыйПараметр = Новый ПараметрВыбора(ПараметрВыбора.ИмяПараметра, ПараметрВыбора.ЗначениеПараметра);
						ПараметрыВыбораПоля.Добавить(НовыйПараметр);
					КонецЦикла;
				КонецЕсли;
				Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораПоля);
				
				Если ОписаниеПоля.Обязательное Тогда
					Элемент.АвтоОтметкаНезаполненного = Истина;
				Иначе
					Элемент.АвтоОтметкаНезаполненного = Ложь;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;		
		
	КонецЦикла;
	
	Элементы.УслугиПоказыватьНормативы.Пометка = Элементы.УслугиПоказыватьНормативы.Доступность;
	Элементы.УслугиПоказыватьОпасныйГруз.Пометка = Элементы.УслугиПоказыватьОпасныйГруз.Доступность;
	Элементы.УслугиПоказыватьДанныеЛинии.Пометка = Элементы.УслугиПоказыватьДанныеЛинии.Доступность;
	Элементы.УслугиПоказыватьУсловияПеревозки.Пометка = Элементы.УслугиПоказыватьУсловияПеревозки.Доступность;
	Элементы.УслугиПоказыватьОсобыйТемпературныйРежим.Пометка = Элементы.УслугиПоказыватьОсобыйТемпературныйРежим.Доступность;
	Элементы.УслугиПоказыватьДанныеПоКонтейнерамВагонам.Пометка = Элементы.УслугиПоказыватьДанныеПоКонтейнерамВагонам.Доступность;
	
	Элементы.УслугиГруппаНормативы.Видимость = Элементы.УслугиПоказыватьНормативы.Пометка;
	Элементы.УслугиГруппаОпасныйГруз.Видимость = Элементы.УслугиПоказыватьОпасныйГруз.Пометка;
	Элементы.УслугиГруппаДанныеЛинии.Видимость = Элементы.УслугиПоказыватьДанныеЛинии.Пометка;
	Элементы.УслугиГруппаУсловияПеревозкиОсновная.Видимость = Элементы.УслугиПоказыватьУсловияПеревозки.Пометка;
	Элементы.УслугиГруппаОсобыйТемпературныйРежим.Видимость = Элементы.УслугиПоказыватьОсобыйТемпературныйРежим.Пометка;
	Элементы.УслугиГруппаДанныеПоКонтейнерамВагонам.Видимость = Элементы.УслугиПоказыватьДанныеПоКонтейнерамВагонам.Пометка;
	
	ПолеСпособВводаУчетныхЕдиниц = ПоляТаблицыУслуг.Найти("СпособВводаУчетныхЕдиниц");
	ПолеКонтейнерыВагоны = ПоляТаблицыУслуг.Найти("КонтейнерыВагоны");

	Если ПолеСпособВводаУчетныхЕдиниц <> Неопределено Тогда
		Если ПараметрыВидаУслуг.ТипУчетныхЕдиницДетализации = "" Тогда
			Элементы.УслугиВставитьСписокВагоновИзExcel.Видимость = Истина;
			Элементы.УслугиВставитьСписокКТКИзExcel.Видимость = Истина;
			Элементы.УслугиДетализацияПоНомерамКТКВагонов.Доступность = Истина;
		ИначеЕсли ПараметрыВидаУслуг.ТипУчетныхЕдиницДетализации = "СправочникСсылка.ТЕ" Тогда
			Элементы.УслугиВставитьСписокВагоновИзExcel.Видимость = Ложь;
			Элементы.УслугиВставитьСписокКТКИзExcel.Видимость = Истина;
			Элементы.УслугиДетализацияПоНомерамКТКВагонов.Доступность = Истина;
		ИначеЕсли ПараметрыВидаУслуг.ТипУчетныхЕдиницДетализации = "СправочникСсылка.ТС" Тогда
			Элементы.УслугиВставитьСписокВагоновИзExcel.Видимость = Истина;
			Элементы.УслугиВставитьСписокКТКИзExcel.Видимость = Ложь;
			Элементы.УслугиДетализацияПоНомерамКТКВагонов.Доступность = Истина;
		КонецЕсли;
	Иначе
		Элементы.УслугиВставитьСписокВагоновИзExcel.Видимость = Ложь;
		Элементы.УслугиВставитьСписокКТКИзExcel.Видимость = Ложь;
		Элементы.УслугиДетализацияПоНомерамКТКВагонов.Доступность = Ложь;			
	КонецЕсли;
	
	Элементы.УслугиНомерСтроки.ФиксацияВТаблице = ФиксацияВТаблице.Лево;
	Элементы.УслугиНаименованиеНоменклатурыПоставщика.ФиксацияВТаблице = ФиксацияВТаблице.Лево;
	Элементы.УслугиНоменклатураПоставщика.ФиксацияВТаблице = ФиксацияВТаблице.Лево;
	Элементы.УслугиНоменклатура.ФиксацияВТаблице = ФиксацияВТаблице.Лево;
	
	Если ЗначениеЗаполнено(АдресКэшаНастроекПолейПоУмолчанию) Тогда
		АдресКэшаНастроекПолейПоУмолчанию = ПоместитьВоВременноеХранилище(НастройкиПолейПоУмолчанию, АдресКэшаНастроекПолейПоУмолчанию);
	Иначе
		АдресКэшаНастроекПолейПоУмолчанию = ПоместитьВоВременноеХранилище(НастройкиПолейПоУмолчанию, Новый УникальныйИдентификатор);
	КонецЕсли;
	
	
	РеквизитыФормы = ЭтаФорма.ПолучитьРеквизиты("Объект.Услуги");
	МассивУдаляемых = Новый Массив;
	Для Каждого РеквизитФормы Из РеквизитыФормы Цикл
		ИмяРеквизита = РеквизитФормы.Имя;	
		Если ДинамическиСозданныеПоляТаблицыУслуги.НайтиПоЗначению(ИмяРеквизита) <> Неопределено Тогда
			МассивУдаляемых.Добавить("Объект.Услуги." + ИмяРеквизита);
		КонецЕсли;
	КонецЦикла;
	ЭтаФорма.ИзменитьРеквизиты( , МассивУдаляемых);
	
	ДинамическиСозданныеПоляТаблицыУслуги.Очистить();
	
	МассивРеквизитов = Новый Массив;
	Для каждого Условие Из ДопУсловияОтборов Цикл
		НовыйРеквизит = Новый РеквизитФормы(Условие.Имя + "Обязательное", Новый ОписаниеТипов("Булево"), "Объект.Услуги", Условие.Имя + "Обязательное");
		МассивРеквизитов.Добавить(НовыйРеквизит);
		ДинамическиСозданныеПоляТаблицыУслуги.Добавить(Условие.Имя + "Обязательное");
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементОтбора = ЭлементУсловногоОформления .Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Услуги."+ Условие.Имя + "Обязательное");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 		
		ЭлементОтбора.ПравоеЗначение = Истина;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора1 = ЭлементУсловногоОформления .Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора1.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Услуги."+ Условие.Имя);
		ЭлементОтбора1.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено; 		
		ЭлементОтбора1.Использование = Истина;
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного",Истина);
		ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Услуги" + Условие.Имя);
		ПолеОформления.Использование = Истина;
		
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементОтбора = ЭлементУсловногоОформления .Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Услуги." + Условие.Имя + "Обязательное");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 		
		ЭлементОтбора.ПравоеЗначение = Ложь;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора1 = ЭлементУсловногоОформления .Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора1.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Услуги."+ Условие.Имя);
		ЭлементОтбора1.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено; 		
		ЭлементОтбора1.Использование = Истина;
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного",Ложь);
		ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Услуги" + Условие.Имя);
		ПолеОформления.Использование = Истина;
		
	КонецЦикла;	
	ЭтаФорма.ИзменитьРеквизиты(МассивРеквизитов);	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовГруппы(ГруппаЭлементов, Видимость, Исключения)
	
	ТипГруппаФормы = Тип("ГруппаФормы");
	
	Для Каждого Элемент Из ГруппаЭлементов.ПодчиненныеЭлементы Цикл
		
		Если Исключения.Найти(Элемент.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(Элемент) = ТипГруппаФормы Тогда
			УстановитьВидимостьЭлементовГруппы(Элемент, Видимость, Исключения);
		КонецЕсли;
		
		Элемент.Видимость = Видимость;
		
	КонецЦикла;
	
КонецПроцедуры

//&НаСервере
//Процедура ОбновитьПредставлениеУчетныхЕдиницСтрокУслуг()
//	
//	Для Каждого СтрокаУслуги Из Объект.Услуги Цикл
//		ОбновитьПредставлениеУчетныхЕдиницСтрокиУслуг(СтрокаУслуги.ПолучитьИдентификатор());			
//	КонецЦикла;
//	
//КонецПроцедуры

&НаСервере
Процедура ОбновитьДинамическиеПоляТаблицыУслуг(СтрокиУслуг = Неопределено, ОбновитьСписочныеПоля = Ложь)
	
	КритерииУслугПоставщиковПустаяСсылка = Справочники.КритерииУслугПоставщиков.ПустаяСсылка();
	ТипоразмерыТЕПустаяСсылка = Справочники.ТипоразмерыТЕ.ПустаяСсылка();
	ТипоразмерыТСПустаяСсылка = Справочники.ТипоразмерыТС.ПустаяСсылка();
	ВидОтправкиПустаяСсылка = Перечисления.ВидыОтправок.ПустаяСсылка();
	КлючНормативнойСтавкиПустаяСсылка = Справочники.КлючиАналитикиСтрокПротокола.ПустаяСсылка();
	
	СостояниеГруженый = Перечисления.СостоянияКТК.Груженый;
	СостояниеПорожний = Перечисления.СостоянияКТК.Порожний;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Услуги.НомерСтроки КАК НомерСтроки,
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	Услуги.ПроверкаСтавок КАК ПроверкаСтавок,
	|	Услуги.ПунктОтправления КАК ПунктОтправления,
	|	Услуги.ПунктНазначения КАК ПунктНазначения,
	|	Услуги.ЛокацияОказанияУслуги КАК ЛокацияОказанияУслуги,
	|	Услуги.ГрузЕТСНГ КАК ГрузЕТСНГ,
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	|	Услуги.ПеревалкаПоПриему КАК ПеревалкаПоПриему,
	|	Услуги.ПеревалкаПоОтправлению КАК ПеревалкаПоОтправлению,
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	|	Услуги.ГрузГНГ КАК ГрузГНГ
	|ПОМЕСТИТЬ Услуги
	|ИЗ
	|	&Услуги КАК Услуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КритерииУслуг.НомерСтроки КАК НомерСтроки,
	|	КритерииУслуг.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	КритерииУслуг.Критерий КАК Критерий,
	|	КритерииУслуг.ТипоразмерКТК КАК ТипоразмерКТК,
	|	КритерииУслуг.ТипоразмерВагона КАК ТипоразмерВагона,
	|	КритерииУслуг.КлючНормативнойСтавки КАК КлючНормативнойСтавки,
	|	КритерииУслуг.ВидОтправки КАК ВидОтправки
	|ПОМЕСТИТЬ КритерииУслуг
	|ИЗ
	|	&КритерииУслуг КАК КритерииУслуг
	|;
	|////////////////////////////////////////////////////////////////////////////////
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Локации.Ссылка КАК Локация,
	|	ИерархияЛокаций.ЛокацияВышестоящегоУровня КАК Страна
	|ИЗ
	|	Справочник.Локации КАК Локации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
	|		ПО Локации.Ссылка = ИерархияЛокаций.Локация
	|			И (ИерархияЛокаций.ТипИерархии = &ТипИерархииСтрана)
	|ГДЕ
	|	Локации.Ссылка В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Услуги.ЛокацияОказанияУслуги КАК ЛокацияОказанияУслуги
	|			ИЗ
	|				Услуги КАК Услуги)
	|;
	|ВЫБРАТЬ
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	Услуги.ПеревалкаПоПриему КАК ПеревалкаПоПриему,
	|	Услуги.ПеревалкаПоОтправлению КАК ПеревалкаПоОтправлению,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВидыПеревалкиЭтапыПеревалки.НомерСтроки = 1
	|				ТОГДА ВидыПеревалкиЭтапыПеревалки.ТипЭтапа
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИе.ТипыЭтаповПеревалки.ПустаяСсылка)
	|		КОНЕЦ) КАК ПеревалкаПоПриемуАвто,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВидыПеревалкиЭтапыПеревалки.НомерСтроки = 2
	|				ТОГДА ВидыПеревалкиЭтапыПеревалки.ТипЭтапа
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИе.ТипыЭтаповПеревалки.ПустаяСсылка)
	|		КОНЕЦ) КАК ПеревалкаПоПриемуМоре,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВидыПеревалкиЭтапыПеревалки.НомерСтроки = 3
	|				ТОГДА ВидыПеревалкиЭтапыПеревалки.ТипЭтапа
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИе.ТипыЭтаповПеревалки.ПустаяСсылка)
	|		КОНЕЦ) КАК ПеревалкаПоПриемуСклад,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВидыПеревалкиЭтапыПеревалки.НомерСтроки = 4
	|				ТОГДА ВидыПеревалкиЭтапыПеревалки.ТипЭтапа
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИе.ТипыЭтаповПеревалки.ПустаяСсылка)
	|		КОНЕЦ) КАК ПеревалкаПоПриемуЖД,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВидыПеревалкиЭтапыПеревалки1.НомерСтроки = 1
	|				ТОГДА ВидыПеревалкиЭтапыПеревалки1.ТипЭтапа
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИе.ТипыЭтаповПеревалки.ПустаяСсылка)
	|		КОНЕЦ) КАК ПеревалкаПоОтправлениюАвто,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВидыПеревалкиЭтапыПеревалки1.НомерСтроки = 2
	|				ТОГДА ВидыПеревалкиЭтапыПеревалки1.ТипЭтапа
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИе.ТипыЭтаповПеревалки.ПустаяСсылка)
	|		КОНЕЦ) КАК ПеревалкаПоОтправлениюМоре,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВидыПеревалкиЭтапыПеревалки1.НомерСтроки = 3
	|				ТОГДА ВидыПеревалкиЭтапыПеревалки1.ТипЭтапа
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИе.ТипыЭтаповПеревалки.ПустаяСсылка)
	|		КОНЕЦ) КАК ПеревалкаПоОтправлениюСклад,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВидыПеревалкиЭтапыПеревалки1.НомерСтроки = 4
	|				ТОГДА ВидыПеревалкиЭтапыПеревалки1.ТипЭтапа
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИе.ТипыЭтаповПеревалки.ПустаяСсылка)
	|		КОНЕЦ) КАК ПеревалкаПоОтправлениюЖД
	|ИЗ
	|	Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыПеревалки.ЭтапыПеревалки КАК ВидыПеревалкиЭтапыПеревалки
	|		ПО Услуги.ПеревалкаПоПриему = ВидыПеревалкиЭтапыПеревалки.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыПеревалки.ЭтапыПеревалки КАК ВидыПеревалкиЭтапыПеревалки1
	|		ПО Услуги.ПеревалкаПоОтправлению = ВидыПеревалкиЭтапыПеревалки1.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Услуги.ИдентификаторСтрокиУслуг,
	|	Услуги.ПеревалкаПоПриему,
	|	Услуги.ПеревалкаПоОтправлению
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГоризонтальныеСвязиЛокаций.Терминал КАК Локация,
	|	ГоризонтальныеСвязиЛокаций.ЖДСтанция.ЖелезнаяДорога КАК ЖелезнаяДорога,
	|	ГоризонтальныеСвязиЛокаций.Порт КАК Порт,
	|	ИерархияЛокаций.ЛокацияВышестоящегоУровня КАК Страна
	|ИЗ
	|	РегистрСведений.ГоризонтальныеСвязиЛокаций КАК ГоризонтальныеСвязиЛокаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
	|		ПО ГоризонтальныеСвязиЛокаций.ЖДСтанция = ИерархияЛокаций.Локация
	|			И (ИерархияЛокаций.ТипИерархии = &ТипИерархииСтрана)
	|ГДЕ
	|	ГоризонтальныеСвязиЛокаций.Терминал В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Услуги.ЛокацияОказанияУслуги КАК ЛокацияОказанияУслуги
	|			ИЗ
	|				Услуги КАК Услуги)
	|	И ГоризонтальныеСвязиЛокаций.Терминал <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|	И ГоризонтальныеСвязиЛокаций.ЖДСтанция <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГоризонтальныеСвязиЛокаций.Терминал КАК Локация,
	|	ГоризонтальныеСвязиЛокаций.ЖДСтанция.ЖелезнаяДорога КАК ЖелезнаяДорога,
	|	ГоризонтальныеСвязиЛокаций.Порт КАК Порт,
	|	ИерархияЛокаций.ЛокацияВышестоящегоУровня КАК Страна
	|ИЗ
	|	РегистрСведений.ГоризонтальныеСвязиЛокаций КАК ГоризонтальныеСвязиЛокаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
	|		ПО ГоризонтальныеСвязиЛокаций.ЖДСтанция = ИерархияЛокаций.Локация
	|			И (ИерархияЛокаций.ТипИерархии = &ТипИерархииСтрана)
	|ГДЕ
	|	ГоризонтальныеСвязиЛокаций.Порт В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Услуги.ЛокацияОказанияУслуги КАК ЛокацияОказанияУслуги
	|			ИЗ
	|				Услуги КАК Услуги)
	|	И ГоризонтальныеСвязиЛокаций.Порт <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|	И ГоризонтальныеСвязиЛокаций.ЖДСтанция <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|;
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГоризонтальныеСвязиЛокаций.Терминал КАК Локация,
	|	ГоризонтальныеСвязиЛокаций.ЖДСтанция КАК ЖДСтанция
	|ИЗ
	|	РегистрСведений.ГоризонтальныеСвязиЛокаций КАК ГоризонтальныеСвязиЛокаций
	|ГДЕ
	|	ГоризонтальныеСвязиЛокаций.Терминал В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Услуги.ЛокацияОказанияУслуги КАК ЛокацияОказанияУслуги
	|			ИЗ
	|				Услуги КАК Услуги)
	|	И ГоризонтальныеСвязиЛокаций.Терминал <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|	И ГоризонтальныеСвязиЛокаций.ЖДСтанция <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГоризонтальныеСвязиЛокаций.Порт,
	|	ГоризонтальныеСвязиЛокаций.ЖДСтанция
	|ИЗ
	|	РегистрСведений.ГоризонтальныеСвязиЛокаций КАК ГоризонтальныеСвязиЛокаций
	|ГДЕ
	|	ГоризонтальныеСвязиЛокаций.Порт В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Услуги.ЛокацияОказанияУслуги КАК ЛокацияОказанияУслуги
	|			ИЗ
	|				Услуги КАК Услуги)
	|	И ГоризонтальныеСвязиЛокаций.Порт <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|	И ГоризонтальныеСвязиЛокаций.ЖДСтанция <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГоризонтальныеСвязиЛокаций.Терминал КАК Локация,
	|	ГоризонтальныеСвязиЛокаций.Порт КАК Порт
	|ИЗ
	|	РегистрСведений.ГоризонтальныеСвязиЛокаций КАК ГоризонтальныеСвязиЛокаций
	|ГДЕ
	|	ГоризонтальныеСвязиЛокаций.Терминал В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Услуги.ЛокацияОказанияУслуги КАК ЛокацияОказанияУслуги
	|			ИЗ
	|				Услуги КАК Услуги)
	|	И ГоризонтальныеСвязиЛокаций.Терминал <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|	И ГоризонтальныеСвязиЛокаций.Порт <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГоризонтальныеСвязиЛокаций.Терминал КАК Локация,
	|	ГоризонтальныеСвязиЛокаций.Порт КАК Порт
	|ИЗ
	|	РегистрСведений.ГоризонтальныеСвязиЛокаций КАК ГоризонтальныеСвязиЛокаций
	|ГДЕ
	|	ГоризонтальныеСвязиЛокаций.Порт В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Услуги.ЛокацияОказанияУслуги КАК ЛокацияОказанияУслуги
	|			ИЗ
	|				Услуги КАК Услуги)
	|	И ГоризонтальныеСвязиЛокаций.Терминал <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|	И ГоризонтальныеСвязиЛокаций.Порт <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|;
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Услуги.ПунктОтправления КАК Станция,
	|	ВЫБОР
	|		КОГДА МультилокацииЛокации.Локация.ЖелезнаяДорога <> &ДорогаПустаяСсылка
	|			ТОГДА МультилокацииЛокации.Локация.ЖелезнаяДорога.Наименование
	|		ИНАЧЕ МультилокацииЛокации.Локация.ЛокацияВышестоящегоУровня.ЖелезнаяДорога.Наименование
	|	КОНЕЦ КАК ЖелезнаяДорога,
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	|	ВЫБОР
	|		КОГДА МультилокацииЛокации.Локация.ЖелезнаяДорога <> &ДорогаПустаяСсылка
	|			ТОГДА МультилокацииЛокации.Локация.ЖелезнаяДорога
	|		ИНАЧЕ МультилокацииЛокации.Локация.ЛокацияВышестоящегоУровня.ЖелезнаяДорога
	|	КОНЕЦ КАК ЖелезнаяДорогаСсылка,
	|	МультилокацииЛокации.Локация КАК Локация
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025	
	|ИЗ
	|	Услуги КАК Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ПО Услуги.ПунктОтправления = МультилокацииЛокации.Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Услуги.ПунктОтправления,
	|	ВЫБОР
	|		КОГДА Локации.ЖелезнаяДорога <> &ДорогаПустаяСсылка
	|			ТОГДА Локации.ЖелезнаяДорога.Наименование
	|		ИНАЧЕ Локации.ЛокацияВышестоящегоУровня.ЖелезнаяДорога.Наименование
	|	КОНЕЦ,
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	|	ВЫБОР
	|		КОГДА Локации.ЖелезнаяДорога <> &ДорогаПустаяСсылка
	|			ТОГДА Локации.ЖелезнаяДорога
	|		ИНАЧЕ Локации.ЛокацияВышестоящегоУровня.ЖелезнаяДорога
	|	КОНЕЦ,
	|	Локации.Ссылка
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	|ИЗ
	|	Услуги КАК Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Локации КАК Локации
	|		ПО Услуги.ПунктОтправления = Локации.Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Услуги.ПунктНазначения,
	|	ВЫБОР
	|		КОГДА МультилокацииЛокации.Локация.ЖелезнаяДорога <> &ДорогаПустаяСсылка
	|			ТОГДА МультилокацииЛокации.Локация.ЖелезнаяДорога.Наименование
	|		ИНАЧЕ МультилокацииЛокации.Локация.ЛокацияВышестоящегоУровня.ЖелезнаяДорога.Наименование
	|	КОНЕЦ,
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	|	ВЫБОР
	|		КОГДА МультилокацииЛокации.Локация.ЖелезнаяДорога <> &ДорогаПустаяСсылка
	|			ТОГДА МультилокацииЛокации.Локация.ЖелезнаяДорога
	|		ИНАЧЕ МультилокацииЛокации.Локация.ЛокацияВышестоящегоУровня.ЖелезнаяДорога
	|	КОНЕЦ,
	|	МультилокацииЛокации.Локация
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	|ИЗ
	|	Услуги КАК Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ПО Услуги.ПунктНазначения = МультилокацииЛокации.Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Услуги.ПунктНазначения,
	|	ВЫБОР
	|		КОГДА Локации.ЖелезнаяДорога <> &ДорогаПустаяСсылка
	|			ТОГДА Локации.ЖелезнаяДорога.Наименование
	|		ИНАЧЕ Локации.ЛокацияВышестоящегоУровня.ЖелезнаяДорога.Наименование
	|	КОНЕЦ,
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	|	ВЫБОР
	|		КОГДА Локации.ЖелезнаяДорога <> &ДорогаПустаяСсылка
	|			ТОГДА Локации.ЖелезнаяДорога
	|		ИНАЧЕ Локации.ЛокацияВышестоящегоУровня.ЖелезнаяДорога
	|	КОНЕЦ,
	|	Локации.Ссылка
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	|ИЗ
	|	Услуги КАК Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Локации КАК Локации
	|		ПО Услуги.ПунктНазначения = Локации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	э_ЕТСНГ.Ссылка КАК Ссылка,
	|	э_ЕТСНГ.Код КАК Код
	|ИЗ
	|	Справочник.э_ЕТСНГ КАК э_ЕТСНГ
	|ГДЕ
	|	э_ЕТСНГ.Ссылка В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Услуги.ГрузЕТСНГ КАК ГрузЕТСНГ
	|			ИЗ
	|				Услуги КАК Услуги)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	э_ГНГ.Ссылка КАК Ссылка,
	|	э_ГНГ.КодГНГСтрокой КАК Код
	|ИЗ
	|	Справочник.э_ГНГ КАК э_ГНГ
	|ГДЕ
	|	э_ГНГ.Ссылка В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Услуги.ГрузГНГ КАК ГрузГНГ
	|			ИЗ
	|				Услуги КАК Услуги)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КритерииУслуг.НомерСтроки КАК НомерСтроки,
	|	КритерииУслуг.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	КритерииУслуг.Критерий КАК Критерий,
	|	КритерииУслуг.ТипоразмерКТК КАК ТипоразмерКТК,
	|	КритерииУслуг.ТипоразмерВагона КАК ТипоразмерВагона,
	|	ТипоразмерыТС.Код КАК ТипоразмерВагонаКод,
	|	КритерииУслуг.КлючНормативнойСтавки КАК КлючНормативнойСтавки,
	|	ПротоколСНормативнымиСтавкамиНаУслугиПоставщиковКритерииУслуг.Ссылка КАК ПротоколНормативныхСтавок,
	|	ПротоколСНормативнымиСтавкамиНаУслугиПоставщиковКритерииУслуг.Ссылка.Представление КАК ПредставлениеПротоколаНормативныхСтавок,
	|	ТипоразмерыТЕ.Представление КАК ПредставлениеТипоразмераКТК,
	|	Услуги.ПроверкаСтавок КАК ПроверкаСтавок,
	|	ПротоколСНормативнымиСтавкамиНаУслугиПоставщиковКритерииУслуг.Ссылка.Номер КАК НомерПротоколаНС,
	|	КритерииУслуг.ВидОтправки КАК ВидОтправки
	|ИЗ
	|	Услуги КАК Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КритерииУслуг КАК КритерииУслуг
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.КритерииУслуг КАК ПротоколСНормативнымиСтавкамиНаУслугиПоставщиковКритерииУслуг
	|			ПО КритерииУслуг.КлючНормативнойСтавки = ПротоколСНормативнымиСтавкамиНаУслугиПоставщиковКритерииУслуг.КлючАналитикиСтрокиПротокола
	|				И (КритерииУслуг.КлючНормативнойСтавки <> &КлючНормативнойСтавкиПустаяСсылка)
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипоразмерыТЕ КАК ТипоразмерыТЕ
	|			ПО КритерииУслуг.ТипоразмерКТК = ТипоразмерыТЕ.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипоразмерыТС КАК ТипоразмерыТС
	|			ПО КритерииУслуг.ТипоразмерВагона = ТипоразмерыТС.Ссылка
	|		ПО Услуги.ИдентификаторСтрокиУслуг = КритерииУслуг.ИдентификаторСтрокиУслуг";
	
	Если СтрокиУслуг <> Неопределено Тогда
		//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
		ТаблицаУслуг = Объект.Услуги.Выгрузить(СтрокиУслуг, "НомерСтроки, ИдентификаторСтрокиУслуг, ПроверкаСтавок, ПунктОтправления, ПунктНазначения, ЛокацияОказанияУслуги, ГрузЕТСНГ, ГрузГНГ,ПеревалкаПоПриему,ПеревалкаПоОтправлению");
		Услуги = СтрокиУслуг;
	Иначе
		//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
		ТаблицаУслуг = Объект.Услуги.Выгрузить(, "НомерСтроки, ИдентификаторСтрокиУслуг, ПроверкаСтавок, ПунктОтправления, ПунктНазначения, ЛокацияОказанияУслуги, ГрузЕТСНГ, ГрузГНГ,ПеревалкаПоПриему,ПеревалкаПоОтправлению");
		Услуги = Объект.Услуги;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Услуги", ТаблицаУслуг);
	
	ТаблицаКритерииУслуг = Объект.КритерииУслуг.Выгрузить();
	Запрос.УстановитьПараметр("КритерииУслуг", ТаблицаКритерииУслуг);
	
	Запрос.УстановитьПараметр("ДорогаПустаяСсылка", Справочники.ЖелезныеДороги.ПустаяСсылка());
	Запрос.УстановитьПараметр("КлючНормативнойСтавкиПустаяСсылка", КлючНормативнойСтавкиПустаяСсылка);
	Запрос.УстановитьПараметр("ТипИерархииСтрана", Перечисления.ТипыИерархииЛокации.Страна);
	
	Результаты = Запрос.ВыполнитьПакет();
	КоличествоРезультатов = Результаты.Количество();
	ТаблицаДорог = Результаты[КоличествоРезультатов - 4].Выгрузить();
	
	ГрузыЕТСНГ = Новый Соответствие;
	Выборка = Результаты[КоличествоРезультатов - 3].Выбрать();
	Пока Выборка.Следующий() Цикл
		ГрузыЕТСНГ.Вставить(Выборка.Ссылка, Выборка.Код);
	КонецЦикла;
	
	ГрузыГНГ = Новый Соответствие;
	Выборка = Результаты[КоличествоРезультатов - 2].Выбрать();
	Пока Выборка.Следующий() Цикл
		ГрузыГНГ.Вставить(Выборка.Ссылка, Выборка.Код);
	КонецЦикла;
	
	ТерминалыПорты = Результаты[КоличествоРезультатов - 5].Выгрузить();
	ТерминалыЖДСтанции = Результаты[КоличествоРезультатов - 6].Выгрузить();
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	ТерминалыЖелезныеДороги = Результаты[КоличествоРезультатов - 7].Выгрузить();
	ТерминалыПеревалок = Результаты[КоличествоРезультатов - 8].Выгрузить();
	ЛокацияСтрана = Результаты[КоличествоРезультатов - 9].Выгрузить();
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	
	ТаблицаШкалыСтавок = Объект.ШкалаСтавок.Выгрузить();
	ТаблицаШкалыСтавок.Индексы.Добавить("ИдентификаторСтрокиУслуг");
	
	//ТаблицаКритерииУслуг = Объект.КритерииУслуг.Выгрузить();
	ТаблицаКритериевУслуг = Результаты[КоличествоРезультатов - 1].Выгрузить();
	ТаблицаКритериевУслуг.Индексы.Добавить("ИдентификаторСтрокиУслуг");
	
	Для Каждого СтрокаУслуги Из Услуги Цикл		
		
		ЗначенияПолей = ОпредилитьОбязательностьЗаполненияПолейПоДопУсловиям(СтрокаУслуги); //Евросиб Шевченко А.В. US 83101 TA 122833 07.11.2025
		
		Для Каждого ОбязательноеПоле Из ЗначенияПолей Цикл
			СтрокаУслуги[ОбязательноеПоле.ИмяРек] = ОбязательноеПоле.Значение;
		КонецЦикла;	
		
		ОбновитьПредставлениеУчетныхЕдиницСтрокиУслуг(СтрокаУслуги);		
		
		//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
		сПоиска = Новый Структура("ИдентификаторСтрокиУслуг",СтрокаУслуги.ИдентификаторСтрокиУслуг);
		НайденныеСтроки = ТерминалыПеревалок.НайтиСтроки(сПоиска);
		Для Каждого нСтрока Из НайденныеСтроки Цикл
			ЗаполнитьЗначенияСвойств(СтрокаУслуги,нСтрока,,"ИдентификаторСтрокиУслуг,ПеревалкаПоПриему,ПеревалкаПоОтправлению") 	
		КонецЦикла;	
		//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
		
		СтрокаУслуги.ПунктОтправленияНазначения = СтрокаУслуги.ПунктОтправления;
		
		Если СтрокаУслуги.НормативНахожденияНаПогрузке > 0 Тогда
			Часов = Цел(СтрокаУслуги.НормативНахожденияНаПогрузке);
			Минут = СтрокаУслуги.НормативНахожденияНаПогрузке - Часов;		
			ЧасыМинутыСтрокой = ПолучитьЧасыМинутыНормыВремениСтрокой(Часов, Минут);		
		Иначе
			ЧасыМинутыСтрокой = "";
		КонецЕсли;
		
		СтрокаУслуги.НормаВремениНаПогрузкуВыгрузку = ЧасыМинутыСтрокой;
		
		Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Вагоны Тогда //Евросиб Шевченко А.В. US 123730 TA 125768 15.12.2025
			
			Если ЗначениеЗаполнено(СтрокаУслуги.ПунктОтправления) Тогда			
				Дороги = ТаблицаДорог.Скопировать(Новый Структура("Станция", СтрокаУслуги.ПунктОтправления));
				НаименованияДорог = Дороги.ВыгрузитьКолонку("ЖелезнаяДорога");
				
				НаименованияДорог = ОбщегоНазначенияКлиентСервер.СвернутьМассив(НаименованияДорог);
				
				//Евросиб Шевченко А.В. US 123730 TA 125768 15.12.2025
				ДорогиСсылки = Дороги.ВыгрузитьКолонку("ЖелезнаяДорогаСсылка");
				
				ДорогиСсылки = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ДорогиСсылки);
				
				СтрокаУслуги.ДорогиОтправления.ЗагрузитьЗначения(ДорогиСсылки);
				//Евросиб Шевченко А.В. US 123730 TA 125768 15.12.2025
				
				СтрокаДороги = СтрСоединить(НаименованияДорог, "; ");
				СтрокаУслуги.ДорогаОтправления = СтрокаДороги;
			Иначе
				//Евросиб Шевченко А.В. US 123730 TA 125768 15.12.2025
				СтрокаУслуги.ДорогиОтправления.Очистить();
				//Евросиб Шевченко А.В. US 123730 TA 125768 15.12.2025
				СтрокаУслуги.ДорогаОтправления = "";
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаУслуги.ПунктНазначения) Тогда
				Дороги = ТаблицаДорог.Скопировать(Новый Структура("Станция", СтрокаУслуги.ПунктНазначения));
				НаименованияДорог = Дороги.ВыгрузитьКолонку("ЖелезнаяДорога");
				НаименованияДорог = ОбщегоНазначенияКлиентСервер.СвернутьМассив(НаименованияДорог);
				СтрокаДороги = СтрСоединить(НаименованияДорог, "; ");
				СтрокаУслуги.ДорогаНазначения = СтрокаДороги;
				//Евросиб Шевченко А.В. US 123730 TA 125768 15.12.2025
				ДорогиСсылки = Дороги.ВыгрузитьКолонку("ЖелезнаяДорогаСсылка");
				ДорогиСсылки = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ДорогиСсылки);
				СтрокаУслуги.ДорогиНазначения.ЗагрузитьЗначения(ДорогиСсылки);
				//Евросиб Шевченко А.В. US 123730 TA 125768 15.12.2025
			Иначе
				//Евросиб Шевченко А.В. US 123730 TA 125768 15.12.2025
				СтрокаУслуги.ДорогиНазначения.Очистить();
				//Евросиб Шевченко А.В. US 123730 TA 125768 15.12.2025
				СтрокаУслуги.ДорогаНазначения = "";
			КонецЕсли;
			
		КонецЕсли;
		
		//Если ЗначениеЗаполнено(СтрокаУслуги.ТипоразмерВагона) Тогда
		//	СтрокаУслуги.ТипоразмерКТК_Вагона = СтрокаУслуги.ТипоразмерВагона;
		//ИначеЕсли ЗначениеЗаполнено(СтрокаУслуги.ТипоразмерКТК) Тогда
		//	СтрокаУслуги.ТипоразмерКТК_Вагона = СтрокаУслуги.ТипоразмерКТК;
		//Иначе
		//	СтрокаУслуги.ТипоразмерКТК_Вагона = Неопределено;
		//КонецЕсли;
		
		СтрокиШкалы = ТаблицаШкалыСтавок.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", СтрокаУслуги.ИдентификаторСтрокиУслуг));
		Если ЗначениеЗаполнено(СтрокиШкалы) Тогда
			УстановитьТекстСтавки(СтрокаУслуги, СтрокиШкалы);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаУслуги.ГрузЕТСНГ) Тогда
			СтрокаУслуги.ЕТСНГ = ГрузыЕТСНГ.Получить(СтрокаУслуги.ГрузЕТСНГ);
		Иначе
			СтрокаУслуги.ЕТСНГ = "";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаУслуги.ГрузГНГ) Тогда
			СтрокаУслуги.ГНГ = ГрузыГНГ.Получить(СтрокаУслуги.ГрузГНГ);
		Иначе
			СтрокаУслуги.ГНГ = 0;
		КонецЕсли;
			
		
		Если ЗначениеЗаполнено(СтрокаУслуги.ЛокацияОказанияУслуги) Тогда
			
			СтанцииЖД = ТерминалыЖДСтанции.Скопировать(Новый Структура("Локация", СтрокаУслуги.ЛокацияОказанияУслуги), "ЖДСтанция");
			СтанцииЖД = СтанцииЖД.ВыгрузитьКолонку("ЖДСтанция");
			СтрокаУслуги.СтанцииЖД = СтрСоединить(СтанцииЖД, ";");
			
			Порты = ТерминалыПорты.Скопировать(Новый Структура("Локация", СтрокаУслуги.ЛокацияОказанияУслуги), "Порт");
			Порты = Порты.ВыгрузитьКолонку("Порт");
			СтрокаУслуги.Порты = СтрСоединить(Порты, ";");
			
			//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
			Если ТипЗнч(СтрокаУслуги.ЛокацияОказанияУслуги) = Тип("СправочникСсылка.Локации") Тогда
				Если СтрокаУслуги.ЛокацияОказанияУслуги.Тип = Справочники.ТипыЛокаций.Порт Тогда
					Терминал = ТерминалыПорты.Скопировать(Новый Структура("Порт", СтрокаУслуги.ЛокацияОказанияУслуги), "Локация");
					Терминал = Терминал.ВыгрузитьКолонку("Локация");
					СтрокаУслуги.Терминал = СтрСоединить(Терминал, ";");
				КонецЕсли;
			КонецЕсли;
			//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
			
			Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Порты ИЛИ Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Терминалы Тогда
				ЖелезныеДороги = Новый Массив;
				НайденныеСтроки = Новый Массив;
				Если ТипЗнч(СтрокаУслуги.ЛокацияОказанияУслуги) = Тип("СправочникСсылка.Локации") Тогда
					НайденныеСтрокиСтраны = ЛокацияСтрана.НайтиСтроки(Новый Структура("Локация", СтрокаУслуги.ЛокацияОказанияУслуги));
					Если СтрокаУслуги.ЛокацияОказанияУслуги.Тип = Справочники.ТипыЛокаций.Порт Тогда
						НайденныеСтроки = ТерминалыЖелезныеДороги.НайтиСтроки(Новый Структура("Порт", СтрокаУслуги.ЛокацияОказанияУслуги));
					КонецЕсли;
					Если СтрокаУслуги.ЛокацияОказанияУслуги.Тип = Справочники.ТипыЛокаций.Терминал Тогда
						НайденныеСтроки = ТерминалыЖелезныеДороги.НайтиСтроки(Новый Структура("Локация", СтрокаУслуги.ЛокацияОказанияУслуги));
					КонецЕсли;
					
					
					Для Каждого Стр Из НайденныеСтрокиСтраны Цикл
						ЭтоРОССИЯ = Ложь;
						Если Стр.Страна = Справочники.Локации.РОССИЯ Тогда
							ЭтоРОССИЯ = Истина;	
						КонецЕсли;
						Страна = Стр.Страна;
					КонецЦикла;	
					
					Для Каждого Стр Из НайденныеСтроки Цикл
						Если ЭтоРОССИЯ Тогда
							Если ЖелезныеДороги.Найти(Стр.ЖелезнаяДорога) = Неопределено Тогда
								ЖелезныеДороги.Добавить(Стр.ЖелезнаяДорога);
							КонецЕсли;
						КонецЕсли;	
					КонецЦикла;	
					
					Если НЕ ЭтоРОССИЯ Тогда
						ЖелезныеДороги.Очистить();
						ЖелезныеДороги.Добавить(Страна);
					КонецЕсли;	
					
					СтрокаУслуги.ЖелезнаяДорога = СтрСоединить(ЖелезныеДороги, ";");
					
					//Евросиб Шевченко А.В. US 123730 TA 125768 15.12.2025
					СтрокаУслуги.ЖелезныеДороги.ЗагрузитьЗначения(ЖелезныеДороги);
					//Евросиб Шевченко А.В. US 123730 TA 125768 15.12.2025
				КонецЕсли;
			КонецЕсли;
			//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
		Иначе
			
			//Евросиб Шевченко А.В. US 123730 TA 125768 15.12.2025
			СтрокаУслуги.ЖелезныеДороги.Очистить();
			//Евросиб Шевченко А.В. US 123730 TA 125768 15.12.2025
			
			СтрокаУслуги.СтанцииЖД = "";
			СтрокаУслуги.Порты = "";
			СтрокаУслуги.ЖелезнаяДорога = "";
			
		КонецЕсли;
		
		//Евросиб Шевченко А.В. US 124811 TA 129059 13.03.2026
		Если ОбновитьСписочныеПоля Тогда
			Если ЗначениеЗаполнено(СтрокаУслуги.МультизначениеКлассыОпасности) Тогда
				СтрокаУслуги.КлассыОпасности.ЗагрузитьЗначения(СтрокаУслуги.МультизначениеКлассыОпасности.Список.ВыгрузитьКолонку("Значение"));
			КонецЕсли;
		КонецЕсли;		
		ОбработатьИзмененияКлассыОпасностиСтрокиУслуг(СтрокаУслуги); 
		//Евросиб Шевченко А.В. US 124811 TA 129059 13.03.2026
		
		СтрокаУслуги.КлючиНормативныхСтавок.Очистить();		
		ПредставленияНормативныхСтавок = Новый Массив;
		ТаблицаКритериевПоСтрокеУслуги = ТаблицаКритериевУслуг.Скопировать(Новый Структура("ИдентификаторСтрокиУслуг", СтрокаУслуги.ИдентификаторСтрокиУслуг));
		Если ЗначениеЗаполнено(ТаблицаКритериевПоСтрокеУслуги) Тогда
			
			Если ОбновитьСписочныеПоля Тогда
				
				Критерии = ТаблицаКритериевПоСтрокеУслуги.ВыгрузитьКолонку("Критерий");
				Критерии = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Критерии);
				ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(Критерии, КритерииУслугПоставщиковПустаяСсылка);
				СтрокаУслуги.Критерии.ЗагрузитьЗначения(Критерии);
				СтрокаУслуги.КритерииСтрокой = СтрСоединить(Критерии, Символы.ПС);
				
				ТипоразмерыКТК = ТаблицаКритериевПоСтрокеУслуги.ВыгрузитьКолонку("ТипоразмерКТК");
				ТипоразмерыКТК = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТипоразмерыКТК);
				ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(ТипоразмерыКТК, ТипоразмерыТЕПустаяСсылка);
				СтрокаУслуги.ТипоразмерыКТК.ЗагрузитьЗначения(ТипоразмерыКТК);
				СтрокаУслуги.ТипоразмерыКТКСтрокой = СтрСоединить(ТипоразмерыКТК, "; ");
				
				ТаблицаТипоразмерыВагонов = ТаблицаКритериевПоСтрокеУслуги.Скопировать(, "ТипоразмерВагона, ТипоразмерВагонаКод");
				ТаблицаТипоразмерыВагонов.Свернуть("ТипоразмерВагона, ТипоразмерВагонаКод");
				ПустыеСтроки = ТаблицаТипоразмерыВагонов.НайтиСтроки(Новый Структура("ТипоразмерВагона", ТипоразмерыТСПустаяСсылка));
				Для Каждого Стр Из ПустыеСтроки Цикл
					ТаблицаТипоразмерыВагонов.Удалить(Стр);
				КонецЦикла;
				ТаблицаТипоразмерыВагонов.Сортировать("ТипоразмерВагонаКод");
				ТипоразмерыВагонов = ТаблицаТипоразмерыВагонов.ВыгрузитьКолонку("ТипоразмерВагона");
				СтрокаУслуги.ТипоразмерыВагонов.ЗагрузитьЗначения(ТипоразмерыВагонов);
				СтрокаУслуги.ТипоразмерыВагоновСтрокой = СтрСоединить(ТаблицаТипоразмерыВагонов.ВыгрузитьКолонку("ТипоразмерВагонаКод"), "; ");
				Если ТипоразмерыВагонов.Количество() = 1 Тогда
					СтрокаУслуги.ТипоразмерВагона = ТипоразмерыВагонов[0];
				Иначе
					СтрокаУслуги.ТипоразмерВагона = ТипоразмерыТСПустаяСсылка;
				КонецЕсли;
				
				ВидыОтправок = ТаблицаКритериевПоСтрокеУслуги.ВыгрузитьКолонку("ВидОтправки");
				ВидыОтправок = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ВидыОтправок);
				ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(ВидыОтправок, ВидОтправкиПустаяСсылка);
				СтрокаУслуги.ВидыОтправок.ЗагрузитьЗначения(ВидыОтправок);
				СтрокаУслуги.ВидыОтправокСтрокой = СтрСоединить(ВидыОтправок, "; ");
				
				СостоянияГруженыйПорожний = Новый Массив;
				Если СтрокаУслуги.ДляГруженых Тогда
					СостоянияГруженыйПорожний.Добавить(СостояниеГруженый);
				КонецЕсли;				
				Если СтрокаУслуги.ДляПорожних Тогда
					СостоянияГруженыйПорожний.Добавить(СостояниеПорожний);
				КонецЕсли;
				СтрокаУслуги.СостоянияГруженыйПорожний.ЗагрузитьЗначения(СостоянияГруженыйПорожний);
				СтрокаУслуги.СостоянияГруженыйПорожнийСтрокой = СтрСоединить(СостоянияГруженыйПорожний, "; ");
				
				////Евросиб Шевченко А.В. US 123730 TA 125768 15.12.2025
				//ДорогиОтправления = ТаблицаКритериевПоСтрокеУслуги.ВыгрузитьКолонку("ДорогаОтправления");
				//ДорогиОтправления = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ДорогиОтправления);
				//ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(ДорогиОтправления, Справочники.ЖелезныеДороги.ПустаяСсылка());
				//СтрокаУслуги.ДорогиОтправления.ЗагрузитьЗначения(ДорогиОтправления);
				//СтрокаУслуги.ДорогаОтправления = СтрСоединить(ДорогиОтправления, "; ");
				//
				//ЖелезныеДороги = ТаблицаКритериевПоСтрокеУслуги.ВыгрузитьКолонку("ЖелезнаяДорога");
				//ЖелезныеДороги = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ЖелезныеДороги);
				//ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(ЖелезныеДороги, Справочники.ЖелезныеДороги.ПустаяСсылка());
				//ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(ЖелезныеДороги, Справочники.СтраныМира.ПустаяСсылка());
				//СтрокаУслуги.ЖелезныеДороги.ЗагрузитьЗначения(ЖелезныеДороги);
				//СтрокаУслуги.ДорогаОтправления = СтрСоединить(ЖелезныеДороги, "; ");
				//
				//ДорогиНазначения = ТаблицаКритериевПоСтрокеУслуги.ВыгрузитьКолонку("ДорогаНазначения");
				//ДорогиНазначения = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ДорогиНазначения);
				//ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(ДорогиНазначения, Справочники.ЖелезныеДороги.ПустаяСсылка());
				//СтрокаУслуги.ДорогиНазначения.ЗагрузитьЗначения(ДорогиНазначения);
				//СтрокаУслуги.ЖелезнаяДорога = СтрСоединить(ДорогиНазначения, "; ");
				////Евросиб Шевченко А.В. US 123730 TA 125768 15.12.2025
				
			КонецЕсли;
			
			Для Каждого Стр Из ТаблицаКритериевПоСтрокеУслуги Цикл
				Если ЗначениеЗаполнено(Стр.КлючНормативнойСтавки) Тогда
					
					Если ЗначениеЗаполнено(Стр.ПредставлениеТипоразмераКТК) Тогда
						ПредставлениеЭлемента = СтрШаблон("НС для %1 (Протокол:%2)", Стр.ПредставлениеТипоразмераКТК, Стр.НомерПротоколаНС);						
					Иначе
						ПредставлениеЭлемента = СтрШаблон("НС (Протокол:%2)", Стр.НомерПротоколаНС);
					КонецЕсли;
					
					СтрокаУслуги.КлючиНормативныхСтавок.Добавить(Стр.КлючНормативнойСтавки, ПредставлениеЭлемента);
					ПредставленияНормативныхСтавок.Добавить(ПредставлениеЭлемента);
					
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		Для Каждого ЭлементСписка Из СтрокаУслуги.КлючиНеподошедшихНормативныхСтавок Цикл
			ПредставленияНормативныхСтавок.Добавить(ЭлементСписка.Представление);
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ПредставленияНормативныхСтавок) Тогда
			СтрокаУслуги.КлючиНормативныхСтавокСтрокой = СтрСоединить(ПредставленияНормативныхСтавок, "; ");
		Иначе
			СтрокаУслуги.КлючиНормативныхСтавокСтрокой = "";
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьГруппуПротоколовНормативныхСтавок()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	Услуги.ПроверкаСтавок КАК ПроверкаСтавок
	|ПОМЕСТИТЬ Услуги
	|ИЗ
	|	&Услуги КАК Услуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КритерииУслуг.НомерСтроки КАК НомерСтроки,
	|	КритерииУслуг.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	КритерииУслуг.Критерий КАК Критерий,
	|	КритерииУслуг.ТипоразмерКТК КАК ТипоразмерКТК,
	|	КритерииУслуг.КлючНормативнойСтавки КАК КлючНормативнойСтавки
	|ПОМЕСТИТЬ КритерииУслуг
	|ИЗ
	|	&КритерииУслуг КАК КритерииУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КритерииУслуг.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	КритерииУслуг.Критерий КАК Критерий,
	|	КритерииУслуг.ТипоразмерКТК КАК ТипоразмерКТК,
	|	КритерииУслуг.КлючНормативнойСтавки КАК КлючНормативнойСтавки,
	|	ПротоколСНормативнымиСтавкамиНаУслугиПоставщиковКритерииУслуг.Ссылка КАК ПротоколНормативныхСтавок,
	|	ПротоколСНормативнымиСтавкамиНаУслугиПоставщиковКритерииУслуг.Ссылка.Представление КАК ПредставлениеПротоколаНормативныхСтавок,
	|	Услуги.ПроверкаСтавок КАК ПроверкаСтавок
	|ИЗ
	|	Услуги КАК Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КритерииУслуг КАК КритерииУслуг
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.КритерииУслуг КАК ПротоколСНормативнымиСтавкамиНаУслугиПоставщиковКритерииУслуг
	|			ПО КритерииУслуг.КлючНормативнойСтавки = ПротоколСНормативнымиСтавкамиНаУслугиПоставщиковКритерииУслуг.КлючАналитикиСтрокиПротокола
	|				И (КритерииУслуг.КлючНормативнойСтавки <> &КлючНормативнойСтавкиПустаяСсылка)
	|		ПО Услуги.ИдентификаторСтрокиУслуг = КритерииУслуг.ИдентификаторСтрокиУслуг";
	
	ТаблицаУслуг = Объект.Услуги.Выгрузить(Новый Структура("ПроверкаСтавок", Перечисления.РезультатыПроверки.Пройдена), "ИдентификаторСтрокиУслуг, ПроверкаСтавок");	
	Запрос.УстановитьПараметр("Услуги", ТаблицаУслуг);
	
	ТаблицаКритериевУслуг = Объект.КритерииУслуг.Выгрузить();
	Запрос.УстановитьПараметр("КритерииУслуг", ТаблицаКритериевУслуг);
	
	Запрос.УстановитьПараметр("КлючНормативнойСтавкиПустаяСсылка", Справочники.КлючиАналитикиСтрокПротокола.ПустаяСсылка());
	
	ТаблицаКритериевУслуг = Запрос.Выполнить().Выгрузить();
	
	//Сначала получаем массив удаляемых элементов, а потом удаляем их. После удаления непосредственным обходом Подчиненных элементов, оставались подчиненные элементы
	УдаляемыеЭлементы = Новый Массив;
	Для Каждого ЭлементСсылкаНаПротоколНормативныхСтавок Из Элементы.ГруппаПротоколыНормативныхСтавок.ПодчиненныеЭлементы Цикл
		УдаляемыеЭлементы.Добавить(ЭлементСсылкаНаПротоколНормативныхСтавок);
	КонецЦикла;	
	Для Каждого УдаляемыйЭлемент Из УдаляемыеЭлементы Цикл
		Элементы.Удалить(УдаляемыйЭлемент);
	КонецЦикла;
	
	ТаблицаКритериевУслуг.Свернуть("ПротоколНормативныхСтавок, ПредставлениеПротоколаНормативныхСтавок");
	Для Каждого Стр Из ТаблицаКритериевУслуг Цикл
		Если ЗначениеЗаполнено(Стр.ПротоколНормативныхСтавок) Тогда
			ГУИД = Строка(Стр.ПротоколНормативныхСтавок.УникальныйИдентификатор());
			ИмяЭлемента = "СсылкаНаПротокол" + СтрЗаменить(ГУИД, "-", "_");
			ЭлементСсылкаНаПротоколНормативныхСтавок = Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), Элементы.ГруппаПротоколыНормативныхСтавок);
			ЭлементСсылкаНаПротоколНормативныхСтавок.Вид = ВидДекорацииФормы.Надпись;
			ЭлементСсылкаНаПротоколНормативныхСтавок.АвтоМаксимальнаяШирина = Ложь;
			ЭлементСсылкаНаПротоколНормативныхСтавок.Заголовок = Новый ФорматированнаяСтрока(Стр.ПредставлениеПротоколаНормативныхСтавок,,,, ПолучитьНавигационнуюСсылку(Стр.ПротоколНормативныхСтавок));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДинамическиеПоляТаблицыУслугПоСтроке(ТекДанные, ОбновитьСписочныеПоля = Ложь)
	
	СтрокиУслуг = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекДанные);
	ОбновитьДинамическиеПоляТаблицыУслуг(СтрокиУслуг, ОбновитьСписочныеПоля);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставлениеУчетныхЕдиницСтрокиУслуг(СтрокаТЧ, ОбновитьСписокУчетныхЕдиниц = Истина)
	
	ПараметрыПоиска = Новый Структура("ИдентификаторСтрокиУслуг", СтрокаТЧ.ИдентификаторСтрокиУслуг);
	СтрокиУчетныхЕдиниц = Объект.УчетныеЕдиницы.НайтиСтроки(ПараметрыПоиска);
	ТаблицаУчетныхЕдиницыПоУслуге = Объект.УчетныеЕдиницы.Выгрузить(СтрокиУчетныхЕдиниц, "УчетнаяЕдиница");
	
	Если ОбновитьСписокУчетныхЕдиниц Тогда
		СтрокиСписка = СписокУчетныхЕдиниц.НайтиСтроки(ПараметрыПоиска);
		Для Каждого Стр Из СтрокиСписка Цикл
			СписокУчетныхЕдиниц.Удалить(Стр);
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТаблицаУчетныхЕдиницыПоУслуге) Тогда
		
		УчетныеЕдиницы = ТаблицаУчетныхЕдиницыПоУслуге.ВыгрузитьКолонку("УчетнаяЕдиница");
		СтрокаСписокУчетныхЕдиниц = СтрСоединить(УчетныеЕдиницы, ",");
		СтрокаТЧ.КонтейнерыВагоны = СтрокаСписокУчетныхЕдиниц;
		ТипЗначения = ТипЗнч(УчетныеЕдиницы[0]);
		Если ТипЗначения = Тип("СправочникСсылка.ТС") Тогда
			СтрокаТЧ.ТипУчетныхЕдиниц = "СправочникСсылка.ТС";
		ИначеЕсли ТипЗначения = Тип("СправочникСсылка.ТЕ") Тогда
			СтрокаТЧ.ТипУчетныхЕдиниц = "СправочникСсылка.ТЕ";
		Иначе
			СтрокаТЧ.ТипУчетныхЕдиниц = "";
		КонецЕсли;
		
		Если ОбновитьСписокУчетныхЕдиниц Тогда
			Если СтрокаТЧ.СпособВводаУчетныхЕдиниц = Перечисления.СпособыВводаУчетныхЕдиниц.Построчно Тогда
				Для Каждого Стр Из СтрокиУчетныхЕдиниц Цикл
					НоваяСтрока = СписокУчетныхЕдиниц.Добавить();
					НоваяСтрока.ИдентификаторСтрокиУслуг = СтрокаТЧ.ИдентификаторСтрокиУслуг;
					НоваяСтрока.ИдентификаторСтрокиТаблицыУчЕдиниц = Стр.ПолучитьИдентификатор();
					НоваяСтрока.УчетнаяЕдиницаСсылка = Стр.УчетнаяЕдиница;
					НоваяСтрока.УчетнаяЕдиница = Стр.УчетнаяЕдиница;
				КонецЦикла;
			ИначеЕсли СтрокаТЧ.СпособВводаУчетныхЕдиниц = Перечисления.СпособыВводаУчетныхЕдиниц.Списком Тогда
				НоваяСтрока = СписокУчетныхЕдиниц.Добавить();
				НоваяСтрока.ИдентификаторСтрокиУслуг = СтрокаТЧ.ИдентификаторСтрокиУслуг;
				НоваяСтрока.ИдентификаторСтрокиТаблицыУчЕдиниц = -1;
				НоваяСтрока.УчетнаяЕдиница = СтрокаСписокУчетныхЕдиниц;
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		СтрокаТЧ.КонтейнерыВагоны = "";
		СтрокаТЧ.ТипУчетныхЕдиниц = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыВидаУслуг.ТипУчетныхЕдиницДетализации) Тогда
		СтрокаТЧ.ТипУчетныхЕдиниц = ПараметрыВидаУслуг.ТипУчетныхЕдиницДетализации;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТЧ.ТипУчетныхЕдиниц) Тогда		
		Элементы.СписокУчетныхЕдиницУчетнаяЕдиницаСсылка.ОграничениеТипа = Новый ОписаниеТипов(СтрокаТЧ.ТипУчетныхЕдиниц);
	Иначе
		Элементы.СписокУчетныхЕдиницУчетнаяЕдиницаСсылка.ОграничениеТипа = Новый ОписаниеТипов();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокГруппыСторонаОрганизации()
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Элементы.ГруппаСторонаОрганизации.Заголовок = СтрШаблон("Сторона %1", ПолучитьНаименованиеГоловнойОрганизации(Объект.Организация));
	Иначе
		Элементы.ГруппаСторонаОрганизации.Заголовок = "Сторона организации";
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНаименованиеГоловнойОрганизации(Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Организации.ГоловнаяОрганизация.Наименование, Организации.Наименование) КАК Наименование
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка = &Организация";
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		НаименованиеОрганизации = Выборка.Наименование;
	Иначе
		НаименованиеОрганизации = "";
	КонецЕсли;
	
	Возврат НаименованиеОрганизации;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверкаГруппыДоступа(НаименованиеГруппыДоступа)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрофилиГруппДоступа.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Профиль
		|ИЗ
		|	Справочник.ПрофилиГруппДоступа КАК ПрофилиГруппДоступа
		|ГДЕ
		|	ПрофилиГруппДоступа.Наименование = &Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГруппыДоступа.Ссылка КАК Ссылка1,
		|	ГруппыДоступаПользователи.Пользователь КАК Пользователь
		|ИЗ
		|	ВТ_Профиль КАК ВТ_Профиль
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа КАК ГруппыДоступа
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		|			ПО ГруппыДоступа.Ссылка = ГруппыДоступаПользователи.Ссылка
		|		ПО (ГруппыДоступа.Профиль = ВТ_Профиль.Ссылка)
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(ГруппыДоступаПользователи.Пользователь) <> ЗНАЧЕНИЕ(Справочник.ГруппыПользователей)
		|	И НЕ ГруппыДоступаПользователи.Пользователь ЕСТЬ NULL
		|	И ГруппыДоступаПользователи.Пользователь = &Пользователь
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ГруппыДоступа.Ссылка,
		|	ГруппыПользователейСостав.Пользователь
		|ИЗ
		|	ВТ_Профиль КАК ВТ_Профиль
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа КАК ГруппыДоступа
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
		|				ПО ГруппыДоступаПользователи.Пользователь = ГруппыПользователейСостав.Ссылка
		|			ПО ГруппыДоступа.Ссылка = ГруппыДоступаПользователи.Ссылка
		|		ПО (ГруппыДоступа.Профиль = ВТ_Профиль.Ссылка)
		|ГДЕ
		|	НЕ ГруппыПользователейСостав.Пользователь ЕСТЬ NULL
		|	И ГруппыПользователейСостав.Пользователь = &Пользователь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_Профиль";
	
	Запрос.УстановитьПараметр("Наименование", НаименованиеГруппыДоступа);
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	КонецЕсли;	
	
	Возврат Ложь;
	
КонецФункции 

&НаСервереБезКонтекста
Функция ПроверкаНаПрикрепленные(ТекДок)
	
	ЕстьПрикрепленные = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Файлы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Файлы КАК Файлы
	               |ГДЕ
	               |	Файлы.ВладелецФайла = &ВладелецФайла
				   //Евросиб Каблов 26.06.2020 ( Ticket#0197685
				   |	И НЕ Файлы.ПометкаУдаления";
				   //Евросиб Каблов 26.06.2020 )
	Запрос.УстановитьПараметр("ВладелецФайла",ТекДок);
	Если Запрос.Выполнить().Пустой() Тогда
		ЕстьПрикрепленные = Ложь;
	КонецЕсли;
	
	Возврат ЕстьПрикрепленные;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоСогласование(Состояние)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Состояние, "Согласование");
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	// Евросиб US 89887 TA 89889 Рыбьяков К.А. 21.11.2024 ((
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ЭтаФорма.Прочитать();
		Возврат;
	КонецЕсли;
	
	МОбъект = Объект;
	
	Если ЕстьОшибкиВСтрокахПСЦ(МОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Вставить("ВопросУжеБылЗадан", Истина);
	Записать(Параметры);
	// Евросиб Рыбьяков К.А. 21.11.2024 ))
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьОшибкиВСтрокахПСЦ(ДокументОбъект, Отказ = Ложь)
	
	ПредоставлениеКонтейнеров = Справочники.Номенклатура.ПредоставлениеКТК;
	
	НайденныеСтроки = ДокументОбъект.Услуги.НайтиСтроки(Новый Структура("Номенклатура", ПредоставлениеКонтейнеров));
	Если НайденныеСтроки.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'В табличной части отсутствует номенклатура ""Предоставление контейнера"".'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	
	СтрокиСОшибками = Новый Массив;
	Для Каждого СтрокаУслуг Из ДокументОбъект.Услуги Цикл
		Если СтрокаУслуг.Номенклатура <> ПредоставлениеКонтейнеров Тогда
			Продолжить;
		КонецЕсли;
		Отбор = Новый Структура;
		Отбор.Вставить("ИдентификаторСтрокиУслуг", СтрокаУслуг.ИдентификаторСтрокиУслуг);
		НайденныеУчетныеЕдиницы = ДокументОбъект.УчетныеЕдиницы.НайтиСтроки(Отбор);
		Для Каждого СтрокаУчетныхЕдиниц Из НайденныеУчетныеЕдиницы Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("ИдентификаторСтрокиУслуг", СтрокаУчетныхЕдиниц.ИдентификаторСтрокиУслуг);
			Отбор.Вставить("ТипоразмерКТК", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаУчетныхЕдиниц.УчетнаяЕдиница, "ТипТЕ"));
			НайденныеТипоразмеры = ДокументОбъект.КритерииУслуг.НайтиСтроки(Отбор);
			Если НайденныеТипоразмеры.Количество() = 0 Тогда
				СтрокиСОшибками.Добавить("№" + СтрокаУслуг.НомерСтроки);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	СтрокиСОшибками = ОбщегоНазначенияКлиентСервер.СвернутьМассив(СтрокиСОшибками);
	Документы.РелизСобственника.СортироватьМассив(СтрокиСОшибками);
	
	Если СтрокиСОшибками.Количество() > 0 Тогда
		НомераСтрок = СтрСоединить(СтрокиСОшибками, ", ");
		Текст = СтрШаблон(НСтр("ru = 'Невозможно создать релиз собственника, т.к. отличаются типоразмеры КТК по строке %1 с данными КТК в детализации'"), 
			НомераСтрок);
		ОбщегоНазначения.СообщитьПользователю(Текст,,,, Отказ);
	КонецЕсли;
	
	СтрокиСОшибками.Очистить();
	Для Каждого СтрокаУслуг Из ДокументОбъект.Услуги Цикл
		Если СтрокаУслуг.Номенклатура <> ПредоставлениеКонтейнеров Тогда
			Продолжить;
		КонецЕсли;
		ТипоразмерыСтроки = СтрокаУслуг.ТипоразмерыКТК;
		Если ТипоразмерыСтроки.Количество() > 1 Тогда
			СтрокиСОшибками.Добавить("№" + СтрокаУслуг.НомерСтроки);
		КонецЕсли;
		//Отбор = Новый Структура;
		//Отбор.Вставить("ИдентификаторСтрокиУслуг", СтрокаУслуг.ИдентификаторСтрокиУслуг);
		//НайденныеТипоразмеры = ДокументОбъект.КритерииУслуг.НайтиСтроки(Отбор);
		//Если НайденныеТипоразмеры.Количество() > 1 Тогда
		//	СтрокиСОшибками.Добавить("№" + СтрокаУслуг.НомерСтроки);
		//КонецЕсли;
	КонецЦикла;
	
	СтрокиСОшибками = ОбщегоНазначенияКлиентСервер.СвернутьМассив(СтрокиСОшибками);
	Документы.РелизСобственника.СортироватьМассив(СтрокиСОшибками);
	
	Если СтрокиСОшибками.Количество() > 0 Тогда
		НомераСтрок = СтрСоединить(СтрокиСОшибками, ", ");
		Текст = СтрШаблон(НСтр("ru = 'Невозможно создать релиз собственника, указаны разные типоразмеры по строке %1'"), 
			НомераСтрок);
		ОбщегоНазначения.СообщитьПользователю(Текст,,,, Отказ);
	КонецЕсли;

	СтрокиСОшибками.Очистить();
	Для Каждого СтрокаУслуг Из ДокументОбъект.Услуги Цикл
		Если СтрокаУслуг.Номенклатура <> ПредоставлениеКонтейнеров Тогда
			Продолжить;
		КонецЕсли;
		КоличествоКТКВДетализации = ДокументОбъект.УчетныеЕдиницы.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", СтрокаУслуг.ИдентификаторСтрокиУслуг));
		Если СтрокаУслуг.Количество < КоличествоКТКВДетализации.Количество() Тогда
			СтрокиСОшибками.Добавить("№" + СтрокаУслуг.НомерСтроки);
		КонецЕсли;
	КонецЦикла;
	
	СтрокиСОшибками = ОбщегоНазначенияКлиентСервер.СвернутьМассив(СтрокиСОшибками);
	Документы.РелизСобственника.СортироватьМассив(СтрокиСОшибками);
	
	Если СтрокиСОшибками.Количество() > 0 Тогда
		НомераСтрок = СтрСоединить(СтрокиСОшибками, ", ");
		Текст = СтрШаблон(НСтр("ru = 'Невозможно создать релиз собственника, количество учетных единиц в детализации по строке %1 больше чем указано в строке'"), 
			НомераСтрок);
		ОбщегоНазначения.СообщитьПользователю(Текст,,,, Отказ);
	КонецЕсли;
	
	СтрокиСОшибками.Очистить();
	Для Каждого СтрокаУслуг Из ДокументОбъект.Услуги Цикл
		Если СтрокаУслуг.Номенклатура <> ПредоставлениеКонтейнеров Тогда
			Продолжить;
		КонецЕсли;
		Если СтрокаУслуг.Количество = 0 Тогда
			СтрокиСОшибками.Добавить("№" + СтрокаУслуг.НомерСтроки);
		КонецЕсли;
	КонецЦикла;
	
	СтрокиСОшибками = ОбщегоНазначенияКлиентСервер.СвернутьМассив(СтрокиСОшибками);
	Документы.РелизСобственника.СортироватьМассив(СтрокиСОшибками);
	
	Если СтрокиСОшибками.Количество() > 0 Тогда
		НомераСтрок = СтрСоединить(СтрокиСОшибками, ", ");
		Текст = СтрШаблон(НСтр("ru = 'Невозможно создать релиз собственника, т.к. количество КТК по строке %1 = 0'"), 
			НомераСтрок);
		ОбщегоНазначения.СообщитьПользователю(Текст,,,, Отказ);
	КонецЕсли;
	
	Для Каждого СтрокаУслуг Из ДокументОбъект.Услуги Цикл
		Если СтрокаУслуг.Номенклатура <> ПредоставлениеКонтейнеров Тогда
			Продолжить;
		КонецЕсли;
		Если СтрокаУслуг.ВидСобственности = Перечисления.ВариантыСобственности.СпотДоплатный Тогда
			Текст = НСтр("ru = 'Для создания Релиза собственника необходимо исключить из ПСЦ Поставщика КТК с видом собственности «Спот доплатный». Такие КТК оформляются через ПСЦ клиента.'");
			ОбщегоНазначения.СообщитьПользователю(Текст,,,, Отказ);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаУслуг Из ДокументОбъект.Услуги Цикл
		Если СтрокаУслуг.Номенклатура <> ПредоставлениеКонтейнеров Тогда
			Продолжить;
		КонецЕсли;
		Если СтрокаУслуг.ВидСобственности = Перечисления.ВариантыСобственности.Собственный Тогда
			Текст = НСтр("ru = 'Для создания Релиза собственника необходимо исключить из ПСЦ Поставщика КТК с видом собственности «Собственный».'");
			ОбщегоНазначения.СообщитьПользователю(Текст,,,, Отказ);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	СтрокиСОшибками.Очистить();
	Для Каждого СтрокаУслуг Из ДокументОбъект.Услуги Цикл
		Если СтрокаУслуг.Номенклатура <> ПредоставлениеКонтейнеров Тогда
			Продолжить;
		КонецЕсли;
		Если ТипЗнч(СтрокаУслуг.ПунктОтправления) = Тип("СправочникСсылка.Мультилокации") Тогда
			КоличествоЛокаций = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаУслуг.ПунктОтправления, "Локации").Выбрать().Количество();
			Если КоличествоЛокаций > 1 Тогда
				СтрокиСОшибками.Добавить("№" + СтрокаУслуг.НомерСтроки);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		Если ТипЗнч(СтрокаУслуг.ПунктОтправленияГород) = Тип("СправочникСсылка.Мультилокации") Тогда
			КоличествоЛокаций = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаУслуг.ПунктОтправленияГород, "Локации").Выбрать().Количество();
			Если КоличествоЛокаций > 1 Тогда
				СтрокиСОшибками.Добавить("№" + СтрокаУслуг.НомерСтроки);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		Если ТипЗнч(СтрокаУслуг.ПунктОтправленияСтрана) = Тип("СправочникСсылка.Мультилокации") Тогда
			КоличествоЛокаций = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаУслуг.ПунктОтправленияСтрана, "Локации").Выбрать().Количество();
			Если КоличествоЛокаций > 1 Тогда
				СтрокиСОшибками.Добавить("№" + СтрокаУслуг.НомерСтроки);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	СтрокиСОшибками = ОбщегоНазначенияКлиентСервер.СвернутьМассив(СтрокиСОшибками);
	Документы.РелизСобственника.СортироватьМассив(СтрокиСОшибками);
	
	Если СтрокиСОшибками.Количество() > 0 Тогда
		НомераСтрок = СтрСоединить(СтрокиСОшибками, ", ");
		Текст = СтрШаблон(НСтр("ru = 'Невозможно создать релиз собственника, т.к. по строке %1 в локациях выдачи стоит мультилокация, разделите строку по количеству мультилокаций'"), 
			НомераСтрок);
		ОбщегоНазначения.СообщитьПользователю(Текст,,,, Отказ);
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьРелизыСобственника(ДокументОснование, СозданиеНового = Ложь)
	
	// Евросиб US 89887 TA 89889 Рыбьяков К.А. 21.11.2024 ((
	Если ОбщегоНазначенияВызовСервера.ЕстьРелизСобственника(ДокументОснование) Тогда
		ТекстСообщения = НСтр("ru = 'На основании документа уже созданы релизы.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	Иначе
		Документы.РелизСобственника.ЗаполнитьРелизСобственникаНаОснованииПСЦПоставщика(ДокументОснование, СозданиеНового);
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 21.11.2024 ))
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНеобходимостьИзмененийСозданныхРелизов(Отказ, ПараметрыЗаписи)
	
	// Евросиб US 89887 TA 89889 Рыбьяков К.А. 21.11.2024 ((
	Если ЭтаФорма.Модифицированность И Не ПараметрыЗаписи.Свойство("ВопросУжеБылЗадан") Тогда
		РелизыКИзменению = ОбщегоНазначенияВызовСервера.НайтиСозданныеНаОснованииРелизы(Объект);
		Если РелизыКИзменению.Количество() > 0 Тогда
			НаименованияРелизов = СтрСоединить(РелизыКИзменению, "," + Символы.ПС);
			Кнопки = Новый СписокЗначений;
			Кнопки.Добавить(КодВозвратаДиалога.Да, "Изменить");
			Кнопки.Добавить(КодВозвратаДиалога.Нет, "Отменить изменения");
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, ПараметрыЗаписи);
			ТекстВопроса = СтрШаблон(НСтр("ru = 'На основании данного протокола уже созданы релизы собственника.
									|Внесенные изменения приведут к изменениям в релизах.
									|%1'"), НаименованияРелизов);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 21.11.2024 ))
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ПолучитьТипКонтейнера(ИмяТипаКонтейнера) 
	
	Результат = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТипоразмерыТЕ.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ТипоразмерыТЕ КАК ТипоразмерыТЕ
	               |ГДЕ
	               |	ТипоразмерыТЕ.Наименование ПОДОБНО &Наименование";
	Запрос.УстановитьПараметр("Наименование", ИмяТипаКонтейнера);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТипВагона(ИмяТипаВагона) 
	
	Результат = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТипоразмерыТС.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ТипоразмерыТС КАК ТипоразмерыТС
	               |ГДЕ
	               |	(ТипоразмерыТС.Наименование ПОДОБНО &Наименование
	               |			ИЛИ ТипоразмерыТС.ТипВагонаИзСлежения = &Наименование)";
	Запрос.УстановитьПараметр("Наименование", ИмяТипаВагона);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьНДС(НДС)
	
	//Евросиб СубботинВ #125845 09.12.2025 Начало // выбор по дате документа?
	Результат = Перечисления.СтавкиНДС.НДС20;
	Если НДС = "0" Тогда
		Результат = Перечисления.СтавкиНДС.НДС0;
	ИначеЕсли НДС = "Без НДС" Тогда
		Результат = Перечисления.СтавкиНДС.БезНДС;
	//Евросиб СубботинВ #125845 09.12.2025 Начало
	ИначеЕсли НДС = "22" Тогда
		Результат = Перечисления.СтавкиНДС.НДС22;
	//Евросиб СубботинВ #125845 09.12.2025 Конец
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьВалюту(НаименВалюты)
	
	Результат = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Валюты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Валюты КАК Валюты
	               |ГДЕ
	               |	Валюты.Наименование ПОДОБНО &Наименование";
	Запрос.УстановитьПараметр("Наименование", НаименВалюты);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбновитьРуководителяКонтрагента()
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		Дата = ?(ЗначениеЗаполнено(Объект.ДатаПСЦ), Объект.ДатаПСЦ, ТекущаяДата());
		Объект.РуководительКонтрагента = КонтрагентыДоговоры_сервер.ПолучитьРуководителяКонтрагента(Объект.Контрагент, Дата);
		
		Элементы.РуководительКонтрагента.СписокВыбора.ЗагрузитьЗначения(ПолучитьВсехРуководителейКонтрагента(Объект.Контрагент));
		
	Иначе
		
		Объект.РуководительКонтрагента = Неопределено;
		Элементы.РуководительКонтрагента.СписокВыбора.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РуководительКонтрагентаПриИзменении(Элемент)
	
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Объект.ПодписантКонтрагента = Неопределено;
	Объект.ДоверенностьНаПодписантаКонтрагента = "";
	Объект.НачалоДействияДоверенностиНаПодписанта = Неопределено;
	Объект.ОкончаниеДействияДоверенностиНаПодписанта = Неопределено;
	Объект.СканДоверенностиНаПодписантаКонтрагента = Неопределено;
	
	ЗаполнитьПолеСрокДействияДоверенностиНаПодписантаКонтрагента();
	
	КонтрагентПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииСервер()
	
	УстановитьВидимостьДобавленияРуководителя();
	ОбновитьРуководителяКонтрагента();

	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Владелец = &Контрагент
		|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
		|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления";
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
		Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() = 1 Тогда
			Выборка.Следующий();
			Объект.Договор = Выборка.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	ДоговорПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидУслугПоставщикаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение <> Объект.ВидУслугПоставщика И ЗначениеЗаполнено(Объект.Услуги) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДопПараметры = Новый Структура("ВидУслугПоставщика", ВыбранноеЗначение);
		ОповещениеОВыборе = Новый ОписаниеОповещения("ВидУслугПоставщикаПриИзмененииПродолжение", ЭтаФорма, ДопПараметры);
		ПоказатьВопрос(ОповещениеОВыборе, "Таблица услуг поставщика будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидУслугПоставщикаПриИзмененииПродолжение(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.ВидУслугПоставщика = ДопПараметры.ВидУслугПоставщика;
		Объект.Услуги.Очистить();
		ВидУслугПоставщикаПриИзмененииСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидУслугПоставщикаПриИзменении(Элемент)
	
	ВидУслугПоставщикаПриИзмененииСервер();

КонецПроцедуры

&НаСервере
Процедура ВидУслугПоставщикаПриИзмененииСервер()
	
	ЗначенияРеквизитовВидаУслугПоставщика = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ВидУслугПоставщика, "КатегорияУслуг, ЕдиницаИзмеренияНормативаНахожденияНаПогрузкеВыгрузке, ЗаполнятьНормативы, СуммаВключаетНДС");
	Объект.КатегорияУслуг = ЗначенияРеквизитовВидаУслугПоставщика.КатегорияУслуг;
	Объект.ЕдиницаИзмеренияНормативаНахожденияНаПогрузкеВыгрузке = ЗначенияРеквизитовВидаУслугПоставщика.ЕдиницаИзмеренияНормативаНахожденияНаПогрузкеВыгрузке;
	Объект.СуммаВключаетНДС = ЗначенияРеквизитовВидаУслугПоставщика.СуммаВключаетНДС;
	
	ЗаполнятьНормативы = ЗначенияРеквизитовВидаУслугПоставщика.ЗаполнятьНормативы;
	
	ПроверитьИУстановитьПризнакТиповой();
	
	КатегорияУслугПриИзмененииСервер();
	
	Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Контейнеры Тогда
		Элементы.ВидПеревозки.Видимость = Истина;
		Если Объект.Типовой Тогда
			Объект.НаименованиеПодписиКонтрагента = Справочники.НаименованияПодписей.Исполнитель;
			Объект.НаименованиеПодписи = Справочники.НаименованияПодписей.Клиент;
		КонецЕсли;
	//Евросиб Коханенко Н.А. 09.06.2025 (( #110783
	//Иначе
		Элементы.ФорматПротокола.Доступность = Ложь;
		Объект.ФорматПротокола = Неопределено;
		
	Иначе
		Элементы.ФорматПротокола.Доступность = Истина;
	//Евросиб Коханенко Н.А. 09.06.2025 )) #110783 
		Элементы.ВидПеревозки.Видимость = Ложь;
		Объект.ВидПеревозки = Неопределено;
	КонецЕсли;
	
	ВидПеревозкиПриИзмененииСервер();
	ЗаполнитьНаименованияПодписей();
	
	НастроитьКолонкиТаблицыУслугПоВидуУслугПоставщика();	

	//Евросиб Коханенко Н.А. 27.03.2025 (( #102319
	УстановитьВидимостьКомандПечати();
	//Евросиб Коханенко Н.А. 27.03.2025 )) #102319 
	
	УстановитьВидимостьКлиентЕвросиба(); //Евросиб Шевченко А.В. US 112958 TA 112963 01.07.2025
	
	//Евросиб Шевченко А.В. US 110215 TA 120129 06.10.2025
	УстановитьВидимостьГруппыПоЗначениюПоля(Объект.Услуги, Элементы.УслугиГруппаОпасностьГруза, "ОпасныйСпецГруз");
	УстановитьВидимостьГруппыПоЗначениюПоля(Объект.Услуги, Элементы.УслугиОсобыйТемпературныйРежимЗначение, "ОсобыйТемпературныйРежим");
	//Евросиб Шевченко А.В. US 110215 TA 120129 06.10.2025
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКлиентЕвросиба() //Евросиб Шевченко А.В. US 112958 TA 112963 01.07.2025
	Элементы.КлиентЕвросиба.Видимость = Истина;
	
	ВидыУслугСДоступомККлиентуЕвросиба = Новый Массив;
	ВидыУслугСДоступомККлиентуЕвросиба.Добавить(Справочники.ВидыУслугПоставщиков.Автоперевозки);
	ВидыУслугСДоступомККлиентуЕвросиба.Добавить(Справочники.ВидыУслугПоставщиков.Терминалы);
	
	Если ВидыУслугСДоступомККлиентуЕвросиба.Найти(Объект.ВидУслугПоставщика) = Неопределено Тогда
		Элементы.КлиентЕвросиба.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры		

&НаКлиенте
Процедура ДетализацияПоНомерамКТКВагонов(Команда)
	
	ВключитьВидимостьДетализации = Не Элементы.УслугиДетализацияПоНомерамКТКВагонов.Пометка;
	Элементы.УслугиДетализацияПоНомерамКТКВагонов.Пометка = ВключитьВидимостьДетализации;
	Элементы.ГруппаВкладкаДетализацияПоУчетнымЕдиницам.Видимость = ВключитьВидимостьДетализации;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораУчетныхЕдиниц(УчетныеЕдиницы, ДополнительныеПараметры) Экспорт
	
	Если УчетныеЕдиницы <> Неопределено Тогда
		Удалять = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "Удалять", Ложь);
		СоздатьСтрокиТаблицыПоУчетнымЕдиницам(ДополнительныеПараметры.ИдентификаторСтроки, УчетныеЕдиницы, Удалять);
		ТекДанныеУслуги = Объект.Услуги.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
		УстановитьВидимостьДоступностьЭлементовДетализацииПоУчетнымЕдиницам(ТекДанныеУслуги);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьСтрокиТаблицыПоУчетнымЕдиницам(ИдентификаторСтроки, ВыбранныеУчетныеЕдиницы, Удалять = Ложь)
	
	Модифицированность = Истина;
	
	ТекДанныеУслуги = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);	
	Если ТипЗнч(ВыбранныеУчетныеЕдиницы) = Тип("Массив") Тогда
		УчетныеЕдиницы = ВыбранныеУчетныеЕдиницы;
	Иначе
		УчетныеЕдиницы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыбранныеУчетныеЕдиницы);
	КонецЕсли;
	
	СтрокиКУдалению = Новый Массив;
	СтрокиУчетныхЕдиниц = Объект.УчетныеЕдиницы.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", ТекДанныеУслуги.ИдентификаторСтрокиУслуг));
	Для Каждого СтрокаУчетнойЕдиницы Из СтрокиУчетныхЕдиниц Цикл
		//Объект.УчетныеЕдиницы.Удалить(СтрокаУчетнойЕдиницы);
		ИндексНайденнойУчетнойЕдиницы = УчетныеЕдиницы.Найти(СтрокаУчетнойЕдиницы.УчетнаяЕдиница);
		Если ИндексНайденнойУчетнойЕдиницы = Неопределено Тогда
			Если Удалять Тогда
				СтрокиКУдалению.Добавить(СтрокаУчетнойЕдиницы);
			КонецЕсли;
		Иначе
			УчетныеЕдиницы.Удалить(ИндексНайденнойУчетнойЕдиницы);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Стр Из СтрокиКУдалению Цикл
		Объект.УчетныеЕдиницы.Удалить(Стр);
	КонецЦикла;
	
	Для Каждого УчетнаяЕдиница Из УчетныеЕдиницы Цикл
		Если ЗначениеЗаполнено(УчетнаяЕдиница) Тогда
			СтрокаУчетнойЕдиницы = Объект.УчетныеЕдиницы.Добавить();
			СтрокаУчетнойЕдиницы.ИдентификаторСтрокиУслуг = ТекДанныеУслуги.ИдентификаторСтрокиУслуг;
			СтрокаУчетнойЕдиницы.УчетнаяЕдиница = УчетнаяЕдиница;
		КонецЕсли;
	КонецЦикла;			
	ОбновитьПредставлениеУчетныхЕдиницСтрокиУслуг(ТекДанныеУслуги);
		
КонецПроцедуры

&НаКлиенте
Процедура ДетализацияКомплекснойСтавки(Команда)
	
	ВключитьВидимостьДетализации = Не Элементы.УслугиДетализацияКомплекснойСтавки.Пометка;
	Элементы.УслугиДетализацияКомплекснойСтавки.Пометка = ВключитьВидимостьДетализации;
	Элементы.ГруппаВкладкаДетализацияКомплекснойСтавки.Видимость = ВключитьВидимостьДетализации;
	
	Если ВключитьВидимостьДетализации Тогда
		Элементы.ГруппаВкладкиДетализации.ТекущаяСтраница = Элементы.ГруппаВкладкаДетализацияКомплекснойСтавки;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ДетализацияКомплекснойСтавкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекДанныеУслуги = Элементы.Услуги.ТекущиеДанные;
	Если ТекДанныеУслуги = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ДетализацияКомплекснойСтавкиПередНачаломИзменения(Элемент, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ДетализацияКомплекснойСтавкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекДанныеУслуги = Элементы.Услуги.ТекущиеДанные;
		Если ТекДанныеУслуги <> Неопределено Тогда
			ТекДанныеДетализации = Элементы.ДетализацияКомплекснойСтавки.ТекущиеДанные;
			ТекДанныеДетализации.ИдентификаторСтрокиУслуг = ТекДанныеУслуги.ИдентификаторСтрокиУслуг;
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаполнениеВниз(Элемент = Неопределено)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		
		ПроверенныеСтроки = Новый Массив;
		ИндексСледующейСтроки = Объект.Услуги.Индекс(ТекДанные) + 1;
		ИндексПоследнейСтроки = Объект.Услуги.Количество() - 1;
		Для ИндексСтроки = ИндексСледующейСтроки По ИндексПоследнейСтроки Цикл
			СтрокаТЧ = Объект.Услуги[ИндексСтроки];
			ИдентификаторСтроки = СтрокаТЧ.ПолучитьИдентификатор();
			РезПроверки = Элементы.Услуги.ПроверитьСтроку(ИдентификаторСтроки);
			Если РезПроверки Тогда
				ПроверенныеСтроки.Добавить(ИдентификаторСтроки);
			КонецЕсли;					
		КонецЦикла;			
		
		ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
		ИмяТекущегоЭлемента = Элементы.Услуги.ТекущийЭлемент.Имя;
		ВыполнитьЗаполнениеВнизСервер(ТекСтрока, ПроверенныеСтроки, ИмяТекущегоЭлемента);
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗаполнениеВнизСервер(ТекСтрока, ПроверенныеСтроки, ИмяЭлемента)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ТекЭлемент = Элементы[ИмяЭлемента];
	НомерСимволаНачалаИмениПоля = 7;
	ИмяПоля = Сред(ИмяЭлемента, НомерСимволаНачалаИмениПоля);
	ИмяПоляТЧ = СтрЗаменить(ТекЭлемент.ПутьКДанным, "Объект.Услуги.", "");
	
	ТипСписокЗначений = Тип("СписокЗначений");	

	УстановитьСтавкуНДС = Ложь;
	УстановитьЕдиницуИзмерения = Ложь;
	ИспользоватьРеквизитыНоменклатуры = Ложь;
	ПроверитьОпасныйГруз = Ложь;
	ПроверитьОсобыйТемпературныйРежим = Ложь;
	ПроверитьНормативы = Ложь;
	ПроверитьСоответствиеТипоразмеру = Ложь;
	ПроверитьВозможностьМенятьСтавкуНДС = Ложь;
	ПроверитьСтавкаПрогрессивная = Ложь;
	ПроверитьСтавкаНеПрогрессивная = Ложь;
	
	ДанныеЗаполнения = Новый Структура;
	ШкалаСтавок = Неопределено;
	
	СНПКонтейнеров = ПредопределенноеЗначение("Справочник.Номенклатура.СНПКонтейнеров");
	
	Если ИмяПоля = "СтавкаНДС" Тогда
		
		//ИспользоватьРеквизитыНоменклатуры = Истина;
		//СоответствиеРеквизитовНоменклатуры = ПолучитьЗначенияРеквизитовНоменклатурыУслуг();
		//УстановитьСтавкуНДС = Истина;
		//Если ЗначениеЗаполнено(Объект.ВидПеревозки) Или СНПКонтейнеровШтраф Тогда
			ПроверитьВозможностьМенятьСтавкуНДС = Истина;
		//КонецЕсли;
		
	ИначеЕсли ИмяПоля = "Номенклатура" Тогда
		
		ИспользоватьРеквизитыНоменклатуры = Истина;
		СоответствиеРеквизитовНоменклатуры = ПолучитьЗначенияРеквизитовНоменклатурыУслуг();
		УстановитьСтавкуНДС = Истина;
		УстановитьЕдиницуИзмерения = Истина;
		ДанныеЗаполнения.Вставить("ПроверкаСтавок", Перечисления.РезультатыПроверки.НеОсуществлялась);
		
	ИначеЕсли ИмяПоля = "СтоимостьБезНДС" Тогда
		
		ПроверитьСтавкаНеПрогрессивная = Истина;
		ДанныеЗаполнения.Вставить("ПроверкаСтавок", Перечисления.РезультатыПроверки.НеОсуществлялась);
		
	ИначеЕсли ИмяПоля = "СтоимостьСНДС" Тогда
		
		ПроверитьСтавкаНеПрогрессивная = Истина;
		ДанныеЗаполнения.Вставить("ПроверкаСтавок", Перечисления.РезультатыПроверки.НеОсуществлялась);
		
	ИначеЕсли ИмяПоля = "СтоимостьБезНДСПрогрессивная" Тогда
		
		ПроверитьСтавкаПрогрессивная = Истина;
		ИмяПоляСтоимость = "СтоимостьБезНДС";
		
		СтрокиШкалыСтавок = Объект.ШкалаСтавок.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", ТекДанные.ИдентификаторСтрокиУслуг));
		ШкалаСтавок = Новый Массив;
		Для Каждого Стр Из СтрокиШкалыСтавок Цикл
			ШкалаСтавок.Добавить(Новый Структура("От, До, Стоимость", Стр.От, Стр.До, Стр[ИмяПоляСтоимость]));
		КонецЦикла;
		
	ИначеЕсли ИмяПоля = "СтоимостьСНДСПрогрессивная" Тогда
		
		ПроверитьСтавкаПрогрессивная = Истина;
		ИмяПоляСтоимость = "СтоимостьСНДС";
		
		СтрокиШкалыСтавок = Объект.ШкалаСтавок.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", ТекДанные.ИдентификаторСтрокиУслуг));
		ШкалаСтавок = Новый Массив;
		Для Каждого Стр Из СтрокиШкалыСтавок Цикл
			ШкалаСтавок.Добавить(Новый Структура("От, До, Стоимость", Стр.От, Стр.До, Стр[ИмяПоляСтоимость]));
		КонецЦикла;
		
	ИначеЕсли ИмяПоля = "ВидСобственности" Тогда
		
		ДанныеЗаполнения.Вставить("ПроверкаСтавок", Перечисления.РезультатыПроверки.НеОсуществлялась);
		
	ИначеЕсли ИмяПоля = "ПунктОтправления" Тогда
		
		ДанныеЛокации = Новый Структура;
		ПоляТаблицыУслуг = ПараметрыВидаУслуг.ПоляТаблицыУслуг;
		ОписаниеПоля = ПоляТаблицыУслуг.Получить("АдресТерминалаВыдачиПостановкиКТК");	
		Если ОписаниеПоля <> Неопределено Тогда
			ДанныеЛокации.Вставить("Адрес");
		КонецЕсли;		
		ОписаниеПоляГород = ПоляТаблицыУслуг.Получить("ПунктОтправленияГород");
		Если ОписаниеПоляГород <> Неопределено Тогда
			ДанныеЛокации.Вставить("Город");
		КонецЕсли;		
		ОписаниеПоляСтрана = ПоляТаблицыУслуг.Получить("ПунктОтправленияСтрана");
		Если ОписаниеПоляСтрана <> Неопределено Тогда
			ДанныеЛокации.Вставить("Страна");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеЛокации) Тогда			
			ПолучитьДопДанныеЛокации(ТекДанные.ПунктОтправления, ДанныеЛокации);
			Если ДанныеЛокации.Свойство("Адрес") Тогда
				ДанныеЗаполнения.Вставить("АдресТерминалаВыдачиПостановкиКТК", ДанныеЛокации.Адрес);
			КонецЕсли;		
			Если ДанныеЛокации.Свойство("Город") Тогда
				ДанныеЗаполнения.Вставить("ПунктОтправленияГород", ДанныеЛокации.Город);
			КонецЕсли;
			Если ДанныеЛокации.Свойство("Страна") Тогда
				ДанныеЗаполнения.Вставить("ПунктОтправленияСтрана", ДанныеЛокации.Страна);
			КонецЕсли;			
		КонецЕсли;
		//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
		Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.ТЭО Тогда
			ДанныеЗаполнения.Вставить("ТерминалОтправления", ПолучитьТерминалОтправленияНазначения(ТекДанные.ПунктОтправления));
		КонецЕсли;
		//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
	ИначеЕсли ИмяПоля = "ПунктНазначения" Тогда
		
		ДанныеЛокации = Новый Структура;
		ПоляТаблицыУслуг = ПараметрыВидаУслуг.ПоляТаблицыУслуг;
		ОписаниеПоля = ПоляТаблицыУслуг.Получить("АдресТерминалаСдачиКТК");	
		Если ОписаниеПоля <> Неопределено Тогда
			ДанныеЛокации.Вставить("Адрес");
		КонецЕсли;		
		ОписаниеПоляГород = ПоляТаблицыУслуг.Получить("ПунктНазначенияГород");
		Если ОписаниеПоляГород <> Неопределено Тогда
			ДанныеЛокации.Вставить("Город");
		КонецЕсли;		
		ОписаниеПоляСтрана = ПоляТаблицыУслуг.Получить("ПунктНазначенияСтрана");
		Если ОписаниеПоляСтрана <> Неопределено Тогда
			ДанныеЛокации.Вставить("Страна");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеЛокации) Тогда			
			ПолучитьДопДанныеЛокации(ТекДанные.ПунктНазначения, ДанныеЛокации);
			Если ДанныеЛокации.Свойство("Адрес") Тогда
				ДанныеЗаполнения.Вставить("АдресТерминалаСдачиКТК", ДанныеЛокации.Адрес);
			КонецЕсли;		
			Если ДанныеЛокации.Свойство("Город") Тогда
				ДанныеЗаполнения.Вставить("ПунктНазначенияГород", ДанныеЛокации.Город);
			КонецЕсли;
			Если ДанныеЛокации.Свойство("Страна") Тогда
				ДанныеЗаполнения.Вставить("ПунктНазначенияСтрана", ДанныеЛокации.Страна);
			КонецЕсли;			
		КонецЕсли;
		//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
		Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.ТЭО Тогда
			ДанныеЗаполнения.Вставить("ТерминалНазначения", ПолучитьТерминалОтправленияНазначения(ТекДанные.ПунктНазначения));
		КонецЕсли;
		//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
	ИначеЕсли ИмяПоля = "ПунктОтправленияГород" Тогда
		
		ЛокацияПустаяСсылка = Справочники.Локации.ПустаяСсылка();
		
		ПоляТаблицыУслуг = ПараметрыВидаУслуг.ПоляТаблицыУслуг;
		ОписаниеПоля = ПоляТаблицыУслуг.Получить("ПунктОтправленияСтрана");	
		Если ОписаниеПоля <> Неопределено  Тогда
			Если ЗначениеЗаполнено(ТекДанные.ПунктОтправленияГород) Тогда
				Если ТипЗнч(ТекДанные.ПунктОтправленияГород) = Тип("СправочникСсылка.Локации") Тогда				
					ПунктОтправленияСтрана = ПолучитьЛокациюВышестоящегоУровня(ТекДанные.ПунктОтправленияГород, Перечисления.ТипыИерархииЛокации.Страна);
				ИначеЕсли ТипЗнч(ТекДанные.ПунктОтправленияГород) = Тип("СправочникСсылка.Мультилокации") Тогда					
					Страны = ПолучитьЛокацииВышестоящегоУровняПоМультилокации(ТекДанные.ПунктОтправленияГород, Перечисления.ТипыИерархииЛокации.Страна);
					Если Страны.Количество() = 1 Тогда
						ПунктОтправленияСтрана = Страны[0];
					Иначе
						ПунктОтправленияСтрана = ЛокацияПустаяСсылка
					КонецЕсли;
				КонецЕсли;
			Иначе
				ПунктОтправленияСтрана = ЛокацияПустаяСсылка;
			КонецЕсли;
			ДанныеЗаполнения.Вставить("ПунктОтправленияСтрана", ПунктОтправленияСтрана);
		КонецЕсли;
		ДанныеЗаполнения.Вставить("ПунктОтправления", ЛокацияПустаяСсылка);
		
	ИначеЕсли ИмяПоля = "ПунктНазначенияГород" Тогда
		
		ЛокацияПустаяСсылка = Справочники.Локации.ПустаяСсылка();
		
		ПоляТаблицыУслуг = ПараметрыВидаУслуг.ПоляТаблицыУслуг;
		ОписаниеПоля = ПоляТаблицыУслуг.Получить("ПунктНазначенияСтрана");	
		Если ОписаниеПоля <> Неопределено  Тогда
			Если ЗначениеЗаполнено(ТекДанные.ПунктНазначенияГород) Тогда
				Если ТипЗнч(ТекДанные.ПунктНазначенияГород) = Тип("СправочникСсылка.Локации") Тогда				
					ПунктНазначенияСтрана = ПолучитьЛокациюВышестоящегоУровня(ТекДанные.ПунктНазначенияГород, Перечисления.ТипыИерархииЛокации.Страна);
				ИначеЕсли ТипЗнч(ТекДанные.ПунктНазначенияГород) = Тип("СправочникСсылка.Мультилокации") Тогда
					Страны = ПолучитьЛокацииВышестоящегоУровняПоМультилокации(ТекДанные.ПунктНазначенияГород, Перечисления.ТипыИерархииЛокации.Страна);
					Если Страны.Количество() = 1 Тогда
						ПунктНазначенияСтрана = Страны[0];
					Иначе
						ПунктНазначенияСтрана = ЛокацияПустаяСсылка;
					КонецЕсли;
				КонецЕсли;
			Иначе
				ПунктНазначенияСтрана = ЛокацияПустаяСсылка;
			КонецЕсли;
			ДанныеЗаполнения.Вставить("ПунктНазначенияСтрана", ПунктНазначенияСтрана);
		КонецЕсли;
		ДанныеЗаполнения.Вставить("ПунктНазначения", ЛокацияПустаяСсылка);
		
	ИначеЕсли ИмяПоля = "ПунктОтправленияСтрана" Тогда
		//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
		Если Объект.ВидУслугПоставщика <> Справочники.ВидыУслугПоставщиков.ТЭО Тогда
			ЛокацияПустаяСсылка = Справочники.Локации.ПустаяСсылка();
			ДанныеЗаполнения.Вставить("ПунктОтправления", ЛокацияПустаяСсылка);
			ДанныеЗаполнения.Вставить("ПунктОтправленияГород", ЛокацияПустаяСсылка);
		КонецЕсли;
        //Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
	ИначеЕсли ИмяПоля = "ПунктНазначенияСтрана" Тогда
		//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
		Если Объект.ВидУслугПоставщика <> Справочники.ВидыУслугПоставщиков.ТЭО Тогда
			ЛокацияПустаяСсылка = Справочники.Локации.ПустаяСсылка();
			ДанныеЗаполнения.Вставить("ПунктНазначения", ЛокацияПустаяСсылка);
			ДанныеЗаполнения.Вставить("ПунктНазначенияГород", ЛокацияПустаяСсылка);
		КонецЕсли;
		//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
	//ИначеЕсли ИмяПоля = "ЛокацияОказанияУслуги" Тогда
	//	
	//	ЖелезнаяДорога = ПолучитьЖелезнуюДорогуПоТерминалу(ТекДанные.ЛокацияОказанияУслуги);
	//	ДанныеЗаполнения.Вставить("ЖелезнаяДорога", ЖелезнаяДорога);
		
	ИначеЕсли ИмяПоля = "ТипоразмерыКТК" Или ИмяПоля = "ТипоразмерыКТКСтрокой" Тогда
		
		ИмяПоляТЧ = "ТипоразмерыКТК";
		СоответствиеВесовТипоразмерам = ПолучитьСоответствиеВесовТипоразмерам();
		ДанныеЗаполнения.Вставить("ПроверкаСтавок", Перечисления.РезультатыПроверки.НеОсуществлялась);
	//Евросиб Шевченко А.В. US 124811 TA 129059 13.03.2026	
	ИначеЕсли ИмяПоля = "КлассыОпасности" Или ИмяПоля = "КлассОпасностиСтрокой" Тогда
		
		ИмяПоляТЧ = "КлассыОпасности";
	//Евросиб Шевченко А.В. US 124811 TA 129059 13.03.2026	
	ИначеЕсли ИмяПоля = "ТипоразмерыВагонов" Или ИмяПоля = "ТипоразмерыВагоновСтрокой" Или ИмяПоля = "ТипоразмерВагона" Тогда
		
		ИмяПоляТЧ = "ТипоразмерыВагонов";
		//ДанныеЗаполнения.Вставить("ПроверкаСтавок", Перечисления.РезультатыПроверки.НеОсуществлялась);
		
	ИначеЕсли ИмяПоля = "ВидыОтправок" Или ИмяПоля = "ВидыОтправокСтрокой" Тогда
		
		ИмяПоляТЧ = "ВидыОтправок";
		
	ИначеЕсли ИмяПоля = "СтандартОпасностиГруза" Или ИмяПоля = "КлассОпасностиГруза" ИЛИ ИмяПоля = "КлассОпасностиГрузаСтрокой" Тогда //Евросиб Шевченко А.В. US 124811 TA 129059 13.03.2026
		
		ПроверитьОпасныйГруз = Истина;
		
	ИначеЕсли ИмяПоля = "Груз" Тогда
		
		РеквизитыГруза = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекДанные.Груз, "ЕТСНГ, ГНГ");
		
	ИначеЕсли ИмяПоля = "ЕТСНГ" Тогда
		
		ГрузЕТСНГ = ПолучитьГрузЕТСНГ(ТекДанные.ЕТСНГ);
		ДанныеЗаполнения.Вставить("ГрузЕТСНГ", ГрузЕТСНГ);
		
	ИначеЕсли ИмяПоля = "ГНГ" Тогда
		
		ГрузГНГ = ПолучитьГрузГНГ(ТекДанные.ГНГ);
		ДанныеЗаполнения.Вставить("ГрузГНГ", ГрузГНГ);
		
	ИначеЕсли ИмяПоля = "ГрузЕТСНГ" Тогда
		
		КодЕТСНГ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекДанные.ГрузЕТСНГ, "Код");
		ДанныеЗаполнения.Вставить("ЕТСНГ", КодЕТСНГ);
		
	ИначеЕсли ИмяПоля = "ГрузГНГ" Тогда
		
		КодГНГ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекДанные.ГрузГНГ, "КодГНГСтрокой");
		ДанныеЗаполнения.Вставить("ГНГ", КодГНГ);
	//Евросиб Шевченко А.В. US 110215 TA 120129 06.10.2025	
	ИначеЕсли ИмяПоля = "КодТНВЭД" Тогда
		
		ГрузТНВЭД = НайтиГрузТНВЭД(ТекДанные.КодТНВЭД);
		ДанныеЗаполнения.Вставить("ГрузТНВЭД", ГрузТНВЭД);
		
	ИначеЕсли ИмяПоля = "ГрузТНВЭД" Тогда
		
		КодТНВЭД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекДанные.ГрузТНВЭД, "ТНВЭД");
		ДанныеЗаполнения.Вставить("КодТНВЭД", КодТНВЭД);
		
	ИначеЕсли ИмяПоля = "ВесГруза" Тогда
		//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
		Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Порты ИЛИ Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Фрахт ИЛИ Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.ТЭО Тогда
			ДанныеЗаполнения.Вставить("НормаЗагрузкиКТК", ТекДанные.ВесГруза);
		КонецЕсли;
		//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
	//Евросиб Шевченко А.В. US 110215 TA 120129 06.10.2025	
	ИначеЕсли ИмяПоля = "ОсобыйТемпературныйРежимЗначение" Тогда
		
		ПроверитьОсобыйТемпературныйРежим = Истина;
		
	ИначеЕсли ИмяПоля = "НормаЗагрузкиКТК" Тогда
		
		ПроверитьНормативы = Истина;
		ПроверитьСоответствиеТипоразмеру = Истина;
		СоответствиеВесовТипоразмерам = ПолучитьСоответствиеВесовТипоразмерам();
		
	ИначеЕсли ИмяПоля = "НормаВремениНаПогрузкуВыгрузку" Тогда
		
		ПроверитьНормативы = Истина;
		
		ДанныеЗаполнения.Вставить("НормативНахожденияНаПогрузке", ТекДанные.НормативНахожденияНаПогрузке);
		ДанныеЗаполнения.Вставить("НормативНахожденияНаВыгрузке", ТекДанные.НормативНахожденияНаВыгрузке);
		
	ИначеЕсли ИмяПоля = "НормаПользования" Тогда
		
		ПроверитьНормативы = Истина;
		ДанныеЗаполнения.Вставить("ПроверкаСтавок", Перечисления.РезультатыПроверки.НеОсуществлялась);
		
	ИначеЕсли ИмяПоляТЧ = "НормаПользования" Тогда
		
		ДанныеЗаполнения.Вставить("ПроверкаСтавок", Перечисления.РезультатыПроверки.НеОсуществлялась);
		
	ИначеЕсли ИмяПоляТЧ = "Коносамент" Тогда
		
		ДанныеЗаполнения.Вставить("Судно", ТекДанные.Судно);
		ДанныеЗаполнения.Вставить("РейсМоре", ТекДанные.РейсМоре);
		
	ИначеЕсли ИмяПоля = "НормативНахожденияНаПогрузке"
			Или ИмяПоля = "НормативНахожденияНаВыгрузке"
			Или ИмяПоля = "СвободныйПериодХраненияПриОтправке"
			Или ИмяПоля = "СвободныйПериодХраненияПриПриеме"
			Или ИмяПоля = "СвободныйПериодХраненияУслугиДепо"
			Или ИмяПоля = "СвободныйПериодХраненияВаг"
			Или ИмяПоля = "СвободныйПериодХраненияКТК" Тогда
		
		ПроверитьНормативы = Истина;			
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025	
	ИначеЕсли ИмяПоля = "СостоянияГруженыйПорожнийСтрокой" Тогда
		ИмяПоляТЧ = "СостоянияГруженыйПорожнийСтрокой";	
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025	
	КонецЕсли;
	
	НовоеЗначение = ТекДанные[ИмяПоляТЧ];

	Если ТипЗнч(НовоеЗначение) = ТипСписокЗначений Тогда
		ЗначенияСписка = НовоеЗначение.ВыгрузитьЗначения();
	Иначе
		ЗначенияСписка = Неопределено;
	КонецЕсли;

	ИзменилисьЗначенияПоляНормативы = Ложь;
	ИзменилисьЗначенияПоляОпасныйГруз = Ложь;
	ИзменилисьЗначенияПоляОсобыйТемпературныйРежим = Ложь;
	ИзменилисьРезультатыПроверкиСтавок = Ложь;
	
	ОбработанныеСтроки = Новый Массив;

	Для Каждого ИдентификаторСтроки Из ПроверенныеСтроки Цикл
		
		СтрокаТЧ = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
		
		РезПроверки = Истина;
		
		Если РезПроверки И ПроверитьОпасныйГруз Тогда
			РезПроверки = СтрокаТЧ.ОпасныйСпецГруз;
		КонецЕсли;
		
		Если РезПроверки И ПроверитьОсобыйТемпературныйРежим Тогда
			РезПроверки = СтрокаТЧ.ОсобыйТемпературныйРежим;
		КонецЕсли;
		//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
		Если Не Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.ТЭО Тогда
			Если РезПроверки И ПроверитьНормативы Тогда
				РезПроверки = СтрокаТЧ.Нормативы;
			КонецЕсли;
		КонецЕсли;
		//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
		Если РезПроверки И ПроверитьСоответствиеТипоразмеру Тогда
			
			ЗначениеНайдено = Ложь;
			Если ЗначениеЗаполнено(СтрокаТЧ.ТипоразмерыКТК) Тогда				
				Для Каждого ТипоразмерКТК Из СтрокаТЧ.ТипоразмерыКТК Цикл
					Веса = СоответствиеВесовТипоразмерам.Получить(ТипоразмерКТК.Значение);
					Если ЗначениеЗаполнено(Веса) И Веса.Найти(НовоеЗначение) <> Неопределено Тогда
						ЗначениеНайдено = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;							
			КонецЕсли;
			
			Если Не ЗначениеНайдено Тогда
				РезПроверки = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		Если РезПроверки И ПроверитьВозможностьМенятьСтавкуНДС Тогда
			Если СтрокаТЧ.Номенклатура = СНПКонтейнеров Тогда
				Если СНПКонтейнеровШтраф Тогда
					РезПроверки = Ложь;
				КонецЕсли;
			ИначеЕсли ЗначениеЗаполнено(Объект.ВидПеревозки) Тогда
				РезПроверки = Ложь;
			КонецЕсли;			
		КонецЕсли;
		
		Если РезПроверки И ПроверитьСтавкаПрогрессивная Тогда
			Если Не СтрокаТЧ.СтавкаПрогрессивная Тогда
				РезПроверки = Ложь;
			КонецЕсли;
		ИначеЕсли ПроверитьСтавкаНеПрогрессивная Тогда
			Если СтрокаТЧ.СтавкаПрогрессивная Тогда
				РезПроверки = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Если ШкалаСтавок = Неопределено И ЗначенияСписка = Неопределено И СтрокаТЧ[ИмяПоляТЧ] = НовоеЗначение Тогда
			РезПроверки = Ложь;
		КонецЕсли;
		
		Если РезПроверки Тогда
			
			Если ШкалаСтавок <> Неопределено Тогда
				ОбработкаВводаПрогрессивнойСтавкиПоСтрокеУслуг(ШкалаСтавок, СтрокаТЧ, ИмяПоляСтоимость);
			ИначеЕсли ЗначенияСписка <> Неопределено Тогда
				СтрокаТЧ[ИмяПоляТЧ].ЗагрузитьЗначения(ЗначенияСписка);
			Иначе
				СтрокаТЧ[ИмяПоляТЧ] = НовоеЗначение;
			КонецЕсли;
			
			Если ИспользоватьРеквизитыНоменклатуры Тогда
				
				РеквизитыНоменклатуры = СоответствиеРеквизитовНоменклатуры.Получить(СтрокаТЧ["Номенклатура"]);
				Если ЗначениеЗаполнено(РеквизитыНоменклатуры) Тогда
					
					Если УстановитьСтавкуНДС Тогда
						ЗаполнитьСтавкуНДСВСтрокеУслуг(СтрокаТЧ, РеквизитыНоменклатуры.СтавкаНДСПоставщика);
						ПересчитатьСтоимостьСУчетомСтавкиНДС(СтрокаТЧ);
					КонецЕсли;
					
					Если УстановитьЕдиницуИзмерения Тогда
						Если ЗначениеЗаполнено(РеквизитыНоменклатуры.ЕдиницаИзмерения) Тогда
							СтрокаТЧ["ЕдиницаИзмерения"] = РеквизитыНоменклатуры.ЕдиницаИзмерения;
						КонецЕсли;
					КонецЕсли;
						
				КонецЕсли;
				
			КонецЕсли;
			
			Если ИмяПоля = "СтоимостьБезНДС" Тогда
				
				ЗначениеСтавкиНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСтавкуНДС(СтрокаТЧ.СтавкаНДС);	
				СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(СтрокаТЧ.СтоимостьБезНДС, ЗначениеСтавкиНДС, Истина, Ложь);
				СтрокаТЧ.СтоимостьСНДС = СтрокаТЧ.СтоимостьБезНДС + СуммаНДС;
				
				ПересчетСтавкиПСвСутки(ИдентификаторСтроки,"СтоимостьБезНДС"); //Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
				
			ИначеЕсли ИмяПоля = "СтоимостьСНДС" Тогда
				
				ЗначениеСтавкиНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСтавкуНДС(СтрокаТЧ.СтавкаНДС);
				СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(СтрокаТЧ.СтоимостьСНДС, ЗначениеСтавкиНДС, Истина, Истина);
				СтрокаТЧ.СтоимостьБезНДС = СтрокаТЧ.СтоимостьСНДС - СуммаНДС;
				
				ПересчетСтавкиПСвСутки(ИдентификаторСтроки,"СтоимостьСНДС"); //Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
				
			ИначеЕсли ИмяПоля = "СтавкаЗаПСВСутБезНДС" Тогда //Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
				
				ЗначениеСтавкиНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСтавкуНДС(СтрокаТЧ.СтавкаНДС);	
				СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(СтрокаТЧ.СтавкаЗаПСВСутБезНДС, ЗначениеСтавкиНДС, Истина, Ложь);
				СтрокаТЧ.СтавкаЗаПСВСутСНДС = СтрокаТЧ.СтавкаЗаПСВСутБезНДС + СуммаНДС;
				
			ИначеЕсли ИмяПоля = "СтавкаЗаПСВСутСНДС" Тогда //Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
				
				ЗначениеСтавкиНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСтавкуНДС(СтрокаТЧ.СтавкаНДС);
				СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(СтрокаТЧ.СтавкаЗаПСВСутСНДС, ЗначениеСтавкиНДС, Истина, Истина);
				СтрокаТЧ.СтавкаЗаПСВСутБезНДС = СтрокаТЧ.СтавкаЗаПСВСутСНДС - СуммаНДС;
				
			ИначеЕсли ИмяПоля = "НормаПользования" Тогда //Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025	
				
				ПересчетСтавкиПСвСутки(ИдентификаторСтроки,"НормаПользования"); //Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
				
			ИначеЕсли ИмяПоля = "СтавкаПрогрессивная" Тогда
					
				ОбработатьИзменениеПризнакаСтавкаПрогрессивнаяВСтроке(СтрокаТЧ);
				
			ИначеЕсли ИмяПоля = "СтавкаНДС" Тогда
				
				Если СтрокаТЧ.СтавкаПрогрессивная Тогда
					ПересчитатьСтоимостьПоШкалеСУчетомСтавкиНДС(СтрокаТЧ, "СтоимостьБезНДС");	
				Иначе
					ЗначениеСтавкиНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСтавкуНДС(СтрокаТЧ.СтавкаНДС);	
					Если ЗначениеЗаполнено(СтрокаТЧ.СтоимостьБезНДС) Тогда
						СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(СтрокаТЧ.СтоимостьБезНДС, ЗначениеСтавкиНДС, Истина, Ложь);
						СтрокаТЧ.СтоимостьСНДС = СтрокаТЧ.СтоимостьБезНДС + СуммаНДС;
					ИначеЕсли ЗначениеЗаполнено(СтрокаТЧ.СтоимостьСНДС) Тогда
						СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(СтрокаТЧ.СтоимостьСНДС, ЗначениеСтавкиНДС, Истина, Истина);
						СтрокаТЧ.СтоимостьБезНДС = СтрокаТЧ.СтоимостьСНДС - СуммаНДС;
					КонецЕсли;
					//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
					Если ЗначениеЗаполнено(СтрокаТЧ.СтавкаЗаПСВСутБезНДС) Тогда
						СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(СтрокаТЧ.СтавкаЗаПСВСутБезНДС, ЗначениеСтавкиНДС, Истина, Ложь);
						СтрокаТЧ.СтавкаЗаПСВСутСНДС = СтрокаТЧ.СтавкаЗаПСВСутБезНДС + СуммаНДС;
					ИначеЕсли ЗначениеЗаполнено(СтрокаТЧ.СтавкаЗаПСВСутСНДС) Тогда
						СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(СтрокаТЧ.СтавкаЗаПСВСутСНДС, ЗначениеСтавкиНДС, Истина, Истина);
						СтрокаТЧ.СтавкаЗаПСВСутБезНДС = СтрокаТЧ.СтавкаЗаПСВСутСНДС - СуммаНДС;
					КонецЕсли;
					//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
				КонецЕсли;
				
			ИначеЕсли ИмяПоля = "СтанцияОтправленияНазначения" Тогда
				
				СтрокаТЧ.СтанцияОтправления = СтрокаТЧ.СтанцияОтправленияНазначения;
				СтрокаТЧ.СтанцияНазначения = СтрокаТЧ.СтанцияОтправленияНазначения;
			//Евросиб Шевченко А.В. US 124811 TA 129059 13.03.2026	
			ИначеЕсли ИмяПоля = "КлассыОпасности" Или ИмяПоля = "КлассОпасностиСтрокой" Тогда
				
				ОбработатьИзмененияКлассыОпасностиСтрокиУслуг(СтрокаТЧ);
			//Евросиб Шевченко А.В. US 124811 TA 129059 13.03.2026	
			ИначеЕсли ИмяПоля = "ТипоразмерыКТК" Или ИмяПоля = "ТипоразмерыКТКСтрокой" Тогда
				
				ОбработатьИзмененияТипоразмеровКТКСтрокиУслуг(СтрокаТЧ);
				
				//СформироватьСтрокиКритериевПоТипоразмерамКТКСтрокиТаблицыУслуг(СтрокаТЧ);					
				//
				//Если ЗначениеЗаполнено(СтрокаТЧ.НормаЗагрузкиКТК) Тогда

				//	ЗначениеНайдено = Ложь;
				//	Если ЗначениеЗаполнено(СтрокаТЧ.ТипоразмерыКТК) Тогда				
				//		Для Каждого ТипоразмерКТК Из СтрокаТЧ.ТипоразмерыКТК Цикл
				//			Веса = СоответствиеВесовТипоразмерам.Получить(ТипоразмерКТК.Значение);
				//			Если ЗначениеЗаполнено(Веса) И Веса.Найти(СтрокаТЧ.НормаЗагрузкиКТК) <> Неопределено Тогда
				//				ЗначениеНайдено = Истина;
				//				Прервать;
				//			КонецЕсли;
				//		КонецЦикла;							
				//	КонецЕсли;
				//	
				//	Если Не ЗначениеНайдено Тогда
				//		СтрокаТЧ.НормаЗагрузкиКТК = ПредопределенноеЗначение("Справочник.ВесаПоТипоразмерам.ПустаяСсылка");
				//	КонецЕсли;
				//	
				//КонецЕсли;
				
			//ИначеЕсли ИмяПоля = "ТипоразмерыВагонов" Или ИмяПоля = "ТипоразмерыВагоновСтрокой" Тогда
			ИначеЕсли ИмяПоляТЧ = "ТипоразмерыВагонов" Тогда
				
				ОбработатьИзменениеТипоразмеровВагоновСтрокиУслуг(СтрокаТЧ);
				
			ИначеЕсли ИмяПоля = "ВидыОтправок" Или ИмяПоля = "ВидыОтправокСтрокой" Тогда
				
				ОбработатьИзменениеВидовОтправокСтрокиУслуг(СтрокаТЧ);
				
			ИначеЕсли ИмяПоля = "Груз" Тогда
				
				УстановитьЗначениеПоляСостояниеГруженыйПорожний(СтрокаТЧ);
				ОбработатьИзменениеСостоянияГруженыйПорожнийСтрокиУслуг(СтрокаТЧ);
		    //Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025	
			ИначеЕсли ИмяПоля = "СостоянияГруженыйПорожнийСтрокой" Тогда
				СтрокаТЧ[ИмяПоляТЧ] = НовоеЗначение;
				
				СтрокаТЧ.СостоянияГруженыйПорожний.Очистить();
				мГруженыйПорожний = СтрРазделить(НовоеЗначение,";");
				СостояниеГруженый = ПредопределенноеЗначение("Перечисление.СостоянияКТК.Груженый");
				СостояниеПорожний = ПредопределенноеЗначение("Перечисление.СостоянияКТК.Порожний");
				Для Каждого мЗнч Из мГруженыйПорожний Цикл
					Если СокрЛП(мЗнч) = "Груженый" Тогда
						СтрокаТЧ.СостоянияГруженыйПорожний.Добавить(СостояниеГруженый);
					ИначеЕсли СокрЛП(мЗнч) = "Порожний" Тогда
						СтрокаТЧ.СостоянияГруженыйПорожний.Добавить(СостояниеПорожний);
					КонецЕсли;	
						
				КонецЦикла;	
				
				ОбработатьИзменениеСостоянияГруженыйПорожнийСтрокиУслуг(СтрокаТЧ);	
			//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
			ИначеЕсли ИмяПоля = "ЕТСНГ" Тогда
				//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
				УстановитьПризнакИзмененияГруза(СтрокаТЧ);
				СтрокаТЧ.ЕТСНГ = НовоеЗначение;
				Если НЕ ЗначениеЗаполнено(НовоеЗначение) Тогда
					СтрокаТЧ.ГрузЕТСНГ = НовоеЗначение;
				КонецЕсли;	
				УстановитьЗначениеПоляСостояниеГруженыйПорожний(СтрокаТЧ);
				//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
			ИначеЕсли ИмяПоля = "ГНГ" Тогда
				//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
				УстановитьПризнакИзмененияГруза(СтрокаТЧ);
				СтрокаТЧ.ГНГ = НовоеЗначение;
				Если НЕ ЗначениеЗаполнено(НовоеЗначение) Тогда
					СтрокаТЧ.ГрузГНГ = НовоеЗначение;
				КонецЕсли;
				УстановитьЗначениеПоляСостояниеГруженыйПорожний(СтрокаТЧ);
				//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
			ИначеЕсли ИмяПоля = "ГрузЕТСНГ" Тогда
				//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
				УстановитьПризнакИзмененияГруза(СтрокаТЧ); 
				СтрокаТЧ.ГрузЕТСНГ = НовоеЗначение;
				Если НЕ ЗначениеЗаполнено(НовоеЗначение) Тогда
					СтрокаТЧ.ЕТСНГ = НовоеЗначение;
				КонецЕсли;
				УстановитьЗначениеПоляСостояниеГруженыйПорожний(СтрокаТЧ);
				//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
			ИначеЕсли ИмяПоля = "ГрузГНГ" Тогда
				//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
				УстановитьПризнакИзмененияГруза(СтрокаТЧ); 
				СтрокаТЧ.ГрузГНГ = НовоеЗначение;
				Если НЕ ЗначениеЗаполнено(НовоеЗначение) Тогда
					СтрокаТЧ.ГНГ = НовоеЗначение;
				КонецЕсли;
				//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
				УстановитьЗначениеПоляСостояниеГруженыйПорожний(СтрокаТЧ);
				
			//Евросиб Шевченко А.В. US 110215 TA 120129 06.10.2025
			ИначеЕсли ИмяПоля = "ГрузТНВЭД" Тогда
				//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
				УстановитьПризнакИзмененияГруза(СтрокаТЧ); 
				СтрокаТЧ.ГрузТНВЭД = НовоеЗначение;
				Если НЕ ЗначениеЗаполнено(НовоеЗначение) Тогда
					СтрокаТЧ.КодТНВЭД = НовоеЗначение;
				КонецЕсли;
				УстановитьЗначениеПоляСостояниеГруженыйПорожний(СтрокаТЧ);
				//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
			ИначеЕсли ИмяПоля = "КодТНВЭД" Тогда
				//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
				УстановитьПризнакИзмененияГруза(СтрокаТЧ); 
				СтрокаТЧ.КодТНВЭД = НовоеЗначение;
				Если НЕ ЗначениеЗаполнено(НовоеЗначение) Тогда
					СтрокаТЧ.ГрузТНВЭД = НовоеЗначение;
				КонецЕсли;
				//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
				УстановитьЗначениеПоляСостояниеГруженыйПорожний(СтрокаТЧ);
				
			ИначеЕсли ИмяПоля = "ВесГруза" Тогда
				//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
				Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Порты ИЛИ Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Фрахт ИЛИ Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.ТЭО Тогда
					СтрокаТЧ.НормаЗагрузкиКТК = НовоеЗначение;
					СтрокаТЧ.БылиИзмененияГруза = Истина;
					УстановитьЗначениеПоляСостояниеГруженыйПорожний(СтрокаТЧ);
					ОбработатьИзменениеСостоянияГруженыйПорожнийСтрокиУслуг(СтрокаТЧ);
				КонецЕсли;
				//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
			//Евросиб Шевченко А.В. US 110215 TA 120129 06.10.2025
				
			ИначеЕсли ИмяПоля = "ОсобыйТемпературныйРежим" Тогда
				
				Если НовоеЗначение = Ложь Тогда
					СтрокаТЧ.ОсобыйТемпературныйРежимЗначение = "";
				КонецЕсли;
				ИзменилисьЗначенияПоляОсобыйТемпературныйРежим = Истина;
				
			ИначеЕсли ИмяПоля = "ОпасныйСпецГруз" Тогда
				//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
				УстановитьПризнакИзмененияГруза(СтрокаТЧ); 
				СтрокаТЧ.ОпасныйСпецГруз = НовоеЗначение;
				//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
				ОбработатьИзменениеПризнакаОпасныйГруз(СтрокаТЧ);							
				ИзменилисьЗначенияПоляОпасныйГруз = Истина;
				
			ИначеЕсли ИмяПоля = "НормаЗагрузкиКТК" Тогда
				
				УстановитьЗначениеПоляСостояниеГруженыйПорожний(СтрокаТЧ);
				ОбработатьИзменениеСостоянияГруженыйПорожнийСтрокиУслуг(СтрокаТЧ); //Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
				
			ИначеЕсли ИмяПоля = "Нормативы" Тогда
				
				Если НовоеЗначение = Ложь Тогда
					ОбработатьИзменениеПризнакаНормативыВСтроке(СтрокаТЧ)
				КонецЕсли;
				ИзменилисьЗначенияПоляНормативы = Истина;
				
			ИначеЕсли ИмяПоля = "ТребуетсяДетализацияКомплекснойСтавки" Тогда
				
				ОбработатьИзменениеПризнакаДетализацииКомплекснойСтавки(СтрокаТЧ);
				
			ИначеЕсли ИмяПоля = "СпособВводаУчетныхЕдиниц" Тогда
				
				ОбработатьИзменениеСпособаВводаУчетныхЕдиницВСтрокеУслуг(СтрокаТЧ);
				
			ИначеЕсли ИмяПоля = "СвободныйПериодХраненияПриОтправке"
					Или ИмяПоля = "СвободныйПериодХраненияПриПриеме"
					Или ИмяПоля = "СвободныйПериодХраненияУслугиДепо"
					Или ИмяПоля = "СвободныйПериодХранения"
					Или ИмяПоля = "СвободныйПериодХраненияВаг"
					Или ИмяПоля = "СвободныйПериодХраненияКТК" Тогда
					
				ОбработатьИзменениеПериодаХраненияВСтроке(СтрокаТЧ, Ложь);	
			//Евросиб Шевченко А.В. US 110215 TA 128335 12.03.2026	
			ИначеЕсли ИмяПоля = "Коносамент" Тогда
				Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Фрахт ИЛИ Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.ТЭО Тогда	
					КоносаментПриИзмененииСервер(СтрокаТЧ.ПолучитьИдентификатор());
				КонецЕсли;
			//Евросиб Шевченко А.В. US 110215 TA 128335 12.03.2026	
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
				
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, ДанныеЗаполнения);
								
				Если ДанныеЗаполнения.Свойство("ПроверкаСтавок") Тогда
					ИзменилисьРезультатыПроверкиСтавок = Истина;
					КлючНормативнойСтавкиПустаяСсылка = Справочники.КлючиАналитикиСтрокПротокола.ПустаяСсылка();
					СтрокиКритериев = Объект.КритерииУслуг.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", СтрокаТЧ.ИдентификаторСтрокиУслуг));
					Для Каждого Стр Из СтрокиКритериев Цикл
						Стр.КлючНормативнойСтавки = КлючНормативнойСтавкиПустаяСсылка;
					КонецЦикла;
				КонецЕсли;
				
			КонецЕсли;
			
			ОбработанныеСтроки.Добавить(СтрокаТЧ);
			
		КонецЕсли;
		
	КонецЦикла;

	Если ИмяПоля = "Нормативы" Тогда
		//УстановитьВидимостьГруппыПоЗначениюПоля(Объект.Услуги, Элементы.УслугиГруппаНормативыПараметры, ИмяПоля);
		УстановитьВидимостьГруппПоНормативам();
	ИначеЕсли ИмяПоля = "ОпасныйСпецГруз" Тогда
		УстановитьВидимостьГруппыПоЗначениюПоля(Объект.Услуги, Элементы.УслугиГруппаОпасностьГруза, ИмяПоля);
	ИначеЕсли ИмяПоля = "ОсобыйТемпературныйРежим" Тогда
		УстановитьВидимостьГруппыПоЗначениюПоля(Объект.Услуги, Элементы.УслугиОсобыйТемпературныйРежимЗначение, ИмяПоля);
	КонецЕсли;
	
	ОбновитьДинамическиеПоляТаблицыУслуг(ОбработанныеСтроки, Ложь);
	
	ПроверитьИУстановитьПризнакТиповой();
	
	Если ИзменилисьРезультатыПроверкиСтавок Тогда
		ОбновитьГруппуПротоколовНормативныхСтавок();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СформироватьСтрокиКритериевПоТипоразмерамКТКСтрокиТаблицыУслуг(СтрокаТЧ)
	
	СтрокиКритериев = Объект.КритерииУслуг.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", СтрокаТЧ.ИдентификаторСтрокиУслуг));
	
	ДанныеЗаполненияСтроки = Новый Структура;
	ДанныеЗаполненияСтроки.Вставить("ИдентификаторСтрокиУслуг", СтрокаТЧ.ИдентификаторСтрокиУслуг);
	
	ЗаполненныеСтроки = Новый Массив;
	
	СписочныеПоля = Новый Массив;
	СписочныеПоля.Добавить(Новый Структура("ИмяСписочногоПоля, ИмяПоляКритерия, ПустоеЗначение", "ВидыОтправок", "ВидОтправки", Перечисления.ВидыОтправок.ПустаяСсылка()));
	СписочныеПоля.Добавить(Новый Структура("ИмяСписочногоПоля, ИмяПоляКритерия, ПустоеЗначение", "ТипоразмерыКТК", "ТипоразмерКТК", Справочники.ТипоразмерыТЕ.ПустаяСсылка()));
	СписочныеПоля.Добавить(Новый Структура("ИмяСписочногоПоля, ИмяПоляКритерия, ПустоеЗначение", "ТипоразмерыВагонов", "ТипоразмерВагона", Справочники.ТипоразмерыТС.ПустаяСсылка()));
	
	ПоследнийИндекс = СписочныеПоля.ВГраница();
	ДобавитьСтрокиТаблицыКритерииУслуг(СтрокаТЧ, ДанныеЗаполненияСтроки, СписочныеПоля, 0, ПоследнийИндекс, ЗаполненныеСтроки); 
	
	//Если ЗначениеЗаполнено(СтрокаТЧ.ТипоразмерыКТК) Тогда			
	//	Для Каждого ЭлементСписка Из СтрокаТЧ.ТипоразмерыКТК Цикл
	//		ТипоразмерКТК = ЭлементСписка.Значение;
	//		ДанныеЗаполненияСтроки.Вставить("ТипоразмерКТК", ТипоразмерКТК);
	//		
	//		Если ЗначениеЗаполнено(СтрокаТЧ.ВидыОтправок) Тогда			
	//			Для Каждого ЭлементСпискаВидыОтправок Из СтрокаТЧ.ВидыОтправок Цикл
	//				ВидОтправки = ЭлементСпискаВидыОтправок.Значение;
	//				ДанныеЗаполненияСтроки.Вставить("ВидОтправки", ВидОтправки);					
	//				ЗаполнитьСтрокуТаблицыКритерииУслуг(ДанныеЗаполненияСтроки, ЗаполненныеСтроки);			
	//			КонецЦикла;
	//		Иначе
	//			ДанныеЗаполненияСтроки.Вставить("ВидОтправки", Перечисления.ВидыОтправок.ПустаяСсылка());
	//			ЗаполнитьСтрокуТаблицыКритерииУслуг(ДанныеЗаполненияСтроки, ЗаполненныеСтроки);		
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//Иначе
	//	ДанныеЗаполненияСтроки.Вставить("ТипоразмерКТК", Справочники.ТипоразмерыТЕ.ПустаяСсылка());
	//	ЗаполнитьСтрокуТаблицыКритерииУслуг(ДанныеЗаполненияСтроки, ЗаполненныеСтроки);
	//	
	//	Если ЗначениеЗаполнено(СтрокаТЧ.ВидыОтправок) Тогда			
	//		Для Каждого ЭлементСпискаВидыОтправок Из СтрокаТЧ.ВидыОтправок Цикл
	//			ВидОтправки = ЭлементСпискаВидыОтправок.Значение;
	//			ДанныеЗаполненияСтроки.Вставить("ВидОтправки", ВидОтправки);					
	//			ЗаполнитьСтрокуТаблицыКритерииУслуг(ДанныеЗаполненияСтроки, ЗаполненныеСтроки);			
	//		КонецЦикла;
	//	Иначе
	//		ДанныеЗаполненияСтроки.Вставить("ВидОтправки", Перечисления.ВидыОтправок.ПустаяСсылка());
	//		ЗаполнитьСтрокуТаблицыКритерииУслуг(ДанныеЗаполненияСтроки, ЗаполненныеСтроки);		
	//	КонецЕсли;
	//		
	//КонецЕсли;
	
	Для Каждого НайденнаяСтрока Из СтрокиКритериев Цикл
		Если ЗаполненныеСтроки.Найти(НайденнаяСтрока.ПолучитьИдентификатор()) = Неопределено Тогда
			Объект.КритерииУслуг.Удалить(НайденнаяСтрока);
		КонецЕсли;
	КонецЦикла;
					
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокиТаблицыКритерииУслуг(СтрокаТЧ, ДанныеЗаполненияСтроки, СписочныеПоля, ИндексПоля, ПоследнийИндекс, ЗаполненныеСтроки)
	
	Если ИндексПоля > ПоследнийИндекс Тогда
		ЗаполнитьСтрокуТаблицыКритерииУслуг(ДанныеЗаполненияСтроки, ЗаполненныеСтроки);
	Иначе
		СтруктураПоля = СписочныеПоля[ИндексПоля];
		ИмяСписочногоПоля = СтруктураПоля.ИмяСписочногоПоля;
		ИмяПоляКритерия = СтруктураПоля.ИмяПоляКритерия;
		Если ЗначениеЗаполнено(СтрокаТЧ[ИмяСписочногоПоля]) Тогда			
			Для Каждого ЭлементСписка Из СтрокаТЧ[ИмяСписочногоПоля] Цикл
				ЗначениеЭлемента = ЭлементСписка.Значение;
				ДанныеЗаполненияСтроки.Вставить(ИмяПоляКритерия, ЗначениеЭлемента);
				ДобавитьСтрокиТаблицыКритерииУслуг(СтрокаТЧ, ДанныеЗаполненияСтроки, СписочныеПоля, ИндексПоля + 1, ПоследнийИндекс, ЗаполненныеСтроки);			
			КонецЦикла;
		Иначе
			ДанныеЗаполненияСтроки.Вставить(ИмяПоляКритерия, СтруктураПоля.ПустоеЗначение);
			ДобавитьСтрокиТаблицыКритерииУслуг(СтрокаТЧ, ДанныеЗаполненияСтроки, СписочныеПоля, ИндексПоля + 1, ПоследнийИндекс, ЗаполненныеСтроки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокуТаблицыКритерииУслуг(ДанныеЗаполненияСтроки, ЗаполненныеСтроки)
	
	НайденныеСтроки = Объект.КритерииУслуг.НайтиСтроки(ДанныеЗаполненияСтроки);
	Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
		ЗаполненныеСтроки.Добавить(НайденныеСтроки[0].ПолучитьИдентификатор());
	Иначе
		НоваяСтрока = Объект.КритерииУслуг.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеЗаполненияСтроки);
		ЗаполненныеСтроки.Добавить(НоваяСтрока.ПолучитьИдентификатор());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначенияРеквизитовНоменклатурыУслуг()
	
	ТаблицаНоменклатуры = Объект.Услуги.Выгрузить(, "Номенклатура");
	ТаблицаНоменклатуры.Свернуть("Номенклатура");
	МассивНоменклатуры = ТаблицаНоменклатуры.ВыгрузитьКолонку("Номенклатура");
	СтавкиНДС = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивНоменклатуры, "СтавкаНДСПоставщика, ЕдиницаИзмерения");
	
	Возврат СтавкиНДС;
		
КонецФункции

&НаКлиенте
Процедура АннулироватьТариф(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВнестиСтавкиИзExcel(Команда)
	
	ОткрытьФормуВнесенияСтавокИзExcel("ЗагружатьИзExcel");	
	
КонецПроцедуры

&НаКлиенте
Процедура ВнестиСтавкиИзExcelПростаяФорма(Команда)
	
	ОткрытьФормуВнесенияСтавокИзExcel("ЗагружатьИзExcelВПростойФорме");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВнесенияСтавокИзExcel(ВариантФормы)
	
	АдресТаблицыОписанияРеквизитов = ПоместитьОписаниеПолейВоВременноеХранилище(Объект.ВидУслугПоставщика, Новый УникальныйИдентификатор); 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресТаблицыОписанияРеквизитов", АдресТаблицыОписанияРеквизитов);
	ПараметрыФормы.Вставить("ВариантФормы", ВариантФормы);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("АдресТаблицыОписанияРеквизитов", АдресТаблицыОписанияРеквизитов);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПриЗакрытииФормыЗагрузкиИзExcel", ЭтаФорма, ДопПараметры);
	
	ОткрытьФорму("Документ.ПСЦПоставщика.Форма.ФормаЗагрузкиИзExcel", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыЗагрузкиИзExcel(АдресТаблицы, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(АдресТаблицы) Тогда
		ЗагрузитьПрочитаннуюТаблицу(АдресТаблицы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПрочитаннуюТаблицу(АдресТаблицы)
	
	Таблица = ПолучитьИзВременногоХранилища(АдресТаблицы);
	УдалитьИзВременногоХранилища(АдресТаблицы);
	
	Если ЗначениеЗаполнено(ПараметрыВидаУслуг.ВалютаПоУмолчанию) Тогда
		ВалютаПоУмолчанию = ПараметрыВидаУслуг.ВалютаПоУмолчанию;
	Иначе
		ВалютаПоУмолчанию = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор, "ВалютаВзаиморасчетов");
	КонецЕсли;
	
	ПроверятьНормуЗагрузкиКТК = Ложь;
	Если Таблица.Колонки.Найти("НормаЗагрузкиКТК") <> Неопределено Тогда		
		ПроверятьНормуЗагрузкиКТК = Истина;
		СоответствиеВесовТипоразмерам = ПолучитьСоответствиеВесовТипоразмерам();		
	КонецЕсли;
	
	Если Таблица.Колонки.Найти("КонтейнерыВагоны") <> Неопределено И Таблица.Колонки.Найти("КонтейнерыВагоныСписок") <> Неопределено Тогда
		ПроверятьКонтейнерыВагоны = Истина;
	Иначе
		ПроверятьКонтейнерыВагоны = Ложь;
	КонецЕсли;
	
	Если Таблица.Колонки.Найти("ТипоразмерыКТК") <> Неопределено И Таблица.Колонки.Найти("ТипоразмерыКТКСписок") <> Неопределено Тогда
		ЗагружатьТипоразмерыКТК = Истина;
	Иначе
		ЗагружатьТипоразмерыКТК = Ложь;
	КонецЕсли;
	//Евросиб Шевченко А.В. US 124811 TA 129059 13.03.2026
	Если Таблица.Колонки.Найти("КлассыОпасности") <> Неопределено И Таблица.Колонки.Найти("КлассыОпасностиСписок") <> Неопределено Тогда
		ЗагружатьКлассыОпасности = Истина;
	Иначе
		ЗагружатьКлассыОпасности = Ложь;
	КонецЕсли;
	
	Если Таблица.Колонки.Найти("КлассОпасностиСтрокой") <> Неопределено И Таблица.Колонки.Найти("КлассыОпасностиСписок") <> Неопределено Тогда
		ЗагружатьКлассыОпасности = Истина;
	Иначе
		ЗагружатьКлассыОпасности = Ложь;
	КонецЕсли;	
	//Евросиб Шевченко А.В. US 124811 TA 129059 13.03.2026
	Если Таблица.Колонки.Найти("ТипоразмерыКТКСтрокой") <> Неопределено И Таблица.Колонки.Найти("ТипоразмерыКТКСписок") <> Неопределено Тогда
		ЗагружатьТипоразмерыКТКСтрокой = Истина;
	Иначе
		ЗагружатьТипоразмерыКТКСтрокой = Ложь;
	КонецЕсли;
	
	Если Таблица.Колонки.Найти("ТипоразмерыВагоновСписок") <> Неопределено Тогда
		ЗагружатьТипоразмерыВагоновСписок = Истина;
	Иначе
		ЗагружатьТипоразмерыВагоновСписок = Ложь;
	КонецЕсли;
	
	Если Таблица.Колонки.Найти("ВидыОтправокСписок") <> Неопределено Тогда
		ЗагружатьВидыОтправок = Истина;
	Иначе
		ЗагружатьВидыОтправок = Ложь;
	КонецЕсли;
	
	Если Таблица.Колонки.Найти("ПериодПредоставления") <> Неопределено Тогда
		ЗагружатьПериодПредоставления = Истина;
	Иначе
		ЗагружатьПериодПредоставления = Ложь;
	КонецЕсли;
	//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
	Если Таблица.Колонки.Найти("СостоянияГруженыйПорожнийСтрокой") <> Неопределено Тогда
		ЗагружатьГруженыйПорожнийСтрокой = Истина;
	Иначе
		ЗагружатьГруженыйПорожнийСтрокой = Ложь;
	КонецЕсли;
	//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
	СписокИсключаемыхИзЗаполненияПолей = Новый Массив;
	Для Каждого Колонка Из Таблица.Колонки Цикл
		ОписаниеПоля = ПараметрыВидаУслуг.ПоляТаблицыУслуг.Получить(Колонка.Имя);
		Если ОписаниеПоля <> Неопределено И ОписаниеПоля.ТолькоПросмотр Тогда
			СписокИсключаемыхИзЗаполненияПолей.Добавить(Колонка.Имя);
		КонецЕсли;
	КонецЦикла;
	ИсключаемыеИзЗаполненияПоля = СтрСоединить(СписокИсключаемыхИзЗаполненияПолей, ",");
	
	Для Каждого Стр Из Таблица Цикл
		
		ТекДанные = Объект.Услуги.Добавить();
		ИдентификаторСтроки = ТекДанные.ПолучитьИдентификатор();
		ЗаполнитьЗначенияСвойств(ТекДанные, Стр,, ИсключаемыеИзЗаполненияПоля);
		ТекДанные.ИдентификаторСтрокиУслуг = Строка(Новый УникальныйИдентификатор);
		
		Для Каждого Элемент Из ПараметрыВидаУслуг.ЗначенияПолейПоУмолчанию Цикл
			Если Не ЗначениеЗаполнено(ТекДанные[Элемент.Ключ]) Тогда
				ТекДанные[Элемент.Ключ] = Элемент.Значение;
			КонецЕсли;
		КонецЦикла;
		//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
		Если ЗагружатьГруженыйПорожнийСтрокой И ЗначениеЗаполнено(Стр.СостоянияГруженыйПорожнийСтрокой) Тогда
			ТекДанные.СостоянияГруженыйПорожний.ЗагрузитьЗначения(Стр.СостоянияГруженыйПорожний.ВыгрузитьЗначения());
			ОбработатьИзменениеСостоянияГруженыйПорожнийСтрокиУслуг(ТекДанные);
		КонецЕсли;
		//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
		Если ЗагружатьТипоразмерыКТКСтрокой И ЗначениеЗаполнено(Стр.ТипоразмерыКТКСписок) Тогда
			ТекДанные.ТипоразмерыКТК.ЗагрузитьЗначения(Стр.ТипоразмерыКТКСписок.ВыгрузитьЗначения());
			ОбработатьИзмененияТипоразмеровКТКСтрокиУслуг(ТекДанные);
		КонецЕсли;
		
		Если ЗагружатьТипоразмерыКТК И ЗначениеЗаполнено(Стр.ТипоразмерыКТКСписок) Тогда
			ТекДанные.ТипоразмерыКТК.ЗагрузитьЗначения(Стр.ТипоразмерыКТКСписок.ВыгрузитьЗначения());
			ОбработатьИзмененияТипоразмеровКТКСтрокиУслуг(ТекДанные);
		КонецЕсли;
		//Евросиб Шевченко А.В. US 124811 TA 129059 13.03.2026
		Если ЗагружатьКлассыОпасности И ЗначениеЗаполнено(Стр.КлассыОпасностиСписок) Тогда
			ТекДанные.КлассыОпасности.ЗагрузитьЗначения(Стр.КлассыОпасностиСписок.ВыгрузитьЗначения());
			ОбработатьИзмененияКлассыОпасностиСтрокиУслуг(ТекДанные);
		КонецЕсли;
		//Евросиб Шевченко А.В. US 124811 TA 129059 13.03.2026
		Если ЗагружатьТипоразмерыВагоновСписок И ЗначениеЗаполнено(Стр.ТипоразмерыВагоновСписок) Тогда
			ТекДанные.ТипоразмерыВагонов.ЗагрузитьЗначения(Стр.ТипоразмерыВагоновСписок.ВыгрузитьЗначения());
			ОбработатьИзменениеТипоразмеровВагоновСтрокиУслуг(ТекДанные);
		КонецЕсли;
		
		Если ЗагружатьВидыОтправок И ЗначениеЗаполнено(Стр.ВидыОтправокСписок) Тогда
			ТекДанные.ВидыОтправок.ЗагрузитьЗначения(Стр.ВидыОтправокСписок.ВыгрузитьЗначения());
			ОбработатьИзменениеВидовОтправокСтрокиУслуг(ТекДанные);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекДанные.НоменклатураПоставщика) Тогда
			УслугиНоменклатураПоставщикаПриИзмененииСервер(ТекДанные);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекДанные.Номенклатура) Тогда
			ОбработатьИзменениеНоменклатурыВСтроке(ТекДанные);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекДанные.СтавкаНДС) Тогда
				
			Если ЗначениеЗаполнено(ТекДанные.Номенклатура) Тогда
				СтавкаНДСПоставщика = ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ТекДанные.Номенклатура, "СтавкаНДСПоставщика");
				Если ЗначениеЗаполнено(СтавкаНДСПоставщика) Тогда
					ТекДанные.СтавкаНДС = СтавкаНДСПоставщика;
				КонецЕсли;
			КонецЕсли;
			
		    Если Не ЗначениеЗаполнено(ТекДанные.СтавкаНДС) Тогда
				ТекДанные.СтавкаНДС = Объект.СтавкаНДС;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекДанные.ТипоразмерКТК_Вагона) Тогда
			ОбработатьИзменениеТипоразмераКТК_Вагона(ТекДанные);
		КонецЕсли;
		
		Если ПроверятьКонтейнерыВагоны И ЗначениеЗаполнено(Стр.КонтейнерыВагоныСписок) Тогда
			СоздатьСтрокиТаблицыПоУчетнымЕдиницам(ИдентификаторСтроки, Стр.КонтейнерыВагоныСписок.ВыгрузитьЗначения());
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекДанные.Валюта) Тогда
			ТекДанные.Валюта = ВалютаПоУмолчанию;
		КонецЕсли;
		
		Если ТекДанные.СтавкаПрогрессивная Тогда
			ОбработатьИзменениеПризнакаСтавкаПрогрессивнаяВСтроке(ТекДанные);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекДанные.НормаВремениНаПогрузкуВыгрузку) Тогда
			ОбработатьИзменениеНормыВремениНаПогрузкуВыгрузку(ТекДанные);
		КонецЕсли;
		
		Если ПроверятьНормуЗагрузкиКТК И ЗначениеЗаполнено(ТекДанные.НормаЗагрузкиКТК) Тогда
			
			ЗначениеНайдено = Ложь;
			Если ЗначениеЗаполнено(ТекДанные.ТипоразмерыКТК) Тогда				
				Для Каждого ТипоразмерКТК Из ТекДанные.ТипоразмерыКТК Цикл
					Веса = СоответствиеВесовТипоразмерам.Получить(ТипоразмерКТК.Значение);
					Если ЗначениеЗаполнено(Веса) И Веса.Найти(ТекДанные.НормаЗагрузкиКТК) <> Неопределено Тогда
						ЗначениеНайдено = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;							
			КонецЕсли;
			
			Если Не ЗначениеНайдено Тогда
				ТекДанные.НормаЗагрузкиКТК = Справочники.ВесаПоТипоразмерам.ПустаяСсылка();
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекДанные.СвободныйПериодХраненияПриОтправке)
				Или ЗначениеЗаполнено(ТекДанные.СвободныйПериодХраненияПриПриеме)
				Или ЗначениеЗаполнено(ТекДанные.СвободныйПериодХраненияУслугиДепо)
				Или ЗначениеЗаполнено(ТекДанные.СвободныйПериодХранения)
				Или ЗначениеЗаполнено(ТекДанные.СвободныйПериодХраненияВаг)
				Или ЗначениеЗаполнено(ТекДанные.СвободныйПериодХраненияКТК) Тогда
				
			ОбработатьИзменениеПериодаХраненияВСтроке(ТекДанные, Ложь);
		КонецЕсли;
		
		ПересчитатьСтоимостьСУчетомСтавкиНДС(ТекДанные);		
		ОбработатьИзменениеПризнакаОпасныйГруз(ТекДанные);		
		ОбработатьИзмененияПризнакаОсобыйТемпературныйРежим(ТекДанные);		
		
		ОбработатьИзменениеПризнакаНормативыВСтроке(ТекДанные);
		Если ЗагружатьПериодПредоставления Тогда			
			ТекДанные.НормаПользования = Стр.ПериодПредоставления;			
		КонецЕсли;		
		
		Если ЗначениеЗаполнено(ТекДанные.ПунктОтправления) Тогда
			ОбработатьИзменениеПунктаОтправленияВСтроке(ТекДанные);
		ИначеЕсли ЗначениеЗаполнено(ТекДанные.ПунктОтправленияГород) Тогда
			ОбработатьИзменениеГородаОтправленияВСтроке(ТекДанные);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекДанные.ПунктНазначения) Тогда
			ОбработатьИзменениеПунктаНазначенияВСтроке(ТекДанные);
		ИначеЕсли ЗначениеЗаполнено(ТекДанные.ПунктНазначенияГород) Тогда
			ОбработатьИзменениеГородаНазначенияВСтроке(ТекДанные);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекДанные.ГрузЕТСНГ) Тогда
			ТекДанные.ЕТСНГ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекДанные.ГрузЕТСНГ, "Код");
		ИначеЕсли ЗначениеЗаполнено(ТекДанные.ЕТСНГ) Тогда
			ТекДанные.ГрузЕТСНГ = ПолучитьГрузЕТСНГ(ТекДанные.ЕТСНГ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекДанные.ГрузГНГ) Тогда
			ТекДанные.ГНГ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекДанные.ГрузГНГ, "Код");
		ИначеЕсли ЗначениеЗаполнено(ТекДанные.ГНГ) Тогда
			ТекДанные.ГрузГНГ = ПолучитьГрузГНГ(ТекДанные.ГНГ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекДанные.Груз) Тогда
			ЗаполнитьКодыПоГрузу(ТекДанные);
		
			//РеквизитыГруза = ПолучитьГрузПоРеквизиту("ЕТСНГ", ТекДанные.ЕТСНГ);
			//ТекДанные.Груз = РеквизитыГруза.Груз;
			//ТекДанные.ГНГ = РеквизитыГруза.ГНГ;
		
			//РеквизитыГруза = ПолучитьГрузПоРеквизиту("ГНГ", ТекДанные.ГНГ);
			//ТекДанные.Груз = РеквизитыГруза.Груз;
			//ТекДанные.ГНГ = РеквизитыГруза.ГНГ;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекДанные.ГрузТНВЭД) Тогда
			ТекДанные.КодТНВЭД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекДанные.ГрузТНВЭД, "ТНВЭД");
		ИначеЕсли ЗначениеЗаполнено(ТекДанные.КодТНВЭД) Тогда
			ГрузТНВЭД = НайтиГрузТНВЭД(ТекДанные.КодТНВЭД);
			Если ЗначениеЗаполнено(ГрузТНВЭД) Тогда
				ТекДанные.ГрузТНВЭД = ГрузТНВЭД;
			КонецЕсли;
		КонецЕсли;
		
		УстановитьЗначениеПоляСостояниеГруженыйПорожний(ТекДанные);
		
		Если ЗначениеЗаполнено(ТекДанные.ЛокацияОказанияУслуги) Тогда
			ОбработатьИзменениеЛокацииОказанияУслугиВСтрокеУслуг(ТекДанные);
		КонецЕсли;
		
	КонецЦикла;
	
	ОбновитьДинамическиеПоляТаблицыУслуг();	
	УстановитьВидимостьГруппПоНормативам();
	УстановитьВидимостьГруппыПоЗначениюПоля(Объект.Услуги, Элементы.УслугиГруппаОпасностьГруза, "ОпасныйСпецГруз");
	УстановитьВидимостьГруппыПоЗначениюПоля(Объект.Услуги, Элементы.УслугиОсобыйТемпературныйРежимЗначение, "ОсобыйТемпературныйРежим");
	
	ПроверитьИУстановитьПризнакТиповой();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСоответствиеВесовТипоразмерам()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТипоразмерыТЕВеса.Ссылка КАК ТипоразмерКТК,
	|	ТипоразмерыТЕВеса.Вес КАК Вес
	|ИЗ
	|	Справочник.ТипоразмерыТЕ.Веса КАК ТипоразмерыТЕВеса
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипоразмерКТК,
	|	Вес";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СоответствиеВесовТипоразмерам = Новый Соответствие;
	Пока Выборка.СледующийПоЗначениюПоля("ТипоразмерКТК") Цикл
		Веса = Новый Массив;
		Пока Выборка.СледующийПоЗначениюПоля("Вес") Цикл
			Веса.Добавить(Выборка.Вес);
		КонецЦикла;
		СоответствиеВесовТипоразмерам.Вставить(Выборка.ТипоразмерКТК, Веса);
	КонецЦикла;
	
	Возврат СоответствиеВесовТипоразмерам;
	
КонецФункции

// + ОБЛАСТЬ СОСТОЯНИЯ

// Процедура обновляет панель текущего пользователя
&НаСервере
Процедура ОбновитьПанельТекущегоПользователя()
	
	МаршрутизацияСервер.ОбновитьПанельТекущегоПользователя(Объект, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
		
КонецПроцедуры

// Функция обновляет панель состояний документа для графического отражения его движения по состояниям
&НаСервере
Процедура ОбновитьПанельСостояний()

	МаршрутизацияСервер.ОбновитьПанельСостояний(ЭтотОбъект);
	
	КолСостоянийЗавершено = 0;
	
	Для каждого Стр из Объект.Ссылка.Состояния Цикл //Гудкова добавила ссылку
		
		Если Стр.Статус = Перечисления.СтатусыЭтапов.Выполнен Тогда
		
			КолСостоянийЗавершено = КолСостоянийЗавершено + 1;
		
		КонецЕсли;
		
	КонецЦикла;
	
	КоличествоСостоянийВсего = Объект.Ссылка.Состояния.Количество();	
	Если ЗначениеЗаполнено(Объект.Ссылка) И КолСостоянийЗавершено = КоличествоСостоянийВсего И КоличествоСостоянийВсего <> 0 Тогда
		Элементы.ГруппаИнформацияОДокументе.Видимость = Истина;
		
		Элементы.ПредупреждениеРедактирования.Заголовок = "Документ полностью отработан. Запись заблокирована";
	Иначе	
		Элементы.ГруппаИнформацияОДокументе.Видимость = Ложь;
	КонецЕсли;
	
    Элементы.СсылкаНаПротоколВДО.Видимость = ЗначениеЗаполнено(Объект.СсылкаНаВнутреннийДокументДО);

КонецПроцедуры

&НаКлиенте
Процедура ТекущийИсполнитель_СтатусПриИзменении(Элемент)
	//Евросиб Шевченко А.В. US 110215 TA 122847 10.11.2025
	Если ТекущийИсполнитель_Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен") И ТекущийИсполнитель_Состояние = ПредопределенноеЗначение("Справочник.Состояния.ПроверкаСогласованияОтправкаПодкреплениеПодписанногоПСЦ") И НЕ ЕстьСканКопияВПрисоедененныхФайлах(Объект.Ссылка) Тогда
		ПоказатьПредупреждение(,"Невозможно закрыть задачу маршрута, т.к. в присоединенных файлах нет скан-копии подписанного с двух сторон Протокола.");
		ТекущийИсполнитель_Статус = Неопределено;
		Возврат;
	КонецЕсли;
	//Евросиб Шевченко А.В. US 110215 TA 122847 10.11.2025
	// обновляем информацию по состоянию 
	МаршрутизацияКлиент.ТекущийИсполнитель_СтатусПриИзменении(Объект, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
	
	ОбновитьПанельСостояний();
	
КонецПроцедуры

&НаКлиенте
Процедура Делегировать(Команда)
	
	ОпОп = Новый ОписаниеОповещения("ВыборДелегирования", ЭтаФорма);
	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаВыбора",,,ЭтаФорма.УникальныйИдентификатор,,,ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборДелегирования(Параметр1 = неопределено, Параметр2 = неопределено) Экспорт
	
	Если Параметр1 = неопределено Тогда Возврат; КонецЕсли;
	
	Для Сч = 0 По Объект.Состояния.Количество()-1 Цикл
		
		Если Объект.Состояния[Сч].Состояние = ТекущийИсполнитель_Состояние Тогда
			ЗапомнилиСвязь = Объект.Состояния[Сч].ПредыдущиеЭтапы;
			Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Новый");
			НСтр = Объект.Состояния.Вставить(Сч);
			НСтр.Состояние = ПредопределенноеЗначение("Справочник.Состояния.ДелегированноеСогласование");
			НСтр.Исполнитель = Параметр1;
			НСтр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение");
			НСтр.ПредыдущиеЭтапы = ЗапомнилиСвязь;
			
			НомерНовойСтроки = НСтр.НомерСтроки;
			Для Сч2 = Сч+1 По Объект.Состояния.Количество()-1 Цикл
				Объект.Состояния[Сч2].ПредыдущиеЭтапы = ПлюсОдин(Объект.Состояния[Сч2].ПредыдущиеЭтапы, НомерНовойСтроки);
			КонецЦикла;
			
			ОбновитьПанельСостояний();
			Прервать;
		КонецЕсли;
		
		
		//Если Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение") ИЛИ Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.ВРаботе") Тогда
		//	Объект.Состояния[Сч].Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Новый");
		//	НСтр = Объект.Состояния.Вставить(Сч);
		//	НСтр.Состояние = ПредопределенноеЗначение("Справочник.Состояния.ДелегированноеСогласование");
		//	НСтр.Исполнитель = Параметр1;
		//	НСтр.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.НаВыполнение");
		//	ОбновитьПанельСостояний();
		//КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПлюсОдин(ПредыдущиеЭтапы, НомерНовойСтроки)
	
	НоваяСтрокаБэкапов = СтрЗаменить(ПредыдущиеЭтапы, " ", "");
	МассивЧИсле = СтрРазделить(НоваяСтрокаБэкапов, ",", Ложь);
	Для Сыч = 1 по МассивЧИсле.Количество()-1  Цикл
		Попытка
			ТекЧисло = Число(МассивЧИсле[Сыч]);
		Исключение
		КонецПопытки;
		Если ТекЧисло >= НомерНовойСтроки тогда
			МассивЧИсле[Сыч] = Строка(ТекЧисло + 1);
		КонецЕсли;
	КонецЦикла;
	Возврат СтрСоединить(МассивЧИсле, ",");
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиНоменклатуруПоставщика(Наименование, Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НоменклатураПоставщиков.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НоменклатураПоставщиков КАК НоменклатураПоставщиков
	|ГДЕ
	|	НоменклатураПоставщиков.Наименование = &Наименование
	|	И НоменклатураПоставщиков.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		НоменклатураПоставщика = Выборка.Ссылка;
	Иначе
		НоменклатураПоставщика = Справочники.НоменклатураПоставщиков.ПустаяСсылка();
	КонецЕсли;
	
	Возврат НоменклатураПоставщика;
	
КонецФункции

&НаКлиенте
Процедура УслугиОпасныйГрузПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;	
	УслугиОпасныйГрузПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	Иначе
		УстановитьВидимостьГруппыПоЗначениюПоля(Объект.Услуги, Элементы.УслугиГруппаОпасностьГруза, "ОпасныйСпецГруз");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиОпасныйГрузПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	
	УстановитьПризнакИзмененияГруза(ТекДанные); //Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	
	ОбработатьИзменениеПризнакаОпасныйГруз(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеПризнакаОпасныйГруз(СтрокаТЧ)
	
	Если Не СтрокаТЧ.ОпасныйСпецГруз Тогда
		СтрокаТЧ.СтандартОпасностиГруза = Неопределено;
		СтрокаТЧ.КлассОпасностиГруза = 0;
	КонецЕсли;
	
	УстановитьЗначениеПоляСостояниеГруженыйПорожний(СтрокаТЧ);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиНаименованиеНоменклатурыПоставщикаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;	
	ОткрытьФорму("Справочник.НоменклатураПоставщиков.ФормаВыбора", ПараметрыФормы, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиНаименованиеНоменклатурыПоставщикаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		ТекДанные = Элементы.Услуги.ТекущиеДанные;
		ТекДанные.НоменклатураПоставщика = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтанцииПогранпереходовНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	Если ТекДанные.СтанцииПогранПереходов = Неопределено Тогда
		
		ИдентификаторТекСтроки = ТекДанные.ПолучитьИдентификатор();
		
		СписокТипов = новый СписокЗначений;
		
		ДоступныеТипы = Элементы.УслугиСтанцииПогранПереходов.ОграничениеТипа.Типы();
		Если ЗначениеЗаполнено(ДоступныеТипы) Тогда
			СписокТипов.ЗагрузитьЗначения(ДоступныеТипы);
		Иначе
			СписокТипов.Добавить(Тип("СправочникСсылка.Локации"));
			СписокТипов.Добавить(Тип("СправочникСсылка.Мультилокации"));
		КонецЕсли;
	
		Если СписокТипов.Количество() > 1 Тогда
			
			СтандартнаяОбработка = Ложь;
			
			ДопПараметры = Новый Структура("ИдентификаторТекСтроки, ИмяПоля", ИдентификаторТекСтроки, "СтанцииПогранПереходов");
			ОповещениеОВыборе = Новый ОписаниеОповещения("ОбработкаВыбораТипаПоляЛокации", ЭтаФорма, ДопПараметры);
			
			СписокТипов.ПоказатьВыборЭлемента(ОповещениеОВыборе, "Выбор типа данных");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтанцииПогранпереходовОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;		
	ТекДанные.СтанцииПогранпереходов = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКонтейнерыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	ТипУчетныхЕдиниц = ТекДанные.ТипУчетныхЕдиниц;
	УчетныеЕдиницы = Новый Массив;
	СтрокиУчетныхЕдиниц = Объект.УчетныеЕдиницы.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", ТекДанные.ИдентификаторСтрокиУслуг));
	Для Каждого СтрокаУчетнойЕдиницы Из СтрокиУчетныхЕдиниц Цикл
		УчетныеЕдиницы.Добавить(СтрокаУчетнойЕдиницы.УчетнаяЕдиница);
	КонецЦикла;
	
	ДопПараметры = Новый Структура("ИдентификаторСтрокиУслуг, ИдентификаторСтроки, Удалять", ТекДанные.ИдентификаторСтрокиУслуг, ТекДанные.ПолучитьИдентификатор(), Истина);
	ОповещениеОВыборе = Новый ОписаниеОповещения("ОбработкаВыбораУчетныхЕдиниц", ЭтаФорма, ДопПараметры);
	
	Если ТекДанные.СпособВводаУчетныхЕдиниц = ПредопределенноеЗначение("Перечисление.СпособыВводаУчетныхЕдиниц.Списком") Тогда
		
		Если ТипУчетныхЕдиниц = "СправочникСсылка.ТЕ" Тогда
			ПараметрыФормы = Новый Структура("ТЕ, СоставТЕ", Истина, УчетныеЕдиницы);
		ИначеЕсли ТипУчетныхЕдиниц = "СправочникСсылка.ТС" Тогда
			ПараметрыФормы = Новый Структура("ТС, СоставТС", Истина, УчетныеЕдиницы);
		КонецЕсли;			
		
		ОткрытьФорму("ОбщаяФорма.ОкноРедактированияСоставаУчетныхЕдиниц", ПараметрыФормы, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,, ОповещениеОВыборе, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли ТекДанные.СпособВводаУчетныхЕдиниц = ПредопределенноеЗначение("Перечисление.СпособыВводаУчетныхЕдиниц.Построчно") Тогда
		
		ПараметрыФормы = Новый Структура;
		Если ЗначениеЗаполнено(УчетныеЕдиницы) Тогда
			ПараметрыФормы.Вставить("Ключ", УчетныеЕдиницы[0]);
		КонецЕсли;
		
		Если ТипУчетныхЕдиниц = "СправочникСсылка.ТЕ" Тогда
			ОткрытьФорму("Справочник.ТЕ.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОВыборе, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ИначеЕсли ТипУчетныхЕдиниц = "СправочникСсылка.ТС" Тогда
			ОткрытьФорму("Справочник.ТС.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОВыборе, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура УслугиВагоныНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;

	УчетныеЕдиницы = Новый Массив;
	СтрокиУчетныхЕдиниц = Объект.УчетныеЕдиницы.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", ТекДанные.ИдентификаторСтрокиУслуг));
	Для Каждого СтрокаУчетнойЕдиницы Из СтрокиУчетныхЕдиниц Цикл
		УчетныеЕдиницы.Добавить(СтрокаУчетнойЕдиницы.УчетнаяЕдиница);
	КонецЦикла;
	
	Если ТекДанные.ТипУчетныхЕдиниц = "СправочникСсылка.ТЕ" Тогда
		ПараметрыФормы = Новый Структура("ТЕ, СоставТЕ", Истина, УчетныеЕдиницы);
	ИначеЕсли ТекДанные.ТипУчетныхЕдиниц = "СправочникСсылка.ТС" Тогда
		ПараметрыФормы = Новый Структура("ТС, СоставТС", Истина, УчетныеЕдиницы);
	КонецЕсли;
	
	ДопПараметры = Новый Структура("ИдентификаторСтрокиУслуг, ИдентификаторСтроки, Удалять", ТекДанные.ИдентификаторСтрокиУслуг, ТекДанные.ПолучитьИдентификатор(), Истина);
	ОповещениеОВыборе = Новый ОписаниеОповещения("ОбработкаВыбораУчетныхЕдиниц", ЭтаФорма, ДопПараметры);
	ОткрытьФорму("ОбщаяФорма.ОкноРедактированияСоставаУчетныхЕдиниц", ПараметрыФормы,, ЭтаФорма.УникальныйИдентификатор,,, ОповещениеОВыборе, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура УслугиКонтейнерыВагоныНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;	
	ИдентификаторТекСтроки = ТекДанные.ПолучитьИдентификатор();
	ДопПараметры = Новый Структура("ИдентификаторТекСтроки", ИдентификаторТекСтроки);
	
	Если ТекДанные.СпособВводаУчетныхЕдиниц = ПредопределенноеЗначение("Перечисление.СпособыВводаУчетныхЕдиниц.Построчно")
			Или ТекДанные.СпособВводаУчетныхЕдиниц = ПредопределенноеЗначение("Перечисление.СпособыВводаУчетныхЕдиниц.Списком") Тогда
			
		Если ЗначениеЗаполнено(ПараметрыВидаУслуг.ТипУчетныхЕдиницДетализации) Тогда
			УслугиНомераКТКВагоновНачалоВыбораПродолжение(ТекДанные.ТипУчетныхЕдиниц, ДопПараметры);
		ИначеЕсли ЗначениеЗаполнено(ТекДанные.ТипУчетныхЕдиниц) Тогда
			УслугиНомераКТКВагоновНачалоВыбораПродолжение(ТекДанные.ТипУчетныхЕдиниц, ДопПараметры);
		Иначе
			СписокТипов = новый СписокЗначений;
			СписокТипов.Добавить("СправочникСсылка.ТС", "Вагон");
			СписокТипов.Добавить("СправочникСсылка.ТЕ", "Контейнер");
			ОповещениеОВыборе = Новый ОписаниеОповещения("УслугиНомераКТКВагоновНачалоВыбораПродолжение", ЭтаФорма, ДопПараметры);
			СписокТипов.ПоказатьВыборЭлемента(ОповещениеОВыборе, "Выбор типа данных");
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура УслугиНомераКТКВагоновНачалоВыбораПродолжение(ВыбранныйТип, ДопПараметры) Экспорт
	
	Если ВыбранныйТип <> Неопределено Тогда
		
		Если ТипЗнч(ВыбранныйТип) = Тип("ЭлементСпискаЗначений") Тогда
			ТипУчетныхЕдиниц = ВыбранныйТип.Значение;
		Иначе
			ТипУчетныхЕдиниц = ВыбранныйТип;
		КонецЕсли;
		
		ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ДопПараметры.ИдентификаторТекСтроки);
		
		УчетныеЕдиницы = Новый Массив;
		СтрокиУчетныхЕдиниц = Объект.УчетныеЕдиницы.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", ТекДанные.ИдентификаторСтрокиУслуг));
		Для Каждого СтрокаУчетнойЕдиницы Из СтрокиУчетныхЕдиниц Цикл
			УчетныеЕдиницы.Добавить(СтрокаУчетнойЕдиницы.УчетнаяЕдиница);
		КонецЦикла;
		
		Если ТипУчетныхЕдиниц = "СправочникСсылка.ТЕ" Тогда
			ПараметрыФормы = Новый Структура("ТЕ, СоставТЕ", Истина, УчетныеЕдиницы);
		ИначеЕсли ТипУчетныхЕдиниц = "СправочникСсылка.ТС" Тогда
			ПараметрыФормы = Новый Структура("ТС, СоставТС", Истина, УчетныеЕдиницы);
		КонецЕсли;
			
		ДопПараметры = Новый Структура("ИдентификаторСтрокиУслуг, ИдентификаторСтроки, Удалять", ТекДанные.ИдентификаторСтрокиУслуг, ДопПараметры.ИдентификаторТекСтроки, Истина);
		ОповещениеОВыборе = Новый ОписаниеОповещения("ОбработкаВыбораУчетныхЕдиниц", ЭтаФорма, ДопПараметры);
		ОткрытьФорму("ОбщаяФорма.ОкноРедактированияСоставаУчетныхЕдиниц", ПараметрыФормы,, ЭтаФорма.УникальныйИдентификатор,,, ОповещениеОВыборе, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьСписокВагоновИзExcel(Команда)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		
		//Если ТекДанные.ТипУчетныхЕдиниц = "СправочникСсылка.ТС" Тогда
			ДопПараметры = Новый Структура("ИдентификаторСтрокиУслуг, ИдентификаторСтроки, Удалять", ТекДанные.ИдентификаторСтрокиУслуг, ТекДанные.ПолучитьИдентификатор(), Ложь);
			ОповещениеОВыборе = Новый ОписаниеОповещения("ОбработкаВыбораУчетныхЕдиниц", ЭтаФорма, ДопПараметры);
			ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("Вагоны", Истина), , ЭтаФорма.УникальныйИдентификатор,,, ОповещениеОВыборе, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
		//Иначе
		//	ПоказатьПредупреждение(, "В данном виде услуг не предусмотрена детализация по Вагонам!");
		//КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьСписокКТКИзExcel(Команда)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		
		//Если ТекДанные.ТипУчетныхЕдиниц = "СправочникСсылка.ТЕ" Тогда
			ДопПараметры = Новый Структура("ИдентификаторСтрокиУслуг, ИдентификаторСтроки, Удалять", ТекДанные.ИдентификаторСтрокиУслуг, ТекДанные.ПолучитьИдентификатор(), Ложь);
			ОповещениеОВыборе = Новый ОписаниеОповещения("ОбработкаВыбораУчетныхЕдиниц", ЭтаФорма, ДопПараметры);
			ОткрытьФорму("ОбщаяФорма.ВставкаИзБуфераОбмена", Новый Структура("КТК", Истина), , ЭтаФорма.УникальныйИдентификатор,,, ОповещениеОВыборе, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		//Иначе
		//	ПоказатьПредупреждение(, "В данном виде услуг не предусмотрена детализация по Контейнерам!");
		//КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДетализацияКомплекснойСтавкиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	//Если Не ОтменаРедактирования Тогда
	//	
	//	ТекДанные = Элементы.ДетализацияКомплекснойСтавки.ТекущиеДанные;
	//	ИдентификаторСтрокиУслуг = ТекДанные.ИдентификаторСтрокиУслуг;
	//	
	//	Если ТекДанные.ПроцентОтСтавки = 0 Тогда
	//		Если ЗначениеЗаполнено(ТекДанные.НоменклатураПоставщика) Или ЗначениеЗаполнено(ТекДанные.Номенклатура) Тогда
	//			ПоказатьПредупреждение(, "Процент от ставки не должен быть равен 0. Необходимо исправить данные.");
	//			Отказ = Истина;
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//	СуммаПоСтрокам = 0;
	//	СтрокиДетализации = Объект.ДетализацияКомплекснойСтавки.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", ИдентификаторСтрокиУслуг));
	//	Для Каждого СтрокаДетализации Из СтрокиДетализации Цикл
	//		СуммаПоСтрокам = СуммаПоСтрокам + СтрокаДетализации.ПроцентОтСтавки;
	//	КонецЦикла;
	//	
	//	Если СуммаПоСтрокам > 100 Тогда
	//		ПоказатьПредупреждение(, "Сумма участия услуг в комплексной ставке по всем строкам не должна превышать 100%. Необходимо исправить данные.");
	//		Отказ = Истина;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуПоСтрокамДетализацииКомплекснойСтавки(ТекДанныеУслуги)
	
	СуммаПоСтрокам = 0;
	
	Если ТекДанныеУслуги <> Неопределено Тогда
		СтрокиДетализации = Объект.ДетализацияКомплекснойСтавки.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", ТекДанныеУслуги.ИдентификаторСтрокиУслуг));
		Для Каждого СтрокаДетализации Из СтрокиДетализации Цикл
			СуммаПоСтрокам = СуммаПоСтрокам + СтрокаДетализации.ПроцентОтСтавки;
		КонецЦикла;
	КонецЕсли;
	
	Элементы.ДетализацияКомплекснойСтавкиПроцентОтСтавки.ТекстПодвала = СтрШаблон("Итого (%%): %1", Формат(СуммаПоСтрокам, "ЧДЦ=3; ЧН=0,000"));
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиАдресСкладаПогрузкиВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	ТипАдрес = Тип("СправочникСсылка.АдресаВНаселенныхПунктах");
	ТипМультиадрес = Тип("СправочникСсылка.Мультиадреса");
	
	Если ТекДанные.АдресСкладаПогрузкиВыгрузки = Неопределено Тогда
		
		ИдентификаторТекСтроки = ТекДанные.ПолучитьИдентификатор();
		
		СписокТипов = новый СписокЗначений;
		
		ДоступныеТипы = Элементы.УслугиАдресСкладаПогрузкиВыгрузки.ОграничениеТипа.Типы();
		Если ЗначениеЗаполнено(ДоступныеТипы) Тогда
			СписокТипов.ЗагрузитьЗначения(ДоступныеТипы);
		Иначе
			СписокТипов.Добавить(ТипАдрес);
			СписокТипов.Добавить(ТипМультиадрес);
		КонецЕсли;
	
		Если СписокТипов.Количество() > 1 Тогда
			
			СтандартнаяОбработка = Ложь;
			
			ДопПараметры = Новый Структура("ИдентификаторТекСтроки", ИдентификаторТекСтроки);
			ОповещениеОВыборе = Новый ОписаниеОповещения("УслугиАдресСкладаПогрузкиВыгрузкиОбработкаВыбораТипа", ЭтаФорма, ДопПараметры);
			
			СписокТипов.ПоказатьВыборЭлемента(ОповещениеОВыборе, "Выбор типа данных");
			
		ИначеЕсли СписокТипов.Количество() = 1 Тогда
			
			Если СписокТипов[0].Значение = ТипМультиадрес Тогда
				ТекДанные.АдресСкладаПогрузкиВыгрузки = ПредопределенноеЗначение("Справочник.Мультиадреса.ПустаяСсылка");
			ИначеЕсли СписокТипов[0].Значение = ТипАдрес Тогда
				ТекДанные.АдресСкладаПогрузкиВыгрузки = ПредопределенноеЗначение("Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ТекДанные.АдресСкладаПогрузкиВыгрузки) = ТипАдрес Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
		ПараметрыФормы.Вставить("ПоказыватьВыборАдреса", Истина);
		
		ТипыЛокацийМассив = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПредопределенноеЗначение("Справочник.ТипыЛокаций.АдресВНаселенномПункте"));	
		ПараметрыОтбора = Новый Структура("Тип", ТипыЛокацийМассив);
		ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
		
		ОткрытьФорму("Справочник.Локации.ФормаВыбора", ПараметрыФормы, Элемент, ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиАдресСкладаПогрузкиВыгрузкиОбработкаВыбораТипа(ВыбранныйТип, ДопПараметры) Экспорт
	
	Если ВыбранныйТип <> Неопределено Тогда
		
		ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ДопПараметры.ИдентификаторТекСтроки);
		Если ВыбранныйТип.Значение = Тип("СправочникСсылка.Мультиадреса") Тогда
			ТекДанные.АдресСкладаПогрузкиВыгрузки = ПредопределенноеЗначение("Справочник.Мультиадреса.ПустаяСсылка");
		Иначе
			ТекДанные.АдресСкладаПогрузкиВыгрузки = ПредопределенноеЗначение("Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиАдресСкладаПогрузкиВыгрузкиОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;		
	ТекДанные.АдресСкладаПогрузкиВыгрузки = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиАдресСкладаПогрузкиВыгрузкиСоздание(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	Если ТипЗнч(ТекДанные.АдресСкладаПогрузкиВыгрузки) = Тип("СправочникСсылка.АдресаВНаселенныхПунктах") Тогда
		
		СтандартнаяОбработка = Ложь;
			
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
		ПараметрыФормы.Вставить("ПоказыватьВыборАдреса", Истина);
		
		ТипыЛокацийМассив = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПредопределенноеЗначение("Справочник.ТипыЛокаций.АдресВНаселенномПункте"));	
		ПараметрыОтбора = Новый Структура("Тип", ТипыЛокацийМассив);
		ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
		
		ОткрытьФорму("Справочник.Локации.ФормаВыбора", ПараметрыФормы, Элемент, ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоверенностьЗаРуководителяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Настройки = Новый НастройкиКомпоновкиДанных;
	ГруппаОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	СписокФизЛиц = ПолучитьСписокФизЛицВходящихВГруппуПользователейУправление();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "ФизЛицо", СписокФизЛиц,
			ВидСравненияКомпоновкиДанных.ВСписке,, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ,);

	//следующие условия отбора аналогичны условиям из Функции БухгалтерскийУчетОбщиеПроцедурыСервер.НайтиДействующиеДоверенностиНаПодпись
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "ДатаОкончанияДейставия", 
			?(ЗначениеЗаполнено(Объект.НачалоДействия), Объект.НачалоДействия, НачалоДня(ТекущаяДата())),
			ВидСравненияКомпоновкиДанных.БольшеИлиРавно,, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ,); 
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "ДатаНачалаДействия", 
			?(ЗначениеЗаполнено(Объект.НачалоДействия), Объект.НачалоДействия, НачалоДня(ТекущаяДата())),
			ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ,); 
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "ДоверенностьДляПодписанта", 
		ПредопределенноеЗначение("Перечисление.ОтветственныеЛицаОрганизации.Руководитель"), ВидСравненияКомпоновкиДанных.Равно,, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ,); 
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "ИспользоватьДляДокументов",	"%Протокол%", ВидСравненияКомпоновкиДанных.Подобно,, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ,); 
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "ЦФУ", Объект.ЦФО, ВидСравненияКомпоновкиДанных.Равно,, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ,); 
	//пометка на удаление уже выбрано в настройках списка формы выбора
	//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "ПометкаУдаления", Ложь, ВидСравненияКомпоновкиДанных.Равно,, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ,); 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФиксированныеНастройки", Настройки);

	ОткрытьФорму("Справочник.Доверенности.Форма.ФормаВыбора", ПараметрыФормы, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
  
&НаСервереБезКонтекста
Функция ПолучитьСписокФизЛицВходящихВГруппуПользователейУправление()
	Возврат Справочники.ГруппыПользователей.ПолучитьСписокФизЛицПоГруппеПользователей(ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ГруппыПользователей.Управление"));
КонецФункции

//&НаКлиенте
//Процедура УслугиТерминалВыдачиПостановкиКТКПриИзменении(Элемент)
//	
//	ТекДанные = Элементы.Услуги.ТекущиеДанные;
//	Если ЗначениеЗаполнено(ТекДанные.ТерминалВыдачиПостановкиКТК) И ТипЗнч(ТекДанные.ТерминалВыдачиПостановкиКТК) = Тип("СправочникСсылка.Локации") Тогда
//		ТекДанные.АдресТерминалаВыдачиПостановкиКТК = ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ТекДанные.ТерминалВыдачиПостановкиКТК, "Адрес");
//	Иначе
//		ТекДанные.АдресТерминалаВыдачиПостановкиКТК = Неопределено;
//	КонецЕсли;
//	
//КонецПроцедуры

&НаКлиенте
Процедура УслугиТипоразмерКТК_ВагонаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекДанные.ТипоразмерКТК_Вагона) Тогда
		Если ТекДанные.ЕдиницаИзмерения = ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.вагон") Тогда
			ТекДанные.ТипоразмерКТК_Вагона = ПредопределенноеЗначение("Справочник.ТипоразмерыТС.ПустаяСсылка");
		ИначеЕсли ТекДанные.ЕдиницаИзмерения = ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.ктк") Тогда
			ТекДанные.ТипоразмерКТК_Вагона = ПредопределенноеЗначение("Справочник.ТипоразмерыТЕ.ПустаяСсылка");
		Иначе
			ТекДанные.ТипоразмерКТК_Вагона = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	ТипЗначения = ТипЗнч(ТекДанные.ТипоразмерКТК_Вагона);
	Если ТипЗначения = Тип("СправочникСсылка.ТипоразмерыТС") Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Справочник.ТипоразмерыТС.ФормаВыбора",, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.ТипоразмерыТЕ") Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Справочник.ТипоразмерыТЕ.ФормаВыбора",, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиТипоразмерКТК_ВагонаПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиТипоразмерКТК_ВагонаПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиТипоразмерКТК_ВагонаПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ОбработатьИзменениеТипоразмераКТК_Вагона(ТекДанные);
	ПроверитьСоответствиеНормеЗагрузкиКТКТипоразмеру(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеТипоразмераКТК_Вагона(ТекДанные)
	
	ТипВыбранногоЗначения = ТипЗнч(ТекДанные.ТипоразмерКТК_Вагона);
	Если ТипВыбранногоЗначения = Тип("СправочникСсылка.ТипоразмерыТС") Тогда
		ТекДанные.ТипоразмерВагона = ТекДанные.ТипоразмерКТК_Вагона;
		ТекДанные.ТипоразмерКТК = Неопределено;
	ИначеЕсли ТипВыбранногоЗначения = Тип("СправочникСсылка.ТипоразмерыТЕ") Тогда
		ТекДанные.ТипоразмерВагона = Неопределено;
		ТекДанные.ТипоразмерКТК = ТекДанные.ТипоразмерКТК_Вагона;
	Иначе
		ТекДанные.ТипоразмерВагона = Неопределено;
		ТекДанные.ТипоразмерКТК = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСоответствиеНормеЗагрузкиКТКТипоразмеру(ТекДанные)
	
	Если ЗначениеЗаполнено(ТекДанные.НормаЗагрузкиКТК) Тогда
		
		СоответствиеВесовТипоразмерам = ПолучитьСоответствиеВесовТипоразмерам();
		ЗначениеНайдено = Ложь;
		Если ЗначениеЗаполнено(ТекДанные.ТипоразмерыКТК) Тогда				
			Для Каждого ТипоразмерКТК Из ТекДанные.ТипоразмерыКТК Цикл
				Веса = СоответствиеВесовТипоразмерам.Получить(ТипоразмерКТК.Значение);
				Если ЗначениеЗаполнено(Веса) И Веса.Найти(ТекДанные.НормаЗагрузкиКТК) <> Неопределено Тогда
					ЗначениеНайдено = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;							
		КонецЕсли;
		
		Если Не ЗначениеНайдено Тогда
			ТекДанные.НормаЗагрузкиКТК = Справочники.ВесаПоТипоразмерам.ПустаяСсылка();
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура УслугиГрузПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиГрузПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиГрузПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);	
	УстановитьЗначениеПоляСостояниеГруженыйПорожний(ТекДанные);
	Если ЗначениеЗаполнено(ТекДанные.Груз) Тогда
		ЗаполнитьКодыПоГрузу(ТекДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКодыПоГрузу(ТекДанные)
	
	РеквизитыГруза = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекДанные.Груз, "ЕТСНГ, ГНГ");
	ТекДанные.ЕТСНГ = РеквизитыГруза.ЕТСНГ;
	ТекДанные.ГНГ = РеквизитыГруза.ГНГ;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЕТСНГПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиЕТСНГПриИзмененииСервер(ТекСтрока);	
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиЕТСНГПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	Если ЗначениеЗаполнено(ТекДанные.ЕТСНГ) Тогда
		//РеквизитыГруза = ПолучитьГрузПоРеквизиту("ЕТСНГ", ТекДанные.ЕТСНГ);
		//ТекДанные.Груз = РеквизитыГруза.Груз;
		//Если ЗначениеЗаполнено(РеквизитыГруза.Груз) Тогда
		//	ТекДанные.ГНГ = РеквизитыГруза.ГНГ;
		//КонецЕсли;
		ТекДанные.ГрузЕТСНГ = ПолучитьГрузЕТСНГ(ТекДанные.ЕТСНГ);
	Иначе
		ТекДанные.ГрузЕТСНГ = ПредопределенноеЗначение("Справочник.э_ЕТСНГ.ПустаяСсылка"); 
	КонецЕсли;
	
	УстановитьПризнакИзмененияГруза(ТекДанные); //Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	
	УстановитьЗначениеПоляСостояниеГруженыйПорожний(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиГНГПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиГНГПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиГНГПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	Если ЗначениеЗаполнено(ТекДанные.ГНГ) Тогда
		//РеквизитыГруза = ПолучитьГрузПоРеквизиту("ГНГ", ТекДанные.ГНГ);
		//ТекДанные.Груз = РеквизитыГруза.Груз;
		//Если ЗначениеЗаполнено(РеквизитыГруза.Груз) Тогда
		//	ТекДанные.ЕТСНГ = РеквизитыГруза.ЕТСНГ;
		//КонецЕсли;
		ТекДанные.ГрузГНГ = ПолучитьГрузГНГ(ТекДанные.ГНГ);
	Иначе
		ТекДанные.ГрузГНГ = ПредопределенноеЗначение("Справочник.э_ГНГ.ПустаяСсылка");
		
	КонецЕсли;
	
	УстановитьПризнакИзмененияГруза(ТекДанные); //Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	
	УстановитьЗначениеПоляСостояниеГруженыйПорожний(ТекДанные);
	
КонецПроцедуры


&НаКлиенте
Процедура УслугиГрузЕТСНГПриИзменении(Элемент)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные.ГрузЕТСНГ) Тогда
		ТекДанные.ЕТСНГ = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ТекДанные.ГрузЕТСНГ, "Код");
	Иначе
		ТекДанные.ЕТСНГ = "";
	КонецЕсли;
	
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	Если Объект.ВидУслугПоставщика = ПредопределенноеЗначение("Справочник.ВидыУслугПоставщиков.Порты") ИЛИ Объект.ВидУслугПоставщика = ПредопределенноеЗначение("Справочник.ВидыУслугПоставщиков.ТЭО") Тогда
		УслугиГрузЕТСНГПриИзмененииСервер(ТекСтрока); 
	КонецЕсли;
	//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиГрузЕТСНГПриИзмененииСервер(ТекСтрока) //Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);	
	УстановитьПризнакИзмененияГруза(ТекДанные);
	УстановитьЗначениеПоляСостояниеГруженыйПорожний(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиГрузГНГПриИзменении(Элемент)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные.ГрузГНГ) Тогда
		ТекДанные.ГНГ = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ТекДанные.ГрузГНГ, "КодГНГСтрокой");
	Иначе
		ТекДанные.ГНГ = 0;
	КонецЕсли;
	
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	Если Объект.ВидУслугПоставщика = ПредопределенноеЗначение("Справочник.ВидыУслугПоставщиков.Порты") Тогда
		УслугиГрузГНГПриИзмененииСервер(ТекСтрока);
	КонецЕсли;
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиГрузГНГПриИзмененииСервер(ТекСтрока) //Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);	
	УстановитьПризнакИзмененияГруза(ТекДанные);
	УстановитьЗначениеПоляСостояниеГруженыйПорожний(ТекДанные);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьГрузЕТСНГ(КодЕТСНГ)
	
	Возврат Справочники.э_ЕТСНГ.НайтиПоКоду(КодЕТСНГ);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьГрузГНГ(КодГНГ)
	
	Возврат Справочники.э_ГНГ.НайтиПоРеквизиту("КодГНГСтрокой", КодГНГ);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьГрузПоРеквизиту(ИмяРеквизита, ЗначениеРеквизита)
	
	РеквизитыГруза = Новый Структура("Груз, ЕТСНГ, ГНГ");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Грузы.Ссылка КАК Груз,
	|	Грузы.ЕТСНГ КАК ЕТСНГ,
	|	Грузы.ГНГ КАК ГНГ
	|ИЗ
	|	Справочник.Грузы КАК Грузы
	|ГДЕ
	|	Грузы.ЕТСНГ = &ЕТСНГ
	|	И НЕ Грузы.ПометкаУдаления";
	
	Если ИмяРеквизита = "ГНГ" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Грузы.ЕТСНГ = &ЕТСНГ", "Грузы.ГНГ = &ГНГ");
	КонецЕсли;
	
	Запрос.УстановитьПараметр(ИмяРеквизита, ЗначениеРеквизита);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(РеквизитыГруза, Выборка);
	КонецЕсли;
	
	Возврат РеквизитыГруза;
	
КонецФункции

&НаКлиенте
Процедура УслугиВесГрузаПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	
	УслугиВесГрузаПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиВесГрузаПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	
	УстановитьПризнакИзмененияГруза(ТекДанные); //Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	
	УстановитьЗначениеПоляСостояниеГруженыйПорожний(ТекДанные);
	//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
	Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Порты ИЛИ Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Фрахт ИЛИ Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.ТЭО Тогда
		ТекДанные.НормаЗагрузкиКТК = ТекДанные.ВесГруза;
	КонецЕсли;	
	//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
КонецПроцедуры

&НаСервере
Процедура УстановитьПризнакИзмененияГруза(ТекДанные) //Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	//Евросиб Шевченко А.В. US 110215 TA 120129 06.10.2025
	//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
	Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Порты ИЛИ Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Фрахт ИЛИ Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.ТЭО Тогда
	//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025	
	//Евросиб Шевченко А.В. US 110215 TA 120129 06.10.2025	
		ТекДанные.БылиИзмененияГруза = Истина;
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура УстановитьЗначениеПоляСостояниеГруженыйПорожний(СтрокаТЧ)
	
	СостояниеГруженый = ПредопределенноеЗначение("Перечисление.СостоянияКТК.Груженый");
	СостояниеПорожний = ПредопределенноеЗначение("Перечисление.СостоянияКТК.Порожний");
		
	Если СтрокаТЧ.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.АвтоперевозкаГруженыйКонтейнер") Тогда
		СтрокаТЧ.СостоянияГруженыйПорожний.Очистить();
		СтрокаТЧ.СостоянияГруженыйПорожний.Добавить(СостояниеГруженый);
	ИначеЕсли СтрокаТЧ.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.АвтоперевозкаПорожнийКонтейнер") Тогда
		СтрокаТЧ.СостоянияГруженыйПорожний.Очистить();
		СтрокаТЧ.СостоянияГруженыйПорожний.Добавить(СостояниеПорожний);
	ИначеЕсли СтрокаТЧ.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ХранениеТерминалГруженыйКонтейнер") Тогда
		СтрокаТЧ.СостоянияГруженыйПорожний.Очистить();
		СтрокаТЧ.СостоянияГруженыйПорожний.Добавить(СостояниеГруженый);
	ИначеЕсли СтрокаТЧ.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ХранениеТерминалПорожнийКонтейнер") Тогда
		СтрокаТЧ.СостоянияГруженыйПорожний.Очистить();
		СтрокаТЧ.СостоянияГруженыйПорожний.Добавить(СостояниеПорожний);
		//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025	
	ИначеЕсли СтрокаТЧ.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.СНХранениеГруженогоКонтейнера") И Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Порты Тогда
		СтрокаТЧ.СостоянияГруженыйПорожний.Очистить();
		СтрокаТЧ.СостоянияГруженыйПорожний.Добавить(СостояниеГруженый);
	ИначеЕсли СтрокаТЧ.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.СНХранениеПорожнегоКонтейнера") И Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Порты Тогда
		СтрокаТЧ.СостоянияГруженыйПорожний.Очистить();
		СтрокаТЧ.СостоянияГруженыйПорожний.Добавить(СостояниеПорожний);	
	ИначеЕсли СтрокаТЧ.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ХранениеПортГруженыйКонтейнер") И Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Порты Тогда
		СтрокаТЧ.СостоянияГруженыйПорожний.Очистить();
		СтрокаТЧ.СостоянияГруженыйПорожний.Добавить(СостояниеГруженый);
	ИначеЕсли СтрокаТЧ.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ХранениеПортПорожнийКонтейнер") И Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Порты Тогда
		СтрокаТЧ.СостоянияГруженыйПорожний.Очистить();
		СтрокаТЧ.СостоянияГруженыйПорожний.Добавить(СостояниеПорожний);	
		//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025	
	Иначе
		//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
		//Евросиб Шевченко А.В. US 110215 TA 120129 06.10.2025
		//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
		Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Порты ИЛИ Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Фрахт ИЛИ Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.ТЭО Тогда
		//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025	
			//Евросиб Шевченко А.В. US 110215 TA 120129 06.10.2025	
			Если СтрокаТЧ.БылиИзмененияГруза Тогда
				Если ЗначениеЗаполнено(СтрокаТЧ.ВесГруза) Тогда
					СтрокаТЧ.СостоянияГруженыйПорожний.Очистить();
					СтрокаТЧ.СостоянияГруженыйПорожний.Добавить(СостояниеГруженый);
				ИначеЕсли ЗначениеЗаполнено(СтрокаТЧ.ГрузЕТСНГ) Тогда
					СтрокаТЧ.СостоянияГруженыйПорожний.Очистить();
					СтрокаТЧ.СостоянияГруженыйПорожний.Добавить(СостояниеГруженый);
				ИначеЕсли ЗначениеЗаполнено(СтрокаТЧ.ГрузГНГ) Тогда
					СтрокаТЧ.СостоянияГруженыйПорожний.Очистить();
					СтрокаТЧ.СостоянияГруженыйПорожний.Добавить(СостояниеГруженый);
				ИначеЕсли ЗначениеЗаполнено(СтрокаТЧ.ЕТСНГ) Тогда
					СтрокаТЧ.СостоянияГруженыйПорожний.Очистить();
					СтрокаТЧ.СостоянияГруженыйПорожний.Добавить(СостояниеГруженый);
				ИначеЕсли ЗначениеЗаполнено(СтрокаТЧ.ГНГ) И НЕ СтрокаТЧ.ГНГ = "0" Тогда
					СтрокаТЧ.СостоянияГруженыйПорожний.Очистить();
					СтрокаТЧ.СостоянияГруженыйПорожний.Добавить(СостояниеГруженый);
				//Евросиб Шевченко А.В. US 110215 TA 120129 06.10.2025	
				ИначеЕсли ЗначениеЗаполнено(СтрокаТЧ.КодТНВЭД) Тогда
					СтрокаТЧ.СостоянияГруженыйПорожний.Очистить();
					СтрокаТЧ.СостоянияГруженыйПорожний.Добавить(СостояниеГруженый);
				ИначеЕсли ЗначениеЗаполнено(СтрокаТЧ.ГрузТНВЭД) Тогда
					СтрокаТЧ.СостоянияГруженыйПорожний.Очистить();
					СтрокаТЧ.СостоянияГруженыйПорожний.Добавить(СостояниеГруженый);	
				//Евросиб Шевченко А.В. US 110215 TA 120129 06.10.2025	
				ИначеЕсли СтрокаТЧ.ОпасныйСпецГруз Тогда
					СтрокаТЧ.СостоянияГруженыйПорожний.Очистить();
					СтрокаТЧ.СостоянияГруженыйПорожний.Добавить(СостояниеГруженый);
				Иначе
					СтрокаТЧ.СостоянияГруженыйПорожний.Очистить();
					СтрокаТЧ.СостоянияГруженыйПорожний.Добавить(СостояниеПорожний);
					//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
					Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Фрахт ИЛИ Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.ТЭО Тогда
						СтрокаТЧ.СостоянияГруженыйПорожний.Очистить();
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
		
		//	
		//	ПоляТаблицыУслуг = ПараметрыВидаУслуг.ПоляТаблицыУслуг;
		//	ОписаниеПоляГруженыйПорожний = ПоляТаблицыУслуг.Получить("СостояниеГруженыйПорожний");
		//	ОписаниеПоляСостоянияГруженыйПорожний = ПоляТаблицыУслуг.Получить("СостоянияГруженыйПорожний");
		//	ОписаниеПоляСостоянияГруженыйПорожнийСтрокой = ПоляТаблицыУслуг.Получить("СостоянияГруженыйПорожнийСтрокой");
		//	
		//	//Если ОписаниеПоляГруженыйПорожний <> Неопределено И ОписаниеПоляГруженыйПорожний.ЗаполнятьАвтоматически Тогда
		//	Если ОписаниеПоляГруженыйПорожний <> Неопределено Или ОписаниеПоляСостоянияГруженыйПорожний <> Неопределено Или ОписаниеПоляСостоянияГруженыйПорожнийСтрокой <> Неопределено Тогда
		//		
		//		//Если одно из проверяемых полей заполнено, то считается что Груженый, иначе Порожний
		//		//а если проверяемые поля не используются, то признак СостояниеГруженыйПорожний не менять
		//		ПроверяемыеПоля = Новый Массив;
		//		ПроверяемыеПоля.Добавить("Груз");
		//		ПроверяемыеПоля.Добавить("ГрузЕТСНГ");
		//		ПроверяемыеПоля.Добавить("ГрузГНГ");
		//		ПроверяемыеПоля.Добавить("ВесГруза");
		//		ПроверяемыеПоля.Добавить("НормаЗагрузкиКТК");
		//		
		//		Груженый = Неопределено;
		//		Для Каждого ИмяПоля Из ПроверяемыеПоля Цикл
		//			ОписаниеПоля = ПоляТаблицыУслуг.Получить(ИмяПоля);
		//			Если ОписаниеПоля <> Неопределено Тогда
		//				Если ЗначениеЗаполнено(СтрокаТЧ[ИмяПоля]) Тогда
		//					Груженый = Истина;
		//					Прервать;
		//				Иначе
		//					Груженый = Ложь;
		//				КонецЕсли;
		//			КонецЕсли;
		//		КонецЦикла;
		//		
		//		Если Груженый <> Истина И ПоляТаблицыУслуг.Получить("ОпасныйСпецГруз") <> Неопределено Тогда
		//			Если СтрокаТЧ.ОпасныйСпецГруз Тогда
		//				Груженый = Истина;
		//			Иначе
		//				Груженый = Ложь;
		//			КонецЕсли;
		//		КонецЕсли;
		//		
		//		Если Груженый = Истина Тогда
		//			СтрокаТЧ.СостоянияГруженыйПорожний.Очистить();
		//			СтрокаТЧ.СостоянияГруженыйПорожний.Добавить(СостояниеГруженый);
		//		ИначеЕсли Груженый = Ложь Тогда
		//			СтрокаТЧ.СостоянияГруженыйПорожний.Очистить();
		//			СтрокаТЧ.СостоянияГруженыйПорожний.Добавить(СостояниеПорожний);
		//		КонецЕсли;
		//		
		//	Иначе
		//		СтрокаТЧ.СостоянияГруженыйПорожний.Очистить();			
		
	КонецЕсли;

	ОбработатьИзменениеСостоянияГруженыйПорожнийСтрокиУслуг(СтрокаТЧ);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСпособВводаУчетныхЕдиницПриИзменении(Элемент)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	
	УслугиСпособВводаУчетныхЕдиницПриИзмененииСервер(ТекСтрока);	
	УстановитьВидимостьДоступностьЭлементовДетализацииПоУчетнымЕдиницам(ТекДанные);	
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиСпособВводаУчетныхЕдиницПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ОбработатьИзменениеСпособаВводаУчетныхЕдиницВСтрокеУслуг(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеСпособаВводаУчетныхЕдиницВСтрокеУслуг(ТекДанные)
	
	Если ТекДанные.СпособВводаУчетныхЕдиниц = Перечисления.СпособыВводаУчетныхЕдиниц.НеТребуется
			Или ТекДанные.СпособВводаУчетныхЕдиниц = Перечисления.СпособыВводаУчетныхЕдиниц.ПустаяСсылка() Тогда
		УдалитьСтрокуТаблицыУчетныхЕдиниц(, ТекДанные.ИдентификаторСтрокиУслуг);		
	КонецЕсли;
	
	ОбновитьПредставлениеУчетныхЕдиницСтрокиУслуг(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиТребуетсяДетализацияКомплекснойСтавкиПриИзменении(Элемент)
	
	ТекДанныеУслуги = Элементы.Услуги.ТекущиеДанные;
	УстановитьВидимостьДоступностьЭлементовДетализацииКомплекснойСтавки(ТекДанныеУслуги);
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиТребуетсяДетализацияКомплекснойСтавкиПриИзмененииСервер(ТекСтрока);
	
	РассчитатьСуммуПоСтрокамДетализацииКомплекснойСтавки(ТекДанныеУслуги);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиТребуетсяДетализацияКомплекснойСтавкиПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ОбработатьИзменениеПризнакаДетализацииКомплекснойСтавки(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеПризнакаДетализацииКомплекснойСтавки(СтрокаТЧ)
	
	ИдентификаторСтрокиУслуг = СтрокаТЧ.ИдентификаторСтрокиУслуг;
	СтрокиДетализации = Объект.ДетализацияКомплекснойСтавки.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", ИдентификаторСтрокиУслуг));
	
	Если СтрокаТЧ.ТребуетсяДетализацияКомплекснойСтавки Тогда
		Если Не ЗначениеЗаполнено(СтрокиДетализации) Тогда
			НоваяСтрока = Объект.ДетализацияКомплекснойСтавки.Добавить();
			НоваяСтрока.ИдентификаторСтрокиУслуг = ИдентификаторСтрокиУслуг;
			НоваяСтрока.Номенклатура = СтрокаТЧ.Номенклатура;			
		КонецЕсли;
	Иначе
		Для Каждого СтрокаДетализации Из СтрокиДетализации Цикл
			Объект.ДетализацияКомплекснойСтавки.Удалить(СтрокаДетализации);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктОтправленияНазначенияПриИзменении(Элемент)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	ТекДанные.ПунктОтправления = ТекДанные.ПунктОтправленияНазначения;
	ТекДанные.ПунктНазначения = ТекДанные.ПунктОтправленияНазначения;
	
	УслугиПунктОтправленияНазначенияПриИзмененииСервер(ТекДанные.ПолучитьИдентификатор());
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиПунктОтправленияНазначенияПриИзмененииСервер(ТекСтрока)
	
	УслугиПунктОтправленияПриИзмененииСервер(ТекСтрока);
	УслугиПунктНазначенияПриИзмененииСервер(ТекСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктОтправленияНазначенияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	
	ЛокацииПоТерминалу = ПолучитьЛокацииПоТерминалуКонтрагенту(Объект.Контрагент);
	Если ЗначениеЗаполнено(ЛокацииПоТерминалу) Тогда
		ПараметрыФормы.Вставить("Локации", ЛокацииПоТерминалу);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.Мультилокации.ФормаВыбора", ПараметрыФормы, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЛокацииПоТерминалуКонтрагенту(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Локации.Контрагент КАК Контрагент,
	|	Локации.Ссылка КАК Ссылка,
	|	ГоризонтальныеСвязиЛокаций.ЖДСтанция КАК ЖДСтанция,
	|	ГоризонтальныеСвязиЛокаций.Порт КАК Порт
	|ИЗ
	|	Справочник.Локации КАК Локации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГоризонтальныеСвязиЛокаций КАК ГоризонтальныеСвязиЛокаций
	|		ПО Локации.Ссылка = ГоризонтальныеСвязиЛокаций.Терминал
	|ГДЕ
	|	Локации.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);	
	ВыборкаЛокаций = Запрос.Выполнить().Выбрать();
	
	Локации = Новый Массив;
	Пока ВыборкаЛокаций.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаЛокаций.ЖДСтанция) Тогда
			Если Локации.Найти(ВыборкаЛокаций.ЖДСтанция) = Неопределено Тогда
				Локации.Добавить(ВыборкаЛокаций.ЖДСтанция);
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаЛокаций.Порт) Тогда
			Если Локации.Найти(ВыборкаЛокаций.Порт) = Неопределено Тогда
				Локации.Добавить(ВыборкаЛокаций.Порт);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Локации;
	
КонецФункции

&НаКлиенте
Процедура УслугиСтоимостьСНДСПрогрессивнаяНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда		
		УслугиСтоимостьПрогрессивнаяНачалоВыбора("СтоимостьСНДС", ТекДанные);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтоимостьБезНДСПрогрессивнаяНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда		
		УслугиСтоимостьПрогрессивнаяНачалоВыбора("СтоимостьБезНДС", ТекДанные);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтоимостьПрогрессивнаяНачалоВыбора(ИмяПоляСтоимость, ТекДанные)
	
	Модифицированность = Истина;
	
	ШкалаСтавок = Новый Массив;
	Для каждого Стр из Объект.ШкалаСтавок Цикл
		Если Стр.ИдентификаторСтрокиУслуг = ТекДанные.ИдентификаторСтрокиУслуг Тогда
			ШкалаСтавок.Добавить(Новый Структура("От, До, Стоимость", Стр.От, Стр.До, Стр[ИмяПоляСтоимость]));
		КонецЕсли;
	КонецЦикла;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИдентификаторСтрокиУслуг", ТекДанные.ИдентификаторСтрокиУслуг);
	ДопПараметры.Вставить("ИдентификаторСтроки", ТекДанные.ПолучитьИдентификатор());
	ДопПараметры.Вставить("ИмяПоляСтоимость", ИмяПоляСтоимость);
	ОповещениеОВводеПрогрессивнойСтавки = Новый ОписаниеОповещения("ОбработкаВводаПрогрессивнойСтавки", ЭтаФорма, ДопПараметры);
	ОткрытьФорму("Документ.ПСЦПоставщика.Форма.ФормаПрогрессивнойШкалы", Новый Структура("ШкалаСтавок", ШкалаСтавок),, ЭтаФорма.УникальныйИдентификатор,,, ОповещениеОВводеПрогрессивнойСтавки, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВводаПрогрессивнойСтавки(ШкалаСтавок, ДопПараметры) Экспорт
	
	Если ШкалаСтавок <> Неопределено Тогда
		ИдентификаторСтроки = ДопПараметры.ИдентификаторСтроки;
		ОбработкаВводаПрогрессивнойСтавкиСервер(ШкалаСтавок, ИдентификаторСтроки, ДопПараметры.ИмяПоляСтоимость);		
		Если ЗаполнятьВниз Тогда
			ВыполнитьЗаполнениеВниз(Неопределено);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВводаПрогрессивнойСтавкиСервер(ШкалаСтавок, ИдентификаторСтроки, ИмяПоляСтоимость)
	
	СтрокаУслуги = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);	
	ОбработкаВводаПрогрессивнойСтавкиПоСтрокеУслуг(ШкалаСтавок, СтрокаУслуги, ИмяПоляСтоимость);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВводаПрогрессивнойСтавкиПоСтрокеУслуг(ШкалаСтавок, СтрокаУслуги, ИмяПоляСтоимость)
	
	НайдСтроки = Объект.ШкалаСтавок.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", СтрокаУслуги.ИдентификаторСтрокиУслуг));
	Для Каждого Стр Из НайдСтроки Цикл
		Объект.ШкалаСтавок.Удалить(Стр);
	КонецЦикла;	
	
	СтрокиШкалы = Новый Массив;
	Для каждого Стр из ШкалаСтавок Цикл
			
		СтрокаШкалы = Объект.ШкалаСтавок.Добавить();
		СтрокаШкалы.ИдентификаторСтрокиУслуг = СтрокаУслуги.ИдентификаторСтрокиУслуг;
		СтрокаШкалы.От = Стр.От;
		СтрокаШкалы.До = Стр.До;
		СтрокаШкалы[ИмяПоляСтоимость] = Стр.Стоимость;
				
		СтрокиШкалы.Добавить(СтрокаШкалы);
		
	КонецЦикла;
	
	ПересчитатьСтоимостьПоШкалеСУчетомСтавкиНДС(СтрокаУслуги, ИмяПоляСтоимость, СтрокиШкалы);	
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСтоимостьПоШкалеСУчетомСтавкиНДС(СтрокаУслуги, ИмяПоляСтоимость, ШкалаСтавок = Неопределено)
	
	Если ШкалаСтавок = Неопределено Тогда
		ШкалаСтавок = Объект.ШкалаСтавок.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", СтрокаУслуги.ИдентификаторСтрокиУслуг));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ШкалаСтавок) Тогда		
		
		ЗначениеСтавкиНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСтавкуНДС(СтрокаУслуги.СтавкаНДС);
		СтоимостьСтрокиУслугЗаполнена = Ложь;
		
		Для Каждого СтрокаШкалы Из ШкалаСтавок Цикл
			
			Если ИмяПоляСтоимость = "СтоимостьСНДС" Тогда
				СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(СтрокаШкалы.СтоимостьСНДС, ЗначениеСтавкиНДС, Истина, Истина);
				СтрокаШкалы.СтоимостьБезНДС = СтрокаШкалы.СтоимостьСНДС - СуммаНДС;			
			Иначе			
				СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(СтрокаШкалы.СтоимостьБезНДС, ЗначениеСтавкиНДС, Истина, Ложь);
				СтрокаШкалы.СтоимостьСНДС = СтрокаШкалы.СтоимостьБезНДС + СуммаНДС;			
			КонецЕсли;
			
			//Стоимость в строке услуг заполняется первой значимой суммой шкалы
			Если Не СтоимостьСтрокиУслугЗаполнена 
					И (ЗначениеЗаполнено(СтрокаШкалы.СтоимостьСНДС) Или ЗначениеЗаполнено(СтрокаШкалы.СтоимостьБезНДС)) Тогда
				СтрокаУслуги.СтоимостьСНДС = СтрокаШкалы.СтоимостьСНДС;
				СтрокаУслуги.СтоимостьБезНДС = СтрокаШкалы.СтоимостьБезНДС;
				СтоимостьСтрокиУслугЗаполнена = Истина;
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьТекстСтавки(СтрокаУслуги, ШкалаСтавок);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекстСтавки(СтрокаУслуги, СтрокиШкалы = Неопределено)
	
	Если СтрокиШкалы = Неопределено Тогда
		СтрокиШкалы = Объект.ШкалаСтавок.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", СтрокаУслуги.ИдентификаторСтрокиУслуг));
	КонецЕсли;
	
	ТекстСтавкиСНДС = "";
	ТекстСтавкиБезНДС = "";
	Для каждого Стр из СтрокиШкалы Цикл
		
		Если Стр.СтоимостьСНДС <> 0 Или Стр.СтоимостьБезНДС <> 0 Тогда
			
			ТекстСтоимостьСНДС = Формат(Стр.СтоимостьСНДС, "ЧДЦ=2; ЧН=0,00");
			ТекстСтоимостьБезНДС = Формат(Стр.СтоимостьБезНДС, "ЧДЦ=2; ЧН=0,00");
			
			Если Стр.От = 0 И Стр.До = 0 Тогда
				ТекстСтавкиСНДС = ТекстСтоимостьСНДС;
				ТекстСтавкиБезНДС = ТекстСтоимостьБезНДС;
			ИначеЕсли Стр.От = 0 И Стр.До <> 0 Тогда
				ТекстСтавкиСНДС = "От 0 до " + Стр.До + " - " + ТекстСтоимостьСНДС + Символы.ПС;
				ТекстСтавкиБезНДС = "От 0 до " + Стр.До + " - " + ТекстСтоимостьБезНДС + Символы.ПС;
			ИначеЕсли Стр.От <> 0 И Стр.До <> 0 Тогда
				ТекстСтавкиСНДС = ТекстСтавкиСНДС + "С " + Стр.От + " до " + Стр.До + " - " + ТекстСтоимостьСНДС + Символы.ПС;
				ТекстСтавкиБезНДС = ТекстСтавкиБезНДС + "С " + Стр.От + " до " + Стр.До + " - " + ТекстСтоимостьБезНДС + Символы.ПС;
			ИначеЕсли Стр.От <> 0 И Стр.До = 0 Тогда
				ТекстСТавкиСНДС = ТекстСтавкиСНДС + "С " + Стр.От + " и далее - " + ТекстСтоимостьСНДС;
				ТекстСТавкиБезНДС = ТекстСтавкиБезНДС + "С " + Стр.От + " и далее - " + ТекстСтоимостьБезНДС;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокаУслуги.СтоимостьСНДСПрогрессивная = ТекстСтавкиСНДС;
	СтрокаУслуги.СтоимостьБезНДСПрогрессивная = ТекстСтавкиБезНДС;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтавкаПрогрессивнаяПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиСтавкаПрогрессивнаяПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиСтавкаПрогрессивнаяПриИзмененииСервер(ИдентификаторСтроки)
	
	СтрокаУслуги = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
	ОбработатьИзменениеПризнакаСтавкаПрогрессивнаяВСтроке(СтрокаУслуги);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеПризнакаСтавкаПрогрессивнаяВСтроке(СтрокаУслуги)
	
	СформироватьШкалуПрогрессивнойСтавки(СтрокаУслуги, Истина);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьШкалуПрогрессивнойСтавки(СтрокаУслуги, ИзмененПризнакПрогрессивнойСтавки)
	
	НайдСтроки = Объект.ШкалаСтавок.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", СтрокаУслуги.ИдентификаторСтрокиУслуг));
	
	Если ИзмененПризнакПрогрессивнойСтавки Тогда
		Для Каждого Стр Из НайдСтроки Цикл
			Объект.ШкалаСтавок.Удалить(Стр);
		КонецЦикла;
	КонецЕсли;

	НоваяШкала = Новый Массив;
	
	Если СтрокаУслуги.СтавкаПрогрессивная Тогда
	
		Если ЗначениеЗаполнено(СтрокаУслуги.СтоимостьБезНДС) Тогда
			ИмяПоляСтоимость = "СтоимостьБезНДС";
		Иначе
			ИмяПоляСтоимость = "СтоимостьСНДС";
		КонецЕсли;
		
		ПоляШкалы = СтрШаблон("От,До,%1", ИмяПоляСтоимость);
		
		НижнийПорогШкалы = 0;
		Если ЗначениеЗаполнено(СтрокаУслуги.СвободныйПериодХраненияПриОтправке) Тогда
			НижнийПорогШкалы = СтрокаУслуги.СвободныйПериодХраненияПриОтправке;
		ИначеЕсли ЗначениеЗаполнено(СтрокаУслуги.СвободныйПериодХраненияПриПриеме) Тогда
			НижнийПорогШкалы = СтрокаУслуги.СвободныйПериодХраненияПриПриеме;
		ИначеЕсли ЗначениеЗаполнено(СтрокаУслуги.СвободныйПериодХраненияУслугиДепо) Тогда
			НижнийПорогШкалы = СтрокаУслуги.СвободныйПериодХраненияУслугиДепо;
		ИначеЕсли ЗначениеЗаполнено(СтрокаУслуги.СвободныйПериодХранения) Тогда
			НижнийПорогШкалы = СтрокаУслуги.СвободныйПериодХранения;
		КонецЕсли;
		//Евросиб Шевченко А.В. US 110215 TA 120129 06.10.2025
		//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
		Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.ТЭО Тогда
			Если ЗначениеЗаполнено(СтрокаУслуги.СвободныйПериодХраненияВаг) И НЕ ЗначениеЗаполнено(СтрокаУслуги.СвободныйПериодХраненияКТК) Тогда
				НижнийПорогШкалы= СтрокаУслуги.СвободныйПериодХраненияВаг;
			ИначеЕсли ЗначениеЗаполнено(СтрокаУслуги.СвободныйПериодХраненияВаг) И ЗначениеЗаполнено(СтрокаУслуги.СвободныйПериодХраненияКТК) Тогда
				НижнийПорогШкалы = СтрокаУслуги.СвободныйПериодХраненияКТК;
			ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаУслуги.СвободныйПериодХраненияВаг) И ЗначениеЗаполнено(СтрокаУслуги.СвободныйПериодХраненияКТК) Тогда
				НижнийПорогШкалы = СтрокаУслуги.СвободныйПериодХраненияКТК;
			КонецЕсли;
		КонецЕсли;
		//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
		//Евросиб Шевченко А.В. US 110215 TA 120129 06.10.2025
		Если ИзмененПризнакПрогрессивнойСтавки Тогда
			
			Если НижнийПорогШкалы > 0 Тогда
				
				СтрокаШкалы = Объект.ШкалаСтавок.Добавить();
				СтрокаШкалы.ИдентификаторСтрокиУслуг = СтрокаУслуги.ИдентификаторСтрокиУслуг;
				СтрокаШкалы.От = 0;
				СтрокаШкалы.До = НижнийПорогШкалы;
				СтрокаШкалы[ИмяПоляСтоимость] = 0;
				
				СтрокиШкалы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокаШкалы);
				
				ТекущийУровеньШкалы = НижнийПорогШкалы + 1;
				
				СтрокаШкалы = Объект.ШкалаСтавок.Добавить();
				СтрокаШкалы.ИдентификаторСтрокиУслуг = СтрокаУслуги.ИдентификаторСтрокиУслуг;
				СтрокаШкалы.От = ТекущийУровеньШкалы;
				СтрокаШкалы.До = 0;
				СтрокаШкалы[ИмяПоляСтоимость] = СтрокаУслуги[ИмяПоляСтоимость];
			
				СтрокиШкалы.Добавить(СтрокаШкалы);
				
			Иначе
				
				СтрокаШкалы = Объект.ШкалаСтавок.Добавить();
				СтрокаШкалы.ИдентификаторСтрокиУслуг = СтрокаУслуги.ИдентификаторСтрокиУслуг;
				СтрокаШкалы.От = 0;
				СтрокаШкалы.До = 0;
				СтрокаШкалы[ИмяПоляСтоимость] = СтрокаУслуги[ИмяПоляСтоимость];
				
				СтрокиШкалы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокаШкалы);
				
			КонецЕсли;
			
		Иначе
			
			КоличествоСтрокШкалы = НайдСтроки.Количество();
			
			Если НижнийПорогШкалы > 0 Тогда				
				СтрокаШкалы = Новый Структура(ПоляШкалы); 
				СтрокаШкалы.От = 0;
				СтрокаШкалы.До = НижнийПорогШкалы;
				СтрокаШкалы[ИмяПоляСтоимость] = 0;
				НоваяШкала.Добавить(СтрокаШкалы);				
				ТекущийУровеньШкалы = НижнийПорогШкалы + 1;				
			Иначе
				ТекущийУровеньШкалы = 0;
			КонецЕсли;
				
			Если КоличествоСтрокШкалы > 0 Тогда
				
				Для Каждого Стр Из НайдСтроки Цикл
					Если Стр[ИмяПоляСтоимость] <> 0 Тогда
						
						СтрокаШкалы = Новый Структура(ПоляШкалы);
						ЗаполнитьЗначенияСвойств(СтрокаШкалы, Стр, ПоляШкалы);
						СтрокаШкалы.От = ТекущийУровеньШкалы;
						НоваяШкала.Добавить(СтрокаШкалы);
						
						Если СтрокаШкалы.До > СтрокаШкалы.От Тогда
							ТекущийУровеньШкалы = СтрокаШкалы.До + 1;
						Иначе
							Прервать;
						КонецЕсли;
						
					КонецЕсли;
				КонецЦикла;
				
			Иначе
				
				СтрокаШкалы = Новый Структура(ПоляШкалы);					
				СтрокаШкалы.От = ТекущийУровеньШкалы;
				СтрокаШкалы.До = 0;
				СтрокаШкалы[ИмяПоляСтоимость] = СтрокаУслуги[ИмяПоляСтоимость];
				НоваяШкала.Добавить(СтрокаШкалы);
				
			КонецЕсли;
			
			Для Каждого Стр Из НайдСтроки Цикл
				Объект.ШкалаСтавок.Удалить(Стр);
			КонецЦикла;
			
			Для Каждого Стр Из НоваяШкала Цикл
				НоваяСтрока = Объект.ШкалаСтавок.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр, ПоляШкалы);
				НоваяСтрока.ИдентификаторСтрокиУслуг = СтрокаУслуги.ИдентификаторСтрокиУслуг;
			КонецЦикла;
				
		КонецЕсли;
		
		ПересчитатьСтоимостьПоШкалеСУчетомСтавкиНДС(СтрокаУслуги, ИмяПоляСтоимость, СтрокиШкалы);
		
	Иначе
		
		СтрокаУслуги.СтоимостьСНДСПрогрессивная = "";
		СтрокаУслуги.СтоимостьБезНДСПрогрессивная = "";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиВесГрузаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекДанные.ТипоразмерКТК_Вагона) И ТипЗнч(ТекДанные.ТипоразмерКТК_Вагона) = Тип("СправочникСсылка.ТипоразмерыТЕ") Тогда
		ДоступныеЗначения = ПолучитьВесаПоТипоразмеруТЕ(ТекДанные.ТипоразмерКТК_Вагона);
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(ДоступныеЗначения);
	Иначе
	КонецЕсли;
	
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	//Евросиб Шевченко А.В. US 110215 TA 120129 06.10.2025
	Если Объект.ВидУслугПоставщика = ПредопределенноеЗначение("Справочник.ВидыУслугПоставщиков.Порты") ИЛИ Объект.ВидУслугПоставщика = ПредопределенноеЗначение("Справочник.ВидыУслугПоставщиков.Фрахт")  ИЛИ Объект.ВидУслугПоставщика = ПредопределенноеЗначение("Справочник.ВидыУслугПоставщиков.ТЭО") Тогда
	//Евросиб Шевченко А.В. US 110215 TA 120129 06.10.2025	
		Если ТекДанные.ТипоразмерыКТК.Количество() Тогда
			ДоступныеЗначения = ПолучитьВесаПоТипоразмеруТЕ(ТекДанные.ТипоразмерыКТК);
			ДанныеВыбора = Новый СписокЗначений;
			ДанныеВыбора.ЗагрузитьЗначения(ДоступныеЗначения);
		КонецЕсли;
	КонецЕсли;	
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВесаПоТипоразмеруТЕ(ТипоразмерТЕ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТипоразмерыТЕВеса.Вес КАК Вес,
		|	ТипоразмерыТЕВеса.Вес.Вес КАК ВесВеса
		|ИЗ
		|	Справочник.ТипоразмерыТЕ.Веса КАК ТипоразмерыТЕВеса
		|ГДЕ
		|	ТипоразмерыТЕВеса.Ссылка В(&ТипоразмерТЕ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВесВеса";
	
	Запрос.УстановитьПараметр("ТипоразмерТЕ", ТипоразмерТЕ);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Вес");
	
КонецФункции


&НаКлиенте
Процедура УслугиВесГрузаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура УслугиГрузТНВЭДПриИзменении(Элемент)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	Если ЗначениеЗаполнено(ТекДанные.ГрузТНВЭД) Тогда
		ТекДанные.КодТНВЭД = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ТекДанные.ГрузТНВЭД, "ТНВЭД");
	Иначе
		ТекДанные.КодТНВЭД = "";
	КонецЕсли;
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
	УслугиГрузТНВЭДПриИзмененииСервер(ТекСтрока);
	
КонецПроцедуры

&НаСервере
Процедура УслугиГрузТНВЭДПриИзмененииСервер(ТекСтрока)
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	УстановитьПризнакИзмененияГруза(ТекДанные);
	УстановитьЗначениеПоляСостояниеГруженыйПорожний(ТекДанные);
КонецПроцедуры	

&НаКлиенте
Процедура УслугиКодТНВЭДПриИзменении(Элемент)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	Если ЗначениеЗаполнено(ТекДанные.КодТНВЭД) Тогда
		Груз = НайтиГрузТНВЭД(ТекДанные.КодТНВЭД);
		Если ЗначениеЗаполнено(Груз) Тогда
			ТекДанные.ГрузТНВЭД = Груз;
		КонецЕсли;	
	Иначе
		ТекДанные.ГрузТНВЭД = ПредопределенноеЗначение("Справочник.ГрузыПоТНВЭД.ПустаяСсылка");	
	КонецЕсли;
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
	УслугиГрузТНВЭДПриИзмененииСервер(ТекСтрока);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиГрузТНВЭД(КодТНВЭД)
	
	Груз = Справочники.ГрузыПоТНВЭД.НайтиПоРеквизиту("ТНВЭД", КодТНВЭД);
	Возврат Груз;
	
КонецФункции


&НаКлиенте
Процедура СканДоверенностиНаПодписантаКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;	
	ПараметрыФормы.Вставить("ВладелецФайла", Объект.РуководительКонтрагента);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы", ПараметрыФормы, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВсехРуководителейКонтрагента(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ДанныеРуководителяКонтрагентов.Руководитель КАК Руководитель
	               |ИЗ
	               |	РегистрСведений.ДанныеРуководителяКонтрагентов КАК ДанныеРуководителяКонтрагентов
	               |ГДЕ
	               |	ДанныеРуководителяКонтрагентов.Контрагент = &Контрагент
	               |	И НЕ ДанныеРуководителяКонтрагентов.Руководитель.ПометкаУдаления";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Руководитель");
	
КонецФункции

&НаКлиенте
Процедура УслугиПунктОтправленияПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиПунктОтправленияПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиПунктОтправленияПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);	
	ОбработатьИзменениеПунктаОтправленияВСтроке(ТекДанные);
	
	Если Не ЗначениеЗаполнено(ТекДанные.ПунктОтправления) Тогда
		ЛокацияПустаяСсылка = Справочники.Локации.ПустаяСсылка();
		ТекДанные.ПунктОтправленияГород = ЛокацияПустаяСсылка;
		ТекДанные.ПунктОтправленияСтрана = ЛокацияПустаяСсылка;
	КонецЕсли;
	
	ОбновитьДинамическиеПоляТаблицыУслугПоСтроке(ТекДанные);
	//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
	Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.ТЭО Тогда
		ПолучитьПортыИЖДСтанции(ТекДанные);
	КонецЕсли;	
	//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеПунктаОтправленияВСтроке(ТекДанные)
	
	ДанныеЛокации = Новый Структура;
	ПоляТаблицыУслуг = ПараметрыВидаУслуг.ПоляТаблицыУслуг;				
	
	Если ЗначениеЗаполнено(ТекДанные.ПунктОтправления) Тогда
		
		ОписаниеПоля = ПоляТаблицыУслуг.Получить("АдресТерминалаВыдачиПостановкиКТК");	
		Если ОписаниеПоля <> Неопределено Тогда
			ДанныеЛокации.Вставить("Адрес");
		КонецЕсли;
		
		ОписаниеПоляГород = ПоляТаблицыУслуг.Получить("ПунктОтправленияГород");
		Если ОписаниеПоляГород <> Неопределено Тогда
			ДанныеЛокации.Вставить("Город");
		КонецЕсли;
		
		ОписаниеПоляСтрана = ПоляТаблицыУслуг.Получить("ПунктОтправленияСтрана");
		Если ОписаниеПоляСтрана <> Неопределено Тогда
			ДанныеЛокации.Вставить("Страна");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеЛокации) Тогда
			
			ПолучитьДопДанныеЛокации(ТекДанные.ПунктОтправления, ДанныеЛокации);
			Если ДанныеЛокации.Свойство("Адрес") Тогда
				ТекДанные.АдресТерминалаВыдачиПостановкиКТК = ДанныеЛокации.Адрес;
			КонецЕсли;		
			Если ДанныеЛокации.Свойство("Город") Тогда
				ТекДанные.ПунктОтправленияГород = ДанныеЛокации.Город;
			КонецЕсли;
			Если ДанныеЛокации.Свойство("Страна") Тогда
				ТекДанные.ПунктОтправленияСтрана = ДанныеЛокации.Страна;
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ТекДанные.АдресТерминалаВыдачиПостановкиКТК = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДопДанныеЛокации(Локация, ДанныеЛокации) 

	Если ЗначениеЗаполнено(Локация) Тогда
		
		Если ТипЗнч(Локация) = Тип("СправочникСсылка.Локации") Тогда
			
			Если ДанныеЛокации.Свойство("Адрес") Тогда
				ДанныеЛокации.Адрес = ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Локация, "Адрес");
			КонецЕсли;		
			Если ДанныеЛокации.Свойство("Город") Тогда
				ДанныеЛокации.Город = ПолучитьЛокациюВышестоящегоУровня(Локация, Перечисления.ТипыИерархииЛокации.НаселенныйПункт);
			КонецЕсли;
			Если ДанныеЛокации.Свойство("Страна") Тогда
				ДанныеЛокации.Страна = ПолучитьЛокациюВышестоящегоУровня(Локация, Перечисления.ТипыИерархииЛокации.Страна);
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Локация) = Тип("СправочникСсылка.Мультилокации") Тогда
			
			Если ДанныеЛокации.Свойство("Город") Тогда				
				Города = ПолучитьЛокацииВышестоящегоУровняПоМультилокации(Локация, Перечисления.ТипыИерархииЛокации.НаселенныйПункт);
				Если Города.Количество() = 1 Тогда
					ДанныеЛокации.Город = Города[0];
				Иначе
					ДанныеЛокации.Город = Справочники.Локации.ПустаяСсылка();
				КонецЕсли;
			КонецЕсли;
			
			Если ДанныеЛокации.Свойство("Страна") Тогда
				Страны = ПолучитьЛокацииВышестоящегоУровняПоМультилокации(Локация, Перечисления.ТипыИерархииЛокации.Страна);
				Если Страны.Количество() = 1 Тогда
					ДанныеЛокации.Страна = Страны[0];
				Иначе
					ДанныеЛокации.Страна = Справочники.Локации.ПустаяСсылка();
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктОтправленияГородПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиПунктОтправленияГородПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиПунктОтправленияГородПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ОбработатьИзменениеГородаОтправленияВСтроке(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеГородаОтправленияВСтроке(ТекДанные)

	Если ЗначениеЗаполнено(ТекДанные.ПунктОтправленияГород) Тогда
		ПоляТаблицыУслуг = ПараметрыВидаУслуг.ПоляТаблицыУслуг;				
		ОписаниеПоля = ПоляТаблицыУслуг.Получить("ПунктОтправленияСтрана");	
		Если ОписаниеПоля <> Неопределено Тогда
			Если ТипЗнч(ТекДанные.ПунктОтправленияГород) = Тип("СправочникСсылка.Локации") Тогда				
				//ТекДанные.ПунктОтправленияСтрана = ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ТекДанные.ПунктОтправленияГород, "Страна");
				ТекДанные.ПунктОтправленияСтрана = ПолучитьЛокациюВышестоящегоУровня(ТекДанные.ПунктОтправленияГород, Перечисления.ТипыИерархииЛокации.Страна); 
			ИначеЕсли ТипЗнч(ТекДанные.ПунктОтправленияГород) = Тип("СправочникСсылка.Мультилокации") Тогда
				//ТаблицаЛокаций = ПолучитьЛокацииПоМультилокации(ТекДанные.ПунктОтправленияГород);
				//Страны = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТаблицаЛокаций.ВыгрузитьКолонку("Страна"));
				Страны = ПолучитьЛокацииВышестоящегоУровняПоМультилокации(ТекДанные.ПунктОтправленияГород, Перечисления.ТипыИерархииЛокации.Страна);
				Если Страны.Количество() = 1 Тогда
					ТекДанные.ПунктОтправленияСтрана = Страны[0];
				Иначе
					ТекДанные.ПунктОтправленияСтрана = Справочники.Локации.ПустаяСсылка();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТекДанные.ПунктОтправленияСтрана = Справочники.Локации.ПустаяСсылка();
	КонецЕсли;
	ТекДанные.ПунктОтправления = Справочники.Локации.ПустаяСсылка();
	ОбновитьДинамическиеПоляТаблицыУслугПоСтроке(ТекДанные);
		
КонецПроцедуры

&НаСервере
Функция ПолучитьЛокациюВышестоящегоУровня(Локация, ТипИерархии)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИерархияЛокаций.ЛокацияВышестоящегоУровня КАК ЛокацияВышестоящегоУровня
	|ИЗ
	|	РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
	|ГДЕ
	|	ИерархияЛокаций.Локация = &Локация
	|	И ИерархияЛокаций.ТипИерархии = &ТипИерархии";
	Запрос.УстановитьПараметр("Локация", Локация);
	Запрос.УстановитьПараметр("ТипИерархии", ТипИерархии);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЛокацияВышестоящегоУровня = Выборка.ЛокацияВышестоящегоУровня;
	Иначе
		ЛокацияВышестоящегоУровня = Справочники.Локации.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ЛокацияВышестоящегоУровня;
	
КонецФункции

&НаСервере
Функция ПолучитьЛокацииВышестоящегоУровняПоМультилокации(Мультилокация, ТипИерархии)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИерархияЛокаций.ЛокацияВышестоящегоУровня КАК ЛокацияВышестоящегоУровня
	|ИЗ
	|	Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
	|		ПО МультилокацииЛокации.Локация = ИерархияЛокаций.Локация
	|			И (ИерархияЛокаций.ТипИерархии = &ТипИерархии)
	|ГДЕ
	|	МультилокацииЛокации.Ссылка = &Мультилокация";
	Запрос.УстановитьПараметр("Мультилокация", Мультилокация);
	Запрос.УстановитьПараметр("ТипИерархии", ТипИерархии);
	
	ТаблицаЛокаций = Запрос.Выполнить().Выгрузить();
	ЛокацииВышестоящегоУровня = ТаблицаЛокаций.ВыгрузитьКолонку("ЛокацияВышестоящегоУровня");
	
	Возврат ЛокацииВышестоящегоУровня;
	
КонецФункции

&НаКлиенте
Процедура УслугиПунктНазначенияПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиПунктНазначенияПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиПунктНазначенияПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ОбработатьИзменениеПунктаНазначенияВСтроке(ТекДанные);
	
	Если Не ЗначениеЗаполнено(ТекДанные.ПунктНазначения) Тогда
		ЛокацияПустаяСсылка =Справочники.Локации.ПустаяСсылка();
		ТекДанные.ПунктНазначенияГород = ЛокацияПустаяСсылка;
		ТекДанные.ПунктНазначенияСтрана = ЛокацияПустаяСсылка;
	КонецЕсли;
	
	ОбновитьДинамическиеПоляТаблицыУслугПоСтроке(ТекДанные);
	//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
	Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.ТЭО Тогда
		ПолучитьПортыИЖДСтанции(ТекДанные);
	КонецЕсли;
	//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеПунктаНазначенияВСтроке(ТекДанные)
	
	ДанныеЛокации = Новый Структура;
	ПоляТаблицыУслуг = ПараметрыВидаУслуг.ПоляТаблицыУслуг;				
	
	Если ЗначениеЗаполнено(ТекДанные.ПунктНазначения) Тогда
		
		ОписаниеПоля = ПоляТаблицыУслуг.Получить("АдресТерминалаСдачиКТК");	
		Если ОписаниеПоля <> Неопределено Тогда
			ДанныеЛокации.Вставить("Адрес");
		КонецЕсли;
		
		ОписаниеПоляГород = ПоляТаблицыУслуг.Получить("ПунктНазначенияГород");
		Если ОписаниеПоляГород <> Неопределено Тогда
			ДанныеЛокации.Вставить("Город");
		КонецЕсли;
		
		ОписаниеПоляСтрана = ПоляТаблицыУслуг.Получить("ПунктНазначенияСтрана");
		Если ОписаниеПоляСтрана <> Неопределено Тогда
			ДанныеЛокации.Вставить("Страна");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеЛокации) Тогда
			
			ПолучитьДопДанныеЛокации(ТекДанные.ПунктНазначения, ДанныеЛокации);
			Если ДанныеЛокации.Свойство("Адрес") Тогда
				ТекДанные.АдресТерминалаСдачиКТК = ДанныеЛокации.Адрес;
			КонецЕсли;		
			Если ДанныеЛокации.Свойство("Город") Тогда
				ТекДанные.ПунктНазначенияГород = ДанныеЛокации.Город;
			КонецЕсли;
			Если ДанныеЛокации.Свойство("Страна") Тогда
				ТекДанные.ПунктНазначенияСтрана = ДанныеЛокации.Страна;
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ТекДанные.АдресТерминалаСдачиКТК = Неопределено;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктНазначенияГородПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиПунктНазначенияГородПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиПунктНазначенияГородПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ОбработатьИзменениеГородаНазначенияВСтроке(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеГородаНазначенияВСтроке(ТекДанные)
	
	ЛокацияПустаяСсылка = Справочники.Локации.ПустаяСсылка();
	Если ЗначениеЗаполнено(ТекДанные.ПунктНазначенияГород) Тогда
		ПоляТаблицыУслуг = ПараметрыВидаУслуг.ПоляТаблицыУслуг;				
		ОписаниеПоля = ПоляТаблицыУслуг.Получить("ПунктНазначенияСтрана");	
		Если ОписаниеПоля <> Неопределено  Тогда
			Если ТипЗнч(ТекДанные.ПунктНазначенияГород) = Тип("СправочникСсылка.Локации") Тогда				
				ТекДанные.ПунктНазначенияСтрана = ПолучитьЛокациюВышестоящегоУровня(ТекДанные.ПунктНазначенияГород, Перечисления.ТипыИерархииЛокации.Страна);
			ИначеЕсли ТипЗнч(ТекДанные.ПунктНазначенияГород) = Тип("СправочникСсылка.Мультилокации") Тогда				
				Страны = ПолучитьЛокацииВышестоящегоУровняПоМультилокации(ТекДанные.ПунктНазначенияГород, Перечисления.ТипыИерархииЛокации.Страна); 
				Если Страны.Количество() = 1 Тогда
					ТекДанные.ПунктНазначенияСтрана = Страны[0];
				Иначе
					ТекДанные.ПунктНазначенияСтрана = ЛокацияПустаяСсылка;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТекДанные.ПунктНазначенияСтрана = ЛокацияПустаяСсылка;
	КонецЕсли;
	ТекДанные.ПунктНазначения = ЛокацияПустаяСсылка;
	ОбновитьДинамическиеПоляТаблицыУслугПоСтроке(ТекДанные);
		
КонецПроцедуры

&НаСервере
Функция УдалитьПолучитьЛокацииВышестоящегоУровняПоМультилокации(Мультилокация)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МультилокацииЛокации.Локация.ЛокацияВышестоящегоУровня КАК ЛокацияВышестоящегоУровня,
	|	МультилокацииЛокации.Локация.Страна КАК Страна
	|ИЗ
	|	Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|ГДЕ
	|	МультилокацииЛокации.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Мультилокация);
	
	Возврат Запрос.Выполнить().Выгрузить();	
				
КонецФункции

&НаСервере
Функция ПолучитьЛокацииПоМультилокации(Мультилокация)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МультилокацииЛокации.Локация КАК Локация,
	|	МультилокацииЛокации.Локация.Страна КАК Страна
	|ИЗ
	|	Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|ГДЕ
	|	МультилокацииЛокации.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Мультилокация);
	
	Возврат Запрос.Выполнить().Выгрузить();	
				
КонецФункции

&НаКлиенте
Процедура СписокУчетныхЕдиницУчетнаяЕдиницаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекСтрокаУслуг = Элементы.Услуги.ТекущаяСтрока;
	
	ТекДанныеУслуг = Элементы.Услуги.ТекущиеДанные;	
	ИдентификаторТекСтроки = ТекДанныеУслуг.ПолучитьИдентификатор();
	
	ТекДанные = Элементы.СписокУчетныхЕдиниц.ТекущиеДанные;
	
	ДопПараметры = Новый Структура("ИдентификаторТекСтроки", ИдентификаторТекСтроки);
	ДопПараметры.Вставить("ТекущаяУчетнаяЕдиница", ТекДанные.УчетнаяЕдиницаСсылка);
	
	Если ЗначениеЗаполнено(ПараметрыВидаУслуг.ТипУчетныхЕдиницДетализации) Тогда
		СписокУчетныхЕдиницУчетныеЕдиницыНачалоВыбораПродолжение(ПараметрыВидаУслуг.ТипУчетныхЕдиницДетализации, ДопПараметры);
	ИначеЕсли ЗначениеЗаполнено(ТекДанныеУслуг.ТипУчетныхЕдиниц) Тогда
		СписокУчетныхЕдиницУчетныеЕдиницыНачалоВыбораПродолжение(ТекДанныеУслуг.ТипУчетныхЕдиниц, ДопПараметры);	
	Иначе
		СписокТипов = новый СписокЗначений;
		СписокТипов.Добавить("СправочникСсылка.ТС", "Вагон");
		СписокТипов.Добавить("СправочникСсылка.ТЕ", "Контейнер");
		ОповещениеОВыборе = Новый ОписаниеОповещения("СписокУчетныхЕдиницУчетныеЕдиницыНачалоВыбораПродолжение", ЭтаФорма, ДопПараметры);
		СписокТипов.ПоказатьВыборЭлемента(ОповещениеОВыборе, "Выбор типа данных");
	КонецЕсли;		
		
КонецПроцедуры

&НаКлиенте
Процедура СписокУчетныхЕдиницУчетныеЕдиницыНачалоВыбораПродолжение(ВыбранныйТип, ДопПараметры) Экспорт
	
	Если ВыбранныйТип <> Неопределено Тогда
		
		Если ТипЗнч(ВыбранныйТип) = Тип("ЭлементСпискаЗначений") Тогда
			ТипУчетныхЕдиниц = ВыбранныйТип.Значение;
		Иначе
			ТипУчетныхЕдиниц = ВыбранныйТип;
		КонецЕсли;
		
		ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ДопПараметры.ИдентификаторТекСтроки);
		
		Если ТекДанные.СпособВводаУчетныхЕдиниц = ПредопределенноеЗначение("Перечисление.СпособыВводаУчетныхЕдиниц.Списком") Тогда
			
			УчетныеЕдиницы = Новый Массив;
			СтрокиУчетныхЕдиниц = Объект.УчетныеЕдиницы.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", ТекДанные.ИдентификаторСтрокиУслуг));
			Для Каждого СтрокаУчетнойЕдиницы Из СтрокиУчетныхЕдиниц Цикл
				УчетныеЕдиницы.Добавить(СтрокаУчетнойЕдиницы.УчетнаяЕдиница);
			КонецЦикла;
			
			Если ТипУчетныхЕдиниц = "СправочникСсылка.ТЕ" Тогда
				ПараметрыФормы = Новый Структура("ТЕ, СоставТЕ", Истина, УчетныеЕдиницы);
			ИначеЕсли ТипУчетныхЕдиниц = "СправочникСсылка.ТС" Тогда
				ПараметрыФормы = Новый Структура("ТС, СоставТС", Истина, УчетныеЕдиницы);
			КонецЕсли;
				
			ДопПараметры = Новый Структура("ИдентификаторСтрокиУслуг, ИдентификаторСтроки, Удалять", ТекДанные.ИдентификаторСтрокиУслуг, ДопПараметры.ИдентификаторТекСтроки, Истина);
			ОповещениеОВыборе = Новый ОписаниеОповещения("ОбработкаВыбораУчетныхЕдиниц", ЭтаФорма, ДопПараметры);
			ОткрытьФорму("ОбщаяФорма.ОкноРедактированияСоставаУчетныхЕдиниц", ПараметрыФормы,, ЭтаФорма.УникальныйИдентификатор,,, ОповещениеОВыборе, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		ИначеЕсли ТекДанные.СпособВводаУчетныхЕдиниц = ПредопределенноеЗначение("Перечисление.СпособыВводаУчетныхЕдиниц.Построчно") Тогда
			
			ПараметрыФормы = Новый Структура;
			Если ЗначениеЗаполнено(ДопПараметры.ТекущаяУчетнаяЕдиница) Тогда
				ПараметрыФормы.Вставить("Ключ", ДопПараметры.ТекущаяУчетнаяЕдиница);
			КонецЕсли;
			
			ДопПараметрыОповещения = Новый Структура("ИдентификаторСтрокиУслуг, ИдентификаторСтроки", ТекДанные.ИдентификаторСтрокиУслуг, ДопПараметры.ИдентификаторТекСтроки);
			ДопПараметрыОповещения.Вставить("ТекущаяУчетнаяЕдиница", ДопПараметры.ТекущаяУчетнаяЕдиница);
			ОповещениеОВыборе = Новый ОписаниеОповещения("ОбработкаВыбораУчетнойЕдиницы", ЭтаФорма, ДопПараметрыОповещения);
			
			Если ТипУчетныхЕдиниц = "СправочникСсылка.ТЕ" Тогда
				ОткрытьФорму("Справочник.ТЕ.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОВыборе, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			ИначеЕсли ТипУчетныхЕдиниц = "СправочникСсылка.ТС" Тогда
				ОткрытьФорму("Справочник.ТС.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОВыборе, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораУчетнойЕдиницы(УчетнаяЕдиница, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(УчетнаяЕдиница) Тогда
		НайденныеСтроки = Объект.УчетныеЕдиницы.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг, УчетнаяЕдиница", ДопПараметры.ИдентификаторСтрокиУслуг, ДопПараметры.ТекущаяУчетнаяЕдиница));
		Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
			НайденныеСтроки[0].УчетнаяЕдиница = УчетнаяЕдиница;
		Иначе
			НоваяСтрока = Объект.УчетныеЕдиницы.Добавить();
			НоваяСтрока.ИдентификаторСтрокиУслуг = ДопПараметры.ИдентификаторСтрокиУслуг;
			НоваяСтрока.УчетнаяЕдиница = УчетнаяЕдиница;
		КонецЕсли;
		
		ТекДанныеУслуги = Объект.Услуги.НайтиПоИдентификатору(ДопПараметры.ИдентификаторСтроки);
		ОбновитьПредставлениеУчетныхЕдиницСтрокиУслуг(ТекДанныеУслуги, Ложь);		
		УстановитьВидимостьДоступностьЭлементовДетализацииПоУчетнымЕдиницам(ТекДанныеУслуги);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУчетныхЕдиницПередУдалением(Элемент, Отказ)
	
	ТекСтрокаУслуг = Элементы.Услуги.ТекущаяСтрока;
	ВыделенныеСтрокиУчетныхЕдиниц = Элементы.СписокУчетныхЕдиниц.ВыделенныеСтроки;
	СписокУчетныхЕдиницПередУдалениемСервер(ТекСтрокаУслуг, ВыделенныеСтрокиУчетныхЕдиниц);
	
КонецПроцедуры

&НаСервере
Процедура СписокУчетныхЕдиницПередУдалениемСервер(ТекСтрокаУслуг, ВыделенныеСтрокиУчетныхЕдиниц)
	
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтрокиУчетныхЕдиниц Цикл
		СтрокаСписка = СписокУчетныхЕдиниц.НайтиПоИдентификатору(ВыделеннаяСтрока);	
		УдалитьСтрокуТаблицыУчетныхЕдиниц(СтрокаСписка.ИдентификаторСтрокиТаблицыУчЕдиниц, СтрокаСписка.ИдентификаторСтрокиУслуг);
	КонецЦикла;
	
	ТекДанныеУслуг = Объект.Услуги.НайтиПоИдентификатору(ТекСтрокаУслуг);
	ОбновитьПредставлениеУчетныхЕдиницСтрокиУслуг(ТекДанныеУслуг, Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокуТаблицыУчетныхЕдиниц(ИдентификаторСтрокиТаблицыУчЕдиниц = Неопределено, ИдентификаторСтрокиУслуг)
	
	Если ИдентификаторСтрокиТаблицыУчЕдиниц <> Неопределено И ИдентификаторСтрокиТаблицыУчЕдиниц >= 0 Тогда
		СтрокаУчетнойЕдиницы = Объект.УчетныеЕдиницы.НайтиПоИдентификатору(ИдентификаторСтрокиТаблицыУчЕдиниц);
		Если СтрокаУчетнойЕдиницы <> Неопределено Тогда
			Объект.УчетныеЕдиницы.Удалить(СтрокаУчетнойЕдиницы);
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(ИдентификаторСтрокиУслуг) Тогда
		СтрокиУчетныхЕдиниц = Объект.УчетныеЕдиницы.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", ИдентификаторСтрокиУслуг));
		Для Каждого СтрокаУчетнойЕдиницы Из СтрокиУчетныхЕдиниц Цикл
			Объект.УчетныеЕдиницы.Удалить(СтрокаУчетнойЕдиницы);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУчетныхЕдиницПриИзменении(Элемент)
	
	//ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	//Если ТекСтрока <> Неопределено Тогда
	//	ОбновитьПредставлениеУчетныхЕдиницСтрокиУслуг(ТекСтрока);
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУчетныхЕдиницПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекДанныеУслуг = Элементы.Услуги.ТекущиеДанные;
	ТекСтрокаУслуг = Элементы.Услуги.ТекущаяСтрока;
	Если ТекСтрокаУслуг <> Неопределено Тогда
		ТекСтрокаУчетныхЕдиниц = Элементы.СписокУчетныхЕдиниц.ТекущаяСтрока;
		Если ТекСтрокаУчетныхЕдиниц <> Неопределено Тогда
			СписокУчетныхЕдиницПриОкончанииРедактированияСервер(ТекСтрокаУслуг, ТекСтрокаУчетныхЕдиниц);
		КонецЕсли;
		УстановитьВидимостьДоступностьЭлементовДетализацииПоУчетнымЕдиницам(ТекДанныеУслуг);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СписокУчетныхЕдиницПриОкончанииРедактированияСервер(ТекСтрокаУслуг, ТекСтрокаУчетныхЕдиниц)
	
	ТекДанныеУслуги = Объект.Услуги.НайтиПоИдентификатору(ТекСтрокаУслуг);
	ТекДанные = СписокУчетныхЕдиниц.НайтиПоИдентификатору(ТекСтрокаУчетныхЕдиниц);
	Если Не ЗначениеЗаполнено(ТекДанные.УчетнаяЕдиницаСсылка) И Не ЗначениеЗаполнено(ТекДанные.УчетнаяЕдиница) Тогда
		Если ТекДанныеУслуги.СпособВводаУчетныхЕдиниц = ПредопределенноеЗначение("Перечисление.СпособыВводаУчетныхЕдиниц.Построчно") Тогда
			УдалитьСтрокуТаблицыУчетныхЕдиниц(ТекДанные.ИдентификаторСтрокиТаблицыУчЕдиниц, -1);
		ИначеЕсли ТекДанныеУслуги.СпособВводаУчетныхЕдиниц = ПредопределенноеЗначение("Перечисление.СпособыВводаУчетныхЕдиниц.Списком") Тогда
			УдалитьСтрокуТаблицыУчетныхЕдиниц(ТекДанные.ИдентификаторСтрокиТаблицыУчЕдиниц, ТекДанные.ИдентификаторСтрокиУслуг);
		КонецЕсли;
		СписокУчетныхЕдиниц.Удалить(ТекДанные);
		ОбновитьПредставлениеУчетныхЕдиницСтрокиУслуг(ТекДанныеУслуги, Ложь);
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУчетныхЕдиницУчетнаяЕдиницаСсылкаПриИзменении(Элемент)
	
	ТекДанныеУслуги = Элементы.Услуги.ТекущиеДанные;
	ТекСтрокаУслуг = Элементы.Услуги.ТекущаяСтрока;
	ТекСтрокаУчетныхЕдиниц = Элементы.СписокУчетныхЕдиниц.ТекущаяСтрока;
	
	СписокУчетныхЕдиницУчетнаяЕдиницаСсылкаПриИзмененииСервер(ТекСтрокаУслуг, ТекСтрокаУчетныхЕдиниц);
	
	УстановитьВидимостьДоступностьЭлементовДетализацииПоУчетнымЕдиницам(ТекДанныеУслуги);
	
КонецПроцедуры

&НаСервере
Процедура СписокУчетныхЕдиницУчетнаяЕдиницаСсылкаПриИзмененииСервер(ТекСтрокаУслуг, ТекСтрокаУчетныхЕдиниц)
	
	ТекДанныеУслуги = Объект.Услуги.НайтиПоИдентификатору(ТекСтрокаУслуг);
	ТекДанные = СписокУчетныхЕдиниц.НайтиПоИдентификатору(ТекСтрокаУчетныхЕдиниц);
	
	Если ЗначениеЗаполнено(ТекДанные.УчетнаяЕдиницаСсылка) Тогда
		
		СтрокаУчетнойЕдиницы = Объект.УчетныеЕдиницы.НайтиПоИдентификатору(ТекДанные.ИдентификаторСтрокиТаблицыУчЕдиниц);
		Если СтрокаУчетнойЕдиницы <> Неопределено Тогда
			СтрокаУчетнойЕдиницы.УчетнаяЕдиница = ТекДанные.УчетнаяЕдиницаСсылка;
		Иначе
			НоваяСтрока = Объект.УчетныеЕдиницы.Добавить();
			НоваяСтрока.ИдентификаторСтрокиУслуг = ТекДанныеУслуги.ИдентификаторСтрокиУслуг;
			НоваяСтрока.УчетнаяЕдиница = ТекДанные.УчетнаяЕдиницаСсылка;
			ТекДанные.ИдентификаторСтрокиТаблицыУчЕдиниц = НоваяСтрока.ПолучитьИдентификатор();
		КонецЕсли;
		
		ОбновитьПредставлениеУчетныхЕдиницСтрокиУслуг(ТекДанныеУслуги, Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПСЦПриИзменении(Элемент)
	
	ДатаПСЦПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Процедура ДатаПСЦПриИзмененииСервер()
	
	ОбновитьРуководителяКонтрагента();
	ЗаполнитьДоверенностьЗаРуководителя();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписанСДвухСторонПриИзменении(Элемент)
	
	Элементы.ДатаПереводаВСтатусПодписан.Доступность = Объект.ПодписанСДвухСторон;
	Если Не Объект.ПодписанСДвухСторон Тогда
		Объект.ДатаПереводаВСтатусПодписан = '00010101';
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КатегорияУслугПриИзменении(Элемент)
	
	КатегорияУслугПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Процедура КатегорияУслугПриИзмененииСервер()
	
	Если Объект.КатегорияУслуг = ПредопределенноеЗначение("Справочник.КатегорииУслуг.ПерваяПоследняяМиля") Тогда
		Элементы.МестоОказанияУслуг.Видимость = Истина;
	Иначе
		Элементы.МестоОказанияУслуг.Видимость = Ложь;
		Объект.МестоОказанияУслуг = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СписокУчетныхЕдиницПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекДанныеУслуги = Элементы.Услуги.ТекущиеДанные;
	
	Если ТекДанныеУслуги <> Неопределено Тогда
		Если ТекДанныеУслуги.СпособВводаУчетныхЕдиниц = ПредопределенноеЗначение("Перечисление.СпособыВводаУчетныхЕдиниц.Списком") Тогда
			//Для ввода списка доступна одна строка
			СтрокиСписка = СписокУчетныхЕдиниц.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", ТекДанныеУслуги.ИдентификаторСтрокиУслуг));
			Если ЗначениеЗаполнено(СтрокиСписка) Тогда
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУчетныхЕдиницПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ТекДанныеУслуги = Элементы.Услуги.ТекущиеДанные;
		
		ТекДанные = Элементы.СписокУчетныхЕдиниц.ТекущиеДанные;
		ТекДанные.ИдентификаторСтрокиТаблицыУчЕдиниц = -1;
		
		ТекДанные.ИдентификаторСтрокиУслуг = ТекДанныеУслуги.ИдентификаторСтрокиУслуг;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДетализацияКомплекснойСтавкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекДанные = Элементы.ДетализацияКомплекснойСтавки.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если Не ЗначениеЗаполнено(ТекДанные.НоменклатураПоставщика) И Не ЗначениеЗаполнено(ТекДанные.Номенклатура) И Не ЗначениеЗаполнено(ТекДанные.ПроцентОтСтавки) Тогда
			Объект.ДетализацияКомплекснойСтавки.Удалить(ТекДанные);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПередУдалением(Элемент, Отказ)
	
	ВыделенныеСтроки = Элементы.Услуги.ВыделенныеСтроки;
	УслугиПередУдалениемСервер(ВыделенныеСтроки);
	
КонецПроцедуры

&НаСервере
Процедура УслугиПередУдалениемСервер(ВыделенныеСтроки)
	
	Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
		
		ДанныеСтрокиУслуг = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);		
		СтруктураПоиска = Новый Структура("ИдентификаторСтрокиУслуг", ДанныеСтрокиУслуг.ИдентификаторСтрокиУслуг);
		
		УдаляемыеСтроки = Объект.КритерииУслуг.НайтиСтроки(СтруктураПоиска);
		Для Каждого Стр из УдаляемыеСтроки Цикл
			Объект.КритерииУслуг.Удалить(Стр);
		КонецЦикла;
		
		УдаляемыеСтроки = Объект.ДетализацияКомплекснойСтавки.НайтиСтроки(СтруктураПоиска);
		Для Каждого Стр Из УдаляемыеСтроки Цикл
			Объект.ДетализацияКомплекснойСтавки.Удалить(Стр);
		КонецЦикла;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТиповойПриИзменении(Элемент)
	
	Элементы.МакетПечатнойФормыПротокола.Видимость = Объект.Типовой;
	ЗаполнитьНаименованияПодписей();
	
	//Евросиб Коханенко Н.А. 27.03.2025 (( #102319
	УстановитьВидимостьКомандПечати();
	//Евросиб Коханенко Н.А. 27.03.2025 )) #102319 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаименованияПодписей()
	
	Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Контейнеры И Объект.Типовой Тогда
		Объект.НаименованиеПодписиКонтрагента = Справочники.НаименованияПодписей.Исполнитель;
		Объект.НаименованиеПодписи = Справочники.НаименованияПодписей.Клиент;
	Иначе
		РеквизитыДоговора = Справочники.ДоговорыКонтрагентов.ПолучитьЗначенияРеквизитовДоговораПоУмолчанию(Объект.Договор);
		Объект.НаименованиеПодписиКонтрагента = РеквизитыДоговора.НаименованиеСтороны;
		Объект.НаименованиеПодписи = РеквизитыДоговора.НаименованиеCтороныЕвросиб;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиОсобыйТемпературныйРежимПриИзменении(Элемент)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	ОбработатьИзмененияПризнакаОсобыйТемпературныйРежим(ТекДанные);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	Иначе
		УстановитьВидимостьГруппыПоЗначениюПоля(Объект.Услуги, Элементы.УслугиОсобыйТемпературныйРежимЗначение, "ОсобыйТемпературныйРежим");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбработатьИзмененияПризнакаОсобыйТемпературныйРежим(СтрокаТЧ)
	
	Если Не СтрокаТЧ.ОсобыйТемпературныйРежим Тогда
		СтрокаТЧ.ОсобыйТемпературныйРежимЗначение = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоверенностьУказываетсяВручнуюПриИзменении(Элемент)
	
	Если Объект.ДоверенностьУказываетсяВручную Тогда
		Элементы.ДоверенностьЗаРуководителя.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.ДоверенностьЗаРуководителя.ТолькоПросмотр = Истина;
		ЗаполнитьДоверенностьЗаРуководителя();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоверенностьЗаРуководителя()
	
	Если Не Объект.ДоверенностьУказываетсяВручную Тогда
		ДатаДоверенности = ?(ЗначениеЗаполнено(Объект.ДатаПСЦ), Объект.ДатаПСЦ, ТекущаяДата());
		Объект.ДоверенностьЗаРуководителя = Документы.ПСЦПоставщика.ПолучитьДоверенностьДиректораПоПроизводству(ДатаДоверенности);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктОтправленияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	Если ТекДанные.ПунктОтправления = Неопределено Тогда
		
		ИдентификаторТекСтроки = ТекДанные.ПолучитьИдентификатор();
		
		СписокТипов = новый СписокЗначений;
		
		ДоступныеТипы = Элементы.УслугиПунктОтправления.ОграничениеТипа.Типы();
		Если ЗначениеЗаполнено(ДоступныеТипы) Тогда
			СписокТипов.ЗагрузитьЗначения(ДоступныеТипы);
		Иначе
			СписокТипов.Добавить(Тип("СправочникСсылка.Локации"));
			СписокТипов.Добавить(Тип("СправочникСсылка.Мультилокации"));
		КонецЕсли;
	
		Если СписокТипов.Количество() > 1 Тогда
			
			СтандартнаяОбработка = Ложь;
			
			ДопПараметры = Новый Структура("ИдентификаторТекСтроки", ИдентификаторТекСтроки);
			ОповещениеОВыборе = Новый ОписаниеОповещения("УслугиПунктОтправленияОбработкаВыбораТипа", ЭтаФорма, ДопПараметры);
			
			СписокТипов.ПоказатьВыборЭлемента(ОповещениеОВыборе, "Выбор типа данных");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктОтправленияОбработкаВыбораТипа(ВыбранныйТип, ДопПараметры) Экспорт
	
	Если ВыбранныйТип <> Неопределено Тогда
		
		ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ДопПараметры.ИдентификаторТекСтроки);
		Если ВыбранныйТип.Значение = Тип("СправочникСсылка.Мультилокации") Тогда
			ТекДанные.ПунктОтправления = ПредопределенноеЗначение("Справочник.Мультилокации.ПустаяСсылка");
		Иначе
			ТекДанные.ПунктОтправления = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктОтправленияОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;		
	ТекДанные.ПунктОтправления = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктНазначенияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	Если ТекДанные.ПунктНазначения = Неопределено Тогда
		
		ИдентификаторТекСтроки = ТекДанные.ПолучитьИдентификатор();
		
		СписокТипов = новый СписокЗначений;
		
		ДоступныеТипы = Элементы.УслугиПунктОтправления.ОграничениеТипа.Типы();
		Если ЗначениеЗаполнено(ДоступныеТипы) Тогда
			СписокТипов.ЗагрузитьЗначения(ДоступныеТипы);
		Иначе
			СписокТипов.Добавить(Тип("СправочникСсылка.Локации"));
			СписокТипов.Добавить(Тип("СправочникСсылка.Мультилокации"));
		КонецЕсли;
	
		Если СписокТипов.Количество() > 1 Тогда
			
			СтандартнаяОбработка = Ложь;
			
			ДопПараметры = Новый Структура("ИдентификаторТекСтроки, ИмяПоля", ИдентификаторТекСтроки, "ПунктНазначения");
			ОповещениеОВыборе = Новый ОписаниеОповещения("ОбработкаВыбораТипаПоляЛокации", ЭтаФорма, ДопПараметры);
			
			СписокТипов.ПоказатьВыборЭлемента(ОповещениеОВыборе, "Выбор типа данных");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораТипаПоляЛокации(ВыбранныйТип, ДопПараметры) Экспорт
	
	Если ВыбранныйТип <> Неопределено Тогда
		
		ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ДопПараметры.ИдентификаторТекСтроки);
		ИмяПоля = ДопПараметры.ИмяПоля;
		Если ВыбранныйТип.Значение = Тип("СправочникСсылка.Мультилокации") Тогда
			ТекДанные[ИмяПоля] = ПредопределенноеЗначение("Справочник.Мультилокации.ПустаяСсылка");
		Иначе
			ТекДанные[ИмяПоля] = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктНазначенияОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;		
	ТекДанные.ПунктНазначения = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиНормативыПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиНормативыПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	Иначе
		УстановитьВидимостьГруппПоНормативам();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиНормативыПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ОбработатьИзменениеПризнакаНормативыВСтроке(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеПризнакаНормативыВСтроке(ТекСтрока)
	//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
	Если Не ТекСтрока.Нормативы И НЕ Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.ТЭО Тогда
		ТекСтрока.НормаЗагрузкиКТК = Неопределено;
		ТекСтрока.НормаПользования = Неопределено;
		ТекСтрока.НормативНахожденияНаПогрузке = Неопределено;
		ТекСтрока.НормативНахожденияНаВыгрузке = Неопределено;
		ТекСтрока.НормаВремениНаПогрузкуВыгрузку = Неопределено;
		ТекСтрока.СвободныйПериодХраненияПриОтправке = 0;
		ТекСтрока.СвободныйПериодХраненияПриПриеме = 0;
		ТекСтрока.СвободныйПериодХраненияУслугиДепо = 0;
		
		//УстановитьЗначениеПоляСостояниеГруженыйПорожний(ТекСтрока);
		ОбработатьИзменениеПериодаХраненияВСтроке(ТекСтрока, Ложь);
		
	КонецЕсли;
	//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьГруппыПоЗначениюПоля(Услуги, Группа, ИмяПоля)
	
	НайденныеСтроки = Услуги.НайтиСтроки(Новый Структура(ИмяПоля, Истина));
	Если НайденныеСтроки.Количество() > 0 Тогда
		Группа.Видимость = Истина;
	Иначе
		Группа.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьГруппПоНормативам()
	
	НайденныеСтроки = Объект.Услуги.НайтиСтроки(Новый Структура("Нормативы", Истина));
	Если НайденныеСтроки.Количество() > 0 Тогда
		Элементы.УслугиГруппаНормативыПараметры.Видимость = Истина;
		Элементы.УслугиГруппаСвободныйПериодХранения.Видимость = Истина;
	Иначе
		Элементы.УслугиГруппаНормативыПараметры.Видимость = Ложь;
		Элементы.УслугиГруппаСвободныйПериодХранения.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиНормаВремениНаПогрузкуВыгрузкуПриИзменении(Элемент)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	ОбработатьИзменениеНормыВремениНаПогрузкуВыгрузку(ТекДанные);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбработатьИзменениеНормыВремениНаПогрузкуВыгрузку(ТекДанные)
	
	Строки = СтрРазделить(ТекДанные.НормаВремениНаПогрузкуВыгрузку, ":");
	Часов = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Строки[0]);
	Если Строки.Количество() > 1 Тогда
		Минут = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Строки[1]);
	Иначе
		Минут = 0;
	КонецЕсли;
	ТекДанные.НормаВремениНаПогрузкуВыгрузку = ПолучитьЧасыМинутыНормыВремениСтрокой(Часов, Минут);
	
	Строки = СтрРазделить(ТекДанные.НормаВремениНаПогрузкуВыгрузку, ":");
	Часов = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Строки[0]);	
	Если Строки.Количество() > 1 Тогда
		Минут = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Строки[1]);
	Иначе
		Минут = 0;
	КонецЕсли;
			
	ДробнаяЧасть = Окр(Минут / 60, 2);	
	НормативЧисло = Часов + ДробнаяЧасть;
	
	ТекДанные.НормативНахожденияНаПогрузке = НормативЧисло;
	ТекДанные.НормативНахожденияНаВыгрузке = НормативЧисло;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьЧасыМинутыНормыВремениСтрокой(Часов, Минут)
	
	Если Часов > 0 Или Минут > 0 Тогда
		
		Если Часов < 100 Тогда
			ЧасыСтрокой = Формат(Часов, "ЧЦ=2; ЧН=00; ЧВН=");
		Иначе
			ЧасыСтрокой = 100;
		КонецЕсли;
		
		Пока СтрДлина(ЧасыСтрокой) < 3 Цикл
			ЧасыСтрокой = " " + ЧасыСтрокой;
		КонецЦикла;
		
		Если Минут = 0 Или Минут = 30 Тогда
			МинутыСтрокой = Формат(Минут, "ЧЦ=2; ЧН=00; ЧВН=");
		Иначе
			МинутыСтрокой = "30";
		КонецЕсли;
		
		ЧасыМинутыСтрокой = СтрШаблон("%1:%2", ЧасыСтрокой, МинутыСтрокой);
		
	Иначе
		
		ЧасыМинутыСтрокой = "";
		
	КонецЕсли;
	
	Возврат ЧасыМинутыСтрокой;
		
КонецФункции

&НаКлиенте
Процедура УслугиНормаВремениНаПогрузкуВыгрузкуРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтрокаУслуги = Элементы.Услуги.ТекущиеДанные;
	НовоеЗначение = СтрокаУслуги.НормативНахожденияНаПогрузке + 0.5 * Направление;
	
	Если НовоеЗначение >= 0 И НовоеЗначение < 101 Тогда
		СтрокаУслуги.НормативНахожденияНаПогрузке = НовоеЗначение;
		СтрокаУслуги.НормативНахожденияНаВыгрузке = НовоеЗначение;
		Часов = Цел(СтрокаУслуги.НормативНахожденияНаПогрузке);
		Минут = СтрокаУслуги.НормативНахожденияНаПогрузке - Часов;
		ЧасыМинутыСтрокой = ПолучитьЧасыМинутыНормыВремениСтрокой(Часов, Минут);
		СтрокаУслуги.НормаВремениНаПогрузкуВыгрузку = ЧасыМинутыСтрокой;
	КонецЕсли;
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиНаименованиеНоменклатурыПоставщикаПриИзменении(Элемент)
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиНормаЗагрузкиКТКНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекДанные.ТипоразмерыКТК) Тогда
		ДоступныеЗначения = ПолучитьВесаПоТипоразмеруТЕ(ТекДанные.ТипоразмерыКТК.ВыгрузитьЗначения());
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(ДоступныеЗначения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = ПолучитьСписокПодписантовКонтрагента(Объект.Контрагент, Объект.ДатаПСЦ);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокПодписантовКонтрагента(Контрагент, Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеПодписантовКонтрагентов.Период КАК Период,
		|	ДанныеПодписантовКонтрагентов.Контрагент КАК Контрагент,
		|	ДанныеПодписантовКонтрагентов.ОкончаниеДействия КАК ОкончаниеДействия,
		|	ДанныеПодписантовКонтрагентов.Должность КАК Должность,
		|	ДанныеПодписантовКонтрагентов.ДолжностьАнгл КАК ДолжностьАнгл,
		|	ДанныеПодписантовКонтрагентов.ДолжностьВРодительномПадеже КАК ДолжностьВРодительномПадеже,
		|	ДанныеПодписантовКонтрагентов.Подписант КАК Подписант,
		|	ДанныеПодписантовКонтрагентов.Фамилия КАК Фамилия,
		|	ДанныеПодписантовКонтрагентов.Имя КАК Имя,
		|	ДанныеПодписантовКонтрагентов.Отчество КАК Отчество,
		|	ДанныеПодписантовКонтрагентов.ФИОВРодительномПадеже КАК ФИОВРодительномПадеже,
		|	ДанныеПодписантовКонтрагентов.Доверенность КАК Доверенность,
		|	ДанныеПодписантовКонтрагентов.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
		|	ДанныеПодписантовКонтрагентов.СканДоверенности КАК СканДоверенности,
		|	ДанныеПодписантовКонтрагентов.Подписант.Наименование КАК ПодписантНаименование
		|ИЗ
		|	РегистрСведений.ДанныеПодписантовКонтрагентов КАК ДанныеПодписантовКонтрагентов
		|ГДЕ
		|	ДанныеПодписантовКонтрагентов.Контрагент = &Контрагент
		|	И ДанныеПодписантовКонтрагентов.Период <= &Период
		|	И ВЫБОР
		|			КОГДА ДанныеПодписантовКонтрагентов.ОкончаниеДействия = &ПустаяДата
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ДанныеПодписантовКонтрагентов.ОкончаниеДействия > &Период
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Если ЗначениеЗаполнено(Период) Тогда
		ПериодДействияДоверенности = Период;
	Иначе
		ПериодДействияДоверенности = ТекущаяДата();
	КонецЕсли;
	Запрос.УстановитьПараметр("Период", ПериодДействияДоверенности);
	
	ПустаяДата = '00010101';
	Запрос.УстановитьПараметр("ПустаяДата", ПустаяДата);
	
	СписокПодписантов = Новый СписокЗначений;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеПодписанта = Новый Структура("Период,Контрагент,ОкончаниеДействия,Подписант,Доверенность,СканДоверенности");
		ЗаполнитьЗначенияСвойств(ДанныеПодписанта, Выборка);
		Представление = СтрШаблон("%1; %2", Выборка.ПодписантНаименование, Выборка.Доверенность);
		СписокПодписантов.Добавить(ДанныеПодписанта, Представление);
	КонецЦикла;
	
	Возврат СписокПодписантов;
	
КонецФункции

&НаКлиенте
Процедура ПодписантКонтрагентаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		ЗаполнитьДанныеПодписантаКонтрагента(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПодписантаКонтрагента(ДанныеПодписанта)
	
	Объект.ПодписантКонтрагента = ДанныеПодписанта.Подписант;
	Объект.ДоверенностьНаПодписантаКонтрагента = ДанныеПодписанта.Доверенность;
	Объект.НачалоДействияДоверенностиНаПодписанта = ДанныеПодписанта.Период;
	Объект.ОкончаниеДействияДоверенностиНаПодписанта = ДанныеПодписанта.ОкончаниеДействия;
	Объект.СканДоверенностиНаПодписантаКонтрагента = ДанныеПодписанта.СканДоверенности;
	
	ЗаполнитьПолеСрокДействияДоверенностиНаПодписантаКонтрагента();
	
КонецПроцедуры

&Наклиенте
Процедура ЗаполнитьПолеСрокДействияДоверенностиНаПодписантаКонтрагента()
	
	Если ЗначениеЗаполнено(Объект.НачалоДействияДоверенностиНаПодписанта) Тогда
		СтрокаНачалоДействия = СтрШаблон("от %1 ", Формат(Объект.НачалоДействияДоверенностиНаПодписанта, "ДФ=dd.MM.yyyy"));
	Иначе
		СтрокаНачалоДействия = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ОкончаниеДействияДоверенностиНаПодписанта) Тогда
		СтрокаОкончаниеДействия = СтрШаблон("до %1", Формат(Объект.ОкончаниеДействияДоверенностиНаПодписанта, "ДФ=dd.MM.yyyy"));
	Иначе
		СтрокаОкончаниеДействия = "";
	КонецЕсли;
	
	СрокДействияДоверенностиНаПодписантаКонтрагента = СтрокаНачалоДействия + СтрокаОкончаниеДействия;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантКонтрагентаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Контрагент", Объект.Контрагент));
	//ПараметрыФормы.Вставить("Ключ", ПолучитьКлючЗаписиПодписантаКонтрагента(Новый Структура("Контрагент, Период", Объект.Контрагент, Объект.НачалоДействияДоверенностиНаПодписанта)));
	ОткрытьФорму("РегистрСведений.ДанныеПодписантовКонтрагентов.ФормаСписка", ПараметрыФормы, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.Независимый);
	
	//ПараметрыФормы = Новый Структура("Ключ", ПолучитьКлючЗаписиПодписантаКонтрагента(Новый Структура("Контрагент, Период", Объект.Контрагент, Объект.НачалоДействияДоверенностиНаПодписанта)));
	//ОткрытьФорму("РегистрСведений.ДанныеПодписантовКонтрагентов.ФормаЗаписи", ПараметрыФормы, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКлючЗаписиПодписантаКонтрагента(СтруктураКлюча)
	
	Возврат РегистрыСведений.ДанныеПодписантовКонтрагентов.СоздатьКлючЗаписи(СтруктураКлюча);
	
КонецФункции

&НаКлиенте
Процедура УслугиТипоразмерКТКПриИзменении(Элемент)

	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиТипоразмерКТКПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиТипоразмерКТКПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ПроверитьСоответствиеНормеЗагрузкиКТКТипоразмеру(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РуководительКонтрагентаОткрытие(Элемент, СтандартнаяОбработка)
	
	//ПериодРуководства = ?(ЗначениеЗаполнено(Объект.ДатаПСЦ), Объект.ДатаПСЦ, ТекущаяДата());
	//КлючЗаписи = ПолучитьКлючЗаписиРуководителяКонтрагента(Объект.Контрагент, Объект.РуководительКонтрагента, ПериодРуководства);
	//Если КлючЗаписи <> Неопределено Тогда
	//	СтандартнаяОбработка = Ложь;
	//	ПараметрыФормы = Новый Структура("Ключ", КлючЗаписи);
	//	ОткрытьФорму("РегистрСведений.ДанныеРуководителяКонтрагентов.ФормаЗаписи", ПараметрыФормы, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКлючЗаписиРуководителяКонтрагента(Контрагент, Руководитель, Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеРуководителяКонтрагентовСрезПоследних.Период КАК Период,
	|	ДанныеРуководителяКонтрагентовСрезПоследних.Контрагент КАК Контрагент
	|ИЗ
	|	РегистрСведений.ДанныеРуководителяКонтрагентов.СрезПоследних(
	|			&Период,
	|			Контрагент = &Контрагент
	|				И Руководитель = &Руководитель) КАК ДанныеРуководителяКонтрагентовСрезПоследних";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Руководитель", Руководитель);
	Запрос.УстановитьПараметр("Период", Период);
		
	Выборка = Запрос.Выполнить().Выбрать();	
	Если Выборка.Следующий() Тогда
		СтруктураКлюча = Новый Структура("Период, Контрагент");
		ЗаполнитьЗначенияСвойств(СтруктураКлюча, Выборка);
		КлючЗаписи = РегистрыСведений.ДанныеРуководителяКонтрагентов.СоздатьКлючЗаписи(СтруктураКлюча);
	Иначе
		КлючЗаписи = Неопределено;
	КонецЕсли;
	
	Возврат КлючЗаписи;
	
КонецФункции

&НаКлиенте
Процедура ПоказыватьНормативы(Команда)
	
	Элементы.УслугиПоказыватьНормативы.Пометка = Не Элементы.УслугиПоказыватьНормативы.Пометка;	
	Элементы.УслугиГруппаНормативы.Видимость = Элементы.УслугиПоказыватьНормативы.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьОпасныйГруз(Команда)
	
	Элементы.УслугиПоказыватьОпасныйГруз.Пометка = Не Элементы.УслугиПоказыватьОпасныйГруз.Пометка;
	Элементы.УслугиГруппаОпасныйГруз.Видимость = Элементы.УслугиПоказыватьОпасныйГруз.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьОсобыйТемпературныйРежим(Команда)
	
	Элементы.УслугиПоказыватьОсобыйТемпературныйРежим.Пометка = Не Элементы.УслугиПоказыватьОсобыйТемпературныйРежим.Пометка;	
	Элементы.УслугиГруппаОсобыйТемпературныйРежим.Видимость = Элементы.УслугиПоказыватьОсобыйТемпературныйРежим.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура РаскрытьВсе(Команда)
	
	УстановитьВидимостьСкрываемыхГруппКолонок(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьВсе(Команда)
	
	УстановитьВидимостьСкрываемыхГруппКолонок(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьСкрываемыхГруппКолонок(Значение)
	
	Если Элементы.УслугиПоказыватьНормативы.Доступность Тогда
		Элементы.УслугиПоказыватьНормативы.Пометка = Значение;
		Элементы.УслугиГруппаНормативы.Видимость = Элементы.УслугиПоказыватьНормативы.Пометка;
	КонецЕсли;
	
	Если Элементы.УслугиПоказыватьОпасныйГруз.Доступность Тогда
		Элементы.УслугиПоказыватьОпасныйГруз.Пометка = Значение;
		Элементы.УслугиГруппаОпасныйГруз.Видимость = Элементы.УслугиПоказыватьОпасныйГруз.Пометка;
	КонецЕсли;
	
	Если Элементы.УслугиПоказыватьДанныеЛинии.Доступность Тогда
		Элементы.УслугиПоказыватьДанныеЛинии.Пометка = Значение;
		Элементы.УслугиГруппаДанныеЛинии.Видимость = Элементы.УслугиПоказыватьДанныеЛинии.Пометка;
	КонецЕсли;
	
	Если Элементы.УслугиПоказыватьУсловияПеревозки.Доступность Тогда
		Элементы.УслугиПоказыватьУсловияПеревозки.Пометка = Значение;
		Элементы.УслугиГруппаУсловияПеревозкиОсновная.Видимость = Элементы.УслугиПоказыватьУсловияПеревозки.Пометка;
	КонецЕсли;
	
	Если Элементы.УслугиПоказыватьОсобыйТемпературныйРежим.Доступность Тогда
		Элементы.УслугиПоказыватьОсобыйТемпературныйРежим.Пометка = Значение;	
		Элементы.УслугиГруппаОсобыйТемпературныйРежим.Видимость = Элементы.УслугиПоказыватьОсобыйТемпературныйРежим.Пометка;
	КонецЕсли;
	
	Если Элементы.УслугиПоказыватьДанныеПоКонтейнерамВагонам.Доступность Тогда
		Элементы.УслугиПоказыватьДанныеПоКонтейнерамВагонам.Пометка = Значение;	
		Элементы.УслугиГруппаДанныеПоКонтейнерамВагонам.Видимость = Элементы.УслугиПоказыватьДанныеПоКонтейнерамВагонам.Пометка;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКритерииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	СписокКритериев = Новый СписокЗначений;
	Для Каждого ЭлементСписка Из ТекДанные.Критерии Цикл
		СписокКритериев.Добавить(ЭлементСписка.Значение,,, БиблиотекаКартинок.ПолеВводаОткрыть);
	КонецЦикла;
	
	ОповещениеОВыборе = Новый ОписаниеОповещения("ОбработкаВыбораКритерия", ЭтаФорма);
	ПоказатьВыборИзСписка(ОповещениеОВыборе, СписокКритериев, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораКритерия(ВыбранныйКритерий, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйКритерий <> Неопределено Тогда
		ПоказатьЗначение(, ВыбранныйКритерий.Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораКлючаНормативнойСтавки(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		ВыбранныйКлюч = ВыбранныйЭлемент.Значение;
		Протокол = ПолучитьПротоколНормативныхСтавокПоКлючу(ВыбранныйКлюч);
		Если ЗначениеЗаполнено(Протокол) Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Ключ", Протокол);
			ПараметрыФормы.Вставить("КлючАналитикиДляПереходаКСтрокеУслуг", ВыбранныйКлюч);
			ОткрытьФорму("Документ.ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.ФормаОбъекта", ПараметрыФормы);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПротоколНормативныхСтавокПоКлючу(КлючНормативнойСтавки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПротоколСНормативнымиСтавкамиНаУслугиПоставщиковКритерииУслуг.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.КритерииУслуг КАК ПротоколСНормативнымиСтавкамиНаУслугиПоставщиковКритерииУслуг
	|ГДЕ
	|	ПротоколСНормативнымиСтавкамиНаУслугиПоставщиковКритерииУслуг.КлючАналитикиСтрокиПротокола = &КлючНормативнойСтавки";
	
	Запрос.УстановитьПараметр("КлючНормативнойСтавки", КлючНормативнойСтавки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Протокол = Выборка.Ссылка;
	Иначе
		Протокол = Неопределено;
	КонецЕсли;
	
	Возврат Протокол;
	
КонецФункции

&НаКлиенте
Процедура УслугиТипоразмерыКТКПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиТипоразмерыКТКПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиТипоразмерыКТКПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	//Евросиб Шевченко А.В. US 125530 TA 131571 11.03.2026
	ЗначенияПолей = ОпредилитьОбязательностьЗаполненияПолейПоДопУсловиям(ТекДанные);
	Для Каждого ОбязательноеПоле Из ЗначенияПолей Цикл
		ТекДанные[ОбязательноеПоле.ИмяРек] = ОбязательноеПоле.Значение;
		//Евросиб Шевченко А.В. US 125530 TA 131571 12.03.2026
		Если СтрНайти(ОбязательноеПоле.ИмяРек, "Комментарий") Тогда
			Если ТекДанные.ТипоразмерыКТК.НайтиПоЗначению(Справочники.ТипоразмерыТЕ.Другое) <> Неопределено Тогда
				ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", ТекДанные.НомерСтроки, "Комментарий");
				ТекстСообщения = "Необходимо описать тип перевозимой установки";
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;				
		КонецЕсли;
		//Евросиб Шевченко А.В. US 125530 TA 131571 12.03.2026
	КонецЦикла;
	//Евросиб Шевченко А.В. US 125530 TA 131571 11.03.2026
	ОбработатьИзмененияТипоразмеровКТКСтрокиУслуг(ТекДанные);
	УдалитьПризнакиПроверкиСтавкиПоСтрокеУслуг(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзмененияТипоразмеровКТКСтрокиУслуг(ТекДанные)
	
	ТекДанные.ТипоразмерыКТКСтрокой = СтрСоединить(ТекДанные.ТипоразмерыКТК.ВыгрузитьЗначения(), "; ");
	//СформироватьСтрокиКритериевПоТипоразмерамКТКСтрокиТаблицыУслуг(ТекДанные);
	ПроверитьСоответствиеНормеЗагрузкиКТКТипоразмеру(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиАдресТерминалаВыдачиПостановкиКТКПриИзменении(Элемент)
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиАдресСкладаПогрузкиВыгрузкиПриИзменении(Элемент)
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиАдресТерминалаСдачиКТКПриИзменении(Элемент)
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиУдалитьТипоразмерВагонаПриИзменении(Элемент)
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКТКВагонОпределенногоСобственникаПриИзменении(Элемент)
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСостояниеГруженыйПорожнийПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиБазоваяСтавкаНадбавкаПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиЕдиницаИзмеренияПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиЕдиницаИзмеренияПриИзмененииСервер(ТекСтрока); //Евросиб Шевченко А.В. US 83101 TA 122833 07.11.2025
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УслугиЕдиницаИзмеренияПриИзмененииСервер(ТекСтрока) //Евросиб Шевченко А.В. US 83101 TA 122833 07.11.2025
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ЗначенияПолей = ОпредилитьОбязательностьЗаполненияПолейПоДопУсловиям(ТекДанные);
	Для Каждого ОбязательноеПоле Из ЗначенияПолей Цикл
		ТекДанные[ОбязательноеПоле.ИмяРек] = ОбязательноеПоле.Значение;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтоимостьБазовойСтавкиНадбавкиПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиВалютаПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиВалютаПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиВалютаПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	УдалитьПризнакиПроверкиСтавкиПоСтрокеУслуг(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиНормаЗагрузкиКТКПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиНормаЗагрузкиКТКПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиНормаЗагрузкиКТКПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	УстановитьЗначениеПоляСостояниеГруженыйПорожний(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиНормаПользованияПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиНормаПользованияПриИзмененииСервер(ТекСтрока);
	
	ПересчетСтавкиПСвСутки(ТекСтрока,"НормаПользования"); //Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиНормаПользованияПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	УдалитьПризнакиПроверкиСтавкиПоСтрокеУслуг(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиНормативНахожденияНаПогрузкеПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиНормативНахожденияНаВыгрузкеПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиВидСобственностиПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиВидСобственностиПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиВидСобственностиПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	УдалитьПризнакиПроверкиСтавкиПоСтрокеУслуг(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтандартОпасностиГрузаПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиКлассОпасностиГрузаПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиПериодПредоставленияПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиПериодПредоставленияПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиПериодПредоставленияПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	УдалитьПризнакиПроверкиСтавкиПоСтрокеУслуг(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКомментарийПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтанцииПогранпереходовПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиОсобыйТемпературныйРежимЗначениеПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиСвободныйПериодХраненияПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиСвободныйПериодХраненияПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиСвободныйПериодХраненияПриИзмененииСервер(ИдентификаторСтроки)
	
	СтрокаУслуг = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
	ОбработатьИзменениеПериодаХраненияВСтроке(СтрокаУслуг, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСвободныйПериодХраненияПриОтправкеПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиСвободныйПериодХраненияПриОтправкеПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиСвободныйПериодХраненияПриОтправкеПриИзмененииСервер(ИдентификаторСтроки)
	
	СтрокаУслуг = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
	ОбработатьИзменениеПериодаХраненияВСтроке(СтрокаУслуг, Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеПериодаХраненияВСтроке(СтрокаУслуги, ИзмененПризнакПрогрессивнойСтавки)
	
	Если СтрокаУслуги.СтавкаПрогрессивная Тогда
		СформироватьШкалуПрогрессивнойСтавки(СтрокаУслуги, ИзмененПризнакПрогрессивнойСтавки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСвободныйПериодХраненияПриПриемеПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиСвободныйПериодХраненияПриПриемеПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиСвободныйПериодХраненияПриПриемеПриИзмененииСервер(ИдентификаторСтроки)
	
	СтрокаУслуг = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
	ОбработатьИзменениеПериодаХраненияВСтроке(СтрокаУслуг, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСвободныйПериодХраненияУслугиДепоПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиСвободныйПериодХраненияУслугиДепоПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиСвободныйПериодХраненияУслугиДепоПриИзмененииСервер(ИдентификаторСтроки)
	
	СтрокаУслуг = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
	ОбработатьИзменениеПериодаХраненияВСтроке(СтрокаУслуг, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиГрузРастаможенПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиЭкспортИмпортПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиЛинияПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоВПартииПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиПринадлежностьТЕПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиСудноПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиУсловияПеревозкиПоОтправлениюПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиУсловияПеревозкиПоПрибытиюПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиВесГрузаКГПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиГрузоотправительПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиГрузополучательПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоносаментПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	КоносаментПриИзмененииСервер(ТекСтрока);
	//Евросиб Шевченко А.В. US 110215 TA 128335 12.03.2026
	Если Объект.ВидУслугПоставщика = ПредопределенноеЗначение("Справочник.ВидыУслугПоставщиков.Фрахт") ИЛИ Объект.ВидУслугПоставщика = ПредопределенноеЗначение("Справочник.ВидыУслугПоставщиков.ТЭО") Тогда
		ТекДанныеУслуги = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
		УстановитьВидимостьДоступностьЭлементовДетализацииПоУчетнымЕдиницам(ТекДанныеУслуги);
	КонецЕсли;
	//Евросиб Шевченко А.В. US 110215 TA 128335 12.03.2026
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КоносаментПриИзмененииСервер(ТекСтрока)
	
	 ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	 
	 ТекДанные.Судно = Справочники.ТС.ПустаяСсылка();
	 ТекДанные.РейсМоре = Справочники.РейсыМоре.ПустаяСсылка();
	 
	 //Евросиб Шевченко А.В. US 110215 TA 128335 12.03.2026
	 ВыборкаКоносамент = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекДанные.Коносамент,"МорскойРейс, Судно, СтанцияОтправления, СтанцияНазначения, Коносаменты, МестоПолученияГруза, МестоПоставкиГруза");
	 
	 ТекДанные.Судно = ВыборкаКоносамент.Судно;
	 ТекДанные.РейсМоре = ВыборкаКоносамент.МорскойРейс;
	 
	 Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Фрахт ИЛИ Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.ТЭО Тогда
		 
		 ТекДанные.ПунктОтправления = ВыборкаКоносамент.СтанцияОтправления;
		 ТекДанные.ПунктНазначения = ВыборкаКоносамент.СтанцияНазначения;
		 
		 ТекДанные.ТерминалОтправления = ВыборкаКоносамент.МестоПолученияГруза;
		 ТекДанные.ТерминалНазначения = ВыборкаКоносамент.МестоПоставкиГруза;
		 
		 Если Не ЗначениеЗаполнено(ТекДанные.ПунктОтправления) Тогда
			 ЛокацияПустаяСсылка = Справочники.Локации.ПустаяСсылка();
			 ТекДанные.ПунктОтправленияГород = ЛокацияПустаяСсылка;
			 ТекДанные.ПунктОтправленияСтрана = ЛокацияПустаяСсылка;
		 КонецЕсли;
		 
		 Если Не ЗначениеЗаполнено(ТекДанные.ПунктНазначения) Тогда
			 ЛокацияПустаяСсылка = Справочники.Локации.ПустаяСсылка();
			 ТекДанные.ПунктНазначенияГород = ЛокацияПустаяСсылка;
			 ТекДанные.ПунктНазначенияСтрана = ЛокацияПустаяСсылка;
		 КонецЕсли;
		 
		 Если ЗначениеЗаполнено(ТекДанные.Коносамент) Тогда
			 СписокКТК = ВыборкаКоносамент.Коносаменты.Выгрузить().ВыгрузитьКолонку("НомерКТК");
		 Иначе
			 СписокКТК = Новый Массив;
		 КонецЕсли;
		 
		 ТекДанные.СпособВводаУчетныхЕдиниц = Перечисления.СпособыВводаУчетныхЕдиниц.Построчно;
		 
		 СоздатьСтрокиТаблицыПоУчетнымЕдиницам(ТекДанные.ПолучитьИдентификатор(), СписокКТК, Истина);	
		 ОбработатьИзменениеПунктаОтправленияВСтроке(ТекДанные);
		 ОбработатьИзменениеПунктаНазначенияВСтроке(ТекДанные);
		 ОбновитьДинамическиеПоляТаблицыУслугПоСтроке(ТекДанные);
		 
	 КонецЕсли; 
	 
	 //Евросиб Шевченко А.В. US 110215 TA 128335 12.03.2026
	 
КонецПроцедуры	

&НаКлиенте
Процедура УслугиОкончаниеДействияФактПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВариантОпределенияДатыКурсаВалютПриИзменении(Элемент)
	
	ОписаниеПоля = ПараметрыВидаУслуг.ПоляТаблицыУслуг.Получить("ВариантОпределенияДатыКурсаВалют");
	Если ОписаниеПоля <> Неопределено Тогда
		Если ЗначениеЗаполнено(Объект.ВариантОпределенияДатыКурсаВалют) Тогда
			Для Каждого Стр Из Объект.Услуги Цикл
				//Если Не ЗначениеЗаполнено(Стр.ВариантОпределенияДатыКурсаВалют) Тогда
					Стр.ВариантОпределенияДатыКурсаВалют = Объект.ВариантОпределенияДатыКурсаВалют;
				//КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПеревозкиПриИзменении(Элемент)
	
	ВидПеревозкиПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Процедура ВидПеревозкиПриИзмененииСервер()

	//Евросиб Коханенко Н.А. 29.05.2025 (( #109338 
	//Если Объект.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.Внутрироссийская") Тогда
	//	Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20");
	//ИначеЕсли Объект.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.ВнеТерриторииРФ") Тогда
	//	Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
	//ИначеЕсли Объект.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.Международная") Тогда
	//	Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0");
	//Иначе
	//	Элементы.СтавкаНДС.ТолькоПросмотр = Ложь;
	//	Возврат;
	//КонецЕсли;
	
	ЗаполнитьСтавкиНДС(); //Евросиб Шевченко А.В. BUG 131579 TA 132300 17.03.2026
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктОтправленияГородНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораЛокации(Элемент, "ПунктОтправленияГород", СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНачалоВыбораЛокации(Элемент, ИмяПоля, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	Если ТекДанные[ИмяПоля] = Неопределено Тогда
		
		ИдентификаторТекСтроки = ТекДанные.ПолучитьИдентификатор();
		
		СписокТипов = новый СписокЗначений;
		
		ДоступныеТипы = Элемент.ОграничениеТипа.Типы();
		Если ЗначениеЗаполнено(ДоступныеТипы) Тогда
			СписокТипов.ЗагрузитьЗначения(ДоступныеТипы);
		Иначе
			СписокТипов.Добавить(Тип("СправочникСсылка.Локации"));
			СписокТипов.Добавить(Тип("СправочникСсылка.Мультилокации"));
		КонецЕсли;
	
		Если СписокТипов.Количество() > 1 Тогда
			
			СтандартнаяОбработка = Ложь;
			
			ДопПараметры = Новый Структура("ИдентификаторТекСтроки, ИмяПоля", ИдентификаторТекСтроки, ИмяПоля);
			ОповещениеОВыборе = Новый ОписаниеОповещения("ОбработатьВыборТипаПоляЛокация", ЭтаФорма, ДопПараметры);
			
			СписокТипов.ПоказатьВыборЭлемента(ОповещениеОВыборе, "Выбор типа данных");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборТипаПоляЛокация(ВыбранныйТип, ДопПараметры) Экспорт
	
	Если ВыбранныйТип <> Неопределено Тогда		
		ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ДопПараметры.ИдентификаторТекСтроки);
		Если ВыбранныйТип.Значение = Тип("СправочникСсылка.Мультилокации") Тогда
			ТекДанные[ДопПараметры.ИмяПоля] = ПредопределенноеЗначение("Справочник.Мультилокации.ПустаяСсылка");
		Иначе
			ТекДанные[ДопПараметры.ИмяПоля] = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктОтправленияГородОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;		
	ТекДанные.ПунктОтправленияГород = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктНазначенияГородНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораЛокации(Элемент, "ПунктНазначенияГород", СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктНазначенияГородОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;		
	ТекДанные.ПунктНазначенияГород = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиВариантОпределенияДатыКурсаВалютПриИзменении(Элемент)
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктОтправленияСтранаПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиПунктОтправленияСтранаПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиПунктОтправленияСтранаПриИзмененииСервер(ИдентификаторСтроки)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
	ОбработатьИзменениеСтраныОтправленияВСтроке(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеСтраныОтправленияВСтроке(ТекДанные)
	//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
	Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.ТЭО Тогда
		ОбновитьДинамическиеПоляТаблицыУслугПоСтроке(ТекДанные);
		Возврат;
	КонецЕсли;
	//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
	ЛокацияПустаяСсылка = Справочники.Локации.ПустаяСсылка();
	ТекДанные.ПунктОтправления = ЛокацияПустаяСсылка;
	ТекДанные.ПунктОтправленияГород = ЛокацияПустаяСсылка;
	ОбновитьДинамическиеПоляТаблицыУслугПоСтроке(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктНазначенияСтранаПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиПунктНазначенияСтранаПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиПунктНазначенияСтранаПриИзмененииСервер(ИдентификаторСтроки)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
	ОбработатьИзменениеСтраныНазначенияВСтроке(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеСтраныНазначенияВСтроке(ТекДанные)
	//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
	Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.ТЭО Тогда
		ОбновитьДинамическиеПоляТаблицыУслугПоСтроке(ТекДанные);
		Возврат;
	КонецЕсли;
	//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
	ЛокацияПустаяСсылка = Справочники.Локации.ПустаяСсылка();
	ТекДанные.ПунктНазначения = ЛокацияПустаяСсылка;
	ТекДанные.ПунктНазначенияГород = ЛокацияПустаяСсылка;
	ОбновитьДинамическиеПоляТаблицыУслугПоСтроке(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиИнструкцииПоВыдачеПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиИнструкцииПоСдачеПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктОтправленияСтранаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораЛокации(Элемент, "ПунктОтправленияСтрана", СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктОтправленияСтранаОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;		
	ТекДанные.ПунктОтправленияСтрана = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктНазначенияСтранаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораЛокации(Элемент, "ПунктНазначенияСтрана", СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктНазначенияСтранаОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;		
	ТекДанные.ПунктНазначенияСтрана = Неопределено;
	
КонецПроцедуры


&НаКлиенте
Процедура УслугиЕТСНГАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекстДляПоиска = СокрЛП(Текст);
	Если СтрДлина(ТекстДляПоиска) > 2 Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = ПолучитьЭлементыЕТСНГпоЧастиКода(ТекстДляПоиска);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЭлементыЕТСНГпоЧастиКода(Текст)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	э_ЕТСНГ.Ссылка КАК Ссылка,
	|	э_ЕТСНГ.Код КАК Код,
	|	э_ЕТСНГ.Наименование КАК Наименование
	|ИЗ
	|	Справочник.э_ЕТСНГ КАК э_ЕТСНГ
	|ГДЕ
	|	э_ЕТСНГ.Код ПОДОБНО &Текст
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	Запрос.УстановитьПараметр("Текст", "%" + Текст + "%");
	
	СписокЭлементов = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокЭлементов.Добавить(Выборка.Ссылка, СтрШаблон("%1 (%2)", Выборка.Наименование, Выборка.Код));
	КонецЦикла;
	
	Возврат СписокЭлементов;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЭлементыГНГпоЧастиКода(Текст)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	э_ГНГ.Ссылка КАК Ссылка,
	|	э_ГНГ.КодГНГСтрокой КАК Код,
	|	э_ГНГ.Наименование КАК Наименование
	|ИЗ
	|	Справочник.э_ГНГ КАК э_ГНГ
	|ГДЕ
	|	э_ГНГ.КодГНГСтрокой ПОДОБНО &Текст
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	Запрос.УстановитьПараметр("Текст", "%" + Текст + "%");
	
	СписокЭлементов = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокЭлементов.Добавить(Выборка.Ссылка, СтрШаблон("%1 (%2)", Выборка.Наименование, Выборка.Код));
	КонецЦикла;
	
	Возврат СписокЭлементов;
	
КонецФункции


&НаКлиенте
Процедура УслугиГНГАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекстДляПоиска = СокрЛП(Текст);
	Если СтрДлина(ТекстДляПоиска) > 2 Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = ПолучитьЭлементыГНГпоЧастиКода(ТекстДляПоиска);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура УслугиЕТСНГОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	ВыбранноеЗначение = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "Код");
	
КонецПроцедуры


&НаКлиенте
Процедура УслугиЕТСНГОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Текст) Тогда		
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура УслугиГНГОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Текст) Тогда		
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура УслугиГНГОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	ВыбранноеЗначение = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "КодГНГСтрокой");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЕТСНГНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.э_ЕТСНГ.ФормаВыбора",, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиГНГНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.э_ГНГ.ФормаВыбора",, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктОтправленияСтранаОткрытие(Элемент, СтандартнаяОбработка)
	
	ОткрытьЛокациюИзПоляТаблицыУслуг(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктОтправленияГородОткрытие(Элемент, СтандартнаяОбработка)
	
	ОткрытьЛокациюИзПоляТаблицыУслуг(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктОтправленияОткрытие(Элемент, СтандартнаяОбработка)
	
	ОткрытьЛокациюИзПоляТаблицыУслуг(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктНазначенияСтранаОткрытие(Элемент, СтандартнаяОбработка)
	
	ОткрытьЛокациюИзПоляТаблицыУслуг(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктНазначенияГородОткрытие(Элемент, СтандартнаяОбработка)
	
	ОткрытьЛокациюИзПоляТаблицыУслуг(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктНазначенияОткрытие(Элемент, СтандартнаяОбработка)
	
	ОткрытьЛокациюИзПоляТаблицыУслуг(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЛокациюИзПоляТаблицыУслуг(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	ИмяПоля = Сред(Элемент.Имя, 7);
	Локация = ТекДанные[ИмяПоля];
	Если ЗначениеЗаполнено(Локация) Тогда
		Если ТипЗнч(Локация) = Тип("СправочникСсылка.Мультилокации") Тогда
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Ключ", Локация);
			ПараметрыВыбораЛокаций = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(Элемент.ПараметрыВыбора);
			ПараметрыФормы.Вставить("ПараметрыВыбораЛокаций", ПараметрыВыбораЛокаций);
			ОткрытьФорму("Справочник.Мультилокации.ФормаОбъекта", ПараметрыФормы);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура УслугиСтанцииПогранпереходовОткрытие(Элемент, СтандартнаяОбработка)
	
	ОткрытьЛокациюИзПоляТаблицыУслуг(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры


&НаКлиенте
Процедура УслугиПунктОтправленияНазначенияОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;		
	ТекДанные.ПунктОтправленияНазначения = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПунктОтправленияНазначенияОткрытие(Элемент, СтандартнаяОбработка)
	
	ОткрытьЛокациюИзПоляТаблицыУслуг(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСтавкиНаСервере()
	
	СоздатьСтрокиКритериевУслуг();
	Документы.ПСЦПоставщика.СверитьУслугиПротоколаСНормативнымиСтавками(Объект, Истина);
	ОбновитьДинамическиеПоляТаблицыУслуг();
	ОбновитьГруппуПротоколовНормативныхСтавок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСтавки(Команда)
	ПроверитьСтавкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюСервер()
	
	СоздатьСтрокиКритериевУслуг();
	
	Если ЗаполнятьНормативы Тогда
		ЗаполнитьНормативыСервер();
	КонецЕсли;
	
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Порты Тогда
		ПодобратьПеревалки();
	КонецЕсли;
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	
	НайтиЗаписатьМультизначения();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьСтрокиКритериевУслуг()
	
	Документы.ПСЦПоставщика.СоздатьСтрокиКритериевУслуг(Объект);
	
КонецПроцедуры	

&НаКлиенте
Процедура НачалоДействияПриИзменении(Элемент)
	
	СброситьРезультатыСверкиСтавок();
	
КонецПроцедуры

&НаСервере
Процедура СброситьРезультатыСверкиСтавок()
	
	ПроверкаНеОсуществлялась = ПредопределенноеЗначение("Перечисление.РезультатыПроверки.НеОсуществлялась");
	КлючНормативнойСтавкиПустаяСсылка = ПредопределенноеЗначение("Справочник.КлючиАналитикиСтрокПротокола.ПустаяСсылка");
	
	Для Каждого Стр Из Объект.Услуги Цикл
		Стр.ПроверкаСтавок = ПроверкаНеОсуществлялась;
	КонецЦикла;
	
	Для Каждого Стр Из Объект.КритерииУслуг Цикл
		Стр.КлючНормативнойСтавки = КлючНормативнойСтавкиПустаяСсылка;
	КонецЦикла;
	
	ОбновитьГруппуПротоколовНормативныхСтавок();
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиТипоразмерыКТКСтрокойНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Модифицированность = Истина;
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	//Евросиб Шевченко А.В. US 125530 TA 131571 12.03.2026
	ОписаниеПоля = ПараметрыВидаУслуг.ПоляТаблицыУслуг.Получить("ТипоразмерыКТКСтрокой");
	Если ОписаниеПоля <> Неопределено И ЗначениеЗаполнено(ОписаниеПоля.СписокВыбора) Тогда
		Типоразмеры = ОписаниеПоля.СписокВыбора.ВыгрузитьЗначения();
		СписокТипоразмеров = Новый СписокЗначений;
		СписокТипоразмеров.ЗагрузитьЗначения(Типоразмеры);
	Иначе
		Типоразмеры = ПолучитьТипоразмерыКТК();
		СписокТипоразмеров = Новый СписокЗначений;
		СписокТипоразмеров.ЗагрузитьЗначения(Типоразмеры);
	КонецЕсли;
	//Евросиб Шевченко А.В. US 125530 TA 131571 12.03.2026
	Для Каждого ЭлементСписка Из СписокТипоразмеров Цикл
		ВыбранныйЭлемент = ТекДанные.ТипоразмерыКТК.НайтиПоЗначению(ЭлементСписка.Значение);
		Если ВыбранныйЭлемент <> Неопределено Тогда
			ЭлементСписка.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;	
	ПараметрыФормы.Вставить("ТекущийСписок", СписокТипоразмеров);
	ПараметрыФормы.Вставить("ПоказыватьПометку", Истина);
	ПараметрыФормы.Вставить("ИзменятьСоставСтрок", Ложь);
	ПараметрыФормы.Вставить("ТипоразмерДругое", ПредопределенноеЗначение("Справочник.ТипоразмерыТЕ.Другое")); //Евросиб Шевченко А.В. US 125530 TA 131571 12.03.2026
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ИдентификаторСтроки", ТекСтрока);
	
	ОповещениеОЗакрытииФормыСписка = Новый ОписаниеОповещения("ПриЗакрытииФормыРедактированияСпискаТипоразмеровКТК", ЭтаФорма, ПараметрыОповещения);	
	ОткрытьФорму("ОбщаяФорма.ФормаРедактированияСпискаЗначений", ПараметрыФормы, Этаформа,,,, ОповещениеОЗакрытииФормыСписка, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыРедактированияСпискаТипоразмеровКТК(СписокТипоразмеров, ДополнительныеПараметры) Экспорт
	
	Если СписокТипоразмеров <> Неопределено Тогда
		
		ТекСтрока = ДополнительныеПараметры.ИдентификаторСтроки;
		ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
		ТекДанные.ТипоразмерыКТК.Очистить();		
		
		Для Каждого ЭлементСписка Из СписокТипоразмеров Цикл
			Если ЭлементСписка.Пометка Тогда
				ТекДанные.ТипоразмерыКТК.Добавить(ЭлементСписка.Значение);
			КонецЕсли;
		КонецЦикла;
		
		Типоразмеры = ТекДанные.ТипоразмерыКТК.ВыгрузитьЗначения();
		
		УслугиТипоразмерыКТКПриИзмененииСервер(ТекСтрока);
		
		
		
		Если ЗаполнятьВниз Тогда
			ВыполнитьЗаполнениеВниз();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТипоразмерыКТК()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТипоразмерыТЕ.Ссылка КАК Ссылка,
		|	ТипоразмерыТЕ.Код КАК Код
		|ИЗ
		|	Справочник.ТипоразмерыТЕ КАК ТипоразмерыТЕ
		|ГДЕ
		|	НЕ ТипоразмерыТЕ.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Код";
	
	ТаблицаТипоразмеров = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаТипоразмеров.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТипоразмерыВагонов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТипоразмерыТС.Ссылка КАК Ссылка,
	|	ТипоразмерыТС.Код КАК Код
	|ИЗ
	|	Справочник.ТипоразмерыТС КАК ТипоразмерыТС
	|ГДЕ
	|	НЕ ТипоразмерыТС.ПометкаУдаления
	|	И ТипоразмерыТС.Родитель = &ТипоразмерТСПустаяСсылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	
	Запрос.УстановитьПараметр("ТипоразмерТСПустаяСсылка", Справочники.ТипоразмерыТС.ПустаяСсылка());
	ТаблицаТипоразмеров = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаТипоразмеров.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВидыОтправок()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыОтправок.Ссылка КАК Ссылка,
		|	ВидыОтправок.Порядок КАК Порядок
		|ИЗ
		|	Перечисление.ВидыОтправок КАК ВидыОтправок
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Возврат Таблица.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
Процедура УслугиТипоразмерыКТКСтрокойОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	
	ТекДанные.ТипоразмерыКТК.Очистить();
	
	УслугиТипоразмерыКТКПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКритерииСтрокойНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	СписокКритериев = Новый СписокЗначений;
	Для Каждого ЭлементСписка Из ТекДанные.Критерии Цикл
		СписокКритериев.Добавить(ЭлементСписка.Значение,,, БиблиотекаКартинок.ПолеВводаОткрыть);
	КонецЦикла;
	
	ОповещениеОВыборе = Новый ОписаниеОповещения("ОбработкаВыбораКритерия", ЭтаФорма);
	ПоказатьВыборИзСписка(ОповещениеОВыборе, СписокКритериев, Элемент);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьПризнакиПроверкиСтавкиПоСтрокеУслуг(ТекДанные)
	
	ТекДанные.ПроверкаСтавок = ПредопределенноеЗначение("Перечисление.РезультатыПроверки.НеОсуществлялась");
	
	КлючНормативнойСтавкиПустаяСсылка = Справочники.КлючиАналитикиСтрокПротокола.ПустаяСсылка();
	СтрокиКритериев = Объект.КритерииУслуг.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", ТекДанные.ИдентификаторСтрокиУслуг));
	Для Каждого Стр Из СтрокиКритериев Цикл
		Стр.КлючНормативнойСтавки = КлючНормативнойСтавкиПустаяСсылка;
	КонецЦикла;
	
	ОбновитьГруппуПротоколовНормативныхСтавок();
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПослеУдаления(Элемент)
	
	УслугиПослеУдаленияСервер();
	
КонецПроцедуры

&НаСервере
Процедура УслугиПослеУдаленияСервер()
	
	УстановитьВидимостьГруппПоНормативам();
	УстановитьВидимостьГруппыПоЗначениюПоля(Объект.Услуги, Элементы.УслугиГруппаОпасностьГруза, "ОпасныйСпецГруз");
	УстановитьВидимостьГруппыПоЗначениюПоля(Объект.Услуги, Элементы.УслугиОсобыйТемпературныйРежимЗначение, "ОсобыйТемпературныйРежим");
	ПроверитьИУстановитьПризнакТиповой();	
	ОбновитьГруппуПротоколовНормативныхСтавок();
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеДействияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ОкончаниеДействия) Тогда
		Объект.ДействуетДоСогласованияНовыхУсловий = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНормативыСервер()
	
	ТаблицаУслугИТипоразмеров = Объект.Услуги.Выгрузить(Новый Массив, "ИдентификаторСтрокиУслуг, Номенклатура, ТипоразмерВагона, Нормативы, НормаЗагрузкиКТК, НормаВремениНаПогрузкуВыгрузку, НормаПользования, НормативНахожденияНаПогрузке, НормативНахожденияНаВыгрузке");
	ТаблицаУслугИТипоразмеров.Колонки.Добавить("ТипоразмерКТК", Новый ОписаниеТипов("СправочникСсылка.ТипоразмерыТЕ"));
	
	Для Каждого СтрУслуг Из Объект.Услуги Цикл
		СтрокиКритериев = Объект.КритерииУслуг.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", СтрУслуг.ИдентификаторСтрокиУслуг));
		Для Каждого СтрКритериев Из СтрокиКритериев Цикл
			НСтр = ТаблицаУслугИТипоразмеров.Добавить();
			ЗаполнитьЗначенияСвойств(НСтр, СтрУслуг);
			ЗаполнитьЗначенияСвойств(НСтр, СтрКритериев);
		КонецЦикла;
	КонецЦикла;
	
	АвтоперевозкаГруженыйКонтейнер = Справочники.Номенклатура.АвтоперевозкаГруженыйКонтейнер;
	ПревышениеНормыЗагрузкиКонтейнера = Справочники.Номенклатура.ПревышениеНормыЗагрузкиКонтейнера;
	СНПАвтотранспорта = Справочники.Номенклатура.СНПавтотранспорта;
	
	ПредоставлениеПС = Справочники.Номенклатура.ПредоставлениеПлатформ;
	СНПВагонов = Справочники.Номенклатура.СНПвагонов;
	СНПВагоновПогрузкаВыгрузка = Справочники.Номенклатура.СНПвагоновПогрузкаВыгрузка;
	
	СоответствиеВесовТипоразмерам = ПолучитьСоответствиеВесовТипоразмерам();
	
	Для Каждого Стр Из ТаблицаУслугИТипоразмеров Цикл
		
		Если Стр.Номенклатура = АвтоперевозкаГруженыйКонтейнер Тогда
			
			НайденныеСтроки = ТаблицаУслугИТипоразмеров.НайтиСтроки(Новый Структура("Номенклатура, ТипоразмерКТК, Нормативы", ПревышениеНормыЗагрузкиКонтейнера, Стр.ТипоразмерКТК, Истина));
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				
				Если ЗначениеЗаполнено(НайденнаяСтрока.НормаЗагрузкиКТК) Тогда
					Веса = СоответствиеВесовТипоразмерам.Получить(Стр.ТипоразмерКТК);
					Если ЗначениеЗаполнено(Веса) И Веса.Найти(НайденнаяСтрока.НормаЗагрузкиКТК) <> Неопределено Тогда
						СтрокиУслуг = Объект.Услуги.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", Стр.ИдентификаторСтрокиУслуг));
						Если ЗначениеЗаполнено(СтрокиУслуг) Тогда
							СтрокиУслуг[0].Нормативы = Истина;
							СтрокиУслуг[0].НормаЗагрузкиКТК = НайденнаяСтрока.НормаЗагрузкиКТК;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
			НайденныеСтроки = ТаблицаУслугИТипоразмеров.НайтиСтроки(Новый Структура("Номенклатура, ТипоразмерКТК, Нормативы", СНПАвтотранспорта, Стр.ТипоразмерКТК, Истина));
			Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
				СтрокиУслуг = Объект.Услуги.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", Стр.ИдентификаторСтрокиУслуг));
				Если ЗначениеЗаполнено(СтрокиУслуг) Тогда
					СтрокиУслуг[0].Нормативы = Истина;
					СтрокиУслуг[0].НормаВремениНаПогрузкуВыгрузку = НайденныеСтроки[0].НормаВремениНаПогрузкуВыгрузку;
					СтрокиУслуг[0].НормативНахожденияНаПогрузке = НайденныеСтроки[0].НормативНахожденияНаПогрузке;
					СтрокиУслуг[0].НормативНахожденияНаВыгрузке = НайденныеСтроки[0].НормативНахожденияНаВыгрузке;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Стр.Номенклатура = ПредоставлениеПС Тогда
			
			НайденныеСтроки = ТаблицаУслугИТипоразмеров.НайтиСтроки(Новый Структура("Номенклатура, ТипоразмерВагона, Нормативы", СНПВагонов, Стр.ТипоразмерВагона, Истина));
			Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
				СтрокиУслуг = Объект.Услуги.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", Стр.ИдентификаторСтрокиУслуг));
				Если ЗначениеЗаполнено(СтрокиУслуг) Тогда
					СтрокиУслуг[0].Нормативы = Истина;
					СтрокиУслуг[0].НормаПользования = НайденныеСтроки[0].НормаПользования;
					СтрокиУслуг[0].НормативНахожденияНаПогрузке = НайденныеСтроки[0].НормативНахожденияНаПогрузке;
					СтрокиУслуг[0].НормативНахожденияНаВыгрузке = НайденныеСтроки[0].НормативНахожденияНаВыгрузке;
				КонецЕсли;
			Иначе
				НайденныеСтроки = ТаблицаУслугИТипоразмеров.НайтиСтроки(Новый Структура("Номенклатура, ТипоразмерВагона, Нормативы", СНПВагоновПогрузкаВыгрузка, Стр.ТипоразмерВагона, Истина));
				Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
					СтрокиУслуг = Объект.Услуги.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", Стр.ИдентификаторСтрокиУслуг));
					Если ЗначениеЗаполнено(СтрокиУслуг) Тогда
						СтрокиУслуг[0].Нормативы = Истина;
						СтрокиУслуг[0].НормаПользования = НайденныеСтроки[0].НормаПользования;
						СтрокиУслуг[0].НормативНахожденияНаПогрузке = НайденныеСтроки[0].НормативНахожденияНаПогрузке;
						СтрокиУслуг[0].НормативНахожденияНаВыгрузке = НайденныеСтроки[0].НормативНахожденияНаВыгрузке;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНормативыНаСервере()
	
	СоздатьСтрокиКритериевУслуг();
	ЗаполнитьНормативыСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНормативы(Команда)
	
	ЗаполнитьНормативыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКонтейнерыВагоныОчистка(Элемент, СтандартнаяОбработка)
	
	Модифицированность = Истина;
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	УдалитьСтрокуТаблицыУчетныхЕдиниц(, ТекДанные.ИдентификаторСтрокиУслуг);
	
КонецПроцедуры

&НаСервере
Процедура УслугиЛокацияОказанияУслугиПриИзмененииНаСервере(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ОбработатьИзменениеЛокацииОказанияУслугиВСтрокеУслуг(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеЛокацииОказанияУслугиВСтрокеУслуг(ТекДанные)
	
	ОбновитьДинамическиеПоляТаблицыУслугПоСтроке(ТекДанные);
	
КонецПроцедуры

//&НаСервереБезКонтекста
//Функция ПолучитьЖелезнуюДорогуПоТерминалу(Терминал)
//	
//	ЖелезнаяДорога = Справочники.ЖелезныеДороги.ПустаяСсылка();
//	Если ЗначениеЗаполнено(Терминал) Тогда
//		
//		Запрос = Новый Запрос;
//		Запрос.Текст =
//		"ВЫБРАТЬ РАЗЛИЧНЫЕ
//		|	ГоризонтальныеСвязиЛокаций.ЖДСтанция.ЖелезнаяДорога КАК ЖелезнаяДорога
//		|ИЗ
//		|	РегистрСведений.ГоризонтальныеСвязиЛокаций КАК ГоризонтальныеСвязиЛокаций
//		|ГДЕ
//		|	ГоризонтальныеСвязиЛокаций.Терминал = &Терминал
//		|	И ЕСТЬNULL(ГоризонтальныеСвязиЛокаций.ЖДСтанция.ЖелезнаяДорога, &ЖелезнаяДорогаПустаяСсылка) <> &ЖелезнаяДорогаПустаяСсылка";
//		
//		Запрос.УстановитьПараметр("ЖелезнаяДорогаПустаяСсылка", Справочники.ЖелезныеДороги.ПустаяСсылка());
//		Запрос.УстановитьПараметр("Терминал", Терминал);
//		
//		Выборка = Запрос.Выполнить().Выбрать();
//		КоличествоДорог = Выборка.Количество();
//		Если КоличествоДорог = 1 Тогда
//			Выборка.Следующий();
//			ЖелезнаяДорога = Выборка.ЖелезнаяДорога;
//		ИначеЕсли КоличествоДорог = 0 Тогда
//			Получить
//			Если КоличествоДорог = 1 Тогда
//				Выборка.Следующий();
//				ЖелезнаяДорога = Выборка.ЖелезнаяДорога;
//			КонецЕсли;
//		КонецЕсли;
//			
//	КонецЕсли;
//	
//	Возврат ЖелезнаяДорога;
//	
//КонецФункции

&НаКлиенте
Процедура УслугиЛокацияОказанияУслугиПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиЛокацияОказанияУслугиПриИзмененииНаСервере(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиВагонОпределенногоСобственникаПриИзменении(Элемент)
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиВидОтправкиПриИзменении(Элемент)
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиВидыОтправокСтрокойНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Модифицированность = Истина;
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	
	ДоступныеЗначения = ПолучитьВидыОтправок();
	ВыбираемыеЗначения = Новый СписокЗначений;
	ВыбираемыеЗначения.ЗагрузитьЗначения(ДоступныеЗначения);
		
	Для Каждого ЭлементСписка Из ВыбираемыеЗначения Цикл
		ВыбранныйЭлемент = ТекДанные.ВидыОтправок.НайтиПоЗначению(ЭлементСписка.Значение);
		Если ВыбранныйЭлемент <> Неопределено Тогда
			ЭлементСписка.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;	
	ПараметрыФормы.Вставить("ТекущийСписок", ВыбираемыеЗначения);
	ПараметрыФормы.Вставить("ПоказыватьПометку", Истина);
	ПараметрыФормы.Вставить("ИзменятьСоставСтрок", Ложь);
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ИдентификаторСтроки", ТекСтрока);
	
	ОповещениеОЗакрытииФормыСписка = Новый ОписаниеОповещения("ПриЗакрытииФормыРедактированияСпискаВидовОтправок", ЭтаФорма, ПараметрыОповещения);	
	ОткрытьФорму("ОбщаяФорма.ФормаРедактированияСпискаЗначений", ПараметрыФормы, Этаформа,,,, ОповещениеОЗакрытииФормыСписка, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыРедактированияСпискаВидовОтправок(СписокВидовОтправок, ДополнительныеПараметры) Экспорт
	
	Если СписокВидовОтправок <> Неопределено Тогда
		
		ТекСтрока = ДополнительныеПараметры.ИдентификаторСтроки;
		ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
		ТекДанные.ВидыОтправок.Очистить();		
		
		Для Каждого ЭлементСписка Из СписокВидовОтправок Цикл
			Если ЭлементСписка.Пометка Тогда
				ТекДанные.ВидыОтправок.Добавить(ЭлементСписка.Значение);
			КонецЕсли;
		КонецЦикла;
		
		УслугиВидыОтправокПриИзмененииСервер(ТекСтрока);
	
		Если ЗаполнятьВниз Тогда
			ВыполнитьЗаполнениеВниз();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиВидыОтправокПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиВидыОтправокПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиВидыОтправокПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ОбработатьИзменениеВидовОтправокСтрокиУслуг(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеВидовОтправокСтрокиУслуг(ТекДанные)
	
	ТекДанные.ВидыОтправокСтрокой = СтрСоединить(ТекДанные.ВидыОтправок.ВыгрузитьЗначения(), "; ");
	//СформироватьСтрокиКритериевПоТипоразмерамКТКСтрокиТаблицыУслуг(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиВидыОтправокСтрокойОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	
	ТекДанные.ВидыОтправок.Очистить();
	
	УслугиВидыОтправокПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		ТекДанные = Элементы.Услуги.ТекущиеДанные;
		ИдентификаторКопируемойСтрокиУслуг = ТекДанные.ИдентификаторСтрокиУслуг;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиТипоразмерыВагоновПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиТипоразмерыВагоновПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиТипоразмерыВагоновПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ОбработатьИзменениеТипоразмеровВагоновСтрокиУслуг(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеТипоразмеровВагоновСтрокиУслуг(ТекДанные)
	
	Типоразмеры = ТекДанные.ТипоразмерыВагонов.ВыгрузитьЗначения();
	КодыТипоразмеров = ПолучитьКодыТипоразмеровВагонов(Типоразмеры);
	ТекДанные.ТипоразмерыВагоновСтрокой = СтрСоединить(КодыТипоразмеров, "; ");
	//СформироватьСтрокиКритериевПоТипоразмерамКТКСтрокиТаблицыУслуг(ТекДанные);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКодыТипоразмеровВагонов(ТипоразмерыВагонов)
	
	Запрос = Новый Запрос;
	
	//ТаблицаТипоразмеров = Новый ТаблицаЗначений;
	//ТаблицаТипоразмеров.Колонки.Добавить("ИндексСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
	//ТаблицаТипоразмеров.Колонки.Добавить("Типоразмер", Новый ОписаниеТипов("СправочникСсылка.ТипоразмерыТС"));
	//
	//Для Индекс = 0 По ТипоразмерыВагонов.Количество() - 1 Цикл
	//	НСтр = ТаблицаТипоразмеров.Добавить();
	//	НСтр.ИндексСтроки = Индекс;
	//	НСтр.Типоразмер = ТипоразмерыВагонов[Индекс];
	//КонецЦикла;
	Запрос.УстановитьПараметр("Типоразмеры", ТипоразмерыВагонов);	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТипоразмерыТС.Код КАК Код
	|ИЗ
	|	Справочник.ТипоразмерыТС КАК ТипоразмерыТС
	|ГДЕ
	|	ТипоразмерыТС.Ссылка В(&Типоразмеры)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Код");
	
КонецФункции

&НаКлиенте
Процедура УслугиТипоразмерыВагоновСтрокойНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Модифицированность = Истина;
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	
	ОписаниеПоля = ПараметрыВидаУслуг.ПоляТаблицыУслуг.Получить("ТипоразмерыВагоновСтрокой");
	Если ОписаниеПоля <> Неопределено И ЗначениеЗаполнено(ОписаниеПоля.СписокВыбора) Тогда
		Типоразмеры = ОписаниеПоля.СписокВыбора.ВыгрузитьЗначения();
		СписокТипоразмеров = Новый СписокЗначений;
		СписокТипоразмеров.ЗагрузитьЗначения(Типоразмеры);
	Иначе
		Типоразмеры = ПолучитьТипоразмерыВагонов();
		СписокТипоразмеров = Новый СписокЗначений;
		СписокТипоразмеров.ЗагрузитьЗначения(Типоразмеры);
	КонецЕсли;
	
	Для Каждого ЭлементСписка Из СписокТипоразмеров Цикл
		ВыбранныйЭлемент = ТекДанные.ТипоразмерыВагонов.НайтиПоЗначению(ЭлементСписка.Значение);
		Если ВыбранныйЭлемент <> Неопределено Тогда
			ЭлементСписка.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;	
	ПараметрыФормы.Вставить("ТекущийСписок", СписокТипоразмеров);
	ПараметрыФормы.Вставить("ПоказыватьПометку", Истина);
	ПараметрыФормы.Вставить("ИзменятьСоставСтрок", Ложь);
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ИдентификаторСтроки", ТекСтрока);
	
	ОповещениеОЗакрытииФормыСписка = Новый ОписаниеОповещения("ПриЗакрытииФормыРедактированияСпискаТипоразмеровВагонов", ЭтаФорма, ПараметрыОповещения);	
	ОткрытьФорму("ОбщаяФорма.ФормаРедактированияСпискаЗначений", ПараметрыФормы, Этаформа,,,, ОповещениеОЗакрытииФормыСписка, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыРедактированияСпискаТипоразмеровВагонов(СписокТипоразмеров, ДополнительныеПараметры) Экспорт
	
	Если СписокТипоразмеров <> Неопределено Тогда
		
		ТекСтрока = ДополнительныеПараметры.ИдентификаторСтроки;
		ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
		ТекДанные.ТипоразмерыВагонов.Очистить();		
		
		Для Каждого ЭлементСписка Из СписокТипоразмеров Цикл
			Если ЭлементСписка.Пометка Тогда
				ТекДанные.ТипоразмерыВагонов.Добавить(ЭлементСписка.Значение);
			КонецЕсли;
		КонецЦикла;
		
		УслугиТипоразмерыВагоновПриИзмененииСервер(ТекСтрока);
	
		Если ЗаполнятьВниз Тогда
			ВыполнитьЗаполнениеВниз();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиТипоразмерыВагоновСтрокойОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	
	ТекДанные.ТипоразмерыВагонов.Очистить();
	
	УслугиТипоразмерыВагоновПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Коханенко Н.А. 27.03.2025 (( #102319
&НаСервере
Процедура УстановитьВидимостьКомандПечати();
	
	Если Объект.Типовой
			И Объект.ВидУслугПоставщика = ПредопределенноеЗначение("Справочник.ВидыУслугПоставщиков.Автоперевозки") Тогда
		Элементы.ПодменюПечатьОбычное_ПСЦПоставщика.Видимость = Ложь;
		Элементы.ПодменюПечатьОбычное_ПСЦПоставщикаФаксимиле.Видимость = Ложь;
		Элементы.ПодменюПечатьОбычное_ПСЦПоставщикаАвтоперевозки.Видимость = Истина;
		Элементы.ПодменюПечатьОбычное_ПСЦПоставщикаАвтоперевозкиТерминалы.Видимость = Истина;
	Иначе
		Элементы.ПодменюПечатьОбычное_ПСЦПоставщика.Видимость = Истина;
		Элементы.ПодменюПечатьОбычное_ПСЦПоставщикаФаксимиле.Видимость = Истина;
		Элементы.ПодменюПечатьОбычное_ПСЦПоставщикаАвтоперевозки.Видимость = Ложь;
		Элементы.ПодменюПечатьОбычное_ПСЦПоставщикаАвтоперевозкиТерминалы.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры//Евросиб Коханенко Н.А. 27.03.2025 )) #102319 

&НаКлиенте
Процедура УслугиТипоразмерВагонаПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	
	ТекДанные.ТипоразмерыВагонов.Очистить();	
	Если ЗначениеЗаполнено(ТекДанные.ТипоразмерВагона) Тогда
		ТекДанные.ТипоразмерыВагонов.Добавить(ТекДанные.ТипоразмерВагона);
	КонецЕсли;
	
	УслугиТипоразмерыВагоновПриИзмененииСервер(ТекСтрока);

	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз();
	КонецЕсли;		
	
КонецПроцедуры

//Евросиб Коханенко Н.А. 28.04.2025 (( #102319 
&НаКлиенте
Процедура ЗаблокироватьПоляФормы(Блокировать = Истина);
	
	Элементы.ГруппаШапка.ТолькоПросмотр = Истина;
	Элементы.ГруппаПараметрыПротокола.ТолькоПросмотр = Истина;
	Элементы.ГруппаДополнительно.ТолькоПросмотр = Истина;
	Элементы.Группа1.Доступность = Ложь; //галки "Заполнять нормативы" и "Заполнять вниз"
		
	МассивДоступныхЭлементов = Новый Массив;
	//колонки ТЧ Услуги 
	МассивДоступныхЭлементов.Добавить("УслугиНаименованиеНоменклатурыПоставщика");
	МассивДоступныхЭлементов.Добавить("УслугиЕдиницаИзмерения"); 
	МассивДоступныхЭлементов.Добавить("УслугиГруппаОпасныйГруз"); //Опасный/Спец.груз, Стандарт опасности груза, Класс опасности груза 
	МассивДоступныхЭлементов.Добавить("УслугиКомментарий");
	//Требуется детализация комплексной ставки (таблица с детализацией тоже доступна для редактирования
	МассивДоступныхЭлементов.Добавить("УслугиДетализацияКомплекснойСтавки");
	МассивДоступныхЭлементов.Добавить("ГруппаВкладкаДетализацияКомплекснойСтавки");
	//Номера КТК (таблица с детализацией тоже доступна для редактирования)
	МассивДоступныхЭлементов.Добавить("УслугиДетализацияПоНомерамКТКВагонов");
	МассивДоступныхЭлементов.Добавить("ГруппаВкладкаДетализацияПоУчетнымЕдиницам");
	//Ввод КТК

	Для Каждого Элемент Из Элементы.Услуги.ПодчиненныеЭлементы Цикл
		Если МассивДоступныхЭлементов.Найти(Элемент.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		//Элемент.Доступность = Ложь; 
		Элемент.ТолькоПросмотр = Истина; 
		
	КонецЦикла;

КонецПроцедуры //Евросиб Коханенко Н.А. 28.04.2025 )) #102319

&НаКлиенте
Процедура ДетализацияКомплекснойСтавкиПриИзменении(Элемент)
	
	ТекДанныеУслуги = Элементы.Услуги.ТекущиеДанные;
	РассчитатьСуммуПоСтрокамДетализацииКомплекснойСтавки(ТекДанныеУслуги);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьДанныеПоКонтейнерамВагонам(Команда)
	
	Элементы.УслугиПоказыватьДанныеПоКонтейнерамВагонам.Пометка = Не Элементы.УслугиПоказыватьДанныеПоКонтейнерамВагонам.Пометка;
	Элементы.УслугиГруппаДанныеПоКонтейнерамВагонам.Видимость = Элементы.УслугиПоказыватьДанныеПоКонтейнерамВагонам.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСостоянияГруженыйПорожнийПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиСостоянияГруженыйПорожнийПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиСостоянияГруженыйПорожнийПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ОбработатьИзменениеСостоянияГруженыйПорожнийСтрокиУслуг(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеСостоянияГруженыйПорожнийСтрокиУслуг(ТекДанные)
	
	ТекДанные.СостоянияГруженыйПорожнийСтрокой = СтрСоединить(ТекДанные.СостоянияГруженыйПорожний.ВыгрузитьЗначения(), "; ");
	
	СостояниеГруженый = Перечисления.СостоянияКТК.Груженый;
	СостояниеПорожний = Перечисления.СостоянияКТК.Порожний;
	
	ДляГруженых = Ложь;
	ДляПорожних = Ложь;
	
	Для Каждого Стр Из ТекДанные.СостоянияГруженыйПорожний Цикл
		Если Стр.Значение = СостояниеГруженый Тогда
			ДляГруженых = Истина;
		ИначеЕсли Стр.Значение = СостояниеПорожний Тогда
			ДляПорожних = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ТекДанные.ДляГруженых = ДляГруженых;
	ТекДанные.ДляПорожних = ДляПорожних;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСостоянияГруженыйПорожнийСтрокойНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Модифицированность = Истина;
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	
	СписокСостояний = Новый СписокЗначений;
	ЭлементСписка = СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияКТК.Груженый"));
	Если ТекДанные.ДляГруженых Тогда
		ЭлементСписка.Пометка = Истина;
	КонецЕсли;
	
	ЭлементСписка = СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияКТК.Порожний"));
	Если ТекДанные.ДляПорожних Тогда
		ЭлементСписка.Пометка = Истина;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;	
	ПараметрыФормы.Вставить("ТекущийСписок", СписокСостояний);
	ПараметрыФормы.Вставить("ПоказыватьПометку", Истина);
	ПараметрыФормы.Вставить("ИзменятьСоставСтрок", Ложь);
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ИдентификаторСтроки", ТекСтрока);
	
	ОповещениеОЗакрытииФормыСписка = Новый ОписаниеОповещения("ПриЗакрытииФормыРедактированияСпискаСостоянийГруженыйПорожний", ЭтаФорма, ПараметрыОповещения);	
	ОткрытьФорму("ОбщаяФорма.ФормаРедактированияСпискаЗначений", ПараметрыФормы, Этаформа,,,, ОповещениеОЗакрытииФормыСписка, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыРедактированияСпискаСостоянийГруженыйПорожний(СписокСостояний, ДополнительныеПараметры) Экспорт
	
	Если СписокСостояний <> Неопределено Тогда
		
		ТекСтрока = ДополнительныеПараметры.ИдентификаторСтроки;
		ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
		ТекДанные.СостоянияГруженыйПорожний.Очистить();		
		
		Для Каждого ЭлементСписка Из СписокСостояний Цикл
			Если ЭлементСписка.Пометка Тогда
				ТекДанные.СостоянияГруженыйПорожний.Добавить(ЭлементСписка.Значение);
			КонецЕсли;
		КонецЦикла;
		
		УслугиСостоянияГруженыйПорожнийПриИзмененииСервер(ТекСтрока);
	
		Если ЗаполнятьВниз Тогда
			ВыполнитьЗаполнениеВниз();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСостоянияГруженыйПорожнийСтрокойОчистка(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	
	ТекДанные.СостоянияГруженыйПорожний.Очистить();
	
	УслугиСостоянияГруженыйПорожнийПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодобратьПеревалки() //Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	
	ТаблицаДляОпределенияПеревалкиПоПриему = Объект.Услуги.Выгрузить(,"ИдентификаторСтрокиУслуг,ПеревалкаПоПриемуАвто,ПеревалкаПоПриемуМоре,ПеревалкаПоПриемуСклад,ПеревалкаПоПриемуЖД");
	ТаблицаДляОпределенияПеревалкиПоОтправлению = Объект.Услуги.Выгрузить(,"ИдентификаторСтрокиУслуг,ПеревалкаПоОтправлениюАвто,ПеревалкаПоОтправлениюМоре,ПеревалкаПоОтправлениюСклад,ПеревалкаПоОтправлениюЖД");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТУслуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
		|	ВТУслуги.ПеревалкаПоПриемуАвто КАК ПеревалкаПоПриемуАвто,
		|	ВТУслуги.ПеревалкаПоПриемуМоре КАК ПеревалкаПоПриемуМоре,
		|	ВТУслуги.ПеревалкаПоПриемуСклад КАК ПеревалкаПоПриемуСклад,
		|	ВТУслуги.ПеревалкаПоПриемуЖД КАК ПеревалкаПоПриемуЖД
		|ПОМЕСТИТЬ ВТ_Услуги
		|ИЗ
		|	&ВТУслуги КАК ВТУслуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыПеревалкиЭтапыПеревалки.Ссылка КАК Ссылка,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ВидыПеревалкиЭтапыПеревалки.НомерСтроки = 1
		|				ТОГДА ВидыПеревалкиЭтапыПеревалки.ТипЭтапа
		|			ИНАЧЕ ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.ТипыЭтаповПеревалки.ПустаяСсылка)
		|		КОНЕЦ) КАК ПеревалкаПоПриемуАвто,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ВидыПеревалкиЭтапыПеревалки.НомерСтроки = 2
		|				ТОГДА ВидыПеревалкиЭтапыПеревалки.ТипЭтапа
		|			ИНАЧЕ ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.ТипыЭтаповПеревалки.ПустаяСсылка)
		|		КОНЕЦ) КАК ПеревалкаПоПриемуМоре,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ВидыПеревалкиЭтапыПеревалки.НомерСтроки = 3
		|				ТОГДА ВидыПеревалкиЭтапыПеревалки.ТипЭтапа
		|			ИНАЧЕ ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.ТипыЭтаповПеревалки.ПустаяСсылка)
		|		КОНЕЦ) КАК ПеревалкаПоПриемуСклад,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ВидыПеревалкиЭтапыПеревалки.НомерСтроки = 4
		|				ТОГДА ВидыПеревалкиЭтапыПеревалки.ТипЭтапа
		|			ИНАЧЕ ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.ТипыЭтаповПеревалки.ПустаяСсылка)
		|		КОНЕЦ) КАК ПеревалкаПоПриемуЖД
		|ПОМЕСТИТЬ ВТ_Перевалки
		|ИЗ
		|	Справочник.ВидыПеревалки.ЭтапыПеревалки КАК ВидыПеревалкиЭтапыПеревалки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВидыПеревалкиЭтапыПеревалки.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
		|	ВТ_Перевалки.Ссылка КАК Перевалка,
		|	ВТ_Услуги.ПеревалкаПоПриемуАвто КАК ПеревалкаПоПриемуАвто,
		|	ВТ_Услуги.ПеревалкаПоПриемуМоре КАК ПеревалкаПоПриемуМоре,
		|	ВТ_Услуги.ПеревалкаПоПриемуСклад КАК ПеревалкаПоПриемуСклад,
		|	ВТ_Услуги.ПеревалкаПоПриемуЖД КАК ПеревалкаПоПриемуЖД
		|ИЗ
		|	ВТ_Услуги КАК ВТ_Услуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Перевалки КАК ВТ_Перевалки
		|		ПО ВТ_Услуги.ПеревалкаПоПриемуАвто = ВТ_Перевалки.ПеревалкаПоПриемуАвто
		|			И ВТ_Услуги.ПеревалкаПоПриемуМоре = ВТ_Перевалки.ПеревалкаПоПриемуМоре
		|			И ВТ_Услуги.ПеревалкаПоПриемуСклад = ВТ_Перевалки.ПеревалкаПоПриемуСклад
		|			И ВТ_Услуги.ПеревалкаПоПриемуЖД = ВТ_Перевалки.ПеревалкаПоПриемуЖД";
	Запрос.УстановитьПараметр("ВТУслуги",ТаблицаДляОпределенияПеревалкиПоПриему);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Перевалка) Тогда
			сПоиска = Новый Структура("ИдентификаторСтрокиУслуг",ВыборкаДетальныеЗаписи.ИдентификаторСтрокиУслуг);
			НайденныеСтроки = Объект.Услуги.НайтиСтроки(сПоиска);
			Для Каждого нСтрока Из НайденныеСтроки Цикл
				нСтрока.ПеревалкаПоПриему = ВыборкаДетальныеЗаписи.Перевалка;
			КонецЦикла;
		Иначе
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПеревалкаПоПриемуАвто) ИЛИ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПеревалкаПоПриемуМоре) ИЛИ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПеревалкаПоПриемуСклад) ИЛИ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПеревалкаПоПриемуЖД) Тогда
				эПеревалка = Справочники.ВидыПеревалки.СоздатьЭлемент();
				НовСтрока = эПеревалка.ЭтапыПеревалки.Добавить();
				НовСтрока.ТипЭтапа = ВыборкаДетальныеЗаписи.ПеревалкаПоПриемуАвто;
				НовСтрока = эПеревалка.ЭтапыПеревалки.Добавить();
				НовСтрока.ТипЭтапа = ВыборкаДетальныеЗаписи.ПеревалкаПоПриемуМоре;
				НовСтрока = эПеревалка.ЭтапыПеревалки.Добавить();
				НовСтрока.ТипЭтапа = ВыборкаДетальныеЗаписи.ПеревалкаПоПриемуСклад;
				НовСтрока = эПеревалка.ЭтапыПеревалки.Добавить();
				НовСтрока.ТипЭтапа = ВыборкаДетальныеЗаписи.ПеревалкаПоПриемуЖД;
				эПеревалка.Наименование = Строка(ВыборкаДетальныеЗаписи.ПеревалкаПоПриемуАвто) + ";" + Строка(ВыборкаДетальныеЗаписи.ПеревалкаПоПриемуМоре) + ";" + Строка(ВыборкаДетальныеЗаписи.ПеревалкаПоПриемуСклад) + "; " + Строка(ВыборкаДетальныеЗаписи.ПеревалкаПоПриемуЖД); 
				эПеревалка.Записать();
				сПоиска = Новый Структура("ИдентификаторСтрокиУслуг",ВыборкаДетальныеЗаписи.ИдентификаторСтрокиУслуг);
				НайденныеСтроки = Объект.Услуги.НайтиСтроки(сПоиска);
				Для Каждого нСтрока Из НайденныеСтроки Цикл
					нСтрока.ПеревалкаПоПриему = эПеревалка.Ссылка;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТУслуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
		|	ВТУслуги.ПеревалкаПоОтправлениюАвто КАК ПеревалкаПоОтправлениюАвто,
		|	ВТУслуги.ПеревалкаПоОтправлениюМоре КАК ПеревалкаПоОтправлениюМоре,
		|	ВТУслуги.ПеревалкаПоОтправлениюСклад КАК ПеревалкаПоОтправлениюСклад,
		|	ВТУслуги.ПеревалкаПоОтправлениюЖД КАК ПеревалкаПоОтправлениюЖД
		|ПОМЕСТИТЬ ВТ_Услуги
		|ИЗ
		|	&ВТУслуги КАК ВТУслуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыПеревалкиЭтапыПеревалки.Ссылка КАК Ссылка,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ВидыПеревалкиЭтапыПеревалки.НомерСтроки = 1
		|				ТОГДА ВидыПеревалкиЭтапыПеревалки.ТипЭтапа
		|			ИНАЧЕ ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.ТипыЭтаповПеревалки.ПустаяСсылка)
		|		КОНЕЦ) КАК ПеревалкаПоОтправлениюАвто,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ВидыПеревалкиЭтапыПеревалки.НомерСтроки = 2
		|				ТОГДА ВидыПеревалкиЭтапыПеревалки.ТипЭтапа
		|			ИНАЧЕ ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.ТипыЭтаповПеревалки.ПустаяСсылка)
		|		КОНЕЦ) КАК ПеревалкаПоОтправлениюМоре,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ВидыПеревалкиЭтапыПеревалки.НомерСтроки = 3
		|				ТОГДА ВидыПеревалкиЭтапыПеревалки.ТипЭтапа
		|			ИНАЧЕ ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.ТипыЭтаповПеревалки.ПустаяСсылка)
		|		КОНЕЦ) КАК ПеревалкаПоОтправлениюСклад,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ВидыПеревалкиЭтапыПеревалки.НомерСтроки = 4
		|				ТОГДА ВидыПеревалкиЭтапыПеревалки.ТипЭтапа
		|			ИНАЧЕ ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.ТипыЭтаповПеревалки.ПустаяСсылка)
		|		КОНЕЦ) КАК ПеревалкаПоОтправлениюЖД
		|ПОМЕСТИТЬ ВТ_Перевалки
		|ИЗ
		|	Справочник.ВидыПеревалки.ЭтапыПеревалки КАК ВидыПеревалкиЭтапыПеревалки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВидыПеревалкиЭтапыПеревалки.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
		|	ВТ_Перевалки.Ссылка КАК Перевалка,
		|	ВТ_Услуги.ПеревалкаПоОтправлениюАвто КАК ПеревалкаПоОтправлениюАвто,
		|	ВТ_Услуги.ПеревалкаПоОтправлениюМоре КАК ПеревалкаПоОтправлениюМоре,
		|	ВТ_Услуги.ПеревалкаПоОтправлениюСклад КАК ПеревалкаПоОтправлениюСклад,
		|	ВТ_Услуги.ПеревалкаПоОтправлениюЖД КАК ПеревалкаПоОтправлениюЖД
		|ИЗ
		|	ВТ_Услуги КАК ВТ_Услуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Перевалки КАК ВТ_Перевалки
		|		ПО ВТ_Услуги.ПеревалкаПоОтправлениюАвто = ВТ_Перевалки.ПеревалкаПоОтправлениюАвто
		|			И ВТ_Услуги.ПеревалкаПоОтправлениюМоре = ВТ_Перевалки.ПеревалкаПоОтправлениюМоре
		|			И ВТ_Услуги.ПеревалкаПоОтправлениюСклад = ВТ_Перевалки.ПеревалкаПоОтправлениюСклад
		|			И ВТ_Услуги.ПеревалкаПоОтправлениюЖД = ВТ_Перевалки.ПеревалкаПоОтправлениюЖД";
	Запрос.УстановитьПараметр("ВТУслуги",ТаблицаДляОпределенияПеревалкиПоОтправлению);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Перевалка) Тогда
			сПоиска = Новый Структура("ИдентификаторСтрокиУслуг",ВыборкаДетальныеЗаписи.ИдентификаторСтрокиУслуг);
			НайденныеСтроки = Объект.Услуги.НайтиСтроки(сПоиска);
			Для Каждого нСтрока Из НайденныеСтроки Цикл
				нСтрока.ПеревалкаПоОтправлению = ВыборкаДетальныеЗаписи.Перевалка;
			КонецЦикла;
		Иначе
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПеревалкаПоОтправлениюАвто) ИЛИ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПеревалкаПоОтправлениюМоре) ИЛИ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПеревалкаПоОтправлениюСклад) ИЛИ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПеревалкаПоОтправлениюЖД) Тогда
				эПеревалка = Справочники.ВидыПеревалки.СоздатьЭлемент();
				НовСтрока = эПеревалка.ЭтапыПеревалки.Добавить();
				НовСтрока.ТипЭтапа = ВыборкаДетальныеЗаписи.ПеревалкаПоОтправлениюАвто;
				НовСтрока = эПеревалка.ЭтапыПеревалки.Добавить();
				НовСтрока.ТипЭтапа = ВыборкаДетальныеЗаписи.ПеревалкаПоОтправлениюМоре;
				НовСтрока = эПеревалка.ЭтапыПеревалки.Добавить();
				НовСтрока.ТипЭтапа = ВыборкаДетальныеЗаписи.ПеревалкаПоОтправлениюСклад;
				НовСтрока = эПеревалка.ЭтапыПеревалки.Добавить();
				НовСтрока.ТипЭтапа = ВыборкаДетальныеЗаписи.ПеревалкаПоОтправлениюЖД;
				эПеревалка.Наименование = Строка(ВыборкаДетальныеЗаписи.ПеревалкаПоОтправлениюАвто) + ";" + Строка(ВыборкаДетальныеЗаписи.ПеревалкаПоОтправлениюМоре) + ";" + Строка(ВыборкаДетальныеЗаписи.ПеревалкаПоОтправлениюСклад) + "; " + Строка(ВыборкаДетальныеЗаписи.ПеревалкаПоОтправлениюЖД); 
				эПеревалка.Записать();
				сПоиска = Новый Структура("ИдентификаторСтрокиУслуг",ВыборкаДетальныеЗаписи.ИдентификаторСтрокиУслуг);
				НайденныеСтроки = Объект.Услуги.НайтиСтроки(сПоиска);
				Для Каждого нСтрока Из НайденныеСтроки Цикл
					нСтрока.ПеревалкаПоОтправлению = эПеревалка.Ссылка;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры	

//Евросиб Шевченко А.В. US 110215 TA 120129 06.10.2025

&НаКлиенте
Процедура УслугиКодТНВЭДНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.ГрузыПоТНВЭД.ФормаВыбора",, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура УслугиКодТНВЭДОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	ВыбранноеЗначение = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "ТНВЭД");
КонецПроцедуры

&НаКлиенте
Процедура УслугиКодТНВЭДАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ТекстДляПоиска = СокрЛП(Текст);
	Если СтрДлина(ТекстДляПоиска) > 2 Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = ПолучитьЭлементыТНВЭДпоЧастиКода(ТекстДляПоиска);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЭлементыТНВЭДпоЧастиКода(Текст)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГрузыПоТНВЭД.Ссылка КАК Ссылка,
	|	ГрузыПоТНВЭД.ТНВЭД КАК Код,
	|	ГрузыПоТНВЭД.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ГрузыПоТНВЭД КАК ГрузыПоТНВЭД
	|ГДЕ
	|	ГрузыПоТНВЭД.ТНВЭД ПОДОБНО &Текст
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	Запрос.УстановитьПараметр("Текст", "%" + Текст + "%");
	
	СписокЭлементов = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокЭлементов.Добавить(Выборка.Ссылка, СтрШаблон("%1 (%2)", Выборка.Наименование, Выборка.Код));
	КонецЦикла;
	
	Возврат СписокЭлементов;
	
КонецФункции

&НаКлиенте
Процедура УслугиКодТНВЭДОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Текст) Тогда		
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиРейсМореПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьДанныеЛинии(Команда)
	Элементы.УслугиПоказыватьДанныеЛинии.Пометка = Не Элементы.УслугиПоказыватьДанныеЛинии.Пометка;
	Элементы.УслугиГруппаДанныеЛинии.Видимость = Элементы.УслугиПоказыватьДанныеЛинии.Пометка;
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьУсловияПеревозки(Команда)
	Элементы.УслугиПоказыватьУсловияПеревозки.Пометка = Не Элементы.УслугиПоказыватьУсловияПеревозки.Пометка;
	Элементы.УслугиГруппаУсловияПеревозкиОсновная.Видимость = Элементы.УслугиПоказыватьУсловияПеревозки.Пометка;
КонецПроцедуры

&НаКлиенте
Процедура УслугиБондоваяЗонаПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиУсловияИнкотермсПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтанцииПогранпереходовНазначениеПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтанцииПогранпереходовОтправленияПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиТерминалОтправленияПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиТерминалНазначенияПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиВидТранспортаПриИзменении(Элемент)
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиСвободныйПериодХраненияВагПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиСвободныйПериодХраненияПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиСвободныйПериодХраненияКТКПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	УслугиСвободныйПериодХраненияПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьПортыИЖДСтанции(СтрокиУслуг = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
	|	Услуги.ПунктОтправления КАК ПунктОтправления,
	|	Услуги.ПунктНазначения КАК ПунктНазначения	
	|ПОМЕСТИТЬ Услуги
	|ИЗ
	|	&Услуги КАК Услуги
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГоризонтальныеСвязиЛокаций.Терминал КАК Локация,
	|	ГоризонтальныеСвязиЛокаций.ЖДСтанция КАК ПортЖДСтанция
	|ИЗ
	|	РегистрСведений.ГоризонтальныеСвязиЛокаций КАК ГоризонтальныеСвязиЛокаций
	|ГДЕ
	|	ГоризонтальныеСвязиЛокаций.ЖДСтанция В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ Услуги.ПунктОтправления КАК Пункт ИЗ Услуги КАК Услуги ОБЪЕДИНИТЬ ВЫБРАТЬ Услуги.ПунктНазначения ИЗ Услуги КАК Услуги)
	|	И ГоризонтальныеСвязиЛокаций.Терминал <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|	И ГоризонтальныеСвязиЛокаций.ЖДСтанция <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГоризонтальныеСвязиЛокаций.Терминал,
	|	ГоризонтальныеСвязиЛокаций.Порт
	|ИЗ
	|	РегистрСведений.ГоризонтальныеСвязиЛокаций КАК ГоризонтальныеСвязиЛокаций
	|ГДЕ
	|	ГоризонтальныеСвязиЛокаций.Порт В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ Услуги.ПунктОтправления КАК Пункт ИЗ Услуги КАК Услуги ОБЪЕДИНИТЬ ВЫБРАТЬ Услуги.ПунктНазначения ИЗ Услуги КАК Услуги)
	|	И ГоризонтальныеСвязиЛокаций.Порт <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|	И ГоризонтальныеСвязиЛокаций.Терминал <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)";
	
	Если СтрокиУслуг <> Неопределено Тогда
		//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
		СтрокиУслуг = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокиУслуг);
		ТаблицаУслуг = Объект.Услуги.Выгрузить(СтрокиУслуг, "ПунктОтправления, ПунктНазначения");
		Услуги = СтрокиУслуг;
	Иначе
		//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
		ТаблицаУслуг = Объект.Услуги.Выгрузить(, "ПунктОтправления, ПунктНазначения");
		Услуги = Объект.Услуги;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Услуги", ТаблицаУслуг);
	
	ТерминалыПортыЖДСтанции = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаУслуги Из Услуги Цикл
		
		СтрокаУслуги.ТерминалОтправления = Справочники.Локации.ПустаяСсылка();
		СтрокаУслуги.ТерминалНазначения = Справочники.Локации.ПустаяСсылка();
		//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
		Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.ТЭО Тогда
			Если ЗначениеЗаполнено(СтрокаУслуги.ПунктОтправления) Тогда
				Если ТипЗнч(СтрокаУслуги.ПунктОтправления) = Тип("СправочникСсылка.Локации") Тогда
					Если СтрокаУслуги.ПунктОтправления.Тип = Справочники.ТипыЛокаций.Порт ИЛИ СтрокаУслуги.ПунктОтправления.Тип = Справочники.ТипыЛокаций.СтанцияЖД Тогда
						Терминал = ТерминалыПортыЖДСтанции.Скопировать(Новый Структура("ПортЖДСтанция", СтрокаУслуги.ПунктОтправления), "Локация");
						Терминал = Терминал.ВыгрузитьКолонку("Локация");
						Если Терминал.Количество() Тогда
							СтрокаУслуги.ТерминалОтправления = Терминал[0];
							
						КонецЕсли;
					КонецЕсли;	
				КонецЕсли;
				
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаУслуги.ПунктНазначения) Тогда
				Если ТипЗнч(СтрокаУслуги.ПунктНазначения) = Тип("СправочникСсылка.Локации") Тогда
					Если СтрокаУслуги.ПунктНазначения.Тип = Справочники.ТипыЛокаций.Порт ИЛИ СтрокаУслуги.ПунктНазначения.Тип = Справочники.ТипыЛокаций.СтанцияЖД Тогда
						Терминал = ТерминалыПортыЖДСтанции.Скопировать(Новый Структура("ПортЖДСтанция", СтрокаУслуги.ПунктНазначения), "Локация");
						Терминал = Терминал.ВыгрузитьКолонку("Локация");
						Если Терминал.Количество() Тогда
							СтрокаУслуги.ТерминалНазначения = Терминал[0];
							
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
	КонецЦикла;	
	
КонецПроцедуры	

Функция ПолучитьТерминалОтправленияНазначения(Пункт)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГоризонтальныеСвязиЛокаций.Терминал КАК Локация,
	|	ГоризонтальныеСвязиЛокаций.ЖДСтанция КАК ПортЖДСтанция
	|ИЗ
	|	РегистрСведений.ГоризонтальныеСвязиЛокаций КАК ГоризонтальныеСвязиЛокаций
	|ГДЕ
	|	ГоризонтальныеСвязиЛокаций.ЖДСтанция = &Пункт		
	|	И ГоризонтальныеСвязиЛокаций.Терминал <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|	И ГоризонтальныеСвязиЛокаций.ЖДСтанция <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГоризонтальныеСвязиЛокаций.Терминал,
	|	ГоризонтальныеСвязиЛокаций.Порт
	|ИЗ
	|	РегистрСведений.ГоризонтальныеСвязиЛокаций КАК ГоризонтальныеСвязиЛокаций
	|ГДЕ
	|	ГоризонтальныеСвязиЛокаций.Порт = &Пункт
	|	И ГоризонтальныеСвязиЛокаций.Порт <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|	И ГоризонтальныеСвязиЛокаций.Терминал <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)";

	
	Запрос.УстановитьПараметр("Пункт", Пункт);
	
	ТерминалыПортыЖДСтанции = Запрос.Выполнить().Выгрузить();
	
	Если ТипЗнч(Пункт) = Тип("СправочникСсылка.Локации") Тогда
		Если Пункт.Тип = Справочники.ТипыЛокаций.Порт ИЛИ Пункт.Тип = Справочники.ТипыЛокаций.СтанцияЖД Тогда
			Терминал = ТерминалыПортыЖДСтанции.Скопировать(Новый Структура("ПортЖДСтанция", Пункт), "Локация");
			Терминал = Терминал.ВыгрузитьКолонку("Локация");
			Если Терминал.Количество() Тогда
				Возврат Терминал[0];
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	Если ТипЗнч(Пункт) = Тип("СправочникСсылка.Локации") Тогда
		Если Пункт.Тип = Справочники.ТипыЛокаций.Порт ИЛИ Пункт.Тип = Справочники.ТипыЛокаций.СтанцияЖД Тогда
			Терминал = ТерминалыПортыЖДСтанции.Скопировать(Новый Структура("ПортЖДСтанция", Пункт), "Локация");
			Терминал = Терминал.ВыгрузитьКолонку("Локация");
			Если Терминал.Количество() Тогда
				Возврат Терминал[0];
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;

	Возврат Справочники.Локации.ПустаяСсылка();
	
	
КонецФункции	

//Евросиб Шевченко А.В. US 110215 TA 120129 06.10.2025   

Функция ЕстьСканКопияВПрисоедененныхФайлах(ВладелецФайлов) Экспорт;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Файлы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|ГДЕ
		|	Файлы.ВладелецФайла = &ВладелецФайлов
		|	И Файлы.ПометкаУдаления = Ложь
		|	И Файлы.ЭтоСканКопия";	
	Запрос.Параметры.Вставить("ВладелецФайлов", ВладелецФайлов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();

КонецФункции //Евросиб Коханенко Н.А. 27.03.2025 )) #102319

&НаКлиенте
Процедура СтатусДокументаПриИзменении(Элемент)
	
	СтатусДокументаПриИзмененииНаСервере();	
	
КонецПроцедуры

&НаСервере
Процедура СтатусДокументаПриИзмененииНаСервере()
	Если Объект.СтатусДокумента = ПредопределенноеЗначение("Перечисление.СтатусыСогласования.СогласованоБезЗамечаний") ИЛИ Объект.СтатусДокумента = ПредопределенноеЗначение("Перечисление.СтатусыСогласования.СогласованСКомментариями") Тогда
		мСтрокДляОтбора = Новый Массив;
		
		Для Каждого Стр Из Объект.Состояния Цикл
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Состояние,"Согласование") = Истина И Стр.Состояние <> ПредопределенноеЗначение("Справочник.Состояния.ПроверкаСогласованияОтправкаПодкреплениеПодписанногоПСЦ") Тогда
				мСтрокДляОтбора.Добавить(Стр);	
			КонецЕсли;	
		КонецЦикла;	
		
		ТЗ = Объект.Состояния.Выгрузить(мСтрокДляОтбора,"ЗавершениеРаботы");
		
		Тз.Сортировать("ЗавершениеРаботы УБЫВ");
		
		Если ТЗ.Количество() Тогда
			Объект.ДатаСогласования = ТЗ[0].ЗавершениеРаботы;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Функция ОпредилитьОбязательностьЗаполненияПолейПоДопУсловиям(Стр) //Евросиб Шевченко А.В. US 83101 TA 122833 07.11.2025
	
	СтрокиДляВыгрузки = Новый Массив;
	СтрокиДляВыгрузки.Добавить(Стр);
	
	ТаблицаПараметр = Объект.Услуги.Выгрузить(СтрокиДляВыгрузки);
	//Евросиб Шевченко А.В. US 125530 TA 131571 12.03.2026
	ТаблицаТиповКТК = Новый ТаблицаЗначений;
	ТаблицаТиповКТК.Колонки.Добавить("ТипоразмерКТК",Новый ОписаниеТипов("СправочникСсылка.ТипоразмерыТЕ"));
	ТаблицаТиповКТК.Колонки.Добавить("ИдентификаторСтрокиУслуг",Новый ОписаниеТипов("строка",,,,НОвый КвалификаторыЧисла(36)));
	
	Для Каждого СтрТЕ Из Стр.ТипоразмерыКТК Цикл
		НовСтрока = ТаблицаТиповКТК.Добавить();
		НовСтрока.ТипоразмерКТК =  СтрТЕ.Значение;
		НовСтрока.ИдентификаторСтрокиУслуг =  Стр.ИдентификаторСтрокиУслуг;
	КонецЦикла;	
	//Евросиб Шевченко А.В. US 125530 TA 131571 12.03.2026
	СхемаКомпоновкиДанных = ПолучитьОбщийМакет("ДопУсловияОбязательныхПолейВидовУслугПоставщиков");
	
	мОтвет = Новый Массив;
	
	Для Каждого Условие Из ДопУсловияОтборов Цикл
		
		СтруктураОтвет = Новый Структура("ИмяРек,Значение","",Ложь);
		
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		КомпоновщикНастроек.ЗагрузитьНастройки(Условие.Настройка);
		СтруктураОтвет.Вставить("ИмяРек",Условие.Имя+"Обязательное");
		Настройки = КомпоновщикНастроек.Настройки;
		
		ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		
		СтруктураВнешнейТаблицы = Новый Структура("Услуги",ТаблицаПараметр);
		//Евросиб Шевченко А.В. US 125530 TA 131571 12.03.2026
		СтруктураВнешнейТаблицы.Вставить("ТипоразмерыКТК",ТаблицаТиповКТК);
		//Евросиб Шевченко А.В. US 125530 TA 131571 12.03.2026
		
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,СтруктураВнешнейТаблицы , ДанныеРасшифровки);
		
		Результат = Новый ТабличныйДокумент();
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		
		ТзРезультат = Новый ТаблицаЗначений;
		
		ПроцессорВывода.УстановитьОбъект(ТзРезультат);
		
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		
		СтруктураОтвет.Вставить("Значение",ТзРезультат.Количество() <> 0);
		мОтвет.Добавить(СтруктураОтвет);
	КонецЦикла;	
	
	Возврат мОтвет; 
	
КонецФункции

&НаСервере
Процедура ПересчетСтавкиПСвСутки(ТекСтрока,Имя) //Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	
	ЗначениеСтавкиНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСтавкуНДС(ТекДанные.СтавкаНДС);
	
	Если Имя = "СтоимостьСНДС" Тогда
		Если ЗначениеЗаполнено(ТекДанные.СтоимостьСНДС) И ЗначениеЗаполнено(ТекДанные.НормаПользования) Тогда
			ТекДанные.СтавкаЗаПСВСутСНДС = ТекДанные.СтоимостьСНДС / ТекДанные.НормаПользования;
		КонецЕсли;
		
		СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(ТекДанные.СтавкаЗаПСВСутСНДС, ЗначениеСтавкиНДС, Истина, Истина);
		ТекДанные.СтавкаЗаПСВСутБезНДС = ТекДанные.СтавкаЗаПСВСутСНДС - СуммаНДС;
		
	КонецЕсли;	
	
	Если Имя = "СтоимостьБезНДС" Тогда
		Если ЗначениеЗаполнено(ТекДанные.СтоимостьБезНДС) И ЗначениеЗаполнено(ТекДанные.НормаПользования) Тогда
			ТекДанные.СтавкаЗаПСВСутБезНДС = ТекДанные.СтоимостьБезНДС / ТекДанные.НормаПользования
		КонецЕсли;
		
		СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(ТекДанные.СтавкаЗаПСВСутБезНДС, ЗначениеСтавкиНДС, Истина, Ложь);
		ТекДанные.СтавкаЗаПСВСутСНДС = ТекДанные.СтавкаЗаПСВСутБезНДС + СуммаНДС;
		
	КонецЕсли;
	
	Если Имя = "НормаПользования" Тогда
		Если ЗначениеЗаполнено(ТекДанные.СтоимостьСНДС) И ЗначениеЗаполнено(ТекДанные.НормаПользования) Тогда
			ТекДанные.СтавкаЗаПСВСутСНДС = ТекДанные.СтоимостьСНДС / ТекДанные.НормаПользования;	
			СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(ТекДанные.СтавкаЗаПСВСутСНДС, ЗначениеСтавкиНДС, Истина, Истина);
			ТекДанные.СтавкаЗаПСВСутБезНДС = ТекДанные.СтавкаЗаПСВСутСНДС - СуммаНДС;
		ИначеЕсли ЗначениеЗаполнено(ТекДанные.СтоимостьБезНДС) И ЗначениеЗаполнено(ТекДанные.НормаПользования) Тогда
			ТекДанные.СтавкаЗаПСВСутБезНДС = ТекДанные.СтоимостьБезНДС / ТекДанные.НормаПользования;		
			СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(ТекДанные.СтавкаЗаПСВСутБезНДС, ЗначениеСтавкиНДС, Истина, Ложь);
			ТекДанные.СтавкаЗаПСВСутСНДС = ТекДанные.СтавкаЗаПСВСутБезНДС + СуммаНДС;	
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры	

//Евросиб Шевченко А.В. US 124811 TA 129059 13.03.2026
&НаКлиенте
Процедура УслугиКлассОпасностиСтрокойНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Модифицированность = Истина;
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	
	ОписаниеПоля = ПараметрыВидаУслуг.ПоляТаблицыУслуг.Получить("КлассОпасностиСтрокой");
	Если ОписаниеПоля <> Неопределено И ЗначениеЗаполнено(ОписаниеПоля.СписокВыбора) Тогда
		КлассыОпасности = ОписаниеПоля.СписокВыбора.ВыгрузитьЗначения();
		СписокКлассовОпасности = Новый СписокЗначений;
		СписокКлассовОпасности.ЗагрузитьЗначения(КлассыОпасности);
	Иначе
		КлассыОпасности = ПолучитьСписокКласовОпасности();
		СписокКлассовОпасности = Новый СписокЗначений;
		СписокКлассовОпасности.ЗагрузитьЗначения(КлассыОпасности);
	КонецЕсли;
	
	Для Каждого ЭлементСписка Из СписокКлассовОпасности Цикл
		ВыбранныйЭлемент = ТекДанные.КлассыОпасности.НайтиПоЗначению(ЭлементСписка.Значение);
		Если ВыбранныйЭлемент <> Неопределено Тогда
			ЭлементСписка.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;	
	ПараметрыФормы.Вставить("ТекущийСписок", СписокКлассовОпасности);
	ПараметрыФормы.Вставить("ПоказыватьПометку", Истина);
	ПараметрыФормы.Вставить("ИзменятьСоставСтрок", Ложь);
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ИдентификаторСтроки", ТекСтрока);
	
	ОповещениеОЗакрытииФормыСписка = Новый ОписаниеОповещения("ПриЗакрытииФормыРедактированияСпискаКлассаОпасности", ЭтаФорма, ПараметрыОповещения);	
	ОткрытьФорму("ОбщаяФорма.ФормаРедактированияСпискаЗначений", ПараметрыФормы, Этаформа,,,, ОповещениеОЗакрытииФормыСписка, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

Функция ПолучитьСписокКласовОпасности()
	
	мКлассы = Новый Массив;

	мКлассы.Добавить(Перечисления.КлассОпасностиГруза.Первый);
    мКлассы.Добавить(Перечисления.КлассОпасностиГруза.Второй);
	мКлассы.Добавить(Перечисления.КлассОпасностиГруза.Третий);
	мКлассы.Добавить(Перечисления.КлассОпасностиГруза.Четвертый);
	мКлассы.Добавить(Перечисления.КлассОпасностиГруза.Пятый);
	мКлассы.Добавить(Перечисления.КлассОпасностиГруза.Шестой);
	мКлассы.Добавить(Перечисления.КлассОпасностиГруза.Седьмой);
	мКлассы.Добавить(Перечисления.КлассОпасностиГруза.Восьмой);
	мКлассы.Добавить(Перечисления.КлассОпасностиГруза.Девятый);
	
	Возврат мКлассы;
	
КонецФункции	

&НаКлиенте
Процедура ПриЗакрытииФормыРедактированияСпискаКлассаОпасности(СписокТипоразмеров, ДополнительныеПараметры) Экспорт
	
	Если СписокТипоразмеров <> Неопределено Тогда
		
		ТекСтрока = ДополнительныеПараметры.ИдентификаторСтроки;
		ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
		ТекДанные.КлассыОпасности.Очистить();		
		
		Для Каждого ЭлементСписка Из СписокТипоразмеров Цикл
			Если ЭлементСписка.Пометка Тогда
				ТекДанные.КлассыОпасности.Добавить(ЭлементСписка.Значение);
			КонецЕсли;
		КонецЦикла;
		
		КлассыОпасности = ТекДанные.КлассыОпасности.ВыгрузитьЗначения();
		
		УслугиКлассыОпасностиПриИзмененииСервер(ТекСтрока);
			
		Если ЗаполнятьВниз Тогда
			ВыполнитьЗаполнениеВниз();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиКлассыОпасностиПриИзмененииСервер(ТекСтрока)
	
	ТекДанные = Объект.Услуги.НайтиПоИдентификатору(ТекСтрока);
	ЗначенияПолей = ОпредилитьОбязательностьЗаполненияПолейПоДопУсловиям(ТекДанные);
	Для Каждого ОбязательноеПоле Из ЗначенияПолей Цикл
		ТекДанные[ОбязательноеПоле.ИмяРек] = ОбязательноеПоле.Значение;
	КонецЦикла;
	ОбработатьИзмененияКлассыОпасностиСтрокиУслуг(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзмененияКлассыОпасностиСтрокиУслуг(ТекДанные)
	
	ТекДанные.КлассОпасностиСтрокой = СтрСоединить(ТекДанные.КлассыОпасности.ВыгрузитьЗначения(), "; ");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКлассОпасностиСтрокойОчистка(Элемент, СтандартнаяОбработка)
	ТекДанные = Элементы.Услуги.ТекущиеДанные;
	ТекСтрока = Элементы.Услуги.ТекущаяСтрока;
	
	ТекДанные.КлассыОпасности.Очистить();
	
	УслугиКлассыОпасностиПриИзмененииСервер(ТекСтрока);
	
	Если ЗаполнятьВниз Тогда
		ВыполнитьЗаполнениеВниз(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура НайтиЗаписатьМультизначения()
	
	ЗаписатьКлассыОпасности();
	
КонецПроцедуры	

&НаСервере
Процедура ЗаписатьКлассыОпасности()
				
	ТаблицаКлассов = Новый ТаблицаЗначений;
	ТаблицаКлассов.Колонки.Добавить("ИдентификаторСтрокиУслуг",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));
	ТаблицаКлассов.Колонки.Добавить("Класс",Новый ОписаниеТипов("ПеречислениеСсылка.КлассОпасностиГруза"));
	
	Для Каждого Стр Из Объект.Услуги Цикл
		Для Каждого КлассОпс Из Стр.КлассыОпасности Цикл
			НовСтрока = ТаблицаКлассов.Добавить();
			НовСтрока.ИдентификаторСтрокиУслуг = Стр.ИдентификаторСтрокиУслуг;
			НовСтрока.Класс = КлассОпс.Значение;                           
		КонецЦикла;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Детализация.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	Детализация.Класс КАК Класс
	|ПОМЕСТИТЬ Детализация
	|ИЗ
	|	&Детализация КАК Детализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Детализация.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	КОЛИЧЕСТВО(*) КАК КоличествоСтрокДетализации
	|ПОМЕСТИТЬ Услуги
	|ИЗ
	|	Детализация КАК Детализация
	|
	|СГРУППИРОВАТЬ ПО
	|	Детализация.ИдентификаторСтрокиУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Детализация.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	МультизначенияСписок.Ссылка КАК Ссылка,
	|	МультизначенияСписок.Значение КАК Класс,
	|	1 КАК КоличествоСтрок
	|ПОМЕСТИТЬ НайденныеДетализации2
	|ИЗ
	|	Детализация КАК Детализация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Мультизначения.Список КАК МультизначенияСписок
	|		ПО Детализация.Класс = МультизначенияСписок.Значение
	|			И (МультизначенияСписок.Ссылка.Метаданные = &Метаданные)
	|
	|СГРУППИРОВАТЬ ПО
	|	Детализация.ИдентификаторСтрокиУслуг,
	|	МультизначенияСписок.Ссылка,
	|	МультизначенияСписок.Значение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НайденныеДетализации2.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	НайденныеДетализации2.Ссылка КАК Ссылка,
	|	СУММА(НайденныеДетализации2.КоличествоСтрок) КАК КоличествоСтрок
	|ПОМЕСТИТЬ НайденныеДетализации
	|ИЗ
	|	НайденныеДетализации2 КАК НайденныеДетализации2
	|
	|СГРУППИРОВАТЬ ПО
	|	НайденныеДетализации2.ИдентификаторСтрокиУслуг,
	|	НайденныеДетализации2.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	МАКСИМУМ(Мультизначения.Ссылка) КАК Ссылка
	|ИЗ
	|	Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ НайденныеДетализации КАК НайденныеДетализации
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Мультизначения КАК Мультизначения
	|			ПО НайденныеДетализации.Ссылка = Мультизначения.Ссылка
	|				И НайденныеДетализации.КоличествоСтрок = Мультизначения.КоличествоСтрокСписока
	|				И (Мультизначения.Метаданные = &Метаданные)
	|		ПО Услуги.ИдентификаторСтрокиУслуг = НайденныеДетализации.ИдентификаторСтрокиУслуг
	|			И Услуги.КоличествоСтрокДетализации = НайденныеДетализации.КоличествоСтрок
	|
	|СГРУППИРОВАТЬ ПО
	|	Услуги.ИдентификаторСтрокиУслуг";
	
	Запрос.УстановитьПараметр("Метаданные", "ПеречислениеСсылка.КлассОпасностиГруза");	
	Запрос.УстановитьПараметр("Детализация", ТаблицаКлассов);	
	ТаблицаКлассов = Запрос.Выполнить().Выгрузить();
	
	НовыеКлассы = Новый Массив;
	
	Для Каждого Стр Из Объект.Услуги Цикл
		
		КлассОпасности = ТаблицаКлассов.Найти(Стр.ИдентификаторСтрокиУслуг, "ИдентификаторСтрокиУслуг");
		Если КлассОпасности <> Неопределено Тогда
			Если ЗначениеЗаполнено(КлассОпасности.Ссылка) Тогда
				
				Стр.МультизначениеКлассыОпасности = КлассОпасности.Ссылка;
				
			Иначе
				
				КоличествоСтрок = Стр.КлассыОпасности.Количество();
				
				НайденныеКлассы = Неопределено;
				Для Каждого НовыйКласс Из НовыеКлассы Цикл					
					Если НовыйКласс.КоличествоСтрокСписока = КоличествоСтрок Тогда
						ВсеСтрокиНайдены = Истина;
						Для Каждого СтрКласс Из Стр.КлассыОпасности Цикл
							НайденныеСтроки = НовыйКласс.Список.НайтиСтроки(Новый Структура("Значение", СтрКласс.Значение));
							Если Не ЗначениеЗаполнено(НайденныеСтроки) Тогда
								ВсеСтрокиНайдены = Ложь;
								Прервать;
							КонецЕсли;
						КонецЦикла;
						Если ВсеСтрокиНайдены Тогда
							НайденныеКлассы = НовыйКласс;
							Прервать;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
				Если НайденныеКлассы <> Неопределено Тогда
					Стр.МультизначениеКлассыОпасности = НайденныеКлассы.Ссылка;
				Иначе
					
					НовыйСпр = Справочники.Мультизначения.СоздатьЭлемент();
					НовыйСпр.Метаданные = "ПеречислениеСсылка.КлассОпасностиГруза";
					Для Каждого КлассОпс Из Стр.КлассыОпасности Цикл
						НовСтрока = НовыйСпр.Список.Добавить();
						НовСтрока.Значение = КлассОпс.Значение;                           
					КонецЦикла;
					НовыйСпр.Записать();
					НовыеКлассы.Добавить(НовыйСпр);
					Стр.МультизначениеКлассыОпасности = НовыйСпр.Ссылка;					
				КонецЕсли;
				
			КонецЕсли;
		Иначе
			Стр.МультизначениеКлассыОпасности = Справочники.Мультизначения.ПустаяСсылка();
		КонецЕсли;		
		
	КонецЦикла;
	
	
КонецПроцедуры	

//Евросиб Шевченко А.В. US 124811 TA 129059 13.03.2026 

&НаСервере
Процедура ЗаполнитьСтавкиНДС() //Евросиб Шевченко А.В. BUG 131579 TA 132300 17.03.2026
	
	СтранаРегистрации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Контрагент, "СтранаРегистрации");
	Если Объект.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.Внутрироссийская") Тогда
		Если СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.Россия") Тогда
			//Евросиб СубботинВ #125845 09.12.2025 Начало 
			//Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20");
			Если Объект.НачалоДействия < Дата(2026,01,01) Тогда 
				Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20");
				
				Если Объект.НачалоДействия = Дата(1,1,1) Тогда
					Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22");
				КонецЕсли;
				
			Иначе
				Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22");
			КонецЕсли;
			//Евросиб СубботинВ #125845 09.12.2025 Конец
		Иначе
			Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
		КонецЕсли;
	ИначеЕсли Объект.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.Международная") Тогда
		Если СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.Россия") Тогда
			Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0");
		Иначе
			Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
		КонецЕсли;
	ИначеЕсли Объект.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.ВнеТерриторииРФ") Тогда
		Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
	Иначе
		Элементы.СтавкаНДС.ТолькоПросмотр = Ложь;
		Возврат;
	КонецЕсли; 
	//Евросиб Коханенко Н.А. 29.05.2025 )) #109338 
	
	СоответствиеРеквизитовНоменклатуры = ПолучитьЗначенияРеквизитовНоменклатурыУслуг();
	Для Каждого СтрокаТЧ Из Объект.Услуги Цикл
		РеквизитыНоменклатуры = СоответствиеРеквизитовНоменклатуры.Получить(СтрокаТЧ.Номенклатура);
		Если ЗначениеЗаполнено(РеквизитыНоменклатуры) Тогда
			СтавкаНДСПоставщика = РеквизитыНоменклатуры.СтавкаНДСПоставщика;
		Иначе
			СтавкаНДСПоставщика = Неопределено;
		КонецЕсли;
		ЗаполнитьСтавкуНДСВСтрокеУслуг(СтрокаТЧ, СтавкаНДСПоставщика);
		ПересчитатьСтоимостьСУчетомСтавкиНДС(СтрокаТЧ);
	КонецЦикла;
	
	Элементы.СтавкаНДС.ТолькоПросмотр = Истина;
	
КонецПроцедуры	

&НаКлиенте
Процедура УслугиКоносаментОчистка(Элемент, СтандартнаяОбработка)
	КоносаментОчисткаНаСервере();
КонецПроцедуры

&НаСервере
Процедура КоносаментОчисткаНаСервере()
	
	
	
КонецПроцедуры	
