
#Область ПрограммныйИнтерфейс
// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
       Настройки.ПриДобавленииКомандПечати = Истина;
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Протокол
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ПСЦПоставщика";
	КомандаПечати.Идентификатор = "ПСЦПоставщика";
	КомандаПечати.Представление = НСтр("ru = 'Протокол'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	// Протокол
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ПСЦПоставщика";
	КомандаПечати.Идентификатор = "ПСЦПоставщикаФаксимиле";
	КомандаПечати.Представление = НСтр("ru = 'Протокол с факсимиле'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	//Евросиб Коханенко Н.А. 06.03.2025 (( #102319
	// Протокол Автоперевозки
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ПСЦПоставщика";
	КомандаПечати.Идентификатор = "ПСЦПоставщикаАвтоперевозки";
	КомандаПечати.Представление = НСтр("ru = 'Протокол (автоперевозки)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ПСЦПоставщика";
	КомандаПечати.Идентификатор = "ПСЦПоставщикаАвтоперевозкиТерминалы";
	КомандаПечати.Представление = НСтр("ru = 'Протокол (автоперевозки) с адресами терминалов'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//Евросиб Коханенко Н.А. 06.03.2025 )) #102319 
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов – Массив – ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати – Структура – дополнительные настройки печати;
//  КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
//  ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
//                                            представление – имя области, в которой был выведен объект (выходной параметр);
//  ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	//Евросиб Коханенко Н.А. 28.11.2024 (( #89893 
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПСЦПоставщика") Тогда
		Для Каждого ЭлМассива из МассивОбъектов Цикл
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПСЦПоставщика", "Протокол типовой (контейнеры)", НапечататьТиповойПротокол(МассивОбъектов),,"Документы.ПСЦ.ПФ_MXL_ПротоколТиповойКонтейнеры");
		КонецЦикла;
	//Евросиб Коханенко Н.А. 06.03.2025 (( #102319 
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПСЦПоставщикаАвтоперевозки") Тогда
		Для Каждого ЭлМассива из МассивОбъектов Цикл 
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПСЦПоставщикаАвтоперевозки", "Протокол типовой (автоперевозки)", НапечататьТиповойПротоколАвтоперевозки(МассивОбъектов),,"Документы.ПСЦ.ПФ_MXL_ПротоколТиповойАвтоперевозки");
		КонецЦикла;
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПСЦПоставщикаАвтоперевозкиТерминалы") Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ВыводитьАдресаТерминалов", Истина);
		Для Каждого ЭлМассива из МассивОбъектов Цикл 
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПСЦПоставщикаАвтоперевозкиТерминалы", "Протокол типовой (автоперевозки)", НапечататьТиповойПротоколАвтоперевозки(МассивОбъектов, ДопПараметры),,"Документы.ПСЦ.ПФ_MXL_ПротоколТиповойАвтоперевозки");
		КонецЦикла;
	//Евросиб Коханенко Н.А. 06.03.2025 )) #102319 
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПСЦПоставщикаФаксимиле") Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ВыводитьФаксимиле", Истина);
		Для Каждого ЭлМассива из МассивОбъектов Цикл 
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПСЦПоставщикаФаксимиле", "Протокол типовой (контейнеры)", НапечататьТиповойПротокол(МассивОбъектов, ДопПараметры),,"Документы.ПСЦ.ПФ_MXL_ПротоколТиповойКонтейнеры");
		КонецЦикла;
	КонецЕсли;
	//Евросиб Коханенко Н.А. 28.11.2024 )) #89893 
КонецПроцедуры

Процедура ОтправитьПСЦВДО(ПараметрыВыполнения, АдресРезультата) Экспорт   
	
	ЗаписьЖурналаРегистрации(НСтр("ru = 'Подключение к вебсервису 1С:ДО'"),
				УровеньЖурналаРегистрации.Информация,,,
				"");
				
	ПСЦСсылка = ПараметрыВыполнения.ПСЦСсылка;    
	ЭтоЗавершениеСогласования = ПараметрыВыполнения.ЭтоЗавершениеСогласования;
	
	ОтправкаСканКопии = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПСЦ.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПСЦ КАК ПСЦ
		|		ПО (ПСЦ.Ссылка = Файлы.ВладелецФайла)
		|			И (Файлы.ЭтоСканКопия)
		|ГДЕ
		|	ПСЦ.Ссылка = &Ссылка
		|	И НЕ Файлы.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Ссылка", ПСЦСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда
		ОтправкаСканКопии = Истина;
	КонецЕсли;	  
	
	РеквизитыПСЦ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПСЦСсылка, 
				"СсылкаНаВнутреннийДокументДО, СтатусДокумента, Организация, ПодписанСДвухСторон");
	
	Если (не ЗначениеЗаполнено(РеквизитыПСЦ.СсылкаНаВнутреннийДокументДО) ИЛИ ЭтоЗавершениеСогласования ИЛИ ОтправкаСканКопии)
		и (РеквизитыПСЦ.СтатусДокумента = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний
		или РеквизитыПСЦ.СтатусДокумента = Перечисления.СтатусыСогласования.СогласованСКомментариями
		или РеквизитыПСЦ.СтатусДокумента = Перечисления.СтатусыСогласования.Подписано) Тогда
		
		ДанныеДляОтправки = ЕСОбменСервер.ПодготовитьТаблицуПСЦдляОтправкиДО(ПСЦСсылка);
		// ПСЦ поставщика отправляем в ДО после установки даты подписания с двух сторон 
		Если РеквизитыПСЦ.ПодписанСДвухСторон Тогда
			ЕСОбменСервер.СоздатьКарточкуПСЦвДО(ДанныеДляОтправки);
		КонецЕсли;
		
		Если СтрНайти(ДанныеДляОтправки[0].Сообщение, "ОК") <> 0 Тогда   
			Объект = ПСЦСсылка.ПолучитьОбъект();
			Объект.СсылкаНаВнутреннийДокументДО = ДанныеДляОтправки[0].Ссылка_В_ДО;  
			Попытка
				Объект.ОбменДанными.Загрузка = Истина;	
				Объект.Записать(РежимЗаписиДокумента.Запись);				
			Исключение
			    //Сообщить("Добавлена ссылка на внутренний документ в Документообороте. Необходимо записать Протокол!");
			КонецПопытки;
		КонецЕсли;
			
	КонецЕсли;	
	
КонецПроцедуры	

Функция ПолучитьПараметрыМаршрутизации(Объект) Экспорт
	
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Договор, "ВалютаВзаиморасчетов");
	
	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
	ПараметрыЗапроса.Вставить("Контрагент", Объект.Контрагент);
	ПараметрыЗапроса.Вставить("Договор", Объект.Договор);
	ПараметрыЗапроса.Вставить("Валюта", РеквизитыДоговора.ВалютаВзаиморасчетов);
	ПараметрыЗапроса.Вставить("Нерезидент", Справочники.Контрагенты.КонтрагентНерезидент(Объект.Контрагент));
	ПараметрыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Договор, "ВидДоговора, КатегорияДоговора");
	ПараметрыЗапроса.Вставить("ВидДоговора", ПараметрыДоговора.ВидДоговора);
	ПараметрыЗапроса.Вставить("КатегорияДоговора", ПараметрыДоговора.КатегорияДоговора);
	ПараметрыЗапроса.Вставить("ЦФО", Объект.ЦФО);
	ПараметрыЗапроса.Вставить("Типовой", Объект.Типовой);
	ПараметрыЗапроса.Вставить("ВидУслугПоставщика", Объект.ВидУслугПоставщика);
	ПараметрыЗапроса.Вставить("КатегорияУслуг", Объект.КатегорияУслуг);
	ПараметрыЗапроса.Вставить("МестоОказанияУслуг", Объект.МестоОказанияУслуг);

	Возврат ПараметрыЗапроса;
	
КонецФункции

Процедура ЗаполнитьРеквизитыИзДоговора(Объект, Договор) Экспорт
	
	РеквизитыДоговора = Справочники.ДоговорыКонтрагентов.ПолучитьЗначенияРеквизитовДоговораПоУмолчанию(Договор);
	Объект.ВалютаОплаты = РеквизитыДоговора.ВалютаОплаты;
	Объект.ОтветственныйМенеджер = РеквизитыДоговора.ОтветственныйЗаДоговор;
	Если ЗначениеЗаполнено(РеквизитыДоговора.ФормаПротокола) Тогда
		Если РеквизитыДоговора.ФормаПротокола = Перечисления.ФормыДокументов.Типовая Тогда
			Объект.Типовой = Истина;
		Иначе
			Объект.Типовой = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Контейнеры И Объект.Типовой Тогда
		Объект.НаименованиеПодписиКонтрагента = Справочники.НаименованияПодписей.Исполнитель;
		Объект.НаименованиеПодписи = Справочники.НаименованияПодписей.Клиент;
	Иначе
		Объект.НаименованиеПодписиКонтрагента = РеквизитыДоговора.НаименованиеСтороны;
		Объект.НаименованиеПодписи = РеквизитыДоговора.НаименованиеCтороныЕвросиб;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьОчереднойНомерПСЦ(Договор, Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ПСЦПоставщика.Ссылка) КАК ПорядковыйНомер
	|ИЗ
	|	Документ.ПСЦПоставщика КАК ПСЦПоставщика
	|ГДЕ
	|	ПСЦПоставщика.Договор = &Договор
	|	И ПСЦПоставщика.Ссылка <> &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.НомерПСЦ КАК НомерПСЦ
	|ИЗ
	|	Документ.ПСЦПоставщика КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Договор = &Договор
	|	И ТаблицаДокумента.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результаты = Запрос.ВыполнитьПакет();
	Выборка = Результаты[0].Выбрать();
	ТаблицаЗанятыхНомеров = Результаты[1].Выгрузить();
	
	Если Выборка.Следующий() Тогда 
		ПорядковыйНомер = Выборка.ПорядковыйНомер + 1;
	Иначе
		ПорядковыйНомер = 1;
	КонецЕсли;
	
	Пока Истина Цикл
		
		Если ПорядковыйНомер <= 999 Тогда
			ПорядковыйНомерСтрокой = Формат(ПорядковыйНомер, "ЧЦ=3; ЧН=000; ЧВН=");
		Иначе
			ПорядковыйНомерСтрокой = Формат(ПорядковыйНомер, "ЧГ=0");
		КонецЕсли;		
		
		СтрокаЗанятогоНомера = ТаблицаЗанятыхНомеров.Найти(ПорядковыйНомерСтрокой, "НомерПСЦ");
		Если СтрокаЗанятогоНомера = Неопределено Тогда
			Прервать;
		Иначе
			ПорядковыйНомер = ПорядковыйНомер + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПорядковыйНомерСтрокой;
	
КонецФункции

Функция ПроверитьУникальностьНомераПСЦ(Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПСЦПоставщика.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПСЦПоставщика КАК ПСЦПоставщика
		|ГДЕ
		|	ПСЦПоставщика.НомерПСЦ = &НомерПСЦ
		|	И ПСЦПоставщика.Договор = &Договор
		|	И ПСЦПоставщика.Ссылка <> &Ссылка
		|	И ПСЦПоставщика.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("НомерПСЦ", Объект.НомерПСЦ);
	Запрос.УстановитьПараметр("Договор", Объект.Договор);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Если РезультатЗапроса.Пустой() Тогда
		НомерУникален = Истина;
	Иначе
		НомерУникален = Ложь;
	КонецЕсли;
	
	Возврат НомерУникален;
	
КонецФункции

Функция ПолучитьДоверенностьДиректораПоПроизводству(ДатаДоверенности) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Доверенности.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Доверенности КАК Доверенности
	|ГДЕ
	|	Доверенности.ДатаНачалаДействия <= &ДатаДоверенности
	|	И Доверенности.ДатаОкончанияДейставия >= &ДатаДоверенности
	|	И Доверенности.Физлицо В
	|			(ВЫБРАТЬ
	|				ГруппыПользователейСостав.Пользователь.ФизическоеЛицо КАК ПользовательФизическоеЛицо
	|			ИЗ
	|				Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	|			ГДЕ
	|				ГруппыПользователейСостав.Ссылка = &ГруппаДиректорПоПроизводству)
	|	И НЕ Доверенности.ПометкаУдаления";
	Запрос.УстановитьПараметр("ГруппаДиректорПоПроизводству", Справочники.ГруппыПользователей.ДиректорПоПроизводству);
	Запрос.УстановитьПараметр("ДатаДоверенности", ДатаДоверенности);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Доверенность = Выборка.Ссылка;
	Иначе
		Доверенность = Справочники.Доверенности.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Доверенность;
	
КонецФункции

//Евросиб Коханенко Н.А. 30.11.2024 (( #89893
Функция НапечататьТиповойПротокол(МассивОбъектов, ДопПараметры=Неопределено) Экспорт
	
	ПечатьЗапрещена = Истина;
	ВыводитьФаксимиле = Ложь;
	Если ТипЗнч(ДопПараметры) = Тип("Структура") Тогда
		ДопПараметры.Свойство("ВыводитьФаксимиле", ВыводитьФаксимиле);
		Если ТипЗнч(ВыводитьФаксимиле) <> Тип("Булево") Тогда
			ВыводитьФаксимиле = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Результат = Новый ТабличныйДокумент;
	Результат.АвтоМасштаб = Истина;
	
	Первый = Истина;
	Для каждого Док из МассивОбъектов Цикл  
		
		//Евросиб Коханенко Н.А. 29.05.2025 (( #110586
		//проверка разрешения на печать
		//Согласован = Истина;
		//Для Каждого СтрСостояния Из Док.Состояния Цикл
		//	Если СтрСостояния.Статус <> Перечисления.СтатусыЭтапов.Выполнен 
		//			ИЛИ (СтрСостояния.Состояние.Согласование 
		//			И СтрСостояния.СтатусСогласования <> Перечисления.СтатусыСогласования.СогласованоБезЗамечаний) Тогда
		//		Согласован = Ложь;
		//		Прервать;
		//	КонецЕсли;
		//КонецЦикла;
		//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПСЦПоставщика.ПФ_MXL_ПротоколТиповойКонтейнеры", Док.Контрагент, Док.Договор);
		//Если НЕ Первый Тогда 
		//	Результат.ВывестиГоризонтальныйРазделительСтраниц(); 
		//КонецЕсли;
		//ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		//ОбластьШапка.Параметры.НомерДоговора = Док.Договор.Номер;
		//ОбластьШапка.Параметры.ДатаДоговора = Формат(Док.Договор.Дата, "ДФ=dd.MM.yyyy");
		//ОбластьШапка.Параметры.НомерПСЦ = Док.НомерПСЦ;
		//НаименованияНаДату = Справочники.Организации.НаименованияНаДату(?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация, Док.Организация), Док.Дата);
		//ОбластьШапка.Параметры.КраткоеНаименованиеИсполнителя = Док.НаименованиеПодписиКонтрагента; 
		//ОбластьШапка.Параметры.НаименованиеИсполнителя = Док.Контрагент.НаименованиеПолное;
		//Если ЗначениеЗаполнено(Док.ПодписантКонтрагента) Тогда 
		//	РуководительКонтрагента = ОтветственныеЛица_сервер.ПолучитьПодписанта(Док.Контрагент, Док.НачалоДействия, Док.ПодписантКонтрагента);
		
		//получаем данные из ПСЦ
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЛОЖЬ КАК Согласован
			|ИЗ
			|	Документ.ПСЦПоставщика.Состояния КАК ПСЦПоставщикаСостояния
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Состояния КАК Состояния
			|		ПО ПСЦПоставщикаСостояния.Состояние = Состояния.Ссылка
			|			И (ПСЦПоставщикаСостояния.Ссылка = &Ссылка)
			|			И (Состояния.Согласование
			|					И ПСЦПоставщикаСостояния.СтатусСогласования <> ЗНАЧЕНИЕ(Перечисление.СтатусыСогласования.СогласованоБезЗамечаний)
			|				ИЛИ ПСЦПоставщикаСостояния.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЭтапов.Выполнен))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПСЦПоставщика.Дата КАК Дата,
			|	ПСЦПоставщика.Контрагент КАК Контрагент,
			|	ПСЦПоставщика.Договор КАК Договор,
			|	ПСЦПоставщика.Организация КАК Организация,
			|	ПСЦПоставщика.НачалоДействия КАК НачалоДействия,
			|	ПСЦПоставщика.ПодписантКонтрагента КАК ПодписантКонтрагента,
			|	ПСЦПоставщика.ДоверенностьНаПодписантаКонтрагента КАК ДоверенностьНаПодписантаКонтрагента,
			|	ПСЦПоставщика.НаименованиеПодписи КАК НаименованиеПодписи,
			|	ПСЦПоставщика.НаименованиеПодписиКонтрагента КАК НаименованиеПодписиКонтрагента,
			|	ПСЦПоставщика.НомерПСЦ КАК НомерПСЦ,
			|	ПСЦПоставщика.СтавкаНДС КАК СтавкаНДС,
			|	ПСЦПоставщика.ДоверенностьЗаРуководителя КАК ДоверенностьЗаРуководителя,
			|	ПСЦПоставщика.ВидПеревозки КАК ВидПеревозки,
			//Евросиб Коханенко Н.А. 09.06.2025 (( #109338 
			|	ПСЦПоставщика.Типовой КАК Типовой,
			|	ПСЦПоставщика.ВидУслугПоставщика КАК ВидУслугПоставщика,
			//Евросиб Коханенко Н.А. 09.06.2025 )) #109338 
			|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,
			|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер,
			|	ДоговорыКонтрагентов.СНПКонтейнеровШтраф КАК СНПКонтейнеровШтраф,
			|	Контрагенты.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
			|	Организации.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	Доверенности.ДолжностьРодительныйПадеж КАК ДолжностьРодительныйПадеж,
			|	Доверенности.ФИОПодписантаДляПротокола КАК ФИОПодписантаДляПротокола,
			|	Доверенности.ОснованиеДляПодписанияРП КАК ОснованиеДляПодписанияРП,
			|	Доверенности.ФайлПечать КАК ДоверенностьЗаРуководителяФайлПечать,
			|	Доверенности.ФайлФаксимиль КАК ДоверенностьЗаРуководителяФайлФаксимиль,
			|	Доверенности.Наименование КАК ДоверенностьЗаРуководителяНаименование
			|ИЗ
			|	Документ.ПСЦПоставщика КАК ПСЦПоставщика
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|		ПО ПСЦПоставщика.Договор = ДоговорыКонтрагентов.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
			|		ПО ПСЦПоставщика.Контрагент = Контрагенты.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
			|		ПО ПСЦПоставщика.Организация = Организации.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Доверенности КАК Доверенности
			|		ПО ПСЦПоставщика.ДоверенностьЗаРуководителя = Доверенности.Ссылка
			|ГДЕ
			|	ПСЦПоставщика.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
			|	ПСЦПоставщикаУслуги.ПунктОтправленияГород КАК ПунктОтправленияГород,
			|	ПСЦПоставщикаУслуги.ПунктОтправленияСтрана КАК ПунктОтправленияСтрана,
			|	ПСЦПоставщикаУслуги.ПунктНазначенияГород КАК ПунктНазначенияГород,
			|	ПСЦПоставщикаУслуги.ПунктНазначенияСтрана КАК ПунктНазначенияСтрана,
			|	ПСЦПоставщикаУслуги.НормаПользования КАК НормаПользования,
			|	ПСЦПоставщикаУслуги.Номенклатура КАК Номенклатура,
			|	ПСЦПоставщикаУслуги.СтоимостьСНДС КАК СтоимостьСНДС,
			|	ПСЦПоставщикаУслуги.СтоимостьБезНДС КАК СтоимостьБезНДС,
			|	ПСЦПоставщикаУслуги.СтавкаНДС КАК СтавкаНДС,
			|	ПСЦПоставщикаУслуги.ИнструкцииПоВыдаче КАК ИнструкцииПоВыдаче,
			|	ПСЦПоставщикаУслуги.ИнструкцииПоСдаче КАК ИнструкцииПоСдаче,
			|	ПСЦПоставщикаУслуги.Валюта КАК Валюта,
			|	ПСЦПоставщикаУслуги.Количество КАК Количество
			|ИЗ
			|	Документ.ПСЦПоставщика.Услуги КАК ПСЦПоставщикаУслуги
			|ГДЕ
			|	ПСЦПоставщикаУслуги.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ПСЦПоставщикаКритерииУслуг.ТипоразмерКТК КАК ТипоразмерКТК,
			|	ТипоразмерыТЕ.Наименование КАК ТипоразмерКТКНаименование,
			|	ТипоразмерыТЕ.РазмерКТК КАК ТипоразмерКТКРазмерКТК,
			|	ПСЦПоставщикаКритерииУслуг.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг
			|ИЗ
			|	Документ.ПСЦПоставщика.КритерииУслуг КАК ПСЦПоставщикаКритерииУслуг
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипоразмерыТЕ КАК ТипоразмерыТЕ
			|		ПО ПСЦПоставщикаКритерииУслуг.ТипоразмерКТК = ТипоразмерыТЕ.Ссылка
			|ГДЕ
			|	ПСЦПоставщикаКритерииУслуг.Ссылка = &Ссылка";			
		Запрос.Параметры.Вставить("Ссылка", Док);
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		Если РезультатЗапроса[0].Пустой() Тогда
			Согласован = Истина;
		Иначе
			Согласован = Ложь;
		КонецЕсли;  
		ДанныеПСЦ = РезультатЗапроса[1].Выгрузить()[0];
		
		//Евросиб Коханенко Н.А. 06.06.2025 (( #109338
		Если НЕ ДанныеПСЦ.Типовой 
			//И ДанныеПСЦ.ВидУслугПоставщика = ПредопределенноеЗначение("Справочник.ВидыУслугПоставщиков.Контейнеры") 
		Тогда
			ОбщегоНазначения.СообщитьПользователю("" + Док.Ссылка + " не типовой. Печать невозможна.");
			Продолжить; 
		КонецЕсли;
        //Евросиб Коханенко Н.А. 06.06.2025 )) #109338 
		
		//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
		Если ДанныеПСЦ.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Порты Тогда
			ОбщегоНазначения.СообщитьПользователю("Протокол по группе услуг - порты не предусматривает формирование печатной формы ПСЦ.");
				Продолжить; 
		КонецЕсли;
		//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
		//Евросиб Шевченко А.В. US 110215 TA 120129 06.10.2025
		Если ДанныеПСЦ.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Фрахт Тогда
			ОбщегоНазначения.СообщитьПользователю("Протокол по группе услуг - Фрахт не предусматривает формирование печатной формы ПСЦ.");
				Продолжить; 
		КонецЕсли;
		//Евросиб Шевченко А.В. US 110215 TA 120129 06.10.2025
		//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
		Если ДанныеПСЦ.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.ТЭО Тогда
			ОбщегоНазначения.СообщитьПользователю("Протокол по группе услуг - ТЭО не предусматривает формирование печатной формы ПСЦ.");
				Продолжить; 
		КонецЕсли;
		//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПСЦПоставщика.ПФ_MXL_ПротоколТиповойКонтейнеры", ДанныеПСЦ.Контрагент, ДанныеПСЦ.Договор);
		
		Если НЕ Первый Тогда 
			Результат.ВывестиГоризонтальныйРазделительСтраниц(); 
		//Евросиб Коханенко Н.А. 05.06.2025 (( #109338 
		Иначе
			Первый = Ложь;	
		//Евросиб Коханенко Н.А. 05.06.2025 )) #109338 
		КонецЕсли;
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьШапка.Параметры.НомерДоговора = ДанныеПСЦ.ДоговорНомер;
		ОбластьШапка.Параметры.ДатаДоговора = Формат(ДанныеПСЦ.ДоговорДата, "ДФ=dd.MM.yyyy");
		ОбластьШапка.Параметры.НомерПСЦ = ДанныеПСЦ.НомерПСЦ;
		НаименованияНаДату = Справочники.Организации.НаименованияНаДату(?(ЗначениеЗаполнено(ДанныеПСЦ.ГоловнаяОрганизация), ДанныеПСЦ.ГоловнаяОрганизация, ДанныеПСЦ.Организация), ДанныеПСЦ.Дата);
		ОбластьШапка.Параметры.КраткоеНаименованиеИсполнителя = ДанныеПСЦ.НаименованиеПодписиКонтрагента; 
		ОбластьШапка.Параметры.НаименованиеИсполнителя = ДанныеПСЦ.КонтрагентНаименованиеПолное;
                                                                                               
		Если ЗначениеЗаполнено(ДанныеПСЦ.ПодписантКонтрагента) Тогда 
			РуководительКонтрагента = ОтветственныеЛица_сервер.ПолучитьПодписанта(ДанныеПСЦ.Контрагент, ДанныеПСЦ.НачалоДействия, ДанныеПСЦ.ПодписантКонтрагента);
		//Евросиб Коханенко Н.А. 29.05.2025 )) #110586 
			Если ЗначениеЗаполнено(РуководительКонтрагента.ДолжностьВРодительномПадеже) Тогда
				ДолжностьРуководителя = РуководительКонтрагента.ДолжностьВРодительномПадеже;
			ИначеЕсли ЗначениеЗаполнено(РуководительКонтрагента.ДолжностьРус) Тогда
				ДолжностьРуководителя = ПолучитьСклоненияСтроки(РуководительКонтрагента.ДолжностьРус,, "ПД=Родительный")[0];
			Иначе
				ДолжностьРуководителя = "";
			КонецЕсли;
			ОбластьШапка.Параметры.ДолжностьРуководителяИсполнителя = ДолжностьРуководителя;
			ФИОРуководителя = Строка(РуководительКонтрагента.Подписант);
			Если ЗначениеЗаполнено(РуководительКонтрагента.ФИОВРодительномПадеже) Тогда
				ФИОРуководителяРП = РуководительКонтрагента.ФИОВРодительномПадеже
			ИначеЕсли ЗначениеЗаполнено(ФИОРуководителя) Тогда
				ФИОРуководителяРП = ПолучитьСклоненияСтроки(ФИОРуководителя,, "ПД=Родительный")[0];
			Иначе
				ФИОРуководителяРП = "";
			КонецЕсли;
			НаОснованииСтрока = ?(ЗначениеЗаполнено(РуководительКонтрагента.НаОсновании), РуководительКонтрагента.НаОсновании, "Доверенности");
			//Евросиб Коханенко Н.А. 29.05.2025 (( #110586 
			//Если ЗначениеЗаполнено(Док.ДоверенностьНаПодписантаКонтрагента) Тогда
			//	ДоверенностьСтрока = Док.ДоверенностьНаПодписантаКонтрагента;
			Если ЗначениеЗаполнено(ДанныеПСЦ.ДоверенностьНаПодписантаКонтрагента) Тогда
				ДоверенностьСтрока = ДанныеПСЦ.ДоверенностьНаПодписантаКонтрагента;
			//Евросиб Коханенко Н.А. 29.05.2025 )) #110586 
			ИначеЕсли ЗначениеЗаполнено(РуководительКонтрагента.Доверенность) Тогда 
				ДоверенностьСтрока = РуководительКонтрагента.Доверенность;
			Иначе
				ДоверенностьСтрока = "";
			КонецЕсли; 
			ОбластьШапка.Параметры.ОснованиеИсполнителя = СтрШаблон("%1 %2", НаОснованииСтрока, ДоверенностьСтрока);
		Иначе //берем из поля руководителя    
			//Евросиб Коханенко Н.А. 29.05.2025 (( #110586 
			//РуководительКонтрагента = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Контрагент, Док.НачалоДействия);
			РуководительКонтрагента = ОтветственныеЛица_сервер.ПолучитьРуководителя(ДанныеПСЦ.Контрагент, ДанныеПСЦ.НачалоДействия);
			//Евросиб Коханенко Н.А. 29.05.2025 )) #110586 
			Если ЗначениеЗаполнено(РуководительКонтрагента.ДолжностьРП) Тогда
				ДолжностьРуководителя = РуководительКонтрагента.ДолжностьРП;
			ИначеЕсли ЗначениеЗаполнено(РуководительКонтрагента.ДолжностьРус) Тогда
				ДолжностьРуководителя = ПолучитьСклоненияСтроки(РуководительКонтрагента.ДолжностьРус,, "ПД=Родительный")[0];
			Иначе
				ДолжностьРуководителя = "";
			КонецЕсли;
			ОбластьШапка.Параметры.ДолжностьРуководителяИсполнителя = ДолжностьРуководителя;
			ФИОРуководителя = РуководительКонтрагента.ФИОРус; 
			Если ЗначениеЗаполнено(РуководительКонтрагента.ФИОРПРус) Тогда
				ФИОРуководителяРП = РуководительКонтрагента.ФИОРПРус
			ИначеЕсли ЗначениеЗаполнено(ФИОРуководителя) Тогда
				ФИОРуководителяРП = ПолучитьСклоненияСтроки(ФИОРуководителя,, "ПД=Родительный")[0];
			Иначе
				ФИОРуководителяРП = "";
			КонецЕсли;
			Если ЗначениеЗаполнено(РуководительКонтрагента.ОснованиеРус) Тогда
				НаОснованииСтрока = РуководительКонтрагента.ОснованиеРус
			ИначеЕсли ЗначениеЗаполнено(РуководительКонтрагента.Основание) Тогда
				НаОснованииСтрока = ПолучитьСклоненияСтроки(РуководительКонтрагента.Основание,, "ПД=Родительный")[0];
			Иначе
				НаОснованииСтрока = "Устава";
			КонецЕсли;
			ОбластьШапка.Параметры.ОснованиеИсполнителя = НаОснованииСтрока;
		КонецЕсли;
		ОбластьШапка.Параметры.ФИОРуководителяИсполнителя = ФИОРуководителяРП;
		
		//Евросиб Коханенко Н.А. 29.05.2025 (( #110586 
		//Если ЗначениеЗаполнено(Док.НаименованиеПодписи) Тогда
		//	ОбластьШапка.Параметры.КраткоеНаименованиеКлиента = Док.НаименованиеПодписи;
		Если ЗначениеЗаполнено(ДанныеПСЦ.НаименованиеПодписи) Тогда
			ОбластьШапка.Параметры.КраткоеНаименованиеКлиента = ДанныеПСЦ.НаименованиеПодписи;
		//Евросиб Коханенко Н.А. 29.05.2025 )) #110586 
		Иначе
			ОбластьШапка.Параметры.КраткоеНаименованиеКлиента = "Клиент";
		КонецЕсли;
		ОбластьШапка.Параметры.НаименованиеКлиента = НаименованияНаДату.НаименованиеПолное;
		//Евросиб Коханенко Н.А. 29.05.2025 (( #110586 
		//ОбластьШапка.Параметры.ДолжностьРуководителяКлиента = Док.ДоверенностьЗаРуководителя.ДолжностьРодительныйПадеж;
		//ОбластьШапка.Параметры.ФИОРуководителяКлиента = Док.ДоверенностьЗаРуководителя.ФИОПодписантаДляПротокола;
		//ОбластьШапка.Параметры.ОснованиеКлиента = Док.ДоверенностьЗаРуководителя.ОснованиеДляПодписанияРП;

		//Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя) Тогда
		//	ОбластьШапка.Параметры.ДолжностьРуководителяКлиента = Док.ДоверенностьЗаРуководителя.ДолжностьРодительныйПадеж;
		//	ОбластьШапка.Параметры.ФИОРуководителяКлиента = Док.ДоверенностьЗаРуководителя.ФИОПодписантаДляПротокола;
		//	ОбластьШапка.Параметры.ОснованиеКлиента = Док.ДоверенностьЗаРуководителя.ОснованиеДляПодписанияРП;
		//Иначе
		//	НашРуководитель = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Организация, Док.НачалоДействия);
		ОбластьШапка.Параметры.ДолжностьРуководителяКлиента = ДанныеПСЦ.ДолжностьРодительныйПадеж;
		ОбластьШапка.Параметры.ФИОРуководителяКлиента = ДанныеПСЦ.ФИОПодписантаДляПротокола;
		ОбластьШапка.Параметры.ОснованиеКлиента = ДанныеПСЦ.ОснованиеДляПодписанияРП;

		Если ЗначениеЗаполнено(ДанныеПСЦ.ДоверенностьЗаРуководителя) Тогда
			ОбластьШапка.Параметры.ДолжностьРуководителяКлиента = ДанныеПСЦ.ДолжностьРодительныйПадеж;
			ОбластьШапка.Параметры.ФИОРуководителяКлиента = ДанныеПСЦ.ФИОПодписантаДляПротокола;
			ОбластьШапка.Параметры.ОснованиеКлиента = ДанныеПСЦ.ОснованиеДляПодписанияРП;
		Иначе
			НашРуководитель = ОтветственныеЛица_сервер.ПолучитьРуководителя(ДанныеПСЦ.Организация, ДанныеПСЦ.НачалоДействия);
		//Евросиб Коханенко Н.А. 29.05.2025 )) #110586 
		ОбластьШапка.Параметры.ДолжностьРуководителяКлиента = НашРуководитель.ДолжностьРП;
			ОбластьШапка.Параметры.ФИОРуководителяКлиента = НашРуководитель.ФИОРПРус;
			ОбластьШапка.Параметры.ОснованиеКлиента = НашРуководитель.ОснованиеРус;
		КонецЕсли; 
		
		//Евросиб Коханенко Н.А. 29.05.2025 (( #110586 
		//ОбластьШапка.Параметры.НачалоДействия = Формат(Док.НачалоДействия, "ДФ=dd.MM.yyyy");
		//ОбластьШапка.Параметры.ОкончаниеДействия = Формат(Док.НачалоДействия + 86400*5, "ДФ=dd.MM.yyyy"); //+5 дней 
		ОбластьШапка.Параметры.НачалоДействия = Формат(ДанныеПСЦ.НачалоДействия, "ДФ=dd.MM.yyyy");
		ОбластьШапка.Параметры.ОкончаниеДействия = Формат(ДанныеПСЦ.НачалоДействия + 86400*5, "ДФ=dd.MM.yyyy"); //+5 дней 
		//Евросиб Коханенко Н.А. 29.05.2025 )) #110586 

		Результат.Вывести(ОбластьШапка);  
		
		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
		
		//Евросиб Коханенко Н.А. 29.05.2025 (( #109338
		Если ДанныеПСЦ.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
			ОбластьШапкаТаблицы.Параметры.НДСВСтоимости = " НДС не облагается";
		Иначе
			ОбластьШапкаТаблицы.Параметры.НДСВСтоимости = СтрШаблон(" включая %1 НДС", ДанныеПСЦ.СтавкаНДС);
		КонецЕсли;
		//Евросиб Коханенко Н.А. 29.05.2025 )) #109338 
		Результат.Вывести(ОбластьШапкаТаблицы);  
		
		//Евросиб Коханенко Н.А. 30.05.2025 (( #110586 
		//тчУслуги = Док.Услуги;
		тчУслуги = РезультатЗапроса[2].Выгрузить();
		тчКритерииУслуг = РезультатЗапроса[3].Выгрузить();
		//Евросиб Коханенко Н.А. 30.05.2025 )) #110586 
		Типоразмеры = Новый Соответствие;
		Найденные = Новый Структура("Строка20, Строка40", Неопределено, Неопределено);
		Для Каждого СтрУслуги Из тчУслуги Цикл
			
			Отбор = Новый Структура("ИдентификаторСтрокиУслуг", СтрУслуги.ИдентификаторСтрокиУслуг);
			//Евросиб Коханенко Н.А. 30.05.2025 (( #110586 
			//Критерии = Док.КритерииУслуг.НайтиСтроки(Отбор);
			Критерии = тчКритерииУслуг.НайтиСтроки(Отбор);
			//Евросиб Коханенко Н.А. 30.05.2025 )) #110586 
			РазмерыКТК = Новый Структура("Размеры, Количество20, Количество40", Новый Массив, 0, 0);  
			Для Каждого КритерийУслуги Из Критерии Цикл 
				//Евросиб Коханенко Н.А. 30.05.2025 (( #110586 
				//Если ЗначениеЗаполнено(КритерийУслуги.ТипоразмерКТК) Тогда
				//	Типоразмер = КритерийУслуги.ТипоразмерКТК.РазмерКТК;
				//	РазмерыКТК["Размеры"].Добавить(КритерийУслуги.ТипоразмерКТК.Наименование);
				//	Если КритерийУслуги.ТипоразмерКТК.РазмерКТК = ПредопределенноеЗначение("Справочник.РазмерыКТК.К20") Тогда 
				//		РазмерыКТК["Количество20"] = РазмерыКТК["Количество20"] + 1;
				//	ИначеЕсли КритерийУслуги.ТипоразмерКТК.РазмерКТК = ПредопределенноеЗначение("Справочник.РазмерыКТК.К40") Тогда
				//		РазмерыКТК["Количество40"] = РазмерыКТК["Количество40"] + 1;
				//	КонецЕсли;	
				//КонецЕсли;
				Если ЗначениеЗаполнено(КритерийУслуги.ТипоразмерКТК) Тогда
					Типоразмер = КритерийУслуги.ТипоразмерКТКРазмерКТК;
					РазмерыКТК["Размеры"].Добавить(КритерийУслуги.ТипоразмерКТКНаименование);
					Если КритерийУслуги.ТипоразмерКТКРазмерКТК = ПредопределенноеЗначение("Справочник.РазмерыКТК.К20") Тогда 
						РазмерыКТК["Количество20"] = РазмерыКТК["Количество20"] + 1;
					ИначеЕсли КритерийУслуги.ТипоразмерКТКРазмерКТК = ПредопределенноеЗначение("Справочник.РазмерыКТК.К40") Тогда
						РазмерыКТК["Количество40"] = РазмерыКТК["Количество40"] + 1;
					КонецЕсли;	
				КонецЕсли;
				//Евросиб Коханенко Н.А. 30.05.2025 )) #110586 
			КонецЦикла;
			//попутно в цикле найдем строки для ставок 20 и 40
			Если СтрУслуги.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.СНПКонтейнеров") Тогда 
				Если НЕ ЗначениеЗаполнено(Найденные["Строка20"]) 
						И РазмерыКТК["Количество20"] > 0 
						ИЛИ	РазмерыКТК["Количество20"] = 1 Тогда 
					Найденные["Строка20"] = СтрУслуги;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(Найденные["Строка40"]) 
						И РазмерыКТК["Количество40"] > 0 
						ИЛИ	РазмерыКТК["Количество40"] = 1 Тогда 
					Найденные["Строка40"] = СтрУслуги;
				КонецЕсли;
			КонецЕсли;
			//Евросиб Коханенко Н.А. 28.05.2025 (( #110585 
			//Типоразмеры.Вставить(СтрУслуги.ИдентификаторСтрокиУслуг, СтрСоединить(РазмерыКТК["Размеры"], ", "));
			Типоразмеры.Вставить(СтрУслуги.ИдентификаторСтрокиУслуг, СтрСоединить(ОбщегоНазначенияКлиентСервер.СвернутьМассив(РазмерыКТК["Размеры"]), ", "));
			//Евросиб Коханенко Н.А. 28.05.2025 )) #110585 
		КонецЦикла;
		
		НайденнаяСтрока20 = Найденные["Строка20"];
		НайденнаяСтрока40 = Найденные["Строка40"]; 
		
		Для Каждого СтрУслуги Из тчУслуги Цикл

			//строки с СНПКонтейнеров не печатаем 
			Если СтрУслуги.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.СНПКонтейнеров") Тогда 
				Продолжить;
			КонецЕсли;
			
			ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");  
			
			ОбластьСтрокаТаблицы.Параметры.ТипоразмерКТК = Типоразмеры.Получить(СтрУслуги.ИдентификаторСтрокиУслуг);		
            ОбластьСтрокаТаблицы.Параметры.КоличествоКТК = СтрУслуги.Количество;
			МассивНаименований = Новый Массив;
			Если ЗначениеЗаполнено(СтрУслуги.ПунктОтправленияСтрана) Тогда
				МассивНаименований.Добавить(СтрУслуги.ПунктОтправленияСтрана.Наименование)
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрУслуги.ПунктОтправленияГород) Тогда
				МассивНаименований.Добавить(СтрУслуги.ПунктОтправленияГород.Наименование)
			КонецЕсли;
			ОбластьСтрокаТаблицы.Параметры.ПунктВыдачиКТК = СтрСоединить(МассивНаименований, " ");

			МассивНаименований = Новый Массив;
			Если ЗначениеЗаполнено(СтрУслуги.ПунктНазначенияСтрана) Тогда
				МассивНаименований.Добавить(СтрУслуги.ПунктНазначенияСтрана.Наименование)
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрУслуги.ПунктНазначенияГород) Тогда
				МассивНаименований.Добавить(СтрУслуги.ПунктНазначенияГород.Наименование)
			КонецЕсли;
			ОбластьСтрокаТаблицы.Параметры.ПунктВозвратаКТК = СтрСоединить(МассивНаименований, " ");

			ОбластьСтрокаТаблицы.Параметры.КоличествоРазрешенныхДнейПользования = СтрУслуги.НормаПользования;						
			//Евросиб Коханенко Н.А. 30.05.2025 (( #110586 
			//Если Док.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.ВнеТерриторииРФ")
			//		ИЛИ Док.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.Международная") Тогда
			//	Стоимость = СтрУслуги.СтоимостьБезНДС;
			//ИначеЕсли Док.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.Внутрироссийская") Тогда  
			//	Стоимость = СтрУслуги.СтоимостьСНДС;
			//КонецЕсли;
			Если ДанныеПСЦ.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.ВнеТерриторииРФ")
					ИЛИ ДанныеПСЦ.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.Международная") Тогда
				Стоимость = СтрУслуги.СтоимостьБезНДС;
			ИначеЕсли ДанныеПСЦ.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.Внутрироссийская") Тогда  
				Стоимость = СтрУслуги.СтоимостьСНДС;
       		КонецЕсли;
			//Евросиб Коханенко Н.А. 30.05.2025 )) #110586 
			ОбластьСтрокаТаблицы.Параметры.СтоимостьУслуг = СтрШаблон("%1 %2", Формат(Стоимость,"ЧДЦ=2"), СтрУслуги.Валюта);;							
			ОбластьСтрокаТаблицы.Параметры.ИнструкцииПредоставления = СтрУслуги.ИнструкцииПоВыдаче;							
			ОбластьСтрокаТаблицы.Параметры.ИнструкцииВозврата = СтрУслуги.ИнструкцииПоСдаче; 
			Результат.Вывести(ОбластьСтрокаТаблицы);  
		КонецЦикла;
		
		//Евросиб Каблов 18.02.2025 ( #100589
		//Если Док.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.Внутрироссийская")
		//		ИЛИ Док.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.Международная") Тогда
		//	Если ЗначениеЗаполнено(НайденнаяСтрока20) Тогда	
		//		Стоимость20 = НайденнаяСтрока20.СтоимостьСНДС;
		//		Валюта20 = НайденнаяСтрока20.Валюта;
		//		СтавкаНДС20 = "включает " + НайденнаяСтрока20.СтавкаНДС + " НДС";  
		//	КонецЕсли;
		//	Если ЗначениеЗаполнено(НайденнаяСтрока40) Тогда	
		//		Стоимость40 = НайденнаяСтрока40.СтоимостьСНДС;
		//		Валюта40 = НайденнаяСтрока40.Валюта;
		//		СтавкаНДС40 = "включает " + НайденнаяСтрока40.СтавкаНДС + " НДС";  
		//	КонецЕсли;
		//ИначеЕсли Док.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.ВнеТерриторииРФ") Тогда  
		//	Если ЗначениеЗаполнено(НайденнаяСтрока20) Тогда	
		//		Стоимость20 = НайденнаяСтрока20.СтоимостьБезНДС;
		//		Валюта20 = НайденнаяСтрока20.Валюта;
		//		СтавкаНДС20 = "НДС не облагается";
		//	КонецЕсли;
		//	Если ЗначениеЗаполнено(НайденнаяСтрока40) Тогда	
		//		Стоимость40 = НайденнаяСтрока40.СтоимостьБезНДС;
		//		Валюта40 = НайденнаяСтрока40.Валюта;
		//		СтавкаНДС40 = "НДС не облагается";
		//	КонецЕсли;
		//КонецЕсли;
		
		//Евросиб Коханенко Н.А. 28.05.2025 (( #109338 
		//СНПКонтейнеровШтраф = Док.Договор.СНПКонтейнеровШтраф;
		//Если СНПКонтейнеровШтраф Тогда
		//	СтавкаИлиШтраф = "Штраф";
		//	СтрокаБезНДС = "НДС не облагается";      
		//Иначе
		//	СтавкаИлиШтраф = "Ставка";
		//	СтрокаБезНДС = "ставка НДС не облагается";
		//КонецЕсли;
		//Если ЗначениеЗаполнено(НайденнаяСтрока20) Тогда	
		//	Стоимость20 = НайденнаяСтрока20.СтоимостьСНДС;
		//	Валюта20 = НайденнаяСтрока20.Валюта;
		//	Если НайденнаяСтрока20.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		//		СтавкаНДС20 = СтрокаБезНДС;
		//	Иначе
		//		СтавкаНДС20 = СтрШаблон("ставка включает %1 НДС", НайденнаяСтрока20.СтавкаНДС);  
		//	КонецЕсли;
		//КонецЕсли;
		//Если ЗначениеЗаполнено(НайденнаяСтрока40) Тогда	
		//	Стоимость40 = НайденнаяСтрока40.СтоимостьСНДС;
		//	Валюта40 = НайденнаяСтрока40.Валюта;
		//	Если НайденнаяСтрока40.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		//		СтавкаНДС40 = СтрокаБезНДС;
		//	Иначе
		//		СтавкаНДС40 = СтрШаблон("ставка включает %1 НДС", НайденнаяСтрока40.СтавкаНДС);  
		//	КонецЕсли;  
		//КонецЕсли;
		
		СНПКонтейнеровШтраф = ДанныеПСЦ.СНПКонтейнеровШтраф;
		
		Если СНПКонтейнеровШтраф Тогда
			СтавкаИлиШтраф = "Штраф";
			СтрокаБезНДС = "за 1 контейнер/в сутки, НДС не облагается";
		Иначе
			СтавкаИлиШтраф = "Ставка";
			СтрокаБезНДС = "за 1 контейнер/в сутки, ставка НДС не облагается";
		КонецЕсли;

		Если ЗначениеЗаполнено(НайденнаяСтрока20) Тогда	
			Если СНПКонтейнеровШтраф Тогда
				Стоимость20 = НайденнаяСтрока20.СтоимостьБезНДС;
			Иначе
				Стоимость20 = НайденнаяСтрока20.СтоимостьСНДС;
			КонецЕсли;	
			Валюта20 = НайденнаяСтрока20.Валюта;
			Если НайденнаяСтрока20.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС 
				ИЛИ СНПКонтейнеровШтраф Тогда
				СтавкаНДС20 = СтрокаБезНДС;
			Иначе
				СтавкаНДС20 = СтрШаблон("за 1 контейнер/в сутки, ставка включает %1 НДС", НайденнаяСтрока20.СтавкаНДС);  
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(НайденнаяСтрока40) Тогда	
			Если СНПКонтейнеровШтраф Тогда
				Стоимость40 = НайденнаяСтрока40.СтоимостьБезНДС;
			Иначе
				Стоимость40 = НайденнаяСтрока40.СтоимостьСНДС;
			КонецЕсли;	
			Валюта40 = НайденнаяСтрока40.Валюта;
			Если НайденнаяСтрока40.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС
				ИЛИ СНПКонтейнеровШтраф Тогда
				СтавкаНДС40 = СтрокаБезНДС;
			Иначе
				СтавкаНДС40 = СтрШаблон("за 1 контейнер/в сутки, ставка включает %1 НДС", НайденнаяСтрока40.СтавкаНДС);  
			КонецЕсли;  
		КонецЕсли;
		//Евросиб Коханенко Н.А. 28.05.2025 )) #109338 
		//Евросиб Каблов 18.02.2025 )
		
		ОбластьРаздел = Макет.ПолучитьОбласть("Раздел");  
		Результат.Вывести(ОбластьРаздел);  
		
		Если ЗначениеЗаполнено(НайденнаяСтрока40) Тогда	
			ОбластьСтавка = Макет.ПолучитьОбласть("Ставка");
			ОбластьСтавка.Параметры.СтавкаИлиШтраф = СтавкаИлиШтраф;
			//Евросиб Коханенко Н.А. 28.05.2025 (( #109338 
			//ОбластьСтавка.Параметры.Размер = "40 Fut:";
			//ОбластьСтавка.Параметры.Стоимость = СтрШаблон("%1 %2, %3", Формат(Стоимость40,"ЧДЦ=2"), Валюта40, СтавкаНДС40);
			ОбластьСтавка.Параметры.Размер = "40";
			ОбластьСтавка.Параметры.Стоимость = СтрШаблон("%1 %2 %3", Формат(Стоимость40,"ЧДЦ=2"), Валюта40, СтавкаНДС40);
			//Евросиб Коханенко Н.А. 28.05.2025 )) #109338 
			Результат.Вывести(ОбластьСтавка);  
		КонецЕсли;
		Если ЗначениеЗаполнено(НайденнаяСтрока20) Тогда	
			ОбластьСтавка = Макет.ПолучитьОбласть("Ставка");
			ОбластьСтавка.Параметры.СтавкаИлиШтраф = СтавкаИлиШтраф;
			//Евросиб Коханенко Н.А. 28.05.2025 (( #109338 
			//ОбластьСтавка.Параметры.Размер = "20 Fut:";
			//ОбластьСтавка.Параметры.Стоимость = СтрШаблон("%1 %2, %3", Формат(Стоимость20,"ЧДЦ=2"), Валюта20, СтавкаНДС20); 
			ОбластьСтавка.Параметры.Размер = "20";
			ОбластьСтавка.Параметры.Стоимость = СтрШаблон("%1 %2 %3", Формат(Стоимость20,"ЧДЦ=2"), Валюта20, СтавкаНДС20); 
			//Евросиб Коханенко Н.А. 28.05.2025 )) #109338 
			Результат.Вывести(ОбластьСтавка);  
		КонецЕсли;

		ОбластьПункты = Макет.ПолучитьОбласть("Пункты");
		//Евросиб Коханенко Н.А. 29.05.2025 (( #109338 
		//Если Док.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.Внутрироссийская") Тогда
		//	ОбластьПункты.Параметры.ПредоставлениеКонтейнеров = "для внутрироссийской перевозки."; 
		//	ОбластьПункты.Параметры.СтавкиЗаПредоставлениеКонтейнеров = "включают 20% НДС.";
		//ИначеЕсли Док.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.Международная") Тогда
		//	ОбластьПункты.Параметры.ПредоставлениеКонтейнеров = "для международной перевозки.";
		//	ОбластьПункты.Параметры.СтавкиЗаПредоставлениеКонтейнеров = "включают 0% НДС.";
		//ИначеЕсли Док.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.ВнеТерриторииРФ") Тогда 
		//	ОбластьПункты.Параметры.ПредоставлениеКонтейнеров = "за пределами территории РФ.";
		//	ОбластьПункты.Параметры.СтавкиЗаПредоставлениеКонтейнеров = "НДС не облагаются.";
		//Иначе 
		//	ОбластьПункты.Параметры.ПредоставлениеКонтейнеров = "";
		//	ОбластьПункты.Параметры.СтавкиЗаПредоставлениеКонтейнеров = "";
		//КонецЕсли;
		Если ДанныеПСЦ.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.Внутрироссийская") Тогда
			ОбластьПункты.Параметры.ПредоставлениеКонтейнеров = "для внутрироссийской перевозки."; 
		ИначеЕсли ДанныеПСЦ.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.Международная") Тогда
			ОбластьПункты.Параметры.ПредоставлениеКонтейнеров = "для международной перевозки.";
		ИначеЕсли ДанныеПСЦ.ВидПеревозки = ПредопределенноеЗначение("Справочник.ВидыПеревозок.ВнеТерриторииРФ") Тогда 
			ОбластьПункты.Параметры.ПредоставлениеКонтейнеров = "за пределами территории РФ.";
		Иначе 
			ОбластьПункты.Параметры.ПредоставлениеКонтейнеров = "";
		КонецЕсли;
		//Евросиб Коханенко Н.А. 29.05.2025 )) #109338 
		
		Результат.Вывести(ОбластьПункты);  

		//подвал
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал"); 
		
		//Евросиб Коханенко Н.А. 30.05.2025 (( #110586 
		//ОбластьПодвал.Параметры.НаименованиеПодписиИсполнителя = Док.НаименованиеПодписиКонтрагента;
		//ОбластьПодвал.Параметры.НаименованиеИсполнителя = Док.Контрагент.НаименованиеПолное;
		//ОбластьПодвал.Параметры.ФИОРуководителяИсполнителя = ФИОРуководителя;
		//
		//ОбластьПодвал.Параметры.НаименованиеПодписиКлиента = Док.НаименованиеПодписи;
		//ОбластьПодвал.Параметры.НаименованиеКлиента = НаименованияНаДату.НаименованиеПолное;
		//Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя) Тогда
		//	ОбластьПодвал.Параметры.ФИОРуководителяКлиента = Док.ДоверенностьЗаРуководителя.Наименование;
		ОбластьПодвал.Параметры.НаименованиеПодписиИсполнителя = ДанныеПСЦ.НаименованиеПодписиКонтрагента;
		ОбластьПодвал.Параметры.НаименованиеИсполнителя = ДанныеПСЦ.КонтрагентНаименованиеПолное;
		ОбластьПодвал.Параметры.ФИОРуководителяИсполнителя = ФИОРуководителя;
		
		ОбластьПодвал.Параметры.НаименованиеПодписиКлиента = ДанныеПСЦ.НаименованиеПодписи;
		ОбластьПодвал.Параметры.НаименованиеКлиента = НаименованияНаДату.НаименованиеПолное;
		Если ЗначениеЗаполнено(ДанныеПСЦ.ДоверенностьЗаРуководителя) Тогда
			ОбластьПодвал.Параметры.ФИОРуководителяКлиента = ДанныеПСЦ.ДоверенностьЗаРуководителяНаименование;
		//Евросиб Коханенко Н.А. 30.05.2025 )) #110586 
		Иначе
			ОбластьПодвал.Параметры.ФИОРуководителяКлиента = НашРуководитель.ФИОРус;
		КонецЕсли; 
		
		Если ВыводитьФаксимиле Тогда
			//Евросиб Коханенко Н.А. 30.05.2025 (( #110586 
			//Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя) Тогда
			//	ДанныеКартинкиПодпись = РаботаСФайлами.ДанныеФайла(Док.ДоверенностьЗаРуководителя.ФайлФаксимиль);
			//	ДанныеКартинкиПечать = РаботаСФайлами.ДанныеФайла(Док.ДоверенностьЗаРуководителя.ФайлПечать);
			//Иначе     
			//	ДанныеКартинкиПодпись = РаботаСФайлами.ДанныеФайла(НашРуководитель.ФайлФаксимиль);
			//	ДанныеКартинкиПечать = РаботаСФайлами.ДанныеФайла(НашРуководитель.ФайлПечать);
			//КонецЕсли; 
			//ДвоичныеДанныеПодпись = ПолучитьИзВременногоХранилища(ДанныеКартинкиПодпись.СсылкаНаДвоичныеДанныеФайла);
			//ДвоичныеДанныеПечать = ПолучитьИзВременногоХранилища(ДанныеКартинкиПечать.СсылкаНаДвоичныеДанныеФайла);
			Если ЗначениеЗаполнено(ДанныеПСЦ.ДоверенностьЗаРуководителя) Тогда
				ФайлКартинкиПодписи = ДанныеПСЦ.ДоверенностьЗаРуководителяФайлФаксимиль;
				ФайлКартинкиПечати = ДанныеПСЦ.ДоверенностьЗаРуководителяФайлПечать;
			Иначе
				ФайлКартинкиПодписи = НашРуководитель.ФайлФаксимиль;
				ФайлКартинкиПечати = НашРуководитель.ФайлПечать;
			КонецЕсли;
			Если ЗначениеЗаполнено(ФайлКартинкиПодписи) Тогда
				ДанныеКартинкиПодпись = РаботаСФайлами.ДанныеФайла(ФайлКартинкиПодписи);
				ДвоичныеДанныеПодпись = ПолучитьИзВременногоХранилища(ДанныеКартинкиПодпись.СсылкаНаДвоичныеДанныеФайла);
			Иначе
				ДанныеКартинкиПодпись = Неопределено;
				ОбщегоНазначения.СообщитьПользователю("У подписанта не выбран файл с факсимиле подписи.")
			КонецЕсли;
			Если ЗначениеЗаполнено(ФайлКартинкиПечати) Тогда
				ДанныеКартинкиПечать = РаботаСФайлами.ДанныеФайла(ФайлКартинкиПечати);
				ДвоичныеДанныеПечать = ПолучитьИзВременногоХранилища(ДанныеКартинкиПечать.СсылкаНаДвоичныеДанныеФайла);
			Иначе
				ДанныеКартинкиПечать = Неопределено;
				ОбщегоНазначения.СообщитьПользователю("У подписанта не выбран файл с факсимиле печати.")
			КонецЕсли;
			//Евросиб Коханенко Н.А. 30.05.2025 )) #110586 

			Если ЗначениеЗаполнено(ДвоичныеДанныеПодпись) Тогда
				ОбластьПодвал.Рисунки.ПодписьРуководителя.Картинка = Новый Картинка(ДвоичныеДанныеПодпись);
			КонецЕсли;
			Если ЗначениеЗаполнено(ДвоичныеДанныеПечать) Тогда
				ОбластьПодвал.Рисунки.Печать.Картинка = Новый Картинка(ДвоичныеДанныеПечать);
			КонецЕсли;
		КонецЕсли;
		
		Результат.Вывести(ОбластьПодвал);  
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции //Евросиб Коханенко Н.А. 30.11.2024 )) #89893

Функция ПолучитьТабДокЛистаСогласования(РецензОбъект, ТекущийЦикл = 1) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет = ПолучитьМакет("ЛистСогласованияРеестрРазногласий");
	
	ШифрСеанса = Строка(Новый УникальныйИдентификатор);
	ИмяДокумента = Строка(РецензОбъект);
	ИмяДокументаЛС = ИмяДокумента;
	ИмяДокументаЛР = ИмяДокумента;
	Если ТипЗнч(РецензОбъект) = Тип("ДокументСсылка.ПСЦ") Тогда
		ДанныеПСЦ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РецензОбъект, "ВидПСЦ, НомерПСЦ, КлиентскийНомер, Контрагент, Номер, ДатаПСЦ");
		Префикс = ?(ЗначениеЗаполнено(ДанныеПСЦ.ВидПСЦ), Строка(ДанныеПСЦ.ВидПСЦ) + ": ", "ПК: ");
		НомерПСЦСтрока = ?(ЗначениеЗаполнено(ДанныеПСЦ.НомерПСЦ), Символы.ПС+Строка(ДанныеПСЦ.НомерПСЦ), "");
		КлиентскийНомерСтрока = ?(ЗначениеЗаполнено(ДанныеПСЦ.КлиентскийНомер), Символы.ПС+Строка(ДанныеПСЦ.КлиентскийНомер), "");
		Если НомерПСЦСтрока = КлиентскийНомерСтрока Тогда
			КлиентскийНомерСтрока = "";
		КонецЕсли;
		ИмяДокументаЛС = Префикс + ДанныеПСЦ.Контрагент + " №" + ДанныеПСЦ.Номер
						+ " от " + Формат(ДанныеПСЦ.ДатаПСЦ, "ДФ=dd.MM.yy") + НомерПСЦСтрока + КлиентскийНомерСтрока;
	КонецЕсли;
	ДатаПечати = ТекущаяДата();
	
	ШапкаЛС = Макет.ПолучитьОбласть("ШапкаЛС");
	ШапкаЛС.Параметры.ИмяДокумента = ИмяДокументаЛС;
	ШапкаЛС.Параметры.ДатаПечати = Формат(ДатаПечати, "ДФ='ЧЧ:мм дд.ММ.гг'");
	ТабДок.Вывести(ШапкаЛС);
	
	СчЭлементов = 0;
	
	ИмяМетаданных = РецензОбъект.Метаданные().Имя;
	ИмяКорняМД = ?(ИмяМетаданных = "ДоговорыКонтрагентов", "Справочник", "Документ");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", РецензОбъект);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостоянияДокумента.Состояние КАК Состояние,
	|	СостоянияДокумента.Исполнитель КАК Исполнитель,
	|	СостоянияДокумента.СтатусСогласования КАК СтатусСогласования,
	|	СостоянияДокумента.НачалоРаботы КАК НачалоРаботы,
	|	СостоянияДокумента.ЗавершениеРаботы КАК ЗавершениеРаботы,
	|	СостоянияДокумента.ПричинаОтказа КАК ПричинаОтказа,
	|	СостоянияДокумента.АвтоматическоеСогласование КАК АвтоматическоеСогласование
	|ИЗ
	|	"+ИмяКорняМД+"."+ИмяМетаданных+".Состояния КАК СостоянияДокумента
	|ГДЕ
	|	СостоянияДокумента.Ссылка = &Ссылка
	|	И СостоянияДокумента.Состояние.Согласование";
	
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		СчЭлементов = СчЭлементов + 1;
		НСтр = Макет.ПолучитьОбласть("СтрокаЛС");
		НСтр.Параметры.Дата = Формат(Ответ.ЗавершениеРаботы, "ДФ='ЧЧ:мм дд.ММ.гг'");
		НСтр.Параметры.Этап = Ответ.Состояние;
		НСтр.Параметры.Согласующий = Ответ.Исполнитель;
		НСтр.Параметры.Результат = Ответ.СтатусСогласования;
		НСтр.Параметры.ПричинаОтказа = Ответ.ПричинаОтказа;
		НСтр.Параметры.АвтоматическоеСогласование = Формат(Ответ.АвтоматическоеСогласование, "БЛ=Нет; БИ=Да");
		ТабДок.Вывести(НСтр);
	КонецЦикла;
	
	ПодвалЛС = Макет.ПолучитьОбласть("ПодвалЛС");
	ПодвалЛС.Параметры.КоличествоСтрок = СчЭлементов;
	ПодвалЛС.Параметры.шифр = ШифрСеанса;
	ТабДок.Вывести(ПодвалЛС);
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Рецензирование.РецензОбъект КАК РецензОбъект,
	               |	Рецензирование.Рецензент КАК Рецензент,
	               |	Рецензирование.ТаймШтамп КАК ТаймШтамп,
	               |	Рецензирование.ИсходныйТекст КАК ИсходныйТекст,
	               |	Рецензирование.НоваяРедакция КАК НоваяРедакция,
	               |	Рецензирование.Комментарии КАК Комментарии,
	               |	Рецензирование.ОтветИнициатора КАК ОтветИнициатора
	               |ИЗ
	               |	РегистрСведений.Рецензирование КАК Рецензирование
	               |ГДЕ
	               |	(Рецензирование.РецензОбъект В
	               |				(ВЫБРАТЬ
	               |					СведенияОФайлах.Файл КАК Файл
	               |				ИЗ
	               |					РегистрСведений.СведенияОФайлах КАК СведенияОФайлах
	               |				ГДЕ
	               |					СведенияОФайлах.ВладелецФайла = &ВладелецФайла
	               |					И НЕ СведенияОФайлах.ПометкаУдаления
	               |					И НЕ СведенияОФайлах.Служебный)
	               |			ИЛИ Рецензирование.РецензОбъект = &ВладелецФайла)
	               |	И Рецензирование.ЦиклСогласования = &ЦиклСогласования
	               |ИТОГИ ПО
	               |	РецензОбъект";
	Запрос.УстановитьПараметр("ВладелецФайла", РецензОбъект);
	Запрос.УстановитьПараметр("ЦиклСогласования", ТекущийЦикл);
	Ответ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Ответ.Следующий() Цикл
		
		ШапкаЛР = Макет.ПолучитьОбласть("ШапкаЛР");
		ШапкаЛР.Параметры.ИмяДокумента = ИмяДокументаЛР;
		ШапкаЛР.Параметры.ИмяФайла = Ответ.РецензОбъект;
		
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		Табдок.Вывести(ШапкаЛР);
		СчЭлементов = 0;
		
		ПодОтвет = Ответ.Выбрать();
		Пока ПодОтвет.Следующий() Цикл
			
			СчЭлементов = СчЭлементов + 1;
			НСтр = Макет.ПолучитьОбласть("СтрокаЛР");
			НСтр.Параметры.Дата = Формат(ПодОтвет.ТаймШтамп, "ДФ='ЧЧ:мм дд.ММ.гг'");
			НСтр.Параметры.Согласующий = ПодОтвет.Рецензент;
			НСтр.Параметры.Исх = ПодОтвет.ИсходныйТекст;
			НСтр.Параметры.Нов = ПодОтвет.НоваяРедакция;
			НСтр.Параметры.Комментарий = ПодОтвет.Комментарии;
			НСтр.Параметры.ОтветИнииатора = ПодОтвет.ОтветИнициатора;
			ТабДок.Вывести(НСтр);
			
		КонецЦикла;
		
		ПодвалЛР = Макет.ПолучитьОбласть("ПодвалЛР");
		ПодвалЛР.Параметры.КоличествоСтрок = СчЭлементов;
		ПодвалЛР.Параметры.шифр = ШифрСеанса;
		ТабДок.Вывести(ПодвалЛР);
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

Процедура СверитьУслугиПротоколаСНормативнымиСтавками(Протокол, ВызовИзФормы = Ложь) Экспорт
	
	Если Протокол.Услуги.Количество() > 0 Тогда
		
		ПроверкаНеОсуществлялась = Перечисления.РезультатыПроверки.НеОсуществлялась;
		ПроверкаПройдена = Перечисления.РезультатыПроверки.Пройдена;
		ПроверкаНеПройдена = Перечисления.РезультатыПроверки.НеПройдена;
		КлючНормативнойСтавкиПустаяСсылка = Справочники.КлючиАналитикиСтрокПротокола.ПустаяСсылка();
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.Ссылка КАК Ссылка,
		|	ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.НачалоДействия КАК НачалоДействия
		|ИЗ
		|	Документ.ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков КАК ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков
		|ГДЕ
		|	ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.НачалоДействия <= &НачалоДействия
		|	И (ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.ДействуетДоСогласованияНовыхУсловий
		|			ИЛИ ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.ОкончаниеДействия >= &НачалоДействия)
		|	И ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.Проведен
		|	И ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.СтатусДокумента = &СтатусДокументаСогласован
		|	И ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.ВидУслугПоставщика = &ВидУслугПоставщика
		|
		|УПОРЯДОЧИТЬ ПО
		|	НачалоДействия УБЫВ,
		|	ПротоколСНормативнымиСтавкамиНаУслугиПоставщиков.МоментВремени УБЫВ";
		
		Запрос.УстановитьПараметр("ДатаПротокола", Протокол.ДатаПСЦ);
		Запрос.УстановитьПараметр("НачалоДействия", Протокол.НачалоДействия);
		Запрос.УстановитьПараметр("ВидУслугПоставщика", Протокол.ВидУслугПоставщика);
		
		СтатусДокументаСогласован = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний;
		Запрос.УстановитьПараметр("СтатусДокументаСогласован", СтатусДокументаСогласован);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			ДействующийПротоколНормативныхСтавок = Выборка.Ссылка;
			
			НормативныеСтавки = ПолучитьНормативныеСтавкиДляУслугПротокола(Протокол);
			
			НомераСтрокБезНайденныхНормативов = Новый Массив;
			НомераСтрокСНеподошедшимиНормативами = Новый Массив;
			Для Каждого СтрокаУслуги Из Протокол.Услуги Цикл
				
				КоличествоПройденныхПроверок = 0;
				КоличествоНепройденныхПроверок = 0;
				КоличествоНевыполненныхПроверок = 0;
				
				Если ВызовИзФормы Тогда
					СтрокаУслуги.КлючиНеподошедшихНормативныхСтавок.Очистить();
				КонецЕсли;
				
				СтрокиКритериев = Протокол.КритерииУслуг.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", СтрокаУслуги.ИдентификаторСтрокиУслуг));
				Для Каждого СтрокаКритерия Из СтрокиКритериев Цикл
					
					НормативыНеПодошедшиеПоНормеПользования = Новый Массив;
					ПроверкаСтрокиПройдена = Неопределено;
					НайденныеНормативы = НормативныеСтавки.НайтиСтроки(Новый Структура("НомерСтрокиКритериев", СтрокаКритерия.НомерСтроки));
					Если ЗначениеЗаполнено(НайденныеНормативы) Тогда						
						
						Для Каждого Норматив Из НайденныеНормативы Цикл					
							Если ЗначениеЗаполнено(Норматив.КритерийНорматива) Тогда
								Если Норматив.НормаПользования = 0 
										Или (СтрокаУслуги.НормаПользования <> 0 И СтрокаУслуги.НормаПользования <= Норматив.НормаПользования) Тогда
									Если СтрокаУслуги.СтоимостьБезНДС <= Норматив.НормативСтоимостьБезНДС Тогда
										ПроверкаСтрокиПройдена = Истина;
									Иначе
										ПроверкаСтрокиПройдена = Ложь;
										Прервать;
									КонецЕсли;
								Иначе
									НормативыНеПодошедшиеПоНормеПользования.Добавить(Норматив);
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
						
						Если ПроверкаСтрокиПройдена = Неопределено Тогда
							Если ВызовИзФормы И ЗначениеЗаполнено(НормативыНеПодошедшиеПоНормеПользования) Тогда
								Для Каждого Стр Из НормативыНеПодошедшиеПоНормеПользования Цикл
									Если ЗначениеЗаполнено(Стр.ТипоразмерКТКПредставление) Тогда
										Представление = СтрШаблон("Нормативная ставка для %1 с нормой пользования %2 (Протокол:%3)", Стр.ТипоразмерКТКПредставление, Стр.НормаПользования, Стр.РегистраторНомер);
									Иначе
										Представление = СтрШаблон("Нормативная ставка с нормой пользования %1 (Протокол%2)", Стр.НормаПользования, Стр.РегистраторНомер);
									КонецЕсли;
									СтрокаУслуги.КлючиНеподошедшихНормативныхСтавок.Добавить(Стр.КлючНормативнойСтавки, Представление);
									НомераСтрокСНеподошедшимиНормативами.Добавить(СтрокаУслуги.НомерСтроки);
								КонецЦикла;
							КонецЕсли;
							СтрокаКритерия.КлючНормативнойСтавки = КлючНормативнойСтавкиПустаяСсылка;
						Иначе
							СтрокаКритерия.КлючНормативнойСтавки = Норматив.КлючНормативнойСтавки;
						КонецЕсли;
						
					Иначе
						СтрокаКритерия.КлючНормативнойСтавки = КлючНормативнойСтавкиПустаяСсылка;
						НомераСтрокБезНайденныхНормативов.Добавить(СтрокаУслуги.НомерСтроки);
					КонецЕсли;
					
					Если ПроверкаСтрокиПройдена = Истина Тогда
						КоличествоПройденныхПроверок = КоличествоПройденныхПроверок + 1;
					ИначеЕсли ПроверкаСтрокиПройдена = Ложь Тогда
						КоличествоНепройденныхПроверок = КоличествоНепройденныхПроверок + 1;
					Иначе
						КоличествоНевыполненныхПроверок = КоличествоНевыполненныхПроверок + 1;
					КонецЕсли;
					
				КонецЦикла;
				
				Если КоличествоНепройденныхПроверок > 0 Тогда
					СтрокаУслуги.ПроверкаСтавок = ПроверкаНеПройдена;
				ИначеЕсли КоличествоНевыполненныхПроверок > 0 Тогда
					СтрокаУслуги.ПроверкаСтавок = ПроверкаНеОсуществлялась;
				ИначеЕсли КоличествоПройденныхПроверок > 0 Тогда
					СтрокаУслуги.ПроверкаСтавок = ПроверкаПройдена;
				Иначе
					СтрокаУслуги.ПроверкаСтавок = ПроверкаНеОсуществлялась;
				КонецЕсли;
				
			КонецЦикла;
			
			Если ЗначениеЗаполнено(НомераСтрокСНеподошедшимиНормативами) Тогда				
				ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", НомераСтрокСНеподошедшимиНормативами[0], "КлючиНормативныхСтавокСтрокой");				
				НомераСтрокСНеподошедшимиНормативами = ОбщегоНазначенияКлиентСервер.СвернутьМассив(НомераСтрокСНеподошедшимиНормативами);
				НомераСтрок = СтрСоединить(НомераСтрокСНеподошедшимиНормативами, ", ");				
				ТекстСообщения = СтрШаблон("По строкам № %1 не найдено соответствия, т.к. отличается период предоставления от нормы пользования в нормативной ставке.", НомераСтрок);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Протокол.Ссылка, ПутьКПолюТЧ, "Объект");				
			КонецЕсли;
			
			Если ВызовИзФормы И ЗначениеЗаполнено(НомераСтрокБезНайденныхНормативов) Тогда
				ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", НомераСтрокБезНайденныхНормативов[0], "КлючиНормативныхСтавокСтрокой");
				НомераСтрокБезНайденныхНормативов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(НомераСтрокБезНайденныхНормативов);
				НомераСтрок = СтрСоединить(НомераСтрокБезНайденныхНормативов, ", ");
				ШаблонСообщенияСАктуальнымПротоколом = "По строкам № %1 не найдено соответствия, т.к. не найден актуальный тариф на этот период.";				
				ТекстСообщения = СтрШаблон(ШаблонСообщенияСАктуальнымПротоколом, НомераСтрок);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Протокол.Ссылка, ПутьКПолюТЧ, "Объект");
				//ФорматированныйТекст = Новый ФорматированнаяСтрока(ТекстСообщения,, WebЦвета.Красный,, ПолучитьНавигационнуюСсылку(ДействующийПротоколНормативныхСтавок));
				//ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДействующийПротоколНормативныхСтавок);
			КонецЕсли;
			
		Иначе
			
			
			Для Каждого Стр Из Протокол.Услуги Цикл
				Стр.ПроверкаСтавок = ПроверкаНеОсуществлялась;
			КонецЦикла;
			
			Для Каждого СтрокаКритерия Из Протокол.КритерииУслуг Цикл
				СтрокаКритерия.КлючНормативнойСтавки = КлючНормативнойСтавкиПустаяСсылка;
			КонецЦикла;
			
			Если ВызовИзФормы Тогда
				ОбщегоНазначения.СообщитьПользователю("На период действия ПСЦ Поставщика не найден Протокол с нормативными ставками на услуги поставщика.");		
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьНормативныеСтавкиДляУслугПротокола(Протокол) Экспорт
	
	ПустаяДата = '00010101';
	ЛокацияПустаяСсылка = Справочники.Локации.ПустаяСсылка();
	
	ТипЛокацииГород = Справочники.ТипыЛокаций.НаселенныйПункт;
	ТипЛокацииСтрана = Справочники.ТипыЛокаций.Страна;
	
	ТипИерархииГород = Перечисления.ТипыИерархииЛокации.НаселенныйПункт;
	ТипИерархииСтрана = Перечисления.ТипыИерархииЛокации.Страна;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ПСЦПоставщикаУслуги.Валюта КАК Валюта,
	|	ПСЦПоставщикаУслуги.Номенклатура КАК Номенклатура,
	|	ПСЦПоставщикаУслуги.ВидСобственности КАК ВидСобственности,
	|	ПСЦПоставщикаУслуги.ПунктОтправления КАК ПунктОтправления,
	|	ПСЦПоставщикаУслуги.ПунктОтправленияГород КАК ПунктОтправленияГород,
	|	ПСЦПоставщикаУслуги.ПунктОтправленияСтрана КАК ПунктОтправленияСтрана,
	|	ПСЦПоставщикаУслуги.ПунктНазначения КАК ПунктНазначения,
	|	ПСЦПоставщикаУслуги.ПунктНазначенияГород КАК ПунктНазначенияГород,
	|	ПСЦПоставщикаУслуги.ПунктНазначенияСтрана КАК ПунктНазначенияСтрана,
	|	ПСЦПоставщикаУслуги.НормаПользования КАК НормаПользования,
	|	ПСЦПоставщикаУслуги.СтоимостьСНДС КАК СтоимостьСНДС,
	|	ПСЦПоставщикаУслуги.СтоимостьБезНДС КАК СтоимостьБезНДС
	|ПОМЕСТИТЬ ТЧУслуги
	|ИЗ
	|	Документ.ПСЦПоставщика.Услуги КАК ПСЦПоставщикаУслуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПСЦПоставщикаКритерииУслуг.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ПСЦПоставщикаКритерииУслуг.ТипоразмерКТК КАК ТипоразмерКТК,
	|	ПСЦПоставщикаКритерииУслуг.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ТЧКритерииУслуг
	|ИЗ
	|	Документ.ПСЦПоставщика.КритерииУслуг КАК ПСЦПоставщикаКритерииУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПСЦПоставщикаУслуги.СтоимостьСНДС КАК СтоимостьСНДС,
	|	ПСЦПоставщикаУслуги.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	ПСЦПоставщикаУслуги.Валюта КАК Валюта,
	|	ПСЦПоставщикаУслуги.Номенклатура КАК Номенклатура,
	|	ПСЦПоставщикаУслуги.ВидСобственности КАК ВидСобственности,
	|	ПСЦПоставщикаУслуги.ПунктОтправления КАК ПунктОтправления,
	|	ПСЦПоставщикаУслуги.ПунктОтправленияГород КАК ПунктОтправленияГород,
	|	ПСЦПоставщикаУслуги.ПунктОтправленияСтрана КАК ПунктОтправленияСтрана,
	|	ПСЦПоставщикаУслуги.ПунктНазначения КАК ПунктНазначения,
	|	ПСЦПоставщикаУслуги.ПунктНазначенияГород КАК ПунктНазначенияГород,
	|	ПСЦПоставщикаУслуги.ПунктНазначенияСтрана КАК ПунктНазначенияСтрана,
	|	ПСЦПоставщикаУслуги.НормаПользования КАК НормаПользования,
	|	ПСЦПоставщикаКритерииУслуг.ТипоразмерКТК КАК ТипоразмерКТК,
	|	ПСЦПоставщикаКритерииУслуг.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ТЧПротоколаПоставщика
	|ИЗ
	|	ТЧУслуги КАК ПСЦПоставщикаУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЧКритерииУслуг КАК ПСЦПоставщикаКритерииУслуг
	|		ПО ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг = ПСЦПоставщикаКритерииУслуг.ИдентификаторСтрокиУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧПротоколаПоставщика.НомерСтроки КАК НомерСтроки,
	|	ТЧПротоколаПоставщика.СтоимостьСНДС КАК СтоимостьСНДС,
	|	ТЧПротоколаПоставщика.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	КритерииНормативов.Ссылка КАК КритерииНорматива,
	|	ТЧПротоколаПоставщика.Валюта КАК ВалютаПротокола,
	|	КритерииНормативов.Валюта КАК ВалютаНорматива,
	|	КритерииНормативов.НормаПользования КАК НормаПользования,
	|	КритерииНормативов.ТипоразмерКТК.Представление КАК ТипоразмерКТКПредставление
	|ПОМЕСТИТЬ ПодобранныеКритерииНормативов
	|ИЗ
	|	ТЧПротоколаПоставщика КАК ТЧПротоколаПоставщика
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КритерииУслугПоставщиков КАК КритерииНормативов
	|		ПО ТЧПротоколаПоставщика.Номенклатура = КритерииНормативов.Номенклатура
	|			И ТЧПротоколаПоставщика.ТипоразмерКТК = КритерииНормативов.ТипоразмерКТК
	|			И ТЧПротоколаПоставщика.ВидСобственности = КритерииНормативов.ВидСобственности
	|			И (КритерииНормативов.ВидУслуги = &ВидУслуг)
	|			И (КритерииНормативов.НормативныйПоказатель)
	|			И (ВЫБОР
	|				КОГДА КритерииНормативов.НормаПользования = 0
	|					ТОГДА ИСТИНА
	|				КОГДА ТЧПротоколаПоставщика.НормаПользования > 0
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодобранныеКритерииНормативов.НомерСтроки КАК НомерСтрокиКритериев,
	|	ПодобранныеКритерииНормативов.СтоимостьСНДС КАК СтоимостьСНДС,
	|	ПодобранныеКритерииНормативов.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	ПодобранныеКритерииНормативов.КритерииНорматива КАК КритерийНорматива,
	|	ТарифыПоставщиковСрезПоследних.Регистратор КАК ПротоколНормСтавок,
	|	ТарифыПоставщиковСрезПоследних.СтоимостьСНДС КАК НормативСтоимостьСНДС,
	|	ТарифыПоставщиковСрезПоследних.СтоимостьБезНДС КАК НормативСтоимостьБезНДС,
	|	ПодобранныеКритерииНормативов.ВалютаПротокола КАК ВалютаПротокола,
	|	ПодобранныеКритерииНормативов.ВалютаНорматива КАК ВалютаНорматива,
	|	ТарифыПоставщиковСрезПоследних.КлючАналитикиСтрокиПротокола КАК КлючНормативнойСтавки,
	|	ПодобранныеКритерииНормативов.НормаПользования КАК НормаПользования,
	|	ТарифыПоставщиковСрезПоследних.Регистратор КАК Регистратор,
	|	ТарифыПоставщиковСрезПоследних.Регистратор.Номер КАК РегистраторНомер,
	|	ПодобранныеКритерииНормативов.ТипоразмерКТКПредставление КАК ТипоразмерКТКПредставление
	|ПОМЕСТИТЬ ДействующиеНормативы
	|ИЗ
	|	ПодобранныеКритерииНормативов КАК ПодобранныеКритерииНормативов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыПоставщиков.СрезПоследних(
	|				&НачалоДействия,
	|				Критерий В
	|						(ВЫБРАТЬ
	|							ПодобранныеКритерииНормативов.КритерииНорматива КАК КритерииНорматива
	|						ИЗ
	|							ПодобранныеКритерииНормативов КАК ПодобранныеКритерииНормативов)
	|					И Статус = &СогласованПоПСЦ) КАК ТарифыПоставщиковСрезПоследних
	|		ПО ПодобранныеКритерииНормативов.КритерииНорматива = ТарифыПоставщиковСрезПоследних.Критерий
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ТарифыПоставщиковСрезПоследних.ОкончаниеДействия = &ПустаяДата
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ТарифыПоставщиковСрезПоследних.ОкончаниеДействия >= &НачалоДействия
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧПротоколаПоставщика.НомерСтроки КАК НомерСтрокиКритериев,
	|	ВЫБОР
	|		КОГДА НЕ ТЧПротоколаПоставщика.ПунктОтправления.Ссылка ЕСТЬ NULL
	|			ТОГДА ТЧПротоколаПоставщика.ПунктОтправления
	|		КОГДА НЕ ТЧПротоколаПоставщика.ПунктОтправленияГород.Ссылка ЕСТЬ NULL
	|			ТОГДА ТЧПротоколаПоставщика.ПунктОтправленияГород
	|		КОГДА НЕ ТЧПротоколаПоставщика.ПунктОтправленияСтрана.Ссылка ЕСТЬ NULL
	|			ТОГДА ТЧПротоколаПоставщика.ПунктОтправленияСтрана
	|		ИНАЧЕ &ЛокацияПустаяСсылка
	|	КОНЕЦ КАК ПунктОтправления,
	|	ВЫБОР
	|		КОГДА НЕ ТЧПротоколаПоставщика.ПунктНазначения.Ссылка ЕСТЬ NULL
	|			ТОГДА ТЧПротоколаПоставщика.ПунктНазначения
	|		КОГДА НЕ ТЧПротоколаПоставщика.ПунктНазначенияГород.Ссылка ЕСТЬ NULL
	|			ТОГДА ТЧПротоколаПоставщика.ПунктНазначенияГород
	|		КОГДА НЕ ТЧПротоколаПоставщика.ПунктНазначенияСтрана.Ссылка ЕСТЬ NULL
	|			ТОГДА ТЧПротоколаПоставщика.ПунктНазначенияСтрана
	|		ИНАЧЕ &ЛокацияПустаяСсылка
	|	КОНЕЦ КАК ПунктНазначения
	|ПОМЕСТИТЬ КритерииПротокола
	|ИЗ
	|	ТЧПротоколаПоставщика КАК ТЧПротоколаПоставщика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КритерииПротокола.НомерСтрокиКритериев КАК НомерСтрокиКритериев,
	|	КритерииПротокола.ПунктОтправления КАК ПунктОтправления,
	|	ЕСТЬNULL(МультилокацииЛокации.Локация, КритерииПротокола.ПунктОтправления) КАК Локация
	|ПОМЕСТИТЬ ЛокацииОтправления
	|ИЗ
	|	КритерииПротокола КАК КритерииПротокола
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ПО КритерииПротокола.ПунктОтправления = МультилокацииЛокации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛокацииОтправления.НомерСтрокиКритериев КАК НомерСтрокиКритериев,
	|	ЛокацииОтправления.ПунктОтправления КАК ПунктОтправления,
	|	ВЫБОР
	|		КОГДА ЛокацииОтправления.Локация.Тип = &ТипЛокацииГород
	|				ИЛИ ЛокацииОтправления.Локация.Тип = &ТипЛокацииСтрана
	|			ТОГДА &ЛокацияПустаяСсылка
	|		ИНАЧЕ ЛокацииОтправления.Локация
	|	КОНЕЦ КАК Локация,
	|	ВЫБОР
	|		КОГДА ЛокацииОтправления.Локация.Тип = &ТипЛокацииГород
	|			ТОГДА ЛокацииОтправления.Локация
	|		ИНАЧЕ ЕСТЬNULL(Города.ЛокацияВышестоящегоУровня, &ЛокацияПустаяСсылка)
	|	КОНЕЦ КАК Город,
	|	ВЫБОР
	|		КОГДА ЛокацииОтправления.Локация.Тип = &ТипЛокацииСтрана
	|			ТОГДА ЛокацииОтправления.Локация
	|		ИНАЧЕ ЕСТЬNULL(Страны.ЛокацияВышестоящегоУровня, &ЛокацияПустаяСсылка)
	|	КОНЕЦ КАК Страна
	|ПОМЕСТИТЬ ЛокацииОтправленияСИерархией
	|ИЗ
	|	ЛокацииОтправления КАК ЛокацииОтправления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК Города
	|		ПО ЛокацииОтправления.Локация = Города.Локация
	|			И (Города.ТипИерархии = &ТипИерархииГород)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК Страны
	|		ПО ЛокацииОтправления.Локация = Страны.Локация
	|			И (Страны.ТипИерархии = &ТипИерархииСтрана)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КритерииПротокола.НомерСтрокиКритериев КАК НомерСтрокиКритериев,
	|	КритерииПротокола.ПунктНазначения КАК ПунктНазначения,
	|	ЕСТЬNULL(МультилокацииЛокации.Локация, КритерииПротокола.ПунктНазначения) КАК Локация
	|ПОМЕСТИТЬ ЛокацииНазначения
	|ИЗ
	|	КритерииПротокола КАК КритерииПротокола
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ПО КритерииПротокола.ПунктНазначения = МультилокацииЛокации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛокацииНазначения.НомерСтрокиКритериев КАК НомерСтрокиКритериев,
	|	ЛокацииНазначения.ПунктНазначения КАК ПунктНазначения,
	|	ВЫБОР
	|		КОГДА ЛокацииНазначения.Локация.Тип = &ТипЛокацииГород
	|				ИЛИ ЛокацииНазначения.Локация.Тип = &ТипЛокацииСтрана
	|			ТОГДА &ЛокацияПустаяСсылка
	|		ИНАЧЕ ЛокацииНазначения.Локация
	|	КОНЕЦ КАК Локация,
	|	ВЫБОР
	|		КОГДА ЛокацииНазначения.Локация.Тип = &ТипЛокацииГород
	|			ТОГДА ЛокацииНазначения.Локация
	|		ИНАЧЕ ЕСТЬNULL(Города.ЛокацияВышестоящегоУровня, &ЛокацияПустаяСсылка)
	|	КОНЕЦ КАК Город,
	|	ВЫБОР
	|		КОГДА ЛокацииНазначения.Локация.Тип = &ТипЛокацииСтрана
	|			ТОГДА ЛокацииНазначения.Локация
	|		ИНАЧЕ ЕСТЬNULL(Страны.ЛокацияВышестоящегоУровня, &ЛокацияПустаяСсылка)
	|	КОНЕЦ КАК Страна
	|ПОМЕСТИТЬ ЛокацииНазначенияСИерархией
	|ИЗ
	|	ЛокацииНазначения КАК ЛокацииНазначения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК Города
	|		ПО ЛокацииНазначения.Локация = Города.Локация
	|			И (Города.ТипИерархии = &ТипИерархииГород)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК Страны
	|		ПО ЛокацииНазначения.Локация = Страны.Локация
	|			И (Страны.ТипИерархии = &ТипИерархииСтрана)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДействующиеНормативы.НомерСтрокиКритериев КАК НомерСтрокиКритериев,
	|	ДействующиеНормативы.КритерийНорматива КАК КритерийНорматива,
	|	ВЫБОР
	|		КОГДА НЕ ДействующиеНормативы.КритерийНорматива.ПунктОтправления.Ссылка ЕСТЬ NULL
	|			ТОГДА ДействующиеНормативы.КритерийНорматива.ПунктОтправления
	|		КОГДА НЕ ДействующиеНормативы.КритерийНорматива.ПунктОтправленияГород.Ссылка ЕСТЬ NULL
	|			ТОГДА ДействующиеНормативы.КритерийНорматива.ПунктОтправленияГород
	|		КОГДА НЕ ДействующиеНормативы.КритерийНорматива.ПунктОтправленияСтрана.Ссылка ЕСТЬ NULL
	|			ТОГДА ДействующиеНормативы.КритерийНорматива.ПунктОтправленияСтрана
	|		ИНАЧЕ &ЛокацияПустаяСсылка
	|	КОНЕЦ КАК ПунктОтправления,
	|	ВЫБОР
	|		КОГДА НЕ ДействующиеНормативы.КритерийНорматива.ПунктНазначения.Ссылка ЕСТЬ NULL
	|			ТОГДА ДействующиеНормативы.КритерийНорматива.ПунктНазначения
	|		КОГДА НЕ ДействующиеНормативы.КритерийНорматива.ПунктНазначенияГород.Ссылка ЕСТЬ NULL
	|			ТОГДА ДействующиеНормативы.КритерийНорматива.ПунктНазначенияГород
	|		КОГДА НЕ ДействующиеНормативы.КритерийНорматива.ПунктНазначенияСтрана.Ссылка ЕСТЬ NULL
	|			ТОГДА ДействующиеНормативы.КритерийНорматива.ПунктНазначенияСтрана
	|		ИНАЧЕ &ЛокацияПустаяСсылка
	|	КОНЕЦ КАК ПунктНазначения
	|ПОМЕСТИТЬ КритерииНормативов
	|ИЗ
	|	ДействующиеНормативы КАК ДействующиеНормативы
	|ГДЕ
	|	ВЫБОР
	|			КОГДА НЕ ДействующиеНормативы.КритерийНорматива.ПунктОтправления.Ссылка ЕСТЬ NULL
	|				ТОГДА ДействующиеНормативы.КритерийНорматива.ПунктОтправления
	|			КОГДА НЕ ДействующиеНормативы.КритерийНорматива.ПунктОтправленияГород.Ссылка ЕСТЬ NULL
	|				ТОГДА ДействующиеНормативы.КритерийНорматива.ПунктОтправленияГород
	|			КОГДА НЕ ДействующиеНормативы.КритерийНорматива.ПунктОтправленияСтрана.Ссылка ЕСТЬ NULL
	|				ТОГДА ДействующиеНормативы.КритерийНорматива.ПунктОтправленияСтрана
	|			ИНАЧЕ &ЛокацияПустаяСсылка
	|		КОНЕЦ <> &ЛокацияПустаяСсылка
	|	И ВЫБОР
	|			КОГДА НЕ ДействующиеНормативы.КритерийНорматива.ПунктНазначения.Ссылка ЕСТЬ NULL
	|				ТОГДА ДействующиеНормативы.КритерийНорматива.ПунктНазначения
	|			КОГДА НЕ ДействующиеНормативы.КритерийНорматива.ПунктНазначенияГород.Ссылка ЕСТЬ NULL
	|				ТОГДА ДействующиеНормативы.КритерийНорматива.ПунктНазначенияГород
	|			КОГДА НЕ ДействующиеНормативы.КритерийНорматива.ПунктНазначенияСтрана.Ссылка ЕСТЬ NULL
	|				ТОГДА ДействующиеНормативы.КритерийНорматива.ПунктНазначенияСтрана
	|			ИНАЧЕ &ЛокацияПустаяСсылка
	|		КОНЕЦ <> &ЛокацияПустаяСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КритерииНормативов.НомерСтрокиКритериев КАК НомерСтрокиКритериев,
	|	КритерииНормативов.КритерийНорматива КАК КритерийНорматива,
	|	КритерииНормативов.КритерийНорматива.ПунктОтправления КАК ПунктОтправления,
	|	ЕСТЬNULL(МультилокацииЛокации.Локация, КритерииНормативов.ПунктОтправления) КАК Локация
	|ПОМЕСТИТЬ ЛокацииОтправленияНормативов
	|ИЗ
	|	КритерииНормативов КАК КритерииНормативов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ПО КритерииНормативов.ПунктОтправления = МультилокацииЛокации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛокацииОтправления.НомерСтрокиКритериев КАК НомерСтрокиКритериев,
	|	ЛокацииОтправления.КритерийНорматива КАК КритерийНорматива,
	|	ЛокацииОтправления.ПунктОтправления КАК ПунктОтправления,
	|	ВЫБОР
	|		КОГДА ЛокацииОтправления.Локация.Тип = &ТипЛокацииГород
	|				ИЛИ ЛокацииОтправления.Локация.Тип = &ТипЛокацииСтрана
	|			ТОГДА &ЛокацияПустаяСсылка
	|		ИНАЧЕ ЛокацииОтправления.Локация
	|	КОНЕЦ КАК Локация,
	|	ВЫБОР
	|		КОГДА ЛокацииОтправления.Локация.Тип = &ТипЛокацииГород
	|			ТОГДА ЛокацииОтправления.Локация
	|		ИНАЧЕ ЕСТЬNULL(Города.ЛокацияВышестоящегоУровня, &ЛокацияПустаяСсылка)
	|	КОНЕЦ КАК Город,
	|	ВЫБОР
	|		КОГДА ЛокацииОтправления.Локация.Тип = &ТипЛокацииСтрана
	|			ТОГДА ЛокацииОтправления.Локация
	|		ИНАЧЕ ЕСТЬNULL(Страны.ЛокацияВышестоящегоУровня, &ЛокацияПустаяСсылка)
	|	КОНЕЦ КАК Страна
	|ПОМЕСТИТЬ ЛокацииОтправленияНормативовСИерархией
	|ИЗ
	|	ЛокацииОтправленияНормативов КАК ЛокацииОтправления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК Города
	|		ПО ЛокацииОтправления.Локация = Города.Локация
	|			И (Города.ТипИерархии = &ТипИерархииГород)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК Страны
	|		ПО ЛокацииОтправления.Локация = Страны.Локация
	|			И (Страны.ТипИерархии = &ТипИерархииСтрана)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЛокацииОтправленияСИерархией.НомерСтрокиКритериев КАК НомерСтрокиКритериев,
	|	ЛокацииОтправленияНормативовСИерархией.КритерийНорматива КАК КритерийНорматива
	|ПОМЕСТИТЬ СвязьПоЛокацииОтправления
	|ИЗ
	|	ЛокацииОтправленияСИерархией КАК ЛокацииОтправленияСИерархией
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЛокацииОтправленияНормативовСИерархией КАК ЛокацииОтправленияНормативовСИерархией
	|		ПО (ВЫБОР
	|				КОГДА ЛокацииОтправленияНормативовСИерархией.Локация = &ЛокацияПустаяСсылка
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛокацииОтправленияСИерархией.Локация = ЛокацииОтправленияНормативовСИерархией.Локация
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ЛокацииОтправленияНормативовСИерархией.Город = &ЛокацияПустаяСсылка
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛокацииОтправленияСИерархией.Город = ЛокацииОтправленияНормативовСИерархией.Город
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ЛокацииОтправленияНормативовСИерархией.Страна = &ЛокацияПустаяСсылка
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛокацииОтправленияСИерархией.Страна = ЛокацииОтправленияНормативовСИерархией.Страна
	|			КОНЕЦ)
	|			И ЛокацииОтправленияСИерархией.НомерСтрокиКритериев = ЛокацииОтправленияНормативовСИерархией.НомерСтрокиКритериев
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КритерииНормативов.НомерСтрокиКритериев КАК НомерСтрокиКритериев,
	|	КритерииНормативов.КритерийНорматива КАК КритерийНорматива,
	|	КритерииНормативов.КритерийНорматива.ПунктНазначения КАК ПунктНазначения,
	|	ЕСТЬNULL(МультилокацииЛокации.Локация, КритерииНормативов.ПунктНазначения) КАК Локация
	|ПОМЕСТИТЬ ЛокацииНазначенияНормативов
	|ИЗ
	|	КритерииНормативов КАК КритерииНормативов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ПО КритерииНормативов.ПунктНазначения = МультилокацииЛокации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛокацииНазначения.НомерСтрокиКритериев КАК НомерСтрокиКритериев,
	|	ЛокацииНазначения.КритерийНорматива КАК КритерийНорматива,
	|	ЛокацииНазначения.ПунктНазначения КАК ПунктНазначения,
	|	ВЫБОР
	|		КОГДА ЛокацииНазначения.Локация.Тип = &ТипЛокацииГород
	|				ИЛИ ЛокацииНазначения.Локация.Тип = &ТипЛокацииСтрана
	|			ТОГДА &ЛокацияПустаяСсылка
	|		ИНАЧЕ ЛокацииНазначения.Локация
	|	КОНЕЦ КАК Локация,
	|	ВЫБОР
	|		КОГДА ЛокацииНазначения.Локация.Тип = &ТипЛокацииГород
	|			ТОГДА ЛокацииНазначения.Локация
	|		ИНАЧЕ ЕСТЬNULL(Города.ЛокацияВышестоящегоУровня, &ЛокацияПустаяСсылка)
	|	КОНЕЦ КАК Город,
	|	ВЫБОР
	|		КОГДА ЛокацииНазначения.Локация.Тип = &ТипЛокацииСтрана
	|			ТОГДА ЛокацииНазначения.Локация
	|		ИНАЧЕ ЕСТЬNULL(Страны.ЛокацияВышестоящегоУровня, &ЛокацияПустаяСсылка)
	|	КОНЕЦ КАК Страна
	|ПОМЕСТИТЬ ЛокацииНазначенияНормативовСИерархией
	|ИЗ
	|	ЛокацииНазначенияНормативов КАК ЛокацииНазначения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК Города
	|		ПО ЛокацииНазначения.Локация = Города.Локация
	|			И (Города.ТипИерархии = &ТипИерархииГород)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК Страны
	|		ПО ЛокацииНазначения.Локация = Страны.Локация
	|			И (Страны.ТипИерархии = &ТипИерархииСтрана)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЛокацииНазначенияСИерархией.НомерСтрокиКритериев КАК НомерСтрокиКритериев,
	|	ЛокацииНазначенияНормативовСИерархией.КритерийНорматива КАК КритерийНорматива
	|ПОМЕСТИТЬ СвязьПоЛокацииНазначения
	|ИЗ
	|	ЛокацииНазначенияСИерархией КАК ЛокацииНазначенияСИерархией
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЛокацииНазначенияНормативовСИерархией КАК ЛокацииНазначенияНормативовСИерархией
	|		ПО (ВЫБОР
	|				КОГДА ЛокацииНазначенияНормативовСИерархией.Локация = &ЛокацияПустаяСсылка
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛокацииНазначенияСИерархией.Локация = ЛокацииНазначенияНормативовСИерархией.Локация
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ЛокацииНазначенияНормативовСИерархией.Город = &ЛокацияПустаяСсылка
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛокацииНазначенияСИерархией.Город = ЛокацииНазначенияНормативовСИерархией.Город
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА ЛокацииНазначенияНормативовСИерархией.Страна = &ЛокацияПустаяСсылка
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛокацииНазначенияСИерархией.Страна = ЛокацииНазначенияНормативовСИерархией.Страна
	|			КОНЕЦ)
	|			И ЛокацииНазначенияСИерархией.НомерСтрокиКритериев = ЛокацииНазначенияНормативовСИерархией.НомерСтрокиКритериев
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	|	КурсыВалютСрезПоследних.Курс КАК Курс,
	|	КурсыВалютСрезПоследних.Кратность КАК Кратность
	|ПОМЕСТИТЬ КурсыВалют
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&НачалоДействия, ) КАК КурсыВалютСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДействующиеНормативы.НомерСтрокиКритериев КАК НомерСтрокиКритериев,
	|	ДействующиеНормативы.КлючНормативнойСтавки КАК КлючНормативнойСтавки,
	|	ДействующиеНормативы.СтоимостьСНДС КАК СтоимостьСНДС,
	|	ДействующиеНормативы.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	ДействующиеНормативы.КритерийНорматива КАК КритерийНорматива,
	|	ДействующиеНормативы.ПротоколНормСтавок КАК ПротоколНормСтавок,
	|	ДействующиеНормативы.НормативСтоимостьСНДС КАК НормативСтоимостьСНДСвВалютеНорматива,
	|	ДействующиеНормативы.НормативСтоимостьБезНДС КАК НормативСтоимостьБезНДСвВалютеНорматива,
	|	ДействующиеНормативы.НормативСтоимостьСНДС * КурсыВалютНорматива.Курс * КурсыВалютПротокола.Кратность / (КурсыВалютПротокола.Курс * КурсыВалютПротокола.Кратность) КАК НормативСтоимостьСНДС,
	|	ДействующиеНормативы.НормативСтоимостьБезНДС * КурсыВалютНорматива.Курс * КурсыВалютПротокола.Кратность / (КурсыВалютПротокола.Курс * КурсыВалютПротокола.Кратность) КАК НормативСтоимостьБезНДС,
	|	ДействующиеНормативы.НормаПользования КАК НормаПользования,
	|	ДействующиеНормативы.Регистратор КАК Регистратор,
	|	ДействующиеНормативы.РегистраторНомер КАК РегистраторНомер,
	|	ДействующиеНормативы.ТипоразмерКТКПредставление КАК ТипоразмерКТКПредставление
	|ИЗ
	|	ДействующиеНормативы КАК ДействующиеНормативы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СвязьПоЛокацииОтправления КАК СвязьПоЛокацииОтправления
	|		ПО ДействующиеНормативы.НомерСтрокиКритериев = СвязьПоЛокацииОтправления.НомерСтрокиКритериев
	|			И ДействующиеНормативы.КритерийНорматива = СвязьПоЛокацииОтправления.КритерийНорматива
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СвязьПоЛокацииНазначения КАК СвязьПоЛокацииНазначения
	|		ПО ДействующиеНормативы.НомерСтрокиКритериев = СвязьПоЛокацииНазначения.НомерСтрокиКритериев
	|			И ДействующиеНормативы.КритерийНорматива = СвязьПоЛокацииНазначения.КритерийНорматива
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсыВалютПротокола
	|		ПО ДействующиеНормативы.ВалютаПротокола = КурсыВалютПротокола.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсыВалютНорматива
	|		ПО ДействующиеНормативы.ВалютаНорматива = КурсыВалютНорматива.Валюта
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтрокиКритериев,
	|	СтоимостьБезНДС УБЫВ";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.ПСЦПоставщика.Услуги", "&Услуги");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.ПСЦПоставщика.КритерииУслуг", "&КритерииУслуги");
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	ПоляТЧУслуг = "ИдентификаторСтрокиУслуг,Номенклатура,Валюта,ВидСобственности,НормаПользования,ПунктОтправления,ПунктОтправленияГород,ПунктОтправленияСтрана,ПунктНазначения,ПунктНазначенияГород,ПунктНазначенияСтрана,СтоимостьСНДС,СтоимостьБезНДС";
	ПоляТЧКритерииУслуг = "ИдентификаторСтрокиУслуг,НомерСтроки,ТипоразмерКТК,Критерий";
	
	Запрос.УстановитьПараметр("Услуги", Протокол.Услуги.Выгрузить(, ПоляТЧУслуг));
	Запрос.УстановитьПараметр("КритерииУслуги", Протокол.КритерииУслуг.Выгрузить(, ПоляТЧКритерииУслуг));
	Запрос.УстановитьПараметр("Протокол", Протокол.Ссылка);
	Запрос.УстановитьПараметр("ВидУслуг", Протокол.ВидУслугПоставщика);
	Запрос.УстановитьПараметр("НачалоДействия", Протокол.НачалоДействия);
	Запрос.УстановитьПараметр("ДатаПротокола", Протокол.ДатаПСЦ);
	Запрос.УстановитьПараметр("ПустаяДата", ПустаяДата);
	Запрос.УстановитьПараметр("ЛокацияПустаяСсылка", ЛокацияПустаяСсылка);
	Запрос.УстановитьПараметр("ТипИерархииГород", ТипИерархииГород);
	Запрос.УстановитьПараметр("ТипИерархииСтрана", ТипИерархииСтрана);
	Запрос.УстановитьПараметр("ТипЛокацииГород", ТипЛокацииГород);
	Запрос.УстановитьПараметр("ТипЛокацииСтрана", ТипЛокацииСтрана);
	Запрос.УстановитьПараметр("СогласованПоПСЦ", Перечисления.СтатусыТарифовПоставщиков.СогласованПоПСЦ);
	
	Результаты = Запрос.ВыполнитьПакет();
	КоличествоРезультатов = Результаты.Количество();
	//ТаблицаПротокола = Результаты[1].Выгрузить();
	ТаблицаНормативов = Результаты[КоличествоРезультатов - 1].Выгрузить();
	
	Возврат ТаблицаНормативов;
	
КонецФункции

Процедура ВыполнитьАвтоматическоеСогласование(Объект) Экспорт
	
	СтатусВыполнен = Перечисления.СтатусыЭтапов.Выполнен;
	СтатусВРаботе = Перечисления.СтатусыЭтапов.ВРаботе;
	СтатусНаВыполнение = Перечисления.СтатусыЭтапов.НаВыполнение;
	СогласованоБезЗамечаний = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний;
	ТекущаяДата = ТекущаяДата();
	
	Если Объект.Типовой И Объект.СтатусДокумента = Перечисления.СтатусыСогласования.НаРассмотрении Тогда
			
		ВсеСтавкиПрошлиПроверку = Истина;
		Для Каждого Стр Из Объект.Услуги Цикл
			Если Стр.ПроверкаСтавок <> Перечисления.РезультатыПроверки.Пройдена Тогда
				ВсеСтавкиПрошлиПроверку = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ВсеСтавкиПрошлиПроверку Тогда
			
			АвтоматическиеСогласования = Новый Массив;
			//Для Каждого Стр Из Объект.Состояния Цикл
			//	Если Стр.Статус <> СтатусВыполнен Тогда
			//		Если Стр.Состояние.Согласование Тогда
			//			Стр.Статус = СтатусВыполнен;
			//			Стр.СтатусСогласования = СогласованоБезЗамечаний;
			//			Стр.ЗавершениеРаботы = ТекущаяДата;
			//			Стр.АвтоматическоеСогласование = Истина;
			//			АвтоматическиеСогласования.Добавить(Стр);
			//		КонецЕсли;
			//	КонецЕсли;
			//КонецЦикла;
			
			УсловиеВсеСтавкиПротоколаПрошлиПроверку = Справочники.УсловияАвтоматическогоВыполненияЗадач.ВсеСтавкиПротоколаПрошлиПроверку;
			НайденныеСтроки = Объект.Состояния.НайтиСтроки(Новый Структура("УсловиеАвтоматическогоВыполнения", УсловиеВсеСтавкиПротоколаПрошлиПроверку));
			Для Каждого Стр Из НайденныеСтроки Цикл
				Если Стр.Статус = СтатусВРаботе Или Стр.Статус = СтатусНаВыполнение Тогда
					Стр.Статус = СтатусВыполнен;
					Стр.СтатусСогласования = СогласованоБезЗамечаний;
					Стр.ЗавершениеРаботы = ТекущаяДата;
					Стр.АвтоматическоеСогласование = Истина;
					АвтоматическиеСогласования.Добавить(Стр);
				КонецЕсли;
			КонецЦикла;
			
			Если ЗначениеЗаполнено(АвтоматическиеСогласования) Тогда
			
				ДанныеПроцессаСогласования = СогласованиеСервер.ПолучитьПроцессСогласованияОбъекта(Объект.Ссылка);	
				Если ЗначениеЗаполнено(ДанныеПроцессаСогласования.Ссылка) Тогда
					ПроцессСогласования = ДанныеПроцессаСогласования.Ссылка.ПолучитьОбъект();
					ШагЦикла = ДанныеПроцессаСогласования.ШагЦикла;
				Иначе
					ПроцессСогласования = Справочники.ПроцессСогласования.СоздатьЭлемент();
					ПроцессСогласования.Заполнить(Объект.Ссылка);
					ШагЦикла = 1;
				КонецЕсли;
					
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("ШагЦикла", ШагЦикла);

				Для Каждого Стр Из АвтоматическиеСогласования Цикл
					ПараметрыОтбора.Вставить("Состояние", Стр.Состояние);
					НайденныеСтроки = ПроцессСогласования.Состояния.НайтиСтроки(ПараметрыОтбора);
					Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
						СтрокаПроцесса = НайденныеСтроки[0];
						ЗаполнитьЗначенияСвойств(СтрокаПроцесса, Стр, "Статус, СтатусСогласования, ЗавершениеРаботы, АвтоматическоеСогласование");
					КонецЕсли;
				КонецЦикла;
				ПроцессСогласования.Записать();
				
				МаршрутизацияСервер.ПараллельноеСогласование(Объект.Состояния);				
				Объект.УстановитьСтатусДокумента();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Коханенко Н.А. 06.03.2025 (( #102319
Функция НапечататьТиповойПротоколАвтоперевозки(МассивОбъектов, ДопПараметры=Неопределено) Экспорт
	
	ПечатьЗапрещена = Истина;
	
	ВыводитьАдресаТерминалов = Ложь;
	Если ТипЗнч(ДопПараметры) = Тип("Структура") Тогда
		ДопПараметры.Свойство("ВыводитьАдресаТерминалов", ВыводитьАдресаТерминалов);
		Если ТипЗнч(ВыводитьАдресаТерминалов) <> Тип("Булево") Тогда
			ВыводитьАдресаТерминалов = Ложь;
		Иначе
			ВыводитьАдресаТерминалов = ДопПараметры.ВыводитьАдресаТерминалов;
		КонецЕсли;
	КонецЕсли; 
	
	Результат = Новый ТабличныйДокумент;
	Результат.АвтоМасштаб = Истина;
	
	Первый = Истина;
	Для каждого Док из МассивОбъектов Цикл 
		
		//Евросиб Коханенко Н.А. 10.06.2025 (( #110783

		//получаем данные из ПСЦ
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПСЦПоставщика.Дата КАК Дата, 
			|	ПСЦПоставщика.Контрагент КАК Контрагент, 
			|	ПСЦПоставщика.Договор КАК Договор,       
			|	ПСЦПоставщика.Организация КАК Организация, 
			|	ПСЦПоставщика.НачалоДействия КАК НачалоДействия, 
			|	ПСЦПоставщика.ОкончаниеДействия КАК ОкончаниеДействия, 
			|	ПСЦПоставщика.ПодписантКонтрагента КАК ПодписантКонтрагента, 
			|	ПСЦПоставщика.ДоверенностьНаПодписантаКонтрагента КАК ДоверенностьНаПодписантаКонтрагента, 
			|	ПСЦПоставщика.НаименованиеПодписи КАК НаименованиеПодписи, 
			|	ПСЦПоставщика.НаименованиеПодписиКонтрагента КАК НаименованиеПодписиКонтрагента, 
			|	ПСЦПоставщика.НомерПСЦ КАК НомерПСЦ, 
			|	ПСЦПоставщика.СуммаВключаетНДС КАК СуммаВключаетНДС, 
			|	ПСЦПоставщика.ДоверенностьЗаРуководителя КАК ДоверенностьЗаРуководителя, 
			|	ПСЦПоставщика.Типовой КАК Типовой, 
			|	ПСЦПоставщика.Комментарий КАК Комментарий, 
			|	ДоговорыКонтрагентов.Дата КАК ДоговорДата,   
			|	ДоговорыКонтрагентов.Номер КАК ДоговорНомер, 
			|	Контрагенты.НаименованиеПолное КАК КонтрагентНаименованиеПолное, 
			//Евросиб Коханенко Н.А. 29.07.2025 (( #115525 
			|	КонтрагентыКлиентЕвросиб.Наименование КАК КлиентЕвросибНаименование,
			//Евросиб Коханенко Н.А. 29.07.2025 )) #115525 
			//Евросиб Коханенко Н.А. 27.11.2025 (( #121740 
			|	Контрагенты.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо) КАК ФизЛицо,	
			//Евросиб Коханенко Н.А. 27.11.2025 )) #121740 
			|	Организации.ГоловнаяОрганизация КАК ГоловнаяОрганизация, 
			|	Доверенности.ДолжностьРодительныйПадеж КАК ДолжностьРодительныйПадеж, 
			|	Доверенности.ФИОПодписантаДляПротокола КАК ФИОПодписантаДляПротокола, 
			|	Доверенности.ОснованиеДляПодписанияРП КАК ОснованиеДляПодписанияРП,   
			|	Доверенности.ФайлПечать КАК ДоверенностьЗаРуководителяФайлПечать,     
			|	Доверенности.ФайлФаксимиль КАК ДоверенностьЗаРуководителяФайлФаксимиль, 
			|	Доверенности.Наименование КАК ДоверенностьЗаРуководителяНаименование,
			//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
			|	ПСЦПоставщика.ВидУслугПоставщика КАК ВидУслугПоставщика
			//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
			|ИЗ
			|	Документ.ПСЦПоставщика КАК ПСЦПоставщика
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|		ПО ПСЦПоставщика.Договор = ДоговорыКонтрагентов.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
			|		ПО ПСЦПоставщика.Контрагент = Контрагенты.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
			|		ПО ПСЦПоставщика.Организация = Организации.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Доверенности КАК Доверенности
			|		ПО ПСЦПоставщика.ДоверенностьЗаРуководителя = Доверенности.Ссылка
			//Евросиб Коханенко Н.А. 29.07.2025 (( #115525 
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК КонтрагентыКлиентЕвросиб
			|		ПО (ПСЦПоставщика.КлиентЕвросиб = КонтрагентыКлиентЕвросиб.Ссылка)
			//Евросиб Коханенко Н.А. 29.07.2025 )) #115525 
			|ГДЕ
			|	ПСЦПоставщика.Ссылка = &Ссылка
			|";			
		Запрос.Параметры.Вставить("Ссылка", Док);
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		ДанныеПСЦ = РезультатЗапроса[0].Выгрузить()[0];

		Если НЕ ДанныеПСЦ.Типовой Тогда
			ОбщегоНазначения.СообщитьПользователю("" + ДанныеПСЦ.Ссылка + " не типовой. Печать невозможна.");
				Продолжить; 
		КонецЕсли;
	    //Евросиб Коханенко Н.А. 10.06.2025 )) #110783 
		
		//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
		Если ДанныеПСЦ.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Порты Тогда
			ОбщегоНазначения.СообщитьПользователю("Протокол по группе услуг - порты не предусматривает формирование печатной формы ПСЦ.");
				Продолжить; 
		КонецЕсли;
		//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
		//Евросиб Шевченко А.В. US 110215 TA 120129 06.10.2025
		Если ДанныеПСЦ.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Фрахт Тогда
			ОбщегоНазначения.СообщитьПользователю("Протокол по группе услуг - Фрахт не предусматривает формирование печатной формы ПСЦ.");
				Продолжить; 
		КонецЕсли;
		//Евросиб Шевченко А.В. US 110215 TA 120129 06.10.2025
		//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
		Если ДанныеПСЦ.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.ТЭО Тогда
			ОбщегоНазначения.СообщитьПользователю("Протокол по группе услуг - ТЭО не предусматривает формирование печатной формы ПСЦ.");
				Продолжить; 
		КонецЕсли;
		//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
		//проверка согласования для вывода факсимиле
		Согласован = Истина;
		Для Каждого СтрСостояния Из Док.Состояния Цикл
			Если СтрСостояния.Состояние.Согласование Тогда
				Если СтрСостояния.Состояние = ПредопределенноеЗначение("Справочник.Состояния.ПроверкаСогласованияОтправкаПодкреплениеПодписанногоПСЦ") Тогда
					//Евросиб Шевченко А.В. US 100317 BUG 124407 21.11.2025
					//Если НЕ (СтрСостояния.СтатусСогласования = Перечисления.СтатусыСогласования.Планируется
					//	ИЛИ СтрСостояния.СтатусСогласования = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний) Тогда
					//	Согласован = Ложь;
					//КонецЕсли;
					Продолжить;
					//Евросиб Шевченко А.В. US 100317 BUG 124407 21.11.2025
				ИначеЕсли СтрСостояния.СтатусСогласования <> Перечисления.СтатусыСогласования.СогласованоБезЗамечаний Тогда
					Согласован = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если Согласован Тогда
			ВыводитьФаксимиле = Истина;
		Иначе
			ВыводитьФаксимиле = Ложь; 
		КонецЕсли;
		
		//Евросиб Коханенко Н.А. 10.06.2025 (( #110783 
		//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПСЦПоставщика.ПФ_MXL_ПротоколТиповойАвтоперевозки", Док.Контрагент, Док.Договор);  
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПСЦПоставщика.ПФ_MXL_ПротоколТиповойАвтоперевозки", ДанныеПСЦ.Контрагент, ДанныеПСЦ.Договор);  
		//Евросиб Коханенко Н.А. 10.06.2025 )) #110783 
		
		Если НЕ Первый Тогда 
			Результат.ВывестиГоризонтальныйРазделительСтраниц();
		//Евросиб Коханенко Н.А. 05.06.2025 (( #110783 
		Иначе
			Первый = Ложь;	
		//Евросиб Коханенко Н.А. 05.06.2025 )) #110783 
		КонецЕсли;
		
		//Шапка
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		
		//Евросиб Коханенко Н.А. 27.11.2025 (( #121740
		ОбластьШапкаОкончание = Макет.ПолучитьОбласть("ШапкаОкончание");
		Если ДанныеПСЦ.ФизЛицо Тогда
			ОбластьШапкаИсполнитель = Макет.ПолучитьОбласть("ШапкаИсполнительФизЛицо");
		Иначе
			ОбластьШапкаИсполнитель = Макет.ПолучитьОбласть("ШапкаИсполнительЮрЛицо");
		КонецЕсли;
		//Евросиб Коханенко Н.А. 27.11.2025 )) #121740 
		
		//Евросиб Коханенко Н.А. 10.06.2025 (( #110783 
		//ОбластьШапка.Параметры.НомерДоговора = Док.Договор.Номер;
		//ОбластьШапка.Параметры.ДатаДоговора = Формат(Док.Договор.Дата, "ДФ=dd.MM.yyyy");
		//ОбластьШапка.Параметры.НомерПСЦ = Док.НомерПСЦ;
		//НаименованияНаДату = Справочники.Организации.НаименованияНаДату(?(ЗначениеЗаполнено(Док.Организация.ГоловнаяОрганизация), Док.Организация.ГоловнаяОрганизация, Док.Организация), Док.Дата);
        //
		//ОбластьШапка.Параметры.КраткоеНаименованиеИсполнителя = Док.НаименованиеПодписиКонтрагента; 
		//ОбластьШапка.Параметры.НаименованиеИсполнителя = Док.Контрагент.НаименованиеПолное;
		ОбластьШапка.Параметры.НомерДоговора = ДанныеПСЦ.ДоговорНомер;
		ОбластьШапка.Параметры.ДатаДоговора = Формат(ДанныеПСЦ.ДоговорДата, "ДФ=dd.MM.yyyy");
		ОбластьШапка.Параметры.НомерПСЦ = ДанныеПСЦ.НомерПСЦ;
		НаименованияНаДату = Справочники.Организации.НаименованияНаДату(?(ЗначениеЗаполнено(ДанныеПСЦ.ГоловнаяОрганизация), ДанныеПСЦ.ГоловнаяОрганизация, ДанныеПСЦ.Организация), ДанныеПСЦ.Дата);

		//Евросиб Коханенко Н.А. 27.11.2025 (( #121740 
		//ОбластьШапка.Параметры.КраткоеНаименованиеИсполнителя = ДанныеПСЦ.НаименованиеПодписиКонтрагента; 
		//ОбластьШапка.Параметры.НаименованиеИсполнителя = ДанныеПСЦ.КонтрагентНаименованиеПолное;
		ОбластьШапкаИсполнитель.Параметры.КраткоеНаименованиеИсполнителя = ДанныеПСЦ.НаименованиеПодписиКонтрагента; 
		ОбластьШапкаИсполнитель.Параметры.НаименованиеИсполнителя = ДанныеПСЦ.КонтрагентНаименованиеПолное;
		//Евросиб Коханенко Н.А. 27.11.2025 )) #121740 
		
		//                                                                                        
		//Если ЗначениеЗаполнено(Док.ПодписантКонтрагента) Тогда 
		//	РуководительКонтрагента = ОтветственныеЛица_сервер.ПолучитьПодписанта(Док.Контрагент, Док.НачалоДействия, Док.ПодписантКонтрагента);
                                                                                                
		Если ЗначениеЗаполнено(ДанныеПСЦ.ПодписантКонтрагента) Тогда 
			РуководительКонтрагента = ОтветственныеЛица_сервер.ПолучитьПодписанта(ДанныеПСЦ.Контрагент, ДанныеПСЦ.НачалоДействия, ДанныеПСЦ.ПодписантКонтрагента);
		//Евросиб Коханенко Н.А. 10.06.2025 )) #110783 
			Если ЗначениеЗаполнено(РуководительКонтрагента.ДолжностьВРодительномПадеже) Тогда
				ДолжностьРуководителя = РуководительКонтрагента.ДолжностьВРодительномПадеже;
			ИначеЕсли ЗначениеЗаполнено(РуководительКонтрагента.ДолжностьРус) Тогда
				ДолжностьРуководителя = ПолучитьСклоненияСтроки(РуководительКонтрагента.ДолжностьРус,, "ПД=Родительный")[0];
			Иначе
				ДолжностьРуководителя = "";
			КонецЕсли;
			//Евросиб Коханенко Н.А. 27.11.2025 (( #121740 
			//ОбластьШапка.Параметры.ДолжностьРуководителяИсполнителя = ДолжностьРуководителя;
			Если Не ДанныеПСЦ.ФизЛицо Тогда
				ОбластьШапкаИсполнитель.Параметры.ДолжностьРуководителяИсполнителя = ДолжностьРуководителя;
			КонецЕсли;
			//Евросиб Коханенко Н.А. 27.11.2025 )) #121740 
			ФИОРуководителя = Строка(РуководительКонтрагента.Подписант);
			Если ЗначениеЗаполнено(РуководительКонтрагента.ФИОВРодительномПадеже) Тогда
				ФИОРуководителяРП = РуководительКонтрагента.ФИОВРодительномПадеже
			ИначеЕсли ЗначениеЗаполнено(ФИОРуководителя) Тогда
				ФИОРуководителяРП = ПолучитьСклоненияСтроки(ФИОРуководителя,, "ПД=Родительный")[0];
			Иначе
				ФИОРуководителяРП = "";
			КонецЕсли;
			НаОснованииСтрока = ?(ЗначениеЗаполнено(РуководительКонтрагента.НаОсновании), РуководительКонтрагента.НаОсновании, "Доверенности");
			//Евросиб Коханенко Н.А. 10.06.2025 (( #110783 
			//Если ЗначениеЗаполнено(Док.ДоверенностьНаПодписантаКонтрагента) Тогда
			//	ДоверенностьСтрока = Док.ДоверенностьНаПодписантаКонтрагента;
			Если ЗначениеЗаполнено(ДанныеПСЦ.ДоверенностьНаПодписантаКонтрагента) Тогда
				ДоверенностьСтрока = ДанныеПСЦ.ДоверенностьНаПодписантаКонтрагента;
			//Евросиб Коханенко Н.А. 10.06.2025 )) #110783 
			ИначеЕсли ЗначениеЗаполнено(РуководительКонтрагента.Доверенность) Тогда 
				ДоверенностьСтрока = РуководительКонтрагента.Доверенность;
			Иначе
				ДоверенностьСтрока = "";
			КонецЕсли; 
			//Евросиб Коханенко Н.А. 27.11.2025 (( #121740 
			//ОбластьШапка.Параметры.ОснованиеИсполнителя = СтрШаблон("%1 %2", НаОснованииСтрока, ДоверенностьСтрока);
			ОбластьШапкаИсполнитель.Параметры.ОснованиеИсполнителя = СтрШаблон("%1 %2", НаОснованииСтрока, ДоверенностьСтрока);
			//Евросиб Коханенко Н.А. 27.11.2025 )) #121740 
		Иначе //берем из поля руководителя    
			//Евросиб Коханенко Н.А. 10.06.2025 (( #110783 
			//РуководительКонтрагента = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Контрагент, Док.НачалоДействия);
			РуководительКонтрагента = ОтветственныеЛица_сервер.ПолучитьРуководителя(ДанныеПСЦ.Контрагент, ДанныеПСЦ.НачалоДействия);
			//Евросиб Коханенко Н.А. 10.06.2025 )) #110783 
			Если ЗначениеЗаполнено(РуководительКонтрагента.ДолжностьРП) Тогда
				ДолжностьРуководителя = РуководительКонтрагента.ДолжностьРП;
			ИначеЕсли ЗначениеЗаполнено(РуководительКонтрагента.ДолжностьРус) Тогда
				ДолжностьРуководителя = ПолучитьСклоненияСтроки(РуководительКонтрагента.ДолжностьРус,, "ПД=Родительный")[0];
			Иначе
				ДолжностьРуководителя = "";
			КонецЕсли;
			//Евросиб Коханенко Н.А. 27.11.2025 (( #121740 
			Если Не ДанныеПСЦ.ФизЛицо Тогда
				//ОбластьШапка.Параметры.ДолжностьРуководителяИсполнителя = ДолжностьРуководителя;
				ОбластьШапкаИсполнитель.Параметры.ДолжностьРуководителяИсполнителя = ДолжностьРуководителя;
			КонецЕсли;
			//Евросиб Коханенко Н.А. 27.11.2025 )) #121740 
			ФИОРуководителя = РуководительКонтрагента.ФИОРус; 
			Если ЗначениеЗаполнено(РуководительКонтрагента.ФИОРПРус) Тогда
				ФИОРуководителяРП = РуководительКонтрагента.ФИОРПРус
			ИначеЕсли ЗначениеЗаполнено(ФИОРуководителя) Тогда
				ФИОРуководителяРП = ПолучитьСклоненияСтроки(ФИОРуководителя,, "ПД=Родительный")[0];
			Иначе
				ФИОРуководителяРП = "";
			КонецЕсли;
			Если ЗначениеЗаполнено(РуководительКонтрагента.ОснованиеРус) Тогда
				НаОснованииСтрока = РуководительКонтрагента.ОснованиеРус
			ИначеЕсли ЗначениеЗаполнено(РуководительКонтрагента.Основание) Тогда
				НаОснованииСтрока = ПолучитьСклоненияСтроки(РуководительКонтрагента.Основание,, "ПД=Родительный")[0]; 
			//Евросиб Коханенко Н.А. 27.11.2025 (( #121740 
			ИначеЕсли ДанныеПСЦ.ФизЛицо Тогда
			    НаОснованииСтрока = "___________________________________";
			//Евросиб Коханенко Н.А. 27.11.2025 )) #121740 
			Иначе
				НаОснованииСтрока = "Устава";
			КонецЕсли;
			//Евросиб Коханенко Н.А. 27.11.2025 (( #121740 
			//ОбластьШапка.Параметры.ОснованиеИсполнителя = НаОснованииСтрока;
			ОбластьШапкаИсполнитель.Параметры.ОснованиеИсполнителя = НаОснованииСтрока;
			//Евросиб Коханенко Н.А. 27.11.2025 )) #121740 
		КонецЕсли;
		//Евросиб Коханенко Н.А. 27.11.2025 (( #121740 
		Если Не ДанныеПСЦ.ФизЛицо Тогда
			//ОбластьШапка.Параметры.ФИОРуководителяИсполнителя = ФИОРуководителяРП;
			ОбластьШапкаИсполнитель.Параметры.ФИОРуководителяИсполнителя = ФИОРуководителяРП;
		КонецЕсли;
		//Евросиб Коханенко Н.А. 27.11.2025 )) #121740 
		
		//Евросиб Коханенко Н.А. 10.06.2025 (( #110783 
		//Если ЗначениеЗаполнено(Док.НаименованиеПодписи) Тогда
		//	ОбластьШапка.Параметры.КраткоеНаименованиеКлиента = Док.НаименованиеПодписи;
		Если ЗначениеЗаполнено(ДанныеПСЦ.НаименованиеПодписи) Тогда
			ОбластьШапка.Параметры.КраткоеНаименованиеКлиента = ДанныеПСЦ.НаименованиеПодписи;
		//Евросиб Коханенко Н.А. 10.06.2025 )) #110783 
		Иначе
			ОбластьШапка.Параметры.КраткоеНаименованиеКлиента = "Заказчик";
		КонецЕсли;
		ОбластьШапка.Параметры.НаименованиеКлиента = НаименованияНаДату.НаименованиеПолное;
		//Евросиб Коханенко Н.А. 10.06.2025 (( #110783 
		//ОбластьШапка.Параметры.ДолжностьРуководителяКлиента = Док.ДоверенностьЗаРуководителя.ДолжностьРодительныйПадеж;
		//ОбластьШапка.Параметры.ФИОРуководителяКлиента = Док.ДоверенностьЗаРуководителя.ФИОПодписантаДляПротокола;
		//ОбластьШапка.Параметры.ОснованиеКлиента = Док.ДоверенностьЗаРуководителя.ОснованиеДляПодписанияРП;

		//Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя) Тогда
		//	ОбластьШапка.Параметры.ДолжностьРуководителяКлиента = Док.ДоверенностьЗаРуководителя.ДолжностьРодительныйПадеж;
		//	ОбластьШапка.Параметры.ФИОРуководителяКлиента = Док.ДоверенностьЗаРуководителя.ФИОПодписантаДляПротокола;
		//	ОбластьШапка.Параметры.ОснованиеКлиента = Док.ДоверенностьЗаРуководителя.ОснованиеДляПодписанияРП;
		//Иначе
		//	НашРуководитель = ОтветственныеЛица_сервер.ПолучитьРуководителя(Док.Организация, Док.НачалоДействия);
		ОбластьШапка.Параметры.ДолжностьРуководителяКлиента = ДанныеПСЦ.ДолжностьРодительныйПадеж;
		ОбластьШапка.Параметры.ФИОРуководителяКлиента = ДанныеПСЦ.ФИОПодписантаДляПротокола;
		ОбластьШапка.Параметры.ОснованиеКлиента = ДанныеПСЦ.ОснованиеДляПодписанияРП;

		Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя) Тогда
			ОбластьШапка.Параметры.ДолжностьРуководителяКлиента = ДанныеПСЦ.ДолжностьРодительныйПадеж;
			ОбластьШапка.Параметры.ФИОРуководителяКлиента = ДанныеПСЦ.ФИОПодписантаДляПротокола;
			ОбластьШапка.Параметры.ОснованиеКлиента = ДанныеПСЦ.ОснованиеДляПодписанияРП;
		Иначе
			НашРуководитель = ОтветственныеЛица_сервер.ПолучитьРуководителя(ДанныеПСЦ.Организация, ДанныеПСЦ.НачалоДействия);
		//Евросиб Коханенко Н.А. 10.06.2025 )) #110783 
			ОбластьШапка.Параметры.ДолжностьРуководителяКлиента = НашРуководитель.ДолжностьРП;
			ОбластьШапка.Параметры.ФИОРуководителяКлиента = НашРуководитель.ФИОРПРус;
			ОбластьШапка.Параметры.ОснованиеКлиента = НашРуководитель.ОснованиеРус;
		КонецЕсли; 
		
		//Евросиб Коханенко Н.А. 10.06.2025 (( #110783 
		//ОбластьШапка.Параметры.НачалоДействия = Формат(Док.НачалоДействия, "ДФ=dd.MM.yyyy");
		ОбластьШапка.Параметры.НачалоДействия = Формат(ДанныеПСЦ.НачалоДействия, "ДФ=dd.MM.yyyy");
		//Евросиб Коханенко Н.А. 10.06.2025 )) #110783 

		НомерПункта = 1;
		//Евросиб Коханенко Н.А. 27.11.2025 (( #121740
		//ОбластьШапка.Параметры.НомерПункта = НомерПункта; 
		ОбластьШапкаОкончание.Параметры.НомерПункта = НомерПункта;
		//Евросиб Коханенко Н.А. 27.11.2025 )) #121740

		//Евросиб Коханенко Н.А. 05.06.2025 (( #110783 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПСЦПоставщикаУслуги.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПСЦПоставщика.Услуги КАК ПСЦПоставщикаУслуги
			|ГДЕ
			|	ПСЦПоставщикаУслуги.Ссылка = &Ссылка
			|	И ПСЦПоставщикаУслуги.БазоваяСтавкаНадбавка = ЗНАЧЕНИЕ(Справочник.БазовыеСтавкиНадбавки.МСКЗонаВнутриМКАД)
			|	И ПСЦПоставщикаУслуги.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.АвтоперевозкаГруженыйКонтейнер)";
		Запрос.УстановитьПараметр("Ссылка", Док.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			БазоваяСтавкаМСК = Ложь; 
		Иначе
			БазоваяСтавкаМСК = Истина;
			//Евросиб Коханенко Н.А. 27.11.2025 (( #121740
			//ОбластьШапка.Параметры.СноскаНаПримечание = "*";
			ОбластьШапкаОкончание.Параметры.СноскаНаПримечание = "*";
			//Евросиб Коханенко Н.А. 27.11.2025 )) #121740
		КонецЕсли;
		//Евросиб Коханенко Н.А. 05.06.2025 )) #110783 

		Результат.Вывести(ОбластьШапка);  
		
		//Евросиб Коханенко Н.А. 27.11.2025 (( #121740
		Результат.Вывести(ОбластьШапкаИсполнитель);  
		Результат.Вывести(ОбластьШапкаОкончание);  
		//Евросиб Коханенко Н.А. 27.11.2025 )) #121740 
		
		//Евросиб Коханенко Н.А. 29.07.2025 (( #115525
		Если ЗначениеЗаполнено(ДанныеПСЦ.КлиентЕвросибНаименование) Тогда
			
			ОбластьПримечаниеКлиентаЕвросиб = Макет.ПолучитьОбласть("ПримечаниеКлиентаЕвросиб");
			ОбластьПримечаниеКлиентаЕвросиб.Параметры.КлиентЕвросиб = СтрШаблон("""%1""", ДанныеПСЦ.КлиентЕвросибНаименование);
			Результат.Вывести(ОбластьПримечаниеКлиентаЕвросиб); 
			
		КонецЕсли;
		//Евросиб Коханенко Н.А. 29.07.2025 )) #115525
		
		//Таблицы
	
		тчУслуги = Док.Услуги; 
		Валюта = "рублей";
		СтрокаВТомЧислеНДС = ", в том числе НДС ";
		
		//выводим таблицу "Груженые контейнеры"
		КритерииУслуг = Новый Соответствие;
		ОтборНоменклатуры = Новый Структура("Номенклатура", Справочники.Номенклатура.АвтоперевозкаГруженыйКонтейнер);
		УслугиАвтоГруженыйКТК = тчУслуги.НайтиСтроки(ОтборНоменклатуры);
		
		Если УслугиАвтоГруженыйКТК.Количество() > 0 Тогда
			              
			//Евросиб Коханенко Н.А. 05.06.2025 (( #110783 
			//ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
			Если БазоваяСтавкаМСК Тогда
				ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицыСЗонойРасчета");
			Иначе
				ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
			КонецЕсли;
			//Евросиб Коханенко Н.А. 05.06.2025 )) #110783
			
			ОбластьШапкаТаблицы.Параметры.ГруженыеПорожние = "Груженые";
			ОбластьШапкаТаблицы.Параметры.ГруженогоПорожнего = "груженого";
			Результат.Вывести(ОбластьШапкаТаблицы);  
			
			Для Каждого СтрУслуги Из УслугиАвтоГруженыйКТК Цикл
			
				СоотвПунктыПостановки = Новый Соответствие;
				СоотвАдресаСкладов = Новый Соответствие;
				СоотвПунктыСдачи = Новый Соответствие;
				
				//формируем строку пунктов постановки
				Если ЗначениеЗаполнено(СтрУслуги.ПунктОтправления) Тогда
					Локация = СтрУслуги.ПунктОтправления;
				ИначеЕсли ЗначениеЗаполнено(СтрУслуги.ПунктОтправленияГород) Тогда
					Локация = СтрУслуги.ПунктОтправленияГород;
				Иначе
					Локация = Неопределено;
				КонецЕсли;
				Если ТипЗнч(Локация) = Тип("СправочникСсылка.Локации") Тогда
					СоотвПунктыПостановки.Вставить(Локация, Локация.Наименование);
				ИначеЕсли ТипЗнч(Локация) = Тип("СправочникСсылка.Мультилокации") Тогда
					тчЛокации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Локация, "Локации").Выгрузить();
					Для Каждого ЭлементЛокации Из тчЛокации Цикл 
						СоотвПунктыПостановки.Вставить(ЭлементЛокации.Локация, ЭлементЛокации.Локация.Наименование);
					КонецЦикла;
				КонецЕсли;
				МассивПунктов = Новый Массив;
				Для Каждого Элемент Из СоотвПунктыПостановки Цикл
					МассивПунктов.Добавить(Элемент.Значение);	
				КонецЦикла;
				СтрокаПунктовПостановки = СтрСоединить(МассивПунктов, ", "); 

				//формируем строку адресов складов погрузки/выгрузки
				Если ЗначениеЗаполнено(СтрУслуги.АдресСкладаПогрузкиВыгрузки) Тогда
					Адрес = СтрУслуги.АдресСкладаПогрузкиВыгрузки;
				Иначе
					Адрес = Неопределено;
				КонецЕсли;
				Если ТипЗнч(Локация) = Тип("СправочникСсылка.АдресаВНаселенныхПунктах") Тогда
					СоотвАдресаСкладов.Вставить(Адрес, Адрес.Наименование);
				ИначеЕсли ТипЗнч(Адрес) = Тип("СправочникСсылка.Мультиадреса") Тогда
					тчАдреса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Адрес, "Адреса").Выгрузить();
					Для Каждого ЭлементАдреса Из тчАдреса Цикл 
						СоотвАдресаСкладов.Вставить(ЭлементАдреса.Адрес, ЭлементАдреса.Адрес.Наименование);
					КонецЦикла;
				КонецЕсли;
				МассивПунктов = Новый Массив;
				Для Каждого Элемент Из СоотвАдресаСкладов Цикл
					МассивПунктов.Добавить(Элемент.Значение);	
				КонецЦикла;
				СтрокаАдресовСкладов = СтрСоединить(МассивПунктов, ", "); 

				//формируем строку пунктов сдачи
				Если ЗначениеЗаполнено(СтрУслуги.ПунктНазначения) Тогда
					Локация = СтрУслуги.ПунктНазначения;
				ИначеЕсли ЗначениеЗаполнено(СтрУслуги.ПунктНазначенияГород) Тогда
					Локация = СтрУслуги.ПунктНазначенияГород;
				Иначе
					Локация = Неопределено;
				КонецЕсли;
				Если ТипЗнч(Локация) = Тип("СправочникСсылка.Локации") Тогда
					СоотвПунктыСдачи.Вставить(Локация, Локация.Наименование);
				ИначеЕсли ТипЗнч(Локация) = Тип("СправочникСсылка.Мультилокации") Тогда
					тчЛокации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Локация, "Локации").Выгрузить();
					Для Каждого ЭлементЛокации Из тчЛокации Цикл 
						СоотвПунктыСдачи.Вставить(ЭлементЛокации.Локация, ЭлементЛокации.Локация.Наименование);
					КонецЦикла;
				КонецЕсли;
				МассивПунктов = Новый Массив;
				Для Каждого Элемент Из СоотвПунктыСдачи Цикл
					МассивПунктов.Добавить(Элемент.Значение);	
				КонецЦикла;
				СтрокаПунктовСдачи = СтрСоединить(МассивПунктов, ", "); 
				
				//формируем строку размеров КТК
				Отбор = Новый Структура("ИдентификаторСтрокиУслуг", СтрУслуги.ИдентификаторСтрокиУслуг);
				Критерии = Док.КритерииУслуг.НайтиСтроки(Отбор);
				Размеры = Новый Массив;
				Для Каждого СтрКритерия Из Критерии Цикл 
					Если ЗначениеЗаполнено(СтрКритерия.ТипоразмерКТК) Тогда
						Типоразмер = СтрКритерия.ТипоразмерКТК.РазмерКТК;
						//отсекаем дубли типоразмеров
						Если Размеры.Найти(СтрКритерия.ТипоразмерКТК.Наименование) = Неопределено Тогда
							Размеры.Добавить(СтрКритерия.ТипоразмерКТК.Наименование);                  
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				СтрокаРазмеров = СтрСоединить(Размеры, ", ");	
				
				КритерииУслуг.Вставить(СтрУслуги.ИдентификаторСтрокиУслуг, 
										Новый Структура("ТипоразмерКТК, ПунктПостановки, ПунктПогрузкиВыгрузки, ПунктСдачи", 
											СтрокаРазмеров, СтрокаПунктовПостановки, СтрокаАдресовСкладов, СтрокаПунктовСдачи));
				
			КонецЦикла;  

			Для Каждого СтрУслуги Из УслугиАвтоГруженыйКТК Цикл

				//Евросиб Коханенко Н.А. 05.06.2025 (( #110783 
				//ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
				Если БазоваяСтавкаМСК Тогда
					ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицыСЗонойРасчета");
					Если СтрУслуги.БазоваяСтавкаНадбавка = ПредопределенноеЗначение("Справочник.БазовыеСтавкиНадбавки.МСКЗонаВнутриМКАД") Тогда
						ОбластьСтрокаТаблицы.Параметры.ЗонаРасчета = "МКАД";
					КонецЕсли;
				Иначе
					ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
				КонецЕсли;
				//Евросиб Коханенко Н.А. 05.06.2025 )) #110783
				
				стКритерииУслуги = КритерииУслуг.Получить(СтрУслуги.ИдентификаторСтрокиУслуг);
				ОбластьСтрокаТаблицы.Параметры.ТипоразмерКТК = стКритерииУслуги.ТипоразмерКТК;	
				ОбластьСтрокаТаблицы.Параметры.ПунктПостановки = стКритерииУслуги.ПунктПостановки;	
				ОбластьСтрокаТаблицы.Параметры.ПунктПогрузкиВыгрузки = СтрУслуги.АдресСкладаПогрузкиВыгрузки;	
				ОбластьСтрокаТаблицы.Параметры.ПунктСдачи = стКритерииУслуги.ПунктСдачи;
				//Евросиб Коханенко Н.А. 06.06.2025 (( #110783 
				//Если Док.СуммаВключаетНДС Тогда
				//	ОбластьСтрокаТаблицы.Параметры.СтоимостьУслуг = Формат(СтрУслуги.СтоимостьСНДС, "ЧДЦ=2");;
				//Иначе
				//	ОбластьСтрокаТаблицы.Параметры.СтоимостьУслуг = Формат(СтрУслуги.СтоимостьБезНДС, "ЧДЦ=2");;
				//КонецЕсли;
				ОбластьСтрокаТаблицы.Параметры.СтоимостьУслуг = Формат(СтрУслуги.СтоимостьСНДС, "ЧДЦ=2");;
				//Евросиб Коханенко Н.А. 06.06.2025 )) #110783
				Результат.Вывести(ОбластьСтрокаТаблицы);
				
			КонецЦикла;
			
			//выводим примечание1 к таблице "Груженые контейнеры"  
			//Евросиб Коханенко Н.А. 05.06.2025 (( #110783 
			//ОбластьПримечаниеТаблицы1 = Макет.ПолучитьОбласть("ПримечаниеТаблицы");
			Если БазоваяСтавкаМСК Тогда
				ОбластьПримечаниеТаблицы1 = Макет.ПолучитьОбласть("ПримечаниеТаблицыСЗонойРасчета");
			Иначе
				ОбластьПримечаниеТаблицы1 = Макет.ПолучитьОбласть("ПримечаниеТаблицы");
			КонецЕсли;
			//Евросиб Коханенко Н.А. 05.06.2025 )) #110783 
			Если СтрУслуги.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
				ОбластьПримечаниеТаблицы1.Параметры.НДС = "- НДС не облагается";
			Иначе
				ОбластьПримечаниеТаблицы1.Параметры.НДС = "включает НДС " + Формат(СтрУслуги.СтавкаНДС, "ЧДЦ=2");  //СтрУслуги.СтавкаНДС; 
			КонецЕсли;
			Результат.Вывести(ОбластьПримечаниеТаблицы1);
			
			//выводим примечание2 к таблице "Груженые контейнеры"
			УслугиБазоваяСтавкаАвто = тчУслуги.НайтиСтроки(Новый Структура("Номенклатура", Справочники.Номенклатура.БазоваяСтавкаАвто));
			Если УслугиБазоваяСтавкаАвто.Количество() > 0 Тогда 
				ОбластьСтрокаУслуги = Макет.ПолучитьОбласть("СтрокаУслуги");
				Номер = Неопределено;
				Заголовок = "Стоимость базовой ставки за автоперевозку контейнера составляет ";
				ОбластьСтрокаУслуги.Параметры.Валюта = Валюта;
    			ОбластьСтрокаУслуги.Параметры.Заголовок = СтрШаблон("%1%2", ?(Номер <> Неопределено, НомерПункта + ". ", ""), Заголовок);
				//Евросиб Коханенко Н.А. 06.06.2025 (( #110783 
				//ОбластьСтрокаУслуги.Параметры.НДС = Формат(?(Док.СуммаВключаетНДС, УслугиБазоваяСтавкаАвто[0].СтоимостьСНДС, УслугиБазоваяСтавкаАвто[0].СтоимостьБезНДС), "ЧДЦ=2");
				ОбластьСтрокаУслуги.Параметры.НДС = Формат(УслугиБазоваяСтавкаАвто[0].СтоимостьСНДС, "ЧДЦ=2");
				//Евросиб Коханенко Н.А. 06.06.2025 )) #110783 
				Если УслугиБазоваяСтавкаАвто[0].СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
					ОбластьСтрокаУслуги.Параметры.СтавкаНДС = ", НДС не облагается";
				Иначе  
					ОбластьСтрокаУслуги.Параметры.СтавкаНДС = СтрокаВТомЧислеНДС + УслугиБазоваяСтавкаАвто[0].СтавкаНДС;  
				КонецЕсли;
				Результат.Вывести(ОбластьСтрокаУслуги);
			КонецЕсли;

		КонецЕсли; 
		
		//выводим таблицу "Порожние контейнеры"              
		ОтборНоменклатуры = Новый Структура("Номенклатура", Справочники.Номенклатура.АвтоперевозкаПорожнийКонтейнер);
		УслугиАвтоПорожнийКТК = тчУслуги.НайтиСтроки(ОтборНоменклатуры);
		КритерииУслуг = Новый Соответствие;
		
		Если УслугиАвтоПорожнийКТК.Количество() > 0 Тогда
			ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ОбластьШапкаТаблицы.Параметры.ГруженыеПорожние = "Порожние";
			ОбластьШапкаТаблицы.Параметры.ГруженогоПорожнего = "порожнего";
			Результат.Вывести(ОбластьШапкаТаблицы);  
			

			Для Каждого СтрУслуги Из УслугиАвтоПорожнийКТК Цикл
			
				СоотвПунктыПостановки = Новый Соответствие;
				СоотвАдресаСкладов = Новый Соответствие;
				СоотвПунктыСдачи = Новый Соответствие;
				
				//формируем строку пунктов постановки
				Если ЗначениеЗаполнено(СтрУслуги.ПунктОтправления) Тогда
					Локация = СтрУслуги.ПунктОтправления;
				ИначеЕсли ЗначениеЗаполнено(СтрУслуги.ПунктОтправленияГород) Тогда
					Локация = СтрУслуги.ПунктОтправленияГород;
				Иначе
					Локация = Неопределено;
				КонецЕсли;
				Если ТипЗнч(Локация) = Тип("СправочникСсылка.Локации") Тогда
					СоотвПунктыПостановки.Вставить(Локация, Локация.Наименование);
				ИначеЕсли ТипЗнч(Локация) = Тип("СправочникСсылка.Мультилокации") Тогда
					тчЛокации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Локация, "Локации").Выгрузить();
					Для Каждого ЭлементЛокации Из тчЛокации Цикл 
						СоотвПунктыПостановки.Вставить(ЭлементЛокации.Локация, ЭлементЛокации.Локация.Наименование);
					КонецЦикла;
				КонецЕсли;
				МассивПунктов = Новый Массив;
				Для Каждого Элемент Из СоотвПунктыПостановки Цикл
					МассивПунктов.Добавить(Элемент.Значение);	
				КонецЦикла;
				СтрокаПунктовПостановки = СтрСоединить(МассивПунктов, ", "); 

				//формируем строку адресов складов погрузки/выгрузки
				Если ЗначениеЗаполнено(СтрУслуги.АдресСкладаПогрузкиВыгрузки) Тогда
					Адрес = СтрУслуги.АдресСкладаПогрузкиВыгрузки;
				Иначе
					Адрес = Неопределено;
				КонецЕсли;
				Если ТипЗнч(Локация) = Тип("СправочникСсылка.АдресаВНаселенныхПунктах") Тогда
					СоотвАдресаСкладов.Вставить(Адрес, Адрес.Наименование);
				ИначеЕсли ТипЗнч(Адрес) = Тип("СправочникСсылка.Мультиадреса") Тогда
					тчАдреса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Адрес, "Адреса").Выгрузить();
					Для Каждого ЭлементАдреса Из тчАдреса Цикл 
						СоотвАдресаСкладов.Вставить(ЭлементАдреса.Адрес, ЭлементАдреса.Адрес.Наименование);
					КонецЦикла;
				КонецЕсли;
				МассивПунктов = Новый Массив;
				Для Каждого Элемент Из СоотвАдресаСкладов Цикл
					МассивПунктов.Добавить(Элемент.Значение);	
				КонецЦикла;
				СтрокаАдресовСкладов = СтрСоединить(МассивПунктов, ", "); 

				//формируем строку пунктов сдачи
				Если ЗначениеЗаполнено(СтрУслуги.ПунктНазначения) Тогда
					Локация = СтрУслуги.ПунктНазначения;
				ИначеЕсли ЗначениеЗаполнено(СтрУслуги.ПунктНазначенияГород) Тогда
					Локация = СтрУслуги.ПунктНазначенияГород;
				Иначе
					Локация = Неопределено;
				КонецЕсли;
				Если ТипЗнч(Локация) = Тип("СправочникСсылка.Локации") Тогда
					СоотвПунктыСдачи.Вставить(Локация, Локация.Наименование);
				ИначеЕсли ТипЗнч(Локация) = Тип("СправочникСсылка.Мультилокации") Тогда
					тчЛокации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Локация, "Локации").Выгрузить();
					Для Каждого ЭлементЛокации Из тчЛокации Цикл 
						СоотвПунктыСдачи.Вставить(ЭлементЛокации.Локация, ЭлементЛокации.Локация.Наименование);
					КонецЦикла;
				КонецЕсли;
				МассивПунктов = Новый Массив;
				Для Каждого Элемент Из СоотвПунктыСдачи Цикл
					МассивПунктов.Добавить(Элемент.Значение);	
				КонецЦикла;
				СтрокаПунктовСдачи = СтрСоединить(МассивПунктов, ", "); 
				
				//формируем строку размеров КТК
				Отбор = Новый Структура("ИдентификаторСтрокиУслуг", СтрУслуги.ИдентификаторСтрокиУслуг);
				Критерии = Док.КритерииУслуг.НайтиСтроки(Отбор);
				Размеры = Новый Массив;
				Для Каждого СтрКритерия Из Критерии Цикл 
					Если ЗначениеЗаполнено(СтрКритерия.ТипоразмерКТК) Тогда
						Типоразмер = СтрКритерия.ТипоразмерКТК.РазмерКТК;
						//отсекаем дубли типоразмеров
						Если Размеры.Найти(СтрКритерия.ТипоразмерКТК.Наименование) = Неопределено Тогда
							Размеры.Добавить(СтрКритерия.ТипоразмерКТК.Наименование);                  
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				СтрокаРазмеров = СтрСоединить(Размеры, ", ");	
				
				КритерииУслуг.Вставить(СтрУслуги.ИдентификаторСтрокиУслуг, 
										Новый Структура("ТипоразмерКТК, ПунктПостановки, ПунктПогрузкиВыгрузки, ПунктСдачи", 
											СтрокаРазмеров, СтрокаПунктовПостановки, СтрокаАдресовСкладов, СтрокаПунктовСдачи));
				
			КонецЦикла;
										
			Для Каждого СтрУслуги Из УслугиАвтоПорожнийКТК Цикл

				ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
				стКритерииУслуги = КритерииУслуг.Получить(СтрУслуги.ИдентификаторСтрокиУслуг);
				ОбластьСтрокаТаблицы.Параметры.ТипоразмерКТК = стКритерииУслуги.ТипоразмерКТК;	
				ОбластьСтрокаТаблицы.Параметры.ПунктПостановки = стКритерииУслуги.ПунктПостановки;	
				ОбластьСтрокаТаблицы.Параметры.ПунктПогрузкиВыгрузки = СтрУслуги.АдресСкладаПогрузкиВыгрузки;	
				ОбластьСтрокаТаблицы.Параметры.ПунктСдачи = стКритерииУслуги.ПунктСдачи;
				//Евросиб Коханенко Н.А. 10.06.2025 (( #110783 
				//Если Док.СуммаВключаетНДС Тогда
				Если ДанныеПСЦ.СуммаВключаетНДС Тогда
				//Евросиб Коханенко Н.А. 10.06.2025 )) #110783 
				ОбластьСтрокаТаблицы.Параметры.СтоимостьУслуг = Формат(СтрУслуги.СтоимостьСНДС, "ЧДЦ=2");
				Иначе
					ОбластьСтрокаТаблицы.Параметры.СтоимостьУслуг = Формат(СтрУслуги.СтоимостьБезНДС, "ЧДЦ=2");
				КонецЕсли;
				Результат.Вывести(ОбластьСтрокаТаблицы);
				
			КонецЦикла;
			
			//выводим примечание1 к таблице "Порожние контейнеры"
			ОбластьПримечаниеТаблицы1 = Макет.ПолучитьОбласть("ПримечаниеТаблицы");
			Если СтрУслуги.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
				ОбластьПримечаниеТаблицы1.Параметры.НДС = "- НДС не облагается";  
			Иначе
				ОбластьПримечаниеТаблицы1.Параметры.НДС = "включает НДС " + Формат(СтрУслуги.СтавкаНДС, "ЧДЦ=2");  
			КонецЕсли;  
			Результат.Вывести(ОбластьПримечаниеТаблицы1);
			
			//выводим примечание2 к таблице "Порожние контейнеры"
			//Евросиб Коханенко Н.А. 06.06.2025 (( #110783 
			//примечание про базовую ставку после ТЧ порожних контейнеров не выводим
			//УслугиБазоваяСтавкаАвто = тчУслуги.НайтиСтроки(Новый Структура("Номенклатура", Справочники.Номенклатура.БазоваяСтавкаАвто));
			//Если УслугиБазоваяСтавкаАвто.Количество() > 0 Тогда 
			//	ОбластьСтрокаУслуги = Макет.ПолучитьОбласть("СтрокаУслуги");
			//	Номер = Неопределено;
			//	Заголовок = "Стоимость базовой ставки за автоперевозку контейнера составляет ";
			//	ОбластьСтрокаУслуги.Параметры.Валюта = Валюта;
			//	ОбластьСтрокаУслуги.Параметры.Заголовок = СтрШаблон("%1%2", ?(Номер <> Неопределено, Номер + ". ", ""), Заголовок);
			//	ОбластьСтрокаУслуги.Параметры.НДС = Формат(?(Док.СуммаВключаетНДС, УслугиБазоваяСтавкаАвто[0].СтоимостьСНДС, УслугиБазоваяСтавкаАвто[0].СтоимостьБезНДС), "ЧДЦ=2");
			//	Если УслугиБазоваяСтавкаАвто[0].СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
			//		ОбластьСтрокаУслуги.Параметры.СтавкаНДС = ", НДС не облагается";  
			//	Иначе
			//		ОбластьСтрокаУслуги.Параметры.СтавкаНДС = СтрокаВТомЧислеНДС + УслугиБазоваяСтавкаАвто[0].СтавкаНДС;  
			//	КонецЕсли;
			//	Результат.Вывести(ОбластьСтрокаУслуги);
			//КонецЕсли;
			//Евросиб Коханенко Н.А. 06.06.2025 )) #110783 
		КонецЕсли; 
		
		//выводим таблицу адресов терминалов
		Если ВыводитьАдресаТерминалов Тогда
			НомерПП = 1;
			СоотвАдресов = Новый Соответствие;

			//получаем данные
			Для Каждого СтрУслуги Из тчУслуги Цикл
				Если ЗначениеЗаполнено(СтрУслуги.ПунктОтправления) Тогда
					Если ТипЗнч(СтрУслуги.ПунктОтправления) = Тип("СправочникСсылка.Локации") Тогда
						ДанныеЛокации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрУслуги.ПунктОтправления, "Тип, Наименование, Адрес");
						Если ДанныеЛокации.Тип = ПредопределенноеЗначение("Справочник.ТипыЛокаций.Терминал") Тогда
							СоотвАдресов.Вставить(ДанныеЛокации.Наименование, ДанныеЛокации.Адрес);
						КонецЕсли;
					ИначеЕсли ТипЗнч(СтрУслуги.ПунктОтправления) = Тип("СправочникСсылка.Мультилокации") Тогда
						тчЛокации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрУслуги.ПунктОтправления, "Локации").Выгрузить();
						Для Каждого ЭлементЛокации Из тчЛокации Цикл 
							Если ТипЗнч(ЭлементЛокации.Локация) = Тип("СправочникСсылка.Локации") Тогда 
								ДанныеЛокации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлементЛокации.Локация, "Тип, Наименование, Адрес");
								Если ДанныеЛокации.Тип = ПредопределенноеЗначение("Справочник.ТипыЛокаций.Терминал") Тогда
									СоотвАдресов.Вставить(ДанныеЛокации.Наименование, ДанныеЛокации.Адрес);
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;

				Если ЗначениеЗаполнено(СтрУслуги.ПунктНазначения) Тогда
					Если ТипЗнч(СтрУслуги.ПунктНазначения) = Тип("СправочникСсылка.Локации") Тогда
						ДанныеЛокации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрУслуги.ПунктНазначения, "Тип, Наименование, Адрес");
						Если ДанныеЛокации.Тип = ПредопределенноеЗначение("Справочник.ТипыЛокаций.Терминал") Тогда
							СоотвАдресов.Вставить(ДанныеЛокации.Наименование, ДанныеЛокации.Адрес);
						КонецЕсли;
					ИначеЕсли ТипЗнч(СтрУслуги.ПунктНазначения) = Тип("СправочникСсылка.Мультилокации") Тогда
						тчЛокации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрУслуги.ПунктНазначения, "Локации").Выгрузить();
						Для Каждого ЭлементЛокации Из тчЛокации Цикл 
							Если ТипЗнч(ЭлементЛокации.Локация) = Тип("СправочникСсылка.Локации") Тогда 
								ДанныеЛокации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлементЛокации.Локация, "Тип, Наименование, Адрес");
								Если ДанныеЛокации.Тип = ПредопределенноеЗначение("Справочник.ТипыЛокаций.Терминал") Тогда
									СоотвАдресов.Вставить(ДанныеЛокации.Наименование, ДанныеЛокации.Адрес);
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;

			Если СоотвАдресов.Количество() > 0 Тогда
				ОбластьШапкаТаблицыАдресовТерминалов = Макет.ПолучитьОбласть("ШапкаТаблицыАдресовТерминалов");
				Результат.Вывести(ОбластьШапкаТаблицыАдресовТерминалов);
			КонецЕсли;
			
			Для Каждого Строка Из СоотвАдресов Цикл	
				ОбластьСтрокаТаблицыАдресовТерминалов = Макет.ПолучитьОбласть("СтрокаТаблицыАдресовТерминалов");
				ОбластьСтрокаТаблицыАдресовТерминалов.Параметры.НомерПП = НомерПП;
				ОбластьСтрокаТаблицыАдресовТерминалов.Параметры.НазваниеТерминала = Строка.Ключ;
				ОбластьСтрокаТаблицыАдресовТерминалов.Параметры.АдресТерминала = Строка.Значение;
				Результат.Вывести(ОбластьСтрокаТаблицыАдресовТерминалов);
				НомерПП = НомерПП + 1;
			КонецЦикла;
		КонецЕсли;

		//выводим "ЭкспедированиеАвтотранспорт 20фут"
		МассивУслуг = тчУслуги.НайтиСтроки(Новый Структура("Номенклатура", Справочники.Номенклатура.ЭкспедированиеАвтотранспорт));
		Если МассивУслуг.Количество() > 0 Тогда
			Типоразмер20 = Ложь;
			Для Каждого СтрокаУслуги Из МассивУслуг Цикл
				Отбор = Новый Структура("ИдентификаторСтрокиУслуг", СтрокаУслуги.ИдентификаторСтрокиУслуг);
				Критерии = Док.КритерииУслуг.НайтиСтроки(Отбор);
				Для Каждого СтрКритерия Из Критерии Цикл 
					Если ЗначениеЗаполнено(СтрКритерия.ТипоразмерКТК) 
							И СтрКритерия.ТипоразмерКТК.РазмерКТК = Справочники.РазмерыКТК.К20 Тогда
						Типоразмер20 = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если Типоразмер20 Тогда                  
					ОбластьСтрокаУслуги = Макет.ПолучитьОбласть("СтрокаУслуги");
					ОбластьСтрокаУслуги.Параметры.НДС = Формат(СтрокаУслуги.СтоимостьСНДС, "ЧДЦ=2");
					Если СтрокаУслуги.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
						ОбластьСтрокаУслуги.Параметры.СтавкаНДС = ", НДС не облагается";  
					Иначе
						ОбластьСтрокаУслуги.Параметры.СтавкаНДС = СтрокаВТомЧислеНДС + СтрокаУслуги.СтавкаНДС;  
					КонецЕсли;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			//Евросиб Коханенко Н.А. 31.07.2025 (( #115525
			//Если Типоразмер20 Тогда	
			ПерваяСтрокаЭкспедирования = Ложь;
			Если Типоразмер20 Тогда	
				ПерваяСтрокаЭкспедирования = Истина;
			//Евросиб Коханенко Н.А. 31.07.2025 )) #115525 
				НомерПункта = НомерПункта + 1;
				Заголовок = "Стоимость услуги ""Экспедирование контейнера"" 20 фут. составляет ";
				ОбластьСтрокаУслуги.Параметры.Валюта = Валюта;
				ОбластьСтрокаУслуги.Параметры.Заголовок = СтрШаблон("%1%2", ?(НомерПункта <> Неопределено, ""+НомерПункта+". ", ""), Заголовок);
				Результат.Вывести(ОбластьСтрокаУслуги);
			КонецЕсли;
		КонецЕсли;

		//выводим "ЭкспедированиеАвтотранспорт 40фут"
		МассивУслуг = тчУслуги.НайтиСтроки(Новый Структура("Номенклатура", Справочники.Номенклатура.ЭкспедированиеАвтотранспорт));
		Если МассивУслуг.Количество() > 0 Тогда
			Типоразмер40 = Ложь;
			Для Каждого СтрокаУслуги Из МассивУслуг Цикл
				Отбор = Новый Структура("ИдентификаторСтрокиУслуг", СтрокаУслуги.ИдентификаторСтрокиУслуг);
				Критерии = Док.КритерииУслуг.НайтиСтроки(Отбор);
				Для Каждого СтрКритерия Из Критерии Цикл 
					Если ЗначениеЗаполнено(СтрКритерия.ТипоразмерКТК) 
							И СтрКритерия.ТипоразмерКТК.РазмерКТК = Справочники.РазмерыКТК.К40 Тогда
						Типоразмер40 = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если Типоразмер40 Тогда
					ОбластьСтрокаУслуги = Макет.ПолучитьОбласть("СтрокаУслуги");
					ОбластьСтрокаУслуги.Параметры.НДС = Формат(СтрокаУслуги.СтоимостьСНДС, "ЧДЦ=2");
					Если СтрокаУслуги.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
						ОбластьСтрокаУслуги.Параметры.СтавкаНДС = ", НДС не облагается";  
					Иначе
						ОбластьСтрокаУслуги.Параметры.СтавкаНДС = СтрокаВТомЧислеНДС + СтрокаУслуги.СтавкаНДС;  
					КонецЕсли;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если Типоразмер40 Тогда
				//Евросиб Коханенко Н.А. 09.07.2025 (( #112962 
				//Номер = Неопределено;                    
				//Евросиб Коханенко Н.А. 31.07.2025 (( #115525 
				//Номер = Истина;
				//НомерПункта = НомерПункта + 1;
				Если ПерваяСтрокаЭкспедирования Тогда
					Номер = Неопределено;
				Иначе
					Номер = Истина;
					НомерПункта = НомерПункта + 1;
				КонецЕсли;
				//Евросиб Коханенко Н.А. 31.07.2025 )) #115525 
				//Евросиб Коханенко Н.А. 09.07.2025 )) #112962 
				Заголовок = "Стоимость услуги ""Экспедирование контейнера"" 40 фут. составляет ";
				ОбластьСтрокаУслуги.Параметры.Валюта = Валюта;
				ОбластьСтрокаУслуги.Параметры.Заголовок = СтрШаблон("%1%2", ?(Номер <> Неопределено, ""+НомерПункта+". ", ""), Заголовок);
				Результат.Вывести(ОбластьСтрокаУслуги);
			КонецЕсли;
		КонецЕсли;
		
		//выводим п.3 "Стоимость Дополнительного адреса погрузки/выгрузки"
		//Евросиб Коханенко Н.А. 29.07.2025 (( #115525 
#Область ПрежнийКодСтоимостиДопАдресаПогрузкиВыгрузки
		//Отбор = Новый Структура("Номенклатура", Справочники.Номенклатура.ДопСборыПрочиеАвто);
		//МассивУслуг = тчУслуги.НайтиСтроки(Отбор);
		//Если МассивУслуг.Количество() > 0 Тогда
		//	ОбластьСтрокаУслуги = Макет.ПолучитьОбласть("СтрокаУслуги");
		//	СтрокаПоиска = "Дополнительный адрес";
		//	ДлинаСтрокиПоиска = СтрДлина(СтрокаПоиска);
		//	Для Каждого СтрокаУслуги Из МассивУслуг Цикл
		//		Если Лев(СтрокаУслуги.НоменклатураПоставщика.Наименование, ДлинаСтрокиПоиска) = СтрокаПоиска Тогда
		//			ОбластьСтрокаУслуги.Параметры.НДС = Формат(СтрокаУслуги.СтоимостьСНДС, "ЧДЦ=2");
		//			Если СтрокаУслуги.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		//				ОбластьСтрокаУслуги.Параметры.СтавкаНДС = ", НДС не облагается";  
		//			Иначе
		//				ОбластьСтрокаУслуги.Параметры.СтавкаНДС = СтрокаВТомЧислеНДС + СтрокаУслуги.СтавкаНДС;  
		//			КонецЕсли;
		//			НомерПункта = НомерПункта + 1;
		//			Заголовок = "Стоимость Дополнительного адреса погрузки/выгрузки составляет ";
		//			ОбластьСтрокаУслуги.Параметры.Валюта = Валюта;
		//			ОбластьСтрокаУслуги.Параметры.Заголовок = СтрШаблон("%1%2", ?(НомерПункта <> Неопределено, ""+НомерПункта+". ", ""), Заголовок);
		//			Результат.Вывести(ОбластьСтрокаУслуги);
		//			Прервать;
		//		КонецЕсли;
		//	КонецЦикла;
		//КонецЕсли;
#КонецОбласти
		Отбор = Новый Структура("Номенклатура", Справочники.Номенклатура.ДопАдрес);
		МассивУслуг = тчУслуги.НайтиСтроки(Отбор);
		Если МассивУслуг.Количество() > 0 Тогда
			ОбластьСтрокаУслуги = Макет.ПолучитьОбласть("СтрокаУслуги"); 
			ПерваяСтрокаДопАдреса = Истина;
			Для Каждого СтрокаУслуги Из МассивУслуг Цикл
				ОбластьСтрокаУслуги.Параметры.НДС = Формат(СтрокаУслуги.СтоимостьСНДС, "ЧДЦ=2");
				Если СтрокаУслуги.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
					ОбластьСтрокаУслуги.Параметры.СтавкаНДС = ", НДС не облагается";  
				Иначе
					ОбластьСтрокаУслуги.Параметры.СтавкаНДС = СтрокаВТомЧислеНДС + СтрокаУслуги.СтавкаНДС;  
				КонецЕсли;                              
				Если ПерваяСтрокаДопАдреса Тогда
					НомерПункта = НомерПункта + 1;
				КонецЕсли;                              
				Заголовок = "Стоимость дополнительного адреса погрузки/выгрузки составляет ";
				ОбластьСтрокаУслуги.Параметры.Валюта = Валюта;
				ОбластьСтрокаУслуги.Параметры.Заголовок = СтрШаблон("%1%2", ?(ПерваяСтрокаДопАдреса, ""+НомерПункта+". ", ""), Заголовок);
				Результат.Вывести(ОбластьСтрокаУслуги);
				ПерваяСтрокаДопАдреса = Ложь;
			КонецЦикла;
		КонецЕсли;	
		//Евросиб Коханенко Н.А. 29.07.2025 )) #115525 

		//выводим п.4 "АвтоперевозкаХолостойПрогон"
		Отбор = Новый Структура("Номенклатура", Справочники.Номенклатура.АвтоперевозкаХолостойПрогон);
		МассивУслуг = тчУслуги.НайтиСтроки(Отбор);
		Если МассивУслуг.Количество() > 0 Тогда
			ОбластьСтрокаУслуги = Макет.ПолучитьОбласть("СтрокаУслуги");
			ОбластьСтрокаУслуги.Параметры.НДС = Формат(МассивУслуг[0].СтоимостьСНДС, "ЧДЦ=2");
			Если МассивУслуг[0].СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
				ОбластьСтрокаУслуги.Параметры.СтавкаНДС = ", НДС не облагается";  
			Иначе
				ОбластьСтрокаУслуги.Параметры.СтавкаНДС = СтрокаВТомЧислеНДС + МассивУслуг[0].СтавкаНДС;  
			КонецЕсли;
			НомерПункта = НомерПункта + 1;
			Заголовок = "Стоимость холостого пробега (прогона) автомашины составляет ";
			ОбластьСтрокаУслуги.Параметры.Валюта = Валюта;
			ОбластьСтрокаУслуги.Параметры.Заголовок = СтрШаблон("%1%2", ?(НомерПункта <> Неопределено, ""+НомерПункта+". ", ""), Заголовок);
			Результат.Вывести(ОбластьСтрокаУслуги);
		КонецЕсли;
		
		//выводим п.5 "СНПАвтотранспорта"
		Отбор = Новый Структура("Номенклатура", Справочники.Номенклатура.СНПАвтотранспорта);
		МассивУслуг = тчУслуги.НайтиСтроки(Отбор);

		Если МассивУслуг.Количество() > 0 Тогда
			ОбластьСтрокаУслуги = Макет.ПолучитьОбласть("СтрокаУслуги");
			ОбластьСтрокаУслуги.Параметры.НДС = Формат(МассивУслуг[0].СтоимостьСНДС, "ЧДЦ=2");
			Если МассивУслуг[0].СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
				ОбластьСтрокаУслуги.Параметры.СтавкаНДС = ", НДС не облагается";  
			Иначе
				ОбластьСтрокаУслуги.Параметры.СтавкаНДС = СтрокаВТомЧислеНДС + МассивУслуг[0].СтавкаНДС;  
			КонецЕсли;
			НомерПункта = НомерПункта + 1;
			Заголовок = "Плата за простой ТС под погрузкой/разгрузкой сверх нормативного времени составляет ";
			ОбластьСтрокаУслуги.Параметры.Валюта = Валюта;
			ОбластьСтрокаУслуги.Параметры.ВалютаДоп = " за полный час";
			ОбластьСтрокаУслуги.Параметры.Заголовок = СтрШаблон("%1%2", ?(НомерПункта <> Неопределено, ""+НомерПункта+". ", ""), Заголовок);
			ОбластьСтрокаУслуги.Области.СтрокаУслуги.ВысотаСтроки = ОбластьСтрокаУслуги.Области.СтрокаУслуги.ВысотаСтроки * 2; 
			Результат.Вывести(ОбластьСтрокаУслуги);
				
			Время20 = Неопределено;
			Время40 = Неопределено;
			Для Каждого Услуга Из МассивУслуг Цикл
				//ищем время погрузки
				Отбор = Новый Структура("ИдентификаторСтрокиУслуг", Услуга.ИдентификаторСтрокиУслуг);
				Критерии = Док.КритерииУслуг.НайтиСтроки(Отбор);
				Для Каждого СтрКритерия Из Критерии Цикл
					Если СтрКритерия.ТипоразмерКТК.Наименование = "20DC" 
							ИЛИ СтрКритерия.ТипоразмерКТК.Наименование = "20RF" Тогда
						Время20 = Услуга.НормативНахожденияНаПогрузке;
					ИначеЕсли СтрКритерия.ТипоразмерКТК.Наименование = "40HC" 
							ИЛИ СтрКритерия.ТипоразмерКТК.Наименование = "40RFHC" Тогда
						Время40 = Услуга.НормативНахожденияНаПогрузке;
					КонецЕсли;
					Если Время20 <> Неопределено
							И Время40 <> Неопределено Тогда
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			//выводим "Нормативное время погрузки/разгрузки 20фут."
			Если Время20 <> Неопределено Тогда
				ОбластьСтрокаУслуги = Макет.ПолучитьОбласть("СтрокаУслуги");
				Номер = Неопределено;
				Заголовок = "Нормативное время погрузки/разгрузки контейнера 20 фут. составляет ";
				ОбластьСтрокаУслуги.Параметры.НДС = Время20;
				ОбластьСтрокаУслуги.Параметры.ВалютаДоп = " час";
				ОбластьСтрокаУслуги.Параметры.Заголовок = СтрШаблон("%1%2", ?(Номер <> Неопределено, ""+НомерПункта+". ", ""), Заголовок);
				Результат.Вывести(ОбластьСтрокаУслуги);
			КонецЕсли; 
			//выводим "Нормативное время погрузки/разгрузки 40фут."
			Если Время40 <> Неопределено Тогда
				ОбластьСтрокаУслуги = Макет.ПолучитьОбласть("СтрокаУслуги");
				Номер = Неопределено;
				Заголовок = "Нормативное время погрузки/разгрузки контейнера 40 фут. составляет ";
				ОбластьСтрокаУслуги.Параметры.НДС = Время40;
				ОбластьСтрокаУслуги.Параметры.ВалютаДоп = " час";
				ОбластьСтрокаУслуги.Параметры.Заголовок = СтрШаблон("%1%2", ?(Номер <> Неопределено, ""+НомерПункта+". ", ""), Заголовок);
				Результат.Вывести(ОбластьСтрокаУслуги);
			КонецЕсли;
		КонецЕсли;
		
		//выводим п.6 "ПревышениеНормыЗагрузкиКонтейнера"
		Отбор = Новый Структура("Номенклатура", Справочники.Номенклатура.ПревышениеНормыЗагрузкиКонтейнера);
		МассивУслуг = тчУслуги.НайтиСтроки(Отбор);
		//Евросиб Коханенко Н.А. 30.07.2025 (( #115525 
#Область ПрежнийПревышенияНормыЗагрузкиКонтейнера
		//Если МассивУслуг.Количество() > 0 Тогда
		//	ОбластьСтрокаУслуги = Макет.ПолучитьОбласть("СтрокаУслуги");
		//	ОбластьСтрокаУслуги.Параметры.НДС = Формат(МассивУслуг[0].СтоимостьСНДС, "ЧДЦ=2");
		//	Если МассивУслуг[0].СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		//		ОбластьСтрокаУслуги.Параметры.СтавкаНДС = ", НДС не облагается";  
		//	Иначе
		//		ОбластьСтрокаУслуги.Параметры.СтавкаНДС = СтрокаВТомЧислеНДС + МассивУслуг[0].СтавкаНДС;  
		//	КонецЕсли;
		//	НомерПункта = НомерПункта + 1;
		//	Заголовок = "Плата за сверхнормативную загрузку контейнера со стороны Заказчика составляет ";
		//	ОбластьСтрокаУслуги.Параметры.Валюта = Валюта;
		//	ОбластьСтрокаУслуги.Параметры.ВалютаДоп = "/тонна";
		//	ОбластьСтрокаУслуги.Параметры.Заголовок = СтрШаблон("%1%2", ?(НомерПункта <> Неопределено, ""+НомерПункта+". ", ""), Заголовок);
		//	ОбластьСтрокаУслуги.Области.СтрокаУслуги.ВысотаСтроки = ОбластьСтрокаУслуги.Области.СтрокаУслуги.ВысотаСтроки * 2; 
		//	Результат.Вывести(ОбластьСтрокаУслуги);

		//	Вес20 = Неопределено;
		//	Вес40 = Неопределено;
		//	Для Каждого Услуга Из МассивУслуг Цикл
		//		//ищем Превышение Нормы Загрузки Контейнера
		//		Отбор = Новый Структура("ИдентификаторСтрокиУслуг", Услуга.ИдентификаторСтрокиУслуг);
		//		Критерии = Док.КритерииУслуг.НайтиСтроки(Отбор);
		//		Для Каждого СтрКритерия Из Критерии Цикл
		//			Если СтрКритерия.ТипоразмерКТК.Наименование = "20DC" 
		//					ИЛИ СтрКритерия.ТипоразмерКТК.Наименование = "20RF" Тогда
		//				Вес20 = Услуга.НормаЗагрузкиКТК.Вес;
		//			ИначеЕсли СтрКритерия.ТипоразмерКТК.Наименование = "40HC" 
		//					ИЛИ СтрКритерия.ТипоразмерКТК.Наименование = "40RFHC" Тогда
		//				Вес40 = Услуга.НормаЗагрузкиКТК.Вес;
		//			КонецЕсли;
		//			Если Вес20 <> Неопределено
		//					И Вес40 <> Неопределено Тогда
		//				Прервать;
		//			КонецЕсли;
		//		КонецЦикла;
		//	КонецЦикла;
		//	//выводим "Превышение Нормы Загрузки Контейнера 20фут."
		//	Если Вес20 <> Неопределено Тогда
		//		ОбластьСтрокаУслуги = Макет.ПолучитьОбласть("СтрокаУслуги");
		//		Номер = Неопределено;
		//		Заголовок = "Норма загрузки контейнера 20 фут. составляет ";
		//		ФорматСтр = ?(Вес20%1000 = 0, "ЧДЦ=0", "ЧДЦ=1");
		//		ОбластьСтрокаУслуги.Параметры.НДС = Формат(Вес20 / 1000, ФорматСтр);
		//		ОбластьСтрокаУслуги.Параметры.ВалютаДоп = " тонн";
		//		ОбластьСтрокаУслуги.Параметры.Заголовок = СтрШаблон("%1%2", ?(Номер <> Неопределено, ""+НомерПункта+". ", ""), Заголовок);
		//		Результат.Вывести(ОбластьСтрокаУслуги);
		//	КонецЕсли; 
		//	//выводим "Превышение Нормы Загрузки Контейнера 40фут."
		//	Если Вес40 <> Неопределено Тогда
		//		ОбластьСтрокаУслуги = Макет.ПолучитьОбласть("СтрокаУслуги");
		//		Номер = Неопределено;
		//		Заголовок = "Норма загрузки контейнера 40 фут. составляет ";
		//		ФорматСтр = ?(Вес40%1000 = 0, "ЧДЦ=0", "ЧДЦ=1");
		//		ОбластьСтрокаУслуги.Параметры.НДС = Формат(Вес40 / 1000, ФорматСтр);
		//		ОбластьСтрокаУслуги.Параметры.ВалютаДоп = " тонн";
		//		ОбластьСтрокаУслуги.Параметры.Заголовок = СтрШаблон("%1%2", ?(Номер <> Неопределено, ""+НомерПункта+". ", ""), Заголовок);
		//		Результат.Вывести(ОбластьСтрокаУслуги);
		//	КонецЕсли;
		//КонецЕсли;
#КонецОбласти
		Если МассивУслуг.Количество() > 0 Тогда
	    	ПерваяСтрокаПревышения = Истина;
			Для Каждого СтрМассиваУслуг Из МассивУслуг Цикл
				ТекстМаршрута = ПолучитьМаршрутПревышенияНормыЗагрузкиКТК(
									СтрМассиваУслуг.ПунктОтправления,
									СтрМассиваУслуг.АдресСкладаПогрузкиВыгрузки,
									СтрМассиваУслуг.ПунктНазначения,
									ПерваяСтрокаПревышения);

				ОбластьСтрокаУслуги = Макет.ПолучитьОбласть("СтрокаУслуги");
				ОбластьСтрокаУслуги.Параметры.НДС = Формат(СтрМассиваУслуг.СтоимостьСНДС, "ЧДЦ=2");
				
				Если СтрМассиваУслуг.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
					ОбластьСтрокаУслуги.Параметры.СтавкаНДС = ", НДС не облагается";  
				Иначе
					ОбластьСтрокаУслуги.Параметры.СтавкаНДС = СтрокаВТомЧислеНДС + СтрМассиваУслуг.СтавкаНДС;  
				КонецЕсли;
				
				Если ПерваяСтрокаПревышения Тогда
					НомерПункта = НомерПункта + 1;
				КонецЕсли;
				
				ОбластьСтрокаУслуги.Параметры.Валюта = Валюта;
				ОбластьСтрокаУслуги.Параметры.ВалютаДоп = "/тонна";
				ОбластьСтрокаУслуги.Параметры.Заголовок = СтрШаблон("%1Плата за сверхнормативную загрузку контейнера со стороны Заказчика%2 составляет", 
															?(ПерваяСтрокаПревышения, "" + НомерПункта + ". ", ""),
															?(ПерваяСтрокаПревышения, "", " при маршруте: " + ТекстМаршрута));
				ОбластьСтрокаУслуги.Области.СтрокаУслуги.ВысотаСтроки = ОбластьСтрокаУслуги.Области.СтрокаУслуги.ВысотаСтроки * 2; 
				Результат.Вывести(ОбластьСтрокаУслуги);
								
				Вес20 = Неопределено;
				Вес40 = Неопределено;  
				
				//ищем Превышение Нормы Загрузки Контейнера
				Отбор = Новый Структура("ИдентификаторСтрокиУслуг", СтрМассиваУслуг.ИдентификаторСтрокиУслуг);
				Критерии = Док.КритерииУслуг.НайтиСтроки(Отбор);
				Для Каждого СтрКритерия Из Критерии Цикл
					Если СтрКритерия.ТипоразмерКТК.Наименование = "20DC" 
							ИЛИ СтрКритерия.ТипоразмерКТК.Наименование = "20RF" Тогда
						Вес20 = СтрМассиваУслуг.НормаЗагрузкиКТК.Вес;
					ИначеЕсли СтрКритерия.ТипоразмерКТК.Наименование = "40HC" 
							ИЛИ СтрКритерия.ТипоразмерКТК.Наименование = "40RFHC" Тогда
						Вес40 = СтрМассиваУслуг.НормаЗагрузкиКТК.Вес;
					КонецЕсли;
					Если Вес20 <> Неопределено
							И Вес40 <> Неопределено Тогда
						Прервать;
					КонецЕсли;
				КонецЦикла;

				//выводим "Превышение Нормы Загрузки Контейнера 20фут."
				Если Вес20 <> Неопределено Тогда
					ОбластьСтрокаУслуги = Макет.ПолучитьОбласть("СтрокаУслуги");
					Номер = Неопределено;
					Заголовок = "Норма загрузки контейнера 20 фут. составляет ";
					ФорматСтр = ?(Вес20%1000 = 0, "ЧДЦ=0", "ЧДЦ=1");
					ОбластьСтрокаУслуги.Параметры.НДС = Формат(Вес20 / 1000, ФорматСтр);
					ОбластьСтрокаУслуги.Параметры.ВалютаДоп = " тонн";
					ОбластьСтрокаУслуги.Параметры.Заголовок = СтрШаблон("%1%2", ?(Номер <> Неопределено, ""+НомерПункта+". ", ""), Заголовок);
					Результат.Вывести(ОбластьСтрокаУслуги);
				КонецЕсли; 
				
				//выводим "Превышение Нормы Загрузки Контейнера 40фут."
				Если Вес40 <> Неопределено Тогда
					ОбластьСтрокаУслуги = Макет.ПолучитьОбласть("СтрокаУслуги");
					Номер = Неопределено;
					Заголовок = "Норма загрузки контейнера 40 фут. составляет ";
					ФорматСтр = ?(Вес40%1000 = 0, "ЧДЦ=0", "ЧДЦ=1");
					ОбластьСтрокаУслуги.Параметры.НДС = Формат(Вес40 / 1000, ФорматСтр);
					ОбластьСтрокаУслуги.Параметры.ВалютаДоп = " тонн";
					ОбластьСтрокаУслуги.Параметры.Заголовок = СтрШаблон("%1%2", ?(Номер <> Неопределено, ""+НомерПункта+". ", ""), Заголовок);
					Результат.Вывести(ОбластьСтрокаУслуги);
				КонецЕсли;

				ПерваяСтрокаПревышения = Ложь;
			КонецЦикла;
		КонецЕсли;
		//Евросиб Коханенко Н.А. 30.07.2025 )) #115525 
		
		//выводим "Особые условия"
		//Евросиб Коханенко Н.А. 10.06.2025 (( #110783 
#Область ПрежнийКодОсобыхУсловий
		//Если ЗначениеЗаполнено(Док.Комментарий) Тогда
		//	ОбластьСтрокаУслуги = Макет.ПолучитьОбласть("СтрокаУслуги");
		//	НомерПункта = НомерПункта + 1;

		//	Заголовок = "Особые условия: ";
		//	ОбластьСтрокаУслуги.Параметры.Заголовок = СтрШаблон("%1%2", ?(НомерПункта <> Неопределено, ""+НомерПункта+". ", ""), Заголовок);
		//	ОбластьСтрокаУслуги.Параметры.СтавкаНДС = Док.Комментарий;
		//	ОбластьСтрокаУслуги.Области.СтрокаУслуги.ВысотаСтроки = ОбластьСтрокаУслуги.Области.СтрокаУслуги.ВысотаСтроки * (Цел((СтрДлина(Док.Комментарий)+16)/100) + 1);
		//	Результат.Вывести(ОбластьСтрокаУслуги);
		//КонецЕсли;
#КонецОбласти
		Если ЗначениеЗаполнено(ДанныеПСЦ.Комментарий) Тогда
			ОбластьСтрокаУслуги = Макет.ПолучитьОбласть("СтрокаУслуги");
			НомерПункта = НомерПункта + 1;

			Заголовок = "Особые условия: ";
			ОбластьСтрокаУслуги.Параметры.Заголовок = СтрШаблон("%1%2", ?(НомерПункта <> Неопределено, ""+НомерПункта+". ", ""), Заголовок);
			ОбластьСтрокаУслуги.Параметры.СтавкаНДС = ДанныеПСЦ.Комментарий;
			ОбластьСтрокаУслуги.Области.СтрокаУслуги.ВысотаСтроки = ОбластьСтрокаУслуги.Области.СтрокаУслуги.ВысотаСтроки * (Цел((СтрДлина(ДанныеПСЦ.Комментарий)+16)/100) + 1);
			Результат.Вывести(ОбластьСтрокаУслуги);
		КонецЕсли;
		//Евросиб Коханенко Н.А. 10.06.2025 )) #110783 
		 
		//подвал
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал"); 
		
		НомерПункта = НомерПункта + 1;
		ОбластьПодвал.Параметры.НомерПункта = НомерПункта; 
		
		//Евросиб Коханенко Н.А. 10.06.2025 (( #110783 
		//ОбластьПодвал.Параметры.НомерДоговора = Док.Договор.Номер;
		//ОбластьПодвал.Параметры.ДатаДоговора = Формат(Док.Договор.Дата, "ДФ=dd.MM.yyyy");
		//ОбластьПодвал.Параметры.НачалоДействия = Формат(Док.НачалоДействия, "ДФ=dd.MM.yyyy");
		//
		//Если ЗначениеЗаполнено(Док.ОкончаниеДействия) Тогда
		//	ОбластьПодвал.Параметры.ОкончаниеДействия = СтрШаблон("и действует по %1г..", Формат(Док.ОкончаниеДействия, "ДФ=dd.MM.yyyy"));
		//КонецЕсли;
        //
		//ОбластьПодвал.Параметры.НаименованиеПодписиИсполнителя = Док.НаименованиеПодписиКонтрагента;
		//ОбластьПодвал.Параметры.НаименованиеИсполнителя = Док.Контрагент.НаименованиеПолное;
		ОбластьПодвал.Параметры.НомерДоговора = ДанныеПСЦ.ДоговорНомер;
		ОбластьПодвал.Параметры.ДатаДоговора = Формат(ДанныеПСЦ.ДоговорДата, "ДФ=dd.MM.yyyy");
		ОбластьПодвал.Параметры.НачалоДействия = Формат(ДанныеПСЦ.НачалоДействия, "ДФ=dd.MM.yyyy");
		
		Если ЗначениеЗаполнено(ДанныеПСЦ.ОкончаниеДействия) Тогда
			ОбластьПодвал.Параметры.ОкончаниеДействия = СтрШаблон("и действует по %1г..", Формат(ДанныеПСЦ.ОкончаниеДействия, "ДФ=dd.MM.yyyy"));
		Иначе
		   	ОбластьПодвал.Параметры.ОкончаниеДействия = "и действует до согласования новых условий."; 
		КонецЕсли;

		ОбластьПодвал.Параметры.НаименованиеПодписиИсполнителя = ДанныеПСЦ.НаименованиеПодписиКонтрагента;
		ОбластьПодвал.Параметры.НаименованиеИсполнителя = ДанныеПСЦ.КонтрагентНаименованиеПолное;
		//Евросиб Коханенко Н.А. 10.06.2025 )) #110783 
		ОбластьПодвал.Параметры.ФИОРуководителяИсполнителя = ФИОРуководителя;
		
		//Евросиб Коханенко Н.А. 10.06.2025 (( #110783 
		//Если ЗначениеЗаполнено(Док.НаименованиеПодписи) Тогда
		//	ОбластьПодвал.Параметры.НаименованиеПодписиКлиента = Док.НаименованиеПодписи;
		Если ЗначениеЗаполнено(ДанныеПСЦ.НаименованиеПодписи) Тогда
			ОбластьПодвал.Параметры.НаименованиеПодписиКлиента = ДанныеПСЦ.НаименованиеПодписи;
		//Евросиб Коханенко Н.А. 10.06.2025 )) #110783 
		Иначе
			ОбластьПодвал.Параметры.НаименованиеПодписиКлиента = "Заказчик";
		КонецЕсли;
		ОбластьПодвал.Параметры.НаименованиеКлиента = НаименованияНаДату.НаименованиеПолное;
		//Евросиб Коханенко Н.А. 10.06.2025 (( #110783 
		//Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя) Тогда
		//	ОбластьПодвал.Параметры.ФИОРуководителяКлиента = Док.ДоверенностьЗаРуководителя.Наименование;
		Если ЗначениеЗаполнено(ДанныеПСЦ.ДоверенностьЗаРуководителя) Тогда
			ОбластьПодвал.Параметры.ФИОРуководителяКлиента = ДанныеПСЦ.ДоверенностьЗаРуководителяНаименование;
		//Евросиб Коханенко Н.А. 10.06.2025 )) #110783 
		Иначе
			ОбластьПодвал.Параметры.ФИОРуководителяКлиента = НашРуководитель.ФИОРус;
		КонецЕсли; 
		
		Если ВыводитьФаксимиле Тогда
			//Евросиб Коханенко Н.А. 10.06.2025 (( #110783 
			//Если ЗначениеЗаполнено(Док.ДоверенностьЗаРуководителя) Тогда
			//	ФайлКартинкиПодписи = Док.ДоверенностьЗаРуководителя.ФайлФаксимиль; 
			//	ФайлКартинкиПечати = Док.ДоверенностьЗаРуководителя.ФайлПечать
			Если ЗначениеЗаполнено(ДанныеПСЦ.ДоверенностьЗаРуководителя) Тогда
				ФайлКартинкиПодписи = ДанныеПСЦ.ДоверенностьЗаРуководителяФайлФаксимиль; 
				ФайлКартинкиПечати = ДанныеПСЦ.ДоверенностьЗаРуководителяФайлПечать
			//Евросиб Коханенко Н.А. 10.06.2025 )) #110783 
			Иначе
				ФайлКартинкиПодписи = НашРуководитель.ФайлФаксимиль;
				ФайлКартинкиПечати = НашРуководитель.ФайлПечать; 
			КонецЕсли;
			Если ЗначениеЗаполнено(ФайлКартинкиПодписи) Тогда
				ДанныеКартинкиПодпись = РаботаСФайлами.ДанныеФайла(ФайлКартинкиПодписи);
				ДвоичныеДанныеПодпись = ПолучитьИзВременногоХранилища(ДанныеКартинкиПодпись.СсылкаНаДвоичныеДанныеФайла);
			Иначе
				ДанныеКартинкиПодпись = Неопределено;
				ОбщегоНазначения.СообщитьПользователю("У подписанта не выбран файл с факсимиле подписи.")
			КонецЕсли;
			Если ЗначениеЗаполнено(ФайлКартинкиПечати) Тогда
				ДанныеКартинкиПечать = РаботаСФайлами.ДанныеФайла(ФайлКартинкиПечати);
				ДвоичныеДанныеПечать = ПолучитьИзВременногоХранилища(ДанныеКартинкиПечать.СсылкаНаДвоичныеДанныеФайла);
			Иначе
				ДанныеКартинкиПечать = Неопределено;
				ОбщегоНазначения.СообщитьПользователю("У подписанта не выбран файл с факсимиле печати.")
			КонецЕсли;
			Если ЗначениеЗаполнено(ДвоичныеДанныеПодпись) Тогда
				ОбластьПодвал.Рисунки.ПодписьРуководителя.Картинка = Новый Картинка(ДвоичныеДанныеПодпись);
			КонецЕсли;
			Если ЗначениеЗаполнено(ДвоичныеДанныеПечать) Тогда
				ОбластьПодвал.Рисунки.Печать.Картинка = Новый Картинка(ДвоичныеДанныеПечать);
			КонецЕсли;
		КонецЕсли;
		//Евросиб Шевченко А.В. US 119623 TA 119624 19.09.2025
		Если НЕ Результат.ПроверитьВывод(ОбластьПодвал) Тогда
            Результат.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		//Евросиб Шевченко А.В. US 119623 TA 119624 19.09.2025
		Результат.Вывести(ОбластьПодвал);  
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции //Евросиб Коханенко Н.А. 06.03.2025 )) #102319 

//Евросиб Коханенко Н.А. 30.07.2025 (( #115525
Функция ПолучитьВышестоящийНаселенныйПункт(Локация)
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(Локация) Тогда
		РеквизитыЛокации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Локация, "Тип, ЛокацияВышестоящегоУровня");
		Если РеквизитыЛокации.Тип = ПредопределенноеЗначение("Справочник.ТипыЛокаций.НаселенныйПункт") Тогда
			Результат = Локация;
		ИначеЕсли РеквизитыЛокации.Тип = ПредопределенноеЗначение("Справочник.ТипыЛокаций.Терминал") 
			ИЛИ РеквизитыЛокации.Тип = ПредопределенноеЗначение("Справочник.ТипыЛокаций.Порт") Тогда
			Результат = Локации_Сервер.ПолучитьЛокациюВУПоЛокацииИТипу(РеквизитыЛокации.ЛокацияВышестоящегоУровня, ПредопределенноеЗначение("Перечисление.ТипыИерархииЛокации.НаселенныйПункт"));
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции //Евросиб Коханенко Н.А. 30.07.2025 )) #115525  

//Евросиб Коханенко Н.А. 30.07.2025 (( #115525
Функция ПолучитьНаименованияНаселенныхПунктовСтрокой(ЛокацияИлиМультилокация)

	Если ЗначениеЗаполнено(ЛокацияИлиМультилокация) Тогда
		МассивЛокаций = Новый Массив;
		Если ТипЗнч(ЛокацияИлиМультилокация) = Тип("СправочникСсылка.Локации") Тогда
			МассивЛокаций.Добавить(ПолучитьВышестоящийНаселенныйПункт(ЛокацияИлиМультилокация));
		ИначеЕсли ТипЗнч(ЛокацияИлиМультилокация) = Тип("СправочникСсылка.Мультилокации") Тогда
			Для Каждого Локация Из ЛокацияИлиМультилокация.Локации Цикл
				МассивЛокаций.Добавить(ПолучитьВышестоящийНаселенныйПункт(Локация.Локация));
			КонецЦикла;	
		КонецЕсли;
		СоответствиеНаименований = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивЛокаций, "Наименование");
		МассивНаименований = Новый Массив();  
		Для Каждого Элемент Из СоответствиеНаименований Цикл  
			МассивНаименований.Добавить(Элемент.Значение.Наименование);  
		КонецЦикла;
		Результат = СтрСоединить(МассивНаименований, ",");
	Иначе
		Результат = ""; 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //Евросиб Коханенко Н.А. 30.07.2025 )) #115525  

//Евросиб Коханенко Н.А. 30.07.2025 (( #115525
Функция ПолучитьНаименованияНаселенныхПунктовПоВладельцуСтрокой(АдресаИлиМультиадреса)

	Если ЗначениеЗаполнено(АдресаИлиМультиадреса) Тогда
		Запрос = Новый Запрос;
		Если ТипЗнч(АдресаИлиМультиадреса) = Тип("СправочникСсылка.АдресаВНаселенныхПунктах") Тогда
			Запрос.Текст = "ВЫБРАТЬ
				|	Локации.Наименование КАК Наименование
				|ИЗ
				|	Справочник.АдресаВНаселенныхПунктах КАК АдресаВНаселенныхПунктах
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Локации КАК Локации
				|		ПО (АдресаВНаселенныхПунктах.Владелец = Локации.Ссылка)
				|			И (АдресаВНаселенныхПунктах.Ссылка = &Ссылка)";
		ИначеЕсли ТипЗнч(АдресаИлиМультиадреса) = Тип("СправочникСсылка.Мультиадреса") Тогда
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Локации.Наименование
				|ИЗ
				|	Справочник.Мультиадреса.Адреса КАК МультиадресаАдреса
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АдресаВНаселенныхПунктах КАК АдресаВНаселенныхПунктах
				|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Локации КАК Локации
				|			ПО (АдресаВНаселенныхПунктах.Владелец = Локации.Ссылка)
				|		ПО (МультиадресаАдреса.Адрес = АдресаВНаселенныхПунктах.Ссылка)
				|			И МультиадресаАдреса.Ссылка = &Ссылка";
		КонецЕсли;
		Запрос.Параметры.Вставить("Ссылка", АдресаИлиМультиадреса);
		ТЗНаименований = Запрос.Выполнить().Выгрузить();
		МассивНаименований = ТЗНаименований.ВыгрузитьКолонку("Наименование");
		Результат = СтрСоединить(МассивНаименований, ",");
	Иначе
		Результат = ""; 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //Евросиб Коханенко Н.А. 30.07.2025 )) #115525  

//Евросиб Коханенко Н.А. 30.07.2025 (( #115525
Функция ПолучитьМаршрутПревышенияНормыЗагрузкиКТК(ПунктВыдачиПостановкиКТК, АдресСкладаПогрузкиВыгрузки, ПунктСдачиКТК, ПерваяСтрокаПревышения)

	Результат = ""; 
	
	Если ПерваяСтрокаПревышения = Истина Тогда
		Возврат Результат;
	КонецЕсли; 
	
	МассивПунктов = Новый Массив;
	
	Если ЗначениеЗаполнено(ПунктВыдачиПостановкиКТК) Тогда
		МассивПунктов.Добавить(ПолучитьНаименованияНаселенныхПунктовСтрокой(ПунктВыдачиПостановкиКТК));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресСкладаПогрузкиВыгрузки) Тогда
		МассивПунктов.Добавить(ПолучитьНаименованияНаселенныхПунктовПоВладельцуСтрокой(АдресСкладаПогрузкиВыгрузки));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПунктСдачиКТК) Тогда
		МассивПунктов.Добавить(ПолучитьНаименованияНаселенныхПунктовСтрокой(ПунктСдачиКТК));
	КонецЕсли;
	
	Результат = СтрСоединить(МассивПунктов, "-");
	
	Возврат Результат;
	
КонецФункции //Евросиб Коханенко Н.А. 30.07.2025 )) #115525  

//Евросиб Каблов 17.12.2025 Ticket#0426699
Функция ПроверитьИзменениеКлючевыхПолейДляОбменаСДО(ДокОбъект) Экспорт
		
	МожноВыгружать = Ложь;
	Если ДокОбъект.Проведен И ЗначениеЗаполнено(ДокОбъект.ДатаСогласования) И ДокОбъект.ПодписанСДвухСторон Тогда
		МожноВыгружать = Истина;
	КонецЕсли;
	
	ИзмененияЕсть = Ложь;
	
	Если МожноВыгружать Тогда
		
		СписокРеквизитовДляСравнения = "ДатаСогласования, ДатаПСЦ, НомерПСЦ, НачалоДействия, ОкончаниеДействия, ДействуетДоСогласованияНовыхУсловий, Автор, ПодписанСДвухСторон, ОтветственныйМенеджер, Контрагент, Договор, Типовой";
		ЗначенияРеквизитовСсылки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокОбъект.Ссылка, СписокРеквизитовДляСравнения);
		ЗначенияРеквизитовОбъекта = Новый Структура(СписокРеквизитовДляСравнения);
		ЗаполнитьЗначенияСвойств(ЗначенияРеквизитовОбъекта, ДокОбъект);
		
		ИзмененияЕсть = Не ОбщегоНазначения.КоллекцииИдентичны(ЗначенияРеквизитовОбъекта, ЗначенияРеквизитовСсылки);
		
	КонецЕсли;
			
	Возврат ИзмененияЕсть;
	
КонецФункции

Процедура СоздатьСтрокиКритериевУслуг(Объект) Экспорт
	
	ТипСтрока36 = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36));
	
	ТаблицаВидовОтправок = Новый ТаблицаЗначений;
	ТаблицаВидовОтправок.Колонки.Добавить("ИдентификаторСтрокиУслуг", ТипСтрока36);
	ТаблицаВидовОтправок.Колонки.Добавить("ВидОтправки", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОтправок"));
	
	ТаблицаТипоразмеровКТК = Новый ТаблицаЗначений;
	ТаблицаТипоразмеровКТК.Колонки.Добавить("ИдентификаторСтрокиУслуг", ТипСтрока36);
	ТаблицаТипоразмеровКТК.Колонки.Добавить("ТипоразмерКТК", Новый ОписаниеТипов("СправочникСсылка.ТипоразмерыТЕ"));
	
	ТаблицаТипоразмеровВагонов = Новый ТаблицаЗначений;
	ТаблицаТипоразмеровВагонов.Колонки.Добавить("ИдентификаторСтрокиУслуг", ТипСтрока36);
	ТаблицаТипоразмеровВагонов.Колонки.Добавить("ТипоразмерВагона", Новый ОписаниеТипов("СправочникСсылка.ТипоразмерыТС"));
	
	Если ТипЗнч(Объект) = Тип("ДанныеФормыСтруктура") Тогда	
		
		Для Каждого Стр Из Объект.Услуги Цикл
			Для Каждого ЭлементСписка Из Стр.ВидыОтправок Цикл
				НоваяСтрока = ТаблицаВидовОтправок.Добавить();
				НоваяСтрока.ИдентификаторСтрокиУслуг = Стр.ИдентификаторСтрокиУслуг;
				НоваяСтрока.ВидОтправки = ЭлементСписка.Значение;
			КонецЦикла;
			Для Каждого ЭлементСписка Из Стр.ТипоразмерыКТК Цикл
				НоваяСтрока = ТаблицаТипоразмеровКТК.Добавить();
				НоваяСтрока.ИдентификаторСтрокиУслуг = Стр.ИдентификаторСтрокиУслуг;
				НоваяСтрока.ТипоразмерКТК = ЭлементСписка.Значение;
			КонецЦикла;
			Для Каждого ЭлементСписка Из Стр.ТипоразмерыВагонов Цикл
				НоваяСтрока = ТаблицаТипоразмеровВагонов.Добавить();
				НоваяСтрока.ИдентификаторСтрокиУслуг = Стр.ИдентификаторСтрокиУслуг;
				НоваяСтрока.ТипоразмерВагона = ЭлементСписка.Значение;
			КонецЦикла;	
		КонецЦикла;	
		
	Иначе
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПСЦПоставщикаКритерииУслуг.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
		|	ПСЦПоставщикаКритерииУслуг.ВидОтправки КАК ВидОтправки
		|ИЗ
		|	Документ.ПСЦПоставщика.КритерииУслуг КАК ПСЦПоставщикаКритерииУслуг
		|ГДЕ
		|	ПСЦПоставщикаКритерииУслуг.Ссылка = &Ссылка
		|;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПСЦПоставщикаКритерииУслуг.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
		|	ПСЦПоставщикаКритерииУслуг.ТипоразмерКТК КАК ТипоразмерКТК
		|ИЗ
		|	Документ.ПСЦПоставщика.КритерииУслуг КАК ПСЦПоставщикаКритерииУслуг
		|ГДЕ
		|	ПСЦПоставщикаКритерииУслуг.Ссылка = &Ссылка
		|;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПСЦПоставщикаКритерииУслуг.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
		|	ПСЦПоставщикаКритерииУслуг.ТипоразмерВагона КАК ТипоразмерВагона
		|ИЗ
		|	Документ.ПСЦПоставщика.КритерииУслуг КАК ПСЦПоставщикаКритерииУслуг
		|ГДЕ
		|	ПСЦПоставщикаКритерииУслуг.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		ВыборкаВидОтправки = РезультатЗапроса[0].Выбрать();
		ВыборкаТипоразмерКТК = РезультатЗапроса[1].Выбрать();
		ВыборкаТипоразмерВагона = РезультатЗапроса[2].Выбрать();
		
		Пока ВыборкаВидОтправки.Следующий() Цикл
			НоваяСтрока = ТаблицаВидовОтправок.Добавить();
			НоваяСтрока.ИдентификаторСтрокиУслуг = ВыборкаВидОтправки.ИдентификаторСтрокиУслуг;
			НоваяСтрока.ВидОтправки = ВыборкаВидОтправки.ВидОтправки;
		КонецЦикла;
		
		Пока ВыборкаТипоразмерКТК.Следующий() Цикл
			НоваяСтрока = ТаблицаТипоразмеровКТК.Добавить();
			НоваяСтрока.ИдентификаторСтрокиУслуг = ВыборкаТипоразмерКТК.ИдентификаторСтрокиУслуг;
			НоваяСтрока.ТипоразмерКТК = ВыборкаТипоразмерКТК.ТипоразмерКТК;
		КонецЦикла;
		
		Пока ВыборкаТипоразмерВагона.Следующий() Цикл
			НоваяСтрока = ТаблицаТипоразмеровВагонов.Добавить();
			НоваяСтрока.ИдентификаторСтрокиУслуг = ВыборкаТипоразмерВагона.ИдентификаторСтрокиУслуг;
			НоваяСтрока.ТипоразмерВагона = ВыборкаТипоразмерВагона.ТипоразмерВагона;
		КонецЦикла;
		
	КонецЕсли;	
	
	//Для Каждого Стр Из Объект.Услуги Цикл		
	//	СформироватьСтрокиКритериевПоТипоразмерамКТКСтрокиТаблицыУслуг(Стр);		
	//КонецЦикла;
	
	МассивПунктов = Новый Массив;
	МассивПунктов.Добавить("ПунктОтправленияГород");
	МассивПунктов.Добавить("ПунктОтправленияСтрана");
	МассивПунктов.Добавить("ПунктНазначенияГород");
	МассивПунктов.Добавить("ПунктНазначенияСтрана");
	МассивПунктов.Добавить("ПунктОтправления");
	МассивПунктов.Добавить("ПунктНазначения");
	МассивПунктов.Добавить("ЛокацияОказанияУслуги");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыУслугПоставщиковПоляТаблицыУслуг.Имя КАК Имя
		|ИЗ
		|	Справочник.ВидыУслугПоставщиков.ПоляТаблицыУслуг КАК ВидыУслугПоставщиковПоляТаблицыУслуг
		|ГДЕ
		|	ВидыУслугПоставщиковПоляТаблицыУслуг.Имя В(&Имя)
		|	И ВидыУслугПоставщиковПоляТаблицыУслуг.Ссылка = &Ссылка
		|	И ВидыУслугПоставщиковПоляТаблицыУслуг.ИмяТаблицы = ""ПСЦПоставщика.Услуги""";
	
	Запрос.УстановитьПараметр("Имя", МассивПунктов);
	Запрос.УстановитьПараметр("Ссылка", Объект.ВидУслугПоставщика);
	
	ПунктыИмена = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Имя");
	
	ТипМультилокация = Тип("СправочникСсылка.Мультилокации");
	
	ЛокацияПустаяСсылка = Справочники.Локации.ПустаяСсылка();
	
	ТипИерархииГород = Перечисления.ТипыИерархииЛокации.НаселенныйПункт;
	ТипИерархииСтрана = Перечисления.ТипыИерархииЛокации.Страна; 
	
	Запрос = Новый Запрос;
	
	#Область ТекстЗапроса
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПСЦПоставщикаУслуги.НомерСтроки КАК НомерСтроки,
	|	ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ПСЦПоставщикаУслуги.ПунктОтправления КАК ПунктОтправления,
	|	ПСЦПоставщикаУслуги.ПунктОтправленияГород КАК ПунктОтправленияГород,
	|	ПСЦПоставщикаУслуги.ПунктОтправленияСтрана КАК ПунктОтправленияСтрана,
	|	ПСЦПоставщикаУслуги.ПунктНазначения КАК ПунктНазначения,
	|	ПСЦПоставщикаУслуги.ПунктНазначенияГород КАК ПунктНазначенияГород,
	|	ПСЦПоставщикаУслуги.ПунктНазначенияСтрана КАК ПунктНазначенияСтрана,
	|	ПСЦПоставщикаУслуги.ЛокацияОказанияУслуги КАК ЛокацияОказанияУслуги,
	|	ПСЦПоставщикаУслуги.СтанцииПогранпереходов КАК СтанцииПогранпереходов
	|ПОМЕСТИТЬ Услуги
	|ИЗ
	|	Документ.ПСЦПоставщика.Услуги КАК ПСЦПоставщикаУслуги
	|;
	|
	//Евросиб Шевченко А.В. US 123730 TA 126329 20.12.202
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Локации.Ссылка КАК Локация,
	|	ИерархияЛокаций.ЛокацияВышестоящегоУровня КАК Страна
	|ИЗ
	|	Справочник.Локации КАК Локации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
	|		ПО Локации.Ссылка = ИерархияЛокаций.Локация
	|			И (ИерархияЛокаций.ТипИерархии = &ТипИерархииСтрана)
	|ГДЕ
	|	Локации.Ссылка В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Услуги.ЛокацияОказанияУслуги КАК ЛокацияОказанияУслуги
	|			ИЗ
	|				Услуги КАК Услуги)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГоризонтальныеСвязиЛокаций.Терминал КАК Локация,
	|	ГоризонтальныеСвязиЛокаций.ЖДСтанция.ЖелезнаяДорога КАК ЖелезнаяДорога,
	|	ГоризонтальныеСвязиЛокаций.Порт КАК Порт,
	|	ИерархияЛокаций.ЛокацияВышестоящегоУровня КАК Страна
	|ИЗ
	|	РегистрСведений.ГоризонтальныеСвязиЛокаций КАК ГоризонтальныеСвязиЛокаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
	|		ПО ГоризонтальныеСвязиЛокаций.ЖДСтанция = ИерархияЛокаций.Локация
	|			И (ИерархияЛокаций.ТипИерархии = &ТипИерархииСтрана)
	|ГДЕ
	|	ГоризонтальныеСвязиЛокаций.Терминал В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Услуги.ЛокацияОказанияУслуги КАК ЛокацияОказанияУслуги
	|			ИЗ
	|				Услуги КАК Услуги)
	|	И ГоризонтальныеСвязиЛокаций.Терминал <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|	И ГоризонтальныеСвязиЛокаций.ЖДСтанция <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГоризонтальныеСвязиЛокаций.Терминал КАК Локация,
	|	ГоризонтальныеСвязиЛокаций.ЖДСтанция.ЖелезнаяДорога КАК ЖелезнаяДорога,
	|	ГоризонтальныеСвязиЛокаций.Порт КАК Порт,
	|	ИерархияЛокаций.ЛокацияВышестоящегоУровня КАК Страна
	|ИЗ
	|	РегистрСведений.ГоризонтальныеСвязиЛокаций КАК ГоризонтальныеСвязиЛокаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
	|		ПО ГоризонтальныеСвязиЛокаций.ЖДСтанция = ИерархияЛокаций.Локация
	|			И (ИерархияЛокаций.ТипИерархии = &ТипИерархииСтрана)
	|ГДЕ
	|	ГоризонтальныеСвязиЛокаций.Порт В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Услуги.ЛокацияОказанияУслуги КАК ЛокацияОказанияУслуги
	|			ИЗ
	|				Услуги КАК Услуги)
	|	И ГоризонтальныеСвязиЛокаций.Порт <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|	И ГоризонтальныеСвязиЛокаций.ЖДСтанция <> ЗНАЧЕНИЕ(Справочник.Локации.ПустаяСсылка)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Услуги.ПунктОтправления КАК Станция,
	|	ВЫБОР
	|		КОГДА МультилокацииЛокации.Локация.ЖелезнаяДорога <> &ДорогаПустаяСсылка
	|			ТОГДА МультилокацииЛокации.Локация.ЖелезнаяДорога.Наименование
	|		ИНАЧЕ МультилокацииЛокации.Локация.ЛокацияВышестоящегоУровня.ЖелезнаяДорога.Наименование
	|	КОНЕЦ КАК ЖелезнаяДорога,
	|	ВЫБОР
	|		КОГДА МультилокацииЛокации.Локация.ЖелезнаяДорога <> &ДорогаПустаяСсылка
	|			ТОГДА МультилокацииЛокации.Локация.ЖелезнаяДорога
	|		ИНАЧЕ МультилокацииЛокации.Локация.ЛокацияВышестоящегоУровня.ЖелезнаяДорога
	|	КОНЕЦ КАК ЖелезнаяДорогаСсылка,
	|	МультилокацииЛокации.Локация КАК Локация	
	|ИЗ
	|	Услуги КАК Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ПО Услуги.ПунктОтправления = МультилокацииЛокации.Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Услуги.ПунктОтправления,
	|	ВЫБОР
	|		КОГДА Локации.ЖелезнаяДорога <> &ДорогаПустаяСсылка
	|			ТОГДА Локации.ЖелезнаяДорога.Наименование
	|		ИНАЧЕ Локации.ЛокацияВышестоящегоУровня.ЖелезнаяДорога.Наименование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Локации.ЖелезнаяДорога <> &ДорогаПустаяСсылка
	|			ТОГДА Локации.ЖелезнаяДорога
	|		ИНАЧЕ Локации.ЛокацияВышестоящегоУровня.ЖелезнаяДорога
	|	КОНЕЦ,
	|	Локации.Ссылка
	|ИЗ
	|	Услуги КАК Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Локации КАК Локации
	|		ПО Услуги.ПунктОтправления = Локации.Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Услуги.ПунктНазначения,
	|	ВЫБОР
	|		КОГДА МультилокацииЛокации.Локация.ЖелезнаяДорога <> &ДорогаПустаяСсылка
	|			ТОГДА МультилокацииЛокации.Локация.ЖелезнаяДорога.Наименование
	|		ИНАЧЕ МультилокацииЛокации.Локация.ЛокацияВышестоящегоУровня.ЖелезнаяДорога.Наименование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МультилокацииЛокации.Локация.ЖелезнаяДорога <> &ДорогаПустаяСсылка
	|			ТОГДА МультилокацииЛокации.Локация.ЖелезнаяДорога
	|		ИНАЧЕ МультилокацииЛокации.Локация.ЛокацияВышестоящегоУровня.ЖелезнаяДорога
	|	КОНЕЦ,
	|	МультилокацииЛокации.Локация
	|ИЗ
	|	Услуги КАК Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ПО Услуги.ПунктНазначения = МультилокацииЛокации.Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Услуги.ПунктНазначения,
	|	ВЫБОР
	|		КОГДА Локации.ЖелезнаяДорога <> &ДорогаПустаяСсылка
	|			ТОГДА Локации.ЖелезнаяДорога.Наименование
	|		ИНАЧЕ Локации.ЛокацияВышестоящегоУровня.ЖелезнаяДорога.Наименование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Локации.ЖелезнаяДорога <> &ДорогаПустаяСсылка
	|			ТОГДА Локации.ЖелезнаяДорога
	|		ИНАЧЕ Локации.ЛокацияВышестоящегоУровня.ЖелезнаяДорога
	|	КОНЕЦ,
	|	Локации.Ссылка
	|ИЗ
	|	Услуги КАК Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Локации КАК Локации
	|		ПО Услуги.ПунктНазначения = Локации.Ссылка
	|;
	//Евросиб Шевченко А.В. US 123730 TA 126329 20.12.202
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТипоразмеровКТК.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ТаблицаТипоразмеровКТК.ТипоразмерКТК КАК ТипоразмерКТК
	|ПОМЕСТИТЬ ТаблицаТипоразмеровКТК
	|ИЗ
	|	&ТаблицаТипоразмеровКТК КАК ТаблицаТипоразмеровКТК
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТипоразмеровВагонов.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ТаблицаТипоразмеровВагонов.ТипоразмерВагона КАК ТипоразмерВагона
	|ПОМЕСТИТЬ ТаблицаТипоразмеровВагонов
	|ИЗ
	|	&ТаблицаТипоразмеровВагонов КАК ТаблицаТипоразмеровВагонов
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаВидовОтправок.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ТаблицаВидовОтправок.ВидОтправки КАК ВидОтправки
	|ПОМЕСТИТЬ ТаблицаВидовОтправок
	|ИЗ
	|	&ТаблицаВидовОтправок КАК ТаблицаВидовОтправок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ЕСТЬNULL(МультилокацииЛокации.Локация, Услуги.ПунктОтправления) КАК ПунктОтправления
	|ПОМЕСТИТЬ ПунктыОтправления
	|ИЗ
	|	Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ПО Услуги.ПунктОтправления = МультилокацииЛокации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ЕСТЬNULL(МультилокацииЛокации.Локация, Услуги.ПунктОтправленияГород) КАК ПунктОтправленияГород
	|ПОМЕСТИТЬ ГородаОтправления
	|ИЗ
	|	Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ПО Услуги.ПунктОтправленияГород = МультилокацииЛокации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ЕСТЬNULL(МультилокацииЛокации.Локация, Услуги.ПунктОтправленияСтрана) КАК ПунктОтправленияСтрана
	|ПОМЕСТИТЬ СтраныОтправления
	|ИЗ
	|	Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ПО Услуги.ПунктОтправленияСтрана = МультилокацииЛокации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПунктыОтправления.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ПунктыОтправления.ПунктОтправления КАК ПунктОтправления,
	|	ИерархияЛокацийГорода.ЛокацияВышестоящегоУровня КАК ЛокацияВышестоящегоУровняГород,
	|	ИерархияЛокацийСтраны.ЛокацияВышестоящегоУровня КАК ЛокацияВышестоящегоУровняСтрана
	|ПОМЕСТИТЬ ПунктыОтправленияСИерархией
	|ИЗ
	|	ПунктыОтправления КАК ПунктыОтправления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокацийГорода
	|		ПО ПунктыОтправления.ПунктОтправления = ИерархияЛокацийГорода.Локация
	|			И (ИерархияЛокацийГорода.ТипИерархии = &ТипИерархииГород)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокацийСтраны
	|		ПО ПунктыОтправления.ПунктОтправления = ИерархияЛокацийСтраны.Локация
	|			И (ИерархияЛокацийСтраны.ТипИерархии = &ТипИерархииСтрана)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГородаОтправления.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ГородаОтправления.ПунктОтправленияГород КАК ПунктОтправленияГород,
	|	ИерархияЛокаций.ЛокацияВышестоящегоУровня КАК ЛокацияВышестоящегоУровняСтрана
	|ПОМЕСТИТЬ ГородаОтправленияСИерархией
	|ИЗ
	|	ГородаОтправления КАК ГородаОтправления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
	|		ПО ГородаОтправления.ПунктОтправленияГород = ИерархияЛокаций.Локация
	|			И (ИерархияЛокаций.ТипИерархии = &ТипИерархииСтрана)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПунктыОтправленияСИерархией.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ПунктыОтправленияСИерархией.ПунктОтправления КАК ПунктОтправления,
	|	ГородаОтправленияСИерархией.ПунктОтправленияГород КАК ПунктОтправленияГород,
	|	ЕСТЬNULL(ГородаОтправленияСИерархией.ЛокацияВышестоящегоУровняСтрана, ПунктыОтправленияСИерархией.ЛокацияВышестоящегоУровняСтрана) КАК ЛокацияВышестоящегоУровняСтрана
	|ПОМЕСТИТЬ ПунктГородОтправления
	|ИЗ
	|	ПунктыОтправленияСИерархией КАК ПунктыОтправленияСИерархией
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГородаОтправленияСИерархией КАК ГородаОтправленияСИерархией
	|		ПО ПунктыОтправленияСИерархией.ИдентификаторСтрокиУслуг = ГородаОтправленияСИерархией.ИдентификаторСтрокиУслуг
	|			И (ВЫБОР
	|				КОГДА ПунктыОтправленияСИерархией.ПунктОтправления = &ЛокацияПустаяСсылка
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ПунктыОтправленияСИерархией.ЛокацияВышестоящегоУровняГород = ГородаОтправленияСИерархией.ПунктОтправленияГород
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПунктГородОтправления.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ПунктГородОтправления.ПунктОтправления КАК ПунктОтправления,
	|	ПунктГородОтправления.ПунктОтправленияГород КАК ПунктОтправленияГород,
	|	СтраныОтправления.ПунктОтправленияСтрана КАК ПунктОтправленияСтрана
	|ПОМЕСТИТЬ ПунктГородСтранаОтправления
	|ИЗ
	|	ПунктГородОтправления КАК ПунктГородОтправления
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтраныОтправления КАК СтраныОтправления
	|		ПО ПунктГородОтправления.ИдентификаторСтрокиУслуг = СтраныОтправления.ИдентификаторСтрокиУслуг
	|			И (ВЫБОР
	|				КОГДА ПунктГородОтправления.ПунктОтправления = &ЛокацияПустаяСсылка
	|						И ПунктГородОтправления.ПунктОтправленияГород = &ЛокацияПустаяСсылка
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ПунктГородОтправления.ЛокацияВышестоящегоУровняСтрана = СтраныОтправления.ПунктОтправленияСтрана
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ЕСТЬNULL(МультилокацииЛокации.Локация, Услуги.ПунктНазначения) КАК ПунктНазначения
	|ПОМЕСТИТЬ ПунктыНазначения
	|ИЗ
	|	Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ПО Услуги.ПунктНазначения = МультилокацииЛокации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ЕСТЬNULL(МультилокацииЛокации.Локация, Услуги.ПунктНазначенияГород) КАК ПунктНазначенияГород
	|ПОМЕСТИТЬ ГородаНазначения
	|ИЗ
	|	Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ПО Услуги.ПунктНазначенияГород = МультилокацииЛокации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ЕСТЬNULL(МультилокацииЛокации.Локация, Услуги.ПунктНазначенияСтрана) КАК ПунктНазначенияСтрана
	|ПОМЕСТИТЬ СтраныНазначения
	|ИЗ
	|	Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ПО Услуги.ПунктНазначенияСтрана = МультилокацииЛокации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПунктыНазначения.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ПунктыНазначения.ПунктНазначения КАК ПунктНазначения,
	|	ИерархияЛокацийГорода.ЛокацияВышестоящегоУровня КАК ЛокацияВышестоящегоУровняГород,
	|	ИерархияЛокацийСтраны.ЛокацияВышестоящегоУровня КАК ЛокацияВышестоящегоУровняСтрана
	|ПОМЕСТИТЬ ПунктыНазначенияСИерархией
	|ИЗ
	|	ПунктыНазначения КАК ПунктыНазначения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокацийГорода
	|		ПО ПунктыНазначения.ПунктНазначения = ИерархияЛокацийГорода.Локация
	|			И (ИерархияЛокацийГорода.ТипИерархии = &ТипИерархииГород)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокацийСтраны
	|		ПО ПунктыНазначения.ПунктНазначения = ИерархияЛокацийСтраны.Локация
	|			И (ИерархияЛокацийСтраны.ТипИерархии = &ТипИерархииСтрана)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГородаНазначения.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ГородаНазначения.ПунктНазначенияГород КАК ПунктНазначенияГород,
	|	ИерархияЛокаций.ЛокацияВышестоящегоУровня КАК ЛокацияВышестоящегоУровняСтрана
	|ПОМЕСТИТЬ ГородаНазначенияСИерархией
	|ИЗ
	|	ГородаНазначения КАК ГородаНазначения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
	|		ПО ГородаНазначения.ПунктНазначенияГород = ИерархияЛокаций.Локация
	|			И (ИерархияЛокаций.ТипИерархии = &ТипИерархииСтрана)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПунктыНазначенияСИерархией.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ПунктыНазначенияСИерархией.ПунктНазначения КАК ПунктНазначения,
	|	ГородаНазначенияСИерархией.ПунктНазначенияГород КАК ПунктНазначенияГород,
	|	ЕСТЬNULL(ГородаНазначенияСИерархией.ЛокацияВышестоящегоУровняСтрана, ПунктыНазначенияСИерархией.ЛокацияВышестоящегоУровняСтрана) КАК ЛокацияВышестоящегоУровняСтрана
	|ПОМЕСТИТЬ ПунктГородНазначения
	|ИЗ
	|	ПунктыНазначенияСИерархией КАК ПунктыНазначенияСИерархией
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГородаНазначенияСИерархией КАК ГородаНазначенияСИерархией
	|		ПО ПунктыНазначенияСИерархией.ИдентификаторСтрокиУслуг = ГородаНазначенияСИерархией.ИдентификаторСтрокиУслуг
	|			И (ВЫБОР
	|				КОГДА ПунктыНазначенияСИерархией.ПунктНазначения = &ЛокацияПустаяСсылка
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ПунктыНазначенияСИерархией.ЛокацияВышестоящегоУровняГород = ГородаНазначенияСИерархией.ПунктНазначенияГород
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПунктГородНазначения.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ПунктГородНазначения.ПунктНазначения КАК ПунктНазначения,
	|	ПунктГородНазначения.ПунктНазначенияГород КАК ПунктНазначенияГород,
	|	СтраныНазначения.ПунктНазначенияСтрана КАК ПунктНазначенияСтрана
	|ПОМЕСТИТЬ ПунктГородСтранаНазначения
	|ИЗ
	|	ПунктГородНазначения КАК ПунктГородНазначения
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтраныНазначения КАК СтраныНазначения
	|		ПО ПунктГородНазначения.ИдентификаторСтрокиУслуг = СтраныНазначения.ИдентификаторСтрокиУслуг
	|			И (ВЫБОР
	|				КОГДА ПунктГородНазначения.ПунктНазначения = &ЛокацияПустаяСсылка
	|						И ПунктГородНазначения.ПунктНазначенияГород = &ЛокацияПустаяСсылка
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ПунктГородНазначения.ЛокацияВышестоящегоУровняСтрана = СтраныНазначения.ПунктНазначенияСтрана
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ЕСТЬNULL(МультилокацииЛокации.Локация, Услуги.ЛокацияОказанияУслуги) КАК ЛокацияОказанияУслуги
	|ПОМЕСТИТЬ ЛокацииОказанияУслуги
	|ИЗ
	|	Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ПО Услуги.ЛокацияОказанияУслуги = МультилокацииЛокации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ЕСТЬNULL(МультилокацииЛокации.Локация, Услуги.СтанцииПогранпереходов) КАК СтанцияПогранПереходов
	|ПОМЕСТИТЬ ВТСтанцииПогранПереходов
	|ИЗ
	|	Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мультилокации.Локации КАК МультилокацииЛокации
	|		ПО Услуги.СтанцииПогранпереходов = МультилокацииЛокации.Ссылка
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Услуги.НомерСтроки КАК НомерСтроки,
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ПунктГородСтранаОтправления.ПунктОтправления КАК ПунктОтправления,
	|	ПунктГородСтранаОтправления.ПунктОтправленияГород КАК ПунктОтправленияГород,
	|	ПунктГородСтранаОтправления.ПунктОтправленияСтрана КАК ПунктОтправленияСтрана,
	|	ПунктГородСтранаНазначения.ПунктНазначения КАК ПунктНазначения,
	|	ПунктГородСтранаНазначения.ПунктНазначенияГород КАК ПунктНазначенияГород,
	|	ПунктГородСтранаНазначения.ПунктНазначенияСтрана КАК ПунктНазначенияСтрана,
	|	ЛокацииОказанияУслуги.ЛокацияОказанияУслуги КАК ЛокацияОказанияУслуги,
	// Евросиб Ситников К.А. Task 114433 16.07.2025
	|	ВТСтанцииПогранПереходов.СтанцияПогранПереходов КАК СтанцииПогранпереходов,
	// Евросиб Ситников К.А. Task 114433 16.07.2025
	|	ТаблицаВидовОтправок.ВидОтправки КАК ВидОтправки,
	|	ТаблицаТипоразмеровКТК.ТипоразмерКТК КАК ТипоразмерКТК,
	|	ТаблицаТипоразмеровВагонов.ТипоразмерВагона КАК ТипоразмерВагона,
	//Евросиб Шевченко А.В. US 123730 TA 125663 15.12.2025
	|	ВЫБОР
	|		КОГДА ПунктГородСтранаОтправления.ПунктОтправления.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.НаселенныйПункт)
	|			ТОГДА 1
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПунктГородСтранаОтправления.ПунктОтправления.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Терминал)
	|						ИЛИ ПунктГородСтранаОтправления.ПунктОтправления.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.ПОРТ)
	|						ИЛИ ПунктГородСтранаОтправления.ПунктОтправления.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.СтанцияЖД)
	|						ИЛИ ПунктГородСтранаОтправления.ПунктОтправления.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Сток)
	|					ТОГДА 2
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК ТипПунктаОтправленияАвто,
	|	ВЫБОР
	|		КОГДА ПунктГородСтранаНазначения.ПунктНазначения.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.НаселенныйПункт)
	|			ТОГДА 1
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПунктГородСтранаНазначения.ПунктНазначения.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Терминал)
	|						ИЛИ ПунктГородСтранаНазначения.ПунктНазначения.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.ПОРТ)
	|						ИЛИ ПунктГородСтранаНазначения.ПунктНазначения.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.СтанцияЖД)
	|						ИЛИ ПунктГородСтранаНазначения.ПунктНазначения.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Сток)
	|					ТОГДА 2
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК ТипПунктаНазначенияАвто,
	|	ИерархияЛокаций.ЛокацияВышестоящегоУровня КАК ПунктОтправленияРегионАвто,
	|	ИерархияЛокаций1.ЛокацияВышестоящегоУровня КАК ПунктНазначенияРегионАвто,
	|	ИерархияЛокаций2.ЛокацияВышестоящегоУровня КАК ПунктОтправленияГородАвто,
	|	ИерархияЛокаций3.ЛокацияВышестоящегоУровня КАК ПунктНазначенияГородАвто,
	|	ИерархияЛокаций4.ЛокацияВышестоящегоУровня КАК ПунктОтправленияСтранаАвто,
	|	ИерархияЛокаций5.ЛокацияВышестоящегоУровня КАК ПунктНазначенияСтранаАвто,
	//Евросиб Шевченко А.В. US 123730 TA 125663 15.12.2025
	//Евросиб Шевченко А.В. US 123730 TA 125713 15.12.2025
	|	ВЫБОР КОГДА ЛокацииОказанияУслуги.ЛокацияОказанияУслуги.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.НаселенныйПункт)
	|		ТОГДА 1
	|	ИНАЧЕ ВЫБОР
	|				КОГДА ЛокацииОказанияУслуги.ЛокацияОказанияУслуги.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Терминал)
	|						ИЛИ ЛокацииОказанияУслуги.ЛокацияОказанияУслуги.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.ПОРТ)
	|						ИЛИ ЛокацииОказанияУслуги.ЛокацияОказанияУслуги.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.СтанцияЖД)
	|						ИЛИ ЛокацииОказанияУслуги.ЛокацияОказанияУслуги.Тип = ЗНАЧЕНИЕ(Справочник.ТипыЛокаций.Сток)
	|					ТОГДА 2
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК ТипПунктаЛокацияОказанияУслуг,
	|	ИерархияЛокацийОказанияУслуг.ЛокацияВышестоящегоУровня КАК ПунктЛокацияОказанияУслугРегион,
	|	ИерархияЛокацийОказанияУслуг2.ЛокацияВышестоящегоУровня КАК ПунктЛокацияОказанияУслугГород,
	|	ИерархияЛокацийОказанияУслуг3.ЛокацияВышестоящегоУровня КАК ПунктЛокацияОказанияУслугСтрана,
	//Евросиб Шевченко А.В. US 123730 TA 125713 15.12.2025
	|   ТИПЗНАЧЕНИЯ(Услуги.ПунктОтправления) = ТИП(Справочник.Мультилокации) КАК ПунктОтправленияМултилокация,
	|   ТИПЗНАЧЕНИЯ(Услуги.ПунктНазначения) = ТИП(Справочник.Мультилокации) КАК ПунктНазначенияМултилокация
	|ИЗ
	|	Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПунктГородСтранаОтправления КАК ПунктГородСтранаОтправления
	|		ПО Услуги.ИдентификаторСтрокиУслуг = ПунктГородСтранаОтправления.ИдентификаторСтрокиУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПунктГородСтранаНазначения КАК ПунктГородСтранаНазначения
	|		ПО Услуги.ИдентификаторСтрокиУслуг = ПунктГородСтранаНазначения.ИдентификаторСтрокиУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЛокацииОказанияУслуги КАК ЛокацииОказанияУслуги
	|		ПО Услуги.ИдентификаторСтрокиУслуг = ЛокацииОказанияУслуги.ИдентификаторСтрокиУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтанцииПогранПереходов КАК ВТСтанцииПогранПереходов
	|		ПО Услуги.ИдентификаторСтрокиУслуг = ВТСтанцииПогранПереходов.ИдентификаторСтрокиУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВидовОтправок КАК ТаблицаВидовОтправок
	|		ПО Услуги.ИдентификаторСтрокиУслуг = ТаблицаВидовОтправок.ИдентификаторСтрокиУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТипоразмеровКТК КАК ТаблицаТипоразмеровКТК
	|		ПО Услуги.ИдентификаторСтрокиУслуг = ТаблицаТипоразмеровКТК.ИдентификаторСтрокиУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТипоразмеровВагонов КАК ТаблицаТипоразмеровВагонов
	|		ПО Услуги.ИдентификаторСтрокиУслуг = ТаблицаТипоразмеровВагонов.ИдентификаторСтрокиУслуг
	//Евросиб Шевченко А.В. US 123730 TA 125663 15.12.2025
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций
	|		ПО (ИерархияЛокаций.Локация = ПунктГородСтранаОтправления.ПунктОтправления)
	|			И (ИерархияЛокаций.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.РЕгион))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций1
	|		ПО (ИерархияЛокаций1.Локация = ПунктГородСтранаНазначения.ПунктНазначения)
	|			И (ИерархияЛокаций1.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.РЕгион))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций2
	|		ПО (ИерархияЛокаций2.Локация = ПунктГородСтранаОтправления.ПунктОтправления)
	|			И (ИерархияЛокаций2.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.НаселенныйПункт))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций3
	|		ПО (ИерархияЛокаций3.Локация = ПунктГородСтранаНазначения.ПунктНазначения)
	|			И (ИерархияЛокаций3.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.НаселенныйПункт))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций4
	|		ПО (ВЫБОР КОГДА ПунктГородСтранаОтправления.ПунктОтправления = &ЛокацияПустаяСсылка ТОГДА ИерархияЛокаций4.Локация = ПунктГородСтранаОтправления.ПунктОтправленияГород ИНАЧЕ ИерархияЛокаций4.Локация = ПунктГородСтранаОтправления.ПунктОтправления КОНЕЦ)
	|			И (ИерархияЛокаций4.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.Страна))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокаций5
	|		ПО (ВЫБОР КОГДА ПунктГородСтранаНазначения.ПунктНазначения = &ЛокацияПустаяСсылка ТОГДА ИерархияЛокаций5.Локация = ПунктГородСтранаНазначения.ПунктНазначенияГород ИНАЧЕ ИерархияЛокаций5.Локация = ПунктГородСтранаНазначения.ПунктНазначения КОНЕЦ)
	|			И (ИерархияЛокаций5.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.Страна))
	//Евросиб Шевченко А.В. US 123730 TA 125663 15.12.2025
	//Евросиб Шевченко А.В. US 123730 TA 125713 15.12.2025
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокацийОказанияУслуг
	|		ПО (ИерархияЛокацийОказанияУслуг.Локация = ЛокацииОказанияУслуги.ЛокацияОказанияУслуги)
	|			И (ИерархияЛокацийОказанияУслуг.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.РЕгион))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокацийОказанияУслуг2
	|		ПО (ИерархияЛокацийОказанияУслуг2.Локация = ЛокацииОказанияУслуги.ЛокацияОказанияУслуги)
	|			И (ИерархияЛокацийОказанияУслуг2.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.НаселенныйПункт))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЛокаций КАК ИерархияЛокацийОказанияУслуг3
	|		ПО (ИерархияЛокацийОказанияУслуг3.Локация = ЛокацииОказанияУслуги.ЛокацияОказанияУслуги)
	|			И (ИерархияЛокацийОказанияУслуг3.ТипИерархии = ЗНАЧЕНИЕ(Перечисление.ТипыИерархииЛокации.Страна))
	//Евросиб Шевченко А.В. US 123730 TA 125713 15.12.2025
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	#КонецОбласти
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ПСЦПоставщика.Услуги", "&Услуги");
	Запрос.УстановитьПараметр("Услуги", Объект.Услуги.Выгрузить());
	Запрос.УстановитьПараметр("ДорогаПустаяСсылка", Справочники.ЖелезныеДороги.ПустаяСсылка());
	Запрос.УстановитьПараметр("ТипИерархииСтрана", Перечисления.ТипыИерархииЛокации.Страна);
	
	Запрос.УстановитьПараметр("ТаблицаВидовОтправок", ТаблицаВидовОтправок);
	Запрос.УстановитьПараметр("ТаблицаТипоразмеровКТК", ТаблицаТипоразмеровКТК);
	Запрос.УстановитьПараметр("ТаблицаТипоразмеровВагонов", ТаблицаТипоразмеровВагонов);
	
	Запрос.УстановитьПараметр("ЛокацияПустаяСсылка", ЛокацияПустаяСсылка);
	Запрос.УстановитьПараметр("ТипИерархииГород", ТипИерархииГород);
	Запрос.УстановитьПараметр("ТипИерархииСтрана", ТипИерархииСтрана);
	
	
	РезультатПакет = Запрос.ВыполнитьПакет();
	КоличествоРезультатов = РезультатПакет.Количество();
	Выборка = РезультатПакет[КоличествоРезультатов - 1].Выбрать();
	//Евросиб Шевченко А.В. US 123730 TA 126329 20.12.202
	ТаблицаДорог = РезультатПакет[КоличествоРезультатов - 21].Выгрузить();
	ЛокацияСтрана = РезультатПакет[КоличествоРезультатов - 23].Выгрузить();
	ТерминалыЖелезныеДороги = РезультатПакет[КоличествоРезультатов - 22].Выгрузить();
	//Евросиб Шевченко А.В. US 123730 TA 126329 20.12.202
	
	Объект.КритерииУслуг.Очистить();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.КритерииУслуг.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		СтруктураПоиска = Новый Структура("ИдентификаторСтрокиУслуг",Выборка.ИдентификаторСтрокиУслуг);
		НайденныеСтрокиУслуги = Объект.Услуги.НайтиСтроки(СтруктураПоиска);
		СтрУслуги = НайденныеСтрокиУслуги[0];
		
		ВыполнитьАвтоматическоеЗаполнениеПунктовГородовСтран(НоваяСтрока,Выборка,ПунктыИмена,СтрУслуги); //Евросиб Шевченко А.В. US 123730 TA 125663 15.12.2025
		ВыполнитьАвтоматическоеЗаполнениеЛокацииОказанияУслугГородовСтран(НоваяСтрока,Выборка,ПунктыИмена); //Евросиб Шевченко А.В. US 123730 TA 125713 15.12.2025
		
		ЗаполнитьДорогиЖД(Объект, НоваяСтрока,ТаблицаДорог,ЛокацияСтрана,ТерминалыЖелезныеДороги); //Евросиб Шевченко А.В. US 123730 TA 126329 20.12.202
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДорогиЖД(Объект, НоваяСтрока,ТаблицаДорог,ЛокацияСтрана,ТерминалыЖелезныеДороги) //Евросиб Шевченко А.В. US 123730 TA 126329 20.12.202
	
	Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Вагоны Тогда		
		Если ЗначениеЗаполнено(НоваяСтрока.ПунктОтправления) Тогда			
			Дороги = ТаблицаДорог.Скопировать(Новый Структура("Локация", НоваяСтрока.ПунктОтправления));
			
			Если Дороги.Количество() Тогда
				НоваяСтрока.ДорогаОтправления = Дороги[0].ЖелезнаяДорогаСсылка;
			КонецЕсли;

		КонецЕсли;
		
		Если ЗначениеЗаполнено(НоваяСтрока.ПунктНазначения) Тогда
			Дороги = ТаблицаДорог.Скопировать(Новый Структура("Локация", НоваяСтрока.ПунктНазначения));
			
			Если Дороги.Количество() Тогда
				НоваяСтрока.ДорогаНазначения = Дороги[0].ЖелезнаяДорогаСсылка;
			КонецЕсли;
			
		КонецЕсли;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НоваяСтрока.ЛокацияОказанияУслуги) Тогда
		
		Если Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Порты ИЛИ Объект.ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Терминалы Тогда
			ЖелезныеДороги = Новый Массив;
			НайденныеСтроки = Новый Массив;
			Если ТипЗнч(НоваяСтрока.ЛокацияОказанияУслуги) = Тип("СправочникСсылка.Локации") Тогда
				НайденныеСтрокиСтраны = ЛокацияСтрана.НайтиСтроки(Новый Структура("Локация", НоваяСтрока.ЛокацияОказанияУслуги));
				Если НоваяСтрока.ЛокацияОказанияУслуги.Тип = Справочники.ТипыЛокаций.Порт Тогда
					НайденныеСтроки = ТерминалыЖелезныеДороги.НайтиСтроки(Новый Структура("Порт", НоваяСтрока.ЛокацияОказанияУслуги));
				КонецЕсли;
				Если НоваяСтрока.ЛокацияОказанияУслуги.Тип = Справочники.ТипыЛокаций.Терминал Тогда
					НайденныеСтроки = ТерминалыЖелезныеДороги.НайтиСтроки(Новый Структура("Локация", НоваяСтрока.ЛокацияОказанияУслуги));
				КонецЕсли;
				
				
				Для Каждого Стр Из НайденныеСтрокиСтраны Цикл
					ЭтоРОССИЯ = Ложь;
					Если Стр.Страна = Справочники.Локации.РОССИЯ Тогда
						ЭтоРОССИЯ = Истина;	
					КонецЕсли;
					Страна = Стр.Страна;
				КонецЦикла;	
				
				Для Каждого Стр Из НайденныеСтроки Цикл
					Если ЭтоРОССИЯ Тогда
						НоваяСтрока.ЖелезнаяДорога = Стр.ЖелезнаяДорога; 
					КонецЕсли;	
				КонецЦикла;	
				
				Если НЕ ЭтоРОССИЯ Тогда
					НоваяСтрока.ЖелезнаяДорога = Страна;
				КонецЕсли;				
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьАвтоматическоеЗаполнениеЛокацииОказанияУслугГородовСтран(НоваяСтрока,Выборка,ПунктыИмена) //Евросиб Шевченко А.В. US 123730 TA 125713 15.12.2025
	
	Если ПунктыИмена.Найти("ЛокацияОказанияУслуги") <> Неопределено Тогда
		
		Если Выборка.ТипПунктаЛокацияОказанияУслуг = 1 Тогда
			НоваяСтрока.ЛокацияОказанияУслугГород = НоваяСтрока.ЛокацияОказанияУслуги;
		ИначеЕсли Выборка.ТипПунктаЛокацияОказанияУслуг = 2 Тогда
			Если ЗначениеЗаполнено(Выборка.ПунктЛокацияОказанияУслугГород) Тогда
				НоваяСтрока.ЛокацияОказанияУслугГород = Выборка.ПунктЛокацияОказанияУслугГород;
			Иначе
				НоваяСтрока.ЛокацияОказанияУслугГород = Выборка.ПунктЛокацияОказанияУслугРегион;
			КонецЕсли;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ПунктЛокацияОказанияУслугСтрана) Тогда
			НоваяСтрока.ЛокацияОказанияУслугСтрана = Выборка.ПунктЛокацияОказанияУслугСтрана;
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ВыполнитьАвтоматическоеЗаполнениеПунктовГородовСтран(НоваяСтрока,ВыборкаДетальныеЗаписи,ПунктыИмена,СтрУслуги) //Евросиб Шевченко А.В. US 123730 TA 125663 15.12.2025
		
	Если ЗначениеЗаполнено(НоваяСтрока.ПунктОтправления) И НЕ ЗначениеЗаполнено(НоваяСтрока.ПунктОтправленияГород) И ТипЗнч(НоваяСтрока.ПунктОтправления) = Тип("СправочникСсылка.Локации") Тогда
		Если ВыборкаДетальныеЗаписи.ТипПунктаОтправленияАвто = 1 Тогда
			НоваяСтрока.ПунктОтправленияГород = НоваяСтрока.ПунктОтправления;
		ИначеЕсли ВыборкаДетальныеЗаписи.ТипПунктаОтправленияАвто = 2 Тогда
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПунктОтправленияГородАвто) Тогда
				НоваяСтрока.ПунктОтправленияГород = ВыборкаДетальныеЗаписи.ПунктОтправленияГородАвто;
			Иначе
				НоваяСтрока.ПунктОтправленияГород = ВыборкаДетальныеЗаписи.ПунктОтправленияРегионАвто;
			КонецЕсли;	
		КонецЕсли;
		Если ПунктыИмена.Найти("ПунктОтправленияГород") <> Неопределено Тогда
			Если НЕ ЗначениеЗаполнено(СтрУслуги.ПунктОтправленияГород) И ТипЗнч(СтрУслуги.ПунктОтправления) = Тип("СправочникСсылка.Локации") Тогда
				СтрУслуги.ПунктОтправленияГород = НоваяСтрока.ПунктОтправленияГород;
			КонецЕсли;	                                                      
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НоваяСтрока.ПунктНазначения) И НЕ ЗначениеЗаполнено(НоваяСтрока.ПунктНазначенияГород) И ТипЗнч(НоваяСтрока.ПунктНазначения) = Тип("СправочникСсылка.Локации") Тогда
		Если ВыборкаДетальныеЗаписи.ТипПунктаНазначенияАвто = 1 Тогда
			НоваяСтрока.ПунктНазначенияГород = НоваяСтрока.ПунктНазначения;
		ИначеЕсли ВыборкаДетальныеЗаписи.ТипПунктаНазначенияАвто = 2 Тогда
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПунктНазначенияГородАвто) Тогда
				НоваяСтрока.ПунктНазначенияГород = ВыборкаДетальныеЗаписи.ПунктНазначенияГородАвто;
			Иначе
				НоваяСтрока.ПунктНазначенияГород = ВыборкаДетальныеЗаписи.ПунктНазначенияРегионАвто;
			КонецЕсли;	
		КонецЕсли;
		Если ПунктыИмена.Найти("ПунктНазначенияГород") <> Неопределено Тогда
			Если НЕ ЗначениеЗаполнено(СтрУслуги.ПунктНазначенияГород) И ТипЗнч(СтрУслуги.ПунктНазначения) = Тип("СправочникСсылка.Локации") Тогда
				СтрУслуги.ПунктНазначенияГород = НоваяСтрока.ПунктНазначенияГород;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НоваяСтрока.ПунктОтправленияГород) И НЕ ЗначениеЗаполнено(НоваяСтрока.ПунктОтправленияСтрана) И ТипЗнч(НоваяСтрока.ПунктОтправленияГород) = Тип("СправочникСсылка.Локации") Тогда
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПунктОтправленияСтранаАвто) Тогда
			НоваяСтрока.ПунктОтправленияСтрана = ВыборкаДетальныеЗаписи.ПунктОтправленияСтранаАвто;
		КонецЕсли;
		Если ПунктыИмена.Найти("ПунктОтправленияСтрана") <> Неопределено Тогда
			Если НЕ ЗначениеЗаполнено(СтрУслуги.ПунктОтправленияСтрана) И ТипЗнч(СтрУслуги.ПунктОтправленияГород) = Тип("СправочникСсылка.Локации") Тогда
				СтрУслуги.ПунктОтправленияСтрана = НоваяСтрока.ПунктОтправленияСтрана;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НоваяСтрока.ПунктНазначенияГород) И НЕ ЗначениеЗаполнено(НоваяСтрока.ПунктНазначенияСтрана) И ТипЗнч(НоваяСтрока.ПунктНазначенияГород) = Тип("СправочникСсылка.Локации") Тогда
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПунктНазначенияСтранаАвто) Тогда
			НоваяСтрока.ПунктНазначенияСтрана = ВыборкаДетальныеЗаписи.ПунктНазначенияСтранаАвто;
		КонецЕсли;
		Если ПунктыИмена.Найти("ПунктНазначенияСтрана") <> Неопределено Тогда
			Если НЕ ЗначениеЗаполнено(СтрУслуги.ПунктНазначенияСтрана) И ТипЗнч(СтрУслуги.ПунктНазначенияГород) = Тип("СправочникСсылка.Локации") Тогда
				СтрУслуги.ПунктНазначенияСтрана = НоваяСтрока.ПунктНазначенияСтрана;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
	
