
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	КонтрольДоступностиДокументов_сервер.ПроверитьДоступностьПолейДляИзменения(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//Евросиб Трундуков СА # 119893 22.09.2025 Начало
	Если ЗначениеЗаполнено(НомерПСЦ) И  РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		НомерПСЦУникален = Документы.ПСЦПоставщика.ПроверитьУникальностьНомераПСЦ(ЭтотОбъект);
		Если Не НомерПСЦУникален Тогда
			ОбщегоНазначения.СообщитьПользователю("Уже есть проведенный ПСЦ поставщика с таким Номером ПСЦ!",, "НомерПСЦ", "ЭтотОбъект", Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	//Евросиб Трундуков СА # 119893 22.09.2025 Конец
	
	Редактор = Пользователи.ТекущийПользователь();
	Изменено = ТекущаяДата();
	
	Если Не ЗначениеЗаполнено(НомерПСЦ) Тогда
		НомерПСЦ = Документы.ПСЦПоставщика.ПолучитьОчереднойНомерПСЦ(Договор, Ссылка);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЕдиницаИзмеренияНормативаНахожденияНаПогрузкеВыгрузке) Тогда
		ЕдиницаИзмеренияНормативаНахожденияНаПогрузкеВыгрузке = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидУслугПоставщика, "ЕдиницаИзмеренияНормативаНахожденияНаПогрузкеВыгрузке");
	КонецЕсли;
	
	ЛокацияПустаяСсылка = ПредопределенноеЗначение("Справочник.Локации.ПустаяСсылка");
	АдресПустаяСсылка = ПредопределенноеЗначение("Справочник.АдресаВНаселенныхПунктах.ПустаяСсылка");
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ЗаполнитьНоменклатуруПоставщиков();
		
		Для Каждого Стр Из Услуги Цикл
			
			//Если Не ЗначениеЗаполнено(Стр.НоменклатураПоставщика) И ЗначениеЗаполнено(Стр.Номенклатура) И ЗначениеЗаполнено(Стр.НаименованиеНоменклатурыПоставщика) Тогда
			//	Стр.НоменклатураПоставщика = НайтиНоменклатуруПоставщика(Стр.НаименованиеНоменклатурыПоставщика, Стр.Номенклатура);
			//	Если Не ЗначениеЗаполнено(Стр.НоменклатураПоставщика) Тогда
			//		НоменклатураПоставщика = Справочники.НоменклатураПоставщиков.СоздатьЭлемент();
			//		НоменклатураПоставщика.Наименование = Стр.НаименованиеНоменклатурыПоставщика;
			//		НоменклатураПоставщика.Номенклатура = Стр.Номенклатура;
			//		НоменклатураПоставщика.Записать();
			//		Стр.НоменклатураПоставщика = НоменклатураПоставщика.Ссылка;
			//	КонецЕсли;
			//КонецЕсли;
			
			//Приоритет локаций при выборе. Возможность выбора мультилокаций после очисти поля.
			Если Не ЗначениеЗаполнено(Стр.ПунктОтправления) Тогда
				Стр.ПунктОтправления = ЛокацияПустаяСсылка;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Стр.ПунктНазначения) Тогда
				Стр.ПунктНазначения = ЛокацияПустаяСсылка;
			КонецЕсли;
				
			Если Не ЗначениеЗаполнено(Стр.СтанцииПогранпереходов) Тогда
				Стр.СтанцииПогранпереходов = ЛокацияПустаяСсылка;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Стр.ПунктОтправленияГород) Тогда
				Стр.ПунктОтправленияГород = ЛокацияПустаяСсылка;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Стр.ПунктНазначенияГород) Тогда
				Стр.ПунктНазначенияГород = ЛокацияПустаяСсылка;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Стр.ПунктОтправленияСтрана) Тогда
				Стр.ПунктОтправленияСтрана = ЛокацияПустаяСсылка;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Стр.ПунктНазначенияСтрана) Тогда
				Стр.ПунктНазначенияСтрана = ЛокацияПустаяСсылка;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Стр.АдресСкладаПогрузкиВыгрузки) Тогда
				Стр.АдресСкладаПогрузкиВыгрузки = АдресПустаяСсылка;
			КонецЕсли;
			
		КонецЦикла;
		
		//Евросиб Шевченко А.В. US 125530 TA 128244 13.02.2026
		НайтиЗаписатьШкалыЦен();
		НайтиЗаписатьДетализациюКомплексныхСтавок();
		//Евросиб Шевченко А.В. US 125530 TA 128244 13.02.2026
		
		СтрокиСНайденнымиКритериями = Неопределено;
		НайтиЗаписатьКритерии(СтрокиСНайденнымиКритериями);
		
		ПроверитьНаличиеДублейСтрок(Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокиСНайденнымиКритериями) Тогда
			ПроверитьНаличиеПредыдущихДействующихСтавок(СтрокиСНайденнымиКритериями);
		КонецЕсли;		
		
	КонецЕсли;
		
	РеквизитыПСЦДляСравнения = "Организация, ЦФО, Контрагент, Договор, ВидУслугПоставщика, КатегорияУслуг, МестоОказанияУслуг";
	ДляДанногоОбъектаТребуетсяПеремаршрутизация = МаршрутизацияСервер.ТребуетсяПеремаршрутизацияДляОбъекта(ЭтотОбъект, РеквизитыПСЦДляСравнения);
	
	Если Маршрутизировать И ДляДанногоОбъектаТребуетсяПеремаршрутизация Тогда
		ПараметрыЗапроса = Документы.ПСЦПоставщика.ПолучитьПараметрыМаршрутизации(ЭтотОбъект);
		РезультатЗапроса = МаршрутизацияСервер.МаршрутизироватьПСЦПоставщика(ПараметрыЗапроса, Дата);
		Если РезультатЗапроса.Количество() > 0 Тогда
			УказанныеВручнуюИспНаблюдатель = Новый СписокЗначений;
			Если ДополнительныеСвойства.Свойство("ДопСвойстваОбъекта") тогда
				УказанныеВручнуюИспНаблюдатель = ДополнительныеСвойства.ДопСвойстваОбъекта;
			КонецЕсли;
			МаршрутизацияСервер.ПрименитьМаршрут(ЭтотОбъект, РезультатЗапроса, Автор, УказанныеВручнуюИспНаблюдатель);			
		КонецЕсли;
	КонецЕсли;
	
	МаршрутизацияСервер.ПараллельноеСогласование(Состояния);
	МаршрутизацияСервер.ПостобработкаТЧСостояний(ЭтотОбъект, Автор,, РежимЗаписи);
	
	Если Проведен И (СтатусДокумента = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний
			Или СтатусДокумента = Перечисления.СтатусыСогласования.Подписано
			Или СтатусДокумента = Перечисления.СтатусыСогласования.СогласованСКомментариями) Тогда
		СтатусТарифа = Перечисления.СтатусыТарифовПоставщиков.СозданПоПСЦ;
	ИначеЕсли Проведен Тогда
		СтатусТарифа = Перечисления.СтатусыТарифовПоставщиков.ПроведенПоПСЦ;
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		СтатусТарифа = Перечисления.СтатусыТарифовПоставщиков.ОтмененПоПСЦ;
	Иначе
		СтатусТарифа = Перечисления.СтатусыТарифовПоставщиков.СозданПоПСЦ;
	КонецЕсли;
			
	УстановитьСтатусДокумента();
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		
		Документы.ПСЦПоставщика.СверитьУслугиПротоколаСНормативнымиСтавками(ЭтотОбъект);
		Документы.ПСЦПоставщика.ВыполнитьАвтоматическоеСогласование(ЭтотОбъект);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СканДоверенностиНаПодписантаКонтрагента) Тогда
		Если ЭтоНовый() Тогда
			ДополнительныеСвойства.Вставить("ПрисоединитьСканДоверенностиНаПодписантаКонтрагента", Истина);
		Иначе
			ПредыдущийСканДоверенностиНаПодписантаКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "СканДоверенностиНаПодписантаКонтрагента");
			Если ЗначениеЗаполнено(ПредыдущийСканДоверенностиНаПодписантаКонтрагента) И ПредыдущийСканДоверенностиНаПодписантаКонтрагента <> СканДоверенностиНаПодписантаКонтрагента Тогда
				
				ДополнительныеСвойства.Вставить("ПрисоединитьСканДоверенностиНаПодписантаКонтрагента", Истина);
				
				Запрос = Новый Запрос;
				Запрос.Текст =
				"ВЫБРАТЬ
				|	Файлы.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.Файлы КАК Файлы
				|ГДЕ
				|	Файлы.ВладелецФайла = &ВладелецФайла
				|	И Файлы.Наименование = &Наименование
				|	И НЕ Файлы.ПометкаУдаления";
				Запрос.УстановитьПараметр("ВладелецФайла", Ссылка);
				НаименованиеПредыдущегоСкана = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПредыдущийСканДоверенностиНаПодписантаКонтрагента, "Наименование");
				Запрос.УстановитьПараметр("Наименование", НаименованиеПредыдущегоСкана);
				
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					ПредыдущийПрисоединенныйСкан = Выборка.Ссылка;
					ПредыдущийСканОбъект = ПредыдущийПрисоединенныйСкан.ПолучитьОбъект();
					ПредыдущийСканОбъект.УстановитьПометкуУдаления(Истина);
				КонецЦикла;				
				
			КонецЕсли;			
				
		КонецЕсли;
	КонецЕсли;
	
	// Евросиб US 89887 TA 89889 Рыбьяков К.А. 18.11.2024 ((
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ЕстьПроведенныеРелизы = ОбщегоНазначенияВызовСервера.НаОснованииДокументаСозданыРелизы(Ссылка);
		Если ЕстьПроведенныеРелизы Тогда
			ТекстСообщения = НСтр("ru = 'К ПСЦ есть Релиз собственника, требуется отменить его проведение.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 18.11.2024 ))
	
	// Евросиб US 105219 TA 105220 Рыбьяков К.А. 16.04.2025 ((
	Если Не Отказ 
		И ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Автоперевозки 
		//Евросиб Коханенко Н.А. 24.09.2025 (( #119429 
		//И РежимЗаписи = РежимЗаписиДокумента.Проведение 
		//И (СтатусДокумента = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний
		//	Или СтатусДокумента = Перечисления.СтатусыСогласования.Подписано
		//	Или СтатусДокумента = Перечисления.СтатусыСогласования.СогласованСКомментариями) Тогда
		И ((НЕ Ссылка.ПометкаУдаления 
			И ПометкаУдаления)
		ИЛИ РежимЗаписи = РежимЗаписиДокумента.Проведение 
		И (СтатусДокумента = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний
			ИЛИ СтатусДокумента = Перечисления.СтатусыСогласования.Подписано
			ИЛИ СтатусДокумента = Перечисления.СтатусыСогласования.СогласованСКомментариями)) Тогда
		//Евросиб Коханенко Н.А. 24.09.2025 )) #119429 
		УзлыПланаОбмена = ПланыОбмена.ВыгрузкаДанных.ПолучитьУзелОбмена(Перечисления.УзлыОбмена.ТЛ);

		СтруктураЗаписи = Новый Структура;
		СтруктураЗаписи.Вставить("УзелИнформационнойБазы", УзлыПланаОбмена[0]);
		СтруктураЗаписи.Вставить("Ссылка", Договор);
		
		КлючевыеПоляДляОбменаИзменены = Ложь;
		ДоговорСуществуетВТранспортнойЛогистике = РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.ЗаписьЕстьВРегистре(СтруктураЗаписи);
		Если ДоговорСуществуетВТранспортнойЛогистике Тогда
			КлючевыеПоляДляОбменаИзменены = Документы.ПСЦ.ПроверитьИзменениеКлючевыхПолейПСЦДляОбмена(ЭтотОбъект);
		КонецЕсли;
		Если КлючевыеПоляДляОбменаИзменены  Тогда
			ДополнительныеСвойства.Вставить("ЗарегистрироватьвОбмене");
		КонецЕсли;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 16.04.2025 ))
	
	//Евросиб Шевченко А.В. US 112958 TA 112962 01.07.2025 -начало
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Автоперевозки И Типовой тогда
		ДополнительноеОпределениеПризнакаНеТиповой(Типовой);
	КонецЕсли;
	//Евросиб Шевченко А.В. US 112958 TA 112962 01.07.2025 -начало
	
	//Евросиб Каблов 15.08.2025 ( #115001 Регистрируем при записи
	//Евросиб Каблов 17.12.2025 ( Ticket#0426699
	//НеобходимаРегистрация = ПроверитьНеобходимостьРегистрации();
	НеобходимаРегистрация = Документы.ПСЦПоставщика.ПроверитьИзменениеКлючевыхПолейДляОбменаСДО(ЭтотОбъект);
	//Евросиб Каблов 17.12.2025 ) Ticket#0426699
	ДополнительныеСвойства.Вставить("ЗарегистрироватьДляПередачиВДО", НеобходимаРегистрация);
	//Евросиб Каблов 15.08.2025 ) #115001
	
	//Евросиб СубботинВ #131884 02.03.2026 Начало
	СоздатьКлючиАналитикиСтрокПротокола(РежимЗаписи);
    //Евросиб СубботинВ #131884 02.03.2026 Конец
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ПрисоединитьСканДоверенностиНаПодписантаКонтрагента = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "ПрисоединитьСканДоверенностиНаПодписантаКонтрагента", Ложь);
	Если ПрисоединитьСканДоверенностиНаПодписантаКонтрагента Тогда
		ФайлДоверенности = СканДоверенностиНаПодписантаКонтрагента.Скопировать();
		ФайлДоверенности.ВладелецФайла = Ссылка;
		ФайлДоверенности.Записать();
	КонецЕсли;
	
	// Евросиб US 105219 TA 105220 Рыбьяков К.А. 16.04.2025 ((
	Если Не Отказ И ДополнительныеСвойства.Свойство("ЗарегистрироватьвОбмене") Тогда 
		ПланыОбмена.ВыгрузкаДанных.ЗарегистрироватьИзмененияПоДокументу(Ссылка, Перечисления.УзлыОбмена.ТЛ);
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 16.04.2025 ))
	
	//Евросиб Каблов 15.08.2025 ( #115001
	ЗарегистрироватьДляПередачиВДО = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "ЗарегистрироватьДляПередачиВДО", Ложь);
	Если Не Отказ И ЗарегистрироватьДляПередачиВДО Тогда 
		ПланыОбмена.ВыгрузкаДанных.ЗарегистрироватьИзмененияПоДокументу(Ссылка, Перечисления.УзлыОбмена.ДО);
	КонецЕсли;
	//Евросиб Каблов 15.08.2025 )
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Автор = Пользователи.ТекущийПользователь();
	//Маршрутизировать = Константы.МаршрутизироватьПСЦ.Получить();
	Маршрутизировать = Истина;
	
	Если ЗначениеЗаполнено(Автор) Тогда
		РеквизитыАвтора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Автор, "ЦФО, Подразделение");
		ЦФО = РеквизитыАвтора.ЦФО;
		Подразделение = РеквизитыАвтора.Подразделение;
	КонецЕсли;
	
	Организация = Константы.ОсновнаяОрганизация.Получить();
	Создано = ТекущаяДата();
	ДатаПСЦ = Создано;
	СтатусДокумента = Перечисления.СтатусыСогласования.Планируется;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РелизСобственника") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РелизСобственника.Контрагент КАК Контрагент,
		|	РелизСобственника.Договор КАК Договор,
		// Евросиб US 89887 TA 103668 Рыбьяков К.А. 04.03.2025 ((
		|	РелизСобственника.ПСЦ КАК ПСЦ
		// Евросиб Рыбьяков К.А. 04.03.2025 ))
		|ИЗ
		|	Документ.РелизСобственника КАК РелизСобственника
		|ГДЕ
		|	РелизСобственника.Ссылка = &РелизСобственника
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РелизСобственникаНоминации.НомерСтроки КАК НомерСтроки,
		|	РелизСобственникаНоминации.ТипКТК КАК ТипоразмерКТК,
		|	РелизСобственникаНоминации.Контейнер КАК Контейнер,
		|	РелизСобственникаНоминации.тек_СобственностьКТК КАК ВидСобственности,
		|	РелизСобственникаНоминации.НормативВозврата КАК НормаПользования,
		|	РелизСобственникаНоминации.Ссылка.Локация КАК ЛокацияВыдачи,
		|	РелизСобственникаНоминации.Ссылка.ЛокацияСдачи КАК ЛокацияСдачи,
		|	РелизСобственникаНоминации.Ставка КАК Ставка,
		|	РелизСобственникаНоминации.СтавкаНДС КАК СтавкаНДС,
		|	РелизСобственникаНоминации.НДСВключая КАК НДСВключая,
		|	РелизСобственникаНоминации.Валюта КАК Валюта
		|ИЗ
		|	Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
		|ГДЕ
		|	РелизСобственникаНоминации.Ссылка = &РелизСобственника
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РелизСобственникаНоминации.НДСВключая КАК НДСВключая
		|ИЗ
		|	Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
		|ГДЕ
		|	РелизСобственникаНоминации.Ссылка = &РелизСобственника
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РелизСобственникаНоминации.СтавкаНДС КАК СтавкаНДС
		|ИЗ
		|	Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
		|ГДЕ
		|	РелизСобственникаНоминации.Ссылка = &РелизСобственника";
		
		Запрос.УстановитьПараметр("РелизСобственника", ДанныеЗаполнения.Ссылка);
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
		Выборка = РезультатыЗапроса[0].Выбрать();		
		Если Выборка.Следующий() Тогда
			// Евросиб US 89887 TA 103668 Рыбьяков К.А. 04.03.2025 ((
			Если ЗначениеЗаполнено(Выборка.ПСЦ) Тогда
				ТекстСообщения = НСтр("ru = 'Протокол уже заполнен.'");
				ВызватьИсключение ТекстСообщения;
			КонецЕсли;
			// Евросиб Рыбьяков К.А. 04.03.2025 ))
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка, "Контрагент, Договор");
		КонецЕсли;
		
		Выборка = РезультатыЗапроса[2].Выбрать();		
		Если Выборка.Количество() = 1 Тогда
			Выборка.Следующий();
			СуммаВключаетНДС = Выборка.НДСВключая;
		КонецЕсли;
		
		Выборка = РезультатыЗапроса[3].Выбрать();		
		Если Выборка.Количество() = 1 Тогда
			Выборка.Следующий();
			СтавкаНДС = Выборка.СтавкаНДС;
		КонецЕсли;
		
		Выборка = РезультатыЗапроса[1].Выбрать();
		
		ИдентификаторСтрокиУслуг = 0;
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = Услуги.Добавить();
			
			НоваяСтрока.ИдентификаторСтрокиУслуг = ИдентификаторСтрокиУслуг;
			ИдентификаторСтрокиУслуг = ИдентификаторСтрокиУслуг + 1;
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
			ЧислоСтавкаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДС);
			СуммаНДС = БухгалтерскийУчетОбщиеПроцедурыКлиентСервер.ПолучитьСуммуНДС(Выборка.Ставка, ЧислоСтавкаНДС, Истина, Выборка.НДСВключая);
			НоваяСтрока.СтоимостьСНДС = ?(Выборка.НДСВключая, Выборка.Ставка, Выборка.Ставка + СуммаНДС);
			НоваяСтрока.СтоимостьБезНДС = ?(Выборка.НДСВключая, Выборка.Ставка - СуммаНДС, Выборка.Ставка);
			
			НоваяСтрока.СпособВводаУчетныхЕдиниц = Перечисления.СпособыВводаУчетныхЕдиниц.Построчно;
			
			Если ЗначениеЗаполнено(Выборка.Контейнер) Тогда
				НоваяСтрокаУчетнойЕдиницы = УчетныеЕдиницы.Добавить();
				НоваяСтрокаУчетнойЕдиницы.ИдентификаторСтрокиУслуг = НоваяСтрока.ИдентификаторСтрокиУслуг;
				НоваяСтрокаУчетнойЕдиницы.УчетнаяЕдиница = Выборка.Контейнер;
			КонецЕсли;
			
		КонецЦикла;
		
		Основание = ДанныеЗаполнения;		
		ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Контейнеры;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		//РеквизитыКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контрагент, "ИсполнительУслуги");		
		//Если Не РеквизитыКонтрагента.ИсполнительУслуги Тогда
		//	ТекстСообщения = "Не заполнена Карта инфраструктуры поставщика. Создание документа запрещено.";
		//	ВызватьИсключение ТекстСообщения;
		//КонецЕсли;
		РеквизитыКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контрагент, "ТипКонтрагента_Подрядчик");		
		Если Не РеквизитыКонтрагента.ТипКонтрагента_Подрядчик Тогда
			ТекстСообщения = "Контрагент не является Подрядчиком. Создание документа запрещено.";
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;
		
		ДатаДляОпределенияРуководителя = ?(ЗначениеЗаполнено(ДатаПСЦ), ДатаПСЦ, ТекущаяДата());
		ДанныеРуководителя = ОтветственныеЛица_сервер.ПолучитьРуководителя(Контрагент, ДатаДляОпределенияРуководителя, РуководительКонтрагента);		
		РуководительКонтрагента = ДанныеРуководителя.Ссылка;
		ДоверенностьНаПодписанта = ДанныеРуководителя.СканДоверенности;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Договор) Тогда
		Документы.ПСЦПоставщика.ЗаполнитьРеквизитыИзДоговора(ЭтотОбъект, Договор);
	КонецЕсли;
	
	ЗаполнитьДоверенностьЗаРуководителя();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Маршрутизировать = Истина;
	Автор = Пользователи.ТекущийПользователь();
	Создано = ТекущаяДата();
	Редактор = неопределено;
	Изменено = неопределено;
	Состояния.Очистить();
		
	СтатусДокумента = Перечисления.СтатусыСогласования.Планируется;
	ТекущееСостояние = Неопределено;
	ПодписанСДвухСторон = Ложь;
	ДатаПолученияОригинала = '00010101';
	ДатаПереводаВСтатусПодписан = '00010101';
	ДатаСогласования = '00010101';
	НачалоДействия = '00010101';
	ДатаПСЦ = ТекущаяДата();
	НомерПСЦ = "";
	
	СсылкаНаВнутреннийДокументДО = "";
	
	ЗаполнитьДоверенностьЗаРуководителя();
	
	ПроверкаНеОсуществлялась = Перечисления.РезультатыПроверки.НеОсуществлялась;
	Для Каждого Стр Из Услуги Цикл
		Стр.ПроверкаСтавок = ПроверкаНеОсуществлялась;
		//Евросиб Шевченко А.В. US 112958 TA 112963 07.07.2025
		Стр.Критерий = Справочники.КритерииУслугПоставщиков.ПустаяСсылка()
		//Евросиб Шевченко А.В. US 112958 TA 112963 07.07.2025
	КонецЦикла;
	
	// Евросиб 89887 TA 89889 Рыбьяков К.А. 21.01.2025 ((
	ПрисвоитьНовыйИдентификаторСтрокамТЧ();
	// Евросиб Рыбьяков К.А. 21.01.2025 ))
	
	//Евросиб Шевченко А.В. US 112958 TA 112963 07.07.2025
	Для Каждого СтрокаК Из КритерииУслуг Цикл
		СтрокаК.Критерий = Справочники.КритерииУслугПоставщиков.ПустаяСсылка();               
	КонецЦикла;
	//Евросиб Шевченко А.В. US 112958 TA 112963 07.07.2025
	
КонецПроцедуры

Процедура ЗаполнитьДоверенностьЗаРуководителя() Экспорт
	
	Если Не ДоверенностьУказываетсяВручную Тогда
		ДатаДоверенности = ?(ЗначениеЗаполнено(ДатаПСЦ), ДатаПСЦ, ТекущаяДата());
		ДоверенностьЗаРуководителя = Документы.ПСЦПоставщика.ПолучитьДоверенностьДиректораПоПроизводству(ДатаДоверенности);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Евросиб Каблов 04.03.2025 ( #100116
	ФормаПротоколаВДоговоре = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ФормаПротокола");
	Если Не ЗначениеЗаполнено(ФормаПротоколаВДоговоре) Тогда
		ДоговорОбъект = Договор.ПолучитьОбъект();
		Если Типовой Тогда
			ДоговорОбъект.ФормаПротокола = Перечисления.ФормыДокументов.Типовая;
		Иначе
			ДоговорОбъект.ФормаПротокола = Перечисления.ФормыДокументов.Нетиповая;
		КонецЕсли;
		ДоговорОбъект.Записать();
	КонецЕсли;
	//Евросиб Каблов 04.03.2025 )
	
	СформироватьДвижения(Отказ);
	
КонецПроцедуры

Процедура ДополнительноеОпределениеПризнакаНеТиповой(Типовой) //Евросиб Шевченко А.В. US 112958 TA 112962 01.07.2025
	
	мНоменклатуры = Новый Массив;
	мНоменклатуры.Добавить(Справочники.Номенклатура.АвтоперевозкаГруженыйКонтейнер);
	мНоменклатуры.Добавить(Справочники.Номенклатура.АвтоперевозкаПорожнийКонтейнер);
	мНоменклатуры.Добавить(Справочники.Номенклатура.АвтоперевозкаХолостойПрогон);
	мНоменклатуры.Добавить(Справочники.Номенклатура.БазоваяСтавкаАвто);
	мНоменклатуры.Добавить(Справочники.Номенклатура.ЭкспедированиеАвтотранспорт);
	мНоменклатуры.Добавить(Справочники.Номенклатура.СНПавтотранспорта);
	мНоменклатуры.Добавить(Справочники.Номенклатура.ПревышениеНормыЗагрузкиКонтейнера);
	мНоменклатуры.Добавить(Справочники.Номенклатура.ДопАдрес);
	
	Для Каждого СтрУслуги Из Услуги Цикл
		
		Если мНоменклатуры.Найти(СтрУслуги.Номенклатура) = Неопределено Тогда
			Типовой = Ложь;	
		КонецЕсли;	
		
	КонецЦикла;	
	
	
	
КонецПроцедуры

Процедура СформироватьДвижения(Отказ) Экспорт
	
	ТарифыПоставщиков = Движения.ТарифыПоставщиков;
	ТарифыПоставщиков.Записывать = Истина;
	
	ТарифыПоставщиковПоУчетнымЕдиницам = Движения.ТарифыПоставщиковПоУчетнымЕдиницам;
	ТарифыПоставщиковПоУчетнымЕдиницам.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПСЦПоставщикаУслуги.Ссылка КАК Ссылка,
	|	ПСЦПоставщикаУслуги.НомерСтроки КАК НомерСтроки,
	|	ПСЦПоставщикаКритерииУслуг.Критерий КАК Критерий,
	|	ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ПСЦПоставщикаУслуги.СтоимостьСНДС КАК СтоимостьСНДС,
	|	ПСЦПоставщикаУслуги.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	ПСЦПоставщикаУслуги.ОкончаниеДействияФакт КАК ОкончаниеДействияФакт,
	|	ПСЦПоставщикаУслуги.ШкалаСтоимостьСНДС КАК ШкалаСтоимостьСНДС,
	|	ПСЦПоставщикаУслуги.ШкалаСтоимостьБезНДС КАК ШкалаСтоимостьБезНДС,
	|	ПСЦПоставщикаУслуги.СтавкаПрогрессивная КАК СтавкаПрогрессивная,
	|	ПСЦПоставщикаУслуги.Комментарий КАК Комментарий,
	|	ПСЦПоставщикаУслуги.ДетализацияКомплекснойСтавки КАК ДетализацияКомплекснойСтавки,
	//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
	|	ПСЦПоставщикаУслуги.СтавкаЗаПСВСутСНДС КАК СтавкаЗаПСВСутСНДС,
	|	ПСЦПоставщикаУслуги.СтавкаЗаПСВСутБезНДС КАК СтавкаЗаПСВСутБезНДС
	//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
	//Евросиб СубботинВ #131884 02.03.2026 Начало
	|	,ПСЦПоставщикаУслуги.КлючАналитикиСтрокиПротокола КАК КлючНормативнойСтавки
	//Евросиб СубботинВ #131884 02.03.2026 Конец
	|ПОМЕСТИТЬ Услуги
	|ИЗ
	|	Документ.ПСЦПоставщика.Услуги КАК ПСЦПоставщикаУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПСЦПоставщика.КритерииУслуг КАК ПСЦПоставщикаКритерииУслуг
	|		ПО ПСЦПоставщикаУслуги.Ссылка = ПСЦПоставщикаКритерииУслуг.Ссылка
	|			И ПСЦПоставщикаУслуги.ИдентификаторСтрокиУслуг = ПСЦПоставщикаКритерииУслуг.ИдентификаторСтрокиУслуг
	|ГДЕ
	|	ПСЦПоставщикаУслуги.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Услуги.НомерСтроки КАК НомерСтроки,
	|	Услуги.Критерий КАК Критерий,
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	Услуги.СтоимостьСНДС КАК СтоимостьСНДС,
	|	Услуги.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	Услуги.ОкончаниеДействияФакт КАК ОкончаниеДействия,
	|	ПСЦПоставщикаУчетныеЕдиницы.УчетнаяЕдиница КАК УчетнаяЕдиница,
	|	Услуги.ШкалаСтоимостьСНДС КАК ШкалаСтоимостьСНДС,
	|	Услуги.ШкалаСтоимостьБезНДС КАК ШкалаСтоимостьБезНДС,
	|	Услуги.СтавкаПрогрессивная КАК СтавкаПрогрессивная,
	|	Услуги.Комментарий КАК Комментарий,
	|	Услуги.ДетализацияКомплекснойСтавки КАК ДетализацияКомплекснойСтавки,
	//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
	|	Услуги.СтавкаЗаПСВСутСНДС КАК СтавкаЗаПСВСутСНДС,
	|	Услуги.СтавкаЗаПСВСутБезНДС КАК СтавкаЗаПСВСутБезНДС
	//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
	//Евросиб СубботинВ #131884 02.03.2026 Начало 
	|	,Услуги.КлючНормативнойСтавки КАК КлючНормативнойСтавки
	//Евросиб СубботинВ #131884 02.03.2026 Конец
	|ПОМЕСТИТЬ УслугиПоУчетнымЕдиницам
	|ИЗ
	|	Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПСЦПоставщика.УчетныеЕдиницы КАК ПСЦПоставщикаУчетныеЕдиницы
	|		ПО Услуги.Ссылка = ПСЦПоставщикаУчетныеЕдиницы.Ссылка
	|			И Услуги.ИдентификаторСтрокиУслуг = ПСЦПоставщикаУчетныеЕдиницы.ИдентификаторСтрокиУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиПоУчетнымЕдиницам.НомерСтроки КАК НомерСтроки,
	|	УслугиПоУчетнымЕдиницам.Критерий КАК Критерий,
	|	УслугиПоУчетнымЕдиницам.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	УслугиПоУчетнымЕдиницам.СтоимостьСНДС КАК СтоимостьСНДС,
	|	УслугиПоУчетнымЕдиницам.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	УслугиПоУчетнымЕдиницам.ОкончаниеДействия КАК ОкончаниеДействия,
	|	УслугиПоУчетнымЕдиницам.УчетнаяЕдиница КАК УчетнаяЕдиница,
	|	УслугиПоУчетнымЕдиницам.ШкалаСтоимостьСНДС КАК ШкалаСтоимостьСНДС,
	|	УслугиПоУчетнымЕдиницам.ШкалаСтоимостьБезНДС КАК ШкалаСтоимостьБезНДС,
	|	УслугиПоУчетнымЕдиницам.СтавкаПрогрессивная КАК СтавкаПрогрессивная,
	|	ТарифыПоставщиков.Регистратор КАК Регистратор,
	|	ТарифыПоставщиков.Регистратор.Представление КАК РегистраторПредставление,
	|	УслугиПоУчетнымЕдиницам.Комментарий КАК Комментарий,
	|	УслугиПоУчетнымЕдиницам.ДетализацияКомплекснойСтавки КАК ДетализацияКомплекснойСтавки,
	//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
	|	УслугиПоУчетнымЕдиницам.СтавкаЗаПСВСутСНДС КАК СтоимостьЗаСуткиСНДС,
	|	УслугиПоУчетнымЕдиницам.СтавкаЗаПСВСутБезНДС КАК СтоимостьЗаСуткиБезНДС
	//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
		//Евросиб СубботинВ #131884 02.03.2026 Начало 
	|	,УслугиПоУчетнымЕдиницам.КлючНормативнойСтавки КАК КлючАналитикиСтрокиПротокола
	//Евросиб СубботинВ #131884 02.03.2026 Конец
	|ИЗ
	|	УслугиПоУчетнымЕдиницам КАК УслугиПоУчетнымЕдиницам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыПоставщиков КАК ТарифыПоставщиков
	|		ПО УслугиПоУчетнымЕдиницам.Критерий = ТарифыПоставщиков.Критерий
	|			И (ТарифыПоставщиков.Период = &НачалоДействия)
	|			И (ТарифыПоставщиков.Регистратор <> &Регистратор)
	|			И &ТекстОтбораПоКлиентуЕвросиб
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки,
	|	УчетнаяЕдиница";
	
	//Евросиб Шевченко А.В. US 112958 TA 112963 02.07.2025 -начало
	Запрос.УстановитьПараметр("ТекстОтбораПоКлиентуЕвросиб", ИСТИНА);
	Если ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Автоперевозки ИЛИ ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Терминалы Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстОтбораПоКлиентуЕвросиб", "ТарифыПоставщиков.Критерий.КлиентЕвросиб = &КлиентЕвросиб");
		Запрос.УстановитьПараметр("КлиентЕвросиб", КлиентЕвросиб);	
	КонецЕсли;
	//Евросиб Шевченко А.В. US 112958 TA 112963 02.07.2025 -конец
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("НачалоДействия", НачалоДействия);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если СтатусДокумента = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний
			Или СтатусДокумента = Перечисления.СтатусыСогласования.СогласованСКомментариями
			Или СтатусДокумента = Перечисления.СтатусыСогласования.Подписано
		Тогда
		СтатусТарифа = Перечисления.СтатусыТарифовПоставщиков.СогласованПоПСЦ;
	Иначе
		СтатусТарифа = Перечисления.СтатусыТарифовПоставщиков.ПроведенПоПСЦ;
	КонецЕсли;
	
	//Евросиб СубботинВ #131884 02.03.2026 Начало
	//ЗаполняемыеПоляТарифа = "Критерий,СтоимостьБезНДС,СтоимостьСНДС,ШкалаСтоимостьБезНДС,ШкалаСтоимостьСНДС,ОкончаниеДействия,Комментарий,ДетализацияКомплекснойСтавки";
	ЗаполняемыеПоляТарифа = "Критерий,СтоимостьБезНДС,СтоимостьСНДС,ШкалаСтоимостьБезНДС,ШкалаСтоимостьСНДС,ОкончаниеДействия,Комментарий,ДетализацияКомплекснойСтавки,КлючАналитикиСтрокиПротокола";
	//Евросиб СубботинВ #131884 02.03.2026 Конец
	ЗаполняемыеПоляТарифаПоУчетнымЕдиницам = "Критерий,УчетнаяЕдиница,СтоимостьБезНДС,СтоимостьСНДС,ШкалаСтоимостьБезНДС,ШкалаСтоимостьСНДС,ОкончаниеДействия,ДетализацияКомплекснойСтавки,Комментарий";
	//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
	Если ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Вагоны Тогда
		ЗаполняемыеПоляТарифа = ЗаполняемыеПоляТарифа + ",СтоимостьЗаСуткиСНДС,СтоимостьЗаСуткиБезНДС";
		ЗаполняемыеПоляТарифаПоУчетнымЕдиницам = ЗаполняемыеПоляТарифаПоУчетнымЕдиницам + ",СтоимостьЗаСуткиСНДС,СтоимостьЗаСуткиБезНДС";	
	Конецесли;	
	//Евросиб Шевченко А.В. US 125530 TA 125727 15.12.2025
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Регистратор) Тогда
			ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", Выборка.НомерСтроки, "НомерСтроки");
			ТекстСообщения = СтрШаблон("Данный тариф уже введен с такой же датой начала действия документом %1", Выборка.РегистраторПредставление);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКПолюТЧ, "Объект", Отказ);
		КонецЕсли;
			
		Если ЗначениеЗаполнено(Выборка.УчетнаяЕдиница) Тогда
			Тариф = ТарифыПоставщиковПоУчетнымЕдиницам.Добавить();
			ЗаполнитьСтрокуТарифа(Тариф, Выборка, СтатусТарифа, ЗаполняемыеПоляТарифаПоУчетнымЕдиницам);
		Иначе
			Тариф = ТарифыПоставщиков.Добавить();
			ЗаполнитьСтрокуТарифа(Тариф, Выборка, СтатусТарифа, ЗаполняемыеПоляТарифа);
		КонецЕсли;			
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьНаличиеДублейСтрок(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Услуги.НомерСтроки КАК НомерСтроки,
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг
	|ПОМЕСТИТЬ Услуги
	|ИЗ
	|	&Услуги КАК Услуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Критерии.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	Критерии.Критерий КАК Критерий
	|ПОМЕСТИТЬ Критерии
	|ИЗ
	|	&Критерии КАК Критерии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетныеЕдиницы.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	УчетныеЕдиницы.УчетнаяЕдиница КАК УчетнаяЕдиница
	|ПОМЕСТИТЬ УчетныеЕдиницы
	|ИЗ
	|	&УчетныеЕдиницы КАК УчетныеЕдиницы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Услуги.НомерСтроки КАК НомерСтроки,
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	Критерии.Критерий КАК Критерий,
	|	ЕСТЬNULL(УчетныеЕдиницы.УчетнаяЕдиница, НЕОПРЕДЕЛЕНО) КАК УчетнаяЕдиница,
	//Евросиб Шевченко А.В. US 125530 TA 128244 13.02.2026
	|	ЕстьNull(КритерииУслугПоставщиков.ДетализацияКомплекснойСтавки,ЗНАЧЕНИЕ(Справочник.ДетализацияКомплексныхУслугПоставщиков.ПустаяСсылка)) КАК ДетализацияКомплекснойСтавки
	//Евросиб Шевченко А.В. US 125530 TA 128244 13.02.2026
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Услуги КАК Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Критерии КАК Критерии
	|		ПО Услуги.ИдентификаторСтрокиУслуг = Критерии.ИдентификаторСтрокиУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ УчетныеЕдиницы КАК УчетныеЕдиницы
	|		ПО Услуги.ИдентификаторСтрокиУслуг = УчетныеЕдиницы.ИдентификаторСтрокиУслуг
	//Евросиб Шевченко А.В. US 125530 TA 128244 13.02.2026
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КритерииУслугПоставщиков КАК КритерииУслугПоставщиков
	|		ПО КритерииУслугПоставщиков.Ссылка = Критерии.Критерий
	//Евросиб Шевченко А.В. US 125530 TA 128244 13.02.2026
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ.НомерСтроки КАК НомерСтроки,
	|	ВТ.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ВТ1.НомерСтроки КАК НомерСтроки1
	|ИЗ
	|	ВТ КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ КАК ВТ1
	|		ПО ВТ.Критерий = ВТ1.Критерий
	//Евросиб Шевченко А.В. US 125530 TA 128244 13.02.2026
	|			И ВТ.ДетализацияКомплекснойСтавки = ВТ1.ДетализацияКомплекснойСтавки
	//Евросиб Шевченко А.В. US 125530 TA 128244 13.02.2026
	|			И ВТ.УчетнаяЕдиница = ВТ1.УчетнаяЕдиница
	|			И ВТ.НомерСтроки < ВТ1.НомерСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки1,
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Услуги", Услуги);
	Запрос.УстановитьПараметр("Критерии", КритерииУслуг);
	Запрос.УстановитьПараметр("УчетныеЕдиницы", УчетныеЕдиницы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл	
		ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", Выборка.НомерСтроки1, "НомерСтроки");
		ТекстСообщения = СтрШаблон("Данные строки №%1 дублируют данные строки №%2", Формат(Выборка.НомерСтроки1, "ЧГ=0"), Формат(Выборка.НомерСтроки, "ЧГ=0"));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКПолюТЧ, "Объект", Отказ);	
	КонецЦикла;
	
	
	//ИспользуемыеКритерии = Новый Соответствие;
	//СтрокиУслуг = Новый Массив;
	//Для Каждого СтрокаУслуги Из Услуги Цикл
	//	
	//	СтрокиКритериев = КритерииУслуг.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", СтрокаУслуги.ИдентификаторСтрокиУслуг));		
	//	Для Каждого Стр Из СтрокиКритериев Цикл
	//		ИдентификаторСтрокиУслуг = ИспользуемыеКритерии.Получить(Стр.Критерий);
	//		Если ИдентификаторСтрокиУслуг = Неопределено Тогда
	//			ИспользуемыеКритерии.Вставить(Стр.Критерий, Стр.ИдентификаторСтрокиУслуг);
	//		Иначе
	//			Если СтрокиУслуг.Найти(Стр.ИдентификаторСтрокиУслуг) = Неопределено Тогда
	//				ТекущаяСтрокаУслуги = Услуги.Найти(Стр.ИдентификаторСтрокиУслуг, "ИдентификаторСтрокиУслуг");
	//				НайденнаяСтрокаУслуги = Услуги.Найти(ИдентификаторСтрокиУслуг, "ИдентификаторСтрокиУслуг");
	//				Если НайденнаяСтрокаУслуги <> Неопределено И ТекущаяСтрокаУслуги <> НайденнаяСтрокаУслуги Тогда
	//					ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", ТекущаяСтрокаУслуги.НомерСтроки, "НомерСтроки");
	//					ТекстСообщения = СтрШаблон("Данные строки №%1 дублируют данные строки №%2", Формат(ТекущаяСтрокаУслуги.НомерСтроки, "ЧГ=0"), Формат(НайденнаяСтрокаУслуги.НомерСтроки, "ЧГ=0"));
	//					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКПолюТЧ, "Объект", Отказ);
	//				КонецЕсли;
	//				СтрокиУслуг.Добавить(Стр.ИдентификаторСтрокиУслуг);
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьНаличиеПредыдущихДействующихСтавок(СтрокиСНайденнымиКритериями)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Услуги", Услуги);
	ТаблицаПроверяемыхКритериев = КритерииУслуг.Выгрузить(СтрокиСНайденнымиКритериями);
	Запрос.УстановитьПараметр("КритерииУслуг", ТаблицаПроверяемыхКритериев);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	Запрос.УстановитьПараметр("Период", НачалоДействия - 1);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КритерииУслуг.Критерий КАК Критерий,
	|	КритерииУслуг.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг
	|ПОМЕСТИТЬ КритерииУслуг
	|ИЗ
	|	&КритерииУслуг КАК КритерииУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Услуги.НомерСтроки КАК НомерСтроки,
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг
	|ПОМЕСТИТЬ Услуги
	|ИЗ
	|	&Услуги КАК Услуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Услуги.НомерСтроки КАК НомерСтроки,
	|	КритерииУслуг.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ТарифыПоставщиковСрезПоследних.Регистратор КАК Регистратор,
	|	ТарифыПоставщиковСрезПоследних.Регистратор.Номер КАК РегистраторНомер,
	|	ТарифыПоставщиковСрезПоследних.Регистратор.Дата КАК РегистраторДата,
	|	ТарифыПоставщиковСрезПоследних.Критерий.Номенклатура КАК Номенклатура,
	|	ТарифыПоставщиковСрезПоследних.Критерий.Номенклатура.Представление КАК НоменклатураПредставление
	|ИЗ
	|	РегистрСведений.ТарифыПоставщиков.СрезПоследних(
	|			&Период,
	|			Критерий В
	|				(ВЫБРАТЬ
	|					КритерииУслуг.Критерий КАК Критерий
	|				ИЗ
	|					КритерииУслуг КАК КритерииУслуг) И &ТекстОтбораПоКлиентуЕвросиб) КАК ТарифыПоставщиковСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КритерииУслуг КАК КритерииУслуг
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Услуги КАК Услуги
	|			ПО КритерииУслуг.ИдентификаторСтрокиУслуг = Услуги.ИдентификаторСтрокиУслуг
	|		ПО ТарифыПоставщиковСрезПоследних.Критерий = КритерииУслуг.Критерий
	|ГДЕ
	|	(ТарифыПоставщиковСрезПоследних.ОкончаниеДействия = &ПустаяДата
	|			ИЛИ ТарифыПоставщиковСрезПоследних.ОкончаниеДействия > &Период)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	//Евросиб Шевченко А.В. US 112958 TA 112963 02.07.2025 -начало
	Запрос.УстановитьПараметр("ТекстОтбораПоКлиентуЕвросиб", ИСТИНА);
	Если ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Автоперевозки ИЛИ ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Терминалы Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстОтбораПоКлиентуЕвросиб", "Критерий.КлиентЕвросиб = &КлиентЕвросиб");
		Запрос.УстановитьПараметр("КлиентЕвросиб", КлиентЕвросиб);	
	КонецЕсли;
	//Евросиб Шевченко А.В. US 112958 TA 112963 02.07.2025 -конец
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Шаблон = "По Номенклатуре %1 в строке №%2 есть действующая нормативная ставка на услугу поставщика по Протоколу №%3 от %4. При проведении документа, она перестанет действовать с даты действия текущего документа";
	
	Пока Выборка.Следующий() Цикл				
		ТекстСообщения = СтрШаблон(Шаблон, Выборка.НоменклатураПредставление, Выборка.НомерСтроки, Выборка.РегистраторНомер, Выборка.РегистраторДата);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Выборка.Регистратор);
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьСтатусДокумента() Экспорт

	СогласованиеНачато = Ложь;
	СогласованиеЗавершено = неопределено;
	СогласованиеОтклонен = Ложь;
	СогласованиеОтклоненБезЗамечаний = Ложь;
	СогласованиеСогласованСЗамечаниями = Ложь;
	СогласованиеСогласованСКомментариями = Ложь;
	
	ПолучениеПодписанногоНевозможно = ложь;
	Если СтатусДокумента = Перечисления.СтатусыСогласования.ПолучениеПодписанногоПСЦНевозможно тогда
		ПолучениеПодписанногоНевозможно = истина
	КонецЕсли;
	
	ИскомыеСостоянияПодписания = Новый Массив;
	ИскомыеСостоянияПодписания.Добавить(Справочники.Состояния.ПрикрепитьСканКопиюПодписанногоСДвухСторонПротокола);
	ИскомыеСостоянияПодписания.Добавить(Справочники.Состояния.ПроверкаСогласованияОтправкаПодкреплениеПодписанногоПСЦ);
	ИскомыеСостоянияПодписания.Добавить(Справочники.Состояния.ПереводПротоколаВподписан);	
	Для Каждого СтрСостояния Из Состояния Цикл
		Если СтрСостояния.Статус = Перечисления.СтатусыЭтапов.Выполнен 
				И ИскомыеСостоянияПодписания.Найти(СтрСостояния.Состояние) <> Неопределено Тогда
			ПодписанСДвухСторон = Истина;
		КонецЕсли;
	КонецЦикла;    
	
	Для каждого Стр из Состояния Цикл
		
		Если НЕ Стр.Состояние.Согласование ИЛИ Стр.Состояние = Справочники.Состояния.ПроверкаСогласованияОтправкаПодкреплениеПодписанногоПСЦ Тогда Продолжить; КонецЕсли;
		
		СогласованиеНачато = СогласованиеНачато ИЛИ Стр.Статус <> Перечисления.СтатусыЭтапов.Новый;
		СогласованиеЗавершено = (СогласованиеЗавершено = неопределено ИЛИ СогласованиеЗавершено) И Стр.СтатусСогласования <> Перечисления.СтатусыСогласования.Планируется И (Стр.Статус = Перечисления.СтатусыЭтапов.Выполнен Или Стр.Статус = Перечисления.СтатусыЭтапов.Отклонен);		
		СогласованиеОтклонен = СогласованиеОтклонен ИЛИ Стр.СтатусСогласования = Перечисления.СтатусыСогласования.ОтклоненоСЗамечаниями;
		СогласованиеОтклоненБезЗамечаний = СогласованиеОтклоненБезЗамечаний ИЛИ Стр.СтатусСогласования = Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний;
		СогласованиеСогласованСЗамечаниями = СогласованиеСогласованСЗамечаниями ИЛИ Стр.СтатусСогласования = Перечисления.СтатусыСогласования.СогласованоСЗамечаниями;
		СогласованиеСогласованСКомментариями = СогласованиеСогласованСКомментариями ИЛИ Стр.СтатусСогласования = Перечисления.СтатусыСогласования.СогласованСКомментариями;
		
		Если ПодписанСДвухСторон Тогда Стр.Статус = Перечисления.СтатусыЭтапов.Выполнен; КонецЕсли;
		
	КонецЦикла;
	
	Если СогласованиеНачато = Ложь Тогда
		СтатусДокумента = Перечисления.СтатусыСогласования.Планируется;
	КонецЕсли;
		
	Если СогласованиеНачато = Истина Тогда
		СтатусДокумента = Перечисления.СтатусыСогласования.НаРассмотрении;
	КонецЕсли;	
	
	Если СогласованиеЗавершено = Истина И СогласованиеОтклонен = Истина Тогда
		СтатусДокумента = Перечисления.СтатусыСогласования.ОтклоненоСЗамечаниями;
	ИначеЕсли СогласованиеЗавершено = Истина И СогласованиеОтклоненБезЗамечаний = Истина Тогда
		СтатусДокумента = Перечисления.СтатусыСогласования.ОтклоненоБезЗамечаний;
	ИначеЕсли СогласованиеЗавершено = Истина И СогласованиеСогласованСЗамечаниями = Истина Тогда
		СтатусДокумента = Перечисления.СтатусыСогласования.СогласованоСЗамечаниями;
	ИначеЕсли СогласованиеЗавершено = Истина Тогда
		
		Если СогласованиеСогласованСКомментариями = Истина Тогда
			СтатусДокумента = Перечисления.СтатусыСогласования.СогласованСКомментариями;	
		Иначе
			СтатусДокумента = Перечисления.СтатусыСогласования.СогласованоБезЗамечаний;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДатаСогласования) Тогда
			ДатаСогласования = ТекущаяДата();
		КонецЕсли;
		
	КонецЕсли;
		
	Если ПодписанСДвухСторон Тогда
		СтатусДокумента = перечисления.СтатусыСогласования.Подписано;
	КонецЕсли;
	
	Если ПодписанСДвухСторон Тогда		
		Если ЭтоНовый() Тогда
			БылПодписанСДвухСторон = Ложь;
		Иначе
			БылПодписанСДвухСторон = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПодписанСДвухСторон");		
		КонецЕсли;		
		Если Не БылПодписанСДвухСторон Тогда
			ДатаПереводаВСтатусПодписан = ТекущаяДата();
		КонецЕсли;		
	ИначеЕсли ЗначениеЗаполнено(ДатаПереводаВСтатусПодписан) Тогда
		ДатаПереводаВСтатусПодписан = '00010101';
		Если ПолучениеПодписанногоНевозможно И Не ПодписанСДвухСторон И СогласованиеЗавершено Тогда 
			СтатусДокумента = Перечисления.СтатусыСогласования.ПолучениеПодписанногоПСЦНевозможно;
		КонецЕсли;
	КонецЕсли;
	
	Если СтатусДокумента = ПредопределенноеЗначение("Перечисление.СтатусыСогласования.СогласованоБезЗамечаний") ИЛИ СтатусДокумента = ПредопределенноеЗначение("Перечисление.СтатусыСогласования.СогласованСКомментариями") Тогда
		мСтрокДляОтбора = Новый Массив;
		
		Для Каждого Стр Из Состояния Цикл
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Состояние,"Согласование") = Истина И Стр.Состояние <> ПредопределенноеЗначение("Справочник.Состояния.ПроверкаСогласованияОтправкаПодкреплениеПодписанногоПСЦ") Тогда
				мСтрокДляОтбора.Добавить(Стр);	
			КонецЕсли;	
		КонецЦикла;	
		
		ТЗ = Состояния.Выгрузить(мСтрокДляОтбора,"ЗавершениеРаботы");
		
		Тз.Сортировать("ЗавершениеРаботы УБЫВ");
		
		Если ТЗ.Количество() Тогда
			ДатаСогласования = ТЗ[0].ЗавершениеРаботы;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСтрокуТарифа(Тариф, ДанныеТарифа, СтатусТарифа, ЗаполняемыеПоля)
	
	Тариф.Период = НачалоДействия;
	
	//ЗаполняемыеПоля = "Критерий,СтоимостьБезНДС,СтоимостьСНДС,ОкончаниеДействия";
	//Если ДанныеТарифа.СтавкаПрогрессивная Тогда
	//	ЗаполняемыеПоля = ЗаполняемыеПоля + ",ШкалаСтоимостьСНДС,ШкалаСтоимостьБезНДС"; 
	//КонецЕсли;
	ЗаполнитьЗначенияСвойств(Тариф, ДанныеТарифа, ЗаполняемыеПоля);
	
	Если Не ЗначениеЗаполнено(Тариф.ОкончаниеДействия) Тогда
		Тариф.ОкончаниеДействия = ОкончаниеДействия;
	КонецЕсли;
	
	Тариф.Статус = СтатусТарифа;
				
КонецПроцедуры

Процедура НайтиЗаписатьКритерии(СтрокиСНайденнымиКритериями) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Услуги.НомерСтроки КАК НомерСтроки,
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	Услуги.Критерий КАК Критерий,
	//|	ВЫБОР
	//|		КОГДА Услуги.СостояниеГруженыйПорожний = &Груженый
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ КАК ДляГруженых,
	//|	ВЫБОР
	//|		КОГДА Услуги.СостояниеГруженыйПорожний = &Порожний
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ КАК ДляПорожних,
	|	Услуги.КТКОпределенногоСобственника
	|		ИЛИ Услуги.ВагонОпределенногоСобственника КАК КТКВагонОпределенногоСобственника,
	|	Услуги.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ Услуги
	|ИЗ
	|	&Услуги КАК Услуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КритерииУслуг.НомерСтроки КАК НомерСтроки,
	|	КритерииУслуг.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	КритерииУслуг.Критерий КАК Критерий,
	|	КритерииУслуг.ТипоразмерКТК КАК ТипоразмерКТК
	|ПОМЕСТИТЬ КритерииУслуг
	|ИЗ
	|	&КритерииУслуг КАК КритерииУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КритерииУслуг.НомерСтроки КАК НомерСтроки,
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	//|	Услуги.ДляГруженых КАК ДляГруженых,
	//|	Услуги.ДляПорожних КАК ДляПорожних,
	|	Услуги.КТКВагонОпределенногоСобственника КАК КТКВагонОпределенногоСобственника,
	|	Услуги.Номенклатура КАК Номенклатура,
	|	КритерииУслуг.Критерий КАК Критерий,
	|	КритерииУслуг.ТипоразмерКТК КАК ТипоразмерКТК
	|ПОМЕСТИТЬ УслугиСКритериями
	|ИЗ
	|	Услуги КАК Услуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КритерииУслуг КАК КритерииУслуг
	|		ПО Услуги.ИдентификаторСтрокиУслуг = КритерииУслуг.ИдентификаторСтрокиУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Критерии.НомерСтроки КАК НомерСтроки,
	|	Критерии.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	Критерии.Критерий КАК Критерий,
	|	СправочникКритерии.Ссылка КАК НайденныйКритерий,
	//|	Критерии.ДляГруженых КАК ДляГруженых,
	//|	Критерии.ДляПорожних КАК ДляПорожних,	
	|	Критерии.КТКВагонОпределенногоСобственника КАК КТКВагонОпределенногоСобственника,
	|	Критерии.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ Критерии
	|ИЗ
	|	УслугиСКритериями КАК Критерии
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КритерииУслугПоставщиков КАК СправочникКритерии
	|		ПО (СправочникКритерии.Поставщик = &Контрагент)
	|			И (СправочникКритерии.Организация = &Организация)
	|			И (СправочникКритерии.Договор = &Договор)
	|			И (СправочникКритерии.ВидУслуги = &ВидУслуги)
	|			И (СправочникКритерии.СуммаВключаетНДС = &СуммаВключаетНДС)
	|			И (СправочникКритерии.ЕдиницаИзмеренияНормативаНахожденияНаПогрузкеВыгрузке = &ЕдиницаИзмеренияНормативаНахожденияНаПогрузкеВыгрузке)
	//Евросиб Шевченко А.В. US 112958 TA 112963 02.07.2025 -начало
	|			И (СправочникКритерии.КлиентЕвросиб = &КлиентЕвросиб)
	//Евросиб Шевченко А.В. US 112958 TA 112963 02.07.2025 -конец
	|			И (НЕ СправочникКритерии.ПометкаУдаления)
	|			И (НЕ СправочникКритерии.НормативныйПоказатель)
	|			И Критерии.ДляГруженых = СправочникКритерии.ДляГруженых
	|			И Критерии.ДляПорожних = СправочникКритерии.ДляПорожних		
	|			И Критерии.КТКВагонОпределенногоСобственника = СправочникКритерии.КТКВагонОпределенногоСобственника
	|			И Критерии.Номенклатура = СправочникКритерии.Номенклатура
	|			И Критерии.ДетализацияКомплекснойСтавки = СправочникКритерии.ДетализацияКомплекснойСтавки
	|ГДЕ
	|	Критерии.Критерий <> ЕСТЬNULL(СправочникКритерии.Ссылка, НЕОПРЕДЕЛЕНО)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Критерии.НомерСтроки КАК НомерСтроки,
	//|	Критерии.ДляГруженых КАК ДляГруженых,
	//|	Критерии.ДляПорожних КАК ДляПорожних,
	|	Критерии.КТКВагонОпределенногоСобственника КАК КТКВагонОпределенногоСобственника,
	|	Критерии.Номенклатура КАК Номенклатура
	|ИЗ
	|	Критерии КАК Критерии
	|ГДЕ
	|	Критерии.НайденныйКритерий ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	Критерии.ДляГруженых КАК ДляГруженых,
	//|	Критерии.ДляПорожних КАК ДляПорожних,
	|	Критерии.КТКВагонОпределенногоСобственника КАК КТКВагонОпределенногоСобственника,
	|	Критерии.Номенклатура КАК Номенклатура
	|ИЗ
	|	Критерии КАК Критерии
	|ГДЕ
	|	Критерии.НайденныйКритерий ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Критерии.НомерСтроки КАК НомерСтроки,
	|	Критерии.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	Критерии.НайденныйКритерий КАК НайденныйКритерий,	
	|	Критерии.Номенклатура КАК Номенклатура
	|ИЗ
	|	Критерии КАК Критерии
	|ГДЕ
	|	НЕ Критерии.НайденныйКритерий ЕСТЬ NULL";
	
	СтрокаПоляТЧУслуг =
	"Номенклатура,
	|НоменклатураПоставщика,
	|БазоваяСтавкаНадбавка,
	|ЕдиницаИзмерения,
	|Валюта,
	|СтавкаНДС,
	|ОпасныйСпецГруз,
	|СтандартОпасностиГруза,
	|КлассОпасностиГруза,
	|ВидСобственности,
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	//|Комментарий,
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	//Локации теперь в ТЧ КритерииУслуг
	//|ПунктОтправления,
	//|ПунктНазначения,
	//|ПунктОтправленияСтрана,
	//|ПунктОтправленияГород,
	//|ПунктНазначенияСтрана,
	//|ПунктНазначенияГород,
	//|ЛокацияОказанияУслуги,
	//|СтанцииПогранпереходов,
	|НормаПользования,
	|НормативНахожденияНаПогрузке,
	|НормативНахожденияНаВыгрузке,
	|Груз,
	|ГрузЕТСНГ,
	|ГрузГНГ,
	|ВесГруза,
	|СвободныйПериодХраненияПриОтправке,
	|СвободныйПериодХраненияПриПриеме,
	|СвободныйПериодХраненияУслугиДепо,
	|СвободныйПериодХранения,
	//|ТребуетсяДетализацияКомплекснойСтавки,
	|ГрузРастаможен,
	|ОсобыйТемпературныйРежим,
	|ОсобыйТемпературныйРежимЗначение,
	|ЭкспортИмпорт,
	|ГрузТНВЭД,
	|КодТНВЭД,
	|ВесГрузаКГ,
	|КоличествоКТКВПартии,
	// ДИТ 89973 Давудов М.А. Начало: 21.08.2024
	//ок(
	//|ПринадлежностьКТК,
	//ок)
	|УдалитьПринадлежностьКТК,
	|ПринадлежностьТЕ,
	// ДИТ 89973 Давудов М.А. Конец: 21.08.2024
	|Линия,
	|Судно,
	|РейсМоре,
	|УсловияПеревозкиПоОтправлению,
	|УсловияПеревозкиПоПрибытию,
	|Грузоотправитель,
	|Грузополучатель,
	|Коносамент,
	|НормаЗагрузкиКТК,
	|АдресТерминалаВыдачиПостановкиКТК,
	|АдресСкладаПогрузкиВыгрузки,
	|АдресТерминалаСдачиКТК,
	|ДляГруженых,
	|ДляПорожних,
	//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
	|ВидТранспорта,
	//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
	//Евросиб Шевченко А.В. US 125530 TA 122839 04.12.2025
	|КоличествоМестTEU,
	//Евросиб Шевченко А.В. US 125530 TA 122839 04.12.2025
	//Евросиб Шевченко А.В. US 125530 TA 128244 13.02.2026
	|ДетализацияКомплекснойСтавки,
	//Евросиб Шевченко А.В. US 125530 TA 128244 13.02.2026
	//Евросиб Шевченко А.В. US 124811 TA 129059 13.03.2026
	|МультизначениеКлассыОпасности";
	//Евросиб Шевченко А.В. US 124811 TA 129059 13.03.2026
	
	
	СтрокаПоляТЧКритериев =
	"ТипоразмерКТК,
	|ТипоразмерВагона,
	|ВидОтправки,
	|ПунктОтправления,
	|ПунктНазначения,
	|ПунктОтправленияСтрана,
	|ПунктОтправленияГород,
	|ПунктНазначенияСтрана,
	|ПунктНазначенияГород,
	//Евросиб Шевченко А.В. US 123730 TA 125713 15.12.2025
	|ЛокацияОказанияУслуги,
	|ЛокацияОказанияУслугГород,
	|ЛокацияОказанияУслугСтрана,
	//Евросиб Шевченко А.В. US 123730 TA 125713 15.12.2025
	|СтанцииПогранпереходов,
	//Евросиб Шевченко А.В. US 123730 TA 125768 15.12.2025
	|ДорогаОтправления,
	|ДорогаНазначения,
	|ЖелезнаяДорога
	//Евросиб Шевченко А.В. US 123730 TA 125768 15.12.2025
	|";
	
	СтрокаПоляКритериев = СтрокаПоляТЧУслуг + 
	",
	|" + СтрокаПоляТЧКритериев;
	
	ИменаПолейТЧУслуг = СтрРазделить(СтрокаПоляТЧУслуг, "," + Символы.ПС, Ложь);
	ИменаПолейТЧКритериев = СтрРазделить(СтрокаПоляТЧКритериев, "," + Символы.ПС, Ложь);
	
	ПоляТЧУслугЗапроса = Новый Массив;
	ПоляТЧКритериевЗапроса = Новый Массив;
	ПоляКритериевЗапроса = Новый Массив;
	ПоляУсловийСвязи = Новый Массив;
	
	ШаблонПоляТЧУслуг = "Услуги.%1 КАК %1";
	ШаблонПоляТЧКритериев = "КритерииУслуг.%1 КАК %1";
	ШаблонПоляКритериев = "Критерии.%1 КАК %1";
	ШаблонУсловияСвязи = "И Критерии.%1 = СправочникКритерии.%1";
	
	Для Каждого ИмяПоля Из ИменаПолейТЧУслуг Цикл
		ПоляТЧУслугЗапроса.Добавить(СтрШаблон(ШаблонПоляТЧУслуг, ИмяПоля));
		ПоляКритериевЗапроса.Добавить(СтрШаблон(ШаблонПоляКритериев, ИмяПоля));
		ПоляУсловийСвязи.Добавить(СтрШаблон(ШаблонУсловияСвязи, ИмяПоля));
	КонецЦикла;
	
	Для Каждого ИмяПоля Из ИменаПолейТЧКритериев Цикл
		ПоляТЧКритериевЗапроса.Добавить(СтрШаблон(ШаблонПоляТЧКритериев, ИмяПоля));
		ПоляКритериевЗапроса.Добавить(СтрШаблон(ШаблонПоляКритериев, ИмяПоля));
		ПоляУсловийСвязи.Добавить(СтрШаблон(ШаблонУсловияСвязи, ИмяПоля));
	КонецЦикла;
	
	СтрокаПоляТЧУслугЗапроса = СтрСоединить(ПоляТЧУслугЗапроса, "," + Символы.ПС);
	СтрокаПоляТЧКритериевЗапроса = СтрСоединить(ПоляТЧКритериевЗапроса, "," + Символы.ПС);
	СтрокаПоляКритериевЗапроса = СтрСоединить(ПоляКритериевЗапроса, "," + Символы.ПС);
	СтрокаУсловияСвязи = СтрСоединить(ПоляУсловийСвязи, Символы.ПС);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Услуги.Номенклатура КАК Номенклатура", СтрокаПоляТЧУслугЗапроса);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КритерииУслуг.ТипоразмерКТК КАК ТипоразмерКТК", СтрокаПоляТЧКритериевЗапроса);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Критерии.Номенклатура КАК Номенклатура", СтрокаПоляКритериевЗапроса);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И Критерии.Номенклатура = СправочникКритерии.Номенклатура", СтрокаУсловияСвязи);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Услуги", Услуги);
	
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	Если ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Порты Тогда
		
		УслугиДоп = Услуги.Выгрузить();
		
		Для Каждого СтрУ Из УслугиДоп Цикл
			Если СтрУ.Номенклатура = Справочники.Номенклатура.ХранениеПортГруженыйКонтейнер ИЛИ СтрУ.Номенклатура = Справочники.Номенклатура.ХранениеПортПорожнийКонтейнер Тогда
				СтрУ.СвободныйПериодХраненияУслугиДепо	= СтрУ.СвободныйПериодХранения;
				СтрУ.СвободныйПериодХранения = 0;
			КонецЕсли;
			Если СтрУ.Номенклатура = Справочники.Номенклатура.ТерминальнаяОбработкаПрием Тогда
				СтрУ.СвободныйПериодХраненияПриПриеме	= СтрУ.СвободныйПериодХранения;
				СтрУ.СвободныйПериодХранения = 0;
			КонецЕсли;
			Если СтрУ.Номенклатура = Справочники.Номенклатура.ТерминальнаяОбработкаОтправка Тогда
				СтрУ.СвободныйПериодХраненияПриОтправке	= СтрУ.СвободныйПериодХранения;
				СтрУ.СвободныйПериодХранения = 0;
			КонецЕсли; 
		КонецЦикла;
		
		Запрос.УстановитьПараметр("Услуги", УслугиДоп);
		
	КонецЕсли;	
	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
	
	//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
	Если ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.ТЭО Тогда
		
		УслугиДоп = Услуги.Выгрузить();
		
		Для Каждого СтрУ Из УслугиДоп Цикл
			Если ЗначениеЗаполнено(СтрУ.СвободныйПериодХраненияВаг) И НЕ ЗначениеЗаполнено(СтрУ.СвободныйПериодХраненияКТК) Тогда
				СтрУ.СвободныйПериодХранения = СтрУ.СвободныйПериодХраненияВаг;
			Иначе
				СтрУ.СвободныйПериодХранения = СтрУ.СвободныйПериодХраненияКТК;
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрУ.СтанцииПогранпереходовОтправления) И ЗначениеЗаполнено(СтрУ.СтанцииПогранпереходовНазначение) Тогда
				СтрУ.СтанцииПогранпереходов = СтрУ.СтанцииПогранпереходовОтправления;
			ИначеЕсли ЗначениеЗаполнено(СтрУ.СтанцииПогранпереходовОтправления) И НЕ ЗначениеЗаполнено(СтрУ.СтанцииПогранпереходовНазначение) Тогда
				СтрУ.СтанцииПогранпереходов = СтрУ.СтанцииПогранпереходовОтправления;
			ИначеЕсли НЕ ЗначениеЗаполнено(СтрУ.СтанцииПогранпереходовОтправления) И ЗначениеЗаполнено(СтрУ.СтанцииПогранпереходовНазначение) Тогда
				СтрУ.СтанцииПогранпереходов = СтрУ.СтанцииПогранпереходовНазначение;
			Иначе
				СтрУ.СтанцииПогранпереходов = Справочники.Локации.ПустаяСсылка();
			КонецЕсли;
		КонецЦикла;
		
		Запрос.УстановитьПараметр("Услуги", УслугиДоп);
		
	КонецЕсли;
		
	//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
	
	Запрос.УстановитьПараметр("КритерииУслуг", КритерииУслуг);
	
	Если ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.ТЭО Тогда
		 КритерииУслугДоп = КритерииУслуг.Выгрузить();
		 Для Каждого СтрУ Из КритерииУслугДоп Цикл
			 
			отборУслуги = Новый Структура("ИдентификаторСтрокиУслуг",СтрУ.ИдентификаторСтрокиУслуг);
			НайденныеСтроки = Услуги.НайтиСтроки(отборУслуги);
			Если НайденныеСтроки.Количество() Тогда 
				Если ЗначениеЗаполнено(НайденныеСтроки[0].СтанцииПогранпереходовОтправления) И ЗначениеЗаполнено(НайденныеСтроки[0].СтанцииПогранпереходовНазначение) Тогда
					СтрУ.СтанцииПогранпереходов = НайденныеСтроки[0].СтанцииПогранпереходовОтправления;
				ИначеЕсли ЗначениеЗаполнено(НайденныеСтроки[0].СтанцииПогранпереходовОтправления) И НЕ ЗначениеЗаполнено(НайденныеСтроки[0].СтанцииПогранпереходовНазначение) Тогда
					СтрУ.СтанцииПогранпереходов = НайденныеСтроки[0].СтанцииПогранпереходовОтправления;
				ИначеЕсли НЕ ЗначениеЗаполнено(НайденныеСтроки[0].СтанцииПогранпереходовОтправления) И ЗначениеЗаполнено(НайденныеСтроки[0].СтанцииПогранпереходовНазначение) Тогда
					СтрУ.СтанцииПогранпереходов = НайденныеСтроки[0].СтанцииПогранпереходовНазначение;
				Иначе
					СтрУ.СтанцииПогранпереходов = Справочники.Локации.ПустаяСсылка();
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Запрос.УстановитьПараметр("КритерииУслуг", КритерииУслугДоп);
	КонецЕсли;	
	//Евросиб Шевченко А.В. US 86665 TA 120749 19.10.2025
	
	Запрос.УстановитьПараметр("КомплекснаяСтавка", ДетализацияКомплекснойСтавки);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("ВидУслуги", ВидУслугПоставщика);
	Запрос.УстановитьПараметр("СуммаВключаетНДС", СуммаВключаетНДС);
	Запрос.УстановитьПараметр("ЕдиницаИзмеренияНормативаНахожденияНаПогрузкеВыгрузке", ЕдиницаИзмеренияНормативаНахожденияНаПогрузкеВыгрузке);
	//Евросиб Шевченко А.В. US 112958 TA 112963 02.07.2025 -начало                                                                            
	Запрос.УстановитьПараметр("КлиентЕвросиб", КлиентЕвросиб);
	//Евросиб Шевченко А.В. US 112958 TA 112963 02.07.2025 -конец
	//Запрос.УстановитьПараметр("Груженый", Перечисления.СостоянияКТК.Груженый);
	//Запрос.УстановитьПараметр("Порожний", Перечисления.СостоянияКТК.Порожний);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	КоличествоРезультатов = РезультатыЗапроса.Количество();
	ТаблицаУслугиСКритериями = РезультатыЗапроса[КоличествоРезультатов - 3].Выгрузить();
	ТаблицаНовыхКритериев = РезультатыЗапроса[КоличествоРезультатов - 2].Выгрузить();
	Выборка = РезультатыЗапроса[КоличествоРезультатов - 1].Выбрать();
	
	СтрокиСНайденнымиКритериями = Новый Массив;
	Пока Выборка.Следующий() Цикл
		
		ИндексСтроки = Выборка.НомерСтроки - 1;
		СтрокаТЧ = КритерииУслуг[ИндексСтроки];
		
		Если ЗначениеЗаполнено(Выборка.НайденныйКритерий) Тогда
			СтрокаТЧ.Критерий = Выборка.НайденныйКритерий;
			СтрокиСНайденнымиКритериями.Добавить(СтрокаТЧ);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ДанныеКритерия Из ТаблицаНовыхКритериев Цикл
		
		СтруктураПоиска = Новый Структура(СтрокаПоляКритериев);
		//СтруктураПоиска.Вставить("ДляГруженых", ДанныеКритерия.ДляГруженых);
		//СтруктураПоиска.Вставить("ДляПорожних", ДанныеКритерия.ДляПорожних);
		СтруктураПоиска.Вставить("КТКВагонОпределенногоСобственника", ДанныеКритерия.КТКВагонОпределенногоСобственника);
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, ДанныеКритерия);
		НайденныеСтроки = ТаблицаУслугиСКритериями.НайтиСтроки(СтруктураПоиска);
		
		НовыйКритерий = Справочники.КритерииУслугПоставщиков.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(НовыйКритерий, ДанныеКритерия);//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
		НовыйКритерий.Поставщик = Контрагент;
		НовыйКритерий.Организация = Организация;
		НовыйКритерий.Договор = Договор;
		НовыйКритерий.ВидУслуги = ВидУслугПоставщика;
		НовыйКритерий.СуммаВключаетНДС = СуммаВключаетНДС;
		//НовыйКритерий.ДляГруженых = ДанныеКритерия.ДляГруженых;
		//НовыйКритерий.ДляПорожних = ДанныеКритерия.ДляПорожних;
		НовыйКритерий.КТКВагонОпределенногоСобственника = ДанныеКритерия.КТКВагонОпределенногоСобственника;
		НовыйКритерий.ЕдиницаИзмеренияНормативаНахожденияНаПогрузкеВыгрузке = ЕдиницаИзмеренияНормативаНахожденияНаПогрузкеВыгрузке;
		
		//Евросиб Шевченко А.В. US 112958 TA 112963 02.07.2025 -начало
		Если ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Автоперевозки ИЛИ ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Терминалы Тогда
			Если ЗначениеЗаполнено(КлиентЕвросиб) Тогда
				НовыйКритерий.КлиентЕвросиб = КлиентЕвросиб;
				НовыйКритерий.СпецТариф = Истина;
			КонецЕсли;	
		КонецЕсли;
		//Евросиб Шевченко А.В. US 112958 TA 112963 02.07.2025 -конец
				
		НовыйКритерий.Записать();
		
		Для Каждого Стр Из НайденныеСтроки Цикл
			ИндексСтроки = Стр.НомерСтроки - 1;
			СтрокаТЧ = КритерииУслуг[ИндексСтроки];
			СтрокаТЧ.Критерий = НовыйКритерий.Ссылка;
		КонецЦикла;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура НайтиЗаписатьШкалыЦен() Экспорт
	
	ШкалыЦенПустаяСсылка = Справочники.ШкалыЦен.ПустаяСсылка();
	
	ТипСтрока150 = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(150));
	
	ТаблицаНаименований = Услуги.ВыгрузитьКолонки("ИдентификаторСтрокиУслуг");	
	ТаблицаНаименований.Колонки.Добавить("НаименованиеСНДС", ТипСтрока150);
	ТаблицаНаименований.Колонки.Добавить("НаименованиеБезНДС", ТипСтрока150);
	
	СтрокиУслуг = Новый Массив;
	
	Для Каждого СтрокаУслуги Из Услуги Цикл
		
		Если СтрокаУслуги.СтавкаПрогрессивная Тогда
			
			СтрокиУслуг.Добавить(СтрокаУслуги);
			
			СтрокиШкалы = ШкалаСтавок.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", СтрокаУслуги.ИдентификаторСтрокиУслуг));
			НаименованиеСНДС = Справочники.ШкалыЦен.ПолучитьПредставлениеШкалы(СтрокиШкалы, "СтоимостьСНДС");
			НаименованиеБезНДС = Справочники.ШкалыЦен.ПолучитьПредставлениеШкалы(СтрокиШкалы, "СтоимостьБезНДС");
			
			СтрокаТаблицыНаименований = ТаблицаНаименований.Добавить();
			СтрокаТаблицыНаименований.ИдентификаторСтрокиУслуг = СтрокаУслуги.ИдентификаторСтрокиУслуг;
			СтрокаТаблицыНаименований.НаименованиеСНДС = НаименованиеСНДС;
			СтрокаТаблицыНаименований.НаименованиеБезНДС = НаименованиеБезНДС;
			
		Иначе
			
			СтрокаУслуги.ШкалаСтоимостьСНДС = ШкалыЦенПустаяСсылка;
			СтрокаУслуги.ШкалаСтоимостьБезНДС = ШкалыЦенПустаяСсылка;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(СтрокиУслуг) Тогда
		Возврат;
	Конецесли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Наименования.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	Наименования.НаименованиеСНДС КАК НаименованиеСНДС,
	|	Наименования.НаименованиеБезНДС КАК НаименованиеБезНДС
	|ПОМЕСТИТЬ Наименования
	|ИЗ
	|	&Наименования КАК Наименования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Наименования.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	Наименования.НаименованиеСНДС КАК НаименованиеСНДС,
	|	Наименования.НаименованиеБезНДС КАК НаименованиеБезНДС,
	|	ШкалыЦенСНДС.Ссылка КАК ШкалаЦенСНДС,
	|	ШкалыЦенБезНДС.Ссылка КАК ШкалаЦенБезНДС
	|ИЗ
	|	Наименования КАК Наименования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШкалыЦен КАК ШкалыЦенСНДС
	|		ПО Наименования.НаименованиеСНДС = ШкалыЦенСНДС.Наименование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШкалыЦен КАК ШкалыЦенБезНДС
	|		ПО Наименования.НаименованиеБезНДС = ШкалыЦенБезНДС.Наименование";
	
	Запрос.УстановитьПараметр("Наименования", ТаблицаНаименований);
	
	ТаблицаНайденныхШкал = Запрос.Выполнить().Выгрузить();
	ТаблицаНайденныхШкал.Индексы.Добавить("ИдентификаторСтрокиУслуг");
	
	НовыеШкалы = Новый Соответствие;
	
	Для Каждого СтрокаУслуги Из СтрокиУслуг Цикл
		
		НайденныеШкалы = ТаблицаНайденныхШкал.Найти(СтрокаУслуги.ИдентификаторСтрокиУслуг, "ИдентификаторСтрокиУслуг");
		
		Если ЗначениеЗаполнено(НайденныеШкалы.ШкалаЦенСНДС) Тогда
			СтрокаУслуги.ШкалаСтоимостьСНДС = НайденныеШкалы.ШкалаЦенСНДС;
		Иначе
			СозданнаяШкала = НовыеШкалы.Получить(НайденныеШкалы.НаименованиеСНДС);
			Если СозданнаяШкала <> Неопределено Тогда
				СтрокаУслуги.ШкалаСтоимостьСНДС = СозданнаяШкала;
			Иначе
				СтрокиШкалы = ШкалаСтавок.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", СтрокаУслуги.ИдентификаторСтрокиУслуг));
				НоваяШкала = СоздатьНовуюШкалу(СтрокиШкалы, "СтоимостьСНДС");
				НовыеШкалы.Вставить(НайденныеШкалы.НаименованиеСНДС, НоваяШкала);
				СтрокаУслуги.ШкалаСтоимостьСНДС = НоваяШкала;
			КонецЕсли;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НайденныеШкалы.ШкалаЦенБезНДС) Тогда
			СтрокаУслуги.ШкалаСтоимостьБезНДС = НайденныеШкалы.ШкалаЦенБезНДС;
		Иначе
			СозданнаяШкала = НовыеШкалы.Получить(НайденныеШкалы.НаименованиеБезНДС);
			Если СозданнаяШкала <> Неопределено Тогда
				СтрокаУслуги.ШкалаСтоимостьБезНДС = СозданнаяШкала;
			Иначе
				СтрокиШкалы = ШкалаСтавок.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", СтрокаУслуги.ИдентификаторСтрокиУслуг));
				НоваяШкала = СоздатьНовуюШкалу(СтрокиШкалы, "СтоимостьБезНДС");
				НовыеШкалы.Вставить(НайденныеШкалы.НаименованиеБезНДС, НоваяШкала);
				СтрокаУслуги.ШкалаСтоимостьБезНДС = НоваяШкала;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура НайтиЗаписатьДетализациюКомплексныхСтавок() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДетализацияПустаяСсылка = Справочники.ДетализацияКомплексныхУслугПоставщиков.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	//Запрос.Текст =
	//Евросиб Шевченко А.В. US 125530 TA 128244 13.02.2026
	//"ВЫБРАТЬ
	//|	Детализация.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	//|	Детализация.НоменклатураПоставщика КАК НоменклатураПоставщика,
	//|	Детализация.Номенклатура КАК Номенклатура,
	//|	Детализация.ПроцентОтСтавки КАК ПроцентОтСтавки
	//|ПОМЕСТИТЬ Детализация
	//|ИЗ
	//|	&Детализация КАК Детализация
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Детализация.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	//|	КОЛИЧЕСТВО(*) КАК КоличествоСтрокДетализации
	//|ПОМЕСТИТЬ Услуги
	//|ИЗ
	//|	Детализация КАК Детализация
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Детализация.ИдентификаторСтрокиУслуг
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Детализация.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	//|	ДетализацияКомплексныхУслугДетализация.Ссылка КАК Ссылка,
	//|	КОЛИЧЕСТВО(ДетализацияКомплексныхУслугДетализация.НоменклатураПоставщика) КАК КоличествоСтрок
	//|ПОМЕСТИТЬ НайденныеДетализации
	//|ИЗ
	//|	Детализация КАК Детализация
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДетализацияКомплексныхУслугПоставщиков.Детализация КАК ДетализацияКомплексныхУслугДетализация
	//|		ПО Детализация.НоменклатураПоставщика = ДетализацияКомплексныхУслугДетализация.НоменклатураПоставщика
	//|			И Детализация.Номенклатура = ДетализацияКомплексныхУслугДетализация.Номенклатура
	//|			И Детализация.ПроцентОтСтавки = ДетализацияКомплексныхУслугДетализация.ПроцентОтСтавки
	//|		ПО Детализация.Номенклатура = ДетализацияКомплексныхУслугДетализация.Номенклатура
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Детализация.ИдентификаторСтрокиУслуг,
	//|	ДетализацияКомплексныхУслугДетализация.Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	//|	ДетализацияКомплексныхУслуг.Ссылка КАК Ссылка
	//|ИЗ
	//|	Услуги КАК Услуги
	//|		ЛЕВОЕ СОЕДИНЕНИЕ НайденныеДетализации КАК НайденныеДетализации
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДетализацияКомплексныхУслугПоставщиков КАК ДетализацияКомплексныхУслуг
	//|			ПО НайденныеДетализации.Ссылка = ДетализацияКомплексныхУслуг.Ссылка
	//|				И НайденныеДетализации.КоличествоСтрок = ДетализацияКомплексныхУслуг.КоличествоСтрокДетализации
	//|		ПО Услуги.ИдентификаторСтрокиУслуг = НайденныеДетализации.ИдентификаторСтрокиУслуг
	//|			И Услуги.КоличествоСтрокДетализации = НайденныеДетализации.КоличествоСтрок";
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Детализация.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	Детализация.НоменклатураПоставщика КАК НоменклатураПоставщика,
	|	Детализация.Номенклатура КАК Номенклатура,
	|	Детализация.ПроцентОтСтавки КАК ПроцентОтСтавки
	|ПОМЕСТИТЬ Детализация
	|ИЗ
	|	&Детализация КАК Детализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Детализация.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	КОЛИЧЕСТВО(*) КАК КоличествоСтрокДетализации
	|ПОМЕСТИТЬ Услуги
	|ИЗ
	|	Детализация КАК Детализация
	|
	|СГРУППИРОВАТЬ ПО
	|	Детализация.ИдентификаторСтрокиУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Детализация.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	ДетализацияКомплексныхУслугДетализация.Ссылка КАК Ссылка,
	|	ДетализацияКомплексныхУслугДетализация.Номенклатура КАК Номенклатура,
	|	1 КАК КоличествоСтрок
	|ПОМЕСТИТЬ НайденныеДетализации2
	|ИЗ
	|	Детализация КАК Детализация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДетализацияКомплексныхУслугПоставщиков.Детализация КАК ДетализацияКомплексныхУслугДетализация
	|		ПО Детализация.Номенклатура = ДетализацияКомплексныхУслугДетализация.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	Детализация.ИдентификаторСтрокиУслуг,
	|	ДетализацияКомплексныхУслугДетализация.Ссылка,
	|	ДетализацияКомплексныхУслугДетализация.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НайденныеДетализации2.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	НайденныеДетализации2.Ссылка КАК Ссылка,
	|	СУММА(НайденныеДетализации2.КоличествоСтрок) КАК КоличествоСтрок
	|ПОМЕСТИТЬ НайденныеДетализации
	|ИЗ
	|	НайденныеДетализации2 КАК НайденныеДетализации2
	|
	|СГРУППИРОВАТЬ ПО
	|	НайденныеДетализации2.ИдентификаторСтрокиУслуг,
	|	НайденныеДетализации2.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Услуги.ИдентификаторСтрокиУслуг КАК ИдентификаторСтрокиУслуг,
	|	МАКСИМУМ(ДетализацияКомплексныхУслуг.Ссылка) КАК Ссылка
	|ИЗ
	|	Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ НайденныеДетализации КАК НайденныеДетализации
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДетализацияКомплексныхУслугПоставщиков КАК ДетализацияКомплексныхУслуг
	|			ПО (НайденныеДетализации.Ссылка = ДетализацияКомплексныхУслуг.Ссылка)
	|				И (НайденныеДетализации.КоличествоСтрок = ДетализацияКомплексныхУслуг.КоличествоСтрокДетализации)
	|		ПО (Услуги.ИдентификаторСтрокиУслуг = НайденныеДетализации.ИдентификаторСтрокиУслуг)
	|			И (Услуги.КоличествоСтрокДетализации = НайденныеДетализации.КоличествоСтрок)
	|
	|СГРУППИРОВАТЬ ПО
	|	Услуги.ИдентификаторСтрокиУслуг";
	//Евросиб Шевченко А.В. US 125530 TA 128244 13.02.2026
		
	
	Запрос.УстановитьПараметр("Детализация", ДетализацияКомплекснойСтавки.Выгрузить());	
	ТаблицаДетализации = Запрос.Выполнить().Выгрузить();
	
	НовыеДетализации = Новый Массив;
	
	Для Каждого Стр Из Услуги Цикл
		
		Детализация = ТаблицаДетализации.Найти(Стр.ИдентификаторСтрокиУслуг, "ИдентификаторСтрокиУслуг");
		Если Детализация <> Неопределено Тогда
			Если ЗначениеЗаполнено(Детализация.Ссылка) Тогда
				
				Стр.ДетализацияКомплекснойСтавки = Детализация.Ссылка;
				
			Иначе
				
				СтрокиДетализации = ДетализацияКомплекснойСтавки.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", Стр.ИдентификаторСтрокиУслуг));
				КоличествоСтрок = СтрокиДетализации.Количество();
				
				НайденнаяДетализация = Неопределено;
				Для Каждого НоваяДетализация Из НовыеДетализации Цикл					
					Если НоваяДетализация.КоличествоСтрокДетализации = КоличествоСтрок Тогда
						ВсеСтрокиНайдены = Истина;
						Для Каждого СтрДетализации Из СтрокиДетализации Цикл
							//Евросиб Шевченко А.В. US 125530 TA 128244 13.02.2026
							//НайденныеСтроки = НоваяДетализация.Детализация.НайтиСтроки(Новый Структура("НоменклатураПоставщика,Номенклатура,ПроцентОтСтавки", СтрДетализации.НоменклатураПоставщика, СтрДетализации.Номенклатура, СтрДетализации.ПроцентОтСтавки));
							НайденныеСтроки = НоваяДетализация.Детализация.НайтиСтроки(Новый Структура("Номенклатура", СтрДетализации.Номенклатура));
							//Евросиб Шевченко А.В. US 125530 TA 128244 13.02.2026
							Если Не ЗначениеЗаполнено(НайденныеСтроки) Тогда
								ВсеСтрокиНайдены = Ложь;
								Прервать;
							КонецЕсли;
						КонецЦикла;
						Если ВсеСтрокиНайдены Тогда
							НайденнаяДетализация = НоваяДетализация;
							Прервать;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
				Если НайденнаяДетализация <> Неопределено Тогда
					Стр.ДетализацияКомплекснойСтавки = НайденнаяДетализация.Ссылка;
				Иначе
					НоваяДетализация = Справочники.ДетализацияКомплексныхУслугПоставщиков.СоздатьЭлемент();
					Для Каждого СтрокаДетализации Из СтрокиДетализации Цикл
						НоваяСтрока = НоваяДетализация.Детализация.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДетализации);
					КонецЦикла;
					НоваяДетализация.Записать();
					НовыеДетализации.Добавить(НоваяДетализация);
					
					Стр.ДетализацияКомплекснойСтавки = НоваяДетализация.Ссылка;
				КонецЕсли;
				
			КонецЕсли;
		Иначе
			Стр.ДетализацияКомплекснойСтавки = ДетализацияПустаяСсылка;
		КонецЕсли;		
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция СоздатьНовуюШкалу(СтрокиШкалы, ИмяПоляЦена)
	
	НовыйЭлемент = Справочники.ШкалыЦен.СоздатьЭлемент();
	
	Для Каждого СтрокаШкалы Из СтрокиШкалы Цикл
		НоваяСтрока = НовыйЭлемент.Шкала.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаШкалы, "От, До");
		НоваяСтрока.Цена = СтрокаШкалы[ИмяПоляЦена];
	КонецЦикла;
	
	НовыйЭлемент.Записать();
	
	Возврат НовыйЭлемент.Ссылка;
	
КонецФункции

Функция НайтиНоменклатуруПоставщика(Наименование, Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НоменклатураПоставщиков.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НоменклатураПоставщиков КАК НоменклатураПоставщиков
	|ГДЕ
	|	НоменклатураПоставщиков.Наименование = &Наименование
	|	И НоменклатураПоставщиков.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		НоменклатураПоставщика = Выборка.Ссылка;
	Иначе
		НоменклатураПоставщика = Справочники.НоменклатураПоставщиков.ПустаяСсылка();
	КонецЕсли;
	
	Возврат НоменклатураПоставщика;
	
КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
	ЕдиницаИзмеренияВагоноСутки = Справочники.КлассификаторЕдиницИзмерения.ВагоноСутки;
	ЕдиницаИзмеренияВагон = Справочники.КлассификаторЕдиницИзмерения.вагон;
	ЕдиницаИзмеренияКонтейнероСутки = Справочники.КлассификаторЕдиницИзмерения.КонтейнероСутки;
	ЕдиницаИзмеренияКонтейнер = Справочники.КлассификаторЕдиницИзмерения.ктк;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		
		РеквизитыКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контрагент, "ИсполнительУслуги, ТипКонтрагента_Подрядчик");
		
		//Если Не РеквизитыКонтрагента.ИсполнительУслуги Тогда
		//	//ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", Стр.НомерСтроки, Поле.Имя);
		//	ТекстСообщения = "Создание ПСЦ Поставщика с данным контрагентом невозможно, т.к. выбранный контрагент не является исполнителем услуг/подряда.";
		//	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, "Контрагент", "Объект", Отказ);
		//КонецЕсли;
		
		Если Не РеквизитыКонтрагента.ТипКонтрагента_Подрядчик Тогда
			ТекстСообщения = "Контрагент не является Подрядчиком. Проведение документа запрещено.";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, "Контрагент", "Объект", Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОкончаниеДействия) Тогда
		Если ОкончаниеДействия <= НачалоДействия Тогда
			ТекстСообщения = "Окончание действия должно быть больше Начала действия.";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, "ОкончаниеДействия", "Объект", Отказ);
		КонецЕсли;
	КонецЕсли;
	
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ДатаНачалаДействияДоговора, СрокДействия");
	Если ЗначениеЗаполнено(РеквизитыДоговора.ДатаНачалаДействияДоговора) Тогда
		Если ДатаПСЦ < РеквизитыДоговора.ДатаНачалаДействияДоговора Или (ЗначениеЗаполнено(РеквизитыДоговора.СрокДействия) И ДатаПСЦ > РеквизитыДоговора.СрокДействия) Тогда
			ТекстСообщения = "Дата ПСЦ не входит в период действия договора.";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, "ДатаПСЦ", "Объект", Отказ);
		КонецЕсли;
		Если НачалоДействия < РеквизитыДоговора.ДатаНачалаДействияДоговора Или (ЗначениеЗаполнено(РеквизитыДоговора.СрокДействия) И НачалоДействия > РеквизитыДоговора.СрокДействия) Тогда
			ТекстСообщения = "Дата Начала действия ПСЦ не входит в период действия договора.";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, "НачалоДействия", "Объект", Отказ);
		КонецЕсли;
	КонецЕсли;	
	
	Если Не ДействуетДоСогласованияНовыхУсловий И Не ЗначениеЗаполнено(ОкончаниеДействия) Тогда
		ТекстСообщения = "Поле ""Окончание действия"" не заполнено";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, "ОкончаниеДействия", "Объект", Отказ);
	КонецЕсли;
	
	НастройкиВидаУслуг = Справочники.ВидыУслугПоставщиков.ПолучитьНастройкиВидаУслуг(ВидУслугПоставщика, "ПСЦПоставщика.Услуги");
	ПоляТаблицыУслуг = НастройкиВидаУслуг.ПоляТаблицыУслуг;
	ДопУсловия = НастройкиВидаУслуг.ДопУсловия;
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	НоменклатураРазрешенныеЕИ.Ссылка КАК Номенклатура,
	|	НоменклатураРазрешенныеЕИ.Элемент КАК ЕдиницаИзмерения
	|ИЗ
	|	Справочник.Номенклатура.РазрешенныеЕИ КАК НоменклатураРазрешенныеЕИ
	|ГДЕ
	|	НоменклатураРазрешенныеЕИ.Ссылка В(&Номенклатура)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НоменклатураРазрешенныеЕИ.Ссылка";
	
	ТаблицаНоменклатуры = Услуги.Выгрузить(, "Номенклатура");
	ТаблицаНоменклатуры.Свернуть("Номенклатура");
	Запрос.УстановитьПараметр("Номенклатура", ТаблицаНоменклатуры.ВыгрузитьКолонку("Номенклатура"));
	
	РазрешенныеЕдиницы = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Номенклатура") Цикл
		Единицы = Новый Массив;
		Пока Выборка.СледующийПоЗначениюПоля("ЕдиницаИзмерения") Цикл
			Единицы.Добавить(Выборка.ЕдиницаИзмерения);
		КонецЦикла;
		РазрешенныеЕдиницы.Вставить(Выборка.Номенклатура, Единицы);
	КонецЦикла;
	
	Для Каждого Стр Из Услуги Цикл
		
		Для Каждого Поле Из ПоляТаблицыУслуг Цикл
			
			Если Поле.Обязательное Тогда
				//Евросиб Шевченко А.В. US 83101 TA 122833 07.11.2025
				ПоискДопУсловия = Новый Структура("Имя",Поле.Имя);
				НайденноеУсловие = ДопУсловия.НайтиСтроки(ПоискДопУсловия);
				Если НайденноеУсловие.Количество() Тогда
					Результат = ВыполнитьПроверкуУсловий(Стр,НайденноеУсловие[0]);
					Если Результат Тогда
						
						Если Поле.Имя = "ТипоразмерыКТК" Или Поле.Имя = "ТипоразмерыКТКСтрокой" Тогда
							СтрокаКритерия = КритерииУслуг.Найти(Стр.ИдентификаторСтрокиУслуг, "ИдентификаторСтрокиУслуг");
							Если СтрокаКритерия <> Неопределено Тогда
								Если Не ЗначениеЗаполнено(СтрокаКритерия.ТипоразмерКТК) Тогда
									ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", Стр.НомерСтроки, Поле.Имя);
									ТекстСообщения = СтрШаблон("В строке №%1 не заполнено обязательное поле: %2", Стр.НомерСтроки, Поле.Представление);
									ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКПолюТЧ, "Объект", Отказ);
								КонецЕсли;
							КонецЕсли;
							Продолжить;
						КонецЕсли;
						
						Если Поле.Имя = "ТипоразмерыВагонов" Или Поле.Имя = "ТипоразмерыВагоновСтрокой" Или Поле.Имя = "ТипоразмерВагона" Тогда
							СтрокаКритерия = КритерииУслуг.Найти(Стр.ИдентификаторСтрокиУслуг, "ИдентификаторСтрокиУслуг");
							Если СтрокаКритерия <> Неопределено Тогда
								Если Не ЗначениеЗаполнено(СтрокаКритерия.ТипоразмерВагона) Тогда
									ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", Стр.НомерСтроки, Поле.Имя);
									ТекстСообщения = СтрШаблон("В строке №%1 не заполнено обязательное поле: %2", Стр.НомерСтроки, Поле.Представление);
									ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКПолюТЧ, "Объект", Отказ);
								КонецЕсли;
							КонецЕсли;
							Продолжить;
						КонецЕсли;
						
						Если Не ЗначениеЗаполнено(Стр[Поле.Имя]) Тогда
							//Евросиб Шевченко А.В. US 125530 TA 131571 12.03.2026
							ОсобоеСобщение = Ложь;
							
							Если Поле.Имя = "Комментарий" Тогда
								СтруктураП = Новый Структура("ИдентификаторСтрокиУслуг", Стр.ИдентификаторСтрокиУслуг);
								СтрокиКритерии = КритерииУслуг.НайтиСтроки(СтруктураП);
								Если СтрокиКритерии.Количество() Тогда
									Для Каждого СтрокаК Из СтрокиКритерии Цикл
										Если СтрокаК.ТипоразмерКТК = Справочники.ТипоразмерыТЕ.Другое Тогда
											ОсобоеСобщение = Истина;
											ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", Стр.НомерСтроки, Поле.Имя);
											ТекстСообщения = "Необходимо описать тип перевозимой установки";
											ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКПолюТЧ, "Объект", Отказ);
											Прервать;
										КонецЕсли;
									КонецЦикла;	
								КонецЕсли;	

							КонецЕсли;
							
							Если НЕ ОсобоеСобщение Тогда
								ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", Стр.НомерСтроки, Поле.Имя);
								ТекстСообщения = СтрШаблон("В строке №%1 не заполнено обязательное поле: %2", Стр.НомерСтроки, Поле.Представление);
								ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКПолюТЧ, "Объект", Отказ);
							КонецЕсли;
							//Евросиб Шевченко А.В. US 125530 TA 131571 12.03.2026
						КонецЕсли;
						
					КонецЕсли;	
				
				
				//Если Поле.Имя = "ТипоразмерыКТК" Или Поле.Имя = "ТипоразмерыКТКСтрокой" Тогда
				//	//Евросиб Ситников К.А. Task Task 113749
				//	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
				//	//Если ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Терминалы Тогда
				//	Если ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Терминалы ИЛИ ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Порты Тогда
				//		//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
				//								
				//		Если НЕ(Стр.ЕдиницаИзмерения = ЕдиницаИзмеренияКонтейнер Или Стр.ЕдиницаИзмерения = ЕдиницаИзмеренияКонтейнероСутки) Тогда
				//			//Евросиб Ситников К.А. Task Task 113749	
				//			Продолжить;
				//		КонецЕсли;
				//	КонецЕсли;
				//					
				//	СтрокаКритерия = КритерииУслуг.Найти(Стр.ИдентификаторСтрокиУслуг, "ИдентификаторСтрокиУслуг");
				//	Если СтрокаКритерия <> Неопределено Тогда
				//		Если Не ЗначениеЗаполнено(СтрокаКритерия.ТипоразмерКТК) Тогда
				//			ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", Стр.НомерСтроки, Поле.Имя);
				//			ТекстСообщения = СтрШаблон("В строке №%1 не заполнено обязательное поле: %2", Стр.НомерСтроки, Поле.Представление);
				//			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКПолюТЧ, "Объект", Отказ);
				//		КонецЕсли;
				//	КонецЕсли;
				//	
				//ИначеЕсли Поле.Имя = "ТипоразмерыВагонов" Или Поле.Имя = "ТипоразмерыВагоновСтрокой" Или Поле.Имя = "ТипоразмерВагона" Тогда
				//    //Евросиб Ситников К.А. Task Task 113749	
				//	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
				//	//Если ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Терминалы Тогда
				//	Если ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Терминалы ИЛИ ВидУслугПоставщика = Справочники.ВидыУслугПоставщиков.Порты Тогда
				//	//Евросиб Шевченко А.В. US 110216 TA 112376 07.08.2025
				//	
				//		ЕдКТК = Новый Массив;
				//		ЕдКТК.Добавить(Справочники.Номенклатура.ТерминальнаяОбработкаОтправка);
				//		ЕдКТК.Добавить(Справочники.Номенклатура.ТерминальнаяОбработкаПрием);
				//		ЕдКТК.Добавить(Справочники.Номенклатура.ТерминальнаяОбработкаПерегрузНСК);
				//	
				//		Если НЕ(Стр.ЕдиницаИзмерения = ЕдиницаИзмеренияВагон Или Стр.ЕдиницаИзмерения = ЕдиницаИзмеренияВагоноСутки) И ЕдКТК.Найти(Стр.Номенклатура) = Неопределено Тогда
				//    //Евросиб Ситников К.А. Task Task 113749
				//			Продолжить;
				//		КонецЕсли;
				//	КонецЕсли;
				//					
				//	СтрокаКритерия = КритерииУслуг.Найти(Стр.ИдентификаторСтрокиУслуг, "ИдентификаторСтрокиУслуг");
				//	Если СтрокаКритерия <> Неопределено Тогда
				//		Если Не ЗначениеЗаполнено(СтрокаКритерия.ТипоразмерВагона) Тогда
				//			ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", Стр.НомерСтроки, Поле.Имя);
				//			ТекстСообщения = СтрШаблон("В строке №%1 не заполнено обязательное поле: %2", Стр.НомерСтроки, Поле.Представление);
				//			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКПолюТЧ, "Объект", Отказ);
				//		КонецЕсли;
				//	КонецЕсли;
				//Евросиб Шевченко А.В. US 83101 TA 122833 07.11.2025	
			Иначе
				
				Если Поле.Имя = "ТипоразмерыКТК" Или Поле.Имя = "ТипоразмерыКТКСтрокой" Тогда
					//					
					СтрокаКритерия = КритерииУслуг.Найти(Стр.ИдентификаторСтрокиУслуг, "ИдентификаторСтрокиУслуг");
					Если СтрокаКритерия <> Неопределено Тогда
						Если Не ЗначениеЗаполнено(СтрокаКритерия.ТипоразмерКТК) Тогда
							ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", Стр.НомерСтроки, Поле.Имя);
							ТекстСообщения = СтрШаблон("В строке №%1 не заполнено обязательное поле: %2", Стр.НомерСтроки, Поле.Представление);
							ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКПолюТЧ, "Объект", Отказ);
						КонецЕсли;
					КонецЕсли;
					Продолжить;
				ИначеЕсли Поле.Имя = "ТипоразмерыВагонов" Или Поле.Имя = "ТипоразмерыВагоновСтрокой" Или Поле.Имя = "ТипоразмерВагона" Тогда
					
					СтрокаКритерия = КритерииУслуг.Найти(Стр.ИдентификаторСтрокиУслуг, "ИдентификаторСтрокиУслуг");
					Если СтрокаКритерия <> Неопределено Тогда
						Если Не ЗначениеЗаполнено(СтрокаКритерия.ТипоразмерВагона) Тогда
							ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", Стр.НомерСтроки, Поле.Имя);
							ТекстСообщения = СтрШаблон("В строке №%1 не заполнено обязательное поле: %2", Стр.НомерСтроки, Поле.Представление);
							ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКПолюТЧ, "Объект", Отказ);
						КонецЕсли;
					КонецЕсли;
					Продолжить;
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Стр[Поле.Имя]) Тогда
					ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", Стр.НомерСтроки, Поле.Имя);
					ТекстСообщения = СтрШаблон("В строке №%1 не заполнено обязательное поле: %2", Стр.НомерСтроки, Поле.Представление);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКПолюТЧ, "Объект", Отказ);
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
		Если Стр.Номенклатура = Справочники.Номенклатура.АрендаКонтейнеров И Стр.ВидСобственности = Перечисления.ВариантыСобственности.Спот Тогда
			ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", Стр.НомерСтроки, "ВидСобственности");
			ТекстСообщения = СтрШаблон("В строке №%1 «АрендаКонтейнера» выбрано недопустимое значение Вида собственности - «Спот»", Стр.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКПолюТЧ, "Объект", Отказ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.ЕдиницаИзмерения) Тогда
			Единицы = РазрешенныеЕдиницы.Получить(Стр.Номенклатура);
			Если ЗначениеЗаполнено(Единицы) Тогда
				Если Единицы.Найти(Стр.ЕдиницаИзмерения) = Неопределено Тогда
					ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", Стр.НомерСтроки, "ЕдиницаИзмерения");
					ТекстСообщения = СтрШаблон("В строке №%1 единица измерения ""%2"" не соответствует разрешенным единицам измерения номенклатуры %3.", Стр.НомерСтроки, Стр.ЕдиницаИзмерения, Стр.Номенклатура);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКПолюТЧ, "Объект", Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если Стр.ТребуетсяДетализацияКомплекснойСтавки Тогда
			
			Детализация = ДетализацияКомплекснойСтавки.НайтиСтроки(Новый Структура("ИдентификаторСтрокиУслуг", Стр.ИдентификаторСтрокиУслуг));
			СуммаПоСтрокам = 0;
			Для Каждого СтрокаДетализации Из Детализация Цикл
				Если Не ЗначениеЗаполнено(СтрокаДетализации.ПроцентОтСтавки) Тогда
					ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", Стр.НомерСтроки, "ТребуетсяДетализацияКомплекснойСтавки");
					ТекстСообщения = СтрШаблон("В детализации комплексной ставки по строке №%1 не заполнено поле ""Процент от ставки""!", Стр.НомерСтроки);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКПолюТЧ, "Объект", Отказ);
				Иначе
					СуммаПоСтрокам = СуммаПоСтрокам + СтрокаДетализации.ПроцентОтСтавки;
				КонецЕсли;
			КонецЦикла;
			
			Если СуммаПоСтрокам <> 100 Тогда
				ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", Стр.НомерСтроки, "ТребуетсяДетализацияКомплекснойСтавки");
				ТекстСообщения = СтрШаблон("В детализации комплексной ставки по строке №%1 сумма процентов участия услуг в комплексной ставке по всем строкам не равна 100%%!", Стр.НомерСтроки);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКПолюТЧ, "Объект", Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокаСНПВагонов = Услуги.Найти(Справочники.Номенклатура.СНПвагонов, "Номенклатура");
	СтрокаСНПвагоновПогрузкаВыгрузка = Услуги.Найти(Справочники.Номенклатура.СНПвагоновПогрузкаВыгрузка, "Номенклатура");
	Если СтрокаСНПВагонов <> Неопределено И СтрокаСНПвагоновПогрузкаВыгрузка <> Неопределено Тогда
		ПутьКПолюТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Услуги", СтрокаСНПВагонов.НомерСтроки, "Номенклатура");
		ТекстСообщения = СтрШаблон("Ошибка по строкам №%1 (СНПВагонов) и №%2 (СНПвагоновПогрузкаВыгрузка). В протоколе может быть использован только один вид номенклатуры по Сверхнормативному пользованию.", СтрокаСНПВагонов.НомерСтроки, СтрокаСНПвагоновПогрузкаВыгрузка.НомерСтроки);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКПолюТЧ, "Объект", Отказ);
	КонецЕсли; 
	
	//Евросиб Коханенко Н.А. 09.06.2025 (( #109338
	ЭлементВидПеревозки = ПроверяемыеРеквизиты.Найти("ВидПеревозки");
	Если ВидУслугПоставщика = ПредопределенноеЗначение("Справочник.ВидыУслугПоставщиков.Контейнеры") 
		И ЭлементВидПеревозки = Неопределено Тогда
		ПроверяемыеРеквизиты.Добавить("ВидПеревозки");
	ИначеЕсли ЭлементВидПеревозки <> Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(ЭлементВидПеревозки);
	КонецЕсли;
	//Евросиб Коханенко Н.А. 09.06.2025 )) #109338 
	
КонецПроцедуры

Процедура ПрисвоитьНовыйИдентификаторСтрокамТЧ()
	
	// Евросиб 89887 TA 89889 Рыбьяков К.А. 21.01.2025 ((
	Идентификаторы = Новый Соответствие;
	Для Каждого Стр Из Услуги Цикл
		ИдентификаторСтрокиУслуг = Строка(Новый УникальныйИдентификатор);
		СтарыйИдентификатор = Стр.ИдентификаторСтрокиУслуг;
		Стр.ИдентификаторСтрокиУслуг = ИдентификаторСтрокиУслуг;
		Идентификаторы.Вставить(СтарыйИдентификатор, ИдентификаторСтрокиУслуг);
	КонецЦикла;
	
	Для Каждого Стр Из ШкалаСтавок Цикл
		ИдентификаторСтрокиУслуг = Идентификаторы.Получить(Стр.ИдентификаторСтрокиУслуг);
		Если ЗначениеЗаполнено(ИдентификаторСтрокиУслуг) Тогда
			Стр.ИдентификаторСтрокиУслуг = ИдентификаторСтрокиУслуг;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Стр Из УчетныеЕдиницы Цикл
		ИдентификаторСтрокиУслуг = Идентификаторы.Получить(Стр.ИдентификаторСтрокиУслуг);
		Если ЗначениеЗаполнено(ИдентификаторСтрокиУслуг) Тогда
			Стр.ИдентификаторСтрокиУслуг = ИдентификаторСтрокиУслуг;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Стр Из ДетализацияКомплекснойСтавки Цикл
		ИдентификаторСтрокиУслуг = Идентификаторы.Получить(Стр.ИдентификаторСтрокиУслуг);
		Если ЗначениеЗаполнено(ИдентификаторСтрокиУслуг) Тогда
			Стр.ИдентификаторСтрокиУслуг = ИдентификаторСтрокиУслуг;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Стр Из КритерииУслуг Цикл
		ИдентификаторСтрокиУслуг = Идентификаторы.Получить(Стр.ИдентификаторСтрокиУслуг);
		Если ЗначениеЗаполнено(ИдентификаторСтрокиУслуг) Тогда
			Стр.ИдентификаторСтрокиУслуг = ИдентификаторСтрокиУслуг;
		КонецЕсли;
	КонецЦикла;
	// Евросиб Рыбьяков К.А. 21.01.2025 ))
	
КонецПроцедуры

Процедура ЗаполнитьНоменклатуруПоставщиков()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Услуги.НомерСтроки КАК НомерСтроки,
	|	Услуги.НоменклатураПоставщика КАК НоменклатураПоставщика,
	|	Услуги.Номенклатура КАК Номенклатура,
	|	Услуги.НаименованиеНоменклатурыПоставщика КАК НаименованиеНоменклатурыПоставщика
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&Услуги КАК Услуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.НомерСтроки КАК НомерСтроки,
	|	ВТ.НоменклатураПоставщика КАК НоменклатураПоставщика,
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.НаименованиеНоменклатурыПоставщика КАК НаименованиеНоменклатурыПоставщика,
	|	НоменклатураПоставщиков.Ссылка КАК НайденнаяНоменклатураПоставщика
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураПоставщиков КАК НоменклатураПоставщиков
	|		ПО ВТ.Номенклатура = НоменклатураПоставщиков.Номенклатура
	|			И ВТ.НаименованиеНоменклатурыПоставщика = НоменклатураПоставщиков.Наименование
	|ГДЕ
	|	ВТ.НоменклатураПоставщика <> ЕСТЬNULL(НоменклатураПоставщиков.Ссылка, НЕОПРЕДЕЛЕНО)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Услуги", Услуги.Выгрузить(, "НомерСтроки, НоменклатураПоставщика, Номенклатура, НаименованиеНоменклатурыПоставщика"));
	
	НоменклатураПоставщиковПустаяСсылка = Справочники.НоменклатураПоставщиков.ПустаяСсылка();
	Запрос.УстановитьПараметр("НоменклатураПоставщиковПустаяСсылка", НоменклатураПоставщиковПустаяСсылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ТаблицаНовойНоменклатурыПоставщиков = Услуги.ВыгрузитьКолонки("Номенклатура, НаименованиеНоменклатурыПоставщика, НоменклатураПоставщика");
	ТаблицаНовойНоменклатурыПоставщиков.Индексы.Добавить("Номенклатура, НаименованиеНоменклатурыПоставщика");	
	СтруктураПоискаНовойНоменклатурыПоставщиков = Новый Структура("Номенклатура, НаименованиеНоменклатурыПоставщика");
	
	Пока Выборка.Следующий() Цикл
		
		ИндексСтроки = Выборка.НомерСтроки - 1;
		СтрокаТЧ = Услуги[ИндексСтроки];
		
		Если ЗначениеЗаполнено(Выборка.НайденнаяНоменклатураПоставщика) Тогда
			
			СтрокаТЧ.НоменклатураПоставщика = Выборка.НайденнаяНоменклатураПоставщика;
			
		ИначеЕсли ЗначениеЗаполнено(Выборка.Номенклатура) И ЗначениеЗаполнено(Выборка.НаименованиеНоменклатурыПоставщика) Тогда
			
			ЗаполнитьЗначенияСвойств(СтруктураПоискаНовойНоменклатурыПоставщиков, Выборка);
			НайденныеСтроки = ТаблицаНовойНоменклатурыПоставщиков.НайтиСтроки(СтруктураПоискаНовойНоменклатурыПоставщиков);
			Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
				СтрокаТЧ.НоменклатураПоставщика = НайденныеСтроки[0].НоменклатураПоставщика;
			Иначе
				
				НовыйЭлемент = Справочники.НоменклатураПоставщиков.СоздатьЭлемент();
				НовыйЭлемент.Наименование = Выборка.НаименованиеНоменклатурыПоставщика;
				НовыйЭлемент.Номенклатура = Выборка.Номенклатура;
				НовыйЭлемент.Записать();
				
				СтрокаТЧ.НоменклатураПоставщика = НовыйЭлемент.Ссылка;
				
				НоваяСтрока = ТаблицаНовойНоменклатурыПоставщиков.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураПоискаНовойНоменклатурыПоставщиков);
				НоваяСтрока.НоменклатураПоставщика = НовыйЭлемент.Ссылка;
				
			КонецЕсли;
			
		Иначе
			
			СтрокаТЧ.НоменклатураПоставщика = НоменклатураПоставщиковПустаяСсылка;
			
		КонецЕсли;
	
	КонецЦикла;
	
	
КонецПроцедуры

Функция ВыполнитьПроверкуУсловий(Стр,Условие) //Евросиб Шевченко А.В. US 83101 TA 122833 07.11.2025
	
	СтрокиДляВыгрузки = Новый Массив;
	СтрокиДляВыгрузки.Добавить(Стр);
	
	ТаблицаПараметр = Услуги.Выгрузить(СтрокиДляВыгрузки);
	//Евросиб Шевченко А.В. US 125530 TA 131571 12.03.2026
	ТаблицаТиповКТК	= КритерииУслуг.Выгрузить(,"ТипоразмерКТК, ИдентификаторСтрокиУслуг");
	//Евросиб Шевченко А.В. US 125530 TA 131571 12.03.2026
	СхемаКомпоновкиДанных = ПолучитьОбщийМакет("ДопУсловияОбязательныхПолейВидовУслугПоставщиков");
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпоновщикНастроек.ЗагрузитьНастройки(Условие.Условие.Получить());
	Настройки = КомпоновщикНастроек.Настройки;
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	
	СтруктураВнешнейТаблицы = Новый Структура("Услуги",ТаблицаПараметр);
	//Евросиб Шевченко А.В. US 125530 TA 131571 12.03.2026
	СтруктураВнешнейТаблицы.Вставить("ТипоразмерыКТК",ТаблицаТиповКТК);
	//Евросиб Шевченко А.В. US 125530 TA 131571 12.03.2026
	
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,СтруктураВнешнейТаблицы , ДанныеРасшифровки);
	
	Результат = Новый ТабличныйДокумент();
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ТзРезультат = Новый ТаблицаЗначений;
	
	ПроцессорВывода.УстановитьОбъект(ТзРезультат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);	
	
	Возврат ТзРезультат.Количество() <> 0;
	
КонецФункции	

//Евросиб СубботинВ #131884 02.03.2026 Начало
Процедура СоздатьКлючиАналитикиСтрокПротокола(РежимЗаписи)
	
	УзелОбмена = Перечисления.УзлыОбмена.BI;	
	КлючПустаяСсылка = Справочники.КлючиАналитикиСтрокПротокола.ПустаяСсылка();
	ВыгрузкаДанных = Перечисления.ДействияПриОбмене.ВыгрузкаДанных;
	
	ДобавляемыеВПланОбмена = Новый Массив;
	УдаляемыеИзПланаОбмена = Новый Массив;
	
	Если Не ЭтоНовый() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Протокол.СтатусДокумента КАК СтатусДокумента,
		|	Протокол.НачалоДействия КАК НачалоДействия,
		|	Протокол.ОкончаниеДействия КАК ОкончаниеДействия,
		|	Протокол.Проведен КАК Проведен
		|ИЗ
		|	Документ.ПСЦПоставщика КАК Протокол
		|ГДЕ
		|	Протокол.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Услуги.Критерий КАК Критерий,
		|	Услуги.СтоимостьБезНДС КАК СтоимостьБезНДС,
		|	Услуги.СтоимостьСНДС КАК СтоимостьСНДС,
		|	Услуги.КлючАналитикиСтрокиПротокола КАК КлючАналитикиСтрокиПротокола
		|ИЗ
		|	Документ.ПСЦПоставщика.Услуги КАК Услуги
		|ГДЕ
		|	Услуги.Ссылка = &Ссылка
		|	И Услуги.КлючАналитикиСтрокиПротокола <> &КлючПустаяСсылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("КлючПустаяСсылка", КлючПустаяСсылка);
		
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
		ДанныеШапки = РезультатыЗапроса[0].Выбрать();
		ДанныеШапки.Следующий();
		Если (РежимЗаписи = РежимЗаписиДокумента.Проведение И Не Проведен)
				Или РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
				Или СтатусДокумента <> ДанныеШапки.СтатусДокумента 
				Или НачалоДействия <> ДанныеШапки.НачалоДействия 
				Или ОкончаниеДействия <> ДанныеШапки.ОкончаниеДействия Тогда				
			Для Каждого Стр Из Услуги Цикл
				Если ЗначениеЗаполнено(Стр.КлючАналитикиСтрокиПротокола) Тогда
					ДобавляемыеВПланОбмена.Добавить(Стр.КлючАналитикиСтрокиПротокола);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Выборка = РезультатыЗапроса[1].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ЗаписатьКлюч = Ложь;
			ПометитьНаУдаление = Ложь;
			
			Ключ = Выборка.КлючАналитикиСтрокиПротокола;
			
			НайденнаяСтрока = Услуги.Найти(Ключ, "КлючАналитикиСтрокиПротокола");			
			Если НайденнаяСтрока = Неопределено Тогда
				КлючОбъект = Ключ.ПолучитьОбъект();
				КлючОбъект.УстановитьПометкуУдаления(Истина);
				
				ВремяВыгрузки = РегистрыСведений.ПротоколОбменов.ДатаВыгрузкиОбъекта(УзелОбмена, ВыгрузкаДанных, Ключ);
				Если ЗначениеЗаполнено(ВремяВыгрузки) Тогда
					Если ДобавляемыеВПланОбмена.Найти(Ключ) = Неопределено Тогда
						ДобавляемыеВПланОбмена.Добавить(Ключ);
					КонецЕсли;
				Иначе
					УдаляемыеИзПланаОбмена.Добавить(Ключ);
				КонецЕсли;
			Иначе
				Если Выборка.Критерий <> НайденнаяСтрока.Критерий
						Или Выборка.СтоимостьБезНДС <> НайденнаяСтрока.СтоимостьБезНДС 
						Или Выборка.СтоимостьСНДС <> НайденнаяСтрока.СтоимостьСНДС Тогда
						
					Если ДобавляемыеВПланОбмена.Найти(Ключ) = Неопределено Тогда
						ДобавляемыеВПланОбмена.Добавить(Ключ);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
					
	КонецЕсли;
			
	СтрокиБезКлюча = Услуги.НайтиСтроки(Новый Структура("КлючАналитикиСтрокиПротокола", КлючПустаяСсылка));
	Для Каждого Стр Из СтрокиБезКлюча Цикл
		КлючОбъект = Справочники.КлючиАналитикиСтрокПротокола.СоздатьЭлемент();
		КлючОбъект.Записать();
		Стр.КлючАналитикиСтрокиПротокола = КлючОбъект.Ссылка;
		ДобавляемыеВПланОбмена.Добавить(КлючОбъект.Ссылка);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(УдаляемыеИзПланаОбмена) Тогда
		ПланыОбмена.ВыгрузкаДанных.УдалитьРегистрациюИзменений(УдаляемыеИзПланаОбмена, УзелОбмена);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДобавляемыеВПланОбмена) и НачалоДействия >= Дата("20241101") Тогда
		ПланыОбмена.ВыгрузкаДанных.ЗарегистрироватьИзмененияПоДокументу(ДобавляемыеВПланОбмена, УзелОбмена);
	КонецЕсли;
	
КонецПроцедуры
//Евросиб СубботинВ #131884 02.03.2026 Конец
