Процедура ТекущийИсполнитель_СтатусПриИзменении(Объект, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель) Экспорт
	
	//Евросиб Каблов 11.06.2021 ( Ticket#0234671
	Если ТекущийИсполнитель_Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен") Тогда
		Проведен = Неопределено;
		Если Объект.Свойство("Проведен", Проведен) Тогда
			Если Не Проведен Тогда
				ПоказатьПредупреждение(, "Документ не проведен! Запрещено выполнение задач непроведенных документов.");
				СтрокиСостояния = Объект.Состояния.НайтиСтроки(Новый Структура("Состояние", ТекущийИсполнитель_Состояние));
				Если СтрокиСостояния.Количество() > 0 Тогда
					ТекущийИсполнитель_Статус = СтрокиСостояния[0].Статус;
				КонецЕсли;
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Евросиб Каблов 11.06.2021 ) 
	
	// обновляем информацию по состоянию
	НеобходимоВыполнитьОбработкуПоследующихЗадач = Ложь; // ++ Сгонник, 21-10-26 №27109
	Для каждого Состояние из Объект.Состояния Цикл
		Если Состояние.Состояние = ТекущийИсполнитель_Состояние Тогда
			Состояние.Статус = ТекущийИсполнитель_Статус;
			
			Состояние.Исполнитель = ПользователиКлиент.ТекущийПользователь();
			ТекущийИсполнитель_Исполнитель = Состояние.Исполнитель;
			ТекущийИсполнитель_Наблюдатель = Состояние.Наблюдатель;
			
			// ++ ДИТ Сгонник, 21-10-26 №27109
			Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") ИЛИ ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
				НеобходимоВыполнитьОбработкуПоследующихЗадач = ТекущийИсполнитель_Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен") И ЗначениеЗаполнено(Состояние.ДатаВозвратаИсполнителю);
				Если НеобходимоВыполнитьОбработкуПоследующихЗадач Тогда
					ДатаВыполнения = ТекущаяДата();
					Состояние.НачалоРаботы = ДатаВыполнения;
					Состояние.ЗавершениеРаботы = ДатаВыполнения;
					
					// необходимо закрывать диалоги
					// ГУИД темы - это новый уникальный идентификатор, поэтому нужно получить список тем
					// и найти соответствующий по дате создания темы (?)
					ТаблицаТем = Диалоги_сервер.ПолучитьНаборТемПоПараметрам(,,,,,, Объект.Ссылка);
					
					Для Каждого Тема Из ТаблицаТем Цикл
						Если Тема.ДатаСоздания = Состояние.ДатаВозвратаИсполнителю Тогда 
							Диалоги_сервер.ЗакрытьТему(Тема.ГУИДТемы);
							Диалоги_сервер.ПометитьТемуКакПрочитанную(Тема.ГУИДТемы, ПользователиКлиент.ТекущийПользователь());
						КонецЕсли;
					КонецЦикла;
					
					НайденныеСтроки = Объект.Состояния.НайтиСтроки(Новый Структура("НомерСтроки", Состояние.НомерСтроки + 1));
					Если НайденныеСтроки.Количество() Тогда 
						НайденныеСтроки[0].НачалоРаботы = ДатаВыполнения;
						НайденныеСтроки[0].ЗавершениеРаботы = Дата("00010101");
						НомерСтрокиСледующейЗадачи = НайденныеСтроки[0].НомерСтроки + 1;
					КонецЕсли;
				КонецЕсли;
				//Евросиб СубботинВ #89527 30.10.2024 Начало
			ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.РеестрПлатежей")
				и ТекущийИсполнитель_Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен") Тогда
				Состояние.СтатусСогласования = ПредопределенноеЗначение("Перечисление.СтатусыСогласования.СогласованоБезЗамечаний");
				//Евросиб СубботинВ #89527 30.10.2024 Конец
				// Евросиб US 114823 TA 116919 Рыбьяков К.А. 03.10.2025 ((
			ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.Заявка") Тогда
				Если ТекущийИсполнитель_Состояние = ПредопределенноеЗначение("Справочник.Состояния.РелизНаВыдачуКТККлиенту")
					И ТекущийИсполнитель_Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Отклонен") Тогда
					НайденныеСтроки = Объект.Состояния.НайтиСтроки(Новый Структура("Состояние", ПредопределенноеЗначение("Справочник.Состояния.БронированиеКТК")));
					Если НайденныеСтроки.Количество() = 1 Тогда 
						НайденныеСтроки[0].Исполнитель = ПредопределенноеЗначение("Справочник.ГруппыПользователей.ГруппаВыдачиКонтейнеровПоЗапросуВРП");
					КонецЕсли;
				КонецЕсли;
				Если ТекущийИсполнитель_Состояние = ПредопределенноеЗначение("Справочник.Состояния.ВводЗапросаНаКТК")
					И ТекущийИсполнитель_Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен") Тогда
					НайденныеСтроки = Объект.Состояния.НайтиСтроки(Новый Структура("Состояние", ПредопределенноеЗначение("Справочник.Состояния.БронированиеКТК")));
					Если НайденныеСтроки.Количество() = 1 Тогда 
						НайденныеСтроки[0].Исполнитель = ПредопределенноеЗначение("Справочник.ГруппыПользователей.ГруппаВыдачиКонтейнеровПоЗапросуВРП");
					КонецЕсли;
					НайденныеСтроки = Объект.Состояния.НайтиСтроки(Новый Структура("Состояние", ПредопределенноеЗначение("Справочник.Состояния.РелизНаВыдачуКТККлиенту")));
					Если НайденныеСтроки.Количество() = 1 Тогда 
						НайденныеСтроки[0].Исполнитель = ПредопределенноеЗначение("Справочник.ГруппыПользователей.ГруппаОформленияРелиза");
					КонецЕсли;
				КонецЕсли;
				// Евросиб Рыбьяков К.А. 03.10.2025 ))
			КонецЕсли;
			// -- ДИТ Сгонник, 21-10-26 №27109
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// ++ ДИТ Сгонник, 21-10-26 №27109
	Если НеобходимоВыполнитьОбработкуПоследующихЗадач Тогда  
		Для каждого Состояние из Объект.Состояния Цикл
			Если Состояние.НомерСтроки = НомерСтрокиСледующейЗадачи Тогда
				Состояние.НачалоРаботы = Дата("00010101");
				Состояние.ЗавершениеРаботы = Дата("00010101");
				НомерСтрокиСледующейЗадачи = Состояние.НомерСтроки + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	// -- ДИТ Сгонник, 21-10-26 №27109
		
КонецПроцедуры

Процедура ТекущийИсполнитель_СтатусОбработкаВыбора(Объект, ТекущийИсполнитель_Состояние, ТекущийИсполнитель_Статус, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель, ВыбранноеЗначение) Экспорт
	//ДИТ Шевченко А.В. 56947 06.09.2022 -начало
	Если ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		Если ТекущийИсполнитель_Состояние = ПредопределенноеЗначение("Справочник.Состояния.КонтрольПоступленияОригиналаДоговора") Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Запрещено менять статус для этой задачи вручную.",,);
			ВыбранноеЗначение = ТекущийИсполнитель_Статус;
		КонецЕсли;
		Если ТекущийИсполнитель_Состояние = ПредопределенноеЗначение("Справочник.Состояния.УказатьОтветственногоЗаСопровождение") И ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен")  Тогда	
			Для Каждого Состояние Из Объект.Состояния Цикл
				Если Состояние.Состояние = ПредопределенноеЗначение("Справочник.Состояния.ЗаполнитьВкладкуКонтактыКлиентаПолеМенеджеры") И НЕ Состояние.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен") Тогда
					// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 01.12.2022
					// Было:
					//Состояние.Исполнитель = Объект.ОтветственныйЗаСопровождение; 
					//Стало: 
					Отбор = Новый Структура;  
					Отбор.Вставить("ЦФО", ПредопределенноеЗначение("Справочник.ЦентрыФинансовойОтветственности.ОсновнойЦФО"));
					Отбор.Вставить("ТипОтветственного",ПредопределенноеЗначение("Перечисление.ТипыОтветственных.ОтветственныйЗаСопровождение"));
					Найдено = Объект.Ответственные.НайтиСтроки(Отбор);
					Если Найдено.Количество() > 0 Тогда 
						//Евросиб СубботинВ #117990 20.01.2026 Начало
						//Состояние.Исполнитель = Найдено[0].Ответственный;						
						Если ТипЗнч(Найдено[0].Ответственный) = Тип("СправочникСсылка.ГруппыПользователей") Тогда
							СоставГруппы = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Найдено[0].Ответственный, "Состав");
							Если СоставГруппы.Количество() > 0 Тогда
								Ответственный = СоставГруппы[0].Пользователь;
							КонецЕсли;
						Иначе				
							Состояние.Исполнитель = Найдено[0].Ответственный;
						КонецЕсли
						//Евросиб СубботинВ #117990 20.01.2026 Конец
						
					Иначе 
						Состояние.Исполнитель = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка"); 
					КонецЕсли;
					// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 01.12.2022
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;
		Если ТекущийИсполнитель_Состояние = ПредопределенноеЗначение("Справочник.Состояния.УказатьОтветственногоЗаСопровождениеИУчетНСК") И ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен")  Тогда	
			Для Каждого Состояние Из Объект.Состояния Цикл
				Если Состояние.Состояние = ПредопределенноеЗначение("Справочник.Состояния.ЗаполнитьВкладкуКонтактыКлиентаПолеМенеджерыНСК") И НЕ Состояние.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен") Тогда
					// ДИТ US 51951 TA 61497 Евсенкин М.А. Начало: 01.12.2022
					// Было:
					//Состояние.Исполнитель = Объект.ОтветственныйЗаСопровождениеНСК; 
					//Стало: 
					Отбор = Новый Структура;  
					Отбор.Вставить("ЦФО", ПредопределенноеЗначение("Справочник.ЦентрыФинансовойОтветственности.ТерминалНовосибирск"));
                    Отбор.Вставить("ТипОтветственного",ПредопределенноеЗначение("Перечисление.ТипыОтветственных.ОтветственныйЗаСопровождение"));
					Найдено = Объект.Ответственные.НайтиСтроки(Отбор);
					Если Найдено.Количество() > 0 Тогда  
												//Евросиб СубботинВ #117990 20.01.2026 Начало
						//Состояние.Исполнитель = Найдено[0].Ответственный;						
						Если ТипЗнч(Найдено[0].Ответственный) = Тип("СправочникСсылка.ГруппыПользователей") Тогда
							СоставГруппы = ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта(Найдено[0].Ответственный, "Состав");
							Если СоставГруппы.Количество() > 0 Тогда
								Ответственный = СоставГруппы[0].Пользователь;
							КонецЕсли;
						Иначе				
							Состояние.Исполнитель = Найдено[0].Ответственный;
						КонецЕсли
						//Евросиб СубботинВ #117990 20.01.2026 Конец  
					Иначе 
						Состояние.Исполнитель = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка"); 
					КонецЕсли;
					// ДИТ US 51951 TA 61497 Евсенкин М.А. Конец: 01.12.2022	
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;	
	//ДИТ Шевченко А.В. 56947 06.09.2022 -конец
	
	//ДИТ Шевченко А.В. 59965 28.11.22 начало	
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ЗапросНаАвтоперевозку") Тогда
		Если ТекущийИсполнитель_Состояние = ПредопределенноеЗначение("Справочник.Состояния.ПередатьКлиентуДанныеПоАвтоперевозке") И ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен")  Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Выполнение задачи происходит автоматически после отправки печатной формы запроса на автоперевозку по эл. почте для КТК Клиента. Ручное выполнение задачи невозможно. Если отправка данных на клиенту на данном этапе не требуется, необходимо установить статус Отклонено.",,);
			ВыбранноеЗначение = ТекущийИсполнитель_Статус;
		КонецЕсли; 
		// ДИТ  Сержантова А.С. US 81881 ТА 83783 Начало: 19.04.2024
		Если ТекущийИсполнитель_Состояние = ПредопределенноеЗначение("Справочник.Состояния.ОтменаРейсаАктуализироватьТерминал") И ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.СтатусыЭтапов.Выполнен")  Тогда
			ТекущийИсполнитель_СтатусПриИзменении(Объект, ТекущийИсполнитель_Состояние, ВыбранноеЗначение, ТекущийИсполнитель_Исполнитель, ТекущийИсполнитель_Наблюдатель);
		КонецЕсли;
		// ДИТ  Сержантова А.С. US 81881 ТА 83783 Конец: 19.04.2024
	КонецЕсли;
	//ДИТ Шевченко А.В. 59965 28.11.22 конец
КонецПроцедуры

Процедура ОбработчикНажатияНаПлиткуОбщий(П1 = неопределено, П2 = неопределено) Экспорт
	
	ОпОп = Новый ОписаниеОповещения("ПустойОбработчик", МаршрутизацияКлиент);
	ПоказатьВводСтроки(ОпОп,П1.Заголовок,"Полный текст состояния",,Истина);
	
КонецПроцедуры

Процедура ПустойОбработчик(П1 = неопределено, П2 = неопределено) Экспорт
КонецПроцедуры

//Евросиб Каблов 20.01.2022 62514
Процедура ВыполнитьПовторнуюМаршрутизациюОбъектаПоСсылке(Ссылка, ФормаОбъекта) Экспорт
	
	ТипОбъекта = ТипЗнч(Ссылка);
	
	Если ТипОбъекта = Тип("ДокументСсылка.ПСЦ") Тогда
		СтруктураРезультата = МаршрутизацияСервер.НайтиГотовыеКВыставлениюСтрокиВСделкахПоПСЦ(Ссылка);
		Если СтруктураРезультата.МассивСделокВыставленныеДокументы.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По данному протоколу существуют сделки с сформированными документами.
															|"+СтрСоединить(СтруктураРезультата.МассивСделокВыставленныеДокументы,Символы.ПС)+"
															|Повторная маршрутизация невозможна.");
			Возврат;
		КонецЕсли;
		
		Если СтруктураРезультата.МассивСделокГотовоКВыставлению.Количество() > 0 Тогда
			СтруктураРезультата.Вставить("Ссылка", Ссылка);
			СтруктураРезультата.Вставить("ФормаОбъекта", ФормаОбъекта);
			ОпОп = Новый ОписаниеОповещения("ОбработкаПодтвержденияСнятияПризнакаГотовыКВыставлению", МаршрутизацияКлиент, СтруктураРезультата);
			ПоказатьВопрос(ОпОп, "Будет выполнена повторная маршрутизация.
								|Есть строки в сделках, которые готовы к выставлению:
								|"+СтрСоединить(СтруктураРезультата.МассивСделокГотовоКВыставлению,Символы.ПС)+"
								|Признак будет снят автоматически.
								|Продолжить?", РежимДиалогаВопрос.ДаНет);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Евросиб US 89887 TA 89889 Рыбьяков К.А. 18.11.2024 ((
	Если ТипОбъекта = Тип("ДокументСсылка.ПСЦПоставщика") Тогда
		ЕстьПроведенныеРелизы = ОбщегоНазначенияВызовСервера.НаОснованииДокументаСозданыРелизы(Ссылка);
		Если ЕстьПроведенныеРелизы Тогда
			ТекстСообщения = НСтр("ru = 'К ПСЦ есть Релиз собственника, требуется отменить его проведение.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	// Евросиб Рыбьяков К.А. 18.11.2024 ))
	
	ПродолжитьВыполнениеПовторнойМаршрутизации(Ссылка, ФормаОбъекта);
	
КонецПроцедуры

//Евросиб Каблов 20.01.2022 62514
Процедура ОбработкаПодтвержденияСнятияПризнакаГотовыКВыставлению(ОтветПользователя, ДополнительныеПараметры) Экспорт
	
	Если ОтветПользователя <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("АдресТаблицыСделокПоПСЦДляОбработки", ДополнительныеПараметры.АдресТаблицыСделокДляОбработки);
	
	ПродолжитьВыполнениеПовторнойМаршрутизации(ДополнительныеПараметры.Ссылка, ДополнительныеПараметры.ФормаОбъекта, СтруктураПараметров);
	
КонецПроцедуры

//Евросиб Каблов 20.01.2022 62514
Процедура ПродолжитьВыполнениеПовторнойМаршрутизации(Ссылка, ФормаОбъекта, ДополнительныеПараметры = Неопределено)
	
	Результат = МаршрутизацияСервер.ВыполнитьПовторнуюМаршрутизациюОбъектаПоСсылке(Ссылка, ДополнительныеПараметры);
	
	Если Результат.Выполнено Тогда
		
		//Если команда вызвана из формы объекта, то её нужно перечитать, а если из формы списка, то обновить список
		СтруктураДляПроверки = Новый Структура("Объект");
		ЗаполнитьЗначенияСвойств(СтруктураДляПроверки, ФормаОбъекта);
		Если СтруктураДляПроверки.Объект <> Неопределено Тогда
			ФормаОбъекта.Прочитать();
		Иначе
			СтруктураДляПроверки = Новый Структура("Список");
			ЗаполнитьЗначенияСвойств(СтруктураДляПроверки, ФормаОбъекта.Элементы);
			Если СтруктураДляПроверки.Список <> Неопределено Тогда
				ФормаОбъекта.Элементы.Список.Обновить();
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		РезультатЗапроса = Неопределено;
		Результат.Свойство("РезультатЗапроса", РезультатЗапроса);
		СостоянияДляУказанияИсполнителей = Неопределено;
		Если Результат.Свойство("СостоянияДляУказанияИсполнителей", СостоянияДляУказанияИсполнителей) Тогда
			
			ОбработкаУказанияОтветственных = Новый ОписаниеОповещения("ОбработкаУказанияОтветственных", МаршрутизацияКлиент, Новый Структура("РезультатЗапроса, Ссылка, ФормаОбъекта, ДополнительныеПараметры", РезультатЗапроса, Ссылка, ФормаОбъекта, ДополнительныеПараметры));
			ПараметрыОтбора = Новый СТруктура;
			ПараметрыОтбора.Вставить("ВыбраннаяМаршрутизация", СостоянияДляУказанияИсполнителей);
			ОткрытьФорму("Справочник.Маршрутизация.Форма.ФормаЗаполненияСостояний",ПараметрыОтбора,, Ссылка,,, ОбработкаУказанияОтветственных, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Каблов 20.01.2022 62514
Процедура ОбработкаУказанияОтветственных(Ответственные, Параметры) Экспорт
	
	Если Ответственные = неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокОтветственных = Новый СписокЗначений;
	СписокОтветственных.ЗагрузитьЗначения(Ответственные);
	МаршрутизацияСервер.ПрименитьМаршрутИЗаписатьОбъект(Параметры.Ссылка, Параметры.РезультатЗапроса, СписокОтветственных, Параметры.ДополнительныеПараметры);
	
	//Если команда вызвана из формы объекта, то её нужно перечитать, а если из формы списка, то обновить список
	ФормаОбъекта = Параметры.ФормаОбъекта;
	СтруктураДляПроверки = Новый Структура("Объект");
	ЗаполнитьЗначенияСвойств(СтруктураДляПроверки, ФормаОбъекта);
	Если СтруктураДляПроверки.Объект <> Неопределено Тогда
		ФормаОбъекта.Прочитать();
	Иначе
		СтруктураДляПроверки = Новый Структура("Список");
		ЗаполнитьЗначенияСвойств(СтруктураДляПроверки, ФормаОбъекта.Элементы);
		Если СтруктураДляПроверки.Список <> Неопределено Тогда
			ФормаОбъекта.Элементы.Список.Обновить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
