
// Евросиб US 114211 TA 118161 Рыбьяков К.А. 31.08.2025 ((
Функция ОтразитьДвиженияПоЗакрывающимДокументам(ДокументОбъект, Движения) Экспорт
	
	Если Движения = Неопределено Тогда
		НаборЗаписей = РегистрыСведений.ЗакрывающиеДокументыПоКлючамСоставаПоезда.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ДокументОбъект.Ссылка);
	Иначе
		НаборЗаписей = Движения;
		НаборЗаписей.Очистить();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасшифровкаУслугПоТС.КлючАналитикиСоставаПоезда КАК КлючАналитикиСоставаПоезда,
	|	РасшифровкаУслугПоТС.Ссылка КАК Документ,
	|	УслугиТовары.ВидЗадолженности КАК ВидЗадолженности
	|ИЗ
	|	&НаименованиеДокумента КАК РасшифровкаУслугПоТС
	|		ЛЕВОЕ СОЕДИНЕНИЕ &НаименованиеТаблицыДокумента КАК УслугиТовары
	|		ПО РасшифровкаУслугПоТС.Ссылка = УслугиТовары.Ссылка
	|ГДЕ
	|	РасшифровкаУслугПоТС.Ссылка = &Ссылка";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&НаименованиеДокумента", "Документ." + ДокументОбъект.Метаданные().Имя + ".РасшифровкаУслугПоТС");
	
	Если ДокументОбъект.Метаданные().Имя = "ОтчетКомитентуОПродажах" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&НаименованиеТаблицыДокумента", "Документ." + ДокументОбъект.Метаданные().Имя + ".Товары");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&НаименованиеТаблицыДокумента", "Документ." + ДокументОбъект.Метаданные().Имя + ".Услуги");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
	ТаблицаВыгрузка = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписей.Загрузить(ТаблицаВыгрузка);
	НаборЗаписей.Записать();
	
КонецФункции // Евросиб Рыбьяков К.А. 31.08.2025 ))