
&НаКлиенте
Процедура КлиентыТЗПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекД = Элементы.КлиентыТЗ.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока И ЗначениеЗаполнено(ТекД.Клиент) Тогда
		ЗаполнитьТаблицуРеквизитами(ТекД.Клиент);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуРеквизитами(ТекКлиент)
	// 1. Вагоны
	ИзмеренияРС = Метаданные.РегистрыСведений.ДислокацияВагонов.Измерения;
	РесурсыРС = Метаданные.РегистрыСведений.ДислокацияВагонов.Ресурсы;
	РеквизитыРС = Метаданные.РегистрыСведений.ДислокацияВагонов.Реквизиты;
	Для Каждого Изм Из ИзмеренияРС Цикл
		НовСтр = Объект.РеквизитыВагонов.Добавить();
		НовСтр.РеквизитКлиентаВСистеме = Изм.Имя;
		НовСтр.РеквизитКлиента = Изм.Синоним;
		НовСтр.Клиент = ТекКлиент;
	КонецЦикла;
	Для Каждого Рес Из РесурсыРС Цикл
		НовСтр = Объект.РеквизитыВагонов.Добавить();
		НовСтр.РеквизитКлиентаВСистеме = Рес.Имя;
		НовСтр.РеквизитКлиента = Рес.Синоним;
		НовСтр.Клиент = ТекКлиент;
	КонецЦикла;
	Для Каждого Рек Из РеквизитыРС Цикл
		НовСтр = Объект.РеквизитыВагонов.Добавить();
		НовСтр.РеквизитКлиентаВСистеме = Рек.Имя;
		НовСтр.РеквизитКлиента = Рек.Синоним;
		НовСтр.Клиент = ТекКлиент;
	КонецЦикла;
	
	// 2. Контейнеры
	ИзмеренияРС = Метаданные.РегистрыСведений.ДислокацияКонтейнеров.Измерения;
	РесурсыРС = Метаданные.РегистрыСведений.ДислокацияКонтейнеров.Ресурсы;
	РеквизитыРС = Метаданные.РегистрыСведений.ДислокацияКонтейнеров.Реквизиты;
	Для Каждого Изм Из ИзмеренияРС Цикл
		НовСтр = Объект.РеквизитыКТК.Добавить();
		НовСтр.РеквизитКлиентаВСистеме = Изм.Имя;
		НовСтр.РеквизитКлиента = Изм.Синоним;
		НовСтр.Клиент = ТекКлиент;
	КонецЦикла;
	Для Каждого Рес Из РесурсыРС Цикл
		НовСтр = Объект.РеквизитыКТК.Добавить();
		НовСтр.РеквизитКлиентаВСистеме = Рес.Имя;
		НовСтр.РеквизитКлиента = Рес.Синоним;
		НовСтр.Клиент = ТекКлиент;
	КонецЦикла;
	Для Каждого Рек Из РеквизитыРС Цикл
		НовСтр = Объект.РеквизитыКТК.Добавить();
		НовСтр.РеквизитКлиентаВСистеме = Рек.Имя;
		НовСтр.РеквизитКлиента = Рек.Синоним;
		НовСтр.Клиент = ТекКлиент;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Если Элементы.Группа1.ТекущаяСтраница.Имя = "ГруппаВагоны" Тогда
		Для Каждого Стр Из Объект.РеквизитыВагонов Цикл
			Стр.Использование = Истина;
		КонецЦикла;
	Иначе
		Для Каждого Стр Из Объект.РеквизитыКТК Цикл
			Стр.Использование = Истина;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметки(Команда)
	Если Элементы.Группа1.ТекущаяСтраница.Имя = "ГруппаВагоны" Тогда
		Для Каждого Стр Из Объект.РеквизитыВагонов Цикл
			Стр.Использование = Ложь;
		КонецЦикла;
	Иначе
		Для Каждого Стр Из Объект.РеквизитыКТК Цикл
			Стр.Использование = Ложь;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КлиентыТЗПриАктивизацииСтроки(Элемент)
	
	ТекД = Элементы.КлиентыТЗ.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Элементы.РеквизитыВагонов.ОтборСтрок = Новый ФиксированнаяСтруктура("Клиент",ТекД.Клиент);
	Элементы.РеквизитыКТК.ОтборСтрок = Новый ФиксированнаяСтруктура("Клиент",ТекД.Клиент);
	ПоследнийВыбранныйКонтрагент = ТекД.Клиент;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.Наименование = "" + Объект.Организация + " с " + Формат(Объект.ДатаНачала,"ДЛФ=Д") + " по " + Формат(Объект.ДатаОкончания,"ДЛФ=Д");
	
	// проверка на пересечение дат. Надо ли??
	ПроверитьПересечениеДат();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьПересечениеДат()
	//Запрос = Новый Запрос;
	//Запрос = ""
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьТест(Команда)
	ВыполнитьРассылкуСервер();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьРассылкуСервер()
	РассылкаДислокации.РассылкаДислокацииКлиентам();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	РассылкаДислокацийРеквизитыВагонов.Клиент КАК Клиент
	               |ИЗ
	               |	Справочник.РассылкаДислокаций.РеквизитыВагонов КАК РассылкаДислокацийРеквизитыВагонов
	               |ГДЕ
	               |	РассылкаДислокацийРеквизитыВагонов.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	ТЗ = Запрос.Выполнить().Выгрузить();
	КлиентыТЗ.Загрузить(ТЗ);
	
	
	//Евросиб Коханенко Н.А. #61705 08.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 08.12.2022 )

КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )



&НаКлиенте
Процедура КлиентыТЗПередУдалением(Элемент, Отказ)
	
	ТекД = Элементы.КлиентыТЗ.ТекущиеДанные;
	Если ТекД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Клиент",ТекД.Клиент);
	НайденныеСтроки = Объект.РеквизитыВагонов.НайтиСтроки(ПараметрыОтбора);
	Для Каждого Элем Из НайденныеСтроки Цикл
		Объект.РеквизитыВагонов.Удалить(Элем);
	КонецЦикла;
	НайденныеСтроки2 = Объект.РеквизитыКТК.НайтиСтроки(ПараметрыОтбора);
	Для Каждого Элем2 Из НайденныеСтроки2 Цикл
		Объект.РеквизитыКТК.Удалить(Элем2);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентыТЗКлиентПриИзменении(Элемент)
	
	// SIV - отработка кейса изменения контрагента в сохраненных данных;
	
	ТекД = Элементы.КлиентыТЗ.ТекущиеДанные;
	Если ТекД = неопределено Тогда Возврат; КонецЕсли;
	
	Для каждого Стр из Объект.РеквизитыВагонов Цикл
		Если Стр.Клиент = ПоследнийВыбранныйКонтрагент Тогда Стр.Клиент = ТекД.Клиент; КонецЕсли;
	КонецЦикла;
	Для каждого Стр из Объект.РеквизитыКТК Цикл
		Если Стр.Клиент = ПоследнийВыбранныйКонтрагент Тогда Стр.Клиент = ТекД.Клиент; КонецЕсли;
	КонецЦикла;
	
	ПоследнийВыбранныйКонтрагент = ТекД.Клиент;
	КлиентыТЗПриАктивизацииСтроки(неопределено);
	
КонецПроцедуры
