
&НаКлиенте
Процедура ОткрытьАРМ(Команда)
	
	ОткрытьФорму("ОбщаяФорма.АРМ_УправлениеВагоннымПарком");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОтчетовНаименованиеОтчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ОкончаниеВыбораОтчета", ЭтаФорма);
	ОткрытьФорму("Справочник.ОтчетыВ_АРМах.Форма.ФормаВыбораОтчетов",,, ЭтаФорма,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеВыбораОтчета(Результат = Неопределено, Параметр2 = Неопределено) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		// Можно сделать проверку на уникальность отчетов
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("НаименованиеОтчетаВСистеме",Результат.НаименованиеОтчетаВСистеме);
		НайденныеСтроки = Объект.СписокОтчетов.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество()>0 Тогда
			Сообщить("Данный отчет уже выбран!");
		Иначе
			ТекДанные = Элементы.СписокОтчетов.ТекущиеДанные;
			ЗаполнитьЗначенияСвойств(ТекДанные,Результат);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Процедура НаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ОкончаниеВыбораАРМа", ЭтаФорма);
	ОткрытьФорму("Справочник.ОтчетыВ_АРМах.Форма.ФормаВыбораАРМов",,, ЭтаФорма,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеВыбораАРМа(Результат = Неопределено, Параметр2 = Неопределено) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Объект.Наименование = Результат.НаименованиеАРМа;
		Объект.НаименованиеАРМаВСистеме = Результат.НаименованиеАРМаВСистеме;
		
	КонецЕсли;
	
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
КонецПроцедуры
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

//Евросиб Коханенко Н.А. #61705 08.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 08.12.2022 )

