//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, начало
Функция ЗафиксироватьЗапросОтчета(НастройкаОтчетаПоЗапросу, ПараметрыОтчета, XMLParams) Экспорт
	
	ТокенПолученияОтчета = Новый УникальныйИдентификатор;
	
	МенеджерЗаписи = РегистрыСведений.ОчередьФормированияОтчетовПоЗапросу.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Токен = ТокенПолученияОтчета;
	МенеджерЗаписи.НастройкаОтчетаПоЗапросу = НастройкаОтчетаПоЗапросу;
	МенеджерЗаписи.ДатаЗапроса = ТекущаяДата();
	МенеджерЗаписи.ПараметрыОтчета = ОбщегоНазначения.ЗначениеВСтрокуXML(ПараметрыОтчета);
	МенеджерЗаписи.ВходящийЗапрос = XMLParams;
	МенеджерЗаписи.Записать();
	
	Возврат ТокенПолученияОтчета;
	
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, начало
Процедура ЗафиксироватьФормированиеОтчета(Токен, НастройкаОтчетаПоЗапросу, СтрокаXML) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОчередьФормированияОтчетовПоЗапросу.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Токен = Токен;
	МенеджерЗаписи.НастройкаОтчетаПоЗапросу = НастройкаОтчетаПоЗапросу;
	
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.Сформирован = Истина;
	МенеджерЗаписи.ДатаФормирования = ТекущаяДата();

	ВремяХраненияОтчетаВЧасах = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаОтчетаПоЗапросу, "ВремяХраненияОтчетаВЧасах");
	ВремяХраненияОтчетаВЧасах = ?(ВремяХраненияОтчетаВЧасах = 0, 4, ВремяХраненияОтчетаВЧасах);
	МенеджерЗаписи.ДатаХраненияРезультата = МенеджерЗаписи.ДатаФормирования + ВремяХраненияОтчетаВЧасах * 3600;
	
	МенеджерЗаписи.РезультатФормирования = Новый ХранилищеЗначения(СтрокаXML);
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, начало
Процедура ЗафиксироватьОтправкуОтчета(Токен, НастройкаОтчетаПоЗапросу) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОчередьФормированияОтчетовПоЗапросу.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Токен = Токен;
	МенеджерЗаписи.НастройкаОтчетаПоЗапросу = НастройкаОтчетаПоЗапросу;
	
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.Отправлен = Истина;
	МенеджерЗаписи.ДатаОтправления = ТекущаяДата();
	МенеджерЗаписи.Записать();
	
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, конец

//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, начало
Процедура ЗафиксироватьОшибкуФомирования(Токен, НастройкаОтчетаПоЗапросу, ТекстОшибки) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОчередьФормированияОтчетовПоЗапросу.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Токен = Токен;
	МенеджерЗаписи.НастройкаОтчетаПоЗапросу = НастройкаОтчетаПоЗапросу;
	
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.ОшибкаПриФормировании = Истина;
	МенеджерЗаписи.ТекстОшибки = ТекстОшибки;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры
//Евросиб(ДИТ), Беляев СЮ, US 84787 / TA 93129, 24-10-2024, конец
