
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивПредметов = Новый Массив;
	Для каждого Стр из Параметры.МассивЗаявок Цикл
		МассивПредметов.Добавить(Стр.ПСЦ);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПредметТСх", МассивПредметов);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТехнологическаяСхема.ПредметТСх КАК ПредметТСх,
	               |	ТехнологическаяСхема.Вариант КАК Вариант,
	               |	ТехнологическаяСхема.ТСх КАК ТСх
	               |ИЗ
	               |	РегистрСведений.ТехнологическаяСхема КАК ТехнологическаяСхема
	               |ГДЕ
	               |	ТехнологическаяСхема.ПредметТСх В(&ПредметТСх)";
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		НСтр = ТЧ.Добавить();
		НСтр.Вариант = Ответ.Вариант;
		НСтр.Пометка = Истина;
		НСтр.Протокол = Ответ.ПредметТСх;
		НСтр.ТСхСсылка = Ответ.ТСх;
		
		// разбор строки Вариант. берем последнее значение после "_" и это будет калькуляция. из нее возьмем станции отпр и назначения ЖД
		МассивСтрок = СтрРазделить(Ответ.Вариант,"_",Истина);
		КолвоСтр = МассивСтрок.Количество();
		Если КолвоСтр>0 Тогда
			ПоследняяКалькуляция = МассивСтрок[КолвоСтр-1];
			ПолучОб = Документы.Калькуляция.НайтиПоНомеру(ПоследняяКалькуляция);
			Если НЕ ПолучОб.Пустая() Тогда
				НСтр.СтанцияОтправления = ПолучОб.Суша_ПунктОтправления;
				НСтр.СтанцияНазначения = ПолучОб.Суша_ПунктНазначения;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	

	//Евросиб Коханенко Н.А. #61705 09.12.2022 (
	ИнструкцииСервер.ДобавитьКнопкуИнструкции(ЭтаФорма);
	//Евросиб Коханенко Н.А. #61705 09.12.2022 )
КонецПроцедуры

//Евросиб Коханенко Н.А. #61705 09.12.2022 (
&НаКлиенте
Процедура ОткрытьОкноСИнструкциями(Форма, Команда)
	ИнструкцииКлиент.ОткрытьОкноСИнструкциями(ЭтаФорма, Команда);
КонецПроцедуры  
//Евросиб Коханенко Н.А. #61705 09.12.2022 )


&НаКлиенте
Процедура ПеренестиВСделку(Команда)
	
	Результат = Новый Массив;
	Для каждого Стр из ТЧ Цикл
		Если Стр.Пометка Тогда 
			Результат.Добавить(Новый Структура("Вариант, ТСх, ПредметТСх", Стр.Вариант, Стр.ТСхСсылка, Стр.Протокол)); 
		КонецЕсли;
	КонецЦикла;
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсё(Команда)
	
	Для каждого Строка Из ТЧ Цикл
		Строка.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсё(Команда)

	Для каждого Строка Из ТЧ Цикл
		Строка.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры
