
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ДИТ, Беляев СЮ, Ticket#0330268, 14-11-2023, начало
	ФлагВидимостиТиповОтветственных = Ложь;
	//ДИТ, Беляев СЮ, Ticket#0330268, 14-11-2023, конец
	
	Договор = Неопределено;
	Если Параметры.Свойство("Договор", Договор) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Договор", Договор);
		//ДИТ, Беляев СЮ, Ticket#0330268, 14-11-2023, начало
		ФлагВидимостиТиповОтветственных = Истина;
		//ДИТ, Беляев СЮ, Ticket#0330268, 14-11-2023, конец
	КонецЕсли;
	
	//ДИТ, Беляев СЮ, Ticket#0330268, 14-11-2023, начало	
	УправлениеВидимостьюИДоступностью(ФлагВидимостиТиповОтветственных);
	//ДИТ, Беляев СЮ, Ticket#0330268, 14-11-2023, конец
КонецПроцедуры

//ДИТ, Беляев СЮ, Ticket#0330268, 14-11-2023, начало
&НаСервере
Процедура УправлениеВидимостьюИДоступностью(ФлагВидимостиТиповОтветственных);
	Элементы.ТипОтветственного.Видимость = ФлагВидимостиТиповОтветственных;
	Если ФлагВидимостиТиповОтветственных Тогда
		ТипОтветственного = Перечисления.ТипыОтветственныхПДЗ.Менеджер;
		ТипОтветственногоПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры
//ДИТ, Беляев СЮ, Ticket#0330268, 14-11-2023, конец

//ДИТ, Беляев СЮ, Ticket#0330268, 14-11-2023, начало
&НаСервере
Процедура ТипОтветственногоПриИзмененииНаСервере()
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ТипОтветственногоПДЗ", ТипОтветственного);
КонецПроцедуры
//ДИТ, Беляев СЮ, Ticket#0330268, 14-11-2023, конец

//ДИТ, Беляев СЮ, Ticket#0330268, 14-11-2023, начало
&НаКлиенте
Процедура ТипОтветственногоПриИзменении(Элемент)
	ТипОтветственногоПриИзмененииНаСервере();
КонецПроцедуры
//ДИТ, Беляев СЮ, Ticket#0330268, 14-11-2023, конец
