Функция ПолучитьВсеДоговорыКонтрагента(Контрагент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Договоры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК Договоры
	               |ГДЕ
	               |	Договоры.Владелец = &Владелец
	               |	И НЕ Договоры.ПометкаУдаления";
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ПолучитьДоговорКонтрагента(Контрагент, НомерДоговора) Экспорт
	
	Результат = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Договоры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК Договоры
	               |ГДЕ
	               |	Договоры.Владелец = &Владелец
	               |	И НЕ Договоры.ПометкаУдаления
	               |	И Договоры.Номер = &Номер
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Договоры.Дата УБЫВ";
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	Запрос.УстановитьПараметр("Номер", НомерДоговора);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДействующиеДоговорыКонтрагента(Контрагент, Знач ИскомаяДата = неопределено, ТолькоДоговорыПокупателя = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИскомаяДата) Тогда
		ИскомаяДата = ТекущаяДата();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Договоры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК Договоры
	               |ГДЕ
	               |	Договоры.Владелец = &Владелец
	               |	И НЕ Договоры.ПометкаУдаления
	               |	И &ИскомаяДата МЕЖДУ Договоры.Дата И Договоры.СрокДействия
	               |	И ВЫБОР
	               |			КОГДА &ТолькоДоговорыПокупателей
	               |				ТОГДА Договоры.ВидДоговора = &СПокупателем
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	Запрос.УстановитьПараметр("ИскомаяДата", ИскомаяДата);
	Запрос.УстановитьПараметр("ТолькоДоговорыПокупателей", ТолькоДоговорыПокупателя);
	Запрос.УстановитьПараметр("СПокупателем", Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");	
	
КонецФункции

Функция ПолучитьВалютуДоговора(Договор, Знач ДатаДокумента = неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда ДатаДокумента = ТекущаяДата(); КонецЕсли;
	
	РезультатВалюта = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Договор.ВалютаВзаиморасчетов, ДатаДокумента);
	КратностьВзаиморасчетов = РезультатВалюта.Кратность;
	КурсВзаиморасчетов = РезультатВалюта.Курс;
	
	Возврат Новый Структура("Валюта, Курс, Кратность", Договор.ВалютаВзаиморасчетов, КурсВзаиморасчетов, КратностьВзаиморасчетов);
	
КонецФункции

Функция НайтиКонтрагентаПоНечеткомуУсловию(Условие) Экспорт
	
	Если Условие = "" Тогда Возврат неопределено; КОнецЕсли;
	
	Результат = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	КонтрагентыСинонимыДляПоиска.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты.СинонимыДляПоиска КАК КонтрагентыСинонимыДляПоиска
	               |ГДЕ
	               |	КонтрагентыСинонимыДляПоиска.СинонимКонтрагента = &СинонимКонтрагента
	               |	И НЕ КонтрагентыСинонимыДляПоиска.Ссылка.ПометкаУдаления";
	Запрос.УстановитьПараметр("СинонимКонтрагента", Условие);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Евросиб US 90342 Рыбьяков К.А. 03.03.2026 ((
Функция НайтиКонтрагентаПоШаблону(Наименование) Экспорт
	
	Если Наименование = "" Тогда 
		Возврат Неопределено; 
	КонецЕсли;
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтрагентыСинонимыДляПоиска.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты.СинонимыДляПоиска КАК КонтрагентыСинонимыДляПоиска
	|ГДЕ
	|	(КонтрагентыСинонимыДляПоиска.СинонимКонтрагента ПОДОБНО &Шаблон
	|			ИЛИ ВЫРАЗИТЬ(КонтрагентыСинонимыДляПоиска.Ссылка.Наименование КАК СТРОКА(1000)) ПОДОБНО &Шаблон
	|				И НЕ КонтрагентыСинонимыДляПоиска.Ссылка.ПометкаУдаления)";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Шаблон", "%" + ОбщегоНазначения.СформироватьСтрокуДляПоискаВЗапросе(Наименование) + "%");
	
	Ответ = Запрос.Выполнить().Выбрать();
	
	Если Ответ.Следующий() Тогда
		Результат = Ответ.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // Евросиб Рыбьяков К.А. 03.03.2026 ))

Функция ДоговорЗарегистрированВБФ(Договор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПротоколОбменов.УИДИсточника КАК УИДИсточника
	               |ИЗ
	               |	РегистрСведений.ПротоколОбменов КАК ПротоколОбменов
	               |ГДЕ
	               |	ПротоколОбменов.Объект = &Объект
	               |	И ПротоколОбменов.УзелОбмена = &УзелОбмена";
	Запрос.УстановитьПараметр("Объект", Договор);
	Запрос.УстановитьПараметр("УзелОбмена", Перечисления.УзлыОбмена.БитФинанс);
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Процедура ПроверкаПроведенияДоговораВБФПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	ВыбранныйДоговор = неопределено;
	Попытка
		ВыбранныйДоговор = Источник.Договор;
	Исключение
		Возврат;
	КонецПопытки;
	
	Если ЗначениеЗаполнено(ВыбранныйДоговор) И НЕ ДоговорЗарегистрированВБФ(ВыбранныйДоговор) И Не ВыбранныйДоговор.НеПроверятьРегистрациюВБИТФИНАНС Тогда
		
		Отказ = Истина;
		Сообщить("Создавать документы можно только с договором, зарегистрированным в БИТ.Финанс!");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УведомлениеОПролонгацииДоговоров() Экспорт
	
	//ДИТ Шевченко А.В. 63100 20.12.2022 -начало
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	//|	ДоговорыКонтрагентов.СрокДействия КАК СрокДействия,
	//|	ДоговорыКонтрагентов.СрокПредупрежденияАвтопролонгацииДней КАК СрокПредупрежденияАвтопролонгацииДней,
	//|	ДОБАВИТЬКДАТЕ(ДоговорыКонтрагентов.СрокДействия, ДЕНЬ, -ДоговорыКонтрагентов.СрокПредупрежденияАвтопролонгацииДней) КАК Поле1
	//|ИЗ
	//|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	//|ГДЕ
	//|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
	//|	И ДоговорыКонтрагентов.Автопролонгация
	//|	И ДОБАВИТЬКДАТЕ(ДоговорыКонтрагентов.СрокДействия, ДЕНЬ, -ДоговорыКонтрагентов.СрокПредупрежденияАвтопролонгацииДней) <= &ТекущаяДата
	//|	И НЕ ДоговорыКонтрагентов.Ссылка В
	//|				(ВЫБРАТЬ
	//|					ДоговорыКонтрагентовСостояния.Ссылка КАК Ссылка
	//|				ИЗ
	//|					Справочник.ДоговорыКонтрагентов.Состояния КАК ДоговорыКонтрагентовСостояния
	//|				ГДЕ
	//|					ДоговорыКонтрагентовСостояния.Состояние = ЗНАЧЕНИЕ(Справочник.Состояния.НеобходимаПролонгацияДоговора)
	//|					И ДоговорыКонтрагентовСостояния.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтапов.Отклонен))";
	//
	//Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	//Ответ = Запрос.Выполнить().Выбрать();
	//Пока Ответ.Следующий() Цикл
	//	
	//	ДоговорОбъект = Ответ.Ссылка.ПолучитьОбъект();
	//	
	//	НСтр = ДоговорОбъект.Состояния.Добавить();
	//	НСтр.Состояние = Справочники.Состояния.НеобходимаПролонгацияДоговора;
	//	НСтр.Исполнитель = ДоговорОбъект.ОтветственныйЗаДоговор;
	//	НСтр.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
	//	НСтр.НормативИсполненияСМоментаСоздания = 2;
	//	
	//	Попытка
	//		ДоговорОбъект.Записать();
	//	Исключение
	//		// siv 07-05-2020
	//		// договоры бывают полу-пустыми и фоновое задание падало на этом месте
	//		// пока сделаю так.
	//		ЗаписьЖурналаРегистрации("Данные.Изменение",УровеньЖурналаРегистрации.Ошибка,,ДоговорОбъект.Ссылка,"Ошибка записи договора. Регламент УведомлениеОПролонгацииДоговоров");
	//		ВызватьИсключение;
	//	КонецПопытки;
	//КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.Состояния КАК СпрДоговорыКонтрагентов
				   |		ПО ДоговорыКонтрагентов.Ссылка = СпрДоговорыКонтрагентов.Ссылка
				   |			И (СпрДоговорыКонтрагентов.Состояние = ЗНАЧЕНИЕ(Справочник.Состояния.НеобходимаПролонгацияДоговора))
				   |			И (СпрДоговорыКонтрагентов.Статус В (&Статусы))
	               |ГДЕ
	               |	НЕ ДоговорыКонтрагентов.ПометкаУдаления
	               |	И ДоговорыКонтрагентов.Автопролонгация
	               |	И ДОБАВИТЬКДАТЕ(ДоговорыКонтрагентов.СрокДействия, ДЕНЬ, -ДоговорыКонтрагентов.СрокПредупрежденияАвтопролонгацииДней) <= &ТекущаяДата
	               |	И СпрДоговорыКонтрагентов.Ссылка ЕСТЬ NULL";
	
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Перечисления.СтатусыЭтапов.ВРаботе);
	МассивСтатусов.Добавить(Перечисления.СтатусыЭтапов.НаВыполнение);
	МассивСтатусов.Добавить(Перечисления.СтатусыЭтапов.Отклонен);
	МассивСтатусов.Добавить(Перечисления.СтатусыЭтапов.Новый);
	Запрос.УстановитьПараметр("Статусы", МассивСтатусов);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		ДоговорОбъект = Ответ.Ссылка.ПолучитьОбъект();
		СтруктураПоиска = Новый Структура();
		СтруктураПоиска.Вставить("Состояние",Справочники.Состояния.НеобходимаПролонгацияДоговора);
		МассивСтрок = ДоговорОбъект.Состояния.НайтиСтроки(СтруктураПоиска);
		
		Если МассивСтрок.Количество() = 0 Тогда
			НСтр = ДоговорОбъект.Состояния.Добавить();
			НСтр.Состояние = Справочники.Состояния.НеобходимаПролонгацияДоговора;
			НСтр.Исполнитель = ДоговорОбъект.ОтветственныйЗаДоговор;
			НСтр.Наблюдатель = ДоговорОбъект.ОтветственныйЗаДоговор;
			НСтр.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
			НСтр.НормативИсполненияСМоментаСоздания = 2;
		Иначе
			МассивСтрок[0].Исполнитель = ДоговорОбъект.ОтветственныйЗаДоговор;
			МассивСтрок[0].Наблюдатель = ДоговорОбъект.ОтветственныйЗаДоговор;
			МассивСтрок[0].Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
			МассивСтрок[0].НормативИсполненияСМоментаСоздания = 2;
		КонецЕсли;
		
		Попытка
			ДоговорОбъект.Записать();
		Исключение
			ЗаписьЖурналаРегистрации("Данные.Изменение",УровеньЖурналаРегистрации.Ошибка,,ДоговорОбъект.Ссылка,"Ошибка записи договора. Регламент УведомлениеОПролонгацииДоговоров");
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Калькуляция.Договор КАК ДоговорКонтрагента
		|ИЗ
		|	Документ.Калькуляция КАК Калькуляция
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.Состояния КАК СпрДоговорыКонтрагентов
		|		ПО Калькуляция.Договор = СпрДоговорыКонтрагентов.Ссылка
		|			И (СпрДоговорыКонтрагентов.Состояние = ЗНАЧЕНИЕ(Справочник.Состояния.НеобходимаПролонгацияДоговора))
		|			И (СпрДоговорыКонтрагентов.Статус В (&Статусы))
		|ГДЕ
		|	Калькуляция.Проведен
		|	И Калькуляция.Договор.СрокДействия < Калькуляция.Дата
		|	И НЕ Калькуляция.Договор.ПометкаУдаления
		|	И НЕ Калькуляция.Договор.Автопролонгация
		|	И СпрДоговорыКонтрагентов.Ссылка ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РеализацияТоваровУслуг.ДоговорКонтрагента
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.Состояния КАК СпрДоговорыКонтрагентов
		|		ПО РеализацияТоваровУслуг.ДоговорКонтрагента = СпрДоговорыКонтрагентов.Ссылка
		|			И (СпрДоговорыКонтрагентов.Состояние = ЗНАЧЕНИЕ(Справочник.Состояния.НеобходимаПролонгацияДоговора))
		|			И (СпрДоговорыКонтрагентов.Статус В (&Статусы))
		|ГДЕ
		|	РеализацияТоваровУслуг.Проведен
		|	И РеализацияТоваровУслуг.ДоговорКонтрагента.СрокДействия < РеализацияТоваровУслуг.Дата
		|	И НЕ РеализацияТоваровУслуг.ДоговорКонтрагента.ПометкаУдаления
		|	И НЕ РеализацияТоваровУслуг.ДоговорКонтрагента.Автопролонгация
		|	И СпрДоговорыКонтрагентов.Ссылка ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОтчетКомитентуОПродажах.ДоговорКонтрагента
		|ИЗ
		|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.Состояния КАК СпрДоговорыКонтрагентов
		|		ПО ОтчетКомитентуОПродажах.ДоговорКонтрагента = СпрДоговорыКонтрагентов.Ссылка
		|			И (СпрДоговорыКонтрагентов.Состояние = ЗНАЧЕНИЕ(Справочник.Состояния.НеобходимаПролонгацияДоговора))
		|			И (СпрДоговорыКонтрагентов.Статус В (&Статусы))		
		|ГДЕ
		|	ОтчетКомитентуОПродажах.Проведен
		|	И ОтчетКомитентуОПродажах.ДоговорКонтрагента.СрокДействия < ОтчетКомитентуОПродажах.Дата
		|	И НЕ ОтчетКомитентуОПродажах.ДоговорКонтрагента.ПометкаУдаления
		|	И НЕ ОтчетКомитентуОПродажах.ДоговорКонтрагента.Автопролонгация
		|	И СпрДоговорыКонтрагентов.Ссылка ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СчетФактураВыданный.ДоговорКонтрагента
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.Состояния КАК СпрДоговорыКонтрагентов
		|		ПО СчетФактураВыданный.ДоговорКонтрагента = СпрДоговорыКонтрагентов.Ссылка
		|			И (СпрДоговорыКонтрагентов.Состояние = ЗНАЧЕНИЕ(Справочник.Состояния.НеобходимаПролонгацияДоговора))
		|			И (СпрДоговорыКонтрагентов.Статус В (&Статусы))
		|ГДЕ
		|	СчетФактураВыданный.Проведен
		|	И СчетФактураВыданный.ДоговорКонтрагента.СрокДействия < СчетФактураВыданный.Дата
		|	И НЕ СчетФактураВыданный.ДоговорКонтрагента.ПометкаУдаления
		|	И НЕ СчетФактураВыданный.ДоговорКонтрагента.Автопролонгация
		|	И СпрДоговорыКонтрагентов.Ссылка ЕСТЬ NULL";
	
	
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Перечисления.СтатусыЭтапов.ВРаботе);
	МассивСтатусов.Добавить(Перечисления.СтатусыЭтапов.НаВыполнение);
	МассивСтатусов.Добавить(Перечисления.СтатусыЭтапов.Отклонен);
	МассивСтатусов.Добавить(Перечисления.СтатусыЭтапов.Новый);
	Запрос.УстановитьПараметр("Статусы", МассивСтатусов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДоговорОбъект = ВыборкаДетальныеЗаписи.ДоговорКонтрагента.ПолучитьОбъект();
		
		СтруктураПоиска = Новый Структура();
		СтруктураПоиска.Вставить("Состояние",Справочники.Состояния.НеобходимаПролонгацияДоговора);
		МассивСтрок = ДоговорОбъект.Состояния.НайтиСтроки(СтруктураПоиска);
		
		Если МассивСтрок.Количество() = 0 Тогда
			НСтр = ДоговорОбъект.Состояния.Добавить();
			НСтр.Состояние = Справочники.Состояния.НеобходимаПролонгацияДоговора;
			НСтр.Исполнитель = ДоговорОбъект.ОтветственныйЗаДоговор;
			НСтр.Наблюдатель = ДоговорОбъект.ОтветственныйЗаДоговор;
			НСтр.Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
			НСтр.НормативИсполненияСМоментаСоздания = 2;
		Иначе
			МассивСтрок[0].Исполнитель = ДоговорОбъект.ОтветственныйЗаДоговор;
			МассивСтрок[0].Наблюдатель = ДоговорОбъект.ОтветственныйЗаДоговор;
			МассивСтрок[0].Статус = Перечисления.СтатусыЭтапов.НаВыполнение;
			МассивСтрок[0].НормативИсполненияСМоментаСоздания = 2;
		КонецЕсли;
		
		Попытка
			ДоговорОбъект.Записать();
		Исключение
			ЗаписьЖурналаРегистрации("Данные.Изменение",УровеньЖурналаРегистрации.Ошибка,,ДоговорОбъект.Ссылка,"Ошибка записи договора. Регламент УведомлениеОПролонгацииДоговоров");
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
	//ДИТ Шевченко А.В. 63100 20.12.2022 -конец

	// ДИТ 0304081 Евсенкин М.А. Начало: 24.03.2023
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачиСотрудника.Документ КАК Документ,
		|	ЗадачиСотрудника.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.ЗадачиСотрудника КАК ЗадачиСотрудника
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО ЗадачиСотрудника.Документ = ДоговорыКонтрагентов.Ссылка
		|			И (ДоговорыКонтрагентов.СрокДействия >= ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, ДоговорыКонтрагентов.СрокПредупрежденияАвтопролонгацииДней))
		|ГДЕ
		|	ЗадачиСотрудника.Документ ССЫЛКА Справочник.ДоговорыКонтрагентов
		|	И ЗадачиСотрудника.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЭтапов.Новый), ЗНАЧЕНИЕ(Перечисление.СтатусыЭтапов.НаВыполнение), ЗНАЧЕНИЕ(Перечисление.СтатусыЭтапов.ВРаботе))
		|	И ЗадачиСотрудника.Состояние = ЗНАЧЕНИЕ(Справочник.Состояния.НеобходимаПролонгацияДоговора)";
		
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДоговорОбъект = ВыборкаДетальныеЗаписи.Документ.ПолучитьОбъект();
		МассивНайденныхСтрок = ДоговорОбъект.Состояния.НайтиСтроки(Новый Структура("Состояние",Справочники.Состояния.НеобходимаПролонгацияДоговора));
		Для Каждого Стр Из МассивНайденныхСтрок Цикл 
			Стр.Статус = Перечисления.СтатусыЭтапов.Выполнен;
		КонецЦикла;	
		ДоговорОбъект.Записать();	
	КонецЦикла;  
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДоговорОбъект = ВыборкаДетальныеЗаписи.Документ.ПолучитьОбъект();
		МассивНайденныхСтрок = ДоговорОбъект.Состояния.НайтиСтроки(Новый Структура("Состояние",Справочники.Состояния.НеобходимаПролонгацияДоговора));
		Для Каждого Стр Из МассивНайденныхСтрок Цикл 
			ДоговорОбъект.Состояния.Удалить(Стр);
		КонецЦикла;	
		ДоговорОбъект.Записать();	
	КонецЦикла;	

	// ДИТ 0304081 Евсенкин М.А. Конец: 24.03.2023
	
КонецПроцедуры

Процедура ЗанесениеВЧерныйСписокКонтрагентовСЗадолженностью() Экспорт
	
	СрокДляБана = Константы.СрокЗадолженностиДляОтнесенияПокупателяВСтопЛист.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.Контрагент КАК Контрагент,
	               |	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.Договор КАК Договор,
	               |	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю КАК СчетПокупателю,
	               |	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.НеразнесеннаяСуммаОстаток КАК НеразнесеннаяСуммаОстаток,
	               |	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю.ДоговорКонтрагента.СрокОплаты КАК СрокОплаты,
	               |	РАЗНОСТЬДАТ(РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю.ДатаДокумента, &ТекущаяДата, ДЕНЬ) КАК ПрошлоВремени,
	               |	ВЫБОР
	               |		КОГДА РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю.ДоговорКонтрагента.СрокОплаты > РАЗНОСТЬДАТ(РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю.ДатаДокумента, &ТекущаяДата, ДЕНЬ)
	               |			ТОГДА 0
	               |		ИНАЧЕ РАЗНОСТЬДАТ(РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю.ДатаДокумента, &ТекущаяДата, ДЕНЬ) - РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю.ДоговорКонтрагента.СрокОплаты
	               |	КОНЕЦ КАК ПросрочкаПлатежа,
	               |	СтопЛистКонтрагентовСрезПоследних.ВСтопЛисте КАК ВСтопЛисте,
	               |	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.Договор.Номер КАК НомерДоговора
	               |ИЗ
	               |	РегистрНакопления.РазнесениеСчетовПокупателейПоВходящимПлатежам.Остатки КАК РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтопЛистКонтрагентов.СрезПоследних КАК СтопЛистКонтрагентовСрезПоследних
	               |		ПО РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.Контрагент = СтопЛистКонтрагентовСрезПоследних.Контрагент";
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Ответ = Запрос.Выполнить().Выбрать();
	МассивЗаблокированныхКлиентов = Новый Массив;
	СписокПричин = "";
	КоличествоКонтрагентов = 0;
	СписокКонтрагентов = "";
	Пока Ответ.Следующий() Цикл
		Если МассивЗаблокированныхКлиентов.Найти(Ответ.Контрагент) = неопределено И Ответ.ПросрочкаПлатежа > 0 И Ответ.ВСтопЛисте <> Истина Тогда
			
			Причина = "Просрочка оплаты на сумму " + Ответ.НеразнесеннаяСуммаОстаток + " по договору " + Ответ.НомерДоговора + " на дней " + Ответ.ПросрочкаПлатежа;
			
			МЗ = РегистрыСведений.СтопЛистКонтрагентов.СоздатьМенеджерЗаписи();
			МЗ.ВСтопЛисте = Истина;
			МЗ.Комментарий = "Отнесено автоматически при проверке задолженностей " + ТекущаяДата() + " " + Причина;
			МЗ.Пользователь = Пользователи.ТекущийПользователь();
			МЗ.Период = ТекущаяДата();
			МЗ.Контрагент = Ответ.Контрагент;
			МЗ.Записать(Истина);
			
			КоличествоКонтрагентов = КоличествоКонтрагентов + 1;
			СписокКонтрагентов = СписокКонтрагентов + ", " + Ответ.Контрагент;
			СписокПричин = СписокПричин + ", " + Причина;
			МассивЗаблокированныхКлиентов.Добавить(Ответ.Контрагент);
			
		КонецЕсли;
	КонецЦикла;
	
	Сообщить("Заблокировано: " + КоличествоКонтрагентов + " список: " + СписокКонтрагентов + " причины: " + СписокПричин);
	
КонецПроцедуры

Процедура РассчитатьРейтингКлиентов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(ПравилаВычисленияРейтингаКлиента.Ссылка) КАК Ссылка
	|ПОМЕСТИТЬ ВТПравило
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ПравилаВычисленияРейтингаКлиента.ДействуетС) КАК ДействуетС
	|	ИЗ
	|		Справочник.ПравилаВычисленияРейтингаКлиента КАК ПравилаВычисленияРейтингаКлиента
	|	ГДЕ
	|		НЕ ПравилаВычисленияРейтингаКлиента.ПометкаУдаления) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаВычисленияРейтингаКлиента КАК ПравилаВычисленияРейтингаКлиента
	|		ПО ВложенныйЗапрос.ДействуетС = ПравилаВычисленияРейтингаКлиента.ДействуетС
	|ГДЕ
	|	НЕ ПравилаВычисленияРейтингаКлиента.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПравилаВычисленияРейтингаКлиентаПараметрыРейтинга.Ссылка КАК Ссылка,
	|	ПравилаВычисленияРейтингаКлиентаПараметрыРейтинга.ЗеленыйС КАК ЗеленыйС,
	|	ПравилаВычисленияРейтингаКлиентаПараметрыРейтинга.ЗеленыйПо КАК ЗеленыйПо,
	|	ПравилаВычисленияРейтингаКлиентаПараметрыРейтинга.ЖелтыйС КАК ЖелтыйС,
	|	ПравилаВычисленияРейтингаКлиентаПараметрыРейтинга.ЖелтыйПо КАК ЖелтыйПо,
	|	ПравилаВычисленияРейтингаКлиентаПараметрыРейтинга.КрасныйС КАК КрасныйС,
	|	ПравилаВычисленияРейтингаКлиентаПараметрыРейтинга.КрасныйПо КАК КрасныйПо,
	|	ПравилаВычисленияРейтингаКлиентаПараметрыРейтинга.Аналитика КАК Критерий,
	|	ПравилаВычисленияРейтингаКлиентаПараметрыРейтинга.АвтоматическийПереводВСтопЛистВКраснойЗоне КАК АвтоматическийПереводВСтопЛистВКраснойЗоне,
	|	ПравилаВычисленияРейтингаКлиентаПараметрыРейтинга.УведомитьОЖелтойЗоне КАК УведомитьОЖелтойЗоне,
	|	ПравилаВычисленияРейтингаКлиентаПараметрыРейтинга.УведомитьОКраснойЗоне КАК УведомитьОКраснойЗоне
	|ИЗ
	|	ВТПравило КАК ВТПравило
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаВычисленияРейтингаКлиента.ПараметрыРейтинга КАК ПравилаВычисленияРейтингаКлиентаПараметрыРейтинга
	|		ПО ВТПравило.Ссылка = ПравилаВычисленияРейтингаКлиентаПараметрыРейтинга.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Аналитика КАК Критерий,
	|	ВложенныйЗапрос.УровеньРиска КАК УровеньРиска,
	|	ВложенныйЗапрос.Пользователь КАК Пользователь,
	|	ПользователиКонтактнаяИнформация.Представление КАК АдресЭлектроннойПочты
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПравилаВычисленияРейтингаКлиентаПолучателиУведомлений.Аналитика КАК Аналитика,
	|		ПравилаВычисленияРейтингаКлиентаПолучателиУведомлений.УровеньРиска КАК УровеньРиска,
	|		ЕСТЬNULL(ГруппыПользователейСостав.Пользователь, ПравилаВычисленияРейтингаКлиентаПолучателиУведомлений.ПолучательУведомления) КАК Пользователь
	|	ИЗ
	|		ВТПравило КАК ВТПравило
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаВычисленияРейтингаКлиента.ПолучателиУведомлений КАК ПравилаВычисленияРейтингаКлиентаПолучателиУведомлений
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	|				ПО ПравилаВычисленияРейтингаКлиентаПолучателиУведомлений.ПолучательУведомления = ГруппыПользователейСостав.Ссылка
	|			ПО ВТПравило.Ссылка = ПравилаВычисленияРейтингаКлиентаПолучателиУведомлений.Ссылка) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|		ПО ВложенныйЗапрос.Пользователь = ПользователиКонтактнаяИнформация.Ссылка
	|			И (ПользователиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПользователя))";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ТаблицаПравил = РезультатыЗапроса[1].Выгрузить();
	ТаблицаПолучателейУведомлений = РезультатыЗапроса[2].Выгрузить();
	
	ТаблицаКонтрагентовДляСтопЛиста = Новый ТаблицаЗначений;
	ТаблицаКонтрагентовДляСтопЛиста.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаКонтрагентовДляСтопЛиста.Колонки.Добавить("НаименованиеКонтрагента", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная)));
	ТаблицаКонтрагентовДляСтопЛиста.Колонки.Добавить("ПоместитьВСтопЛист", Новый ОписаниеТипов("Булево"));
	ТаблицаКонтрагентовДляСтопЛиста.Колонки.Добавить("Комментарий", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная)));
	
	УровеньРискаСредний = Перечисления.СПАРКЗначенияРисков.Средний;
	УровеньРискаВысокий = Перечисления.СПАРКЗначенияРисков.Высокий;
	
	ТекДата = ТекущаяДатаСеанса();
	
	ПараметрыКурсаРегл = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Константы.ВалютаРегламентированногоУчета.Получить(), ТекДата);
	
	//1. Сумма дебиторской задолженности
	
	Критерий = Перечисления.АналитикиРейтингаКлиентов.СуммаДебиторскойЗадолженности;
	Правило = ТаблицаПравил.Найти(Критерий, "Критерий");
	
	Если Правило <> Неопределено Тогда
	
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущаяДата", ТекДата);
		Запрос.УстановитьПараметр("Критерий", Критерий);
		Запрос.УстановитьПараметр("ПределНизкогоУровняРиска", Правило.ЗеленыйПо);
		Запрос.УстановитьПараметр("ПределСреднегоУровняРиска", Правило.ЖелтыйПо);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаиморасчетыСПокупателямиОстатки.Контрагент КАК Контрагент,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ВзаиморасчетыСПокупателямиОстатки.Договор.ЛимитДебиторскойЗадолженности <> 0
		|				ТОГДА ВЫРАЗИТЬ(-ВзаиморасчетыСПокупателямиОстатки.СуммаСНДСОстаток / ВзаиморасчетыСПокупателямиОстатки.Договор.ЛимитДебиторскойЗадолженности * 100 КАК ЧИСЛО(10, 0))
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПроцентЗадолженностиОтЛимита
		|ПОМЕСТИТЬ ВТДолиДебиторскойЗадолженности
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСПокупателями.Остатки КАК ВзаиморасчетыСПокупателямиОстатки
		|ГДЕ
		|	ВзаиморасчетыСПокупателямиОстатки.Договор.ЛимитДебиторскойЗадолженности > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзаиморасчетыСПокупателямиОстатки.Контрагент
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка,
		|	0
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ТипКонтрагента_Клиент
		|	И НЕ Контрагенты.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РейтингиКлиентовСрезПоследних.Контрагент КАК Контрагент,
		|	РейтингиКлиентовСрезПоследних.УровеньРиска КАК УровеньРиска
		|ПОМЕСТИТЬ УстановленныеУровниРиска
		|ИЗ
		|	РегистрСведений.РейтингиКлиентов.СрезПоследних(, Критерий = &Критерий) КАК РейтингиКлиентовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТДолиДебиторскойЗадолженности.Контрагент, УстановленныеУровниРиска.Контрагент) КАК Контрагент,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТДолиДебиторскойЗадолженности.ПроцентЗадолженностиОтЛимита, 0) <= &ПределНизкогоУровняРиска
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СПАРКЗначенияРисков.Низкий)
		|		КОГДА ВТДолиДебиторскойЗадолженности.ПроцентЗадолженностиОтЛимита <= &ПределСреднегоУровняРиска
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СПАРКЗначенияРисков.Средний)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СПАРКЗначенияРисков.Высокий)
		|	КОНЕЦ КАК НовыйУровеньРиска,
		|	УстановленныеУровниРиска.УровеньРиска КАК СтарыйУровеньРиска,
		|	ВТДолиДебиторскойЗадолженности.Контрагент.Наименование КАК КонтрагентНаименование
		|ИЗ
		|	ВТДолиДебиторскойЗадолженности КАК ВТДолиДебиторскойЗадолженности
		|		ПОЛНОЕ СОЕДИНЕНИЕ УстановленныеУровниРиска КАК УстановленныеУровниРиска
		|		ПО ВТДолиДебиторскойЗадолженности.Контрагент = УстановленныеУровниРиска.Контрагент
		|ГДЕ
		|	ЕСТЬNULL(УстановленныеУровниРиска.УровеньРиска, НЕОПРЕДЕЛЕНО) <> ВЫБОР
		|			КОГДА ЕСТЬNULL(ВТДолиДебиторскойЗадолженности.ПроцентЗадолженностиОтЛимита, 0) <= &ПределНизкогоУровняРиска
		|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СПАРКЗначенияРисков.Низкий)
		|			КОГДА ВТДолиДебиторскойЗадолженности.ПроцентЗадолженностиОтЛимита <= &ПределСреднегоУровняРиска
		|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СПАРКЗначенияРисков.Средний)
		|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СПАРКЗначенияРисков.Высокий)
		|		КОНЕЦ";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			МенеджерЗаписи = РегистрыСведений.РейтингиКлиентов.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Контрагент = Выборка.Контрагент;
			МенеджерЗаписи.Критерий = Критерий;
			МенеджерЗаписи.Период = ТекДата;
			МенеджерЗаписи.УровеньРиска = Выборка.НовыйУровеньРиска;
			МенеджерЗаписи.Записать();
			
			Если Правило.УведомитьОЖелтойЗоне И Выборка.НовыйУровеньРиска = УровеньРискаСредний И Выборка.СтарыйУровеньРиска <> УровеньРискаВысокий  Тогда
				
				АдресаПолучателей = ТаблицаПолучателейУведомлений.Скопировать(Новый Структура("Критерий, УровеньРиска", Критерий, Выборка.НовыйУровеньРиска), "АдресЭлектроннойПочты").ВыгрузитьКолонку("АдресЭлектроннойПочты");
				
				Если АдресаПолучателей.Количество() > 0 тогда
					
					Получатели = СтрСоединить(АдресаПолучателей, "; ");					
					ТекстПисьма = СтрШаблон("Клиенту %1 установлен средний уровень риска по критерию %2", Выборка.КонтрагентНаименование, Критерий);
					ОтправитьСообщение("Переход клиента в зону среднего риска", ТекстПисьма, Получатели);
					
				КонецЕсли;
				
			ИначеЕсли Выборка.НовыйУровеньРиска = УровеньРискаВысокий Тогда
				
				Если Правило.УведомитьОКраснойЗоне Тогда
					
					АдресаПолучателей = ТаблицаПолучателейУведомлений.Скопировать(Новый Структура("Критерий, УровеньРиска", Критерий, Выборка.НовыйУровеньРиска), "АдресЭлектроннойПочты").ВыгрузитьКолонку("АдресЭлектроннойПочты");
					
					Если АдресаПолучателей.Количество() > 0 тогда
						
						Получатели = СтрСоединить(АдресаПолучателей, "; ");					
						ТекстПисьма = СтрШаблон("Клиенту %1 установлен высокий уровень риска по критерию %2", Выборка.КонтрагентНаименование, Критерий);
						ОтправитьСообщение("Переход клиента в зону высокого риска", ТекстПисьма, Получатели);
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если Правило.АвтоматическийПереводВСтопЛистВКраснойЗоне Тогда
					
					КонтрагентДляСтопЛиста = ТаблицаКонтрагентовДляСтопЛиста.Найти(Выборка.Контрагент, "Контрагент");
					Если КонтрагентДляСтопЛиста <> Неопределено Тогда
						КонтрагентДляСтопЛиста.Комментарий = КонтрагентДляСтопЛиста.Комментарий + СтрШаблон("; Установлен высокий уровень риска по критерию %1", Критерий);
					Иначе
						КонтрагентДляСтопЛиста = ТаблицаКонтрагентовДляСтопЛиста.Добавить();
						КонтрагентДляСтопЛиста.Контрагент = Выборка.Контрагент;
						КонтрагентДляСтопЛиста.Комментарий = СтрШаблон("Установлен высокий уровень риска по критерию %1", Критерий);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	//2. Доля ПДЗ
	Критерий = Перечисления.АналитикиРейтингаКлиентов.ДоляПДЗВСреднемесячнойВыручке;
	Правило = ТаблицаПравил.Найти(Критерий, "Критерий");
	
	Если Правило <> Неопределено Тогда
		
		Запрос = Новый Запрос;		
		Запрос.УстановитьПараметр("ТекущаяДата", ТекДата);
		Запрос.УстановитьПараметр("Критерий", Критерий);
		Запрос.УстановитьПараметр("НачалоПериодаВыручки", ДобавитьМесяц(НачалоМесяца(ТекДата), -7));
		Запрос.УстановитьПараметр("КонецПериодаВыручки", ДобавитьМесяц(НачалоМесяца(ТекДата), -1));
		Запрос.УстановитьПараметр("ПределНизкогоУровняРиска", Правило.ЗеленыйПо);
		Запрос.УстановитьПараметр("ПределСреднегоУровняРиска", Правило.ЖелтыйПо);
		Запрос.УстановитьПараметр("ВалютаРегл", ПараметрыКурсаРегл.Валюта);
		Запрос.УстановитьПараметр("КурсРегл", ПараметрыКурсаРегл.Курс);
		Запрос.УстановитьПараметр("КратностьРегл", ПараметрыКурсаРегл.Кратность);
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаиморасчетыСПокупателямиОстатки.Контрагент КАК Контрагент,
		|	ВзаиморасчетыСПокупателямиОстатки.ВалютаРасчетов КАК ВалютаРасчетов,
		|	СУММА(-ВзаиморасчетыСПокупателямиОстатки.СуммаСНДСОстаток) КАК СуммаСНДСОстаток
		|ПОМЕСТИТЬ ВТДебиторскаяЗадолженность
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСПокупателями.Остатки КАК ВзаиморасчетыСПокупателямиОстатки
		|ГДЕ
		|	РАЗНОСТЬДАТ(ВзаиморасчетыСПокупателямиОстатки.ДокументВзаиморасчетов.Дата, &ТекущаяДата, ДЕНЬ) > ВзаиморасчетыСПокупателямиОстатки.Договор.СрокОплаты
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзаиморасчетыСПокупателямиОстатки.ВалютаРасчетов,
		|	ВзаиморасчетыСПокупателямиОстатки.Контрагент
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка,
		|	&ВалютаРегл,
		|	0
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ТипКонтрагента_Клиент
		|	И НЕ Контрагенты.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
		|	КурсыВалютСрезПоследних.Курс КАК Курс,
		|	ВЫБОР
		|		КОГДА КурсыВалютСрезПоследних.Кратность = 0
		|			ТОГДА 1
		|		ИНАЧЕ КурсыВалютСрезПоследних.Кратность
		|	КОНЕЦ КАК Кратность
		|ПОМЕСТИТЬ ВТКурсыВалют
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Продажи.Контрагент КАК Контрагент,
		|	Продажи.СтоимостьОборот КАК Выручка
		|ПОМЕСТИТЬ ВТВыручка
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&НачалоПериодаВыручки, &КонецПериодаВыручки, , ) КАК Продажи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДебиторскаяЗадолженность.Контрагент КАК Контрагент,
		|	СУММА(ВТДебиторскаяЗадолженность.СуммаСНДСОстаток * ВТКурсыВалют.Курс * &КратностьРегл / (ВТКурсыВалют.Кратность * &КурсРегл)) КАК Задолженность
		|ПОМЕСТИТЬ ВТДебиторскаяЗадолженностьВРублях
		|ИЗ
		|	ВТДебиторскаяЗадолженность КАК ВТДебиторскаяЗадолженность
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКурсыВалют КАК ВТКурсыВалют
		|		ПО ВТДебиторскаяЗадолженность.ВалютаРасчетов = ВТКурсыВалют.Валюта
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТДебиторскаяЗадолженность.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДебиторскаяЗадолженностьВРублях.Контрагент КАК Контрагент,
		|	ВЫБОР
		|		КОГДА ВТВыручка.Выручка > 0
		|			ТОГДА ВЫРАЗИТЬ(ВТДебиторскаяЗадолженностьВРублях.Задолженность / ВТВыручка.Выручка * 100 КАК ЧИСЛО(10, 0))
		|		КОГДА ВТДебиторскаяЗадолженностьВРублях.Задолженность > 0
		|			ТОГДА 100
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Доля
		|ПОМЕСТИТЬ ВТДоляЗадолженностиВВыручке
		|ИЗ
		|	ВТДебиторскаяЗадолженностьВРублях КАК ВТДебиторскаяЗадолженностьВРублях
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВыручка КАК ВТВыручка
		|		ПО ВТДебиторскаяЗадолженностьВРублях.Контрагент = ВТВыручка.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТДоляЗадолженностиВВыручке.Контрагент, РейтингиКлиентовСрезПоследних.Контрагент) КАК Контрагент,
		|	ЕСТЬNULL(ВТДоляЗадолженностиВВыручке.Контрагент.Наименование, РейтингиКлиентовСрезПоследних.Контрагент.Наименование) КАК КонтрагентНаименование,
		|	РейтингиКлиентовСрезПоследних.УровеньРиска КАК СтарыйУровеньРиска,
		|	ВЫБОР
		|		КОГДА ВТДоляЗадолженностиВВыручке.Доля <= &ПределНизкогоУровняРиска
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СПАРКЗначенияРисков.Низкий)
		|		КОГДА ВТДоляЗадолженностиВВыручке.Доля <= &ПределСреднегоУровняРиска
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СПАРКЗначенияРисков.Средний)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СПАРКЗначенияРисков.Высокий)
		|	КОНЕЦ КАК НовыйУровеньРиска
		|ИЗ
		|	ВТДоляЗадолженностиВВыручке КАК ВТДоляЗадолженностиВВыручке
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.РейтингиКлиентов.СрезПоследних(, Критерий = ЗНАЧЕНИЕ(Перечисление.АналитикиРейтингаКлиентов.ДоляПДЗВСреднемесячнойВыручке)) КАК РейтингиКлиентовСрезПоследних
		|		ПО ВТДоляЗадолженностиВВыручке.Контрагент = РейтингиКлиентовСрезПоследних.Контрагент
		|ГДЕ
		|	ЕСТЬNULL(РейтингиКлиентовСрезПоследних.УровеньРиска, НЕОПРЕДЕЛЕНО) <> ВЫБОР
		|			КОГДА ВТДоляЗадолженностиВВыручке.Доля <= &ПределНизкогоУровняРиска
		|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СПАРКЗначенияРисков.Низкий)
		|			КОГДА ВТДоляЗадолженностиВВыручке.Доля <= &ПределСреднегоУровняРиска
		|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СПАРКЗначенияРисков.Средний)
		|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СПАРКЗначенияРисков.Высокий)
		|		КОНЕЦ";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			МенеджерЗаписи = РегистрыСведений.РейтингиКлиентов.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Контрагент = Выборка.Контрагент;
			МенеджерЗаписи.Критерий = Критерий;
			МенеджерЗаписи.Период = ТекДата;
			МенеджерЗаписи.УровеньРиска = Выборка.НовыйУровеньРиска;
			МенеджерЗаписи.Записать();
			
			Если Правило.УведомитьОЖелтойЗоне И Выборка.НовыйУровеньРиска = УровеньРискаСредний И Выборка.СтарыйУровеньРиска <> УровеньРискаВысокий  Тогда
				
				АдресаПолучателей = ТаблицаПолучателейУведомлений.Скопировать(Новый Структура("Критерий, УровеньРиска", Критерий, Выборка.НовыйУровеньРиска), "АдресЭлектроннойПочты").ВыгрузитьКолонку("АдресЭлектроннойПочты");
				
				Если АдресаПолучателей.Количество() > 0 тогда
					
					Получатели = СтрСоединить(АдресаПолучателей, "; ");					
					ТекстПисьма = СтрШаблон("Клиенту %1 установлен средний уровень риска по критерию %2", Выборка.КонтрагентНаименование, Критерий);
					ОтправитьСообщение("Переход клиента в зону среднего риска", ТекстПисьма, Получатели);
					
				КонецЕсли;
				
			ИначеЕсли Выборка.НовыйУровеньРиска = УровеньРискаВысокий Тогда
				
				Если Правило.УведомитьОКраснойЗоне Тогда
					
					АдресаПолучателей = ТаблицаПолучателейУведомлений.Скопировать(Новый Структура("Критерий, УровеньРиска", Критерий, Выборка.НовыйУровеньРиска), "АдресЭлектроннойПочты").ВыгрузитьКолонку("АдресЭлектроннойПочты");
				
					Если АдресаПолучателей.Количество() > 0 тогда
						
						Получатели = СтрСоединить(АдресаПолучателей, "; ");					
						ТекстПисьма = СтрШаблон("Клиенту %1 установлен высокий уровень риска по критерию %2", Выборка.КонтрагентНаименование, Критерий);
						ОтправитьСообщение("Переход клиента в зону высокого риска", ТекстПисьма, Получатели);
						
					КонецЕсли;					
					
				КонецЕсли;
				
				Если Правило.АвтоматическийПереводВСтопЛистВКраснойЗоне Тогда
						
					КонтрагентДляСтопЛиста = ТаблицаКонтрагентовДляСтопЛиста.Найти(Выборка.Контрагент, "Контрагент");
					Если КонтрагентДляСтопЛиста <> Неопределено Тогда
						КонтрагентДляСтопЛиста.Комментарий = КонтрагентДляСтопЛиста.Комментарий + СтрШаблон("; Установлен высокий уровень риска по критерию %1", Критерий);
					Иначе
						КонтрагентДляСтопЛиста = ТаблицаКонтрагентовДляСтопЛиста.Добавить();
						КонтрагентДляСтопЛиста.Контрагент = Выборка.Контрагент;
						КонтрагентДляСтопЛиста.Комментарий = СтрШаблон("Установлен высокий уровень риска по критерию %1", Критерий);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЕсли;
	
	//3. Количество дней от счета на оплату
	
	Критерий = Перечисления.АналитикиРейтингаКлиентов.КоличествоДнейОтСчетаНаОплату;
	Правило = ТаблицаПравил.Найти(Критерий, "Критерий");
	
	Если Правило <> Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущаяДата", ТекДата);
		Запрос.УстановитьПараметр("Критерий", Критерий);
		Запрос.УстановитьПараметр("ПределНизкогоУровняРиска", Правило.ЗеленыйПо);
		Запрос.УстановитьПараметр("ПределСреднегоУровняРиска", Правило.ЖелтыйПо);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.Контрагент КАК Контрагент,
		|	МАКСИМУМ(РАЗНОСТЬДАТ(РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.СчетПокупателю.ДатаДокумента, &ТекущаяДата, ДЕНЬ)) КАК ДнейПросрочки
		|ПОМЕСТИТЬ ВТДнейПросрочки
		|ИЗ
		|	РегистрНакопления.РазнесениеСчетовПокупателейПоВходящимПлатежам.Остатки КАК РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РазнесениеСчетовПокупателейПоВходящимПлатежамОстатки.Контрагент
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка,
		|	0
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ТипКонтрагента_Клиент
		|	И НЕ Контрагенты.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТДнейПросрочки.Контрагент, РейтингиКлиентовСрезПоследних.Контрагент) КАК Контрагент,
		|	ЕСТЬNULL(ВТДнейПросрочки.Контрагент.Наименование, РейтингиКлиентовСрезПоследних.Контрагент.Наименование) КАК КонтрагентНаименование,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТДнейПросрочки.ДнейПросрочки, 0) <= &ПределНизкогоУровняРиска
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СПАРКЗначенияРисков.Низкий)
		|		КОГДА ВТДнейПросрочки.ДнейПросрочки <= &ПределСреднегоУровняРиска
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СПАРКЗначенияРисков.Средний)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СПАРКЗначенияРисков.Высокий)
		|	КОНЕЦ КАК НовыйУровеньРиска,
		|	РейтингиКлиентовСрезПоследних.УровеньРиска КАК СтарыйУровеньРиска
		|ИЗ
		|	ВТДнейПросрочки КАК ВТДнейПросрочки
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.РейтингиКлиентов.СрезПоследних(, Критерий = &Критерий) КАК РейтингиКлиентовСрезПоследних
		|		ПО ВТДнейПросрочки.Контрагент = РейтингиКлиентовСрезПоследних.Контрагент
		|ГДЕ
		|	ЕСТЬNULL(РейтингиКлиентовСрезПоследних.УровеньРиска, НЕОПРЕДЕЛЕНО) <> ВЫБОР
		|			КОГДА ЕСТЬNULL(ВТДнейПросрочки.ДнейПросрочки, 0) <= &ПределНизкогоУровняРиска
		|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СПАРКЗначенияРисков.Низкий)
		|			КОГДА ВТДнейПросрочки.ДнейПросрочки <= &ПределСреднегоУровняРиска
		|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СПАРКЗначенияРисков.Средний)
		|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СПАРКЗначенияРисков.Высокий)
		|		КОНЕЦ";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			МенеджерЗаписи = РегистрыСведений.РейтингиКлиентов.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Контрагент = Выборка.Контрагент;
			МенеджерЗаписи.Критерий = Критерий;
			МенеджерЗаписи.Период = ТекДата;
			МенеджерЗаписи.УровеньРиска = Выборка.НовыйУровеньРиска;
			МенеджерЗаписи.Записать();
			
			Если Правило.УведомитьОЖелтойЗоне И Выборка.НовыйУровеньРиска = УровеньРискаСредний И Выборка.СтарыйУровеньРиска <> УровеньРискаВысокий Тогда
				
				АдресаПолучателей = ТаблицаПолучателейУведомлений.Скопировать(Новый Структура("Критерий, УровеньРиска", Критерий, Выборка.НовыйУровеньРиска), "АдресЭлектроннойПочты").ВыгрузитьКолонку("АдресЭлектроннойПочты");
				
				Если АдресаПолучателей.Количество() > 0 тогда
					
					Получатели = СтрСоединить(АдресаПолучателей, "; ");					
					ТекстПисьма = СтрШаблон("Клиенту %1 установлен средний уровень риска по критерию %2", Выборка.КонтрагентНаименование, Критерий);
					ОтправитьСообщение("Переход клиента в зону среднего риска", ТекстПисьма, Получатели);
					
				КонецЕсли;
				
			ИначеЕсли Правило.УведомитьОКраснойЗоне И Выборка.НовыйУровеньРиска = УровеньРискаВысокий Тогда
				
				АдресаПолучателей = ТаблицаПолучателейУведомлений.Скопировать(Новый Структура("Критерий, УровеньРиска", Критерий, Выборка.НовыйУровеньРиска), "АдресЭлектроннойПочты").ВыгрузитьКолонку("АдресЭлектроннойПочты");
				
				Если АдресаПолучателей.Количество() > 0 тогда
					
					Получатели = СтрСоединить(АдресаПолучателей, "; ");					
					ТекстПисьма = СтрШаблон("Клиенту %1 установлен высокий уровень риска по критерию %2", Выборка.КонтрагентНаименование, Критерий);
					ОтправитьСообщение("Переход клиента в зону высокого риска", ТекстПисьма, Получатели);
					
				КонецЕсли;
				
				Если Правило.АвтоматическийПереводВСтопЛистВКраснойЗоне Тогда
						
					КонтрагентДляСтопЛиста = ТаблицаКонтрагентовДляСтопЛиста.Найти(Выборка.Контрагент, "Контрагент");
					Если КонтрагентДляСтопЛиста <> Неопределено Тогда
						КонтрагентДляСтопЛиста.Комментарий = КонтрагентДляСтопЛиста.Комментарий + СтрШаблон("; Установлен высокий уровень риска по критерию %1", Критерий);
					Иначе
						КонтрагентДляСтопЛиста = ТаблицаКонтрагентовДляСтопЛиста.Добавить();
						КонтрагентДляСтопЛиста.Контрагент = Выборка.Контрагент;
						КонтрагентДляСтопЛиста.Комментарий = СтрШаблон("Установлен высокий уровень риска по критерию %1", Критерий);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	//Помещение клиентов в стоп-лист по критериям и исключение клиентов из стоп-листа по отсутствию дебиторской задолженности
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КонтрагентыДляСтопЛиста", ТаблицаКонтрагентовДляСтопЛиста);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекДата);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтрагентыВСтопЛист.Контрагент КАК Контрагент,
	|	КонтрагентыВСтопЛист.Комментарий КАК Комментарий
	|ПОМЕСТИТЬ ВТКонтрагентыДляСтопЛиста
	|ИЗ
	|	&КонтрагентыДляСтопЛиста КАК КонтрагентыВСтопЛист
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтопЛистКонтрагентовСрезПоследних.Период КАК Период,
	|	ЕСТЬNULL(СтопЛистКонтрагентовСрезПоследних.Контрагент, ВТКонтрагентыДляСтопЛиста.Контрагент) КАК Контрагент,
	|	ЕСТЬNULL(СтопЛистКонтрагентовСрезПоследних.ВСтопЛисте, ЛОЖЬ) КАК ВСтопЛисте,
	|	СтопЛистКонтрагентовСрезПоследних.Пользователь КАК Пользователь,
	|	ЕСТЬNULL(СтопЛистКонтрагентовСрезПоследних.ДатаОграниченияАвтоматическогоИзмененияСостояния, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОграниченияАвтоматическогоИзмененияСостояния,
	|	ВЫБОР
	|		КОГДА ВТКонтрагентыДляСтопЛиста.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПоместитьВСтопЛист,
	|	ЕСТЬNULL(ВТКонтрагентыДляСтопЛиста.Комментарий, """") КАК КомментарийПомещенияВСтопЛист
	|ПОМЕСТИТЬ ВТСтопЛистКонтрагентов
	|ИЗ
	|	РегистрСведений.СтопЛистКонтрагентов.СрезПоследних КАК СтопЛистКонтрагентовСрезПоследних
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТКонтрагентыДляСтопЛиста КАК ВТКонтрагентыДляСтопЛиста
	|		ПО СтопЛистКонтрагентовСрезПоследних.Контрагент = ВТКонтрагентыДляСтопЛиста.Контрагент
	|ГДЕ
	|	(ЕСТЬNULL(СтопЛистКонтрагентовСрезПоследних.ВСтопЛисте, ЛОЖЬ)
	|			ИЛИ НЕ ВТКонтрагентыДляСтопЛиста.Контрагент ЕСТЬ NULL)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСтопЛистКонтрагентов.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ВТСтопЛистКонтрагентов.ПоместитьВСтопЛист
	|				И НЕ ВТСтопЛистКонтрагентов.ВСтопЛисте
	|				И ВТСтопЛистКонтрагентов.ДатаОграниченияАвтоматическогоИзмененияСостояния < &ТекущаяДата
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПоместитьВСтопЛист,
	|	ВЫБОР
	|		КОГДА ВТСтопЛистКонтрагентов.ВСтопЛисте
	|				И НЕ ВТСтопЛистКонтрагентов.ПоместитьВСтопЛист
	|				И -ЕСТЬNULL(ВзаиморасчетыСПокупателямиОстатки.СуммаСНДСОстаток, 0) = 0
	|				И ВТСтопЛистКонтрагентов.ДатаОграниченияАвтоматическогоИзмененияСостояния < &ТекущаяДата
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИсключитьИзСтопЛиста,
	|	ВТСтопЛистКонтрагентов.КомментарийПомещенияВСтопЛист КАК КомментарийПомещенияВСтопЛист
	|ИЗ
	|	ВТСтопЛистКонтрагентов КАК ВТСтопЛистКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСПокупателями.Остатки(
	|				,
	|				Контрагент В
	|					(ВЫБРАТЬ
	|						СтопЛистКонтрагентов.Контрагент
	|					ИЗ
	|						ВТСтопЛистКонтрагентов КАК СтопЛистКонтрагентов)) КАК ВзаиморасчетыСПокупателямиОстатки
	|		ПО ВТСтопЛистКонтрагентов.Контрагент = ВзаиморасчетыСПокупателямиОстатки.Контрагент
	|ГДЕ
	|	(ВТСтопЛистКонтрагентов.ПоместитьВСтопЛист
	|				И НЕ ВТСтопЛистКонтрагентов.ВСтопЛисте
	|				И ВТСтопЛистКонтрагентов.ДатаОграниченияАвтоматическогоИзмененияСостояния < &ТекущаяДата
	|			ИЛИ ВТСтопЛистКонтрагентов.ВСтопЛисте
	|				И НЕ ВТСтопЛистКонтрагентов.ПоместитьВСтопЛист
	|				И -ЕСТЬNULL(ВзаиморасчетыСПокупателямиОстатки.СуммаСНДСОстаток, 0) = 0
	|				И ВТСтопЛистКонтрагентов.ДатаОграниченияАвтоматическогоИзмененияСостояния < &ТекущаяДата)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Запись = РегистрыСведений.СтопЛистКонтрагентов.СоздатьМенеджерЗаписи();
		Запись.Период = ТекДата;
		Запись.Контрагент = Выборка.Контрагент;
		
		Если Выборка.ПоместитьВСтопЛист Тогда
			Запись.ВСтопЛисте = Истина;
			Запись.Комментарий = Выборка.КомментарийПомещенияВСтопЛист;
		Иначе
			Запись.ВСтопЛисте = Ложь;
		КонецЕсли;
		
		Запись.Записать();
		
	КонецЦикла;	
	
КонецПроцедуры

//Евросиб Каблов 26.02.2020 ( Ticket#0182095
Процедура РассчитатьПлановуюКатегориюКонтрагентов(ПериодРасчета) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДатаНачала = НачалоМесяца(ПериодРасчета);
	ДатаОкончания = КонецМесяца(ДобавитьМесяц(ПериодРасчета, 5));
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтрагентыПлановыеПоказателиРаботыСКлиентом.Ссылка КАК Контрагент,
	|	КонтрагентыПлановыеПоказателиРаботыСКлиентом.МесяцНачалаРаботы КАК МесяцНачалаРаботы,
	|	КонтрагентыПлановыеПоказателиРаботыСКлиентом.КонтрибуцияБезНДС КАК КонтрибуцияБезНДС,
	|	КонтрагентыПлановыеПоказателиРаботыСКлиентом.Погрузка КАК Погрузка
	|ИЗ
	|	Справочник.Контрагенты.ПлановыеПоказателиРаботыСКлиентом КАК КонтрагентыПлановыеПоказателиРаботыСКлиентом
	|ГДЕ
	|	КонтрагентыПлановыеПоказателиРаботыСКлиентом.МесяцНачалаРаботы МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И НЕ КонтрагентыПлановыеПоказателиРаботыСКлиентом.Ссылка.ПометкаУдаления";
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);	
	
	ТаблицаПоказателей = Запрос.Выполнить().Выгрузить();
	
	ТаблицаКонтрагентов = ТаблицаПоказателей.Скопировать(, "Контрагент, КонтрибуцияБезНДС");
	ТаблицаКонтрагентов.Свернуть("Контрагент", "КонтрибуцияБезНДС");
	ТаблицаКонтрагентов.Колонки.Добавить("ПроцентКонтрибуции", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 2)));
	ТаблицаКонтрагентов.Колонки.Добавить("КатегорияABC", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(1)));
	ТаблицаКонтрагентов.Колонки.Добавить("КатегорияXYZ", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(1)));
	
	ОбщаяСуммаКонтрибуции = ТаблицаПоказателей.Итог("КонтрибуцияБезНДС");
	
	Если ОбщаяСуммаКонтрибуции <> 0 Тогда
		
		Для Каждого СтрокаКонтрагента Из ТаблицаКонтрагентов Цикл
			СтрокаКонтрагента.ПроцентКонтрибуции = Окр(СтрокаКонтрагента.КонтрибуцияБезНДС / ОбщаяСуммаКонтрибуции * 100, 2);
		КонецЦикла;
		
		ТаблицаКонтрагентов.Сортировать("ПроцентКонтрибуции Убыв");
		
		НакопленныйПроцент = 0;		
		Для Каждого СтрокаКонтрагента Из ТаблицаКонтрагентов Цикл
			НакопленныйПроцент = НакопленныйПроцент + СтрокаКонтрагента.ПроцентКонтрибуции;
			Если НакопленныйПроцент < 80 Тогда
				СтрокаКонтрагента.КатегорияABC = "A";
			ИначеЕсли НакопленныйПроцент < 95 Тогда
				СтрокаКонтрагента.КатегорияABC = "B";
			Иначе
				СтрокаКонтрагента.КатегорияABC = "C";
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;	
	
	Для Каждого СтрокаКонтрагента Из ТаблицаКонтрагентов Цикл
				
		Показатели = ТаблицаПоказателей.НайтиСтроки(Новый Структура("Контрагент", СтрокаКонтрагента.Контрагент));
		Количество = Показатели.Количество();
		
		Если Количество = 0 Или Количество = 1 Тогда
			Продолжить;
		КонецЕсли;
		
		Сумма = 0;
		Для Каждого СтрокаПоказателя Из Показатели Цикл
			Сумма = Сумма + СтрокаПоказателя.Погрузка;
		КонецЦикла;
		ПогрузкаСреднееЗначение = Окр(Сумма / Количество, 2);
		
		Если ПогрузкаСреднееЗначение = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Дисперсия = 0;
		Для Каждого СтрокаПоказателя Из Показатели Цикл
			Дисперсия = Дисперсия + Pow(СтрокаПоказателя.Погрузка - ПогрузкаСреднееЗначение, 2);
		КонецЦикла;
		
		СреднеквадратическоеОтклонение = Sqrt(Дисперсия / (Количество - 1));
		КоэффициентВариации = СреднеквадратическоеОтклонение / ПогрузкаСреднееЗначение * 100;
		
		Если КоэффициентВариации <= 10 Тогда
		    СтрокаКонтрагента.КатегорияXYZ = "X";
		ИначеЕсли КоэффициентВариации <= 25 Тогда
			СтрокаКонтрагента.КатегорияXYZ = "Y";
		Иначе
			СтрокаКонтрагента.КатегорияXYZ = "Z";
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщиеСвойстваЗаписей = Новый Структура();
	ОбщиеСвойстваЗаписей.Вставить("Период", ДатаНачала);
	ОбщиеСвойстваЗаписей.Вставить("ТипКонтрагента", Перечисления.ТипыКонтрагентов.Клиент);
	ОбщиеСвойстваЗаписей.Вставить("ПлановаяФактическая", Перечисления.ПланФакт.План);
	
	Для Каждого СтрокаКонтрагента Из ТаблицаКонтрагентов Цикл		
		Если ЗначениеЗаполнено(СтрокаКонтрагента.КатегорияABC) И ЗначениеЗаполнено(СтрокаКонтрагента.КатегорияXYZ) Тогда
			Запись = РегистрыСведений.КатегорииКонтрагентов.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, ОбщиеСвойстваЗаписей);
			Запись.Контрагент = СтрокаКонтрагента.Контрагент;
			Запись.Категория = СтрокаКонтрагента.КатегорияABC + СтрокаКонтрагента.КатегорияXYZ;
			Запись.Записать();
		КонецЕсли;		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
//Евросиб Каблов 26.02.2020 )

Процедура ОтправитьСообщение(Тема, ТекстПисьма, Получатели)
	
	Тема = "Изменение рейтинга клиентов";
	ТелоПисьма = Новый ФорматированныйДокумент;
	ТелоПисьма.Добавить(ТекстПисьма);
	СкрытыеКопии = "";
	Вложения = Новый Массив;
	
	Если РаботаСПочтовымиСообщениями.УчетнаяЗаписьНастроена(Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты, Истина, Ложь) Тогда
		ПараметрыСообщения = новый Структура("Кому, ПолучателиСообщения, СкрытыеКопии, Тема, Тело, Вложения", Получатели, Получатели, СкрытыеКопии, Тема, ТелоПисьма, Вложения);
		Попытка
			ИДПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты, ПараметрыСообщения);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			//ЗаписьЖурналаРегистрации("Письмо не отправлено по причине: " + ОписаниеОшибки, УровеньЖурналаРегистрации.Ошибка,,, "Рассылка об изменении рейтинга клиентов");
			//ДИТ, Беляев СЮ, Ticket#0272756, 25-07-2022, начало
			ЗаписьЖурналаРегистрации(РаботаСПочтовымиСообщениями.СобытиеЖурналаРегистрацииОшибка(), УровеньЖурналаРегистрации.Ошибка,,, "Рассылка об изменении рейтинга клиентов. Письмо не отправлено по причине: "+ОписаниеОшибки);
            //ДИТ, Беляев СЮ, Ticket#0272756, 25-07-2022, конец
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьВладельцаДоговора(Договор) Экспорт
	Возврат Договор.Владелец;
КонецФункции

Функция ПолучитьРуководителяКонтрагента(Контрагент, ДатаДокумента) Экспорт

	Результат = неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	ДанныеРуководителяКонтрагентовСрезПоследних.Руководитель КАК Руководитель,
				   |	ДанныеРуководителяКонтрагентовСрезПоследних.ОкончаниеДействия КАК ОкончаниеДействия
				   |ИЗ
				   |	РегистрСведений.ДанныеРуководителяКонтрагентов.СрезПоследних(&ДатаДокумента, Контрагент = &Контрагент) КАК ДанныеРуководителяКонтрагентовСрезПоследних";
				   
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Ответ = Запрос.Выполнить().Выбрать();
	
	Если Ответ.Следующий() тогда             
		Если НЕ ЗначениеЗаполнено(Ответ.ОкончаниеДействия) ИЛИ Ответ.ОкончаниеДействия > ДатаДокумента Тогда
			Результат = Ответ.Руководитель;
		КонецЕсли;
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

//Евросиб Коханенко Н.А. 11.08.2025 (( #112567 
Функция ПолучитьРуководителяИПериодДействияКонтрагента(Контрагент, ДатаДокумента, ВыбранныйРуководитель = Неопределено, НачалоДействия = Неопределено) Экспорт

	Результат = Новый Структура("Руководитель, НачалоДействия, ОкончаниеДействия", Неопределено, Неопределено, Неопределено);
	
	Запрос = Новый Запрос;

	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	ДанныеРуководителяКонтрагентовСрезПоследних.Руководитель КАК Руководитель,
		|	ДанныеРуководителяКонтрагентовСрезПоследних.Период КАК НачалоДействия,
		|	ДанныеРуководителяКонтрагентовСрезПоследних.ОкончаниеДействия КАК ОкончаниеДействия
		|ИЗ
		|	РегистрСведений.ДанныеРуководителяКонтрагентов.СрезПоследних(
		|			&ДатаДокумента,
		|			Контрагент = &Контрагент
		|				И (&НеОтбиратьПоРуководителю
		|					ИЛИ (Руководитель = &Руководитель И Период = &НачалоДействия)
		|				   И (ОкончаниеДействия = ДАТАВРЕМЯ(1,1,1) ИЛИ ОкончаниеДействия >= &ДатаДокумента)))
		|		 КАК ДанныеРуководителяКонтрагентовСрезПоследних 
		|ОБЪЕДИНИТЬ
		|ВЫБРАТЬ
		|	ДанныеПодписантовКонтрагентовСрезПоследних.Подписант КАК Руководитель,
		|	ДанныеПодписантовКонтрагентовСрезПоследних.Период КАК НачалоДействия,
		|	ДанныеПодписантовКонтрагентовСрезПоследних.ОкончаниеДействия КАК ОкончаниеДействия
		|ИЗ
		|	РегистрСведений.ДанныеПодписантовКонтрагентов.СрезПоследних(
		|			&ДатаДокумента,
		|			Контрагент = &Контрагент
		|				И (&НеОтбиратьПоРуководителю
		|					ИЛИ (Подписант = &Руководитель И Период = &НачалоДействия)
		|				   И (ОкончаниеДействия = ДАТАВРЕМЯ(1,1,1) ИЛИ ОкончаниеДействия >= &ДатаДокумента)))
		|		 КАК ДанныеПодписантовКонтрагентовСрезПоследних 
		|";
	Запрос.УстановитьПараметр("НачалоДействия", НачалоДействия);
	
	Запрос.УстановитьПараметр("НеОтбиратьПоРуководителю", ВыбранныйРуководитель = Неопределено);
	Запрос.УстановитьПараметр("Руководитель", ВыбранныйРуководитель);
				   
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Ответ = Запрос.Выполнить().Выбрать();
	
	Если Ответ.Следующий() тогда             
		Если НЕ ЗначениеЗаполнено(Ответ.ОкончаниеДействия) 
			ИЛИ Ответ.ОкончаниеДействия > ДатаДокумента Тогда
			ЗаполнитьЗначенияСвойств(Результат, Ответ);
		КонецЕсли;
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции //Евросиб Коханенко Н.А. 11.08.2025 )) #112567 

Процедура СтопЛистОбновление() Экспорт
	
	// Сначала заносим в стоп-лист всех контрагентов с задолженностью
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЦентрыФинансовойОтветственностиОтключениеСтопЛиста.Ссылка КАК Ссылка
	                |ИЗ
	                |	Справочник.ЦентрыФинансовойОтветственности.ОтключениеСтопЛиста КАК ЦентрыФинансовойОтветственностиОтключениеСтопЛиста
	                |ГДЕ
	                |	&ТекущаяДата МЕЖДУ ЦентрыФинансовойОтветственностиОтключениеСтопЛиста.НачалоПериода И ЦентрыФинансовойОтветственностиОтключениеСтопЛиста.КонецПериода";
	СписокЗаблокированныхЦФО = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзаиморасчетыСПокупателямиОстатки.Контрагент КАК Контрагент,
	               |	ВзаиморасчетыСПокупателямиОстатки.Договор КАК Договор,
	               |	МИНИМУМ(ВзаиморасчетыСПокупателямиОстатки.ДокументВзаиморасчетов) КАК ДокументВзаиморасчетов,
	               |	ВзаиморасчетыСПокупателямиОстатки.ВалютаРасчетов КАК ВалютаРасчетов,
	               |	МИНИМУМ(ВзаиморасчетыСПокупателямиОстатки.ДатаРасчетов) КАК ДатаРасчетов,
	               |	СУММА(ВзаиморасчетыСПокупателямиОстатки.СуммаБезНДСОстаток) КАК СуммаБезНДСОстаток,
	               |	МАКСИМУМ(ЕСТЬNULL(Кредитка.ОтсрочкаПоДоговору_Факт, ВзаиморасчетыСПокупателямиОстатки.Договор.СрокОплаты)) КАК ДоговорСрокОплаты,
	               |	МАКСИМУМ(ДОБАВИТЬКДАТЕ(ВзаиморасчетыСПокупателямиОстатки.ДатаРасчетов, ДЕНЬ, ЕСТЬNULL(Кредитка.ОтсрочкаПоДоговору_Факт, ВзаиморасчетыСПокупателямиОстатки.Договор.СрокОплаты))) КАК ДедлайнОплаты,
	               |	МАКСИМУМ(Кредитка.Ссылка) КАК Ссылка,
	               |	МАКСИМУМ(Кредитка.ОтсрочкаПоДоговору_Факт) КАК ОтсрочкаПоДоговору_Факт,
	               |	СтопЛистКонтрагентовСрезПоследних.ВСтопЛисте КАК ВСтопЛисте,
	               |	МАКСИМУМ(РАЗНОСТЬДАТ(ДОБАВИТЬКДАТЕ(ВзаиморасчетыСПокупателямиОстатки.ДатаРасчетов, ДЕНЬ, ЕСТЬNULL(Кредитка.ОтсрочкаПоДоговору_Факт, ВзаиморасчетыСПокупателямиОстатки.Договор.СрокОплаты)), &ТекущаяДата, ДЕНЬ)) КАК ДнейПросрочки,
	               |	ВзаиморасчетыСПокупателямиОстатки.ДокументВзаиморасчетов.ЦФО КАК ЦФО,
	               |	МАКСИМУМ(ЕСТЬNULL(Кредитка.ЛимитДЗ_План, ВзаиморасчетыСПокупателямиОстатки.Договор.ЛимитДебиторскойЗадолженности)) КАК ЛимитПДЗ
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСПокупателями.Остатки КАК ВзаиморасчетыСПокупателямиОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			КредитнаяЗаявка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |			МАКСИМУМ(КредитнаяЗаявка.Ссылка) КАК Ссылка,
	               |			МАКСИМУМ(КредитнаяЗаявка.ОтсрочкаПоДоговору_План) КАК ОтсрочкаПоДоговору_Факт,
	               |			МАКСИМУМ(КредитнаяЗаявка.ЛимитДЗ_План) КАК ЛимитДЗ_План
	               |		ИЗ
	               |			Документ.КредитнаяЗаявка КАК КредитнаяЗаявка
	               |		ГДЕ
	               |			КредитнаяЗаявка.Проведен и 1 = 2
	               |			И &ТекущаяДата МЕЖДУ КредитнаяЗаявка.ДатаНачала И КредитнаяЗаявка.ДатаОкончания
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			КредитнаяЗаявка.ДоговорКонтрагента) КАК Кредитка
	               |		ПО ВзаиморасчетыСПокупателямиОстатки.Договор = Кредитка.ДоговорКонтрагента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтопЛистКонтрагентов.СрезПоследних КАК СтопЛистКонтрагентовСрезПоследних
	               |		ПО ВзаиморасчетыСПокупателямиОстатки.Контрагент = СтопЛистКонтрагентовСрезПоследних.Контрагент
	               |ГДЕ
	               |	ВзаиморасчетыСПокупателямиОстатки.СуммаБезНДСОстаток + ЕСТЬNULL(Кредитка.ЛимитДЗ_План, ВзаиморасчетыСПокупателямиОстатки.Договор.ЛимитДебиторскойЗадолженности) < 0
	               |	И ДОБАВИТЬКДАТЕ(ВзаиморасчетыСПокупателямиОстатки.ДатаРасчетов, ДЕНЬ, ЕСТЬNULL(Кредитка.ОтсрочкаПоДоговору_Факт, ВзаиморасчетыСПокупателямиОстатки.Договор.СрокОплаты)) < &ТекущаяДата
	               |	И СтопЛистКонтрагентовСрезПоследних.ДатаОграниченияАвтоматическогоИзмененияСостояния < &ТекущаяДата
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВзаиморасчетыСПокупателямиОстатки.Контрагент,
	               |	ВзаиморасчетыСПокупателямиОстатки.Договор,
	               |	ВзаиморасчетыСПокупателямиОстатки.ВалютаРасчетов,
	               |	СтопЛистКонтрагентовСрезПоследних.ВСтопЛисте,
	               |	ВзаиморасчетыСПокупателямиОстатки.ДокументВзаиморасчетов.ЦФО";
	Ответ = Запрос.Выполнить().Выбрать();
	
	МассивЗаблокированных = Новый Массив;
	КоличествоКонтрагентов = 0;
	СписокКонтрагентов = "";
	СписокПричин = "";
	МассивКонтрагентовСЗадолженностью = Новый Массив;
	
	Пока Ответ.Следующий() Цикл

		МассивКонтрагентовСЗадолженностью.Добавить(Ответ.Контрагент);	
		Если МассивЗаблокированных.Найти(Ответ.Контрагент) = неопределено И Ответ.ВСтопЛисте <> Истина И СписокЗаблокированныхЦФО.Найти(Ответ.ЦФО) = неопределено Тогда
			
			Причина = "Просрочка оплаты на сумму " + Ответ.СуммаБезНДСОстаток + " по договору " + Ответ.Договор + " на дней " + Ответ.ДнейПросрочки;
			
			МЗ = РегистрыСведений.СтопЛистКонтрагентов.СоздатьМенеджерЗаписи();
			МЗ.ВСтопЛисте = Истина;
			МЗ.Комментарий = "Отнесено автоматически " + ТекущаяДата() + " " + Причина;
			МЗ.Пользователь = Пользователи.ТекущийПользователь();
			МЗ.Период = ТекущаяДата();
			МЗ.Контрагент = Ответ.Контрагент;
			МЗ.Записать(Истина);
			
			КоличествоКонтрагентов = КоличествоКонтрагентов + 1;
			СписокКонтрагентов = СписокКонтрагентов + ", " + Ответ.Контрагент;
			СписокПричин = СписокПричин + ", " + Причина;
			МассивЗаблокированных.Добавить(Ответ.Контрагент);
		КонецЕсли;
		
	КонецЦикла;
	
	Сообщить("Заблокировано " + КоличествоКонтрагентов + " контрагентов: " + СписокКонтрагентов);
	
	// 2. Выводим из стоп-листа контрагентов, чья задолженность не является просрочкой
	
	КоличествоКонтрагентов = 0;
	СписокКонтрагентов = "";
	Запрос.УстановитьПараметр("ЗаблокированныеКонтрагенты", МассивКонтрагентовСЗадолженностью);
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтопЛистКонтрагентовСрезПоследних.Контрагент КАК Контрагент
	               |ИЗ
	               |	РегистрСведений.СтопЛистКонтрагентов.СрезПоследних КАК СтопЛистКонтрагентовСрезПоследних
	               |ГДЕ
	               |	НЕ СтопЛистКонтрагентовСрезПоследних.Контрагент В (&ЗаблокированныеКонтрагенты)
	               |	И СтопЛистКонтрагентовСрезПоследних.ВСтопЛисте
	               |	И СтопЛистКонтрагентовСрезПоследних.ДатаОграниченияАвтоматическогоИзмененияСостояния < &ТекущаяДата";
	Ответ = Запрос.Выполнить().Выбрать();
	Пока Ответ.Следующий() Цикл
		
		МЗ = РегистрыСведений.СтопЛистКонтрагентов.СоздатьМенеджерЗаписи();
		МЗ.ВСтопЛисте = Ложь;
		МЗ.Комментарий = "Исключено из стоп-листа в связи с отсутствием задолженности сверх срока оплаты: " + ТекущаяДата();
		МЗ.Пользователь = Пользователи.ТекущийПользователь();
		МЗ.Период = ТекущаяДата();
		МЗ.Контрагент = Ответ.Контрагент;
		МЗ.Записать(Истина);
		
		КоличествоКонтрагентов = КоличествоКонтрагентов + 1;
		СписокКонтрагентов = СписокКонтрагентов + ", " + Ответ.Контрагент;
		
	КонецЦикла;
	
	Сообщить("Разблокировано " + КоличествоКонтрагентов + " контрагентов: " + СписокКонтрагентов);
	
КонецПроцедуры

Функция ПолучитьРасписаниеФоновогоЗаданияСтопЛист() Экспорт
	
	Возврат РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.СтопЛистОбновление).Расписание;
	
КонецФункции

Процедура ОкончаниеРедактированияРасписаниеСтопЛиста(НовоеЗадание, Параметр2 = неопределено) Экспорт
	
	Если НовоеЗадание = неопределено Тогда Возврат; КонецЕсли;
	
	Задание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.СтопЛистОбновление);
	Задание.Расписание = НовоеЗадание;
	Задание.Записать();
		
КонецПроцедуры

Функция КонтрагентРезидент(Контрагент) Экспорт
	Возврат (Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия);
КонецФункции

Функция КонтрагентВСтопЛисте(Контрагент, ДатаПроверки) Экспорт
	
	Результат = Новый Структура("ВСтопЛисте, Пользователь, Комментарий, Период", Ложь, неопределено, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтопЛистКонтрагентовСрезПоследних.ВСтопЛисте КАК ВСтопЛисте,
	               |	СтопЛистКонтрагентовСрезПоследних.Пользователь КАК Пользователь,
	               |	СтопЛистКонтрагентовСрезПоследних.Комментарий КАК Комментарий,
	               |	СтопЛистКонтрагентовСрезПоследних.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.СтопЛистКонтрагентов.СрезПоследних(&Период, Контрагент = &Контрагент) КАК СтопЛистКонтрагентовСрезПоследних";
	Запрос.УстановитьПараметр("Период", ДатаПроверки);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Ответ);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//Евросиб - АСуслов 13.04.2022 12:38:53 #41427
//(
// Устанавливает договор контрагента по умолчанию с учетом условий отбора. 
// Возвращается основной договор или единственный или пустая ссылка
//
// Параметры
//  ВладелецДоговора	–	<СправочникСсылка.Контрагенты> 
//							Контрагент, договор которого нужно получить
//  ОрганизацияДоговора	–	<СправочникСсылка.Организации> 
//							Организация, договор которой нужно получить
//  СписокВидовДоговора	–	<Массив> или <СписокЗначений>, состоящий из значений типа <ПеречислениеСсылка.ВидыДоговоровКонтрагентов> 
//							Нужные виды договора
//  СтруктураПараметров	–	<Структура>
//							Структура дополнительных параметров отбора договоров по реквизитам.
//							Элементы структуры СтруктураПараметров:
//							Ключ - имя реквизита договора, Значение - еще одна структура
//							
//							Элементы структуры, которая находится в Значение:
//							Ключ - "ЗначениеОтбора", Значение - значение реквизита договора для отбора. Обязательный элемент.
//							Ключ - "ВидСравненияОтбора", Значение - <ВидСравнения>. Необязательный элемент, по умолчанию ВидСравнения.Равно
//
// Возвращаемое значение:
//   <СправочникСсылка.ДоговорыКонтрагентов> – найденный счет или пустая ссылка
//
Функция УстановитьДоговорКонтрагента(ДоговорКонтрагента, ВладелецДоговора, ОрганизацияДоговора, СписокВидовДоговора = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	НовыйДоговор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	ВестиУчетПоДоговорам = Истина;
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.Владелец.ОсновнойДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка КАК Основной,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)
	|			ТОГДА 1
	|		КОГДА ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	&ТекстФильтра
	|
	|УПОРЯДОЧИТЬ ПО
	|	Основной УБЫВ,
	|	Приоритет УБЫВ";
	
	ГоловнаяОрганизацияДоговора = ОбщегоНазначенияБПВызовСервераПовтИсп.ГоловнаяОрганизация(ОрганизацияДоговора);
	Запрос.УстановитьПараметр("ОрганизацияДоговора", ГоловнаяОрганизацияДоговора);
	Запрос.УстановитьПараметр("ВладелецДоговора", ВладелецДоговора);
	ТекстФильтра = "ДоговорыКонтрагентов.Организация = &ОрганизацияДоговора
		|	И ДоговорыКонтрагентов.Владелец = &ВладелецДоговора";
	
	Если ВестиУчетПоДоговорам Тогда
		ТекстФильтра = ТекстФильтра + "
		| И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ";
	КонецЕсли;
	
	Если СписокВидовДоговора <> Неопределено Тогда
		ТекстФильтра = ТекстФильтра + " И ДоговорыКонтрагентов.ВидДоговора В (&СписокВидовДоговора)";
		Запрос.УстановитьПараметр("СписокВидовДоговора", СписокВидовДоговора);
	КонецЕсли;
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		Для Каждого Параметр Из ДополнительныеПараметры Цикл
			ИмяРеквизита = Параметр.Ключ;
			СтруктураОтбора = Параметр.Значение;
			
			Если НЕ СтруктураОтбора.Свойство("ВидСравненияОтбора") Тогда
				ВидСравненияЗапроса = "=";
			ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.Равно Тогда
				ВидСравненияЗапроса = "=";
			ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.НеРавно Тогда
				ВидСравненияЗапроса = "<>";
			ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.ВСписке Тогда
				ВидСравненияЗапроса = "В";
			ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.НеВСписке Тогда
				ВидСравненияЗапроса = "НЕ В";
			ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.ВИерархии Тогда
				ВидСравненияЗапроса = "В ИЕРАРХИИ";
			ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.ВСпискеПоИерархии Тогда
				ВидСравненияЗапроса = "В ИЕРАРХИИ";
			ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.НеВСпискеПоИерархии Тогда
				ВидСравненияЗапроса = "НЕ В ИЕРАРХИИ";
			ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.НеВИерархии Тогда
				ВидСравненияЗапроса = "НЕ В ИЕРАРХИИ";
			ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.Больше Тогда
				ВидСравненияЗапроса = ">";
			ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.БольшеИлиРавно Тогда
				ВидСравненияЗапроса = ">=";
			ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.Меньше Тогда
				ВидСравненияЗапроса = "<";
			ИначеЕсли СтруктураОтбора.ВидСравненияОтбора = ВидСравнения.МеньшеИлиРавно Тогда
				ВидСравненияЗапроса = "<=";
			Иначе // другие варианты 
				ВидСравненияЗапроса = "=";
			КонецЕсли;
			
			ТекстФильтра = ТекстФильтра + "
				| И ДоговорыКонтрагентов." + ИмяРеквизита + " " + ВидСравненияЗапроса + " (&" + ИмяРеквизита + ")";
			Запрос.УстановитьПараметр(ИмяРеквизита, СтруктураОтбора.ЗначениеОтбора);
		КонецЦикла;
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстФильтра", ТекстФильтра);
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		НайденОдинДоговор = Выборка.Количество() = 1;
		// Если ведется учет по договорам, то выбираем либо основной, либо единственный договор
		Если ВестиУчетПоДоговорам Тогда
			Если Выборка.Основной Или НайденОдинДоговор Тогда
				НовыйДоговор = Выборка.Ссылка;
			КонецЕсли;
		// Если учет по договорам не ведется, то выбираем только основной договор
		ИначеЕсли Выборка.Основной Тогда
			НовыйДоговор = Выборка.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	РеквизитыДоговора = БухгалтерскийУчетПереопределяемый.ПолучитьРеквизитыДоговораКонтрагента(ДоговорКонтрагента);
	
	Если ЗначениеЗаполнено(НовыйДоговор)
		И (Не ЗначениеЗаполнено(ДоговорКонтрагента)
			Или РеквизитыДоговора.Владелец <> ВладелецДоговора
			Или РеквизитыДоговора.Организация <> ГоловнаяОрганизацияДоговора) Тогда
		ДоговорКонтрагента = НовыйДоговор;
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
//)
//Евросиб - АСуслов 13.04.2022 12:39:51 #41427

//Евросиб Каблов 25.07.2022 Ticket#0239076

// ++ Евросиб Дудоров С.В. US 57543 30.01.2023  
//Функция ПолучитьОтветственногоПоДоговору(Договор, Знач ЦФО = Неопределено) Экспорт
Функция ПолучитьОтветственногоПоДоговору(Договор, Знач ЦФО = Неопределено, ТипОтветственного = Неопределено) Экспорт
	
	Если ТипОтветственного = Неопределено Тогда
		ТипОтветственного = ПредопределенноеЗначение("Перечисление.ТипыОтветственных.ОтветственныйЗаУчет");
	КонецЕсли;	
// -- Евросиб Дудоров С.В. US 57543 30.01.2023  
	
	ОсновнойЦФО = Справочники.ЦентрыФинансовойОтветственности.ОсновнойЦФО;
	Если Не ЗначениеЗаполнено(ЦФО) Тогда
		ЦФО = ОсновнойЦФО;
	КонецЕсли;
	
	Отв = Справочники.Пользователи.ПустаяСсылка();
	// ДИТ US 51951 TA 61497 Евсенкин М.А. 28.11.2022
	// Было
	//Если ЦФО = ОсновнойЦФО Тогда
	//	ОтветственныйЗаУчет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ОтветственныйЗаУчет");
	//	Если ЗначениеЗаполнено(ОтветственныйЗаУчет) Тогда
	//		Отв = ОтветственныйЗаУчет;
	//	Иначе
	//		Отв = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОсновнойЦФО, "ОтветственныйЗаУчет");
	//	КонецЕсли;
	//Иначе
	//	ОтветственныйЗаУчетНСК = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ОтветственныйЗаУчетНСК");
	//	Если ЗначениеЗаполнено(ОтветственныйЗаУчетНСК) Тогда
	//		Отв = ОтветственныйЗаУчетНСК;			
	//	Иначе
	//		Отв = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЦФО, "ОтветственныйЗаУчет");
	//	КонецЕсли;
	//КонецЕсли;
	// Стало
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Договор",				Договор);
	СтруктураПараметров.Вставить("ЦФО",					ЦФО);
	// ++ Евросиб Дудоров С.В. US 57543 30.01.2023  
	//СтруктураПараметров.Вставить("ТипОтветственного",	Перечисления.ТипыОтветственных.ОтветственныйЗаУчет);  
	СтруктураПараметров.Вставить("ТипОтветственного",	ТипОтветственного);  
	// -- Евросиб Дудоров С.В. US 57543 30.01.2023

	Отв = Справочники.ДоговорыКонтрагентов.ПолучитьОтветственного(СтруктураПараметров);
	Если НЕ ЗначениеЗаполнено(Отв) Тогда
			Отв = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЦФО, "ОтветственныйЗаУчет");
	КонецЕсли;
	// ДИТ US 51951 TA 61497 Евсенкин М.А. 28.11.2022
	Возврат Отв;
		   
КонецФункции

// ++ Дудоров С.В. 16.12.2022 Ticket #0239076 
Функция ПолучитьОтветственногоДействующегоДоговораКлиента(Клиент
	, ТипОтветственного = Неопределено
	, ЦФО = Неопределено) Экспорт  
	
	ОсновнойЦФО = ПредопределенноеЗначение("Справочник.ЦентрыФинансовойОтветственности.ОсновнойЦФО");
	Если ЦФО = Неопределено 
		или ЦФО = ПредопределенноеЗначение("Справочник.ЦентрыФинансовойОтветственности.ПустаяСсылка") 
		Тогда ЦФО = ОсновнойЦФО;
	КонецЕсли;	
	Если ТипОтветственного = Неопределено Тогда
		ТипОтветственного = ПредопределенноеЗначение("Перечисление.ТипыОтветственных.ОтветственныйЗаСопровождение");
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	//Евросиб СубботинВ #117990 20.01.2026 Начало
	//Запрос.Текст = 
	//	"ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	ДоговорыКонтрагентовОтветственные.Ссылка КАК Договор,
	//	|	ДоговорыКонтрагентовОтветственные.Ссылка.Дата КАК Дата,
	//	|	ДоговорыКонтрагентовОтветственные.Ссылка.СрокДействия КАК СрокДействия,
	//	|	ДоговорыКонтрагентовОтветственные.Ответственный КАК Ответственный
	//	|ИЗ
	//	|	Справочник.ДоговорыКонтрагентов.Ответственные КАК ДоговорыКонтрагентовОтветственные
	//	|ГДЕ
	//	|	ДоговорыКонтрагентовОтветственные.Ссылка.Владелец = &Клиент
	//	|	И ДоговорыКонтрагентовОтветственные.ЦФО = &ЦФО
	//	|	И ДоговорыКонтрагентовОтветственные.ТипОтветственного = &ТипОтветственного
	//	|	И ВЫБОР
	//	|			КОГДА ДоговорыКонтрагентовОтветственные.Ссылка.Автопролонгация
	//	|				ТОГДА ИСТИНА
	//	|			ИНАЧЕ ДоговорыКонтрагентовОтветственные.Ссылка.СрокДействия > &ТекущаяДата
	//	|		КОНЕЦ
	//	|	И ДоговорыКонтрагентовОтветственные.Ссылка.Активный = ИСТИНА
	//	|	И ДоговорыКонтрагентовОтветственные.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	СрокДействия УБЫВ,
	//	|	Дата УБЫВ"; 
	//
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДоговорыКонтрагентовОтветственные.Ссылка КАК Договор,
		|	ДоговорыКонтрагентовОтветственные.Ссылка.Дата КАК Дата,
		|	ДоговорыКонтрагентовОтветственные.Ссылка.СрокДействия КАК СрокДействия,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ДоговорыКонтрагентовОтветственные.Ответственный) = ТИП(Справочник.ГруппыПользователей)
		|			ТОГДА ГруппыПользователейСостав.Пользователь
		|		ИНАЧЕ ДоговорыКонтрагентовОтветственные.Ответственный
		|	КОНЕЦ КАК Ответственный
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов.Ответственные КАК ДоговорыКонтрагентовОтветственные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
		|		ПО ДоговорыКонтрагентовОтветственные.Ответственный = ГруппыПользователейСостав.Ссылка
		|ГДЕ
		|	ДоговорыКонтрагентовОтветственные.Ссылка.Владелец = &Клиент
		|	И ДоговорыКонтрагентовОтветственные.ЦФО = &ЦФО
		|	И ДоговорыКонтрагентовОтветственные.ТипОтветственного = &ТипОтветственного
		|	И ВЫБОР
		|			КОГДА ДоговорыКонтрагентовОтветственные.Ссылка.Автопролонгация
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ДоговорыКонтрагентовОтветственные.Ссылка.СрокДействия > &ТекущаяДата
		|		КОНЕЦ
		|	И ДоговорыКонтрагентовОтветственные.Ссылка.Активный = ИСТИНА
		|	И ДоговорыКонтрагентовОтветственные.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СрокДействия УБЫВ,
		|	Дата УБЫВ";
	
	//Евросиб СубботинВ #117990 20.01.2026 Конец

		
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("ТипОтветственного", ТипОтветственного);
	Запрос.УстановитьПараметр("ЦФО", ЦФО);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Ответственный    = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Ответственный = ВыборкаДетальныеЗаписи.Ответственный;
	КонецЦикла;

	Возврат Ответственный;

КонецФункции	

// ++ Евросиб Дудоров С.В. US 57543 30.01.2023
Процедура АктуализацияОтветственныхПоДоговорамКлиента(ДоговорСсылка, ЦФО = Неопределено
			, ОтветственныйВФормеДоговора = Неопределено, ТипОтветственного = Неопределено, Клиент) Экспорт
	
	Если ТипОтветственного = Неопределено Тогда
		ТипОтветственного = ПредопределенноеЗначение("Перечисление.ТипыОтветственных.ОтветственныйЗаСопровождение");
	КонецЕсли;
	Если ОтветственныйВФормеДоговора = Неопределено 
		или ОтветственныйВФормеДоговора = ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка") Тогда
		Возврат;
	КонецЕсли;   
	
	СтарыйОтветственный = ПолучитьОтветственногоПоДоговору(ДоговорСсылка, ЦФО, ТипОтветственного);
	
	Если СтарыйОтветственный <> ОтветственныйВФормеДоговора Тогда
		
		Если не ЕстьНаличиеАктуальногоДоговораПоЦФОКлиентуПериодуСНовымОтветственным(
			ЦФО, Клиент, ТипОтветственного, ОтветственныйВФормеДоговора) Тогда
			АктуализацияОтветственныхВДокументах(ДоговорСсылка, ЦФО
				,ОтветственныйВФормеДоговора, ТипОтветственного, Клиент, СтарыйОтветственный);		
		КонецЕсли;	
			
	КонецЕсли;	

КонецПроцедуры 

Функция ЕстьНаличиеАктуальногоДоговораПоЦФОКлиентуПериодуСНовымОтветственным(
	ЦФО, Клиент, ТипОтветственного, ОтветственныйВФормеДоговора) 
	
	Возврат ПолучитьОтветственногоДействующегоДоговораКлиента(Клиент, ТипОтветственного, ЦФО)
		= ОтветственныйВФормеДоговора;

КонецФункции	

Процедура АктуализацияОтветственныхВДокументах(ДоговорСсылка, ЦФО = Неопределено
			, ОтветственныйВФормеДоговора = Неопределено, ТипОтветственного = Неопределено
			, Клиент = Неопределено, СтарыйОтветственный)
	
	ВыборкаДокументовРефСцепов = ПолучитьАктуальныеРефСцепыПоКлиентам(ДоговорСсылка, Клиент); 
	
	Пока ВыборкаДокументовРефСцепов.Следующий() Цикл 
		
		ОтложенноеИзменениеСервер.ПоставитьРефСцепВОчередьИзменения(ВыборкаДокументовРефСцепов.РефСцеп, ДоговорСсылка);
			
	КонецЦикла;
		
КонецПроцедуры	

Функция ПолучитьАктуальныеРефСцепыПоКлиентам(ДоговорСсылка, Клиент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РефСцепВагоныРефСцепа.Ссылка КАК РефСцеп
		|ИЗ
		|	Документ.РефСцеп.ВагоныРефСцепа КАК РефСцепВагоныРефСцепа
		|ГДЕ
		|	РефСцепВагоныРефСцепа.Ссылка.РейсЗавершен = ЛОЖЬ
		|	И РефСцепВагоныРефСцепа.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И РефСцепВагоныРефСцепа.Клиент = &Клиент
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РефСцепКонтейнеры.Ссылка
		|ИЗ
		|	Документ.РефСцеп.Контейнеры КАК РефСцепКонтейнеры
		|ГДЕ
		|	РефСцепКонтейнеры.Ссылка.РейсЗавершен = ЛОЖЬ
		|	И РефСцепКонтейнеры.Клиент = &Клиент
		|	И РефСцепКонтейнеры.Ссылка.ПометкаУдаления = ЛОЖЬ";
	
	
	Запрос.УстановитьПараметр("Ложь", Ложь);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

// ++ Евросиб Дудоров С.В. US 61271 30.01.2023
Функция ПОлучитьЕдинственныйДоговорКонтрагента(Контрагент) Экспорт
	мДоговоров = ПолучитьВсеДоговорыКонтрагента(Контрагент);
	Если мДоговоров.Количество() = 1 Тогда
		Возврат мДоговоров[0];
	КонецЕсли;
	Возврат	Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
КонецФункции	

// -- Евросиб Дудоров С.В. US 61271 30.01.2023 в рамках
// -- Евросиб Дудоров С.В. US 57543 30.01.2023

//Евросиб Коханенко Н.А. 07.07.2023 (( #72162 
Функция КонтрагентЯвляетсяДирекциейКонтейнерныхПеревозок(СсылкаНаКонтрагента) Экспорт
	//Евросиб Коханенко Н.А. 02.10.2023 (( #75712 
	//Возврат СсылкаНаКонтрагента = Константы.КонтрагентДирекцияКонтейнерныхПеревозок.Получить();
    Возврат СсылкаНаКонтрагента = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("КонтрагентДирекцияКонтейнерныхПеревозок");
	//Евросиб Коханенко Н.А. 02.10.2023 )) #75712 
КонецФункции
//Евросиб Коханенко Н.А. 07.07.2023 )) #72162 

