//Евросиб Каблов 10.11.2022 ( 52045
//Процедура ДобавитьЗапись(КТК, НаборИзмененныхПолей, Знач Период = неопределено, ИспПроверкиПривязки=Истина) Экспорт
//Евросиб Коханенко Н.А. #63323 02.02.2023 (( 
//Процедура ДобавитьЗапись(КТК, НаборИзмененныхПолей, Знач Период = неопределено, ИспПроверкиПривязки=Истина, ВыводитьСообщения = Истина) Экспорт
Процедура ДобавитьЗапись(КТК, НаборИзмененныхПолей, Знач Период = неопределено, ИспПроверкиПривязки=Истина, ВыводитьСообщения = Истина, ТипИсточникаЗаписи = Неопределено) Экспорт
//Евросиб Коханенко Н.А. #63323 02.02.2023 )) 
//Процедура ДобавитьЗапись(КТК, НаборИзмененныхПолей, Знач Период = неопределено, ИспПроверкиПривязки=Истина, ВыводитьСообщения = Истина) Экспорт
//Евросиб Каблов 10.11.2022 )	
	Если Период = неопределено Тогда Период = ТекущаяДата(); КонецЕсли;
	
	ДоступноПраво_ИзменениеСобственника = РольДоступна("армктк_ИзменениеСобственникаКТК") ИЛИ РольДоступна("ПолныеПрава");
	ДоступноПраво_ИзменениеСВВ = РольДоступна("армктк_ИзменениеСВВ") ИЛИ РольДоступна("ПолныеПрава");
	ДоступноПраво_ИзменениеВЭксплуатации = РольДоступна("арм_ктк_ИзменениеВЭксплуатации") ИЛИ РольДоступна("ПолныеПрава");
	ДоступноПраво_арм_ктк_РазрешитьИзменениеДатыПриемаИВозврата = РольДоступна("арм_ктк_РазрешитьИзменениеДатыПриемаИВозврата") Или РольДоступна("ПолныеПрава");
	//Евросиб Каблов 15.10.2021 ( TASK 39044
	ДоступноПраво_КонтейнернойГруппы = РольДоступна("арм_ктк_ПраваКонтейнернойГруппы") Или РольДоступна("ПолныеПрава");
	//Евросиб Каблов 15.10.2021 )
	МЗ = РегистрыСведений.стоки_ТекущиеДанные.СоздатьМенеджерЗаписи();
	
	// восстанавливаем данные предыдущией записи
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(&Период, КТК = &КТК) КАК стоки_ТекущиеДанныеСрезПоследних";
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("КТК", КТК);
	Ответ = Запрос.Выполнить().Выбрать();
	Если Ответ.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(МЗ, Ответ);
	// Евросиб(ДИТ) BUG 99736 ТА 99737 Сержантова А.С. Начало: 22.01.2025
	//если делается первая запись по КТК и нет в изменяемых полях статуса, то ставим статус Свободен
	ИначеЕсли НаборИзмененныхПолей.Получить("тек_Статус") = Неопределено 
		или НаборИзмененныхПолей.Получить("тек_Статус") = Перечисления.СтатусыКТК.ПустаяСсылка() Тогда 
		МЗ.тек_Статус = Перечисления.СтатусыКТК.Свободен;
	// Евросиб(ДИТ) BUG 99736 ТА 99737 Сержантова А.С. Конец: 22.01.2025
	КонецЕсли;
	
	МЗ.Период = Период;
	МЗ.ГУИДЗаписи = Строка(Новый УникальныйИдентификатор);
	МЗ.КТК = КТК;
	Если НЕ ЗначениеЗаполнено(МЗ.ПорядковыйНомерЦиклаАрендыКТК) Тогда 
		МЗ.ПорядковыйНомерЦиклаАрендыКТК = 1; 
	КонецЕсли;  
	// ДИТ US 79304 ТА 79312 Сержантова А.С. Начало: 17.04.2024
	МЗ.тек_Пользователь = Пользователи.ТекущийПользователь();	
	// ДИТ US 79304 ТА 79312 Сержантова А.С. Конец: 17.04.2024
	ИсточникЗаписи = НаборИзмененныхПолей.Получить("ИсточникЗаписи");
	
	//Евросиб Каблов 16.08.2022 ( US41519
	КлиентскийКТКизЗаявки = НаборИзмененныхПолей.Получить("КлиентскийКТКизЗаявки");
	Если КлиентскийКТКизЗаявки = Неопределено Тогда
		КлиентскийКТКизЗаявки = Ложь;
	КонецЕсли;
	//Евросиб Каблов 16.08.2022 )
	
	СписокПолейКоторыеЗапрещеноМенятьИзЗаявкиИАСУТК = Новый Массив;
	//Евросиб Каблов 16.08.2022 ( US41519
	//СписокПолейКоторыеЗапрещеноМенятьИзЗаявкиИАСУТК.Добавить("тек_Собственник");
	//СписокПолейКоторыеЗапрещеноМенятьИзЗаявкиИАСУТК.Добавить("тек_ВидСобственности");
	Если Не КлиентскийКТКизЗаявки Тогда
		СписокПолейКоторыеЗапрещеноМенятьИзЗаявкиИАСУТК.Добавить("тек_Собственник");
		СписокПолейКоторыеЗапрещеноМенятьИзЗаявкиИАСУТК.Добавить("тек_ВидСобственности");
	КонецЕсли;
	//Евросиб Каблов 16.08.2022 )
	СписокПолейКоторыеЗапрещеноМенятьИзЗаявкиИАСУТК.Добавить("тек_СрокВозврата");
	СписокПолейКоторыеЗапрещеноМенятьИзЗаявкиИАСУТК.Добавить("тек_ДатаПриемаВПользование");
	
	ПредполагаемаяДатаПриемаВПользование = неопределено;
	
	//// Шейко О.Е. 05.05.2021 (Изменение дат для формирования Аренды КТК)
	Если ИспПроверкиПривязки Тогда
		
		// Если меняются даты "тек_ДатаПриемаВПользование" и "тек_СрокВозврата", то появляется новый период использования 
		// привязки к старому периоду должны сохраниться в полном объеме
		// Если появляется информация о ремонте, то обновим все привязки, пересекающиеся с с периодом ремонта
		ИзмНачалоРемонта = НаборИзмененныхПолей.Получить("тек_НачалоРемонта");
		ИзмОкончаниеРемонта = НаборИзмененныхПолей.Получить("тек_ОкончаниеРемонта");
		Если ИзмНачалоРемонта <> Неопределено
			ИЛИ ИзмОкончаниеРемонта <> Неопределено Тогда
			
			ПерепривязкаВыйти = Ложь;
			НовЗнНачалоРемонта = ?(ИзмНачалоРемонта = Неопределено, МЗ.тек_НачалоРемонта, ИзмНачалоРемонта);
			НовЗнОкончаниеРемонта = ?(ИзмОкончаниеРемонта = Неопределено, МЗ.тек_ОкончаниеРемонта, ИзмОкончаниеРемонта);
			
			// ДИТ Поморцева Т.П. Задача 38715 16.09.21. начало (временно)
			//Если ЗначениеЗаполнено(МЗ.тек_НачалоРемонта) И МЗ.тек_НачалоРемонта <> НовЗнНачалоРемонта Тогда
			//	
			//	КонРемонта = ?(МЗ.тек_ОкончаниеРемонта = Дата(1,1,1), Дата(2099,01,01), МЗ.тек_ОкончаниеРемонта);
			//	РегистрыСведений.стоки_КлиентскоеОперирование.ПоискПривязокПТУ_и_запускПересчетаАренды(МЗ.тек_НачалоРемонта, КонРемонта);
			//	
			//КонецЕсли;
			//
			//Если ЗначениеЗаполнено(НовЗнНачалоРемонта) И МЗ.тек_НачалоРемонта <> НовЗнНачалоРемонта Тогда
			//
			//	КонРемонта = ?(НовЗнОкончаниеРемонта = Дата(1,1,1), Дата(2099,01,01), НовЗнОкончаниеРемонта);
			//	РегистрыСведений.стоки_КлиентскоеОперирование.ПоискПривязокПТУ_и_запускПересчетаАренды(НовЗнНачалоРемонта, КонРемонта);
			//
			//КонецЕсли; 
			// ДИТ Поморцева Т.П. Задача 38715 16.09.21. конец (временно)
			
		КонецЕсли;
		
	КонецЕсли;
	
	//Евросиб Каблов 15.10.2021 ( TASK 39046
	Если Не ДоступноПраво_КонтейнернойГруппы И ЗначениеЗаполнено(МЗ.Инвентаризация) Тогда
		ЗапретитьРедактированиеСЗаполненнойИнвентаризацией = Истина;
	Иначе
		ЗапретитьРедактированиеСЗаполненнойИнвентаризацией = Ложь;
	КонецЕсли;	
	
	ОбязательныеПоля = Новый СписокЗначений;
	ОбязательныеПоля.Добавить("тек_ДатаПриемаВПользование", "Дата приема в пользование");
	ОбязательныеПоля.Добавить("тек_СрокВозврата", "Срок возврата");
	ОбязательныеПоля.Добавить("тек_ВидСобственности", "Вид собственности");
	ОбязательныеПоля.Добавить("тек_Собственник", "Собственник");
	ОбязательныеПоля.Добавить("комм_Ставка", "Ставка");
	ОбязательныеПоля.Добавить("комм_Валюта", "Валюта");
	ОбязательныеПоля.Добавить("тек_ПунктыОкончСдачи", "Пункты оконч. сдачи");
	//Евросиб Каблов 15.10.2021 ) 
	
	//Евросиб(ДИТ), Беляев СЮ, BUG 95529 / TA 95530, 18-11-2024, начало
	тек_ДатаСдачиВСток_ДО = МЗ.тек_ДатаСдачиВСток;
	//Евросиб(ДИТ), Беляев СЮ, BUG 95529 / TA 95530, 18-11-2024, конец
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0400614, 29-05-2025, начало
	тек_Релиз_ДО = МЗ.тек_Релиз;
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0400614, 29-05-2025, конец
	
	Для каждого Поле из НаборИзмененныхПолей Цикл
		
		ОтказатьсяОтИзменения = Ложь;
		Для каждого Стр8 из СписокПолейКоторыеЗапрещеноМенятьИзЗаявкиИАСУТК Цикл
			Если Поле.Ключ = Стр8 И (СтрНайти(ИсточникЗаписи, "АСУТК") > 0 ИЛИ 
				//Евросиб Коханенко Н.А. #63323 02.02.2023 (( 
				//СтрНайти(ИсточникЗаписи, "Заявка") > 0
				ТипИсточникаЗаписи = Тип("ДокументСсылка.Заявка")
				//Евросиб Коханенко Н.А. #63323 02.02.2023 )) 
				) Тогда ОтказатьсяОтИзменения = Истина; КонецЕсли;
		КонецЦикла;
		//Евросиб Каблов 15.10.2021 ( TASK 39046
		Если Не ОтказатьсяОтИзменения И ЗапретитьРедактированиеСЗаполненнойИнвентаризацией И СписокПолейКоторыеЗапрещеноМенятьИзЗаявкиИАСУТК.Найти(Поле.Ключ) <> Неопределено Тогда
			ОтказатьсяОтИзменения = Истина;
		КонецЕсли;		
		//Евросиб Каблов 15.10.2021 )
		Если ОтказатьсяОтИзменения Тогда Продолжить; КонецЕсли;
		
		Если Поле.Ключ = "тек_Сток" И ЗначениеЗаполнено(МЗ[Поле.Ключ]) И НЕ ЗначениеЗаполнено(Поле.Значение) И НЕ ЗначениеЗаполнено(МЗ.тек_СтокВзятия) И НЕ ЗначениеЗаполнено(МЗ.тек_ГородВзятия) Тогда 
			МЗ.тек_СтокВзятия = МЗ.тек_Сток;
						
			// Евросиб Фролов (06.04.2022 Task №46925
			//МЗ.тек_ГородВзятия = МЗ.тек_Сток.Родитель; было
			РеквизитыСтокаВзятия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(МЗ.тек_СтокВзятия, "Родитель, Родитель.Тип");
			Город = РеквизитыСтокаВзятия.Родитель;
			ТипГорода = РеквизитыСтокаВзятия.РодительТип;
			//Евросиб - АСуслов 05.05.2023 11:36:30 #67492
			//(
			//Если ТипГорода <> Справочники.ТипыЛокаций.Субъект
			Если ТипГорода <> Справочники.ТипыЛокаций.НаселенныйПункт
			//)
			//Евросиб - АСуслов 05.05.2023 11:36:36 #67492
				И ЗначениеЗаполнено(Город) Тогда
				Город = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Город, "Родитель");
			КонецЕсли;
			МЗ.тек_ГородВзятия = Город;
			// Евросиб Фролов)
		КонецЕсли;
		Если Поле.Ключ = "тек_ДатаПриемаВСток" ИЛИ Поле.Ключ = "тек_ДатаВзятияИзСтока" ИЛИ Поле.Ключ = "тек_ДатаПриемаВПользование" ИЛИ Поле.Ключ = "тек_ДатаСдачиВСток" Тогда
			Если Поле.Значение > ТекущаяДата() Тогда Продолжить; КонецЕсли;
		КонецЕсли;
		
		Если Поле.Ключ = "тек_ДатаВзятияИзСтока" И ЗначениеЗаполнено(Поле.Значение) И НЕ ЗначениеЗаполнено(МЗ.тек_ДатаПриемаВПользование) Тогда
			ПредполагаемаяДатаПриемаВПользование = Поле.Значение;
		КонецЕсли;
		
		Если Поле.Ключ = "тек_ДатаПриемаВПользование" И НЕ ЗначениеЗаполнено(МЗ[Поле.Ключ]) И ЗначениеЗаполнено(Поле.Значение) Тогда
			МЗ.тек_ВЭксплуатации = Истина;
		КонецЕсли;
		
		//Евросиб - АСуслов 12.10.2021 16:52:09 #40131
		//(
		Если Поле.Ключ = "тек_ДатаПриемаВПользование" 
			И ЗначениеЗаполнено(МЗ[Поле.Ключ]) 
			И ЗначениеЗаполнено(Поле.Значение) 
			И МЗ[Поле.Ключ] <> Поле.Значение 
			И НЕ ДоступноПраво_арм_ктк_РазрешитьИзменениеДатыПриемаИВозврата Тогда
		//)
		//Евросиб - АСуслов 12.10.2021 16:52:10 #40131
			
			Сообщить("Нельзя изменить дату приема в пользование для КТК " + МЗ.КТК + " . Изменения вносятся только в карточку КТК.");
			Возврат;
			
		КонецЕсли;

		
		//Евросиб - АСуслов 16.09.2021 12:04:48 #39008
		//(
		//отключаем только в режиме сдачи ктк
		//Если Поле.Ключ = "тек_ДатаСдачиВСток" И НЕ ЗначениеЗаполнено(МЗ[Поле.Ключ]) И ЗначениеЗаполнено(Поле.Значение) Тогда
		//	МЗ.тек_ВЭксплуатации = Ложь;
		//КонецЕсли;
		//)
		//Евросиб - АСуслов 16.09.2021 12:04:50 #39008
		
		Если Поле.Ключ = "тек_НазначенныйРейс" И МЗ[Поле.Ключ] <> Поле.Значение Тогда
			МЗ.тек_СрокАктуальностиРейса = ТекущаяДата() + 14*24*3600;
		КонецЕсли;
		
		//Евросиб Каблов 16.08.2022 ( US41519
		//Если Поле.Ключ = "тек_Собственник" И НЕ ДоступноПраво_ИзменениеСобственника Тогда
		Если Поле.Ключ = "тек_Собственник" И НЕ ДоступноПраво_ИзменениеСобственника И Не КлиентскийКТКизЗаявки Тогда
		//Евросиб Каблов 16.08.2022 )
			Сообщить("Нет права изменения собственника. Заблокировано.");
			Продолжить;
		КонецЕсли;
		
		//Евросиб - АСуслов 12.10.2021 10:53:44 #0244522 40601
		//(
		Если Поле.Ключ = "тек_ВЭксплуатации" И НЕ ДоступноПраво_ИзменениеВЭксплуатации 
			И НЕ ДоступноПраво_арм_ктк_РазрешитьИзменениеДатыПриемаИВозврата Тогда  // Евросиб Фролов (08.11.2021 TASK №41220
			Сообщить("Нет права изменения признака «в эксплуатации». Заблокировано.");
			Продолжить;
		КонецЕсли;
		//)
		//Евросиб - АСуслов 12.10.2021 10:54:08 #0244522 40601
		
		Если (Поле.Ключ = "тек_СВВ" ИЛИ Поле.Ключ = "тек_НомерТДТ" ИЛИ Поле.Ключ = "тек_КомментарийСВВ" ИЛИ Поле.Ключ = "тек_СправкаЦФТО" ИЛИ Поле.Ключ = "тек_РешениеТО") И НЕ ДоступноПраво_ИзменениеСВВ Тогда
			Сообщить("Нет права изменения СВВ. Заблокировано.");
			Продолжить;
		КонецЕсли;
		
		//Евросиб Каблов 15.10.2021 ( TASK 39046
		Если Не ДоступноПраво_КонтейнернойГруппы Тогда 
			ОбязательноеПоле = ОбязательныеПоля.НайтиПоЗначению(Поле.Ключ);
			Если ОбязательноеПоле <> Неопределено Тогда
				Если Не (ОбязательноеПоле.Значение = "тек_ДатаПриемаВПользование" И ДоступноПраво_арм_ктк_РазрешитьИзменениеДатыПриемаИВозврата) 
					И Не (ОбязательноеПоле.Значение = "тек_ВидСобственности" И КлиентскийКТКизЗаявки) Тогда
					// ДИТ #0298336 Евсенкин М.А. Начало: 08.02.2023
					// Было:
					//ТекстСообщения = СтрШаблон("Нет права изменения поля ""%1"". Заблокировано.", ОбязательноеПоле.Представление);
					//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					// ДИТ #0298336 Евсенкин М.А. Конец: 08.02.2023
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;		
		//Евросиб Каблов 15.10.2021 )
		
		МЗ[Поле.Ключ] = Поле.Значение;
	КонецЦикла;
	
	// Евросиб Фролов (24.11.2021 Ticket№ 0248986
	// Беккер: при заполнении поля "Взятие из стока" отключить автоматическое проставление
	// этой же даты в поле "Прием в пользование" если оно не заполнено.
	// Закомментировал
	//Если НЕ ЗначениеЗаполнено(МЗ.тек_ДатаПриемаВПользование) И ПредполагаемаяДатаПриемаВПользование <> неопределено Тогда 		
	//	МЗ.тек_ДатаПриемаВПользование = ПредполагаемаяДатаПриемаВПользование;
	//	МЗ.тек_ВЭксплуатации = Истина;		
	//КонецЕсли;
	// Евросиб Фролов)
	
	// Проверка заполненности строки записи
	МассивПроверяемыхПолей = Новый Массив;
	МассивПроверяемыхПолей.Добавить("тек_ДатаПриемаВПользование");
	МассивПроверяемыхПолей.Добавить("тек_СледНазначения");
	МассивПроверяемыхПолей.Добавить("след_СледующаяЛокация");
	МассивПроверяемыхПолей.Добавить("тек_ПунктыОкончСдачи");
	МассивПроверяемыхПолей.Добавить("тек_Собственник");
	МассивПроверяемыхПолей.Добавить("тек_СрокВозврата");
	МассивПроверяемыхПолей.Добавить("тек_СтокСдачи");
	МассивПроверяемыхПолей.Добавить("тек_ИнструкцияПоСдаче");
	МассивПроверяемыхПолей.Добавить("комм_Ставка");
	ВсеПоляЗаполнены = Истина;
	Для каждого Стр2 из МассивПроверяемыхПолей Цикл
		ВсеПоляЗаполнены = ВсеПоляЗаполнены И ЗначениеЗаполнено(МЗ[Стр2]);
	КонецЦикла;
	МЗ.Недозаполнено = НЕ ВсеПоляЗаполнены;
	
	ИзменитьПериодСтроки(КТК, МЗ.Период); // Евросиб Фролов (08.11.2021 TASK №41220
	
	МЗ.Записать(Истина);  
	
	// ДИТ US 79304 ТА 79312 Сержантова А.С. Начало: 17.04.2024
	//Если ЗначениеЗаполнено(МЗ.ГУИДЗаписиПредыдущегоЦикла) Тогда
	//Евросиб(ДИТ), Беляев СЮ, BUG 95529 / TA 95530, 18-11-2024, начало
	//ИзмененаДатаСдачиВСток = тек_ДатаСдачиВСток_ДО <> МЗ.тек_ДатаСдачиВСток; 
	//Если ЗначениеЗаполнено(МЗ.ГУИДЗаписиПредыдущегоЦикла) ИЛИ ИзмененаДатаСдачиВСток Тогда
	//Евросиб(ДИТ), Беляев СЮ, BUG 95529 / TA 95530, 18-11-2024, конец
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0400614, 29-05-2025, начало
	ИзмененРелизИлиДатаСдачиВСток = (тек_ДатаСдачиВСток_ДО <> МЗ.тек_ДатаСдачиВСток) 
										ИЛИ (тек_Релиз_ДО <> МЗ.тек_Релиз И ЗначениеЗаполнено(МЗ.тек_ДатаСдачиВСток));
	Если ЗначениеЗаполнено(МЗ.ГУИДЗаписиПредыдущегоЦикла) ИЛИ ИзмененРелизИлиДатаСдачиВСток Тогда
	//Евросиб(ДИТ), Беляев СЮ, Ticket#0400614, 29-05-2025, конец
    	ОтложенноеИзменениеСервер.ПоставитьСвязанныеОбъектыВОчередьИзменения(МЗ);	
	КонецЕсли;
	// ДИТ US 79304 ТА 79312 Сержантова А.С. Конец: 17.04.2024
	
	// SIV ЧТЗ "Циклы аренды КТК"
	Если ЗначениеЗаполнено(МЗ.тек_ДатаСдачиВСток) Тогда
		
		РЕЗЪ = РегистрыСведений.стоки_КлиентскоеОперирование.ПопытатьсяВписатьДатуОкончанияВЦиклы(МЗ.КТК, МЗ.тек_ДатаСдачиВСток);
		Если РЕЗЪ = Ложь Тогда
			//Евросиб Каблов 10.11.2022 ( 52045
			Если ВыводитьСообщения Тогда
			//Евросиб Каблов 10.11.2022 )
				Сообщить("Не удалось закрыть клиентский цикл пользования для КТК " + МЗ.КТК);
			//Евросиб Каблов 10.11.2022 ( 52045
			КонецЕсли;
			//Евросиб Каблов 10.11.2022 )
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(МЗ.тек_ДатаПриемаВСток) Тогда
		
		РЕЗЪ = РегистрыСведений.стоки_КлиентскоеОперирование.ПопытатьсяВписатьДатуОкончанияВЦиклы(МЗ.КТК, МЗ.тек_ДатаПриемаВСток);
		Если РЕЗЪ = Ложь Тогда
			//Евросиб Каблов 10.11.2022 ( 52045
			Если ВыводитьСообщения Тогда
			//Евросиб Каблов 10.11.2022 )
				Сообщить("Не удалось закрыть клиентский цикл пользования для КТК " + МЗ.КТК);
			//Евросиб Каблов 10.11.2022 ( 52045
			КонецЕсли;
			//Евросиб Каблов 10.11.2022 )
		КонецЕсли;
		
	КонецЕсли;
	//Евросиб - АСуслов 13.08.2024 15:07:09 #89911
	//(
	Если НЕ ТипИсточникаЗаписи = Тип("ДокументСсылка.РелизСобственника") Тогда
		Если ЗначениеЗаполнено(мз.тек_Релиз) Тогда  
			
			РегистрыСведений.стоки_ТекущиеДанные.ЗаписатьОстатокКТККСдаче(мз.тек_Релиз);
			
		КонецЕсли;
		
	КонецЕсли;
	//)
	//Евросиб - АСуслов 13.08.2024 15:07:12 #89911	
	
	//Если ЗначениеЗаполнено(МЗ.тек_ДатаСдачиВСток) И ЗначениеЗаполнено(МЗ.тек_Сток) И ЗначениеЗаполнено(МЗ.тек_ПунктыОкончСдачи) Тогда
	//	// заполненность этих полей является основанием для регистрации факта сдачи КТК в сток.
	//	// вариианта 2: либо мы сдаем в сток из списка "пункты окончательной сдачи", либо мы сдаем в какой-то другой сток
	//	
	//	Если МЗ.тек_ПунктыОкончСдачи.Локации.НайтиСтроки(Новый Структура("Локация", МЗ.тек_Сток)).Количество() > 0 Тогда
	//		// вариант 1: мы сдаем КТК в сток из пунктов окончательной сдачи
	//		МЗ2 = РегистрыСведений.стоки_ТекущиеДанные.СоздатьМенеджерЗаписи();
	//		ЗаполнитьЗначенияСвойств(МЗ2, МЗ);
	//		МЗ2.ГУИДЗаписи = Строка(Новый УникальныйИдентификатор);
	//		МЗ2.ПорядковыйНомерЦиклаАрендыКТК = МЗ2.ПорядковыйНомерЦиклаАрендыКТК + 1;
	//		МЗ2.тек_Статус = Перечисления.СтатусыКТК.Возвращен;
	//		МЗ2.тек_СрокВозврата = неопределено;
	//		МЗ2.тек_ДатаВзятияИзСтока = неопределено;
	//		МЗ2.тек_ДатаПриемаВПользование = неопределено;
	//		МЗ2.тек_ЗабратьДо = неопределено;
	//		МЗ2.тек_Релиз = неопределено;
	//		МЗ2.тек_НаСлежении = Ложь;
	//		МЗ2.комм_Ставка = неопределено;
	//		МЗ2.тек_СВВ = неопределено;
	//		МЗ2.тек_НомерТДТ = неопределено;
	//		МЗ2.след_СледующаяЛокация = неопределено;
	//		МЗ2.тек_СтокСдачи = неопределено;
	//		МЗ2.тек_ИнструкцияПоСдаче = неопределено;
	//		МЗ2.тек_СледНазначения = неопределено;
	//		МЗ2.тек_ПунктыОкончСдачи = неопределено;
	//		МЗ2.тек_СтокВзятия = неопределено;
	//		МЗ2.тек_ГородВзятия = неопределено;
	//		МЗ2.Период = МЗ2.Период + 1;
	//		МЗ2.Записать(Истина);
	//		
	//	Иначе
	//		// вариант 2: мы сдаем КТК в другой сток
	//		МЗ2 = РегистрыСведений.стоки_ТекущиеДанные.СоздатьМенеджерЗаписи();
	//		ЗаполнитьЗначенияСвойств(МЗ2, МЗ);
	//		МЗ2.ГУИДЗаписи = Строка(Новый УникальныйИдентификатор);
	//		МЗ2.тек_ДатаПриемаВСток = МЗ.тек_ДатаСдачиВСток;
	//		МЗ2.тек_Статус = Перечисления.СтатусыКТК.Свободен;
	//		МЗ2.тек_ДатаВзятияИзСтока = неопределено;
	//		МЗ2.след_СледующаяЛокация = неопределено;
	//		МЗ2.тек_СледНазначения = неопределено;
	//		МЗ2.Период = МЗ2.Период + 1;
	//		МЗ2.Записать(Истина);
	//		
	//	КонецЕсли;
	//	
	//	
	//КонецЕсли;
	
КонецПроцедуры

// Евросиб Фролов (08.11.2021 TASK №41220
Процедура ИзменитьПериодСтроки(КТК, Период) Экспорт
	// Найдем строку с периодом переданным периодом записи и если она есть - сдвинем ее на 1 сек.
	
	Запись = РегистрыСведений.стоки_ТекущиеДанные.СоздатьМенеджерЗаписи();
	Запись.Период = Период;
	Запись.КТК = КТК;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Период = Период + 1;
	КонецЕсли;
	
КонецПроцедуры
// Евросиб Фролов )

//ДИТ, Беляев СЮ, BUG 79840/TASK 79870, 24-01-2024, начало  
// Евросиб(ДИТ) US 85642 ТА 86102 Сержантова А.С. 14.06.2024
// Добавлен Релиз в параметры
Функция ПолучитьТекущиеПериодыПоКонтейнерам( ВходящиеЗначения, ИмяПоля, Период = Неопределено, Релиз = Неопределено) Экспорт
	Результат = Новый Соответствие();
	
	Если Период = Неопределено Тогда
		Период = ТекущаяДата();
	КонецЕсли;
	
	МассивКТК = Новый Массив;
	Если ТипЗнч(ВходящиеЗначения) = Тип("Массив") Тогда
		Для Каждого ЭлементМассива Из ВходящиеЗначения Цикл
			Если ТипЗнч(ЭлементМассива) = Тип("Структура") Тогда
				МассивКТК.Добавить(ЭлементМассива.КТК);
			Иначе
				МассивКТК.Добавить(ЭлементМассива);
			КонецЕсли;
		КонецЦикла;
	Иначе
		МассивКТК.Добавить(ВходящиеЗначения);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	стоки_ТекущиеДанныеСрезПоследних.КТК КАК КТК,
	               |	стоки_ТекущиеДанныеСрезПоследних.тек_ДатаСдачиВСток КАК Дата
	               |ИЗ   
				   // Евросиб(ДИТ) US 85642 ТА 86102 Сержантова А.С. Начало: 14.06.2024
				   // Было:
				   //|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(&Период, КТК В (&МассивКТК)) КАК стоки_ТекущиеДанныеСрезПоследних"; 
				   //Стало:
				   |	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(&Период, КТК В (&МассивКТК) 
				   |				И тек_Релиз = &Релиз) КАК стоки_ТекущиеДанныеСрезПоследних";
				   // Евросиб(ДИТ) US 85642 ТА 86102 Сержантова А.С. Конец: 14.06.2024
	
    Запрос.Текст = СтрЗаменить(ТекстЗапроса, "тек_ДатаСдачиВСток", ИмяПоля);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("МассивКТК", МассивКТК);  
	// Евросиб(ДИТ) US 85642 ТА 86102 Сержантова А.С. Начало: 14.06.2024
	Если Релиз <> Неопределено Тогда
		Запрос.УстановитьПараметр("Релиз", Релиз);
	Иначе	
	    Запрос.Текст = СтрЗаменить(Запрос.Текст, "И тек_Релиз = &Релиз", "");
	КонецЕсли;
	// Евросиб(ДИТ) US 85642 ТА 86102 Сержантова А.С. Конец: 14.06.2024
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат.Вставить(ВыборкаДетальныеЗаписи.КТК, ВыборкаДетальныеЗаписи.Дата);
	КонецЦикла;
	Возврат Результат;
КонецФункции
//ДИТ, Беляев СЮ, BUG 79840/TASK 79870, 24-01-2024, конец  

Процедура ЗаписатьОстатокКТККСдаче(РелизСобственника) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(стоки_ТекущиеДанныеСрезПоследних.КТК) КАК ОстатокКТККВозврату,
	|	стоки_ТекущиеДанныеСрезПоследних.тек_Релиз КАК тек_Релиз
	|ИЗ
	|	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних КАК стоки_ТекущиеДанныеСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РелизСобственника.Номинации КАК РелизСобственникаНоминации
	|		ПО (РелизСобственникаНоминации.Контейнер = стоки_ТекущиеДанныеСрезПоследних.КТК)
	|			И (РелизСобственникаНоминации.Ссылка = стоки_ТекущиеДанныеСрезПоследних.тек_Релиз)
	|			И (РелизСобственникаНоминации.ДатаВзятия <> ДАТАВРЕМЯ(1, 1, 1))
	|			И (РелизСобственникаНоминации.Ссылка = &Релиз)
	|ГДЕ
	|	стоки_ТекущиеДанныеСрезПоследних.тек_ДатаСдачиВСток = ДАТАВРЕМЯ(1, 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	стоки_ТекущиеДанныеСрезПоследних.тек_Релиз";
	
	Запрос.УстановитьПараметр("Релиз", РелизСобственника);
	
	//Евросиб Коханенко Н.А. 14.10.2024 (( #91977 
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	//Записать в РС ДанныеДляРелизаСобственника 
	//	МенеджерЗаписи = РегистрыСведений.ДанныеПоРелизамСобственника.СоздатьМенеджерЗаписи(); 
	//	МенеджерЗаписи.РелизСобственника = РелизСобственника; 
	//	МенеджерЗаписи.Прочитать();
	//	Если НЕ МенеджерЗаписи.Выбран() Тогда
	//		МенеджерЗаписи.РелизСобственника = РелизСобственника; 
	//	КонецЕсли;
	//	МенеджерЗаписи.ОстатокКТККВозврату = Выборка.ОстатокКТККВозврату;
	//	МенеджерЗаписи.Записать();
	//КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОстатокКТККВозврату = 0;
	Иначе 
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ОстатокКТККВозврату = Выборка.ОстатокКТККВозврату;
	КонецЕсли; 
	
	МенеджерЗаписи = РегистрыСведений.ДанныеПоРелизамСобственника.СоздатьМенеджерЗаписи(); 
	МенеджерЗаписи.РелизСобственника = РелизСобственника; 
	МенеджерЗаписи.Прочитать();
	Если НЕ МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.РелизСобственника = РелизСобственника; 
	КонецЕсли;
	МенеджерЗаписи.ОстатокКТККВозврату = ОстатокКТККВозврату;
	МенеджерЗаписи.Записать();
	//Евросиб Коханенко Н.А. 14.10.2024 )) #91977 

КонецПроцедуры
 
//Евросиб(ДИТ), Беляев СЮ, US 93500 / TA 93958, 14-11-2024, начало
// Функция - Получить текущие данные по контейнерам
//
// Параметры:
//  КТК			 - 	Контейнеры - Можно передавать Контейнер или массив Контейнеров
//  ИменаПолей	 - 	Строка - Список имен запрашиваемых полей через запятую
//  Период	 - 	Дата - Дата среза регистра, если не указано, то будет установлена ТекущаяДата()
// 
// Возвращаемое значение:
// Соответствие  - КТК и Структура с данными по запрашиваемым полям
//
Функция ПолучитьТекущиеДанныеПоКонтейнерам(КТК, ИменаПолей, Период = Неопределено) Экспорт
	Результат = Новый Соответствие();
	
	Если Период = Неопределено Тогда
		Период = ТекущаяДата();
	КонецЕсли;
	
	//КТК
	МассивКТК = Новый Массив;
	Если ТипЗнч(КТК) = Тип("Массив") Тогда
		Для Каждого ЭлементМассива Из КТК Цикл
			Если ТипЗнч(ЭлементМассива) = Тип("Структура") Тогда
				МассивКТК.Добавить(ЭлементМассива.КТК);
			Иначе
				МассивКТК.Добавить(ЭлементМассива);
			КонецЕсли;
		КонецЦикла;
	Иначе
		МассивКТК.Добавить(КТК);
	КонецЕсли;
	
	//Имена полей
	МассивИмеПолей = СтрРазделить(ИменаПолей, ",");
	ТекстЗапросаПолей = "";
	СтруктураЗначенийПолей = Новый Структура;
	
	Для Каждого ИмяПоля Из МассивИмеПолей Цикл
		ТекстЗапросаПолей = 
			ТекстЗапросаПолей + ?(ПустаяСтрока(ТекстЗапросаПолей), "", ",") + "
			|	" + ИмяПоля + " КАК " + ИмяПоля;
		СтруктураЗначенийПолей.Вставить(ИмяПоля);
	КонецЦикла;
	
	//Запрос
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	стоки_ТекущиеДанныеСрезПоследних.КТК КАК КТК,
	               |	&ТекстЗапросаПолей
	               |ИЗ
	               |	РегистрСведений.стоки_ТекущиеДанные.СрезПоследних(&Период, КТК В (&МассивКТК)) КАК стоки_ТекущиеДанныеСрезПоследних";
	
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаПолей", ТекстЗапросаПолей);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("МассивКТК", МассивКТК);  
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураЗначенийПолей, ВыборкаДетальныеЗаписи);
		Результат.Вставить(ВыборкаДетальныеЗаписи.КТК, СтруктураЗначенийПолей);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции
//Евросиб(ДИТ), Беляев СЮ, US 93500 / TA 93958, 14-11-2024, конец