#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	// Евросиб Фролов (01.11.2021 Ticket№ 0246734
	// Беккер: право удалять строки в карточке КТК  должны быть доступны сотрудникам ролью "Аудитор"	
	// Удаление записей
	Если ЭтотОбъект.Количество() = 0 И ЭтотОбъект.Модифицированность() = Истина Тогда
		//ДИТ Авдеева В.С. 20.04.2022 45700 Начало 
		//было
		//РазрешитьРедактированиеИнвентаризацииКТК = Пользователи.РолиДоступны("dc_РазрешитьРедактированиеИнвентаризацииКТК");										
		//стало
		РазрешитьРедактированиеИнвентаризацииКТК = Пользователи.РолиДоступны("dc_РазрешитьРедактированиеИнвентаризацииЦиклыАрендыКТК");										
		//ДИТ Авдеева В.С. 20.04.2022 45700 Начало 
		
		Если НЕ РазрешитьРедактированиеИнвентаризацииКТК Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Удаление записей доступно только пользоваелям с правами аудиторов.'"),,,, Отказ);
		КонецЕсли;
		
		//Евросиб(ДИТ), Беляев СЮ, BUG 104690 / TA 106027, 28-03-2025, начало
		Если Не Отказ Тогда
			Если ЭтотОбъект.Отбор.Найти("КТК") <> Неопределено
				И ЭтотОбъект.Отбор.Найти("Период") <> Неопределено Тогда
				МенеджерЗаписи = РегистрыСведений.стоки_ТекущиеДанные.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Период = ЭтотОбъект.Отбор.Период.Значение;
				МенеджерЗаписи.КТК = ЭтотОбъект.Отбор.КТК.Значение;
				МенеджерЗаписи.Прочитать();
				
				Если ЗначениеЗаполнено(МенеджерЗаписи.тек_Релиз) Тогда
					ОтложенноеИзменениеСервер.ПоставитьОбъектВОчередьИзменения(МенеджерЗаписи.тек_Релиз, Перечисления.ТипыИсточниковОтложеннойЗаписиВзаимосвязанныхОбъектов.РегистрСведенийСтокиТекущиеДанные);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		//Евросиб(ДИТ), Беляев СЮ, BUG 104690 / TA 106027, 28-03-2025, конец
	КонецЕсли;	
	// Евросиб Фролов)
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	//Евросиб - АСуслов 13.08.2024 15:07:51 #89911
	//(
	//Евросиб Коханенко Н.А. 10.07.2024 (( #88014 
	//Для Каждого ТекЗапись Из ЭтотОбъект Цикл
	//	Если ЗначениеЗаполнено(ТекЗапись.тек_Релиз) Тогда  
	//		
	//		МенеджерЗаписи = РегистрыСведений.ДанныеПоРелизамСобственника.СоздатьМенеджерЗаписи(); 
	//		МенеджерЗаписи.РелизСобственника = ТекЗапись.тек_Релиз; 
	//		МенеджерЗаписи.Прочитать(); 
	//		Если МенеджерЗаписи.Выбран() И МенеджерЗаписи.ЗаписьИзДокумента Тогда
	//			Возврат;	
	//		КонецЕсли;
	//	
	//	   	РегистрыСведений.стоки_ТекущиеДанные.ЗаписатьОстатокКТККСдаче(ТекЗапись.тек_Релиз);

	//	КонецЕсли;
	//КонецЦикла;
	//Евросиб Коханенко Н.А. 10.07.2024 )) #88014 
	//)
	//Евросиб - АСуслов 13.08.2024 15:07:53 #89911

КонецПроцедуры  


#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
