//********************************************************************************************
//http://smbsec.ru/1cpredpriyatie/primer-assimetrichnogo-shifrovaniyarsa-1spredpriyatie-8.html
//Внимание! Приведенная информация распространяется исключительно в ознакомительных целях.
//Перед использованием данных материалов рекомендуется ознакомиться с ФЗ Российской Федерации
//от 4 мая 2011 г. N 99-ФЗ "О лицензировании отдельных видов деятельности".
//Обработка является примером работы с RSA из 1С:Предприятие 
//и выполняет для примера шифрование и расшифрование текста.
//********************************************************************************************


Функция СтрокаВДвоичныйВид(ВходнаяСтрока) Экспорт
	Поток = Новый COMОбъект("ADODB.Stream");
	Поток.Open();
	Поток.Type = 2;
	Поток.Charset = "utf-8";
	Поток.WriteText(ВходнаяСтрока);
	
	Поток.Position = 0;
	Поток.Type = 1;
	
	ДвоичныеДанные = Поток.Read(-1);
	
	Поток.Close();
	Поток = Неопределено;
	Возврат ДвоичныеДанные;
КонецФункции

Функция ДвоичныеДанныеВстроку(ДвоичныеДанные) Экспорт
	Поток = Новый COMОбъект("ADODB.Stream");
	Поток.Open();
	Поток.Type = 1;
	
	Поток.Write(ДвоичныеДанные);
	Поток.Position = 0;
	Поток.Type = 2;
	Поток.Charset = "utf-8";
	ВыхСтр = Поток.ReadText(-1);
	Поток.Close();
	Поток = Неопределено;
	Возврат ВыхСтр;
КонецФункции

Функция ДвоичныеДанныеВBase64(bin) Экспорт
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	Поток = Новый COMОбъект("ADODB.Stream");
	Поток.Open();
	Поток.Type = 1;
	Поток.Write(bin);
	Поток.SaveToFile(ИмяВременногоФайла, 1);
	Поток.Close();
	Поток = Неопределено;
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
	УдалитьФайлы(ИмяВременногоФайла);
	Возврат Base64Строка(ДвоичныеДанные);
КонецФункции

Функция Base64ВДвоичныеДанные(ВхСтрока) Экспорт
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ДвоичныеДанные = Base64Значение(ВхСтрока);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	Поток = Новый COMОбъект("ADODB.Stream");
	Поток.Open();
	Поток.Type = 1;
	Поток.LoadFromFile(ИмяВременногоФайла);
	ДвоичныеДанные = Поток.Read(-1);
	Поток.Close();
	Поток = Неопределено;
	
	УдалитьФайлы(ИмяВременногоФайла);
	Возврат ДвоичныеДанные;
	
КонецФункции

Функция Зашифровать(СтрокаДляШифрования)  Экспорт
	ОбъектШифрования = Новый COMОбъект("System.Security.Cryptography.RSACryptoServiceProvider");
	//Инициализация объект RSA, используя данные ключа из строки XML.
	//http://msdn.microsoft.com/ru-ru/library/system.security.cryptography.rsa.fromxmlstring.aspx
	ОбъектШифрования.FromXmlString(Константы.RSA_ПубличныйКлюч.Получить());
	//преобразование строки для шифрования в двоичный вид
	ИсхТекстДвоичн = СтрокаВДвоичныйВид(СтрокаДляШифрования);
	//шифруем
	ЗашифрованныйТекстДвоичн = ОбъектШифрования.Encrypt(ИсхТекстДвоичн, False);
	//преобразование зашифрованных данных в Base64
	ЗашифрованныйТекстСтр = ДвоичныеДанныеВBase64(ЗашифрованныйТекстДвоичн);
	Возврат ЗашифрованныйТекстСтр;
КонецФункции

Функция Расшифровать(ЗашифрованнаяСтрока) Экспорт
	ОбъектШифрования = Новый COMОбъект("System.Security.Cryptography.RSACryptoServiceProvider");
	ОбъектШифрования.FromXmlString(Константы.RSA_ПубличныйИПриватныйКлюч.Получить());
	ЗашифрованныйТекстДвоичн2 = Base64ВДвоичныеДанные(ЗашифрованнаяСтрока);
	РасшифрованныйТекстДвоичн = ОбъектШифрования.Decrypt(ЗашифрованныйТекстДвоичн2, False);
	//преобразование расшифрованных данных в строку
	РасшифрованныйТекстСтр = ДвоичныеДанныеВстроку(РасшифрованныйТекстДвоичн);
	Возврат  РасшифрованныйТекстСтр;	
	ОбъектШифрования = Неопределено;
КонецФункции

Процедура ПроверитьRSAКлючи()Экспорт
//генерируем новый приватный и публичный ключи
//в рабочей версии ключи требуется раздать пользователям и хранить
Если (Константы.RSA_ПубличныйИПриватныйКлюч.Получить()="") И (Константы.RSA_ПубличныйКлюч.Получить()="") Тогда
RSA_Шифрование.RSAСоздатьКлючи("","");		
КонецЕсли; 
КонецПроцедуры

Процедура RSAСоздатьКлючи(КлючШифрования, КлючШифрованияИРасшифрования) Экспорт
	//http://msdn.microsoft.com/ru-ru/library/system.security.cryptography.rsa.toxmlstring.aspx	
	ОбъектКриптографии				= Новый COMОбъект("System.Security.Cryptography.RSACryptoServiceProvider");
	КлючШифрования					= ОбъектКриптографии.ToXmlString(False);
	КлючШифрованияИРасшифрования 	= ОбъектКриптографии.ToXmlString(True);
	Константы.RSA_ПубличныйИПриватныйКлюч.Установить(КлючШифрованияИРасшифрования);
	Константы.RSA_ПубличныйКлюч.Установить(КлючШифрования);
	ОбъектКриптографии 				= Неопределено;
КонецПроцедуры