
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтборКонтрагент = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры.Отбор, "Контрагент");
	Если ЗначениеЗаполнено(ОтборКонтрагент) Тогда
		КонтрагентНерезидент = Справочники.Контрагенты.КонтрагентНерезидент(ОтборКонтрагент);
		Элементы.Список.ИзменятьСоставСтрок = КонтрагентНерезидент;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные.Контрагент) Тогда
		КонтрагентНерезидент = ПолучитьПризнакКонтрагентНерезидент(ТекДанные.Контрагент);
		Если Не КонтрагентНерезидент Тогда			
			Отказ = Истина;
			ПоказатьПредупреждение(, "Удаление данных руководителя контрагента резидента недоступно!");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПризнакКонтрагентНерезидент(Контрагент)
	
	Возврат Справочники.Контрагенты.КонтрагентНерезидент(Контрагент);
	
КонецФункции